{
 "id": "617430",
 "text": "General Santos City or General Santos, also known former named as Dadiangas, is a city in the Philippines. It is considered the tuna capital of the Philippines, located at Southern Central Mindanao in Soccsksargen region. It is classified as a highly urbanized city. It ranges from generally flat with scattered hills to isolated mountains. It neighbors the provinces of South Cotabato and Sarangani. General Santos is an independent city from South Cotabato. == Tourism == General Santos City celebrates the \"Kalilangan Festival\" every month of February. It is a social gathering marked by exchanging of amenities among traditional leaders, elders, allies, and subordinates in varying tones. The Tuna Festival is also celebrated on the 5th of September. This is why it is called the \"Tuna Capital of the Philippines, The Pacquiao Mansion is one of the places most often visited in this city. People usually take pictures in the front of Pacquiao's mansion. Another place to go is the Plaza Heneral. It is actually a big rotunda in the city in the front the city hall. There is also a big monument dedicated to General Paulino Santos, the namesake of this town. He was born in Camiling, Tarlac. A very popular tuna fish port is located at Brgy. This port is the most modern fish port in both Mindanao and the whole Philippines. == Plaza Heneral == Plaza Heneral, dedicated to General Paulino Santos, is placed on a 4.8 hectare land owned by the government of Philippines. People from different walks of life can enjoy the park day and night. == Transportation == Buses, modern service vehicles, and air transportation are served in General Santos. The General Santos International Airport is also called General Santos City Airport. It is a significant hub for Philippine Airlines, Cebu Pacific, AirAsia and other airlines. ==Other websites== * Official Website of the City of General Santos * Philippine Standard Geographic Code Category:Cities in the Philippines Category:South Cotabato",
 "title": "General Santos City"
}