{
 "id": "61817",
 "text": "A hypothesis is a proposed explanation for some event or problem. For a scientific hypothesis, the scientific method requires that one can test it.The term comes from the Greek, hypotithenai meaning \"to put under\" or \"to suppose\".Bunge, Mario 1967. Scientific research I: the search for system. Berlin: Springer Verlag, Chapter 5, p222. ==History== In the early 17th century, Cardinal Bellarmine gave a well known example of the older sense of the word in his warning to Galileo: that he must not treat the motion of the Earth as a reality, but merely as a hypothesis. Today, a hypothesis refers to an idea that needs to be tested. A hypothesis needs more work by the researcher in order to check it. A tested hypothesis that works may become part of a theory—or become a theory itself. The testing should be an attempt to prove that the hypothesis is wrong. That is, there should be a way to falsify the hypothesis, at least in principle if not in practice. People often call a hypothesis an \"educated guess\". :\"When it is not clear under which law of nature an effect or class of effect belongs, we try to fill this gap by means of a guess. Such guesses have been given the name conjectures or hypotheses\". Hans Christian Ørsted (1811) First introduction to general physics ¶18. Selected Scientific Works of Hans Christian Ørsted, p297. :\"In general we look for a new law by the following process. First we guess it. ...\" Richard Feynman (1965) The character of physical law. p156 Experimenters may test and reject several hypotheses, before solving the problem or reaching a satisfactory theory. A 'working hypothesis' is just a rough kind of hypothesis that is provisionally accepted as a basis for further research.Oxford Dictionary of Sports Science & Medicine Eprint via Answers.com The hope is that a theory will be produced, even if the hypothesis ultimately fails.See in \"hypothesis\", Century Dictionary Supplement, v. 1, 1909, New York: Century Company. Reprinted, v. 11, p. 616 (via Internet Archive) of the Century Dictionary and Cyclopedia, 1911. Hypotheses are especially important in science. Several philosophers have said that without hypotheses, there could be no science.Medawar P.B. & J.S. 1983. Aristotle to zoos: a philosophical dictionary of biology. Harvard University Press, p148. In recent years, philosophers of science have tried to integrate the various approaches to testing hypotheses (and the scientific method in general), to form a more complete system. The point is that hypotheses are suggested ideas, which are then tested by experiments or observations. == Statistics == In statistics, people talk about correlation: correlation is how closely related two events or phenomena are. A proposition (or hypothesis) that two events are related cannot be tested in the same way as a law of nature can be tested. An example would be to see if some drug is effective to treat a given medical condition. Even if there is a strong correlation that indicates that this is the case, some samples would still not fit the hypothesis. There are two hypotheses in statistical tests, called the null hypothesis, often written as H_0, and the alternative hypothesis, often written as H_a. The null hypothesis states that there is no link between the phenomena,or that the link does not have the form given by the alternative hypothesis and is usually assumed to be true until it can be proven wrong beyond a reasonable doubt. The alternative hypothesis states that there is some kind of link. It is usually the opposite of the null hypothesis, and is what one would conclude if null hypothesis is rejected. The alternative hypothesis may take several forms. It can be two- sided (for example: there is some effect, in a yet unknown direction) or one- sided (the direction of the supposed relation, positive or negative, is fixed in advance). == Related pages == * Falsifiability * Gaia hypothesis * Logic * Null hypothesis * Occam's razor * Statistical hypothesis test * Thought experiment == References == == Other websites == * Research and evaluation glossary * Analysis and synthesis - on scientific method, based on a study by Bernhard Riemann from the Swedish Morphological Society Category:Research methods Category:Philosophy of science",
 "title": "Hypothesis"
}