{
 "id": "61827",
 "text": "A spectrometer is an optical instrument used to measure properties of light over a specific portion of the electromagnetic spectrum. The independent variable is usually the wavelength of the light. The variable measured is most often the light's intensity but could also, for instance, be the polarization state. A spectrometer is used in spectroscopy for producing spectral lines and measuring their wavelengths and intensities. Spectrometer is a term that is applied to instruments that operate over a very wide range of wavelengths, from gamma rays and X-rays into the far infrared. In general, any particular instrument will operate over a small portion of this total range because of the different techniques used to measure different portions of the spectrum. Below optical frequencies (that is, at microwave, radio, and audio frequencies), the spectrum analyzer is a closely related electronic device. ==Spectroscopes== Spectrometers are used in spectroscopic analysis to identify materials. Spectroscopes are used often in astronomy and some branches of chemistry. Early spectroscopes were simply a prism with graduations marking wavelengths of light. Modern spectroscopes, such as monochromators, generally use a diffraction grating, a movable slit, and some kind of photodetector, all automated and controlled by a computer. The spectroscope was invented by Gustav Robert Georg Kirchhoff and Robert Wilhelm Bunsen. == Reference works == * How to work with the spectroscope : a manual of practical manipulation with spectroscopes of all kinds :1882; Browning, John (1835-1925) NOT_IN_COPYRIGHT - online full-text download ==Related pages== * Spectroscopy == Other websites == * How to design a spectroscope * A CD spectrometer Build from CD and cereal box - Spectrographs of common light sources * Supplement: Build Yourself a Simple Hand-Held Spectrograph Sample spectra * SPECTROSCOPY FOR THE SCHOOL Build a simple spectroscope from a CD * CD spectrometer CD + cardboard tube or cereal box * Construction photos, razor-blade slit * MiniSpectroscopy displays a visual representation (a \"spectroscope view\") of a sample spectrum simultaneously with a graphical (intensity vs. wavelength) representation. Category:Physics Category:Laboratory equipment",
 "title": "Spectrometer"
}