{
 "id": "618699",
 "text": "Since the version 2.3 (Gingerbread) of Google's Android operating system an easter egg containing an animation has been hidden. The easter egg can be accessed through the \"Settings\" application, in the \"About phone\" section, by repeatedly tapping the \"Android version\" section. The animation is different in every version of the Operating System.TDW. \"Google Gravity, Anit-Gravity and Many More Google Search Tricks\" , The Digital Worm (2017) * In 2.3 – 2.3.7 (Gingerbread) there is a painting of an Android next to a zombie gingerbread man, surrounded by zombies using cellphones. * In 3.0 – 3.2.6 (Honeycomb) there is a blue honeybee. Below it, there is the text \"REZZZZZZZ…\" as a reference to Tron: Legacy. * In 4.0 – 4.0.4 (Ice Cream Sandwich) there is pixel art of an ice cream sandwich android. Long-pressing it will result in many ice cream sandwich androids flying across the screen, dubbed the \"nyan droid\" as they are a tribute to Nyan Cat. * In 4.1 – 4.3.1 (Jelly Bean) a red jelly bean appears, which if pressed will show its face along with the OS version. If this jelly bean is then long-pressed, an interactive jelly bean minigame will appear. This is where one can fling the jelly beans around. * In 4.4 (KitKat) a rotating letter \"K\" appears, which if continually tapped turns into the text \"Android\" in the styling of a KitKat logo. If the Android logo is then long-pressed a tile interface, known as \"a daydream\" called \"Dessert Case\", loads with icons from all previous versions of Android. It appears to be a mock of the Windows Phone interface. * In 5.x (Lollipop) and 6.x (Marshmallow), a colored circle appears (or a circle with a stylized M inside in Marshmallow). If continuously tapped, it will turn into a lollipop with the text lollipop inside (or the M changes into a marshmallow in 6.x). Tapping the circle changes the color. When long-pressed, a game of Flappy Bird starts with the Android mascot instead. In Marshmallow, tapping the plus sign adds extra players (up to five), which can be controlled by the user or other players. * In 7.0 (Nougat), an \"N\" appears, which will enable another Easter egg if tapped. This Easter egg, titled \"Android Neko\" as a reference to the cat collecting mobile game Neko Atsume, can be accessed from the Quick Settings menu, and allows the user to create virtual treats, which will eventually attract kittens. The kittens can be viewed in a gallery-style screen. Additionally, long-pressing on the aforementioned \"N\" repeatedly will alternate between displaying the no symbol emoji and the cat face emoji, respectively toggling the Easter egg on and off. \"No\" and \"cat\" is a mondegreen for \"nougat\". * In 8.0 (Oreo), instead of the normal way of going to the easter egg, heading to System > About Phone and tapping on the Android version repeatedly will launch the easter egg. An orange circle appears, representing an \"O\" for Oreo. Tapping on it a few times will open a blue screen representing a sea with an octopus floating around. The \"O\" in octopus represents Oreo while the eight legs on the octopus represent the version (8.0). The octopus can be moved by dragging the head around. This goes with Android 8.1 Oreo, but instead of the orange O is an Oreo cookie with Bugdroid in it. * In 9.0 (Pie), the Easter egg is found by going to System > About Phone > Android version and then tapping three times on the Android version on the next screen. A white, extended \"P\" will then appear, usually with concentric colored circles disappearing into the \"P\". Each time the Easter egg is invoked, it displays different colors. The animation can be pinched to zoom. *In 10.0 (10), the text \"android 10\" will appear, where each of the texts \"android\", \"1\", and \"0\" can be moved and rotated. Rotating \"1\" and merging with the digit \"0\" will result in the \"android Q\" text. In this state, tapping the \"Q\" several times will reveal a Nonogram game, where the resulting pictures are various icons of Android. *In 11.0 (Dots), a circle with 9 white dots around the circle and 1 other dot inside the circle the perimeter will appear. Dragging your finger around the circle will change the inside dots position. When the dot inside dot is at the last white dots space, there will be a text saying '11'. Then a message with the emoji '🐱' will appear. When dragging the inner dot back to the first white dot there will be a message saying '🚫' *In 12.0 and 13.0 (Clock), an interactive clock will appear. Setting the clock time to 12:00 (or 1:00 for Android 13) will change the clock to a circle with text inside that says '12' (or, on Android 13, '13') and many circles will appear in the background. *In 14.0 and 15.0, the Android 14 (or 15) logo appears. Long pressing the logo will make the phone vibrate, then an interactive space open world game appears, with stars and planets set at realistic distances. Android Gingerbread Easter eggs.jpg|Gingerbread Android Honeycomb Easter eggs.jpg|Honeycomb Android Ice Cream Sandwich Easter eggs.jpg|Ice Cream Sandwich Android Jelly Bean Easter eggs.jpg|Jelly Bean Android KitKat Easter eggs.jpg|KitKat Android Lollipop Easter eggs.jpg|Lollipop Android Marshmallow Easter eggs.jpg|Marshmallow Android Nougat Easter eggs.jpg|Nougat Android Oreo Easter eggs.jpg|Oreo Android Pie Easter eggs.jpg|Pie Android Q Easter eggs.jpg|10 (Q) == References == Category:Google",
 "title": "List of Google Easter eggs"
}