{
 "id": "619248",
 "text": "Aap Ke Aa Jane Se is an Indian television soap opera drama. The series premiere on 15 January 2018 and it is currently airing on Zee TV. The series is produced by Budhi Tree Multimedia PVLD, and the series was started by Karan Jotwani as Sahil and Suhasi Dhami as Vedhika. ==overview== Sahil and Vedika fall in love with each other , Despite Vedika being 18 years older than sahil. Will their love be strong enough to overcome all troubles they are about to face? ==Cast== * Karan Jotwani as Sahil Agarwal * Suhasi Dhami as Vedhika Mathur * Geeta Tyagi as Badi amma * Resha Konkar as Gauri Deepak Agarwal * Sailesh Gulabani as Deepak Agarwal * Kshitija A Saxena as Shruti Agarwal * Shaily Priya as Nidhi * Mohit Dagga as Ghautam * Amit Baanusali as Karan * Nidhi Mathur as Prachi Tiwari * Sahil Kashyap as Tiwari == Plot Summary == The show’s story is divided into two seasons and involves multiple twists and turns that connect the characters across lifetimes. === Season 1 === Vedika Mathur, a 42-year-old single mother living in Kanpur with her mother, Manjula, and daughter, Arya, faces financial difficulties due to her middle-class status. Sahil Agarwal, a 24-year-old irresponsible young man, returns home after completing his studies. Sahil’s elder aunt, Bimla, arranges his marriage with his friend Nidhi, but he rejects the proposal and is thrown out of the house. In need of money, Vedika rents out a room in her house to Sahil, believing that he is married. Sahil hides the truth from Vedika because he knows she would not allow him to stay otherwise. Over time, Vedika and Sahil fall in love, but Vedika is hesitant to accept their relationship due to societal norms and their significant age difference. Eventually, she comes to terms with her feelings and accepts Sahil’s love. On the day of their wedding, a misunderstanding occurs, and Vedika ends up switching places with Nidhi, almost marrying her instead. Sahil believes their marriage is invalid and denies completing the wedding rituals. Complications arise as Sahil’s cousin, Yash, blackmails Vedika into marrying him, and she agrees because she has feelings for Sahil. In a series of events, Yash is diagnosed with cancer and requests Vedika to give him a child through IVF. Due to a nurse’s mistake, Sahil becomes the sperm donor for Yash and Vedika’s child. After Yash’s death, Bhumi, Vedika’s distant cousin, comes to stay with her. === Season 2 === The second season picks up after a time leap of five years. Vedika returns to Kanpur with her daughter, Sadika, while Sahil lives with Bhumi and their adopted son, Ved. Arya returns to India after completing her studies. Various revelations come to light as Vedika discovers that Sadika is Gauri and Deepak’s daughter, and Ved is her real son. Sahil also learns that Ved is his biological child and that his mother, Anjana, was killed by Bimla. Enraged, Sahil leaves Bhumi and reunites with Vedika. Bimla continues her malicious acts, poisoning Sahil’s mind against Vedika, leading to their separation once more. Vedika is accused of abandoning her child, and Sahil, in a fit of rage, marries her cousin Bhumi. Vedika later gives birth to another son, Virat. Tragic events unfold as Sahil falls off a cliff and is declared dead, only to reappear later with lost memories. He unintentionally marries Pankti, a woman facing issues with her father, Tej Pratap Singh, a politician. Meanwhile, Vedika and Sahil’s love story transcends generations, with past life connections becoming apparent. The show explores how the characters navigate through love, loss, and revenge across lifetimes, ultimately striving to be together and complete their love story. ==References== ==Other websites== * * Category:2018 Indian television series debuts Category:2010s soap operas",
 "title": "Aap Ke Aa Jane Se"
}