{
 "id": "619227",
 "text": "The following is a list of deaths that should be noted in February 2018. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==February== ===1=== * Omar Aggad, 90, Palestinian-born Saudi Arabian businessman (Arab Palestinian Investment Company) and philanthropist.الزعنون ينعى عضو المجلس الوطني عمر العقاد * Niranjan Bhagat, 91, Indian poet (Gujarati Sahiyta-Purvardha Uttarardha), stroke.Veteran Gujarati poet, litterateur Niranjan Bhagat passes away * Hazar Khan Bijarani, 71, Pakistani politician, MP (1990–1993, 1997–2013), suicide by gunshot.Sindh minister Mir Hazar Khan Bijarani, wife found shot dead in Karachi home * Dennis Edwards, 74, American Hall of Fame soul and R&B; singer (The Temptations), stroke complicated from meningitis.Legendary Temptations singer Dennis Edwards, of Florissant, dies at 74 * Édouard Ferrand, 52, French politician, MEP (since 2014), cancer.Décès de l'eurodéputé FN Édouard Ferrand à l'âge de 52 ans * Barys Kit, 107, Belarusian-American astrophysicist and mathematician, pneumonia.Barys Kit's obituary * John Jacob Lavranos, 91, South African- Portuguese insurance broker and botanist, stroke.Lavranos, John Jacob * Su Bai, 95, Chinese archaeologist, specialist in Buddhist grottoes.考古学泰斗宿白病逝 ===2=== * Dave Barrett, 87, Canadian politician, Premier of British Columbia (1972–1975), Alzheimer's disease.Dave Barrett dead: former B.C. premier was the NDP's first in office * Jon Huntsman Sr., 80, American businessman (Huntsman Corporation) and philanthropist, White House Staff Secretary (1971–1972), prostate cancer.Utah billionaire philanthropist Jon Huntsman dies at 80 * Joseph Polchinski, 63, American theoretical physicist and string theorist.Joe Polchinski (1954-2018): La teoría de cuerdas está de luto * Ole Thestrup, 69, Danish actor (Borgen, The Green Butchers, Adam's Apples), lung cancer.Ole Thestrup er død ===3=== * Michael Harner, 88, American anthropologist and author.In memoriam Michael J. Harner (1929-2018) * Károly Palotai, 82, Hungarian football player (ETO, national team) and referee (FIFA, UEFA, IOC), Olympic champion (1964), stroke.Gyász: 82 éves korában elhunyt Palotai Károly * Dirk Bernard Joseph Schouten, 95, Dutch economist, member of the Royal Netherlands Academy of Arts and Sciences (since 1975).In Memoriam Dirk Schouten (1923 – 2018) * Hukum Singh, 79, Indian politician, MP (since 2014), respiratory arrest.BJP MP from Kairana Hukum Singh dies aged 79 * Rolf Zacher, 76, German actor (Jaider, der einsame Jäger, Angelo und Luzy, Rising to the Bait), complications from COPD.Rolf Zacher ist tot - In der Rolle des Ganoven ===4=== * Zvi Arad, 75, Israeli mathematician, President of Netanya Academic College (since 1994).Professor Zvi Arad passes away * Alan Baker, 78, English mathematician, recipient of the Fields Medal (1970). * Jack Davis, 82, American politician, member of the U.S. House of Representatives from Illinois's 4th congressional district (1987–1989), dementia.Jack Davis, Former Congressman Turned WMAY/Springfield, MA Talk Host, Dies At 82 * Martin Grüner, 88, German politician.Über viele Jahre in höchster politischer Liga gespielt * Kenneth Haigh, 86, British actor (Man at the Top, Cleopatra, Eagle in a Cage), complications from cerebral edema.Kenneth Haigh * Edwin Jackson, 26, American football player (Indianapolis Colts, Arizona Cardinals), car crash.Colts player Edwin Jackson, Avon man killed by suspected drunken driver on I-70 * John Mahoney, 77, English-American actor (Frasier, In the Line of Fire, Say Anything…), Tony Award winner (1986), complications from epilepsy and lung and throat cancer.‘Frasier’ Star John Mahoney Dies at 77 * Séamus Pattison, 81, Irish politician, TD (1961–2007) and MEP (1981–1983), Parkinson's disease.Honorary Freeman of Kilkenny City and former Ceann Comhairle, Seamus Pattison has passed away * Wojciech Pokora, 83, Polish actor (Zmiennicy, Man – Woman Wanted, A Jungle Book of Regulations), complications from a stroke.Wojciech Pokora nie żyje ===5=== * Margot Duhalde, 97, Chilean pilot (Air Transport Auxiliary).Muere Margot Duhalde, pionera de la aviación femenina chilena * Yoshihide Kozai, 89, Japanese astronomer, President of the International Astronomical Union (1988–1991), liver failure.【訃報】古在由秀先生 ===6=== * Liliana Bodoc, 59, Argentine author (La Saga de los Confines), heart attack.Murió la escritora Liliana Bodoc * Doug Guetzloe, 63, American conservative political consultant and anti-tax activist (Ax the Tax), cardiac arrest.Doug Guetzloe, conservative political consultant, dead at 63 * Jao Tsung-I, 100, Chinese-born Hong Kong scholar, calligrapher and painter.Renowned Sinologist Jao Tsung-I dies at 101 * Joe Knollenberg, 84, American politician, member of the U.S. House of Representatives from Michigan's 9th and 11th congressional districts (1993–2009), Alzheimer's disease.Friend: Ex-Rep. Knollenberg dead at 84 * Débora Pérez Volpin, 50, Argentine journalist (Todo Noticias, Arriba Argentinos) and politician, member of the Buenos Aires City Legislature (since 2017), cardiopulmonary arrest.Murió Débora Pérez Volpin, diputada porteña y periodista * Madavoor Vasudevan Nair, 87, Indian Kathakali dancer, multiple organ failure.Kathakali maestro Madavoor Vasudevan Nair passes away ===7=== * John Perry Barlow, 70, American writer, lyricist (Grateful Dead) and internet activist, co-founder of Electronic Frontier Foundation, complications from a heart attack.John Perry Barlow, open internet champion and Grateful Dead lyricist, dies at 70 * Mickey Jones, 76, American drummer (Kenny Rogers and The First Edition, The Band) and actor (Home Improvement, National Lampoon's Vacation, Tin Cup).Veteran Character Actor Mickey Jones Dies at 76 * Newton Morton, 88, American epidemiologist.Newton Morton * Nabi Şensoy, 73, Turkish diplomat, Ambassador to the United States (2006–2009).ATAA Mourns the Passing of Ambassador Nabi Sensoy * Pat Torpey, 64, American drummer (Mr. Big), complications from Parkinson's disease.Mr. Big Drummer Pat Torpey Dies At 64 ===8=== * Ben Agajanian, 98, American football player (Philadelphia Eagles, San Diego Chargers, New York Giants), cardiopulmonary arrest.Ben Agajanian, Square-Shoed Kicking Star, Dies at 98 * Paul Danblon, 86, Belgian journalist (RTBF), science writer (150 ans de sciences (1830–1980)) and composer, pulmonary edema.Paul Danblon, l'ancien directeur de l'ORW, est décédé * John Martinkovic, 91, American football player (Green Bay Packers, New York Giants), complications from dementia.Former Packers DE John Martinkovic passes away * Ebony Reigns, 20, Ghanaian singer (\"Poison\", \"Kupe\", \"Dancehall\"), car crash.Ebony Reigns dead: Ghanaian singer dies in horrific car crash aged 20 * Lovebug Starski, 57, American rapper and disc jockey, heart attack.DJ Lovebug Starski Passes Away At 57 ===9=== * Reg E. Cathey, 59, American actor (The Wire, House of Cards, Fantastic Four), Emmy winner (2015), lung cancer.Reg Cathey, ‘House of Cards’ and ‘The Wire’ Actor, Dies at 59 * Michael Crouch, 84, Australian businessman (Zip Industries), complications from Parkinson's disease.Michael Jenkins Crouch * Jim Garrett, 87, American football player (Lions), coach (Columbia Lions) and scout (Dallas Cowboys), bronchitis.Longtime Cowboys scout, father of Jason Garrett dies at 87 * John Gavin, 86, American actor (Psycho, Imitation of Life, Spartacus) and diplomat, Ambassador to Mexico (1981–1986), pneumonia.John Gavin, Actor in 'Psycho' and 'Imitation of Life,' Dies at 86 * Nebojša Glogovac, 48, Serbian actor (Tomorrow Morning, Klopka, 72 Days), brain cancer.Popular Serbian Actor Neboja Glogovac Dies * Jóhann Jóhannsson, 48, Icelandic movie composer (The Theory of Everything, Arrival, Sicario), Golden Globe winner (2015), accidental cocaine overdose.Jóhann Jóhannsson Dies: ‘The Theory Of Everything’ Composer Was 48 * Alfonso Lacadena, 53, Spanish Mesoamerican epigraphist and academic (Complutense University of Madrid), lymphoma.Hoy, 9 de Febrero de 2018, falleció en Madrid, el Dr. Alfonso Lacadena García-Gallo. * Craig MacGregor, 68, American bass guitarist (Foghat), complications from lung cancer.Foghat Bassist Craig MacGregor Dies At 68 * Liam Miller, 36, Irish footballer (Manchester United, Sunderland, national team), pancreatic cancer.Liam Miller: Former Celtic and Manchester United midfielder dies aged 36 * Wally Moon, 87, American baseball player (St. Louis Cardinals, Los Angeles Dodgers), skin cancer.Former Texas A&M; great, MLB star Wally Moon dies at 87 * Anne Treisman, 82, English-born American psychologist (Feature integration theory), recipient of the National Medal of Science (2011).Anne Treisman, 1935-2018 ===10=== * Jeff Bell, 74, American political consultant, presidential speechwriter (Ronald Reagan) and politician, suspected heart attack.3-time U.S. Senate candidate Jeff Bell dies * Bevan Congdon, 79, New Zealand cricketer (Central Districts, Canterbury, national team).Cricket: Former New Zealand cricket captain Bevan Congdon passes away ===11=== * Vic Damone, 89, American pop singer-songwriter (\"On the Street Where You Live\", \"You're Breaking My Heart\", \"My Heart Cries for You\"), complications from respiratory failure.Legendary singer Vic Damone dies at age 89 * Jon D. Fox, 70, American politician, member of the U.S. House of Representatives from Pennsylvania's 13th congressional district (1995–1999), complications from liver cancer.Former GOP Congressman Jon Fox dead at 70 * Asma Jahangir, 66, Pakistani human rights activist and lawyer, President of the Supreme Court Bar Association (2010–2012) and Special Rapporteur on Human Rights in Iran (since 2016), cerebral hemorrhage complicated by cardiac arrest.Asma Jahangir Passes Away in Lahore at 66 * Jan Maxwell, 61, American actress (Chitty Chitty Bang Bang, Follies, BrainDead), leptomeningeal carcinomatosis complicated from breast cancer.Broadway Star Jan Maxwell Dies at 61 * Sir Nicholas Shehadie, 92, Australian rugby union player (Randwick, New South Wales, national team) and politician, Lord Mayor of Sydney (1973–1975).Former Wallaby Sir Nicholas Shehadie dead, aged 92 ===12=== * Marty Allen, 95, American actor (The Last of the Secret Agents?) and comedian (Allen & Rossi), complications from pneumonia. * Martin van der Borgh, 83, Dutch racing cyclist, stroke.Oud- Tourrenner Mart van der Borgh overleden * Leo Falcam, 82, Micronesian politician, President of the Federated States of Micronesia (1999–2003), Vice President (1997–1999) and Governor of Pohnpei (1979–1983). * Giuseppe Galasso, 88, Italian historian and politician, Deputy (1983–1994), prostate cancer.Morto lo storico Giuseppe Galasso * Luo Haocai, 83, Chinese politician, Chairman of the China Zhi Gong Party (1997–2007).全国政协原副主席罗豪才逝世 * Ursula B. Marvin, 96, American planetary geologist. * Grant McBride, 68, Australian politician, member of the Parliament of New South Wales (1992–2011), Alzheimer's disease. * Alexander B. Morrison, 87, Canadian-born American religious leader, General Authority of the LDS Church (since 1987). * Fethia Mzali, 90, Tunisian educator and politician, Minister of Family and Women Promotion (1983–1986), congestive heart failure.Fethia Mzali, ancienne présidente de l’UNFT, n’est plus * Rudy Regalado, 87, American baseball player (Cleveland Indians), pulmonary embolism.Rudolph Valentino Regalado * Daryle Singletary, 46, American country music singer (\"I Let Her Lie\", \"Amen Kind of Love\", \"Too Much Fun\"), blood clot. ===13=== * Edward M. Abroms, 82, American movie editor (Blue Thunder, The Sugarland Express, Street Fighter) and television director (The Eddie Capra Mysteries), Emmy winner (1972), heart failure.Edward Abroms, Steven Spielberg's First Film Editor, Dies at 82 * Dobri Dobrev, 103, Bulgarian ascetic and philanthropist.Elder Dobri passes away at 103 * Tito Francona, 84, American baseball player (Cleveland Indians, Atlanta Braves, Baltimore Orioles).Tito Francona, former major leaguer and father of Indians manager Terry Francona, dies at age 84 * Henrik, Prince Consort of Denmark, 83, French-born Danish royal, Consort (since 1972), pneumonia complicated from lung cancer.Denmark's Prince Henrik, Who Refused to Be Buried Next to His Wife the Queen, Dies at 83 * Josefina Samper, 90, Spanish communist and feminist.Muere Josefina Samper, mujer, camarada y compañera de Marcelino Camacho ===14=== * Abolfazl Anvari, 80, Iranian wrestler, world championship bronze medalist (1966, 1969).پرچم دار ایران در بازی‌های المپیک مکزیکو سیتی درگذشت * Lerone Bennett Jr., 89, American scholar, author (Before the Mayflower, Forced into Glory) and editor (Ebony), vascular dementia.Lerone Bennett Jr., legendary chronicler of black life, dies * Don Carter, 84, American businessman, founding owner of the Dallas Mavericks. * Antoni Krauze, 78, Polish screenwriter (Smolensk) and director (Strach, Black Thursday), heart attack.Antoni Krauze nie żyje. Reżyser miał 78 lat * Ruud Lubbers, 78, Dutch politician and diplomat, Prime Minister (1982–1994), and United Nations High Commissioner for Refugees (2001–2005).Ruud Lubbers, former Dutch prime minister, dies * Morgan Tsvangirai, 65, Zimbabwean politician, Prime Minister (2009–2013) and President of the Movement for Democratic Change – Tsvangirai (since 1999), colorectal cancer.Morgan Tsvangirai, Zimbabwe opposition leader, dies aged 65 ===15=== * Abdilaqim Ademi, 48, Macedonian politician, Minister of Education and Science (since 2014).Ndërron jetë Abdylaqim Ademi, varrimi bëhet sot * Lassie Lou Ahern, 97, American actress (Our Gang, Uncle Tom's Cabin, Little Mickey Grogan), complications from influenza.Lassie Lou Ahern, Child Actress in the 'Our Gang' Comedies, Dies at 97 * Abdon Alinovi, 94, Italian politician, Deputy (1976–1992), Alzheimer's disease.È morto Abdon Alinovi, dirigente PCI, presidente Antimafia, una vita per i deboli * Tom Brewer, 86, American baseball player (Boston Red Sox).Thomas Austin Brewer Jr. * Don J. Briel, 71, American theologian, leukemia. * Pier Paolo Capponi, 79, Italian actor (The Cat o' Nine Tails, Valerie Inside Outside, A Season of Giants).Addio a Pier Paolo Capponi, attore di cinema e tv, da Fernando Di Leo a Mara Venier * Milan Křížek, 91, Czech composer and violinist, complications from Alzheimer's disease.Zemřel skladatel Milan Křížek ===16=== * Barbara Alston, 74, American singer (The Crystals), complications from influenza.Lead singer for ‘60s girl group behind hits like ‘Da Doo Ron Ron’ dies in Charlotte * Jim Bridwell, 73, American free climber, complications from hepatitis C. * Heli Lääts, 85, Estonian singer.Őhtuleht Armastatud lauljatar Heli Lääts oma viimasel eluaastal: „Olen viimaks ometi endaga rahu teinud. 16 February 2018. Retrieved 18 February 2018. * Hans Rinner, 54, Austrian businessman and football official (Austrian Football Bundesliga, Sturm Graz), pancreatic cancer.Bundesliga Praesident Rinner 54 jaehrig an Krebs verstorben * Little Sammy Davis, 89, American blues singer-songwriter (\"I Ain't Lyin'\", \"Ten Years and Forty Days\", \"Travelin' Man\") and harmonicist, heart failure.Death of Little Sammy Davis * Osvaldo Suárez, 83, Argentine long-distance runner.Murió Osvaldo Suárez ===17=== * Blas Calzada Terrados, 80, Spanish economist, Chairman of INE (1977–1979) and President of CNMV (2001–2004), stomach cancer.Muere Blas Calzada, ex presidente de la CNMV * Beebe Freitas, 79, American pianist and vocal coach (Hawaii Opera Theatre), congestive heart failure.Gifted isle musician helped others reach their potential * Gerald Weiß, 58, German javelin thrower.Früherer Speerwerfer Gerald Weiß verstorben ===18=== * Günter Blobel, 81, Silesian-born American biologist, Nobel Prize laureate (1999), prostate cancer.Medizin-Nobelpreisträger Günter Blobel gestorben * Peggy Cooper Cafritz, 70, American social activist and educator, co-founder of the Duke Ellington School of the Arts, complications from pneumonia.Peggy Cooper Cafritz, Co-Founder of Duke Ellington School of the Arts, Has Died * Didier Lockwood, 62, French jazz violinist (Magma), heart attack. * Georgi Markov, 46, Bulgarian footballer (Pirin Gotse Delchev, national team, Lokomotiv), heart attack.Почина бившият футболен национал Георги Марков * Idrissa Ouédraogo, 64, Burkinabé movie director (Tilaï, Samba Traoré, The Heart's Cry).Burkina filmmaker Ouedraogo dead at 64 – The Citizen * Pavel Panov, 67, Bulgarian football player (Septemvri Sofia, national team) and coach (Levski Sofia), heart attack. ===19=== * Teresa Gisbert Carbonell, 91, Bolivian architect and art historian, President of the International Council on Monuments and Sites (1986–1992).Muere la historiadora boliviana Teresa Gisbert, madre de Carlos Mesa * Charles Pence Slichter, 94, American physicist, recipient of the National Medal of Science (2007), pneumonia.Charles Pence Slichter ===20=== * David Caron, 65, American legal scholar, heart attack.Berkeley Law Professor Emeritus David Caron ’83 Passes Away at 65 * Jiichiro Date, 66, Japanese wrestler, Olympic champion (1976), heart attack.モントリオール五輪金メダリスト・伊達治一郎さん転落死 * Herbert Ehrenberg, 91, German politician, Minister of Labour and Social Affairs (1976–1982). * Tōta Kaneko, 98, Japanese writer, pneumonia.金子兜太さん死去 戦後日本を代表する俳人 * Agnieszka Kotulanka, 61, Polish actress (Klan, Holy Week), dipsomania.Nie żyje Agnieszka Kotulanka. Aktorka miała 61 lat. * Waldo R. Tobler, 87, American geographer and cartographer. * Zigmas Zinkevičius, 93, Lithuanian linguist and historian, member of the Lithuanian Academy of Sciences (since 1982), recipient of the Herder Prize (1994), heart failure. ===21=== * Emma Chambers, 53, English actress (The Vicar of Dibley, Notting Hill, How Do You Want Me?), heart attack.Actress Emma Chambers dies aged 53, agency confirms * Lawrence D. Brown, 77, American statistician, member of the American Academy of Arts and Sciences (since 2013).Lawrence D. Brown * Billy Graham, 99, American evangelist and writer (How to Be Born Again), Parkinson's disease.Billy Graham, 'America's pastor,' dead at age 99 * John R. Schmidhauser, 96, American political scientist (University of Southern California) and politician, member of the U.S. House of Representatives from Iowa's 1st congressional district (1965–1967).In Memoriam: John R. Schmidhauser ===22=== * Nanette Fabray, 97, American actress (Caesar's Hour, The Band Wagon, One Day at a Time) and dancer, Emmy winner (1955, 1956) and Tony winner (1949).Nanette Fabray, Singer, Dancer and Comedienne, Dies at 97 * Forges, 76, Spanish cartoonist (El Jueves, Diario 16, El País), pancreatic cancer.Muere Forges, genial dibujante de medio siglo de historia de España * Bette Henritze, 93, American actress (The Hospital, The World According to Garp, Other People's Money).Bette Henritze * Richard E. Taylor, 88, Canadian physicist, Nobel Prize laureate (1990).Nobel Prize-winning physicist Richard Taylor dies at 88 ===23=== * James Colby, 56, American actor (Patriots Day, Tower Heist, Empire).Actor James Colby Passes Away at Age 56 * Lewis Gilbert, 97, British movie director (You Only Live Twice, Alfie, Educating Rita).In Memoriam of James Bond director Lewis Gilbert (1920-2018) * James Laxer, 76, Canadian political economist, co-founder of The Waffle, suspected heart attack.In Memoriam: James Laxer 1941 - 2018 * Wolfhart Westendorf, 93, Polish-born German Egyptologist (Grundriss der Medizin der alten Ägypter).Wolfhart Westendorf : Traueranzeige ===24=== * Shmuel Auerbach, 86, Israeli Haredi rabbi, heart disease.Rabbi Shmuel Auerbach dies at 86 * Sir Durward Knowles, 100, Bahamian sailor, Olympic champion (1964) and bronze medalist (1956), kidney failure.Bahamian Olympian Sir Durward Knowles dies at 100 * Bud Luckey, 83, American animator (Sesame Street), director (Boundin') and voice actor (Toy Story 3, Winnie the Pooh, The Incredibles), complications from a stroke.Disney and Pixar animator/voice actor Bud Luckey passes away * Folco Quilici, 87, Italian movie director (The Last Paradise, The Wind Blows Free, The Sixth Continent) and screenwriter (Dagli Appennini alle Ande), stroke.Addio a Folco Quilici, maestro dei documentari * Sridevi, 54, Indian actress (Himmatwala, Solva Sawan, English Vinglish), accidental drowning.Actor Sridevi passes away at 54 after suffering cardiac arrest * Óscar Julio Vian Morales, 70, Guatemalan Roman Catholic prelate, Archbishop of Santiago de Guatemala (since 2010), cancer.Fallece Monseñor Óscar Julio Vian, tras luchar contra el cancer ===25=== * Ainsley Gotto, 72, Australian political staffer (John Gorton) and interior designer, complications from cancer.Ainsley Gotto, former assistant to prime minister John Gorton has died ===26=== * Mies Bouwman, 88, Dutch television presenter (Eén van de acht, This Is Your Life), cardiomyopathy.Mies Bouwman (88) overleden * Li Boguang, 49, Chinese legal scholar and human rights activist, liver cancer.Sudden Death of Chinese Human Rights Lawyer Raises Suspicions * Giorgi Maisashvili, 55, Georgian economist and politician, 2008 presidential candidate, colorectal cancer.გია მაისაშვილი გარდაიცვალა ===27=== * William H. T. Bush, 79, American venture capitalist and financier, brother of George H. W. Bush and uncle of George W. Bush.William 'Bucky' Bush, chairman of Bush O'Donnell, dies * Luciano Benjamín Menéndez, 90, Argentine military officer and convicted human rights violator, complications from heart failure.Brutal Argentine 'Dirty War' ex-general Menendez dies at 90 * Quini, 68, Spanish football player (Sporting de Gijón, F.C. Barcelona, national team), heart attack.Muere Quini, leyenda del Sporting * Jacqueline Vaudecrane, 104, French figure skater, French Figure Skating champion (1937, 1938).Avis De Décès ===28=== * Barry Crimmins, 64, American comedian and social activist, subject of Call Me Lucky, cancer.Barry Crimmins dies at 64 * Antonio García-Trevijano, 90, Spanish lawyer, politician, and philosopher.Muere el jurista Antonio García-Trevijano a los 90 años * Rogelio Guerra, 81, Mexican actor (Mañana es para siempre, Rafaela, Amor Bravío), heart attack complicated from a stroke.Muere el actor Rogelio Guerra * Marc L. Marks, 91, American politician, member of the U.S. House of Representatives from Pennsylvania's 24th congressional district (1977–1983).Marc Marks * Albert Mkrtchyan, 81, Armenian director (The Tango of Our Childhood), actor (Tghamardik) and screenwriter (The Song of the Old Days).Ушел из жизни известный армянский режиссер Альберт Мкртчян * Jayendra Saraswathi, 82, Indian guru, Head of the Kanchi Kamakoti Peetham (since 1954), respiratory failure.Kanchi seer Jayendra Saraswathi passes away - The Hindu * Ștefan Tașnadi, 64, Romanian weightlifter, Olympic silver medalist (1984).Elhunyt Tasnádi István kolozsvári súlyemelő olimpikon ==Months== * January * March ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *2 Category:February 2018 events",
 "title": "Deaths in February 2018"
}