{
 "id": "61939",
 "text": "Pentecostalism is a faith within Evangelical Christianity. It believes in a personal experience with God through the baptism of the Holy Spirit (); the same as in the Biblical account on the Day of Pentecost. Pentecostalism is similar to the Charismatic groups, but it came about earlier and separated from the main church branches. Charismatic Christians, at least in the beginning, tended to stay in their denominations and did not divide away. == Beliefs == There are different types of Pentecostal churches. Most believe that people must be saved by believing in Jesus as their Savior; to be forgiven for their sins and to be pleasing to God. Pentecostals also believe, like most other evangelicals, that the Bible is true and must be obeyed in decisions of faith. Some groups say speaking in tongues is the sign of the Baptism of the Holy Spirit and is not required for salvation. Some say the Baptism of the Holy Spirit is a supernatural gift for ministry that people receive after they have become a Christian. Other groups believe in an \"\" based salvation. This means a person needs to repent and be baptized in the name of Jesus. They then receive the Holy Spirit (Holy Ghost). In this belief, the Holy Spirit is required for salvation; which includes speaking in tongues. Some Pentecostal churches baptize in the name of Jesus only, and some baptize in the name of the Father, the Son and the Holy Ghost or spirit. Pentecostal churches believe that Jesus still heals the sick, with the power of the Holy Spirit. They also believe in other gifts such as speaking in tongues, interpretation of tongues, supernatural knowledge, mainly about sickness or spiritual matters, and prophesy about future spiritual happenings. Many also practice exorcism, that is, casting out evil spirits. ==Statistics== See also: List of Christian denominations by number of members This list indicates that there may be 150 million Pentecostals. The largest Pentecostal denominations are: ===Denomination statistics=== * Assemblies of God 51 million * Independent - 50 million * Church of God in Christ - 9 million * Church of God (Cleveland, Tennesee) - 8.5 million * The Apostolic Church - 6 million * The Pentecostal Mission -6.7 million * United Pentecostal Church International - 4 million * Christ Apostolic Church - 2.8 million * Christian Congregation of Brazil- 2.5 million * Zion Christian Church - 2.5 million * Church of the Lord Aladura - 2.5 million * International Church of the Foursquare Gospel 2 million * Universal Church of the Kingdom of God - 2 million * Pentecostal Assemblies of Canada - 1 million * Christian Outreach Centre - less than 1 million * Christian City Church = less than 1 million * World Christian Ministries Association - less than 1 million While not as large as some of the above organizations the following have made quite an impact on Pentecostalism: * Northgate Pentecostals (Colleyville,) * Church of Jesus Christ of Prophecy (AKA Mercy Tabernacle, Benton Tennessee) * International Church of Jesus Christ (Columbus, Ohio) * Potter's House Christian Fellowship (Prescott, Arizona) * United Christian Church (Cleveland, Tennessee) * Igreja Pentecostal e Apostólica Missão Jesus (São Paulo, Brazil) * Revival Centres International and The Revival Fellowship in Australia ===Geographical distribution=== * Africa: 41.1 million ** Nigeria: 13.0 million (34.5 million ; 41.0 million ** Kenya: 4.1 million (18.94 million ) ** South Africa: 4.4 million (15.1 million ** Ethiopia: 2.6 million ** Ghana: 1.76 million * America: 58.9 million ** United States: Total of: 30 million; 20.2 million (30.0 million ; 80.0 million including Charismatics and Neo- charismatics ) ** Brazil: 15.0 million (20-90 million ; 84 million ) ** Argentina: 3.5 million ** Mexico: 2.7 million ** Guatemala: 2.0 million (7.2 million ) ** Chile: 1.8 million (4.8 million ) ** Canada: 1.3 million * Asia: 15.3 million ** South Korea: 5.35 million (8.75 million ) ** China: 72.0 million ** Philippines: 9.0 million (38.65 million ; 25.0 million ) ** Indonesia: 7.0 million ** India: Total of: 54 million; 5.2 million (54.0 million ; 38.0 million ) ** Pakistan: 0.25 million * Europe: 9.5-11.0 million ** England: 0.9-1.7 million ** Ukraine: 1.2-1.5 million ** Russia: 1.0 million ** Italy: 0.55 million ** Romania: 0.33 million ** Germany: 0.3 million ** Spain: 0.28 million ** France: 0.2-0.3 million ** Netherlands: 0.15 millions ** Hungary: 0.11 million ** Switzerland: 0.1 million ** Greece: 0.03 million * Oceania: 3.3 million ** Papua New Guinea: 0.4 million ** Australia: 0.4 million ** New Zealand: 0.11 million Sources: Operation World by Patrick Johnstone and Jason Mandryk, 2000, unless otherwise indicated. * Pentecostal survey * Statistics on Pentecostal renewalists * World Christian Database == Leaders == ===Precursors=== * William Boardman * John Alexander Dowie (1848-1907) * Edward Irving * Albert Benjamin Simpson (1843-1919) ===Early history=== * Maria Woodworth-Etter (1844 - 1924) * Smith Wigglesworth (1859 - 1947) * Mary Magdalena Lewis Tate (1879 - 1930) - Mother of Holiness. Founder of the Church of the Living God and its dominion churches. * Charles Fox Parham (1873 - 1929) Father of Modern Pentecostalism * William J. Seymour (1870 - 1922) Azusa Street Mission Founder (Azusa Street Revival) * Bishop R.A.R. Johnson (1876 -1940) Founder of the House of God, Holy Church of the Living God, The Pillar and the Ground of the Truth, The House of Prayer for All People. A Commandment (Sabbath) keeping Pentecostal organization. * George Jeffreys (1889 - 1972) Founder of the Elim Foursquare Gospel Alliance and the Bible-Pattern Church Fellowship in Britain * Aimee Semple McPherson (1890 - 1944) American Female Evangelist and organizer of the International Church of the Foursquare Gospel * Joseph Ayo Babalola (1904 - 1959) Oke - Ooye, Ilesa revivalist in 1930. Also, spiritual founder of Christ Apostolic Church * David du Plessis (1905 - 1987) South-African Pentecostal church leader, one of the founders of the Charismatic movement * Kathryn Kuhlman (1907 - 1976) American female evangelist who brought Pentecostalism into the mainstream denominations * William M. Branham (1909 - 1965) Healing Evangelists of the mid 20th century * Jack Coe (1918 - 1956) Healing Tent Evangelist of the 1950s * A. A. Allen (1911 - 1970) Healing Tent Evangelist of the 1950s and 1960s * Oral Roberts (1918 - 2009) Healing Tent Evangelist who made the transition to televangelism * Rex Humbard (b.1919) The first successful TV evangelist of the mid-1950s, 1960s, and the 1970s and at one time had the largest television audience of any televangelist in the U.S. ==Related pages== * Prophecy == References == ==Studies== * Paul Alexander, (2000), \"An Analysis of the Emergence and Decline of Pacifism in the History of the Assemblies of God\", PhD Dissertation, Baylor University. * Grant Wacker, (2001), Heaven Below: Early Pentecostals and American Culture, Harvard University Press, Cambridge, MA - An academic history of early Pentecostalism. * Walter Hollenweger, (1972), The Pentecostals: the charismatic movement in the churches, Augsburg Publishing House, Minneapolis, * Walter Hollenweger, (1997), Pentecostalism : origins and developments worldwide, Peabody, Mass. : Hendrickson Publishers, * Clifton, S. J., (2005), An Analysis of the Developing Ecclesiology of the Assemblies of God in Australia, PhD thesis Australian Catholic University * Matthew Steel, (2005), Pentecostalism in Zambia : Power, Authority and the Overcomers, MSc Dissertation - an examination of the growth and effects of Pentecostalism on development, University of Wales * Pentecostalism losing its youth? == Other websites == * Journal of Pentecostal Theology is published by SAGE publications. The editorial board is comprised of members of the Church of God Theological Seminary faculty. * The REFLEKS journal is published by REFLEKS- Publishing in Oslo, Norway and contains scholarly Scandinavian and English articles on Pentecostalism and neo-Pentecostalism. * Encounter: Journal for Pentecostal Ministry is a published by the Assemblies of God Theological Seminary (AGTS) * The European Research Network on Global Pentecostalism (GloPent) is an initiative by three leading European Universities in Pentecostal studies networking academic research on Pentecostal and Charismatic movements. * Hollenweger Center for the interdisciplinary study of Pentecostal and Charismatic movements at the Free University of Amsterdam * Cyberjournal for Pentecostal Charismatic Research * Flower Pentecostal Heritage Center (Assemblies of God archives), one of the largest collections of materials documenting the global Pentecostal movement; website contains free research tools, including over 250,000 digitized pages of periodicals and online catalog with over 80,000 entries. * Pentecostalism * Lecture on \"Pentecostalism\" * Map showing Percentage of Pentecostal Population in USA by county from Valparaiso University * Apostolic Herald Online newsletter sharing Pentecostal and Apostolic concepts written primarily by Pentecostal authors. * Pentecostal Conference of the North American Keralites * Australasian Pentecostal Studies journal * Pew Religious Forum Pentecostal Hub * Some statistic Category:Christian movements and denominational families",
 "title": "Pentecostalism"
}