{
 "id": "61949",
 "text": "The Basic Roman spelling of English is a 2002 proposal for regular English spelling.L.L. Ivanov, On the Romanization of Bulgarian and English, Contrastive Linguistics, 28 2003: 109-118. ; Errata, id., 29, 2004 p157. L. Ivanov, D. Skordev and D. Dobrev. The New National Standard for the Romanization of Bulgarian. Mathematica Balkanica. New Series Vol. 24, 2010, Fasc. 1-2. pp. 121–130. It is based on five principles: * The basic Roman alphabet, with no additional letters or diacritics used; * One spelling, with no phoneme (sound) written by two or more graphemes (letters); * Short vowels are spelled by single letters, while long vowels and diphthongs are spelled by two-letter combinations; * Diphthongs are spelled by their components, and long vowels either as diphthongs or by doubling the letters of the short vowels; * Short vowels and consonants are spelled as in the tradition of most Romanized languages.L. Ivanov & V. Yule Roman Phonetic Alphabet for English, Contrastive Linguistics, 32, 2007: 50-64. The Basic Roman system serves no particular standard of English pronunciation. Instead, it gives one way to spell the different varieties of English. The system uses 22 Roman letters to represent the set of English phonemes considered by J.C. Wells.J.C. Wells, Longman Pronunciation Dictionary, Second edition, Harlow: Pearson Education Ltd., 2000. The letters ‘j’, ‘q’, ‘w’ and ‘x’ are not used (letters ‘j’ and ‘w’ are used in an extended version of the Basic Roman spelling, see below). IPA Basic Roman spelling word monophthongs iy bead i bid e bed a bad o box oo pawed aa bra u good uu booed a bud non-rhotic: aa │ rhotic: aar bird a Rosa's diphthongs ey bayed ou bode ay cry au cow oy boy non-rhotic: ia │ rhotic: iar near non-rhotic: ua │ rhotic: uar boor non-rhotic: ea │ rhotic: ear fair consonants m me n name ng sing p peak b best t top d do k kiss g green ts ts ch cheer dzh ( j ) joy f fix v view t ( th ) think d ( dh ) this s sea z zoo sh ship zh vision h ( hh ) loch (Scottish) h he r river y yes u ( w ) west l like By way of illustration, the following reference text by V. YuleV. Yule, Spelling without surplus letters is given in traditional spelling and in Basic Roman (shown is the non-rhotic version; in the rhotic one, relevant words like ‘daughter’, ‘heart’, ‘pictures’ etc. are spelled ‘dootar’, ‘haart’, ‘pikcharz’ etc.): :Once upon a time, the beautiful daughter of a great magician wanted more pearls to put among her treasures. “Look through the centre of the moon when it is blue,” said her royal mother in answer to her question. “You might find your heart’s desire.” The fair princess laughed, because she doubted these words. Instead, she used her imagination, and moved into the photography business, and took pictures of the moon in colour. “I perceive most certainly that it is almost wholly white,” she thought. She also found that she could make enough money in eight months to buy herself two lovely huge new jewels too. :Uans apon a taym, da byutiful doota av a greyt madzhishan uontid moo paalz tu put amang haa trezhaz. “Luk tru da senta av da muun huen it iz bluu,” sed haa royal mada in ansa tu haa kueschan. “Yu mayt faynd yoo haats dizaya.” Da fea prinses laaft, bikoz shi dautid diyz waadz. Insted, shi yuzd haa imadzhineyshan, and muuvd intu da fotografi biznis, and tuk pikchaz av da muun in kala. “Ay paasiyv moust saatanli dat it iz olmoust houli wayt,” shi toot. Shi olsou faund dat shi kud meyk inaf mani in eyt mants tu bay haaself tuu lavli hyudzh nyu juualz tuu. A more elaborate version of the system is the Extended Basic Roman spelling of English, which uses also the letters ‘j’ and ‘w’, and has two specific two-letter combinations for the English voiced and voiceless dental fricatives.L. Ivanov, V. Yule, Roman Phonetic Alphabet for English , Contrastive Linguistics, XXXII, 2007, 2, pp. 50-64. The above sample text would appear in Extended Basic Roman (non-rhotic version) as follows: :Wans apon a taym, dha byutiful doota av a greyt majishan wontid moo paalz tu put amang haa trezhaz. “Luk thru dha senta av dha muun hwen it iz bluu,” sed haa royal madha in ansa tu haa kweschan. “Yu mayt faynd yoo haats dizaya.” Dha fea prinses laaft, bikoz shi dautid dhiyz waadz. Insted, shi yuzd haa imajineyshan, and muuvd intu dha fotografi biznis, and tuk pikchaz av dha muun in kala. “Ay paasiyv moust saatanli dhat it iz olmoust houli wayt,” shi thoot. Shi olsou faund dhat shi kud meyk inaf mani in eyt manths tu bay haaself tuu lavli hyuj nyu juualz tuu. Apart from respelling of English, the Basic Roman could also be used as the target spelling of a universal algorithm for the designing of superior, user-friendly Romanization systems transliterating and transcribing a variety of languages. This ‘streamlined approach’ has been successfully tested in the case of Bulgarian language, with the 1995 Streamlined System for the Romanization of Bulgarian becoming established in Bulgaria (eventually codified in a 2009 law), and adopted also by UN in 2012,Bulgarian. Report on the Current Status of United Nations Romanization Systems for Geographical Names. Compiled by the UNGEGN Working Group on Romanization Systems. Version 4.0, February 2013. and for official US and UK use by BGN and PCGN in 2013.Romanization System for Bulgarian: BGN/PCGN 2013 System. National Geospatial-Intelligence Agency, September 2014. Recently this approach has been used to design the 2017 Streamlined System for the Romanization of Russian aimed at replacing the plethora of systems currently occurring in the non-academic practice of transliteration of Russian Cyrillic.Ivanov, L. Streamlined Romanization of Russian Cyrillic. Contrastive Linguistics. XLII (2017) No. 2. pp. 66-73. The Extended Basic Roman is close to one-to-one phoneme-grapheme correspondence, paving the way to a pronunciation respelling for English by means of the closely related Roman Phonetic Alphabet for English. == Roman Phonetic Alphabet for English == The Roman Phonetic Alphabet for English is a system based on the Extended Basic Roman spelling of English. It includes two pairs of stress marks which disambiguate words which share the same spelling but have different meanings. This is to get a one-to-one phoneme (sound)–grapheme (spelling) correspondence.L. Ivanov & V. Yule, Roman Phonetic Alphabet for English, Contrastive Linguistics, 32, 2007: 50-64. The system has certain similarities to the systems of the NBC Handbook of Pronunciation,Eugene Ehrlich & Raymond Hand Jr., NBC Handbook of Pronunciation HarperCollins Publishers, London 1984. the Carnegie Mellon version of Arpabet alphabet,The Carnegie Mellon Pronouncing Dictionary Carnegie Mellon University, Version 0.6 and the World Book Dictionary.The World Book Dictionary , World Book Inc., Chicago, 2002 IPA Roman Phonetic Alphabet word monophthongs iy bead \\biyd\\ i bid \\bid\\ e bed \\bed\\ ’a │ ,a handbag \\’hand,bag\\ o box \\boks\\ oo draw \\droo\\ ’aa │ ,aa bra \\’braa\\ grandma \\’grand,maa\\ u good \\gud\\ uu mood \\muud\\ ”a │ „a sun \\”san\\ homerun \\’houm„ran\\ non-rhotic: ”aa │ „aa │ aa rhotic: ”aar │ „aar │ aar fur \\”faa\\ │ sunburn \\’sun„baan\\ │ perceive \\paa’suyv\\ \\”faar\\ │ \\’sun„baarn\\ │ \\paa’suyv\\ a ahead \\a’hed\\ diphthongs ey made \\meyd\\ ou phone \\foun\\ ay fly \\flay\\ au cow \\kau\\ oy boy \\boy\\ non-rhotic: ia │ rhotic: iar near ia\\ │ iar\\ non-rhotic: ua │ rhotic: uar poor \\pua\\ │ \\puar\\ non-rhotic: ea │ rhotic: ear fair \\fea\\ │ \\fear\\ consonants m map \\’map\\ n n@ out\\ ng sing \\sing\\ p pen \\pen\\ b best \\best\\ t top \\top\\ d desk \\desk\\ k key \\kiy\\ g go \\gow\\ ts tsar \\’tsaa\\ │ \\’tsaar\\ ch chip \\chip\\ j joy \\joy\\ f fix \\fiks\\ v voice \\voys\\ th think \\think\\ dh this \\dhis\\ s set \\set\\ z zoo \\zuu\\ sh ship \\ship\\ zh vision \\’vizhan\\ hh loch (Scottish) \\lohh\\ h home \\houm\\ r red \\red\\ y yes \\yes\\ w west \\west\\ l like \\layk\\ Primary stress is indicated by the mark <’>, respectively <”> in the case of \\\\\\ and \\\\\\\\. Secondary stress is shown by <,> and <„> respectively. Stress marks are placed before the syllables concerned. By way of illustration, the following reference text by V. Yule is given in traditional English spelling and in Roman Phonetic Alphabet transcription (non-rhotic version): :Once upon a time, the beautiful daughter of a great magician wanted more pearls to put among her treasures. “Look through the centre of the moon when it is blue,” said her royal mother in answer to her question. “You might find your heart’s desire.” The fair princess laughed, because she doubted these words. Instead, she used her imagination, and moved into the photography business, and took pictures of the moon in colour. “I perceive most certainly that it is almost wholly white,” she thought. She also found that she could make enough money in eight months to buy herself two lovely huge new jewels too. :”Wans a’pon a taym, dha ’byutiful ’doota av ”a greyt ma’jishan ’wontid moo ”paalz tu put a”mang ”haa ’trezhaz. “Luk thru dha ’senta av dha muun hwen it iz bluu,” sed ”haa ’royal ’madha in ’ansa tu ”haa ’kweschan. “Yu mayt faynd yoo ’haats di’zaya.” Dha fea ’prinses ’laaft, bi’koz shi ’dautid dhiyz ”waadz. Insted, shi yuzd ”haa i,maji’neyshan, and muuvd intu dha fo’tografi biznis, and tuk ’pikchaz av dha muun in ”kala. “Ay paa’siyv moust ”saatanli ’dhat it iz olmoust houli wayt,” shi thoot. Shi olsou faund ’dhat shi kud meyk i”naf ”mani in eyt ”manths tu bay haa’self tuu ”lavli hyuj nyu ’juualz tuu. ==Related pages== * Orthography * English language ==References== ==Other websites== *G. Gerych. Transliteration of Cyrillic Alphabets. Ottawa University, April 1965. 126 pp. Category:English language Category:Pronunciation Category:Spelling",
 "title": "Basic Roman"
}