{
 "id": "619487",
 "text": "Synthetic division is a way to divide polynomials. It takes up less space than polynomial long division. It is mostly used to divide a polynomial by a binomial that looks like this: : x - a,\\ but it can be divided by any polynomial with one variable. Synthetic division can be used to make calculations without writing variables. It also uses a small number of calculations, and takes less room on paper than long division. The subtractions in long division are changed to additions by changing the signs at the very beginning, which keeps sign errors from happening. Synthetic division for linear denominators is also called division in Ruffini's rule. == Process == The first example is synthetic division with a denominator x-a that only has one variable. : \\frac{x^3 - 12x^2 - 42}{x - 3} The coefficients of the polynomial to divide are put at the top (the zero is for the unseen 0x). : \\begin{array}{cc} \\begin{array}{r} \\\\\\ \\\\\\ \\end{array} & \\begin{array}{|rrrr} \\ 1 & -12 & 0 & -42 \\\\\\ & & & \\\\\\ \\hline \\end{array} \\end{array} Make the coefficients of the denominator their opposite. : \\begin{array}{rr} -1x & \\+ 3 \\end{array} Put every coefficient of the divisor except the first one on the left. : \\begin{array}{cc} \\begin{array}{r} \\\\\\ 3 \\\\\\ \\end{array} & \\begin{array}{|rrrr} \\ 1 & -12 & 0 & -42 \\\\\\ & & & \\\\\\ \\hline \\end{array} \\end{array} Put the first number after the bar, 1, at the bottom. : \\begin{array}{cc} \\begin{array}{r} \\\\\\ 3 \\\\\\ \\\\\\ \\end{array} & \\begin{array}{|rrrr} 1 & -12 & 0 & -42 \\\\\\ & & & \\\\\\ \\hline 1 & & & \\\\\\ \\end{array} \\end{array} Multiply the dropped number by the number before the bar, and put it under the next coefficient, 12. : \\begin{array}{cc} \\begin{array}{r} \\\\\\ 3 \\\\\\ \\\\\\ \\end{array} & \\begin{array}{|rrrr} 1 & -12 & 0 & -42 \\\\\\ & 3 & & \\\\\\ \\hline 1 & & & \\\\\\ \\end{array} \\end{array} Add the numbers in the second column (which equals -9 in this example). : \\begin{array}{cc} \\begin{array}{c} \\\\\\ 3 \\\\\\ \\\\\\ \\end{array} & \\begin{array}{|rrrr} 1 & -12 & 0 & -42 \\\\\\ & 3 & & \\\\\\ \\hline 1 & -9 & & \\\\\\ \\end{array} \\end{array} Do the last two steps again to get this: : \\begin{array}{cc} \\begin{array}{c} \\\\\\ 3 \\\\\\ \\\\\\ \\end{array} & \\begin{array}{|rrrr} 1 & -12 & 0 & -42 \\\\\\ & 3 & -27 & -81 \\\\\\ \\hline 1 & -9 & -27 & -123 \\end{array} \\end{array} Count the terms to the left of the bar. Since there is only one, the remainder has degree zero, which means it is a constant that is more than zero. Put an up and down line next to the last number, -123. : \\begin{array}{rrr|r} 1 & -9 & -27 & -123 \\end{array} The terms are written with a rising degree from right to left. It begins with degree zero for both the remainder and the result. : \\begin{array}{rrr|r} 1x^2 & -9x & -27 & -123 \\end{array} The last part of the division is: : \\frac{x^3 - 12x^2 - 42}{x - 3} = x^2 - 9x - 27 - \\frac{123}{x - 3} Category:Algebra",
 "title": "Synthetic division"
}