{
 "id": "61973",
 "text": "Jeanne Louise Calment (21 February 1875 – 4 August 1997) was a French supercentenarian and at the time of her death at age 122 years, 164 days the verified oldest person in history as well as the only person who has surpassed 120 years of age, although her claimed age is possibly disputed. On 17 October 1995, Calment reached 120 years and 238 days to become the \"oldest person ever\" according to Guinness World Records, surpassing Shigechiyo Izumi of Japan, whose claim (120 years 237 days old at the time of his death on 21 February 1986, Calment's 111th birthday) has since been discounted. Calment also holds the record for being the oldest living person for the longest period of time, by far – with nearly nine years and seven months, counting from the death of Florence Knapp on 11 January 1988, to her own death on 4 August 1997.Table C - World's Oldest Person (WOP) Titleholders Since 1955 Gerontology Research Group She was the last remaining undisputed person born in the 1870s. On 12 July 1995, Tane Ikai of Japan died, and Calment became the last living link from the 1870s. Following Calment's death on 4 August 1997 at 10:45 CET, then 116-year-old Marie-Louise Meilleur became the oldest living recognized person. == Biography == She was active during her life, lived on her own until she was almost 110, and talked a lot until months before her death. Calment still rode her bike at the age of 100 in 1975. Once, she fell off and developed a brief period of amnesia. She recovered sometime later. In 1888, when she was 13, Calment met Vincent van Gogh while he visited her uncle's shop to buy canvas. During her later years in the 1990s, she could not hear very well. In 1995 at the age of 120 years, she became the subject of her own documentary, 120 Years with Jeanne Calment. She died in August 4, 1997 from unspecified causes in her nursing home in Arles, France at the age of 122 years and 164 days. == Controversy == A study by Russian researcher Nikolay Zak has disputed Jeanne Calment's claimed age with a hypothesis that Jeanne's daughter Yvonne, born 1898 and claimed to have died of pneumonia in 1934, usurped Jeanne's identity upon Jeanne's death in 1934. In that scenario, Jeanne Calment would have died already in 1934 and Yvonne Calment in 1997, claiming to be her mother and aged 122 but in fact she was aged 99. However, to prove if the hypothesis is true, a DNA/blood test is required. The oldest undisputed person in history is Japanese woman Kane Tanaka, who lived to age 119 years, 107 days. == Related pages == *Jiroemon Kimura (1897–2013), the oldest man ever whose age was verified == References == Category:1875 births Category:1997 deaths Category:French supercentenarians Category:People from Arles",
 "title": "Jeanne Calment"
}