{
 "id": "619956",
 "text": "Cengage Learning, or Cengage, is a publisher. It makes and sells textbooks and other educational content. It is also a technology and services company. Their customers are in higher education, K-12, companies, and libraries around the world. Cengage has business in more than 20 countries. ==Company information== The company headquarters in Boston, Massachusetts. About 5,000 people work at Cengage in 20 countries. The headquarters was in Stamford, Connecticut until April 2014. ==Products and services== Cengage sells print and digital textbooks. It also sells additional materials to teachers to help them use those textbooks. Online products include reference databases and distance learning courses. Cengage also sells test preparation materials, corporate training courses, career assessment tools, materials for specific academic disciplines, and custom solutions. On December 5, 2017, Cengage announced Cengage Unlimited. This plan is asks students to pay a subscription to use any of their digital higher education books. Students can pay by semester or year. ==History== Cengage Learning used to be called Thomson Learning. The Thomson Corporation sold it to a private equity group including Apax Partners and OMERS Capital Partners for US $7.75 billion, and the name was changed to Cengage Learning on 24 July 2007. In 2011, Cengage Learning bought the National Geographic Society's school publishing business. It combined this school business with the Global ELT business to make the National Geographic Learning brand. Cengage Learning filed for bankruptcy under Chapter 11 on July 2, 2013. Cengage Learning left bankruptcy on April 1, 2014. ===Buying other companies=== Cengage has grown by buying other publishing companies. These are some of the important ones: Date of acquisition announced Asset acquired Industry 1 March 2004 Education to GoMacFadyen, Ken (June 9, 2008) Thomson Course Technology Acquires Education To Go To Expand Continuing Education Offerings Online continuing education courses 16 May 2008 PAL PublicationsMacFadyen, Ken (June 9, 2008) Cengage Buys Houghton Mifflin's College Unit themiddlemarket.com Professional reference series 2 June 2008 Houghton Mifflin College Division Publishing for 2- and 4-year colleges 17 July 2008 Gatlin Education Services Web-based training for education providers 16 December 2008 HighBeam ResearchPolanka, Sue (Dec 16, 2008) http://www.libraries.wright.edu/noshelfrequired/2008/12/16/highbeam-research- now-part-of-galecengage/ No Shelf Required - Wright State University Libraries Paid search engine of newspapers and magazines 1 August 2011 National Geographic School PublishingJinks, Beth (June 24, 2011) Apax's Cengage Buying National Geographic's School Publisher Bloomberg.com Publishing for K-12 Schools September 2015 Learning Objects, Inc Learning Management Systems and Adaptive Education Tools October 2015 Pathbrite, Inc ePortfolio services for learning, reflection, and career advancement September 2016 WebAssign Online instructional application for faculty and students ==Brands/imprints== The company also publishes books with other names: 4LTR Press, Aplia, Cengage Learning PTR, Chilton, Education To Go, Gale, Milady, MindTap, and National Geographic Learning. ==References== * Mike W. Peng, Global Business (2009), p. 3 * Hoover's Handbook of World Business 2011 (2011), p. 355 * Press Release (Ed2go) * Press Release (Houghton Mifflin) * Boston Herald: Houghton Mifflin Acquisition ==Other websites== * * National Geographic Learning, part of Cengage Learning * ed2go, a part of Cengage Learning Category:Book publishing companies Category:Publishing companies of the United States Category:Companies based in Boston",
 "title": "Cengage Learning"
}