{
 "id": "62008",
 "text": "was the 71st emperor of Japan, according to the traditional order of succession.Imperial Household Agency (Kunaichō), 後三条天皇 (71); retrieved 2012-10-7. His reign started in 1068 and ended in 1073.Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 166–168; Brown, Delmer et al. (1979). Gukanshō, pp. 314–315; Varley, H. Paul. (1980). Jinnō Shōtōki, p. 198-199. This 11th century sovereign was named after Emperor Sanjō and go- (後), translates literally as \"later.\" He is sometimes called the \"Later Emperor Sanjō\". The Japanese word \"go\" has also been translated to mean the \"second one;\" and in some older sources, this emperor may be identified as \"Sanjō, the second,\" or as \"Sanjo II.\" ==Traditional narrative== His personal name (imina) was .Titsingh, p. 166; Brown, p. 314; Varley, p. 198. He was the second son of Emperor Go-Suzaku, and his mother was Empress Sadako, the third daughter of Emperor Sanjō. This made him the first Emperor in 170 years whose mother was not of the Fujiwara family.Brown, p. 314. ===Events of Go-Sanjō's life === * 22 May 1068 (Jiryaku 4, 19th day of the 4th month): In the 4th year of Emperor Go-Reizei's reign, he died at age 44; and the succession (senso) was received by a his son. Soon after, Emperor Go-Sanjo accepted the monarch's role and duties and powers (sokui).Titsingh, p. 166; Brown, p. 313. This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go- Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2012-10-15. * 1069 (Enkyū 1): Go-Sanjō ordered the creation of a government land records office. * 1070 (Enkyū 2): Go-Sanjō ordered a preliminary system of laws and a bureaucracy for regulating silk. * 1072 (Enkyū 4): Go-Sanjō was interested in strengthening the finances of the Imperial Household. * 18 January 1072 (Enkyū 4, 8th day of the 12th month): In the 6th year of Emperor Go-Sanjō's reign, the emperor abdicated; and the succession (senso) was received by his son. Soon after, Emperor Shirakawa accepted his new role in the monarchy (sokui).Titsingh, p. 169; Brown, p. 314; Varley, p. 44. * 11 May 11 (Enkyū 5, 21st day of the 4th month): Go-Sanjō became a Buddhist priest.Brown, p. 315. * 15 June 1073 (Enkyū 5, 7th day of the 5th month): Former-Emperor Go-Sanjō died at the age of 40. == Era names == The Japanese era names (nengō) of his reign were * Jiryaku (1065-1069)Titsingh, p. 165-168; Brown, p. 313-315. * Enkyū (1069-1074) ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Insei ==Notes and references== Category:Emperors of Japan Category:1030s births Category:1070s deaths",
 "title": "Emperor Go-Sanjō"
}