{
 "id": "62025",
 "text": "The Electric Company was an educational American children's television series. It was produced by the Children's Television Workshop (1971-1977)/Sesame Workshop (2006 and 2009-2011) for PBS in the United States. PBS broadcast 930 episodes over nine seasons from 1971 to 1977, 2006, and 2009 to 2011. CTW (1971-1977)/Sesame Workshop (2006/2009-2011) produced the show at Reeves Teletape Studios (1971-1977)/Kaufman Astoria Studios (2006/2009-2011) Second Stage in Manhattan. The Electric Company used sketch comedy and other devices to create an entertaining program to help children of elementary-school age get better at reading skills. It was meant for children who had \"graduated\" from CTW's main program, Sesame Street. Season 1 was released on October 25, 1971 - April 21, 1972; season 2 was released on October 23, 1972 - April 20, 1973; season 3 was released on October 22, 1973 - April 19, 1974, season 4 was released on October 21, 1974 - April 18, 1975, season 5 was released on October 20, 1975 - April 16, 1976, season 6 was released on October 18, 1976 - April 15, 1977, season 7 is released in 2006 and January 19 - October 1, 2009, season 8 is released in January 25 - May 7, 2010, and season 9 is released in February 7 - March 28, 2011. June Angela as Julie (1971-1977 and 2009) was a long-running cast member of the 1971-1977 rock band named The Short Circus. In 2006, the 1977 departed 1975-1977 cast were or was replaced by the 2009-2011 cast playing the Ruiz family and their friends in their gang. In the comic book, season 10 is released in 2012. == Songs == * Fling Fling(performed by Winnie and The Short Circus) (season 2, episode ? (197?)) * Sing Out (performed by The Short Circus) (season 2, episode 130 (1973)) * Buddy and Kelly (performed by Buddy and Kelly from or in The Short Circus) (season 3, episode 1 (1973)) * Broccoli (performed by Buddy and Kelly) (season 3, episode 98 (1974)) * Words (performed by Mark and Valerie the Librarian) (season 4, episode 1 (1974)) * Knock Knock Rock (performed by The Short Circus) (season 5, episode 35 (1975)) == Other websites == * * * The Electric Company official Web site Category:PBS Kids shows Category:1977 disestablishments in the United States Category:English-language television programs Category:1971 American television series debuts Category:1977 American television series endings",
 "title": "The Electric Company"
}