{
 "id": "620402",
 "text": "Arjit Taneja is an Indian television actor and model. He made his television debut with the V The Serial and then appeared in the reality shows MTV Splitsvilla 6 and Box Cricket League 1 and TV fiction dramas Kumkum Bhagya, Kaleerein and Bahu Begum. Taneja is frequently cited as one of the most desirable and attractive celebrities in Indian television industry. He is been rumoured to be in relationship with actress Anjum Fakih. ==Life and career== ===Early life and career beginnings (1992–2014)=== Arjit Taneja belongs to a Punjabi family.Divya Kaushik (14 March 2018), \"Arjit Taneja: All the fun that people have in college, I had it in school\", The Times of India. Retrieved 22 September 2018. He attended modern school, Delhi and was graduated with a BA degree in computer programming at University of Delhi. In November 2010, he joined the modelling agency Elite Model Management India Pvt. Ltd. 2 years later in mid-2012, Taneja moved from Delhi to Mumbai and began his acting career on television that year as the friend of Karan Kundra's character in Channel V India's V The Serial, produced by Ekta Kapoor. In 2013 he collaborated with Kapoor on Sony TV's Bade Achhe Lagte Hain, where he had a very small role. Also he contested in MTV India's MTV Splitsvilla 6 and later in Sony TV's Box Cricket League 1, the latter of which was his third with Kapoor. ===Breakthrough and establishment (2014–present)=== Taneja's career finally saw a turning point when he signed the parallel lead role of Purab Khanna in Zee TV's popular daily soap Kumkum Bhagya, created by Kapoor. He won the Best Supporting Actor award at the Zee Gold Awards, and exited the show in 2016. In 2017, Arjit then moved to Indonesia for a few months where he was cast as lead in the Indonesian show ' Nadin ' (ANTV) alongside his former co- star from Kumkum Bhagya Mrunal Thakur and Indonesia Actress Dewi Persik. Simultaneously along with Kumkum Bhagya, he was seen as Bilal Khan in another Kapoor production—Sony TV's Pyaar Ko Ho Jaane Do in 2015. In 2016, he did Zing's Pyaar Tune Kya Kiya and participated in Colors TV's Box Cricket League 2 produced by Kapoor. In February 2018, Taneja began essaying the main character of Vivaan Kapoor in Zee TV's Kaleerein. It went off air in November 2018. In May 2018, he also appeared as a guest in Zee TV's talk show Juzz Baatt with Sana Saeed, Adnan Khan and Karan Jotwani. His next TV series was Colors TV's love triangle-themed Bahu Begum which premiered in July 2019. In the show Taneja was cast as Azaan Akhtar Mirza, the Nawab of Bhopal. Due to low viewership, Bahu Begum culminated in January 2020. In January 2021, he bagged the grey-shade cameo role of Farishta, an angel in the supernatural revenge thriller Naagin 5 and reprised the same role in February 2021 for Kuch Toh Hai: Naagin Ek Naye Rang Mein, both of which were aired on Colors TV and created by Kapoor. Arjit Taneja is currently seen as 'Shambhu' in his latest show \"Nath Zewar Ya Zanjeer\" which officially aired on August 23rd, 2021 on Dangal TV. == Filmography == === Television === Year Title Role Notes Ref(s) 2012 V The Serial Himself 2013 MTV Splitsvilla 6 Contestant Bade Acche Lagte Hain Unknown Special appearance 2014–2015 Box Cricket League 1 Contestant 2014–2016 Kumkum Bhagya Purab Khanna 2015 Pyaar Ko Ho Jaane Do Bilal Khan Bad Company Himself / Guest 2016 Pyaar Tune Kya Kiya Himself / Host Box Cricket League 2 Contestant 2018 Kaleerein Vivaan Kapoor Juzzbaatt – Sangeen Se Namkeen Tak Himself / Guest Kundali Bhagya Guest (as Vivaan) Dance performance Zindagi Ki Mehek Special appearance Guddan Tumse Na Ho Payega 2019–2020 Bahu Begum Azaan Akhtar Mirza 2019 Api & Cinta Sunjoy Bepanah Pyaar Guest (as Azaan) Shakti - Astitva Ke Ehsaas Ki 2020 Choti Sarrdaarni Dance performance in News Years Special 2020-21 Naagin 5 Farishta Kuch Toh Hai: Naagin Ek Naye Rang Mein Guest special appearance 2021-2022 Nath: Zevar Ya Zanjeer Shambhu 2022-2023 Banni Chow Home Delivery Agastya Kapoor 2023 Kaise Mujhe Tum Mil Gaye Virat Singh Ahuja ===Music Videos === Year Song Singer Company/Label Ref. 2018 Main Jaandiyaan Meet Bros, Neha Bhasin, Piyush Mehroliyaa MB Music 2019 Naseeba Shaan Zee Music Company Farishta Arko Pravo Mukherjee, Asees Kaur 2020 Ik Dafa To Mil Oye Kunaal Nexus Records ==Awards and nominations== Year Award Category Work Result 2016 Zee Gold Awards Best Supporting Actor Kumkum Bhagya 2018 Most Fit Actor (Male) == References == == Other websites == * Category:1992 births Category:Indian television actors Category:Indian models Category:Actors from Delhi Category:Living people",
 "title": "Arjit Taneja"
}