{
 "id": "620520",
 "text": "Victorious is an American teen sitcom that premiered on Nickelodeon on March 27, 2010, and aired until February 2, 2013. The series stars Victoria Justice as Tori Vega, a teenage girl who attends Hollywood Arts High School, a performing arts school with a group of students. It was announced on August 10, 2012, that the series would not be renewed. == Episodes == ===Season 1 (2010–11)=== No. overall No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) 1 1 \"Pilot\" Steve Hoefer Dan Schneider March 27, 2010 101 5.7 Tori Vega (Victoria Justice) gets the chance of a lifetime to attend Hollywood Arts, an elite performing arts school after taking her older sister Trina's (Daniella Monet) place in her school's big showcase. Tori is roped into helping Trina and her project partner Andre Harris (Leon Thomas III) prepare for their performance for the showcase in a few days, including Trina singing a song Andre wrote for her. When Trina's tongue becomes swollen due to an allergic reaction to the Chinese herb gargle and she cannot sing properly, Andre tells Tori to fill in for Trina, but she refuses. They force her on stage and, with the help of Andre, Tori receives a standing ovation from the crowd, and accepts the offer to join Hollywood Arts. On her first day, she meets Cat Valentine (Ariana Grande), a girl who seems to be living in her own head, Robbie Shapiro (Matt Bennett), an awkward, nerdy student who speaks through his dummy Rex Powers, handsome Beck Oliver (Avan Jogia), and his mean girlfriend Jade West (Elizabeth Gillies). After accidentally spilling coffee on Beck and trying to wipe the stain off his shirt, Tori finds herself at the wrath of Jade, who thinks that Tori is flirting with Beck. Jade does an improv scene with Tori, having Tori portray a dog, but then takes iced coffee and spills it on top of Tori, causing her to leave the room in humiliation. After the altercation with Jade, Tori wonders if she is good enough for, or even belongs at Hollywood Arts. At the insistence of Trina and Andre, who tell her not to let a mean girl crush her confidence, Tori returns to class and subsequently gets revenge on Jade by besting her in an improv assignment and then by kissing Beck in front of her. Song featured: \"Make It Shine\" (performed by Victoria Justice), which becomes the series' theme song. 2 2 \"The Bird Scene\" Steve Hoefer Dan Schneider April 11, 2010 102 3.5 Tori wants to try out for the lead role in a play called \"Moonlight Magic\", which Andre is writing the music for. However, according to her teacher Mr. Sikowitz (Eric Lange), she must master a monologue known as \"The Bird Scene\" before she can be involved in any school production. Despite putting a lot of effort into it, she fails twice. As well as this, she must also think of a creative and meaningful way to decorate her locker, which is Hollywood Arts tradition, but all her efforts are unsuccessful as well. She again performs \"The Bird Scene\" and indignantly states that she is proud of her own work no matter what anyone thinks. She passes, as the secret of \"The Bird Scene\" is to be proud of one's acting style. Inspired, Tori decorates her locker with the glowing words \"Make It Shine\", as that was the song that she sang that got her into Hollywood Arts. Andre and Robbie sign up for ballet class as a way to meet girls, but arrive only to see an all-male class, They want to drop out, but they must continue the class unless they want to fail the semester. But then, a pretty girl joins the class, and the boys go crazy about her. 3 3 \"Stage Fighting\" Steve Hoefer George Doty IV April 18, 2010 103 3.3 Tori walks in on a muscular guy named Russ apparently beating up Beck, so she jumps on Russ to stop him. However, she finds out they were only stage fighting. After a stage fight lesson, Sikowitz gives Jade as Tori's fighting actress in a scene they are assigned to do. Tori is afraid to do it because of Jade and, during the skit, she 'hits' Jade with a cane. Jade's eye begins to bleed and, following this, develops a black eye. Consequently, Tori is given a punishment of cleaning the theater after a food fight scene and two weeks of detention. However, after two boys pour a cup of ice in a girl's tucked-in shirt she tries to get back at them by throwing a cup of water at them but the boys get out of the way so the water hits Jade. As she tries to run off and hide, Andre finds her and discovers that she used fake blood and makeup to fake her injury. After this, Jade begins to feel guilty, especially when learning that Tori refuses to tell the truth on her, and she helps Tori clean a little bit and ditch the security guard watching her to clean the hall. 4 4 \"The Birthweek Song\" Adam Weissman Jake Farrow April 25, 2010 107 3.2 Tori needs to find the perfect gift for Trina's birthday. Andre suggests that she write her sister a song and perform it at her birthday party. After she performs the song, though, Trina proves to be ungrateful; she wants a material gift instead of the sentimental one Tori gave her. Trina decides to sell the flash drive containing the song for $500 to a record producer, who then invites Trina to record the song, even though she is not the singer on the version he heard, which he realizes after several takes. Trina eventually confesses that Tori is the singer, and Tori gets to record the song herself. Meanwhile, Robbie and Cat go see his grandmother Mamaw, so Robbie can fix the internet. As Robbie notices Mamaw's animosity toward Cat, he decides to make a document to trick his grandmother into believing she has no more internet. Song featured: \"You're the Reason\" by Victoria Justice Guest star: Renée Taylor as Mamaw, Robbie's grandmother. Absent: Avan Jogia as Beck Oliver. 5 5 \"Jade Dumps Beck\" Steve Hoefer Matt Fleckenstein May 2, 2010 106 3.3 Jade becomes jealous when Beck starts hanging out with Alyssa Vaughn, a famous socialite, who may like him. She ends up breaking up with Beck when she feels that he is not taking her feelings of the situation seriously. After having second thoughts, she decides that she wants Beck back, only to get rejected by him, leading her to seek Tori's help. Tori tries to convince Beck to make amends with Jade, only for him to bring up how Jade has never done anything nice for him during the time they have dated. When remembering Beck wants a Rottweiler, Jade and Tori bring one to his RV, only for the dog to attack his father who was sleeping inside. After his father is taken to the hospital, Beck takes Jade back anyway, admitting he still loves her. Meanwhile, Robbie has to write a review of Trina's one woman show for the school's social networking site, TheSlap.com, but does not know how to review it when she threatens him to write a good review despite it being horrible. Absent: Ariana Grande as Cat Valentine. 6 6 \"Tori the Zombie\" Russ Reinsel Dan Schneider May 8, 2010 105 4.1 Tori is to be in a play about a beautiful girl who is caught in a love triangle that is to be reviewed by the famous writer who wrote it. Meanwhile, Cat starts stage make-up classes and cannot find anyone to put her make-up skills on, so Tori agrees to allow Cat to do so with her. Cat uses super-grizzly glue by accident, which is like industrial cement and to be kept away from skin, when putting a zombie-looking mask on her hours before the play is set to begin. Tori forces Cat and Trina to drive to the super-glue factory to get the remover. However, Trina and Cat arrive late and the play starts with Tori looking hideous, confusing the audience. During the end of the play, Trina and Cat arrive with the remover in time for Tori to do the finale of the play with her normal face and the writer gives the play a good review. Song featured: \"Finally Falling\" Guest stars: Adam Gouldbergh as Murray, the director and Rachel Quinance as Sophia Michele, playwright. 7 7 \"Robarazzi\" Steve Hoefer Arthur Gradstein June 4, 2010 108 6.0 Wanting to get more views on his blog on The Slap, Robbie begins filming the personal lives of his friends called \"Robarazzi\" although his posts end up about making fun of them. His blog becomes a hit, much to his friends' dismay, causing them to become furious with him. After threatening to post a video of him in a towel after having his clothes stolen from the shower room unless he takes his blog down, he retools his blog on TheSlap, focusing on food recipes. Meanwhile, Cat becomes obsessed with purchasing odd things from a catalog from \"Sky Store\". Her friends feel that she needs to slow down the purchasing. Absent: Daniella Monet as Trina Vega. 8 8 \"Survival of the Hottest\" \"Trapped in an RV\" Russ Reinsel Dan Schneider June 26, 2010 117 3.8 When a heat wave hits Southern California, Tori, Cat, Trina, Andre, Robbie, Rex, Beck, and Jade decide to go to cool off at Venice Beach. Beck decides the best way to get there is to borrow his uncle's pickup truck and tow the trailer that he lives in to the beach. But the gang, minus Cat who leaves to use the bathroom, become trapped in Beck's Recreational vehicle (RV) when another huge RV is parked right next to theirs, blocking the only door. While they are trapped, Cat is busy partying with Ben (JC Gonzalez) and his group of three other boys who decide to frolic with Cat, the only girl who could possibly save the rest of them from sweating to death and completely oblivious to her friends' predicament as they try to escape the RV. 9 9 \"Wi-Fi in the Sky\" Steve Hoefer Dan Schneider August 27, 2010 118 3.6 Tori and Trina's flight home from New York City gets delayed, so Tori uses video chat via the plane's Wi-Fi service to work on a group project for school with Andre, Cat, and Beck while she is on the plane. While attempting to get it done, the rest of the group keeps getting distracted. They accept unimportant video chats, the majority from Robbie. Cat gets distracted by the special effects of the video chat, Andre gets distracted by his deranged grandmother, and Beck becomes distracted by Jade when she wrongly suspects he is cheating on her with the cheerleader whose dog he is pet-sitting. They are all off chat at the end, leaving Tori to finish the assignment herself. Meanwhile, Trina runs into Perez Hilton in first class and steals his camera so she can \"return it,\" hoping it will make her famous. Special guest star: Perez Hilton as himself. 10 10 \"Beck's Big Break\" David Kendall Arthur Gradstein September 25, 2010 104 N/A Beck has a small role in a movie starring Melinda Murray, a famous actress, and invites the gang to an open casting call as extras. Tori accidentally gets Beck fired when she stands up for him during filming, so she tries to get his spot in the movie back for him. Meanwhile, Robbie starts to have strange nightmares about Rex. He turns to Lane, the school guidance counselor, for help. Guest star: Ellen Hollman as Melinda Murray. Absent: Daniella Monet as Trina Vega. 11 11 \"The Great Ping-Pong Scam\" Steve Hoefer Matt Fleckenstein October 1, 2010 115 N/A Tori becomes suspicious when her friends start avoiding her. They tell her that they are members of the school's ping-pong team, but Tori finds out that they are just using the team's funds from the school to eat at a fancy restaurant, and she wants in. At the restaurant, Robbie orders a bowl of expensive caviar that he likes, causing them to have to pay a lot more money than they have. Tori decides to perform live to cover the expenses. Absent: Daniella Monet as Trina Vega. Song Featured: Tell Me that You Love Me by Victoria Justice and Leon Thomas III. 12 12 \"Cat's New Boyfriend\" Adam Weissman Arthur Gradstein October 8, 2010 112 2.9 Cat starts going out with Tori's ex-boyfriend from her old school, Daniel. Tori pretends to be okay with it, but ends up becoming very jealous. Her jealousy comes to a head when she fiddles with the cheese fountain, covering the couple in hot cheese, and later kisses Daniel, which Cat witnesses, putting her in a predicament. Meanwhile, Trina starts selling doctor fish treatment at her house and Andre, Beck, Jade and Robbie all accept, only for it to turn out the fish are diseased, making them all sick. Guest star: Matt Angel as Daniel. 13 13 \"Freak the Freak Out\" Steve Hoefer Dan Schneider November 26, 2010 119–120 5.3 Tori's parents head out for the weekend, leaving Tori to care for Trina who recently had her wisdom teeth pulled out, who proves to be a handful. Meanwhile, Jade and Cat perform in a karaoke club against two other girls, Hayley Ferguson and Tara Ganz. Despite having mediocre singing skills, the girls win because Hayley's father is the owner of the club. After confronting the girls about this, the duo are banned from singing there again. Determined to get back at them, Jade tricks Andre, Robbie and Beck to stay and take care of Trina while taking Beck's car keys to drive her, Tori and Cat to the club for a rematch. Jade and Cat offer a challenge – Hayley and Tara get to pick someone from the audience to sing against them and if the person wins by a crowd vote then they have to babysit Trina, but if Hayley and Tara win then they can make out with Beck (offered by Cat, much to Jade's dismay). They pick Tori (disguised as an ugly girl). Tori sings \"Freak the Freak Out\" and, meanwhile, removes her disguise. Tori wins over the crowd quickly, easily beating the girls. Meanwhile, Robbie and Sinjin are tricked by two Northridge girls who steal their things. In the end, Sikowitz sings a song and receives applause while Hayley and Tara are stuck trying to babysit Trina. Song featured: \"Number One\", \"Give it Up\" and \"Freak the Freak Out\" Note: This is the first one-hour special, but in the U.K. this episode aired in two different parts, while the U.S. and other countries aired the whole episode as one. Guest stars: Jillian Clare as Hayley Ferguson, Jamie Snow as Tara Ganz & Tom Virtue as Joey Ferguson. 14 14 \"Rex Dies\" Russ Reinsel Jake Farrow January 8, 2011 110 4.2 Tori is in charge of creating a fake tornado in a play that Robbie is in by using a machine that blows and sucks. Andre shows Tori how it works, but she leaves the switch on suck. Tori watches Rex while Robbie goes to change because Rex laughs at him. Tori sets him down and plays with the machine, but does not notice the switch is still on suck while Robbie is changing. Tori accidentally sucks Rex in the machine, badly damaging him. Concerned about Robbie's mental health, Jade convinces the others to fake Rex's death at the hospital so Robbie can move on and live a normal life. The doctor agrees on the condition that Tori dates the doctor's loser son, Lendle, but Tori tricks Trina into doing it. While at the hospital, Cat is sent to the mental ward by the receptionist, who believe she may be mental, and the doctors become concerned for her and send for a specialist to diagnose her. 15 15 \"The Diddly-Bops\" Steve Hoefer Matt Fleckenstein January 17, 2011 111 3.5 Tori and her friends are booked to perform at a little kid's birthday party as a favor for Sikowitz's friend. Also, Andre gets the chance of a lifetime when he gets a call from a record producer he met who says he is interested in signing him to a record deal. But his chances of getting signed are in jeopardy when a video of their birthday party performance is leaked on the internet. So, in order to get his big break, he rewrites the kids' song into a love song and performs it with Tori live for the school. Song featured: \"Favorite Food\" and \"Song 2 You\" 16 16 \"Wok Star\" Adam Weissman Jake Farrow January 17, 2011 116 3.6 Jade writes her own play called \"Well Wishes,\" but the school will not let her perform it at school due to its content. Tori helps Jade produce it themselves with the help of Mrs. Lee, the owner of Tori's favorite Chinese restaurant Wok Star, who volunteers to pay to produce Jade's play. But things get complicated when Mrs. Lee makes drastic changes to the script, and wants to put her daughter, Daisy, in the play. After finding out that Jade's father will be at the showing, Tori tries to find a way to work things out for her. Guest stars: Susan Chuang as Mrs. Lee & Jade-Lianna Peters as Daisy. 17 17 \"The Wood\" David Kendall Dan Schneider February 5, 2011 114 4.4 Tori, Andre, Beck and Jade are excited to hear that they will be the stars of a new reality show called \"The Wood\" being filmed at Hollywood Arts. After the producers decide to edit together two separate phone calls making it look like Tori and Beck are dating behind Jade's back, they find out that the producers just want drama even if it is fake. So the group decide to stage the drama for the show. Meanwhile, Robbie and Trina have to work the Grub Truck after injuring Festus, but running it is harder than they first expected. Absent: Ariana Grande as Cat Valentine 18 18 \"A Film by Dale Squires\" Adam Weissman George Doty IV March 5, 2011 109 3.5 The group is excited to find out that they get to work on a film being directed by Dale Squires. But he turns out to be lazy during the project, leaving them to do all the work. After he takes all the credit for the film, they plot revenge, only to discover that Squires regrets getting all the credit. Meanwhile, Beck and Robbie work on Robbie's new convertible, and Robbie tries to get the attention of girls that come to watch Beck fix the car. Guest star: Stephen Lunsford as Dale Squires. 19 19 \"Sleepover at Sikowitz's\" Russ Reinsel George Doty IV March 26, 2011 113 4.1 Sikowitz invites Tori and her friends over to his house to teach them a lesson on method acting; however if one of them breaks character, they will be banished from Sikowitz's house. Meanwhile, Mr and Mrs Vega (Tori and Trina's parents) try to celebrate their anniversary alone in their house. But Robbie is first to be banished from Sikowitz's, so he takes a trip over to the Vega house and disturbs their romantic evening. Robbie also invites Cat, Sikowitz's nephew, Andre and Jade round to watch the movie with him when they eventually break character. In the end, after an extremely close match between Tori and Beck well into the night, Tori becomes the winner the next morning as she does not break character. Absent: Daniella Monet as Trina Vega. ===Season 2 (2011)=== * A 90-minute iCarly crossover special, \"iParty with Victorious\", aired on June 11, 2011. Despite it being a crossover episode, it is an iCarly- produced episode instead of a Victorious episode. No. overall No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) 20 1 \"Beggin' on Your Knees\" Steve Hoefer Jake Farrow April 2, 2011 209 6.2 Ryder Daniels, a popular Senior, asks Tori out. Robbie also tries to attract girls only to get rejected each time. Tori invites Ryder to her house and Robbie spies on them as he wants to attract girls like Ryder does. However, Ryder leaves the house angry as Tori goes through his phone at Trina's idea. The next day, Ryder forgives Tori, and Robbie comes in dressed like Ryder. Soon after this, though, Tori finds out that Ryder uses girls to get good grades and dumps them afterwards, so she gets revenge on him and sings \"Beggin' on Your Knees\". Guest star: Ryan Rottman as Ryder Daniels. Song featured: \"Beggin' on Your Knees\". 21 2 \"Beck Falls for Tori\" Steve Hoefer Dan Schneider April 16, 2011 201 3.9 Sikowitz gets Tori an audition for an upcoming movie. Although she does not get the part, she is instead cast as a stunt double after lying on her résumé and because she looks like the lead actress. Tori must now perform a stunt involving jumping 40 feet off a platform, or risk getting blackballed in Hollywood. She is too frightened to do it and she keeps stalling, so Beck dresses up as Tori to pretend that he is her and does the fall instead. At the end, Tori decides she does want to do the fall to prove she is not a wimp, but she gets scared again, so Jade pushes her off making her fall down. Meanwhile, Cat dresses up in random costumes that she made in her costume design class. Absent: Daniella Monet as Trina Vega 22 3 \"Ice Cream for Ke$ha\" Adam Weissman Arthur Gradstein April 22, 2011 210 4.0 When Tori is stuck being Trina's assistant after losing a bet they made when they were little kids, she and her friends try to win a private concert from Ke$ha by finding all the letters to Ke$ha under ice cream cartons as a way to free Tori from Trina. They have all the letters except for the $ in Ke$ha so they get it from a little boy, but he says that Tori, Cat, and Jade must kiss him, and he has to be invited to the Ke$ha concert. In the end, Tori locks the little boy outside her home during the concert, but Trina who, feeling sympathy for him, offers him to kiss her, to which he replies \"gross\" and promptly leaves. Special guest star: Kesha as herself Guest star: Louie Sebert as Kid. 23 4 \"Tori Gets Stuck\" Russ Reinsel Jake Farrow May 14, 2011 205 4.2 Tori and Jade compete with each other for the lead role in a play called \"Steamboat Suzy.\" Tori wins the lead, with Jade as her understudy. But when Robbie is rushed to the hospital, Tori jeopardizes her role to give him blood. Jade wants to play the lead, so she makes some relentless attempts to keep Tori from showing up for the play. Sikowitz ends up playing the lead, refusing to let Jade be in the play due to her attitude all week. Meanwhile, Trina practices her hacking and coughing for the role of a sick girl in the play, but ends up getting tuberculosis after going with Tori to the hospital. Absent: Avan Jogia as Beck Oliver. 24 5 \"Prom Wrecker\" Adam Weissman Matt Fleckenstein May 21, 2011 211 3.6 Tori decides to throw a prom at Hollywood Arts. Jade is furious to find out that Tori booked the prom on the same night as her art project and refuses to switch it, so she decides to ruin the prom as revenge. Robbie thinks Cat is lying about having a date to the prom after she turns him down. Trina asks Sinjin to rig the prom queen election so she can win, while in turn she promises to be his date to the prom. Andre's new kissing-obsessed girlfriend is driving him crazy. Guest star: Tristin Mays as Sherry. Absent: Avan Jogia as Beck Oliver. Song featured: \"Best Friend's Brother\" 25 6 \"Locked Up!\" Steve Hoefer Dan Schneider July 30, 2011 203–204 5.2 Tori and the gang are offered a week-long trip to Festus' home country of Yerba to perform as evening entertainment for the hotel. Unexpectedly, the chancellor of Yerba comes to see their performance and in the middle of the song, Tori's shoe flies out and accidentally hits the chancellor's eye, which causes him to go blind. This makes Tori serve a four year prison sentence for assault. While Tori is in prison, her friends go to the chancellor's office and ask for Tori to be freed. The chancellor agrees, but then Robbie accidentally kills the chancellor's octopus, which causes them all to be sent to prison. Sikowitz, however, escapes, then later breaks into the prison in disguise as a guard with a plan to break them all out. Tori and the other prisoners sing a song and at the end of the performance, they all escape. Song featured: \"All I Want is Everything\" and \"I Want You Back\". Note: This is the second one-hour special, but in the U.K. and Ireland this episode aired in two different parts, while the U.S. and other countries aired the whole episode as one. 26 7 \"Helen Back Again\" Russ Reinsel Arthur Gradstein September 10, 2011 202 4.4 Principal Eikner resigns as principal of Hollywood Arts. Helen (from Drake & Josh) is hired as the new principal and decides to have every student re-audition in order for them to stay in the school. Despite a stellar audition with Andre, Tori is rejected, and the group tries to find a way to change Helen's mind about rejecting Tori. As it turns out, Helen's assistant mistakenly swapped Tori and Trina's names, so it was actually Trina who failed the audition. Tori then tries to get Helen to accept Trina into Hollywood Arts, and when Helen refuses, Tori asks Robbie to pretend to be a robber to 'rob' Helen in the school. She also plans for Trina to be there so Trina can 'defend' Helen against the 'robber' with her karate skills. In the end, this plans works and Trina gets accepted back into Hollywood Arts. Special guest star: Yvette Nicole Brown as Helen. 27 8 \"Who Did It to Trina?\" Adam Weissman Dan Schneider September 17, 2011 208 4.7 Tori directs a play and is forced to cast Trina as the lead when she blackmails her. On opening night, Trina's harness breaks and she swings around uncontrollably and falls, and the set crashes down on her. Questions then arise about whether the mishap was truly an accident, or intentional. Later, Lane finds out that the harness on her gimbal had been cut, and calls Jade, Andre, Tori, Cat, Robbie and Rex into his office to try to figure out what really happened. Everyone is declared a suspect until the real person behind this is caught. However, everyone has a different story which leads to a few arguments. In the end, they decide that the harness was just old and it just happened to snap. In Robbie and Rex's bedroom, Rex reveals to Robbie that he did it as revenge on Trina for whacking him in his face earlier in the episode. Absent: Avan Jogia as Beck Oliver. 28 9 \"Tori Tortures Teacher\" Russ Reinsel Matt Fleckenstein October 1, 2011 206 3.8 It is Sikowitz's 10th anniversary teaching at Hollywood Arts, and Tori and the gang celebrate by taking him to a play. But things go awry when Sikowitz becomes depressed after watching the play, and Tori feels guilty and tries to fix it. Meanwhile, Trina tries to impress a boy she likes by pretending to be a pizza delivery girl, and Beck and Jade are text-fighting. In the end, it is discovered that the true cause of Sikowitz's depression was that his girlfriend had dumped him and is moving to France; and Trina discovers that the boy she likes already has a girlfriend. 29 10 \"Jade Gets Crushed\" Clayton Boen Dan Schneider October 8, 2011 207 3.4 Andre develops a crush on Jade after they work together on a song and hearing her sing, and Tori tries to help him get over it. Also, Robbie tries to help Tori prepare for the Tech Theater exam she must take and pass in order to take an R&B; singing class, and Cat becomes obsessed with Jupiter boots. Song featured: \"365 Days\" Absent: Daniella Monet as Trina Vega. 30 11 \"Terror on Cupcake Street\" Steve Hoefer Dan Schneider October 15, 2011 212 3.4 Sikowitz gets Tori and the gang to build a float for a parade that his new girlfriend is planning. After finishing the float, the group is stranded in a dangerous part of town when the float gets a flat tire on the way to the parade. They then must try to find a way to fix the flat tire and find a way out of the town. 31 12 \"A Christmas Tori\" Steve Hoefer Dan Schneider & Warren Bell December 3, 2011 301 4.4 It is Christmas time at Hollywood Arts and Sikowitz assigns the gang as Secret Santas to one another in order to get them into the Christmas Spirit. The person who gives the worst gift will be forced to go \"Christmas Yodeling\" with Sikowitz on Christmas Eve. Tori struggles to find the perfect gift for Andre after finding out she is his Secret Santa. Meanwhile, Trina enlists Robbie's help to decorate her giant Christmas tree, and Beck loses sleep due to a pesky cricket in his RV. Also Andre becomes a Christmas \"Scrooge\" after getting a D on a song he wrote for his creative music class. Robbie gets Cat a candyfloss making machine, which she gets excited about because it comes with a man. She gives Robbie a kiss on the cheek then excitedly rushes away. For Beck's Christmas present, Andre catches the cricket, stating the fact that they apparently like peanut butter. At the end of the episode Andre gets an A thanks to Tori, Cat and Jade singing his song which he wrote for his creative music class. Song featured: \"It's Not Christmas Without You\" Note: This episode has a season 3 production code, and the opening sequence for that season. 32 13 \"Blooptorious\" Russ Reinsel Darren Thomas, Stefanie Ledar, Erica Spates & Sam Littenburg-Weisberg December 26, 2011 213 N/A This episode features interviews, bloopers, and outtakes of the entire cast since the series began. The show is hosted and narrated by \"Christopher Cane\", a ventriloquist's dummy, who introduces himself as the actor who portrays \"Rex\". ===Season 3 (2012)=== No. overall No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) 33 1 \"The Breakfast Bunch\" Steve Hoefer Dan Schneider & Jake Farrow January 28, 2012 302 3.9 This episode was a loose parody of the 1985 film The Breakfast Club. After arriving late for class because of Robbie choking on a pretzel, the gang has to spend a Saturday in detention. During the episode there are a lot of references to the movie, such as the phrases, the dancing scenes and the chasing in the hallway. A lot of the inappropriate dialogue and scenes are changed, such as the drug use (in the episode, taco eating is substituted) and the questions about virginity (in the episode they are about veganism). Special guest star: Rob Riggle as Vice Principal Dickers. Song featured: \"Don't You (Forget About Me)\" by the Victorious cast. 34 2 \"The Gorilla Club\" Steve Hoefer Dan Schneider & Warren Bell February 4, 2012 307 3.6 When Tori rehearses her audition for a movie, Sikowitz and Cat are unimpressed by her performance. After she is told she needs to take risks, the gang suggests The Gorilla Club, a dangerous underground club with life-threatening activities which include taking on an actual wild gorilla. Jade makes a bet with Andre and Robbie that if they lose they must do the \"Hammer Dance\" every time Jade tells them to do it. After they lose, Andre and Robbie are forced to do the dance at very inopportune and embarrassing moments, much to her amusement. 35 3 \"The Worst Couple\" Adam Weissman Dan Schneider & Matt Fleckenstein February 11, 2012 303 3.4 Sinjin enlists the gang to help him out with his game show, Queries for Couples. He pairs Tori with Robbie, Andre with Cat, and Beck with Jade (the only actual couple). During the game show, Beck and Jade discover that they are unhappy with their relationship. As a result, Tori, Andre, Robbie, and Cat have decided to hang out without them. This forces Jade and Beck to decide whether or not they should remain a couple. Meanwhile, Tori puts up with her heavily- battered phone while waiting for the release of a new phone model. Robbie thinks he and Tori are a couple after being paired together on Sinjin's game show. 36 4 \"Andre's Horrible Girl\" Steve Hoefer Dan Schneider & Warren Bell February 18, 2012 304 3.5 Tori notices that Andre's new girlfriend Hope is unfriendly and worries that he is changing to please her. He tells her that he is only dating her because her dad is a famous record producer. Andre wants to break up with her because he knows it is wrong, but does not want to miss the chance to perform at her birthday in front of her dad. After her breakup with Beck, Jade decides to help Cat dog-sit her mother's boss' dog. Things go awry when Jade accidentally damages the boss' guitar autographed by Elvis Presley, which leads them to turn to Robbie and Beck for help. Guest stars: Meagan Holder as Hope Quincy and Susan Chuang as Mrs. Lee. Song featured: \"Countdown\" by Leon Thomas and Victoria Justice 37 5 \"Car, Rain, and Fire\" Russ Reinsel Dan Schneider & Jake Farrow February 25, 2012 305 3.7 Cat hears her favorite actress Mona Patterson died and wants to honor her, taking Tori and Jade go on a road trip to San Diego. While on their journey, Tori, Cat, and Jade experience many mishaps and things do not go the way they planned. When Tori, Cat and Jade arrive at Mona's house, they learn that Mona wasn't dead, but rather she is going to act in a TV show called \"The Dead.\" Rudely, Mona chases the girls away from her house using a water gun. Later that night, Tori and Cat learn that Mona Patterson's house caught fire from the candle that Cat lit in front of Mona's house, and Mona was sent to the hospital. Due to over inhalation of smoke, Mona Patterson recalls that the candle was related to \"a cat with red fur\". Meanwhile, Trina has been spreading rumors that Beck asked her out. To get back at her, Beck, Andre and Robbie pretend to all want to date Trina, in an attempt to teach her a lesson about telling lies. Special guest star: Shirley Jones as Mona Patterson. 38 6 \"Tori & Jade's Playdate\" Adam Weissman Dan Schneider & Matt Fleckenstein March 3, 2012 306 4.2 Tori and Jade are cast in a play as a married couple, a task that challenges their acting skills and lack of friendship. Sikowitz sends them on a date at Nozu to bond. There, they meet two boys who hit on them and can't take a hint they aren't interested. They sing a song during karaoke to try to get rid of them. Later, the boys show up at the play, and Tori and Jade make a run for it. Elsewhere, Cat and Robbie embark on a business venture in which they tell people negative news by singing to them in an upbeat manner. Unfortunately, Trina does not take her bad news well and smashes Robbie's guitar and their business ends. Note: In the U.K., this episode used the season 2 opening titles, instead of season 3. Song featured: \"Take A Hint\" by Victoria Justice and Elizabeth Gillies 39 7 \"April Fools Blank\" Russ Reinsel Dan Schneider & Matt Fleckenstein March 24, 2012 311 When April Fool's Day comes to Hollywood Arts, Tori spends her day expecting creative pranks and practical jokes, but is completely oblivious to a series of absurd events and crazy happenings around her. Special guest stars: Dennis Haskins as Mr. Belding, Drake Bell as himself and Jerry Trainor as Spencer Shay. Guest stars: The Dancing Lobsters as themselves. Song featured: \"Shut up & Dance\" by the Victorious Cast Note: This episode featured different opening credits. The episode includes references to Saved by the Bell, The Amanda Show, iCarly, Match Game, Willy Wonka and the Chocolate Factory, The Wizard of Oz and Saturday Night Live. 40 8 \"Driving Tori Crazy\" Russ Reinsel Dan Schneider & Matt Fleckenstein April 14, 2012 308 3.2 A movie shoot down the street from Tori's house causes her and Trina to take the long way to school, but after shaving Trina's legs and her armpit she does not want to drive for 40 minutes to school with her anymore. Riding with Beck, a bunch of other obnoxious girls are in the car and Tori gets in a fight with them. With Andre, his grandma causes trouble. With Robbie, he really rides his bike but ends up going very slow. And Jade tries to drive Tori into \"Shadow Creek Woods\", but Tori jumps out of the car before they enter. After, she walks 11 miles to school and was chased by a beaver. Meanwhile, Cat uses a new app called \"Tap It!\", which is an online coupon sending company. She finds a deal where a party bus can take Tori to school for 90% off. When the teens are in the bus, they find out that their driver is \"Dr. Rhapsody\", a rapper from the 90's. The episode ends with Dr. Rhapsody puts on his only hit single \"Five Fingaz (To The Face)\" and the group sings the karaoke version. Song featured: \"Five Fingaz (To The Face)\" Guest stars: Sloane Avery as Kimberly, Marcus Folmar as Dr. Rhapsody. 41 9 \"How Trina Got In\" Russ Reinsel Dan Schneider & Christopher J. Nowak May 5, 2012 309 2.4 Tall tales are told about Trina and how she gained admission to Hollywood Arts. Andre says that it is because Trina did have talent back then, but Sinjin accidentally hits her with a stage light, knocking the talent out of her. Jade says that when she did her terrible singing, the staff said no, but then Trina threw a gas bomb, making them pass out (except for her because she wore a gas mask). Trina checks yes for each clipboard, followed by the staff not remembering this. Beck says that when Trina sang terribly, the staff said no. Trina set up another deal by putting up a fighting challenge for the staff, and if she wins, she would get in. The true reason on how Trina got in is revealed by Sikowitz, who says that when the rest of the staff ran to get Sinjin's head unstuck from the soda machine, he watched Trina's audition himself. He had drank rotten coconut milk, which made him hallucinate and see Trina doing talented and funny stuff, and Sikowitz let her in. Meanwhile, Robbie forgets his wallet in his locker and is unable to pay the bill after a meal at Nozu, and Tori and him have to work at Nozu to pay the bill off. They cannot get out because of Kwakoo, one of Nozu's tough workers. All three of them chop 17 pounds of squid. When they try to leave, Robbie accidentally breaks a pile of dishes, and he has to stay and massage Kwakoo's feet. Guest star: Susan Chuang as Mrs. Lee. 42 10 \"Tori Goes Platinum\" Steve Hoefer Dan Schneider & Christopher J. Nowak May 19, 2012 315–316 3.8 Tori wins a contest to sing the opening number at the Platinum Music Awards. The show's producer, Mason Thornesmith, and his team want to re-invent her look and personality for publicity. Tori has to dress crazy and act mean, and she is not allowed to tell anyone about this, not even her friends and family, or she won't be allowed to perform. Her friends at school are shocked by it, and it becomes a problem for Tori when everyone believes she is letting the fame get to her head. Eventually, Beck finds out about Tori's secret by himself because he knows that Tori would not change so much on purpose. Beck and Tori almost kiss before being interrupted by Mrs. Vega, but Tori ends up telling Mason and the producers that she cannot take it anymore, which results in Mason not letting her appear in the Platinum Music Awards. They give Jade the chance instead, when Mason recalls her from her audition which he approved of, and she accepts. After Cat accidentally leaves a video chat on, Jade sees Beck trying to kiss Tori, only for her to reject him and explain that she feels that kissing a friend's ex to be wrong. Later, Tori goes to meet Jade at the Boomerang Theatre to support her upcoming performance. Jade then lets Tori perform herself, finally making a friendship, while Jade goes into the audience to watch her. Even though Tori was fired, she performs \"Make It In America\", which Mason sees. He is annoyed at first since he had dismissed Tori, but eventually likes it when it proves to be a big hit. Songs : \"Make It In America\" by Victoria Justice and \"Cheer Me Up\" by Victoria Justice Note: This is a one hour special. 43 11 \"Crazy Ponnie\" Clayton Boen Dan Schneider & Warren Bell June 9, 2012 310 2.6 Tori is befriended by Ponnie, a new student, when meeting her eating lunch inside a bathroom stall. Ponnie, however, keeps disappearing around everyone else, making the Hollywood Arts students think that Tori is losing her mind. Ponnie turns out to be crazy. She runs away at lunchtime, stays away from class, gives Tori a creepy doll that resembles her, and impersonates a Chinese food delivery lady. Ponnie also dumps noodles on Tori's head. Tori talks to her mom about the problem, and they plan on calling the police. When Tori tries to get a can of juice, Ponnie grabs her, and then tells the truth – that her real name is Fawn Leibowitz, and before Tori went to Hollywood Arts, Ponnie was a student there, and she claims that they kicked her out because they wanted to make room for Tori. Once the police arrive and apprehend Ponnie, Sikowitz recognizes her and says that she got kicked out because she was crazy – she stole things, kept weird stuff in her backpack, and called people \"Debbie\". She is arrested and taken away. The secondary plot of this episode features Cat accidentally waxing Jade's eyebrows off and Jade chasing Cat around, trying to get back at her. When Cat falls asleep in study hall, Jade shaves all of Cat's hair off. Also, Trina keeps blowing her nose, which causes her tissues to have a lot of snot in them, and afterwards, she starts to get a fever. During the final 30 seconds, Tori and Trina get a drive home by a police officer, who, when the camera zooms into her face, is revealed to be Ponnie! This, however, is never mentioned in any episode thereafter. Special guest star: Jennette McCurdy as Ponnie (Fawn Leibowitz). 44 12 \"The Blonde Squad\" Steve Hoefer Dan Schneider & Warren Bell June 30, 2012 313 3.8 Tori, Jade, and Cat decide to go to Nozu after a day of filming Beck's new movie called \"The Blonde Squad,\" but do not take off their blonde wigs and their blue contact lenses because Tori wants to know what it is like to be blonde. At Nozu, Cat meets a cute boy named Evan on her way to the bathroom. After talking to him for five hours, she forgets to tell him that she actually has red hair and brown eyes. Tori and Robbie tell her that she is beautiful, and when Cat talks to Robbie about Evan, Robbie gets jealous. During lunch, Jade checks Evan's SplashFace profile, and shows that all of his ex-girlfriends are blondes, revealing that he prefers blonde girls, and dislikes people not being themselves. Robbie has a sudden outburst and professes that Cat is adorable and any guy would be lucky to go out with her. On the night of the premiere of Beck's movie, Jade and Tori expect Cat to be herself, but Cat walks in to meet Evan wearing her blonde wig and blue contacts. During the movie, Andre's grandmother's pet bird lands on Cat's wig, and begins to shift it out of place. Beck pauses the movie as Cat runs out of the theater, followed by Tori and Robbie. Tori forces Cat to show her true self to Evan, convincing her that he will like her as herself. Cat then shows Evan her real hair color. Evan tells her she is beautiful, but he likes blondes and leaves her. Cat, heartbroken, does not appreciate Tori's advice, but Robbie performs his song \"I Think You're Swell\" to Cat in the end. However, she only responds by saying that maybe she should dye her hair blonde, which leaves Robbie exasperated. Meanwhile, Andre tries to capture his grandma's pet bird, Larry. Guest stars: Max Carver as Evan Smith, Michael Eric Reid as Sinjin, Darsan Solomon as Burf. ===Season 4 (2012–13)=== No. overall No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) 45 1 \"Wanko's Warehouse\" Adam Weissman Dan Schneider & Christopher J. Nowak September 22, 2012 312 3.60 The gang goes to Wanko's Warehouse for an 80%-off sale, but they find out it does not start until the next morning. Jade suggests that they all hide out in the store overnight so they can be the first ones there and avoid the long lines. However, the security system gets turned on, leaving them trapped in an aisle by laser beams. Robbie is able to get under the beams and tries to turn off the alarms, but stumbles upon two burglars. Meanwhile, Jade complains that she is hungry and Cat walks through the laser beams to get her a sandwich but accidentally sets off the alarm. They all run outside, covering their heads with tubs, and manage to get away unseen by the security cameras. Note: Nickelodeon advertised this as the season premiere. In the U.K. and Ireland, this episode is called \"The Warehouse\", due to Wanko being similar to a curse word in those countries. 46 2 \"The Hambone King\" Russ Reinsel Dan Schneider & Matt Fleckenstein September 29, 2012 314 2.39 Robbie posts a video online spotlighting his rhythmic talent of hamboning, but Jarold, who claims to be the real hambone king sees it. He challenges Robbie and Robbie messes up and embarrasses himself. Later, Tori reveals that seven years ago she and Jarold hamboned together. Following this, Robbie asks Tori to coach him. During the competition, Jarold's friend throws sushi at Robbie, causing him to mess up. Tori decides to face Jarold and ends up winning and becoming the hambone queen. Meanwhile, Cat practices tap-dancing nonstop for an upcoming audition. 47 3 \"Opposite Date\" Steve Hoefer Dan Schneider & Warren Bell October 13, 2012 317 3.65 Tori, Beck, Andre and Robbie plan to go to a museum, but Andre and Robbie back out so they can make a video for a contest. Realizing that it will just be the two of them together, Tori and Beck decide they will go on an \"opposite date\" so people do not think they are really dating. However, Cat accidentally tells Jade about this and Jade gets upset. Pretending to be Cat, Jade calls Tori and finds out where they are. After eating gross seafood, Tori and Beck have to take Beck's aunt's dog to the vet. While there, they discuss how they are not really on a date, and people in the vet's office overhear. They start to ask Beck why he broke up with Jade and if he has feelings for Tori. Before he can really answer any of them, Jade and Cat walk in. She says she is not mad and Beck can hang out with whomever he wants. Beck and Jade smile at each other until they are interrupted by the vet. Meanwhile, Andre and Robbie make a video to win a new Pear Pad 3, but they fall while wearing giant pear costumes and cannot get up. Absent: Daniella Monet as Trina Vega. 48 4 \"Three Girls and a Moose\" David Kendall Dan Schneider & Christopher J. Nowak October 20, 2012 319 3.24 Beck, Andre, and Robbie are hosting a fundraiser at Karaoke Dokie to get a new guys' bathroom at Hollywood Arts, and the girls are supposed to help them. However, they get distracted when they meet Beck's Canadian friend Moose and all three of them begin to compete for his attention. Cat brings him hamburgers, Tori pretends to love hockey, and Jade talks to him about her favorite movie, The Scissoring. Despite their efforts, Moose tells them he is more into Canadian girls. Tori and Cat apologize to the guys for neglecting their fundraiser by performing the song \"L.A. Boyz\" for them. After their song, they wonder where Moose is, and it is revealed that he is in Jade's car kissing her. Guest star: Brandon Jones as Moose. Song featured: \"L.A. Boyz\" by Victoria Justice & Ariana Grande 49 5 \"Cell Block\" Adam Weissman Dan Schneider & Warren Bell November 24, 2012 318 3.50 Sikowitz gets frustrated when the kids keep using their phones during rehearsal, so he challenges them to go one week without using modern-day technology. After Cat goes crazy without her phone, the boys realize the girls might make them lose the bet, so they turn it into a boys vs. girls challenge. Jade and Tori have to restrain Cat from using her phone, and they know winning will be very hard, so they try to trick the boys into losing the bet. However, it is unsuccessful. At their next rehearsal, Sikowitz gets angry at everyone and tells them to take their phones if they want to. The girls turn theirs on and the boys told them it was a trick and they lost the bet. Sikowitz said he was helping the boys all along because he is a guy and wanted his gender to win. As the boys shout and dance in victory, the girls realize how popular they were when seeing how many messages and followers they got while they went without the internet happily. Absent: Daniella Monet as Trina Vega. 50 6 \"Tori Fixes Beck and Jade\" David Kendall Dan Schneider & Warren Bell December 1, 2012 320 2.84 A girl named Meredith wants to go out with Beck, but he is uncomfortable with it because he does not want to make Jade jealous. Tori decides to try to find Jade a date to even things out, but when recalling how intimidating Jade is, she and Andre pay a guy to ask her out. He gets scared and admits to Jade that Tori and Andre paid him to ask her out, leading them to hide in the janitor's closet. Furious, she finds and confronts them, but Beck stops her. When Tori explains why she was trying to find her a date, Jade tells Beck he can go out with whomever he wants because they are broken up. Beck takes Meredith to the Full Moon Jam only to find she agrees with everything he says, annoying him. He then tells Tori how he realizes that he wants a girl who \"fights back\" and can be a challenge to date because easy is \"boring\". Right after this, Jade performs a song and Beck watches her. After she is done, he goes on stage and admits that he has missed her. They then kiss and get back together. Meanwhile, Cat gets a butterfly that Robbie is \"butterfly-sitting\" lodged in her ear and Robbie has to find a way to get it out. The episode ends where Jade and Beck are officially a couple again and Robbie finally gets the butterfly out of Cat's ear. Song featured: \"You Don't Know Me\" by Elizabeth Gillies 51 7 \"One Thousand Berry Balls\" David Kendall Dan Schneider & Dave Malkoff December 8, 2012 326 2.70 Robbie wants Cat to be his date to an upcoming Hollywood Arts dance, but she avoids him. After Robbie and another girl go, Cat realizes her feelings for Robbie and becomes jealous. At the dance she tries to make Robbie jealous by dancing with Sinjin and ends up getting kicked in the head by him and goes unconscious. When she wakes up, they talk and Robbie makes his move and kisses her, resulting in her running away from him and riding off on her bike in a panic. The dance is the first social event that Beck and Jade attend since getting back together and Jade becomes stressed over it. The dance at Hollywood Arts is the \"CoWow\" which is a mix between a Hawaiian and Cowboy theme. Tori and Andre sing at the dance after being held up at Totally Yogurt giving away one thousand of their berry balls. As a result, Tori puts the berry balls in her hat because no one will try them. Song featured: \"Here's 2 Us\" Absent: Daniella Monet as Trina Vega 52 8 \"Robbie Sells Rex\" Adam Weissman Dan Schneider & Christopher J. Nowak December 15, 2012 321 3.55 Mason Thornesmith's son offers to buy Robbie's puppet, Rex, for two thousand dollars. Robbie gives in and sells Rex, but ends up regretting his decision. Sikowitz has problems of his own when a young girl keeps harassing him, causing him to threaten to get her sent to juvie. Tori decides to distract the little boy by getting the girl to kiss him, making him forget about Rex and allowing Robbie to get him back, in exchange for Sikowitz dropping the charges against her. The plot works and Robbie now has $2,000 and Rex. Meanwhile, a masked person (a.k.a. The Flour Bomber) is throwing flour at people at Hollywood Arts and no one knows who he is. When Jade, Beck, Andre and Cat finally catch him, he turns out to be a stranger from another school. Guest stars: Cole Jensen as Francis Thornesmith and Mackenzie Brooke Smith as Rhoda Hellberg. 53 9 \"The Bad Roommate\" Steve Hoefer Dan Schneider & Warren Bell January 5, 2013 322 3.38 Andre is tired of living with his crazy grandmother and he decides to bunk with Tori, but it does not turn out well. Later, it is also discovered that while Andre's grandmother drives him nuts, she is the main reason he's good at writing music. Tori and Andre get Kojeezy to buy their song, but he would only buy the song if it passed the \"baby test\", which the song fails the test because the baby cried. Meanwhile, a new app on the Pear Pad which shows satellite images displays a picture of Hollywood Arts, and Jade is in that picture looking like she is picking her nose when she was really scratching it. She plans on getting it re-taken when the satellite passes again, but the picture turns out even worse for her when Robbie falls on top of her, making it look like they're kissing. Song featured: \"Faster Than Boyz\" Guest star: Kool Kojak as Kojeezy. 54 10 \"Brain Squeezers\" Clayton Boen Dan Schneider & Warren Bell January 12, 2013 324 2.69 Tori is selected to appear on a new game show called Brain Squeezers, and all her friends want to be on her team. Annoyed with them bugging her, she finally picks Andre, Beck, and Robbie. When she goes to the game show to sign in, she finds that Jade is already there, pretending to be Tori. Jade takes her teammates and Tori is left to play with Trina, Sinjin, and Cat. It turns out that the game show isn't as fun as they anticipated. Whenever someone gets a question wrong, they get \"doinked\" and have something sprayed at them or dropped on their head. After a while, when everyone is injured and unhappy, Tori's team wins $10,000. However, in order to take home the money, Tori has to grab it while a sumo wrestler is holding her down. She is unable to do it, and no one wins the money. Guest star: WWE wrestler Rikishi as a sumo wrestler. 55 11 \"The Slap Fight\" Steve Hoefer Dan Schneider & Christopher J. Nowak January 19, 2013 327 2.73 Tori finds out that Trina has 977 followers to her 314 on TheSlap.com. Tori tells the gang about Trina. Right afterwards, the gang starts to post random stuff to get more followers on TheSlap. Their posts include Cat writing everything she does, Jade trying to scare people by screaming at them to follow her, Beck washing his car in a tank top, Robbie getting a makeover, and Tori trying to do a hard challenge. Sinjin finally tells them how Trina got 977 followers, explaining that three months ago he hacked into TheSlap server and changed her number of followers (which was actually 34) to 977 for learning how to jump-rope. He also tells them he finds them ridiculous, as they are the most popular students at Hollywood Arts, have a lot of friends and that its stupid to be worried about how many followers you have. The gang realize he is right and feel ashamed. The final scene shows Trina and Sinjin jump-roping, but he annoys her and Trina leaves. Note: In production, that was the last Victorious episode ever filmed. 56 12 \"Star- Spangled Tori\" Adam Weissman Dan Schneider & Christopher J. Nowak January 26, 2013 325 3.01 Tori worries she will forget the lyrics when she is invited to sing the National Anthem at a televised basketball game. But Tori really needs to worry about being dragged across the floor by the team's mascot, a St. Bernard. A talk-show host named Chris Burm feels sympathy for Tori and lets her come and sing on his show. But then he reveals (to the audience) that he is going to pull a prank on Tori. Beck and Andre save Tori from humiliation, by reversing the prank on the host. Meanwhile Jade and Robbie find out that Cat has been acting weird and disappearing every night. They find her living at the tiny attic of the blackbox theater in school because her parents are with her brother in Idaho in some special hospital/rehab. Jade calls her parents, who say her Nona is in Venice, California and suggests that Cat move into her Nona's home instead, thus setting up half the stage for the then upcoming, Sam & Cat.¨ Song featured: \"Bad Boys\" by Victoria Justice 57 13 \"Victori-Yes\" David Kendall Dan Schneider & Christopher J. Nowak February 2, 2013 323 2.89 Sikowitz makes a bet for the gang to say yes to everything and anything for a day, as long as it doesn't involve people getting hurt. Robbie and Cat have to say yes to giving up their clothes to some men on the street (They end up hiding behind garbage cans). Beck tries to trick Jade into going to a drag race, but instead goes with Sinjin and ends up having a great time. Trina brags being on a Mexican television show called \"Divertisimo\". She says that it's not shown in the U.S., but Tori and Jade find out it is and go down to the studio. Trina is dressed as a giant cheese who is chased by little kids in mice costumes. Tori gets asked to be in the show and she says yes. Then she asks if Jade can be in it too. In the end, all three are dressed as cheese being chased by the little kids with giant forks. After being poked by one, Jade steals his fork and angrily chases him. Category:2010 in American television Category:2011 in American television Category:2012 in American television Category:2013 in American television Category:Lists of comedy television series episodes Category:Lists of Nickelodeon television series episodes",
 "title": "List of Victorious episodes"
}