{
 "id": "62058",
 "text": "Eric Theodore Cartman is a fictional character in the animated television series South Park. He is voiced by co-creator Trey Parker. == Appearance == Eric is an overweight child, who wears a red winter jacket, yellow gloves, brown pants, and sports a light blue/cyan woolly hat with yellow rims and a yellow poof ball on top of it. == Overview == Cartman is one of four main characters in the series. He is often the main reason for their adventures because of his over-enthusiasm and selfishness. == Hates == Cartman often reacts violently to things that he hates. He hates any race or group of which he is not a member, particularly the Jews. He also has sociopathic tendencies. This comes from his rivalry with Kyle Broflovski. In an older pilot episode for South Park, Cartman is killed, causing Stan and Kyle to utter the iconic phrase: \"Oh My God, They Killed Kenny; You Bastards!\", although, since it was \"Cartman\" who was killed, this makes us believe that originally, Cartman was Kenny (vice versa). == Evil Activities == Eric idolizes Adolf Hitler, Henry Ford, and Mel Gibson. He is also a fan of T.S. Elliot. He often tricks others, at which he is good at, to meet his own ends, no matter the consequences to other people, even if it can result in deaths. Cartman has gone to prison. In the earlier seasons, Cartman was often seen taking advantage of or tricking Butters Stotch into doing something, at the expense of Cartman's enjoyment. These include, forcing Butters to stay in a bunker so Eric can take his place in going to an event and plastering a fake pair of testicles on his chin so he can go on television. == Family == Cartman lives with his mother. He previously had a pet pig and cat, but they both stopped appearing in episodes. In the original pilot episode, Cartman and his mother are seen eating dinner with a man and little girl, presumably his father and younger sister. Whilst episodes have been dedicated about the identity of Eric's father, nothing has ever been said of the mysterious sister. It is eventually revealed that his father is that of Mr. Tenorman, father of Scott Tenorman, Eric's one-time rival. What makes this worse is that, in one episode, he grinds Scotts' parents into chilli after they stole a pony and feeds it to Scott. With this information, that means that in reality, Eric grinded up his own Father. In an earlier season, Cartman, Linda, Kyle, Kenny, and Stan travel to the state of Nebraska to meet Eric's relative. Many of the younger male relatives have a striking resemblance to him, such as his youngest cousin named Elvin, who was always carrying a melting chocolate ice pop and had chocolate smeered on his mouth. We never and hear of these Nebraskan relatives after the episode. Cartman was briefly in a relationship with school student, Heidi Turner. Category:Comedy movie characters Category:Fictional characters introduced in 1997 Category:South Park characters",
 "title": "Eric Cartman"
}