{
 "id": "620671",
 "text": "Russia sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. They competed as \"Neutral Paralympic Athletes\" in 5 sports. Only Russian sportspeople that had not participated in doping were allowed to compete. On 26 February 2018, the International Paralympic Committee (IPC) said which people from Russia could compete as Neutral Paralympic Athletes at the 2018 Winter Paralympics. The list included 30 people. They were going to compete in para-alpine skiing, para-Nordic skiing, para-snowboarding and wheelchair curling. Ekaterina Rumyantseva won gold and Anna Milenina won silver in the women's 6 km biathlon standing race. In the women's 6 km biathlon visually impaired race, Mikhalina Lysova won gold. The medals were won on 10 March, the first day of para-Nordic skiing competition at the 2018 Games. == Team == On 26 February 2018, the International Paralympic Committee (IPC) said which people from Russia could compete as Neutral Paralympic Athletes at the 2018 Winter Paralympics. The list included 30 people. They were going to compete in para-alpine skiing, para-Nordic skiing, para- snowboarding and wheelchair curling. 10 people are competing in para-alpine skiing, 12 in para-Nordic skiing, 3 in para-snowboarding and 5 in wheelchair curling. The team also includes 6 guide skiers. There are also going to be 39 support people and officials. Despite limitations on who can compete because of the doping scandal, Neutral Paralympic Athletes from Russia will be one of the largest delegations at the Games. The table below contains the list of members of people (called \"Team NPA\") that will be participating in the 2018 Games. Team NPA Name Sport Gender Classification Events ref Akzhana Abdikarimova para-Nordic skiing female German Agranovskii para-alpine skiing male guide skier Sergey Alexandrov para-alpine skiing male Alexandr Alyabyev para-alpine skiing male Natalia Bratiuk para-Nordic skiing female Alexey Bugaev para-alpine skiing male Nadezhda Fedorova para-Nordic skiing female Ivan Frantcev para-alpine skiing male Aleksandra Frantseva para-alpine skiing female Marina Galitsyna para-Nordic skiing female Evgeny Geroev para-alpine skiing male Irina Guliaeva para-Nordic skiing female Vladimir Igushkin para- snowboarding male Maria Iovleva para-Nordic skiing female Anastasia Khorosheva para-alpine skiing female Natalia Kocherova para-Nordic skiing female Konstantin Kurokhtin wheelchair curling male Andrey Meshcheryakov wheelchair curling male Iuliia Mikheeva para-Nordic skiing female Alexey Mikushin para-alpine skiing male Anna Milenina para-Nordic skiing female Ekaterina Moshkovskaia para-Nordic skiing female Artem Norin para-Nordic skiing male guide skier Mariya Papulova para-alpine skiing female Maksim Pirogov para-Nordic skiing male guide skier Semen Pliaskin para-alpine skiing male guide skier Valery Redkozubov para-alpine skiing male Marat Romanov wheelchair curling male Ekaterina Rumyantseva para-Nordic skiing female Daria Shchukina wheelchair curling female Alexander Shevchenko wheelchair curling male Mikhail Slinkin para-snowboarding male Aleksandr Tsygankov para-snowboarding male Alexander Vetrov para-alpine skiing male Marta Zaynullina para-Nordic skiing female The following is the list of number of competitors that could participate at the Games per sport/discipline. Sport Men Women Total Alpine skiing 6 3 9 Biathlon Cross-country skiing 0 13 13 Snowboarding 3 0 3 Wheelchair curling 4 1 5 Total 13 17 30 == Doping scandal == After the 2014 Winter Paralympics, the McLaren report said 35 people from Russia had done doping during the Games in Sochi. A decision had been made by mid-2016 that Russia would not be able to compete under the Russian flag at the 2018 Games. The International Paralympic Committee (IPC) set conditions for Russia's membership in November 2016. The McLaren Report, printed in December 2016, said more than 1,000 Olympic and Paralympic people had been involved with Russia's government sponsored doping program. In early January 2017, the Russians asked the ban be removed. They wanted to be able to participate in specific qualifying competitions. In April 2017, a proposal was made to allow Russians to compete using a neutral flag. This was rejected. The IPC explained that people could only use a neutral flag if they were refugees or had no National Paralympic Committee. In May 2017, the IPC said the Russians had until September 2017 to meet all the conditions if they wanted to go to the Winter Paralympics. If they did not meet the conditions, the Russians probably would not be able to go. 15 National Paralympic Committees and the International Wheelchair and Amputee Sports Federation signed a letter expressing support for the National Paralympic Committee of Russia in August 2017. The countries included Armenia, Belarus, Bulgaria, Vietnam, Kazakhstan, Kyrgyzstan, China, Laos, Moldova, Mongolia, Serbia, Tajikistan, Montenegro, and South Korea. They asked the IPC Governing Board to consider letting Russia compete at the 2018 Winter Paralympics. The letter was signed weeks before the IPC Governing Board met in Abu Dhabi. In September 2017, this decision was reviewed and upheld. The International Paralympic Committee (IPC) still had concerns about doping in Russian sport. All the conditions the IPC required of the Russians were not met. In October 2017, Russians were allowed to compete in qualifying as Neutral Paralympic Athletes. They were allowed to do this in alpine skiing, biathlon, cross-country skiing and snowboarding. A decision was not made in October about their participation at the 2018 Games. Because the IPC thought Russia had a doping program run by the government, Russian people were stopped from going to the Games with the Russian flag at the 2018 Games. Some Russian people competed as \"Neutral Paralympic Athletes\" if the IPC thought they were had not done doping. Because of this, Russians were allowed to compete in 5 sports: para-alpine skiing, cross-country skiing, biathlon, snowboarding and wheelchair curling. Russians were allowed to compete because the IPC thought their National Paralympic Committee had met some of the conditions the IPC had demanded of them. More improvements were still needed though before they could compete at the Paralympics as Russia. Russia's Paralympians currently face more difficult conditions than those of Russia's Olympians. The Government of Russia has said the allegations about doping are not true. They blame the United States, saying it is a conspiracy to make sure they cannot compete. Vladmir Putin said the United States was doing this to try to prevent him from winning the election for President of Russia. All eligible people from Russia would need additional testing for use of banned substances. The testing would be more than people from other countries would have to do. As of 29 January 2018, the IPC said 30 to 35 Russian sportspeople might be able to go to the Games the way to decide who was going was still taking place. The last date to win a spot at the 2018 Paralympics was 23 February. The situation mirrors what happened at the 2016 Summer Paralympics, where Russian sportspeople were not allowed to compete using the flag of Russia. == Medalists == Medal Name Sport Event Date Biathlon Women's 6 km, standing Guide: Alexey Ivanov Biathlon Women's 6 km, visually impaired Biathlon Women's 6 km, standing | width=\"22%\" align=\"left\" valign=\"top\" | Medals by sport Medals by sport Medals by sport Medals by sport Medals by sport Sport Total Biathlon 2 1 0 3 Total 2 1 0 3 Medals by date Medals by date Medals by date Medals by date Medals by date Medals by date Day Date Total Day 1 10 March 2 1 0 3 Day 2 11 March 0 0 0 0 Day 3 12 March 0 0 0 0 Day 4 13 March 0 0 0 0 Day 5 14 March 0 0 0 0 Day 6 15 March 0 0 0 0 Day 7 16 March 0 0 0 0 Day 8 17 March 0 0 0 0 Day 9 18 March 0 0 0 0 Total Total 2 1 0 3 == Alpine skiing == === Qualification === On 28 January 2018, it looked like 14 skiers from Russia could go to South Korea. === Schedule === The first event on the para-alpine program was the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program was Super-G. All skiers raced between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. === Results === ; Men Athlete Class Event Run 1 Run 2 Total Time Rank Time Rank Time Rank Alexander Alyabyev LW6/8-2 Downhill, standing|colspan=4 1:30.41 11 Super-G, standing|colspan=4 1:31.83 19 Alexey Bugaev LW6/8-2 Downhill, standing|colspan=4 1:28.68 7 Super-G, standing|colspan=4 1:28.47 5 Ivan Frantsev Guide: German Agranovskii B2 Downhill, visually impaired|colspan=4 1:30.72 5 Super-G, visually impaired|colspan=4 1:29.30 5 Alexey Mikushin LW6/8-1 Downhill, standing|colspan=4 1:35.67 23 Super-G, standing|colspan=4 1:34.76 26 Valery Redkozubov Guide: Evgeny Geroev B2 Super-G, visually impaired|colspan=4 1:31.26 6 ; Women Athlete Class Event Run 1 Run 2 Total Time Rank Time Rank Time Rank Maria Papulova LW6/8-2 Downhill, standing|colspan=4 1:36.12 5 Super-G, standing|colspan=4 1:37.11 5 == Nordic skiing == === Qualification === On 28 January 2018, it looked like 6 women and 10 men from Russia could go to South Korea. One Russian woman in her early 30s said she intended to compete in Pyeongchang. Vladimir Kiselev said he was not allowed to compete in South Korea. He said he had also been stopped from going to the 2016 Summer Paralympics. === Schedule === On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Thee sprint classic qualification takes place on 14 March from 10:00 AM – 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. === Results === ==== Biathlon ==== In the women's 6 km biathlon standing race, Ekaterina Rumyantseva won gold, Anna Milenina won silver, and Liudmyla Liashenko of Ukraine won bronze. In the women's 6 km biathlon visually impaired race, Mikhalina Lysova won gold, Oksana Shyshkova of Ukraine won silver and Sviatlana Sakhanenka of Belarus won bronze. Women Athlete Class Events Final Real Time Calculated Time Misses Rank Akzhana Abdikarimova LW10.5 6 km, sitting 28:34.1 25:42.7 2 (1+1) 11 Natalia Bratiuk LW8 6 km, standing 20:50.6 20:00.6 1 (1+0) 11 Nadezda Fedorova LW12 6 km, sitting 24:54.4 24:54.4 5 (2+3) 10 Marina Galitsyna Guide: Maksim Pirogov B1 6 km, visually impaired 24:12.1 21:17.8 3 (1+2) 5 Irina Gulyayeva LW12 6 km, sitting 22:22.4 22:22.4 1 (1+0) 4 Natalia Kocherova LW12 6 km, sitting 22:41.1 22:41.1 0 (0+0) 5 Mikhalina LysovaGuide: Alexey Ivanov B2 6 km, visually impaired 18:59.7 18:48.3 0 (0+0) Yuliya Mikheeva LW8 6 km, standing 22:49.0 21:54.2 2 (1+1) 14 Anna Milenina LW8 6 km, standing 18:05.2 17:21.8 0 (0+0) Ekaterina Moshkovskaya Guide: Artem Norin B2 6 km, visually impaired 24:39.0 24:24.2 4 (2+2) 8 Ekaterina Rumyantseva LW5/7 6 km, standing 19:26.0 17:06.1 1 (0+1) Marta Zaynullina LW12 6 km, sitting 23:12.0 23:12.0 1 (0+1) 7 ==== Cross country skiing ==== ; Women ; Distance Athlete Class Event Final Real Time Calculated Time Deficit Rank Akzhana Abdikarimova LW10.5 12 km sitting 51:36.4 46:26.8 +8:10.9 16 Nadezda Fedorova LW12 12 km sitting 39:46.5 39:46.5 +1:30.6 5 Irina Gulyayeva LW12 12 km sitting 40:20.6 40:20.6 +2:04.7 6 Maria Iovleva LW12 12 km sitting 40:54.7 40:54.7 +2:38.8 7 Marta Zaynullina LW12 12 km sitting 39:09.0 39:09.0 +53.1 4 == Snowboarding == === Qualification === On 28 January 2018, it looked like 10 women and 7 men from Russia could go to South Korea. === Schedule and results === The snowboard cross event starts on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM – 4:55 PM for men and women in all classes. == Wheelchair curling == The wheelchair curling competition starts on 10 March. Russia plays against Sweden on 15 March. Team Group stage Tiebreaker Semifinal Final / Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank Konstantin KurohktinAndrei Meshcheriakov Marat Romanov Daria Shchukina GER L 4–9 KOR L 5–6 FIN W 12–5 NOR USA SVK GBR CAN CHN SUI SWE == References == Category:2010s in Russian sport Category:Nations at the 2018 Winter Paralympics",
 "title": "Neutral Paralympic Athletes at the 2018 Winter Paralympics"
}