{
 "id": "620638",
 "text": "Bulgaria sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. The country is sending one person, para-Nordic skier Svetoslav Georgiev. Georgiev competed at the Paralympics before. In 2014, he finished 16th in the 1 km sprint qualification race. == Team == Bulgaria is sending one person to compete at the 2018 Winter Paralympics. The person is blind skier Svetoslav Georgiev. Chairman of the Bulgarian Paralympic Association Iliya Lalov said they do not have high expectations. The country is good at Summer Paralympics. They are not good at winter sports like skiing. The table below contains the list of members of people (called \"Team Bulgaria\") that will be participating in the 2018 Games. Team Bulgaria Name Sport Gender Classification Events ref Svetoslav Georgiev para-Nordic skiing male B3 == History == Bulgaria has never won a medal at the Winter Paralympics. The country sent two people to the 2014 Winter Paralympics, and three people to the 2010 Winter Paralympics. The 2010 team included Joana Ermenkova, Alexander Stoyanov and Ivan Vatov. == Para-Nordic skiing == === Skiers === Svetoslav Georgiev competed at the Paralympics before. In 2014, he finished 16th in the 1 km sprint qualification race. That was two spots ahead of the other Bulgarian, Jelez Kolev, who competed in the same race. His best international ranking has been 27th. That was in 2014. The most recent recent ranking was in January 2018. He was ranked 36th. Georgiev is a member of the National Sports Academy Ski Club. He is coached by Ivan Birnikov. When he was young, his father encouraged him to practice sport. He started skiing when he was a 7-year-old. He started competing internationally in 2011. He was Bulgaria's flag bearer at the closing ceremony of the 2014 Paralympic Winter Games in Sochi. He has also represented Bulgaria in para-athletics. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in Bulgaria",
 "title": "Bulgaria at the 2018 Winter Paralympics"
}