{
 "id": "620633",
 "text": "Austria sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. Austria is sending 13 people to compete in three sports: para- alpine skiing, para-snowboarding and cross-country skiing. == Team == Austria is sending 13 people to compete in three sports: para-alpine skiing, para- snowboarding and cross-country skiing. The table below contains the list of members of people (called \"Team Austria\") that will be participating in the 2018 Games. Team Austria Name Sport Gender Classification Events ref Heike Eder para-alpine skiing male sitting slalom, giant slalom Carina Edlinger para-Nordic skiing female cross country skiing Julian Edlinger para-Nordic skiing male guide skier cross country skiing Markus Gfatterhofer para-alpine skiing male sitting slalom, giant slalom Thomas Grochar para-alpine skiing male standing super combined, Super-G, slalom, giant slalom Christoph Gmeiner para-alpine skiing male guide skier Super-G, super combined, slalom, giant slalom Claudia Lösch para-alpine skiing female sitting downhill, Super-G, super combined, slalom, giant slalom Patrick Mayrhofer para-snowboarding male slalom, snowboard cross Gernot Morgenfurts para-alpine skiing male vision impaired Super-G, super combined, slalom, giant slalom Nico Pajantschitsch para-alpine skiing male standing downhill, Super-G, super combined, slalom, giant slalom Roman Rabl para-alpine skiing male sitting downhill, super combined, slalom, giant slalom Markus Salcher para-alpine skiing male downhill, Super-G, super combined, giant slalom Reinhold Schett para- snowboarding male slalom, snowboard cross Simon Wallner para-alpine skiing male sitting downhill, Super-G, super combined, slalom, giant slalom Martin Würz para-alpine skiing male standing super combined, Super-G, slalom, giant slalom Secretary General Petra Huber and Chef de Mission Julia Voglmayr traveled to South Korea for a meeting with the Chef de Missions of 32 other countries in March 2017, a year before the Games were scheduled to start. == Medals and medalists == If someone from Austria wins a medal, they will get a cash reward of between €4000 and €8000. == Para-alpine skiing == === Skiers === Gernot Morgenfurts decided he wanted to start skiing after his multiple sclerosis became worse. He physically prepared himself before starting the sport in 2015. Later that year, he participated in the Austria Cup. Morgenfurts started competing internationally during the 2016/2017 World Cup season. Because of problems with his sight, he needs a guide skier. For the 2018 Games, that skier is Christoph Gmeiner. They use headsets to talk to each other during races. Pyeongchang 2018 is his first major international skiing competition. Morgenfurts was diagnosed with multiple sclerosis 30 years before the start of the 2018 Games. As the disease has progressed, his vision has become worse. Thomas Grochar is a standing skier. Grochar won silver at the end of 2016/2017 World Cup season. === Before the Games === Thomas Grochar went to Slovenia in January 2018. He competed in the World Cup in Kranjska Gora. === Schedule and training === Skiers had training runs for the downhill race on 7 March. Their practice runs in the downhill on 8 and 9 March were cancelled. The first event on the para-alpine program was the downhill. It started on 10 March, running from 9:30 AM to 1:30 PM. Claudia Lösch, Markus Salcher, Nico Pajantschitsch, Roman Rabl and Simon Wallner were registered to start. The second event on the program was Super-G. All skiers raced between 9:30 AM and 1:00 PM on 11 March. Claudia Lösch, Markus Salcher, Thomas Grochar, Martin Würz, Nico Pajantschitsch, Roman Rabl, Simon Wallner, Gernot Morgenfurt and guide Christoph Gmeiner were scheduled to start in this event. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. Claudia Lösch, Markus Salcher, Thomas Grochar, Martin Würz, Nico Pajantschitsch, Roman Rabl, Simon Wallner, Gernot Morgenfurt and guide Christoph Gmeiner are scheduled to start. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go. Claudia Lösch, Heike Eder, Thomas Grochar, Martin Würz, Nico Pajantschitsch, Roman Rabl, Markus Gfatterhofer, Simon Wallner, Gernot Morgenfurt and guide Christoph Gmeiner are registered to start in the slalom. The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. Claudia Lösch, Heike Eder, Markus Salcher, Thomas Grochar, Martin Würz, Nico Pajantschitsch, Roman Rabl, Markus Gfatterhofer, Simon Wallner, Gernot Morgenfurt and his guide Christoph Gmeiner should all start in this event. === Results === Theo Gmur won a gold medal in the men's downhill standing race. Arthur Bauchet of France won silver. Markus Salcher of Austria won bronze. In the women's Super-G sitting race, Anna Schaffelhuber of Germany won gold, Claudia Loesch of Austria won silver, and Momoka Muraoka of Japan won bronze. In the men's Super-G standing race, Theo Gmur of Switzerland won gold, Arthur Bauchet of France won silver, and Markus Salcher of Austria won bronze. == Para-Nordic skiing == === Skiers === Carina is blind. Her brother, Julian, is her guide skier. She first competed for Austria in 2016. At the 2017 World Championships in Finsterau, Germany, Carina won 2 gold medals and 1 bronze medal. Carina was awarded the Golden Lion as \"Rookie of the Year\" at the Leonidas Sports Gala 2017. === Schedule and results === On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Carina Edlinger and guide Julian Edlinger are scheduled to start. The pair are then scheduled to start in the sprint classic qualification. It takes place on 14 March from 10:00 AM – 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. Carina Edlinger and guide Julian Edlinger are scheduled to participate in the 7.5 km race. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. == Para- snowboarding == === Schedule and results === Patrick Mayrhofer and Reinhold Schett are scheduled to start in the snowboard cross event. The program has the race starting on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM – 4:55 PM for men and women in all classes. Patrick Mayrhofer and Reinhold Schett are both scheduled to start. == Social space == Austria, Switzerland and Germany are co-hosting \"Alpenhaus\" in Pyeongchang. It is a place where people can celebrate winning Paralympic medals. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in Austria",
 "title": "Austria at the 2018 Winter Paralympics"
}