{
 "id": "620667",
 "text": "Slovakia sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. Slovakia is sending up to fifteen sportspeople to the 2018 Games. They are competing in para-alpine skiing and wheelchair curling. The team includes Henrieta Farkasova. Farkasova has the more medals won at the Winter Paralympics than any other person from Slovakia. Before the 2018 Paralympics, she had five gold medals, one silver and one bronze medal. == Team == Slovakia is sending up to fifteen sportspeople to the 2018 Games. They are also sending another 15 people to assist them. The sportspeople are competing in para- alpine skiing and wheelchair curling. The table below contains the list of members of people (called \"Team Slovakia\") that will be participating in the 2018 Games. Team Slovakia Name Sport Gender Classification Events ref Radoslav Ďuriš wheelchair curling male Henrieta Farkasova para-alpine skiing female Martin France para-alpine skiing male Miroslav Haraus para-alpine skiing male Jakub Krako para-alpine skiing male Marek Kubačka para-alpine skiing male Monika Kunkelová wheelchair curling female Imrich Lyócsa wheelchair curling male Peter Zatko wheelchair curling male Dušan Pitoňák wheelchair curling male Petra Smaržová para-alpine skiing female Nataly Subrtova para-alpine skiing female guide skier People going to the Winter Games who are not athletes include Chef-de-Mission Maroš Čambal, sport administrator Tomáš Varga, medical support staff Branislav Delej, Slovenský Paralympijský Výbor representative Samuel Rosko, SZTPŠ representative Martin Čapla, SAASP representative Pavol Valent, alpine skiing representative Martin Makovnik, wheelchair curling representative František Pitoňák, sledge hockey representative Miroslav Dráb and media spokesperson Stanislav Ščepán. == Para- alpine skiing == === Skiers === Henrieta Farkasova went to the Games as the world champion in slalom and giant slalom. She won gold in both races at the 2014 Winter Paralympics. Farkasova has the more medals won at the Winter Paralympics than any other person from Slovakia. Before the 2018 Paralympics, Farkasova had five gold medals, one silver and one bronze medal. Born in 1986, Farkasova is blind. Jakub Krako was second in Slovakia for most medals won at the Winter Paralmpics. Before 2018 Pyeongchang, he won four gold medals and two silver medals. Krako has a physical disability. === Before the Games === Farkasova went to Slovenia in January 2018. She competed in the World Cup in Kranjska Gora. === Schedule and training === Skiers had training runs for the downhill race on 7 March. Their practice runs in the downhill on 8 and 9 March were cancelled. The first event on the para-alpine program was the downhill. It started on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program was Super-G. All skiers raced between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. === Results === Henrieta Farkasova, guided by Nataly Subrtova, won the first gold medal at the Winter Paralympics. Farkasova won gold in women's downhill vision impaired race. Mac Marcoux won gold in the men's visually impaired downhill race. Jakub Krako of Slovakia won silver. Giacomo Bertagnolli of Italy won bronze. In the women's Super-G visually impaired race, Henrieta Farkasova of Slovakia won gold, Millie Knight of Great Britain won silver and Menna Fitzpatrick won bronze. In the men's Super-G visually impaired race, Jakub Krako of Slovakia won gold, Giacomo Bertagnolli of Italy won silver, and Miroslav Haraus of Slovakia won bronze. == Wheelchair curling == They played against Sweden on 12 March. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in Slovakia",
 "title": "Slovakia at the 2018 Winter Paralympics"
}