{
 "id": "620648",
 "text": "Germany sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. There were 19 people from Germany competing in South Korea. 10 were women and 9 were men. They competed in para-alpine skiing, para-Nordic skiing and wheelchair curling. Germany tried to go to the Winter Paralympics in sledge hockey. The team needed to win some competitions. Because they lost, they could not go to South Korea. Sports leaders from Germany were not happy Russia was allowed to compete at the Games. Para-Nordic skier Andrea Eskau went to her sixth Paralympic Games in 2018. == Team == There were 19 people from Germany competing in South Korea. They are competing in para-alpine skiing, para-Nordic skiing and wheelchair curling. The team has 10 women and 9 men. There were 9 people going to their first Paralympic Games. The team was named by the German Disabled Sports Association 38 days before the Games started. The Chef-de-Mission was Karl Quade. People thought Germany should win a lot of medals at the 2018 Winter Paralympics. They thought this because Germany sent 13 people to the 2014 Winter Paralympics. These 13 people won 15 total medals. Germany tried to go to the Winter Paralympics in sledge hockey. The team needed to win some competitions. Because they lost them, they could not go to South Korea. The table below contains the list of members of people (called \"Team Germany\") that will be participating in the 2018 Games. Team Germany Name Sport Gender Classification Events ref Andrea Eskau para-Nordic skiing female Martin Fleig para-Nordic skiing male LW11.5 biathlon Clara Klug para-Nordic skiing female Anna Schaffelhuber para-alpine skiing female Anja Wicker para-Nordic skiing female LW10.5 biathlon == Medalists == Multiple medalists Name Sport Total Anna Schaffelhuber Alpine skiing 2 0 0 2 Andrea Rothfuss 0 2 0 2 Medal Name Sport Event Date Anna Schaffelhuber Alpine skiing Women's downhill, sitting 10 March Anna Schaffelhuber Alpine skiing Women's super-G, sitting 11 March Andrea Rothfuss Alpine skiing Women's downhill, standing 10 March Andrea Rothfuss Alpine skiing Women's super-G, standing 11 March Andrea Eskau Cross-country skiing Women's 12 km, sitting 11 March == Doping == Before the 2018 Winter Paralympics, German Disabled Sports Association President Julius Beucher and Chef-de-Mission was Karl Quade were not happy. The International Paralympic Committee said some Russians could go to South Korea to compete. Beucher and Quade did not like this. They questioned if the sportspeople from Russia were \"clean\". They wanted a Winter Paralympics where there was no doping. == Para-alpine skiing == === Skiers === Anna Schaffelhuber is one of the best people for Germany at the Winter Paralympics. She competed at the 2014 Winter Paralympics. She won 5 gold medals in 5 races. She goes to Pyeongchang looking to defend her crown. === Schedule and training === Skiers had training runs for the downhill race on 7 March. Their practice runs in the downhill on 8 and 9 March were cancelled. The first event on the para-alpine program was the downhill. It started on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. === Results === Marie Bochet from France won gold in the women's downhill standing. Andrea Rothfuss from Germany won silver. Mollie Jepsen from Canada won bronze. Anna Schaffelhuber of Germany won gold in the women's downhill sitting race. Momoka Murakoa of Japan won silver. Laurie Stephens of the United States won bronze. In the women's Super-G standing race, Marie Bochet of France won gold, Andrea Rothfuss of Germany won silver, and Alana Ramsay of Canada won bronze. In the women's Super-G sitting race, Anna Schaffelhuber of Germany won gold, Claudia Loesch of Austria won silver, and Momoka Muraoka of Japan won bronze. ; Men Athlete Class Event Run 1 Run 2 Total Time Rank Time Rank Time Rank Georg Kreiter LW10-1 colspan=4 1:28.23 10 colspan=4 DNF Thomas Nolte LW11 colspan=4 1:34.27 20 colspan=4 1:35.40 21 ; Women Athlete Class Event Run 1 Run 2 Total Time Rank Time Rank Time Rank Anna-Lena Forster LW12-1 colspan=4 DNF colspan=4 1:36.26 4 Noemi Ewa Ristau B2 colspan=4 1:33.33 4 colspan=4 1:39.09 7 Andrea Rothfuss LW6/8-2 colspan=4 1:32.53 colspan=4 1:33.10 Anna Schaffelhuber LW10-2 colspan=4 1:33.26 colspan=4 1:34.76 == Para- Nordic skiing == === Skiers === Martin Fleig and Anja Wicker both were members of the Germany team at the 2014 Winter Paralympics in Sochi. Before the start of the 2018 Games, people thought they could win medals. Wicker won 2 medals in biathlon at earlier Paralympic Games. Clara Klug is blind. Her first Paralympic Games were in 2018. Before they left for Pyeongchang, Wicker gave Klug advice about the Paralympics. Before South Korea, Andrea Eskau went to 5 Paralympic Games. These were the 2008 and 2012 Summer Paralympics for cycling, and the 2006, 2010, 2014 Winter Paralympics for para-Nordic skiing. === Schedule and results === On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Thee sprint classic qualification takes place on 14 March from 10:00 AM – 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. ==== Biathlon ==== ; Men Athlete Class Event Final Missed shots Real time Calculated time Rank Alexander Ehler LW4 7.5 km, standing 0+0 19:52.0 19:16.2 5 Martin Fleig LW11.5 7.5 km, sitting 0+1 25:43.0 24:41.3 6 Steffen Lehmker LW8 7.5 km, standing 1+0 21:44.9 20:52.7 10 Nico Messinger B2 7.5 km, visually impaired 1+0 22:58.0 22:44.2 9 ; Women Athlete Class Event Final Missed shots Real time Calculated time Rank Andrea Eskau LW11 6 km, sitting 0+0 24:33.1 23:04.7 6 Vivian Hösch B1 6 km, visually impaired 1+0 24:48.7 21:50.1 7 Clara Klug B1 6 km, visually impaired 0+1 24:32.4 21:35.7 6 Anja Wicker LW10.5 6 km, sitting 0+1 27:37.5 24:51.8 9 ==== Cross country skiing ==== ; Men Athlete Class Event Qualification Semifinal Final Real time Calculated time Rank Real time Calculated time Rank Real time Calculated time Rank Alexander Ehler LW4 20 km, standing Steffen Lehmker LW8 20 km, standing ; Women In cross country skiing's women's 12 km sitting race, Kendall Gretsch of the United States won gold, Andrea Eskau of Germany won silver, and Oksana Masters of the United States won bronze. Athlete Class Event Final Real time Calculated time Rank Andrea Eskau LW11 12 km, sitting 41:16.9 38:48.3 == Wheelchair curling == The team starts playing on 10 March. They play Sweden on 13 March. Team Group stage Tiebreaker Semifinal Final / Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Opposition Score Rank Opposition Score Opposition Score Opposition Score Rank NPA W 9–4 USA W 6–4 CHN SVK KOR SWE NOR GBR SUI CAN FIN == References == Category:Sport in Germany Category:Nations at the 2018 Winter Paralympics",
 "title": "Germany at the 2018 Winter Paralympics"
}