{
 "id": "620676",
 "text": "The Netherlands sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. Four people were going to compete in para- snowboarding. Five people were going to compete in para-alpine skiing. Anna Jochemsen and Jeffrey Stuut are standing skiers. Linda van Impelen, Jeroen Kampschreur and Niels de Langen are all competing in all 5 para-alpine sit-ski events. Lisa Bunschoten, Mentel-Spee and Vos all competed at the 2014 Winter Paralympics in Sochi. Renske van Beek is the only snowboarded on Team Netherlands who did not go to Sochi. == Team == There were four people who could go to the Paralympics in para-snowboarding. There were another five people who could go in para-alpine skiing. The table below contains the list of members of people (called \"Team Netherlands\") that will be participating in the 2018 Games. Team Netherlands Name Sport Gender Classification Events ref Lisa Bunschoten para-snowboarding female Niels de Langen para-alpine skiing male Slalom, Giant Slalom, Super-G, Super Combined and Downhill Anna Jochemsen para-alpine skiing female Jeroen Kampschreur para-alpine skiing male Slalom, Giant Slalom, Super-G, Super Combined and Downhill Bibian Mentel-Spee para-snowboarding Jeffrey Stuut para-alpine skiing male Renske van Beek para-snowboarding female Linda van Impelen para-alpine skiing female Slalom, Giant Slalom, Super-G, Super Combined and Downhill Chris Vos para- snowboarding male SB-LL1 == Para-alpine skiing == === Skiers === Anna Jochemsen and Jeffrey Stuut are standing skiers. Linda van Impelen, Jeroen Kampschreur and Niels de Langen are all competing in all 5 para-alpine sit-ski events. Kampschreur went to his first Winter Paralympics as the world champion in slalom, giant slalom and super-combined. === Schedule and results === The first event on the para-alpine program is the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go. The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. == Para- snowboarding == === Snowboarders === Bibian Mentel-Spee has competed at the Paralympics before, winning several medals. Chris Vos won the World Para Snowboarding Championships four times. Lisa Bunschoten, Mentel-Spee and Vos all competed at the 2014 Winter Paralympics in Sochi. Renske van Beek is the only snowboarded on Team Netherlands who did not go to Sochi. The South Korea Games are her first. Chris Vos celebrated his 20th birthday in February. Despite his young age, people thought he could win a medal at the 2018 Winter Games. During the 2017-2018 snowboarding season, his results were not consistent but his speed was very good. The lack of consistency was why some people thought he might not be able to win gold. === Schedule and results === The program has snowboard cross starting on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM – 4:55 PM for men and women in all classes. == Supporters == Princess Margriet of the Netherlands is going to attend the 2018 Winter Paralympics. She is a a member of the Honourary Board of the International Paralympic Committee. She goes on 8 March 2018 and leaves 13 March 2018. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in the Netherlands",
 "title": "Netherlands at the 2018 Winter Paralympics"
}