{
 "id": "620654",
 "text": "Czech Republic sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. People are competing two sports: para-alpine skiing and sledge hockey. There were 24 sportspeople, 16 support people and 4 administrators. First allocated four sports in para-alpine skiing, the country won two more spots and are sending six skiers. The sledge hockey team goes to South Korea after qualifying at a tournament in Sweden. They had financial difficulties before the Winter Paralympics because of corruption in sports funding. This made it more difficult to train and compete for the 2018 Games. == Team == In June 2017, the Executive Committee of the Czech Paralympic Committee (ČPV) was told by the International Paralympic Committee (IPC) they had been given four spots to send people to the 2018 Winter Paralympics to compete in para-alpine skiing. Three of these spots were for men, and one was for a woman. Patrik Hetmer was the first skier to be nominated for inclusion on the 2018 team going to Pyeongchang. In September 2017, Pavel Bambousek, Miroslav Lidinský and Anna Pešková seemed to be the most likely skiers to be named to the team in para-alpine skiing. The full team was named by the ČPV on 6 February 2018. It included people in two sports: para-alpine skiing and sledge hockey. There were 24 sportspeople, 16 support people and 4 administrators. Anička Pešková was the only woman representing the Czech Republic in Pyeongchang. The team included 6 alpine-skiers and their 2 guides. Tomáš Vaverka, who competed at the 2014 Winter Paralympics in snowboarding, was selected to compete in para-alpine skiing. The group was scheduled to fly to South Korea on 3 March 2018. The table below contains the list of members of people (called \"Team Czech Republic\") that will be participating in the 2018 Games. Team Czech Republic Name Sport Gender Classification Events ref Pavel Bambousek para-alpine skiing male Pavel Doležal sledge hockey male sledge hockey minimum disability open class mixed team Michal Geier sledge hockey male sledge hockey minimum disability open class mixed team Zdeněk Hábl sledge hockey male sledge hockey minimum disability open class mixed team Patrik Hetmer para-alpine skiing male vision impaired Miroslav Hrbek sledge hockey male sledge hockey minimum disability open class mixed team Michaela Hubačová para-alpine skiing male guide skier Zdeněk Klíma sledge hockey male sledge hockey minimum disability open class mixed team Benjamínek Tadeáš Kříž para-alpine skiing male vision impaired Zdeněk Krupička sledge hockey male sledge hockey minimum disability open class mixed team Pavel Kubeš sledge hockey male sledge hockey minimum disability open class mixed team Martin Kudela sledge hockey male sledge hockey minimum disability open class mixed team Miroslav Lidinský para-alpine skiing male Miroslav Máčka para-alpine skiing male guide skier David Motyčka sledge hockey male sledge hockey minimum disability open class mixed team Radim Nevrlý para-alpine skiing male guide skier Martin Novák sledge hockey male sledge hockey minimum disability open class mixed team David Palat sledge hockey male sledge hockey minimum disability open class mixed team Anička Pešková para-alpine skiing female vision impaired Jiří Raul sledge hockey male sledge hockey minimum disability open class mixed team Zdeněk Šafránek sledge hockey male sledge hockey minimum disability open class mixed team Tomáš Vaverka para-alpine skiing male Karel Wagner sledge hockey male sledge hockey minimum disability open class mixed team == Para-alpine skiing == === Qualification === In June 2017, the Executive Committee of the Czech Paralympic Committee (ČPV) was told by the International Paralympic Committee (IPC) they had been given four spots to send people to the 2018 Winter Paralympics to compete in para-alpine skiing. Three of these spots were for men, and one was for a woman. In September 2017, Pavel Bambousek, Miroslav Lidinský and Anna Pešková seemed to be the most likely skiers to be named to the team in para-alpine skiing. The team had a training camp in early autumn 2017 on the glaciers in the Czech Republic. This was to prepare for their first races, which took place in November in Landgraaf, Netherlands. After that, the team went Pitztal to race. ==== Support ==== Health Care in the Hradec Králové supported Czech para-alpine skiers before Winter Games. This program was supervised by Deputy Governor for Health Care Ing. Aleš Cabicar. Shesaid, \"The project of the handicapped skiers center is known, especially their teaching program, which they realize in the Krkonoše Mountains. I am very glad that successful athletes are being prepared in our region to achieve great results. When the representatives of the Center approached me with the request for support and support, I did not hesitate and I am glad that the Hradec Králové Region is one of the partners of the Czech representatives.\" ==== Skiers ==== Patrik Hetmer was the first skier to be nominated for inclusion on the 2018 team going to Pyeongchang. He competed at the 2014 Winter Paralympics. Hetmer has a vision impairment. The blind skier races with guide skier Miroslav Máčka. Anička Pešková was the only woman representing the Czech Republic in Pyeongchang. The blind skier is accompanied by her guide skier, Michaela Hubačová. Pešková won a medal at the 2010 Winter Paralympics. She returned to alpine-skiing in 2017 after taking maternity leave. Benjamínek Tadeáš Kříž is racing in South Korea with guide skier Radim Nevrlý. Tomáš Vaverka, who competed at the 2014 Winter Paralympics in snowboarding, was selected to compete in para-alpine skiing. === Schedule and results === The first event on the para-alpine program is the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. == Sledge hockey == The team had a goal of winning a bronze at the 2018 Winter Paralympics. They thought their biggest competition would be the United States and Canada. It was the third time the Czech Republic had gone to the Winter Paralympics. Their first appearance at the Winter Games was in 2010. They went again in 2014. === Roster === Defensemen Pavel Doležal and Karel Wagner are going to their first games. The other defensemen were all part of the team that went to Sochi. Michal Geier, Zdeněk Hábl, Zdeněk Krupička, Zdeněk Šafránek, David Palat, David Motyčka, Zdeněk Klíma and Martin Novák are the centers and wingers, playing in the attacking positions. The team is coached by Jiří Bříza. He has been leading the team since 2013. Jan Katauer is an assistance coach, and Jakub Novotny is the goaltender coach. Czech Republic roster Name Team Position Role Age Previous Games ref Pavel Doležal defenseman Michal Geier forward Zdeněk Hábl forward Miroslav Hrbek defenseman 2014 Zdeněk Klíma forward Pavel Kubeš defenseman 2014 Martin Kudela goaltender 20 Zdeněk Krupička forward David Motyčka forward Martin Novák forward David Palat forward Jiří Raul defenseman 2014 Zdeněk Šafránek SHK LAPP Zlín forward captain Karel Wagner defenseman === Before the Games === In the two years before the start of the Winter Games, the sledge hockey team dealt with financial difficulties. Corruption in the Czech Republic involving subsidies for sport resulted in the national team getting less money to support their training and ability to compete in tournaments. FAČR Chairman Miroslav Pelta was arrested as part of the corruption issues. About the corruption, team captain Zdeněk Šafránek said, \"The subsidy scandal has radically reduced the amount we receive. For the sake of illustration, the Czech Paralympic Committee has now gotten less money than last year's sledge hockey players, and it has to be divided into a lot of sports.\" The team could not buy time to use ice at skating rinks to train much before their final qualifying competition in Sweden. They also could not buy new equipment like sledges, hockey sticks or hockey gloves. To make sure they were ready to qualify, the captain thought the team needed around 1 million Czech Koruna () to pay for all the costs of training and traveling. Because they could not get funding from the government, players had to ask individuals to support them financially. The team went to Nagano to compete in a tournament in February 2018 to prepare for the Games. === Qualification === Japan, Sweden and the Czech Republic were the last 3 teams that were able to go to the 2018 Games. They could go because of how they finished at the Qualification Tournament in October in Ostersund, Sweden in October 2017. Teams participating in the tournament included Sweden, Germany, Slovakia, Japan and Great Britain. === Schedule and results === The United States, South Korea, the Czech Republic and Japan were in Group B for the sledge hockey competition. They play South Korea on 11 March. They play the United States on 12 March. The Czech Republic plays Japan on 13 March. ; Preliminary round Team Czech Republic Japan South Korea United States == Media coverage == Some of the Paralympics would be broad on television by ČT TV and ČT Sport. Live streaming of the Winter Games was also made available free on ČT Sport's website. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in the Czech Republic",
 "title": "Czech Republic at the 2018 Winter Paralympics"
}