{
 "id": "620658",
 "text": "The United States sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. The team is competing in para-alpine skiing, para-Nordic skiing, para-snowboarding, sledge hockey and wheelchair curling. It has 63 people. The World Para Alpine Skiing World Cup Finals took place in Kimberly, British Columbia in February 2018. The event was the last one used to decide who would represent the United States at the 2018 Games. The team to go was announced on 20 February 2018. In the men's downhill sitting race, Andrew Kurka of the United States won gold. He also won a silver in the men's Super-G sitting race. The last date that countries could nominate people for their para-Nordic skiing teams at the 2018 Games was 23 February 2018. Kendall Gretsch won two gold medals in the first two days of competition. One was in biathlon's women's 6 km race. The other was in cross country skiing's women's 12 km sitting race. Daniel Cnossen won two medals in the first two days of competition. His first was a gold in the men's 7.5 km sitting biathlon race. His second was a silver in cross country skiing's men's 15 km sitting race. The World Para Snowboard World Cup Finals in Big White, British Columbia took place in February 2018. The event was the final one used to decide who would represent the United States at the 2018 Games. On February 20, the names of the U.S. Paralympic Snowboarding Team were made public. The USA finished in the first four at the 2017 Sledge Hockey World Championships. This was why they could compete at the 2018 Winter Paralympics. The United States, South Korea, the Czech Republic and Japan were in Group B for the sledge hockey competition. Before the Games started, American wheelchair curlers had a few important dates in preparation for the Games. These included the U.S. Open in Utica, New York in December 2017, the Kisakallio Cup in Kisakallio, Finland in January 2018, and Sochi Open in January 2018. They started play on 10 March. == Team == The country has the largest team among all nations. It has 63 people. New Zealand, Sweden and the United States were the first countries to name people to their teams. The people won their places by November 2017. The table below contains the list of members of people (called \"Team USA\") that will be participating in the 2018 Games. Team USA Name Sport Gender Classification Events ref Jake Adicoff para-Nordic skiing male Kirk Black wheelchair curling male Tyler Carron sledge hockey male sledge hockey minimum disability open class Steve Cash sledge hockey male sledge hockey minimum disability open class mixed team Dan Cnossen para-Nordic skiing male Ralph Dequebec sledge hockey male sledge hockey minimum disability open class mixed team Travis Dodson sledge hockey male sledge hockey minimum disability open class mixed team Stephen Emt wheelchair curling male wheelchair curling open class mixed team Declan Farmer sledge hockey male sledge hockey minimum disability open class mixed team Penny Greely wheelchair curling female mixed team Kendall Gretsch para-Nordic skiing female Team USA: Swimming Classification Noah Grove sledge hockey male sledge hockey minimum disability open class mixed team Sean Halsted para-Nordic skiing male Billy Hanning sledge hockey male sledge hockey minimum disability open class mixed team Brenna Huckaby para-snowboarding female Sawyer Kesselheim para-Nordic skiing male Andrew Kurka Para-alpine skiing male Nikko Landeros sledge hockey male sledge hockey minimum disability open class mixed team Jen Lee sledge hockey male sledge hockey minimum disability open class mixed team Meghan Lino wheelchair curling male mixed team Justin Marshall wheelchair curling male mixed team Luke McDermott sledge hockey male sledge hockey minimum disability open class mixed team Kevin McKee sledge hockey male sledge hockey minimum disability open class mixed team Oksana Masters para-Nordic skiing female Grace Miller para-Nordic skiing female Josh Misiewicz sledge hockey male sledge hockey minimum disability open class mixed team Adam Page sledge hockey male sledge hockey minimum disability open class mixed team Josh Pauls sledge hockey male sledge hockey minimum disability open class mixed team Aaron Pike para-Nordic skiing male Bryan Price para-Nordic skiing male Amy Purdy para-snowboarding female Ruslan Reiter para-Nordic skiing male Rico Roman sledge hockey male sledge hockey minimum disability open class mixed team Joy Rondeau para-Nordic skiing female Brody Roybal sledge hockey male sledge hockey minimum disability open class mixed team Mike Schultz para-snowboarding male Andy Soule para-Nordic skiing male Evan Strong para-snowboarding male Kristina Trygstad-Saari para-Nordic skiing female Danelle Umstead Para-alpine skiing female Rob Umstead Para-alpine skiing male guide skier Jeremy Wagner para-Nordic skiing male Jack Wallace sledge hockey male sledge hockey minimum disability open class mixed team Thomas Walsh Para-alpine skiing male Mia Zutter para-Nordic skiing female == Medalists == | width=\"78%\" align=\"left\" valign=\"top\" | Medal Name Sport Event Date Andrew Kurka Alpine skiing Men's downhill, sitting Daniel Cnossen Biathlon Men's 7.5 km, sitting Kendall Gretsch Biathlon Women's 6 km, sitting Kendall Gretsch Cross-country skiing Women's 12 km, sitting Oksana Masters Biathlon Women's 6 km, sitting Daniel Cnossen Cross-country skiing Men's 15 km, sitting Laurie Stephens Alpine skiing Women's downhill, sitting Oksana Masters Cross-country skiing Women's 12 km, sitting | width=\"22%\" align=\"left\" valign=\"top\" | Medals by sport Medals by sport Medals by sport Medals by sport Medals by sport Sport Total Biathlon 2 1 0 3 Alpine skiing 1 0 1 2 Total 3 1 1 5 Medals by date Medals by date Medals by date Medals by date Medals by date Medals by date Day Date Total 1 March 10 3 1 1 5 2 March 11 0 0 0 0 Total Total 3 1 1 5 Medals by gender Medals by gender Medals by gender Medals by gender Medals by gender Medals by gender Gender Total Percentage Female 1 1 1 3 60.0% Male 2 0 0 2 40.0% Mixed 0 0 0 0 0.0% Total 3 1 1 5 100% == Para-alpine skiing == === Going to the Games === The World Para Alpine Skiing World Cup Finals took place in Kimberly, British Columbia in February 2018. The event was the last one used to decide who would represent the United States at the 2018 Games. 19 February 2018 was the deadline for American alpine skiers to get 2017-18 season race points in at least one race to be eligible to represent the United States at the Paralympic Games. The team to go was announced on 20 February 2018. === Schedule and training === Skiers had training runs for the downhill race on 7 March. Their practice runs in the downhill on 8 and 9 March were cancelled. The first event on the para-alpine program was the downhill. It started on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. ===Results=== Anna Schaffelhuber of Germany won gold in the women's downhill sitting race. Momoka Muraoka of Japan won silver. Laurie Stephens of the United States won bronze. In the men's downhill sitting race, Andrew Kurka of the United States won gold, Taiki Morri of Japan won silver and Corey Peters of New Zealand won bronze. In the men's Super-G sitting race, Kurt Oatway of Canada won gold, Andrew Kurka of the United States won silver, and Frederic Francois of France won bronze. ; Men Athlete Event Class Run 1 Run 2 Total Time Rank Time Rank Time Rank Andrew Kurka Downhill, sitting LW12-1 1:24.11 Stephen Lawler LW12-1 1:32.82 18 Andrew Haraghey Downhill, standing LW1 1:32.84 18 Mark Bathum Guide: Cade Yamamoto Downhill, visually impaired B3 Kevin Burton Guide: Brandon Powel-Ashby colspan=4 1:31.35 7 Jasmin Bambur Super-G, sitting LW11 Josh Elliot LW12-2 Andrew Kurka LW12-1 1:26.89 Stephen Lawler LW12-1 1:38.33 22 Tyler Walker LW12-1 1:29.10 12 Andrew Haraghey Super-G, standing LW1 1:34.19 24 Jamie Stanton LW4 1:31.31 17 Thomas Walsh LW4 1:30.38 13 Mark Bathum Guide: Cade Yamamoto Super-G, visually impaired B3 1:35.97 11 Kevin Burton Guide: Brandon Powel-Ashby B2 1:32.42 9 ; Women Athlete Event Class Run 1 Run 2 Total Time Rank Time Rank Time Rank Laurie Stephens Downhill, sitting LW12-1 1:35.80 Stephanie Jallen Downhill, standing LW9-1 1:40.64 8 Ally Kunkel LW6/8-2 Melanie Schwartz LW2 1:39.38 7 Danelle Umstead Guide: Rob Umstead Downhill, visually impaired B2 Laurie Stephens Super-G, sitting LW12-1 1:36.98 5 Stephanie Jallen Super-G, standing LW9-1 1:44.30 10 Ally Kunkel LW6/8-2 1:40.74 7 Melanie Schwartz LW2 1:42.77 8 Staci Mannella Guide: Sadie De Baun Super-G, visually impaired B3 1:44.25 10 Danelle Umstead Guide: Rob Umstead B2 1:38.91 6 == Para-Nordic skiing == === Qualification === In December 2017, the World Para Nordic Skiing World Cup took place in Canmore, Alberta. The World Para Nordic Skiing World Cup in Oberried, Germany took place in January 2018. The last date that countries could nominate people for their teams at the 2018 Games was 23 February 2018. === Skiers === Blind skier Danelle Umstead is married to her guide skier, Rob Umstead. The two call themselves \"Vision4Gold\". Umstead is one of the few mothers competing in South Korea. Oksana Masters was born in 1989 in Ukraine, near the Chernobyl site. Her disability was because of the radiation from the accident in 1986. When she was 7-years-old, she was adopted by a woman from the United States who said she should play sports. Masters tried very hard, and later went to the 2012 Summer Paralympics where she competed in adapted rowing. After the 2012 Games, she had pain in her back and changed to para-Nordic skiing. Skiers from the United States Name Age Born in Oksana Masters 28 Ukraine === Schedule === Cross country skiing events take place on 10, 11, 14, 17 and 18 of March. Biathlon events take place on 10, 13 and 16 of March. On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Thee sprint classic qualification takes place on 14 March from 10:00 AM – 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. === Results === ==== Biathlon ==== Dan Cnossen won the first gold medal for the United States in biathlon. He won gold in the men's 7.5 km sitting race. ; Men Athlete Event Class Factor Real time Misses Time Rank Daniel Cnossen 7.5 km, sitting LW12 100 % 23:49.7 1 (0+1) 23:49.7 Aaron Pike LW11.5 96 % 27:20.9 3 (3+0) 26:15.3 12 Bryan Price LW11.5 96 % 30:05.0 1 (1+0) 28:52.8 20 Andrew Soule LW12 100 % 25:08.3 3 (3+0) 25:08.3 8 Jeremy Wagner LW11.5 96 % 29:43.8 1 (1+0) 28:32.4 19 Ruslan Reiter 7.5 km, standing LW8 96 % 23:52.9 4 (2+2) 22:55.6 16 ; Women In the women's 6 km biathlon sitting race, Kendall Gretsch of the United States won gold, Oksana Masters won silver and Lidziya Hrafeyeva of Belarus won bronze. Athlete Event Class Factor Real time Misses Time Rank Kendall Gretsch 6 km, sitting LW11.5 96 % 22:46.7 1 (0+1) 21:52.0 Oksana Masters LW12 100 % 22:14.8 0 (0+0) 22:14.8 Joy Rondeau LW11.5 96 % 28:59.0 0 (0+0) 27:49.4 14 ==== Cross country skiing ==== ; Men In cross country skiing's men's 15 km sitting race, Maksym Yarovyi of Ukraine won gold, Daniel Cnossen of the United States won silver, and Sin Eui Hyun won bronze. Athlete Event Class Factor Real time Calculated time Rank Daniel Cnossen 15 km, sitting LW12 100 % 42:20.7 42:20.7 Sean Halstead LW11.5 96 % 50:39.6 48:38.0 22 Andrew Soule LW12 100% 44:36.9 44:36.9 11 Jake Adicoff Guide: Sawyer Kesselheim 20 km, visually impaired B3 ; Women In cross country skiing's women's 12 km sitting race, Kendall Gretsch of the United States won gold, Andrea Eskau of Germany won silver, and Oksana Masters of the United States won bronze. Athlete Event Class Factor Real time Calculated time Rank Kendall Gretsch 12 km, sitting LW11.5 96 % 39:51.6 38:15.9 Oksana Masters LW12 100 % 39:04.9 39:04.9 Grace Miller 15 km, standing LW8 Mia Zutter Guide: Kristina Trygstad-Saari 15 km, visually impaired B3 == Para-snowboarding == === Going to the Games === The World Para Snowboard World Cup Finals in Big White, British Columbia took place in February 2018. The event was the final one used to decide who would represent the United States at the 2018 Games. To be eligible to represent the United States at the Paralympic Games, American snowboarders had to get season race points in at least one race in the 2017-18 season. The deadline to get the points was 19 February 2018. On February 20, the names of the U.S. Paralympic Snowboarding Team were made public. === Schedule and results === The snowboard cross event starts on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM – 4:55 PM for men and women in all classes. == Sledge hockey == === Qualifying === The USA finished in the first four at the 2017 Sledge Hockey World Championships. This was why they could compete at the 2018 Winter Paralympics. They went to South Korea after winning a gold medal in sledge hockey at the 2014 Winter Paralympics. === Before the Games === The United States went to the 2018 Winter Paralympics looking to win their third consecutive Paralympic gold, having claimed gold at the 2010 and 2014 Winter Paralympics. Canada was thought to be their biggest competitor. They had won three consecutive gold medals at the World Championships, with their most recent gold at the 2017 World Championships A-Pool. The United States national sledge hockey team played in several tournaments and friendly games to get ready for the Winter Paralympics. The team played in the December 2017 World Sled Hockey Challenge in Charlottetown, Prince Edward Island. They played in the Para Ice Hockey International Tournament in Turin, Italy in January 2018. They also played in the 2018 Border Series in Buffalo, New York and Pt. Colborne, Ontario in February 2018. === Roster === 19-year-old Brody Roybal is from Chicago. He was part of the United States national sledge hockey team at the 2014 Winter Paralympics. He won a gold medal at those games. He started playing sledge hockey in 2006. He was born with a congenital, bilateral amputation. Joe Misiewicz will be competing at his first Paralympic Games in Pyeongchang as a 29-year-old. When he was with the 1st Battalion 5th Marines in Afghanistan, he was injured. This happened during a patrol, when his vehicle hit an improvised explosive devise. Because of injury, he is a double above-knee amputee. Chicagoan Kevin McKee also was part of the United States national sledge hockey team at the 2014 Winter Paralympics. Competing with the team, he won a gold medal in Sochi. in 2018, he was ranked third on the national team. This was based on his performance at the World Sled Hockey Challenge in December 2017. McKee has sacral agenesis. He was born with this disorder. === Schedule and results === The United States, South Korea, the Czech Republic and Japan were in Group B for the sledge hockey competition. They played against Japan on 10 March. They play against the Czech Republic on 11 March. They play against South Korea on 12 March. ; Preliminary round Team Czech Republic Japan South Korea United States == Wheelchair curling == The national team first decided who might be part of the national team in September 2017 in Incheon, South Korea. The second time when the national team said some people may not be able to go was at an event in Green Bay, Wisconsin in October 2017. The final choice of who would be on Team USA for the 2018 Games was made at USA National Team event in Wausau, Wisconsin in early November 2017. Before the Games started, American wheelchair curlers had a few important dates in preparation for the Games. These included the U.S. Open in Utica, New York in December 2017, the Kisakallio Cup in Kisakallio, Finland in January 2018, and Sochi Open in January 2018. They started playing on 10 March. They played against Sweden on 11 March. == References == Category:Sports in the United States Category:Nations at the 2018 Winter Paralympics",
 "title": "United States at the 2018 Winter Paralympics"
}