{
 "id": "620632",
 "text": "Australia sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. The team is competing in two sports: para-alpine skiing and para-snowboarding. Team members include co-captains Mitchell Gourley and Joany Badenhorst. Gourley first represented Australia at the Winter Paralympics in 2006, and has gone to every Winter Paralympics since. Badenhorst was the first woman from Australia to compete in para-snowboarding at the Paralympic Games. The 2018 Winter Paralympic Games will are on Seven Network. It is the first time the Paralympic Games will be on a commercial television station in Australia. == Team == Mitchell Gourley and Joany Badenhorst were announced team co-captains in October 2017. Being named captain meant they had the responsibility to work with the Australian Paralympic Committee and Chef de Mission Nick Dean to unify a team that would compete in two sports: para-alpine skiing and para-snowboarding. Sean Pollard was wanting to be the last person named to the team. He went to a snowboarding competition in February 2018 in Canada. The event was the last opportunity for people to qualify for the 2018 Games. On 20 February 2018, the Australian Paralympic Committee shared their updated team list. It included 13 people. Shaun Pianta and sighted guide Jeremy O’Sullivan earned the right to go to the Games. They were waiting for approval from the International Paralympic Committee before the Australian Paralympic Committee officially said they were on Team Australia. The table below contains the list of members of people (called \"Team Australia\") that will be participating in the 2018 Games. Team Australia Name Sport Gender Classification Events ref Joany Badenhorst para- snowboarding female SB-LL2 Lara Falk para-alpine skiing female guide skier for Patrick Jensen Slalom and Giant slalom Christian Geiger para-alpine skiing male guide skier for Melissa Perrine Mitchell Gourley para-alpine skiing male LW6/8-2 Patrick Jensen para-alpine skiing male B2 Slalom and Giant slalom Jonty O'Callaghan para-alpine skiing male LW9-1 Simon Patmore para-snowboarding male SB-UL Victoria Pendergast para-alpine skiing female LW12-1 Melissa Perrine para-alpine skiing female B2 Sean Pollard para- snowboarding male Mark Soyer para-alpine skiing male LW11 Sam Tait para- alpine skiing male LW11 Ben Tudhope para-snowboarding male SB-LL2 In March 2017, Nick Dean was appointed Chef de Mission. He previously was the Chef de Mission at the Lillehammer 1994, Nagano 1998 and Salt Lake City 2002 Games and was Deputy Chef de Mission for a further three Winter and two Summer Paralympic Games between 1992 and 2012. == Preparation == It is expected that the final Australian team will be between 10 and 12 athletes across two sports – para-alpine skiing and para-snowboard. There is the aim to finish in the top 15 nations on the medal table. This target was set by the Australian Sports Commission’s Australia’s Winning Edge policy. The team will be missing its previous Winter Paralympic Games medalists. The missing skiers Cameron Rahles- Rahbula, Toby Kane and Jessica Gallagher. The Australian Paralympic Committee thought Mitchell Gourley, Melissa Perrine, Joany Badenhorst and Ben Tudhope could be medal contenders in South Korea. == Para-alpine skiing == === Skiers === Mitchell Gourley first represented Australia at the Winter Paralympics in 2006, and has gone to every Winter Paralympics since. Gourley was born not having a lower left arm. Lara Falk is Patrick Jensen's guide skier. She was 21 years old when she was selected for the team. She skis in front of Jensen. While going down a mountain, she tells him about pitch, rhythm and snow conditions. Her goal is to help Jensen ski the best that he can. The two started skiing together in 2016. === Schedule and results === The first event on the para-alpine program is the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. ; Women Athlete Event Final Date Run 1 Run 2 Total Time Rank Melissa Perrine / Andy Bor (guide) B2 Downhill B & VI Super G B & VI Super combined B & VI Slalom B & VI Giant slalom B & VI Victoria Pendergast LW12-1 Slalom sit-ski Giant slalom sit-ski ; Men Athlete Event Final Date Run 1 Run 2 Total Time Rank Mitchell Gourley LW6/8-2 Downhill Standing Slalom Standing Giant slalom standing Super G standing Super combined standing Jonty O'Callaghan LW9-1 Downhill Standing Slalom Standing Giant slalom standing Super G standing Mark Soyer LW11 Downhill Sitting Slalom Sitting Giant slalom Sitting Super G Sitting Super combined Sitting Sam Tait LW11 Slalom Sitting Giant slalom Sitting Super G Sitting Patrick Jensen B2 Lara Falk (guide) Downhill Standing Slalom Standing Giant slalom standing Super G standing Super combined standing == Para- snowboarding == === Snowboarders === Joany Badenhorst won a gold medal at a World Cup event a month before the start of the 2018 Games. She won two bronze medals at World Cup events in 2017. Badenhorst was the first woman from Australia to compete in para-snowboarding at the Paralympic Games. She started the sport after being observed by a snowboard coach when she was working out. The coach called her and asked if she wanted to try the sport. Badenhorst said, \"why not?\" and has been snowboarding ever since. Because the Australian Paralympic Committee wanted to send snowboarders to the sports debut at the 2014 Games, her training was sped up to try to make sure she could compete at the Sochi Paralympics. While practicing in Sochi minutes before the start of competition at the 2014 Winter Paralympics, she crashed and broke her patella. She also collapsed her hip and dislocated her knee. Badenhorst wanted to compete in para-athletics. She almost went to the 2012 Summer Paralympics in the sport, but problems with her amputation forced her to stop competing. When she was a 10-year-old living in South Africa, she was involved in an accident with a tractor. Because of the accident, her leg was amputated. Sean Pollard was attacked by a shark. This resulted in him having a disability. === Schedule and results === The snowboard cross event starts on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM - 4:55 PM for men and women in all classes. ; Women Athlete Event Race 1 Race 2 Race 3 Total Time Rank Time Rank Time Rank Time Rank Joany Badenhorst SB-LL2 Women's snowboard cross Women's snowboard banked ; Men Athlete Event Race 1 Race 2 Race 3 Total Time Rank Time Rank Time Rank Time Rank Simon Patmore SB-UL Men's snowboard cross Men's snowboard banked Sean Pollard SB-UL Men's snowboard cross Men's snowboard banked Ben Tudhope SB-LL2 Men's snowboard cross Men's snowboard banked == History == Australia first competed at the Winter Paralympics in 1980 in Geilo. They have competed at every Winter Paralympics since. Michael Milton is the Australian with the most Winter Paralympic medals. The standing para-alpine skier won eleven medals during his participation at the Winter Games. Six of his medals were gold. Australia had a sad games at the 2014 Winter Paralympics. They only won two medals at those Games. One medal was a bronze, won by Toby Kane in the men's standing super combined. Jessica Gallagher and her guide skier Christian Geiger won Australia's other medal in 2014. It was a bronze in the women's vision impaired giant slalom. == Media == The 2018 Winter Paralympic Games will are on Seven Network. It is the first time the Paralympic Games will be on a commercial television station in Australia. Seven will show highlight shows in the morning and the evening on each day of the Winter Games. == References == Category:Australia at multi-sport events Category:Nations at the 2018 Winter Paralympics",
 "title": "Australia at the 2018 Winter Paralympics"
}