{
 "id": "620651",
 "text": "Finland sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. They competed in para-alpine skiing, para-Nordic skiing, para- snowboarding and wheelchair curling. == Team == The table below contains the list of members of people (called \"Team Finland\") that will be participating in the 2018 Games. Team Finland Name Sport Gender Classification Place of Birth Residence Events ref Juha Härkönen para-Nordic skiing male LW4 Raahe Inkki Inola para-Nordic skiing male B3 Laukaa Yrjö Jääskeläinen wheelchair curling male wheelchair curling open class Jaakko Kallunki para-Nordic skiing male guide skier Markku Karjalainen wheelchair curling male wheelchair curling open class Rovaniemi Sari Karjalainen wheelchair curling female wheelchair curling open class Rovaniemi Rudolf Klemetti para-Nordic skiing male B3 Rukatunturi Santeri Kiiveri para-alpine skiing male LW6/8 Lappeenranta / Ruka Slalom, Giant Slalom, Super-G, Super Combined and Downhill Vesa Leppänen wheelchair curling male wheelchair curling open class Rovaniemi Sini Pyy para-Nordic skiing female LW11 Rovaniemi Matti Sairanen para- snowboarding male SB-UL Rovaniemi / Espoo Riitta Särösalo wheelchair curling female wheelchair curling open class Nokia Vili Sormunen para-Nordic skiing male guide skier Matti Suur-Hamari para-snowboarding male SB-LL2 Imatra / Ruka Ilkka Tuomisto para-Nordic skiing male LW8 Ylöjärvi == Para-alpine skiing == === Skiers === Santeri Kiiveri finished sixth at the 2017 IPC Alpine Skiing World Championships in the super combined. ===Schedule and results=== The first event on the para-alpine program is the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. == Para-Nordic skiing == === Skiers === Sini Pyy went to the 2014 Winter Paralympics. Ilkka Tuomisto competed at the 2006, 2010 and 2014 Winter Paralympics. He won a silver medal at the 2017 World Championships in the 20 kilometer race. Inkki Inola is competing in his first Paralympic Games in South Korea. He is blind. His guide skier is Vili Sormunen. Rudolf Klemetti is a blind skier. He competed at the 2002, 2010 and 2014 Winter Paralympics. His guide skier is Jaakko Kallunki. Juha Härkönen went to the 2014 Winter Paralympics. The 2018 Winter Paralympics are his second Games. === Schedule and results === On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Thee sprint classic qualification takes place on 14 March from 10:00 AM – 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. == Para-snowboarding == === Snowboarders === Matti Suur-Hamari competed at the 2014 Winter Paralympics. He won two gold medals at the 2017 World Para Snowboarding Championships in the men’s cross and banked slalom SB-LL2. Earlier this year, Suur-Hamari also won the men’s cross and banked slalom SB-LL2 events at World Cups in Landgraaf and Pyha. Before the Games, the people who will make it hard for Suur-Hamari to medal in South Korea were thought to be Americans Evan Strong and Mike Shea, and Gurimu Narita of Japan. Matti Sairanen is competing at his first Paralympic Games in South Korea. === Schedule and results === The snowboard cross event starts on 12 March, running from 10:30 AM to 5:00 PM for all classes for both men and women. The slalom race is scheduled to take place on 16 March, going from 10:30 AM – 4:55 PM for men and women in all classes. == Wheelchair curling == === Before the Games === In November 2017, Finland played in a tournament in Estonia. They finished third. Estonia was first, and Latvia was second. Neither Estonia nor Latvia are going to the 2018 Winter Paralympics. === Roster === Sari Karjalainen competed at the 2014 Winter Paralympics. Vesa Leppänen is going to his first Games in South Korea. Markku Karjalainen went to the 2014 Winter Paralympics. He also competed in the 1992 Summer Paralympics. Riitta Särösalo is competing in her first Games in 2018. Yrjö Jääskeläinen is also competing at this first Paralympics in South Korea. Skip Sari Karjalainen is married to fourth player Markku Karjalainen. Wheelchair curling roster Name Position ref Yrjö Jääskeläinen Markku Karjalainen Sari Karjalainen Vesa Leppänen Riitta Särösalo === Schedule and results === Wheelchair curling competition starts on 10 March. On 14 March, Finland plays against Sweden. == References == Category:Sport in Finland Category:Nations at the 2018 Winter Paralympics",
 "title": "Finland at the 2018 Winter Paralympics"
}