{
 "id": "620895",
 "text": "Prince Henrik of Denmark (; born Henri Marie Jean André de Laborde de Monpezat (11 June 1934 – 13 February 2018), was the husband and consort of Queen Margrethe II of Denmark from 1972 until his death in 2018. ==Early life== Henrik was born in Talence, Gironde, France. Henrik served as an infantry conscript in the French Army in the Algerian War between 1959 and 1962. ==Monarchy== Henrik married Margrethe at the Church of Holmen on 10 June 1967 and became her consort when she succeeded her father, King Frederick IX, as monarch of Denmark on 14 January 1972. He had two sons, Crown Prince Frederik (born 1968) and Prince Joachim (born 1969). He had eight grandchildren. Throughout his time as Prince consort, Henrik voiced his opposition with fact that he never received the title of Majesty or King. He has also published many works of poetry. He was the first male Consort to a Danish monarch. Henrik retired from his royal duties on 1 January 2016, at the age of 81. In August 2017, Henrik announced that he would not like to be buried alongside his wife Margrethe in the royal tomb. ==Death== On 6 September 2017, it was announced that Prince Henrik was suffering from dementia. On 28 January 2018, Prince Henrik was hospitalized at Rigshospitalet, following a visit to Egypt. It was later revealed that he had a benign tumor in the left lung and his condition worsened in February. He died a few weeks later on 13 February 2018 in Fredensborg Slot of pneumonia at the age of 83.Hans Kongelige Højhed Prins Henrik afgået ved døden == Titles and styles == * 11 June 1934-30 April 2008: Count Henri of Monpezat * 10 June 1967-2005: His Royal Highness Prince Henrik of Denmark * 2005-14 April 2016-13 February 2018: His Royal Highness The Prince Consort of Denmark * 14 April 2016-13 February 2018: His Royal Highness Prince Henrik of Denmark ==References== ==Other websites== * Official website * The Ancestry of Henri de Laborde de Monpezat Category:1934 births Category:2018 deaths Category:Deaths from pneumonia Category:Deaths from lung cancer Category:Deaths from dementia Category:Danish royalty Category:Danish poets Category:French poets Category:French military people",
 "title": "Henrik, Prince Consort of Denmark"
}