{
 "id": "621046",
 "text": "On February 14, 2018, at 2:21 PM EST, a mass shooting occurred at Marjory Stoneman Douglas High School in Parkland, Florida. It was near dismissal time when staff and students heard gunfire and enacted a \"code red\" lock down. At least 17 people were killed and many others injured. Originally, 20 people were reportedly injured, and the shooter was in custody with the Broward County Sheriff's Office. The suspect was transported to a local hospital for trouble breathing. He was transported from that hospital by the Sheriff's Office shortly thereafter. The shooter was later identified by police as 19-year-old Nikolas Cruz, who was previously expelled from the school. The weapon used was a Smith & Wesson M&P; 15 Sport II. President Donald Trump tweeted \"Prayers and condolences. No child, teacher or anyone else should ever feel unsafe in an American school\". Demonstrations and petitions toward gun control were in effect, following the shooting. On October 20, 2021, Cruz pleaded guilty to all charges and apologized for his actions. Sentencing was expected in January 2022, but it was delayed many times partly due to the COVID-19 pandemic. The trial started on July 18, 2022. On November 2, 2022, Cruz was sentenced to life imprisonment without the possibility of parole. == Victims == * Alyssa Alhadeff, 14 * Scott Beigel, 35 * Martin Duque, 14 * Nicholas Dworet, 17 * Aaron Feis, 37 * Jaime Guttenberg, 14 * Chris Hixon, 49 * Luke Hoyer, 15 * Cara Loughran, 14 * Gina Montalto, 14 * Joaquin Oliver, 17 * Alaina Petty, 14 * Meadow Pollack, 18 * Helena Ramsay, 17 * Alex Schachter, 14 * Carmen Schentrup, 16 * Peter Wang, 15 ==References== Category:2018 in Florida Category:2018 murders in the United States Category:Attacks on buildings and structures in 2018 Category:Deaths by firearm in Florida Category:February 2018 events Category:High school shootings in the United States Category:Mass murder in Florida Category:Massacres in the United States Category:2010s murders in the United States",
 "title": "Parkland high school shooting"
}