{
 "id": "621205",
 "text": "Ernest Powertools Worrell commonly known as Ernest P. Worrell is a fictional character portrayed by the late Jim Varney. Ernest was created by the Nashville advertising agency Carden & Cherry and was used in various local television ad campaigns. Ernest, almost always dressed in a denim vest and baseball cap, appeared at the door of an unseen and unheard, but seemingly unwilling, next door neighbor named Vern. The spots were structured in a way to allow the viewer to be \"Vern\" as Varney looked directly at the camera whenever Vern was addressed. Ernest's seemingly pointless conversations with Vern – which were actually a monologue due to Vern never responding – inevitably rambled around to a favorable description of the sponsor's product, followed by his signature close, \"KnowhutImean?\" While Vern is never shown to ever say anything, it is implied that he finds Ernest to be an unwelcome pest due to him trying to slam his door in Ernest's face on a few occasions. Vern also shakes his head no whenever Ernest invites him to do something. Despite having good intentions, Ernest is utterly oblivious to Vern's apparent distress regarding him and always regards Vern as his closest friend and confidant. ==Films and television == === Films === * Dr. Otto and the Riddle of the Gloom Beam (1985) Unnamed Cameo Role, As Dr. Otto's disguise * Ernest Goes to Camp (1987) * Ernest Saves Christmas (1988) * Ernest Goes to Jail (1990) * Ernest Scared Stupid (1991) * Ernest Rides Again (1993) * Ernest Goes to School (1994) * Slam Dunk Ernest (1995) * Ernest Goes to Africa (1997) * Ernest in the Army (1998) === Television series === * Hey Vern, It's Ernest! (1988) == Specials == * Hey Vern, It's My Family Album (1983) * The Ernest Film Festival (1986) * Hey Vern, Win $10,000...Or Just Count On Having Fun! (1987) * Ernest Goes to Splash Mountain (1989) * Ernest Greatest Hits (1992) * Your World As I See It (1994) ==References== Category:Fictional American people Category:Animated characters",
 "title": "Ernest P. Worrell"
}