{
 "id": "621424",
 "text": "The Eastern Front during World War II or the Great Patriotic War was where the Axis countries and the Soviet Union fought. It began in 1941 with Operation Barbarossa and ended in 1945 by the Soviet soldiers capturing Berlin. Both the Axis countries and the Soviet Union had many millions of soldiers, and both sides lost millions. Romania, Italy and other Axis members joined the war, and Finland fought the Continuation War against the Soviet Union in cooperation with the bigger Axis war. The Eastern Front is called the \"Great Patriotic War\" in Russia, and it is sometimes called the \"Soviet-German War\" in the West. About four fifths of the Axis soldiers killed in World War II died on the Eastern Front. Even more millions of Soviet soldiers died. Many war crimes were committed by German troops. The Eastern Front was the most important conflict in Europe during World War II. The winter of 1941-1942 began unusually early. It was not noted as being particularly bad by the Soviets, but the Germans were accustomed to warmer temperatures and so were ill- prepared. The Germans' equipment broke down in the cold, and some men were still wearing summer uniforms, which they stuffed with newspapers in an attempt to stay warm. Many German soldiers froze to death in the extreme cold. The partly successful Operation Barbarossa was followed in 1942 by the failed \"Fall Blau\" (Case Blue), which was intended to take the Caucasus region and its oilfields. It ended with Soviet victory in the Battle of Stalingrad. In 1943 the Soviet Army won Battle of Kursk, the biggest battle among tanks in history. A few years later, the Soviets pushed the German soldiers and invaded the German-occupied territories in Eastern Europe. The Soviets then invaded Germany itself and fought the Battle of Berlin, the final battle before Germany's surrender. And the soviets linked up with the western allies and the western front, Although the Soviets eventually repelled the Germans, the tremendous cost was five times as many Soviet deaths as Germans. == Main events == *22 June 1941 - German invasion. *22-29 June 1941 - Defense of Brest Fortress. *2 October 1941 - 7 January 1942 - Battle of Moscow; **5 December 1941 - counterattack starting. *23 August 1942 – 2 February 1943 - Battle of Stalingrad. *5 July - 23 August 1943 - Battle of Kursk. *22 June - 18 August 1944 - Operation Bagration. *12 January - 2 February 1945 - Vistula—Oder offensive. *16 April - 2 May 1945 - Battle of Berlin. *6 May - 11 May 1945 - Prague offensive. == References == Category:World War II",
 "title": "Eastern Front (World War II)"
}