{
 "id": "62141",
 "text": "Michelle LaVaughn Robinson Obama (born January 17, 1964) is an American lawyer and author who served as the first lady of the United States from 2009 to 2017 as the wife of Barack Obama, the 44th U.S. president. She is the first African-American first lady in U.S. history. As first lady, she was seen as a role model for women as she worked as an advocate for poverty awareness, education, nutrition, physical activity, and healthy eating. She supported American designers and was considered a fashion icon. == Biography == === Early life and education === Michelle LaVaughn Robinson was born on January 17, 1964, at Provident Hospital of Cook County in Chicago, Illinois, to Fraser Robinson III, a city water plant employee and Marian Shields Robinson. Her mother was a full-time homemaker until Robinson entered high school. By sixth grade, Robinson attended Mawr Elementary School. She attended Whitney Young High School, where she was on the honor roll for four years, took advanced placement classes, was a member of the National Honor Society and served as student council treasurer. She graduated in 1981. === Career === Robinson enrolled into Princeton University in 1981. She majored in sociology and minored in African-American studies and graduated with a Bachelor of Arts in 1985. While at Princeton, Robinson became involved with the Third World Center, an academic and cultural group who supported minority students. She ran their daycare center, which also offered after school tutoring for older children. As part of her requirements for graduation, she wrote a sociology thesis, titled Princeton-Educated Blacks and the Black Community.Robinson, Michelle LaVaughn (1985), Sociology Department. \"Princeton-Educated Blacks and the Black Community (96 pages). \" Seeley G. Mudd Manuscript Library, Princeton University. (Thesis currently unavailable from this library; see next footnote for links to text.) Robinson pursued professional study, earning her Juris Doctor degree from Harvard Law School in 1988. At Harvard, Robinson participated in demonstrations advocating the hiring of professors who were members of minority groups. She worked for the Harvard Legal Aid Bureau, assisting low-income tenants with housing cases.\"Biography Today\", p. 117 === Post-law school career === Following law school, Obama became an associate at the Chicago office of the law firm Sidley & Austin, where she worked on marketing and property law. In 1993, she became executive director for the Chicago office of Public Allies, a non-profit organization encouraging young people to work on social issues in nonprofit groups and government agencies. In 1996, Obama served as the Associate Dean of Student Services at the University of Chicago. In 2002, she began working for the University of Chicago Hospitals, first as executive director for community affairs and, beginning May 2005, as vice president for Community and External Affairs. === Marriage and family === Robinson met Barack Obama when they were among the few African Americans at their law firm, Sidley Austin LLP. Their relationship started with a business lunch and then a community organization meeting. They got married on October 3, 1992. Their first daughter, Malia Ann was born in July 1998 and their second daughter, Sasha was born June 2001. == First lady of the United States (2009–2017) == Obama became the first lady of the United States when her husband was sworn-in as the 44th U.S. president on January 20, 2009, and became the first African-American first lady in American history. As first lady, Obama visited homeless shelters and soup kitchens. She also sent representatives to schools and advocated public service. Obama's initiatives as first lady were: Let's Move!, Reach Higher, Let Girls Learn, and Joining Forces. Some initiatives included advocating for military families. She made supporting military families and spouses a personal mission and increasingly bonded with military families. In January 2010, Obama started an initiative, which she named \"Let's Move!\", to make progress in reversing the 21st-century trend of childhood obesity. On February 9, 2010, President Obama created the Task Force on Childhood Obesity to review all current programs and create a national plan for change. === Fashion influence === In 2010, she wore clothes, many high end, from more than fifty designer companies. She wore sleeveless dresses by Michael Kors, and her ball gowns designed by Jason Wu for both inaugurals. and She has also been known for wearing clothes by African designers such as Mimi Plange, Duro Olowu, Maki Oh, and Osei Duro. Obama appeared on the cover in the March 2009 issue of Vogue. She later appeared two more times on the cover of Vogue, while first lady, the last time in December 2016, with photographs by Annie Leibovitz. In August 2011, she became the first woman ever to appear on the cover of Better Homes and Gardens magazine. == Post-White House activities (2017–present) == In 2021, she was inducted into the National Women's Hall of Fame. === Becoming === Obama's memoir, Becoming, was released in November 2018. By November 2019, it had sold 11.5 million copies. A documentary titled Becoming, which chronicles Obama's book tour promoting the memoir, was released on Netflix on May 6, 2020. She received Grammy Award for Best Audio Book, Narration & Storytelling Recording in 2020 for audio book. === Podcast === In July 2020, she premiered a podcast titled The Michelle Obama Podcast. In February 2021, Obama was announced as an executive producer and presenter on a children's cooking show, Waffles + Mochi. It was released by Netflix on March 16, 2021. === The Light We Carry === On July 21, 2022, it was announced that Obama's next book, The Light We Carry: Overcoming in Uncertain Times, would be published in November 2022. The book was published by Penguin Random House. In 2023, Obama received a Emmy Award for the Netflix documentary film The Light We Carry: Michelle Obama and Oprah Winfrey. == Awards and honors == In November 2023, Obama was named to the BBC's 100 Women list. == Writings == * * * Reviews: Time magazine features an annual \"Person of the Year\" cover story in which Time recognizes the individual or group of individuals who have had the biggest impact on news headlines over the previous twelve months. In 2020, the magazine decided to retroactively choose a historically deserving woman for each year in which a man had been named Person of the Year, reflecting the fact that a woman or women had been named Person of the Year only eleven times in the preceding hundred. As part of this review, Michelle Obama was named the Woman of the Year for 2008. == References == Category:African-American people Category:African-American lawyers Category:First Ladies of the United States Category:Barack Obama Category:American autobiographers Category:Writers from Chicago Category:Obama family Category:1964 births Category:Living people Category:Lawyers from Chicago",
 "title": "Michelle Obama"
}