{
 "id": "621416",
 "text": "The 2018 Winter Paralympics were held between 9 and 18 March 2018 in Pyeongchang, South Korea. They are the 12th edition of the Games. The IOC chose South Korea as the host nation at the IOC Congress in Durban on 6 July 2011. == Participants == Around 550 people from 42 countries are expected to participate in the 2018 Games. Four countries gone to their first Winter Paralympics. They are Pakistan, Georgia, North Korea and Tajikstan. Just like at the Olympics which happened the month before, there are no athletes from Russia taking part in the Paralympics under their country's name because the IOC found out many of them had been doping. Those who were not caught could compete as an \"Olympic Athlete from Russia\". == Sports == Six sports were at the 2018 Winter Paralympics. Between them, they will award 80 medals. Unlike the 2014 Winter Paralympics, para-snowboarding is not included with para-alpine skiing at the 2018 Games. The sport is giving 10 medals in 2018. In 2014, it only gave 2. These medals will be fought for by around 670 people, 24% more than competed at the Sochi Games. * Alpine skiing ( 30 ) ( details ) * Biathlon ( 18 ) ( details ) * Cross country skiing ( 20 ) ( details ) * Sledge hockey ( 1 ) ( details ) * Snowboarding ( 10 ) ( details ) * Wheelchair curling ( 30 ) ( details ) In mid-2015, the International Paralympic Committee made the last list for medal events at the 2018 Winter Paralympics. == Venues == Competition takes place in two main areas. They are the mountain area and the coastal area. Mountain area: * Jeongseon Alpine Center: para-alpine skiing and snowboarding. * Alpensia Biathlon Centre: para-Nordic skiing, biathlon and cross-country skiing. Coastal area: * Gangneung Hockey Centre: sledge hockey. * Gangneung Curling Centre: wheelchair curling. == Calendar == The Calendar of Paralympic Winter Games 2018 is below. Blue boxes show group play and round robin play. Yellow boxes show when there are races where medals are awarded. The number shows the number of medals awarded that day. ● Opening Ceremonies Group Play Finals ● Closing Ceremonies Mas 2018 9 10 11 12 13 14 15 16 17 18 Total medals Opening Ceremony ● Closing ceremonies ● Alpine Skiing | |bgcolor=#ffcc00|6 |bgcolor=#ffcc00|6 | |bgcolor=#ffcc00|6 |bgcolor=#ffcc00|3 |bgcolor=#ffcc00|3 | |bgcolor=#ffcc00|3 |bgcolor=#ffcc00|3 | 30 Biathlon | |bgcolor=#ffcc00|6 | | |bgcolor=#ffcc00|6 | | |bgcolor=#ffcc00|6 | | | 18 Cross Country Skiing | | |bgcolor=#ffcc00|2 |bgcolor=#ffcc00|4 | |bgcolor=#ffcc00|6 | | |bgcolor=#ffcc00|6 |bgcolor=#ffcc00|2 | 20 Sledge Hockey | |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#ffcc00| |bgcolor=#ffcc00|1 | 1 Snowboarding | | | |bgcolor=#ffcc00|5 | | | |bgcolor=#ffcc00|5 | | | 10 Wheelchair Curling | |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#3399ff| |bgcolor=#ffcc00|1 | | 1 Totalt 12 8 9 12 9 3 11 10 6 80 == Ticket sales == There was little interest in the Paralympics in South Korea. Two weeks before the Games started, less than 10% of the available tickets were sold. A sledge hockey game was held to get people interested the Games. Almost no one attended. == References ==",
 "title": "2018 Winter Paralympics"
}