{
 "id": "621579",
 "text": "The Wheelchair Curling event at the 2018 Paralympic Winter Games will be held at the Gangneung Curling Centre. == Rules == Each team needs to have one or more women. ==Medal summary== ===Medal table=== ===Medalists=== Mixed Wang Haitao Chen Jianxin Liu Wei Wang Meng Zhang Qiang (alternate) Coach: Yue Qingshuang Rune Lorentsen Jostein Stordahl Ole Fredrik Syversen Sissel Løchen Rikke Iversen (alternate) Coach: Peter Dahlman Mark Ideson Ina Forrest Dennis Thiessen Marie Wright James Anseeuw (alternate) Coach: Wayne Kiel == Teams == Team members for all countries are listed in the table below. Skip: Mark Ideson Third: Ina Forrest Second: Dennis Thiessen Lead: Marie Wright Alternate: James Anseeuw Coach: Wayne Kiel Skip: Wang Haitao Third: Chen Jianxin Second: Liu Wei Lead: Wang Meng Alternate: Zhang Qiang Coach: Yue Qingshuang Fourth: Markku Karjalainen Third: Yrjö Jääskeläinen Second: Vesa Leppänen Skip: Sari Karjalainen Alternate: Riitta Särösalo Coach: Vesa Kokko Skip: Christiane Putzich Third: Harry Pavel Second: Martin Schlitt Lead: Heike Melchior Alternate: Wolf Meissner Coach: Katja Schweizer Skip: Aileen Neilson Third: Hugh Nibloe Second: Gregor Ewan Lead: Bob McPherson Alternate: Angie Malone Coach: Sheila Swan, Kenny More Skip: Rune Lorentsen Third: Jostein Stordahl Second: Ole Fredrik Syversen Lead: Sissel Løchen Alternate: Rikke Iversen Coach: Peter Dahlman Skip: Konstantin Kurokhtin Third: Marat Romanov Second: Alexander Shevchenko Lead: Daria Shchukina Alternate: Andrei Meshcheriakov Coach: Anton Batugin Fourth: Dušan Pitoňák Skip: Radoslav Ďuriš Second: Peter Zaťko Lead: Monika Kunkelová Alternate: Imrich Lyócsa Coach: Frantisek Pitonak, Pavol Pitonak Fourth: Cha Jae-goan Third: Jung Seung-won Skip: Seo Soon-seok Lead: Bang Min-ja Alternate: Lee Dong-ha Coach: Beak Jong-chul, Hwang Hyeon-jun Skip: Viljo Petersson Dahl Third: Ronny Persson Second: Mats-Ola Engborg Lead: Kicki Ulander Alternate: Zandra Reppe Coach: Peter Narup, Mia Boman Skip: Felix Wagner Third: Claudia Hüttenmoser Second: Marcel Bodenmann Lead: Beatrix Blauel-Thomann Alternate: Hans Burgener Coach: Stephan Pfister Skip: Kirk Black Third: Steve Emt Second: Justin Marshall Lead: Penny Greely Alternate: Meghan Lino Coach: Rusty Schieber, Tony Colacchio ==Round robin standings== ==Round robin results== All times are local (UTC+9). ===Summary=== ===Draw 1=== Saturday, 10 March, 14:35 ===Draw 2=== Saturday, 10 March, 19:35 ===Draw 3=== Sunday, 11 March, 9:35 ===Draw 4=== Sunday, 11 March, 14:35 ===Draw 5=== Sunday, 11 March, 19:35 ===Draw 6=== Monday, 12 March, 9:35 ===Draw 7=== Monday, 12 March, 14:35 ===Draw 8=== Monday, 12 March, 19:35 ===Draw 9=== Tuesday, 13 March, 9:35 ===Draw 10=== Tuesday, 13 March, 14:35 ===Draw 11=== Tuesday, 13 March, 19:35 ===Draw 12=== Wednesday, 14 March, 9:35 ===Draw 13=== Wednesday, 14 March, 14:35 ===Draw 14=== Wednesday, 14 March, 19:35 ===Draw 15=== Thursday, 15 March, 9:35 ===Draw 16=== Thursday, 15 March, 14:35 ===Draw 17=== Thursday, 15 March, 19:35 ==Playoffs== ===Semifinals=== Friday, 16 March, 15:35 ===Bronze medal game=== Saturday, 17 March, 9:35 ===Gold medal game=== Saturday, 17 March, 14:35 == References == Category:Sports at the 2018 Winter Paralympics Category:Curling",
 "title": "Wheelchair curling at the 2018 Winter Paralympics"
}