{
 "id": "62155",
 "text": "was the 2nd emperor of Japan,Imperial Household Agency (Kunaichō), 綏靖天皇 (2); retrieved 2011-10-19. according to the traditional order of succession.Titsingh, Isaac. (1834). Annales des empereurs du japon, pp. 3-4; Brown, Delmer. (1979). Gukanshō, pp. 250-251; Varley, H. Paul. (1980). Jinnō Shōtōki, pp. 88-89; Nussbaum, Louis-Frédéric et al. (2002). \"Traditional order of Tennō\" in Japan encyclopedia, pp. 962-963. Historians consider Emperor Suizei to be a legendary person,Kelly, Charles F. \"Kofun Culture,\" Japanese Archaeology. April 27, 2009; retrieved 2011-10-19. and the name Suizei-tennō was created for him after his death by later generations. No certain dates can be assigned to this emperor's life or reign.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, p. 29. The conventionally accepted names and sequence of the early emperors were not to be confirmed as \"traditional\" until the reign of Emperor Kammu, who was the 50th monarch of the Yamato dynasty.Aston, William George. (1896). Nihongi, pp. 109. The Gukanshō records that Suizei ruled from the palace of Takaoka-no-miya at Katsuragi in what will come to be known as Yamato province.Brown, p. 250. == Traditional history == Suizei is almost certainly a legend. The Kojiki records only his name and genealogy. The Nihonshoki includes Suizei as the earliest or first of .Aston, pp. 138-141. The Gukanshō records that Suizei was one of the sons of Emperor Jimmu. During reign of Emperor Suizei, the capital of Japan was at Kazuraki, Yamato.Ponsonby-Fane, Richard. (1915). The Imperial Family of Japan, p. 2. == Events of Suizei's life == The Kojiki includes a story about how Suizei attained the throne. His older brother supported Suizei because of his courage.Chamberlain, Basil Hall. (1919). The Kojiki, p. 184. The absence of information about Suizei does not imply that no such person ever existed. Very little information is available for study prior to the reign of the 29th monarch, Emperor Kimmei (509?-571).Titsingh, pp. 34-36; Brown, pp. 261-262; Varley, pp. 123-124. === After his death === This emperor's official name after his death (his posthumous name) was regularized many centuries after the lifetime which was ascribed to Suizei. The actual site of his grave is not known. According to the Imperial Household Agency, this emperor is venerated at a memorial Shinto shrine (misasagi) at Nara. == Family tree == == Related pages == * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree == References == Category:Emperors of Japan",
 "title": "Emperor Suizei"
}