{
 "id": "621580",
 "text": "The Accademia di Belle Arti di Brera (\"academy of fine arts of Brera\"), also known as the Accademia di Brera or Brera Academy, is a state-run art school in Milan, Italy. Its main building is the Palazzo Brera. The Pinacoteca di Brera, Milan's main public museum for art, is also located in the building. The Palazzo Brera was built in 1615 to designs by the Milanese architect Francesco Maria Richini (1584–1658). The academy was founded in 1776 by Maria Theresa of Austria. Other important institutions were also housed in the Palazzo Brera during that time. These included an observatory, botanical gardens, science laboratories, a library, and the Scuole Palatine (schools for philosophy and law). The Pinacoteca di Brera as been located in the building since 1806. In 1891, the first Triennale di belle arti exposition was held at the academy. The exposition took place every three years. Each exhibition had a special theme. The first one was devoted to new trends in the plastic arts. The exhibit included some of the first examples of Italians painting in the pointillist style.Chezzi, Rosella (October 2016). \"Brera 1891 L'Esposizione che rivoluzionò l’arte moderna\". Corriere della Sera. Retrieved 30 July 2018 . ==The academy today== Like other state-run art academies in Italy, the Accademia di Brera falls under the Italian ministry of education and research. It awards first- and second-level degrees, specialised degrees, master's degrees and doctorates. The accademia has three departments: * Visual arts, with courses in painting, sculpture, decorative art, and graphic art * Design and applied art, which has courses in art restoration, design for business, new technologies of art, and stage design * Communication and education, with courses in conservation of cultural heritage, and in art education. The academy has about 3,800 students, including about 1,000 foreign students (mostly postgraduates). ==References== ==Other websites== * Category:Colleges and universities in Italy Category:Art museums in Italy Category:1776 establishments in Europe Category:18th-century establishments in Italy",
 "title": "Brera Academy"
}