{
 "id": "621722",
 "text": "Giovanni Carnovali (29 September 1804 - 5 July 1873) was an Italian painter. He was also known as Piccio, a nickname which means \"little one\". Most of his paintings were portraits but he also painted scenes from the Bible and Greek and Roman mythology.Valsecchi, Marco (1977). \"Carnovali, Giovanni, detto il Piccio\". Dizionario Biografico degli Italiani, Vol. 20. Treccani. Online version retrieved 19 February 2018 . ==Life== Carnovali was born in Montegrino Valtravaglia, a small town near Varese. His father was a bricklayer. Carnovali showed a very early talent in drawing. In 1815, when he was 11 years old, he was admitted to the Carrara Academy in Bergamo. His first major public work was The Education of the Virgin. He painted it in 1826. The painting was ordered by the parish church in Almenno San Bartolomeo, a small town near Bergamo. In 1836 Carnovali settled in Milan. His pupils included Tranquillo Cremona.Lissoni, Elena (2009). \"Giovanni Carnovali\" . Fondazione Cariplo. Retrieved 19 February 2018 . Carnovali was an eccentric person. He spent hours silently looking at landscapes. He took long trips on foot. In 1831 he walked all the way from the north of Italy to Rome and back. He also walked to Paris in 1845. He liked to be alone. He often did not answer when people knocked on the door of his studio. Carnovali died in 1873 while he was swimming in the Po River near Cremona. ==Gallery== Artgate Fondazione Cariplo - Carnovali Giovanni, Ritratto di Pietro Ronzoni.jpg|Portrait of Pietro Ronzoni, oil on panel (1825) Giovanni Carnovali - Ritratto d'uomo in atto di scrivere.jpg|Portrait of a Man Writing, oil on canvas (1843) Giovanni Carnovali - Salmace e Ermafrodito (1856).jpg|Salmacis and Hermaphroditus, oil on canvas (1856) Flora by Giovanni Carnovali from the Museum of the Accademia Carrara.jpg|Flora, oil on canvas (1868) ==Related pages== * List of Italian painters ==References== Category:Italian painters Category:People from Lombardy Category:1804 births Category:1874 deaths",
 "title": "Giovanni Carnovali"
}