{
 "id": "621785",
 "text": "Peter Paul Montgomery Buttigieg (;Buttigieg saying his name born January 19, 1982) is an American politician. He was the 19th United States Secretary of Transportation during the Joe Biden administration from 2021 to 2025. He was the 32nd Mayor of South Bend, Indiana from 2012 through 2020. He is a member of the Democratic Party. In 2017, Buttigieg ran for Chair of the Democratic National Committee in its 2017 chairmanship election, but lost the election. In January 2019, Buttigieg announced his plans to run for President of the United States in the 2020 election. He formally launched his campaign on April 14, 2019. Buttigieg narrowly won the Iowa caucus, despite losing the popular vote to U.S. Senator Bernie Sanders. He soon lost the later primaries in New Hampshire, Nevada and South Carolina. He ended his campaign on March 1, 2020. In December 2020, then President-elect Joe Biden chose him to be United States Secretary of Transportation. He was confirmed by the United States Senate in February 2021. He became the first openly gay individual and the first millennial member of the United States Cabinet. ==2017 DNC Leadership election== In January 5, 2017, Buttigieg announced his candidacy for Chair of the Democratic National Committee in its 2017 chairmanship election.Jonathan Martin, Indiana Mayor Running for D.N.C. Chairman, New York Times(January 5, 2017). He withdrew from the race on the day of the election and lost to Tom Perez.Alex Seitz-Wald, DNC Race: Democrats Elect New Leader Saturday, NBC News (February 25, 2017). ==2020 presidential election== Buttigieg was mentioned as a possible candidate for President of the United States in the 2020 U.S. presidential election since late 2017. If elected, Buttigieg would have been the first openly gay U.S. President. On January 23, 2019, Buttigieg announced his candidacy for President.Pete Buttigieg, Mayor of South Bend Ind., Joins Democratic 2020 Race at The New York Times He made a formal announcement on April 14, 2019. At the Iowa caucuses, Buttigieg narrowly won more pledged delegates than any other candidate. Most news organizations use this number to determine the winner. With this win, he became the first openly gay candidate to earn presidential primary delegates from a major American political party. He ended his campaign almost a month later after losing the South Carolina primary by a large number of votes.Epstein, Reid J. and Gabriel, Trip. \"Pete Buttigieg to Quit Democratic Presidential Race.\" The New York Times, March 1, 2020. Retrieved March 1, 2020. ==After the 2020 campaign== On June 8, 2020 it was announced that the University of Notre Dame had hired Buttigieg as a teacher and researcher for the 2020–21 academic year. ==U.S. Secretary of Transportation== On December 15, 2020, then President-elect Joe Biden announced that he would nominate Buttigieg to be Secretary of Transportation. Buttigieg was confirmed on February 2, 2021, with a vote of 86-13. As Secretary of Transportation, Buttigieg has worked on re-organizing the department's inner policy structure. He created a thorough review process of rules created under the Trump administration. For example, Buttigieg re-added an Obama-era program which allows local hiring for public works projects in May 2021. Trump had removed this program in 2017. In December 2023, the Department of Transportation fined Southwest Airlines $140 million for violations of consumer protection laws in 2022 when the company cancelled flights and left more than 2 million passengers stranded. ==Personal life== On June 16, 2015, Buttigieg announced in an essay that he is gay. He is the first openly gay executive in Indiana. On December 28, 2017, Buttigieg announced his engagement to Chasten Glezman. They were married in June 2018. In August 2021, Buttigieg announced on his personal Twitter account that he and his husband were in the process of adopting children. Buttigieg announced that they had welcomed two newborn fraternal twins (Penelope Rose and Joseph August) on September 4, 2021. ==References== ==Other websites== * South Bend website * Indianapolis Star, \"State roundup, Other key mayoral races\" Category:1982 births Category:Living people Category:2020 United States presidential candidates Category:American mayors Category:Military people from Indiana Category:Gay men Category:American LGBT politicians Category:LGBT people from Indiana Category:People from South Bend, Indiana Category:Politicians from Indiana Category:Democratic Party (United States) politicians Category:United States Secretaries of Transportation Category:Politicians from Michigan",
 "title": "Pete Buttigieg"
}