{
 "id": "621885",
 "text": "Mountain pine beetle (Dendroctonus ponderosae) is a species of insect pest which lives in the forests of western Canada and the United States.Safranyik, L. & Carroll, A. L. (2006) The biology and epidemiology of the mountain pine beetle in lodgepole pine forests. In: The Mountain Pine Beetle: A Synthesis of Biology, Management and Impacts on Lodgepole Pine (eds Safranyik L, Wilson W) 3– 66. Natural Resources Canada, Canadian Forest Service, Paciﬁc Forestry Centre, Victoria, BC. The beetle feeds on the inner bark of pine trees like the lodgepole pine, forming tunnels under the bark to lay their eggs. Normally, the mountain pine beetle prefers to attack sick or old trees because they can't defend themselves easily. However, sometimes the beetles become so numerous that they will group up and start attacking healthy trees in massive outbreaks. This makes the control and monitoring of mountain pine beetle very important for the forest industry in Canada and the U.S., because massive outbreaks of mountain pine beetle can kill entire forests. Recently, a large outbreak of the beetle in British Columbia became a major problem, killing millions of trees across the province.Bentz, B. J., Régnière, J., Fettig, C. J., Hansen, E. M., Hayes, J. L., Hicke, …& Seybold, S. J. (2010) Climate change and bark beetles of the western United States and Canada: direct and indirect effects. BioScience, 60, 602-613. Due to global warming making it easier for the beetle to survive high in the Canadian Rockies, the beetle was able to spread into Alberta, Canada, where the beetle has never been seen before.Janes, J. K., Li, Y., Keeling, C. I., Yuen, M. M., Boone, C. K., Cooke, J., … Sperling, F. A. H. (2014) How the mountain pine beetle (Dendroctonus ponderosae) breached the Canadian Rocky Mountains. Molecular Biology and Evolution 31, 1803-1815 Scientists are worried that there is nothing stopping the mountain pine beetle from spreading across the entire continent now.Safranyik, L., Carroll, A. L., Regniere, J., Langor, D. W., Riel, W. G., Shore, T. L., … & Taylor, S. W. (2010) Potential for range expansion of mountain pine beetle into the boreal forest of North America. Canadian Entomologist, 142, 415-442. == References == Category:Polyphaga Category:Agricultural pests",
 "title": "Mountain pine beetle"
}