{
 "id": "622333",
 "text": "Kasam — Tere Pyaar Ki (English: Swear by your love) is an Indian/Hindi romantic television series. Kratika Sengar and Sharad Malhotra play the roles of Tanu/Tanuja/Kritika and Rishi/Ranbir respectively. ==Synopsis== It is the story of two childhood friends Rishi and Tanushree, who grow up separately but are destined to meet. After 17 years, Rishi marries Tanushree but she is shot to death. She is reincarnated as Tanuja. Both Rishi & Tanuja die in a car accident and are reborn as Ranbir & Kritika to fulfil the promise. ==Plot== The story revolves around Tanushree Khurana, fondly called Tanu Khurana and Rishi Singh Bedi who are childhood friends. One day, Tanu saves Rishi and a sadhu woman (Katyani Bai) prophesies that Tanu and Rishi's kundli match very well, and Tanu will shield Rishi from danger. But Rano, Rishi's mother, dislikes Tanu's family and brainwashes her husband Raaj's mind to move to America. ===After 17 years=== Tanu eagerly waits for Rishi to return. Rishi, who now is a boxer and doesn't believe in love, has forgotten Tanu and also denies going to India, but Raaj threatens Rano to donate all his wealth, and they all are forced to go to India. Rishi and his family reach Patiala, where Tanu resides, and on the same day Tanu's parents are killed in a terrorist attack. Raaj reaches Tanu's home and comes to know that his friend has died. Bani, Tanu's aunt, takes Rishi and family to Mumbai, where Bani's own daughters, Swati and Neha reside. Bani changes her daughter Neha's name to Tanu in front of Rishi's family. Tanu and Ahana also reach Mumbai. On the same night, Rishi and Tanu meet, and Rishi instantly falls for Tanu, without knowing that she is Tanu. Rishi's marriage is fixed with Neha. Bani changes Tanu's name to Tanvi by saying that Raaj doesn't like Tanu and Ahana. Tanu's marriage gets fixed with Pawan, a man from Jalandhar. Rishi and Tanu's marriage is going to take place on the same day. He finds out that Pawan is already married to a girl, Saloni and fails to expose them. On the day of their marriage, Tanu's sister Ahana drugs Tanu and helps Rishi in kidnapping her.they both marry after Tanu reveals that she is the real Tanu but Pawan follows them. Everyone gets to know the truth by Ahana, Katyani Bai and Manpreet that Pawan is married to Saloni and Tanvi is real Tanu. Neha tells Sandy, his boyfriend that Rishi molested her and Sandy decides to kill Rishi. When Rishi and Tanu are about to travel back to home, Sandy shoots Tanu instead of Rishi and she dies. Rishi tries to commit suicide but Tanu's soul comes and stops him. Her soul says that she will come back. ===After 20 years=== Tanu is reborn as Tanuja Vikram Sikand (Sandy's niece). Rishi becomes harsh due to Tanu's death. In an accident, Tanuja's face gets burnt badly and mistakenly she gets Tanu's face. Rishi becomes more cold towards Tanuja . Also Rishi hates Tanuja as she is Sandy's niece. On the day of Rishi's marriage with his friend Malaika, who wants Rishi's property. Raj sees her with her boyfriend Shekhar Singh Ahlawat. Raaj asks Tanuja to be the bride without knowing anyone while Malaika gets late for the marriage as she is in the traffic jam. Rishi marries Tanuja. Rishi's hatred towards Tanuja increases but he realizes his love for Tanuja later. Rano and Malaika plot against Tanuja to separate her from Rishi but in vain. On the marriage day Rishi plays a smaller game with Malaika and open his real face and Later Malaika is thrown out of Bedi house after her secret is revealed as she had planned to destroy Bedi family along with her boyfriend Shekhar. On that very night Rishi and Tanuja consummate their marriage. Due to circumstances, Tanuja tells Rishi to divorce her as she thinks that she is unlucky for him and he will die if Tanuja remains in his life as his wife.Rishi agrees and they both sign divorce papers but later they are reunited as Tanuja gets to know she is right for Rishi. Rishi's stepbrother Purab Vohra comes and demands 51% shares of Rishi's company to take revenge from Raj.Rishi goes to give him 51% shares but Tanuja gets all Rishi's property and Bedi family business on her name to stop Rishi giving 51% shares to Purab as he wants to destroy Rishi. Divya, Yuvraj's wife is with Purab as she thinks they treat Yuvraj badly. Netra, Rano's friend's daughter loves Rishi and Rano wants Netra to marry Rishi. Rishi agrees to marry Netra so he can make Tanuja jealous so she confesses her love. On the day of Rishi and Netra's engagement, Rishi gets angry on Tanuja and tells her to sign property papers in 15 minutes and give his property back to him otherwise he will get engaged to Netra. Tanuja signs the property papers but Malaika steal the papers and gives it to Netra and asks her to take the credit of getting property back. Rishi gets engaged to Netra. Rishi gets drunk. Tanuja who is pregnant sees Rishi getting very close to Netra. Netra's trap gets successful. Thus, Tanuja leaves from Bedi House. Rishi goes to stop her at the railway station but they have a fight there and Rishi slaps Tanuja and in anger Tanuja gets in the train. Tanuja realises that she is pregnant with Rishi's child but it was too late. ===After 7 years=== Tanuja lives with her friend Abhishek Khurana and her and Rishi's daughter Natasha in London. Rishi lives with Netra and her daughter, Tania. Natasha and Tania assume Abhishek and Rishi as their respective father. Rishi and Abhishek also love them as their own daughter. Tanuja is Abhishek's house's caretaker. Tanuja and Abhishek pretend to be husband and wife in front of the world so do Rishi and Netra. Abhishek comes to India with Tanuja and Natasha to take over Rishi company. He and Rishi are business competitors. After many incidents, Rishi decides to get Natasha's custody along with Tanuja while Tanuja misunderstood Rishi and Netra to be in a live_in relationship. Rishi stops Abhishek and Tanuja's wedding hence leaving Netra. Tanuja applies for divorce with Rishi but the court orders Tanuja to stay in Bedi house with Rishi and Natasha for six months, after the time period she can divorce Rishi. Abhishek and Netra are heartbroken by this.Netra vows to ruin Tanuja while Rishi tries to rekindle his and Tanuja's love.Meanwhile, Ahana misunderstands Manpreet of having an affair with his secretary. Manpreet tries to save his relationship with Ahana but all his efforts go in vain as Ahana decides to part ways after Rano and anniversary.Abhishek tells Tanuja the truth about him, while Netra is not giving up and tries to separate them.Tanuja knows her truth and wants to expose her Evil truth but Rishi is not ready to believe her.Netra is successful in killing Tanuja. Abhishek gets emotional and tells to the Bedi Family that Netra is responsible for this. the Bedi's tells that tanuja has died. Meanwhile, Rishi who cannot live without Tanu kills himself by taking poison with an injection. ===After 25 years=== Rishi & Tanuja were reborn as Ranbir & Kritika.Ranbir is a famous football player in Canada.While,Kritika lives with her mother in Punjab.After her mother's death,she moved to find her father who was live in Mumbai to fullfil her mother's last wish. Kritika finally meets Arun who introduces her as his niece as she enters the house and lives with them. Later, she meets Ranbir for the first time. He begins to fall for her; they become friends. Malishka drugs and tries to seduce Ranbir. Then she files a fake molestation case against him. He is arrested but Akshay bails him out. Ranbir wins the case with Kritika's help. Malishka tries to kill his family by burning down the house. Ranbir expresses his love for Kritika who recalls her previous lives and awakens Ranbir to remind him. He also recognises her and they hug each other and unite, ending the series. ==Cast== ===Main=== * Sharad Malhotra as Rishi Singh Bedi (2016–18). * Kratika Sengar as Tanu & Tanuja (2016–18). The character of Tanu was initially killed off and replaced by Shivani Tomar as a reincarnated version of Tanu. However, after a drop in viewership and fans demand, Tomar's version of the character underwent plastic surgery in the storyline, and producers brought Sengar back into the role of Tanu. * Shivani Tomar as Tanuja Vikram Sikand, the reincarnated version of Tanu. Tomar portrayed the role of Tanuja for approximately one month before Sengar returned to the series. Poor audience response due to a perceived lack of chemistry between Tomar and Malhotra was cited as a reason for her dismissal (2016). * Sharad Malhotra as Ranbir Kapoor (2018–present). * Kratika Sengar as Kritika (2018–present). ===Recurring cast=== * Rajesh Puri as Arun Kohli, Kritika's father. * Vedika Bhandari as Ishani, Kritika's step sister. * Sabina Jat as Jia, Kritika's step sister. * Bikramjeet Kanwarpal as Ranbir's father. * Manjushree Kulkarni as Mahima, Ranbir's mother. * Karan Goddwani as Ranbir's younger brother. * Pranita Pandit as Netra, Rano's friend's daughter (2017–18). * Amit Tandon as Abhishek Khurana, Tanuja's friend and Rishi's business rival (2017–18). * Saba Mirza as Biji/ Preeti Singh Bedi, Rishi's grandmother (2016–18). * Vijay Kashyap as Raj Singh Bedi, Rishi, Manpreet and Yuvraaj's father (2016–18). * Vibha Chibber as Rano Raj Bedi, Rishi's mother (2016–18). * Lalit Bisht as Yuvraj Singh Bedi, Raj's adopted son (2016–17). * Chetna Kaintura as Divya Yuvraj Singh Bedi, Yuvraaj's wife (2016–17). * Zuber K. Khan as Manpreet Singh Bedi, Rishi's younger brother(2016-2018) * Shivika Rishi as Natasha Singh Bedi, Rishi & Tanuja’s daughter (2017–18). * Chahat Tewani as Tanya Singh Bedi,Smiley and Rohit's daughter,Rishi's adopted daughter (2017–18) * Aishwarya Raj as Riya (Cameo) * Shraddha Arya as Swati Bohra (Cameo) * Aditi Sharma Ved as Ahana Manpreet Singh Bedi, Tanu's sister and Manpreet's wife (2016–18). * Manorama Bhattishyam as Katyayni, Rishi and Tanu's love astrologer (2016–18). * Nikhil Khurana/Pranav Misshra as Nakul Singh Bedi, Yuvraaj's son (2016–17). * Farhad Khan/Chandni Sandhu as Smiley Singh Bedi, Manpreet's daughter (2016–17). * Devarsh Nirmal as Chintu Singh Bedi, Manpreet's son (2016). * Roma Bali as Bani Kuljeet Khurrana, Tanu's aunt (2016–17). * Gagan Gupta as Kuljeet Khurrana, Tanu's uncle (2016). * Arun Singh Rana/Sharhaan Singh as Sandeep Sikand/ Sandy, Neha's husband and Tanu's murderer (2016). * Renee Dhyani as Neha Sandeep Sikand, Bani's daughter and Tanu's murder (2016–17). * Suman Jain as Swati Kuljeet Khurrana, Bani's daughter (2016). * Hema Sood as Nidhi Sandeep Sikand, Sandy and Neha's daughter (2016). * Shreya Gupta as Vidhi Sandeep Sikand, Sandy and Neha's daughter (2016–17). * Vishnu Sharma as Veerendra Khurrana, Tanu's father (2016). * Jyoti Gauba as Sharda Khurrana, Tanu's mother (2016). * Malhar Pandya as Pawan Malhotra, Tanu's ex-fiancé (2016). * Sehrish Ali as Saloni Malhotra, Pawan's wife (2016). * Parveen Kaur as Savitri Malhotra, Pawan's mother (2016). * Smriti Khanna as Malaika Malhotra, Shekar's girlfriend (2016–17). * Rohit Sharma as Shekhar, Malaika's boyfriend and a business rival of Rishi (2016–17). * Puneet Sachdeva as Purab Bohra, Illegitimate son of Raaj (2017). * Abhilash Kumar as Rohit, Smiley's boyfriend (2016–17). * Aansh Arora as Samar, Abhishek's childhood friend (2017). * Mayank Kumar as Rohit, Abhishek's best friend (2017). ==Awards== Year Award Category Recipient Result 2016 Zee Gold Awards Best Popular Jodi Kratika Sengar & Sharad Malhotra rowspan=\"3\" Indian Television Academy Awards Gr8! Face (Male) Sharad Malhotra FICCI Excellence Awards Most Popular Television Fiction Ekta Kapoor 2017 Zee Gold Awards Best Power Packed Performance Sharad Malhotra rowspan=\"1\" Zee Gold Awards 2017: Divyanka Tripathi, Mouni Roy, Nakuul Mehta, Surbhi Chandna win BIG Colors Golden Petal Awards Best Jodi Sharad Malhotra - Kratika Sengar Colors Golden Petal Awards 2017: Complete winners list and award pictures ==International broadcast== The series aired in Pakistan by Filmazia simultaneously with Colors TV till 15 October 2016. ==References== Category:Hindi-language television series Category:2016 Indian television series debuts",
 "title": "Kasam Tere Pyaar Ki"
}