{
 "id": "622548",
 "text": "Fagun Bou; is an Indian Bengali television soap opera that premiered on 19 March 2018 and airs on STAR Jalsha. The show stars Vikram Chatterjee and Oindrilla Sen in lead roles. This show marks the comeback of Vikram Chatterjee and Oindrilla Sen on television, the latter after 6 years. ==Plot== Ayandeep marries Mahul, who has feeling for Anuroop. Turns out Anuroop and Ayandeep are brothers. With the three of them under the same roof, a complicated love triangle is ensured. ==Cast== ===Main Cast=== *Vikram Chatterjee as Dr. Ayandeep Ghosh aka Roddur *Oindrilla Sen as Mahul Bose aka Muniya / Fagun Bou *Koushik Roy as Anurup Ghosh aka Roop ===Recurring Cast and Characters=== Mahul's family *Ashok Bhattercharjee as Indrajit Bose - Chandrajit's father and Mahul's grandfather. *Chhanda K. Banerjee as Nonibala Bose - Chandrajit's mother and Mahul's grandmother. *Abhishek Chatterjee as Chandrajit Bose - Mahul, Bibi and Munna's father; Amrapali and Bidhumukhi's husband. After unwillingly marrying Bidhumukhi for keeping his parents' desire, her outgoing antics and his resultant dissipation led him to marry Amrapali. Till his death he managed to parallely maintain his two lives secretly. *Anushree Das as Bidhumukhi Bose - Chandrajit's first (legal) wife and Bibi's mother. She is a typical self-obsessed exaggerating ignorant and quarrelsome housewife. *Debolina Mukherjee as Bimboboti Bose aka Bibi - She is slightly eccentric (or scatterbrained), but is good and caring at heart and straight-forward in nature. *Bidipta Chakraborty as Amrapali Bose - Mahul's mother; Chandrajit's second (unlawful) wife and an aspiring singer. *Oindrilla Sen as Mahul Bose aka Muniya - A fun-loving, pampered, short-tempered but pure-hearted girl who is passionate about music. *Unknown as Manojit Bose aka Munna - Mohul's younger brother. Ayandeep's family *Santu Mukherjee as Chitrabhanu Ghosh aka Bhanu - Ayandeep's elder paternal uncle. He is the patriarch of the Ghosh family, who having retired from his job, maintains rules and regulations in the household, and loves to tease his younger brother Gulu at times. He misses his deceased wife and mostly remains tensed for his daughter, Tultuli. Besides, he is Angshu's father and Nilanjana's father-in-law. *Shankar Chakraborty as Deepankur Ghosh aka Ankur - Ayandeep's (adoptive) father. *Bharat Kaul as Gulmohar Ghosh aka Gulu - Ayandeep's younger paternal uncle, who is a struggling actor. *Diganta Bagchi as Parijaat Ghosh aka Riju - Ayandeep's youngest paternal uncle. *Laboni Sarkar as Malobika Ghosh - Ayandeep's (adoptive) mother, Deepankur's wife. *Rajshree Bhowmik as Sonali Ghosh - Ayandeep's paternal aunt, Parijaat's wife. *Suman Banerjee as Gagandeep Ghosh aka Jojo - Ayandeep's elder cousin brother. He is Chitrabhanu's son and Nilanjana's husband. *Sneha Chatterjee as Nilanajana Ghosh - Ayandeep's sister-in-law, Angshu's wife. She is a high school teacher. *Bulbuli Choubey Panjha as Simontika Ghosh aka Tultuli - Ayandeep's elder cousin sister, who was previously married to Anirban against her will. She despises her father and other family members for the marriage, that separated her from the love of her life. She is an assistant primary school teacher. *Vikram Chatterjee as Dr. Ayandeep Ghosh aka Roddur - He is a shy yet reserved and kind-hearted person, who believes in the idea of true love. *Koushik Roy as Anurup Ghosh aka Roop - Ayandeep's younger brother who is a singing sensation and successful performer of rock music. *Madhubani Ghosh as Aratrika Ghosh aka Tuki - Ayandeep's younger sister. *Sujoy Saha as Animesh Ghosh - Ayandeep's younger cousin brother, Parijaat-Sonali's son. *Ashmi as Sampurna Ghosh - Ayandeep's younger cousin sister, Parijaat-Sonali's daughter. Category:2018 Indian television series debuts",
 "title": "Fagun Bou"
}