{
 "id": "622576",
 "text": "Ringworm is a contagious disease that causes itching of skin. It occurs in small circular red or white patches. Ringworm is one of the diseases caused by fungi. Most of the time it affects the scalp and feet. Red spots often form on skin called tinea. Ringworm is in fact not caused by a worm. Fungi can survive extremely well in warm and humid areas, like locker rooms (such as those at swimming pools) or showers. This common and contagious skin infection gets its name from the red itchy circle/ring that forms on the surface of the skin. Types of ringworm: * Athlete’s foot: also called tinea pedis. This fungal infection causes an itchy burning skin rash between the toes and on the soles of feet. Skin may also become scaly and cracked. It can also cause a bad odour * Scalp ringworm: also called tinea capitis. This causes red itchy bald spots on the scalp. If they are left untreated, the bald spots can grow bigger and become permanent * Hands: Tinea manuum: Signs of ringworm affecting the hands include dry, caked palms and ring-like patches * Beard: Tinea barbae: Ringworm appears on the neck, chin and cheeks. The patches may become crusted over or filled with pus == Symptoms and causes== Signs typically appear between 4 - 14 days after skin comes in contact with the fungi that causes ringworm. The type of fungi that causes ringworm naturally lives on human skin, hair and nails. However when their environment gets hot and damp, the fungi start growing uncontrollably. The fungi are called dermatophytes. Besides spreading from person to person, ringworm can come from pets or other animals (like cats, dogs and rodents). It can spread easily when people are in close physical contact. It can also be passed on objects like combs, brushes, hats, towels and clothing. Minor skin injuries (such as scratches), too much exposure to heat and humidity, and some health conditions (like diabetes, obesity, or immune system problems) can make a person more likely to get ringworm. Other causes include excessive sweating (which gives the dermatophytes their ideal conditions to grow rapidly) and wearing tight socks and shoes. == Immune response == The host’s response to a dermatophyte plays a major role in the killing of dermatophytosis. The immune system and the skin work together to prevent and cure the infections at a skin surface level by inhibiting fungal growth, and accelerating epidermopoiesis, so that fungal hyphae are removed from the host body by normal replacement of skin. Several factors, which can account for natural resistance to dermatophytoses in humans and animals are known. Natural resistance to dermatophytes in humans is clearly seen after puberty. The natural resistance is due to the presence of fungistatic long chain fatty acids in the subum at puberty. Internal organs of humans and animals are naturally resistant to dermatophytoses. A fungistatic substance called serum factor of normal individuals and animals is believed to limit the growth of this fungus. The serum factor is an unstable, dialysable, heat liabile component of fresh serum and tissue fluid. == Laboratory diagnosis == Several standardised methods are available for the clinical diagnosis of dermatophytoses. Infected hair is selected by exposure to Wood’s lamp (UV light). Infected hair will fluoresce under Wood’s Lamp. Hence it can be used for the diagnosis of tinea capitis. Wood’s lamp is an UV lamp emitting radiation at 365 nm. Other samples can be used, including: * Skin scrapings from edges of ringworm lesions * Nail clippings * Hair stubs A termatophyte test agar medium (DTM) can also be used to isolate and distinguish dermatophytes from other fungal or bacterial contaminants found in cutaneous lesions. They turn medium red by raising the pH through metabolic activity, while most bacteria and fungi do not. Category:Fungal diseases == References ==",
 "title": "Ringworm"
}