{
 "id": "622790",
 "text": "The flag of the South Korea, also known as the Taegukgi (also spelled as Taegeukgi, literally \"supreme ultimate flag\"), has three parts: a white rectangular background, a red and blue Taeguk, symbolizing balance, in its center, and four black trigrams selected from the original eight, one toward each corner. The flag ratio is 2:3. == Symbolism == The white background stands for purity, peace and justice. The red and blue Taeguk symbolizes absoluteness, the universe, space and its parts. The red part of Taeguk yang (which signifies bright, hot, light and positive) and blue yin (which signifies dark, cold and negative). These represent the eternal philosophical categories, goodness and evilness, sun and moon, light and darkness, day and night, masculine and feminine element, move and immobility, activity and passivity, life and death. == History == In 1882 the flag of Korea was adopted by Korean empire with non specified trigrams.Part of the “History of National Flags” Series from Flagmakers. flagmakers.co.uk/media/ontcfk5n/flag-of-south- korea-a-brief-history-download.pdf#:~:text=The%20flag%20of%20the%20Korean. Accessed 25 Aug. 2023. ‌ In 1882 the original design of Korean flag was designed by \"Bak Yeong hyo\" === 1910 to 1945 === During this period Korea was annexed by Japan. Which made for Japan to take over their culture and also flag during this period, and after the world 2 Korea took control of their flag again which meant on 1945 or world war 2 they have won the battle after 1945.Part of the “History of National Flags” Series from Flagmakers. flagmakers.co.uk/media/ontcfk5n/flag-of-south-korea-a-brief-history- download.pdf#:~:text=The%20flag%20of%20the%20Korean.‌ Flag of the king of Joseon.svg|Royal flag of the Joseon Dynasty Flag of Korea (1882–1910).svg|Korean flag from 1882 to 1910 Flag of Japan (1870–1999).svg|Japanese flag used in Korea under Japan's control Flag of the People's Committee of Korea.svg|Flag of the short-lived People's Republic of Korea Flag of the United States (1912-1959).svg|American flag used Korea during American control Flag of South Korea (1945–1948).svg|South Korean flag under American occupation from 1946 to 1948 Flag of South Korea (1948–1949).svg|South Korean flag until 1949 == Trigrams meaning == Trigam MeaningMr, Paul, et al. The South Korean Flag Symbolism of the Flag. www.white-tiger- tkd.com/Symbolism%20of%20the%20flag%20white%20tiger%20%28secure%29.pdf. Accessed 22 Aug. 2023. ‌ Heaven, east, spring, air, justice Moon, north, winter, water, life Sun, west, autumn, fire, wisdom Earth, south, summer, soil, fertility With 4 Trigrams together it represent principle of movement and harmony. == Related pages == * Aegukga, the National anthem of South Korea == References == South Korea Category:National symbols of South Korea Category:Flags introduced in 1948",
 "title": "Flag of South Korea"
}