{
 "id": "623007",
 "text": "A Special Representative of the Secretary-General is a highly respected expert who has been appointed by the Secretary-General of the United Nations to represent her/him in meetings with heads of state on critical human rights issues. The representatives can carry out country visits to investigate allegations of human rights violations or act as negotiators on behalf of the United Nations. ==History== Among issues it has covered are women's rights, including gender equality, violence against women, domestic violence, Hudood Ordinance, honour killing, Forced disappearance in Pakistan, abolition of capital punishment, LGBT rights, restrictions on press freedom, freedom of speech, freedom of religion, freedom of movement, police brutality, and religiously-inspired violence. The commission is a member organisation of the Asian Forum for Human Rights and Development (FORUM-ASIA). the chairperson is Zohra Yusuf, an activist and journalist. She joined HRCP in 1988, was elected a Council Member in 1990 then Vice Chairperson and Secretary General before becoming Chairperson in 2011. == Aims == It describes its aims as: * to work for the ratification and implementation by Pakistan of the Universal Declaration of Human Rights and of other related Charters, Covenants, Protocols, Resolutions, Recommendations and internationally adopted norms; * to promote studies in the field of human rights and mobilise public opinion in favour of accepted norms through all available media and forums, and to carry out every category of activity to further the cause; * to cooperate with and aid national and international groups, organisations and individuals engaged in the promotion of human rights and to participate in meetings and congresses on human rights at home and abroad; * to take appropriate action to prevent violations of human rights and to provide legal aid and other assistance to victims of those violations and to individuals and groups striving to protect human rights. ==References== Category:Organizations based in Pakistan",
 "title": "Human Rights Commission of Pakistan"
}