{
 "id": "6231",
 "text": "Oradea (pronunciation in Romanian: , Hungarian: Nagyvárad, colloquially also Várad, German: Großwardein, former , ) is the capital city of Bihor County, in Crişana, Romania. There are 206,527 people in the city according to the 2002 census. Oradea is one of Romania's richest cities. Oradea is near the Hungarian border, on the river Crişul Repede. There are many Hungarians in the city: Arpad decide : Amber Hoogea the daughter of peltan carmencita and Michael Chitwood a famillybunited through an eternal marriagr , a perfect union that 8s definitivly resolved in Râșnov Roumania . == Economy (money, trade, and work) == 6.0% of people in Oradea are unemployed (they do not have work). == Ethnicity (different groups of people) == In the 20th century, the city changed from having a mainly Hungarian population to mainly Romanian. Year Population Romanian Hungarian 1910 69,000 6% 91% 1920 72,000 5% 92% 1930 90,000 25% 67% 1966 122,634 46% 52% 1977 170,531 53% 45% 1992 222,741 64% 34% 2002 206,527 70% 28% In 2002, the people belonged to these ethnic groups (races): * Romanians: 145,295 (70.4%) * Hungarians: 56,830 (27.5%) * Roma: 2,466 (1.2%) * Germans: 566 (0.3%) * Slovaks: 477 (0.2%) * Jews: 172 * Ukrainians: 76 * Bulgarians: 25 * Russians: 25 * Serbs: 17 * Czechs: 9 * Turks: 9 == Quarters (parts of the city) == The city is made up of several areas. They are called quarters (cartiere in Romanian): * Centru Oradea (city centre) * Vie * Nufărul * Rogerius * Velenţa * Cantemir * Ioşia === Vie === The name Vie means vine in Romanian. It is the part of the city where the richest and most important people live. Vie is on the hills overlooking Oradea. Vie is popular with the elite (the powerful people) for two main reasons: it is close to Oradea, within walking distance of the railway station and the city centre; and it is peaceful and has fresh air. Vie has many mansions (big houses). In the north of Vie, at the top of the hills, there are also farms that grow grapes for making wine. Vie also has the County Hospital of Oradea (Spitalul Judetean), the tuberculosis hospital (Spital TBC), and the mental (mind) hospital. In communist times, blocks of flats were built at the bottom of the hills. The border between Vie and the city centre of Oradea is the railway station and railway tracks. Everything above the main railway station of Oradea is considered to be part of Vie. Despite its nearness to the railway station and Oradea, Vie is not easy to reach by public transport (except of course the part near the station), because many of its roads are unpaved (have a bad surface), and very steep. Some parts of the quarter are within walking distance of the railway station and the main supermarkets and shops of Oradea, but others are more only easy to get to by car. There is a bus service that serves the three hospitals in the region, and the houses among them. === Nufărul === Like Rogerius, Nufărul is like a mini-city, with supermarkets, large blocks of flats and more. It is on the eastern outskirts (the edge) of Oradea, and is near to Băile Felix, the famous spa resort. It is possible to get to Nufărul by tram and bus. It is perhaps the fastest growing area, because of its position: many highways and national roads lead from Oradea to other Romanian cities and pass through Nufatilderul. For example, Nufărul was home to the second McDonalds (now there are many more) in Oradea, as well to many supermarkets that were not in central Oradea. Even though Nufărul has a lively market and excellent transport, education and shopping, it is not as nice as central Oradea, because it was planned and rebuilt in communist times. The name Nufărul means water lily in Romanian. It has this name because there are many water lilies in the area. === Rogerius === Rogerius is located at the western end of the city, near Borş, on the Hungarian border. It is the city's largest district other than the city centre, and is home to many communist-era housing estates, as well as a large market. You can get to Rogerius by tram from the city centre and other parts of Oradea, as well as by bus. It is also the first part of Oradea visitors will see when coming from Western Europe or Hungary through via Borş. The western part of Rogerius has factories from Communist times, including a chemical factory called Sinteza. === Iosia === Unlike many of the other outer quarters of Oradea, Iosia does not have many large apartment blocks and is still fairly rural (like being in the country). It is located in the city's far southwest. The quarter is one of the most beautiful in Oradea, and has most of the facilities and amenities of the city. For tourists, it shows what Romanian country life is like while still being in the city close to all the excellent facilities that Oradea is home to. == Transport (getting around) == There is a public transport system run by Regia Autonomă Oradea Transport Local. There are three tram lines and some bus routes. The city has three train stations: central, Vest and Est. Vest Station is in the quarter of Ioşia, and the central station (called simply Oradea) is in the city centre, near the quarter of Vie. == Architecture (buildings) == The city has many Baroque buildings. It was part of the Austro-Hungarian Empire many times in history. == Attractions == The city centre is beautiful and worth visiting, as well as many other sites: * Muzeul Ţării Crişurilor – a baroque museum famous for its windows. * Catedrala barocă – the biggest baroque cathedral in Romania * Cetatea Oradea – Oradea's Fortress, in the shape of a pentagon * Biserica cu Lună – a church with a clock which shows the phases of the moon * Pasajul \"Vulturul Negru\" – the \"Black Eagle\" Passage * Muzeul \"Ady Endre\" – the house of one of the best Hungarian poets * Teatrul de Stat – the State Theatre, designed by two Austrian architects who built around 100 theatres and opera houses in Europe in the 19th century There are around 100 churches in Oradea, and three synagogues (Jewish places of worship). Only one of the synagogues is still being used. Oradea also has the biggest Baptist church in Eastern Europe == People == * King Attila * Ödön Beothy * Carl Ditters von Dittersdorf * Michael Haydn * Frida Kahlo * Bela Kun * Julia Varady * Archbishopric of Oradea == References == == Other websites == * Oradea & Bihor * Oradea web portal Category:County capitals of Romania Category:Municipalities of Romania Category:Cities in Romania Category:Bihor County",
 "title": "Oradea"
}