{
 "id": "623364",
 "text": "Tajikistan sent people to compete at the 2018 Winter Paralympics in Pyeongchang, South Korea. Two people will be competing in para-Nordic skiing in Tajikistan's first appearance at the Winter Paralympics. They trained in Germany and China before the start of the Games. == Team == Two people will compete at the Winter Paralympics in South Korea. They are both competing in para-Nordic skiing. Georgia, North Korea and Tajikistan are the three countries making their first appearance at Winter Paralympics. == Russian doping scandal == 15 National Paralympic Committees and the International Wheelchair and Amputee Sports Federation signed a letter expressing support for the National Paralympic Committee of Russia in August 2017. The countries included Armenia, Belarus, Bulgaria, Vietnam, Kazakhstan, Kyrgyzstan, China, Laos, Moldova, Mongolia, Serbia, Tajikistan, Montenegro, and South Korea. They asked the IPC Governing Board to consider letting Russia compete at the 2018 Winter Paralympics. The letter was signed weeks before the IPC Governing Board met in Abu Dhabi. In September 2017, this decision was reviewed and upheld. The International Paralympic Committee (IPC) still had concerns about doping in Russian sport. All the conditions the IPC required of the Russians were not met. == History == Tajikistan had never competed at the Winter Paralympics before 2018. These Games are their Winter Games debut. The country has only compete at four Summer Paralympics. They were the 2004, 2008, 2012 and 2016 Games. Tajikistan has three total people compete at these four Games. They never won a medal. The country did not send any competitors to the 2018 Winter Olympics. They had competed at every Winter Games since 2002. No one competed in qualifying competitions for the Olympics. == Para-Nordic skiing == Tajikistan has a skier competing in para-Nordic skiing. They trained in Germany and China before the start of the Games. === Schedule and results === On 12 March, the 15 km race takes place, with standing and vision impaired women starting at 10:00 PM. Thee sprint classic qualification takes place on 14 March from 10:00 AM - 11:25 AM for both men and women in all classes. It is followed in the afternoon by the semifinals and finals. The classic race takes place on 17 March. The standing and visually impaired women's race takes place from 10:00 AM - 12:30. == References == Category:Nations at the 2018 Winter Paralympics Category:Sport in Tajikistan",
 "title": "Tajikistan at the 2018 Winter Paralympics"
}