{
 "id": "623553",
 "text": "The following is a list of deaths that should be noted in March 2018. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==March== thumb|right|120px| ===1=== * Dorne Dibble, 88, American football player (Detroit Lions), NFL Champion (1953, 1957), pneumonia.Dorne Dibble, Lions world champ, Michigan State All-American, dies at 88 * Anatoly Lein, 86, Russian-born American chess Grandmaster.Anatoly Lein * Arabinda Muduli, 56, Indian Bhajan singer-songwriter, cardiac arrest. * María Rubio, 83, Mexican actress (¡Vivan los niños!, Salomé, Una familia con suerte).Muere María Rubio, la actriz que interpretó a Catalina Creel en 'Cuna de Lobos' * Luigi Taveri, 88, Swiss motorcycle road racer, Grand Prix champion (1962, 1964, 1966), complications from a stroke.Luigi Taveri: adieu grand petit homme ===2=== * Gillo Dorfles, 107, Italian art critic, painter, and philosopher.E' morto Gillo Dorfles, scompare a 107 anni il rivoluzionario critico d'arte * Ota Filip, 87, Czech novelist (Děda a dělo, Blázen ve městě, Kavárna Slavia) and journalist.Zemřel přední český exilový spisovatel Ota Filip. Podívejte se na jeho poslední rozhovor pro Reflex | Reflex.cz * Brandon Jenkins, 48, American singer-songwriter (\"Refinery Blues\", \"Out of Babylon\", \"Feet Don’t Touch The Ground\"), complications from heart surgery.Red dirt music artist Brandon Jenkins dies * Jesús López Cobos, 78, Spanish conductor, neuroendocrine cancer. * Carlo Ripa di Meana, 88, Italian politician, Minister of the Environment (1992–1993) and European Commissioner for the Environment (1983–1993), skin cancer.Morto Carlo Ripa di Meana. Due mesi fa l'addio alla moglie Marina ===3=== * Sir Roger Bannister, 88, British middle-distance athlete, first person to run a sub-four-minute mile, Parkinson's disease.Sir Roger Bannister, first athlete to run a mile in under four minutes, dies aged 88 * Tônia Carrero, 95, Brazilian actress (Tico-Tico no Fubá, Água Viva, Louco Amor), cardiac arrest complicated from surgery.Atriz Tônia Carrero morre aos 95 anos * Vanessa Goodwin, 48, Australian politician, Attorney-General of Tasmania (2014–2017), brain cancer.Former Attorney-General Vanessa Goodwin dies after a battle with brain cancer * Kenneth Gärdestad, 69, Swedish songwriter (\"Satellit\") and architect, pneumonia and influenza complicated by skin cancer and lymphoma.Kenneth Gärdestad är död - avled i morse * Billy Herrington, 48, American pornographic actor (HotMen CoolBoyz), car crash.快訊／G片男星比利海靈頓車禍身亡 「森之妖精」享年48歲 * Jorge Wagensberg Lubinski, 69, Spanish physicist, academic (University of Barcelona), and writer, founder director of CosmoCaixa, pancreatic cancer.Muere el científico y museógrafo Jorge Wagensberg a los 69 años * Lin Hu, 90, Chinese general, Deputy Commander of the PLA Air Force (1985–1994).空军原副司令林虎中将逝世享年91岁 * Franz Pacher, 98, Austrian engineer.Trauer um Franz Pacher * Derek Saunders, 90, English football player (Chelsea F.C.).Derek Saunders 1928-2018 * David Ogden Stiers, 75, American actor (M*A*S*H, Beauty and the Beast, The Dead Zone), complications from bladder cancer.David Ogden Stiers, 'M*A*S*H*' star and Newport resident, dies at 75 * Yvon Taillandier, 91, French artist.L'auteur et plasticien Yvon Taillandier est mort ===4=== * Davide Astori, 31, Italian footballer (Cagliari, Fiorentina, national team), heart attack.Fiorentina, morto Davide Astori: trovato senza vita in albergo a Udine * Sir William McAlpine, 6th Baronet, 82, British engineering businessman (Sir Robert McAlpine).Saviour of Flying Scotsman dies * James Luna, 68, American performance artist.Noted Indigenous performance artist James Luna walks on * Farhang Mehr, 94, Iranian-born American Zoroastrian scholar and writer, Deputy Prime Minister (1973–1975).فرهنگ مهر، از چهره‌های برجسته جامعه زرتشتیان و معاون سابق هویدا درگذشت * H. Wayne Norman, Jr., 62, American politician, member of the Maryland Senate (since 2014) and House of Delegates (2008–2014), suspected heart attack.Veteran Lawmaker Dies (death announced on this date) ===5=== * Trevor Baylis, 80, British inventor (windup radio).Trevor Baylis, inventor of the wind-up radio, dies aged 80 * Derek Bickerton, 91, English-born American linguist and academic.DEREK BICKERTON Obituary * John Hall Buchanan Jr., 89, American politician, member of the U.S. House of Representatives from Alabama's 6th congressional district (1965–1981), complications from dementia. * Tomas Aguon Camacho, 84, Northern Mariana Islands Roman Catholic prelate, Bishop of Chalan Kanoa (1984–2010), sepsis. * Kjerstin Dellert, 92, Swedish opera singer (\"Someone to Watch Over Me\"), respiratory failure.Kjerstin Dellert har dött * André S. Labarthe, 86, French actor (Vivre sa vie, L'Amour fou, Les Enfants jouent à la Russie) and movie director (Cinéastes de notre temps).Hommage à André S. Labarthe * Uri Lubrani, 91, Israeli diplomat and military official, Ambassador to Iran (1973–1978).Умер советник министров обороны Ури Лубрани * Paul Magriel, 71, American professional backgammon and poker player-author, suspected heart attack. (body discovered on this date) * Jam Saqi, 73, Pakistani politician, kidney failure.Renowned politician and leftist leader Jam Saqi passes away * Helmut Maucher, 90, German food and beverage executive, CEO and chairman of Nestlé (1990–1997).Nestle growth architect Maucher dies aged 90 | Reuters * Stephan Tanneberger, 82, German oncologist and chemist, blood and bone cancer.Stephan Tanneberger ist tot * Michael Watts, 79, British journalist (Sunday Express) and radio broadcaster (BBC Radio 4).Michael Watts * Hayden White, 89, American historian (Metahistory: The Historical Imagination in Nineteenth-Century Europe).Hayden White (1928-2018) ===6=== * Paul Bùi Văn Đọc, 73, Vietnamese Roman Catholic prelate, Archbishop of Ho Chi Minh (since 2014), stroke.L’arcivescovo di Ho Chi Minh City muore a Roma, durante la visita ad limina * Peter Freund, 81, Romanian-born American physicist (University of Chicago).Peter Freund, particle physicist and fiction writer, 1936-2018 * Peter Nicholls, 78, Australian writer (The Encyclopedia of Science Fiction), complications from Parkinson's disease.Mort de Peter Nicholls, éditeur de l'Encyclopédie de la science-fiction * Indra Bahadur Rai, 91, Indian writer (Gorkhas Imagined), multiple organ failure.Remembering Indra Bahadur Rai, the Writer Who Defined the Indian-Nepali Identity * Shammi, 89, Indian actress (Dil Apna Aur Preet Parai, Khuda Gawah, Dekh Bhai Dekh), cardiopulmonary arrest.Veteran actress Shammi passes away at 89, Big B, others mourn her death * Sir John Sulston, 75, British biologist, Nobel Prize laureate (2002).Sir John Sulston, pioneering genome scientist, dies aged 75 ===7=== * Reynaldo Bignone, 90, Argentine politician and human rights criminal, President (1982–1983), congestive heart failure complicated by septic shock. * Woody Durham, 76, American college basketball radio announcer (North Carolina Tar Heels), complications from primary progressive aphasia.Voice of the Tar Heels Woody Durham Dies * Antonia La Negra, 82, Spanish singer (La familia Montoya) and dancer (El ángel y Rito y geografía del cante), aortic anuerysm.Muere Antonia la Negra, una cantaora de época * Charles Thone, 94, American politician, Governor of Nebraska (1979–1983) and member of the U.S. House of Representatives from Nebraska's 1st congressional district (1971–1979), respiratory failure.Services Tuesday for former Nebraska Governor Charley Thone ===8=== * Bento the Keyboard Cat, 9, American celebrity cat, liver cancer.Feline phenom: Bento the Keyboard Cat dies at age 9. Condolences pour in * Ron Franklin, 58, American jockey, Kentucky Derby winner (1979), lung cancer.Ronnie Franklin Passes Away at 58 * Sir Wilson Harris, 96, Guyanese writer (Palace of the Peacock).Guyanese literary giant, Sir Wilson Harris, dies * Milko Kelemen, 93, Croatian composer.Umro Milko Kelemen, pokretač Muzičkog biennala Zagreb * Peter Temple, 71, South African-born Australian novelist (Jack Irish, The Broken Shore, The Broken Shore), Gold Dagger (2006), Miles Franklin Award winner (2010) and multiple Ned Kelley Award winner, pancreatic cancer.Acclaimed Crime Writer Peter Temple Dies Aged 71 * Togo D. West, Jr., 75, American politician, Secretary of the Army (1993–1998) and Secretary of Veterans Affairs (1998–2000), heart attack.Togo D. West Jr., Clinton appointee who investigated Army abuses and led veterans affairs, dies at 75 * Kate Wilhelm, 89, American author (Baby, You Were Great, The Infinity Box, Where Late the Sweet Birds Sang), Hugo Award winner (1977) and multiple Nebula Award winner.Kate Wilhelm (1928-2018) ===9=== * Chris Gedney, 47, American football player (Chicago Bears, Arizona Cardinals).College football: Former Syracuse All-American Gedney dead at age 47 * Oskar Gröning, 96, German SS officer and war criminal.Oskar Groening, ‘Account of Auschwitz’ found guilty for role in 300,000 Holocaust murders, dies at 96 * Jo Min-ki, 52, South Korean actor (East of Eden, The Cut, The Attorney) and professor, suspected suicide by hanging.South Korean actor Jo Min Ki, accused of sexual assault, found dead * Jung Jae-sung, 35, South Korean badminton player, Olympic bronze medalist (2012), heart attack.Local badminton community shocked by death of Chung Jae-sung * George A. Sinner, 89, American politician, Governor of North Dakota (1985–1992), pneumonia.Former North Dakota Gov. George Sinner dies at age 89 * Millie Dunn Veasey, 100, American civil rights activist.Pioneering WWII veteran who turned 100 last month dies * Ion Voinescu, 88, Romanian footballer (Olympia București, national team, Steaua București).Fostul international Ion Voinescu a decedat la varsta de 88 * Elías Yanes Álvarez, 90, Spanish Roman Catholic prelate, Archbishop of Zaragoza (1977–2005), complications from a fall.El presidente del PAR recuerda la gran labor de Elías Yanes en Aragón y lamenta su fallecimiento ===10=== * Garech Browne, 78, Irish arts patron, founder of Claddagh Records. * Hubert de Givenchy, 91, French fashion designer (Givenchy). * Wally Gould, 79, English footballer (York City, Brighton, Hellenic), vascular dementia.Wally Gould: Brighton and Hove Albion great dies * Ali Asghar Khodadoust, 82, Iranian surgical opthamologist, namesake of Khodadoust line, coronary artery disease.Ali Asghar Khodadoust, Iranian legend of ophthalmology, passes away at 82 * Michel Raynaud, 79, French mathematician.Décès de Michel Raynaud * Ralf Waldmann, 51, German Grand Prix motorcycle road racer, suspected heart attack.Zweimaliger Motorrad-Vizeweltmeister Waldmann gestorben ===11=== * Baltasar Corrada del Río, 82, Puerto Rican judge and politician, Mayor of San Juan (1985–1989) and Associate Justice of the Supreme Court of Puerto Rico (1995–2005), Alzheimer's disease.Fallece Baltasar Corrada del Río, exjuez del Tribunal Supremo * Sir Ken Dodd, 90, English comedian (Diddy Men), singer-songwriter (\"Tears\") and actor (Hamlet), complications from bronchitis.Comedian Sir Ken Dodd has died * Karl Lehmann, 81, German Roman Catholic cardinal, Diocese of Mainz (1983–2016), complications from a stroke.Kardinal Karl Lehmann ist tot * Siegfried Rauch, 85, German actor (Patton, Le Mans, Das Traumschiff), heart failure complicated from a fall.Siegfried Rauch gestorben: Feuerwehr kämpfte um sein Leben * Mary Rosenblum, 65, American author (The Drylands, Gardening Mysteries) and pilot, plane crash.Author, Pilot and Master Cheesemaker Mary Rosenblum Dies in Plane Crash ===12=== * Nokie Edwards, 82, American Hall of Fame rock guitarist (The Ventures) and actor (Deadwood), staph infection complicated from hip surgery. * Rudolf Mang, 67, German weightlifter, Olympic silver medalist (1972), heart attack.Der \"Bär von Bellenberg\": Gewichtheber-Legende Rudolf Mang ist tot * Henry Minarik, 90, American football player (Pittsburgh Steelers).Henry John \"Hank\" Minarik * Oleg Tabakov, 82, Russian actor (War and Peace, Moscow Does Not Believe in Tears, D'Artagnan and Three Musketeers).Renowned USSR artist Oleg Tabakov passes away at 82 ===13=== * T. Berry Brazelton, 99, American pediatrician and author, developed the Neonatal Behavioral Assessment Scale and Daytime Emmy Award winner (1994).Dr. T. Berry Brazelton, child care expert and pediatrician, dies at 99 * Bebeto de Freitas, 68, Brazilian Olympic volleyball coach (1984) and football manager (Atlético Mineiro), heart attack.Morre Bebeto de Freitas, aos 68 anos * Leonid Kvinikhidze, 80, Russian screenwriter (The Straw Hat) and movie director (Failure of Engineer Garin, Mary Poppins, Goodbye).Режиссер фильма \"Мэри Поппинс, до свидания\" Квинихидзе скончался в Петербурге * Jens Nilsson, 69, Swedish politician, MEP (since 2011) and Chairman of Östersund Municipality (1997–2009).EU-parlamentsledamoten Jens Nilsson död * Gordon Walgren, 85, American politician and convicted fraudster, member of the Washington House of Representatives (1966) and member of the Washington State Senate (1967–1980).Gordon Walgren, lawyer and former lawmaker, dies at 85 ===14=== * Jim Bowen, 80, English television presenter (Bullseye) and comedian (The Comedians), complications from a stroke.https://news.sky.com/story/bullseye-star-jim-bowen-dies-aged-80-11289551 Bullseye star Jim Bowen dies aged 80 * Emilio Disi, 75, Argentine actor (Todas las azafatas van al cielo, La Aventura explosiva, Muerte en Buenos Aires) and humorist, lung cancer.Murió Emilio Disi * Marielle Franco, 38, Brazilian politician, member of the Municipal Chamber of Rio de Janeiro (since 2017), shot.Vereadora do PSOL é morta a tiros no Rio de Janeiro * Rubén Galván, 65, Argentine footballer (national team, Club Atlético Independiente, Estudiantes), cirrhosis.Murió Rubén Galván, campeón mundial en Argentina 78 y una gloria de Independiente * Stephen Hawking, 76, English theoretical physicist, professor (University of Cambridge) and writer (A Brief History of Time), complications from ALS.Physicist Stephen Hawking dies aged 76 * Narendra Jha, 55, Indian actor (Raees, Haider, Raavan), heart attack.Raees actor Narendra Jha dead, Hansal Mehta tweets ‘this profession is truly a killer’ * Palle Kjærulff-Schmidt, 86, Danish film director (Once There Was a War) and screenwriter.Instruktør Palle Kjærulff-Schmidt er død * John Ludwick, 32, American claimant of involvement in the disappearance of Natalee Holloway, stabbed.Florida man who said he helped bury Natalee Holloway dies in failed kidnapping * Adrian Lamo, 37, American computer hacker (WikiLeaks) and political activist, exposed Chelsea Manning.Adrian Lamo, Hacker Who Exposed Chelsea Manning, Dies at 37 * Liam O'Flynn, 72, Irish uilleann piper (Planxty), emphysema.Liam O’Flynn, Planxty founder and master uilleann piper, dies at 72 * Petar Stipetić, 80, Croatian military officer, Armed Forces Chief of Staff (2000–2002). ===15=== * Tom Benson, 90, American automobile dealer, philanthropist and sports franchise owner (New Orleans Saints, New Orleans Pelicans), Super Bowl winner (2010), complications from influenza. * Ed Charles, 84, American baseball player (New York Mets, Kansas City Athletics).Ed Charles, a Mainstay of the Miracle Mets, Is Dead at 84 * Augie Garrido, 79, American baseball coach (Cal State Fullerton, Texas Longhorns), stroke.Legendary Texas baseball coach Augie Garrido dead at 79 * Larry Kwong, 94, Canadian ice hockey player (New York Rangers), first player to break NHL's colour barrier, complications from pneumonia.Larry Kwong * Mohamed Sayah, 84, Tunisian politician.L’ancien ministre Mohamed Sayah n’est plus ===16=== * Boyukagha Hajiyev, 59, Azerbaijani football player and manager (Araz-Naxçıvan, Neftçi), complications from a heart attack.\"Neftçi\"nin sabiq baş məşqçisi Böyükağa Hacıyev vəfat edib * Arnie Lerma, 67, American writer and Scientology whistleblower, suicide by gunshot.Noted Scientology critic Arnie Lerma shoots and injures wife, then kills himself * Louise Slaughter, 88, American politician, member of the U.S. House of Representatives from New York's 25th congressional district (since 1987), complications from a fall.Rep. Louise Slaughter, liberal Democrat who championed women’s rights, dies at 88 ===17=== * Nicholas Edwards, Baron Crickhowell, 84, British politician, Secretary of State for Wales (1979–1987).Obituary: Nicholas Edwards, Lord Crickhowell * Benny Fredriksson, 58, Swedish actor (Sammansvärjningen, Kära farmor) and theatre director, CEO of Stockholm City Theatre (2002–2017), suicide.Kulturhuset Stadsteatern: Benny Fredriksson avslutade själv sitt liv * Guðjón Arnar Kristjánsson, 73, Icelandic politician, MP (1999–2009), cancer.Andlát: Guðjón A. Kristjánsson (death announced on this date) * Mike MacDonald, 63, Canadian comedian (Late Show with David Letterman) and actor (Mr. Nice Guy, The Ripping Friends, Screwballs II), heart failure.Ottawa comic Mike MacDonald dead at 63 * Zdeněk Mahler, 89, Czech screenwriter (Amadeus) and musicologist.Zemřel spisovatel a scenárista Zdeněk Mahler * Phan Văn Khải, 84, Vietnamese politician, Prime Minister (1997–2006).Former PM Phan Van Khai dies, aged 85 ===18=== * Barkat Gourad Hamadou, 88, Djiboutian politician, Prime Minister (1978–2001).Décès de l'ancien Premier ministre djiboutien Barkat Gourad Hamadou * Li Ao, 82, Chinese-born Taiwanese social commentator and historian, 2000 presidential candidate and MLY (2005–2008), brain cancer. * Ivor Richard, Baron Richard, 85, British politician and diplomat, MP for Barons Court (1964–1974), Ambassador to the United Nations (1974–1979) and Lord Privy Seal (1997–1998).Former Labour Cabinet Minister Lord Richard dies aged 85 ===19=== * Hasan Celal Güzel, 73, Turkish journalist and politician, Minister of Education, Youth and Sport (1987–1989).Former Turkish state minister Güzel dies at 73 * Arnold R. Hirsch, 69, American historian (University of New Orleans) and writer (Making the Second Ghetto: Race and Housing in Chicago, 1940-1960), complications from Lewy body dementia.Arnold R. Hirsch dies; analyzed Chicago segregation in influential book * Jean Michel Larrasket, 67, French engineer and professor (University of Pau and Pays de l'Adour, Mondragón University).Jean Michel Larrasket Eusko Ikaskuntzako Iparraldeko lehendakaria zendu da * Luo Fu, 89, Taiwanese poet, respiratory failure complicated by lung cancer台灣當代詩人洛夫今晨病逝北榮 享壽91歲 * Keith O'Brien, 80, Scottish Roman Catholic Cardinal, Archbishop of St Andrews and Edinburgh (1985–2013), complications from a fall.Cardinal Keith O'Brien dies after fall * Kedarnath Singh, 83, Indian poet (Akaal Mein Saras), Jnanpith Award winner (2013).Hindi poet Kedarnath Singh dies in Delhi at 83 * Sudan, 45, Kenyan northern white rhinoceros, last known male of his subspecies, euthanized.World's last male northern white rhino dies ===20=== * Katie Boyle, 91, Italian-born British actress (The Truth About Women), television presenter (Eurovision Song Contest), and game-show panelist (What's My Line?).personality and UK Eurovision host Katie Boyle dies aged 91 * Dylan Mika, 45, New Zealand rugby union player (Samoa national team, New Zealand national team, Auckland), heart attack.Former All Black Dylan Mika dead, at 45 * Peter George Peterson, 91, American financier (Lehman Brothers, The Blackstone Group) and politician, Secretary of Commerce (1972–1973).Peter G. Peterson, financier who warned of rising national debt, dies at 91 * Emmett Hulcy Tidd, 94, American military officer, complications from dementia.VADM USN Emmett H. (Ret.) Tidd ===21=== * Anna-Lisa, 84, Norwegian-born American actress (Black Saddle, Have Rocket, Will Travel, 12 to the Moon).Den norske Hollywood-skuespilleren Anna-Lisa Ruud er død * Mark Anthony Conditt, 23, American serial bombing suspect (Austin bombings), suspected suicide by explosion.Texas bombing suspect kills self, reported to be unemployed man, 23 * Tom Higgins, 73, American rock climber.Addio a Thomas John Higgins, pioniere dell'arrampicata libera * James C. Irwin, 88, American military officer, Vice Commandant of the United States Coast Guard (1986–1988), Alzheimer's disease.James \"Jim\" Irwin * Rolf Leeser, 88, German-born Dutch footballer (Ajax) and fashion designer.Oud-Ajacied Rolf Leeser overleden * John W. Vogt, 81, American engineer and politician, member of the Florida Senate (1973–1988), pulmonary fibrosis.Former Senate President John Vogt dies after illness * Leo C. Zeferetti, 90, American politician, member of the U.S. House of Representatives from New York's 15th congressional district (1975–1983).Leo Zeferetti Obituary ===22=== * Dick Gamble, 89, Canadian hockey player (Rochester Americans, Montreal Canadiens, Toronto Maple Leafs), Stanley Cup (1953). * René Houseman, 64, Argentine footballer (Defensores de Belgrano, Huracán, national team), World Cup champion (1978), tongue cancer.Murió René Houseman, campeón en el Mundial de Argentina 78 e ídolo de Huracán * Wayne Huizenga, 80, American retail (Blockbuster Video, AutoNation), and service executive (Waste Management), and sports team owner (Miami Dolphins, Florida Marlins, Florida Panthers), cancer.H. Wayne Huizenga, South Florida business titan, dead at 80 * Johan van Hulst, 107, Dutch politician, author and academic, Member of the Senate (1956–1981), Member of the European Parliament (1961–1968), recipient as a Righteous Among the Nations.Oud-senator Johan van Hulst (107) overleden * Jan Kantůrek, 69, Czech translator (Terry Pratchett), thrombosis complicated by diabetes.Zemřel Jan Kantůrek. Českým čtenářům přinesl Pratchettovu Zeměplochu, Hellboye i barbara Conana * Morgana King, 88, American jazz singer (\"A Taste of Honey\", \"My Funny Valentine\", \"For You, For Me, For Evermore\") and actress (The Godfather, The Godfather Part II), non-Hodgkin’s lymphoma.Morgana King, Jazz Singer and Brando's Wife in 'The Godfather,' Dies at 87 * Charles Lazarus, 94, American businessman, founder of Toys \"R\" Us, respiratory failure.Toys 'R' Us Founder Charles Lazarus Dies at 94 * Dariush Shayegan, 83, Iranian cultural theorist and philosopher, stroke.Famed Iranian philosopher Shayegan dies at age 83 ===23=== * DuShon Monique Brown, 49, American actress (Chicago Fire, Prison Break, Unexpected).'Chicago Fire' actress DuShon Monique Brown dies at 49 * Murray S. Hoffman, 93, American cardiologist.Murray Hoffman * Philip Kerr, 62, Scottish author (March Violets, Children of the Lamp, A Philosophical Investigation).Philip Kerr, author of Bernie Gunther novels, dies aged 62 * Jukka Mikkola, 74, Finnish politician, MP (1983–1986, 1995–2003).Poliitikko Jukka Mikkola on kuollut * Zell Miller, 86, American politician, Governor of Georgia (1991–1999) and U.S. Senator (2000–2005), Parkinson's disease.Former GA Governor and U.S. Senator Zell Miller dies at 86 * Alberto Ongaro, 92, Italian journalist (Corriere dei Piccoli, L'Europeo) and writer (La taverna del doge Loredan), pneumonia.Morto Alberto Ongaro, autore veneziano * Jaakko Pakkasvirta, 83, Finnish movie director (Home for Christmas, Poet and Muse, Sign of the Beast) and screenwriter (The Diary of a Worker).Jussi-gaala -päivän suru-uutinen - ohjaaja-näyttelijä Jaakko Pakkasvirta menehtyi tänään: ”Nerokas taiteilija” * Seán Treacy, 94, Irish politician, TD (1961–1997) and Ceann Comhairle (1987–1997).Former Ceann Comhairle Sean Treacy dies aged 94 ===24=== * José Antonio Abreu, 78, Venezuelan conductor and politician, founder of El Sistema, complications from COPD.Falleció el maestro José Antonio Abreu * Lys Assia, 94, Swiss singer (\"Refrain\"), first winner of the Eurovision Song Contest (1956).Lys Assia ist tot * Rim Banna, 51, Palestinian singer (\"The Mirrors of My Soul\"), composer and activist, breast cancer.Famous Palestinian singer, Reem Banna, dead at 51 * Arnaud Beltrame, 44, French gendarme and hero, stabbed.‘He saved lives’: Arnaud Beltrame, police officer who traded places with a hostage, to be honored by France * Debbie Lee Carrington, 58, American actress and stuntwoman (Return of the Jedi, Total Recall, Bride of Chucky).Actress and Stuntwoman Debbie Lee Carrington Has Passed Away * Bernie De Koven, 76, American video game designer (Alien Garden) and writer, pancreatic cancer.Obituary: Game design pioneer Bernard 'Bernie' DeKoven * John Ehle, 92, American novelist (Last One Home) and screenwriter (The Journey of August King), congestive heart failure.Appalachian novelist John Ehle dies at 92 * Bill Lucas, 101, British Royal Air Force officer and Olympic long-distance runner (1948).Britain's oldest Olympian Bill Lucas dies * Frank Meisler, 89, German-born Israeli architect and sculptor (Kindertransport – The Arrival).Famous Israeli Sculptor Meisler Dies at 89 ===25=== * André Bourbeau, 81, Canadian politician, MNA for Laporte (1981–2003) and Mayor of Saint-Lambert (1978–1981), complications from leukemia.Former Quebec Liberal minister André Bourbeau dies at 81 * Linda Brown, 76, American civil rights figure (Brown v. Board of Education).Linda Brown, woman at center of Brown v. Board case, dies * Mike Harrison, 72, British singer and musician (Spooky Tooth).Mike Harrison Of Spooky Tooth Passed Away *Seo Min-woo, 33, South Korean singer (100%) and actor, cardiac arrest. * Nicolae Tilihoi, 61, Romanian footballer (Universitatea Craiova), esophageal cancer.S-a stins din viaţă Nicolae Tilihoi, fost mare jucător al Craiovei. Marți va fi înmormântat * Jerry Williams, 75, Swedish rock singer (\"It Started with a Love Affair\") and actor (On the Loose), cancer.Rocklegenden Jerry Williams är död ===26=== * Sándor Demján, 74, Hungarian businessman (TriGranit), second richest person in Hungary.Meghalt Demján Sándor * Sergei Mavrodi, 62, Russian financial fraudster and politician, member of State Duma (1994–1995), heart attack.СМИ: умер Сергей Мавроди ===27=== * Stéphane Audran, 85, French actress (The Discreet Charm of the Bourgeoisie, Babette's Feast, The Big Red One).Stéphane Audran Dies: ‘Discreet Charm Of The Bourgeoisie’, ‘Babette’s Feast’ Star Was 85 * Victor Kalashnikov, 75, Russian gun designer (PP-19 Bizon), son of Mikhail Kalashnikov.Оружейник Виктор Калашников скончался в Ижевске * Sir Eric McClintock, 99, Australian businessman and public servant, Chairman of Woolworths Limited (1980–1987).Tributes flow for former Woolworths chairman Sir Eric McClintock ===28=== * Peter Munk, 90, Hungarian-born Canadian businessman (Barrick Gold) and philanthropist, heart failure.Peter Munk, Entrepreneur Who Founded Barrick Gold, Dies at 90 * Eugène Van Roosbroeck, 89, Belgian racing cyclist, Olympic champion (1948).Oudste Belgische goudenmedaillewinnaar overleden ===29=== * Emiliano Mondonico, 71, Italian footballer (Cremonese) and manager (Torino, Atalanta, Cosenza), stomach cancer.Addio a Emiliano Mondonico: fece grandi Toro e Atalanta * Stephen Reinhardt, 87, American judge, Judge of the United States Court of Appeals for the Ninth Circuit (since 1980), heart attack.Stephen Reinhardt, 'liberal lion' of the 9th Circuit, dies at 87 * Rusty Staub, 73, American baseball player (New York Mets, Montreal Expos, Detroit Tigers) and philanthropist, multiple organ failure complicated by pneumonia.Rusty Staub, beloved Mets icon, dead at 73 ===30=== * Anna Chennault, 94, Chinese-born American journalist and lobbyist (China Lobby), wife of Claire Lee Chennault, complications from a stroke.Anna Chennault, secret Nixon envoy, Washington figure of ‘glamour and mystery,’ dies at 94 * André Bo-Boliko Lokonga, 83, Congolese politician, Speaker of the National Assembly (1970–1979) and Prime Minister (1979–1980).L'ancien premier ministre André Bo-Boliko n'est plus * Bill Maynard, 89, English actor (Heartbeat, Confessions of a Window Cleaner, Carry On), complications from a fall.Heartbeat actor Bill Maynard dies after fall * Sven-Olov Sjödelius, 84, Swedish canoer, Olympic champion (1960, 1964), respiratory failure.OS-hjälten från Nyköping har gått ur tiden ===31=== * Margarita Carrera, 88, Guatemalan philosopher, professor and writer.Fallece la escritora guatemalteca y columnista de Prensa Libre Margarita Carrera * Luigi De Filippo, 87, Italian actor (Non è vero... ma ci credo, You're on Your Own, Love Italian Style), Alzheimer's disease.È morto il regista e attore Luigi De Filippo, ultimo erede della storica dinastia * Peg Lautenschlager, 62, American attorney and politician, Attorney General of Wisconsin (2003–2007) and member of the Wisconsin State Assembly (1989–1993), breast and bone cancer.Peg Lautenschlager, first woman to serve as Wisconsin attorney general, dies at 62 * Michael Tree, 84, American violist (Guarneri Quartet), Parkinson's disease.Very sad news | Guarneri String Quartet Violist Michael Tree has Died – Aged 83 ==Months== * January * February * March * April ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *3 Category:March 2018 events",
 "title": "Deaths in March 2018"
}