{
 "id": "623621",
 "text": "2023 (MMXXIII) was a common year starting on Sunday in the Gregorian calendar, the 2023rd year of the Common Era (CE) and Anno Domini (AD) designations, . The year started with the continuation of the Russian invasion of Ukraine which began in early 2022. In January, July and September, Islamist suicide bombers killed a total of over 200 people in Pakistan. In February, an earthquake struck Turkey and Syria, that killed more than 50,000 people, making it one of the deadliest earthquakes of the 21st century. in April, India became the world's most populous country, overtaking China. In September, Storm Daniel killed nearly 7,000 people in Bulgaria, Greece, Libya and Turkey. In September, Azerbaijan launched an offensive which ended the existence of the Republic of Artsakh, causing its Armenian inhabitants to move back to Armenia. Between October to December, over 23,000 Palestinians and 1,300 Israelis were killed during a war between Israel and Hamas. Former King of Greece Constantine II, former President of Pakistan Pervez Musharraf, former Prime Minister of Italy Silvio Berlusconi, musicians Burt Bacharach, Tina Turner and Tony Bennett and footballer Bobby Charlton died. == Events == === January === * January 1 ** Croatia adopts the euro and joins the Schengen Area, becoming the 20th member state of the Eurozone and the 27th member of Schengen. ** Uzbekistan switches from Cyrillic script to Latin script. * January 4 - Mahas bombings in Mahas District, Hiran, Somalia. * January 5 - The funeral of Pope Benedict XVI is held at Saint Peter's Square in the Vatican City. * January 5–13 - Unrest follows the arrest of drug kingpin Ovidio Guzmán López in Sinaloa, Mexico, killing 10 soldiers and 19 cartel members. * January 8 ** A bus crash in Senegal kills 40 people and injures over 100 others. ** COVID-19 pandemic: China reopens its borders to international visitors, marking the end of travel restrictions that began in March 2020. ** Supporters of former Brazilian president Jair Bolsonaro storm the Brazilian National Congress, the Supreme Federal Court and the Presidential Palace of Planalto. * January 10 - Constantine II, the last King of Greece, dies aged 82.Former King of Greece Constantine II dies at 82 * January 10-17 - A winter storm in Afghanistan begins, killing over 120 people.Afghanistan: Freezing weather kills at least 124 people * January 15 - A plane crash in Nepal kills all 72 people onboard. * January 16 - Italian police arrest Matteo Messina Denaro, the head of Sicilian Mafia in Palermo, Sicily. * January 17 - Nguyễn Xuân Phúc resigns as President of Vietnam and is replaced by Võ Thị Ánh Xuân. * January 18 ** A helicopter crash in Kyiv Oblast, Ukraine kills fourteen people, including Interior Minister Denys Monastyrsky. ** Gaston Browne is re-elected Prime Minister of Antigua and Barbuda. * January 19 - Jacinda Ardern announces her resignation as Prime Minister of New Zealand, months before the general election. Three days later, Chris Hipkins is elected as her replacement. * January 20 – Christine Kangaloo is elected as the 7th President of Trinidad and Tobago. * January 21 - In a mass shooting at a Chinese New Year celebration, a gunman kills eleven people in Monterey Park, California, United States.January 22, 2023 Monterey Park mass shooting news Two days later, seven others would be killed in another mass shooting in Half Moon Bay, California.Half Moon Bay: Seven dead in another California mass shooting * January 24 - A green comet makes its closest approach to the Earth.Green comet approaching Earth for first time in 50,000 years * January 27–28 - The second round of the 2023 Czech presidential election is held. Petr Pavel wins the election. * January 30 - An Islamist suicide bomber kills over 80 people in a mosque in Peshawar, Khyber Pakhtunkhwa, Pakistan. === February === * February 3 - A train carrying hazardous materials runs off the tracks in East Palestine, Ohio, United States. Several train cars burned for more than two days, and then emergency crews did a controlled burn of more cars. The fires released hydrogen chloride and phosgene into the atmosphere. * February 4 - The U.S. Government shoots down a Chinese spy balloon in U.S. territorial waters in the Atlantic Ocean off South Carolina. * February 5 - The 2023 Cypriot presidential election is held, with Nikos Christodoulides elected president. * February 6 - An earthquake in southeastern Turkey kills over 45,000 people in Turkey and over 6,000 in Syria. * February 20 - 2023 Daytona 500. * February 21 - President of Russia Vladimir Putin announces that Russia is suspending its participation in New START, a nuclear arms reduction treaty with the US. * February 25 - 2023 Nigerian general election: Bola Tinubu is elected as Nigeria's president, defeating former vice president Atiku Abubakar and Peter Obi. * February 27 - The United Kingdom and the European Union reach an agreement about changes to the Northern Ireland Protocol. * February 28 - A head-on train crash in Tempi, Larissa, Thessaly, Greece, kills at least 57 people. === March === * March 2 - The National Assembly of Vietnam declares Võ Văn Thưởng as the country's new president after receiving 98.38% votes from the Vietnamese parliament. * March 4 - United Nations member states agree on a legal framework for the High Seas Treaty, which aims to protect 30% of the world's oceans by 2030. * March 5 - 2023 Estonian parliamentary election * March 9 - A former Jehovah's Witness kills seven people, a fetus and himself in a mass shooting at a Kingdom Hall in Hamburg, Germany. * March 10 **2023 People's Republic of China presidential election: The National People's Congress unanimously re-elects Xi Jinping as the President of the People's Republic of China to an unprecedented third term. ** Iran and Saudi Arabia agree to resume diplomatic relations which were severed in 2016 at talks meditated by China. ** Silicon Valley Bank, the 16th largest bank in the United States, fails, creating then the largest bank failure since the 2008 financial crisis, affecting companies around the world. * March 17 - The International Criminal Court issues an arrest warrant for Russian president Vladimir Putin. This is the first arrest warrant it has issued against a leader of a permanent member of the United Nations Security Council. * March 19 - Swiss investment bank UBS Group AG agrees to buy Credit Suisse for 3 billion Swiss francs () in an all-stock deal brokered by the government of Switzerland and the Swiss Financial Market Supervisory Authority. * March 20 - The Intergovernmental Panel on Climate Change (IPCC) releases the synthesis report of its Sixth Assessment Report on climate change. * March 26 - 2023 Israeli judicial reform protests: Protests break out across Israel, after Prime Minister Benjamin Netanyahu fires his defence minister who spoke against the government's judicial reform plan. * March 27 ** A trans man shoots dead six people at an elementary school in Nashville, Tennessee, United States. ** Detainees at an immigration detention centre in Ciudad Juárez, Chihuahua, Mexico, set fire to their mattresses, killing 39 people. === April === * April 2 **2023 Bulgarian parliamentary election **2023 Montenegrin presidential election: Jakov Milatović of the Europe Now! movement wins in the second round, becoming the first president not from the DPS party since the introduction of a multi-party system in 1990.Jakov Milatović ubjedljivo pobijedio: Dobio 60,1 odsto glasova, Đukanović 39,9 %, RTCG, 2 April 2023 **2023 Finnish parliamentary election: the centre-right National Coalition led by Petteri Orpo receives the most votes. **2023 Andorran parliamentary election: the ruling Democrats for Andorra led by Prime Minister Xavier Espot win the majority of the seats. **2023 Saint Petersburg bombing: Russian pro-government war correspondent Vladlen Tatarsky is killed by a bombing at a café in Saint Petersburg owned by oligarch Yevgeny Prigozhin. Sixteen others are injured. * April 4 - Finland becomes the 31st member of NATO. * April 10 - Two document leaks from the Pentagon detailing foreign military aid relating to the Russian invasion of Ukraine are leaked onto the Internet. * April 11 - Myanmar civil war: In the village of Pazigyi, at least 165 people are killed by the Myanmar Air Force during the opening celebrations of a People's Defence Force administration office. * April 14 - Jupiter Icy Moons Explorer (JUICE) is launched by the European Space Agency (ESA) to search for life in the Moons of Jupiter. It is expected to reach the moons in 2031. * April 15 ** Nuclear power in Germany ends after the final power plants close. Nuclear was a power source for the country for over 50 years.Handelsblatt.com: „Atomkraft konnte die Versprechungen nie einlösen“ – Deutschland beendet das Kernkraft-Zeitalter (German), April 2023Tagesschau.de: Nukleare Risiken bleiben (German), April 2023 ** Fighting breaks out across Sudan between the Sudanese Armed Forces and the paramilitary Rapid Support Forces. The RSF captures Khartoum International Airport, and the presidential palace in Khartoum. * April 19 - At least 90 people are killed and another 322 injured in a crowd crush during a Ramadan charity event in Sanaa, Yemen. * April 20 ** SpaceX's Starship rocket, the largest and most powerful rocket ever built, is launched during a flight test from a base in Boca Chica, Texas, United States. It explodes four minutes after launch. ** A hybrid solar eclipse is visible from Australia, East Timor, and Indonesia. * April 25 - A mass cult suicide is uncovered in Shakahola forest, Kenya. 110 followers are found in shallow graves throughout the forest. Over 300 people remain missing. It is believed Good News International Ministries leader Paul Nthenge Mackenzie told his followers to starve themselves to death in order to \"meet God\". * April 26 - Chinese leader Xi Jinping calls Ukrainian president Volodymyr Zelenskyy, a month after Xi's summit with Russia's president Vladimir Putin. * April 30 - 2023 Paraguayan general election: the Colorado Party candidate Santiago Peña is elected as the next president. === May === * May 1 - 2023 banking crisis: San Francisco-based First Republic Bank fails and is auctioned off by the US FDIC to JPMorgan Chase for $10.7 billion. The collapse surpasses March's collapse of Silicon Valley Bank to become the second largest in US history. * May 2-17 - Floods hit Emilia-Romagna, Italy. * May 3 - Belgrade school shooting in Serbia. * May 4 - 4 May 2023 Serbia shootings. * May 5 - The World Health Organization announces that COVID-19 is no longer considered a global health emergency. * May 6 - The coronation of Charles III and Camilla as King and Queen of the United Kingdom and the other Commonwealth realms is held in Westminster Abbey, London. * May 9 - Cyclone Mocha in Asia * May 9-13 - The Eurovision Song Contest 2023 is held in Liverpool, UK. * May 13-27 - A parliamentary election happens in Mauritania. * May 24 - Saudi Arabia and Canada restore full diplomatic relations, ending 2018 dispute. === June === * June 2 - A train crash happens in Odisha, India. * June 12 - Kwara boat disaster on the Niger River in Kwara State, Nigeria. * June 13 - 2023 Nottingham attacks in the UK. * June 14 - 2023 Messenia migrant boat disaster off the coast of Greece. * June 16 - Mpondwe school massacre in Uganda. * June 18 - The Titan submersible implodes in the North Atlantic Ocean. * June 20 - Támara prison riot in Francisco Morazán Department, Honduras. * June 25-26 - Severe flooding happens in South Korea. === July === * July 17 - Wildfires begin in Greece, killing 35 people. * July 18 - Voyager 2 overtook Pioneer 10 to become the 2nd farthest spacecraft from the Sun. * July 27 - Kuwait executes five by hanging, including a man convicted for a ISIS mosque bombing in 2015 that had killed 26 people. * July 30 - 2023 Khar bombing in Pakistan. === August === * August 1 - Global warming: The world's oceans reach a new record high temperature of 20.96 °C, exceeding the previous record in 2016. July is also confirmed as having been the hottest month on record for globally averaged surface air temperatures by a considerable margin (0.3 °C). * August 6 - 2023 Hazara Express derailment in Pakistan. * August 8-11 - Wildfires in Hawaii, US, kill over 100 people. * August 15 - A wildfire begins in Tenerife in the Canary Islands of Spain. * August 23 - 2023 Wagner Group plane crash in Russia. * August 30 - The military of Gabon performs a coup, replacing Ali Bongo Ondimba as president. * August 31 - A fire in Johannesburg, South Africa kills 77 people. === September === * September 2 ** India's first solar observation mission: The Indian Space Research Organisation (ISRO) successfully launches Aditya-L1 from Satish Dhawan space centre. ** Eritreans supporting and opposing Isaias Afwerki's government riot in Tel Aviv, Israel. Over 100 people are injured and about 40 arrested.Israel: Police clash with rioting Eritrean rivals * September 4 - Saudi Pro League clubs will now play Champions League matches in Iran as both nations resume home-and-away games. * September 4 - 12 - Storm Daniel * September 8 - 2023 Marrakesh-Safi earthquake: A 6.8 magnitude earthquake strikes western Morocco's Marrakesh-Safi province. Atleast 2946 people killed and more than 5,650 injured. * September 9 - At the 18th G20 summit in New Delhi, India, the African Union is announced as the 21st permanent member of the G20. * September 10 - Storm Daniel: A Mediterranean storm resembling a tropical cyclone struck Libya, causing a significant loss of life, with at least 5,000 people losing their lives. Libyan authorities reported a vast number of people missing, ranging from 10,000 to as many as 100,000. Additionally, in the city of Derna, two dams gave way, leading to the destruction of a quarter of the city. * September 18 - Iran releases five Americans as the United States unfreezes $6 billion of Iran which was blocked in South Korea while also releasing five Iranians in a prisoner exchange deal. * September 23 - 2023 Beledweyne bombing in Somalia * September 24 - OSIRIS-REx returns with samples from the asteroid Bennu. * September 25 - Berkadzor fuel depot explosion in Berkadzor, Nagorno-Karabakh. * September 26 ** Qaraqosh wedding fire: More than 100 people are killed and more than 150 others are injured in a fire at a wedding in Qaraqosh, Nineveh Governorate, Iraq. ** Saudi Arabia to resume flights to Canada as relations between the two countries normalize after 2018 dispute. * September 27 - Iran's Islamic Revolutionary Guard Corps puts 'Noor-3', an imaging satellite, 450 kms into an orbit above the earth. * September 29 ** 2023 Mastung bombing: A suicide bombing takes place killing at least 59 and injuring more than 70 people at a gathering in Mastung District of Balochistan, Pakistan. ** Hangu mosque bombing in Hangu, Khyber Pakhtunkhwa, Pakistan * September 30 - 2023 Slovak parliamentary election. === October === * October 1 - A suicide bombing claimed by the Kurdistan Workers' Party (PKK) was carried out in Ankara, Turkey. * October 2 - An attack by suspected jihadists took place in western Niger near the country's border with Mali, killing at least 29 soldiers. Several terrorists are also killed. * October 3 - Twenty-one people are killed when a bus falls from a bridge (aftermath pictured) in Venice, Italy. * October 4 - 2023 Sikkim flash floods: A glacial lake outburst flood kills at least 22 in Sikkim, India, 102 people including 22 soldiers missing. * October 5 ** 2023 Homs drone strike: A drone strike on a military college in Homs, Syria, during a graduation ceremony killed 67-80 people and injured more than 200 others. The government responded by attacking rebel-controlled areas, particularly Idlib, killing atleast 6. ** Hroza missile attack in Hroza, Kharkiv Oblast, Ukraine. * October 7 ** Hamas invades Israel, killing over 1,100 people. Israel responds by launching Operation Iron Swords, repelling the invasion, killing around 1,000 Palestinian attackers in Israel and, by the end of the year, over 21,800 people in the Gaza Strip. ** 2023 Herat earthquakes in Herat Province, Afghanistan. * October 10 - 2023 Liberian general election * October 14 - 2023 New Zealand general election * October 15 - 2023 Polish parliamentary election * October 17 - An explosion at the Al-Ahli Arab Hospital in Gaza City kills dozens of people. * October 22 - 2023 Swiss federal election: The Swiss People's Party maintained its majority in the National Council. * October 25 - 2023 Lewiston shootings in Lewiston, Maine, United States. * October 29 - A train collision in Andhra Pradesh, India, kills 14 people. === November === * November 3 - 2023 Nepal earthquake * November 6 - Egbekaw massacre in Egbekaw, Mamfe, Manyu, Southwest Region, Cameroon. * November 8 - Ardamata massacre in Ardamata, Geneina, West Darfur, Sudan. * November 19 ** 2023 Cricket World Cup: Australia wins 6th ODI World Cup as it defeats India. ** Houthi involvement in the Israel–Hamas war: Yemeni Islamist insurgent group the Houthis hijack a cargo ship owned by an Israeli businessman. Twenty-five crew members were taken hostage. * November 22 - 2023 Dutch general election === December === * December 10–12 ‐ 2023 Egyptian presidential election * December 16 ‐ Emir of Kuwait Nawaf Al-Ahmad Al-Jaber Al-Sabah dies at the age of 86 and is succeeded by his half-brother Mishal Al-Ahmad Al-Jaber Al-Sabah. * December 17 **2023 Chilean constitutional referendum: Voters in Chile vote to not have a new constitution. **The 2023 Serbian parliamentary election is held with the SNS coalition led by Miloš Vučević winning 128 of 250 seats in the Serbian National Assembly * December 21 ‐ 2023 Prague shooting: A mass shooting kills 16 people in Prague, Czechia. * December 23-25 - 2023 Plateau State massacres * December 31 ‐ Queen Margrethe II of Denmark announced her abdication, which will take place on 14 January. She will be succeeded by her eldest son Prince Frederik. == Deaths == === January === * January 2 – Ken Block, American World Rally driver (b. 1967) * January 3 – Abdelsalam Majali, 29th Prime Minister of Jordan (b. 1925) * January 6 ** Dick Savitt, American tennis player (b. 1927) ** Gianluca Vialli, Italian footballer and manager (b. 1964) * January 9 – K. Alex Müller, Swiss Nobel physicist (b. 1927) * January 10 ** Jeff Beck, English guitarist (b. 1944) ** Constantine II, last King of Greece (b. 1940) ** George Pell, Australian cardinal (b. 1941) *January 12 – Lisa Marie Presley, American singer-songwriter (b. 1968) * January 16 – Gina Lollobrigida, Italian actress (b. 1927)Gina Lollobrigida: Italian screen star dies at 95 . BBC * January 17 – Lucile Randon, French supercentenarian (b. 1904) * January 18 – David Crosby, American musician (b. 1941) * January 23 – Álvaro Colom, 47th President of Guatemala (b. 1951) * January 24 – B. V. Doshi, Indian architect (b. 1927) * January 30 – Bobby Hull, Canadian ice hockey player (b. 1939) === February === * February 3 – Paco Rabanne, Spanish- French fashion designer (b. 1934) * February 4 – Sherif Ismail, 53rd Prime Minister of Egypt (b. 1955) * February 5 – Pervez Musharraf, 10th President of Pakistan (b. 1943) * February 6 – Lubomír Štrougal, 19th Prime Minister of Czechoslovakia (b. 1924) * February 8 ** Burt Bacharach, American composer (b. 1928) ** Ivan Silayev, 12th and final Premier of the Soviet Union (b. 1930) * February 10 ** Hugh Hudson, English film director (b. 1936) ** Carlos Saura, Spanish filmmaker (b. 1932) * February 13 – José María Gil-Robles, 8th President of the European Parliament (b. 1935) * February 14 – Shoichiro Toyoda, Japanese businessman (b. 1925) * February 15 ** Paul Berg, American Nobel biochemist (b. 1926) ** Raquel Welch, American actress (b. 1940) * February 17 – Stella Stevens, American actress (b. 1938) * February 22 – Ahmed Qurei, 2nd Prime Minister of the Palestinian National Authority (b. 1937)Former PA cabinet leader Ahmed Qurei dies at 85 * February 24 – Walter Mirisch, American film producer (b. 1921)Walter Mirisch, Oscar-Winning Producer of ‘In the Heat of the Night,’ Dies at 101 * February 26 – Bob Richards, American pole vaulter and Olympic champion (b. 1926)Bob Richards * February 27 – Gérard Latortue, 12th Prime Minister of Haiti (b. 1934)Gérard Latortue, former interim Haitian premier, dies at 88 === March === * March 1 – Just Fontaine, French footballer (b. 1933)Just Fontaine, légende du football français, est mort * March 2 – Wayne Shorter, American jazz saxophonist (b. 1933)Wayne Shorter, icon of jazz saxophone, dies aged 89 * March 3 ** Tom Sizemore, American actor (b. 1961) ** Kenzaburō Ōe, Japanese Nobel writer (b. 1935) * March 8 – Chaim Topol, Israeli actor (b. 1935)Actor, singer and Israel Prize laureate Chaim Topol dies at 87 * March 9 – Robert Blake, American actor (b. 1933)Robert Blake Dies: Actor In ‘Baretta’ And ‘In Cold Blood’ Was 89, Beat Real-Life Murder Rap * March 11 – Ignacio López Tarso, Mexican actor (b. 1925) * March 17 – Lance Reddick, American actor (b. 1962)Lance Reddick Dies: ‘John Wick’, ‘The Wire’, ‘Fringe’ & ‘Bosch’ Actor Was 60 * March 25 - Pascoal Mocumbi, 2nd Prime Minister of Mozambique (b. 1941) * March 28 – Ryuichi Sakamoto, Japanese composer (b. 1952) Ryuichi Sakamoto, Japanese pop pioneer and Oscar-winning composer, dies aged 71 === April === * April 7 – Ben Ferencz, Last Nuremberg prosecutor (b. 1920) * April 13 – Mary Quant, British fashion designer (b. 1930) * April 22 ** Mudar Badran, 23rd Prime Minister of Jordan (b. 1934) ** Barry Humphries, Australian actor and comedian (b. 1934) * April 25 – Harry Belafonte, American singer, actor, and activist (b. 1927)Harry Belafonte, radical activist and entertainer with a ‘rebel heart,’ dies at 96 * April 29 – Abu al-Hussein al-Husseini al-Qurashi 4th caliph of the Islamic State (b. N/A) Islamic State leader killed in Syria by Turkish intelligence services, Erdogan says * April 30 – Ralph Boston American long jumper and Olympic champion (b. 1939)Tennessee State and Olympic track great Ralph Boston, who set world long jump record, dies at 83 === May === * May 1 – Gordon Lightfoot, Canadian singer-songwriter and guitarist (b. 1938) * May 15 – Robert Lucas Jr., American economist and Nobel laureate (b. 1937)Robert Lucas, R.I.P. * May 19 – Martin Amis, English writer (b. 1949) * May 24 – Tina Turner, American-born Swiss singer, songwriter and actress (b. 1939)Tina Turner dies aged 83 * May 28 – Harald zur Hausen, German virologist and Nobel Prize recipient (b. 1936)Nobel laureate Harald zur Hausen has passed away === June === * June 4 – George Winston, American pianist (b. 1949)Pianist George Winston Dead At 73 * June 5 – Astrud Gilberto, Brazilian samba and bossa nova singer (b. 1940)Astrud Gilberto: The Girl from Ipanema singer dies at 83 * June 10 – Ted Kaczynski, American mathematician and domestic terrorist (b. 1942)Unabomber Ted Kaczynski found dead in prison cell * June 12 ** Silvio Berlusconi, three-time Prime Minister of Italy (b. 1936)Silvio Berlusconi: former Italian prime minister has died at 86 ** Treat Williams, American actor (b. 1951)Treat Williams, Star of 'Everwood' and 'Hair,' Dead at 71 Following Motorcycle Accident * June 15 – Glenda Jackson, English actress (b. 1936)Glenda Jackson: Oscar-winning actress and former MP dies at 87 * June 25 – John B. Goodenough, American materials scientist and Nobel laureate (b. 1922)Goodenough, Nobel laureate who gave the world Li-ion batteries, passes away * June 26 – Sir Lloyd Erskine Sandiford, 4th Prime Minister of Barbados (b. 1937)Former Prime Minister Sir Lloyd passes * June 29 ** Alan Arkin, American actor and filmmaker (b. 1934)Alan Arkin, Oscar-Winning 'Little Miss Sunshine' Actor, Dead at 89 ** Sir Tapley Seaton, 4th Governor-General of Saint Kitts and Nevis (b. 1950)St. Kitts and Nevis mourns as Former Governor- General Sir Samuel Weymouth Tapley Seaton passes away === July === * July 6 – Arnaldo Forlani, Prime Minister of Italy (b. 1925)E’ morto a 97 anni Arnaldo Forlani, pezzo di storia della Dc * July 11 – Milan Kundera, Czech-French novelist (b. 1929)Czech Writer Milan Kundera Dies At 94 * July 20 – Rachid Sfar, Prime Minister of Tunisia (b. 1933)Tunisia: Former Prime Minister Rachid Sfar passes away * July 21 – Tony Bennett, American singer (b. 1926)Tony Bennett, masterful stylist of American musical standards, dies at 96 * July 25 – Bo Goldman American screenwriter (b. 1932)Bo Goldman, Oscar-Winning Writer of ‘One Flew Over the Cuckoo’s Nest’ Script, Dies at 90 * July 26 ** Jean- Jacques Honorat, 3rd Prime Minister of Haiti (b. 1931)L’ancien premier ministre de facto sous le règne des putchistes Jean Jacques Honorat est mort ** Randy Meisner, American musician (b. 1946)Randy Meisner, Founding Eagles Member, Dies at 77 ** Sinéad O'Connor, Irish singer (b. 1966)Sinéad O'Connor obituary * July 30 – Paul Reubens, American actor (b. 1952)Paul Reubens Dies: Pee-Wee Herman Actor Was 70 === August === * August 1 - Henri Konan Bédié, 2nd President of the Ivory Coast (b. 1934)Décès du Président Henri Konan Bédié à la Pisam: La Côte d'Ivoire perd une figure politique * August 4 – Boniface Alexandre, provisional president of Haiti (b. 1936)Décès de Boniface Alexandre, ancien président haïtien par intérim * August 7 – William Friedkin, American film and television director (b. 1935)William Friedkin, ‘The Exorcist’ Director, Dies at 87 * August 23 - Yevgeny Prigozhin, mercenary leader and co-founder of Wagner Group (b. 1961)Wagner chief Prigozhin confirmed dead by Russian authorities after genetic tests === September === * September 4 ** Steve Harwell, American singer (b. 1967)Steve Harwell, Smash Mouth Founding Singer, Dead at 56 ** Ferid Murad, Albanian-American Nobel pharmacologist (b. 1936) * September 13 - Mircea Snegur, 1st President of Moldova (b. 1940)Умер от неизлечимой болезни первый президент Молдавии Мирча Снегур * September 15 - Fernando Botero, Colombian painter and sculptor (b. 1932) * September 22 - Giorgio Napolitano, President of Italy (b. 1925)Giorgio Napolitano è morto: se ne va il primo presidente della Repubblica eletto due volte * September 25 - David McCallum, Scottish actor (b. 1933) * September 27 - Sir Michael Gambon, Irish-English actor (b. 1940)Michael Gambon, veteran actor who played Dumbledore In 'Harry Potter' films, dies at age 82 === October === * October 8 ** László Sólyom, 3rd President of Hungary (b. 1942) ** Burt Young, American actor (b. 1940) * October 13 - Louise Glück, American poet, essayist and Nobel laureate (b. 1943) * October 14 - Piper Laurie, American actress (b. 1932) * October 16 - Martti Ahtisaari, 10th President of Finland (b. 1937) * October 21 ** Bobby Charlton, English footballer (b. 1937) ** Bill Hayden, 21st Governor-General of Australia (b. 1933) * October 24 ** Richard Roundtree, American actor (b. 1942) ** Hans Albert, German philosopher (b. 1921) * October 27 - Li Keqiang, 7th Premier of the People's Republic of China (b. 1955) * October 28 - Matthew Perry, Canadian-American actor (b. 1969) === November === * November 3 - Oleg Protopopov, Soviet-Russian figure skater and Olympic champion (b. 1932) * November 6 - Antoni Martí, 6th Prime Minister of Andorra (b. 1963) * November 7 - Frank Borman, American astronaut (b. 1928) * November 12 - Rahim Huseynov, 3rd Prime Minister of Azerbaijan (b. 1936) * November 18 - Ruud Geels, Dutch football player (b. 1948) * November 19 - Rosalynn Carter, 39th First Lady of the United States (b. 1927) * November 25 - Terry Venables, English soccer player and coach (b. 1943) * November 29 - Henry Kissinger, American political scientist and politician (b. 1923) * November 30 - Shane MacGowan, Irish singer and songwriter (b. 1957) === December === * December 2 - Faustin Twagiramungu, 6th Prime Minister of Rwanda (b. 1945) * December 8 - Ryan O'Neal, American actor (b. 1941) * December 11 ** Paulin Obame-Nguema, 4th Prime Minister of Gabon (b. 1934) ** Andre Braugher, American actor (b. 1962) * December 13 - Antonio Juliano, Italian footballer (b. 1943) * December 16 - Nawaf Al-Ahmad Al-Jaber Al-Sabah, Emir of Kuwait (b. 1937) * December 21 - Robert Solow, American Nobel economist (b. 1924) * December 27 ** Jacques Delors, 8th president of the European Commission (b. 1925) ** Lee Sun-kyun, South Korean actor (b. 1975) ** Gaston Glock, Austrian engineer (b. 1929) * December 29 - Michael Hardie Boys, 17th Governor-General of New Zealand (b. 1931). * December 30 - Tom Wilkinson, English actor (b. 1948) == References ==",
 "title": "2023"
}