{
 "id": "623722",
 "text": "Kaori Ishibashi (, Ishibashi Kaori; born May 6, 1962) is a Japanese confectionary researcher, baking instructor, and author known for her specialty in cheesecakes. She has written 47 baking cookbooks and over 400 cheesecake recipes. == Biography == Kaori Ishibashi was born in Chiba Prefecture, Japan. She raised in Nagano Prefecture where she graduated from Suwafutaba High School. She went on to attend Meiji University of Integrative Medicine. She graduated as a practitioner in acupuncture and moxibustion. After graduating, she worked at Tokyo Jiyugaoka Hospital as a chiropractor and practitioner of moxibustion. == Career == Ishibashi began her confectionary career as a self-taught baker starting off with wholesale business to restaurants and taking request orders for wedding cakes while working as an acupuncturist. Fascinated by the art of baking, she began reading cookbook after cookbook wondering why her finished product never turned out as expected. Unsatisfied with the conventional methods found in the cookbooks she read she decided to learn under confectioner and former house of representatives member Makiko Fujino. After 3 years under the training of Fujino, she received a diploma from Makiko Foods Studio. Thereafter she attended various culinary schools around the world such as Bellouet Conseil in France, the The Culinary Institute of America, Valrhona Chocolate School in France, and received training under various French chefs visiting Japan. == Current Projects == Ishibashi is currently living and working in Nagano, Japan as a confectionary researcher and author. She regularly publishes recipes in various magazines such as “レタスクラブ (retasukurabu), “Ｓａｉｔａ”, “おはよう奥さん” (ohayō okusan), “天然生活” (tennen seikatsu). She is also president of Cake Freak Inc. Ishibashi is currently focusing her efforts on opening her own cheesecake shop in New York City. == Bibliography == Cookbooks Title Year Publisher zettai shippai shinai shifon kēki 1996 雄鶏社 zettai shippai shinai suponji kēki 1996 雄鶏社 型とサイズで選ぶお菓子}< kata to saizu de erabu okashi 1997 雄鶏社 suītohāto kēki 1998 主婦と生活社 zettai shippai shinai pai to taruto 1998 雄鶏社 shinpuru sutairu no chīzu kēki 1988 雄鶏社 chokorēto no chīsana okashi 1998 主婦と生活社 zettai shippai shinai shifon kēki Ⅱ 1999 雄鶏社 wan bōru de dekiru okashi 2000 雄鶏社 nyūyōku sutairu no chīzu kēki 2000 雄鶏社 ishibashi kaori no hinyari dezāto 2001 雄鶏社 shinpuru choko 2002 雄鶏社 puresento shitai! choko no okashi 2003 大泉書店 ishibashi kaori no okashi ressun yaki kashi 2003 雄鶏社 ishibashi kaori no okashi ressun dezāto 2004 雄鶏社 ishibashi kaori no okashi ressun yaki kashi 2004 雄鶏社 shokukan ga kimete! chīzu kēki 2004 サンリオ yottsu no kisetsu no shinpuru chīzu kēki 2004 主婦と生活社 ishibashi kaori no okashi ressun chokorēto 2004 雄鶏社 kudamono no okashi 2005 雄鶏社 tamago no okashi 2005 雄鶏社 kurukuru choko to mizutama shokora 2006 主婦と生活社 chīzu no kēki 2006 ＭＣプレス hottokēkimikkusu de kihon no okashi 2007 レタスクラブ deirīmafon & omekashi kappu kēki 2007 ＭＣプレス oishi chīzu kēki no tsukurikata 2007 雄鶏社 食感が決め手！焼き菓子 shokukan ga kimete! yaki okashi 2008 サンリオ pai to taruto 2008 ＭＣプレス Ｐink！ 2009 アスペクト べイクドチーズケーキ＆レアチーズケーキ beikudo chīzu kēki & rea chīzu kēki 2010 主婦の友社 男子スイーツレシピ danshi suītsu reshipi 2010 主婦の友社 米粉の焼き菓子 komeko no yaki kashi 2010 主婦の友社 シフォンケーキとシフォンロール shifon kēki to shifon rōru 2010 主婦の友社 ハッピーチーズケーキレシピ happī chīzu kēki reshipi 2011 主婦と生活社 ハッピーチーズデザートレシピ happī chīzu dezāto reshipi 2011 主婦と生活社 ハッピーチーズケーキシーズンレシピ春夏編 happī chīzu kēki shīzun reshipi harunatsu hen 2012 主婦と生活社 ハッピーチーズケーキレシピ秋冬編 happī chīzu kēki reshipi akifuyu hen 2012 主婦と生活社 ハッピーチーズケーキハートフルレシピ happī chīzu kēki hātofuru reshipi 2013 主婦と生活社 はじめてのナチュラルスイーツ hajimete no nachuraru suītsu 2013 講談社 ハッピーチーズケーキギフトレシピ happī chīzu kēki gifuto reshipi 2014 主婦と生活社 卵黄・卵白使い切る！シフォンケーキシフォンロール＋１０レシピ 改訂版 ranō ranpaku tsukaikiru! Shifon kēki shifon rōru + 10 reshipi kaiteiban 2014 主婦の友社 ベストオブチーズケーキ besutōbu chīzu kēki 2015 講談社 ブラウニーとガトーショコラ buraunī to gatōshokora 2015 文化出版局 アイス１年中 天然生活ムック aisu ichi nen chū tennen seikatsu mukku 2016 地球丸 チーズのケーキ 改訂版 chīzu no kēki kaiteiban 2016 マイナビ出版 チーズケーキとチョコレートケーキ chīzu kēki to chokorēto kēki 2016 地球丸 米粉のお菓子 komeko no okashi 2017 主婦の友社 Radio Appearances Channel ラジオ東京ＦＭ FM Tokyo radio ＦＭ長野 FM Nagano ＳＢＣラジオ SBC radio TV appearances Program はなまるマーケット hanamaru māketto さんま大先生 sanma daisensei イマジカＴＶ Imajica TV 料理コーナーを担当 lead on ryōri kōnā == References == Category:1962 births Category:People from Chiba Prefecture Category:Living people Category:Japanese academics Category:Food writers",
 "title": "Kaori Ishibashi"
}