{
 "id": "623878",
 "text": "Olive Thomas (October 20, 1894 – September 10, 1920) was an American silent movie actress and model. Her first movie, Madcap Madge, was released in June 1917. Thomas' popularity at movie studios grew with performances in Indiscreet Corrine (1917) and Limousine Life (1918). Oliva R. Duffy was born on October 20, 1894, in Charleroi, Pennsylvania, the eldest of three children, with two younger brothers. Olive or Ollie, as she was known to family and friends, did not have much of a childhood. Life in industrial Pittsburgh was depressing and grim with its smoky factories and hard living. Olive accidentally ingested bi- chloride of mercury from a French-labeled bottle in a darkened bathroom, believing it to be another medication. Found unconscious, she died five days later. The death made worldwide headlines. Olive was only 25 when she died. She was immediately rushed to a hospital. Blinded and unable to talk due to burned vocal chords, it was hard for her to communicate with the French police, who were investigating the incident. In any case, the police left satisfied the event was an accident. Thomas died a day later, with her husband and brother-in-law Owen Moore at her side. She was 25 years old. Olive's final film, Everybody's Sweetheart (1920), was released after her death. Her name lives on, steeped in her scandal, enhanced by fabrications in Hollywood Babylon. Many of her films still reportedly exist (about 12 complete and some in fragments), though they have not as of yet been released on DVD or home video. On September 10, 1920, Thomas died of acute nephritis in Paris five days after consuming mercury bichloride. Although her death was ruled accidental. Thomas' death has been called as one of the first heavily publicized Hollywood scandals. Only daughter in a family of three. Her brothers were Michael James (born February 1893) and William L. (born May 1898). ==References== ==Other websites== * * * * Literature on Olive Thomas Category:1894 births Category:1920 deaths Category:American silent movie actors Category:Actors from Pennsylvania Category:Models from Pennsylvania Category:Accidental deaths in France Category:Drug-related accidental deaths Category:Deaths from nephritis",
 "title": "Olive Thomas"
}