{
 "id": "624224",
 "text": "The German Foundation for International Legal Cooperation (Deutsche Stiftung für Internationale Rechtliche Zusammenarbeit e.V. or IRZ) was set up in 1992 on the initiative of the German Federal Minister of Justice, Dr. Klaus Kinkel, as a registered non-profit association. Its headquarters are in Bonn, with an additional office in Berlin. == Tasks == The IRZ works with institutions involved in legal and judicial reform in almost 30 partner states. This cooperation covers the states of Eastern and Southeast Europe, the MENA region and the South Caucasus, central Asia and Vietnam. Within the framework of providing advice on legislation, the IRZ organises expert discussions, helps with the development of draft legislation and promotes the continued training and education of law professionals from all kinds of disciplines. To this end, seminars, workshops and conferences are organised in the relevant partner states. The main focus here is on national legal reforms and German and European law. Working visits, work placements and job shadowing are also made available in Germany for training and education purposes, allowing a direct, practice-oriented exchange of experiences with German experts. The IRZ also does everything it can to support law students by working with universities, providing supplementary studies, seminars and lectures. The IRZ is supported and assisted by its members and the board of trustees. These include personalities from the worlds of politics, business, management, academia and legal associations and companies. The IRZ can also rely on support from numerous other experienced experts from a wide variety of specialist areas of the law. This means that the IRZ can guarantee specialist expert advice and non-bureaucratic, fast, flexible and coordinated support over the long term for its partner states. == Objectives == Together with its partners, the IRZ develops and consolidates: * Rule-of-law, democratic constitutional structures within the framework of the European approach to human rights * An independent, operational judiciary including all the foundations for procedural law * The private and commercial legal foundations for private law activities and business transactions * The public law framework conditions for corporate activities * The harmonisation of national legal systems with European law * International legal assistance and cooperation in civil and criminal cases * European standards, in particular for protecting human rights in criminal law, criminal procedural law and penitentiary law == Contracting authority == The IRZ is commissioned by the German Federal Government and is therefore primarily financed by the budget of the German Federal Ministry of Justice and Consumer Protection and by project funding from the German Federal Foreign Office. The IRZ also carries out projects as part of the European Union Neighbourhood Policy and Enlargement Negotiations. == Other websites == * IRZ * BMJV feiert 25 Jahre IRZ vom 17. Mai 2017 * IRZ Projekt in Tunesien im Kampagnenfilm 2016 des Auswärtigen Amts für die Kandidatur der BRD für einen Sitz im Sicherheitsrat der Vereinten Nationen * Missionare in Rechtsfragen In: General-Anzeiger Bonn Bonn vom 3. September 2013 * Susanne Klaiber: „Fettnäpfchen tunlichst vermeiden“ In: Focus online vom 25. Mai 2011 * Juristische Entwicklungshelfer In: Süddeutsche Zeitung, 11. Mai 2011 Category:1992 establishments in Germany Category:Companies of Germany",
 "title": "IRZ-Stiftung"
}