{
 "id": "62434",
 "text": "The , in the past known as , is part of the Japanese football club system. J1 League is the top grouping of the . It is one of the three major titles in Japan, along with J. League Cup and Emperor's Cup. The second tier is represented by the J2 League. ==Champions== Season Champions Runner-up Third place 1993 Verdy Kawasaki Kashima Antlers Shimizu S-Pulse 1994 Verdy Kawasaki Sanfrecce Hiroshima Kashima Antlers 1995 Yokohama Marinos Verdy Kawasaki Nagoya Grampus 1996 Kashima Antlers Nagoya Grampus Yokohama Flügels 1997 Júbilo Iwata Kashima Antlers Yokohama Marinos 1998 Kashima Antlers Júbilo Iwata Shimizu S-Pulse 1999 Júbilo Iwata Shimizu S-Pulse Kashiwa Reysol 2000 Kashima Antlers Yokohama F. Marinos Kashiwa Reysol 2001 Kashima Antlers Júbilo Iwata JEF United Ichihara 2002 Júbilo Iwata Yokohama F. Marinos Gamba Osaka 2003 Yokohama F. Marinos Júbilo Iwata JEF United Ichihara 2004 Yokohama F. Marinos Urawa Red Diamonds Gamba Osaka 2005 Gamba Osaka Urawa Red Diamonds Kashima Antlers 2006 Urawa Red Diamonds Kawasaki Frontale Gamba Osaka 2007 Kashima Antlers Urawa Red Diamonds Gamba Osaka 2008 Kashima Antlers Kawasaki Frontale Nagoya Grampus 2009 Kashima Antlers Kawasaki Frontale Gamba Osaka 2010 Nagoya Grampus Gamba Osaka Cerezo Osaka 2011 Kashiwa Reysol Nagoya Grampus Gamba Osaka 2012 Sanfrecce Hiroshima Vegalta Sendai Urawa Red Diamonds 2013 Sanfrecce Hiroshima Yokohama F. Marinos Kawasaki Frontale 2014 Gamba Osaka Urawa Red Diamonds Kashima Antlers ===Split-season era (2015–present)=== Season First stage Second stage Champions 2015 Urawa Red Diamonds Sanfrecce Hiroshima Sanfrecce Hiroshima ==League Format== As of the 2015 season, and continuing through at least the 2019 season, the league uses a multi-stage format. The regular season is split into two stages. In each stage, each team plays one match against every other team. As in almost all association football leagues worldwide, teams receive 3 points in the standings for a win, 1 point for a draw, and none for a loss, and teams are ranked by points earned. After the second stage of the regular season, an overall table is calculated. The champions of each stage of the regular season, plus any team finishing in the top three of the overall table, advance to a championship playoff. The team that finishes on top of the overall table receives a place in the championship final, while the other teams play off for the other spot in the final. ==Related pages== * Sports in Japan * J2 League * Japan Football League * Japanese Regional Leagues ==References== ==Other websites== * J-League at NHK.or.jp Category:1993 establishments in Japan Category:Football leagues in Japan",
 "title": "J1 League"
}