{
 "id": "62438",
 "text": "Roe is the ripe eggs of fish and certain marine animals, for example sea urchins, shrimp and scallop. It is a type of seafood. Roe is used in many different foods. It can be used cooked or raw. Caviar is a name for sturgeon roe which is eaten as a delicacy. Soft roe or white roe is not roe. It is the seminal fluid of fish. ==Around the world== ===Asia=== ====Japan==== Many different types of roe are used in Japanese cuisine. The following are used raw in sushi: * Ikura () - Salmon roe. Large reddish-orange eggs. Salmon eggs are also used as bait when fishing. People who fish may find this strange when served Ikura for the first time. * Kazunoko () - Herring roe, yellow or pinkish. It has a firm, rubbery texture and look. It is usually pickled. The roe is in a single mass. This makes it look like a piece of fish. * Mentaiko () - Alaska pollock roe which is spiced with powdered red pepper. Mentaiko is usually pink to dark red. * Tarako (たらこ) - Salted Alaska pollock roe. It is sometimes grilled. * Tobiko () - Flying fish roe. It is very crunchy and reddish orange in color. * Uni (うに, ) - Sea urchin roe is soft. Color ranges from orange to light yellow. Humans eat the roe either raw or briefly cooked. Sea urchin roe is a popular food in Korean cuisine. It is called \"uni\" in Japanese sushi cuisine. It is also a food in Chile, called an \"erizo\". *Karasumi (カラスミ, ) - It is mainly found in Nagasaki. Along with salt-pickled sea urchin roe and Konowata, it is one of the three chinmi of Japan . It is made by removing the salt from salt pickled mullet roe and drying it by the sunlight. ====India (Kerala and West Bengal) and Bangladesh==== Roe from the Hilsa fish is a delicacy in West Bengal and Bangladesh. The roe is usually deep-fried. Other ways of cooking it such as mashed roe where the roe crushed along with oil, onion & pepper, or curry of roe could also be found. In the state of Kerala, roe is deep fried in coconut oil and is a delicacy. Among the tribal populace, deeply-roasted roe in open fire (much like marshmallows) is a delicacy. In this region, the roe of rohu is also delicacy. It is eaten fried or put inside a fried pointed gourd to make potoler dolma. ====Iran==== In the Caspian provinces of Gilan and Mazandaran, several types of roe are used. Called Ashpal or Ashbal, roe can be eaten grilled, cured, salted, or mixed with other things. If salted or cured, it is eaten as a condiment. If used fresh, it is usually grilled, steamed, or mixed with eggs and fried to make a custard-like dish called \"Ashpal Kuku\". Roe from Kutum (also known as Caspian White Fish or Rutilus Frisii Kutum), Roach (called \"Kuli\" in Gileki), Bream (called \"Kulmeh\" in Gileki), and Caspian Salmon are liked very much. Roe from Carp is less common and Barbel roe is also used at times. ===Europe=== ====Denmark==== Lumpfish (stenbider) roe is used in Danish cuisine. It is served on top of halved or sliced hard-boiled eggs, on top of piles of shrimp, or with other fish or seafood. Another commonly eaten roe is that from the cod (torsk). ====Greece==== Tarama is carp roe used to make taramosalata. Taramosolata is a Greek and Turkish food that is made of tarama mixed with lemon juice, bread crumbs, onions, and olive oil. Other food is dipped into it and eaten. ====Italy==== Bottarga is the salted and dried roe pouch of Gray Mullet. It is used as a topping and with pasta. ====Sweden==== Smoked and salted cod roe paste is very popular in Sweden. The most famous brand is Kalles Kaviar. The paste is commonly served as sandwich topping. ====United Kingdom==== Roe eaten in the United Kingdom is usually soft roe instead of hard roe. Herring roe is sold in many British supermarkets but it is not very popular. Battered cod roe can also be bought within many fish and chip shops, mainly around the London area. Category:Seafood",
 "title": "Roe"
}