{
 "id": "624763",
 "text": "Nathaniel Fillmore Jr. (April 19, 1771 - March 28, 1863) was an American farmer and the father of Millard Fillmore, the 13th President of the United States. == Biography == Nathaniel Fillmore Jr. was born on April 19, 1771 in Bennington, Bennington County, Vermont, the son of Nathaniel Fillmore Sr. (1739–1814), a native and soldier during the American Revolution, and his wife, Hepzibah Wood (1747–1783). Nathaniel Fillmore Sr. was the son of John Fillmore Jr. (1702–1777), a ship's captain, who was the son of John Fillmore Sr. (1676–1712), a native and mariner. == Career == After his marriage, Fillmore began farming in Vermont. Shortly thereafter, Nathaniel and his brother Calvin Fillmore were approached by land agents offering tracts in New York state. Unhappy with trying to make the stony ground of their Vermont land productive, they quickly grabbed the opportunity and moved to western New York, sight unseen. According to biographers of Millard Fillmore, \"The Fillmore brothers moved their two families to their new homeland nestled deep within a timber-laden forest. Location was not their greatest problem. Nor was the dense clay they unearthed once the land was cleared. Their greatest setback came with the realization that faulty surveying coupled with corrupt local government officials had left them with virtually nothing. Duped, tired, and poor, Nathaniel eventually became a tenant farmer while occasionally teaching school, working the soil for landlords and taking their charity when necessary to survive. Over time, Nathaniel Fillmore's fortunes changed; he became prominent enough while living in Niles, New York that he served as a justice of the peace for eleven years. He eventually purchased a farm in East Aurora, New York which he developed into a productive enterprise. He died there in 1863, and was buried at East Aurora Cemetery. Historians have credited his wife, Phoebe, for convincing her husband to secure a clerk’s position for Millard in the office of their landlord, Judge Walter Wood. Though Fillmore did not complete the clerkship, it did set him on the path to a successful legal and political career that carried him to the presidency. After Millard assumed the presidency in 1850, Nathaniel visited him the following year, Robert J. Scarry writing that the visit was the one most anticipated by President Fillmore. == Personal life == In 1796, the 25 year- old Fillmore married Phoebe Millard, daughter of a prominent physician, in Bennington. Together, they had nine children: * Olive Fillmore (1797–1883) * Millard Fillmore (1800–1874) * Cyrus Fillmore (1801–1889) * Almon Fillmore (1806–1830) * Calvin Fillmore (1810–1879) * Julia Fillmore (1812–1891) * Darius Fillmore (1814–1837) * Charles Fillmore (1817–1854) * Phoebe Fillmore (1819–1843) After Phoebe died in 1831, he remarried to Eunice Love in 1834. === Distinction === He was the first of only four fathers (the other three being George Tryon Harding, Joseph P. Kennedy, Sr., and George H. W. Bush) to live through the entire presidency of a son. ==Related pages== * Millard Fillmore Category:1771 births Category:1836 deaths Category:People from Vermont",
 "title": "Nathaniel Fillmore"
}