{
 "id": "624890",
 "text": "Elizabeth Lydia \"Eliza\" Manningham-Buller, Baroness Manningham-Buller LG DCB (born 14 July 1948) is one of the most senior women in British public life. She was Director General of MI5, the British internal Security Service, from October 2002 until her retirement on 20 April 2007, aged 58. She became a crossbench life peer on 18 April 2008. She is now chair of the Wellcome Trust, the largest private financer of medical research in the UK. == Early years == Her father, Reginald Manningham-Buller, was Lord Chancellor from 1954 to 1962. Ms Manninham-Buller was educated at Northampton High School, Beneden School and Lady Margaret Hall, Oxford. She was recruited into the Security Service in her 20s. == Career in MI5 == Specializing in counter-terrorism rather than MI5's usual counter-espionage, she was active at the time of the Lockerbie bombing by Libya in 1988. She worked for K-branch against the IRA. During the early 1980s she was said to be one of only five people who knew that Oleg Gordievsky, the deputy head of the KGB at the Soviet Embassy in London, was actually a double agent. She was sent to Washington, D.C. as liaison to the US intelligence community over the first Gulf War. Then she led the newly created MI5 Irish counter-terrorism section from 1992. She was promoted to the Management Board of the Security Service the next year. Manningham-Buller became the director in charge of surveillance and technical operations. She was appointed Deputy Director General in 1997, and succeeded Sir Stephen Lander as Director General in 2002. She was the second woman to take on the role after Dame Stella Rimington. As Director General, she was paid £150,000 a year. She established a website and recruited agents through newspaper advertisements. Under her direction, terror risk assessments were made public for the first time. In the 2005 Birthday Honours, Manningham-Buller was appointed to the Order of the Bath as a Dame Commander (DCB).London Gazette |issue=57665 |date=11 June 2005 |page=2 |supp=y She resigned from MI5 on 21 April 2007, and was succeeded by her deputy, Jonathan Evans. That month marked the end of her 33rd year in the Security Service. She was raised to the peerage as Baroness Manningham-Buller, of Northampton in the County of Northamptonshire on 2 June 2008.London Gazette |issue=58719 |date=5 June 2008 |page=8441 == BBC Reith Lectures == In June 2011, the BBC announced Eliza Manningham-Buller would present the 2011 Reith Lectures, alongside the Burmese pro-democracy leader Aung San Suu Kyi in a series entitled Securing Freedom. Eliza Manningham-Buller's lectures broadcast on BBC Radio 4 and the BBC world service in September 2011, marked the ten-year anniversary of the September 11 attacks on the United States. In her first lecture, titled \"Terror\", recorded at BBC Broadcasting House in London, she reflected on the lasting significance of 11 September 2001, asking was it a terrorist crime, an act of war, or something different. She also examined the impact the US-led invasion of Iraq had on the fight against al-Qaeda. In her second lecture, titled \"Security\", recorded at the Leeds City Museum, she said that the use of torture is \"wrong and never justified\" and should be \"utterly rejected even when it may offer the prospect of saving lives\". She said that the use of torture had not made the world a safer place, adding that the use of water-boarding by the United States was a \"profound mistake\" and as a result America lost its \"moral authority\". In her third and final lecture, titled \"Freedom\", recorded at the British Library in London, she discussed foreign policy priorities since the September 11 attacks. She stated that it was \"necessary\" to talk to dictators and terrorists, to protect security and said that the British government's decision to engage with Colonel Gaddafi in 2003 was \"the right decision\". She went on to say that protecting British citizens would be impossible if the security services were restricted to talking only to those with shared values and cited examples where people once deemed terrorists were now part of the political establishment: \"Look at Northern Ireland, where former terrorists are in government... look at Mandela and the ANC which used terror tactics when it was in exile.\" == References == Category:1948 births Category:Living people Category:British intelligence people Category:Directors of intelligence agencies Category:Knights of the Garter Category:Order of the Bath Category:People from Northampton",
 "title": "Eliza Manningham-Buller"
}