{
 "id": "624956",
 "text": "The Fremantle Football Club, nicknamed the Dockers, is an Australian Rules Football team in the Australian Football League (AFL) based in Fremantle, Western Australia. The club was formed in 1994 to represent Fremantle in the AFL. They played their first game on 1 April 1995. The club also has a women's team in the AFL Women's league. Their colours are purple and white. When they first played, they wore red, green, purple and white jumpers, but changed to just purple and white in 2011. Fremantle's captain is Nathan Fyfe and their coach is Ross Lyon. Matthew Pavlich holds the record for most games played and most goals kicked by a Fremantle player. Peter Bell is the only former Fremantle player who is in the Australian Football Hall of Fame. The women's team is captained by Kara Donnellan and coached by Michelle Cowan. Fremantle started playing their home games at the Perth Stadium in 2018. Before that, they played at Subiaco Oval. The women's team plays most of their home games at Fremantle Oval, but has also played at Perth Stadium, Subiaco Oval and Ruston Park in Mandurah. Their game at Perth Stadium in 2018 set a record for the biggest ever crowd at a women's Australian football match. The Dockers have not yet won an AFL championship, which is known as the premiership. In 2013, they made the Grand Final for the first time, but lost the game to Hawthorn. ==Club song== Freo, heave ho! Freo, heave ho! Give em all the old Freo, heave ho! [Chorus:] Freo, way to go Hit 'em real hard, send 'em down below Oh Freo, give 'em the old heave-ho We are the Freo Dockers. We're the rollers, we're the rockers, We're the mighty Freo Dockers. We're gonna roll 'em and we'll rock 'em, We're gonna send 'em to the bottom And if they get up, we'll do it again. The Dockers stop at nothing, nothing! [Chorus] Doc-Doc- Dockers Show 'em how we rock Freo, heave ho! Doc-Doc-Dockers Show 'em how we roll Go Dockers, go, go, go! ==References== ==Other websites== * Fremantle Football Club website Category:Australian rules football clubs in Australia Category:Fremantle",
 "title": "Fremantle Football Club"
}