{
 "id": "624983",
 "text": "Edgar Chagwa Lungu (born 11 November 1956) was the 6th President of Zambia from 2015 until 2021. He is a former Minister of Justice, Minister of Defence and Minister of Home Affairs. Following President Michael Sata's death in October 2014, Lungu was chosen as the candidate for the Patriotic Front for the January 2015 presidential by-election, which was to determine who would serve out the remainder of Sata's term. In the election, he narrowly defeated his opposition Hakainde Hichilema and took office on 25 January 2015. Lungu was elected to a full presidential term in the August 2016 election. Lungu was sworn in for his first full term on 13 September 2016. He lost his re-election bid in 2021, losing to businessman Hakainde Hichilema. ==Early life and career== Lungu was born 11 November 1956 at Ndola Central Hospital. After graduating with a law degree in 1981 from the University of Zambia, he joined the law firm Andre Masiye and Company in Lusaka. He subsequently underwent military officer training at Miltez in Kabwe under Zambia National Service (ZNS). He then returned to practising law. He then joined politics. In 2010, Edgar Lungu had his law practicing licence suspended by the Law Association of Zambia. This was after he was found guilty of professional misconduct. ==Political career== He joined the United Party for National Development(UPND) under Anderson Mazoka, but later switched to the Patriotic Front (PF) which was led by party founder Michael Sata. After the PF won the 2011 election, Lungu became Junior Minister in the Vice-President's office. He was subsequently promoted to Minister of Home Affairs on 9 July 2012. He became Minister of Defence on 24 December 2013 after Geoffrey Bwalya Mwamba resigned from his ministerial post, and he functioned as Acting President during President Sata's long term illness in 2013–14. When President Sata went abroad for medical treatment on 19 October 2014, Lungu was left in charge of the country in his absence.\"Zambian President Michael Sata goes for medical check- up\", BBC News, 20 October 2014.\"Party rivalries grow as Sata ails\", Africa Confidential, volume 55, number 21, 24 October 2014. When Sata died on 28 October 2014, Vice-President Guy Scott took over as Acting President, and Lungu was seen as one of the main contenders to ultimately succeed Sata in a presidential by-election. On 3 November 2014, Acting President Scott dismissed Lungu as Secretary-General of the PF.Scott drops Edgar Lungu as PF Secretary General (article apparently moved), Lusaka Times, 3 November 2014. He replaced him with Davis Mwila, the Member of Parliament for Chipili. However, the next day, on 4 November 2014, Scott announced Lungu was to remain as Secretary- General after Mwila declined to take up his appointment.\"Guy Scott reinstates Edgar Lungu as Secretary General until the burial\", Lusaka Times, 4 November 2014. On 30 November 2014, Lungu was elected as President of the Patriotic Front at a national convention of the party held in Kabwe, Zambia. However the convention was unusual because no voting took place. Instead, the unaccredited delegates elected him by raising hands. On 20 January 2015 Lungu contested the presidential by-election and beat his closest rival Hakainde Hichilema of the United Party for National Development. \"The official results of the 2015 Presidential Election, as released by the ECZ\" He was declared the winner by the Electoral Commission of Zambia on 24 January. He lost his re-election in August 2021 to businessman Hakainde Hichilema, however he does not want to say he lost the election calling it a fraud. ==Personal life== Lungu is married to Esther Lungu and has six children. Lungu and his family are practicing Baptists. ==References== ==Other websites== * Category:1956 births Category:Living people Category:Presidents of Zambia Category:Zambian lawyers",
 "title": "Edgar Lungu"
}