{
 "id": "624914",
 "text": "The Cheetah is a fictional character, created by William Moulton Marston. She appears in DC Comics publications and related media, commonly as a major villain to the superhero Wonder Woman. In 2009, The Cheetah was ranked as IGN's 69th Greatest Comic Book Villain of All Time.Cheetah is number 69, IGN. Cheetah has superhuman speed, reaction time, strength and durability to an unknown degree. Her sense of smell has also been enhanced and she is able to see in the dark. There have been four incarnations of the Cheetah: Priscilla Rich (Golden and Silver Age), Deborah Domaine (Bronze Age), Dr. Barbara Ann Minerva (Post-Crisis and current), and Sebastian Ballesteros (a male usurper who briefly assumed the role in 2001). == Publication history == She was created by William Moulton Marston and H. G. Peter, debuting in the autumn of 1943 in Wonder Woman #6. == Fictional character biographies == === Priscilla Rich === The Golden Age Cheetah was socialite Priscilla Rich. Jealous of Wonder Woman's fame, Priscilla was driven to villainy by her second personality, the Cheetah. Donning a cheetah costume, Priscilla became Wonder Woman's arch nemesis, until her retirement and eventual death. As of the New 52 onwards Pricclia was reconned to be just an alias for Barbara. === Deborah \"Debbi\" Domaine === The niece of the Golden Age Cheetah, Deborah was a friend of Wonder Woman, until the villainous Kobra brainwashed her into picking up her aunt's evil legacy. This version no longer exists due to the Crisis on Infinite Earths. In the New 52 onwards Deborah is just an alias for Barbara. === Barbara Ann Minerva === Much like her Golden Age predecessor, Dr. Barbara Ann Minerva was driven by envy to become a villain. A selfish, spoiled heiress, Minerva received her Cheetah powers and form from the sacrifice of her partner to an African plant god. However, because the ceremony is meant for virgins her powers are half curse, half blessing. Minerva decided to challenge Wonder Woman's powers upon hearing of her arrival to Man's World in order to steal her magic lasso. Since then, the Cheetah has proven to be one of Wonder Woman's greatest enemies, as well as one of her primary arch enemies and has shown that women can be just as bad as men. In the Justice League, she is one of the recurring enemies in both the original series and its sequel series. Press materials names her \"A feline femme fatale who is scratching for a fight.\" In the New 52 she grew up in an orphanage in Idaho and had alias of Priscilla ,Deborah, and Sebastian she would soon become Cheetah and oppose Wonder Woman The Dc Rebirth version is more sympathetic and was good friends with Wonder Woman until she became Cheetah. === Sebastian Ballesteros === A native to Argentina, corrupt businessman Sebastian Ballesteros was briefly the fourth Cheetah after stealing Minerva's powers, but was killed by her out of revenge. New 52 retcons him as just an alias for Barbara. ==== Amazon ==== The fifth cheetah was a former amazon who died but was revived by Belladona to become the fifth cheetah to kill wonder woman but failed and died to her instead. == Powers and abilities == The Barbara Ann Minerva and Sebastian Ballesteros incarnations of the Cheetah exhibit similar abilities. Their basic attributes consist of enhanced strength and speed on par with Wonder Woman, as well as heightened senses of smell and hearing for hunts and night vision for stealth. Their reflexes and agility are similarly augmented, allowing them superior gymnastic abilities for inhuman mobility. These superhuman traits allow them to challenge Wonder Woman in physical battles. Additionally, their fangs and claws are preternaturally sharp and strong. While the two more modern incarnations of the Cheetah possess superhuman powers, the earlier versions of Priscilla Rich and Deborah Domaine do not. Originally only able to change during a full moon and remaining weak and frail in her human body, Barbara Ann Minerva was chemically enhanced by the sorceress Circe to remain in her Cheetah body indefinitely and change at will. This also gave her dominion over all species of felines. In The New 52 continuity, Barbara Ann Minerva is shown to pierce Superman's invulnerable skin with her fangs just as easily as if he were human. Additionally, her bite transfers some of her powers into her victims, turning them into bestial human-feline hybrids under her control. == In other media == The character has been adapted to different forms of media, including action figures, television series, and video games. In live-action, the Barbara Ann Minerva version of Cheetah is portrayed by actress Kristen Wiig in the DC Extended Universe (DCEU) movie Wonder Woman 1984 (2020). ==References== Category:DC Comics characters Category:Wonder Woman",
 "title": "Cheetah (character)"
}