{
 "id": "625068",
 "text": "Windows Server 2016 is a server operating system developed by Microsoft as part of the Windows NT family of operating systems, developed concurrently with Windows 10. The first early preview version (Technical Preview) became available on October 1, 2014 together with the first technical preview of System Center. Windows Server 2016 was released on September 26, 2016 at Microsoft's Ignite conference and became generally available on October 12, 2016. It has two successors: Windows Server 2019, and the Windows Server Semi- Annual Channel, which excludes the graphical user interface and many older components. ==Development== Microsoft has been reorganized by Satya Nadella, putting the Server and System Center teams together. Previously, the Server team was more closely aligned with the Windows client team. The Azure team is also working closely with the Server team. In March 2017, Microsoft demonstrated an internal version of Server 2016 running on the ARMv8-A architecture. It was reported that Microsoft was working with Qualcomm Centriq and Cavium ThunderX2 chips. According to James Vincent of The Verge, this decision endangers Intel's dominance of the server CPU market. However, later inquiry from Microsoft revealed that this version of Windows Server is only for internal use and only impacts subscribers of Microsoft Azure service. ===Preview releases=== A public beta version of Windows Server 2016 (then still called vNext) branded as \"Windows Server Technical Preview\" was released on October 1, 2014; the technical preview builds are aimed toward enterprise users. The first Technical Preview was first set to expire on April 15, 2015 but Microsoft later released a tool to extend the expiry date, to last until the second tech preview of the OS in May 2015.Neowin: Second tech preview of Windows Server 2016 coming next month The second beta version, \"Technical Preview 2\", was released on May 4, 2015. Third preview version, \"Technical Preview 3\" was released on August 19, 2015. \"Technical Preview 4\" was released on November 19, 2015. \"Technical Preview 5\" was released on April 27, 2016. Windows Server 2016 Insider Preview Build 16237 was released to Windows Insiders on July 13, 2017.RedmondMag: Windows Server 'Insider' Testing Program Coming This Summer ===Public release=== Windows Server 2016 was officially released at Microsoft's Ignite Conference on September 26, 2016. Unlike its predecessor, Windows Server 2016 is licensed by the number of CPU cores rather than number of CPU sockets—a change that has similarly been adopted by BizTalk Server 2013 and SQL Server 2014. The new licensing structure that has been adopted by Windows Server 2016 has also moved away from the Windows Server 2012/2012R2 CPU socket licensing model in that now the amount of cores covered under one license is limited. Windows Server 2016 Standard and Datacenter core licensing now covers a minimum of 8 core licenses for each physical processor and a minimum of 16 core licenses for each server. Core licenses are sold in packs of two with Standard Edition providing the familiar rights to run 2 virtualized OS environments. If the server goes over 16 core licenses for a 2 processor server additional licenses will now be required with Windows Server 2016. ==Version 1709== Windows Server, version 1709 was released on October 17, 2017. The release has dropped the Windows Server 2016 name and is just called Windows Server by Microsoft.Windows Server, version 1709 available for download It is offered to the Microsoft Software Assurance customers who have an active Windows Server 2016 license and has the same system requirements. This is the first Windows Server product to fall under the \"Semi-Annual Channel\" (SAC) release cadence. This product only features the Server Core and the Nano Server modes. Of the two, only the Server Core mode of the OS can be installed on a bare system. The Nano Server mode is only available as an operating system container. ==References== Category:Microsoft operating systems Category:Windows Server",
 "title": "Windows Server 2016"
}