{
 "id": "625081",
 "text": "Alpine skiing at the 2018 Winter Paralympics had 5 types of races. These included downhill, Super-G, Super Combined, slalom and giant slalom. == Schedule == Skiers had training runs for the downhill race on 7 March. Their practice runs in the downhill on 8 and 9 March were cancelled. The first event on the para-alpine program is the downhill. It starts on 10 March, running from 9:30 AM to 1:30 PM. The second event on the program is Super-G. All skiers will race between 9:30 AM and 1:00 PM on 11 March. The super combined takes place on 13 March. The Super-G part of the event is in the morning. The slalom part is in the afternoon. The slalom event gets underway on 14 March and conclude on 15 March. Women and men both race during the same sessions in the morning. The afternoon sessions start with the women doing their second run. Then the men go.The last para-alpine skiing race of the 2018 Games is the giant slalom. It takes place on 17 - 18 March. Men and women both race at the same time in the morning sessions. Women race first in the afternoon sessions, with the men racing a half hour after they end. == Results == === Downhill === Henrieta Farkasova, guided by Nataly Subrtova, won the first gold medal at the Winter Paralympics. Farkasova won gold in women's downhill vision impaired race. B2 classified skier Millie Knight won silver. Belgian B2 classified skier Eleonor Sana won bronze. Marie Bochet from France won gold in the women's downhill standing. Andrea Rothfuss from Germany won silver. Mollie Jepsen from Canada won bronze. Mac Marcoux won gold in the men's visually impaired downhill race. Jakub Krako of Slovakia won silver. Giacomo Bertagnolli of Italy won bronze. Theo Gmur won a gold medal in the men's downhill standing race. Arthur Bauchet of France won silver. Markus Salcher of Austria won bronze. == References == Category:Sports at the 2018 Winter Paralympics 2018 Winter Para",
 "title": "Alpine skiing at the 2018 Winter Paralympics"
}