{
 "id": "625248",
 "text": "Kumkum Bhagya (Trans., Vermillion is my fate) is a Hindi language Indian television soap opera. Which is premiered on 15th April 2014. and is broadcast weeknights on Zee TV. The show stars Sriti Jha as Pragya Raguveer Arora aka Pragya Prem Mehra, Shabir Aluvalia as Abhishek Prem Mehra aka Abhi, Mugdha Chapekar as Prachi Arora aka Prachi Prem Mehra, Pooja Banerjee as Rhea Prem Mehra and Krishna Kaul as Ranbir Kohli. A spin off story, named Kundali Bhagya (Trans., The Horoscopic Fate), is also produced and telecasted in Zee TV, which focuses on the story of Pragya's long lost sisters Preeta and Shristi and her mother Sarala Arora. Kumkum bhagya announced that it will end 29 January 2023 ==Plot== The series started as the stories of Pragya And Bulbul, and their mother Sarla's hope to see them married, but as the time went by, the series revolved around Abhi And Pragya. 20 years later Pragya is settled in Hoshiarpur with her daughter Prachi, Beeji and Beeji’s grand-daughter, Shahana who lives with Pragya and Prachi and affectionately calls Pragya as Maasi. Abhi is settled with his daughter Rhea who is taken care by a governess, Meera and has also shifted his house. The Mehras are now neighbors with the Kohlis, Vikram Kohli, who is Abhi’s business partner and friend, his wife Pallavi, their two children Ranbir, Mishti and Daljeet, Vikram’s mother. Purab has now divorced Disha and married Alia. They have a son together named Aryan. Prachi gets a scholarship to study in the same college where Rhea studies in Delhi. Pragya though initially reluctant, however decides to send Prachi considering her future. In Delhi, Prachi and Abhi meet several times and develop a close bond with each other. While, the twins start their relationship on a bad note and Rhea starts hating Prachi. She constantly plots against Prachi and lands her in trouble several times. One such incidents makes Pragya return to Delhi to save her daughter. Pragya, Prachi and Shahana, start staying in Sarita behen’s house who lovingly calls Pragya as Anuradha (her daughter’s name). This leads to a lot of confusion since everyone from Abhi’s side calls Pragya as Anuradha (making Abhi also think that Prachi’s mother’s name is Anuradha), while Pragya never realizes who Abhi is as everyone calls him Mr. Mehra. ==Cast== === Season 1=== ==== Mehra family==== * Sriti Jha as Pragya Abhishek Mehra (Dead) * Shabir Ahluwalia as Abhishek Mehra aka Abhi (Dead) * Kaurwaki Vasistha as Kiara Mehra (Dead) * Daljeet Soundh as Daljeet Kaur Mehra (Dead) * Shivaani Sopuri as Parminder \"Pammi\" Kaur Mehra * Ajay Trehan as Ajay Mehra * Ankit Mohan as Akash Mehra * Aditi Rathod as Rachna Mehra * Unknown as Bittu Akash Mehra * Anurag Sharma as Raj Mehra * Swati Anand as Mitali Mehra * Zarina Khan as Inderjit Kaur Suri * Radha Israni as Swarni Dasi ** Asha Sharma replaced Israni as Swarni * Abeer Adil as Tarun; Neha's husband * Richa Rathore as Neha Raj Mehra aka Babli * Unknown as Bunty Raj Mehra ==== Khanna family ==== * Arjit Taneja/Vin Rana as Purab Khanna * Mrunal Thakur as Bulbul Purab Khanna; Purab's frist wife (Dead) * Ruchi Savarn as Diya Purab Khanna; Purab's second wife * Vedansh Jaju as Sunny Khanna; Diya and Purab's son * Shikha Singh/Reyhna Malhotra as Alia Purab Khanna ; Purab's third wife * Zeeshan khan/Pulkit Bangia/Naveen Sharma as Aryan Khanna; Alia and Purab's son; * Aparna Mishra as as Sahana Aryan Khanna === Season 2=== ==== Kohli family==== * Kushagra Nautiyal as Siddharth \"Sid\" Kohli * Pooja Singh as Mishti Kohli * Aishana Singh as Mihika Kohli * Mugdha chapekhar as Prachi Ranbir Kohli; Ranbir's wife * Krishna Kaul as Ranbir Kohli aka Krishan Kakkar aka Kk * Pooja Banerjee/ Teena phillips as Rhea Siddharth Kohli * Mehul Kajaria/Rushad Rana as Vikram Kohli * Khyati Keswani as Pallavi Kohli * Kiran Bhargava/Smita Shetty as Daljeet \"Dida\" Kohli * Shamik Abbas as Arun Kohli * Mridula Oberoi as Teji Kohli * Unknown as Vikrant Kohli * Kavita Banerjee as Trishna Kohli; Krishna's wife ==== Tandon family==== * Mallika Nayak as Manpreet Tandon * Kaushal Kapoor as Ashok Tandon * Utkarsha Naik as Vishakha Tandon * Riya Kapoor as Divya Tandon ** Mahira Sharma replaced Kapoor as Divya (2023–2024) * Purvi Pawar as Neha Tandon * Sparsh Kotwal as Abhay Tandon * Abhishek Malik as Akshay Tandon * Aafreen Dabestani as Mihika Tandon === Season 3=== ==== Malhotra family==== * Susheel Parashar as Mr Malhotra; Harman's father * Kirti Sualy as Mrs Malhotra; Harman's mother * Imran Khan as Harman Malhotra; Rajvansh's father * Pyumori Mehta Ghosh as Harleen Malhotra; Rajvansh's mother * Abrar Qazi as Rajvansh Malhotra aka RV * Richa Sharma as Poorvi Malhotra; Rajvansh's wife * Rahul Ram Manchanda as Vikrant Malhotra; Rajvansh's younger brother * Preeti Kaur Nayak as Dipika Malhotra; Vikrant's wife * Anuj Khurana as Jaswant Malhotra; Harman's younger brother * Priti Gandwani as Damini Malhotra; Jaswant's wife * Nakul Ulja as Yug Malhotra; Jaswant and Damini's son * Sanchita Ugale as Diya Malhotra; Yug's wife ==== Jaiswal family ==== * Ajay Sharma as Gajendra Jaiswal; Trishna’s father * Hetal Yadav as Rajni Jaiswal; Trishna's mother === Season 4=== ==== Randhawa family ==== * Namik Paul as Shivansh Randhawa; Prarthana's husband * Pranali Rathod as Prarthana Randhawa alias Pragya Malhotra * Jaya Bhattacharya as Mrs Randhawa; Shivansh's Bua maa * Unknown as Tanya Randhawa; Shivansh's cousin * Unknown as Mr Randhawa; Shivansh's father * Aakash Talwar as Armaan Randhawa; Khushi's husband * Simran Budharup/Jyothsna Channdola Singh as Khushi \"Panchi\" Kohli Randhawa ==== Zaveri family==== * Hina Dani as Baa Zaveri * Vijhay Badlaani as Kanti Zaveri * Gurdip Punjj as Smita Zaveri * Akshay Binkra as Raunak Zaveri aka Chote Thakur * Isha Pandhe as Sneha Zaveri * Nitin Vakharia as Devang Zaveri * Bhavwini Gandhi as Shubhvi Zaveri * Abhay Bhadoriya as Tanuj Zaveri * Hanisha Gehlot as Sejal Zaveri * Mohit Jaswani as Arjun Zaveri * Parri Galaa as Kinjal Zaveri * Kalpesh Patel as Hitenkumar * Vedaant Saluja as Harsh * Ahnaf F Khatri as Kirtan * Snehal Waghmare as Raunak's aunt * Hetal Puniwala as Raunak's uncle ==== Parikh family==== * Parimal Bhattacharya as Kishan Parikh * Vandana Mittal as Seema Parikh * Phalguni Sharma/Honeyy Soni as Gayatri Parikh ==== Shah family ==== * Nikhhil Raj Khera as Praful Shah * Rashika Matharu as Ketki Shah * Aarchi Sachdeva as Payal Shah ==References== Category:Hindi-language television series Category:2014 Indian television series debuts",
 "title": "Kumkum Bhagya"
}