{
 "id": "625314",
 "text": "The Maji Maji rebellion or Maji Maji War (1905 - 1907) was an armed rebellion against the German Empire's colonial rule in German East Africa (modern-day Tanzania). Estimates say 75,000 to 300,000 people died during the rebellion, mostly from famine.Iliffe, John (1967). \"The Organization of the Maji Maji Rebellion\". The Journal of African History. 8 (3): 495–512. doi:10.1017/S0021853700007982. JSTOR 179833. == Causes & reaction == The German colonial government used violently repressive tactics to control the indigenous population.Natermann, Diana Miryong (2018). Pursuing whiteness in the colonies: private memories from the Congo Free State and German East Africa (1884-1914). Münster: Waxmann Verlag. p. 59. ISBN 978-3-8309-3690-9. OCLC 1037008514. The rebellion was first triggered by a German policy that forced the indigenous population to grow cotton for export. The German response to the rebellion was extremely brutal. They used \"scorched earth\" tactics that have been described as genocidal.Schaller, Dominik J. (2010). \"From Conquest to Genocide\". In Moses, A. Dirk (ed.). From Conquest to Genocide: Colonial Rule in German Southwest Africa and German East Africa. Empire, Colony, Genocide: Conquest, Occupation, and Subaltern Resistance in World History. War and Genocide. Vol. 12 (1st ed.). New York City: Berghahn Books. p. 310. ISBN 978-1-84545-452-4. JSTOR j.ctt9qd5qb.16. \"[I]t is doubtlessly appropriate—probably even important—to understand the German suppression of the Maji-Maji Revolt as genocidal.\"Bachmann, Klaus; Kemp, Gerhard (July 30, 2021). \"Was Quashing the Maji-Maji Uprising Genocide? An Evaluation of Germany's Conduct through the Lens of International Criminal Law\". Holocaust and Genocide Studies. 35 (2): 243. doi:10.1093/hgs/dcab032. \"If the German command's strategy was to destroy entire settlements (crops, harvests, and food), kill civilians along with combatants, coerce the surrender of entire groups through deliberate starvation, and to intentionally deprive ethnic groups of the leadership that was crucial to their survival — then Germany's conduct in East Africa deserves the label of genocide.\" == Interpretations == John Iliffe says the rebellion was: > [A] mass movement [which] originated in peasant grievances, was then > sanctified and extended by prophetic religion, and finally crumbled as > crisis [forced people to rely on] fundamental loyalties to kin and tribe. Patrick Redmond said the rebellion was \"Tanzania's most spectacular ... rejection of colonial rule\", but had only a \"slight chance of success\".Redmond, Patrick M. (1975). \"Maji Maji in Ungoni: A Reappraisal of Existing Historiography\". International Journal of African Historical Studies. 8 (3): 407–424. doi:10.2307/217152. JSTOR 217152 ==Sources== Category:1900s in Africa Category:History of Tanzania Category:20th century in Germany Category:Rebellions in Africa Category:20th-century rebellions Category:1900s conflicts",
 "title": "Maji Maji Rebellion"
}