{
 "id": "625378",
 "text": "Dungeons & Dragons, a fantasy roleplaying game, was the subject of a Satanic panic during the 1980s. During this time, Dungeons & Dragons (D&D;) was repeatedly attacked with accusations that it supported Satanism and led people to commit suicide. Eventually, these claims were proven false. However, the panic changed D&D; (including its official rules) permanently. Nevertheless, millions still play D&D; today. == Occult in the 1980s == === Beginnings: The McMartin preschool case === In the 1980s, fear of the occult was a big problem. In 1983, these fears exploded when a parent at the McMartin preschool in Manhattan Beach, California accused the school of sexually abusing her child in Satanic rituals. A number of other McMartin parents soon made similar accusations. At the time, daycare centers were very new, and parents worried for their children's safety. Parents around the country started to worry that their children might also be experiencing Satanic abuse. Initially none of the McMartin preschoolers reported any abuse. However, they began to tell wild tales of Satanic abuse after being questioned by parents, police, and others using suggestion and/or coercion. These tales fueled even more accusations, which began to spread across the country. When all charges were finally dropped (with no convictions), the McMartin case was the longest and most expensive series of criminal trials in American history. This meant it had gotten an enormous amount of attention and that its allegations had been repeated numerous times. Fueled by the McMartin case, fears and accusations continued to spread around the country about Satanism in various places, from schools to rock music and card games - like Dungeons & Dragons. == Suicides and harm == === James Dallas Egbert III === In 1979, a Michican State University student named James Dallas Egbert III tried to kill himself. Two days after he initially disappeared, a private investigator found him alive in the university's utility tunnels. James's mother had hired the investigator after finding her son's suicide note, which said James's character in D&D; needed to die because a demon told him to kill himself. James's mother blamed D&D; for his suicide attempt. James suffered from several mental illnesses that were poorly researched and poorly understood at the time, including depression, schizophrenia, and anxiety. Still, the private investigator (a man named William Dear) suspected that the game had caused James' actions. He thought James had gone into the tunnels to play a live action version of the D&D.; The media took Dear's theory as a fact and published it widely. This spread outrage against D&D.; A year later, James died by suicide. His story formed the basis of the book (and later movie) Mazes & Monsters. === Irving Lee Pulling II === In 1983, D&D; was blamed for the death of Irving Lee Pulling II. Police found Irving and his brother dead from gunshot wounds beneath a railroad trestle. Because Irving had a gun in hand, police thought there had been a murder-suicide. However, classmates pointed out that the boys frequently played D&D; around that railroad trestle. Investigators found that earlier that day, Irving’s character had a curse cast upon him. The curse was supposed to cause his character “emotional pain and damage.” Based on this information, the boys' mother Patricia blamed D&D; for Irving's death, suggesting that the curse was real and caused his suicide. Patricia then found other D&D; players who did harmful things. These included James Curbing, a very frequent D&D; player who killed his school principal, wounded three classmates, then shot himself. Convinced that D&D; was causing violence and suicide, Patricia founded a group called Bothered About Dungeons and Dragons (BADD). == Patricia Pulling and BADD == BADD's messages and public service announcements spread around the world, fueled by Satanic panic. Patricia Pulling (with co-writer Kathy Cawthon) further spread fears with her 1989 book The Devil’s Web: Who is Stalking Your Child for Satan? The book claims that D&D; players will become “homosexual satanists who will sacrifice their parents, their sister, and the family cat, then commit suicide in a satanic ritual\". It suggests that teenagers cannot see the difference between fiction and reality. Pulling argued that D&D;'s manuals were so detailed that they could only have been written by people with a vast knowledge of the occult. (In the original Advanced D&D;, some monsters were demons with varying degrees of power over the characters.) Believing the game was Satanic, Patricia sued her son Irving's school for allowing students to play D&D; there. The principal argued that the game was not part of the school's official curriculum, and the lawsuit was dropped. == Research and opposition == Some people still defended D&D; and opposed the Satanic panic. Michael Stackpole published articles like The Pulling Report and The Truth About Role-Playing Games to discredit Pulling's claims about the game. Stackpole studied people who played role-playing games, and found they had a lower suicide rate than the general population. Research eventually showed that there is no link between D&D; and violence or suicide. By 1991, the United States Centers for Disease Control & Prevention (CDC), American Association of Suicidology, and Health and Welfare Canada had all published statements calling the game safe. However, their statements were not enough to make the D&D; Satanic panic vanish. == Game changes == Eventually D&D;'s maker, TSR Inc., made changes to the game as a result of the panic. James Ward, an executive at TSR, had demons and devils removed from the Monster Manual and Assassins. He also had some spells removed from the Player's Handbook. Ward explained his actions in an article in Dragon, a magazine about fantasy role-playing games, saying that \"avoiding the Angry Mother Syndrome has become a good, basic guideline, for all of the designers and editors at TSR, Inc.\". In later editions, TSR re- added some of the removed features in a separate manual intended for mature readers. Today, the game is played around the world. == References == Satanic Panic",
 "title": "Dungeons and Dragons Satanic Panic"
}