{
 "id": "625377",
 "text": "Manuela Saenz was born in Quito, Ecuador in 1797 during the Spanish colonial rule. She was the illegitimate child of a married Spanish nobleman. She went to school at the Convent of Santa Catalina. Manuela Saenz's nickname was Manuelita. She married a wealthy English doctor James Thorne, who was twice her age, in 1817. She was an active member in the conspiracy against the viceroy of Perú, José de la Serna e Hinojosa during 1820. She left her husband in 1822. She had an affair with Simón Bolívar until he died in 1830. She often wore a colonel's uniform, with her two black servants Jonatás and Nathán, also in soldier's uniforms Saenz was called “la libertadora del libertador” because she saved Simon Bolivar's life. She followed Bolivar on his campaigns and saved his life in 1828. When assassins came for him she let him escape out the window. Manuela is quoted to have said \"Go ahead, cowards, Kill me! Kill a woman!” when she was making time so Simon could escape.7 Female Adventurers Who Broke All the Rules - HISTORY Saenz attempted to kill herself with a snake after Bolivar died, Saenz thought that no matter if Simon Bolivar died, his influence would never die because he gave so many people freedom. After Simon died she became a shopkeeper, Simon Bolivar had many lovers but it was only Saenz who he took with him into the most dangerous marches of the wars of independence in Latin America.Simón Bolívar's lover gains heroine status | World news | The Guardian == Manuela Saenz fighting for other countries' rights == Manuela went through inequality in her childhood and she wanted independence and a change. She was fighting battles in the 1820’s. She wore men’s clothes and a mustache from a dead Spanish soldier. She smoked. Manuela Saenz acted like a nurse on the battlefield at Ayacucho, Ecuador. When the rebels won she earned a rank of lieutenant. She also acted as a nurse and a combatant spy expert, army general, mistress. After Simon Bolivar died his enemies sent Manuela out of Colombia to Peru. She continued her political activity in Peru. People believed that women should not be involved in politics so it was easier for them to be smugglers and spies. When she was trying to get people's attention she sent letters to people of power. She was exiled from Ecuador in 1835 because she was accused of trying to overthrow the government. In her letters she shows that women wanted to become involved with politics. She is known as a war hero because she helped a lot of countries be independent from the Spanish rule. Manuela Saenz died in Paita, Peru in 1856. Her body was put into a communal grave, She died of a diphtheria epidemic. Saenz's remains have been carried through Peru, Ecuador and Colombia. She was given a full state burial in Venezuela in 2010. There have been ceremonies to honor her and her help to many countries. ==References== Category:1797 births Category:1856 deaths Category:Politicians from Quito Category:Feminists Category:History of Colombia Category:History of Ecuador Category:19th century in South America Category:Peruvian politicians Category:Deaths from diphtheria",
 "title": "Manuela Saenz"
}