{
 "id": "625414",
 "text": "The Greensboro sit-ins were a series of peaceful protests that happened in Greensboro, North Carolina. They happened from February 1 to July 25, 1960. Many of them happened at the F. W. Woolworth Company store in the town. At Woolworth’s you could only sit on the stools if you were white. There were four men influenced by non-violent protest. The four men were young black students at the North Carolina Agricultural and Technical State University. This started because these four men wanted to prove a point about segregation. The four men were inspired by Mahatma Gandhi. They were inspired by the Freedom Riders. They planned their protest very carefully. They sat at the table. They wanted to be served, but did not get served. They just sat and did not leave. On the second day there were 20 people. The sit-ins made local news. The students wrote the following letter to the president of Woolworth's: > Dear Mr. President: We the undersigned are students at the Negro college in > the city of Greensboro. Time and time again we have gone into Woolworth > stores in Greensboro. We have bought thousands of items at the hundreds of > counters in your stores. Our money was accepted without rancor or > discrimination, and with politeness towards us, when at a long counter just > three feet away our money is not acceptable because of the colour of our > skins....We are asking your company to take a firm stand to eliminate > discrimination. We firmly believe that God will give you courage and > guidance in solving the problem. Sincerely Yours, Student Executive > Committee The sit-in movement then spread to other Southern cities, including Winston- Salem, Durham, Raleigh, Charlotte, Richmond, Virginia, and Lexington, Kentucky. By February 8, 500 people joined the protest. . Because of the protest the F. W. Woolworth Company department store chain stopped its policy of racial segregation. ==References== Category:Civil disobedience Category:1960s protests",
 "title": "Greensboro sit-ins"
}