{
 "id": "625458",
 "text": "Gina Cheri Haspel (born October 1, 1956) is an American intelligence officer. Haspel was the 7th Director of the Central Intelligence Agency from April 26, 2018 to January 20, 2021. She was appointed by President Donald Trump. Before, she was the 6th Deputy Director of the CIA, appointed by Trump in February 2017. On March 13, 2018, Haspel was nominated by President Trump to become the CIA Director, replacing Mike Pompeo. She is the first woman to hold the position. She was approved for confirmation by the Senate Intelligence Committee on May 16 by a 10-5 vote, with two Democrats voting in favor. She was sworn-in on May 21. ==Early life== Haspel was born Gina Cheri Walker on October 1, 1956 in Ashland, Kentucky. Haspel was a student at the University of Kentucky for three years and transferred for her senior year to the University of Louisville, where she graduated in May 1978. ==Early career== Haspel joined the CIA in January 1985 as a reports officer. She held many undercover overseas positions, for many of which she was station chief. Her first field assignment was from 1987–1989 in Ethiopia, Central Eurasia, Turkey, followed by several assignments in Europe and Central Eurasia from 1990 to 2001. From 1996 to 1998, Haspel was station chief in Baku, Azerbaijan. === Deputy Director of the CIA === On February 2, 2017, President Donald Trump appointed Haspel Deputy Director of the CIA. On February 8, 2017, many members of the Senate intelligence committee asked Trump to change his appointment of Haspel as Deputy Director. == Director of the CIA (2018–2021) == On March 13, 2018, President Donald Trump announced he would nominate Haspel to be the Director of the Central Intelligence Agency, replacing Mike Pompeo who was set to become the new United States Secretary of State. Haspel became the first woman to become permanent Director of the CIA. Many people were against her nomination because of her support of torture and water boarding. Haspel was approved for confirmation by the Senate Intelligence Committee on May 16 by a 10–5 vote, with two Democrats voting in favor. The next day, Haspel was confirmed by the full Senate, on a mostly party-line, 54–45 vote. ==Personal life== Haspel married Jeff Haspel in 1976. They were divorced by 1985. Haspel lives in Ashburn, Virginia. ==References== Category:1956 births Category:Living people Category:Directors of the Central Intelligence Agency Category:Politicians from Virginia Category:Politicians from Kentucky Category:People from Ashland, Kentucky",
 "title": "Gina Haspel"
}