{
 "id": "626121",
 "text": "Asad Ashraf (; born 21 June 1963) is a Pakistani politician who has been the member of the Senate of Pakistan since March 2018. He has also been a member of the Provincial Assembly of Punjab from 2002 to 2013. == Early life and education == He was born on 21 June 1963 in Lahore. He got the degree of medicine from Allama Iqbal Medical College in 1986 and did his postgraduation in Cardiology from National Institute of Cardiovascular Diseases, Karachi in 1994. == Political career == He joined Pakistan Muslim League (N) in 1996 after the murder of his brother, Javed Ashraf who was a member of the PML-N. He had been advisor to the Chief Minister of Punjab Shehbaz Sharif from 1997 to 1999. He was elected to the Provincial Assembly of Punjab as a candidate of PML-N from Constituency PP-138 (Lahore-II) in Pakistani general election, 2002. He got 10,651 votes and defeated a candidate of Pakistan Muslim League (Q) (PML-Q). During his tenure as the member of the Punjab Assembly, he remained deputy parliamentary leader of PML-N in the Punjab Assembly. He was re-elected to the Provincial Assembly of Punjab as a candidate of PML-N from Constituency PP-138 (Lahore-II) in Pakistani general election, 2008. He got 19,552 votes and defeated a candidate of Pakistan Peoples Party. He ran for the seat of the Provincial Assembly of Punjab as an independent candidate Constituency PP-138 (Lahore-II) in Pakistani general election, 2013 but was unsuccessful. He received 12 votes and lost the seat to Ghazali Saleem Butt. In the same election, he also ran for the seat of the National Assembly as an independent candidate from Constituency NA-118 (Lahore-I) but was unsuccessful. He received 16 votes and lost the seat to Muhammad Riaz Malik. Ashraf was elected to the Senate of Pakistan from Punjab general seat as an independent candidate in by-election held on 1 March 2018. He received 298 votes against a candidate of Pakistan Tehreek-e-Insaf who secured 38 votes. Ashraf was backed by PML-N which initially nominated him but he had to run in the polls independently after the Election Commission of Pakistan declared his nomination papers cancelled following the disqualification of Nawaz Sharif by the Supreme Court of Pakistan. He took oath as Senator on 12 March 2018. == References == Category:1963 births Category:Living people Category:Politicians from Lahore",
 "title": "Asad Ashraf"
}