{
 "id": "626537",
 "text": "The Austin serial bombings were a series of five parcel bomb explosions which occurred from March 2 - 20, 2018 in Austin, Texas, United States. They killed two civilians and the bomber, as well as injuring another six people. The suspected bomber was Mark Anthony Conditt, age 23, who lived in Pflugerville, Texas, outside Austin.Michael Gold, Who Is Mark Conditt, the Suspected Austin Bomber?, New York Times (March 21, 2018). ==Background== The Austin Police Department (APD) believe the explosions were connected and considered the possibility that they are racially motivated. They have also warned civilians to not open suspicious packages, and to call the police. Austin police officially connected the March 2 bombing following the bombings on March 12. None of the packages were mailed, instead they were placed near the individuals' homes. Two of the bombs were triggered upon being picked up, another was triggered upon being opened, and the fourth bombing was suspected to be activated by tripwire. On March 2, 2018, 39-year-old Anthony Stephan House was killed by picking up an apparent package bomb at his home. Then, on March 13, 2018, the bombings killed 17-year-old cellist Draylen Mason. Authorities first offered a reward of $65,000 for information leading to an arrest and conviction of the bomber or bombers. They later raised the reward to $115,000.Alejandra Matos, Austin Police increase reward for information in bombings case, Houston Chronicle (March 18, 2018). ==Reaction== On March 20, 2018, President Donald Trump said at the White House: \"This is obviously a very, very sick individual, or maybe individuals...These are sick people, and we have to find them as soon as possible\". ==Death of the bomber== Early on March 21, Mark Anthony Conditt was identified by investigators via security footage taken at a FedEx store, and police moved in to make an arrest. As SWAT officers approached, he detonated a bomb in the vehicle, killing himself and injuring one of them, prompting other officers to fire upon the vehicle. ==List of bombings== Date Location Deaths Injuries Type 1 Private residence in Harris Ridge, Austin, Texas 1 0 Package bomb 2 Private residence in East MLK, Austin, Texas 1 1 Package bomb 3 Private residence in Montopolis, Austin, Texas 0 1 Package bomb 4 Near a road in Travis Country, Austin, Texas 0 2 Tripwire-activated bomb 5 FedEx Ground facility in Schertz, Texas 0 1 Package bomb 6 FedEx Ground facility in Austin, Texas Deactivated Package bomb 7 ~ Near a road in Round Rock, Texas 1 1 Two package bombs ;Notes ==References== Category:2018 murders in the United States Category:2010s crimes in Texas Category:Attacks on buildings and structures in 2018 Category:Attacks on buildings and structures in the United States Category:Explosions in the United States Serial bombings Category:Explosions in 2018 Category:March 2018 events Category:Murder in Texas Category:2018 in Texas",
 "title": "Austin serial bombings"
}