{
 "id": "626976",
 "text": "Fortnite Battle Royale is a video game mode within Fortnite Battle Royale, that has 3 main game modes Battle Royale, Creative, and Save the World released in 2017. The game is centered around being the last person alive. It also consists of a storm slowly moving towards a point on the map, dealing 1-10 damage per second, depending on how long the game had lasted. If a player is caught in the storm for too long, their character is eliminated. According to Dexerto, Fortnite saw an average of 236 million monthly players in the past 30 days (as of March 2023), with a peak daily player reaching 15 million. In the first year of Fortnite, Epic Games made a mode called Save the World which is Fortnite's main campaign. Fortnite is one of the most popular games in the world, where around 40 million people log on to play the game monthly. The original version of this game was called Save The World and was first introduced in 2011 with the name of Fortnite. In this mode, your mission is to save the survivors trapped in the storm zone. Fortnite has had 34 seasons, with the latest coming out on February 21st, 2025. ==Game play== The game starts with up to 100 players. The player may join with other players to form a team of two to four players, or the player may play on their own. The main goal of the game is to be the last player or team alive by eliminating or avoiding other players. The round starts with weaponless players skydiving from floating buses (called \"Battle Buses\") into a region of land. The game is set in that particular environment with all of the weapons, health items and other combat support that is needed for players to survive. Opponents attack other players and defend themselves by building structures. Throughout the game, a purple storm approaching from outside the land will move closer and closer towards the center of the map. Any player caught in the storm will become damaged. This directs surviving players closer to each other, forcing them to have to fight against each other. During the match, supply drops that provide legendary weapons and items will appear in random locations. Similar to Fortnite: Save the World, Fortnite Battle Royale is primarily played in third-person perspective (a type of perspective where the player controls the character as if they were around the character). What makes Fortnite Battle Royale unique from other battle royale games is the new building system, originating from the original Fortnite game. Players may destroy objects in their environment to provide materials so that they can build fortifications (walls, roofs, floors, etc) that help protect them from enemies. Some fortifications can be built quickly, but they will be destroyed easily. Some fortifications, however, can be built slowly but resists attacks better. In Chapter 3 Season 2, \"Zero Build\" was introduced, a mode that removes the building mechanic. The game is free-to-play, however players have the option to make in-app purchases that earn extra V-Bucks. \"Vinderbucks\", or V-Bucks for short, allows players to purchase new skins for their characters, weapons, or dances. The player can also earn V-Bucks without in-app purchases through completing missions or challenges that can even include skins. Ever since Fortnite Battle Royale was first released, Epic Games, the creator of the game, has added new features to it regularly. They frequently add new items and weapons for the game as well as fixing up any glitches or other critical problems in the game that affect game play via updates. ===Seasonal changes=== Fortnite Battle Royale has \"seasons\" that last for about 10 weeks each. These seasons introduce a new theme, along with a new chapter in the game's story line. Each season also brings new content, including new exclusive skins and new game play elements. There are currently 34 seasons, broken up into 6 distinct chapters (however, there are only 2 seasons in Chapter 6 so far). On October 15, 2019, a new chapter was released to Fortnite Battle Royale. This added even more new game play like boats, fishing, new guns, a lot of guns and items being vaulted, and a completely new map. === Chapters === ====Chapter 1==== Season Period Description Season 1 September 2017 – December 2017 Considered the first season before Season 2 was officially announced. Season 2 December 2017 – February 2018 Introduction of the battle pass System. Medieval themed. Season 3 February 2018 – April 2018 Space-themed. The battle pass was increased to 100 tiers instead of 70. Season 4 - Brace for Impact! April 2018 – July 2018 Superhero Themed. A meteor has hit the island bringing dusty divot and the first member of the seven the visitor. Season 5 - Worlds Collide July 2018 – September 2018 Themed upon a crash between the real world and its past and the world of Fortnite. A cube spawned into the desert somehow being a fan favorite character named Kevin. Season 6 - Darkness Rises September 2018 – December 2018 Darkness and corruption themed. Late during the season Kevin falls into loot lake and made it bouncy Season 7 - You Better Watch Out December 2018 – February 2019 Winter themed. During the middle of the season the Ice King channeled his power into the infinity blade and covered the entire island with snow. Cube zombie spawners are on the island back with an icy coat of paint. Season 8 - X Marks The Spot February 2019 - May 2019 Pirate/tropical/fire themed. A volcano showed up in the top right of the map with Aztec looking ruins. The first version of Peely was in the battle pass. Season 9 - The Future Is Yours May 2019 - July 2019 Futuristic themed. The ruined Titled Towers got rebuilt in Neo Titled and Retail Row got turned into Mega Mall. Near the end of the season there was an event where the mech and monster fought over the Zero Point. The mech won by using some of the power from the Zero Point and pulling the statue out of Neo Titled which turned into a sword. After slaying the monster the mech shot off into space. Season X - Out Of Time July 2019 - October 2019 Season X was a celebration of all the previous seasons rolled into one. Locations from the past 2 years returned with new variations and twists on existing locations. The Zero Point was left exposed after the mech vs monster battle and the island is destabilizing fast. ==== Chapter 2 ==== Season Period Description Season 1 - New World October 2019 February 2020 The map was completely redone. New features were also revealed. Extra time to play was granted when the season was extended twice, once to February 8, and then to February 20. Season 2 - Top Secret February 2020 June 2020 Secret agent themed. The season was originally planned to end in late April 2020, but was delayed to June 4, then June 11, and finally June 17 due to events of the racial unrest in the United States. Season 3 - Splashdown! June 2020 August 2020 Aquatic-themed, Part of the season included cross-promotional content with Aquaman and Black Manta, and during the season the water levels started to. This showed a partial map named Coral Castle. Season 4 - Nexus War August 2020 December 2020 Marvel themed. This season contained a Marvel themed battle pass. Galactus is coming to the island for the zero point Season 5 - : Zero Point December 2020 March 2021 Bounty Hunter- themed. The zero point was exposed in the map's center, which turned into a desert. The was a limited time mode where you would hunt people and so would Mando. Season 6 - Primal March 2021 June 2021 Wilderness themed. Crafting was added to the game as well as the first land animals which are, velociraptors, wolves, boars, frogs, and the community favorite chicken. Season 7 - Invasion! June 2021 September 2021 Alien invasion themed. Rick and Morty both got added. The armies of aliens called the Last Reality arrive in their mothership and abduct POIs in an attempt to capture the zero point and ravage the multiverse. Season 8 - Cubed September 2021 December 2021 Darkness / Cube-themed. This is the last season of Chapter 2. After the Mothership was destroyed the faction known as the Last Reality has taken over the island with cubes. Kevin the cube is revealed to have been summoned as the first cube to attempt to take over the island in Chapter 1. ==== Chapter 3 ==== Season Period Description Season 1 - Flipped December 2021 - March 2022 The island is flipped after the cube queen's attack on the island. The foundation tells the loopers about other threats that are more threatening than the last reality to the zero point. Spider-Man has finally arrived on the island Season 2 - Resistance March 2022 - June 2022 The IO started a fully-fledged war with the Seven. Tanks are added, along with even more new weapons. The drive-able battle bus is added to the game. The chopper is re-added later in the season along with POIs being claimed by each faction. Season 3 - Vibin' June 2022 - September 2022 In the victory of the Seven, the island is celebrating. But little does anyone know that someone is watch the island. This season takes on a party theme. Season 4 - Paradise September 2022 - December 2022 Chrome substance on the island can be used to turn into a shiny blob that can go through walls with two new chrome themed weapons which can upgrade themselves. ====Chapter 4==== Season Period Description Season 1 - Reality Zero December 2022 - March 2023 The start of the 4th chapter of Fortnite in which a new island was created with fragments of the old Chapter 3 island by the Zero-Point, Amie (The Scientists' former AI), and the Paradigm. Season 2 - MEGA March 2023 - June 2023 New POI, Mega City, falls from the sky because of the destruction of the Rift Gate that was built last season. There are new guns and rails that you can ride on. Katanas were also added this season with futuristic cars and motorcycles. Season 3 - Wilds June 2023 - September 2023 A new chunk of the map, a jungle/rain forest area, appears after the center of the map caves in like a sinkhole. The loopers are able to ride raptors. Season 4 - Last Resort September 2023 - November 2023 3 luxury suites appear on the map, Sanguine Suites, Relentless Retreat, and Eclipsed Estate. Mythics all the way from Chapter 2 Season 1 until the current season were added. You can get these mythics inside the vaults located in the 3 suites, along with 3 from the NPCs guarding the vault. Season OG November 2023 - December 2023 We are transported back to chapter one with kado thorne's time machine to try and fix the past. Every week represents a season from season 5 all the way to season X. ==== Chapter 5 ==== Season Period Description Season 1 - Underground December 2023 March 2024 Underground vs The Society themed. The Society was trying to take over the island but Valeria (the tier 100 skin) is looking for Pandora's box. She awakens the titan sleeping under the island and the box is now on the surface. Season 2 - Myths & Mortals March 2024 May 2024 Greek mythology themed. With the \"Rise of Midas\" and the Snapshot quests. Avatar and star wars collabs during near the end of the season. There is a sandstorm on the way to the island with a shark boat inside of it. Season 3 - Wrecked May 2024 - August 2024 Apocalyptic theme. Fallout collab. There are 3 new bosses which have their own medallions and you can get the bosses unique cars. The drive- able battle bus is back in the game. Some mysterious figure called the Wander has appeared on the island Season 4 - Absolute Doom August 2024 - November 2024 Marvel Comics theme. Doom is revealed to be The Wanderer and absorbs Pandora's Box to take all its power to create the Kingdom Of Doom, The Avengers attack Doom and his forces. Season Remix November 2024 - December 2024 Music theme. Similar to Season OG, this season went back to a previous map: Chapter 2. Revolves around music and music artists, and the season had collaborations with artists such as Snoop Dogg, Eminem, Juice WRLD, and Ice Spice. Chapter 6 `Season` `Period` Description Season 1 - Demon Hunters December 2024- February 2025 Following the end event for Season Remix, a shard of the Zero Point crashes into the Island of Oninoshima, the Chapter 6 map. This brings magic back to the island after it had been banished for centuries. Season 2 - Lawless February 2025 - May 2025 The spirit realm portal from the previous event began to leak gold, attracting criminals and people who want to seize the riches of the island for themselves. Heists were introduced to the game, coming in the forms of bank vaults, a train robbery, and a truck robbery. Mini Season 1-Galactic Battle May 2025 - June 2025 Fortnite's first ever Star Wars season. This season is only a month long with weekly updates. This happened when Daigo and the Baron tried to enter the spirit realm and the portal was sending out energy waves, getting the attention of the Death Star. Season 3 - ? June 2025 - ? 2025 Superhero themed with a new Superman skin Season 4 - Leaked to be “Bug invasion” themed Season 5 - Might be season MS2- Leaked to have a Simpsons collab ==Popularity== The game quickly gained popularity, with over 10 million players playing the game within the first two weeks of release. As of March of 2019, Fortnite Battle Royale has 250 million players, exceeding the population of Brazil. Fortnite Battle Royale has also been popular with children, even though the game is all about shooting each other. The game's cartoonish art style, free-to-play nature (does not cost money to play the game), and being able to interact online makes it attractive to kids. Since the release of the mobile version of Fortnite Battle Royale, many parents and teachers were concerned about how it affects children psychologically. Teachers have noticed that children are easily distracted when playing Fortnite. Epic Games, the creator of Fortnite Battle Royale, responded by adding warning labels to the game's loading screens that the game should not be played during a class session. === Criticism === Some agencies (organizations that service a special field) were worried that many children are not getting enough proper exercise and real-world social interaction because of playing games such as Fortnite. Other agencies had warned parents that Fortnite Battle Royale causes children to do violent behavior. On April 2019, Prince Harry proposed that Fortnite Battle Royale should be banned. He believes Fortnite Battle Royale has a negative effect on society. He said, \"The game should not be allowed, Its created to addict children. An addiction to keep you in front of a screen for as long as possible. It's so irresponsible.\" == Notes == == References == == Other websites == * Category:2017 video games Category:Epic Games games Category:Android (operating system) games Category:Battle royale games Category:Early access video games Category:Esports games Category:Free-to-play video games Category:IOS games Category:MacOS games Category:Multiplayer video games Category:Nintendo Switch games Category:PlayStation 4 games Category:PlayStation 5 games Category:PlayStation Network games Category:Third-person shooters Category:Video games developed in the United States Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Fortnite Battle Royale"
}