{
 "id": "627051",
 "text": "Martín Alberto Vizcarra Cornejo (born 22 March 1963) is a Peruvian engineer and politician. He was the 60th President of Peru following the resignation of President Pedro Pablo Kuczynski. He previously served as the Vice President of Peru alongside Mercedes Aráoz. == Early life == Vizcarra was born in Lima, the son of César Vizcarra Vargas, who was an American Popular Revolutionary Alliance(APRA) member, and Doris Cornejo, an elementary school teacher. His father was mayor of Moquegua and a member of the Constituent Assembly of 1978. His family was based in Moquegua, but moved to Lima due to a pulmonary complication that put him on the verge of death at his birth. Vizcarra has stated that his father had a lasting impact on his life. == Education == Vizcarra studied at the IEP Juan XXIII and the GUE Simón Bolívar, in Moquegua. For university education, Vizcarra graduated from the National University of Engineering in Lima in 1984 while also earning a degree in Management Administration from the School of Business Administration (ESAN). ==Vice presidency== In the 2016 general election, Vizcarra ran with the Peruvians for Change presidential ticket as candidate for first vice president and as Pedro Pablo Kuczynski's running mate. The ticket narrowly defeated Keiko Fujimori's Popular Force nomination. ==Presidency== Vizcarra was sworn into office as president on 23 March 2018 following the resignation of President Kuczynski. Throughout his tenure, Vizcarra remained independent from political parties, promoted reforms against corruption in the legislative and judicial branches and vowed to not run for president when his term ends in 2021.Following what he described as a \"factual denial of confidence\" against his government, Vizcarra dissolved the Peruvian Congress on 30 September 2019 and, on the same day, issued a decree for legislative elections. The snap election for a new congress was held on 26 January 2020, with the legislature elected becoming opposition-led once again. ===Removal=== On 9 November 2020, Vizcarra was impeached and removed as President by the Congress and replaced with Manuel Merino. Vizcarra's impeachment incited the 2020 Peruvian protests, as many Peruvians. Vizcarra was banned from holding public office for 10 years after allegedly jumping the line to get a COVID-19 vaccine, with an 86-0 vote in congress. ==References== Category:1963 births Category:Living people Category:Presidents of Peru Category:Peruvian engineers Category:Politicians from Lima",
 "title": "Martín Vizcarra"
}