{
 "id": "627176",
 "text": "Fortnite is a third person shooter survival video game made by Epic Games. The player has to survive against up to 100 other players unless you are looking to play the mode Reload which has 40 players. The total player count for each Battle Royale match is 100 and for Reload it's 40. The player can build forts through collecting materials such as metal, bricks, wood, and collect weapons before fighting other players. The main game also has a mode called Fortnite: Save The World, which is also available as a separate game. While Battle Royale is free, Save the World is a paid game. The game can be played on Nintendo Switch, Windows, PS4, PS5, Xbox, Android and iOS. ==Game modes== ===Battle Royale=== 100 players compete to win a victory crown. Sometimes there are computer-controlled enemies, referred to as Bots. Players compete with each other to fight to the death. Players start with 100 health and 0 shield. In the game's 'Zero Build' mode, players can have an Overshield which provides 50 more shield and regenerates when the player is not taking damage. in addition to their health and shield, players can find shield items to consume for a max of 200 hit points (or 100 health/100 shields). Players lose health and shields if they get shot by weapons, if they fall from too high, or take slow damage in The Storm. The Storm approaches over of a game, shrinking as the match goes on and coaxing players to fight at the risk of losing their HP. If the player loses all their health, they will be eliminated and out of the game. In Fortnite, there are different kinds of weaponry, including guns, throwables (i.e Boogie Bombs), blades, grenade launchers, boomerangs, and a multitude of other mythical items. Weapons can be obtained throughout the game by simply spawning on the floor (referred to by players within the Fortnite community as 'floor loot'), opening chests and/or supply drops, looting them off enemies and other eliminated players, and fishing from the water. The winner of the match is the one who is the last person standing. A victory in Fortnite is referred to as a '#1 Victory Royale'. Right now the one of the best players in this game is the person named \"PeterBot\" winning the FNCS's of 2024, the Fortnite Championship. A player named \"Pollo\" was his partner in this tournament. The current Fortnite season is called Galactic Battle (Star Wars). At the beginning of the game, players can get to different locations by skydiving from a flying blue school bus held up with a hot air balloon, titled the Battle Bus. The battle bus goes in a straight line over the map, but the path varies per match. Reload Reload is a mode that is very similar to Battle Royale with a few big differences. The island is smaller and there are only 40 players instead of 100. If you die you can come back to life three times if you are playing solo, or you can come back to life after a short amount of time if at least one teammate is still alive in team modes. Near the end of the game you can no longer respawn, forcing people to fight to the death and win a victory crown. ==== Creative ==== Creative mode allows the building of anything players can think of. Players can copy and paste different objects from the Battle Royale mode and are able to visit the map as well. They can rotate and enlarge them to any way they want, while exploring the community- built maps from other people. ===Save the World=== Fortnite: Save the World is the original and first version of the game, first released on July 27, 2017. Players must cooperate with others to kill Husks and complete various missions. One to four players cooperate towards a single goal that they both need to achieve in order to survive, and to win the mission. There are 4 main named locations that are unlocked by progressing through the campaign. The first is Stonewood, the weakest of the 4 areas. Next is the mid-level Plankerton, followed by the high-Level Canny Valley, ending with the last location, and the hardest, Twine Peaks. There are many other locations as well, added with events. One such is Scurvy Shoals, a tropical themed area. There is also a mini-mode of it that comes around Halloween with halloween- themed items and monsters called Horde Rush. It is a LTM (Limited Time Mode). == Competitive == Competitive Fortnite is played in Ranked and tournaments. There are different kinds of tournaments. There are tournaments that everyone can play (free tournaments). They usually do not have any cash rewards. The cups everyone gets to compete in are usually skin cups, where top 100 in each region gets a skin before its released to the item shop. For example, Thanos had a skin cup. There are also Ranked cups. In Ranked cups, players need to be in a specific rank in a game mode called \"Ranked Battle Royale\". In order to get in a higher league, they need to earn rank. They have added a new mode recently that is a Ranked Reload, it is basically regular reload but in the ranked form. It still has all the original ranks from Battle Royale just in reload form. You get percentage for getting kills, placements and wins. There are 8 different divisions listed below. * Bronze I, II, III * Silver I, II, III * Gold I, II, III * Platinum I, II, III * Diamond I, II, III * Elite * Champion * Unreal In Ranked cups, players get cosmetics, once reached certain amount of points. These are tournaments for cosmetics in the game. There are also top tier tournaments, like FNCS, which you can join if you are Elite rank or above, people can still play skin cups, and other special cups. To play cash cups, you must be minimum of gold rank or higher. ==Cosmetics== Fortnite: Battle Royale has cosmetics. Cosmetics are items/skins that do not give the player any advantages in the game* like pickaxes, dances, emotes, skins, wraps and sprays. Cosmetic items can be bought by the use of V-Bucks, the in-game currency, or with real-life currency, depending on what the item is. They can also be earned by completing challenges for the \"Battle Pass\", which is done by playing the game. *Though cosmetics in Fortnite are advertised this way, this may not always be true. There are some mistakes, such as the infamous Star Wand, which used to do 56 damage during an update after Season X as opposed to the now-typical 20. As of my knowledge cutoff in October 2023, there have been hundreds of skins released in Fortnite, with new ones being added regularly through updates, battle passes, events, and collaborations. Here's a list of notable and iconic skins from Fortnite, though it is by no means exhaustive. I’ll break it down into categories to help organize them: === Skins === * Jonesy (Various versions) * The Reaper (Season 3) * Nog Ops * Ace * Wild Card * Superman * Travis Scott * Ali-A === Battle Pass Skins === These are skins tied to each season's battle pass, often with multiple stages or styles: * Renegade Raider (Season 1) * Black Knight (Season 2) * Omega (Season 4) * Drift (Season 5) * Ragnarok (Season 5) * Lynx (Season 7) * Peely (Season 8) * Ultima Knight (Season X) * Arachne (Season 8) * Midas (Season 2, Chapter 2) * Spire Assassin (Season 6, Chapter 2) * Godzilla === Icon Series === These skins are often inspired by real-life celebrities, streamers, or social media influencers: * Ninja * Loserfruit * TheGrefg * Lachlan * Ariana Grande * Travis Scott * LeBron James * Bruno Mars * Kylo Ren * Mr. Beast === Marvel Skins === Fortnite has collaborated with Marvel for a number of special skins: * Iron Man * Spider-Man * Thor * Wolverine * Venom * Captain America * Deadpool * Doctor Doom * Storm * Black Panther === DC Skins === There are also several DC Universe skins available: * Batman * The Flash * Wonder Woman * Harley Quinn * Aquaman * Green Lantern * The Joker * Superman === Star Wars Skins === There have been several Star Wars skins and collaborations: * Kylo Ren * Rey * The Mandalorian * Boba Fett * Luke Skywalker === Special Event Skins === Many skins are introduced for limited-time events: * Frostbite (Winterfest) * Cuddle Team Leader (Valentine's Day) * Skull Trooper (Halloween) * Ghoul Trooper (Halloween) === Rare and Legendary Skins === Some skins are considered rare due to their limited-time availability or special release: * Galaxy * Recon Expert * Renegade Raider * Elite Agent === Cross- Over Skins === These are skins from other popular media franchises or collaborations: * Stranger Things skins (e.g., Hopper, Demogorgon) * John Wick * Kratos (God of War) * Master Chief (Halo) * Predator === Seasonal & Holiday Skins === These skins come around during certain seasonal events, such as Halloween, Christmas, etc.: * Santa’s Little Helper * Winterfest Skins * Summer Midas === Legendary and Iconic Skins === * A.I.M. * Raven * Drift * Midas * Midas Rex === Evolution Skins === Some skins evolve through play or unlock different stages: * Lynx (evolves from a cat-themed costume to various sleek designs) * Ragnarok (starts as a low-tier skin, but can evolve into a Viking warrior) === Holiday & Limited-Time Skins === These skins are often part of limited-time or holiday celebrations: * Krampus * Nog Ops * Blitzen ==Notes== ==References== ==Other websites== * * Fortnite wiki Category:2017 video games Category:Crossover video games Category:Early access video games Category:Free-to-play video games Category:IOS games Category:MacOS games Category:Nintendo Switch games Category:Online games Category:PlayStation 4 games Category:PlayStation 5 games Category:Video games developed in the United States Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Fortnite"
}