{
 "id": "627407",
 "text": "Eastern Chalukyas, also known as the Chalukyas of Vengi, was a dynasty that ruled parts of South India. It ruled for a period from the 7th century to the 12th centuries. They started out be as governors of the Chalukyas of Badami in the Deccan region. Later they became powerful. They ruled the Vengi region of present-day Andhra Pradesh until c. 1130 CE. After 1130 CE they continued their rule under the overlordship(feudatory) of the Chola.Originally, the capital of the Eastern Chalukyas was located at the Vengi city. Later the capital was shifted to Rajahmundry. Throughout their history the Eastern Chalukyas were the cause of many wars between the more powerful Cholas and Western Chalukyas. Eastern Chalukyan rule of Vengi saw the growth of Telugu culture, literature, poetry and art throughout the region.The Eastern Chalukya inscriptions show a gradual shift towards Telugu with the appearance of Telugu stanzas from the time of king Gunaga Vijayaditya (Vijayaditya III) in the middle of the 9th century, Dr. K.S.S. Seshan, University of Hyderabad. \"APOnline-History of Andhra Pradesh-ancient period-Eastern Chalukyas\". Revenue Department (Gazetteers), Government of Andhra Pradesh. Tata Consultancy Services. Archived from the original on 6 December 2006. Retrieved 12 November 2006. ==Birth of the dynasty== The Chalukyas of Vengi emerged from (came from) the Chalukyas of Badami.The Badami ruler Pulakeshin II (608–644 C.E) conquered the Vengi region in eastern Deccan by defeating the Vishnukundina dynasty. He appointed his brother Kubja Vishnuvardhana as the governor of the new territory in 624 CE.Pulakesi II made Vishnuvardhana the Yuvaraja or crown prince. Later Vishnuvardhana become the founder of the Eastern Chalukya empire (Sastri 1955, pp. 134–136, p. 312) Kubja Vishnuvardhana founded the Eastern Chalukya dynasty after the death of Pulikeshin II in the Battle of Vatapi.Chopra (2003), p. 132, part 1 ==History== Between 641 CE and 705 CE some kings, except Jayasimha I and Mangi Yuvaraja, ruled for very short durations. Then periods with weak rulers followed. At this time, the Rashtrakutas removed the Western Chalukyas of Badami. The weak rulers of Vengi had to face the Rashtrakutas. There was no Eastern Chalukya ruler who could fight against them. During the period of Gunaga Vijayaditya III, the Rashtrakuta emperor Amoghavarsha treated him as his ally (supporter). After Amoghavarsha's death, Vijayaditya made the state independent. ==Rulers== # Kubja Vishnuvardhana (624 – 641 CE) # Jayasimha I (641 – 673 CE) # Indra Bhattaraka (673 CE,seven days) # Vishnuvardhana II (673 – 682 CE) # Mangi Yuvaraja (682 – 706 CE) # Jayasimha II (706 – 718 CE) # Kokkili (718–719 CE, six months) # Vishnuvardhana III (719 – 755 CE) # Vijayaditya I (755 – 772 CE) # Vishnuvardhana IV (772 – 808 CE) # Vijayaditya II (808 – 847 CE) # Vishnuvardhana V (847– 849 CE) # Vijayaditya III (849 – 892 CE) with his two brothers : Vikramaditya I and Yuddhamalla I # Chalukya Bhima I (892 – 921 CE) # Vijay Aditya IV (921 CE, six months) # Amma I and Vishnuvardhana VI (921 – 927 CE) # Vijayaditya V (927 CE, fifteen days) # Tadapa (927 CE, one month) # Vikramaditya II (927 – 928 CE) # Chalukya Bhima II (928 – 929 CE) # Yuddha Malla II (929 – 935 CE) # Chalukya Bhima III and Vishnuvardhana VII (935 – 947 CE) # Amma II (947 – 970 CE) # Danarnava (970 – 973 CE) # Jata Choda Bhima (973 – 999 CE) # Shaktivarman I (999 – 1011 CE) # Vimaladitya (1011–1018 CE) # Rajaraja Narendra (1018–1061 CE) # Shaktivarman II (1062 CE) # Vijayaditya VI (1063–1068 CE, 1072–1075 CE) # Raja Raja II (1075–1079) # Vira Chola Vishnuvardhana IX (1079–1102) ==References== Category:Ancient India Category:7th-century establishments in India Category:12th-century disestablishments in Asia Category:Disestablishments in India Category:Former countries in South Asia Category:Kshatriya",
 "title": "Eastern Chalukyas"
}