{
 "id": "627638",
 "text": "Tyka Evene Nelson (May 18, 1960 - November 4, 2024) was an American singer. She was the daughter of jazz musician John L. Nelson (1916–2001) and Mattie Della Shaw (1933–2002). She was the younger sister of Prince (1958–2016). Nelson released four albums. She reached No. 33 on the Billboards Hot R&B;/Hip-Hop Songs chart in July 1988 with \"Marc Anthony's Tune\". It was produced by Larry Graham. == Early life == Tyka Evene Nelson was born on May 18, 1960 in Minneapolis, Minnesota. She is the daughter of Mattie Della Nelson (née Shaw; 1933–2002) and John Lewis Nelson (1916–2001). Her parents were both African-American,. Her family ancestry is centered in Louisiana. All four of her grandparents arefrom that state. Her father was a jazz pianist and songwriter. Her mother was a jazz singer. Her brothe was Prince Rogers. Both children had an interest in music. This was encouraged by their father. According to a 2008 interview with City Pages, she began writing songs when she was 10 and “hasn’t collaborated” with her brother since they were young. Tyka studied and graduated at of Minneapolis’ North High == Career == in 1978, After graduating from North High of Minneapolis, Tyka went to California to begin her musical career. She released her first studio album Royal Blue in 1988. She signed with the record lable Cooltempo. Her song “Marc Anthony's Tune” reached No. 33 on the Billboards Hot R&B;/Hip-Hop Songs chart in July. She accepted Prince's American Music Award for Top Soundtrack after his death in 2016. ==Personal life== Nelson was married to Maurice Phillips. She had six children. Nelson died on November 4, 2024 at a hospital in Robbinsdale, Minnesota at the age of 64. == Discography == * 1988: Royal Blue (Cooltempo) * 1992: Moon Yellow, Red Sky (CMC International Records) * 2008: A Brand New Me * 2011: Hustler ==References== Category:1960 births Category:2024 deaths Category:Prince (musician) Category:Singers from Minneapolis",
 "title": "Tyka Nelson"
}