{
 "id": "627757",
 "text": "The Byzantine Greeks (or Byzantines) were the Greek people of Late Antiquity and the Middle Ages.; ; ; ; . They lived in the lands of the Byzantine Empire, then called the Eastern Roman Empire, like Greece, Asia Minor and Cyprus. They spoke medieval Greek, preserved Greek culture, obeyed Roman law and followed Eastern Christianity. Their society had peasants, traders, teachers, soldiers and priests. ==Identity== The Byzantines called themselves Romans (Romaioi), Greeks (Graikoi, Hellenes) and Christians (Christianoi) throughout their history.; ; ; ; . They used those names synonymously because they were the political heirs of the Roman Empire, the offspring of the ancient Greeks, and believers in Jesus Christ.; ; ; ; ; . The Byzantines also called everything that was not Greek \"barbarian\" and called paganism \"Hellenism\".; . ==Society== Byzantine Greek society had different classes like the poor, the peasants, the soldiers, the teachers, the merchants, and the priests.. ===Poor and peasants=== There were two groups of poor people in the Greek world since the time of Homer: the ptochos (, \"passive poor\") and the penes (, \"active poor\").. Byzantine Greek peasants lived in villages; drank wine; and ate grains, beans, fish, bread and olives.. They were hunters, fishers, bee- keepers, craftsmen, smiths, tailors and shoemakers.. ===Soldiers and teachers=== Soldiers were chosen for military duty every year and served as medics and technicians.. Their appearance, customs, habits and life were part of Greek and Roman military tradition.. Along with farmers, they ate a type of dried biscuit or hard bread, called a paximadion (originally called a boukelaton).; . Byzantine education was part of an ancient Greek educational tradition that started in the 5th century BC.. It was made up of three levels: elementary school with students aged six to ten years old, secondary school with students aged ten to sixteen years old and higher education. Literacy was much higher in the Byzantine Empire than in Western Europe. Elementary school education was widely available in places like towns and the countryside. Secondary schools were mostly in larger cities, and higher education was offered at the University of Constantinople. In elementary schools, teachers used simple fairy-tale books like Aesop's Fables.. In secondary schools, teachers used ancient Greek texts like the Iliad and the Odyssey of Homer. ===Women=== The life of a Byzantine Greek woman was split into three stages: girlhood, motherhood and widowhood.. Daily life for women included doing household and farm chores.. Poor women sometimes wore sleeveless tunics, and most wore a veil, called the maphorion, which covered their hair.. Wealthy women bought and wore silk fabrics and clothes with expensive jewelry. Some women worked as traders, clerics and teachers.. ===Traders and priests=== Byzantine Greek traders were mobile and developed new methods of investing money like the chreokoinonia.. Byzantine Greek priests were close to the rest of society and were allowed to get married except for bishops.. ==Related pages== *Byzantine art *Byzantine Empire ==References== ===Citations=== ===Sources=== * * * * * * * * * * * * * * * * * * * * Category:Greek people",
 "title": "Byzantine Greeks"
}