{
 "id": "627984",
 "text": "Tegui Carlos Calderón Rosario (Barranquilla, Colombia, February 1, 1972), better known by his stage name Tego Calderón, is a rapper, singer and actor of reguetón and hip hop puerto rican He has received prizes for his work, included a Source Award of The Source Magazine by \"International Artist of the Year\". Also he has received nominations in several ceremonies, between them the Grammy Latin, Billboard Awards, Prizes The Ours and Prizes The People. == First years == Calderón was born in Santurce, Puerto Rico. He moved to an early age of his native Puerto Rico to Miami, Florida, were assisted to Beach Senior High School. Here he was in contact with several different cultures and was a drummer in a band of rock. The band did versions of songs produced by artists like Ozzy Osbourne and Led Zeppelin. He has observed that his two parents were fans of Ismael Rivera and that his father also was interested in jazz. He was influenced by both genders and incorporated them into his music. Over time he developed a musical style that combines elements of the sauce, dancehall, and hip hop, centering in the appearances of the urban life in his letters. == Musical career == Calderón did some apparitions in albums of other musicians of reggaeton, over time signed with the stamp White Lion. In 2002, he published his first album of study titled \"El Abayarde\" the reggaeton considered at this time a gender \"underground\", the album sold 50.000 copies in his launching, establishing a record of sales for an album of Latin music. Three months after publishing The Abayarde, Calderón organised his first concert, which took place in the Coliseo Roberto Clemente in San Juan, Puerto Rico, and exhausted the place. The next day he turned into the first artist of reggaeton in making a performance in the annual meeting Puerto Rican \"Dia Nacional de La Salsa\". In August of 2003, Calderón acted in Madison Square Garden in New York. His second apparition in the place was in October of 2004, where headed an event titled \"Megatones de 2004\". The concert was exhausted, with 20.000 assistants of a mixed public of Latins and American fans. == 2005 - present == Calderón participated in the 2004 and 2005 editions of the Parade of New York, \"Rican Day\". During this period of time turned into the first Latin American artist in being included in the Power-105 of New York. In the summer of 2005, Calderón signed an agreement between Atlantic Records and his own independent stamp, Jiggiri Records, turning into the first artist of reggaeton in having a deal with an important label. == Discography == === Studio Albums === * 2003: El abayarde * 2006: The Underdog/El subestimado * 2007: El abayarde contraataca * 2015: El Que Sabe, Sabe Evolución musical 1989-2023 1989 (age 17) *Baila 1990 (age 18) *Dale Play FT. El General *Te Vez Buena RMX FT. El General, Vico C *Tu Cuerpo 1991 (age 19) *Reggae Muero *Play *El Pasaporte FT. Tito Rojas *Oh Yeah FT. Micheal Jackson *Bailando Con Calma 1992 (age 20) *No Me Voy FT. Daddy Yankee *Me Llamas FT. El General, Nando Boom *Los Ojos *Boom Boom 1993 (age 21) *Who Is The Fucker FT. Micheal Jackson *Boom Boom RMX FT. Baby Rasta & Gringo, Daddy Yankee *Problema *Te Quieren 1994 (age 22) *Ella Me Mata *1980 *Que Tire Pressure *No Te Vayas *El Party 1995 (age 23) *Feliz FT. Nicky Jam, Daddy Yankee *Si Si Si No No No *Pa La Calle FT. Hector & Tito *Extiendo *Zig Zag FT. Micheal Jackson 1996-1999 (Break) (ages 24-27) 2000 (age 28) *Con La Vida *30-30 FT. Daddy Yankee 2001 (age 29) *Reggaeton FT. Eddie Dee, Nicky Jam *En La Calle *Robot Activado *Esa Mujer FT. Nicky Jam, Daddy Yankee *Uno FT. Joe Arroyo 2002 (age 30) *Abarde Y El Dios FT. Anuel AA *Con El Cangri FT. Nicky Jam *Al Natural *La Gata FT. Yandel, Nicky Jam 2003 (age 31) *Ella Quiere Enamorarse FT. Los Dioses *No Perdona FT. Don Omar, Daddy Yankee, Ozuna *El Amante FT. Anuel AA, Zion 2004 (age 32) *Guasa Guasa RMX FT. Voltio *Al Natural RMX FT. Yandel *Praaaa FT. Arcángel *Tu Me Llamas FT. De La Ghetto, Daddy Yankee 2005 (age 33) *Como Esta FT. Eddie Dee, Joe Arroyo *Mi Libertad Reggaeton RMX FT. Jerry Rivera, Jowell & Randy 2006 (age 34) *Bandoleros FT. Don Omar *Cara FT. Voltio, Eddie Dee 2007 (age 35) *Bailando Salsa FT. Joe Arroyo *En Barranquilla Me Quedo RMX FT. Joe Arroyo *Te Lleva FT. Daddy Yankee, Ozuna 2008 (age 36) *Baby Girl FT. Sean Paul, Anuel AA *Como Te Va FT. Los Dioses, Nicky Jam 2009 (age 37) *Heights FT. Joe Arroyo *Vivir La Vida FT. Anuel AA *El Pelo *Tres *23 FT. Marc Anthony, Los Dioses 2010 (age 38) *La Proxima FT. Tito Rojas *Lo Haga Como Yo *Soy *La Ghetto 2011 (age 39) *Dios FT. Tito Nieves 2012 (age 40) *Joe Arroyo Forever FT. Tito Rojas, Marc Anthony, Chencho, Los Dioses 2013 (age 41) *Le Dijo FT. Jadiel, Ozuna, Maldy 2014 (age 42) *Sin Ella FT. Randy, Daddy Yankee *El Party FT. Voltio, Nicky Jam, Los Dioses 2015 (age 43) *Para Siempre FT. Arcángel, Nicky Jam *Doce FT. De La Ghetto, Daddy Yankee 2016 (age 44) *Me Importa Un Carajo RMX FT. Bad Bunny, Los Dioses 2017 (age 45) *Muriendo De Amor FT. Bad Bunny, Ozuna, Feid *Que FT. Feid, Yandel, Wisin, Daddy Yankee 2018 (age 46) *Adios FT. Tito Nieves *Juan Gabriel Forever FT. Marc Anthony, Tito Rojas, Yandel, Nicky Jam, Plan B, Ozuna *La Calles FT. Nicky Jam, Yandel 2019 (age 47) *Te Dan FT. Wisin & Yandel 2020 (age 48) *Frankie Ruiz Forever FT. Peso Pluma, Bad Bunny, Anuel AA, Nicky Jam, Daddy Yankee, Chencho 2021 (age 49) *Vamos A Ver FT. Los Dioses, Maldy 2022 (age 50) *Como Yo FT. Anuel AA, Lenier, Yandel *Tito Rojas Forever FT. Marc Anthony, Chencho, Anuel AA, Bad Bunny, Daddy Yankee, Feid, La India 2023 *La Receta *La Receta RMX FT. Bad Bunny, Karol G, Maluma, Feid, Yandel === Compilations === * 2004: The Enemy of the Guasíbiri * 2013: Tego Calderón - Greatest Hits === Mixtapes === * 2004: Guasa Guasa: The Mixtape (DJ Whoo Kid and Tego Calderón) * 2008: The Gongoli Mixtape * 2012: El Original Gallo del Pais - Or.G. The Mixtape == References == Category:Puerto Rican singer-songwriters Category:1972 births Category:Living people Category:Puerto Rican rappers",
 "title": "Tego Calderón"
}