{
 "id": "62809",
 "text": "The following is a list of incorporated places with the most people living in them in the United States. The United States Census Bureau says an \"incorporated place\" can have many names, such as city, town, village, borough, and municipality. A few special census-designated places (CDPs) are also in the Census Bureau's list of incorporated places. Consolidated city- counties are a type of place that includes all of a county, or something like it with a different name. Some consolidated city-counties, however, include more than one incorporated place. This list presents only that part (or \"balance\") of such consolidated city-counties that are not a part of another incorporated place. __TOC__ ==50 states and the District of Columbia== The table below lists the 346 incorporated places in the United States with more than 100,000 people living in them on July 1, 2024, as estimated by the United States Census Bureau. A city is displayed in bold if it is a state or federal capital city, and in italics if it is the city with the most people of the state. Five states—Delaware, Maine, Vermont, West Virginia and Wyoming—do not have cities with more than 100,000 people living in them. The table below shows the following things: # The city rank by population as of July 1, 2024, as estimated by the United States Census Bureau # The city name # The name of the state in which the city lies # The city population as of July 1, 2024, as estimated by the United States Census Bureau # The city population as of April 1, 2020, as counted by the 2020 United States census # The city percent population change from April 1, 2020, to July 1, 2024 # The city land area as of January 1, 2020 # The city population density as of April 1, 2020 (residents per unit of land area) # The city latitude and longitude coordinates State capital State's largest city State capital and largest city Federal capital City State 2024 estimate 2020 census Change 2020 land area 2020 land area 2020 density 2020 density Location City State 2024 estimate 2020 census Change mi2 / mi2 / Location New York NY Los Angeles CA Chicago IL Houston TX Phoenix AZ Philadelphia PA San Antonio TX San Diego CA Dallas TX Jacksonville FL Fort Worth TX San Jose CA Austin TX Charlotte NC Columbus OH Indianapolis IN San Francisco CA Seattle WA Denver CO Oklahoma City OK Nashville TN Washington DC El Paso TX Las Vegas NV Boston MA Detroit MI Louisville KY Portland OR Memphis TN Baltimore MD Milwaukee WI Albuquerque NM Tucson AZ Fresno CA Sacramento CA Atlanta GA Mesa AZ Kansas City MO Raleigh NC Colorado Springs CO Omaha NE Miami FL Virginia Beach VA Long Beach CA Oakland CA Minneapolis MN Bakersfield CA Tulsa OK Tampa FL Arlington TX Aurora CO Wichita KS Cleveland OH New Orleans LA Henderson NV Honolulu HI Anaheim CA Orlando FL Lexington KY Stockton CA Riverside CA Irvine CA Corpus Christi TX Newark NJ Santa Ana CA Cincinnati OH Pittsburgh PA Saint Paul MN Greensboro NC Jersey City NJ Durham NC Lincoln NE North Las Vegas NV Plano TX Anchorage AK Gilbert AZ Madison WI Reno NV Chandler AZ St. Louis MO Chula Vista CA Buffalo NY Fort Wayne IN Lubbock TX St. Petersburg FL Toledo OH Laredo TX Port St. Lucie FL Glendale AZ Irving TX Winston-Salem NC Chesapeake VA Garland TX Scottsdale AZ Boise ID Hialeah FL Frisco TX Richmond VA Cape Coral FL Norfolk VA Spokane WA Huntsville AL Santa Clarita CA Tacoma WA Fremont CA McKinney TX San Bernardino CA Baton Rouge LA Modesto CA Fontana CA Salt Lake City UT Moreno Valley CA Des Moines IA Worcester MA Yonkers NY Fayetteville NC Sioux Falls SD Grand Prairie TX Rochester NY Tallahassee FL Little Rock AR Amarillo TX Overland Park KS Columbus GA Augusta GA Mobile AL Oxnard CA Grand Rapids MI Peoria AZ Vancouver WA Knoxville TN Birmingham AL Montgomery AL Providence RI Huntington Beach CA Brownsville TX Chattanooga TN Fort Lauderdale FL Tempe AZ Akron OH Glendale CA Clarksville TN Ontario CA Newport News VA Elk Grove CA Cary NC Aurora IL Salem OR Pembroke Pines FL Eugene OR Santa Rosa CA Rancho Cucamonga CA Shreveport LA Garden Grove CA Oceanside CA Fort Collins CO Springfield MO Murfreesboro TN Surprise AZ Lancaster CA Denton TX Roseville CA Palmdale CA Corona CA Salinas CA Killeen TX Paterson NJ Alexandria VA Hollywood FL Hayward CA Charleston SC Macon GA Lakewood CO Sunnyvale CA Kansas City KS Springfield MA Bellevue WA Naperville IL Joliet IL Bridgeport CT Mesquite TX Pasadena TX Olathe KS Escondido CA Savannah GA McAllen TX Gainesville FL Pomona CA Rockford IL Thornton CO Waco TX Visalia CA Syracuse NY Columbia SC Midland TX Miramar FL Palm Bay FL Lakewood NJ Jackson MS Coral Springs FL Victorville CA Elizabeth NJ Fullerton CA Meridian ID Torrance CA Stamford CT West Valley City UT Orange CA Cedar Rapids IA Warren MI Hampton VA New Haven CT Pasadena CA Kent WA Dayton OH Fargo ND Lewisville TX Carrollton TX Round Rock TX Sterling Heights MI Santa Clara CA Norman OK Columbia MO Abilene TX Pearland TX Athens GA College Station TX Clovis CA West Palm Beach FL Allentown PA North Charleston SC Simi Valley CA Topeka KS Wilmington NC Lakeland FL Thousand Oaks CA Concord CA Rochester MN Vallejo CA Ann Arbor MI Broken Arrow OK Fairfield CA Lafayette LA Hartford CT Arvada CO Berkeley CA Independence MO Billings MT Cambridge MA Lowell MA Odessa TX High Point NC League City TX Antioch CA Richardson TX Goodyear AZ Pompano Beach FL Nampa ID Menifee CA Las Cruces NM Clearwater FL West Jordan UT New Braunfels TX Manchester NH Miami Gardens FL Waterbury CT Provo UT Evansville IN Richmond CA Westminster CO Elgin IL Conroe TX Greeley CO Lansing MI Buckeye AZ Tuscaloosa AL Allen TX Carlsbad CA Everett WA Springfield IL Beaumont TX Murrieta CA Rio Rancho NM Temecula CA Concord NC Tyler TX Davie FL South Fulton GA Peoria IL Sparks NV Gresham OR Santa Maria CA Pueblo CO Hillsboro OR Edison NJ Sugar Land TX Ventura CA Downey CA Costa Mesa CA Centennial CO Edinburg TX Spokane Valley WA Jurupa Valley CA Bend OR West Covina CA Boulder CO Palm Coast FL Lee's Summit MO Dearborn MI Green Bay WI St. George UT Woodbridge NJ Brockton MA Renton WA Sandy Springs GA Rialto CA El Monte CA Vacaville CA Fishers IN South Bend IN Carmel IN Yuma AZ Burbank CA Lynn MA Quincy MA El Cajon CA Fayetteville AR Suffolk VA San Mateo CA Chico CA Inglewood CA Wichita Falls TX Boca Raton FL Hesperia CA Daly City CA Clinton MI Georgetown TX New Bedford MA Albany NY Davenport IA Plantation FL Deltona FL Federal Way WA San Angelo TX Tracy CA Sunrise FL ===Where they are=== State Number of listed cities CA 76 TX 44 FL 27 AZ 13 CO 12 NC, WA 10 MA 9 GA, IL, MI, VA 8 NJ 7 IN, MO, NY, OH, OR, TN 6 AL, CT, KS, NV, UT 5 LA, OK 4 IA, ID, MN, NM, PA, SC, WI 3 AR, KY, NE 2 AK, DC, HI, MD, MS, MT, ND, NH, RI, SD 1 DE, ME, VT, WV, WY 0 ===Gallery=== ==Puerto Rico== The table below lists the five municipalities () of Puerto Rico with more than 100,000 people living in them on July 1, 2024, as estimated by the United States Census Bureau. If Puerto Rico were included with the broader U.S. list, San Juan would be the 59th largest city in the country. The table below contains the following information: # The municipio rank by population as of July 1, 2024, as estimated by the United States Census Bureau # The municipio # The municipio population as of July 1, 2024, as estimated by the United States Census Bureau # The municipio population as of April 1, 2020, as counted by the 2020 United States census # The municipio percent population change from April 1, 2020, to July 1, 2024 # The municipio land area as of January 1, 2020 # The municipio population density as of April 1, 2020 (residents per land area) # The municipio latitude and longitude coordinates Municipio 2024 estimate 2020 census Change 2020 land area 2020 land area 2020 density 2020 density Location San Juan Bayamón Carolina Ponce Caguas ==Cities that used to have 100,000 people== The table below lists U.S. cities that, in past censuses, have had more than 100,000 people living in them, but do not anymore. Some of these cities were merged into another city. The table below contains the following information: # Name of city # Name of state # The city population as of July 1, 2024, as estimated by the United States Census Bureau # The city's peak population based on highest official enumeration recorded by the census # The percent decline in population from its peak census count to the 2024 estimate # The year of the highest recorded population # Additional notes City State 2024 estimate Peak population % decline from peak Peak year Allegheny PA NA 129,896 NA 1907 Brooklyn NY NA 806,343 NA 1898 Camden NJ 1950 Canton OH 1950 Citrus Heights CA 1990 Duluth MN 1960 Erie PA 1960 Fall River MA 1920 Flint MI 1960 Gary IN 1960 Hammond IN 1960 Livonia MI 1970 Niagara Falls NY 1960 Norwalk CA 2010 Parma OH 1970 Portsmouth VA 1960 Reading PA 1930 Roanoke VA 1980 Scranton PA 1930 Somerville MA 1930 St. Joseph MO 1900 Trenton NJ 1950 Utica NY 1930 Wilmington DE 1940 Youngstown OH 1930 ==Notes and references== ===Notes=== ===References=== ==Other websites== * United States Government ** United States Census Bureau ** United States Office of Management and Budget Category:Lists of cities in the United States",
 "title": "List of United States cities by population"
}