{
 "id": "62826",
 "text": "Just like the other 49 American states, Massachusetts has its own governor. The current governor is Maura Healey. She is a member of the Democratic Party. The first governor of Massachusetts was John Hancock. == Commonwealth of Massachusetts: 1780–present == This is a complete list of governors of the Commonwealth of Massachusetts. Acting governors, denoted as \"A\" instead of numbered, are included when the Governor resigned or died. Acting governors show a vacancy in the lieutenant governorship. They remain as Lieutenant Governors and merely act as governor. Lieutenant governors in Massachusetts do not ascend to the governorship upon death or resignation of their predecessor. Political party Number of governors Democratic 20 Democratic-Republican 6 Federalist 3 Know Nothing 1 National Republican 1 No party affiliation 6 Republican 31 Whig 7 # Governor Party Years Lt. governor Electoral history 1 John Hancock None October 25, 1780 – February 17, 1785 Thomas Cushing Resigned due to claimed illness (recurring gout). AActing governors are not counted. Thomas Cushing None February 17, 1785 – May 27, 1785 Thomas Cushing Acted as governor for the remainder of Hancock's term. Lost election in his own right. 2 James Bowdoin None May 27, 1785 – May 30, 1787 Thomas Cushing Lost re-election. 3 John Hancock None May 30, 1787 – October 8, 1793 Thomas Cushing Died. 3 Benjamin Lincoln None May 30, 1787 – October 8, 1793 Died. 3 Samuel Adams None May 30, 1787 – October 8, 1793 Died. 4 Samuel Adams Samuel Adams None October 8, 1793 – June 2, 1797 Acted as governor for the remainder of Hancock's term. Elected and re-elected in his own right until retirement. 4 Moses Gill None October 8, 1793 – June 2, 1797 Acted as governor for the remainder of Hancock's term. Elected and re-elected in his own right until retirement. 5 Moses Gill Increase Sumner Federalist June 2, 1797 – June 7, 1799 Died. Moses Gill Moses Gill None June 7, 1799 – May 20, 1800 Acted as governor for most of the remainder of Sumner's term. Died ten days before its end. Governor's Council None May 20, 1800 – May 30, 1800 None. The council was headed by Thomas Dawes. this is the only time both the governorship and the lieutenant governorship were vacant. 6 Caleb Strong Federalist May 30, 1800 – May 29, 1807 Samuel Phillips Jr. Lost re-election. 6 Edward Robbins Federalist May 30, 1800 – May 29, 1807 Lost re-election. 7 James Sullivan Democratic- Republican May 29, 1807 – December 10, 1808 Levi Lincoln Sr. Died. Levi Lincoln Sr. Democratic- Republican December 10, 1808 – May 1, 1809 Levi Lincoln Sr. Acted as governor for the remainder of Sullivan's term. Lost election in his own right. 8 Christopher Gore Federalist May 1, 1809 – June 10, 1810 David Cobb Lost re-election. 9 Elbridge Gerry Democratic- Republican June 10, 1810 – June 5, 1812 William Gray Lost re-election. 10 Caleb Strong Federalist June 5, 1812 – May 30, 1816 William Phillips Jr. Retired. 11 John Brooks Federalist May 30, 1816 – May 31, 1823 William Phillips Jr. Retired. 12 William Eustis Democratic- Republican May 31, 1823 – February 6, 1825 Levi Lincoln Jr. Died. 12 Marcus Morton Democratic- Republican May 31, 1823 – February 6, 1825 Died. Marcus Morton Marcus Morton Democratic- Republican February 6, 1825 – May 26, 1825 Acted as governor for the remainder of Eustis's term. Retired. 13 Levi Lincoln Jr. National Republican May 26, 1825 – January 9, 1834 Thomas L. Winthrop Retired. 14 John Davis Whig January 9, 1834 – March 1, 1835 Samuel Turell Armstrong Resigned to become US Senator. Samuel Turell Armstrong Whig March 1, 1835 – January 13, 1836 Samuel Turell Armstrong Acted as governor for the remainder of Davis's term. Lost nomination. lost election as independent. 15 Edward Everett Whig January 13, 1836 – January 18, 1840 George Hull Lost re-election 16 Marcus Morton Democratic January 18, 1840 – January 7, 1841 George Hull Lost re-election. 17 John Davis Whig January 7, 1841 – January 17, 1843 George Hull Lost re-election. 18 Marcus Morton Democratic January 17, 1843 – January 9, 1844 Henry H. Childs Lost re-election. 19 George N. Briggs Whig January 9, 1844 – January 11, 1851 John Reed Jr. Lost re-election. 20 George S. Boutwell Democratic January 11, 1851 – January 14, 1853 Henry W. Cushman Retired. 21 John H. Clifford Whig January 14, 1853 – January 12, 1854 Elisha Huntington Retired. 22 Emory Washburn Whig January 12, 1854 – January 4, 1855 William C. Plunkett Lost re-election. 23 Henry Gardner Know-Nothing January 4, 1855 – January 7, 1858 Simon Brown Lost re-election. 23 Henry W. Benchley Know-Nothing January 4, 1855 – January 7, 1858 Lost re-election. 24 Nathaniel Prentice Banks Republican January 7, 1858 – January 3, 1861 Eliphalet Trask Retired to run for president. 25 John Albion Andrew Republican January 3, 1861 – January 4, 1866 John Z. Goodrich Retired. 25 John Nesmith Republican January 3, 1861 – January 4, 1866 Retired. 25 Joel Hayden Republican January 3, 1861 – January 4, 1866 Retired. 26 Alexander H. Bullock Republican January 4, 1866 – January 7, 1869 William Claflin Retired. 27 William Claflin Republican January 7, 1869 – January 4, 1872 Joseph Tucker Retired. 28 William B. Washburn Republican January 4, 1872 – April 29, 1874 Joseph Tucker Resigned to become US Senator. 28 Thomas Talbot Republican January 4, 1872 – April 29, 1874 Resigned to become US Senator. Thomas Talbot Thomas Talbot Republican April 29, 1874 – January 7, 1875 Acted as governor for the remainder of Washburn's term. Lost election in his own right. 29 William Gaston Democratic January 7, 1875 – January 6, 1876 Horatio G. Knight Lost re-election. 30 Alexander H. Rice Republican January 6, 1876 – January 2, 1879 Horatio G. Knight Retired. 31 Thomas Talbot Republican January 2, 1879 – January 8, 1880 John Davis Long Retired. 32 John Davis Long Republican January 8, 1880 – January 4, 1883 Byron Weston Retired. 33 Benjamin F. Butler Democratic January 4, 1883 – January 3, 1884 Oliver Ames Lost re-election. 34 George D. Robinson Republican January 3, 1884 – January 6, 1887 Oliver Ames Retired. 35 Oliver Ames Republican January 6, 1887 – January 7, 1890 John Q. A. Brackett Retired. 36 John Q. A. Brackett Republican January 7, 1890 – January 8, 1891 William H. Haile Lost re-election. 37 William E. Russell Democratic January 8, 1891 – January 4, 1894 William H. Haile Retired. 37 Roger Wolcott Democratic January 8, 1891 – January 4, 1894 Retired. 38 Roger Wolcott Frederic T. Greenhalge Republican January 4, 1894 – March 5, 1896 Died. 39 Roger Wolcott Roger Wolcott Republican March 5, 1896 – January 4, 1900 Acted as governor for the remainder of Greenhalge's term. Elected and re-elected in own right until retirement. 39 Winthrop Murray Crane Republican March 5, 1896 – January 4, 1900 Acted as governor for the remainder of Greenhalge's term. Elected and re-elected in own right until retirement. 40 Winthrop Murray Crane Republican January 4, 1900 – January 8, 1903 John L. Bates Retired. 41 John L. Bates Republican January 8, 1903 – January 5, 1905 Curtis Guild Jr. Retired. 42 William L. Douglas Democratic January 5, 1905 – January 4, 1906 Curtis Guild Jr. Retired. 43 Curtis Guild Jr. Republican January 4, 1906 – January 7, 1909 Eben Sumner Draper Retired. 44 Eben Sumner Draper Republican January 7, 1909 – January 5, 1911 Louis A. Frothingham Lost re-election. 45 Eugene Noble Foss Democratic January 5, 1911 – January 8, 1914 Louis A. Frothingham Did not stand for renomination as Democrat. defeated as independent in general election. 45 Robert Luce Democratic January 5, 1911 – January 8, 1914 Did not stand for renomination as Democrat. defeated as independent in general election. 45 David I. Walsh Democratic January 5, 1911 – January 8, 1914 Did not stand for renomination as Democrat. defeated as independent in general election. 46 David I. Walsh Democratic January 8, 1914 – January 6, 1916 Edward P. Barry Lost re-election. 46 Grafton D. Cushing Democratic January 8, 1914 – January 6, 1916 Lost re-election. 47 Samuel W. McCall Republican January 6, 1916 – January 2, 1919 Calvin Coolidge Retired. 48 Calvin Coolidge Republican January 2, 1919 – January 6, 1921 Channing H. Cox Retired Vice President of the United States 1921-1923 President of the United States 1923-1929 49 Channing H. Cox Republican January 6, 1921 – January 8, 1925 Alvan T. Fuller Elected in 1920 (first two-year term). Re-elected in 1922. Retired. 50 Alvan T. Fuller Republican January 8, 1925 – January 3, 1929 Frank G. Allen Retired. 51 Frank G. Allen Republican January 3, 1929 – January 8, 1931 William S. Youngman Lost re-election. 52 Joseph B. Ely Democratic January 8, 1931 – January 3, 1935 William S. Youngman Retired. 52 Gaspar G. Bacon Democratic January 8, 1931 – January 3, 1935 Retired. 53 James Michael Curley Democratic January 3, 1935 – January 7, 1937 Joseph L. Hurley Retired to run unsuccessfully for U.S. Senate 54 Charles F. Hurley Democratic January 7, 1937 – January 5, 1939 Francis E. Kelly Lost renomination. 55 Leverett Saltonstall Republican January 5, 1939 – January 4, 1945 Horace T. Cahill Retired to run successfully for U.S. Senate 56 Maurice J. Tobin Democratic January 4, 1945 – January 2, 1947 Robert F. Bradford Lost re-election. 57 Robert F. Bradford Republican January 2, 1947 – January 6, 1949 Arthur W. Coolidge Elected in 1946. Lost re-election. 58 Paul A. Dever Democratic January 6, 1949 – January 8, 1953 Charles F. Sullivan Elected in 1948. Re-elected in 1950. Lost re-election. 59 Christian A. Herter Republican January 8, 1953 – January 3, 1957 Sumner G. Whittier Elected in 1952. Re-elected in 1954. Retired. 60 Foster Furcolo Democratic January 3, 1957 – January 5, 1961 Robert F. Murphy Elected in 1956. Re-elected in 1958. Retired to run for U.S. Senator. 61 John Volpe Republican January 5, 1961 – January 3, 1963 Edward F. McLaughlin Jr. Elected in 1960. Lost re-election. 62 Endicott Peabody Democratic January 3, 1963 – January 7, 1965 Francis Bellotti Elected in 1962. Lost renomination. 63 John Volpe Republican January 7, 1965 – January 22, 1969 Elliot Richardson Elected in 1964. Re-elected in 1966 (first four-year term). Resigned to become U.S. Secretary of Transportation. 63 Francis Sargent Republican January 7, 1965 – January 22, 1969 Elected in 1964. Re-elected in 1966 (first four-year term). Resigned to become U.S. Secretary of Transportation. 64 Francis Sargent Francis Sargent Republican January 22, 1969 – January 2, 1975 Acted as governor for the remainder of Volpe's term. Elected in own right in 1970. Lost re-election. 64 Donald Dwight Republican January 22, 1969 – January 2, 1975 Acted as governor for the remainder of Volpe's term. Elected in own right in 1970. Lost re-election. 65 Michael Dukakis Democratic January 2, 1975 – January 4, 1979 Thomas P. O'Neill III Elected in 1974. Lost renomination. 66 Edward J. King Democratic January 4, 1979 – January 6, 1983 Thomas P. O'Neill III Elected in 1978. Lost renomination. 67 Michael Dukakis Democratic January 6, 1983 – January 3, 1991 John Kerry Elected in 1982. Elected in 1986. Retired. 67 Vacant Democratic January 6, 1983 – January 3, 1991 Elected in 1982. Elected in 1986. Retired. 67 Evelyn Murphy Democratic January 6, 1983 – January 3, 1991 Elected in 1982. Elected in 1986. Retired. 68 Bill Weld Republican January 3, 1991 – July 29, 1997 Paul Cellucci Elected in 1990. Re-elected in 1994. Resigned when nominated U.S. Ambassador to Mexico, but was not confirmed to the office. 69 Paul Cellucci Republican July 29, 1997 – April 10, 2001 Paul Cellucci Acted as governor for the remainder of Weld's term. Elected in own right in 1998. Resigned to become U.S. Ambassador to Canada. 69 Jane Swift Republican July 29, 1997 – April 10, 2001 Acted as governor for the remainder of Weld's term. Elected in own right in 1998. Resigned to become U.S. Ambassador to Canada. Jane Swift Jane Swift Republican April 10, 2001 – January 2, 2003 Acted as governor for the remainder of Cellucci's term. Retired. 70 Mitt Romney Republican January 2, 2003 – January 4, 2007 Kerry Healey Elected in 2002. Retired. 71 Deval Patrick Democratic January 4, 2007 – January 8, 2015 Tim Murray Elected in 2006. Re-elected in 2010. Retired. 71 Vacant Democratic January 4, 2007 – January 8, 2015 Elected in 2006. Re-elected in 2010. Retired. 72 Charlie Baker Republican January 8, 2015 – January 5, 2023 Karyn Polito Elected in 2014. Re-elected in 2018. Retired. 73 Maura Healey Democratic January 5, 2023 – present. Kim Driscoll Elected in 2022. ==References== Massachusetts Category:Politicians from Massachusetts",
 "title": "Governor of Massachusetts"
}