{
 "id": "628380",
 "text": "Ronny Lynn Jackson (born May 4, 1967) is an American politician and medical doctor. He is the U.S. Representative from Texas since 2021. He is a member of the Republican Party. He was the Physician to the President, and United States Navy Rear admiral. Jackson was first appointed to the role of physician to the President on July 25, 2013, by Barack Obama, he was re-hired by Donald Trump after his election in 2016. He stepped down from the position on April 28, 2018. On March 28, 2018, President Trump announced his plans to nominate Jackson as United States Secretary of Veterans Affairs, replacing David Shulkin. On April 26, 2018, Jackson withdrew his nomination as Secretary of Veterans Affairs. In December 2019, he announced his plans to run for the United States House of Representatives in Texas during the 2020 election. He won the election in November 2020. ==Early life== Jackson was born Levelland, Texas. He studied at Texas A&M; University and at the University of Texas Medical Branch. ==Career== Jackson began his active duty naval service in 1995 at Naval Medical Center Portsmouth, where he completed his internship in Transitional Medicine. In 2001, Jackson returned to Portsmouth Naval Medical Center to begin his residency in emergency medicine, finishing at the top of his class and receiving the honor graduate designation. In 2006, while in Iraq, Jackson was selected as a White House physician. Since arriving at the White House, he has directed the Executive Health Care for the President’s Cabinet and Senior Staff, served as physician supervisor for the Camp David Presidential Retreat, held the position of physician to the White House and led the White House Medical Unit as its director. In July 2013, President Barack Obama hired Jackson to be his personal physician. In 2016, President- elect Donald Trump said he would re-hire Jackson to remain as his personal physician as well. He was nominated to the rank of rear admiral (upper half) on March 23, 2018. He resigned from the position on April 28, 2018. ==United States Secretary of Veterans Affairs nomination== On March 28, 2018, Trump fired Secretary David Shulkin and Jackson was selected by Trump as Secretary of Veterans Affairs. On April 26, 2018, Jackson withdrew his nomination as Secretary of Veterans Affairs amidst widely publicized allegations of misconduct and mismanagement while serving in the White House. ==2020 congressional campaign== On December 9, he filed to run as a Republican for Congress in Texas's 13th congressional district. He won the Republican primary and eventually won the November 2020 election. Steven Shepard and James Arkin, \"Takeaways from Tuesday’s primaries\" Politico July 15, 2020. ==References== ==Other websites== * * Appearances on C-SPAN Category:1967 births Category:Living people Category:United States representatives from Texas Category:American physicians Category:Military people from Texas Category:Republican Party (United States) politicians",
 "title": "Ronny Jackson"
}