{
 "id": "62840",
 "text": "{{Infobox writer |name = Beverly Cleary |birth_name = Beverly Atlee Bunn |birth_date = |birth_place = McMinnville, Oregon, U.S. |death_date = |death_place = Carmel-by-the-Sea, California, U.S. Unknown causes |occupation = Writer, librarian |spouse = |period = |genre = Realist children's books, autobiography |movement = |awards = |website = }} Beverly Atlee Cleary (née Bunn; April 12, 1916March 25, 2021) was an American children's writer. She was the author of over 80 books for young adults and children. Her characters are normal children facing challenges of growing up, and her stories are filled with humour. Some of her best known and loved characters are Ramona Quimby and her sister Beatrice (\"Beezus\"), Henry Huggins, Ralph S. Mouse, and Ribsy. ==Biography== Beverly Cleary was born Beverly Atlee Bunn in McMinnville, Oregon. When she was 6, her family moved to Portland, Oregon, where she went to grammar and high school. She was slow in learning to read, partly because she did not like the books the school wanted her to read, and partly due to an unkind first grade teacher. It was not until she was in third grade that she found enjoyment from books, when she started reading The Dutch Twins by Lucy Fitch Perkins. From then on, she visited the library often, though she rarely found the books she most wanted to read — those about children like herself. In 1934, she moved to Ontario, California to attend Chaffey College, from which she earned an Associate of Arts diploma. She then moved to Berkeley to major in English at the University of California. After graduating with a B.A in English in 1938, she studied at the School of Librarianship at the University of Washington in Seattle, where she earned a degree in librarianship in 1939. Her first job was as a librarian in Yakima, Washington, where she met many children who were looking for the same books that she had always hoped to find as a child herself. In response, she wrote her first book which was published in 1950. Beezus and Ramona, Cleary's first novel to feature the Quimby sisters as the central focus of the story, was published in 1955, although Beezus and Ramona made frequent appearances in the Henry Huggins series as supporting characters. In 1940 she married Clarence T. Cleary and they moved to Oakland, California. The Clearys became parents to a set of twins, Marianne Elisabeth and Malcolm James, in 1955. Clarence Cleary died in 2004. She also wrote two autobiographies, A Girl from Yamhill and My Own Two Feet. Cleary celebrated her 100th birthday on April 12, 2016. On March 25, 2021, Cleary died in Carmel-by-the-Sea, California, 18 days before her 105th birthday. ==Career== Her books are available in 14 languages in over 20 countries. She has won many awards, including the 1984 Newbery Medal for her book Dear Mr. Henshaw and the Laura Ingalls Wilder Award in 1975. Cleary received the Library of Congress Living Legends award in the \"Writers and Artists\" category in April 2000 for her major contributions to America's cultural heritage. ==Honors== The Hollywood location of the Multnomah County library, near where she lived as a child, has created a map on their lobby wall of Henry Huggins' Klickitat Street neighborhood. Statues of her beloved characters Ramona, Henry Huggins, and the Huggins' dog Ribsy can be found in Grant Park in Portland, Oregon. In 2004, the University of Washington's Information School completed fundraising for a Beverly Cleary Endowed Chair for Children and Youth Services to remember her work and commitment to librarianship. She has a dorm at University of California, Berkeley named after her. ==Books written by Beverly Cleary== *Henry Huggins (illus. by Louis Darling) - (1950) *Ellen Tebbits (illus. by Louis Darling) - (1951) *Henry and Beezus (illus. by Louis Darling) - (1952) *Otis Spofford (illus. by Louis Darling) - (1953) *Henry and Ribsy (illus. by Louis Darling) - (1954) *Beezus and Ramona (illus. by Louis Darling) - (1955) *Fifteen (illus. by Joe and Beth Krush) - (1956) *Henry and the Paper Route (illus. by Louis Darling) - (1957) *The Luckiest Girl - (1958) *Jean and Johnny (illus. by Joe and Beth Krush) - (1959) *The Hullabaloo ABC (illus. by Earl Thollander) - (1960) *Two Dog Biscuits (illus. by ? ?) - (1961) (companion to The Real Hole) *Henry and the Clubhouse (illus. by Louis Darling) - (1962) *Sister of the Bride (illus. by Joe and Beth Krush) - (1963) *Ribsy (illus. by Louis Darling) - (1964) *The Mouse and the Motorcycle (illus. by Louis Darling) - (1965) *Mitch and Amy (illus. by Bob Marstall) - (1967) *Ramona the Pest (illus. by Louis Darling) - (1968) *Runaway Ralph (illus. by Louis Darling) - (1970) *Socks (illus. by Beatrice Darwin) - (1973) *Ramona the Brave (illus. by Alan Tiegreen) - (1975) *Ramona and Her Father (illus. by Alan Tiegreen) - (1977) *Ramona and Her Mother (illus. by Alan Tiegreen) - (1979) *Ramona Quimby, Age 8 (illus. by Alan Tiegreen) - (1981) *Ralph S. Mouse (illus. by Paul O. Zelinsky) - (1982) *Dear Mr. Henshaw (illus. by Paul O. Zelinsky) - (1983) *Ramona Forever (illus. by Alan Tiegreen) - (1984) *Lucky Chuck (illus. by J. Winslow Higginbottom) - (1984) *Two Dog Biscuits (illus. by DyAnne Disalvo-Ryan) - (1986) (companion to The Real Ho) *A Girl from Yamhill: A Memoir - (1988) *Muggie Maggie (illus. by Kay Life) - (1990) *Strider (illus. by Paul O. Zelinsky) - (1991) *Petey's Bedtime Story (illus. by David Small) - (1993) *My Own Two Feet - (1995) *The Hullabaloo ABC (illus. by Ted Rand) - (1998) *Ramona's World (illus. by Alan Tiegreen) - (1999) ==References== ==Other websites== * Grant Park statues * The world of Beverly Cleary * Educational Paperback Assn. author profile * Beverly Cleary, Age 90 (2006 Newsweek Interview) * Beverly Cleary, Getting the Best Out of Her 'Pest' (2006 NPR Interview) Category:1916 births Category:2021 deaths Category:American centenarians Category:American children's writers Category:American autobiographers Category:Writers from Oregon",
 "title": "Beverly Cleary"
}