{
 "id": "62933",
 "text": "Levon Mkrtchyan, (, ; born 25 February 1953, in Gyumri) is an Armenian movie director known for his documentaries The Muses, Paruyr Sevag, Hovhannes Shiraz, Mashtoc, And There Was Light, A Transcript for Independence, and many more. He studied in the Directing Department of the Yerevan Fine Arts and Theater Institute. In 1978, he released his debut short movie The Muses. In 1984, he graduated from the Directing Department of VGIK in Moscow. Since 1978, he has shot thirty-three documentaries. He filmed and has an incredible archive about well known Armenians, including the only film footage on Hovhannes Shiraz, incredible footage on Charles Aznavour visiting Armenia after the 1988 earthquake, the funeral of William Saroyan. Levon Mkrtchyan continues his contribution to the Armenian people by making more documentaries about the well known Armenians.1993 The Armenian Kingdom of Kilikia Footage includes the President of France - Francois Mitterand The President of Armenia - Levon Ter-Petrosyan. “Hayk” Studio of Documental movies is currently working on a documentary about William Saroyan, dedicated to the renowned Armenian American writer’s 100th Anniversary. The director of the movie is Levon Mkrtchyan, an accomplished and famous Armenian movie director who is known for his biographical documentaries about people who have had a great impact in the history of the Armenian nation (Jansem, Hovhannes Shiraz, Davit Anhaght, My Komitas). The filming will take place in the United States where William Saroyan was born and has lived most of his life. Additional filming will take place in France, Turkey, Russia and Armenia. Mr. Mkrtchyan already has an original footage from William Saroyan’s funeral ceremony which has taken place in Armenia. The narration of the movie is going to be offered to Al Pacino. “Hayk” Studio of Documental movies will collaborate with producers in the United States, to bring this exceptional project to life. ==Filmography== *1980: David the Invincible (David Anhaght) * 1983: On the Path to Eternity, Armenfilm (Hovhannes Shiraz) * 1984: Tcovasar Verin Sasnashen,(Armenian music group) *1984: Paruyr Sevak The composer Sarkis Alajajyan https://www.youtube.com/watch?v=_uMokKYvkNE *1986: My Komitas (Hovhannes Chekijian) *1987: Gyumri (Leninakan), (narration by Azat Gasparyan) *1987: Charents - Known and Unknown Sides (Yeghishe Charents) *1988: Armenia 1988 *1988: Mashtots (narration by Sos Sargisyan) *1989: Charles Aznavour Armenia 1989 *1990: General Andranik |Andranik Ozanian|.A movie about the great Armenian General Andranik Ozanian,who was the national hero of Armenia. (narration by Khoren Abrahamyan) *2001: And There Was Light,1700 years of Christian Armenia,script by Hakop Soghomonyan and Levon Mkrtchyan, Producer Nare Mkrtchyan, the editor Hrachuhi Taturyan,Our Father in heaven,narration by Sos Sargsyan *2002: The Manuscript of Indepedence, Մատյան Անկախության - (Levon Ter-Petrosyan,Robert Kocharyan,Serj Sargsyan) https://www.youtube.com/watch?v=QMA6La6tiCU *2005: Hovhannes Shiraz: A Documentary film Levon Mkrtchyan Հովհաննես Շիրազ / Hovhannes Shiraz / Оганес Шираз /Aik, Lion Hart, 43min. USA ==TV movies== *1993: Armenian Kingdom of Kilikia,script by Hrachuhi Taturyan. ( President Francois Mitteran, president Levon Ter Petrosian, professor Clode Mutafian,painter Jean Garzu,Charles Aznavour). *http://www.youtube.com/watch?v=NsKWT0u68Gw *http://www.youtube.com/watch?v=Mn7dzBWShtw * 1996: 5 years in Armenia - Loris Tjeknavorian Gyumri,Yerevan * 1991: Pilgrimage To Gyumri https://www.youtube.com/watch?v=pPp1mMfSKro https://www.youtube.com/watch?v=N9LrzZQGJ_w https://www.youtube.com/watch?v=O77oh_HyQIA * 2000: Rostam and Sohrab - conductor Loris Tjeknavorian, the son Charli Chaplin,Ararat hom Tehran, Iran * 2007: We Love Armenia ( DSA ARMENIA USA ) ==Literature== * - Les DOCUMENTARY Films of the ARMENIAN SOVIET Republic - Berlin,Germany 1990 * - ARMENIAN ASSOCIATION of FILM - CRITICS and Film|CINEMA - JURNALISTS 1924-1999, Yerevan * - Toros Toranyan - Armenia, Halepo, Syria 1998 ==References== ==Other websites== *http://www.arm-cinema.am/personalities/Directors/index.htm *http://video.google.com/videoplay?docid=-5259207171967580050# *http://www.youtube.com/watch?v=QMA6La6tiCU *http://www.youtube.com/results?search_query=Director+Levon+Mkrtchyan&aq;=f *http://armsoul.com/index.php?topic=93.0 *http://torrent.arut.ru/viewtopic.php?t=618&sid;=92577c011a38048391b856b96631b060 Category:1953 births Category:Living people Category:Armenian movie directors Category:21st-century Armenian people Category:20th-century Armenian people",
 "title": "Levon Mkrtchyan"
}