{
 "id": "62930",
 "text": "{{Infobox settlement | settlement_type = Historical region | image_map = Silesia-map.svg | image_flag = Flag of Silesia.svg | mapsize = 250px | map_caption = Basemap shows modern national borders. | image_shield = | coordinates = | subdivision_type = Country | subdivision_name = | seat_type = Largest city | seat = Wrocław | area_total_km2 = 40000 | population_total = c. 8000000 | population_density_km2 = auto | timezone = CET | utc_offset = +1 | timezone_DST = CEST | utc_offset_DST = +2 }} Silesia (; ; ; Silesian: Ślůnsk) is a historical region of Poland. From 1742 to 1945, it was a province in the east of Prussia and later Germany. In 1945, all of Poland was occupied by the Soviet Red Army. In the following years, the communist occupant enacted laws that in effect chased away all of the remaining owners. == Geography == Silesia is along the upper and middle Oder River, upper Vistula River, and along the Sudetes and the Carpathian Mountains. The highest point of Silesia is the Śnieżka, in the Sudetes. === Cities === Here is a list of cities in Silesia with a population of over 20,000 in 2015: Name Population Area Country Administrative Historic subregion 1 Wrocław 632,067 Lower Silesian Voivodeship Lower Silesia 2 Katowice 304,362 Silesian Voivodeship Upper Silesia 3 Ostrava* 287,968 Moravian-Silesian Region Czech Silesia/Moravia 4 Gliwice 185,450 Silesian Voivodeship Upper Silesia 5 Zabrze 178,357 Silesian Voivodeship Upper Silesia 6 Bielsko-Biała* 173,699 Silesian Voivodeship Upper Silesia/Lesser Poland 7 Bytom 173,439 Silesian Voivodeship Upper Silesia 8 Ruda Śląska 141,521 Silesian Voivodeship Upper Silesia 9 Rybnik 140,173 Silesian Voivodeship Upper Silesia 10 Tychy 128,799 Silesian Voivodeship Upper Silesia 11 Opole 120,146 Opole Voivodeship Upper Silesia 12 Zielona Góra 118,405 Lubusz Voivodeship Lower Silesia 13 Wałbrzych 117,926 Lower Silesian Voivodeship Lower Silesia 14 Chorzów 110,761 Silesian Voivodeship Upper Silesia 15 Legnica 101,992 Lower Silesian Voivodeship Lower Silesia 16 Jastrzębie-Zdrój 91,235 Silesian Voivodeship Upper Silesia 17 Jelenia Góra 81,985 Lower Silesian Voivodeship Lower Silesia 18 Mysłowice 75,129 Silesian Voivodeship Upper Silesia 19 Lubin 74,053 Lower Silesian Voivodeship Lower Silesia 20 Havířov 71,200 Moravian-Silesian Region Czech Silesia 21 Głogów 68,997 Lower Silesian Voivodeship Lower Silesia 22 Siemianowice Śląskie 68,844 Silesian Voivodeship Upper Silesia 23 Kędzierzyn-Koźle 63,194 Opole Voivodeship Upper Silesia 24 Żory 62,038 Silesian Voivodeship Upper Silesia 25 Tarnowskie Góry 60,957 Silesian Voivodeship Upper Silesia 26 Świdnica 59,182 Lower Silesian Voivodeship Lower Silesia 27 Opava 57,676 Moravian-Silesian Region Czech Silesia 28 Piekary Śląskie 57,148 Silesian Voivodeship Upper Silesia 29 Frýdek-Místek* 56,450 Moravian-Silesian Region Czech Silesia/Moravia 30 Racibórz 55,930 Silesian Voivodeship Upper Silesia 31 Görlitz** 55,255 Free State of Saxony Historically part of Lusatia, Görlitz was considered part of Lower Silesia in years 1319–1329 and 1815–1945 32 Karviná 52,128 Moravian-Silesian Region Czech Silesia 33 Świętochłowice 51,824 Silesian Voivodeship Upper Silesia 34 Wodzisław Śląski 48,731 Silesian Voivodeship Upper Silesia 35 Nysa 44,899 Opole Voivodeship Lower Silesia 36 Mikołów 39,776 Silesian Voivodeship Upper Silesia 37 Nowa Sól 39,721 Lubusz Voivodeship Lower Silesia 38 Bolesławiec 39,603 Lower Silesian Voivodeship Lower Silesia 39 Knurów 39,090 Silesian Voivodeship Upper Silesia 40 Oleśnica 37,303 Lower Silesian Voivodeship Lower Silesia 41 Brzeg 36,980 Opole Voivodeship Lower Silesia 42 Cieszyn 35,918 Silesian Voivodeship Upper Silesia 43 Czechowice-Dziedzice 35,684 Silesian Voivodeship Upper Silesia 44 Třinec 35,002 Moravian-Silesian Region Czech Silesia 45 Dzierżoniów 34,428 Lower Silesian Voivodeship Lower Silesia 46 Hoyerswerda/Wojerecy** 33,843 Free State of Saxony Historically part of Lusatia, Hoyerswerda was considered part of Lower Silesia in years 1825–1945 47 Oława 32,240 Lower Silesian Voivodeship Lower Silesia 48 Zgorzelec** 31,890 Lower Silesian Voivodeship Historically part of Lusatia, Zgorzelec was considered part of Lower Silesia in years 1319–1329 and 1815–1945 49 Bielawa 31,186 Lower Silesian Voivodeship Lower Silesia 50 Kluczbork 24,207 Opole Voivodeship Lower Silesia 51 Lubliniec 24,105 Silesian Voivodeship Upper Silesia 52 Krnov 24,079 Moravian-Silesian Region Czech Silesia 53 Jawor 23,650 Lower Silesian Voivodeship Lower Silesia 54 Żagań 23,235 Lubusz Voivodeship Lower Silesia 55 Świebodzice 23,197 Lower Silesian Voivodeship Lower Silesia 56 Nowa Ruda 22,823 Lower Silesian Voivodeship Lower Silesia 57 Polkowice 22,535 Lower Silesian Voivodeship Lower Silesia 58 Łaziska Górne 22,413 Silesian Voivodeship Upper Silesia 59 Świebodzin 21,963 Lubusz Voivodeship Lower Silesia 60 Rydułtowy 21,741 Silesian Voivodeship Upper Silesia 61 Prudnik 21,472 Opole Voivodeship Upper Silesia 62 Bohumín 21,340 Moravian-Silesian Region Czech Silesia * Only partly in Silesia == Famous people == There are many famous people who were born in Silesia: * Writers, poets and playwrights like Andreas Gryphius, Martin Opitz, Fürst von Pückler-Muskau, Carl Hauptmann, Gerhart Hauptmann (Nobel Prize in Literature, 1912), Joseph Freiherr von Eichendorff, Gustav Freytag * Members of the German Resistance such as Peter Graf Yorck von Wartenburg, Helmuth James Graf von Moltke * Military officers like Manfred von Richthofen, Erwin von Witzleben * Painters like Adolph von Menzel * Philosophers like Jakob Böhme * Actors like Dieter Hildebrandt, Victor de Kowa, Ludwig M. Lommel, Wolfgang Neuss, Willy Fritsch, Hanna Schygulla, Georg Thomalla * Politicians like Paul Löbe (SPD), Klaus Töpfer (CDU), Manfred Kanther (CDU), Ferdinand Lassalle, Erich Mende (FDP) * Scientists like Hans G. Dehmelt (Nobel Prize in Physics, 1989), Paul Ehrlich (Nobel Prize in Medicine, 1908), Friedrich Bergius (Nobel Prize in Chemistry, 1931), Max Born (Nobel Prize in Physics, 1954), Fritz Haber (Nobel Prize in Chemistry, 1918), Reinhard Selten (Nobel Memorial Prize in Economic Sciences, 1994), Konrad Bloch (Nobel Prize in Medicine, 1964), Bernhard Grzimek, Johannes Winkler, Maria Goeppert-Mayer (Nobel Prize in Physics, 1963), Kurt Alder (Nobel Prize in Chemistry, 1950), Otto Stern (Nobel Prize in Physics, 1943) * Builder and architects like Carl Gotthard Langhans * Musicians like Katja Ebstein, Roy Etzel, Michael Jary == Gallery == Image:Landkarte von Schlesien.jpg|First map of Silesia (1561) Image:Breslau um 1900.jpg|City hall of Breslau, Germany between ca. 1890 and ca. 1900. View from the east. Image:Krummhuebel Kirche Wang 1900.jpg|Krummhuebel, Church of Wang (German: Kirche Wang) between 1890 and 1905. Image:Oppeln ring 1904.jpg|Postcard of the market square in the city of Oppeln in 1904. Image:Gleiwitz - Haus Oberschlesien.jpg|Hotel \"Haus Oberschlesien\" (transl.: Upper Silesia House) in Gleiwitz, Upper Silesia, Germany, 1928 == Other websites == * http://www.schlesien-lm.de - official website of the Landsmannschaft Schlesien * http://www.schlesierbund.de - Schlesierbund from Nürnberg, Germany * http://www.deutsche-schutzgebiete.de/provinz_schlesien.htm - Deutsche Schutzgebiete - Provinz Schlesien Category:Geography of the Czech Republic Category:Geography of Poland Category:Geography of Saxony Category:Regions of Germany Category:Regions of Poland",
 "title": "Silesia"
}