{
 "id": "629425",
 "text": "Ma Long (simplified Chinese:马龙; traditional Chinese: 馬龍; pinyin: Mǎ Lóng; born 20 October 1988 in Anshan) is a Chinese table tennis player. In 2015 and 2017 he became World Champion in Singles, and in 2016 and 2020 he became an Olympic champion. == Career == Ma first appeared internationally in 2006, where he won gold with the team at the World Table Tennis Championships. In 2007 he appeared more internationally in appearance, which he rose in the world rankings. After good performances in the year, Ma won the Kuwait and Qatar Open as well as the World Tour Grand Finals. Nevertheless, he wasn't nominated for the 2008 Olympic Games. In 2009 he took part in World Championships for the first time, where he lost in the semifinal and bronze won. In 2010 Ma Long with the Chinese Team won gold at the World Championship. In the final they beat Germany 3:1. In 2011 took part in World Championships again, where he lost to Wang Hao in the semifinal again. So he won bronze again. In 2012 he wasn't nominated for the Olympic Games, but Ma Long won gold at the World Championships with the Team again. He also participated in the same year for the first time at the World Cup, where he won gold after a final victory over Timo Boll. 2013 Ma lost the third time against Wang Hao in the semifinals at the World Championships. In the same year he won the World Tour Grand Finals and the German and Qatar Open. 2014 he won with team the gold medal at the WTTC and Ma took part in the World Cup event, where he lost to Zhang Jike in the final. 2015 was his best year: Ma won the Qatar Open and won silver at the Kuwait Open. At the World Championships he won the first time gold in the singles event and was since this event N.1 in the world ranking. He also won the World Cup and the World Tour Grand Finals. In 2016 Ma won for the seventh time the WTTC with the team. In this year he won the Kuwait, China and Qatar Open too. 2017 won Ma for the second time the WTTC in the singles category. In the final he beat Fan Zhendong. In June 2017, when he played the China Open he boycotted this event and must pay a fine from $20,000 dollars. After that, Ma Long played for a long time no events. In 2018 he won the German Open and is now the number 7 in the world ranking. At the WTTC the Chinese team won gold, he could win the China Open, but lost at the Japan Open to Tomokazu Harimoto. == Results from the ITTF-database == Association Year Competition Country City Singles Doubles Team Mixed CHN 2006 World Championships Germany Bremen Gold CHN 2007 Kuwait Open Kuwait Kuwait City Gold CHN 2007 Qatar Open Qatar Doha Gold CHN 2007 World Tour Grand Finals South Korea Incheon Gold CHN 2009 World Championships Japan Yokohama Bronze CHN 2010 World Championships Russia Moskau Gold CHN 2011 World Championships Netherlands Rotterdam Bronze CHN 2012 World Championships Germany Dortmund Gold CHN 2012 World Cup England Liverpool Gold CHN 2012 Olympic Games England London no part. Gold CHN 2013 World Championships France Paris Bronze CHN 2013 Asian Championships Chinese Taipeh Taipeh Gold Gold CHN 2013 Kuwait Open Kuwait Kuwait City Gold CHN 2013 Qatar Open Qatar Doha Gold CHN 2014 World Championships Japan Tokio Gold CHN 2014 World Cup Germany Düsseldorf Silver CHN 2015 World Championships China Suzhou Gold R32 CHN 2015 Kuwait Open Kuwait Kuwait City Gold Bronze CHN 2015 Qatar Open Qatar Doha Gold CHN 2015 World Cup Sweden Halmstad Gold CHN 2015 World Team Cup Arabia Dubai Gold CHN 2015 World Tour Grand Finals Portugal Lissabon Gold CHN 2015 German Open Germany Bremen Gold CHN 2016 German Open Germany Berlin Gold CHN 2016 Qatar Open Qatar Doha Gold CHN 2013 Chinese National Games China Guangzhou Gold Gold CHN 2016 Kuwait Open Kuwait Kuwait City Gold CHN 2016 World Championships Malaysia Kuala Lumpur Gold CHN 2017 World Championships Germany Düsseldorf Gold R32 CHN 2017 China Open China Beijing R16 CHN 2018 German Open Germany Bremen Gold Gold CHN 2004 World Junior Championships North Korea Pjöngjang Gold Gold Gold Gold == Successes == === World Championships === * 2006, 2008, 2010, 2012, 2014, 2016 Winner with the Team * 2009, 2011, 2013 Singles Bronze * 2015, 2017 Winner in the Singles === Olympic Games === * 2012, 2016 Olympic champion with the team * 2016, 2020 Olympic champion in the singles === World Cup === * 2012, 2015 Winner in the Singles * 2014 Silver in the Singles * 2017 Bronze in the Singles * 2015, 2018 Winner with the Team == References == __FORCETOC__ Category:1988 births Category:Living people Category:Chinese table tennis players",
 "title": "Ma Long"
}