{
 "id": "629448",
 "text": "Yuriy Vasilyevich Abramochkin (Юрий Васильевич Абрамочкин; normally rendered in English as Yuriy or Yuri Abramochkin, 11 December 1936 – 5 April 2018) was a Soviet and Russian photographer and photojournalist. Abramochkin worked with Soviet and world leaders, politicians and celebrities, making among others the photos of Nikita Khrushchev, Leonid Brezhnev, Mikhail Gorbachev, Boris Yeltsin, Charles de Gaulle, Willy Brandt, Francois Mitterrand, Richard Nixon, Urho Kekkonen, Jacques Chirac, Bill Clinton, Yuri Gagarin, Ronald Reagan, Valentina Tereshkova and Elizabeth II. ==Gallery== File:Alexander_Solzhenitsyn_in_Moscow,_December_1998.jpg File:RIAN archive 22526 Health resort for children.jpg File:RIAN archive 330109 Soviet President Mikhail Gorbachev and U.S. President George Bush.jpg File:RIAN archive 426989 IMF Managing Director Michel Camdessus and Russian Prime Minister Viktor Chernomyrdin meeting to sign credit agreement.jpg File:RIAN archive 694193 Submarine hunter Steregushchy.jpg File:RIAN archive 851899 Pioneers and schoolchildren greet delegates and guests of XVII convention of trade unions of the USSR.jpg File:RIAN archive 807991 War veterans' reunion on Theater Square.jpg File:RIAN archive 726670 Valentina Tereshkova.jpg File:RIAN archive 36147 \"Trespasser\" crossing the border.jpg File:RIAN archive 437799 Galina Vishnevskaya's anniversary concert at the State Academic Bolshoi Theater.jpg File:RIAN archive 479950 BelAZ dump truck presented at the 2-nd Russian International Motor Show.jpg File:RIAN archive 612179 The USSR pilot-cosmonaut Valentina Tereshkova at press conference.jpg File:RIAN archive 693673 Mikhail Gorbachev and Ronald Reagan talk.jpg File:RIAN archive 693688 The Dmitry Pozharsky cruiser.jpg File:RIAN archive 828797 Mikhail Gorbachev addressing UN General Assembly session.jpg File:RIAN archive 881647 Moscow gardens and children.jpg ==References== ==Other websites== *Yuriy Abramochkin, as retrieved by the Wayback Machine on 2 May 2014 *Interview with Yuriy Abramochkin in Sakharov Center Category:Russian artists Category:Photojournalists Category:Russian journalists Category:1936 births Category:2018 deaths",
 "title": "Yuriy Abramochkin"
}