{
 "id": "629530",
 "text": "Zhang Jike (simplified Chinese: 张继科; traditional Chinese: 張繼科; born 16 February 1988 in Qingdao) is a Chinese table tennis player. He became the world champion in 2011 and 2013. In 2012 he won the Olympic Games. Zhang is the fourth man in history to win the Grand Slam. == Career == In 2006 Zhang Jike came into the National Team. After two years he become the Chinese Master in the Singles. His first World Championship that he played, was 2011 in Rotterdam. Zhang came into the final and beat Wang Hao with which he became World Champion in singles. In the same year he won the World Cup, where his opponent was Wang Hao again. He is the third player in history after Jan-Ove Waldner and Jorgen Persson, who won these important titles in one year. In 2012 Zhang Jike was nominated for the Olympic Games in London. He competed in singles as well as team competitions, where he won gold in both. From June to December 2012 he was the number 1 in the world, because he won the Olympic Games in the singles. In the final at the World Championships 2013 Zhang played against Wang Hao and defended his title after defeating him. In 2014 he won the World Cup for second time. His final-opponent was Ma Long. At the WTTC 2015 he won bronze in the singles and gold in the doubles with Xu Xin. In the semifinals in the singles category he lost to Fang Bo. During this year he lost unusually often against non-Chinese players. Nevertheless, he was nominated for the Olympic Games 2016. Here he won the silver medal in singles and with the team the gold medal. At the Asian Cup in the same year he lost to Xu Xin the final at the singles category. In the Chinese Superleague 2016 he didn't play. In 2017 he had to stop because of a fever in the second round. At the World Championships he came to Round 32 only. At the Asian Championships in the same year he came into the semifinals and won with the team the gold medal. At the China Open he lost at the Round of 32. And didn't play the year anymore. That's why in 2018 he was only ranked 78th, the lowest since 2008. == Results from the ITTF-database == Association Year Competition Country City Singles Doubles Team Mixed CHN 2011 World Championships Netherlands Rotterdam Gold CHN 2011 World Cup France Paris Gold CHN 2012 Olympic Games England London Gold Gold CHN 2013 World Championships France Paris Gold CHN 2010 World Championships Russia Moskau Gold CHN 2012 World Championships Germany Dortmund Gold CHN 2007 World Championships Croatia Zagreb R 64 CHN 2010 World Cup Germany Magdeburg Silver CHN 2014 World Championships Japan Tokio Gold CHN 2014 World Cup Germany Düsseldorf Gold CHN 2015 World Championships China Suzhou Bronze Gold CHN 2015 World Team Cup Arabia Dubai Gold CHN 2015 World Tour Grand Finals Portugal Lissabon Bronze CHN 2016 World Championships Malaysia Kuala Lumpur Gold CHN 2016 Olympic Games Brasilia Rio de Janeiro Silver Gold CHN 2017 World Championships Germany Düsseldorf R 32 CHN 2017 Asian Championships China Wuxi Bronze Gold CHN 2015 Asian Championships Thailand Pattaya R 16 Gold CHN 2011 Asian Championships Macau Macau Silver Gold CHN 2013 Pro Tour Qatar Open Qatar Doha Gold Gold Gold Gold == Awards == === World Championships === * 2011, 2013 Winner Singles * 2015 Bronze Singles * 2008, 2010, 2012, 2014, 2016 Winner Team * 2015 Winner Doubles === Olympic Games === * 2012, 2016 Winner Team * 2012 Winner Singles * 2016 Silver Singles === World Cup === * 2010 Silver Singles * 2011, 2014 Gold Singles * 2015, 2018 Winner Team === Asian Championships === * 2009, 2011 Silver Singles * 2017 Bronze Singles * 2017 Gold Team == References == __FORCETOC__ Category:1988 births Category:Living people Category:Chinese table tennis players",
 "title": "Zhang Jike"
}