{
 "id": "629621",
 "text": "Fan Zhendong (; born 22 january 1997 in Guangzhou) is a Chinese table tennis player. In 2016 he won the World Cup and become Vice- World Champion in 2017. == Career == In the world rankings Fan appeared for the first time in 2012, when he won alle four titles (Singles, Doubles, Mixed, Team) at the Youth World Championship. Because of good performances in the Chinese Trials, he was even nominated in 2013 for the men's competition at the World Championship. There Fan came to the Round of 32, where he lost to Zhang Jike. In the same year he won with the team the Asian Championship. In 2014, Fan Zhendong with his team won the WTTC. At the Asian Cup he lost to Chen Chien-An. At the World Championship in 2015 he came to the semifinals, where he lost to Ma Long, but still won bronze. At the Asian championships in the same year he won all four titles. At the World Cup he became Vice- World Cup champion, because he lost in the final against Ma Long. In the World Cup in 2016 he won in the final against Xu Xin. Fan with his team won the World Championships again. At the China Open in June 2017 he boykotts and had to pay a fine of 20,000 Dollars. At the Grand Finals he won gold in the singles category. After winning the Qatar Open in 2018 it's the first time that he's world number one. With the Chinese team he won the WTTTC, too. == Results from the ITTF-database == Association Year Competition Country City Singles Doubles Team Mixed CHN 2012 Youth World Championships India Hyberabad Gold Gold Gold Gold CHN 2013 World Championships France Paris R 32 CHN 2013 German Open Germany Berlin Gold CHN 2013 Asian Championships Japan Tokio Bronze Gold CHN 2014 World Championships Japan Tokio Gold CHN 2014 China Open China Tianijn Bronze Gold CHN 2015 World Championships China Suzhou Bronze Silver CHN 2015 Asian Championships Arabia Dubai Gold Gold Gols Gold CHN 2015 World Cup Sweden Halmstad Silver CHN 2015 World Team Cup Arabia Dubai Gold CHN 2016 World Championships Malaysia Kuala Lumpur Gold CHN 2016 World Cup Germany Saarbrücken Gold CHN 2016 Olympic Games Brazil Rio de Janeiro no part. Gold CHN 2017 World Championships Germany Düsseldorf Silver Gold CHN 2017 China Open China Tianijn R 16 CHN 2018 Hungarian Open Hungary Budapest Gold CHN 2018 Qatar Open Qatar Doha Gold == Successes == === World Championships === * 2015 Bronze in Singles * 2017 Silver in Singles * 2015 Silver in Doubles * 2017 Gold in Doubles === Olympic Games === * 2016 Gold with the Team === World Cup === * 2015 Silver in Singles * 2016 Gold in Singles * 2015 Gold with the Team * 2018 Gold with the Team * 2020 Gold in singles == References == Category:1997 births Category:Living people Category:Chinese table tennis players",
 "title": "Fan Zhendong"
}