{
 "id": "629878",
 "text": "Li Xiaoxia (simplified Chinese: 李晓霞; traditional Chinese: 李曉霞; born 16 January 1988 in Anshan) is a Chinese table tennis player. With her team, she won gold five times at the world championships and gold two times at the Olympics. In doubles Li became the world champion three times and won gold twenty-one times on the world tour. After the Olympics 2016 she finished her career. == Career == In 2006 she took part in the world championships for the first time. With the team, she won gold. After that, Li came under the best 10 players in the world rankings. At the world cup, where she took part for the first time too, Li came to the Quarterfinals. In the next year, she won silver in the singles and doubles at the WTTC, and at the grand finals she won gold. For her win at the world cup in 2008, Li was for the first time number one in the world. But she wasn't nominated for the Olympics in 2008. In the next year, Li did not win a lot of big titles, except the Asian Games, so she fell back in time to 8th place in the ITTF-rankings. In the doubles Li Xiaoxia became the 2009 and 2011 world-champion and won the 2011 world tour grand finals, too. In the singles, she became vice-world champion. In 2012, Li was for the first time nominated for the Olympics, where she beat Ding Ning in the finals, and won gold. With the team Li won gold, too. The lastest big title she won was in 2013: At the world championships she beat Liu Shiwen in the final and so became world champion in the singles. In the doubles she won the gold medal, too. At the grand finals in the same year she won gold in the doubles. In 2014 she won silver at the world cup, but at the world championships she lost in the semifinal to Liu Shiwen and won bronze. In the doubles she could win silver. In 2016 she played her lastest biggest event: At the Olympics, where she came to the final and lost to Ding Ning she won silver. At the team event she won gold. == Successen == === World Championships === * 2006, 2008, 2012, 2014, 2016 gold with the team * 2010 silver with the team * 2011 silver in the singles * 2015 bronze in the singles * 2013 winner in the singles === Olympic Games === * 2012, 2016 gold with team * 2012 gold in the singles * 2016 silver in the singles === World Cup === * 2008 winner in the singles * 2014 silver in the singles * 2012, 2015 gold with the team == Results from the ITTF-database == Association Year Competiton Country City Singles Doubles Mixed Team CHN 2006 World Championships GER Bremen Gold CHN 2006 World Cup CHN Ü rümqi Quarterfinals CHN 2007 World Championships CRO Zagreb Silver Silver CHN 2007 Pro Tour Grand Finals CHN Beijng Gold CHN 2008 World Cup MAII Kuala Lumpur Gold CHN 2009 Asian Games HGK Honkong Gold CHN 2009 World Championships JPN Yokohama R 64 Gold CHN 2010 World Tour Grand Finals RUS Moscow Bronze Silver CHN 2011 World Championships NED Rotterdam Silver Gold CHN 2011 World Tour Grand Finals POR Lisboa Gold CHN 2012 World Championships GER Dortmund Gold CHN 2012 Olympic Games ENG London Gold Gold CHN 2013 World Championships FRA Paris Gold Gold CHN 2010 World Championships RUS Moscow Silver CHN 2008 World Championships POR Lagos Gold CHN 2014 World Cup AUS Wien Silver CHN 2014 World Championships JPN Tokio Gold CHN 2015 Kuwait Open KUW Kuwait City Gold CHN 2015 World Campionships CHN Tianjin Bronze Silver CHN 2016 World Championships MAII Kuala Lumpur Gold CHN 2016 Olympic Games BRA Rio de Janeiro Silver Gold == References == Category:1988 births Category:Living people Category:Chinese table tennis players",
 "title": "Li Xiaoxia"
}