{
 "id": "629994",
 "text": "Donald McKayle (July 6, 1930 – April 6, 2018) was an American modern dancer, choreographer, teacher, director and writer. He was best known for creating socially concert works during the 1950s and 1960s. ==Early life== McKayle was born in Harlem, New York. ==Career== His instructors included modern dance pioneer Martha Graham, Merce Cunningham, Anna Sokolow and Karol Shook.Gregg Lizenbery, \"McKayle, Donald,\" in Taryn Benbow-Pfalzgraf (ed.), International Dictionary of Modern Dance (Detroit: St.James Press, 1998), 526. McKayle was \"among the first black men to break the racial barrier by means of modern dance.\"Nancy Reynolds and Malcolm McCormick, No Fixed Points: Dance in the Twentieth Century (New Haven, CT: Yale University Press, 2003), 345. He worked with Martha Graham multiple times during his career. His work for the concert stage, especially Games (1951) and Rainbow Round My Shoulder (1959), were his best known works. In addition, McKayle was the first black man to both direct and choreograph major Broadway musicals, including the Tony Award-winners Raisin (1973) and Sophisticated Ladies (1981).John Perpener, African-American Concert Dance: The Harlem Renaissance and Beyond ((Chicago: University of Illinois Press, 2001), 193.Melanye P. White-Dixon, \"McKayle, Donald,\" in Selma Jeanne Cohen (ed.), International Encyclopedia of Dance, vol. 4 (New York: Oxford University Press 1998), 345. McKayle held an endowed chair in the Dance Department at University of California, Irvine, where he was the Claire Trevor Professor of Dance. He previously served on the faculties of Connecticut College, Sarah Lawrence College, and Bennington College. ==Death== McKayle died in Irvine, California on April 6, 2018 at the age of 87. ==References== ==Other websites== * * Category:1930 births Category:2018 deaths Category:American dancers Category:Educators from New York City Category:American choreographers Category:American stage actors Category:Actors from New York City Category:Writers from New York City",
 "title": "Donald McKayle"
}