{
 "id": "63021",
 "text": "Woodland is a low-density forest with plenty of sunlight and limited shade. It forms an open habitat. Woodlands have an understory of shrubs and herbaceous plants including grasses. Woodlands grade into shrubland in drier conditions or in early stages of plant succession. Higher densities and areas of trees, with largely closed canopy, and nearly continuous shade and are often called forests. Woodland in British forestry means any smaller area covered in trees, however dense. Forest in the British Isles means extensive wooded areas, regardless of density. Royal forests may not be wooded at all. The term ancient woodland is used in British conservation to mean any wooded land that has existed for a very long time (equivalent to the American term old growth forest). Conservationist work hard to preserve woodlands. The woodlands in Northwest Indiana have been preserved as part of the Indiana Dunes.Smith S. & Mark S. 2006. Alice Gray, Dorothy Buell, and Naomi Svihla: preservationists of Ogden Dunes. The South Shore Journal. 1. http://www.southshorejournal.org/index.php/issues/volume-1-2006/78-journals/vol-1-2006/117-alice- gray-dorothy-buell-and-naomi-svihla-preservationists-of-ogden-dunes Smith S. & Mark S. 2009. The historical roots of the Nature Conservancy in the Northwest Indiana/Chicagoland region: from science to preservation. The South Shore Journal. 3. http://www.southshorejournal.org/index.php/issues/volume-3-2009/83-journals/vol-3-2009/75-the- historical-roots-of-the-nature-conservancy-in-the-northwest- indianachicagoland-region-from-science-to-preservation Smith S. & Mark S. 2007. The cultural impact of a museum in a small community: the hour glass of Ogden Dunes. The South Shore Journal. 2. http://www.southshorejournal.org/index.php/issues/volume-2-2007/82-journals/vol-2-2007/104-the- cultural-impact-of-a-museum-in-a-small-community-the-hour-glass-in-ogden-dunes == References == == Other websites == *The Woodland Trust Category:Forests",
 "title": "Woodland"
}