{
 "id": "63035",
 "text": "{{Infobox settlement | name = Limburg | native_name = | settlement_type = Province of Belgium | image_flag = Flag of Limburg (Belgium).svg | flag_size = | image_shield = Limburg B wapen.svg | shield_size = 70px | image_map = Provincie Limburg in Belgium.svg | coordinates = | subdivision_type = Country | subdivision_name = | subdivision_type1 = Region | subdivision_name1 = | seat_type = Capital | seat = Hasselt | leader_title = Governor | leader_name = Jos Lantmeeters (N-VA) | anthem = \"Limburg mijn Vaderland\" \"Limburg My Fatherland\" | area_total_km2 = 2,427 | area_footnotes = | population_total = 885,951 | population_footnotes = | population_as_of = 1 January 2022 | population_density_km2 = 365 | blank_name_sec2 = HDI (2019) | blank_info_sec2 = 0.925 · 7th of 11 | website = }} Limburg Official name is Provincie Limburg (Dutch). (, , , ) is the easternmost of the five provinces of modern Flanders, which is one of the three main political and cultural sub-divisions of modern Belgium. Its capital is Hasselt. ==Geography== Limburg is located west of the Meuse (Dutch Maas) river, upon which it borders the similarly named province Limburg of the Netherlands. It also borders on the Walloon province of Liège to the south, with which it also has historical ties. To the north and west are the old territories of the Duchy of Brabant, the Flemish provinces of Flemish Brabant and Antwerp to the west, and the Dutch province of North Brabant to the north. The province of Limburg has an area of with a population of about 886,000 in 2022. The province is divided into three arrondissements (arrondissementen in Dutch) with 42 municipalities. Among these municipalities are the current capital Hasselt, the early medieval capital Borgloon, Genk, Diepenbeek (home to Hasselt University), and Tongeren, the only Roman city in the province and regarded as the oldest city of Belgium. The municipality of Voeren is geographically detached (an exclave) from Limburg and the rest of Flanders, with the Netherlands to the north and the Walloon province of Liège to the south. This municipality was established by the municipal reform of 1977. The highest point of the province, , is in the town of Remersdaal, Voeren municipality. The centre of Belgian Limburg is crossed east to west by the Demer river and the Albert Canal, which run similar paths. The Demer river's drainage basin covers most of the central and southern part of the province, except for the southeastern corner, where the Jeker (in French: (le) Geer) runs past Tongeren and into the Maas river (in French: (la) Meuse) at Maastricht. The eastern border of the province corresponds to the western side of the Maas, which originates in France. It's drainage basin includes not only the Jeker but most of the northern part of Belgian Limburg. ==Administrative divisions== The province of Limburg is divided into 3 arrondissements (Hasselt, Maaseik and Tongeren) and a total of 42 municipalities since 2019. Municipalities by arrondissements, with their numbers in the map Hasselt Maaseik Tongeren * As (2) * Beringen (3) * Diepenbeek (8) * Genk (10) * Gingelom (11) * Halen (12) * Ham (13) * Hasselt (15) * Herk-de-Stad (18) * Heusden-Zolder (20) * Leopoldsburg26 * Lummen (28) * Nieuwerkerken (31) * Sint-Truiden (36) * Tessenderlo (37) * Zonhoven (41) * Zutendaal (42) * Bocholt (5) * Bree (7) * Dilsen-Stokkem (9) * Hamont-Achel (14) * Hechtel-Eksel (16) * Houthalen-Helchteren (22) * Kinrooi (23) * Lommel (27) * Maaseik (29) * Oudsbergen (32) * Peer (33) * Pelt (34) * Alken (1) * Bilzen (4) * Borgloon (6) * Heers (17) * Herstappe (19) * Hoeselt (21) * Kortessem (24) * Lanaken (25) * Maasmechelen (30) * Riemst (35) * Tongeren (38) * Voeren (39) * Wellen (40) ==Population by arrondissement== Population x 1,000 (on 1 January since 1980).Institut national de statistique - Direction générale Statistique et information économique Arrondissement 1970 1980 1990 2000 2010 2020 Hasselt 320 350 364 383 408 420 Maaseik 160 185 200 219 233 252 Tongeren 172 175 181 189 197 205 Province of Limburg 653 711 745 791 839 877 ==Related pages== * Limburg (Netherlands), a province in southeastern Netherlands. ==References== ==Other websites== * * Toerisme Limburg",
 "title": "Limburg (Belgium)"
}