{
 "id": "63082",
 "text": "The second law of thermodynamics says that when energy changes from one form to another form, or matter moves freely, entropy (disorder) in a closed system increases. Differences in temperature, pressure, and density tend to even out after a while. Due to the force of gravity, density and pressure do not even out vertically. Density and pressure on the bottom will be more than at the top. Entropy is a measure of spread of matter and energy to everywhere they have access. The most common wording for the second law of thermodynamics is essentially due to Rudolf Clausius: It is impossible to construct a device that produces no other effect than transfer of heat from lower temperature body to higher temperature body In other words, everything tries to maintain the same temperature over time. There are many statements of the second law which use different terms, but all mean the same thing. Another statement by Clausius is: Heat cannot of itself pass from a colder to a hotter body. An equivalent statement by Lord Kelvin is: A transformation whose only final result is to convert heat, extracted from a source at constant temperature, into work, is impossible. The second law only applies to large systems. The second law is about the likely behavior of a system where no energy or matter gets in or out. The bigger the system is, the more likely the second law will be true. == Overview == In a general sense, the second law says that temperature differences between systems in contact with each other tend to even out and that work can be obtained from these non-equilibrium differences, but that loss of thermal energy occurs, when work is done and entropy increases. Pressure, density and temperature differences in an isolated system, all tend to equalize if given the opportunity; density and pressure, but not temperature, are affected by gravity. A heat engine is a mechanical device that provides useful work from the difference in temperature of two bodies. == Quotes == \\--Sir Arthur Stanley Eddington, The Nature of the Physical World (1927) \\--Greg Hill and Kerry Thornley, Principia Discordia (1965) \\--Philosopher / Physicist P.W. Bridgman, (1941) == Notes == * Flanders and Swann produced a setting of a statement of the Second Law of Thermodynamics to music, called \"First and Second Law. * The economist Nicholas Georgescu-Roegen showed the significance of the Entropy Law in the field of economics (see his work The Entropy Law and the Economic Process (1971), Harvard University Press). == References == * == Further reading == * Goldstein, Martin, and Inge F., 1993. The Refrigerator and the Universe. Harvard Univ. Press. A gentle introduction, a bit less technical than this entry. * Maxwell's demon 2 : entropy, classical and quantum information, computing. Edited by Harvey S. Leff and Andrew F. Rex. Bristol; Philadelphia : Institute of Physics, 2003 == Other websites == * Stanford Encyclopedia of Philosophy: \"Philosophy of Statistical Mechanics.\" by Lawrence Sklar. * The evolution of Carnot's principle, by E.T. Jaynes, in G. J. Erickson and C. R. Smith (eds.) Maximum-Entropy and Bayesian Methods in Science and Engineering vol. 1, p. 267 (1988). * The Second Law of Thermodynamics. Category:Thermodynamics Category:Laws of physics",
 "title": "Second law of thermodynamics"
}