{
 "id": "63092",
 "text": "The first law of thermodynamics is that energy can neither be created nor destroyed; it can change only from one form to another. The law forms the basis of the principle of conservation of energy. This means that anything that uses energy is changing the energy from one kind of energy to another. For example, exercising changes energy from food into kinetic (motion) energy. Another example: In the Sun (or any star), nuclear fusion changes mass into heat and light (electromagnetic radiation), which travels to Earth and is used by plants to create food (chemical energy) by photosynthesis, which can be eaten by animals allowing them to move (kinetic energy). Energy only ever changes its form; it is neither created nor destroyed. This is why perpetual motion machines do not exist and could never exist; it would break a fundamental law of physics. People can use the changes to do work that is useful.1st Law of Thermodynamics Ohio State University. Accessed July 2011 Examples of forms of energy in classical mechanics include heat, light, kinetic (movement) or potential energy. However, in modern physics it is considered that there are only two types of energy - mass and kinetic energy, although this may not be helpful to those not familiar with more complex physics. The law means that the total energy of the universe (or any Closed system) is a constant. However, energy can be transferred from one part of the universe to another. The most common wording of the first law of thermodynamics used by scientists is: ==History== James Prescott Joule was the first person who found out by experiments that heat and work are convertible. The first statement of the first law of thermodynamics was given by Rudolf Clausius in 1850: \"There is a state function E, called 'energy', whose differential equals the work exchanged with the surroundings during an adiabatic process.\" === Thermodynamics and Engineering === In thermodynamics and engineering, it is natural to think of the system as a heat engine which does work on the surroundings, and to state that the total energy added by heating is equal to the sum of the increase in internal energy plus the work done by the system. Hence \\delta W is the amount of energy lost by the system due to work done by the system on its surroundings. During the portion of the thermodynamic cycle where the engine is doing work, \\delta W is positive, but there will always be a portion of the cycle where \\delta W is negative, e.g., when the working gas is being compressed. When \\delta W represents the work done by the system, the first law is written: :\\mathrm{d}U=\\delta Q-\\delta W\\, People disagree whether energy is a positive or a negative number. So that \\delta Q is the flow of heat out of the system, and \\delta W is the work into the system: :\\mathrm{d}U=-\\delta Q+\\delta W\\, Because of this ambiguity, it is very important in any discussion involving the first law to explicitly establish the sign convention in use. dU = the change in internal energy Q = heat W = work ==Related pages== * Second law of thermodynamics ==References== * Goldstein, Martin, and Inge F., 1993. The Refrigerator and the Universe. Harvard Univ. Press. A gentle introduction. Category:Thermodynamics Category:Laws of physics",
 "title": "First law of thermodynamics"
}