{
 "id": "63108",
 "text": "Cogeneration (also combined heat and power, CHP) is the use of a heat engine or a power station to make both electricity and useful heat at the same time. Conventional power plants emit the heat created as a byproduct of electricity generation into the environment through cooling towers, as flue gas, or by other means. Combined heat and power captures the waste heat for domestic or industrial heating purposes, either very close to the plant, or - especially in Scandinavia and eastern Europe - for distribution through pipes to heat local housing. Cogeneration is a thermodynamically efficient use of fuel. Byproduct heat at moderate temperatures (100 to 180°C) can also be used in absorption chillers for cooling. A plant producing electricity, heat and cold is sometimes called regeneration or more generally: polygene ration plant. Thermal power plants (including those that use fissile elements or burn coal, petroleum, or natural gas), and heat engines in general, do not convert all of their available energy into electricity. In most heat engines, a bit more than half is wasted as excess heat (see: Second law of thermodynamics). By capturing the excess heat, CHP uses heat that would be wasted in a conventional power plant, potentially reaching an efficiency of up to 70%, compared with at most 40% for the conventional plants. Less fuel needs to be consumed to produce the same amount of useful energy. Less pollution is produced for a given economic benefit. An exact match between the heat and electricity needs rarely exists. A CHP plant can either meet the need for heat (heat driven operation) or be run as a power plant with some use of its waste heat. CHP is most efficient when the heat can be used on site or very close to it. Overall efficiency is reduced when the heat must be transported over longer distances. This requires heavily insulated pipes, which are expensive and inefficient. Electricity can be transmitted along a comparatively simple wire, and over much longer distances for the same energy loss. A car motor becomes a CHP plant in winter, when the heat is useful for warming the interior of the vehicle. This example scores the point that deployment of CHP depends on heat uses in the neighbourhood of the heat engine. Cogeneration plants are commonly found in district heating systems of big towns, hospitals, prisons, oil refineries, paper mills, wastewater treatment plants, thermal enhanced oil recovery wells and industrial plants with large heating needs. == Other websites == * Energy Policy Act of 2005 - sec. 1817 \"Study of Cogeneration\" * www.mccree.com - Air Products and Chemicals Cogeneration Plant (Orlando, Florida) * www.co-generationsystems.com - Industrial Co-generation Equipment Provider *Sequoien - Non-profit CHP * CHP in Finland: ** High cogeneration performance by innovative steam turbine for biomass-fired CHP plant in Iisalmi, Finland (URL accessed on 30 March 2006) * UK micro CHP schemes: ** www.defra.gov.uk, CHP ** BBC News: Power from the people ** Powergen WhisperGen ** M.I.T. algae reactor ** Stirling/ Oven * Associations: ** U.S. Combined Heat and Power Association ** CHP Association ** COGEN Europe The European Association for the Promotion of Cogeneration ** The World Alliance for Decentralized Energy Category:Electricity",
 "title": "Cogeneration"
}