{
 "id": "631239",
 "text": "John William Oliver (born 23 April 1977) is an English actor, comedian, political commentator, producer, television host and writer. In 2014, Oliver began hosting the HBO series Last Week Tonight with John Oliver. Oliver's work in Last Week Tonight has become very popular. His work has had a large impact on American culture and politics, which has been called the \"John Oliver Effect\". In 2019, he was the voice of Zazu in the 2019 drama-live action remake The Lion King. == Early life and education == Oliver was born on 23 April 1977 in Erdington, Birmingham, to Carole and Jim Oliver. His father was a school headmaster and social worker, and his mother was a music teacher. Both of his parents are originally from Liverpool, Merseyside. His uncle was the composer Stephen Oliver. His father's great-grandfather, William Boyd Carpenter was the Bishop of Ripon and court chaplain to Queen Victoria. Oliver learned to play the viola as a child.https://www.npr.org/transcripts/591457135 Since childhood, he has been a fan of Liverpool FC, noting in interviews that \"my mum's family are from Knotty Ash and my dad's family are from the Wirral, so supporting Liverpool was very much not a choice\". Oliver learned in Bedford at the Mark Rutherford School. After secondary school, he studied at Christ's College, Cambridge. While he was a student there in the mid-to-late 1990s, Oliver was a part of the Cambridge Footlights, the university's club for theatre run by students of Cambridge University. David Mitchell and Richard Ayoade were also in the club. In 1997, he became the club's vice president. In 1998, Oliver graduated from Christ's College with a degree in English. ==References== ==Other websites== * John Oliver's New York Stand-Up Show at Comedy Central * Category:Emmy Award winners Category:1977 births Category:Living people Category:Actors from Birmingham Category:English comedians Category:English movie actors Category:English television actors Category:English television personalities Category:English television presenters Category:English television producers Category:English television writers Category:English voice actors Category:Political commentators Category:Writers from Birmingham",
 "title": "John Oliver"
}