{
 "id": "631205",
 "text": ":For a general discussion of mental capacity, see Intelligence Mental capacity in law is a term used to describe a person's ability to make decisions for themselves and to understand what those decisions will mean for them. Sometimes, people who are unwell, such as those with illnesses which affect their memory (Alzheimer's disease or Dementia), those with learning difficulties, or who have mental health problems, may find themselves in a position where their ability to make decisions for themselves is questioned. This may be because they do not understand that what they are doing is not good for them; they do not realise that it might make them ill or get them into trouble. People can also lack capacity if they are unable to communicate in any way; for example, if they're in a coma or if they have severe brain damage. In this case, it may be necessary for someone else, such as an advocate or a Judge to make decisions for them by making a court order. In some countries, like the United Kingdom, laws exist which tell those working with people whose capacity might be in doubt, what they must do and how to decide if someone is capable of making their own decisions. In the UK, this law is called the Mental Capacity Act (2005). It lists 5 rules which must be used as a guide; in simple terms, they are: # You must presume a person has capacity, unless it can be proved otherwise. # Whenever you can, help a person to make their own decisions. # Just because a person makes a bad decision, it doesn't mean they can't make decisions. # If you have to make a decision for someone who doesn't have capacity, it must be what's best for them. # Any treatment or care for someone without capacity, should not take away their rights and freedom anymore than it needs to. This law also allows people who have capacity, to pick someone else to make their decisions for them, in the case that they can't do it themselves. Supposing a person is unable to make decisions for themselves, what happens then? In the UK (and many other countries) there is a legal framework to make sure no-one takes advantage of the said person. It often consists of a physician or psychiatrist dealing with the person in question, a solicitor representing the person, and a solicitor representing the \"public interest\" (the state). Meetings are held at agreed times, say once every three months. The purpose is to make sure that decisions taken are in the person's interest. == References == Category:Mental health law Category:Intelligence",
 "title": "Mental capacity"
}