{
 "id": "631435",
 "text": "Antonio Bernocchi was an Italian industrialist, who built up a successful textile factory at Legnano, a city in the Lombardy region of northern Italy. Bernocchi will rebuild the Milano Scala twice: first after the First World War and then after the Second World War, as it was destroyed due to bombings. Bernocchi, an art lover, will also be involved in the reconstruction of the Academy and the Pinacoteca di Brera, which were also damaged during the bombings of the Second World War. For this task, he will entrust the responsibility to Piero Portaluppi and Gualtiero Galmanini. == Life == Bernocchi was born on 17 January 1859 at Castellanza in the province of Varese, in Lombardy in northern Italy. He was one of three sons of Rodolfo Bernocchi and Angela Colombo. Bernocchi attended the Scuola Tecnica of Busto Arsizio, but did not complete his education. By the age of fifteen he was working for his father in a small workshop for bleaching textiles at Legnano. In 1898 the family started a textile factory at Legnano. The business became very successful, which was successful and grew substantially. Factories were opened at Nerviano, Cerro Maggiore and Angera. Bernocchi became mayor of Legnano and a member of the Italian Senate. Bernocchi made several charitable donations. After the Italian defeat at Caporetto in World War I, he donated to a new charity for war veterans, La Patria Riconoscente. The charity was later called the Opera Nazionale Combattenti. He gave funds for the establishment or expansion of schools and hospitals in Legnano, where two schools are named after him. He was a benefactor of La Scala in Milan. His biggest donation was five million lire to the city of Milan for the construction of the Palazzo dell'Arte, home of the Triennale exhibition, in the Parco Sempione. The pavilion, also known as Palazzo Bernocchi, was designed by Giovanni Muzio and built between 1931 and 1933. Bernocchi's brothers, Andrea and Michele, also contributed to the construction of the pavillion. The Coppa Bernocchi, a bicycle race held at Legnano since 1919, is dedicated to Bernocchi. ==References== Category:1859 births Category:1930 deaths Category:Italian businesspeople Category:Italian philanthropists",
 "title": "Antonio Bernocchi"
}