{
 "id": "63157",
 "text": "Zenwalk (formerly Minislack), or Zenwalk Linux, is a Linux distribution started by Jean-Philippe Guillemin. It was at first based on Slackware. Since its creation, the distribution has become very different from Slackware while still still being able to use its binary packages. Zenwalk aims to be a Linux distribution with many uses by focusing on Internet applications, multimedia and programming tools. == Aims == The Zenwalk Project aims to create a Linux operating system that can be used on old and slow computers through the use of the latest software available for a stable release, optimization for a specific processor architecture to increase execution speed, and introduces a very powerful package management system with dependency resolution. Zenwalk release history version date Minislack 0.1 May 21, 2004 Minislack 0.2 August 8, 2004 Minislack 0.3 February 17, 2005 Minislack 0.4 March 26, 2005 Minislack 1.0 April 24, 2005 Minislack 1.0.1 May 3, 2005 Minislack 1.1 June 10, 2005 Zenwalk 1.2 August 12, 2005 Zenwalk 1.3 October 15, 2005 Zenwalk 2.0 Core November 27, 2005 Zenwalk 2.0.1 December 4, 2005 Zenwalk 2.1 (Core) January 18, 2006 Zenwalk 2.2 February 16, 2006 Zenwalk 2.4 April 4, 2006 Zenwalk 2.6 May 23, 2006 Zenwalk 2.8 July 21, 2006 Zenwalk 3.0 September 8, 2006 Zenwalk 4.0 November 20, 2006 Zenwalk 4.2 January 6, 2007 Zenwalk 4.4 February 22, 2007 Zenwalk 4.4.1 February 24, 2007 Zenwalk 4.6 June 1, 2007 Zenwalk 4.6.1 June 6, 2007 Zenwalk 4.8 October 6, 2007 Zenwalk 5.0 January 18, 2008 Zenwalk 5.2 June 7, 2008 == Project versions == There are four main versions of Zenwalk: Zenwalk (full version ~ 420 MB iso download) is a distribution aimed at mainstream desktop use. Designed to be a stand-alone operating system, it installs to the hard drive by way of a ncurses-based installer. It includes all of the officially released software packages that are deemed most useful for their tasks. This collection may change with every release. Zenwalk Core (~ 230 MB iso download) is a Zenwalk system built with customization in mind. Released with no X Window System binaries, its aim is to allow a skilled user to build a system fit for his or her needs. The project's lead developer is Emmanuel Bailleul. ZenLive (~ 476 MB iso download) is a Zenwalk system built on a Live CD design. ZenLive follows the progress made by the full Zenwalk system closely, thus mirroring the version number, and attempts to stay true to the original distribution's goals. In addition, it includes all of the necessary libraries and applications to develop and compile software, a particularly rare feature in Live CD distributions. Project members include Pierrick Le Brun, creator, Mauricio Tricoli, project lead, and Michael Verret, artwork. Zenserver (~ 263 MB iso download) is a Zenwalk Core-derived system specifically designed for servers. The main goals are to create a secure, reliable, easy to use, easy to configure, expandable and dependable server operating system, in the best Zenwalk tradition. The distribution development team is led by Teran McKinney. === Distributions based on Zenwalk === There are currently four Zenwalk-based distributions: *SaxenOS, a distribution built primarily to support older hardware (SaxenOS 2008 is not as lightweight anymore as the former versions) *Arudius, a Linux Live CD distribution for information assurance with tools for penetration testing and vulnerability analysis *Zencafe , a distribution designed for Internet cafes *Zeee Zenwalk for the ASUS Eee PC ==Related pages== *List of Linux distributions *Arudius *Slackware == References == == Other websites == *Official site * *Zenwalk 4.8 Review at Tech Source from Bohol Category:Linux distributions",
 "title": "Zenwalk Linux"
}