{
 "id": "631595",
 "text": "The 2018–19 Premier League was the 27th Premier League season. Manchester City won the title while Liverpool was runner-up. Wolverhampton Wanderers, Cardiff City and Fulham joined as the promoted clubs from the 2017–18 EFL Championship. They replaced West Bromwich Albion, Swansea City and Stoke City who were relegated to the 2018–19 EFL Championship. The season started on 11 August 2018 and finished on 19 May 2019.2018-19 EPL Season start after transfer window standard.co.uk Retrieved 18 April 2018 This season had two aviation accidents that involved people from the Premier League. On 27 October 2018, Leicester City owner Vichai Srivaddhanaprabha was killed in a helicopter crash outside the King Power Stadium, shortly after a 1–1 home draw against West Ham United and then almost three months later, on 21 January 2019, Cardiff City player Emiliano Sala, who had already agreed a deal with Cardiff City following his record signing from Nantes, died on board a Piper PA-46 Malibu aircraft that crashed off Alderney while he was going to England for completing the medical formalities. On 30 March 2019, Huddersfield Town were the first team to be relegated, after a 2–0 defeat at Crystal Palace. They were relegated with six games remaining. This made them the only second team to be relegated before the end of March in the history of premier league, the other one being Derby County who were relegated in 2007–08. On 2 April 2019, Fulham followed Huddersfield after a 4-1 defeat at Watford with five games remaining. == Teams == Twenty teams will compete in the league this season, out of which, seventeen teams will be from the previous season of premier league, and three new teams which get promoted from the EFL Championship. The teams who will play in premier league for this season are : *Arsenal *Bournemouth *Brighton and Hove Albion *Burnley *Cardiff *Chelsea *Crystal Palace *Everton *Fulham *Huddersfield *Leicester City *Liverpool *Manchester City *Manchester United *Newcastle United *Southampton *Tottenham Hotspur *Watford *West Ham *Wolverhampton Wanderers Wolverhampton played in the Premier League for the first time since 2012. Teams promoted to the Premier League *Wolverhampton Wanderers *Cardiff City * Fulham Teams relegated to the EFL Championship *West Brom *Stoke City *Swansea City ==Venues== :Note: Table lists in alphabetical order. Team Location Stadium Capacity Arsenal London Emirates Stadium Bournemouth Bournemouth Vitality Stadium Brighton & Hove Albion Brighton American Express Community Stadium Burnley Burnley Turf Moor Cardiff City Cardiff Cardiff City Stadium Chelsea London Stamford Bridge Crystal Palace London Selhurst Park Everton Liverpool Goodison Park Fulham London Craven Cottage Huddersfield Town Huddersfield John Smith's Stadium Leicester City Leicester King Power Stadium Liverpool Liverpool Anfield Manchester City Greater Manchester Etihad Stadium Manchester United Greater Manchester Old Trafford Newcastle United Newcastle upon Tyne St. James' Park Southampton Southampton St. Mary's Stadium Tottenham Hotspur London Tottenham Hotspur Stadium Watford Watford Vicarage Road West Ham United London London Stadium Wolverhampton Wanderers Wolverhampton Molineux == League table == == Results == == Season statistics == === Scoring === ====Top Scorers==== ====Top scorers==== Rank Player Club Goals 1 Pierre-Emerick Aubameyang Arsenal 22 1 Sadio Mané Liverpool 22 1 Mohamed Salah Liverpool 22 4 Sergio Agüero Manchester City 21 5 Jamie Vardy Leicester City 18 6 Harry Kane Tottenham Hotspur 17 6 Raheem Sterling Manchester City 17 8 Eden Hazard Chelsea 16 9 Callum Wilson Bournemouth 14 10 Raúl Jiménez Wolverhampton Wanderers 13 10 Alexandre Lacazette Arsenal 13 10 Glenn Murray Brighton & Hove Albion 13 10 Paul Pogba Manchester United 13 10 Richarlison Everton 13 10 Gylfi Sigurðsson Everton 13 ==== Hat-tricks ==== Player For Against Result Date Ref Manchester City Huddersfield Town 6–1 (H) Chelsea Cardiff City 4–1 (H) Liverpool Bournemouth 4–0 (A) Liverpool Arsenal 5–1 (H) Wolverhampton Wanderers Leicester City 4–3 (H) Manchester City Arsenal 3–1 (H) Manchester City Chelsea 6–0 (H) Watford Cardiff City 5–1 (A) Manchester City Watford 3–1 (H) Tottenham Hotspur Huddersfield Town 4–0 (H) Newcastle United Southampton 3–1 (H) ==== Top assists ==== Rank Player Club Assists 1 Eden Hazard Chelsea 15 2 Ryan Fraser Bournemouth 14 3 Christian Eriksen Tottenham Hotspur 12 4 Trent Alexander-Arnold Liverpool 11 4 Andrew Robertson Liverpool 11 6 Leroy Sané Manchester City 10 6 Raheem Sterling Manchester City 10 8 Paul Pogba Manchester United 9 8 Callum Wilson Bournemouth 9 10 Sergio Agüero Manchester City 8 10 Alexandre Lacazette Arsenal 8 10 João Moutinho Wolverhampton Wanderers 8 10 Mohamed Salah Liverpool 8 === Clean sheets === Rank Player Club Clean sheetshttps://fantasy.premierleague.com/a/statistics/clean_sheets/et_1 Premier League – Fantasy – Most Clean Sheets 1 Alisson Liverpool 20 1 Ederson Manchester City 20 3 Kepa Arrizabalaga Chelsea 14 3 Jordan Pickford Everton 14 5 Hugo Lloris Tottenham Hotspur 12 6 Martin Dúbravka Newcastle United 10 7 Neil Etheridge Cardiff City 9 7 Kasper Schmeichel Leicester City 9 8 Rui Patrício Wolverhampton Wanderers 8 9 David de Gea Manchester United 7 9 Łukasz Fabiański West Ham United 7 9 Ben Foster Watford 7 9 Vicente Guaita Crystal Palace 7 === Discipline === ==== Player ==== * Most yellow cards: 13 ** Étienne Capoue (Watford) * Most red cards: 2 ** Pierre-Emile Højbjerg (Southampton) ** Wes Morgan (Leicester City) ==== Club ==== * Most yellow cards: 75 ** Watford * Most red cards: 5 ** Leicester City == References == ==Other websites== *Official website England Category:Premier League seasons",
 "title": "2018–19 Premier League"
}