{
 "id": "631624",
 "text": "The 2018 UEFA Champions League Final was the last game of the 2017–18 UEFA Champions League, Europe's top club football tournament run by UEFA. It was played at the NSC Olimpiyskiy Stadium in Kyiv, Ukraine on 26 May 2018. The game was between reigning champions Real Madrid, and five-time winners Liverpool. Madrid opened the scoring in the second half with a goal from Karim Benzema, but Liverpool quickly equalised through Sadio Mané. Gareth Bale then scored two goals for Real Madrid to win the game, which finished 3-1. ==Road to the final== Note: In all results below, the score of the finalist is given first (H: home; A: away). Real Madrid Round Liverpool Bye Qualifying phase Opponent Agg. 1st leg 2nd leg Play-off round 1899 Hoffenheim 6–3 2–1 (A) 4–2 (H) Opponent Result Group stage Opponent Result APOEL 3–0 (H) Matchday 1 Sevilla 2–2 (H) Borussia Dortmund 3–1 (A) Matchday 2 Spartak Moscow 1–1 (A) Tottenham Hotspur 1–1 (H) Matchday 3 Maribor 7–0 (A) Tottenham Hotspur 1–3 (A) Matchday 4 Maribor 3–0 (H) APOEL 6–0 (A) Matchday 5 Sevilla 3–3 (A) Borussia Dortmund 3–2 (H) Matchday 6 Spartak Moscow 7–0 (H) Group H runners-up Final standings Group E winners Opponent Agg. 1st leg 2nd leg Knockout phase Opponent Agg. 1st leg 2nd leg Paris Saint-Germain 5–2 3–1 (H) 2–1 (A) Round of 16 Porto 5–0 5–0 (A) 0–0 (H) Juventus 4–3 3–0 (A) 1–3 (H) Quarter-finals Manchester City 5–1 3–0 (H) 2–1 (A) Bayern Munich 4–3 2–1 (A) 2–2 (H) Semi- finals Roma 7–6 5–2 (H) 2–4 (A) ==Match== ===Details=== The \"home\" team (for business reasons) was decided by an extra draw held after the semi-final draw. It was held on 13 April 2018, at the UEFA headquarters in Nyon, Switzerland. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Keylor Navas RB 2 Dani Carvajal CB 5 Raphaël Varane CB 4 Sergio Ramos (c) LB 12 Marcelo CM 10 Luka Modrić CM 14 Casemiro CM 8 Toni Kroos AM 22 Isco CF 9 Karim Benzema CF 7 Cristiano Ronaldo Substitutes: Substitutes: Substitutes: GK 13 Kiko Casilla DF 6 Nacho DF 15 Theo Hernández MF 20 Marco Asensio MF 23 Mateo Kovačić FW 11 Gareth Bale FW 17 Lucas Vázquez Manager: Manager: Manager: Zinedine Zidane Zinedine Zidane Zinedine Zidane Man of the Match: Gareth Bale (Real Madrid) Assistant referees: Milovan Ristić (Serbia) Dalibor Đurđević (Serbia) Fourth official: Clément Turpin (France) Additional assistant referees: Nenad Đokić (Serbia) Danilo Grujić (Serbia) Reserve assistant referee: Nemanja Petrović (Serbia) Match rules *90 minutes. *30 minutes of extra time if necessary. *Penalty shoot-out if scores still level. *Seven named substitutes, of which up to three may be used. ===Match Records=== First half Statistic Real Madrid Liverpool Goals scored 0 0 Total shots 5 9 Shots on target 0 1 Saves 1 0 Ball possession 65% 35% Corner kicks 2 2 Fouls committed 2 10 Offsides 4 1 Yellow cards 0 0 Red cards 0 0 Second half Statistic Real Madrid Liverpool Goals scored 3 1 Total shots 7 3 Shots on target 5 1 Saves 0 2 Ball possession 58% 42% Corner kicks 7 3 Fouls committed 3 8 Offsides 3 2 Yellow cards 0 1 Red cards 0 0 Overall Statistic Real Madrid Liverpool Goals scored 3 1 Total shots 12 12 Shots on target 5 2 Saves 1 2 Ball possession 62% 38% Corner kicks 9 5 Fouls committed 5 18 Offsides 7 3 Yellow cards 0 1 Red cards 0 0 ==Related pages== *2018 UEFA Europa League Final *2018 UEFA Super Cup ==References== Uefa Champions League Final Category:UEFA Champions League finals",
 "title": "2018 UEFA Champions League final"
}