{
 "id": "631787",
 "text": "Control Machete were an Mexican rap group from Monterrey, Nuevo León, and its members were Fermín IV, Pato Machete and DJ Toy Selectah. The rap group started in 1996 and lasted until 2004. Control Machete achieved in just 6 months to sell 500 thousand units from their disk Mucho Barato both in México as América. Their capacity of convocation were presented before the crowds of 10.000 people in Spain with great success performing concerts throughout South America presented an total audience estimated more than 458 thousand people. It has been such an impact that they have generated, that they have been in charge of several events of carving international as it is the concert of the multi-awarded alternative musician David Bowie in the Autódromo Hermanos Rodríguez before more than 40 thousand people. Later, Control Machete would face a challenging challenge entering fully into the major leagues to be the official opening group of the most important tour of the year in Mexico: Pop Mart, of the Irish band U2. And if that were not enough, they were in charge of opening the 50 Cent's concert that was offered in Mexico at the Palacio de los Deportes in March 2004. They were invited to participate in several compilations, highlighting the album of José José's tribute (BMG, 1998), where they played Amnesia, and 2001 they were also in the tribute to the Argentine band Soda Stereo, playing the song Camaleón. They participated in Outlandos D'Americas (EMI, 1998), the album that pays homage to The Police. The group participated in a national tour with Molotov, on tour Molochete, teniendo gran aceptación en México. In 2001 one of the members, Fermin IV left his career as solo of Christian music, becoming a Pastor of the Congregation \"Semilla de Mostaza\" in Mexico City, has been influence for many young people leave from gangs and follow the example, also is the vocalist of the group with the same name. ==Discography== ===Albums=== * Mucho Barato (1996) * Artillería Pesada presenta (1999) * Spanglish (2001) * Sólo Para Fanáticos (2002) * Uno, Dos:Bandera (2003) ===Collaborations=== * Molochete with Molotov (2000) ==References== Category:Musical groups established in 1996 Category:1990s Mexican music groups Category:2000s Mexican music groups Category:Mexican rap music groups Category:Musical groups disestablished in 2004 Category:1996 establishments in Mexico Category:2000s disestablishments in Mexico",
 "title": "Control Machete"
}