{
 "id": "632075",
 "text": "Constantine II (, Konstantínos II; 2 June 1940 - 10 January 2023) reigned as the King of Greece, from 1964 until the end of the monarchy of Greece in 1973. George I of Greece and Prince Philip, Duke of Edinburgh were his relatives. ==Early life== Constantine was the only son of King Paul and Queen Frederica of Greece. His family was forced to leave the country during the Second World War. For this reason, he spent the first years of his childhood in Egypt and South Africa. He returned to Greece with his family in 1946 during the Greek Civil War. King George II died in 1947. Constantine's father Paul became the new king. With this, Constantine became the crown prince. ==Reign== Constantine became king in 1964 after the death of his father, King Paul. Later that year he married Princess Anne-Marie of Denmark. They had five children. At first, the new king was seen as a good sign. There was a lot of political instability during his reign, however. This instability led to the Colonels' Coup of 21 April 1967, when the Greek junta came to power. Constantine was still the head of state. There were no military forces which were loyal to him. For this reason, he was not able to do much. He agreed to inaugurate the junta, if most of the ministers were civilians. There was a coup against the junta, but it failed. For this reason, Constantine was forced to leave the country, on 3 December 1967. Formally, he was still the head of state in exile until the junta abolished the monarchy on 1 June 1973. The 1973 Greek republic referendum ratified the abolition. There were fears that people had been put under pressure, to vote for a republic. For this reason, some people did not accept the result of the referendum, as valid. A new referendum was held after democracy had been restored in 1974. This second referendum was held after the fall of the junta as the 1974 Greek republic referendum on 8 December 1974. The result was the same, though: the monarchy should be abolished, and the Third Hellenic Republic should be started. Constantine was not allowed to return to Greece to campaign. Nevertheless, he accepted the results of the referendum. ==Olympic career== Constantine was also a good sailor. He competed at the 1960 Rome Olympics and won a gold medal in the Dragon class. Later he served on the International Olympic Committee. Along with his fellow crew members of the Nireus sailing vessel, he was named one of the 1960 Greek Athletes of the Year. When he won the medal, in 1960, he was twenty years old. This was the first medal in sailing for Greece, since the 1912 Summer Olympics. ==Death== When he aged, his health got worse. On 10 January 2023, he died of a stroke, in Athens. ==References== ==Other websites== * Official website of the Greek Royal Family Category:1940 births Category:2023 deaths Category:International Olympic Committee Category:Olympic gold medalists for Greece Category:Kings of Greece Category:Exiled royalty",
 "title": "Constantine II of Greece"
}