{
 "id": "632143",
 "text": "The Guantanamo Bay detention camp (which is also called Guantanamo or Gitmo) is a United States concentration camp in Guantanamo Bay Naval Base on the coast of Guantanamo Bay in Cuba. The camp is said to be breaking international human rights laws, National Security & Human Rights - Amnesty International USA. as prisoners have been held without trial , and there have been reports of prisoners being tortured. ==History== ===Bush administration=== The prison was established under the presidency of George W. Bush, in 2002 during the War on Terror. The Secretary of Defense at the time was Donald Rumsfeld, who said that the prison was built to hold dangerous people, question them, and charge them with war crimes: \"These men are particularly dangerous... at least one detainee now in Cuba has been threatening to kill Americans. Another has bitten a guard... To stop future terrorist attacks, we have detained these people, and we have and will be questioning them to gather additional intelligence information...The reality is that they have been charged with something. They have been found to be engaging on the behalf of Al-Qaeda or the Taliban and have been captured.\" , Department of Defense News Briefing - Secretary Rumsfeld and General Pace, 2 January 2002. Since January 2002, 779 men have been kept in Guantanamo. These men have been from over 50 countries. Nearly 200 were released in mid 2004., Between Collaboration and Disobedience: the behaviour of Guantanamo detainees and its consequences. Although the Bush govenrnment said that most of the men had been captured at war, a 2006 report found that over 80% of the prisoners were captured by Pakistanis and Afghans for bounty payments. The US had offered $5,000 for each prisoner. Seton Hall University School of Law Center for Policy & Research, Death in Camp Delta. In 2012, Colonel Lawrence Wilkerson said that US officials (including president Bush, Vice President Dick Cheney and Secretary of Defense Rumsfeld) had known that most of the original prisoners were innocent, but kept them to make themselves look better Wilferson pdf A report by the Institute on Medicine as a Profession in 2013 said that health professionals in Guantanamo \"designed and participated in cruel, inhumane and degrading treatment and torture of detainees.\" Medical professionalism: Interrogation, torture and dual loyalty. This involved: * Abusive interrogation * Creating conditions designed to increase anxiety and confusion in prisoners * Using medical information for questioning * Force feeding Morris Davis (former chief prosecutor for the terrorism trials at Guantanamo Bay), began an e-petition to close Guantanamo. The e-petition got over 72,000 signatures, and called attention to the huger strikes that 'involves more than 100 prisoners, including come 21 who are being force-fed to keep them from starving to death.\" Petition by former prosecutor to close Guantanamo Bay tops 75,000 signatures. Former Guantanamo chief prosecutor petitions Obama to close prison camp. On 12 December 2013, retired US marine Major General Micheal R Lehnert (who oversaw the building of the Guantanamo prison camp) published a piece in the Detroit Free Press. He called Guantanamo \"out nation's most notorious prison - a prison that should never have been opened\", and provided a short description of its history:, Micheal Lahnert: It's long past time that we close Guantanamo. \"Our nation created Guantanamo because we were legitimately angry and frightened by an unprovoked attack on our soil on September 11, 2001. We thought that the detainees would provide would provide a treasure trove of information and intelligence. \"I was ordered to construct the first 100 cells at Guantanamo within 96 hours [4 days]. The first group of 20 prisoners arrived 7 days after the order was given. We were told that the prisoners were the 'worst of the worst', a common refrain for every set of detainees sent to Guantanamo. The US has held 779 men there, most of them cleared for transfer, but stuck by politics. \"Even in the earliest days of Guantanamo, I became more and more convinced that many of the detainees should never have been sent in the first place. They had little intelligence value, and there was insufficient evidence linking them to war crime [they didn't know anything, and there was little proof they had committed war crimes]. That the remains the case for many, if not most, of the detainees.\" ===Obama administration=== In his 2008 presidential campaign, Barack Obama described Guantanamo bay as a sad chapter in America's history and promised to close the prison in 2009. He changed this statement after he was elected., Obama: Gitmo likely won't close in first 100 days. President Obama was not able to close Guantanamo before he left office, but he did reduce the prison's population to 41., Obama to leave office with 41 captives still at Guantanamo, blames politic. ===Trump administration=== President Trump has promised to keep the prison open, and to use it keep \"bad dudes\". He also wants to bring back waterboarding and \"worse\". Documentary: forever prison. On 31st January 2018, Trump signed an order to keep the prison open., Trump signs executive order to keep Guantanamo Bay military prison open for business. ==Torture claims== In court filings made public in 2007, FBI agents said that they saw prisoners: * Chained in the fetal position on the floor * Kept in very hot or very cold temperatures * Gagged with duct-tape * Held in stress positions (uncomfortable, caused joint problems) while shackled * shackled in a baseball catcher's position * made to listen to loud music with flashing floodlights for over 24 hours * kept in bare 6x8 foot cells * chained for 18–24 hours in own urine and feces Other claims include: * being sexually degraded * forced drugging * religious mistreatment , Britons release devastating account of torture and abuse bu US forces at Guantanamo * pepper spray to the face * fingers pushed into eyes , Amnesty International Press Release: Northern Ireland: doctor leads medic's condemnation of government over Guantanamo Bay. * repeated beatings * sexual assault * torture with broken glass * torture with barbed wire * torture with burning cigarettes , Interview with Juma Al Dossary. * Sensory deprivation * head slammed into concrete * anal penetration * routine sleep deprivation * forced drug injections , First statement of David Hicks- The Center for the Study of Human Rights in the Americas * sexual assault by female officers * smeared with fake menstrual blood Sex used to break Muslim prisoners, book says. Book: Inside The Wire, Arm Sgt. Erik. R Saar. * releasing medical information including photographs Red cross finds detainee abuse in Guantanamo * forced to soil (poo) self * 12 hour interrogations * woken by being doused in water * intimated with dogs * forced to salute the American National Anthem * had pictures of 9/11 victims stuck to body * forcibly shaved * forced to bark like a dog * forcibly stripped * made to wear a bra and make up * intimidated with semi automatic firearms and power tools * given threats to assualt their mothers * Waterboarded, up to or more than 100 times Jimmy Carter ==Murder accusations== On 10 June 2006, three prisoners (Mani al-Utaybi, Yasser al-Zahrani, Ali Abdullah Ahmed) died in Guantanamo Bay. BBC: Triple suicide at Guantanamo camp. The Pentagon told the media that the prisoners had been hanged with clothing and bedsheets. \" [The detainees] were found unresponsive and not breathing in their cells by guards.\" Medical teams responded quickly and all three detainees were provided immediate emergency medical treatment in attempts to help them. The three detainees were pronounced dead by a physician after all life saving measures were exhausted.\" \\- Statement issued by Joint Task Force Guantanamo , Admiral: Gitmo suicides a 'planned event'. Families of all three detainees doubted the post mortems and wanted second post mortems done. Patrice Malign (the pathologist who re-examined al-Zahrani's body) said that the organs of al- Zahrani's throat were missing. His team could not find if al-Zahrani had hanged himself or died of another form of asphyxiation. The team said that there is no reason for there organs to have been removed. The US government has never given the missing organs back to the family. Deconstructing the Campaign to Malign. Gitmo detainee buried after body cross-examined. ==Legal issues== ===President Bush's military order=== On 14th September 2001, Congress pushed for the Authorisation for Use of Military Force Against Terrorists, which would have given the President broad powers to start The War on Terror in response to the 9/11 attacks. Authorization for Use of Military Force. However, Secretary of State Colin Powell and State Department Legal Advisor William Howard Taft IV said that the president must observe the Geneva conventions., Hamdan v Rumsfeld: the legal academy goes to practice. On 13th November 2001, President Bush signed a military order titled Detention, Treatment and Trial of Certain Non-Citizens in the War Against Terrorism. Military Order: Detention, Treatment and Trial of Certain Non-Citizens in the War Against Terrorism. ===Rasul v Bush=== On 19th February 2002, Guantanamo detainees petitioned to review their detentions and the reasons for them. US District Judge Collen Kollar-Kotelly rejected the petition, finding that non- US citizens in Cuba could not access or use US courts. On 28th June 2004, the Supreme Court of the United States decided against this in Rasul v Bush (UK prisoner in Guantanamo petitioning against Judge Kollar-Kotelly's decision in 2002). Justice John Paul Stevens said that the prisoners had the right to petition the court to review their cases. Rasul v Bush, 215 F. Supp. 2d55- District Court, District of Columbia 2002. ===Hamden v Rumsfeld=== The Bush government said that the Geneva Conventions did not apply to the prisoners. Supreme Court decisions since 2004 have said different: it decided in the Hamden v Rumfeld trial Supreme Court of the United States Hamden v Rumsfeld Secretary of Defense et al. that Article 3 of the Geneva Conventions (which sets rules for the treatment of prisoners of war) applies to the prisoners American Red Cross, Summary of Geneva Conventions of 1949 and Their Additional Protocols. In 2006, Deputy Defense Scretary Paul Wolfowitz created 'Combatant Status Review Tribunals' (CSRTs) to decide if prisoners were war criminals, Habeas corpus juristiction, substantive rights, and the war on terror. The CSRTs were completed in March 2005. Thirty-eight of the prisoners were found innocent. After the autobiography of Murnat Kurnaz (Turk-German held in Guantanamo 2002-2007) was published, military lawyer Eugene R. Fidell said that the book \"suggested the [CSRT] procedure is a sham; if a case like that can get through then the [smallest trace] of evidence against someone would [win over] for the governments, even if there's a mountain [of evidence] on the other side.\" Panel ignored evidence on detainee. On 15 July 2005, a panel on the Court of Appeals threw out all of the prisoners' petitions. Salim Ahmed HAMDAN, Appeellee v Donald H. RUMSFELD. On 7 November 2005 Supreme Court agreed to review that decision. On 30 December, Supreme Court passed the 'Detainee Treatment Act' which removed the prisoners' right to petition for review. Detainee Tratment Act 2006. ===Boumedine v Bush=== The Military Commissions Act 2006 was passed on 17 October 2006, allowing trial in military court for war criminals. Military Commissions Act of 2006. On 12 June 2008, the US Supreme Court decided against the government. Justice Antony Kennedy said that Guantanamo prisoners had the right to petition in federal court. Why it was a great victory. Body politic; Boumediene v Bush. ===Other court rulings=== On 3 March 2006, on order of US District Judge Jed S. Rakoff, the Department of Defense released the names of 317 of the 500 prisoners being held in Guantanamo Bay. The remaining 183 were held for privacy reasons. List of individuals detained by the Department of Defense at Guantanamo Bay. Pentagon reveals Guantanamo names. On 27 September 2007, French Judge put back a conviction of six former Guantanamo prisoners. Defense lawyers for the men (who were all French citizens), accused the French government of working with the US on their detentions. France: judge postpones terrorism verdict for former Guantanamo detainees. On 21 October 2008, US District Court Judge Richard J. Leon ordered the release of five Algerians and for a sixth to remain in Guantanamo. Judge declares five detainees held illegally. ===Access to court=== In the summer of 2012, the US government rejected a bid to limit lawyers' access to Guantanamo prisoners. Instead lawyers were required to sign a Memorandum of Understanding, meaning that they agreed to certain restriction when visiting the prisoners, including losing access to some classified information. This gave the Commander of the Joint Task Force of Guantanamo full control over lawyers' contacct with prisoners, including visits and letters., In re. Guantananmo bay detainee continued access to counsel. On 6 September, US District Judge Royce. C Lamberth rejected the argument that prison officers to take charge of meetings between lawyers and prisoners[htpps://www.csmonitor.com/USA/Justice/2012/0906/Guantanamo-Judge- rejects-US-bid-to-limit-lawyers-access-to-detainees], Guantanmo: Judge rejects US bid to limit lawyers' access to detainees. ===International law=== In April 2004, Cuban diplomats called for a United Nations investigation of Guantanamo Bay, Castro blasts Guantanamo 'concentration camp'. In May 2007, the United Nations released a report for the UN Human Rights CouncilThe report said that the US had broken international law, Article 5 of the Geneva conventions, and the Nuremberg principles., Washington Post: Judge says Detainees' trails are unlawful. U.S. officials misstate Geneva convention requirements., Nuremberg prosecutor says Guantanamo trials unfair., Principles of International Law recognized in the Charter of the Nurnberg Tribunal and in the Judgement of the Tribunal, with commentaries. In April 2011, a report published in the Public Library of Science Medical Journal looked at nine prisoners for evidence of torture. They found that medical doctors at Guantanamo ignored or hid medical evidence of intentional harm and torture. CIA doctors face human experimentaion claims. Neglect of medicl evidence of torture in Guantanamo Bay: A Case Series. ===Guantanamo lease agreement=== The base containing the prison camp is on territory that is recognized as sovereign Cuban territory. It is legally leased (rented) to the American Navy by the Cuban government through the 'Agreement between the United States and Cuba for the Lease of Lands for Coaling and Naval sites'. Agreement between the United States and Cuba for the Lease of Lands for Coaling and Naval sites. This suggests it is illegal for the US to hold a prison on the land. , American bar association task force on terrorism and the law report and recommendations on military commissions. ==Actions of some released prisoners.== Abdallah Salih al-Ajmi committed a successful suicide attack in Mosul on 25 March 2008. Al-Ajmi had been released from Guantanamo in 2005 and transferred to Kuwait, where he was from. A Kuwati court later dropped all his terrorism charges., Ex-Guantanamo inmate in Iraq suicide bombing., Ex-Gitmo prisoner carries out suicide attack. Moussa Zenmouri (37, Belgian of Moroccan descent) and Soufiane A (Algerian) were arrested on 24 July 2015 on charges of terrorism. They were release from Guantanamo in April 2005 and had been under police surveillance for suspected robbery.arrests two-ex-guantanamo-inmates-on-terrorism-charges- idUSKCN0PY27H20150724, Belgium arrests two ex-Guantanamo inmates on terrorism charges. Ibrahim al Qosi was featured in a video for 'Guardians of Shariah'as a religious leader in a high position in Al-Qaeda. Al Qosi was Osama bin Laden's accountant in the early 90's, and moved to Afghanistan with bin Laden in 1996. He was also bin Laden's chauffer. He was in Guantanamo from 2002 to 2012., Freed Guantanamo convict returns to the fight. On 8th March 2016, Reuters reported that 111 of 532 prisoners released by the Bush administration and 7 of 144 released by the Obama administration have returned. So, 118 of 676 (17%) are confirmed to have returned to fighting, and a further 86 (13%) are suspected to have returned to fighting., Ex-Guantanamo prisoners suspected of rejoining militants increases. In March 2016, Paul Lewis (Pentagon employee tasked with closing Guantanamo) said that \"Americans have been killed by prisoners released from Guantanamo Bay\", He refused to give a total or say when the attacks occurred., Officials say Guantanamo Bay transfers have killed Americans. ==Criticism and condemnation== Human Rights Watch criticised the Bush administration in its 2003 world report, stating \"Washington has ignored human rights standards in its own treatment of terrorist suspects. It has refused to apply the Geneva conventions to prisoners of war from Afghanistan, and has misused the designation of 'illegal combatant' to apply to criminal suspects on U.S. soil.\" Human Rights Watch World Report 2003: United States. On 25 May 2005, Amnesty International released its annual report calling the prison the \"gulag of our times\"., Amnesty Internation Report 2005 speech by Irene Khan at the Foreign Press Association. In November 2005, a group of experts from the United Nations on Human Rights called off their visit to Guantanamo Bay Camp Delta, saying that the US was not allowing them to hold private interviews with the prisoners. UN experts \"deeply regret\" US failure to allow Guantanamo visit on torture report. The group continued to write a report on the conditions in the prison based on interviews with released prisoners, lawyers, and human rights groups that had already visited. In February 2006, that report was published. The report called on the US to either charge or release all suspected terrorists, and included the US ambassador's reply to the draft versions of the report. United Nations Economic and Social Council 2006. On 10 March 2006, a letter in the Lancet (a weekly medical journal) was published, signed by over 250 medical experts, calling for the US to stop force-feeding prisoners and close the prison. Dr David Nicholl (who wrote the letter), said that the definition of torture (that the US was using) as only actions that cause \"death or major organ failure\" was \"not a definition anyone on the planet is using.\" The Lancet: Forcefeeding and restraint of Guantanamo Bay hungerstrikes. Polls run by the Program of International Policy (PIP) found that \"large majorities in Germany and Great Britain, and pluralities in Poland and India, believe the US has committed violations of international law at its prison on Guantanamo Bay in Cuba, including the use of interrogations.\" (This means that large amounts of people in Germany, Great Britain, Poland and India thought that the US was breaking international laws at Guantanamo Bay.) PIP found that a lot of the people who filled the polls said that they no longer saw the US as leaders of human rights because of Guantanamo., Publics in Europe and India see U.U. as Violating International Law at Guantanamo. US faces sceptical world over Iraq. ==References== Category:2002 establishments in North America Category:Prisoners of war Category:Prisons",
 "title": "Guantanamo Bay detention camp"
}