{
 "id": "63233",
 "text": "The planet Saturn has 274 moons: 63 that have been named and 211 that are yet to be named. Most of the moons are very small: 248 are less than in diameter. The moons are named after Titans, Giants, or minor Greek or Roman gods. == Confirmed moons == The moons of Saturn that were announced by 2018 are listed here by orbital period (or semi-major axis), from shortest to longest. Moons massive enough for their surfaces to have collapsed into a spheroid are highlighted in bold, while the irregular moons are listed in red, orange and gray background. Key Key Key Key Key † Major icy moons ♠ Titan ‡ Inuit group ♦ Gallic group ♣ Norse group Order Label Name Pronunciation Image Diameter (km) Mass ( kg) Semi-major axis (km) Orbital period (d) Inclination To Saturn's equator for the regular satellites, and to the ecliptic for the irregular satellites Eccentricity Position Discovery year Discoverer baaniroop S/2009 S 1 — outer B Ring 2009 Cassini (moonlets) — Three 1000 km bands within A Ring 2006 Cassini Pan in Encke Division 1990 M. Showalter Daphnis in Keeler Gap 2005 Cassini Atlas outer A Ring shepherd 1980 Voyager 2 Prometheus inner F Ring shepherd 1980 Voyager 2 Pandora outer F Ring Shepherd 1980 Voyager 2 Epimetheus co-orbital with Janus 1977 J. Fountain, and S. Larson Janus co-orbital with Epimetheus 1966 A. Dollfus Aegaeon G Ring moonlet 2008 Cassini 10 †Mimas 1789 W. Herschel 11 Methone Alkyonides 2004 Cassini 12 Anthe Alkyonides 2007 Cassini 13 Pallene Alkyonides 2004 Cassini 14 †Enceladus Generates the E ring 1789 W. Herschel 15 †Tethys 1684 G. Cassini Telesto leading Tethys trojan 1980 B. Smith, H. Reitsema, S. Larson, and J. Fountain Calypso trailing Tethys trojan 1980 D. Pascu, P. Seidelmann, W. Baum, and D. Currie 18 †Dione 1684 G. Cassini Helene leading Dione trojan 1980 P. Laques and J. Lecacheux Polydeuces trailing Dione trojan 2004 Cassini 21 †Rhea 1672 G. Cassini 22 ♠Titan 1655 C. Huygens 23 †Hyperion in 4:3 resonance with Titan 1848 W. Bond G. Bond W. Lassell 24 †Iapetus 1671 G. Cassini 25 ‡Kiviuq Inuit group 2000 B. Gladman, J. Kavelaars, et al. 26 ‡Ijiraq Inuit group 2000 B. Gladman, J. Kavelaars, et al. 27 ♣†Phoebe Norse group 1899 W. Pickering 28 ‡Paaliaq Inuit group 2000 B. Gladman, J. Kavelaars, et al. 29 ♣Skathi Norse (Skathi) Group 2000 B. Gladman, J. Kavelaars, et al. 30 ♦Albiorix Gallic group 2000 M. Holman 31 ♣S/2007 S 2 — Norse group 2007 S. Sheppard, D. Jewitt, J. Kleyna, B. Marsden 32 ♦Bebhionn Gallic group 2004 S. Sheppard, D. Jewitt, J. Kleyna 33 ♦Erriapus Gallic group 2000 B. Gladman, J. Kavelaars, et al. 34 ♣Skoll Norse (Skathi) group 2006 S. Sheppard, D. Jewitt, J. Kleyna 35 ‡Siarnaq Inuit group 2000 B. Gladman, J. Kavelaars, et al. 36 ‡Tarqeq Inuit group 2007 S. Sheppard, D. Jewitt, J. Kleyna 37 ♣S/2004 S 13 — Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 38 ♣Greip Norse group 2006 S. Sheppard, D. Jewitt, J. Kleyna 39 ♣Hyrrokkin Norse (Skathi) group 2006 S. Sheppard, D. Jewitt, J. Kleyna 40 ♣Jarnsaxa Norse group 2006 S. Sheppard, D. Jewitt, J. Kleyna 41 ♦Tarvos Gallic group 2000 B. Gladman, J. Kavelaars, et al. 42 ♣Mundilfari Norse group 2000 B. Gladman, J. Kavelaars, et al. 43 ♣S/2006 S 1 — Norse (Skathi) group 2006 S. Sheppard, D.C. Jewitt, J. Kleyna 44 ♣S/2004 S 17 — Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 45 ♣Bergelmir Norse (Skathi) group 2004 S. Sheppard, D. Jewitt, J. Kleyna 46 ♣Narvi Norse (Narvi) group 2003 S. Sheppard, D. Jewitt, J. Kleyna 47 ♣Suttungr Norse group 2000 B. Gladman, J. Kavelaars, et al. 48 ♣Hati Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 49 ♣S/2004 S 12 — Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 50 ♣Farbauti Norse (Skathi) group 2004 S. Sheppard, D. Jewitt, J. Kleyna 51 ♣Thrymr Norse group 2000 B. Gladman, J. Kavelaars, et al. 52 ♣Aegir Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 53 ♣S/2007 S 3 — Norse group 2007 S. Sheppard, D. Jewitt, J. Kleyna 54 ♣Bestla Norse (Narvi) group 2004 S. Sheppard, D. Jewitt, J. Kleyna 55 ♣S/2004 S 7 — Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 56 ♣S/2006 S 3 — Norse (Skathi) group 2006 S. Sheppard, D. Jewitt, J. Kleyna 57 ♣Fenrir Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna 58 ♣Surtur Norse group 2006 S. Sheppard, D. Jewitt, J. Kleyna 59 ♣Kari Norse (Skathi) group 2006 S. Sheppard, D. Jewitt, J. Kleyna 60 ♣Ymir Norse group 2000 B. Gladman, J. Kavelaars, et al. 61 ♣Loge Norse group 2006 S. Sheppard, D. Jewitt, J. Kleyna 62 ♣Fornjot Norse group 2004 S. Sheppard, D. Jewitt, J. Kleyna ===Unconfirmed moons=== The following objects (observed by Cassini) have not been confirmed as solid bodies. It is not yet clear if these are real satellites or merely persistent clumps within the F Ring. Name Image Diameter (km) Semi-major axis (km) Orbital period (d) Position Discovery year S/2004 S 6 ≈ 3–5 ≈ \\+ uncertain objects around the F Ring 2004 S/2004 S 3/S 4 ≈ 3–5 ≈ ≈ \\+ 2004 ==Hypothetical moons== Two moons were claimed to be discovered by different astronomers but never seen again. Both moons were said to orbit between Titan and Hyperion. * Chiron which was supposedly sighted by Hermann Goldschmidt in 1861, but never observed by anyone else. * Themis was allegedly discovered in 1905 by astronomer William Pickering, but never seen again. Nevertheless, it was included in numerous almanacs and astronomy books until the 1960s. ==References== Notes * Category:Astronomy lists",
 "title": "Moons of Saturn"
}