{
 "id": "63247",
 "text": "Cameron Michelle Diaz (born August 30, 1972) is an American actress and former fashion model. She was nominated for four Golden Globe Awards in 1999, 2000, 2002 and 2003. ==Early life== Cameron Michelle Diaz was born in San Diego, California. Her mother, Billie Joann (née Early), is an import-export agent. Her father, Emilio Luis Diaz (1949–2008), worked for the California oil company UNOCAL for more than 20 years as a field gauger.FilmReference.com: Cameron Diaz Biography (1972–) Diaz has an older sister, Chimene. Her father's family were Cubans with Spanish ancestry and settled in Tampa's Ybor City, later moving to California, where Emilio was born. Her mother has English, German, and Scots-Irish ancestry. Diaz was raised in Long Beach, California. ==Filmography== Year Title Role Notes 1994 The Mask Tina Carlyle 1995 The Last Supper Jude 1996 She's the One Heather Davis 1996 Feeling Minnesota Freddie Clayton 1996 Head Above Water Nathalie 1997 Keys to Tulsa Trudy 1997 My Best Friend's Wedding Kimmy Wallace 1997 A Life Less Ordinary Celine Naville 1998 Fear and Loathing in Las Vegas TV reporter Cameo 1998 There's Something About Mary Mary Jensen 1998 Very Bad Things Laura Garrety 1999 Being John Malkovich Lotte Schwartz 1999 Any Given Sunday Christina Pagniacci 2000 Things You Can Tell Just by Looking at Her Carol Faber 2000 Charlie's Angels Natalie Cook 2001 The Invisible Circus Faith 2001 Shrek Princess Fiona (voice) 2001 Vanilla Sky Julie Gianni 2002 The Sweetest Thing Christina Walters 2002 Gangs of New York Jenny Everdeane 2002 Slackers Herself Cameo 2002 Minority Report Woman on train Uncredited cameo 2003 Charlie's Angels: Full Throttle Natalie Cook 2004 Shrek 2 Princess Fiona (voice) 2005 In Her Shoes Maggie Feller 2006 The Holiday Amanda Woods 2007 Shrek the Third Princess Fiona (voice) 2008 What Happens in Vegas Joy McNally 2009 My Sister's Keeper Sara Fitzgerald 2009 The Box Norma Lewis 2010 Shrek Forever After Princess Fiona (voice) 2010 Knight and Day June Havens 2011 The Green Hornet Lenore Case 2011 Bad Teacher Elizabeth Halsey 2012 What to Expect When You're Expecting Jules 2012 Gambit PJ Puznowski 2012 A Liar's Autobiography: The Untrue Story of Monty Python's Graham Chapman Sigmund Freud (voice) 2013 The Counselor Malkina 2013 The Unbelievers Herself Documentary film 2013 In a World... Herself in trailer for The Amazon Games Uncredited cameo 2014 The Other Woman Carly Whitten 2014 Sex Tape Annie Hargrove 2014 Annie Miss Hannigan ==References== ==Other websites== * Category:Actors from San Diego Category:Models from San Diego Category:American movie actors Category:American television actors Category:American voice actors Category:1972 births Category:Living people",
 "title": "Cameron Diaz"
}