{
 "id": "632706",
 "text": "This is a list of largest Hindu Temples in terms of area. Rank Name of the temple Photo Area (m²) Place Country Architecture/Timeline 1 Pashupatinath Temple 2,460,000 Kathmandu, Nepal 🇳🇵 Nepal Pashupatinath Temple is a Hindu temple dedicated to Pashupati, a form of Shiva, and is located in Kathmandu, Nepal near the Bagmati River. This temple was classified as a World Heritage Site in 1979. It is built on an area of 246 hectares (2,460,000 m2) and includes 518 mini-temples and a main pagoda house. 2 Angkor Wat 1,626,000 Siem Reap Province Angkor Wat is a temple complex at Angkor, Cambodia. It is the largest religious monument in the world, on a site measuring . It was built for king Suryavarman II in the early 12th century. 3 Akshardham North America 740,575 New Jersey, USA 🇺🇸 United States Swaminarayan Akshardham is a Hindu temple complex in Robbinsville, New Jersey, U.S., in the New York City metropolitan area. The BAPS Shri Swaminarayan Mandir, one component of the campus, was inaugurated and opened to the public on August 10, 2014. The Akshardham in Robbinsville was then expanded and re-inaugurated on October 8, 2023 is the most-visited Hindu temple outside Asia. 4 Sri Ranganathaswamy Temple 631,000 Tiruchirapalli Srirangam temple is often listed as the largest functioning Hindu temple in the world . The temple was awarded with UNESCO Asia Pacific Award for Cultural Heritage Conservation Program in the year 2017 for the category 'Award of Merit'. 5 Akshardham 240,000 Delhi Akshardham is a Hindu temple complex in Delhi, India. a temple built by BAPS Swaminarayan Sanstha in 2005. 6 Belur Math, Ramakrishna temple 160,000 Howrah or Belur Mutt is the headquarters of the Ramakrishna Math and Mission, founded by Swami Vivekananda, a chief follower of Ramakrishna Paramahamsa. It is located on the west bank of Hooghly River, Belur, West Bengal, India. 7 Thillai Nataraja Temple, Chidambaram 160,000 Chidambaram Thillai Natarajah Temple, Chidambaram is a Hindu temple dedicated to Lord Shiva. It is located in the centre of the temple town of Chidambaram, Tamil Nadu. 8 Prambanan, Trimurti temple compound 152,000 Yogyakarta Candi Prambanan or Candi Rara Jonggrang is a 9th-century Hindu temple in Central Java, Indonesia, dedicated to Shiva. It also houses shrines of Vishnu, Brahma and their wives. Prambanan attracts many visitors from across the world. 9 BrihadeeswararTemple 102,400 Thanjavur Brihadeeswarar Temple also called The Big Temple was built by Raja Raja Chola I in 1010 CE . It is dedicated to Lord Shiva. The temple is part of the UNESCO World Heritage Site. 10 Annamalaiyar Temple 101,171 Tiruvannamalai date=January 2021|bot=InternetArchiveBot|fix-attempted=yes}} 11 Dakshineswar Kali Temple 101,171 Kolkata Dakshineswar Kali Temple is situated on the eastern bank of the Hooghly River (a distributary of the Ganga River) in Kolkata. The presiding deity of the temple is Kali. p.11 The temple was built in 1855 by Rani Rashmoni, a devotee of Kali. The temple complex is spread over 25 acres (101,171 m2) . It is one of the largest temple in Bengal. 12 Rajagopalaswamy temple 93,000 Mannargudi Rajagopalaswamy temple is a Vaishnavite shrine located in the town of Mannargudi, Tamil Nadu, India. The temple is called Dakshina Dwarka (Southern Dwarka) along with Guruvayoor by Hindus. 13 Ekambareswarar Temple 92,860 Kanchipuram Ekambareswarar Temple is a Hindu temple dedicated to Lord Shiva, located in Kanchipuram in the state of India. 14 Varadharaja Perumal Temple 81,000 Kanchipuram Varadharaja Perumal Temple is dedicated to Lord Vishnu located in the holy city of Kanchipuram, Tamil Nadu, India. It is one of the 108 Divya Desams.Hindu Pilgrimage: A Journey Through the Holy Places of Hindus All Over India. Sunita Pant Bansal. page 82 15 Thyagaraja Temple 80,937 Tiruvarur Sri Thyagaraja temple at Tiruvarur is dedicated to Lord Shiva. The temple chariot of this temple is the largest in Tamil Nadu. 16 Jambukeswarar Temple, Thiruvanaikaval 72,843 Tiruchirappalli Thiruvanaikaval (also Thiruvanaikal) is a Shiva temple in Tiruchirapalli, in the state of India. The temple was built by Kocengannan (Kochenga Chola), around 1,800 years ago. 17 Nellaiappar Temple 71,000 Tirunelveli This temple was dedicated to Shiva. It was built 2500–3000 years ago. 18 Meenakshi Amman Temple 70,050 Madurai Meenakshi Sundareswarar Temple or Meenakshi Amman Temple is dedicated to Lord Shiva and his wife, Parvati. 19 Vaitheeswaran Koil 60,780 Vaitheeswaran Koil Vaitheeswaran Temple is located in India, dedicated to the god Shiva. 20 Jagannath Temple, Puri 37,000 Puri The Jagannath Temple in Puri is a famous Hindu temple dedicated to Jagannath (Vishnu). It is located in the coastal town of Puri in the state of Odisha, India. 21 Thrissur Vadakkunnathan Temple 36,000 Thrissur Vadakkumnathan Temple is an ancient Hindu temple dedicated to Shiva at city of Thrissur, of Kerala state in India. This temple is a classical example of the architectural style of Kerala and has one monumental tower on each of the four sides in addition to a kuttambalam. Mural paintings depicting various scenes from the Mahabharata can be seen inside the temple. 22 Birla Mandir 30,000 Delhi The Laxminarayan Temple (also known as the Birla Mandir) is a Hindu temple dedicated to Laxminarayan in Delhi, India. == References == 24\\. 10 Most Amazing and Famous Temples in India *. Category:Hindu temples",
 "title": "List of largest Hindu temples"
}