{
 "id": "632726",
 "text": "Mamluk dynasty (also known as the Slave dynasty) of delhi was a dynasty established in Delhi, Indian subcontinent by Qutb ud-Din Aibak. He was a Turkic slave of Muhammad of Ghor. The Mamluk dynasty ruled from 1206 to 1290 and was the first of five dynasties of the Delhi Sultanate, which lasted until 1526.Walsh, pp. 68-70Anzalone, p. 100 ==History== The Mamluk, literally meaning owned, was a soldier of slave origin (came from a slave background) who had converted to Islam. In the 9th century the Mamluks became a powerful military caste in Muslim societies. Mamluks held political and military power most notably in Egypt, but also in Levant, Iraq, and the Indian subcontinent. In 1206, Muhammad of Ghor, Sultan of the Ghurid dynasty was assassinated.George F. Nafziger, Mark W. Walton, Islam at War: A History, (Praeger Publishers, 2003), 56. Since he had no children, his empire split into minor sultanates led by his former mamluk generals. Tajuddin Elduz. Muhammad bin Bakhtiyar Khilji settled in Bengal. Nasir-ud-Din Qabacha became the sultan of Multan. Qutb ud-Din Aibak settled in delhi, made it his permanent capital and home, Also, became the sultan of Delhi and that was the beginning of the Slave dynasty. However, his reign as the sultan of Delhi was short lived as he died in 1210. His son Aram Shah came to the throne, only to be assassinated by Iltutmish in 1211. The Sultanate under Iltutmish established friendly contacts with the Abbasid Caliphate between 1228–29. He had managed to keep India unaffected by the invasions of Genghis Khan and his successors .Following the death of Iltutmish in 1236, a series of weak rulers remained in power. The throne shifted from Rukn ud din Firuz to Razia Sultana until Ghiyas ud din Balban, the last powerful ruler of this dynasty. The Khalji dynasty was established, when Jalal ud din Firuz Khalji overthrew the last of the Slave dynasty rulers, Muiz ud din Qaiqabad, the great grandson of Balban. ==Sultans== * Qutb ud-Din Aibak * Aram Shah * Shams-ud-din Iltutmish * Rukn ud din Feroze * Razia Sultan * Muiz-ud-din Bahram * Ala-din Masud * Nasir-ud-din Mahmmuad * Ghiyath-ud-din Balban * Muiz-ud-din Muhammad Qaiqabad ==Notes== ==References== * * * Dynastic Chart The Imperial Gazetteer of India, v. 2, p. 368\\. ==Further reading== * ==Other websites== *Encyclopædia Britannica (Online Edition) – Delhi sultanate Category:13th century in India Category:History of India Category:History of Bangladesh Category:Medieval history of Pakistan Category:1290s disestablishments Category:13th-century disestablishments in Asia Category:1200s establishments in Asia Category:1206 establishments",
 "title": "Mamluk dynasty (Delhi)"
}