{
 "id": "632871",
 "text": "al-Nusra Front or Jabhat al-Nusra (), known as Jabhat Fatah al-Sham () is one of the organizations fighting in the Syrian Civil War. Since July 2016, it has also been known as Jabhat Fateh al-Sham (, transliteration: Jabhat Fataḥ al- Šām). It has also been called al-Qaeda in Syria or al-Qaeda in the Levant. They are a Salafist organization and want to create an Islamic state in the country. The group announced its formation on 23 January 2012. The United States designated Jabhat al-Nusra as a foreign terrorist organization, followed by the United Nations Security Council and many other countries. It was the official Syrian branch of al-Qaeda until July 2016, when it became a separate organization. In early 2015, the group became one of the major components of the powerful jihadist joint operations room named the Army of Conquest, which took over large territories in Northwestern Syria. It also operates in neighbouring Lebanon.Al Qaeda-linked group Al Nusra Front claims deadly car bombing in Lebanese capital Beirut ABC, 21 January 2014 In November 2012, The Washington Post described al-Nusra as the most successful arm of the rebel forces. In July 2016, al-Nusra formally separated from al-Qaeda and re- branded as Jabhat Fateh al-Sham (\"Front for the Conquest of the Levant\"). On 28 January 2017, following violent clashes with Ahrar al-Sham and other rebel groups, Jabhat Fateh al-Sham merged with four other groups to become Tahrir al-Sham. According to spokesmen of a moderate wing of the Free Syrian Army (FSA), in November 2012 Nusra had between 6,000 and 10,000 fighters, which was 7–9% of the FSA's total fighters. Commentator David Ignatius for The Washington Post described Nusra then as the most aggressive and successful arm of the FSA. The United States Department of State stated likewise: \"From the reports we get from the doctors, most of the injured and dead FSA are Jabhat al-Nusra, due to their courage and [the fact they are] always at the front line\". On 10 December 2012, the U.S. designated Nusra a foreign terrorist organization and an alias of Al Qaeda in Iraq. That decision made it illegal for Americans to deal financially with Nusra. Days earlier, the American ambassador to Syria, R. Ford, had said: \"Extremist groups like Jabhat al-Nusra are a problem, an obstacle to finding the political solution that Syria's going to need\". == References == Category:Establishments in Syria Category:2012 establishments in Asia Category:2016 disestablishments in Asia Category:Al-Qaeda Category:Civil wars Category:History of Islam Category:Islamic organizations Category:Islamist militant groups",
 "title": "Al-Nusra Front"
}