{
 "id": "632904",
 "text": "The National Film Award for Best Feature Film in Tamil is one of the National Film Awards presented every year by the Directorate of Film Festivals. This organisation was set up by the Ministry of Information and Broadcasting, India. It is one of several awards presented for feature films. It was awarded along with Rajat Kamal (Silver Lotus). The National Film Awards was established in 1954. These awards are the most important film awards in India. These are awarded for the best films of the Indian cinema. == Winners == Award includes 'Rajat Kamal' (Silver Lotus Award) and cash prize. Following are the award winners over the years: Awards legends List of award films, showing the year (award ceremony), producer(s), director(s) and citation Year Film(s) Producer(s) Director(s) 1954 Malaikkallan Pakshiraja Studios S. M. Sriramulu Naidu Andha Naal AVM Productions S. Balachander Edhir Paradhathu Saravanabhava Unity Pictures Ch. Narayanamoorthy 1955 Mangaiyar Thilakam Vaidya Films L. V. Prasad 1956 Kuladeivam S. K. Pictures Krishnan–Panju 1957 Mudhalali M. A. V. Pictures Muktha V. Srinivasan 1958 Thanga Padhumai Jupitor Pictures Pvt Ltd. A. S. A. Samy Annaiyin Aanai A. M. M. Ismayil Ch. Narayanamoorthy 1959 Bhaaga Pirivinai G. N. Velumani A. Bhimsingh Veerapandiya Kattabomman B. R. Panthulu B. R. Panthulu Kalyana Parisu Sarvashri S. Krishnamurthy T. Govindarajan C. V. Sridhar C. V. Sridhar 1960 Parthiban Kanavu Jubilee Films Pvt Ltd. D. Yoganand Paadhai Theriyudhu Paar Kumari Films Pvt Ltd. Nemai Ghosh Kalathur Kannamma AVM Productions A. Bhimsingh 1961 Kappalottiya Thamizhan Padmini Pictures B. R. Panthulu Pasamalar Rajamani Pictures A. Bhimsingh Kumudham Modern Theatres Adurthi Subba Rao 1962 Nenjil Oor Alayam Chithralaya C. V. Sridhar Annai AVM Productions Krishnan- Panju Sarada Al. Srinivasan K. S. Gopalakrishnan 1963 Naanum Oru Penn Murugan Brothers A. C. Tirulokchandar Karpagam K. S. Sabarinathan K. S. Gopalakrishnan Karnan B. R. Panthulu B. R. Panthulu 1964 Kai Koduttha Dheivam M. S. Velappan K. S. Gopalakrishnan Pazhani A. P. Chinnappa A. Bhimsingh Server Sundaram AVM Productions Krishnan–Panju 1965 Kuzhandaiyum Deivamum AVM Productions Krishnan–Panju Thiruvilayadal Shri Vijayalakshmi Pictures A. P. Nagarajan 1966 Ramu AVM Productions A. C. Tirulokchandar 1967 Aalayam M/s. Sunbeam Thirumalai Mahalingam 1968 Thillana Mohanambal Shri Vijayalakshmi Pictures A. P. Nagarajan 1969 Iru Kodugal N. Selvaraj B. Doraisamy N. Krishan V. Govindarajan K. Balachander 1970 Raman Ethanai Ramanadi P. Madhavan P. Madhavan 1971 Veguli Penn Abdul Kabar S. S. Devadass 1972 Pattikada Pattanama P. Madhavan P. Madhavan 1973 Dikkatra Parvathi M. Lakshmikantha Reddy H. M. Sanjeeva Reddy Singeetham Srinivasa Rao 1974 No Award 1975 Apoorva Raagangal P. R. Govindarajan J. Duraisamy K. Balachander 1976 No Award 1977 Agraharathil Kazhuthai None John Abraham 1978 No Award 1979 Pasi G. Lalitha Durai * 1980 Nenjathai Killathe K. Rajgopal Chetty J. Mahendran 1981 Thaneer Thaneer P. R. Govindarajan J. Duraisamy K. Balachander 1982 Ezhavathu Manithan Palai N. Shanmugam K. Hariharan 1983 Oru Indhiya Kanavu T. P. Varadarajan Vijayalakshmi Desikan Komal Swaminathan 1984 Achamillai Achamillai Rajam Balachander V. Natarajan K. Balachander 1985 Muthal Mariyathai Bharathiraja Bharathiraja 1986 Mouna Ragam G. Venkateswaran Mani Ratnam 1987 Veedu Kaladas Balu Mahendra 1988 No Award 1989 Pudhea Paadhai A. Sundaram R. Parthiban 1990 Anjali M/S Sujatha Productions (P) Ltd Mani Ratnam 1991 Vanna Vanna Pookkal Kalaipuli S. Dhanu Balu Mahendra 1992 Thevar Magan Kamal Haasan Bharathan 1993 Mahanadi Gopal Reddy Santhana Bharathi 1994 Nammavar R. Venkatarama Reddy K. S. Sethumadhavan 1995 Anthimanthaarai Tilaka Ganesh (Mega Movie Makers) Bharathiraja 1996 Kadhal Kottai Sivashakthi Pandian Agaththian 1997 The Terrorist A. Sriram Santosh Sivan 1998 Housefull R. Parthiban R. Parthiban 1999 Sethu A. Kandasamy Bala 2000 Bharati Messers Media Dreams (P) Ltd Gnana Rajasekaran 2001 Ooruku Nooruper L. Suresh B. Lenin 2002 Kannathil Muthamittal Mani Ratnam G. Srinivasan Mani Ratnam 2003 Iyarkai V. R. Kumar S. P. Jananathan 2004 Navarasa Sunil Doshi Santosh Sivan 2005 Aadum Koothu Light and Shadow Movie Makers T. V. Chandran 2006 Veyil S. Shankar Vasanthabalan 2007 Periyar M/s Liberty Creations Ltd. Gnana Rajasekaran 2008 Vaaranam Aayiram Venu Ravichandran Gautham Menon 2009 Pasanga M. Sasikumar Pandiraj 2010 Thenmerku Paruvakaatru Shibu Issac Seenu Ramasamy 2011 Vaagai Sooda Vaa S. Muruganandham N. Puranna A. Sarkunam 2012 Vazhakku Enn 18/9 N. Subhash Chandra Bose Balaji Sakthivel 2013 Thanga Meengal JSK Film Corporation Ram 2014 Kuttram Kadithal Chris Pictures & JSK Film Corporation G. Bramma 2015 Visaranai Wunderbar Films Vetrimaaran 2016 Joker Dream Warrior Pictures Raju Murugan 2017 To Let Prema Chezhian Chezhiyan == References == == Other websites == * Official Page for Directorate of Film Festivals, India * National Film Awards Archives Category:Cinema of India",
 "title": "National Film Award for Best Feature Film in Tamil"
}