{
 "id": "633071",
 "text": "Haikyu!! is a manga (Japanese comic) series made by Haruichi Furudate. Haikyu!! was made into an anime too. The anime is directed by Susumu Mitsunaka. The story is about high school volleyball in Miyagi. The main character is Shouyou Hinata. He is a first year student at Karasuno High School. Karasuno High School is the main high school in this story. Shouyou and his team begins the Karasuno boys' volleyball team's journey to the top in Spring Valley High and Inter-High. There are five rival high school in this story. Aoba Johsai, Nekoma, Date Tech, Fukuroudani Academy, and Shiratorizawa Academy. In the story, the Karasuno High School volleyball team plays against the rival schools and the team members have a wonderful springtime of life with volleyball. == Characters == === Shoyo Hinata === A first year student at Karasuno High School. His position is middle blocker. === Tobio Kageyama === A first year student at Karasuno High School. His position is setter. === Kei Tsukishima === A first year student at Karasuno High School. His position is middle blocker. === Tadashi Yamaguchi === A first year student at Karasuno High School. His position is middle blocker/soon to be setter. === Daichi Sawamura === A third year student at Karasuno High School. His position is wing spiker. He is also the captain of the volleyball team. === Koushi Sugawara === A third year student at Karasuno High School. His position is setter. He is also the vice-captain of the volleyball team. === Asahi Azumane === A third year student at Karasuno High School. His position is wing spiker. He is the volleyball team's ace. === Ryunosuke Tanaka === A second year student at Karasuno High School. His position is wing spiker. === Yu Nishinoya === A second year student at Karasuno High School. His position is libero. === Chikara Ennoshita === A second year student at Karasuno High School. His position is wing spiker. === Hisashi Kinoshita === A second year student at Karasuno High School. His position is wing spiker. === Kazuhito Narita === A second year student at Karasuno High School. His position is middle blocker. === Touru Oikawa === A third year student at Aoba Johsai High School. His position is setter. He is also the captain of the volleyball team. === Hajime Iwaizumi === A third year student at Aoba Johsai High School. His position is wing spiker. He is also the vice-captain and ace of the volleyball team. === Yutarou Kindaichi === A first year student at Aoba Johsai High School. His position is middle blocker. === Akira Kunimi === A first year student at Aoba Johsai High School. His position is wing spiker. === Kenma Kozume === A second year student at Nekoma High School. His position is setter. === Tetsurou Kuroo === A third year student at Nekoma High School. His position is middle blocker. He is also the captain of the volleyball team. === Lev Haiba === A first year student at Nekoma High School. His position is middle blocker. === Takanobu Aone === A second year student at Date Tech. His position is middle blocker. === Kenji Futakuchi === A second year student at Date Tech. His position is wing spiker. === Koutarou Bokuto === A third year student at Fukuroudani Academy. His position is wing spiker. He is also the captain and ace of the volleyball team. === Keiji Akaashi === A second year student at Fukuroudani Academy. His position is setter. He is also the vice-captain of the volleyball team. === Wakatoshi Ushijima === A third year student at Shiratorizawa Academy. His position is wing spiker. He is also the captain and ace of the volleyball team. == References == Category:Manga series Category:Production I.G",
 "title": "Haikyu!!"
}