{
 "id": "633349",
 "text": "The Battle of Fulford took place on the 20th September 1066 near York.DeVries, Kelly 2003. The Norwegian Invasion of England in 1066. Woodbridge, Suffolk: Boydell Press. The battle was between Viking invaders and English Earls. It was fought by, on one side, King Harald III of Norway (Harald Hardrada (Old Norse, meaning \"hard ruler\") and his English ally Tostig Godwinson. On the other side were two Earls, Edwin and Morcar. Tostig was the exiled brother of the English king Harold Godwinson. The battle was fought out on the outskirts of the village of Fulford, close to York. The battle was a decisive victory for the Viking army. The earls of York could have hidden behind the walls of their city. Instead, they met the Viking army across a river. All day the English tried to break the Viking shield wall but failed. Edwin and Morcar had survived the battle. York surrendered to the Norwegians. Harald had won the battle. One cause of the battle was that Earl Morcar had replaced Tostig as Earl of Northumbria. == Background == The Anglo-Saxon king Edward the Confessor died on 5 January 1066 without an heir.David C. Douglas. William the Conqueror. pp. 181. The only surviving member of the royal family was Edgar, the young son of Edward Ætheling. On the day of King Edward's funeral, 6 January, Harold Godwinson, the Earl of Wessex, rushed to London, where he was crowned king in the Abbey of Saint Peter of Westminster, by Ealdred, Archbishop of York.Barlow. Edward the Confessor. pp. 244–245. Harold Godwinson was elected as King by the Witenagemot, who had gathered in Westminster to celebrate the feast of Epiphany. However, two powerful earls, brothers Edwin of Mercia and Morcar of Northumbria, challenged his authority. Sources indicate that Harold moved north to confront them; however, in the end he got their loyalty by marrying their sister, Edith, the widow of Griffith of Wales. By securing the loyalty of Edwin and Morcar, Godwinson increased his strength in the north. These men were, in fact, the first barrier between Harald Hardrada and Harold Godwinson.Barlow, Frank 2002. The Godwins. London: Pearson Longman. The defeat of the earls had a big consequence. Because his enemies won, King Harold Godwinson had to force-march his troops , from London to York.Brown. Anglo-Norman studies III. Proceedings of the Battle Conference 1980. pp. 7–9. He did this within a week of Fulford. He surprised the Viking army and defeated them at the Battle of Stamford Bridge. In the meantime William, Duke of Normandy, had landed his army in Sussex on the south coast. Probably the engagements at Fulford Gate and at the Battle of Stamford Bridge seriously affected Harold's strength at the Battle of Hastings some three weeks later. There is no doubt that if Harold had not been diverted by the battles in the north, he would have been better prepared to fight William at Hastings and the result might have been different.Schofield, Guy 1966. The Third battle of 1066. In History Today, 16.Brown, R. Allen, ed. (1980). Anglo- Norman Studies III: Proceedings of the Battle Conference 1980. Woodbridge, Suffolk: Boydell Press. == References == Fulford Category:1066 in England Fulford",
 "title": "Battle of Fulford"
}