{
 "id": "633584",
 "text": "Harry Potter and the Deathly Hallows – Part 2 is a 2011 fantasy movie directed by David Yates and distributed by Warner Bros. Pictures. It is the second of two cinematic parts based on J. K. Rowling's 2007 novel of the same name. The movie, which is the eighth and final installment in the Harry Potter series, was written by Steve Kloves and produced by David Heyman, David Barron, and Rowling. The story continues to follow Harry Potter's quest to find and destroy Lord Voldemort's Horcruxes in order to stop him once and for all. == Plot == Harry, Ron and Hermione seek help from a goblin named Griphook, who helps them sneak into a magical bank. The trio break into Bellatrix Lestrange's bank vault and steal a cup which is a Horcrux (an object that Lord Voldemort has put part of his soul inside). They also soon figure out that another Horcrux, a diadem, is located in Hogwarts. The trio return to Hogwarts, where Severus Snape (who is a follower of Voldemort) is headmaster. Harry reveals to all the students that Snape killed Dumbledore. Snape tries to attack Harry but Professor McGonagall defends him and forces Snape to run away. McGonagall, the other teachers and the Order of the Phoenix members prepare to defend the school from Voldemort and his followers, who have come to stop Harry from getting the diadem. Ron and Hermione destroy the Horcrux cup that they stole earlier. With the help of Luna Lovegood and a ghost, Harry is able to find the diadem Horcrux. After a fight with Draco Malfoy and his two henchmen, the diadem is destroyed in a fire. Harry then realises that Voldemort's final Horcrux is his pet snake, Nagini. As Voldemort's forces attack Hogwarts, the trio overhear Voldemort attack Snape, as he believes killing Snape will make him the Master of the Elder Wand (which belonged to Dumbledore, who was killed by Snape). As Snape dies, Harry takes his memories. Harry looks into Snape's memories and discovers that Snape was in love with Harry's mother and joined Dumbledore so that he could try to save her from Voldemort when he went to kill the Potter family when Harry was just a baby. It is also revealed that Snape was a spy and he and Dumbledore plotted for Snape to kill him. At the end of the memories, it is revealed that Harry is an \"accidental Horcrux\", meaning that a part of Voldemort lives inside him and that he must die. Harry travels into a forest, where he willingly lets Voldemort kill him. The part of Voldemort that lives inside Harry is destroyed and Harry himself survives the curse. Voldemort and his followers, believing Harry is dead, present Harry's body to all the students of Hogwarts. However, Neville Longbottom, one of Harry's friends, steps forward and kills Nagini with the Sword of Gryffindor, destroying Voldemort's final Horcrux. Harry reveals that he is alive and many of Voldemort's followers run away, including the Malfoy family. Voldemort's remaining followers attack the school students, staff and parents. Ron's mother, Molly, manages to kill Bellatrix. Voldemort tries to use the Elder Wand to kill Harry. However, Harry explains that the wand never belonged to Snape because it was Draco who took it from Dumbledore. Harry then reveals that when he defeated Draco in a fight a few days prior, meaning that Harry is the master of the Elder Wand. Voldemort does not believe him and attempts to kill Harry. However, the spell rebounds and Voldemort turns to dust. Harry goes back inside the school and sees everyone recovering from the battle. ==Cast== * Daniel Radcliffe as Harry Potter * Rupert Grint as Ron Weasley, one of Harry's best friends. * Emma Watson as Hermione Granger, Harry's other best friend, and the brain of the trio. * Helena Bonham Carter as Bellatrix Lestrange, a Death Eater and Sirius Black's cousin and murderer. * Robbie Coltrane as Rubeus Hagrid, Harry's half-giant friend and a former member of the staff of Hogwarts. * Warwick Davis as Filius Flitwick, the Charms master and Head of the Ravenclaw house at Hogwarts; and Griphook, a goblin and former employee at Gringotts Bank. * Tom Felton as Draco Malfoy, Harry's former school rival, a former Death Eater, and son of Lucius and Narcissa Malfoy (Helen McCrory). * Ralph Fiennes as Lord Voldemort, a twisted, evil, power-hungry, powerful wizard, and the founder and supreme leader of the Death Eaters. * Michael Gambon as Albus Dumbledore, the late headmaster of Hogwarts * John Hurt as Mr. Ollivander, a wandmaker abducted by the Death Eaters. * Jason Isaacs as Lucius Malfoy, Draco Malfoy's father and a disgraced Death Eater. * Kelly Macdonald as Helena Ravenclaw, the ghost of Ravenclaw at Hogwarts. * Gary Oldman as Sirius Black, Harry's late godfather. * Alan Rickman as Severus Snape, former Head of the Slytherin House and Potions and Defence Against the Dark Arts teacher and the new headmaster of Hogwarts. * Maggie Smith as Minerva McGonagall, the Transfiguration teacher and the Head of the Gryffindor house at Hogwarts. * David Thewlis as Remus Lupin, a member of the Order of the Phoenix and a former Defence Against the Dark Arts teacher at Hogwarts. * Julie Walters as Molly Weasley, the Weasley matriarch. == References == Category:2011 fantasy movies Harry Potter 7 Category:Movies based on books Harry Potter 7 Category:Warner Bros. movies Category:Movies about giants",
 "title": "Harry Potter and the Deathly Hallows – Part 2"
}