{
 "id": "633512",
 "text": "Kim Song-i (born 10 August 1994 in Pyongyang) is a table tennis player from North Korea. She won with the team at the World Championships 2016 as well as the Olympics 2016 in the singles the bronzemedal. She is a defender, with long pips at the backhand. == Career == At the age of 16 she was see on the international events, at the Youth Olympics she reached the Quarterfinals and with the team the 4th place and climbs in the world ranking to place 121. At the China Open 2013 Kim took part in the U21-class, there she came to the semifinals. This was er first medal on the World Tour. At the Asian Games 2014 Kim took bronze with the Korean Team. 2015 she took part in the Asian Championships, the China- and the Pyongyang Open, where she beat amongst other things the top player Mima Ito. 2016 Kim became the third place with the team at the Team-Worldchampionships 2016 in Malaysia and was nominated for the Olympics, there she as recently as lost in the semifinals against Ding Ning. In this month she came on place 26 in the world rankings. At the Pyongyang Open in the same year, she came to the final, where she beat the defensiv- player Ri Myong-sun, too. In the doubles she took gold, too. At the World Championships 2017, she reached the Round of 16, where she lost to Liu Shiwen. 2018 she took bronze with the team at the World Team Cup. In the semifinals they lost to China. == Results from the ITTF-databank == Association Competititon Year City Country Singles Doubles Mixed Team U-21 PRK Asian Games 2014 Suwon KOR last 16 Semifinals PRK Asian Championships 2017 Wuxi CHN last 16 last 16 5th place PRK Asian Championships 2015 Pattaya THA last 64 Quarterfinals 5th place PRK Olympic Games 2016 Rio de Janeiro BRA 3rd place Quarterfinals PRK Olympic Youth Games 2010 Singapore SIN Quarterfinals 4th place PRK Universaide 2017 Taipeh TPE Semifinals PRK ITTF Challenge Series 2017 Pyongyang PRK Gold Gold PRK ITTF Challenge Series 2016 Pyongyang PRK Gold Gold PRK ITTF World Tour 2015 Chengdu CHN last 16 Semifinals PRK ITTF World Tour 2015 Pyongyang PRK Quarterfinals Gold Gold PRK World Championships 2017 Düsseldorf GER last 16 PRK ITTF World Tour 2013 Suzhou CHN last 64 last 16 Semifinals PRK World Championships 2016 Kuala Lumpur MAS Semifinals PRK World Team Cup 2018 London ENG Semifinals == References == __FORCETOC__ Category:North Korean sportspeople Category:1994 births Category:Living people Category:Table tennis players Category:Olympic bronze medalists Category:Medalists at the 2016 Summer Olympics",
 "title": "Kim Song-i"
}