{
 "id": "633684",
 "text": "Muthuvel Karunanidhi Alagiri commonly known as M. K. Alagiri, is an Indian politician from Tamil Nadu. He was the former Cabinet Minister of Chemicals and Fertilizershttp://eci.nic.in/eci_main/archiveofge2009/Stats/VOLI/25_ConstituencyWiseDetailedResult.pdf from 13 June 2009 – 20 March 2013. ==Birth== Alagiri was born on 30 January 1951. He was the second son of former Chief Minister of Tamil Nadu Karunanidhi. He was born to M. Karunanidhi and his second wife Dayalu Ammal. Azhagiri after his marriage on 10 December 1972, settled in Madurai. His wife is Kanthi Azhagiri. ==Controversies (quarrel and fights)== M. Karunanidhi always wanted his son M. K. Stalin to be his successor as the leader of Dravida Munnetra Kazhagam party. Alagiri didn't hold any post in DMK party. But he had the command in Madurai region. Alagiri was the important person who made DMK win in 2008 by-elections. After these victories, he was appointed as the organizing secretary of DMK in southern Tamil Nadu districts. Following this Alagiri was given the ticket for Madurai Lok Sabha Constituency in 2009 general election. He won it and became a Cabinet Minister. There were lots of publicly held fights between the supporters of Stalin and Alagiri. This reached its peak when the Dinakaran daily's office were bombed by Alagiri supporters.Dinakaran is a part of the Sun TV group owned by Kalanidhi Maran (son of Murasoli Maran), the grand-nephew of Karunanidhi. This was because the daily published the result of a opinion polls. The poll was about people's wish of who will become the next leader of DMK. The results said that 70% of the people support Stalin while only 2% support Alagiri. In this attack case, 3 were dead . He was removed from the DMK party as member and as Secretary of South Zone on 24 January 2014. ==References== Category:Tamil Nadu politicians Category:1951 births Category:Living people Category:Members of the Lok Sabha Category:Dravida Munnetra Kazhagam politicians",
 "title": "M. K. Alagiri"
}