{
 "id": "633642",
 "text": "Pornhub is a pornographic video sharing website and the largest pornography site on the Internet. Pornhub was launched in Montreal by CEO Nick Henderson in 2007. Pornhub also has offices and servers in San Francisco, Houston, New Orleans and London. The website allows visitors to watch pornographic videos from a number of categories, including professional and amateur pornography. Users can take advantage of several features, including sharing videos on social media websites and liking or disliking them, in addition to sharing videos, users have the ability to use the camera on their smartphones, laptops, etc to see one another and have private 1 on 1 masturbation sessions via video chat. Users may also optionally register a free Pornhub account, which additionally allows them to post comments, download videos and add videos to their favourites, as well as upload videos themselves. Since 2012, Pornhub has hosted several events and campaigns to raise awareness of certain issues or raise money, as well as to help promote its brand. In March 2010, Pornhub was bought by Manwin (now known as MindGeek), which also owns other pornographic websites. == Blocks and bans == The website was blocked by the Great Firewall in China from September 2013. On March 12, 2014, Pornhub was blocked in Russia because one actress looked too young, leading some viewers to think she was a minor. On January 2017, Pornhub was blocked in the Philippines. Pornhub and similar pornography websites were blocked in order to comply with (follow) the Anti-Child Pornography Law. Pornhub was blocked in September 2016 in Russia due to \"spreading harmful information to children\". On April 2017, it was unbanned, but it now asks users to specify their age. Now, Russian users must provide their cellphone numbers or passports to access Pornhub. In October 2018, the Uttarakhand High Court re-banned Pornhub in India, enforced by blocks from internet providers of India. In order to get around the ban, Pornhub created a mirror website at Pornhub.net. In February 2024, the Attorney General of the state of Texas sued Aylo/Pornhub for allegedly not obeying the state's legal age verification law. As of March 2024, Pornhub and other Aylo-owned websites have blocked access in Texas, due to the adoption of an age verification law which usually mandates age verification through the use of an identity document. In states where Pornhub is blocked, which also include Arkansas, Louisiana, Mississippi, Montana, North Carolina, Utah, and Virginia; a message is displayed criticizing such laws. ==References== == Other websites == Category:2007 establishments in Canada Category:MindGeek Category:Pornographic websites Category:Canadian websites",
 "title": "Pornhub"
}