{
 "id": "633636",
 "text": "The sovereign is a gold coin of the United Kingdom, with a nominal value of one pound sterling. It has been struck from 1817 until the present day. it was originally a circulating coin accepted in Britain and elsewhere in the world. Now it is a bullion coin and is sometimes mounted in jewellery. A bullion coin is a coin struck from precious metal and kept as a store of value or an investment, rather than used in day-to-day commerce. The United Kingdom defines investment coins as \"coins that have been minted after 1800, have a purity of not less than 900 thousandths and are, or have been, legal tender in their country of origin\". In most recent years, it has the well-known design of Saint George and the Dragon on the reverse—the initials () of the designer, Benedetto Pistrucci, is to the right of the date. The British government promoted the use of the sovereign as an aid to international trade. The Royal Mint took lightweight gold coins out of circulation. From the 1850s until 1932, the sovereign was also struck at colonial mints, initially in Australia, and later in Canada, South Africa and India. They have been struck again in India since 2013 for the local market. The sovereigns issued in Australia initially carried a unique local design, but by 1887, all new sovereigns bore Pistrucci's George and Dragon design. Strikings there were so large that by 1900, about 40 per cent of the sovereigns in Britain had been minted in Australia. With the start of the First World War in 1914, the sovereign vanished from circulation in Britain, replaced by paper money, and it did not return after the war, though issues at colonial mints continued until 1932. The coin was still used in the Middle East, and demand rose in the 1950s, which the Royal Mint eventually responded to by striking new sovereigns in 1957. It has been struck since then both as a bullion coin and, beginning in 1979, for collectors. Though the sovereign is no longer in circulation, it is still legal tender in the United Kingdom. == References == Category:Former currencies of the United Kingdom Category:Gold coins",
 "title": "Sovereign (British coin)"
}