{
 "id": "63373",
 "text": "John William \"Will\" Ferrell (; born , 1967)According to the State of California. California Birth Index, 1905–1995. Center for Health Statistics, California Department of Health Services, Sacramento, California. At Ancestry.com is an American actor, comedian, and producer. He began his successful career as a cast member of Saturday Night Live. He has since appeared in many different movies, such as Blades of Glory, Elf, Anchorman: The Legend of Ron Burgundy, Talledega Nights: The Ballad of Ricky Bobby, Old School and Despicable Me 4. ==Early life== Ferrell was born in Irvine, California on July 16, 1967 He is the son of Betty Kay (née Overman), a teacher who taught at Old Mill School elementary school and Santa Ana College, and Roy Lee Ferrell Jr., a musician with The Righteous Brothers. His parents were both natives of Roanoke Rapids, North Carolina, and moved to California in 1964.Riddick & Rountree and Related Families From Northeast North Carolina by Betty Smith Hobbs He has a younger brother named Patrick.Biography Today, p.54 When he was 8, his parents divorced. Ferrell said of the divorce: \"I was the type of kid who would say, 'Hey, look at the bright side! We'll have two Christmases'.\" ==Filmography== Year Title Role US Gross Also 1995 Bucket of Blood Young Man Made for TV Criminal Hearts Newscaster 1997 Austin Powers: International Man of Mystery Mustafa US $53.9 million Men Seeking Women Al 1998 A Night at the Roxbury Steve Butabi US $30.3 million The Thin Pink Line Darren Clark 1999 Superstar Sky Corrigan/God US $30.6 million Dick Bob Woodward US $6.2 million Austin Powers: The Spy Who Shagged Me Mustafa US $206. million The Suburbans Gil 2000 The Ladies Man Lance DeLune US $13.6 million Drowning Mona Cubby the Funeral Director US $15.4 million 2001 Zoolander Mugatu US $45.2 million Jay and Silent Bob Strike Back Federal Wildlife Marshal Willenholly US $30.1 million 2002 Boat Trip Brian's Boyfriend US $8.6 million 2003 Elf Buddy US $173.4 million Old School Frank \"the Tank\" Ricard US $74.6 million 2004 Melinda and Melinda Hobie US $3.8 million Anchorman: The Legend of Ron Burgundy Ron Burgundy US $84.1 million Wake Up, Ron Burgundy: The Lost Movie Ron Burgundy Starsky & Hutch Big Earl US $88.2 million The Incredibles Jack The Tank Sergeant US $261.4 million Oh, What a Lovely Tea Party Himself 2005 The Producers Franz Liebkind US $19.4 million Wedding Crashers Chazz Reinhold US $209.2 million Winter Passing Corbit Bewitched Jack Wyatt/Darrin US $62.3 million Kicking & Screaming Phil Weston US $52.6 million The Wendell Baker Story Dave Bix 2006 Stranger than Fiction Harold Crick US $40.1 million Talledega Nights: The Ballad of Ricky Bobby Ricky Bobby US $148.2 million Curious George Ted/The Man in the Yellow Hat US $58.3 million 2007 Blades of Glory Chazz Michael Michaels US $118.2 million 2008 Semi-Pro Jackie Moon US $33.4 million Step Brothers Brennan Huff 2009 Land of the Lost Dr. Rick Marshall $49.4M The Goods: Live Hard, Sell Hard Craig McDermott $15.1M Uncredited Also Producer SpongeBob's Truth or Square Himself 2010 The Other Guys Detective Allen Gamble $119M Also Executive Producer Megamind Megamind $147M Voice Role Hubworld Himself Guest star Season 1, Episode 1 Everything Must Go Nick Halsey $2.7M 2012 Casa de Mi Padre Armando Alvarez Also Producer Tim and Eric's Billion Dollar Movie Damein Weebs Also Producer/Co-Producer The Campaign Cam Brady Also Producer/Co-Producer 2013 Anchorman 2: The Legend Continues Ron Burgundy Also writer and producer 2014 The Lego Movie President Business Voice Role 2015 Get Hard James King Also producer Daddy's Home Brad Also Producer 2016 Zoolander 2 Jacobim Mugatu Post-Production ==Television work== * Saturday Night Live (cast member from 1995 to 2002) * Cow and Chicken (1997–2001) (voice in various episodes) * Saturday Night Live: Presidential Bash 2000 (2000) * Undeclared (guest star) * The Oblongs (2001–2002) (voice) * King of the Hill (voice) * The Tom Green Show (guest star) * The Naked Trucker and T-Bones Show (guest star) * Ant and Dec's Saturday Night Takeaway (voiceover and guest) * Family Guy (voices in various episodes) ==References== Category:1967 births Category:Living people Category:American voice actors Category:American movie actors Category:American television actors Category:People from Irvine, California Category:Actors from Orange County, California Category:Comedians from California Category:Mark Twain Prize recipients",
 "title": "Will Ferrell"
}