{
 "id": "633753",
 "text": "{{Infobox writer | name = Sandra Cisneros | image = | imagesize = | caption = Cisneros in 2022 | birth_date = | birth_place = Chicago, Illinois, US | occupation = Novelist, poet, short story writer, artist | nationality = Mexican-American | period = 1980–present | genre = | subject = | movement = | notableworks = The House on Mango Street, Woman Hollering Creek and Other Stories | awards = American Book Award, MacArthur Genius Grant | signature = | website = }} Sandra Cisneros (born December 20, 1954) is an author from Chicago, Illinois. She is famous for her book \"The House on Mango Street\". It has sold six million copies and been translated into over 20 languages. The House on Mango Street is a series of vignettes. A vignette is a brief incident or scene. The girl in the novel goes through changes from childhood to adulthood. Sandra studied at Loyola University of Chicago and the University of Iowa. Her books are about issues between other races, classes, and genders. == Family == Sandra is the second child of Ernesto Cisneros de Moral and Elvira Cordero Anguiano. They had seven children together, one girl and six boys. There was one other daughter, but she died as a baby. Sandra's father wanted his family of boys. During her childhood, because of sexism, her father pushed her over the limits. Her father moved the family between Mexico City and Chicago, causing Sandra to be shy during her childhood. She didn't make close friends for pretty long. Her mother was a strong woman who wanted Sandra to achieve her goal. == Awards == * American Book Award - 1985 * Lannan Literary Award for Fiction - 1991 * Anisfield-Wolf Book Award for Fiction - 1993 * MacArthur Fellowship Award - 1995 * Texas Medal of Arts - 2003 * National Medal of Arts - 2016 (Presented by Barack Obama) == Related pages == *List of poets from North America == References == Category:1954 births Category:Living people Category:Writers from Chicago",
 "title": "Sandra Cisneros"
}