{
 "id": "63386",
 "text": "Christian theology is the study of Christian belief. Christian theologians use analysis and argument to understand, explain, test, critique, defend, or promote Christianity. Christian theology starts with the New Testament. Saint Paul, in his letters, and his speeches (Acts of the Apostles), draws upon his training as a rabbi and on his experience of Christ. He started outside Damascus to explain to Jews and Gentiles the meaning of the crucifixion and resurrection of Jesus. In the History of Christianity, later writers such as Luther and John Calvin have stressed the Bible as the basis of theology. The bible as a source is not without controversy. Catholic and Orthodox theologians have also stressed the importance of Church tradition for the faith. Thomas Aquinas and Saint Augustine are among the most important writers within the Roman Catholic Church. Differences in theology have led to the many denominations within Christianity. This started with the separation of Jesus' followers from Judaism. Later came the Great Schism and the Reformation. After Luther's quarrel with the Pope, Reformed churches like the Lutherans and Baptists are established. Calvinism is very important within Protestantism, although the followers of Jacob Arminius do not accept it. Attempts at compromise in England between the Catholics and Puritans lead to the establishment of the Church of England. Later movements include Methodism, Liberal Christianity, Pentecostalism, and Liberation theology. == Christian creeds == Many important ideas in Christian theology are summarized in statements called creeds. These were usually written by councils of Christians as a statement of their most central beliefs. Most major Christian churches agree with the Nicene Creed. == The question of evidence == Most scholars of antiquity agree that Jesus existed.Robert M. Price \"Jesus at the Vanishing Point\" in The Historical Jesus: Five Views edited by James K. Beilby & Paul Rhodes Eddy, 2009 InterVarsity, p. 61Jesus Now and Then by Richard A. Burridge and Graham Gould (April 1, 2004) p. 34Michael Grant (1977), Jesus: An Historian's Review of the Gospels There is no indication that writers in antiquity who opposed Christianity questioned the existence of Jesus.Encyclopedia of theology: a concise Sacramentum mundi by Karl Rahner 2004 pp. 730–731Van Voorst, Robert E (2000). Jesus Outside the New Testament: An Introduction to the Ancient Evidence. Eerdmans Publishing. p. 15 However, there is no physical or archaeological evidence for Jesus, and all the sources we have are documentary. The sources for the historical Jesus are mainly Christian writings, such as the gospels and the letters of the apostles. All sources that mention Jesus were written after his death. The New Testament represents sources from the wide variety of writings in the first centuries AD that are related to Jesus. The authenticity and reliability of these sources have been questioned by many scholars, and few events mentioned in the gospels are universally accepted.Mark Allan Powell 1998. Jesus as a figure in history: how modern historians view the man from Galilee. page 181 Strauss' Life of Jesus was the book which raised all these issues to the surface.Strauss, David Friedrich 1835 (English ed 1856). The life of Jesus, critically examined. In its 451 pages Strauss argued that: #The Old Testament was Jewish mythology, for which there was no adequate evidence at all. #Miracles in the New Testament were mythical additions, not factual. #None of the New Testament was written at the time of the events. #The Church as it was in the 19th century had little connection with Jesus.Summary from Watson, Peter 2009. Ideas: a history. Volume II From Fire to Freud. London, The Folio Society. p274. ==Related pages== * John Calvin * Martin Luther * Eastern Orthodoxy * Augustine of Hippo * Dietrich Bonhoeffer ==Further reading== * Kümmel W.G. 1957. The New Testament: the history of the investigation of its problems. London. * Lürmann, Dieter 1989. An itinerary for New Testament study. SCM Press & Trinity Press International. * McGrath, Alister Christian theology: an introduction. ==Other websites== * Catholic encyclopaedia * Spindleworks (Reformed) * Orthodox resources * Catholicism and Feminism * Queer theology at the crossroads ==References== Category:Religions Category:Christianity Category:History of Europe",
 "title": "Christian theology"
}