{
 "id": "634086",
 "text": "Manuel Turizo Zapata, better known as Manuel Turizo and by the acronym MTZ (born 12 April 2000) is a Colombian singer and songwriter. Born in Montería, Colombia. He is recognized for his hit single \"Una Lady Como Tú\" that won him great popularity. == Career == His musical career comes with the release of an EP composed of 3 songs of different styles. There he focuses on urban music, trap music and reggaeton. In December 2016, he launched \"Baila Conmigo\", produced by his brother Julián and Zensei, \"Vámonos\" and \"Una Lady Como Tú\", a theme that made him famous throughout America and part of Europe. On April 10, 2017 reissued \"Una Lady Como Tú\" and on August 4 premieres the remix of this track, with Nicky Jam. On October 20, \"Déjala Que Vuelva\" premieres, a collaboration he made with Piso 21. On November 28, the single \"Déjate Llevar\", a song by Juan Magán with the collaboration of Belinda, Snova, B-Case and Turizo, will be released. On December 7 he released the single \"Esperándote\". ==Discography== ===Singles=== ====As lead artist==== List of singles as lead artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album COL Peak chart positions for singles in Colombia: * \"Una Lady Como Tú\": * \"Bésame\": * \"Déjala Que Vuelva\": ARG Peak positions in Argentina: * \"Una Lady Como Tú\": * \"Déjala Que Vuelva\": MEX SPA US Latin US Latin Airplay US Latin Pop \"Vámonos\" 2016 — — — — — — — \"Baila Conmigo\" — — — — — — — \"Una Lady Como Tú\" 3 18 2 2 32 41 21 * AMPROFON: Diamond+Gold * PROMUSICAE: 4× Platinum \"Déjate Llevar\" 2017 — — — 8 — — — * AMPROFON: Platinum * PROMUSICAE: Platinum \"Esperándote\" 11 — 30 43 50 33 18 * PROMUSICAE: Gold \"—\" denotes a recording that did not chart or was not released in that territory. ====As featured artist==== List of singles as featured artist, with selected chart positions and certifications, showing year released and album name Title Year Peak chart positions Certifications Album COL ARG MEX SPA US Latin US Latin Airplay US Latin Pop \"Bésame\" 2017 6 — — 85 — — — \"Déjala Que Vuelva\" 7 7 3 13 16 8 6 * ASINCOL: 2× Platinum * PROMUSICAE: Platinum Ubuntu \"—\" denotes a recording that did not chart or was not released in that territory. == Awards and nominations == Year Award Category Work Result 2017 Kids' Choice Awards Colombia Favorite Song \"Una Lady Como Tú\" 2018 MTV Millennial Awards Hit of the Year \"Déjala que Vuelva\" Urban Explosion Himself Instagramer Level God Colombia Himself ==Notes== == References == Category:2000 births Category:Living people Category:Colombian singer-songwriters Category:Reggae music",
 "title": "Manuel Turizo"
}