{
 "id": "634146",
 "text": "Matthew Stanley Meselson (born May 24, 1930) is a geneticist and molecular biologist at Harvard University. He is known for his demonstration, with Franklin Stahl, of the semi-conservative DNA replication. After completing his Ph.D under Linus Pauling at the California Institute of Technology, Meselson became a Professor at Harvard University in 1960. He is there today as today as Thomas Dudley Cabot Professor of the Natural Sciences. In the famous Meselson–Stahl experiment of 1958 he and Frank Stahl showed with nitrogen isotope labeling that DNA is replicated semi-conservatively.Meselson, Stahl, and the Replication of DNA. A history of \"the most beautiful experiment in biology\", Frederic Lawrence Holmes, Yale University Press (2001). In addition, Meselson, François Jacob, and Sydney Brenner discovered the existence of messenger RNA in 1961. Meselson has investigated DNA repair in cells and how cells recognize and destroy foreign DNA, and, with Werner Arber, was responsible for the discovery of restriction enzymes. Since 1963 he has been interested in chemical warfare and biological defense and arms control. Meselson worked with Henry Kissinger under the Nixon administration to convince President Richard Nixon to renounce biological weapons, suspend chemical weapons production, and support an international treaty banning biological agents for hostile purposes. In 1972 this became the Biological Weapons Convention. Meselson has received many awards. His laboratory at Harvard investigates the biological and evolutionary nature of sexual reproduction, genetic recombination, and aging. Many of his past students are notable biologists, including Nobel Laureate Sidney Altman, Mark Ptashne, Susan Lindquist, Stephen F. Heinemann, and Richard I. Morimoto. == Related pages == *Meselson–Stahl experiment == References == Category:1930 births Category:Living people Category:Jewish American scientists Category:American geneticists Category:Foreign Members of the Royal Society Category:American biologists Category:University of Chicago alumni Category:Harvard University faculty Category:Educators from Denver Category:Scientists from Denver",
 "title": "Matthew Meselson"
}