{
 "id": "634358",
 "text": "An ice planet or icy planet is a type of planet that has a rocky core, but an icy crust. Ice planets consist of a global cyrosphere. Ice planets have frozen substances on the surface like water, methane, ammonia, and carbon dioxide. We don't have an Earth-sized ice planet in our system, but we do have small ice dwarf planets like Pluto and moons of jovian planets like Europa, Enceladus, or Triton. Beyond the solar system, OGLE-2005-BLG-390Lb, MOA-2007-BLG-192Lb, and half of Gliese 667, TRAPPIST-1, and Tau Ceti planets are examples of possible ice planets. == Characteristics and habitability == The surface can be composed of water, methane, ammonia, carbon dioxide (known as \"dry ice\"), carbon monoxide, nitrogen, and other volatiles. They would have surface temperatures of 260 K if composed primarily of water, 180 K if primarily composed of CO2 and ammonia, and 80 K if composed primarily of methane. On the surface, these planets are hostile to life forms, because they are cold. Some might have subsurface oceans, warmed by their cores or tidal forces from another nearby body. Liquid subsurface water might provide conditions, including fish, plankton, and microorganisms. Subsurface plants are inexistent due to no sunlight to produce photosynthesis. Microorganisms produce nutrients using chemicals called chemosynthesis and might produce food and energy. Some planets, if conditions are right, would have atmospheres and subsurface liquids like Saturn's moon Titan which could be habitable for exotic life forms. == Presence of ice planets == === In the solar system === Although we have many ice dwarf planets and moons in our system, we don't have any ice planets in our system under dynamical definitions. Most satellite planets are ice-rock (e. g. Ganymede, Titan, Callisto, Enceladus, and Triton) or primarily ice (e. g. Mimas, Tethys, Dione, Rhea, and Iapetus), and thus are ice planets under geophysical definitions of the term. The Kuiper belt dwarf planets Pluto, Makemake, Haumea, Quaoar, and Orcus are also one under geophysical definitions. Stern, Alan; Mitton, Jacqueline (2005). \"Pluto and Charon : ice worlds on the ragged edge of the solar system\". Weinheim: Wiley-VCH. Europa is also considered an ice planet due to its icy surface, though its high density indicates that its interior is mostly rocky. The same is true for the dwarf planets Sedna, Gonggong, and Eris. Although Uranus has a global cryosphere, this planet is an ice giant for its big size. The same is true for Neptune. Although Earth has a cryosphere, this planet is not an ice planet for many reasons: Earth is a warm planet, meaning that only a small part of its surface is frozen. Ices (volatiles) are little in any of the Earth's layers, rocks and metals are predominant. Oceans are only short compared to its crust, putting it within the silicate planets and not the ocean planets. Earth is thus a warm silicate planet. For a similar reason, Mars is a cold silicate planet and not an ice planet. During the event known as Snowball Earth, ice covered about all of the Earth, except for the equator. == In fiction == Ice planets have figured prominently in the science fiction stories: * In the TV series Star Wars, Hoth is featured in Star Wars: Episode 5: The Empire Strikes Back. * The double episode Zero, the eternal ice planet, from the TV series Battlestar Galactica, was inspired on an ice planet. * In the Interstellar universe, the planet Mann is featured. * In the Star Fox universe, the planet Fichina, which is the coldest ice and water planet in the lylat system, is also featured. * The film Ice Planet, released in 2001, was inspired in an unknown ice planet. * In the Ratchet and Clank universe, the planet Shaar is featured. * In the Kirby 64 universe, the planet Shiver Star is featured. == Gallery == == Related pages == *Ice giant *Hoth – Fictional planet in Star Wars *Ocean planet *Snowball Earth == References == Category:Types of planet",
 "title": "Ice planet"
}