{
 "id": "63442",
 "text": "Assyrians, also known as Syriacs, Chaldeans, are a Christian ethnoreligious group whose origins remain in what is today northern Iraq, northwestern Iran, southeastern Turkey, and more recently northeastern Syria. They claim descent from ancient Assyria, a civilization that once existed in northern Mesopotamia from 2600 BC. ==History== The Assyrians became Christian in the Roman Empire 1st to the 3rd centuries in Syria and Assyria. Along with the Arameans, Armenians, Greeks, and Nabataeans, they were among the first people to practice Christianity. During the Muslim conquest in the 6th century, Assyrians became second-class citizens, and those who fought back Arabization and conversion to Islam were affected by strong religious, ethnic, and cultural discrimination. They also did not enjoy the same political rights as Muslims. In the 7th century, Mesopotamia began to see the arrival of Arabs, Kurds and other Iranian peoples, and then Turkic peoples. Assyrians were set apart and then slowly became a minority in their own homeland, bit they remained in large numbers in Upper Mesopotamia as late as the 14th century. The city of Assur was still in use by Assyrians until the mid-14th century, when Turco-Mongol ruler Timur, a Muslim, carried a mass murder against Assyrians in the name of Islam. The Assyrian population was then greatly lessened in its homeland. The Assyrians suffered a number of religiously- and culturally-driven slaughters throughout the 17th, 18th and 19th centuries, such as from Kurdish emirs and the Ottomans. The notable event was the Assyrian genocide, which was committed by the Ottomans during the First World War.Naayem, Shall This Nation Die?, p. 281 Most recently, the 2003 invasion of Iraq by the United States and its allies, and the Syrian civil war since 2011 have forced out much of the remaining Assyrian community from its homeland because of ethnic and religious persecution at the hands of Islamic terrorists. ==Culture== ===Language=== Assyrians speak modern languages of Aramaic, but many also speak Arabic and Farsi depending on what country they came from. Those in the diaspora speak the national language of that country, which is typically English, German, Swedish, Dutch, or French. Assyrians remaining in Iraqi Kurdistan may speak or understand Kurdish. ===Religion=== Assyrians belong to many Christian denominations, such as the Syriac Orthodox Church, which has over 1 million members around the world, the Chaldean Catholic Church, with about 600,000 members,J. Martin Bailey, Betty Jane Bailey, Who Are the Christians in the Middle East? p. 163: \"more than two thirds\" out of \"nearly a million\" Christians in Iraq. the Assyrian Church of the East, with an estimated 400,000 members, and the Ancient Church of the East, with some 100,000 members. Chaldean Catholic Assyrians are the largest Christian community in Iraq, but are generally more Arabized than other Assyrian communities and even held many high positions in the Ba'ath Party of Iraq A few Assyrians have accepted Protestantism. There are some atheist Assyrians, but they still associate with some denomination. ===Music=== Assyrian music is a mixture of traditional folk music and western modern music genres: pop music, soft rock, and also electronic dance music. Instruments that are traditionally used by Assyrians include the zurna and davula, but they now also include guitars, pianos, violins, and synthesizers (keyboards and electronic drums. ===Dance=== Assyrians have many traditional dances, which mostly for special occasions like weddings. Assyrian dance is a mix of both native and general Near Eastern elements. Assyrian folk dances are mainly made up of circle dances that are danced in a line that is usually curved, where the dancers vine around the dancehall. The most common form of Assyrian folk dance is khigga, which is commonly danced as the bride and the groom are welcomed into the wedding reception. ===Food and drink=== Assyrian food is similar to that of other Middle Eastern cuisines and is rich in grains, meat, potatoes, cheese, bread, tomatoes, barley, herbs, spices, as well as herbs, fermented dairy products, and pickles. Rice is given with every meal with a stew put over it. Tea is a popular drink. ==Identity== Historically, the region of Assyria was a melting pot of many peoples that included Sumerians, Urartians, Hurrians, Babylonians, Akkadians, Amorites, Arameans, Jews, and Hittites. Assyrians are likely now a mixture of those ancient groups, which generally mixed with their neighbors.William F. Ainsworth, Travels and Researches in Asia Minor, Mesopotamia, Chaldea and Armenia (London 1842), vol. II, p. 272, cited in John Joseph, The Modern Assyrians of the Middle East (BRILL 2000), pp. 2 and 4 Today, some Assyrians call themselves Aramean, Syriac or Chaldean for religious, geographic and tribal reasons. Assyrians and other minority ethnic groups in the Middle East may feel pressure to call themselves \"Arabs,\" \"Turks,\" or \"Kurds.\" ==Homeland== The Assyrian homeland includes the old cities of Nineveh (Mosul), Nuhadra (Dohuk), Arrapha/Beth Garmai (Kirkuk), Al Qosh, Tesqopa and Arbela (Arbil) in Iraq; Urmia in Iran; and Hakkari (a large region that comprises the modern towns of Yüksekova, Hakkâri, Çukurca, Şemdinli and Uludere), Edessa/Urhoy (Urfa), Harran, Amida (Diyarbakır) and Tur Abdin (Midyat and Kafro), in Turkey.Wigram, W.A., \"The Ashiret Highlands of Hakkari (Mesopotamia),\" Royal Central Asian Society Journal, 1916, Vol. III, pg. 40. – The Assyrians and their Neighbors (London, 1929) ===Subgroups=== There are three main Assyrian subgroups: Eastern, Western, and Chaldean. * The Eastern subgroup historically lived in Hakkari in the northern Zagros Mountains, the Simele and Sapna Valleys in Dohuk, and parts of the Nineveh and Urmia Plains. Its members speak Northeastern Neo- Aramaic dialects and are religiously diverse,Minahan 2002, p. 209 some being Protestant. * The Chaldean subgroup is similar the Eastern subone and is often likened with the followers of the Chaldean Catholic Church though not all Chaldean Catholics identify as Chaldean. Its members are traditionally speakers of Northeastern Neo-Aramaic dialects, but there speak Turoyo, a Central Neo-Aramaic language. In Iraq, Chaldean Catholics live in the western Nineveh Plains villages of Alqosh, Batnaya, Tel Keppe and Tesqopa, in the Nahla valley, and in Aqra.FACTBOX: Christians in Turkey * The Western subgroup historically lived in Tur AbdinThe Middle East, abstracts and index, Part 1. Library Information and Research Service. Northumberland Press, 2002. Page 491.Central Asia and the Caucasus: transnationalism and diaspora. Touraj Atabaki, Sanjyot Mehendale. Routledge, 2005. Page 228. and speaks mainly Turoyo. Most are part of the West Syriac Rite churches such as the Syriac Orthodox Church of Antioch and the Syriac Catholic Church. Besides the original Assyrian village, Tur Abdin, there were also large populations in the towns of Diyarbakır, Urfa, Harput, and Adiyaman. ===Diaspora=== Many Assyrians have gone to the Caucasus, Canada, the United States, Australia, and Northern Europe during the past century. Thousands more live in Assyrian diaspora communities in the former Soviet Union, New Zealand, Syria, Jordan, and Lebanon. Outside of the homeland, most Assyrians live in Sweden (100,000),Demographics of Sweden, Swedish Language Council \"Sweden has also one of the largest exile communities of Assyrian and Syriac Christians (also known as Chaldeans) with a population of around 100,000.\" Germany (100,000), the United States (80,000), and Australia (70,000). ==Script== Assyrians mostly use the Syriac script, which is written from right to left. It is one of the Semitic abjads that come directly from the Aramaic alphabet and share similarities with the Phoenician, Hebrew, and Arabic alphabets. Many Assyrian people also use the Latin alphabet, especially in social media, for its ease. The oldest sort of the alphabet is the script.Hatch, William (1946). An album of dated Syriac manuscripts. Boston: The American Academy of Arts and Sciences, reprinted in 2002 by Gorgias Press. p. 24. . Even though it is no longer used as the main script for writing Syriac, it has been reused again the 10th century, and was added to the Unicode Standard in September 1999. The East Syriac dialect is usually written in the type of the alphabet, which is known as a \"modern\" simpler type. The West Syriac dialect is normally written in the form of the alphabet. Most of the letters come from ʾEsṭrangēlā but are simplified.Nestle, Eberhard (1888). Syrische Grammatik mit Litteratur, Chrestomathie und Glossar. Berlin: H. Reuther's Verlagsbuchhandlung. [translated to English as Syriac grammar with bibliography, chrestomathy and glossary, by R. S. Kennedy. London: Williams & Norgate 1889. p. 5]. == Genetics == Late-20th-century DNA investigation by Cavalli-Sforza, Paolo Menozzi, and Alberto Piazza shows that Assyrians have a distinct genetic profile, which separate, the population from any other. Genetic study of the Assyrians of Persia shows that they were \"closed,\" with little mixture with the Muslim Persians and that an single Assyrian's genetic makeup is comparatively close to that of the Assyrian population as a whole. The genetic information goes well with history that religion played a big role in keeping the Assyrian population's separate identity during the Christian era. In a 2006 study of the Y chromosome DNA of six regional Armenian populations, including Assyrians and Syrians, researchers found that the Semitic people (Assyrians and Syrians) are very different from one another. A 2008 study on the genetics of \"old ethnic groups in Mesopotamia,\" including 340 people from seven ethnic communities such as Assyrian, Jewish, Zoroastrian, Armenian, Turkmen, and the Arabs in Iran, Iraq, and Kuwait found that Assyrians were more ethnically alike compared than all other ethnic groups that were sampled in the study. A 2011 study from the Armenian National Academy of Sciences showed that Assyrians are genetically far from Arabs and are closer to other populations of the Near East and the South Caucasus.Cinnioğlu C., King R., Kivisild T., et al. Excavating Y-chromosome haplotype strata in Anatolia. Hum. Genet., 114, 127-148, 2004. It was also shown that Assyrians are closely related to the people of Syunik and Karabakh in eastern Armenia and are far from all Arab groups, which belong to a different group.Quintana-Murci L., Krausz C., Zerjal T., et al. Y-chromosome lineages trace diffusion of people and languages in Southwestern Asia. Am. J. Hum. Genet., 68, 537-542, 2001. A 2017 study focusing on the genetics of Northern Iraqi groups was found that Iraqi Assyrians and Iraqi Yazidis were closer together but far from the other Northern Iraqi populations and largely in between the West Asian and Southeastern European populations. According to the study, modern Assyrians and Yazidis from northern Iraq may have a stronger relationship to the original genetic stock of the Mesopotamian people. ==Related pages== * Assyria * Assyrian genocide * Assyrian continuity ==References== Category:Assyrian people Category:Mesopotamian people Category:Ethnic groups in the Middle East Category:Semitic peoples Category:Ethnic groups Category:Indigenous peoples",
 "title": "Assyrian people"
}