{
 "id": "63454",
 "text": "Yuri Vladimirovich Andropov (; 15 June 1914 – 9 February 1984) was a Soviet politician who briefly served as the General Secretary of the Communist Party of the Soviet Union from 1982 until his death in 1984. He previously headed the KGB and played a role in suppressing dissent. Andropov's time in power was marked by a focus on domestic issues and efforts to combat corruption, but his tenure was cut short by his death. == Biography == Yuri Andropov was born on June 15, 1914, in Nagutskoye, Russia. His early life was shaped by the aftermath of the Russian Revolution, and he grew up during a period of significant political and social change. Andropov joined the Komsomol (Communist Youth League) in 1930 and became a member of the Communist Party in 1939. His career in the Soviet security apparatus began in the 1930s, and he steadily climbed the ranks. Andropov's intelligence work included serving as the Soviet ambassador to Hungary during the Hungarian Revolution of 1956. His role in suppressing the uprising contributed to his reputation within the Communist Party leadership. Andropov continued to ascend in Soviet politics, becoming the head of the KGB in 1967. His leadership at the KGB was marked by a focus on suppressing dissent and maintaining strict control. In 1982, Yuri Andropov became the General Secretary of the Communist Party of the Soviet Union, succeeding Leonid Brezhnev. Andropov focused on strengthening the USSR's global position. Domestically, he tightened control to suppress dissent, while internationally, he pursued a cautious approach, emphasizing arms control and improving relations with the West, yet maintaining Soviet influence in global affairs. His brief tenure limited the scope of major policy changes. However, his time as the leader was short-lived, as he passed away in 1984. == Personal Life == Andropov lived at 26 Kutuzovsky Prospekt with Leonid Brezhnev and Mikhail Suslov. Andropov married twice, Nina Ivanovna (Married 1935, Divorced 1941), and Tatyana Andropova (Married 1941). They had 4 children, Evgenia Andropova, Igor Andropov, Irina Andropova, and Vladimir Andropov. === Health Problems === Andropov faced various health issues, including kidney failure and diabetes. His health declined, leading to his death in 1984. == Legacy == Andropov is often remembered for his short tenure and the crackdown on dissent. His legacy includes efforts to combat corruption and a focus on discipline in the Soviet system. His time in power was marked by political repression and a lack of significant reforms. ==References== Category:1914 births Category:1984 deaths Category:Directors of Soviet intelligence agencies Category:Former dictators Category:KGB people Category:Recipients of the Order of Lenin Category:Heads of government of the Soviet Union Category:Time People of the Year Category:General Secretaries of the Communist Party of the Soviet Union",
 "title": "Yuri Andropov"
}