{
 "id": "634659",
 "text": "Hans Fritz Scholl (22 September 1918 in Crailsheim Germany 22 February 1943 in Munich) was the leader of the White Rose Resistance group. Along with Alexander Schmorell, Christoph Probst, Willi Graf, Sophie Scholl, and Kurt Huber, Hans wrote and distributed six different leaflets criticizing Hitler and Hitler Germany. On February 18, 1943, Hans was captured by the Gestapo. After four days of interrogation, he was executed by guillotine on February 22, 1943. == Early Life == Hans Scholl was the son of the mayor Robert Scholl (1891-1973) and his wife Magdalene Scholl (1881-1958). His siblings were Inge Scholl, Elizabeth Scholl, Sophie Scholl, and Werner Scholl. The family moved Forchtenberg in 1929. When Hitler came into power, Hans and his siblings joined the Hitler Youth against the wishes of his parents, who were devout Christians and did not approve of the course Hitler was taking with the formerly illustrious country. == Seeds of Resistance and the 1937-1938 Trial == the turning point came for Hans when he was the flag bearer for a Hitler youth rally. This was a great honor, but when Hans came back from the rally, instead of being elated and happy, he came home depressed. He later explained that he had seen that freedom of expression wasn’t allowed or accepted in Hitler’s Germany. Instead, public conformity was the law. Whether or not this caused him to begin to innerly revolt against Hitler, he was even more inspired to revolt in 1937 when he was captured for being part of an illicit anti nazi christian group known as d.j.1.11. He was held in prison for six weeks. At his trial, he was accused of being part of the Christian Youth Group and also of having a homosexual relationship. he was set free for both offenses, but this persecution left a lasting impact on him. After graduation from the high school he did work service in Göppingen. In November he began to military service in Bad Cannstatt. In 1938 after ending military training Hans began studying medicine placement. In May 1940 he was a paramedic in France. == Involvement in the White Rose == In 1942, Hans, along with his good friend Alexander Schmorell, started an Anti-Nazi resistance group. Calling themselves The White Rose (and later, The Resistance Movement in Germany), the two young men wrote leaflets denouncing the state of Nazi Germany and calling for passive resistance. They then mailed the leaflets to officials and intellectuals around Munich. The first four leaflets were written from June 1942-July 1942. In July 1942, Hans and Alexander (as well as their good friend Willi Graf) received notice that they were being deployed to Russia for a three month stint as medics. They left Munich on July 23, 1942. During there three months there, the young men saw horrifying things, including the Warsaw Ghetto. What they saw inspired them to step up their leaflet game. When they returned to Munich, Hans and Alexander, as well as Willi Graf, Christoph Probst, and Sophie Scholl, began to step up their efforts. They were soon joined by Sophie’s philosophy teacher Kurt Huber. Together, these six individuals made up the core of the White Rose Resistance. In January 1943, the fifth leaflet was released. While the other pamphlets had only about a hundred distributed, about 10,000 copies were made of the fifth leaflet, which was distributed all around Germany by the members, who braved trains swarming with Gestapo to post their letters from different places in Germany. On February 3, inspired by a student protest against Hitler, Hans, Willi and Alexander went out in the middle of the night to graffiti Munich with slogans such as “Down with Hitler,” “Hitler the mass murderer”, and “Freedom!” They repeated these graffiti campaigns on February 8 and February 15. On February 9, Kurt Huber gave Hans his draft for the sixth pamphlet. Hans agreed with most of the pamphlet, but decided to remove a section against Huber’s wishes. This infuriated Huber, who left the encounter angry and upset. He never saw Hans again. == Capture by the Gestapo and Death == On the morning of February 18, Hans and Sophie snuck into the University while classes were going. Spreading leaflets in the halls, they began to leave the university when Sophie realized she still had more leaflets in her briefcase. Hurrying up to the top floor of the University, they began to distribute the remaining leaflets. They were still up there when the bell signaling the end of classes rang. Panicked, Sophie grabbed the last stack of flyers and threw them over the balcony and into the Lichtlof, or indoor atrium. This action was noticed by Jakob Schmid, who was a custodian working in the atrium as the papers fell. Schmid, who was also a Nazi Party Member, locked the exit doors and alerted the Gestapo, who came and arrested Sophie and Hans. For four days Hans was interrogated. At first he denied everything, but when he realized that denying was pointless he changed his story, taking all of the blame in order to protect the other members who hadn’t been captured yet. Unfortunately, Hans had had a leaflet draft written by Christoph on his person when he was arrested. Christoph, who had bowed off the group due to being married with three children, was captured on February 20. On February 22, Hans, Sophie and Christoph were tried by Roland Freisler, a hard judge known as the “hanging judge” for sentencing up to 90% of the accused to death. The verdict was as expected as it was sad: death by guillotine. Hans and the others were hustled off to prison, where they learned the shocking news that the execution was to take place that same day. Hans and Sophie were able to see their parents before they died. at around 5 pm, the guards came for Sophie, who was the first to be executed. A few minutes later, the guards came back for Hans. As the ax fell he yelled, “Es lebe die Freiheit!” (Let freedom live!) == Legacy == Today, the White Rose group, and particularly the Scholl siblings, are commonly know in Germany. Between them, Sophie and Hans have about 200 schools and public institutions named after them in Germany. Three movies have been made about the White Rose: Fünf LetzteTage (Five Final Days), 1982 Die Weiße Rose (The White Rose), 1982 Sophie Scholl, Die Letzten Tage (Sophie Scholl, the Final Days), 2005 == References == Category:1918 births Category:1943 deaths Category:Executed German people Category:People from Munich Category:World War II resistance members",
 "title": "Hans Scholl"
}