{
 "id": "634761",
 "text": "Shazam! is an American superhero movie that was released in 2019. It is based on the DC Comics character of the same name and is the seventh movie in the DC Extended Universe (DCEU). The movie was directed by David F. Sandberg. It stars Asher Angel as Billy Batson, a teenage boy who can transform via the magic word \"Shazam\" into an adult superhero, played by Zachary Levi. Mark Strong, Grace Fulton, Jack Dylan Grazer and his fianceè Harmony Dylan Grazer, Ian Chen, Jovan Armand, Faithe Herman, and Djimon Hounsou also appear in the movie as supporting characters. The movie was released by New Line Cinema and Warner Bros. Pictures in RealD 3D and IMAX 3D on April 5, 2019. ==Plot== In 1975, the wizard Shazam takes a young child named Thaddeus Sivana to an alternate universe to make him his champion against the Seven Deadly Sins. Sivana is tempted by sin and the Wizard tells him he will never be good enough. Shazam then sends him back to the world to the very moment that he left. Sivana panics and his father accidentally crashes his car and permanently breaks his legs. Sivana's brother blames him for what happened and hates him ever since. Sivana later becomes a doctor and pays for an experiment to reverse engineer what happened to him that way he could enter Shazam's world and fight Shazam. Dr Sivana then strikes a deal with the Seven Deadly Sins to become a supervillain in exchange for power. Dr. Sivana then kills his father and brother. In the present, Billy Batson is taken in by a new family after having repeatedly run away from foster homes to try to find his mother who was accidentally separated from him at a carnival when he was a young child. Billy meets his new foster brother Freddie who knows everything there is to know about superheroes and who walks with a crutch. Billy finds Freddie annoying. He then sees two bullies beat Freddie up with his crutch and does nothing until they make fun of Freddie for not having a mother. Billy then attacks and beats Freddie's bullies. Billy then runs away and gets onto a train. The wizard Shazam then appears to Billy and tells him that he is worthy of his power. The wizard tells him to say the name Shazam and transform into a superhero with his powers. Billy says Shazam and transforms into an adult superhero. Billy then reaches out to Freddie to find out how to be a superhero and transforms back by saying Shazam. Billy becomes arrogant because of his power and so he chooses not to transform into his superhero form and visit Freddie as his hero at the school’s next lunch like Freddie had said he would. When no superhero showed up, they gave Freddie a suitcase wedgie. Freddie then came to Billy while Billy was in his superhero form during a public appearance and tells him he only cares about himself. Dr. Sivana then comes and attacks Billy. Billy tries and fails to fight Dr.Sivana and he transforms back into a teenager by saying Shazam so that he can escape. Dr. Sivana attacks Freddie and threatens to kill him if he doesn’t tell him where Billy lives. Freddie tells him. Dr. Sivana then kidnaps Billy’s foster family to get Billy to come to their rescue. Billy strikes a deal with Dr.Sivana to give up his powers in exchange for his foster family but instead of giving Dr. Sivana his power he gives his powers to his family by having them say Shazam. Dr.Sivana has six of the Seven Deadly Sins try to fight against Billy and his family but they are defeated. Billy then manages to trick the Sin of Envy to leave Dr. Sivana and fight Billy himself. After Billy wins Dr. Sivana is left without power and is captured and imprisoned. Billy in his superhero form then visits Freddie at his cafeteria lunch and brings Superman with him. In a scene after the credits, a talking caterpillar visits Dr. Sivana in prison and tells him they can help each other. ==Cast== * Zachary Levi and Asher Angel as Billy Batson / Shazam: A 14-year-old boy and the champion of the wizard with whom he shares his name and the superhero alter-ego of Billy Batson, who possesses \"the wisdom of Solomon, the strength of Hercules, the stamina of Atlas, the power of Zeus, the courage of Achilles, and the speed of Mercury\". ** David Kohlsmith plays the four-year-old Billy. * Mark Strong as Dr. Thaddeus Sivana: A scientist who was turned down as a potential champion and subsequently estranged from his family, who becomes a host for the Seven Deadly Sins and Shazam's nemesis. Strong previously portrayed Sinestro in the 2011 film Green Lantern, making Shazam! his second appearance in a film based on DC Comics characters. ** Ethan Pugiotto plays the young Thaddeus. * Jack Dylan Grazer as Frederick \"Freddy\" Freeman: Billy's physically disabled foster brother and a fan of superheroes, who mentors Billy on the use of his newfound powers. ** Adam Brody plays the character's adult superhero form. * Djimon Hounsou as Shazam: The last surviving member of the Council of Wizards, who has spent centuries summoning people to his temple, the Rock of Eternity, in search of a \"pure of heart\" champion to whom he can pass on his extraordinary faculties. Hounsou previously voiced King Ricou of the Fisherman in the DCEU film Aquaman (2018). * Faithe Herman as Darla Dudley: Billy's good-natured younger foster sister. ** Meagan Good plays the character's adult superhero form. * Grace Fulton as Mary Bromfield: Billy's mature, academically driven older foster sister. ** Michelle Borth plays the character's adult superhero form. * Ian Chen as Eugene Choi: Billy's younger foster brother, an obsessive gamer and techie. ** Ross Butler plays the character's adult superhero form. * Jovan Armand as Pedro Peña: Billy's older foster brother, a shy, sensitive boy who has trouble opening up. ** D. J. Cotrona plays the character's adult superhero form. * Marta Milans as Rosa Vásquez: The foster mother of Billy and his siblings. * Cooper Andrews as Víctor Vásquez: The foster father of Billy and his siblings. The film also features John Glover as Thaddeus Sivana's estranged father of and CEO of Sivana Industries. Glover had starred in other DC Comics series and films: Batman: The Animated Series, The New Batman Adventures, and Superman: The Animated Series as The Riddler; Dr. Jason Woodrue in the 1997 film Batman and Robin; and Lionel Luthor in Smallville. Natalia Safran was cast as Thaddeus' mother, though her scenes were cut from the film. Caroline Palmer portrays Marilyn Batson, Billy's biological mother. Wayne Ward and Landon Doak portray Sid Sivana, Thaddeus' bullying brother as an adult and a teenager, respectively. Carson MacCormac and Evan Marsh portray Brett and Burke Breyer, bullies at the children's school. Director David F. Sandberg makes cameo appearances performing as each of the three Crocodile-Men (collaboratively assisted by Steve Newburn and Ned Morill), and provides the voice of the alien lifeform Mister Mind during a mid-credits sequence. Sandberg's wife, actress Lotta Losten, portrays Dr. Lynn Crosby; a researcher working with Dr. Sivana, who is killed by him. Sound designer Bill R. Dean has an uncredited cameo, providing the voice for a Batman toy, while Ryan Hadley, Zachary Levi's stunt double, appears uncredited as a stand-in body double for Superman. Hadley's appearance is a silent cameo, where the character is only seen from the neck down, due to Henry Cavill being unavailable to film the scene. Executive producer Dwayne Johnson's likeness is used for the mystically generated holograph of Teth-Adam, which the wizard Shazam conjures while teaching Billy the history of the Rock of Eternity, the Seven Realms of Magic, and his previous Champion. Johnson portrayed the titular role in Black Adam. The Seven Deadly Sins – a supernatural team of villains consisting of the demons Pride, Envy, Greed, Lust, Wrath, Gluttony, and Sloth – were portrayed by stunt doubles in motion capture suits on-set during filming, and depicted on-screen through CGI special effects. Their voices were collectively provided by actors Steve Blum, Darin De Paul, and Fred Tatasciore; Tatasciore previously voiced the Seven Sins in the direct-to-video Lego DC Super Hero Girls: Super-Villain High. In an Easter egg appearance, Andi Osho reprises her role as social worker Emma Glover from Sandberg's debut film Lights Out. ==References== ==Other websites== * Category:2019 movies Category:DC Extended Universe movies Category:American action comedy movies Category:American science fiction movies Category:American adventure movies Category:Warner Bros. movies Category:New Line Cinema movies Category:2010s superhero movies Category:Movies set in 2018 Category:Movies composed by Benjamin Wallfisch",
 "title": "Shazam! (movie)"
}