{
 "id": "63489",
 "text": "Eastern Time Zone (ET) is the time zone for the eastern part of the Americas including the United States, Canada and parts of South America and the Caribbean. ET is five hours behind UTC in winter, which is called Eastern Standard Time (EST). It is four hours behind UTC during summer Daylight saving time, when it is called Eastern Daylight Time (EDT). The largest city in the Eastern Time Zone is New York, the largest city in the United States. The New York metropolitan area is the largest in the zone. ==Usage== ===North America=== ====Canada==== In Canada, the following provinces and territories are part of the Eastern Time Zone: * Ontario (except areas west of Thunder Bay but including Atikokan) * Quebec (except far eastern Côte-Nord and the Magdalen Is.) * East-central Nunavut (including part of Melville Pen. and most of Ellesmere and Baffin Is., including Iqaluit; Southampton Island does not observe Daylight saving time) ====United States==== In the United States, the following states are part of the Eastern Time Zone: Parts of several other states use Eastern Time as well: * nearly all of Florida except for the west border with Alabama * most of Indiana (all except the Evansville area and the suburbs of Chicago, Illinois) * eastern half of Kentucky * all of Michigan except the four counties that border Wisconsin (Gogebic, Iron, Dickinson, Menominee). * the eastern third of Tennessee * some towns in eastern Alabama, including Phenix City, Smiths Station, Lanett, and Valley, observe Eastern Time, although they are officially in the Central Time Zone. The main reason for this is because they are close to Columbus, Georgia, which is in the Eastern Time Zone. ====Other countries==== The following countries that use Eastern Time Zone include: * Mexico - the eastern state of Quintana Roo * Panama * Jamaica * Haiti *The Dominican Republic * Cuba * the Bahamas * Not all Caribbean countries observe Daylight saving time. ===South America=== In South America this time zone is observed in: * Ecuador (except Galápagos) * Peru * Parts of Brazil: ** the state of Acre ** Amazonas - the southwestern region of the state. == Major Metropolitan areas == ==References== Category:Time zones in the United States Category:Time in Canada",
 "title": "Eastern Time Zone"
}