{
 "id": "634965",
 "text": "Jerrod Carmichael ( ; born June 22, 1987) is an American stand-up comedian, actor, and writer. Carmichael is best known for creating and playing the lead role in the semi-biographical NBC sitcom The Carmichael Show. == Life and career == Carmichael was born and raised in Winston-Salem, North Carolina. In 2005, he graduated from Robert B. Glenn High School.Additional archive on July 19, 2017. Carmichael's early comedic influences were stand-ups Richard Pryor, Bill Cosby, Sinbad, and George Carlin. Carmichael moved to Los Angeles at the age of 20. His first time doing stand-up was an open-mic night at The Comedy Store in West Hollywood. Carmichael then appeared in the \"New Faces\" showcase at the 2011 Just for Laughs Festival in Montreal. Carmichael's star role was in the 2014 film Neighbors. He has released two stand-up HBO comedy specials: Jerrod Carmichael: Love at the Store (2014) and Jerrod Carmichael: 8 (2017). In June 2019, Carmichael was hired by Quentin Tarantino to co-write a film adaptation based on the Django/Zorro crossover comic book series. In 2022, Carmichael openly came out as gay. ==Filmography== ===Movie=== Year Title Role Notes 2014 Neighbors Garf 2016 The Meddler Freddy 2016 Neighbors 2: Sorority Rising Garf 2017 The Disaster Artist Actor Friend 2017 Transformers: The Last Knight Jimmy 2017 Ferdinand Paco (voice) 2018 Mid-90s Security Guard Post- production ===Television=== Year Title Role Notes 2013 The Goodwin Games Elijah 3 episodes 2013 Comedy Bang! Bang! Pranked Guy Episode: \"Zoe Saldana Wears a Tan Blouse & Glasses\" 2013 Axe Cop Guy (voice) Episode: \"Babysitting Uni-Baby\" 2014 Jerrod Carmichael: Love at the Store Himself Stand-up special 2014–2015 Lucas Bros Moving Co. Jerrod (voice) 14 episodes 2015–2017 The Carmichael Show Jerrod Carmichael 32 episodes; also creator, writer and executive producer 2017 Jerrod Carmichael: 8 Himself Stand-up special ===Music videos=== Year Song Artist Role 2017 \"Moonlight\" Jay-Z Ross Geller ==References== ==Other websites== * * Category:Living people Category:1987 births Category:American stand-up comedians Category:American television producers Category:American television writers Category:Comedians from North Carolina Category:Writers from North Carolina Category:People from Winston- Salem, North Carolina Category:LGBT comedians Category:LGBT writers Category:LGBT actors Category:Gay men Category:Actors from North Carolina Category:American movie actors Category:American television actors Category:American voice actors",
 "title": "Jerrod Carmichael"
}