{
 "id": "635048",
 "text": "The 2019 Monster Energy NASCAR Cup Series will be the 71st season of professional stock car racing in the United States, and the 48th modern-era Cup series season. The season began at Daytona International Speedway with the Advance Auto Parts Clash, the Can-Am Duel qualifying races and the 61st running of the Daytona 500. The regular season will end with the Brickyard 400 on September 8, 2019. The playoffs will end with the Ford EcoBoost 400 at Homestead-Miami Speedway on November 17, 2019. It will be the fourth season of the current 10-year television contract with Fox Sports and NBC Sports and the third of a five-year race sanctioning agreement with all tracks. It will also be the first year the Cup Series will be fielding the Ford Mustang. == Teams and drivers == === Chartered teams === Manufacturer Team Race driver Crew chief Chevrolet Chip Ganassi Racing 1 Kurt Busch Matt McCall 42 Kyle Larson Chad Johnston Germain Racing 13 Ty Dillon Matt Borland Hendrick Motorsports 9 Chase Elliott Alan Gustafson 24 William Byron Chad Knaus 48 Jimmie Johnson Kevin Meendering 88 Alex Bowman Greg Ives JTG Daugherty Racing 37 Chris Buescher Trent Owens 47 Ryan Preece (R) Tristan Smith Premium Motorsports 15 Ross Chastain Peter Sospenzo Pat Tryson Richard Childress Racing 3 Austin Dillon Danny Stockman 8 Daniel Hemric (R) Luke Lambert Justin Alexander Richard Petty Motorsports 43 Darrell Wallace Jr. Derek Stamets Spire Motorsports Jamie McMurray Scott Eggleston Peter Sospenzo Garrett Smithley Reed Sorenson Quin Houff (R) D. J. Kennington Justin Haley TBA StarCom Racing 00 Landon Cassill Wayne Carroll Joe Williams Jr. Ford Front Row Motorsports 34 Michael McDowell Drew Blickensderfer 36 Matt Tifft (R) Mike Kelley 38 David Ragan Seth Barbour Go Fas Racing 32 Corey LaJoie Randy Cox Roush Fenway Racing 6 Ryan Newman Scott Graves 17 Ricky Stenhouse Jr. Brian Pattie Stewart-Haas Racing 4 Kevin Harvick Rodney Childers 10 Aric Almirola Johnny Klausmeier 14 Clint Bowyer Mike Bugarewicz 41 Daniel Suárez Billy Scott Team Penske 2 Brad Keselowski Paul Wolfe 12 Ryan Blaney Jeremy Bullins 22 Joey Logano Todd Gordon Wood Brothers Racing 21 Paul Menard Greg Erwin Toyota Joe Gibbs Racing 11 Denny Hamlin Chris Gabehart 18 Kyle Busch Adam Stevens 19 Martin Truex Jr. Cole Pearn 20 Erik Jones Chris Gayle Leavine Family Racing 95 Matt DiBenedetto Mike Wheeler Chevrolet Ford Petty Ware Racing 51 B. J. McLeod George Church Mike Hillman Jr. Cody Ware (R) 51 George Church Mike Hillman Jr. Gray Gaulding 51 George Church Mike Hillman Jr. Jeb Burton 51 George Church Mike Hillman Jr. TBA 51 George Church Mike Hillman Jr. Chevrolet Ford Rick Ware Racing 52 Cody Ware (R) Mike Hillman Jr. George Church B. J. McLeod 52 Mike Hillman Jr. George Church Bayley Currey 52 Mike Hillman Jr. George Church Jeb Burton 52 Mike Hillman Jr. George Church Stanton Barrett 52 Mike Hillman Jr. George Church TBA 52 Mike Hillman Jr. George Church === Limited schedule === === Changes === == Offseason changes == === Rule changes === == Schedule == Key changes from 2018 include: The schedule, comprising 36 races, including the Advance Auto Parts Clash, Can-Am Duel (qualifying races for the Daytona 500) and the All-Star Race, was released on April 3, 2018. No Race Title Track Date Time ET TV Advance Auto Parts Clash Daytona International Speedway, Daytona Beach, Florida February 10 3:00 PM FS1 Gander RV Duel February 14 7:00 PM FS1 1 Daytona 500 February 17 2:30 PM Fox 2 Folds of Honor QuikTrip 500 Atlanta Motor Speedway, Hampton, Georgia February 24 2:00 PM Fox 3 Pennzoil 400 presented by Jiffy Lube Las Vegas Motor Speedway, Las Vegas, Nevada March 3 3:30 PM Fox 4 TicketGuardian 500 ISM Raceway, Avondale, Arizona March 10 3:30 PM Fox 5 Auto Club 400 Auto Club Speedway, Fontana, California March 17 3:30 PM Fox 6 STP 500 Martinsville Speedway, Ridgeway, Virginia March 24 2:00 PM FS1 7 O'Reilly Auto Parts 500 Texas Motor Speedway, Fort Worth, Texas March 31 3:00 PM Fox 8 Food City 500 Bristol Motor Speedway, Bristol, Tennessee April 7 2:00 PM FS1 9 Toyota Owners 400 Richmond Raceway, Richmond, Virginia April 13 7:30 PM Fox 10 GEICO 500 Talladega Superspeedway, Lincoln, Alabama April 28 2:00 PM Fox 11 Gander RV 400 Dover International Speedway, Dover, Delaware May 5 2:00 PM FS1 12 Digital Ally 400 Kansas Speedway, Kansas City, Kansas May 11 7:30 PM FS1 Monster Energy Open Charlotte Motor Speedway, Concord, North Carolina May 18 6:00 PM FS1 Monster Energy NASCAR All-Star Race May 18 8:00 PM FS1 13 Coca-Cola 600 May 26 6:00 PM Fox 14 Pocono 400 Pocono Raceway, Long Pond, Pennsylvania June 2 2:00 PM FS1 15 FireKeepers Casino 400 Michigan International Speedway, Brooklyn, Michigan June 9 2:00 PM FS1 16 Toyota/Save Mart 350 Sonoma Raceway, Sonoma, California June 23 3:00 PM FS1 17 Camping World 400 Chicagoland Speedway, Joliet, Illinois June 30 3:00 PM NBCSN 18 Coke Zero Sugar 400 Daytona International Speedway, Daytona Beach, Florida July 6 7:30 PM NBC 19 Quaker State 400 presented by Walmart Kentucky Speedway, Sparta, Kentucky July 13 7:30 PM NBCSN 20 Foxwoods Resort Casino 301 New Hampshire Motor Speedway, Loudon, New Hampshire July 21 3:00 PM NBCSN 21 Gander Outdoors 400 Pocono Raceway, Long Pond, Pennsylvania July 28 3:00 PM NBCSN 22 Go Bowling at The Glen Watkins Glen International, Watkins Glen, New York August 4 3:00 PM NBCSN 23 Consumers Energy 400 Michigan International Speedway, Brooklyn, Michigan August 11 3:00 PM NBCSN 24 Bass Pro Shops NRA Night Race Bristol Motor Speedway, Bristol, Tennessee August 17 7:30 PM NBCSN 25 Bojangles' Southern 500 Darlington Raceway, Darlington, South Carolina September 1 6:00 PM NBCSN 26 Big Machine Vodka 400 at the Brickyard Indianapolis Motor Speedway, Speedway, Indiana September 8 2:00 PM NBC Cup Championship Playoffs Round of 16 27 South Point 400 Las Vegas Motor Speedway, Las Vegas, Nevada September 15 7:00 PM NBCSN 28 Federated Auto Parts 400 Richmond Raceway, Richmond, Virginia September 21 7:30 PM NBCSN 29 Bank of America Roval 400 Charlotte Motor Speedway, Concord, North Carolina, (Roval) September 29 2:30 PM NBC Round of 12 30 Gander Outdoors 400 Dover International Speedway, Dover, Delaware October 6 2:30 PM NBCSN 31 1000Bulbs.com 500 Talladega Superspeedway, Lincoln, Alabama October 13 2:00 PM NBC 32 Hollywood Casino 400 Kansas Speedway, Kansas City, Kansas October 20 2:30 PM NBC Round of 8 33 First Data 500 Martinsville Speedway, Ridgeway, Virginia October 27 3:00 PM NBCSN 34 AAA Texas 500 Texas Motor Speedway, Fort Worth, Texas November 3 3:00 PM NBCSN 35 Can-Am 500 ISM Raceway, Avondale, Arizona November 10 2:30 PM NBC Championship 4 36 Ford EcoBoost 400 Homestead–Miami Speedway, Homestead, Florida November 17 3:00 PM NBC ==Related pages== * 2019 NASCAR Xfinity Series * 2019 NASCAR Gander Outdoors Truck Series == References == Category:Monster Energy NASCAR Cup Series races",
 "title": "2019 Monster Energy NASCAR Cup Series"
}