{
 "id": "63520",
 "text": "Mainland Australia has three official time zones. The full names of the time zones are usually shortened by dropping the Australian. Most Australian external territories are in different time zones. Many parts of Australia have daylight saving time. __TOC__ Official Australian time zones Official Australian time zones Official Australian time zones Official Australian time zones Full name of time zone Australian Western Standard Time (WST) Australian Central Standard Time (ACST) Australian Eastern Standard Time (AEST) Short name of time zone Western Standard Time (WST) Central Standard Time (CST) Eastern Standard Time (EST) Hours and minutes ahead of GMT + 8:00 + 9:30 +10:00 State or territory Western Australia Northern Territory South Australia Queensland New South Wales Australian Capital Territory Victoria Tasmania ==History== The three official standard time zones were set up in February 1895. Originally South Australia was nine hours ahead of Greenwich Mean Time (GMT) but in May 1899 they added another thirty minutes to that. Some people have disliked having this non-whole number of hours difference. In 1986 and 1994 they tried to take the thirty minutes away again or add another thirty minutes but they failed. When the Australian Capital Territory separated from New South Wales they kept using Eastern Standard Time. When the Northern Territory separated from South Australia they kept using Central Standard Time. ==Changes== There have been some other changes. *Broken Hill in far-western New South Wales uses Central Standard Time. *Lord Howe Island sets its clocks 10:30 ahead of GMT. *Some towns on the Eyre Highway in the south- east corner of Western Australia, between the South Australian border almost as far as Caiguna, use Central Western Standard Time. This is an unofficial time zone 45 minutes ahead of the official Western Australian time. *The Indian Pacific train has its own time zone when travelling between Kalgoorlie and Port Augusta. They call it \"train time\". ==Outside territories== Australia's many outside territories follow their own time zones. None follow daylight saving time. Territory Standard Heard and McDonald Islands UTC+5 Cocos (Keeling) Islands UTC+6:30 Christmas Island CXT UTC+7 Norfolk Island NFT UTC+11:30 Australian Antarctic Territory - Mawson UTC+6 Australian Antarctic Territory - Davis UTC+7 Australian Antarctic Territory - Casey UTC+8 ==Daylight saving time== South Australia, New South Wales, the Australian Capital Territory, Victoria and Tasmania use daylight saving time every year. In these regions daylight saving time begins on the first Sunday in October at 2:00 am local standard time, and ends on the first Sunday in April at 3:00 am local daylight saving time. The starting and finishing times are sometimes changed when there are special events, such as the Olympic and Commonwealth Games, in Australia. The Northern Territory, Queensland and Western Australia do not have daylight saving time. People living in the northern parts of Australia tend not to be in favour of daylight saving. ==References == * The Australian National Time System National Standards Commission Leaflet No. 8, January 2003. Linked via Wayback machine * NSW Legislative Council Hansard, 2 March 2005 * Daylight Saving Petitions * Daylight Saving Time History of daylight saving time implementation dates at the Bureau of Meteorology website. ==Other websites== *Time Zones in Australia Category:Time zones Australia",
 "title": "Time in Australia"
}