{
 "id": "635203",
 "text": "The Alpine orogeny (sometimes Alpide orogeny) is the building of mountain ranges in central and southern Europe and west Asia. This mountain-building phase started in the later Mesozoic era.Moores E.M. & Fairbridge7 R.W. (Editors), 1998: Encyclopedia of European and Asian Regional Geology. Encyclopedia of Earth Sciences Series, London. It happened as the two large continents Africa and India (plus a smaller plates) moved north and collided with Eurasia. This happened at the end of the Mesozoic era, and is slowly continuing today. So this slow collision sqeezed the Eurasian plates, and caused mountains to build from the western edge far into Asia. These are the mountain ranges of the Alpide belt. They include (from west to east) the Atlas, the Rif, the Baetic Cordillera, the Cantabrian Mountains, the Pyrenees, the Alps,Pfiffner O.A. 2009. Geologie der Alpen (in German). Bern/Stuttgart/Wien: Haupt Verlag. Stampfli GM; Borel GD; Marchant R.; Mosar J. 2002. Rosenbaum G. and Lister G.S. eds. Reconstruction of the evolution of the Alpine-Himalayan orogeny. Journal of the Virtual Explorer. the Apennine Mountains, the Dinaric Alps, the Hellenides, the Carpathian Mountains, the Balkan Mountains, the Taurus, the Armenian Highlands, the Caucasus, the Alborz, the Zagros, the Hindu Kush, the Pamir, the Karakoram, and the Himalayas. The Alpine orogeny also led to more distant and smaller geological features such as the chalk hills in southern England and northern France (the 'Weald–Artois Anticline'). The remains of this can be seen in the chalk ridges of the North and South Downs in southern England. Its effects are visible on the Isle of Wight, where the chalk and overlying Eocene strata are folded to near-vertical, as seen at Alum Bay and Whitecliff Bay, and on the Dorset coast near Lulworth Cove. The Alpine orogeny was the last of the three major phases of orogeny in Europe that made its geology. The Caledonian orogeny which formed the Old Red Sandstone continent was the first. The second was the Variscan orogeny. That was when Pangaea formed as Gondwana and the Old Red Sandstone continent collided in the middle to late Palaeozoic. ==References== Category:Geography of Europe Category:Orogenies",
 "title": "Alpine orogeny"
}