{
 "id": "63521",
 "text": "Human sacrifice is the act of killing a human as an offering to a deity or other, normally supernatural power. It was practiced in many ancient cultures. The practice was different in different cultures. Some like the Mayans and Aztecs were notorious for their ritual killings, while other cultures have condemned the practice as barbaric. Victims were ritually killed in a manner that was supposed to please or appease deities or spirits. Victims ranged from slaves or prisoners to aristocrats, and from infants to the elderly. In Ancient Rome, Vestal Virgins who broke their vow of chastity were ritually killed with their stomaches cut open, with a sharp stone or knife and their hearts were burned. But most often, they were buried alive. Over time human sacrifice has become less common around the world, and sacrifices are now very rare. Most religions condemn the practice and present-day laws generally treat it as murder. Nonetheless, it is still occasionally seen today, especially in the least developed areas of the world where traditional beliefs persist. ==Methods== Human sacrifice has been done through numerous methods including the following: * Burning * Decapitation * Drowning * Live burial * Immurement * Dismemberment ==Phoenicia== The ancient Middle Eastern kingdom of Phoenicia practiced the sacrifice of their children to their god Moloch. It was said to be evil by the Jewish authors of the Bible. ==Aztec Empire == The Aztecs were particularly noted for practicing human sacrifice on a large scale; an offering to Huitzilopochtli would be made to restore the blood he lost, as the sun was engaged in a daily battle with darkness and won it by destroying it. Human sacrifices would prevent the end of the world that could happen on an cycle of each 52 years. In the 1487, the re-consecration of the Great Temple of Tenochtitlan happened and many prisoners were sacrificed. ===Tlaloc=== Tlaloc would require weeping boys in the first months of the Aztec calendar to be ritually sacrificed. ==Inca Empire== A number of mummies of sacrificed children have been recovered in the Inca regions of South America. ==Related pages== * Cannibalism * Crucifixion of Jesus * Sacrifice ==Articles== * “Indian cult kills children for goddess: Holy men blamed for inciting dozens of deaths”, The Observer (United Kingdom newspaper) Dan McDougall in Khurja, India, Sunday March 5, 2006 * Heinsohn, Gunnar: “The Rise of Blood Sacrifice and Priest Kingship in Mesopotamia: A Cosmic Decree?”http://www.kronia.com/library/journals/sacrfice.txt (also published in Religion, Vol. 22, 1992) ==Books== * Dying for the Gods, Miranda Aldhouse Green; Trafalgar Square; 2001, * Cenote of Sacrifices, Clemency Coggins and Orrin C. Shane III ; 1984 The university of Texas Press; * Violence and the Sacred, Rene Girard, translated by P. Gregory; Johns Hopkins University Press, 1979, * I See Satan Fall Like Lightning, René Girard, Translated by James G. Williams; Orbis Books; 2001, * The Pagan Religions of the Ancient British Isles: Their Nature and Legacy Ronald Hutton, 1991, * Human Sacrifice in Ancient Greece Dennis D. Hughes 1991 Routledge * City of Sacrifice: The Aztec Empire and the Role of Violence in Civilization, David Carrasco, Moughton Mifflin, 2000, ==References== ==Other websites== * TIME Asia Magazine: Killing for “Mother” Kali * Indian temple revives “human sacrifice” * Witch Burning and Human Sacrifice in India, PDF * “Priest makes human sacrifice” * Human sacrifice of children Category:Superstitions Category:Religion Category:Murders",
 "title": "Human sacrifice"
}