{
 "id": "635337",
 "text": "Alexandria Governorate ( Muḥāfẓet El Eskenderiya) is one of the governorates of Egypt. The city of Alexandria was historically the capital of Egypt. Later Fustat was built, and this became Cairo. Today the governorate is considered second in importance to the Cairo Governorate. It is on the northern coast of Egypt, on the Mediterranean Sea. It is one of the most important harbours in Egypt. == Tourism == Alexandria has a diverse history. It was occupied by several cultures through the years. Alexandria has many historic sites and several monuments . === Monuments === * Bibliotheca Alexandrina * Citadel of Qaitbay * Graeco-Roman Museum * Alexandria National Museum * Royal Jewelry Museum * Serapeum Temple * Pompey's Pillar * Roman Amphitheatre * Lighthouse of Alexandria === Gardens === * Al Montaza Gardens * Al Shallalat Gardens * Antoniadis Garden * El-Nozha Garden * International Park of Alexandria == Education == Alexandria Governorate follows the Egyptian Educational System in its public schools and universities. === Most important educational institutes === * Bibliotheca Alexandrina ( Alexandria Library) * Alexandria University * Arab Academy for Science, Technology, and Maritime Transport * Egypt-Japan University of Science and Technology in New Borg El Arab city. * The city of scientific research and Technological Applications * Pharos University == Sports == Alexandria governorate most common sport is football and has three main stadiums which are: * Borg El Arab Stadium * Alexandria Stadium * Haras El-Hedoud Stadium == Transportation == === Ports === * Alexandria Port * Al Dekheila Port. ( The second largest port in Alexandria Governorate after Alexandria Port). * Abu Qir Port * Eastern Port. (One of the oldest ports as it was built in 2000 B.C in Racoda village). === Railroads === * Alexandria Tram * Alexandria Railways === Airports === Alexandria Governorate has two international airports: * Borg El Arab Airport == Telephone services == === Governorate telephone code === * National: 03 * International: +203 == References == # Abu-Zeid, Khaled, Alaa Yasseen, Peter Van Der Steen, Phillip Sharp, and Mohamed ElRawady. \"Integrated Urban Water Management.\" Alexandria 2030 (2011): 59. Managing Water for the City of the Future. Switch. Web. 4 Dec. 2015. # \"About AU: History.\" Alexandria University. Alexandria University, 2015. Web. 3 Dec. 2015. . # \"Alexandria.\" Alexandria Portal. Ministry of State For Administrative Development. Web. 3 Dec. 2015. . # \"Egypt Embassies & Consulates.\" Egypt. Embassy Pages, 28 Nov. 2015. Web. 3 Dec. 2015. . # Khalifa, Alaa. \"The City of Alexandria in Egypt - Information & Location of Alexandria.\" The City of Alexandria in Egypt - Information & Location of Alexandria # Official portal for Alexandria governorate == Other websites == * Alexandria Governorate (Arabic) * Alexandria websites Alex4All website * Discover Alexandria * List of Governors of Alexandria with photos (1798-2000) (Arabic) * St. Takla Haymnaot the Ethiopian Coptic Orthodox Church - One of the famous Coptic Orthodox Churches of Alexandria",
 "title": "Alexandria Governorate"
}