{
 "id": "635733",
 "text": "Kim Hee-chul (born July 10, 1983) Naver - Person Profile \"Kim Heechul\" Daum Movie - Person Profile \"Kim Heechul\" , better known by the mononym Heechul, is a South Korean singer, songwriter,Korea Music Copyright Association Writers:김희철 (W1054900) presenter, and actor. He is a member of South Korean boy group Super Junior and has further participated in its subgroup, Super Junior-T as well as project groups M&D; with Kim Jung-mo and Universe Cowards with Min Kyung-hoon. , he has four programs being broadcast: Knowing Bros, Life Bar, 1% Friendship and My Daughter's Men. ==Life and career== ===1983-2005: Early life and career beginnings === Kim Hee-chul was born in Hoengseong County, Gangwon Province, on July 10, 1983. He has one older Sister, Kim Hee-jin. Kim graduated from Sangji University with a bachelor's degree in informatics through Bachelor's Degree Examination for Self- Education. In October 2002, he moved to Seoul in order to take part in the auditions held by S.M. Entertainment. he was cast in the Starlight Casting System and signed a contract with S.M. Entertainment and became an official trainee, being trained in areas of singing, acting, dancing, and other performing talents such as hosting and modeling. He was initially placed in a four-member group called \"Four Seasons\" along with Jaejoong, Yunho and Kangin. The project group was dropped when Yunho and Jaejoong joined TVXQ in early 2003. He was preparing to debut as the main vocalist of Trax, but during his trainee days he had frequent clashes and misunderstandings with the person in charge at S.M. at that time. Therefore, he became frustrated and abandoned his Trax debut and returned to his hometown in Gangwon Province. Later with Trax's Jungmo and Jay, TVXQ's Yunho and Donghae encouragement and positivity, he returned to S.M. He joined other trainees under S.M. Entertainment to form the group \"Super Junior 05\", the first generation of Super Junior. His first acting role was in teen drama Sharp 2 (Season 2), co-starring labelmates Go Ara and Kibum on 2005 before the debut of Super Junior. Shortly afterwards, he appeared in an episode of the series Loveholic and was a regular MC for the cable music show Show! Music Bank Tank. He also appeared in advertisements. ===2005–2010: Debut with Super Junior, Super Junior-T and solo activities=== On November 2, 2005, \"Super Junior 05\" made their official debut as a twelve- member group on SBS's Popular Songs, performing their first single \"TWINS\".\"2005 Super Junior's official debut\" Ent.hunantv.com. Retrieved 2011-12-25 \"SM Unveils 12-Membered Boy Group Named Super Junior\" Arirang.co.kr. 27 October 2005. Retrieved 2011-12-25 Their debut album SuperJunior05 (Twins) was released on December 5 and debuted at number three on the monthly MIAK K-pop album charts. In March 2006, S.M. Entertainment began to recruit new members for the next Super Junior generation. However, plans changed and the company declared a halt in forming future Super Junior generations. Following the addition of thirteenth member Kyuhyun, the group dropped the suffix \"05\" and became officially credited as Super Junior.\"Super Junior adds new member, transformed into 13-person super group\" Sina.com. 24 May 2006. Retrieved 2011-05-08 The re-polished group's first CD single \"U\" was released on June 7, 2006, which was their most successful single until the release of \"Sorry, Sorry\" in March 2009.\"SuperJunior releases third studio album\" Epaper.jinghua.cn. 14 March 2009. Retrieved 2011-12-25 Apart from Super Junior's activities, Heechul has acted in several television dramas. In 2005 he landed his first leading role in Rainbow Romance (2005–06) then played a supporting role in Bad Family (2006), Golden Bride (2007–08) and Loving You a Thousand Times (2009–10). He also appeared as a radio DJ on SBS Power FM Youngstreet with Park Hee-von until mid-2006. On February 23, 2007, he debuted as part of Super Junior sub-group, Super Junior-T, performing trot single \"Rokuko!!!\".Lee Yong-sung \"Young trot music stars bridge generation gap\" The Korea Herald. 16 March 2007. Retrieved 2012-04-03 and made his film debut in Attack on the Pin-Up Boys.Cathy Rose A. Garcia \"Super Junior Hits Big Screen\" Korea Times. 8 July 2007. Retrieved 2012-04-03 He co-hosted SBS's weekly live music show as a substitute for Andy of Shinhwa, going on to become a permanent host with Ku Hye-sun (April 23, 2006 – February 18, 2007), Jang Keun-suk (February25 - October 7, 2007) and Song Ji-hyo (November 11, 2007 – May 4, 2008). In May 2008, the S.M. Art Company was formed with Pyo In-bong as co- CEO, aiming to produce musical and theatre works. Its first production was of Xanadu, playing the role of Sonny in rotation with bandmate Kangin. The production ran between September 9 - November 23, 2008 at the Doosan Art Center, Yeonji-dong, Seoul.Koh Young-aah \"Super Junior members set to make move into musicals\" The Korea Herald. 30 May 2008. Retrieved 2012-04-03 Casting was carried out via a reality television programme, To Be Kangin and Heechul. He also became a regular on the TV Programmes 8 vs 1 (2008), Good Daddy (2008–09) and Band of Brothers (2009). In November 6, 2009, he released his first solo single, \"First Star\", as part of the OST for the drama Loving You a Thousand Times. The song is written by Song Jong-ho and composed by Choi Myung-hoon.\"Super Junior member Heechul to release single on OST\" Asiae. 23 October 2009. Retrieved 2012-04-17 In 2010, he returned as a radio DJ for the first time in four years on SBS's Heechul's Young Street from March 29, 2010 until mid-2011. In May 2010, he was added along with Jang Dong-min during a recording as the eighth member of the family on the series Family Outing 2, but the show was cancelled two months later due to low ratings. The same year, his popularity skyrocketed when he became a regular cast member in Radio Star, the main segment of MBC's Golden Fishery when Shin Jung-hwan was caught gambling. and won \"Best Newcomer Award\" awards at the 11th MBC Entertainment Awards. ===2011–2015: M&D;, military enlistment and League of Legends=== In 2011, he formed a project group with label mate Jungmo of TRAX called M&D; (meaning \"Midnight and Dawn\" or \"Miari and Dangae-dong\", after the members' hometowns). They released their debut single, \"Close Ur Mouth\". Heechul wrote the lyrics and directed the music video for the song, while Jungmo produced and performed the instrumental. Their first live performance was at Mnet’s summer awards ceremony 20’s Choice on July 7. Kim Hee-chul carried out mandatory military service from September 1, 2011 to August 30, 2013. He served as a public service worker for 23 months after undergoing four weeks of basic training at the Nonsan military camp in Chungcheongnam-do. At the time that he enlisted, he had been appearing on KBS's Secret (시크릿) as well as the Radio Star, for which bandmate Kyuhyun took over the role.\"Super Junior Kyuhyun replaces Kim Heechul on 'Radio Star'\" Asiae. 22 September 2011. Retrieved 2012-03-22 Shortly after he had completed his military service, he featured on Kim Jang-hoon's single \"Breakups are So Like Me\". During live performances of the song on Music Bank and Show! Music Core, his part was performed by bandmates Yesung, Eunhyuk and Shindong.Choe, MinJi \"Super Junior Fills in For Heechul for Kim Jang Hoon Duet\"CJ E&M; enewsWorld. 28 September 2011. Retrieved 2012-03-30 Also he wrote the lyrics of Orange Caramel's \"Shanghai Romance\" on October 13, 2011, which peaked at number eight on the Gaon Digital Chart. On January 26, 2012, he hosted the radio program every Friday at the office of District Seong Dong, where he was serving his two-year mandatory military service. His first episode was broadcast on January 20 and had received 5,600 hits.\"Super Junior’s Heechul hosts his own radio program for the government\" ningin.com 2012/01/26 In September 2013, he became a regular cast member on the JTBC's variety program Ssulzun (War of Words) it was his first project after releasing from his mandatory military enlistment but on July 2014 he posted a photo in his personal Instagram account and poured his heart and thoughts regarding his last appearance in the program. In Heechul’s last recording for the show, he mentioned about having the pressure of talking about the people close to him.\"Super Junior Heechul Returning to Entertainment… Reunion with Kim Gura\" kpopstarz.com 2013.09.24 In January 2014, he appeared on the Global Edition of MBC reality television programme We Got Married, as an on-screen couple with Taiwanese girl group member Puff Guo. That year, he also played the role of a detective in the tvN drama Flower Grandpa Investigation Unit. He returned to the Super Junior's line-up for the August performance at Music Bank, marking the first time he, Leeteuk and Kangin have been together in the line-up since they each completed their military service. In February 2015, the famous LoL team SK Telecom T1 sponsored a special match titled the Celebrity League of Legends Invitational Event Match. SKT T-LoL invited various celebrities to join in a match against professional LoL gamers. The celebrity team including Heechul ultimately lost. He also appeared on OnGameNet’s Pandora TV LoL Champions on November 27, 2013 as a Special Commentator and Guest player.\"Super Junior’s Heechul to Appear on LoL Champions\" worldwideelfs.com 2013/11/20 In 2015, he became MC on entertainment programs such as Tvn's The Demand of Luxurious Food, KBS's Fashion-beauty Show A Style For You, O'live's Travel Show MAPS, JTBC's variety show Knowing Bros. and Korean-Chinese program All the Way With You, The first Chinese variety that he was in charge since his debut in Korean entertainment in 2005.\"김희철 \"中예능 첫단독MC..출연자들, 중국가자고\"(직격인터뷰)\" naver.com 2014.11.30 The same year, M&D; released their first EP, Cottage Industry with the title track \"I Wish\" digitally on April 16 and physically on April 20. The title track was also written and composed by the duo.,super juniors heechul,wheein,kim jungmo drop narcissus soompi.com 2016/04/14 which peaked at number two on the Gaon album Chart.2015년 18주차 Album Chart Gaonchart On April 30, 2015 ===2016-present: Knowing Bros, Universe Cowards and mainstream success=== With Super Junior on a temporary hiatus for much of 2016 due to the enlistment of four other members, he returned to hosting. In March 2016, Heechul was confirmed to become a temporary host for Weekly Idol until October 5, when Jeong Hyeong-don ended his 11-month break from television activities.\"heechul hani weekly idol mc\" kpopstarz.com 2016.03.17 On April 15, 2016 he released a duet with Wheein for SM Station. The single \"Narcissus\" was written by him and produced by Jungmo, and it was his first collaboration with a female artist. In early July 2016, M&D; returned as \"Kim Heechul & Kim Jungmo\", with a second EP, Goody Bag, and trot-rock title track \"Ulsanbawi\" on July 12. In August 2016, he attended the \"League of Legends Pro League 5th Anniversary\" in China, which included the Regional Final with four Chinese teams competing for a spot in the World Championship. He also competed in a Korea vs. China celebrity showmatch in commemoration.LPL 5th Anniversary - Celebrity Showmatch - Strongest Team on Earth (China) vs. Geniuses of the Universe (Korea) - Chinese Cast YouTube (originally broadcast by Tencent) On October 9, he appeared on OnGameNet as a special commentator for the LoL World Championship.SAMSUNG vs TSM - 2016 롤드컵 그룹스테이지 7일차-김희철 해설 [2016 LoL Worlds YouTube 2016.10.09 In November 2016, Heechul began participating in S.M. Entertainment's League of Legends tournament 2016 S.M. Super Celeb League, where he and labelmate Baekhyun played the game with both professional players and fans from South Korea and China. In fall 2016, Heechul and Buzz member Min Kyung-hoon released a duet titled \"Sweet Dream\". The two stars are known as \"Universe Cowards\" when they promote music, which is a name they came up with for a Knowing Bros project group. The song proved successful, topping the South Korean Gaon Digital Chart an achievement known as \"all-kill\", making him the first Super Junior member to achieve \"all-kill\" in 2016.스테이션 시리즈 최초 #1 등극! melon In 2017, \"Sweet Dream\" won a Best Rock Song at the MelOn Music Awards. His career as a MC made a breakthrough after appearing on Knowing Bros and Weekly Idol.[SW Pick] Kim Hee-cheol, Unique Performing Arts Hard Carry sportsworldi2016 예능④ 김희철부터 양세형·성소·박진주까지’…2016 예능이 빛낸 ★7] tenasia.hankyung The success of Knowing Bros in Korea brought him a new range of fans and is a large part of why the show is so popular. He was named as one of the Top 3 Idol MC's of 2016.[창간특집] 2016 아이돌 MC 3대천왕, 뽑고보니 '슈주에요' entertain.naver 2016.11.27 After appearing on the show, he earned more recognition and received roles from other shows as MC — such as Phantom Singer (Season 1), Secretly Greatly, Lipstick Prince (Season 1, 2).\"전현무X김희철, JTBC '팬텀싱어' MC 확정..11월 방송 [공식입장]\" koreadaily.com October, 2016'립스틱 프린스' 김희철 \"첫 단독 MC, 굉장히 성공적\" enter.etoday.co.kr 2016-11-28김희철 '립스틱 프린스' 시즌2도 책임진다..MC 확정(공식입장) stoo.asiae.co.kr/news 2017.02.23 Following the success of \"Sweet Dream\", in February 2018, Universe Cowards returned with \"Falling Blossoms\". It was composed by Lee Sang-joon and Cha Jil-won and features lyrics written by Min, which peaked at number 15 on Gaon Digital Chart. Billboard described it as \"soft pop-rock tune that grows to a soaring, emotional cacophony\" and complimented how their music video was one of the most inclusive music videos South Korea’s seen in some time.Super Junior's Kim Heechul and Min Kyunghoon Give Visibility to Developmentally Disabled People in 'Falling Blossoms' Video billboard 2/18/2018 He continued his successful work by participating in new programs Idol School, Life Bar (Season 2), My Daughter's Men and 1% Friendship.배철수·안정환·김희철, '1%의 우정' MC Daum In March 2018, it was reported that Heechul would not be participating in music show performances of Super Junior latest comeback promotions due to health concerns, but would still participate in other promotions as normal. ==In the media== On October 9, 2010, he created a personal Facebook account which received 5,000 friend requests within five minutes. He became a worldwide trending topic on Twitter for four days after the account's creation. Twitter published the list of top overall trends in 2010 and from this computation, he took the ninth place in the People Category.Super Junior Kim Hee Chul On Twitter's Top Trends Worldwide For 2010 dkpopnews 2010/12 In July, 2011, Lady Gaga appeared on 9th’s episode on KBS2’s Entertainment Weekly for an exclusive interview and mentioned that she was amazed by Heechul's imitation of her. He's appeared “Lady HeeHee” throughout Super Show 3, as well as SM Town in Paris.\"Lady Hee Hee short performances in SM TOWN Paris backstage!\" dkpopnews.fooyoh.com 2011/06 Lady Gaga has seen his imitation and praised him, saying: “He looks amazing!”\"Lady Gaga Says Lady HeeHee Looks Amazing!\" Trenggalekepdia.com 2021/07/19 ===Endorsements=== He is an endorser of a wide range of brands in and outside South Korea.희철 CF smtown.com He has become one of the most in demand endorsers after his hit show Knowing Bros and his famous Picks Miwon CF.잘 잡은 예능 캐릭터로 CF왕 될 기세 By. 뉴스에이드 임영진 brands like App DdocDoc and Smilegate gained popularity after his video viewed more than million times on YouTube.푸드 요리 즐기는 혼밥족 늘며 젊은층 양념 소비 `쑥쑥` http://news.mk.co.krApp \"DdocDoc\" 똑똑한닥터 Youtube channel스마일게이트, ‘탄: 끝없는 전장’ 사전 예약 실시 thisisgameMobile FPS new film 'Tan: Endless battlefield (Sub-Tan)', Cinematic video release http://game119.net In 2017, he was selected as a model for G-Market with AOA's Seolhyun.단순 그리고 반복…너는 지금 이 광고에 중독되고 있다 출처: 더피알 the-pr.co.kr in 2018, he was chosen to be the model for Mistral with Min Kyung-hoon.‘아는형님’ 김희철-민경훈, 광고 모델로 발탁…‘유쾌하고 트렌디한 스타일’ 기대만발 topstarnews ==Personal life== === Car accident === On August 10, 2006, Heechul was involved in a car accident while heading back to Seoul from Mokpo after attending the funeral of fellow Super Junior member Donghae’s father. The tires malfunctioned while his car attempted to switch lanes. Heechul fractured his left leg in five places, including his femur, knee, and ankle, requiring him to be in surgery for ten hours. He also sustained other injuries, including a tear in his tongue which required stitches.Heechul's Car accident kpopstarz.com 2013.08.30 Heechul was advised to stop all activities for a period of twelve weeks. He was released from the hospital on September 13, 2006 but he continued to receive out-patient care. He returned to the hospital to have a second surgery to remove some of the iron rods in his leg on October 10 and briefly returned to work in late October to film the final three episodes of an MBC youth sitcom while still in a cast and on a wheelchair. He made his comeback on November 25 of the same year during the Mnet KM Music Festival. In late December Heechul officially returned to individual activities such as variety show appearances and hosting appearances.Kim Heechul's Car Accident afspot.net In 2007, Heechul started to perform regularly despite still having a few rods that the doctors had attached to his leg. In late April and May 2007, he had recovered enough to be able to take part in Super Junior’s strenuous dance routines. The remaining rods in his leg were removed in 2008.‘택시’ 김희철 “교통사고로 슬럼프...멤버들에게 말 못했다” 고백 출처: 서울신문에서 제공하는 기사입니다 en.seoul.co.kr/news He's still receiving treatment, and can no longer dance on live stages, often only making sporadic appearances at the latter half of the song. It also contributes to him being a sub-rapper and vocals instead of a lead dancer.\"[女 수다 ②] 김희철 “최고의 파트너는 이수근…나를 잘 아는 사람\" entertain.naver.com 2017.01.06[영상] 슈퍼주니어 김희철 “발목 부상, 나로 인해 안무 많이 바꿔야했다” ‘고백’ newsinside 2017.11.06 ==Discography== Title Year Peak chart positions Sales (DL) Album KOR Gaon * * * * KOR Hot * * Collaborations \"Breakups are So Like Me\" 2011 33 95 * KOR: 359,128+Cumulative sales for \"Breakups are So Like Me\": * * * \"Sweet Dream\" 2016 1 * KOR: 938,837+Cumulative sales for \"Sweet Dream\": * * * S.M. Station Season 1 \"Charm of Life\" 2017 — — rowspan=\"2\" S.M. Station Season 2 \"Falling Blossoms\" 2018 15 14 Soundtrack appearances \"Can It Be Love?\" 2006 rowspan=\"4\" rowspan=\"4\" rowspan=\"4\" Rainbow Romance OST \"A Family\" Bad Family OST \"Don't Walk Away\" 2008 Xanadu OST \"First Star\" 2009 Loving You a Thousand Times OST As featured artist \"King Wang Zzang\" 2010 — — rowspan=\"2\" \"You Are A Miracle\" 2013 32 — *KOR: 53,496+ \"Melody\" 2016 — Romantic Show \"—\" denotes releases that did not chart or were not released in that region. \"*\" denotes the chart did not exist at that time. ===Songwriting credits=== Year Album Artist(s) Song Lyrics 2005 Twins Super Junior \"Believe\" 2005 Twins Super Junior \"Over\" (with Eunhyuk) 2005 Show Me Your Love Super Junior, TVXQ \"Show Me Your Love\" (with Shindong, Eunhyuk) 2009 Super Show 2 Cottage Industry M&D; \"Spirit\" (\"Soul\") 2010 Defconn, Heechul \"King Wang Zzang\" 2011 Cottage Industry M&D; \"Close Ur Mouth\" 2011 Super Show 3 Heechul, Sulli (f(x)) \"The Way An Idol Breaks Up\" 2011 A-CHa Super Junior, f(x) \"Oops\" (with Leeteuk, Shindong, Eunhyuk, Donghae, Misfit) 2011 Orange Caramel Orange Caramel \"Shanghai Romance\" 2015 Cottage Industry M&D; \"I Wish\" 2015 Cottage Industry M&D; \"Midnight & Dawn\" 2015 Cottage Industry M&D; \"Moon Crystal\" 2015 Cottage Industry M&D; \"Silhouette\" 2015 Magic Heechul, Leeteuk, Yesung, Eunhyuk, Donghae \"You Got It\" (with Leeteuk, Eunhyuk, Team One Sound) 2015 Magic Heechul, Leeteuk \"Sarang♥\" (with Team One Sound) 2016 Goody Bag M&D;, Wheein (Mamamoo) \"Narcissus\" 2016 Goody Bag M&D; \"Ulsanbawi\" 2016 Goody Bag M&D; \"Banana Shake\" 2016 Goody Bag M&D; \"Essay\" 2016 Goody Bag M&D;, No Dae- geon (Bursters) \"No DAP\" 2016 S.M. Station Season 1 Heechul, Min Kyung-hoon \"Sweet Dream\" 2017 Play Super Junior \"Spin Up!\" (with Eunhyuk, Jo Yoon-kyung) 2017 Play Super Junior \"I Do\" (with Yoda, Min Yeon-jae, 1wol 8il) 2017 S.M. Station Season 2 Heechul, Shindong, Eunhyuk, Solar (Mamamoo) \"Charm of Life\" (with Shindong, Eunhyuk) 2018 Replay Super Junior, Leslie Grace \"Lo Siento\" (with Kenzie, Eunhyuk, Mario Caceres, Yasmil Marrufo, Leslie Grace) Replay Super Junior, Leslie Grace ==Filmography== ===Film=== Year Title Role Note 2007 Attack on the Pin-Up Boys The Ultra Junior President Alvin and the Chipmunks (Korean voice-cover) Simon (voice) with Kangin, Shindong 2011 Super Show 3 3D Himself Biographical film 2016 Familyhood Broadcasting Station Idol Cameo === Television series === Year Title Role Network Note Leading role 2005-06 Rainbow Romance Heechul MBC 2014 Flower Grandpa Investigation Unit Park Jung-woo tvn 2016 Youth Recipe SBS Web drama (unreleased)\"청담 플레이스제이\" SBS 웹드라마 청춘 레시피 촬영 naver 2016.03.30 Supporting role 2005 Sharp 2 (Season 2) Baek Jin-woo KBS2 Debut 2006 Bad Family Gong Min SBS 2007-08 Golden Bride Kim Young-soo 2009-10 Loving You a Thousand Times Lee Chul 2011 Melody of Youth Shen Tai Yi CCTV-1 Chinese drama Cameo 2005 Loveholic Joo Ho KBS2 2009 Tae- hee, Hye-kyo, Ji-hyun Couple breaker MBC EP 116 2010 I am Legend Madonna Band's fan SBS EP 15 2013 The Heirs Music Program MC EP 4 === Television Show === Year Title Role Network Note Ref 2008 To Be Kangin And Heechul Cast with Kangin ETN 8 vs 1 Co-host with Shin DongYup, Jung Chanwoo, Shim Eun-jin, Sol Bi SBS 2008-09 Good Daddy Daddy Band of Brothers Cast Mnet 2010 Family Outing (Season 2) Member of the Family SBS EP 12 - 17 2010-11 Radio Star Host MBC EP 160 - 162 , 165 - 205 Kyuhyun replaced as regular MC \"Super Junior Kyuhyun replaces Kim Heechul on 'Radio Star'\" Asiae. September 22, 2011. Retrieved 2012-03-22 2011 The Night the Memories Shine Bright MC with Ryu Si-won, Kyeong-shil Lee, Lee Hong Ryul MBC Drama EP 1 - 5, 8 - 16, 18 - 21 Saturday Freedom (Secret) MC KBS EP 1 - 15 2013-14 Ssulzun Cast JTBC He left the program on 14 July 2014 Global Edition (Season 2) Paired up with Puff Guo MBC Every 1 Tell Me Your Wish MC \\- dressed as Anna (Frozen) MBC On 26 September My Young Tutor Friend Cast with Jeong Jun-ha EP 1 - 3 2015 The Demand of Luxurious Food Panelist with Jun Hyun-moo TVN EP 1 - 13 National Singing Contest Panel KBS2 On 28 September (Chuseok Special) Duet Song Festival Celebrity Supporters MBC Pilot 1 MAPS Cast with Simon D, Kwon Yuri, Choi Kang-hee O'live A Style For You MC KBS 2015-16 All the Way With You (Season 1, 2) Host Zhejiang Television Korean-Chinese program 2015-17 Weekly Idol (Season 1) Main MC Special MC MBC Every 1 EP 245 - 270, 275 EP 229, 230, 300 2015–Present Knowing Bros Cast JTBC 2016 Code: Secret Room (Season 1) Contestant Eliminated On Rounds 7 Perhaps Love (Season 3) Paired up with Li Feier Hubei TV Chinese Variety Show \"'글로벌 예능돌' 김희철, 中서 한번 더 가상 연애\" entertain.naver.com 2016.06.05 2016-17 Phantom Singer (Season 1) MC JTBC Singderella (Season 1, 2) Channel A Secretly Greatly Host MBC Lipstick Prince (Season 1, 2) Main MC OnStyle 2016-18 Game Show SBS TV '유희낙락' 김희철 배성재 장예원, MC 라인업 확정…이진호 홍진호 소혜 다원 '고정 패널' kookje.co.kr 2016-12-07 2017 Syndrome Man MC with Kim Gura, Kim Min-jong, Jung Yong-hwa KBS2 On 30 January (Seollal Special) \"김구라X김민종X김희철X정용화, 뭉친다…\" KBS 설 파일럿 '신드롬맨' MC\"\" stoo.asiae.co.kr/news 2017.01.04 Bragging Room Guest MC with Park Myeong-su On March (Pilot episode Part 1,2) Pot Stand Host EP 1, 3, 6, 13 Living Together in Empty Room Cast member with GFriend MBC EP 8 - 11 Idol School Homeroom Teacher Mnet 2017-18 Perfect on Paper MC JTBC 2017–Present Life Bar (Season 2) TVN My Daughter's Men (Season 2, 3) E Channel 2018–Present 1% Friendship MC Paired up with Joo Jin-woo KBS2 Ep 1 - 3 === Musical === Year Title Role Partner(s) 2008 Xanadu Sonny Kangin === Radio Show === Year Title Role Note Kiss the Radio KBS Cool FM Special DJ 2005-06 Young Street Radio SBS Power FM DJ with Park Hee-von 2010-11 Heechul's Young Street DJ 2012-13 Kim HeeChul's SungDong Cafe Website of District Seong Dong === Hosting === Year Title Partner(s) 2005 KM Show Music Tank 2006-08 SBS Inkigayo Ku Hye-sun Jang Keun-suk Song Ji-hyo 2008-09 2010 2011 Dream Concert Song Ji HyoRyu Seung-yoon \"Hosts for '2009 Dream Concert' announced\" The Korea Herald. 30 March 2010. Retrieved 2012-03-29 Shin Se-kyung, Taecyeon (2PM) Hara (KARA), Song Joong-ki 2009 2010 2013 SBS Gayo Daejun Park Shin-hye, Jung Yonghwa (CNBLUE) Hwang Jung Eum, Jung Yonghwa (CNBLUE), Jo Kwon (2AM) Sandara Park (2NE1), Sung Si-kyung\"성시경 김희철 산다라박 SBS '가요대전' MC 확정\" news.nate.com 2013/12/17 2015 HongKi's Solo Debut Showcase 2016 NCT On Air SUWON K-POP Super Concert Twice (Momo, Chaeyoung), Zhou Mi (Super Junior-M) Zhoumi's Showcase 2017 Lovelyz's Showcase Yoon Sang MBC Entertainment Awards Yang Se-hyung, Han Hye-jin단독 김희철, MBC ‘방송연예대상’ MC 확정...한혜진과 호흡 OSEN 2017/12/07 2017 2018 Seoul Music Awards Tak Jae-hoon, Jeon So-mi Shin Dong-yup, Kim So-hyun ===Music videos=== Title Year Other artist(s) Collaborations Collaborations Collaborations \"Breakups are So Like Me\" 2011 Kim Jang-hoon \"Sweet Dream\" 2016 Min Kyung-hoon \"Charm of Life\" 2017 Shindong, Eunhyuk, Solar \"Falling Blossoms\" 2018 Min Kyung-hoon As featured artist As featured artist As featured artist \"King Wang Zzang\" 2010 Defconn \"You Are A Miracle\" 2013 Various Artists \"Melody\" 2016 Eve ==Awards and nominations== Year Award Category Nominated work Result Ref. 2007 Best Pretty Boy Heechul 2011 Best Celebrity Heechul Matheson, Whitney: \"The Shorty Awards call for (brief) nominations\", USA Today Best Newcomer Award Radio Star 2015 Asia Beauty Icon Award Heechul 2016 Crazy Person Award Knowing Bros Best Entertainer Best Couple Award with Min Kyung-hoon 2017 Song of the Year (November) with Min Kyung-hoon \"Sweet Dream\" Best Rock Song with Min Kyung-hoon ==References== Category:1983 births Category:K-pop singers Category:Living people Category:SM Entertainment artists Category:South Korean models Category:South Korean singer-songwriters Category:South Korean television actors",
 "title": "Kim Heechul"
}