{
 "id": "635893",
 "text": "{{Infobox writer | name = Lorraine Vivian Hansberry | image = | imagesize = | caption = Lorraine Hansberry, 1959. | birth_name = Lorraine Vivian Hansberry | birth_date = | birth_place = Chicago, Illinois, U.S. | death_date = | death_place = New York City, U.S. | occupation = Playwright, writer, stage director | nationality = American | education = University of Wisconsin–Madison The New School | spouse = }} Lorraine Vivian Hansberry (May 19, 1930 – January 12, 1965) was an African-American playwright, essayist, journalist and activist.Lipari, Lisbeth. \"Queering the borders: Lorraine Hansberry’s 1957 Letters to The Ladder\" Paper presented at the annual meeting of the International Communication Association, Marriott Hotel, San Diego, CA, May 27, 2003 . Online. 2008-06-28. Hansberry was the first black female author to have a play performed on Broadway. Her best known work, the play A Raisin In The Sun. Hansberry died in New York City of pancreatic cancer on January 12, 1965 at the age of 34. Martin Luther King, Jr. and James Baldwin spoke at her funeral on January 15 in New York.Carter, \"Commitment amid Complexity\" (1980), p. 40. Hansberry was a playwriter of her time, becoming a cultural icon for many African Americans, and her legacy has been passed down through generations. Hansberry faced many encounters with racism, and that shaped how she created her plays. ==References== ==Other websites== * \"The Black Revolution and the White Backlash\" (audio with transcript) – speech by Lorraine Hansberry, Forum at Town Hall sponsored by The Association of Artists for Freedom, New York City, June 15, 1964 *Voices from the Gaps: Women Writers of Color – Lorraine Hansberry, University of Minnesota * *Twice Militant: Lorraine Hansberry's Letters to \"The Ladder\" – Brooklyn Museum exhibition, November 2013 – March 2014 Category:1930 births Category:1965 deaths Category:Deaths from pancreatic cancer Category:Cancer deaths in New York City Category:American essayists Category:Democrats (United States) Category:American atheists Category:American LGBT writers Category:LGBT people from Chicago Category:Lesbian feminists Category:American feminist writers Category:American playwrights Category:American civil rights activists Category:American LGBT rights activists Category:African-American writers Category:Journalists from Chicago",
 "title": "Lorraine Hansberry"
}