{
 "id": "63609",
 "text": "William Saroyan () (August 31, 1908 - May 18, 1981) was an American author who wrote many plays and short stories about growing up impoverished as the son of Armenian immigrants. These stories were popular during the Great Depression. Saroyan grew up in Fresno, the center of Armenian-Americans in California, where many of his works are set (although he sometimes gave the city a fictional name). Asked how to say his name, he told The Literary Digest \"In Armenian it is sor-row'yan, accent on row. In America it is mispronounced with... 'roy.'\" Charles Earle Funk, What's the Name, Please?, Funk & Wagnalls, 1936. == Life == Saroyan was born in Fresno, California, the son of an Armenian immigrant. His father moved to New Jersey in 1905 - he was a small vineyard owner, who had been educated as a Presbyterian minister. At a certain point his father was forced to take farm-laboring work, and he died in 1911. At the age of four, William Saroyan was placed in the Fred Finch Orphanage in Oakland, California, together with his brother and sister - an experience he later described in his writing. Five years later the family reunited in Fresno, where his mother, Takoohi, had obtained work in a cannery. == Quotations == * \"The writer is a spiritual anarchist, as in the depth of his soul every man is. He is discontented with everything and everybody. The writer is everybody's best friend and only true enemy - the good and great enemy. He neither walks with the multitude nor cheers with them. The writer who is a writer is a rebel who never stops.\" (from The William Saroyan Reader, 1958) * \"I should like to see any power of the world destroy this race, this small tribe of unimportant people, whose wars have all been fought and lost, whose structures have crumbled, literature is unread, music is unheard, and prayers are no more answered. Go ahead, destroy Armenia. See if you can do it. Send them into the desert without bread or water. Burn their homes and churches. Then see if they will not laugh, sing and pray again. For when two of them meet anywhere in the world, see if they will not create a New Armenia.\" == References == == Other websites == * The William Saroyan Society * William Saroyan article on Armeniapedia.org * The William Saroyan Literary Foundation Intl. on WilliamSaroyan.org Category:Writers from Fresno, California Category:1908 births Category:1981 deaths",
 "title": "William Saroyan"
}