{
 "id": "63614",
 "text": "During the Spanish colonization of the Americas, Spain took control of lands in the Americas and established colonies in what is now the United States. Spanish colonization began with the arrival in America of Christopher Columbus (Cristóbal Colón) in 1492. This began the European colonization of the Americas. == The conquistadors == Spanish conquistadors (\"conquerors\") took over more and more land in the Americas until they owned Central America, most of South America, Mexico, the South of what today is Southern United States, the Western part of what today is the United States, the Southwestern part of what today is British Columbia in Canada, and even Alaska.Sources on Spaniards in Alaska, British Columbia and Oregon: Study In fact, New Spain formally ruled the southwestern part of what today is the British Columbia (Source ) The conquistadors were not solely representatives of the Spanish crown. They had diverse motivations; some wanted to gain wealth and glory, while others wanted to convert, pursue, and conquer indigenous peoples and lands. The conquistadors often acted in their own self-interest rather than the crown's. The conquistadors were not exclusively of European descent; many were of mixed heritage. Conquistadors like Bernal Diaz del Castillo and Hernan Cortes wrote the first accounts of Spanish conquest in the Americas. In these accounts, they described themselves as good men doing good things. They emphasized their bravery, and did not mention the brutality of the Spanish rule and the suffering it caused indigenous people. In their reports, Cortes and Diaz present themselves as exceptional conquistadors whose goals were to get rich without using force, to seize land, and to convert the indigenous peoples to Catholicism. == Indigenous peoples == The indigenous peoples of the Americas used various methods to communicate with the Spanish conquistadors. They used interpreters, communicated using gestures, or simply learned each other’s languages. Spanish colonization of the Americas was an incomplete process, as the continent was not fully under Spanish control upon initial contact with the native peoples. The Americas were not underdeveloped before the arrival of the Spanish. The indigenous peoples did not live in a state of primitiveness, but instead had incredibly advanced agricultural, social, and architectural systems. The Spanish conquistadors were not superior to the indigenous peoples, some of whom belonged to advanced societies with complex cultures and technological advancements. == Writings about Spanish colonization == === During the 19th and early 20th centuries === The story of the Spanish conquest of the Americas has evolved significantly throughout the years, becoming more historically accurate over time. For a long time, stories about Spanish colonization of the Americas celebrated the conquistadors and did not consider their impact on indigenous people. However, in the 19th century, indigenous people's writings about Spanish colonization began to gain recognition. The works of native writers were finally acknowledged. These works emphasized native peoples' resistance towards the Conquest, and suggested that the Conquest utterly destroyed these people's lives. By the mid-20th century, writings about Spanish colonization that celebrated the Conquest became less popular. Writings increasingly focused on how negatively the Conquest affected indigenous peoples. They discussed how the conquistadors portrayed themselves inaccurately and had some selfish motivations: they wanted to get rich; to obtain glory and wealth; and to convert, pursue, and conquer indigenous peoples and lands. New interpretations of the Conquest story argued that Diaz and Cortes were not brave, but reckless, viewing the New World and its inhabitants merely as territory they could control by force. === \"Seven Myths of the Spanish Conquest\" (2007) === In his 2007 book Seven Myths of the Spanish Conquest, Michael Restall challenges the traditional narrative that portrayed Spanish conquistadors as extraordinarily courageous. He emphasizes that the conquistadors' writings related only to individual strategic goals and personal perspective. He suggests that the seven myths about the Spanish Conquest are The Myth of Exceptional Men, King’s Army, White Conquistador, Completion, (Mis)Communication, Native Desolation, and Superiority. Specifically, Restall writes that the Spanish conquistadors who participated in the conquest of the Americas were not exceptional, but average, and merely got lucky. * Spanish Exploration and Conquest of North America * Robert Jackson's Missions of South America * Spanish Colonial Missions Initiative NPS/INAH == References == Category:History of Native Americans Category:History of Spain Category:Spanish Empire",
 "title": "Spanish colonization of the Americas"
}