{
 "id": "63630",
 "text": "The Orontid dynasty, also known by their native name Eruandid or Yervanduni, was an Armenian dynasty that ruled the Satrapy of Armenia until 321 BC and the Kingdom of Armenia from 321 BC to 200 BC. == Origins == The origins of the dynasty are a matter of debate, it has been described as an \"Iranian\"Toumanoff, Cyril (1963). Studies in Christian Caucasian history. Washington DC: Georgetown University Press. p. 278. \"The eponym's praenomen Orontes is as Iranian as the dynasty itself...\"Garsoian, N. (2005). \"TIGRAN II\". Encyclopaedia Iranica. \"Tigran (Tigranes) II was the most distinguished member of the so-called Artašēsid/Artaxiad dynasty, which has now been identified as a branch of the earlier Eruandid [Orontid] dynasty of Iranian origin attested as ruling in Armenia from at least the 5th century B.C.E (...)\"Gaggero, Gianfranco (2016). \"Armenians in Xenophon\". Greek Texts and Armenian Traditions: An Interdisciplinary Approach. De Gruyter. \"The above mentioned Orontids..[..]..but also because the two satraps who were contemporaries of Xenophon's are explicitly stated to be Persian.\"Allsen, Thomas T. (2011). The Royal Hunt in Eurasian History. University of Pennsylvania Press. p. 37. Facella, Margherita (2021). \"Orontids\". In Yarshater, Ehsan (ed.). Encyclopædia Iranica. \"...a dynasty of Iranian origin who ruled Greater Armenia...\"Sartre, Maurice (2005). The Middle East Under Rome. Harvard University Press. p. 23. \"The Commagene kings claimed to be descended from the Orontids, a powerful Iranian family that had ruled the area during the Achaemenid period. They were related to the Achaemenids who had built a kingdom (...)\"Russell, J.R. (1986). \"Armenia and Iran iii. Armenian Religion\". Encyclopaedia Iranica, Vol. II, Fasc. 4. pp. 438–444. \"The Orontid, Artaxiad, and Arsacid dynasties were all Iranian in origin (...)\" or \"Armenian\"Adrych, Philippa; Bracey, Robert; Dalglish, Dominic; Lenk, Stefanie; Wood, Rachel (2017). Elsner, Jaś (ed.). Images of Mithra. Oxford University Press. p. 138. Yarshater, Ehsan; Fisher, William Bayne; Gershevitch, Ilya (1983). The Cambridge History of Iran. Cambridge University Press. p. 535. ISBN 0-521-20092-X \"Here a scion of the Armenian Orontid house, King Antiochus I (...) Armenian dynasty of the Orontids.\"Versluys, Miguel John (2017). Visual Style and Constructing Identity in the Hellenistic World: Nemrud Dağ and Commagene under Antiochos I. Cambridge University Press. p. 48. \"Most scholars assume that Ptolemy was the first Commagenean king and that he descended from the Armenian Orontids.\" dynasty. Some historians claim that the Orontids had a lineage relationship with the Achaemenid dynasty.Payaslian, Simon (2007). The history of Armenia : from the origins to the present (1st ed.). New York: Palgrave Macmillan. pp. 8–9. Panossian states the following about the Orontids (Yervandunis);Panossian, Razmik (2006). The Armenians From Kings and Priests to Merchants and Commissars. United Kingdom: Columbia University Press. p. 35. > \"It is not known whether the Yervandunis were ethnically Armenian. They > probably had marriage links to the rulers of Persia and other leading noble > houses in Armenia.\" == Culture and language == During the Orontids, despite the Hellenistic invasion; Persian and local Armenian culture remained the most powerful element in society and elites.Panossian, Razmik (2006). The Armenians From Kings and Priests to Merchants and Commissars. United Kingdom: Columbia University Press. p. 36. \"The Hellenistic invasion of Persia partially influenced Armenia as well, but Persian and local Armenian culture remained the strongest element within society and the elites.\" The Orontid dynasty spoke Armenian. Some have suggested a continuity with the Hittite name Arnuwanda. == References == ==Other websites== *The Yervanduni Dynasty-A. Richard Diebold Center for Indo-European Language and Culture *The Orontid (Ervanduni) dynasty Category:Monarchs of Armenia Category:Royal dynasties",
 "title": "Orontid dynasty"
}