{
 "id": "636409",
 "text": "Oachira is a town in Karunagappally taluk, Kollam district in Kerala, India. ==Temple town== Oachira is one of the famous holy places of Kerala and in India. Oachira is on the border of Kollam District and Allappuzha District.Ochira.com main page The famous temple of Para Brahmam (OMkaram) is located here. ==Festivals== The major annual festivals are Oachira Kali or Oachirakali and the twelve-day Panthrandu Vilakku , which is held in November/December. Oachira Kali is celebrated in commemoration of the battle of Kayamkulam, fought between Marthanda Varma, the Maharaja of Travancore and the Raja of Kayamkulam. It is a mock fight enacted between groups of men dressed as warriors on the padanilam (battlefield). Yet another festival celebrated in Oachira Temple is the \"Irupathiyettam Onam\" (Thiruvonum in the month of Kanni). It is considered the Onam of cows and bulls and is celebrated on Thiruvonam. These concepts are related to Shiva Vahana. ==Celebrities== Eminent cartoonist Shankar hails from near Oachira. The government of Kerala paid a tribute to him, in the form of a museum in memory of the country’s best known and most revered political cartoonist,near his birthplace Oachira. Kerala Lalithakala Akademi was behind the ambitious projec,which costs an estimated initial cost of Rs. 3. 5 crore which spreads over 15,000 sq.ft. of land. ==To reach== To reach Oachira, by air, the nearest airports are Trivandrum International Airport and Cochin International Airport. By rail,Oachira and Kayamkulam Jn. is nearest station ==Education== RVSM Higher Secondary School, situated at Prayar is the oldest and biggest educational institution in Oachira. Oachira Govt. Higher Secondary School is another famous educational institution. PRAGATHI Hindi Vidyalay is a famous Hindi college == Places near Oachira == * Madathilmukku- * Ragam JN. * Prayar * Oachira Temple * Memana - * Valiyakulangara * Vayanakam == References == == Other websites == *Ochira.com *Karunagappally, Kollam, Kerala Webportal Category:Towns in Kollam district",
 "title": "Ochira"
}