{
 "id": "63654",
 "text": "Donald John Trump (June 14, 1946) is an American businessman, media personality, and politician who is the 47th president of the United States since 2025. Before, he served as the 45th president from 2017 to 2021. He is a member of the Republican Party. Trump was also the chairman of The Trump Organization from 1971 to 2017. Trump is a billionaire. Much of his money was made in real estate in New York City, Las Vegas, and Atlantic City. From 2004 to 2015, Trump was the host of his own reality television show The Apprentice. Trump became the Republican Party nominee for president in 2016. He won that year's presidential election against Democrat Hillary Clinton. He was inaugurated as the 45th president in 2017. Trump lost a second term to Joe Biden in the 2020 election. He did not agree with the result and said he won the election by a \"big amount\". He tried but failed to change the election results. In 2022, Trump announced another presidential campaign for the 2024 presidential election, where he defeated Vice President Kamala Harris to be elected the 47th president. In 2023, Trump became the first former U.S. president to face criminal charges. In 2024, he became the first former U.S. president convicted of a felony. He is the first felon to serve as president. ==Early life== Donald John Trump was born at Jamaica Hospital Medical Center in Queens, New York City. He is the son of Fred Trump and his wife Mary Anne (née MacLeod). They married in 1936. His mother was born on the Isle of Lewis, off the west coast of Scotland. Donald was one of five children. Donald's oldest brother, Fred Jr., died in 1981 at the age of 43, due to an alcohol addiction. Trump's sister, Maryanne, is a judge in New York. Trump's father's parents were German immigrants. His grandfather, Frederick Trump, immigrated to the United States in 1885. He became a naturalized American citizen in 1892. Frederick married Elisabeth Christ (October 10, 1880 – June 6, 1966) at Kallstadt, State of Bavaria, Germany, on August 26, 1902. They had three children. He studied at Fordham University until transferring to the University of Pennsylvania. Trump was not drafted during the Vietnam War. This was due to four college deferments and one medical deferment. In an interview with The New York Times, he said his medical deferment was because of heel spurs. ==Career== ===Hotel developments=== Trump began his career at his father's real estate company, Elizabeth Trump & Son. He later renamed the company The Trump Organization, which has its headquarters at 40 Wall Street. The company focused on middle-class rental housing in Brooklyn, Queens, and Staten Island. One of Trump's first projects, while he was still in college, was the revitalization of the foreclosed Swifton Village apartment complex in Cincinnati, Ohio. His father had purchased it for $5.7 million in 1962. Trump became closely involved in the project. With a $500,000 investment, he turned the 1200-unit complex with a 66 percent vacancy rate to 100 percent occupancy within two years. In 1972, the Trump Organization sold Swifton Village for $6 million. Trump has developed many real estate projects. They include Trump International Hotel and Tower in Honolulu, Trump International Hotel and Tower in Chicago, Trump International Hotel and Tower in Toronto, and Trump Tower in Tampa. In Fort Lauderdale, Florida, one Trump construction project was put on hold in favor of another (Trump International Hotel and Tower in Fort Lauderdale). Trump Towers in Atlanta was being developed in the housing market, however the project fell after the 2008 recession and instead buildings that didn't belong to Trump were built. In its October 7, 2007 Forbes 400 issue, \"Acreage Aces\", Forbes valued Trump's wealth at $3 billion.Forbes topic page on Donald Trump Forbes. Retrieved April 2010. Since 2011, his net worth has been estimated from $2 billion to $7 billion. Forbes estimated his net worth at $3.1 billion in 2019. ===Beauty pageants=== From 1996 until 2015, Trump owned part or all of the Miss Universe, Miss USA, and Miss Teen USA beauty pageants. === Wrestling support === Trump is a WWE (World Wrestling Entertainment) fan, and a friend of WWE owner Vince McMahon. In 1988–89 he hosted WrestleMania IV and V at Boardwalk Hall (dubbed \"Trump Plaza\" for storyline purposes) and has been an active participant in several of the shows. Trump was inducted into the celebrity wing of the WWE Hall of Fame in 2013 at Madison Square Garden for his contributions to the promotion. He made his sixth WrestleMania appearance the next night. === The Apprentice === In 2003, Trump became the executive producer and host of the NBC reality show The Apprentice, in which a group of competitors battled for a high-level management job in one of Trump's commercial enterprises. In 2004, Trump filed a trademark application for the catchphrase \"You're fired!\" For the first year of the show, Trump earned $50,000 per episode (roughly $700,000 for the first season), but following the show's initial success, he was paid $1 million per episode. In a July 2015 press release, Trump's campaign manager said that NBCUniversal had paid him $213,606,575 for his 14 seasons hosting the show. On February 16, 2015, NBC announced that they would be renewing The Apprentice for a 15th season. On February 27, Trump stated that he was \"not ready\" to sign on for another season because of the possibility of a presidential run.",
 "title": "Donald Trump"
}