{
 "id": "636585",
 "text": "Friedrich \"Fritz\" Thyssen (9 November 1873 – 8 February 1951) was a German businessman from Mülheim. His father August was head of the Thyssen mining and steelmaking company, founded by his father Friedrich and based in the Ruhr city of Duisburg. He supported Nazism in the 1920s. He led the Ruhr steelmakers in refusing to co-operate in producing coal and steel for France and Belgium as part of the reparations for the first World War. He was arrested, imprisoned and fined. His companies employed 200,000 people. He gave a lot of money to the Nazi Party, and got other companies to do the same. He thought this would stop the spread of communism. In November, 1932, Thyssen and Hjalmar Schacht were the main organisers of a letter to President Paul von Hindenburg telling him to appoint Hitler as Chancellor. He sacked his Jewish workers but he objected to the persecution of Christians by the Nazis. After Kristallnacht in November 1938, he resigned from the Prussian Council of State. He started criticising Nazi economic policies. In September 1939 sent he Hermann Göring a telegram saying he was opposed to the war. He and his family went to Switzerland. His company was nationalised. In 1940 he moved to France. He was arrested while he was visiting his ill mother in Belgium. In 1943 he and his wife were sent to Sachsenhausen concentration camp and in 1945 to Dachau. They were liberated by the 42nd Infantry Division and 45th Infantry Division on 5 May 1945. After the war he was tried for being a supporter of the Nazi Party. It was decided that he was a lesser offender and he was sentenced to a fine of 15% of his assets. In January 1950, he and his wife moved to Buenos Aires, where he died the following year. ==References== Category:1873 births Category:1951 deaths Category:German businesspeople Category:German people of World War II Category:Members of the Reichstag (Nazi Germany) Category:People from North Rhine-Westphalia",
 "title": "Fritz Thyssen"
}