{
 "id": "636682",
 "text": "Margaret Ruth Kidder (October 17, 1948 – May 13, 2018) professionally known as Margot Kidder, was a Canadian-American actress and activist. She was known for her role as Lois Lane in the 1978 movie Superman and the eventual other movies within the movie series, alongside Christopher Reeve. Kidder also starred in Brian De Palma's cult thriller Sisters (1973); in the slasher movie Black Christmas (1974); and the dramas The Great Waldo Pepper (1975); The Reincarnation of Peter Proud (1975). She starred as Kathy Lutz in The Amityville Horror (1979). Kidder was born in Yellowknife, Northwest Territories, Canada. She studied at Havergal College in Toronto. From 1975 to 1978, she was married to Thomas McGuane. From 1979 to 1980, Kidder was married to John Heard, for a total of six days. From 1983 to 1984, Kidder was married to Philippe de Broca. She had one child. Kidder suffered from paranoia and bipolar disorder which caused her to suffer from mental breakdowns and temporarily retire a few times. In April 1996, Kidder went missing for four days in Los Angeles and was found at a backyard of a house after she was nearly raped. Kidder was in a car crash in December 1990, after which she was unable to work for two years, causing her financial problems. In 1978, Kidder won a Saturn Award for Best Actress for her Lois Lane role. In 2015 Kidder won an Emmy award for Outstanding Performer in Children's Programming for her performance in R.L. Stine's The Haunting Hour. In 2005, Kidder became a naturalized U.S. citizen. In later years, Kidder became an outspoken political, environmental, and anti-war activist. She endorsed Senator Bernie Sanders for President of the United States in 2016. Kidder died on May 13, 2018, at her home in Livingston, Montana at the age of 69. On August 8, 2018, it was reported that Kidder's death had been ruled a suicide by drug and alcohol overdose. ==References== ==Other websites== * * * * Article: From paranoid delusions to orthomolecular medicine * Canadian Film Encyclopedia * The Best Damn Fiddler from Calabogie to Kaladar Category:Emmy Award winning actors Category:Saturn Award winners Category:1948 births Category:2018 deaths Category:Drug-related suicides in the United States Category:Naturalized citizens of the United States Category:People with bipolar disorder Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:American environmentalists Category:American autobiographers Category:American LGBT rights activists Category:American atheists Category:Canadian movie actors Category:Canadian television actors Category:Canadian voice actors Category:Canadian stage actors Category:Canadian activists Category:Writers from Montana Category:Democrats (United States) Category:Actors from Montana",
 "title": "Margot Kidder"
}