{
 "id": "63674",
 "text": "The F/A-18 Hornet (CF-18, F-18) is a fighter jet that is made by Boeing, and was originally manufactured by the McDonnell-Douglas Company. It first flew in 1978 and was introduced in 1983. Its main user is the United States Navy. It can take off from aircraft carriers because of its special design. The F/A-18 can attack land and air targets. Any aircraft which can do this is called \"multi-role\". The Hornet is also flown by the Blue Angels. ==Variants== ===F/A-18A/B Hornet=== The F/A-18A, single-seat variant, can employ the AGM-84 Harpoon, AGM-65E Maverick, AGM-88 HARM and the AGM-62 Walleye I/II. The F/A-18A was also equipped with the AN/AAS-38 Nite Hawk targeting pod and the AN/ASQ-173 laser spot tracker for targeting. During the Gulf War, there were limited numbers of the Nite hawk for USN and USMC Hornets. The F/A-18B has space for the two-seat cockpit, provided by a relocation of avionics equipment and a 6% reduction in internal fuel. Two-seat Hornets are otherwise fully combat-capable. The B-model is used primarily for training. In 1992, the original Hughes AN/APG-65 radar was replaced with the Hughes (now Raytheon) AN/APG-73, a faster and more capable radar. A-model Hornets that have been upgraded to the AN/APG-73 and are capable of carrying the AIM-120 AMRAAM are designated F/A-18A+. === F/A-18C/D Hornet === The F/A-18C and D models are a better version created in 1987\"F/A-18 Hornet Milestones.\" Boeing. Retrieved: 17 March 2007. with improved equipment and can carry new missiles such as the AIM-120 AMRAAM air-to-air missile\"F/A-18 Hornet.\" Federation of American Scientists. Retrieved: 4 July 2008. and later on the AGM-84E SLAM as well as the IR version of the AGM-65 (AGM-65F). The F/A-18C is the single-seat variant and the F/A-18D is the two-seat variant.Jenkins 2000, pp. 64–66. Production of the C- and D- models stopped in 2000. The last F/A-18C was assembled in Finland and delivered to the Finnish Air Force in August 2000.Senior 2003, p. 33. The last F/A-18D was delivered to the U.S. Marine Corps in August 2000.Senior 2003, p. 37. The U.S. Navy retired its F/A-18C/D in February 2019. However, the USMC still retains theirs, and is in the process of upgrading their radar to APG-79(V)4 Active Electronically Scanned Array (AESA) radar system. ===F/A-18E/F Super Hornet=== The single-seat F/A-18E and two-seat F/A-18F, both officially named Super Hornet, is a very redesigned version of the original F/A-18 but have been extensively redesigned by McDonnell Douglas. It is a larger airplane with more powerful engines. The Super Hornet is also operated by Australia and Kuwait. ===EA-18G Growler=== The EA-18G Growler is an electronic warfare version of the two-seat F/A-18F, which entered production in 2007. The Growler has replaced the Navy's Grumman EA-6B Prowler and carries a Naval Flight Officer as a second crewman in an Electronic Warfare Officer (EWO) role. == Users == The F/A-18 is used by many countries, including the United States Navy === United States === The United States navy is the biggest user of the hornet. The hornet is currently only used by the United States Marine Corps, but until 2019 the U.S. Navy also had them. The USMC currently has 143 F/A-18 hornets. ==== Blue Angels ==== The Blue Angels are the aerobatic team of the U.S. Navy. They use the F/A-18. Before the F/A-18 existed, they used the A-4 Skyhawk. === Australia === The Royal Australian Air force (RAAF) bought 57 F/A-18A and 18 F/A-18B (the b was used for training) in 1981 to replace the old Mirage III. The difference between the RAAF hornet and the US hornet is that the RAAF removed the carrier Capabilities, because Australia doesn't have any aircraft carriers big enough to fit the plane. == Armament == The hornet can carry a lot of bombs, missiles, rockets and guns. It can also carry pods, pods give the aircraft more options, the Litening targeting pod,for example, lets the pilot see the ground and guide bombs to the target. === Bombs === B81 and B83 nuclear bombs Joint Direct Attack Munition (JDAM) Paveway laser guided bombs (the bombs are guided by the targeting pod) Mk80 bombs general purpose CBU100 cluster bomb === Rockets === 2.75 in (70 mm) Hydra 70 rockets 5 in (127.0 mm) Zuni rockets === Missiles === ==== Air to Air ==== Aim-120 AMRAAM Aim-9 Sidewinder Aim-132 ASRAAM Iris-T Aim-7 Sparrow ==== Air to Ground ==== AGM-65 Maverick AGM-88 HARM AGM-164 Joint Standoff Weapon (JSOW) Taurus Cruise Missile ===== Anti Ship ===== AGM-84 Harpoon ==Related pages== *F-14 Tomcat *F-16 Fighting Falcon *F/A-18E/F Super Hornet ==References== ===Citations=== ===Books=== * Jenkins, Dennis R. F/A-18 Hornet: A Navy Success Story. New York: McGraw-Hill, 2000. . * Senior, Tim. \"F/A-18 Hornet, The AirForces Monthly book\". AirForces Monthly, 2003. . Category:United States Navy aircraft Category:United States Marine Corps aircraft Category:Australian military aircraft Category:Spain",
 "title": "McDonnell Douglas F/A-18 Hornet"
}