{
 "id": "636715",
 "text": "The Vice President of the Philippines is the second-highest executive official of the government of the Philippines, after the President. The Vice President currently holds office at the Quezon City Reception House in Quezon City. The current office of the Vice President was re-established under the 1987 Constitution. Sara Duterte from Davao City assumed the office on June 30, 2022 as the 15th and current vice president. The official title of the office in Filipino is Pangalawang Pangulo, although Bise Presidente, derived from Spanish, is the usual title used in some of the major Philippine languages, such as Cebuano and Hiligaynon language. ==Eligibility== Article 7, Section 3 of the Constitution mandates that the Vice President must bear the same qualifications as the President which means he must be: * a natural-born citizen of the Philippines; * a registered voter; * able to read and write; * at least forty years of age on the day of election; * and a resident of the Philippines for at least ten years immediately preceding such election.\"1987 Constitution of the Philippines, art. 7, sec. 2 ==Succession== There has been four cases where the Vice President has assumed the Presidency, three of which because of the President's death, and one because of the President's resignation: * Sergio Osmeña in 1944, upon the death of Manuel L. Quezon. * Elpidio Quirino in 1948, upon the death of Manuel Roxas. * Carlos P. Garcia in 1957, upon the death of Ramon Magsaysay. * Gloria Macapagal-Arroyo in 2001, upon the resignation of Joseph Ejercito Estrada, as decided by the Supreme Court. ==List== ==Living former Vice Presidents== Josephestradapentagon.jpg|Joseph Ejercito Estrada (under Fidel V. Ramos) Born Gloria Macapagal Arroyo.jpg|Gloria Macapagal Arroyo (under Joseph Ejercito Estrada) Born Vp guingona.jpg|Teofisto Guingona (under Gloria Macapagal-Arroyo) Born Vp Noli De Castro.jpg|Noli L. de Castro (under Gloria Macapagal-Arroyo) Born Jejomar Binay.jpg|Jejomar C. Binay (under Benigno S. Aquino III) Born 14th Vice President of the Philippines Leni Robredo.png|Leni Robredo (under Rodrigo Duterte) Born ==References== ==Other websites== * Office of the Vice President of the Philippines *",
 "title": "Vice President of the Philippines"
}