{
 "id": "636712",
 "text": "The President of the Philippines (, informally known as Presidente ng Pilipinas) is the head of state and head of government of the Philippines. The President leads the executive branch of the Philippine government and is the commander-in-chief of the Armed Forces of the Philippines. The President is directly elected by the people, and is one of only two nationally elected executive officials, the other being the Vice President of the Philippines. However, four vice presidents have assumed the presidency without having been elected to the office, such as by the death or resignation of an incumbent president.The four vice presidents who succeeded to the presidency upon their predecessor's death or resignation and finished-out that unexpired term are: Sergio Osmeña (1944); Elpidio Quirino (1948); Carlos P. Garcia (1957); Gloria Macapagal Arroyo (2001). Filipinos refer to their President as Pangulo or Presidente. The President serves a single, fixed, six-year term without possibility of re-election. On June 30, 2022, Bongbong Marcos was sworn in as the 17th and current president. ==Eligibility == Article 7, Section 2 of the Constitution reads that in order to be eligible for President the person must: * Be a natural-born citizen of the Philippines * A registered voter * Able to read and write * At least forty years of age on the day of the election * A resident of the Philippines for at least ten years immediately before the election1987 Constitution of the Philippines, art. 7, sec. 2 ==List== ==Living former presidents== As of , there are three living former Presidents: The most recent president to die was Fidel V. Ramos (served 1992–1998), on July 31, 2022, at the age of 94. ==Notes== ==References== ==Other websites== * Office of the President of the Philippines * The Presidential Museum and Library * 1987 Constitution of the Philippines * 'We Say Mabuhay' – The Anthem of the President of the Philippines * 'March of the President of the Philippines' (unofficial title) – song played when the President is given military honors by the Armed Forces of the Philippines *",
 "title": "President of the Philippines"
}