{
 "id": "636802",
 "text": "Brian Mumba Kasoka Bwembya (born November 12) better known by his stage name B Flow (also written as B'Flow or B-Flow), is a Zambian Dancehall and Hip Hop artist, media entrepreneur, non-political social commentator, social justice advocate, part-time radio presenter, peer educator and founder of Music For Change Initiative. He is also the current chairperson of the HIV/AIDS and Social Commentary (HASC) committee of the Zambia Association of Musicians (ZAM). He is also a global ambassador in the fight against with the AIDS Healthcare Foundation (AHF). B Flow also took a new direction with his music, changing his genre to what is now known as “KaliDanceHall” (A mix of traditional Zambian Kalindula music and Dance Hall). In November 2016, the United Nations Population Fund (UNFPA) named B Flow as one of the 16 voices of activism against gender-based violence around the world. ==Biography== ===Early life=== B Flow was born in Kabwe on 12 November. He was raised by his grandmother Matilda Chiti-Byrne and his mother Mirriam Mulenga Mumba Byrne, a policewoman. B Flow cames from a family of Zambian musicians which include Chris Mbewe of The Great Witch Band, Anna Mwale of The Mwale Sisters and Ras Willie. ===The Beginning=== At the age of 8, he and his friends played a small band by turning pots and buckets into drums and making banjos (non-electric guitars) using tins, planks and strings. Among that band B Flow was the only one who is now a professional musician. B Flow's first album Mpu mpu mpu (meaning heartbeat) was released in 2009. The album earned B Flow recognition at the 2009 Zambia Ngoma Awards and his second solo album called 'No More Kawilo' was released in 2011 (meaning no more loneliness). His third album 'Voiceless Woman' was released in 2013. His fifth album Dear Mama a dedication to his mother was released in 2016. ==Awards and nominations== Year Award Category Result 2009 Ngoma Awards Best pcoming artist of the year against Nominated 2009 Born and Bred Awards best Ragga Video Of The Year Nominated 2009 Hone Fm Best Upcoming Artist of the year. Nominated 2010 Radio Phoenix/Zain Best Collaboration Of The Year. Nominated 2011 Radio Phoenix Best Song Of The Year Nominated 2011 Born & Bred Video Awards Best Conscious Video Won 2012 Born & Bred Video Awards Best Dance hall Video Won 2013 Zambian Music Awards Best Dancehall Artist Nominated 2014 Zambian Music Awards Best Mainstream Album Nominated 2014 Zambian Music Awards Best Collaboration Song Nominated 2014 Zambian Music Awards Best Dance hall Artist Won 2014 Zambian Music Awards Best Dance hall Album Won 2014 Born & Bred Awards Best Conscious Video Nominated 2014 Born & Bred Awards Best Dance hall Video Nominated 2014 Born & Bred Awards Best Collaboration Video Nominated 2014 Born & Bred Awards Most Educative Album Won 2017 Kwacha Music Awards Best International Achievement Nominated 2017 Kwacha Music Awards Best Humanitarian Award Won 2017 Kwacha Music Awards Best Artist (Central Province Nominated 2017 Kwacha Music Awards Best Conscious Song (Know Your Status) - B Flow & Just Slim Nominated 2017 Kwacha Music Awards ==Discography== ===Studio albums=== List of studio albums, with selected information Title Album details Certification Mpu Mpu Mpu * Released: 2008/2009 * * Formats: CD, Digital download Dabo Trabo * Released: 2010 * * Formats: CD, Digital download No More Kawilo * Released: 2012 * * Formats: CD, Digital download Voiceless Woman * Released: 2013 * * Formats: CD, Digital download Dear Mama * Released: 2016 * * Formats: CD, Digital download ==References== Category:Living people Category:Musicians Category:1986 births Category:Singers Category:Zambian people Category:HIV/AIDS activists",
 "title": "B Flow"
}