{
 "id": "636808",
 "text": "The 2017–18 UEFA Champions League was the 63rd season of Europe's top club football tournament run by UEFA. It is the 26th season since it was renamed from the European Champion Clubs' Cup to the UEFA Champions League. ==Group stage== ===Group A=== ===Group B=== ===Group C=== ===Group D=== ===Group E=== ===Group F=== ===Group G=== ===Group H=== ==Knockout stage== ===Qualified teams=== Group Winners (seeded in round of 16 draw) Runners-up (unseeded in round of 16 draw) A Manchester United Basel B Paris Saint-Germain Bayern Munich C Roma Chelsea D Barcelona Juventus E Liverpool Sevilla F Manchester City Shakhtar Donetsk G Beşiktaş Porto H Tottenham Hotspur Real Madrid ===Round of 16=== The first legs were played on 13, 14, 20 and 21 February, and the second legs were played on 6, 7, 13 and 14 March 2018. |} ===Quarter-finals === The first legs were played on 3 and 4 April, and the second legs were played on 10 and 11 April 2018. |} ===Semi-finals=== The first legs were played on 24 and 25 April, and the second legs were played on 1 and 2 May 2018. |} ===Final=== The final was played at the NSC Olimpiyskiy Stadium in Kiev on 26 May 2018. The \"home\" team (for administrative purposes) was determined by an additional draw held after the semi-final draw. ==Statistics== Statistics exclude qualifying rounds and play-off round. ===Top goalscorers=== Rank Player Team Goals Minutes played 1 Cristiano Ronaldo Real Madrid 15 1170 2 Mohamed Salah Liverpool 10 930 2 Sadio Mané Liverpool 10 940 2 Roberto Firmino Liverpool 10 1056 5 Wissam Ben Yedder Sevilla 8 651 5 Edin Džeko Roma 8 1078 7 Harry Kane Tottenham Hotspur 7 597 7 Edinson Cavani Paris Saint-Germain 7 680 9 Neymar Paris Saint-Germain 6 630 9 Lionel Messi Barcelona 6 783 ===Top assists=== Rank Player Team Assists Minutes played 1 James Milner Liverpool 9 874 2 Roberto Firmino Liverpool 8 1056 3 Luis Suárez Barcelona 5 884 4 Eden Hazard Chelsea 4 611 4 Neymar Paris Saint-Germain 4 630 4 Kevin De Bruyne Manchester City 4 667 4 Mohamed Salah Liverpool 4 930 8 16 players 16 players 3 ===Squad of the Season=== The UEFA technical study group selected the following 18 players as the squad of the tournament. Player Team Keylor Navas Real Madrid Alisson Roma Joshua Kimmich Bayern Munich Sergio Ramos Real Madrid Marcelo Real Madrid Giorgio Chiellini Juventus Virgil van Dijk Liverpool Raphaël Varane Real Madrid Kevin De Bruyne Manchester City Casemiro Real Madrid Luka Modrić Real Madrid Toni Kroos Real Madrid James Rodríguez Bayern Munich Edin Džeko Roma Roberto Firmino Liverpool Lionel Messi Barcelona Cristiano Ronaldo Real Madrid Mohamed Salah Liverpool ==References== ==Other websites== *UEFA Champions League (official website) 2017-18",
 "title": "2017–18 UEFA Champions League"
}