{
 "id": "637067",
 "text": "Truyện tranh (Chữ Hán: 傳幀) means comic in Vietnamese (aka Vietnamese Comics). This term has the English name Viet comics created by Floral Age Bimonthly magazine in the 1960s to refer to comics originating in Vietnam. It is sometimes called by the older name Mạn họa (Chữ Hán: 漫畫). In Vietnamese sometimes it will be called by longer names such as: Truyện tranh Việt Nam, truyện tranh Việt, truyện tranh nội, truyện tranh ta, truyện tranh trong nước,... to distinguish it from other types of foreign comics such as: Truyện tranh Âu Mỹ (Western comics), truyện tranh Nhật Bản (Manga),... ==History== ===Pre-1900=== During the Medieval Annam, \"Viet comics\" often be called mạn họa (漫畫, comics) or liên-hoàn họa (連環畫, sequential drawings) which was affected by China and sometimes India. They illustrated philosophy or tales which were printed by wood-blocks. There were some drawings for the educating females which were called \"moral books\" (Luân-lý giáo-khoa thư). ===French Indochina (1900 - 1953)=== After the establishing of the Fédération indochinoise with a long peace, the printing technology developed strongly to make books and newspapers became more. \"Viet comics\" has appeared gradually as cartoons which was called hoạt-kê họa (滑稽畫), hí họa (戲畫) or biếm họa (貶畫). About 1930s when Europeanisation movement was, \"Viet comics\" becamed an independent art with a big number of artists and readers. Customs&Mores; Weekly (Phong-Hóa tuần-báo) and Today Weekly (Ngày-Nay tuần-báo) had known with three comic characters Bang Bạnh - Xã Xệ - Lý Toét, Official's Son Weekly (Cậu-Ấm tuần-báo) with the Three adventurous kids (Ba đứa trẻ mạo-hiểm), Drake Weekly (Vịt-Đực tuần-báo) with sequential drawings what often satirized Annamese writers, Indochinese government, especially the Governors-General... \"Viet comics\" always be called chuyện bằng tranh (stories by drawings). After WWII, there were comics what asked Vietnamese people against French Army and satirized French Government. In Hanoi and Saigon there were more comics what based on romance novels or knight tales. Besides, there were some comics with the topic of Vietnamese history and mythology. * Nguyễn Tường Tam (Đông Sơn) * Lê Minh Ðức (Bút Sơn) * Nguyễn Gia Trí (Rigt) * Tô Ngọc Vân (Tô Tử, Ái Mĩ) * Lê Phổ * Nguyễn Thứ Lễ (Lê Ta) * Nguyễn Tường Long (Tứ Ly) * Nguyễn Văn Thịnh * Nguyễn Minh Mỹ * Tạ Tỵ * Lương Xuân Nhị * Bùi Xuân Phái ===Northern and Southern Vietnam (1954 - 1975)=== From the late 1960s, comics flourished in the Republic of Vietnam by the Freedom of the Press. Firstly, the Floral Age Bimonthly (established in 1962) called \"Viet comics\" as Tranh-truyện Việt-nam (Vietnamese pictorial-stories). These led to an increase in the number of comic artists. The most famous illustrator and comic artist at the time was Võ Hùng Kiệt and he was also an illustrator for stamps. His comics were much loved by children and even women. Topics often as : Family, friendship, adventure, detective, science fiction, wuxia, fairytales... which was affected by French comics, American and Hollywood, even Jules Verne, Conan Doyle, Jin Yong's works. In the Democratic Republic of Vietnam, comics usually appeared on Pioneer Magazine, Children Magazine and Kim-Đồng books. Their contents were about family, friendship, moral, war, fairytales... Northern artists' style always be affected by Soviet art. * Lê Văn Đệ * Đào Sĩ Chu * Tú Duyên * Nguyễn Hải Chí (Chóe) * Võ Hùng Kiệt (ViVi) * Hướng Dương * Nguyễn Tài * Nguyễn Đình * Đoàn Đức Tiên * Vịt Mò * Kiến Vàng * R. Nguyễn * Vũ Tân * Ngô Mạnh Lân * Hoàng DzựCaricatures should better be thrilling (Dzím) * Bùi Quang Ngọc ===Era of Subsidy (1976 - 1985)=== After the Reunification Day, Viet comics' style was more and more un-diversity because the print has been difficult. However, in 1980s there were some Kim-Đồng's artists who started drawed in dó paper because they were very cheap. Topics often be fairytales and war for avoiding the censorship. * Nguyễn Phước Vĩnh Khoa (VINK) * Nguyễn Thị Giang (CINE) * Tạ Thúc Bình * Tạ Lựu * Nguyễn Hữu Thụ ===Era of Reform (1986 - 2006)=== Viet comics have changed much since 1987 as they steadily developed though the years and gradually became similar to American comics with a growing number of comic artists and comic genres. Meanwhile, in response to the needs of children, the government attached special importance in encouraging the creation of comics. The most famous artist was Nguyễn Hùng Lân whose comics were popularly read (Hero Hesman, Vietnamese supermen, Vietnamese fairytales...). The content of these publications was broadly educational and offered lessons in moral philosophy for the reader. Many artists often \"borrowed\" international comics and animated films for imitating, as : Well just you wait, Superman, Jurassic park, Tom and Jerry, Charlot... Everything was to change in 1992 with the import of manga by Kim-Đồng and Youth. Since 1995 when the manga storm would really hit, suddenly Viet comics with educational and moral stories were overwhelmed and dull by comparison. Manga was able to engage with a broad readership and was readily available ; it saturated the market even though most was then illegally printed. That changed in 2004 when Vietnam finally signed an expanded version of the Berne Convention for the Protection of Literary and Artistic Works, and copyright was discussed and respected. The management of sales and content of manga has since become strictly controlled. * Nguyễn Hùng Lân * Nguyễn Hà Bắc * Mai Long * Phạm Minh Trí * Nguyễn Thái Hùng * Vũ Kim Dũng * Trần Minh Tâm * Đào Hải * Mạc Can ===Era of Recession (2007 to now)=== Despite the \"invasion\" (called by 2000s Vietnames newspapers) of manga-manhwa-manhua fighting for a place in the Vietnamese market, 4 the rise of comics in a Vietnamese style was slow to gain pace given lingering prejudices, the feeling that comics were for children. Yet gradually, Vietnamese artists started to produce comics. In 2002, the Phan Thị Company published the comic series titled Vietnamese child prodigies (Thần-đồng đất Việt) and this was a turning point in Viet comics. It attracted many young readers and became a long-selling comic with more than 120 volumes produced. The comic might be considered similar to manga in panel layout and onomatopoeia (the formation of a word from a sound associated with what is named), and the style in which characters are drawn.Rising wave of young potential and passion Moreover, Youth Laughs Monthly, Hoa Học Trò Weekly and Truyện Tranh Trẻ Magazine (Youth Publishing House) also worked positively. They called Viet comics as mạn họa for dream about the comics compared \"triman\" (manga-manhwa-manhua).Can Vietnamese comics win readers' hearts ? * Marcelino TrươngBiographie de Marcelino Truong * Tạ Huy LongWithout comics which about 1930-45 Vietnam * Trần Quang Đức (Vân Trai) * Thiết Kiện * Lê Linh * Bùi Đình Thăng (Thăng Fly) ==References== * A Vietnamese family's refugee story, told through comics * Awakening Luc-van-Tien fairytale after 100 years Category:Arts of Vietnam Category:Comic books",
 "title": "Manhoa"
}