{
 "id": "63707",
 "text": "In any two-party system of politics, a third party is a party other than the two main ones. While the term should be used only when discussing the third largest party, it is often used to describe any smaller party. For example, in the United Kingdom a third party is a national political party other than the Conservative Party and Labour Party that has a presence in the House of Commons. In the United States, a third party is a political party other than the Democratic Party or Republican Party that has national influence. The term \"third parties\" is used in countries with first past the post electoral systems as these systems tend to create a two-party system because successful smaller parties are rare. Countries using proportional representation have less of a tendency to create a two-party system because successful smaller parties are common. In fact, coalitions between the smaller parties are normal in such a country. A party generally needs to have a certain level of success to be called a third party. Smaller parties that only win a small percentage of the vote and no seats in the legislature are often called minor parties or fringe parties. Third parties are not usually likely to win the presidency. Despite this, there are many reasons for third parties to run. In an election, the two main parties listen to the opinions of third parties. The larger parties must respond to these opinions, and sometimes the larger parties copy ideas from third parties. Some third parties also hope that the party can slowly build its support and eventually become one of the dominant parties, as the Labour Party did in Britain. == Notable examples == === United Kingdom === * Alliance Party of Northern Ireland * Democratic Unionist Party * Green Party of England and Wales * Liberal Democrats * Plaid Cymru * Scottish National Party * Sinn Féin * Social Democratic and Labour Party === United States === * Alliance Party * American Independent Party * Communist Party USA * Green Party of the United States * Libertarian Party * Party for Socialism and Liberation * People's Party ==Related pages== *Independent politician ==References== * McGaughey, William (2003). The Independence Party and the Future of Third-Party Politics. Minneapolis: Thistlerose Publications. . Personal odyssey of unsuccessful candidate for U.S. Senate in Minnesota's 2000 Independence Party primary. Category:Political parties",
 "title": "Third party (politics)"
}