{
 "id": "637013",
 "text": "The Chief Justice of the Philippines () is the judge in charge of the Supreme Court of the Philippines. They are the highest ranking judge in the government of the Philippines. The current chief justice is Alexander Gesmundo. He was chosen to be the chief justice by President Rodrigo Duterte in 2021. ==List of chief justices== # Image Chief Justice Term Appointed by Law school 1 Cayetano Arellano June 11, 1901 - April 12, 1920 () William McKinley Republican UST 2 Victorino Mapa July 1, 1920 - October 31, 1921 () Woodrow Wilson Democratic UST 3 Manuel Araullo November 1, 1921 - July 26, 1924 () Warren G. Harding Republican UST 4 Ramón Avanceña April 1, 1925 - December 24, 1941 () Calvin Coolidge Republican UST 5 José Abad Santos December 24, 1941 - May 2, 1942 () Manuel L. Quezon Nacionalista Northwestern 6 José Yulo May 7, 1942 - July 9, 1945 () Masaharu Homma Miliitary UP 7 Manuel Moran July 9, 1945 - March 20, 1951 () Sergio Osmeña Nacionalista Escuela de Derecho 8 Ricardo Paras April 2, 1951 - February 17, 1961 () Elpidio Quirino Liberal UP 9 César Bengzon April 28, 1961 - May 29, 1966 () Carlos P. Garcia Nacionalista UP 10 Roberto Concepcion June 17, 1966 - April 18, 1973 () Ferdinand Marcos UST 11 Querube Makalintal October 21, 1973 - December 22, 1975 () UP 12 Fred Ruiz Castro January 5, 1976 - April 19, 1979 () UP 13 Enrique Fernando July 2, 1979 - July 24, 1985 () KBL UP 14 Felix Makasiar July 25, 1985 - November 19, 1985 () UP 15 Ramon Aquino November 20, 1985 - March 6, 1987 () UP 16 Claudio Teehankee, Sr. April 2, 1987 - April 18, 1988 () Corazon Aquino UNIDO Ateneo 17 Pedro Yap April 19, 1988 - June 30, 1988 (72 days) Independent UP 18 Marcelo Fernan July 1, 1988 - December 6, 1991 (3 years, 158 days) UP 19 Andres Narvasa December 8, 1991 - November 30, 1998 (6 years, 357 days) UST 20 Hilario Davide Jr. November 30, 1998 - December 20, 2005 (7 years, 20 days) Joseph Estrada LAMMP UP 21 Artemio Panganiban December 20, 2005 - December 7, 2006 (351 days) Gloria Macapagal Arroyo Lakas FEU 22 Reynato Puno December 8, 2006 - May 17, 2010 (3 years, 160 days) UP 23 Renato Corona May 17, 2010 - May 29, 2012 (2 years, 12 days) Ateneo – Maria Lourdes Sereno August 25, 2012 - May 11, 2018 (5 years, 259 days) (de facto) Benigno Aquino III Liberal UP 24 Teresita de Castro August 28, 2018 - October 10, 2018 (44 days) Rodrigo Duterte PDP–Laban UP 25 Lucas Bersamin November 26, 2018 - October 18, 2019 (324 days) UE 26 Diosdado Peralta October 23, 2019 - March 27, 2021 (1 year, 155 days) UST 27 Alexander Gesmundo April 5, 2021 - present () Ateneo : José Abad Santos was unable to preside over the Supreme Court due to the outbreak of World War II. : Renato Corona was impeached on December 12, 2011, and convicted on May 29, 2012, removing him from office. : Senior Associate Justice Antonio Carpio served as acting Chief Justice after the Impeachment of Renato Corona from May 30, 2012 to August 25, 2012 and after the removal of Maria Lourdes Sereno via quo warranto proceedings from May 14, 2018 to August 25, 2018. : Maria Lourdes Sereno was removed on May 11, 2018 via quo warranto by a special en banc session; the petition alleged Sereno's appointment was void ab initio due to her failure in complying with the requirements of the Judicial and Bar Council. Hence her entire term as Chief Justice is considered a de facto tenure; legally void since the ouster of her predecessor. Sereno filed an ad cautelam motion for reconsideration pleading for the reversal of the decision on May 31, 2018, but on June 19, 2018 was denied with finality (meaning no further pleading shall be entertained, as well as for the immediate entry for judgment) for lack of merit. Updated daily according to UTC. ==References== *",
 "title": "Chief Justice of the Philippines"
}