{
 "id": "63751",
 "text": "Altuğ Taner Akçam or Tanner Aktscham is a German sociologist and author. Taner Akçam was born in Ardahan, Turkey in 1953. He graduated from the department of administrative sciences of . After 1973, he joined left-wing political groups such as ODTÜ-DER and ADYÖD. In 1975, he was tried for spreading communist and Kurdish nationalist propaganda. He was arrested in 1976 and convicted with 9 years prison sentence. On 12 May 1977, he escaped from the prison and moved to Germany. He lived in Germany between 1978 and 1995. He received his PhD in 1995 at . After he became a professor, Akçam worked in and in United States. Akçam is known for his research on the Armenian—Turkish history of 1915. His work is funded by the , a think-tank that serves Armenian Revolutionary Federation. Taner Akçam uses old Turkish documents in his books but critics state that he cannot read Ottoman Turkish. ==Research== Taner Akçam worked on the history of Ottoman Armenians. He researched and 1919 Istanbul trials. According to him, what happened to Armenians meets the legal definition of genocide. However, he ignores that many Turks died during First World War. Therefore, his research shows pro-Armenian bias. Akçam worked in the Ottoman archives and found many documents. However, experts showed that he wrongly translated some documents and that some other documents were fake. Examples of those documents are the Andonian documents,Lütem, Ömer Engin and Yiğit Alpogan. “Review Essay: Killing Orders: Talat Pasha’s Telegrams and the Armenian Genocide.” Review of Armenian Studies, Issue 37 (2018). the memoirs of Sarkis Torosyan, a telegram from Talat Pasha, and the court documents of 1919. === The telegraph from Talat Pasha === In his 2011 book, The Young Turks' Crimes Against Humanity, Taner Akçam cited a telegraph from Talat Pasha. In the telegraph dated 29 August 1915, Talat Pasha stated that \"The Armenian issue in Eastern provinces has been resolved.\" Akçam claimed that this proved the \"genocidal intent\" of the Ottoman government. However, Akçam cited only the first two sentences of the telegraph. The full text shows the government ordered the protection of Armenians. Taner Akçam's falsification had been revealed in three different publications. Akçam did not reply to the allegations of academic dishonesty. === Memoirs of Sarkis Torossian === Between 2013 and 2017, Taner Akçam published disputed articles about the memoirs of Sarkis Torosyan. Ayhan Aktar, a Turkish academician, published in Turkish the memoirs of Sarkis Torossian in 2012. The memoir is about the story of an Ottoman Armenian soldier. In the story, the soldier fights for the Ottoman Empire during First World War. He is brilliant and earns a military reward. However, he changes sides when his family is killed by the government. Historians Halil Berktay and Hakan Erdem found factual and logical mistakes in the book. They concluded that the story was fake. But their research was published in Turkish. People, who lived outside Turkey, couldn't read them. Taner Akçam and Ayhan Aktar falsely told the Western press that the memoirs were true. They also falsely claimed that Turkish people denied the memoirs because of political and racist reasons. After that, historian Edhem Eldem published an article that criticized Taner Akçam for his dishonesty. ==References== Category:Turkish writers Category:1953 births Category:Living people Category:Turkish historians Category:Turkish scientists",
 "title": "Taner Akçam"
}