{
 "id": "637636",
 "text": "Dimitrij Ovtcharov (; born 2 September 1988 in Kyiv) is a German table tennis player, who comes from Ukraine. == Career == His parents were Sovetian National players, so they trained Dima in his childhood. 2005 he got into the Bundesleague. His best moment came first at the Olympics 2008 in Beijing, in the singles he lost very early but with the German team he came to the final, were they lost to China. But in thiy year he won for the first time the European Championships. At the World Championships (this was the first of him) Ovtcharov reached the Round of 16, where he met his teammate Timo Boll, so he lost to him. At the German National Championships he lost very just to Bastian Steger. Also he won the Brazilian Open, where Dima doesn't give up a set. 2012 he took part in the Olympic Games again, where he won with the team bronze. He lost his match against Ma Long. In the singles Ovtcharov beat Michael Maze in the Quarterfinals, in the 3rd place match he met Chuang Chih-Yuan an beat him. At the European Championships he lost in the singles in the Quarterfinals but won together with Wladimir Samsonow the bronzemedal. In this year he was voted as the player of the year. 2013 he took part in the World Championships but lost again- this time in the Round of 16. In this year he became for the first time European Champion and won the third place at the World Cup- in the match he beat Timo Boll. At March 2014 he became German Champion, at the WTTTC they won after 2010 and 2012 for the third time the silvermedal. 2015 Ovtcharov took part in the WTTC, where he lost again- this time in the second round already. At the European Championships he won silver with the team and the goldmedal at the Europe Games in the singles. 2016 he took part in the Olympics, where he met the Quarterfinals, there he lost to Wladimir Samsonow despite a 2:0 leading. The World Cup and the European Championships ending very early, too. This was not a good year of Ovtcharov, because his grandmother ia death and had to spend lots of time of his child. 2017 he won the Europe-Top three times. 2018 lost early at the German Open, but won the World Team Cup and the 2nd place at te WTTTC with th team. == Results == === Singles === * Olympic Games: Bronze 2012 * European Games: Gold 2015 * European Championships: Gold 2013, 2015, Bronze 2007 * World Cup: Gold 2017, 3rd place 2013, 2015 * German Natonal Championships: Gold 2014, 2nd place 2007, 2011, 2012 * Bundesranking- Tournament: Gold 2007 === Doubles === * European Championships: Bronze 2012 * German National Championships: 2008, 2010 === Team === * Olympic Games: Bronze 2012, 2016 * World Championships: Silver 2010, 2012, 2014, 2018 == Family == His parents were Russian, so he speaks Ukrainian, Russian and German. == References == Category:1988 births Category:Living people Category:German table tennis players Category:Sportspeople from Kyiv Category:Competitors at the 2016 Summer Olympics Category:Competitors at the 2012 Summer Olympics",
 "title": "Dimitrij Ovtcharov"
}