{
 "id": "637787",
 "text": "A bus is a large wheeled vehicle meant to carry many passengers along with the driver. It is larger than a car or van. but fewer than the average rail transport. It is most commonly used in public transport, but is also in use for charter purposes, or through private ownership and are all built on a truck chassis or a truck chassis with a cab. Although the average bus carries between 30 and 100 passengers, some buses have a capacity of up to 300 passengers. The most common type is the single-deck rigid bus, with double- decker and articulated buses carrying larger loads, and midibuses and minibuses carrying smaller loads. Coaches are used for longer-distance services. Many types of buses, such as city transit buses and inter-city coaches, charge a fare. Other types, such as elementary or secondary school buses or shuttle buses within a post-secondary education campus, are free. In many jurisdictions, bus drivers require a special large vehicle licence above and beyond a regular driving license. There are many types of bus around the world. == Types of buses == === Coach / Motor coach === * Coach / Motor coach - A bus that is used for driving long distances with as much comfort as possible and more room. It has fewer doors than a city bus. === School bus === * School bus - A bus that takes people to their school. In America, school buses are yellow while in other countries they may be different. ===Shuttle bus === * Shuttle bus - A bus that drives between places without many stops. It is often used for sport events and other places where lots of people meet, and at airports. ===Minibus === * Minibus - A bus that is smaller than normal buses. It can carry about 8 to 25 people. ===Minicoach === * Minicoach - A luxury bus that is smaller than normal buses. It can carry about 8 to 25 people. ===Double-decker bus === * Double-decker bus - A bus that has two floors (decks). It can carry about 70 people. Some buses have doors in the middle and back and some buses only have doors at the front. Double decker buses are mainly found in the United Kingdom. ===Single-decker bus === * Single-decker bus - A bus that has one floor. It can carry about 30 people. Some buses have doors in the middle and back and some buses only have doors at the front. This type of bus is mainly found in cities world-wide. ===Low-floor bus === * Low-floor bus - A bus that is nearer the ground than other buses so you can get in and out more easily. This type is often used in cities. The floor may get lower when the bus stops and higher when it moves. ===Step- entrance bus === * Step-entrance bus or high-floor bus - A bus that has steps at the front. The floor does not move up or down from the ground. ===Trolleybus === * Trolleybus - A bus that gets its energy from electric cables above the street, not from petroleum fuel. ===Articulated bus === * Articulated bus - A bus that can bend in the middle so that it can be long and still move in small streets. ====Bi-articulated bus ==== * Bi-articulated bus - A bus that can bend in 2 places so that it can be long and still move in small streets. ===Guided bus === * Guided bus - A bus that is guided on rails like a train but is used on normal streets. Often it can also be used like a normal bus. ===Neighbourhood bus === * Neighbourhood bus - It is like a school bus or a taxi, It goes around small streets. ===Training bus === * Training bus - A bus that is used for new drivers to practice with. It might not be safe for passengers and might have been changed so a teacher can easily help the new driver. ===Gyrobus === * Gyrobus - A special bus which does not use a normal engine. It has a big flywheel of steel or other materials (weighing about one ton) rotating at very high speed (RPM). By rotating at such high speed, the flywheel stores large amounts of kinetic energy. This big wheel moves the wheels of the bus. At special stations, electric engines accelerate the flywheel so the bus can still run. There are not many buses of this kind because they are very expensive. ===Hybrid bus === * Hybrid bus - A bus that has two engines, for example a fuel engine and an electric engine. ===Police bus === * Police bus - A bus or coach that is used by the police to transport a large number of policemen. These are used for crowd control, sports events, political gatherings, demonstrations and riots. ===Offroad bus === * Offroad bus - A bus that is made to be used beyond normal roads, often used by the Army. ===Open top bus === An open top bus is a double-decker or single-decker bus, which has been built without a roof or has had the roof removed. Some open top buses have half a roof at the front and some do not have one at all. Open top buses are usually used on tourist and sightseeing services. It is mainly found in tourist centres such as New York City, Hong Kong and United Kingdom. ==References== ==Other websites==",
 "title": "Types of buses"
}