{
 "id": "637831",
 "text": "The 2019–20 UEFA Champions League was the 65th season of Europe's premier club football tournament organised by UEFA, and the 28th season since it was renamed from the European Champion Clubs' Cup to the UEFA Champions League. The final was planned to be played at the Atatürk Olympic Stadium in Istanbul, Turkey. However, due to COVID-19 pandemic in Europe, the competition was suspended on 13 March 2020, and resume on August and final-tournament to be held at the Estádio da Luz, Lisbon, Portugal. The winners of the 2019–20 UEFA Champions League will earn the right to play against the winners of the 2019–20 UEFA Europa League in the 2020 UEFA Super Cup. They will also automatically qualify for the 2020–21 UEFA Champions League group stage, and if they have already qualified through their league performance, the berth reserved will be given to the champions of the 11th-ranked association according to next season's access list. ==Teams== Group stage Group stage Group stage Group stage Play-off round Play-off round Play-off round Play-off round Third qualifying round Third qualifying round Third qualifying round Third qualifying round Second qualifying round Second qualifying round Second qualifying round Second qualifying round First qualifying round First qualifying round First qualifying round First qualifying round Preliminary round Preliminary round Preliminary round Preliminary round ==Effects of the COVID-19 pandemic== The round of 16 ties were to be played across four weeks, with the first legs being played across two weeks in February and the second legs across two weeks in March. Because of this, the first leg ties were unaffected by the pandemic, but the second leg ties were affected in different ways. All of the four matches in the first week of fixtures went ahead but due to the increased severity of the COVID-19 pandemic in Spain and France, Valencia's and PSG's home games were played behind closed doors. On 15 March, UEFA announced a halt to the competition meaning that the remaining second leg games would be postponed indefinitely. A taskforce was convened to reschedule the rest of the season. On 23 March, it was announced that the Atatürk Olympic Stadium in Istanbul, Turkey would no longer host the competition final, originally scheduled for 30 May, but would host the 2021 final instead. This was later cancelled and replaced to 2023 Copa Libertadores final. On 17 June, it was announced that the Champions League would return on 7 August and conclude on 23 August, with the rest of the tournament to be held in Portugal, with the exception of the four unplayed round of 16 second legs, which would be played at their original venues. The last 8 of the competition would be played as a mini tournament, with the remaining fixtures to be played as single-legged ties. All remaining ties of the competition were played behind closed doors due to the remaining presence of the COVID-19 pandemic in Europe. ===Final tournament venues=== Lisbon Lisbon Estádio da Luz (final venue) Estádio José Alvalade Capacity: 64,642 Capacity: 50,095 ==References== ==Other websites== *UEFA Champions League (official website) 2019-20",
 "title": "2019–20 UEFA Champions League"
}