{
 "id": "637935",
 "text": "Zendaya Maree Stoermer Coleman (; born September 1, 1996) also known as nya, is an American actress, model and singer. She started her career as a child model and backup dancer. == Career == She gained popularity for her role as Rocky Blue on the Disney Channel sitcom Shake It Up (2010–2013). In 2013, Zendaya was a contestant on the sixteenth season of the competition series Dancing with the Stars. From 2015 to 2018, she produced and acted as K.C. Cooper in the sitcom K.C. Undercover. In 2019, she started playing the main role in the HBO drama series Euphoria. Her performance as a teenage drug addict made her the youngest winner of the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series. Her movie roles as supporting parts in the musical drama The Greatest Showman (2017) and the superhero movie Spider-Man: Homecoming (2017) and its sequel, Spider-Man: Far from Home (2019). === Music === In 2011, she released the singles \"Swag It Out\" and \"Watch Me\", the latter a collaboration with Bella Thorne. She signed with Hollywood Records in 2012. Her eponymous debut studio album (2013) was released to moderate success. The album's lead single, \"Replay\", reached the top 40 on the U.S. Billboard Hot 100 chart. Zendaya's biggest success as a musician came with her Zac Efron collaboration, \"Rewrite the Stars\", from The Greatest Showman in 2017. The single reached within the top 20 of several record charts and has received multi-platinum sales certifications globally. Zendaya has also written and performed several songs for Euphoria. == Personal life == Zendaya Maree Stoermer Coleman was born on September 1, 1996, in Oakland, California. Zendaya’s father, Kazembe Ajamu Coleman, who was born Samuel David Coleman, is Black American and originally from Arkansas. He is a descendant of sharecroppers. Her father took a DNA ancestry test and discovered he had some genetic ancestry from Nigeria, Macedonia, and Iceland. This discovery led him to change his birth name to what it is today. Her mother, Claire Stoermer has German and Scottish ancestry. Her name means \"to give thanks\" in Shona and she has five siblings. Zendaya lives in Los Angeles. She is vegetarian. She is currently dating with Spider-Man: Homecoming co-star Tom Holland. ==Filmography== ===Film=== Year Title Role Notes 2013 Super Buddies Lollipop (voice) Direct-to-DVD 2016 Lemonade Herself Visual album 2017 Spider-Man: Homecoming Michelle Anne Wheeler 2018 Duck Duck Goose Chi (voice) Smallfoot Meechee (voice) 2019 Spider-Man: Far from Home MJ 2021 Malcolm & Marie Marie Also executive producer Space Jam: A New Legacy Lola Bunny (voice) Dune Chani Spider-Man: No Way Home MJ 2022 Is That Black Enough for You?!? Herself Documentary 2024 Dune: Part Two Chani Challengers Tashi Duncan Also producer 2026 Filming Felicia (voice) In production TBA Post-production ===Television=== Year Title Role Notes 2010–2013 Shake It Up Rocky Blue Co-lead role 2011 Good Luck Charlie Rocky Blue Episode: \"Charlie Shakes It Up\" PrankStars Herself Episode: \"Walk the Prank\" Pixie Hollow Games Fern (voice) Television special 2012 A.N.T. Farm Sequoia Jones Episode: \"Creative consultANT\" Frenemies Halley Brandon Television film 2013 Dancing with the Stars Herself Contestant (season 16), and runner-up The Story of Zendaya Herself Television series 2014 Zapped Zoey Stevens Television film The Making of SWAY Herself Television dancing-preparation show; 8 episodes SWAY: A Dance Trilogy Herself Television dance show 2015–2018 K.C. Undercover K.C. Cooper Lead role; also co-producer 2015 Black-ish Rasheida Episode: \"Daddy's Day\" 2016 America's Next Top Model Herself Episode: \"Lights, Camera, Catwalk\" 2017 Walk the Prank Herself Episode: \"K.C. Undercover Edition\" Lip Sync Battle Herself Episode: \"Tom Holland vs. Zendaya\" 2019 The OA Fola 3 episodes 2019–present Euphoria Rue Bennett Main role; also executive producer (specials and season 2–present) === Web === Year Title Role Note 2021 Fortnite Winterfest Trailer - Featuring Spider-Man MJ (voice) ===Music videos=== ====As lead artist==== Title Year Director \"Watch Me\" 2011 Lipo Chang \"Dig Down Deeper\" \"Swag It Out\" Glenn A. Foster \"Something to Dance For / TTYLXOX Mash-Up\" 2012 Sanaa Hamri \"Fashion Is My Kryptonite\" Marc Klasfeld \"Contagious Love\" 2013 \"Replay\" Colin Tilley \"My Baby\" 2014 Stephen Garnett \"My Baby\" \"Safe and Sound\" rowspan=\"2\" \"All of Me\" \"Neverland\" 2016 Brad Furman ====As featured artist==== Title Year Main artist(s) Director(s) \"My Jam\" 2015 Bobby Brackins, Jeremih Damien Sandoval ==== As guest appearance ==== Title Year Artist Director \"Hot n Cold\" 2009 Kidz Bop Kids \"Like We Grown\" 2013 Trevor Jackson Mike Ho \"Bad Blood\" 2015 Taylor Swift Joseph Kahn \"All Night\" 2016 Beyoncé Beyoncé \"Versace on the Floor\" 2017 Bruno Mars Cameron Duddy and Bruno Mars ==Discography== * Zendaya (2013) ==Concert tours== * Swag It Out Tour (2012–2014) ;Opening act * Summer Tour (2014) ==Awards and recognition== == Notes == ==References== == Other websites == * * Category:1996 births Category:Living people Category:African-American actors Category:American child singers Category:Actors from Oakland, California Category:American child actors Category:American movie actors Category:American pop musicians Category:American R&B; singers Category:American television actors Category:Emmy Award winning actors Category:American video game actors",
 "title": "Zendaya"
}