{
 "id": "637944",
 "text": "The White Army during the Russian Revolution was an alliance of various groups that opposed the Red Army of Vladimir Lenin's Bolsheviks during the Russian Civil War. White Army supporters included liberals, aristocrats, Cossacks, the Russian Orthodox Church, and some peasants. Eventually, the enemies of the Bolsheviks sent ships and troops to help the White Army. They fought against the Red Army of Soviet Russia. In Soviet propaganda, White generals were often made fun of. They were often accused of secretly working against Russia or being bribed by the rich governments of Britain, France, and the United States. The Russian Army during the Provisional Government period had a standard structure, but each unit had its own unique features. The White Army's military tactics were influenced by First World War experiences, which significantly shaped the nature of the Russian Civil War. == History == The name \"White\" refers to the supporters of the pre-revolutionary order, dating back to the French Revolution. This contrasts with the \"Red Guard\" and the Red Army. The term \"White Guard\" was first used in Russia for Finnish police units formed in 1906 to combat the revolutionary movement, whose members wore white bandages on their sleeves. However, this usage did not directly connect to the White Army during the Russian Civil War. The White Armies were made up of many different groups who operated independently. They did not have the same beliefs or goals. The leaders were mostly conservative or moderate generals and politicians, each with their own ideas and plans. Most of these armies did not work together very well. Each group had its own way of organizing, with members ranging from experienced veterans of World War I to new volunteers. The White Guards fought against the Reds and the Makhnovtsi, and they also took part in the White Terror. This meant they helped carry out mass executions, including working with foreign soldiers. For example, in 1919, 257 civilians were killed in the village of Ivanovka during a fight involving the Japanese Army and the White Guards against pro-Bolshevik groups. While many people were killed during the White Terror, the number was much lower than those killed during the Bolshevik Red Terror, which was organized and controlled by Bolshevik leaders. === Volunteer and Don Army === After the October Revolution, some generals, including Lavr Kornilov and Anton Denikin, were let go by their leader, Nikolay Dukhonin, before he was killed by a mob. They then went to the Don region to meet Ataman Alexey Kaledin. The people in the Don area decided to stop following the Soviet government and declared themselves independent until a new government was formed that everyone agreed on. The first White Army was started by Mikhail Alekseyev, and he called it the \"Alekseyev Organization.\" People could join as volunteers. From this group, a Volunteer Army was formed, and two important generals, Alexey Kaledin and Lavr Kornilov, joined them. In April 1918, a new group called the Don Army was created. Later, in May, the Drozdov brigade, which had been fighting in Romania, joined the Volunteer Army. Some well-known people also came to the Don region. Boris Savinkov, who used to lead a group that fought for the Socialist Revolutionary cause, was there. He helped organize the Union for the Defense of the Motherland and Freedom with the Volunteer Army, but many military leaders and Cossacks didn't like him being there. One of the first members of the Alekseyev Organization was Vasily Shulgin, who later worked with Denikin in a special meeting. ==References== Category:Russian Revolution",
 "title": "White Army"
}