{
 "id": "637923",
 "text": "The Abel Prize () is a Norwegian prize awarded every year by the Government of Norway to one or more outstanding mathematicians. It is named after Norwegian mathematician Niels Henrik Abel (1802–1829) and modelled after the Nobel Prizes, the award was established in 2001 by the Government of Norway and complements its sister prize in the humanities, the Holberg Prize. It comes with a monetary award of 6 million Norwegian kroner (NOK) (around €650,000). ==Winners== Year Laureate(s) Image Institution(s) Citation 2003 Collège de France \"For playing a key role in shaping the modern form of many parts of mathematics, including topology, algebraic geometry and number theory.\" 2004 University of Edinburgh University of Cambridge \"For their discovery and proof of the index theorem, bringing together topology, geometry and analysis, and their outstanding role in building new bridges between mathematics and theoretical physics.\" Massachusetts Institute of Technology University of California, Berkeley 2005 Courant Institute \"For his groundbreaking contributions to the theory and application of partial differential equations and to the computation of their solutions.\" 2006 Royal Institute of Technology \"For his profound and seminal contributions to harmonic analysis and the theory of smooth dynamical systems.\" 2007 Courant Institute \"For his fundamental contributions to probability theory and in particular for creating a unified theory of large deviation.\" 2008 University of Florida \"For their profound achievements in algebra and in particular for shaping modern group theory.\" Collège de France 2009 Institut des hautes études scientifiques and Courant Institute \"For his revolutionary contributions to geometry.\" 2010 University of Texas at Austin \"For his vast and lasting impact on the theory of numbers.\" 2011 Stony Brook University \"For pioneering discoveries in topology, geometry, and algebra.\" 2012 Alfréd Rényi Institute and Rutgers University \"For his fundamental contributions to discrete mathematics and theoretical computer science, and in recognition of the profound and lasting impact of these contributions on additive number theory and ergodic theory.\" 2013 Institute for Advanced Study \"For seminal contributions to algebraic geometry and for their transformative impact on number theory, representation theory, and related fields.\" 2014 Princeton University and Landau Institute for Theoretical Physics \"For his fundamental contributions to dynamical systems, ergodic theory, and mathematical physics.\" 2015 Princeton University \"For striking and seminal contributions to the theory of nonlinear partial differential equations and its applications to geometric analysis.\" Courant Institute 2016 University of Oxford \"For his stunning proof of Fermat's Last Theorem by way of the modularity conjecture for semistable elliptic curves, opening a new era in number theory.\" 2017 École normale supérieure Paris-Saclay \"For his pivotal role in the development of the mathematical theory of wavelets.\" 2018 Institute for Advanced Study \"For his visionary program connecting representation theory to number theory.\" 2019 University of Texas at Austin \"For her pioneering achievements in geometric partial differential equations, gauge theory and integrable systems, and for the fundamental impact of her work on analysis, geometry and mathematical physics.\" 2020 Hebrew University of Jerusalem \"For pioneering the use of methods from probability and dynamics in group theory, number theory and combinatorics.\" Yale University 2021 Eötvös Loránd University \"For their foundational contributions to theoretical computer science and discrete mathematics, and their leading role in shaping them into central fields of modern mathematics\". Institute for Advanced Study 2022 Stony Brook University \"For his groundbreaking contributions to topology in its broadest sense, and in particular its algebraic, geometric and dynamical aspects.\" 2023 University of Texas at Austin \"For his seminal contributions to regularity theory for nonlinear partial differential equations including free-boundary problems and the Monge–Ampère equation.\" 2024 Centre national de la recherche scientifique \"For his groundbreaking contributions to probability theory and functional analysis, with outstanding applications in mathematical physics and statistics.\" ==References==",
 "title": "Abel Prize"
}