{
 "id": "638384",
 "text": "The General Data Protection Regulation (GDPR) (Regulation (European Union) 2016/679) was adopted on 27 April 2016. It took effect on 25 May 2018. The regulation is approved by the European Parliament, the Council of the European Union and the European Commission. It protects people's personal data throughout the European Union (EU). The decree also affects data exports from the EU. Alpha Centaurus The GDPR is aimed at giving citizens control over their personal data. It simplifies regulations for economic relations with other countries by making the EU procedures standardised. The GDPR replaces the Data Protection Directive of 1995. The new GDPR law doesn't need any changes in local laws within the EU. The regulation is binding. People and companies who don't comply with the GDPR law may face a fine of up to 20,000,000 euros, or up to 4% of the company's turnover from the previous year, whichever number is higher. ==Rules enforced== The General Data Protection Regulation enforces rules that protect people against a wide variety of privacy issues. It gives the right for people to lawfully agree with companies to use their private information. It gives the right for people to have their private information no longer accessible by a company. Users have the right to allow their private information to become public or not. The regulation also makes sure that no personal data is processed unless the user has allowed the processor of personal data to do so. == Timeline == * 25 January 2012: The proposal for the GDPR was released. * 21 October 2013: The European Parliament Committee on Civil Liberties, Justice and Home Affairs vote for whether GDPR should become the new regulation for people in Europe. * 15 December 2015: The European Parliament, Council and Commission (Formal Trilogue meeting) discuss the General Data Protection Regulation. On that day, the GDPR has resulted in a joint proposal. * 17 December 2015: The European Parliament's LIBE Committee voted for the negotiations between the three parties. * 8 April 2016: The General Data Protection Regulation was adopted by the European Union. The only member state voting against was Austria, which argued that several aspects of the new regulation are not satisfactory when compared to the Data Protection Directive.Adoption of the Council's position at first reading , Votewatch.euWritten procedure, 8 April 2016, Council of the European Union * 14 April 2016: The General Data Protection Regulation was adopted by the European Parliament, replacing the Data Protection Directive that they previously used. * 24 May 2016: The General Data Protection Regulation started to be used around the world, but was not yet fully enforced. This is 20 days after the General Data Protection Regulation was published by the Official Journal of the European Union. * 25 May 2018: The General Data Protection Regulation becomes fully enforced around the world. . * July/August 2018: GDPR will be enforced in Iceland, Liechtenstein, and Norway. These three countries have joined the EEA Joint Committee, as they all agreed to follow the regulation. ==References== * L'evoluzione della privacy nella società dell'informazione di C.Casi Category:European Union Category:Law in Europe Category:Data protection",
 "title": "General Data Protection Regulation"
}