{
 "id": "638349",
 "text": "Timo Boll (born March 8, 1981 in Erbach) is a German table tennis player. He is the best German table tennis player and is in China one of the most popular table tennis players in the history. He is a lefthanded-player and uses the Shakehand-grip. At the World Championships 2011 in Rotterdam Boll won a bronze medal in the singles. He is a wonder in the table tennis world and got 11 times the German National Championships. == Sporting career == === Young years (1981-1997) === Timo began to play table tennis at the age of four with his father in their old cellar. His father bought an table tennis table. His talent was quickly spotted. With seven years Timo Boll was discovered from the Hessian National coach Helmut Hampl who promoted him. He also trained in the Table tennis centre Pfungstadt. 1995 at age 14 he was strong enough to play in the \"Oberliga\" with the adults even though only being at position 5 in the team. To daily train with him, the team moved to his homeplace. In that year (1995) he took part in the European Youth Championships in Den Haag, where Timo won three Gold medals. In 1997 Boll played his first game for the national team against Poland where he was matched with Piotr Skierski and Lucjan Bļaszczyk, and won both matches. He ends his school education with graduation from \"Realschule\" / Mittlere Reife. === Career as a pro-player (2002-2012) === 2002 Boll took part in the Europe-Top-16, where he won the singles category. By doing so he also overtook the at that time best German table tennis player Jörg Rosskopf, meaning he became the best German table tennis player himself. At the European Championships 2002, he won gold in the singles and doubles, the German team lost in the final to Sweden. With winning at the World Cup 2002 in Jinan, he became no. one in the world. At the European Championships 2003, Timo Boll lost already in the 2nd round against Vladimir Samsonov- of course this also meant that he lost the 1st place in the world ranking again. 2004 he had very strong back problems- that wasn't good for preparing to the Olympics, but he took part in that. In a strong play against Jan-Ove Waldner he lost in the Quarterfinals against him. Before that, he beat Werner Schlager in the Round of 16. 2005 Boll reached the silver medal at the World Championships in the doubles with Christian Süss- but in the singles he didn't win a medal. He also won the gold medal at the World Cup again. 2006 he won the Europe-Top-16 again. In this year he played in the Chinese Superleague. For the season 2007/2008 he transferred from TTV Gönnern where he had played since his youth to the club of Borussia Düsseldorf. 2007 he won the European Championship singles, doubles, and in the team competition. He also played in the Chinese Superleague . 2008 at the Olympic Games 2008 together with the national team he reached the final after beating the teams of Croatia, Australia and Japan. In the final the German team lost to China. In the singles he missed narrowly missed a medal. 2008 and 2009 he didn't participate in the World championships. However at the World Cup in Belgium he won the silver medal. Because of these performances, he became the world number one again. 2010 at the World Championships 2010 in Moscow Timo and the German team won the silver medal again. The German selection only lost to China. 2011 Boll took part in the World Championships again and won the bronze medal, after strong play against the top-player Chen Qi. Before he lost the semifinal against Zhang Jike. In the same year he won the Volkswagen Cup. At the Olympic Games 2012 in London he won team bronze, again after losing China in the semifinal, but Timo won his match against Zhang Jike. However in the singles he didn't win a medal. Boll also took part in the World Cup, where he won for the first time the silver medal, after losing to Ma Long in an strong final. He also won his 6th European Championships title. === More achievements (2013-2018) === 2013 he took part in his 5th World Championships in Paris. He doesn't won a medal for the second time- in the Quarterfinals he lost to Ma Long. The World Cup 2014 he finished with the 3rd place. At the World Championships 2014 he won silver with the team again, after losing China again. Because of playing very inactive he fell back to place 10 in the world ranking system. 2015 he became for the 10th time German champion and took part in the World Championships in Suzhou, China. In the singles he lost in the Quarterfinals to a Chinese top-player, again- this time Fan Zhendong. In the doubles Boll played for the first time with Ma Long, but they had bad luck with the playing- already in the 2nd round they met the duo Fan Zhendong and Xu Xin. In that year he doesn't played another events. In 2016 he took part in the Olympics, where Timo won bronze with the team again (after London 2012), in the singles he lost already again, against Quadri Aruna. At the European Championships he doesn't played around the title, but reached the semifinal and got so bronze. Because of inactive the last months, he got on place 12 in the world rankings. At the Europe-Top-16 he got the 5th place. 2017 he won for the 11th time the German National Championships, he also took part in the WTTC (World Championships), where he reached the Quarterfinals in the singles, his opponent was Ma Long again. In the doubles, where he took part with Ma Long again, they reached the 2nd round, again. At the China Open he won silver. In 2018 he won the silver medal at the WTTC again. == Results == === World championships === * 2010, 2012, 2014, 2018- Team silver * 2011- Singles bronze * 2013, 2015, 2017- Singles quarterfinals === Olympic games === * 2008- Team silver * 2012, 2016- Team bronze * 2004, 2008- Singles quarterfinals ==== World Cup ==== * 2002, 2005- Gold * 2011, 2012, 2017- Silver * 2014- Bronze == Technique and playing style == Boll is an lefthanded-player and attacker. He uses on both sides of his table tennis racket the Butterfly Tenergy 05. Strengthen: Topspin with lots of swerve, blocking Weaknesses: Defensive, Backhand (Power)- Topspin == Sources or References == Category:Living people Category:1981 births Category:German table tennis players Category:Sportspeople from Düsseldorf Category:Olympic bronze medalists for Germany Category:Olympic silver medalists for Germany",
 "title": "Timo Boll"
}