{
 "id": "63839",
 "text": "Melodifestivalen (translated as the \"Melody Festival\") is a Swedish annual music competition held to decide Sweden's song and performer at the Eurovision Song Contest. It is organised by Sveriges Television (SVT) and Sveriges Radio (SR). == History == It has been staged under various formats almost every year since Sweden first participated in the Eurovision Song Contest in 1958. The first year, no TV or radio broadcasted event was held, but in 1959, the first public competition was held. The competition is the most popular television programme in Sweden, a title it has held since 2000, at times eclipsing even Eurovision itself. In 2007, an estimated four million Swedes—almost 44% of the country's population—watched the final, while the semifinals averaged around 3.1 million viewers. The winner is chosen by a number of regional juries and a national televote. Until 2001 the competition was normally limited to between eight and twelve songs (in 1981, only five songs), but since the introduction of semifinals in 2002 that number has risen to thirty-two. The Melodifestival has produced five Eurovision-winning songs and fifteen placings in the top five for Sweden at the Contest. The event is often seen as being dominated by light orchestrated pop songs, known locally as Schlager. music—so much so that it is sometimes referred to as \"Schlagerfestivalen\" (the \"Schlager Festival\") or \"Schlager-SM\" (\"Swedish schlager championship\") by the Swedish media but other styles of music such as rap, reggae and glam rock have made an appearance since the competition's expansion. The competition makes a significant impact on music charts in Sweden; twenty-three participants reached the domestic singles chart in 2006 and twenty-one in 2007. There would have been more people taking part, but Agnes Carlsson was disqualified because she discussed her song in an interview with the Aftonblad newspaper. == Format == Created in 1958, Melodifestivalen has been the competition which all but one of the Swedish Eurovision entries had to go through. There are typically four \"heats\" of around seven entries each. From each heat, the two most voted- for entries go through to the final while the 3rd and 4th placed entries from each heat go to the \"Second Chance Round\". From this round, four more finalists are chosen. In 2022, the second-chance round was replaced with a semi-final where the eight winners of the heats were taken down to four finalists. In 2024, the semi-final will be scrapped and a new fifth heat will be added. == Winners == There have been fifty-six winners of Melodifestivalen. Year Artist Song Result (in Eurovision) 1959 Siw Malmkvist \"Augustin\" 9th (performed by Brita Borg) 1960 Östen Warnerbring & Inger Berggren \"Alla andra får varann\" 10th (performed by Siw Malmkvist) 1961 Siw Malmkvist & Gunnar Wiklund \"April, april\" 14th (performed by Lill-Babs) 1962 Inger Berggren & Lily Berglund \"Sol och vår\" 7th 1963 Monica Zetterlund & Carli Tornehave \"En gång i Stockholm\" 13th 1966 Lill Lindfors & Svante Thuresson \"Nygammal vals\" 2nd 1967 Östen Warnerbring \"Som en dröm\" 8th 1968 Claes-Göran Hederström \"Det börjar verka kärlek, banne mig\" 5th 1969 Tommy Körberg \"Judy, min vän\" 9th 1971 Family Four \"Vita vidder\" 6th 1972 \"Härliga sommardag\" 13th 1973 Malta \"Sommaren som aldrig säger nej\" 5th (as \"You're Summer\") 1974 ABBA \"Waterloo\" 1st 1975 Lasse Berghagen \"Jennie, Jennie\" 8th 1977 Forbes \"Beatles\" 18th 1978 Björn Skifs \"Det blir alltid värre framåt natten\" 14th 1979 Ted Gärdestad \"Satellit\" 17th 1980 Tomas Ledin \"Just nu!\" 10th 1981 Björn Skifs \"Fångad i en dröm\" 10th 1982 Chips \"Dag efter dag\" 8th 1983 Carola Häggkvist \"Främling\" 3rd 1984 Herreys \"Diggi-Loo Diggi-Ley\" 1st 1985 Kikki Danielsson \"Bra vibrationer\" 3rd 1986 Lasse Holm & Monica Törnell \"E' de' det här du kallar kärlek?\" 5th 1987 Lotta Engberg \"Fyra bugg och en Coca Cola\" 12th (as \"Boogaloo\") 1988 Tommy Körberg \"Stad i ljus\" 12th 1989 Tommy Nilsson \"En dag\" 4th 1990 Edin- Ådahl \"Som en vind\" 16th 1991 Carola Häggkvist \"Fångad av en stormvind\" 1st 1992 Christer Björkman \"I morgon är en annan dag\" 22nd 1993 Arvingarna \"Eloise\" 7th 1994 Roger Pontare & Marie Bergman \"Stjärnorna\" 13th 1995 Jan Johansen \"Se på mig\" 3rd 1996 One More Time \"Den vilda\" 3rd 1997 Blond \"Bara hon älskar mig\" 14th 1998 Jill Johnson \"Kärleken är\" 10th 1999 Charlotte Nilsson \"Tusen och en natt\" 1st (as \"Take Me to Your Heaven\") 2000 Roger Pontare \"När vindarna viskar mitt namn\" 7th (as \"When Spirits Are Calling My Name\") 2001 Friends \"Lyssna till ditt hjärta\" 5th (as \"Listen To Your Heartbeat\") 2002 Afro-Dite \"Never Let It Go\" 8th 2003 Fame \"Give Me Your Love\" 5th 2004 Lena Philipsson \"Det gör ont\" 5th (as \"It Hurts\") 2005 Martin Stenmarck \"Las Vegas\" 19th 2006 Carola \"Evighet\" 5th (as \"Invincible\") 2007 The Ark \"The Worrying Kind\" 18th 2008 Charlotte Perrelli \"Hero\" 18th 2009 Malena Ernman \"La Voix\" 21st 2010 Anna Bergendahl \"This Is My Life\" 26th (eliminated in semi-finals) 2011 Eric Saade \"Popular\" 3rd 2012 Loreen \"Euphoria\" 1st 2013 Robin Stjernberg \"You\" 14th 2014 Sanna Nielsen \"Undo\" 3rd 2015 Måns Zelmerlöw \"Heroes\" 1st 2016 Frans \"If I Were Sorry\" 5th 2017 Robin Bengtsson \"I Can't Go On\" 5th 2018 Benjamin Ingrosso \"Dance You Off\" 7th 2019 John Lundvik \"Too Late For Love\" 5th 2020 The Mamas \"Move\" Contest cancelled 2021 Tusse \"Voices\" 14th 2022 Cornelia Jakobs \"Hold Me Closer\" 4th 2023 Loreen \"Tattoo\" 1st 2024 Marcus & Martinus \"Unforgettable\" 9th == Other websites == Category:1958 establishments in Europe Category:1950s establishments in Sweden Category:Eurovision Song Contest selection events Category:Music competitions Category:Swedish music",
 "title": "Melodifestivalen"
}