{
 "id": "638396",
 "text": "The President of Venezuela (), officially known as the President of the Bolivarian Republic of Venezuela (), is the head of state and head of government of Venezuela. The president leads the National Executive of the Venezuelan government and is the Commander-in-chief of the National Bolivarian Armed Forces. Presidential terms were changed from five to six years following the adoption of the 1999 Constitution by President Hugo Chávez, and presidential term limits were also removed in 2009 by President Chávez stating that the president can serve as long as they want. The current president is Nicolás Maduro who has been in power since 19 April 2013 following his victory on the 2013 Venezuelan presidential election five days earlier, narrowly defeating his rival Henrique Capriles by 1.5%. Previously, Maduro was the acting president from the death of Hugo Chávez on 5 March 2013 until his inauguration. Maduro was also the Vice President from 2012 to 2013 before assuming the presidency. In May 2018, Maduro won the Presidential election. However, the election was considered unfair and controversies about the election result grew. Many people demanded Maduro to leave office once his first presidential term ends on 10 January 2019. However, Maduro illegally swore himself in early that day. This made the opposition parties angry at Maduro and thus, the opposition leader Juan Guaidó, who was the President of the National Assembly of Venezuela swore himself in declaring himself Interim President. Immediately, many foreign governments (mainly that of the United States, Canada, and the European Union) and NATO recognized Guaidó's interim government and no longer recognized Maduro as the legitimate president, thus beginning the Venezuelan presidential crisis. Guaidó promised to form a transitional government and hold fair elections and put an end to Maduro's government. However, none of the promises Guaidó and his interim government made came true and by 2022, Guaidó became increasingly unpopular and started to lose support. On 30 December 2022, three of the four main opposition parties voted to dissolve Guaidó's interim government. Eventually on 5 January 2023, Guaidó relinquished his claim to the presidency and officially dissolved his interim government, thus ending the presidential crisis. Many foreign governments who recognized Guaidó's interim government switched back to recognizing Maduro's government and once again recognized Maduro as the legitimate president of Venezuela.",
 "title": "President of Venezuela"
}