{
 "id": "63853",
 "text": "Kelly Maria Ripa (born October 2, 1970) is an American actress, talk show host, and television producer. Ripa, who played Hayley Vaughan on the television soap opera All My Children from 1990-2002, is best known as co-host of the popular syndicated morning talk show Live! with Kelly and Ryan. She is also known for her role as Faith Fairfield on Hope & Faith. Additionally, Ripa and her husband Mark Consuelos own a New York based production company, Milojo.Milojo Productions. In 2012, The Hollywood Reporter named her one of the Most Powerful People in Media.35 Most Powerful People in Media . ==Early life== Ripa was born in Stratford, New Jersey. She is the daughter of Esther, a homemaker, and Joseph Ripa, a labor-union president and bus driver. She has a younger sister, Linda, who is a children's book author. She is of Italian and Irish ancestry.IMDB Biography Her father has been the Democratic County Clerk for Camden County, New Jersey since June 2009. She is the first in her family to enter the acting profession. She has studied ballet since age three, plays the piano, and, in her words, is \"no Barbra Streisand,\" but can carry a tune.IMDB Biography. Ripa graduated from Eastern High School in Voorhees Township, New Jersey, where she became a cheerleader and was later encouraged by her drama teacher to pursue acting. \"I owe so much of my career to Jim Beckley,\"Kelly Ripa in town to shoot Live with Kelly . she said. \"He thought I was a natural performer and so he gave me the lead in the next show.\"From All My Children to Regis Philbin . She starred in local theatre productions and was discovered while performing in the comedy play The Ugly Duckling (c. 1941), by A.A. Milne, during her senior year. She attended Camden County College studying psychology, but dropped out and moved to New York City to be an actress.Heading to Pine Valley . ==Television and movie roles== Year Title Role Notes 1986-1992 Dance Party USA Dancer 1990-2002, 2010 All My Children Hayley Vaughan Soap Opera Digest Award for Outstanding Younger Lead Actress Soap Opera Digest Award for Hottest Romance Nominated — Daytime Emmy Award for Outstanding Younger Actress in a Drama Series Nominated —Daytime Emmy Award for Outstanding Supporting Actress in a Drama Series Nominated — Soap Opera Digest Award for Hottest Female Star 1996 Marvin's Room Coral 1999 The Stand-In Jenni Best Actress Award at the New York International Independent Film and Video Festival 2001 Someone to Love Michelle 2000-present Live! with Regis and Kelly, Live! with Kelly, Live! with Kelly and Michael Co- Host Daytime Emmy Award for Outstanding Talk Show 2011 Daytime Emmy Award for Outstanding Talk Show Host 2012 Daytime Emmy Award for Outstanding Talk Show Host Nominated—People's Choice Award for Favorite Daytime Talk Show Host 2001-2009 Disney Parks Christmas Day Parade Co-Host Daytime Emmy Award for Outstanding Special Class Special 2002 Ed Jennifer Bradley Episodes: \"Things to Do Today,\" \"May the Best Man Win,\" \"The Wedding,\" and \"Trapped\" 2002 Family Guy Herself Voice, Episode: \"Viewer Mail #1\" 2002 It's a Very Merry Muppet Christmas Movie Herself Cameo 2003-2006 Hope & Faith Faith Fairfield 2003 Kim Possible: A Sitch in Time Future Bonnie Voice 2003 Batman: Mystery of the Batwoman Dr. Roxanne \"Rocky\" Ballantine Voice 2003 Saturday Night Live Host Episode: \"Kelly Ripa/Outkast\" 2003 Cheaper by the Dozen Herself Cameo 2005 Duck Dodgers Herself Episodes: \"The New Cadet\" and \"The Love Duck\" 2005 1-800-Missing Melody Episode: \"Looking for Mr. Wright\" 2007 50 Funniest Women Alive Host 2007 The Knights of Prosperity Herself Episode: \"Operation: Oswald Montecristo\" 2007, 2012 TV Land Awards Host 2008 The Great Buck Howard Herself Cameo 2008 Delgo Kurrin Voice 2008 Fly Me to the Moon Nat's mom Voice 2008 Ugly Betty Herself Episode: \"The Manhattan Project\" 2009 Damages Herself Episode: \"I Lied, Too.\" 2009 Brothers & Sisters Herself Episode: \"Sibling Rivalry\" 2010 The Marriage Ref Panelist Episodes: \"Pilot,\" \"Jerry Seinfeld/Kelly Ripa/Alec Baldwin,\" and \"Demi Moore/Jim Breuer/Kelly Ripa\" 2010 Homemade Millionaire Host Executive Producer 2011 Hannah Montana Herself Episode: \"I Am Mamaw, Hear Me Roar!\" 2011 30 Rock Herself Episode: \"100\" 2011 Live from Lincoln Center Host Episode: \"New York City Ballet: George Balanchine's 'The Nutcracker'\" 2013 Google+ Hangout Host Episode: \"First Lady Michelle Obama's Let's Move! Fireside Hangout\" 2013 2013 2013 ==References== ==Other websites== *Kelly Ripa *Kelly Ripa Biography Category:1970 births Category:Living people Category:American movie actors Category:American television actors Category:American television presenters Category:Television talk show hosts Category:Actors from New Jersey Category:People from Camden, New Jersey Category:Emmy Award winners",
 "title": "Kelly Ripa"
}