{
 "id": "638636",
 "text": "_Kings XI Punjab_ is one of the cricket team of Indian Premier League. The home ground of this team is PCA Stadium of Mohali, Punjab. They were captained by Yuvraj Singh. Kings XI Punjab finished third in the IPL. Kings XI Punjab did not qualify for the Champions League T20 in this year. ==Indian Premier League== ===Season standings=== Kings XI Punjab finished second in the league stage of IPL 2008. Team Rajasthan Royals 14 11 3 0 22 +0.632 Kings XI Punjab 14 10 4 0 20 +0.509 Chennai Super Kings 14 8 6 0 16 −0.192 Delhi Daredevils 14 7 6 1 15 +0.342 Mumbai Indians 14 7 7 0 14 +0.570 Kolkata Knight Riders 14 6 7 1 13 −0.147 Royal Challengers Bangalore 14 4 10 0 8 −1.161 Deccan Chargers 14 2 12 0 4 −0.467 : Full table on cricinfo : (C) = Eventual champion; (R) = Runner-up. ===Matches in 2008=== No. Date Opponent Venue Result 1 19 April Chennai Super Kings Mohali Lost by 33 runs 2 21 April Rajasthan Royals Jaipur Lost by 6 wickets 3 25 April Mumbai Indians Mohali Won by 66 runs, MoM – Kumar Sangakkara – 94 (56) 4 27 April Delhi Daredevils Mohali Won by 4 wickets, MoM – Simon Katich – 75 (52) 5 1 May Deccan Chargers Hyderabad Won by 7 wickets, MoM – Shaun Marsh – 84* (62) 6 3 May Kolkata Knight Riders Mohali Won by 9 runs, MoM – Irfan Pathan – 24* (26) and 2/18 (4 overs) 7 5 May Royal Challengers Bangalore Bangalore Won by 6 wickets, MoM – S. Sreesanth – 2/16 (4 overs) 8 10 May Chennai Super Kings Chennai Lost by 18 runs 9 12 May Royal Challengers Bangalore Mohali Won by 9 wickets, MoM – Shaun Marsh – 74* (51) 10 17 May Delhi Daredevils Delhi Won by 6 runs (decided by D/L method), MoM – Mahela Jayawardene – 36* (17) 11 21 May Mumbai Indians Mumbai Won by 1 run, MoM – Shaun Marsh – 81 (56) 12 23 May Deccan Chargers Mohali Won by 6 wickets, MoM – Shaun Marsh – 60 (46) 13 25 May Kolkata Knight Riders Kolkata Lost by 3 wickets 14 28 May Rajasthan Royals Mohali Won by 41 runs, MoM – Shaun Marsh – 115 (69) 15 31 May Chennai Super Kings (Semi Final #2) Mumbai Lost by 9 wickets Total Overall Record 10-5, King XI Punjab were the semi-finalists in the IPL edition 2008 ==References== Category:Kings XI Punjab Category:2008 in sports Category:2008 in India",
 "title": "Kings XI Punjab in 2008"
}