{
 "id": "638670",
 "text": "Feng Tianwei (simplified Chinese: 风天威; traditional Chinese: 峰天王; Pinyin Feńg Tianwēi; born August 31, 1986 in Harbin) is a female Singaporean table tennis player who competed at the Olympic Games 2012 in London. She is a righhanded- player and uses the Shakehand-grip. == Biography == To 2002 she played for China because she was born in Harbin, a city in China. In that year she became Chinese Youth-champion. Since 2008 she was nominated for all World Championships- in that year she reached bronze with the team. In 2010 the Singaporean team became champion. In the final se beat the two players Liu Shiwen and Ding Ning. At the Olympic Games 2008 she won silver with the team. 2012 she qualificated herself for the Olympics again, where Feng won bronze in the singles and in the team, too. At the ITTF Pro Tour Grand Finals she won gold. At the World Championships in the singles she doesn't won a medal, but reached the Quarterfinals 2013 and 2015. In 2016 she was disqualificated fro the Singaporean team, because she had to make place for younger players. But she played continue, at the World Championships 2017 she lost in the Quarterfinals against Miu Hirano and missed so th bronze-grand-slam, because she won two times bronze at the World Cup (2008, 2013), Olympic Games (2012) and not at the World Championships. 2018 she took part in the World Championships with the team, but lost in the Round of 16. == Results == === World Cup === * 2008, 2013- 3rd place * 2009, 2011, 2012- 4th place === Olympic Games === * 2012- bronze * 2012- team bronze * 2008- team silver === World Championships === * 2009, 2011, 2013, 2017- Quarterfinals * 2010- team gold * 2008- team silver * 2016- team bronze === Asian Championships === * 2009- doubles bronze * 2009- team silver ==References== Category:1986 births Category:Living people Category:Table tennis players Category:Olympians for Singapore Category:Olympic bronze medalists Category:People from Harbin Category:Medalists at the 2008 Summer Olympics Category:Medalists at the 2012 Summer Olympics",
 "title": "Feng Tianwei"
}