{
 "id": "63871",
 "text": "Hilary Hahn (born November 27, 1979) is an American Grammy Award–winning violinist. ==Biography== She was born into a Lutheran family and moved to Baltimore, Maryland at the age of three and began playing the violin one month before her fourth birthday in the Suzuki Program of Baltimore’s Peabody Conservatory.Sony Bio Hahn became interested in the violin after taking a walk with her father in their Baltimore neighborhood (Zaustinsky 1999). The two passed a branch of the Peabody Conservatory that advertised music lessons for four-year-olds and observed a music lesson where a young boy was playing Twinkle Twinkle Little Star. Hahn began taking lessons the following week and participated in a Suzuki class for about a year. In 1995 Hahn made her international debut in Germany with a performance of the Beethoven Concerto for Violin and Orchestra in D Major with Lorin Maazel and the Bavarian Radio Symphony Orchestra. The concert was broadcast on radio and television throughout Europe. A year later, Hahn debuted at Carnegie Hall in New York as a soloist with the Philadelphia Orchestra. By the age of sixteen, Hahn had completed the Curtis Institute's university requirements, but elected to remain at the Institute for several more years to pursue additional elective courses, until her graduation in May 1999 with a Bachelor Of Music degree. During this time she regularly coached violin with Jaime Laredo, and studied chamber music with Felix Galimir and Gary Graffman. In an interview with PBS in December 2001, Hahn stated that of all the musical disciplines, she is most interested in musical performance (PBS Interview). Hahn has played with orchestras such as the London Symphony Orchestra, New York Philharmonic, Singapore Symphony Orchestra, just to name a few. She debuted with the Chicago Symphony Orchestra in March 2007. She began performing and touring in a crossover duo with singer-songwriter Josh Ritter in 2005 and (early 2007) with singer-songwriter Tom Brosseau.https://www.npr.org/templates/story/story.php?storyId=7677066 ==Career== In 2001, Time Magazine named Hahn as “America’s Best” young classical musician. Throughout her career, Hahn has performed with numerous orchestras around the globe. She previously recorded five albums with Sony Classical, but now records exclusively for Deutsche Grammophon. In 1996 Sony Music signed Hahn to an exclusive recording contract, which made her one of the youngest exclusive artists in the label’s history. Hahn’s first recording, released in 1997, featured selected solo sonatas and partitas by J.S. Bach, and spent weeks as a bestseller on the Billboard classical charts. In addition to being a solo violinist, Hahn has also performed as a chamber musician. Since the summer of 1992 she has performed nearly every year with the Skaneateles Chamber Music Festival in Skaneateles, New York. Between 1995 and 2000 she spent performing and studying chamber music at the Marlboro Music Festival in Vermont, and in 1996 she served as an artist and a member of the chamber music mentoring program of The Chamber Music Society of Lincoln Center. ===From Sony Classical to Deutsche Grammophon=== Hahn signed with Deutsche Grammophon in 2003 after her contract with Sony expired in 2002. After Hahn completed her part of the contract with Sony, which was for five recordings over six years, she decided against renewing the contract due to the fact that she and Sony did not agree on her future projects (Lark Ascending). ==Personal== In an interview with Strings Magazine conducted in 1999, Hahn cited several people as being influential on her development as a musician and a student. Two of these influences include David Zinman, the conductor of the Baltimore Symphony and Hahn’s mentor since she was ten, and Lorin Maazel, with whom she worked in Europe with the Bavarian Radio Symphony Orchestra. In the interview, Hahn also stated that she enjoys watching movies, reading, and writing in her free time. Other hobbies that she lists include: meeting new people, exploring cities, ballet, working out, swimming, and bike riding. She also enjoys animals and rowing (The Daily Princetonian). ===What she plays=== Hilary Hahn plays an 1864 Vuillaume violin( II Cannone Guarneri copy) that was formerly owned by the Russian violinist Samuel Lande who was a friend of Klara Berkovich, Hahn’s first teacher. Hahn uses Dominant strings and bows by French bow makers Paul Jombar and Emil Miquel (Zaustinsky 1999). But now, she plays on the 1865 Vuillaume violin( Alard Stradivarius copy) which she bought at Tarisio Auctions. ===On playing Bach=== As of 1999, Hahn has stated that she plays Bach more than any other composer and that she has played solo Bach pieces every day since she was eight (Zaustinsky 1999). The following is an excerpt from the liner notes to Hahn’s album Hilary Hahn Plays Bach: \"Bach is, for me, the touchstone that keeps my playing honest. Keeping the intonation pure in double stops, bringing out the various voices where the phrasing requires it, crossing the strings so that there are not inadvertent accents, presenting the structure in such a way that it's clear to the listener without being pedantic - one can't fake things in Bach, and if one gets all of them to work, the music sings in the most wonderful way.\" (Saint Paul’s Sunday) In a segment on NPR entitled “Musicians in Their Own Words”, Hahn speaks about the surreal experience of playing the Bach Chaconne (from the Solo Violin Partita No. 2) alone on the concert stage. In the same segment, she also discusses her experiences emulating a lark while playing The Lark Ascending by Ralph Vaughan Williams. The complete transcript can be found here: Musicians in Their Own Words ==Discography== * Hilary Hahn Plays Bach (1997) *: Hilary Hahn, violin * Beethoven Violin Concerto/Bernstein Serenade (1999) *: Hilary Hahn, violin *: Baltimore Symphony Orchestra *: David Zinman, conductor *: Grammy Nominee - Best Instrumental Soloist Performance with Orchestra * Barber & Meyer Violin Concertos (2000) *: Hilary Hahn, violin *: Saint Paul Chamber Orchestra *: Hugh Wolff, conductor * Brahms & Stravinsky Violin Concertos (2001) *: Hilary Hahn, violin *: Academy of St. Martin-in- the-Fields *: Sir Neville Marriner, conductor *: Grammy Award for Best Instrumental Soloist(s) Performance (with orchestra) * Mendelssohn & Shostakovich Concertos (2002) *: Hilary Hahn, violin *: Oslo Philharmonic Orchestra *: Marek Janowski and Hugh Wolff, conductors * Bach Concertos (2003) *: Hilary Hahn, violin *: Margaret Batjer, violin; Allan Vogel, oboe *: Los Angeles Chamber Orchestra *: Jeffrey Kahane, conductor * The Village (film) Motion Picture Soundtrack (2004) *: Hilary Hahn, featured violinist *: Music composed by James Newton Howard * Elgar: Violin Concerto; Vaughan Williams: The Lark Ascending (2004) *: Hilary Hahn, violin *: London Symphony Orchestra *: Colin Davis, conductor * Mozart Violin Sonatas (2005) *: Hilary Hahn, violin; Natalie Zhu, piano *\"To Russia My Homeland\" from the album Worlds Apart by ...And You Will Know Us by the Trail of Dead (2005) * Paganini: Violin Concerto No. 1 / Spohr: Violin Concerto No. 8 - Gesangsszene (2006) *: Hilary Hahn, violin *: Swedish Radio Symphony Orchestra *: Eiji Oue, conductor *\"Witch's Web\" from the album So Divided by ...And You Will Know Us by the Trail of Dead (2006) *\"Fork in the Road\" and \"Blue Part of the Windshield\" from the album Grand Forks by Tom Brosseau (2007) * Schoenberg: Violin Concerto; Sibelius: Violin Concerto (2008) *:Hilary Hahn, Violin *:Swedish Radio Symphony Orchestra *:Esa-Pekka Salonen, Conductor ==References== * HilaryHahn.com Biography. Retrieved from the World Wide Web on December 14, 2005: * (Lady Ascending) Hilary Hahn - The Lady Ascending: An interview with Réjean Beaucage, November 5, 2003. From ‘’La Scena Musicale’’ Vol. 9, No. 3. Retrieved from the World Wide Web on December 14, 2005: * (NPR) Musicians in their own Words. Features in the Series produced by David Schulman and Jeffrey Freymann-Weyr. Retrieved from the World Wide Web on December 14, 2005: * (PBS Interview) Great Performances. Dialogue. The Art of Violin. Hilary Hahn. Retrieved from the World Wide Web on December 14, 2005: * (Saint Paul’s Sunday) American Public Media: Saint Paul’s Sunday. Retrieved from the World Wide Web on December 14, 2005 * (Sony Bio) SonyClassical Hilary Hahn Biography. Retrieved from the World Wide Web on December 14, 2005: * (The Daily Princetonian) Ross, Adrian. The Daily Princetonian Q&A;: A moment with Hilary Hahn. Retrieved from the World Wide Web on December 14, 2005: * Zaustinsky, Julia. All Things Strings Cover Story: Hilary Hahn: Fulfilling her Promise. Excerpted from ‘’Strings Magazine’’ August/September 1999, No. 80. Retrieved from the World Wide Web on December 14, 2005: * Reel, James. A Star Ascending. Excerpted from ‘’Strings Magazine’’ January 2005, No. 125. ==Other websites== * Official Website * Her site at Deutsche Grammophon Hahn, Hilary Category:American Grammy Award winners Category:1979 births Category:Living people",
 "title": "Hilary Hahn"
}