{
 "id": "638879",
 "text": "The 2017–18 UEFA Champions League knockout phase was the knockout stage which started on 13 February and ended on 26 May 2018 with the last match at the NSC Olimpiyskiy Stadium in Kyiv, Ukraine, to decide the champions of the 2017–18 UEFA Champions League. A total of 16 teams compete in the knockout phase. ==Round and draw dates== All draws where held at the UEFA headquarters in Nyon, Switzerland. Round Draw First leg Second leg Round of 16 11 December 2017 13–14 & 20–21 February 2018 6–7 & 13–14 March 2018 Quarter-finals 16 March 2018 3–4 April 2018 10–11 April 2018 Semi-finals 13 April 2018 24–25 April 2018 1–2 May 2018 Final 13 April 2018 26 May 2018 at NSC Olimpiyskiy Stadium, Kyiv 26 May 2018 at NSC Olimpiyskiy Stadium, Kyiv ==Qualified teams== Group Winners (seeded in round of 16 draw) Runners-up (unseeded in round of 16 draw) A Manchester United Basel B Paris Saint-Germain Bayern Munich C Roma Chelsea D Barcelona Juventus E Liverpool Sevilla F Manchester City Shakhtar Donetsk G Beşiktaş Porto H Tottenham Hotspur Real Madrid ==Round of 16== |} ===Matches=== Juventus won 4–3 on aggregate. \\---- Manchester City won 5–2 on aggregate. \\---- Liverpool won 5–0 on aggregate. \\---- Sevilla won 2–1 on aggregate. \\---- Real Madrid won 5–2 on aggregate. \\---- 2–2 on aggregate. Roma won on away goals. \\---- Barcelona won 4–1 on aggregate. \\---- Bayern Munich won 8–1 on aggregate. ==Quarter-finals== The draw for the quarter-finals was held on 16 March 2018, 12:00 CET. |} ===Matches=== 4–4 on aggregate. Roma won on away goals. \\---- Bayern Munich won 2–1 on aggregate. \\---- Real Madrid won 4–3 on aggregate. \\---- Liverpool won 5–1 on aggregate. ==Semi-finals== The draw for the semi-finals was held on 13 April 2018, 13:00 CEST. For the first time since the 2009–10 UEFA Champions League, all the four teams at this stage represent different national associations. |} ===Matches=== Real Madrid won 4–3 on aggregate. \\---- Liverpool won 7–6 on aggregate. ==Final== The final was played at the NSC Olimpiyskiy Stadium in Kyiv on 26 May 2018. The \"home\" team (for administrative purposes) was determined by an additional draw held after the semi-final draw. ==Notes== ==References== knockout stage",
 "title": "2017–18 UEFA Champions League knockout phase"
}