{
 "id": "639195",
 "text": "\"God's Plan\" is a song recorded by Canadian musician Drake. It was the first single from his EP, Scary Hours (2018) and from his album, Scorpion (2018). The song entered at the top of the Billboard Hot 100 in the United States. It stayed there for 11 weeks and became his fourth number-one hit. He later broke a record when his song \"Nice for What\" also entered at the top, making Drake the only artist to replace their number-one entry with another number-one entry. The song finished as the number-one song of 2018 in the United States. It is only the third song that entered at number one and was at the top of the year-end charts in the US, after \"Candle in the Wind 1997/Something About the Way You Look Tonight\" by Elton John and \"Shape of You\" by Ed Sheeran. == Music video == The music video began with the titles, \"The budget for this video was $996,631.90. We gave it all away. Don't tell the label…\" The money was given to various people, including some fans. As of May 2018, the video has received over 581 million YouTube views. ==Charts== ===Weekly charts=== Chart (2018) Peak position Brazil Streaming (Pro-Música) 21 Colombia (National Report) 30 Costa Rica (Monitor Latino) 7 Dominican Republic (SODINPRO) 32 Dominican Republic (Monitor Latino) 20 Ecuador (National-Report) 37 France (SNEP) 2 Greece (IFPI Greece) 1 Honduras (Monitor Latino) 17 Lebanon (Lebanese Top 20) 4 Malaysia (RIM) 2 Mexico Airplay (Billboard) 29 Singapore (RIAS) 14 Venezuela (National- Report) 81 ===Year-end charts=== Chart (2018) Position Australia (ARIA) 2 Austria (Ö3 Austria Top 40) 17 Belgium (Ultratop Flanders) 20 Belgium (Ultratop Wallonia) 28 Canada (Canadian Hot 100) 3 Denmark (Tracklisten) 7 Estonia (IFPI) 5 France (SNEP) 6 Germany (Official German Charts) 12 Ireland (IRMA) 3 Israel (Galgalatz) 16 Italy (FIMI) 26 New Zealand (Recorded Music NZ) 1 Netherlands (Dutch Top 40) 25 Netherlands (Single Top 100) 4 Portugal (AFP) 1 Sweden (Sverigetopplistan) 5 Switzerland (Schweizer Hitparade) 16 UK Singles (Official Charts Company) 2 US Billboard Hot 100 1 US Dance/Mix Show Airplay (Billboard) 25 US Hot R&B;/Hip-Hop Songs (Billboard) 1 US Mainstream Top 40 (Billboard) 26 US Rhythmic (Billboard) 1 Chart (2019) Position Portugal (AFP) 157 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 95 UK Singles (Official Charts Company) 59 US Billboard Hot 100 19 US Hot R&B;/Hip- Hop Songs (Billboard) 10 ===All-time charts=== Chart (2018) Position US Billboard Hot 100 149 === Notes === == References == Category:2018 songs Category:Drake (musician) songs Category:Grammy Award-winning songs Category:Hip hop songs",
 "title": "God's Plan (song)"
}