{
 "id": "63912",
 "text": "Rafael Nadal Parera (born 3 June 1986 in Manacor, Majorca, Spain) is a Spanish professional tennis player who has won 22 Grand Slam singles titles; fourteen at the French Open, four at the US Open, two at Wimbledon and two at the Australian Open. He has been ranked number one in the world for 209 weeks. He plays very well on clay courts, and many people regard Nadal as the greatest clay-court tennis player in history. He plays tennis with his left hand. Nadal has won 36 ATP Masters Series titles and the 2008 Olympic gold medal in singles. He is a part of the Spain Davis Cup team and has won the cup four times, in 2004, 2008, 2009, and 2011. Nadal is often known simply as Rafa. He has rivalries against Roger Federer, Novak Djokovic and Andy Murray. Nadal is agnostic. == Grand slams (Participation and victories) == This table shows Nadal's performance in each Grand Slam tournament in singles. Year Australian Open French Open Wimbledon US Open 2003 Did not enter InjuredNadal missed the 2003 French Open due to a right elbow injury. Round 3 Round 2 2004 Round 3 InjuredNadal missed the French Open and Wimbledon in 2004 due to a fracture in his left ankle. Injured Round 2 2005 Round 4 Winner Round 2 Round 3 2006 InjuredNadal missed the 2006 Australian Open due to a foot injury. Winner Final Quarter-final 2007 Quarter-final Winner Final Round 4 2008 Semi-final Winner Winner Semi-final 2009 Winner Round 4 InjuredNadal missed the 2009 Wimbledon Championships due to tendinitis in the knee. Semi-final 2010 Quarter-final Winner Winner Winner 2011 Quarter-final Winner Final Final 2012 Final Winner Round 2 Absent 2013 Absent Winner Round 1 Winner 2014 Final Winner Round 4 Absent 2015 Quarter-final Quarter-final Round 2 Round 3 2016 Round 1 Round 3 Absent Round 4 2017 Final Winner Round 4 Winner 2018 Quarter- final Winner Semi-final Semi-final 2019 Final Winner Semi-final Winner 2020 Quarter-final Winner Not held Absent 2021 Quarter-final Semi-final Absent Absent 2022 Winner Winner Semi-final Round 4 2023 Round 2 Absent Absent Absent 2024 Absent == References == Category:1986 births Category:Living people Category:Agnostics Category:Australian Open champions Category:Balearic Islands Category:French Open champions Category:Male tennis players Category:Medalists at the 2008 Summer Olympics Category:Medalists at the 2016 Summer Olympics Category:Olympic gold medalists for Spain Category:US Open (tennis) champions Category:Wimbledon champions Category:World No. 1 tennis players Category:Spanish tennis players",
 "title": "Rafael Nadal"
}