{
 "id": "639160",
 "text": "{{Infobox writer | name = James Patterson | image = James Patterson at the Library of Congress National Book Festival on August 24, 2024 (cropped).jpg | caption = Patterson in 2024 | birth_name = James Brendan Patterson | birth_date = | birth_place = Newburgh, New York, US | death_date = | nationality = American | alma_mater = Manhattan College Vanderbilt University | period = | genre = Mystery, young adult fiction, thriller, comedy, realistic fiction, romance | subject = | movement = | notableworks = The Alex Cross series, the Women's Murder Club series, the Maximum Ride series, the Michael Bennett series, the Middle School series, the Treasure Hunters series, the I Funny series, the Jacky Ha-Ha series, the Private series, the Jacky Ha-Ha Graphic Novel series, and the Max Einstein series | spouse = Susan Patterson | children = Jack Patterson | signature = | website = | influences = | influenced = }} James Brendan Patterson (born March 22, 1947) is an American author and philanthropist. His works are the Alex Cross, Michael Bennett, Women's Murder Club, Maximum Ride, Daniel X, NYPD Red, Witch and Wizard, Private series, the Middle School series, the Jacky Ha-Ha series, the Jacky Ha-ha Graphic Novel series, the Treasure Hunters series, the Max Einstein series, and the I Funny series, as well as many stand-alone thrillers, non-fiction and romance novels. Some other book series that he wrote are the Sci-Fi Junior High series, the How to be a Supervillain series, and the House of Robots series. His books have sold more than 300 million copies and he was the first person to sell 1 million e-books.First author to sell more than 1 million e-books: On 6 July 2010, the Hachette Book Group announced that James Patterson (USA), creator of the Alex Cross and Women's Murder Club series of novels, was the first author to exceed one million sales in e-books, moving 1.14 million units of his books for devices like Kindle and the iPad. In 2016, Patterson topped Forbes list of highest-paid authors for the third consecutive year, with an income of $95 million.Forbes’s highest-paid authors 2016 (in US dollars), The Guardian, 3 August 2016 His total income over a decade is about $700 million, making him the richest author in the world. He also has his own filming studio, which is called James Patterson Entertainment. ==References== ==Other websites== * * * James Patterson at the Internet Book List * * Category:1947 births Category:Living people Category:20th-century American novelists Category:American children's writers Category:Philanthropists from New York (state) Category:Writers from New York (state) Category:Businesspeople from New York (state) Category:Businesspeople from Florida Category:Writers from Florida Category:People from Newburgh, New York",
 "title": "James Patterson"
}