{
 "id": "63933",
 "text": "The Victoria Cross for Australia (VC) is the highest military decoration given for bravery \"in the face of the enemy\" to members of the Australia Armed Forces. The medal was called the Victoria Cross, but the name was changed in 1991. The Victoria Cross was started in 1856 for bravery in the Crimean War. The first medals were made from captured Russian cannons. The Victoria Cross for Australia looks exactly the same as the Victoria Cross. The first winner of the Victoria Cross for Australia is SAS Trooper Mark Donaldson. Donaldson won the medal for bravery in Afghanistan in September 2008. The medal was given to him in a ceremony on January 16, 2009. He was the first winner of a VC for 40 years. ==Australian winners of the Victoria Cross== ===1900 to 1920=== * 1900 - John Bisdee, Second Boer War * 1900 - Sir Neville Howse, Second Boer War * 1900 - Guy Wylly, Second Boer War * 1901 - Frederick Bell, Second Boer War * 1901 - Leslie Maygar, Second Boer War, Geelhoutboom, South Africa * 1901 - James Rogers, Second Boer War * 1915 - Alexander Burton, Gallipoli Campaign * 1915 - Wilbur Dartnell, Maktau, Kenya * 1915 - William Dunstan, World War I, Gallipoli Campaign * 1915 - John Patrick Hamilton, World War I, Gallipoli Campaign * 1915 - Albert Jacka, Gallipoli Campaign * 1915 - Leonard Keysor, World War I, Gallipoli Campaign * 1915 - Alfred Shout, Gallipoli Campaign * 1915 - William Symons, World War I, Gallipoli Campaign * 1915 - Hugo Throssell, World War I, Gallipoli Campaign * 1915 - Frederick Tubb, World War I, Gallipoli Campaign * 1916 - Arthur Blackburn, World War I, Pozières, France * 1916 - Claud Castleton, Pozières, France * 1916 - Thomas Cooke, Pozières, France * 1916 - William Jackson, World War I, Armentières, France * 1916 - John Leak, World War I, Pozières, France * 1916 - Martin O'Meara, World War I, Pozières, France * 1917 - Frederick Birks, Battle of Passchendaele * 1917 - Patrick Bugden, Zonnebeke, Belgium * 1917 - Percy Cherry, Lagnicourt, France * 1917 - John Carroll, World War I, Battle of Messines (1917) * 1917 - John Dwyer, World War I, Zonnebeke, Belgium * 1917 - Robert Grieve, World War I, Battle of Messines (1917) * 1917 - George Howell, World War I, Battle of Arras (1917) * 1917 - Roy Inwood, World War I, Battle of the Menin Road Ridge * 1917 - Clarence Jeffries, First Battle of Passchendaele * 1917 - Jørgen Jensen, World War I, Noreuil, France * 1917 - Bede Kenny, World War I, Hermies, France * 1917 - Lewis McGee, Battle of Ypres * 1917 - Frank McNamara, World War I, Capture of Wadi el Hesi * 1917 - Mick Moon, World War I, Battle of Arras (1917) * 1917 - Harry Murray, World War I * 1917 - James Newland, World War I, Bapaume, France * 1917 - Walter Peeler, World War I, Battle of Ypres * 1917 - Charles Pope, Louveral, France * 1917 - John Whittle, World War I * 1918 - Thomas Axford, World War I, Battle of Hamel * 1918 - Robert Beatham, Battle of Rosières * 1918 - Albert Borella, World War I, Villers-Bretonneux, France * 1918 - Walter Brown, World War I, Villers- Bretonneux, France * 1918 - Alexander Buckley, Battle of Mont Saint-Quentin * 1918 - Maurice Buckley, World War I, Le Verguier, France * 1918 - George Cartwright, World War I, Bouchavesnes, France * 1918 - William Currey, World War I, Battle of Mont Saint-Quentin * 1918 - Henry Dalziel, World War I, Battle of Hamel * 1918 - Phillip Davey, World War I, Merris, France * 1918 - Alfred Gaby, Villers-Bretonneux, France * 1918 - Bernard Gordon, World War I, Battle of Amiens * 1918 - Arthur Hall, World War I, Battle of Mont Saint- Quentin * 1918 - George Ingram, World War I, Montbrehain, France * 1918 - William Joynt, World War I, Battle of Herleville Wood * 1918 - Alby Lowerson, World War I, Battle of Mont Saint-Quentin * 1918 - Robert MacTier, Battle of Mont Saint-Quentin * 1918 - Joseph Maxwell, World War I, Estrees, France * 1918 - Dominic McCarthy, World War I, Vermandovillers, France * 1918 - Stanley McDougall, World War I, Dernancourt, France * 1918 - William Ruthven, World War I, Ville-sur-Ancre, France * 1918 - John Ryan, World War I, Hindenburg Defences, France * 1918 - Clifford Sadlier, World War I, Villers-Bretonneux, France * 1918 - Percy Statton, World War I, Proyart, France * 1918 - Percy Storkey, World War I, Hangard Wood, France * 1918 - Edgar Towner, World War I, Battle of Mont Saint-Quentin * 1918 - Blair Wark, World War I, Bellicourt, France * 1918 - Lawrence Weathers, World War I, Peronne, France * 1918 - James Park Woods, World War I, Le Verguier, France * 1919 - Arthur Percy Sullivan, North Russia Campaign * 1919 - Samuel Pearse, North Russia Campaign ===1941 - 1969 === * 1941 - Roden Cutler, Syria–Lebanon Campaign * 1941 - Corporal John Edmondson, Tobruk * 1941 - Hughie Edwards, Bremen * 1941 - Jim Gordon, Djezzine, Lebanon * 1942 - Charles Groves Wright Anderson, Malaya * 1942 - Percy Gratwick, El Alamein, Egypt * 1942 - Stan Gurney, Egypt * 1942 - Jack French, Milne Bay, New Guinea * 1942 - Percy Gratwick * 1942 - Bill Kibby, El Alamein, Egypt * 1942 - Bruce Kingsbury, Kokoda Trail, Papua New Guinea * 1942 - Ron Middleton, Turin, Italy * 1943 - Tom Derrick, New Guinea * 1943 - Richard Kelliher, New Guinea * 1943 - Bill Newton, New Guinea * 1945 - Albert Chowne, Dagua, New Guinea * 1945 - Edward Kenna, New Guinea * 1945 - John Bernard Mackey, Tarakan Island, Borneo * 1945 - Frank Partridge, Bougainville Campaign, Solomon Islands * 1945 - Reg Rattey, Bougainville, Solomon Islands * 1945 - Leslie Thomas Starcevich, Battle of North Borneo * 1965 - Kevin Wheatley, Vietnam * 1967 - Peter Badcoe, Huong Tra, Vietnam * 1969 - Keith Payne, Ben Het Camp, Vietnam * 1969 -Ray Simpson, Vietnam ==Winners of the Victoria Cross for Australia== * 2008 - Mark Donaldson, SAS, for bravery in Afghanistan, Urozgan Province * 2010 - Daniel Keighran, War in Afghanistan, Urozgan Province * 2011 - Ben Roberts-Smith, War in Afghanistan, Kandahar Province * 2013 - Cameron Baird, War in Afghanistan, Khod Valley ==References== Category:Orders, decorations, and medals of Australia Category:1856 establishments in Australia",
 "title": "Victoria Cross for Australia"
}