{
 "id": "639552",
 "text": "António Luís Santos da Costa GCIH (born 17 July 1961) is a Portuguese lawyer and politician who has been the President of the European Council since 2024. He was the 119th Prime Minister of Portugal from 26 November 2015 to 2 April 2024. He served as Mayor of Lisbon from 2007 to 2015. He was elected as Secretary-General of the Socialist Party in September 2014.António Costa's Biography on the Portuguese Government's official webpage. His near-9 year tenure as prime minister is the longest of any officeholder in the Iberian Peninsula in the 21st century. On 7 November 2023, Costa resigned after ongoing searches and arrests involving members of his Socialist government. This resignation was accepted by the president, Marcelo Rebelo de Sousa, a few hours later. After his resignation, Costa was elected as President of the European Council. ==Early life== Costa was born in 1961 in Lisbon, Portugal. He is the son of writer Orlando da Costa and journalist Maria Antónia Palla.Then Came A Gandhi , outlookindia.com, retrieved 10 September 2015 Costa graduated from the Faculty of Law of the University of Lisbon in the 1980s. He first entered politics when he was elected as a Socialist deputy to the municipal council. He later practiced law briefly from 1988, before entering politics full-time.Axel Bugge (4 October 2015), Portuguese Socialist leader Costa candidate for PM Reuters. == President of the European Council == In the aftermath of the 2024 European Parliament election, Costa was seen as the frontrunner candidate for the Presidency of the European Council. On 27 June 2024, Costa was elected as President of the European Council, one of the three most important leadership posts of the European Union, by the 27 EU member state leaders. ==Personal life== In 1987, Costa married Fernanda Maria Gonçalves Tadeu, a teacher. The couple have a son and a daughter. Costa also holds an Overseas Citizenship of India. ==References== ==Other websites== * Biography in the Portuguese Government site Category:1961 births Category:Living people Category:Prime ministers of Portugal Category:Portuguese mayors Category:Politicians from Lisbon Category:MEPs for Portugal",
 "title": "António Costa"
}