{
 "id": "639541",
 "text": "The 1984 Carolinas tornado outbreak of March 28, 1984 across North Carolina, South Carolina, and Georgia was the largest tornado outbreak in the two Carolinas since the Enigma tornado outbreak 100 years earlier. == Forecast == Weather reports from that day were that a tornado watch was issued for Alabama and Georgia, where two tornadoes struck Barrow County at 2:25 p.m. Eastern Time, and Henry County at 2:30 p.m. Eastern Time in Georgia. The first reports were hail from Macon County, North Carolina. By mid-afternoon, a high risk was issued for Alabama, Georgia, South Carolina, and North Carolina as severe thunderstorms had entered western South Carolina and tornado watches was issued for South Carolina, North Carolina, and Virginia. === Tornadoes === Tornadoes confirmed on March 28, 1984 Rating (#) Time County State Deaths Injuries F1 2:25 PM Barrow Georgia 0 1 F0 2:30 PM Henry Georgia 0 0 F1 4:30 PM Abbeville South Carolina 0 24 F2 4:40 PM Laurens South Carolina 0 43 F2 5:20 PM Newberry South Carolina 1 38 F3 5:40 PM Newberry South Carolina 0 10 F4 6:00 PM Fairfield South Carolina 5 0 F1 6:10 PM Union North Carolina 0 0 F4 6:20 PM Kershaw, Lancaster South Carolina 0 31 F2 6:40 PM Chesterfield South Carolina 0 0 F4 6:45 PM Chesterfield South Carolina 0 24 F4 7:10 PM Marlboro, Scotland (NC) South Carolina, North Carolina 7 100 F4 7:20 PM Marlboro, Scotland (NC), Robeson (NC), Cumberland (NC) South Carolina, North Carolina 4 395 F3 7:45 PM Bladen, Cumberland, Sampson North Carolina 12 101 F2 8:10 PM Nash North Carolina 0 0 F4 8:15 PM Sampson, Duplin, Wayne North Carolina 3 0 F3 8:30 PM Wayne, Lenoir North Carolina 0 81 F4 8:45 PM Wayne, Lenoir, Greene, Pitt North Carolina 16 153 F3 8:55 PM Bertie North Carolina 6 19 F2 9:10 PM Bertie, Hertford North Carolina 0 7 F1 9:17 PM Hertford North Carolina 0 0 F2 9:35 PM Horry, Columbus (NC) South Carolina, North Carolina 0 8 F3 9:37 PM Gates North Carolina 2 10 F2 10:15 PM Chowan, Perquimans North Carolina 1 1 == Aftermath == The outbreak killed 57 people (42 in North Carolina, 15 in South Carolina) and injured 1,249 others, and tornado damage in 2 counties in Georgia, 8 in South Carolina, and 17 in North Carolina. The day before, weak tornadoes were reported in locations from Louisiana to Alabama and thunderstorms also triggered floods in Florida that caused a train derailment. Severe thunderstorms also caused four additional deaths in Maryland and Pennsylvania before dropping snow across the northeast. Cities including Atlanta, Charlotte, Columbia, Greenville, Fayetteville, Norfolk, Raleigh, and Suffolk had wind damage and it was reported as north as Delaware. Category:Tornadoes in the United States Category:1984 in the United States Category:1980s in North Carolina Category:20th century in South Carolina Category:1980s in weather",
 "title": "1984 Carolinas tornado outbreak"
}