{
 "id": "639787",
 "text": "Oobi is an American television show for children. It was made by Little Airplane Productions in New York City. It is about a group of talking hand puppets with eyes and clothes. The main character, Oobi, is a 4-year-old boy hand. He has a sister named Uma, a friend named Kako, and a grandfather named Grampu. The show was first played in 2000 as a series of two-minute short episodes. It started as a series of longer half-hour episodes in 2003. It was shown on the channels Nickelodeon and Noggin. While it was being made, the show was popular with preschoolers and fans of puppetry. It won awards from groups like Parents' Choice and the Academy of Television Arts & Sciences. In the mid-2000s, there was a cult following of small filmmakers who used Oobi- style puppets in short movies. In 2012, a spin-off of Oobi called Dasdasi was made in Iran. The entire original show is currently included on Amazon Prime Video. ==Structure and plot== Most episodes are split into two or three parts. Every episode has a main story and some interviews. In the interviews, the puppets ask real kids and families about a topic or place. Episodes in season one also have a \"game segment\" where the puppets play a simple learning game. In season two, there were no game segments anymore and the main stories were made longer instead. The show takes place in an old-fashioned town where almost everyone is a talking hand puppet. The puppets have eyes that they wear on the middle finger. The kids have four of their fingers straight, and they use their thumbs as their bottom lips. The adults have their fingers curled up, which makes them look taller. The only regular character who is not a hand is Frieda, a foot puppet. ==Episodes== ===Season 1 (shorts)=== # Slide! # Follow the Leader! # Pretend Catch! # Peekaboo! # Tag! # Dance! # Share Pretzels! # Watermelon! # Soup! # Hot Dog and Ketchup! # Empty and Full! # Popcorn! # Worm! # Apple Picking! # Pretend Wind! # Dig! # Hide and Seek! # Nature! # Music! # Guitar! # Bongo Drums! # Quiet Read! # Clap Hands! # Painting! # Macaroni Jewelry! # Paint Shapes! # Pinch Pot! # Drawing Game! # Neighborhood Art! # Toothpaste! # Wet and Dry! # Bubble Bath! # Feelings! # Cake! # Flush! # On and Off! # Prince Oobi! # Bubbles! # Tea! # Ice Cream! # Water Games! # Guess! # Bird! # Cat! # Puppy! # Animal Cookies # Itsy Bitsy Spider! # Toys! ===Season 2=== # Camp Out! # Uma Swing! # Uma Bathroom! # Dance Class! # Kako's Puppy! # Uma's Birthday! # Asparagus! # Haircut! # Grampu Day! # Make Pizza! # Showtime! # Oobi's Car! # Garden Day! # Piano Lesson! # Uma Chicken! # Sleepover! # Play Ball! # Build Fort! # Petting Zoo! # New Friend! # Uma Sick # Playdate! # Make Art! # Rainy Day! # Pretend Circus! # Make Music! ===Season 3=== # Video! # Grown-Up! # Shopping! # Uma Dreams! # Chopsticks! # Clean Up! # Kako Dinner! # Sign Language! # Halloween! # Checkup! # Uma Trip! # Frieda Friend! # Neighborhood! # Uma Preschool! # Theater! # Baby! # Chez Oobi! # Valentine! # Parade! # Babysitter! # Recital! # Dinosaur! # Nature Walk! # Sing! # Fishing! # Superheroes! ==Cast== *Tim Lagasse as Oobi *Stephanie D'Abruzzo as Uma and Inka *Noel MacNeal as Kako *Tyler Bunch as Grampu *Matt Vogel as Angus *Jennifer Barnhart as Mrs. Johnson *Cheryl Blaylock as Frieda the Foot ==Characters== *Oobi is a four-year-old boy hand with brown eyes. His favorite thing to do is play the piano. His favorite toy is a red model car. *Uma is Oobi's little sister. She wears a purple and blue ring on her pinky finger. She loves to talk about chickens, her favorite animal. *Kako is the best friend of Oobi. He wears a red hat. He likes to visit Oobi's house. His parents are Mamu and Papu. *Grampu is the grandfather and caretaker of Oobi and Uma. He likes to cook food and work in his garden. *Frieda is a talking foot puppet. She is five years old. She likes to play with Oobi at the park. *Angus is Oobi and Kako's nerdy friend. He is usually nervous and has trouble talking in front of people. *Inka is Oobi's piano teacher. She is also Grampu's girlfriend. She has purple hair. She likes to talk about her home country, France. *Mrs. Johnson is Oobi's old neighbor. She has a white wig, big round glasses, and a brown dress that she wears like a shirt sleeve. ==International broadcast== The show has also been shown in: * — ABC * — TVOKids * — Nickelodeon Junior * — Stöð 2 * — BabyTV (until 2010), Nickelodeon Israel (2010–13) * * — AFN * — Nickelodeon Arabia * — Nickelodeon Pakistan * — Nickelodeon Poland * — Nickelodeon Southeast Asia ==Dasdasi== Dasdasi was a spin-off/adaptation of Oobi made in the country of Iran for a TV channel called IRIB TV2. In Dasdasi, there is a bigger family of hand puppets: a son, a daughter, two parents, and a grandfather. The kids are counterparts to Oobi and Uma, and the grandpa is Grampu's counterpart. Kako does not have a counterpart, but the kids have neighbors and a baby cousin who usually fills the role of a close friend instead. Dasdasi was first shown on September 22, 2012, and the last episode was shown on December 20, 2012. There were 78 episodes. ==Reception== Oobi got high TV ratings for Noggin. From 2003 to 2004, Oobi and two other shows—Miffy and Connie the Cow—made Noggin's daily viewers increase by 55% over the last year. The average number of preschool- age children watching Oobi grew by 43% during the same time. The show's ratings were reported in the newspaper Multichannel News by the author Mike Reynolds, who said Noggin's popularity could be traced to its \"breakout original series Oobi.\" The first showing of the \"Uma Preschool!\" episode on September 6, 2004, got higher ratings than any other Noggin show ever did. When Oobi was still being played on TV, it had a cult following of Muppets fans and small filmmakers who made their own Oobi puppets. In 2003, the Boston Herald newspaper said that Oobi was \"already very popular\" with \"those of the Muppet generation.\" A worker for Noggin, Tom Ascheim, said in the same article that Oobi \"gets fan mail,\" and he thought it was an interesting idea for a show because \"everybody has an Oobi in their hand.\" In 2004, the magazine The Melbourne Age said that \"the show - the work of various Sesame Street alumni - is developing a strong cult following; the real Uma [Thurman] is said to be a fan of hand Uma.\" An internet catalog of Oobi puppets and eyes, OobiEyes.com, was online from 2006 to 2013. A small group of YouTube.com users who made fan films with Oobi puppets existed during the early years of the website, and OobiEyes.com held an advertising campaign with YouTube in 2008. ==In other media== *Nate Ruess's rock band, The Format, made a music video with Oobi puppets for their song \"Dog Problems\" in November 2006. The video was shown on the cable channels MTV2 and MTVU. *A talk show called The Soup showed clips from Oobi many times. Oobi was a regular part of the part called \"What Your Kids Are Watching\". In this part, the host Joel McHale made comments about funny scenes from children's shows and movies. *John Green, a writer, played Oobi in a video blog (vlog) that he posted to his YouTube channel in May 2007. The vlog was called \"Vlogbrothers: How to Write a Book Proposal\". *A runner-up of the 2009 Cannes Young Lions Competition, a TV advertising contest for kids, was a video based on Oobi called \"Let Your Hands Do the Talking.\" The video showed spoofs of celebrities played by hand puppets with \"Oo\"-themed names, just like Oobi and Uma. *In January 2014, Oobi appeared in a parody commercial called \"Farewell Elizabeth\" from Durex, a condom company. The commercial followed the story of a young man and an Oobi puppet. *A television pilot inspired by Oobi called \"Right Hand Guy\" was made for the channel Disney XD in summer 2016. It was about a boy whose hand came to life and became his friend. The director who made the pilot, Dan Lagana, showed the Oobi episode \"Babysitter!\" to the actors so that they would be familiar with it. ==References== Category:English-language television programs",
 "title": "Oobi"
}