{
 "id": "639779",
 "text": "Eduardo López de Romaña (1847-1912) was a Peruvian politician. Between 1899 and 1903, he was the 40th President of Peru. ==Early life and career== Eduardo López de Romaña was born in Arequipa as the son of Josefina Alvizuri Bustamente and Juan Manuel Lópe. He studied in Europe to become an engineer. He married Josefa Castresana in 1877. The couple had three children, Carlos, Eduardo, and Hortensia. During the Pacific War, Eduardo López de Romaña organized the Battle of Tambo valley. In that battle, he was a commander of the Vanguard division. He prevented the Chilean enemies from leaving. In 1895, he started a service that gave drinkable water to his hometown. Piérola's made a revolution earlier that year. López then decided to become a politician. He was put on Congress as a deputy of his hometown, Arequipa. He was elected to the first vice-presidency of his house, and became a minister for development in 1896. As a minister, he helped build irrigation systems, roads, mining, and industry. In 1897 he was elected Mayor of Arequipa. As a mayor, he did an excellent job, as he gave Arequipa urban planning and road works. He returned to congress again in 1898, and was a senator in 1899. After the government of Piérola, he was a presidential candidate of the civil-democratic alliance. His character traits were considered ideal for the presidency, since he was not boisterous, and had the image of working hard for his people. During his presidency, he made many changes to help the poor and foreigners. He focused on agricultural economic development. With the help of Belgium, he founded a school for agriculture. He made a new Water Code in 1902, and got rid of the law that forbid foreigners to purchase land. In addition, he got American Investors to come and create the Cerro de Pasco mining company, which boosted economic growth. A railroad was built from La Oroya to Cerro de Pasco. ==Death== Eduardo López de Romaña died May 26, 1912. ==References== Category:1847 births Category:1912 deaths Category:Presidents of Peru Category:Arequipa Region",
 "title": "Eduardo López de Romaña"
}