{
 "id": "640054",
 "text": "The following is a list of deaths that should be noted in June 2018. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==June== ===1=== * Poldy Bird, 76, Argentine writer (Cuentos para Verónica) and poet.¡Tristeza! Falleció la escritora Poly Bird * Jean-Claude Boulard, 75, French politician, Mayor of Le Mans (since 2001), Senator (2014–2017), and Deputy (1988–1993, 1997–2002).Le Mans Le maire Jean-Claude Boulard est décédé * Dhiraj Choudhury, 82, Indian painter.Strokes of brilliance: A tribute to Dhiraj Choudhury * Eddy Clearwater, 83, American blues singer (\"Soul Funky\", \"West Side Strut\", \"Boogie My Blues Away\") and guitarist (Muddy Waters), heart failure.Legendary Blues Musician Eddy Clearwater Dies at 83 * Bob Clotworthy, 87, American Hall of Fame diver, Olympic champion (1956) and bronze medalist (1952).Olympic Diving Champion Bob Clotworthy Passes Away at 87 * Jill Ker Conway, 83, Australian-American author, President of Smith College (1975–1985), National Humanities Medal recipient (2013).Smith’s first woman president, acclaimed scholar Jill Ker Conway, dies at 83 * Hilmar Hoffmann, 92, German movie and culture academic (Goethe University Frankfurt), stroke.Glaubwürdiger Streiter, begnadeter Bettler * Razan al-Najjar, 21, Palestinian nurse, shot.Gaza violence: Thousands attend funeral for Palestinian medic * John Julius Norwich, 88, British historian (Shakespeare's Kings), travel writer (Christmas Crackers) and television personality (My Word!, Round Britain Quiz), member of the House of Lords (1954–1999).John Julius Norwich, writer and television personality – obituary * William Edward Phipps, 96, American actor (Cinderella, The War of the Worlds, Five), complications from lung cancer.William Phipps, Voice of Prince Charming in 'Cinderella' and Sci-Fi Movie Star, Dies at 96 * Rockin' Rebel, 52, American professional wrestler (ECW, MEWF, CZW), suicide by gunshot.'Rockin' Rebel' Chuck Williams involved in apparent murder-suicide ===2=== * Paul D. Boyer, 99, American biochemist, Nobel Prize laureate (1997), respiratory failure.In memoriam: Paul Boyer, 99, Nobel laureate in chemistry * Irenäus Eibl- Eibesfeldt, 89, Austrian ethologist, founder of human ethology.Irenäus Eibl- Eibesfeldt gestorben * Álvaro Lapuerta, 90, Spanish politician and lawyer, member of Francoist Courts (1967–1977) and Deputy (1977–2004), complications from dementia.Muere el extesorero del PP Álvaro Lapuerta a los 90 años en Madrid * Fernando Mazariegos, 80, Guatemalan chemist and inventor (Ecofilter), Order of the Quetzal (2017), cardiac arrest.Fallece José Fernando Mazariegos, inventor del ecofiltro * Tony Morphett, 80, Australian screenwriter (Dynasty, Blue Heelers, Water Rats), heart attack.Vale: Tony Morphett * Bernard E. Trainor, 89, American Marine Corps general, military analyst (NBC) and journalist (The New York Times), laryngeal cancer.Bernard E. Trainor, 89, General Turned Military Analyst, Is Dead * Emil Wolf, 95, Czech- born American physicist (Principles of Optics), discovered the Wolf effect.In Memoriam: Emil Wolf, 1922-2018 ===3=== * Doug Altman, 69, British statistician (Statistical Methods in Medical Research), founder of EQUATOR Network, colorectal cancer.Medical Statistician Doug Altman Dies * Robert Brylewski, 57, Polish singer-songwriter (Armia, Brygada Kryzys, Izrael), colorectal cancer.\"Legenda muzyki, legenda całego pokolenia\". Robert Brylewski nie żyje * Frank Carlucci, 87, American politician, Secretary of Defense (1987–1989) and National Security Advisor (1986–1987), complications from Parkinson's disease.Frank Carlucci, Carlyle Chairman Who Led Pentagon, Dies at 87 * Jerry Hopkins, 82, American journalist (Rolling Stone) and biographer (Elvis: A Biography, No One Here Gets Out Alive), heart failure.Best-selling author Jerry Hopkins dies * Miguel Obando y Bravo, 92, Nicaraguan Roman Catholic cardinal, Archbishop of Managua (1970–2005), heart attack. * Mario Toros, 95, Italian politician, Deputy (1958–1972) and Senator (1972–1987).Lutto nel mondo della politica, è morto Mario Toros * Georg von Tiesenhausen, 104, German- American rocket scientist (Operation Paperclip), completed the first designed of a Lunar Roving Vehicle.Dr. Georg von Tiesenhausen, last of German rocket team, dies in Alabama * Kyra Petrovskaya Wayne, 99, Russian-born American author (Shurik: A Story of the Siege of Leningrad) and World War II sniper (Red Army), respiratory failure.Kyra Petrovskaya Wayne ===4=== * Dwight Clark, 61, American football player (San Francisco 49ers), Super Bowl champion (1981, 1984), complications from ALS.49ers great Dwight Clark dies at 61 * Eunice Lam, 75, Hong Kong columnist (Ming Pao) and socialite, lung cancer.Late Bruce Lee’s former sister-in-law Eunice Lam dies at age 75 * J. B. Munro, 81, New Zealand politician and disability activist, MP for Invercargill (1972–1975).John QSO (JB) Munro ===5=== * Jānis Bojārs, 62, Latvian shot putter, European championship silver medalist (1982).Miris Latvijas rekordists lodes grūšanā Jānis Bojārs * Frank Bresee, 88, American radio personality (AFN) and historian, complications from dementia.Noted Radio Actor and Historian Frank Bresee Dead at 88 * Brian Browne, 81, Canadian jazz pianist, lung and throat cancer.Canadian jazz 'original' Brian Browne dies at 81 * Pierre Carniti, 81, Italian union trader and politician, Senator (1992–1994).Morto Pierre Carniti, aveva 81 anni * Denman, 18, British racehorse, Cheltenham Gold Cup winner (2008), euthanized. * Feng Ting-kuo, 67, Taiwanese politician, Taipei City Councilor (1985–1988), member of the National Assembly (1992–1996) and Legislative Yuan (1996–2008), cardiac arrest.前親民黨立委馮定國辭世 得年67歲 * Karl Fritz Lauer, 80, Romanian-German scientist.Karl Fritz Lauer * Kate Spade, 55, American fashion designer (Kate Spade New York), suicide by hanging.Kate Spade: Fashion designer found dead in New York home ===6=== * Tinus Bosselaar, 82, Dutch footballer (national team, Sparta, Feyenoord), heart failure.Oud-international Tinus Bosselaar (82) overleden * Teddy Johnson, 97, English singer (Pearl Carr & Teddy Johnson).Teddy Johnson (United Kingdom 1958) passed away at age 98 * Mateja Matevski, 89, Macedonian poet.Preminuo Mateja Matevski * Kira Muratova, 83, Ukrainian movie director (Among Grey Stones, The Tuner), screenwriter (The Asthenic Syndrome) and actress (Brief Encounters), stroke.Умерла Кира Муратова * Ralph Santolla, 48, American metal guitarist (Deicide, Death, Iced Earth), heart attack. * Red Schoendienst, 95, American Hall of Fame baseball player (St. Louis Cardinals, New York Giants, Milwaukee Braves) and coach.Cardinals Legend Red Schoendienst Has Died * Mary Wilson, Baroness Wilson of Rievaulx, 102, British poet, Spouse of the Prime Minister (1964–1970, 1974–1976), stroke.Mary Wilson, widow of the prime minister Harold Wilson, dies aged 102 * Franz M. Wuketits, 62, Austrian biologist and epistemologist.Nachruf auf Franz M. Wuketits ===7=== * David Douglas Duncan, 102, American photojournalist.Le photographe et ami de Picasso, David Douglas Duncan, est mort à l'âge de 102 ans * Fu Da-ren, 85, Taiwanese sports broadcaster and assisted suicide activist, recipient of the Golden Bell Award (1980), assisted suicide by lethal injection.Former sports anchor Fu Da-ren ends life by assisted suicide * Arie den Hartog, 77, Dutch road bicycle racer, Milan–San Remo (1965) and Amstel Gold Race champion (1967).Décès de l'ancien vainqueuir de Milan-Sanremo et de l'Amstel Gold Race Arie den Hartog * Francis Smerecki, 68, French football player (Limoges) and manager (Guingamp, national youth team).Francis Smerecki est mort * Gena Turgel, 95, Polish author, Holocaust survivor and educator.Gena Turgel, Holocaust survivor known as Bride of Belsen, dies * Stefan Weber, 71, Austrian singer (\"Ganz Wien (ist heut' auf Heroin)\", \"All Vienna\").Der legendäre Drahdiwaberl-Chef Stefan Weber ist tot * Inés Zorreguieta, 33, Argentine public servant, sister of the Queen of the Netherlands, suicide by hanging.Queen Maxima of the Netherlands' sister found hanged in apartment in Buenos Aires ===8=== * Per Ahlmark, 79, Swedish politician and writer, Deputy Prime Minister (1976–1978) and MP (1967–1978).Per Ahlmark är död – tidigare FP-ledaren blev 79 * Anthony Bourdain, 61, American chef, author and television personality (Anthony Bourdain: No Reservations, Anthony Bourdain: Parts Unknown, The Layover), multi-Emmy Award winner, suicide by hanging.Anthony Bourdain, Chef, Travel Host and Author, Is Dead at 61 * Maria Bueno, 78, Brazilian tennis player, Wimbledon winner (1959, 1960, 1964), oral cancer and merkel-cell carcinoma.Legendary Brazilian tennis player Maria Bueno dies * Freddy Eugen, 77, Danish cyclist, esophageal cancer.Freddy Eugen Er Død * Eunice Gayson, 90, British actress (Dr. No, From Russia with Love, The Revenge of Frankenstein).Original Bond girl dies at 90 * Danny Kirwan, 68, British Hall of Fame singer-songwriter (\"Oh Well\") and guitarist (Fleetwood Mac, Tramp), pneumonia. * Liu Yichang, 99, Hong Kong writer (Tête-bêche).百岁香港作家刘以鬯去世 作品曾启发王家卫电影《花样年华》 * John McKenzie, 80, Canadian ice hockey player (Chicago Blackhawks, New York Rangers, Boston Bruins), Stanley Cup champion (1970, 1972).Bruins great McKenzie dead * Theodore J. Sophocleus, 79, American politician, member of the Maryland House of Delegates (1993–1995, since 1999), heart failure. * Thomas Stuttaford, 87, British medical columnist (The Times) and politician, MP (1970–1974).RIP Tom Stuttaford (1931-2018), The Oldie's Doctor ===9=== * Reinhard Hardegen, 105, German Nazi U-boat commander (Battle of the Atlantic) and politician, member of the Bürgerschaft (1959–1979), respiratory failure.Reinhard Hardegen im Alter von 105 Jahren gestorben ] * Fadil Vokrri, 57, Kosovar football player (Prishtina, SFR national team) and administrator, President of the Football Federation of Kosovo (since 2008), cardiac arrest.Kosovo : Fadil Vokrri, artisan de la reconnaissance de son pays par l'UEFA et la FIFA, est mort à 57 ans ===10=== * Neal E. Boyd, 42, American pop singer (\"My American Dream\") and reality show contestant (America's Got Talent), heart and kidney failure.Neal E. Boyd Dies: Former “America’s Got Talent” Winner Was 42 * Liliana Ross, 79, Italian-born Chilean actress (La Colorina, Machos, La Sexóloga), Alzheimer's disease.Muere Liliana Ross, destacada actriz de teleseries y del teatro en Chile ===11=== * Norma Bessouet, 77, Argentine artist, breast cancer.Norma Bessouet (1940-2018) * John Coates, 85, Australian Army general, Chief of Army (1990–1992). * Oscar Furlong, 90, Argentine Olympic basketball player (1948, 1952) and tennis coach (national Davis Cup team), FIBA World Cup champion (1950).Murió Oscar Furlong, campeón mundial de básquetbol con la Argentina en 1950 * Yvette Horner, 95, French accordionist.Yvette Horner obituary * Victoria Kalima, 45, Zambian politician, Minister of Gender (since 2016) and MP (since 2011). * Roman Kłosowski, 89, Polish actor (Hydrozagadka, Czterdziestolatek, Before Twilight), complications from pneumonia.Roman Kłosowski nie żyje ===12=== * Jon Hiseman, 73, English drummer (Colosseum, Colosseum II, John Mayall), brain cancer.Colosseum founder Jon Hiseman dies aged 73 * Antônio Carlos Konder Reis, 93, Brazilian politician, Senator (1963–1975), Deputy (1955–1963, 1987–1991, 1998–2003), and Governor of Santa Catarina (1975–1979, 1994–1995).Morre o ex-governador de SC Antônio Carlos Konder Reis * Jack Laxer, 91, American photographer, pneumonia.Jack Laxer, Photographer of Googie Architecture, Dies at 91 ===13=== * Arkangel de la Muerte, 51, Mexican professional wrestler (CMLL), heart attack.La lucha libre mexicana está de luto por la muerte de Arkángel * Anne Donovan, 56, American Hall of Fame basketball player and coach, Olympic champion (1984, 1988, 2008), heart failure.HOF Women's Basketball Player, Coach Anne Donovan Dies at Age 56 * D. J. Fontana, 87, American Hall of Fame rock drummer (Elvis Presley), complications from a broken hip. * Charles Vinci, 85, American weightlifter, Olympic champion (1956, 1960), congestive heart failure. ===14=== * Fazlullah, 43-44, Pakistani terrorist, Leader of Tehrik-i-Taliban Pakistan (since 2013), drone strike.Pakistan Taliban chief Mullah Fazlullah 'killed in drone attack' * Stanislav Govorukhin, 82, Russian movie director (The Meeting Place Cannot Be Changed), actor (Heads and Tails), screenwriter (Voroshilov Sharpshooter) and politician, MP (since 1993) and 2000 presidential candidate, heart attack.Умер режиссер Станислав Говорухин * Vincent R. Gray, 96, British-born New Zealand chemist and climate change critic, pneumonia.Vincent Richard Gray death notice * Mongi Kooli, 88, Tunisian politician, Minister of Health (1976–1977), complications from gallbladder cancer.Mongi Kooli n’est plus * Sonia Scurfield, 89, Canadian businesswoman and sports team owner (Calgary Flames), stomach cancer.Sonia Scurfield passes away after battle with cancer ===15=== * Leslie Grantham, 71, British actor (EastEnders, Fort Boyard, The Paradise Club) and convicted murderer, pulmonary embolism complicated by lung cancer.EastEnders actor Leslie Grantham dies * Enoch zu Guttenberg, 71, German conductor.Enoch zu Guttenberg tot * Matt Murphy, 88, American blues guitarist (The Blues Brothers), heart attack.Matt “Guitar” Murphy Dies: Blues Brothers Guitarist And Noted Sideman Was 88 ===16=== * Martin Bregman, 92, American movie producer (Scarface, Dog Day Afternoon, Carlito's Way), cerebral hemorrhage.'Scarface' Producer Martin Bregman Dies at Age 92 * Álvaro Rodríguez Ros, 82, Spanish football player (Real Oviedo, Atlético Madrid) and manager (Shelbourne).La RFEF lamenta el fallecimiento de Álvaro Rodríguez Ros \"Alvarito\" * Gennady Rozhdestvensky, 87, Russian conductor.Renowned Russian conductor Gennady Rozhdestevsky dies at 88 ===17=== * Elizabeth Brackett, 76, American television journalist (Chicago Tonight, PBS NewsHour), Peabody winner (1988), complications from a bicycle fall.Elizabeth Brackett, Award-Winning Journalist and Triathlete, Dies at 76 * Igor Muradyan, 61, Armenian political activist. * Ouk Phalla, 39, Cambodian dancer and royal consort (since 2010), car crash.Cambodia Prince Ranariddh injured and wife killed in car crash * Zhao Nanqi, 91, Korean-born Chinese general and politician, Director of the People's Liberation Army General Logistics Department (1987–1992). ===18=== * Walter Bahr, 91, American Hall of Fame soccer player (Philadelphia Nationals, national team), complications from a broken hip.Penn State legend Walter Bahr dies * Big Van Vader, 63, American professional wrestler (NJPW, WWF, WCW) and football player (Los Angeles Rams), pneumonia complicated by congestive heart failure.'Vader' Leon White dead at age 63 * Kostas Politis, 76, Greek basketball coach (national team).Kostas Politis, Architect of Greece’s 1987 Basketball Triumph, Dies at 76 * Bertha Sanseverino, 72, Uruguayan politician, member of the Departmental Board of Montevideo (1995–2004) and the Chamber of Representatives (since 2010), heart attack.Murió la diputada del Frente Amplio Bertha Sanseverino * Nathan Shaham, 93, Israeli writer (Tabula Rasa), vice- chairman of the Israel Broadcasting Authority (1977–1980), complications from Alzheimer's disease.הסופר והמחזאי נתן שחם הלך לעולמו בגיל 93 * Magalì Vettorazzo, 76, Italian Olympic pentathlete (1968).Lutto: addio a Magalì Vettorazzo * XXXTentacion, 20, American rapper (\"Look at Me\", \"Jocelyn Flores\", \"Sad!\"), shot.XXXTentacion Shot Dead ===19=== * Stanley Cavell, 91, American philosopher (Harvard University), heart failure.Stanley Cavell 1926–2018 * Ivan Drach, 81, Ukrainian poet (Protuberances of the Heart), screenwriter (Propala Hramota) and political activist, heart attack.Ukrainian poet Ivan Drach dies at 81 * Princess Elisabeth of Denmark, 83, Danish princess, first cousin of Queen Margrethe II.Princess Elisabeth of Denmark has died at the age of 83 * Hubert Green, 71, American Hall of Fame golfer, U.S. Open (1977) and PGA (1985) champion, throat cancer. * Koko, 46, American-bred Western lowland gorilla.Koko The Sign Language Gorilla Dead At 46 * Paul John Marx, 83, French-born Papua New Guinean Roman Catholic prelate, Bishop of Kerema (1988–2010), cardiomyopathy.Bishop Paul John Marx ===20=== * Ken Albiston, 91, Australian football player (Richmond, Melbourne).GF player Albiston passes away * Dante Caputo, 74, Argentine politician, President of the United Nations General Assembly (1988–1989) and Minister of Foreign Relations (1983–1989), pancreatic cancer.Murió el ex canciller Dante Caputo * Bill Hendon, 73, American activist, writer (An Enormous Crime) and politician, member of the U.S. House of Representatives from North Carolina's 11th congressional district (1981–1983, 1985–1987), complications from Parkinson's disease.Former NC congressman Bill Hendon dies at 73 * Ernie Hunt, 75, English football player (Swindon Town, Wolverhampton Wanderers, Coventry City), complications from Alzheimer's disease.Coventry City Saddened To Learn Of The Death Of Ernie Hunt * Sándor Kányádi, 89, Hungarian poet (In Contemporary Tense) and translator, respiratory tract infection.Meghalt Kányádi Sándor * Bill Speakman, 90, British soldier, recipient of the Victoria Cross. * Peter Thomson, 88, Australian golfer, five-time British Open winner (1954, 1955, 1956, 1958, and 1965), Parkinson's disease.Golf loses a legend in Peter Thomson ===21=== * Grigory Barenblatt, 90, Russian mathematician, recipient of the Timoshenko Medal (2005).Grigory I. Barenblatt * Katriina Elovirta, 57, Finnish football player and referee (FIFA, UEFA), Finnish Women's Cup champion (1990).Finnish football mourns Katriina Elovirta * Édouard-Jean Empain, 80, French-Belgian businessman (Schneider-Empain) and kidnapping victim, thyroid cancer.Baron Edouard-Jean Empain (76) is overleden * Charles Krauthammer, 68, American political commentator (Fox News), columnist (The Washington Post) and writer, Pulitzer Prize winner (1987), small intestine cancer.Charles Krauthammer, conservative commentator and Pulitzer Prize winner, dead at 68 * Jamsheed Marker, 95, Pakistani politician, Ambassador to the United States (1986–1989) and Permanent Representative to the United Nations (1990–1995).Renowned Pakistani diplomat Jamsheed Marker passes away * Armando Merodio, 82, Spanish footballer (Barakaldo, Athletic Bilbao, Real Murcia), congestive heart failure.Fallece Armando Merodio, delantero del Athletic en los 50 * Sir Laurence Street, 91, Australian judge, Chief Justice of New South Wales (1974–1988).Sir Laurence Street remembered as an outstanding legal figure ===22=== * Halina Aszkiełowicz-Wojno, 71, Polish volleyball player (national team), Olympic bronze medalist (1968).Zmarła wybitna sportsmenka Halina Aszkiełowicz-Wojno * Geoff Case, 82, Australian football player (Melbourne).Premiership player Geoff Case passes away * James S. Denton, 66, American publisher and editor (World Affairs), prostate cancer.James S. Denton, journal editor who led programs to advance democracy, dies at 66 * Nahum Korzhavin, 92, Russian-American poet.Умер поэт Наум Коржавин * Olga Krzyżanowska, 88, Polish politician, Senator (2001–2005), respiratory failure.Zmarła Olga Krzyżanowska, była wicemarszałek Sejmu, lekarka, działaczka \"Solidarności\" * Dick Leitsch, 83, American LGBT rights activist and journalist, first gay reporter of the Stonewall riots, liver cancer.Dick Leitsch, whose ‘Sip-In’ was a milestone for the gay rights movement, dies at 83 * Deanna Lund, 81, American actress (Tony Rome, Land of the Giants, Elves), pancreatic cancer.Deanna Lund, Actress on 'Land of the Giants,' Dies at 81 * Rezső Nyers, 95, Hungarian politician, Minister of Finance (1960–1962) and President of the Hungarian Socialist Workers' Party (1989).Elhunyt Nyers Rezső * Geoffrey Oryema, 65, Ugandan-born French guitarist, cardiac arrest. * Vinnie Paul, 54, American heavy metal drummer (Pantera, Damageplan, Hellyeah) and songwriter (\"I'm Broken\", \"Cemetery Gates\", \"Revolution Is My Name\"), complications from cardiomyopathy and coronary artery disease.Vinnie Paul, Legendary Drummer for Pantera & Damageplan, Dead at 54 * Sally Pierone, 97, American artist and physciatrist, renal failure.Sally Pierone (1921 - 2018) * Waldir Pires, 91, Brazilian politician, Minister of Defence (2006–2007), multiple organ failure.Waldir Pires morre aos 91 anos ===23=== * Alberto Fouilloux, 77, Chilean footballer (national team, Universidad Católica, Lille), lung cancer.Fallece el histórico ex futbolista Alberto \"Tito\" Fouillioux a los 77 años de edad * Donald Hall, 89, American poet, U.S. Poet Laureate (2006). * Kim Jong-pil, 92, South Korean politician, Prime Minister (1971–1975, 1998–2000), respiratory failure.Former Prime Minister Kim Jong-pil dies * Phan Huy Lê, 84, Vietnamese historian, heart disease.Giáo sư sử học Phan Huy Lê qua đời ở tuổi 84 * Koro Wētere, 83, New Zealand politician, MP for Western Maori (1969–1996), Minister of Māori Affairs (1984–1990).Former Labour minister Koro Wētere dies surrounded by family at Te Kuiti hospital * Violeta Rivas, 80, Argentine singer (\"Llorando me dormí\") and actress (Nacidos para cantar), stroke.Murió Violeta Rivas, a los 80 años ===24=== * Stanley Anderson, 78, American actor (Spider-Man, The Drew Carey Show, Red Dragon), brain cancer.Stanley Anderson, 'Spider-Man' and 'Seinfeld' Actor, Dies at 78 * Frank Heart, 89, American Hall of Fame computer engineer, co-developer of the IMP, melanoma.Frank Heart, Who Linked Computers Before the Internet, Dies at 89 * Darryl N. Johnson, 80, American politician, Ambassador to Lithuania (1992–1994) and Ambassador to Thailand (2001–2004).Former American Institute in Taiwan Director Darryl Johnson passes away * Josip Pirmajer, 74, Slovenian football player (Novi Sad, Partizan, national team) and manager (Vojvodina), heart attack.Odlazak Člana \"Partizanovih Beba\" Preminuo Josip Pirmajer, čovek koji nikada u karijeri nije dobio žuti karton * Pavel Vranský, 97, Czech brigadier general (Siege of Tobruk), recipient of the War Cross and Medal of Merit.Zemřel Pavel Vranský, veterán bojů u Tobruku a letec RAF * Harald von Boehmer, 75, German immunologist.Todesanzeige ===25=== * Constance Adams, 53, American architect (International Space Station) and explorer (National Geographic), colorectal cancer.National Geographic Explorer and Space Architect Dies at 53 * Štefka Drolc, 94, Slovenian actress (On Our Own Land, Blossoms in Autumn, The Tenth Brother), pneumonia.Poslovila se je Štefka Drolc, eno največjih igralskih imen pri nas * Paul Gérin-Lajoie, 98, Canadian lawyer and politician, MNA (1960–1969). * David Goldblatt, 87, South African photographer and apartheid critic, skin cancer. * Richard Benjamin Harrison, 77, American businessman and television personality (Pawn Stars), Parkinson's disease.Richard 'Old Man' Harrison of 'Pawn Stars' dead at 77 * James M. Keck, 96, American Air Force lieutenant general, complications from broken hip.James M. Keck Jun 1943 ===26=== * Big Bill Bissonnette, 81, American jazz trombonist.Big Bill Bissonnette, Musician and Founder of the Jazz Crusade Label has passed. * Andrey Dementyev, 89, Russian poet (August from Revel), signer of Letter of Forty-Two, prostate cancer.Умер поэт Андрей Дементьев * Ignatios Lappas, 72, Greek Orthodox metropolitan bishop, Metropolis of Larissa and Tyrnavos (since 1994), heart failure.Εκοιμήθη ο μητροπολίτης Λαρίσης και Τυρνάβου, Ιγνάτιος * Henri Namphy, 85, Haitian military officer and politician, President (1986–1988), lung cancer.L'ancien président haïtien, Henri Namphy, est mort * Daniel Pilon, 77, Canadian actor (Dallas, Ryan's Hope, Shoot 'Em Up), cancer.Décès de l’acteur Daniel Pilon à 77 ans * Phil Rodgers, 80, American golfer, leukemia.Phil Rodgers, gifted player and instructor, dies at 80 ===27=== * Harlan Ellison, 84, American science fiction writer (A Boy and His Dog, Spider Kiss, Web of the City) and screenwriter (Star Trek), multi-Hugo Award winner, cardiac arrest.Harlan Ellison dead at 84, acclaimed science fiction writer was known for combative style * Joe Jackson, 89, American Hall of Fame band manager (Jackson 5), patriarch of the Jackson family, pancreatic cancer.Michael Jackson’s father Joe Jackson dies aged 89 following cancer battle * Paola Paternoster, 82, Italian Olympic discus (1956, 1960) and javelin (1956) thrower, colorectal cancer.Lutto: ci ha lasciato Paola Paternoster * Steve Soto, 54, American punk guitarist (The Adolescents).Mort de Steve Soto, guitariste de The Adolescents. Une légende du punk s'en va... * Steven Hilliard Stern, 80, Canadian-born American director (The Devil and Max Devlin, Mazes and Monsters, Black Fox) and screenwriter (Running), stomach cancer.Steven Hilliard Stern, Director of 'The Devil and Max Devlin,' Dies at 80 * Vladimir Andreyevich Uspensky, 87, Russian mathematician and writer, heart failure.Умер Владимир Успенский ===28=== * Denis Akiyama, 66, Canadian actor (Pixels, X-Men, Johnny Mnemonic).Denis Van Akiyama * Goran Bunjevčević, 45, Serbian footballer (national team, Tottenham Hotspur, Red Star Belgrade), stroke.Goran Bunjevcevic dead: Former Tottenham Hotspur defender dies at the age of 45 * Domenico Losurdo, 77, Italian Marxist philosopher (Liberalism: A Counter-History) and historian, esophageal cancer.PCI Ancona: cordoglio per la scomparsa del Compagno Losurdo * Christine Nöstlinger, 81, Austrian children's writer (Fiery Frederica, Fly Away Home), Hans Christian Andersen Award winner (1984).Christine Nöstlinger ist tot * Notable people killed in the Capital Gazette shooting: ** Gerald Fischman, 61, American columnist (The Capital). ** Rob Hiaasen, 59, American journalist and newspaper editor (The Baltimore Sun, Maryland Gazette, The Capital). ** John McNamara, 56, American sports reporter (The Capital). ** Wendi Winters, 65, American journalist (The Capital). ===29=== * Kwesi Amissah-Arthur, 67, Ghanaian economist and politician, Governor of the Bank of Ghana (2009–2012) and Vice-President (2012–2017), heart attack. * Matt Cappotelli, 38, American professional wrestler (WWE), glioblastoma.Former WWE superstar from Louisville dies after second battle with brain cancer * Arvid Carlsson, 95, Swedish neuropharmacologist, Nobel Prize laureate (2000). * Steve Ditko, 90, American comic book writer and artist (Spider-Man, Doctor Strange, Blue Beetle), heart attack.Steve Ditko, Spider-Man Co-Creator and Legendary Comics Artist, Dies at 90 * Liliane Montevecchi, 85, French-Italian dancer and actress (Nine, Grand Hotel, How to Lose a Guy in 10 Days), Tony winner (1982), colorectal cancer.Tony Winner Liliane Montevecchi Passes Away at 85 * Irena Szewińska, 72, Soviet-born Polish Hall of Fame sprinter, Olympic champion (1964, 1968, 1976), endometrial cancer.Nie żyje Irena Szewińska ===30=== * Billy Kinard, 84, American football player (Green Bay Packers, Buffalo Bills) and coach (Ole Miss Rebels). * José Antonio Zaldúa, 76, Spanish footballer (F.C. Barcelona, national team, Real Valladolid).Fallece Zaldúa, exjugador del FC Barcelona ==Months== * January * February * March * April * May ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *6 Category:June 2018 events",
 "title": "Deaths in June 2018"
}