{
 "id": "64054",
 "text": "Titanic is a 1997 American epic romantic drama disaster movie. It was directed, written, and co-produced by James Cameron. The movie is about the 1912 sinking of the RMS Titanic. It stars Kate Winslet and Leonardo DiCaprio. The two play characters who are of different social classes. They fall in love after meeting aboard the ship, but it was not good for a rich girl to fall in love with a poor boy in 1912. Titanic ran for 200 days in cinemas. Production of the movie began in 1995. Cameron recorded footage of the real Titanic wreck. The reconstruction of the Titanic was created at Playas de Rosarito in Baja California. To create the sinking of the ship, scale models and computer-generated imagery were used. Paramount Pictures and 20th Century Fox helped with half of the funding for the movie. At the time when the movie was released, it was the most expensive movie ever made. It had a budget of $200 million. The movie was released on December 19, 1997. It received positive critical reviews. The movie won 11 Academy Awards, and was nominated for fourteen total Academy Awards. It was also a commercial success with a total worldwide gross of $2.196 billion. == Story == A 100-year-old woman named Rose DeWitt Bukater (Dawson) tells a story about her voyage on the famous ship Titanic. She is sharing the story with her granddaughter, Lizzy Calvert, and a crew of men who are interested in the Titanic shipwreck. The members of the crew are named Brock Lovett, Lewis Bodine, Bobby Buell, and Anatoly Mikailavich. She tells the story while on the Keldysh. The men are on the Keldysh trying to find a famous necklace called \"The Heart of the Ocean\" that they think sank with the ship. She goes on to explain the whole story from the ship's departure to the sinking of Titanic on its first (and last) voyage at 2:20 in the morning on 15 April 1912. Most of the movie is not Old Rose telling the story, but Young Rose actually living the story. On 10 April 1912, Young Rose boards a ship called Titanic with the upper-class passengers, her mother, Ruth DeWitt Bukater, and her fiancé, Caledon 'Cal' Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. Rose DeWitt Bukater who is on her way to Philadelphia to marry her rich snob fiancé Cal Hockley. Rose feels helplessly trapped by her situation and makes her way to the aft deck and thinks of suicide until she is rescued by a 20-year-old Third Class passenger artist named Jack Dawson. On her way back up, Rose slips and screams in panic. Her screams were heard by three of the ship’s crew members, who rush her to aid. They found Jack who saved Rose. Quartermaster Rowe assumes that Jack tried to assault that young woman, and summons for the Master-At-Arms. Later, Cal and his Pinkerton detective Spicer Paul Lovejoy arrive at the scene. A security guard named Walter King handcuffs Jack, but then, Rose lies to Cal that Jack saved her. Cal is therefore obliged to invite Jack to dine at their first-class table where he suffers through the slights of his snobbish hosts. In return, he spirits Rose off to third class for an evening of dancing, giving her the time of her life. Deciding to forsake her intended future all together, Rose asks Jack, who has made his living making sketches on the streets of Paris, to draw her in the nude wearing the invaluable blue diamond Cal has given her. Later on 14 April, Frederick Fleet and Reginald Lee both spotted an iceberg. He then rings the bell that William Murdoch heard, and telephones James Moody at the bridge, shouting “Iceberg, right ahead!” Titanic tries to avoid it, but it was too late. At 11:40 p.m., Titanic collided with an iceberg on a starboard side. Lovejoy slips the Heart of the Ocean into Jack’s pocket. Cal sets up Jack to be arrested, framing him for stealing the necklace. Lovejoy asks the Titanic’s Master-At-Arms to take Jack into custody in their office on E-Deck. Rose later finds and uses an axe to break Jack free, and after they ran to Boat-Deck, Rose went on a lifeboat. Unable to leave Jack behind, Rose jumped back onto the sinking Titanic. Cal became enraged, and stole Lovejoy’s gun. Rose and Jack both run from Cal at the Grand Staircase. In a deleted scene, Lovejoy searches for them while the Dining Saloon is flooding. But then, Jack fights him and smashes his head against a window. Lovejoy pushes Jack, saying “You little shit.” But then, Jack hits him again and hits his head against a pillar, saying “With compliments of the Chippewa Falls Dawsons.” Jack and Rose both ran to the stern of the Titanic. Captain Smith, who locked himself in his wheelhouse, died after the windows shattered because the water’s pressure on them was too great. With all the lifeboats gone, all passengers start panicking after the bow sank. Titanic’s propellers are now visible and they start to rise from the water. The bow is sinking deeper while the stern is rising higher into the air. At the same this time, the first funnel collapses, killing Fabrizio and several others, and the Grand Staircase's dome implodes by the pressure. Around 2:18 a.m., Titanic reaches an angle of 45 degrees. In the electric rooms, an engineer was electrocuted by a massive electric shots and Titanic’s lights instantly went out. Her steel structure fails, and Titanic breaks in half. Lovejoy then died after he fell into a huge crack. The stern rises again to 90 degrees. Titanic disappears beneath the ocean. Jack later dies of hypothermia, and his body sank to the ocean floor. The film returns to 1996, with Old Rose revealing that only 6 of 1,503 were rescued from the water. Back in 1912, Rose sees the Cunard liner RMS Carpathia. Carpathia later arrives in Titanic’s original destination in the United States, New York City. Taking Jack's last name, Rose then gives her name as Rose Dawson. Cal later commits suicide in the Wall Street Crash of 1929. Back in 1996, treasure hunter Brock Lovett and his team has reached the most famous shipwreck of all - the RMS Titanic. Emerging with a safe believed to contain a famous diamond called the \"Heart of the Ocean\", he discovers that the safe does not hold the diamond, but a drawing of a beautiful young woman wearing it. When Lovett is later interviewed on television, he shows the drawing to the cameras, and Rose Dawson Calvert, now 101, recognizes the young woman in the drawing - herself. She and her granddaughter Lizzy visit Lovett on his research ship over the wrecksite, and tells her story of the Titanic and its ill-fated maiden voyage. Rose later died in her sleep while on a ship in 1996. In Heaven (or a dream), Rose is reunited with Jack at Titanic’s Grand Staircase, applauded by those who died that night. == Main cast == Actor Role Leonardo DiCaprio Jack Dawson Kate Winslet Rose DeWitt Bukater Billy Zane Caledon Hockley Kathy Bates Margaret \"The Unsinkable Molly\" Brown Frances Fisher Ruth DeWitt Bukater Bernard Hill Captain Edward J. Smith Victor Garber Thomas Andrews Jonathan Hyde J. Bruce Ismay David Warner Spicer Lovejoy Michael Ensign Benjamin Guggenheim Danny Nucci Fabrizio De Rossi Jason Barry Tommy Ryan Bill Paxton Brock Lovett Gloria Stuart Old Rose (Rose Dawson Calvert) Suzy Amis Lizzy Calvert Lewis Abernathy Lewis Bodine Eric Braeden Colonel John Jacob Astor IV Bernard Fox Colonel Archibald Gracie IV Ewan Stewart First Officer William Murdoch Jonathan Phillips Second Officer Charles Lightoller Ioan Gruffudd Fifth Officer Harold Lowe == Production == The movie scenes of the ship's journey were taken on the Akademik Mstislav Keldysh in July 1996. Principal photography for Titanic began in September 1996. The location was at the newly built Fox Baja Studios. The poop deck was built on a move-able machine. This allow it to rise from zero to ninety degrees in a few seconds. This was used during the sinking scene of the movie. Many props were made of foam rubber. The material was used for the safety of the stuntmen.Marsh and Kirkland, pp. 130–142 On November 15, the boarding scenes were recorded. Cameron decided to build his RMS Titanic on the starboard side. This was because weather data showed north-to-south winds. This caused the funnel smoke to move in one direction.Marsh and Kirkland, pp. 52–54 ===Coach=== A full-time etiquette coach was hired. He taught the cast on the manners of the upper class during the year 1912. However, several critics noticed that some cast members were not very good. They also noticed the two main stars on the movie were not well trained.\"Quite a bit of the dialogue is peppered by vulgarities and colloquialisms that seem inappropriate to the period and place, but again seem aimed directly to the sensibilities of young American viewers.\" Cameron sketched Jack's nude portrait of Rose for the nude scene. He said \"You know what it means for her, the freedom she must be feeling. It's kind of exhilarating (happy) for that reason.\" The nude scene was DiCaprio and Winslet's first scene together. Cameron said, \"It wasn't by any kind of design, although I couldn't have designed it better. There's a nervousness and an energy and a hesitance [unsure] in them.\" This was the first scene to be recorded. Cameron said that the \"big set\" was not yet ready. The crew members had to record something so they decided to do the nude scene first. ===Incident=== An angry crew member put the dissociative drug PCP into the soup that Cameron and other members ate one night. This caused more than 50 people to be rushed to the hospital. \"There were people just rolling around, completely out of it. Some of them said they were seeing streaks and psychedelics,\" said actor Lewis Abernathy. Cameron had vomited before the drug began working. Abernathy was shocked at the way he looked. \"One eye was completely red, like the Terminator eye. A pupil, no iris, beet red. The other eye looked like he'd been sniffing glue since he was four.\" The person who poisoned the cast members was never found. ===Schedule=== Filming was scheduled to last 138 days. However, it grew to 160. Many cast members came down with colds, flu, or kidney infections. This happened during the many hours they spent in the cold water. Winslet, who also had these symptoms, decided she would not work with Cameron again unless she earned \"a lot of money\". Several other cast members left the movie. Three stuntmen broke their bones. The Screen Actors Guild decided to begin an investigation. They concluded that there was nothing unsafe going on on the set. ===Budget=== The movie's budget reached $200 million. In Sandler & Studlar (1999). Fox executives were worrying. They suggested an hour of different scenes to be removed from the three-hour movie. James Cameron did not accept this. He told Fox that if they want to remove some scenes out that they would need to fire him. The executives did not want to start over. This meant they would lose their entire investment. == Soundtrack == The soundtrack of the movie was written, orchestrated and conducted by James Horner. The soundtrack was released by Sony Classical on November 18, 1997. When the movie was released, the soundtrack topped the charts in two-dozen countries. It sold over 30 million copies. It then became one of the best-selling albums of all time. It was also the highest-selling orchestral soundtracks ever.Film Score OSTMovie.com'.' Retrieved 2010-07-28. Horner wrote the song \"My Heart Will Go On\". He wrote the song in secrecy because Cameron did not want any songs with singing in the movie.Parisi, p. 195 Céline Dion agreed to record a demonstration. Her husband, René Angélil, asked Dion many times to do it, since she did not want to record it at first. Horner waited until Cameron was in a happy mood. After playing it several times, Cameron approved of the song. However, Cameron feared that he might be criticized for \"going commercial at the end of the movie\". == 3D and re-release == James Cameron announced that Titanic was being converted to 3D.\"Titanic (1997) - IMDb\", IMDb.com, 2012, webpage: IM120338. The 3D version came out on April 6, 2012. This was the 100th anniversary of the sinking of the Titanic. It took $18 million to produce it.\"Coming in 60 weeks: 'Titanic' in 3D version\", Times of India, October 30, 2011, webpage: TOI-8599 . Retrieved March 27, 2012. The 3D conversion was done by Stereo D. Sony Music with Slam Content's Panther Records, re-worked the soundtrack.Slam Content | CrunchBase Profile The movie grossed $4.7 million on the first day of its re-release in North America. It went on to make $17.3 million during the weekend. It then became the third most-watched movie for that week. The movie earned $35.2 million worldwide. It then became the second most-watched movie for that week. The following week saw an increase of the movie's earnings. It became the number one movie for that week with $98.9 million. It was more successful in China. It earned $11.6 million on its opening day in that country. It then earned a record-breaking $67 million for that week. The re-release earned a total of $343.4 million worldwide. In China the total was at $145 million. In Canada and the United States, it made $57.8 million from those countries. == References == == Books == * * * * * * * * * * == Other websites == * * * * * * * * Titanic at The Numbers Category:1990s disaster movies Category:1997 romantic drama movies Category:1990s epic movies Category:1990s historical movies Category:Paramount Pictures movies Category:20th Century Fox movies Category:1990s American disaster movies Category:American epic movies Category:American romantic drama movies Category:Best Picture Oscar Category:Movies set on ships Category:Movies set underwater Category:Movies based on real life events Category:Movies composed by James Horner Category:Movies directed by James Cameron Category:Movies set in the 1910s Category:Movies that won the Best Original Song Academy Award Category:Movies that won the Best Visual Effects Academy Award Category:Murder-suicide in movies Category:RMS Titanic Category:Survival movies Category:3D re-releases Category:United States National Film Registry movies Category:1990s English-language movies Category:1990s American drama movies Category:1990s American romance movies",
 "title": "Titanic (1997 movie)"
}