{
 "id": "640567",
 "text": "Bunk'd (subtitled Bunk'd: Learning the Ropes in its sixth season) is an American comedy television series created by Pamela Eells O'Connell that premiered on Disney Channel on July 31, 2015. The series was originally a spinoff of Jessie from seasons 1-3, but became its own independent show starting season 4. It stars Peyton List, Karan Brar, Skai Jackson, Miranda May, Kevin Quinn, Nathan Arenas, Nina Lu, Raphael Alejandro, Will Buie Jr., Scarlett Estevez and Mallory Mahoney. == Cast and characters == === Main === * Peyton List as Emma Ross (main seasons 1–3, special guest season 5), the oldest of the Ross children and counselor-in-training in Cabin Woodchuck. She is shown to have a unique sense of fashion. She becomes manager of the camp in the third season. * Karan Brar as Ravi Ross (seasons 1–3), an extremely smart counselor-in-training in Cabin Grizzly. The second-youngest of the Ross children, he brings his pet Asian water monitor Mrs. Kipling to camp. In the third season, he becomes camp chef and lead male counselor. * Skai Jackson as Zuri Ross (seasons 1–3), a sweet yet sharp, sarcastic, and talkative girl. She is the youngest of the Ross children and is a camper in Cabin Woodchuck. * Miranda May as Lou Hockhauser, a highly enthusiastic farm girl and Emma's friend. She is the head counselor of Cabin Woodchuck and is a longtime friend of Xander. * Kevin Quinn as Xander McCormick (seasons 1–2), the popular head counselor of Cabin Grizzly and resident musician. He is a longtime friend of Lou and becomes the love interest for Emma. * Nathan Arenas as Jorge Ramirez (seasons 1–2), a bespectacled boy of Hispanic descent who is Ravi's friend and a camper in Cabin Grizzly. He is shown to be very messy, unclean, and calls people \"weird\". Jorge once claimed that he was abducted by aliens. * Nina Lu as Tiffany Chen (seasons 1–2), a young girl camper of Chinese descent whom Zuri befriends. She has an overbearing mother who expects a lot out of her. * Mallory James Mahoney as Destiny Baker (season 3–present), a girl who has won almost all of the beauty pageants she has competed in. She becomes a counselor in season 6 at Kikiwaka Ranch for Mustang cabin. * Raphael Alejandro as Matteo Sliva (season 3–5), a cautious boy who can find danger in any situation, packs spider and snake bite kits, would rather not be at Camp Kikiwaka, and speaks Portuguese when he is either scared or emotional. * Will Buie Jr. as Finn Sawyer (main season 3–5, special guest season 6), Lou's second cousin and a messy boy who does not care about hygiene, washing his clothes, or using his toothbrush. In \"By All Memes\", his last name is revealed to be Sawyer. * Israel Johnson as Noah Lambert (season 4-present), an upbeat and enthusiastic actor from Hollywood, who enjoys leading the Grizzly cabin in meditation exercises but has no camp experience. * Shelby Simmons as Ava King (season 4-5), a tenacious counselor from the big city who is unfamiliar with camp traditions. * Scarlett Estevez as Gwen Flores (main season 4, special guest season 5), a new eccentric Woodchuck camper who has spent her whole life living off the grid. * Trevor Tjordman as Parker Preston (season 5-present) * Shiloh Verrico as Winnie Webber (season 6-present) * Luke Busey as Jake (season 6-present) * Alfred Lewis as Bill Pickett (season 6-present) * Thom Rivera as The Marshal (season 6-present) === Recurring === * Mary Scheer as Gladys (seasons 1–2), the strict proprietor of Camp Kikiwaka who is a descendant of Jedediah Swearengen. She has been jealous of Christina Ross ever since Christina had \"stolen\" Morgan from her. Since then, Gladys has been unsuccessful at getting a boyfriend as most people she tries to romance end up avoiding her in various ways. By the third season, it is mentioned that Gladys has left Moose Rump for good and took the insurance money for the burned-down cabins, leaving the Ross children to gain ownership of the camp. * Tessa Netting as Hazel (seasons 1–2), the head counselor of Camp Kikiwaka and the main counselor of Weasel Cabin who was then demoted to CIT after accidentally burning down Woodchuck and Grizzly Cabins. She is the niece of Gladys (who share the same problem with men) and descendant of Jedidiah Swearengen. She seeks to steal Xander's affection away from Emma. * Casey Campbell as Murphy, the camp chef who is responsible for the terrible food and is Gladys' on and off love interest. Though gruff and gross, Murphy also ends up involved in many of the children's hijinks, All of his known cooking includes food from the garbage, roadkill, and expired (possibly due to the camps budget being poor). In season three episode \"By All Memes\", it was revealed that Murphy resigned from working at Camp Kikiwaka and got a job as a chef at Camp Champion, the rival camp, where his cooking is actually good. * Nate Stone as Timmy, a camper who was kicked out because his parents check bounced and have never got picked up by his parents, he is eager to get in the camp but they always fail resulting him to get lost in the woods and remains \"forgotten\", but at the end of season three \"Up, Up and Away\" he decided to give up and is now adopted by the Kikiwaka (the camps mythical ape like creature) and its child \"Doug\" when they're about to live in a different forest. * Lincoln Melcher as Griff (season 2), a juvenile delinquent who is placed in Grizzly Cabin as part of his juvenile hall's Nature Rehabilitation Program during the second season. He eventually decided to change his ways and is now Xander's adopted brother to avoid going back to Juvie. * Lily Mae Silverstein as Lydia (seasons 2–3), a camper from Weasel Cabin. Lydia is known for a very dark look such as black lipstick and a bandana, and her aggressive demeanor similar to her followers. === Notable guest stars === * Cameron Boyce as Luke Ross, the brother of Emma, Ravi, and Zuri who was in summer school at the start of the series and occasionally visits them. * Kevin Chamberlin as Bertram Winkle, the butler of the Ross family. * Christina Moore as Christina Ross, the mother of the Ross siblings and a Camp Kikiwaka alumni. ==Episodes== Season Episodes Originally aired (U.S. dates) Season premiere Season finale 1 21 2 21 3 16 4 30 July 24, 2020 5 21 August 6, 2021 6 30 June 10, 2022 TBD ===Season 1 (2015/16)=== * Lou Hackhauser (Miranda May), Xander McCormick (Kevin G. Quinn), Jorge Ramirez (Nathan Arenas) and Tiffany Chen (Nina Lu) joins the cast. * Luke Ross (Cameron Boyce) is no longer part of the main cast. * Kevin G. Quinn was absent for two episodes. * Nathan Arenas and Nina Lu was absent for four episodes. * Cameron Boyce makes a guest appearance in one episode \"Luke's Back\". Bunk'd season 1 episodes No. in series No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) === Season 2 (2016/17) === * Karan Brar was absent for one episode. * Kevin G. Quinn was absent for three episodes. * Nathan Arenas was absent for two episodes. * Nina Lu was absent for four episodes. * Cameron Boyce makes a guest appearance in one episode \"Luke Out Below\". Bunk'd season 2 episodes No. in series No. in season Title Directed by Written by Original air date Production code U.S. viewers (millions) ==References== Category:2010s American comedy television series Category:2015 American television series debuts Category:American television spin-offs Category:Disney Channel television series Category:English-language television programs",
 "title": "Bunk'd"
}