{
 "id": "64067",
 "text": "There are two main ways of using words to write large numbers. The American way or \"short form\" for naming large numbers is different from the European way or \"long form\" of naming large numbers. This is mainly because of American finance. Short form numbering is based on thousands and Long form is based on millions. Because of this, in Short form a billion is one thousand millions (109) while in Long form it is one million millions (1012). The change in the United Kingdom (UK) to short-form numbering happened in 1974. Today, Short form is most commonly used in most English speaking countries. ==History== ===Prehistory=== Numbers were first used by prehistoric tribes. Those prehistoric tribes invented numbers as a way to measure and calculate items, something which required counting. More advanced prehistoric tribes later invented mathematics and they started adding, subtracting, and multiplying as a way to measure and calculate more advanced and complex items and certain fields. ===Bronze Age=== Large numbers were first used by ancient civilizations such as Sumer, Ancient Egypt, Akkad, Babylonia, the Hittite Empire, Rome, and Greece, for measuring and calculating items. As civilizations grew more complex, numbers did as well. ===Renaissance=== The words billion and trillion, and millions were first written to describe extremely large numbers in 1475 by Jehan Adam. In 1484, Nicolas Chuquet used the words million, billion, trillion, and even further to write and describe much larger numbers. Adam and Chuquet both used long scale. For example, Adam's billion (Chuquet's (bi)llion) was used to write 1012. While these were the first writings that used these words, Adam and Chuquet were probably not the creators of the words. The word million comes from the Old Italian millione. These words were also probably commonly used before the books were written. ==Names for large numbers== Scientific notation American name (Short Form) Old European name (Long Form) Old-British name SI Symbol Metric prefix 100 One One One 101 Ten Ten Ten da Deca- 102 Hundred Hundred Hundred h Hecto- 103 Thousand Thousand Thousand k Kilo- 104 Ten thousand Ten thousand Ten thousand 105 Hundred thousand Hundred thousand Hundred thousand 106 Million Million Million M Mega- 109 Billion Milliard Thousand million G Giga- 1012 Trillion Billion Billion T Tera- 1015 Quadrillion Billiard Thousand billion P Peta- 1018 Quintillion Trillion Trillion E Exa- 1021 Sextillion Trilliard Thousand trillion Z Zetta- 1024 Septillion Quadrillion Quadrillion Y Yotta- 1027 Octillion Quadrilliard Thousand quadrillion R Ronna- 1030 Nonillion Quintillion Quintillion Q Quetta- 1033 Decillion Quintilliard Thousand quintillion 1036 Undecillion Sextillion Sextillion 1039 Duodecillion Sextilliard Thousand sextillion 1042 Tredecillion Septillion Septillion 1045 Quattuordecillion Septilliard Thousand septillion 1048 Quindecillion Octillion Octillion 1051 Sexdecillion Octilliard Thousand octillion 1054 Septendecillion Nonillion Nonillion 1057 Octodecillion Nonilliard Thousand nonillion 1060 Novemdecillion Decillion Decillion 1063 Vigintillion Decilliard Thousand decillion 1066 Unvigintillion Undecillion Undecillion 1069 Duovigintillion Undecilliard Thousand undecillion 1072 Trevigintillion Duodecillion Duodecillion 1075 Quattuorvigintillion Duodecilliard Thousand duodecillion 1078 Quinvigintillion Tredecillion Tredecillion 1081 Sexvigintillion Tredecilliard Thousand tredecillion 1084 Septenvigintillion Quattuordecillion Quattuordecillion 1087 Octovigintillion Quattuordecilliard Thousand quattuordecillion 1090 Novemvigintillion Quindecillion Quindecillion 1093 Trigintillion Quindecilliard Thousand quindecillion 1096 Untrigintillion Sexdecillion Sexdecillion 1099 Duotrigintillion Sexdecilliard Thousand sexdecillion 10100 Googol Googol Googol 10102 Tretrigintillion Septendecillion Septendecillion 10105 Quattuortrigintillion Septendecilliard Thousand septendecillion 10108 Quintrigintillion Octodecillion Octodecillion 10111 Sextrigintillion Octodecilliard Thousand octodecillion 10114 Septentrigintillion Novemdecillion Novemdecillion 10117 Octotrigintillion Novemdecilliard Thousand novemdecillion 10120 Novemtrigintillion Vigintillion Vigintillion 10123 Quadragintillion Vigintilliard Thousand vigintillion 10126 Unquadragintillion Unvigintillion Unvigintillion 10129 Duoquadragintillion Unvigintilliard Thousand unvigintillion 10132 Trequadragintillion Duovigintillion Duovigintillion 10135 Quattuorquadragintillion Duovigintilliard Thousand duovigintillion 10138 Quinquadragintillion Trevigintillion Trevigintillion 10141 Sexquadragintillion Trevigintilliard Thousand trevigintillion 10144 Septenquadragintillion Quattuorvigintillion Quattuorvigintillion 10147 Octoquadragintillion Quattuorvigintilliard Thousand quattuorvigintillion 10150 Novemquadragintillion Quinvigintillion Quinvigintillion 10153 Quinquagintillion Quinvigintilliard Thousand Quinvigintillion 10156 Unquinquagintillion Sexvigintillion Sexvigintillion 10159 Duoquinquagintillion Sexvigintilliard Thousand sexvigintillion 10162 Trequinquagintillion Septenvigintillion Septenvigintillion 10165 Quattuorquinquagintillion Septenvigintilliard Thousand septenvigintillion 10168 Quinquinquagintillion Octovigintillion Octovigintillion 10171 Sexquinquagintillion Octovigintilliard Thousand octovigintillion 10174 Septenquinquagintillion Novemvigintillion Novemvigintillion 10177 Octoquinquagintillion Novemvigintilliard Thousand novemvigintillion 10180 Novemquinquagintillion Trigintillion Trigintillion 10183 Sexagintillion Trigintilliard Thousand Trigintillion 10186 Unsexagintillion Untrigintillion Untrigintillion 10189 Duosexagintillion Untrigintilliard Thousand Untrigintillion 10192 Tresexagintillion Duotrigintillion Duotrigintillion 10195 Quattuorsexagintillion Duotrigintilliard Thousand duotrigintillion 10198 Quinsexagintillion Tretrigintillion Tretrigintillion 10201 Sexsexagintillion Tretrigintilliard Thousand Tretrigintillion 10204 Septensexagintillion Quattuortrigintillion Quattuortrigintillion 10207 Octosexagintillion Quattuortrigintilliard Thousand quattuortrigintillion 10210 Novemsexagintillion Quintrigintillion Quintrigintillion 10213 Septuagintillion Quintrigintilliard Thousand Quintrigintillion 10216 Unseptuagintillion Sextrigintillion Sextrigintillion 10219 Duoseptuagintillion Sextrigintilliard Thousand sextrigintillion 10222 Treseptuagintillion Septentrigintillion Septentrigintillion 10225 Quattuorseptuagintillion Septentrigintilliard Thousand septentrigintillion 10228 Quinseptuagintillion Octotrigintillion Octotrigintillion 10231 Sexseptuagintillion Octotrigintilliard Thousand octotrigintillion 10234 Septenseptuagintillion Novemtrigintillion Novemtrigintillion 10237 Octoseptuagintillion Novemtrigintilliard Thousand novemtrigintillion 10240 Novemseptuagintillion Quadragintillion Quadragintillion 10243 Octogintillion Quadragintilliard Thousand quadragintillion 10246 Unoctogintillion Unquadragintillion Unquadragintillion 10249 Duooctogintillion Unquadragintilliard Thousand unquadragintillion 10252 Treoctogintillion Duoquadragintillion Duoquadragintillion 10255 Quattuoroctogintillion Duoquadragintilliard Thousand duoquadragintillion 10258 Quinoctogintillion Trequadragintillion Trequadragintillion 10261 Sexoctogintillion Trequadragintilliard Thousand trequadragintillion 10264 Septenoctogintillion Quattuorquadragintillion Quattuorquadragintillion 10267 Octooctogintillion Quattuorquadragintilliard Thousand quattuorquadragintillion 10270 Novemoctogintillion Quinquadragintillion Quinquadragintillion 10273 Nonagintillion Quinquadragintilliard Thousand quinquadragintillion 10276 Unnonagintillion Sexquadragintillion Sexquadragintillion 10279 Duononagintillion Sexquadragintilliard Thousand sexquadragintillion 10282 Trenonagintillion Septenquadragintillion Septenquadragintillion 10285 Quattuornonagintillion Septenquadragintilliard Thousand septenquadragintillion 10288 Quinnonagintillion Octoquadragintillion Octoquadragintillion 10291 Sexnonagintillion Octoquadragintilliard Thousand octoquadragintillion 10294 Septennonagintillion Novemquadragintillion Novemquadragintillion 10297 Octononagintillion Novemquadragintilliard Thousand novemquadragintillion 10300 Novemnonagintillion Quinquagintillion Quinquagintillion 10303 Centillion Quinquagintilliard Thousand quinquagintillion 10306 Uncentillion Unquinquagintillion Unquinquagintillion 10309 Duocentillion Unquinquagintilliard Thousand unquinquagintillion 10312 Trescentillion 10315 Quattuorcentillion 10318 Quincentillion 10321 Sexcentillion 10324 Septencentillion 10327 Octocentillion 10330 Novemcentillion 10333 Decicentillion 10363 Viginticentillion 10393 Triginticentillion 10423 Quadragintacentillion 10453 Quinquagintacentillion 10483 Sexagintacentillion 10513 Septuacentillion 10543 Octogintacentillion 10573 Nonagintacentillion 10603 Ducentillion 10903 Trecentillion 101203 Quadringentillion 101503 Quingentillion 101803 Sescentillion 102103 Septingentillion 102403 Octingentillion 102703 Nongentillion 103003 Millinillion 106003 Billinillion 109003 Trillinillion 1010100 Googolplex 10101034 Skewes' Number 10Googolplex Googolplexian 10Googolplexian Googolplexianth 3↑↑...↑↑3 Graham's Number There is also the number _googol_ , which is a 1 with 100 zeros behind it (10,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000), and the number _googolplex_ , which is a 1 with a googol of zeros behind it, (10Googol). There is also Googolplexian (10Googolplex) and Googolplexianth (10Googolplexian) The name centillion was devised in the 19th century for the 100th \"illion\", being 10303 in short form and 10600 in long form, and is much bigger than googol. The number TREE 3 is so incomprehensibly big it dwarfs every other number compared to it, far surpassing even exponential growth or the number of atoms in the known universe. It originates from a mathematical game about arranging trees (graph structures) under specific rules, where the challenge is to avoid repeating any previously created tree patterns. ==Other websites== * Pointless Big Numbers * Counting Really,REALLY,REALLY High * Naming Large Numbers ==References== Category:Numbers Category:Mathematics",
 "title": "Names of large numbers"
}