{
 "id": "640658",
 "text": "Ahmed Sofa (; 30 June 194328 July 2001) was a Bangladeshi writer and novelist. Born in Chittagong, Sofa was educated at the University of Dhaka. He served many newspapers, and magazines as editors. A writer by occupation, Sofa wrote 18 non-fiction books, 8 novels, 4 collections of poems, 1 collection of short stories, and several books in other genres. In Buddhibrittir Natun Binyas (A New Mode of Intellectualism, 1972), Sofa reminded the writers and artists of their true responsibility. In Bangali Musalmaner Man (The Mind of the Bengali Muslims, 1981), Sofa surveyed the history of Bengali Muslims to explain how their identity was formed, and how they might overcome the causes of their backwardness. In Gabhi Bittanta (A Tale of a Cow, 1995), Sofa satirizes Bangladeshi university teachers engaged in party politics and corruption. Pushpa Briksa ebang Bihanga Puran (Tales of Flowers, Trees, and Birds, 1996) narrates Sofa's personal relation with birds, plants and nature. Sofa is a very influential writer in Bangladesh. Sofa was criticized for his bohemian lifestyle. He was called rebel, mad and insolent He was awarded Ekushe Padak posthumously by the Government of Bangladesh in 2002. Sofa rejected Lekhak Shibir Award in 1975, and Sa'dat Ali Akanda Award offered by Bangla Academy in 1993. == Books by Sofa == ===Essays=== *Jagrata Bangladesh (Watchful Bangladesh) (1971) *Buddhibrttir Natun Binyas (A New Mode of Intellectualism) (1972) *\"'Banglabhasha: Rajnitir Aloke (The Bengali Language: In the Light of Politics) (1975) *Bangladesher Rajnoitik Jatilata (Political Complications in Bangladesh) (1977) *Sipahi Yuddher Itihas (History of the Sepoy Movement) (1979) *Bangali Musalmaner Man (The Mind of the Bengali Muslims) (1981) *Sheikh Mjibur Rahman O Anyanya Prabantdha (Sheikh Mujibur Rahman and Other Essays) (1989) *Rajnitir Lekha (Political Writings) (1993) *Anupurbik Taslima O Anyanya Sparshakatara Prasanga (Taslima from Beginning to End and Other Sensitive Issues) (1994) *Samprathik Bibechana: Buddhibrittir Natun Binyas (Reconsideration: A New Mode of Intellectualism) (1997) *Shantichukti O Nirabachita Prabandha (Peace Treaty and Selected Essays) (1998) *Yadyapi Amar Guru (He is Still My Teacher) (1998) ===Novels=== *Surya Tumi Sathi (Sun, You are My Companion) (1967) *Omkar (The Om) (1975) *Ekjan Ali Kenaner Utthan Patan (The Rise and Fall of an Ali Kenan) (1989) *Maranbilas (Death-Wish) (1989) *Alatachakra (A Circle of Fire) (1990) *Gabhi Bittanta (A Tale of a Cow) 1994) *Ardhek Nari Ardhek Ishvari (Half Woman and Half Goddess) (1996) *Puspa Briksa ebang Bihanga Puran (Tales of Flowers, Trees and Birds) (1996) ===Short stories=== *Nihata Nakshatra (Slain Star) (1969) ===Poems=== *Jallad Samay (Time, the Hangman) (1975) *Ekti Prabin Bater Kachhe Prarthana (Prayer to an Ancient Banayan Tree) (1977) *Lenin Ghumobe Ebar (Lenin Will Sleep Now) (1999) ===Juvenile stories=== *Dolo Amar Kanakchapa (Let's Rock, My Kanakchapa) (1968) ===Nursery rhymes=== *Go-Hakim (Bovine Justice) (1977) == References == Category:1943 births Category:2001 deaths Category:Bangladeshi writers Category:People from Chittagong Division",
 "title": "Ahmed Sofa"
}