{
 "id": "64087",
 "text": "Wade–Giles (), sometimes abbreviated Wade, is a romanization system for Chinese that is based on the form of Mandarin used in Beijing. The system was produced by Thomas Wade in the mid-19th century and was fully developed in Herbert Giles's 1892 Chinese-English dictionary. Wade-Giles was the main transliteration system in the English-speaking world for much of the 20th century. It is used in several standard reference books and in all books about China that were published before 1979. It replaced the Nanjing-based romanization systems that was common until the late 19th century. Wade-Giles has been replaced by pinyin but remains commonly used in Taiwan, also known as the Republic of China. One well-known feature of Wade-Giles is that it uses the apostrophe to mark aspirated consonants, or breathy consonants, as in Ancient Greek. For example, ping in pinyin would be written as p'ing in Wade- Giles, but bing in pinyin would be written as ping. Sounds are written that way because Chinese, unlike English, has no voiced stop consonants, fricatives, or affricates. Chinese distinguishes only aspirated and unaspirated sounds. Therefore, an apostrophe, instead of a different letter, is used. However, the apostrophe was not understood well by people who do not know the Wade-Giles spelling and so many people would ignore the apostrophe when reading or copying Chinese words, which led many non-Chinese people to say Chinese words incorrectly, including Tao, tai chi, and kung fu. Wade-Giles spellings that ignore the apostrophe completely are called bastardized Wade- Giles. ==Comparison chart== == Sample sentences of Wade-Giles == Here are sample sentences written in Chinese characters, pinyin, and Wade-Giles with English translations: Chinese characters 你是北京人还是上海人？ Pinyin Nǐ shì Běijīng rén háishì Shànghǎi rén? Wade-Giles Ni3 shih4 Pei3ching1jên2 hai2shih4 Shang4hai3jên2? English Are you Pekingese or Shanghainese? Chinese characters 唐鑫鑫很喜欢去青岛喝啤酒。 Pinyin Táng Xīnxīn hěn xǐhuān qù Qīngdǎo hē píjiǔ. Wade-Giles T'ang2 Hsin1hsin1 hên3 hsi3huan1 ch‘ü4 Ch'ing1tao3 ho1 p'i2chiu3. English Tang Xinxin likes to go to Qingdao to drink beer. Chinese characters 周长平要做太极,但是他不要看电影。 Pinyin Zhōu Chángpíng yào zuò tàijí, dànshì tā bùyào kàn diànyǐng. Wade-Giles Chou1 Ch'ang2p'ing2 yao4 tso4 t'ai4chi2, tan4shih4 t'a1 pu4yao4 k'an4 tien4ying3. English Zhou Changping wants to do tai chi, but he does not want to watch movies. ==References== == Other websites == * Chinese Romanization Converter - Convert between Hanyu Pinyin, Wade-Giles, Gwoyeu Romatzyh and other known or (un-)common Romanization systems. * Wade-Giles → Zhuyin → Pinyin conversion table * Pinyin → Wade-Giles → Zhuyin conversion table * Wade-Giles → Zhuyin → Pinyin → Word list * A conversion table of Chinese provinces and cities from Wade-Giles to Pinyin * Pinyin4j: Java library supporting Chinese to Wade-Giles * Pronunciation Guide Wade-Giles",
 "title": "Wade–Giles"
}