{
 "id": "640902",
 "text": "The 2018 FIFA World Cup Final was the last game of the tournament. It happened on July 15, 2018, at Luzhniki Stadium in Moscow, Russia. The teams playing were France and Croatia. In 2018, the tournament was the 21st edition organized by FIFA, which is in charge of football competitions worldwide. A total of 32 teams took part. The winners of the World Cup would have qualified for the 2021 FIFA Confederations Cup (however FIFA got rid of the Confederations Cup later on). Russia, where the tournament was held, was automatically included, and the other 31 teams were selected through qualifying matches organized by FIFA's six groups. The teams were divided into groups for the initial matches. From these groups, 16 teams moved forward to the knockout stage. Before reaching the final, France won their group by beating two teams and drawing one. They went on to beat Argentina, Uruguay, and Belgium in the later rounds. Croatia also won their group by winning all three matches. They then won against Denmark and Russia through penalty shootouts and England in the semi-final. The final match was watched by many people both at the stadium and on TV. The referee for the match was Néstor Pitana from Argentina. France scored the first goal through a free kick that turned into an own goal by Mario Mandžukić. Croatia later equalized with a goal from Ivan Perišić. France was awarded a penalty after the referee consulted a video review. Antoine Griezmann scored from the penalty. France continued to score more goals, winning the match 4-2. This victory was France's second World Cup win. They previously won in 1998. The best player of the match was Antoine Griezmann from France, and Luka Modrić from Croatia received the Golden Ball award for being the best player of the tournament. The final was the highest-scoring one since 1966. The coach of the French team, Didier Deschamps, spoke about how his experience as a player in the 1998 World Cup was connected to the current team's success. The Croatian coach, Zlatko Dalić, congratulated France but criticized the penalty decision. In the Euro 2020 tournament that took place in 2021, both France and Croatia reached the round of 16 but were eliminated in the later stages. == Where it all started == The 2018 FIFA World Cup was the 21st time they had the World Cup. It's a big football competition for teams from different countries. They held it in Russia from 14 June to 15 July 2018. Russia didn't have to qualify because they were the hosts. Other 208 teams tried to qualify in matches organized by FIFA between June 2015 and November 2017. They split into six groups. In the main games, they put the teams into eight groups of four. Each team played against the others once. Then, the best two teams from each group went on to another stage where if they lost, they were out. In the last World Cup in 2014, Germany won. But this time, they didn't do well. They were kicked out in the group games in 2018. France had won before in 1998 when they beat Brazil. They had also come second in 2006 when Italy beat them. They reached the quarter-finals in the World Cup before this one, and they got second place in the Euro 2016. Croatia had never been in a final before. They had a good team with players like Luka Modrić, Ivan Rakitić, and Mario Mandžukić. People said this was a special generation for them. The final was the sixth time France and Croatia played against each other. France had won three times and two times they drew. The ball they used in the final game was called the Telstar Mechta. It was red and based on the Telstar 18, the ball they used in the knockout stage. The Telstar family of balls is like the 1970 Telstar one. It looks like the Brazuca ball from 2014 but a bit different. ==Road to the final== === France === France's route to the final Opponent Result 2–1 1–0 0–0 4–3 2–0 1–0 France was seen as the top choice by experts to win the 2018 World Cup. They got into the tournament by finishing first in their qualifying group, ahead of Sweden and the Netherlands. In the tournament, they were in Group C with Australia, Denmark, and Peru. Their first match was against Australia on 16 June at Kazan Arena. France won 2–1. Antoine Griezmann got the first goal from a penalty decided with video help. Australia scored a penalty too, and then France got the winning goal through an own goal by Australian defender Aziz Behich. Next, France played against Peru and won 1–0 with a goal from 19-year-old Kylian Mbappé. This made him the youngest player from France to score in a major tournament. France's win meant they could rest key players in the last group match against Denmark, which ended in a draw. This helped France win the group. In the round of 16, France played against Argentina on 30 June and won 4–3. Griezmann scored early with a penalty, and Argentina scored twice. Benjamin Pavard leveled the game, and then Mbappé scored two quick goals. Argentina got one more goal, but Mbappé's great play was highlighted. France's quarter-final match against Uruguay on 6 July ended in a 2–0 victory with goals from Raphaël Varane and Griezmann. In the semi-final, they played against Belgium and won 1–0. Samuel Umtiti scored the winning goal from a corner kick. === Croatia === Croatia's route to the final Opponent Result 2–0 3–0 2–1 1–1 2–2 2–1 In their qualifying group, Croatia came in second place after Iceland. This meant they had to play more matches to qualify. They played against Greece in these matches and won over two games. They won the first game 4-1 and the second game ended in a draw with no goals. In the main tournament, Croatia was placed in group D with Argentina, Iceland, and Nigeria. This was considered a tough group because Argentina was very skilled, and Nigeria had a strong history. In their first match, Croatia won 2-0 against Nigeria. The goals were scored by the other team accidentally putting the ball into their own goal and a penalty scored by one of Croatia's players. One of Croatia's strikers, Nikola Kalinić, didn't play in the match due to back pain. The coach, Zlatko Dalić, removed him from the team. This left Croatia with fewer players for the rest of the tournament. Croatia played against Argentina next and won 3-0. They scored their first goal when Argentina's goalkeeper made a mistake, and then scored two more goals. Argentina's captain, Lionel Messi, didn't play very well in this match. Croatia also won against Iceland with a score of 2-1. They rested some of their main players in this match because they had already qualified for the next round. In the next stage of the tournament, Croatia played against Denmark. The match ended in a 1-1 draw and they had to do a penalty shootout to decide the winner. Croatia won the shootout 3-2, with their goalkeeper making important saves. Croatia's next match was in the quarter-finals against Russia. The match ended in a 2-2 draw after extra time, and Croatia won the penalty shootout 4-3. This was the second time in the World Cup that Croatia won a penalty shootout. During the tournament, there was a situation where one of Croatia's players, Vida, shouted something that caused problems with Russian fans. In the semi-finals, Croatia played against England. They were losing initially but managed to score two goals and win the match 2-1 in extra time. By winning this match, Croatia became the first team in the World Cup to come from behind and win three times in the same tournament. ==Match== === First half === Croatia started the match at 6 pm local time (3 pm UTC) when it was 27°C (81°F) and 51% humid. There were 78,011 people in the stadium and about 1.12 billion people watching on TV around the world. The weather at Sheremetyevo International Airport, which is 30 kilometres (19 miles) away, was partly cloudy when the match began. The game was played during a small thunderstorm with visible lightning strikes. The Guardian's Barry Glendenning said that Croatia played better in the first 15 minutes. He noticed that France had trouble getting out of their own side of the field, while Croatia was in control. But, France scored first in the 18th minute. They got a free kick around 30 yards (27 metres) from the goal because Marcelo Brozović fouled Griezmann. Griezmann took the free kick and passed it into the penalty area, where Mandžukić tried to head it away, but it accidentally went into the goal. This was the first own goal in a World Cup final. N'Golo Kanté got a yellow card in the 28th minute for a foul on Perišić. A minute later, Croatia scored when Perišić was fouled 40 yards (37 metres) from the goal. Modrić kicked a free kick to the far goalpost, Vrsaljko headed it back across the goal, and Perišić kicked it low into the corner for a goal. Three minutes later, Griezmann took a corner kick into the penalty area. Matuidi tried to score with a header, but it didn't work. The France players asked for a penalty, saying Perišić touched the ball with his hand while guarding Matuidi. The video assistant referee talked to the main referee and after watching the video for a few minutes, they gave France a penalty. Griezmann took the penalty kick in the 38th minute and scored by kicking it low into the left corner. In the 43rd minute, Lucas Hernandez got a yellow card for a foul on Rebić. Then Perišić shot the ball towards the goal, but it was deflected by Paul Pogba for a corner. Just before the first half ended, Croatia had a corner kick. Rakitić kicked it into the penalty area, and Vida had a chance to score with his head, but he missed the goal. The first half ended with France leading 2–1, even though they only had one shot on goal and had the ball for 34% of the time. During halftime, experts on TV talked about whether France's goals were fair. Alan Shearer and Rio Ferdinand on BBC One said that the free kick for the first goal and the penalty for the second should not have been given. Shearer called the penalty decision \"ridiculous\" and said the handball was not on purpose. Chris Waddle, on BBC Radio 5 Live, thought the penalty was right, saying \"I would have given it. Perišić used his hand to stop the ball.\" Gabriele Marcotti of ESPN said it was a difficult decision that could have gone either way, even after watching the replay. === Second half === A group of people (pitch invaders) came onto the field during the second half of the Croatian attack, but security officers removed them. A Russian feminist rock band and protest group called Pussy Riot said they caused the interruption. Three minutes into the second half, Croatia had a chance to score. Rebić kicked the ball towards the goal from the left side, after Rakitić passed it to him. The French goalkeeper Hugo Lloris used one hand to stop the ball and sent it out for a corner. Someone named Glendenning said Croatia started the second half just like the first, very strong. In the 52nd minute, France had a chance. Mbappé got the ball from Pogba and ran down the left side. He went past Vida and shot at the goal, but Subašić saved the ball. In the 55th minute, France swapped Nzonzi in for Kanté. They scored again in the 59th minute. Pogba passed to Mbappé on the right side with a long pass. Mbappé then passed to Griezmann, who gave the ball back to Pogba outside the penalty area. Pogba shot at the goal. The ball hit a defender and came back to Pogba. He shot again, and Subašić couldn't stop it from going into the Croatian goal. France had another chance in the 63rd minute. Giroud kicked the ball towards Griezmann with a bicycle kick. Griezmann was close to the goal without anyone marking him. But Brozović took the ball from him. Two minutes later, France scored again. Mbappé kicked the ball from 25 yards away. The ball went past Vida and Subašić and into the Croatian goal. Mbappé was only the second teenager to score in a World Cup final. The first was Pelé, who did it in 1958. Croatia got their second goal in the 69th minute. Lloris couldn't control a back-pass, and Mandžukić took the loose ball and put it in the empty net with his right leg. Even though Croatia put pressure on towards the end, the match ended with France winning 4–2. This was the highest-scoring World Cup final since 1966 and the first one since 2002 that didn't need extra time to decide the winner. ===Details=== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Hugo Lloris (c) RB 2 Benjamin Pavard CB 4 Raphaël Varane CB 5 Samuel Umtiti LB 21 Lucas Hernández CM 6 Paul Pogba CM 13 N'Golo Kanté RW 10 Kylian Mbappé AM 7 Antoine Griezmann LW 14 Blaise Matuidi CF 9 Olivier Giroud Substitutions: Substitutions: Substitutions: MF 15 Steven N'Zonzi MF 12 Corentin Tolisso FW 18 Nabil Fekir Manager: Manager: Manager: Didier Deschamps Didier Deschamps Didier Deschamps Man of the Match: Antoine Griezmann (France) Assistant referees: Hernán Maidana (Argentina) Juan Pablo Belatti (Argentina) Fourth official: Björn Kuipers (Netherlands) Reserve assistant referee: Erwin Zeinstra (Netherlands) Video assistant referee: Massimiliano Irrati (Italy) Assistant video assistant referees: Mauro Vigliano (Argentina) Carlos Astroza (Chile) Danny Makkelie (Netherlands) |} Match rules *90 minutes *30 minutes of extra time if necessary *Penalty shoot-out if scores still level *Maximum of twelve named substitutes *Maximum of three substitutions, with a fourth allowed in extra time ===Statistics=== First half Statistic France Croatia Goals scored 2 1 Total shots 1 7 Shots on target 1 1 Saves 0 0 Ball possession 39% 61% Corner kicks 1 4 Fouls committed 8 7 Offsides 1 0 Yellow cards 2 0 Red cards 0 0 Second half Statistic France Croatia Goals scored 2 1 Total shots 7 8 Shots on target 5 2 Saves 1 3 Ball possession 39% 61% Corner kicks 1 2 Fouls committed 6 6 Offsides 0 1 Yellow cards 0 1 Red cards 0 0 Overall Statistic France Croatia Goals scored 4 2 Total shots 8 15 Shots on target 6 3 Saves 3 1 Ball possession 39% 61% Corner kicks 2 6 Fouls committed 14 13 Offsides 1 1 Yellow cards 2 1 Red cards 0 0 ==Related pages== * 2018 FIFA World Cup knockout stage * 2021 FIFA Confederations Cup ==References== ==Other websites== * * Official Documents and Match Documents Final Category:2018 in Russia Category:21st century in Moscow",
 "title": "2018 FIFA World Cup Final"
}