{
 "id": "64114",
 "text": "The First Nagorno-Karabakh War was a war that had happened since February 1988 until May 1994, over the small ethnic enclave of Nagorno-Karabakh in southwestern Azerbaijan, between the mostly ethnic Armenians of Nagorno- Karabakh backed by Armenia and Azerbaijan. The war originates from 1918, when the World War I came to an end and the Ottoman Empire collapsed into independent states including Armenia and Azerbaijan, while the region was recognized as part of Azerbaijan. Since then, Armenia has claimed it; Armenians have made many efforts to unify the region, although Azerbaijanis also have worked to protect their sovereignty as well as national identity. In February 1988, the war finally started, during the course of which both Armenia and Azerbaijan had utilized the legislatures to legitimize themselves while both caused pogroms as well as massacres against each other, with territorial loss of both sides alternated. Furthermore, the Soviet Union, before its collapse in 1991, and Russia had been involved with this Nagorno- Karabakh War, which had an impact on the fate of the war. The estimated death toll of the entire war is more than 30,000 on both sides. Not only Moscow but also European countries, the neighboring countries of both Armenia and Azerbaijan, the United Nations, as well as the United States, had made a variety of efforts to make a ceasefire come true. However, there were conflicting interests among them and Nagorno-Karabakh itself therefore was not the most urgent matter for them. In the end, the war ended with a Russian- brokered ceasefire that had been in effect since midnight on 11 and 12 May 1994 until April 2 2016. == Before the War Erupted == In 1918, after the World War I as well as the collapse of the Ottoman Empire, Armenia and Azerbaijan became independent, both of which claimed Nagorno-Karabakh. Consequently, the region was admitted as territory of the Azerbaijan Democratic Republic of 1918-1920 at the Versailles Peace Conference. In the early 1920s, the South Caucasus countries got annexed by the Soviet Union, whose Caucasus Bureau of the Central Committee of the Russian Communist Party of the Bolsheviks made Nagorno-Karabakh remain under the Azerbaijan Soviet Socialist Republic. In 1923, the region was accorded the autonomous status as the Nagorno-Karabakh Autonomous Oblast. However, Armenia claimed that Armenians living in Nagorno- Karabakh endured discrimination by Azerbaijanis, who also neglected the region, although the living standard there was high, compared with other mountainous regions in the Soviet Union. On 13 February 1988, Karabakh Armenians held a political rally in the Lenin Square in Yerevan, joined by several hundred people, and called for the affiliation of the region to Armenia. This political rally was held at the same time when a delegation of Karabakh Armenian artists and writers who visited and petitioned Moscow returned. Those demonstrators chanted \"Unity!\" in Armenian (\"Miatsum!\"), which was a single-word slogan of their campaign. This incident intensified antagonism among Azerbaijanis living in Nagorno-Karabakh, which accounted for about 25% of the population, and Azerbaijani residents of Shusha, which is a neighboring town of Stepanakert and 90% of the town's total population were Azerbaijanis, started to establish counter-protests. A week later on 20 February 1988, the Regional Soviet of Nagorno-Karabakh held an emergency session, in spite of the failed efforts by Boris Kevorkov, who was the leader of the Armenian Party and still loyal to Azerbaijan, and Kameran Bagirov, the first secretary of the Communist Party of Azerbaijan, to prevent the emergency session from taking place. Consequently, it adopted the resolution to place the region under the Armenian sovereignty; 110 Armenian deputies voted for this resolution while the Azerbaijani deputies did not vote. Then the Azerbaijan SSR as well as the Soviet Union condemned this decision. According to Erick Melander's \"The Nagorno-Karabakh Conflict Revisited: Was the War Inevitable?” (2001), the Soviet Union was concerned that similar desires would emerge and resultant disruptions would prevail in other parts within the state. With regard to this, Thomas de Waal reveals in \"Armenia and Azerbaijan through Peace and War\" (2013) that the Soviet Union had nineteen potential territorial disputes and Mikhail Gorbachev did not want to make concession to any of those since it would provide a precedent to energize such territorial conflicts. Gorbachev decided to intervene the affairs of Nagorno-Karabakh and sent a large delegation to the region. The Moscow delegation replaced Kevorkov with his deputy, Genrikh Pogosian, who, however, started to support the unification with Armenia because of greater respect he enjoyed from the Armenians living in the region. During these days, violence already started to happen. For instance, in the second week of the protest, Arif Yunusov, a historian who was gathering information on events in Nagorno-Karabakh, visited the Republican Hospital in Baku, where he met two Azerbaijani girls who trained in the Pedagogic Institute in Stepanakert and had been raped during an attack against their hostel. === Armenian Unification Efforts === Long before 1988 but especially in the late 1980s, the Armenian Soviet Socialist Republic had tried to put Nagorno-Karabakh under its sovereignty. Armenians sent letters and petitions to Moscow to make the unification come true, no matter when a political change happened there. According to Thomas de Waal's book \"Armenia and Azerbaijan through Peace and War\" (2013), on 3 March 1988, Gorbachev pointed out that the Politburo had failed to acknowledge such Armenian efforts as possible threats, saying \"The Central Committee received five hundred letters in the last three years on the question of Nagorno- Karabakh. Who paid any attention to this?\" The latest unification effort by Armenians previous to 1988, however, was unique in that the major organizers were Karabakh Armenians who lived outside Nagorno-Karabakh in cities such as Moscow, Yerevan and Tashkent, although its predecessors were mobilized from inside the region. One of those organizers was Igor Muradian. He brought a letter to Moscow in February 1986, which he persuaded nine members and scientists of the Soviet Armenian Communist Party to sign. Furthermore, with support from Karen Demirchian, who was the leader of the Armenian Communist Party, he tried to discredit Heidar Aliev, who was an Azerbaijani politician as well as a full member of the Politburo and most likely to disrupt the unification campaign in their view. Muradian also worked as a subversive. He got in touch with members of the Dashnaktsutiun Party (the Dashnaks) in underground cells that they have in Yerevan and abroad. The illegal Armenian nationalist party helped the unification activists to obtain small arms from abroad and form paramilitary groups in Nagorno-Karabakh. In order to legitimize their campaign, those activists adopted what they called a referendum on unification, as well. They visited farms and factories across Nagorno-Karabakh to gather signatures for it. In August 1987, this work culminated in a huge petition with more than seventy five thousand signatures from the people in the region as well as Armenia. It was sent to Moscow; then the Karabakh Armenians dispatched two delegations to the Soviet capital and appealed to the Central Committee. There were other Armenians who lobbied abroad. For instance, on 16 November 1987, Abel Aganbekian, who was a Gorbachev's main economic adviser, stated in front of French Armenians in Paris that Nagorno-Karabakh had \"greater links with Armenia than with Azerbaijan.\" Then L'Humanité, the French Communist Party's newspaper which was accessible in the Soviet Union, reported on his views and because of his position as a Gorbachev's adviser and Armenian nationality, many Azerbaijanis thought that Gorbachev was supporting Armenians. Those Azerbaijanis, however, were wrong since Gorbachev did not back Aganbekian and after all, the Armenian lobbying efforts in Moscow could not change the Politburo's mind. Although those Armenian activists were not going to obtain support from Gorbachev and the Politburo, they mobilized a huge number of people to the streets. On 20 February 1988, slightly before the Regional Soviet held the emergency session in Stepankert, 30,000 people took to the streets in Theater Square in Yerevan. Two days later, the number of protestors reached more than 100,000; it is estimated that 300,000 gathered on 23 February, which led to a transport strike declaration in Yerevan. On 25 February, perhaps almost a million people demonstrated on the streets in Yerevan. === Counter-measures by Azerbaijanis === Azerbaijanis did not overlook those Armenian efforts, though Azerbaijani nationalist movement had not been well-organized until even later. Seven days after the Armenian political rally that started on 13 February 1988, they formed their first political protest. Students, workers, and intellectuals marched down to the Supreme Soviet of the Azerbaijan SSR with placards showing that Nagorno-Karabakh was a part of Azerbaijan. For Azerbaijanis, Armenians were trying to destroy their own republic as well as national identity. Azerbaijani historians were also among the first to take a counter-measure. Bakhtiar Vahabzade, who was a poet, and Suleiman Aliarov, who was a historian, claimed in the journal Azerbaijan that Nagorno-Karabakh was historically a part of Azerbaijan, that Armenian unification efforts were based on an irredentist tradition and that Azerbaijani people were the victims. This counterargument, however, did not reach Moscow. == Onset of the War == === First Casualties === On 22 February, two days after the Regional Soviet of Nagorno-Karabakh issued the resolution, protests happened in Aghdam, from where angry protestors headed to Stepanakert. On the way they clashed policemen as well as Armenian villagers in the Armenian village, Askeran. As a consequence, two Azerbaijanis were killed, who were the first casualties in the conflict between Armenia and Azerbaijan, with both sides wounded. This killing upset residents of Aghdam and they armed themselves with stones, crossbows, staves, etc. and started to march toward Stepanakert. However, a female resident of the city, Khuraman Abasova, stopped the protestors from getting intensified by taking off her head scarf on the roof of a car in front of the crowd. For women to take off their head scarf in public is a signal that men must not go further according to the Azerbaijani custom. The situation, however, was getting worse especially after 20 February 1988. Azerbaijanis who lived in the Kafan District in southern Armenia started to flee; many of them were injured from beatings and fights although no official reports of deaths were published, and rushed to their relatives in Baku. Six days after the Regional Soviet decided to allow Nagorno-Karabakh to leave the Azerbaijan SSR, a group of forty or fifty people who were mobilized by some of the Azerbaijani refugees protested in the Lenin Square in Sumgait. The next day the demonstration culminated in several hundred people and in the evening, incidents of violence were confirmed. The local police consisted of a huge majority of Azerbaijanis and it did not function at all when violence occurred. Furthermore, in the same evening, Alexander Katusev, who was the military prosecutor of the USSR in Azerbaijan, revealed on national TV broadcast and on Baku Radio that the two Azerbaijanis were killed in Askeran five days before, which angered the crowd. === Sumgait Pogroms === The protest in Sumgait finally turned into pogroms. The rioters were roaming and looking for Armenians to attack while they destroyed windows and things, stole expensive things from houses, put automobiles on fire and even tortured and killed Armenians. Several victims were amputated so terribly that the bodies did not show who they were; those gangs stripped women naked and burned them alive, while some women were raped again and again. Most of the rioters did not arm themselves well; they overwhelmed the victims in numbers. Some Armenians battled back against those attackers and this may be why six Azerbaijanis were included in the number of casualties. However, there were not many differences between Soviet Armenians and Azerbaijanis; in Sumgait, both of the peoples basically had conversation in an almost identical Russian while many Armenians in the city spoke Azeri well, which means that it was difficult for the rioters to find whom they were going to attack. In order to catch Armenians, they asked people to pronounce the Azerbaijani word fundukh, whose pronunciation is hazelnut and Armenians were said to have difficulty in pronouncing the f, and with regard to this, Thomas de Waal states that Sumgait pogroms brought about dissolution of 'a \"Soviet\" identity.' The situation in Sumgait started to calm down on 29 February thanks to a military regiment and a curfew deployed by the Soviet Union. Consequently, by the end of the day, the official number of casualties reached thirty two, twenty six Armenians and six Azerbaijanis, and over four hundred men were arrested. Furthermore, almost all the Armenians who lived in the city, 14,000, left while thousands of Armenians living across Azerbaijan left their places, as well. == Escalating War == Gorbachev and the Politburo had made efforts for both the Armenian SSR and the Azerbaijan SSR to arrive at compromise over Nagorno-Karabakh, all of which, however, failed in the end. In May 1988, Pogosian rejected the compromise plan that gives the region the status of Autonomous Republic with some privileges such as its own government and constitution, while it remains under the Azerbaijani sovereignty. Then, on 15 June, the Supreme Soviet of Armenia issued a resolution that approved the unification of Nagorno-Karabakh. Two days later, the Supreme Soviet of Azerbaijan reemphasized that the region is a part of their sovereignty, by adopting a counter-resolution. The Regional Soviet in Stepanakert finally decided to annex the region unilaterally and rename it the Artsakh Armenian Autonomous Region. However, on July 18, the Supreme Soviet of the USSR was met in Moscow, which reaffirmed that Nagorno- Karabakh was within the Azerbaijani sovereignty. In other words, the unification of Nagorno-Karabakh was rejected by the Azerbaijan SSR as well as Gorvachev. By the end of the year, all the Azerbaijanis who had remained in Armenia were being expelled, while in the Armenian countryside, dozens of villages were abandoned by the deported; Armenian gangs attacked Azerbaijani villages where many residents had to face torture, see their houses burned, and escape on foot. Yunusov conducted a two-year-long research with Azerbaijani refugees and revealed that 216 Azerbaijanis in total died in 1998; most of them were murdered by Armenians while some were burned to death, froze to death as they fled into Azerbaijan, took their own lives or died in Azerbaijani hospitals. === On-site in Nagorno-Karabakh === Armenians living in the region accounted for approximately 75% of the total population; they protested against the Azerbaijanis by sheer force of numbers. The Armenians attacked buses and trucks that brought goods to Shusha, while in Stepanakert, Azerbaijani workers were fired. They even prevented Azerbaijani shepherds from bringing back a flock of sheep from their summer pastures. According to Thomas de Waal, when hearing of this incident, Arkady Volsky, who had worked in the region as the representative of the Politburo, said \"Sheep have no national ambitions.\" On the other hand, the Azerbaijanis took advantage of the enclave's location, which was within the Azerbaijani territory. The transportation of goods to Spepanakert, for instance, was disrupted by them. In September 1988, around Khojaly, a convoy of Soviet Union's soldiers and Armenian civilians were transporting goods to Stepanakert. Azerbaijani people attacked them, which made some angry armed Armenians storm the village and its Azerbaijani residents; two of the Soviet soldiers were confirmed dead. As a consequence, a minority of Armenians in Shusha all left while in Stepanakert, the Azerbaijani residents were deported. In the summer of 1989, Azerbaijanis went further; while almost ninety percent of railways in Armenia came from Azerbaijan, they blocked all the railways to Armenia. Because of this blockade, petrol and food were lacking in Armenia. In January the same year, Volsky-led Committee of Special Administration for Nagorny Karabakh banned political activities and installed military troops to maintain order in the region. However, on 16 August, the Armenians there formed a National Council that consisted of seventy nine members and it declared that it was controlling Nagorno-Karabakh. The Armenian Supreme Soviet, together with the National Council, adopted a resolution which confirmed the region's unification and gave the residents citizenship of the Armenian SSR. === Black January === In this way, contrary to the rejection by the Azerbaijan SSR and the Soviet Union, the Armenian SSR started to establish their own political structures in Nagorno-Karabakh. On 9 January 1990, the Armenian parliament decided to control the region under its budget system, which angered Azerbaijanis and both sides fought each other in the villages in Khanlar and Shaumian regions; consequently, four Russian soldiers dispatched by Soviet Union died. On 13 January, violence against Armenians happened in Baku; as a result, some ninety Armenians died during the Baku pogroms and thousands of surviving Armenians escaped from the city. Facing the chaos there, Gorbachev finally ordered to send the army to the city on the night of 19 and 20 January, when a massacre of the Bakuvians, known as Black January, happened. == Internationalized War == On 19 August 1991, a coup d'état happened in Moscow and Gorbachev was removed from power, but temporarily. Three days later, he restored power while the betrayers were put in jail. However, this political chaos in Moscow demoralized the Soviet Union army deployed in Nagorno-Karabakh, which now became leaderless. The chaos also helped the two Union Republics, the Armenian SSR and the Azerbaijan SSR, go further toward independence from the Soviet Union. On 30 August 1991, Azerbaijani independence was declared while on 21 September, a referendum was held in Armenia, where 95% of the citizens supported its independence. Although the conflict over Nagorno-Karabakh had been one of the internal affairs that the Soviet Union had, after their independence, it became a territorial dispute between the two independent countries. On 2 September 1991, the Regional Soviet in Stepanakert declared that Nagorno-Karabakh became independent as Nagorno Karabakh Republic. As the situation was escalating, the neighboring countries mediated a peace agreement between Republic of Armenia and Republic of Azerbaijan; Boris Yeltsin visited Stepanakert in September 1991 with the then Kazakh President, Nursultan Nazarbayev, and what is called Zheleznovodsk declaration was adopted. However, on 20 November in Martuni, Vagif Jafarov, who was the head of Shusha, as well as Russian and Kazakh officials who were in charge of the implementation of the peace agreement, were killed in a helicopter crash that was caused by Armenian fighters. In response, the Azerbaijani National Council declared on 26 November that Nagorno-Karabakh was under the Azerbaijani sovereignty and that Stepanakert was now Khankendi, although Armenians in the region held a referendum on 10 December with support from Armenia; 108,615 people voted for the region's independence, while there were no Azerbaijanis voting. == War Reaching its Climax == === Khojaly Massacre === Since the beginning of 1992, Karabakh Armenians had stormed the Azerbaijani villages around Stepanakert and deported the remaining residents. Among those Azerbaijani villages, Khojaly was the focal point since it was the center of a wide-scale Azerbaijani resettlement program. The Armenians cut off access by road to Khojaly in October 1991; consequently, the town was just there without electricity, oil and running water. Finally on the night of 25 and 26 February 1992, when was the forth anniversary of the Sumgait pogroms, the Armenians surrounded the town and attacked the Azerbaijani residents, which is known as Khojaly Massacre, the most brutal part of the war. The Khojaly Massacre enraged Azerbaijanis; they accused the government of not protecting the town and hundreds of them chose to fight voluntarily. Alongside of the massacre, from mid-February, Azerbaijan had conducted artillery bombardments against Stepanakert, from Shusha. Karabakh Azerbaijanis were forced to leave their villages and now, they gathered in Shusha as well as a few villages around it, from where they could defeat the Armenians. However, eventually in the morning of 9 May, Shusha fell into the Armenian hands and Stepanakert, now almost a ruins, was relieved. Furthermore, on 18 May, Karabakh Armenians took control of Lachin and finally opened a road to Armenia. The transportation of goods to the region was reestablished and Armenians could enter it freely for reinforcements; the Azerbaijanis who still remained there all were deported. === Russian Presence as the War Escalated === On 12 June 1992, Azerbaijan launched an offensive and overran the northern area of Nagorno-Karabakh; they took control of Shaumian and Martakert regions. The Azerbaijanis used approximately 150 armored cars and tanks that they obtained from a division of the Soviet 4th Army deployed in Ganje. Consequently, thousands of refugees fled into the south and the Russian military, which was asked to intervene, sent helicopters and conducted bombardments from the air to stop the Azerbaijani offensive. In August, however, Azerbaijani forces that placed about half of Nagorno-Karabakh under their control conducted air strikes in Stepanakert. To counter, the then Armenian President Ter-Petrosian and his allies in the region decided to conscript all the Karabakh Armanian males who were between eighteen and forty five years old into a new army. For a while, Azerbaijan had enjoyed more military advantage than Armenia. For instance, Armenia had only three divisions and no airfields since, with Republic of Turkey, a NATO member, being its neighbor, the Soviet Union saw it a possible combat zone in case of a war. On the contrary, Azerbaijan had five divisions and five airfields; moreover, it had ten thousand railroad cars of ammunition, which was 20 times more than Armenia. To catch up with Azerbaijan in terms of weaponry, Armenia called on Russia for further shipments of weapons and Russia met the Armenian needs. This situation, however, had reversed in late 1992, when the Russian military started to leave Azerbaijan and shut down its bases there while in Armenia, the Gyumri-based Soviet 7th Army chose did not leave and now worked as a Russian force. Tracing back to September 1992, when Pavel Grachev, who was the Russian Defense Minister, tried to dispatch fifty six Russian observers to the combat zone in Nagorno-Karabakh, Iskender Hamidov, the Azerbaijani Interior Minister, condemned the Russian intervention and this incident helped the Russian Defense Ministry to become pro-Armenian. === Chaos on the Azerbaijani side === Azerbaijan's political and military turmoil was also responsible. In February 1993, for example, Rahim Gaziev, who was the Azerbaijani Defense Minister, was forced to step down; before the resignation, he was leaving the soldiers alone that were deployed in Haterk and surrounded by Armenian forces. === Loss of Kelbajar === Armenia started an offensive against Kelbajar on 27 March 1993 and it was captured on 3 April. With the fall of Kelbajar, Armenia established another land route that helped them to easily access Nagorno-Karabakh. However, because Armenia seized an Azerbaijani region outside the region, international society started to take action. On 30 April 1933, the United Nations Security Council adopted a resolution on the territorial dispute for the first time; the resolution called on both Armenia and Azerbaijan to stop the war, while it demanded that Armenia immediately withdraw its forces from Kelbajar. Furthermore, Turkey decided not to open the bilateral diplomatic relations in 1992 and later, closed its border with Armenia. Consequently, Ter-Petrosian and Karabakh Armenians agreed to a ceasefire plan, stating that the Armenian forces would retreat from Kelbajar on the condition of security guarantees in Nagorno-Karabakh. Seeing political and military chaos happening in Azerbaijan, however, Armenia took back control of Martakert as well as most of the northern area of Nagorno-Karabakh on 27 June. Almost a month later on 23 July, they put Aghdam under their control. As a result, Azerbaijan lost five regions and the northern part of Nagorno- Karabakh that equal to nearly five thousand square kilometers in total. == Toward a Ceasefire == === The CSCE === Back in January 1992, the Conference for Security and Cooperation in Europe allowed many former Soviet republics including Armenia and Azerbaijan to join the organization at a meeting that was held in Prague, where the British delegation stated that now the CSCE should take action on Nagorno-Karabakh. The CSCE held another meeting in Helsinki on 24 March and there the foreign ministers decided to have a peace conference on the territorial matter. The Minsk Conference, named after the host country, Belarus, was supposed to take place with Armenia, Azerbaijan, nine other CSCE members as well as both Armenian and Azerbaijani representatives of Nagorno-Karabakh, but it never came true due to the on- going and escalated war. Instead, the Minsk Group of the CSCE was launched the same year; Mario Rafaelli, who was a former Deputy Foreign Minister of Italy, served as its first chairperson and the first negotiations took place in Rome. For both Armenia and Azerbaijan, the OSCE and the Minsk Group did not work enough. Vafa Guluzade described ambassadors from France as well as other countries as \"completely incompetent\" while Ter-Petrosian once stated that for them, Nagorno-Karabakh was not the first priority. === Competition between Washington and Moscow === The international involvement was also a risk, since the two giants would compete each other for increasing their influence over the Caucasus, rather than a ceasefire. Yeltsin issued the statement where he suggested that Russia should be able to act, with acknowledgement from reliable international organizations such as the UN, in order to maintain peace and stability in the region, a part of a former Soviet republic. For Russia, if their troops are deployed in the region for a ceasefire, they could keep their influence there. On the other hand, John Maresca, who was the U.S. representative to the Minsk Group, revealed that the Western countries had not seen the Nagorno-Karabakh War as very important. The United States hoped that Azerbaijan as well as Georgia were more independent from Russia, which was a condition where U.S. oil companies could start to invest in Azerbaijan. Ultimately, on 30 November 1993, the Minsk Group decided that direct dialogues with Armenian and Azerbaijani representatives in the region should be necessary; more visits to the region were organized. === Last Phase of the War === In August 1993, Serzh Sarkisian, who was from Nagorno-Karabakh, became the Defense Minister of Armenia, which mobilized Armenian soldiers from not only the region alone but also Armenia. On the other hand, Azerbaijan gathered almost twenty five hundred Afghan mujahadin fighters. Then in December, the war was re-intensified. The consequence of the winter between late 1993 and early 1994, however, was an estimated number of those who were killed, four thousand on the Azerbaijani side and two thousand on the Armenian side, with only small pieces of Azerbaijani territory in the north and south of Nagorno- Karabakh regained. === Ceasefire Agreed === On 4 and 5 May 1994, parliamentary delegations from the CIS countries including Armenia and Azerbaijan, held a meeting in Bishkek where Karen Baburian, who was the representative of the parliament in Nagorno-Karabakh, was also invited. There what is called the Bishkek Protocol, which urged all the parties in the region to implement a ceasefire from midnight on 8 and 9 May, was signed by Vladimir Kazimirov, the Russian envoy, and the Armenians. However, the Azerbaijani delegation did not since they had not yet obtained the approval of Aliev, who was the then President of Azerbaijan. In the end, on 9 May, Mamedrafi Mamedov, who was the Azerbaijani Defense Minister, signed; the next day, his Armenian counterpart Sarkisian did in Yerevan, as well. On 11, Samvel Babayan, who was the Karabakh Armenian commander, gave consent in Stepanakert and finally at midnight on 11 and 12, the ceasefire was put into effect. == References == == Other websites == * Military Analysis of the Nagorno-Karabakh conflict * A 2005 report on the status of undetonated land mines in Nagorno-Karabakh Category:1988 in Asia Category:1990 in Asia Category:1991 in Azerbaijan Category:1992 in Azerbaijan Category:1994 in Asia Category:Anti-Armenianism Category:Anti-Azerbaijanism Category:1990s in Armenia Category:Nagorno-Karabakh Category:Republic of Artsakh Category:1989 in Europe Category:1990 in Europe Category:1993 in Europe Category:1994 in Europe Category:1980s in Armenia Category:Wars involving Azerbaijan",
 "title": "First Nagorno-Karabakh War"
}