{
 "id": "641355",
 "text": "The 2017 UEFA Super Cup was the 42nd UEFA Super Cup final, an annual football match organised by UEFA and contested by the reigning champions of the two main European club competitions, the UEFA Champions League and the UEFA Europa League. The match featured Spanish side Real Madrid, the title holders and winners of the 2016–17 UEFA Champions League, and English side Manchester United, the winners of the 2016–17 UEFA Europa League. The match was played at the Philip II Arena in Skopje, Macedonia, on 8 August 2017, and was the first UEFA final staged in the country. Real Madrid won the match 2–1 for their fourth UEFA Super Cup title. ==Teams== Team Qualification Previous participation (bold indicates winners) Real Madrid Winners of the 2016–17 UEFA Champions League 5 (1998, 2000, 2002, 2014, 2016) Manchester United Winners of the 2016–17 UEFA Europa League 3 (1991, 1999, 2008) While the two teams had never met in the Super Cup, they had met 10 times in the European Champion Clubs' Cup/UEFA Champions League; Real Madrid have the advantage in the teams' previous meetings, with four wins, four draws and two losses. ==Match== ===Details=== The Champions League winners were called as the \"home\" team for administrative purposes. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Keylor Navas RB 2 Dani Carvajal CB 5 Raphaël Varane CB 4 Sergio Ramos (c) LB 12 Marcelo CM 10 Luka Modrić CM 14 Casemiro CM 8 Toni Kroos RF 11 Gareth Bale CF 9 Karim Benzema LF 22 Isco Substitutes: Substitutes: Substitutes: GK 13 Kiko Casilla DF 6 Nacho DF 15 Theo Hernández MF 20 Marco Asensio MF 23 Mateo Kovačić FW 7 Cristiano Ronaldo FW 17 Lucas Vázquez Manager: Manager: Manager: Zinedine Zidane Zinedine Zidane Zinedine Zidane Man of the Match: Isco (Real Madrid) Assistant referees: Elenito Di Liberatore (Italy) Mauro Tonolini (Italy) Fourth official: Clément Turpin (France) Additional assistant referees: Davide Massa (Italy) Massimiliano Irrati (Italy) Reserve assistant referee: Riccardo Di Fiore (Italy) Match rules *90 minutes. *30 minutes of extra time if necessary. *Penalty shoot-out if scores still level. *Seven named substitutes, of which up to three may be used. ===Statistics=== First half Statistic Real Madrid Manchester United Goals scored 1 0 Total shots 7 4 Shots on target 2 1 Saves 1 1 Ball possession 60% 40% Corner kicks 3 0 Fouls committed 3 9 Offsides 1 1 Yellow cards 0 1 Red cards 0 0 Second half Statistic Real Madrid Manchester United Goals scored 1 1 Total shots 9 9 Shots on target 4 5 Saves 4 3 Ball possession 59% 41% Corner kicks 5 2 Fouls committed 7 8 Offsides 0 1 Yellow cards 2 1 Red cards 0 0 Overall Statistic Real Madrid Manchester United Goals scored 2 1 Total shots 16 13 Shots on target 6 6 Saves 5 4 Ball possession 59% 41% Corner kicks 8 2 Fouls committed 10 17 Offsides 1 2 Yellow cards 2 2 Red cards 0 0 ==Related pages== *2017 UEFA Champions League Final *2017 UEFA Europa League Final ==References== 2017 Category:2017 in European football Category:Sport in North Macedonia",
 "title": "2017 UEFA Super Cup"
}