{
 "id": "641407",
 "text": "The Battle of Puebla took place on 5 May 1862, near Puebla City in Mexico. It was part of the \"Second French intervention in Mexico\". The Mexican Army won over the occupying French soldiers. The French eventually overran the Mexicans in other battles. However, the Mexican victory at Puebla against a much better equipped and larger French army gave a morale boost to the Mexican army. It also slowed the French army's advance towards Mexico City.The following sources are mentioning that Zaragoza was heading 12,000 troops : see The Cinco de Mayo and French Imperialism - HICKS Peter, Fondation Napoléon, and General Gustave Léon Niox book, Expédition du Mexique : 1861-1867, published in 1874 by Librairie militaire de J. Dumaine, p. 162 Read online == Background == The 1858–60 Mexican civil war (known as the \"Reform War\") caused major distress in Mexico's economy. When he was elected president in 1861, Benito Juárez stopped payments of interest on foreign debts for two years. At the end of October 1861 diplomats from Spain, France, and Britain met in London to form the Tripartite, or three part, Alliance. The main purpose of this alliance was to launch an allied invasion of Mexico, to take control of Veracruz, its major port. They thought this would force the Mexican government to pay money to Spain, France, and Britain again. In December 1861, Spanish troops landed in Veracruz; British and French troops came later in January. The allied forces occupied Veracruz and advanced to Orizaba. The Tripartite Alliance fell apart by early April 1862, when it became clear the French wanted to impose harsh demands on the Juarez government and provoke a war. The British and Spanish withdrew, leaving the French to march alone on Mexico City. Napoleon III wanted to set up a puppet Mexican regime, with Maximilian of Austria as Emperor of Mexico. == References == Puebla Category:19th century in Mexico Category:19th century in France Category:1862 events Category:1860s in North America",
 "title": "Battle of Puebla"
}