{
 "id": "6417",
 "text": "Richmond () is the capital of the Commonwealth of Virginia, in the United States. It is an independent city and not part of any county. The population within the city limits was 226,610 in 2020. The population of the Richmond metropolitan area was over 1.3 million — making it the third largest in Virginia. ==Location== Richmond is at the fall line of the James River, south of Washington DC, east of Charlottesville, Virginia, and west of Williamsburg, Virginia. Surrounded by Henrico and Chesterfield counties, the city is at the intersections of Interstate 95 and Interstate 64, and encircled by Interstate 295 and Virginia State Route 288. ==History== Richmond began as an important village of the Powhatan Confederacy, and was briefly settled by English colonists from Jamestown in 1609, and in 1610–11. English settlers returned to found a permanent town in 1737. It became the capital of the Colony and Dominion of Virginia in 1780. During the Revolutionary War period, the city was known for Patrick Henry's \"Give me liberty or give me death\" speech in 1775 at St. John's Church, and the passage of the Virginia Statute for Religious Freedom written by Thomas Jefferson. During the American Civil War, Richmond served as the capital of the Confederate States of America. The city entered the 20th century with one of the world's first successful electric streetcar systems. ==Economy== Richmond's economy is primarily driven by law, finance, and government. It has federal, state, and local governmental agencies in its downtown. The downtown also has offices for legal and banking firms. The city is home to both the United States Court of Appeals for the Fourth Circuit, one of 13 federal appellate courts, and the Federal Reserve Bank of Richmond, one of 12 regional Federal Reserve Banks. Dominion Resources, Carmax, Genworth Financial, and MeadWestvaco, Fortune 500 companies, along with Massey Energy and Universal Corporation, Fortune 1000 companies, are headquartered in the city.\"Fortune 500 2009: States: Virginia Companies.\" Fortune Magazine via CNN.com. May 4, 2009. Retrieved on January 21, 2010. The historic sites in the area bring tourists. ==References== Category:Former national capitals Category:County seats in Virginia Category:State capitals in the United States Category:1737 establishments Category:1730s establishments in Virginia",
 "title": "Richmond, Virginia"
}