{
 "id": "641821",
 "text": "{{Infobox chef | name = Anthony Bourdain | image = Anthony Bourdain Peabody 2014b.jpg | caption = Bourdain on May 23, 2014 | birth_name = Anthony Michael Bourdain | birth_date = | birth_place = New York City, New York, U.S. | death_date = | death_place = Kaysersberg-Vignoble, Haut-Rhin, France | cause_of_death = Suicide by hanging | resting_place = | body_discovered = Kaysersberg-Vignoble, Haut-Rhin, France | othername = Anthony Michael Bourdain Tony Bourdain Tony Michael Bourdain Anthony M. Bourdain Tony M. Bourdain | style = French; eclectic | education = Vassar College The Culinary Institute of America | ratings = | restaurants = | television = A Cook's Tour Anthony Bourdain: No Reservations The Layover Anthony Bourdain: Parts Unknown | prevrests = | awards = James Beard Foundation Award for Who's Who of Food and Beverage in America (2008) Honorary Clio Award (2012) Daytime Emmy Award for Outstanding Culinary Program (2014) James Beard Award for Television Program, On Location (2013, 2014, 2015) Primetime Emmy Award for Outstanding Informational Series Or Special (2013, 2014, 2015, 2016) PGA Producer of the Year Award in Non-Fiction Television (2014) Critics' Choice Television Award for Best Reality Show Host (2016) | known_for = A Cook's Tour Anthony Bourdain: No Reservations The Layover Anthony Bourdain: Parts Unknown | spouse = | domestic_partner = | children = 1 | parents = | salary = | signature = | website = }} Anthony Michael Bourdain (June 25, 1956 – June 8, 2018) was an American celebrity chef, author, and television personality, known as one of the most influential chefs in the world. ==Career== Bourdain first became known for his 2000 book Kitchen Confidential: Adventures in the Culinary Underbelly. His first food and world-travel television series was A Cook's Tour, which ran for 35 episodes on the Food Network from 2002 through 2003. In 2005, Bourdain began hosting the Travel Channel's culinary and cultural adventure programs Anthony Bourdain: No Reservations (2005–2012) and The Layover (2011–2013). In 2013, he switched to CNN to host Anthony Bourdain: Parts Unknown. ==Death== On June 8, 2018, Bourdain was found dead of an apparent suicide by hanging in his hotel room in Kaysersberg-Vignoble, Haut-Rhin, France. He was working on an episode of Anthony Bourdain: Parts Unknown in Strasbourg, France. He was 61 years old. At the time of his death, he was in a relationship with actress Asia Argento. ==References== ==Other websites== * Anthony Bourdain official Travel Channel website * * Anthony Bourdain at the Chef and Restaurant Database Category:1956 births Category:2018 deaths Category:American chefs Category:American television presenters Category:Clio Award winners Category:American Emmy Award winners Category:Suicide in 2018 Category:Suicides by hanging Category:Television personalities from New York (state) Category:Television personalities from New York City Category:Vassar College alumni Category:Writers from New York City",
 "title": "Anthony Bourdain"
}