{
 "id": "64181",
 "text": "A prion disease (also called transmissible spongiform encephalopathy) is a disease which is caused by prions. Prions are structurally altered versions of small proteins that are normally expressed in cells. Unlike diseases that are caused by gene mutations resulting in the expression of a mutant protein, prions are able to replicate and transmit diseases through physical contact with normal proteins. This causes a protein's structure to change from the normal state to the prion state. Unlike bacteria, prions are not considered to be alive because they do not have their own metabolism, they do not possess genes and cannot naturally reproduce outside a host cell. Prion diseases are very rare, and no treatment is available for most of them. There is no cure for prion diseases, and they will always result in death. Almost all of the known prion diseases are neurologic diseases. There are two common signs which are seen in typical prion diseases: * Ataxia or disequilibrium, is when a patient cannot stand or walk well because he cannot maintain his equilibrium or balance. This is usually because of a disease or damage in the cerebellum. * Dementia or loss of mentality, is a progressive loss of cognitive functions. == Prion diseases == Few types of prion diseases are known. The most important ones are: * Creutzfeldt-Jakob disease - A person can get the disease by eating beef infected with BSE (bovine spongiform encephalopathy), having a blood tranfusion from a person with the disease, injection of Human Growth Hormone extracted from bodies with the disease, or through infected surgical instruments. Patients suffer from ataxia and dementia and usually die after one year. * Kuru disease - This disease is seen in people living in New Guinea who eat the brains of dead people. Patients present with ataxia, dementia and inability in moving their eyes. Patients will usually die within two years. * Gerstmann-Straussler-Scheinker syndrome - This is a very rare syndrome which presents with ataxia and dementia. The patients usually die after one year. *Fatal familial insomnia is a very rare syndrome. It is 100% fatal. Victims will suffer from a severe case of insomnia before eventual death. Prion diseases are very rare. Creutzfeldt-Jakob disease makes up about 85% of the cases, but there are about 1 to 1.5 cases per one million people per year. ==Related pages== * Prion * Encephalopathy Category:Neurology Category:Dementia",
 "title": "Prion disease"
}