{
 "id": "641864",
 "text": "Every Open Eye is the second studio album by Scottish synth-pop band Chvrches. The album contains singles like \"Leave a Trace\", \"Clearest Blue\", \"Empty Threat\" and \"Bury It\". The album has been certified Silver by the BPI in the UK with sales of sixty thousand copies. == Accolades == Publication Rank List AbsolutePunk 29 Top 30 Albums of 2015 AllMusic align=center Best Pop Albums of 2015 American Songwriter 12 Top 50 Albums of 2015 Blare 40 The Top 50 Albums of 2015 CraveOnline 18 The 20 Best Albums of 2015 Diffuser 43 The 50 Best Albums of 2015 Entertainment Weekly 26 The 40 Best Albums of 2015 The Guardian 31 The Best Albums of 2015 FasterLouder 48 The 50 Best Albums of 2015 Mashable 15 The 30 Best Albums of 2015 NME 6 NME's Albums Of The Year 2015 Paste 16 The 50 Best Albums of 2015 Pigeons & Planes 33 The 50 Best Albums of 2015 Popjustice 10 The Top 33 Albums of 2015 PopMatters 42 The 80 Best Albums of 2015 Pretty Much Amazing 37 Best 50 Albums of 2015 Q 28 The 50 Best Albums of 2015 The Skinny 21 The 50 Best Albums of 2015 Spin 43 The 50 Best Albums of 2015 7 The 25 Best Pop Albums of 2015 Stereogum 33 The 50 Best Albums of 2015 Treble 25 The 50 Best Albums of 2015 Under the Radar 9 Top 100 Albums of 2015 Variance 20 The 50 Best Albums of 2015 ==Commercial performance== Every Open Eye went to number four on the UK Albums Chart, selling 15,844 copies in its first week. In the United States, the album went to number eight on the Billboard 200 with 38,000 album units in its first week of release. Also, it went to number one on both the Top Rock Albums and the Alternative Albums charts. ==Track listing== All tracks are written and produced by Chvrches. ==Personnel== Credits adapted from the liner notes of Every Open Eye. * Chvrches – production ; mixing * David Simpson – recording engineering * Mark \"Spike\" Stent – mixing * Geoff Swan – mixing assistance * Bob Ludwig – mastering * Danny Clinch – band photography * Jez Tozer – cover photography * Amy Burrows – design, art direction ==Charts== ===Weekly charts=== Chart (2015) Peak position Japanese Albums (Oricon) 53 ===Year-end charts=== Chart (2015) Position US Top Rock Albums (Billboard) 64 ==Certifications== ==References== Category:2015 albums Category:Chvrches albums",
 "title": "Every Open Eye"
}