{
 "id": "64190",
 "text": "Breast cancer is cancer in the breast. ==Statistics== Breast cancer is the fifth-most common cause of cancer death in the world. The first four are lung cancer, stomach cancer, liver cancer, and colon cancer. In 2005, breast cancer caused 502,000 deaths (7% of cancer deaths; almost 1% of all deaths) in the world. Among all women in the world, breast cancer is the most common cancer. In the United States, breast cancer is the most common cancer in women, and the second most common cause of cancer death in women (after lung cancer). In 2007, breast cancer caused about 40,910 deaths (7% of cancer deaths; almost 2% of all deaths) in the U.S. Women in the United States have a 1 in 8 chance of getting breast cancer in their lives. They have a 1 in 33 chance of death from breast cancer. There are many more people getting breast cancer since the 1970s. This is because of how people in the Western world live. Because the breast is composed of identical tissues in males and females, breast cancer also occurs in males, though it is less common. ==Treatment== When a person gets breast cancer, they can try to cure it in three ways. Doctors can cut out the cancer (mastectomy or lumpectomy). They can give the person drugs (chemotherapy). They can also try to kill the cancer with energy (radiation). If one cure does not work, they may need to try another. == Who is mainly affected by breast cancer? == The most common cancer among women is breast cancer, followed by skin cancer. It’s most likely to affect women over the age of 50. Breast cancer can also occur in men, although it is rare. Approximately 2,600 men are diagnosed with male breast cancer every year in the United States, making up less than 1% of all cases. Breast cancer is more prevalent in transgender women than in cisgender men. Furthermore, transgender men are less likely to develop breast cancer than cisgender women. == Risk breast cancer == * Age * Consuming alcohol * Dense breast tissue * Gender * Having a baby at a later age * Hormone therapy * Menopause begins late * History of breast cancer == Other websites == * ==References== Category:Medicine Category:Cancer C Category:Obstetrics and gynecology",
 "title": "Breast cancer"
}