{
 "id": "64219",
 "text": "A pandemic (from Greek παν pan all + δήμος demos people) is an epidemic (an outbreak of an infectious disease) that spreads across a large region (like a continent), or even worldwide. == Common killers and pandemics == According to the World Health Organization, a pandemic exists when three conditions have been met: * A disease emerges that is new to a population. * The agent that causes the disease infects humans, causing serious illness. * The agent spreads easily and sustainably among humans. A disease or condition is not a pandemic merely because it is widespread or kills many people. It must also be infectious. For example, cancer causes many deaths, but it is not a pandemic because it is usually not infectious. == World Health Organization pandemic phases == The World Health Organization (WHO) has developed a plan to prepare the global fight against influenza. It defines the stages of a pandemic and makes recommendations about what countries should do before and during a pandemic. The phases are: Interpandemic period: * Phase 1: No new influenza virus subtypes have been detected in humans. * Phase 2: No new influenza virus subtypes have been detected in humans. However, a variant of the virus causes disease in animals. This means there is a threat of human disease. Pandemic alert period: * Phase 3: Humans get infected with a new subtype of the flu virus. However, the virus is not spreading from person to person. * Phase 4: There are small cluster(s) of flu infection. Person-to-person spread is limited and localized. * Phase 5: There are larger cluster(s) of flu infection. Person-to-person spread is still localized. Pandemic period: * Phase 6: Pandemic: The flu has spread throughout the general population. Person-to-person spread is increased and sustained. ==Related pages== * Epidemic * List of epidemics == References == * Steward's \"The Next Global Threat: Pandemic Influenza\". == Other websites == * WHO - Authoritative source of information about global health issues * Past pandemics that ravaged Europe * CDC: Influenza Pandemic Phases * U.S. government's pandemic flu and avian flu information site",
 "title": "Pandemic"
}