{
 "id": "642268",
 "text": "The Loud House is an American animated action children's television series created by Chris Savino for Nickelodeon. The series is set in the fictional town of Royal Woods, Michigan. It chronicles the daily adventures of a 12 (originally 11)-year old boy called Lincoln living with his ten sisters and parents and Nickelodeon characters in a big house. The art style is made to resemble newspaper comic strips (since Savino is a cartoonist). The Loud House began as a two-minute short in the Nickelodeon Animated Shorts Program, which was then taken to produce a new series with 26 episodes. The first season became so popular that a second was ordered. The series also had feature film which was released on Netflix in August 2021 and a live-action television film premiered in November 2021. A spin-off series titled The Casagrandes premiered on October 14, 2019. On November 3, 2022, a live-action series premiered on Paramount+, which was called The Really Loud House. == Characters == *Lincoln Loud is the middle child and the only son of The Loud Family at age 12 (11 years old in seasons 1-4). He attends Royal Woods Middle School (as of season 5) and has previously attended Royal Woods Elementary (from seasons 1―4). He always knows how to survive the chaos of his ten sisters. He wears an orange polo shirt, blue jeans, gray socks, and white sneakers. Sometimes, he wears the same shirt, but wears blue jean shorts, white socks and black shoes. He is voiced by Sean Ryan Fox (pilot) Grant Palmer (S01E01A-S01E22B), Collin Dean (S01E23a-S03E18A), Tex Hammond (S03E18B-S04E21B), Asher Bishop (S04E22A-S06E03B), Bentley Griffin (S06E04-S07E13B), and Sawyer Cole (as of S07E15B). * Lori Loud is the oldest child of The Loud Family at age 18. She cares deeply for her siblings, but is bossy at times. She mostly spends her free time chatting with Bobby Santiago, her boyfriend, on her smartphone. She also has a habit of saying the word \"literally\". Starting with season 5, she leaves home for college. She is voiced by Catherine Taber. * Leni Loud is the second oldest child of The Loud Family at age 17. While she is very cheerful, she isn't too bright, and she is very ditzy. She is voiced by Liliana Mumy. * Luna Loud is the third oldest child of The Loud Family at age 16. She is the loudest sister and the rockstar of the family. She has a taste for all kinds on music. She is voiced by Nika Futterman. * Luan Loud is the fourth oldest child of The Loud Family at age 14. She is the comedy-loving sister of the siblings. She often annoys her family with her puns and pranks (except for her Dad, who enjoys her puns, except on April Fools' Day). She is voiced by Cristina Pucelli. * Lynn Loud Jr. is the fifth oldest child of The Loud Family at age 13. She is the toughest but roughest sister who loves to play sports. She is voiced by Jessica DiCicco. * Lucy Loud is the fifth youngest child of The Loud Family at age 9. She is a goth kid and a member of Royal Woods Elementary's morticians club. She has an interest at poetry and writing poems, and at times, she pops up out of places to scare her siblings. She has a pet bat named Fangs. She is also voiced by Jessica DiCicco. * Lana Loud is the fourth youngest child of The Loud Family at age 7. She loves being dirty, playing with her pet reptiles and playing in mud and car mechanics. She was voiced by Grey Delisle-Griffin. * Lola Loud is the third yougest child of The Loud Family at age 7. She competes in various beauty pageants, and loves tea parties. She was voiced by Grey Delisle-Griffin. * Lisa Loud is the second youngest child of The Loud Family at age 5. Although she is the second youngest, she is also the smartest and child prodigy of the family. She is voiced by Lara Jill Miller. * Lily Loud is the youngest child of The Loud Family at age 2. She often likes to take of her diaper and run around naked. Starting with season 5, she attends Baby Bunker Preschool. She is voiced by Grey Delisle-Griffin. * Clyde McBride is the only child of the McBride family at age 12 (11 years old in seasons 1-4). He is Lincoln's classmate and best friend. He has a crush on Lori, but whenever he sees her, he faints or nosebleeds. He is voiced by Caleel Harris (S01E1A-S03E07A), Andre Robinson (S03E07B-S05E26B), Jahzir Bruno (S06E01A-S06E15B), and Jaeden White (as of S06E19A). == Episodes == === Films === Title Director Release date The Loud House Movie Kyle Marshall and Amanda Rynda August 20, 2021 A Loud House Christmas Johnathan Judge November 26, 2021 A Really Haunted Loud House Johnathan Judge September 28, 2023 == Controversy == Due to some episodes including same-sex characters (Howard and Harold, Luna and Sam, and Lainey and Alice), the series was banned in other countries. This made the series entirely banned from Kenya. == Spin-off == A spin-off of the series was confirmed in 2018, the same day a fourth season was confirmed. It premiered on Nickelodeon on October 14, 2019. ==Notes== ==References== Category:2016 American television series debuts Category:Nicktoons Category:2010s American comedy television series Category:Television series about siblings Category:American animated television series Category:American children's television series Category:English-language television programs Category:Controversies Category:Flash animation Category:Traditional animation",
 "title": "The Loud House"
}