{
 "id": "642530",
 "text": "The Brazilian Space Agency (; AEB) is the Brazilian agency for the country's growing space program. It runs a spaceport at Alcântara and a launch pad at Barreira do Inferno. The Brazilian Space Agency made Brazil a part of the International Space Station mission.http://www.daviddarling.info/encyclopedia/B/Brazilian_Space_Agency.html Brazilian Space Agency ==History== The Brazil Space Program was created in 1961 and was controlled by the Brazilian military. Since the military controlled the program, research there was not much research. Some technological research was not allowed because other countries were worried about developing ICBMs with nuclear bombs. Brazil launched it's first Brazilian made satellite on February 9, 1993. The satellite was used to study space. On February 10, 1994, the Brazilian military stopped running the Space Program, which then became the Brazilian Space Agency. In 2003, a rocket exploded and killed 21 people. Brazil was able to successfully launch its first rocket into space on October 23, 2004. Several other successful launches have followed. On March 30, 2006, Brazilian astronaut Marcos Pontes became the first Brazilian and the first native Portuguese-speaking person to go to space. He stayed on the International Space Station for a week. He landed in Kazakhstan on April 8, 2006 with the astronauts on Expedition 12. ==Launch Sites== ===Alcântara Launch Center=== The Alcântara Launch Center (; CLA) is the main launch site and home to the Brazilian Space Agency. It is in the state of Maranhão. This place is good because not many people live there and it is easy to protect. It also gives good access to the sky and sea. Since it is close to the equator, it makes launching a special type of satellite that stays over one part of the earth much easier. ===Barreira do Inferno Launch Center=== The Barreira do Inferno Launch Center (; CLBI) is another launch site of the Brazilian Space Agency. It is in the state of Rio Grande do Norte. It is mostly used to launch a special type of rocket for research. It also helps the Alcântara Launch Center. ==References== ==Other websites== * Official site in Portuguese * Category:Space agencies Category:1961 establishments in Brazil",
 "title": "Brazilian Space Agency"
}