{
 "id": "642556",
 "text": "The 2019 UEFA Super Cup was the 44th UEFA Super Cup, an annual football match organised by UEFA and contested by the reigning champions of the two main European club competitions, the UEFA Champions League and the UEFA Europa League. The match was played by two English teams, Liverpool, the winners of the 2018–19 UEFA Champions League, and Chelsea, the winners of the 2018–19 UEFA Europa League. The match was played at the Vodafone Park in Istanbul, Turkey on 14 August 2019. It was the first all-English UEFA Super Cup, and the eighth overall Super Cup to feature two teams from the same country. For the first time, the video assistant referee (VAR) system was used in the UEFA Super Cup. Liverpool beat Chelsea 5-4 on penalties after finishing 2-2 at the end of 120 minutes. ==Teams== Team Qualification Previous participations (bold indicates winners) Liverpool Winners of the 2018–19 UEFA Champions League 5 (1977, 1978, 1984, 2001, 2005) Chelsea Winners of the 2018–19 UEFA Europa League 3 (1998, 2012, 2013) ==Match== ===Details=== The Champions League winners will be called as the \"home\" team for administrative purposes. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 13 Adrián RB 12 Joe Gomez CB 32 Joël Matip CB 4 Virgil van Dijk LB 26 Andrew Robertson CM 7 James Milner CM 3 Fabinho CM 14 Jordan Henderson (c) RF 15 Alex Oxlade-Chamberlain CF 11 Mohamed Salah LF 10 Sadio Mané Substitutes: Substitutes: Substitutes: GK 22 Andy Lonergan GK 62 Caoimhín Kelleher DF 51 Ki-Jana Hoever DF 66 Trent Alexander-Arnold MF 5 Georginio Wijnaldum MF 20 Adam Lallana MF 23 Xherdan Shaqiri MF 67 Harvey Elliott FW 9 Roberto Firmino FW 24 Rhian Brewster FW 27 Divock Origi Manager: Manager: Manager: Jürgen Klopp Jürgen Klopp Jürgen Klopp Man of the Match: Sadio Mané (Liverpool) Assistant referees: Manuela Nicolosi (France) Michelle O'Neill (Republic of Ireland) Fourth official: Cüneyt Çakır (Turkey) Video assistant referee: Clément Turpin (France) Assistant video assistant referees: François Letexier (France) Massimiliano Irrati (Italy) Offside video assistant referee: Mark Borsch (Germany) Match rules * 90 minutes * 30 minutes of extra time if necessary * Penalty shoot-out if scores still level * Twelve named substitutes * Maximum of three substitutions, with a fourth allowed in extra time ===Statistics=== First half Statistic Liverpool Chelsea Goals scored 0 1 Total shots 9 7 Shots on target 4 2 Saves 1 4 Ball possession 51% 49% Corner kicks 4 2 Fouls committed 1 4 Offsides 1 3 Yellow cards 0 0 Red cards 0 0 Second half Statistic Liverpool Chelsea Goals scored 1 0 Total shots 9 6 Shots on target 5 0 Saves 0 4 Ball possession 53% 47% Corner kicks 3 4 Fouls committed 4 5 Offsides 1 6 Yellow cards 1 1 Red cards 0 0 Extra time Statistic Liverpool Chelsea Goals scored 1 1 Total shots 2 7 Shots on target 2 4 Saves 3 1 Ball possession 51% 49% Corner kicks 1 1 Fouls committed 5 3 Offsides 0 2 Yellow cards 1 0 Red cards 0 0 Overall Statistic Liverpool Chelsea Goals scored 2 2 Total shots 20 20 Shots on target 11 6 Saves 4 9 Ball possession 52% 48% Corner kicks 8 7 Fouls committed 10 12 Offsides 2 11 Yellow cards 2 1 Red cards 0 0 ==Related pages== * 2019 UEFA Champions League Final * 2019 UEFA Europa League Final ==References== ==Other websites== * UEFA Super Cup (official website) 2019",
 "title": "2019 UEFA Super Cup"
}