{
 "id": "642500",
 "text": "The 1985 United States-Canada tornado outbreak occurred in the United States and Canada on May 31, 1985. In the United States, tornadoes struck the states of Ohio, Pennyslvania, and New York, and in Canada it struck in the province of Ontario. It was the largest and most intense tornado to hit this region and the worst tornado outbreak in Ohio and Pennsylvania history. == United States == === Niles, Ohio/Wheatland, Pennsylvania === The most intense tornado moved through Niles, Ohio and Wheatland, Pennyslvania and was an F5. The tornado killed 18 people and injured 310, and this remains the only F5 to strike Pennsylvania and was the most violent tornado in the United States in 1985. The Niles, Ohio/Wheatland, Pennsylvania tornado began around 6:30 p.m. and gathered strength as it headed towards Newton Falls, Ohio, producing F3 and F4 damage to the town. No deaths or injuries were reported in Newton Falls due to all residents taking shelter. Homes were also destroyed in Lordstown. It became an F5 later as it moved into Niles. Hundreds of homes in Niles were destroyed with the local shopping center leveled and several deaths occurred at the location. The tornado then crossed the state line into Pennsylvania, regaining its strength. 95% of the buildings in Wheatland were destroyed. The tornado weakened slightly as it moved towards Hermitage. 71 homes suffered damage or were destroyed. The tornado then destroyed homes in the Greenfield area before dissipating. Later on tornadoes broke out in southern New York, nobody was killed in the state but 20 people were injured in New York state. == Canada == The tornado action moved into southeastern Ontario producing 5 tornadoes between 5:40 p.m. and 6:35 p.m. Eastern Time. The tornadoes ranged from F1-F3 intensity. At the same time the Lion's Head, Ontario tornado dissipated, severe thunderstorms developed one to the east of Clinton, Ontario and another in Walkerton, Ontario area. The power was shut off in Barrie, Ontario at 4:00 p.m., as the tornado took out the local transformers. 5 people were killed in the area, including a mother and son who were killed when their home was leveled. == Death toll == In total, 41 tornadoes touched down between 3 p.m. on May 31 and 12 a.m. on June 1, killing 90 people in total across the United States and Canada, with the most deadly tornado happening in the evening hours across Ohio and Pennsylvania. The tornado that struck Niles, Ohio was the deadliest tornado in Ohio since the Xenia tornado in 1974. The outbreak was the worst tornado outbreak in the United States since the 1974 Super Outbreak. It was also the third costliest in history, with $980 million in damage in Ohio, Pennsylvania, New York, and Ontario. Category:1985 in the United States Category:1985 in Canada Category:Tornadoes in Canada Category:Tornadoes in the United States Category:1980s disasters in Canada Category:1980s in weather",
 "title": "1985 United States-Canada tornado outbreak"
}