{
 "id": "642657",
 "text": "The 2019–20 UEFA Europa League will be the 49th season of Europe's secondary club football tournament organised by UEFA, and the 11th season since it was renamed from the UEFA Cup to the UEFA Europa League. The last match will be played at the Stadion Energa Gdańsk in Gdańsk, Poland. The winners of the 2019–20 UEFA Europa League will play against the winners of the 2019–20 UEFA Champions League in the 2020 UEFA Super Cup and will also automatically qualify for the 2020–21 UEFA Champions League group stage, and if they have already qualified through their league performance, the reserved place will be given to the third-placed team of the 5th-ranked association according to next season's access list. ==Teams== The labels in the parentheses show how each team qualified for the place of its starting round: *CW: Cup winners *2nd, 3rd, 4th, 5th, 6th, etc.: League position *LC: League Cup winners *RW: Regular season winners *PW: End-of-season Europa League play-offs winners *UCL: Transferred from the Champions League **GS: Third-placed teams from the group stage **PO: Losers from the play-off round **Q3: Losers from the third qualifying round **Q2: Losers from the second qualifying round **Q1: Losers from the first qualifying round **PR: Losers from the preliminary round Note: Teams in italics may still qualify for the 2019–20 UEFA Champions League, either through domestic performance, or by winning the 2018–19 UEFA Champions League or the 2018–19 UEFA Europa League. Round of 32 Round of 32 Round of 32 Round of 32 Group stage Group stage Group stage Group stage Play-off round Play-off round Play-off round Play-off round Third qualifying round Third qualifying round Third qualifying round Third qualifying round Second qualifying round Second qualifying round Second qualifying round Second qualifying round First qualifying round First qualifying round First qualifying round First qualifying round Inter Turku Preliminary round Preliminary round Preliminary round Preliminary round ;Notes ==Related pages== *2019–20 UEFA Champions League *2020 UEFA Super Cup ==References== ==Other websites== *UEFA Europa League (official website) 2",
 "title": "2019–20 UEFA Europa League"
}