{
 "id": "64291",
 "text": "Artsakh (officially the Republic of Artsakh; ; , ), or the Nagorno-Karabakh Republic (), was a separatist state in the Nagorno-Karabakh region of the South Caucasus. It controlled its own land but is legally part of Azerbaijan. == History == Armenian people have lived there since classical antiquity. In the 11th century the Seljuk invasion swept over the Middle East, including the South Caucasus. Nomadic Turkic Oghuz Seljuk tribes, which also include the Azerbaijanis, came during this invasion. They became dominant in Nagorno- Karabakh. From this time, until the beginning of the 20th century, these tribes used Mountainous Karabakh as their summer pastures. They stayed there for about four to five months per year, and in fact, they owned the region. Armenia and Azerbaijan have disputed the area since 1918. After the Soviet Union established control over the area, in 1923 it formed the Nagorno- Karabakh Autonomous Oblast (NKAO) within the Azerbaijan SSR. In the final years of the Soviet Union, Armenia and Azerbaijan started to dispute the region again. This dispute caused the Nagorno-Karabakh War from 1993 to 1994. On 10 December 1991, a referendum (vote) was held in the NKAO and the neighbouring Shahumian region. The referendum asked voters the question: \"Should this area be independent from Azerbaijan?\" The Azerbaijani people boycotted the referendum: they protested by choosing not to vote. This resulted in a declaration of independence from Azerbaijan as the Nagorno- Karabakh Republic. The country was not recognized by any UN member state, including Armenia. There was dispute over the country's status ever since it was created. Azerbaijan claimed that they had the right to control Artsakh. Armenia supported Artsakh. From 2020 to 2023, there were multiple fights between Artsakh and Azerbaijan. On 28 September 2023, President Samvel Shahramanyan signed a deal with Azerbaijan's government to close down Artsakh's government by 1 January 2024, bringing an end to Artsakh. By October, almost all of the population had fled to Armenia. == Geography == The Artsakh Republic has a lot of mountains. It is in area, and borders Armenia, Azerbaijan, and Iran. The highest peaks in the country are Mount Mrav, , and Mount Kirs . The major rivers are the Terter and Khachen rivers. Most rivers in the country flow towards the Artsakh valley. The climate in the Artsakh Republic is mild. It is foggy for over 100 days a year. More than 36% of the country is forested. == Demographics == In 2005, the country's population was 137,737. The ethnic composition was 137,380 (99.74%) Armenians, 171 (0.12%) Russians, 21 (0.02%) Ukrainians, 6 (0.00%) Azerbaijanis and 159 (0.12%) others. The first demographic census in the Artsakh Republic took place in 1769. It was a letter from Heraclius II of Georgia to Russia's Petr Ivanovich Panin, and said, \"Seven families rule the region of Khamse. Its population is totally Armenian.\" Цагарели А. А. Грамота и гругие исторические документы XVIII столетия, относяшиеся к Грузии, Том 1. СПб 1891, ц. 434-435. This book is available online from Google BooksBournoutian, George A. Armenians and Russia, 1626-1796: A Documentary Record. Costa Mesa, CA: Mazda Publishers, 2001, page 246 In 2014, the life expectancy for males was 71.6 years, and females 76.8 years. == References == == Other websites == ; Official websites * Ministry of Foreign Affairs of the Nagorno-Karabakh Republic * Office of the Nagorno-Karabakh Republic, Washington D.C. * National Statistical Service of NKR * President of the Nagorno Karabagh Republic ; Media * Articles and Photography on Artsakh (Nagorno-Karabakh) from UK Photojournalist Russell Pollard * Artsakh World portal * Karabakh-Open * \"Azat Artsakh\", Artsakh Government's newspaper Category:2020s disestablishments in Asia Category:2023 disestablishments Category:Former countries in Asia Category:Puppet states",
 "title": "Republic of Artsakh"
}