{
 "id": "6432",
 "text": "Spanish (Spanish: español, pronounced \"Eh-span-yole\", IPA: /espaɲol/), also called Castilian, is a Romance language. It is the most spoken Romance language in the world. As of December 2021, over 489 million people in the world spoke Spanish as their first language. == Brief history == The Spanish language came from a dialect of spoken Latin. In 218 B.C., it was brought to the Iberian Peninsula by the Romans. After evolving and improving for centuries, it is the world’s 4th most spoken language today with over 489 million native speakers, after English, Mandarin Chinese, and Hindi. == Usage == Spanish is used by many people in the world today, partly because Spain traveled and colonized many different parts of the world and created many new countries and governments. The countries with Spanish as an official language are called the Hispanic countries. Most of them are in the Americas, which make up Latin America. They include the following: In North America, Central America, and the Caribbean Islands: *Costa Rica *Cuba *The Dominican Republic *Guatemala *Honduras *Mexico *Nicaragua *Panama *Puerto Rico (territory of the United States) *El Salvador *United States In the United States of America and Belize, most people use English, but Spanish is the second-most common language. In South America: *Argentina *Bolivia *Chile *Colombia *Ecuador *Paraguay *Peru *Uruguay *Venezuela Many Brazilians learn Spanish as a second language even though Brazil's official language is Portuguese. In other parts of the world: *Philippines *Equatorial Guinea *Sahrawi Arab Democratic Republic *Micronesia ==Related languages== The Spanish language was originally the language of Castile. When the Western Roman Empire collapsed, Latin changed in different ways in different provinces. The Latin spoken in the Iberian Peninsula developed into the Ibero-Romance language in the 6th century. Castilian and Portuguese became separate languages around the 12th century. In Spain, there are other languages that also came from Latin that are connected to Spanish, like Catalan, and Galician. Basque, also called Euskera or Euskara, is spoken in the Basque region of northern Spain and the southern region of France. Very different from Spanish, Basque is a language isolate since it is not known to have descended from any language family. Catalan is not a dialect of Spanish and is actually more closely related to French. == Name == Spanish is sometimes called Castellano because Castile is the region in Spain that is the origin of the language. The Spanish word for Spanish is \"español\", and the Spanish word for Castilian is \"castellano\". In the other Romance languages spoken on the Iberian Peninsula, such as Galician, Catalan, Asturian, and others, Spanish is usually called \"Castellán\" or \"Castellà\" instead of \"Spanish\". In Spain, the name of the subject in schools is \"lengua castellana\" (Castilian language). However, in the regions of Spain in which people speak only Spanish, people call their language Spanish.:en:Names given to the Spanish language In Portuguese, the word \"castelhano\" is common to mention Spanish, however, in informal language, the most preferred name for the language is \"espanhol\". Portuguese, which is spoken in Portugal and Brazil, has many similarities to Spanish. == Statistics == In 2009, for the first time in history, Spanish was the most common \"mother tongue\" language of the western world, more than English. It was also the second most common language on Earth, after Chinese. As of 2016, the three most common languages in the world are: # Chinese: Spoken by about 1.305 billion people # Spanish: Spoken by about 427 million people in 34 different countries # English: Spoken by 339 million people in 108 different countries == Related pages == * Hispanidad, people and nations that share the Spanish language and culture == References == == Other websites == * Ethnologue report for Spanish * Spanish phrasebook on Wikivoyage * The Project Gutenberg EBook of A First Spanish Reader by Erwin W. Roessler and Alfred Remy. * Spanish to English online translation",
 "title": "Spanish language"
}