{
 "id": "643396",
 "text": "The Andaman Islands are an archipelago and form a part of the Indian union territory of Andaman and Nicobar Islands. The archipelago is located in the Bay of Bengal, off the eastern coast of the country. The closest landmass to these islands is the country of Myanmar to the north of it. There are 572 islands, about 36 of which are inhabited. Andaman islands is a prime location for tourism. ==Economy== The economy of Andaman is based on fishing and agriculture. Andaman also has other natural resources. Handicrafts, timber, wildlife and the tourism are important. ===Fishing=== Being an island region, the major part of Andaman’s economy is fishing industry. Varieties used include Ocellaris Clownfish, mackerels, barracuda, mullets, tuna, sardines and flying fishes, and seashells. ===Agriculture=== Agriculture and food production changed in recent times, with the government bringing in special provisions to increase productivity on the limited land available. The crops grown here are seasonal vegetables, oilseeds, pulses, pepper, nutmeg, cinnamon, red oil, rubber, palm and cashew nuts. ===Travel=== Tourism brings lot of activity to the Andamans. Andaman is seen as a destination for honeymooners, with the next image being a tropical island with a variety of water sports available here. Also, travel has promoted other great industries in the area as well, like the banking sector, wildlife regions, handicrafts, shipping etc. About 200,000 visitors came to enjoy the beaches and tropical climate in 2010. Havelock Island and Jolly Buoy are two places famous for their pristine patches of coral, making these one of the best dive spots in the region. Havelock Island is considered a heaven for beach lovers. The Radhanagar beach on Havelock was ranked as Asia’s best by the TimeTM, and was placed amongst the top seven beaches of the world as well. ===Activities=== * Scuba diving * Snorkelling * Sea walking * Volcano tour * Glass bottom boating * Parasailing * Sea plane ride == Demographics == The total population of Andaman, as per the census of 2011, was 356,152. Of the total population 53.25% were male, and 46.75% were the female. Major languages spoken here are Hindi, Nicobarese, Bengali, Tamil, Malayalam and Telugu. The variety of languages may have been caused by the establishment of a penal colony here during british rule. The British brought in slaves and forced labourers, as well as prisoners here. These people stayed to make this place their home, resulting in such a divere population. The aboriginal Andamanese people are a small minority of the population, less than 1000 people. Out of the original ten tribes who inhabited the islands, only about four are still in existence. These are: * Great Andamanese - The original tribe of the Andamans, once with a population over 5,000, are just 52 people. They mostly speak Hindi and live in harmony with all the other residents of the islands. * Onge - A smaller tribe, now less than 100 people. * Jarawa- An old tribe that maintains their sovereign existence in the Andamans, with numbers unknown and refusal to any attempt to contact from the outside world. * Sentinelese - similar to the Jarawa tribe, but much more hostile in their nature and approach. == References == Andaman",
 "title": "Andaman Islands"
}