{
 "id": "643321",
 "text": "{{Infobox writer | name = Wheeler Winston Dixon | image = Dixon in 2016.jpg | caption = Wheeler Winston Dixon in 2016 | birth_name = | birth_date = | birth_place = | death_date = | death_place = | parents = | occupation = Movie critic, movie historian, filmmaker, scholar | nationality = American | education = | alma_mater = Rutgers University (B.A., Ph.D.) | language = English | home_town = | party = | period = | subject = Film | notableworks = A Short History of Film, A History of HorrorNote: selected as an outstanding academic book of the year in 2011 by Choice: Current Reviews for Academic Libraries Experimental filmsMuseum of Modern Art, Film Exhibitions, Joshua Siegel, April 11–12, 2003, Wheeler Winston Dixon, Accessed Aug. 25, 2013, Quote = “...Wheeler Winston Dixon ... has also been making experimental films of his own for the past three decades. ...” | partner = Gwendolyn Audrey FosterRutgers University Press, November 6, 2015, Black and White Cinema: A Short History, By Wheeler Winston Dixon, page xv, Acknowledgments, Retrieved May 29, 2016 | influenced = | awards = | signature = | website = | portaldisp = }} Wheeler Winston Dixon (born March 12, 1950) is an American movie director, critic, screenwriter, historian and scholar. He is an expert on movie history.Bill Goodykoontz, May 13, 2013, USA Today, Reloading with reboots, Accessed Aug. 25, 2013, Quote = “...A reboot is when a franchise has collapsed completely...” From 1999 to 2014, he was co-editor, along with Gwendolyn Audrey Foster, of the Quarterly Review of Film and Video. He is thought to be as a top reviewer of movies alongside Roger Ebert.Susan Wloszczyna, April 2, 2010, USA TODAY, How to watch your dragons: 10 fire-breathing beasts on DVD, Accessed Aug. 25, 2013, Quote = “Die Nibelungen: Siegfried (1924)...Highly recommended by Wheeler Winston Dixon, editor of Quarterly Review of Film and Video.” In addition, he is known as a filmmaker,The New York Times, 1991, review, Women Who Made the Movies (1991) , Accessed Aug. 25, 2013, “This documentary by filmmakers Gwendolyn Foster and Wheeler Dixon pays homage to women directors and filmmakers throughout the history of cinema...” and the Museum of Modern Art exhibited his works in 2003. Dixon taught at Rutgers University, The New School in New York, the University of Amsterdam in the Netherlands, and is currently the James E. Ryan professor emeritus professor of movie studies and English at the University of Nebraska in Lincoln. ==References== ==Other websites== * * Category:1950 births Category:Living people Category:American historians Category:Educators from New Jersey Category:American movie critics Category:American editors Category:Movie directors from New Jersey Category:Screenwriters from New Jersey Category:Journalists from New Jersey Category:Rutgers University faculty",
 "title": "Wheeler Winston Dixon"
}