{
 "id": "643454",
 "text": "Jan Mayensfield () is an aerodrome or airfield in Jan Mayen, Norway. It is run by the Norwegian Armed Forces. The aerodrome serves both the civilians and the military on the island. The airfield was opened in 1960.Barr (1991): 245 The runway is made of dirt and is long. The runway is labeled 06-24. Eight times a year, a Lockheed C-130 Hercules from the 335 Squadron from Bodø Main Air Station brings supplies and new people. Landing safely can be difficult because the volcano nearby called Beerenberg causes wind vortexes. == History == The airfield was made by the North Atlantic Treaty Organization (NATO) and the Norwegian Armed Forces. They started to work on the airfield in 1958. To make the work easier, the workers made the runway from a existing dirt road. The first airplane to land at the airfield was a Consolidated PBY Catalina on September 17, 1960. The first non-military aircraft to land at the airfield was a Douglas DC-4 which brought journalists on October 29, 1961. Grumman HU-16 Albatrosses and the Douglas DC-6s have also landed at the airfield. The airfield was named after movie star Jayne Mansfield as a joke, but the name stuck. In 1970, the volcano called Beerenberg erupted and all the people were evacuated. A C-130 was sent to the island to get the people and was able to land on the dirt runway. More and more supplies were delivered by aircraft after that. Most supplies were delivered by ship. == Facts == The C-130 from the Royal Norwegian Air Force visits the island only eight times a year. The runway is not open for regular commercial use. The runway can be used for research and search and rescue. The dirt runway is . One end of the runway points to 060 degrees on a compass and the other end points to 240 degrees. The Jan Mayensfield airdrome's weather can change a lot. It is often foggy. Kármán vortexes can make the winds quickly change direction. == Accidents == IN 1991, a C-130 aircraft almost crashed after take off due to the wind shifting. A World War II plane crashed near where the airfield was built. == References == Category:Airports in Europe Category:1960 establishments in Europe Category:1960s establishments in Norway Category:Buildings and structures in Norway Category:Transport in Norway",
 "title": "Jan Mayensfield"
}