{
 "id": "64391",
 "text": "Berbers or Imazighen (singular Amazigh, plural Imazighen) are an ethnic group. They were the first people to live in the countries of Morocco, Algeria, Libya and Tunisia in North Africa. There are more than 100 different tribes/groups of the Amazigh people that live in different parts of North Africa. Imazighen live in two different ways. They always move around to live in different places or they have land and stay in one place. The way they live is different in different parts of North Africa. The Amazigh people speak Tamazight and this language has many different dialects. The dialects use the Tifinagh script. The Amazigh people have a different culture from the Arabs who live in Morocco. The art Imazighen create is unique to them. This can include pottery, carpet making, blanket making, or tattooing. The colours and designs they use are different in each group. Groups are known by these colours and designs and it's how groups show their differences. == The terms \"Berber\" and \"Amazigh\" == After the start of the Arab conquest, the native people started being called Berbers. The term Berbers means barbarians. Barbarians are people who live and behave differently than the Arab settlers. This term is not used by the Amazigh people. The term \"Amazigh\" is what Imazighen liked to be called instead. Amazigh is the singular, Tamazight is the word for females and Imazighen is the plural. The translation of the word means \"free people\". == History == === Origin === Amazigh people were the first people to live in the Maghrebi region. There were a lot of different tribes that lived in different regions. They lived next to Roman provinces. === Arab conquest === The Arab conquests which started in the 7th century, brought the Umayyads to the region. They took some control of the region and converted the populace to Islam. The people in control were from the Umayyad dynasty. In 711, Imazighen took part in taking over al-Andalus. This was part of Spain During the time between 1040-1147, the Almoravid dynasty created an important empire. People were selling their things to other continents. Amazigh kingdoms were replaced with Arab ones and Arabic was spoken in lots of places. === Berber empires === After Arab rule in the region, powerful Berber dynasties such as the Almoravids and Almohads arose; the Almoravids and Almohads controlled Al- Andalus in Europe and the Maghreb. === Colonial era === In the 19th and 20th century, the French took control of Algeria and Morocco and made a difference between Arabs and Amazigh people. They continued to call Amazigh people Berbers. The French thought that Amazigh people's way of life was not modern. Berbers moved out of cities and close to the Atlas mountains. People were farming, working with leather, making pottery and selling things. Some Amazigh people had houses, while others were nomads and moved or lived in caves. Most of the time, Amazigh groups had their own rules and rituals. Many Berbers moved to bigger cities or Europe to look for better jobs. After Morocco and Algeria became free countries, Tamazight languages were not studied at schools and people were not treated in a good way. === Modern era === Amazigh people still live in North African countries and they are a big part of the population in countries like Morocco and Algeria. In 2005, the PDAM (Democratic Amazigh Moroccan Party) was established. It wanted to show the Moroccan state that the regions where Amazigh people lived were different. IRCAM (Royal Institute of Amazigh Culture) was another project which helped with teaching the Tamazight language and keeping the Amazigh identity. In 2011, Tamazight got the status of a national language in Morocco. An Amazigh festival has been created and it happens every year. == Groups and languages == Tamazight is the general term for the different Berber dialects. People in North Africa speak Tamazight in different ways in each country and region. Amazigh languages are part of the Afro-Asiatic family and they use the Tifinagh script. When the Arabs arrived to North Africa, Arabic was introduced and Amazigh languages were not written anymore. Because of this, less Amazigh people spoke Amazigh dialects and switched to speaking Arabic. At the end of the 19th century, Tamazight languages started to be used again. They use the Latin and Tifinagh scripts. Today, Tamazight is taught in schools in Morocco and Algeria and the language has become an official language in Morocco. === Diversity in Morocco === In Morocco, the 3 most widely spoken Amazigh languages are Shilha (Tashelhit), Tazayit (Atlasic) and Riffian (Tarifit). Tashelhit or Shilha is an Amazigh language, spoken largely in the Atlas mountains region in Morocco. It is the most spoken Amazigh language in the country. Because the region has not many cities, the language is shared outside cities by women. This is done through rituals, songs, telling stories to children and everyday-life tasks. Women in this area who did not go to school use Tashelhit. Men are around Arabic more because they teach in schools, watch televison and work in cities. Mothers teach their children the language and this way they keep the identity of the community. Even if Arabic is being spoken by local people, they do not want to forget their Amazigh identity. Main Berber groups Group Country Notes Blida/Médéa Atlas Berbers Algeria In Central Algeria. Chaoui people Algeria Found mainly in Eastern Algeria. Chenini and Douiret Berbers Tunisia Chenoui Berbers Algeria Ouarsenis and Mount Chenoua (Western Algeria). Chleuhs Morocco The High Atlas, Anti- Atlas and the Sous valley. Djerba Berbers Tunisia Speakers of the Djerbi language. Ghomaras Morocco Only two berber speaking tribes left. Found in the western Rif between Tetouan and Jebha. Guezula Mauritania Kabyles Algeria In Kabylie. Matmata Berbers Tunisia In Southern Tunisia. Mozabites Algeria In the M'zab Valley (southern Algeria). Nafusis Libya In western Libya. Riffians Morocco Primarily in northern Morocco, with some also in Beni Snous, Northwestern Algeria Sanhaja Morocco Found in the Rif bordering Riffian speaking tribes. Siwi Egypt In the Siwa valley of Egypt. Beni Snous Algeria Aït Snouss villages of western Algeria. Closely related to the Riffians in Morocco. Tuareg Algeria, Libya, Niger, Mali, Burkina Faso Sahara (southern Algeria and north of the Sahel). Zayanes Morocco Middle Atlas mountains of Morocco. Zenaga Mauritania Zuwaras Libya In northwestern Libya. Benha Egypt A family called Al-Barbary lives in Benha. == Amazigh arts and culture == Morocco has the biggest amount of Amazigh people in North Africa. === Amazigh arts in colonial Morocco === From 1926 to 1956, the French people in control of the Moroccan population chose what art and design Amazigh artists had to create. Areas where Amazigh people live had a design and colour given to the area and the artists in this area had to follow these rules when making art. Still today, carpets and blankets, for example, show where Amazigh artists are from because of the colour and design they have used in their art. The French controlled Amazigh arts to help the Moroccan economy. This would make sure that after Morocco is a free country, the country will have enough money to be a successful country. === Amazigh arts in independent Morocco === After Morocco became an independent country, the Moroccan government made sure not to talk about the Amazigh people. If they were seen as a different ethnicity, the government was afraid the country's Arab identity would not exist. The Amazigh population, however, did not want to be forgotten by the government. Indigenous Amazigh art designs were therefore continued by Amazigh women and their daughters. This is why Amazigh art is strongly connected with women's identity. Most Amazigh people live outside of the cities and this is where all their art is created. === Amazigh weaving === Weaving is only done in places where sheep can survive and eat. Amazigh groups in the desert make other arts such as pottery. ==== The importance of weaving ==== Weaving is very important for Amazigh women. In Morocco, women who create fabrics will go to heaven when they die. The wool they use has been approved by God and must be protected. They believe the wool has a soul and the action of weaving is life's energy. The wool's soul is the same as the women's soul, so the carpet or blanket being made has to stay in the women's home. If the wool is taken somewhere else, the woman and her house will lose part of this soul. In Tunisia, to keep the wool safe, Amazigh women put the blood of an animal around the tool they use to make carpets. In Morocco, they put salt around the tool to protect the wool from bad ghosts. When women are finished with their creations, they make a prayer. Every time the women create more of the carpet, more life is created. ===== Process of weaving ===== Before the women start colouring the wool, they must clean it. They do this by washing it and brushing it through like hair. Then the wool is made into thread which is thinner. The Amazigh women make wool a different colour. Only in the South of Tunisia and the West of Libya do they do it the other way round. The carpet for example is created then the wool is made colourful. To create the colours that will dye the wool, women will use insects or plants. The colour purple for example can be made by using plants that grow in North Africa. Another thing that is used to make colour is henna. This type of plant is not only used to make colour on wool but also to create patterns on the body. The patterns made on the body are painted at different times of a woman's life. ==== Motifs on the materials ==== The designs on Amazigh textiles are said to protect the weavers. * Semi- circle with five lines coming out of it: fertility * Hands: keep people safe from evil * Plantlike shapes: fertility—when girls are old enough to marry. * Hexagon * Arrows * Zigzags/triangles/diamonds: power of women * Triple line * Checkers * Circle === Amazigh eyes === ==== Colours ==== * Red: blood, life, fertility * Blue and Indigo: these colours are good for the skin ==== Process of dyeing ==== Getting colours from plants or local materials is not easy. Overall, not much is known about the process because Amazigh women do not want to share what they do. The fabric that women want to make colourful is dipped into different bowls. Each bowl has a different colour in it. Sometimes just a bit of the fabric is put in the bowl to make a small part of it colourful. Sometimes all the fabric is put in if the design they want is just one colour. After, all textiles created by Amazigh women never look the same because colours spread through the wool in different ways. === Weddings === Weddings for all Amazigh groups are important markers of their identity. Different groups of Amazigh people celebrate weddings differently. In the South of Morocco, the Ait Khabbash are the biggest group of Amazigh people. The way women celebrate their weddings always lasts three days and the celebration has not changed a lot over the years. === Before the wedding === Women plan the weddings. A meeting between the groom and bride is organised. If they agree on marrying each other, the groom's mother meets the bride's family and brings them gifts.The gifts are henna, meat and tea. Before the wedding starts, a tent is put up. The groom chooses three men (usually called Ihddaden) to build this tent. They build the tent close to the grooms. All of the wedding happens in and around this tent. It is very important because it reminds the Amazigh people of their nomadic life. What the woman wears is a very important process and tradition. She is dressed in red and white clothes and has silver jewelry around her neck. The clothes and jewlery are brought for her by her groom. She has henna painted onto her hands and while other women are doing this, they sing songs that have been in the family for a long time. The groom wears the same coloured clothes as the woman and also has songs sung to him. While he is being dressed, he sits on his mother's lap. The process of dressing him is not as special as the bride's. === During the wedding === On the first day, the bride arrives at her wedding tent. She arrives on a horse or camel. A red carpet from the woman's home is put on the back of the animal. A little boy called Muhammad sits on the horse with the woman. The woman is sung to while she goes to the tent. When she gets to the tent, she goes around it three times counterclockwise. She is given milk to drink and then puts a bit of it on the other people at the wedding. The woman's face is covered by a white cloth. This day is the first day that the bride and groom will sleep together. On the second day, the woman has gone from being a girl to a woman. The woman therefore wears white clothes with her own blood on. This blood is to show that she has become a woman. A lot of celebrations happen on the second day. Lots of songs are sung to the woman. Some songs ask God to look after the wedding. Other songs talk about what the woman is wearing. The men also sing songs for the bride. They perform for her so that her wedding and life is happy and successful. The most important part of this day is the killing of an animal. At twelve o'clock, this animal is killed because the Ait Khabbash group believes it brings good things to the couple and the blood makes the family united. On the third day, lots of orange and black paint is put onto the woman's face. The cloth that has been on her face all wedding is still not taken off. While women are painting the bride's face, they sing to her. The wedding ends when a big dance is performed. This is done after the white cloth is finally taken off of the bride's face. ==Gallery== File:Berbers.png|This map shows where Berber is spoken. File:An old Amazigh (Berbère) room in Morocco.jpg|An old Amazigh room in Morocco. File:Berber flag.svg|alt=|Amazigh flag File:Moroocan AHIDUS.png|alt=|Imazighen performing traditional dance. ==References== == Other websites == * The New Mass Media and the Shaping of Amazigh Identity * Encyclopedia of the Orient -- Berbers",
 "title": "Berber people"
}