{
 "id": "64419",
 "text": "Eva Jacqueline Longoria (born March 15, 1975) is a Golden Globe Award- nominated American movie and television actress. She is best known for her role as Gabrielle Solis in the ABC television series Desperate Housewives. She has also become an internationally recognized model after appearing in several high-profile advertising campaigns and numerous men's magazines. ==Personal life== Longoria announced her engagement to French NBA guard Tony Parker on November 30, 2006. Following French law, the couple married first in a civil ceremony on July 6, 2007 before they could exchange vows in a religious ceremony on July 7, 2007 at the Église Saint-Germain-l’Auxerrois in Paris. A reception was then held in Maincy, France at the Vaux-le-Vicomte castle. She got divorced in 2011. Longoria is a Democrat and attended the 2012 Democratic National Convention in support of President Obama's re-election. ==Filmography== Movies Year Title Role Notes 2003 Snitch'd Gabby 2004 Señorita Justice Det. Roselyn Martinez 2004 The Dead Will Tell Jeanie TV film 2004 Carlita's Secret Carlita / Lexus 2005 Hustler's Instinct Vanessa Santos Short 2005 Harsh Times Sylvia 2006 The Sentinel Jill Marin 2007 The Heartbreak Kid Consuela Cantrow 2008 Over Her Dead Body Kate Spencer 2008 Lower Learning Rebecca Seabrook 2010 Without Men Rosalba 2011 Arthur Christmas Chief De Silva (voice) 2012 For Greater Glory Tulita Gorostieta 2012 Foodfight! Lady X (voice) 2012 The Baytown Outlaws Celeste Martin 2012 Crazy Kind of Love Marion 2013 A Dark Truth Mia Francis 2013 In a World... Herself 2014 Frontera Post- production Television Year Title Role Notes 2000 Beverly Hills, 90210 Flight Attendant No. 3 1 episode: \"I Will Be Your Father Figure\" 2000 General Hospital Brenda Barrett Lookalike 1 episode 2001–2003 The Young and the Restless Isabella Braña Regular role 2003–2004 Dragnet Det. Gloria Duran Regular role; 10 episodes 2004–2012 Desperate Housewives Gabrielle Solis Lead role; 180 episodes 2005 Saturday Night Live Herself (host) Episode 31.6: \"Eva Longoria/Korn\" 2006 George Lopez Brooke 1 episode: \"George Vows to Make Some Matri-Money\" 2008 Childrens Hospital The New Chief 1 episode 2010 The Next Food Network Star Herself Season 6, Week 8 2010 MTV Europe Music Awards 2010 Herself Host 2013 Masterchef Herself Episode 13: Special Guest Judge 2013 Welcome to the Family Ana Nunez Alongside ex-co-star; Ricardo Antonio Chavira 2013 The Simpsons Isabel Season 25, Episode 6: \"The Kid is All Right\" 2013–present Mother Up! Rudi Wilson Animated television series; Lead Role ==References== ==Other websites== * * Category:1975 births Category:Living people Category:American movie actors Category:American television actors Category:Democrats (United States) Category:Actors from Corpus Christi, Texas Category:Restaurateurs",
 "title": "Eva Longoria"
}