{
 "id": "64434",
 "text": "Victoria, Crown Princess of Sweden, Duchess of Västergötland (full name in Swedish: Victoria Ingrid Alice Désirée, born 14 July 1977) is the heiress apparent to the throne of Sweden. She is the daughter and oldest child of King Carl XVI Gustaf and Queen Silvia. == Early life == Victoria was born on 14 July 1977 at Karolinska University Hospital in Solna. She is eldest child and elder daughter of Carl XVI Gustaf and Queen Silvia of Sweden. Victoria has two younger siblings, Prince Carl Philip and Princess Madeleine. == Marriage and children == Victoria married her former personal trainer, Daniel Westling, on 19 June 2010. They have two children, They were born at Karolinska University Hospital in Solna: * Princess Estelle, Duchess of Östergötland (born 23 February 2012) * Prince Oscar, Duke of Skåne (born 2 March 2016) ==Titles and styles and Honors== *14 July 1977 – 31 December 1979: Her Royal Highness Princess Victoria of Sweden *1 January 1980 – 9 January 1980: Her Royal Highness The Crown Princess of Sweden *9 January 1980 – present : Her Royal Highness The Crown Princess of Sweden, The Duchess of Västergötland *National Honors *Member Grand Cross with Collar of the Royal Order of the Seraphim (LoK KMO) *Member of the Royal Family Decoration of King Carl Gustaf (14 July 1995) *Recipient of the King Carl XVI Gustaf's Jubilee Commemorative Medal IV (15 September 2023) *Recipient of the King Carl XVI Gustaf's Jubilee Commemorative Medal III (30 April 2016) *Recipient of the King Carl XVI Gustaf's Jubilee Commemorative Medal II (23 August 2013) *Recipient of the King Carl XVI Gustaf's Jubilee Commemorative Medal (30 April 1996) *Swedish National Defense College Commemorative Medal (9 January 2008) *Swedish Soldiers Homes Association Medal in Gold no 1 (May 2021) *Foreign Honors *Austria: Grand Cross, Special Class of the Order Honor for Services to the Republic of Austria *Belgium: Knight Grand Cross of the Order of Leopold *Brazil: Grand Cross of the Order of the Southern Cross *Bulgaria: Grand Cross of the Order of the Balkan Mountains *Chile: Grand Cross of the Order of Merit *Denmark: Knight of the Order of the Elephant (14 July 1995) *Estonia: Grand Cross of the Order of the Cross of Terra Mariana, Grand Cross of the Order of the White Star *Finland: Grand Cross with Collar of the Order of the White Rose *France: Grand Cross of the Order of National Merit, Grand Officer of the Order of the Legion of Honor (30 January 2024) *Germany: Grand Cross, 1st Class of the Order of Merit of the Federal Republic of Germany *Greece: Grand Cross of the Order of Honor *Iceland: Grand Cross of the Order of the Falcon *Italy: Knight Grand Cross of the Order of Merit of the Italian Republic *Japan: Grand Cordon of the Order of the Chrysanthemum *Jordan: Grand Cordon of the Supreme Order of the Renaissance *Lativa: Grand Officer of the Order of the Three Stars *Lithuania: Commander Grand Cross of the Order of Grand Duke Gediminas *Luxembourg: Grand Cross of the Order of Adolphe of Nassau *Malaysia: Honorary Grand Commander of the Order of the Defender of the Realm *Monaco: Knight of the Order of Grimaldi, Recipient of the Prince Albert II Investiture Medal *Netherlands: Knight Grand Cross of the Order of the Netherlands Lion (11 October 2022) *Norway: Grand Cross of the Order of St. Olav (1 July 1995) *Romania: Grand Cross of the Order of the Star of Romania *South Korea: Grand Gwanghwa Medal of the Order of Diplomatic Service Merit *Spain: Dame Grand Cross of the Order of Isabella the Catholic (16 November 2021) *Tunisia: Grand Officer of the Order of the Republic ==Other websites== * The Royal Court's official biography in Swedish and English * The Royal Court's press release about the Diplomat Program * Radiohjälpen's official website for Victoria Fund * , Announcement of Victoria and Daniel Westling's engagement, 2009-02-24. Category:1977 births Category:Living people Category:Swedish princesses Category:People with dyslexia Category:House of Bernadotte Category:Recipients of the Order of the Legion of Honour Category:Grand Officers of the Order of the Legion of Honour Category:People with anorexia",
 "title": "Victoria, Crown Princess of Sweden"
}