{
 "id": "644623",
 "text": "Jan-Ove Waldner (born October 3, 1965 in Stockholm) is a male table tennis player from Sweden. He was the third man in table tennis history to become Grand-Slam champion. He played to 2012 in the German club TTC Röhn-Sprudel Fulda Maberzell and was the best Swedish table tennis player. == Early years (1970-1980) == When Waldner was five years old, He startd playing table tennis. His older brother and his parents were also players. Early on, Waldner was stand on pedestals or buckets. Soon, he began to play in the Swedish club Spåvägens BTK. Waldner was trainied by different coaches as well as his family. When he was nine years old, he won for the Swedish National Championships in his age group. Growing up, he did not only play table tennis. He also loved football and tennis. By the age of thirteen, he only played Table tennis. Waldner left school early to become a professional player. In his first year as a pro, he played his first tournament and won a automobile. == Sporting career == === Early career (1980s-1990s) === Waldner played his first international tournament at the Nordic Championships in Denmark. He played very well. He won gold in singles play and silver in doubles. At the 1982 European Championships for children and teenagers, he won silver. With this tournament, he moved from number 90 to number 22 in the junior world rankings. That same year, Waldner played at the European Championships for adults. He won silver. In 1983, he played very well. At his first World Cup, he won silver. He played in his first World Championships and placed in the top sixteen as a single player. In doubles play, he won silver. In May 1983, he wasnumber 38 in the world rankings. He kept playing well. He won a silver medal in singles and a gold medal in the mixed. Waldner did not play in the European Championships that year. 1984 began well for him. At the European Championships, he won silver in the doubles. He did not play in singles, team and mixed play because of physical problems. That year, he placed fifth at the World Cup after losing to Joo Se-hyuk. At the World Cup in 1985, Waldner lost to Norwegian Òlaf Lundquist. This caused Waldner to fall to 43rd place in the world rankings. At the World Championships (WTTC), he reached the 2nd place with the Swedish team. In singles play, he lost in the Round of 32. At the Europe-Top-12, he reached 5th place. In 1986, Waldner took part in the European Championships. He won gold in doubles and the team event. The Swedish team beat Germany in the finals. In the singles, he lost in the Round of the sixteen. In 1987, Waldner was 2ndat the Europe-Top-12 tournament. He also placed second at the World Championships. He lost a very close match in the finals (3 games to 4) to Ma Lin. Because of that strong performance, he moved from number 43 to number 22 in the world rankings. He had become the highest rated Swedish player over Jörgen Persson. In Macau, he won bronze at the World Cup. In 1988, he won gold at the Nordic Championships. He also won the Europe- Top-12. That year, he was ranked at number 13. He also won bronze at the European Championships in singles play. In doubles, he won silver. The Swedish team won the gold. Waldner also took part in the first table tennis event in Olympic Games history. He did not win a medal for either singles, doubles or team play. In 1989, the Swedish team won gold at the World Team Table Tennis Championships. They beat China in the finals. There was no European Championships that year. At the Europe-Top- 12, he won his third gold medal. He lost in the first round of the World Cup that year. The next year, the Swedis team won the World Team Cup. Waldner also played in the World Doubles Cup but lost in the Quarterfinal. At the World Cup, he won gold. At the European Championships, he reacged tge quarter-finals in both singles and doubles. The Swedish team won gold. 1991, he won silver at the Europe-Top-12. At the WTTC, he won silver in the singles. Because of that performance, he moved to number 3 in the world rankings. At the World Cup Jan won bronze. Warner qualificated for the 1992 Olympics in Barcelona, Spain. At the games, he won gold. This was the best year in his Table tennis career. He was the third man to win the Grand Slam. To win the Grand Slam, a person has to be the winner of the World Cup, Olympic gold medal and World Championship, all at the same time. He won the World Cup (1990), the Olympic Games (1992) and the World Championships (1987, 1989). He did not win the European Championships that year. He lost in the singles against Jörgen Persson. That year he was number one in the world rankings. From 1993 t0 1996, he had many problems with his body. ===Later career (2000s)=== At the 2000 Olympic, Games he won silver in the singles. He was the 1st player to win two single medals for table tennis at two Olympic Games. The next year, he reached the 9th-12th place at the World Cup, the WTTC and the Pro Tour Grand Finals. He won silver at the 2002 Pro Tour at the Korea Open in Pyeongchang, South Korea. That same year, he won gold with the team at European Championships. In singles play, he reached the Round of sixteen. In 2003, Waldner lost at he WTTC in the Round of 128 to South Korean Joo Se-hyuk. On the Pro Tour, he won the Swedish Open. In 2004, Waldner took part in the Olympics for the 4th time. At the Olympics, he lost to Ma Lin in the 3rd place match. The Swedish team came to the Quarterfinals. Waldner also reached the Quarterfinal at the World Cup that year. At the WTTC, the team won bronze. He took part in his lat WTTC in 2005. In his last WTTC tournament, he reached the quarter finals in all events. At the World Tour Grand Finals of 2006, he won gold. After that, Waldner ends his international career. He played national until 2016 when he retired. ==Personal life== Waldner opened a reastaurant in 2004. It is named \"W\". == Clubs == * 1971-1984-Spårvägens Golf (Sweden) * 1984-1987- ATSV Saarbrücken (Germany) * 1987-1995 Ängby SK (Sweden) * 1995-2003 Kalmar BTK (Sweden) == References == Category:Olympic gold medalists for Sweden Category:Olympic silver medalists for Sweden Category:Olympic bronze medalists for Sweden Category:Living people Category:Table tennis players Category:Sportspeople from Stockholm Category:1965 births",
 "title": "Jan-Ove Waldner"
}