{
 "id": "64477",
 "text": "The Potsdam Conference was a meeting of the Soviet Union, the United Kingdom and the United States in Potsdam, Germany from July 17 to August 2, 1945. The Prime Minister of the United Kingdom (Clement Attlee), the President of the United States (Harry S. Truman) and the Premier of the Soviet Union (Joseph Stalin) met to talk about Germany on July 1945 and to discuss what should happen to it now that the Second World War was over. The first conference was held at Yalta, but the Allies did not agree on anything very important. However, a lot had happened since the Yalta Conference. Firstly, the United States had a new president, Truman, who was much tougher on communism than the previous president, Franklin Roosevelt, had been, which was a problem for Stalin. Also, Winston Churchill had been voted out in the United Kingdom and replaced by Clement Attlee. Stalin saw himself as far more experienced than the new leaders and also caused trouble, as some of what the allies agreed on at Yalta was that Poland should have a neutral government. Stalin had killed the neutral government leaders and replaced them others, who did what he wanted. That caused many problems at Potsdam since other countries no longer trusted the Soviets. == The agreements == The allies talked about and agreed: * Germany would be temporarily split into four pieces (occupation zones), one occupied by France, one by the Soviet Union, one by the United States, and one by the United Kingdom. *A large piece of eastern Germany would become Polish, and the Germans in it would be expelled. * Nazi criminals would be judged and sentenced. * Germany would be demilitarised. == The disagreements == The allies talked about but did not agree on the following: * How to separate Germany * How much money Germany would pay to the winners of the war * How Stalin was treating Poland * How much land Poland would have * ==Related pages== * Potsdam Declaration * Yalta Conference ==Other websites== * A revision site for IGCSE students * The Aims of The Allies in depth - not recommended for Simple Wikipedia users * The events of Potsdam in depth - not recommended for Simple Wikipedia users * A CNN webpage on Potsdam, very in depth - not recommended for Simple Wikipedia users Category:1945 in Germany Category:Potsdam Category:World War II Category:Winston Churchill Category:Joseph Stalin Category:Harry S. Truman",
 "title": "Potsdam Conference"
}