{
 "id": "644909",
 "text": "Cryptocurrency is a type of currency which uses digital files as money. Often, people create these files using the same ways as cryptography (the science of hiding information). Cryptocurrency users can use Digital signatures to keep the transactions safe, and to let other people check that the transactions are real.Cryptocurrencies: A Brief Thematic Review . Economics of Networks Journal. Social Science Research Network (SSRN). Date accessed 28 august 2017. The creators of the first cryptocurrencies made them to be free of government- given currencies. No single person controls cryptocurrencies. Instead they are decentralized and controlled by many people. This is different from 'centralized' electronic money and central banks, which a small group of people control. The control of each cryptocurrency works through a distributed ledger (a list of transactions shared by everyone), usually a blockchain. This lets everyone know all of the financial transactions that happen. Bitcoin, first released as open-source software in 2009, is famous because it was the first decentralized cryptocurrency. Since then, people have created more than 4,000 cryptocurrencies (sometimes called altcoins, or alternative coins). == The value problem == In many cases, it is not possible to exchange cryptocurrencies for real currencies such as the US dollar. It is only possible to convert them to other cryptocurrencies. People can also use them to buy things. But some cryptocurrencies can be converted to real currencies. Those cryptocurrencies usually have high volatility, (their price changes very often). Using them is very risky. They are also a target for Pump-and-Dump- Attacks. They act like a big distributed economic system: because they are not issued or controlled by central banks, their value is difficult to influence. For this reason, they cannot really take the place of a stable currency.Chicago Fed Letter: Bitcoin: A primer (englisch; PDF; 180 kB) People often use cryptocurrencies to do speculation. That makes building a system of more or less stable exchange rates very difficult.Philip Banse: Digitale Währung mit starken Schwankungen. In: Deutschlandfunk. 30. Dezember 2013. Another problem is the inequality of distribution. A small number of people have most of the cryptocurrency. About 1.000 people hold half of the total amount of bitcoins in the world. So if any of these people start using the Bitcoin that they own, they will change the exchange rate. It also means that these people have a great influence on the value of the currency. They can change its value easily. The currency itself only tells you who owns it. Exchange rates of cryptocurrencies are established outside the system. Traders and brokers set the exchange rate. This is not a guarantee that they trade cryptocurrency at the value that they suggest. The unit of cryptocurrency doesn't have value by itself. In contrast to cryptocurrencies, central banks control \"real\" currencies such as the US dollar, Japanese yen, euro, or Chinese renminbi. Certain economic phenomena such as inflation or deflation may change the value (and exchange rate) of a currency. The people who own units of the currency have no direct influence on its value. == Formal definition == According to Jan Lansky, a cryptocurrency is a system that meets six conditions: # The system does not require a central authority, distributed achieve consensus on its state . # The system keeps an overview of cryptocurrency units and their ownership. # The system defines if new cryptocurrency units can be created. If new cryptocurrency units can be created, the system defines how to create new units, and how to determine the ownership of these new units. # Ownership of cryptocurrency units can be proved exclusively cryptographically. #The owner of a unit of cryptocurrency can transfer this unit. For this transfer to be successful, the current owner must prove the ownership. # If two different instructions for changing the ownership of the same cryptographic units are entered at the same time, the system performs at most one of them. In March 2018, the word \"cryptocurrency\" was added to the Merriam-Webster Dictionary. == Crypto mixing == Cryptocurrency mixing is a service where tainted bitcoins can become unmarked bitcoins. Bitcoin mixing, also called Bitcoin tumbling or Bitcoin blending, is the process of using a service to make your Bitcoin purchases and transactions untraceable. Instantly mixing Bitcoin is the only way to hide bitcoin exchanges and make them impossible to track. This protects against criminals, hackers, and activities prohibited by the law where people use bitcoin. It also protects against law enforcement. The huge amount of bitcoins on mixing services come from mining pools around the world. == Crypto mining == Crypto mining is the process of using specialized hardware and software to verify transactions on a blockchain network. The process involves solving complex mathematical equations to validate transactions and add them to the blockchain. Miners are rewarded for their efforts with cryptocurrency, usually in the form of the coin that they are mining. There are three main types of crypto mining: Proof of Work (PoW), Proof of Stake (PoS) and Proof of Authority (PoA) Proof of Work is the most widely used consensus mechanism in the crypto space. It is used by Bitcoin and many other cryptocurrencies. In PoW, miners have to solve complex mathematical equations to validate transactions and add them to the blockchain. The miner who solves the equation first is rewarded with cryptocurrency. Proof of Stake is a newer consensus mechanism that is becoming increasingly popular. In PoS, instead of solving complex equations, miners are chosen to validate transactions based on the amount of cryptocurrency they hold. This is known as ‘staking’. The more cryptocurrency a miner holds, the more likely they are to be chosen to validate transactions. Proof of Authority (PoA) is a consensus algorithm for private or consortium chains. It uses a set of trusted nodes, or validators, to secure the network. These nodes are pre-selected by the network administrator and are responsible for validating transactions and adding them to the blockchain. ==History of cryptocurrency== In January 2009, bitcoin was created by Satoshi Nakamoto (a pseudonym). That currency used SHA-256, a cryptographic hash function, in its proof-of-work scheme. Peercoin, created in August 2012, used a (mix of, or) hybrid of proof-of-work and proof-of-stake. As of August 2014, the Treasury of the UK had (ordered or) commissioned a study to be made, about cryptocurrencies and if they were to have any part in the UK economy. Its last report, was published in 2018; An opinion was given, regarding cryptoassets and stablecoins in January 2021. (A stablecoin, is \"an attempt [... at making] a cryptocurrency token with a stable price\", according to media; Furthermore, stability can come from \"pegging the token to ... gold or fiat\" currency, or a similar kind of asset.)https://hedera.com/learning/tokens/what-is-a- stablecoin#:~:text=Stablecoins%20are%20an%20attempt%20to,greater%20confidence%20in%20their%20price.&text;=The%20crypto%20ecosystem%20is%20ever%2Devolving. Retrieved 2025-05-14 == References ==",
 "title": "Cryptocurrency"
}