{
 "id": "64518",
 "text": "The Military of ancient Rome (known to the Romans as the militia) means all military forces of Ancient Rome from the founding of the city of Rome to the end of the Western Roman Empire. Originally there was only the Roman army, but a small navy was added during the Second Samnite War, around 320 BC. The Roman military was an important part of the Roman state. Josephus describes the Roman people as \"as if born ready armed\".Williamson G. (transl.) 1959. Josephus, The Jewish War, p. 378. It has a history of more than 1300 years. Roman armies fought in Parthia as well as in Africa, and in - what was in that time the far north - the British Isles. After a series of reforms, the army became highly trained, and was well equipped in the middle of the Roman Imperial period. The Romans also had a powerful navy that ruled the Mediterranean and the European Atlantic coast. In the late Imperial period the military's numbers were significantly increased to cover the borders and keep internal peace. The circumstances of the Empire had changed; the Western Roman Empire now relied heavily on units of mostly Germanic tribes living within the borders, who fought in the name of Rome during the Migration Period. == References == == Other sources == ;Primary sources *Livy, The Rise of Rome, Oxford University Press, 1998 *Polybius, History, Book 6 *Tacitus, The Histories, Book V ;Secondary sources *Gibbon E., The Decline and Fall of the Roman Empire, Penguin, 1985 *Goldsorthy A., In the Name of Rome: The Men Who Won the Roman Empire, Weidenfield and Nicholson, 2003 *Grant, M., The History of Rome, Faber and Faber, 1993 *Heather, P., The Fall of the Roman Empire: A New History, MacMillan, 2005 *Jones, The Later Roman Empire,Johns Hopkins University Press, 1964 *Lane Fox, Robin, The Classical World, Penguin, 2005 *Luttwak, E., The Grand Strategy of the Roman Empire, Johns Hopkins *Matyszak, P., The Enemies of Rome, Thames and Hudson, 2004 *Santosuosso, A., Soldiers, Emperors and Civilians in the Roman Empire, Westview Press, 2001 ==Other websites== *UNRV's Roman Military *Internet Ancient History Sourcebook * Military Resources * Armamentarium bibliography * The Ancient Warfare Articles of Smith's Dictionary, Bill Thayer's Lacus Curtius site. Category:Military of ancient Rome",
 "title": "Military of ancient Rome"
}