{
 "id": "645171",
 "text": "Anthony Steven Evers (born November 5, 1951) is an American politician and educator who has been the 46th and current Governor of Wisconsin since 2019. He was elected governor in 2018, defeating then-incumbent Governor Scott Walker. He was re-elected in 2022. ==Political career== Before becoming Governor, he served as the 26th Superintendent of Public Instruction of Wisconsin from 2009 to 2019. Evers serves as President of the Council of Chief State School Officers and was Wisconsin's Deputy Superintendent of Public Instruction from 2001 to 2009. ==Governor of Wisconsin== Evers was the Democratic nominee for Governor of Wisconsin in the 2018 gubernatorial election. His running mate is community organizer Mandela Barnes. Evers won the election by 1%. In February 2019, Evers's administration prepared a budget proposal that included proposals to legalize the medical use of marijuana for patients with certain conditions. Evers's marijuana proposals were opposed by Republican leaders in the Legislature.Evers wants to decriminalize marijuana, legalize medical use , Associated Press (February 18, 2018). On March 12, 2020, because of the COVID-19 pandemic, Evers declared a public health emergency in the state. The next day, he ordered all schools in the state to close by March 18, with no possibility of reopening until at least April 6. On March 17, Evers added a statewide ban on public gatherings of more than 10 people. This was expanded to a statewide \"safer at home\" on March 25, originally set to expire on April 25, with people allowed to leave their homes only for essential business and exercise. Evers was re-elected governor in 2022, defeating businessman Tim Michels. In July 2023, Evers made a line-item veto to the state budget for fiscal years 2024 and 2025 that increased school funding of $325 a year until 2425. He did this by removing the hyphen and \"20\"s from where the budget bill mentioned the 2024–2025 school year. In April 2025, the Wisconsin Supreme Court said the veto was legal; in the majority opinion. ==Health== Evers had esophageal cancer before undergoing intensive surgery in 2008. ==References== ==Other websites== * Governor Tony Evers official State of Wisconsin website Category:1951 births Category:Living people Category:Governors of Wisconsin Category:Educators from Wisconsin Category:Politicians from Wisconsin Category:Democratic Party (United States) politicians",
 "title": "Tony Evers"
}