{
 "id": "64519",
 "text": "A Roman legion was the basic military unit of the ancient Roman army in the period of the late Roman Republic and the Roman Empire. It was roughly equivalent to the modern word division. In the plural, the legions, it may mean the entire Roman army. A legion was about 5,000 men in several cohorts of heavy infantry (legionaries). It was usually accompanied by attached units of auxiliaries, who were not Roman citizens. They provided cavalry, ranged troops and skirmishers to complement the legion's heavy infantry. The size of a typical legion varied during the history of ancient Rome. It had a complement of 4,200 legionaries in the republican period of Rome. In the imperial period, the full complement was 5,500 men split into 10 cohorts of 480 men each. The first cohort was at double strength with 800 men. The remaining 220 were 120 cavalry plus technical staff. Rome did not have a standing army until the reforms of Gaius Marius about 107 BC. Legions instead were created, used, and disbanded again. In the time of the early Roman Empire, there were usually about 25–35 standing legions plus their auxiliaries, with more raised as needed. == Organization == === Greek phalanx === The development of the early legion may be seen as a Roman version of the Greek phalanx formation. Until the 4th century BC the massive Greek phalanx was the mode of battle. Roman soldiers would have thus looked much like Greek hoplites. Tactics were no different from those of the early Greeks and battles were joined on a plain. Spearmen would deploy themselves in tightly packed rows to form a shield wall with their spears pointing forwards. === Republic === There were now three lines of soldiers when in battle formation. Roman soldiers had to purchase their own equipment. In the middle of the Republic, legions were composed of the following units: * Equites (cavalry): The cavalry was originally the most prestigious unit, where wealthy young Roman men displayed their skill and prowess, laying the foundation for an eventual political career. In a total of circa 3000 men, (plus the velites that normally enlarged the number to about 4200), the legion had only around 300 horsemen, divided into 10 units (turmae) of 30 men. These men were commanded by decurions. In addition to heavy cavalry, there would be the light cavalry. In battle, they were used to disrupt and outflank enemy infantry formations and to fight off enemy cavalry. In the latter type of engagement they would often (though not always) dismount some or all of the horsemen to fight a stationary battle on foot, an unusual tactic for the time, but one that offered significant advantages in stability and agility in a time before stirrups.McCall, Jeremiah B. 2002. The cavalry of the Roman Republic: cavalry combat and elite reputations in the middle and late Republic. New York, Routledge. p53ff * Velites (light infantry): The velites were mainly poorer citizens who could not afford to equip themselves properly. Their primary function was to act as skirmishers – javelin-throwers who would engage the enemy early in order either to harass them or to cover the movement of troops behind them. * Heavy infantry: This was the principal unit of the legion. The heavy infantry was composed of citizen legionaries that could afford the equipment composed of an iron helmet, shield, armour and pilum, a heavy javelin whose range was about 30 meters. After 387 B.C. the preferred weapon was the gladius, a short sword. Their hobnailed sandals were also an effective weapon against a fallen enemy. The heavy infantry was subdivided, according to experience, into three separate lines of troops: ** The hastati (sing. hastatus) consisted of raw or inexperienced soldiers, considered to be less reliable than legionaries of several years' service. ** The principes (sing. princeps) were men in their prime (late twenties to early thirties). ** The triarii (sing. triarius) were the veteran soldiers, to be used in battle only in extreme situations; they rested one knee down when not engaged in combat. The triarii served primarily as reserves or barrier troops to backstop the hastati and principes. They had long hastae (spears) rather than the pilum and gladius. Thus armed, they fought in a phalanx formation. The sight of an advancing armored formation of triarii legionaries frequently discouraged exultant enemies in pursuit of retreating hastati and principes troops. To fall upon the triarii was a Roman idiom – meaning to use one's last resort. Each of these three lines was subdivided into maniples, each consisting of two centuries of 60 men commanded by the senior of the two centurions. Centuries were normally 60 soldiers each at this time in the hastati and principes (no longer 100 men). The mid Republican legion had a nominal strength of about 4500 men. Later on the legions were made up of 80 strong centuries. Each century had its standard and was made up of ten units of eight soldiers who shared a tent, millstone, a mule and cooking pot (depending on duration of tour). === Late Republic === Throughout Rome's Late Republic, the legions played an important political role. By the 1st century BC the threat of the legions under a demagogue was recognized. Roman Governors were not allowed to leave their provinces with their legions. When Julius Caesar broke this rule, leaving his province of Gaul and crossing the Rubicon into Italy, he precipitated a constitutional crisis. This crisis and the civil wars which followed brought an end to the Republic and led to the foundation of the Empire under Augustus in 27 BC. === Early Empire (30 BC-284 AD) === With each legion having 5,120 legionaries plus an equal number of auxiliary troops, the total force available to a legion commander during the Pax Romana probably ranged from 11,000 downwards. The more prestigious legions were stationed on hostile borders or in restive provinces tending to have more auxiliaries. Some legions may have been reinforced with units making the force near 15,000–16,000 or about the size of a modern division. The legion was commanded by a legate. Aged about thirty, he would usually be a senator on a three year appointment. Immediately subordinate to the legate would be six appointed military tribunes. Five would be staff officers and the remaining one would be a noble heading for the Senate — originally this tribune commanded the legion. There would also be a group of officers for the medical staff, the engineers, record-keepers, the praefectus castrorum (commander of the camp) and other specialists such as priests and musicians. === Later === Despite a number of reforms, the legionary system survived the fall of the Western Roman Empire, and was continued in the Eastern Roman Empire until around 7th century. The Eastern Roman/Byzantine armies continued to be influenced by the earlier Roman legions, and were maintained with similar level of discipline, strategic prowess, and organization. == Centurions == Centurions were the glue which held a Roman legion together. They were the full-time professional officers of the Roman army. The basic centurion commanded (usually) 83 men rather than 100. They rose in rank by commanding ever more important centuries. The very best centurions were promoted to become centurions in the First Cohort, called Primi Ordines, commanding one of its ten centuries and also taking on a staff role. The most senior centurion of the legion was the Primus Pilus who commanded the first century. Only eight officers in a full legion outranked him. They were: *Five tribunes *The Camp Prefect *the Senior Tribune (second- in-command) *The Legate (commander) ==Related pages== * Roman Empire * Roman Republic == References == * History of the Art of War. Vol 1. Ancient Warfare, Hans Delbrück * Roman Warfare, Adrian Goldsworthy * History of Warfare, John Keegan * The Roman Army and Greece and Rome at War, Peter Connolly * The Encyclopedia Of Military History: From 3500 B.C. To The Present. (2nd Revised Edition 1986), R. Ernest Dupuy, and Trevor N. Dupuy. * War, Gwynne Dyer. * The Evolution of Weapons and Warfare, Trevor N. Dupuy. * Flavius Vegetius Renatus, De Re Militari (with English translation on-line) * Julius Caesar, The Gallic War * William Smith, D.C.L., LL.D.: A Dictionary of Greek and Roman Antiquities, John Murray, London, 1875. * The Punic Wars, Adrian Goldsworthy. * Carnage and Culture, Victor Davis Hanson * The Fall of the Roman Empire: The Military Explanation, by Arther Ferrill, 1988 * The Complete Roman Army, by Adrian Goldsworthy * The Military System Of The Romans, by Albert Harkness * From the Rise of the Republic and the Might of the Empire to the Fall of the West, by Nigel Rodgers == Other websites == * The Roman Military Museum with ancient military equipment * The Roman Army Page , Gary Brueggeman (pop-up ads) * UNRV's Roman Military * Essays on life in the Late Roman Army , troop types etc. by members of the Comitatus Reenactmen and Living history group. * The Roman Army at Roman-Empire.net * Lego V Living History Group in Tennessee == References == Category:Military of ancient Rome Category:Armies",
 "title": "Roman legion"
}