{
 "id": "645208",
 "text": "The Distinguished Flying Cross (DFC) is the third-level military medal given to members of the United Kingdom's Royal Air Force and other services. It was also given to members of other Commonwealth countries. The medal was awarded for \"an act or acts of valour, courage or devotion to duty whilst flying in active operations against the enemy\".\"No. 31674\". The London Gazette. 5 December 1919. p. 15049 == History == The award was established on 3 June 1918, shortly after the formation of the Royal Air Force (RAF). It was originally awarded to RAF officers. During the Second World War, it was also awarded to Royal Artillery officers serving with the RAF as pilots and artillery observers. In 1993 the medal replaced the Distinguished Flying Medal, which had until then been awarded to other ranks. People awarded the Distinguished Flying Cross are allowed to use the post-nominal letters \"DFC\". A bar is added to the ribbon for holders of the DFC who received a second award. During the First World War, about 1,100 DFCs were awarded, with 70 first bars and 3 second bars. During the Second World War, 20,354 DFCs were awarded, the most of any award, with about 1,550 first bars and 45 second bars.Carter, Nick; Carter, Carol (1998). The Distinguished Flying Cross and How It Was Won. London: Savannah Publications. . Honorary awards were made on 964 occasions to people from other non-Commonwealth countries. == Description == The decoration is a cross flory and is 2⅛ inches wide. The horizontal and bottom bars have bumps at the end, while the upper bar has a rose. The front of the medal has aeroplane propellers, placed on the vertical arms of the cross, and wings on the horizontal arms. In the centre is a laurel wreath around the RAF monogram, with a heraldic Imperial Crown on the top. The back of the medal has the Royal Cypher in the centre and the year of issue engraved on the lower arm. The decoration is issued named. The ribbon was originally white with purple broad horizontal stripes. This was changed in 1919 to the current white with purple broad diagonal stripes. The decoration was designed by Edward Carter Preston.Crompton, Ann, ed. (1999). Edward Carter Preston, 1885–1965: Sculptor, Painter, Medallist. Liverpool: University of Liverpool Art Gallery. . Distinguished Flying Cross ribbon bars DFC DFC and Bar DFC and Two Bars 1918–1919 since 1919 == Notable award winners == * John Balmer, RAAF pilot * Roy Calvert; RNZAF pilot who was awarded the DFC three times. * Major General Levi R. Chase; American flying ace, awarded DFC with Bar (WWII and Korea) * Flight Lieutenant Pierre Clostermann, French RAF officer; in 1945 who was awarded RAF DFC & Bar. * Harry Cobby; flying ace of the Australian Flying Corps who was awarded the DFC three times. * Gordon Cochrane; RNZAF pilot who was awarded the DFC three times. * Flight Lieutenant Michelle Goodman; in 2008, she became the first woman to be awarded the DFC.\"No. 58633\". The London Gazette (Supplement). 7 March 2008. p. 3616. * Peter Stanley James, RAF * Philip Robinson, RAF pilot who was awarded the DFC three times. * Arjan Singh; Indian Air Force was awarded the DFC. He later become Marshal of Indian Air Force * Mohinder Singh Pujji; Indian Air Force was awarded the DFC. * Group Captain Peter Woolridge Townsend; Royal Air Force CVO, DSO, DFC & Bar (22 November 1914 – 19 June 1995) was a British Royal Air Force officer, flying ace, courtier and author. He was Equerry to King George VI 1944–1952 and held the same position for Queen Elizabeth II 1952–1953. Townsend also had a romance with Princess Margaret. * Harold Whistler; Royal Flying Corps flying ace who was awarded the DFC three times. == References == == Other websites == * Search recommendations for the Distinguished Flying Cross on The National Archives website. Category:Military honors",
 "title": "Distinguished Flying Cross (United Kingdom)"
}