{
 "id": "645324",
 "text": "A Blockchain (or block chain) is a series of digital entries, which cannot be easily changed once they are created. It is commonly used in cryptocurrency. It is how digital transactions are recorded and verified. This is done by using several concepts from cryptography, including digital signatures and hash functions. In very basic terms, a blockchain combines the following two ideas: # Given some data, it is easy to calculate a checksum over the data. Special hash functions can be designed to calculate this checksum. These functions can be designed to return a value that always has the same length, which is not dependent on the length of the input. This value is called hash value, or message digest. The functions also have another property: Given the same input, they must return the same output (hash value/message digest). # In addition to the hash values, a block typically also contains a timestamp, and some payload. Each block uses a digital signature, which allows detecting any change in the data since the signature was made. When new blocks of data are created, the newly created block will also contain the hash value of the previous block. Friday, February 21, 2020 In most cases, a blockchain is managed by a peer-to-peer network. All peers use a common protocol that specifies how they should communicate with each other, how a new block is created and validated. Once recorded, the data in any given block cannot be changed easily any more. Changing the block means all the blocks after it need to be changed as well. Depending on the protocol, this will require a majority of the peers, or even all the peers, to agree. Blockchains are secure by design. Blockchain technology is used where keeping a correct record is important. Use cases include medical records, identity management, food traceability, gaming and voting. Friday, January 10, 2020 Blockchain was invented by Stuart Haber and Scott Stornetta in 1991 as a means to assure the integrity of digital records. Haber and Stornetta launched the world's first commercial blockchain; Surety in 1995. In 2008, Satoshi Nakamoto included as references 3 and 4 of Bitcoin: A Peer to Peer Electronic Cash System, the two papers by Haber and Stornetta to serve as the public transaction ledger of the cryptocurrency bitcoin. Because of its blockchain, bitcoin became the first digital currency to solve the double-spending problem without the need of a trusted authority or central server. The bitcoin design has inspired other applications. ==References== ==Other websites== * ETH Blockchain Initiative – ETH Blockchain Initiative | ETH Zurich Category:Computer science Category:Cryptocurrency",
 "title": "Blockchain"
}