{
 "id": "645562",
 "text": "The 2020 UEFA Champions League Final was the final match of the 2019–20 UEFA Champions League. It was played on 23 August 2020 at the Estádio da Luz in Lisbon, Portugal, between Paris Saint-Germain and Bayern Munich. The match was held behind closed doors due to the COVID-19 pandemic in Turkey. Originally, it had been scheduled to be played at the Atatürk Olympic Stadium in Istanbul, Turkey, on 30 May 2020. On 17 June 2020, the UEFA Executive Committee chose to relocate the final to Lisbon as part of a \"final-eight tournament\" consisting of single-match knockout ties played in two stadiums across the city. == Teams == In the following table, finals until 1992 were in the European Cup era, since 1993 were in the UEFA Champions League era. Team Previous final appearances (bold indicates winners) Paris Saint-Germain None Bayern Munich 10 (1974, 1975, 1976, 1982, 1987, 1999, 2001, 2010, 2012, 2013) == Venues == The final was originally scheduled to be played at the Atatürk Olympic Stadium in Istanbul, Turkey, on 30 May 2020. However, UEFA announced on 23 March 2020 that the final was postponed due to the COVID-19 pandemic. On 17 June 2020, the UEFA Executive Committee chose to relocate the final to Lisbon as part of a \"final-eight tournament\" consisting of single-match knockout ties played in two stadiums across the city. The UEFA Executive Committee chose the Estádio da Luz, officially known as the Estádio do Sport Lisboa e Benfica, in Lisbon as the final venue at their meeting on 17 June 2020. The home stadium of Benfica since 2003, it was rebuilt to host five matches of UEFA Euro 2004, including the final. Before its demolition in 2003, to make way for the new 65,000-capacity ground, the original Estádio da Luz hosted the 1992 European Cup Winners' Cup Final, where Werder Bremen beat Monaco 2–0, and the second leg of the 1983 UEFA Cup Final, where Anderlecht secured a 1–1 draw with Benfica to lift the trophy. Lisbon had also hosted a European Cup final in 1967, when Celtic beat Inter Milan 2–1 at the Estádio Nacional. Lisbon also hosted the 2005 UEFA Cup Final at the Estádio José Alvalade, home of Benfica's local rivals and finalists Sporting CP, who lost 3–1 to CSKA Moscow. == Background == Paris Saint-Germain reached their first Champions League final. They entered the final having played 110 matches in the European Cup and Champions League, the most for a final debutant, surpassing Arsenal's record of 90 matches prior to their final appearance in 2006. Bayern Munich reached their eleventh Champions League final, tying Milan for the second-most finals behind Real Madrid's 16. Recently, they appeared in the 2013 final, in which they won 2–1 against Borussia Dortmund for their fifth title. == Road to the final == Note: In all results below, the score of the finalist is given first (H: home; A: away; N: neutral). Paris Saint-Germain Round Bayern Munich Opponent Result Group stage Opponent Result Real Madrid 3–0 (H) Matchday 1 Red Star Belgrade 3–0 (H) Galatasaray 1–0 (A) Matchday 2 Tottenham Hotspur 7–2 (A) Club Brugge 5–0 (A) Matchday 3 Olympiacos 3–2 (A) Club Brugge 1–0 (H) Matchday 4 Olympiacos 2–0 (H) Real Madrid 2–2 (A) Matchday 5 Red Star Belgrade 6–0 (A) Galatasaray 5–0 (H) Matchday 6 Tottenham Hotspur 3–1 (H) Group A winners Final standings Group B winners Opponent Agg. 1st leg 2nd leg Knockout phase Opponent Agg. 1st leg 2nd leg Borussia Dortmund 3–2 1–2 (A) 2–0 (H) Round of 16 Chelsea 7–1 3–0 (A) 4–1 (H) Atalanta 2–1 (N) Quarter-finals Barcelona 8–2 (N) RB Leipzig 3–0 (N) Semi-finals Lyon 3–0 (N) == Pre-match == === Identity === The original identity of the 2020 UEFA Champions League Final was unveiled at the group stage draw on 29 August 2019. === Ambassador === The ambassador for the original Istanbul final was Hamit Altıntop, who finished as runner-up in the 2009–10 UEFA Champions League with Bayern Munich as well as winning the 2003 and 2004 UEFA Intertoto Cups with Schalke 04. === Officials === On 20 August 2020, UEFA named Italian Daniele Orsato as the referee for the final. He was joined with Lorenzo Manganelli and Alessandro Giallatini as assistant referees, Massimiliano Irrati as the video assistant referee and Marco Guida as the assistant VAR official. The fourth official was Ovidiu Hațegan, while Roberto Díaz Pérez del Palomar and Alejandro Hernández Hernández served as the offside and support VAR officials, respectively. === Team selection === Each team made one change to their starting line-up following the semi-finals. After recovering from injury, Keylor Navas started in place of Sergio Rico. For Bayern Munich, Hansi Flick decided to replace Ivan Perišić, and Kingsley Coman on the left wing. Jérôme Boateng was also fit to start for Bayern, having suffered a minor injury in the semi-final which required him to be substituted off at half-time. == Match == ===Details=== The \"home\" team (for administrative purposes) was determined by an additional draw held on 10 July 2020 (after the quarter-final and semi-final draws), at the UEFA headquarters in Nyon, Switzerland. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Keylor Navas RB 4 Thilo Kehrer CB 2 Thiago Silva (c) CB 3 Presnel Kimpembe LB 14 Juan Bernat CM 21 Ander Herrera CM 5 Marquinhos CM 8 Leandro Paredes RF 11 Ángel Di María CF 7 Kylian Mbappé LF 10 Neymar Substitutes: Substitutes: Substitutes: GK 16 Sergio Rico GK 30 Marcin Bułka DF 20 Layvin Kurzawa DF 22 Abdou Diallo DF 25 Mitchel Bakker DF 31 Colin Dagba MF 6 Marco Verratti MF 19 Pablo Sarabia MF 23 Julian Draxler MF 27 Idrissa Gueye FW 17 Eric Maxim Choupo-Moting FW 18 Mauro Icardi Manager: Manager: Manager: Thomas Tuchel Thomas Tuchel Thomas Tuchel Man of the Match: Kingsley Coman (Bayern Munich) Assistant referees: Lorenzo Manganelli (Italy) Alessandro Giallatini (Italy) Fourth official: Ovidiu Hațegan (Romania) Video assistant referee: Massimiliano Irrati (Italy) Assistant video assistant referee: Marco Guida (Italy) Offside video assistant referee: Roberto Díaz Pérez del Palomar (Spain) Support video assistant referee: Alejandro Hernández Hernández (Spain) Match rules *90 minutes *30 minutes of extra time if necessary *Penalty shoot-out if scores still level *Twelve named substitutes *Maximum of five substitutions, with a sixth allowed in extra time === Statistics === First half Statistic Paris Saint-Germain Bayern Munich Goals scored 0 0 Total shots 6 5 Shots on target 2 1 Saves 1 2 Ball possession 38% 62% Corner kicks 2 2 Fouls committed 8 9 Offsides 1 0 Yellow cards 0 1 Red cards 0 0 Second half Statistic Paris Saint-Germain Bayern Munich Goals scored 0 1 Total shots 3 7 Shots on target 1 1 Saves 0 1 Ball possession 40% 60% Corner kicks 2 2 Fouls committed 8 13 Offsides 1 1 Yellow cards 4 3 Red cards 0 0 Overall Statistic Paris Saint-Germain Bayern Munich Goals scored 0 1 Total shots 9 12 Shots on target 3 2 Saves 1 3 Ball possession 39% 61% Corner kicks 4 4 Fouls committed 16 22 Offsides 2 1 Yellow cards 4 4 Red cards 0 0 == Related pages == * 2020 UEFA Europa League Final * 2020 UEFA Women's Champions League Final * 2020 UEFA Super Cup ==References== ==Notes== ==Other websites== * UEFA Champions League (official website) Category:2020 in European football Category:August 2020 events Category:Football in Portugal Category:UEFA Champions League finals",
 "title": "2020 UEFA Champions League final"
}