{
 "id": "645601",
 "text": "The impeachment of Bill Clinton began in December 1998 by the House of Representatives and led to a trial in the Senate for the impeachment of Bill Clinton, the 42nd President of the United States, on two charges, one of perjury and one of obstruction of justice. These charges were caused from a sexual harassment lawsuit filed against Clinton by Paula Jones. Clinton was found not guilty of these charges by the Senate on February 12, 1999. Four charges were considered by the full House of Representatives; two passed, making Clinton the second president to be impeached, after Andrew Johnson in 1868. ==House vote== H. Res. 611 – Impeaching President Bill Clinton December 19, 1998 H. Res. 611 – Impeaching President Bill Clinton December 19, 1998 H. Res. 611 – Impeaching President Bill Clinton December 19, 1998 H. Res. 611 – Impeaching President Bill Clinton December 19, 1998 H. Res. 611 – Impeaching President Bill Clinton December 19, 1998 First article (perjurygrand jury) Party Party Party Total votes First article (perjurygrand jury) Democratic Republican Independent Total votes Yea 5 223 0 228 Nay 200 5 1 206 Second article (perjuryJones case) Party Party Party Total votes Second article (perjuryJones case) Democratic Republican Independent Total votes Yea 5 200 0 205 Nay 200 28 1 229 Third article (obstruction of justice) Party Party Party Total votes Third article (obstruction of justice) Democratic Republican Independent Total votes Yea 5 216 0 221 Nay 199 12 1 212 Fourth article (abuse of power) Party Party Party Total votes Fourth article (abuse of power) Democratic Republican Independent Total votes Yea 1 147 0 148 Nay 203 81 1 285 Source: ==Verdict== The Senate vote: Articles of Impeachment, U.S. Senate judgement Articles of Impeachment, U.S. Senate judgement Articles of Impeachment, U.S. Senate judgement Articles of Impeachment, U.S. Senate judgement Article One (perjurygrand jury) Party Party Total votes Article One (perjurygrand jury) Democratic Republican Total votes Guilty 0 45 45 Not guilty 45 10 55 Article Two (obstruction of justice) Party Party Total votes Article Two (obstruction of justice) Democratic Republican Total votes Guilty 0 50 50 Not guilty 45 5 50 ==References== Category:1998 in the United States Category:Bill Clinton Bill Clinton",
 "title": "Impeachment of Bill Clinton"
}