{
 "id": "645624",
 "text": "Johann Baptist Allgaier (19 June 1763, Schussenried – 3 January 1823, Vienna) was a German-Austrian chess master and theoretician. He was also the author of the first chess handbook in German – Neue theoretisch-praktische Anweisung zum Schachspiel (Vienna 1795–96).W. Litmanowicz and J. Giżycki (1986, 1987). Szachy od A do Z. Wydawnictwo Sport i Turystyka Warszawa. (1. A-M), (2. N-Z) == Biography == Johann Baptist Allgaier was born in 1763 in the Duchy of Württemberg. His father, Georg Allgaier, worked at a monastery as a Hofmeister, the person in charge of the education of the children of the rich and noble families. Johann's father wanted him to study theology. On a trip to Poland he learned to play chess.A. B. Reissner, Allgaier, in: Neue Berliner Schachzeitung (1870) pages 193-197 In 1798, he moved to Vienna and joined the army.P. R. von Bilguer, Handbuch des schachspiels (1891) pages 49-50 He was able to improve his chess skills. In 1780, he won a game with a prize of 1500 florins and became Vienna's best player.A. van der Linde, Geschichte und litteratur des schachspiels, Volume 1 (1874) pages 419-420 He taught many people to play chess, including the sons and brothers of the Emperor Francis II. Allgaier fought in the Napoleonic wars between Austria and France. In 1809, he worked in an army hospital, where he became ill with asthma. When the hospital was moved to Prague he became its accountant. He returned to Vienna in 1816 where the Emperor gave him a small pension. To make extra money, he played chess in the cafés.D. Hooper and K, Whyld, The Oxford Companion to Chess (2nd ed.), 1992, page 18 His games were said to be brilliant and focused on attacking. When he played, people would come to watch. One man, Santo Vito, wrote down some of these games which were included in Allgaier's book.J. Allgaier, Neue theoretisch-pratische anweisung zum schachspiele (6th ed. edited by Santo Vito) (1834) pages 220-222 He would play anyone for the price of one gulden. The price also included a short lesson after the game. Allgaier was always looking for ways to make money.cited in: A. van der Linde, Geschichte und litteratur des schachspiels, Volume 1 (1874) pages 419-420 This is probably why he worked with Mälzel to operate the Turk. Allgaier played hidden inside the chess machine in 1809.D. Fiske, The Book of the first American Chess Congress (1859) page 431 He is believed to be the player controlling the Turk when it won a game against Napoleon at Schönbrunn Palace.Napoleon - The Turk Schönbrunn 1809 at chessgames.com In December 1822, he was sent to the military hospital in Vienna and died a few days later of dropsy. == Influence on chess == In 1795 and 1796 he published his book Neue Theoretische-praktische Anweisung zum Schachspiel.J. Allgaier, Neue theoretisch-praktische anweisung zum schachspiel, Teil 1 (1795)J. Allgaier, Neue theoretisch-praktische anweisung zum schachspiel, Teil 2 (1796) This was said to be the best chess book of the time.D. Hooper and K. Whyld, The Oxford Companion to Chess (2nd ed.), 1992, page 18 It was reprinted several times, the seventh and final edition was in 1843. == References == Category:1763 births Category:1823 deaths Category:German chess players",
 "title": "Johann Baptist Allgaier"
}