{
 "id": "645663",
 "text": "Stacey Yvonne Abrams (born December 9, 1973) is an American politician, lawyer, romance novelist, and businesswoman. She was the house minority leader for the Georgia General Assembly and state representative for the 89th House District. She is a member of the Democratic Party. ==Career== Abrams was the Democratic nominee in the 2018 Georgia gubernatorial election, the first black female major party gubernatorial nominee in the United States. She lost the general election to Republican Secretary of State Brian Kemp. Abrams erroneously claimed she won the governorship and today still claims the election was stolen from her. In June 2018 Stacey Abrams joined the 9th annual Augusta Pride festival and talked about her campaign. Abrams received a single vote from Rep. Kathleen Rice for the 2019 election for Speaker of the United States House of Representatives. In early February 2019, Abrams became the first African-American woman to deliver a State of the Union response to President Trump's earlier delivery. On December 1, 2021, she announced she would be once again running for governor in the 2022 gubernatorial election. She was defeated by Brian Kemp in the general election. ==References== Category:1973 births Category:Living people Category:Lawyers from Madison, Wisconsin Category:Writers from Georgia (U.S. state) Category:Businesspeople from Georgia (U.S. state) Category:Politicians from Georgia (U.S. state) Category:Writers from Wisconsin Category:Politicians from Madison, Wisconsin Category:Democratic Party (United States) politicians Category:21st-century American novelists Category:21st-century American politicians Category:African-American politicians Category:African-American writers Category:American civil rights activists Category:American company founders Category:American human rights activists Category:Lawyers from Georgia (U.S. state) Category:Yale University alumni Category:Spelman College alumni",
 "title": "Stacey Abrams"
}