{
 "id": "64582",
 "text": "Mother Teresa (26 August 1910 – 5 September 1997), was an Albanian Roman Catholic nun who started the Missionaries of Charity and won the Nobel Peace Prize in 1979 for her humanitarian work. For over forty years, she cared for poor, sick, orphaned, and dying people in Calcutta (Kolkata), India. She was guided in part by the ideals of Saint Francis of Assisi. She was born in Skopje, Macedonia, and died in Calcutta. As the Missionaries of Charity grew under her leadership, they expanded their ministry to other countries. By the 1970s Mother Teresa was well known internationally as an advocate for the poor and helpless. This was due in part to a movie and book called Something Beautiful for God by Malcolm Muggeridge. Mother Teresa strongly opposed abortion. She once said: \"The greatest destroyer of peace is abortion because if a mother can kill her child, what is left for me to kill you and you to kill me?\". Following her death, Pope John Paul II first beatified Mother Teresa. Then on 4 September 2016, in a ceremony at Saint Peter's Church in Vatican City, he named her a saint. He also gave her the title Blessed Teresa of Calcutta.Associate Press, \"Full house for Mother Teresa ceremony\" October 14, (2003; retrieved from CNN on May 30, 2007.\"Blessed Mother Teresa,\" in Encyclopædia Britannica (2007). Retrieved May 30, 2007, from Encyclopædia Britannica Online Saint Mother Teresa received many awards for her work. These included the Nobel Peace Prize in 1979 and the Bharat Ratna (India's highest civilian award) in 1980. ==Criticism== Both before and after her death, Mother Teresa received criticism, especially in recent years as debate about abortion grew. In 1995 Christopher Hitchens wrote a very critical book about Mother Teresa called The Missionary Position. In the book, he argued that instead of trying to help the poor, Mother Teresa encouraged them to endure pain and continue suffering. He also suggested that she opposed ending poverty and raising women's social status. Later, in a 2003 article for Slate, Hitchens wrote: \"Mother Teresa was not a friend of the poor. She was a friend of poverty. She said that suffering was a gift from God\". ==See also== * Tirana International Airport Nënë Tereza, named after her. == References == == Other websites == * Mother Teresa of Kolkata information * Speech On Mother Teresa In English : Nobel Peace Prize Speech Category:1910 births Category:1997 deaths Category:Albanian people Category:Christian saints Category:Deaths from heart failure Category:Nuns Category:Order of Merit Category:People from Skopje Category:Roman Catholics",
 "title": "Mother Teresa"
}