{
 "id": "645881",
 "text": "The Maratha Empire, or Maratha Confederacy, was a group of Indian states that dominated much of the Indian subcontinent in the 17th and the 18th centuries. The empire formally existed from 1674 to 1820. The Marathas are given much of the credit for ending Mughal rule in India.Delhi, the Capital of India By Anon, John Capper, p. 28. \"This source establishes the Maratha control of Delhi before the British\"An Advanced History of Modern India By Sailendra Nath Sen p.Introduction-14. The author says: \"The victory at Bhopal in 1738 established Maratha dominance at the Mughal court\" The Marathas were a warrior people from the western Deccan Plateau (present-day Maharashtra). They rose to prominence by establishing \"self-rule of Hindu/Indian people\" in their region. : \"Shivaji's coronation and setting himself up as a sovereign prince symbolises the rise of the Indian people in all parts of the country. It was a bid for Hindawi Swarajya (Indian rule), a term in use in Marathi sources of history.\" The Marathas became prominent in the 17th century under the leadership of Shivaji who revolted against the Adil Shahi dynasty and the Mughal Empire and formed a kingdom, with Raigad as his capital. Known for their mobility, the Marathas were able to consolidate their territory during the Mughal–Maratha Wars and later controlled a large part of the Indian subcontinent stretching from Peshawar in the north to Thanjavur in the south with their capital at Pune in the year 1758. Their power was eventually ended by the series of wars fought against the British Empire. The first two Anglo- Maratha wars resulted in a victory for the Marathas however the third one resulted in the defeat of the Marathas and annexation of the Maratha Empire in Maharashtra into British India. The Marathas had another opportunity to rebel against British rule and form their own kingdom in the Indian Rebellion of 1857. They joined this rebellion in the hopes of permanently kicking the British power out of India. However, by the end of 1859, the rebellion was crushed and all the Maratha rebel leaders were either executed or went into exile and took refuge in Nepal. ==Thanjavur Branch== It was founded by Ekoji the step Brother of Shivaji and it was independent till 1855. Shahji II helped Marathas again Mughals in Deccan wars but was defeated by Zulfiqar khan during during an Expedition to Tanjore. Shivaji of Tanjore was last Ruler of Thanjavur till it was annexed by East India Company in 1855. == Related pages == * Maratha dynasty ==References== Category:17th century in India Category:Former countries in Asia Category:18th century in India",
 "title": "Maratha Empire"
}