{
 "id": "645915",
 "text": "Jacques François Mouret (1787–1837) was a French chess player. He became the chess teacher of the future Louis Philippe I. He was one of the most successfulThe Oxford Companion to Chess - David Hooper and Kenneth Whyld (1992) p.265 operators of The Turk, a famous chess-playing machine. == Biography == Mouret was a great-nephew of the famous chess player François- André Danican Philidor. He learned the game at the Café de la Régence, taught by Bernard and Carlier, two of Philidor's students.Le Palamède edited by St. Amaint (1837) p. 112 He was a pupil of Alexandre DeschapellesG. Walker, Chess and chess-players (1850) p. 48 and later he became a teacher of La Bourdonnais.Le Palamède edited by St. Amaint (1847) p. 211 He also gave chess lessons to the children of the French King Louis Philippe I. In 1819, he was the operator of The Turk during its tour in England and probably the person, who sold the secret of The Turk to the press.G. Walker, Chess and Chess Players (1850) p. 28 Mouret was an alcoholic. In 1842 the editor of the chess magazine Le Palamède, said \"He was a clever fellow, sharp, gay, lively, amusing, and had studied seriously the theory of chess, by which he made his living. His talent redeemed a little the rudeness of his manner and a certain licentiousness which he indulged in. He used to be in a continual state of semi-intoxication\". George Walker wrote that \"His brain was consumed in the Brandy\".G. Walker, Chess and Chess Players (1850) p. 26 Mouret was believed to have written a book in 1836, The Treaty Elementary Game of Chess.C. Adam, The Treaty Elementary Chess Game, reviewed by J. F. Mouret (1836) But later evidence shows that he only made some corrections to the text.The Hansard, December 27, 1837 He had no money when he died and so the members of the Chess Club of Paris paid for his funeral. == Mouret and The Turk == Mouret is best known as the person hidden inside The Turk, a fake chess-playing machine. Mouret was one of many great chess players who worked inside the machine, others being Johann Baptist Allgaier, who defeated Napoleon in 1809, Schlumberger, Boncourt and Lewis.G. Walker, Chess and chess-players (1850) p. 55 Fifty games played by Mouret from inside the Turk in London in 1819, are collected in a book published in 1820.W. Hunnemann, A selection of 50 games played by the automaton chess player (1820) In the beginning of the book it was written that out of 300 games, the Turk (Mouret) only lost six. Mouret's weakness for drinking often left him without any money, so he probably sold the secret of the Turk in 1834 to Le Magasin picturesque.Le Magasin picturesque edited by E. Charton, (1834) p. 155 The article, An attempt to analyze the automaton chess-player of M. Kempelen, explained how a man could be hidden inside the Turk. Mouret was not named, but many people. including Walker, believe he was the source. The French master was sick and short of money at the time, and died three years later. == The French Defense == Mouret often used a move now called the French Defense.Westminster papers edited by the Westminster Chess Club (1874) p. 25 He was one of the only players to use it and is one of the main reasons for it being called the French Defense. Mouret taught the move to players at the Café de la Régence.Le Palamède edited by St. Amaint (1846) p. 20 One of his students convinced the Paris team to use the defense in games played by letters against a London team. Following the victory of the French team, the opening quickly became known as the French Defense.Papers of the Exchequer French - Marcel Lamarre article under the pseudonym: An Amateur Ex UAAR (3rd Book 1925) p75-76 == References == == Other websites == * HERITAGE des ECHECS FRANCAIS (in French) * Additional games of Mouret (or The Turk operated by Mouret) at chessgames.com ,,, Category:1787 births Category:1837 deaths Category:French chess players",
 "title": "Jacques François Mouret"
}