{
 "id": "645981",
 "text": "The President of Mexico (), officially known as the President of the United Mexican States (),Article 80, Constitution of Mexico. is the head of state and government of Mexico. Under the Constitution, the president is also the Supreme Commander of the Mexican armed forces. The current President is Claudia Sheinbaum, who took office on October 1, 2024. ==List of presidents== === Modern Mexico (1934–present) === After the constitutional reform of 1926, the presidential term in Mexico was extended to six years starting in 1928; with a formal ban on reelection. After the federal election of 1934 all the presidents have completed their six-year terms. ; Parties No. President Took office Left office Elections Lázaro Cárdenas (1895–1970) December 1, 1934 November 30, 1940 1934 Manuel Ávila Camacho (1896–1955) December 1, 1940 November 30, 1946 1940 Miguel Alemán Valdés (1900–1983) December 1, 1946 November 30, 1952 1946 Adolfo Ruiz Cortines (1889–1973) December 1, 1952 November 30, 1958 1952 Adolfo López Mateos (1910–1969) December 1, 1958 November 30, 1964 1958 Gustavo Díaz Ordaz (1911–1979) December 1, 1964 November 30, 1970 1964 Luis Echeverría (1922–2022) December 1, 1970 November 30, 1976 1970 José López Portillo y Pacheco (1920–2004) December 1, 1976 November 30, 1982 1976 (uncontested) Miguel de la Madrid (1934–2012) December 1, 1982 November 30, 1988 1982 Carlos Salinas de Gortari (born 1948) December 1, 1988 November 30, 1994 1988 Ernesto Zedillo (born 1951) December 1, 1994 November 30, 2000 1994 Vicente Fox (born 1942) December 1, 2000 November 30, 2006 2000 Felipe Calderón (born 1962) December 1, 2006 November 30, 2012 2006 Enrique Peña Nieto (born 1966) December 1, 2012 November 30, 2018 2012 Andrés Manuel López Obrador (born 1953) December 1, 2018 September 30, 2024 2018 Claudia Sheinbaum (born 1962) October 1, 2024 Incumbent 2024 ==Requirements== To be eligible to serve as president, Article 82 of the Constitution specifies that the following requirements must be met: * Be a natural-born citizen of Mexico (\"mexicano por nacimiento\") able to exercise full citizenship rights, with at least one parent who is a natural-born citizen of Mexico. * Be a resident of Mexico for at least twenty (20) years. * Be thirty-five years of age or older at the time of the election. * Be a resident of Mexico for the entire year prior to the election (although absences of 30 days or fewer are explicitly stated not to interrupt residency). * Not be an official or minister of any church or religious denomination. * Not be in active military service during the six months prior to the election. * Not be a secretary of state or under- secretary of state, attorney general, governor of a State, or head of the government of Mexico City, unless \"separated from the post\" (resigned or been granted permanent leave of absence) at least six months prior to the election. * Not have been president already, even in a provisional capacity (see Succession below). ==Powers== The 1917 Constitution was influenced from the Constitution of the United States. It made it clear separation of powers while giving the president wider powers than his American counterpart. However, this has only recently become the case in practice. ==Residence== The President's official residence and main workplace is Los Pinos, located inside the Bosque de Chapultepec (Chapultepec Park). The President has the right to use this residence for the six-year term of office. ==Living former Presidents== There are six living former presidents. The most recent former president to die was Luis Echeverría (1970-1976), on 8 July 2022. File:Carlos Salinas.jpg|Carlos Salinas de Gortari (1988–1994) File:Ernesto_Zedillo_Ponce_de_Leon_World_Economic_Forum_2013_crop.jpg|Ernesto Zedillo (1994–2000) File:Vicente Fox by Gage Skidmore 2.jpg|Vicente Fox (2000–2006) File:Felipe Calderon 20090130.jpg|Felipe Calderón (2006–2012) File:Enrique Peña Nieto 2017 (cropped).jpg|Enrique Peña Nieto (2012–2018) File:Andrés Manuel López Obrador junio 2024.jpg|Andrés Manuel López Obrador (2018–2024) ==References== ==Other websites== *President of México - Official government website *",
 "title": "President of Mexico"
}