{
 "id": "646377",
 "text": "Aquatic locomotion is animals and other organisms moving through water. The surface of the world is mostly covered with water, and all major animal phyla started life in the water. The earliest fossils we have are those of stromatolites, which are mat-like structures formed by photosynthetic bacteria in the sea.J. William Schopf 1999. Cradle of Life: the discovery of Earth's earliest fossils. Princeton U. Press Even animals which evolved on land have often returned to the water, even though they usually continue to breath air. There are aquatic insects, reptiles, mammals and birds. We don't quite know when the first animals and plants evolved, but some guesstimates have been made. Acritarchs are present from about 3200 to 1400 million years ago to the present. That's a wide time-range which means we cannot be sure when they evolved. They seem to have been grazed (eaten) by some early forms of life. Probably some kind of protist developed using existing life forms as food. Locomotion is needed to find the right place in the seas, and to eat and avoid being eaten. All advanced forms of life, and many primitive forms of life, use locomotion. == Propulsion systems == === Microorganisms === The simplest propulsive systems evolved in microorganisms. Cilia and flagella are used. Swimming has evolved a number of times in more complex life-forms. Examples include arthropods, fish, molluscs, reptiles, birds, and mammals. Ciliates have hundreds or thousands of small flagella called cilia to move through the water. Certain organisms such as bacteria and animal sperm have a flagellum to move in liquid environments. === Invertebrates === All aquatic invertebrates swim at some stage in their lives, and many swim for their entire life. All jellyfish swim by pulsing their cup-shaped bodies. Crustaceans swim with their legs. Some molluscs swim all their lives, some only as larvae. Squid and octopods swim quite vigorously by 'jet propulsion'. They squirt water out to move. There are a very large number of insects which are aquatic as larvae or adults. Almost all use their legs for swimming. They are air-breathing, and carry air with them as they swim. The air they get from the surface of the water, and take it down with them. Usually, the air is trapped among dense hairs on their surfaces. 13 orders of insects have aquatic stages, including all mayflies and dragonflies, and many beetles, bugs, and flies. === Vertebrates === [to come] == References == Category:Animal locomotion Category:Biological oceanography",
 "title": "Aquatic locomotion"
}