{
 "id": "64631",
 "text": "Resin is a mixture of organic compounds secreted by many plants, especially coniferous trees. Plants evolved many complex chemicals as defences against herbivores. That may be the origin of these resins, which are certainly not good to eat. Plants secrete resins for their protective benefits in response to injury. The resin protects the plant from insects and pathogens. Resins confound a wide range of herbivores, insects, and pathogens. The volatile phenolic compounds may attract benefactors, that is, parasitoids or predators of the herbivores which attack the plant.Langenheim, Jean 2003. Plant resins: chemistry, evolution, ecology, and ethnobotany. Timber Press, Portland OR. Humans also value resins for their many uses. They are used in varnishes, adhesives, as raw materials for organic synthesis, or for incense and perfume. Fossilized resins are the source of amber. The term is also used for synthetic substances with similar properties. Resins contain chemicals composed of carbon, hydrogen, oxygen, nitrogen and sulfur. Synthetic resins are used in laminates, adhesives, flooring, linings, etc. == Rosin == Rosin, (also called 'colophony' or 'Greek pitch') is a solid form of resin. It is got from pines and some other plants, mostly conifers. Heating fresh liquid resin vaporizes light volatiles like terpenes. Rosin is semi-transparent and yellow to black in colour. The term \"colophony\" comes from colophonia resina or \"resin from the pine trees of Colophon\", an ancient Ionic city. == Uses == Rosin has hundreds of uses, of which only a few can be mentioned here. These uses fall into groups, such as: #Resisting slippages (increasing friction): used on stringed instruments, dancers' shoes, in gymnastics, in rock climbing, and on hands of various types of games players. #In manufacturing soap, inks, some paints, paper, varnish, glue, soldering fluxes, and sealing wax. #Pharmaceutical products: tablet film and enteric coating, microcapsules and nanoparticles. #Copal and amber are natural rosins: the lighter components of tree resin evaporated and left a hardened rosin. ==The exit of the resin from the tree== In each type of wood, the resin comes out in a different way. There are trees in which the resin comes from the \"trunk\" and there are types of trees in which the resin comes out of the \"tree branches\". == Resin Harvesting == Some countries in the world also have wood resin harvesting: *In Greece there is the picking of a wooden resin Mastic (plant resin) with a \"slitting\". *In Sudan there is the picking of Acacia wood resin in the form of resin removal from the tree. *In Oman there is the picking of Frankincense resin in the form of peeling the tree trunk. ==The Agricultural Research== There is still no extensive agricultural research regarding the tree resins and also, the exact benefit of the resin production by the tree is currently unknown, but some possible hypotheses have been proposed such as plugging holes (scab of wounds), protection against insects that want to penetrate the tree, and preventing the growth of fungi parasites. == References == Category:Natural materials",
 "title": "Resin"
}