{
 "id": "64645",
 "text": "In Islamic societies, there are many women who believe in the teachings of Islam. While they are believers, they also face many problems. There are many differences by country. In some, there are almost no restrictions, while in others, there are many restrictions placed on women. Generally, there are the following problems: * Islam usually has very fixed views about gender roles. Marriage is between a man and a woman. The role of either partner is determined by Islamic views. There is little room for different setups, such as a woman working, to feed her family, or single-parent families led by women. Similarly, there is little understanding for the LGBT community. * Islam usually tells women how to dress. Usually, they have to cover their body in public. This covering can be a simple headscarf, or it can be a full burqa, only leaving room for the eyes. * Islam imposes gender segregation. Men and women pray in different parts of a mosque; this also reflects in everyday life. Many islamic countries say that this also applies to public transport, and other areas of public life. Until recently, some countries thought that women should not drive a car. * Education for men and women may be different. In some countries, women are banned from getting more than a basic education. * In many countries, women need a male guardian for their legal matters. * In many countries, women are worse off when it comes to sexual crimes such as rape. * Many countries also have a problem with domestic violence. * When they give testimony in court, what they say often does not have the same importance than if a man says the same thing. * Depending on the county, child marriage may be a problem. According to Islamic scripture, Muhammad married Aisha when she was six years old. He consummated the marriage (that is: had sex with her) when she was nine or ten years old. * Some Muslims, most of them in Sub- Saharan Africa, say that female genital mutilation is permissible. Islamic feminism is a type of feminism that focuses on women in Islam. Nawal El Saadawi is an Egyptian feminist who has written many books about women in Islam. Category:Islam",
 "title": "Women in Islam"
}