{
 "id": "646513",
 "text": "The Tokyo subway sarin attack ( was an act of domestic terrorism on 20 March 1995, in Tokyo, Japan, by members of the cult movement Aum Shinrikyo. 13 people were killed. The group had already carried out several assassinations and terrorist attacks using sarin, including the Matsumoto sarin attack nine months earlier. They had also produced several other nerve agents, including VX. The cult had attempted to produce botulinum toxin and had perpetrated several failed acts of bioterrorism. In the raid following the attack, police arrested many senior members of the cult. Police activity continued throughout the summer, eventually arresting over 200 members, including Asahara himself. Thirteen of the senior Aum management have been sentenced to death, with many others given prison sentences up to life. Leader Shoko Asahara was executed in July 2018. == Executions == On July 6, 2018, Asahara and six other Aum Shinrikyo members were executed by hanging. \"Tokyo Sarin attack: Aum Shinrikyo cult leaders executed\". BBC News. 6 July 2018. Retrieved 12 July 2018. Japan's Justice Minister Yōko Kamikawa stated that the crimes \"plunged people, not only in Japan but in other countries as well, into deadly fear and shook society to its core\". Amnesty International criticized the use of the death penalty. While executions are rare in Japan, they have public support according to surveys. There were 13 members on death row at the time: Aum Shinrikyo members executed on 6 July 2018: * Shoko Asahara, leader of Aum Shinrikyo * Yoshihiro Inoue, Aum's \"head of intelligence\" and chief coordinator of the Tokyo subway attack * Tomomitsu Niimi, the getaway driver for Ikuo Hayashi, one of the perpetrators of the Tokyo subway attack * Tomomasa Nakagawa, a perpetrator of the Sakamoto family murder * Kiyohide Hayakawa, Aum's \"construction minister\", convicted of strangling a young cult member in 1989 suspected of dissidence * Seiichi Endo, the \"head scientist\" of Aum Shinrikyo * Masami Tsuchiya, Aum Shinrikyo's chief chemist and director of the sarin gas manufacturing The six remaining Aum Shinrikyo members were executed on 26 July 2018. * Yasuo Hayashi, a perpetrator of the Tokyo subway attack * Kenichi Hirose, a perpetrator of the Tokyo subway attack * Toru Toyoda, a perpetrator of the Tokyo subway attack * Masato Yokoyama, a perpetrator of the Tokyo subway attack * Kazuaki Okazaki, a perpetrator of the Sakamoto family murder * Satoro Hashimoto, a perpetrator of the Sakamoto family murder == References == ==Other websites== *Aum Shinrikyo A history of Aum and list of Aum-related links *The Aum Supreme Truth Terrorist Organization – The Crime library Crime Library article about Aum *I got some pictures of sarin scattered on the metro floor Several pictures taken by One of the passengers on the scene (in Japanese) *\"Homebrew chemical terror bombs, hype or horror?,\" The Register Category:1995 disasters in Asia Category:1990s in Japan Category:20th century in Tokyo Category:March 1995 events Category:Mass murder in Asia Category:Mass murder in the 1990s Category:Murder in 1995 Category:Terrorist incidents in Asia in the 1990s",
 "title": "Tokyo subway sarin attack"
}