{
 "id": "64665",
 "text": "Home Alone is a 1990 American comedy action movie mostly set in Chicago, Illinois, Paris, Dallas, and Scranton. It was written and produced by 20th Century Fox by John Hughes and directed by Chris Columbus. It stars Macaulay Culkin and features Joe Pesci, Daniel Stern, John Heard, Catherine O'Hara, Devin Ratray, Roberts Blossom, and John Candy. ==Plot== The McCallister family is preparing to spend Christmas in Paris, gathering at Kate and Peter's home in a Chicago suburb on the night before their departure. Kate and Peter's youngest son, Kevin, is the subject of ridicule by his older siblings and cousins. Kevin inadvertently ruins the family dinner after a brief scuffle with his oldest brother Buzz, in which Kevin's airplane ticket is accidentally thrown away, resulting in Kate sending him up to the attic. Kevin berates his mother for allowing the rest of the family to pick on him and wishes that his family would disappear. During the night, heavy winds create a power outage, disabling the alarm clocks and causing the family to oversleep. In the confusion and rush to get to the airport, Kevin is accidentally left behind. Kevin wakes to find the house empty and the family cars still in the garage, unaware that they had rented vans to take them to the airport. Thinking that his wish has come true, he is overjoyed with his newfound freedom. Later, Kevin becomes frightened by his next-door neighbor, \"Old Man\" Marley, who is rumored to be a serial killer who murdered his own family. The McCallister home is soon stalked by the \"Wet Bandits,\" Harry and Marv, a pair of burglars who have been breaking into other vacant houses in the neighborhood. Kevin tricks them into thinking that his family is still home, forcing them to postpone their plans to rob the McCallister house. Kate realizes mid-flight that Kevin was left behind, and upon arrival in Paris, the family discovers that all flights for the next two days are booked, and that the phone lines are still down back home in Chicago. Peter and the rest of the family stay in his brother's apartment in Paris, while Kate manages to get a flight back to Scranton, Pennsylvania. She tries to find a flight to Chicago, but all the flights are booked. Kate is overheard by Gus Polinski, the lead member of a traveling polka band, who offers to let her travel with them to Chicago in a moving van. Meanwhile, on Christmas Eve, Harry and Marv finally realize that only Kevin is in the McCallister home, and Kevin overhears them discussing plans to break into the house that night. Kevin starts to miss his family and asks the local Santa Claus impersonator if he could bring his family back for Christmas. He goes to church and watches a choir perform and encounters Marley, who proves the rumors about him are false. Marley points out his granddaughter in the choir and mentions he has never met her since she is the daughter of his estranged son. Kevin suggests to Marley that he should reconcile with his son. Kevin returns home and rigs the house with booby traps. Harry and Marv break in, spring the traps, and suffer various injuries. While Harry and Marv pursue Kevin around the house, he calls the police and lures the duo into a vacant neighboring house that they had previously broken into. Harry and Marv ambush Kevin and prepare to get their revenge, but Marley intervenes and knocks them out with his snow shovel. The police arrive and arrest Harry and Marv, having identified all the houses that they broke into due to their habit of flooding them. On Christmas Day, Kevin is initially disappointed to find that his family is still gone, but Kate arrives home, and they reconcile. The rest of the family then returns after waiting in Paris until they can obtain a direct flight to Chicago. Kevin keeps silent about his encounter with Harry and Marv, although Peter finds Harry's knocked-out gold tooth. Kevin then watches Marley reuniting with his son, daughter-in-law, and granddaughter. ==Popularity== The film was very popular and was followed by five sequels (two theatrical sequels, two made-for-television films, and one reboot): Home Alone 2: Lost in New York (1992). This film brought back most of the original film's cast and has a similar plot and continuity. Home Alone 3 (1997) had different kids and villains. Home Alone 4: Taking Back the House (2002) is the first made-for-television movie and features some of the main characters from the first two films, but with a new cast. Like Home Alone 3, Home Alone 5: The Holiday Heist (2012) doesn't revolve around Kevin, but with newer characters and is the second made-for-television movie. A reboot of the film titled Home Sweet Home Alone released on November 12, 2021. In its opening weekend, Home Alone grossed $17 milliion in 1,202 theaters. The film was nominated for Best Original Score and for Best Original Song. Composer John Williams wrote the music for the movie, as well as Home Alone 2, and some popular songs that have already existed were played during the movie as well. ===By country=== Home Alone has become very popular around the world. Many surveys show that it is one of the most popular Christmas movies in many countries, including the United States and Ireland. It is also particularly popular as a Christmas film in Eastern Europe, particularly in Poland (see below). ====Poland==== Films such as Home Alone and Die Hard are very popular at Christmas time in Poland, because it was one of the first Western movies to come out in Poland since they ended communist rule. In 2000, 8.9 million Poles were watching Home Alone on Christmas Eve; and in 2017, about four million people (11.6% of Poland's population) were watching if on Christmas Eve. In Polish, the movie is called Kevin sam w domu (meaning \"Kevin [is] home alone\"). ===Indian remake=== In 2008, a Hindi remake of Home Alone was made. It was called Hari Puttar: A Comedy of Terrors and was directed by Lucky Kohli & Rajesh Bajaj. Zain Khan starred as the titular character of it. It received positive reviews from critics and was a cinematic masterpiece. ==References== ==Other websites== * Category:1990 comedy movies Category:1990 crime movies Category:1990s criminal comedy movies Category:1990s family movies Category:American criminal comedy movies Category:20th Century Fox movies Category:American family comedy movies Category:Christmas movies Category:1990s English-language movies Category:Movies about dysfunctional families Category:Movies about children Category:Movies about home invasions Category:Movies composed by John Williams Category:Movies produced by John Hughes Category:Movies set in Chicago Category:Movies set in Paris Category:Movies directed by Chris Columbus Category:Screenplays by John Hughes Category:United States National Film Registry movies Category:Movies about mother–son relationships",
 "title": "Home Alone"
}