{
 "id": "64671",
 "text": "Metric is a Canadian band. This band started in 1998 in Toronto, Ontario. Metric is made up of Emily Haines, a singer, and also plays the Synthesizer), James Shaw, who plays the guitar, Josh Winstead, who plays bass guitar, and drummer Joules Scott-Key. Their first CD, called Old World Underground, Where Are You Now?came out in 2003. Their new CD, Live It Out, was released on October 4, 2005. Haines and Shaw are part of a band called Broken Social Scene, and Haines has been a guest on albums by Stars, KC Accidental, Delerium, The Stills, and Jason Collett. Their songs \"Monster Hospital\" and \"Police and the Private\" have been used on the television show Grey's Anatomy. \"Monster Hospital\" has been used in the television show CSI: Miami. Metric continued to work on their first CD in the first few months of 2001. The album under construction included uptempo songs such as the title track \"Grow Up and Blow Away\", \"Raw Sugar\", and \"Soft Rock Star\", and downtempo songs like \"White Gold\", \"The Twist\", and \"Rock Me Now\". \"Parkdale\", Haines and Shaw finished the CD in April and by this time had found a new label — Restless Records, the L.A. indie record company that supported They Might Be Giants, Agent Orange, and The Dead Milkmen. Metric was heard for the first time by many in August 2001 with the advertisement \"Be Afraid\", advertising Polaroid's I-Zone Pocket Fortune film. The music used for the advertisement was taken from the song \"Grow Up and Blow Away\", with the line \"Why does it feel so good to die today?\" changed to \"Why does it feel so good to fly away?\". ==Old World Underground and Live It Out== In 2003, Metric's first album, Old World Underground, Where Are You Now? came out in stores. The album got mostly positive reviews. The group released six songs individually from the album, the most successful being \"Combat Baby\", which was a free song on iTunes in 2004. As of December 12, 2005 the album went gold in Canada. Two years later, Metric released their second studio album on October 4, Live It Out. During this time, Metric was asked and agreed to open for the Rolling Stones in New York City. Live It Out has been a success in Canada, already selling twice as many copies as Old World Underground, Where Are You Now?. The album has gone two times platinum in Canada, selling over 200,000 copies. ==Present== The band is currently recording their third album, to come out in October 2007 in Toronto. Information about the album without a name is not yet out to the public. On June 26, 2007, Last Gang Records bought the songs from Metric's 1999 album Grow up and Blow Away, which had been put off due to delays. ==Discography== ===Albums=== * Grow Up and Blow Away (Recorded 1999 or 2001 ) (Released 2007) * Old World Underground, Where Are You Now? (2003) * Live It Out (2005) * Fantasies (2009) * Synthetica (2012) ===EPs=== * Mainstream EP (1998) * Static Anonymity EP (2001) * Live at Metropolis (2007) * Plug In Plug Out (2009) * Spotify Acoustic EP (2010) * Spotify Covers EP (2010) * iTunes Session EP (2011) === Singles === Grow Up And Blow Away (unreleased) * Grow Up And Blow Away (UK remix promo cd) (2002/Restless Records(*acquired by Rykodisc 2001)) (4:12/UNGR203) (Produced by Metric Remixed by Uncle Grant) Old World Underground, Where Are You Now? * Combat Baby * Succexy (promo) * Dead Disco (promo) (Top 10 on Edge 102 Toronto) Live It Out * Monster Hospital UK #55/CAN #1 * Poster of a Girl CAN #3 * Handshakes (radio promo) CAN #17 * Empty (Digital and Vinyl single released Feb 12/07) ==Other websites== * Official Site * Metric on MySpace * Last Gang Records * Animated music video for the song \"Dead Disco (live)\" taken from KUOM's Stuck on AM, volume 5 * A great acoustic piano session By Emily Haines * Last.fm page for Metric * Complete Lyric Database * Lazy-i Interview: October 2005 Category:1990s music groups Category:2000s music groups Category:2010s music groups Category:Canadian rock bands Category:Indie rock bands Category:New wave bands Category:Musical groups from New York City",
 "title": "Metric (band)"
}