{
 "id": "646923",
 "text": "Miles City is a city in and the county seat of Custer County, Montana, United States. The population was 8,354 at the 2020 census. Miles City is at an altitude of 2369 feet (722 m). It is here the Tongue River flows into the Yellowstone River. \"The aftermath of the Battle of the Little Bighorn brought the U.S. military into Eastern Montana in force, and they established a Fort named after the sole survivor of the incident, the horse of Captain Myles Keogh. Fort Keogh, like many other forts in Montana, brought with it the formation of a small trading town nearby. This town named itself Miles City after Colonel N.A. Miles, the Commanding Officer at the fort. Construction of the Northern Pacific Railroad through Miles City in 1882 combined with the opening of Eastern Montana for livestock speculation brought more commerce and more people from the East and the South seeking economic opportunity. The newly built railroad provided ranching operations proximity to the slaughter houses of Chicago, which meant it was cheaper for them to ship the cattle and thus making Miles City more profitable. The Milwaukee Railroad arrived in Miles City in 1907, and the town became a division point for the line which increased railroad traffic and commerce. This resulted in more jobs, making railroad work in Miles City the most available next to service industry jobs. Many of the African American families in Miles City held jobs within these two fields. Like most of the migrants to the Montana Territory during the turn of the century. The ranching and farming operations that remained all over the outskirts and beyond into the eastern Montana plains continued to bring their livestock and produce in for transportation by rail until the mid-1910's. The drought that began in 1917 led Miles City and many other Montana towns into a state of severe economic depression a full decade before that of the national Great Depression of the 1930's. The drought affected agricultural jobs, reduced the number of new settlers, and forced ranchers and farmers to seek work in the city.\" ==References== Category:Cities in Montana Category:County seats in Montana",
 "title": "Miles City, Montana"
}