{
 "id": "647067",
 "text": "Abiy Ahmed Ali (Amharic): ዐብይ አሕመድ ዐሊ Oromo (*Latin text): Abiyi Ahmed Alii; (Oromo on Geez text: አቢይ አህመድ አሊ born 15 August 1976) is an Ethiopian patriot leader serving as the 4th prime minister of the Federal Democratic Republic of Ethiopia since 2 April 2018. He was the third chairman of the Ethiopian People's Revolutionary Democratic Front (EPRDF) that governed Ethiopia for 28 years until it was dissolved and the Prosperity Party was created and the first person in that position. Abiy is an elected member of the Ethiopian parliament as Prime Minister and former member of the Oromo Democratic Party (ODP), which was one of the then four coalition parties of the EPRDF, until its rule ceased in 2019 and he formed his own party, the Prosperity Party. As the first Ethiopian and the first African head of Government, he won the 2019 Nobel Peace Prize for his work in ending the 20-year post-war territorial stalemate war between Ethiopia and Eritrea led by the then Government of Ethiopia and current Government of Eritrea. Abiy Ahmed was sworn in on October 4, 2021, after he got first elected, his term will end after October 4, 2026. He served first as prime minister when former Prime minister Hailemariam Desalegn resigned. == Early life == Abiy Ahmed was born in the small town of Beshasha, Ethiopia. His deceased father, Ahmed Ali, was a Muslim Oromo while his deceased mother, Tezeta Wolde, was a Christian Oromo. Abiy's father was a typical Oromo farmer, speaking only Oromo, while Tezeta was a fluent speaker of both Amharic and Oromo. === Early years === When Abiy was a teenager, he served in the Ethiopian National defense forces fighting off the communist Derg a regime which overthrow Emperor Haile Selassie I. The later Prime Minister also served as a lieutenant Colonel for the Ethiopian National Defense Forces === University === Ahmed's education starts when he earned a bachelor's degree at \"Computer Engineering from the Microlink Information Technology College in Addis Ababa in 2009.\" Abiy went further on and got a Master of Arts in transformational leadership degree from Greenwich University in London which is a business school. A later went on to further get more degrees. He also got a MBA degree from Leadstar College of Management and Leadership in Addis Ababa in 2013. He also In 2017, started his Doctor of Philosophy (Ph.D.) and got in work as a regular student there, at the Institute for Peace and Security Studies, at Addis Ababa University the oldest University in Ethiopia. He did his Ph.D. work on the Agaro constituency with his Ph.D. thesis called “Social Capital and its Role in Traditional Conflict Resolution in Ethiopia: The Case of Inter-Religious Conflict In Jimma Zone state”. Abiy published a related short research article on de-escalation strategies in the Horn of Africa in a special journal issue dedicated to countering violent extremism. ==== Relationships ==== Abiy lived in France and had a French girlfriend it is told that she loved Abiy but Abiy went to Ethiopia to pursue his political career which he later became Prime Minister. Abiy later went to Ethiopia and found a woman who he fallen in love with called Zinash Tayachew. == Director of Information Network and Security Agency. == Prime Minister Abiy Ahmed founded INSA or the Information Network Security Agency and became its director from 2008 through 2010. INSA is an organization which spies on people which the government targets it also secures and encrypts Ethiopia's cyber security. Abiy Ahmed through his jamming capabilities as learning intelligence measures in South Africa was able to create such an organization and become its director. ==References== Category:1976 births Category:Living people Category:Prime Ministers of Ethiopia Category:Current national leaders",
 "title": "Abiy Ahmed"
}