{
 "id": "647212",
 "text": "Jakob Gijsbert \"Jaap\" de Hoop Scheffer (;The first word in isolation: . born 3 April 1948) is a retired Dutch politician and diplomat. He is a member of the Christian Democratic Appeal (CDA). He served as the 11th Secretary General of NATO from 5 January 2004 until 1 August 2009.NATO - Biography Jaap de Hoop Scheffer == Early career == De Hoop Scheffer studied law at Leiden University. After completing military service in the air force, where he is a reserve officer, he worked for the Ministry of Foreign Affairs from 1976 to 1986. During this time, he spent the first two years at the Dutch embassy in Ghana. He then served at the Dutch delegation to NATO headquarters in Brussels until 1980. == Political career == Although he was already a member of the Democratic 66 party, he joined the Christian Democratic Appeal in 1982. In the 1986 elections, he was elected to the Eerste Kamer (the upper house of Parliament) and became the spokesperson for foreign policy for his party. From 1997 to 2001, he was the president of the CDA group in the Eerste Kamer while the party was in opposition. This position made him the leader of the party. == NATO == De Hoop Scheffer was the 11th Secretary General of NATO from 5 January 2004 to 31 July 2009, succeeding Lord Robertson, who held the position since 1999. His deputy was the Italian ambassador Claudio Bisogniero. ==References== ==Other websites== * NATO Declassified - Jaap de Hoop Scheffer (biography) * Appointment as Secretary General - NATO announcement * Profile of Jaap de Hoop Scheffer - by journalist Robert van de Roer, NATO website Category:1948 births Category:Living people Category:Christian Democratic Appeal politicians Category:Dutch diplomats Category:Dutch Roman Catholics Category:Leaders of political parties in the Netherlands Category:Members of the House of Representatives of the Netherlands Category:Ministers of foreign affairs of the Netherlands Category:Politicians from Amsterdam Category:Secretaries General of NATO",
 "title": "Jaap de Hoop Scheffer"
}