{
 "id": "647308",
 "text": "The President of Croatia (), officially styled the President of the Republic (), is the head of state, commander in-chief of the military and chief representative of the Republic of Croatia both within the country and abroad. The President is the holder of the highest office within the Croatia's government however, the president is not the head of the executive branch (\"non executive president\") as Croatia has a parliamentary system in which the holder of the post of Prime Minister is the most powerful person within the country's constitutional framework and within everyday's politics. ==List of presidents== No. Picture Name (Birth–Death) Term of office Election Party No. Term start Term end Franjo Tuđman (1922–1999) 22 December 1990** 12 August 1992 — Croatian Democratic Union 12 August 1992 11 August 1997 1992 (56.73%) 12 August 1997 10 December 1999 1997 (61.41%) Parliament elected him the President of the Presidency of SR Croatia in May 1990, but with the adoption of a new constitution on 22 December 1990, the title of the office was changed to President of the Republic of Croatia and the Presidium of Croatia (Presidency) was completely abolished. The referendum on independence was held in May 1991, with 93% of voters supporting independence. It was followed by a formal declaration of independence on 25 June 1991, the same date as neighboring Slovenia. Croatia and Slovenia gained recognition by the European Union on 15 January 1992 and joined the United Nations in May 1992. Tuđman won re-election to a de facto second and third term in 1992 and 1997, winning election outright both times without the need for a run-off. He is the only president to have been elected in the first round of elections. He died in office in December 1999. Vlatko Pavletić (1930–2007) 10 December 1999 2 February 2000 Acting President Croatian Democratic Union Tuđman was incapacitated since 26 November 1999 and died on 10 December 1999. Pavletić became acting president as Speaker of the Croatian Parliament. He was succeeded by Zlatko Tomčić when the 4th Assembly of Parliament was replaced by the 5th Assembly after the 2000 election. Zlatko Tomčić (1945–) 2 February 2000 18 February 2000 Acting President Croatian Peasant Party Became acting president as Speaker of Parliament when the 4th Assembly of Parliament (1995-2000) was replaced by the 5th Assembly (2000–2003). Served until Stjepan Mesić was sworn in as the new President on 18 February 2000. Stjepan Mesić (1934–) 19 February 2000 18 February 2005 2000 (56.01%) Croatian People's Party – Liberal Democrats* (formally independent) 19 February 2005 18 February 2010 2005 (65.93%) He defeated Dražen Budiša in the 2000 presidential elections. He was the first president with reduced powers, as the semi- presidential system was replaced by an incomplete parliamentary system in November 2000. Mesić was re-elected in 2005, defeating Jadranka Kosor in a landslide. Ivo Josipović (1957–) 19 February 2010 18 February 2015 2009–10 (60.26%) Social Democratic Party* (formally independent) He defeated Milan Bandić by a wide margin in the 2010 election. He was narrowly defeated by Kolinda Grabar-Kitarović in his re- election bid in 2015. Kolinda Grabar-Kitarović (1968–) 19 February 2015 18 February 2020 2014–15 (50.74%) Croatian Democratic Union* (formally independent) She defeated incumbent president Ivo Josipović in the second round of the 2015 election. She is the first female president since independence and also the youngest, aged 46. She was defeated by Zoran Milanović in her reelection bid in 2020. Zoran Milanović (1966–) 19 February 2020 Incumbent 2019–20 (52.66%) Social Democratic Party* (formally independent) He defeated incumbent president Kolinda Grabar- Kitarović in the second round of the 2020 election. ==References== ==Other websites== * Office of the President of Croatia * President of the Republic of Croatia 2000–2010 *",
 "title": "President of Croatia"
}