{
 "id": "647587",
 "text": "The President of the Republic of Malawi is the head of state and head of government of Malawi. The president leads the executive branch of the Government of Malawi and is the commander-in-chief of the Malawian Defence Force. ==Monarch (1964–1966)== The succession to the throne was the same as the succession to the British throne. No. Monarch Portrait Reign Royal House Prime Minister No. Monarch Portrait Reign start Royal House Prime Minister Reign end Time in office 1 Queen Elizabeth II 1964 1966 2 years Windsor Banda ===Governor-General=== The Governor-General was the representative of the monarch in Malawi and exercised most of the powers of the monarch. The Governor-General was appointed for an indefinite term, serving at the pleasure of the monarch. After the passage of the Statute of Westminster 1931, the Governor-General was appointed solely on the advice of the Cabinet of Malawi without the involvement of the British government. In the event of a vacancy the Chief Justice served as Officer Administering the Government. ;Status No. Governor-General Portrait Tenure Monarch Prime Minister No. Governor-General Portrait Took office Monarch Prime Minister Left office Time in office 1 Sir Glyn Jones 1964 1966 2 years Elizabeth II Banda ==List of presidents== No. President Portrait Tenure Tenure Elected Political affiliation (at time of appointment) Political affiliation (at time of appointment) No. President Portrait Took office Left office Elected Political affiliation (at time of appointment) Political affiliation (at time of appointment) 1 Hastings Banda Served as President for Life from 6 July 1971 to November 1993 1966 1994 Malawi Congress Party 2 Bakili Muluzi 1994 2004 1994 1999 United Democratic Front 3 Bingu wa Mutharika 2004 2012 2004 United Democratic Front 3 Bingu wa Mutharika 2004 2012 2009 Democratic Progressive Party Founded in 2005 4 Joyce Banda 2012 2014 – People's Party 5 Peter Mutharika 2014 2020 2014, ~~2019~~ Democratic Progressive Party 6 Lazarus Chakwera 2020 Incumbent 2020 Malawi Congress Party ==References== *",
 "title": "President of Malawi"
}