{
 "id": "647745",
 "text": "The Battle of Jutland was the most important naval battle during World War I. The German fleet was under blockade by the larger Royal Navy of Britain and, for the most part, was kept in its base at Wilhelmshaven. The Battle of Jutland happened when the German Navy, led by Admiral Reinhard Scheer, tried to break out into the open sea. The German High Seas Fleet consisted of 22 battleships, five battlecruisers, 11 cruisers and 61 torpedo boats. Scheer also had submarines with torpedos, which he arranged outside the main British bases. The main British bases were in Scotland: the Orkney and Shetland Islands had a huge base at Scapa Flow, and bases on the main island were at Cromarty, on the Moray Firth, and at Rosyth, on the north bank of the Firth of Forth. The British Grand Fleet steamed south-east from their bases and met the German Navy, which was steaming due north. The battle was fought over a wide area at Jutland Bank, west of the Skagerrak, between Norway and Denmark. == Codebooks == Scapa Flow is a long way from the Skagerrak, but the British fleet still knew about of the German ship movements. The British had cracked the German cipher, and when Scheer gave the order to sail, the Admiralty in London gave the Grand Fleet orders to sail from Orkney.p124 That was because the British had taken three codebooks from wrecked ships. One code, for smaller vessels, was from a German freighter. Another, for diplomatic messages, was taken from a wreck on the bottom of the North Sea. The code for the German High Seas Fleet was from a cruiser that was wrecked in the Baltic. The British did not make the best use of these sources, but they had in their hands a priceless advantage. == Battle == === First skirmish === The first group of British ships to make contact were those from the Firth of Forth, commanded by Vice-Admiral David Beatty. He had six battlecruisers and four fast battleships, which got through the submarine cordon outside the Firth of Forth with no casualties. Beatty's battlecruiser group met the German battlecruiser force, led by Rear-Admiral Franz Hipper. The German advantage in range-finding, with better optics, was important, but the British cruisers were saved by the arrival of the four battleships. Since the battleships were better in both armor and firepower, Hipper was forced to turn away from the east and the main German force of battleships. === Main forces === Finally, late in the day. the Grand Fleet from Scapa Flow, led by Admiral John Jellicoe, met the main German force of battleships, led by Scheer: \"To Scheer's range-takers... the entire arc stretching from the north to the east was a sea of fire\".p128 After ten minutes, Scheer signaled a simultaneous turnaway. Also, 21 torpedos caused Jellico to turn away, and Scheer put 10 miles between the British battleships and himself. As darkness grew, there were a few more encounters until the German fleet managed to make it home. The Germans had sunk more ships, but the balance of power had not changed since since the British still controlled the seas.. == References == Category:Battles of World War I",
 "title": "Battle of Jutland"
}