{
 "id": "64796",
 "text": "Cardinals are created by the pope and typically hold the title for life. Cardinals are bishops and archbishops leading dioceses and archdioceses around the world as well as working within the Holy See in Vatican City. On 24 February 2024, there were 234 serving cardinals. According to the Catholic church, the order of the importance of the Catholic Church goes from the Pope, then the Bishops and Archbishops and then those holding the position of a Cardinal. Cardinals are the counsellors of the Pope. In 1245, Pope Innocent IV granted the red hat to the cardinals as a sign of their readiness to shed their blood in the cause of the church which showed their dedication to the church. The collective name for cardinals is College of Cardinals. They meet in a Papal conclave to elect a new Pope.\"Cardinal,\" Catholic Encyclopedia (2009); retrieved 2011-11-23. When there is no pope, the cardinals direct the day-to-day affairs of the Church. == Appointment == Cardinals are chosen by the Pope from men who are already bishops or archbishops. The Pope officially announces new cardinals during a meeting called a consistory. The Pope can choose cardinals as he sees fit, but usually asks for advice from other cardinals. If a man is not yet a bishop or archbishop when chosen, he should become one, but this is not always required. == Ranks of Cardinals == There are three ranks of cardinals: * Cardinal bishops. * Cardinal priests. * Cardinal deacons. == Clothing == File:6 SzatyChorowe Kardynala.png|Choir dress of a cardinal File:6 Sutanna Kardynala.png|Cassock of a cardinal File:Hábito coral cardenalicio con capa magna estival.svg|Cardinal's choir suit with cappa magna File:Hábito piano cardenalicio completo.svg|Cardinal's piano suit File:Vetements cardinal Gamarelli.jpg|Cardinal's choir dress File:Cardinal DiNardo Galero.jpg|Cardinal's galero hat == Coats of arms == File:Template-Cardinal (Metropolitan Archbishop).svg|Cardinal who is Metropolitan Archbishop File:Template-Cardinal.svg|Cardinal (archbishop) File:Template-Cardinal (Bishop).svg|Cardinal (bishop) File:Template-Cardinal (not a bishop).svg|Cardinal who is not a bishop File:Template-Cardinal Camerlengo.svg|Camerlengo (archbishop) File:Template-Cardinal (Bishop) Camerlengo.svg|Camerlengo (bishop) == Related pages == * Bishop * Archbishop ==References== == Other websites == * * Catholic Hierarchy, Cardinal-Bishops, Cardinal-Priests, Cardinal-Deacons * Cardinals of the Holy Roman Church Category:Bishops by type",
 "title": "Cardinal (Catholic Church)"
}