{
 "id": "648087",
 "text": "Yeh Rishta Kya Kehlata Hai (English: 'What is this relationship called?), known as YRKKH is an Indian Hindi-language romantic family drama television series that airs on StarPlus and streams on Disney+ Hotstar. It premiered on 12 January 2009 and is the longest running Indian television soap opera. Currently, it stars Samridhii Shukla and Rohit Purohit (replaced Shehzada Dhami), as fourth generation leads. == Plot == Akshara and Naitik, both from large Marwari joint families based in Udaipur get married. Initially, they struggle to understand each other but gradually come to understand, support, and love each other. Soon, their son, Naksh is born. Naitik falls into a coma due to an accident. === 4 years later === Akshara starts working in the family business. Naitik recovers from the coma and struggles to bond with a mischievous Naksh. Naitik's mother Gayatri dies after falling off a cliff post, and his sister Rashmi gives birth to a daughter and names her Gayatri. After which Rajshekhar (Naitik's father ) is unable to cope with Gayatri's death after which one year passes and Rajshekhar remarries Devyani a divorcee who comes with her two children Muskan and Naman. Muskan marries Alok and Naman marries Karishma .Akshara and Naitik's daughter Naira is born. Later Naman and Karishma's daughter Mishti is born. Mahendra dies and Kaveri blames Akshara for it and disowns her. Akshara and Naitik move out with their children. === 10 years later === They relocate to Cape Town. Naksh returns to Udaipur and convinces Kaveri to forgive an innocent Akshara. Eventually, the family is reunited. Naksh falls for Tara, a hockey player. However, their wedding gets called off due to some misunderstandings. Out of fear of being wrongly blamed for her friend Sukanya's death, Naira flees from Udaipur. === 7 years later === Naira lives in an orphanage in Rishikesh and has grown up to be headstrong but insecure and arrogant. Akshara reaches there with Varsha to fund the orphanage and finds Naira. Kartik Goenka arrives in Udaipur and a love triangle is formed between him, Gayatri, and Naira. Kartik realises his love for Naira while Gayatri has feelings for Kartik. Naira finally accepts Akshara. Kartik confesses his love for Naira while the latter is initially confused about her feelings but later realies her love for Kartik. Akshara dies by falling off a cliff in a car crash. Kartik and Naira get married. Kartik hates his father Manish and his step-mother Swarna as he remarried her post his mother's death as he thinks that they were having an extra-marital affair in their office and were responsible for her suicide. Naksh and Keerti get married. Initially marrying for Naira's sake, he begins to love Keerti. Kartik reconciles with Manish and accepts Swarna as his mother after his mother's depression and hallucinations were revealed to be the reason for her suicide. Naira fulfills her parent's dream of opening a dance academy and names it \"Akshara Dance Academy\" as a tribute to her mother. Swarna's son, Shubham dies of a drug overdose and Naira is blamed for hiding his drug addiction. Naira leaves as Kartik and Swarna refuse to trust her. === 2 years later === Naira lives in Mumbai with Naitik. Kartik is the professor of the same class for which Naira signs up. Eventually, Kartik and Swarna realize their mistakes and reunite with Naira. Naira undergoes surgery due to a brain clot after which Naira and Kartik remarry. She enters the family business after Manish suffers a heart attack. Kartik feels insecure about Naira's busy routine. Naira finds out she is pregnant. Kartik questions Naira about her relationship with her business partner, Mihir. Naira rebukes him and storms out of the house without informing her pregnancy and meets with an accident. She is presumed to be dead by the family. === 5 years later === Naira lives in Goa with their son Kairav. Soon everyone learns that Naira is alive and Kairav is Naira and Kartik's son. Despite trying to get away from each other, Kartik and Naira become closer. Soon they realize their love and reunite. A year later, Naira gives birth to a daughter and names her Akshara. More family drama leads to Naira and Kartik moving out with Kairav and Akshara. Later, the family is reunited but meets with an accident. Naira falls off a cliff and dies. Kartik is left heartbroken. Soon, Kairav meets a boxer named Sirat who is Naira's lookalike, which makes Kairav to think that his mother has returned. After several demands from Kairav, Kartik brings Sirat and her grandmother to the Goenka house. Sirat reveals her former love Ranveer. Kartik realizes that Sirat and Ranveer had a misunderstanding, caused by Ranveer's father, Narendranath, and gets them married. Sirat falls for Kartik. Ranveer falls ill and asks Kartik to take care of Sirat. Ranveer dies and Narendranath holds Sirat responsible and gets her arrested on murder charges. Kartik bails her out and Sirat goes away from Kartik. Sirat changes her name to Simran and Kartik convinces her to return to Udaipur. Sirat and Kartik expose Narendranath and she is acquitted of all charges. Sirat and Kartik confess their love to each other and get married. They have a daughter, Aarohi. Sirat resumes her boxing training for a championship and qualifies for the Asian Championship. === 8 years later === Akshara discovers that not Sirat, but Naira is her real mother. Sirat's mother, Sheela returns and manipulates Aarohi against the family. Kartik dies in a plane crash leaving the entire family in shock. Sirat slips down the stairs and falls to her death. Aarohi holds Akshara responsible for Sirat's death and starts detesting her. === 12 years later === Akshara has grown up to be a kind and family-loving girl. She is a singer and musician. Aarohi aspires to be a doctor and still hates Akshara. Dr. Abhimanyu Birla is a practicing surgeon at Birla Hospital and Medical Institute. A love triangle is formed between the three. However, Aarohi and Abhimanyu's marriage is fixed after Akshara refuses to accept his love for Aarohi's sake. But soon Akshara and Abhimanyu confess their love in front of their families. Both families reach Jaipur and Akshara and Abhimanyu get married in a grand ceremony. Later it is revealed that Harshvardhan was having a secret extra-marital affair with Dr. Avni Rathore and Neil is their illegitimate son. Manjari had brought Neil home through adoption. Manjari and Harshvardhan head for a divorce but Harshvardhan reforms himself and they reconcile. Soon a fire breaks out at Birla Hospital and Abhimanyu suffers a pinched nerve in his right hand. Akshara contacts a renowned physiotherapist, Dr. Kunal Khera, for his treatment. Meanwhile, Anisha proposes to Kairav for marriage but Akshara learns about her having an affair with a married man and her plan to continue the affair post-marriage and confronts her for the same which Kairav overhears. Kairav refuses to marry Anisha for her betrayal and asks her to reveal the truth to the families. Anisha, who lacks the courage to tell this truth, commits suicide and the Birla family blames Kairav and Akshara for her death thinking Kairav murdered her and Akshara attempting to save him from murder charges. Later Dr. Kunal asks Akshara to sing secretly for his sister, Maya for a year in lieu of Abhimanyu's surgery to which she agrees. === 1 year later === Akshara now lives incognito in Mauritius with Kunal and Maya and remains depressed due to her separation with Abhimanyu, who has misunderstood her and became a ruthless person. Akshara and Kairav come back to India and eventually Kairav is proven innocent. Abhimanyu and Akshara reunite and remarry. Neil and Aarohi elope and get married due to which Manish disowns her. Akshara successfully restores her lost identity as Maya's voice and resumes her singing career. Later, Akshara gets pregnant with twins while Aarohi is exposed for faking her pregnancy. However, Aarohi gets pregnant for real and Neil gives her second chance. In a bid to save some girls from kidnapping, Neil is beaten up by goons and Akshara miscarries. Before dying, Neil makes Abhimanyu promise to take care of Aarohi and his child. Akshara is blamed for Neil's death and Abhimanyu divorces her. Distraught, Akshara leaves the house and is helped by Abhinav. She finds that one of her twins is still alive. Manish requests Akshara to return to Goenkas', but she refuses and legally marries Abhinav. === 6 years later === Akshara lives in Kasauli as a jam entrepreneur with her son, Abhir and Abhinav, who works as a tourist guide. On the other hand, Aarohi has became matured and Abhimanyu has taken the fatherly responsibility of her daughter, Ruhi while both works as senior doctors of Birla Hospital. Abhir considers Abhinav as his father while Ruhi is aware that Neil is her father. Manjiri starts forcing Abhimanyu and Aarohi to marry for Ruhi's sake despite their refusals while Akshara and Abhinav are forcing the same by their neighbour, Neelima. Soon, Abhimanyu visits Shimla for a medical meeting but gets stuck in Kasauli and ends up meeting Akshara, Abhinav and Abhir. Initially shocked, He decides to move on from Akshara accepting her new life. Akshara decides to return to Udaipur on Suhasini's insistence. ==Awards== ===Indian Television Academy Awards=== Year Category Recipient Result Ref. 2009 Best Actress - Popular Hina Khan Best Actor -Popular Karan Mehra Best Serial - Popular Rajan Shahi Best Costumes Ritu Deora 2010 Best Direction Neeraj Baliyan ITA Scroll Honour Yeh Rishta and Bidaai 2011 Best Direction' Neeraj Baliyan GR8! Ensemblance Cast Yeh Rishta Kya Kehlata Hai 2012 Best Direction Neeraj Baliyan 2013 Best Actress in Supporting Role (Drama) Sonali Verma Best Child Artist Shivansh Kotia Best Music Composer Naveen Best Dialogues Raghuvir Shekhawat 2014 Best Teleplay Rensil D'Silva, Bhavani Iyer, Priya Pinto 2015 Best Actress Popular Hina Khan Best Actor Popular Karan Mehra Best Show Popular Yeh Rishta Kya Kehlata Hai ITA scroll honor Yeh Rishta Kya Kehlata Hai 2016 ITA scroll honor Yeh Rishta Kya Kehlata Hai 2017 ITA Laurel For Longlasting Popularity Yeh Rishta Kya Kehlata Hai 2019 Best Continuing Serial Yeh Rishta Kya Kehlata Hai 2019 Best Actress Popular Shivangi Joshi 2019 ITA Award for Longest Running Show Yeh Rishta Kya Kehlata Hai 2020 ITA Award for Best Popular Show Yeh Rishta Kya Kehlata Hai 2021 ITA Award for Longest Running Show Yeh Rishta Kya Kehlata Hai 2021 Best Actor Popular Harshad Chopda 2022 ITA Scroll of Honour Yeh Rishta Kya Kehlata Hai 2022 Best Actor Popular Harshad Chopda 2022 Best Actress Popular Pranali Rathod 2023 ITA Scroll of Honour Yeh Rishta Kya Kehlata Hai 2023 Best Actor Popular Harshad Chopda ===Indian Telly Awards=== Year Category Recipient Result Ref. 2009 Best Fresh Face (Popular) Hina Khan Most Popular Ensemblance Cast Yeh Rishta Kya Kehlata Hai Most Popular Drama Series Rajan Shahi Best Costumes Ritu Deora 2010 Most Popular Actress in a Lead Role Hina Khan Best Actor in a Supporting Role – Drama (Jury) Sanjeev Seth Most Popular Daily Series Rajan Shahi Most Popular Ensemblance Cast Yeh Rishta Kya Kehlata Hai Best Direction Jai Kalra and Ram Panday 2012 Most Popular Continuing TV Series Rajan Shahi Best Direction Jai Kalra 2013 Best Onscreen Couple (Critics) Hina Khan and Karan Mehra Best Actor in a Supporting Role – Drama (Critics) Abhijeet Lahiri Best Television Show of the Year Rajan Shahi Most Popular Show with Social Message Most Popular Continuing TV Show Most Popular Child Artist Shivansh Kotia 2014 Most Popular Child Artist Shivansh Kotia Most Popular Drama Series Rajan Shahi Most Popular Continuing TV Programme 2015 Best Ensemblance Cast Yeh Rishta Kya Kehlata Hai 2019 Best Continuing TV programme (Jury) Yeh Rishta Kya Kehlata Hai 2019 Best Actress in Supporting Role Mohena Singh 2019 Best Actress in a Lead Role Shivangi Joshi 2023 Best Actor In Leading Role Male (Popular) Harshad Chopda 2023 Fan Favorite Jodi Harshad Chopda and Pranali Rathod 2023 Best Continuing TV programme Yeh Rishta Kya Kehlata Hai 2023 Best Production House Rajan Shahi ===Star Guild Awards=== Year Category Recipient Result Ref. 2009 Best TV Storyline (Fiction) Saba Mumtaz 2010 Best TV Programme of the Year Rajan Shahi 2013 Best Direction Jai Kalra and Ram Panday 2015 Best TV Storyline (Fiction) Saba Mumtaz Best Ongoing TV Program of the Year Rajan Shahi Best TV Actress Hina Khan 2015 Best Writer Bhavna Vyas and Munisha Rajpal 2016 Best Ongoing TV Program of the Year Rajan Shahi ===BIG Star Entertainment Awards=== Year Category Recipient Result Ref. 2010 BIG Star Most Entertaining Fiction Show Rajan Shahi 2013 BIG Star Most Entertaining TV Actor (Male) Shivansh Kotia 2014 BIG Star Most Entertaining Fiction Show Rajan Shahi ===Gold Awards=== Year Category Recipient Result Ref. 2015 Best Actress in a Lead Role - Jury Hina Khan 2016 Best Onscreen Jodi Karan Mehra and Hina Khan 2016 Debut in a Lead Role (Male) Rohan Mehra 2017 Debut in a Lead Role (Female) Shivangi Joshi 2017 Debut in a Lead Role (Male) Mohsin Khan 2018 Best Show Yeh Rishta Kya Kehata Hai Best Jodi Shivangi Joshi and Mohsin Khan Best Supporting Actor Vishal Singh Best Supporting Actress Parul Chauhan 2019 Best Actress Female (Popular) Shivangi Joshi 2019 Best Actor Male (Popular) Mohsin Khan 2019 Best TV Show Fiction Yeh Rishta Kya Kehlata Hai 2019 Longest Running Show Yeh Rishta Kya Kehlata Hai ===Iconic Gold Awards=== Year Category Recipient Result Ref. 2021 Iconic Best Actress Shivangi Joshi 2021 Iconic Best Show Yeh Rishta Kya Kehlata Hai 2022 Iconic Most Popular TV Actress of the Year Shivangi Joshi 2023 Iconic Most Popular TV Actor Harshad Chopda == References == == Other websites== * Yeh Rishta Kya Kehlata Hai on Disney+ Hotstar * Category:Hindi-language television series Category:2000s Indian television series Category:2000s Indian television series debuts Category:2000s soap operas Category:2009 television series debuts Category:2010s Indian television series Category:2010s soap operas Category:2020s Indian television series",
 "title": "Yeh Rishta Kya Kehlata Hai"
}