{
 "id": "648189",
 "text": "BuzzFeed Unsolved (also known as simply Unsolved) is a weekly web series on BuzzFeed's YouTube channel, BuzzFeed Unsolved Network, that also streams on Amazon Prime, Facebook, and Hulu. The series started in 2016, with the first few episodes originally being a part of BuzzFeed's IRL series, and was created by Ryan Bergara. It stars Bergara and co-star Shane Madej. The series is divided into BuzzFeed Unsolved True Crime, which deals with unsolved crimes, and BuzzFeed Unsolved Supernatural, which deals with paranormal mysteries and ghost hunting. Most episodes were followed by a question and answer episode, entitled BuzzFeed Unsolved Postmortem, where Bergara and Madej answered questions sent in by viewers about the week's episode. True Crime ended with its 8th and final season in July 2021, while Supernatural started with its 7th and final season in October 2021 and ended in November. There are fifteen seasons in total. Due to the COVID-19 pandemic, Supernatural has one less season than True Crime because production was unable to secure haunted locations to visit under quarantine. The final episode was followed up by a behind-the-scenes documentary BuzzFeed Unsolved: The Making of the Final Investigation on November 24, 2021. ==About== The Buzzfeed Unsolved: True Crime & Supernatural shows were hosted by Ryan Bergara and co-hosted by Shane Madej, who took over from the original co-host, Brent Bennett, in late 2016. There are three fan groups based around each host. Those who believe in ghosts like Bergara are the \"Boogaras\" and those who are skeptics like Madej are the \"Shaniacs\". An additional group based upon fans who do not fall into either are called \"Shitfishes.\" ==Episodes== ===BuzzFeed Unsolved - True Crime=== ==== Season 1 ==== # Episode Published Links Description 1 The Mysterious Death of the Somerton Man February 4, 2016 Episode Just a friendly reminder to lock your doors. 2 The Horrifying Unsolved Slaughter at Hinterkaifeck Farm February 20, 2016 Episode Have fun sleeping! 3 The Bizarre Death of Elisa Lam March 18, 2016 Episode What happened in that hotel? 4 The Chilling Mystery of the Black Dahlia April 1, 2016 Episode What happened to Elizabeth Short? 5 The Strange Deaths of the 9 Hikers of Dyatlov Pass April 15, 2016 Episode An expedition gone horribly wrong or proof that we aren't alone? 6 The Mysterious Death of Tupac Shakur - Part 1 May 20, 2016 Episode Who killed Tupac? 7 The Mysterious Death of Biggie Smalls - Part 2 May 27, 2016 Episode Who killed Biggie Smalls? 8 The Horrifying Murders of the Zodiac Killer June 24, 2016 Episode A deep dive into one of the most infamous cold cases of all time. 9 The Mysterious Disappearance of the Sodder Children December 23, 2016 Episode What happened on the fateful night of 1945 to the Sodder children? 10 The Odd Death of Michelle Von Emster January 27, 2017 Episode Some things may not be what they seem. 11 The Shocking Case of O.J. Simpson March 4, 2017 Episode Did O.J. really do it? 12 The Strange Disappearance of D. B. Cooper March 10, 2017 Episode The F.B.I.'s greatest unsolved case! ==== Season 2 ==== # Episode Published Links Description 1 The Terrifying Axeman of New Orleans July 28, 2017 Episode Q+A We explore one of the bloodiest chapters in New Orleans history. 2 The Mysterious Death of the Boy in the Box August 4, 2017 Episode Q+A Who killed America’s Unknown Child? 3 The Bizarre Road Trip of a Missing Family August 11, 2017 Episode Q+A What caused this seemingly normal family to abandon their home? 4 The Tragic Murder of JonBenét Ramsey August 18, 2017 Episode Q+A A look into America’s most-discussed cold case. 5 The Odd Vanishing of Amelia Earhart August 25, 2017 Episode Q+A What truly happened to the famed aviator? 6 The Creepy Murder in Room 1046 September 1, 2017 Episode Q+A What really happened to this mystery man? 7 The Strange Drowning of Natalie Wood September 8, 2017 Episode Q+A Who killed this Hollywood star? 8 The Mysterious Poisoned Pill Murders September 15, 2017 Episode Q+A The incidents depicted happened 35 years ago. 9 The Disturbing Murders at Keddie Cabin September 22, 2017 Episode Q+A We tackle a fresh case in the remote forests of Northern California. 10 The Suspicious Assassination of JFK September 29, 2017 Episode Q+A The unexplained death of a President. ==== Season 3 ==== # Episode Published Links Description 1 The Grisly Murders of Jack the Ripper January 26, 2018 Episode Q+A In this season premiere, we finally take on the most infamous serial killer of all time. 2 The Thrilling Gardner Museum Heist February 2, 2018 Episode Q+A Who stole $500 million in art... and got away with it? 3 The Ghastly Cleveland Torso Murders February 9, 2018 Episode Q+A We tackle one of the most gruesome serial killers of all time. 4 The Enigmatic Death of the Isdal Woman February 16, 2018 Episode Q+A Who was this murdered mystery woman? 5 The Strange Killing of Ken Rex McElroy February 23, 2018 Episode Q+A Vigilante justice, or cold-blooded murder? 6 The Scandalous Murder of William Desmond Taylor March 2, 2018 Episode Q+A A Hollywood legend has been shot in the back... but whodunit? 7 The Historic Disappearance of Louis Le Prince March 9, 2018 Episode Q+A This French inventor stepped onto a train... and disappeared from history. 8 The Disturbing Mystery of the Jamison Family March 16, 2018 Episode Q+A One missing family, dozens of clues... and no answers. ==== Season 4 ==== # Episode Published Links Description 1 The Sinister Disappearance of Jimmy Hoffa July 13, 2018 Episode Q+A Season Premiere. What really happened to this famed Mob figure? 2 The Bizarre Collar Bomb Bank Robbery July 20, 2018 Episode Q+A This deadly bank robbery was just the beginning. 3 The Mysterious Death Of The Eight Day Bride July 27, 2018 Episode Q+A Accidental death, or deadly love triangle? 4 The Incredible Alcatraz Prison Break August 3, 2018 Episode Q+A Four men, an infamous island prison, and one daring plan. But what happened next? 5 The Covert Poisoning of an Ex-Russian Spy August 10, 2018 Episode Q+A An ex-spy is murdered with an unusual poison. Was it an enemy, or his former employers? 6 The Odd Death of Charles C. Morgan August 17, 2018 Episode Q+A Secret agent, criminal or something more sinister? 7 The Bizarre Disappearance of Bobby Dunbar August 24, 2018 Episode Q+A A boy is lost... and found. Or is he? 8 The Treacherous Treasure Hunt of Forrest Fenn September 7, 2018 Episode Q+A N/A 9 The Chilling Black Dahlia Murder Revisited January 11, 2019 Episode Watch Ryan & Shane uncover more details of the Black Dahlia as they revisit that case. ==== Season 5 ==== # Episode Published Links Description 1 The Eerie Case of the Watcher March 22, 2019 Episode Q+A Who was this mysterious stalker? 2 The Unusual Australian Shark Arm Murders March 29, 2019 Episode Q+A A shark, a speedboat, and a mysterious severed arm. 3 The Suspicious Case of the Reykjavik Confessions April 5, 2019 Episode Q+A Two murders. Six confessions. But is any of it real? 4 The Unexplained Murder of Bugsy Siegel April 12, 2019 Episode Q+A Who bumped off the man that built Las Vegas? 5 The Horrifying Texarkana Phantom Killer April 19, 2019 Episode Q+A A shadowy killer pushes a small town to the edge. 6 The Shocking Florida Machete Murder April 26, 2019 Episode Q+A Violence terrorizes a quiet Florida community. 7 The Puzzling Disappearance of Walter Collins May 3, 2019 Episode Q+A What became of this missing boy? 8 The Curious Death of Vincent Van Gogh May 10, 2019 Episode Q+A Do we really know the life and death of this famous artist? 9 The Impossible Disappearance of Dorothy Arnold September 26, 2019 Episode A special bonus episode of True Crime! ==== Season 6 ==== # Episode Published Links Description 1 The Macabre Death of Edgar Allan Poe March 13, 2020 Episode Q+A How much do we really know about the death of one of the most famous poets in the world? 2 The Missing Identity of the Lady of the Dunes March 20, 2020 Episode Q+A A criminal on the run? Or a Hollywood extra in the wrong place at the wrong time? The boys dissect theories on the mysterious identity and what may have happened to the Lady of the Dunes. 3 The Tinseltown Murder of Thelma Todd March 27, 2020 Episode Q+A A Hollywood starlet struck down in her prime- was it an accident, suicide or murder? 4 The Creepy Quandary of Who Put Bella in the Wych Elm April 3, 2020 Episode Q+A A skeleton is found in a tree in rural England during WWII- was she a victim of circumstance or something more nefarious? 5 The Puzzling Case of Marilyn and Sam Sheppard April 10, 2020 Episode Q+A A woman is found dead in her home, with her husband as the only possible witness and suspect. Is he guilty, or is he another victim of terrible circumstance? 6 The Mysterious Death of The Somerton Man Revisited April 17, 2020 Episode Q+A In the season finale and 100th episode of BuzzFeed Unsolved, Ryan and Shane revisit the show’s first ever mystery. ==== Season 7 ==== # Episode Published Links Description 1 The Eerie Vanishing of The Flannan Isles Lighthouse Keepers October 16, 2020 Episode Q+A What happened to the three lighthouse keepers of Flannan Isles? 2 The Daring Heists of The Elusive Pink Panthers October 23, 2020 Episode Q+A Who’s behind this elusive network of international jewel thieves? The boys dive into multiple heists of the Pink Panthers. 3 The Suspicious Death of Harry Houdini October 30, 2020 Episode Q+A A famed magician succumbs to his demise- was it an accident or murder? 4 The Sudden Disappearance Of Cynthia Anderson November 6, 2020 Episode Q+A A young secretary mysteriously disappears- was it murder or did she flee? 5 The Maritime Mystery of The Mary Celeste November 13, 2020 Episode Q+A What happened to the missing crew of the Mary Celeste? 6 The Haunting Murder Case of the Hammersmith Ghost November 20, 2020 Episode Q+A The terrorizing hauntings of a ghost lead a man to murder. Was there truly a ghost or was a man murdered in vain? ==== Season 8 ==== # Episode Published Links Description 1 The Mysterious Death of George Reeves June 18, 2021 Episode Q+A A Hollywood actor is found dead - was it suicide or murder? 2 The Puzzling Disappearance of Agatha Christie June 25, 2021 Episode Q+A What really happened to England’s famed author when she went missing? 3 The Menacing Case of the Monster with 21 Faces July 2, 2021 Episode Q+A Who’s really behind these cryptic candy-centric crimes? 4 The Perplexing Disappearance of Judge Joseph F. Crater July 9, 2021 Episode Q+A What really happened to the New York Supreme Court judge dubbed the most missingest man in America? 5 The Tragic Death of Princess Diana July 16, 2021 Episode Q+A The tragic death of Princess Diana shocked the world. But was it really an accident or were more nefarious plots at play? 6 The Bizarre Death of Alfred Loewenstein July 23, 2021 Episode Q+A In the series finale of BuzzFeed Unsolved: True Crime, Ryan and Shane examine the case of a wealthy Belgian financier who goes missing during a private flight. Was it suicide or murder? ===BuzzFeed Unsolved - Supernatural=== ==== Season 1 ==== # Episode Published Links Description 1 The Creepy Real-Life \"Men In Black\" April 29, 2016 Episode Will Smith and Tommy Lee Jones aren't walking through that door. 2 The Secret Society Of The Illuminati July 29, 2016 Episode Is the Illuminati actually a real thing? 3 3 Horrifying Cases Of Ghosts and Demons October 26, 2016 Episode Can ghosts and demons harm the living? 4 The Chilling Exorcism Of Anneliese Michel November 12, 2016 Episode One of the most chilling cases of demonic possession of all time. 5 The Bizarre Toxic Death of Gloria Ramirez December 3, 2016 Episode Unraveling one of the strangest deaths in medical history. 6 The Spirits Of The Whaley House January 13, 2017 Episode Rated the #1 haunted house in America by Travel Channel. Were they right? 7 The Haunted Decks of the Queen Mary February 17, 2017 Episode What happens when we stay the night on a real-life ghost ship? ==== Season 2 ==== # Episode Published Links Description 1 The Ghosts And Demons Of Bobby Mackey's April 7, 2017 Episode Hey there demons, it's me, ya boy 2 Bigfoot: The Convincing Evidence April 14, 2017 Episode Is Bigfoot real? We decided to find out! 3 3 Real-Life Creepy Cases Of Ancient Aliens April 21, 2017 Episode Q+A Were our ancestors visited by extraterrestrials? 4 The Haunted Halls Of Waverly Hills Hospital April 28, 2017 Episode Q+A See why this Sanatorium is one of the most haunted places in the world. 5 The Strangest Disappearances In The Bermuda Triangle May 5, 2017 Episode Q+A What's really going on in the Bermuda Triangle? 6 The Murders That Haunt The Lizzie Borden House May 12, 2017 Episode Q+A We investigated the house of a hundred-year-old murder mystery. 7 The Spontaneous Human Combustion Of Mary Reeser May 19, 2017 Episode Q+A What caused this woman to burst into flames? 8 The Haunting Of The Salem Witch Trials May 26, 2017 Episode Q+A Did one of America’s darkest chapters leave behind spiritual evidence? 9 The Haunted Quarters Of The Dauphine Orleans Hotel June 2, 2017 Episode Q+A What spirits lurk in this infamous New Orleans hotel? 10 The Bizarre Voodoo World Of New Orleans June 9, 2017 Episode Q+A Can we really contact the spirit world? ==== Season 3 ==== # Episode Published Links Description 1 The Ghost Town At Vulture Mine October 13, 2017 Episode Q+A We search for the buried spirits of a lawless frontier town. 2 Three Bizarre Cases Of Alien Abductions October 20, 2017 Episode Q+A Are we alone? Unsolved takes on the mysteries of the universe. 3 The Captive Spirits Of Eastern State Penitentiary October 27, 2017 Episode Q+A Does this prison still hold the spirits of its former inmates? 4 The Demonic Goatman’s Bridge November 3, 2017 Episode Q+A Does a demonic entity actually reside near Alton Bridge? 5 The Horrors Of Pennhurst Asylum November 10, 2017 Episode Q+A Do the dead still walk the corridors of this infamous asylum? 6 Roswell's Bizarre UFO Crash November 17, 2017 Episode Q+A What really happened in the New Mexico desert? 7 The Mysterious Disappearance Of The Roanoke Colony November 24, 2017 Episode Q+A We tackle the oldest mystery in US history. 8 London's Haunted Viaduct Tavern December 1, 2017 Episode Q+A The boys cross the pond to investigate a historically haunted London pub. 9 The Chilling Chambers of Colchester Castle December 8, 2017 Episode Q+A We investigate our first haunted castle! 10 The Subterranean Terrors of the London Tombs December 15, 2017 Episode Q+A What lurks beneath the streets of London? ==== Season 4 ==== # Episode Published Links Description 1 The Search for the Mysterious Mothman April 20, 2018 Episode Q+A Does this otherworldly creature stalk the West Virginia wilderness? 2 The Shadowy Spirits of Rolling Hills Hospital April 27, 2018 Episode Q+A We dance with the dead in this infamous haunted hospital. 3 The Demonic Bellaire House May 4, 2018 Episode Q+A Is this cursed property truly home to a demon? 4 The Phantom Prisoners of Ohio State Penitentiary May 11, 2018 Episode Q+A What horrors lurk in this historic prison? 5 The Unexplained Phoenix Lights Phenomenon May 18, 2018 Episode Q+A Lights in the sky. Extraterrestrials, or something even stranger? Featuring alien expert Giorgio Tsoukalos. 6 The Spirits of Moon River Brewing May 25, 2018 Episode Q+A We travelled to one of the most haunted locations in Savannah, Georgia. 7 The Horrifying Sorrel-Weed Haunted Mansion June 1, 2018 Episode Q+A Do the spirits of the Civil War still haunt this Savannah landmark? 8 The Mystical Villa Montezuma Mansion June 8, 2018 Episode Q+A Is this musical mansion a gateway to the spirit world? ==== Season 5 ==== # Episode Published Links Description 1 Return to the Horrifying Winchester Mansion October 19, 2018 Episode Q+A We return to the scene of one of our earliest investigations. 2 The Demon Priest of Mission Solano October 26, 2018 Episode Q+A Is this historic house of God really home to a demonic force? 3 The Terrors of Yuma Territorial Prison November 2, 2018 Episode Q+A Does this Arizona prison still hold the spirits of Old West outlaws? 4 3 Videos from the Pentagon's Secret UFO Program November 9, 2018 Episode Q+A Are we alone? Unsolved takes on the mysteries of the universe. 5 The Haunted Town of Tombstone November 16, 2018 Episode Q+A We travel to the O.K. Corral in search of gunslinging ghouls. 6 The Haunting of Hannah Williams November 23, 2018 Episode Q+A Season finale. We make our first haunted house call. 7 The Hunt for La Llorona - The Weeping Woman April 4, 2019 Episode Watch Ryan & Shane uncover details around the terrifying La Llorona along with their special guest, Curly Velasquez. 8 The Demonic Curse of Annabelle the Doll June 28, 2019 Episode Will Ryan and Shane's face to face with Annabelle be the Unsolved series finale? ==== Season 6 ==== # Episode Published Links Description 1 The Hidden Secrets of Area 51 September 20, 2019 Episode Q+A What really lies inside America's most top secret military base? 2 The Haunting Shadows of the St. Augustine Lighthouse September 27, 2019 Episode Q+A What lingering spirits remain in America's oldest city? 3 The Lost Souls of the USS Yorktown October 4, 2019 Episode Q+A How many restless spirits still walk the embattled decks of the famous old aircraft carrier? 4 The Hollywood Ghosts of the Legendary Viper Room October 11, 2019 Episode Q+A This infamous club on Sunset Boulevard has been home to countless famous faces in its nearly 80 years in operation- could some of those faces still be haunting the halls and hiding secrets that may lie beneath? 5 The Haunting of Loey Lane October 18, 2019 Episode Q+A The guys make another house call- this time there may be more than spirits waiting for them. 6 The Unbelievable Horrors of the Old City Jail October 25, 2019 Episode Q+A Ryan is challenged like never before - but will his efforts finally give him the evidence he's been hoping for? ==== Season 7 ==== # Episode Published Links Description 1 The Demonic Possession of the Conjuring House October 15, 2021 Episode Q+A Is a demonic entity actually trapped in this haunted home? 2 The Horrors of Villisca Ax Murder House October 22, 2021 Episode Q+A Does this rural Iowan home hold the spirits of its tragic history? 3 The Gettysburg Ghosts of Farnsworth House Inn October 29, 2021 Episode Q+A Do the lost spirits of this historic battle remain in this inn? 4 The Haunted Halls of Morris–Jumel Mansion November 5, 2021 Episode Q+A Do the spirits of American historical figures roam in this New York mansion? 5 The Spirits of Pythian Castle November 12, 2021 Episode Q+A What ghosts wander the halls of this grand castle? 6 Return To The Demonic Sallie House November 19, 2021 Episode In the series finale of BuzzFeed Unsolved: Supernatural, Ryan and Shane return to the place where their journey started to face the demon called Sallie once and for all. ===Spin-offs and Specials=== ====BuzzFeed Unsolved - Sports Conspiracies==== # Episode Published Description 1 The Mysterious Retirement of Michael Jordan December 14, 2017 What really lead to the GOAT's early retirement? 2 Patrick Ewing and the Frozen Envelope December 21, 2017 Was the 1985 NBA Draft rigged? 3 The Strange Case of Deflategate December 28, 2017 We cover one of the most talked about cases in sports history. 4 Muhammad Ali and the Phantom Punch January 4, 2018 Did Liston take a dive in this title fight? 5 The Notorious Game 6 of Lakers vs. Kings January 11, 2018 Was Game 6 of the 2002 Lakers Kings series fixed? ====Holiday Specials==== # Episode Published Links Description 1 The Legend of Krampus December 17, 2017 Episode (Animated) A ho-ho-horrifying holiday special! 2 Hey There Demons, It's a Spooky Yule Log December 17, 2018 Episode Enjoy 3 of the best true crime stories while watching this haunted yule log. How many ghosts can you spot? ==== Retrospectives ==== # Episode Published Link Description 1 Unsolved Almost 70th Episode Retrospective July 15, 2018 Episode It's an Unsolved extravaganza as the boys relive some of their biggest cases. ====Documentaries and behind the scenes==== # Episode Published Link Description 1 BuzzFeed Unsolved: The Making of the Final Investigation November 24, 2021 Episode In a look behind the scenes of Buzzfeed Unsolved's series finale, we say thanks to Ryan, Shane, the crew, and all of the fans who have made this such a wonderful journey. ==== Crossovers ==== # Episode Published Links Description 1 The Try Guys Sleep In A Fan's Haunted Bedroom • The Try Vlog (feat. BuzzFeed Unsolved) September 30, 2017 Episode Zach and Keith go on a Wyoming ghost adventure with a little help from Ryan and Shane. 2 Ryan and Shane Eat Everything Boysenberry at Knott's Berry Farm April 13, 2018 Episode \"Berrygara has his dancing shoes on today.\" 3 Ryan And Shane Make Each Other In The Sims 4 June 9, 2018 Episode Kelsey invites Ryan and Shane to surprise each other with their sim creations. 4 Ryan & Shane Choose A Fan's Haunted House • The Sims 4 June 26, 2018 Episode \"DON'T TELL HIM\" 5 Shane Controls His Friend's Life In The Sims 4 • Ryan August 4, 2018 Episode Ryan and Shane are back to play the Sims 4 and things get spooky. 6 Ryan And Shane Try To Make Apple Taters August 5, 2018 Episode Ryan and Shane create the first and only snack requested by demons! 7 We Styled Ryan & Shane • Ladylike August 8, 2018 Episode \"There's nothing spookier than a makeover.\" 8 Ryan Control's His Friend's Life in The Sims 4 • Shane August 11, 2018 Episode Ryan is back to take his revenge on Shane in The Sims 4! 9 Ryan & Shane Seduce A Ghost In The Sims 4 August 18, 2018 Episode Ryan and Shane from BuzzFeed Unsolved join Kelsey once again to play the Sims 4 and continue to plot the demise of the Try Guys. 10 Shane and Ryan Try To Kill The Try Guys In The Sims 4 August 25, 2018 Episode Ryan and Shane from BuzzFeed Unsolved join Kelsey a final time to play the Sims 4, marry a ghost, and murder the Try Guys. 5 Ryan and Shane from BuzzFeed Unsolved visit Knott's Scary Farm 2018 October 17, 2018 6 Worth It Meets Unsolved in The Sims 4 November 17, 2018 Episode In the season 3 finale, BuzzFeed Worth It's Andrew Ilnyckyj and Steven Lim are surprised by Unsolved’s Ryan Bergara and Shane Madej, and take a trip to the ghoul boy’s home in the Sims 4. Will Steven finally become the leader of the Upper Crusts? ==Related pages== * Puppet History ==References== ==Other websites== * * Category:YouTube",
 "title": "BuzzFeed Unsolved"
}