{
 "id": "648192",
 "text": "This ranking includes the clubs with players in the team when their national teams won the FIFA World Cup. The UEFA site does not list the 13 world champions of São Paulo and other players. == By club == Club Country No. Champions players Juventus 27 Bayern München 24 Inter Milan 20 Roma 16 Peñarol 14 Nacional Montevideo 13 São Paulo 13 Barcelona 11 Real Madrid 11 Santos 11 Botafogo 10 Milan 10 Köln 9 Palmeiras 9 River Plate 9 Corinthians Paulista 8 Borussia Dortmund 7 Fiorentina 7 Flamengo 7 Fluminense 7 Independiente 7 Arsenal 6 Paris Saint-Germain 6 Borussia Monchengladbach 5 Chelsea 5 Cruzeiro 5 Kaiserslautern 5 Liverpool 5 Olympique de Marseille 5 Monaco 5 Schalke 04 5 Valencia 5 Manchester United 5 Atletico Madrid 5 Sevilla 5 Eintracht Frankfurt 4 Bologna 4 Palermo 4 Lazio 4 Vasco da Gama 4 Atletico Cerro 3 Bella Vista 3 Boca Juniors 3 Gremio 3 Stuttgart 3 Talleres 3 West Ham United 3 Bayer Leverkusen 3 Olympique Lyon 3 Tottenham Hotspur 3 Real Betis 3 Huracán 3 Hamburger 2 Athletic Bilbao 2 Argentinos Juniors 2 Deportivo de La Coruña 2 Danubio 2 Leeds United 2 Montevideo Wanderers 2 Napoli 2 Newell's Old Boys 2 Nürnberg 2 Parma 2 Portuguesa 2 Racing Club Avellaneda 2 Rampla Juniors 2 Sampdoria 2 San Lorenzo 2 Triestina 2 Udinese 2 Werder Bremen 2 Villarreal 2 Manchester City 2 Benfica 2 América 1 Atletico Mineiro 1 Atlético Nacional 1 Atletico Paranaense 1 Auxerre 1 Bangu 1 Augsburg 1 Blackpool 1 Girondins de Bordeaux 1 Cagliari 1 Central Espanol 1 Olimpia Montevideo 1 Elche 1 Estudiantes de La Plata 1 Everton 1 Ferro Carril Oeste 1 Vélez Sársfield 1 FK Pirmasens 1 FSV Frankfurt 1 Fortuna Düsseldorf 1 Freiburg 1 Fulham 1 Greuther Furth 1 Hannover 96 1 Kashima Antlers 1 KSV Hessen Kassel 1 Metz 1 Middlesbrough 1 Miramar Misiones 1 Nantes 1 Lecce 1 Leicester City 1 Lucchese 1905 1 Racing Montevideo 1 Reggiana 1919 1 Rot-Weiss Essen 1 Sheffield Wednesday 1 Shimizu S-Pulse 1 Southampton 1 Wolverhampton Wanderers 1 Aston Villa 1 Brighton 1 Atlanta United FC 1 == By Country == Country No. Champions players (including multiple champions) 106 90 80 47 43 41 36 23 2 2 1 1 1 == Related pages == * FIFA World Cup ==References== Category:FIFA",
 "title": "Football Club Rankings for number of World Cup Winning Players"
}