{
 "id": "648103",
 "text": "Sean Michael Leonard Anderson (born March 25, 1988), is an American rapper, performing under the stage name Big Sean. He was born in Santa Monica, California and later moved to Detroit, Michigan at two months of age. Sean signed with Kanye West's GOOD Music in 2007. In 2008, he signed with Island Def Jam. Sean released his first studio album, Finally Famous, in 2011. He has also been featured in The Source, as well as the Detroit Metro Times. Big Sean has received four Grammy awards nominations: Best Rap Performance, Best Rap Song, Best Rap Collaboration, and Album of the Year. He has also been nominated for awards at the BET Hip Hop Awards, MTV Video Music Awards, Billboard Music Awards, and Detroit Music Awards. He won two MTV Video awards: Best Video with a Social Message and Best Fight Against the System. == Early life == Sean was raised by his mother, along with his grandparents, who he thanks for the properties of hard work and determination. In his early childhood Sean attended Detroit Waldorf School, a school of art. After 8th grade, Sean had to attend Cass Technical High School. In his later years in high school, Sean gained a valuable relationship with local Detroit hip-hop station 102.7 FM. He would show his rhyming skills every week as part of a rap battle contest they held weekly. == Music career == In 2005, Kanye West was doing a radio interview at 102.7 FM; hearing about this, Sean headed over to the station to meet West. After gaining a strong relationship with the station from his previous rap battle routines, he was allowed in and allowed to talk to Kanye about his rhythm skills. After leaving a demo tape and along with freestyling for West, Sean left him impressed. Two years later after months of submitting and fine-tuning Sean’s work, West finally wanted to sign Big Sean to his label GOOD Music. On September 30, 2007, Big Sean released his first official song from the mixtape Finally Famous: The Mixtape. === Finally Famous-The Mixtape === In 2007, Big Sean released his first official mixtape Finally Famous-The Mixtape. His hit single “Getcha Some” gave him strong media attention and led to articles in The Source and the Detroit Metro Times. The music video for “Getcha Some” was directed by Hype Williams. === U Know Big Sean-Finally Famous Vol. 2 === Sean released a second mixtape on February 25th, 2009 called U Know Big Sean-Finally Famous Vol. 2. During the night of the release, Big Sean performed alongside Cleveland rapper Chip Tha Rapper at the Clazel in Bowling Green, Ohio. == Finally Famous == \"Finally Famous\" the album is being slated to release in spring 2009. It will be Sean’s debut album and is said to include a plethora of hip-hop heavyweights. Some names include: Pharrell Williams, Kanye West, and The Dream. == Legal issues == Big Sean was accused for sexual assault in August 2011 at a concert in Lewiston, New York. In addition, Big Sean was fined $750 for turning guilty to unlawful imprisonment. Later they were dropped as part of the plea bargain. ==Discography== ===Studio albums=== * Finally Famous (2011) * Hall of Fame (2013) * Dark Sky Paradise (2015) * I Decided (2017) * Detroit 2 (2020) ===Collaborative albums=== * Twenty88 (2016) * Double or Nothing (2017) * What You Expect (with Hit-Boy) (2021) ==References== Category:1988 births Category:Living people Category:Rappers from California Category:Singers from California Category:Writers from Los Angeles County, California Category:Rappers from Michigan Category:Singers from Detroit Category:Musicians from Santa Monica, California Category:African-American rappers",
 "title": "Big Sean"
}