{
 "id": "648382",
 "text": "The U.S. State of Texas was affected by at least 34 tropical or subtropical cyclones between 1950 and 1979. A tropical cyclone hits Texas about three times every four years. On any 50 mile segment of the coastline, a hurricane hits about once every six years. The most intense storms in terms of the barometric pressure are Carla in 1961 and Beulah in 1967. The earlier was Texas' most damaging hurricane in the 1960s. It killed 46 people and caused $325 million in damage. ==1950-1964== June 26-27, 1957: Hurricane Audrey hit near the Texas-Louisiana state line as a Category 4 hurricane. The winds were near 145 miles per hour. Most of the storm's impact was in Louisiana. However, the storm still brought strong winds to far east Texas. September 10-12, 1961: Hurricane Carla hit near Port Lavaca. It was a Category 4 hurricane with an estimated central pressure near 931 millibars. An F4 tornado was put out by the storm near Galveston. That was the strongest tornado ever caused by a hurricane. Carla killed 46 people, 31 in Texas alone. The storm caused $325 million in damage. ==1965-1979== September 19-21, 1967: Hurricane Beulah hit just south of Brownsville as a mild Category 4 hurricane. It created 115 tornadoes (a record at the time). There were fifteen deaths in the United States. Damage was near $200 million. August 2-3, 1970: Hurricane Celia hit near Corpus Christi. The storm had microbursts and downbursts. Celia killed 28 people. It caused $930 million in damage in Texas. It was the costliest storm in Texas before Hurricane Alicia. July 30-August 1, 1978: Tropical Storm Amelia created major floods. This caused the deaths of over 30 people in south-central Texas. Damage was near $110 million. July 22-29: Tropical Storm Claudette struck at the Texas-Louisiana state line. The storm caused $400 million in damage. Two people were killed due to the storm. ==References== * Category:History of Texas",
 "title": "List of Texas hurricanes (1950–1979)"
}