{
 "id": "64843",
 "text": "Indigenous people are the original people who lived in a region before settlers. Indigenous people are also called aborigines, Native people, First People, First Nations, and Autochthonous. The United Nations prefers to use the phrase Indigenous people because other phrases may be pejorative and give a bad image. Many indigenous people were oppressed during colonialism. They were treated very poorly. Colonial settlers often robbed the indigenous treasures and took their lands. Some indigenous people were made slaves or killed by colonial settlers. Colonialism often encourages indigenous people to believe the propaganda that they are of a lower social class than the new settlers. As a result, indigenous people can grow up to believe that they are of a lower social class or less important. Indigenous people sometimes have to fight for their own land, their own history, human rights and equality. ==Related pages== * Human rights * Unrepresented Nations and Peoples Organization * Native Americans * Indigenous Australians ==Other websites== ===Institutions=== * UNEP Indigenous Knowledge Study * Survival International * Cultural Survival * Rural poverty and indigenous peoples on Rural Poverty Portal, powered by IFAD * IFAD and indigenous peoples (International Fund for Agricultural Development, IFAD) * UN Permanent Forum on Indigenous Issues (UN PFII) * Working Group on Indigenous Populations (WGIP) * Office of the United Nations High Commissioner for Human Rights (OHCHR)- Indigenous peoples * UNESCO Actions in favour of Indigenous Peoples * International Work Group for Indigenous Affairs (IWGIA) * Asia Pacific Indigenous Youth Network (APIYN) * Development Gateway Indigenous Issues Topic Page * Human Rights Internet- Indigenous issues * Unrepresented Nations and Peoples Organisation * European Network for Indigenous Australian Rights (ENIAR) * Indigenous Peoples' Center for Documentation, Research and Information (docip) * Diplomacy Monitor - Indigenous Peoples * IPS Inter Press Service News on indigenous peoples from around the world ===Indigenous studies=== * UNEP Indigenous Knowledge Study * University of Burgundy (France) Indigenous Studies (Formation Peuples Autochtones) * WWW Virtual Library- Indigenous studies resources * Center for World Indigenous Studies (CWIS) * African Pygmies studies Anthropological fieldwork about Pygmies * A History of Aboriginal Treaties and Relations in Canada This site includes contextual materials, links to digitized primary sources and summaries of primary source documents. * Articles on Theory of Property Rights and the Environment * Category:Indigenous peoples",
 "title": "Indigenous peoples"
}