{
 "id": "648456",
 "text": "From 1980 and beyond, at least 70 tropical or subtropical cyclones affected or hit the U.S. State of Texas. The most active month is September. In that month, 21 storms have affected or hit Texas. None have hit between December and May. The strongest storm in terms of barometric pressure is Hurricane Allen in 1980. Allen was also the first storm to affect or hit the state. The strongest storm in terms of wind speed is Hurricane Gilbert in 1988. That storm produced winds of Category 4 levels in the state. The most damaging hurricane to hit or affect Texas is Hurricane Harvey. That storm caused $125 billion in damage in late August 2017. ==1980-1999== August 10, 1980: Hurricane Allen hits just north of Brownsville as a Category 3 hurricane. Heavy rainfall is reported across South Texas; the most rain falls in Kingsville, with 20.2 inches in that area. Almost all structures on South Padre Island are destroyed. At least 12 tornadoes are caused by Allen. Damage from the storm is just over $600 million. August 17-18, 1983: Hurricane Alicia hits just south of Galveston and Texas City as a Category 3 storm. It hits Houston and Galveston directly. It has winds near 115 mph when it hits land. Damage totals $2 billion to $3 billion. June 26, 1986: Hurricane Bonnie hits near High Island as a Category 1 hurricane. The storm also affects Louisiana. Five people are killed. September 16-17, 1988: Hurricane Gilbert hits northern Mexico just south of Brownsville as a mild Category 4 hurricane. It creates 40 tornadoes in Texas. Two of them are killer tornadoes. Damage in the U.S. is $80 million. June 26-27, 1989: Tropical Storm Allison hits land at Freeport. The storm causes flooding that kills eleven people. Damage from Allison is $560 million. The tropical storm's winds are 50 mph when it hits. August 1, 1989: Hurricane Chantal hits eastern Texas as a Category 1 hurricane. The storm hits near High Island. Damage is near $100 million. Thirteen people are killed. October 16, 1989: Hurricane Jerry hits the Galveston area as a Category 1 hurricane. The storm causes $70 million in damage. It kills three people. June 19-21, 1993: Tropical Storm Arlene came ashore near South Padre Island in southern Texas. The winds were near 40 miles per hour when it hit the state. Damage was near $60.8 million. Mid-October 1994: The remnants of Eastern Pacific Hurricane Rosa caused severe flooding in Texas. The floods killed 22 people. Damage from the floods was $700 million. July 30-31, 1995: Tropical Storm Dean hit near Freeport. The rainfall caused localized damage. August 22-23, 1998: Tropical Storm Charley hit near Port Aransas as a strong tropical storm. Thirteen people die in the flash floods from the storm. September 11, 1998: Tropical Storm Frances hit at Corpus Christi as a strong tropical storm. The damage from Frances was $500 million. Mid-October 1998: The remnants from Pacific Hurricane Madeline caused flooding problems in central Texas. Damage was $750 million. 31 people were killed. August 22-23, 1999: Hurricane Bret hit at Padre Island as a Category 3 hurricane. It was the first hurricane in ten years. It was also the first major hurricane since Alicia 16 years before. ==2000-2019== June 5, 2001: Tropical Storm Allison hit the Galveston-Houston-Texas City region of Texas. Winds were near 60 miles per hour. The storm led to serious flooding in Texas and Louisiana. It killed over 50 people. Damage was almost $9 billion. September 7, 2002: Tropical Storm Fay hit near Port O'Connor as a strong tropical storm. Rainfall reached 18.49 inches at Fowlerton. July 15, 2003: Hurricane Claudette hit at Matagorda Island near Port O'Connor as a strong Category 1 hurricane. Damage was $181 million. September 23-24, 2005: Hurricane Rita struck at the borders of Texas and Louisiana as a Category 3 hurricane. The storm killed over 100 people, many during evacuation. Damage from Rita was as between $12 billion and $19 billion. August 16, 2007: Tropical Storm Erin hit close to Lamar as a mild tropical storm. Nine people were killed. Damage was $49 million. September 12-13, 2007: Hurricane Humberto hit eastern Texas as a Category 1 hurricane. The storm had 90 mph winds. It killed one person. The damage was $50 million. July 23, 2008: Hurricane Dolly hit at South Padre Island with winds of 100 mph. No people were killed by Dolly. But damage was between $1 billion and $2 billion. September 12-13, 2008: Hurricane Ike hit at Galveston, Texas City and Houston as a strong Category 2 hurricane. Winds were at 110 miles per hour. Damage from Ike was around $30 billion in the U.S. alone. September 7, 2010: Tropical Storm Hermine hit southern Texas while coming into the U.S. from Mexico. Eight people were killed in Texas and Oklahoma. Damage in the U.S. was $240 million. August 25-26, 2017: Hurricane Harvey hit south-central Texas as a Category 4 storm. Damage was $125 billion. That tied Harvey with Katrina as the costliest tropical cyclone in United States history. Over 100 people were killed, mostly in Texas. Most of the damage was from severe flooding. ==References== * Category:History of Texas",
 "title": "List of Texas hurricanes (1980–present)"
}