{
 "id": "648551",
 "text": "Hurricanes and tropical storms have been recorded in New England since the 17th century. But such storms have hit the region since long before then. The New England States are Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island and Vermont. ==Before 19th century== August 25, 1635: The Great Colonial Hurricane of 1635 hits New England. Forty-six people are killed. (Note: The word hurricane was not yet in American English at that time). September 1775: The 1775 Newfoundland hurricane brought very strong winds to New England. November 1, 1778: A late-season hurricane struck Cape Cod, Massachusetts. It killed 50-70 people. ==19th century== The 1804 Snow hurricane affected certain areas of New England. It generated snow in some parts of the Northeastern U.S. September 23-24, 1815: The 1815 New England hurricane struck New England. It had an 11-foot storm surge. The storm killed 38 people. File:1869 New England hurricane track.png|1869 new england hurricane File:Gloria 1985-09-27 1550Z.jpg|Hurricane Gloria approching new england File:Hurricane Gloria from the SLOSH model as it approached New England..gif|Hurricane Gloria September 4, 1821: The 1821 Norfolk and Long Island hurricane cut through western New England. The storm killed 17 people. September 8, 1869: A Category 3 hurricane struck Rhode Island. It caused several deaths in the New England region. October 4-6, 1869: The 1869 Saxby Gale struck Cape Cod and Martha's Vineyard as a Category 2 hurricane. It also struck Maine as a Category 1. The storm killed 37 people. ==20th century== November 3-4, 1927: A tropical storm struck western New England. It killed 84 people in Vermont and one in Rhode Island. September 21, 1938: The 1938 New England hurricane struck central New England. The storm killed over 600 people. It caused over $400 million in damage. In particular, it came ashore in Connecticut. September 14-15, 1944: The 1944 Great Atlantic hurricane hit east central New England at the Connecticut-Rhode Island border. It was a Category 1 storm when it struck. Damage across Cape Cod and Martha's Vineyard was worse than the 1938 hurricane. There was also severe wind damage in New Bedford, Massachusetts. Twenty-eight people were killed by the storm in New England. August 30-September 1, 1954: Hurricane Carol hit eastern New England, particularly Massachusetts and Rhode Island. The storm was a Category 3. Carol killed 68 people. Damage was over $400 million. September 11, 1954: Hurricane Edna struck Cape Cod and Martha's Vineyard as a Category 2 hurricane. Twenty people were killed. Damage was over $40 million. September 11-13, 1960: Hurricane Donna hit Connecticut as a strong Category 1 hurricane. The storm caused heavy damage in Massachusetts, Maine and New Hampshire. August 28, 1971: Tropical Storm Doria went into Connecticut after passing over Long Island. Hurricane-force wind was measured at sea level in Bridgeport, Connecticut. August 10-11, 1976: Hurricane Belle moved slowly into New England as a strong tropical storm. The storm hit central New England, particularly Connecticut and Massachusetts. September 27, 1985: Hurricane Gloria caused widespread wind damage in New England. The storm killed eight people. Damage from Gloria was $900 million. August 19, 1991: Hurricane Bob struck Rhode Island and eastern Massachusetts as a strong Category 2 hurricane. The storm killed 18 people. Damage was $1.5 billion. September 2, 1996: Hurricane Edouard passed just offshore as a Category 1 hurricane. The storm killed two people. ==21st century== November 3, 2007: Hurricane Noel created hurricane force wind gusts in New England. September 6-7, 2008: Tropical Storm Hanna moved through central and southern New England. Damage was minimal. September 2010: Hurricane Earl produced heavy rain and high winds across eastern New England. The storm caused minimal damage. August 27-28, 2011: Hurricane Irene moved into west-central New England as a strong tropical storm. Irene produced high winds, heavy rain and flooding in the region. The storm killed 16 people. The damage was in the billions of dollars. October 28-29, 2012: Hurricane Sandy affected New England with outer rain bands and high winds. Five people were killed in New England. October 29-30, 2017: Tropical Storm Philippe, combined with an extratropical system, resulted in around 1.2 million power outages. No people were killed. October 30, 2020: Hurricane Zeta, combined with a cold front, brought accumulating snow. Power outages and downed trees were a result. No people were killed. August 5, 2020: Hurricane Isaias, the hurricane caused tornados in New Jersey that killed lots of people, Power and Internet were out for days in New England. The storm killed 17 or 18 people. The damage was over 4 billion dollars. ==References== *",
 "title": "List of New England hurricanes"
}