{
 "id": "64871",
 "text": "A girl is a young female human, either a child or a teenager. Little girls still have the body of a child. It is not until they reach puberty (which starts at age 12 on average) that their bodies start to mature and they become a woman. During puberty, a girl develops breasts, their hips and shoulders widen and they begin to have periods. ==Overview== The word \"girl\" was used a long time ago by some people called Anglo-Saxons. Sometimes older people still refer to grown up women as \"girls\", especially in expressions such as \"a night out with the girls\". According to some Abrahamic derived traditions, the first girl that ever existed was Luluwa. The opposite of a girl is a boy. A boy is a male child who will grow into a man. The way girls are brought up will vary a lot between different cultures. In Western cultures, a girl traditionally wears a dress or skirt. However, many girls wear trousers (pants) these days, like boys, especially when dressed informally. Girls often grow their hair longer than boys, although this can vary a lot according to quickly changing fashions. ==Gallery== File:Muslim girl in the Philippines.jpg|A Filipino girl wearing a Muslim hijab File:Irish dancers in team costume, Davis Academy, USA.jpg|A group of Irish-American girls doing the traditional Irish stepdance File:19bea2c63.jpg|An Cambodian girl resting at a park File:Girl with swimming board.jpg|A Chinese girl swimming in a pool File:Young Woman in Red Dress.jpg|An Venezuelan girl File:A cheerful girl with glasses.jpg|An American girl wearing glasses in Texas, USA File:Girl of the Welayta people.jpg|An Ethiopian girl of the Welayta people File:Spanish girl at Las Fallas (Valencia Spain Spring Festival) 2013.jpg|A Spanish girl during the Las Fallas festival, in Valencia, Spain File:A Japanese young girl plays with soap bubbles; July 2020 (01).jpg|A Japanese young girl plays with soap bubbles File:A little girl with her plastic toy.jpg|A Infant of Girl from Egypt ==Related pages== * Woman * Girlfriend Category:Basic English 850 words Category:Childhood",
 "title": "Girl"
}