{
 "id": "64872",
 "text": "Family Guy is an American animated sitcom created by Seth MacFarlane for the Fox Broadcasting Company. The show mainly focuses on the Griffin family, a badly functioning family. The parents are Peter and Lois, and their children are Meg, Chris, and Stewie. The family also has a talking pet dog, Brian. The show is set in the fictional city of Quahog, Rhode Island. A lot of its humor uses cutaway gags to make fun of American culture. The family was created by MacFarlane after making two animated movies, The Life of Larry and Larry & Steve. MacFarlane changed the movie's main character, Larry, and his dog, Steve, and renamed them Peter and Brian. MacFarlane showed a seven-minute pilot episode to Fox in December 1998, and the show then began on Fox. Family Guy cancellation was announced shortly after the third season had aired in 2002, and one unaired episode was shown on Adult Swim in 2003. Good DVD sales and high ratings from reruns meant Fox to restarted the show in 2004. A fourth season began the following year, on May 1, 2005. Family Guy has been given critical acclaim. In 2009, it was nominated for a Primetime Emmy Award for Outstanding Comedy Series, the first time an animated series was nominated for the award since The Flintstones in 1961. In 2013, TV Guide said Family Guy was the ninth Greatest TV Cartoon of All Time. On May 11, 2020, Fox let the series have a nineteenth season. On September 23, 2020, Fox said that the show would continue for a twenty-first season. The twenty-first season started on September 25, 2022. Currently, episodes of Family Guy have been broadcast. On January 26, 2023, Fox said that the series would have a season 22 and 23, taking the show through the 2024-25 television season. Season 22 premiered on October 1, 2023. == Main characters == * Peter Griffin is the show's main character. He is fat and not very smart. He used to work at a toy factory. He now works at a beer company called \"Pawtucket Brewery\", though he sometimes works at other jobs for short time periods. * Lois Griffin is Peter's wife. She comes from a family that has a lot of money. She complains a lot about what the Griffins do in the house, though she also tends to keep the family connected. * Brian Griffin is one of Peter's best friends. He is a talking dog who lives with the Griffins, and is smarter than any of them besides Stewie. He is also with Stewie alot. Brian was killed in an episode in the twelfth season, but he was brought back to life two episodes later. * Stewie Griffin is Peter's and Lois' one-year old son. He can talk, and is the smartest person in the family. Most people in his family can not understand him, except for Brian and Chris. Stewie hates his mother Lois, and wants to take over the world. * Chris Griffin is one of Peter's and Lois' sons. He is also fat and not very smart. For a long time, there was an evil monkey living in his closet who liked to threaten him. * Meg Griffin is Peter's and Lois' daughter. She is the oldest child but is often made fun of, mostly by Peter. She is not very popular and everyone finds her very unattractive. * Glenn Quagmire is one of Peter's best friends. He is a bachelor and a pilot. He mostly thinks about women and sex. * Cleveland Brown is another one of Peter's best friends. He runs a deli and he was married to Loretta. He used to speak fast as an auctioneer but got hit in the head, so he speaks slower now. He left Family Guy for his spin-off television series, The Cleveland Show, but came back in the episode \"He's Bla-ack!\". * Joe Swanson is another one of Peter's best friends. He is a police officer with a wheelchair because he cannot move his legs and feet. He has a wife named Bonnie who was pregnant until she had a baby in the episode \"Ocean's Three-and-a-Half\". == Episodes == ==Notes== ==References== Category:1990s American sitcoms Category:2000s American sitcoms Category:2010s American sitcoms Category:2020s American sitcoms Category:1999 American television series debuts Category:1990s American comedy television series Category:1990s American animated television series Category:2000s American comedy television series Category:2000s American animated television series Category:2010s American comedy television series Category:2010s American animated television series Category:2020s American animated television series Category:Adult animated television series Category:Adult Swim Category:Fox television series Category:Television series by Disney Category:Television series about families Category:English-language television programs",
 "title": "Family Guy"
}