{
 "id": "648852",
 "text": "Filip Vujanović (Montenegrin Cyrillic: Филип Вујановић, ) (born 1 September 1954 ; in Belgrade,SFR Yugoslavia) is a Montenegrin politician. He was the 3rd President of Montenegro from 2003 to 2018. He was the country's first president since its independence in June 2006.Profile, int.iol.co.za; accessed 4 December 2015. == Biography == In 1978, he graduated from the Law Faculty of the University of Belgrade. From March 1978 to November 1980, he was an employee of the municipal and district prosecutor's office in Belgrade. From November 1980 to January 1981, he worked as a court clerk at the District Court of Titograd. In 1982-1993 he was engaged in advocacy. From March 1993 to May 1995, Minister of Justice of Montenegro. 1995-1998, Minister of Internal Affairs of Montenegro. From February 5, 1998, to November 5, 2002, Chairman of the Government of Montenegro as part of Yugoslavia. Since November 5, 2002, Chairman of the Assembly of the Union Republic of Montenegro. Since November 25, 2002, after the resignation of Milo Djukanovic he became acting president. May 11, 2003 elected President of Montenegro; the inauguration took place on 22 May. He was a supporter of NATO integration of Montenegro. == President == On 5 November 2002, he became speaker of the Montenegrin parliament, and from 25 November 2002, he served as Acting President after Đukanović's resignation. Vujanović ran in the December 2002 presidential elections but the result was invalid due to low turnout. The elections were repeated in February 2003, with Vujanović winning again, but turnout was still below 50%. A third election was held on 11 May 2003, with the minimum turnout rule abolished, and Vujanović won with 63% of the vote. On 14 December 2006, he signed an agreement to join NATO's \"Partnership for Peace\" program, making Montenegro a member. After that, President Vujanović and NATO Secretary General Jaap de Hoop Scheffer held a press conference, where Scheffer praised Montenegro's choice to move towards European integration. ==References== Category:1954 births Category:Living people Category:Presidents of Montenegro Category:Prime Ministers of Montenegro",
 "title": "Filip Vujanović"
}