{
 "id": "648876",
 "text": "Luís Vaz de Torres was a Spanish explorer. Sometimes his name is spelled Luis Váez de Torres. He was born around the year 1565, and died in 1607. Today, he is noted for the first recorded European navigation of the strait which separates the continent of Australia from the island of New Guinea. The strait is now named after him (Torres Strait). ==Origins and early life== Captain Luis Váez de Torres undertook a voyage from 1606 to 1607. In this voyage, the crew called him a \"Breton\" in reports.Diego de Prado y Tovar - Summary Account of the Discovery started by Pero Fernandes de Quirós and that was Finished by Captain Diego de Prado y Tovar with the assistance of Captain Luis Váez de Tores on the nao San Pedrico until the city of Manila 20 May 1608 for honouring and glorifying the Allmighty (Relación sumaria del del descubrimto. que empeçó Pero Fernandes de Quirós y le acabo El Capitán Don Diego de Prado con Asistencia del Capitán Luis Vaez de Torres en la nao San Pedrico hasta la ciudad de Manila el 2 de mayo de 1608 a horna y gloria del omnipotente. Handwritten by Diego de Prado, certified and signed by all officials of the nao, including Captain Váez de Torres on Manila on 6 June 1608. Original document published electronically by New South Wales State library. Page 1, line 17. \"De la nao almiranta San Pedrico será Capitán Don Luis Váez de Torres, bretón\" (Of the nao almiranta San Pedrico it will be captain Don Luis Váez de Torres, bretón). Page 1 available (latest access 01/10/2013 at http://acms.sl.nsw.gov.au/album/ItemViewer.aspx?itemid=824242&suppress;=N&imgindex;=2 One of the reports points to an origin in the northwest province of Spain, that is Galicia. Historians accept this as evidence of his origins.Estensen, M. (2006) Terra Australis Incognita: The Spanish Quest for the mysterious Great South Land, p. 115. Allen & Unwin, Australia. . Estensen notes that Don Diego de Prado y Tovar, a Spanish nobleman who accompanied Torres, refers to him in his account as a \"Breton\". Estensen points out that Spaniards then colloquially called Galicians Bretons, and that, therefore, Torres was almost certainly from Galicia.Hilder, B.(1980) The Voyage of Torres. University of Queensland Press, St. Lucia. 1980, \"The Celtic zones par excellence, however, continued to be Galicia and Portugal.\" 'A history of Spain from the beginnings to the present day' by Rafael Altamira; translated by Muna Lee, 1966Journal of Diego de Prado y Tobar, State Library of New South Wales. ADLIB110326511 Accessed 18/1/2017. For the original account, see page 1 line 17 of the account by Dom Diego de Prado, signed by Captain Vaz de Torres and other officials in Manila on June 6, 1608, also page 10 line 26-28 The year and exact place of his birth are unknown but he was likely born around 1565. Torres has been presented as Portuguese, without any evidence other than his name.Alan Villiers, The Coral Sea, Whittlesey House, 1949, p. 99.: \"The second-in-command, or at any rate the commanding officer of the second ship, was a Portuguese pilot named Luis Vaz de Torres\".William A. R. Richardson, Was Australia charted before 1606? The Java la Grande inscriptions, National Library Australia, 2006, p. 20. : \"Pedro Fernandes de Quirós and Luis Vaz de Torres, both Portuguese in command of Spanish vessels...\"Kenneth Gordon McIntyre, The secret discovery of Australia: Portuguese ventures 250 years before Captain Cook, Pan Books, 1987, p. 181. :\"In these Spanish expeditions to the South Seas, the Portuguese explorers Pedro Fernandes de Queiros and Luis Vaz de Torres played a leading part. ...\" - Found in the search results. He is never called a Portuguese in the records but they note remarks made by crew members of the Portuguese origins of Pedro Fernandes de Queirós. Torres entered the navy of the Spanish Crown and found his way to its South American colonies. By late 1605 he first entered the historical record as the nominated commander of the second ship in an expedition to the Pacific. The Portuguese born navigator Pedro Fernandes de Queirós proposed him for the position. == References == Category:1560s births Category:1600s deaths Category:Galician people Category:Spanish explorers",
 "title": "Luís Vaz de Torres"
}