{
 "id": "649142",
 "text": "Aaron Paul Sturtevant (born August 27, 1979) is an American actor. He is best known for his role as Jesse Pinkman on the AMC drama series Breaking Bad (2008–2013). The role earned him a Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series in 2010, 2012 and 2014. He has also had roles in movies such as Need for Speed (2014), A Long Way Down (2014) and Exodus: Gods and Kings (2014). He also voiced Todd Chavez on the Netflix animated series BoJack Horseman (2014–2020). Paul was born in Emmett, Idaho. He married Lauren Parsekian in 2013. They have one daughter. ==Filmography== ===Movie=== Year Title Role Notes 2000 Whatever It Takes Floyd 2000 Help! I'm a Fish Chuck (voice) 2001 K-PAX Michael Powell 2002 National Lampoon's Van Wilder Wasted Guy 2004 Perfect Opposites Monty Brandt 2005 Candy Paint Brad Miller Short movie 2005 Bad Girls from Valley High Jonathon Wharton 2006 Choking Man Jerry 2006 Mission: Impossible III Rick Meade 2007 Daydreamer Clinton Roark 2007 Leo Hustler Short movie 2008 Say Goodnight Victor 2009 The Last House on the Left Francis 2010 Wreckage Rick 2010 Weird: the Al Yankovic Story \"Weird Al\" Yankovic Short movie 2011 Quirky Girl Joseph Short movie 2012 Smashed Charlie Hannah 2013 Decoding Annie Parker Paul Milano International Film Festival Award for Best Supporting Actor 2014 Need for Speed Tobey Marshall 2014 A Long Way Down JJ 2014 Hellion Hollis Wilson Also co-executive producer Grand Jury Prize Award for Narrative Feature Competition 2014 Exodus: Gods and Kings Joshua 2015 Unity Narrator Documentary 2015 Eye in the Sky Steve Watts 2015 Fathers and Daughters Cameron 2016 Triple 9 Gabe Welch 2016 Central Intelligence Phil Stanton 2016 Kingsglaive: Final Fantasy XV Nyx Ulric Voice 2016 The 9th Life of Louis Drax Peter 2016 Come and Find Me David 2018 The Burning Woman Post-production 2018 Welcome Home Bryan Filming TBA The Parts You Lose Filming ===Television=== Year Title Role Notes 1999 Beverly Hills, 90210 Chad Episode: \"Fortune Cookie\" 1999 Melrose Place Frat Boy Episode: \"The Daughterboy\" 1999 Suddenly Susan Zipper Episode: \"A Day in the Life\" 1999 3rd Rock from the Sun Student Episode: \"Dick's Big Giant Headache: Part II\" 2000 The Price is Right Himself - Contestant Episode: \"Season 28, Episode 69\" 2000 Get Real Derek Episode: \"History Lessons\" 2001 100 Deeds for Eddie McDowd Ethan Episode: \"Eddie Loves Tori\" 2001 The Division Tyler Petersen Episode: \"Hero\" 2001 Nikki Scott Episode: \"Family Lies\" 2001 The Guardian Ethan Ritter Episode: \"The Men from the Boys\" 2001 The X-Files David \"Winky\" Winkle Episode: \"Lord of the Flies\" 2001–2002 Judging Amy \"X-Ray\" Conklin 2 episodes 2002 NYPD Blue Marcus Denton Episode: \"Oh, Mama!\" 2002 CSI: Crime Scene Investigation Peter Hutchins, Jr. Episode: \"Felonious Monk\" 2002 Birds of Prey Jerry Episode: \"Pilot\" 2002 Wasted Owen Turner Television movie 2003 ER Doug Episode: \"A Saint in the City\" 2003 Kingpin Stoner Episode: \"El Velorio\" 2003 CSI: Miami Ben Gordon Episode: \"Grave Young Men\" 2003 Guiding Light Adrian Pascal 1 episode 2003 Threat Matrix Shane Episode: \"Natural Borne Killers\" 2004 Line of Fire Drew Parkman Episode: \"Mother & Child Reunion\" 2005 Veronica Mars Eddie Laroche Episode: \"Silence of the Lamb\" 2005 Joan of Arcadia Denunzio Episode: \"Secret Service\" 2005 Point Pleasant Mark Owens 3 episodes 2005 Criminal Minds Michael Zizzo Episode: \"The Popular Kids\" 2005 Sleeper Cell Teen Episode: \"Al-Faitha\" 2006 Bones Stew Ellis Episode: \"The Superhero in the Alley\" 2006 Ghost Whisperer Link Episode: \"Fury\" 2007–2011 Big Love Scott Quittman 14 episodes 2008–2013 Breaking Bad Jesse Pinkman 62 episodes 2012 Robot Chicken Glenn (voice) Episode: \"Robot Chicken DC Comics Special\" 2012–2013 Tron: Uprising Cyrus (voice) 3 episodes 2013 The Simpsons Jesse Pinkman Episode: \"What Animated Women Want\" 2013 Saturday Night Live Meth Nephew Episode: \"Tina Fey/Arcade Fire\" 2014–2020 BoJack Horseman Todd Chavez (voice) 76 episodes; also executive producer 2016–2018 The Path Eddie Lane 36 episodes; also producer 2017 Black Mirror Gamer691 (voice) Episode: \"USS Callister\" ===Music videos=== Year Song Artist Role 2002 Thoughtless Korn Floyd Louis Cifer 2003 White Trash Beautiful Everlast Boyfriend ==References== ==Other websites== * Category:1979 births Category:Living people Category:Actors from Idaho Category:American movie actors Category:American television actors Category:American voice actors Category:Emmy Award winning actors",
 "title": "Aaron Paul"
}