{
 "id": "649151",
 "text": "Hugo Hadrien Dominique Lloris (born 26 December 1986) is a French professional footballer who plays as a goalkeeper for Major League Soccer club Los Angeles FC. == Career == === Club === ==== Youth: Nice ==== Hugo began his football career when he was six years old and played at the CEDAC (Centre de Diffusion et d'Action Culturelle), a local cultural centre based in the neighborhood of Cimiez, Nice. The centre offered a variety of activities, which included football. Lloris played at a variety of positions at the centre, such as in the attack, before switching to the goalkeeper position after coaches noticed that he possessed (to have) impressive goalkeeping qualities, such as ball- handling and catching skills. Hugo Lloris began his professional career in 1997 with the Nice's youth team, at the age of 11. He arrived to OGC Nice, thanks to the Nice's former goalkeeper Dominique Baratelli, and in 2004, he was France's U18 champion. ==== Nice and Lyon ==== In the 2005-06 season, at the age of 19, he played with the first team of Nice. His first match with the team came on 25 October 2005 against Chateauroux. He played in five matches during that season. The next season, he played 37 matches. He gave up only 36 goals and recorded 13 clean sheets. In 2007-2008, he played 30 matches. He gave up only 24 goals and recorded 13 clean sheets. After that season, several big European clubs approached Lloris. They hoped to sign him to their teams because of his excellent performance. On 29 May 2008 he went to Lyon for €8.5 Million, with a five-year contract. Lloris made his club debut on 10 August 2008 against Toulouse. He finished the campaign conceding only 27 goals in the league and recording 16 clean sheets; both of which were second-best to only Cédric Carrasso. Lloris was then named the league's top goalkeeper and also named to the Team of the Year. In the 2009–10 season, Lloris remained the club's first-choice goalkeeper and opened the new campaign by recording four clean sheets in the club's first eight matches. In September 2009, he was awarded the UNFP Player of the Month. In December 2009, Lloris finished third behind Nicolas Anelka and Yoann Gourcuff in voting for the France Football 2009 French Player of the Year award. On 16 February 2010, Lloris earned a clean sheet in Lyon's first leg of its UEFA Champions League knockout round match against Real Madrid. In May 2010 he was named, for the second consecutive season, the UNFP Ligue 1 Goalkeeper of the Year. In the 2010-2011 season, Lloris was nominated for the UEFA Club Goalkeeper of the Year award at the UEFA Club Football Awards, but lost out on the award to Champions League- winning keeper Júlio César of Internazionale. In this season, he conceded 40 goals. ==== Tottenham ==== Lloris signed for Tottenham Hotspur on 31 August 2012 for €10 million and €5 million variable.http://www.actusnews.com/documents_communiques/ACTUS-0-29249-cp-ol- groupe-100912.pdf He made his debut for Spurs in a UEFA Europa League match against Lazio on 20 September 2012, the result of the match was 0–0. Lloris started his first Premier League game against Aston Villa on 7 October 2012, keeping a clean sheet in a 2–0 home victory. After conceding only four goals in six games, he was nominated for the Barclays Premier League Player of the Month for December 2012, but lost out to Manchester United's Robin van Persie. Lloris ended the 2012–13 season with 25 appearances and 9 clean sheets. Lloris signed a five-year contract extension in July 2014. Lloris was named in the starting eleven of the EFL Cup final against Chelsea F.C. in the hopes of winning the trophy but Tottenham lost 2–1. In August 2015, Tottenham manager Mauricio Pochettino named Lloris permanent captain. In December 2016, Lloris signed a contract extension to remain at Tottenham until 2022. In the 2016–17 season, Lloris helped Tottenham achieve the best defensive record in the club's history, conceding only 26 goals in the Premier League this season (only 9 of which were conceded in home league games). === International career === Lloris has been active on the international front with France, first appearing with the under-18 team making his debut on 11 March 2004 in a friendly match against Germany. He later played with the under-19 team and was part of the winning team at the 2005 European Under-19 Football Championship. Lloris appeared in all five matches the team played in the competition. He made only five appearances with the under-21 team. Lloris received his first call-up to the senior national team on 6 February 2008 in a match against Spain. On 17 November 2010, Lloris captained France, for the first time, in the team's 2–1 victory over England at Wembley Stadium. He played in three World Cups, 2010, 2014. and 2018, and two European Cups, 2012 and 2016. On 2 June 2017, Lloris made his 88th appearance for France in a 5–0 friendly home win over Paraguay, overtaking Fabien Barthez as his nation's most capped goalkeeper of all time. On 21 June 2018, Lloris earned his 100th cap in France's 1–0 win over Peru in their second group stage game of the 2018 FIFA World Cup. Against Uruguay in the quarter-finals, Lloris made a key save from a Martin Caceres header as France won 2-0. On 15 July, he lifted the World Cup trophy as his team's captain, as France defeated Croatia with a 4–2 victory in the final, despite his mistake which allowed Croatia's Mario Mandžukić to score a goal as Lloris tried to dribble past him. Gianluigi Buffon praised him and said in an interview that Hugo deserved to win the Golden Glove award of the best goalkeeper of the tournament, which was won by Thibaut Courtois. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup League cup Continental Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Nice II 2004–05 CFA 12 0 — — — — 12 0 2005–06 CFA 8 0 — — — — 8 0 Total 20 0 — — — — 20 0 Nice 2005–06 Ligue 1 5 0 1 0 5 0 — — 11 0 2006–07 Ligue 1 37 0 0 0 0 0 — — 37 0 2007–08 Ligue 1 30 0 0 0 0 0 — — 30 0 Total 72 0 1 0 5 0 — — 78 0 Lyon 2008–09 Ligue 1 35 0 2 0 0 0 8 0 1 0 46 0 2009–10 Ligue 1 36 0 2 0 0 0 14 0 — 52 0 2010–11 Ligue 1 37 0 2 0 0 0 8 0 — 47 0 2011–12 Ligue 1 36 0 4 0 3 0 10 0 — 53 0 2012–13 Ligue 1 2 0 0 0 0 0 0 0 1 0 3 0 Total 146 0 10 0 3 0 40 0 2 0 201 0 Tottenham Hotspur 2012–13 Premier League 27 0 0 0 1 0 5 0 — 33 0 2013–14 Premier League 37 0 1 0 1 0 6 0 — 45 0 2014–15 Premier League 35 0 0 0 1 0 8 0 — 44 0 2015–16 Premier League 37 0 0 0 0 0 9 0 — 46 0 2016–17 Premier League 34 0 1 0 0 0 8 0 — 43 0 2017–18 Premier League 36 0 0 0 0 0 7 0 — 43 0 2018–19 Premier League 33 0 0 0 0 0 11 0 — 44 0 2019–20 Premier League 21 0 2 0 0 0 4 0 — 27 0 2020–21 Premier League 38 0 1 0 4 0 5 0 — 48 0 2021–22 Premier League 38 0 2 0 2 0 1 0 — 43 0 2022–23 Premier League 25 0 0 0 0 0 6 0 — 31 0 2023–24 Premier League 0 0 0 0 0 0 0 0 — 0 0 Total 361 0 7 0 9 0 70 0 — 447 0 Los Angeles FC 2024 Major League Soccer 6 0 0 0 — — 0 0 6 0 Career total 605 0 18 0 17 0 110 0 2 0 752 0 ===International=== Appearances and goals by national team and year National team Year Apps Goals France 2008 1 0 2009 7 0 2010 11 0 2011 11 0 2012 13 0 2013 11 0 2014 11 0 2015 7 0 2016 13 0 2017 9 0 2018 14 0 2019 6 0 2020 6 0 2021 16 0 2022 9 0 Total Total 145 0 ==Honours== Lyon *Coupe de France: 2011–12 *Trophée des Champions: 2012 Tottenham Hotspur *Football League Cup/EFL Cup runner-up: 2014–15, 2020–21 *UEFA Champions League runner-up: 2018–19 France U19 *UEFA European Under-19 Championship: 2005 France *FIFA World Cup: 2018; runner-up: 2022 *UEFA Nations League: 2020–21 *UEFA European Championship runner-up: 2016 Individual *Toulon Tournament Best Goalkeeper: 2006 *Ligue 1 Goalkeeper of the Year: 2008–09, 2009–10, 2011–12 *Ligue 1 Team of the Year: 2008–09, 2009–10, 2011–12 *UNFP Player of the Month: September 2009 Orders *Knight of the Legion of Honour: 2018 == References == == Other websites == * Hugo Lloris at tottenhamhotspur.com * Category:1986 births Category:Living people Category:2018 FIFA World Cup players Category:2014 FIFA World Cup players Category:2010 FIFA World Cup players Category:French association football goalkeepers Category:Sportspeople from Nice Category:2022 FIFA World Cup players Category:France at the 2010 FIFA World Cup Category:France at UEFA Euro 2012 Category:France at the 2014 FIFA World Cup Category:France at UEFA Euro 2016 Category:France at the 2018 FIFA World Cup Category:France at UEFA Euro 2020 Category:France at the 2022 FIFA World Cup Category:Footballers from Provence-Alpes-Cote d'Azur",
 "title": "Hugo Lloris"
}