{
 "id": "649225",
 "text": "In the sport of cricket, batting is the act or skill of hitting the cricket ball with a cricket bat. Any player who is currently batting is called a batter, even if they are better in other skills of cricket such as bowling or fielding. The batter uses his/her bat to try and score runs. They also use it to prevent the ball from hitting the wicket, and to avoid other forms of dismissal including leg before wicket or being caught. Batters have to adapt to various conditions when playing on different pitches, especially in different countries. A top-level batter has good reflexes, decision-making and strategy with excellent physical batting skills. ==The bat== The bat is a standard piece of equipment in cricket, and is carried by all batters when they are on the field. It is made of wood (usually willow), and takes the shape of a straight blade topped by a cylindrical handle that is made of cane, and enclosed in a rubber sheath (grip). The blade must not be more than 4¼ inches (10.8 cm) wide, and the total length of the bat not more than 38 inches (96.5 cm). In the early history of cricket, the bat had the shape of a modern hockey stick with a curved end. That was necessary because the ball was bowled along the ground, as in bowls, until the early 1760s when bowlers began pitching their deliveries. In response, the straight bat was invented. There is a bat in the Kennington Oval pavilion which belonged to one John Chitty of Knaphill, Surrey. Dated 1729, it is the world's oldest known bat. The width of the bat was determined following a controversial incident in September 1771. In a match between the Chertsey and Hambledon Club teams, Thomas White of Chertsey used a bat that was at least the width of the wicket. The Hambledon players objected. A formal protest was written by Thomas Brett, and signed by himself, Richard Nyren, and John Small. It brought about a change in The Laws of Cricket, as confirmed in 1774, whereby the maximum width of the bat was set at four and one quarter inches. ==Innings== During an innings, two members of the batting side are on the pitch. The one facing the current delivery from the bowler is called 'the striker', while their partner is the 'non-striker' whose position is by the wicket at the bowler's end of the pitch. When a batter is out (dismissed), he/she is replaced by a team-mate. This continues until the end of the innings. The innings may have ended because ten of the team members have been dismissed, which means the team is all out. When this happens, one of the batters is still not out, but must also leave the field because they have no partners left. After that team's innings is over, the other team takes its turn to bat. ==Partnerships== While two batters are playing together, they are sharing a partnership. Depending on the quality of the delivery that is bowled, the striker may play defensively without attempting to score a run. If he/she plays an offensive shot to hit the ball away from the pitch and clear of the fielders, then both partners have the option to run to the other end of the pitch without one of them being run out. If a single run is scored, or if they have run three, the batters have changed ends of the pitch, and so the non-striker becomes the striker for the next delivery. Completing a run is the means of scoring in cricket. Each run is added to the team total, to the striker's personal total, and to the partnership total. Match records always note how many runs are scored while a partnership lasts. If, for example, the first four batters are out, and it is the fifth and sixth batters in the batting order who are in together, and they add 100 runs to the team total before one of them is out, the record will show that they shared a century partnership for the fifth wicket. ==Tactics== Batting tactics and strategy depends on the type of match being played. It also depends on the current state of play. Batters try to score many runs quickly without losing their wicket. To score quickly, risky shots must be played which increases the chances of batters being out. A batter's safest choice is to guard the stumps, but this may result in scoring fewer runs. ==Statistics== As with all other cricket statistics, batting statistics and records are given much attention. It helps to know how effectively a batter is playing. The main statistic for batting is a player's batting average. This is calculated by dividing the number of runs he has scored by the number of times he has been out (dismissed). ==References== Category:Cricket",
 "title": "Batting (cricket)"
}