{
 "id": "649325",
 "text": "The Sykes–Picot Agreement /ˈsaɪks piˈkoʊ/, officially known as the Asia Minor Agreement, was a secret agreement concluded between the United Kingdom and France in 1916. The main aim of the British and French was to agree on who should get which sphere of influence in Ottoman territories in the Middle East. They wanted the agreement to limit competition between each other after the First World War and to secure strategically-important territories for themselves. The line separating their respective zones of influence was called the Sykes-Picot Line.Mansfield, Peter (1973) British Empire magazine, Time- Life Books, no 75, p. 2078 The Russian Empire and the Kingdom of Italy consented to the agreement and received a territorial advantage in return. The agreement was named after the two diplomats who negotiated it: the British diplomat Mark Sykes and the French diplomat François Georges-Picot. They negotiated for five weeks, from the 23rd of November 1915 to the 3rd of January 1916, before agreeing on a memorandum.Hurewitz, J. C. (1979). The Middle East and North Africa in World Politics: A Documentary Record. British- French supremacy, 1914–1945. 2. Yale University Press. ISBN 978-0-300-02203-2. The agreement itself was concluded on the 9th and 16th of May 1916, when the British and French governments accepted and signed (ratified) the memorandum. When the Russian revolutionaries made the agreement public in 1917 after the Bolshevik Revolution, which caused embarrassment among the British and French and growing distrust among the Arabs. More than hundred years later, this agreement is still mentioned in the current conflicts and disputes in the respective regions of the Middle East. == Historical context == The Ottoman Empire, under the lead of the Committee of Union and Progress, entered the war in autumn 1914 on the side of the Central Powers (the German Empire, Austria- Hungary, Bulgaria, and initially Italy) and was therefore opposed to the Triple Entente (the United Kingdom, France, and the Russian Empire). The Sykes–Picot Agreement was concluded with the British and the French expecting victory against the Central Powers and thus the demise of the Ottoman Empire. === British and French interests in Middle East === As scholars have argued, the Sykes-Picot Agreement was signed to further the colonial and strategic interests of the British and French in the Middle East and to settle their rivalry, rather than to create viable states after the war.Ottaway, Marina (2015). Learning from Sykes-Picot. WWIC Middle East Program Occasional Paper Series. Retrieved from https://www.wilsoncenter.org/publication/learning- sykes-picot (16.05.2022) The main interest of the British was to secure their access to the Mediterranean Sea and thus the route to India, as well as access to the Iraqi oil fields. In the early 20th century, oil replaced coal as the most important resource since it was a lighter raw material.That led to an increasing dependence on oil, which was inaccessible on British soil. The French were interested in securing access to the Mediterranean through the port of Tyre, Lebanon, as well as getting their longstanding claims to Mount Lebanon and Damascus validated. === Russian and Italian agreement === For the Sykes-Picot Agreement to pass, Britain and France needed to satisfy the Russians. In exchange for his approval of the treaty, Russian Foreign Minister Sergey Sazonov and French Ambassador Maurice Paléologue concluded the Saznov- Paléologue Agreement in May 1916. Both agreed that the Russian Empire would get Western Armenia, in addition to the earlier-attributed Constantinople and Turkish Straits.Mikaberidze, Alexander (2011). Conflict and Conquest in the Islamic World: A Historical Encyclopedia [2 volumes]: A Historical Encyclopedia. ABC-CLIO. p. 861 ISBN 978-1-59884-337-8 Italy also knew about the agreement and was convinced by being promised southern Anatolia in the St- Jean-de-Maurienne Agreement in 1917. The Saznov-Paléologue Agreement, the St- Jean-de-Maurienne Agreement, the Balfour Declaration (between the British and the Zionists) and the Sykes-Picot Agreement (with a handful of others concerning the expected partition of the Ottoman Empire) are often referred to as the \"Secret Treaties\".Bowman, Isaiah (1922). \"A Note on the Political Map of Turkey,\" Foreign Affairs 1, no. 2 (December 15, 1922): p. 159 === Hussein- McMahon correspondence === Prior to starting negotiations with the French, the British had already discussed the future of Greater Syria with Sharif Hussein, the Emir of Mecca, in 1915. In what is known as the Hussein-McMahon Correspondence, the British diplomat Sir Henry McMahon promised the Arabs an independent state in Greater Syria. In return, Hussein would incite the Arab Revolt against the Ottoman Empire. == Regional division == Geographically, the agreement primarily focused on the provinces outside of the Arabian Peninsula. A line separated a zone A (under indirect French rule) from a zone B (under indirect British rule). Zone A included the major inland cities of Syria, as well as the Iraqi city of Mosul. Zone B stretched from Iraq to the Sinai borders of Egypt. A blue zone along the eastern Mediterranean coastline and parts of what is now Turkey was supposed to be placed under direct French rule. The United Kingdom was supposed to have direct control over the Iraqi provinces of Basra and Baghdad (the red zone), as well as parts of what is now Israel, to ensure British access to the Mediterranean. Palestine was supposed to be placed under international administration.Rogan p102Tell, Tariq: Sykes- Picot Agreement , in: 1914-1918-online. International Encyclopedia of the First World War, ed. by Ute Daniel, Peter Gatrell, Oliver Janz, Heather Jones, Jennifer Keene, Alan Kramer, and Bill Nasson, issued by Freie Universität Berlin, Berlin 2017-02-27. DOI: 10.15463/ie1418.11062. (p.2-3) The Arab state that McMahon had promised to Hussein was now supposed to be under indirect British and French control. That has led historians to call the Sykes-Picot Agreement \"a startling piece of double-dealing\" by the British and an \"outrageous example of imperial perfidy\". == Conflicting promises and consequences == After the October Revolution of 1917, the Bolsheviks, who now ruled Russia, released a series of secret documents. Among thosethat were published was the Sykes–Picot Agreement. The publication made visible the conflicting promises that the British had made concerning Ottoman territory to the French, Hussein and other Arabs, and the Zionists (in the Balfour Declaration). === Postwar Sykes-Picot Line === The agreement is often accused of having \"drawn lines in the sand\", artificially dividing the Middle East without regard to ethnic or cultural factors. In fact, the agreement was never fully implemented. It was at the San Remo Conference (1920) and theTreaty of Lausanne (1923) that the lines were definitely drawn. They decided who was going to govern (directly and indirectly) which parts of the partitioned Ottoman Empire, and Turkey wanted to rule areas that the French had initially hoped to govern.Tell, Tariq: Sykes-Picot Agreement , in: 1914-1918-online. International Encyclopedia of the First World War, ed. by Ute Daniel, Peter Gatrell, Oliver Janz, Heather Jones, Jennifer Keene, Alan Kramer, and Bill Nasson, issued by Freie Universität Berlin, Berlin 2017-02-27. DOI: 10.15463/ie1418.11062. (p.1) Although the agreement was not implemented in its original form, the British and French indeed secured strategically-important lands. The Arabs, on the other hand, did not see the promised establishment of an independent Arab kingdom and so felt betrayed. === Modern politics === The year 2016 marked the 100th anniversary of the Sykes–Picot Agreement, which was heavily debated given its frequent mention by ISIS, which released a video, \"The End of Sykes-Picot\", in 2014.Bâli, Aslı (2016). Sykes-Picot and 'Artificial' states. AJIL Unbound 110 : 115–19. https://www.jstor.org/stable/27003191. ISIS claimed that to create a unified Islamic state, it intended to reverse the effects of the Sykes–Picot Agreement.\"Watch this English-speaking ISIS fighter explain how a 98-year-old colonial map created today's conflict\". Daily News. 2014-07-02. Retrieved 2022-05-04. == Related pages == * Balfour Declaration 1917 * Treaty of Lausanne, July 1923 ==References== Category:1916 in France Category:1910s in the United Kingdom Category:1910s treaties Category:1910s in the Ottoman Empire Category:World War I Category:Imperialism Category:Treaties of France Category:Treaties of the United Kingdom",
 "title": "Sykes–Picot Agreement"
}