{
 "id": "64980",
 "text": "Halle Maria Berry (born August 14, 1966) is an American actress. Berry has received Emmy and Golden Globe awards, and was awarded the Academy Award in 2002 for her role in Monster's Ball. She is the first and still only African American woman to have won the Academy Award for Best Actress. Berry was ranked No. 1 on People's \"50 Most Beautiful People in the World\" list in 2003. In March 2014, she launched her own TV production company, 606 Films. ==Filmography== Year Title Role Notes 1991 Jungle Fever Vivian 1991 Strictly Business Natalie 1991 Cory 1992 Boomerang Angela Lewis 1993 Father Hood Kathleen Mercer 1993 The Program Autumn Haley 1994 Sharon Stone 1995 Losing Isaiah Khaila Richards 1996 Executive Decision Jean 1996 Girl 6 Herself 1996 Race the Sun Miss Sandra Beecher 1996 Josie Potenza 1997 B*A*P*S Nisi 1998 Bulworth Nina 1998 Why Do Fools Fall in Love Zola Taylor 2000 X-Men Ororo Munroe / Storm 2001 Swordfish Ginger Knowles 2001 Monster's Ball Leticia Musgrove 2002 Die Another Day Giacinta \"Jinx\" Johnson 2003 X2 Ororo Munroe / Storm 2003 Gothika Miranda Grey 2004 Catwoman Patience Phillips / Catwoman 2005 Robots: The Movie Cappy Smith Garcia Lopez Voice role 2006 X-Men: The Last Stand Ororo Munroe / Storm 2007 Perfect Stranger Rowena Price 2007 Things We Lost in the Fire Audrey Burke 2010 Frankie & Alice Frankie / Alice 2011 New Year's Eve Nurse Aimee 2012 Dark Tide Kate Mathieson 2012 Cloud Atlas Jocasta Ayrs / Luisa Rey / Ovid / Meronym / Native Woman / Indian Party Guest 2013 Movie 43 Emily Segment: \"Truth or Dare\" 2013 The Call Jordan Turner 2014 X-Men: Days of Future Past Ororo Munroe / Storm 2016 Kevin Hart: What Now? Herself 2017 Kidnap Karla Dyson Also producer 2017 Kingsman: The Golden Circle Ginger Ale 2017 Kings Millie Dunbar 2019 John Wick: Chapter 3 – Parabellum Sofia al-Azwar == Awards == Academy Awards * Best Actress - 2001 (Monster's Ball) Golden Globe Award * Best Actress - Mini-series - 2000 (Introducing Dorothy Dandridge) Emmy Award * Outstanding Lead Actress - Miniseries/Movie - 2000 (Introducing Dorothy Dandridge) Golden Raspberry Awards * Worst Actress - 2004 (Catwoman) Screen Actors Guild Award * Best Actress - Mini-series/TV Movie - 1999 (Introducing Dorothy Dandridge) * Best Actress - 2001 (Monster's Ball) ==References== == Other websites == * Official website * * * * Category:1966 births Category:Living people Category:Actors from Ohio Category:Actresses who played Bond girls Category:Best Actress Academy Award winners Category:African-American movie actors Category:African- American television actors Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners",
 "title": "Halle Berry"
}