{
 "id": "64986",
 "text": "Marion Robert Morrison (May 26, 1907 – June 11, 1979), known professionally as John Wayne, was an American actor. == Early life == Born with the name Marion Robert Morrison in Winterset, Iowa. Wayne was Scotch Irish on his father and Irish on his mother's side. During Wayne's childhood, he moved to Palmdale, California then to Glendale, California. While attending Wayne started working in small local movie companies. And also started playing football in high school and participated in the Glendale school team before being recruited by the University of Southern California (USC). == Career == Wayne began his movie career in the 1920s. In 1928, he played an extra in John Ford's Four Sons. In 1930, he had his first leading role in The Big Trail. Wayne was nominated for an Academy Award for Sands of Iwo Jima. One of his most important roles was that of Ethan Edwards a desperate man looking for his niece kidnapped by Comanche in the 1956 western movie The Searchers, directed by John Ford. The Alamo was nominated for several Academy Awards. It won the award for Best Sound. Wayne received an Academy Award and Golden Globe Award for his role in True Grit. His last role was in The Shootist. In 1999, the American Film Institute named Wayne thirteenth among the Greatest Male Stars of All Time. A Harris Poll released in 2007 placed Wayne third among America's favourite movie stars, the only star on the list who has died and the only one who has appeared on the poll every year. == Cancer and Death == Wayne had lung cancer in the 1960s. He had a lung removed and recovered. He died of stomach cancer. ==Filmography== ;Key to studio abbreviations 20th 20th Century-Fox AFI American Film Institute AK Alaska Pictures Arg Argosy Pictures Arm Armada Productions Batjac Batjac Col Columbia CVW C.V. Whitney DDL Dino De Laurentiis Fen Fenady Associates FN First National Fox Fox Films L-G Levy-Gardner Mas Mascot MGM Metro-Goldwyn-Mayer Mono Monogram (\"Lone Star\") Mop Monterey Productions NG National General Par Paramount Rep Republic RKO RKO Radio Rom Romina Productions SB Samuel Bronston Sho Showman's Pictures Sig Sigma Tif Tiffany Pictures UA United Artists Uni Universal WB Warner Bros. W-F Wayne- Fellows Productions Year Title Role Director Studio Notes Refs. 1926 Brown of Harvard Yale Football Player Jack Conway MGM Wayne was an unbilled football player in game sequences of this sports drama, with William Haines, Mary Brian, and Jack Pickford. Landesman, pp. 53–55. 1926 Bardelys the Magnificent Guard King Vidor MGM Wayne unbilled in this swashbuckler with John Gilbert and Eleanor Boardman. Landesman, pp. 29–31. 1926 The Great K & A Train Robbery Extra Lewis Seiler Fox A Tom Mix Western. Wayne unbilled. Landesman, pp. 124–126. 1927 Annie Laurie Extra John S. Robertson MGM With Lillian Gish and Norman Kerry. Wayne unbilled. Landesman, pp. 19–21. 1927 The Drop Kick Glitter Extra Millard Webb FN A football drama with Richard Barthelmess. Wayne once again unbilled as a football player in game footage. Landesman, pp. 96–98. 1928 Mother Machree Extra John Ford Fox An Irish drama with Victor McLaglen. Wayne unbilled in his first film with Ford. Sources disagree whether Wayne actually appeared on film, as he was a prop man. Landesman, pp. 230–232. 1928 Four Sons Extra John Ford Fox An Irish drama with Victor McLaglen. Wayne unbilled. Sources disagree whether Wayne actually appeared on film in this picture, as well. Landesman, pp. 121–122. 1928 Hangman's House Horse Race Spectator / Condemned Man John Ford Fox An Irish drama with Victor McLaglen. Wayne unbilled but noticeable as a spectator in a horse racing scene. Landesman, pp. 131–133. 1928 Noah's Ark Flood extra Michael Curtiz WB A Biblical drama with Dolores Costello, George O'Brien, Noah Beery, and Myrna Loy. Wayne and Andy Devine unbilled as extras in the flood sequence. Landesman, pp. 240–242. 1929 Speakeasy Extra Benjamin Stoloff Fox A sports drama with Lola Lane and Paul Page. Wayne unbilled. Landesman, pp. 336–337. 1929 The Black Watch Extra John Ford Fox Drama of the British army in India during the First World War, with Victor McLaglen and Myrna Loy. Wayne and Randolph Scott unbilled. Landesman, pp. 40–41. 1929 Words and Music Pete Donahue James Tinling Fox Wayne billed under his real name, Duke Morrison. An early talkie musical. Now apparently a lost film. Landesman, pp. 412–413. 1929 Salute Bill, Midshipman John Ford Fox A football drama with George O'Brien and Helen Chandler. Wayne and Ward Bond unbilled. Landesman, pp. 301–303. 1929 The Forward Pass Extra Eddie Cline Fox A football drama with Douglas Fairbanks, Jr. and Loretta Young. Wayne unbilled. A lost film. Landesman, pp. 119–121. 1930 Men Without Women Radioman on surface John Ford Fox A submarine drama. Wayne unbilled. Landesman, pp. 228–230. 1930 Born Reckless Soldier John Ford Andrew Bennison Fox A crime melodrama with Edmund Lowe, Lee Tracy, and Marguerite Churchill. Wayne, Randolph Scott, and Ward Bond unbilled. Landesman, pp. 46–47. 1930 Rough Romance Lumberjack A.F. Erickson Fox A logging adventure with George O'Brien and Antonio Moreno. Wayne unbilled. Landesman, pp. 298–299. 1930 Cheer Up and Smile Bit role Sidney Lansfield Fox A musical with Arthur Lake, Dixie Lee, Olga Baclanova, and \"Whispering\" Jack Smith. Wayne and J. Carrol Naish unbilled. Landesman, pp. 63–64. 1930 The Big Trail Breck Coleman Raoul Walsh Fox With Tyrone Power, Sr., Ian Keith, Ward Bond. An epic Western shot simultaneously in standard 35 mm and 70 mm \"Grandeur\" wide-screen. Wayne's first starring role. Landesman, pp. 37–40.Fagen, pp. 40–41. 1931 Girls Demand Excitement Peter Brooks Seymour Felix Fox A college romantic comedy. Landesman, pp. 123–124. 1931 Three Girls Lost Gordon Wales Sidney Lansfield Fox Landesman, pp. 366–367. 1931 Arizona The Virtuous Wife Lt. Bob Denton George B. Seitz Col Based on the play by Augustus Thomas. Previously filmed in 1919 with Douglas Fairbanks in the Wayne role. Landesman, pp. 226–228. 1931 The Deceiver Reginald Thorpe's corpse Louis King Col Wayne's most ignominious part. He played the corpse of the character played (alive) by Ian Keith. Landesman, pp. 90–92. 1931 Range Feud Clint Turner D. Ross Letterman Col A B-Western starring Buck Jones. Wayne in a supporting role. Landesman, pp. 266–268.Fagen, p. 336. 1931 Maker of Men Dusty Rhodes Edward Sedgwick Col A football drama with Jack Holt and Richard Cromwell. Wayne in a supporting role. Landesman, pp. 209–211. 1932 The Voice of Hollywood: No. 13 Himself Mark D'Agostino Tif A short subject. Landesman, p. 393. 1932 Running Hollywood Himself Charles Lamont Uni A two-reel short. 1932 The Shadow of the Eagle Craig McCoy Ford Beebe Mas A 12-chapter serial. Landesman, pp. 321–323. 1932 Texas Cyclone Steve Pickett D. Ross Lederman Col A B-Western starring Tim McCoy. Wayne in a supporting part. Landesman, pp. 354–355. 1932 Two-Fisted Law Duke D. Ross Lederman Col Another B-Western starring Tim McCoy. Wayne in a supporting part. Landesman, pp. 384–385.Fagen, p. 451. 1932 Lady and Gent Buzz Kinney Stephen Roberts Par A boxing drama with George Bancroft and Wynne Gibson. Wayne in a supporting role. Remade as Unmarried (1939) with Buster Crabbe in Wayne's role. Landesman, pp. 178–180. 1932 The Hurricane Express Larry Baker Armand Schaefer J.P. McGowan Mas A 12-chapter serial. Landesman, pp. 154–156. 1932 The Hollywood Handicap Himself Charles Lamont Uni A two-reel short. Landesman, pp. 145–146. 1932 Ride Him, Cowboy The Hawk John Drury Fred Allen WB Wayne's first starring role in a B-Western, the first of six that he would make for Warner Bros. Remake of The Unknown Cavalier (1926) with Ken Maynard. Landesman, pp. 281–283.Fagen, p. 350. 1932 That's My Boy Football Player Roy William Neill Col With Richard Cromwell and Dorothy Jordan. Another football drama with Wayne in a supporting role. Landesman, pp. 358–359. 1932 The Big Stampede John Steele Tenny Wright WB Remake of Land Beyond the Law (1927) with Ken Maynard. Remade under original title in 1936 with Dick Foran. Landesman, pp. 35–37.Fagen, p. 40. 1932 Haunted Gold John Mason Mack V. Wright WB Remake of The Phantom City (1928) with Ken Maynard. Landesman, pp. 137–138.Fagen, p. 203. 1933 The Telegraph Trail John Trent Tenny Wright WB Wayne's first film with Yakima Canutt. A clip of this film was used in Footlight Parade (1933). Semi-remake of The Red Raiders (1927) with Ken Maynard. Landesman, pp. 352–353.Fagen, p. 422. 1933 The Three Musketeers Tom Wayne Armand Schaefer Colbert Clark Mas With Creighton Chaney. A 12-chapter serial set in the Arabian desert. Very loosely adapted from the Dumas novel. Later re-edited into a 1946 feature entitled Desert Command. Landesman, pp. 370–372. 1933 Central Airport Co-pilot in wreck William Wellman WB An aviation drama with Richard Barthelmess, Sally Eilers, and Tom Brown. Wayne in an unbilled bit, and his first on-screen death. Landesman, pp. 61–63. 1933 Somewhere in Sonora John Bishop Mack V. Wright WB Remake of the 1927 film of the same title with Ken Maynard. Landesman, pp. 332–333.Fagen, p. 400. 1933 His Private Secretary Dick Wallace Philip H. Whitman WB Romantic comedy made by the independent company Showman's Pictures. Landesman, pp. 143–145. 1933 The Life of Jimmy Dolan The Kid's Last Fight Smith Archie Mayo WB Boxing melodrama with Douglas Fairbanks, Jr. and Loretta Young. Wayne in small supporting role as a frightened boxer. Remade as They Made Me a Criminal (1939) with John Garfield, and Louis Jean Heydt in Wayne's role. Landesman, pp. 196–198. 1933 Baby Face Jimmy McCoy Alfred E. Green WB Wayne in a supporting part. This was the only time he appeared in a film with Stanwyck. Landesman, pp. 21–23. 1933 The Man from Monterey Capt. John Holmes Mack V. Wright WB Wayne's last B-Western for Warner Bros. Landesman, pp. 214–215.Fagen, p. 271. 1933 Riders of Destiny Sandy Saunders (\"Singing Sandy\") R.N. Bradbury Mono Wayne's first B-Western for Monogram, released as a \"Lone Star Western\", and the only one to present him as a singing cowboy (with a dubbed singing voice). Also his first teaming with George \"Gabby\" Hayes. Landesman, pp. 284–286.Fagen, p. 352. 1933 The Sweetheart of Sigma Chi Bit part Edwin L. Marin WB A college romantic comedy with Mary Carlisle, Buster Crabbe, Charles Starrett, and Betty Grable. Wayne wore a moustache in his bit part, which was cut from the final print. Landesman, pp. 347–348. 1933 College Coach Football Coach Student William Wellman WB Wayne's last bit part. Aside from cameos, he would play the lead – or one of the leads – in all of his subsequent pictures. Landesman, pp. 70–72. 1933 Sagebrush Trail An Innocent Ian John Brant Armand Schaefer Mono With Yakima Canutt. Landesman, pp. 300–301.Fagen, p. 374. 1934 The Lucky Texan Jerry Mason R.N. Bradbury Mono With George Hayes, Yakima Canutt, Earl Dwire. Landesman, pp. 207–209.Fagen, p. 264. 1934 West of the Divide Ted Hayden R.N. Bradbury Mono With George Hayes, Yakima Canutt, Lafe McKee, Earl Dwire. Landesman, pp. 399–400.Fagen, p. 481. 1934 Blue Steel John Carruthers R.N. Bradbury Mono With George Hayes, Yakima Canutt, Lafe McKee, Earl Dwire. Filmed on location in Lone Pine, California. Landesman, pp. 44–46.Fagen, p. 49. 1934 The Man from Utah John Westen R.N. Bradbury Mono With George Hayes, Yakima Canutt, Lafe McKee. Landesman, pp. 215–216.Fagen, p. 272. 1934 Randy Rides Alone Randy Bowers Harry L. Fraser Mono With George Hayes, Yakima Canutt, Earl Dwire. Rare villain role for Hayes. Landesman, pp. 264–265.Fagen, p. 335. 1934 The Star Packer John Travers R.N. Bradbury Mono With George Hayes, Yakima Canutt, Earl Dwire. Landesman, pp. 344–345.Fagen, p. 411. 1934 The Trail Beyond Rod Drew R.N. Bradbury Mono With Noah Beery, Sr., Noah Beery, Jr., Earl Dwire. Based on the novel The Wolf Hunters by James Oliver Curwood. Also filmed under the novel's title in 1926 and 1949. Landesman, pp. 375–377.Fagen, p. 442. 1934 The Lawless Frontier John Tobin R.N. Bradbury Mono With George Hayes, Yakima Canutt, Earl Dwire. Landesman, pp. 188–190.Fagen, p. 249. 1934 'Neath the Arizona Skies Chris Morrell Harry Fraser Mono With Shirley Jean Rickert, George Hayes, Yakima Canutt, Earl Dwire. Landesman, pp. 232–233.Fagen, p. 291. 1935 Texas Terror John Higgins R.N. Bradbury Mono With George Hayes. Landesman, pp. 356–357.Fagen, p. 428. 1935 Rainbow Valley John Martin R.N. Bradbury Mono With George Hayes. Landesman, pp. 262–264.Fagen, p. 334. 1935 The Desert Trail John Scott Cullen Lewis Mono With Paul Fix. Landesman, pp. 92–93.Fagen, p. 128. 1935 The Dawn Rider John Mason R.N. Bradbury Mono With Yakima Canutt. Landesman, pp. 89–90.Fagen, p. 121. 1935 Paradise Canyon John Wyatt Carl Pierson Mono With Earle Hodgins and Yakima Canutt. Wayne's last \"Lone Star\" Western for Monogram. Landesman, pp. 254–256.Fagen, p. 314. 1935 Westward Ho John Wyatt R.N. Bradbury Rep With Yakima Canutt. Shot on location in Lone Pine. Wayne's first film for Republic Pictures. Landesman, pp. 401–403.Fagen, p. 483. 1935 The New Frontier John Dawson Carl Pierson Rep Not to be confused with the 1939 film Wayne made entitled New Frontier (no \"the\"). Landesman, pp. 233–236. 1935 Lawless Range John Middleton R.N. Bradbury Rep With Yakima Canutt. Landesman, pp. 192–193.Fagen, p. 250. 1936 The Oregon Trail Capt. John Delmont Scott Pembroke Rep With Yakima Canutt. Shot on location in Lone Pine. A lost film. 40 stills were discovered in 2013. Landesman, pp. 248–250.Fagen, p. 302. 1936 The Lawless Nineties John Tipton Joseph Kane Rep Landesman, pp. 190–191. 1936 King of the Pecos John Clayborn Joseph Kane Rep With Yakima Canutt. Shot on location in Lone Pine. Landesman, pp. 176–177.Fagen, p. 236. 1936 The Lonely Trail Captain John Ashley Joseph Kane Rep With Yakima Canutt. A post-American Civil War yarn about carpetbaggers. Landesman, pp. 199–201.Fagen, p. 260. 1936 Winds of the Wasteland John Blair Mack V. Wright Rep Hulu sometimes presents a colorized version entitled Stagecoach Run. Landesman, pp. 403–405.Fagen, p. 493. 1936 Sea Spoilers Bob Randall Frank Strayer Uni The first of six non-Westerns that Wayne did for Universal. Landesman, pp. 310–313. 1936 Conflict Pat Glendon David Howard Uni Based on the novel The Abysmal Brute by Jack London. Landesman, pp. 75–77. 1937 California Straight Ahead! Biff Smith Arthur Lubin Uni Wayne as a school bus driver who becomes a trucking industry leader. Landesman, pp. 57–59. 1937 I Cover the War Bob Adams Arthur Lubin Uni Shot on location in Lone Pine. Landesman, pp. 157–159. 1937 Idol of the Crowds Johnny Hanson Arthur Lubin Uni Sports drama with Wayne as a professional ice hockey player. Landesman, pp. 161–162. 1937 Adventure's End Duke Slade Arthur Lubin Uni The last of Wayne's non-Western \"B\" pictures for Universal. Landesman, pp. 7–9. 1937 Born to the West Hell Town Dare Rudd Charles Barton Par With Johnny Mack Brown. Based on the novel of the same name by Zane Grey. Previously filmed in 1926 with Jack Holt in the Wayne role. Landesman, pp. 48–50.Fagen, pp. 55–56. 1938 Pals of the Saddle Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin). The first of eight films Wayne did in Republic's \"Three Mesquiteers\" series. Landesman, pp. 252–254.Fagen, p. 313. 1938 Overland Stage Raiders Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin). Louise Brooks' final film appearance. Landesman, pp. 250–251. 1938 Santa Fe Stampede Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin). Landesman, pp. 306–308. 1938 Red River Range Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin). Landesman, pp. 276–278. 1939 Stagecoach Henry (\"The Ringo Kid\") John Ford UA With John Carradine, Andy Devine, George Bancroft, Louise Platt, Tim Holt, Tom Tyler. Filmed on location in Monument Valley. This is the film that boosted Wayne into major stardom. Landesman, pp. 340–344.Fagen, pp. 407–408. 1939 The Night Riders Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin), Tom Tyler. The story of this film was loosely based on the incidents in the life of James Reavis. Landesman, pp. 238–240. 1939 Three Texas Steers Danger Rides the Range Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Max Terhune (Lullaby Joslin). Landesman, pp. 373–375.Fagen, p. 434. 1939 Wyoming Outlaw Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Raymond Hatton (Rusty Joslin). Landesman, pp. 413–415. 1939 New Frontier Frontier Horizon Stoney Brooke George Sherman Rep With Ray Corrigan (Tucson Smith) and Raymond Hatton (Rusty Joslin). Film debut of Phyllis Isley, later known as Jennifer Jones. Wayne's last film in the \"Three Mesquiteers\" series and his last B-Western. Landesman, pp. 236–238. 1939 Allegheny Uprising The First Rebel Jim Smith William A. Seiter RKO Wayne has second billing under Trevor. Landesman, pp. 13–15.Fagen, p. 8. 1940 Dark Command Bob Seton Raoul Walsh Rep With Claire Trevor, Walter Pidgeon, Roy Rogers, and George Hayes. A fictionalized account of the infamous William Quantrill. Landesman, pp. 86–88.Fagen, pp. 119–120. 1940 Screen Snapshots Series 19, No. 8: Cowboy Jubilee Himself Ralph Staub Rep A one-reel short also featuring Gene Autry and Roy Rogers. 1940 Three Faces West John Phillips Bernard Vorhaus Rep With Charles Coburn. Landesman, pp. 363–365. 1940 The Long Voyage Home Ole Olson John Ford UA With Thomas Mitchell, Barry Fitzgerald, Ward Bond. Based on four one-act plays by Eugene O'Neill. Landesman, pp. 202–205. 1940 Seven Sinners Cafe of the Seven Sinners Lt. Dan Brent Tay Garnett Uni Wayne's first of three teamings with Dietrich. Landesman, pp. 318–321. 1941 A Man Betrayed Citadel of Crime Wheel of Fortune Lynn Hollister John H. Auer Rep With Ward Bond Landesman, pp. 212–214. 1941 Lady from Louisiana John Reynolds Bernard Vorhaus Rep With Ray Middleton, Henry Stephenson. Landesman, pp. 183–185. 1941 The Shepherd of the Hills Matt Matthews Henry Hathaway Par With Harry Carey. Wayne's first film in color (Technicolor). Landesman, pp. 326–328.Fagen, p. 387. 1941 Meet the Stars: Past and Present Himself Harriet Parsons Rep A promotional short. 1942 Lady for a Night Jack Morgan Leigh Jason Rep Wayne is billed second. Landesman, pp. 180–183. 1942 Reap the Wild Wind Capt. Jack Stuart Cecil B. DeMille Par With Ray Milland, Raymond Massey, Robert Preston, Susan Hayward. Filmed in Technicolor. Wayne is billed second in this seafaring epic. His only film with DeMille. Landesman, pp. 268–272. 1942 The Spoilers Roy Glennister Ray Enright Uni With Randolph Scott, Harry Carey, Richard Barthelmess. Sprawling version of the Rex Beach novel, climaxing with an epic saloon fight between Wayne and Scott (in a rare villainous role). Wayne is billed third. Landesman, pp. 338–340.Fagen, p. 404. 1942 In Old California Tom Craig William McGann Rep Wayne plays a pharmacist in this film, which was the occupation of his real-life father. Landesman, pp. 165–168.Fagen, p. 224. 1942 Flying Tigers Jim Gordon David Miller Rep Wayne's first war movie. Landesman, pp. 113–116. 1942 Reunion in France Mademoiselle France Pat Talbot Jules Dassin MGM With Philip Dorn. Landesman, pp. 278–281. 1942 Pittsburgh Charles \"Pittsburgh\" Markham Lewis Seiler Uni With Randolph Scott, Shemp Howard. An unrelated follow-up to The Spoilers with the same three leads. Wayne is billed third. Landesman, pp. 256–259. 1943 A Lady Takes a Chance Duke Hudkins William A. Seiter RKO Wayne billed second. Produced by Frank Ross, Jean Arthur's husband). Landesman, pp. 185–188.Fagen, p. 238. 1943 In Old Oklahoma War of the Wildcats Dan Somers Al Rogell Rep With Albert Dekker, George Hayes, Dale Evans. Landesman, pp. 168–171.Fagen, p. 225. 1944 The Fighting Seabees Wedge Donovan Edward Ludwig Rep Another war movie, this one dealing with the U.S. Navy's famed construction battalion. Landesman, pp. 104–107. 1944 Tall in the Saddle Rocklin Edwin L. Marin RKO With Ward Bond, George Hayes Landesman, pp. 348–351.Fagen, p. 420. 1944 Flame of Barbary Coast Duke Fergus Joseph Kane Rep With Joseph Schildkraut, William Frawley. Landesman, pp. 107–110.Fagen, p. 160. 1945 Back to Bataan Col. Joseph Madden Edward Dmytryk RKO With Anthony Quinn, Beulah Bondi. Landesman, pp. 23–26. 1945 They Were Expendable Lt. Rusty Ryan John Ford MGM With Robert Montgomery, Jack Holt, Ward Bond. Wayne gets second billing to Montgomery in this film about naval PT boats. Landesman, pp. 359–363. 1945 Dakota John Devlin Joseph Kane Rep With Walter Brennan, Ward Bond. Landesman, pp. 82–85.Fagen, p. 115. 1946 Without Reservations Rusty Thomas Mervyn LeRoy RKO With Don DeFore. Wayne has second billing under Colbert. From this point on Wayne would always have top billing (except for appearances in \"all-star\" films or guest appearances). Landesman, pp. 409–411. 1947 Angel and the Badman Quirt Evans James Edward Grant Rep With Bruce Cabot, Harry Carey. Wayne's first film as producer as well as star. Landesman, pp. 16–19.Fagen, pp. 11–12. 1947 Tycoon Johnny Munroe Richard Wallace RKO With Sir Cedric Hardwicke, Anthony Quinn, Judith Anderson, James Gleason. Location shooting at Lone Pine. Filmed in Technicolor. Landesman, pp. 387–389. 1948 Red River Thomas Dunson Howard Hawks Mop UA With Montgomery Clift, Walter Brennan, John Ireland, Harry Carey, Harry Carey, Jr., Noah Beery, Jr., Hank Worden. Generally regarded as one of Wayne's finest films and finest performances. His first film with director Hawks. Landesman, pp. 272–276.Fagen, p. 341. 1948 Fort Apache Capt. Kirby York John Ford Arg RKO With Henry Fonda, John Agar, Victor McLaglen, Ward Bond, George O'Brien. The first of Ford's \"cavalry trilogy.\" Filmed on location in Monument Valley. Landesman, pp. 116–119.Fagen, pp. 164–166. 1948 3 Godfathers Robert Marmaduke Hightower John Ford Arg MGM Filmed in Technicolor on location in Death Valley, California. Landesman, pp. 367–370.Fagen, pp. 431–432. 1948 Wake of the Red Witch Capt. Ralls Edward Ludwig Rep With Gig Young, Adele Mara, Luther Adler. Landesman, pp. 393–396. 1949 The Fighting Kentuckian John Breen George Waggner Rep With Philip Dorn, Oliver Hardy, Marie Windsor. Wayne produced this film. Landesman, pp. 101–104.Fagen, p. 155. 1949 She Wore a Yellow Ribbon Capt. Nathan Brittles John Ford Arg RKO With John Agar, Victor McLaglen, Harry Carey, Jr., Mildred Natwick, George O'Brien. The second film in Ford's \"cavalry trilogy.\" Filmed in Technicolor on location in Monument Valley. Landesman, pp. 323–326.Fagen, p. 388. 1949 Screen Snapshots: Hollywood Rodeo Himself Ralph Staub Col A documentary short. 1949 Sands of Iwo Jima Sgt. John M. Stryker Allan Dwan Rep With John Agar, Forrest Tucker. Wayne received his first Academy Award nomination for this film. Landesman, pp. 303–306. 1950 Rio Grande Lt. Col. Kirby Yorke John Ford Arg Rep With Ben Johnson, Claude Jarman, Jr., Harry Carey, Jr., and Victor McLaglen. The last of Ford's \"cavalry trilogy\" and Wayne's first of five teamings with O'Hara. Filmed on location in Monument Valley. Landesman, pp. 289–292.Fagen, pp. 360–361. 1951 Screen Snapshots: Reno's Silver Spur Awards Himself Ralph Staub Col A documentary short. 1951 Operation Pacific \"Duke\" Gifford George Waggner WB With Ward Bond. Landesman, pp. 246–248. 1951 The Screen Director Himself WB A promotional short featuring a scene on the set of Operation Pacific with John Ford directing Wayne. (Actually, George Waggner was the director of that film, so this scene was obviously staged.) 1951 Screen Snapshots: Hollywood Awards Himself Ralph Staub Col A documentary short. 1951 Flying Leathernecks Major Dan Kirby Nicholas Ray RKO With Robert Ryan. Produced by Howard Hughes. Landesman, pp. 110–113. 1952 Miracle in Motion Narrator Rep Wayne narrates this fund-raiser for the benefit of the United Cerebral Palsy Foundation. 1952 The Quiet Man Sean Thornton John Ford Arg Rep Filmed in Technicolor on location in Ireland. One of Wayne's most beloved films. His children Michael, Patrick, Melinda, and Antonia have small roles in the film. Landesman, pp. 259–262. 1952 Big Jim McLain Big Jim McLain Edward Ludwig W-F WB With James Arness, Alan Napier. An anti-communist action film. Produced by Wayne. Landesman, pp. 33–35. 1953 Trouble Along the Way Steve Aloysius Williams Michael Curtiz WB With Charles Coburn, Sherry Jackson. Landesman, pp. 379–380. 1953 Island in the Sky Capt. Dooley William A. Wellman W-F WB With Lloyd Nolan, Walter Abel, James Arness. Wayne also produced. Landesman, pp. 171–173. 1953 Hondo Hondo Lane John Farrow W-F WB With Ward Bond, Michael Pate, James Arness. Based on a story by Louis L'Amour. Filmed in 3D and WarnerColor. Wayne also produced. Landesman, pp. 146–148.Fagen, p. 214. 1954 The High and the Mighty Dan Roman William A. Wellman WB W-F Batjac Par With Robert Stack, Phil Harris, Robert Newton, Paul Kelly. Wayne also produced this aviation drama. A big hit in its day, filmed in CinemaScope and WarnerColor. This was Wayne's first wide-screen film since The Big Trail (1930). Landesman, pp. 140–143. 1955 The Sea Chase Capt. Karl Ehrlich John Farrow WB With David Farrar, Tab Hunter, James Arness. Filmed in CinemaScope and WarnerColor on location in Hawaii. Wayne took an unusual role as a World War II German naval officer. Landesman, pp. 308–310. 1955 Screen Snapshots: The Great Al Jolson Himself Ralph Staub Col A documentary short salute Jolson. Wayne is one of the celebrities shown in the film. 1955 Blood Alley Captain Tom Wilder William A. Wellman WB Filmed in CinemaScope and WarnerColor. Wayne produced this film and replaced Robert Mitchum after firing him. Landesman, pp. 41–44. 1956 The Conqueror Temüjin Dick Powell RKO With Pedro Armendáriz, Agnes Moorehead. Filmed in CinemaScope and Technicolor. Produced by Howard Hughes. Generally regarded as one of the worst movies ever made. Landesman, pp. 77–80. 1956 The Searchers Ethan Edwards John Ford CVW WB With Jeffrey Hunter, Ward Bond, Henry Brandon, Olive Carey, John Qualen, Hank Worden, Patrick Wayne, Harry Carey, Jr. . Filmed in VistaVision and Technicolor. Generally regarded as one of the greatest movies ever made. Landesman, pp. 313–317.Fagen, pp. 378–379. 1957 The Wings of Eagles Frank \"Spig\" Wead John Ford MGM With Dan Dailey, Ward Bond, Ken Curtis, Edmund Lowe. Filmed in Metrocolor. Landesman, pp. 406–408. 1957 Jet Pilot Colonel Jim Shannon Josef von Sternberg RKO Uni Filmed in Technicolor and released in RKO-Scope. Shot in 1949–50 but not released until 1957. Produced by Howard Hughes. Generally regarded as one of Wayne's worst films. Landesman, pp. 173–176. 1957 Legend of the Lost Joe January Henry Hathaway Batjac UA With Rossano Brazzi. Filmed in Technirama and Technicolor on location in the Libyan desert. Landesman, pp. 193–195. 1958 I Married a Woman Himself Hal Kanter RKO Uni Wayne has an unbilled cameo in this minor comedy starring George Gobel and Diana Dors. Filmed in RKO-Scope and black and white except for one of Wayne's two scenes, which was shot in Technicolor. Landesman, pp. 159–160. 1958 The Barbarian and the Geisha Townsend Harris John Huston 20th With Sam Jaffe. Inspired by a true story. Filmed in CinemaScope and Eastmancolor. Landesman, pp. 27–29. 1959 Rio Bravo John T. Chance Howard Hawks Arm WB With Dean Martin, Ricky Nelson, Walter Brennan, Ward Bond, John Russell, Claude Akins. Generally regarded as one of Wayne's best, provided the template and format for many of his later films. Landesman, pp. 286–289.Fagen, pp. 358–359. 1959 The Horse Soldiers Col. John Marlowe John Ford UA With William Holden, Hoot Gibson. Filmed in Deluxe color. Landesman, pp. 149–151.Fagen, pp. 218–219. 1960 The Alamo Col. David Crockett John Wayne Batjac UA With Richard Widmark, Laurence Harvey, Richard Boone, Chill Wills, Frankie Avalon, Patrick Wayne. Wayne fulfilled a long-time dream by producing, directing, and starring in this epic telling of the battle for Texas independence. Filmed in Todd-AO and Technicolor. Landesman, pp. 9–13.Fagen, p. 6. 1960 North to Alaska Sam McCord Henry Hathaway 20th With Stewart Granger, Ernie Kovacs, Fabian. Filmed in CinemaScope and Deluxe color. Landesman, pp. 242–246.Fagen, p. 293. 1961 The Challenge of Ideas Himself An anti-communist propaganda short. With Jack Webb, Helen Hayes, Chet Huntley. 1961 The Comancheros Jake Cutter Michael Curtiz 20th With Stuart Whitman, Lee Marvin, Bruce Cabot, Patrick Wayne. Filmed in CinemaScope and Deluxe color. The last film directed by Curtiz. Landesman, pp. 72–75.Fagen, p. 99. 1962 The Man Who Shot Liberty Valance Tom Doniphon John Ford Par With James Stewart, Lee Marvin, Woody Strode, Andy Devine. Landesman, pp. 217–220.Fagen, pp. 274–275. 1962 Hatari! Sean Mercer Howard Hawks Par With Red Buttons, Hardy Kruger, Bruce Cabot. Filmed in Technicolor on location in Tanganyika. Landesman, pp. 133–136. 1962 The Longest Day Lt.Col. Benjamin Vandervoort Ken Annakin Andrew Marton Bernard Wicki Darryl F. Zanuck Gerd Oswald 20th Wayne was part of an all-star cast in this epic retelling of the D-Day invasion of June 6, 1944. Filmed in black and white and CinemaScope. Landesman, pp. 205–207. 1962 How the West Was Won Gen. William Tecumseh Sherman John Ford Henry Hathaway George Marshall MGM An all-star epic. Wayne appeared in the American Civil War sequence directed by Ford. Also appearing in this sequence were George Peppard, Russ Tamblyn, and Harry Morgan (as Ulysses S. Grant). Filmed in Technicolor and Cinerama. Landesman, pp. 152–154.Fagen, p. 220. 1963 Donovan's Reef Michael Patrick Donovan John Ford Par With Lee Marvin, Jack Warden, Cesar Romero. Filmed in Technicolor on location in Kauai, Hawaii. Wayne's last film with director John Ford. Landesman, pp. 93–96. 1963 McLintock! George Washington McLintock Andrew V. McLaglen Batjac UA With Patrick Wayne, Stefanie Powers, Bruce Cabot, Yvonne de Carlo. A big favorite with Wayne fans. His first film with director McLaglen. Filmed in Panavision and Technicolor. Landesman, pp. 220–223.Fagen, p. 280. 1964 Circus World The Magnificent Showman Matt Masters Henry Hathaway SB UA With Lloyd Nolan, Richard Conte, John Smith. Filmed in 70 mm Super Technirama and Technicolor. Originally presented in Cinerama. Landesman, pp. 68–70. 1965 The Greatest Story Ever Told The Centurion (Longinus) George Stevens UA Director Stevens' large-scale telling of the life of Jesus Christ (played by Max von Sydow) with an all-star supporting cast. Wayne has a cameo as the Roman centurion who leads Christ to his crucifixion. Landesman, pp. 126–128. 1965 In Harm's Way Capt. Rockwell Torrey Otto Preminger Sig Par With Kirk Douglas, Tom Tryon, Paula Prentiss, Burgess Meredith, Brandon deWilde, Henry Fonda. Filmed in Panavision. Wayne's last film in black and white. Landesman, pp. 162–165. 1965 The Sons of Katie Elder John Elder Henry Hathaway Par With Dean Martin, Earl Holliman. Filmed in Panavision and Technicolor on location near Durango, Mexico. Landesman, pp. 333–336.Fagen, pp. 402–403. 1966 Cast a Giant Shadow Gen. Mike Randolph Melville Shavelson Batjac UA With Kirk Douglas, Senta Berger. Wayne, Yul Brynner, and Frank Sinatra did guest star appearances in the biopic of Col. David \"Mickey\" Marcus (Douglas). Filmed in Technicolor. Landesman, pp. 59–61. 1966 El Dorado Cole Thornton Howard Hawks Par With Robert Mitchum, James Caan, Arthur Hunnicutt, Edward Asner. Filmed in Technicolor on location in Arizona. Filmed before, but released after, The War Wagon. Landesman, pp. 98–101.Fagen, p. 142. 1967 A Nation Builds Under Fire Himself Harry Middleton A documentary short dealing with Vietnam. 1967 The War Wagon Taw Jackson Burt Kennedy Batjac Uni With Kirk Douglas, Howard Keel, Robert Walker, Jr., Bruce Cabot. Filmed in Panavision and Technicolor on location in Durango. Landesman, pp. 396–399.Fagen, p. 475. 1968 The Green Berets Col. Mike Kirby John Wayne Ray Kellogg Batjac WB With David Janssen, Jim Hutton, Aldo Ray, Bruce Cabot, George Takei. Wayne's controversial take on the Vietnam War. Filmed in Panavision and Technicolor on location at Fort Benning, Georgia. Co-directed by an uncredited Mervyn LeRoy, but credit given instead to Ray Kellogg. Landesman, pp. 129–313. 1968 Hellfighters Chance Buckman Andrew V. McLaglen Uni With Jim Hutton, Bruce Cabot, Jay C. Flippen. Wayne's character was based on real-life \"hellfighter\" Red Adair. Filmed in Panavision and Technicolor. Landesman, pp. 139–140. 1969 True Grit U.S. Marshal Reuben J. \"Rooster\" Cogburn Henry Hathaway Par With Glen Campbell, Jeremy Slate, Robert Duvall, Strother Martin, Jeff Corey. Wayne's Academy Award winning performance and his last film with Hathaway. Filmed in Technicolor. Landesman, pp. 381–385.Fagen, pp. 447–448. 1969 The Undefeated Col. John Henry Thomas Andrew V. McLaglen 20th With Rock Hudson, Roman Gabriel, Lee Meriwether. Filmed in Panavision and Deluxe color. Landesman, pp. 390–393.Fagen, p. 453. 1970 No Substitute for Victory Narrator Robert F. Slatzer AK A short in support of America's involvement in the Vietnam War. With General Mark Clark, Martha Raye, Sam Yorty, General William Westmoreland, and Lowell Thomas. 1970 Chisum John Chisum Andrew V. McLaglen Batjac WB With Forrest Tucker, Christopher George, Bruce Cabot, Patric Knowles, Geoffrey Deuel (as Billy the Kid), Glenn Corbett (as Pat Garrett). Filmed in Panavision and Technicolor. Landesman, pp. 65–68.Fagen, pp. 87–89. 1970 Rio Lobo Cord McNally Howard Hawks Par With Jorge Rivero, Jack Elam, Chris Mitchum, Sherry Lansing, George Plimpton. Wayne's last film with Hawks. Filmed in Technicolor. Landesman, pp. 292–295.Fagen, p. 361. 1971 Big Jake Jacob McCandles George Sherman Batjac Par With Richard Boone, Patrick Wayne, Chris Mitchum, Bruce Cabot. Filmed in Panavision and Technicolor. Landesman, pp. 31–33.Fagen, pp. 37–38. 1971 Directed by John Ford Himself Peter Bogdanovich AFI A documentary, narrated by Orson Welles. 1972 The Cowboys Wil Andersen Mark Rydell WB With Roscoe Lee Browne, Bruce Dern, Colleen Dewhurst. Filmed in Panavision 70 and Technicolor. Later a TV series. Landesman, pp. 80–82.Fagen, pp. 108–110. 1972 Cancel My Reservation Himself Paul Bogart WB Wayne, Bing Crosby, Johnny Carson, and Flip Wilson made brief, unbilled cameo appearances in this Bob Hope comedy. Filmed in Technicolor. 1973 The Train Robbers Lane Burt Kennedy Batjac WB With Rod Taylor, Ben Johnson, Christopher George, Ricardo Montalbán. Filmed in Panavision and Technicolor. Landesman, pp. 377–379.Fagen, p. 444. 1973 Cahill, United States Marshal Cahill J.D. Cahill Andrew V. McLaglen Batjac WB With George Kennedy, Gary Grimes, Neville Brand, Clay O'Brien. Filmed in Panavision and Technicolor. Landesman, pp. 55–56.Fagen, p. 70. 1974 McQ Det. Lt. Lon McQ John Sturges Batjac L-G WB With Eddie Albert, Clu Gulager. Filmed in Panavision and Technicolor. The first of Wayne's two cop films made in the wake of Clint Eastwood's success with Dirty Harry (1971). Landesman, pp. 223–226. 1975 Brannigan Brannigan Douglas Hickox UA With Richard Attenborough, Mel Ferrer. Filmed in Panavision and Deluxe colour on location in London. Landesman, pp. 50–53. 1975 Rooster Cogburn Marshal Reuben J. \"Rooster\" Cogburn Stuart Millar Uni With Anthony Zerbe, Richard Jordan, John McIntire, Strother Martin. Filmed in Panavision and Technicolor on location in Oregon. Landesman, pp. 295–298.Fagen, p. 366. 1976 Chesty: Tribute to a Legend Himself John Ford A tribute documentary on the most decorated U.S. Marine, Gen. Lewis B. \"Chesty\" Puller. Completed in 1970, but not released until 1976, three years after Ford's death. 1976 The Shootist John Bernard Books Don Siegel DDL PA With Ron Howard, James Stewart, John Carradine, Hugh O'Brian, Harry Morgan, Richard Boone. Filmed in Technicolor. Landesman, pp. 328–332.Fagen, pp. 389–390. == References == == Notes == == Other websites == * http://rio- bravo.vip-blog.com * The Official Website of John Wayne * Official Licensee- John Wayne Six Guns-Red River D Classic Movie Gun * * * The Un-Official Website of John Wayne * The Birthplace of John Wayne Official Website * JWMB - DukeWayne.com - Largest Online Fan Community * Find A Grave Entry * John Wayne Cancer Foundation * John Wayne Cancer Institute * When Legend Becomes Fact: John Wayne and the American Identity * Wayne Enterprises , the sole and exclusive licensor of the John Wayne name, image, and likeness * Did John Wayne die of cancer caused by a radioactive movie set? (from The Straight Dope) * The Religious Affiliation of John Wayne * John Wayne Celebrity Soundboards * John Wayne Profile at USC Legends * John Wayne's Narration on America * An Interview with Fr. Matthew Munoz - the Grandson of Actor John Wayne by Tim Drake * Who shares his name * * John Wayne at TopTenREVIEWS * The Shelf: Top Ten John Wayne Westerns Category:American Academy Award winning actors Category:Actors from Iowa Category:American movie actors Category:American movie directors Category:American movie producers Category:American television actors Category:Cancer deaths in Los Angeles Category:Deaths from stomach cancer Category:Golden Globe Award winning actors Category:Actors from Glendale, California Category:Anti-communists Category:Stage names Category:1907 births Category:1979 deaths",
 "title": "John Wayne"
}