{
 "id": "650057",
 "text": "The 2019 FIFA Women's World Cup Final is a future football match to decide the winner of the 2019 FIFA Women's World Cup. It will be the eighth time the final is played for the FIFA Women's World Cup, a tournament for women's teams of the member countries of FIFA. The match will be played at the Parc Olympique Lyonnais in Décines-Charpieu, France, on 7 July 2019 between the United States, the champions last time, and the Netherlands, in their first final. The United States won 2–0, earning their second consecutive and fourth overall Women's World Cup title, with second-half goals scored by co-captain Megan Rapinoe from the penalty spot and Rose Lavelle. Both teams are the reigning winners of their confederation, with the United States having won the 2018 CONCACAF Women's Championship and the Netherlands having won UEFA Women's Euro 2017. ==Route to the final== United States Round Netherlands Opponents Result Group stage Opponents Result 13–0 Match 1 1–0 3–0 Match 2 3–1 2–0 Match 3 2–1 Group F winners Final standings Group E winners Opponents Result Knockout stage Opponents Result 2–1 Round of 16 2–1 2–1 Quarter-finals 2–0 2–1 Semi-finals 1–0 ==Match== ===Details=== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Alyssa Naeher RB 5 Kelley O'Hara CB 7 Abby Dahlkemper CB 4 Becky Sauerbrunn LB 19 Crystal Dunn CM 3 Sam Mewis CM 8 Julie Ertz CM 16 Rose Lavelle RF 17 Tobin Heath CF 13 Alex Morgan LF 15 Megan Rapinoe (c) Substitutions: Substitutions: Substitutions: DF 11 Ali Krieger FW 23 Christen Press FW 10 Carli Lloyd Manager: Manager: Manager: Jill Ellis Jill Ellis Jill Ellis Player of the Match: Megan Rapinoe (United States) Assistant referees: Manuela Nicolosi (France) Michelle O'Neill (Republic of Ireland) Fourth official: Claudia Umpiérrez (Uruguay) Reserve assistant referee: Luciana Mascaraña (Uruguay) Video assistant referee: Carlos del Cerro Grande (Spain) Assistant video assistant referees: José María Sánchez Martínez (Spain) Mariana de Almeida (Argentina) |} Match rules * 90 minutes. * 30 minutes of extra time if necessary. * Penalty shoot-out if scores still level. * Maximum of twelve named substitutes. * Maximum of three substitutions, with a fourth allowed in extra time. ==References== ==Other websites== * Final Category:July 2019 events Category:FIFA Women's World Cup finals",
 "title": "2019 FIFA Women's World Cup Final"
}