{
 "id": "650549",
 "text": "\"Wake Me Up\" is a song by Swedish DJ and record producer Avicii. It was released as the lead single from his debut studio album True. It was written by Avicii, Mike Einziger, and Aloe Blacc. American soul singer Aloe Blacc provides vocals for the track == Charts == === Weekly charts === Chart (2013) Peak position Bulgaria (IFPI) 1 Brazil (Billboard Brasil Hot 100) 1 Brazil Hot Pop Songs 1 Colombia (National-Report) 19 Greece Airplay (IFPI) 1 Greece Digital Songs (Billboard) 1 Lebanon (The Official Lebanese Top 20) 1 Luxembourg Digital Songs (Billboard) 1 Mexican Anglo Chart (Monitor Latino) 2 Portugal Digital Songs (Billboard) 1 Romania (Airplay 100) Note: User may scroll down the 'Podcasturi' menu to play or download the respective podcast. 1 Slovenia (SloTop50) 1 Venezuela Pop Rock General (Record Report) 1 Chart (2018) Peak position Chart (2020) Peak position Global Excl. US (Billboard) 193 === Year-end charts === Chart (2013) Position Australia (ARIA) 4 Austria (Ö3 Austria Top 40) 1 Belgium (Ultratop Flanders) 1 Belgium (Ultratop Wallonia) 8 Canada (Canadian Hot 100) 7 France (SNEP) 7 Germany (Official German Charts) 1 Hungary (Dance Top 40) 11 Hungary (Rádiós Top 40) 9 Israel (Media Forest) 2 Netherlands (Dutch Top 40) 2 Netherlands (Single Top 100) 1 New Zealand (Recorded Music NZ) 8 Russia Airplay (Tophit) 14 Slovenia (SloTop50) 1 Spain (PROMUSICAE) 5 Sweden (Sverigetopplistan) 1 Switzerland (Schweizer Hitparade) 1 Ukraine Airplay (Tophit) 27 UK Singles (Official Charts Company) 3 US Billboard Hot 100 19 US Adult Top 40 (Billboard) 35 US Dance Club Songs (Billboard) 6 US Hot Dance/Electronic Songs (Billboard) 3 US Mainstream Top 40 (Billboard) 17 Chart (2014) Position Belgium (Ultratop Flanders) 30 Belgium (Ultratop Wallonia) 37 Canada (Canadian Hot 100) 21 France (SNEP) 68 Germany (Official German Charts) 92 Hungary (Dance Top 40) 25 Hungary (Single Top 40) 31 Japan (Japan Hot 100) 80 Netherlands (Single Top 100) 44 Russia Airplay (Tophit) 24 Slovenia (SloTop50) 17 Sweden (Sverigetopplistan) 8 Switzerland (Schweizer Hitparade) 34 Ukraine Airplay (Tophit) 81 UK Singles (Official Charts Company) 70 US Billboard Hot 100 22 US Adult Contemporary (Billboard) 8 US Adult Top 40 (Billboard) 23 US Hot Dance/Electronic Songs (Billboard) 2 US Mainstream Top 40 (Billboard) 41 Chart (2015) Position France (SNEP) 178 Chart (2018) Position Hungary (Single Top 40) 69 Portugal Full Track Download (AFP) 187 Sweden (Sverigetopplistan) 15 US Hot Dance/Electronic Songs (Billboard) 49 Chart (2019) Position Portugal (AFP) 465 Sweden (Sverigetopplistan) 59 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 11 Germany (Official German Charts) 4 Netherlands (Dutch Top 40) 3 UK Singles (Official Charts Company) 13 US Billboard Hot 100 57 US Hot Dance/Electronic Songs (Billboard) 4 ===All-time charts=== Chart Position US Billboard Pop Songs (1992–2017) 12 Australia (ARIA) 32 UK Singles (Official Charts Company) 43 Dutch NPO Radio 2 Top 2000 100 US Billboard Hot 100 (1958–2018) 328 == References == Category:2013 songs Category:Avicii songs Category:Alicia Keys songs",
 "title": "Wake Me Up!"
}