{
 "id": "650556",
 "text": "This is a list of governors of Missouri since its territory became part of the United States. Thirty-eight of the governors have been Democratic. Fifteen have been Republican. One has been Liberal Republican. ==Governors of Missouri== ; Parties Governors of the State of Missouri Governor Term in office Party Election Lt. Governor 1 Alexander McNair Journal of the House, 1st General Assembly, Regular Session, 1820, page 8, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 21, 2023. - November 17, 1824 Democratic- Republican 1820 2 Frederick Bates - August 4, 1825 Democratic- Republican 1824 Vacant 3 Abraham J. Williams - January 20, 1826 Democratic- Republican 4 John Miller - November 21, 1832 Democratic 1825 1828 5 Daniel Dunklin Journal of the House, 7th General Assembly, Regular Session, 1832, pp. 28-29, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 21, 2023. - September 30, 1836 Democratic 1832 6 Lilburn Boggs - November 18, 1840 Democratic Acting as governor 1836 7 Thomas Reynolds Journal of the House, 11th General Assembly, Regular Session, 1840, p. 28, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 21, 2023. - February 9, 1844 Democratic 1840 8 Meredith Miles Marmaduke - November 20, 1844 Democratic Acting as governor 9 John Cummins Edwards - December 27, 1848 Democratic 1844 10 Austin Augustus King Journal of the House, 15th General Assembly, Regular Session, 1848, p. 35, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 22, 2023. - January 3, 1853 Democratic 1848 11 Sterling Price - January 5, 1857 Democratic 1852 Vacant 12 Trusten Polk Journal of the House, 19th General Assembly, Regular Session, 1857, p. 40, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 22, 2023. - February 27, 1857 Democratic 1856 13 Hancock Lee Jackson Journal of the Senate, 19th General Assembly, Regular Session, 1857, p. 357, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 22, 2023. - October 22, 1857 Democratic Acting as governor 14 Robert Marcellus Stewart Journal of the House, 19th General Assembly, Adjourned Session, 1857, p. 23, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 23, 2023. - January 3, 1861 Democratic 1857 15 Claiborne Fox Jackson Journal of the House, 21st General Assembly, Regular Session, 1861, p. 45, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 23, 2023. - July 31, 1861 Democratic 1860 16 Hamilton Rowan Gamble - January 31, 1864 Union 17 Willard Preble Hall - January 2, 1865 Union Acting as governor 18 Thomas Clement Fletcher Journal of the House, 23rd General Assembly, Regular Session, 1865, p. 46, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 23, 2023. - January 12, 1869 Republican 1864 19 Joseph W. McClurg Journal of the House, 25th General Assembly, Regular Session, 1869, p. 112, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 23, 2023. - January 9, 1871 Republican 1868 20 Benjamin Gratz Brown Journal of the House, 26th General Assembly, Regular Session, 1871, p. 26, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 23, 2023. - January 8, 1873 Liberal Republican 1870 Vacant 21 Silas Woodson Journal of the House, 27th General Assembly, Regular Session, 1873, p. 89, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 12, 1875 Democratic 1872 22 Charles Henry Hardin Journal of the House, 28th General Assembly, Regular Session, 1875, p. 97, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 8, 1877 Democratic 1874 23 John S. Phelps Journal of the House, 29th General Assembly, Regular Session, 1877, p. 59, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 10, 1881 Democratic 1876 24 Thomas Theodore Crittenden Journal of the House, 31st General Assembly, Regular Session, 1881, p. 53, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 12, 1885 Democratic 1880 25 John S. Marmaduke Journal of the House, 33rd General Assembly, Regular Session, 1885, p. 93, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - December 28, 1887 Democratic 1884 26 Albert P. Morehouse - January 14, 1889 Democratic Acting as governor 27 David R. Francis Journal of the House, 35th General Assembly, Regular Session, 1889, p. 74, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 9, 1893 Democratic 1888 28 William J. Stone Journal of the House, 37th General Assembly, Regular Session, 1893, p. 25, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 11, 1897 Democratic 1892 29 Lawrence Vest Stephens Journal of the House, 39th General Assembly, Regular Session, 1897, p. 34, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 14, 1901 Democratic 1896 30 Alexander Monroe Dockery Journal of the House, 41st General Assembly, Regular Session, 1901, p. 63, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 9, 1905 Democratic 1900 31 Joseph W. Folk Journal of the House, 43rd General Assembly, Regular Session, 1905, p. 24, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 11, 1909 Democratic 1904 32 Herbert S. Hadley Journal of the House, 45th General Assembly, Regular Session, 1909, p. 19, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 13, 1913 Republican 1908 33 Elliott Woolfolk Major Journal of the House, 47th General Assembly, Regular Session, 1913, p. 23, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 8, 1917 Democratic 1912 34 Frederick D. Gardner Journal of the House, 49th General Assembly, Regular Session, 1917, p. 129, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 10, 1921 Democratic 1916 35 Arthur M. Hyde Journal of the House, 51st General Assembly, Regular Session, 1921, p. 24, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 12, 1925 Republican 1920 36 Sam Aaron Baker Journal of the House, 53rd General Assembly, Regular Session, 1925, p. 35, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 14, 1929 Republican 1924 37 Henry S. Caulfield Journal of the House, 55th General Assembly, Regular Session, 1929, p. 78, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 9, 1933 Republican 1928 38 Guy Brasfield Park Journal of the Senate, 57th General Assembly, Regular Session, 1933, p. 22, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 11, 1937 Democratic 1932 39 Lloyd C. Stark Journal of the House, 59th General Assembly, Regular Session, 1937, p. 29, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - February 26, 1941 Democratic 1936 40 Forrest C. Donnell - January 8, 1945 Republican 1940 Vacant 41 Phil M. Donnelly Journal of the House, 63rd General Assembly, Regular Session, 1945, p. 87, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 10, 1949 Democratic 1944 42 Forrest Smith Journal of the House, 65th General Assembly, Regular Session, 1949, p. 36, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 12, 1953 Democratic 1948 43 Phil M. Donnelly Journal of the House, 67th General Assembly, Regular Session, 1953, p. 56, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 14, 1957 Democratic 1952 44 James T. Blair Jr. Journal of the House, 69th General Assembly, Regular Session, 1957, p. 47, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 9, 1961 Democratic 1956 Vacant 45 John M. Dalton Journal of the House, 71st General Assembly, Regular Session, 1961, p. 52, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 11, 1965 Democratic 1960 46 Warren E. Hearnes Journal of the House, 73rd General Assembly, Regular Session, 1965, p. 67, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 8, 1973 Democratic 1964 Vacant 1968 47 Kit Bond Journal of the Senate, 77th General Assembly, Regular Session, 1973, p. 47, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 10, 1977 Republican 1972 48 Joseph P. Teasdale Journal of the House, 79th General Assembly, Regular Session, 1977, p. 217, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 12, 1981 Democratic 1976 49 Kit Bond Journal of the House, 81st General Assembly, Regular Session, 1981, p. 135, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 14, 1985 Republican 1980 50 John Ashcroft Journal of the House, 83rd General Assembly, Regular Session, 1985, p. 131, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 11, 1993 Republican 1984 1988 51 Mel Carnahan Journal of the Senate, 87th General Assembly, Regular Session, 1993, p. 97, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - October 16, 2000 Democratic 1992 1996 52 Roger B. Wilson - January 8, 2001 Democratic Vacant 53 75px Bob Holden Journal of the House, 91st General Assembly, Regular Session, 2001, p. 95, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - January 10, 2005 Democratic 2000 54 Matt Blunt - January 12, 2009 Republican 2004 55 Jay Nixon - January 9, 2017 Democratic 2008 2012 56 Eric Greitens Journal of the Senate, 99th General Assembly, Regular Session, 2017, p. 85, General Assembly, Record Group 550, Missouri State Archives, Jefferson City. Accessed March 24, 2023. - June 1, 2018 Republican 2016 57 Mike Parson - Republican Vacant 2020 58 Mike Kehoe - Incumbent Republican 2024 The most recent Governor to die was Joseph P. Teasdale (1936–2014). The most recently serving United States Governor of Missouri to die was Mel Carnahan (1934–2000). The oldest living Governor or former Governor of Missouri is Kit Bond (born 1939). ==Notes== ==References== *",
 "title": "List of governors of Missouri"
}