{
 "id": "650741",
 "text": "Kindergarten Cop 2 is a 2016 American direct-to-video comedy movie. It stars Dolph Lundgren and directed by Don Michael Paul. It is the standalone sequel to the 1990 comedy movie Kindergarten Cop which starred Arnold Schwarzenegger. Principal photography in Langley and Vancouver, British Columbia, Canada took 102 days, from July 27 to November 6, 2015. The movie was released on direct- to-DVD in the United States on May 17, 2016. ==Synopsis== A federal agent must go undercover as a kindergarten teacher, to recover a missing flash drive from the Federal Witness Protection Program. Helping him with his mission is Agent Sanders, his partner, and Detective David Harris, his new sidekick, who comes out of retirement. ==Cast== * Dolph Lundgren as FBI Agent Zack Reed * Fiona Vroom as Michelle * Aleks Paunovic as Alexander Zogu * Andre Tricoteux as Valmir * Bill Bellamy as Agent Sanders * Sarah Strange as Miss Sinclaire * Darla Taylor as Olivia * Raphael Alejandro as Cowboy * Enid-Raye Adams as Jett's Mom * Jody Thompson as Hot Mom * Rebecca Olson as Katja * Dean Petriw as Jett * Jenny Sandersson as Hot Mom * Carolyn Adair as Felicity * Nicholas Carella as Bernie the Hot Single Dad * Michael P. Northey as Hal Pasquale * Josiah Black as Jason Flaherty * James Ralph as SWAT Leader * Abbie Magnuson as Molly * Tyreah Herbert as Hannah * Blake Stadel as Mr. Edwards, father of Molly * Oscar Hartley as Simon * Valencia Budjanto as Patience * William Budjanto as Tripp * Chris Violette as Country Bar Bartender (uncredited) * Tawny West as Line Dancer (uncredited) ==Production== On June 1, 2015, it was reported that The Garden and Half Past Dead director Don Michael Paul will be directing the movie, and Arnold Schwarzenegger will not return as Detective John Kimble. Schwarzenegger announced that his character Detective John Kimble is now officially retired from being a kindergarten teacher and police officer. Schwarzenegger was replaced by Dolph Lundgren as a new character FBI Agent Zack Reed, and Paul hired Matthew Lillard who previously played as Detective David Harris in the original 1990 movie. Lillard agreed to return. On December 21, 2015, the 25th anniversary of the theatrical release of the original movie the first official photos of Kindergarten Cop 2 were released via About. ==References== Category:2016 movies Category:2016 comedy movies Category:2010s buddy comedy movies Category:American buddy comedy movies Category:American sequel movies Category:Movies about educators Category:Movies set in British Columbia Category:Movies set in Vancouver Category:Universal Pictures movies Category:2010s English-language movies Category:2010s American action movies",
 "title": "Kindergarten Cop 2"
}