{
 "id": "650865",
 "text": "The Vice President of the Republic of Indonesia () is the first in the line of succession in the Republic of Indonesia. The Indonesian Vice Presidency was created during the creation of the 1945 constitution by the Investigating Committee for Preparatory Work for Independence (BPUPKI). The office was first filled on 18 August 1945 when Mohammad Hatta was elected.[EMAIL PROTECTED] Dr. Muhammad Hatta ==Requirements== * The 1945 Constitution: The Vice-Presidential candidate has to be of Indonesian origins. * The Provisional Constitution: The Vice-Presidential candidate has to be an Indonesian citizen aged at least 40 years old. * The Amended 1945 Constitution: The Vice-Presidential candidate has to be an Indonesian citizen since his/her birth, who has not willingly become a citizen in another nation, has not betrayed the nation, and is physically and mentally capable of performing the duties. ==Succession== The Vice-President replaces the President in the event that the President dies, resigns, or is unable to perform his/her duties for any reason. If the President and the Vice-President dies, resigns, or is unable to perform his/her duties for any reason, the government will be taken over together by Minister of Foreign Affairs, Minister of Internal Affairs and Minister of Defence. ==Vice presidents== Portrait Name Term of office Political party President(s) Took office Left office Time in office 1 Mohammad Hatta 18 August 1945 1 December 1956 Independent Sukarno Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) Vacant (1 December 1956 – 23 March 1973) 2 Hamengkubuwono IX 23 March 1973 23 March 1978 years Independent Suharto 3 Adam Malik 23 March 1978 11 March 1983 Golkar Suharto 4 Umar Wirahadikusumah 11 March 1983 11 March 1988 years Golkar Suharto 5 Sudharmono 11 March 1988 11 March 1993 years Golkar Suharto 6 Try Sutrisno 11 March 1993 11 March 1998 years Golkar Suharto 7 B. J. Habibie 11 March 1998 21 May 1998 Golkar Suharto Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) Vacant (21 May 1998 – 21 October 1999) 8 Megawati Sukarnoputri 21 October 1999 23 July 2001 Indonesian Democratic Party of Struggle Abdurrahman Wahid Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) Vacant (23–26 July 2001) 9 Hamzah Haz 26 July 2001 20 October 2004 United Development Party Megawati Sukarnoputri 10 Jusuf Kalla 20 October 2004 20 October 2009 years Golkar Susilo Bambang Yudhoyono 11 Boediono 20 October 2009 20 October 2014 years Independent Susilo Bambang Yudhoyono 12 Jusuf Kalla 20 October 2014 20 October 2019 years Golkar Joko Widodo 13 Ma'ruf Amin 20 October 2019 20 October 2024 years Independent Joko Widodo Ma'ruf Amin 20 October 2019 20 October 2024 years National Awakening Party Joko Widodo 14 Gibran Rakabuming Raka 20 October 2024 Incumbent Independent Prabowo Subianto ==References== ==Other websites== * 1945 Constitution * Provisional Constitution * Amended 1945 Constitution",
 "title": "Vice President of Indonesia"
}