{
 "id": "650966",
 "text": "Ollanta Moisés Humala Tasso (; born 27 June 1962) is a Peruvian politician. He was the 65th President of Peru from 2011 to 2016. Humala lost the 2006 presidential election and eventually won the 2011 presidential election in a run-off vote.The Guardian, April 11, 2011, Peru elections: Fujimori and Humala set for runoff vote He was elected as President of Peru in the second round, defeating Keiko Fujimori (daughter of former President Alberto Fujimori). ==Early life== Born to a prominent political family affiliated with the ethnocacerist movement, Humala is the son of famed Quechua labour lawyer Isaac Humala. Humala entered the Peruvian Army in 1981, eventually achieveing the rank of Lieutenant Colonel. During his time in the military, he fought in the internal conflict against far-left terrorist group Shining Path as well as in the Cenepa War with neighboring Ecuador. In October 2000, Humala attempted an unsuccessful coup d'etatagainst President Alberto Fujimori during the dying days of his regime;Diario Hoy, October 31, 2000, PERU, CORONELAZO NO CUAJA eventually, Congress granted him amnesty and Humala was allowed to return to military duty. ==Politics== In 2005, Humala entered electoral politics, founding the Peruvian Nationalist Party (PNP) in order to run in the 2006 presidential election. Having received first place in the first round, he faced former centre-left President and APRA candidate Alan García in the second round, ultimately losing by a narrow margin. His campaign received widespread international attention in 2006 given the recent success of left- wing politicians in Latin America. In 2011, he would once again run for President, and narrowly defeated Keiko Fujimori in the runoff. Humala's election initially concerned investors, who feared he would govern similar to far-left Venezuelan PresidentHugo Chavez, a former ally of his. To assuage these fears, Humala would begin his term by choosing centrists for positions in his cabinet. Humala's unpopular presidency was dominated by corruption scandals surrounding him and his politically influential wife Nadine Heredia. Environmentalists were highly critical of Humala's mining policies, and argued that he reneged on his campaign promise to reign in mining companies. Humala was arrested by Peruvian authorities in July 2017 for illegally accepting bribes and awaits a corruption trial. Humala ran for president again in 2021, but lost in the first round of the election. ==References== Category:1962 births Category:Living people Category:Presidents of Peru Category:Politicians from Lima",
 "title": "Ollanta Humala"
}