{
 "id": "650963",
 "text": "The President of Peru () officially called the President of the Republic of Peru () is the head of state and head of government of Peru and represents the republic in official international matters. The last directly elected President of Peru was Pedro Pablo Kuczynski, from 28 July 2016 to 21 March 2018, when he resigned from office. The current president of Peru is Dina Boluarte who assumed office on 7 December 2022. ==List of presidents== ==Terms== Presidents are elected for five-year terms, with no opportunity for immediate reelection. A former president can run again after being out of office for a full term. The change of government takes place on July 28, which is the date of independence from Spain and thus a national holiday. ==Removal== There are only five ways the office of President of Peru can be left empty: # Death of the President of the Republic. # His permanent moral or physical disability, declared by Congress. # Acceptance of his resignation by Congress. # Leaving the national territory without permission of the Congress or not returning to it within the established period. # Dismissal, after having been sanctioned for any of the infractions mentioned in Article 117 of the Constitution. Four presidents of Peru have resigned: Guillermo Billinghurst (forced resignation), Andrés Avelino Cáceres, Alberto Fujimori, and Pedro Pablo Kuczynski. Martín Vizcarra was impeached and removed from office on 10 November 2020. Pedro Castillo was impeached and removed from office after attempting to dissolve Congress as a self-coup d'état attempt on 7 December 2022. ==Living former presidents of Peru== All former presidents of Peru since 1985 have been prosecuted since leaving office. As of 2024, there were seven living former presidents of Peru. In order of office they are: File:Alejandro Toledo 2015 (cropped).jpg|Alejandro Toledo (2001–2006) File:Ollanta Humala 2014.jpg|Ollanta Humala (2011–2016) File:Pedro Pablo Kuczynski Godard.jpg|Pedro Pablo Kuczynski (2016–2018) File:President Martín Vizcarra.jpg|Martín Vizcarra (2018-2020) File:Manuel Merino.jpg|Manuel Merino (2020) File:Francisco Sagasti Hochhausler.jpg|Francisco Sagasti (2020–2021) File:Pedro Castillo portrait.png|Pedro Castillo (2021–2022) The most recent president to die was Alberto Fujimori (1990–2000), who died on 11 September 2024. ==References== ==Other websites== *",
 "title": "President of Peru"
}