{
 "id": "650968",
 "text": "The President of El Salvador () officially known as the President of the Republic of El Salvador () is the head of state of El Salvador. The office was created in the Constitution of 1841. From 1821 until 1841, the head of state of El Salvador was styled simply as Head of State (Jefe de Estado). ==Heads of State of El Salvador within the Federal Republic of Central America (1821–1841)== === Intendants Political Leaders of the Province of San Salvador. === Name Portrait Term of Office Political Affiliation 1 Pedro Barriere 21 September 1821 28 November 1821 Independent 2 José Matías Delgado 28 November 1821 9 February 1823 Independent 3 Vicente Filísola 9 February 1823 7 May 1823 Independent 4 Felipe Codallos 7 May 1823 25 May 1823 Independent — Advisory Junta 25 May 1823 17 June 1823 Advisory Junta 5 Mariano Padro 17 June 1823 22 April 1824 Independent Head of State of El Salvador Name Portrait Term of Office Political Affiliation 1 Juan Manuel Rodríguez 22 April 1824 1 October 1824 Independent — Mariano Prado 1 October 1824 13 December 1824 Liberal 2 Juan Vicente Villacorta Díaz 13 December 1824 1 November 1826 Liberal — Mariano Prado 1 November 1826 30 January 1829 Liberal 3 José María Cornejo 30 January 1829 16 February 1830 Conservative 4 José Damián Villacorta 16 February 1830 4 December 1830 Independent 5 José María Cornejo 4 December 1830 3 April 1832 Conservative — Francisco Morazán 3 April 1832 13 May 1832 Liberal — Joaquín de San Martín 13 May 1832 25 July 1832 Conservative 6 Mariano Prado 25 July 1832 1 July 1833 Liberal 7 Joaquín de San Martín 1 July 1833 23 July 1834 Conservative — Carlos Salazar Castro 23 June 1834 13 July 1834 Independent — José Gregorio Salazar 13 July 1834 30 September 1834 Independent 8 Joaquín Escolán y Balibrera 30 September 1834 13 October 1834 Independent — José María Silva 13 October 1834 2 March 1835 Independent 9 Joaquín Escolán y Balibrera 2 March 1835 10 April 1835 Independent 10 Nicolás Espinoza 10 April 1835 15 November 1835 Liberal — Francisco Gómez 15 November 1835 1 February 1836 Independent 11 Diego Vigil Cocaña 1 February 1836 23 May 1837 Liberal 12 Timoteo Menéndez 23 May 1837 7 June 1837 Independent 13 Diego Vigil Cocaña 7 June 1837 6 January 1838 Liberal 14 Timoteo Menéndez 6 January 1838 23 May 1838 Independent — Antonio José Cañas 23 May 1838 11 July 1839 Independent 15 Francisco Morazán 11 July 1839 16 February 1840 Liberal — José María Silva 16 February 1840 5 April 1840 Independent — Antonio José Cañas 5 April 1840 20 September 1840 Independent — Norberto Ramírez 20 September 1840 7 January 1841 Independent — Juan Lindo 7 January 1841 22 February 1841 Conservative 16 Juan Lindo (1790–1857) Head of State 22 February 1841 22 February 1841 Independent ==Presidents of the Independent Republic of El Salvador (1841–present)== Name Portrait Term of Office Political Affiliation 1 Juan Lindo 22 February 1841 20 June 1841 Conservative 2 Pedro José Acre 20 June 1841 28 June 1841 Independent 1 Juan Lindo 28 June 1841 1 February 1842 Conservative 3 José Escolástico Marín 1 February 1842 14 April 1842 Independent 4 Juan José Guzmán 14 April 1842 1 February 1844 Conservative 5 Fermín Palacios (?-?) 1 February 1844 7 February 1844 Independent 6 Francisco Malespín 7 February 1844 15 February 1845 Conservative 7 Joaquín Eufrasio Guzmán 15 February 1845 1 February 1846 Independent 5 Fermín Palacios (?-?) 1 February 1846 21 February 1846 Independent 8 Eugenio Aguilar 21 February 1846 1 February 1848 Liberal 9 Tomás Medina 1 February 1848 3 February 1848 Independent 10 José Félix Quirós 3 February 1848 7 February 1848 Independent 11 Doroteo Vasconcelos 7 February 1848 1 February 1850 Liberal 12 Ramón Rodríguez (?-?) 1 February 1850 4 February 1850 Independent 11 Doroteo Vasconcelos 4 February 1850 1 March 1851 Liberal 13 José Félix Quirós 1 March 1851 3 May 1851 Independent 14 Francisco Dueñas 13 May 1851 30 January 1852 Conservative 15 José María San Martín 30 January 1852 1 February 1852 Conservative 14 Francisco Dueñas 1 February 1852 1 February 1854 Conservative 16 Vicente Gómez (?-?) 1 February 1854 15 February 1854 Independent 15 José María San Martín 15 February 1854 1 February 1856 Conservative 14 Francisco Dueñas 1 February 1856 12 February 1856 Conservative 17 Rafael Campo 12 February 1856 1 February 1858 Conservative 18 Lorenzo Zepeda (?-?) 1 February 1858 7 February 1858 Independent 19 Miguel Santín del Castillo 7 February 1858 24 January 1859 Conservative 20 Joaquín Eufrasio Guzmán 24 January 1859 15 February 1859 Independent 21 José María Peralta 15 February 1859 12 March 1859 Independent 22 Gerardo Barrios 12 March 1859 26 October 1863 Liberal 14 Francisco Dueñas 26 October 1863 15 April 1871 Conservative 23 Santiago González 15 April 1871 1 February 1876 Liberal 24 Andrés del Valle 1 February 1876 1 May 1876 Liberal 25 Rafael Zaldívar 1 May 1876 6 April 1884 Liberal 26 Ángel Guirola 6 April 1884 21 August 1884 Independent 25 Rafael Zaldívar 21 August 1884 14 May 1885 Liberal 27 Fernando Figueroa 14 May 1885 18 June 1885 Military / Liberal 28 José Rosales 18 June 1885 22 June 1885 Independent 29 Francisco Menéndez 22 June 1885 22 June 1890 Military / Liberal 30 Carlos Ezeta 22 June 1890 9 June 1894 Military / Liberal 31 Rafael Antonio Gutiérrez 10 June 1894 13 November 1898 Military / Liberal 32 Tomás Regalado 14 November 1898 1 March 1903 Military / Liberal 33 Pedro José Escalón 1 March 1903 1 March 1907 Military / Conservative 27 Fernando Figueroa 1 March 1907 1 March 1911 Military / Liberal 34 Manuel Enrique Araujo 1 March 1911 8 February 1913 Independent 35 Carlos Meléndez Ramirez 9 February 1913 29 August 1914 National Democratic Party 36 Alfonso Quiñónez Molina 29 August 1914 1 March 1915 National Democratic Party 35 Carlos Meléndez Ramirez 1 March 1915 21 December 1918 National Democratic Party 36 Alfonso Quiñónez Molina 21 December 1918 1 March 1919 National Democratic Party 37 Jorge Meléndez 1 March 1919 1 March 1923 National Democratic Party 36 Alfonso Quiñónez Molina 1 March 1923 1 March 1927 National Democratic Party 38 Pío Romero Bosque 1 March 1927 1 March 1931 National Democratic Party 39 Arturo Araujo 1 March 1931 2 December 1931 Labor Party 40 National Guard Colonel Joaquín Valdés 2 December 1931 2 December 1931 military 41 Colonel Juan Vicente Vidal 2 December 1931 2 December 1931 military 42 First Infantry Regiment Captain Manuel Urbina. 2 December 1931 2 December 1931 military 43 Captain Visitation Antonio Pacheco 2 December 1931 2 December 1931 military 43 Lieutenant Joaquín Castro Canizales 2 December 1931 2 December 1931 military 44 Artillery Regiment Lieutenant Carlos Rodríguez 3 December 1931 3 December 1931 military 45 Sub Lieutenant Julio Cañas 3 December 1931 3 December 1931 military 46 First Machine Gun Regiment Second Lieutenant José Alonso Huezo 3 December 1931 3 December 1931 military 47 Second Lieutenant Miguel Hernández Saldaña 3 December 1931 3 December 1931 military 48 Cavalry Regiment Second Lieutenant Héctor Montalvo. 3 December 1931 3 December 1931 military 49 Military Aviation Second Lieutenant Juan Ramón Munés 4 December 1931 4 December 1931 military 50 Ministry of War Coronel Osmín Aguirre y Salinas 4 December 1931 4 December 1931 military military 2 December 1931 4 December 1931 The Civic Directory governed El Salvador from 2 to 4 December 1931 . Composed entirely of military, the civic directory began the era of military dictatorships. The civic directory ended its government when the Presidency of the Republic was handed over to Vice President Maximiliano Hernández Martínez , who would later perpetrate a massacre in 1932. The civic directory was formed by (according to the military organization to which they belonged) 51 Maximiliano Hernández Martínez 4 December 1931 28 August 1934 Military / National Pro Patria Party 52 Andrés Ignacio Menéndez 29 August 1934 1 March 1935 Military / National Pro Patria Party 51 Maximiliano Hernández Martínez 1 March 1935 9 May 1944 Military / National Pro Patria Party 52 Andrés Ignacio Menéndez 9 May 1944 20 October 1944 Military / National Pro Patria Party 50 Osmín Aguirre y Salinas 21 October 1944 1 March 1945 Military 53 Salvador Castaneda Castro 1 March 1945 14 December 1948 Military / Unification Social Democratic Party 54 Manuel de Jesús Córdova (b. 1911 .d. 1999) 14 December 1948 15 December 1948 Revolutionary Council of Government 55 Óscar A. Bolaños (b. 1912 d. 2011) 15 December 1948 15 December 1948 Revolutionary Council of Government 56 Óscar Osorio (b. 1910 - d. 1969) 15 December 1948 15 December 1949 Revolutionary Council of Government 57 Reynaldo Galindo Pohl (b. 1918 - d. 2012) 15 December 1949 15 December 1949 Revolutionary Council of Government 58 Humberto Costa (b. 1906 - d.2017) 15 December 1949 14 September 1950 Revolutionary Council of Government 56 Óscar Osorio 14 September 1950 14 September 1956 Military / Revolutionary Party of Democratic Unification 59 José María Lemus 14 September 1956 26 October 1960 Military / Revolutionary Party of Democratic Unification 60 Miguel Ángel Castillo (b. 1915 - d. 1999) 26 October 1960 26 October 1960 Revolutionary Council of Governmen 61 Fabio Castillo Figueroa (b. 1921 - d. 2012) 26 October 1960 26 October 1960 Revolutionary Council of Governmen 62 Ricardo Falla Cáceres (b. 1921) 26 October 1960 26 October 1960 Revolutionary Council of Governmen 63 René Fortín Magaña (b. 1931) 26 October 1960 26 October 1960 Revolutionary Council of Governmen 64 Rubén Alonso Rosales (b. 1925) 26 October 1960 2 January 1961 Revolutionary Council of Governmen 65 Cnel César Yanes Uriah 2 January 1961 25 January 1961 Revolutionary Council of Governmen 66 Aníbal Portillo (whole time) 25 January 1961 25 January 1961 Revolutionary Council of Governmen 67 Feliciano Avelar (whole time) 25 January 1961 25 January 1961 Revolutionary Council of Governmen 68 José Antonio Rodríguez Porth 25 January 1961 6 April 1961 Junta of Government 69 Mariano Castro Morán 6 April 1961 6 April 1961 Junta of Government 70 José Francisco Valiente 6 April 1961 11 September 1961 Junta of Government 71 Julio Adalberto Rivera Carballo 26 October 1960 25 January 1961 Junta of Government 72 Civic-Military Directory 25 January 1961 25 January 1962 Civic-Military Directory 73 Eusebio Rodolfo Cordón Cea 25 January 1962 1 July 1962 Independent 71 Julio Adalberto Rivera Carballo 1 July 1962 1 July 1967 Military / National Coalition Party 74 Fidel Sánchez Hernández 1 July 1967 1 July 1972 Military / National Coalition Party 75 Arturo Armando Molina 1 July 1972 1 July 1977 Military / National Coalition Party 58 Carlos Humberto Romero 1 July 1977 15 October 1979 Military / National Coalition Party 76 Adolfo Arnoldo Majano Ramos (b. 1938) 15 October 1979 15 October 1979 Revolutionary Government Junta of El Salvador 77 Jaime Abdul Gutiérrez Avendaño (b. 1936 - d. 2012) 15 October 1979 15 October 1979 Revolutionary Government Junta of El Salvador 78 Román Mayorga Quirós 15 October 1979 15 October 1979 Revolutionary Government Junta of El Salvador 79 Guillermo Ungo (b. 1931 - d. 1991) 15 October 1979 5 January 1980 Revolutionary Government Junta of El Salvador 80 Marco Antonio Andino (b. 1936 - d. 2014) 5 January 1980 31 January 1980 Revolutionary Government Junta of El Salvador 81 José Antonio Morales Ehrlich (b. 1935) 31 January 1980 30 January 1980 Revolutionary Government Junta of El Salvador 82 José Ramón Ávalos Navarrete (b. 1938) 30 January 1980 30 January 1980 Revolutionary Government Junta of El Salvador 83 Héctor Miguel Antonio Dada Hirezi (b. 1938 d. 2012) 30 January 1980 2 May 1980 Revolutionary Government Junta of El Salvador 84 Revolutionary Government Junta 15 October 1979 2 May 1982 Revolutionary Government Junta 85 José Napoleón Duarte (b. 1925 - d. 1990) 2 May 1980 2 May 1982 Democratic Action Party 86 Álvaro Magaña 2 May 1982 1 June 1984 Democratic Action Party 85 José Napoleón Duarte 1 June 1984 1 June 1989 Christian Democratic Party 87 Alfredo Cristiani 1 June 1989 1 June 1994 Nationalist Republican Alliance 89 Armando Calderón Sol 1 June 1994 1 June 1999 Nationalist Republican Alliance 90 Francisco Flores Pérez 1 June 1999 1 June 2004 Nationalist Republican Alliance 91 Antonio Saca 1 June 2004 1 June 2009 Nationalist Republican Alliance 92 Mauricio Funes 1 June 2009 1 June 2014 Farabundo Martí National Liberation Front 93 Salvador Sánchez Cerén 1 June 2014 1 June 2019 Farabundo Martí National Liberation Front 94 Nayib Bukele 1 June 2019 Incumbent Grand Alliance for National Unity — Claudia Rodríguez de Guevara 1 December 2023 1 June 2024 Independent ==Latest election== Candidate Party First round First round Candidate Party Votes % Nayib Bukele Grand Alliance for National Unity (GANA) 1,434,856 53.10 Carlos Calleja Nationalist Republican Alliance (ARENA) 857,084 31.72 Hugo Martínez Farabundo Martí National Liberation Front (FMLN) 389,289 14.41 Josué Alvarado VAMOS 20,763 0.77 Invalid/blank votes 31,186 – Total 2,733,178 100 Registered voters/turnout 5,268,411 51.88 Source: TSE,TSE El Salvador on Twitter: \"RESULTADOS GANA 1,434, 856 votos, (53.10%) COALICIÓN 857,084 votos, (31.72%) FMLN 389,289 votos, (14.41) VAMOS 20, 763 votos, (0.77%) Total de vot...http://escrutiniofinal2014.tse.gob.sv/pais.html2 ==Living former presidents== File:Alfredo Cristiani.jpg|Alfredo Cristiani 1989–1994 File:Antonio Saca.png|Antonio Saca 2004–2009 File:Salvador Sanchez Ceren.jpg|Salvador Sánchez Cerén 2014–2019 Intendant and Superior Political Chief 21 Sep 1821 – 28 November 1821 Pedro Barriere (b. ... - d. 1827) Intendant and Governor (from 11 January 1822, President of the Junta of Government) 28 Nov 1821 - 9 February 1823 José Matías Delgado (b. 1767 - d. 1832) Supreme Political Chief Chief of State 22 Apr 1824 - 1 October 1824 The Civic Directory governed El Salvador from 2 to 4 December 1931 . Composed entirely of military, the civic directory began the era of military dictatorships. The civic directory ended its government when the Presidency of the Republic was handed over to Vice President Maximiliano Hernández Martínez , who would later perpetrate a massacre in 1932. The civic directory was formed by (according to the military organization to which they belonged): National Guard : * Colonel Joaquín Valdés. * Colonel Juan Vicente Vidal First Infantry Regiment : * Captain Manuel Urbina. * Captain Visitation Antonio Pacheco * Lieutenant Joaquín Castro Canizales First Artillery Regiment : * Lieutenant Carlos Rodríguez * Sub Lieutenant Julio Cañas First Machine Gun Regiment : * Second Lieutenant José Alonso Huezo * Second Lieutenant Miguel Hernández Saldaña Cavalry Regiment : * Second Lieutenant Héctor Montalvo. Ministry of War : * Coronel Osmín Aguirre and Salinas Military Aviation : * Second Lieutenant Juan Ramón Munés == Related pages == * El Salvador == References == ==Other websites== *",
 "title": "President of El Salvador"
}