{
 "id": "651214",
 "text": "The Auto Club 400 is a Monster Energy NASCAR Cup Series race held annually at Auto Club Speedway in Fontana, California, It is held as the fifth race of the NASCAR season, held in conjunction with the NASCAR Xfinity Series the previous day, From 1997-2010, the race distance was 500 miles in distance, For the 2011 season onward, the race distance reduced to 400 miles in length. == Past winners == Year Date Driver Manufacturer No. Team Laps Miles 1997 June 22 Jeff Gordon Chevrolet 24 Hendrick Motorsports 250 500 1998 May 3 Mark Martin Ford 6 Roush Racing 250 500 1999 May 2 Jeff Gordon Chevrolet 24 Hendrick Motorsports 250 500 2000 April 30 Jeremy Mayfield Ford 12 Penske Racing 250 500 2001 April 29 Rusty Wallace Ford 2 Penske Racing 250 500 2002 April 28 Jimmie Johnson Chevrolet 48 Hendrick Motorsports 250 500 2003 April 27 Kurt Busch Ford 97 Roush Racing 250 500 2004 May 2 Jeff Gordon Chevrolet 24 Hendrick Motorsports 250 500 2005 February 27 Greg Biffle Ford 16 Roush Racing 250 500 2006 February 26 Matt Kenseth Ford 17 Roush Racing 251* 502 2007 February 25 Matt Kenseth Ford 17 Roush Fenway Racing 250 500 2008 February 24/25* Carl Edwards Ford 99 Roush Fenway Racing 250 500 2009 February 22 Matt Kenseth Ford 17 Roush Fenway Racing 250 500 2010 February 21 Jimmie Johnson Chevrolet 48 Hendrick Motorsports 250 500 2011 March 27 Kevin Harvick Chevrolet 29 Richard Childress Racing 200 400 2012 March 25 Tony Stewart Chevrolet 14 Stewart-Haas Racing 129* 258 2013 March 24 Kyle Busch Toyota 18 Joe Gibbs Racing 200 400 2014 March 23 Kyle Busch Toyota 18 Joe Gibbs Racing 206* 412 2015 March 22 Brad Keselowski Ford 2 Team Penske 209* 418 2016 March 20 Jimmie Johnson Chevrolet 48 Hendrick Motorsports 205* 410 2017 March 26 Kyle Larson Chevrolet 42 Chip Ganassi Racing 202* 404 2018 March 18 Martin Truex Jr. Toyota 78 Furniture Row Racing 200 400 *2006, and 2014–2017: Race extended due to a NASCAR Overtime finish.. The 2015 race took two attempts. *2008: Race started on Sunday but was finished on Monday due to rain. *2011: Race distance changed from 500 miles to 400. Kevin Harvick passed Jimmie Johnson on the last lap to win, the first last lap pass in ACS history. *2012: Race shortened due to rain. ===Multiple winners (drivers)=== Wins Driver Years won 3 Jeff Gordon 1997, 1999, 2004 Matt Kenseth 2006, 2007, 2009 Jimmie Johnson 2002, 2010, 2016 2 Kyle Busch 2013, 2014 ===Multiple winners (teams)=== Wins Team Years won 7 Roush Fenway Racing 1998, 2003, 2005, 2006, 2007, 2008, 2009 6 Hendrick Motorsports 1997, 1999, 2002, 2004, 2010, 2016 3 Team Penske 2000, 2001, 2015 2 Joe Gibbs Racing 2013, 2014 ===Manufacturer wins=== Wins Manufacturer Years won 10 Ford 1998, 2000, 2001, 2003, 2005, 2006, 2007, 2008, 2009, 2015 9 Chevrolet 1997, 1999, 2002, 2004, 2010, 2011, 2012, 2016, 2017 3 Toyota 2013, 2014, 2018 ==Television broadcasters== Year Network Lap-by-lap Color commentator(s) 1997 ABC Bob Jenkins Benny Parsons Ned Jarrett 1998 ABC Bob Jenkins Benny Parsons Ned Jarrett 1999 ABC Bob Jenkins Benny Parsons Ned Jarrett 2000 ABC Bob Jenkins Benny Parsons Ned Jarrett 2001 Fox Mike Joy Darrell Waltrip Larry McReynolds 2002 Fox Mike Joy Darrell Waltrip Larry McReynolds 2003 Fox Mike Joy Darrell Waltrip Larry McReynolds 2004 Fox Mike Joy Darrell Waltrip Larry McReynolds 2005 Fox Mike Joy Darrell Waltrip Larry McReynolds 2006 Fox Mike Joy Darrell Waltrip Larry McReynolds 2007 Fox Mike Joy Darrell Waltrip Larry McReynolds 2008 Fox Mike Joy Darrell Waltrip Larry McReynolds 2009 Fox Mike Joy Darrell Waltrip Larry McReynolds 2010 Fox Mike Joy Darrell Waltrip Larry McReynolds 2011 Fox Mike Joy Darrell Waltrip Larry McReynolds 2012 Fox Mike Joy Darrell Waltrip Larry McReynolds 2013 Fox Mike Joy Darrell Waltrip Larry McReynolds 2014 Fox Mike Joy Darrell Waltrip Larry McReynolds 2015 Fox Mike Joy Darrell Waltrip Larry McReynolds 2016 Fox Mike Joy Darrell Waltrip Jeff Gordon 2017 Fox Mike Joy Darrell Waltrip Jeff Gordon 2018 Fox Mike Joy Darrell Waltrip Jeff Gordon == References == Category:1997 establishments in California Category:NASCAR races Category:Monster Energy NASCAR Cup Series races Category:1997 in sports",
 "title": "Auto Club 400"
}