{
 "id": "651206",
 "text": "Burmese Days is a novel by George Orwell. It was his first novel. It was published in 1934. The book is about colonialism and racism in Burma. ==Background== George Orwell worked as a policeman in Burma for five years. He thought the way people were treated in parts of the British Empire was unfair and he used some of his own experiences as ideas. For example, he based the fictional town of Kyauktada on the real town of Katha, where he worked. Orwell finished writing the book in 1933 and it was published the year after. He had it published in the United States because of concerns that the characters were described too much like actual people in Orwell's life and made them look bad. ==Plot== In Burma, a man called John Flory lives on his own. He is unhappy with his life and misses his home in England but he has been in Burma so long, he does not feel like he can return home. Flory does not like the other English people in the town. He thinks they treat the local people very cruelly. Flory's best friend is an Indian doctor called Veraswami and some people make fun of him for being friendly with someone who is not white. A young lady called Elizabeth moves to the town and Flory plans to marry her. He hopes that if he does, he might be able to become happy. At the same time, an important Burmese man in the town called U Po Kyin makes a plan to have more power and this effects Flory and Veraswami. Flory kills himself. U Po Kyin believe that he can wipe out the negative karma of his evil actions by giving money to build pagodas. However, he dies of a stroke before the first pagoda can be built. His wife has a dream where he is reborn as a snake or frog. == Characters == * John Flory, called James Flory in some copies of the book, is the main character. In the novel, he is just \"Flory.\" * Elizabeth Lackersteen is an English girl and Flory's love interest. * Mr. Lackersteen is Elizabeth's uncle. * Mrs. Lackersteen is Elizabeth's aunt and Mr. Lackersteen's wife. * Dr. Veraswami is an Indian doctor and Flory's friend. * U Po Kyin is a corrupt Burmese magistrate. He is described as ugly and fat. * Ma Hla May is Flory's Burmese mistress. * Ko S'la is Flory's servant. He feels sorry for Flory, who is unmarried and has no kids while he is married and has 5 kids. * Lieutenant Verrall is a military officer posted in town. He is everything Flory is not: young, rich, and handsome. He looks down on everyone. * Mr. Macgregor is Deputy Commissioner. * Ellis is an Englishman who manages a timber company in Upper Burma. He is very racist. * Francis and Samuel: Francis and Samuel are clerks. They are both Eurasian. == References == Category:Books by George Orwell Category:1934 books Category:English novels",
 "title": "Burmese Days"
}