{
 "id": "651263",
 "text": "The Advance Auto Parts Clash is a Monster Energy NASCAR Cup Series exhibition race held annually at Daytona International Speedway in February the weekend before the Daytona 500, It began as the Busch Clash and was a 50-mile \"all out sprint\", In its current format, it is made up of two segments, starting with the 25-lap segment, which culminates with the final 50-lap segment, The race, like the Monster Energy NASCAR All Star Race in May, carries no points for the winner but rather a large purse, circumstances which are supposed to encourage an all-out driving style not seen in regular season races, where one series mistake can largely ruin a season. However, due to the smaller fields, huge crashes in the Daytona 500 are uncommon. The 1987 race, won by Bill Elliott, was completed at an average speed of , It stands as the fastest-sanctioned race in the history of NASCAR (though it was not a points-paying event). == Race format == * 1979-1990: The race consisted of a single twenty-lap (50 mile) green flag sprint with no pit stops required, Caution flags do not count. * 1991-1997: The race was broken up into two ten-lap green flag segments, the field was then inverted for the second ten-lap segment, Prize money was awarded for both segments for all positions, The race had been broken up into two segments, because it was lacking competitiveness since restrictor places was used in 1988, The inversion rule needed some excitement to the event. * 1998-2000: The event was renamed the Bud Shootout, and consisted of 25-laps, the Bud Shootout Qualifier ran at 11 a.m. and the Shootout itself ran at 12 p.m. * 2001-2002: The race renamed to the Budweiser Shootout, and expanded to a new race distance (70 laps, 125 miles), Caution laps would be counted, but the finish of the race had to be finished under green, except for the Green-white-checker-finish rule for the Camping World Truck Series, if necessary, A maximum of one pit-stop was required, The Bud Shootout qualifier was discontinued but the second round qualifying for Cup Series races was eliminated. * 2003-2008: The race was broken up into two segments, followed by a ten-minute intermission, While a pit-stop was no longer required by a rule, a reduction of fuel-cell size (from 22 gallons to 13 gallons) made a fuel pit stop necessary, (In 2007, Fuel cells were expanded to 18.5 gallons) Many drivers who changed tires during their fuel stop, as time required to fuel the car allowed a two-tire change. * 2009-2012: The race was expanded to 25 laps, followed by the 50 lap final segment, the race distance was expanded to 75 laps (187.5 miles) * 2013-2015: The race was divided into three segments (30 laps, 25 laps, 20 laps, which online fan voting was necessary, deciding certain aspects (lengths of the race, requirements of mandatory pit stops, numbers of drivers eliminated, etc.) The total distance of the race was 75 laps in length. == Past winners == Year Date No. Driver Team Manufacturer Laps Miles 1979 February 11 28 Buddy Baker Ranier-Lundy Oldsmobile 20 1980 February 10 2 Dale Earnhardt Osterlund Racing Chevrolet 20 1981 February 8 11 Darrell Waltrip Junior Johnson and Associates Buick 20 1982 February 7 88 Bobby Allison DiGuard Motorsports Buick 20 1983 February 14* 75 Neil Bonnett RahMoc Enterprises Chevrolet 20 1984 February 9 12 Neil Bonnett Junior Johnson and Associates Chevrolet 20 1985 February 10 44 Terry Labonte Meiling Racing Chevrolet 20 1986 February 8 3 Dale Earnhardt Richard Childress Racing Chevrolet 20 1987 February 8 9 Bill Elliott Meiling Racing Chevrolet 20 1988 February 7 3 Dale Earnhardt Richard Childress Racing Chevrolet 20 1989 February 12 25 Ken Schrader Hendrick Motorsports Chevrolet 20 1990 February 11 25 Ken Schrader Hendrick Motorsports Chevrolet 20 1991 February 10 3 Dale Earnhardt Richard Childress Racing Chevrolet 20 1992 February 9 15 Geoff Bodine Bud Moore Engineering Ford 20 1993 February 7 3 Dale Earnhardt Richard Childress Racing Chevrolet 20 1994 February 13 24 Jeff Gordon Hendrick Motorsports Chevrolet 20 1995 February 12 3 Dale Earnhardt Richard Childress Racing Chevrolet 20 1996 February 11 88 Dale Jarrett Robert Yates Racing Ford 20 1997 February 9 24 Jeff Gordon Hendrick Motorsports Chevrolet 20 1998 February 8 2 Rusty Wallace Penske Racing Ford 25 1999 February 7 6 Mark Martin Roush Racing Ford 25 2000 February 13 88 Dale Jarrett Robert Yates Racing Ford 25 2001 February 11 20 Tony Stewart Joe Gibbs Racing Pontiac 70 2002 February 10 20 Tony Stewart Joe Gibbs Racing Pontiac 70 2003 February 8 8 Dale Earnhardt, Jr. Dale Earnhardt, Inc. Chevrolet 70 2004 February 7 88 Dale Jarrett Robert Yates Racing Ford 70 2005 February 12 48 Jimmie Johnson Hendrick Motorsports Chevrolet 70 2006 February 12* 11 Denny Hamlin Joe Gibbs Racing Chevrolet 72* 2007 February 10 20 Tony Stewart Joe Gibbs Racing Chevrolet 70 2008 February 9 88 Dale Earnhardt, Jr. Hendrick Motorsports Chevrolet 70 2009 February 7 29 Kevin Harvick Richard Childress Racing Chevrolet 78* 2010 February 6 29 Kevin Harvick Richard Childress Racing Chevrolet 76* 2011 February 12 22 Kurt Busch Penske Racing Dodge 75 2012 February 18 18 Kyle Busch Joe Gibbs Racing Toyota 82* 2013 February 16 29 Kevin Harvick Richard Childress Racing Chevrolet 75 2014 February 15 11 Denny Hamlin Joe Gibbs Racing Toyota 75 2015 February 14 20 Matt Kenseth Joe Gibbs Racing Toyota 75 2016 February 13 20 Denny Hamlin Joe Gibbs Racing Toyota 79* 2017 February 19* 22 Joey Logano Team Penske Ford 75 2018 February 11 2 Brad Keselowski Team Penske Ford 75 == References == Category:1970s establishments in Florida Category:1979 establishments in the United States Category:NASCAR races Category:Monster Energy NASCAR Cup Series races Category:1979 in sports",
 "title": "Advance Auto Parts Clash"
}