{
 "id": "651487",
 "text": "KFUO (850 AM) is a Christian radio station in St. Louis County, Missouri. It can be heard locally on the radio, and it also streams online. It is the longest-running Christian radio station in the United States. The Lutheran Church–Missouri Synod (LCMS) owns and runs the station. It broadcasts talk programs about the Bible, theology, and society. It also plays Lutheran sacred music. The station broadcasts four Lutheran church services on the weekends. KFUO's studios are in the LCMS headquarters in Kirkwood, Missouri. The transmitter is located at Concordia Seminary in Clayton. KFUO broadcasts on the same frequency as KOA (AM) in Denver, Colorado. KOA is a clear-channel station. Because of this, KFUO must stop at night. The station's website plays sacred music when the 850 AM signal is off the air. ==History== On February 19, 1923, Richard Kretzschmar said that there should be a Lutheran radio station. This happened at a meeting of the Board of Control of Concordia Seminary. Then they raised money from students and other Lutheran organizations. Then they started a \"radio committee\" to oversee the project. Soon afterwards, construction for the station began at the seminary. At this time, it was located in St. Louis. The control room and studio for the station were located in the attic of one of the seminary buildings. The license to broadcast was issued on October 25, 1924. The station went on air for the first time the next day. It broadcast a speech about the laying of the cornerstone for the new seminary being constructed in Clayton. The station was formally dedicated and began regular broadcasting on December 14, 1924. In 1927, the station moved to the new campus of Concordia Seminary in Clayton. At first, KFUO had to share frequences with other stations. The FCC approved the station to move to 830 kHz on July 1, 1940. By September 1941, the FCC reassigned the station to 850 kHz, where it has remained to this day. It also received a \"limited time\" license because this was the same frequency as KOA in Denver. KFUO can only operate between 80.5 and 102.5 hours per week. The exact hours depend on the times of sunrise and sunset in Denver. The LCMS started the FM station KFUO-FM at 99.1 MHz in 1948. At first, the FM station broadcast the same thing as the AM station. In 1975, KFUO-FM switched to broadcasting classical music. In March 2010 the FM station was sold to Gateway Creative Broadcasting. On July 7, 2010 of that year it switched to a Contemporary Christian format. In response to a petition filed in 1990 by the NAACP,Paul Devantier, \"The Good Fight,\" _The Lutheran Witness_ , Sept. 2024, 15–17. the FCC said that the LCMS's radio stations had violated the FCC's Equal Employment Opportunity requirements. The FCC said that KFUO and KFUO-FM did not hire enough minorities, women, and non-Lutherans. The LCMS lost an appeal within the FCC, and then appealed to the United States Court of Appeals for the District of Columbia Circuit. That court found, in Lutheran Church–Missouri Synod v. FCC (1998), that the FCC's requirements were unconstitutional. KFUO began streaming its broadcast on the station's web site, kfuo.org, in 1998. In 2004, KFUO started its HD radio station, the first in Missouri. In 2008, there was a controversy about the theological talk show, Issues, Etc.. The program was removed from the station on March 18. The producer and host were also fired. Three weeks later, the management of KFUO announced that Issues, Etc. was canceled because the station did not have enough money for it. The station did not make its financial information public. About 75 people had a peaceful protest outside the LCMS International Center to question the station's motives. More than 7,000 people signed a petition online to ask for the program to be returned. The program started again on another local Christian radio station on June 30, 2008. On March 13, 2012, the program returned to KFUO. The company that now produces it, Lutheran Public Radio, now pays KFUO for airtime. The studios of KFUO were moved to the LCMS International Center, the LCMS's headquarters in Kirkwood, Missouri, on June 24, 2013. The transmitter is still located at Concordia Seminary. == References == ==Other websites== * Category:Radio stations in the United States Category:Lutheranism",
 "title": "KFUO"
}