{
 "id": "651460",
 "text": "Discworld is a series of fantasy books by the English author Terry Pratchett (1948-2015). There are 41 novels in total as well as short stories and guidebooks. All of them are set on the Discworld, which is a flat planet balanced on the back of four elephants who stand on the back of a giant turtle. Make believe creatures like dragons, dwarves and elves live on the Discworld. ==Storylines== The Discworld books follow lots of different characters and storylines. Sometimes, the same main characters are used in several books to create a story arc: ===Rincewind=== Rincewind was the first main character in Discworld books. He is a wizard who does not know any spells and tries to run away from everything. Even though he is a coward, he saves the world several times by accident. ===Death=== Death is seen in all the Discworld books except for The Wee Free Men and Snuff. He is a seven foot tall skeleton who appears when people die to take their souls to the afterlife. Even though he is seen as frightening, he is sometimes kind to people. He especially likes cats. ===City Watch=== The City Watch is a police force in one of the main cities on the Discworld. At the beginning of the series, there are only a few members of the City Watch and they are lazy and useless. Later in the series, they grow to have many members and stop crimes around the city. ===Witches=== The main witch in the series is Granny Weatherwax. She seems not to like most people but still helps to heal them when they are sick and deliver babies. ==Novels== No. Title Published Subseries Notes 1 The Colour of Magic 1983 Rincewind 93rd in the Big Read. 2 The Light Fantastic 1986 Rincewind Continues from The Colour of Magic 3 Equal Rites 1987 Witches 4 Mort 1987 Death 65th in the Big Read 5 Sourcery 1988 Rincewind 6 Wyrd Sisters 1988 Witches 135th in the Big Read 7 Pyramids 1989 Djelibeybi British Science Fiction Award winner, 1989 8 Guards! Guards! 1989 City Watch 69th in the Big Read 9 Eric 1990 Rincewind Published in a larger format and fully illustrated by Josh Kirby 10 Moving Pictures 1990 Industrial Revolution 11 Reaper Man 1991 Death 126th in the Big Read 12 Witches Abroad 1991 Witches 197th in the Big Read 13 Small Gods 1992 Omnia 102nd in the Big Read 14 Lords and Ladies 1992 Witches 15 Men at Arms 1993 City Watch 148th in the Big Read 16 Soul Music 1994 Death 151st in the Big Read 17 Interesting Times 1994 Rincewind 18 Maskerade 1995 Witches 19 Feet of Clay 1996 City Watch 20 Hogfather 1996 Death 137th in the Big Read; British Fantasy Award nominee, 1997 21 Jingo 1997 City Watch 22 The Last Continent 1998 Rincewind 23 Carpe Jugulum 1998 Witches 24 The Fifth Elephant 1999 City Watch 153rd in the Big Read; Locus Fantasy Award nominee, 2000 25 The Truth 2000 Industrial Revolution 193rd in the Big Read 26 Thief of Time 2001 Death 152nd in the Big Read; Locus Award nominee, 2002 27 The Last Hero 2001 Rincewind Published in a larger format and fully illustrated by Paul Kidby 28 The Amazing Maurice and his Educated Rodents 2001 Überwald A YA (young adult or children's) Discworld book; winner of the 2001 Carnegie Medal 29 Night Watch 2002 City Watch Received the Prometheus Award in 2003; came 73rd in the Big Read; Locus Award nominee, 2003 30 The Wee Free Men 2003 Tiffany Aching The second YA Discworld book; also published in larger format and fully illustrated by Stephen Player 31 Monstrous Regiment 2003 Industrial Revolution The title is a reference to The First Blast of the Trumpet Against the Monstruous Regiment of Women; 2004 nominee for Locus Award for Best Fantasy Novel. 32 A Hat Full of Sky 2004 Tiffany Aching The third YA Discworld book 33 Going Postal 2004 Moist von Lipwig Locus and Nebula Awards nominee, 2005 34 Thud! 2005 City Watch Locus Award nominee, 2006 35 Wintersmith 2006 Tiffany Aching The fourth YA book. 36 Making Money 2007 Moist von Lipwig Locus Award winner, Nebula nominee, 2008 37 Unseen Academicals 2009 Rincewind Locus Award Nominee, 2010 38 I Shall Wear Midnight 2010 Tiffany Aching The fifth YA book, Andre Norton winner, 2010\"2010 Nebula Awards Winners\", Locus Online, 21 May 2011, accessed 22 May 2011. 39 Snuff 2011 City Watch Third fastest selling book in first week of publication 40 Raising Steam 2013 Moist von Lipwig 41 The Shepherd's Crown 2015 Tiffany Aching The sixth YA book, Completed mid-2014 and published posthumously in 2015 == References == Category:Books by Terry Pratchett",
 "title": "Discworld"
}