{
 "id": "651551",
 "text": "Dareen Tatour (Arabic: دارين طاطور, born April 16, 1982 in Reineh) is a Palestinian poet and photographer. She wrote an Arabic book called The Final Invasion, which she published in 2010. In 2017, an English anthology of Palestinian poets called A Blade of Grass: New Palestinian Poetry included translations of her writing. She is a citizen of Israel. == Imprisonment == She was arrested in 2015 by Israeli police. They accused her of terrorism and inciting violence. Then her trial became famous and many free speech activists defended her. In May 2018 she was found guilty, and in July 2018 she was sent to prison for six months. She served 42 days in prison and was set free on September 20, 2018. ===Trial=== At Tatour's trial, a police officer translated her poem, \"Resist them, my people, resist them.\"Israeli Arab Poet Dareen Tatour Gets Five-month Sentence for Incitement on Social Media, Haaretz, 31 July 2018 This police officer was not a professional translator and did not have experience with literature. Tatour's defense team invited a professional translator. Tatour's accusers said the professional translator was biased. Tatour's accusers also showed one of her Facebook posts. It said \"I am the next martyr.\" They claimed that this meant she was planning terrorism. They also showed that she had shared the Facebook status of a terrorist group. Tatour's defense team invited literature professors to her trial. They said that the Russian Empire and British Mandate of Palestine did not put Jewish writers on trial for \"much harsher words.\" ===Protests=== Many writers protested her arrest. In June 2016, there was a protest in Tel Aviv. Almost 20 poets, writers and translators read their writing.https://www.haaretz.co.il/1.2987602 ) Newspaper articles and advertisements called for her release. ( http://www.news1.co.il/Archive/003-D-111607-00.html Sami Michael wrote that her arrest showed that Israel was helpless and its culture had failed. He said that Israel could not defend itself but could only make writers be quiet. The poet Lilach Weber also wrote a poem about her. In October 2016 more than 180 poets, writers and intellectuals asked for her freedom. Four of them were winners of the Israel Prize: A. B. Yehoshua, Tuvia Rivner, Avishai Margalit and Shimon Sandbank. The statement said Tatour was \"arrested and tried for writing a poem.\" They believed this went against \"democracy, free speech and creativity.\" They added that it made it difficult for Arabs and Jews to talk to each other and end the Arab-Israeli conflict. A poet and activist named Tal Nitzan led these efforts. After she was found guilty, PEN International wrote that she was only doing her job as a writer: \"we use our words to peacefully challenge injustice.\"https://www.bbc.com/news/world-middle-east-43990577 BBC === Freedom === Tatour was set free on September 20, 2018. == Sources == == Other websites == * \"Resist them, my people, resist them\" * Interview in Salon * Interview in Ha'aretz * Interview in Warscapes * Interview in +972 Category:1982 births Category:Photographers Category:Palestinian poets Category:Palestinian artists",
 "title": "Dareen Tatour"
}