{
 "id": "651768",
 "text": "Michael A. Sheehan (February 10, 1955 – July 30, 2018) was an American author, former government official and military officer. Sheehan is the author of the book Crush the Cell: How to Defeat Terrorism Without Terrorizing Ourselves Random House – Listing for Crush the Cell: How to Defeat Terrorism Without Terrorizing Ourselves Op-Ed Contributor - The Hatfields and McCoys of Counterterrorism - NYTimes.com ==Early life== Sheehan was born in Red Bank, New Jersey. He studied at the Christian Brothers Academy and graduated in 1973. He would go on to study at United States Military Academy, Georgetown University and at the United States Army Command and General Staff College. ==Military career== Sheehan was a colonel in the United States Army being part of the Special Forces. His stations were located in Panama, South Korea and El Salvador focusing on counter-terrorism. ==Political career== He was a Distinguished Chair at the U.S. Military Academy in West Point, New York and a terrorist analyst for NBC News. Sheehan was the U.S. Ambassador-at-Large for Counter Terrorism from 1998 to 2000 during the Bill Clinton administration. Afterwards, from 2003 to 2006, Sheehan worked for the New York City Police Department Counter-Terrorism Commission. Sheehan was later the Assistant Secretary of Defense for Special Operations/Low Intensity Conflict & Interdependent Capabilities from 2011 to 2013 during the Barack Obama administration. ==Death== Sheehan died in Bethesda, Maryland from multiple myeloma on July 30, 2018, aged 63. ==References== ==Other websites== * New York Times, May 6, 2006 – \"City to Lose Man Who Led Terror Fight\", by William K. Rashbaum * Probe of USS Cole Bombing Unravels Washington Post May 4, 2008 Category:1955 births Category:2018 deaths Category:Deaths from multiple myeloma Category:Cancer deaths in Maryland Category:American political writers Category:Military people from New Jersey Category:American colonels Category:Politicians from New Jersey Category:Writers from New Jersey Category:Politicians from New York City Category:Writers from New York City",
 "title": "Michael A. Sheehan"
}