{
 "id": "651701",
 "text": "Carlos José Almenar Otero (March 21th, 1926 - August 7th, 2018) was a well- recognized and successful Venezuelan singer-songwriter, music professor, and TV personality. He was President of the Almenar Otero Foundation which he founded in 1989 in Venezuela Carlos Almenar Otero recorded more than 50 albums in four different languages: German, Italian, English, and Spanish. During the 50's and 60's he made concert tours in more than 15 countries. He was known for his songs \"Cara Mia\" \"Bella Maria\" \"Arpa, mar y llano\", and \"Ven a mis brazos\". He was also a singing professor and vocal coach of Venezuelan singers Gioconda, Maximo Manuel, Edward Mena, among others. ==Early Life== Carlos Almenar Otero, also known as \"El Profesor\" (The Professor) was born in Caracas, Venezuela, on March 21st, 1926. His father was a Navy officer in Venezuela, and most of his family members were closely related to the military. Almenar developed a great passion for music in his youth. However, few years after graduating from high school, he decided to enlist at the Naval Academy to follow in his dad’s steps. Nevertheless, a military life was not in Carlos’ destiny. In 1951, he participated in a singing contest in Brazil “El Gran Caruso” sponsored by the Metro-Goldwyn-Mayer. Although he placed third, this was considered by many a great success for a young unknown singer. The following year he decided to give up his career as a Navy officer to embark in what would become one of the most remarkable careers in the history of Venezuela's music. When he was 25, Carlos departed to Europe to study opera at the well-known Giuseppe Verdi Conservatory in Italy on a government scholarship. Almenar studied with Professor Nino Piccaluga, a popular Italian tenor, and Professor Paula Schreck (of Vienna) on how to sing using Professor Otto Iro’s special respiratory technique: a technique that has been the foundation of El Maestro’s breathing training called “Entrenamiento Respiratorio Vocal Fisiologico” (Respiratory Vocal Physiological Training). Carlos Almenar Otero successfully used this technique to sing and teach students throughout his entire career with outstanding results. == Career and World Tours == Following his training in Europe, he returned to Venezuela in 1955 and held his first professional presentation on Radio Caracas (Caracas’ main radio station) and at the Teatro Nacional (National Theater) in 1956. He soon started to receive international recognition. After the success of “El Gran Caruso” back in 1951, a few years later, Metro-Goldwyn-Mayer invited Carlos to perform in Germany for the Berlin Film Festival with the American actor and opera singer Mario Lanza. During this time, he also debuted in the opera with The Barber of Seville (El Barbiere di Siviglia) at the Teatro Nuovo (New Theater) in Italy. The following year he did his first presentation on international television in Madrid, Spain. In 1959, he started a series of performances with some of the most recognized German radio stations: Radio Frankfurt with the Erich Boersel Symphony Orchestra; Radio Hamburg with the Alfred Hause Orchestra; Radio Koeln with the Werner Mueller Orchestra (Cologne); Radio Bayrischer Rundfunk (Munich); Radio Baden Baden with the Rolf-Hans Mueller Orchestra; and Radio Saarbruecken, with the Studio Orchestra. This series of events opened the door of stardom to Carlos Almenar Otero. His first popular hit came in the beginning of 1960 with “Bella Maria,” which was recorded in German. It sold more than 600,000 copies in Germany. This success opened the way for several concert tours in European countries. His second popular hit “Cara Mia” sold more than 800,000 copies. The success of Bella Maria and Cara Mia led to several world tours in the United States, Japan, and Russia in the mid 1960s. After this long period of successful activities, he was selected by the Composers and Musicians Union of Germany to represent Germany in a prominent international song festival, with a song composed by Hans Blum (a famous German composer), and was subsequently offered German citizenship. In the late 1960s he began a recording project with the National Philharmonic Orchestra of London, conducted by Frank Barber. During these years, under Deutsche Grammophon (Polydor) contract, Carlos recorded 54 albums in four different languages, and performed tours in Austria, Switzerland, Germany, Holland, Belgium, and Denmark. After this successful career, Carlos Almenar Otero returned to Venezuela in 1980 to dedicate his success and knowledge to his home country. He specialized in recording with large local orchestras, hosted a radio series “Historia del Bel Canto” (the History of Bel Canto) for Radio Nacional (National Radio), and acted as the Chairman of the jury for the popular TV series “Cuanto Vale el Show,” (What’s your show worth?) a TV show similar to American Idol. The TV series increased Carlos’ popularity in Venezuela and it became the most popular show in the country for over 16 years (1985-2001). The series was also broadcasted in the U.S. and Latin America on DirectTV for over 8 years. In 1987, he was elected as Chairman of the Board of Directors of the Venezuelan Composers Union. Then, in 1989, he founded the Almenar Otero Foundation to help young musicians of Venezuela. In 1994, Almenar wrote his first book titled El Estudio de la Voz (the Study of the Voice). In the book, he enriched Professor Otto Iro’s masterwork Wissenschaftliche Stimmbildung (Scientific Voice Studies) with his own professional experiences of more than fifty years, and created the “Entrenamiento Respiratorio Vocal Fisiologico” (Respiratory Vocal Physiological Training). ==Later Career and Death== In 2003, he moved to Miami, Florida to start an arts academy and expand the Almenar Otero Foundation to North America. Almenar released his first training video (DVD) in 2004 called “El Maestro de la Voz” (The Master of the Voice). In 2006, he established the Science of the Voice School for singers, actors and professors, at the Dr. Jose Maria Vargas University in Pembroke Pines, Florida. Although the school closed a year after its creation, the Professor opened his private arts school and started his foundation as an official non- profit 501(c) organization in the city of Doral. Living Family Member Almenar Otero died on August 7th, 2018 from pneumonia in Miami, Florida, at aged 92.El adiós de Carlos Almenar Otero, \"La voz de oro\" He was accompanied by his family and closed friends. His non-profit foundation is still operating out of Miami by Martiza Salcedo. ==References== Category:1926 births Category:2018 deaths Category:Deaths from pneumonia Category:Disease-related deaths in Florida Category:Singer-songwriters Category:People from Caracas",
 "title": "Carlos Almenar Otero"
}