{
 "id": "652170",
 "text": "William \"Caleb\" Cale Yarborough (March 27, 1939 - December 31, 2023) was a NASCAR Winston Cup Series driver and was one of the series personalities. == History == Yarborough is a three-time Winston Cup Champion, winning the series, 1976, 1977 and 1978. He is the only driver to only win three consecutive titles. His wins was placed at number 5, Yaroborough won the Daytona 500 five times in his career. His win coming from Wood Brothers Racing in his career, the second in 1977 for Junior Johnson, and back to back wins in 1983 and 1984, In 1984, he became the first driver to qualify for the Daytona 500 with a speed of . He was involved in a wreck in the 1979 Daytona 500. === Early career === As a young kid, Yaroborough attended the Southern 500 as a spectator without a ticket, by 1958, he was able to be competing in the Grand National Circuit, In 1965, He was involved in a wreck by Sam McQuagg, Yaroborough's car sailed over the guardrail after tangling with McQuagg's car, Yaroborough tried to make a pass with McQuagg, but their tenders touched Yaroborugh's car went airborne, The car came to rest against a telephone pole outside the track, Yaroborough, who was uninjured, said \"I knew I was in trouble when I saw the grass, because I knew there ain't no grass on the racetrack\", On February 25, 1968, he won his first big time race as he beat LeeRoy Yarbrough by less than a second to win the 1968 Daytona 500, Yarborough would win five more races incuding the Southern 500 by four car lengths above David Pearson. Early in his career, Yarborough competed in the Indianapolis 500, racing in 1966-1967 and 1971-1972. === Sports Illustrated Car Exposure === He captured his second Daytona 500 in 1977, It was so important that Sports Illustrated put him on cover after his second Daytona 500 win, one of the first stock car drivers that cover on the legendary sports magazine, (see A.J. Foyt). === Awards === * Yarborough was inducted by the International Motrosports Hall of Fame in 1993 * He was inducted in the National Motorsports Press Association Hall of Fame in 1994 * He was inducted in the court of legends at Charlotte Motor Speedway in 1996 * He was inducted in the Motorsports Hall of Fame of America in 1994. === Acting === Two episodes of the TV show The Dukes of Hazzard, was featured Cale playing himself, \"Cale comes to the Hazzard\" in 1984 and \"Cale meets the Hazzard in 1979\". === Death === Yarborough died under hospice care in Florence, South Carolina from problems caused by a \"rare\" genetic disorder on December 31, 2023. He was 84. == Related pages == * List of NASCAR drivers == References == Category:1939 births Category:NASCAR drivers Category:Sportspeople from South Carolina Category:2023 deaths Category:Disease-related deaths in South Carolina",
 "title": "Cale Yarborough"
}