{
 "id": "652109",
 "text": "The Monster Energy NASCAR All-Star Race is a race open to race winners from the previous season as well as the current season, plus full-time drivers who won the Monster Energy NASCAR Cup Series championship, Full time drivers who are not eligible compete in the Monster Energy Open, Each driver wins the first three stages or wins the fan vote earns a spot in the All-Star Race, The All-Star Race has a unique format, which changes frequently. The current format consists of one 30-lap stage, two 20-lap stages and one final 10-lap stage to determine the winner. The drivers who win the All-Star Race receive $1,000,000 with each stage win receiving a bonus prize. == Past winners == Year Driver Car # Owner Make 1985 Darrell Waltrip 11 Junior Johnson Chevrolet 1986 Bill Elliott 9 Harry Meiling Ford 1987 Dale Earnhardt 3 Richard Childress Racing Chevrolet 1988 Terry Labonte 11 Junior Johnson Chevrolet 1989 Rusty Wallace 27 Raymond Beadle Pontiac 1990 Dale Earnhardt 3 Richard Childress Racing Chevrolet 1991 Davey Allison 28 Robert Yates Ford 1992 Davey Allison 28 Robert Yates Ford 1993 Dale Earnhardt 3 Richard Childress Racing Chevrolet 1994 Geoff Bodine 7 Geoffery Bodine Ford 1995 Jeff Gordon 24 Hendrick Motorsports Chevrolet 1996 Michael Waltrip 21 Wood Brothers Racing Ford 1997 Jeff Gordon 24 Hendrick Motorsports Chevrolet 1998 Mark Martin 6 Roush Fenway Racing Ford 1999 Terry Labonte 5 Hendrick Motorsports Chevrolet 2000 Dale Earnhardt, Jr. 8 Dale Earnhardt, Inc. Chevrolet 2001 Jeff Gordon 24 Hendrick Motorsports Chevrolet 2002 Ryan Newman 12 Penske Racing Ford 2003 Jimmie Johnson 48 Hendrick Motorsports Chevrolet 2004 Matt Kenseth 17 Roush Fenway Racing Ford 2005 Mark Martin 6 Roush Fenway Racing Ford 2006 Jimmie Johnson 48 Hendrick Motorsports Chevrolet 2007 Kevin Harvick 29 Richard Childress Racing Chevrolet 2008 Kasey Kahne 9 Gillett Evernham Motorsports Dodge 2009 Tony Stewart 14 Stewart-Haas Racing Chevrolet 2010 Kurt Busch 2 Penske Racing Dodge 2011 Carl Edwards 99 Roush Fenway Racing Ford 2012 Jimmie Johnson 48 Hendrick Motorsports Chevrolet 2013 Jamie McMurray 1 Chip Ganassi Racing Chevrolet 2014 Jamie McMurray 1 Chip Ganassi Racing Chevrolet 2015 Denny Hamlin 11 Joe Gibbs Racing Toyota 2016 Joey Logano 22 Team Penske Ford 2017 Kyle Busch 18 Joe Gibbs Racing Toyota 2018 Kevin Harvick 4 Stewart Haas Racing Ford == References == Category:Sports in Charlotte, North Carolina Category:Monster Energy NASCAR Cup Series races",
 "title": "Monster Energy NASCAR All Star Race"
}