{
 "id": "652234",
 "text": "Steven Brent \"Steve\" Oedekerk (born November 27, 1961) is an American comedian, director, editor, producer, screenwriter and actor. Oedekerk is best known for his works with actor Jim Carrey and director Tom Shadyac.Micheal E. Hill, \"Comedian got start tormenting his mom\", Chicago Sun-Times, September 2, 1997, via=HighBeam Research, . He starred in the Ace Ventura franchise, on \"Thumbmation\" shorts and his movie Kung Pow: Enter the Fist (2002). ==Filmography== Year Film Director Writer Producer Notes 1987 Smart Alex 1991 High Strung 1995 Ace Ventura: When Nature Calls 1996 The Nutty Professor 1997 Nothing to Lose 1998 Patch Adams 2000 Nutty Professor II: The Klumps 2001 Jimmy Neutron: Boy Genius Nominated- Academy Award for Best Animated Feature 2002 Kung Pow! Enter the Fist 2002 Santa vs. the Snowman 3D Short film 2003 Bruce Almighty 2006 Barnyard 2007 Evan Almighty 2011 Cowboys & Aliens TBA Kung Pow! Tongue of Fury Announced Acting roles Year Film Role Notes 1987 Smart Alex Alex 1988 Casual Sex? Joey 1991 High Strung Thane Furrows 1997 Nothing to Lose Baxter 2002 Kung Pow! Enter the Fist The Chosen One 2002 Santa vs. the Snowman 3D Sno' Hellton Voice only 2006 Barnyard Snotty Boy / Mr. Beady / Pizza Twin #2 Voice only TBA Kung Pow! Tongue of Fury The Chosen One ===Television=== Year Title Director Executive Producer Writer Notes 1997 The O Show TV Movie 1999– Thumbs! 2001–2007 Crossing Jordan 2002–2006 The Adventures of Jimmy Neutron: Boy Genius 2007–2011 Back at the Barnyard Creator 2010–2013 Planet Sheen Co-creator Acting roles Year Title Role Notes 1989 Full House Himself Episode \"Star Search\" 1997 The O Show Himself TV Movie 1999– Thumbs! Multiple Voice Only 2007–2011 Back at the Barnyard Multiple ==References== ==Other websites== * *Steve Oedekerk on Internet Movie Database *O Entertainment on Internet Movie Database Category:1961 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:American television writers Category:American editors Category:Movie directors from Los Angeles Category:Movie producers from Los Angeles Category:Screenwriters from Los Angeles Category:Actors from Los Angeles Category:Comedians from Los Angeles",
 "title": "Steve Oedekerk"
}