{
 "id": "652309",
 "text": "Sylvester Turner (September 27, 1954 - March 5, 2025) was an American Democratic politician and lawyer. Turner was a member of the U.S. House of Representatives from Texas's 18th district from January 3, 2025 until his death two months later on March 5, 2025. He was the 62nd Mayor of Houston, Texas from 2016 to 2024. Turner was a member of the Texas House of Representatives from 1989 until 2016. ==Early life== Turner was born on September 27, 1954, in Houston, Texas, as the sixth of nine children. He studied at the University of Houston, where he was Speaker of the Student Senate. Turner earned a J.D. degree from Harvard Law School. ==Political career== Turner ran for mayor of Houston in 1991, losing in the runoff election to Bob Lanier. Turner won the 2015 election, defeating Bill King in the runoff by 4,082 votes out of 212,696 votes cast in the closest mayoral election in Houston history by percentage. In 2024, after the death of Sheila Jackson Lee, Turner announced his candidacy to fill her congressional seat and was nominated at the convention to replace her as the Democratic nominee in the November general election. He won the November 2024 general election. ==Death== In November 2022, Turner said that he had been diagnosed with bone cancer, for which he had surgery and received six weeks of radiation treatment. On the afternoon of March 4, 2025, Turner became sick at his office in Washington, D.C., but after receiving medical attention was able to attend President Donald Trump's address to Congress that evening. He was later reported to have been hospitalized before being discharge to his Washington home, where he died in the early morning of March 5 at the age of 70. He was the first member of the 119th Congress to die in office and the second incumbent representative for Texas's 18th district to die in a one-year period, after Sheila Jackson Lee. ==References== ==Other websites== * *Legislative page *Our Candidates page * Category:1954 births Category:2025 deaths Category:Mayors of Houston Category:United States representatives from Texas Category:Democratic Party (United States) politicians Category:African- American politicians Category:Lawyers from Houston Category:Deaths from bone cancer",
 "title": "Sylvester Turner"
}