{
 "id": "652354",
 "text": "Raheem Kassam (born 1 August 1986 in Hammersmith, London, United Kingdom) is a British activist, author, and former editor-in-chief of Breitbart News London. Kassam was a candidate in the November 2016 UKIP leadership election, but dropped out of the race in October 2016. == Biography == Raheem Kassam was born on 1 August 1986 in Hammersmith, London, United Kingdom. His parents were from Tanzania. They were of Gujarati origin. He was raised a Ismaili Muslim, but stopped believing in the faith many years ago. He is now an atheist, and was influenced by Christopher Hitchens. He studied politics at the University of Westminster in London. He was a national board member of the Conservative Future youth-movement. He was director of a campus anti-extremism group called Student Rights. He was against the London School of Economics accepting money from Gaddafi's Libya. His idols are Michael Gove, Margaret Thatcher, and Barry Goldwater. He worked at a Lehman Brothers call center, and later managed electoral campaigns in the UK and United States. He and others tried to create a British-version of the Tea Party movement. He and James Delingpole created Breitbart News London. Kassam left Breitbart in May 2018. In 2016, he said that Donald Trump would be a better president than Hillary Clinton. Kassam joined Nigel Farage in meeting Trump after the presidential election. In 2018, he claimed that London had become \"a shithole\" since the election of Sadiq Khan. === UKIP leadership election === Kassam's campaign slogan was \"Make UKIP Great Again.\" His activity online gave him negative attention. He viciously insulted multiple politicians, including First Minister of Scotland Nicola Sturgeon, UKIP leadership candidate Suzanne Evans, and Labour MP Angela Eagle. He called the Scottish National Party a \"National Socialist party.\" He later apologised. He called for a referendum on the right of women in the UK to wear the niqāb, claimed that US presidential candidate Donald Trump does not hold anti-Muslim views, and questioned the claims of sexual assault made against Trump. == References == Category:1986 births Category:Living people Category:English atheists Category:UK Independence Party Category:Politicians from London",
 "title": "Raheem Kassam"
}