{
 "id": "652312",
 "text": "London Nicole Breed (born August 11, 1974) is an American Democratic politician. She was the 45th Mayor of San Francisco from 2018 to 2025. She used to be supervisor for District 5, and was president of the Board of Supervisors from 2015 to 2018. == Early life == Breed was raised in San Francisco by her grandmother, Comelia Brown. Along with her grandmother, she lived with her siblings in public housing. In an interview, London talks about remembering being a little girl in her unsafe community. She clearly remembers seeing glass all over the street floors and graffiti on all of the walls. London was a very smart young girl, she loved school and all of her teachers knew she had a bright future ahead of her. In her teen years, Breed attended Galileo High School and soon after, the University of California. == Political career == In 2012, Breed was elected to the San Francisco Board of Supervisors. She became the president of this board. ===Mayoralty=== Breed became acting mayor after the death of Mayor Ed Lee. She served in this role from December 12, 2017 to January 23, 2018. Breed won the special election for mayor a few months. Her main opponents in the election were Mark Leno and Jane Kim. Breed was the first black woman and second woman to be elected mayor of San Francisco. She was sworn in as mayor on July 11, 2018. During her time as mayor, she has been a supporter of increasing housing in San Francisco, especially during the housing shortage. During her time as mayor, she also had low approval numbers. Some did not like how she handled important issues in the city, including homelessness, crime, and drug addiction. In June 2024, it was reported that 64% of people did not believe Breed should be reelected and she had a 66% disapproval rating. In November 2024, Breed lost her re-election campaign to philanthropist Daniel Lurie. ==References== Category:1974 births Category:Living people Category:Mayors of San Francisco Category:Democratic Party (United States) politicians Category:African-American politicians",
 "title": "London Breed"
}