{
 "id": "652468",
 "text": "The fediverse is many social media and internet software that can talk with each other. Federated social media allow people on different social media to like, follow, and comment on each other's profiles. Similar to e-mail, the fediverse is not owned by one person or company. Any person or company can make social media instances on the fediverse. And similar to email, these instances can connect and talk with each other. For example, Mastodon gGmbH has the fediverse instance “mastodon.social”, and Gmail has the email address “gmail.com”. A person on “mastodon.social” has the fediverse identity “@ username @mastodon.social”, and a person on “gmail.com” has the email address “ username @gmail.com”. But a “gmail.com” user can send an email to someone who uses a different email provider, like “hotmail.com”. Similarly, a “mastodon.social” user can comment on a post by someone who uses a different fediverse instance, like “mozilla.social”. == Federated networking services == Different fediverse software have different kinds of content. Some are for images, while others are for videos. Fediverse software have multiple instances. Some fediverse software, like Mastodon, have hundreds of instances that can connect with each other. Usually, people can use federated social media software by opening one of the software's instances in their web browser (Google Chrome, Firefox, Edge...), by using phone apps, or by using a web app. Popular fediverse software Networking service Similar networking service Popular instances Instance operator Open sign-up Mastodon Twitter mastodon.social Mastodon gGmbH, a German nonprofit Yes mstdn.social “stux”, a man from the Netherlands Yes Lemmy Reddit lemmy.world Ruud Schilders, from the Netherlands Yes lemmy.ml Lemmy's developers No Kbin Reddit kbin.social Yes fedia.io Yes Misskey Twitter misskey.io MisskeyHQ, a Japanese company Yes misskey.design Yes PeerTube YouTube the.jokertv.eu Yes Pixelfed Instagram pixelfed.social Daniel Supernault, Pixelfed's main developer Yes == References == Category:Free software Category:Social networking",
 "title": "Fediverse"
}