{
 "id": "65266",
 "text": "The Colossus of Rhodes was a huge statue of the Greek god, Helios built on the Greek island of Rhodes (approximate coordinates 36°27'04\"N, 28°13'40\"E) by Chares of Lindos (a student of Lysippos) between 294 and 282 BC. It was one of the Seven Wonders of the World before being destroyed in an earthquake. The Colossus of Rhodes was 70 cubits tall, (32 meters, 105 feet), making it the tallest statue of the ancient world.It was three-quarters the height of the Statue of Liberty (46.9 meters). == Construction == Chares of Lindos was commissioned to build the statue after the lifting of Demetrius I Poliorcetes' siege of Rhodes (305BC). It had a bronze core and was reinforced by iron. It stood 70 cubits (105 feet [32 metres]) high and stood beside Mandrákion harbour, perhaps shielding its eyes with one hand, as a representation in a relief suggests. It is technically impossible that the statue could have straddled the harbour entrance, and the popular belief that it did so dates only from the Middle Ages. Construction started in 294 BC and finished 12 years later. == Destruction == The statue was an intelligent \"advertising\" of the city that erected it, a tangible proof of its wealth and technology. Unfortunately, in 222 BC, about 60 years after its unveiling, the Colossus collapsed as its knees were wrecked by an earthquake. Falling wreckage is said to have demolished 30 homes. Despite its terrible fall, the statue did not cease to belong to the great wonders of the ancient world. Even after a hundred years its destruction, Antipater of Sidon , a writer of Greco-Spanish origin, included the Colossus in his catalog of the seven wonders of the world. In 654 AD, 900 years after the collapse of the Colossus, the Saracens plundered Rhodes and sold the metallic remains of the colossus. It is said that the buyer used 900 camels to transport the fragments to Syria . Thus the image of the god who once saved the city from the foreign invasion had a fate similar to that of the siege machines of Demetrius, which when sold financed the construction of the Colossus. == Notes == == References == * page 75 == Further reading == * Herbert Maryon, \"The Colossus of Rhodes\" The Journal of Hellenic Studies 76 (1956), pp. 68–86. A sculptor's speculations on the Colossus of Rhodes. * D. E. L. Haynes, \"Philo of Byzantium and the Colossus of Rhodes\" The Journal of Hellenic Studies 77.2 (1957), pp. 311–312. A response to Maryon. * M. H. Gabriel, BCH 16 (1932), pp 332–42. == Other websites == * Rhodes Guide * http://ce.eng.usf.edu/pharos/wonders/colossus.html Category:Seven Wonders of the World Category:Ancient Greek bronze sculptures Category:Ancient Greek statues Category:Buildings and structures in Ancient Greece Category:3rd-century BC works Category:Rhodes Category:3rd-century BC disestablishments",
 "title": "Colossus of Rhodes"
}