{
 "id": "652734",
 "text": "Timothy James Walz ( ; born April 6, 1964) is an American politician, former teacher and retired U.S. Army non-commissioned officer. Since 2019, he has been serving as the 41st governor of Minnesota. A member of the Minnesota Democratic–Farmer–Labor Party, he was the U.S. representative for Minnesota's 1st congressional district from 2007 to 2019. Walz was also the Democratic vice presidential nominee in the 2024 presidential election. Before entering politics, Walz was a history teacher in Nebraska and Minnesota. He was part of the National Guard and took part of Operation Enduring Freedom in the aftermath of the September 11 attacks. He was to re-elected to U.S. congress five times before resigning after being elected governor. His political views have been seen as progressive. During his first term as governor of Minnesota, Walz was in charge of the state's response to the George Floyd protests and COVID-19 pandemic. In his second term, he signed many laws into effect that gave paid time off, made cannabis legal, increased spending on infrastructure and environmental issues, codifying abortion rights, universal free school meals, and universal gun background checks. In July 2024, after President Joe Biden announced he would be ending his re-election campaign, Walz was seen as a possible running mate pick for Kamala Harris's presidential campaign. In early August 2024, Harris announced she had picked Walz as her running mate. ==Early life== Timothy James Walz was born on April 6, 1964, in West Point, Nebraska. His parents were Darlene Rose (née Reiman) and James F. Walz. Walz and his three siblings grew up in Valentine, Nebraska. His family moved to Butte, Nebraska while he was in high school because his father was sick with lung cancer. With his father's support, Walz took part in the Army National Guard when he turned 17. His father had served in the Korean War and paid for his education degree with the G.I. Bill. He wanted his son to have the same opportunity. Overall, Walz served in the National Guard for 24 years after enlisting in 1981.Brian Bakst, 'Citizen soldier' Walz honed leadership in uniform , Minnesota Public Radio News (October 3, 2018). Walz graduated from high school in 1982. A year later, his father died. In 1989, he earned a Bachelor of Science in social science education from Chadron State College. In 1995, he was arrested for a driving while being drunk and stopped drinking ever since. In 2001, Walz earned a Master of Science from Minnesota State University, Mankato. ==Early career== After high school, Walz worked in agriculture and manufacturing, and took part of the National Guard. He later went to college and got a teaching degree like his father. After graduating from Chadron State College, he was a teacher for a year in China where learned to speak some Mandarin Chinese. After returning from China, Walz became a teacher and coach in Alliance, Nebraska, where he met his wife, Gwen Whipple, a fellow teacher. He later moved to Mankato in Minnesota, where he worked as a geography teacher and coach at a local high school. He coached the football team to its first state championship in 1999. In 1999, Walz agreed to be the faculty advisor of the first gay-straight alliance at Mankato West High School. Walz and his wife also organized summer educational trips for high school students to China. Walz went to Europe as part of the National Guard's mission after the September 11 attacks for half a year to support Operation Enduring Freedom. Walz volunteered for Senator John Kerry's 2004 presidential campaign, and was soon hired as the campaign's coordinator for his county as well as a district coordinator of Vets for Kerry. He was inspired to volunteer in the presidential election after he took a group of students to a George W. Bush rally in Mankato, and was mad by the security team questioning one of his students' politics after they saw a Kerry sticker on a student's wallet. Walz retired as command sergeant major on May 15, 2005. Several of the non- commissioned officers who worked with Walz later accused him of faking his military rank for political gain and avoided being sent to Iraq in 2005. ==U.S. House of Representatives== Walz announced his candidacy for the United States House of Representatives in 2006. No one ran against him for the Minnesota Democratic–Farmer–Labor Party (DFL) nomination. He beat Republican U.S. Representative Gil Gutknecht in the general election on November 7, and took office on January 3, 2007. After being sworn-in in 2007, Walz became the highest-ranking retired enlisted soldier ever to serve in Congress. Walz served on the House Agriculture Committee, Committee on Veterans' Affairs, and the Armed Services Committee. Walz was against President Bush's plan to send more soldiers to Iraq. In his first week as a legislator, Walz cosponsored a bill to raise the minimum wage, voted for stem cell research and voted to allow Medicare to take part in pharmaceutical prices. He was also one of the most bipartisan members of the House. Even thought he represented a district that had usually voted Republican, some saw Walz's pollical views as moderate to liberal. He voted against the act to Prohibit Federally Funded Abortion Services and to advance the Affordable Care Act out of the House. He also voted to continue funding for military operations in Iraq and Afghanistan. Walz was re-elected in 2008 with 62% of the vote, becoming only the second non-Republican to win a second full term in the district. He won a third term in 2010, with 50% of the vote. He was re-elected again in 2012, 2014, and 2016. ==Governor of Minnesota== Walz announced he would run for governor after Governor Mark Dayton chose not to run for a third term. On November 6, 2018, Walz was elected governor, beating the Republican nominee, Hennepin County commissioner Jeff Johnson. Walz ran for re-election in 2022. He beat the Republican nominee Scott Jensen, 52.3% to 44.6%, in the November general election. Walz was sworn in as governor of Minnesota on January 7, 2019 in Saint Paul. Walz took the oath of with his lieutenant governor Peggy Flanagan. Walz spoke about education and healthcare reform in his inauguration speech. On May 26, 2020, the day after the murder of George Floyd, Walz and Lieutenant Governor Peggy Flanagan wanted justice and called the video of Minneapolis police officer Derek Chauvin kneeling on George Floyd's neck \"disturbing\". Walz said, \"The lack of humanity in this disturbing video is sickening. We will get answers and seek justice\". In response to riots in Minnesota, Walz sent in parts of the Minnesota National Guard on May 28, and then the full national guard it on May 30. President Donald Trump reacted well to Walz's actions by saying that he was \"very happy\" and that he did \"fully agree with the way [Walz] handled it … what [the Minnesota National Guard] did in Minneapolis was incredible\". Trump called Walz an \"excellent guy\". Trump also claimed credit for sending the Minnesota National Guard; however Walz's office said Trump had no impact on Walz's decision to send in the Minnesota National Guard. Walz's first response to the widespread protests following Floyd's murder was criticized by Republicans and other groups. He later responded to the murder by ordering the Minnesota legislature to meet for special sessions on legislation for police reform. After police reform failed to pass the first special session in June, a second special session was held in July. On July 21, the legislature passed major police reform legislation. Walz signed the legislation into law on July 23, 2020. In May 2023, Walz signed a law that increased the pay for people working for Uber and Lyft. That same year, he signed laws into effect that allowed paid time off, made cannabis legal, increased spending on infrastructure and environmental issues, codifying abortion rights, universal free school meals, and universal gun background checks. In late 2023, Walz was named chair of the Democratic Governors Association, where he was in charge of supporting other governors in very competitive races. He resigned after being selected as Kamala Harris's running mate. Kansas Governor Laura Kelly replaced him as chair. In September 2023, Walz signed the return of parts of Upper Sioux Agency State Park land to the Upper Sioux Community. In December 2023, Walz became the first governor in Minnesota's history to visit all 11 tribal nations in the state. In June 2024, five employees of the Minnesota-based nonprofit Feeding Our Future were found guilty of the largest COVID-related fraud scheme. A Minnesota state audit report that did not support the Walz administration's handling of the issue revealed that the Minnesota Department of Education failed to be in charge of the nonprofit and perform its due job, which Walz admits and has taken responsibility for. In June 2024, Walz signed the Minnesota Debt Fairness Act. The act stops health care providers from not giving medically necessary treatment because of any large medical debts and stops medical debt from affecting credit scores. ==2024 vice presidential campaign== On July 22, 2024, Walz announced his support for Vice President Kamala Harris's presidential campaign after President Joe Biden ended his re-election campaign from the 2024 presidential election. Walz was soon seen as a top candidate for Harris's running mate. During this time, Walz began calling former President Donald Trump and U.S. Senator JD Vance \"weird\". The term became popular and was used by many Democrats to criticize Trump, Vance and other Republicans. Many people saw Walz as a progressive choice for vice president, with U.S. Senator Bernie Sanders and former Speaker of the U.S. House of Representatives Nancy Pelosi both supporting Walz as Harris's running mate choice. On August 5, 2024, USA Today reported that Walz and Pennsylvania Governor Josh Shapiro were Harris's top two choices to be her running mate. The following day, Harris officially picked Walz as her running mate. Walz is the first sitting governor to be picked as a Democratic VP nominee since the 1924 presidential election. His pick as Harris's running mate was supported by people with different political views, including progressive Democratic U.S. Representative Alexandria Ocasio- Cortez, centrist independent U.S. Senator Joe Manchin, and moderate Republican former governor Larry Hogan. On August 21, 2024, the third day of the Democratic National Convention in Chicago, Walz officially accepted the Democratic nomination for vice president. In November 2024, the Harris-Walz ticket would lose the election to former President Donald Trump and Ohio Senator JD Vance. ==Political views== Walz is a supporter of making recreational cannabis use legal. He made it legal in Minnesota as governor. In 2022, he proposed creating a Cannabis Management Office. On May 30, 2023, he signed into law. Walz voted in favor of the American Recovery and Reinvestment Act during his time in Congress. He also wanted to add parts to the act that would support the funding of public school buildings. He also supports lowering tuition costs. While in Congress, Walz was a strong supporter of gun rights. After the Parkland high school shooting in 2018, he criticized the NRA and announced that he would donate the same amount the NRA had given to his congressional campaigns to organizations that support gun control. As governor, Walz supported gun regulation. In 2023, he signed into law a public safety bill that creates universal background checks in Minnesota. In 2023, Walz signed a laws that helped workers in Minnesota and labor unions. He supported a law that gave sick leave for employees and increased safety inspections. He also supported a law that gave construction workers stronger protections against wage theft. Walz supports LGBTQ rights and anti- discrimination laws against someone's sexual orientation. In a 2009 speech, he called for an end to the Don't ask, don't tell policy. In 2011, Walz announced his support for the Respect for Marriage Act. As governor, Walz has signed a number of bills that support the LGBTQ community. In 2023, he signed a bill that banned conversion therapy and another that protected gender-affirming care in Minnesota. Walz supports abortion rights, and has a 100% rating from Planned Parenthood. ==Personal life== Walz and his wife, Gwen Whipple, married in 1994. They lived in Mankato, Minnesota, for nearly 20 years before moving to Saint Paul with their two children, Hope and Gus. Before their children were born, the Walzes had infertility issues and had fertility treatment at Mayo Clinic for seven years before their children were born in 2001 and 2006. Walz is Lutheran. Walz owns a restored International Scout off-road vehicle. The Walz family has a dog named Scout and a cat named Honey. According to financial records made while he was in Congress, Walz and his wife have owned no stocks and their pensions are their only known asset. The Walzes reported income of $166,000 on their 2022 tax returns, making Walz among the least wealthy candidates ever to run for vice president. ==References== ==Other websites== * Official website of Harris Walz campaign * Governor Tim Walz official government website * * * Tim Walz Biography Category:1964 births Category:Living people Category:Governors of Minnesota Category:United States representatives from Minnesota Category:Politicians from Nebraska Category:Democratic Party (United States) politicians Category:People from Mankato, Minnesota Category:Educators from Nebraska Category:Educators from Minnesota Category:21st-century American politicians Category:2024 United States vice-presidential candidates Category:Military people from Minnesota Category:Military people from Nebraska Category:American LGBT rights activists Category:American progressives Category:American Lutherans Category:American teachers",
 "title": "Tim Walz"
}