{
 "id": "653064",
 "text": "\"Dangerous Woman\" is a song recorded by American singer Ariana Grande. It is the lead single for her third studio album of the same name (2016). It was co- written and produced by Johan Carlsson and Ross Golan. The recording was released as the first single from the album on March 11, 2016, the same date of the album's pre-order on iTunes Store. With \"Dangerous Woman\" debuting at number ten on the US Billboard Hot 100, Grande became the first artist to reach the top ten of the chart in the opening charting week with every lead single of her three studio albums. The song was nominated for a Grammy Award for Best Pop Solo Performance. == Credits and personnel == Credits adapted from the liner notes of Dangerous Woman. ;Recording and management * Recorded at MXM Studios (Stockholm, Sweden) * Mixed at MixStar Studios (Virginia Beach, Virginia) * Mastered at Sterling Sound (New York City, New York) * Published by MXM — administered by Kobalt — (ASCAP), Warner-Tamerlane Publishing Corp. (BMI) and Back in Djbouti (BMI) * All rights administered by Warner-Tamerlane Publishing Corp. and MXM — administered by Kobalt — (ASCAP) ;Personnel * Ariana Grande – lead vocals, background vocals * Johan Carlsson – songwriting, production, vocal production, guitar, acoustic guitar, piano, synths, programming, tambourine, guitar solo * Max Martin – songwriting, production, vocal production, programming * Ross Golan – songwriting, background vocals * Serban Ghenea – mixing * John Hanes – mixing engineering * Sam Holland – engineering * Cory Bice – engineering * Peter Karlsson – engineering * Tom Coyne – mastering * Aya Merrill – mastering * Wendy Goldstein – artists and repertoire * Scooter Braun – artists and repertoire ==Charts== === Weekly charts === Chart (2016) Peak position Europe (Euro Digital Songs) 17 Greece Digital Songs (Billboard) 1 Lebanon (Lebanese Top 20) 9 Portugal (AFP) 15 South Korea International Chart (Gaon) 13 Venezuela English (Record Report) 24 ===Year-end charts=== Chart (2016) Position Australia (ARIA) 77 Canada (Canadian Hot 100) 41 Italy (FIMI) 93 Netherlands (Dutch Top 40) 96 UK Singles (Official Charts Company) 69 US Billboard Hot 100 36 US Mainstream Top 40 (Billboard) 21 US Rhythmic Songs (Billboard) 50 ==Certifications and sales== ==Radio and release history== Region Date Format Label Various March 11, 2016 Digital download Republic Italy Contemporary hit radio Universal United States March 15, 2016 Republic Rhythmic contemporary United Kingdom March 18, 2016 Contemporary hit radio Universal ==References== Category:2016 songs Category:Ariana Grande songs Category:Pop songs Category:R&B; songs",
 "title": "Dangerous Woman (song)"
}