{
 "id": "653461",
 "text": "Reggie Joiner (born August 20, 1960), was the CEO and founder of Orange, a division of The reThink Group, Inc, until voluntarily resigning after admitting to having inappropriate relationships with females, including the newly appointed CEO Kristen Ivy, who also is no longer employed by Orange. He is also one of the founders of North Point Community Church, where he served as the executive director of Family Ministry for 11 years.https://www.amazon.com/Reggie- Joiner/e/B002KGYUOO/ref=sr_ntt_srch_lnk_1?qid=1534774857&sr;=8-1 == Personal life == Joiner lives in Cumming, Georgia with his wife Debbie, where they raised four children into adulthood: Reggie Paul, Hannah, Sarah, and Rebekah. Reggie was the Youth Pastor at Sherwood Baptist Church in Albany, GA during the 1980's. Personal life and allegations In April 2024, Reggie Joiner, founder of the Orange ministry and reThink Group, was publicly accused of a long-term pattern of sexual misconduct and abuse by multiple individuals, including allegations of grooming a minor and engaging in inappropriate relationships. One survivor came forward with a detailed public statement describing years of grooming and abuse beginning when she was a teenager, which later became sexualized when she reached adulthood. The survivor also described efforts to share her testimony privately with the reThink board and legal investigators before making her account public, alleging that those efforts were met with dismissal, victim-blaming, and minimization. The reThink board of directors issued a statement on April 17, 2024, acknowledging “past inappropriate adult relationships” on Joiner’s part but did not describe the nature or extent of the alleged abuse. The board’s handling of the allegations, as well as the independence of the investigation conducted by its legal counsel, has been criticized by survivors and advocates. As of April 2025, no criminal charges have been publicly reported, but the allegations have prompted widespread conversation about abuse of power in ministry settings and the need for better accountability structures in faith-based organizations. == Authored books == *Lead Small: Five Big Ideas Every Small Group Leader Needs to Know. Orange, 2012. . *It's Just a Phase-So Don't Miss It: Why Every Life Stage of a Kid Matters and at Least 13 Things Your Church Should Do About It. Orange, 2015. *A New Kind of Leader: What You Believe Can Open a Door for a Kid or Teenager's Future. Orange, 2016. . *Parenting Beyond Your Capacity: Connect Your Family to a Wider Community. Orange, 2015. . *Don't Miss It: Parent Every Week Like It Counts. Orange, 2016. . == References == *Penguin Random House == Other websites == * Think Orange Category:1960 births Category:Christian religious leaders Category:American Christian writers Category:American Evangelicals Category:Living people Category:Writers from Atlanta",
 "title": "Reggie Joiner"
}