{
 "id": "65358",
 "text": "Diana, Princess of Wales (born Diana Frances Spencer; 1 July 1961 – 31 August 1997), was a member of the British royal family. She was the first wife of King Charles III, then-Princes of Wales. She was also the mother of Prince William and Prince Harry. Her activism and glamour made her an international icon which earned her enduring popularity. Born into the British nobility and grew up close to the royal family, living at Park House on their Sandringham estate. In 1981, while working as a nursery teacher's assistant, she became engaged to Charles, the eldest son of Queen Elizabeth II. Diana and Charles wedding took place at St Paul's Cathedral in July 1981 and made her Princess of Wales, a role in which she was enthusiastically received by the public. The couple had two sons, William and Harry, Diana and Charles separated in 1992, due to Charles's infidelity to Camilla Parker Bowles. They officially divorced in 1996. As Princess of Wales, Diana took on her royal duties and represented the Queen at functions across the Commonwealth realms. She was celebrated in the media for her beauty, style, charm, and later, her deep devotion to charity work. Her patronages were based on children and the elderly, but she later became known for her involvement the acceptance of AIDS patients and removal of landmines, both promoted through the International Red Cross. Diana also raised awareness and advocated for ways to help people affected by cancer and mental illness. She is widely regarded as a fashion icon of the 1980s and 1990s. In August 31, 1997, she was killed in a car accident along with her boyfriend and her driver in Paris and the incident led to extensive public mourning and global media attention. Her legacy has had a significant effect on the royal family and British society. ==Early life== Diana Frances Spencer was born on 1 July 1961 at Park House Hotel in Sandringham, Norfolk, England. Her father was the Earl Spencer. She left school when she was 16 years old and moved to London when she was 18 years old. ==Marriage, family and divorce== In 1981, Diana married Prince Charles at St. Paul's Cathedral. Their engagement became official on 24 February 1981. Before the engagement, she worked as a nursery teacher's assistant. Diana was the first Englishwoman to marry the first in line to the throne since Anne Hyde married James, Duke of York and Albany (later James VII and II), in the 1680s, and she was also the first royal bride to have a paying job before her engagement. Diana and Charles had two sons, Prince William and Prince Harry. Charles and Diana separated in 1992, and divorced in 1996. Diana said Camilla Parker-Bowles was responsible for the problems with her marriage. Diana was the first Englishwoman to marry an heir to the British throne in 300 years. Charles' brothers married commoners: Andrew, Duke of York, married Sarah Ferguson in 1986, and his youngest brother, Edward, Earl of Wessex, married Sophie Rhys-Jones in 1999. === Children === The couple had residences at Kensington Palace and Highgrove House, near Tetbury. On 5 November 1981, Diana's pregnancy was announced. In January 1982—12 weeks into the pregnancy—Diana fell down a staircase at Sandringham, suffering some bruising, and the royal gynaecologist Sir George Pinker was summoned from London; the foetus was uninjured. Diana later confessed that she had intentionally thrown herself down the stairs because she was feeling \"so inadequate\". On 21 June 1982, Diana gave birth to the couple's first son, Prince William. She subsequently suffered from postpartum depression after her first pregnancy. Amidst some media criticism, she decided to take William—who was still a baby—on her first major tours of Australia and New Zealand, and the decision was popularly applauded. By her own admission, Diana had not initially intended to take William until Malcolm Fraser, the Australian prime minister, made the suggestion. A second son, Prince Harry, was born on 15 September 1984. The Princess said she and Charles were closest during her pregnancy with Harry. She was aware their second child was a boy, but did not share the knowledge with anyone else, including Charles. Diana gave her sons wider experiences than was usual for royal children. She rarely deferred to Charles or to the royal family, and was often intransigent when it came to the children. She chose their first given names, dismissed a royal family nanny (and engaged one of her own choosing), selected their schools and clothing, planned their outings, and took them to school herself as often as her schedule permitted. She also organised her public duties around their timetables. ==Charity== Throughout her life, Diana was something of a rebel. Her work with victims of AIDS could, in some ways, be seen in this regard. She was one of the first very high profile people to be pictured touching those afflicted with AIDS, and this had a significant impact in changing people's opinions and attitudes to the disease. It was certainly a charity not following the protocol and tradition of the Royal family. As Princess Diana said: \"HIV does not make people dangerous to know. You can shake their hands and give them a hug. Heaven knows they need it.\" Diana had a very personable touch. She was very at ease in meeting people from any background and even if they were ill or in hospices. The patients would react very favourably to her meetings, they warmed to her life energy and heartfelt sympathy. Part of her appeal was her sympathy and natural compassion. She could empathise with people’s suffering, having suffered much herself. To the media, Diana often portrayed a very stoic and positive energy, but an aide suggested that at the same time these engagements often drained Diana emotionally at the end of some engagements she felt depleted. As well as working on charities such as AIDS she lent her name to the campaign to ban landmines. Her personal support is said to have been a significant factor in encouraging Britain and then other countries to support the Ottawa Treaty which sought to introduce a ban on the use of anti-personnel landmines. When Robin Cook brought the second reading of the landmines bill to the house in 1998 he made a point of paying tribute to the contribution of Princess Diana. ==Car accident and death== Diana, her driver and her boyfriend, Dodi Al-Fayed, were killed in a car accident in Paris, France, in the early morning of 31 August 1997. She was 36 years old. Many mourners left flowers, candles, cards and personal messages for her in public places. She was buried in London on 6 September 1997. Concerts for Diana took place shortly after her death. The concerts involved Elton John and numerous others. Elton John released a remake of his song, \"Candle in the Wind\" in memory of Diana. == Titles == * 1 July 1961 – 9 June 1975: The Right Honorable Diana Frances Spencer * 9 June 1975 – 29 July 1981: Lady Diana Frances Spencer * 29 July 1981 – 28 August 1996: Her Royal Highness The Princess of Wales, Her Royal Highness The Duchess of Cornwall, Her Royal Highness Countess of Chester * In Scotland: Her Royal Highness The Duchess of Rothesay, Her Royal Highness The Countess of Carrick, Baroness of Renfrew, Lady of the Isles * 28 August 1996 – 31 August 1997: Diana, Princess of Wales == References == == Other websites == * Last Will and Testament of Diana, Princess of Wales * Lord Stevens' Operation Paget Report Into The Death of Diana, Princess of Wales - published 14 December 2006 * H.M. Coroner of Surrey: The Official Inquest Into The Deaths of Diana, Princess of Wales & Dodi Al Fayed Category:1961 births Category:1997 deaths Category:Accidental deaths in France Category:English Anglicans Category:House of Windsor Category:People from Norfolk Category:Princes and Princesses of Wales Category:Road accident deaths Category:Charles III",
 "title": "Diana, Princess of Wales"
}