{
 "id": "65366",
 "text": "Dylan Mark Postl (born May 29, 1986) is an American midget professional wrestler. He is better known by his ring name Hornswoggle. Postl is best known for his time working for the WWE. He was the last holder of the old WWE Cruiserweight Championship. Postl originally wrestled under the name of \"The World's Sexiest Midget\" Shortstack. == Career == Prior to working for WWE, Postl was known for his work with NWA Wisconsin where he won its X Division Championship. === World Wrestling Entertainment === Postl signed with World Wrestling Entertainment in May 2006. He is the fourth wrestler from NWA Wisconsin to sign with WWE. The others were Daivari, Ken Kennedy and CM Punk. Postl first played the leprechaun partner of the Irish wrestler Finlay on SmackDown! during the May 26 episode. After Finlay’s victory over Paul Burchill, a little man (Postl) crawled out from under the ring and jumped on Burchill. Finlay pulled him off, only to slam him back down onto Burchill again. For the next few weeks he continued to appear from under the ring after matches. Eventually, SmackDown! commentator Michael Cole began calling him the Little Bastard. The name became popular and became his \"official\" name. Commentator JBL refused to call him \"Little Bastard\". JBL said, \"he might have parents\". He instead called him a leprechaun. This was confirmed on an edition of SmackDown! by Finlay. Little Bastard soon became meaner. He started attacking during Finlay's matches even though it upset Finlay. Many times, Finlay either shoved Little Bastard back under the ring or was forced to tackle him before he could hit the person he was wrestling. At one point, Little Bastard attacked Finlay, biting Finlay when Finlay tried to stop him from attacking Gunner Scott. Little Bastard was an important part of Finlay winning the United States Championship when he tossed him a shillelagh to knock out champion Lashley to win the match. On February 23, his name was changed to Hornswoggle on WWE's website and all references to the name \"Little Bastard\" were removed. The name change became official on the March 2 episode of SmackDown!. Postl attacked JBL and Michael Cole. Afterwards, Finlay told Cole that Little Bastard's name is Hornswoggle. Despite this, Cole sometimes still called Hornswoggle \"Little Bastard\". On July 22, 2007 at The Great American Bash Hornswoggle won the WWE Cruiserweight Championship. The other people in the match and commentators did not know that he was a participant in the match until the pin and he was given the belt.\"WWE.com\" 22 July 2007 - A leprechaun's pot o' Cruiserweight gold This made him the first person with dwarfism to win a Championship in WWE history. Hornswoggle is both the lightest and the shortest wrestler to win the Cruiserweight Championship in WWE history. He is also the smallest wrestler to win any title in WWE. On the September 10 episode of Raw, Hornswoggle was revealed to be WWE Chairman Mr. McMahon's illegitimate son. The storyline stopped on March 3, 2008 when it was confirmed Hornswoggle was Finlay's son. Hornswoggle and Finlay were drafted to ECW on June 25, 2008 as part of the 2008 WWE Supplemental Draft. On the July 9, 2012 episode of Raw, Hornswoggle was revealed as the anonymous Raw General Manager, who ran the brand from June 2010 to July 2011. Postl was released from WWE on May 6, 2016, ending his time there after 10 years. Afterwards, he sometimes appeared for the company: on April 27, 2018, in the Greatest Royal Rumble match (eliminating Dash Wilder, before being eliminated by Tony Nese), and on January 27, 2019, at Royal Rumble, chasing Zelina Vega during the Women's Royal Rumble match. === Free Agent === Since his release, Postl wrestles on the Independent circuit. He also wrestled for Impact Wrestling as Swoggle from 2016 to 2020 and for Ring of Honor in 2019 and made a cameo appearance on the November 18, 2020 episode of AEW Dynamite. == Filmography == Year Title Roles Notes 2014 Muppets Most Wanted Russian Prisoner 2014 Leprechaun: Origins Tuatha Dé Danann/Leprechaun credited as Dylan \"Hornswoggle\" Postl Web series Year Title Roles Notes 2013 Wreckless Eating Himself 1 episode 2013–2015 The JBL and Renee Show Himself, The Bear recurring role 2015 Swerved Himself 3 episodes 2018 Where Are They Now? Hornswoggle 1 episode == Other media == Postl made his video game debut as Finlay's manager in WWE SmackDown vs. Raw 2009 and last appeared in WWE SmackDown vs. Raw 2011. == Championships and accomplishments == *Absolute Intense Wrestling **Absolute Intense Wrestling Tag Team Championship (1 time) - with PB Smooth * ACW Wisconsin **ACW Tag Team Championship (1 time) - with Nick Colucci *Black Label Pro **BLP Tag Team Championship (1 time) with Ethan Page and Danhausen *Create-A-Pro **CAP Tag Team Championship (1 time) - with Mark Sterling *DDT Pro-Wrestling **Ironman Heavymetalweight Championship (2 times) *Great Lakes Championship Wrestling **GLCW Heavyweight Championship (1 time) *Heroes And Legends Wrestling **HLW Minis Championship (1 time) *NWA Wisconsin **NWA Wisconsin X Division Championship (1 time) *Pro Wrestling Illustrated **Rookie of the Year (2007) **Ranked No. 494 of the top 500 singles wrestlers in the PWI 500 in 2021 *South Shore Wrestling **SSW Tag Team Championship (1 time) - with Devin Diamond *Wisconsin Pro Wrestling **WPW Tag Team Championships (1 time) - with Nick Colucci *World Wrestling Entertainment **WWE Cruiserweight Championship (1 time, last) **Mini Royal Rumble (2008) *Wrestling Observer Newsletter **Worst Gimmick (2009) **Worst Feud of the Year (2009) * WrestleCrap ** Gooker Award (2007) Paternity storyline with Mr. McMahon ** Gooker Award (2009) Feud with Chavo Guerrero == Notes and references == == Other websites == * Category:1986 births Category:Living people Category:American professional wrestlers Category:Former WWE wrestlers Category:People with dwarfism Category:Professional wrestling authority figures Category:Professional wrestling managers and valets Category:Sportspeople from Wisconsin Category:People from Oshkosh, Wisconsin",
 "title": "Hornswoggle"
}