{
 "id": "653825",
 "text": "Maia McCall Mitchell (born 18 August 1993) is an Australian actress and singer. She is known for her roles as Brittany Flune in the children's television series Mortified, and as Natasha Ham in the teen drama Trapped. Mitchell starred in the drama The Fosters as Callie Adams Foster. She also co- starred in the Disney Channel original movies Teen Beach Movie and Teen Beach 2 as McKenzie. ==Filmography== ===Film=== Year Title Role Notes 2013 After the Dark Beatrice 2017 Hot Summer Nights Amy Calhoun 2018 Never Goin' Back Angela 2019 The Last Summer Phoebe 2022 No Way Out Tessa Also executive producer 2023 Sitting in Bars with Cake Liz 2024 Family Secrets Post-production 2025 Until Dawn Melanie Post-production ===Television=== Year Title Role Notes 2006–2007 Mortified Brittany Flune Main cast 2008–2009 Trapped Natasha Hamilton Main cast 2009 K-9 Taphony Episode: \"Taphony and the Time Loop\" 2011 Castaway Natasha Hamilton Main cast 2011 Zombies and Cheerleaders Claire Unsold TV pilot 2013 Teen Beach Movie McKenzie/Mack Disney Channel Original Movie 2013 Phineas and Ferb Herself Co-host (UK version only); episode: \"Musical Cliptastic Countdown\" 2013–2014 Jessie Shaylee Michaels 2 episodes 2013–2018 The Fosters Callie Adams Foster Main cast 2014 Jake and the Never Land Pirates Wendy Darling Voice role; episode: \"Battle for the Book\" 2015 Teen Beach 2 McKenzie/Mack Disney Channel Original Movie 2016–2019 The Lion Guard Jasiri Recurring voice role 2019–2024 Good Trouble Callie Adams Foster Main cast (seasons 1–4), guest (season 5); also executive producer 2023-present The Artful Dodger Lady Belle Fox Main cast ===Web=== Year Title Role Notes 2014 The Fosters: Girls United Callie Adams Foster 5 episodes ===Music videos=== Year Artist Title Notes 2019 Hayley Kiyoko \"I Wish\" ==Discography== ===Soundtrack albums=== List of albums, with selected chart positions Title Album details Peak chart positions US List of Lynch's albums and singles on Billboard: * Teen Beach Movie: US OST BEL CAN FRA NL NZ SPA UK Teen Beach Movie * Released: 16 July 2013 * Formats: CD, digital download * Label: Walt Disney 3 1 176 14 76 56 30 15 36 Teen Beach 2 * Released: 23 June 2015 * Formats: CD, digital download * Label: Walt Disney 10 1 — — 129 — — 67 — \"—\" denotes releases that did not chart or were not released in that territory. ===Charted songs=== List of singles, with selected chart positions Year Title Peak positions Album US Songs of Ross Lynch on Billboard: * Hot 100: * Bubbling Under Hot 100: IRL UK 2013 \"Like Me\" (with Ross Lynch, Grace Phipps & Spencer Lee) 101 — 177 Teen Beach Movie \"Can't Stop Singing\" (with Ross Lynch) — — 200 Teen Beach Movie \"—\" denotes releases that did not chart or were not released in that territory. ==Awards and nominations== Association Year Category Work Result Teen Choice Awards 2013 Choice Summer TV Star: Female The Fosters 2014 Choice TV Actress: Drama 2015 Choice Summer TV Star: Female Teen Beach 2 2016 Choice TV Actress: Drama The Fosters 2017 Choice Summer TV Star: Female 2019 Choice Drama TV Actress Good Trouble Choice Summer Movie Actress The Last Summer ==References== ==Other websites== * * * * Category:1993 births Category:Living people Category:Australian movie actors Category:Australian television actors Category:Australian voice actors Category:Actors from New South Wales Category:Singers from New South Wales Category:People from Lismore, New South Wales",
 "title": "Maia Mitchell"
}