{
 "id": "65394",
 "text": "Daniel Webster (January 18, 1782 – October 24, 1852) was an important American statesman. He first became famous because of his defense of New England shipping interests. Later in his life, he became more and more nationalistic and convinced many other people to become nationalists. That made Webster one of the most famous orators and powerful Whig leaders of the Second Party System. Webster did not like slavery, but he thought it was more important for the the United States to stay together than anything else. Webster became the northern member of a group known as the \"Great Triumvirate,\" which included his colleagues Henry Clay from the West and John C. Calhoun from the South. His \"Reply to Hayne\" in 1830 was generally seen as \"the most eloquent speech ever delivered in Congress.\"Allan Nevins, Ordeal of the Union\" (1947) 1:288 Webster tried to keep the nation from civil war and keep a firm peace. His efforts did not succeed, but he was still respected for them. He was officially named by the Senate in 1957 as one of its five best members. == Early life == Webster was born on January 18, 1782. His parents were Ebenezer and Abigail Webster (née Eastman) in Salisbury, New Hampshire, now part of the city of Franklin. He and his nine siblings grew up on his parents' farm. His great-great-grandfather was Thomas Webster (1631–1715), who was born in Ormesby St. Margaret, Norfolk, England, and settled in New Hampshire. As Daniel was a \"sickly child\", his family often let him have whatever he wanted and did not make him work on the farm.\"Daniel Webster.\" American Eras, Volume 5: The Reform Era and Eastern U.S. Development, 1815–1850. Gale Research, 1998. Student Resource Center. Thomson Gale. June 16, 2006. == Career == Webster became a lawyer and politician. He was elected to Congress as a Federalist. He supported free trade, opposed both abolitionism and the expansion of slavery, and opposed the War of 1812 and other policies of the Democratic-Republicans. When the Federalist Party declined, he joined with other former Federalists and National Democrats to form the Whig Party. Webster always supported national unity and harmony against various divisive schemes. == References == ==Other websites== * * Category:1782 births Category:1852 deaths Category:Lawyers from New Hampshire Category:American Protestants Category:National Republican Party politicians Category:Unitarians Category:United States representatives from Massachusetts Category:United States representatives from New Hampshire Category:United States Secretaries of State Category:United States senators from Massachusetts Category:Lawyers from Massachusetts",
 "title": "Daniel Webster"
}