{
 "id": "654001",
 "text": "This article lists census-designated places (CDPs) in the U.S. state of Louisiana. As of the 2020 census, there were a total of 184 census-designated places in Louisiana. == Census-designated places == CDP Population Parish Ama 1,290 St. Charles Amelia 2,132 St. Mary Arabi 4,533 St. Bernard Avondale 4,582 Jefferson Banks Springs 1,136 Caldwell Barataria 1,057 Jefferson Bawcomville 3,472 Ouachita Bayou Blue 13,352 Lafourche and Terrebonne Bayou Cane 19,770 Terrebonne Bayou Corne 32 Assumption Bayou Country Club 1,304 Lafourche Bayou Gauche 2,161 St. Charles Bayou Goula 514 Iberville Bayou L'Ourse 1,806 Assumption Bayou Vista 4,213 St. Mary Belle Chasse 10,579 Plaquemines Belle Rose 1,698 Assumption Belmont 305 Sabine Boothville 718 Plaquemines Bordelonville 458 Avoyelles Bourg 2,375 Terrebonne Boutte 3,054 St. Charles Branch 431 Acadia Bridge City 7,219 Jefferson Brownfields 5,145 East Baton Rouge Brownsville 4,353 Ouachita Buras 1,109 Plaquemines Cade 1,874 St. Martin Calhoun 670 Ouachita Cameron 315 Cameron Carlyss 5,101 Calcasieu Catahoula 988 St. Martin Cecilia 1,807 St. Martin Center Point 520 Avoyelles Centerville 499 St. Mary Chackbay 5,370 Lafourche Chalmette 21,562 St. Bernard Charenton 1,699 St. Mary Chauvin 2,575 Terrebonne Choctaw 775 Lafourche Claiborne 12,631 Ouachita Convent 483 St. James Crescent 811 Iberville Cut Off 5,533 Lafourche Darrow 200 Ascension Delacroix 48 St. Bernard Des Allemands 2,179 Lafourche and St. Charles Destrehan 11,340 St. Charles Deville 1,761 Rapides Dorseyville 159 Iberville Dulac 1,241 Terrebonne Eastwood 4,390 Bossier Echo 352 Rapides Eden Isle 7,782 St. Tammany Edgard 1,948 St. John the Baptist Egan 618 Acadia Elmwood 5,649 Jefferson Empire 905 Plaquemines Erwinville 2,275 West Baton Rouge Estelle 17,952 Jefferson Fifth Ward 921 Avoyelles Fort Jesup 494 Sabine Fort Johnson North 2,179 Vernon Fort Johnson South 7,950 Vernon Frierson 132 DeSoto Galliano 7,100 Lafourche Gardere 13,203 East Baton Rouge Garyville 2,123 St. John the Baptist Gillis 800 Calcasieu Glencoe 132 St. Mary Gloster 53 DeSoto Good Pine 259 La Salle Grand Point 2,241 St. James Gray 5,518 Terrebonne Hackberry 926 Cameron Hahnville 2,959 St. Charles Harvey 22,236 Jefferson Hayes 676 Calcasieu Hester 483 St. James Inniswold 5,987 East Baton Rouge Jefferson 10,633 Jefferson Jordan Hill 196 Winn Joyce 328 Winn Killona 724 St. Charles Kraemer 877 Lafourche Labadieville 1,715 Assumption Lacassine 490 Jefferson Davis Lacombe 8,657 St. Tammany Lafitte 1,014 Jefferson Lafourche Crossing 2,427 Lafourche Lakeshore 1,988 Ouachita Lakeview 818 Caddo Laplace 28,841 St. John the Baptist Larose 6,763 Lafourche Lawtell 1,066 St. Landry Lemannville 695 Ascension and St. James Lewisburg 420 St. Tammany Lockport Heights 1,171 Lafourche Longville 545 Beauregard Luling 13,716 St. Charles Lydia 892 Iberia Marrero 32,382 Jefferson Marthaville 90 Natchitoches Mathews 2,273 Lafourche Meraux 6,804 St. Bernard Merrydale 9,227 East Baton Rouge Metairie 143,507 Jefferson Midland 249 Acadia Midway 1,157 LaSalle Milton 2,590 Lafayette Minorca 2,156 Concordia Montegut 1,465 Terrebonne Monterey 474 Concordia Monticello 5,431 East Baton Rouge Montz 2,106 St. Charles Moonshine 168 St. James Morrow 149 St. Landry Moss Bluff 12,522 Calcasieu Natalbany 2,510 Tangipahoa New Orleans Station 2,508 Plaquemines New Sarpy 1,169 St. Charles Norco 2,984 St. Charles North Vacherie 2,093 St. James Oak Hills Place 9,239 East Baton Rouge Old Jefferson 7,339 East Baton Rouge Oretta 371 Beauregard Ossun 2,145 Lafayette Paincourtville 857 Assumption Paradis 1,242 St. Charles Paulina 1,778 St. James Perry 1,171 Vermillion Pierre Part 3,024 Assumption Pitkin 455 Vernon Pleasure Bend 212 St. John the Baptist Pointe a la Hache 183 Plaquemines Point Place 382 Natchitoches Port Sulphur 1,677 Plaquemines Poydras 2,536 St. Bernard Prairieville 33,197 Ascension Presquille 1,703 Terrebonne Prien 7,745 Calcasieu Prospect 380 Grant Raceland 9,768 Lafourche Red Chute 7,065 Bossier Reddell 904 Evangeline Reserve 8,541 St. John the Baptist Rio 137 Washington River Ridge 13,591 Jefferson Roanoke 491 Jefferson Davis Rock Hill 260 Grant Romeville 99 St. James St. James 592 St. James St. Maurice 266 Winn St. Rose 7,504 St. Charles Schriever 6,711 Terrebonne Shenandoah 19,292 East Baton Rouge Singer 303 Beauregard Siracusaville 297 St. Mary Sorrel 711 St. Mary South Vacherie 3,388 St. James Spokane 378 Concordia Starks 659 Calcasieu Start 982 Richland Sugartown 33 Beauregard Supreme 839 Assumption Swartz 4,354 Ouachita Taft 61 St. Charles Terrytown 25,278 Jefferson Timberlane 10,364 Jefferson Triumph 268 Plaquemines Trout 104 La Salle Union 735 St. James Venice 162 Plaquemines Ventress 800 Pointe Coupee Vienna Bend 1,314 Natchitoches Village St. George 7,677 East Baton Rouge Violet 5,758 St. Bernard Waggaman 9,835 Jefferson Wallace 755 St. John the Baptist Wallace Ridge 572 Catahoula Watson 956 Livingston Welcome 672 St. James Westminster 2,791 East Baton Rouge Woodmere 11,238 Jefferson ==References== ==Related pages== *List of cities, towns, and villages in Louisiana Louisiana",
 "title": "List of census-designated places in Louisiana"
}