{
 "id": "654179",
 "text": "Kansas Speedway is a motorsports complex in Kansas City, Kansas, United States, It is located from Wichita, Kansas, The speedway is owned by International Speedway Corporation. It was built in 2001 and holds two NASCAR race weekends, The Verizon IndyCar Series hosted events in 2011, The speedway hosts two Monster Energy NASCAR Cup Series races, one NASCAR Xfinity Series race and NASCAR Camping World Truck Series race, and NASCAR also hosts the ARCA Racing Series since October 7, 2011. == History == Construction began in May of 1999 of a new tri-oval, The facility would feature uniform 15 degree banking and boast seating for 72,000 spectators and more than 60 suites, The speedway was completed in 2001 in time for an inaugural test for stock cars and Indy Lights Series single seaters in April. The inaugural race weekend held in June of 2001 for the Winston West Series, ARCA Racing Series, NASCAR Winston Cup Series (now the Monster Energy NASCAR Cup Series), NASCAR Busch Series (now the NASCAR Xfinity Series and NASCAR Craftsman Truck Series (now the NASCAR Camping World Truck Series), also the Indy Racing League also made their debut in July, The first NASCAR Winston Cup Series race was won by Jeff Gordon in September. In the summer of 2012, the speedway announced track improvements including repaving of the existing track surface, reconfiguration of the oval, and the addition of the road course, The project immediately followed the STP 400 on April 22nd, The changes to the oval centered on the introduction of progressive banking over 17-20 degrees, with the front straightaway banked 9-11 degrees, and the back straightway 5 degrees, Portions of the field were graded and paved as part of the road course development. The repaving in particular drew praise to the NASCAR drivers when they attended a tire test in August of that year. SAFER barriers existed around of the concrete retaining walls between turns 1 and 2, and between turns 3 and 4 along most of the frontstretch. Also new in 2012 was the Hollywood Casino, which overlooks the track at turn 2, boasting 2,000 slot machines and gaming tables. On October 11, 2013, It was announced that NASCAR's lone event, the Bojangles' Southern 500 at Darlington Raceway and the spring race swapped dates in 2014, with the spring race becoming a night race and the fall race remained as a day race. == Track length of a paved oval == The track length is disputed by two major series run at Kansas Speedway, The NASCAR timing did not use a scoring use a length of . The IRL timing and scoring length of . == Related pages == * Auto Club Speedway * Daytona International Speedway * Darlington Raceway * Homestead-Miami Speedway * ISM Raceway * Chicagoland Speedway * Martinsville Speedway * Richmond Raceway * Michigan International Speedway * Talladega Superspeedway * Watkins Glen International == References == Category:NASCAR tracks Category:Kansas City, Kansas Category:2011 establishments in the United States Category:21st-century establishments in Kansas",
 "title": "Kansas Speedway"
}