{
 "id": "654119",
 "text": "The Denisovans or Denisova hominins are archaic humans in the genus Homo. They are extinct. They are either a species or a subspecies. == Discovery == They were first discovered in in the Denisova Cave in Siberia's Altai Mountains. Neanderthals and modern humans also lived in this cave at different times. A finger bone fragment of a juvenile female was discovered. She lived about 41,000 years ago. She had about 3% to 5% of the DNA of Melanesians and Aboriginal Australians, and around 6% in Papuans deriving from Denisovans.\"\"About 3% to 5% of the DNA of people from Melanesia (islands in the south-west Pacific Ocean), Australia, New Guinea and aboriginal people from the Philippines comes from the Denisovans\". Oldest human DNA found in Spain – Elizabeth Landau's interview of Svante Paabo == DNA analysis == The mitochondrial DNA (mtDNA) of the finger bone showed it was genetically distinct from Neanderthals and modern humans. The nuclear genome from this specimen suggested that Denisovans shared a common origin with Neanderthals.. DNA analysis has indicated that modern humans, Neanderthals, and the Denisova hominin last shared a common ancestor around years ago.Katsnelson, Alla 2010. New hominin found via mtDNA. The Scientist (24.03.10) The mtDNA analysis also suggested that this species migrated out of Africa between a migration by Homo erectus individuals and later ones by some ancestors of most modern humans. == Fossils == Through DNA analysis, scientists have identified the fossils of four distinct Denisovans from Denisova Cave: Slon, Viviane et al 2017. A fourth Denisovan individual. Science Advances 3 (7): e1700186. doi:10.1126/sciadv.1700186. PMC 5501502. PMID 28695206. * Denisova 2, a young female * Denisova 3, another young female * Denisova 4, an adult male * Denisova 8, another adult male === Anatomy === So far, a finger bone, a toe bone and two teeth are the only Denisovan body parts that have been found. The finger bone is from a woman. It is broader than a human finger. This fact suggests that Denisovans were more robust than any modern humans. === Mitochondrial DNA analysis === The mtDNA from the finger bone differs from that of modern humans by 385 nucleotides in the mtDNA strand out of approximately 16,500. This is more than the difference between modern humans and Neanderthals, which is around 202 bases. == References == Category:Hominins",
 "title": "Denisovan"
}