{
 "id": "654279",
 "text": "Endometriosis is a sickness that is caused by womb tissue that begins growing outside the womb. Endometriosis-afflicted tissues can be attached to the outer surface of the womb, Fallopian tubes, and the ovaries. Many women between 15 and 44 years-old may have this sickness. It is also found in women 30-40 years-old. If a woman has endometriosis, it can sometimes affect pregnancy. Endometriosis can be treated by a doctor, but it cannot be cured. Treating endometriosis may help a woman get pregnant. Women with endometriosis may have painful sex, a feeling of bloating, belly pain, difficult urination and blood in the urine. A woman could have menstrual problems as a result. If endometriosis is on the ovaries, cysts may grow. These areas may develop scar tissue. Some women have more of a risk of endometriosis than others. These are the risk factors: Never giving birth, short menstrual cycles, starting periods at young age, having heavy menstrual periods longer than seven days, going through menopause in older age, and having a relative with endometriosis. A woman can have endometriosis for a long time. It can be very painful. This sickness can be so painful that it affects many areas of life. Endometriosis is hard to find in some women. To find endometriosis a doctor may do many medical tests. These tests may be a pelvic exam and an ultrasound. When a woman has a pelvic exam the doctor will feel for lumps or scars. An ultrasound will help the doctor see endometriosis on the ovaries. The doctor may put a wand-shaped ultrasound probe into the vagina. An ultrasound scanner may be used on the abdomen. Another test may be used. It is called an MRI. The MRI takes a picture of the inside of the body to find endometriosis. A doctor may treat endometriosis with medicine. There are different types of medicine for endometriosis. Birth control medicine can help some women lessen their pain. Another kind of medicine is called Gonadotropin-releasing hormone (GnRH) agonists. If the pain lessens with medication, the doctor may diagnose the woman with endometriosis. However, such pain may return with drug withdrawal. Endometriosis is sometimes treated with surgery, which is called laparoscopic surgery. The doctor conducting the surgery looks inside the body to find endometriosis-afflicted tissues to remove them. The doctor may see endometriosis-afflicted tissue during laparoscopy. A doctor may take a tissue sample to study it under the microscope for determining appropriate treatment. ==References== == Other websites == * What causes endometriosis? * Symptoms of Endometriosis Category:Diseases and disorders of the female reproductive system",
 "title": "Endometriosis"
}