{
 "id": "654465",
 "text": "Quatermass II is a British science-fiction series, originally broadcast by BBC Television in the autumn of 1955. It is the second in the Quatermass series by writer Nigel Kneale, and the oldest of those serials to survive in its entirety in the BBC archives. Although sometimes compared unfavourably to the first and third Quatermass serials, Quatermass II was praised for its allegorical concerns of the damaging effects of industrialisation and the corruption of governments by big business. It is described on the British Film Institute's \"Screenonline\" website as \"compulsive viewing.\" == Production == On 22 September 1955 the ITV network was launched in the UK, bringing commercial television to Britain for the first time and ending the BBC's broadcasting monopoly in the country. The new network's creation had been established by the Television Act 1954, and the BBC had known in advance that they would need programmes to combat the new rival for television audiences. Referring to the 1953 science-fiction serial The Quatermass Experiment in a memo written in 1954, BBC Television's Controller of Programmes, Cecil McGivern, noted that: \"Had competitive television been in existence then, we would have killed it every Saturday night while [The Quatermass Experiment] lasted. We are going to need many more 'Quatermass Experiment' programmes.\"Quoted in == Casting and crew == Reginald Tate, who had played the title role in The Quatermass Experiment, collapsed and died on 23 August 1955, aged 58. This was less than a month before the shooting of the location filming for Quatermass II began, and necessitated the casting of a replacement lead actor at short notice; John Robinson was chosen to fill the part.Pixley, p. 18. Robinson was an experienced actor from a range of different films and television programmes since the 1930s, but was uncomfortable about taking over from Tate, and had difficulty in learning some of the technical dialogue he was required to deliver. Robinson's delivery of his lines has been criticised by some later reviewers. == Reception and influence == The available British television audience had doubled since The Quatermass Experiment had been shown in 1953, and the viewing figures for Quatermass II were accordingly higher. The series gained an audience of 7.9 million viewers for its first three episodes, which rised to 8.3 million for the fourth and fifth and concluded with 9 million.Pixley, p. 45. A BBC audience research report commissioned after Quatermass II had finished found that 90% of those questioned in the sample had watched at least five episodes of the production. == Other media == As with The Quatermass Xperiment, the film rights to the series were purchased by Hammer Film Productions — in this case after they had only read the scripts, before the series was even made. Titled Quatermass 2, the film was released in 1957 and once again directed by Val Guest, with Brian Donlevy starring; unlike the first film, Kneale wrote the screenplay himself. In the United States, the film was released under the title Enemy from Space. In April 2005 BBC Worldwide released a DVD box set of all their existing Quatermass material. This included digitally restored versions of all six episodes of Quatermass II, with the sound and vision of the recordings cleaned up as far as possible, and some of the existing special effects inserts that survived on their original film elements being re-inserted into the episodes. In 2016 released Quatermass II and Quatermass and the Pit.BBC Store == References == ==Other websites== * * * Quatermass II at TV.com * BBC site - I Love Quatermass * Quatermass.org.uk - Nigel Kneale & Quatermass Appreciation Site * The Quatermass Trilogy - A Controlled Paranoia * Quatermass 2: The Cult Hammer Film & The Classic BBC Television Serial Category:BBC television dramas",
 "title": "Quatermass II"
}