{
 "id": "654586",
 "text": "International mostly means something (a company, language, or organization) involving more than a single country. The term international as a word means involvement of, interaction between or encompassing more than one nation, or generally beyond national boundaries. For example, international law, which is applied by more than one country and usually everywhere on Earth, and international language which is a language spoken by residents of more than one country. == Origin of the word== The term international was coined by the utilitarian philosopher Jeremy Bentham in his Introduction to Principles of Morals and Legislation, which was printed for publication in 1780 and published in 1789. Bentham wrote: \"The word international, it must be acknowledged, is a new one; though, it is hoped, sufficiently analogous and intelligible. It is calculated to express, in a more significant way, the branch of law which goes commonly under the name of the law of nations.Oxford English Dictionary. The word was adopted in French in 1801.Le Nouveau Petit Robert 2010. Thomas Erskine Holland noted in his article on Bentham in the 11th edition of the Encyclopædia Britannica that \"Many of Bentham's phrases, such as 'international,' 'utilitarian,' 'codification,' are valuable additions to our language; but the majority of them, especially those of Greek derivation, have taken no root in it.\" == Meaning in particular fields == *In team sports, \"international\" is a match between two national teams, or two players capped by a national team. *In politics, \"The International\" may refer to a political international. *In law, \"international\" may refer to several disciplines of International law like public international law, international criminal law etc. *In linguistics, an international language is one spoken by the people of more than one nation, usually by many. Also called world language. English, Spanish, French and Arabic are considered to be world languages.Language Map *In interlinguistics, international often has to do with languages rather than nations themselves. An \"international word\" is one that occurs in more than one language. These words are collected from widely spoken source or control languages, and often used to establish language systems that people can use to communicate internationally, and sometimes for other purposes such as to learn other languages more quickly. The vocabulary of Interlingua has a particularly wide range, because the control languages of Interlingua were selected to give its words and affixes their maximum geographic scope.Gode, Alexander, Interlingua: A Grammar of the International Language. New York: Frederick Ungar, 1951. In part, the language Ido is also a product of interlinguistic research. *In arts, an international art movement is an art movement with artists from more than one country, usually by many. Some international art movements are Letterist International, Situationist International, Stuckism International. \"International\" is also sometimes used as a synonym for \"global\". ==Related pages== * Globalization * International relations * Multinational corporation * United Nations ==References== ==Other websites== *Meaning of international on The Free Dictionary *Meaning of international on Cambridge dictionary *Meaning of international on Oxford dictionary. == Sources == * Category:Political geography",
 "title": "International"
}