{
 "id": "654809",
 "text": "The Eurovision Song Contest 2007 was the 52nd edition of the annual Eurovision Song Contest. It took place in Helsinki, Finland, following Lordi's win at the 2006 contest in Athens, Greece with the song \"Hard Rock Hallelujah\". The contest was held at the Hartwall Areena in Helsinki, Finland from 10 May to 12 May, and staged by host broadcaster Yle. A budget of €13 million was presented for arranging the contest. Other bids to host the contest came from Espoo, Turku and Tampere. The hosts were Finnish television personality Jaana Pelkonen and Finnish musician, stage performer and actor Mikko Leppilampi. Krisse Salminen acted as guest host in the green room, and reported from the crowds at the Senate Square. A record number of 42 countries participated. The European Broadcasting Union (EBU) put aside its limit of 40 countries, which would have meant excluding some countries using a ranking order scheme. The winner was Serbia, appearing as an independent country for the first time.Marija from Serbia wins Helsinki 2007 , Eurovision.tv After Lordi scored the first ever Eurovision victory with a hard rock song, several countries sent rock songs to the Contest rather than the soft pop and schlager styles more closely associated with Eurovision. This trend continued at the 2008 and 2009 Contests. Cyprus and Latvia entered songs in languages other than their own or English. Although this happened with the Belgium 2003 entry, this was the first time the contest featured countries doing this with actual languages as opposed to an imaginary one. == Participating countries == Participating countries in a Eurovision Song Contest must be active members of the EBU. 42 countries submitted preliminary applications. Although in previous years the maximum number of participating countries was 40, the EBU allowed all 42 to participate in 2007. The Czech Republic, Serbia, Montenegro and Georgia all entered the contest for the first time in 2007.ESC 2007 Event page, ESCKaz.com Monaco announced its withdrawal on 12 December 2006,EXCLUSIVE: Monaco withdraws, 12 December 2006, ESCtoday.com and the EBU announced the final lineup of 42 countries on 15 December 2006. === Returning artists === Evridiki returned to represent Cyprus, having previously represented the nation in 1992 and 1994. Eiríkur Hauksson previously represented Iceland in 1986 as part of the vocal trio ICY and he previously represented Norway in 1991 as part of the group Just 4 Fun. Karolina Gočeva previously represented Macedonia in 2002. Edsilia Rombley previously represented the Netherlands in 1998. === Semi-final === The semi-final was held on 10 May 2007 at 21:00 (CET). 28 countries performed and all 42 participants voted. Countries qualified for the final are highlighted. Draw Country Artist Song Language Place Points 01 Elitsa Todorova & Stoyan Yankoulov \"Water\" Bulgarian 6 146 02 Teapacks \"Push the Button\" English, French, Hebrew 24 17 03 Evridiki \"Comme ci, comme ça\" French 15 65 04 Koldun \"Work Your Magic\" English 4 176 05 Eiríkur Hauksson \"Valentine Lost\" English 13 77 06 Sopho \"Visionary Dream\" English 8 123 07 Stevan Faddy \"'Ajde, kroči\" ('Ајде, крочи) Montenegrin 22 33 08 DJ BoBo \"Vampires Are Alive\" English 20 40 09 Natalia Barbu \"Fight\" English 10 91 10 Edsilia Rombley \"On Top of the World\" English 21 38 11 Frederik Ndoci \"Hear My Plea\" English, Albanian 17 49 12 DQ \"Drama Queen\" English 19 45 13 Dragonfly feat. Dado Topić \"Vjerujem u ljubav\" Croatian, English 16 54 14 The Jet Set \"Time to Party\" English 14 75 15 Marija Šerifović \"Molitva\" Serbian 1 298 16 Kabát \"Malá dáma\" Czech 28 1 17 Sabrina \"Dança comigo\" Portuguese, English 11 88 18 Karolina \"Mojot svet\" Macedonian, English 9 97 19 Guri Schanke \"Ven a bailar conmigo\" English 18 48 20 Olivia Lewis \"Vertigo\" English 25 15 21 Anonymous \"Salvem el món\" Catalan, English 12 80 22 Magdi Rúzsa \"Unsubstantial Blues\" English 2 224 23 Gerli Padar \"Partners in Crime\" English 22 33 24 The KMG's \"Love Power\" English 26 14 25 Alenka Gotar \"Cvet z juga\" Slovene 7 140 26 Kenan Doğulu \"Shake It Up Şekerim\" English 3 197 27 Eric Papilaya \"Get a Life – Get Alive\" English 27 4 28 Bonaparti.lv \"Questa notte\" Italian 5 168 Notes : 1.Contained some words in French and Spanish. : 2.Although the song was performed in English, the title and sentence in the lyrics \"Ven a bailar conmigo\" is in Spanish. === Final === The finalists were: * the four automatic qualifiers France, Germany, Spain and the United Kingdom; * the top 10 countries from the 2006 final (other than the automatic qualifiers); * the top 10 countries from the 2007 semi-final. The final was held on 12 May 2007 at 21:00 (CET) and was won by Serbia. Draw Country Artist Song Language Place Points 01 Marija Šestić \"Rijeka bez imena\" Serbian 11 106 02 D'NASH \"I Love You Mi Vida\" Spanish 20 43 03 Dmitry Koldun \"Work Your Magic\" English 6 145 04 Dervish \"They Can't Stop the Spring\" English 24 5 05 Hanna Pakarinen \"Leave Me Alone\" English 17 53 06 Karolina \"Mojot svet\" Macedonian, English 14 73 07 Alenka Gotar \"Cvet z juga\" Slovene 15 66 08 Magdi Rúzsa \"Unsubstantial Blues\" English 9 128 09 4Fun \"Love or Leave\" English 21 28 10 Sarbel \"Yassou Maria\" English 7 139 11 Sopho \"Visionary Dream\" English 12 97 12 The Ark \"The Worrying Kind\" English 18 51 13 Les Fatals Picards \"L'amour à la française\" French, English 22 19 14 Bonaparti.lv \"Questa notte\" Italian 16 54 15 Serebro \"Song #1\" English 3 207 16 Roger Cicero \"Frauen regier'n die Welt\" German, English 19 49 17 Marija Šerifović \"Molitva\" Serbian 1 268 18 Ukraine Verka Serduchka \"Dancing Lasha Tumbai\" () German, English, Ukrainian, Russian 2 235 19 Scooch \"Flying the Flag (For You)\" English 22 19 20 Todomondo \"Liubi, Liubi, I Love You\" () English, Italian, Spanish, Russian, French, Romanian 13 84 21 Elitsa Todorova & Stoyan Yankoulov \"Water\" Bulgarian 5 157 22 Kenan Doğulu \"Shake It Up Şekerim\" English 4 163 23 Hayko \"Anytime You Need\" English, Armenian 8 138 24 Natalia Barbu \"Fight\" English 10 109 Notes : 3.Contained some words in English. == References == 2007 Category:2000s in Finland Category:2007 in Europe Category:2007 in music Category:Helsinki",
 "title": "Eurovision Song Contest 2007"
}