{
 "id": "654995",
 "text": "The following is a list of deaths that should be noted in September 2018. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==September== ===1=== *Irving Petlin, 83, American artist (Chicago Imagists), liver cancer.Disparition de l’artiste américain Irving Petlin *Margit Sandemo, 94, Norwegian-Swedish author (The Legend of the Ice People).Margit Sandemo er død *Tarun Sagar, 51, Indian Jain monk, complications from jaundice. *Randy Weston, 92, American jazz pianist and composer, heart disease.Remembering Randy Weston, the Afro-Centric Jazz Pioneer *Ehsan Yarshater, 98, Iranian scholar, Director of the Center for Iranian Studies at Columbia University, complications from thrombosis.درگذشت احسان یارشاطر؛ مردی که زبان فارسی وطنش بود ===2=== *Conway Savage, 58, Australian rock singer-songwriter (\"Nothing Broken\", \"Wrong Man's Hands\", \"Soon Will Be Tomorrow\") and pianist (Nick Cave and the Bad Seeds), brain cancer. *Claire Wineland, 21, American entrepreneur and health activist, stroke.Claire Wineland, inspirational speaker and social media star, dies one week after lung transplant ===3=== *Lydia Clarke, 95, American actress (The Atomic City, Bad for Each Other, Will Penny) and photographer.Lydia Clarke Heston, Actress and Wife of Charlton Heston, Dies at 95 *Jalaluddin Haqqani, 78–79, Afghan militant, founder of the Haqqani network.Haqqani network's founder dies after long illness, Afghan Taliban says *Ina Isings, 99, Dutch classical archaeologist.Overlijdensadvertentie Overleden: Clasina Isings (03-09-2018) *Paul Koech, 49, Kenyan long distance runner, half marathon world champion (1998), cerebral hemorrhage. *Jacqueline Pearce, 74, British actress (Blake's 7, Dark Season, Doctor Who), lung cancer. *Gordon Phillips, 71, English football player (Hayes, Brentford) and manager (Staines Town), cancer. *Katyna Ranieri, 93, Italian singer (\"Una canzone da due soldi\") and actress (Goodbye Uncle Tom), heart failure.Morta Katyna Ranieri, vedova di Riz Ortolani: aveva 93 anni ===4=== *Marijan Beneš, 67, Bosnian boxer, European amateur champion (1973), complications from Alzheimer's disease.Yugoslav Boxing Legend Marijan Benes Dies *István Bethlen, 72, Hungarian aristocrat and economist, MP (1990–1994).Meghalt Bethlen István, volt MDF-es képviselő *Sheldon S. Cohen, 91, American politician, Commissioner of Internal Revenue (1965–1969), heart failure.Sheldon S. Cohen, IRS commissioner who computerized agency, dies at 91 *Ralph Wolfe Cowan, 86, American portrait artist.Ralph Wolfe Cowan overleden, maker van iconisch portret Donald Trump *Bill Daily, 91, American actor (I Dream of Jeannie, The Bob Newhart Show, Match Game).Bill Daily, Major Healey in ‘I Dream of Jeannie,’ Dies at 91 *Don Gardner, 87, American R&B; singer-songwriter (\"I Need Your Lovin'\") and drummer, cancer.Philadelphia Soul and Jazz Pioneer Donald Gardner Dies at 87 *Christopher Lawford, 63, American actor (Terminator 3: Rise of the Machines, Thirteen Days, General Hospital), writer (Symptoms of Withdrawal) and political activist (Kennedy family), heart attack.Christopher Lawford Dead: JFK’s Nephew Dies at 63 *Ab McDonald, 82, Canadian ice hockey player (Chicago Blackhawks, Montreal Canadiens, St. Louis Blues), cancer.'A first-class Winnipegger': Hockey legend Ab McDonald dead at 82 ===5=== *Imrich Andrejčák, 77, Czechoslovak general, Minister of Defense of Czechoslovakia (1992) and Defence Minister of Slovakia (1993–1994).First Slovak Defence Minister Imrich Andrejcak Passes Away at 77 *Rachael Bland, 40, Welsh journalist and presenter (BBC Radio 5 Live, BBC North West Tonight), breast cancer.BBC presenter Rachael Bland dies at 40 after cancer battle *François Flohic, 98, French Free Naval Forces admiral, heart attack.Info Le Point. François Flohic, aide de camp du général de Gaulle, est décédé *Mike Hogewood, 65, American sportscaster (Raycom Sports, FSN South) and professional wrestling commentator (Ring of Honor), heart attack.‘Mr. ACC’ Mike Hogewood dead at 65 *Beatriz Segall, 92, Brazilian actress (Vale Tudo), respiratory failure.Morre aos 92 anos a atriz Beatriz Segall, a Odete Roitman de \"Vale Tudo\" *Bhagwatikumar Sharma, 84, Indian Gujarati writer and journalist.Gujarati author Bhagwatikumar Sharma dies ===6=== *Richard DeVos, 92, American salesman and billionaire, co-founder of Amway, complications from infection.Amway founder and Magic owner Richard DeVos dies at age 92 *Liz Fraser, 88, English actress (I'm All Right, Jack, Carry On Regardless, Dad's Army), complications from cancer surgery.Liz Fraser, big-hearted blonde actress of Carry On films Obituary *Salawat Gallyamov, 59, Russian linguist.В Уфе в 59 лет умер башкирский ученый Салават Галлямов *Gilbert Lazard, 98, French linguist and Iranologist.French Iranologist Gilbert Lazard dies at 98 *Wilson Moreira, 81, Brazilian sambista singer-songwriter (\"Senhora Liberdade\", \"Gotas de Veneno\", \"Meu Apelo\"), multiple organ failure.Morre, aos 81 anos, o sambista Wilson Moreira *Burt Reynolds, 82, American actor (Smokey and the Bandit, Boogie Nights, Deliverance), Emmy winner (1991) and Golden Globe winner (1991, 1997), cardiac arrest.Burt Reynolds, Movie Star Who Played It for Grins, Dies at 82 *Claudio Scimone, 83, Italian conductor (I Solisti Veneti).Morto maestro Claudio Scimone ===7=== *Samuel Bodman, 79, American politician, Secretary of Energy (2005–2009), complications from primary progressive aphasia.Samuel W. Bodman, 79; former Fidelity executive served as US energy secretary *Kurt Helmudt, 74, Danish rower, Olympic champion (1964).OL-guldvinderen Kurt Helmudt er død *Mac Miller, 26, American rapper, singer (\"Donald Trump\", \"Watching Movies\", \"Goosebumpz\") and record producer, drug overdose.Mac Miller, Pittsburgh Rapper And Producer, Reportedly Dead At 26 *Ingemar Mundebo, 87, Swedish politician, MP (1965–1980) and Governor of Uppsala County (1980–1986).Ingemar Mundebo *Szarlota Pawel, 71, Polish comic book artist (Kleks), colorectal cancer.Szarlota Pawel nie żyje. Była pierwszą damą polskiego komiksu *Yang Side, 96, Chinese People's Liberation Army general.97岁开国少将杨斯德逝世 曾被誉为“策反将军” ===8=== *Jonas Algirdas Antanaitis, 97, Lithuanian politician, MP (since 1995).Mirė pasipriešinimo kovų dalyvis Jonas Algirdas Antanaitis *Gennadi Gagulia, 70, Abkhazian politician, Prime Minister (1995–1997, 2002–2003, since 2018), car crash.Prime Minister of Abkhazia died in traffic accident *Chelsi Smith, 45, American singer and beauty pageant winner (Miss USA 1995, Miss Universe 1995), liver cancer.First black Miss Texas USA and former Miss Universe dies at 45, friends say ===9=== *Frank Andersson, 62, Swedish professional wrestler (NJPW, WCW), Olympic bronze medalist (1984), lung infection complicated by heart surgery.Frank Andersson är död *Johannes Geldenhuys, 83, South African military commander, Chief of the Defence Force (1985–1990).Voormalige SA weermaghoof sterf *Beat Richner, 71, Swiss pediatrician and cellist.Dr Beat Richner dies at age of 71 *Daniel Küblböck, 33, German pop singer (\"You Drive Me Crazy\", \"Heartbeat\"), television contestant (Deutschland sucht den Superstar) and actor (Daniel – Der Zauberer), presumably drowned.Canada ends search for missing German star Daniel Küblböck (body disappeared on this date) *Mr. Catra, 49, Brazilian rapper (\"O Segredo do Altíssimo\", \"Bonde do Tesão\", \"Poder da Favela\"), stomach cancer.Morre em São Paulo o funkeiro Mr. Catra, aos 49 anos, vítima de câncer *Javier Usabiaga Arroyo, 79, Mexican businessman and politician, Minister of Agriculture (2000–2005) and Deputy (2009–2012), throat cancer.Fallece Javier Usabiaga, secretario de Agricultura en sexenio de Fox ===10=== *Adam Clymer, 81, American journalist (The New York Times), pancreatic cancer.Adam Clymer, Political Reporter, Editor and Pollster, Dies at 81 *Peter Donat, 90, Canadian-born American actor (The Godfather Part II, The X-Files, The China Syndrome), complications from diabetes.Peter Donat, Actor Who Played a Panoply of Roles, Dead at 90 *István Géczi, 75, Hungarian footballer (Ferencváros, national team) and politician, Olympic silver medalist (1972) and MP (1985–1990), stroke.Meghalt Géczi István, a Fradi történetének egyik legfontosabb kapusa *Johnny Strike, 70, American singer-songwriter (Crime) and crime novelist (Ports of Hell), liver cancer.Johnny Strike, Frontman of SF Punk Band Crime, Dead at 70 *Paul Virilio, 86, French philosopher (War and Cinema) and urbanist, heart attack.Mort de Paul Virilio, penseur de l'accélération du monde *Co Westerik, 94, Dutch painter and photographer, complications from Alzheimer's disease.Beeldend kunstenaar Co Westerik (94) overleden ===11=== *Fenella Fielding, 90, English actress (Follow a Star, Carry On Regardless, Carry On Screaming!), complications from a stroke.Fenella Fielding dies aged 90: A classical actress of rare intelligence with wit that deserves celebration *Kalle Könkkölä, 68, Finnish politician, MP (1983–1987), pneumonia.Kalle Könkkölä är död *Kulsoom Nawaz, 68, Pakistani politician, member of the National Assembly (2017–2018), First Lady (1990–1993, 1997–1999, 2013–2017), complications from lymphoma.Kulsum Nawaz, Wife of Nawaz Sharif, Dies in London at Age 68 *Don Newman, 60, American basketball coach (San Antonio Spurs, Washington Wizards) and football player (Saskatchewan Roughriders), cancer.Former Spurs assistant Don Newman dies *Roger W. H. Sargent, 91, British chemical engineer.Roger Sargent 1926-2018 ===12=== *Hossein Erfani, 76, Iranian voice actor, lung cancer.Iranian dubber Hossein Erfani dies at 76 *Henry Kalis, 81, American politician, member of the Minnesota House of Representatives (1975–2003), emphysema.Henry Kalis Obituary *Hans Kloss, 80, German artist and graphic designer, stomach cancer.Gmünds Stadtmaler Hans Kloss ist verstorben *Wayne M. Meyers, 94, American microbiologist and humanitarian.Wayne Marvin Meyers obituary *Walter Mischel, 88, American psychologist, pancreatic cancer.Walter Mischel, 88, Psychologist Famed for Marshmallow Test, Dies *Billy O'Dell, 85, American baseball player (Baltimore Orioles, San Francisco Giants, Atlanta Braves), complications from Parkinson's disease.Ex-big leaguer O'Dell who won 105 games in majors dies at 85 *Mark W. Olson, 75, American banker, member of the Federal Reserve Board of Governors (2001–2006).Former Fed Governor, ABA President Mark Olson Dies *Shen Chun-shan, 86, Taiwanese physicist and academic, President of National Tsing Hua University (1994–1997), ruptured intestine. *Rachid Taha, 59, Algerian singer (Carte de Séjour), songwriter (\"Voilà, Voilà\", \"Ya Rayah\", \"It's Now or Never\"), heart attack.France-based Algerian singer Rachid Taha dies at 59 ===13=== *Guido Ceronetti, 91, Italian journalist (La Stampa) and poet, bronchopneumonia.Morto lo scrittore Guido Ceronetti *Marin Mazzie, 57, American actress (Ragtime, Kiss Me, Kate, Passion), ovarian cancer.Marin Mazzie, Broadway Musical Star, Is Dead at 57 *Martha Vaughan, 92, American biochemist and physiologist, member of the National Academy of Sciences (since 1985).Martha Vaughan *Albrecht Wellmer, 85, German philosopher.Albrecht Wellmer, Erbe der Frankfurter Schule *John Wilcock, 91, British journalist (The Village Voice), stroke.John Wilcock, Pioneer of the Underground Press, Dies at 91 ===14=== *Alan Abel, 94, American comedian and writer, heart failure complicated by cancer.Alan Abel, Hoaxer Extraordinaire, Is (on Good Authority) Dead at 94 *Max Bennett, 90, American jazz bassist (L.A. Express, The Wrecking Crew), Alzheimer's disease.In Memoriam: Max Bennett *Anneke Grönloh, 76, Dutch singer (\"Surabaya\", \"Brandend Zand\"), leukemia.Zangeres Anneke Grönloh (76) overleden *Branko Grünbaum, 88, Yugoslavian-born American mathematician.Branko Grünbaum (1929—2018) *Zienia Merton, 72, Burmese-born British actress (The Chairman, Doctor Who, Space: 1999).E' morta Zienia Merton, la Sandra Benes di Spazio 1999 ===15=== *Kirin Kiki, 75, Japanese actress (Ballad of Orin, The Triple Cross, Half a Confession), breast cancer. *Dudley Sutton, 85, British actor (Lovejoy, The Devils, The Pink Panther Strikes Again), cancer.Dudley Sutton dead - Lovejoy's Tinker has died aged 85 *José Manuel de la Sota, 68, Argentine politician, Senator (1995–1999) and Governor of Córdoba (1999–2007, 2011–2015), car crash.En un accidente de tránsito Murió José Manuel De la Sota, ex gobernador de Córdoba y dirigente histórico del peronismo *Victor Veselago, 89, Soviet-born Russian physicist.Некролог Виктора Георгиевича Веселаго *Fritz Wintersteller, 90, Austrian mountaineer. Addio a Wintersteller, l’uomo della prima sul Broad Peak *Zhu Xu, 88, Chinese actor (Shower, The King of Masks, Lan), complications from mesothelioma.著名表演艺术家朱旭凌晨在北京逝世 享年88岁 ===16=== *Perry Miller Adato, 97, American documentary movie producer (Dylan Thomas: The World I Breathe, Gertrude Stein: When This You See, Remember Me, Picasso-A Painter's Diary), Emmy winner (1968).Perry Miller Adato, a Filmmaker Focused on Artists, Dies at 97 *Maartin Allcock, 61, English multi-instrumentalist (Fairport Convention, Jethro Tull, Robert Plant) and record producer, liver cancer.Fans mourn death of Fairporter Maartin Allcock *Kevin Beattie, 64, English footballer (Ipswich Town, Middlesbrough, national team), heart attack.Former Town legend Kevin Beattie dies *Tommy Best, 97, Welsh footballer (Hereford United, Cardiff City, Chester), complications from Alzheimer's disease.Tommy Best, Hereford United striker, dies *Big Jay McNeely, 91, American R&B; saxophonist (\"The Deacon's Hop\"), prostate cancer. *James B. Thayer, 96, American World War II brigadier general. ===17=== *Celia Barquín Arozamena, 22, Spanish golfer, stabbed.Celia Barquín: European golf champion murdered in Iowa *Enzo Calzaghe, 69, Italian-born Welsh boxing trainer.Obituary: Legendary boxing trainer Enzo Calzaghe *Captain Raju, 68, Indian military officer and actor (Nalla Naal, Rowdy Alludu, Cotton Mary), complications from a stroke.Malayalam Actor Captain Raju Passes Away *Daniel N. Robinson, 81, American philosopher, heart failure.Remembering Daniel Nicholas Robinson (1937-2018) ===18=== *David DiChiera, 83, American composer, founding general director of Michigan Opera Theatre, pancreatic cancer. *Marceline Loridan-Ivens, 90, French writer (But You Did Not Come Back) and movie director.Filmmaker Loridan-Ivens, Auschwitz companion of Simone Veil, dies *Jean Piat, 93, French actor (The Lame Devil, The Milky Way, Rider on the Rain).Jean Piat, mort d'un roi *Richard M. Pollack, 83, American mathematician.\"Ricky Pollack\", sent by Joseph S. B. Mitchell to the compgeom-announce mailing list, September 19, 2018 *Robert Venturi, 93, American architect, Pritzker Prize winner (1991), complications from Alzheimer's disease.Robert Venturi passes away *Norifumi Yamamoto, 41, Japanese martial artist (Bantamweight), cancer. ===19=== *Jon Burge, 70, American police officer (Chicago Police Department) and convicted felon, prostate cancer.Notorious CPD commander Jon Burge dead at 70 *Bunny Carr, 91, Irish television presenter (Quicksilver), respiratory failure.Former TV presenter Bunny Carr dies, aged 91 *Kondapalli Koteswaramma, 100, Indian communist revolutionary and writer, stroke.Revolutionary Communist leader Kondapalli Koteswaramma passes away *Győző Kulcsár, 77, Hungarian fencer, Olympic champion (1964, 1968, 1972).Meghalt Kulcsár Győző *Marilyn Lloyd, 89, American politician, member of the U.S. House of Representatives from Tennessee's 3rd congressional district (1975–1995), complications from pneumonia.Former Chattanooga congresswoman Marilyn Lloyd has died *Arthur Mitchell, 84, American dancer and choreographer, founder of the Dance Theatre of Harlem, heart failure.Arthur Mitchell Is Dead at 84; Showed the Way for Black Dancers *Denis Norden, 96, English comedy writer (Take It From Here), television presenter (It'll be Alright on the Night) and radio personality (My Word!, My Music).TV Host Denis Norden dies aged 96 *Gamil Ratib, 91, Egyptian-French actor (Lawrence of Arabia, Poussière de diamant, The Aquarium).Egyptian-French Actor Gamil Ratib Dies at 91 ===20=== *Fadhil Jalil al-Barwari, 52, Iraqi military officer, heart attack.الموت يغيب قائد الفرقة الذهبية فاضل برواري *John Cunliffe, 85, English children writer, creator of Postman Pat and Rosie and Jim.John Cunliffe dead at 85: Postman Pat and Rosie and Jim creator dies *Inge Feltrinelli, 87, German-born Italian publisher and photographer, stroke.E' morta Inge Feltrinelli, ultima grande regina dell'editoria internazionale *George N. Hatsopoulos, 91, Greek-born American mechanical engineer, co-founded the Thermo Electron.George Hatsopoulos, senior lecturer emeritus and MIT Corporation life member emeritus, dies at 91 *Mohammed Karim Lamrani, 99, Moroccan politician, Prime Minister (1971–1972, 1983–1986, 1992–1994).Mohamed Karim Lamrani n'est plus *Laurie Mitchell, 90, American actress (20,000 Leagues Under the Sea, Queen of Outer Space, Some Like It Hot).Laurie Mitchell, Villainess in 'Queen of Outer Space,' Dies at 90 *K-Run's Park Me In First, 13, American show dog, winner of the 2008 Westminster Kennel Club's Best in Show, cancer.Westminster’s top dog Uno the beagle dies *Mohamed Sahnoun, 87, Algerian politician, Permanent Representative to the United Nations (1982–1984) and Ambassador to the United States (1984–1989). *Reinhard Tritscher, 72, German Olympic alpine skier (1972), climbing accident.Reinhard Tritscher ist tot: Ex-Skirennläufer verunglück bei Bergtour *Henry Wessel Jr., 76, American photographer, lung cancer.Henry Wessel, prominent Bay Area photographer, dies ===21=== *İbrahim Ayhan, 50, Turkish politician, MP (since 2011), heart attack.Milletvekilliği düşürülen HDP'li İbrahim Ayhan hayatını kaybetti *Vitaliy Masol, 89, Ukrainian politician, Prime Minister (1994–1995).Умер бывший премьер Украины Виталий Масол *Trần Đại Quang, 61, Vietnamese politician, President (since 2016), complications from a virus.Chủ tịch Trần Đại Quang qua đời ở tuổi 62 ===22=== *Avi Duan, 62, Israeli politician, member of Knesset (2012–2013).חבר הכנסת לשעבר אבי דואן הלך לעולמו הלווייתו תתקיים מחר *Chas Hodges, 74, British musician (Chas & Dave), pneumonia complicated by multiple organ failure.Chas Hodges death: One half of famous London duo Chas & Dave dies *Bob Lienhard, 70, American basketball player (Cantù), emphysema.Basket, addio a Bob Lienhard: stella con Cantù, giocò a Monza nella Forti e liberi *Al Matthews, 75, American actor (Aliens, The Fifth Element, The Sender).Al Matthews, Cigar-Chomping Sgt. Apone in 'Aliens,' Dies at 75 *Edna Molewa, 61, South African politician, Minister of Environmental Affairs (since 2010), Minister of Social Development (2009–2010) and Premier of North West Province (2004–2009), complications from a virus. *Sir Eric Yarrow, 98, British businessman, Chairman of Clydesdale Bank (1985–1991). ===23=== *Sir Charles K. Kao, 84, Chinese-born British-American electrical engineer, discovered optical fiber reduction, Nobel Prize winner (2009), complications from Alzheimer's disease.Nobel Prize winner and Hong Kong native Charles Kao dies, 84 *Gary Kurtz, 78, American movie producer (American Graffiti, Star Wars, The Dark Crystal), cancer.Gary Kurtz: 1940 – 2018 ===24=== *Norm Breyfogle, 58, American comic book artist (Batman, Prime), complications from a stroke.Artist Norm Breyfogle Passes Away at Age 58 *Jim Brogan, 74, Scottish footballer (Celtic, national team), dementia.Celtic legend Jim Brogan dies after dementia battle *José María Hurtado Ruiz-Tagle, 73, Chilean politician, Deputy (1990–1998), stomach cancer.Falleció José María Hurtado, ex-diputado por Colchagua y alcalde de Palmilla designado por Pinochet *Ivar Martinsen, 97, Norwegian Olympic speed skater (1948, 1952), complications from pneumonia.Tidligere skøyteløper Ivar Martinsen er død *Tommy McDonald, 84, American Hall of Fame football player (Philadelphia Eagles, Los Angeles Rams, Dallas Cowboys).Tommy McDonald, 1934-2018 ===25=== *Helena Almeida, 84, Portuguese photographer and painter, heart attack.Muere la artista portuguesa Helena Almeida, que hizo lienzo de su cuerpo *Marie Colton, 95, American politician, member of the North Carolina House of Representatives (1978–1994), congestive heart failure.Former North Carolina Legislative Leader Colton Dies at 95 *Ivan Kapitanets, 90, Soviet-born Russian military officer, Admiral of the Fleet (1988–1992).И.М. Капитанец *Danny Lewicki, 87, Canadian ice hockey player (Toronto Maple Leafs, New York Rangers, Quebec Aces), Stanley Cup champion (1948).Former Leaf Danny Lewicki was a triple champion ===26=== *Joe Carolan, 81, Irish footballer (Manchester United, Brighton & Hove Albion, national team).United Pay Tribute to Joe Carolan *Ignaz Kirchner, 72, Austrian actor (Burgtheater).Burgschauspieler Ignaz Kirchner gestorben ===27=== *Marty Balin, 76, American Hall of Fame rock singer and musician (Jefferson Airplane, Jefferson Starship).Jefferson Airplane Co-Founder Marty Balin Dead at 76 *Brian A. Joyce, 56, American politician, member of the Massachusetts Senate (1998–2017).Former state senator Brian Joyce found dead at his home *James G. March, 90, American sociologist.Don Quichotte, Khoutouzov, James March : comprendre les organisations humaines et le leadership ===28=== *Barnabas Sibusiso Dlamini, 76, Swazi politician, Prime Minister (1996–2003, 2008–2018).Prime Minister Dlamini of eSwatini dies *Ito Giani, 77, Italian Olympic sprinter (1964).L'ultimo saluto ad Ito Giani *Bob Jane, 88, Australian race car driver and entrepreneur (Bob Jane T-Marts), prostate cancer.Bob Jane, tyre businessman and car racing legend, dies aged 88 from prostate cancer ===29=== *Alves Barbosa, 86, Portuguese cyclist.Morreu Alves Barbosa, primeiro triplo vencedor da Volta a Portugal em bicicleta *Otis Rush, 83, American Hall of Fame blues guitarist and singer (\"All Your Love\", \"I Can't Quit You Baby\", \"Double Trouble\"), complications from a stroke.In Memoriam | Otis Rush (April 29, 1935 – September 29, 2018) ===30=== *Edredon Bleu, 26, British racehorse, winner of the King George VI Chase (2003), euthanized.Edredon Bleu: Champion Chase and King George winner dies, aged 26 *Geoffrey Hayes, 76, English television presenter (Rainbow) and actor (Z-Cars), pneumonia.Geoffrey Hayes obituary *Kim Larsen, 72, Danish rock musician (Gasolin'), prostate cancer.Danska artisten Kim Larsen är död *Ângela Maria, 89, Brazilian singer.Morre, aos 89 anos, a cantora Angela Maria *René Pétillon, 72, French satirical and political cartoonist.Mort du dessinateur René Pétillon ==Months== * January * February * March * April * May * June * July * August ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *9 Category:September 2018 events",
 "title": "Deaths in September 2018"
}