{
 "id": "655158",
 "text": "Timothy Lee \"Tim\" Richmond (June 7, 1955 – August 13, 1989). was a NASCAR driver from Ashland, Ohio. His career was cut short when he contracted HIV. He later died from complications of AIDS. == Career == Unlike many other NASCAR drivers, Richmond was born into wealth and did not grow up auto racing. He did not begin racing until the age of 21, when he drove a Sprint Car owned by a friend. He continued to the open-wheel circuits, racing in the 1980 Indianapolis 500 and finishing ninth. Richmond decided to move on into stock- car racing in NASCAR, where he spent the rest of his days. His first few seasons, he bounced from team to team looking for a permanent ride, which he found in 1982. He raced in 26 events, winning twice and finishing in the top 5 seven times, but finished 26th in Winston Cup standings. Richmond began feeling ill at the end of the 1986 season, and he checked into a clinic after the season ended. There, he was diagnosed with AIDS, which doctors still did not understand well. Despite his illness, Richmond worked to regain his strength. He returned to racing in 1987, winning two races at Pocono and Riverside. However, as his health began to worsen, so did his results. Richmond would race in six more events before being told not to race by NASCAR. In 1988, Richmond tried to re-enter NASCAR racing. Expressing concerns about how he had contracted HIV, NASCAR made Richmond (and Richmond alone) take a drug test. Several days later, NASCAR announced that he had tested positive for banned substances and suspended him indefinitely. Richmond was livid, insisting that he did not take any banned substances. He demanded another test, which he passed. NASCAR later admitted only Sudafed and Advil had been found in the first test. They also released the permanent ban, but refused to allow Richmond to drive again until he surrendered medical records that said he had AIDS. Richmond finally retired to West Palm Beach, Florida, where he lived in seclusion with his mother until his death on August 13, 1989. == Legacy == In recent years NASCAR has suspended drivers with drug violations. Busch Series driver Shane Hmiel was suspended twice (in 2003 and 2005) before finally being suspended for life in 2006. Kevin Grubb and Craftsman Truck Series driver Brian Rose were also suspended for failing drug tests. Many still point the incident with Richmond to show that an extremely \"good ol' boy\" system is still in place with NASCAR. The movie Days of Thunder was loosely based on Richmond's life, with Tom Cruise's character (Cole Trickle) inspired by Richmond. Robert Duvall's character (Harry Hogge) was inspired by crew chief Harry Hyde, and Randy Quaid's role (Tim Daland) was inspired by owner Rick Hendrick. === Other info === Richmond was inducted into the International Motorsports Hall of Fame in 2002. == References == == Related pages == * List of NASCAR drivers == Other websites == * Two years before his death, Tim Richmond was interviewed by legendary #NASCAR journalist Category:1955 births Category:1989 deaths Category:Sportspeople from Ohio Category:NASCAR drivers Category:Deaths from AIDS Category:Infectious disease deaths in Florida",
 "title": "Tim Richmond"
}