{
 "id": "655157",
 "text": "Auditorium 6 is a 2017 American short comedic horror movie directed, written, produced, and edited by Chris Stuckmann. It stars Matthew Brando, KateLynn E. Newberry, Rob Grant, George Tutie, Tara O. Horvath, and Sam Liz. The movie premiered in Cleveland, Ohio on October 25, 2017. == Premise == A night janitor takes a job working for an old movie theater and is warned of its sinister history. When he encounters the presence that haunts the theater, something unexpected happens. == Cast == * Matthew Brando as Matt *KateLynn E. Newberry as Olivia * Rob Grant as Supervisor * George Tutie as Manager * Tara O. Horvath as Theater Customer #1 * Sam Liz as Theater Customer #2 == Release == The movie's premiere was held in Cleveland, Ohio, on October 25, 2017. Since then, the movie has gone to several different film festivals. == Reception == === Critical response === Tyler Hummel from Geeks Under Grace praised the film and said \"Auditorium 6 carries both a genuine energy, enthusiasm, and talent that suggests to me that Mr. Stuckmann could become quite a good independent director.\" Horror Geek Life writer Curt Oglesbee scored the film 4 out of 5 stars, and said \"Chris Stuckmann‘s Auditorium 6 is an ode to that particular relationship with film, made by movie lovers FOR movie lovers.\" === Accolades === Year Award Category Recipient(s)/Nominee(s) Result Ref. 2017 Best Shorts Competition Award of Excellence Special Mention: Film Short Chris Stuckmann Award of Merit Special Mention: Leading Actress KateLynn E. Newberry 2018 The Indie Horror Film Festival Best Actress KateLynn E. Newberry Best Short Chris Stuckmann Best Supporting Actor Rob Grant The International Horror Hotel Best Director of an Ohio Film Chris Stuckmann Best Ohio Actress KateLynn E. Newberry Best Ohio Actor Matthew Brando Best Horror/Comedy Chris Stuckmann ==References== == Other websites == * Category:2017 horror movies Category:American horror movies",
 "title": "Auditorium 6"
}