{
 "id": "655303",
 "text": "\"Starships\" is a song by American rapper Nicki Minaj. It is from her second studio album, Pink Friday: Roman Reloaded. It is the tenth track on the album. It was released on February 14, 2012. The song has a pop rap sound similar to her previous single \"Super Bass\" and has elements of dance-pop and Eurodance. Minaj co-wrote the song with Wayne Hector, Carl Falk, Rami Yacoub, and its producer, RedOne, who is known for his work with Lady Gaga and Jennifer Lopez. The song has been very successful worldwide, reaching the top ten in countries like the US, UK, Canada, and Australia. ==Charts== === Weekly charts === Chart (2012) Peak position Australia (ARIA Urban) 2 Belgium (Ultratop Flanders Dance) 2 Belgium (Ultratop Flanders Urban) 7 Belgium (Ultratop Wallonia Dance) 1 Brazil (Billboard Brasil Hot 100) 22 Brazil Hot Pop Songs 21 Canada (Canadian Hot 100) 4 Colombia (National-Report) 11 Finland (Suomen virallinen lista) 3 France (SNEP) 5 Italy (FIMI) 35 Luxembourg (Billboard) 10 Mexico Airplay (Billboard) 20 Netherlands (Mega Top 50)3fm Mega Top 50: 07/07/2012 (in Dutch). dutchcharts.nl. Retrieved December 21, 2013. 5 Poland (Video Chart) 2 South Korea (Gaon Music Chart) 75 ===Year-end charts=== Chart (2012) Position Australia (ARIA) 6 Belgium (Ultratop Flanders) 17 Belgium (Ultratop Wallonia) 22 Canada (Canadian Hot 100) 9 France (SNEP) 24 Germany (Media Control Charts) 78 Hungary (Rádiós Top 40) 37 Ireland (IRMA) 6 Japan (Japan Hot 100) 37 Netherlands (Dutch Top 40) 21 Netherlands (Single Top 100) 25 New Zealand (Recorded Music NZ) 4 Sweden (Sverigetopplistan) 15 Switzerland (Schweizer Hitparade) 28 UK Singles (OCC) 7 US Billboard Hot 100 9 US Dance Club Songs (Billboard) 28 US Dance/Mix Show Airplay (Billboard) 18 US Mainstream Top 40 (Billboard) 13 US Hot Rap Songs (Billboard) 31 US Rhythmic (Billboard) 12 ===Decade-end charts=== Chart (2010–19) Position Australia (ARIA) 91 === Notes === == References == Category:2012 songs Category:Nicki Minaj songs Category:Dance-pop songs Category:Hip hop songs",
 "title": "Starships (song)"
}