{
 "id": "655426",
 "text": "Gwoyeu Romatzyh (pinyin: Guóyǔ luómǎzì, literally \"National Language Romanization\"), abbreviated GR, is a romanization of Mandarin Chinese, or a way to write Mandarin using the Roman alphabet, made by Yuen Ren Chao and some other linguists in the late 1920s. It was made as a way to write Mandarin using tonal spelling, or spelling rules that would change the syllable's spelling depending on its tone. For example, the syllable chai would be written as chai if it has the first Mandarin tone (or chāi in Pinyin), chair if it has the second tone (chái), chae if it has the third tone (chǎi), or chay if it has the fourth tone (chài). Chao created GR in order to increase literacy because China's illiteracy was very high in the early 20th century. He had tones written without extra tone markers, which could take a long time and be difficult to add in printing. Even though many other Asian languages use tonal spelling, like Hmong, they all represent tones by using the same letter each time the tone is used. In Hmong, for example, -b is always a high tone, -s is always a low tone, and -j is always high-falling tone. In GR, however, each syllable final has its own spelling rules, and many exceptions exist within those rules. For example, first tone words with the final -a as in bā are written with just one vowel like ba except when the syllable begins with an l-, m-, n-, or r-, where it must be written as lha, mha, nha, and rha respectively. That is only one of its many rules and exceptions. Unsurprisingly, many people thought GR was too difficult to learn. Nonetheless, it still has many supporters, who would rather learn using GR than pinyin. While supporters of GR claim that it helps users remember tones better than those who use only pinyin, studies have not supported that claim. As a matter of fact, one study showed that after one year, the subjects who learned Chinese using Pinyin could more accurately speak Mandarin with tones than those who learned using GR. After the Communist Party took over China, it tried to replaced all romanizations of Chinese, including GR, with pinyin. While GR is not an official romanization in Taiwan, it can be seen in several places, including road signs, people's names, and the names of products even though Hanyu Pinyin is the official romanization of Taiwan. Even though almost all romanizations in Mainland China are now in pinyin, there are still exceptions. For example, the name of the Shaanxi province is written in GR rather than in Pinyin, which would be Shǎnxī with tone markers, because there is already another province, Shanxi, which is written as Shānxī with tones. If the pinyin names were to be written without tone markers, which they often are in ordinary pinyin, they should both be spelled Shanxi and so they would be impossible to tell apart. Therefore, an exception has been made in this case. Below are examples of sentences written in Chinese characters, GR, and pinyin with English translations. Chinese characters 你是一个中国人吗？ Gwoyeu Romatzyh Nii shyh igeh Jornggwo ren ma? Pinyin Nǐ shì yīgè Zhōngguó rén ma? English Are you Chinese? Chinese characters 李美花下个星期要去山西还是陕西？ Gwoyeu Romatzyh Lii Meeihua shiah geh shingchyi yaw chiuh Shanxi hairshih Shaanxi? Pinyin Lǐ Měihuā xià gè xīngqí yào qù Shānxī háishì Shǎnxī? English Is Li Meihua going to Shanxi or Shaanxi next week? Chinese characters 明强很喜欢吃他妈妈做的拉面。 Gwoyeu Romatzyh Ming Chyang heen shiihuan chy ta mhamha tzuoh de lhamiann. Pinyin Míng Qiáng hěn xǐhuān chī tā māmā zuò de lāmiàn. English Ming Qiang really likes to eat the pulled noodles his mother makes. Chinese characters 我喝很多啤酒的时候我会说儿化。 Gwoyeu Romatzyh Woo he heenduo pyijeou de shyrhow woo huey shuo erlhuah. Pinyin Wǒ hē hěnduō píjiǔ de shíhòu wǒ huì shuō érhuà. English When I drink a lot of alcohol, I can speak in erhua. == References == Category:Romanization of Chinese",
 "title": "Gwoyeu Romatzyh"
}