{
 "id": "656056",
 "text": "The Law of the minimum, also called Liebig's law of the minimum, is a law about the growth of plants. It states that the growth of a plant is limited by the resource which is most scarce, and not by the total amount of resources available. The law has also been used to predict the growth of populations. Wassily Leontief (1905-1999) formulated a similar rule for economics: It is known as Leontief production function today. == Liebig's barrel == Dobenecks used the image of a barrel — often called \"Liebig's barrel\" — to explain Liebig's law. In a barrel, with staves of unequal length, the capacity of the barrel is determined by the shortest stave. This is also true for the growth of a plant: it is limited by the nutrient in shortest supply. If a system satisfies the law of the minimum then adaptation will equalize the load of different factors because the adaptation resource will be allocated for compensation of limitation.A.N. Gorban, L.I. Pokidysheva,·E,V. Smirnova, T.A. Tyukina. Law of the Minimum Paradoxes, Bull Math Biol 73(9) (2011), 2013-2044 Adaptation systems act as the cooper of Liebig's barrel and lengthens the shortest stave to improve barrel capacity. Indeed, in well-adapted systems the limiting factor should be compensated as far as possible. This observation follows the concept of resource competition and fitness maximization.D. Tilman, Resource Competition and Community Structure, Princeton University Press, Princeton, NJ (1982). Due to the law of the minimum paradoxes, if we observe the Law of the Minimum in artificial systems, then under natural conditions adaptation will equalize the load of different factors and we can expect a violation of the law of the minimum. Inversely, if artificial systems demonstrate significant violation of the law of the minimum, then we can expect that under natural conditions adaptation will compensate this violation. In a limited system life will adjust as an evolution of what came before. ==References== Category:Botany",
 "title": "Law of the Minimum"
}