{
 "id": "656102",
 "text": "Lori Elaine Lightfoot (born August 4, 1962) is an American lawyer and politician. Lightfoot was the 56th Mayor of Chicago from 2019 to 2023. On April 2, 2019, Lightfoot was elected mayor. She is the first African-American woman and first LGBT individual elected to the position of Mayor of Chicago. She lost her re-election campaign in 2023, becoming the first Chicago mayor to lose re-election in 40 years. ==Early life== Lightfoot was born in Massillon, Ohio. She studied at the University of Michigan, Ann Arbor and University of Chicago. Lightfoot took jobs working for Congress members Ralph Regula and Barbara Mikulski. ==Legal career== Lightfoot had several different jobs working for the government in Chicago. She used to be Chief of Staff and General Counsel of the Chicago Office of Emergency Management and Communications (OEMC). She also used to be First Deputy of the Chicago Department of Procurement Services. Lightfoot was President of the Chicago Police Board and Chair of the Chicago Police Accountability Task Force. A lawyer, she worked for the Senior Equity Partner in the Litigation & Conflict Resolution Group at Mayer Brown LLP. ==Mayor of Chicago== ===Campaign=== On May 10, 2018, Lori Lightfoot announced her candidacy for Mayor of Chicago in the 2019 Mayoral Election. Lightfoot is the first openly-lesbian candidate in the history of Chicago. She, along with Toni Preckwinkle, advanced to the runoff election on April 2. Some activists were against her becoming mayor because she worked with the police. On April 2, 2019, Lori Lightfoot won the election, becoming the first African-American woman and openly lesbian individual to be mayor of Chicago. She got 77% of the vote while Preckwinkle got 23%. ===Tenure=== Lightfoot took office on May 20, 2019. A few days later, Lightfoot picked Tom Tunney as Vice Mayor. People continued to protest against her, especially when the Black Lives Matter movement became even bigger after George Floyd was killed. She had also ordered a stay-at-home order and closed many restaurants and people gatherings due to the COVID-19 pandemic in Illinois. Lightfoot ran for re-election in 2023, however came in third place in the first round of voting, becoming the city's first mayor to lose re- election in 40 years. ==Personal life== Lightfoot lives in the Logan Square neighborhood on Chicago's North Side and is married to Amy Eshleman. They have an adopted daughter named Vivian who was eleven when Lightfoot was elected.Lori Lightfoot plans to tap LGBT voting bloc to make history and reach City Hall - Chicago Sun-Times ==References== ==Other websites== * Category:1962 births Category:Living people Category:Mayors of Chicago Category:Lesbians Category:American LGBT politicians Category:LGBT people from Ohio Category:Politicians from Ohio Category:LGBT people from Chicago Category:Democratic Party (United States) politicians Category:Lawyers from Chicago Category:21st-century American politicians Category:African-American lawyers Category:Businesspeople from Chicago Category:LGBT African-Americans Category:LGBT Christians Category:LGBT lawyers Category:Lawyers from Ohio Category:University of Chicago alumni Category:People from Massillon, Ohio Category:African-American politicians Category:Businesspeople from Ohio",
 "title": "Lori Lightfoot"
}