{
 "id": "656317",
 "text": "Hurricane Florence was a major tropical cyclone, powerful and Cape Verde hurricane in the Atlantic that caused severe and extensive damage in the Carolinas in September 2018. The storm threatened the East Coast of the United States with major and catastrophic flooding, especially in the Carolinas. The sixth named storm, the third hurricane, and the first major hurricane of the 2018 Atlantic hurricane season. Florence first came off from Africa as a tropical wave on August 30, 2018. On August 31, the tropical wave became a tropical depression. It became Tropical Storm Florence on September 1, 2018. The storm strengthened to a major hurricane on September 5, and then strengthened to a Category 4 hurricane with estimated maximum sustained winds of 130 mph later that day. The state Governors of North Carolina, South Carolina and Virginia declared a state of emergency for each state. It was becoming evident that the hurricane might strike South or North Carolina as a major hurricane. Florence later weakened to a strong tropical storm. However, the storm later strengthened back to a hurricane. This time, it strengthened to 140 miles per hour, stronger than it was before. On September 10, 2018, mandatory evacuations were issued in certain parts of North Carolina, South Carolina and Virginia. On September 11, 2018, tropical cyclone watches were posted for the North and South Carolina coastlines. The storm made a slow landfall (7 km/h) on September 14 as a Category 1 hurricane. It had heavy rain. It took energy and water from the warm Gulf Stream near the coast for one day. When the storm was inland, it weakened to a tropical depression. Florence had a wind speed of 140 mph and a central pressure of 939 millibars, but from post-analysis it had a wind speed of 150 mph. Damage from Florence was estimated at $24 billion (2018 USD). There were 53 deaths from Florence. == Retirement == On March 20, 2019, the World Meteorological Organization retired the name Florence due to severe and very expensive damage it caused along its track, particularly in the Carolinas, and it will never again be used for another Atlantic hurricane. It will be replaced with Francine for the 2024 season.Florence and Michael permanently retired from list of Atlantic hurricane names, Washington Post, March 21, 2019 ==References== ==Other websites== *NOAA archives for Florence Category:Hurricanes in South Carolina Category:2018 in the United States Category:August 2018 events Category:September 2018 events Category:Hurricanes in North Carolina Category:2010s in North Carolina Category:2010s in South Carolina Category:2010s in Virginia Category:2018 Atlantic hurricane season Category:Category 4 Atlantic hurricanes Category:Retired tropical cyclone names",
 "title": "Hurricane Florence"
}