{
 "id": "65642",
 "text": "The Fujita scale is a scale used for rating tornado strength, based on the damage tornadoes cause on human-built buildings and vegetation. The official Fujita scale category is determined by meteorologists (and engineers) after a ground and/or aerial damage inspection; also including analysis of available sources such as eyewitness accounts and damage images and/or videos. It was replaced with the Enhanced Fujita scale in the United States in February 2007 and in Canada in April 2013. Scale Wind speed* Relative frequency Common Damage Path Width (meters) Example of DamageFujita Tornado Damage Scale Storm Prediction Center. Accessed 2009-05-20. mph km/h F0 40–72 64–116 38.9% 10 - 50 Light damage Well-built structures are typically unscathed, sometimes with broken windows and minor damage to roofs and chimneys. Billboards and large signs can be knocked down. Trees may have large branches broken off and can be uprooted if they have shallow roots. F1 73–112 117–180 35.6% 30 - 150 Moderate damage Damage to mobile homes and other temporary structures becomes significant. Cars and other vehicles can be pushed off the road or flipped. Permanent structures can suffer major damage to their roofs. F2 113–157 181–253 19.4% 110 - 250 Considerable damage Well-built structures can suffer serious damage, including roof loss. Exterior walls at poorly built structures may collapse. Mobile homes are totally destroyed. Vehicles can be lifted off the ground, and lighter objects can become small missiles, causing damage outside of the tornado's main path. Wooded areas have a large percentage of their trees snapped or uprooted. F3 158–206 254–332 4.9% 200 - 500 Severe damage Well-built structures lose all outer and some inner walls. Trains are overturned. Unanchored homes are swept away, and homes with poor anchoring may collapse entirely. Small vehicles and similarly sized objects are lifted off the ground and tossed as projectiles. Wooded areas suffer almost total loss of vegetation and some tree debarking may occur. F4 207–260 333–418 1.1% 400 - 900 Devastating damage Well-built homes are reduced to a short pile of medium- sized debris on the foundation. Homes with poor or no anchoring are swept completely away. Large heavy vehicles, including airplanes, trains, and large trucks, can be pushed over, flipped repeatedly, or picked up and thrown. Large healthy trees are entirely debarked and snapped off close to the ground or uprooted altogether and become flying projectiles. Passenger cars and similarly sized objects can be picked up and flung for considerable distances. F5 261–318 419–512 <0.1% 1100 ~ Complete destruction Well-built, well-anchored homes go off their foundations and into the air before obliteration. The wreckage is flung for miles, sweeping the foundation clean. Large steel- reinforced structures such as schools are completely leveled. Tornadoes of this intensity tend to shred and scour low-lying grass and vegetation from the ground. Very little recognizable structural debris is generated with most materials reduced to a coarse mix of small, granular particles and dispersed evenly across the tornado's damage path. Large, multiple-ton steel frame vehicles and farm equipment are often mangled beyond recognition and tossed miles away or reduced entirely to unrecognizable component parts. Trains and train cars can be flung 1 mile. Other F0 Rated Tornadoes: Waterspout == Notes == == References == Category:Tornadoes",
 "title": "Fujita scale"
}