{
 "id": "656430",
 "text": "As of the 2024 census, the most common religion in Poland was Christianity as a whole there is approx 98 % Christians however the biggest Denomination/branch is Roman Catholicism, whose followers were 95% of the population, followed by the Eastern Orthodoxy with 0.3%, and various Protestant denominations with 0.7% of the Polish population and 2% for Greek Catholic Churches. == Censuses == Religion 2011 census 2022 census Number % Number % Christianity 34,194,133 99% 40,525,803 98.5 % –Roman Catholics 33,728,734 98% 39,236,000 97.7 % –Orthodox Christians 156,284 0.6% 151,648 0.40% –Jehovah's Witnesses 137,308 0.35% 108,754 0.29% –Baptists 5,982 0.02% 5,181 0.01% –Seventh-day Adventists 4,947 0.01% 3,129 0.01% –Other Christians 11,601 0.03% 12,907 0.03% Buddhism 4,817 0.01% 3,236 0.01% Islam 4,593 0.01% 2,209 0.01% No religion 675,357 1.2% 750,437 1.4% Total 38,511,822 100.00 41,281,265 100.00 == Christianity == About 150 thousand Orthodox people live in Poland, most of whom are members of the Polish Orthodox Church. Protestant groups are estimated to be about 60 thousand believers, especially Evangelical Lutheran Church in Poland. According to church statistics, approximately 55-65% of Catholics attend mass weekly. Some people consider themselves Catholic due to the celebrations, traditions, customs and religious ties they keep with the Polish culture. Mieszko I, the prince of Poland was baptised in 966. He was the first Christian ruler. === Catholic Church === Catholics in Poland are a group of people that contains two subgroups: * Roman Catholic Church * Greek Catholic Church The second one was established in Poland in the 17th century between some groups of Orthodox people and Roman Catholic Church. The most important pilgrimage destinations in the country are: Jasna Góra in Częstochowa and Licheń. The most known Polish saints of the Roman Catholic Church include: John Paul II, Maximilian Kolbe, and Jerzy Popiełuszko. == Judaism == Jews have been living in Poland for more than a thousand years. Until World War II, there were more Jews in Poland than anywhere outside the United States, with approximately 3 million Jews living in Poland. A vast majority was killed during Holocaust or emigrated in the period of antisemitism after World War II. Currently there are about 10,000 Polish Jews, most of whom live in large cities such as Warsaw, Kraków or Łódź. == Islam == A 2021 census states that there are 2209 Muslims (less than 0.01% of the population) living in Poland. There are 3 mosques in Poland, the oldest in Bohoniki and Kruszyniany. Little but some Muslims have lived in Poland for over 500 years, especially in Podlaskie Voivodeship. == References ==",
 "title": "Religion in Poland"
}