{
 "id": "656413",
 "text": "Øystein Aarseth (; 22 March 1968 – 10 August 1993), better known by his stage name Euronymous, was a Norwegian guitarist. Euronymous was a founder of and central figure in the early Norwegian black metal scene. He was a co-founder of the Norwegian black metal band Mayhem and was the only constant member from the band's formation in 1984 until his death in 1993. He was also founder and owner of the extreme metal record label Deathlike Silence Productions and record shop Helvete (Norwegian for \"hell\"). Euronymous said he was a Theistic Satanist and was known for making extreme misanthropic statements. He presented himself as leading a militant cult-like group known as the \"Black Metal Inner Circle\". In August 1993, he was murdered by fellow musician Varg Vikernes. == Murder == In early 1993, there was conflict between Euronymous and Vikernes, as well as between Euronymous and the Swedish black metal scene as a whole. On the night of 10 August 1993, Vikernes and Snorre 'Blackthorn' Ruch drove from Bergen to Euronymous' apartment at Tøyengata in Oslo. There was a confrontation and Vikernes fatally stabbed Euronymous. His body was found on the stairs outside the apartment with 23 stab wounds – two to the head, five to the neck, and 16 to the back. Euronymous' murder was initially blamed on Swedish black metallers by the media. It has been speculated that the murder was the result of a power struggle, a financial dispute over Burzum records, or an attempt at \"outdoing\" the stabbing in Lillehammer. == Discography == Euronymous played guitar on the following albums except where noted, any additional instruments or credits in notes. Band Title Recorded Released Notes Mayhem Pure Fucking Armageddon 1985 1985 Checker Patrol Metalion in the Park 1986 1986 Mayhem Deathrehearsal 1987 1987 Mayhem Deathcrush 1987 1987 Mayhem Live in Leipzig 1990 1993 Burzum Burzum 1992 1992 Producer. Guitar solo on \"War\" and Gong on \"Dungeons of Darkness\" only. Uncredited. Burzum Det som Engang var 1992 1993 Gong on \"Den onde kysten\" only. Uncredited. Mayhem Dawn of the Black Hearts 1990 1995 Posthumous. Cover art photograph. Mayhem Freezing Moon/Carnage 1990 1996 Posthumous. Mayhem Out from the Dark 1991 1995 Posthumous. Mayhem De Mysteriis Dom Sathanas 1992–1993 1994 Posthumous. == References == Category:1968 births Category:1993 deaths Category:Norwegian guitarists Category:Heavy metal guitarists",
 "title": "Euronymous"
}