{
 "id": "656496",
 "text": "Therapeutic abortion is a kind of abortion which is carried out because of medical necessity. In some cases, the pregnancy or childbirth is a medical risk to the health of the mother. In other cases, the unborn child would have grave birth defects. Therapeutic abortion is legal in most countries, even if other forms of abortion are illegal. Some countries also have a rule, that abortion is legal for the first part of the pregnancy and illegal afterwards. Even in these cases, therapeutic abortion is often legal. Different methods can be used to perform a therapeutic abortion. Abortions are either chemical or surgical in nature. ==Methods== === Chemical abortion === Chemical abortions, also known as medical abortions, account for approximately 10% of all abortions in North America and Europe. Chemical abortion is performed during the first trimester of pregnancy. There are several ways to perform a chemical abortion. A medicine called misoprostol can be taken with another medicine called methotrexate. Sometimes only misoprostol is given without methotrexate. Sometimes, these two drugs are given together with a third drug, mifepristone. After a chemical abortion, the woman will bleed for a few days after the miscarriage begins. Some chemical abortions are unsuccessful and require subsequent surgical abortion. === Surgical abortion === There are different types of surgical abortions, done at different times during pregnancy. Aspiration or vacuum abortion is the most common method and can be performed within the first 15 weeks of pregnancy. Manual vacuum aspiration involves using a manual syringe to remove the fetus through suction. Electric vacuum aspiration involves using an electric pump to remove the fetus. Dilation and evacuation can be performed between 15 and 18 weeks and involves the use of suction and surgical instruments to open and empty the cervix. Dilation and curettage (D&C;) involves emptying the uterus using an instrument called a curette. Later in pregnancy, surgical abortion requires the use of other riskie and more controversial procedures. == Possible complications == It is best to do the procedure as early as possible. This will decreases the chance of complications. Problems are rare, but all procedures have some risk. The doctor will go over some problems that could happen, such as: * Excess bleeding * Allergic reaction * Infection * Incomplete procedure == References == Category:Obstetrics and gynecology Category:Pregnancy and childbirth Category:Surgical abortion",
 "title": "Therapeutic abortion"
}