{
 "id": "656588",
 "text": "The list of North Carolina hurricanes is made of seventy-five tropical cyclones that struck or affected the U.S. state of North Carolina between 1900 and 1949. Between 1900-1949, tropical cyclones or their remnants led to 53 deaths in North Carolina. They also caused more than $328 million in damage. ==1900 to 1924== September 15, 1903: A storm known as the Vagabond Hurricane passes just east of the Outer Banks. The storm produces gusty winds. There's very little damage. September 14-15, 1904: After striking South Carolina, a hurricane causes heavy damage and one death while moving across North Carolina. September 3, 1913: A hurricane makes landfall in North Carolina. High tides and wind cause great damage to crops and property. Several bridges are washed away. The hurricane causes around $3 million in damage. There are five deaths from the storm. July 15, 1916: Remnants of a tropical storm drop of rain in a 24-hour period near Highlands, North Carolina. The storm causes flooding and landslides in west-central North Carolina. September 22, 1920: A strong tropical storm strikes land near Wilmington. It destroys or damages several buildings. One person is killed. August 24-25, 1924: A hurricane passes a short distance east of Hatteras. The storm surge floods parts of Ocracoke Island. Two people drown during the storm. ==1925-1949== December 2, 1925: The Outer Banks are struck by a post-season tropical storm. There is very little damage from the storm. August 17, 1928: A tropical cyclone causes heavy rain in the west-central part of North Carolina. The rain causes severe flooding that destroys several houses. Property damage is over $1 million. September 18, 1928: The Okeechobee hurricane causes heavy rain and severe river flooding in the southeast part of North Carolina. October 28-29, 1929: The former 1929 Florida hurricane produces heavy rain in the state. There is severe flooding. The Cape Fear River rises in a 24-hour period. September 11-12, 1930: The 1930 Dominican Republic hurricane brushes Cape Hatteras and the Outer Banks. Damage is minor. August 23, 1933: The 1933 Chesapeake–Potomac hurricane makes landfall along the northeastern part of North Carolina. Damage is locally heavy. Total damage is $250,000. September 14-15, 1933: The Outer Banks hurricane causes heavy rain, high tides and strong winds. Several homes are destroyed, leaving about 1,000 people homeless. Damage is close to $4.5 million. There are twenty-one deaths in North Carolina. September 21, 1938: The 1938 New England hurricane brushes by the Outer Banks, causing heavy rain and gusty winds. August 15, 1940: Remnants of the 1940 South Carolina hurricane die out over North Carolina. The storm has heavy rain. Rain peaks at near Swansboro. There are over twenty deaths from the storm in North Carolina. Many of the deaths are due to mudslides. Damage is $10 million. September 14, 1944: The 1944 Great Atlantic hurricane passes just east of the Outer Banks. It sets records, at the time, for strongest winds and lowest pressure at Hatteras. The storm destroys 108 buildings and damages 667 more. One person is killed in North Carolina. ==References== * Category:20th century in North Carolina Category:Weather lists hurricanes 1900",
 "title": "List of North Carolina hurricanes (1900–49)"
}