{
 "id": "656594",
 "text": "The list of North Carolina hurricanes between 1950 and 1979 includes 79 tropical cyclones that struck or affected the U.S. state of North Carolina. ==1950s== August 14, 1953: Hurricane Barbara hits near Morehead City. It brings rain and winds. Damage is near $1.1 million. One person is killed. August 30-31, 1954: Hurricane Carol passes just east of the state. It produces wind gusts near and rain. Damage is minor. October 15, 1954: Hurricane Hazel comes ashore at the North Carolina/South Carolina border as a mild Category 4 hurricane. The storm destroys 15,000 buildings. It is the most damaging hurricane at the time to affect or hit North Carolina. Damage is near $136 million. Nineteen people are killed by the storm. August 12, 1955: Hurricane Connie strikes the Outer Banks. It drops about of rain. No deaths are reported in North Carolina. Damage totals are around $80 million. August 17, 1955: Hurricane Diane strikes near Wilmington just five days after the previous hurricane. Wind damage is light. There are no deaths in North Carolina. September 18-19, 1955: Hurricane Ione strikes near Morehead City. The storm floods eastern North Carolina with rain and high tides. Ione kills seven people, two indirectly. Damage in the state totals $88 million. September 26-27, 1958: Hurricane Helene moves parallel to the state's coast and the Outer Banks. Winds are . The wind causes moderate structural and crop damage. The overall damage is $11 million. ==1960-1979== September 12, 1960: Hurricane Donna moves across the Outer Banks of North Carolina. There is heavy damage from high winds and waves. Damage in North Carolina is $56.5 million. Eight people are killed, five directly. August 29-30, 1964: Former Hurricane Cleo enters the state as a tropical depression. It causes several tornadoes. It drops heavy rain. October 16, 1964: Hurricane Isbell enters the state at Morehead City with gusty winds and heavy rain. Damage is minor. June 21, 1972: The remnants of Hurricane Agnes become a tropical storm again over the northeastern part of North Carolina. In the state, it causes record river flooding. The storm kills two people in North Carolina. August 9, 1976: Hurricane Belle passes just to the east of North Carolina. It produces a storm tide and strong wind gusts that leave areas flooded. ==References== * Category:1970s in North Carolina Category:Weather lists Hurricanes 1950",
 "title": "List of North Carolina hurricanes (1950–79)"
}