{
 "id": "656538",
 "text": "Dame Susan Jocelyn Bell Burnell (; born 15 July 1943) is a Northern Irish astrophysicist. Her discovery of radio pulsars has been called as \"one of the most significant scientific achievements of the 20th Century\". Her work was recognised by the award of the Nobel Prize in Physics to her thesis supervisor Antony Hewish and to the astronomer Martin Ryle. Bell was excluded, despite having been the first to observe and precisely analyse the pulsars. Burnell won the 2018 Special Breakthrough Prize in Fundamental Physics. == Awards == * The Albert A. Michelson Medal of the Franklin Institute of Philadelphia (1973, jointly with Dr. Hewish). * J. Robert Oppenheimer Memorial Prize from the Center for Theoretical Studies, University of Miami (1978). * Beatrice M. Tinsley Prize of the American Astronomical Society (1986). * Herschel Medal of the Royal Astronomical Society (1989). * Jansky Lectureship before the National Radio Astronomy Observatory (1995). * Magellanic Premium of the American Philosophical Society (2000). * Elected a Fellow of the Royal Society (FRS) (March 2003). * Elected a Fellow of the Royal Society of Edinburgh (FRSE) (2004). * William E. Gordon and Elva Gordon distinguished lecture at the Arecibo Observatory on 27 June 2006. * The Grote Reber Medal at the General Assembly of the International Radio Science Union in Istanbul (19 August 2011) * The Royal Medal of the Royal Society (2015). * The Women of the Year Prudential Lifetime Achievement Award (2015) * The Institute of Physics President's Medal (2017) * Grande Médaille of the French Academy of Sciences (2018) * Special Breakthrough Prize in Fundamental Physics (2018) === Honours === * In 1999, she was appointed Commander of the Order of the British Empire (CBE) for services to Astronomy and promoted to Dame Commander of the Order of the British Empire (DBE) in 2007. * In February 2013, she was assessed as one of the 100 most powerful women in the United Kingdom by Woman's Hour on BBC Radio 4. * In February 2014, she was elected President of the Royal Society of Edinburgh, the first woman to hold that office. She held the position from April 2014 to April 2018 when she was succeeded by Dame Anne Glover. * In 2016, the Institute of Physics renamed their award for early-career female physicists the Jocelyn Bell Burnell Medal and Prize. == Publications == Her publications include: * * ==References== == Works cited == * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * For the follow-up paper, see . * * * * * * * * * * * * * * * * * * For the first paper (announcing the discovery), see . * * * * * * * * * * * * * * * * * * ==Other websites== * Biographical article, indicating Bell Burnell's beliefs and personal life, from California State Polytechnic University NOVA project. (Accessed 24 December 2007). * Irishwoman who discovered the \"lighthouses of the universe\" Irish Times profile. * Counterbalance Library: Bell Burnell talk \"Science and the Spiritual Quest\" (24 Minutes) (Accessed 7 April 2010). * University of Manchester – Jodcast Interview with Jocelyn Bell-Burnell Category:1943 births Category:Living people Category:British physicists Category:British astronomers Category:Academics of the Open University Category:Scientists from Belfast Category:BBC 100 Women",
 "title": "Jocelyn Bell Burnell"
}