{
 "id": "656608",
 "text": "The list of North Carolina hurricanes includes tropical cyclones that affected or struck the U.S. state of North Carolina between 1980s and 1999. Tropical cyclones in North Carolina caused at least $10 billion in damage. Most of that was from Fran and Floyd. These cyclones killed 56 people directly and at least 47 indirectly. The strongest tropical cyclones to affect North Carolina were Hurricane Emily and Hurricane Fran. ==1980s== September 12-13, 1984: Hurricane Diana strikes near Cape Fear. Winds were near . The storm causes three indirect deaths. Damage is $70 million. September 27, 1985: Hurricane Gloria strikes near Hatteras Island. The storm causes severe flooding. In North Carolina, one person is killed. August 17, 1986: Hurricane Charley strikes along North Carolina. Damage is minor. There is one indirect death in the state. September 22, 1989: Hurricane Hugo crosses the west-central part of North Carolina. Its winds destroy or severely damage many buildings in the state. Damage is $1 billion in North Carolina. Seven people in the state are killed. ==1990s== October 12-13, 1990: Tropical Storm Marco brings heavy rain to North Carolina. Four people are killed, two directly. August 18-19, 1991: Hurricane Bob brushes Cape Hatteras and the Outer Banks of eastern North Carolina. Insured damage alone is $4 million. August 30-31, 1993: The western eyewall of Hurricane Emily crosses the northeastern Outer Banks of North Carolina. Its strong winds leave 553 buildings uninhabitable. Damage totals $35 million, mostly on Hatteras Island. Two people are killed. November 16-18, 1994: Hurricane Gordon causes major flooding and strong winds along the Outer Banks. Many beachfront homes in Kitty Hawk are severely damaged or destroyed. September 5-6, 1996: Hurricane Fran strikes around Wilmington. Winds are near . Across the state, Fran causes $2.55 billion in damage. At the time, the storm is the state's worst economic natural disaster. Fourteen people are killed in North Carolina. August 26-27, 1998: Hurricane Bonnie hits near Wilmington. The storm moves slowly. It produces strong winds and heavy rain. One girl is killed in the state. Damage is $480 million. September 15-16, 1999: Hurricane Floyd strikes near Cape Fear. Winds are near . Storm surge is . Damage is over $3 billion. Thirty-five people are directly killed. Another sixteen are indirectly killed. October 18, 1999: Hurricane Irene moves parallel to North Carolina's coastline. One indirect death is reported. ==References== * Category:1980s in North Carolina Category:Weather lists hurricanes 1980 Category:1990s in North Carolina",
 "title": "List of North Carolina hurricanes (1980–99)"
}