{
 "id": "65717",
 "text": "The Keihan Main Line (京阪本線, -honsen?) is a railway line of Keihan Electric Railway. The line starts from Sanjo Station in Kyoto, and ends at Yodoyabashi Station in Osaka, and travels a distance of about 51 km. The line is not \"the Main Line\" but \"the Keihan Main Line\". Trains go direct to the Oto Line. ==Stations== * ●: stop, ↓: pass * ▲: K-Limited Express trains bound for Yodoyabashi stop at Hirakata-shi in the morning. Express trains pass through Hirakata-koen and Moriguchi-shi from the first train until 8:00 a.m. (JST) and at midnight, and Express trains for Demachiyanagi stop at Yodo. Some express trains stop at Yodo during horse racing events. Sub express trains pass through Moriguchishi from the first train until 8:00 a.m. (JST). * Local trains (普通) stop at all stations. Station Semi-Express (区間急行) Sub Express (準急) Express (急行) Limited Express (特急) Rapid Limited Express (快速特急) Connecting Lines Oto Line (from Demachiyanagi Station to Hirakatashi Station or, no Sub Express trains bound for Yodoyabashi from 10:00 a.m. to 5:00 p.m.) Demachiyanagi Station ● ● ● ● Eizan Electric Railway Eizan Main Line Marutamachi Station ● ● ↓ ↓ Keihan Main Line (same rules apply) Sanjo Station ● ● ● ● Kyoto Municipal Subway Tozai Line (Sanjo Keihan Station) Shijo Station ● ● ● ● Hankyu Kyoto Line (Kawaramachi Station) Gojo Station ● ● ↓ ↓ Shichijo Station ● ● ● ● Tofukuji Station ● ↓ ↓ ↓ JR West Nara Line Toba-kaido Station ● ↓ ↓ ↓ Fushimi-Inari Station (Near to Fushimi-Inari Taisha shrine) ● ● ↓ ↓ Fukakusa Station ● ↓ ↓ ↓ Fujinomori Station ● ↓ ↓ ↓ Sumizome Station ● ↓ ↓ ↓ Tambabashi Station ● ● ● ● Kintetsu Kyoto Line (Kintetsu Tambabashi Station) Fushimi-Momoyama Station ● ↓ ↓ ↓ Kintetsu Kyoto Line (Momoyama-Goryomae Station) Chushojima Station ● ● ● ● Uji Line Yodo Station (Near to Kyoto Horce Racing Center) ● ▲ ↓ ↓ Yawatashi Station ● ● ↓ ↓ Otokoyama Cable Line Hashimoto Station ● ↓ ↓ ↓ Kuzuha Station ● ● ● ● ↓ Makino Station ● ● ↓ ↓ ↓ Goten-yama Station ● ● ↓ ↓ ↓ Hirakatashi Station ● ● ● ● ▲ Katano Line Hirakata-koen Station (Near to Hirakata Park) ● ● ▲ ↓ ↓ Kozenji Station ● ● ↓ ↓ ↓ Korien Station (Near to Naritasan-Fudoson Temple) ● ● ● ↓ ↓ Neyagawashi Station ● ● ● ↓ ↓ Kayashima Station ● ● ↓ ↓ ↓ Owada Station ● ↓ ↓ ↓ ↓ Furukawabashi Station ● ↓ ↓ ↓ ↓ Kadomashi Station ● ↓ ↓ ↓ ↓ Osaka Monorail Nishisanso Station ● ↓ ↓ ↓ ↓ Moriguchishi Station ● ▲ ▲ ↓ ↓ Doi Station ↓ ↓ ↓ ↓ ↓ Takii Station ↓ ↓ ↓ ↓ ↓ Sembayashi Station ↓ ↓ ↓ ↓ ↓ Morishoji Station ↓ ↓ ↓ ↓ ↓ Sekime Station ↓ ↓ ↓ ↓ ↓ Osaka Municipal Subway Imazatosuji Line (Sekime-Seiiku Station) Noe Station ↓ ↓ ↓ ↓ ↓ Kyobashi Station ● ● ● ● ● JR West Osaka Loop Line, JR Tozai Line, and Gakkentoshi Line Osaka Municipal Subway Nagahori Tsurumi-ryokuchi Line Temmabashi Station ● ● ● ● ● Nakanoshima Line (Opening in 2008) Osaka Municipal Subway Tanimachi Line Kitahama Station (Sakaisuji) ● ● ● ● ● Nakanoshima Line (Naniwabashi Station, Opening in 2008) Osaka Municipal Subway Sakaisuji Line Yodoyabashi Station (near to Osaka City Hall) ● ● ● ● ● Nakanoshima Line (Oebashi Station, Opening in 2008) Osaka Municipal Subway Midosuji Line Category:Japanese railways",
 "title": "Keihan Main Line"
}