{
 "id": "657469",
 "text": "The Darwin Medal is awarded by the Royal Society once every two years. It is for work in the areas of biology in which Charles Darwin worked. This means evolution, population biology, organismal biology and biological diversity. It was first awarded in 1890. It comes with a £2000 prize. The award is open to candidates from the Commonwealth of Nations or of the Republic of Ireland, with the requirement that they be either a citizen of such a nation or have lived in such a nation for at least three years before the nomination. Since its creation the medal has been awarded over 60 times. The medal was first awarded to Alfred Russel Wallace, who independently developed the theory of evolution by natural selection. == List of recipients == Source: Royal Society Year Name Rationale 1890 For his independent origination of the theory of the origin of species by natural selection. 1892 On account of his important contributions to the progress of systematic botany, as evidenced by the \"Genera Plantarum\" and the Flora Indica; but more especially on account of his intimate association with Mr. Darwin in the studies preliminary to the Origin of Species. 1894 For his researches in comparative anatomy, and especially for his intimate association with Mr. Darwin in relation to the Origin of Species. 1896 For his researches on the life history and societies of the Termitidae, and on the developmental relationship between Leptocephalus and the common eel and other muraenidae. 1898 For his work on the quantitative treatment of biological problems. 1900 For his long-continued and highly important work in zoology all of which has been inspired by the spirit of Darwinism. 1902 For his numerous contributions to the exact study of heredity & variation contained in Hereditary Genius, Natural Inheritance, and other writings. 1904 For his important contribution to the theory of organic evolution by his researches on variation and heredity. 1906 On the ground of the significance and extent of his experimental investigations in heredity & variation. 1908 On the ground of his eminent services in support of the doctrine of evolution by means of natural selection. 1910 On the ground of his South African bionomic researches, in large part undertaken as the outcome of correspondence with Charles Darwin. 1912 On the ground of his work in conjunction with Charles Darwin, and his researches in vegetable physiology. 1914 On the ground of his researches in heredity. 1916 On the ground of researches in zoology and biology. 1918 For his valuable researches on vertebrate morphology and palaeontology. 1920 On the ground of his work on scientific principles applied to the breeding of plants. 1922 For his researches in the science of genetics. 1924 For his valuable work in zoology and more especially his researches on heredity and cytology. 1926 For his contributions to palaeophytology, particularly in relation to the period of coal. 1928 For the eminence of his contributions to ecological botany. 1930 For his work on extended oceanographical expeditions; and for his genetic studies in animals and plants. 1932 As one of the three independent discoverers of Mendels publications; and for his distinguished researches in genetics. 1934 In recognition of his work as a palaeobotanist. 1936 In recognition of his long continued work for the advancement of marine biology, not only by his own researches but by the great influence he has exerted on very numerous investigations at Plymouth. 1938 In recognition of his work of acknowledged distinction in the field in which Darwin himself laboured. 1940 For his contributions to the solution of problems bearing on the inter-relationships of the main groups of the Mammalia and on the phylogenetic history of the primates, a subject with which Charles Darwin himself was much concerned. 1942 In recognition of his researches on primitive fishes and amphibians which have much advanced the knowledge of the evolution of these groups of animals. 1944 In recognition of his work on coral reefs and on the organisms associated with such habitats. 1946 In recognition of his outstanding contributions to the development of biology. 1948 In recognition of his distinguished contributions to the theory of natural selection, the concept of its gene complex and the evolution of dominance. 1950 For his distinguished contributions to the study of algology. 1952 In recognition of his initiation of the modern phase of the study of the evolution of living populations. 1954 In recognition of his distinguished contributions to the genetical theory of evolution by natural selection, particularly in natural populations. 1956 In recognition of his distinguished contributions to the study and theory of evolution. 1958 In recognition of his distinguished contributions to evolutionary biology. 1960 In recognition of his distinguished and strikingly original botanical work in tropical forests. 1962 In recognition of his distinguished contributions to general evolutionary theory, based on a profound study of palaeontology, particularly of vertebrates. 1964 In recognition of his distinguished contributions to knowledge of cytology and genetics. 1966 In recognition of his distinguished and extensive contributions in the field of invertebrate zoology and to our understanding of general biological phenomena. 1968 In recognition of his many distinguished contributions to evolutionary biology, particularly of the mollusca. 1970 In recognition of the basic concepts he has contributed to the study of animal ecology which, with his foundation of the Bureau of Animal Population, have had international impact. 1972 In recognition of his distinguished and numerous contributions to ornithology and to our understanding of evolutionary mechanisms. 1974 In recognition of his outstanding work on natural populations of butterflies, describing and explaining the operation of natural selection and demonstrating the genetic basis upon which selection operates. 1976 In recognition of her discovery of and continuing work on chemical mutagenesis. 1978 In recognition of his discovery of somatic recombination in fungi which led to the elucidation of an important type of genetic variation. 1980 In recognition of his outstanding contributions to genetics and evolutionary theory. 1982 and Yolande Heslop- Harrison In recognition of their major contributions to plant physiology including fundamental studies on insectivorous plants, much of this research carried out jointly. 1984 In recognition of his distinguished contributions to evolutionary biology. 1986 In recognition of his outstanding success in combining mathematics with biology to enhance our understanding of evolution, in particular the evolution of sex. 1988 In recognition of his distinguished work on evolutionary theory. His contributions include the theory of kin selection to account for altruistic behaviour and the theoretical demonstration of a link between disease resistance and the evolution of sex. 1990 For his research on the population biology and evolution of plants which has greatly improved understanding of the adaptation of plants to their environment. 1992 Distinguished for his work on molecular evolution, in particular on the role of stochastic events in determining the rate of evolution. 1994 In recognition of his analysis of pattern formation during insect segmentation, and of his contribution to understanding how genetic processes specify spatial information. 1996 In recognition of his leadership in the study of genome analysis with the potential to have a profound impact on the whole of biology. 1998 and Graham Moore In recognition of their work on cereal genome organisation and evolution which has revolutionised cereal genetics by showing that the genetics of all the different cereals can be considered in a common framework. 2000 In recognition of his distinguished work on selection in age-structured populations, extending the theory to the evolution of ageing, and testing the theories of mutation accumulation and pleiotropy, developing models for the evolution of genetic systems, including sex and recombination, inbreeding and outbreeding, separate sexes and sex chromosomes, segregation distortion and repetitive DNA. 2002 for their fundamental work on the ecology, breeding and evolution of Darwin's finches on the Galapagos islands. This work has become the classic example of Darwinian evolution in the wild. 2004 and Rosemary Carpenter for their ground-breaking discoveries about the control of flower development. They have combined molecular and genetic approaches to answer some of Darwins key questions about the natural variation of floral form and the evolution of floral development. 2006 for his major and extensive contributions to evolutionary biology, characterised by the application of sophisticated mathematical analysis but focussed on developing biological understanding rather than mathematical niceties. 2008 for his lifetime contribution to the foundations and development of behavioural ecology, in particular for understanding evolutionary adaptations and their consequences for natural populations. 2010 for his original and influential contributions to our understanding of the genetic basis of evolution. 2012 for his outstanding work on the diversity of animal societies and demonstration of their effects on the evolution of reproductive strategies, the operation of selection and the dynamics of populations. 2014 John Sutherland for his novel and convincing work on prebiotic chemistry, in particular his solution to the central problem of nucleoside synthesis. 2016 Caroline Dean for her work addressing fundamental questions in the perception of temperature cues and how modifications in epigenetic mechanisms play an important role in adaptation. 2018 William Hill for his contribution to our understanding of the genetics of quantitative traits and response to selection. == References == Category:Royal Society Category:Science awards Category:1890 establishments in Europe Category:1890s establishments in the United Kingdom",
 "title": "Darwin Medal"
}