{
 "id": "657564",
 "text": "The American Physical Society (APS) is the world's second largest organization of physicists. The Society publishes more than 12 scientific journals, including the Physical Review and Physical Review Letters. It organizes more than 20 science meetings each year. APS is a member society of the American Institute of Physics. ==History== The American Physical Society began on May 20, 1899, when a group of 36 physicists met at Columbia University to set up a society \"to advance and diffuse the knowledge of physics\". At the start the APS only held scientific meetings. In 1913 it took over the Physical Review, which had begun in 1893 at Cornell University. The Physical Review was followed by Reviews of Modern Physics in 1929 and by Physical Review Letters in 1958. The APS is now active in public and governmental affairs, and in the international physics community. It has programs in education, science outreach (specifically Physics Outreach), and media relations. APS has about 50,000 members. In 1999, APS Physics celebrated 100 years with the biggest- ever physics meeting in Atlanta. In 2005, APS took the lead role in United States participation in the World Year of Physics. It started several programs to publicize physics during the 100th anniversary of Albert Einstein's annus mirabilis. Einstein@Home, is still an ongoing and popular distributed computing project. == APS journals == The American Physical Society publishes 13 research journals and a news and commentary website Physics. * Physical Review Letters (PRL) * Reviews of Modern Physics (RMP) * Physical Review A (PRA): Atomic, molecular and optical physics. * Physical Review B (PRB): Condensed matter and materials physics. * Physical Review C (PRC): Nuclear physics. * Physical Review D (PRD): Particles, fields, gravitation, and cosmology. * Physical Review E (PRE): Statistical, nonlinear, and soft matter physics. * Physical Review X (PRX): Open access; pure, applied, and interdisciplinary physics. * Physical Review Applied (PRApplied): Experimental and theoretical applications of physics. * Physical Review Fluids (PRFluids): Fluid dynamics. * Physical Review Accelerators and Beams (PRAB): Open access; accelerator science and technology. * Physical Review Physics Education Research (PRPER): Open access; experimental and theoretical research on physics education. * Physical Review Materials (PRMaterials): A broad-scope international journal for the multidisciplinary community engaged in research on materials. All members of APS receive the monthly publication Physics Today, published by the American Institute of Physics (AIP). ==Prizes and awards== The American Physical Society gives out a number of awards including the Andrei Sakharov Prize (APS) for outstanding leadership, Aneesur Rahman Prize for Computational Physics, Arthur L. Schawlow Prize in Laser Science, Dannie Heineman Prize for Mathematical Physics, Lars Onsager Prize in theoretical statistical physics, and more. ==References== ==Other websites== * Official American Physical Society website * Bulletin of the American Physical Society — freely available scientific abstracts presented at general meetings and various unit meetings of APS Physics. * Finding Aid to the Records of the American Physical Society , 1899-1989 at the Niels Bohr Library & Archives, American Institute of Physics * Finding Aid to the American Physical Society, Division of Fluid Dynamics Archives , 1946-1991, Special Collections, Linderman Library, Lehigh University Category:1899 establishments in the United States .",
 "title": "American Physical Society"
}