{
 "id": "657552",
 "text": "Grigory Efimovich Volovik (; born 7 September 1946 in Moscow) is a Russian theoretical physicist. He is known for his work on solid-state physics and astroparticle physics. His series work in 1970s-2000s about semi metal and topologically protected spinor/femionic excitations in topological defects and boundary are paid enormous amount attentions in recent decade years because the discoveries about the topological solid state materials and potentially technical application on quantum computation. He also contributes a lot on emergent quantum field theory and gravity theory, one idea is phenomenological Q theory of cosmological constant problem. == Life == Volovik completed his master's degree at the Physico-Technical Institute in Moscow. In 1973 he went to the Landau Institute in Moscow, becoming Senior scientist in 1992. He completed his PhD in 1973 with a thesis called the Dynamics of a particle strongly interacting with a Bose System. In 1981, his habilitation (Russian doctor degree) was on the Topology of defects in condensed matter. In 1993, he was made Professor at the laboratory for low temperature physics of the Technical University of Helsinki (today's Aalto University), but still worked at the Landau Institute. In 1992, he received the Landau prize of the Russian Academy of Sciences. In 2004, he received the Simon Memorial Award in low-temperature physics for his fundamental research on the role of symmetry in low-temperature physics, and applications in Cosmology, quantum gravity, quantum field theory and particle physics (Eulogy). from 2003 to 2006 he was the leader of the European science Foundation, Cosmology in the Laboratory. Volovik is the author of several books and of more than 340 scientific journal publications. In 2001, he became a member of the Finnish Academy of Sciences and in 2007, the Academy of Sciences Leopoldina. In 2014, he was awarded the Lars Onsager prize. == Researches in Physics == One of his contributions in middle of 1970s together with colleges was independently clarify the relationship between topology (Homotopy) of order parameter manifold and defects. Together with few work about topological property of instanton in high energy physics during that time, those work are enter in textbook nowaday. In 1996, the Chiral anomaly originating from the Fermi/Weyl point in superfluid helium-3 has been observed.Momentum creation by vortices in superfluid helium-3 as a model of primordial baryogenesis | Nature After almost twenty years, same phenomena has been observed in solid material experiment. In 1999, he firstly claimed that the existence of Majorana fermion zero mode located in the core of vertex in spinless superconductors.Fermion zero modes on vortices in chiral superconductors | Springer for Research & Development == Publications == * The Universe in a Helium Droplet. Clarendon Press, Oxford, 2003, 2009. * Exotic properties of superfluid Helium-3. World Scientific 1992. * with Matt Visser and Mario Novello (ed.): Artificial Black Holes. World Scientific 2002 (from Volovik: Effective Gravity and quantum vacuum in super-fluid) * R. Huebener, and N. Schopohl (EDS.): Vortices in unconventional superconductors and super fluids. Springer Verlag, 2002. * with M. Salomaa Quantized vortices in superfluid He3. In: Reviews of Modern Physics. Band 59, 1987, P. 533-613. == Sources == * Biographical note in the summer school and Relevant problem in the theory of condensed state. Zelenogorsk 2010, pdf * Member entry by Grigory E. Volovik, 10 August 2015, German Academy of natural scientists Leopoldina == Other websites == * Homepage in Helsinki * Page at the Landau Institute publication list * Fermion zero modes on vortices in chiral superconductors | Springer for Research & Development == References == Category:1946 births Category:Russian theoretical physicists Category:Living people",
 "title": "Grigory E. Volovik"
}