{
 "id": "657776",
 "text": "William Thomson, 1st Baron Kelvin, (26 June 1824 – 17 December 1907) was a Scots-Irish mathematical physicist and engineer. He was born in Belfast in 1824. At the University of Glasgow he did important work in the mathematical analysis of electricity and formed the first and second laws of thermodynamics. ==Works== Kelvin did much to unify physics in its modern form. He also had a career as an electric telegraph engineer and inventor, which propelled him into the public eye and gave him wealth, fame and honour. For his work on the transatlantic telegraph project he was knighted in 1866 by Queen Victoria, becoming Sir William Thomson. He was noted for his work on the mariner's compass. This had been rather unreliable owing to the iron in ships' hulls. Absolute temperatures are stated in units of kelvin in his honour. The existence of a lower limit to temperature (absolute zero) was known before his work, but Lord Kelvin found its correct value as approximately −273.15 degree Celsius or −459.67 degree Fahrenheit. He was made Lord Kelvin in 1892 in recognition of his achievements in thermodynamics, and of his opposition to Irish Home Rule.Kelvin and Ireland Raymond Flood, Mark McCartney and Andrew Whitaker (2009) J. Phys.: Conf. Ser. 158 011001 p.162 He became Baron Kelvin, of Largs in the County of Ayr. He was the first British scientist to be elevated to the House of Lords. His title refers to the River Kelvin, which flows close by his laboratory at the University of Glasgow. Despite offers from several world-renowned universities, Lord Kelvin refused to leave Glasgow, remaining Professor of Natural Philosophy for over 50 years, until his eventual retirement. The Hunterian Museum at the University of Glasgow has a permanent exhibition on the work of Lord Kelvin. Always active in industrial research and development, he was recruited around 1899 by George Eastman to serve as vice-chairman of the board of the British company Kodak Limited, affiliated with Eastman Kodak.Lord Kelvin, Recipient of The John Fritz Medal in 1905 Matthew Trainer, Physics in Perspective, (2008) 10, 212-223 == References == Category:1824 births Category:1907 deaths Category:Scientists from Belfast Category:British physicists Category:British mathematicians Category:People buried in Westminster Abbey Category:Knights Grand Cross of the Royal Victorian Order Category:Fellows of the Royal Society Category:Presidents of the Royal Society Category:Knights Bachelor Category:Irish physicists Category:Academics of the University of Glasgow",
 "title": "William Thomson"
}