{
 "id": "657711",
 "text": "Walter Mischel (; February 22, 1930 – September 12, 2018) was an Austrian-born American psychologist. He was born in Vienna. He worked in personality theory and social psychology. He was the Robert Johnston Niven Professor of Humane Letters in the Department of Psychology at Columbia University. He was ranked as the 25th most cited psychologist of the 20th century. Mischel died on September 12, 2018 in New York City from pancreatic cancer at the age of 88. In 1960, he wanted to learn about patience in children. He did a test with kids who were 3 to 5 years old.He leaves children alone in the room at the table with only one marshmallow in front of them and tells them “ You can eat this now, or wait 15 minutes and get one more marshmallow ” to see if they can learn to wait for 15 minutes to get another marshmallow. Some of the children can’t wait for 15 minutes and choose to eat the marshmallow right away. On the other side some children choose to wait for 15 minutes and get 1 more marshmallow as a reward. In the meantime Walter Mischel noticed that the children who can wait for another marshmallow noticed that the kids who waited found ways to distract themselves , like singing a song , closing their eyes or looking around the room. Later, Walater Mischel found out that children who can wait to eat other marshmallows have a better life outcome. These children usually did better in school and life .Better than the children who choose to eat the marshmallow right away. His test showed that learning to wait can help people succeed in the future. This test happened with just one marshmallow that can show us that children can contribute to success in the future. ==References== Category:1930 births Category:2018 deaths Category:Deaths from pancreatic cancer Category:Cancer deaths in New York City Category:Austrian scientists Category:Naturalized citizens of the United States Category:American psychologists Category:Writers from Vienna",
 "title": "Walter Mischel"
}