{
 "id": "657938",
 "text": "Greatest Royal Rumble was a professional wrestling pay-per-view and WWE Network livestreaming event made by WWE for their Raw and SmackDown brands. It took place on April 27, 2018 at the King Abdullah Sports City's King Abdullah International Stadium in Jeddah, Saudi Arabia. It aired live in the United States at 12:00 PM EDT, with a pre-show starting at 11 a.m. EDT. At the event, all men's main roster championships were defended, in addition to a 50-man Royal Rumble match. It was the first big event in a ten-year partnership between WWE and the Saudi-Arabian Ministry of Sport. Other on-screen personnel Role: Name: English commentators Michael Cole English commentators Corey Graves English commentators Byron Saxton Spanish commentators Carlos Cabrera Spanish commentators Marcelo Rodríguez Arabic commentators Faisal Almughaisib Arabic commentators Sultan Alharbi Arabic commentators Jude Aldajani Ring announcer Greg Hamilton Referees Danilo Anfibio Referees Jason Ayers Referees John Cone Referees Dan Engler Referees Darrick Moore Referees Chad Patton Referees Ryan Tran Interviewer Mike Rome Pre-show panel Byron Saxton Pre-show panel Jerry Lawler Pre-show panel Jim Ross Pre-show panel Booker T ==Matches== * John Cena vs Triple H The actual pay-per-view started with John Cena facing Triple H. During the match, Cena performed an Attitude Adjustment on Triple H for a near-fall. Cena attempted another Attitude Adjustment but Triple H countered into a Pedigree for a near-fall. In the end, Cena performed a second Attitude Adjustment on Triple H, a catapult into the corner, and a third Attitude Adjustment to pick up the victory. Following the match, Cena thanked the Kingdom of Saudi Arabia for their hospitality, and expressed excitement over the event. * Cedric Alexander vs Kalisto Cedric Alexander defended the Cruiserweight Championship against Kalisto. The match ended when Alexander countered a Salida Del Sol attempt into a Lumbar Check to retain the title. * Bray Wyatt and Matt Hardy vs Cesaro and Sheamus The vacant Raw Tag Team Championship was contested between the team of Bray Wyatt and Matt Hardy and the former champions, Cesaro and Sheamus. In the end, Hardy distracted Sheamus, allowing Wyatt to perform a Sister Abigail on him. Hardy and Wyatt then performed a wheelbarrow Twist of Fate on Sheamus to win the title. * Jeff Hardy vs Jinder Mahal Jeff Hardy then defended the United States Championship against Jinder Mahal. Hardy performed a Swanton Bomb on Mahal to retain the title. * The Bludgeon Brothers (Harper and Rowan) vs The Usos (Jimmy and Jey Uso) The Bludgeon Brothers defended the SmackDown Tag Team Championship against The Usos. Harper and Rowan retained the title after performing The Reckoning on Jimmy Uso. * Seth Rollins vs Finn Bálor vs Samoa Joe vs The Miz Seth Rollins defended the Intercontinental Championship against Finn Báor, Samoa Joe and The Miz in a Ladder match. Near the end of the match, Bálor attempted to grab the title, only for Rollins to springboard onto the ladder and grab the title belt himself, retaining the championship. In a segment between matches, four prospects from the recent Saudi tryouts came out to the ring to introduce themselves. Cruiserweight Ariya Daivari and his brother Shawn Daivari, who had not appeared for WWE in many years, came out to interrupt them. The Saudi prospects attacked and cleared the Daivari brothers from the ring. * AJ Styles vs Shinsuke Nakamura AJ Styles defended the WWE Championship against Shinsuke Nakamura. During the match, Nakamura resorted to various illegal tactics, such as a low blow, increasingly frustrating Styles. In the end, both Nakamura and Styles fought outside of the ring, only for the match to end in a double countout. After the match, Styles performed a Phenomenal Forearm to the floor on Nakamura. * The Undertaker vs Rusev The Undertaker fought Rusev in a Casket match. At the end of the match, Undertaker performed a chokeslam on Rusev and rolled him into the casket. Before he could close the lid, English attacked the Undertaker, who retaliated with another chokeslam and a Tombstone Piledriver before putting English into the casket alongside Rusev and closing it for the victory. * Brock Lesnar vs Roman Reigns In the second to last match, Brock Lesnar (managed by Paul Heyman) defended the Universal Championship against Roman Reigns in a steel cage match. Reigns performed three spears on Lesnar for a near-fall. Reigns tried to escape through the door but Heyman pushed the door into Reigns, allowing Lesnar to execute an F5 on Reigns for a near-fall. In the end, Reigns performed a Spear through the cage wall on Lesnar. Despite Reigns touching the floor first, the referee awarded the win to Lesnar, retaining the Universal Championship. === Main Event === * 50 man Royal Rumble match Braun Strowman eliminated Big Cass to win the match. Strowman also got the most eliminations of a single Royal Rumble match at 13, beating a record previously held by Roman Reigns with 12. Strowman received a trophy and a green championship belt. == Results == ===Greatest Royal Rumble match entrances and eliminations=== : – Raw : – SmackDown : – NXT : – Free agent Draw Entrant Order Eliminated by Time Elimination(s) 1 Daniel Bryan 48 Big Cass 1:16:05 3 2 Dolph Ziggler 12 Kurt Angle 21:44 2 3 Sin Cara 1 Dolph Ziggler 01:18 0 4 Curtis Axel 2 Mark Henry 02:00 0 5 Mark Henry 5 Daniel Bryan and Dolph Ziggler 03:27 3 6 Mike Kanellis 3 Mark Henry 00:03 0 7 Hiroki Sumi 4 Mark Henry 00:46 0 8 Viktor 6 Daniel Bryan 00:51 0 9 Kofi Kingston 14 Elias 16:34 1 10 Tony Nese 9 Kofi Kingston and Xavier Woods 07:13 1 11 Dash Wilder 7 Daniel Bryan and Hornswoggle 01:26 0 12 Hornswoggle 8 Tony Nese 01:00 1 13 Primo Colón 11 Kurt Angle 05:10 0 14 Xavier Woods 15 Elias 09:56 1 15 Bo Dallas 10 Kurt Angle 01:34 0 16 Kurt Angle 16 Elias 07:59 3 17 Scott Dawson 19 Bobby Roode 11:44 0 18 Goldust 18 Bobby Roode 10:04 0 19 Konnor 13 Elias 02:25 0 20 Elias 41 Bobby Lashley 34:04 5 21 Luke Gallows 20 Rey Mysterio 09:16 0 22 Rhyno 25 Roderick Strong 16:22 0 23 Drew Gulak 17 Tucker Knight 01:47 0 24 Tucker Knight 23 Big E 10:08 1 25 Bobby Roode 29 Baron Corbin 17:44 2 26 Fandango 21 Mojo Rawley 03:42 0 27 Chad Gable 24 Apollo Crews 08:17 0 28 Rey Mysterio 37 Baron Corbin 20:25 1 29 Mojo Rawley 27 Randy Orton 08:52 2 30 Tyler Breeze 22 Mojo Rawley 00:16 0 31 Big E 33 Braun Strowman 13:59 1 32 Karl Anderson 26 Randy Orton 04:25 0 33 Apollo Crews 28 Randy Orton 03:26 1 34 Roderick Strong 30 Baron Corbin 06:00 1 35 Randy Orton 39 Elias 10:58 4 36 Heath Slater 34 Braun Strowman 07:38 0 37 Babatunde 31 Braun Strowman 05:53 0 38 Baron Corbin 38 Randy Orton 07:08 3 39 Titus O'Neil 35 Braun Strowman 04:42 0 40 Dan Matha 32 Braun Strowman 02:01 0 41 Braun Strowman Winner 13 42 Tye Dillinger 36 Braun Strowman 00:29 0 43 Curt Hawkins 40 Braun Strowman 00:20 0 44 Bobby Lashley 45 Braun Strowman 14:38 2 45 The Great Khali 42 Braun Strowman and Bobby Lashley 00:31 0 46 Kevin Owens 47 Braun Strowman 10:43 0 47 Shane McMahon 44 Braun Strowman 08:07 0 48 Shelton Benjamin 43 Chris Jericho 04:23 0 49 Big Cass 49 Braun Strowman 07:23 1 50 Chris Jericho 46 Braun Strowman 03:18 1 * By eliminating 13 men, Braun Strowman broke the record of 12, set by Roman Reigns at the 2014 Royal Rumble. * Daniel Bryan broke the length record for lasting 1:16:05, previous record held by Rey Mysterio (lasting 1:02:12) at the 2006 Royal Rumble. == References == == Other websites == * Category:Royal Rumble Category:April 2018 events Category:2018 in Asia Category:2010s in Saudi Arabia Category:Asian culture Category:Jeddah Category:World Wrestling Entertainment pay-per-view events Category:Professional wrestling Category:World Wrestling Entertainment championships",
 "title": "Greatest Royal Rumble"
}