{
 "id": "657913",
 "text": "Peter Brian Hegseth (born June 6, 1980) is an American political commentator, television presenter, author and Army National Guard officer who has been the 29th United States Secretary of Defense since 2025. Hegseth was in the U.S. military with deployments to Cuba and Iraq. He began working for Fox News as a commentator in 2014 and was a co-host of Fox & Friends Weekend from 2017 to 2024. He was the executive director of Vets for Freedom and Concerned Veterans for America. He was thought to be the United States Secretary of Veterans Affairs under the Donald Trump presidency, but major veterans' groups objected, and in January 2017, David Shulkin was selected instead.DAVE PHILIPPS, \"Head of Veterans Health System Is Trump's Pick to Lead Veterans Affairs\", The New York Times, January 11, 2017.Veterans Groups Urge Trump to Keep Obama’s V.A. Secretary, Dave Philipps, The New York Times, December 12, 2016 In November 2024, President-elect Trump announced that he intends to nominate Hegseth for Secretary of Defense. In 2025, he was involved in the United States government group chat leak, also known as Signalgate. ==Early life== Hegseth was born in Minneapolis, Minnesota. He was raised in nearby Forest Lake. Hegseth graduated from Princeton University in 2003. In 2013, he received a Master of Public Policy (MPP) from the John F. Kennedy School of Government at Harvard University. == Military career == Following graduation from Princeton in 2003, Hegseth joined Bear Stearns. He was also commissioned as an infantry officer in the Minnesota National Guard. In 2004 he went to Guantanamo Bay Naval Base, where he was an infantry platoon leader. Hegseth volunteered to serve in Baghdad and Samarra. During his time in Iraq, he was awarded the Bronze Star Medal, Combat Infantryman Badge, and a second Army Commendation Medal. He returned to active duty in 2012 as a captain. By 2015 or 2016, Hegseth had been promoted to the rank of major, and was assigned to the Army Individual Ready Reserve. == U.S. Senate campaign == In 2012, Hegseth ran for the Republican nomination for the U.S. Senate seat in Minnesota. He ended his campaign after the May 2012 convention, before the Republican primary election in August. == Fox News == Hegseth joined Fox News as a contributor in 2014. In December 2018, Hegseth co-hosted Fox News Channel's All-American New Year with Fox Business Network's Kennedy. He was a regular guest on Unfiltered with Dan Bongino. From 2017 until 2024, he was a co-host of Fox & Friends. ==U.S. Secretary of Defense== ===Nomination=== In November 2024, President-elect Donald Trump announced that he planned to nominate Hegseth to serve as the next Secretary of Defense. Several days later, a woman sent a memo to Trump's transition team about a 2017 sexual assault allegation against Hegseth. Several senators later said they were worried about Hegseth being the Defense secretary nominee. He appeared before the Senate Armed Services Committee on January 14, 2025. During the hearing, Hegseth denied allegations of sexual assault, marital infidelity, and public drunkenness. On January 21, senators received an affidavit from his former sister-in-law, Danielle Hegseth, stating that she had seen Hegseth's bad behavior and believed that \"Hegseth has an alcohol abuse problem\", believed that he \"was abusive to his ex-wife Samantha\", and swore that Samantha had \"hid in her closet from Hegseth because she feared for her personal safety\". Hegseth denied the affidavit's claims and his ex-wife said he was never physically abusive. On January 23, 2025, Senators Susan Collins, R-Maine, and Lisa Murkowski, R-Alaska, voted no for the nomination process to move towards the confirmation process in the Senate. All Senate Democrats also voted no for this step in the confirmation process, given the total 51–49 vote, moving his nomination for a full Senate vote on January 24, 2025. He was confirmed by the Senate in a 51–50 vote on January 24, 2025, with Vice President JD Vance casting the tie-breaking vote. Collins, Murkowski and Mitch McConnell of Kentucky joined all Senate Democrats in voting against Hegseth. ===Time in office=== Hegseth was sworn in as secretary of defense on January 25, 2025 by Vice President JD Vance. In a call to Israeli prime minister Benjamin Netanyahu a day after being sworn in, Hegseth said that the United States was \"fully committed\" to the security of Israel. Hegseth visited the Mexico–United States border with Tom Homan, Trump's border czar, in El Paso, Texas, in February. Hegseth told Asian allies (May 2025), that those allies \"they weren’t spending enough on their own defense\".https://www.politico.com/news/2025/05/30/hegseth-warns-asia-allies- that-china-threat-is-imminent-00378700. Retrieved 2025-05-31 ====Signal chat leak==== From March 11 to 15, 2025, a group of United States national security leaders had a conversation on a group chat using the Signal messaging service about a military operations against the Houthis in Yemen. Among the chat's members were Hegseth, Vice President Vance, top White House staff, CIA director John Ratcliffe, and Secretary of State Marco Rubio. A leak of the chat happened when National Security Advisor Mike Waltz a journalist from The Atlantic to the group by accident. On March 15, Hegseth used the chat to share sensitive and classified details of the airstrikes, including types of aircraft and missiles, as well as launch and attack times. On April 20, 2025, The New York Times reported that Hegseth started another Signal group chat called \"Defense ' Team Huddle\". This chat had information about the timing of airstrikes, and included Hegseth's brother, his wife and about a dozen other people. == Personal life == Hegseth and his first wife, Meredith Schwarz, divorced in 2009. He married his second wife, Samantha Deering, in 2010. They have three children. Hegseth lived near Nashville, Tennessee with his family. In August 2017, while still married to Deering, Hegseth had a daughter with Fox executive producer Jennifer Rauchet. He and Deering divorced in August 2017. Hegseth and Rauchet married in August 2019. ==Other information== He has tattoos. Before the U.S. Congress gave confirmation that he could have the job as Secretary of Defense, media said that Hegseth has a tattoo that has a political meaning. He has showed that kind of tattoo on social media, according to media outlets. Earlier (2020), Hegseth volunteered as one of the up-to-25,000 National Guard troops to be put on active duty to protect the inauguration of President Joe Biden on January 20, 2021, but was removed from that mission because he was one of twelve soldiers \"linked to 'right-wing militia groups,' or found to have 'posted extremist views online.'\" New advisers (as of April 2025), are \"the former military aide, Colonel Ricky Buria; Justin Fulcher, a tech entrepreneur and DOGE adviser; and Patrick Weaver\", a government worker.https://www.politico.com/news/2025/04/28/caroll- hegseth-pentagon-00312849. Retrieved 2025-04-29 ==References== ==Other websites== * Hegseth at the Princeton Tory * Category:1980 births Category:Living people Category:American television personalities Category:American political commentators Category:Fox News people Category:Military people from Minnesota Category:Writers from Minneapolis Category:Politicians from Minneapolis Category:Republican Party (United States) politicians Category:American political activists Category:Politicians from Nashville, Tennessee Category:Writers from Nashville, Tennessee Category:Military people from Tennessee Category:United States Secretaries of Defense",
 "title": "Pete Hegseth"
}