{
 "id": "658212",
 "text": "Harry Allen (1882-27 December 1922 Washinton State Death Records - Nell Pickerell.) was a transgender man who was written about in newspaper headlines between 1900 and 1922. He was born Nell Pickerell, but was known as Harry Livingstone from 1900 until 1911, and as Harry Allen from 1911 until his death in 1922. He had several female lovers; one committed suicide, and another attempted suicide. Meet Nell Pickerell, transgender at-risk youth of yesteryear. The Tacoma Times: \"Fighter, Bootlegger and \"Bad Man\" is Miss Pickerell for Love of Whom Three Women Have Killed Themselves\" The woman who had committed suicide was treated as two different suicide victims in the media, as she had used different names for herself in the past. Newspapers wrote about his crimes such as prostitution and drinking alcohol. He got a lot of media attention because he was seen as a woman pretending to be a man.Boag, P. (2011) \"Re-dressing America's Frontier Past\" University of California, Ltd. London, England. pp 23-30. ==Articles== May 30 1900: bar fighting. The Saint Paul globe: \"Tunnel City, The Wickedest Town on Earth\" September 12 1901: being a vagrant , fighting the officer arresting him and causing both of them to land in a puddle of mud. The Seattle star:\"In Man's Clothes\" \"Officer tries to arrest her - both fall over precipice into mud\". October 12 1901: Stealing $42. The Seattle Star: \"Girl in trousers Arrested for Stealing $42 - it's Nell Pickerell, again\" $42 dollars would be about $1,245.90 in modern money. in2013dollars $42 in 1901 → $1,245.90 in 2018 December 25 1901: Suicide of his lover, Dolly Quappe. The San Francisco call: \"Suicide Ends the Love Affair\" The Salt Lake Herald: \"Dolly Quappe lovfd (sic) Nellie Pickerell\" Kootenai County Republican: \"Late news items\" covers Dolly Quappe's suicide. Washington Standard: \"State News\" covers Dolly Quappe's suicide. The Minneapolis Journal: \"Tragedy closes a strange love affair - Dolly thought deceiver a boy - Jealous of Nell Pickerell, Masquerading as a Man, a Waitress Kills Herself\" The Colfax Gazette: \"Northwest News\" covers Dolly Quappe's suicide. The Daily Morning Alaskan: \"Who was Dolly Quappe?\" January 09 1902: Being a disorderly person. The Seattle Star: \"Nell Pickerell Released\" August 05 1902: Smashing a showcase. The Seattle Star: \"Nell Pickerell fined twenty\" August 15 1902: Leading a fight with a police officer. The Seattle Star: \"Three women in a fight, to say nothing of the man - Officer Bevan has fierce encounter on Grant Street Bridge - Nell Pickerell leads in the attack - Two Girls Land In Jail\" The Seattle Star: \"Nell Pickerell fractious again\" November 4 1903: Suicide of his lover, Pearl Waldron. The Evening Statesman: \"Two Seattle Girls Committed Suicide\" The San Francisco Call: \"Shoots herself in chest - Pretty Young Woman of Seattle Attempts Suicide - Falls Madly In Love With Girl Who Dresses in Boy's clothing\" July 26 1905: Loitering in saloons. The Seattle Star: \"Woman In Man's Clothes And One In Chinese Hop Den Arrested By Police\" January 20 1906: Wearing trousers. The Seattle Star: \"No more trousers - Prosecuting attorney throws down the gauntlet and arrests Nell Pickerell in effort to force her to return to petticoats\" February 19 1906: Returning to Seattle. The Seattle Star: \"Nell Pickerell in town again\" February 21 1906: Refusing to give information on a robbery. The San Francisco Call: \"Police baffled by silence of a nervy young woman - Female After Month's Imprisonment Refuses to Tell What She Knows About Big Robbery\" March 26 1907: Wearing men's clothes. East Oregonian: \"Woman in Man's Clothes\" The Western News: \"Northwest News\" covers Harry Allen wearing men's clothes in public. Camas Prairie Chronicle: \"Northwest News\" covers Harry Allen wearing men's clothes in public. Pullman Herald: \"Northwest News\" covers Harry Allen wearing men's clothes in public. January 21 1908: Wearing men's clothes. The Seattle Star: \"Tacoma Police Arrest Nell Pickerell\" February 08 1908: Wearing men's clothes, his mother referring to him as 'Harry'. The Seattle Star: \"Police are puzzled over Nell Pickerell\" February 23 1908: Flirting with women. The Washington Times: \"Girl in man's clothing goes a-wooing women\" March 18 1908: Wearing men's clothes. Interviewed in prison, says he \"looks a fright\" in women's clothing. The Yakima Herald: \"Notorious Nell Pickerell lands in Yakima jail - Woman in man's clothes who smashes hearts is caught by local chief - Has Been In City For Several Days - Has Long Record In Seattle\" March 10 1909: Ordered out of town three hours after arriving. The Yakima Herald: \"Nell Canned again\" September 19 1911: Selling liquor. Arizona Republican: \"Nell was good hand in a booze foundry\" Bisbee Daily Review: \"\"Harry Allen\" was a girl - Arrested for Selling Liquor to an Indian\" The Arizona Sentinel: \"Was good hand in booze foundry\" The Norfolk Weekly New-journal: \"This Harvest Hand A Woman - \"He\" had frequented Saloons with the Men, sold booze to Reds\" The Bamberg Herald: \"Posed as a man 11 years - Arrest of Harvest Hand Reveals Woman in Male Attire\" September 27 1911: Dressing as a 'dandy' (a handsome man). The Yakima Herald: \"Nell Pickerall is again in limelight - Wellknown Character Arrested for Dressing in Men's Clothes and Posing as a Man\" November 24 1911: Earlier charge of selling liquor is dropped because the man he sold liquor to, Alexander Paul, was too drunk to give evidence. Santa Fe New Mexican: \"Nell Pickerell is acquitted of bootlegging - Alexander Paul, the Indian, Alleged to Have Bought the Booze, Too Drunk to Testify\" East Oregonian: \"Male garbed woman is given her liberty\" July 22 1915: Trying to rob a grocery store. The Seattle Star: \"Nell is back in jail again\" August 19 1915: Earlier charge of trying to rob a grocery store is dropped because there wasn't enough evidence to charge him. The Seattle Star: \"Woman acquitted\" September 27, 1916: Stabbed by his father, Robert Pickerell. Robert said that Harry had struck him in the mouth while Robert was sleeping, and Robert then fought back in self-defence with a knife he kept under his pillow. Harry survived the encounter. The Seattle Star: \"Nell Pickerell may die of wounds\" Daily Capital Journal: \"Old Man Stabs His Daughter In Lungs\" December 27, 1922: Harry dies of syphilitic meningitis. The Seattle Star: \"Nell Pickerell dead\" ==References== Category:1882 births Category:1922 deaths Category:Transgender men Category:American LGBT people Category:People from Washington (state)",
 "title": "Harry Allen (trans man)"
}