{
 "id": "658447",
 "text": "The Streak is a series of 21 straight victories for professional wrestler The Undertaker (Mark Calaway) at WWE's biggest yearly event, WrestleMania. Both WWE and news outlets used this term to refer to Calaway's victories. The winning streak began at WrestleMania VII in 1991 when he beat Jimmy Snuka, with the final win coming against CM Punk at WrestleMania 29 in 2013; The Undertaker was absent from WrestleMania X (1994) and WrestleMania 2000, owing to injury. Overall, he defeated 18 men during The Streak, which included three matches with Triple H and two each opposite Kane and Shawn Michaels. At WrestleMania XXX in 2014, The Streak was broken by Brock Lesnar, who defeated The Undertaker by pinfall. == Background == === WrestleMania === WrestleMania is a yearly event of the largest professional wrestling promotion in the United States, WWE. Formed as a counter to Jim Crockett Promotions' successful Starrcade event, WrestleMania I was broadcast to one million nationwide via closed-circuit television and pay-per-view. WrestleMania's widespread success helped transform the sport of professional wrestling and made WWE the most successful wrestling promotion in the world, prompting WWE to promote the event as the \"Super Bowl of sports entertainment\". === The Undertaker === Born Mark William Calaway on March 24, 1965 in Houston, Texas, The Undertaker is an American retired professional wrestler. He has worked for WWE since 1990, making him the company's longest-tenured in-ring performer. Calaway began his wrestling career with World Class Championship Wrestling (WCCW) in 1984. After wrestling for World Championship Wrestling (WCW) as \"Mean\" Mark Callous from 1989 to 1990, he signed with the World Wrestling Federation (WWF, later WWE) in 1990. In WWE, The Undertaker is a seven-time world champion, having won the WWF/E Championship four times and the World Heavyweight Championship three times, as well as the winner of the 2007 Royal Rumble. He is recognized as the fourth youngest WWF/E Champion in history, having won the title aged 26 years, 8 months, and 3 days. == Match statistics == Undefeated WrestleMania streak of The Undertaker Streak Date Match time Venue Note 1–0 Jimmy Snuka WrestleMania VII 4:20 Pinfall Los Angeles Memorial Sports Arena Los Angeles, California The Undertaker was managed by Paul Bearer. 2–0 Jake Roberts WrestleMania VIII 6:36 Pinfall Hoosier Dome Indianapolis, Indiana 3–0 Giant González WrestleMania IX 7:33 Disqualification Caesars Palace Las Vegas, Nevada The Undertaker was managed by Paul Bearer, while Giant Gonzalez was managed by Harvey Wippleman. This was the only match in The Streak to be decided via disqualification. 4–0 King Kong Bundy WrestleMania XI 6:36 Pinfall Hartford Civic Center Hartford, Connecticut The Undertaker was managed by Paul Bearer, while King Kong Bundy was managed by Ted DiBiase. Larry Young was the special guest referee. 5–0 Diesel WrestleMania XII 16:46 Pinfall Arrowhead Pond Anaheim, California The Undertaker was managed by Paul Bearer. 6–0 Sycho Sid WrestleMania 13 21:19 Pinfall Rosemont Horizon Rosemont, Illinois This was a no disqualification match for the WWF Championship 7–0 Kane WrestleMania XIV 16:58 Pinfall Fleet Center Boston, Massachusetts Kane was managed by Paul Bearer 8–0 Big Boss Man WrestleMania XV 9:48 Pinfall First Union Center Philadelphia, Pennsylvania This was a Hell in a Cell match. The Undertaker was managed by Paul Bearer. 9–0 Triple H WrestleMania X-Seven 18:17 Pinfall Reliant Astrodome Houston, Texas 10–0 Ric Flair WrestleMania X8 18:47 Pinfall SkyDome Toronto, Ontario, Canada This was a no disqualification match 11–0 A-Train and Big Show WrestleMania XIX 9:45 Pinfall Safeco Field Seattle, Washington This was a 2-on-1 handicap match 12–0 Kane WrestleMania XX 7:45 Pinfall Madison Square Garden New York City, New York The Undertaker was managed by Paul Bearer. 13–0 Randy Orton WrestleMania 21 14:14 Pinfall Staples Center Los Angeles, California The first time the Undertaker was challenged explicitly to end The Streak. This was also where The Streak was given its name. 14–0 Mark Henry WrestleMania 22 9:26 Casket Allstate Arena Rosemont, Illinois This was a casket match 15–0 Batista WrestleMania 23 15:47 Pinfall Ford Field Detroit, Michigan This match was for the World Heavyweight Championship 16–0 Edge WrestleMania XXIV 24:03 Submission Citrus Bowl Orlando, Florida 17–0 Shawn Michaels WrestleMania XXV 30:44 Pinfall Reliant Stadium Houston, Texas 18–0 Shawn Michaels WrestleMania XXVI 23:59 Pinfall University of Phoenix Stadium Glendale, Arizona This was a No disqualification streak vs. career match, therefore Shawn michaels retired from professional wrestling. 19–0 Triple H WrestleMania XXVII 29:24 Submission Georgia Dome Atlanta, Georgia This was a No Holds Barred match 20–0 Triple H WrestleMania XXVIII 30:50 Pinfall Sun Life Stadium Miami Gardens, Florida This was a Hell in a Cell match with Shawn Michaels as special guest referee 21–0 CM Punk WrestleMania 29 22:07 Pinfall MetLife Stadium East Rutherford, New Jersey CM Punk was managed by Paul Heyman Following the Undertaker's WrestleMania XXX loss to Brock Lesnar, he had further matches at the annual event against Bray Wyatt (WrestleMania 31), Shane McMahon (WrestleMania 32), Roman Reigns (WrestleMania 33), John Cena (WrestleMania 34), and AJ Styles (WrestleMania 36), winning all but the Reigns encounter. The Undertaker announced his retirement from professional wrestling at Survivor Series (2020), therefore ending his career with a 25–2 WrestleMania record. == References == Category:WrestleMania",
 "title": "The Streak (Wrestling)"
}