{
 "id": "65845",
 "text": "Andrew Carnegie (November 25, 1835 – August 11, 1919) was a Scottish-American businessman. He ran The Carnegie Steel Company, a major steel making corporation. When he retired, he was one of the richest men in America. He used his large amounts of money to fund charities. These charities gave money to universities. He had a hall built for himself (called Carnegie Hall), and he also built public libraries (called Carnegie Libraries). Andrew Carnegie was very charitable in the will he created through the New York. In his will, he gave monetary gifts to several funds, institutions, societies, and to Pittsburgh University. He also gave gifts to his employees and family. Carnegie had given away nearly $350 Million on charities, pensions, schools, libraries, and museums. Carnegie had given all of that amount of money because after a disaster happened outside his company people thought he was a bad person. He thought by giving away all that money people would think he was good. He died on August 11, 1919. == Early life == Birthplace of Andrew Carnegie in Dunfermline, Scotland Andrew Carnegie was born to Margaret Morrison Carnegie and William Carnegie in Dunfermline, Scotland, in a typical weaver's cottage with only one main room, consisting of half the ground floor, which was shared with the neighboring weaver's family. The main room served as a living room, dining room and bedroom. He was named after his paternal grandfather. In 1836, the family moved to a larger house in Edgar Street (opposite Reid's Park), following the demand for more heavy damask, from which his father benefited. He was educated at the Free School in Dunfermline, a gift to the town from the philanthropist Adam Rolland of Gask. Carnegie's maternal uncle, Scottish political leader George Lauder, Sr., deeply influenced him as a boy by introducing him to Robert Burns' writings and historical Scottish heroes such as Robert the Bruce, William Wallace, and Rob Roy. Lauder's son, also named George Lauder, grew up with Carnegie and became his business partner. When Carnegie was 12, his father had fallen on very hard times as a handloom weaver; making matters worse, the country was in starvation. His mother helped support the family by assisting her brother and by selling potted meats at her \"sweetie shop\", leaving her as the primary breadwinner. Struggling to make ends meet, the Carnegies then decided to borrow money from George Lauder, Sr. and move to Allegheny, Pennsylvania, in the United States in 1848 for the prospect of a better life. Carnegie's migration to America would be his second journey outside Dunfermline – the first being an outing to Edinburgh to see Queen Victoria. In September 1848, Carnegie arrived with his family in Allegheny. Carnegie's father struggled to sell his product on his own. Eventually, the father and son both received job offers at the same Scottish-owned cotton mill, Anchor Cotton Mills. Carnegie's first job in 1848 was as a bobbin boy, changing spools of thread in a cotton mill 12 hours a day, 6 days a week in a Pittsburgh cotton factory. His starting wage was $1.20 per week ($38 by 2021 inflation). His father quit his position at the cotton mill soon after, returning to his loom and removing him as breadwinner once again. But Carnegie attracted the attention of John Hay, a Scottish manufacturer of bobbins, who offered him a job for $2.00 per week ($63 by 2021 inflation). In his autobiography, Carnegie writes about the hardships he had to endure with this new job. == Telegraph == In 1849, Carnegie became a telegraph messenger boy in the Pittsburgh Office of the Ohio Telegraph Company, at $2.50 per week ($81 by 2021 inflation) following the recommendation of his uncle. He was a hard worker and would memorize all of the locations of Pittsburgh's businesses and the faces of important men. He made many connections this way. He also paid close attention to his work and quickly learned to distinguish the different sounds the incoming telegraph signals produced. He developed the ability to translate signals by ear, without using the paper slip, and within a year was promoted to an operator. Carnegie's education and passion for reading were given a boost by Colonel James Anderson, who opened his personal library of 400 volumes to working boys each Saturday night. Carnegie was a consistent borrower and a \"self-made man\" in both his economic development and his intellectual and cultural development. He was so grateful to Colonel Anderson for the use of his library that he \"resolved, if ever wealth came to me, [to see to it] that other poor boys might receive opportunities similar to those for which we were indebted to the nobleman\". His capacity, his willingness for hard work, his perseverance and his alertness soon brought him opportunities. == Railroads == Starting in 1853, when Carnegie was around 18 years old, Thomas A. Scott of the Pennsylvania Railroad Company employed him as a secretary/telegraph operator at a salary of $4.00 per week ($130 by 2021 inflation). Carnegie accepted the job with the railroad as he saw more prospects for career growth and experience there than with the telegraph company. At age 24, Scott asked Carnegie if he could handle being superintendent of the Western Division of the Pennsylvania Railroad. On December 1, 1859, Carnegie officially became superintendent of the Western Division. Carnegie then hired his sixteen-year- old brother, Tom, to be his personal secretary and telegraph operator. Not only did Carnegie hire his brother, but he also hired his cousin, Maria Hogan, who became the first female telegraph operator in the country. As superintendent Carnegie made a salary of fifteen hundred dollars a year ($45,000 by 2021 inflation). His employment by the Pennsylvania Railroad Company would be vital to his later success. ==References== ==Other websites== *http://www.biography.com/people/andrew-carnegie-9238756 Category:1835 births Category:1919 deaths Category:Deaths from pneumonia Category:American philanthropists Category:Businesspeople from New York City Category:People from Dunfermline Category:Massachusetts Republicans",
 "title": "Andrew Carnegie"
}