{
 "id": "658607",
 "text": "Dickinsonia is an early type of pre-Cambrian life. They were very different from current organisms. They are considered to be one of the early forms of multicellular organisms. Their bodies were shaped like discs. Based on the fossils, they were between four millimetres and 1.4m in size. They were only a few millimetres thick. Their body was segmented: there is a large central furrow, and smaller ones around the body of the organism. Their body was symmetric. Mostly based on the shape and size of the fossils found, they have been classified into different species. The Dickinsonia species probably did not move around the ocean on their own: they used ocean currents to float around. Possibly they had a way to attach to the ocean floor. Their feeding probably resembled that of the placozoa. == Problems with classification == They were also compared to modern-day Cnidarians, Polychaetes, and Turbellaria. Because of the prominent central part, they were also seen as Chordates. Because of their feeding habit, they were classified as similar ot the Placozoa. It was suggested, that they lived in symbiosis with organisms doing photosynthesis, and were possibly comparable to modern-day Lichen; if the mechanism worked the same as in modern-day lichens, they would be fungi. === Dickinsonia are animals === A study published in 2018, has shown Dickinsonia were animals.Bobrovskiy, Ilya et al 2018. Ancient steroids establish the Ediacaran fossil Dickinsonia as one of the earliest animals. Science 361 (6408) 1246-124. :\"The fossils contained almost exclusively cholesteroids, a marker found only in animals... Thus, Dickinsonia were basal animals. This supports the idea that the Ediacaran biota may have been a precursor to the explosion of animal forms later seen in the Cambrian, about 500 million years ago\". Very little cholesterol was found outside the specimen in the surrounding rock. The Ediacara biota (571 million to 541 million years ago) is the first complex organisms in the geological record large enough to be seen without magnification.Rincon, Paul 2018. Earliest animal fossils are identified. BBC News. == History of discovery == The first fossils were found in the Flinders Ranges, in Australia in 1946. Reginald Sprigg, a paleontologist, published the first scientific study of Dickinsonia in 1947. Sprigg named the genus after Ben Dickinson, who was the director of the Mines of South Australia, at the time. In the study, Sprigg thought t he had found the fossil of a jellyfish. In 1956, Harrington and Moore classified Dickinsonia as Cnidarians.In 1966, they were classified as Annelids. Most Annelid fossils are quite different from fossilized Dickinsonia, but they resemble some fossilized marine worms. S. Manton contradicted this interpretation in 1967. Because of these incertainities, the discussion about how to classify Dickinsonia is still ongoing. == References == Category:Ediacaran",
 "title": "Dickinsonia"
}