{
 "id": "6587",
 "text": "Friesland (Fryslân in West Frisian, Friesland in Dutch) is a province in the north of the Netherlands. The capital (city) of Friesland is Leeuwarden (Ljouwert in Frisian). People in Friesland speak West Frisian and Dutch. People also speak Frisian in a small part of Groningen (province), and in East Friesland and North Friesland in Germany. In North Holland there is a region called West Friesland, but people who live there are not called Frisians. About 660,000 people are living in Friesland (2023). Agriculture and tourism, on the lakes and the isles in the Wadden Sea, are important sources of income. The province is also famous for its ice skaters and its Elfstedentocht (Eleven cities tour), an ice skating race of 200 kilometers. It is also known for being home to some breeds of animals, such as the Stabyhoun and Wetterhoun dog breeds, the Friesian horse breed and the Holstein Friesian cattle breed. == Notable Frisians == In Friesland the Frisians live. They are an old ethnic group. Members of this ethnic group are: * Pier Gerlofs Donia was a giant from Friesland. He was said to be about 7 feet tall (2 meters and 15 centimeters). * Wijerd Jelckama was a legendary freedom fighter, rebel and warlord who was as tall as his uncle Pier Gerlofs Donia * Mata Hari was a famous courtesan and spy who was born a Frisian. * Doutzen Kroes, a Frisian born supermodel, speaks Frisan and encourages people to learn about it. ==Population== In 2021, Friesland had a population of 651,459 and a population density of . The years 1880–1900 showed slower population growth due to a farm crisis during which some 20,000 Frisians emigrated to the United States. Emigration to the United States. Historical population of Friesland Overzicht aantal inwoners Provincie Friesland 1714–2000, Tresoar. Bevolking; geslacht, leeftijd, burgerlijke staat en regio, 1 januari, Statistics Netherlands, 2014. {| Year Population 1714 1748 1796 1811 1830 1840 1850 1860 1870 1880 1890 1900 ===Anthropometry=== Since the late Middle Ages, Friesland is known for the exceptional height of its inhabitants. Even early Renaissance poet Dante Alighieri refers to the height of Frisians in his Divine Comedy when, in the canticle about Hell, he talks about the magnitude of an infernal demon by stating that \"not even three tall Frieslanders, were they set one upon the other, would have matched his height\".Alighieri, Dante. Divine Comedy, \"Inferno\", Canto 31, line 64, in The Portable Dante, ed. Paolo Milano, trans. Laurence Binyon, Penguin, 1975 ==References== == Other websites == *",
 "title": "Friesland"
}