{
 "id": "658734",
 "text": "The Prime Minister of Vietnam (), officially styled Prime Minister of the Government of the Socialist Republic (), is the head of government of Vietnam. He works over the meetings of the Central Government. The prime minister directs the work of government members, and may propose deputy prime ministers to the National Assembly. The current prime minister Phạm Minh Chính since 2021. ==Roles== The head of government is responsible to the National Assembly and serves as the Deputy Chairman of the Council for Defence and Security. Moreover, prime minister is also Chairman of the Council for National Education, Standing Member of the Central Military Commission and the Central Police Party Committee. ==List== Portrait Name Term of office Position Political party 1 Phạm Văn Đồng 2 July 1976 18 June 1987 Prime Minister (until 1981) Chairman of the Council of Ministers (since 1981) Communist Party of Vietnam 2 Phạm Hùng 18 June 1987 10 March 1988 Vice Chairman of the Council of Ministers cum Minister of Home Affairs (now the Ministry of Public Security) Chairman of the Council of Ministers Communist Party of Vietnam 3 Đỗ Mười 22 June 1988 8 August 1991 Chairman of the Council of Ministers Communist Party of Vietnam — Võ Văn Kiệt 10 March 1988 22 June 1988 Acting Chairman of the Council of Ministers Communist Party of Vietnam 4 8 August 1991 25 September 1997 Chairman of the Council of Ministers (until 1992) Prime Minister (since 1992) 5 Phan Văn Khải 25 September 1997 27 June 2006 Prime Minister Communist Party of Vietnam 6 Nguyễn Tấn Dũng 27 June 2006 6 April 2016 Prime Minister Communist Party of Vietnam 7 Nguyễn Xuân Phúc 7 April 2016 5 April 2021 Prime Minister Communist Party of Vietnam 8 Police lieutenant general Phạm Minh Chính 5 April 2021 Incumbent Prime Minister Communist Party of Vietnam ==Living former prime ministers== File:Mr._Nguyen_Xuan_Phuc.jpg|Nguyễn Xuân Phúc served 2016-2021 ==References==",
 "title": "Prime Minister of Vietnam"
}