{
 "id": "659590",
 "text": "John \"Jock\" Stein (5 October 1922 – 10 September 1985) was a Scottish football player and manager. He is best known for his highly successful management of Celtic. He became the first manager of a British side to win the European Cup, with Celtic in 1967. He also won ten league titles, eight Scottish Cups and six Scottish League Cups with Celtic. He also managed Leeds United, Dunfermline Athletic to a Scottish Cup and the Scotland national side to a Rous Cup. As a player, he played for Albion Rovers, Llanelli Town and Celtic. Stein was born in Burnbank, South Lanarkshire. He was married to Jeanie McAuley. The couple had two children. On 10 September 1985, Stein was managing Scotland against the Welsh national team in a FIFA World Cup qualifier. Near the end of a 1–1 draw between the sides, he had a heart attack and died in the medical room of Ninian Park in Cardiff, Wales. He was 62. ==Managerial statistics== Team Country From To Record P W D L Win % Dunfermline Athletic March 1960 March 1964 Hibernian March 1964 March 1965 Scotland May 1965 December 1965 Celtic March 1965 August 1978 Leeds United August 1978 October 1978 Scotland October 1978 September 1985 Total == Honours == === Player === Albion Rovers * Scottish B Division promotion: 1947–48 * Lanarkshire Cup: 1948–49 Celtic * Coronation Cup: 1953 * Scottish league championship: 1953–54 * Scottish Cup: 1953–54 * Glasgow Cup: 1955–56 * Glasgow Charity Cup: 1952–53 === Manager === Dunfermline Athletic *Scottish Cup: 1960–61 *Fife Cup (3): 1959–60, 1960–61, 1962–63 *Penman Cup: 1959–60 Hibernian *Summer Cup: 1963–64Summer Cup , SFHA Celtic *European Cup: 1966–67 *Scottish league championship (10): 1965–66, 1966–67, 1967–68, 1968–69, 1969–70, 1970–71, 1971–72, 1972–73, 1973–74, 1976–77 *Scottish Cup (8): 1964–65, 1966–67, 1968–69, 1970–71, 1971–72, 1973–74, 1974–75, 1976–77 *Scottish League Cup (6): 1965–66, 1966–67, 1967–68, 1968–69, 1969–70, 1974–75 *Drybrough Cup: 1974Last-gasp Hibs grab the cup, Evening Times, 5 August 1973, via The Celtic Wiki. *Glasgow Cup (5): 1964–65 , 1966–67, 1967–68, 1969–70, 1974–75Celtic Retain The Glasgow Cup | Queen's Park Outclassed, 12 May 1965. Thistle No Match For Celtic In Glasgow Cup Final, 8 November 1966. Celtic run riot in first half, 18 April 1968. Youthful Celtic win back Glasgow Cup from Rangers, 11 August 1970. Old Firm turn on a final classic, Glasgow Herald, 12 May 1975, via The Celtic Wiki. Scotland *Rous Cup: 1985 === Individual === *British Manager of the Year: 1967 * Scottish Football Personality of the Year: 1976–77, 1981–82 * Inaugural Inductee to the Scottish Sports Hall of Fame: 2002 *Inaugural Inductee to the Scottish Football Hall of Fame: 2004 *Inaugural Inductee to the Dunfermline Athletic Hall of Fame: 2004 *Sunday Herald Greatest Scottish Manager of All Time: 2003 *ESPN 17th Greatest Manager of All Time: 2013Greatest Managers, No. 17: Jock Stein *World Soccer 29th Greatest Manager of All Time: 2013 * Sports Illustrated 28th Greatest Manager of All Time: 2019 *France Football 34th Greatest Manager of All Time: 2019 * FourFourTwo 30th Greatest Manager of All Time: 2020 ==References== Category:1922 births Category:1985 deaths Category:Commanders of the Order of the British Empire Category:Deaths from myocardial infarction Category:Scottish football managers Category:Footballers from South Lanarkshire",
 "title": "Jock Stein"
}