{
 "id": "659975",
 "text": "The New Walk Museum and Art Gallery is a museum in Leicester, England. It opened in 1849 as one of the first public museums in the United Kingdom.\"New Walk Museum Vision\" , University of Leicester.Harris, Penelope 2010. The Architectural Achievement of Joseph Aloysius Hansom (1803–1882). The Edwin Mellen Press. New Walk contains displays of both science and art, international and local. == Dinosaurs and fossils == Two skeletons are permanently on display — a cetiosaur found in Rutland, and a plesiosaur from Barrow upon Soar.Official website The dinosaur is a specimen of Cetiosaurus oxoniensis. The 15 metre dinosaur is among the most complete sauropod skeletons in the world. The bones in the display are mostly replicas of the originals, which are too fragile to be used.Leicester City Council The Barrow Kipper, named after the flatfish, is a skeleton of a plesiosaur discovered in Barrow upon Soar in 1851. It has been wrongly classified twice, and at present has no accepted name. Other \"star attractions\" of the gallery are a Leedsichthys (a giant fossil fish) and a piece of the Barwell meteorite. The museum has a specimen of international importance, the Charnia fossil.Leicester City Council This was the first fossil ever described from undoubted Precambrian rocks. Until then, no large (non-microscopic) forms of life were known to exist at that time. The object in the museum – \"Leicester's fossil celebrity\" – is a holotype. It is the actual physical example from which the species was first identified and formally described. Charnia masoni was named after Roger Mason. He discovered it in Charnwood Forest in 1957, when he was a schoolboy. He who went on to a career as an academic geologist. The fossil had been discovered a year earlier by a schoolgirl, Tina Negus, \"but no one took her seriously\".\"In April 1957, I went rock-climbing in Charnwood Forest with two friends, Richard Allen and Richard Blachford (‘Blach’), fellow students at Wyggeston Grammar School, Leicester. I was already interested in geology and knew that the rocks of the Charnian Supergroup were Precambrian although I had not heard of the Australian fossils. Richard Allen and I agree that Blach (who died in the early 1960s) drew my attention to the leaf-like fossil holotype now on display in Leicester City Museum. I took a rubbing and showed it to my father, who was Minister of the Great Meeting Unitarian Chapel in East Bond Street, taught part-time at University College (soon to be Leicester University) and thus knew Trevor Ford. We took Trevor to visit the fossil site and convinced him that it was a genuine fossil. His publication of the discovery in the Journal of the Yorkshire Geological Society established the genus Charnia and aroused worldwide interest. ... I was able to report the discovery because of my father’s encouragement and the enquiring approach fostered by my science teachers. Tina Negus saw the frond before I did but no one took her seriously.\" == Art == The museum holds the UK's largest collection of German Expressionist art. These paintings, including works by George Baselitz, Wassily Kandinsky and Paul Klee, were smuggled out of Nazi Germany before World War II. The Nazis condemned the work of these painters. Hans Hess, son of the German-Jewish industrialist and art collector, Alfred Hess, was assistant curator at the museum. In 2007, more than 100 pieces of art went on display at the museum, donated by Richard Attenborough, namely a collection of Picasso ceramic art.Lewis, Caroline. \"Attenborough donates Picasso ceramics collection to Leicester New Walk Museum\" , Culture24, 7 June 2007. Retrieved 7 December 2009. == Other exhibitions == On the first floor of the museum is an exhibition area that changes periodically. Recent exhibits have included a display focusing on the search for the remains of Richard III, a Wallace and Gromit display, and Spirits of War to Hands of Peace, an exhibit of paintings and sculpture on the horrors of war and the power of peace.\"New art exhibition highlights the contrasts between war and peace\" , Leicester City Council, 23 March 2011. == References == Category:Museums in England Category:Buildings and structures in Leicester",
 "title": "New Walk Museum"
}