{
 "id": "66036",
 "text": "The State Anthem of the Republic of Kazakhstan, also known as \"My Kazakhstan\", is the current national anthem of Kazakhstan. The President of Kazakhstan made it the country's national anthem on 7 January 2006. It is based on a song written in 1956 by Jümeken Näjımedenov, because he wanted to discourage what Nikita Khrushchev was doing to Kazakhstan three years prior. The first president of Kazakhstan, Nūrsūltan Nazarbaev, changed the original words of that song, then he turned it into the national anthem of Kazakhstan.The CIA World Factbook 2012 Central Intelligence Agency - 2011 National anthem: name: “Menıñ Qazaqstanym” (My Kazakhstan) lyrics/music: Zhumeken NAZHIMEDENOVEmbassy of Kazakhstan in New Delhi, India : Weekly News. kazind.com. It replaced the previous anthem, which was used upon independence from the former Soviet Union. ==History== This song was originally a patriotic song written in 1956 in response to the Soviet Union's Virgin Lands campaign. The author of the song was trying to tell the Soviets to stop abusing their land and people just for the USSR's sake.Marshall, Alex (2015). Republic or Death! Travels in Search of National Anthems. London: Random House Books. pp. 140–144. ISBN 9781847947413. 'Imagine if someone came and tried to break up London,' [Shamshi Kaldayakov's son] Mukhtar says, hitting a table in disgust. 'It's just like that. My father composed the song to stop them doing this. \"Don't do it. This is our land.\"' ==Lyrics== ===The national anthem=== Words of the song in KazakhQazaqstan Respublikasynyñ Memlekettik änūrany KazinformFourth version of Kazakh Latin script will preserve language purity, linguists say The Astana Times. Yergaliyeva, Aidana (2019-11-18) Spelling of these words using the Cyrillic scriptҚазақстан Республикасының Мемлекеттік Гимні. akorda.kz.National Anthem of the Republic of Kazakhstan (2011-05-31). Asfendiyarov Kazakh National Medical University. Pronunciation of these words using the IPA Words of the song in RussianМосквич спел гимн Казахстана на русском языке. Informburo.kz. Words of the song in Chinese Words of the song in English [ɑ̝ɫ̪.ˈt̪ə̃ŋ‿kʏ̞̃n̪ ɑ̝s̪.pɑ̝̃.ˈn̪ə ǀ] [ɑ̝ɫ̪.ˈt̪ə̃n̪‿d̪æ̝̃n̪ d̪ɑ̝.ɫ̪ɑ̝.ˈs̪ə ǀ] [je̘r̪.l̪ɪ̞k.ˈt̪ɪ̞̃ŋ d̪ɑ̝s̪.t̪ɑ̝̃.ˈn̪ə ǀ] [je̘.l̪ɪ̞̃.ˈmʲe̘ qɑ̝.ˈr̪ɑ̝.ʃə ǁ] [je̘.ʒʲe̘l̪ʲ.ˈd̪ʲẽ̘n̪ je̘r̪ d̪ʲe̘.ˈɡʲẽ̘n̪ ǀ] [d̪ɑ̝̃ɴ.qə̃.ˈməz̪ ʃəq.ˈt̪ə ʁo̞j ǁ] [n̪ɑ̝̃.mə.ˈs̪ə̃n̪ bʲe̘r̪.mʲe̘.ˈɡʲẽ̘n̪ ǀ] [qɑ̝.z̪ɑ̝.ˈʁə̃m məq.ˈt̪ə ʁo̞j ǁ] [qɑ̝.jər̪.ˈmɑ̝] [mʲẽ̘.ˈn̪ɪ̞̃ŋ̟ je̘.ˈl̪ɪ̞̃m ǀ mʲẽ̘.ˈn̪ɪ̞̃ŋ̟ je̘.ˈl̪ɪ̞̃m ǀ] [ɡʏ̞.ˈl̪ʏ̞̃ŋ bo̞.ˈɫ̪ʊp ǀ je̘.ɣɪ̞.ˈl̪ʲẽ̘.mɪ̞̃n̪ ǀ] [ʒə.ˈr̪ə̃ŋ bo̞.ˈɫ̪ʊp t̪ɵ.ɣʏ̞.ˈl̪ʲẽ̘.mɪ̞̃n̪ ǀ je̘.ˈl̪ɪ̞̃m ǁ] [t̪u.ˈʁɑ̝̃n̪ ʒʲe̘.ˈr̪ɪ̞̃m mʲẽ̘.ˈn̪ɪ̞̃ŋ̟ ǀ qɑ̝.z̪ɑ̝.q(χə)s̪.t̪ɑ̝̃.ˈn̪ə̃m ǁ] [o̙r̪.pɑ̝q̚.ˈqɑ̝ ʒo̞ɫ̪ ɑ̝ʃ.ˈqɑ̝̃n̪ ǀ] [kʲẽ̘m‿bɑ̝j.ˈt̪ɑ̝q ʒʲe̘.ˈr̪ɪ̞̃m bɑ̝r̪ ǁ] [bɪ̞r̪.l̪ɪ̞.ˈɣɪ̞ ʒɑ̝.r̪ɑ̝s̪.ˈqɑ̝̃n̪ ǀ] [t̪æ̝.β̞ʲe̘l̪ʲ.ˈs̪ɪ̞z̪ je̘.ˈl̪ɪ̞̃m bɑ̝r̪ ǁ] [qɑ̝r̪s̪‿ɑ̝ʟ̠.ˈʁɑ̝̃n̪ wɑ̝.χət̪̚.ˈt̪ə ǀ] [mæ̝̃ŋ.gɪ̞.ˈl̪ɪ̞k d̪o̞.ˈs̪ʊ̃n̪.d̪ɑ̝j ǁ] [bɪ̞z̪.ˈd̪ɪ̞̃ŋ̟ je̘l̪ʲ bɑ̝.χət̪̚.ˈt̪ə ǀ] [bɪ̞z̪.ˈd̪ɪ̞̃ŋ̟ je̘l̪ʲ wo̙.ˈs̪ʊ̃n̪.d̪ɑj ǁ] [qɑ̝.jər̪.mɑ̝.ˈs̪ə] In the sky sun of gold, In the steppes seeds of gold. Of legends brave and bold, My great country behold! From thine antiquity Emerged our glory. Our honour shall reign Brave my Kazakhs remain! Chorus: My motherland, my motherland, Like a flower upright I stand. Of thee I sing, thee I proudly blazon! O my native homeland — my Kazakhstan! For aeons we've lasted In the vast land I have. Our folk united In this free land I have. Of new eras embraced, Like an eternal friend. Revered is our land, Such is our homeland! Chorus ===The original song=== Words of the song in Kazakh Meaning of these words in English Алтын күн аспаны, Алтын дән даласы Думанды бастады Далама қарашы! Кең екен жер деген, Жерге гүл шықты ғой. Дән егіп терлеген, Қазағым мықты ғой! Қайырмасы: Mенің елім, менің елім, Жырың болып төгілемін, Гүлің болып егілемін, елім! Tуған жерім — менің Қазақстаным! Айналап қарасам Ғашыкты жүрегім Заманға жарассам Жарасып тұр елім. Біздің ел — ордынды, Көтерді туларды, Желмен ол тербелді, Термеде жырладым. Қайырмасы Сағымды далам бар Сабырлы көлім бар. Қараңдар, жараңдар, Осындай елім бар. Қарсы алған уақытты, Ежелгі досындай. Біздің ел бақытты, Біздің ел осындай! Қайырмасы Sun of gold in the sky, Grain of gold in the steppe. Let us all celebrate — Take a look at the steppe! How spacious is this land, Flowers bloom on the ground. Grains are with toil sowed — My Kazakhs are intrepid! Chorus: My motherland, my motherland, I will stream from you like a song, I will bloom as your flower, O homeland! My native homeland, my Kazakhstan! Around when I'm glancing, My heart is filled with love. To the norm conforming, But behold my nation. Our country's a vast land, Our banners are raised. In the wind they swayed, In terme I rejoiced. Chorus There is a looming steppe, There is placid bounty. O look and gratify, I have such a country. Of new eras welcomed, Like a good old friend. Blessed is our country, Such as our country! Chorus ==Parodies== There is a parody version of the anthem—in an entirely different tune—which comes at the end of 2005 mockumentary film Borat. It is titled \"O Kazakhstan\". The actor who played Borat Sagdiyev, Sacha Baron Cohen, has been threatened with lawsuits by the Government of Kazakhstan after the execution (release) of the film.CBC.ca Arts – British comic responds to legal threat against 'Borat' (2007-02-24). CBC Arts. ==Playback incidents== In March 2012, the full Borat soundtrack was played at the International Shooting Grand Prix in Kuwait with Gold-winner Mariya Dmitriyenko.Borat anthem played by mistake at medals ceremony (2012-03-24). Eurosport Yahoo! UK.Borat anthem stuns Kazakh gold medallist in Kuwait (2012-03-23). BBC. Kazakh officials were angered by this incident and complained. A few weeks earlier, at a festival of a ski resort in Qostanaı, the first part of Ricky Martin's single \"Livin' La Vida Loca\" was played accidentally before it was immediately changed to \"My Kazakhstan\".Kazakhs Get 'La Vida Loca' Instead Of National Anthem (2012-03-09). RadioFreeLiberty. ==Notes== ==References== ==Other websites== ;Lyrics to the original song (1956) * \"My Kazakhstan (1956 song)\", archived Wikipedia revision, as edited by Ulysses Faye Ohkiph at 16:08, 30 October 2017 – contains lyrics of old song * \"Meniñ Qazaqstanım (1956) [Original Kazakh National Anthem-Song\"] (uploaded of \"Kingworld30\") — Original 1956 song, ;Playback incidents * \"KAZAKHSTAN NATIONAL ANTHEM FAIL!\" (uploaded by \"Sergio Ledovsky\") – Wrong song played briefly at the Qostanaı ski resort in early 2012. * \"Borat spoof Kazakhstan anthem by mistake in medal presentation with English subtitles words\" (uploaded by \"bluegumtv\") – The incident that occurred in Kuwait. Category:Kazakh anthems",
 "title": "Menıñ Qazaqstanym"
}