{
 "id": "660315",
 "text": "The following is a list of deaths that should be noted in October 2018. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==October== ===1=== *Charles Aznavour, 94, French-Armenian singer (\"La Bohème\", \"She\", \"The Old Fashioned Way\"), lyricist and actor (Shoot the Piano Player), cardiopulmonary arrest complicated by pulmonary edema.Charles Aznavour, French singing star, dies at 94 *Stelvio Cipriani, 81, Italian composer (The Bounty Killer, The Stranger Returns, La polizia sta a guardare), complications from a stroke.Morto Stelvio Cipriani, il compositore di \"Anonimo Veneziano\" *Carlos Ezquerra, 70, Spanish comics artist (Judge Dredd, Preacher), lung cancer.Judge Dredd co-creator Carlos Ezquerra dies aged 70 *Jerry González, 69, American bandleader and trumpeter, heart attack.Muere en un incendio en Madrid el músico de jazz Jerry González *Đỗ Mười, 101, Vietnamese politician, General Secretary of the Communist Party of Vietnam (1991–1997) and Prime Minister (1988–1991), multiple organ failure.Nguyên Tổng bí thư Đỗ Mười qua đời *Graciano Rocchigiani, 54, German professional boxer, WBC (1988–1989) and IBF world champion (1998–2000), car accident.Graciano \"Rocky\" Rocchigiani Dead: Former World Champion Dies in Car Crash in Italy *Juan Romero, 68, American busboy, witness to the Robert F. Kennedy assassination, heart attack.The busboy who tried to help a wounded Robert F. Kennedy in 1968 dies. His life was haunted by the violence *Franco Sar, 84, Italian Olympic decathlete (1960, 1964), heart attack.Atletica in Lutto, è morto Franco Sar, Olimpico e Padre della SNIA *Antoine Sfeir, 69, Lebanese journalist and professor.Le journaliste et politologue spécialiste du Moyen- Orient Antoine Sfeir est mort ===2=== *Smilja Avramov, 100, Serbian law academic, President of the International Law Association (since 1980) and member of the Senate of Republika Srpska (1996–2009), congestive heart failure.Професорка Смиља Аврамов преминула у 101. години *Balabhaskar, 40, Indian violinist, composer and record producer, heart attack.Violinist Balabhaskar dies a week after car crash that killed his daughter *Geoff Emerick, 72, English recording engineer (Abbey Road Studios, The Beatles), multi-Grammy winner, heart attack.Geoff Emerick, Beatles Chief Recording Engineer, Dies at 72 *Dorothy Hukill, 72, American politician, member of the Florida House of Representatives (2004–2012) and Senate (since 2012), cervical cancer.Florida state Sen. Dorothy Hukill dies at 72 *Thampi Kannanthanam, 64, Indian movie director (Thavalam, Bhoomiyile Rajakkanmar, Freedom).Filmmaker Thampi Kannanthanam passes away *Roman Kartsev, 79, Russian actor (Heart of a Dog, Promised Heaven, Old Hags) and comedian, cardiac arrest.Умер Роман Карцев *Jamal Khashoggi, 59, Saudi journalist and columnist (The Washington Post), strangled.Jamal Khashoggi: Turkey says journalist was murdered in Saudi consulate *Hermenegildo Sábat, 85, Uruguayan-born Argentine political cartoonist and journalist (El País), heart attack.Murió Hermenegildo Sábat, uno de los dibujantes mas reconocidos en la historia argentina ===3=== *Elisabeth Andersen, 98, Dutch actress (Hague Comedy).Actrice Elisabeth Andersen (98) overleden *Julien Bogaert, 94, Belgian Olympic sprint canoeist (1948).Julien Bogaert *Sir Roger Gibbs, 83, British financier. *Joseph Kamaru, 79, Kenyan benga musician and political activist, complications from Parkinson's disease.Musician Joseph Kamaru, 79, dies at MP Shah Hospital *Leon M. Lederman, 96, American experimental physicist (Bottom quark) and scientific writer (The God Particle), Nobel Prize winner (1988), complications from dementia.Leon Lederman, 96, Explorer (and Explainer) of the Subatomic World, Dies *Bent Lorentzen, 83, Danish composer, lymphoma.Dansk musikpioner død: Han var en af de helt store fritænkere *Hollie Pihl, 90, American judge, District Court Judge for Washington County (1969–1995).Hollie M. Pihl Jr. ===4=== *Dave Anderson, 89, American sportswriter (The New York Times), Pulitzer Prize winner (1981), heart failure.Dave Anderson, longtime New York Times columnist, dies at 89 *Jeanne Ashworth, 80, American speed skater, Olympic bronze medalist (1960), pancreatic cancer.Olympic Chamion Ashworth Dies *Hamiet Bluiett, 78, American jazz saxophonist (World Saxophone Quartet) and composer, complications from a stroke.Hamiet Bluiett 1940 - 2018 *Kevin Ellison, 31, American football player (San Diego Chargers, Spokane Shock).Former USC safety Kevin Ellison dies at 31 *Kurt Malangré, 84, German politician, MEP (1979–1999), lung cancer.Alt-Oberbürgermeister Kurt Malangré gestorben *José Sacal, 74, Mexican surrealist sculptor, leukemia.Fallece el escultor mexicano José Sacal *Will Vinton, 70, American animator (The California Raisins, The Adventures of Mark Twain, Return to Oz), Oscar winner (1974), multiple myeloma.Portland's Will Vinton, creator of famous Claymation characters, dies ===5=== *Jimmy Duquennoy, 23, Belgian racing cyclist, cardiac arrest.Jimmy Duquennoy est décédé à l’âge de 23 ans *Ray Galton, 88, British screenwriter (Hancock's Half Hour, Steptoe and Son), dementia.Groundbreaking sitcom writer Ray Galton dies *Ivar Odnes, 55, Norwegian politician, MP (since 2017), pancreatic cancer.Stortingsrepresentant Ivar Odnes er død *Víctor Pey, 103, Spanish-born Chilean engineer and political activist, counselor of Salvador Allende.Adiós a un histórico en un día emblemático: a los 103 años fallece Víctor Pey, dueño de El Clarín ===6=== *Eef Brouwers, 79, Dutch journalist and spokesman, Director-general of the RVD (1995–2004), colorectal cancer.NOS- presentator en oud-RVD-chef Eef Brouwers overleden *Montserrat Caballé, 85, Spanish opera singer, gallbladder infection.Spanish soprano Montserrat Caballé dies aged 85 *Quentin Kenihan, 43, Australian disability activist, actor (Mad Max: Fury Road) and politician, asthma attack.Disability advocate Quentin Kenihan dies *Don Sandburg, 87, American actor (Bozo's Circus), Alzheimer's disease. *Scott Wilson, 76, American actor (The Walking Dead, In Cold Blood, The Ninth Configuration), complications from leukemia.'Walking Dead' Actor Scott Wilson Dies at 76 ===7=== *Peggy McCay, 90, American actress (Days of Our Lives, Love of Life, Murphy's Romance), Emmy winner (1991).Peggy McCay, Longtime Star of ‘Days of Our Lives,’ Dies at 90 *Moi-Yo Miller, 104, Australian actress and illusionist, dementia.Geelong-born illusionist Moi-Yo Miller dies aged 104 *Oleg Pavlov, 48, Russian novelist (Captain of the Steppe, Tales from the Last Days, The Russian Man in the 20th Century), Russian Booker Prize winner (2002) and Angelus Award winner (2017), heart attack.Олег Павлов *Celeste Yarnall, 74, American actress (The Face of Eve, The Mechanic, Fatal Beauty), peritoneal cancer. ===8=== *Arnold Kopelson, 83, American movie producer (Platoon, The Fugitive, Seven), Oscar winner (1987).Arnold Kopelson, Oscar Winning Producer of ‘Platoon’ and ‘The Fugitive,’ Dies at 83 *George Taliaferro, 91, American professional (Baltimore Colts) and Hall of Fame college football player (Indiana Hoosiers), first African-American selected in an NFL Draft, heart failure.IU football trailblazer George Taliaferro dies at 91 *Joseph Tydings, 90, American lawyer (Eisenstadt v. Baird) and politician, U.S. Senator from Maryland (1965–1971), cancer.Fmr. Senator Joseph Tydings Has Passed Away *Hiroshi Wajima, 70, Japanese sumo and professional wrestler (AJPW), throat cancer.大相撲の元横綱・輪島こと輪島大士氏が死去 ７０歳 輪湖時代を築く *Venantino Venantini, 88, Italian actor (Seven Deaths in the Cat's Eye, City of the Living Dead, Cannibal Ferox), complications from heart surgery.È morto l'attore Venantino Venantini ===9=== *G. D. Agrawal, 87, Indian environmental activist, heart failure complicated by starvation.Activist GD Agarwal, who was on indefinite fast for clean Ganga, dies in Rishikesh *Warner Saunders, 83, American news anchor (WMAQ-TV, WBBM-TV), suspected heart attack.Longtime NBC 5 Anchor Warner Saunders Passes Away at 83 *Thomas A. Steitz, 78, American biochemist, Nobel Prize winner (2009), complications from pancreatic cancer.Thomas A. Steitz *Carolyn Warner, 88, American politician, Arizona Superintendent of Public Instruction (1975–1987), cancer.Carolyn Warner, former Arizona superintendent, dead at 88 ===10=== *Bill Corey, 101, Australian World War II soldier (The Rats of Tobruk).One of the last 'Rats of Tobruk' dies aged 101 *Mary Midgley, 99, British moral philosopher and animal rights activist.Mary Midgley (1919-2018) *Raye Montague, 83, American naval engineer (Oliver Hazard Perry class), heart failure.Raye Montague, Arkansan and 'hidden figure' credited with U.S. Navy breakthrough, dies at 83 *Tex Winter, 96, American Hall of Fame basketball coach (Chicago Bulls), innovator of the triangle offense, complications from a stroke.Bulls confirm that former assistant coach Tex Winter dies at the age of 96 ===11=== *Sir Doug Ellis, 94, English entrepreneur and football club chairman (Aston Villa).Doug Ellis dead: Former Aston Villa owner dies, aged 94 *Labinot Harbuzi, 32, Swedish footballer (Malmö FF, Gençlerbirliği), cardiac arrest.Tidigare MFF-talangen Labinot Harbuzi död *Dieter Kemper, 81, German professional cyclist, bone cancer.Ein emotionaler Rückblick: Radsport-Fans trauern um Dieter Kemper *Pran Nevile, 95, Indian art historian (Lahore: A Sentimental Journey), pneumonia.Indian historian Pran Nevile passes away at 95 *Yoshito Sengoku, 72, Japanese politician, Minister of Justice (2010–2011), lung cancer. *Hege Skjeie, 63, Norwegian political scientist and columnist (Dagens Næringsliv), pancreatic cancer.En bauta i norsk likestillingspolitikk er død: – Hege Skjeie (63) etterlater dype spor *Greg Stafford, 70, American game designer (White Bear and Red Moon, King of Dragon Pass, HeroQuest).Vale Greg Stafford (1948 - 2018) *Hebe Uhart, 81, Argentine novelist (Querida mamá o guiando la hiedra) and columnist (El País), complications from COPD.Murió la escritora Hebe Uhart ===12=== *Paul Andreu, 80, French architect (Osaka Maritime Museum).Paul Andreu, membre de la section d'architecture *Pik Botha, 86, South African politician, Minister of Foreign Affairs (1977-1994). *Jan Jakob Tønseth, 71, Norwegian author (Hilmar Iversens ensomhet), member of the Norwegian Academy (until 2018), multiple myeloma.Forfatter Jan Jakob Tønseth er død ===13=== *Fabien Eboussi Boulaga, 84, Cameroonian philosopher.In Memoriam Fabien Eboussi Boulaga Une Constellation De Simplicité Et D’engagement. *William Coors, 102, American brewer (Coors Brewing Company).Bill Coors, Former Chairman of Namesake Brewery, Dies at 102 *Robert W. Doran, 73, New Zealand computer scientist.Robert William (Bob) Doran *Edgar S. Harris Jr., 93, American Air Force lieutenant general.Lt./Gen. Edgar Starr Harris USAF RET *Patricia Hollis, Baroness Hollis of Heigham, 77, British politician, member of House of Lords (since 1990).Death of a Member: Baroness Hollis of Heigham *Nikolai Pankin, 69, Russian breaststroke swimmer, Olympic bronze medalist (1968) and swimming coach.Ушел из жизни призер Олимпиады-68 в плавании Николай Панкин *Jim Taylor, 83, American Hall of Fame football player (Green Bay Packers, New Orleans Saints).Jim Taylor, first of Vince Lombardi-era Packers inducted into Hall of Fame, dies ===14=== *Robert Bushby, 91, American aircraft designer (Mustang Aeronautics Mustang II).Robert Wesley Bushby *Milena Dravić, 78, Serbian actress (Destination Death, Special Treatment, St. George Shoots the Dragon), pancreatic cancer.Preminula Milena Dravić *Per Theodor Haugen, 86, Norwegian actor (The Pinchcliffe Grand Prix, Støv på hjernen).Per Theodor Haugen er død *Mel Ramos, 83, American artist, heart failure.Pop artist Mel Ramos dies at 83 *Valeriy Shmarov, 74, Ukrainian politician, Minister of Defence (1994–1996). ===15=== *Paul Allen, 65, American businessman and sports team owner (Seattle Seahawks, Portland Trail Blazers), co-founder of Microsoft, septic shock caused by non-Hodgkin's lymphoma.Paul Allen, Microsoft co-founder, dies at 65 *Arto Paasilinna, 76, Finnish novelist (The Year of the Hare), complications from a stroke.Arto Paasilinna 20.4.1942–15.10.2018 *Fernando Serena, 77, Spanish footballer (Real Madrid, Sant Andreu, national team), complications from Parkinson's disease.Fallece Serena ===16=== *Dennis Hof, 72, American brothel owner (Moonlite BunnyRanch), reality show personality (Cathouse: The Series) and politician, suspected cardiac arrest.Nevada brothel owner and Republican state legislature candidate dies *Walter Huddleston, 92, American politician, U.S. Senator from Kentucky (1973–1985).Walter 'Dee' Huddleston, who lost Senate seat to Mitch McConnell, dies *Sid Michaels Kavulich, 62, American politician, member of the Pennsylvania House of Representatives (since 2011) and sportscaster (WBRE-TV), complications from heart surgery.State Rep. Sid Michaels Kavulich, former sportscaster, died *Ian Kiernan, 78, Australian yachtsman and environmental campaigner (Clean Up Australia), Australian of the Year (1994), cancer.Ian Kiernan, Clean Up Australia founder and yachtsman, dies aged 78 *Berthold Leibinger, 87, German engineer (Trumpf) and philanthropist (Berthold Leibinger Stiftung) complications from Alzheimer's disease.In Memoriam: TRUMPF Senior Figure and Partner, Berthold Leibinger, Passes Away *Paul O'Brien, 64, British chemist.Paul O'Brien, former vice president of Royal Society of Chemistry, dies aged 64 ===17=== *Leone Frollo, 87, Italian comic book artist (Biancaneve).Addio a Leone Frollo fumettista veneziano *Cornelius Edward Gallagher, 97, American politician, member of the U.S. House of Representatives from New Jersey's 13th congressional district (1959–1973), brain cancer.Cornelius Gallagher, former New Jersey congressman, dies at 97 *Ara Güler, 90, Turkish photojournalist, heart attack.Renowned Turkish photographer Ara Guler dies at 90 *Jacques Monory, 94, French painter and filmmaker, pneumonia.Décès du peintre Jacques Monory *Vladislav Roslyakov, 18, Russian student and murderer, perpetrator of the Kerch Polytechnic shooting, suicide by firearm.Was Vladimir Roslyakov's weapon shooting illegal? Yes, it was... *Derrick Sherwin, 82, English television producer (Doctor Who, Paul Temple) and actor (The Vengeance of She).Derrick Sherwin, Doctor Who producer and creator of UNIT, dies aged 82 ===18=== *Abdul Raziq Achakzai, 39, Afghan officer, shot.Top Afghan commander Raziq killed in Kandahar gun attack *Ayub Bachchu, 56, Bangladeshi singer-songwriter (Love Runs Blind), heart attack.Legendary singer Ayub Bachchu dies *Anthea Bell, 82, British translator, complications from Alzheimer's disease.Anthea Bell, 'magnificent' translator of Asterix and Kafka, dies aged 82 *Abdel Rahman Swar al-Dahab, 83, Sudanese military officer and politician, President (1985–1986).سونا: وفاة الرئيس السوداني الأسبق عبد الرحمن سوار الذهب في الرياض *Danny Leiner, 57, American movie director (Harold & Kumar Go to White Castle, Dude, Where's My Car?, The Great New Wonderful), cancer.Danny Leiner, Director of 'Dude, Where's My Car?' and 'Harold & Kumar Go to White Castle,' Dies at 57 *Åke Ortmark, 89, Swedish journalist (Veckans Affärer) and television presenter, pneumonia.Journalisten Åke Ortmark är död *Lisbet Palme, 87, Swedish child psychologist, Spouse of the Prime Minister (1969–1976, 1982–1986).Lisbet Palme är död *Dick Slater, 67, American professional wrestler (WWF, UWF, WCW).Pro Wrestling Legend Dick Slater Dead At 67, WWE Comments *N. D. Tiwari, 93, Indian politician, Minister of External Affairs (1986–1987) and Minister of Finance (1987–1988), multiple organ failure.नहीं रहे उत्तराखंड के विकास पुरुष एनडी तिवारी, मैक्स में ली आखिरी सांस *U Thuzana, 71, Burmese Buddhist monk, Leader of the Democratic Karen Buddhist Army (1994–2010).မြိုင်ကြီးငူ ဆရာတော်ပျံလွန်တော်မူ ===19=== *Takanobu Hozumi, 87, Japanese actor (The Demon, Mr. Baseball, The X from Outer Space), gallbladder cancer.「積木くずし」穂積隆信さん、死去 胆のうがん８７歳 *Osamu Shimomura, 90, Japanese organic chemist, Nobel Prize winner (2008). *Diana Sowle, 88, American actress (Willy Wonka & the Chocolate Factory, Fallout 3).Willy Wonka And The Chocolate Factory actress Diana Sowle dies aged 88 ===20=== *Wim Kok, 80, Dutch politician and trade union leader, Prime Minister (1994–2002), heart failure.Former Dutch prime minister, Wim Kok, dies at 80 *Zheng Xiaosong, 59, Chinese politician, Director of the Macau Liaison Office (since 2017), fall.Top Macau official Zheng Xiaosong dead after fall from building ===21=== *Earl Bakken, 94, American pacemaker inventor (Medtronic) and museum founder (Bakken Museum).Medtronic founder Earl Bakken dies *Ilie Balaci, 62, Romanian football player (Universitatea Craiova, Dinamo Bucureşti, national team) and manager, heart attack complicated by a stroke.Fotbal / Breaking News – Zi neagră în Bănie: Ilie Balaci a decedat! *Harry L. Ettlinger, 92, American engineer, member of the Monuments Men, recipient of the Congressional Gold Medal (2007).Harry L. Ettlinger obituary *Robert Faurisson, 89, British-born French journalist (Journal of Historical Review, Le Monde), academic and Holocaust denier.Le négationniste Robert Faurisson est mort *Jun-ichi Nishizawa, 92, Japanese electrical engineer.Former Tohoku U. president Junichi Nishizawa, known as 'Mr. Semiconductor,' dies at 92 *Joachim Rønneberg, 99, Norwegian military officer and broadcaster, commander of Operation Gunnerside.Krigshelt Joachim Rønneberg er død *Charles Wang, 74, Chinese-born American software developer (CA Technologies), philanthropist (Smile Train) and sports team owner (New York Islanders), lung cancer. ===22=== *Horacio Cardo, 74, Argentine painter and illustrator (The New York Times), stomach cancer.Falleció el artista plástico Horacio Cardo *Boris Kokorev, 59, Russian pistol shooter, Olympic champion (1996).Олимпийский чемпион по пулевой стрельбе Кокорев скончался на 60-м году жизни *Friedrich Ostermann, 86, German Roman Catholic prelate, Auxiliary Bishop of Münster (1981–2007).Langjähriger Regionalbischof für Münster-Warendorf wurde 86 Jahre alt *Eugene H. Peterson, 85, American clergyman and biblical scholar (The Message: The Bible in Contemporary Language), congestive heart failure.Eugene Peterson Is Now Living the Resurrection *Robert Saladrigas, 78, Spanish writer, journalist and literary critic, prostate cancer.Mor l'escriptor i crític literari Robert Saladrigas *José Varacka, 86, Argentine footballer (River Plate, national team) and coach (River Plate, Boca Juniors).Murió José Varacka, el entrenador que trajo a Enzo Francescoli a River ===23=== *Skip Campbell, 69, American politician, member of the Florida Senate (1996–2006) and Mayor of Coral Springs, Florida (since 2014), complications from hip surgery.Coral Springs Mayor Skip Campbell dies at 69 *James Karen, 94, American actor (Poltergeist, The Return of the Living Dead, Nixon), cardiopulmonary arrest.James Karen, Actor in 'Poltergeist' and So Much More, Dies at 94 *Alojz Rebula, 94, Italian-born Slovenian writer, playwright and essayist, member of the Slovenian Academy of Sciences and Arts (until 2018), heart attack.Umrl je Alojz Rebula *Laurens van Ravens, 96, Dutch football referee (Eredivisie, FIFA).Oud-scheidsrechter Van Ravens (96) overleden ===24=== *Carmen Alborch, 70, Spanish feminist writer and politician, Minister of Culture (1993–1996), pancreatic cancer.Muere la exministra Carmen Alborch a los 70 años *Rudolf Gelbard, 87, Austrian Holocaust survivor.Holocaust- Überlebender Rudolf Gelbard gestorben *Anatoly Gladilin, 83, Russian writer (Prognoz na zavtra, The Making and Unmaking of a Soviet Writer, Moscow Racetrack).http://portal-kultura.ru/articles/obshchiy-plan/219981-v-parizhe- na-84-m-godu-zhizni-skonchalsya-izvestnyy-sovetskiy-prozaik-anatoliy-gladilin/ *Hip Hop Pantsula, 38, South African rapper (\"O Mang?\", \"Acceptance Speech\", \"Dumela\"). *Christine Stix-Hackl, 60, Austrian jurist, Advocate General at the European Court of Justice (2000–2006), heart attack.Botschafterin Stix-Hackl verstorben *Tony Joe White, 75, American singer-songwriter (\"Polk Salad Annie\", \"Rainy Night in Georgia\", \"Steamy Windows\"), heart attack.Country bluesman, hit songwriter Tony Joe White dies ===25=== *Sara Anzanello, 38, Italian volleyball player (national team), leukemia.Morta Sara Anzanello: aveva 38 anni *Lindon Crow, 85, American football player (New York Giants, Los Angeles Rams), stroke.Lindon Crow, veteran of NFL's 'greatest game ever,' dies at 85 *Sonny Fortune, 79, American jazz saxophonist, stroke.Sonny Fortune, Stalwart Saxophonist Of New York, Dies At 79 *Thomas Keating, 95, American Trappist monk and author, respiratory failure.Thomas Keating, pioneer in centering prayer, interfaith dialogue, dies at 95 *Michael J. O'Connor, 89, American politician, member of the South Dakota House of Representatives (1971–1972) and Senate (1973–1977, 1981–1982), skin cancer.Bill Janklow foe, longtime South Dakota lawmaker Michael O'Connor dies *Shivinder Singh Sidhu, 89, Indian politician, Governor of Meghalaya (2007-2008) and Goa (2008-2011).Former Meghalaya, Manipur Governor SS Sidhu no more *John Ziegler Jr., 84, American ice hockey executive, NHL commissioner (1977–1992). ===26=== *Ana González de Recabarren, 93, Chilean human rights activist, lung infection.A los 93 años murió Ana González, destacada luchadora de los DDHH *Warren B. Hamilton, 93, American geologist.Warren B. Hamilton obituary *Nikolai Karachentsov, 73, Russian actor (Juno and Avos, The Dog in the Manger, A Man from the Boulevard des Capucines), People's Artist of the RSFSR (1989), kidney failure.Popular Russian Actor Nikolai Karachentsov Dies At 73 *György Károly, 65, Hungarian poet (Élet és Irodalom) and novelist (Folyamatos május, Dunakanyaró), brain cancer.Death announcement on official website ===27=== *Freddie Hart, 91, American country musician and singer-songwriter (\"Easy Loving\", \"My Hang-Up Is You\", \"Got the All Overs for You (All Over Me)\"), pneumonia. *Madan Lal Khurana, 82, Indian politician, Chief Minister of Delhi (1993–1996) and Governor of Rajasthan (2004), cerebral hemorrhage.BJP Leaders Condole Madan Lal Khurana's Death *Mario Segale, 84, American real estate developer, namesake of Nintendo's Mario.Mario's Real-Life Namesake, Mario Segale, Dies At 84 *Ntozake Shange, 70, American poet and playwright (For Colored Girls Who Have Considered Suicide / When the Rainbow Is Enuf), complications from a stroke.Ntozake Shange, pioneering playwright, poet and novelist, dies at 70 *Vichai Srivaddhanaprabha, 60, Thai businessman (King Power) and football club owner (Leicester City F.C.), helicopter crash.Club Statement: Vichai Srivaddhanaprabha ===28=== *Luis Miguel Enciso Recio, 88, Spanish historian and politician, Senator (1977–1982) and member of the Real Academia de la Historia (since 1999), complications from a fall.Muere a los 88 años Luis Miguel Enciso, senador liberal por UCD e historiador *Richard Gill, 76, Australian conductor and activist, colorectal and peritoneal cancer.‘A profound loss’: Renowned Australian conductor Richard Gill dies aged 76 *I. John Hesselink, 90, American theologian.Former seminary president, professor Hesselink dies *Konstantīns Konstantinovs, 40, Latvian-Russian powerlifter, World Powerlifting champion (2011).Konstantins Konstantinovs Dead: Bodybuilding Legend Dies at 40 *Colin Sylvia, 32, Australian football player (Melbourne, Fremantle), car crash.Former AFL player Colin Sylvia dies in Mildura car crash ===29=== *Lodi Gyari Rinpoche, 69, Tibetan diplomat, Ambassador to the United States (until 2018) and co-founder of the Tibetan Youth Congress, liver cancer.Former Special Envoy to Dalai Lama, Lodi Gyari Passes Away ===30=== *David Azulai, 64, Israeli politician, Minister of Religious Services (since 2015) and member of Knesset (1996–2018), cancer.Religious Affairs Minister Azoulay dies after battle with cancer *Whitey Bulger, 89, American gangster (Winter Hill Gang) and convicted murderer, beaten.\"Whitey\" Bulger killed in jail *Bill Fischer, 88, American baseball player (Chicago White Sox, Washington Senators, Kansas City Athletics).Bill Fischer, Royals’ senior pitching adviser and former KC A’s pitcher, dies at 88 *María Irene Fornés, 88, Cuban-American playwright (Sarita, Fefu and Her Friends), complications from dementia.Playwright María Irene Fornés Dies at 88 *Jin Yong, 94, Hong Kong novelist (Demi-Gods and Semi- Devils), essayist and journalist (Ming Pao).武侠小说泰斗金庸逝世 享年94岁 *Erika Mahringer, 93, Austrian alpine skier, Olympic bronze medalist (1948, 1952), heart failure.Skilegende Erika Mahringer verstorben *Beverly McClellan, 49, American singer (\"Piece of My Heart\", \"Beautiful\", \"The Thrill Is Gone\") and musician, cancer.‘The Voice’ Star Beverly McClellan Dies After Battle with Cancer *Teodoro Petkoff, 86, Venezuelan journalist (Tal Cual) and politician, Minister of the Central Office of Coordination and Planning (1996–1999), 2006 presidential candidate.Fallece el reconocido político y periodista venezolano Teodoro Petkoff *Emil Paleček, 88, Czech chemist, discovered nucleic acids electrochemistry, stroke.Ve věku 88 let zemřel biochemik Paleček, zabýval se výzkumem DNA *Sangharakshita, 93, British Buddhist educator and writer, founder of the Triratna Buddhist Community, pneumonia complicated by sepsis.Urgyen Sangharakshita 1925-2018 *Bob Skoronski, 84, American football player (Green Bay Packers), Alzheimer's disease.Former Green Bay Packers OL Bob Skoronski dies at 84 ===31=== *Willie McCovey, 80, American Hall of Fame baseball player (San Francisco Giants, Oakland Athletics, San Diego Padres), complications from an infection.San Francisco Giants legend Willie McCovey dies *Dana G. Mead, 82, American businessman, Chair of the Massachusetts Institute of Technology (2003–2010).Dana Mead PhD ’67, former chair of the MIT Corporation, dies at 82 *Ken Shellito, 78, English football player (Chelsea, national team) and manager (Cambridge United), lung infection and kidney failure.Ex-Sabah coach Ken Shellito passes away *Tony Streather, 92, British army officer and mountaineer. ==Months== * January * February * March * April * May * June * July * August * September * November ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *910 Category:October 2018 events",
 "title": "Deaths in October 2018"
}