{
 "id": "660516",
 "text": "Asiana Airlines Flight 733 (OZ733, AAR733, registration HL7229) was a domestic Asiana Airlines passenger flight. The flight was from Seoul-Gimpo International Airport to Mokpo Airport, South Korea. The flight crashed on 26 July 1993 in the Hwawon area of Haenam County, South Jeolla Province. 68 of the 116 passengers and crew on board were killed, including the captain and first officer. == Reason for the crash == The flight crashed on July 26 1993 after three failed landing attempts. The flight had 110 passengers and 6 crew members. The crash killed 68 people. It is the second deadliest crash in South Korean history. Asiana Airlines Flight 733 took-off from Seoul on 26 July 1993 2:37 pm and was supposed to arrive in Mokpo around 3:30 p.m. Captain Hwang In- Gi and First Officer Park Tae-Hwan were flying the plane. The weather was clear and fine in Seoul when the plane took off and the airline almost came near Mokpo. However the weather in their destination had heavy rain and strong wind so there was a minimum visibility level. The plane attempted its first landing at 3:24 pm. but it was unsuccessful. The second attempt was at 3:28 pm but was also unsuccessful. Finally, the final attempt was made at 3:38 pm. Suddenly, Asiana Airline 733 had lost communication with the control post and its last correspondence was 3:41 pm. Control post kept connecting to 733 flight but they couldn't get an answer. The Asiana Airline has made an official announcement that flight 733 was missing. Few hours later, the airline 733 was found at Mt. Ungeo in Masan-ri Hwawon-myeon, Haenam-Gun about 10 km from Mokpo Airport. After an investigation for the cause of the crash, it was found out that the flight was below the minimum safe altitude (1,600 feet) when it attempted its final landing. This was the reason it crashed into the mountainside. Also, having no instrument for landing (ILS) in Mokpo Airport contributed to the crash as it was hard for the pilot to find a safe place to land the plane in the bad weather. == Notes == Category:Aviation accidents and incidents in the 1990s Category:Aviation accidents and incidents in Asia Category:1993 in Asia Category:20th century in South Korea",
 "title": "Asiana Airlines Flight 733"
}