{
 "id": "66092",
 "text": "The Socialist Unity Party of Germany (German: Sozialistische Einheitspartei Deutschlands, shortened: SED) was the governing party of East Germany from 1949, when East Germany was created, until the elections of 1990. It was formed in 1946 a year after World War 2 ended in 1945 and after Nazi Germany was defeated and after the Nazi Party was banned. The SED was created in April 1946 in the Berliner Admiralspalast when the Soviet Union forced the Social Democratic Party of Germany (SPD) members and the Communist Party of Germany (KPD) members who lived in the Soviet-occupied parts of Germany and Berlin. After 1990, the party reformed itself as the Party of Democratic Socialism (later in 2005, the Left Party.PDS). It is still somewhat popular in parts of the former East German territory, frequently winning seats at state and local elections. In the September 2005, Bundestag election the PDS was in coalition with WASG (Electoral Alternative for LaLabournd Social Justice), which was formed by Oskar Lafontaine who left the SPD. The PDS and WASG joined together in 2007. A famous SED poster read: To learn from Stalin means to learn how to win. Later, the word Stalin was replaced with the USSR. When Gorbachev was president of the USSR the famous slogan was abandoned, as the SED did not believe there was anything to learn from his ideas about perestroika. At first the SED had a branch in West Berlin, but in 1962 the West Berlin branch was separated from the SED proper and became a \"separate\" party called the Socialist Unity Party of West Berlin (Sozialistische Einheitspartei Westberlins - SEW) but with the same ideas as the parent party. ==The final days== Between the fall of the Berlin Wall in November 1989 and the election in March 1990, the old Social Democratic Party was re-established as a separate party, while the rest of the SED lost a lot of members and renamed itself the Party of Democratic Socialism (PDS) at a special party meeting in December 1989. By becoming the PDS the party survived the reuniting of East Germany and West Germany, and eventually started growing again, managing to get representatives elected to the Bundestag. On December 1, 1989 the SED was forced to give up its 40 year monopoly of power when the State Council (Volksammer) revoked the clause in the constitution of the GDR that guaranteed the SED to be the sole legal party in East Germany. Its leader and all of the politburo resigned three days later and the party was finally dissolved on December 16, 1989. ==General Secretaries of the Central Committee of the SED== (known as \"First Secretary\" from 1953 - 1976) *Walter Ulbricht (July 1950 – May 3, 1971) *Erich Honecker (May 3, 1971 – October 18, 1989) *Egon Krenz (October 18, 1989 – December 3, 1989) These three party leaders were also the equivalent of the Prime Minister or President in other countries; they really led the government as well as the main, legally powerful party, which was not often the case in other Communist countries. Category:1946 establishments in Germany Category:1990 disestablishments in Germany Category:Communist parties in Europe Category:East Germany Category:Former political parties in Germany",
 "title": "Socialist Unity Party of Germany"
}