{
 "id": "661209",
 "text": "The Magic School Bus is an animated children's television series, based on the book series of the same name by Joanna Cole and Bruce Degen. The series has received critical acclaim for its use of celebrity talent and combining entertainment with an educational series. Broadcasting & Cable said the show was \"among the highest-rated PBS shows for school-age children.\" A reboot titled The Magic School Bus Rides Again began on Netflix on September 29, 2017. ==Plot== A teacher named \"Ms. Frizzle\" embarks on exciting adventures with her pet chameleon called Liz Ard and her class known as the Frizzlers on her eponymous vintage Spanish steam-diesel hybrid school minibus referred as the Magic School Bus. As they journey on their secret field trips, they discover locations, creatures, time periods and more things to learn about the wonders of science along the way. ==Voice cast== * Lily Tomlin as Mrs. Valerie Frizzle * Amos Crawley (season 1) and Danny Tamberelli (seasons 2-4) as Arnold Perlstein * Daniel DeSanto as Carlos Ramon * Tara Meyer as Dorothy Ann \"D.A.\" Hudson * Erica Luttrell as Keesha Franklin * Maia Filar as Phoebe Terese * Stuart Stone as Ralphie Tennelli * Max Beckford (season 1) and Andre Ottley- Lorant (seasons 2-4) as Tim Wright * Lisa Yamanaka as Wanda Li == Production and broadcast == A Scholastic, Nelvana Limited, & Hong Guang Animation (Suzhou) Company Limited Co-Production, Presented by South Carolina ETV. They made The Magic School Bus books into an animated television series. It began on September 10, 1994. Many parents and teachers wanted Scholastic, Nelvana Limited, & Hong Guang Animation (Suzhou) Company Limited to help kids and minorities learn more about science in a fun way. === Advertisements === Each episode of the series ran for 30 minutes. There was a Producer Says part at the end of each episode when The Magic School Bus had no advertisements. There were no advertisements on international television, VHS, and DVD. The Producer Says part was taken out when The Magic School Bus had advertisements. This way, there was enough time for advertisements. Sometimes the episode faded to black at the start of the advertisements. When there are no advertisements, the episode faded to black and then faded back in. === Writers === Peter Lurye wrote the song played at the beginning of the show. It was called \"Ride on the Magic School Bus\". Famous rock 'n' roll singer Little Richard sang it. Frank Saperstein, Jeph Loeb, & Jocelyn Stevenson helped write the show. Stevenson also worked on Fraggle Rock. === Broadcast history === ==== In US ==== In the United States, The Magic School Bus originally aired on PBS as a part of its children's block, PTV Park, through South Carolina's SCETV network. It was the first fully animated series to be aired on PBS. The final episode aired on December 6, 1997. The series then aired reruns on PBS until October 1998. Fox Kids Network, in a hasty effort to fill educational television mandates for its stations, aired reruns on its weekday block from September 1998 to September 2002. Beginning on September 27, 2010, The Magic School Bus started a daily run on child-oriented network Qubo in the US, and on Saturday mornings on NBC. The Fox Kids and Qubo airings both used a shortened version of the opening. The Magic School Bus was also seen on TLC from February 15, 2003 until 2008. It also aired on the Ready Set Learn block on Discovery Kids from 2004 to 2009. ==== In Canada ==== The series was widely known in Canada for showing reruns on CBC as part of its children's block, now known as Kids' CBC, from 1999 to 2004. In 2005, Nelvana sold the series to Latin American versions of Cartoon Network and Nickelodeon. In Canada, it ran on Teletoon from 1998 until 2000, and has run on TVO Kids in 1998. It was presented internationally by Discovery Kids from 2004 to 2009, and in the UK, Latin America, Australia, Spain, and India by Nickelodeon from 1995 to 2003. It was also shown in the UK by Pop from 2003 to 2007. It aired for some time on Channel 4 from 1996 to 2000. It also aired on CITV from 1995 to 2002. Other airers have included TV Tokyo (1997 to 1999), Kindernet (2003 to 2007), EBS of South Korea (1995 to 1999), Boomerang (Latin America, 2001 - 2008), The Den (Ireland) from 1995 to 2000 and Channel 6 (Israel), 1999 to 2002. == Home media == The series was originally released on VHS by KidVision between 1995 and 2003 and on DVD by Warner Home Video between 2002 and 2013. Only the VHSs and DVDs contain the funding credits. In the home video releases, all the episodes are uncut with the Producer Says segments intact. On July 31, 2012, New Video Group released the complete series on DVD in Region 1 for the very first time.More than one of `|accessdate=` and `|accessdate=` specified (help) On August 15, 2013, Scholastic announced the entire series would be available on Netflix. == Reception == Jason Fry, in a column for the online edition of The Wall Street Journal, expressed an overall appreciation for the show, but wrote that the episode \"The Magic School Bus Gets Programmed\" should have been about the dangers of Internet searches and network concepts arising at the time, rather than an old-fashioned technology-run-amok story about the respective roles of programmer and machine (although he conceded that the episode was ten years old). Tomlin won a Daytime Emmy for her role as Ms. Frizzle. == Games == Various computer and video games associated with the series were released from 1994 to 2001, and were typically amalgamations of storylines from both the original book series and the television show. The games were published by Microsoft Home for the Educational purpose. A video game titled The Magic School Bus: Oceans was released for Nintendo DS on October 25, 2011, ten years after the release of the last game. The video game, similar to the computer game before it, was likely based on the book, The Magic School Bus On the Ocean Floor and the TV episode, The Magic School Bus Gets Eaten. This is the only game to have been released for the Nintendo platform. == Reboot series == On June 10, 2014, a new series was announced by Netflix and Scholastic Enterprises titled The Magic School Bus 360°. The new iteration of the franchise features a modernized Ms. Frizzle and high-tech bus that stresses modern inventions such as robotics, wearables and camera technology. The producers hoped to captivate children's imaginations and motivate their interest in the sciences. Funbag Animation Studio Inc. would produce the series. Producer Stuart Stone, who voiced Ralphie in the original series, stated that The Magic School Bus 360° will feature some of the original voice actors in same roles. The show's voice cast is based in Los Angeles and Toronto with Susan Blu as the Los Angeles voice director and Stuart Stone as the Toronto voice director. In February 2017, Netflix announced that Lily Tomlin was in the role of Fiona Felicity Frizzle, the younger sister of Ms. Frizzle, now Professor Frizzle, again played by Tomlin. By this point the title of the series had been changed to The Magic School Bus Rides Again. Little Richard returns to perform the theme song. The series began on Netflix on September 29, 2017. On October 17, 2024, it was announced a Magic School Bus spin-off The Magic School Bus: Mighty Explorers is currently in the works. The Magic School Bus will talk in this series. The series will be CG-animated and geared more towards a preschool audience. == References == ==Other websites== * * * * * * The Magic School Bus Rides Again at Netflix * https://aaa.youtube.com/watch?v=VOyWd9JsCjU&pp;=ygUhbWFnaWMgc2Nob29sIGJ1cyBuZXdzIGdsb2JhbCAxOTk3 Category:1990s American animated television series Category:1994 American television series debuts Category:1994 Canadian television series debuts Category:1997 American television series endings Category:1997 Canadian television series endings Category:PBS Kids shows Category:English-language television programs",
 "title": "The Magic School Bus (TV series)"
}