{
 "id": "661357",
 "text": "Jamal Ahmad Khashoggi (13 October 1958 – 2 October 2018) was a Saudi Arabian journalist and Washington Post columnist, famous for his critical opinions on his country's government and gained international attention following his controversial disappearance and murder in 2018. After finishing university at Indiana State University in the United States, Khashoggi returned home to Saudi Arabia and became a journalist for various newspapers. In his articles, he promoted democracy, women’s and human rights, and reforms leading to disagreements with the religious and political elites. Jamal Khashoggi fled to the US to continue expressing his opinion. In preparation for his planned marriage, he travelled to Istanbul to get the required paperwork at the Saudi consulate. After entering the Saudi consulate, Jamal Khashoggi was killed, likely on orders of Saudi Crown Prince Mohammed Bin Salman. == Journalistic Career == After finishing primary and secondary education in Saudi Arabia, Khashoggi obtained a bachelor's degree in Business Administration at Indiana State University. After his studies, Khashoggi became a journalist for the Saudi newspaper Saudi Gazette. Between 1987 and 1999, Khashoggi worked for Alsharq Alawsat, Arab News and Al Hayat. Over that time he documented the Afghanistan War and the first Gulf War and became an expert in political Islam. In 1999 he started working for the Saudi newspaper Al-Watan but was fired for criticising the political and religious Saudi elites. He then became advisor to the Saudi ambassador to the United Kingdom, Prince Turki Al-Faisal. In 2007, he started working again for Al-Watan and was fired again for his liberal views. Khashoggi’s 2015 initiative to start his own liberal broadcast channel based in Bahrain was immediately shut down by the government of Bahrain. After his exile to the United States, Khashoggi worked as an independent writer for the Washington Post and his columns were published both in English and Arabic. == Political Views == Jamal Khashoggi's job as a journalist made him document the Soviet invasion of Afghanistan and the first Gulf War between 1979 and 1991. He met Osama Bin Laden whom he initially supported in resisting the Soviet occupation of Afghanistan. When Bin Laden radicalised and launched terror attacks against the United States, Khashoggi opposed the methods and ideas of Bin Laden. Because of Khashoggi's link to Bin Laden, he had strong connections with Saudi officials who wanted to know what he knew. Khashoggi became a strong voice against Islamic extremism and became a believer in democracy, a free press, human rights, and fair laws. He thought that giving everyone their political and civil rights could help solve problems like war and instability in the Arab world. After expressing his opinion became impossible in Saudi Arabia, he fled to the United States to continue criticising the Saudi government, its involvement in the Yemeni Civil War and the lack of democracy and free press in the Middle East. == Assassination == On October 2, Khashoggi travelled to Türkiye with his fiancée, Hatice Cengiz, to get the paperwork for their marriage finalised. Previously, officials from the Saudi Embassy in Washington told him to pick up the necessary documents there. After arriving, Khashoggi was kept hostage in the Saudi consulate in Istanbul on 2 October 2018.Conflicting Saudi, Turkish claims on Jamal Khashoggi whereabouts, aljazeera According to Turkish sources, Khashoggi was then tortured and killed inside the Saudi consulate in Istanbul. On 15 October, an inspection of the consulate, by both Saudi Arabian and Turkish officials took place and found evidence that supported the belief that Khashoggi was killed. == Consequences of the Murder == Initially, the Saudi government denied any involvement in the murder arguing Khashoggi had left the Consulate after the meeting. 17 days after Khashoggi disappeared, the Saudi government admitted that their officials were involved in the murder. Khashoggi was 49 years old when he died. In trials that happened behind closed doors, the Saudi Arabian government found eight people guilty of the murder, five of whom were given the death penalty but were later pardoned by the Saudi government. Even though there was good proof that the Crown Prince himself ordered the murder, the United States and European states did not punish Saudi Arabia severely. == Legacy == The assassination of Khashoggi sent shock waves around the world. Today, many journalists praise Khashoggi's memory and the importance of speaking out against social and political injustices. In 2018, Jamal Khashoggi was chosen Time Magazine's Person of the Year even though he already passed away. He was honoured for his journalism work together with other journalists who have lost their lives because of their work. ==References== Category:1958 births Category:2018 deaths Category:Naturalized citizens of the United States Category:Deaths by strangulation Category:Time People of the Year Category:American murder victims Category:Saudi Arabian writers Category:American columnists Category:Businesspeople from Washington, D.C. Category:Writers from Washington, D.C.",
 "title": "Jamal Khashoggi"
}