{
 "id": "661493",
 "text": "Hurricane Michael was an Atlantic tropical cyclone. The storm threatened Cuba, northwestern Florida, Georgia and southern Alabama. It was the 13th named storm, seventh hurricane, and the second major hurricane of the 2018 Atlantic hurricane season. It was the first Category 5 hurricane and the strongest on record to impact the Florida Panhandle, and was the fourth-strongest landfalling hurricane in the United States in terms of wind speed. As Michael became a Category 5 hurricane, the 2018 Atlantic hurricane season became a third consecutive season to feature at least one Category 5 hurricane since Matthew in 2016 and Irma in 2017; this also makes Michael the third straight \"M\" name to feature as a Category 5 hurricane since Matthew in 2016 and Maria in 2017 as well. The storm passed near western Cuba on October 7-8. The storm led to six deaths in Honduras, four in Nicaragua and three in El Salvador. Michael became a major hurricane on Tuesday, October 9, 2018. The storm struck near Mexico Beach, Florida in the Florida Panhandle as a borderline Category 5 hurricane, which makes it the first tropical cyclone to make landfall in the United States as a Category 5 hurricane since Hurricane Andrew in 1992. It had a wind speed of 160 mph and a central pressure of 919 millibars. It was originally designated as a high-end Category 4 hurricane with wind speed of 155 mph, but from post-analysis, it was indeed a Category 5 hurricane as originally thought. It was said to be the strongest hurricane to hit Florida since Andrew in 1992 in terms of pressure which it had a central pressure of 922 millibars. It was also the strongest hurricane to hit the United States in terms of pressure since Hurricane Camille in 1969, which had a pressure of 900 millibars. == Retirement == On March 20, 2019, the World Meteorological Organization retired the name Michael due to extreme and very expensive damage it caused along its track, particularly in the Florida Panhandle and southwest Georgia, and it will never again be used for another Atlantic hurricane. It will be replaced with Milton for the 2024 season. ==References== Michael Category:2018 in the United States Category:21st century in Honduras Category:21st century in Nicaragua Category:21st century in El Salvador Category:2010s in Cuba Category:2010s in Jamaica Category:October 2018 events Michael Michael Michael",
 "title": "Hurricane Michael"
}