{
 "id": "661519",
 "text": "Far East Air Transport Flight 103, a Boeing 737-200, registration B-2603, left Taipei Songshan Airport for Kaohsiung on 22 August 1981. The aircraft exploded fourteen minutes after takeoff and disintegrated. == Summary == The aircraft had previously lost cabin pressure on 5 August. Earlier on the day of the crash it had departed Songshan Airport but the crew aborted the flight ten minutes later for the same reason. After repairs were made the aircraft departed Songshan Airport again and broke up shortly afterward. == Cause == There was early speculation that the crash was caused by a bomb. An investigation by the Republic of China Civil Aeronautics Board concluded that severe corrosion led to a pressure hull rupture. The severe corrosion was due to the many pressurization flight cycles the aircraft had experienced. The cracks produced were probably undetected. The wreckage was scattered across an area of south of Taipei. All 110 people onboard (110 passengers and crew, including eighteen Japanese citizens (among them Kuniko Mukōda)\"AIRLINER THAT CRASHED IN TAIWAN, KILLING 110, HAD PRESSURE SNAGS.\" Associated Press at The New York Times. Sunday 23 August 1981. Late City Final Edition, Section 1, Page 3, Column 1. Retrieved on 6 January 2012. and two Americans) died.\"U.S. Experts to Probe Crash.\" Associated Press at the Sarasota Herald-Tribune. Sunday 30 August 1981. 3A. Retrieved on 6 January 2012. The accident was Taiwan's worst air disaster at the time, but is now the second-worst, behind China Airlines Flight 676. ==Related pages== * Aloha Airlines Flight 243 * China Airlines Flight 611 * Japan Airlines Flight 123 ==References== * UK CAA Document CAA 429 World Airline Accident Summary (ICAO Summary 4/76) ==Other websites== * Category:Aviation accidents and incidents in the 1980s Category:Aviation accidents and incidents in Asia Category:1981 in Asia Category:20th century in Taiwan",
 "title": "Far Eastern Air Transport Flight 103"
}