{
 "id": "661661",
 "text": "Hello Neighbor is a survival horror stealth game developed by Russian game development studio Dynamic Pixels and published by tinyBuild. The aim of the game is for the player to successfully sneak into the basement of their neighbor's house to uncover a secret. The game's artificial intelligence (AI) modifies the neighbor's behavior based on the player's past actions. == Versions == There is currently 11 versions of Hello Neighbor. They include: # Pre-Alpha (First playable version) # Alpha 1 # Alpha 2 # Alpha 3 # Alpha 4 Beta (Uploaded to GameJolt, unknown if it's a real build.) # Alpha 4 # Beta 1 (First beta of the game, not very popular.) # Beta 2 (More popular, although it was buggy.) # Beta 3 (Final beta version.) # Pre-Release (This is the playtest version of the game, but TinyBuild never announced it.) # Full release (This was the final version. It was released on December 8th, 2017, but if so funny and serious moments!) ===Lost versions=== These versions were never publicly available. # Low Quality DevGAMM (Same project file as the current DevGAMM, though it had lower quality. It can be viewed here.) # Early Prototype (It is an early version of the Prototype. It can be viewed here) # Prototype (It was created to showcase the mechanics of the game, but it was replaced by the Pre-Alpha. It can be viewed here.) # Completely Unknown Build (Confirmed to be an entirely early build of the Pre-Alpha. It can be viewed here.) # The Most Misterious HN Build Known to Exist 1 (It looks partially made in Unity. It can be viewed here.) # The Most Mysterious HN Build Known to Exist 2 (The only proof of this build's existences is GIFs. It can be viewed here.) # Early Pre-Alpha (10 Minute Unedited Pre-Alpha Gameplay: Pre-Alpha with minor differences such as sound effects and ambient music. It can be viewed here.) # Early Pre-Alpha (AI Rundown: Pre-Alpha with many differences such as the lighting. It can be viewed here.) # Alpha 0.5 (Nothing is known about the gameplay of this version, only concept art was shown.) # Pre-Release Alpha 1 (Alpha 1 but with a bigger cursor that would become enlarged and brighter when over pickable objects. It can be viewed here.) # Alpha 1.5 (It was shown when Alpha 2 was developing. It can be viewed here.) # Early Alpha 2 (It is an incomplete version of Alpha 2. It differs from Alpha 1.5. It can be viewed here.) # Alpha 3 Untextured Daft (Untextured draft of Alpha 3. It can be viewed here.) # Alpha 2.5 (It is an early version of Alpha 3 that is in daytime mode rather than nighttime. It can be viewed here.) # Alpha 3.5 (It is an early and very unfinished version of Alpha 4. It can be viewed here.) == Franchise == Hello Neighbor has been turned into a media franchise. In July 2019, tinyBuild created a new studio called Eerie Guest Studio and invested into the franchise. # Hello Bendy was a game that was Bendy and the Ink Machine-themed. It was the second game in series. # Hello Guest is a spin-off game that revolved around \"The Guest\" instead of the neighbor. # Secret Neighbor: Hello Neighbor Multiplayer is the fourth Hello Neighbor game. It is a multiplayer social deduction game. # Hello Neighbor: Hide and Seek is a game that is prequel to Hello Neighbor. It released in 2018. # Hello Neighbor 2 is the game's sequel released in in 2022. # Hello Engineer is a vehicle building game. # Hello Neighbor Nicky's Diaries is the latest game, soft-launched in 11 regions in June 2022, and globally released in December 2023. # Hello Neighbor 3 (formerly RBO) is an upcoming game. It presumably takes place after Hello Neighbor 2. # Hello Neighbor has also been adapted into a comic book and an animated web series. == Active Levels == * Act 1 * Act 2 * Act 3 ==References== Category:2017 video games Category:2010s horror video games Category:Android (operating system) games Category:Indie video games Category:IOS games Category:Nintendo Switch games Category:PlayStation 4 games Category:Stealth video games Category:Survival horror video games Category:Video games developed in Russia Category:Windows games Category:Xbox One games",
 "title": "Hello Neighbor"
}