{
 "id": "661803",
 "text": "Abby Lea Finkenauer (born December 27, 1988) is an American politician who has been the United States Special Envoy for Global Youth Issues since 2022. She is a member of the United States Democratic Party. She was a member of the United States House of Representatives for Iowa's from January 3, 2019 until January 3, 2021. ==Political career== In 2015, she became the member of the Iowa House of Representatives from the 99th district. In the United States House of Representatives' 2018 election, Finkenauer was the Democratic nominee for Iowa's 1st Congressional District. She won the election. She lost her re- election in November 2020 to Republican Ashley Hinson. In July 2021, Finkenauer announced her candidacy for the 2022 U.S. Senate election in Iowa, for the seat held by Chuck Grassley. On April 11, 2022, a judge ruled that she could not appear on the Democratic primary ballot because her nominating petitions did not have enough verified signatures. Four days later, the State Supreme Court ruled Finkenauer can appear on the ballot. However, she lost the nomination to retired vice admiral Michael Franken in June 2022. In November 2022, Finkenauer was nominated to be a United States Special Envoy for Global Youth Issues. She took office on December 1, 2022. ==Personal life== Finkenauer was born in Sherrill, Iowa. She was raised in Dubuque, Iowa. In 2011, Finkenauer graduated from Drake University in Des Moines, Iowa, with a bachelor's degree in public relations. Finkenauer married Daniel Wasta, the Iowa Political Director for the Elizabeth Warren 2020 presidential campaign in 2020. Finkenauer has endometriosis and has supported endometriosis research funding. ==References== ==Other websites== * * Member profile at the Iowa General Assembly * Category:United States representatives from Iowa Category:Democratic Party (United States) politicians Category:1988 births Category:Living people Category:People from Dubuque, Iowa Category:Ambassadors of the United States",
 "title": "Abby Finkenauer"
}