{
 "id": "66217",
 "text": "The list of popes begins with St. Peter and continues through the present day. \"List of Popes,\" Catholic Encyclopedia (2009); see Nihil Obstat. June 1, 1911. Remy Lafort, S.T.D., Censor. Imprimatur. +John Cardinal Farley, Archbishop of New York; retrieved 2013-4-8. The pope is the head of the Catholic Church. Peter was called the Bishop of Rome. \"St. Peter, Prince of the Apostles,\" Catholic Encyclopedia; retrieved 2013-3-18. All others who became Bishop of Rome were also recognized as popes. == Chronological list of popes == The list sometimes says interregnum. This is Latin for \"between reigns\". It means there was no Pope; as in a Pope had died, and his successor hadn't yet been elected. === From 30 to 249 === Dates of reign English name Official Latin name Personal name Place of birth 30 to 67 Peter Saint Peter Petrus Simon Peter שמעון בן יונה (Shimon ben Yona) Shimon Kipha CΙΜΗΟΝ ΚΗΦΑC (Simeon Kephas - Simon the Rock) Bethsaida, Galilea post42/ante57 to 64/67(?) Petrus 64/67(?) to 76/79(?) Linus Saint Linus Linus Linus Tuscia (Northern Latium) 76/79(?) to 88 Anacletus (Cletus) Saint Anacletus Anacletus Anacletus Probably Greece 88/92 to 97/101 Clement I Saint Clement Clemens Primus Rome 97/99 to 105/107 Evaristus (Aristus) Saint Evaristus Evaristus Aristus 105/107 to 115/116 Alexander I Saint Alexander Alexander Primus Alexander 115/116 to 125 Sixtus I Saint Sixtus Xystus Primus Rome or Greece 125 to 136/138 Telesphorus Saint Telesphorus Telesphorus Greece 136/138 to 140/142 Hyginus Saint Hyginus Hyginus Greece 140/142 to 155 Pius I Saint Pius Pius Primus Aquileia, Friuli, Italy 155 to 166 Anicetus Saint Anicetus Anicetus Emesa, Syria c.166 to 174/175 Soter Saint Soter Soterius Fondi, Latium, Italy 174/175 to 189 Eleuterus Saint Eleutherus Eleutherius Nicopoli, Epyrus 189 to 198/199 Victor I Saint Victor Victor Primus Northern Africa 199 to 217 Zephyrinus Saint Zephyrin Zephyrinus Rome c.217 to 222/223 Callixtus I Saint Callixtus Callistus Primus 222/223 to 230 Urban I Saint Urban Urbanus Primus Rome 21 July 230 to 28 September 235 Pontian Saint Pontian Pontianus Rome 235 to 3 January 236 Anterus Saint Anterus Anterus Greece 10 January 236 to 20 January 250 Fabian Saint Fabian Fabianus Rome === From 250 to 499 === Ordinal number Dates of reign Portrait English name Latin name Personal name Place of birth 21 251 -- 253 Cornelius Saint Cornelius Cornelius 22 253 -- 254 Lucius I Saint Lucius Lucius Primus Rome 23 254 -- 257 Stephen I Saint Stephen Stephanus Primus Rome 24 257 -- 258 Sixtus II Saint Sixtus II Xystus Secundus Greece 25 259 -- 268 Dionysius Saint Dionysius Dionysius Greece 26 269 -- 274 Felix I Saint Felix Felix Primus Rome 27 275 -- 283 Eutychian Saint Eutychian Eutychianus 28 283 -- 296 Caius Saint Caius Caius 29 296 -- 304 Marcellinus Saint Marcellinus Marcellinus 30 308 -- 309 Marcellus I Saint Marcellus Marcellus Primus 31 309 or 310 Eusebius Saint Eusebius Eusebius 32 311 -- 314 Miltiades Melchiades Saint Miltiades Miltiades Africa 33 314 -- 335 Sylvester I Saint Sylvester Silvester Primus 34 336 -- 336 Mark Saint Mark Marcus Rome 35 337 -- 352 Julius Saint Julius Iulius Primus Rome 36 352 -- 366 Liberius Liberius 37 366 -- 384 Damascus Saint Damasus Damasus Primus Idanha-a-Nova, Portugal 38 384 -- 399 Siricius Saint Siricius Siricius 39 399 -- 401 Anastasius I Saint Anastasius Anastasius Primus 40 401 -- 417 Innocent I Saint Innocent Innocentius Primus 41 417 -- 418 Zosimus Saint Zosimus Zosimus 42 418 -- 422 Boniface I Saint Boniface Bonifacius Primus 43 422 -- 432 Celestine I Saint Celestine Coelestinus Primus 44 432 -- 440 Sixtus III Saint Sixtus Xystus Tertius 45 440 -- 461 Leo I Saint Leo Leo the Great Leo Primus Rome 46 461 -- 468 Hilarius Saint Hilarius Hilarius 47 468 -- 483 Simplicius Saint Simplicius Simplicius Tivoli, Italy 48 483 -- 492 Felix III Saint Felix Felix Tertius Rome 49 492 -- 496 Gelasius I Saint Gelasius Gelasius Primus Africa 50 496 -- 498 Anastasius II Anastasius Secundus 51 498 -- 514 Symmachus Saint Symmachus Symmachus Sardinia === From 500 to 749 === Dates of reign English name Official Latin name Personal name Place of birth 20 July 514 to 19 July 523 Hormisdas Saint Hormisdas Hormisdus Frosinone, Southern Latium, Italy 13 August 523 to 18 May 526 John I Saint John Ioannes Primus Tuscany 13 July 526 to 22 September 530 Felix IV Saint Felix Felix Quartus Samnium 22 September 530 to 17 October 532 Boniface II Bonifacius Secundus Rome to Ostrogoth parents 2 January 533 to 8 May 535 John II Ioannes Secundus Mercurius Rome 13 May 535 to 22 April 536 Agapetus I Agapitus Saint Agapetus Agapetus Primus 1 June 536 to 11 November 537 Silverius Saint Silverius Silverius 29 March 537 to 7 June 555 Vigilius Vigilius Rome 16 April 556 to 4 March 561 Pelagius I Pelagius Primus Rome 17 July 561 to 13 July 574 John III Ioannes Tertius Catelinus 2 June 575 to 30 July 579 Benedict I Benedictus Primus 26 November 579 to 7 February 590 Pelagius II Pelagius Secundus Rome 3 September 590 to 12 March 604 Gregory I, O.S.B. Saint Gregory Gregory the Great Gregorius Primus Rome 13 September 604 to 22 February 606 Sabinian Saint Sabinian Sabinianus Blera 19 February 607 to 12 November 607 Boniface III Bonifacius Tertius Rome 25 August 608 to 8 May 615 Boniface IV, O.S.B. Saint Boniface Bonifacius Quartus Marsi 19 October 615 to 8 November 618 Adeodatus I Adeodatus Primus Rome 23 December 619 to 25 October 625 Boniface V Bonifacius Quintus Naples 27 October 625 to 12 October 638 Honorius I Honorius Primus October 638 to 2 August 640 Severinus Severinus Rome 24 December 640 to 12 October 642 John IV Ioannes Quartus Zadar, Dalmatia, now Croatia 24 November 642 to 14 May 649 Theodore I Theodorus Primus Palestine July 649 to 16 September 655 Martin I Saint Martin Martinus Primus 10 August 654 to 2 June 657 Eugene I Saint Eugene Eugenius Primus Rome 30 July 657 to 27 January 672 Vitalian Saint Vitalian Vitalianus 11 April 672 to 17 June 676 Adeodatus II, O.S.B. Adeodatus Secundus 2 November 676 to 11 April 678 Donus Donus 27 June 678 to 10 January 681 Agatho Saint Agatho Agatho Sicily December 681 to 3 July 683 Leo II Saint Leo Leo Secundus Sicily 683/26 June 684 to 8 May 685 Benedict II Saint Benedict Benedictus Secundus 12 July 685 to 2 August 686 John V Ioannes Quintus Syria 21 October 686 to 22 September 687 Conon Conon 15 December 687 to 8 September 701 Sergius I Saint Sergius Sergius Primus Sicily 30 October 701 to 11 January 705 John VI Ioannes Sextus Greece 1 March 705 to 18 October 707 John VII Ioannes Septumus Greece 15 January 708 to 4 February 708 Sisinnius Sisinnius Syria 25 March 708 to 9 April 715 Constantine Constantinus Syria 19 May 715 to 11 February 731 Gregory II Saint Gregory Gregorius Secundus 18 March 731 to 28 November 741 Gregory III Gregorius Tertius Syria 3 December 741 to 14 March/22 March 752 Zachary Saint Zachary Zacharias Greece === From 750 to 999 === Dates of reign English name Official Latin name Personal name Place of birth 23 March 752 to 25 March 752 Never took office as Pope. (Pope-elect_Stephen) Stephanus 26 March 752 to 26 April 757 Stephen II Stephanus Secundus 29 May 757 to 28 June 767 Paul I Saint Paul Paulus Primus 1 August 767 to 24 January 772 Stephen III Stephanus Tertius 1 February 772 to 26 December 795 Adrian I Hadrianus Primus Rome 26 December 795 to 12 June 816 Leo III Leo Tertius 12 June 816 to 24 January 817 Stephen IV Stephanus Quartus 25 January 817 to 11 February 824 Paschal I Saint Paschal Paschalis Primus Rome 8 May 824 to August 827 Eugene II Eugenius Secundus Rome August 827 to September 827 Valentine Valentinus Rome October 827 to January 844 Gregory IV Gregorius Quartus January 844 to 7 January 847 Sergius II Sergius Secundus Rome January 847 to 17 July 855 Leo IV, O.S.B. Saint Leo Leo Quartus Rome 855 to 7 April 858 Benedict III Benedictus Tertius 24 April 858 to 13 November 867 Nicholas I Saint Nicholas Nicholas the Great Nicolaus Primus 14 December 867 to 14 December 872 Adrian II Hadrianus Secundus Rome 14 December 872 to 16 December 882 John VIII Ioannes Octavus Rome 16 December 882 to 15 May 884 Marinus I Marinus Primus 17 May 884 to c.September 885 Adrian III Saint Adrian Hadrianus Tertius Rome 885 to 14 September 891 Stephen V Stephanus Quintus 19 September 891 to 4 April 896 Formosus Formosus Ostia 4 April 896 to 19 April 896 Boniface VI Bonifacius Sextus Rome 22 May 896 to August 897 Stephen VI Stephanus Sextus August 897 to November 897 Romanus Romanus December 897 Theodore II Theodorus Secundus January 898 to January 900 John IX, O.S.B. Ioannes Nonus 900 to 903 Benedict IV Benedictus Quartus Rome July 903 to September 903 Leo V Leo Quintus Ardea 29 January 904 to 14 April 911 Sergius III Sergius Tertius Rome April 911 to June 913 Anastasius III Anastasius Tertius Rome July/August 913 to February/March 914 Lando Landus Sabina, Italy March 914 to May 928 John X Ioannes Decimus May 928 to December 928 Leo VI Leo Sextus December 928 to February 931 Stephen VII Stephanus Septimus February/March 931 to December 935 John XI Ioannes Undecimus 3 January 936 to 13 July 939 Leo VII, O.S.B. Leo Septimus 14 July 939 to October 942 Stephen VIII Stephanus Octavus 30 October 942 to May 946 Marinus II Marinus Secundus 10 May 946 to December 955 Agapetus II Agapetus Secundus 16 December 955 to 14 May 964 John XII Ioannes Duodecimus Octavian 22 May 964 to 23 June 964 Benedict V Benedictus Quintus July 964 to 1 March 965 Leo VIII Leo Octavus Rome 1 October 965 to 6 September 972 John XIII Ioannes Tertius Decimus 19 January 973 to June 974 Benedict VI Benedictus Sextus October 974 to 10 July 983 Benedict VII Benedictus Septimus December 983 to 20 August 984 John XIV Ioannes Quartus Decimus Pietro Campanora Pavia August 985 to March 996 John XV Ioannes Quintus Decimus Rome 3 May 996 to 18 February 999 Gregory V Gregorius Quintus Bruno of Carinthia 2 April 999 to 12 May 1003 Sylvester II Silvester Secundus Gerbert d'Aurillac Auvergne region of France === From 1000 to 1249 === Dates of reign English name Official Latin name Personal name Place of birth June 1003 to December 1003 John XVII Ioannes Septimus Decimus Siccone Rome 25 December 1003 to July 1009 John XVIII Ioannes Duodevicesimus Giovanni Fasano; Phasianus Rome 31 July 1009 to 12 May 1012 Sergius IV Sergius Quartus Pietro Boccapecora Rome 18 May 1012 to 9 April 1024 Benedict VIII Benedictus Octavus Theophylactus II, Conti di Tusculum Rome April/May 1024 to 20 October 1032 John XIX Ioannes Undevicesimus Romanus, Conti di Tusculum Rome 1032 to 1044 Benedict IX Benedictus Nonus Theophylactus III, Conti di Tusculum Rome 1045 Sylvester III Silvester Tertius John, Bishop of Sabina Rome 1045 to 1046 Benedict IX Benedictus Nonus Theophylactus III, Conti di Tusculum Rome April/May 1045 to 20 December 1046 Gregory VI Gregorius Sextus Johannes Gratianus 24 December 1046 to 9 October 1047 Clement II Clemens Secundus Suidger Saxony November 1047 to 1048 Benedict IX Benedictus Nonus Theophylactus III, Conti di Tusculum 17 July 1048 to 9 August 1048 Damasus II Damasus Secundus Poppo Tirol 12 February 1049 to 19 April 1054 Leo IX Saint Leo Leo Nonus Bruno, Count of Dagsbourg Alsace 13 April 1055 to 28 July 1057 Victor II Victor Secundus Gebhard, Count of Calw, Tollenstein, and Hirschberg Germany 2 August 1057 to 29 March 1058 Stephen IX, O.S.B. Stephanus Nonus Frederic de Lorraine; Frederick of Lorraine 6 December 1058 to 27 July 1061 Nicholas II Nicolaus Secundus Gérard de Bourgogne; Gerard of Burgundy 30 September 1061 to 21 April 1073 Alexander II Alexander Secundus Anselmo da Baggio Baggio, Milan, Italy 22 April 1073 to 25 May 1085 Gregory VII, O.S.B. Saint Gregory Gregorius Septimus Hildebrand Soana, Tuscany, Italy 24 May 1086 to 16 September 1087 Victor III, O.S.B. Blessed Victor Victor Tertius Desiderio; Desiderius; Dauferius Southern Italy 12 March 1088 to 29 July 1099 Urban II, O.S.B. Blessed Urban Urbanus Secundus Odo of Lagery France 13 August 1099 to 21 January 1118 Paschal II, O.Cist. Paschalis Secundus Raniero Romagna, Italy 24 January 1118 to 28 January 1119 Gelasius II, O.S.B. Gelasius Secundus Giovanni Coniulo Gaeta, Latium, Italy 2 February 1119 to 13 December 1124 Callixtus II Callistus Secundus Guido, Comte de Bourgogne France 15 December 1124 to 13 February 1130 Honorius II Honorius Secundus Lamberto Scannabecchi Imola, Romagna, Italy 14 February 1130 to 24 September 1143 Innocent II Innocentius Secundus Gregorio Papareschi Rome, Italy 26 September 1143 to 8 March 1144 Celestine II Coelestinus Secundus Guido Città di Castello, Umbria, Italy 12 March 1144 to 15 March 1145 Lucius II Lucius Secundus Gerardo Caccianemici dal Orso Bologna, Italy 15 February 1145 to 8 July 1153 Eugene III, O.Cist. Blessed Eugene Eugenius Tertius Bernardo Pignatelli Pisa, Tuscany, Italy 8 July 1153 to 3 December 1154 Anastasius IV Anastasius Quartus Corrado Rome 4 December 1154 to 1 September 1159 Adrian IV, O.S.A. Hadrianus Quartus Nicholas Breakspear England 7 September 1159 to 30 August 1181 Alexander III Alexander Tertius Rolando Bandinelli Siena, Tuscany, Italy 1 September 1181 to 25 November 1185 Lucius III Lucius Tertius Ubaldo Allucingoli Lucca, Tuscany, Italy 25 November 1185 to 19 October 1187 Urban III Urbanus Tertius Uberto Crivelli Milan, Italy 21 October 1187 to 17 December 1187 Gregory VIII Gregorius Octavus Alberto di Morra Benevento, Campania, Italy 19 December 1187 to 27 March 1191 Clement III Clemens Tertius Paulino Scolari Rome 30 March 1191 to 8 January 1198 Celestine III Coelestinus Tertius Giacinto Bobone Rome 8 January 1198 to 16 July 1216 Innocent III Innocentius Tertius Lothario dei Conti di Segni Gavignano, Latium, Italy 18 July 1216 to 18 March 1227 Honorius III Honorius Tertius Cencio Savelli Rome 19 March 1227 to 22 August 1241 Gregory IX Gregorius Nonus Ugolino dei Conti di Segni Anagni, Latium, Italy 25 October 1241 to 10 November 1241 Celestine IV, O.S.B. Coelestinus Quartus Goffredo Castiglioni Milan, Italy 25 June 1243 to 7 December 1254 Innocent IV Innocentius Quartus Sinibaldo Fieschi Genoa, Italy === From 1254 to 1492 === Dates of reign English name Official Latin name Personal name Place of birth 12 December 1254 to 25 May 1261 Alexander IV Alexander Quartus Rinaldo dei Conti di Segni; Rinaldo Conti Anagni, Italy 29 August 1261 to 2 October 1264 Urban IV Urbanus Quartus Jacques Pantaléon Troyes, France 5 February 1265 to 29 November 1268 Clement IV Clemens Quartus Gui Faucoi le Gros (angl: Guy Foulques the Fat) Saint-Gilles, France 29 November 1268 to 1 September 1271 Sede vacante (interregnum) 1 September 1271 to 10 January 1276 Gregory X, O.Cist. Blessed Gregory Gregorius Decimus Tebaldo Visconti Piacenza, Italy 21 January 1276 to 22 June 1276 Innocent V, O.P. Blessed Innocent Innocentius Quintus Pierre de Tarentaise Savoy, France 11 July 1276 to 18 August 1276 Adrian V Hadrianus Quintus Ottobuono Fieschi Genoa, Italy 8 September 1276 to 20 May 1277 John XXI Ioannes Vicesimus Primus Pedro Hispano Lisbon, Portugal 25 November 1277 to 22 August 1280 Nicholas III, O.S.B. Nicolaus Tertius Giovanni Gaetano Orsini Rome, Italy 22 February 1281 to 28 March 1285 Martin IV Martinus Quartus Simon de Brion; Simon de Brie Touraine, France 2 April 1285 to 3 April 1287 Honorius IV Honorius Quartus Giacomo Savelli Rome, Italy 22 February 1288 to 4 April 1292 Nicholas IV, O.F.M. Nicolaus Quartus Girolamo Masci Ascoli, Italy 4 April 1292 to 5 July 1294 Sede vacante (interregnum) 5 July 1294 to 13 December 1294 Celestine V, O.S.B. Saint Celestine Coelestinus Quintus Pietro da Morrone Moline, Italy 24 December 1294 to 11 October 1303 Boniface VIII Bonifacius Octavus Benedetto Caetani Anagni, Italy 22 October 1303 to 7 July 1304 Benedict XI, O.P. Blessed Bendedict Benedictus Undecimus Niccolò Boccasini Treviso, Italy 5 June 1305 to 20 April 1314 Clement V Clemens Quintus Bertrand de Got Bordeaux, France 20 April 1314 to 7 August 1316 Sede vacante (interregnum) 7 August 1316 to 4 December 1334 John XXII Ioannes Vicesimus Secundus Jacques d'Euse; Jacques Duèse Cahors, France 20 December 1334 to 25 April 1342 Benedict XII, O.Cist. Benedictus Duodecimus Jacques Fournier Saverdun, France 7 May 1342 to 6 December 1352 Clement VI Clemens Sextus Pierre Roger Limoges, France 18 December 1352 to 12 September 1362 Innocent VI Innocentius Sextus Étienne Aubert; Stephen Aubert Beyssac, France 28 September 1362 to 19 December 1370 Urban V, O.S.B. Blessed Urban Urbanus Quintus Guillaume Grimoard; Guillaume de Grimoard Languedoc, France 30 December 1370 to 26 March 1378 Gregory XI Gregorius Undecimus Pierre Roger de Beaufort Limoges, France 8 April 1378 to 15 October 1389 Urban VI Urbanus Sextus Bartolomeo Prignano Naples, Italy 2 November 1389 to 1 October 1404 Boniface IX Bonifacius Nonus Pietro Tomacelli Naples, Italy 17 October 1404 to 6 November 1406 Innocent VII Innocentius Septimus Cosimo Gentile Migliorati Abruzzi, Italy 30 November 1406 to 4 July 1415 Gregory XII Gregorius Duodecimus Angelo Correr Venice, Italy 4 July 1415 to 11 November 1417 Sede vacante (interregnum) 11 November 1417 to 20 February 1431 Martin V Martinus Quintus Oddone Colonna Rome, Italy 3 March 1431 to 23 February 1447 Eugene IV, O.S.A. Eugenius Quartus Gabriele Condulmer Venice, Italy 6 March 1447 to 24 March 1455 Nicholas V, O.P. Nicolaus Quintus Tommaso Parentucelli Sarzana, Liguria, Italy 8 April 1455 to 6 August 1458 Callixtus III Callistus Tertius Alfonso de Borgia Xàtiva, València, Spain 19 August 1458 to 15 August 1464 Pius II Pius Secundus Enea Silvio Piccolomini Siena, Italy 30 August 1464 to 26 July 1471 Paul II Paulus Secundus Pietro Barbo Venice, Italy 9 August 1471 to 12 August 1484 Sixtus IV, O.F.M. Xystus Quartus Francesco della Rovere Savona, Italy 29 August 1484 to 25 July 1492 Innocent VIII Innocentius Octavus Giovanni Battista Cybo Genoa, Italy 11 August 1492 to 18 August 1503 Alexander VI Alexander Sextus Rodrigo de Lanzòl-Borgia Xàtiva, València, Spain === From 1503 to 1740 === Dates of reign Portrait English name Official Latin name Personal name Place of birth 22 September 1503 to 18 October 1503 Pius III Pius Tertius Francesco Todeschini Piccolomini Siena, Tuscany, Italy 31 October 1503 to 21 February 1513 Julius II, O.F.M. Iulius Secundus Giuliano della Rovere Albisola, Savona, Italy 9 March 1513 to 1 December 1521 Leo X Leo Decimus Giovanni di Lorenzo de' Medici Florence, Italy 9 January 1522 to 14 September 1523 Adrian VI Hadrianus Sextus Adriaan Floriszoon Boeyens Utrecht, Holy Roman Empire (presently The Netherlands) 26 November 1523 to 25 September 1534 Clement VII Clemens Septimus Giulio di Giuliano de' Medici Florence, Italy 13 October 1534 to 10 November 1549 Paul III Paulus Tertius Alessandro Farnese Canino, Viterbo, Italy 29 November 1549 to 29 March 1555 Julius III Iulius Tertius Giovanni Maria Ciocchi del Monte Rome, Italy 9 April 1555 to April 30 or 1 May 1555 Marcellus II Marcellus Secundus Marcello Cervini Montefano, Macerata, Italy 23 May 1555 to 18 August 1559 Paul IV Paulus Quartus Giovanni Pietro Carafa Capriglia, Campania, Italy 26 December 1559 to 9 December 1565 Pius IV Pius Quartus Giovanni Angelo Medici Milan, Italy 7 January 1566 to 1 May 1572 Pius V, O.P. Saint Pius Pius Quintus Michele Ghislieri Bosco, Alessandria, Italy 13 May 1572 to 10 April 1585 Gregory XIII Gregorius Tertius Decimus Ugo Boncompagni Bologna, Italy 24 April 1585 to 27 August 1590 Sixtus V, O.F.M. Conv. Xystus Quintus Felice Peretti Grottammare, Marche, Italy 15 September 1590 to 27 September 1590 Urban VII Urbanus Septimus Giovanni Battista Castagna Rome, Italy 5 December 1590 to 15 /16 October 1591 Gregory XIV Gregorius Quartus Decimus Niccolò Sfondrati Cremona, Lombardy, Italy 29 October 1591 to 30 December 1591 Innocent IX Innocentius Nonus Giovanni Antonio Facchinetti Bologna, Italy 30 January 1592 to 3 March 1605 Clement VIII Clemens Octavus Ippolito Aldobrandini Fano, Marche, Italy 1 April 1605 to 27 April 1605 Leo XI Leo Undecimus Alessandro Ottaviano de' Medici Florence, Italy 16 May 1605 to 28 January 1621 Paul V Paulus Quintus Camillo Borghese Rome, Italy 9 February 1621 to 8 July 1623 Gregory XV Gregorius Quintus Decimus Alessandro Ludovisi Bologna, Italy 6 August 1623 to 29 July 1644 Urban VIII Urbanus Octavus Maffeo Barberini Florence, Italy 15 September 1644 to 7 January 1655 Innocent X Innocentius Decimus Giovanni Battista Pamphilj Rome, Italy 7 April 1655 to 22 May 1667 Alexander VII Alexander Septimus Fabio Chigi Siena, Tuscany, Italy 20 June 1667 to 9 December 1669 Clement IX Clemens Nonus Giulio Rospigliosi Pistoia, Tuscany, Italy 29 April 1670 to 22 July 1676 Clement X Clemens Decimus Emilio Altieri Rome, Italy 21 September 1676 to 11/12 August 1689 Innocent XI Blessed Innocent Innocentius Undecimus Benedetto Odescalchi Como, Lombardy, Italy 6 October 1689 to 1 February 1691 Alexander VIII Alexander Octavus Pietro Vito Ottoboni Padova, Veneto, Italy 12 July 1691 to 27 September 1700 Innocent XII Innocentius Duodecimus Antonio Pignatelli Spinazzola, Puglia, Italy 23 November 1700 to 19 March 1721 Clement XI Clemens Undecimus Giovanni Francesco Albani Urbino, Marche, Italy 8 May 1721 to 7 March 1724 Innocent XIII Innocentius Tertius Decimus Michelangelo de ’Conti; Michael Angelo Conti Poli, Lazio, Italy 29 May 1724 to 21 February 1730 Benedict XIII, O.P. Benedictus Tertius Decimus Pierfrancesco Orsini Gravina, Puglia, Italy 12 July 1730 to 6 February 1740 Clement XII Clemens Duodecimus Lorenzo Corsini Florence, Italy 17 August 1740 to 3 May 1758 Benedict XIV Benedictus Quartus Decimus Prospero Lorenzo Lambertini Bologna, Italy === From 1758 to 2005 === Dates of reign Portrait English name Official Latin name Personal name Place of birth 6 July 1758 to 2 February 1769 Clement XIII Clemens Tertius Decimus Carlo della Torre Rezzonico Venice, Veneto, Italy 19 May 1769 to 22 September 1774 Clement XIV, O.F.M. Conv. Clemens Quartus Decimus Giovanni Vincenzo Antonio Ganganelli Sant'Arcangelo di Romagna, Italy 15 February 1775 to 29 August 1799 Pius VI Pius Sextus Giovanni Angelo Braschi Cesena, Italy 14 March 1800 to 20 August 1823 Pius VII, O.S.B. Pius Septimus Barnaba Chiaramonti Cesena, Italy 28 September 1823 to 10 February 1829 Leo XII Leo Duodecimus Annibale Sermattei della Genga Fabriano, Marche, Italy 31 March 1829 to 1 December 1830 Pius VIII Pius Octavus Francesco Saverio Castiglioni Cingoli, Marche, Italy 2 February 1831 to 1 June 1846 Gregory XVI, O.S.B. Cam. Gregorius Sextus Decimus Bartolomeo Alberto Cappellari Belluno, Veneto, Italy 16 June 1846 to 7 February 1878 Pius IX Blessed Pius IX Pius Nonus Giovanni Maria Mastai-Ferretti Senigallia, Marche, Italy 20 February 1878 to 20 July 1903 Leo XIII Leo Tertius Decimus Gioacchino Vincenzo Raffaele Luigi Pecci Carpineto Romano, Latium, Italy 4 August 1903 to 20 August 1914 St. Pius X Saint Pius X Pius Decimus Giuseppe Melchiorre Sarto Riese, Treviso, Veneto, Italy 3 September 1914 to 22 January 1922 Benedict XV Benedictus Quintus Decimus Giacomo Della Chiesa Genoa, Italy 6 February 1922 to 10 February 1939 Pius XI Pius Undecimus Achille Ambrogio Damiano Ratti Desio, Milan, Italy 2 March 1939 to 9 October 1958 Pius XII Venerable Pius XII Pius Duodecimus Eugenio Maria Giuseppe Giovanni Pacelli Rome, Italy 28 October 1958 to 3 June 1963 St. John XXIII Saint John XXIII Ioannes Vicesimus Tertius Angelo Giuseppe Roncalli Sotto il Monte, Bergamo, Italy 21 June 1963 to 6 August 1978 St. Paul VI Saint Paul VI Paulus Sextus Giovanni Battista Enrico Antonio Maria Montini Concesio, Brescia, Italy 26 August 1978 to 28 September 1978 John Paul I Blessed John Paul I Ioannes Paulus Primus Albino Luciani Forno di Canale (now Canale d'Agordo), Veneto, Italy 16 October 1978 to 2 April 2005 St. John Paul II Saint John Paul II Ioannes Paulus Secundus Karol Józef Wojtyła Wadowice, Poland === From 2005 === Dates of reign Portrait English name Official Latin name Personal name Place of birth 19 April 2005 to 28 February 2013 Benedict XVI Benedictus Sextus Decimus Joseph Alois Ratzinger Marktl am Inn, Bavaria, Germany 13 March 2013 to 21 April 2025 Francis Franciscus Jorge Mario Bergoglio Buenos Aires, Argentina 8 May 2025 to present Leo XIV Leo Quartus Decimus Robert Francis Prevost Chicago, Illinois, USA ==Related pages== * Papal name == References == ==Further reading== * John N.D. Kelly, The Oxford Dictionary of Popes, Oxford University Press, 1986. * AA.VV., Enciclopedia dei Papi, Istituto dell'Enciclopedia italiana, 2000. * Pontificia Amministrazione della Patriarcale Basilica di San Paolo, I Papi. Venti secoli di storia, Libreria Editrice Vaticana, 2002. == Other websites == * Catholic Encyclopedia * Giga-Catholic Information * Popes & Anti-Popes Category:Lists of heads of state",
 "title": "List of popes"
}