{
 "id": "66263",
 "text": "A suit is a set of clothing intended to be worn together. It may be a semi- formal 'lounge suit' or 'business suit'. It always includes a jacket and trousers (pants). In classical gentlemen's tailoring, a waistcoat (U.S: vest) is usually worn with single-breasted suits. In formal or semi-formal wear, the suit is worn with various other items. Quality socks, leather lace-up shoes, and a tie are essential: if a tie is not worn, that is casual wear. This outfit is worn in many countries by men in professional jobs such as business, law, and politics. It is also sometimes worn by women and in such cases a dress skirt or tailored trousers are worn. A suit can be part of a dress code, a set of rules that say what people should wear at an event. Ideally, a suit is tailored to the individual wearer. 'Off-the-peg' suits are much cheaper, but they may need adjusting by a tailor. Special suits for special dangers include space suits and diving suits. == Parts of a suit == #A coat or jacket ('coat' is the traditional name in tailoring). This is usually made of worsted wool, but silk, cotton, linen or polyester are also possible. Suit jackets have a collar, pockets, and a silk or polyester lining. Suit jackets come in many colours, but the most common are dark blue, brown and grey. Suit jackets come in different styles including double-breasted (buttons on both sides of the front), single-breasted (buttons down one side of the front only), two- button, three-button or more. #Trousers (U.S: dress pants) should match the coat. It is essential that the jacket and trousers should be made of the same cloth by the same tailors. If not, the outfit is casual. Trousers are worn ironed, with a crease. #Waistcoat (vest), either in the same cloth, or a fancy design in silk. == Accessories == #The shirt is made of silk, cotton or linen. It may have a stiff collar, and is ironed. Shirts worn with suits need not be white, but should be of conservative style. #A tie is usually worn. It made be of silk or polyester, and it usually has a colour or pattern on it. Occasionally, a suit is worn with a bow tie or no tie at all. #Sometimes, if a waistcoat is not worn, a lightweight sleeveless v-neck wool garment may be worn. #Socks are often made of silk, cotton or a mix of cotton and polyester. Dress socks are usually in a dark colour such as black, dark blue or grey. In some countries, such as Germany, many men wear tights under their suits. #Shoes are usually made of leather, and usually dark-coloured leather (black or brown) which is waxed and polished. == Social aspects == Generally, colder climates are more formal. Suits are standard dress in most countries' international business and politics. In others, celebrity and political leaders aim to make a fashion statement. Suits are not necessarily expensive, because while some may need to be tailored, this is a relatively cheap op, around $20 USD. Casual people suit up less today than in the last century, and presuming a tailor is a specialist, and cannot do it in the 5 minutes it takes you to stand in the mirror, is one common fallacy. Sportscoats are semi-formal clothing, usual for wearing to some offices, but less mainstream for watching a football match. A trend towards semi-casual style (just dresspants) started in the 1960s and 1970s, and has changed the way many people dress. All the same, many high-status men and women do still wear suits. == Origin == The evolution of the suit began with changes made to formal English male dress by Beau Brummell in the early 1800s. More changes were made later in the 19th century by tailors in London and elsewhere. By the end of that century photographs show men wearing suits that are almost the same as those worn today. == Gallery == File:Betsy Vogel 2009.jpg|A type of women's suit File:Grey and navy suit on mannequin.jpg|A male pinstriped suit File:Rt Hon Anthony Eden MP.jpg|Anthony Eden File:Gül et Rice.jpg|Former US Secretary of State Condoleezza Rice and Turkish President Abdullah Gül wearing Western- style business suits. File:Oba Lagos060602-N-8637R-006.jpg| The Oba is a spiritual leader in Nigerian culture with the respect (status) of royalty. This was a ceremony celebrating the 50th anniversary of the Nigerian Navy. Category:Clothing",
 "title": "Suit (clothing)"
}