{
 "id": "662926",
 "text": "Vladislav Igorevich Roslyakov (, 2 May 2000 - 17 October 2018) was a Russian college student and mass murderer responsible for the Kerch Polytechnic College massacre on October 17, 2018, Roslyakov killed 20 people and wounded 67 others before subsequently committing suicide. It was the deadliest school shooting in the former Soviet Union since the 2004 Beslan school siege. He was 18 years old at the time of the massacre. ==Early Life and Background== Vladislav Igorevich Roslyakov was born on 2 May, 2000. He grew up in the rural exurb of Kerch known as Arshintsevo. His family called him Vladik. Roslyakov was raised in the home of his paternal grandparents by his father, Igor. His mother worked as an orderly at the hospital in Kerch and was paid low. Igor was a former soldier who had served in Afghanistan for several years. The experience there left him brain damaged so he began collecting disability payments, and also struggled with alcoholism. Igor went as far as to threaten their neighbours with a sword. When Roslyakov was around ten years old, his parents broke up, due to his father becoming abusive towards Roslyakov, his mother and other relatives. Roslyakov studied at a local school with no interest and poor grades. He had few friends and his hobbies included weapons and video games. In 2015 he joined the college to study to become an electrician. In college he developed an interest in explosives and weapons and started to take a knife bayonet to class. One day he discharged pepper spray in a class and failed to explain his actions. His mother, a Jehovah's Witness, limited his social activity, searched his pockets and refused to allow him to go to the cinema or use a computer, only allowing the latter when he turned 16. In the days leading up to the attack, Roslyakov stated that he did not believe in the afterlife. On the eve of the attack, according to neighbours, Roslyakov burned a Bible in which he had highlighted verses, along with his mobile phone, and other books. A friend has claimed that Roslyakov \"hated the polytechnic very much\" and had vowed revenge on his teachers. There were also reports that he may have been bullied. In the days before the attack he discussed ignorance by others, the lack of purpose in his life, mass shootings and suicide on social media. Roslyakov was in a number of online communities dedicated to serial killers. Allegedly Roslyakov stole money from his grandmother to help pay for his ammunition for the attack. ==Massacre== Roslyakov purchased a shotgun on 8September 2018 and bought 150rounds legally at a gun shop on 13October 2018. He entered the grounds of Kerch Polytechnic College on 17October 2018 at about 10:02 a.m. A survivor of the incident said that the shooting lasted for more than 15minutes. Multiple witnesses recounted an individual gunman strolling through the corridors of Kerch Polytechnic College, discharging shots indiscriminately at classmates and teachers. He also fired at computer monitors, locked doors, and fire extinguishers. A large nail-bomb was detonated during the attack, and local police said that they deactivated more explosives on the campus. However, there was initially variation in survivors' accounts of the incident, with some claiming that a large bomb exploded and others describing only gunfire and the use of grenades. The town website claimed that the explosion occurred on the first floor although the shooting occurred on the second. CNN reported that state television channel Russia-24 said that 200military personnel had been sent to the location. Eyewitness accounts differ about the time it took for law enforcement to respond, as times differ between 10 and 15minutes even though a police station is across the street, within of the college. The massacre ended when the gunman committed suicide in the college's library.Graphic video footage of the attack was captured by school surveillance cameras and later posted on both the news programme Vesti.Krym's YouTube channel and on its website. This footage was removed from both sites shortly afterwards. Fatalities Ksenia Boldina (17) Vladislav Verdibozhenko (15) Victoria Demchuk (16) Ruden Juraev (16) Anna Zhuravleva (19) Alina Kerova (16) Alexey Lavrinovich (19) Egor Perepelkin (17) Vladislav Lazarev (19) Ruslan Lysenko (17) Roman Karymov (21) Danil Pipenko (16) Sergey Stepanenko (15) Nikita Florensky (16) Daria Chegerest (16) Anastasia Baklanova (26) Svetlana Baklanova (57) Larisa Kudryavtseva (62) Olexander Moiseenko (46) Lyudmila Ustenko (65) Vladislav Roslyakov (18) (perpetrator) Surveillance footage of the incident shows Roslyakov wearing black trousers and a white T-shirt emblazoned with the Russian word \"НЕНАВИСТЬ\" (\"HATRED\") as he carries an eight-shot 12 gauge Hatsan Escort Aimguard pump-action shotgun with a pistol grip. His clothing resembled that of Eric Harris, one of the perpetrators of the 1999 Columbine High School massacre, leading to speculation that the massacre was a copycat crime. According to some Russian tabloids, he had been a member of various Eric Harris and Dylan Klebold fanclubs on social networks, and had informed friends of his belief that \"it would be good to have a massacre\", specifically referencing Columbine High School massacre as an example. Furthermore, he had mentioned his belief in the two perpetrators being \"awesome\" Like perpetrator Eric Harris. ===Suicide=== Around noon, Roslyakov entered the library for the last time. He turned tables and fired randomly while inside the library, Roslyakov committed suicide in the library of the college, by shooting himself with his shotgun Roslyakov fell in a similiar fetal position to Eric Harris. Later Roslyakov was moved and searched by the police. One of the policemen recorded a video of Roslyakov's corpse in the library. Afterwards, he was brought in for forensic exhamination and autopsy. Three different exhaminations were done on the killer's body, ==Motive== Roslyakov's motive is unknown. Though, it was apparent that he had suicidal and homicidal thoughts - he admitted that he saw no perspectives in life and he wanted to shoot the college students, because to him, they were nothing but \"hobos, whores and future suicides\". Roslyakov expressed his distaste towards people participating in the \"rat race\" culture - he saw no sense in working extremely hard for insignificant pleasures in life. Roslyakov also felt like his family had overwhelming expectations, that they wanted to take control over his life and make it whatever they wanted it to be. Roslyakov's attack could also be a Copycat Crime, as he was inspired by the 1999 Columbine massacre, detonated an improvised explosive device in the college cafeteria, then embarked on a shooting rampage. On the day of the attack, he wore black jeans and a white t-shirt with a slogan, copying Eric Harris, one of the Columbine killers. The attacker ultimately committed suicide at the college library, just as his predecessors did 25 years before. A total of 21 people died, including 16 students and five teachers, and 67 people were injured. ==Reaction of Galina Roslyakova== Roslyakov's mother Galina Roslyakova, was a nurse in Kerch Cancer Clinic where some victims of her son's violence were brought, was said to have been among those who provided first aid to victims. She is understood to have tried to jump out of a window, but officers stopped her. On October 18, during the search of their home she had a heart attack and ambulance took her out. After that she spent in psychiatric clinic for a few weeks under guard of Rosgvardia (police security forces). Roslyakov's father was in a clinic, his psychological state worsened after the massacre. ==Legacy== Roslyakov was cremated and buried under a false name, on November 28. Roslyakov's Massacre would inspire numourous copycats For example, on 28 May 2019, a student in Volsk, Saratov Region, Russia committed an attack with an axe and Molotov Cocktails, which left a girl seriously wounded. The attacker, 15-year-old Daniil Pulkin, was obsessed with Roslyakov. Daniil showed up to the school wearing a black t-shirt with the word \"разочарование\" \"disappointment\" in red with the same font as Roslyakov's \"Hatred\" t-shirt. In August 2020, the minor was sentenced to seven years in prison in a juvenile hall. ===Reactions and Impact=== Crimean Prime Minister Sergey Aksyonov announced that there would be four days of mourning. Crimean State Council speaker Vladimir Konstantinov said that it was impossible to conceive that Roslyakov had prepared the attack by himself saying \"On the ground, he acted alone, that is already known and established, but in my opinion and in the opinion of my colleagues this reprobate could not have carried out the preparations.\" Sergei Mikhailovich Smirnov, deputy head of Russia's Federal Security Service (FSB), said the security services needed to have greater control over the Internet. Russian President Vladimir Putin said at the Valdai Discussion Club in Sochi that the attack appeared to be the result of globalisation, social media and the internet, and that \"everything started with the tragic events in schools in the US...we're not creating healthy (Internet) content for young people...which leads to tragedies of this kind.\" Some saw the remarks to be a part of Russians blaming the West for the attack and a linkage with his past as head of the Kremlin and FSB before becoming president which The Irish Times said are \"suspicious of the internet and social media, seeing them as western-dominated technologies that can be used to stir up dissent and street protests.\" Russian political analyst Sergey Mikheyev on Russian state TV blamed the attack on \"Western subculture\", claiming that it \"builds its matrix on the cult of violence...the one who has a weapon in his hands is right. This is a purely American approach to the matter.\" Some media saw the remarks to be a part of Russians blaming the West for the attack. Leaders of several countries expressed their condolences to the victims of the attack, including Armenia, Estonia, Finland, Germany, Italy, Thailand, the UK, and Venezuela. Ukrainian President Petro Poroshenko expressed condolences to the victims, whom he described as Ukrainian citizens, stating that the Prosecutor General's Office of the Autonomous Republic of Crimea had initiated criminal proceedings under the article \"Act of terrorism\". The Secretary General of the Council of Europe Thorbjørn Jagland and Secretary-General of the United Nations António Guterres also expressed condolences. Some newspapers described the attack as \"Russia's Columbine\", a reference to the 1999 US high school massacre. Steven Rosenberg said the attack should not be surprising as he noted there had already been five attacks in schools in Russia in 2018 where a number of children were injured. A Telegraph article also claimed there had been half a dozen school attacks in Russia in 2018, although claiming the previous incidents involved knives and traumatic pistols rather than high-powered firearms. ==Notes== ==References== Category:2000 births Category:2018 deaths Category:Murderers who committed suicide Category:People from Crimea",
 "title": "Vladislav Roslyakov"
}