{
 "id": "662979",
 "text": "Singam 3 is a 2017 Indian Tamil-language action masala movie written and directed by Hari. A sequel to Singam II (2013) and the third movie in the Singam franchise, it stars Suriya, Anushka Shetty and Shruti Haasan in the lead roles. It is the fifth collaboration of Suriya and Hari. Principal photography commenced in January 2016 in Visakhapatnam, Andhra Pradesh. The movie was released worldwide on 9 February 2017 along with the Telugu dubbed version, Yamudu 3. ==Cast== * Suriya as DCP S. Durai Singam\"Singam\" * Anushka Shetty as Kavya * Raadhika as Ramakrishna's wife * Shruti Haasan as Vidhya * Krish as V. Sreenivas * Thakur Anoop Singh as Vittal Prasad \"Vittal\" * Nithin Sathya as Murali * Soori as Veera Babu \"Veeram\" * Robo Shankar as Subba Rao \"Subbu\" * Sarath Babu as K.C.D.P. Sathyanarayana Reddygaru, Home Minister of Andhra Pradesh * Vijayakumar as Ramanathan, Home Minister of Tamil Nadu * Sharat Saxena as Madhu Sudhana Reddy \"M. S. Reddy\" * Nassar as Mahalingam * Radha Ravi as Soundara Pandi, Durai Singam's father * Janaki Sabesh as Bharathi, Mahalingam's wife * Sumithra as Kalyani, Durai Singam's mother * Yuvarani as Dhanalakshmi, Durai Singam's sister * Manorama as Kavya's grandmother * Delhi Kumar as Kavya's grandfather * Imman Annachi as Pushparaj * Thyagu as Habour Shanmugam * Prem as Customs officer Ananda Rao * Sarayu as Custom's officer Ananda Rao's wife * Chaams as G. Sathyan * Joe Malloori as School teacher * Jayaprakash as Commissioner Ramakrishna * Suman as Ram Prasad * Mohan Raman as Judge * Crane Manohar as Palani * Sandra Amy as Aarthi * Nalini as Thandubazaar Thangam * Jeeva Ravi as Mallaya * Neetu Chandra special appearance in the song \"Sone Sone\" ==Box office== Si3 film collected in domestic box office on its opening day and in 5 days of release. The film collected worldwide in 6 days. Singam 3 final box-office was approximately 136 crores. And the film completed 100 days run and was declared super hit. ==References== == Other websites== * Category:2017 movies Category:Tamil- language movies Category:2010s Indian movies",
 "title": "Si3 (movie)"
}