{
 "id": "6630",
 "text": "Viktor Fedorovych Yanukovych (; born July 9, 1950, Yenakiieve, Stalin Region, Ukrainian SSR) is a Ukrainian politician who was the 4th President of UkraineUkrainian parliament creates new coalition, Kyiv Post (March 2010) from 2010 to 2014; found guilty of treason. On January 12, 2015, he was declared wanted by Interpol. ==Political career== He was Prime Minister of Ukraine from November 2002 until December 2004 (he was forced to resign (leave office early) on 31 December 2004). He again was Prime Minister of Ukraine from 4 August 2006 until 18 December 2007. He is the former leader of the Party of Regions the biggest political party of Ukraine. The party was formerly part of the Ukrainian government. In November 2004, he won the presidential election. Viktor Yushchenko, his opponent, said the result was false. Large daily demonstrations supporting Viktor Yushchenko followed. They were named The Orange Revolution. Ukrainian Judges decided that there would be new elections in December 2004. Victor Yuschenko won those elections and became president of Ukraine. Yanukovych was supported by Vladimir Putin of Russia and by the former Ukrainian president Leonid Kuchma. In February 2010, he won the presidential election; Yulia Tymoshenko, who lost the election with a 3.48% difference, said he won because of fraud.Profile: Viktor Yanukovych, BBC News Yanukovych was a victim of poverty in his childhood and was twice put in prison for violent crimes in his youth. After mass protest in Ukraine during February 2014, Yanukovych was forced-out of office on 22 February 2014.Ukraine as it happened: Yanukovych ousted, Tymoshenko freed | euronews Oleksandr Turchynov became acting president. == Convictions == On December 15, 1967, at the age of 17, Viktor Yanukovych was first sentenced to 3 years in prison for participating in a robbery. For the second time, Viktor Yanukovych was prosecuted for inflicting moderate bodily injuries under Art. 102 of the Criminal Code of the Ukrainian SSR and sentenced on June 8, 1970 to 2 years of imprisonment. == Criticism == In connection with the events of Euromaidan, the phrase \"Golden Toilet\" became a symbol and synonym of the Yanukovych regime. In many informal speeches, the phrase is used as a euphemism for the rule of Viktor Fedorovich and his political entourage. === Oppression of freedom of speech in Ukraine === During the two months of Yanukovych's presidency and the existence of the pro-presidential majority and the government in Ukraine, the pressure on the media and the curtailment of freedom of speech intensified. In particular, independent experts noted the politicization of the First National TV Channel. The facts of censorship on commercial TV channels have become more frequent: journalists of \"1 + 1\" and \"STB\" have stated the facts of censorship by their management, and journalists of STB state the existence of facts of censorship since 2008. === The enemy of the press === Viktor Yanukovych, along with Prime Minister Mykola Azarov and Interior Minister Vitaliy Zakharchenko, became the biggest enemies of the Ukrainian press in 2012-2013, according to an annual survey by the Institute of Mass Media and the Independent Media Trade Union. == Investigation == As of May 15, 2014, 6 criminal cases of abuse of power were being investigated against Yanukovych. The cases are included in the Unified Register of Pre-trial Investigations. ==Notes== == References == == Other websites == * CLAN of Yanukovich: YANUKOVICH Category:1950 births Category:Living people Category:Ukrainian criminals Category:Ukrainian engineers Category:Presidents of Ukraine Category:Prime ministers of Ukraine",
 "title": "Viktor Yanukovych"
}