{
 "id": "663136",
 "text": "George Burba is a Science & Strategy Fellow at LI-COR Biosciences, a Global Fellow at Robert B. Daugherty Water for Food Global Institute, and Graduate Adjunct Professor at University of Nebraska-Lincoln. He is a bio-atmospheric scientist, and a leading figure in micrometeorology, ecosystem gas and energy exchange, and the measurements of turbulent transport of greenhouse and other gases, water vapor and energy within atmospheric boundary layer, canopy and soil layers, and an author of the multiple books and other publications on the subject. Burba is an expert on the in-situ measurement methods: an author of instrument surface heating concept, related equations known as “Burba corrections”, https://scholar.google.com/scholar?hl=en&as;_sdt=0%2C28&q;=%22Burba+correction%22&btnG;= https://scholar.google.com/scholar?hl=en&as;_sdt=0%2C28&q;=burba+%22heating+correction%22&btnG;= and an inventor of the two types of gas analyzers known as “enclosed-path” and “semi-open-path”, and an inventor of methods for computing gas fluxes from the open-path high-speed laser-based analyzers and from the multiple types of low-speed gas analyzers. He is an elected Senior Member of the National Academy of Inventors. ==Education== Burba was educated at Lomonosov Moscow State University and University of Nebraska where he received a PhD in 2005 in Bio-Atmospheric Sciences for the study of water, light and energy transport in the ecosystems, supervised by Shashi Verma. ==Career and research== After his PhD, Burba worked as a graduate faculty at the University of Nebraska and as a scientist at the LI-COR Biosciences. In 2016, he was appointed Global Fellow at Robert B. Daugherty Water for Food Global Institute, and in 2017, he was appointed to the position of [ Science Fellow] at LI-COR Biosciences. == Personal life == George Burba is a son of George A. Burba and a grandson of Aleksandr A. Burba. ==References== Category:Living people Category:Year of birth missing (living people) Category:American meteorologists Category:Moscow State University alumni",
 "title": "George Burba"
}