{
 "id": "66329",
 "text": "== Events == * March – The peace treaty between England and France is extended until April of 1377. * April 28 – The start of Good Parliament in England, so called because its members attempted to reform the corrupt Royal Council. * June 7 – The dying Prince Edward summons his father Edward III and brother John of Gaunt and makes them swear to uphold the claim to the throne of his son Richard. * June 8 – Edward, the Black Prince dies, becoming the first English Prince of Wales to not rule as king. * July 10 – The Good Parliament is dissolved. At that time, it was the longest Parliament to have sat in England. * August 12 – With the help of the Genoese, Byzantine co-emperor Andronicus IV Palaeologus invades Constantinople and dethrones his father, John V Palaeologus, as co-emperor. John V Palaeologus is taken prisoner. * September – John of Gaunt summons religious reformer John Wycliffe to appear before the Royal Council to defend Gaunt from bishops who have become his enemies. * Fall – John of Gaunt, through the Royal Council, proceeds to undo the work of the Good Parliament. * December 25 – John of Gaunt presents his nephew, Prince Richard of Bordeaux, to the feudatories of the realm and swears to uphold Richard's right to succeed Edward III. * Khan Qamar al-din of Mongolistan unsuccessfully invades Timur’s eastern province of Farghana. * Timur leads his army against troops of the White Horde which have arrived at Sighnaq. However, winter sets in, preventing an immediate battle. * Dmitri Donskoi of Moscow raids Mongol ruled Volga Bulgaria (now in Russia). * Acamapichtli is elected Tlatoani of the Aztec empire after the death of Tenoch, the first Aztec ruler. * Catherine of Siena visits Pope Gregory XI in Avignon to attempt to persuade him to make peace with Florence and move the Papacy back to Rome. * Olaf III becomes King of Denmark after the death of his grandfather, Valdemar IV, in 1375. * The city of Sredets in Bulgaria is renamed Sofia after the Church of St Sophia * Mamluk Sultan of Egypt Nasir-ad- Din Shaban II is succeeded by Alah-ad-Din Ali. * Qutbuddin succeeds his brother, Shahabuddin, as Sultan of Kashmir. == Arts and Literature == * December 25 – Geoffrey Chaucer goes abroad on secret state business in the company of Sir John Burley. * 22nd July – Fabled date of the appearance of the Pied Piper of Hamelin. == Births == * November 9 – Edmund Mortimer, English rebel (died 1409) * Gihwa, Scholar in Korean Buddhism == Deaths == * January 24 – Richard FitzAlan, 10th Earl of Arundel, English military leader * June 8 – Edward, the Black Prince, son of King Edward III of England (born 1330) * Simon Langham, Archbishop of Canterbury * Tenoch, Aztec ruler",
 "title": "1376"
}