{
 "id": "66332",
 "text": "== Events == * Elizabeta Kotromanic, the mother of the overthrown Queen Mary of Hungary and Croatia, arranges the assassination of Charles of Durazzo, the ruler of Hungary, Naples, Achaea and Croatia. ** Mary is reinstated as Queen of Hungary and Croatia. ** Charles' son, Ladislas, becomes King of Naples. ** A period of interregnum begins in Achaea, lasting until 1396. Rule of Achaea is sought by numerous pretenders, none of whom can be considered to have reigned. * July 9 – Battle of Sempach: The Swiss safeguard independence from Habsburg rule. * Queen Jadwiga of Poland marries Grand Duke Jagiello of Lithuania, unifying their two countries. * Abu al-Abbas is reinstated as ruler of the Marinid dynasty in present-day Morocco. * John of Gaunt leaves England to make good his claim to the throne of Castile by right of his second marriage to Constanza of Castile in 1371. * The Timurid Empire raids Georgia and takes King Bagrat V prisoner. Bagrat is subsequently freed by an army led by his son, George. * Hundred Years' War – Battle of Margate: The English defeat an invading French and Castilian naval force. * Dan I of Wallachia (now southern Romania) is killed in battle against the Bulgarians and is succeeded by Mircea the Old. * May 9 – King John I of Portugal and King Richard II of England ratified the Treaty of Windsor. * May 20 – First mention of the city of Piteşti, now in Romania. * Founding of Ruprecht Karl University of Heidelberg, the oldest university in Germany. * The Venetians take control of the island of Corfu. * The Brancacci Chapel begins to be built in Florence. * Rozhdestvensky monastery is built in Muscovy. == Births == * March 12 – Ashikaga Yoshimochi, Japanese shogun (died 1428) * June 24 – Giovanni da Capistrano, Italian saint (died 1456) * Donatello, Italian artist (died 1466) * Niccolò Piccinino, Italian mercenary (died 1444) == Deaths == * July 9 – Duke Leopold III of Austria (killed in battle) (born 1351) * James Audley, English knight * William Langland, English poet (born 1332)",
 "title": "1386"
}