{
 "id": "663411",
 "text": "Robert Kenneth Dornan (born April 3, 1933) is an American politician, actor and radio personality. He was the Republican member of the United States House of Representatives from California's 27th, 38th and 46th congressional districts from 1977 to 1983 and again from 1985 to 1997. Dornan was born in New York City to a Roman Catholic family. He studied at Loyola Marymount University in Los Angeles. In 1952, he joined the United States Air Force as a fighter pilot. In 1955, he married Sallie Hansen. They have five children. Dornan also served as a combat journalist and photographer on several missions in Vietnam, Laos, and Cambodia during the Vietnam War and flew relief flights into Biafra. He was on active duty until 1958, and attained the rank of Captain.Biographical Directory of the United States Congress He was in the California Air National Guard and Air Force Reserve until 1975. Dornan ran for the Republican nomination for President of the United States in the 1996 election, but lost the nomination to Kansas United States Senator Bob Dole. Dornan also lost his House re-election in 1996 to Loretta Sanchez by 979 votes.Proof Of Illegal Voters Falls Short, Keeping Sanchez In House - February 7, 1998 In the late 1990s and early 2000s, Dornan hosted the \"Bob Dornan Show\", a radio talk show syndicated nationally by Talk Radio Network.\"One Dornan Stays Out, One Gets In\", Los Angeles Times, December 2, 1999. Retrieved April 3, 2017.\"Savage gets the boot after on-air anti-gay outburst\", Los Angeles Times, July 8, 2003. Retrieved April 3, 2017. In 2004, Dornan ran again for the House against incumbent Dana Rohrabacher, but lost in a landslide. Dornan took an active role in the civil rights movement. He took part in the historic 1963 March on Washington led by Martin Luther King Jr. The following year he helped register African Americans to vote in Mississippi.William Claiborne, 'B-1 Bob' Is on the Attack Again,\" The Washington Post, May 16, 1998.\"Bob Dornan on Civil Rights,\" http://www.bobdornan.com/on_civil_rights.html .Renee Tawa, \"Dornan Presidential Campaign Staffers Fired for Using Racial Slurs,\" Los Angeles Times, September 2, 1995. Dornan was also an actor and had a recurring role as Captain Fowler on ABC's Twelve O'Clock High television series and smaller roles on ABC's Bewitched and NBC's I Dream of Jeannie. ==References== ==Other websites== * Official website (last updated February 2004) Retrieved on 2009-03-08 * * Category:1933 births Category:Living people Category:United States representatives from California Category:American civil rights activists Category:Anti-communists Category:American Roman Catholics Category:American movie actors Category:American television actors Category:American photographers Category:American military personnel of the Vietnam War Category:American radio personalities Category:American television presenters Category:1996 United States presidential candidates Category:Journalists from New York City Category:Journalists from California Category:Actors from New York City Category:Actors from Los Angeles Category:Politicians from New York City Category:Politicians from Los Angeles Category:Republican Party (United States) politicians Category:Military people from New York (state)",
 "title": "Bob Dornan"
}