{
 "id": "663789",
 "text": "The AC Mogadiscio (\"Associazione Calcio Mogadiscio\" in Italian language) was a football team of the Italian community in Mogadishu, the capital of Somalia. It existed from 1933 (during the years of existence of the Italian colony called \"Italian Somalia\") until 1960, when the Italians finished their administrative mandate from the ONU in Somalia and most of the few Italians remaining in Mogadishu left Somalia forever. ==History== The AC Mogadiscio was a historical football team in Mogadishu, which officially existed until 1960 being created mainly for the Italian community of the capital of Italian Somalia. In 1933, the first Somali soccer championship -amateur- was created in Mogadishu under Italian rule, called \"Coppa Federazione Sportiva\", with three teams (\"AC Mogadiscio\", \"Marina\" and \"Milizia\"). The AC Mogadishu came second.1933 Somali Championship (amateur) In 1947 the AC Mogadishu won the (amateur) Somalia Championship.Somalia Championships In 1952 the name of the team was changed in AS Mogadiscio (\"Associazione Sport Mogadiscio\"), while was third in the Championship of that year.1952 Somali Championship The reason of the change was that the team was followed almost exclusively by Italian colonists and their descendants, so the management tried to get followers from the native Somalis erasing the Italian word \"calcio\" (that means 'football' in Italian).However only a few Somalis were fans of this team in 1960, when did the last championship The main rival of the AS Mogadiscio (the team of the Italians of the capital) was in the 1950s the Lavori Publici FC (or \"Genio Oficina\"), that was the team of the Italian of all Somalia and that had many native Somalis as fans. Finally, in the 1957-58 Championship, the AS Mogadiscio was named \"Champion of Somalia\", with the following results: * Name of football Team---matches/victories/tie/defeats/goals done/goals received/points: * 1.AS Mogadishu...….. 10 9 0 1 43-10 18 \"Champion\" * 2.AS Corpo Polizia…. 10 6 2 2 21-11 14 * 3.Autoparco...………. 10 6 0 4 25-18 12 * 4.LLPP....……...……. 10 4 3 3 20-17 11 (aka Lavori Publici FC) * 5.AS The Gab...…….. 10 2 0 8 10-34 4 * 6.AC Scuraran…..…... 10 0 1 9 10-39 1 In the 1959-1960 Championship the AS Mogadishu disputed its last contest, being third.1959 Somali Championship In 1961 the team was declared \"closed\", mainly for economic reasons since it almost did not have followers (because of the almost total disappearance of the Italians of Mogadishu & Somalia, who moved away -mainly to Italy)). ==References== ==Bibliography== * Tripodi, Paolo. The Colonial Legacy in Somalia. Capítulo: Deportes. St. Martin's P Inc. New York, 1999. ==Related pages== * Somalia * Italian Mogadiscio * Lavori Publici FC Category:Sport in Somalia",
 "title": "AC Mogadiscio"
}