{
 "id": "66399",
 "text": "Before 1981 they were known as Crown colonies. The British Overseas Territories are also referred to as overseas territories of the United Kingdom, UK overseas territories, or when the context is clear, simply the Overseas Territories.There are fourteen territories under the United Kingdom's sovereignty.The name \"British Overseas Territory\" was introduced by the British Overseas Territories Act 2002, and replaced the name British dependent territory which was introduced by the British Nationality Act 1981. Each of the British Overseas Territories has a government, parliament, and prime minister to amend all laws, except laws about foreign affairs and defense. The British government manages its defense and foreign affairs. British Overseas Territories which have no local population or any population, have no local self-rule. If the British Overseas Territory is ruled badly, the government of the British Overseas Territory can be taken over by the British government and ruled directly by it, without the agreement of the British Overseas Territory. The territories of Jersey, Guernsey , and the Isle of Man, though under the sovereignty of the British Crown, have a slightly different constitutional relationship with the United Kingdom, so they are classed as Crown dependencies rather than Overseas Territories. Unlike British Overseas Territories, the British government cannot take over the government of a Crown dependency, unless the government of the Crown dependency agrees. Territories and dependencies are distinct from the Commonwealth of Nations, a voluntary association of former British colonies which are independent countries. In a historical context, colonies should be distinguished from protectorates and protected states, which though under British control, were nominally independent states, whereas colonies were part of the British state. They should also not be confused with Dominions, which, known collectively as the Commonwealth, were independent states, held to be equal in sovereign status to the United Kingdom within the Empire and Commonwealth after the Statute of Westminster in 1931. Crown colonies, such as Hong Kong, were differentiated from other colonies in being administered directly by the Crown, without the degree of local autonomy found in self-governed colonies and other British Overseas Territories such as Bermuda. == Current Overseas Territories == Flag Coat of Arms Territory Location Motto Area Population Capital Anguilla Caribbean Strength and Endurance 102 km² (39.4 sq mi) 12,800 The Valley Bermuda North Atlantic Ocean Quo fata ferunt (Latin: \"Whither the Fates carry [us]\") 53.3 km² (20.6 sq mi) 64,482 Hamilton British Antarctic Territory Antarctica Research and discovery 1,709,400 km² (666,000 sq mi) 200 staff Rothera (main base) British Indian Ocean Territory Indian Ocean In tutela nostra Limuria (Latin: \"Limuria is in our charge\") 60 km² (23 sq mi) 3,200 military and staff Diego Garcia (base) British Virgin Islands Caribbean Vigilate (Latin: \"Be watchful\") 153 km² (59 sq mi) 21,730 Road Town Cayman Islands Caribbean He hath founded it upon the seas 260 km² (100.4 sq mi) 46,600 George Town Falkland Islands South Atlantic Ocean Desire the right 12,173 km² (4,702 sq mi) 2,967 Stanley Gibraltar Southern Europe Nulli expugnabilis hosti (Latin: \"Conquerable by no enemy\") 6.5 km² (2.5 sq mi) 27,776 Gibraltar Montserrat Caribbean Each Endeavouring, All Achieving 102 km² (39 sq mi) 9,000 Plymouth (abandoned due to volcano—de facto capital is Brades) Pitcairn Islands Pacific Ocean Dieu et mon droit (French: \"God and my right\") 43 km² (17 sq mi) (all islands) 67 Adamstown Saint Helena (including Ascension, Tristan da Cunha) South Atlantic Ocean Loyal and unshakeable 410 km² (158 sq mi) (all islands) 6,563 Jamestown South Georgia and the South Sandwich Islands South Atlantic Ocean Leo terram propriam protegat (Latin: \"Let the lion protect his land\") 3,903 km² (1508 sq mi) 11-26 staff King Edward Point/Grytviken Sovereign Base Areas of Akrotiri and Dhekelia Mediterranean (Cyprus) Dieu et mon droit (French: \"God and my right\") 254 km² (98 sq mi) 15,000 (almost half British military and staff) Episkopi Cantonment Turks and Caicos Islands North Atlantic Ocean One people, one nation, one destiny 430 km² (166 sq mi) 21,500 Cockburn Town == Government == The head of state in the Overseas Territories is the British monarch, presently King Charles III. The King’s role in the territories is in his role as King of the United Kingdom, and not in the right of each territory. The monarch appoints a representative in each territory to exercise their executive power. Head of States Governor of Bermuda | Commissioner of the British Antarctic Territory | Commissioner of British Indian Ocean Territory | Governor of the British Virgin Islands | Governor of the Cayman Islands | Governor of the Falkland Islands | Governor of Gibraltar | Governor of Montserrat| Governor of the Pitcairn Islands | Governor of Saint Helena | Civil Commissioner of South Georgia and the South Sandwich Islands | Administrator of Tristan da Cunha | Governor of the Turks and Caicos Islands All the Overseas Territories have their system of government and localized laws. The structure of the government appears to be closely correlated to the size and political development of the territory. Territories Government * British Antarctic Territory * South Georgia and the South Sandwich Islands No native population, therefore, there is no elected government. The Commissioner, supported by an Administrator runs the affairs of the territory. * British Indian Ocean Territory There is no elected government and currently has no native settled population. However, the Chagos Islanders - who were forcibly evicted from the territory in 1971 and might reasonably considered to be that territory's people - are currently defending an appeal against a British High Court judgment which quashed an Order preventing them from returning. Following resumed negotiations a treaty was signed in 2025 and will formally transfer the sovereignty of the territory to Mauritius once it comes into effect, while the Diego Garcia military base remains under British control during a 99-year lease.. * Sovereign Base Areas of Akrotiri and Dhekelia There is no elected government, however, the British military authorities try to ensure the convergence of laws with those of the Republic of Cyprus where possible. * Pitcairn Islands There is an elected Mayor and Island Council, who have the power to propose and administer local legislation. However, their decisions are subject to approval by the Governor, who retains near-unlimited powers of plenary legislation on behalf of the United Kingdom Government. * Falkland Islands * Saint Helena The Government consists of an elected Legislative Council. The Governor is the head of government and leads the Executive Council, consisting of appointed members made up of the Legislative Council and two ex-office members. * Anguilla * British Virgin Islands * Cayman Islands * Montserrat These larger territories have a larger Legislative Council, with political parties. The Executive Council is usually called a cabinet and is led by a Chief Minister (except in the Cayman Islands, which have a Leader of Government Business), who is the leader of the majority party in parliament. The Governor exercises less power over local affairs and deals mostly with foreign affairs and economic issues, while the elected government controls most \"domestic\" concerns. * Gibraltar Under the 2006 constitution which was approved in Gibraltar by a referendum, Gibraltar now has a Parliament. The Government, headed by the Chief Minister is elected. Defence, external affairs, and internal security vest in the Governor as a matter of distribution of powers. The UK administers absolutely nothing in Gibraltar. * Bermuda * Turks and Caicos Islands Bermuda, settled in 1609, is the oldest and most populous of the Overseas Territories, and most executive powers have been devolved to the head of government, known as the Premiers. Its system of government is very similar to that of a sovereign Commonwealth Realm. The UK government retains only minor powers, exercised through the Governor, but most of those are handed to local ministers for day-to-day purposes. Bermuda's Parliament held its first session in 1620, and Bermuda has been largely self-governed and self-sufficient since then. The Turks and Caicos Islands adopted a new constitution effective 9 August 2006; their head of government now also has the title Premier, and their autonomy has been greatly increased. === Legal system === Each Overseas Territory has its legal system independent of the United Kingdom. The legal system is generally based on English common law, with some distinctions for local circumstances. Each territory has its own Attorney General, and court system. The British government may appoint a UK-based lawyer or judge to work on legal cases for the smaller territories. This is particularly important for cases involving serious crimes and where it is impossible to find a jury who will not know the Defendant in a small population island. == Gallery of images == File:Sandy Ground Anguilla.jpg|Anguilla File:City Hall in Hamilton, Bermuda.jpg|City Hall, Hamilton, Bermuda File:Diegogarcia.jpg|View of the military base at Diego Garcia, British Indian Ocean Territory File:Aerial photo Port Stanley.jpg|Stanley, Falkland Islands File:Rock_of_Gibraltar_northwest.jpg|Rock of Gibraltar File:Montserrat volcano.jpg|Montserrat File:02 Last view of Jamestown St Helena June1970.jpg|View of Jamestown, Saint Helena == References == ==Related pages== * British Empire == Further reading == * Harry Ritchie: The Last Pink Bits * Simon Winchester: Outposts: Travel to the Remains of the British Empire (published in 1985 in the UK as Outposts: Journeys to the Surviving Relics of the British Empire also in the US as The Sun Never Sets: Travels to the Remaining Outposts of the British Empire.) == Other websites == * Foreign and Commonwealth Office- \"UK Overseas Territories\" * The Commonwealth - UK government site * Decolonization - History links for the end of the European formal Empires, casahistoria.net * UK Overseas Territories Conservation Forum * British Overseas Territories Act 2002- Text of the Act * United Kingdom Overseas Territories Association * Britlink - The British Overseas Territories",
 "title": "British Overseas Territories"
}