{
 "id": "663966",
 "text": "From October 23, 2018 to November 1, 2018, packages that had pipe bombs were sent to several American Democratic politicians and public figures. Packages were sent to Hillary and Bill Clinton, Barack Obama and Joe Biden. CNN got one addressed to former CIA Director John O. Brennan at its New York City studios in Time Warner Center, which was evacuated.Suspicious packages sent to Clinton, Obama, CNN prompt massive response CBS News, October 24, 2018 A similar package was sent to the home of billionaire investor George Soros. One was sent to former U.S. Attorney General Eric Holder, which had the wrong address, was instead delivered to the Florida office of U.S. Representative Debbie Wasserman Schultz, whose name and address was on the return labels of all of the packages. U.S. Representative Maxine Waters was targeted with two packages which were stopped by authorities, one in Washington, D.C. by U.S. Capitol Police,\"2018 explosive device incidents\". CNBC. Accessed October 24, 2018. and another in Los Angeles by the Los Angeles Police Department and Bureau of Alcohol, Tobacco, Firearms and Explosives. That same day, a package was sent to Senator Kamala Harris's office in San Diego. The New York City Police Department is investigating a package found in Tribeca at an office owned by actor Robert De Niro.Similar Package Sent to Top Democrats Sent to Robert De Niro's NYC Home: Sources NBC New York, October 25, 2018 The FBI is investigating two packages found at a postal facilities in Delaware, addressed to former Vice President Joe Biden.Two new pipe bombs said to target Joe Biden Vice, October 25, 2018 On October 25, a package was sent to former National Intelligence Director James Clapper and to New Jersey Senator Cory Booker. On October 26, two packages were sent to Senator Kamala Harris again and to Democrat megadonner Tom Steyer. News outlets reported that the bombs were sent to President Donald Trump's strongest critics. Cesar Sayoc Jr. was arrested in Plantation, Florida, on October 26 in connection with mailing the explosive devices. The FBI is treating the investigation as domestic terrorism.The manhunt: FBI treating serial bomber as domestic terrorism CNN, October 25, 2018 If convicted, the bomber could face up to 100 years in prison (10 years for each bomb sent).Anti-Democrat mail bomber faces more than 100 years in prison Washington Examiner, October 25, 2018 ==Timeline== Summary of incidents Date Intended target Location discovered October 22 George Soros Katonah, New York (Soros residence) October 23 Bill Clinton Hillary Clinton Chappaqua, New York (intercepted by Secret Service) October 24 Barack Obama Washington, D.C. (intercepted by Secret Service) Eric Holder Sunrise, Florida (office of Debbie Wasserman Schultz) Maxine Waters Los Angeles (postal facility) Washington, D.C. (Capitol Hill post office) John O. Brennan (via CNN) New York City (Time Warner Center) October 25 Joe Biden New Castle, Delaware (post office) Wilmington, Delaware (post office) Robert De Niro New York City (De Niro's film production company) October 26 James Clapper (via CNN) New York City (post office) Cory Booker Opa-locka, Florida (postal facility) Kamala Harris Sacramento, California (postal facility) Tom Steyer Burlingame, California (postal facility) ==Related pages== * 2001 anthrax attacks * Austin serial bombings ==References== Category:2018 crimes in the United States Category:2018 in California Category:2018 in Florida Category:2010s in Los Angeles, California Category:2010s in New York City Category:2010s in Washington, D.C. Category:Barack Obama Category:Bill Clinton Category:21st century in Delaware Category:Donald Trump United States mail bombing attempts Category:Terrorist attacks in the United States Category:Terrorist incidents in 2018",
 "title": "2018 United States mail bombing attempts"
}