{
 "id": "66407",
 "text": "== Events == * The completion of the Wyclif Bible by John Purvey and the beginning of prosecution of Wyclif's followers, known as the Lollards. * Battle of Otterburn: a Scottish army, led by James Douglas, defeats an English army, capturing the their leader, Harry Hotspur. Douglas is killed during the battle. * John of Gaunt, the uncle of Richard II of England, makes peace with Castile and gives up his claim to the Castilian thrown by allowing his daughter Katherine of Lancaster to marry Prince Henry, the eldest son of John I of Castile. * The entire court of Richard II of England are convicted of treason by the Merciless Parliament, under the influence of the Lords Appellant, and are all either executed or exiled. Richard II effectively becomes a puppet of the Lords Appellant. * Ramesuan is reinstated as King of Ayutthaya (now southern Thailand) after dethroning and executing 17 year-old King Thong Chan. * Goryeo Revolution: General Yi Seonggye begins a four-year revolution in Goryeo (now Korea) after being ordered by King U of Goryeo to attack the superior Chinese army. * Goryeo Revolution: King U of Goryeo is forced from power and replaced by his son Chang. * A Chinese invasion force under General Lan Yu defeats a large Mongolian army under Khan Toghus Temur and captures 100 members of the Yuan royal family. Toghus Temur is killed whilst trying to escape and is succeeded as Khan of Mongolia by his rival, Jorightu. * An invading Chinese army under General Xu Da destroys Karakorum, the capital city of the Mongolian Empire. * Battle of Plocnik: A combined force of Serbians, Bosnians and Bulgarians defeat an Ottoman invasion force. * Tran Ngung overthrows Tran Hien as King of Vietnam. * Omar I is succeeded by Sa'id as King of the Kanem-Bornu Empire (now east Chad and Nigeria). Sa'id is succeeded in the same year by Kade Alunu. Omar and Sa'id are both killed by Bilala invaders from the west. * Ghiyas-ud-Din Tughluq II succeeds Firuz Shah Tughluq as Sultan of Delhi. * Charles VI of France reaches maturity, ending the regency of his uncle, Philip the Bold. * The University of Cologne is established (now the largest university in Germany). * Cozia Monastery is built in Wallacia. * Ljubostinja Monastery is built in Serbia. == Births == * September 14 – Claudius Clavus, Danish geographer * September 29 – Thomas of Lancaster, 1st Duke of Clarence, second son of Henry IV of England (d. 1421) * Juliana Berners, English writer * Thomas Montacute, 4th Earl of Salisbury (died 1428) * Dai Jin, Chinese painter (d. 1462) == Deaths == * Simon de Burley, Lord Warden of the Cinque Ports * James Douglas, 2nd Earl of Douglas * Thomas Usk, English writer * Sultan Firuz Shah Tughluq of Delhi * King Thong Chan of Ayutthaya * Khan Toghus Temur of Mongolia * King Omar I of the Kanem- Bornu Empire * King Sa'id of the Kanem-Bornu Empire * Firuz Shah Tughluq",
 "title": "1388"
}