{
 "id": "66409",
 "text": "== Events == * July 18 – Tokhtamysh-Timur War: Battle of the Kondurcha River – Timur defeats Tokhtamysh of the Golden Horde in present-day southeast Russia. * Manuel II Palaiologos becomes Byzantine Emperor after his father, John V Palaiologos, dies of a nervous breakdown due to his continued humiliation by the Ottoman Empire. * Yusuf II succeeds Muhammed V as Nasrid Sultan of Granada (now southern Spain). * Stjepan Dabiša succeeds his uncle, Stefan Tvrtko I, as King of Bosnia. * Shah Mansur becomes leader of the Timurid occupied Muzaffarid Empire in central Persia. * A group of Muzaffarids under Zafar Khan Muzaffar establish a new Sultanate at Gujarat in western India. * August 5 – Anti-Jewish riots erupt in Toledo, Spain and Barcelona. Many Jews leave Barcelona after the following massacres, though a large number remain in the city. * Vytautas the Great, claimant to the thrown of Lithuania, forms an alliance with Muscovy. * Roman I succeeds Petru I as Prince of Moldavia (now Moldova and eastern Romania). * Konrad von Wallenrode succeeds Konrad Zöllner von Rotenstein as Grand Master of the Teutonic Knights. * Bridget of Sweden is canonized by Pope Boniface IX. * Ushkuinik pirates from Novgorod sack the Muscovy towns of Zhukotin and Kazan. * The Chinese invent toilet paper for use by their Emperors. * Henry I Sinclair, Earl of Orkney, takes control of the Shetland Islands and the Faroe Islands. * University of Ferrara is founded in present-day Italy. == Births == * October 31 – King Edward of Portugal (†1438) * November 6 – Edmund Mortimer, 5th Earl of March, English politician (died 1425) * Gedun Drub, 1st Dalai Lama (died 1474) * Michelozzo, Italian architect and sculptor (died 1472) * Zhu Quan, Chinese military commander, historian and playwright (died 1448) * Thomas West, 2nd Baron West (died 1415) == Deaths == * February 16 – John V Palaeologus, Byzantine Emperor (born 1332) * Muhammed V, Sultan of Granada * King Stefan Tvrtko I of Bosnia. * November 1 – Amadeus VII of Savoy (born 1360) * Nicholas Cabasilas, Byzantine mystic and theological writer",
 "title": "1391"
}