{
 "id": "664148",
 "text": "\"Shallow\" is a song by American entertainer Lady Gaga and American actor Bradley Cooper from the soundtrack of the fourth version of A Star Is Born (2018). It was released as the lead single from the soundtrack on September 27, 2018. The song was written by Gaga, Mark Ronson, Anthony Rossomando, and Andrew Wyatt, while Gaga and Benjamin Rice handled production. The song has reached number one in several countries, including the US, UK, Australia, New Zealand, Austria, Sweden, Switzerland, Denmark, Portugal, and Ireland, and the top ten in Belgium, Germany, the Netherlands, and Norway. The song won the Academy Award for Best Original Song in 2019, marking Gaga's first Oscar win. It reached number one in its 22nd week on the Billboard Hot 100, replacing \"7 rings\" by Ariana Grande. \"Shallow\" became Gaga's fourth US number-one hit and Cooper's first. The last song by Gaga to reach the top was \"Born This Way\" in 2011. It was certified double platinum by the Recording Industry Association of America for sales and streams of two million copies in the US. ==Charts== ===Weekly charts=== Chart (2018–2019) Peak position Argentina (Argentina Hot 100) 39 Brazil (Crowley Charts) 41 Brazil (UBC) 2 Bolivia (Monitor Latino) 1 Colombia (National-Report) 68 Croatia (HRT) 1 Ecuador (National-Report) 68 Estonia (IFPI) 5 Euro Digital Songs (Billboard) 1 Global 200 (Billboard) 74 Greece Digital Songs (IFPI Greece) 2 Greece Digital Songs (IFPI Greece) 16 Iceland (Tonlist) 1 Israel (Media Forest) 2 Latvia (Latvijas Radio) 1 Lebanon (Lebanese Top 20) 19 Lithuania (AGATA) 2 Luxembourg Digital Songs (Billboard) 1 Malaysia (RIM) 5 Mexico Airplay (Billboard) 10 Romania (Airplay 100) 37 Serbia (Radiomonitor) 4 Singapore (RIAS) 6 Slovenia (SloTop50) 2 South Korea International Digital (Gaon) 25 US Rolling Stone Top 100 1 Venezuela (National-Report) 17 ===Monthly charts=== Chart (2018–2019) Peak position Brazil Streaming (Pro-Música Brasil) 4 Paraguay (SGP) 78 South Korea International Digital (Gaon) 47 ===Year-end charts=== Chart (2018) Position Australia (ARIA) 53 Austria (Ö3 Austria Top 40) 33 Canadian Digital Songs (Billboard) 12 France (SNEP) 98 Hungary (Single Top 40) 8 Hungary (Stream Top 40) 31 Ireland (IRMA) 27 Italy (FIMI) 99 Netherlands (Dutch Top 40) 69 Portugal (AFP) 51 Sweden (Sverigetopplistan) 29 Switzerland (Schweizer Hitparade) 22 UK Singles (OCC) 87 US Digital Songs (Billboard) 38 Chart (2019) Position Australia (ARIA) 9 Austria (Ö3 Austria Top 40) 14 Belgium (Ultratop Flanders) 17 Belgium (Ultratop Wallonia) 11 Bolivia (Monitor Latino) 85 Canada (Canadian Hot 100) 6 Croatia (HRT) 1 Denmark (Tracklisten) 2 France (SNEP) 12 Germany (Official German Charts) 16 Hungary (Single Top 40) 1 Hungary (Stream Top 40) 12 Ireland (IRMA) 7 Italy (FIMI) 22 Latvia (LAIPA) 20 Netherlands (Dutch Top 40) 29 Netherlands (Single Top 100) 18 New Zealand (Recorded Music NZ) 10 Norway (VG-lista) 2 Portugal (AFP) 8 Romania (Airplay 100) 72 Slovenia (SloTop50) 18 Spain (PROMUSICAE) 40 Sweden (Sverigetopplistan) 3 Switzerland (Schweizer Hitparade) 1 UK Singles (OCC) 20 US Billboard Hot 100 19 US Adult Contemporary (Billboard) 2 US Adult Top 40 (Billboard) 11 US Dance Club Songs (Billboard) 36 US Rolling Stone Top 100 19 Chart (2020) Position Australia (ARIA) 61 Denmark (Tracklisten) 62 France (SNEP) 103 Hungary (Single Top 40) 29 Iceland (Plötutíðindi) 39 Italy (FIMI) 99 Slovenia (SloTop50) 32 Sweden (Sverigetopplistan) 72 Switzerland (Schweizer Hitparade) 24 UK Singles (OCC) 65 ===Decade-end charts=== Chart (2010–2019) Position Australia (ARIA) 99 Norway (VG-lista) 12 === All-time charts === Chart Position Australia (ARIA) 15 Belgium (Ultratop Flanders) 155 New Zealand (Recorded Music NZ) 20 Switzerland (Schweizer Hitparade) 1 == References == Category:2018 songs Category:Lady Gaga songs Category:Garth Brooks songs Category:Acoustic rock songs Category:Grammy Award-winning songs Category:2010s ballads",
 "title": "Shallow (Lady Gaga and Bradley Cooper song)"
}