{
 "id": "664152",
 "text": "An exonym is a name of a person, a people group, language, or place used by people of other places and languages. An endonym is a name that people of a certain place and language call themselves. For example, the endonym of Germany is Deutschland, because that is what Germans call their country. Germans call themselves and their language Deutsch. Germany and German are its exonym because English speakers, who are not German, use those names to describe it. This is actually very common across languages. One reason is because the sounds for an endonym may not exist in certain languages. It would be difficult for speakers of other languages to say them, so speakers of other languages make an exonym. Words in Japanese cannot end in any consonant that is not an \"n\" sound, and for that reason, Deutsch is Doitsu in Japanese. Japanese also adds Japanese morphemes so that there is no confusion between the country, the people, and the language. The German people are Doitsujin, in which -jin means people, and the name of the German language is Doitsugo, in which -go means language. While the country, people, and language of Laos can all be called Lao in English, they are called Raosu, Rasoujin, and Raosugo in Japanese. Another reason why a country might call another country a different name is because people from a certain country might have different ideas about those people or associate them with certain things. For example, Greeks call their country Hellas, their country is known around the world as Greece because the Roman Empire named the region after Magna Graecia, which were Greek colonies in the early days of Rome. Germany has a very large number of exonyms. It is called Allemagne in French, Niemcy in Polish, and Saksa in Finnish. This is because Germany has interacted with many other European countries. The Dutch call themselves Nederlanders in their own language, English speakers call them Dutch (a cognate of the German word Deutsch) because the words German and Dutch used to be interchangeable until Germany unified in the 1800s. Even though in Mandarin Chinese China is called Zhōngguó, meaning the \"Middle Kingdom\" or the \"Central States\", most other countries call it China. It is believed that the word China came from the word Qín, in which the Qin dynasty unified China. In Japanese, it is called Chūgoku, which has the same meaning as the Chinese name, except it uses the Japanese pronunciation for the Chinese characters for the name 中國 / 中国. In Korean, it is called Jungguk for the same reason. In Russian, China is called Kitay. A third reason why a country might call another place a different name is because a language can borrow a name from another language. Even though Japan is called Nippon or Nihon in Japanese, the word passed on to Europe through many different languages, all of which were very different from Japanese. Marco Polo heard about Kublai Khan sending soldiers to Cipangu, which in Chinese characters is 日本, which means \"Sun's Origin\". When the Portuguese arrived in Japan in the mid-16th century, they were the first Europeans to directly trade with Japan, they called the country Japão based on an old Malay word, which was borrowed from a southern Chinese dialect. Thus, most other countries call the country Japan. A few exceptions are Chinese, which call it Rìběn based on the Mandarin pronunciation of the Chinese characters, and Korean, which call it Ilbon based on the Korean pronunciation of the Chinese characters. Many countries call European cities by their endonym, including Roma, Praha, Köln, and Napoli. The English names of many European cities are noticeably different. They are called Rome, Prague, Cologne, and Naples. These names were borrowed from French. Since French was the official language of England from the Norman invasion to King Henry V the cities names came into English through French. For example, in the Italian language, it is now common for Italian speakers to refer to some African states as Mauritius and Seychelles rather than use the Italian exonyms Maurizio and Seicelle.Sandro Toniolo, I perché e i nomi della geografia, Istituto Geografico Militare, Florence 2005, p. 88–89, n. 170-171. ==References== Category:Names",
 "title": "Exonym and endonym"
}