{
 "id": "664310",
 "text": "Damien Steven Hirst (born 7 June 1965) is an English artist.Nicholson, Octavia. \"Hirst, Damien (Steven)\", Oxford Art Online (subscription). Retrieved 9 November 2008. He is one of the Young British Artists (YBAs). They became famous during the 1990s.\"Glossary: Young British Artists (YBA)\", Tate. Retrieved on 14 July 2009.\"Hirst generation missing from Turner prize 2000 shortlist\", The Guardian, 14 June 2000. Retrieved 11 September 2009. He is reportedly the United Kingdom's richest living artist. In 2010 the Sunday Times estimated his wealth at £215 million.Richard Brooks, \"It’s the fame I crave, says Damien Hirst ,\" The Times, 28 March 2010 During the 1990s he worked together with famous art collector Charles Saatchi. Hirst and Saatchi had disagreements, and they ended their friendship in 2003. Death is a central theme in Hirst's works. Brooks, Richard. \"Damien Hirst's earliest painting goes on sale\" , The Sunday Times, 6 April 2008. Retrieved 22 March 2010. He became famous for a series of artworks in which dead animals are preserved in formaldehyde. The animals included a sheep, a cow and a shark. The best-known of these was The Physical Impossibility of Death in the Mind of Someone Living. This was a tiger shark immersed in formaldehyde in a transparent display case. He has also made \"spin paintings\". These were created on a rotating canvas. And \"spot paintings\", which are rows of randomly coloured circles created by his assistants. In September 2008, Hirst sold all the artworks of a show during one auction at Sotheby's. This had never been done before by a living artist.Barker, Godfrey; Jury, Louise.\"Even his fag ends sell as Hirst art auction hits £100 million\", Evening Standard, 16 September 2008. Retrieved on 22 July 2009. The auction made him £111 million ($198 million), breaking the record for an auction by a single artist. It also broke Hirst's own record with £10.3 million for The Golden Calf, an animal with 18-carat gold horns and hooves, preserved in formaldehyde. Since 1999 some of Hirst's works have been claimed to be plagiarised. It was discovered that his sculpture Hymn was closely based on a child's toy. Hirst was sued by the original creator of the toy, and the case was settled out-of-court.Dyer, Clare. \"Hirst pays up for Hymn that wasn't his\", The Guardian, 19 May 2000. Retrieved 15 September 2010. == References == Category:1965 births Category:Living people Category:People from Bristol Category:People from Leeds Category:English artists Category:English painters",
 "title": "Damien Hirst"
}