{
 "id": "66454",
 "text": "That's So Raven is an original Disney teen television comedy series. The main character is a teenage girl, Raven Baxter, played by actress Raven-Symoné. The original character name was Dawn Baxter. Then it was changed to Mariah Baxter, then to Raven Baxter when Raven Symone won the part. == Summary == Raven Baxter is a psychic teenager who can see the future. She sees the future in visions. She has to try to understand her visions. Sometimes, she tries to keep them from coming true. == Cast == * Raven-Symoné as Raven Baxter * Kyle Massey as Cory Baxter * Anneliese van der Pol as Chelsea Daniels, who is characteristically ditzy (especially in seasons 3 and 4) * Orlando Brown as Eddie Thomas * Rondell Sheridan as Victor Baxter * T'Keyah Crystal Keymáh as Tanya Baxter == Episodes == === Season 1 === # Test of Friendship # Mother Dearest # Party Animal # Wake Up, Victor # A Fish Called Raven # Smell of Victory # Campaign in the Neck # Saving Psychic Raven # The Parties # Ye Olde Dating Game # Dissin' Cousins # Teach Your Children Well # Driven to Insanity # A Dog by Any Other Name # Saturday Afternoon Fever # A Fight at the Opera # Psychics Wanted # If I Only Had a Job # Escape Claus # Separation Anxiety # To See or Not to See === Season 2 === 22. Out of Control 23. Don't Have a Cow 24. Run Raven Run 25. Clothes Minded 26. Four's a Crowd 27. Hearts and Minds 28. Close Encounters of the Nerd Kind 29. That's So Not Raven 30. Blue in the Face 31. Spa Day Afternoon 32. Leave It to Diva 33. There Goes the Bride 34. Radio Heads 35. A Goat's Tale 36. He's Got the Power 37. Skunk'd 38. The Dating Shame 39. The Road to Audition 40. The Lying Game 41. Numb and Numb-er 42. My Big Fat Pizza Party 43. Shake, Rattle and Rae === Season 3 === 44. Psychic Eye for the Sloppy Guy 45. Stark Raven Mad 46. Opportunity Shocks 47. Taken to the Cleaners 48. Five Finger Discount (Part 1) 49. Five Finger Discount (Part 2) 50. Sweeps 51. Double Vision 52. Bend It Like Baxter 53. The Big Buzz 54. True Colors 55. Dog Day After-Groom 56. The Royal Treatment 57. Art Breaker 58. Boyz 'N Commotion 59. Gettin' Outta Dodge 60. On Top of Old Oaky 61. They Work Hard for His Honey 62. Mind Your Own Business 63. Hizzouse Party 64. Mismatch Maker 65. Chef-Man and Raven 66. When in Dome 67. Too Much Pressure 68. Extreme Cory 69. The Grill Next Door 70. Point of No Return 71. Country Cousins (Part 1) 72. Country Cousins (Part 2) 73. Food for Thought 74. Mr. Perfect 75. Goin' Hollywood 76. Save the Last Dance 77. Cake Fear 78. Vision Impossible 79. The Four Aces === Season 4 === 79. Raven, Sydney, and the Man 80. Pin Pals 81. Dues and Don'ts 82. Unhappy Medium 83. Adventures In Boss Sitting 84. Hook Up My Space 85. Driving Miss Lazy 86. Be Prepared 87. Juicer Consequences 88. Sister Act 89. Checkin' Out 90. Fur Better or Worse 91. Mad Hot Cotillion 92. When 6021 Met 4267 93. Soup to Nuts 94. Members Only 95. The Ice Girl Cometh 96. Rae of Sunshine 97. The Dress Is Always Greener 98. Teacher's Pet 99. The Way We Were 100. Where There's Smoke - Finale ==Spin-offs== *Cory in the House *Raven's Home ==Indian adaptation== In 2015, a Indian adaptation of the show was made. It was called Palak Pe Jhalak. Category:2003 American television series debuts Category:2007 American television series endings Category:2000s American sitcoms Category:American teen comedy television series Category:Disney Channel television series Category:Television series set in San Francisco Category:English-language television programs",
 "title": "That's So Raven"
}