{
 "id": "66499",
 "text": "A numeral system (also called a number system or system of numeration) is a way to write numbers. Roman numerals and tally marks are examples. \"11\" usually means eleven, but if the numeral system is binary, then \"11\" means three. A numeral is a way to represent a number. It may be a symbol or a word in a natural language, or a group of them. Numerals differ from numbers just as the word \"rock\" differs from a real rock. The symbols \"11\", \"eleven\" and \"XI\" are all numerals that represent the same number. Babylonian numerals, Greek numerals and Roman numerals are among the systems that were long used, before the Hindu–Arabic numeral system largely replaced them. ==Bases== Various symbols are used as numerals to make numbers. A system with base 10 (the common decimal system), normally uses the symbols 0, 1, 2, 3, 4, 5, 6, 7, 8, and 9. Each of the numbers 0 to 9 can be written as one symbol, 0 ... 9. To count past 9, symbols have to be put together. 10 can be seen as 1 in the tens' place and 0 in the ones' place, or as 1 times 101 plus 0 times 100. With a base of 2, only the symbols 0 and 1 are used. 10base 2 is therefore 1 times 21 plus 0 times 20. This is the same as 2, in the base 10 notation. For bases bigger than 10, capital letters are used as symbols. For example, the hexadecimal numeral system (base 16) uses the numerical digits 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F. Today, base 10 is the most commonly used system. Computers use binary and people who study computers often use octal and hexadecimal numeral systems. Ancient Sumer used sexagesimal (base 60). New world used base 20. Most electronic calculations are done in binary (base 2), but most people do calculations in decimal (base ten) or duodecimal. ==References== ==Other websites== *History of Counting and Numeral Systems- PlainMath.Net * Online Numeral Base Converter for Different Numeral Systems (Base 2-36) * Online Converter for Decimal/Roman Numerals (JavaScript, GPL) * Number Sense & Numeration Lessons * Counting Systems of Papua New Guinea Category:Number theory Category:Numbering systems",
 "title": "Numeral system"
}