{
 "id": "666097",
 "text": "Geographical renaming is when a place's name gets changed. There can be several reasons for geographical renaming. One such reason is countries joining together to form a new country. For example, after the Kingdom of England and the Kingdom of Scotland joined together in 1701, they formed the United Kingdom. When Ireland joined in 1801, the unified country became the United Kingdom of Great Britain and Ireland. A second reason is a country splitting apart to form new ones. For example, after Czechoslovakia split in 1992, it became two new countries, the Czech Republic and Slovakia. Also, after Ireland gained independence from Britain, the region of Northern Ireland stayed in the UK. Therefore, the country's name changed from United Kingdom of Great Britain and Ireland to what it is today, the United Kingdom of Great Britain and Northern Ireland. A third reason could be a new government replacing or overthrowing the old one. After the Communist Party took overthrew the Russian Empire's emperor, the Tsar, and changed the country's name to the Soviet Union, the city of Saint Petersburg also changed to Leningrad. This was because the Communist Party wanted to honor its leader, Vladimir Lenin, and symbolize the Soviet Union's turning away from Russia's system of absolute monarchy, the Tsardom, that ruled before they did, since Saint Petersburg was named after Peter the Great, who was the Tsar that founded the city. When the city of New Amsterdam, founded by Dutch colonists in North America, was lost to the British Empire, it was renamed New York City after the Duke of York. A fourth reason could be changing a place's name to replace a name given by former colonizers with the name given by native people, and many more. For example, after India gained independence from Britain, they changed the name of the city Bombay to Mumbai. A fifth reason could be the change of standard spelling rules in the local language. When Pinyin was made the official romanization, or writing Mandarin Chinese using the Roman alphabet, in mainland China after the Chinese Communist Party took over, the spellings of many Chinese place names changed, including Peking becoming Beijing and Nanking becoming Nanjing. Even though the pronunciations of Chinese place names in Mandarin Chinese were not any different before the changing of spelling, the older spellings did not accurately show their pronunciation. Therefore, the pronunciation of Chinese place names in other languages, or their exonyms, were based on their spelling rather than the Mandarin pronunciation, which is why they sound so different from each other. In order to teach people how to correctly pronounce Mandarin Chinese, the CCP made Hanyu Pinyin the only accepted romanization in mainland China. Even though Taiwan also speaks Mandarin, the spellings of Taiwanese place names, including Taipei and Kaohsiung, is according to the older spelling rules for Chinese place names. This is because many Taiwanese do not want to use Hanyu Pinyin, even though it is the standard romanization of Mandarin Chinese worldwide, because it was created by the Communist Party of China. Category:Geography",
 "title": "Geographical renaming"
}