{
 "id": "666086",
 "text": "Asia Bibi blasphemy case involves the conviction of a Pakistani Christian woman, Asia Noreen, for blasphemy by a Pakistani court. She was sentenced to death in 2010.\"Fear for Pakistan's death row Christian woman\". BBC However, she was acquitted by the Supreme Court in 2018. ==Case background and Court verdict== In June 2009, while harvesting berries from a field, Asia was seen drinking water from a communal cup by some village women of that area. It was considered offensive by the women due to her religion, and the cup was labelled \"contaminated\". This resulted in an argument between them, and the women accused her of blasphemy.\"A Death Sentence Over a Cup of Water?. In 2010, a judge in Sheikhupura sentenced Asia to death, which was upheld by the Lahore High Court. Petitions were sent for her release, including one sent by Pope Francis.\"Pakistan acquits Christian woman sentenced to die for blasphemy. USA Today Noreen's husband appealed to the high court. Salman Taseer, the Governor of Punjab, supported Noreen throughout and requested President Asif Ali Zardari to pardon her.\"Pakistan's president will pardon Christian woman, official says\". Due to this support, Taseer was killed by his guard Mumtaz Qadri.\"Militants say killed Pakistani minister for blasphemy\" Several appeals were made during this period and the High Court upheld the decision. In October 2014, Lahore High Court rejected her appeal.\"LHC upholds blasphemy convict Asia Bibi's death penalty. Dawn In November 2014, her lawyer appealed to the Supreme Court.\"On death row for blasphemy, Asia Bibi makes final appeal to SC\". Dawn On 31 October 2018, the Supreme Court panel chaired by Justice Saqib Nisar, acquitted Asia Bibi.\"Asia Bibi: Pakistan acquits Christian woman on death row. BBC Although the majority supported the decision, it resulted in protests by the Islamic parties, mainly Tehreek-e-Labaik.\"Islamists block roads in Pakistan over Asia Bibi blasphemy case\". ==References== Category:October 2014 events Category:October 2018 events Category:2014 in Pakistan Category:2018 in Pakistan",
 "title": "Asia Bibi blasphemy case"
}