{
 "id": "66619",
 "text": "Intelligent design is the idea that life, or the universe, cannot have arisen by chance and was designed and created by some intelligent entity. It believes that the universe is so complex that it must have been designed by a higher intelligent being. This theory is that life did not evolve by natural selection. Intelligent design was developed by a group of American creationists to get around legal judgements like Edwards v. Aguillard, which said that creationism could not be taught in schools because of the First Amendment., Context pg. 32 ff, citing \"ID is not a new scientific argument, but is rather an old religious argument for the existence of God. He traced this argument back to at least Thomas Aquinas in the 13th century, who framed the argument as a syllogism: Wherever complex design exists, there must have been a designer; nature is complex; therefore nature must have had an intelligent designer.\" \"This argument for the existence of God was advanced early in the 19th century by Reverend Paley\" (the teleological argument) \"The only apparent difference between the argument made by Paley and the argument for ID, as expressed by defense expert witnesses Behe and Minnich, is that ID's 'official position' does not acknowledge that the designer is God.\" , Ruling, p. 24. The first use of the term in this form was in the creationist textbook Of Pandas and People, published in 1989., pp. 31–33. == Concepts == Intelligent design suggests that life is too complex to have evolved. Scientists have discovered that even a single cell is complex. The genes in a cell code have a huge amount of information. Therefore that information, like computer programming, has to come from an intelligent source and cannot be made randomly. This is thought to be because the properties of entropy say things cannot grow in complexity by randomness. Law professor Phillip E. Johnson was seen as the father of the intelligent design. It is also argued that although an amino acid could be made randomly, a protein (a long, shaped string of amino acids) is such a precise sequence and structure that it would be impossible to make by chance. Also, a protein or DNA would not be alive by itself; so a whole life form would have to be made all at once. This argument can be seen as a way of saying that natural selection could not have created life. It is argued whether that is a valid point. A common example of this is a bacterial flagellum, which is essentially a microscopic animal version of a very efficient electric motor. The flagellum has lots of separate parts. It is argued that for the flagellum to form by evolution, every single one of the parts would have to be formed together at just the right time. However, scientists say this is not correct. There is evidence that the flagellum developed through evolution. A religious philosopher, William Paley, said that life is more complicated than a machine (like as a watch.) He said that just like a watch was made by a smart designer, so were animals. This is known as the watchmaker analogy. ==Similarities and criticism of Intelligent Design== Many parts of different animals are very similar. Intelligent design could show that a common creator used the same good design ideas for all of them. This could be evidence of evolution; but intelligent design suggests that every part of an animal is useful and there for a reason, showing how smart the designer was. Evolution suggests that many parts of the same animal would not be useful or not good, because it happened by natural selection. In the past, it was believed that some parts of the human body have no biological function, but later it was proved that some actually do important things. If animals and persons have similar parts because they came from a common ancestor, then the genes that code for these parts should be similar too. Sometimes this is true. But, other times similar structures are coded by entirely different genes, because of convergent evolution. These examples of this kind of different results in data can be used to claim that evolution is either wrong or right, causing arguments. == Legal cases == *In 2005, in the Dover trial, a United States judge ruled that Intelligent Design was a kind of creationism, so that it violated the First Amendment.Kitzmiller v. Dover Area School District, 04 cv 2688 (December 20, 2005)., Conclusion of Ruling. == Notes == == References == ==Other websites== * H. Allen Orr wrote an article for the New Yorker called Devolution: Why intelligent design isn’t. It explains why scientists do not believe intelligent design. *Explaining the Science of Intelligent Design",
 "title": "Intelligent design"
}