{
 "id": "666794",
 "text": "The Guangzhou Metro () is the metro system of Guangzhou, Guangdong in China. It is operated by the Guangzhou Metro Corporation. It was the fourth metro system that was built in mainland China. The Guangzhou Metro was planned many times. The planning of the metro began in the 1980s and in 1993 the construction of the first line began. In 1997 the metro opened. The first line was Line 1. As of 28 December 2024, The metro system has 17 lines. They are Line 1, Line 2, Line 3, Line 4, Line 5, Line 6, Line 7, Line 8, Line 9, Line 11, Line 13, Line 14, Line 18, Line 21, Line 22, Guangfo Line, and the Zhujiang New Town APM. All of these lines connect the urban core and the suburbs. The Guangfo Line connects Guangzhou and Foshan. As of 2017, over seven million people ride the metro everyday and it was used 2.56 billion times. This makes the metro the fourth busiest metro in the world. ==History== ===First ideas and planning=== Chen Yu, who was the Governor of Guangdong from 1957 to 1967, first had an idea for a metro system in Guangzhou. In 1960 he had the groundwater levels of Guangzhou checked. In 1965 Chen Yu and Tao Zhu put out the idea to build a tunnel in Guangzhou for evacuations during war or for creating a metro. The project was called \"Project Nine\". The metro system was supposed to have two lines. Chen Yu planned for a north-south line and an east-west line. The plans for these lines are very similar to Line 1 and Line 2. The east-west line was never built. The north-south line was supposed to be built by Project Nine. There wasn't enough time, money, or materials so instead of having a subway, they planned to use trolleybuses. The tunnel was finished in 1966 but it could not be used. This was because there was an unsafe section of the tunnel. There were many attempts to restart Project Nine in the 1970s, but none of these attempts restarted Project Nine. ===Construction of Line 1=== The metro project was started as the Preparation Office of Guangzhou Metro. It was created in 1979 to try and restart Project Nine. The project was going to help reduce the traffic in Guangzhou. Before the 1980s, most underground projects in China were to prepare for war. This was the first time that something like the Guangzhou Metro was focused on traffic. China and France worked together to design the metro. Four designs were released in the Guangzhou Daily on 14 March 1988. One of the designs were chosen after getting feedback from other people. It showed a design that would become Line 1 and Line 2. The construction of Line 1 officially began on 28 December 1992. Before that, in October 1992, workers began on a trial part of the line. Many construction techniques were used when building the metro. They were new to China and included immersed tubes and tunnel boring machines. Line 1 needed ¥12.75 billion to be built and the city government of Guangzhou raised all the money. The mayor at the time, Li Ziliu wanted to use cut-and- cover tunnels. This meant that almost 100,000 people had to leave their homes and almost of buildings had to be destroyed. On 28 June 1997 the section of Line 1 opened for a trial. The part that was not opened was finished on 28 December 1998. The whole line was opened for sightseeing between 16 February and 2 March 1999. Line 1 was officially opened on 28 June 1999. ==References== ==Other websites== * Category:Rapid transit systems Category:1997 establishments in Asia Category:Rail transport in the People's Republic of China",
 "title": "Guangzhou Metro"
}