{
 "id": "667129",
 "text": "Karl Davis (born January 17, 1962 in Brooklyn, NY – May 2, 1987) was an African-American fashion designer once called one of New York's most promising young designers. Davis' had six major collections, the last shown at Manhattan restaurant Caffe Roma. == Beginnings == Karl Davis “Designer Files” archival materials at Fashion Institute of Technology’s research library reveal that during his teen years Davis was taught by a friend’s mother how to operate a sewing machine, and that when he was fifteen years old, he for the first time made classic, pleated slacks for himself. Davis graduated from Brooklyn's George Wingate High School in August 1980. At age 17, he left Brooklyn and began designing. Davis attended New York’s Fashion Institute of Technology for only one semester - six months - and while there studied pattern making. He then worked as an assistant to Carol Fertig and, too, as a freelance design assistant to Bill Blass. It was while Davis was working as design assistant that he sold first styles to Henri Bendel. During 1984, Davis established his own collection. Initially, he was financed by his supportive, fashionable mother - Rose. ==Fashion Designer== Though brief – from age 17 until shortly before his death at age 25 – Karl Davis experienced a career highly praised and of impressive achievement Newsweek (10 August 1987)https://suny-fit.primo.exlibrisgroup.com/discovery/fulldisplay?context=L&vid;=01SUNY_FIT:01SUNY_FIT&search;_scope=MyInst_and_CI&tab;=Everything&docid;=alma991674600004829New York Public Library / Schomburg observed that Davis created an exclusive line of classic women’s clothing, which New York Newsday (4 May 1986) described as grown-up clothes not for those on a tight budget. New York Magazine {17 September 1987} stated that ladies dressed in Davis-designed wardrobes would look “strong, confident, and elegant – not to mention, in many instances, frankly sexy”. Fashion columnists of the Dallas Morning News (18 December 1985) reported that Davis’s work was strongly influenced by the great masters of couture, but that he managed to move forward adding his own signature of modern minimalism. The columnists, too, observed that Davis's approach to fashion and to his business were in remarkable contrast to his age. Taxi (November 1986) commented that being young and having no financial backing did not intimidate Davis from creating couture clothing of the highest level; that respect should be paid to him and fashion magazine should acknowledge him and take the initiative to put him on the map; and also that a lady dressed in Davis’s clothes would not only be taken seriously, but would be praised for her good taste and silent elegance - daring to detach herself from the uniforms of a working machine. Taxi quoted Davis: “I love what I’m doing – making women look like women again! The lady I sell to is dressed femininely and still gains respect on a business level.” Taxi further observed that a customer from Henri Bendel would never suspect that the dress she just purchased was from a young designer who supported himself by making bagel sandwiches in a downtown coffee shop. True, Davis did prepare sandwiches at “Tamala Designs With Bagel” [153 Prince Street], a SoHo clothing store with food counter in the back owned by Aggie Markowitz who reflected \"[Karl] was an integral part of the downtown fashion mafia. He gave fashion commentary while he sort of made bagel sandwiches. The commentary usually came faster than the food\". Taxi (November 1986) quoted Davis: “Most people would rather spend money on flashy clothes that scream and spell ‘expensive’, rather than purchasing understated elegant garments\". Prêt (May 1986) said Davis was beginning to shake up the New York fashion scene with his elegant, dramatic cuts and sophisticated sense of style, that his designs were Inspired by the looks of Dior, Balenciaga and Chanel; and that he took a modern approach to the values and attitudes of Haute Couture and reinvented them for a new, younger generation. Prêt additionally observed that Davis chose to work with very basic shapes and inject something hidden or unexpected into them which he described as “classic with a twist”; that he focused primarily on playing up and enhancing the feminine form; and that to further emphasize his attention to shape, he - with a keen focus on the waist and hips for both day and evening wear - tended to stay away from loud prints and patterns and designs. During December 1985, Davis found a backer and also was able to travel to Europe – both having significant impact on his May 1986 showing “Karl Davis Fall 1986 Collection”. New York Newsday (24 August 1986) declared Davis to be “New York’s new crown prince of near couture”. Karl Davis designs - priced at $80 to $500 wholesale - were sold In New York at Henri Bendel [which continued to be his major outlet], Bergdorf Goodman, Grand Hotel, Le Piccole, and Suzie's [Great Neck, NY]; in Dallas and Houston at Neiman Marcus; and in San Francisco at I. Magnin. Davis also created clothes for private clients. Karl Davis continued designing until April 1987 – the month before his death. ==Fashion Shows== 22 April 1984: [Davis's] Fall Collection shown during \"New American Designers Show\" at Club Area [157 Hudson Street] which fashion-commentator Tavy StoneTavy Stone | Jewish Women's Archive reported to be \"real clothes . . . good stuff\" in her Detroit News (29 April 1984) \"What's New\" column. Fall 1984: Designs shown during fashion presentation at Visage Discotheque [610 W. 56 Street] 14 January 1985: \"Spring/Summer 1985 is Karl Davis\" at Parsons School of Design [Seventh Avenue @ 40th Street] 5 August 1985: \"Fall/Holiday '85 Collection\" (“Karl Davis Presents Haute Couture R.T.W. ‘85”) shown at White Columns [325 Spring Street] which was video-recorded in its entiretyhttps://suny-fit.primo.exlibrisgroup.com/discovery/fulldisplay?docid=alma990000105990204829&context;=L&vid;=01SUNY_FIT:01SUNY_FIT⟨=en&search;_scope=MyInst_and_CI&adaptor;=Local%20Search%20Engine&tab;=Everything&query;=any,contains,karl%20davis&mode;=basic along with a post-show interview of Davishttps://suny-fit.primo.exlibrisgroup.com/discovery/fulldisplay?docid=alma990000105980204829&context;=L&vid;=01SUNY_FIT:01SUNY_FIT⟨=en&search;_scope=MyInst_and_CI&adaptor;=Local%20Search%20Engine&tab;=Everything&query;=any,contains,karl%20davis&mode;=basic by Cable News Network's \"Style with Elsa Klensch\". 6 November 1985: [Davis's] designs shown during \"Fashion Aid\" benefit for Ethiopian famine relief at Palladium Discotheque [126 E. 14th Street] which was video-recorded by Ohlmeyer Communications Companies and from which the New York Times cited Davis's white crepe de chine gown, 1 May 1986: “Karl Davis Fall 1986 Collection” – his sixth and last formal collection - shown at Caffe Roma, a Manhattan restaurant [3 W. 18th Street] ==Personal Style== In her [Japanese] Mr. High Fashion (September 1986) feature article “Karl Davis: A New, Up-and-Coming Designer Who Enjoys Dressing Up”, columnist Yoko Hamada wrote concerning Davis’s stylish way of dressing that “Although many designers dress well, it hard to find someone who loves dressing up as much as Karl. He is very fond of fashion: it’s as if he was born to enjoy wearing clothes. The clothes he wears are not shockingly avant-garde or showy. Karl is a unique dresser whose taste is classic, as well as modern, neat and refined. He creates his tasteful and sophisticated look by skillfully combining brand name clothes, antiques, and ordinary garments.” True to his nature, Davis in1980 was voted “Best Dressed Male” of his George-Wingate-High-School [Brooklyn, NY] graduating class. ==Illness and Death== On 2 May 1987, Karl Davis died of pneumonia at Brookdale Hospital Medical Center in Brooklyn, NY. Davis’s death was due to complications from HIV/AIDS.Newsweek August 10, 1987: MAYNARD PARKER: Amazon.com: BooksTHE AIDS MEMORIAL on Instagram: “— Karl Davis (January 17, 1962 - May 2, 1987) was a fashion designer who died of AIDS at Brookdale Hospital Medical Center, Brooklyn. He…” Along with fellow-designers Perry Ellis, Chester Weinberg, Willi Smith, Tracy Mills and Mark Pennywell, reporter Carol Hymowitz in her Wall Street Journal (8 December 1987) article \"Designer Deaths: AIDS Is Decimating The Fashion Business . . .\" cites \", , , budding talent Karl Davis, who created a line of classic women's clothing . . .\" as among the enormous toll of other talents in the fashion business succumbing to an alarming surge in HIV/AIDS-related casualties. Funeral services for Davis were held 7 May 1987 at St. Mary’s Church of Christ in Brooklyn, NY, followed by interment also in Brooklyn at Cypress Hills Cemetery. Karl Davis was survived by his parents, Rose and Lembert Davis of Brooklyn, and three sisters, Jackie and Robin, both of Brooklyn, and Andora Boyd of Virginia. == References == Category:Pages created with the Article Wizard from 2018 Category:1962 births Category:1987 deaths Category:American fashion designers Category:HIV/AIDS",
 "title": "Karl Davis"
}