{
 "id": "667216",
 "text": "William Wilson is a short story written by Edgar Allan Poe in 1839. The theme is doppelganger. The narrator is a dying man of \"a noble descent\" who choses not to embody a record of his later years of unspeakable misery, and unpardonable crime-he calls himself William Wilson because, although denouncing his profligate past, he does not accept full blame for his actions, saying that \"man was never thus ... tempted before\". and tells the story of how he \"Fell\" from \"grace\":Years before while attending a school in england Another boy at his school looks and acts like himself, and was even born on the same day, January 19th (Poe's actual birth day) 1813. Angered at being given \"good\" advice William steals into the boy bedroom but is shocked to find his double now resembles himself; he runs away from the school in horror.The first Wilson goes to the bad in life, but is haunted by his good double. After being subject to admonished at Eaton [while preparing to give a profane oath at a drinking party] and his honor destroyed at Oxford [where he is exposed at trying to cheat at cards], William is haunted by his double in subsequent years, who thwarts plans described by William as driven by ambition [in Rome], revenge [in Paris], passionate Love [in Naples], and avarice [In Egypt] and even follows him to other cities [Vienna, Berlin, Moscow]. One thing William cannot understand is that while no one knows anything about his double, his double always seems to know everything about William. At Carnival time in Rome William prepares to seduce the not unwilling young wife of a elderly nobleman. When his double appears the enraged William drags his double into a anterooom and challenges him to a sword duel where he kills the double. Distracted for a second he finds instead his double a mirror Reflected at him, he sees \"mine own image, but with features all pale and dabbled in blood\": apparently the dead double, \"but he spoke no longer in a whisper\". The narrator feels as if he is pronouncing the words: \"You have conquered, and I yield. Yet, henceforward art thou also dead—dead to the World, to Heaven, and to hope! In me didst thou exist—and, in my death, see by this image, which is thine own, how utterly thou hast murdered thyself. Poe later admitted he had got the idea from a previous story by Washington Irving about a character who kills his double. Category:19th-century American short stories Category:Short stories by Edgar Allan Poe",
 "title": "William Wilson (short story)"
}