{
 "id": "667453",
 "text": "The Memorial Hall of the Victims in Nanjing Massacre by Japanese Invaders is a museum about the 1937–1938 Nanjing Massacre in Nanjing, China. It is also known as the Nanjing Massacre Museum, or the because it is also a memorial hall to remember the many Chinese people who were killed during the massacre by the Imperial Japanese Army. The museum covers a total area of 103,000 square meters, with a building area of 57,000 square meters and the exhibition area of 20,000 square meters. It is a \"National First-Class Museum\" built on the site of the Jiangdong Gate mass murder in the Nanjing Massacre. Since its official opening on August 15, 1985, the museum has received more than 90 million viewers from over 100 countries and regions by the end of 2017. ==History== Nanjing (then spelled \"Nanking\" in English) was China's capital city during the 1920s and 1930s. At that time, Japan was an empire that included Korea and Taiwan. During the 1930s, Japan started the Second Sino- Japanese War and tried to take over all of China. This became part of World War II, as Japan's friend Germany took over Poland and Italy joined their wars and started some of its own. When the Japanese army got to Nanjing in December 1937 and January 1938, it did not only fight the Chinese army; it also killed many other people who were not fighting at all. It also committed many, many war crimes against the people in the city. It is even hard to count how many people were killed or hurt in all, because the Japanese treated the bodies and the people so badly. The Chinese government says 300,000 people were killed and more were hurt. To remember the people who were killed and hurt and to fight Japanese people who say nothing very bad happened in Nanjing, the city government built the Nanjing Massacre Museum in 1985. In 1995, with the city growing richer from China's Opening-Up Policy, the museum was made larger and better. ==Grounds== The memorial (place to remember something) consists of three major parts: a museum that shows historical records and other things from the massacre, an outdoor area, and a covered area that holds the bones of many of the people who died in the massacre. The building has about 3,000 square meters or 32,000 square feet of floor space. The rest of the museum covers another 25,000 square meters or 6 acres of land around the building. The memorial uses architecture, sculptures, and videos to show what happened during the Nanjing Massacre. ==Visiting== It is free to enter the Nanjing Massacre Museum. It is open from 8:30 to 4:30 from Tuesday to Sunday. The museum is closed every Monday. You can go there by taking the underground or by buses. ==Other websites== *Official website * == References == Category:Buildings and structures in Nanjing Category:Museums in China",
 "title": "Memorial Hall of the Victims in Nanjing Massacre by Japanese Invaders"
}