{
 "id": "667685",
 "text": "Wyandotte County (; county code WY) is a county in the U.S. state of Kansas. In 2020 census, 169,245 people lived there. This would make it the county with the fourth-most number of people in Kansas. Its county seat is Kansas City. Kansas City is also the biggest city in Wyandotte County. It has a unified government. Wyandotte County west of Kansas City, Missouri. ==History== ===The Wyandot=== The county is named after the Wyandot (also known as Wyandott or Wyandotte) Native Americans. They were called the Huron by the French in Canada, but they called themselves Wendat. They were distantly related to the Iroquois. They had hoped to stop white Americans from moving into their territory. They also hoped to make the Ohio River the border between the United States and Canada. ===Other historical facts=== The county was organized in 1859.History of Wyandotte County Kansas and its people; Perl W. Morgan; Lewis Publishing; 1911. Tenskwatawa (Tecumseh's brother), \"the Prophet\", fought at the Battle of Tippecanoe in 1811. He was buried at Shawnee Native American historical site Whitefeather Spring. The Kansas City Smelting and Refining Company employed over 250 men during the 1880s. The Delaware Crossing (or \"Military Crossing\"; sometimes \"the Secondine\") was where the old Indian trail met the waters of the Kaw River. Circa 1831, Moses Grinter (one of the earliest permanent white settlers in the area) created the Grinter Ferry on the Kansas River here. His house was known as the Grinter Place. The ferry was used by people (such as traders, freighters, and soldiers) traveling between Fort Leavenworth and Fort Scott on the military road. Others would cross this area on their way to Santa Fe. ==Geography== The U.S. Census Bureau says that the county has a total area of . Of that, is land and (2.9%) is water. It is the smallest county by area in Kansas. ==People== Wyandotte County is included in the Kansas City, MO-KS Metropolitan Statistical Area. ==Government== ===Presidential elections=== Presidential election results Year Republican Democratic Third Parties 2020 33.2% 18,934 64.5% 36,788 2.4% 1,349 2016 32.1% 15,806 61.2% 30,146 6.7% 3,291 2012 30.5% 15,496 67.4% 34,302 2.2% 1,095 2008 28.8% 16,506 69.4% 39,865 1.8% 1,038 2004 33.6% 17,919 65.4% 34,923 1.1% 559 2000 29.1% 14,024 67.1% 32,411 3.8% 1,837 1996 28.2% 14,011 62.9% 31,252 8.9% 4,391 1992 21.1% 12,872 56.3% 34,397 22.7% 13,855 1988 32.7% 19,097 66.2% 38,678 1.1% 624 1984 42.8% 27,459 56.2% 36,042 1.0% 635 1980 38.2% 23,012 54.4% 32,763 7.4% 4,448 1976 37.0% 23,141 59.9% 37,478 3.1% 1,936 1972 52.7% 34,157 43.5% 28,206 3.8% 2,453 1968 33.4% 23,091 49.4% 34,189 17.2% 11,891 1964 31.5% 20,553 66.5% 43,442 2.1% 1,356 1960 45.3% 34,764 54.0% 41,433 0.8% 604 1956 47.6% 34,604 52.1% 37,842 0.3% 186 1952 47.0% 34,648 52.6% 38,751 0.4% 258 1948 36.5% 24,398 61.9% 41,366 1.5% 1,024 1944 44.7% 26,817 54.9% 32,914 0.4% 214 1940 42.2% 28,152 57.4% 38,239 0.4% 252 1936 40.6% 26,239 59.0% 38,101 0.4% 256 1932 43.3% 25,471 55.5% 32,629 1.2% 721 1928 65.7% 32,829 33.8% 16,884 0.5% 265 1924 59.5% 23,881 22.2% 8,913 18.3% 7,354 1920 57.3% 19,294 40.8% 13,737 2.0% 671 1916 41.9% 13,863 53.9% 17,850 4.3% 1,408 1912 11.2% 2,107 39.1% 7,370 49.7% 9,371 1908 47.6% 8,684 48.9% 8,923 3.6% 652 1904 64.2% 9,147 26.8% 3,815 9.1% 1,290 1900 51.8% 8,133 46.5% 7,304 1.8% 280 1896 49.4% 6,852 49.7% 6,882 0.9% 126 1892 51.1% 5,889 48.9% 5,635 1888 55.4% 5,431 42.4% 4,155 2.2% 215 Unlike almost every other county in Kansas, Wyandotte County has been solidly Democratic ever since the New Deal. The only Democrat to lose Wyandotte County since 1932 has been George McGovern in 1972. Wyandotte was the only county in Kansas to vote for Franklin D. Roosevelt in 1944, Adlai Stevenson II in both 1952 and 1956, Hubert Humphrey in 1968, Jimmy Carter in 1980, and Walter Mondale in 1984. ==Economy== Village West, has helped the economy in KCK and Wyandotte County grow. At Village West, there are companies like Hollywood Casino, Legends Outlets Kansas City, Schlitterbahn Vacation Village, Cabela's, Nebraska Furniture Mart, Great Wolf Lodge, T-Bones Stadium (home to the Kansas City T-Bones of the American Association) and Children's Mercy Park (home of Sporting Kansas City of Major League Soccer). ==Education== ===Colleges and universities=== Public * Kansas City Kansas Community College * University of Kansas Medical Center Private * Donnelly College ===School Districts=== * Turner USD 202 * Piper USD 203 * Bonner Springs USD 204 * Kansas City USD 500 ===Private schools=== Primary * Resurrection Grade School (formerly St. Peter's Cathedral Grade School) * St. Patrick's Grade School * Christ the King Grade School Secondary * Bishop Ward High School ===Other schools=== * Kansas State School for the Blind (KSSB) ==Communities== ===Incorporated cities=== * Kansas City * Bonner Springs (partly in Leavenworth and Johnson counties) * Edwardsville * Lake Quivira (partly in Johnson County) ==References== ;Notes ==More reading== * Historic Preservation . Kansas City, Kansas, Urban Planning & Land Use * Sween, Argentine Pictures . Interactive Genealogy. Pictorial History of Wyandotte County, KS. * Historical Wyandotte County . Kansas Heritage, Kansas Community Network. * Views of the Past . Kansas City, Kansas Bicentennial Commission. * Sween, Bonner Springs and Edwardsville. Virtual Bonner Springs, KS. * * Tuttle and Pike's Atlas of Kansas City, Kansas; Tuttle & Pike; 13 pages; 1907. * Complete Set of Surveys and Plats or Properties in Wyandotte County and Kansas City Kansas; G.M. Hopkins & Co; 51 pages; 1887. ==Other websites== ;County * * Wyandotte County - Directory of Public Officials ;Other * Kansas City / Wyandotte County Convention and Visitors Bureau * Wyandotte County Economic Development Council ;Historical * Wyandotte County Kansas History and Heritage Project ;Maps * Wyandotte County Maps: Current , Historic , KDOT * Kansas Highway Maps: Current , Historic , KDOT * Kansas Railroad Maps: Current , 1996, 1915, KDOT and Kansas Historical Society Category:Kansas counties Category:1859 establishments in Kansas Territory",
 "title": "Wyandotte County, Kansas"
}