{
 "id": "66788",
 "text": "Climate change refers to long-term changes in temperature, precipitation, and other atmospheric conditions on Earth. It primarily involves the warming of the planet due to increased concentrations of greenhouse gases, like carbon dioxide and methane, from human activities such as burning fossil fuels, deforestation, and industrial processes. These changes can lead to a variety of impacts, including more extreme weather events, rising sea levels, and disruptions to ecosystems and agriculture. When people talk about climate change they are usually talking about the problem of human-caused global warming, which is happening now (see global warming for more details). But the climate of the Earth has changed over not just thousands of years, but tens or hundreds of millions of years. The earth's climate changes over time, so it could be hotter or colder at a certain time. For example about 60 million years ago there were a lot of volcanoes, which burnt a lot of underground organic matter (squashed and fossilized dead plants and animals became coal, gas and oil). A large amount of carbon dioxide and methane went up in the air. At times in the past, the temperature was much cooler, with the last glaciation ending about ten thousand years ago.Imbrie J. & Imbrie, K.P. 1979. Ice ages: solving the mystery. Short Hills NJ: Enslow. ISBN 978-0-89490-015-0Alley R.B. 2000. The two-mile time machine: ice cores, abrupt climate change, and our future. Princeton University Press. ISBN 0-691-10296-1 Ice Ages are times when the Earth got colder, and more ice froze at the North and South Poles. There have been times when Earth has been covered in ice, and was much colder than today. There is no one reason why there are Ice Ages. Changes in the Earth's orbit around the Sun, and the Sun getting brighter or dimmer are events which do happen. Also how much the Earth is tilted compared to the Sun might make a difference. Another source of change is the activities of living things (see Great Oxygenation Event and Huronian glaciation). A snowball period, c2.4–c2.0 billion years ago, was triggered by the Great Oxygenation Event == Hot Earth == Sometimes, before there were people, the Earth's climate was much hotter than it is today. For example about 60 million years ago there were a lot of volcanoes, which burnt a lot of underground organic matter (squashed and fossilized dead plants and animals like coal, gas and oil) so a lot of carbon dioxide and methane went up in the air like nowadays. This made the Earth hot enough for giant tortoises and alligators to live in the Arctic. == Cold Earth == === Glaciations === At times in the past, the temperature was much cooler, with the last glaciation ending about ten thousand years ago. === Ice Ages === Ice Ages are long times (much much longer than glaciations) when the Earth got colder, and more ice froze at the North and South Poles. Sometimes even the whole Earth was covered in ice, and was much colder than today. There is no one reason why there are Ice Ages. Changes in the Earth's orbit around the Sun, and the Sun getting brighter or dimmer are events which do happen. Also how much the Earth is tilted compared to the Sun might make a difference. Another source of change is the activities of living things (see Great Oxygenation Event and Huronia glaciation). == History of climate change studies == Joseph Fourier in 1824, Claude Pouillet in 1827 and 1838, Eunice Foote (18191888) in 1856, Irish physicist John Tyndall (1820–1893) in 1863 onwards,Tyndall J. 1863. Heat as a mode of motion. London & New York. Svante Arrhenius in 1896, and Guy Stewart Calendar (1898–1964) discovered the importance of carbon dioxide (CO2) in climate change. Foote's work was not appreciated, and not widely known. Tyndall proved there were other greenhouse gases as well. Nils Gustaf Ekholm in 1901 invented the term. === The Sun === The Sun gets a little bit hotter and colder every 11 years. This is called the 11-year sunspot cycle. The change is so small that scientists can barely measure how it affects the temperature of the Earth. If the Sun was causing the Earth to warm up, it would warm both the surface and high up in the air. But the air in the upper stratosphere is actually getting colder. Therefore the changes in the Sun are not causing the global warming which is happening now. According to the United Nations’ Intergovernmental Panel on Climate Change (IPCC), the current scientific consensus is that long and short-term variations in solar activity play only a very small role in Earth’s climate. Warming from increased levels of human-produced greenhouse gases is actually many times stronger than any effects due to recent variations in solar activity. For more than 40 years, satellites have observed the Sun's energy output, which has gone up or down by less than 0.1 percent during that period. Since 1750, the warming driven by greenhouse gases coming from the human burning of fossil fuels is over 270 times greater than the slight extra warming coming from the Sun itself over that same time . == Sustainable energy and environment == Renewable energy or sustainable energy includes any energy source that cannot be exhausted. It can remain viable for a long period of time without running out or lasts forever. Examples are solar, wind, hydropower (water), geothermal, tidal and biomass. Sustainable energy choices play a crucial role in mitigating the impact of human activities on the environment. Here's an overview of some key sustainable energy options and their environmental impacts according to research: === Solar energy === Sunlight from the Sun when converted produces solar energy. It is in abundance and freely available. The type of energy obtained is clean and easily renewable. It has low maintenance cost and can generate energy in any climate. === Wind energy === Another clean form of energy is wind. This energy is a plentiful source of renewable energy source. However, it is only available sometimes. Through history, the use of wind power has waxed and waned, from the use of windmills in centuries past to high tech wind turbines on wind farms today. ==Related pages== *Ecology *Intergovernmental Panel on Climate Change *Palaeoclimatology ==References.==",
 "title": "Climate change"
}