{
 "id": "66847",
 "text": "In mathematics, the cardinality of a set means the number of its elements. For example, the set A = {2, 4, 6} contains 3 elements, and therefore A has a cardinality of 3. The cardinality of a set A can also be represented as |A|. Two sets have the same (or equal) cardinality if and only if they have the same number of elements, which is the another way of saying that there is a 1-to-1 correspondence between the two sets. The cardinality of the set A is less than or equal to the cardinality of set B if and only if there is an injective function from A to B. The cardinality of the set B is greater than or equal to the cardinality of set A if and only if there is an injective function from A to B. The cardinality of a set is only one way of giving a number to the size of a set. The concept of measure is yet another way. ==Notation== ||A|| is the cardinality of the set A. Single vertical bars can also be placed around a set to mean cardinality, such as |A|. == Finite sets == The cardinality of a finite set is a natural number. The smallest cardinality is 0. The empty set has cardinality 0. If the cardinality of the set A is n, then there is a \"next larger\" set with cardinality n+1 (for example, the set A ∪ {A}). If ||A|| ≤ ||B|| ≤ ||A ∪ {A}||, then either ||B|| = ||A|| or ||B|| = ||A ∪ {A}||.) There is no largest finite cardinality. == Infinite sets == If the cardinality of a set is not finite, then the cardinality is infinite.In order to simplify, we will assume the Axiom of choice An infinite set is considered countable if they can be listed without missing any (that is, if there is a one-to-one correspondence between it and the set of natural numbers \\mathbb{N}). Examples include the rational numbers, integers, and natural numbers. Such sets have a cardinality that we call \\aleph_0 (pronounced \"aleph null\", \"aleph naught\" or \"aleph zero\"). Sets such as the real numbers are not countable, since given any finite or infinite list of real numbers, it's always possible to find a number that's not on that list. The real numbers have a cardinality of \\mathfrak{c}—the cardinality of the continuum. ==Related pages== *Bijection * Cardinal number * Cantor's diagonal argument * Cantor's theorem * Continuum hypothesis * Injective function == Notes and References == Category:Cardinal numbers Category:Set theory",
 "title": "Cardinality"
}