{
 "id": "6684",
 "text": "is the capital city of Osaka PrefectureNussbaum, Louis-Frédéric. (2005). \"Ōsaka\" in Japan Encyclopedia, p. 759. which faces Osaka Bay and the Seto Inland Sea.Nussbaum, \"Ōsaka-fu\" at p. 759. Osaka is in the Kansai region. It is the economic and cultural center of the Kansai region. Since 1980 it had been the second largest city in Japan. It is a city designated by government ordinance in Japan and is separated to 24 wards.Buhnik, Sophie. \"From Shrinking Cities to Toshi no Shukushō: Identifying Patterns of Urban Shrinkage in the Osaka Metropolitan Area,\" Berkeley Planning Journal, Vol. 23, No. 1 (2001), p. 135 [PDF 4 of 24]. Retrieved 2012-12-2. Osaka is surrounded by Hyōgo Prefecture, Kyoto Prefecture, Nara Prefecture, Wakayama Prefecture. ==History of Ōsaka== Sometimes Osaka is called by its historical name . Because it is by the sea, it is good for transportation. That is why an ancient emperor made Osaka the capital city. In the early part of the 8th century Naniwa was one of capitals of Japan. In the middle of the 16th century Toyotomi Hideyoshi founded Osaka castle and governed Japan in Osaka. The basis of development of Osaka was prepared in those times. Osaka castle was destroyed once by Tokugawa Ieyasu but Ieyasu choose Osaka as one of the political centers in the Western Japan. He made Osaka a direct dominion of the shogun. During the Edo period Osaka was a center of commerce, finance, pharmacy and other products. It was a center for literature and theater. Kabuki in Osaka is as famous as Kabuki in Edo and Kyoto. It is also known for bunraku (a traditional puppet theater) and manzai (a kind of stand-up comedy). Traditional Osaka food dishes include okonomiyaki (pan-fried batter cake) and takoyaki (octopus dumplings). In this region, many people speak a dialect called Osaka-Ben (e.g. \"ookini\"=\"thank you\"). After the Meiji restoration Osaka was modernized and industrialized. It was a center of Japanese industry. After the World War II its economical importance was relatively less because Tokyo grew as an international city and many companies moved their headquarters to Tokyo. But Osaka is still a large, important city. ==Sightseeing spots== *Universal Studios Japan – This is the most famous theme park in Osaka. There are shows, popular characters and musicals. *Kaiyuukan – This is the most famous aquarium in Osaka. They have animals including whale sharks and penguins. *Yoshimoto shinkigenki – It is a traditional comedy in Namba Grand Kagetsu. ;Seasonal spots *In spring, good places to see cherry blossoms are the Mint and Banpakukinen Park. *In summer, there are displays of fireworks at the Tenzin festival, Yodo river festival and PL art of fireworks. *In winter, there are Christmas decorations at Nakanoshima and Midosuzi. ==Sports== ===Football clubs in Osaka=== * Cerezo Osaka * Gamba Osaka ===Baseball teams in Osaka=== *Hanshin Tigers (It is on Hyōgo Prefecture but popular in Osaka too.) *Orix Buffaloes ===Mind sports in Osaka=== * Kansai Ki- in (Non-profit organization to promote Go in Osaka) ==References== ==Related pages== *Settsu Province *Naniwa-kyō ==Other websites== * * Category:Former capitals of Japan",
 "title": "Osaka"
}