{
 "id": "668679",
 "text": "The Paynes is an American television sitcom that premiered on January 16, 2018, on the Oprah Winfrey Network. The show was created, written, and directed by Tyler Perry and serves as a sequel to his previous series, Tyler Perry's House of Payne. ==Plot== The Paynes picks up where Curtis and Ella Payne have decided to take the next step in their lives—retirement. A death in the family has the whole family traveling to Sun Coast, Florida, to attend the funeral of Curtis' Uncle Robert. Their trip takes an unexpected turn when Ella and Curtis get roped into a real estate deal, landing them in a new community with a new church and unfamiliar family members. The family is thrown straight back into the issues that viewers find in their everyday lives. As life lessons abound, Ella finds a new business, new home and new purpose. LaVan Davis and Cassi Davis are the only cast members who appear in every episode. On June 22, 2018, OWN announced the show's return for the second half for the first season to premiere on July 20, 2018. It did not return for a second season. == Cast and characters == ===Main=== * Curtis Payne (LaVan Davis) - Ella's husband and JoAnn’s cousin. Without consulting his wife, Curtis sells his old home and buys the house of his late uncle as well as the laundromat at the suggestion of his cousin, only to find both in ruins. Furious at first, he comes to see the effect the move has on his wife and lets it go. His return appearance in the episode \"A Surprise for the Paynes\". * Ella Payne (Cassi Davis) - Curtis' wife. While Ella is furious at her husband for not consulting her, she soon comes to see enjoy the effect of the move and lets her anger go to make a new start. Her return appearance in the episode \"A Surprise for the Paynes\". * JoAnn Payne (Jackée Harry) - Curtis' cousin and Ryan's mother. who tricked him into buying his late uncle's dilapidated home as well as a broke- down laundromat in order to make profits for her church. Her first appearance in the episode \"A Surprise for the Paynes\". * Nyla Payne (Stephanie Charles) - Kenny and Lynn's mother. a young woman who works with JoAnn at the church. She begins to live with Curtis and Ella after encountering her in an abusive relationship with her boyfriend Kendrick. She has two young kids, Kenny and Lynn. Her first appearance in the episode \"Revelations of Payne\". * Ryan Payne (Markice Moore) - JoAnn's son. He works at the laundromat and was amused when his relatives bought the dump. He often butts heads with Curtis, but comes to see him as family and reaches common ground with him. His first appearance in the episode \"Revelations of Payne\". * Kenny Payne (JD McCrary) - Nyla's son and Lynn's brother. He is somewhat disrespectful to adults and butts heads with Curtis at times but begins to warm up to him. His first appearance in the episode \"Cleaning Up the Payne\". * Lynn Payne (Sanai Victoria) - Nyla's daughter and Kenny's sister. Like Kenny, she also butts heads with Curtis but also warms up to him as well. Her first appearance in the episode \"Cleaning Up the Payne\". * Terrance (Anthony O. Dalton) - The head contractor who Ella hires to repair the laundromat. In the episode \"Keep the Payne Away\", he has an instant attraction to Nyla. His first appearance in the episode \"Making Repairs\". * Kendrick (Matthew Law) - Nyla's boyfriend, who is abusive to her. His first appearance in the episode \"Revelations of Payne\". ===Recurring=== * Calvin Payne (Lance Gross) - Curtis and Ella's only son. * CJ Payne (Allen Payne) - Curtis and Ella's nephew; the adopted son of Curtis' late brother. * Janine Payne (Demetria McKinney) - C.J.'s wife. * Malik Payne (Larramie \"Doc\" Shaw) - C.J. and Janine's oldest child. * Jazmine Payne (China Anne McClain) - C.J. and Janine's second-oldest child. ===Former=== * Claretha Jenkins (Denise Burse) ===Special Guest=== * Agent Simms (Anthony Reynolds) appears in \"A Payneful Bounce\" and \"A Payne Family Secret\". ==Career== Curtis Payne (LaVan Davis) and Ella Payne (Cassi Davis) returned as series regulars. JoAnn Payne (Jackée Harry), Nyla (Stephanie Charles), Ryan (Markice Moore), Kenny (JD McCrary), Lynn (Sanai Victoria), Terrance (Anthony O. Dalton) and Kendrick (Matthew Law) will be joining the cast as series regulars. Calvin Payne (Lance Gross), CJ Payne (Allen Payne), Janine Payne (Demetria McKinney), Malik Payne (Doc Shaw) and Jazmine Payne (China Anne McClain) did not return as series regulars, but they will be back as recurring cast members. Claretha Jenkins (Denise Burse) and Miranda Lucas-Payne (Keisha Knight Pulliam) did not return at all. ==Series overview== ==Episodes== ===Season 1 (2018)=== * LaVan Davis and Cassi Davis appeared in all the episodes. * Jackée Harry was absent for ten episodes. * Stephanie Charles was absent for five episodes. * Markice Moore was absent for thirteen episodes. * JD McCrary, Sanai Victoria and Matthew Law was absent for seventeen episodes. * Anthony O. Dalton was absent for twenty-two episodes. * Lance Gross, Allen Payne, Demetria McKinney, Doc Shaw and China Anne McClain makes a guest appearance in three episodes. ===Season 2 (2019)=== ==Other websites== * Category:American television spin- offs Category:2018 American television series debuts Category:2018 American television series endings Category:2010s American sitcoms",
 "title": "The Paynes"
}