{
 "id": "66875",
 "text": "The Most Excellent Order of the British Empire (MBE) is one of the British orders of chivalry. It is the newest order, created on June 4, 1917, by King George V. == Classes == The order is cut into two parts, civil and military. Both parts have five classes or ranks. In order, from highest to lowest, these are: * Knight or Dame Grand Cross (GBE) * Knight or Dame Commander (KBE or DBE) * Commander (CBE) * Officer (OBE) * Member (MBE) Only the two highest ranks are knighthoods, and allow the holder to call themselves 'Sir' (male) or 'Dame' (female). If the person is not a citizen of a country where the King is Head of State, the award is called honorary, and the holder cannot use the title before their name. For instance, Terry Wogan became a British citizen and was therefore called Sir Terry Wogan, but Bob Geldof is still an Irish citizen, and is therefore not \"Sir Bob\". He can, however, style himself \"Bob Geldof KBE\". The British Empire Medal (BEM) was restarted in 2012, but only in the civil group. Although the BEM it is the newest British order of chivalry, it has more members than any other. == History == King George V wanted to be able to honour the thousands of people who helped to win the First World War, but were not soldiers. This Order of Knighthood has a more democratic character than the exclusive Order of the Bath or Saint Michael and Saint George, and in its early days was not held in high esteem. This changed over the years. In 1965 Harold Wilson honoured Violet Carson and the Beatles. He was accused of having debased and cheapened the honours system. == Structure == The British monarch is Sovereign of the Order and appoints all other members of the Order but only on the advice of the Government. The next-most senior member is the Grand Master. There have been four: *Edward, Prince of Wales (1917–1936) (later called King Edward VIII and then the Duke of Windsor) *Queen Mary (1936–1953) * Prince Philip, Duke of Edinburgh (1953–2021), Queen Elizabeth II's husband * Queen Camilla (2024–), King Charles III's wife The order's rules, called statutes, say that the Order can only have 100 Knights and Dames Grand Cross, 845 Knights and Dames Commander, and 8960 Commanders, but there is no limit to the number of members of the Officers and Members but no more than 858 Officers and 1464 Members may be appointed per year. Appointments are made on the advice of the governments of the United Kingdom and some Commonwealth realms. Some jobs are usually rewarded with the Order. Usually female judges of the High Court of England and Wales are created Dames Commander after appointment. Male judges are not, because they are usually made Knights Bachelor instead. == Officials and Knights and Dames Grand Cross == Sovereign: Charles III Grand Master: Queen Camilla Current Knights and Dames Grand Cross # Sir Christopher Leaver GBE (1981) # Sir Anthony Jolliffe GBE (1982) # Sir David Harcourt-Smith GBE KCB (1989) # Sir Alexander Graham GBE (1990) # Sir Patrick Hine GCB GBE (1991) # Sir Brian Jenkins GBE (1991) # Sir Bill Wratten GBE CB (1998) # The Lord Rothschild OM GBE CVO (1998) # Sir Stephen Brown GBE (1999) # Sir Anthony Bagnall GBE KCB (2002) # Sir Michael Sydney Perry GBE (2002) # Sir Ronnie Flanagan GBE (2002) # The Baroness Butler-Sloss GBE PC (2005) # Sir David Cooksey GBE (2007) # Sir Timothy Granville-Chapman GBE KCB (2011) # The Lord King of Lothbury KG GBE (2011) # Sir John Parker GBE (2012) # The Baroness Hayman GBE PC (2012) # Sir Keith Mills GBE (2013) # Sir John Bell GBE FRS (2015) # The Lord Peach GBE KCB (2016) # Sir Ian Wood KT GBE (2016) # Sir Cyril Chantler GBE (2017) # Sir Keith Peters GBE (2018) # Sir Craig Reedie GBE (2018) # Sir Christopher Greenwood GBE CMG KC (2018) # The Lady Higgins GBE KC (2019) # Sir Michael Burton GBE KC (2019) # The Earl Howe GBE PC (2021) # Dame Sue Ion GBE FRS (2022) # Sir Partha Dasgupta GBE FRS (2023) # Dame Hermione Lee GBE (2023) # Sir Bill Beaumont GBE (2024) # The Baroness Beckett GBE PC (2024) # Dame Carol Black GBE (2024) # Sir James McDonald GBE (2024) # Sir Ridley Scott GBE (2024) # Dame Jenny Abramsky GBE (2024) # The Lord Etherton GBE PC (2024) Officers Like the orders of chivalry, this order has six officials: # Prelate - The Right Rev. and Right Hon. Dame Sarah Mullally DBE, Bishop of London #Dean - The Very Rev. Andrew Tremlett, Dean of St Paul's Cathedral (The Dean of St Paul's always holds this office). # Secretary - Stephen Segrave # Registrar - Simon Case CVO, Cabinet Secretary # King of Arms - Sir Robert Fulton KBE # Lady Usher of the Purple Rod - Dame Amelia Fawcett DBE CVO. Many years ago the ushers helped to organise royal events, now only the usher of the Order of the Garter has any official duties. == Revocation == Anyone who behaves in a way that might bring the order into disrepute, may have his or her award taken away. * 1921: Cecil Malone was stripped of his OBE (awarded 1919) following his conviction under the Defence of the Realm (Acquisition of Land) Act 1920. * 1940: Vidkun Quisling was stripped of his CBE (awarded 1929) following his work with Nazi Germany in the occupation of Norway. * 1949: Man Wai Wong was stripped of his OBE (awarded 1947) following his conviction for outlawry in Malaya. * 1965: Kim Philby was stripped of his OBE (awarded 1946) following his exposure as a spy. * 1975: William Spens was stripped of his MBE (awarded 1954) following his conviction for theft. * 1980: Albert Henry was stripped of his KBE (awarded 1974) following his conviction for election fraud. * 1988: Lester Piggott was stripped of his OBE (awarded 1975) following his conviction for tax fraud. * 2006: Michael Eke was stripped of his MBE (awarded 2003) following his conviction for theft and deception. * 2006: Naseem Hamed was stripped of his MBE (awarded 1999) following his conviction for dangerous driving. John Lennon once criticised military membership in the order, saying: \"Lots of people who complained about us receiving the MBE received theirs for heroism in the war - for killing people. We received ours for entertaining other people. I'd say we deserve ours more.\" ==References==",
 "title": "Order of the British Empire"
}