{
 "id": "669051",
 "text": "Mahira Khan (; born 21 December 1984) is a Pakistani film and television actress. One of the most popular and highest-paid actresses of Pakistan, she is the recipient of several accolades, including seven Lux Style Awards and seven Hum Awards. After working as a video jockey for various television shows, Khan made her acting debut in 2011 with a supporting role in the blockbuster social drama Bol (2011). She then played a troubled wife in the highly successful romantic television drama Humsafar (2011), which won her the Lux Style Awards for Best Television Actress. Khan gained wider recognition for portraying a range of unconventional characters in several highest-rated television series, including the religious drama Shehr-e-Zaat (2012), the biographical romance Sadqay Tumhare (2014), and the romantic drama Bin Roye (2016), all of which earned her several Best Actress awards and nominations. Khan established herself by starring as the female lead in two of Pakistan's top-grossing productions—the 2015 romantic drama Bin Roye and the 2016 coming- of-age musical drama Ho Mann Jahan. Her first project in the Hindi cinema came with the crime thriller Raees (2017), which ranks among the highest-grossing Indian films of all time, and received critical acclaim for portraying a rape victim in the revenge drama Verna (2017), and an aspiring actress in the musical drama Superstar (2019). Following a short hiatus, Khan took on roles in the 2022 androcentric action films, including the top-grossing Quaid-e-Azam Zindabad and The Legend of Maula Jatt, and produced the sports web-series Baarwan Khiladi (2022). In addition to acting, Khan promotes social causes such as women's rights and refugee crisis, and is vocal about issues such as child abuse and rapes. She has worked with UNICEF since 2019 and was appointed as the national and global UNICEF Goodwill Ambassador for Afghan refugees in Pakistan in 2019. She has featured as a host for several television and award shows, and is a prominent celebrity endorser for brands and products. She is guarded about her personal life, which is a subject of media scrutiny. ==Early life and education== Mahira Khan was born on 21 December 1988 into a Pashtun family in Karachi, Sindh, Pakistan. In an online interview with Reham Khan, she said that her parents are Urdu-speaking Pathans. Her father, Hafeez Khan, was born in Delhi during the British Raj, and migrated to Pakistan after the partition of India. She has a younger brother, Hasan Khan, a journalist and entrepreneur. Among schools, she attended the Foundation Public School, from where she completed her A'Level. After graduating from Foundation, she, at the age of seventeen, moved to California, United States, for higher education, where she attended the Santa Monica College. Khan was the first women in her family to go out of the country alone. Though, she later admitted that living in the United States on her own helped her become \"strong and independent.\" Khan then enrolled herself at the University of Southern California for a Master's degree in English literature; during this period, she worked as a part-time cashier at Rite Aid. She described the experience: \"I used to mop floors, clean floors, run the till and shut the store at night.\" However, after completing her first year, Khan decided to pursue her interest to become an actress, and quit her university education and returned to Pakistan. While living in the United States, her friend Ali Askari, introduced her to a reality show director, who selected her for the show Most Wanted, that aired on MTV in 2006. She then featured as a presenter for the Aag TV's reality show Weekends with Mahira (2008). The show proved to be a major hit and became immensely popular among the audience. Her appearance in the show attracted the attention of filmmaker Shoaib Mansoor, who remembered her, and later offered her a role in his film Bol (2011), which she accepted. ==Career== Khan started her career as a VJ. Her first role was in the movie Bol in 2011.\"Mahira Khan: 7 things to know about Humsafar’s pretty Khirad Hussain\" Her first major role came in the drama serial Humsafar, which established her as one of the leading stars in the country. The role earned her the Lux Style Award for Satellite Best TV Actress.\"12th LUX Style Awards: Pakistan entertainment industry's big night\" Later, she went on to win more awards which include Best Actress Awards from Pakistan Media Awards for her role in Shehr-e-Zaat,\"Media awards honour fashion, entertainment stars\"\"10 iconic Pakistani TV dramas you should binge- watch this weekend\" and a Lux Style Award for Best TV Actress, two Hum Awards and a Hum Award nomination for Sadqay Tumhare.\"LSA 2016 winners: The complete list\"\"HUM TV Awards 2015: 'Sadqay Tumhare' a clear winner\" In 2017,she played opposite Shah Rukh Khan in the Bollywood movie Raees.\"Mahira Khan declared sexiest Pakistani woman\"\"Raees star Mahira Khan reacts to ban on Pakistani artists\" ==References== Category:1982 births Category:BBC 100 Women Category:Living people Category:Pakistani actors Category:Pashtun people Category:People from Karachi",
 "title": "Mahira Khan"
}