{
 "id": "669098",
 "text": "Trevor Jay Devall (born November 10, 1972) is a Canadian actor, voice artist, and comedian, known as the voice of Iron Will and additional voices in My Little Pony: Friendship Is Magic. He also voiced Shaw in Open Season: Scared Silly, filling in for Gary Sinise. ==Early life== Trevor was born Trevor Jay Devall in Edmonton, Alberta on November 10, 1972. He is the youngest of five siblings. He was into theatre and did tap, jazz and Polynesian dance as a child. He attended the University of Alberta for drama and directed stage productions, as well as student movies. Trevor moved to Vancouver in 1998 to pursue a movie directing career. While working for a talent agency, he made a demo tape for them and began landing work as a voice actor. ==Career== In March 2015, it was announced Devall would be the voice of Rocket Raccoon in Marvel's animated Guardians of the Galaxy. ===Voiceprint=== Since 2007, Devall produced his own podcast, Voiceprint with Trevor Devall & Guests, where he interviewed fellow Vancouver-based voice actors and answered questions from fans. Each episode featured a different voice actor as the episode guest, though some episodes featured other people in the voice-acting business that may not actually be voice actors themselves; or behind-the-scenes looks at the life of a voice actor. Topics usually included how the guest made it into the voice-acting business, what it is like working in the industry, and the general lifestyle of a voice actor. The series concluded its first season after 36 episodes in December 2013. The second season was announced in the final episode of season 1, as Trevor moves to Los Angeles, California to continue his career and the show. Voiceprint with Trevor Devall & Guests Episode Guest Notes Release Date 1 Sam Vincent Premiere episode July 16, 2007 2 Michael Dobson July 25, 2007 3 Matt Hill August 7, 2007 4 Vic Mignogna Live interview at Animethon in Edmonton. August 14, 2007 5 Kelly Sheridan August 28, 2007 6 Brian Dobson September 12, 2007 7 Brad Swaile October 12, 2007 8 Scott McNeil October 25, 2007 9 Karl Willems & Mike Iske Director & Technician at Ocean Studios November 15, 2007 10 Brian Drummond November 27, 2007 11 Ian Corlett February 20, 2008 12 Tabitha St. Germain March 8, 2008 13 Behind the Toronto Con A day in the life of a voice actor at a convention. Special guest Brian Dobson. March 27, 2008 14 Terry Klassen April 24, 2008 15 Maryke Hendrikse May 22, 2008 16 Colin Murdock September 26, 2008 17 Richard Ian Cox October 17, 2008 18 Lee Tockar December 2, 2008 19 Kirby Morrow December 25, 2008 20 Secret Toy Surprise Podcast Commentary for: Gundam SEED episode 30 \"Flashing Blades\" with Sam Vincent Death Note episode 13 \"Confession\" with Brian Drummond & Brad Swaile. March 2, 2009 21 James Corrigall Director at Ocean Studios. May 12, 2009 22 Cathy Weseluck August 5, 2009 23 Kyle Hebert Live interview at Matsuricon 2009 in Columbus, OH. September 14, 2009 24 Alessandro Juliani November 3, 2009 25 Garry Chalk December 5, 2009 26 Intermission Featuring Sam Vincent, Kirby Morrow, and Gardiner Millar September 8, 2010 27 Chiara Zanni September 23, 2010 28 Paul Dobson December 17, 2010 29 Voltron Force! From Koko Productions Studio during the recording of the final episode of the new Voltron. Featuring the voices of Sam Vincent, Andrew Francis, Ron Halder, Ashleigh Ball, Ty Olsson, Giles Panton, Vincent Tong, Doron Bell Jr., Shannon Chan- Kent, and show producer Jeremy Corray. March 16, 2011 30 Lisa Ann Beley July 1, 2011 31 James Arnold Taylor Recorded in West Hollywood, CA September 21, 2011 32 David Kaye Recorded in West Hollywood, CA November 25, 2011 33 Andrew Francis May 2, 2012 34 Mark Oliver October 1, 2012 35 Andrea Libman February 6, 2013 36 Trevor Devall Season finale; In a reversal of roles, Devall was interviewed by series premiere guest Sam Vincent. December 23, 2013 Voiceprint USA Episode Guest Notes Release Date 1 To be announced Season 2 Premiere, announced at the end of Season 1. To be released ==References== ==Other websites== * Category:1972 births Category:Living people Category:Canadian voice actors Category:Canadian comedians Category:Canadian movie actors Category:Canadian television actors Category:Canadian Christians Category:Actors from Alberta Category:Entertainers from Edmonton",
 "title": "Trevor Devall"
}