{
 "id": "669225",
 "text": "The Pasig River is the main river in Metro Manila that connects Laguna de Bay and Manila Bay. Stretching for , it bisects the Philippine capital of Manila and its surrounding urban areas into northern and southern halves. Its major tributaries are the Marikina River and San Juan River. The total drainage basin of the Pasig River, including the basin of Laguna de Bay, covers . The Pasig River is technically a tidal estuary, as the flow direction depends upon the water level difference between Manila Bay and Laguna de Bay. During the \"dry season\", the water level in Laguna de Bay is low with the river's flow direction dependent on the tides. During the \"rainy season\", when the water level of Laguna de Bay is high, the flow is reversed towards Manila Bay. == Etymology == The river takes its name from the city of Pasig, which is named after the Tagalog word pasig, meaning \"a river that flows into the sea\" or \"the sandy bank of a river\", with the former in reference to the Pasig River's flow from Laguna de Bay towards Manila Bay and out into the South China Sea. == Geography == The Pasig River winds generally northwestward for some from Laguna de Bay, the largest lake in the Philippines, to Manila Bay, in the southern part of the island of Luzon. From the lake, the river runs between the municipalities of Taguig and Taytay, Rizal, before entering Pasig, where its confluence with the Marikina River tributary is known as the Napindan Channel. From the Napindan Channel, the Pasig River flows through the city of Pasig until its confluence with the Taguig River. Onwards, it forms a border between the city of Mandaluyong to the north and the city of Makati to the south. The river then sharply turns northeast, where it has become the border between Mandaluyong and Manila before turning again westward, joining its other major tributary, the San Juan River, and then following a sinuous path through the center of Manila before emptying into Manila Bay. The whole length of the river and most portions of its tributaries lie entirely within Metro Manila, the metropolitan region of the capital. Isla de Convalecencia, the only island dividing the Pasig River, can be found in Manila and is where the Hospicio de San Jose is located. ==Pasig River Lighthouse== Historic lighthouse built in 1846 at the mouth of the Pasig River in San Nicolas, Manila, marking the entrance of the river for vessels cruising Manila Bay. ==Gallery== Image:03328jfLacson_Avenue_Mabini_Bridge_Flyover_Manila_Landmarksfvf_04.jpg|Pasig River at dusk from Mabini Bridge Image:Pasig_River_Esplanade2.jpg|Pasig River Esplanade across the Manila Central Post Office ==References== Category:Rivers of the Philippines",
 "title": "Pasig River"
}