{
 "id": "669303",
 "text": "Katherine Anne Stuart is a Canadian actress and stunt performer. She has guest-starred on television shows as well as appearing in the television movie A Wrinkle in Time. ==Personal life== Stuart was born in Vancouver, British Columbia, and has a younger brother, Ted. She shares the same name as another former child actress who is best known for her role in the independent movie Frog and Wombat. Stuart is best friends with the English actor Steven Webb. ==Filmography== ===Movies=== Year Title Role Notes 1997 Masterminds Melissa Randall 1998 Summer of the Monkeys Daisy Lee 2000 Epicenter Robyn Foster 2001 Speak Angel 2003 X2: X-Men United Kitty Pryde / Shadowcat 2005 The Sisterhood of the Traveling Pants Bunkmate Jo 2006 She's The Man Maria 2016 The Edge of Seventeen Jeannie ===Television=== Year Title Role Notes 1996 Poltergeist: The Legacy Patty Greer Episode: \"Revelations\" 1996 Color Me Perfect Susie TV movie 1997 The Sentinel Gwen Angeloni Episode: \"Private Eyes\" 1997 Survival on the Mountain Molly TV movie 1997 Intensity Young Chyna Shepherd TV movie 1997–1998 Stargate SG-1 Cassandra Fraiser Episodes: \"Singularity\", \"In the Line of Duty\" 1998 The Outer Limits Phoebe Episode: \"Lithia\" 1998 Atomic Dog Heather Yates TV movie 1998–1999 The Crow: Stairway to Heaven Sarah Mohr Main role 1999 The Magician's House Mary Green TV miniseries 1999 Brotherhood of Murder Zillah Craig TV movie 2000 The Magician's House II Mary Green TV miniseries 2000 Mysterious Ways Breanna Episode: \"Crazy\" 2001 Trapped Tiffany Sloan TV movie 2002 Too Young to Be a Dad Francesca Howell TV movie 2003 A Wrinkle In Time Meg Murry TV movie 2004 Dead Like Me J. Monteleone Episode: \"Last Call\" 2005 14 Hours Ronnie Green TV movie 2005 Spirit Bear: The Simon Jackson Story Marcus TV movie 2006 Three Moons Over Milford Jada Reed Episodes: \"Shoot the Moon\", \"Moostruck\" 2006 Augusta, Gone Bridget TV movie 2007 Exes & Ohs Olivia Episodes: \"What Goes Around\", \"Pole Dancing and Other Forms of Therapy\" 2009 The L Word Marie Episodes: \"LMFAO\", \"Last Couple Standing\" 2014 The Returned (U.S. TV series) Abby Giacchino Episodes: 01 \"Camille\", 04 \"Victor\", 05 \"Tony and Adam\", 07 \"Rowan\", 10 \"Peter\" 2014–2016 The 100 Zoe Monroe Recurring role (seasons 1–3) 2018 Altered Carbon Vidaura Recurring role ==Other websites== * *Katie Stuart's LiveJournal ==References== Category:1985 births Category:Actors from Vancouver Category:Canadian child actors Category:Canadian movie actors Category:Canadian television actors Category:Living people",
 "title": "Katie Stuart"
}