{
 "id": "66944",
 "text": "Meg Ryan (born November 19, 1961) is an American actress. She has starred in several romantic comedies, but has also worked in other movie genres, including drama and mystery. == Movies == Year Title Role Notes 1981 Rich and Famous Debby Blake 1983 Amityville 3-D Lisa 1986 Top Gun Carole Bradshaw 1986 Armed and Dangerous Maggie Cavanaugh 1987 Promised Land Beverly \"Bev\" Sykes 1987 Innerspace Lydia Maxwell 1988 D.O.A. Sydney Fuller 1988 The Presidio Donna Caldwell 1989 When Harry Met Sally... Sally Albright 1990 Joe Versus the Volcano DeDe / Angelica Graynamore/ Patricia Graynamore 1991 The Doors Pamela Courson 1992 Prelude to a Kiss Rita Boyle 1993 Sleepless in Seattle Annie Reed 1993 Flesh and Bone Kay Davies 1994 When a Man Loves a Woman Alice Green 1994 I.Q. Catherine Boyd 1995 French Kiss Kate Also producer 1995 Restoration Katharine 1996 Courage Under Fire CPT Karen Emma Walden 1997 Addicted to Love Maggie 1997 Anastasia Anastasia Romanov (voice role) 1998 City of Angels Dr. Maggie Rice 1998 Hurlyburly Bonnie 1998 You've Got Mail Kathleen Kelly 2000 Hanging Up Eve Mozell Marks 2000 Proof of Life Alice Bowman 2001 Kate & Leopold Kate McKay 2003 In the Cut Frannie Avery 2004 Against the Ropes Jackie Kallen 2007 In the Land of Women Sarah Hardwicke 2008 The Deal Deidre Heam 2008 My Mom's New Boyfriend Martha Durand 2008 The Women Mary Haines 2009 Serious Moonlight Louise \"Lou\" 2015 Fan Girl Mary Farrow TV movie 2016 Ithaca Mrs. Kate Macauley Also director/producer == Television work == * One of the Boys (1982) (canceled after 13 episodes) * As the World Turns (cast member from 1982-1984) * Wildside (1985) (canceled after 6 episodes) * Captain Planet and the Planeteers (member from 1990-1991) (voice) * The Simpsons (Voice of Stacy Swanson) == References == == Other websites == * * Meg Ryan Info * Parkinson interview part 1 * Parkinson interview part 2 * Category:Actors from Fairfield, Connecticut Category:American movie actors Category:American movie producers Category:American television actors Category:Golden Globe Award winning actors Category:1961 births Category:Living people",
 "title": "Meg Ryan"
}