{
 "id": "66940",
 "text": "Helen Elizabeth Hunt (born June 15, 1963) is an American actress. She has won the Emmy, Golden Globe and Academy Awards. She is best known for her role in the television sitcom Mad About You. == Awards == Hunt has been given many awards in her career. In 1998 she became one of only two actresses (the other is Helen Mirren) to win a Golden Globe Award, an Academy Award and an Emmy Award in the same year. She is the only actress to win four consecutive Emmys and to win four Blockbuster Entertainment Awards. Academy Award * 1998 Best Actress in As Good as It Gets Emmy Award * 1996 Outstanding Lead Actress in Mad About You * 1997 Outstanding Lead Actress in Mad About You * 1998 Outstanding Lead Actress in Mad About You * 1999 Outstanding Lead Actress in Mad About You Golden Globe Award * 1994 Best Performance by an Actress in Mad About You * 1995 Best Performance by an Actress in Mad About You * 1997 Best Performance by an Actress in Mad About You * 1998 Best Performance by an Actress in As Good as It Gets Screen Actors Guild Award * 1995 Outstanding Performance by a Female Actor in Mad About You * 1998 Outstanding Performance by a Female Actor in As Good as It Gets == Television series == * Amy Prentiss (1974) * The Swiss Family Robinson (1975) * It Takes Two (1982) * The Fitzpatricks * My Life and Times (1991) * Mad About You (1992) * Empire Falls (2005) ==Filmography== Movie roles Year Title Role Notes 1973 Pioneer Woman Sarah 1977 Rollercoaster Tracy Calder 1978 The Bionic Woman-Sanctuary Earth Princess Aura 1984 Trancers Lena 1985 Waiting to Act Tracy 1985 Girls Just Want to Have Fun Lynne Stone 1986 Peggy Sue Got Married Beth Bodell 1987 Project X Teri MacDonald 1987 Mary Voice role, direct-to-video 1988 Princess Henrietta 1988 Stealing Home Hope Wyatt (adult and pregnant) 1988 Miles from Home Jennifer 1989 Next of Kin Jessie Gates 1991 Trancers II Lena Deth 1992 Anna 1992 Only You Clare Enfield 1992 Bob Roberts Rose Pondell 1992 Mr. Saturday Night Annie Wells 1992 Trancers III Lena Direct-to-video 1993 Sexual Healing Rene Short movie 1995 Kiss of Death Bev Kilmartin 1996 Twister Dr. Jo Harding 1997 As Good as It Gets Carol Connelly Won Academy Award for Best Actress 2000 Dr. T & the Women Bree Davis 2000 Pay It Forward Arlene McKinney 2000 Cast Away Kelly Frears 2000 What Women Want Darcy McGuire 2001 One Night at McCool's Truck driver Scenes deleted 2001 Betty Ann Fitzgerald 2004 Mrs. Erlynne 2006 Bobby Samantha Stevens 2007 Then She Found Me April Epner Also co-screenwriter, producer and director 2010 Every Day Jeannie 2011 Soul Surfer Cheri Hamilton 2011 Jock the Hero Dog Jess Voice role 2012 The Sessions Cheryl Cohen-Greene 2013 Decoding Annie Parker Dr. Mary-Claire King 2014 Ride Jackie Also writer, director, and producer 2017 I Love You, Daddy Aura Topher 2018 The Miracle Season Kathy Bresnahan 2018 Candy Jar Kathy 2019 I See You Jackie Harper TBA The Night Clerk Filming == References == == Other websites == * Category:Actors from Culver City, California Category:American Academy Award winning actors Category:American movie actors Category:American television actors Category:American voice actors Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners Category:1963 births Category:Living people",
 "title": "Helen Hunt"
}