{
 "id": "66945",
 "text": "Dennis William Quaid (born April 9, 1954 in Houston, Texas) is an American actor. == Filmography == === Film === Year Title Role Notes 1975 Crazy Mama Bellhop Uncredited 1977 I Never Promised You a Rose Garden Shark, Baseball Pitcher September 30, 1955 Frank 1978 Our Winning Season Paul Morelli The Seniors Alan 1979 Breaking Away Mike 1980 The Long Riders Ed Miller Gorp Mad Grossman 1981 All Night Long Freddie Dupler Caveman Lar The Night the Lights Went Out in Georgia Travis Child Stripes Extra at Graduation Ceremony Uncredited 1983 Tough Enough Art Long Jaws 3-D Michael \"Mike\" Brody The Right Stuff Gordon Cooper 1984 Dreamscape Alex Gardner 1985 Enemy Mine Willis Davidge 1987 The Big Easy Det. Lt. Remy McSwain Innerspace Lt. Tuck Pendleton Suspect Eddie Sanger 1988 D.O.A. Dexter Cornell Everybody's All-American Gavin Grey 1989 Great Balls of Fire! Jerry Lee Lewis 1990 Come See the Paradise Jack McGurn Postcards from the Edge Jack Faulkner 1993 Wilder Napalm Wallace Foudroyant / Biff the Clown Undercover Blues Jefferson \"Jeff\" Blue Flesh and Bone Arlis Sweeney 1994 A Century of Cinema Himself Documentary Wyatt Earp Doc Holliday 1995 Something to Talk About Eddie Bichon 1996 Dragonheart Bowen 1997 Gang Related Joe Doe / William Switchback Frank LaCrosse 1998 The Parent Trap Nicholas \"Nick\" Parker Savior Joshua Rose / Guy Playing by Heart Hugh 1999 Any Given Sunday Jack \"Cap\" Rooney 2000 Frequency Frank Sullivan Traffic Arnie Metzger 2002 The Rookie Jim Morris Far from Heaven Frank Whitaker 2003 Cold Creek Manor Cooper Tilson 2004 The Alamo Sam Houston The Day After Tomorrow Jack Hall In Good Company Dan Foreman Flight of the Phoenix Frank Towns 2005 Yours, Mine & Ours Rear Admiral Frank Beardsley, USCG 2006 American Dreamz President Joseph Staton 2007 Battle for Terra Roven Voice role 2008 Vantage Point Thomas Barnes Smart People Lawrence Wetherhold The Express: The Ernie Davis Story Ben Schwartzwalder 2009 Horsemen Aidan Breslin G.I. Joe: The Rise of Cobra General Clayton M. Abernathy / Hawk Pandorum Payton 2010 Legion Bob Hanson 2011 Soul Surfer Tom Hamilton Footloose Rev. Shaw Moore 2012 Beneath the Darkness Vaughn Ely What to Expect When You're Expecting Ramsey The Words Clay Hammond Playing for Keeps Carl King At Any Price Henry Whipple 2013 Movie 43 Charlie Wessler Segment: \"The Pitch\" 2015 Truth Col. Roger Charles 2017 A Dog's Purpose Adult Ethan Montgomery 2018 I Can Only Imagine Arthur Millard Kin Hal Solinski The Pretenders Joe 2019 The Intruder Charlie Peck A Dog's Journey Ethan Montgomery Midway Vice Admiral William \"Bull\" Halsey 2021 Born a Champion Mason Blue Miracle Captain Wade Malloy American Underdog Dick Vermeil 2022 The Tiger Rising Beauchamp Strange World Jaeger Clade Voice role 2023 The Long Game Frank Mitchell On a Wing and a Prayer Doug White Strays Birdwatcher The Hill James Hill 2024 The Substance Harvey Reagan Ronald Reagan Sovereign Post-production War Machine Filming === Television === Year Title Role Notes 1977 Baretta Scott Martin Episode: \"The Sky Is Falling\" 1978 Are You in the House Alone? Phil Lawver Television film 1979 Amateur Night at the Dixie Bar and Grill Roy Television film 1981 Bill Barry Morrow Television film 1982 Johnny Belinda Kyle Hager Television film 1983 Bill: On His Own Barry Morrow Television film 1997 Sesame Street: Kids' Guide to Life Uncle Tommy Episode: \"Telling the Truth\" Muppets Tonight Himself Episode: \"Dennis Quaid\" 1998 Everything that Rises Jim Clay Television film; also director 2001 Dinner with Friends Gabe Television film 2009 SpongeBob SquarePants Grandpa Redbeard Voice role; Episode: \"Grandpappy the Pirate\" 2010 The Special Relationship Bill Clinton Television film Chasing Zero: Winning the War on Healthcare Harm Himself/narrator Documentary 2012–2013 Vegas Sheriff Ralph Lamb 21 episodes; also executive producer 2015 Inside Amy Schumer Chief / Judge 2 episodes Drunk History Lucky Luciano Episode: \"Las Vegas\" 2015–2016 The Art of More Samuel Brukner 20 episodes 2017 Workaholics Ted Murphy Episode: \"Weed the People\" Fortitude Michael Lennox 10 episodes 2019 Goliath Wade Blackwood Main cast; season 3 Merry Happy Whatever Don Quinn Lead role 2021 Pawn Stars Himself Episode: \"Pawn Stars and Movie Stars\" 2023 Full Circle Jeff McCusker Miniseries Lawmen: Bass Reeves Sherrill Lynn Main role 2025 Happy Face Keith Hunter Jesperson / Happy Face Killer Main role === Theatre === Year Title Role Playwright Venue 1983 True West Austin Sam Shepard Cherry Lane Theatre, Off-Broadway == References == == Other websites == * * D.Q. and the sharks Dennis Quaid's Band Category:1954 births Category:Living people Category:Actors from Houston Category:American movie actors Category:People with anorexia",
 "title": "Dennis Quaid"
}