{
 "id": "66957",
 "text": "Matilda is a classic children’s novel by Roald Dahl, published in 1988 by Jonathan Cape and adapted into a movie in 1996. The story is about a brilliant five-year-old girl with extraordinary powers, who uses her genius to take revenge on her abusive parents, and later to fight back against the tyrannical principal of her school. The majority of the novel focuses on the latter half of her story. ==Plot== Matilda is born to Mr. and Mrs. Wormwood, two willfully cruel, neglectful, simple-minded, and selfish parents that revel in tyranny and resent their daughter’s intelligence, abusing her when not ignoring her. Matilda is raised by the books she reads, and survives by cleverly plotting pranks on her parents they can't trace back to her. On her first day of school, Matilda meets her teacher, Miss Jennifer Honey, a maternal figure whom she forms a close bond with. Miss Honey recognizes Matilda is a prodigy, but is unable to place her in a higher class due to the orders of the school headmistress and main antagonist, Miss Agatha Trunchbull. The only reason Miss Trunchbull refuses to move Matilda up is her disdain for young girls and refusal to acknowledge any child’s brightness. Matilda learns that Miss Trunchbull is a tyrant of a headmistress who attacks and punishes the students and faculty at any excuse, and her behavior is so extreme that no parents will believe anything their children tell them about her. Matilda and her friends are treated to an example of this when they see Miss Trunchbull target a girl on the playground, telling her that her pigtails are disgusting to look at and she'd better chop them off by tomorrow. When the girl protests that her mother likes them, Miss Trunchbull grabs her by her pigtails, lifts her into the air, begins whirling her around like a discus, then throws her far into the air and over the schoolyard fence. Miss Honey’s class is soon given a routine visit by the headmistress, who comes to test the children on their knowledge. Miss Trunchbull singles out Matilda, having heard terrible things about the girl from her parents, and grows slowly frustrated by the fact that Matilda is unshaken and can correctly answer every question the headmistress asks. Then, when attempting to pour a glass of water for herself, Miss Trunchbull suddenly discovers a newt some student snuck into her pitcher, and instantly blames Matilda, threatening to expel her. Matilda is shouted down when she tries to argue, and, simmering with silent fury, stares at the glass with the newt still inside, wishing with all her might for it to tip over and spill onto the headmistress. The glass does appear to move slightly, so Matilda concentrates harder. The glass tips all the way over and the water and newt fly onto Miss Trunchbull, who howls with fear and fury. She tries to blame Matilda again, but the class suddenly rises against her, shouting that Matilda never moved or even got up. Miss Trunchbull shouts back that she is fed up with the lot of them and storms angrily out of the classroom. Matilda, stunned by her newly discovered powers, immediately tries to explain it to Miss Honey. Miss Honey doesn't believe her at first, but when Matilda succeeds in proving it by repeating the trick, Miss Honey is almost too stunned to speak. She eventually suggests that Matilda go home with her after school to discuss this, and Matilda eagerly agrees. When the two arrive at Miss Honey’s house, Matilda is taken aback by how small and poor the residence is. Miss Honey is coaxed into revealing that Miss Trunchbull is the cause of her poverty. Miss Trunchbull is revealed to be Miss Honey’s aunt, who took charge of Miss Honey as a young girl after her father died. Miss Honey’s father’s will was mysteriously lost, so Miss Trunchbull was named the owner of his and Miss Honey’s house and inheritance. Miss Trunchbull forced Miss Honey to live like a slave in her own home as a child. When Miss Honey came of age, Miss Trunchbull forced her to sign over half of all her wages to Miss Trunchbull, causing Miss Honey to have to live with barely enough money to buy groceries. Miss Honey finally managed to find a place of her own that would allow her to pay a very cheap rent, but the house is tiny and has no furniture or bed, and she is forced to go without food for most of her day to pay for it all. Miss Honey tells Matilda that she shouldn't worry about her and tries to reassure her that she is really managing all right, but Matilda becomes determined to find a way to save Miss Honey from the situation. When she goes home, she practices every day with her mysterious mental powers, slowly getting better at making more and more things move on their own by sitting still and concentrating, and preparing a plan. When Miss Trunchbull returns to the class for another testing, Matilda enacts her plan right in the middle of one of Miss Trunchbull’s punishments, stopping her dead in her tracks. A piece of chalk, with Matilda’s help, is writing a threatening message to Miss Trunchbull on the board, a message that appears to be from Miss Honey’s dead father. The message tells Miss Trunchbull to give Miss Honey back her house and her wages, or Miss Honey’s father will come for her. Miss Trunchbull goes white, faints on the spot, and has to be carried to the sick-room by school officials. The class never hears from her again, because Miss Trunchbull never comes back to school. Miss Honey later tells Matilda that her father’s will was found, declaring her the owner of his house, and that Miss Trunchbull had signed Miss Honey’s wages back to her before disappearing mysteriously. Matilda is moved into a higher class, and Mr Tribly eventually becomes Headmistress. Matilda is happy with the challenge, but soon finds that she's lost the power to move things with her mind. Miss Honey guesses that the cause could be that Matilda had nothing to use the strength of her mind on when stuck in a first grade class, which allowed her to use that extra mental power to move objects. But now that Matilda’s brilliant mind is being challenged every day in her new class, she has no extra power left over to affect the physical world. In the last chapter, Matilda finds her family hurriedly packing their things. Mr. Wormwood tells Matilda that he's been caught by the police for scamming people by selling broken cars, and that they have to move immediately. Matilda flies to Miss Honey’s house, begging her to adopt her instead so they can stay together. Miss Honey runs to ask Matilda’s parents for permission, and the Wormwood family agrees, carelessly. The story ends with Matilda jumping into Miss Honey’s arms as they watch the Wormwood car drive off and disappear forever into the distance. Category:1988 books Category:English children's books",
 "title": "Matilda (novel)"
}