{
 "id": "669793",
 "text": "The Prime Minister of Georgia is the most senior minister within the Cabinet of Georgia. He is appointed by the President of Georgia. Georgia has had 42 Prime Ministers since 1918. ==Democratic Republic of Georgia (1918–1921)== :Prime ministers Picture Name (Birth–Death) Began office Left office Party Title(s) 1 Noe Ramishvili (1881–1930) 26 May 1918 24 June 1918 Social Democratic Party of Georgia Chairman of Government 2 Noe Zhordania (1868–1953) 24 June 1918 18 March 1921 Social Democratic Party of Georgia Chairman of Government ==Georgian Soviet Socialist Republic (1921–1991)== Picture Name (Birth–Death) Began office Left office Party Title(s) 1 Polikarp Mdivani (1887–1937) 7 March 1922 April 1922 Communist Party of Georgia Chairmen of the Council of People's Commissars 2 Sergey Kavtaradze (1885–1971) April 1922 January 1923 Communist Party of Georgia Chairmen of the Council of People's Commissars 3 Shalva Eliava (1883–1937) January 1923 June 1927 Communist Party of Georgia Chairmen of the Council of People's Commissars 4 Lavrenty Kartvelishvili (1890–1938) June 1927 June 1929 Communist Party of Georgia Chairmen of the Council of People's Commissars 5 Filipp Makharadze (1886–1941) June 1929 January 1931 Communist Party of Georgia Chairmen of the Council of People's Commissars 6 Levan Sukhishvili January 1931 22 September 1931 Communist Party of Georgia Chairmen of the Council of People's Commissars 7 German Mgaloblishvili (?–1937) 22 September 1931 9 July 1937 (executed) Communist Party of Georgia Chairmen of the Council of People's Commissars 8 Valerian Bakradze (1901–1971) 9 July 1937 15 April 1946 Communist Party of Georgia Chairmen of the Council of People's Commissars 8 Valerian Bakradze (1901–1971) 15 April 1946 December 1946 Communist Party of Georgia Chairmen of the Council of Ministers 9 Zakhary Chkhubianishvili (1903–?) December 1946 6 April 1952 Communist Party of Georgia Chairmen of the Council of Ministers 10 Zakhary Ketskhoveli (1902–1970) 6 April 1952 16 April 1953 Communist Party of Georgia Chairmen of the Council of Ministers 11 Valerian Bakradze (1901–1971) 16 April 1953 20 September 1953 Communist Party of Georgia Chairmen of the Council of Ministers 12 Givi Javakhishvili (1912–1985) 21 September 1953 17 December 1975 Communist Party of Georgia Chairmen of the Council of Ministers 13 (1928–1982) 17 December 1975 5 June 1982 Communist Party of Georgia Chairmen of the Council of Ministers 14 (1927–2009) 2 July 1982 12 April 1986 Communist Party of Georgia Chairmen of the Council of Ministers 15 (1933–2004) 12 April 1986 29 March 1989 Communist Party of Georgia Chairmen of the Council of Ministers 16 (1930–2007) 29 March 1989 14 April 1989 Communist Party of Georgia Chairmen of the Council of Ministers 17 (1935–) 14 April 1989 15 November 1990 Communist Party of Georgia Chairmen of the Council of Ministers 18 Tengiz Sigua (1934–2020) 15 November 1990 18 August 1991 Independent Chairmen of the Council of Ministers ==Georgia (since 1991)== :Prime ministers No. Name (Born–Died) Picture Took Office Left Office Party — Murman Omanidze (1938–2020) (acting) 18 August 1991 23 August 1991 Independent 1 Besarion Gugushvili (1945–) 23 August 1991 6 January 1992Prime Minister of the rebel government at Zugdidi 24 September—6 November 1993 Round Table—Free Georgia 2 Tengiz Sigua (1934–2020) 6 January 1992 6 August 1993 Independent — Eduard Shevardnadze (1928–2014) (acting) 6 August 1993 20 August 1993 Independent ==List of prime ministers (since 1995)== ===Georgia (1995–present)=== No. Name (Born–Died) Picture Took Office Left Office Party 1 Niko Lekishvili (1947–) 8 December 1995 26 July 1998 Union of Citizens of Georgia 2 Vazha Lortkipanidze (1949–) 31 July 1998 11 May 2000 Union of Citizens of Georgia 3 Giorgi Arsenishvili (1942–2010) 11 May 2000 21 December 2001 Union of Citizens of Georgia 4 Avtandil Jorbenadze (1951–) 21 December 2001 7 November 2003 Union of Citizens of Georgia 5 Zurab Zhvania (1963–2005) 7 November 2003 17 February 2004 United National Movement :Prime ministers No. Name (Born–Died) Picture Took Office Left Office Party 4 Zurab Zhvania (1963–2005) 17 February 2004 3 February 2005 United National Movement — Mikheil Saakashvili (1967–) (acting)Saakashvili took responsibilities as Prime minister (in Russian) 3 February 2005 17 February 2005 United National Movement 5 Zurab Noghaideli (1964–) 17 February 2005 16 November 2007 United National Movement — Giorgi Baramidze (1968–) (acting)Acting Prime minister of Georgia criticized peacekeepers, CIS and Russia (in Russian) 16 November 2007 22 November 2007 United National Movement 6 Lado Gurgenidze (1970–) 22 November 2007 1 November 2008 Independent 7 Grigol Mgaloblishvili (1973–) 1 November 2008 6 February 2009 Independent 8 Nika Gilauri (1975–) 6 February 2009 4 July 2012 Independent 9 Vano Merabishvili (1968–) 4 July 2012 25 October 2012 United National Movement 10 Bidzina Ivanishvili (1956–) 25 October 2012 20 November 2013 Georgian Dream 11 Irakli Garibashvili (1982–) 20 November 2013 30 December 2015 Georgian Dream 12 Giorgi Kvirikashvili (1967–) 30 December 2015 13 June 2018 Georgian Dream 13 Mamuka Bakhtadze (1982–) 20 June 2018 2 September 2019 Georgian Dream 14 Giorgi Gakharia (1975–) 8 September 2019 18 February 2021 Georgian Dream 15 Irakli Garibashvili (1982–) 22 February 2021 29 January 2024 Georgian Dream 16 Irakli Kobakhidze (1978–) 8 February 2024 present Georgian Dream ==References== *",
 "title": "Prime Minister of Georgia"
}