{
 "id": "669816",
 "text": "is a Japanese contemporary artist and writer. She is well known for her repeating dot patterns in her art. She uses a variety of media. These include painting, drawing, sculpture, movies, performance and immersive installation. Her art ranges from works on paper featuring intense semi-abstract imagery, to soft sculpture known as ‘Accumulations’, to her ‘Infinity Net’ paintings. These paintings are made up of carefully repeated arcs of paint built up into large patterns. Since 1977, Kusama has lived voluntarily in a psychiatric institution. Much of her work has been marked with obsessiveness and a desire to escape from psychological trauma. In an attempt to share her experiences, she creates installations that immerse the viewer in her obsessive vision of endless dots and nets or infinitely mirrored space. ==Biography== Yayoi Kusama was born in 1929 in Matsumoto, Nagano. She started drawing pictures with a motif of polka dots with watercolors, pastel and oil paints at 10 years old. She entered art university in Kyoto. Afterwards, she went to the US to study art. She did intense performances whose name were “happening” there to protest wars. In 1968. her movie won the prize of the 4th Belgian International Short Film Festival. She also had exhibitions held around the world. A documentary movie about her was released in 2019. It received high evaluations. ==Sickness== Kusama suffers from hallucinations. Her field of vision is covered with polka dots, and she says that flowers speak to her. She has had schizophrenia from childhood. She decided to paint to run away from the hallucinations and the fear of death. Her works reflect what she sees. ==Art works== All of Kusama's works are expensive. Kusama became the most expensive living female artist at auction when White No. 28 (1960) from her signature Infinity Nets series sold for $7.1 million at a 2014 Christie's auction.Kelly Crow (12 November 2014), Christie’s Makes History With $853 Million Sale of Contemporary Art – Andy Warhol’s ‘Triple Elvis [Ferus Type]’ Sells for $82 Million The Wall Street Journal. ==References== Category:1929 births Category:Japanese artists Category:Japanese writers Category:Sculptors Category:People from Nagano Prefecture Category:Living people",
 "title": "Yayoi Kusama"
}