{
 "id": "66993",
 "text": "Edward \"Eddie\" Regan Murphy (born April 3, 1961) is an American actor, comedian, producer, singer and writer. He won the Golden Globe Award in 2006 and was nominated for an Academy Award in 2002. He has received Golden Globe Award nominations for best actor in a comedy or musical for his performances in Beverly Hills Cop, Beverly Hills Cop II, Beverly Hills Cop III, Trading Places, and The Nutty Professor. In 2007, he won the Golden Globe for Best Supporting Actor for his portrayal of soul singer James \"Thunder\" Early in Dreamgirls, and received a nomination for the Academy Award for Best Supporting Actor for the same role. His work as a voice actor includes Thurgood Stubbs in The PJs, Donkey in the Shrek series and the dragon Mushu in Disney's Mulan. In some of his films, he plays multiple roles in addition to his main character, intended as a tribute to one of his idols Peter Sellers, who played multiple roles in Dr. Strangelove and elsewhere. Murphy has played multiple roles in Coming to America, Wes Craven's Vampire In Brooklyn, the Nutty Professor films (where he played the title role in two incarnations, plus his father, brother, mother and grandmother), Bowfinger and 2007's Norbit. His brother was comedian and screenwriter Charlie Murphy, who wrote the screenplay for Norbit and Vampire in Brooklyn. He was a usual member on Saturday Night Live from 1980 to 1984, and has worked as a stand-up comedian. He has worked a little as a singer too, having a number 87 on the uk singles chart and number 2 on the billboard hot 100 with Party All The Time www.chartstats.com and a uk singles chart number 64 with I Was A King.www.chartstats.com ==Career== In 1992 Murphy acted in the music video for Michael Jackson's single \"Remember the Time\". In 1993 Murphy released a song with Michael Jackson called \"Whatzupwitu\". It was voted by MTV viewers in 1999 as the third worst music video of all time. == Filmography == Title Year Role Director Notes 48 Hrs. 1982 Reggie Hammond Walter Hill Nominated—Golden Globe Award for New Star of the Year – Actor Trading Places 1983 Billy Ray Valentine John Landis NAACP Image Award for Outstanding Actor in a Motion Picture Nominated—Golden Globe Award for Best Actor – Motion Picture Musical or Comedy Best Defense 1984 Lieutenant T.M. Landry Willard Huyck Beverly Hills Cop Detective Axel Foley Martin Brest Nominated—Golden Globe Award for Best Actor – Motion Picture Musical or Comedy 1986 Chandler Jarrell Michael Ritchie Beverly Hills Cop II 1987 Detective Axel Foley Tony Scott Also writer (story) Eddie Murphy: Raw Himself Robert Townsend Stand-up film Coming to America 1988 Prince Akeem Joffer / Clarence / Randy Watson / Saul John Landis Also writer (story) Harlem Nights 1989 Vernest \"Quick\" Brown Himself Directorial debut Also writer and executive producer Golden Raspberry Award for Worst Screenplay Nominated—Golden Raspberry Award for Worst Director Another 48 Hrs. 1990 Reggie Hammond Walter Hill Also writer (story) Boomerang 1992 Marcus Graham Reginald Hudlin Also writer (story) Nominated—MTV Movie Award for Best Comedic Performance Thomas Jefferson Johnson Jonathan Lynn Beverly Hills Cop III 1994 Detective Axel Foley John Landis Vampire in Brooklyn 1995 Maximillian / Preacher Pauly / Guido Wes Craven Also writer (story) and producer 1996 Professor Sherman Klump / Buddy Love Lance Perkins / Cletus 'Papa' Klump Anna Pearl 'Mama' Jensen Klump Ida Mae 'Granny' Jensen / Ernie Klump, Sr. Tom Shadyac Blockbuster Entertainment Award for Favorite Actor – Comedy Los Angeles Film Critics Association Award for Best Actor (2nd place) Saturn Award for Best Actor National Society of Film Critics Award for Best Actor Nominated—Golden Globe Award for Best Actor – Motion Picture Musical or Comedy Nominated—MTV Movie Award for Best Comedic Performance Nominated—MTV Movie Award for Best Male Performance Nominated—NAACP Image Award for Outstanding Actor in a Motion Picture Nominated—Satellite Award for Best Actor – Motion Picture Musical or Comedy Metro 1997 Insp. Scott Roper Thomas Carter Mulan 1998 Mushu Voice role; Murphy's first animated film role Nominated—OFTA Film Award Best Family Actor Online Film & Television Association 1999 Dr. Dolittle Dr. John Dolittle Betty Thomas Holy Man G Stephen Herek Life 1999 Rayford \"Ray\" Gibson Ted Demme Also writer (story) and producer. Bowfinger Kit Ramsey / Jiffrenson \"Jiff\" Ramsey Frank Oz Nominated—Black Reel Award: Best Actor Nominated—Blockbuster Entertainment Award for Favorite Comedy Team (shared with Steve Martin) Nutty Professor II: The Klumps 2000 Professor Sherman Klump / Buddy Love Lance Perkins / Cletus 'Papa' Klump Anna Pearl 'Mama' Jensen Klump Ida Mae 'Granny' Jensen / Ernie Klump, Sr. / Young Cletus 'Papa' Klump Peter Segal Also executive producer Nominated—Satellite Award for Best Actor – Motion Picture Musical or Comedy Shrek 2001 Donkey Voice role Annie Award for Outstanding Individual Achievement for Voice Acting by a Male Performer in an Animated Feature Production Nominated—BAFTA Award for Best Actor in a Supporting Role Nominated—Black Reel Award: Best Supporting Actor. Dr. Dolittle 2 Dr. John Dolittle Steve Carr Showtime 2002 Officer Trey Sellers Tom Dey Nominated—Golden Raspberry Award for Worst Actor Nominated—Golden Raspberry Award for Worst Screen Couple Pluto Nash / Rex Crater Ron Underwood I Spy Kelly Robinson Betty Thomas Daddy Day Care 2003 Charles \"Charlie\" Hinton Steve Carr Jim Evers Rob Minkoff Shrek 2 2004 Donkey Voice role Dreamgirls 2006 James 'Thunder' Early Bill Condon Broadcast Film Critics Association Award for Best Supporting Actor Central Ohio Film Critics Association for Best Supporting Actor Golden Globe Award for Best Supporting Actor – Motion Picture Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role Nominated—Academy Award for Best Supporting Actor Nominated—Black Reel Award: Best Supporting Actor Nominated—Chicago Film Critics Association Award for Best Supporting Actor Nominated—NAACP Image Award for Outstanding Supporting Actor in a Motion Picture Nominated—Online Film Critics Society Award for Best Supporting Actor Nominated—Saturn Award for Best Supporting Actor Nominated—Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Norbit 2007 Norbit Rice / Rasputia Latimore-Rice / Mr. Wong Brian Robbins Also writer and producer Golden Raspberry Award for Worst Actor Golden Raspberry Award for Worst Supporting Actor Golden Raspberry Award for Worst Supporting Actress Nominated—Golden Raspberry Award for Worst Screen Couple Nominated—Golden Raspberry Award for Worst Screenplay Nominated—Golden Raspberry Award for Worst Picture Shrek the Third Donkey Voice role Kids' Choice Award for Favorite Voice from an Animated Movie Meet Dave 2008 Starship Dave Ming-Chang (Spacecraft), Captain Brian Robbins Nominated—Golden Raspberry Award for Worst Actor Nominated—Golden Raspberry Award for Worst Screen Couple Imagine That 2009 Evan Danielson Karey Kirkpatrick Nominated—Golden Raspberry Award for Worst Actor Shrek Forever After 2010 Donkey Mike Mitchell Voice role Kids' Choice Award for Favorite Voice from an Animated Movie Tower Heist 2011 Darnell (\"Slide\") Davis Brett Ratner Nominated—NAACP Image Award for Outstanding Actor in a Motion Picture 2012 Jack McCall Brian Robbins Nominated—Golden Raspberry Award for Worst Actor Mr. Church 2016 Henry Joseph Church Bruce Beresford Dolemite Is My Name 2019 Rudy Ray Moore Craig Brewer Also producer Coming 2 America 2020 Prince Akeem Joffer / Randy Watson Also writer (story) Filming ==Awards and nominations== Award Year Category Work Outcome Academy Awards 2007 Best Supporting Actor Dreamgirls Annie Awards 1999 Outstanding Individual Achievement for Voice Acting in an Animated Television Production The PJs Annie Awards 2001 Outstanding Individual Achievement for Voice Acting by a Male Performer in an Animated Feature Production Shrek Annie Awards 2008 Best Voice Acting in an Animated Television Production Shrek the Halls BAFTA Awards 2002 Actor in a Supporting Role Shrek Black Reel Awards 2000 Best Actor in a Motion Picture Bowfinger Black Reel Awards 2002 Actor in a Supporting Role Shrek Black Reel Awards 2007 Actor in a Supporting Role Dreamgirls Broadcast Film Critics Association Awards 2007 Best Supporting Actor Dreamgirls Central Ohio Film Critics Association 2007 Best Supporting Actor Dreamgirls Chicago Film Critics Association Awards 2007 Best Supporting Actor Dreamgirls Emmy Awards 1983 Outstanding Supporting Actor in a Comedy, Variety or Music Series Saturday Night Live Emmy Awards 1984 Outstanding Individual Performance in a Variety or Music Program Saturday Night Live Emmy Awards 1984 Outstanding Writing for a Variety or Music Program Saturday Night Live Emmy Awards 1999 Outstanding Animated Program The PJs for \"He's Gotta Have It\" Golden Globe Awards 1983 New Star of the Year (Actor) 48 Hrs. Golden Globe Awards 1984 Actor in a Leading Role (Musical or Comedy) Trading Places Golden Globe Awards 1985 Actor in a Leading Role (Musical or Comedy) Beverly Hills Cop Golden Globe Awards 1997 Actor in a Leading Role (Musical or Comedy) The Nutty Professor Golden Globe Awards 2007 Best Supporting Actor – Motion Picture Dreamgirls Golden Raspberry Awards 1990 Worst Director Harlem Nights Golden Raspberry Awards 1990 Worst Screenplay Harlem Nights Golden Raspberry Awards 2003 Worst Actor The Adventures of Pluto Nash Golden Raspberry Awards 2003 Worst Screen Combo The Adventures of Pluto Nash; Showtime; I Spy Golden Raspberry Awards 2008 Worst Picture Norbit Golden Raspberry Awards 2008 Worst Actor Norbit Golden Raspberry Awards 2008 Worst Supporting Actor Norbit Golden Raspberry Awards 2008 Worst Supporting Actress Norbit Golden Raspberry Awards 2008 Worst Screen Combo Norbit Golden Raspberry Awards 2008 Worst Screenplay Norbit Golden Raspberry Awards 2009 Worst Actor Meet Dave Golden Raspberry Awards 2009 Worst Screen Combo Meet Dave Golden Raspberry Awards 2010 Worst Actor Imagine That Golden Raspberry Awards 2010 Worst Actor of the Decade N/A Golden Raspberry Awards 2013 Worst Actor A Thousand Words Grammy Awards 1983 Best Comedy Album Eddie Murphy Grammy Awards 1984 Best Comedy Album Eddie Murphy: Comedian Kids Choice Awards 1988 Favorite Movie Actor Beverly Hills Cop II Kids Choice Awards 2005 Favorite Voice from an Animated Film Shrek 2 Kids Choice Awards 2008 Favorite Voice from an Animated Film Shrek the Third Kids Choice Awards 2011 Best Voice from an Animated Film Shrek Forever After NAACP Image Awards 1997 Outstanding Lead Actor in a Motion Picture The Nutty Professor NAACP Image Awards 2007 Actor in a Supporting Role Dreamgirls National Society of Film Critics Awards 1997 Best Actor The Nutty Professor Online Film Critics Society Awards 2007 Best Supporting Actor Dreamgirls Satellite Awards 1996 Best Actor – Motion Picture Musical or Comedy The Nutty Professor Satellite Awards 2001 Best Actor – Motion Picture Musical or Comedy Nutty Professor II: The Klumps Saturn Awards 1997 Best Actor The Nutty Professor Saturn Awards 2002 Best Supporting Actor Shrek Screen Actors Guild Awards 2007 Actor in a Supporting Role Dreamgirls Screen Actors Guild Awards 2007 Cast in a Motion Picture Dreamgirls == References == == Other websites == * * * Eddie Murphy on Discogs * Eddie Murphy Media Site * Maxim Rated Top SNL performer * Eddie Murphy.co.uk Category:1961 births Category:Living people Category:Actors from New York City Category:African-American comedians Category:African-American movie actors Category:African-American movie producers Category:African-American screenwriters Category:African-American television actors Category:African-American voice actors Category:American stand-up comedians Category:American television producers Category:American television writers Category:Comedians from New York City Category:Golden Globe Award winning actors Category:Movie producers from New York City Category:Screen Actors Guild Award winners Category:Screenwriters from New York City",
 "title": "Eddie Murphy"
}