{
 "id": "670028",
 "text": "Marie Avgeropoulos (; born 17 June 1986) is a Canadian actress and model. She is best known for her role as Octavia Blake on The CW's post-apocalyptic science fiction television series The 100 (2014–present). ==Early life== Avgeropoulos was born on 17 June 1986 in Thunder Bay, Ontario. She grew up fishing, hunting and camping, spending most of her free time outdoors. Avgeropoulos started playing drums when she was 16. After studying broadcast journalism for two years in her hometown, Avgeropoulos moved to Europe. Several months later, she came back to Canada and settled in Vancouver. ==Career== One of her friends invited her for a casting call in Vancouver, which happened to be looking for drummers. A talent agent recognized her talent and invited her to appear in various national commercials. She caught the attention of director Chris Columbus. He hired Avgeropoulos for I Love You, Beth Cooper, which became her first feature film role. Her appearance in the film gave her the opportunities to star in more films and television shows. In 2010, Avgeropoulos was cast as Kim Rhodes in the film Hunt to Kill, which became her break-out role. Early in 2013, Avgeropoulos made her break- out in television after being cast for a recurring role in The CW's Cult. However, the series failed to attract viewers and after episode 7, the show was cancelled. The remaining six episodes of the show were broadcast later in the summer. Not long after the show ended, The CW cast her as one of the main characters in their new sci-fi, The 100, to portray the character Octavia Blake. ==Personal life== The 32-year-old actress and her 41-year-old boyfriend allegedly began arguing in a car on the Ventura (134) Freeway shortly after midnight 5 August 2018. Avgeropoulos was accused of striking him multiple times in the head, neck and arm, resulting in minor injuries, according to the District Attorney's Office. She was then charged with domestic violence. Avgeropoulos's boyfriend wants the charges against the actress dropped as he said she doesn't pose a threat. ==Filmography== ===Film=== Year Title Role Notes 2009 I Love You, Beth Cooper Valli Wooley 2010 Random Walk Short film 2010 Percy Jackson & the Olympians: The Lightning Thief Aphrodite Girl 2010 Hunt to Kill Kim Rhodes 2011 50/50 Allison 2012 Fugitive at 17 Holly 2015 Tracers Nikki 2015 Numb Cheryl 2015 Isolation Nina 2016 Chelsea 2016 Dead Rising: Endgame Sandra Lowe ===Television=== Year Title Role Notes 2009 Supernatural Taylor Episode: \"After School Special\" 2009 Harper's Island Stacy Episode: \"Bang\" 2009 Jeanette Episode: \"Body Parts\" 2009 Sorority Wars Missy Television film 2010 Sarah Episode: \"Speed\" 2010 Fringe Leah / Waitress 2 episodes 2010 Smoke Screen Suzi Television film 2010 Human Target Jamie Hartloff Episode: \"The Other Side of the Mall\" 2011 Eureka Bonnie Episode: \"Reprise\" 2011 Hiccups Terry Episode: \"Sexual Healing\" 2012 Fugitive at 17 Holly Hamilton Television film 2012 Walking the Halls Amber Television film 2012 Samantha 4 episodes 2013 90210 Cassie McCoy Episode: \"The Empire State Strikes Back\" 2013 Cult Kirstie Nelson 10 episodes 2014–2020 Octavia Blake 67 episodes ==References== ==Other websites== * Category:1986 births Category:Actors from Ontario Category:Canadian movie actors Category:Canadian television actors Category:Living people Category:People from Thunder Bay",
 "title": "Marie Avgeropoulos"
}