{
 "id": "670091",
 "text": "On November 30, 2018, George H. W. Bush died at his home in Houston, Texas of natural causes. Bush was the 41st President of the United States, the 43rd Vice President of the United States, the former Director of Central Intelligence, and a former member of the United States House of Representatives. This happened nearly 8 months after the death of his wife Barbara Bush in April. Bush was the first president to die since Gerald Ford in 2006, and, at the age of 94 years and 171 days, he surpassed Ford for the title of longest-lived U.S. president in history. Shortly after news broke of Bush's death, on December 5, 2018, Donald Trump declared a National Day of Mourning and ordered all flags \"throughout the United States and its Territories and possessions\" lowered to half staff for the remainder of the year. The state funeral of Bush is the official funerary rites conducted by the Government of the United States. He was interred at the George Bush Presidential Library. The state funeral and respective activities occurred over a period of four days from December 3 to December 6, 2018. ==Events== The corps of cadets of the United States Military Academy, United States Air Force Academy, and United States Coast Guard Academy, and the corps of midshipmen of the United States Naval Academy are to be immediately assembled to be officially informed of the death by the superintendents of their respective institutions. Very early on the morning of December 1, 2018, the flags at the White House were lowered to half staff. ==State funeral== Before his death, Bush filed a 211-page document with the Military District of Washington, which had a request for an aerial flyover of fighter jets in missing man formation by the United States Air Force during his state funeral, as well as final interment and burial to occur at the George Bush Presidential Library in College Station, Texas. Bush made plans for a national funeral service to be held at Washington National Cathedral in Washington, D.C. Bush lay in state in the United States Capitol rotunda from the evening of December 3 through the morning of December 5. Tributes were made by Jon Meacham, Brian Mulroney, Alan K. Simpson, and George W. Bush at the Washington National Cathedral. President Donald Trump and former Presidents Barack Obama, Bill Clinton, Bush and Jimmy Carter attended the funeral. International leaders attending these services include: Britain's Prince Charles and former Prime Minister John Major, former Canadian Prime Minister Brian Mulroney, Polish President Andrzej Duda and former President Lech Wałęsa, German Chancellor Angela Merkel, former Mexican President Carlos Salinas de Gortari Abdullah II of Jordan and Speaker of Taiwan's Congress Su Jia-chyuan. Shortly after the Washington service, Bush's body was taken back to Houston by a custom-made train where a service was held. On December 6, 2018, his body was buried at the George Bush Presidential Library next to his wife Barbara Bush. ==Related pages== * Death and state funeral of Ronald Reagan ==References== Category:2018 in the United States Category:November 2018 events Category:December 2018 events Bush Category:George H. W. Bush Bush, George H. W.",
 "title": "Death and state funeral of George H. W. Bush"
}