{
 "id": "670194",
 "text": "Sentientism is a way of thinking about what is right and wrong - an ethical philosophy. It uses evidence of the real world and careful thinking to develop beliefs. It rejects beliefs where there is no good evidence for them. Sentientism says we should care about all sentient beings and care more about beings that are more sentient. Sentient beings include anything that can experience good or bad things or feelings. These include humans, most non- human animals and may eventually include artificial beings we create or intelligent aliens we meet. People who agree with sentientism are called sentientists. They are atheist and often humanist. They are also often vegan or vegetarian for moral reasons. Things that are not sentient, such as plants, rivers and mountains, may be important because they affect how sentient beings feel. However, we don't need to care about them directly because they cannot suffer or feel pleasure. Sentientist thinking has a long history, from Jeremy Bentham's An Introduction to the Principles of Morals and Legislation* through to modern philosophers such as Richard D. Ryder and Peter Singer. Sentientism differs from Speciesism because it uses degrees of sentience, rather than species, to decide what things we should care about. Sentientism differs from painism* because it counts positive experience, as well as the ability to feel pain, in making moral decisions. Sentientism agrees with Animalism that humans are animals so we should care about both. However, sentientism argues that we should also care about non-animal sentient beings, such as potential artificial or alien intelligences. ==Notable Sentientists== Notable sentientists include: Thandie Newton, Bill Maher, James Cameron, Stephen Fry, George Meyer, Ricky Gervais, Sam Harris, Benjamin Spock, Oliver Sykes, Steven Pinker, Gary Holt (musician), Ellen Page, Kristen Bell, Cloris Leachman, Percy Bysshe Shelley, Richard Dawkins, Claude Lévi-Strauss, Jessica Lange and John Stewart Bell. In some cases sentientism is implied because these people are atheists and/or humanists and vegans or vegetarians. ==Related pages== == References == * * * * * * * * * * * == Other websites == * Sentientism movement web-site * Sentientism discussion group (Facebook) * Sentientism Sub-Reddit * Sentientism Twitter account * List of sentientists (Twitter) Category:Animal rights Category:Ethics Category:Philosophical movements and positions",
 "title": "Sentientism"
}