{
 "id": "670269",
 "text": "The Japanese weasel (Mustela Itatsi) is a carnivorous mammal belonging to the family Mustelidae. It lives in Honshu, Shikoku and Kyushu of Japan. Major habitats are plains, but in western Japan it mainly lives in mountainous areas. ==Appearance== Adult males of the Japanese weasel can reach in body length with a tail length of up to . Females are smaller. The fur is orange- brown with darker markings. ==Distribution and Habitat== The Japanese weasel was na­tive to three of Japan’s four larger is­lands: Hon­shu, Kyushu, and Shikoku. Over the past cen­tury, they have been intro­duced to most other Japan­ese is­lands to control the population of rodents. Their range now in­cludes Hokkaidō and the many of the Ryūkyū Islands. Japan­ese weasels are found in a lot of ecosystems in Japan. It mainly lives in moun­tain­ous and forested places near mov­ing water. Most hunt­ing is done along rivers, but these weasels sometimes go into grasslands or sub­ur­ban areas. In win­ter, these slim weasels spend most of their time under the snow chas­ing small ro­dents through a maze of tunnels. After catch­ing and eat­ing the prey, Japan­ese weasels usually enjoy the warmth of the prey's nest after eat­ing. ==Feeding== They eat mice, frogs, reptiles, insects and crayfish. They sometimes eat berries, seeds and fruits but only when hungry. Males like to eat more mammals and crustacean. Females like to eat insects, fruits and earthworms. Their diet changes depending on the season, the number of some foods. Fish and insects are a part of their diet throughout all seasons. They mostly eat coleoptera insects in spring, fruits in summer, orthoptera insects and crustaceans in autumn and fish and fruit in winter. Japanese weasels help in controlling rodent and other small animal populations. ==Behavior== Japanese weasels live by themselves, with the except when mating, and raising the young ones. They do not like other Japanese weasels entering their home range and will defend their home range. When scared, weasels release musk to discourage predators. Japanese weasels are also great hunters. They chase down prey by any means, including running down tunnels, climbing trees, or swimming. Anywhere prey can go, the weasel can follow. They are both diurnal and nocturnal. ==Reproduction== The mating season is from early May to late June. After mating, gestation takes about 30 days. The number of kits varies from 2 to 12, but is usually 5 or 6. It takes 8 weeks to fully be weaned and live by themselves. Japanese weasels are sexually mature at one year old. Breeding season is twice a year in Kyushu, once a year in Hokkaido. == Economic importance == In the past century Japanese weasels have been introduced to many small Japanese islands to kill rats that were damaging crops. Together with the use of some rodenticide, the weasels helped reduce rat populations. Japanese weasels are also trapped and used in the fur trade. Japanese weasels also sometimes hunt domestic birds, such as chickens and ducks. ==Conservation status== Although their populations are in slight decline, Japanese weasels are listed as Least Concern on the IUCN Red List because of their widespread population across Japan. The main threat to Japanese weasels is habitat loss because of residential and commercial development. == References == Category:Mustelids Category:Mammals of Japan",
 "title": "Japanese weasel"
}