{
 "id": "67023",
 "text": "Susan Sarandon (born October 4, 1946) is an American actress. She was born in New York City and grew up in Edison, New Jersey. She has received many awards in her career for her work, including the Academy Award in 1995 for her role at the movie Dead Man Walking, written and directed by her partner, actor and director Tim Robbins. In 2022, she came out as bisexual. ==Filmography== Films Year Title Role Notes 1970 Joe Melissa Compton 1971 Lady Liberty Sally 1971 The Apprentice Elizabeth Hawkins aka \"Fleur bleue\" (in Canada) 1974 Lovin' Molly Sarah 1974 The Front Page Peggy Grant 1975 The Great Waldo Pepper Mary Beth 1975 The Rocky Horror Picture Show Janet Weiss 1976 One Summer Love Chloe aka \"Dragonfly\" (USA: original title) 1977 Checkered Flag or Crash C.C. Wainwright 1977 The Other Side of Midnight Catherine Alexander Douglas 1977 The Great Smokey Roadblock Ginny 1978 Pretty Baby Hattie 1978 King of the Gypsies Rose 1979 Something Short of Paradise Madeline Ross 1980 Atlantic City Sally Matthews Genie Award for Best Performance by a Foreign Actress Kansas City Film Critics Circle Award for Best Actress Nominated—Academy Award for Best Actress 1980 Loving Couples Stephanie 1982 Tempest Aretha Tomalin 1983 The Hunger Dr. Sarah Roberts 1983 Who Am I This Time? Helene Shaw 1984 The Buddy System Emily 1984 Faerie Tale Theatre 1985 Compromising Positions Judith Singer 1987 The Witches of Eastwick Jane Spofford Nominated—Saturn Award for Best Actress 1988 Bull Durham Annie Savoy Boston Society of Film Critics Award for Best Actress Nominated—Golden Globe Award for Best Actress – Motion Picture Musical or Comedy 1988 Sweet Hearts Dance Sandra Boon 1989 The January Man Christine Starkey 1989 A Dry White Season Melanie Bruwer 1990 White Palace Nora Baker London Film Critics Circle Award for Best Actress (also for Thelma & Louise) Nominated—Golden Globe Award for Best Actress – Motion Picture Drama 1991 Thelma & Louise Louise Elizabeth Sawyer David di Donatello Award for Best Foreign Actress (shared with Geena Davis) London Film Critics Circle Award for Best Actress (also for White Palace) National Board of Review Award for Best Actress (shared with Geena Davis) Nominated—Academy Award for Best Actress Nominated—BAFTA Award for Best Actress in a Leading Role Nominated—Chicago Film Critics Association Award for Best Actress Nominated—Golden Globe Award for Best Actress – Motion Picture Drama 1992 The Player Herself 1992 Light Sleeper Ann 1992 Bob Roberts Tawna Titan 1992 Lorenzo's Oil Michaela Odone Nominated—Academy Award for Best Actress Nominated—Chicago Film Critics Association Award for Best Actress Nominated—Golden Globe Award for Best Actress – Motion Picture Drama 1994 The Client Regina 'Reggie' Love BAFTA Award for Best Actress in a Leading Role Nominated—Academy Award for Best Actress Nominated—Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role 1994 Little Women Margaret 'Marmee' March 1994 Safe Passage Margaret 'Mag' Singer 1995 Dead Man Walking Sister Helen Prejean Academy Award for Best Actress Chlotrudis Award for Best Actress David di Donatello Award for Best Foreign Actress Kansas City Film Critics Circle Award for Best Actress Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role Nominated—Golden Globe Award for Best Actress – Motion Picture Drama 1996 James and the Giant Peach Miss Spider voice 1998 Twilight Catherine Ames 1998 Illuminata Calimene 1998 Stepmom Jackie Harrison San Diego Film Critics Society Award for Best Actress Nominated—Golden Globe Award for Best Actress – Motion Picture Drama Nominated—Satellite Award for Best Actress – Motion Picture Drama 1999 Our Friend, Martin Mrs. Clark voice (direct-to-video) 1999 Cradle Will Rock Margherita Sarfatti 1999 Anywhere but Here Adele August 2000 Joe Gould's Secret Alice Neel 2000 Rugrats in Paris: The Movie Coco LaBouche voice 2001 Cats & Dogs Ivy voice 2001 Goodnight Moon Narrator voice (short subject) 2002 Igby Goes Down Mimi Slocumb Moonlight Mile) Nominated—Golden Globe Award for Best Supporting Actress – Motion Picture 2002 The Banger Sisters Lavinia Kingsley 2002 Moonlight Mile Jojo Floss Las Vegas Film Critics Society Award for Best Supporting Actress (also for Igby Goes Down) 2002 Little Miss Spider Narrator short subject 2004 Noel Rose Collins 2004 Jiminy Glick in Lalawood Herself Cameo 2004 Shall We Dance Beverly Clark 2004 Alfie Liz 2005 Elizabethtown Hollie Baylor 2005 Romance & Cigarettes Kitty 2006 Irresistible Sophie 2007 Mr. Woodcock Beverly Farley 2007 In the Valley of Elah Joan Deerfield 2007 Enchanted Queen Narissa 2007 Emotional Arithmetic Melanie Lansing Winters Nominated—Genie Award for Best Performance by a Foreign Actress Nominated—Jutra Award for Best Actress 2008 Speed Racer Mom Racer 2008 Middle of Nowhere Rhonda Berry 2009 The Greatest Grace Brewer 2009 Peacock Fanny Crill Direct-to-video 2009 Leaves of Grass Daisy Kincaid 2009 Solitary Man Nancy 2009 The Lovely Bones Grandma Lynn Nominated—Saturn Award for Best Supporting Actress 2010 Wall Street: Money Never Sleeps Sylvia Moore 2012 Jeff, Who Lives at Home Sharon 2012 That's My Boy Mary McGarricle post- production 2012 Cloud Atlas filming Television Year Title Role Notes 1970– 1971 A World Apart Patrice Kahlman 1971 Owen Marshall: Counselor at Law Joyce 1 episode 1972 Search for Tomorrow Sarah Fairbanks unknown episodes 1974 F. Scott Fitzgerald and 'The Last of the Belles' Ailie Calhoun television film 1974 Kate television film 1974 June Moon Eileen television film 1974 Pasty Johnson television film 1975 television film 1981 Fridays Herself TV show. Special guest star 1982 Who Am I This Time? Helene Shaw television film 1984 Oxbridge Blues Natalie TV mini-series 1984 Faerie Tale Theatre Beauty 1 episode Beauty And The Beast 1985 A.D Livilla TV mini-series 1985 Mussolini and I Edda Mussolini Ciano television film 1986 Women of Valor Col. Margaret Ann Jessup television film 1994 All Star 25th Birthday: Stars and Street Forever! Bitsy 1995 Ballet Teacher 1 episode 1999 Earthly Possessions Charlotte Emory television film 2001 Friends Cecilia Monroe/Jessica Lockhart Nominated—Primetime Emmy Award for Outstanding Guest Actress – Comedy Series 2001 Cool Women In History The Host Season 1 Nominated—Daytime Emmy Award for Outstanding Special Class Series 2002 Malcolm in the Middle Meg Nominated—Primetime Emmy Award for Outstanding Guest Actress – Comedy Series 2003 Ice Bound: A Woman's Survival at the South Pole Dr. Jerri Nielsen television film 2003 Frank Herbert's Children of Dune Princess Wensicia TV miniseries 2004 Chappelle's Show herself Season 3 2004 Troy: The Passion of Helen The Host 2005 The Exonerated Sunny Jacobs television film 2005 Mad TV 2 episodes 2006– 2007 Rescue Me Alicia 2007 Bernard and Doris Doris Duke television film Nominated—Primetime Emmy Award for Outstanding Lead Actress – Miniseries or a Movie Nominated—Golden Globe Award for Best Actress – Miniseries or Television Film Nominated—Satellite Award for Best Actress – Miniseries or Television Film Nominated—Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie 2009 Saturday Night Live Mother of Andy Samberg's character SNL Digital Short - Motherlover 2009 ER Nora 1 episode 2010 Who Do You Think You Are? herself 1 episode 2010 You Don't Know Jack Janet Good television film Nominated — Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie Nominated - Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie 2010 Chelsea Lately Herself Appeared 7/20/2010 2010 The Good Wife Mrs. Joe Kent Uncredited voice role, 10/27/2010 2011-2012 30 Rock Lynn Onkman 2 Episodes Queen of Jordan , Alexis Goodlooking and the Case of the Missing Whisky 2011 Saturday Night Live Mother of Andy Samberg's character SNL Digital Short - 3-Way (The Golden Rule) 2012 The Big C Joy the Joyologist Season 3, Episode 3, 4, and 5 Documentaries Year Title Role 1983 When the Mountains Tremble 1990 Through the Wire narrator 1993 Wildnerness: The Last Stand narrator 1994 School of the Americas Assassins narrator 1995 The Celluloid Closet 1996 Tell the Truth and Run: George Seldes and the American Press narrator 1997 narrator 1997 Father Roy: Inside the School of Assassins narrator 1997 187: Documented narrator 1999 For Love of Julian narrator 2000 Light Keeps Me Company 2000 Iditarod: A Far Distant Place narrator 2000 Mythos narrator 2000 This Is What Democracy Looks Like narrator 2000 Dying to be Thin narrator 2001 Uphill All the Way narrator 2001 900 Women narrator 2001 narrator 2001 Rudyland narrator 2001 Islamabad: Rock City narrator 2001 Ghosts of Attica narrator 2001 Last Party 2000 2002 narrator 2002 Tibet: Cry of the Snow Lion narrator 2003 XXI Century 2003 narrator 2003 Burma: Anatomy of Terror narrator 2003 Journey of the Heart: The Life of Henri Nouwen narrator 2004 Fragile Hopes from the Killing Fields narrator 2005 narrator 2005 On the Line: Dissent in an Age of Terrorism 2006 Secrets of the Code narrator 2006 Christa McAuliffe: Reach for the Stars narrator 2006 Home herself 2007 This Child of Mine narrator 2007 World Beyond Wiseguys: Italian Americans & the Movies 2007 Coming Home Herself 2009 PoliWood Herself 2010 Who Do You Think You Are? Herself ==References== == Other websites == * * Category:American Academy Award winning actors Category:Actors from New Jersey Category:Actors from New York City Category:American movie actors Category:American movie producers Category:American television actors Category:American voice actors Category:BAFTA Award winners Category:Screen Actors Guild Award winners Category:1946 births Category:Living people Category:Bisexual people Category:LGBT people from New York City Category:LGBT actors Category:LGBT producers",
 "title": "Susan Sarandon"
}