{
 "id": "670273",
 "text": "The Ryukyu black-breasted leaf turtle or Ryukyu leaf turtle, Geoemyda japonica, is a species of turtle in the family Geoemydidae (formerly Bataguridae) endemic to the Ryukyu Islands in Japan. In 1975, the species was designated a National Natural Monument of Japan. It grows to about 5–6 inches long. In captivity, it feeds on worms, snails, insects, and fruit. Due to its rarity and very attractive appearance, this species is highly sought-after by turtle collectors worldwide. At first it was considered a subspecies of Geoemyda spengleri, and named Geoemyda spengleri japonica. It was redescribed as a separate species and given its current binomial name in 1992. Hybrids between different genera of Geoemydidae are rather commonplace. This species is known to hybridize with Cuora flavomarginata males in captivity and in the wild.Buskirk et al. (2005). ==References== ==Introductione== Ryukyu black- breasted leaf turtle is an endemic species of turtle in Japan. ==Appearance== It grows to about 15.6 cm. It has black and yellow in stomach. ==Living areas== It lives in North Okinawa, Kubejima and Tokasikijima. It does not herdine but it spends at the cave and around the cave during winter. ==Food and water== It eats leaf, fruit and insect. It is eaten by Ryukyu born. ==Repruduction== It borns two babies at once from June and September. Baby is about 3.5 cm. ==Threats== It's threats are habitat loss by the development. ==Relationship with humans== We cannot export it in Japan. This species is endangered and is protected. * Listed as Endangered (EN A1ce, B1+2c) *Buskirk, James R.; Parham, James F. & Feldman, Chris R. (2005): On the hybridisation between two distantly related Asian turtles (Testudines: Sacalia × Mauremys). Salamandra 41: 21-26. PDF fulltext ==Other websites== * IUCN Tortoise and Freshwater Turtle Specialist Group » Geoemyda japonica, 002 Category:Animals of Japan Category:Endangered species Category:Turtles of Asia",
 "title": "Ryukyu black-breasted leaf turtle"
}