{
 "id": "67024",
 "text": "Timothy Francis Robbins (born October 16, 1958) is an American actor, screenwriter, director, producer, activist, and amateur musician. He has won many awards in his career, including the Academy Award in 2004 for his work in Mystic River. He was born in West Covina, Los Angeles County and raised in New York City. He was the partner of actress Susan Sarandon from 1988 to 2009. ==Filmography== Year Title Role Notes 1984 Toy Soldiers Boe No Small Affair Nelson 1985 Fraternity Vacation Larry \"Mother\" Tucker The Sure Thing Gary Cooper 1986 Howard the Duck Phil Blumburtt Nominated — Razzie Award for Worst Supporting Actor Top Gun Lt. Samuel \"Merlin\" Wells 1988 Five Corners Harry Bull Durham Ebby Calvin \"Nuke\" LaLoosh Tapeheads Josh Tager 1989 Erik the Viking Erik Miss Firecracker Delmount Williams Twister Jeff 1990 Jacob's Ladder Jacob Singer Cadillac Man Larry 1991 Jungle Fever Jerry 1992 Bob Roberts Bob Roberts Also writer and director Bronze Award for Best Actor at the Tokyo International Film Festival Nominated — Golden Globe Award for Best Actor – Motion Picture Musical or Comedy The Player Griffin Mill Best Actor Award (Cannes Film Festival) Golden Globe Award for Best Actor – Motion Picture Musical or Comedy Nominated — BAFTA Award for Best Actor in a Leading Role 1993 Short Cuts Gene Shepard Golden Globe Special Award for Ensemble Cast Volpi Cup for Best Ensemble Cast 1994 I.Q. Ed Walters Prêt-à-Porter Joe Flynne Title in English: Ready to Wear National Board of Review Award for Best Cast The Shawshank Redemption Andy Dufresne Nominated — Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role The Hudsucker Proxy Norville Barnes 1995 Dead Man Walking Writer and director Golden Aphrodite Award at the Love is Folly International Film Festival Humanitas Prize for Feature Film Category Palm Springs International Film Festival Award for Best Director Prize of the Ecumenical Jury Prize of the Guild of German Art House Cinemas Reader Jury of the \"Berliner Morgenpost\" Nominated — Academy Award for Best Director Nominated — Golden Globe Award for Best Screenplay Nominated — Golden Berlin Bear Award for Best Film 1997 Nothing to Lose Nick Beam 1999 Austin Powers: The Spy Who Shagged Me The President Cradle Will Rock Voice on Film Reel Uncredited voice; also writer and director Gran Angular Award for Best Director Gran Angular Award for Best Film Istanbul International Film Festival Award for International Competition National Board of Review Special Achievement in Filmmaking Award Nominated — Palme d'Or (1999 Cannes Film Festival) Arlington Road Oliver Lang/William Fenimore 2000 Mission to Mars Woodrow \"Woody\" Blake High Fidelity Ian \"Ray\" Raymond 2001 Antitrust Gary Winston Human Nature Dr. Nathan Bronfman The Party's Over Himself 2002 The Truth About Charlie Lewis Bartholomew 2003 Mystic River Dave Boyle Academy Award for Best Supporting Actor Boston Society of Film Critics Award for Best Cast Broadcast Film Critics Association Award for Best Supporting Actor Central Ohio Film Critics Association Award for Best Supporting Actor Chicago Film Critics Association Award for Best Supporting Actor Florida Film Critics Circle Award for Best Supporting Actor Golden Globe Award for Best Supporting Actor – Motion Picture Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role Southeastern Film Critics Association Award for Best Supporting Actor Nominated — BAFTA Award for Best Actor in a Supporting Role Nominated — Dallas-Fort Worth Film Critics Association Award for Best Supporting Actor Nominated — National Society of Film Critics Award for Best Supporting Actor Nominated — Online Film Critics Society Award for Best Supporting Actor Nominated — Phoenix Film Critics Society Award for Best Supporting Actor Nominated — Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture Nominated — Vancouver Film Critics Circle Award for Best Supporting Actor Nominated — Washington D.C. Area Film Critics Association Award for Best Supporting Actor Code 46 William Geld 2004 Anchorman: The Legend of Ron Burgundy Public News Anchor Uncredited cameo 2005 The Secret Life of Words Josef ADIRCAE Award for Best Performance in a Leading Role Nominated — Barcelona Film Award for Best Actor (Millor Actor) Nominated — Cinema Writers Circle Award for Best Actor (Mejor Actor) War of the Worlds Harlan Ogilvy Zathura: A Space Adventure Mr. Budwing Cameo 2006 Tenacious D in The Pick of Destiny The Stranger Catch a Fire Nic Vos 2007 Noise David Owen 2008 The Lucky Ones Fred Cheaver City of Ember Loris Harrow 2011 Green Lantern Senator Robert Hammond 2012 Back to 1942 Father Megan Thanks for Sharing Mike 2013 Life of Crime Frank Dawson 2014 Welcome to Me Dr. Moffat 2015 A Perfect Day B 2017 Marjorie Prime Jon 2019 VHYes Sir Roger Handley III Dark Waters Tom Terp Post-production ==References== ==Other websites== * Video Interview with Tim Robbins on AMC's Sunday Morning Shootout * Embedded Live, the play and Embedded /Live, the DVD ** See also, Embedded Live, the interview, from CBC News: The Hour * Interview from On The Media, February 20, 2004 * Interview from Media Matters, June 5, 2005 * Tim Robbins' federal campaign contribution report * TheAge.com Article: \"Tim Robbins: Hall of Fame Violates Freedom\" * * Robbins' blog at The Huffington Post * Audio interview of Tim Robbins by Stephanie Miller on The Stephanie Miller Show about Robbins' play, 1984 Category:1958 births Category:Living people Category:American Academy Award winning actors Category:Actors from Los Angeles Category:Actors from New York City Category:Screenwriters from California Category:Screenwriters from New York City Category:American activists Category:American movie actors Category:American television actors Category:Golden Globe Award winning actors Category:Screen Actors Guild Award winners",
 "title": "Tim Robbins"
}