{
 "id": "67035",
 "text": "Michael Andrew Fox (born June 9, 1961), known professionally as Michael J. Fox, is a retired Canadian-American actor, author, comedian, movie producer and activist with a film and television career spanning from the 1970s to 2020. He played Marty McFly in Back to the Future trilogy. On television, he played Alex P. Keaton in the NBC sitcom Family Ties and Mike Flaherty on the ABC sitcom Spin City. He has won five Primetime Emmy Awards, four Golden Globe Awards, a Grammy Award and two Screen Actors Guild Awards. Fox was diagnosed with Parkinson's disease in 1991, and told the public about it in 1998. He semi-retired from acting in 2000 as the symptoms of the disease worsened. He has since become an advocate for research toward finding a cure, and founded the Michael J. Fox Foundation. Sweden's Karolinska Institute gave him an honorary doctorate on March 5, 2010 for his work advocating a cure for Parkinson's disease. Fox has also worked as a voice-over actor on films, such as Stuart Little and Atlantis: The Lost Empire. On the CBS television show The Good Wife, he earned Emmy nominations for three consecutive years for his recurring role as crafty attorney Louis Canning. He has also taken recurring guest roles and cameo appearances in Boston Legal, Scrubs, Curb Your Enthusiasm, Rescue Me, and Designated Survivor. He has written four books. Fox was appointed an Officer of the Order of Canada in 2010 and was also inducted into Canada's Walk of Fame in 2000. ==Filmography== Year Title Role Notes 1980 Midnight Madness Scott Larson 1982 Class of 1984 Arthur 1985 Back to the Future Marty McFly 1985 Teen Wolf Scott Howard 1987 Light of Day Joe Rasnick 1987 The Secret of My Success Brantley Foster 1988 Bright Lights, Big City Jamie Conway 1989 Casualties of War PFC. Max Eriksson 1989 Back to the Future Part II Marty McFly / Marty McFly Jr / Marlene McFly 1990 Back to the Future Part III Marty McFly / Seamus McFly 1991 The Hard Way Nick \"Nicky\" Lang 1991 Doc Hollywood Dr. Benjamin \"Ben\" Stone 1993 Homeward Bound: The Incredible Journey Chance Voice 1993 Life with Mikey Michael \"Mikey\" Chapman 1993 For Love or Money Doug Ireland 1994 Where the Rivers Flow North Clayton Farnsworth 1994 Greedy Daniel \"Danny\" McTeague 1995 Coldblooded Tim Alexander 1995 Blue in the Face Pete Maloney 1995 The American President Lewis Rothschild 1996 Homeward Bound II: Lost in San Francisco Chance Voice 1996 The Frighteners Frank Bannister 1996 Mars Attacks! Jason Stone 1999 The Iron Giant Sergeant Voice Uncredited 1999 Stuart Little Stuart Little Voice 2001 Atlantis: The Lost Empire Milo James Thatch Voice 2002 Interstate 60 Mr. Baker Cameo 2002 Stuart Little 2 Stuart Little Voice 2005 Stuart Little 3: Call of the Wild Stuart Little Voice Direct-to-DVD 2013 Drew: The Man Behind the Poster Himself Documentary 2014 Annie Himself Cameo 2015 Being Canadian Himself Documentary 2015 Back in Time Himself Documentary 2015 Mr Calzaghe Himself Documentary 2016 A.R.C.H.I.E. A.R.C.H.I.E. Voice 2018 A.R.C.H.I.E. 2 A.R.C.H.I.E Voice 2019 See You Yesterday Mr. Lockhart ==References== == Other websites == * * * * The Michael J. Fox Foundation for Parkinson's Research * The Michael J. Fox Database Category:Actors from Alberta Category:American movie actors Category:American television actors Category:Canadian movie actors Category:Canadian television actors Category:Emmy Award winning actors Category:Entertainers from Edmonton Category:Golden Globe Award winning actors Category:Naturalized citizens of the United States Category:People with Parkinson's disease Category:1961 births Category:Living people",
 "title": "Michael J. Fox"
}