{
 "id": "67064",
 "text": "Cassini–Huygens, ( ) often referred to as Cassini, was a joint space-research mission by NASA, the European Space Agency (ESA), and the Italian Space Agency (ASI). Its goal was to study Saturn and its system, including its rings and moons, using a robotic spacecraft. The mission included NASA's Cassini space probe and ESA's Huygens lander, which landed on Saturn's largest moon, Titan in 2005. Cassini was the fourth spacecraft to visit Saturn and the first to orbit around it, a mission that lasted from 2004 to 2017. The mission was named after astronomers Giovanni Cassini and Christiaan Huygens. Launched on October 15, 1997, Cassini spent nearly 20 years in space. It orbited Saturn for 13 years, starting from July 1, 2004, and studied the planet and its surroundings during that time. The journey to Saturn included passing close by Venus (April 1998 and July 1999), Earth (August 1999), the asteroid 2685 Masursky, and Jupiter (December 2000). Cassini's mission ended on September 15, 2017, when it entered Saturn's upper atmosphere and burned up to avoid any risk of contaminating Saturn's potentially habitable moons with microbes from Earth. The mission exceeded expectations – NASA's Jim Green called Cassini- Huygens a \"mission of firsts\" that greatly advanced our knowledge of Saturn, its moons, and rings, and expanded our understanding of where life might exist in our solar system. Cassini's mission was originally planned for four years, from June 2004 to May 2008. It was then extended for two more years until September 2010, called the Cassini Equinox Mission. Later, it received a final extension known as the Cassini Solstice Mission, which lasted another seven years until September 15, 2017. On that date, Cassini was directed to enter Saturn's upper atmosphere and burn up. The Huygens module traveled with Cassini until it separated from the probe on December 25, 2004. It landed on Titan on January 14, 2005, using a parachute. The separation was helped by the SED (Spin/Eject device), which made it move away at a speed of 0.35 meters per second (1.1 feet per second) and spin at a rate of 7.5 rpm. For about 90 minutes, it sent data back to Earth using Cassini as a relay. This was the first time a spacecraft landed in the outer Solar System and the first time a landing happened on a moon other than Earth's Moon. At the end of its mission, Cassini carried out its \"Grand Finale\": a series of risky passes through gaps between Saturn and its inner rings. This phase aimed to gather as much scientific data as possible before Cassini was destroyed to prevent any risk of contaminating Saturn's moons. This was necessary because if Cassini were to crash into these moons due to power loss or communication issues at the end of its mission, it could potentially contaminate them with Earth microbes. Cassini's mission concluded when it entered Saturn's atmosphere, but scientists will continue analyzing the data it sent back for many years. == Overview == === Construction === Scientists and teams from 27 countries worked together to design, build, launch, and operate the Cassini orbiter and Huygens probe. NASA's Jet Propulsion Laboratory in the United States managed the mission and built the orbiter. The European Space Research and Technology Centre developed the Huygens probe. Aérospatiale of France, later apart of Thales Alenia Space, put together the probe with help from various European countries. The Italian Space Agency (ASI) provided important parts for the Cassini orbiter, such as antennas and scientific instruments. NASA added more scientific instruments and electronic parts, with support from CNES of France. In April 2008, NASA extended funding for ground operations, renaming the mission as the Cassini Equinox Mission. More funding extensions were announced in February 2010 for the Cassini Solstice Mission. === Mission === ==== Launch ==== Cassini-Huygens launched on October 15, 1997, from Cape Canaveral Air Force Station's Space Launch Complex 40. It used a Titan IVB/Centaur rocket, which included a two-stage Titan IV booster rocket, two solid rocket engines, the Centaur upper stage, and a payload enclosure (fairing). ==== Venus and Earth flyby's and cruise to Jupiter ==== The Cassini space probe used gravity to help it travel. It flew by Venus twice, on April 26, 1998, and June 24, 1999, to gain speed. This let Cassini go out to the asteroid belt before the Sun's gravity pulled it back. On August 18, 1999, at 03:28 UTC, Cassini flew by Earth. One hour and 20 minutes earlier, it passed the Moon at 377,000 kilometers and took some calibration photos. On January 23, 2000, at around 10:00 UTC, Cassini flew by the asteroid 2685 Masursky. It took photos five to seven hours before the flyby. The asteroid was estimated to be 15 to 20 kilometers wide. ==== Jupiter flyby ==== Cassini got close to Jupiter on December 30, 2000, at 9.7 million kilometers. It took around 26,000 pictures of Jupiter, its rings, and its moons during a six-month flyby. These images made the most detailed global color portrait of Jupiter, showing features as small as 60 kilometers across. One key finding was about Jupiter's atmospheric circulation. Scientists found that dark \"belts\" on Jupiter have upwelling air and bright clouds, while the lighter \"zones\" have sinking air. This was surprising because, on Earth, rising air usually forms clouds. Cassini also saw a large, dark oval of high atmospheric haze near Jupiter's north pole. Infrared images showed that the winds near the poles move in opposite directions in different bands. Cassini's observations of Jupiter's rings showed that the particles in the rings are irregularly shaped, not spherical. These particles likely come from impacts on Jupiter's moons, Metis and Adrastea, by micrometeorites. ==== Testing Albert Einstein's Theory of Relativity ==== On October 10, 2003, the Cassini mission team announced results of tests on Albert Einstein's general theory of relativity. They used radio waves sent from Cassini. These waves passed close to the Sun, and the scientists measured how the frequency changed. According to Einstein's theory, the Sun's gravity curves space-time, causing the radio waves to change frequency. The experiment found no deviations from Einstein's theory. Previous tests with the Viking and Voyager probes matched Einstein's predictions within one part in a thousand. ==== New moons of Saturn ==== In total, the Cassini mission found seven new moons orbiting Saturn.Meltzer 2015, pp. 346–351 Using images taken by Cassini, researchers identified Methone, Pallene, and Polydeuces in 2004, although later study revealed that Voyager 2 had already photographed Pallene during its flyby of Saturn in 1981. On May 1, 2005, Cassini found a new moon in the Keeler gap of Saturn's rings. Initially named S/2005 S 1, it was later named Daphnis. Another moon, originally named S/2007 S 4, was discovered by Cassini on May 30, 2007, and is now known as Anthe. On February 3, 2009, Cassini discovered a sixth moon roughly 500 meters (0.3 miles) in diameter within Saturn's G-ring, now named Aegaeon (formerly S/2008 S 1). On November 2, 2009, Cassini found the seventh moon, labeled S/2009 S 1, roughly 300 meters (980 feet) in diameter in Saturn's B-ring system. On April 14, 2014, NASA scientists announced the potential start of a new moon forming in Saturn's A Ring. ==== Phoebe flyby ==== On June 11, 2004, Cassini flew by Saturn's moon Phoebe for the first close-up study of this moon. Voyager 2 had done a distant flyby in 1981 but did not return detailed images. This was Cassini's only chance to closely study Phoebe due to its orbit around Saturn. The first close-up images were received on June 12, 2004. Scientists saw that Phoebe's surface looked different from other asteroids visited by spacecraft. Some areas of Phoebe's surface appeared very bright, suggesting there might be a lot of water ice just below the surface. ==== Cassini's orbital insertion ==== On July 1, 2004, Cassini flew through the gap between Saturn's F and G rings and entered orbit around Saturn, becoming the first spacecraft to do so. This followed a seven-year journey. The Saturn Orbital Insertion (SOI) maneuver was complex. Cassini had to turn its antenna away from Earth to protect its instruments from ring particles. After crossing the ring plane, it rotated again to point its engine along its flight path and fired the engine to slow down by 622 m/s. This allowed Saturn's gravity to capture Cassini around 8:54 pm Pacific Daylight Time on June 30, 2004. During this maneuver, Cassini passed within 20,000 km (12,000 mi) of Saturn's cloud tops. ==== Titan flybys ==== Cassini's first flyby of Saturn's largest moon, Titan, occurred on July 2, 2004, just a day after entering orbit. It came within 339,000 km (211,000 mi) of Titan, capturing images through special filters that could penetrate the moon's thick haze. These images revealed south polar clouds likely made of methane, along with surface features of different in brightness. On October 27, 2004, Cassini performed the first of 45 planned close flybys of Titan, passing 1,200 km (750 mi) above its surface. It transmitted nearly four gigabits of data back to Earth, including the first radar images showing Titan's hazy-covered terrain. These images showed Titan's surface to be flat, with elevations not exceeding about 50 m (160 ft). The flyby significantly increased the resolution of Titan's imaging, providing pictures up to 100 times clearer than previous ones. Cassini's observations also revealed methane lakes on Titan's surface, resembling Earth's water lakes. ==== Huygens lands on Titan ==== On December 25, 2004, the Huygens probe left Cassini and traveled to Titan. On January 14, 2005, Huygens landed on Titan, bouncing and sliding to a stop. It discovered pebbles made of water ice on an orange surface covered in methane haze. Huygens' images revealed rivers of liquid methane, drainage channels, and dry lakebeds, indicating recent water activity. Although no permanent lakes were found at the landing site, later Cassini data confirmed lakes in Titan's polar regions. Huygens sent data back to Earth, and scientists figured out the surface was damp sand made of ice grains, with rounded rocks and pebbles suggesting water movement. The temperature was extremely cold at −179.3 °C; −290.8 °F, and methane took up 5% of the atmosphere. Light levels on Titan were much dimmer than on Earth, casting an orange hue due to Titan's atmospheric haze. After 90 minutes, Huygens stopped sending data, even though it was designed to last longer. ==== Enceladus flybys ==== In 2005, during its first two close flybys of the moon Enceladus, Cassini found changes in the local magnetic field that suggest there's a thin but important atmosphere around Enceladus. Other tests at that time show that the main part of this atmosphere is likely ionized water vapor. Cassini also saw geysers of water ice shooting out from Enceladus's south pole. This makes scientists think Enceladus could be putting bits of itself into Saturn's E ring. Scientists began to guess there could be pools of liquid water near the moon's surface that make these eruptions. On March 12, 2008, Cassini flew close to Enceladus, getting within 50 km of its surface. It went through the plumes coming from the southern geysers and found water, carbon dioxide, and different hydrocarbons using its mass spectrometer. Cassini also used an infrared spectrometer to map surface features that are hotter than their surroundings. A problem with its software stopped Cassini from gathering data with its cosmic dust analyzer.\"Cassini Spacecraft to Dive Into Water Plume of Saturn Moon\". \"Cassini Tastes Organic Material at Saturn's Geyser Moon\". . NASA, March 26, 2008 On November 21, 2009, Cassini did its eighth flyby of Enceladus, this time with a different path that took it within 1,600 km of the surface. The Composite Infrared Spectrograph (CIRS) tool made a map of heat coming from the \"tiger stripe\" area known as Baghdad Sulcus. This data made a detailed and high-quality picture of the southern side of the moon facing Saturn. By April 3, 2014, almost ten years after Cassini started orbiting Saturn, NASA shared proof of a large salty ocean of liquid water under Enceladus's icy shell. This salty ocean touches the moon's rocky center and makes Enceladus a top spot in the Solar System that could have alien life. On June 30, 2014, NASA marked ten years of Cassini's trip to Saturn and its moons. They highlighted finding water activity on Enceladus and other big discoveries. In September 2015, NASA said data from Cassini show the way Enceladus moves doesn't fit with its core. This led to the idea that the underground ocean under its ice might cover the whole moon. On October 28, 2015, Cassini flew near Enceladus, getting within 49 km of its surface and going through the ice cloud above the south pole. On December 14, 2023, scientists said they found hydrogen cyanide and other organic matter in the plumes of Enceladus for the first time. This matter could be very important for life, helping alien microbial life to survive or start on the moon. ==== Radio occultations of Saturn's rings ==== In May 2005, Cassini started a series of radio occultation experiments aimed at measuring the size and distribution of particles in Saturn's rings and studying Saturn's atmosphere. For more than four months, the spacecraft orbited Saturn in orbits designed for these experiments. During the experiments, Cassini passed behind Saturn's ring plane as observed from Earth and sent radio waves through the ring particles. Scientists on Earth analyzed the radio signals received, saw changes in frequency, phase, and power of the signal to understand the structure and composition of Saturn's rings. ==== Spokes in rings verified ==== On September 5, 2005, Cassini captured images showing spokes in Saturn's rings, which were first noticed by visual observer Stephen James O'Meara in 1977. The Voyager space probes later confirmed this discovery in the early 1980s. ==== Discovery of lakes on Titan ==== Radar pictures taken on July 21, 2006, seem to reveal lakes of liquid hydrocarbons like methane and ethane in the northern parts of Titan. This marks the first time lakes of this kind have been found anywhere else in the universe besides Earth. These lakes vary in size, ranging from one to one hundred kilometers across. On March 13, 2007, the Jet Propulsion Laboratory announced evidence of seas made of methane and ethane in Titan's northern hemisphere. At least one of these seas is bigger than any of the Great Lakes in North America. ==== Saturn hurricane ==== In November 2006, scientists found a storm at Saturn's south pole with a clear eyewall. This is like hurricanes on Earth but is the first time it's been seen on another planet. Unlike hurricanes on Earth, this storm stays in one place at the pole. It's 8,000 kilometers (5,000 miles) wide and 70 kilometers (43 miles) tall. The wind inside blows at 560 kilometers per hour (350 miles per hour). ==== Iapetus flyby ==== On September 10, 2007, Cassini finished its close pass by the peculiar, two-toned, walnut-shaped moon, Iapetus. Photos were taken from 1,600 kilometers (1,000 miles) above its surface. During transmission of these images to Earth, Cassini was struck by a cosmic ray, causing it to briefly enter safe mode. However, all data from the flyby were retrieved. ==== Mission extension ==== On April 15, 2008, Cassini got funding for a 27-month extension. It meant doing 60 more orbits around Saturn, with 21 close passes by Titan, seven by Enceladus, six by Mimas, eight by Tethys, and one each by Dione, Rhea, and Helene. The extra mission started on July 1, 2008, and was named the Cassini Equinox Mission to match Saturn's equinox. ==== Second mission extension ==== A proposal was sent to NASA for a second mission extension from September 2010 to May 2017, initially named the extended-extended mission or XXM. Approved in February 2010 with a budget of $60 million annually, it was renamed the Cassini Solstice Mission.\"NASA Extends Cassini's Tour of Saturn, Continuing International Cooperation for World Class Science\". This phase involved Cassini orbiting Saturn 155 more times and making 54 additional flybys of Titan, along with 11 more of Enceladus. ==== Great Storm of 2010 and aftermath ==== On October 25, 2012, Cassini saw the aftermath of a huge storm known as the Great White Spot that appears about every 30 years on Saturn. Data from Cassini's composite infrared spectrometer (CIRS) showed a powerful burst from the storm, heating Saturn's stratosphere by 83 K (83 °C; 149 °F) above normal. At the same time, NASA researchers at the Goddard Space Flight Center in Maryland detected a sharp increase in ethylene gas. Ethylene is a colorless gas rare on Saturn, mostly found on Earth from natural and man-made sources. The storm was first spotted by Cassini on December 5, 2010, in Saturn's north. It's the first storm of its kind observed by a spacecraft orbiting Saturn and the first seen in thermal infrared light, which lets scientists study Saturn's atmosphere temperature and hidden processes. The ethylene spike during the storm was 100 times higher than expected on Saturn. Scientists also found it was the largest and hottest vortex ever spotted in the Solar System's stratosphere, initially bigger than Jupiter's Great Red Spot. ==== Venus transit ==== On December 21, 2012, Cassini watched Venus pass in front of the Sun, a rare event known as a transit. Using its VIMS instrument, Cassini studied sunlight as it passed through Venus's atmosphere. Earlier, VIMS had studied a similar event involving the exoplanet HD 189733 b. ==== The Day the Earth Smiled ==== On July 19, 2013, the probe turned towards Earth to take a picture of our planet and the Moon. This was part of a special portrait capturing the entire Saturn system in natural light, using multiple images. It was unique because NASA announced in advance that a long-distance photo was being taken. The imaging team encouraged people to smile and wave towards the skies. Carolyn Porco, a Cassini scientist, described the moment as an opportunity to \"celebrate life on the Pale Blue Dot\". ==== Rhea flyby ==== On February 10, 2015, the Cassini spacecraft made a close visit to Rhea, approaching within 47,000 kilometers (29,000 miles). During this encounter, the spacecraft used its cameras to capture some of the most detailed color images of Rhea to date. ==== Hyperion flyby ==== Cassini's most recent flyby of Saturn's moon Hyperion occurred on May 31, 2015, from a distance of about 34,000 kilometers (21,000 miles). ==== Dione flyby ==== Cassini's final flyby of Saturn's moon Dione took place on August 17, 2015, at a distance of about 475 kilometers (295 miles). An earlier flyby occurred on June 16. ==== Saturn's hexagonal storm changes color ==== Between 2012 and 2016, the hexagonal cloud pattern at Saturn's north pole changed color from mostly blue to more golden. One idea is that this change is due to seasons: as the pole turned towards the Sun, longer exposure to sunlight might have created haze. Before this, from 2004 to 2008, there was less blue color seen across Saturn. File:PIA21049 Changing Colors in Saturn's North.jpg|2012 and 2016: hexagon color changes File:PIA21611 - Saturn's Hexagon as Summer Solstice Approaches.gif|2013 and 2017: hexagon color changes === Grand Finale === Cassini's mission ended by flying close to Saturn and going through its rings. On September 15, 2017, it intentionally entered Saturn's atmosphere and was destroyed. This was done to make sure Saturn's moons, which might have life, would not get any Earth life on them. In 2008, several ways to end the mission were considered. A quick crash into Saturn was rated the best choice because it met all the goals and was cheap and easy to do. Another option was to crash into an icy moon, which was also good because it was cheap and could be done at any time. In 2013–14, there were issues with NASA getting U.S. government funds for the Grand Finale. It turned out that the Grand Finale had two phases, which were like having two different Discovery Program missions. This was different from the main Cassini mission. In late 2014, the U.S. government approved the Grand Finale, costing $200 million. This was much less expensive than making two new probes for separate Discovery missions. On November 29, 2016, the spacecraft flew by Titan, marking the beginning of the Grand Finale phase that ended with its impact on Saturn. Another flyby of Titan on April 22, 2017, changed Cassini's orbit to pass through the gap between Saturn and its inner ring on April 26. During this pass, Cassini came within about 3,100 km (1,900 mi) of Saturn's cloud layer and 320 km (200 mi) from the visible edge of the inner ring, capturing images of Saturn's atmosphere and sending data starting the next day. After completing 22 orbits through the gap, the mission ended with Cassini diving into Saturn's atmosphere on September 15. The signal was lost at 11:55:46 UTC on September 15, 2017, approximately 30 seconds later than thought. It is estimated that the spacecraft burned up about 45 seconds after the last transmission. In September 2018, NASA received an Emmy Award for Outstanding Original Interactive Program for its portrayal of the Cassini mission's Grand Finale at Saturn. In December 2018, Netflix broadcasted \"NASA's Cassini Mission\" as part of their series 7 Days Out, showing the final days of the Cassini mission before the spacecraft crashed into Saturn to complete its Grand Finale. In January 2019, new research from Cassini's Grand Finale phase was published: * Scientists measured Saturn's day length: 10 hours, 33 minutes, and 38 seconds. * Saturn's rings are relatively young, between 10 to 100 million years old. ==== Missions ==== The spacecraft's operations were organized into several missions. Each mission had main funding and goals. * Prime Mission: July 2004 to June 2008. * Cassini Equinox Mission: July 2008 to September 2010, lasting two years longer. * Cassini Solstice Mission: October 2010 to April 2017, also known as the XXM mission. * Grand Finale: April 2017 to September 15, 2017, when the spacecraft was directed into Saturn. Over 260 scientists from 17 countries helped to the Cassini–Huygens mission, with thousands more involved in designing, manufacturing, and launching the mission. 8423 20181 1saturn2016.jpg|Saturn by Cassini, 2016 Cassini Numbers Final.jpg|Cassini-Huygens by the numbers (September 2017) PIA17218 – A Farewell to Saturn, Annotated Version.jpg|Farewell to Saturn and moons (Enceladus, Epimetheus, Janus, Mimas, Pandora and Prometheus) (September 13, 2017) == References == == Other websites == * Spacecraft Cassini is Visiting Saturn! — children's stories explaining the Cassini mission * Cassini-Huygens Main Page at NASA * Cassini Mission Homepage by the Jet Propulsion Laboratory * Cassini-Huygens Mission Profile by NASA's Solar System Exploration * Cassini Imaging Homepage * Cassini information by the National Space Science Data Center (NSSDC). * Photo Gallery - full coverage * Cassini's Tour de Saturn part A, B, C, D, E, F – descriptions of the 4-year tour of Saturn by Bruce Moomaw * SpaceflightNow news coverage of the mission * Countdown to Cancel the Cassini Space Probe by the Baltimore Peace Network in 1997 due to concerns over the use of plutonium Category:NASA spacecraft Category:European Space Agency spacecraft Category:Saturn Category:Spacecraft launched in the 1990s",
 "title": "Cassini–Huygens"
}