{
 "id": "67068",
 "text": "Ferns are a group of about 20,000 species of plants. About 10,000 are living: they are in the division Pteridophyta.Also known as Filicophyta Unlike bryophytes, ferns have xylem and phloem, which makes them vascular plants. Unlike seed plants like angiosperms (flowering plants) or gymnosperms, ferns do not have seeds. Instead, they reproduce by releasing their spores into the environment where the germinate into a Prothallus. Most ferns belong to the Class Leptosporangiata (or Pteridopsida). This includes most of those you see in gardens and woods. The horsetails belong to another class, the Equisetopsida, which was extremely important in the Carboniferous period.Taylor, Thomas N. & Edith L. Taylor. 1993. The biology and evolution of fossil plants. Englewood Cliffs, NJ: Prentice Hall. pp. 303–305. . Only one genus survives. The other classes of fern are also quite small today. Ferns do not have waxes or special cells on their surface that keep water from evaporating. This means that they best live in a place where there is a lot of fog or has a lot of rainfall and is in a shade that protects them from direct sunlight. Most do have roots, stems, and leaves. Their stems may form runners, called stolons above the ground, or rhizomes below ground. The leaves are green and large, and may have spores on the underside. Some ferns grow large in moist places. They can survive in more places than mosses, but not as much as seed plants. During the Carboniferous period – from 350 million years ago – ferns lived everywhere on land. These ferns, called tree ferns grew up to 30 metres. There were huge forests of ferns and mosses, giant horsetails, full of giant insects, etc. Today, there are no large forests of tree ferns and tree ferns are not so large. == Gallery == Image:Dicksonia antarctica in Nunniong, Australia.jpg|Tree ferns, probably Dicksonia antarctica Image:Tree Fern Spores.jpg|Tree fern Spores San Diego Image:Fern-leaf-oliv.jpg|Leaf of fern Image:Equisetopsida.jpg|The horsetail Equisetum telmateia, showing whorls of branches and the tiny dark-tipped leaves == References == == Further reading == * Pryer, Kathleen M., Harald Schneider, Alan R. Smith, Raymond Cranfill, Paul G. Wolf, Jeffrey S. Hunt and Sedonia D. Sipes. 2001. Horsetails and ferns are a monophyletic group and the closest living relatives to seed plants. Nature 409: 618-622 (abstract here). * Pryer, Kathleen M., Eric Schuettpelz, Paul G. Wolf, Harald Schneider, Alan R. Smith and Raymond Cranfill. 2004. Phylogeny and evolution of ferns (monilophytes) with a focus on the early leptosporangiate divergences. American Journal of Botany 91:1582-1598 (online abstract here ). * Moran, Robbin C. 2004. A natural history of ferns. Portland, OR: Timber Press. . * Lord, Thomas R. 2006. Ferns and fern allies of Pennsylvania. Indiana, PA: Pinelands Press. * Smith A.R., K.M. Pryer, E. Schuettpelz, P. Korall, H. Schneider & P.G. Wolf. 2006. A classification for extant ferns. Taxon 55(3):705–731.online available ==Other websites== * Tree of Life Web Project: Filicopsida * A classification of the ferns and their allies * A fern book bibliography * Register of fossil Pteridophyta * L. Watson and M.J. Dallwitz (2004 onwards). The Ferns (Filicopsida) of the British Isles. * Non-seed plant images at bioimages.vanderbilt.edu Category:Pteridophyta",
 "title": "Fern"
}