{
 "id": "67080",
 "text": "Eastern Kurdistan or Iranian Kurdistan is the part of Iran inhabited by Kurds, or the part of Kurdistan that is within Iran. Some of Iranian Kurdistan is in Iran's Kurdistan Province. Iranian Kurdistan is next to the Iraqi Kurdistan. Further to the west are Turkish Kurdistan and Syrian Kurdistan. == Land == Eastern Kurdistan is the name for the western and north-western regions of Iran. Iranian Kurdistan is between the central Zagros Mountains and the north- western international border of Iran. The lands of Kurdistan Province, West Azarbaijan Province, Kermanshah Province, Ilam Province are part of Iranian Kurdistan. The lands in parts of Hamadan Province where people speak Kurdish are also a part of Kurdistan. The area of Iranian Kurdistan is more than . There are important rivers and forests and Kurdistan. At Kermanshah, there is an oil field. Lake Urmia is a salt lake that is the largest lake in Kurdistan. The mountains of Kurdistan have always been important for military strategy. The northern and central Zagros Mountains are where two important trade routes of the Silk Road economic system passed through Iran. The most common crops in all of Kurdistan are cereals and tobacco. The most common livestock in Kurdistan are domestic sheep. Farmers grow strawberries and other fruits in southern Iranian Kurdistan. Saqqez can be one of the coldest places in all Kurdistan. It can be in the winter at Saqqez. == Population == Iran has the second-largest population of Kurds in the world. (Only Turkey has a larger Kurdish population.) Kurds are the third-largest ethnic group in Iran, and only the Persians and Azerbaijani people have larger populations. Iranian Kurdistan is next to Iran's international borders with Turkey, Armenia, and Iraq. There are different estimates of how many Kurds are in Iran. In the Routledge Handbook on the Kurds, scholars write that there are about 7 million Kurds in Iran. The Kurdish population is about one tenth of Iran's whole population. In The Kurds: An Encyclopedia, there scholars write that there are between eight and ten million Kurds in Iran. The Kurdish population is between 11% and 15% of Iran's whole population. Between five and seven million Kurds live in Iranian Kurdistan. Most are Sunni, but about 1.5 million are Shia Kermanshahi Kurds, who have not interest in Kurdistan becoming independent.The Kurdish Nationalist Movement by David Romano, page 235A Modern History of the Kurds by McDowall, page 270 === Kurds in Khorasan === Not all of Iran's Kurds live in Iranian Kurdistan, and many Kurds live in Khorasan Province. There are Kurdish populations in the cities of Khorasan, where there are many Kurdish villages spread over . There may now be about two million Kurds in Khorasan, and many of them speak Kurmanji Kurdish. Most of the Kurds of Khorasan live in villages, but there are also populations in Nishapur, Mashhad, Sabzevar, Quchan, Bojnoord, and Esfarayen. == History == In the past, the land of Kurdistan was in two parts. From the 17th century, one part was inside the Ottoman Empire, and the other part was Iranian Kurdistan. Iranian Kurdistan was inside Iran. Many of the Kurds in Khorasan Province are descendants of the tens of thousands of Kurds whom Abbas the Great, the shah of Iran, moved from Iranian Kurdistan to the borders of Afghanistan and the land that is now Turkmenistan. Shah Abbas's government did this between 1598 and 1610. The government had moved many Kurds there in the 16th century, in order to make the Kurds fight against the Uzbek people who were then attacking Iran. After the Persian Constitutional Revolution of 1905–1911, the Kurds in Iranian Kurdistan's towns supported the new system of local government, but the Kurdish tribes in the countryside supported the shah (the king of Iran). The armies of the Russian Empire took control of Iranian Kurdistan in World War I, during the Persian Campaign. The February Revolution in Russia meant that the Russian provisional government no longer wanted to control Iranian Kurdistan. Nikolai Baratov, a Russian army general acting for the government, made an agreement with the local Iranian Kurds. They would attack the Ottoman army and help the Russians, and the Russian government would help set up an independent Kurdish state. When the Ottoman Empire fell apart after World War I, the British Empire and the French Empire took parts of Ottoman Kurdistan. Although the governments in Britain and France said that a Kurdish state could be set up in Turkish Kurdistan, they did not say that Iranian Kurdistan should join it. Britain and France did not want to anger Iran, and they made no plans for Iranian Kurds to be part of a new Kurdish state. Iran kept Iranian Kurdistan. At a Kurdish congress, Sheikh Ubeydullah brought together Kurds from Iranian Kurdistan and Kurds from the parts of Kurdistan in the Ottoman Empire. Sheikh Ubeydullah worked for the unification of Iranian Kurdistan with Ottoman Kurdistan, and for political independence in Kurdistan. Iran's Islamic Republic stopped letting foreign scholars travel into Iran in the 1980s. Because of this, people outside Iran do not know much about Kurds in Iran or about Iranian Kurdistan. The Iranian government is fighting a slow battle with the Kurdistan Free Life Party (PJAK). The fighting has increased in 2005 and takes place around the Qandil Mountains and the international border with Iraq. The PJAK started as a branch of the Kurdistan Workers' Party (PKK) from Turkish Kurdistan. The United Nations says that the Iranian government oppresses Kurds in Iran. The Iranian government assassinated Iranian Kurdish leaders living in Europe in the 1980s. Asma Jahangir told the United Nations Human Rights Council that almost half of all the political prisoners in Iran were Kurds. One fifth of all the people executed in Iran during 2016 were Kurds. == Languages and writing == Kurds in Iran speak a number of Kurdish languages. Kurdish language is the most important sign of Kurdish cultural identity in Iran. Kurdish is an Iranian language and an Indo-European language like the Persian language, but people that speak Persian do not understand Kurdish. Most Kurds in Iran speak the Sorani dialect. Kurds in the Kurdish cities of Mahabad, Saqqez, Sanandaj, and Marivan speak Sorani. Kurds also speak Sorani in Arbil, Sulaymaniyah, and Kirkuk in nearby Iraqi Kurdistan. In Kermanshah, Kurds speak the Kirmanshani dialect. In the Lorestan area, the Lurs people speak the Luri language. The Luri language has similarities with the Kirmanshani dialect. Kermanshah is next to Lorestan. Around the city of Paveh and some other towns, Kurds speak the Gorani language. Poetry is important for Iranian Kurds, because their position is made difficult by the ideology and oppression of Iran. The culture of Iranian Kurdistan is close to Iraqi Kurdistan's culture. Modern Kurdish language poetry in Iranian Kurdistan came from the Kurdish poetry of modern Iraqi Kurdistan and from modern Persian language poetry. The most important poets are Sware Ilkhanizadeh, Fateh Sheikh, Ali Hasaniani and Solayman Chireh. After the Republic of Mahabad fell in 1946, three important Iranian Kurdish poets moved to Iraqi Kurdistan: Abdurrahman Sharafkandi (known as Hazhar); Muhammad Amin Shiekholeslami (known as Hemin); and Khalid Hisami (known as Hedi). Iraqi Kurdish poetry was most important for Iranian Kurdish poets in the 1980s. From the 1990s, newer poets like Azad Rostami and Behzad Kordestani used newer forms in their poetry. Omid Warzandeh, Raza Alipour, Kambiz Karimi, Jalal Malaksha and Saleh Suzani are now among the poets of Iranian Kurdistan. Some Iranian Kurdish writers have written novels which are important to Kurdish literature. Writers have published novels in Iraqi Kurdistan as well as in Iranian Kurdistan. Ata Nahayee, Qader Hedayati, Shahram Qawami and Kamran Hamidi are among these writers. Many Iranian Kurds have worked to improve Kurdish culture in Iraqi Kurdistan. In Iraqi Kurdistan, written works by Iranian Kurdish writers are very common. Publishers in Arbil and Sulaymaniyah in Iraqi Kurdistan make Sorani Kurdish translations of works written in other Kurdish dialects. Most of the provinces of Iran on the country's international borders (with the inclusion of Iranian Kurdistan) have lower rates of literacy than the average for Iran. Before Iran's Literacy Movement Organization () started, it was mostly madrasas and other Islamic schools that worked for the education of the population in Iranian Kurdistan. These schools did not teach much science or technology, and the teachers taught religion and literature. In Iran, literacy is a synonym for being able to read and write in the Persian language. (Persian is the official language of Iran and the only language used in government schools.) Because of this, many Kurds in Iranian Kurdistan cannot read or write in Kurdish. Many Kurdish children do not learn Kurdish, and tutors and private schools are important in teaching Kurdish language and literature. Although Iran's constitution makes Persian the only official language, it also makes allowance for other languages to be taught and published as a political right. Until the 21st century however, there was a total ban on Kurdish in schools until the Ministry of Education gave approval to Kurdish language teaching in middle schools. In 2015, the Ministry of Science, Research, and Technology gave its approval to a Bachelor of Arts academic degree programme at Sanandaj's University of Kurdistan. There are Kurdish language magazine and newspapers, and there are local television programmes and radio programmes in some Kurdish dialects. == Religion == Many Kurds in Iranian Kurdistan follow the religion of Yarsanism. About 37 percent of the two million people in Kermanshah Province follow Yarsanism. There may be one million followers of Yarsanism altogether. Around Kermanshah, some Kurds belong to Shia Islam. There are Faili Kurds who belong to Shia Islam in both Iranian Kurdistan and Iraqi Kurdistan. Starting in the 1960s, about 150,000 Faili Kurds were sent out of Iraq into Iran. These Faili Kurds could not prove they had citizenship in Iraq because Faili Kurds in the past had not wanted citizenship in the Ottoman Empire. Before the 1950s, there were many Jewish people in Kurdistan. There were 19 Jewish communities in Iranian Kurdistan in 1948. Most Jewish people left Kurdistan after that time, but there is still a population of Jews in Iranian Kurdistan. Iranian Jewish Kurds were more integrated with local people than Jews in the rest of Iran were. In the 1950s, there were 3,000–4,000 Jewish Kurds in Iran. Most of the Jews in Iranian Kurdistan lived in the cities of Sanandaj, Kermanshah and Urmia. Many of them were physicians or merchants. After the Islamic Revolution in Iran, many Jews left Iranian Kurdistan. There used to be many Christian people living in the plain around Urmia who belonged to the Assyrian Church of the East. They were in a lower position in society than the Kurds, the Azerbaijanis, and the Persians. The plain of Urmia is one of the only places in Kurdistan where there is a large Christian population. Most Kurds in Khorasan are Shia Muslim. ==References== *",
 "title": "Eastern Kurdistan"
}