{
 "id": "67096",
 "text": "Cork is a material that is harvested for commercial use primarily from the bark of the Cork Oak tree. As the cork is harvested. Portugal produces 50% of cork worldwide.http://www.pressedforwine.com/equipment/corks.shtml Cork is made up of suberin, a hydrophobic substance. In general, cork is made up of suberin (average of about 40%), lignin (22%), polysaccharides (cellulose and hemicellulose) (18%), extractables (15%) and others. Text was copied from this source, which is available under a Creative Commons Attribution 4.0 International License. ==Properties and uses== Cork's elasticity together with its near-impermeability makes it suitable as a material for bottle stoppers, especially for wine bottles. Cork stoppers represent about 60% of all cork based production. Cork's low density makes it a suitable material for fishing floats and buoys, as well as handles for fishing rods (as an alternative to neoprene). Cork is also used in the manufacture of musical instruments, particularly woodwind instruments, where it is used to fasten together different segments of the instrument and make the seams airtight. Since cork has suberin in its cell walls, this makes the cells consist of sealed elements. And having sealed elements make it greater for acoustic insulation and even thermal insulation. Sealed elements are capable of trapping and absorbing sound. In short, suberin is mostly responsible for noise reduction! Also, lignin is another constituent of cork. It makes up about 22% of cork. One study says that it’s also associated with soundproofing and thermal insulation! The cork industry is generally regarded as environmentally friendly. The sustainability of its production and the easy recycling of cork products and by-products are two of its most distinctive aspects. Cork demand has increased due to a larger proportion of wine being sealed with cork rather than being sold in bulk. Top quality corks are quite expensive, so many cheaper brands have switched to lower quality cork, synthetic plastic stoppers, screwcaps, or other closures. ==Related pages== * Cork cambium == References == == Other websites == * Cork Board Sheets Information * Cork Information * Cork production * Cork Supply USA * Instituto de Promoción del Corcho, Extremadura (Spain) Category:Wood",
 "title": "Cork (material)"
}