{
 "id": "67140",
 "text": "Medical Tourism is when patients visit other countries for medical care. The patients usually come from developed countries to find treatment at lower prices. Over 50 countries have identified medical tourism as a national industry.Gahlinger, PM. The Medical Tourism Travel Guide: Your Complete Reference to Top-Quality, Low-Cost Dental, Cosmetic, Medical Care & Surgery Overseas. Sunrise River Press, 2008 Examples of common medical procedures done for medical tourists are surgeries like joint replacement, heart surgery, cosmetic surgery, weight loss, dental treatment, and addictions rehabilitation (or recovery from addiction). == Etymology == The term medical tourism can also be called medical travel, health tourism or global healthcare. It was initially developed by travel agencies and the mass media to describe the rapidly-growing practice of travelling across international borders to obtain health care.mainly it is for curing people and a lot of countries believe on this. == Countries == Countries that are popular for Medical Tourism are: * Canada * Cuba * Thailand * India * Singapore * Brazil * Mexico * Taiwan *turkey *somalia *Vietnam == Cost savings == To get an idea of the potential cost savings from medical tourism, in Denver, Colorado, USA, a person without health insurance who needs a hip replacement will pay about US$60,000 (EUR 44751).Denver Post July 27, 2007, retrieved Aug. 15, 2007 In comparison, in Cuba, going through medical tourism firm Choice Medical Services, the same procedure costs about US$8000 (EUR 5967) or about an 80 percent savings. == Risks == People who are obese may get medical treatment to lose weight. In Britain there are long waiting lists for weight loss surgery. It is very easy to get this surgery in Turkey. Seven Britons have died after having weight loss surgery there since 2019 and many more have had serious problems. == References == == Other websites == *\"Canadian Firms Offer Cuban Healthcare to US, Canadian Patients\", Miami Herald, Oct. 7, 2007 Category:Tourism Category:Medicine",
 "title": "Medical tourism"
}