{
 "id": "672081",
 "text": "The Ellen Show is a television sitcom created by and starring Ellen DeGeneres. It was broadcast in 2001 and 2002 on CBS. It was the second sitcom that DeGeneres's made. The first one was called Ellen, and was shown on ABC from 1994 to 1998. It was canceled after 13 episodes because it did not have strong ratings. After coming out as a lesbian on her first sitcom, DeGeneres's character on The Ellen Show, Ellen Richmond, was also a lesbian. The Ellen Show also starred Cloris Leachman, Martin Mull, Kerri Kenney, Jim Gaffigan, and Emily Rutherfurd. The show was created by Carol Leifer and Mitchell Hurwitz, who co-wrote the pilot episode. The first title of the show was Ellen Again. the hsow as anncoued In January 2001 with Texas Local News == Plot == After her internet company Homelearn.com goes bankrupt, Ellen Richmond decides to move back to the town she is from to live with her eccentric mother, Dot, and wikt:disorganized sister, Catherine. At home, Ellen meets the guy who was her senior prom date, named Rusty. They think they can continue their romantic relationship where they left off. Ellen also meets her silly high school teacher, Mr. Munn. Though she is a long ways apart from the people who love her, Ellen gets used to a very different way of life. Ellen takes a job as a guidance counselor at the high school she went to. == Cast == === Main === * Ellen DeGeneres as Ellen Richmond * Jim Gaffigan as Rusty Carnouk * Emily Rutherfurd as Catherine Richmond * Martin Mull as Ed Munn * Kerri Kenney as Pam * Cloris Leachman as Dot Richmond * Diane Delano as Bunny Hoppstetter === Guest stars === * Jennifer Irwin as Meg (episode: \"Pilot\") * Regan Burns as Officer \"B\" Arthur (episodes: \"Walden Pond\", \"Joe\"\") * John Francis Daley as Erik (episode: \"Walden Pond\") * Susan Yeagley as Waitress (episode: \"Chain Reaction\") * Marissa Jaret Winokur as Tina (episode: \"Vanity Hair\") * Tom Poston as Joe (episode: \"Joe\") * Betty White as Mrs. Gibson (episode: \"Missing the Bus\") * Dakota Fanning as Young Ellen (episode: \"Missing the Bus\") * Mary Tyler Moore as Aunt Mary (episode: \"Ellen's First Christmess\") * Ed Asner as Santa Claus (episode: \"Ellen's First Christmess\") * John Ritter as Percy Moss (episode: \"Gathering Moss\") * Maureen McCormick as Rita Carter (episode: \"Shallow Gal\") * Kaley Cuoco as Vanessa Carter (episode: \"Shallow Gal\") == Episodes == The Ellen Show made 18 episodes, but was canceled part-way through its season. The final 5 episodes were never broadcast, but are available on DVD. No. Title Original air date 1 \"Pilot\" 2 \"Walden Pond\" September 28, 2001 (2001-09-28) 3 \"Chain Reaction\" 4 \"Vanity Hair\" October 12, 2001 (2001-10-12) 5 \"The Move\" 6 \"Muskrat Love\" October 26, 2001 (2001-10-26) 7 \"Joe\" November 2, 2001 (2001-11-02) 8 \"Cathy's Taffy\" 9 \"Missing the Bus\" November 16, 2001 (2001-11-16) 10 \"Alive and Kicking\" December 10, 2001 (2001-12-10) 11 \"Ellen's First Christmess\" 12 \"A Bird in the Hand\" January 4, 2002 (2002-01-04) 13 \"Just the Duck\" January 11, 2002 (2002-01-11) 14 \"Shallow Gal\" 15 \"Gathering Moss\" Unaired 16 \"A Matter of Principal\" Unaired 17 \"Where the Sun Doesn't Shine\" Unaired 18 \"One for the Roadshow\" Unaired == Home media == The whole series was put on Region 1 DVD by Sony Pictures Home Entertainment on July 11, 2006. In 2014, Mill Creek Entertainment bought the rights to the series. They re-made the full series on February 4, 2014. The company Paramount Pictures Home Entertainment, in partnership with CBS Home Entertainment, owns the international rights. The full series was released in Region 4 (Australia) as a 2 DVD set on February 1, 2017 by a company called Umbrella Entertainment. == References == == Other websites == * Category:2000s American sitcoms Category:2001 American television series debuts Category:2002 American television series endings Category:CBS network shows Category:Television series set in Los Angeles Category:English-language television programs *[No.]: Number",
 "title": "The Ellen Show"
}