{
 "id": "672217",
 "text": "Russell Thurlow “Russ” Vought (born March 26, 1976) is an American political aide and government official who has been the 44th Director of the Office of Management and Budget since 2025. He served in this role before from 2020 to 2021 as the 42nd director. He was also the Deputy Director of the Office of Management and Budget from 2018 to 2020. Before this, he was the vice president of Heritage Action for seven years. He also was a legislative assistant for U.S. Senator Phil Gramm. In January 2019, Vought became Acting Director of the Office of Management and Budget. On March 18, 2020, President Trump announced his intent to nominate him to be the full time Director of the Office of Management and Budget. Vought became the permanent director on July 22, 2020. He left office in January 2021 after the inauguration of Joe Biden. In 2021, Vought founded the organization the Center for Renewing America, which is focused against critical race theory. He is involved with Project 2025, a Heritage Foundation plan that wants to reshape the federal government. In November 2024, President-elect Trump nominated Vought to be the Director of the Office of Management and Budget again for his second administration. Vought has been seen as a Christian nationalist who wants the government and society to have some parts of Christianity forced onto them while supporting some parts of separation between church and state. == Early life == Vought was born in Illinois. He earned his Bachelor of Arts from Wheaton College and his Juris Doctor from the George Washington University Law School. Vought worked for Heritage Action, the lobbying group of The Heritage Foundation. He was the executive director and budget director of the Republican Study Committee, the policy director for the Republican Conference of the United States House of Representatives, and a legislative assistant for U.S. Senator Phil Gramm. ==First Trump administration== ===Deputy OMB Director=== In April 2017, President Donald Trump nominated Vought to be deputy director of the Office of Management and Budget (OMB). He was confirmed by the United States Senate on February 28, 2018, in a 50–49 vote. Vice President Mike Pence cast the tie- breaking vote. In 2019, Vought was one of nine government officials who rejected a subpoena to testify before Congress in relation to the Trump–Ukraine scandal and the administration's decision to freeze military aid to Ukraine. ====First OMB Director tenure==== On January 2, 2019, when OMB Director Mick Mulvaney became acting White House chief of staff. This caused Vought to become the acting OMB director. On March 18, 2020, Trump announced his plans to nominate him to be the permanent OMB Director. Vought was confirmed by the Senate on July 20, 2020, by a vote of 51–45; and was sworn in two days later. On September 4, 2020, Vought published an OMB memo, supported by Trump, telling federal agencies to identify all contracts or other agency related to any training on \"critical race theory\" or \"white privilege\". After Joe Biden won the 2020 presidential election, he and his transition team said that Vought made it harder for the presidential transition by not allowing the incoming Biden officials to meet with OMB staff. Vought defended his actions, saying the that OMB had given funding for the transition and that there had been more than 45 meetings with Biden officials. ==After first Trump administration== In January 2021, Vought started an organization called the Center for Renewing America and an advocacy group called American Restoration Action. The groups were aimed at keeping Trump's movement active after he left the White House. He also became a critic of critical race theory. During the 2024 presidential election, Vought was involved with Project 2025. The project is a conservative and right-wing policy proposals from The Heritage Foundation to change the United States federal government. ==Return to the Trump administration== ===Second OMB Director tenure=== On November 21, 2024, President-elect Trump nominated Vought to be the Director of the Office of Management and Budget again for his second administration. Vought appeared before the Senate Committee on Homeland Security and Governmental Affairs on January 15, 2025. During the hearing, Vought did not promise to spend all the money given by the United States Congress to the federal government. The committee approved his nomination in a 11-0 vote, with all 9 Democrats and 1 Independent boycotting the vote due to the recent federal spending freeze. The Senate voted 53-47 on February 6 to approve his nomination. After taking office the next day, Vought was also made acting director of the Consumer Financial Protection Bureau. ==Notes== ==References== ==Other websites== * Center for Renewing America * |- |- Category:1976 births Category:Living people Category:Politicians from Illinois Category:Republican Party (United States) politicians Category:Directors of the Office of Management and Budget Category:American Christians Category:Politicians from Virginia Category:Politicians from New York (state)",
 "title": "Russell Vought"
}