{
 "id": "672242",
 "text": "Opole Voivodeship is one of the 16 Voivodeships of Poland. It can be found in the southern Poland. It is mostly in the historical land Upper Silesia. The capital of the Voivodeship is Opole. It was created on 1 January 1999. ==Administrative division== Opole Voivodeship is divided into 12 counties (powiats): 1 city county and 11 land counties. These are further divided into 71 gminas. English and Polish names Area (km²) Population (2020) Seat Other towns Total gminas City counties City counties City counties City counties City counties City counties Opole 148,88 128 012 1 Land counties Land counties Land counties Land counties Land counties Land counties Nysa County powiat nyski 1223,88 135 524 Nysa Głuchołazy, Korfantów, Otmuchów, Paczków 9 Opole County powiat opolski 1534,30 123 813 Opole* Niemodlin, Ozimek, Prószków, Tułowice 13 Kędzierzyn-Koźle County powiat kędzierzyńsko-kozielski 625,13 93 544 Kędzierzyn-Koźle 6 Brzeg County powiat brzeski 875,96 89 632 Brzeg Grodków, Lewin Brzeski 6 Strzelce County powiat strzelecki 744,27 74 171 Strzelce Opolskie Kolonowskie, Leśnica, Ujazd, Zawadzkie 7 Kluczbork County powiat kluczborski 851,91 65 266 Kluczbork Byczyna, Wołczyn 4 Olesno County powiat oleski 973,38 64 167 Olesno Dobrodzień, Gorzów Śląski, Praszka 7 Krapkowice County powiat krapkowicki 441,80 63 580 Krapkowice Gogolin, Zdzieszowice 5 Prudnik County powiat prudnicki 571,55 55 091 Prudnik Biała Prudnicka, Głogówek 4 Głubczyce County powiat głubczycki 672,63 45 291 Głubczyce Baborów, Kietrz 4 Namysłów County powiat namysłowski 748,18 42 680 Namysłów 5 * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county ==Protected areas== Protected areas in Opole Voivodeship include three Landscape Parks. These are listed below. *Opawskie Mountains Landscape Park *Góra Świętej Anny Landscape Park *Stobrawa Landscape Park == Gallery == File:Town hall in Opole.JPG|Opole File:WK15 Kędzierzyn-Koźle (35) Lichen99.jpg|Kędzierzyn-Koźle File:2014 Nysa, stare miasto 03.JPG|Nysa File:Brzeg Op.JPG|Brzeg File:Kluczbork - Rynek 01.jpg|Kluczbork File:Rynek i ratusz w Prudniku (2020) 02.jpg|Prudnik File:Ratusz Strzelce Opolskie.JPG|Strzelce Opolskie File:Rynek Krapkowice 2.jpg|Krapkowice Category:1999 establishments in Poland Category:Opole Voivodeship",
 "title": "Opole Voivodeship"
}