{
 "id": "672232",
 "text": "The discography of Britt Nicole, an American Christian pop singer-songwriter, consists of five studio albums, three extended plays, eleven singles, three promotional singles, five music videos and three album appearances. On May 22, 2007 she released her second album Say It. It peaked at fourth on Hot Christian Albums. The debut single from the album, \"You\", was released on March 27, 2007 and reached the Top 10 on Hot Christian Songs. The second single, \"Sunshine Girl\", was featured on MTV's teen reality show Newport Harbor: The Real Orange County. Nicole's first music video, for the song \"Believe\", premiered on the Gospel Music Channel on September 22, 2007. \"Set the World On Fire\" was released as third single. The third album, The Lost Get Found, was released on August 11, 2009 and peaked No. 1 on Hot Christian Albums. The same month, a music video for her song \"Holiday\" surfaced on the internet. Her second single, \"Walk on The Water\", peaked No. 17 on the Hot Christian Songs. Overseas, the song \"Headphones\" was promoted as her second single in the United Kingdom. In March 26, 2012 she released her fourth album, Gold. The album debuted at No. 1 on the Hot Christian Albums and 41 on the Billboard 200. The singles \"Stand\" and \"Breakthrough\" were released to United States and United Kingdom Christian radio, respectively, in the fall of 2012. The former peaked at No. 11 on U.S. Christian contemporary hit radio and the latter peaked at No. 3 on UK Christian radio. In December 2012, she released two Christmas music videos, \"Jingle Bell Rock\" and \"O Holy Night\". Britt Nicole is co-signed to Capitol Records and released \"Gold\" as her debut mainstream single on December 4, 2012. The following year Gold was re-released as a mainstream album. In March 2015, she released a full-length remix album, The Remixes. On October 7, 2016 she released her fifth studio album, Britt Nicole. ==Albums== ===Studio albums=== List of studio albums, with selected chart positions Title Album details Peak chart positions Sales US US Christ US Heat Follow the Call * Released: January 10, 2003 * Label: Independent — — — Say It * Released: May 22, 2007 * Label: Sparrow — 40 45 The Lost Get Found * Released: August 11, 2009 * Label: Sparrow 62 1 — Gold * Released: March 26, 2012 * Label: Sparrow 41 1 — *US: 124,000 Britt Nicole * Released: October 7, 2016 * Label: Sparrow 100 — — \"—\" denotes releases that did not chart or were not released in that territory. ===Compilations=== List of compilation albums, with selected chart positions Title Album details Peak chart positions US Christ The Remixes * Released: March 17, 2015 * Label: Sparrow 27 \"—\" denotes releases that did not chart or were not released in that territory. ==Extended plays== List of extended plays, with selected chart positions Title Details Peak chart positions US Christ Brittany Waddell * Released: January 10, 2004 * Label: Independent — Holiday Trio * Released: November 20, 2007 * Label: Sparrow — Acoustic * Released: August 24, 2010 * Label: Sparrow 22 \"—\" denotes releases that did not chart or were not released in that territory. ==Singles== ===As lead artist=== List of singles, with selected chart positions and certifications Title Year Peak chart positions Certifications Album US US Pop US Christ US Dance AUS Christ List of Britt Nicole's singles on The Rock Across Australia: * \"You\": * \"Believe\": * \"Stand\": * \"Gold\": UK Christ * \"Headphones\": * \"Safe\", \"Have Your Way\" and \"Welcome to the Show\": * \"Breakthrough\": \"You\" 2007 — — 6 — 2 — Say It \"Believe\" — — — — — — \"Set the World on Fire\" 2008 — — 11 — 7 — \"Don't Worry Now\" 2009 — — — — — — \"The Lost Get Found\" — — 8 — — — The Lost Get Found \"Walk on the Water\" — — 17 — — — \"Hanging On\" 2010 — — 19 — — — \"Headphones\" 2011 — — — — — 2 \"All This Time\" 2012 — — 3 — — — Gold \"Stand\" — — 36 — 7 2 \"Gold\" 83 28 16 33 3 — * RIAA: Gold \"Ready or Not\" (featuring Lecrae) 2013 — — 25 — — — \"O Come All Ye Faithful\" — — 12 — — — WOW Christmas 2013 \"The Sun Is Rising\" 2015 — — 26 — — 7 Gold \"Through Your Eyes\" 2016 — — 20 — — 4 Britt Nicole \"Pave\" — — — — — — \"Be the Change\" 2017 — — 22 — — — \"—\" denotes releases that did not chart or were not released in that territory. ===As featured artist=== List of singles, with selected chart positions and certifications Title Year Peak chart positions Album US Christ US Christ Rock \"We Three Kings\" (Tenth Avenue North featuring Britt Nicole) 2013 49 — WOW Christmas 2013 \"Dark Days, Darker Nights\" (Tedashii featuring Britt Nicole) 2014 — 15 Below Paradise \"You're Not Alone\" (Owl City featuring Britt Nicole) 2 — Mobile Orchestra \"—\" denotes releases that did not chart or were not released in that territory. ===Promotional singles=== List of singles Title Year Album \"Look Like Love\" 2012 Gold ==Other charted songs== List of singles, with selected chart positions and certifications Title Year Peak chart Album UK Christ \"Safe\" 2010 3 The Lost Get Found \"Have Your Way\" 4 \"Welcome to the Show\" 4 \"Breakthrough\" 2012 3 Gold \"Seeing for the First Time\" 2013 1 \"Amazing Life\" 1 \"Holiday (MyKidBrother Remix)\" 2015 2 The Remixes \"—\" denotes releases that did not chart or were not released in that territory. ==Other appearances== Title Year Other artist(s) Album \"Indestructible\" 2006 WOW Next 2007 \"Dusk Till Dawn\" 2008 GRITS Reiterate \"Glow\" 2009 rowspan=\"4\" Now Hear This: Fall 2009 \"Like a Star\" 2011 Soul Surfer \"Set the World on Fire\" \"Last Christmas\" WOW Christmas 2011 \"Eye On It\" 2012 tobyMac Eye On It \"Born to Love\" 2013 Capital Kings Capital Kings \"The Sun is Rising\" 2014 The Other Woman \"Can You Hold Me\" 2015 NF Mansion ==Music videos== List of music videos, showing director Title Year Director \"Believe\" 2007 Britt Nicole \"Holiday\" 2009 rowspan=\"2\" \"The Lost Get Found\" \"Headphones\" 2010 Britt Nicole \"Gold\" 2012 Josh Forbes \"Pave\" 2016 \"Be the Change\" 2017 ==Notes== *A: as Brittany Waddell ==References== Category:Discographies of American artists",
 "title": "Britt Nicole discography"
}