{
 "id": "67229",
 "text": "A neighbourhood or neighborhood is a geographic community in a larger city, town or suburb. Neighbourhoods are often social communities because the people that live in them commonly talk with each other. Researchers have not agreed on an exact definition. ==Preindustrial cities== According to urban scholar Lewis Mumford, Neighbourhoods have always exist where humans live. Many of the functions of the city are usually distributed into neighbourhoods.Mumford, Lewis (1954) The Neighborhood and the Neighborhood Unit. Town Planning Review 24:256–270, p. 258 Archaeologists have found evidence of neighbourhoods in the ruins of most of the earliest cities around the world.For example, Spence, Michael W. (1992) Tlailotlacan, a Zapotec Enclave in Teotihuacan. In Art, Ideology, and the City of Teotihuacan, edited by Janet C. Berlo, pp. 59–88. Dumbarton Oaks, Washington, DC. Stone, Elizabeth C. (1987) Nippur Neighbourhoods. Studies in Ancient Oriental Civilization vol. 44. Oriental Institute, University of Chicago, Chicago Historical documents give information about neighbourhood life in many historical preindustrial or nonwestern cities.Some examples: Heng, Chye Kiang (1999) Cities of Aristocrats and Bureaucrats: The Development of Medieval Chinese Cityscapes. University of Hawai'i Press, Honolulu. Marcus, Abraham (1989) The Middle East on the Eve of Modernity: Aleppo in the Eighteenth Century. Columbia University Press, New York. Smail, Daniel Lord (2000) Imaginary Cartographies: Possession and Identity in Late Medieval Marseille. Cornell University Press, Ithaca. Neighbourhoods are usually created by social interaction between people living near each another. They are local social groups larger than households that are not under the control of city or state officials. In some early urban traditions, basic municipal functions such as protection, marriages, cleaning and repairs are done by neighbourhoods. This is shown to have happened in historical Islamic cities.Abu-Lughod, Janet L. (1987) The Islamic City: Historic Myth, Islamic Essence, and Contemporary Relevance. International Journal of Middle Eastern Studies 19:155–176. Most ancient and historical cities also had administrative districts. These were used by the government for taxation and social control.Dickinson, Robert E. (1961) The West European City: A Geographical Interpretation. Routledge & Paul, London, p. 529. See also: Jacobs, Jane (1961) The Death and Life of Great American Cities. Random House, New York, p. 117. Administrative districts are usually larger than neighbourhoods. They often cover areas that are larger than just one neighbourhood. Sometimes, administrative districts are just one neighbourhood. This leads to a lot of control of social life by officials. For example, in the T’ang period Chinese capital city Chang’an, neighbourhoods were districts. There were state officials who controlled life and activity at the neighbourhood level.Xiong, Victor Cunrui (2000) Sui-Tang Chang'an: A Study in the Urban History of Medieval China. Center for Chinese Studies, University of Michigan, Ann Arbor. Neighbourhoods in very old cities often grouped certain people together. Ethnic neighbourhoods were important in many old cities. They are still common in cities today. Economic specialists, including craft makers, merchants, and others, could be grouped together in neighbourhoods. There were also neighbourhoods based around certain religions. One important part to neighbourhood being different from each other and their people getting along well was how people moved from rural areas to the cities. This was always happening in old cities. The people moving to the cities often moved in with relatives and people they knew from before moving to the city.Kemper, Robert V. (1977) Migration and Adaptation: Tzintzuntzan Peasants in Mexico City. Sage Publications, Beverly Hills. Greenshields, T. H. (1980) \"Quarters\" and Ethnicity. In The Changing Middle Eastern City, edited by G. H. Blake and R. I. Lawless, pp. 120–140. Croom Helm, London.l;; ==Regions== ===Asia=== ====China==== In the mainland of the People's Republic of China, the term is usually used for the urban administrative division. These divisions are found below the district level. A subdistrict level may exists in some cities. They are also called streets. The naming may be different from one city to another. Neighbourhoods usually have 2,000 to 10,000 families. Within neighbourhoods, families are grouped into smaller groups of 100 to 600 families. These smaller groups are supervised by a residents' committee. These groups are often broken down into even smaller groups of fifteen to forty families. In most urban areas of China, neighbourhood, community, residential community, residential unit, residential quarter have the same meaning. ====Turkey==== Neighbourhood () in Turkey is an administrative unit within municipalities. It has an official status but no governmental powers. Neighbourhoods are administered by the Mukhtar and the \"Neighbourhood Seniors Council\". This is a group of 4 people. The mukhtar is elected by the people living in the neighbourhood. He is an administrator of the district governor. Mukhtar also has a seat at the City Assembly. This is an organization for the coordination of the public institutions in the city. Neighbourhood administrators get a salary from the Central Government. They also get money from the fees paid for dealing with certain documents.Koçberber, Seyit (2007) Yeni Belediye Yasası ile Mahalle Yönetimi, Sayıştay Journal 56:103–114 (in Turkish) ===Europe=== ====United Kingdom==== The term has no official use in the United Kingdom. It is often used by local boroughs for sub-divisions of their area for the delivery of certain services and functions.As for example in Kingston upon Thames Kingston Council website It is also used as a term to refer to a small area within a town or city. The term is commonly used to refer to organisations which deal with such a very local issues, such as neighbourhood policing or Neighbourhood watches. Government statistics for local areas are often called neighbourhood statistics even though the data is usually broken down into districts and wards. ===North America=== In Canada and the United States, neighborhoods often have official or semi-official status. This is commonly done using neighbourhood associations, neighbourhood watches, or block watches. These may deal with such things as lawn care and fence height. They may provide such things as block parties, neighbourhood parks, and community security. In some other places the organisation is the parish. A parish may have several neighbourhoods in it depending on the area. ==Related pages== * Barrio (Spanish) * Burough * Community * Frazione (Italian) * Unincorporated community ==References== ;Notes ==Other websites== *",
 "title": "Neighbourhood"
}