{
 "id": "672404",
 "text": "Daniel Hernandez (born May 8, 1996), known professionally as 6ix9ine (pronounced \"six nine\") and formerly as Tekashi69, is an American rapper and songwriter. Hernandez is known for his distinctive rainbow-themed look, tattoos, aggressive style of rapping, public feuds with fellow celebrities, legal issues, and controversial public persona. Hernandez gained popularity in late 2017 with the release of his first single \"Gummo\". The song was certified platinum by the RIAA. In early 2018, Hernandez released his first mixtape Day69. It debuted at number four on the Billboard 200 album chart. He later earned his first top-five entry on the Billboard Hot 100 with \"Fefe\" (featuring Nicki Minaj and Murda Beatz), which peaked at number three. His first studio album Dummy Boy was released on November 27, 2018 after being delayed a week earlier due to his arrest. It debuted at number two on the Billboard 200 chart. Hernandez pled guilty to using a 13-year-old child in a sexual performance in 2015. He was arrested in November 2018 on racketeering and firearm charges among others. Hernandez pled guilty to nine charges in February 2019. On December 18, 2019, Hernandez was given a sentence of two years after testifying against the Nine Trey Gang. On March 22, 2020, Hernandez requested to serve prison at home because he is at a higher risk of attracting the COVID-19 due to his asthma.Rapper Tekashi 6ix9ine is requesting home confinement over coronavirus fears, arguing that his asthma puts him 'at very high risk of death' in prison Hernandez is of Mexican and Puerto Rican descent. == Discography == * Dummy Boy (2018) * TattleTales (2020) * Leyenda Viva (2023) * Blackballed (2024) ==References== Category:1996 births Category:Living people Category:21st-century American rappers Category:Mexican rappers Category:American Roman Catholics Category:American people convicted of drug offenses Category:American songwriters Category:Criminals from New York City Category:Gangsta rappers Category:Musicians from Brooklyn Category:Pseudonyms Category:Puerto Rican rappers Category:Rappers from New York (state)",
 "title": "6ix9ine"
}