{
 "id": "672819",
 "text": "Kinderhook is a town in the northern part of Columbia County, New York, United States. The population was 8,330 as of 2020, making it the municipality with the most people in the county. The name of the town comes from the phrase \"bend in the corner where the children are\" in the language of the original Dutch settlers, by the Dutch word Kinderhoek. The eighth president of the United States, Martin Van Buren was born in Kinderhook. The city of Kinderhook has two villages and one hamlet. == Etymology == Kinderhook was originally spelled 'Kinderhoek' by famous explorer Henry Hudson in 1609, when spotting some American Indian children looking at his ship, the Half Moon sailing upstream. == History == Hudson had many other encounters with the Indians, who were from the Mohican tribe, such as trading and skirmishing. When the Dutch settled Kinderhook, they had further warfare. However, the Dutch prevailed and established it as a district in 1772 and a town in 1788. Since then, the town lost a lot of land to other towns. In 1775, Chatham took a significant portion of the town, followed by Ghent in 1818 and Stuyvesant in 1823. Kinderhook is one of the original towns of Columbia County and as a result is the most populous. == Geography == The town has a total area of 32.4 square miles (83.9 km2), of which 31.8 square miles (82.4 km2) is land and 0.6 square miles (1.6 km2), or 1.87%, is water, including Kinderhook Lake, Kinderhook Creek, and the waterfalls of Valatie. The north part of the town forms the border between Columbia and Rensselar County. U.S. Route 9 and New York State Route 9H pass through Kinderhook. == Arts and culture == The retirement home of U.S. President Martin Van Buren, Lindenwald is in Kinderhook, as well as the famous Luykas Van Alen House, a National Historic Landmark said to be the inspiration for the Van Tassel Family in Washington Irving's book \"The Legend of Sleepy Hollow\", along with character Jesse Merwin. In honour of this fact, the Ichabod Crane schoolhouse was built next to the van Alen House in 1850, and is also a National Historic Landmark. The other two Landmarks are the James Vanderpoel House of History and the CCHS Museum & Library Building. The Columbia County Historical Society has its headquarters in Kinderhook. In addition to managing the four National Historic Landmarks of Kinderhook, it owns and displays a permanent collection of important genealogical materials, along with paintings, furniture, and other art related to the culture of Columbia County. The Martin Van Buren Public School now no longer holds classes, but does have an international gallery of contemporary art, named The School. It is owned by the Jack Shainman Gallery in New York City. == Demographics == In the 2020 census, there were 8,330 people. The races in Kinderhook were 88.5% white, 1.5% black or African American, 0.5% Native American or Alaska Native, 1.5% Asian, 2.1% from other races, and 5.9% two or more races. In the town, the population was spread out with 17.9% under the age of 18, 56.4% between the ages of 18 and 65, and 25.7% above the age of 65. The median age was 49.5 years. In 2022, the median income for full-time year- round workers in Kinderhook was about $71,758 for males and $68,013 for females. == Government == , the current town supervisor is Tim Ooms. == Famous Residents == Famous residents of Kinderhook include: * John Faso (R), 2017-2019 U.S. Representative from New York's 19th congressional district, 1987-2002 Member of the New York State Assembly from the 102nd assembly district * Chris Gibson (R), 2011-2013 U.S. Representative from New York's 20th congressional district, 2013-2017 U.S. Representative from New York's 19th Congressional District, Colonel, Veteran in the Persian Gulf War, Kosovo Force, and Operation Iraqi Freedom * William Slocum Groesbeck (D), 1857-1859 U.S. Representative from Ohio's 2nd congressional district, 1862-1864 U.S. Representative from Ohio's 1st congressional district * Washington Irving, short-story writer, essayist, biographer, historian, and diplomat, lived in Kinderhook for 8 weeks in 1809 * Mariela Jácome, forward or midfielder playing for the St. John's Red Storm and Ecuador National Team in the 2015 FIFA Women's World Cup. * Lady Randolph Churchill, mother of Winston Churchill * Jesse Merwin, Kinderhook schoolteacher known as the original Ichabod Crane * John Woodward Philip, Rear Admiral for the United States Navy during the American Civil War and Spanish–American War * Donald L. Rutherford, Roman Catholic Priest, Veteran in the Gulf War, War on Terror, and Operation Iraqi Freedom * Nicholas Sickles (D), 1835-1837 U.S. Representative from New York's 7th congressional district * John Evert van Alen (F), 1793-1799 U.S. Representative from New York's 7th Congressional District * Martin Van Buren (D), 1837-1841 President of the United States, 1833-1837 Vice President of the United States, 1831-1832 United States Ambassador to the United Kingdom, 1829-1831 United States Secretary of State, 1829 Governor of New York. 1815-1819 Attorney General of New York * Cornelius Peter Van Ness (D-R), 1844-1845 Collector of the Port of New York, 1829-1836 Envoy Extraordinary and Minister Plenipotentiary to the Kingdom of Spain, 1823-1826 Governor of Vermont and 1810-1813 Attorney General of Vermont * Peter van Schaack, lawyer and British Loyalist during the American Revolution == In popular culture == * The character Pat Soliano in Silver Linings Playbook (2012) explains the origin of the word \"OK\", mentioning Kinderhook. * Some of The Cake Eaters (2007) was shot in Kinderhook. * Hero (2000) was shot in Kinderhook. * Some of The Age of Innocence (1993) was shot in the Van Alen House, Kinderhook. * The character Pat Blundetto in The Sopranos owned a farm at 146 Route 9A, Kinderhook, along with references to Ichabod Crane through the character Tony Blundetto. * Rasputina's Sister Kinderhook is centred around the Dutch heritage in Kinderhook and other New Netherland settlements in New York. == References == Category:Towns in New York (state)",
 "title": "Kinderhook, New York"
}