{
 "id": "672986",
 "text": "YouTube is blocked in many schools because it allows children to search for videos online that could distract them from their lessons, much like how other social networking sites and game sites are blocked for the same purpose. But at a higher level than schools (and in workplaces), even some governments have blocked YouTube access to their country's public, but their reasons can vary. == North Korea == On April 1, 2016, the government of North Korea blocked YouTube due to unknown reasons with other social media websites. == Iran == On December 3, 2006, the government of Iran blocked YouTube and several other sites to stop movies and music from other countries from being seen. == Turkey == Turkey blocked YouTube on March 6, 2007 for letting videos that were mean or discriminating to Turks and Atatürk, who is the founder of modern Turkey, be shown, because of a \"virtual war\" between Greeks, Armenians, Kurds and Turkish people on YouTube, with people from each side posting videos to hurt the other. The video that caused the banning said that Turks and Atatürk were 'gay'. The video was first mentioned on Turkish CNN and the Istanbul public prosecutor sued YouTube for being mean to Turkishness. The court suspended access to YouTube while waiting for the removal of the video. The ban was criticized a lot. YouTube lawyers sent proof of removal to court and users could access the website again on March 9 2007. == Thailand == During the week of March 8, 2007 YouTube was blocked in Thailand. Many bloggers (people who have a \"diary\" online) believed the reason YouTube was blocked was because of a video of the former Prime Minister Thaksin Shinawatra's speech on CNN. However, the government did not confirm or give reasons for the ban. YouTube was unblocked on March 10. On the night of April 3, YouTube was again blocked in Thailand. The government said a video on the site was \"insulting\" to King Bhumibol Adulyadej. The Ministry of Information and Communication Technology claimed that it would unblock YouTube in a few days, after websites with references to this video were blocked instead of the entire website. Communications Minister Sitthichai Pookaiyaudom said, \"When they decide to withdraw the clip, we will withdraw the ban.\" Soon after this incident, the internet technology blog Mashable was banned from Thailand over the reporting of the YouTube clips in question. == Brazilian model lawsuit and banning that came after == YouTube was sued by Brazilian model and MTV VJ Daniela Cicarelli (better known as Ronaldo's ex-fiancée) because she said that the site had a video made by paparazzi (or celebrity photographer), in which she and her boyfriend are having sex on a Spanish beach. The lawsuit says that YouTube has to be blocked in Brazil until all copies of the video are removed. On Saturday, January 6, 2007, a legal injunction (\"command\") ordered that filters be put in place to prevent users in Brazil from going to the website. The effectiveness of the measure has been questioned, since the video is not available only on YouTube, but rather has become an Internet phenomenon. On Tuesday, January 9, 2007, the same court overturned their earlier decision, ordering the filters to be taken down, even though the footage was still forbidden, but without technical support for its blockage. == Morocco == On May 25, 2007 the state-owned company Maroc Telecom blocked all access to YouTube. There were no reasons given why YouTube was blocked. But the guesses are that it might have something to do with some pro-separatist group Polisario clips (Polisario is the Western Sahara independence movement) or because of some videos that criticized King Mohammed VI. This block did not concern the other two private internet-providers, Wana and Meditel. YouTube became accessible again on May 30, 2007 after Maroc Telecom unofficially announced that the denied access to the website was only a \"technical glitch\". == Australia == In Australia, some schools, including all secondary schools in Victoria, have YouTube blocked from student access, after fights have been posted on YouTube. == China & Eritrea == in 2015 in China, the government blocked YouTube. For several years it was unblocked but since the past five years it has been blocked. After Eritrea banned YouTube in December 2017, Eritrea got it's own YouTube named “Woo!” in February 2024. ==References== Category:Censorship Category:YouTube",
 "title": "Censorship of YouTube"
}