{
 "id": "673025",
 "text": "Queen Zaynab Otiti Obanor is a former Nigerian queen and former wife of Nigerian monarch Adeyeye Enitan Ogunwusi. In 2017, she was awarded Humanitarian of The Year by United Nations. ==Personal life== Zaynab was born and raised in the ancient royal bronze casters lineage tribe located in ancient Benin Kingdom. In March 2016, Zaynab was married to Oba Adeyeye Enitan Ogunwusi, a traditional ruler of the Yoruba kingdom of Ile-Ife since 2015. In 2017, she filed a divorce with Adeyeye Enitan Ogunwusi. The divorce was finalized on August, 2017. According to The Premium Times, Nigeria, \"Zaynab Otiti-Obanor has congratulated the monarch and his new bride, Naomi Oluwaseyi, on their marriage\". Zaynab started a fresh life after the separation and released an official statement. The Edo State-born and formal Queen of the Ooni of Ife Oba Adeyeye Enitan Ogunwusi delivered a baby girl in Quatar few years after her divorce with the King. ==Philanthropy== Zaynab is also known for her philanthropic works. Zaynab has been working as an ambassador of the United Nations Population Fund (UNFPA), which is known for promoting women's and children's rights, health and equity. Notably, she founded The Queen of Ile Ife Foundation (QIIF) and PROJECT SIWAJU to support women and children. In 2017, she attended at spoke at a global campaign Deliver for Good, that promotes gender less Sustainable Development Goals. She has launched several humanitarian & philanthropic initiatives to promote peace and unity across African nations. She founded The Arab African Economic Development Initiative (AAEDI), a primary objective of the non-governmental organization, to advance and strengthen ties between the African nation and the Arab nation through culture and economic initiatives. Zaynab advocates for the global emancipation of underprivileged communities. The work of the Queen is mainly directed at rural communities, women, and children who have traditionally been left out of large-scale development initiatives. Her commitment to empowering local leaders to uplift communities informs the foundation's methodology and strategy for creating a better future. Children in Nigeria who were internally displaced due to the Boko Haram crisis received scholarships from the Queen Zaynab Foundation. Through its scholarship program, the foundation pays for the education of the majority of the camp's children, some of whom are currently enrolled in other universities. The Queen Zaynab Foundation, which helps the underprivileged in society, was founded by the former Queen of the Ooni of Ife. Additionally, during the COVID-19 lockdown, Queen Zaynab gave out palliatives, supplies, and money to over 10,000 less fortunate people. Since February 2017, she has been rebuilding and funding neighborhood orphanages and training facilities in Lagos and Benin, under the #Forward initiative. ==Controversy== According to Dailypost.ng, \"Olori Wuraola has spoken about the reported breakup of their marriage, admitting that she is no longer with her\". The news of the divorce went viral on social media. Though, later she come out and debunk the news of her alleged infidelity, she denied any allegations against her. She also hinted that domestic violence could be responsible for the separation. ==Accolades== In 2017, she toured to United States, where she was awarded during United Nations Week Humanitarian of The Year, 2017. ==References== ==Other website== * Category:Nigerian royalty Category:Living people Category:Year of birth missing (living people)",
 "title": "Zaynab Otiti Obanor"
}