{
 "id": "673102",
 "text": "María Fernanda Espinosa Garcés (born September 7, 1964, in Salamanca, Spain) is an Ecuadorian linguist, poet, politician, and diplomat. She served as an advisor on biodiversity and indigenous peoples (1999-2005) and was the regional director for South America (2005-2007) at the International Union for Conservation of Nature (IUCN). Espinosa Garcés was Ecuador's Minister of Foreign Affairs twice, from 2007 to 2008 and then from 2017 to 2018. She also served as ambassador and permanent representative to the United Nations in New York (2008-2009) and Geneva (2014-2017), and as Ecuador's Minister of National Defense (2012-2014). In June 2018, she was elected President of the United Nations General Assembly by a two-thirds vote of the member states. Espinosa Garcés became the fourth woman in the seventy-three-year history of the United Nations to be elected President of the General Assembly. == Political career == María Fernanda Espinosa began her career working with indigenous communities in the Ecuadorian Amazon, focusing on the stewardship of tropical rainforests. Her early work involved collaboration with civil society organizations and academic institutions, eventually leading her to serve as an advisor on biodiversity and climate change policy. From 1989 to 1990, she worked as a project officer for the Natura Foundation of Ecuador, where she connected biodiversity conservation with local livelihoods. In 1994, Espinosa worked as a UNICEF consultant in Niger on a pilot project to improve environmental education and develop primary environmental care initiatives with rural women. She also served as a consultant for the United Nations Intergovernmental Panel on Forests in New York in 1995, focusing on indigenous knowledge and civil society engagement regarding forests and intellectual property rights. Espinosa founded and directed the Socio-Environmental Studies Program at the Latin American Faculty of Social Sciences (FLACSO) in Quito from 1996 to 1999, further solidifying her role as a leader in environmental issues. Between 1999 and 2005, she served as an advisor on biodiversity and indigenous peoples for the International Union for Conservation of Nature (IUCN), participating in international environmental negotiations related to biodiversity, genetic resources, traditional knowledge, and intellectual property rights. In 2005, Espinosa was appointed Regional Director for South America at IUCN, based in Quito. In this role, she led the establishment and implementation of the Regional South American Program, significantly enhancing the organization’s technical and financial capabilities to advise and support governments in sustainable development planning, programming, and policymaking. Her work emphasized the connection between poverty eradication and biodiversity conservation, strengthening the Regional Office's capacity to support governments in negotiations related to biodiversity, climate change, forest management, and protected areas. During her time at IUCN, María Fernanda developed a regional program aligned with the priorities of South American governments to address environmental challenges related to the Millennium Development Goals, focusing on sustainable development, poverty eradication, and social equality. She positioned IUCN as a crucial regional stakeholder, recognized as an authoritative expert, technical assistance provider, and advocacy leader on environmental issues. Espinosa coordinated common environmental strategies among the States of the region, mobilized resources, facilitated donor cooperation, and provided technical, scientific, and political advice to governments on environmental and sustainable development issues. She also established advocacy strategies for biodiversity conservation among political leaders and actively participated in the Conferences of the Parties to the Convention on Biological Diversity and the Convention on Climate Change. Throughout her early career, Espinosa consistently focused on connecting biodiversity conservation with sustainable development and the empowerment of indigenous communities. She contributed to initiatives by various organizations, including UNICEF, the Amazon Cooperation Treaty Organization, the Central Bank of Ecuador, and the Fundación Futuro Latinoamericano. Her work laid a strong foundation for her later roles in government and international diplomacy. === Government of Rafael Correa === Under President Rafael Correa, María Fernanda Espinosa held multiple key roles in the Ecuadorian government, reflecting her versatility and expertise across various domains. From January to December 2007, she served as Minister for Foreign Affairs, Commerce, and Integration, where she established the New Ecuadorian Foreign Policy for 2007-2010. During her tenure, she reorganized the Ministry to include foreign trade responsibilities and promoted regional political and trade integration initiatives. Notably, she initiated bi- national coordination cabinets between Ecuador and Peru to address issues related to border development, security, defense, and economic cooperation, which furthered the implementation of the Peace Agreement signed with Peru in 1998. Following her role as Foreign Minister, Espinosa was appointed Special Advisor to the President of the Constituent Assembly, Alberto Acosta, from December 2007 to February 2008. In this position, she played a crucial role in the constitutional process that led to Ecuador's 2008 Constitution, particularly in drafting sections on the rights of nature, indigenous peoples, and the plurinational state, as well as areas concerning security, defense, and international affairs. In March 2008, María Fernanda became Ecuador’s first female Permanent Representative to the United Nations in New York, a position she held until September 2009. During her time as ambassador, she was appointed by the President of the General Assembly as Co-facilitator of the Special Working Group on the Revitalization of the Work of the General Assembly. Espinosa also led Ecuador’s participation in international negotiations addressing the global financial crisis, culminating in the 2009 Conference on the World Financial and Economic Crisis and Its Impact on Development. Her contributions extended to environmental and climate change negotiations, and she actively engaged in discussions on South-South cooperation and system-wide coherence, including the establishment of UN Women. From October 2009 to November 2012, Espinosa served as Coordinating Minister of Cultural and Natural Heritage, where she led the Yasuní-ITT Initiative. As the head of this sectoral cabinet, she oversaw the Ministry of Environment, Ministry of Culture, Ministry of Sports, Ministry of Tourism, and the Governing Council of the Galapagos Islands. In this capacity, she implemented policies to recover and safeguard Ecuador’s cultural and natural heritage, spearheaded the National Plan Against Racism and Discrimination, and represented Ecuador in international negotiation processes on climate change and sustainable development. Her leadership in the Yasuní ITT Initiative, which sought to avoid CO2 emissions by leaving oil reserves untapped in exchange for international compensation, marked a significant contribution to global environmental discourse. In November 2012, Espinosa was appointed Minister of National Defense, becoming the third woman to hold this position in Ecuador. She oversaw the Armed Forces during a sensitive period marked by internal conflict in neighboring Colombia. Espinosa led reforms in social security management, education, training, and health policies for military forces, and she was instrumental in creating the National Defense Political Agenda 2014-2017. Her tenure also saw the establishment of a Gender Equality Policy within the Armed Forces and the convening of the first international cooperation network of Women Ministers and Leaders of Defense. Espinosa’s efforts modernized the Armed Forces, adapting them to the new constitutional framework and addressing contemporary security threats such as cybersecurity, organized crime, and natural disasters. In October 2014, María Fernanda Espinosa was appointed Permanent Representative of Ecuador to the United Nations and other international organizations in Geneva, Switzerland, a position she held until May 2017. During this period, she was elected chair of the Human Rights Council’s working group on negotiating a legally binding instrument on transnational corporations and human rights. Her work was a milestone in the Council's deliberations, as it was the first time the implications of transnational corporations on human rights were discussed for consideration in a legally binding instrument. In her capacity as Permanent Representative, she defended the Ecuadorian Government's decision to grant political asylum to Julian Assange in a discussion on arbitrary detention in September 2016 as a matter of international law and human rights. Espinosa played a significant role in international bodies such as the ILO, WHO, UNCTAD, and others, contributing to the institutional reform of the International Organization for Migration (IOM) and the articulation of the Human Rights Council's work with the Sustainable Development Goals and the 2030 Agenda. She coordinated Ecuador's participation in key international mechanisms and conventions, including those related to disarmament, migration, and environmental protection. === Government of Lenin Moreno === On May 24, 2017, María Fernanda Espinosa was reappointed as Minister of Foreign Affairs by President Lenín Moreno. In addition to this role, she was also appointed as the coordinator of the government's external cabinet, responsible for ensuring the planning and coordination of policies related to foreign investment, trade, and the international promotion of Ecuador. This cabinet encompassed the Ministry of Foreign Affairs, the Ministry of Foreign Trade, the Ministry of Tourism, the Ministry of Environment, and the Ministry of Culture and Heritage. During her tenure, Espinosa faced criticism from national political sectors for what were perceived as ambiguous positions on the internal issues of other nations. In early January 2018, President Moreno included María Fernanda Espinosa as the second candidate on the shortlist to select the new Vice President of the Republic, following the suspension of Vice President Jorge Glas due to his involvement in the Odebrecht case. The shortlist also included Housing Minister María Alejandra Vicuña and Justice Minister Rosana Alvarado. On January 6, the National Assembly voted and elected Minister Vicuña as Vice President. During her time as Foreign Minister, Espinosa spearheaded the drafting and launch of the Foreign Policy Agenda for 2017-2021, through a broad participatory process that included political and social stakeholders, civil society organizations, migrants, academia, and the private sector. María Fernanda Espinosa also enhanced consular assistance for Ecuadorians living abroad by strengthening the mobile consulate system and increasing personnel to better support migrants. She established a gender equality policy within the Ecuadorian foreign service and led the preparation and Parliament approval of the Human Mobility National Plan, which became the national policy on migration and the rights of migrants. As chair of the Andean Community of Nations (CAN) from May 2017 to May 2018, Espinosa prioritized coordinated actions among member states (Bolivia, Colombia, Ecuador, and Peru) to prevent natural disasters and created the Andean Committee of Cultural Affairs. She proposed a work plan to foster the sustainable development of borders among the member countries, focusing on areas such as electrical power interconnection, a common market, tourism, the environment, and institutional re-engineering of the Community. In December 2017, Espinosa led the XIII Meeting of Foreign Affairs Ministers of the Amazon Cooperation Treaty Organization (ACTO), which revitalized ACTO as the key forum for preserving and developing the eight Amazonian countries. As chair of the G77+China group, María Fernanda Espinosa advocated for strong and effective multilateralism and played an active role in the deliberations on Financing for Development. She organized a high-level event titled “Por un Planeta Sostenible” (\"For a Sustainable Planet\"), addressing critical international sustainability issues and promoting multilateralism. Espinosa led Ecuador’s delegation in the peace dialogues between the Colombian government and the National Liberation Army (ELN), solidifying Ecuador’s role as host and guarantor for the peace talks. She and the chief negotiators of both parties signed the “Quito Agreement on a Temporary and Bilateral Cease- Fire,” which was in effect from October 1, 2017, to January 9, 2018. Under her leadership, Ecuador successfully joined the Treaty on the Prohibition of Nuclear Weapons in September 2017, reinforcing the country's commitment to global peace and security. === Presidency of the 73rd Session of the United Nations General Assembly === On June 5, 2018, María Fernanda Espinosa Garcés was elected as the fourth woman to serve as President of the United Nations General Assembly and the first woman from Latin America and the Caribbean to preside over this body since its foundation in 1945. A total of 128 member states out of the 193 that make up the United Nations voted in favor of her candidacy, in which she ran against the permanent representative of Honduras to the United Nations, Mary Elizabeth Flores. During her tenure as the 73rd President of the United Nations General Assembly, María Fernanda prioritized global governance, health diplomacy, and addressing the climate crisis. She focused on seven key areas: decent work, migration and refugees, environmental action and climate change, revitalization of the United Nations, youth, peace and security, gender equality, and the rights of persons with disabilities. Espinosa was a strong advocate for gender equality. She convened a group of women leaders to promote greater awareness and international commitment to boosting the political participation of women. For the first time in the UN's history, she gathered women Heads of State and Government, along with other leading female figures, to advance the gender equality agenda. She also established an advisory group on gender equality composed of distinguished women leaders from around the world. María Fernanda chaired the adoption of several significant agreements, including the United Nations Declaration on the Rights of Peasants in November 2018, the Global Compact on Refugees in December 2018, and the Global Compact for Safe, Orderly, and Regular Migration, also in December 2018. She played a crucial role in mobilizing former Presidents of the General Assembly to engage in dialogues with member states, discussing the need to revitalize the United Nations and strengthen multilateralism. She also spearheaded the launch of the International Year of Indigenous Languages in February 2019 and led a high-level event on culture and sustainable development in May 2019. María Fernanda devoted special attention to the high-level meetings on middle-income countries, inequalities, and sustainable development in December 2018. María Fernanda Espinosa was a vocal advocate for environmental sustainability. She led the \"Play It Out\" global campaign against single-use plastics, highlighting its threat to ocean and environmental health. As part of this initiative, she successfully achieved the elimination of single-use plastics at United Nations headquarters in New York and Geneva. To enhance dialogue and address contentious issues within the UN, she introduced Minga Mornings, a practice of informal and off- the-record dialogues with permanent representatives. These meetings were designed to advance the agenda of the General Assembly on critical issues. Espinosa convened and co-organized several significant events, including a pledging conference for the United Nations Relief and Works Agency for Palestine Refugees (UNRWA) to maintain essential services amid budget cuts. She also led a high-level meeting on climate change in preparation for COP 25, focusing on intergenerational climate justice with active involvement from youth leaders and heads of state. Throughout her presidency, María Fernanda Espinosa appointed 38 permanent representatives, 18 of whom were women, as co- facilitators of intergovernmental negotiations for General Assembly working groups. She organized three informal dialogues between member states and the UN's main bodies—the Secretary General, ECOSOC, the Security Council, and the General Assembly—to discuss the future of multilateralism and the role of the UN. In 2020, Espinosa was nominated by the heads of government of Antigua and Barbuda and Saint Vincent and the Grenadines for the position of secretary- general of the Organization of American States. She ran against incumbent Luis Almagro, nominated by Colombia. Almagro won his reappointment with 23 votes against 10 in the election held on 20 March that year. Her home country of Ecuador did not support her candidacy. == Academic Work == Espinosa founded and directed the Program for Socio-Environmental Studies at FLACSO-Ecuador for about ten years. Her teaching experience includes courses on development theory, sustainable development, multilateralism, and international negotiations. As a visiting professor and lecturer, she has taught at approximately 30 universities in the US, Europe, Africa, Asia, and Latin America. == Poetry == María Fernanda Espinosa has published five poetry books. Some of them are Geografías Torturadas (Tortured Geographies) (2013); Antología (Anthology) (2005); Loba Triste (Sad She-Wolf) (2000); Tatuaje de Selva (Jungle Tattoo) (1992) and Caymándote (1990). Her work and name have also been part of Ecuadorian and international anthologies, such as: Poetas de la emoción, 20 poetas ecuatorianos vivos (2012); Poesía Ecuatoriana Contemporánea De César Dávila Andrade a nuestros días, Anthology (2011); Poesía en Paralelo, II Encuentro de poetas en Ecuador (2010); Antología de Poesía, Selección de Iván Carvajal, Raúl Pacheco (2009); Casa de Luciérnagas, Antología de Poetas Latinoamericanas de hoy, Mario Campaña (2007); La palabra vecina, Encuentro de Escritores Perú-Ecuador (2008); Mujeres poetas en el país de las nubes, colección Vitzu, Mexico (2003); Revista Alforja, Mexico (2002); Hueso Húmero de Perú (2004); Jorge Carrera Andrade, provocador e insurgente, Memorias del Octavo Encuentro de Literatura Ecuatoriana (2002); Bilingual Anthology of Ecuadorian Poets, Rochester University (1997); Between the Silence of Voices, An Anthology of Contemporary Ecuadorian Poets (1997). Hispanoamérica, Maryland University (1996). International Poetry Review, 20th Anniversary, Spring 1995; Collages and Bricollages (1993) ==References== Category:1964 births Category:Living people Category:Ambassadors Category:Presidents of the United Nations General Assembly Category:Ecuadorian politicians Category:South American diplomats",
 "title": "María Fernanda Espinosa"
}