{
 "id": "67344",
 "text": "A shell is a hard outer layer, which has evolved in a very wide variety of different animals, including molluscs, sea urchins, crustaceans, turtles and tortoises, armadillos, etc.Scientific names for this type of structure include exoskeleton, test, carapace, and peltidium. == Seashells == Seashellsmore precisely, the external shells of marine molluscs are perhaps the most familiar and most common shells, both in the wild and for sale as decorative objects. They are usually composed of calcium carbonate, in the form of calcite or aragonite.crystallised out in an organic matrix This can have different forms, one is nacre or mother of pearl. Other kinds of animal shells are made from chitin, bone and cartilage, or silica. == Use of Shells == Shells of many types were popular as human decorations, either used whole or cut into pieces. One used them for all kinds of pendants, beads, buttons, brooches, rings, and hair combs. Small pieces of colored shell and iridescent shell have been used to create mosaics and inlays which have been used to decorate larger items such as boxes and furniture. Large numbers of whole seashells, arranged to form patterns, have been used to decorate man-made grottos. Several kinds of sea animals have exoskeletons which one can find after their death in beach drift. Often beachcombers pick them. But usually only those of molluscs (also spelled \"mollusks\") are known as seashells. == Classes == The majority of shell-forming molluscs belong to two classes: Gastropoda (univalves, or snails) and Bivalvia (bivalves or clams, oysters, scallops, etc.). == Gallery == Image:Cypraea chinensis with partially extended mantle.jpg|The marine gastropod Cypraea chinensis, the Chinese Cowry, shows a partially extended mantle Image:Giant_clam_or_Tridacna_gigas.jpg|The giant clam (Tridacna gigas) is the largest bivalve Image:Tonicella lineata.jpg|Tonicella lineata the \"Lined chiton\" from the temperate eastern Pacific, a member of the class Polyplacophora Image:Snail-WA edit02.jpg|The white-lipped snail (Cepaea hortensis) is a land snail ==References== == Other websites == * Shell Hair Pipes used in Indian Adornment * 110 Photos of various seashells * Conchologists of America Category:Zoology Category:Animal anatomy",
 "title": "Shell (zoology)"
}