{
 "id": "673432",
 "text": "Central Sulawesi (Indonesian: Sulawesi Tengah) is a province of Indonesia. It is at the center of the island of Sulawesi. The capital and largest city is Palu. The population was 2,633,420 in the 2010 census. In 2014, the government reported the population as 2,839,290. The area of Central Sulawesi is The province used to be called Central Celebes. It covers the northern part of the island of Sulawesi, the southern part of the northern peninsula and the eastern peninsula. It has ten districts (kabupaten, also called regency). It is very mountainous, and there are many ethnic groups. Most of the people live on the plains near the coast. The other areas are difficult to reach, and the roads are in a bad state, especially on the eastern peninsula. The dominant religion is Islam, with 79% of the population. About 16% are Protestants, and 1% are Catholics. There are also people who follow indigenous faiths. Palu is the only city, and the only bigger settlement. In the district Poso, there may be tensions, which are fueled by religious disputes. Because of its relative isolation, the province is one of the least developed ones in Indonesia. Timber and forestry is the most important branch of the economy. There is the Lore-Lindu National park, in the mountains just south of Palu. This national park is important for many indigenous species. In the last few years, growing cocoa has become more important. Islam reached the region in the 17th century, since the 18th century it was a Dutch colony. With Dutch colonization, Protestant missionaries also started their work. Today, about a sixth of the population are Protestants. This is one of the highest values in Indonesia. In the Second World War, the province was occupied by Japanese forces. After the independence of Indonesia, in 1949, the area was part of the province North Sulawesi. The current province was established in 1964. ==References== * Ernst Kündig: Morphologie und Hydrographie der Toili-Ebene (Ostcelebes), in: Mitteilungen der Geographisch-Ethnographischen Gesellschaft Zürich, Bd. 32, 1931–1932 (Digitalisat ) Category:1964 establishments in Asia Category:20th- century establishments in Indonesia",
 "title": "Central Sulawesi"
}