{
 "id": "673489",
 "text": "is a Japanese manga series created by Kouta Hirano. The series began in 1997 and ended in September 2008. The series is about a secret Hellsing Organization. The organization fights against vampires, ghouls, and other supernatural enemy who threaten England. The series was licensed for English language release in North America by Dark Horse Comics, in Australia and New Zealand by Madman Entertainment, and in Singapore by Chuang Yi. An anime series of the same name was produced by Gonzo. The series was directed by Umanosuke Iida. It was based on the manga but used a screenplay by Chiaki J. Konaka. It was different from the manga in terms of plot, though it used some of the same characters and similar character designs. It has thirteen episodes. It was broadcast on Japan's Fuji Television from October 10, 2001 to January 16, 2002. An original video animation (OVA) called Hellsing Ultimate was produced by Geneon. It followed the manga storyline more closely than the anime series.Johnston, Chris. \"Hellsing Ultimate\". Newtype USA 5 (11) pp. 44–45. November 2006. . The series was 10 episodes long. It was released in Japan between February 10, 2006 and December 26, 2012. In North America, the series ran from December 5, 2006 to October 28, 2014. ==Reception== In 2005, the six and seventh volumes of the Hellsing manga series ranked among Diamond Comics Distributors' list of the top 48 manga volumes sold in the United States for the year. In November 2007, the ninth volume was among the top 10 volumes sold according to Japan's monthly sales rankings. ==References== Category:1997 manga Category:2001 anime television series Category:2001 manga Category:2001 television series debuts Category:2002 manga Category:2002 television series endings Category:2006 anime OVAs Category:2006 television series debuts Category:2008 anime OVAs Category:2009 anime OVAs Category:2011 anime OVAs Category:2012 anime OVAs Category:2012 Japanese television series endings Category:Action television series Category:Anime series based on manga Category:Comedy anime and manga Category:Madhouse (company) Category:Manga series Category:Science fiction anime and manga Category:Vampires in movies",
 "title": "Hellsing"
}