{
 "id": "673626",
 "text": "Gurren Lagann, also known as Tengen Toppa Gurren Lagann, is a Japanese mecha anime television series. It was animated by Gainax and co-produced by Aniplex and Konami. It ran for 27 episodes on Japan's TV Tokyo between April 1, 2007, and September 30, 2007. It was directed by Hiroyuki Imaishi. It was written by veteran playwright Kazuki Nakashima. Gurren Lagann takes place in a fictional future where Earth is ruled by the Spiral King, Lordgenome. Lordgenome forces people to live under the surface of the earth. The plot focuses on two teenagers, Simon and Kamina. They live in a village under the earth surface and wish to go to the surface. Using a mecha known as Lagann, Simon and Kamina reach the surface. There they and other humans start fighting against Lordgenome's forces. In North America, at first it was announced to be licensed by ADV Films in 2007, the license was transferred to Bandai Entertainment in 2008. The license was again transferred to Aniplex of America in 2013. In the United Kingdom, it was licensed by Manga Entertainment in 2007, then transferred to Beez Entertainment in 2008. The license was again transferred to Anime Limited in 2013. The Sci Fi Channel got the broadcasting rights of Gurren Lagann and began airing the anime on July 28, 2008. The anime won several awards at the Tokyo International Anime Fair and the Animation Kobe and Japan Media Arts Festivals. A manga based on this was published by ASCII Media Works between 2007 and 2013. Bandai Entertainment licensed the manga and released it in English in North America. A series of four light novels was published by Shogakukan between 2007 and 2008. A Nintendo DS video game was released in October 2007. Two animated film versions were produced. The first premiered in Japanese theaters on September 6, 2008, and the second premiered on April 25, 2009. == References == Category:Anime Category:2007 anime television series Category:2007 manga Category:2007 television series debuts Category:2007 television series endings Category:2007 video games Category:2008 anime movies Category:2008 manga Category:2009 anime movies Category:2009 manga Category:Adult Swim Category:Adventure games Category:Anime series Category:Comedy anime and manga Category:Gainax Category:Japanese adventure movies Category:Japanese science fiction movies Category:Japanese-language movies Category:Konami games Category:Light novels Category:Manga series Category:Nintendo DS games Category:Science fiction anime and manga Category:Video games developed in Japan",
 "title": "Gurren Lagann"
}