{
 "id": "673726",
 "text": "The following is a list of deaths that should be noted in January 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==January== ===1=== *Jamal Ahmad Mohammad Al Badawi, 58, Yemeni militant (Islamic Jihad of Yemen), airstrike. *Dagfinn Bakke, 85, Norwegian newspaper illustrator (Arbeidermagasinet, Lofotposten).Kunstneren Dagfinn Bakke er død *Ivan Dimitrov, 83, Bulgarian footballer (Lokomotiv Sofia, Spartak Sofia, national team).Почина легендата на Локо Сф Иван Димитров *Elizabeth Edgar, 89, New Zealand botanist. *Kris Kelmi, 63, Russian singer-songwriter (Autograph), cardiac arrest complicated by alcoholism.Певец Крис Кельми умер 1 января в возрасте 63 лет *Paul Neville, 78, Australian politician, MP (1993–2013). *José Antonio Pujante, 54, Spanish politician, member of the Assembly of Murcia (since 2007), heart attack.Fallece a los 54 años el político de Izquierda Unida José Antonio Pujante *Raymond Ramazani Baya, 75, Congolese politician, Foreign Minister (2004–2007) and Ambassador to France (1990–1996).RDC: Décès du sénateur Raymond Ramazani Baya á Paris *Pegi Young, 66, American singer-songwriter and philanthropist, cancer. ===2=== *Malcolm E. Beard, 99, American politician, member of the Florida Senate (1980–1996) and House of Representatives (1978–1980). *Jerry Buchek, 76, American baseball player (St. Louis Cardinals, New York Mets). *Paulien van Deutekom, 37, Dutch Olympic speed skater (2006), World Allround Speed Skating champion (2008), lung cancer. *Daryl Dragon, 76, American musician and songwriter (Captain & Tennille, The Beach Boys), renal failure. *Bob Einstein, 76, American actor (Curb Your Enthusiasm, Ocean's Thirteen) and performer (Super Dave Osborne), leukemia. *Kevin J. McIntyre, 57, American politician, Chairman of the Federal Energy Regulatory Commission (2017–2018), brain cancer. *Blake Nordstrom, 58, American businessman, co-president of Nordstrom, lymphoma. *Gene Okerlund, 76, American Hall of Fame professional wrestling announcer (AWA, WWE, WCW), complications from a fall. *Jerzy Turonek, 89, Polish-Belarusian historian.Умер выдающийся историк Юрий Туронок ===3=== *Sylvia Chase, 80, American news anchor (KRON, ABC World News Tonight) and journalist (20/20), brain cancer. *Sayed Ashraful Islam, 67, Bangladeshi politician, MP (since 2008) and Minister of Public Administration (since 2009), lung cancer. *Herb Kelleher, 87, American businessman, co-founder of Southwest Airlines, prostate cancer. *Michael Yeung, 73, Chinese Roman Catholic prelate, Bishop of Hong Kong (since 2017), liver failure complicated by cirrhosis. ===4=== *Ivan Bortnik, 79, Russian actor (Family Relations, Mirror for a Hero, Mama Don't Cry), complications from thrombosis.Умер народный артист России Иван Бортник *Harold Brown, 91, American politician and nuclear physicist, Secretary of Defense (1977–1981), pancreatic cancer.Harold Brown, Defense Secretary in Carter Administration, Dies at 91 *John Burningham, 82, English author (Borka: The Adventures of a Goose with No Feathers, Granpa) and illustrator (Chitty- Chitty-Bang-Bang), pneumonia.John Burningham, children's author and illustrator, dies aged 82 *Harold Demsetz, 88, American economist (Nirvana fallacy).Harold Demsetz (1930-2019) -- a champion of price theory and the Economic Way of Thinking *Leo J. Dulacki, 100, American general, Commanding General of the 4th and 5th Marine Division (1968–1973).Lieutenant General Leo J. Dulacki USMC (Ret) *David Garman, 96, British inventor and businessman.Award-winning industry innovator and pioneer passes away ===5=== *Scott Dozier, 48, American convicted murderer, suicide by hanging. *Eric Haydock, 75, British rock bassist (The Hollies). *Rudolf Raff, 77, Canadian- born American biologist. *Bernice Sandler, 90, American women's rights activist, led to the creation of Title IX.Bernice Sandler, ‘godmother of Title IX’ who championed women’s rights on campus, dies at 90 *Dragoslav Šekularac, 81, Serbian football player (Red Star Belgrade, Yugoslavia national team) and manager (Marbella), complications from Alzheimer's disease.Umro Dragoslav Šekularac ===6=== *Annalise Braakensiek, 46, Australian model and actress (Pizza). (body discovered on this date) *José Ramón Fernández, 95, Cuban militant (Bay of Pigs Invasion) and politician, Vice President of the Council of Ministers (since 1976). *Derek Piggott, 96, British glider pilot and flight instructor, stroke. *W. Morgan Sheppard, 86, English actor (Star Trek, Max Headroom, Gods and Generals), cancer. *Gene Zwozdesky, 70, Canadian politician, Speaker of the Legislative Assembly of Alberta (2012–2015), cancer. ===7=== *Moshe Arens, 93, Lithuanian-born Israeli-American aeronautical engineer and politician, Minister of Defense (1983–1984, 1990–1992, 1999) and Foreign Affairs (1988–1990). *Edwin Erickson, 80, American politician, member of the Pennsylvania Senate (2001–2015). *John Joubert, 91, South African-born British composer. *Dave Laing, 71, English journalist (The Guardian), editor (Let It Rock) and broadcaster. *John Mendelsohn, 82, American pharmacologist, President of the University of Texas MD Anderson Cancer Center (1996–2011), glioblastoma. *Carmencita Reyes, 87, Filipino politician, member of the House of Representatives (2007–2010) and Governor of Marinduque (1998–2007; since 2010). *Tom Rukavina, 68, American politician, member of the Minnesota House of Representatives (1987–2013), leukemia. *Jocelyne Saab, 70, Lebanese journalist and movie director (Dunia), endometrial cancer.Décès de Jocelyne Saab, réalisatrice libanaise pionnière au Proche-Orient *Bernard Tchoullouyan, 65, French judoka, Olympic bronze medalist (1980), heart attack. ===8=== *Khosro Harandi, 68, Iranian chess master, Chess Olympiad champion. *Larry Langford, 72, American politician and convicted felon, Mayor of Birmingham, Alabama (2007–2009), complications from COPD. *Arturo Rojas de la Cámara, 88, Spanish cartoonist.Fallece el historietista Arturo Rojas de la Cámara ===9=== *Kjell Bäckman, 84, Swedish Olympic speed skater (1960).Kjell Bäckman *Óscar González-Quevedo, 88, Spanish-born Brazilian Jesuit priest and parapsychologist, heart disease.Morre, em Minas Gerais, o padre Quevedo *Paul Koslo, 74, German- Canadian actor (Rooster Cogburn, The Omega Man, Vanishing Point), pancreatic cancer. *Anatoly Lukyanov, 88, Soviet-born Russian politician, Chairman of the Supreme Soviet of the Soviet Union (1990–1991).Умер последний председатель Верховного совета СССР Анатолий Лукьянов *Alan Trask, 85, American politician, member of the Florida Senate (1969–1971, 1973–1982), respiratory failure. *Lester Wunderman, 98, American Hall of Fame advertising executive, creator of direct marketing. ===10=== *Theo Adam, 92, German opera singer. *Dianne Oxberry, 51, British broadcaster (BBC North West Tonight), pancreatic cancer. *Lionel Price, 91, British basketball player (national team) and Olympian (1948). ===11=== *Sir Michael Atiyah, 89, British-Lebanese mathematician, President of the Royal Society (1990–1995), Fields Medalist (1966) and Abel Prize winner (2004). *George Brady, 90, Czech-Canadian Holocaust survivor and businessman, heart failure.Zemřel Jiří Brady. Pamětník holokaustu, kterého Zeman odmítl vyznamenat *Steffan Lewis, 34, Welsh politician, member of the National Assembly for Wales (since 2016), bowel cancer. *Fernando Luján, 79, Colombian-born Mexican actor (Overboard, Dia de muertos, Dangers of Youth), respiratory failure. *Sue Povey, 76, British geneticist.Sue Povey obituary *Dimitris Sioufas, 75, Greek politician, Speaker of the Parliament (2007–2009). *Tom Warner, 70, American politician, member of the Florida House of Representatives (1992–1999) and State Solicitor General (1999–2002), prostate cancer.Tom Warner ===12=== *Etsuko Ichihara, 82, Japanese actress (Your Name, Hideyoshi, The Great Adventure of Horus, Prince of the Sun), heart failure. *Batton Lash, 65, American comic book writer and artist (Supernatural Law, Archie Meets the Punisher), brain cancer. *Jaime Rosenthal, 82, Honduran politician, Vice President (1986–1989) and MP (2002–2006), heart attack.Muere el empresario Jaime Rosenthal Oliva *Patricia Wald, 90, American judge, Chief Judge of the United States Court of Appeals for the District of Columbia Circuit (1986–1991), pancreatic cancer.Patricia Wald, pathbreaking federal judge who became chief of D.C. Circuit, dies at 90 ===13=== *Douglas M. Costle, 79, American environmentalist and politician, Administrator of the Environmental Protection Agency (1977–1981), complications from a stroke. *Bonnie Guitar, 95, American country singer- songwriter (\"Dark Moon\") and musician. *Joe M. Jackson, 95, American Air Force officer, Medal of Honor recipient. *Phil Masinga, 49, South African footballer (Leeds United, Bari, national team), cancer. *Alfred K. Newman, 94, American Navajo code talker. *Francis W. Nye, 100, American Air Force general. *Mel Stottlemyre, 77, American baseball player (New York Yankees) and coach (New York Mets, Houston Astros), multiple myeloma. ===14=== *Paweł Adamowicz, 53, Polish politician, Mayor of Gdańsk (since 1998), stabbed.Paweł Adamowicz nie żyje. Prezydent Gdańska został zaatakowany nożem na imprezie WOŚP *Milton Bluehouse Sr., 82, American politician, President of the Navajo Nation (1998–1999).Former Navajo Nation President Milton Bluehouse Sr. dies *Eli Grba, 84, American baseball player (New York Yankees, Los Angeles Angels), pancreatic cancer. *Lenin Rajendran, 67, Indian movie director (Venal, Puravrutham, Mazha) and screenwriter, member of the Kerala State Film Development Corporation (since 2016), complications of a liver transplant. *Gavin Smith, 50, Canadian professional poker player, heart attack. *Rainer Stadelmann, 85, German egyptologist. *Julio Vallejo Ruiloba, 73, Spanish psychiatrist, liver cancer.Julio Vallejo Ruiloba: Fallecimiento ===15=== *Carol Channing, 97, American actress (Hello, Dolly!, Gentlemen Prefer Blondes, Thoroughly Modern Millie), singer and dancer, Tony winner (1964), complications from a stroke. *Miodrag Radovanović, 89, Serbian actor (The Farm in the Small Marsh, The Elusive Summer of '68, Battle of Kosovo), complications from Alzheimer's disease.Preminuo glumac Miodrag Radovanović Mrgud ===16=== *John C. Bogle, 89, American investor and writer (Common Sense on Mutual Funds), founder of The Vanguard Group, esophageal cancer. *Jean Chatillon, 81, Canadian composer, pneumonia.Chatillon *Mirjam Pressler, 78, German children's writer and translator (The Diary of Anne Frank).Mirjam Pressler *Chris Wilson, 62, Australian singer-songwriter (\"Short Cool Ones\") and guitarist (Harem Scarem), pancreatic cancer. (death announced on this date) *Yu Min, 92, Chinese nuclear physicist, developed the H-bomb and member of the Chinese Academy of Sciences.中国“氢弹之父”于敏去世 享年93岁 ===17=== *Vicente Álvarez Areces, 75, Spanish politician, President of Asturias (1999–2011), Senator (since 2011) and Mayor of Gijón (1987–1999).Muere Vicente Álvarez Areces, las imágenes del expresidente de Asturias *Babiker Awadalla, 101, Sudanese politician, Prime Minister (1969).رئاسة الجمهورية تحتسب عند الله تعالى مولانا بابكر عوض الله *Windsor Davies, 88, Welsh actor (It Ain't Half Hot Mum, Carry On England, Never the Twain). *Mary Oliver, 83, American poet (American Primitive), Pulitzer Prize winner (1984) and National Book Award winner (1992), lymphoma. *Reggie Young, 82, American guitarist (The Memphis Boys). ===18=== *Boo, 12, American Pomeranian dog and Internet celebrity, heart failure. *John Coughlin, 33, American figure skater, national champion (2011), suicide. *Dale Dodrill, 92, American football player (Pittsburgh Steelers), complications from Alzheimer's disease.Dale F. Dodrill *Lamia Al- Gailani Werr, 80, Iraqi archaeologist. *Cees Haast, 80, Dutch racing cyclist, lung cancer.Cees Haast (80) overleden *William A. Thomas, 70, American college football player and coach (Tennessee State Tigers). *Etienne Vermeersch, 84, Belgian philosopher and political activist, founder of SKEEP, assisted suicide. *Ivan Vutsov, 79, Bulgarian football player (Levski Sofia, national team) and manager (Spartak Pleven).Отиде си големият Иван Вуцов! ===19=== *Mario Bertoncini, 86, Italian composer, pianist, and music educator, liver cancer.Cordoglio della Chigiana per la morte del maestro Bertoncini *Ted McKenna, 68, Scottish drummer (The Sensational Alex Harvey Band), cerebral haemorrhage. *Tony Mendez, 78, American intelligence officer, subject of Argo, complications of Parkinson's disease. *Muriel Pavlow, 97, English actress (Malta Story, Doctor in the House, Reach for the Sky). *Red Sullivan, 89, Canadian ice hockey player (Boston Bruins, New York Rangers, Chicago Blackhawks), Alzheimer's disease. *Henry Sy, 94, Chinese-Filipino business magnate (SM Prime), heart attack. ===20=== *Tibor Baranski, 96, Hungarian-born American educator and activist, Righteous Among the Nations recipient (1979). *Paul Barrett, 78, British music manager and agent (Shakin' Stevens).Paul Barrett *Rosemarie Bowe, 86, American model and actress (The Adventures of Hajji Baba, Big Trouble, Murder on Flight 502).Rosemarie Bowe, model and actress who had ‘a face like Grace Kelly and the body of Marilyn Monroe’ – obituary *Peter Burmeister, 77, German mathematician and professor. *Evloghios, 83, German-born Italian Orthodox bishop, Primate of the Holy Synod of Milan (since 1990), complications from a stroke.Скончался председатель Миланского Синода ИПЦ Митрополит Евлогий *Masazō Nonaka, 113, Japanese supercentenarian, oldest verified living man (since 2018). *Andrew G. Vajna, 74, Hungarian-American movie producer (Nixon, Terminator 3: Rise of the Machines, Medicine Man). ===21=== *Kaye Ballard, 93, American actress (The Mothers-in-Law, The Doris Day Show) and singer (\"Fly Me to the Moon\"), kidney cancer. *Raghbir Singh Bhola, 91, Indian field hockey player, Olympic champion (1956) and silver medalist (1960), multiple organ failure. *Maxine Brown, 87, American country singer (The Browns), complications from heart and kidney disease. *Rosa González Román, 76, Chilean journalist and politician, Deputy (1998–2006), cervical cancer.Fallece Rosa González, ex diputada por Arica famosa por aparición en un segundo de franja política *Henri, Count of Paris, 85, French noble, Orléanist pretender to the French throne (since 1999).Le comte de Paris, Henri d’Orléans, est décédé *Charles Kettles, 89, American colonel, Medal of Honor recipient. *Pedro Manfredini, 83, Argentine footballer (Racing Club, Roma, national team).E' morto Manfredini, mitico 'Piedone' della Roma anni sessanta *Emiliano Sala, 28, Argentine footballer (Bordeaux, Nantes, Cardiff City), plane crash. *Shivakumara Swami, 111, Indian Lingayat spiritual leader and educationist, Seer of Siddaganga Matha (since 1941), lung infection. *Harris Wofford, 92, American lawyer and politician, U.S. Senator from Pennsylvania (1991–1995), complications from a fall.Harris Wofford, civil rights activist who helped Kennedy win the White House, dies at 92 ===22=== *Koos Andriessen, 90, Dutch politician, Minister of Economic Affairs (1963–1965, 1989–1994) and Minister of Transport and Water Management (1994), complications from Parkinson's disease.Oud-minister Koos Andriessen (90) overleden *Andrew Fairlie, 55, Scottish chef, brain cancer. *Wolfgang Thonke, 80, German Air Force general and journalist (Fliegerstammtisch Strausberg), stomach cancer.Wolfgang Tonke *Charles Vandenhove, 91, Belgian architect, pneumonia.L'architecte Charles Vandenhove est décédé ===23=== *Diana Athill, 101, British literary editor and novelist (After a Funeral, Somewhere Towards the End). *Richard Bodycombe, 96, American Air Force general.Richard Bodycombe *Jack Thomas Brinkley, 88, American politician, member of the U.S. House of Representatives from Georgia's 3rd congressional district (1967–1983), heart attack. *Dick Dolman, 83, Dutch politician, Speaker of the House of Representatives (1979–1989) and member of the House of Representatives (1970–1990). *Ayşen Gruda, 74, Turkish actress (Tosun Paşa, Süt Kardeşler, Gülen Gözler) and comedian, pancreatic cancer.http://www.hurriyet.com.tr/kelebek/magazin/son-dakika-aysen-gruda- hayatini-kaybetti-41092087 Ayşen Gruda 74 yaşında hayatını kaybetti *Jonas Mekas, 96, Lithuanian-American movie director (Walden, Reminiscences of a Journey to Lithuania, As I Was Moving Ahead Occasionally I Saw Brief Glimpses of Beauty) and poet.Eidamas 96-uosius metus mirė Jonas Mekas *Hidekichi Miyazaki, 108, Japanese masters athlete, cerebral hemorrhage.世界最高齢スプリンター、宮崎秀吉さん死去108歳 *Oliver Mtukudzi, 66, Zimbabwean musician, complications from diabetes. *Erik Olin Wright, 71, American Marxist sociologist, President of the American Sociological Association (2012), acute myeloid leukemia. ===24=== *Elio Berhanyer, 89, Spanish fashion designer.Fallece Elio Berhanyer, un maestro del diseño del Madrid de los años 60 *Antonio Marchesano, 88, Uruguayan politician, President of the Chamber of Deputies (1985–1986) and Interior Minister (1986–1989), lung cancer.Murió Antonio Marchesano, ministro del Interior entre 1986 y 1989 *Rosemary Bryant Mariner, 65, American Navy aviator, ovarian cancer. *Norman Orentreich, 96, American dermatologist, performed the first modern hair transplant, congestive heart failure. *Fernando Sebastián Aguilar, 89, Spanish Roman Catholic cardinal, Bishop of León (1979–1983) and Archbishop of Pamplona and Tudela (1983–2007), complications from a stroke.Fallece el Cardenal Fernando Sebastián Aguilar ===25=== *Bruce Corbitt, 56, American heavy metal singer (Rigor Mortis, Warbeast), esophageal cancer. *John Jeffries, 89, New Zealand politician and judge, Deputy Mayor of Wellington (1971–1974).Sir John Jeffries: From school failure to career overachiever *Florence Knoll, 101, American architect and furniture designer. *Vigilio Mario Olmi, 91, Italian Roman Catholic prelate, Auxiliary Bishop of Brescia (1986–2003). *Meshulam Riklis, 95, Turkish-born American-Israeli businessman.הלך לעולמו בגיל 95 איש העסקים הישראלי-אמריקאי משולם ריקליס *Krishna Sobti, 93, Indian author (Zindaginama and Litigation Against Amrita Pritam), pneumonia. ===26=== *Dale Barnstable, 93, American basketball player (Kentucky Wildcats). *Jean Guillou, 88, French composer, organist and pianist.Disparition de Jean Guillou *Henrik Jørgensen, 57, Danish Olympic marathon runner (1984, 1988), heart attack.Maratonstjernen Henrik Jørgensen er død – blev 57 år *Michel Legrand, 86, French composer (\"The Windmills of Your Mind\", \"What Are You Doing the Rest of Your Life?\"), conductor and jazz pianist, Oscar winner (1968, 1971, 1983), sepsis complicated by a lung infection. *Gerry Plamondon, 95, Canadian ice hockey player (Montreal Canadiens).Les Canadiens en deuil suite au décès de Gerry Plamondon *Giuseppe Zamberletti, 85, Italian politician, Minister of Protezione Civile (1982–1987) and Senator (2004–2009), complications from Alzheimer's disease.E' morto Giuseppe Zamberletti, padre della protezione civile ===27=== *Henry Chapier, 85, Romanian-born French television journalist (France 3) and movie critic.Henry Chapier, l'animateur du “Divan”, est mort *Yvonne Clark, 89, American engineer. *Nina Fyodorova, 71, Russian cross-country skier, Olympic champion (1976) silver (1976) and bronze (1980) medalist.В Петербурге скончалась олимпийская чемпионка Нина Балдычева *Peter Magowan, 76, American businessman, co-owner of the San Francisco Giants, cancer. *Erica Yohn, 90, American actress (An American Tail, Corrina, Corrina, Pee-wee's Big Adventure). ===28=== *Jurrie Koolhof, 59, Dutch footballer (PSV, Groeningen, national team).Oud-international Jurrie Koolhof (59) overleden *Mourad Medelci, 75, Algerian politician, Minister of Foreign Affairs (2007–2013), cerebral hemorrhage.President of Constitutional Council Mourad Medelci passes away *Otto Schubiger, 94, Swiss ice hockey player (national team), Olympic bronze medalist (1948).Nachruf Auf Otto Schubiger *Pepe Smith, 71, Filipino rock guitarist (Juan de la Cruz Band), complications from a stroke. ===29=== *George Fernandes, 88, Indian politician, Minister of Railways (1989–1990) and Defence (1998–2001, 2001–2004) and MP (1996–2010), complications from Alzheimer's and Parkinson's disease. *Jean-Marc Fontaine, 74, French mathematician, co-developed the p-adic Hodge theory and member of the French Academy of Sciences (since 2002), thyroid cancer.Décès de Jean-Marc Fontaine *Andy Hebenton, 89, Canadian ice hockey player (New York Rangers), bladder cancer. *Alf Lüdtke, 75, German historian (Alltagsgeschichte), stroke.Trauer um Prof. Dr. Alf Lüdtke *Mohammad Nabi Habibi, 73, Iranian politician, Mayor of Tehran (1984–1987), heart attack. *Charles J. Hynes, 83, American lawyer and politician, Kings County District Attorney (1990–2013), complications from heart surgery and leukemia. *James Ingram, 66, American R&B; singer-songwriter (\"Baby, Come to Me\", \"Yah Mo B There\") and actor (The Fearless Four), Grammy winner (1982, 1985), brain cancer. *Jan Wahl, 87, American children's writer (Pleasant Fieldmouse, The Furious Flycycle, Humphrey's Bear), prostate cancer.Jan Wahl, Children's Writer Who Attracted Top Artists, Dies at 87 ===30=== *Stewart Adams, 95, British chemist, creator of ibuprofen, pneumonia. *Dame Felicity Hill, 103, British Royal Air Force officer, Director of WRAF (1966–1969). *Per Jorsett, 98, Norwegian freelance sports reporter (Sportsmanden, Dagbladet, Nationen), cardiopulmonary arrest.Per Jorsett er død: – En legende og en fantastisk person *Dick Miller, 90, American actor (Gremlins, The Little Shop of Horrors, Batman: Mask of the Phantasm), pneumonia.Dick Miller, ‘Gremlins’ and ‘Terminator’ Actor, Dies at 90 ===31=== *A. Ernest Fitzgerald, 92, American engineer and government whistleblower.A Tribute to Pentagon Whistleblower Ernie Fitzgerald *Kálmán Ihász, 77, Hungarian footballer (Vasas, national team), cerebral infarction.Meghalt Ihász Kálmán *Ron Joyce, 88, Canadian businessman, co- founder of Tim Hortons. *Johnny Lion, 77, Dutch singer (\"Sophietje\") and actor (Siberia, Godforsaken), lung cancer and Alzheimer's disease.Johnny Lion (77) overleden *Pierre Nanterme, 59, French business executive (Accenture), colorectal cancer. *Georges Sarre, 83, French politician, MEP (1979–1981) and Deputy (1981–2002), coronary artery disease.Georges Sarre, ancien secrétaire d'Etat de Mitterrand, est mort *Lori Wilson, 81, American politician, member of the Florida Senate (1973–1978), complications from dementia. ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *1 Deaths",
 "title": "Deaths in January 2019"
}