{
 "id": "673882",
 "text": "The Ant Bully is a 2006 American computer-animated adventure fantasy comedy movie written, edited and directed by Rich Moore And Eric Darnell And Executive Produced For BBC By: Mike Mitchell, Joe Johnston, and Kathleen Branagh based on the 1999 children's book The Ant Bully by John Nickle. Original Scoring By: James Newton Howard And Chris Bacon Orchestratral And Scoring Conducted By: Pete Anthony And Gavin Greenaway Recorded By: Nick Wollage And Shawn Murthy AT EMI Abbey Road And AIR Lyndhurst Hall, London UK It features the voices of Zach Tyler Eisen, Julia Roberts, Nicolas Cage, Meryl Streep and Paul Giamatti, was produced by Tom Hanks and Gary Goetzman's Playtone, John A. Davis and Keith Alcorn's DNA Productions, and was released in theatres on July 28, 2006, by Warner Bros. and Legendary Pictures. Concurrently with the general release, it was offered in big screen IMAX 3D, the format, also used with Blended. == Story == A boy named Lucas is bullied by another boy named Steve who gives him a wedgie so often that he’s now running out of underwear. Lucas makes himself feel better about this by drowning ants so the ants shrink him down to the size of an ant. Lucas finds out that an Exterminator named Stan Beals he hired is coming to kill the ants, so Lucas helps save them by beating the exterminator. The Ants then turn Lucas back to normal so he stands up to Steve and stops getting bullied. == Release dates == Country Premiere 28 July 2006 28 July 2006 2 August 2006 3 August 2006 4 August 2006 4 August 2006 9 August 2006 (French speaking region) 9 August 2006 9 August 2006 10 August 2006 11 August 2006 11 August 2006 11 August 2006 12 August 2006 17 August 2006 17 August 2006 17 August 2006 18 August 2006 24 August 2006 31 August 2006 1 September 2006 7 September 2006 8 September 2006 8 September 2006 21 September 2006 21 September 2006 22 September 2006 22 September 2006 (Italian speaking region) 22 September 2006 22 September 2006 27 September 2006 28 September 2006 28 September 2006 28 September 2006 28 September 2006 28 September 2006 28 September 2006 29 September 2006 29 September 2006 29 September 2006 30 September 2006 5 October 2006 5 October 2006 6 October 2006 6 October 2006 7 October 2006 12 October 2006 (German speaking region) 12 October 2006 13 October 2006 13 October 2006 18 October 2006 20 October 2006 27 October 2006 8 November 2006 22 November 2006 11 April 2007 ==Other websites== Category:2006 computer-animated movies Category:American animated movies Category:Warner Bros. movies Category:Movies composed by James Newton Howard",
 "title": "The Ant Bully"
}