{
 "id": "673942",
 "text": "Mary Poppins Returns is a 2018 fantasy musical comedy-drama movie. It is a sequel to the 1964 award-winning movie Mary Poppins. Like the first movie, it is also based on the book series of the same name by P. L. Travers. ==Plot== In 1935 London, England, Michael Banks lives in his childhood home. He lives with his children Annabel, John and Georgie. His wife Kate died a year ago. For that reason, Ellen and Jane are helping him raise the children. However, Michael has taken out a loan from the Fidelity Fiduciary Bank to cover his expenses. William Weatherall Wilkins sends his partners to warn Michael that his house will be taken from him if he doesn't repay the loan by Friday. Michael and Jane remember their father left them shares in the bank that can cover the loan. They search the house for the certificate proving their ownership of the shares. During the search, Michael finds a kite. But there's no worth in it anymore, so he puts it out to give away. While out in the park with Annabel and John, Georgie finds the kite and tries flying it. He ends up being pulled into the sky. He then comes down with Mary Poppins. She decides to take care of the three children as their nanny. She starts off by drawing them a bath. The bath leads down to an oceanic world. Mary Poppins denies anything in fantasy happened. Michael goes to the bank to see if he can find proof of his shares. Wilkins, though, denies there are any records of them. Right after Michael leaves, Wilkins tears the record from the official book and burns it in the fireplace. That evening, Annabel and John decide to sell their mother's \"priceless\" bowl to pay off the debt. But Georgie tries to stop them. The bowl ends up damaged because of the three fighting over it. The next day, Mary Poppins and the children go and see Topsy so they can get the bowl fixed. But they find out that the bowl isn't worth much. They then head to the bank to give Michael his briefcase. When the children go to Wilkins' office to ask him for help, however, they learn he is planning to take away their house. Georgie interrupts the banker's meeting after seeing parallels between Wilkins, his associates and an animal gang who kidnapped him. When Michael arrives, he doesn't believe the children, and gets angry at them for putting the home and his job at risk. Mary Poppins takes the children home. They are guided by Jack and his fellow lamplighters. The Banks family get ready to move out of their house. But as he looks at his old kite, Michael realizes that Georgie use parts of the shares certificate to cover the kite's holes. Michael and Jane head to the bank. Mary Poppins and the children go with Jack and the lamplighters to Big Ben to \"turn back time\". After scaling the clock tower, Jack and Mary turn Big Ben back five minutes. That gives Michael and Jane enough time to reach the bank. Michael and Jane reach the bank in time, though they're not successful in getting their shares because they do not have the part with the signatures on the certificates. But then, Mr. Dawes Jr. comes and expels Wilkins from the bank for corrupt practices. The next day, the Banks family go to the park. They buy balloons that take them into the air. They're joined by Jack and many others, including Wilkins. But Wilkins' balloon falls to the ground. When they return home, Mary Poppins realizes it is time for her to go. Michael and Jane thank Mary as she flies back into the sky. ==Cast== * Emily Blunt as Mary Poppins. * Lin-Manuel Miranda as Jack, a cockney lamplighter and former apprentice of Bert from the original film. * Ben Whishaw as Michael Banks, Jane's brother, who is now working as a part- time teller at Fidelity Fiduciary Bank, and a struggling yet widowed artist. Matthew Garber portrayed the character in the original film. * Emily Mortimer as Jane Banks, Michael's sister who is now working as a labor organizer. Karen Dotrice portrayed the character in the original film, and makes a cameo appearance as an elegant woman in Mary Poppins Returns. * Pixie Davies as Annabel Banks: Michael's daughter. * Nathanael Saleh as John Banks: Michael's older son. * Joel Dawson as Georgie Banks: Michael's younger son. * Julie Walters as Ellen: Michael's and Jane's long-time housekeeper. The character was previously portrayed by Hermione Baddeley in the original film. * Dick Van Dyke as Mr. Dawes Jr.: the chairman of Fidelity Fiduciary Bank and William's uncle. The character was portrayed by Arthur Malet in the original film, while Van Dyke previously portrayed both Bert and Mr. Dawes, Sr. (Mr. Dawes, Jr.'s late father). * Angela Lansbury as The Balloon Lady. The character does not appear in the original film but comes directly from the novels. * Colin Firth as William \"Weatherall\" Wilkins: the currupt president of Fidelity Fiduciary Bank. **Firth also voices a wolf in the animated Royal Doulton Bowl sequence. * Meryl Streep as Topsy: Mary Poppins's eccentric Eastern European cousin who runs a fix-it shop within London. * David Warner as Admiral Boom: a staunchly by-the-book retired naval officer, who is now confined to a wheelchair. Reginald Owen portrayed the character in the first movie. * Jim Norton as Mr. Binnacle: Boom's first mate. Don Barclay portrayed the character, while David Tomlinson provided his voice in the original film. * Jeremy Swift as Hamilton Gooding: one of Wilkins's associates. ** Swift also voices a badger in the animated Royal Doulton Bowl sequence. * Kobna Holdbrook-Smith as Templeton Frye: one of Wilkins's associates. ** Holdbrook-Smith also voices a weasel in the animated Royal Doulton Bowl sequence. * Noma Dumezweni as Miss Penny Farthing: Wilkins's secretary. * Tarik Frimpong as Angus: Jack's fellow lamplighter. ===Voices=== * Edward Hibbert as Mary Poppins's Parrot Umbrella. He was previously voiced by David Tomlinson in the original Mary Poppins. * Chris O'Dowd as Séamus the Coachman Dog in the animated Royal Doulton Bowl sequence. * Mark Addy as Clyde the Horse in the animated Royal Doulton Bowl sequence. ==Reception== ===Box office=== As of December 30, 2018, Mary Poppins Returns has made $98.9 million in the United States and Canada. It made another $74.4 million in other territories. The total intake across the world was $173.3 million. ===Critical response=== Rotten Tomatoes gives the movie a 78% rating, based on 265 reviews. On the Metacritic, the movie has a 65 out of 100 rating, with 53 critics, meaning \"generally favorable reviews\". ===Awards=== Award Date of ceremony Category Recipient(s) and nominee(s) Result American Film Institute January 4, 2019 Top 10 Films of the Year Mary Poppins Returns Annie Awards February 2, 2019 Best Animated Special Production Outstanding Achievement for Character Animation in a Live Action Production Chris Sauve, James Baxter, Sandro Cleuzo Outstanding Achievement for Character Design in an Animated Feature Production James Woods Outstanding Achievement for Production Design in an Animated Feature Production Jeff Turley Outstanding Achievement for Storyboarding in an Animated Feature Production Ovi Nedelcu Critics' Choice Movie Awards January 13, 2019 Best Picture Mary Poppins Returns Best Actress Emily Blunt Best Production Design John Myhre, Gordon Sim Best Costume Design Sandy Powell Best Visual Effects Mary Poppins Returns Best Actress in a Comedy Emily Blunt Best Score Marc Shaiman Best Song \"The Place Where Lost Things Go\" \"Trip a Little Light Fantastic\" Detroit Film Critics Society December 3, 2018 Best Use of Music Mary Poppins Returns Golden Globe Awards January 6, 2019 Best Motion Picture – Musical or Comedy Best Actor in a Motion Picture – Musical or Comedy Lin- Manuel Miranda Best Actress in a Motion Picture – Musical or Comedy Emily Blunt Best Original Score Marc Shaiman Hollywood Music in Media Awards November 14, 2018 Original Score – Sci-Fi/Fantasy/Horror Film Original Song – Sci-Fi/Fantasy/Horror Film \"The Place Where Lost Things Go\" – Marc Shaiman and Scott Wittman \"Trip a Little Light Fantastic\" – Marc Shaiman and Scott Wittman Humanitas Prize February 8, 2019 Family Feature Film Mary Poppins Returns London Film Critics Circle January 20, 2019 British/Irish Actress of the Year Emily Blunt National Board of Review January 8, 2019 Top Ten Films Mary Poppins Returns Satellite Awards February 17, 2019 Best Motion Picture, Comedy or Musical Best Actor in a Motion Picture, Comedy or Musical Lin- Manuel Miranda Best Actress in a Motion Picture, Comedy or Musical Emily Blunt Best Original Song \"Can You Imagine That?\" – Marc Shaiman and Scott Wittman Best Art Direction and Production Design John Myhre Best Sound (Editing or Mixing) Mary Poppins Returns Screen Actors Guild Awards January 27, 2019 Outstanding Performance by a Female Actor in a Leading Role Emily Blunt Seattle Film Critics Society December 17, 2018 Best Costume Design Sandy Powell Best Production Design John Myhre, Gordon Sim Washington D.C. Area Film Critics Association December 3, 2018 Best Production Design John Myhre ==References== Category:2018 fantasy movies Category:2018 comedy movies Category:2018 musical movies Category:American fantasy-comedy movies Category:American musical comedy movies Category:Disney movies Category:Movies set in the 1930s Category:Movies set in London Category:American sequel movies Category:Movies about nannies Category:Movies about children Category:Movies about families Category:Movies about businesspeople",
 "title": "Mary Poppins Returns"
}