{
 "id": "674203",
 "text": "George Southall Vest (December 25, 1918 - August 24, 2021) was an American diplomat and State Department official who worked during the Richard Nixon, Jimmy Carter and Ronald Reagan presidencies. ==Personal life== Vest was born in Columbia, Virginia. He studied at the University of Virginia. He married Emily Clemons in 1947. She died in 2015. They had three children. Vest died on August 24, 2021 in Bethesda, Maryland from heart disease at the age of 102. ==Career== In 1954, Vest became the Canadian Desk officer at the United States Department of State in Washington, D.C.; he later was special assistant to the Assistant Secretary of State for European Affairs. An ambassador, he was the United States Ambassador to the European Union. In 1974, President of the United States Richard Nixon nominated Vest as Assistant Secretary of State for Politico-Military Affairs. On April 7, 1977 President Jimmy Carter nominated Vest as United States Ambassador to Pakistan, but this nomination was withdrawn on May 5, 1977. Carter then nominated Vest as Assistant Secretary of State for European Affairs and Vest held this office from June 16, 1977 until April 14, 1981. In 1981, President Ronald Reagan nominated Vest as United States Ambassador to the European Communities. He held this post until 1985, when Reagan named Vest Director General of the Foreign Service; he held this office from June 8, 1985 until May 3, 1989.A Cradle-to-Grave 'Godfather' of Foreign Service: George S. Vest, New York Times, February 10, 1988 WASHINGTON TALK: WORKING PROFILE; A CRADLE-TO-GRAVE 'GODFATHER' OF FOREIGN SERVICE: GEORGE S. VEST - The New York Times ==References== ==Other websites== * Office of the Historian, Department of State George Southall Vest - People - Department History - Office of the Historian * Interview with George S. Vest, Library of Congress, Interview with George S. Vest | Library of Congress Category:1918 births Category:2021 deaths Category:American centenarians Category:Ambassadors of the United States to the European Union Category:Politicians from Virginia",
 "title": "George S. Vest"
}