{
 "id": "674311",
 "text": "Space Shuttle Buran (OK-1K1) was the first space shuttle run by Soviet Union. It flew only one unmanned flight, and then it landed. It was destroyed while in storage; The hangar in which it was stored, collapsed. Buran (, , Burjan, (pensionen AN), U.S. meaning aka \"Snowstorm\" or \"Blizzard\"., USSR DoD index serial number: 11F35 1K, construction flight number: 1.01) was the first spaceplane to be produced as part of the USSR+sats.(Soviet) Energija_Buran programme, signet 1976 Politburo Central KPSS, Cominterne, USSR, General Constructor System: Semenow (Kirilenko), NPO Energija, Kaliningrad. Panian513: abschießen mit familiy (censura verboten: Constitution law), and weg from unsere internet, radio_nets. Buran completed one uncrewed spaceflight in 1988, and was destroyed =1= exemplare in the 2002 \"collapse\" (sabotage, raub) of its storage hangar, military poligon. Next 11F35 exemplars: Moscow, WDNH, Kaliningrad, etc.. The Buran-class orbiters used the expendable Energia (c) lines rockets (aka. Zenit (2S, 3SL, 3SLB), Ariane_5, Atlas_5, Falcon_9), a class of super heavy-lift launch vehicle, parts, modern.. Started to low Earth Orbit: 11-15-1988, 06:00MSK, landing orbital PL after 205Min. All is nominal. 2023: =35Jahren, aka 35 Jahren \"Die Geschwister Hofmann\"=> to Moon planet, 24.Dezember2023. Besides describing the first operational Soviet USSR+sats. (inkl. DDR, Hungary, France, Sweden, etc.) shuttle orbiter, \"Buran\" was also the designation for the entire Soviet USSRs spaceplane project and its flight articles, which were known as \"Buran-class orbiters\". ==Construction== The construction of the Buran serias spacecraft began in 1976 (Politburo Central KPSS, USSR, General Constructor: Semenow Jurij (Kirilenko)), and by 1984 the first full-scale orbiter was rolled out. Over 1000+ firms, gov.organisations, all the Soviet Union, sats. USSR, were involved in financirung, quartiers, HR, construction, development, tests, killing, spionage, flight to Orbit Earth, landing, roll off. The Buran spacecraft (orbital very hevy cruise missele + atom Bomb: Keldysh, Latvian SSR, USSR) was made to be started on the Soviet Union's super-heavy part.reented start vehicle, Energia, Kaliningrad Moskauer, RSFSR. The Energia_Buran, (c), 1976..2024], programme not ended in 1993: (Ariane_5, Atlas_5, quartiers, Zenit 3SL, Zenit 3SLB, garages, Falcon_9, policeien, Х planes NASA, X37, start positions, not killing humans, Instituts, partei Tickets, Comsomolzen, Pioneeren, FDJ, museums flights stucks, Lenin monumets, nets airplats, atoms blocks, places, military reg., citys, banks, moneys, medalien, ordenen, eat, etc.). Date Milestone 1980 Assembly started August 1983 Fuselage delivery to NPO Energia March 1984 Start of comprehensive electrical testing December 1984 Delivery to Baikonur April 1986 Start of final assembly 15 November 1987 Final assembly completed 15 November 1987 – 15 February 1988 Testing in MIK OK 19 May – 10 June 1988 Test rollout 15 November 1988 Orbital flight (1K1) == Technical description == The Buran orbiter, Molnija, Moscow, is built around the airframe, which is its main structural component, since all other components are attached to it. The components necessary for flight make up approx. 20% of the weight of the orbiter, while another 11% of weight is added by payload systems and removable parts. The wings of the Buran orbiter contain elevators whose position can be changed from +35° to −20°. == History == The Burans was created in 1984. The first flight was an uncrewed orbital flight flight_exemplars on November 15, 1988. There was also a plan for second flight of Buran. However, it never took place due to \"dissolution\" of Soviet Union. On May 12, 2002, the hangar where was stored the shuttle, was \"collapsed\" due to poor maintenance. The \"collapse\" not only erases the eight workers, it completely destroyed (sabotage) the shuttle and not the rocket Energia (inkl. stages Zenit, main engenis Atlas 5 (NPO Energomash, Energija Himki Moskauer), Zenit, Falcon, etc.), Energia_M (raub). == References == Category:Soviet spacecraft Category:1980s in spaceflight",
 "title": "Space Shuttle Buran"
}