{
 "id": "674356",
 "text": "Windows NT 6.x is a family of Windows NT, starting with Vista and ending with 8.1. == Versions == OS Date Build NT Version Support status Support status exceptions Windows Vista Windows Vista Starter, Windows Vista Home Basic, Windows Vista Home Premium, Windows Vista Business, Windows Vista Enterprise NT 6.0 Support for RTM version ended on April 13, 2010, mainstream support with Service Pack 2 (SP2) ended on April 10, 2012. Extended support ended on April 11, 2017. Windows Server 2008 Windows Server 2008 Standard Mainstream support ended on January 13, 2015. Extended support ended on Windows Server 2008 is eligible for the paid Extended Security Updates (ESU) program. This program allowed to purchase security updates for 3 years, in early installments through at most January 10, 2023 (January 9, 2024 for Azure customers) only for volume licensed editions. Windows 7 Windows 7 Home Premium, Windows 7 Enterprise, Windows 7 Professional NT 6.1 Mainstream support ended on January 13, 2015. Extended support that excludes Professional and Enterprise ended on . Paid support via the Extended Security Updates (ESU) program for Professional and Enterprise ended on , excluding some Embedded editions Windows Server 2008 R2 Applies for Windows Server 2008 R1. Mainstream support ended on January 13, 2015. Extended support ended on . Windows Server 2008 R2 is eligible for the paid Extended Security Updates (ESU) program. This program allowed to purchase security updates for 3 years, in early installments through at most January 10, 2023 (and allows to purchase security updates until January 9, 2024, for Azure customers) only for volume licensed editions. Windows Server 2012 Windows Server 2012 Foundations, Windows Server 2012 Essentials, Windows Server 2012 Standard NT 6.2 Mainstream support ended on October 9, 2018. Extended support ended on Paid support via the Extended Security Updates (ESU) program until October 13, 2026, only for volume licensed editions Windows 8 RTM Windows 8 Pro, Windows 8 OEM, Windows 8 Enterprise All editions except Windows Embedded 8 Standard: No mainstream support end date. Extended support ended on January 12, 2016; 5 years and 11 months ago Windows Embedded 8 Standard: Mainstream support ended on July 10, 2018, 4 years and 6 months ago, extended support ended July 11, 2023 Windows 8.1 Windows 8.1 Pro, Windows 8.1 OEM, Windows 8.1 Enterprise NT 6.3 All editions except Windows Embedded 8.1 Industry: Mainstream support ended on January 9, 2018. Extended support ended on January 10, 2023. Windows Embedded 8.1 Industry: Mainstream support ended on July 10, 2018, 4 years and 6 months ago, extended support ended July 11, 2023 Windows Server 2012 R2 Applies for Windows Server 2012 R1 Mainstream support ended on October 9, 2018. Extended support ended on Paid support via the Extended Security Updates (ESU) program until October 13, 2026, only for volume licensed editions Windows 10 was released on July 29, 2015, and with it, Microsoft jumped to NT version 10.0. == References == Category:Microsoft operating systems",
 "title": "Windows NT 6.x"
}