{
 "id": "67472",
 "text": "A data storage device is a device for recording (storing) information (data). Recording can be done using virtually any form of energy. People have been storing data for thousands of years, by pictures and writing. Modern storage device may hold information, process information, or both. Most often the term is used with computers. Data storage devices can permanently hold data, like files. Electronic data storage is storage which requires electricity to store and get back that data. Most storage devices that do not require visual optics to read data fall into this category. Electronic data may be stored in either an analog or digital signal format. ==Terminology== An organic brain may or may not be considered a data storage device.Ray Bradbury, Fahrenheit 451, 1950, 1953 pp:150-152, All information is data. However, not all data is information. ==Data storage equipment== Any input/output equipment may be considered data storage equipment if it writes to and reads from a data storage medium. Data storage equipment uses either: * portable methods (easily replaced), * semi-portable methods requiring mechanical disassembly tools and/or opening a chassis, or * inseparable methods meaning loss of memory if disconnected from the unit. The following are examples of those methods: === Portable methods === *Hand crafting *Flat surface **Printmaking **Photographic * Fabrication **Textile * Cylindrical accessing * Memory card reader/drive * Tape drive **Mono reel or reel-to-reel **Compact Cassette player/recorder * Disk accessing **Disk drive **Floppy disk * Cartridge accessing/connecting (tape/disk/circuitry) * Peripheral networking * Flash memory devices === Semi- portable methods === * Hard disk drive * non-volatile RAM === Inseparable methods === * Volatile RAM * NeuronsAaron P. Nelson and Susan Gilbert, Harvard Medical School Guide to Achieving Optimal Memory, Mar 2005, page 66 ==Recording medium== A recording medium is a physical material that holds data expressed in any of the existing recording formats. With electronic media, the data and the recording medium is sometimes referred to as \"software\" despite the more common use of the word to describe computer software. ===Ancient and timeless examples=== * Optical ** Any object visible to the eye, used to mark a location such as a, stone, flag or skull. ** Any crafting material used to form shapes such as clay, wood, metal, glass, wax. *** Quipu ** Any branding surface that would scar under intense heat (chiefly for livestock or humans). ** Any marking substance such as paint, ink or chalk. ** Any item that would hold a marking substance such as, papyrus, paper, skin. * Chemical ** RNA ** DNA ** Pheromone ===Modern examples by energy used=== *Chemical **Dipstick *Thermodynamic **Thermometer *Photochemical **Photographic film * Mechanical **Pins and holes *** Punch card *** Paper tape ****Music roll *** Music box cylinder or disk **Grooves (See also Audio Data) *** Phonograph cylinder *** Gramophone record *** DictaBelt (groove on plastic belt) *** Capacitance Electronic Disc *Magnetic storage **Wire recording (stainless steel wire) **Magnetic tape **Drum memory (magnetic drum) **Floppy disk *Optical storage ** Photo paper ** X-ray ** Hologram ** Projected transparency ** Optical disc ** Magneto-optical disc ** Holographic versatile disc ** 3D optical data storage *Electrical **Semiconductor used in volatile RAM microchips **Floating-gate transistor used in non-volatile memory cards ===Modern examples by shape=== A typical way to classify data storage media is to consider its shape and type of movement (or non-movement) relative to the read/write device(s) of the storage apparatus as listed: * Paper card storage ** Punched card (mechanical) * Tape storage (long, thin, flexible, linearly moving bands) ** Paper tape (mechanical) ** Magnetic tape (a tape passing one or more read/write/erase heads) * Disk storage (flat, round, rotating object) ** Gramophone record (used for distributing some 1980s home computer programs) (mechanical) ** Floppy disk, ZIP disk (removable) (magnetic) ** Holographic ** Optical disc such as CD, DVD, Blu-ray Disc ** Minidisc ** Hard disk drive (magnetic) * Magnetic bubble memory * Flash memory/memory card (solid state semiconductor memory) ** xD-Picture Card ** MultiMediaCard ** USB flash drive (also known as a \"thumb drive\" or \"keydrive\") ** SmartMedia ** CompactFlash I and II ** Secure Digital ** Sony Memory Stick (Std/Duo/PRO/MagicGate versions) ** Solid-state drive ==Related pages== *Archive *Computer data storage *Data vault *Library *Multimedia ==References== *Bekenstein, Jacob D. (2003, August). Information in the holographic universe. Scientific American.Bekenstein (2003) foresees that miniaturization might lead to the invention of devices that store bits on a single atom. == Bibliography == * * ==Other websites== *Historical Notes about the Cost of Hard Drive Storage Space",
 "title": "Data storage device"
}