{
 "id": "67488",
 "text": "Haemophilia is a blood condition that means bleeding does not stop. It is a rare condition that affects the blood's ability to clot. It's usually inherited. Most people who have it are male. A person with haemophilia is called a haemophiliac. People with hemophilia lack proteins in the blood that make scabs and blood clots.Green, David. \"Hemophilia.\" World Book Advanced. World Book, 2016. Web. 22 Feb. 2016. For example, a child with haemophilia A does not enough clotting factor VIII (8) in their blood. A child with haemophilia B does not have enough clotting factor IX (9) in their blood. People with hemophilia do not bleed more than a normal person, but they bleed for much longer. In some cases, a boy is born with haemophilia even though there's no family history of the condition. In such cases, it's thought the gene change developed spontaneously in the boy's mother, grandmother or great- grandmother, but until then, a male member of the family had never inherited it. Some studies have shown there's no known family history of haemophilia in up to 1 in 3 new cases. The word comes from the Greek words haima (\"blood\") and philia (\"to love\"). == Symptoms == The main symptom is bleeding that does not stop. People with haemophilia may have: * nosebleeds that take a long time to stop * bleeding from wounds that lasts a long time * bleeding gums * skin that bruises easily * pain and stiffness around joints, such as elbows, because of bleeding inside the body (internal bleeding) There's a small risk that people with haemophilia may have a bleed inside their skull (a brain or subarachnoid haemorrhage). Symptoms of a brain haemorrhage include: * a severe headache * a stiff neck * being sick (vomiting) * a change in mental state, such as confusion * difficulty speaking, such as slurred speech * changes in vision, such as double vision * loss of co-ordination and balance * paralysis of some or all the facial muscles Call an ambulance. == Problems (anatomy) == Symptoms include easy bruising, and hematoma formation. Bleeding from the gums and mucous membranes is another. The concern is when there is bleeding into joints, particularly in the ankles, knees, and elbows, which is called hemarthrosis. Hemarthrosis can cause an inflammatory process to begin in which the joints become painfully swollen and eventually limit motion. Bleeding into muscle tissue from minor traumas can result in anemia and compression of vital structures and nerves leading to compartment syndrome. Bleeding less frequently occurs in the urinary and gastrointestinal tracts. These patients are at significant risk of intracranial bleeds which would be a life- threatening emergency. This can lead to a perpetual cycle of other problems, which then cause the same problems or existing ones to become worse. If a joint bleed is not treated, it can lead to: *more severe joint pain *stiffness *the site of the bleed becoming hot, swollen, and tender == Types == There are 3 types of haemophilia: * Haemophilia A - about 90% of cases. There is no blood clotting ability. * Haemophilia B - not as severe, but much less common. There is not enough blood clotting ability. * Haemophilia C - caused by not one, but two recessive (weak) genes. == Genetics and frequency == When there is family history of haemophilia in someone trying for a pregnancy, genetic and genomic testing can help find out the risk of passing the condition on to a child. This may involve testing a sample of tissue or blood to look for signs of the genetic change that causes haemophilia. Blood tests can diagnose haemophilia and find out how severe it is. Hemophilia can present in infancy with cephalohematoma formation after vaginal birth and with more than usual bleeding after circumcisions. If haemophilia is suspected after the child is born, a blood test can usually confirm the diagnosis. Blood from the umbilical cord can be tested at birth. Haemophilia A happens in about 1 in 5,000–10,000 male births. Haemophilia B happens in about 1 in every 20,000–34,000 male births. If there's no family history of haemophilia, it's usually diagnosed when a child begins to walk or crawl. Mild haemophilia may only be discovered later, usually after an injury or a dental or surgical procedure. The bleeding may also happen after a medical or dental procedures such as having a tooth removed. Genetic defects on the X chromosome affect males because they have only one X chromosome. In females, a recessive gene is usually masked by a normal gene on the other X chromosome. The gene change is on the X chromosome. It can be carried by either the mother or father, or both. But The chances of a child inheriting the haemophilia changed gene depends on which of their parents has the changed gene. The Y chromosome does carry some genes, but far fewer than the X chromosome. Defects of this type are called \"sex-linked\" in genetics. There is no cure for this disease but there are different treatments available around the world. ==Treatment == There's no cure for haemophilia, but treatment usually allows a person with the condition to enjoy a good quality of life. Man-made clotting factors are given as medicines to prevent and treat prolonged bleeding. These medicines are given as an injection. Injections are given differently in mild and severe cases according to the patients needs. To treat this, an affected person can get a blood donation from someone without hemophilia. The donor’s blood has clotting proteins and can temporarily make a normal scab.\"HEMOPHILIA.\" SICK! Diseases and Disorders, Injuries and Infections. Online Edition. Detroit: UXL, 2008. 30% of hemophilia A and B cases are the first person in their family to have hemophilia which is the result of an unexpected mutation (this means that there is an unexpected change in the body). If you received a blood transfusion or blood products before 1996, there's a chance you may have been given infected blood (HIV, Hepatitis). == References == Category:Blood disorders Category:Genetic disorders",
 "title": "Haemophilia"
}