{
 "id": "67566",
 "text": "Divination (Greek μαντεια, from μαντις \"seer\") is an attempt to get information through omens or supernatural things. The verb form is to divine, but this should not be confused with the adjective divine. Divining the outcome of things has been done by many different methods, such as the ones listed below. Divination is different from fortune-telling. Divination is more ritual, usually religious. Fortune-telling is more for personal things. == Types of divination == * Astrology (by celestial bodies) * Ailuromancy (by the behaviour of felines) * Augury (by the flight of birds) * Aura-Soma, based on colors * Bibliomancy (by book, frequently but not always a religious text) * Cartomancy (by cards, e.g., playing cards, tarot cards, and non-tarot oracle cards; see also Taromancy) * Cheiromancy (by palms; see Palmistry) * Chronomancy (by time; lucky/unlucky days) * Coscinomancy (by a sieve) * Crystallomancy (by crystals or other reflecting objects; see also Scrying) * Extispicy (from the entrails of sacrificed animals) * Geomancy (by earth), includes Feng Shui divination * Graphology (by handwriting) * I Ching divination (ancient Chinese divination using I Ching): (But using an I Ching manual can make it also a form of Bibliomancy/Stichomancy) * Heruspicy (by the organs of sacrificed animals) * Necromancy (by trying to ask the dead) * Numerology (by numbers) * Oneiromancy/Incubatio (by dreams) * Onomancy (by names) * Ouija board divination * Palmistry (by palm inspection) * Phrenology (by the shape of one's head) * Pyromancy, or pyroscopy (by fire) * Rhabdomancy divination by rods * Scrying (\"seeing\" in a crystal ball, a mirror, or water) * Runecasting / Runic divination (by runes) * Sternomancy (by markings or bumps on the chest) * Taromancy (by specially designed cards: Tarot; see also Cartomancy) == Related pages == *Oracle == Other websites == *Apple Divination *Ancient Astrology and Divination on the Web , resources on Greco-Roman and Mesopotamian divination *W. R. Halliday, Greek Divination (1913), a complete scanned edition of the most recent general treatment of Greek divination *1913 Catholic Encyclopedia: Divination *Divination Methods * Encyclopedia Iranica: Divination *Theory of Divination by Tim Maroney, exploring different possibilities *The Sator Formula engraved on a human skull Category:Occult",
 "title": "Divination"
}