{
 "id": "67571",
 "text": "was the 52nd Emperor of Japan,Imperial Household Agency (Kunaichō), 嵯峨天皇 (52); retrieved 2011-10-24. according to the traditional order of succession.Ponsonby-Fane, Richard. (1959). The Imperial House of Japan, pp. 63-64. Saga's reign started in 809 and ended in 823.Titsingh, Isaac. (1834). Annales des empereurs du Japon, pp. 97-102; Brown, Delmer et al. (1979). Gukanshō, pp. 280-282; Varley, H. Paul. (1980). Jinnō Shōtōki, p. 151-163. ==Traditional history== Before he became the monarch, this prince's personal name (imina) was .Titsingh, p. 97; Brown, p. 280. He was the son of Emperor Kammu, and he was the younger brother of Emperor Heizei by the same mother.Varley, p. 151. He had nine Empresses and consorts; and 47 Imperial sons and daughters.Brown, p. 280. Saga was known as a good writer. He sponsored the first imperial poetry competitions (naien).Brown, p. 281. According to legend, he was the first Japanese emperor to drink tea. ===Events of Saga's life=== Before he became the monarch, he was Crown Prince for three years. * 17 June 809 (Daidō 4, 1st day of the 4th month): In the 4th year of Emperor Heizei's reign, he was very sick and he abdicated. The succession (senso) was received by his younger brother Then the new emperor is said to have acceded to the throne (sokui). This was confirmed in ceremonies.Varley, p. 44; a distinct act of senso is unrecognized prior to Emperor Tenji; and all sovereigns except Jitō, Yōzei, Go-Toba, and Fushimi have senso and sokui in the same year until the reign of Emperor Go-Murakami. Compare Imperial Household Agency (Kunaichō), Ceremony of Accession (Sokui-no-Rei); retrieved 2011-12-23. * 24 August 842 (Jōwa 9, 15th day of the 7th month): Saga died at the age of 57.Brown, p. 282; Varley, p. 163. ===After his death=== According to the Imperial Household Agency, the mausoleum (misasagi) of Heizei is near Daikaku-ji in Ukyō-ku, Kyoto. The emperor is traditionally venerated at a memorial Shinto shrine at this location. ==Eras of reign== The years of Kammu's reign are identified by more than one era name (nengō).Titsingh, pp. 97-102. * Daidō (806-810) * Kōnin (810-824) ==Legacy== In ancient Japan, there were four noble clans, the Gempeitōkitsu (源平藤橘). One of these clans, the Minamoto clan are also known as Genji (源氏). The Saga Genji (嵯峨源氏) are said to be descended from Emperor Saga. ==Related pages== * Emperor of Japan * List of emperors of Japan * Japanese imperial family tree * Emperor Go-Saga ==References== == Other websites == * Gate at Saga's mausoleum Category:Emperors of Japan Category:785 births Category:842 deaths",
 "title": "Emperor Saga"
}