{
 "id": "67589",
 "text": "Mansa Musa was the emperor (mansa) of Mali during the 14th century. He became emperor in 1312. He was the first African ruler to be famous in all of Europe and the Middle East. Historians say he was the richest person to have ever lived. Today, his wealth would be worth more than 400 billion USD. Mansa Musa came to power in 1312 CE. Mansa Musa's new trade works made the already wealthy country the wealthiest in Africa, which mostly came from gold, ivory, and unique salt. He is known for being the richest man in history with his large amount of gold, and what he did to make Mali memorable. Mansa Musa was the great-nephew of Sundiata Keita, who started the Mali Empire. He is famous for his Hajj (1324–5). His caravan may have had 60,000 people carrying supplies and bags, 500 slaves each carrying a gold staff, and 80 to 100 camels each carrying 300 pounds of gold dust. On his journey, he is said to have given out millions of dollars worth of gold. He gave out so much gold in Cairo that the price of gold went down and stayed low for many years. Mansa Musa stopped in many places on his way to Mecca for his Hajj. These places include Timbuktu and Gao. He stopped every Friday at a destination and left enough gold for a mosque to be built. Mansa Musa made Timbuktu a center of trade, culture and of Islam, which also helped increase the spread of Islam throughout Western Africa. He was a devoted Muslim, and built many schools based on the teachings of the Qur'an. He sent students to Islamic universities in northern Africa. Mansa Musa was mostly known for his Hajj pilgrimage to Cairo, Egypt. Several authors from Arab claimed that he traveled with tens of thousands of people and a dozen camels carrying 136 kgs of gold each. In Cairo, Mansa Musa refused to meet the Sultan, claiming that he was only here for his religious purposes. Before Mansa Musa left, he gave the people of Cairo so much gold that the price of it decreased for 12 years. When he returned to Mecca, Mansa Musa built many mosques and buildings in cities similar to Gao and Timbuktu. After his Hajj, European cartographers began to draw Mansa Musa on maps. As the empire of Mali fell apart, Mansa Musa's reputation did as well; he was no longer drawn as a noble king on maps. Instead, artists drew him to look uncivilized. He was drawn as a parody of European royalty and a normal person with a crown. Mansa Musa was married to Inari Kunate. == References == * \"Mansa Musa.\" World History: Ancient and Medieval Eras. ABC-CLIO, 2013. Web. 4 Dec. 2013. * MacDonald, Kevin C. \"Mansa Musa.\" World Book Advanced. World Book, 2013. Web. 4 Dec. 2013. * Kane, Ousmane. \"Musa, Sultan of Mali.\" Encyclopedia of Islam and the Muslim World. Ed. Richard C. Martin. New York: Macmillan Reference USA, 2004.Biography in Context. Web. 4 Dec. 2013. * National Geographic Society, \"Mansa Musa (Musa I of Mali).\" National Geographic, 19 Oct. 2023 Web. 1 Dec. 2023. == Other websites == * History Channel: Mansa Musa: Pilgrimage of Gold * Al-Umari's description of Mansa Musa's 1324 visit to Cairo * Sondiata and Mansa Musa on the Web web directory * African Legends page * African Events Mansa Musa page * Mansa Musa , from Black History Pages * National Geographic: Mansa Musa (Musa I of Mali) * https://www.bbc.com/news/world-africa-47379458 Category:1280 births Category:1337 deaths Category:Malian emperors",
 "title": "Mansa Musa"
}