{
 "id": "676148",
 "text": "King Taejong (13 June 1367 – 30 May 1422) was the third king of Joseon. He was the king for 18 years (1400–1418). He was the father of King Sejong the Great, the inventer of Hangul, which is Korean alphabet. His surname is Lee (李),(also known as Yi), his pen name is Bangwon (芳遠), his family origin is Jeonju (全州), and his courtesy name is Yudeok (遺德). He was the fifth son of King Taejo, the founder of Joseon, and his wife, Queen Sinui, and he helped King Taejo in the founding of Joseon. As a prince, he received the titles of Prince Jeongan (靖安君) and Duke Jeongan (靖安公). After that, he took power by eliminating his political opponents through two Princes' Rebellions, and ascended to the throne after receiving the abdication of his full brother, King Jeongjong. After ascending to the throne, he expelled the meritorious retainers, abolished the private army, and implemented the Ho-Pae Law and the Six- Minister Direct Lineage System . He strengthened the royal power by purging the royal relatives, including his wife's family and in-laws. His nickname was Kill Bang-won. == Early life == === Birth and family lineage === He was born on June 13, 1367 ( May 16 in the lunar calendar ) ( 16th year of King Gongmin's reign ) in Gwiju, Hamheung-bu, Goryeo as the fifth son of Yi Seong -gye and his wife, Lady Han . While most of Yi Seong-gye's sons grew up to be military men, Yi Bang-won is said to have preferred academics to martial arts or martial arts from a young age. Ungok Won Cheon-seok was one of Taejong's teachers during his time as a junior secretary. In 1382 ( 9th year of King U's reign), he passed the Jinsasi (進士試) and in 1383 (10th year of King U's reign), he passed the civil service examination with a rank of 7th in the second class. At the time of his passing, his father, Yi Seong-gye, and his mother, Lady Han, were very happy (like ecstatic.) In 1388 (15th year of King U's reign), he fled to the northeast with his family during the Wihwado Retreat, and after accompanying Yi Saek to Beijing as the chief of staff of the Jeongjosa mission to the Ming Dynasty, he helped his father eliminate the forces that maintained the Goryeo Dynasty. In particular, he planned to eliminate Jeong Mong-ju with his subordinate Jo Yeong-mu . In 1390 ( the second year of King Gongyang's reign ), he was appointed as Miljik Sadaeon (密直司代言), and when his mother Lady Han passed away in 1391 , he was buried in Sangdo-ri, Gaeseong-gun and lived in a cemetery. However, when Jeong Mong-ju's faction plotted to eliminate Yi Seong-gye, his wife Kang (Queen Shindeok) stopped living in a cemetery, went to Haeju, and summoned Yi Bang-won to Gaeseong . Category:1367 births Category:1422 deaths Category:Kings of Joseon",
 "title": "Taejong of Joseon"
}