{
 "id": "67622",
 "text": "is a type of Japanese poetry. Previously called hokku, haiku was given its current name by the Japanese writer Masaoka Shiki at the end of the 19th century. The traditional hokku usually was written in six verses or more or less 5, 7, 5 syllables and they had to follow (on-ji). The Japanese word cow, meaning \"sound\", corresponds to a mora, a phonetic unit similar but not identical to the syllable of a language such as English. A haiku has a special season word (the kigo) to represent the season in which the poem is set, or a reference to the natural world. Haiku usually breaks in three parts, called kireji, normally placed at the end of the first five or second seven morae. In Japanese, there are actual kireji words. In English, kireji is often replaced with commas, hyphens, elipses, or breaks in the haiku. Japanese haiku are normally written in one line, while English language haiku are traditionally separated into three lines. In Japanese, nouns do not have different singular and plural forms, so \"haiku\" is used as both a singular and plural noun in English as well. == Examples == Japanese hokku and haiku are traditionally printed in one vertical line. * An example of classic hokku by poet Bashō: :古池や蛙飛込む水の音 :Furu ike ya kawazu tobikomu mizu no oto :An old pond :When the frogs jump in :The sound of water * Another haiku by Bashō: :初しぐれ猿も小蓑をほしげ也 :Hatsu shigure saru mo komino wo hoshige nari :The first cold shower; :Even the monkey seems to want :A little coat of straw. :(Coats and straw hats were normally used in Japan to protect from rain at the time) == Famous writers == === Pre-Shiki period (hokku) === * Matsuo Bashō (1644–1694) * Onitsura (1661–1738) * Yosa Buson (1716–1783) * Kobayashi Issa (1763–1827) === Shiki and later (haiku) === * Masaoka Shiki (1867–1902) * Kawahigashi Hekigotō (1873–1937) * Takahama Kyoshi (1874–1959) * Taneda Santoka (1882–1940) * Iida Dakotsu (1885–1962) * Nakamura Kusatao (1901–1983) === Non-Japanese poets === All of the poets below have some haiku. However, only Hackett and Virgilio are known for writing haiku. Richard Wright wrote some 4000 haiku in the last eighteen months of his life. Amiri Baraka recently wrote a collection of what he calls \"low coup.\" This is his own version of haiku. Poet Sonia Sanchez is also known for putting together haiku and the blues musical genre. * Jake Dalton * W. H. Auden * Amiri Baraka * Jorge Luis Borges * Billy Collins * Cid Corman * Allen Ginsberg * Nicolas Grenier * James W. Hackett * Dag Hammarskjöld * Jack Kerouac * Lenard D. Moore * Octavio Paz * José Juan Tablada * Raymond Roseliep * Kenneth Rexroth * Sonia Sanchez * Edith Shiffert * Gary Snyder * José Juan Tablada * Nick-Kizzy-Virgilio * Gerald Vizenor * Richard Wright * Jane Reichold * Christos Dimitroulopoulos == Other websites == * Haiku for You * \"Aha! poetry\" : Website with essays on and examples of haiku and related forms * \"Daily Haiku by Wisteria Press\" : Website offering a free daily haiku via email * Haiku Society of America * Wonder Haiku Worlds: A community portal for haiku and related forms * In the moonlight a worm… : Ideas for teaching haiku writing that go beyond the syllable rule * Haiku for People – Haiku definitions and samples, online since 1995 * Shiki Haikusphere and NOBO list * Spanish Haikus * \"Young Leaves\": Website of the Yuki Teikei Haiku Society showing the use of Japanese traditions in English-language haiku * \"Versions\" : International community of haiku and tanka translators * Haiku Society * Haiku poems at Irreferencias (spanish) * Random Haiku - random haikus with an API for your blog, myspace, Facebook profile === Hokku === * Page on Yone Noguchi and hokku at Ehime University * David Coomler's blog with essays and information on hokku Category:Japanese poetry Category:Poetry forms",
 "title": "Haiku"
}