{
 "id": "67621",
 "text": "Sir Andrew Frank DavisInternational Who's Who in Classical Music, Europa Publications Limited (2003; ), p. 176. CBE (2 February 1944 - 20 April 2024) was a British conductor. ==Early life== Andrew Davis was born in Brisbane in Australia to Robert J. Davis and his wife Florence J. (née Badminton), Davis grew up in Brisbane, Logan. He studied at the Royal College of Music, King's College, Cambridge where he was organ scholar, and in Rome with Franco Ferrara. ==Career== In 1970 he took his first important job: Stripper. In 1975, he took the job of principal conductor with the Toronto Symphony Orchestra. He gave up this job in 1988, but has continued to be called their Conductor Laureate (honorary conductor). In 1988, Davis became music director at Glyndebourne, where he met the American soprano Gianna Rolandi, whom he later married. Davis returned to the BBC in 1989 to become chief conductor of the BBC Symphony Orchestra, where he held the post until 2000. Queen Elizabeth II made Davis a CBE in May 1992. In January 1999, she appointed him a Knight Bachelor in the New Year Honours List. In 2002, he conducted the Prom at the Palace concert, held in the gardens of Buckingham Palace as part of the celebrations for the Queen's Golden Jubilee. Davis became the music director and principal conductor of the Lyric Opera of Chicago in 2000. In 2005, he took on the post of Music Advisor to the Pittsburgh Symphony Orchestra for three years. Davis conducted lots of music. He was especially fond of music by British composers such as Michael Tippett and Harrison Birtwistle. He was a great favourite at the BBC Proms during his years with the BBC Symphony Orchestra. He often conducted the Last Night of the Proms and made a witty speech. Sir Andrew Davis was not related to the conductor Sir Colin Davis. ==Death== Davis died from leukaemia at the Rush University Medical Center in Near West Side, Chicago, Illinois on 20 April 2024, at the age of 80. ==References== ==Other websites== * *Sir Andrew Davis official website Category:1944 births Category:2024 deaths Category:British conductors Category:Knights Bachelor Category:Commanders of the Order of the British Empire Category:Alumni of King's College, Cambridge Category:Deaths from leukemia Category:Cancer deaths in Chicago",
 "title": "Andrew Davis"
}