{
 "id": "67640",
 "text": "is a famous Japanese game designer. He was born in 1958. For most of his life, he has worked for Sega. Some people say he is as famous as Shigeru Miyamoto. Suzuki created games like Hang-On and Virtua Fighter and Shenmue. He was person #6 who was added to the Academy of Interactive Arts and Sciences Hall of Fame. Both of Suzuki's parents were school teachers. When Suzuki was growing up, he wanted to be a dentist. But he could not pass the test, so he decided to study computers instead. In 1983 he started working at Sega. In 1993 he wrote a famous game called Virtua Fighter. It was so famous, that it was added to the Smithsonian museum in Washington DC, as an example of an important game. ==Personal life== Suzuki said in an interview that he greatly enjoys creating games. However, he has doesn't care much about playing them. he would rather spend his free time watching movies and visiting theme parks. ==Games developed== Title Year released Platform Role Champion Boxing 1984 Sega SG-1000 Director / Designer Hang-On 1985 Sega Hang-On hardware Director / Designer Space Harrier 1985 Sega Space Harrier hardware Director / Designer Enduro Racer 1986 Sega Space Harrier hardware Director / Designer Out Run 1986 Sega OutRun hardware Director / Designer Super Hang-On 1986 Sega OutRun hardware Producer After Burner 1987 Sega X Board Director / Designer After Burner II 1987 Sega X Board Director / Designer Power Drift 1988 Sega Y Board Director / Designer Dynamite Düx 1988 Sega System 16 Producer Turbo Outrun 1989 Sega OutRun hardware Producer Sword of Vermilion 1989 Sega Mega Drive Producer G-LOC: Air Battle 1990 Sega Y Board Director / Designer GP Rider 1990 Sega X Board, Sega Game Gear Producer Strike Fighter 1991 Sega Y Board Designer / Producer Rent-A-Hero 1991 Sega Mega Drive Producer F1 Exhaust Note 1991 Sega System 32 Producer Virtua Racing 1992 Sega Model 1 Director / Chief Programmer Soreike Kokology 1992 Sega System 32 Producer Virtua Fighter 1993 Sega Model 1, Sega Saturn, Microsoft Windows Director / Producer Burning Rival 1993 Sega System 32 Producer Daytona USA 1993 Sega Model 2, Sega Saturn, Microsoft Windows Producer / Special Thanks Virtua Cop 1994 Sega Model 2, Sega Saturn, Microsoft Windows Producer / Supervisor Virtua Fighter 2 1994 Sega Model 2, Sega Saturn, Microsoft Windows Director / Producer Desert Tank 1994 Sega Model 2 Producer Virtua Striker 1995 Sega Model 2 Producer Virtua Cop 2 1995 Sega Model 2, Sega Saturn, Microsoft Windows Producer / Supervisor Fighting Vipers 1995 Sega Model 2, Sega Saturn Producer Virtua Fighter 3 1996 Sega Model 3, Dreamcast Director Virtua Fighter Kids 1996 Sega ST-V, Sega Saturn Producer Fighters Megamix 1996 Sega Saturn Producer Sonic the Fighters 1996 Sega Model 2 Producer Scud Race 1996 Sega Model 3 Producer Virtua Striker 2 1997 Sega Model 3 Producer Digital Dance Mix Vol.1 Namie Amuro 1997 Sega Saturn Producer All Japan Pro-Wrestling Featuring Virtua 1997 Sega ST-V Producer Fighting Vipers 2 1998 Sega Model 3, Dreamcast Producer Daytona USA 2 1998 Sega Model 3 Producer Ferrari F355 Challenge 1999 Sega NAOMI Multiboard, Dreamcast, PlayStation 2 Director / Producer Shenmue 1999 Dreamcast Director / Producer / Writer Outtrigger 1999 Sega NAOMI Producer 18 Wheeler: American Pro Trucker 1999 Sega NAOMI, Dreamcast Producer Shenmue II 2001 Dreamcast, Xbox Director / Producer / Writer Virtua Fighter 4 2001 Sega NAOMI 2, PlayStation 2 Director / Producer Virtua Cop 3 2003 Sega Chihiro Producer OutRun 2 2003 Sega Chihiro Producer Sega Race TV 2008 Sega Lindbergh Producer Shenmue City 2010 Yahoo Mobage Service Director Virtua Fighter: Cool Champ 2011 iPhone Director Bullet Pirates 2013 Android, iPhone Director Virtua Fighter: Fever Combo 2014 iPhone, Android Director Shenmue III 2019 PlayStation 4, Microsoft Windows Director / Producer/ Writer ===Canceled games=== Title Year canceled Platform Role Virtua Fighter 3 - Saturn Director Propeller Arena 2001 Dreamcast Producer Pure Breed – – Concept Psy-Phi 2005 Sega Lindbergh Director / Producer Shenmue Online 2007 PC Director On top of games, Yu Suzuki lead the creation of a technical demo \"Tower of Babel\" prepared for the Dreamcast showcase at Tokyo New Otani Hotel on May 1st 1998. ==Hardware developed== *Sega Space Harrier (1985) *Sega Model 1 (1992) *Sega Model 2 (1993) *Sega Model 3 (1996) *Dreamcast (1998) *Sega NAOMI (1998) ==References== Category:Japanese video game designers Category:Sega people Category:1958 births Category:Living people Category:People from Iwate Prefecture",
 "title": "Yu Suzuki"
}