{
 "id": "67649",
 "text": "Randall Hank Williams (born May 26, 1949) is an American musician and songwriter. He is the son of country music legend Hank Williams. His nickname is \"Bocephus\", given to him by his father. He has a half-sister, named Jett Williams. From his boyhood, Hank Jr., performed his father's music publicly, because many people were still interested in it, and Hank Sr.'s career was cut short by alcohol and drug abuse. Young Williams wanted to perform music of his own, and to have his own musical career apart from his father's, but it was hard to \"get out from his father's shadow\", and be recognized for his own talents. In time, Williams met musicians who liked him for his own ideas, and helped him to develop his own kind of music. He was able to become an original writer and performer, while still being proud to be Hank Sr.'s son. Some of his father's fans were sad that he wanted to do this, but others understood. He also gained new fans, performing his new music. Some of Williams's songs are \"Eleven Roses\", \"Family Tradition\", \"Whiskey Bent and Hell Bound\", \"All My Rowdy Friends\", and \"A Country Boy Can Survive\". Even though he had hit records and many fans, it took years for people in country music to accept him and his chosen style. Williams lost out on many awards he could have earned. Finally in the 1980s, he began to win awards as a country performer. In the 1990s, Williams recorded a duet with his father, by using an old recording, and the two appeared together in a music video through electronic editing. In 2005, Williams donated $125,000 to relief efforts in Mississippi, after Hurricane Katrina. ==Discography== ;Singles *\"Long Gone Lonesome Blues\" (1964) *\"All My Rowdy Friends Are Coming Over Tonight\" (1984) *\"The Party's On\" (2016) ;Studio albums *Your Cheatin' Heart (1964) *Connie Francis and Hank Williams Jr. Sing Great Country Favorites (1964) *Ballads of the Hills and Plains (1965) *Blues My Name (1965) *A Time to Sing (1967) *Songs My Father Left Me (1969) *Luke the Drifter Jr. Vol. 2 (1969) *Live at Cobo Hall (1969) *Sunday Morning (1969) *After You, Pride's Not Hard to Swallow (1973) *One Night Stands (1977) *Hank Williams Jr. and Friends (1975) *The New South (1977) *Family Tradition (1979) *Whiskey Bent and Hell Bound (1979) *Habits Old and New (1980) *Rowdy (1981) *The Pressure Is On (1981) *High Notes (1982) *Strong Stuff (1983) *Man of Steel (1983) *Major Moves (1984) *Five-O (1985) *Montana Cafe (1986) *Hank Live (1987) *Born to Boogie (1987) *Wild Streak (1988) *Lone Wolf (1990) *Pure Hank (1991) *Maverick (1992) *Out of Left Field (1993) *Hog Wild (1995) *A.K.A. Wham Bam Sam (1996) *Three Hanks: Men with Broken Hearts (1996) *Stormy (1999) *The Almeria Club Recordings (2002) *I'm One of You (2003) *127 Rose Avenue (2009) *Old School New Rules (2012) * It's About Time (2016) ==References== Category:1949 births Category:Living people Category:American songwriters Category:American guitarists Category:Country musicians Category:Singers from Louisiana Category:Musicians from Louisiana",
 "title": "Hank Williams Jr."
}