{
 "id": "676591",
 "text": "Asaf Jah VI Mir Mahboob Ali Khan Siddiqi (18 August 1866 – 29 August 1911) was the 6th Nizam of Kingdom of Hyderabad. He ruled Hyderabad from 1869 to 1911. ==Early life== Mir Mahbub Ali Khan was born on 18 August 1866 at Purani Haveli in Hyderabad. He was the only surviving son of Afzal-ud-Daula, Asaf Jah V. When his father died he was two years and seven months old, and thus became the sixth Nizam of the Asaf Jahi dynasty in 1869. ==Developments in his kingdom== ===Development of a railway network=== The Nizam's Guaranteed State Railway was established in 1879, a railway company owned by the Nizams. After independence, it was integrated into Indian Railways. The introduction of railways by Nizam's also marked the beginning of industry in Hyderabad, due to which, four factories were built to the south and east of the Hussain Sagar lake. ==Personal Traits== ===Mystical powers=== It was supposed that he possessed a spiritual healing power against snake bites. It was his order that if anyone from the public had a snake bite, they could approach him. As a result, he was also awakened from his sleep a number of times! ===Other Talents=== The Nizam was also fluent in Urdu, Telugu and Farsi languages. He also wrote poems in Telugu and Urdu, some of which are inscribed alongside the walls of Tank Bund. He was also a talented hunter, having killed at least 30 tigers during his lifetime and was titled the very well-known term \"Tees Maar Khan\". ===Death=== The Nizam died on 29th August, 1911 at the age of 45. He was buried alongside his ancestors at Mecca Masjid, Hyderabad. His second son Osman Ali Khan, Asaf Jah VII succeeded him. ==Related pages== * Osman Ali Khan, Asaf Jah VII ==References== ==Other websites== *Picturing the ‘Beloved’ *Man of many talents *Nizam Prince Raunaq Yar Khan Exclusive Interview Category:Nizams of Hyderabad Category:Indian monarchs Category:1866 births Category:1911 deaths Category:19th century in India Category:1910s in Asia",
 "title": "Mahbub Ali Khan, Asaf Jah VI"
}