{
 "id": "676831",
 "text": "The Spingarn Medal is awarded annually by the National Association for the Advancement of Colored People (NAACP) for outstanding achievement by an African American. The award was created in 1914 by Joel Elias Spingarn, chairman of the Board of Directors of the NAACP. It was first awarded to biologist Ernest E. Just in 1915. The gold medal is valued at $100, and Spingarn left $20,000 in his will for the NAACP to continue giving it indefinitely. ==List of award winners== Year Picture Name Rationale 1915 \"Head of Physiology, Howard University Medical School for research in biology.\" 1916 \"Services in organizing the Liberian Constabulary and roads in the Republic of Liberia.\" 1917 \"Excellence in the field of creative music.\" 1918 \"Distinguished achievements in literature.\" 1919 \"U.S. Consul in Santo Domingo; President of American Negro Academy; for seventy years of distinguished service to his race and country.\" 1920 \"Author, Editor Crisis Magazine; founding and calling of Pan-African Congress.\" 1921 \"Notable performance in the title role of The Emperor Jones and for excellence as an actor.\" 1922 \"Former President of the National Association of Colored Women and for continued service to women of color.\" 1923 \"Head of Department of Research and Director of the Experiment Station of Tuskegee Inst. For researching Agricultural Chemistry.\" 1924 \"Singer; for artistry through interpreting Negro folk song; soloist with the Boston Symphony Orchestra.\" 1925 \"Former U.S. Consul in Venezuela and Nicaragua; former editor and secretary of NAACP.\" 1926 \"Historian and Founder of the Association for the Study of Negro Life and History; editor, Negro Orators and Their Orations for his outstanding work as an historian.\" 1927 \"President of Victory Life Insurance Company, the first black company certified by the state of New York.\" 1928 \"Author; for his pioneer work as a literary artist, depicting the life and struggle of Americans of Negro descent.\" 1929 \"President of Howard University. For distinguished leadership as first black president.\" 1930 \"Principal of the Fort Valley High and Industrial School, Fort Valley, GA. For twenty-five years of service in the education of black students.\" 1931 \"For his fine and reverent characterization of the Lord in Marc Connelly's Play – The Green Pastures.\" 1932 \"Principal of the Tuskegee Institute. For excellent leadership and service in the field of education.\" 1933 \"American Y.M.C.A. Secretary; missionary of intelligence, tact and self-sacrifice. For the excellence of his work in Africa.\" 1934 \"Dean of Tuskegee Institute, long service as field agent of the Slater and Jeanes Funds and the General Education Board.\" 1935 \"Founder and President of Bethune Cookman College. For outstanding leadership and service to education.\" 1936 \"President of Atlanta University; distinguished leader of his race.\" 1937 \"Executive Secretary of NAACP. For his personal investigation of more than forty-one lynchings.\" 1938 No award given No award given No award given 1939 \"Chosen for her special achievement in music.\" 1940 \"Surgeon; chosen for his contribution to the healing of mankind and for his courageous position in the face of bitter attack.\" 1941 \"Author; Uncle Tom's Children and Native Son. For his outstanding contributions to literature.\" 1942 \"International President of the Brotherhood of Sleeping Car Porters. For his role in securing the presidential order to establish the FEPC in 1941.\" 1943 \"Jurist and Educator; chosen for his distinguished career as a jurist and uncompromising champion of equal justice.\" 1944 \"Scientist; chosen for his outstanding work in blood plasma; research led to establishment of blood plasma bank.\" 1945 \"Singer and Actor chosen for distinguished achievement in the theatre and concert stage.\" 1946 \"Special Counsel for NAACP. For distinguished service as a lawyer before the U.S. Supreme Court.\" 1947 \"Research Chemist chosen for many important discoveries that have saved many lives.\" 1948 \"In recognition of his consistent role as a defender of fundamental American liberties.\" 1949 \"International civil servant; acting UN mediator in Palestine. For singular service to the United Nations.\" 1950 \"Chairman, NAACP Legal Committee and stalwart defender of democracy.\" 1951 \"Leader of the National Association of Colored Graduate Nurses.\" 1952 \"NAACP leader in the state of Florida and a martyr in the crusade for freedom.\" 1953 \"Distinguished architect, for his pioneer contributions as a creative designer of livable, attractive modern dwellings.\" 1954 \"Physician, educator and philanthropist. For pioneering achievements in dermatology.\" 1955 \"Dedicated editor, publisher and farsighted civic leader.\" 1956 \"Brilliant and versatile athlete; for superb sportsmanship and for his singular role in athletics.\" 1957 \"Dedicated and selfless clergyman; for leadership role in the Montgomery bus protest movement.\" 1958 \"For their pioneer role in upholding the basic ideals of American democracy in the face of continuing harassment and constant threats of bodily injury.\" 1959 \"Composer and orchestra leader. For outstanding and unique musical achievements.\" 1960 \"Poet, author and playwright.\" 1961 \"Professor of Psychology at the College of the City of New York; founder/director of the Northside Center for Child Development. For his dedicated service and inspired research in the field of psychology.\" 1962 \"Administrator, Housing and Home Finance Agency; for his long years of dedicated public service at municipal, state and federal levels.\" 1963 \"NAACP field secretary for the state of Mississippi. For his dedication and steadfast courage in the face of continued death threats.\" 1964 \"Executive Director, NAACP. For his leadership, integrity and his dedicated service.\" 1965 \"Metropolitan Opera star, in recognition of her divinely inspired talent.\" 1966 \"Founder/President of the Johnson Publishing Company of Chicago.\" 1967 \"First African American to win popular election to the United States Senate since Reconstruction.\" 1968 \"Broadway/Hollywood star and civil rights activist.\" 1969 \"Director, Washington Bureau, NAACP and civil rights lobbyist. For his pivotal role in the enactment of civil rights legislation.\" 1970 \"Artist, teacher and humanitarian.\" 1971 \"Clergyman, activist and prophet.\" 1972 \"In recognition of his unique creativity, as exemplified by his outstanding achievements as photographer, writer, film maker and composer.\" 1973 \"Educator, in recognition of the stature he has attained as a national leader in the field of education.\" 1974 \"Jurist; in tribute to his steadfast defense of constitutional principles.\" 1975 No award given No award given No award given 1976 \"Athlete, in recognition of his singular achievement in the sport which symbolizes America – baseball; his impressive home run record.\" 1977 \"Innovative dancer, choreographer and artistic director.\" \"Author, biographer and lecturer; exhaustive research and literary skill combined in Roots.\" 1978 No award given No award given No award given 1979 \"Minister plenipotentiary and extraordinary United States Ambassador to the United Nations.\" \"In recognition to the quiet courage and determination exemplified when she refused to surrender her seat on a Montgomery, Alabama bus.\" 1980 \"Educator, historian, author for his prodigious efforts to set before the world the black American's continuing struggle against oppression.\" 1981 \"Mayor, City of Detroit; public servant, labor leader.\" 1982 \"Educator, theologian and humanitarian.\" 1983 \"Artist humanitarian and living symbol of excellence.\" 1984 No award given No award given No award given 1985 \"Government executive, public servant, humanist; Chief Executive of Calvert, Texas.\" \"Humorist, artist, educator, family man and humanitarian.\" 1986 \"Executive Director, NAACP. In tribute to his precedent-setting accomplishments.\" 1987 \"Public servant, businessman, community leader.\" 1988 \"Educator, doctor of veterinary medicine, visionary and humanitarian.\" 1989 \"Clergyman, political leader, civil rights activist; first American of African descent to become a major presidential candidate.\" 1990 \"Governor, public servant, attorney and visionary in tribute to an extraordinary life of accomplishment.\" 1991 \"General of the U.S. Army, 12th Chairman, Joint Chiefs of Staff, U.S. Department of Defense.\" 1992 \"Lawyer, educator, political leader and stateswoman.\" 1993 \"National Council of Negro Women; National YWCA; The Center for Radical Justice; President, Delta Sigma Theta Sorority. For extraordinary leadership in advancing women’s rights.\" 1994 \"Poet, author, actress, playwright, producer, educator and historian.\" 1995 \"Historian, scholar and educator; in recognition of an unrelenting quest for truth and the enlightenment of Western Civilization.\" 1996 \"Jurist, Scholar, teacher and humanitarian; in honor of a distinguished jurist who emerged a giant of jurisprudence during a three-decade tenure as the nation’s longest serving active Federal Judge.\" 1997 \"Journalist, publicist, civic leader and public servant.\" 1998 \"Civil rights activist, risk-taker, mother, true believer.\" 1999 \"Founder, Black Enterprise Magazine; Businessman, publisher, educator, advocate, entrepreneur, family man.\" 2000 \"Actress, producer, educator, publisher and humanitarian.\" 2001 \"Lawyer, Advisor to Presidents, Champion of Civil Rights and Human Rights, Exemplar and True Believer.\" 2002 \"Public servant, protector of civil and human rights, community leader and inspirer of youth.\" 2003 \"Civil rights pioneer, jurist, public official, for her commitment and pursuit of the goal of equal opportunity and justice for all Americans.\" 2004 \"Attorney, educator, federal judge and guardian of civil rights; for his extraordinary achievement of winning twenty-one cases argued before the Supreme Court.\" 2005 \"For his key role in the United States Supreme Court Case, Brown v. Board; for his determined, quiet and persistent pursuit of justice.\" 2006 \"In tribute to a lifetime of growth and singular achievement, from the bottom of his fifth grade class, to become the youngest ever Chief of Pediatric Neurosurgery in the United States.\" 2007 \"Guardian of Civil Rights and Civil Liberties, consummate legislator and public servant.\" 2008 \"Actress, poet, playwright and civil rights activist\" 2009 \"Former Chairman of the NAACP Board of Directors and legendary civil rights activist\" 2010 \"Actress and civil rights activist\" 2011 \"Attorney and civil rights activist.\" 2012 \"Singer, song writer, actor and social activist.\" 2013 \"Opera singer, Grammy Award winner.\" 2014 \"Composer, Producer, Grammy Award winner.\" 2015 \"Actor and Social activist, Oscar Winner.\" 2016 \"Lawyer, Jurist, Academic and Public Servant\" ==References== ;General references * ** Category:1915 establishments in the United States Category:American awards",
 "title": "Spingarn Medal"
}