{
 "id": "6774",
 "text": "is a Japanese city in Kanagawa Prefecture on the island of Honshū.Nussbaum, Louis-Frédéric. (2005). \"Yokohama\" in Japan Encyclopedia, pp. 1054-1055. Yokohama is the capital of Kanagawa Prefecture in the Kantō region. Yokohama is a neighbor city of Tokyo. It has been the second largest city of Japan since the 1980s. Yokohama has an international trade seaport. It is the largest port in Japan. Many cars and machinery are exported from the port. The downtown area is around the port. Today, the area of Yokohama city includes its former suburb areas like Hodogaya or Totsuka. In Minato Mirai, there are a lot of places for sightseeing. For example, there are amusement parks and shopping malls. Yokohama was an entrance for foreign cultures for a long time. Still today Yokohama has the largest Chinatown in Japan. The airports nearest to Yokohama are Tokyo International Airport and Narita International Airport. Many educational institutes are located in Yokohama, including Yokohama National University and Yokohama City University. ==History== The Yokohama port was created in the middle of the 19th century for foreigners. It was five ports opened to foreign countries who demanded that Japan open its ports. And Yokohama was the nearest port to Tokyo, which was then called Edo. In the Edo period, Hodogaya-juku was one of the fifty-three shogunate-maintained waystations (shuku-eki) along the Tōkaidō road which connected Edo and Kyoto. Two other Tōkaidō rest stops are within the boundaries of modern Yokohama—in Kanagawa ward and Totsuka ward.Nussbaum, \"Tōkaidō\" at p. 973. == Wards of Yokohama == * Aoba-ku, Yokohama * Asahi-ku, Yokohama * Hodogaya-ku, Yokohama * Isogo-ku, Yokohama * Izumi-ku, Yokohama * Kanagawa-ku, Yokohama * Kanazawa-ku, Yokohama * Kouhoku-ku, Yokohama * Kounan-ku, Yokohama * Midori-ku, Yokohama * Minami-ku, Yokohama * Naka-ku, Yokohama * Nishi-ku, Yokohama * Sakae-ku, Yokohama * Seya-ku, Yokohama * Totsuka-ku, Yokohama * Tsurumi-ku, Yokohama * Tsuzuki-ku, Yokohama ==Related pages== * List of the 53 Stations of the Tōkaidō * The Fifty-three Stations of the Tōkaidō * Yokohama F. Marinos ==References== ==Other websites== * City of Yokohama website * Kanagawa Prefecture Tourism website * Category:19th-century establishments in Japan",
 "title": "Yokohama"
}