{
 "id": "677990",
 "text": "Ezra Klein (born May 9, 1984) is an American journalist, blogger, and political commentator who works as editor-at-large of Vox. He was a blogger and columnist for The Washington Post and an associate editor of The American Prospect. He has contributed to Bloomberg News and MSNBC. At The Washington Post, he managed a branded blog called \"Wonkblog.\" The blog was mostly about health care and budget policy. He wrote a primer on policy called \"Wonkbook\", which was delivered by e-mail and on his blog each morning. In January 2014, Klein left The Washington Post. He works for Vox Media as editor-at-large for their news website, Vox. He co-founded the website along with Melissa Bell and Matthew Yglesias. ==Early life and education== Klein was born and raised in Irvine, California. Klein is a middle child, in a Jewish family. His father, Abel Klein, is a mathematics professor at University of California, Irvine. Abel Klein is from Brazil. His mother is an artist. Klein went to school at University High School. He went to the University of California, Santa Cruz, but transferred to the University of California, Los Angeles. He graduated from UCLA in 2005 with a B.A. in political science. ==Career== In 2003, Klein and Markos Moulitsas were two of the earliest bloggers to report from a political convention, that of the California State Democratic Party. Klein worked on Howard Dean's primary campaign in Vermont in 2003, and interned for the Washington Monthly in Washington, D.C. in 2004. On December 10, 2007, Klein moved his blog full-time to the American Prospect. Steve Pearlstein, The Washington Post''s veteran business columnist, read and liked Klein's blogging. Pearlstein sent some of Klein's writing to managing editor Raju Narisetti. Narisetti hired Klein to be the Post’s first blogger on politics and economics. On May 18, 2009, he began writing at the newspaper. In May 2011 when Bloomberg View started, Klein became a columnist there at he same time as at The Washington Post and MSNBC. Klein wrote for and edited Wonkblog at The Washington Post. He often talks about politics on MSNBC's The Rachel Maddow Show, Hardball with Chris Matthews, and The Last Word with Lawrence O'Donnell. He contributed to Countdown with Keith Olbermann. In October 2015, Klein started a podcast called The Weeds with Sarah Kliff and Matt Yglesias. This Vox podcast is detailed discussions about public policy. Klein also hosts the podcast called \"The Ezra Klein Show\". Klein is an executive producer of Vox's Netflix series Explained. == Awards == * 2010, The Week magazine and The Sidney Hillman Foundation called him Blogger of the Year. * 2011, GQ magazine called him one of the 50 most powerful people in Washington, D.C.. Time magazine called his blog one of the 25 best financial blogs in 2011. * 2013, Klein won the Online News Association Award for Best Online Commentary. He also won the American Political Science Association's Carey McWilliams Award, for \"a major journalistic contribution to our understanding of politics.\" == Personal life == Klein is married to Annie Lowrey. She reports on economic policy at The Atlantic magazine. ==References== ==Other websites== * * Ezra Klein's blog at Washingtonpost.com * The American Prospect Ezra Klein page and writings * Ezra Klein's old blog at The American Prospect magazine * Ezra Klein's articles and essays published in various media * Video conversations and debates involving Ezra Klein on Bloggingheads.tv * Category:1984 births Category:Living people Category:American agnostics Category:American political commentators Category:American political writers Category:Jewish American writers Category:Journalists from California Category:People from Irvine, California Category:Writers from California Category:American bloggers",
 "title": "Ezra Klein"
}