{
 "id": "678137",
 "text": "A Wadati–Benioff zone is an area within the Earth's crust where earthquakes frequently occur. The frequency of earthquakes in these areas is due to the convergence and subduction of tectonic plates. According to the theory of plate tectonics lithospheric plates move towards each other along convergent plate boundaries. When two plates collide, one is often submerged below the other. They are referred as downgoing and overriding plates respectively. When a downgoing plate (usually composed of oceanic lithosphere) submerges beneath an overriding plate shallow earthquakes occur at the plate boundary and deeper earthquakes occur in the downgoing plate as it sinks into the Earth. The deep earthquakes caused by the downgoing plate form the Wadati–Benioff zone. The deepest recorded earthquakes come from Wadati–Benioff zones and can extend to depths as much as 650 km (400 mi) deep.Sverdrup, Keith A., and Raphael Kudela. Investigating Oceanography. McGraw-Hill Education, 2020. == Discovery == In 1935 Kiyoo Wadati published research on earthquakes with deep foci and how they are apt to take place near the edges of continents.Frohlich, C. (1987). Kiyoo Wadati and early research on deep focus earthquakes: Introduction to Special Section on Deep and Intermediate Focus Earthquakes. Journal of Geophysical Research: Solid Earth, 92(B13), 13777-13788. doi:10.1029/jb092ib13p13777 Further analysis of earthquake foci and location was conducted by Hugo Benioff in 1945 where he developed a way to identify the boundary at which an earthquake was generated.Benioff, Hugo (1949). \"Seismic evidence for the fault origin of oceanic deeps\". Bulletin of the Geological Society of America. Geological Society of America. 60: 1837–1866. The dipping zone of seismic activity that they helped discover was named in their honor. == References == === Other websites === * https://earthquake.usgs.gov/learn/glossary/?term=Benioff%20zone * https://www.e-education.psu.edu/earth520/node/1774 Category:Plate tectonics Category:Earthquakes",
 "title": "Wadati–Benioff zone"
}