{
 "id": "678147",
 "text": "A missing person is a person who has disappeared and nobody seems to know where they are. People can go missing for many reasons. == Reasons == People disappear for many reasons. These are some reasons why someone may go missing by choice: * Running away from home, often to escape from domestic abuse. * Mental illness or other ailments. For example, a person with Alzheimer's Disease may wander out on their own, forgetting where they live, who their friends and family are, or even their own names. * Hiding from the police or courts (known as failure to appear). * Suicide in a location where they cannot be easily found. * Joining a cult or other religious organization that stops them from talking to people in the outside world. * To escape poverty, famine or natural disaster. * To avoid war or persecution during a genocide. There are also reasons why someone may go missing without wanting to: * Staying too long with a parent or guardian that they do not normally live with. **Kidnapping * Death by natural causes or an accident in a place where they cannot easily be found, such as in water. * Getting sold into slavery. * Murder, if the body is not found. * In some countries, governments have carried out secret murders (known as forced disappearances). Normally it is the police who search for a missing person. If someone goes missing at sea, they may instead call on the coast guard or a similar agency. Most missing person cases that are reported to the police are simple cases, where the person is found quickly. In 1999, 800,000 children went missing in the United States, but only 115 cases were kidnapped by a stranger who wanted to keep them for a long period of time. A small number of missing person cases are not solved for many years. These cases can be painful for friends and families, because they cannot be sure what happened to the person. In most countries, the law says that if someone has been missing for many years, the government can declare that the person is dead. This is known as \"declaring death in absentia\". Sometimes there are cases of persons missing for no known reason: *In 1953 a student at Miami University oxford Ohio Ronald Tammen disappeared from the Campus.A Good Man Is Hard to Find_My Search for Ronald H.Hammen Jr Blog In 1958 a unknown \"John Doe\" was found in Walker County, Georgia; a 2003 DNA test showed no connection between the two cases.A Good Man Is Hard to Find_My Search for Ronald H.Hammen Jr Blog A dead body in Georgia ==References== ==Other websites== *lostnmissing.com *National Missing and Unidentified Persons System (NamUs.gov) * Familylinks.icrc.org Website for people looking for family members missing due to a conflict or natural disaster. International Committee of the Red Cross. *Missing Children wiki",
 "title": "Missing person"
}