{
 "id": "678205",
 "text": "Hà Tiên is a city of Kiên Giang Province, Vietnam. It located in Mekong Delta in southern Vietnam. It borders Cambodia to the west. From a very early period, a settlement and a port seem to have existed in this area. Banteay Meas Port located in this area. At that time, it is a part of the Kingdom of Funan.G. E. Gerini, “Notes on the Early Geography of Indo-China”, Journal of the Royal Asiatic Society of Great Britain & Ireland, 1897, p. 557; review of G. E. Gerini, Researches in Ptolemy's Geography of Eastern Asia (Further India and Indo-Malay Archipelago) (London, Royal Asiatic Society, 1909), in The Geographical Journal, vol. 37, no.1, January 1911, p. 82; Nicholas Sellers, The Princes of Hà-Tiên (1682-1867): the Last of the Philosopher-Princes and the Prelude to the French Conquest of Indochina: a Study of the Independent Rule of the Mac Dynasty in the Principality of Hà-Tiên, and the Establishment of the Empire of Vietnam, Brussels, Thanh-long, 1983, p. 9. Hà Tiên is built by Chinese adventurer Mo Jiu (Mạc Cửu). Cambodian king appoints him the governor of Peam Province, and send him here. Hà Tiên is built as the capital of the province. In Khmer, Hà Tiên is called \"Peam\" (ពាម, lit. \"river mouth\"). Thai people call it \"Phutthaimat\" (พุทไธมาศ) or \"Banthaimat\" (บันทายมาศ).Nicholas Sellers, The Princes of Hà-Tiên (1682-1867): the Last of the Philosopher-Princes and the Prelude to the French Conquest of Indochina: a Study of the Independent Rule of the Mac Dynasty in the Principality of Hà- Tiên, and the Establishment of the Empire of Vietnam, Brussels, Thanh-long, 1983, p. 164. Some foreigners call it \"Cancao\". Later, Mo Jiu surrender to Vietnamese, Peam Province become Hà Tiên Province of Vietnam.Nicholas Sellers, The Princes of Hà-Tiên (1682-1867): the Last of the Philosopher-Princes and the Prelude to the French Conquest of Indochina: a Study of the Independent Rule of the Mac Dynasty in the Principality of Hà-Tiên, and the Establishment of the Empire of Vietnam, Brussels, Thanh-long, 1983, p. 24. Hà Tiên is a popular tourist site of the region, because it has beautiful beaches and landscapes. ==References== Category:Cities in Vietnam",
 "title": "Hà Tiên"
}