{
 "id": "678937",
 "text": "{{Infobox NFL game | type = sb | name = LIII | full_name = | image = | caption = | visitor = New England Patriots | visitor_abbr = NE | visitor_conf = AFC | visitor_coach = Bill Belichick | visitor_record = 11–5 | visitor_place = 2 | home = Los Angeles Rams | home_abbr = LAR | home_conf = NFC | home_coach = Sean McVay | home_record = 13–3 | home_place = 2 | visitor_qtr1 = 0 | visitor_qtr2 = 3 | visitor_qtr3 = 0 | visitor_qtr4 = 10 | home_qtr1 = 0 | home_qtr2 = 0 | home_qtr3 = 3 | home_qtr4 = 0 | date = February 3, 2019 | stadium = Mercedes-Benz Stadium | city = Atlanta, Georgia | attendance = 70,081 | odds = Patriots by 2.5 | MVP = Julian Edelman, wide-receiver | anthem = Gladys Knight | coin_toss = Bernice King | referee = John Parry | HOFers = | halftime = Maroon 5, Travis Scott, Big Boi | network = CBS | announcers = Jim Nantz (play-by-play) Tony Romo (analyst) Tracy Wolfson and Evan Washburn (sideline reporters) | rating = 41.1 98.2 million people watching in the U.S. | share = | commercial = $5.25 million | radio = Westwood One ESPN Deportes Radio (Spanish language) | radioannouncers = Kevin Harlan (play-by-play) Kurt Warner and Mike Holmgren (analysts) Ed Werder and Tony Boselli (sideline reporters) Kenneth Garay (play-by-play- ESPN Deportes Radio) Sebastian Martínez Christensen (analyst- ESPN Deportes Radio) | last = LII | next = LIV }} Super Bowl LIII (meaning Super Bowl 53 in Roman numerals) was an American football game in which the New England Patriots, who were the winners of the American Football Conference (AFC) in the 2018 season, beat the Los Angeles Rams, winners of the National Football Conference (NFC) in the 2018 season, 13-3 to become winners of the National Football League (NFL) for the 2018 season. It was the 6th time the New England Patriots won a Super Bowl. It was also the 11th time the New England Patriots had been in a Super Bowl and the 4th time the Los Angeles Rams had been in a Super Bowl. It is was played at the Mercedes-Benz Stadium in Atlanta, Georgia on February 3, 2019. The game had the lowest score of any Super Bowl in history, with 16 points scored by both teams. It also had the lowest amount of people watching it on television for a Super Bowl for 10 years, with 98.2 million people watching it in the United States. The same teams played in this Super Bowl as the Super Bowl XXXVI, when the New England Patriots also won. ==Starting teams== New England Patriots Position Position Los Angeles Rams Offense Chris Hogan WR Brandin Cooks Trent Brown LT Andrew Whitworth Joe Thuney LG Rodger Saffold David Andrews C John Sullivan Shaq Mason RG Austin Blythe Marcus Cannon RT Rob Havenstein Rob Gronkowski TE Tyler Higbee Julian Edelman WR Robert Woods Tom Brady QB Jared Goff Sony Michel RB Todd Gurley James Develin FB WR Josh Reynolds Defense Trey Flowers DE Michael Brockers Lawrence Guy DT NT Ndamukong Suh Malcom Brown DT Deatrich Wise Jr. DE WLB Kyle Van Noy LB ILB Mark Barron Dont'a Hightower LB ILB Cory Littleton Stephon Gilmore CB OLB Jason McCourty CB Jonathan Jones CB Patrick Chung S Devin McCourty S ==References== *053 Category:New England Patriots Category:Los Angeles Rams Category:2019 in American sports Category:2010s in Georgia (U.S. state) Category:February 2019 events",
 "title": "Super Bowl LIII"
}