{
 "id": "678956",
 "text": "\"Kangding Qingge\" () simply means \"Kangding Love Song\". The song is a folk song of a town named Kangding in Sichuan Province. The song is one of the most popular songs across the Sinosphere. == History == In 1946, Wu Wen-ji studied vocal music in Sikang Province in China. At the same time, he composed a song named Paomao Liuliude Shanshang. This means \"Running Horse Mountain\" in English. He also composed other local folk songs. When he was teaching at a Kuomintang military academy, he renamed the song as Kangding Love Song. He renamed it after the capital of the Sikang Province. He also changed some of the lyrics. The song then spread to the rest of China. This is due to the song being sung by a popular Soprano named Yu Yixuan. Since then, the song has been performed by many famous artists around the world. They includes Placido Domingo, Timi Zhuo , and A-mei. == Lyrics == Lyrics in Simplified Chinese: Lyrics in Traditional Chinese: Lyrics in Mandarin Pinyin: Simple English translation: Chords 跑马溜溜的山上，一朵溜溜的云哟。 端端溜溜的照在，康定溜溜的城哟。 月亮弯弯，康定溜溜的城哟！ 李家溜溜的大姐，人才溜溜的好哟。 张家溜溜的大哥，看上溜溜的她哟。 月亮弯弯，看上溜溜的她哟！ 一来溜溜的看上，人才溜溜的好哟。 二来溜溜的看上，会当溜溜的家哟。 月亮弯弯，会当溜溜的家哟！ 世间溜溜的女子，任我溜溜的爱哟。 世间溜溜的男子，任你溜溜的求哟。 月亮弯弯，任你溜溜的求哟！ 跑馬溜溜的山上、一朵溜溜的雲喲。 端端溜溜的照在、康定溜溜的城喲。 月亮彎彎、康定溜溜的城喲！ 李家溜溜的大姐、人才溜溜的好喲。 張家溜溜的大哥、看上溜溜的她喲。 月亮彎彎、看上溜溜的她喲！ 一來溜溜的看上、人才溜溜的好喲。 二來溜溜的看上、會當溜溜的家喲。 月亮彎彎、會當溜溜的家喲！ 世間溜溜的女子、任我溜溜的愛喲。 世間溜溜的男子、任你溜溜的求喲。 月亮彎彎、任你溜溜的求喲！ Pǎomǎ liūliūde shānshàng, yīduǒ liūliūde yún yō. Duānduān liūliūde zhàozài, Kāngdìng liūliūde chéng yō. Yuèliang wān wān, Kāngdìng liūliūde chéng yō! Lǐjiā liūliūde dàjiě, réncái liūliūde hǎo yō. Zhāngjiā liūliūde dàgē, kànshàng liūliūde tā yō. Yuèliang wān wān, kànshàng liūliūde tā yō! Yīlái liūliūde kànshàng, réncái liūliūde hǎo yō. Èrlái liūliūde kànshàng, huìdàng liūliūde jiā yō. Yuèliang wān wān, huìdàng liūliūde jiā yō! Shìjiān liūliūde nǚzǐ, rènwǒ liūliūde ài yō. Shìjiān liūliūde nánzǐ, rènnǐ liūliūde qiú yō. Yuèliang wān wān, rènnǐ liūliūde qiú yō! High upon the mountain side, there's a cloud so white in the sky. There is the kangding town. The town is covered in silver moonlight. Moonlight shines bright, over kangding town. There's a maid with a sweet smile. She is Li the woodcutter's daughter. Zhang, Blacksmith's eldest son, came to court her in moonlight. Moonlight shines bright, a courtship in moonlight. First, he has fallen in love with her. She has good skills and beautiful. Second, he has fallen in love because she can take care of the family. The crescent moon, can take care of the family! Lovely maidens of the world, I cannot but love you. Males of the world, they cannot but court you. Moonlight shines bright, they cannot but court you. Each verse: Dm Cm Dm Dm Cm Gm Am Dm Gm Am Dm Gm Am Dm == In popular culture == * The song was sung in an episode of the T.V. series Daredevil. It was featured in Season 01 Episode 05 . The title of the episode is \"World On Fire\". * .The soundtrack of the 2003 video game, Command and Conquer: Generals has a song named \"Runaway Train\". It contains part of this song * This song is also used in a soundtrack of Dynasty Warriors 4. It is a video game by Koei. * The song \"Fuji I (Global Dub)\" of the album Akron/Family II: The Cosmic Birth and Journey of Shinju TNT includes a remix version of this song. It was created by Akron/Family. *Sammo Hung sings a portion of the song in the movie \"Dragons Forever\" == References == Category:Sichuan Category:Chinese music",
 "title": "Kangding Qingge"
}