{
 "id": "67904",
 "text": "A crane is a type of tall wading birds from the family Gruidae (order Gruiformes). There are 15 species in 4 genera. The tallest is the sarus crane, Grus antigone, which can grow to a height of up to 1.8 m (5.9 ft),Wood T.C. & Krajewsky C. 1996. Mitochondrial DNA sequence variation among the subspecies of sarus crane (Grus antigone) (PDF). The Auk 113 (3): 655–663. Cranes look a lot like herons but they are usually larger, and have a partly naked head, and a more heavy bill. When they are flying, their long neck is stretched out in front, and the legs trail out behind. The earliest fossils of cranes were discovered in North America. Living forms are living everywhere all over the world except in Antarctica and South America. Many populations are endangered by hunting and habitat destruction. == Description == Cranes are tall birds with long legs. Cranes are large birds, the world's tallest flying birds. They range in size from the demoiselle crane, which is 90 cm (35 in) in length, to the sarus crane, which may be up to 176 cm (69 in). The heaviest is the red- crowned crane, which can weigh 12 kg (26 lb) before migrating. They are usually brown, white, or gray in color. There are over 15 kinds of species of cranes. They look rather like herons. The whooping crane (Grus americana) is the tallest American bird. Adults stand 5 feet tall and have a wingspan of up to 7 feet. == Life == Cranes are omnivores. They eat many kinds of plants, reptiles, small mammals, and other birds. The average life time of a crane is from 20 to 25 years. Cranes are highly social birds that live in large flocks. Some species of cranes are thought as holy in Asia, especially in Japan. === Reproduction === Cranes usually build their nests in marshy areas and lay two eggs at a time. Cranes can make sounds that are heard from far away. Cranes dance special dances when they mate, and they include stepping quickly, high leaps, stretching, and bowing. Crane chicks grow very quickly and at two to four months, they develop their flight feathers. Cranes are very vocal. They use several different types of calls. They also communicate with their bodies. === Behaviour === All cranes are able to defend themselves quite well. They are mostly quite large, and peck, kick and batter opponents with their wings. They are territorial, and males will fight even more vigorously than usual at mating seasons. Zookeepers use acrylic riot shields to protect themselves against crane attacks.Exmoor Zoo uses riot shields against aggressive cranes BBC Nature 2012 . == Evolution == Cranes are an ancient type of wading bird. Their first definite fossils are in the Eocene epoch,Feduccia, Alan 1999. The origin and evolution of birds. 2nd ed, Columbia University Press, 244249. The rails (family Rallidae) are their nearest relatives in the order Gruiformes. Most of the other groups in the Gruiformes are flightless birds. These lived in forests, and left little or no fossil record. == Threatened == The biggest threats to cranes are hunting and habitat destruction. Cranes need large habitats. All cranes are protected by international agreement. == Related pages == *Grus *Black-necked crane *Common crane *Grey crowned crane *Red- crowned crane *Sandhill crane *Sarus crane *Siberian crane == References == == Other websites == * Saving Cranes website (ICF) * Craneworld website * Gruidae videos on the Internet Bird Collection * Origami crane",
 "title": "Crane (bird)"
}