{
 "id": "679183",
 "text": "Rocky Mount is a city in Edgecombe and Nash counties in the Atlantic coastal plain region of the U.S. state of North Carolina. The city's population was 54,341 at the 2020 census. Rocky Mount has received the All-America City Award from the National Civic League two times, in 1969 and 1999. ==History== ===Beginnings=== The region around the Tar River had several types of indigenous people for 12,000 years. It had been home to the historic Tuscarora people, who spoke an Iroquoian language, for a long time before the first Europeans arrived. After the English colonists and indigenous allies started the Tuscarora War in the early 1700s, they drove most of the survivors off to the North. The English speakers then began to settle the area. The Falls of the Tar River Primitive Baptist Church was established in 1757. The church was the center of community life, and its records were the first records of the developing town. It effectively ran the law enforcement for the town. ===19th century=== A post office was made at the falls of the Tar River on March 22, 1816. The name \"Rocky Mount\" starts appearing in documented history at this point. The name referred to the rocky mound at the falls of the Tar River. Rocky Mount Mills, the second cotton mill in the state of North Carolina, was built there soon after in 1818. Its proprietors were two entrepreneurs and Joel Battle, who was the grandson of an original colonist who lived in the area. Joel bought out the other proprietors before giving the mill to his cousin James Smith Battle. The mill's spindles were run by enslaved African Americans until the 1850s. At that time, the mill owners only hired white women and girls, who were employed for the rest of the century. The Battle family was also involved in building the longest continuous railroad in the world at the time, the Wilmington and Weldon Railroad, which ran about east of the mill. The railroad had a lot of influence on the development of the town. In 1871, the county line moved from the Tar River to its present location in the center of the tracks. The Raleigh-Tarboro stage route also passed just south of Rocky Mount. During the Civil War, the area was attacked in 1863 by Union troops under the command of Brigadier General Edward E. Potter. They destroyed the mill, which supplied the Confederates yarn and cloth. After the war ended, the owners rebuilt the mill. On February 19, 1867, the village outside the mill was incorporated as a town. In the second half of the 19th century, the tobacco industry became very important in the state. Rocky Mount could take advantage of the very quickly rising demand for brightleaf tobacco that grew best in sandy soil because it was next to the coastal plain. Tobacco also affected the city's social life. Warehouses where tobacco was stored and sold began hosting balls for the community in the 1880s. These became known as \"june germans\" for the time of year and style of dance. June Germans eventually became all-night dance parties and attracted musicians and socialites from miles around well into the 1900s. By the end of the 19th century, tobacco had replaced King Cotton as the town's main cash crop. ===20th century=== At the start of the 20th century, Rocky Mount became the northern headquarters of the Atlantic Coast Line Railroad, which had its major repair shops and yard facilities in the town. This caused a lot of railroad employees to come to the town. In 1900, Rocky Mount's population was around 3,000. On February 28, 1907, with a population around 7,500, Rocky Mount was officially incorporated as a city. A vibrant central business district arose. As in the rest of the South, states made racial segregation legal. This included discrimination in where people could live. White suburbs were mostly on the west side of town, such as Villa Place and West Haven. Black neighborhoods, such as Crosstown and Around the \"Y\", where jazz musician Thelonious Monk was born, were mostly on the east side of town. Several notable Civil Rights events occurred in Rocky Mount. In 1946, African-American tobacco warehouse workers voted to organize in Rocky Mount as part of a broader nationwide movement known as Operation Dixie. It included voter registration to fight against disenfranchisement of blacks and other actions against segregation. On November 27, 1962, Martin Luther King Jr. gave a speech at Booker T. Washington High School. He used his refrain \"I have a dream\" a year before his more famous speech at the March on Washington. The city had a sanitation workers' strike in 1978 when government sanitation workers protested their black co-worker being wrongfully arrested. He was acquitted in court on the charges. In 2018 the city council apologized to him for the case. After WWII, the city continued to grow. In the 1950s and 1960s, the city's economy started to include banking, manufacturing, pharmaceuticals, and the headquarters of a fast food chain known as Hardee's. New higher education buildings were made, including North Carolina Wesleyan College in 1956 and Nash Community College and Edgecombe Community College in 1968. In 1970, Rocky Mount received an All-America City Award. In the 1970s the city's hospitals were combined under Nash General Hospital. That was also the period of completion of Rocky Mount–Wilson Regional Airport. From the 1980s, the inner city suffered urban decay, as businesses had moved out to suburban highway locations. Rocky Mount's downtown got worse as new neighborhoods and shopping malls were built, such as Golden East Crossing. The city also expanded its borders by annexing nearby cities, such as Battleboro to the north.North Carolina General Assembly, Battleboro/Rocky Mount merger, House Bill 1177, 1995 Session, Retrieved Aug. 16, 2017. In 1999, the city won its second All-America City Award. In the fall of 1999 two hurricanes hit eastern North Carolina. Both passed over Rocky Mount. Hurricane Dennis hit the town as a tropical storm in August with of rain and Hurricane Floyd hit it in September with nearly of rain. During Hurricane Floyd, most of the flooding happened quickly overnight. Many people did not know about the flooding until the water came into their homes. A lot of people needed to be rescued. The hurricane caused the worst flooding in the history of the Tar River, which was already full of water from the hurricane in August. Many homes and businesses were destroyed. ===21st century=== At the start of the 21st century, the city has encouraged efforts to improve the historic downtown, supporting projects to renovate buildings such as the Rocky Mount station and Douglas Block, or repurpose them, such as the Imperial Centre for Arts and Sciences. In 2007, Capitol Broadcasting Company bought Rocky Mount Mills. It is adapting it as a mixed-use campus of breweries, restaurants, residential lofts, and event space. Major new community projects include the sports complex and downtown event center. In 2019, CSX, the successor company of the Atlantic Coast Line Railroad, developed a new intermodal cargo terminal that is expected to improve the local economy in the next decade. ==Geography== Rocky Mount is in northeastern North Carolina. It is at the fall line between the Atlantic Coastal Plain to the east and the Piedmont region to the west. The city is east of Raleigh, the state capital. It is northeast of Fayetteville, north of Wilmington, north of Wilson, south of Roanoke Rapids, and south of Richmond, Virginia. According to the United States Census Bureau, the city has a total area of . of that is land and is covered by water. The Tar River passes through the city from west to east, crossing the fall line at Upper Falls and Little Falls and going down in the city limits. The city is between Edgecombe and Nash counties. ===Neighborhoods=== ====Historic Rocky Mount Mills Village==== Next to the Tar River, the Rocky Mount Mills Village grew in the late 19th and early 20th centuries as a small community of tenants working for the mill. Built between 1885 and 1940, each home in the historic district is recognized by the National Register of Historic Places. Changes in industrialization eventually forced the mill to close. However, when the mill closed, the property remained intact. Though the property has been a rental for its entire existence, covenants are placed on the property to assure home ownership and owner occupancy and protect the historical integrity of the district. ===Climate=== Rocky Mount has a humid subtropical climate (Köppen Cfa) known for cool, sometimes kind of cold winters, and hot, humid summers. The average high temperatures range from in the winter to around in the summer. The average low temperatures range from in the winter to around in the summer. ==Demographics== ===2020 census=== Rocky Mount racial composition Race Number Percentage White (non-Hispanic) 14,470 26.63% Black or African American (non-Hispanic) 34,426 63.35% Native American 298 0.55% Asian 757 1.39% Pacific Islander 26 0.05% Other/Mixed 1,692 3.11% Hispanic or Latino 2,672 4.92% At the 2020 census, there were 54,341 people, 22,260 households, and 14,334 families living in the city. ===Religion=== 40.3% of the people of Rocky Mount are part of a religion. That is less than the state average of 48.9%. Christianity is the religion with the most members. Islam is the second biggest religion after Christianity. ==Economy== The economy of the Rocky Mount metropolitan area was mostly focused on agriculture and making textiles in the past. It has added pharmaceuticals and manufacturing. Distribution and logistics are important to local businesses because the city is located near a lot of highways and railways. The area has a strong service sector and a lot of financial and customer support buildings are here. Rocky Mount is located from the state capital Raleigh and its Research Triangle. This has helped bring new companies to Rocky Mount that want skilled workers and a lower cost of running a business. The metropolitan area was listed in a 2020 study as the third-highest in the United States where manufacturing is doing very well with a manufacturing output of $6.2 billion, or $42,270 per capita. Between 2014 and 2018, manufacturing grew in the Rocky Mount area by 11.8%, and there were 108% more manufacturing jobs than the national average. In 2019, CSX Transportation started building a $200 million cargo terminal in Rocky Mount. ===Largest employers=== Below is a list of some of the largest employers in the metropolitan area as of 2018. # Employer No. of employees 1 Pfizer 3,200 2 Nash County Public Schools 2,275 3 Cummins–Rocky Mount Engine Plant 1,800 4 Nash UNC Health Care 1,600 5 Edgecombe County Public Schools 1,100 6 QVC Distribution center 1,100 7 CenturyLink 1,000 8 Sara Lee Frozen Bakery 950 9 Alorica 885 10 City of Rocky Mount 850 ===Shopping=== Rocky Mount gets a lot of shoppers with many big retailers and specialty shops in the city. Rocky Mount's shopping centers are generally built along and around US 301 (Wesleyan Boulevard). Two of them are Golden East Crossing and Englewood Square. In the downtown area, the Douglas Block is a commercial area that was a former African American business district. Station Square is a shopping area located next to city hall and the train station. ==Arts and culture== The city is home to multiple buildings for the performing arts. The Imperial Centre for the Arts and Sciences has the Maria V. Howard Arts Center, a Children's Museum and Science Center, and a community theater. The Dunn Center for the Performing Arts at Wesleyan College has a lot of college arts performances and touring acts. It is also where the Tar River Orchestra and Chorus play. The Rocky Mount Event Center has space to hold up to 5,000 seats for entertainment and sporting events. Rocky Mount Mills is a craft brewery incubator, the first of its kind in North Carolina. It now has many breweries and restaurants. The mill also hosts summer music festivals and other events throughout the year. It has been in the process of redevelopment since 2014 by Capitol Broadcasting Company, which also owns the popular American Tobacco campus in downtown Durham, North Carolina. The next area they will build on is Goat Island in the Tar River. It will offer public access to hiking trails, beaches, and rafting/canoeing. A Rocky Mount Railroad Museum has been planned for a long time because of how important the railroad is to the city's culture. It has been proposed to be inside the train station. ===National Register of Historic Places=== The Bellamy-Philips House, Bellemonte, Benvenue, Edgemont Historic District, Falls Road Historic District, Lincoln Park Historic District, Machaven, The Meadows, Rocky Mount Central City Historic District, Rocky Mount Electric Power Plant, Rocky Mount Mills, Rocky Mount Mills Village Historic District, Stonewall, Villa Place Historic District, and West Haven Historic District are listed on the National Register of Historic Places. ==Parks and recreation== Rocky Mount is popular for kids' traveling sports as a midpoint between New York and Florida along I-95. The Rocky Mount Sports Complex, which is owned by the Parks and Recreation department, has seven outdoor baseball fields, four softball fields, eight soccer fields, a professional disc golf course, basketball courts, and volleyball courts. The complex sees many statewide and interstate baseball and soccer tournaments. It also has a football stadium home to the NCWC Battling Bishops football team and Elizabeth City State University's annual Down East Viking Classic. The Rocky Mount Event Center owned by the city has eight indoor basketball courts, sixteen volleyball courts, a ropes course, a climbing wall, and a family entertainment center. Tar River Trail is a greenway running east to west along the Tar River that goes to multiple parks, city landmarks, and the sports complex. The trail has boat ramps for paddling trips on the river. Some of the connected parks are City Lake Park, built in 1937 during the Great Depression by the Works Progress Administration, and the biodiverse Battle Park centered on the falls of the Tar River. ==Government== The city of Rocky Mount has a council-manager government. The city is split into seven wards with a total of seven people elected to the city council. One person is elected from each ward. Members of the city council have four-year terms with staggered elections every two years. The mayor is elected by all of the citizens and has a four-year term. Since the city is along the Nash County-Edgecombe County border, the commissions of both counties are involved in governing the city. ==Education== North Carolina Wesleyan University is a four-year private liberal arts college in Rocky Mount. The college has the Eastern North Carolina Center for Business and Entrepreneurship. The center's programs are free and open to the public. The city also has Nash Community College, which has a brewing, distillation, and fermentation program in partnership with Rocky Mount Mills. Edgecombe Community College has a downtown campus that specializes in biotechnology and medical simulation. It is one of only two such centers in the state. Shaw University's College of Adult and Professional Education (C.A.P.E.) has a satellite campus in the Rocky Mount Mills Village Historic District. The city of Rocky Mount is mostly served by the Nash-Rocky Mount Public School System, which has 15,000 students in 28 schools. The parts of the city that are in Edgecombe County are served by the Edgecombe County Public Schools system. Braswell Memorial Library is the town's main public library. It recently became part of the State Library's NC Cardinal consortium of public libraries. These share an integrated system allowing books and other materials to be checked out from other libraries across the state. ==Media== WHIG-TV and WNCR- LD are Rocky Mount's community television stations. WRQM 90.9 FM is the repeater station of public radio station WUNC, which is the local affiliate of NPR. In the 1990s, it was known as \"Down East Radio\" and was hosted at Wesleyan College. The Rocky Mount Telegram is the main daily newspaper for the city of Rocky Mount and the nearby areas. ==References== ==Other websites== * Category:Cities in North Carolina",
 "title": "Rocky Mount, North Carolina"
}