{
 "id": "680057",
 "text": "Romanization of Greek is a way to write the Greek language (either Ancient or Modern Greek) with the Roman alphabet. That can be done by mapping either letters (called transliteration) or sounds (called transcription. The Greek name Ἰωάννης can be transliterated as Johannes, which became John in Modern English. In Modern Greek, it is generally written Γιάννης, which transliterates to Yannis. The masculine Greek word Ἅγιος or Άγιος might variously appear as Hagiοs, Agios, Aghios or Ayios, or it might simply be translated as \"Holy\" or \"Saint\" in English forms of Greek placenames. Traditional English renderings of Greek names originated from Roman systems that were established in antiquity. The Roman alphabet was a form of the Cumaean alphabet, which was itself developed from the Euboean script, which used as , as , and variant forms of and that later became L and S.Jeffery, Lilian H. The local scripts of archaic Greece, . Clarendon Press (Oxford), 1961. When the Euboean script was used to write the classical Greek alphabet, ⟨κ⟩ was replaced with ⟨c⟩, ⟨αι⟩ and ⟨οι⟩ became ⟨æ⟩ and ⟨œ⟩, and ⟨ει⟩ and ⟨ου⟩ were simplified to ⟨i⟩ (more rarely, corresponding to an earlier pronunciation, to ⟨e⟩) and ⟨u⟩. Aspirated consonants like ⟨θ⟩, ⟨φ⟩, initial-⟨ρ⟩, and ⟨χ⟩ simply wrote out the sound: ⟨th⟩, ⟨ph⟩, ⟨rh⟩, and ⟨ch⟩. Because English orthography has changed so much from the original Greek, modern scholarly transliteration now usually renders ⟨κ⟩ as ⟨k⟩ and the diphthongs ⟨αι, οι, ει, ου⟩ as ⟨ai, oi, ei, ou⟩.The Library of Congress. ALA- LC Romanization Tables: \"Greek\". 2010. Modern scholars also increasingly render ⟨χ⟩ as ⟨kh⟩. Greek sounds greatly changed, and Modern Greek sounds quite different from Ancient Greek. That also has had an influence on the terms used in English and other languages and had led to a number of different romanizations for names and placenames in the 19th and the 20th centuries. The Hellenic Organization for Standardization (ELOT) issued its system in co- operation with the International Organization for Standardization (ISO) in 1983. The system was adopted (with minor modifications) by the United Nations' Fifth Conference on the Standardization of Geographical Names at Montreal in 1987,Department of Technical Co-operation for Development. \"Fifth United Nations Conference on the Standardization of Geographical Names: Montreal, 18-31 August 1987\", \"Report of the Conference\", . United Nations (New York), 1987.United Nations Group of Experts on Geographical Names, Working Group on Romanization Systems. Report on the Current Status of United Nations Romanization Systems for Geographical Names: \"Greek\". United Nations (New York), 2003. Accessed 6 Oct 2014. by the United Kingdom's Permanent Committee on Geographical Names for British Official Use (PCGN) and by the United States' Board on Geographic Names (BGN) in 1996,United States National Geospatial-Intelligence Agency. Romanization Systems and Policies : \"Romanization System for Greek \". 1996. Accessed 2 Oct 2014. and by the ISO itself in 1997.International Organization for Standardization. \"ISO 843:1997 (Conversion of Greek characters into Latin characters)\". 2010. Romanization of names for official purposes, as with passports and identity cards, were required to use the ELOT system within Greece until 2011, when a legal decision permitted Greeks to use irregular forms [Synī́goros tou Polítī, \"The Greek Ombudsman\".] \"\" [Latinikī́ grafī́ katá parékklisī ELOT 743 stis taftótītes kai ta diavatī́ria, \"Latin Script Exceptions to ELOT 743 on Passports and ID Cards\"]. Accessed 3 Oct 2014. (such as \"Demetrios\" for ) provided that official identification and documents also list the standard forms (as, for example, \"Demetrios OR Dimitrios\").Hellenic National Passport Center. Press Releases: \"Transliteration of the Passport Holder's Name in Latin \". 12 Feb 2012. Accessed 3 Oct 2014. Other romanization systems are the BGN/PCGN's earlier 1962 systemPedersen, Thomas T. Transliteration of Non-Roman Scripts: \"Greek\". 31 July 2005. Accessed 2 Oct 2014. and the system employed by the American Library Association and the United States' Library of Congress. == References == Greek Category:Greek language",
 "title": "Romanization of Greek"
}