{
 "id": "6803",
 "text": "Jacques René Chirac (29 November 1932 - 26 September 2019) was a French politician who served as President of the French Republic and ex officio Co- Prince of Andorra from 1995 to 2007. He was re-elected in 2002. Before that, he was Prime Minister of France twice, and Mayor of Paris from 1977 to 1995. ==Assassination attempt== On 14 July 2002, during Bastille Day celebrations, a man tried to shoot Chirac. A lone gunman with a rifle hidden in a guitar case, the would-be assassin fired a shot toward the presidential motorcade. He was then overpowered by bystanders. The gunman, Maxime Brunerie, had psychiatric testing. ==After Presidency== On 15 December 2011, Chirac was found guilty for corruption. He was allowed to serve his 2-year sentence without prison time. As a former president, Chirac had a lifetime pension. He was a member for life of France's Constitutional Council. ==Personal life== In 1956, he married Bernadette Chodron de Courcel. They had two daughters: Laurence (1958-2016) and Claude (born 1962). Claude is a public relations assistant and personal adviser. Laurence, who had anorexia nervosa in her youth, did not participate in the political activities of her father. ===Health=== In 2005, Chirac suffered a stroke. He had been suffering from memory loss and was in ill health. On 10 December 2015, Chirac was hospitalized in Paris for undisclosed reasons, and although his state of health did not \"give any cause for concern\", he would remain under the intensive care unit. ===Death=== Chirac died at his home in Paris on 26 September 2019 at the age of 86. ==References== ==Other websites== * Category:1932 births Category:2019 deaths Category:French criminals Category:Prime ministers of France Category:French Roman Catholics Category:Mayors of Paris Category:Presidents of France Category:Princes of Andorra Category:Recipients of the Decoration for Services to the Republic of Austria Category:21st-century presidents of France Category:20th-century presidents of France Category:21st-century princes of Andorra",
 "title": "Jacques Chirac"
}