{
 "id": "68048",
 "text": "Li Guang (; ? – 119 BC) born in Tianshui, Gansu, China, was a Chinese general of the Han Dynasty. His father, Li Xin, was a great military leader. Li Guang became a soldier when he was young. As Li Guang fought bravely in the battlefields, he was soon promoted to a general. He killed himself in the year 119 BC. == Achievements == Li Guang, renowned for his leadership during the Western Han dynasty, was a stalwart military commander whose loyalty to his subordinates was unwavering. During the reign of Emperor Jing (157-141 BCE), Li Guang's merit ascended steadily. He rose to prominence as Commander-in- chief of Longxi, assuming the mantle of leadership as the head of the gentlemen of cavalry and Commandant of the imperial guard. Successively, he governed various commanderies as their appointed governor, showcasing his administrative prowess and dedication to imperial service. He fought mainly against the Xiongnu people which were located to the north of Han China. Under the reign of Emperor Wu (141-87 BCE), Li Guang's influence continued to burgeon. He was appointed Chamberlain for the Palace Garrison, entrusted with the safeguarding of the imperial residence. His military acumen led to his elevation as General of the imperial guard, a position of paramount importance in ensuring the security of the realm. Additionally, he assumed the mantle of governorship over Youbeiping, a strategic border region crucial for maintaining stability in the vicinity of modern Beijing. Through these appointments, Li Guang's legacy as a trusted guardian of the Han dynasty flourished. Through trials and triumphs, he stood by his soldiers, earning their respect and camaraderie. His prowess in archery was unmatched, a skill that bolstered his reputation and secured victories on the battlefield. His bravery and strategic acumen made him a formidable opponent, striking fear into the hearts of Hun adversaries who dubbed him the \"Flying General.\" Despite his military successes, Li Guang found himself marginalized by the court's bureaucrats, his contributions often overlooked or overshadowed. This neglect and disillusionment weighed heavily upon him, ultimately leading to his demise amidst a tide of sorrow and regret. == References== Category:119 BC deaths Category:Han Dynasty generals Category:Year of birth unknown Category:2nd-century BC Chinese people",
 "title": "Li Guang"
}