{
 "id": "68068",
 "text": "Squashes are a kind of vegetable. They are originally from the Americas. Gourds are in the same family as squashes. Pumpkins and zucchini (courgette) are types of squashes. Although squash is a fruit according to its botanical classification, it is generally considered a vegetable in food preparation. A squash can grow up to fifteen feet tall. == Word origin == The English word \"squash\" comes from askutasquash (which means \"a green thing eaten raw\"). This is a word from the Narragansett language, which was documented by Roger Williams in his 1643 publication A Key Into the Language of America. There are similar words for squash in related languages of the Algonquian family such as Massachusett. == Squash and art == The squash has been an important crop in the Andes mountains since the pre-Columbian Era. The Moche culture from Northern Peru made ceramics from earth, water, and fire. This pottery was used to represent important themes. Squash are a popular shape in Moche ceramics.Berrin, Katherine & Larco Museum. The Spirit of Ancient Peru:Treasures from the Museo Arqueológico Rafael Larco Herrera. New York: Thames and Hudson, 1997. ==Images== Image:Beige squashes DSC01081.jpg|Squashes grow hanging from a network of stalks Image:Femalesquash3747.JPG|Longitudinal section of female flower of squash (courgette), showing ovary, ovules, pistil, and petals Image:Squashes.jpg|Various squashes such as Turban, Sweet Dumpling, Carnival, Gold Acorn, Delicata, Buttercup and Golden Nugget. ==References== == Other websites == * Squash Display at Missouri Botanical Garden - Pics of 150 varieties from The Great Pumpkin Patch, Arthur, IL * Big-Pumpkins.de This is a very informative site for the new as well as experienced giant pumpkin (Riesenkürbis) and squash grower aimed towards the German speaking audience, though all growers are welcome. * The Great Squash Cook-off - Recipe contest for winter squash in Brooklyn, NY Category:Vegetables Category:Cucurbitaceae Category:Fruits",
 "title": "Squash (plant)"
}