{
 "id": "680829",
 "text": "Deltarune is a role-playing video game. It was created by American indie developer Toby Fox. In the game, the player controls a human named Kris. The game is set in a world where monsters live on the surface of the Earth. Kris and a classmate, Susie, fall from Earth into a place called the “Dark World”. In the Dark World, they meet Ralsei. Ralsei tells them that they are heroes destined to restore balance to the world. Through the combat system, the player meets different enemies who attack with a bullet hell style of attack. These encounters can be resolved peacefully or with combat. Deltarune is a spin-off of Fox's earlier game, Undertale. The word Deltarune is an anagram for the name of that game. The setting of the game is \"not the world of Undertale\", according to Fox although the characters and settings are similar. The first chapter of the game was released on October 31, 2018 for Microsoft Windows and macOS. A version for Nintendo Switch and PlayStation 4 was released in February 28, 2019. The second chapter was released on Windows and macOS in September 17, 2021. It has been announced that chapters 3 and 4 will come out on June 5th, 2025, along with the release of the Nintendo Switch 2. These chapters will be a paid release, unlike chapters 1 and 2, which are free. The graphics of the game are similar to 16-bit Japanese role-playing games such as EarthBound, Mario & Luigi: Superstar Saga and Chrono Trigger. == Gameplay == Deltarune, like Undertale, is a role-playing game that uses a top- down perspective. The player controls a human named Kris. They have to complete objectives in order to beat the game. During some parts of the game, the player is allowed to choose attacks of other characters in the game. Combat is similar to most turn-based role-playing games. Players chose from a set of actions such as \"Attack\" or \"Spare\". While the game is biased towards avoiding fights, one of the party members, Susie, would rather attack enemies than spare them. Because of this, the player has to choose actions that will stop Susie from hurting enemies if they do not want to attack the enemy. The game also has TP (Tension Points). These can be used to allow team members to use spells such as \"Pacify\". == Plot == === Chapter 1 === Upon starting the game for the first time, the player is allowed to create an avatar, referred to by a disembodied voice as a \"vessel\". After making this vessel, it is deleted, with the player being told that \"No one can choose who they are in this world.\" The player begins with the story controlling Kris, a human who lives with their adoptive mother Toriel, a goat-like monster. Toriel drops Kris off at school, where Kris goes to a class taught by Alphys, a lizard-like monster. Susie, another lizard-like monster who is Kris' classmate, is sent to get chalk for the blackboard from the supply closet along with Kris. After Kris and Susie enter the supply closet, both of them are pulled into the \"Dark World\". There, they meet Ralsei, a prince of the dark, who tells them that the three of them are heroes destined to close a geyser of dark energy to restore balance to that world. However, the King has seized control of the Dark World and is determined to spread darkness. Susie chooses not to help, only wanting to return to her own world. However, the three encounter Lancer, the King's son, who tries to stop them from getting further with various poorly thought out plans. Susie eventually decides to join Lancer, leaving Kris and Ralsei on their own. As Kris and Ralsei make their way to the King's castle, Susie makes friends with Lancer, and the four eventually become a team. Upon realizing that they will have to face the King, Lancer runs off to the castle and tells the King's henchmen to throw Kris, Ralsei, and Susie into the dungeon. Susie escapes the dungeon and confronts Lancer, who explains he wanted to keep Susie and the King from hurting each other. Susie promises Lancer she won't hurt the King. Kris, Susie and Ralsei go to the top of the castle and battle the King. Eventually, the King falls to the ground in exhaustion and Ralsei heals him. However, this is revealed to be a ruse as the King quickly stops the three heroes from being able to act, threatening to kill them all. If the player has not ended previous battles by fighting throughout the game, Lancer turns the King's men against him and imprisons him, taking his father's place. Otherwise, Ralsei subdues the King with a magic spell. The group closes the dark geyser, so Kris and Susie can return to their own world. There, Susie says goodbye, mentioning that she wants to go to the Dark World again. The player can explore the town before having Kris go home to bed. That night, Kris, without player input, shakes in bed, then falls on the floor, and limps to the center of the room. Kris tears into their chest and rips out their soul, throwing it into a birdcage in the corner of the room. Kris draws a knife and turns toward the viewer. They smile, with their right eye flashing red, === Chapter 2 === The day after Chapter 1 takes place, it is discovered that when Kris pulled out the knife, they had eaten an entire pie rather than committing homicide. Kris and Susie go back to school, and Kris sleeps for the entire class. They meet up with Susie outside of the classroom after class and revisit the Dark World, after being invited to study in the library by Noelle. Confused, Susie asks where everyone is, so Ralsei has Kris get all the stuff from the abandoned classroom into the closet. After doing this, Castle Town becomes populated. When Kris goes to leave, Susie complains about the group project, only to have Ralsei banish them until they start it. Lancer and Rouxls Kaard enter the Kris' Key Items, and they set off for the library. When they go there, they enter the computer lab and find another dark world. There, they reunite with Ralsei, and meet Queen. They then see Noelle captured by Queen, and end up playing against Queen in an arcade game similar to Punch- Out!!. After doing that, the group explores Cyber Field and meets the Sweet Captain Cakes, a band and resistance force against Queen. It is revealed that they thought that you were helping Queen capture Noelle. This leads to the first boss fight of the game. After that, you go to a roller coaster where you fight your classmate Berdly, who allied with Queen. After beating Berdly, you fall into a pile of trash. You split off from the rest of the party, and meet Noelle, who joins you. After getting up to either funny antics avoiding Queen or committing mass murder, you get in Queen's car to help her look for Noelle, who is disguised and also in the car. You face a traffic jam, and you split off to make a detour to clear it up. But first, you end up fighting Spamton, a deranged car salesman. == Development == Deltarune was developed by Fox in GameMaker Studio 2. The game introduces a new battle system influenced by the Final Fantasy franchise, contrasting with the original game's combat system (which was inspired by that of the Mother series). Some of the music in the game remixes much of the soundtrack of Undertale, but most pieces are new. The main game uses sounds from EarthBound, while battle music is similar to Breath of Fire III music, and even Lancer's theme is similar to J.A.K.Q. Dengekitai's opening theme. The game also has many similarities with Undertale in the name of characters, for example, Ralsei (one of the main characters) is an anagram of Asriel (a character from Undertale) and Kris (the main character from Deltarune) is almost an anagram of Frisk (the main character from Undertale). The name of the game, Deltarune is an anagram of Undertale. Temmie Chang, who helped as artist in Undertale, served as the main artist for the game, designing characters, sprites and animations. == Release == After previously teasing something Undertale-related a day earlier on Twitter, Fox released the first chapter of Deltarune, a game \"intended for people who have completed Undertale\", on October 31, 2018 for Windows and macOS for free. Fox said that this release is the first part of a new project, and considered the release a \"survey program\" to determine how to take the project further. Fox mentioned that Deltarune will be a larger project than Undertale. He plans for Deltarune to have only one ending. == References == Category:2018 video games Category:Bullet hell video games Category:Episodic video games Category:Indie video games Category:LGBT-related video games Category:MacOS games Category:Metafictional video games Category:Role-playing video games Category:Video games about animals Category:Windows games",
 "title": "Deltarune"
}