{
 "id": "681475",
 "text": "Peter Northe Wells (8 February 1950 – 18 February 2019) was a New Zealand writer and filmmaker and historian. He was born in Auckland. His best known work was Desperate Remedies (1993). Wells' 2003 novel Iridescence was a runner up in the fiction category of the Montana New Zealand Book Awards and a finalist in the 2005 Tasmania Pacific Fiction Prize. In 2006, Wells was made a Member of the New Zealand Order of Merit. He was openly gay. ==Personal life== Wells, who was gay, was married to the writer Douglas Lloyd Jenkins. Wells died from prostate cancer at Mercy Hospice under hospice care in Auckland on 18 February 2019, aged 69. == Works == ===Bibliography=== * **Short story collection. Won 1992 NZ Book Award for Fiction and 1992 PEN (NZ) Best First Book in Prose Award. **The feature film Memory and Desire (1997) directed by Niki Caro, was based on Wells' short story \"Of Memory and Desire\" in this collection. * * * * Best Mates: Gay Writing in Aotearoa New Zealand (1997) Edited by Peter Wells and Rex Pilgrim. Auckland: Reed * Frock Attack! Wig Wars!: Strategic Camp in Desperate Remedies (1997) Auckland: Centre for Film, Television and Media Studies, University of Auckland * Long Loop Home: a memoir (2001) Auckland: Vintage. Won the Biography Category of the 2002 Montana NZ Book Awards * Iridescence (2003) Auckland: Vintage. Runner-up for the 2004 Deutz Medal for Fiction and shortlisted for the Tasmania Pacific Fiction Prize 2005 * On Going to the Movies (2005) Series editor Lloyd Jones. Wellington: Four Winds Press * The Cat's Whiskers: New Zealand Writers on Cats (2005) Edited by Peter Wells. Auckland: Vintage * Lucky Bastard (2007) Auckland: Random House * The Hungry Heart (2012) Auckland: Random House * Little Joker Sings (2013) Auckland: Random House * Journey to a Hanging (2014) Auckland: Random House * Dear Oliver: Uncovering a Pākehā History (2018) Massey University Press ===Filmography and videography=== *Foolish Things (1980) *Little Queen (1984) *Jewel's Darl (1985) *My First Suit (1985) *Newest City on the Globe: Art Deco Napier (1985). Auckland: Moving Image Centre. *Newest City on the Globe (1985). Written and directed by Peter Wells. Produced and edited by Stewart Main. Auckland: TVNZ. *A Death in the Family. Film for television with Stewart Main. *Drama on Film. Wellington: New Zealand Film Commission. *The Mighty Civic (1988) Documentary co-directed by Wells and Stewart Main. Wellington: New Zealand Film Commission. *A Taste of Kiwi (1990) *Desperate Remedies (1993). Written by Wells and co-directed by Wells and Main. Isambard Productions. *Naughty Little Peeptoe, with Garth Maxwell. *One of Them Written by Wells and directed by Main. *Georgie Girl (2001) ==References== ==Other websites== * * * List at University of Auckland New Zealand Literature File of works by and about Wells * NZ Book council bio and interview * My Favourite Room: Peter Wells * Profile audio interview with Peter (2013), PrideNZ.com Category:1950 births Category:2019 deaths Category:Deaths from prostate cancer Category:New Zealand writers Category:New Zealand LGBT people Category:LGBT novelists Category:LGBT directors Category:Gay men Category:People from Auckland",
 "title": "Peter Wells (director)"
}