{
 "id": "681669",
 "text": "Southern Ming was the name of some regimes established by the Ming royal family in southern China after the fall of Beijing, which experienced four emperors and one supervisor. It is seen by many as a continuation of the Ming Dynasty. == History == In the seventeenth year of Chongzhen (1644), Li Zicheng 's rebellious army captured Beijing, and Zhu Youjian, Emperor Chongzhen, hanged himself in Meishan. When the Qing army entered the Central Plains, most of the imperial families and ministers of the Ming Dynasty fled to the south. They had half of the rivers and mountains south of the Huaihe River to resist the Qing army, including the Hongguang regime, the Lu Kingdom, the Longwu regime, the Shaowu regime, the Yongli regime and the Ming Zheng regimes. Zhu You Song, the King of Fu, was appointed Emperor of Nanjing and changed his name to Hongguang in 1645. Later, the Qing army descended to the South and besieged Yangzhou. The city of Yangzhou was destroyed and the Qing army slaughtered the people. Historically, it was called \"the 10th day of Yangzhou\" . Soon after Nanjing fell, Emperor Hongguang was captured. In 1645, with the support of Zheng Zhilong and others, Zhu Yujian, the King of Tang called himself Emperor in Fuzhou and Longwu in another year. Emperor Longwu launched a short Northern Expedition under the chairmanship of minister Huang Daozhou . At the same time, he joined the peasant rebellion forces to resist the Qing Dynasty. However, with the surrender of Zheng Zhilong to the Qing Dynasty, the situation deteriorated. After being captured, Emperor Longwu died of hunger strike, and the Qing army quickly occupied most of the Southeast. The rest of the Daxi Army and the bureaucrats of the Ming Dynasty joined forces to support Zhu Youlang , the King of Gui to be emperor in southwest China and changed his name to Yongli. At the same time, Zheng Chenggong attacked the Qing army from both East and west, and the anti-Qing situation reached a climax. However, with the internal strife among the three kings and the attack of the Qing army, the defence line of the Ming army was quickly broken down by the Qing army. In 1661, Wu Sangui led the Qing Army into Myanmar, and Mangbai, the king of Myanmar, handed over Yongli to the Qing Army. The following April, Yongli and Prince were killed by Wu Sangui in Kunming. After that Zheng Chenggong revered the Ming Dynasty and used Taiwan eastward as a base for resisting the Qing Dynasty and established the Ming and Zheng Dynasty. The Ming Zheng regimes continued to use the Yongli Year, but did not support the Ming Dynasty as emperor or supervisor. In 1683, when the Qing army occupied Taiwan, Zheng Ke Shuang, King of Yanping, fell to the Qing Dynasty, and Zhu Shugui, King of Ningjing, died by suicide, and the forces of the Ming Dynasty were completely destroyed. Category:Chinese dynasties Category:17th century in China Category:1640s establishments Category:17th-century establishments in Asia Category:1680s disestablishments Category:Disestablishments in Asia",
 "title": "Southern Ming"
}