{
 "id": "681781",
 "text": "2019 Pulwama attack was an attack on the Indian security guards by a suicide bomber on 14 February 2019.It happened at Lethpora in the Pulwama district, Jammu and Kashmir, India. The attack resulted in the deaths of 40 Central Reserve Police Force (CRPF) guards and the attacker.The Pakistan-based Islamist militant group (terrorist group) Jaish-e-Mohammed was responsible for this attack. A Jaish-e-Mohammed member named Adil Ahmad Dar, a Kashmiri local, was identified as the attacker. Pulwama Attack 2019, everything about J&K; terror attack on CRPF by terrorist Adil Ahmed Dar, Jaish-eMohammad, India Today, 16 February 2019. After the pulwama attack entire Indian national cricket team thought that they would wear an army to honor martyrs former captain Mahendra Singh Dhoni asked Virat Kohli to do this. == Attack == State Number Names Uttar Pradesh 12 Cst. Pradeep Kumar HC Awadhesh Kumar Yadav HC Ram Vakeel Mathur Cst. Mahesh Kumar Meena Cst. Vijay Kumar Mourya Cst. Pankaj Kumar Tripathi Cst. Ramesh Yadav Cst. Shyam Babu Cst. Kaushal Kumar Rawat Cst. Pradeep Singh Cst. Ajit Kumar Azad Cst. Amit Kumar Rajasthan 5 Cst. Jeet Ram Cst. Rohitash Lamba HC Narayan Lal Gurjar HC Hemraj Meena Cst. Bhagirathi Singh Punjab 4 Cst. Kulwinder Singh Cst. Maninder Singh Attri HC Jaimal Singh Cst. Sukhjinder Singh Odisha 2 Cst. Manoj Kumar Behera HC Prasanna Kumar Sahoo Uttarkhand 2 ASI Mohan Lal Cst. Virendra Singh Rana Bihar 2 Cst. Ratan Kumar Thakur HC Sanjay Kumar Sinha Maharashtra 2 HC Sanjay Bhikamsingh Dixit Rajput Cst. Nitin Shivaji Rathod West Bengal 2 HC Bablu Santra Cst. Sudip Biswas Tamil Nadu 2 Cst. G. Subramanian Cst. C. Sivachandran Assam 1 HC Maneswar Basumatary Karnataka 1 Cst. H. Guru Jammu and Kashmir 1 HC Ahmed Naseer Himachal Pradesh 1 Cst. Tilak Raj Kerala 1 Cst. Vazhakkandiyil (V. V.) Vasantha Kumar Jharkhand 1 HC Vijay Soreng Madhya Pradesh 1 Cst. Lal Ashwini Kumar Kachhi Total 40 At Lethpora near Awantipora, around 15:15 IST, a bus carrying security guards was hit by a Mahindra Scorpio SUV carrying explosives. It caused a blast which killed 40 CRPF personnel of the 76th Battalion. The injured were moved to the army base hospital in Srinagar. The Pakistan-based Islamist militant group (terrorist group) Jaish- e-Mohammed was responsible for this attack.They also released a video of the attacker, Adil Ahmad Dar. Dar was a 22-year old from Kakapora . He had joined the group a year ago. Pakistan denied any involvement with the group. But Jaish-e-Mohammed leader, Masood Azhar, roams freely in that country. This is the deadliest terror attack on India's state security guards in Kashmir since 1989. After the pulwama attack all Indian national cricket team though that they would wear an army cap to honor martyrs fomer Indian captain asked Virat Kohli to do this. == References == Category:2019 in India Category:February 2019 events Category:Islamic terrorist incidents in Asia Category:Islamic terrorist incidents in 2019 Category:Mass murder in 2019 Category:Mass murder in Asia Category:2010s murders in India Category:Terrorist incidents in Asia in 2019 Category:Terrorist incidents in India in the 2010s Category:Pulwama district",
 "title": "2019 Pulwama attack"
}