{
 "id": "681822",
 "text": "The first presidency of Donald Trump as the 45th president of the United States began with his inauguration on January20, 2017, and ended on January20, 2021. In November 2016, Republican Donald Trump was elected the 45th president, defeating Democrat Hillary Clinton. Several people thought that the election wasn't fair. The FBI and Congress investigated if Russia tried to help Trump win. The Mueller report said that Russia did try to help Trump's campaign, but that there was no concrete evidence. Trump governed with an \"America First\" policy. He stood against illegal immigration, expanded the wall on the U.S.–Mexico border, and banned immigration from seven mostly Muslim countries. Many of his actions were challenged in court. Trump confirmed three new Supreme Court justices, started a trade war with China, signed the Tax Cuts and Jobs Act, and removed the U.S. from the Paris Agreement. A whistleblower said that Trump had stopped aid to Ukraine until they would investigate the business dealings of Hunter Biden; Hunter's father, Democrat Joe Biden, would be Trump's opponent in the 2020 presidential election. For this action, Trump was impeached, but he was acquitted in 2020. COVID-19 started spreading in China in late 2019. In March 2020, the World Health Organization said it was a pandemic. Under Operation Warp Speed, the Trump administration helped make a COVID-19 vaccine in less than a year, which was ready by December 2020. The May 2020 murder of George Floyd caused mass protests and riots in many cities over police brutality. Joe Biden defeated Trump in the 2020 presidential election. Trump repeatedly lied about mass voter fraud and cheating in the election by Democrats. On January 6, 2021, supporters of Trump rioted on the U.S. Capitol, which led to Trump's second impeachment, making him the only U.S. president to be impeached twice. The Senate later acquitted Trump after the end of his term, despite some other Republicans voting against him. Trump's term ended when Joe Biden and Kamala Harris were inaugurated as president and vice president. Four years later, he would return to office as the 47th president after winning the 2024 election. == 2016 presidential election == On November 9, 2016, Republican Donald Trump of New York and Governor Mike Pence of Indiana won the 2016 election, defeating former Democratic secretary of state Hillary Clinton of New York and U.S. senator Tim Kaine of Virginia. Trump won 304 electoral votes compared to Clinton's 227, although Clinton won the popular vote, receiving nearly 2.9 million more votes than Trump. Trump then became the fifth person to win the presidency while losing the popular vote. In the congressional elections, Republicans maintained majorities in both the House of Representatives and the Senate. ==Personnel== The Trump administration has had record turnover, particularly among White House staff. By the end of his first year in office, 34 percent of Trump's original staff had resigned, been fired, or been reassigned. , 43 percent of senior White House positions had turned over. On September 5, 2018, The New York Times published an article entitled \"I Am Part of the Resistance Inside the Trump Administration\", written by an anonymous senior official in the Trump administration. The author asserted that \"many of the senior officials in his own administration are working diligently from within to frustrate parts of his agenda and his worst inclinations.\" ==In Office== Trump's presidency was marked by a focus on economic issues, tax reforms, immigration and deregulation. He implemented a conservative agenda, appointed three Supreme Court justices, withdrew from the Paris Agreement on climate change, and engaged in historic meetings with North Korean leader Kim Jong-un. However, his tenure was also characterized by controversy, including impeachment proceedings related to his dealings with Ukraine and the Trump administration family separation policy. ==Elections during the Trump presidency== Republican seats in Congress Congress Senate House 115th 52 241 116th 53 200 ===2018 mid-term elections=== In the 2018 mid-term elections, Democrats won control of the House of Representatives, while Republicans expanded their majority in the Senate. === 2020 presidential election === In the 2020 presidential election, Trump and Vice President Mike Pence ran against former Vice President Joe Biden and U.S. Senator Kamala Harris. The president and vice president lost both the electoral college and the popular vote. This made Trump the first incumbent president since 1992 to lose his re- election bid. Trump and Pence left office on January 20, 2021. ==Historical evaluations and public opinion== By the end of Trump's first year in office, opinion polls showed him as the least popular United States president since 1945. He said many false and misleading things in his campaign and presidency. Those things were documented by fact-checkers. Early in his presidency, the Trump administration developed a controversial relationship with mass media. He repeatedly said it was the \"fake news\". In general, news outlets have made false facts before. Trump's most repeated false statements were each repeated over 100 times during his presidency. They included that the \"Trump wall\" was already being built, that a U.S. trade deficit would be a \"loss\" for the country, and that the American economy was the strongest ever during his administration. ==References== Category:2010s in the United States Category:2017 establishments in the United States",
 "title": "First presidency of Donald Trump"
}