{
 "id": "68209",
 "text": "Football (soccer) has been included in every Summer Olympic Games except 1896 and 1932 as a men's competition sport. Women's football was added to the official program at the 1996 Atlanta edition. == History == Football was not in the original modern Olympic Games program as international football was not that popular in 1896. However an unofficial football tournament was organised during the first competition. Complete records have been lost and may not even be true but it seems that only two games may have been played. An Athens XI lost to a team representing Smyrna (Izmir), then part of the Ottoman Empire. Smyrna went on to be beaten 15-0 by a team from Denmark. Demonstration tournaments were played at the 1900 and 1904 games and the \"Intercalated Games\" of 1906, but these were contested by various clubs and scratch teams, and are not considered to be official Olympic events. Neither FIFA nor the IOC recognize the Intercalated Games. The first proper tournament is said to be in the 1908 Olympics, organized by the Football Association. It had 6 teams. The next tournament was organized by the Swedish Football Association in 1912. However, the tournament was very unbalanced, with some high scoring games such as 10-0 and 12-0, and all of the players were amateurs. The tournaments of 1924 and 1928 are the two only editions officially recognised by FIFA as championships of the world. For the 1984 Olympics, the IOC admitted professional players. Since the 1992 Barcelona Olympics, all teams have to be under-23 years old. Since 1996, three over 23 players are allowed. A women's edition was added in 1996. The women's tournament has no age restrictions, unlike the men's tournament. == Results == === Men === {| class=\"wikitable\" Year # of teams 1900 3 1904 3 1908 5 1912 11 1920 14 1924 22 1928 17 1936 16 1948 18 1952 25 1956 11 1960 16 1964 14 1968 16 1972 16 1976 13 1980 16 1984 16 1988 16 1992 16 1996 16 2000 16 2004 16 2008 16 2012 16 2016 16 2020 16 ==Related pages== * National teams world champions (football) * Football at the 1936 Olympics * Football at the 1988 Olympics * Football at the 2012 Olympics * Football at the 2016 Olympics == References == Category:Football at the Olympics",
 "title": "Football at the Summer Olympics"
}