{
 "id": "68263",
 "text": "Kojiki or Furukotofumi (), also called in English the Records of Ancient Matters, is the oldest book known in Japan.Nussbaum, Louis-Frédéric. (2005). \"Nihon Shoki\" in Japan Encyclopedia, p. 545. It was written 712 CE, and dedicated to Empress Gemmei. The Kojiki is a book about Japanese mythology (Shinto), legends, songs, genealogies, oral traditions, and semi-historical accounts down to 641 BCE.Jaroslav Průšek and Zbigniew Słupski, eds., Dictionary of Oriental Literatures: East Asia (Charles Tuttle, 1978): 140-141. The book mixes the legends of first emperor of Japan and several others with stories about the gods. Therefore, it is difficult to know which parts of the Kojiki are real and which parts are legend. According to legend, all the emperors of Japan are descended from Amaterasu, the sun goddess. The Kojiki is written in Chinese, but the way the Japanese wrote it is by using the pronunciation of the Chinese characters and not the meanings of them. In other words, a person who can read Chinese will not be able to read the Kojiki unless they also know how to speak Japanese. It includes many Japanese names and some phrases. ==Sections== The Kojiki is divided into three parts: the , the and the . *The Kamitsumaki, also known as the , includes the preface of the Kojiki. It is about the first gods in the mythology of Japan, Izanagi and Izanami. These are the gods who created the world. This volume also tells of the births of various gods of the kamiyo period, or Age of the Gods. The Kamitsumaki also describes the legends about the creation of Japan. It describes how Ninigi-no-Mikoto, grandson of Amaterasu, came down from heaven to Kyūshū and became the ancestor of the Japanese royal line. According to this legend, he is considered the great-grandfather of Emperor Jimmu. *The Nakatsumaki begins with the story of Jimmu, the first Emperor, and how he conquered Japan. The volume ends with the 15th emperor, Ōjin. Not much is written about the reigns of the second through the ninth emperors; only their names and the names of their various descendants are mentioned, as well as a few other details. There is no mention of their achievements. Many of the stories in this volume are mythological, and there is no evidence to suggest that they are historically accurate. Recent studies support the opinion that these emperors were invented to push Jimmu's reign further back to the year 660 BC. *The Shimotsumaki recounts the 16th to the 33rd emperors. Unlike the other two volumes, this one does not contain many references to the gods. Interactions between the human world and the gods are very prominent in the first and second volumes, but not in this volume. Information about the 24th to the 33rd emperors is largely missing as well. == Related pages == * Nihon Odai Ichiran * Nihon Shoki ==References== == Other websites == * The Internet Sacred Text Archive - An online version of Basil Hall Chamberlain's translation of Kojiki (1919). Category:8th century in Japan Category:Japanese mythology Category:Shinto Category:8th-century books Category:712",
 "title": "Kojiki"
}