{
 "id": "683109",
 "text": "The following is a list of deaths that should be noted in March 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==March== ===1=== *Zhores Alferov, 88, Soviet-born Russian physicist, Nobel Prize winner (2000) and MP (since 1995), complications from a stroke.Умер Жорес Алферов *Kumar Bhattacharyya, Baron Bhattacharyya, 78, British-Indian engineer and politician, member of the House of Lords (since 2004).'Force of nature' Professor Lord Bhattacharyya dies aged 78 *Elly Mayday, 30, Canadian model and women's health advocate, ovarian cancer.Saskatchewan-born model, advocate Elly Mayday dies at 30 *Kevin Roche, 96, Irish-born American architect, Pritzker Prize winner (1982).Distinguished Irish architect Kevin Roche dies aged 96 *Peter van Gestel, 81, Dutch children's writer (Schuilen onder je schooltas, Het wassende water, Ko Kruier en zijn stadsgenoten).Kinderboekenschrijver Peter van Gestel (81) overleden ===2=== *Arnulf Baring, 86, German political scientist and historian.Der Chronist der Westbindung *Keith Davis, 88, New Zealand rugby union player (Auckland, New Zealand Māori, national team).Former All Blacks halfback Keith Davis dies, aged 89 *Fred Hill, 84, American baseball coach (Rutgers University).Rutgers baseball legend Fred Hill dead at 84 *Med Hondo, 82, Mauritanian-French movie director (Soleil O), screenwriter (Sarraounia), and actor (1871).Décédé à l’âge de 82 ans, le spécialiste du doublage était aussi acteur et cinéaste de renom *János Koós, 81, Hungarian singer and television contestant (Táncdalfesztivál).Meghalt Koós János *Francisco Macri, 88, Italian-Argentine businessman, father of President Mauricio Macri.Murió Franco Macri, padre del Presidente y jefe del grupo de empresas familiar *Keith Harvey Miller, 94, American politician, Alaska Secretary of State (1966–1969) and Governor (1969–1970), pancreatic cancer.Keith Miller, Alaska's third governor, dies at 94 *Ogden R. Reid, 93, American politician, Ambassador to Israel (1959–1961) and U.S. House of Representatives from New York's 26th (1963–1973) and 24th congressional district (1973–1975).Ogden R. Reid, Herald Tribune Editor and Congressman, Dies at 93 *Werner Schneyder, 82, Austrian director and actor (Das aktuelle sportstudio).Werner Schneyder - \"Ein scharfzüngiger politischer Kommentator ist gestorben\" *Beatriz Taibo, 86, Argentine actress (Millones de Semillita, Asunto terminado, Cuidado con las colas).Falleció Beatriz Taibo, una actriz de larga carrera en cine, teatro y televisión *Rafael Torija de la Fuente, 91, Spanish Roman Catholic prelate, Auxiliary Bishop of Santander (1969–1976) and Bishop of Ciudad Real (1976–2003).Fallece Rafael Torija, obispo emérito de Ciudad Real ===3=== *Peter Hurford, 88, British organist and composer, complications from Alzheimer's disease.The organist and choirmaster Peter Hurford has died ===4=== *King Kong Bundy, 61, American professional wrestler (WWF).WWE Legend King Kong Bundy Passes Away *Juan Corona, 85, Mexican-born American serial killer, complications from dementia.Sutter County serial killer Juan Corona dies *Robert DeProspero, 80, American Secret Service agent, complications from amyloidosis.Robert DeProspero, Secret Service agent who led Reagan's detail after assassination attempt, dies at 80 *Keith Flint, 49, English rock singer (The Prodigy), suicide by hanging.The Prodigy’s Keith Flint took own life, say “angry, confused and heartbroken” bandmates *Klaus Kinkel, 82, German politician, Minister of Justice (1991–1992), Foreign Affairs (1992–1998) and Vice Chancellor (1993–1998).Former German Foreign Minister Klaus Kinkel dies age 82 *Ted Lindsay, 93, Canadian Hall of Fame ice hockey player (Detroit Red Wings, Chicago Blackhawks), Stanley Cup winner (1950, 1952, 1954, 1955). *Luke Perry, 52, American actor (Beverly Hills, 90210, Riverdale, Buffy the Vampire Slayer), complications from a stroke.Luke Perry, ‘90210’ and ‘Riverdale’ Star, Dies at 52 *Jean Starobinski, 98, Swiss literary critic, member of the Académie des Sciences Morales et Politiques (until 2019).Décès du critique littéraire et psychiatre genevois Jean Starobinski ===5=== *Chu Shijian, 91, Chinese businessman (Hongtashan), complications from diabetes.China's 'tobacco king', Chu Shijian, dies aged 91 *Jacques Loussier, 84, French pianist and composer (Living It Up, Dark of the Sun, Thierry la Fronde).Hommage à Jacques Loussier ===6=== *John Habgood, 91, British Anglican bishop and educator, Bishop of Durham (1973–1983) and Archbishop of York (1983–1995).Former Archbishop of York John Habgood dies aged 91 *José Pedro Pérez-Llorca, 78, Spanish lawyer, diplomat and politician, Deputy (1977–1982) and Minister of Foreign Affairs (1980–1982), Father of the 1978 Constitution.Muere José Pedro Pérez-Llorca, uno de los padres de la Constitución a los 78 años *Carolee Schneemann, 79, American feminist visual artist, breast cancer.Carolee Schneemann Pioneering Feminist Artist Dies Age 79 ===7=== *Dick Beyer, 88, American professional wrestler (AJPW, NWA, AWA), World Champion.The Destroyer Dick Beyer dies *Joseph H. Boardman, 70, American railroad executive, President and CEO of Amtrak (2008–2016), complications from a stroke. *Robert Braithwaite, 75, British marine engineer and entrepreneur, founder of Sunseeker.Sunseeker founder Robert Braithwaite dies *Kelly Catlin, 23, American Olympic cyclist, suicide.Kelly Catlin passes away at 23 *Pino Caruso, 84, Italian actor (La governante, The Sunday Woman, Il ficcanaso), complications from Parkinson's disease.E' morto Pino Caruso, maschera siciliana e volto tv degli anni Settanta *Guillaume Faye, 69, French journalist and writer, lung cancer.È morto Guillaume Faye, l’uomo che ha cambiato il pensiero non conforme europeo *Ralph Hall, 95, American politician, member of the U.S. House of Representatives from Texas's 4th congressional district (1981–2015), cardiac arrest.Ralph Hall, Former Congressman from Rockwell, Dies at 95 *Dick Nichols, 92, American politician, member of the U.S. House of Representatives from Kansas's 5th congressional district (1991–1993), respiratory failure.Dick Nichols, Kansas’ last Fifth District congressman, ‘put service to others above self’ *Carmine Persico, 85, American mobster and convicted racketeer, head of Colombo crime family (1973–1990, since 1993), complications from diabetes.Carmine 'the Snake' Persico, Colombo crime family boss, dead at age 85 *Sid Sheinberg, 84, American lawyer and studio executive, President of Universal Pictures (1973–1995).Sid Sheinberg Dies: Former MCA President And COO Was Hollywood Giant ===8=== *Michael Gielen, 91, Austrian conductor (Royal Swedish Opera, Opern- und Schauspielhaus Frankfurt, Southwest German Radio Symphony Orchestra), pneumonia.Dirigent und Komponist Michael Gielen ist tot *Ian Lawrence, 82, New Zealand politician, Mayor of Wellington (1983–1986), stomach cancer.Former mayor of Wellington Ian Lawrence dies *Jason Reese, 51, British engineer.Obituary: Jason Reese, engineering scientist who made pioneering contributions to understanding the behaviour of gases ===9=== *Jed Allan, 84, American actor (Days of Our Lives, Santa Barbara, Lassie).Days Of Our Lives Star Jed Allan Dead at 84 *Alberto Bucci, 70, Italian basketball coach (Fortitudo Bologna, Virtus Bologna, Scaligera Verona), pancreatic cancer.Basket in lutto, è morto Alberto Bucci *Bernard Binlin Dadié, 103, Ivorian novelist, playwright and poet, Minister of Culture (1977–1986).Deuil : l'écrivain Bernard Dadié est décédé *Vladimir Etush, 96, Russian actor (Kidnapping, Caucasian Style, The Twelve Chairs, 31 June), People's Artist of the USSR (1984), heart failure.Умер актер Владимир Этуш *Harry Howell, 86, Canadian Hall of Fame ice hockey player (New York Rangers, Oakland Seals, Los Angeles Kings), complications from Alzheimer's disease.New York Rangers legend Harry Howell dies at 86 *Wenche Kvamme, 68, Norwegian actress (Fedrelandet, Offshore, Holms), breast cancer.Skuespiller Wenche Kvamme er død ===10=== *İrsen Küçük, 79, Cypriot politician, Prime Minister of Northern Cyprus (2010–2013), heart failure.KKTC eski Başbakanı İrsen Küçük hayatını kaybetti *William Powers Jr., 72, American educator, President of the University of Texas at Austin (2006–2015), complications from a fall.UT Mourns Former President William C. Powers Jr., Who Fought for the University’s Soul *Paul Talalay, 95, German-born American pharmacologist, member of the American Academy of Arts and Sciences (until 2019), congestive heart failure.Paul Talalay, researcher who found cancer-preventing qualities in broccoli, dies at 95 *Notable people who died in the Ethiopian Airlines Flight 302 plane crash: **Pius Adesanmi, 47, Nigerian-Canadian professor and writer.Pius Adesanmi dies in Ethiopian Airlines plane crash **Sebastiano Tusa, 66, Italian archaeologist and politician, Councillor for Cultural Heritage for Sicily (since 2018).Schianto Boeing Etiopia, assessore Tusa a bordo. Dal Kenya: \"Nessun sopravvissuto\" ===11=== *Hal Blaine, 90, American Hall of Fame rock drummer (The Wrecking Crew).Hal Blaine, Studio Drummer and Rock Hall of Fame Member, Dies at 90 *Martín Chirino, 94, Spanish sculptor, prostate cancer.Adiós a Martín Chirino, gran señor del hierro *Coutinho, 75, Brazilian football player (Santos, national team) and coach (São Caetano), World Champion (1962), heart attack complicated by diabetes.Brazil World Cup winner Coutinho dies *Leetsch C. Hsu, 98, Chinese mathematician and educator.深切缅怀我国著名数学家、教育家徐利治先生！ ===12=== *John Bardo, 70, American educator, President of Wichita State University (since 2012), lung disease.Wichita State president John Bardo remembered for transforming university *Eurico Miranda, 74, Brazilian football chairman (Vasco da Gama) and politician, Deputy (1995–2002), brain cancer.Ex- presidente do Vasco, Eurico Miranda morre aos 74 anos ===13=== *Frank Cali, 53, American mobster, head of Gambino crime family (since 2015), shot.Francesco Cali, Reputed Gambino Crime Boss, Shot and Killed on Staten Island *Beril Dedeoğlu, 57, Turkish politician, Minister of European Union Affairs (2015), cerebral hemorrhage.Turkish foreign policy adviser, Daily Sabah columnist Beril Dedeoğlu dies at age 58 *Harry Hughes, 92, American politician, Governor of Maryland (1979–1987), member of the Maryland House of Delegates (1955–1959) and Senate (1959–1971), problems caused by pneumonia.Ex- Maryland Gov. Harry R. Hughes dies at 92; served 2 terms *Ghazali Jaafar, 75, Filipino militant (Moro Islamic Liberation Front) and politician, Speaker of the Bangsamoro Parliament (since 2019), kidney failure.Ghazali Jaafar, Bangsamoro Transition Commission chairman, dies *Alberto Lois, 62, Dominican baseball player (Pittsburgh Pirates), stomach cancer.Fallece Alberto Lois, exjardinero de las Águilas *Andrea Pollack, 57, German swimmer, Olympic champion (1976, 1980), pancreatic cancer.Dreimalige Olympiasiegerin im Schwimmen verstorben *Leroy Stanton, 72, American baseball player (New York Mets, California Angels, Seattle Mariners), car crash.Coroner identifies 72-year-old man killed in Florence crash ===14=== *Birch Bayh, 91, American politician, U.S. Senator (1963–1981) and member of the Indiana House of Representatives (1958–1960), author of Title IX, 25th and 26th Amendments, presidential candidate (1976), pneumonia.Former U.S. Sen. Birch Bayh Dies At 91 *Godfried Danneels, 85, Belgian cardinal, Archbishop of Mechelen-Brussels (1979–2010).Kardinaal Godfried Danneels overleden *Ralph Metzner, 82, American psychologist.Pionier im Weltraum der Seele: Ralph Metzner R.I.P *Ilona Novák, 93, Hungarian swimmer, Olympic champion (1952).Meghalt Novák Ilona *Sir William Stanley Peart, 96, British medical researcher.Sir William Stanley Peart *Charlie Whiting, 66, British motorsports director, FIA Formula 1 race director (since 1997), pulmonary embolism.FIA Statement - Charlie Whiting ===15=== *Okwui Enwezor, 55, Nigerian art critic and writer, colorectal cancer.Okwui Enwezor, Pivotal Curator of Contemporary Art, Is Dead at 55 *Dave Hood Jr., 64, American politician, member of the Florida House of Representatives (2012–2014), brain cancer. *Wiesław Kilian, 66, Polish politician, member of the Sejm (2005–2007, since 2010), cardiac arrest.Zmarł Wiesław Kilian, senator VIII i IX kadencji *W. S. Merwin, 91, American poet, Pulitzer winner (1971, 2009) and Poet Laureate (2010), heart attack. ===16=== *Kurt Armbruster, 84, Swiss footballer (Lausanne, national team).Der SFV trauert um Kurt Armbruster *Dick Dale, 81, American guitarist and surf music pioneer (\"Let's Go Trippin'\", \"Miserlou\"), heart failure.Dick Dale, King of Surf Guitar, Dead at 82 *Richard Erdman, 93, American actor (Community, Stalag 17, Tora! Tora! Tora!), complications from dementia.Richard Erdman, Actor in 'Stalag 17' and TV's 'Community,' Dies at 93 *Bengt Gustafsson, 85, Swedish military officer, Supreme Commander of the Armed Forces (1986–1994).Förre ÖB Bengt Gustafsson har avlidit *Barbara Hammer, 79, American movie director (Nitrate Kisses, Tender Fictions), ovarian cancer.Barbara Hammer, Pioneering Queer Experimental Filmmaker, Dead at 79 *Tom Hatten, 92, American actor (The Secret of NIMH, Spies Like Us) and television personality.Tom Hatten Dies: Former ‘Popeye and Friends’ & ‘Family Film Festival’ Host Was 92 *Yann-Fañch Kemener, 61, French singer-songwriter.Yann-Fañch Kemener, voix de la gwerz et du kan-ha-diskan est décédé *Alan Krueger, 58, American economist, Chair of the Council of Economic Advisers (2011–2013), suicide.Princeton's Krueger, Ex- Economic Aide to Obama, Dies at 58 *Mohamed Mahmoud Ould Louly, 76, Mauritanian military officer and politician, Chairman of the Military Committee for National Salvation (1979–1980).Mauritanie: décès de l’ancien président Mohamed Mahmoud ould Louly *Yulia Nachalova, 38, Russian singer, actress (Guerói yeio romana, Bomba dlia nevesty, Los tres mosqueteros) and television presenter, cerebral edema.Умерла Юлия Началова ===17=== *Ken Bald, 98, American illustrator and comic book artist (Dr. Kildare).Ken Bald – RIP *Bill Burlison, 88, American politician, member of the U.S. House of Representatives from Missouri's 10th congressional district (1969–1981).Bill D. Burlison *René Fontès, 77, French rugby executive and politician, President of ASM Clermont Auvergne (2004–2013) and Mayor of Eygalières (since 2008), heart attack.Clermont : René Fontès, ancien président de l'ASM, est mort à 77 ans *Jorge Insunza Becker, 82, Chilean engineer and politician, Deputy (1969–1973), stroke.Fallece a los 82 años ex diputado del PC Jorge Insunza Becker *Olavi Mannonen, 89, Finnish modern pentathlete, Olympic silver medalist (1956) and bronze medalist (1952, 1956).Olavi Mannonen In Memoriam *Manohar Parrikar, 63, Indian politician, MP (2014–2017), Minister of Defence (2014–2017) and Chief Minister of Goa (2000–2005, 2012–2014, since 2017), pancreatic cancer.Manohar Parrikar, Three-Time Chief Minister Who Remained Rooted To Goa *Yuya Uchida, 79, Japanese singer (Flower Travellin' Band) and actor (Merry Christmas, Mr. Lawrence, Black Rain), pneumonia.歌手で俳優の内田裕也さん（79）が死去 *Andre Williams, 82, American R&B; musician (\"Shake a Tail Feather\"), colorectal cancer.Andre Williams, Rap Godfather, Dead at 82 ===18=== *Egon Balas, 96, Romanian mathematician.Remembering Egon Balas *György Baló, 71, Hungarian broadcaster (Magyar Televízió), esophageal cancer.Meghalt Baló György *John Carl Buechler, 66, American visual effects artist, actor (Hatchet) and movie director (Troll, Friday the 13th Part VII: The New Blood), prostate cancer.Legendary Horror Director and SFX Artist John Carl Buechler Dies at 66 *Jerrie Cobb, 88, American aviator, member of the Mercury 13.Jerrie Cobb, one of the most gifted female pilots in history, has died *Pioneerof the Nile, 13, American racing thoroughbred, heart attack.Sire of Triple Crown winner American Pharoah dies at 13 *Kenneth To, 26, Hong Kong- born Australian swimmer, FINA Swimming World Cup overall winner (2012), Youth Olympics champion (2010), cardiac arrest.Coroner's Report: Swimmer Kenneth To's Passing Ruled Sudden Cardiac Death ===19=== *Boris Dubrovin, 68, Russian mathematician, amyotrophic lateral sclerosis.Remembering Boris Dubrovin *Chuck Harmon, 94, American baseball player (Cincinnati Redlegs, St. Louis Cardinals, Philadelphia Phillies).Chuck Harmon, first African-American Reds player, dead at 94 *Marlen Khutsiev, 93, Georgian-born Russian movie director (I Am Twenty, July Rain, Infinitas), People's Artist of USSR (1986).Скончался Марлен Хуциев *Bill Phelps, 84, American politician, Lieutenant Governor of Missouri (1972–1980).Former Missouri lt. Gov Bill Phelps has died ===20=== *Noel Hush, 94, Australian chemist.Passing of eminent scientist Professor Noel Hush *Donald Kalpokas, 75, ni-Vanuatu politician, Prime Minister (1991, 1998–1999).A founding father of Vanuatu dies *Randy Jackson, 93, American baseball player (Chicago Cubs, Brooklyn/Los Angeles Dodgers, Cleveland Indians).Ransom Jackson, hit last home run for Brooklyn Dodgers, dies at 93 *Terje Nilsen, 67, Norwegian singer-songwriter (\"Mjelle\"), lung cancer.Terje Nilsen er død *Mary Warnock, Baroness Warnock, 94, British philosopher and educator, Chair of the Human Fertilisation and Embryology Act 1990 Inquiry and Mistress of Girton College, Cambridge (1984–1991).Philosopher Mary Warnock dies aged 94 ===21=== *Roger Moore, 79, American computer scientist and philanthropist.Toronto Arts Philanthropist Roger D. Moore Dies At 79 *Gonzalo Portocarrero Maisch, 69, Peruvian sociologist, lung cancer.Falleció el ensayista peruano Gonzalo Portocarrero *Francis Quinn, 97, American Roman Catholic prelate, Bishop of Sacramento (1980–1993).Sacramento’s Bishop Quinn, oldest living Catholic bishop in America, dies ===22=== *Frans Andriessen, 89, Dutch politician, Minister of Finance (1977–1980) and European Commissioner (1981–1993).Voormalig minister en Eurocommissaris Frans Andriessen (89) overleden *César Lévano, 92, Peruvian journalist and teacher.El periodista César Lévano falleció a los 92 años *Jim Moody, 83, American politician, member of the U.S. House of Representatives from Wisconsin's 5th congressional district (1983–1993).Former U.S. Rep. Jim Moody, a fixture of Wisconsin Democratic politics, dies at 83 *Arlen Ness, 79, American motorcycle designer and entrepreneur.Arlen Ness Passes – 1939-2019 *Scott Walker, 76, American- born British singer-songwriter (The Walker Brothers), composer and record producer, cancer.Scott Walker death: Singer-songwriter and producer called 'pop's own Salinger' dies aged 76 ===23=== *Lina Cheryazova, 50, Uzbek freestyle skier, Olympic champion (1994), complications from ALS.Former Olympic aerials champ Cheryazova dies *Larry Cohen, 77, American movie director (It's Alive, The Stuff) and screenwriter (Phone Booth).Larry Cohen, Writer-Director of 'It's Alive' and 'Hell Up in Harlem,' Dies at 77 *Denise DuBarry, 63, American actress (Black Sheep Squadron, Being There) and businesswoman, fungal infection.Denise DuBarry Hay Film Industry Leader Dies From Deadly Fungus at Age 63 *Rafi Eitan, 92, Israeli intelligence officer and politician, member of the Knesset (2006–2009) and Minister of Pensioner Affairs (2006–2009), stroke.Rafi Eitan passes away at 93 *Howard V. Lee, 85, American lieutenant colonel (Vietnam War), Medal of Honor recipient (1966).Medal of Honor Recipient Howard V. Lee Passes Away at 85 ===24=== *Virgilio Caballero Pedraza, 77, Mexican journalist and politician, Federal Deputy (2015–2018, since 2018), heart attack.Muere Virgilio Caballero, periodista y diputado local *Pancracio Celdrán, 77, Spanish professor and journalist.En la muerte de Pancracio Celdrán Gomariz *Joseph Pilato, 70, American actor (Day of the Dead, Pulp Fiction, Digimon).‘Day of the Dead’ Scene-Stealer Joseph Pilato Has Died at 70 *Robert W. Sweet, 96, American judge, U.S. District Judge for the Southern District of New York (since 1978), pneumonia.Manhattan Federal Judge Robert Sweet Dies At Age 96 ===25=== *Len Fontaine, 71, Canadian ice hockey player (Detroit Red Wings). *Stylianos Harkianakis, 83, Australian Greek Orthodox prelate, Archbishop of Australia (since 1975).Greek Orthodox Archbishop of Australia Stylianos Harkianakis passes away aged 83 *Barrie Hole, 76, Welsh footballer (Cardiff City, Aston Villa, national team).Funeral Notices - Barrie HOLE *Lyle Tuttle, 87, American tattoo artist.San Francisco's 'father of modern tattooing' dies at age 87 ===26=== *Ted Burgin, 91, British football player (Sheffield United, Leeds United, Rochdale) and manager.Sheffield set to pay tribute to legendary goalkeepeer Ted Burgin who has died at 91 *Master Fatman, 53, Danish comedian, movie director (Gayniggers from Outer Space) and singer.Master Fatman er død *Andrew Marshall, 97, American military and diplomatic advisor, director of Office of Net Assessment (19732015).Andrew Marshall, Pentagon's Threat Expert, Dies at 97 *Ali Mema, 76, Albanian footballer (Tirana, national team) and manager.Futbolli shqiptar në zi, ndahet nga jeta Ali Mema *W. H. Pugmire, 67, American writer (A Clicking in the Shadows and Other Tales), complications from a heart attack.W.H. Pugmire (1951-2019) *Ranking Roger, 56, British singer (The Beat, General Public), brain and lung cancer.Ranking Roger, of English Beat and General Public, Dies at 56 *Redoute's Choice, 22, Australian racehorse, euthanised.Champion sire Redoute's Choice dies ===27=== *Friedrich Achleitner, 88, Austrian poet and architecture critic.Friedrich Achleitner ist tot *Pierre Bourguignon, 77, French politician, Deputy (1981–1993, 1997–2012), mayor of Sotteville-lès-Rouen (1989–2014), heart attack.Le décès de l'ex député maire de Sotteville-lès-Rouen, Pierre Bourguignon *Valery Bykovsky, 84, Russian cosmonaut (Vostok 5, Soyuz 22, Soyuz 31). *Abdul Latif Dayfallah, 89, Yemeni military officer and politician, Prime Minister (1963, 1975).الإعلان عن وفاة ثان رئيس حكومة للجمهورية العربية اليمنية (سيرة ذاتية) *Yoji Harada, 46, Japanese tattoo artist and reality show personality (Miami Ink).Yoji Harada death: Tattoo Artist and Miami Ink star dead at 46 *Akihito Kondo, 80, Japanese baseball player (Taiyō Whales) and coach (Yomiuri Giants).横浜、ロッテ元監督の近藤昭仁氏が死去 80歳 *Bruce Yardley, 71, Australian Test cricketer, cancer.Former Australian cricketer Bruce Yardley dies ===28=== *Domenico Giannace, 94, Italian trade unionist and politician, member of the Regional Council of Basilicata (1980–1985).Messaggio di cordoglio per la perdita di Domenico 'Mingo' Giannace *Jon Skolmen, 78, Norwegian actor (Sällskapsresan, Hodet over vannet).Skuespiller og komiker Jon Skolmen er død, 78 år gammel *Henry Stern, 83, American politician, member of the New York City Council (1974–1983) and Commissioner of the New York City Department of Parks and Recreation (1983–1990, 1994–2000), complications from Parkinson's disease.Henry J. Stern Whose Vast Urban Domain Was Green Dies at 83 *Wong Tien Fatt, 64, Malaysian politician, MP (since 2013), heart attack.Sandakan MP Stephen Wong dies of heart attack ===29=== *Dobrica Erić, 82, Serbian writer and poet, lung cancer.Preminuo Dobrica Erić *Kenneth A. Gibson, 86, American politician, Mayor of Newark, New Jersey (1970–1986).Ken Gibson, Newark's First Black Mayor, Has Died *Jon Østeng Hov, 83, Norwegian photographer and columnist (Adresseavisen).Jon Østeng Hov er død *Harry Kesten, 87, German- born American mathematician.Probability expert Harry Kesten, Ph.D. ’58, dies at 87 *Shane Rimmer, 89, Canadian-born British actor (Thunderbirds, The Spy Who Loved Me, Dr. Strangelove).Shane Rimmer dead: Voice of Thunderbirds and James Bond star dies aged 89 *Agnès Varda, 90, French movie director (Cléo from 5 to 7, Le Bonheur, Vagabond), cancer.\"Agnès Varda, Leading Light of French New Wave, Dies at 90\" *Ed Westcott, 97, American photographer (Manhattan Project).Ed Westcott, photographer for the Manhattan Project, passes away ===30=== *Ron Elvidge, 96, New Zealand rugby union player (Otago, national team).ABs, Otago rugby great Ron Elvidge dies *Geoff Harvey, 83, English-Australian musician and television personality (The Mike Walsh Show, Midday).Nine’s musical maestro Geoff Harvey dies aged 83 *Tania Mallet, 77, English model and actress (Goldfinger).Tania Mallet dead: Goldfinger Bond girl dies aged 77 *Ruben Tovmasyan, 82, Armenian politician, First Secretary of the Armenian Communist Party (2005–2014), thyroid cancer.Ռուբեն Թովմասյան ===31=== *Peter Coleman, 90, Australian politician and writer, Leader of the New South Wales Opposition (1977–1978) and member of the House of Representatives (1981–1987).Truly great man of letters: Writer, intellectual and former politician Peter Coleman dies, aged 90 *Ralph S. Greco, 76, American surgeon, prostate cancer.Ralph Greco, pioneering advocate of work- life balance for surgery trainees, dies at 76 *Nipsey Hussle, 33, American rap artist (\"Feelin' Myself\", \"FDT\"), shot.Rapper Nipsey Hussle killed in shooting outside his L.A. store *Eva Moser, 36, Austrian chess player, leukaemia.Eva Moser (July 26, 1982 - March 31, 2019) has died at 36 *Kit Napier, 75, Scottish footballer (Brighton & Hove Albion, Blackburn Rovers).Obituary: Kit Napier, Scottish footballer who found success at Brighton and Hove Albion *Hedi Turki, 96, Tunisian painter.Décès du grand peintre Hédi Turki : Une grande figure de l'Ecole de Tunis ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *3 Deaths",
 "title": "Deaths in March 2019"
}