{
 "id": "683221",
 "text": "Channel catfish Conservation status Least Concern (IUCN 3.1)NatureServe (2015). \"Ictalurus punctatus\". IUCN Red List of Threatened Species. Version 4.1 (4.1). International Union for Conservation of Nature. Scientific classification Kingdom: Animalia Phylum: Chordata Class: Actinopterygii Order: Siluriformes Family: Ictaluridae Genus: Ictalurus Species: I. punctatus Binomial name Ictalurus punctatus (Rafinesque, 1818) Distribution of Ictalurus punctatus Synonyms * Silurus punctatus Rafinesque, 1818 The channel catfish (Ictalurus punctatus), also called the channel cat, is a species of catfish. It's the official fish of several US states, which are Kansas, Missouri, Iowa, Nebraska, and Tennessee. In the US, it is the most fished catfish species. It has also been introduced in Europe, Asia and South America, and it's legally considered an invasive species in many countries. == Characteristics == These fish have a very keen sense of smell and taste. At the pits of their nostrils are sensitive odor-sensing organs with a high concentration of olfactory receptors. The barbels of a channel catfish don't actually sting. This is believed by most people to be false. However, these catfish do have spines on their pectoral and dorsal fins. If you do not handle these properly, you'll most likely have injury. === Length and weight === Channel catfish have a top-end size of about 40–50 pounds (18–23 kg). The record-breaking channel cat weighed 58 pounds, and was caught in the Santee- Cooper Reservoir in South Carolina, on July 7, 1964. As channel catfish grow longer, they increase in weight. == Ecology == === Feeding === Channel catfish have a lot of taste perception, hence called the swimming tongue, due to the presence of taste buds all over the external body surface and inside the oropharyngeal cavity. === Communication === This fish is adapted to limited light conditions. Members of the genus Ictalurus do not depend solely on visual cues. ==== Predator communication ==== Channel catfish can communicate to predators. Pectoral stridulation has been considered to be the main means of agonistic communication towards predators in channel catfish. Relatively noisy sounds are used to startle and scare predators in a manner analogous to the well-documented, visual flash display of various lepidopterans. === Hearing === The utricle is the primary area of hearing in most fishes (in this case, the channel catfish). The hearing ability is enhanced by the presence of the swim bladder. It is the part that reverberates the echo from other’s sounds. ==References== == Other websites == * Froese, Rainer; Pauly, Daniel (eds.) (2011). \"Ictalurus punctatus\" in FishBase. December 2011 version. Category:IUCN Red List least concern species Category:Freshwater fish Category:Catfish Category:Articles with 'species' microformats Category:Symbols of Kansas",
 "title": "Channel catfish"
}