{
 "id": "68389",
 "text": "Sir Philip Pullman CBE FRSL (born Norwich, England, 19 October 1946) is an English writer. He is the best-selling author of His Dark Materials, a trilogy of fantasy novels, and a number of other books. In 2008, The Times named Pullman in its list of \"The 50 greatest British writers since 1945\".The 50 greatest British writers since 1945 . 5 January 2008. The Times. Retrieved on 2010-02-05.One of the greatest books to come around in the 20th century == Perspective on religion == Pullman is a supporter of the British Humanist Association and an Honorary Associate of the National Secular Society. New Yorker journalist Laura Miller has described Pullman as one of England's most outspoken atheists, although Pullman describes himself as an agnostic. On 15 September 2010, Pullman along with 54 other public figures signed an open letter, published in The Guardian newspaper, stating their opposition to Pope Benedict XVI being given \"the honour of a state visit\" to the UK, arguing that he has led and condoned global abuses of human rights. The letter says \"The state of which the pope is head has also resisted signing many major human rights treaties and has formed its own treaties (\"concordats\") with many states which negatively affect the human rights of citizens of those states\". Other signers included Stephen Fry, Professor Richard Dawkins, Terry Pratchett, Jonathan Miller and Ken Follet. == Bibliography == ===Non-series books=== *1972 The Haunted Storm *1976 Galatea *1982 Count Karlstein *1987 How to be Cool *1989 Spring-Heeled Jack *1990 The Broken Bridge *1992 The White Mercedes *1993 The Wonderful Story of Aladdin and the Enchanted Lamp *1995 Clockwork, or, All Wound Up *1995 The Firework-Maker's Daughter *1998 Mossycoat *1998 The Butterfly Tattoo (re-issue of The White Mercedes) *1999 I was a Rat! or The Scarlet Slippers *2000 Puss in Boots: The Adventures of That Most Enterprising Feline *2004 The Scarecrow and his Servant ===The New-Cut Gang=== *1994 Thunderbolt's Waxwork *1995 The Gasfitter's Ball ===Sally Lockhart=== *1985 The Ruby in the Smoke *1986 The Shadow in the North (first published as The Shadow in the Plate) *1990 The Tiger in the Well *1994 The Tin Princess ===His Dark Materials=== *1995 Northern Lights, retitled The Golden Compass in the US *1997 The Subtle Knife *2000 The Amber Spyglass ====Companion books==== *2003 Lyra's Oxford *2009 The Book of Dust ===Plays=== *1990 Frankenstein *1992 Sherlock Holmes and the Limehouse Horror ===Non- fiction=== *1978 Ancient Civilisations *1978 Using the Oxford Junior Dictionary == References == Category:1946 births Category:Living people Category:Agnostics Category:English novelists Category:Writers from Norwich",
 "title": "Philip Pullman"
}