{
 "id": "684474",
 "text": "A fountain pen is a pen which has a nib and a reservoir of ink. The pen draws ink from the reservoir through a feed to the nib. The ink travels by a combination of gravity and capillary action. The nib is the part of the pen that writes on the paper. Different shapes and styles of nibs can change the amount of ink distributed and the thickness of your writing line. Most fountain pens have replaceable nibs. They can come in many different materials and styles and are ranked from extra-fine to extra broad. Filling the reservoir with ink may be done manually, by a Pasteur pipette (eyedropper) or syringe. However, usually it is done by an internal filling mechanism which creates suction. A piston mechanism or a vacuum transfers ink directly through the nib into the reservoir. Some pens have removable reservoirs in the form of pre-filled ink cartridges.Binder, Richard. Filling systems: overview of how they work and how to fill them. == Nibs == According to Mathur \"the modern fountain pen nib may be traced back to the original gold nib which had a tiny fragment of ruby attached to form the wear-point\". Nibs tipped with platinum group alloys such as iridium have been used since the 1830s. Today, the main part of the nib are usually made of stainless steel and/or gold The most popular gold content is 14 carat (58⅓%) and 18 carat (75%). The idea is that the nib should be flexible yet firm, and the tip extremely hard-wearing. == Ink reservoir == Until the early 20th century, the ink in a fountain pen was kept directly in the barrel. The slim barrels were made of hard rubber, which came in two colours, black and red. Ink was put in these barrels with an eye- dropper. To do this, the user had to take off the nib section, put the ink in and replace the nib section. This operation required a quiet secluded place, which some people might not have. In 1907, Walter A. Sheaffer patented the lever filler. This used a hinged lever set into the pen barrel which pressed down onto a bar which in turn compressed a rubber sac inside, creating a vacuum which pulled ink into the pen. This could be done without removing the nib section. Introduced in 1912, this innovation was rapidly imitated by the other major pen makers. Parker introduced the button filler, which had a button hidden beneath a blind cap on the end of the barrel. When pressed, it acted on a pressure bar inside to depress the ink sac. Many other firms used a lever set flat along the barrel, which, when pulled, squeezed the rubber sac. It was the rubber sac which made all the difference between the founain pens of the 19th century and those of the 20th century.Lever look back. Other firms used a screw mechanism at the top end of the pen to squeeze the rubber sac. == References == Category:Writing tools",
 "title": "Fountain pen"
}