{
 "id": "685036",
 "text": "The Christchurch mosque shootings were two terrorist mass shootings at two mosques in Christchurch, New Zealand on 15 March 2019. They were committed by Brenton Tarrant who entered the two mosques during Friday prayer, firstly at the Al Noor Mosque where he murdered 44 people and wounded 35 others and later at the Linwood Islamic Centre where 7 were killed and 5 were wounded, in total 51 Muslim worshippers were killed and 40 were wounded. Tarrant was arrested after his vehicle was rammed by a police car when he was driving to a third mosque in Ashburton. He live-streamed the first shooting on Facebook and had published a 74-page manifesto titled The Great Replacement online before the attack. On 26 March 2020, he pled guilty to 51 murders, 40 attempted murders, and engaging in a terrorist act, and in August was sentenced to 52 life sentences without the possibility of parole plus 480 yearsthe first sentence of that kind in New Zealand. The attacks were mainly motivated by white nationalist and anti-immigration beliefs. Tarrant called himself as a fascist and supported the far-right Great Replacement conspiracy theory and for all non-European immigrants to be removed from countries that he considered culturally and ethnically European. == Perpetrator == Brenton Harrison Tarrant, a white Australian man was born on 27 October, 1990 and grew up in Grafton, New South Wales, was 28-years old when he committed the attacks. He attended Grafton High School. Tarrant had a troubled childhood, starting when his parents separated, his grandfather died and their family home was burnt down in a fire. These events traumatized him and left him with social anxiety disorder, which likely worsened when his mother's new partner assaulted him, his sister and mother. He began to gain weight from age 12, because of this he started getting bullied at school, where he also had few friends. He was unfocused at school but also strangely familiar with topics like World War II. Tarrant showed signs of racism and worries about immigration as young as 12 years old. He frequently made racist comments about his mother's former partner's Indigenous Australian heritage, which worried his high school teachers. Tarrant began using 4chan at the age of 14, a site known for sharing extremist content, and started obsessively excercising to lose weight. In 2009, Tarrant qualified as a personal trainer at Big River Gym in Grafton. The next year, he found his father dead by suicide. Following this, he inherited A$457,000 from his father, he stopped working as a personal trainer, and he used the money to invest and travel across the world. === Travels and connections to far-right groups === Starting in 2012, he went to several countries, always alone except for a visit to North Korea where he was required to travel with a tour guide and other visitors. In March 2013, he travelled to New Zealand for a vacation, where he stayed with a friend for three days for gaming. The friend and his parents were gun users. They took Tarrant to a shooting club where he had his first experience with guns. Police in Bulgaria and Turkey investigated Tarrant's visits to their countries. Security officials suspected that he went into contact with far-right organizations about two years before the shootings, while visiting European nations. He donated €1,500 to Identitäre Bewegung Österreich, an Austrian Identitarian movement organization in Europe, and also €2,200 to Génération Identitaire, the French branch of the group, and spoke with group leader Martin Sellner using e-mail in January 2018 and July 2018, hoping to meet Tarrant in Vienna and a linking to his YouTube channel.Multiple sources: * * * When he was preparing the attacks, Tarrant made a donation of $106.68 to Rebel Media, a site that showed both Sellner and several articles discussing the \"white genocide\" and \"Great Replacement\" conspiracy theories. In 2016, three years before the attacks, Tarrant praised Blair Cottrell as a leader of the far-right movements in Australia and left more than 30 comments on the now- deleted \"United Patriots Front\" and \"True Blue Crew\" websites. A Melbourne man said that in 2016, he filed a police complaint after Tarrant told him in an online conversation, \"I hope one day you meet the rope\". He said that the police told him to block Tarrant. The police said that they didn't find a complaint. Tarrant told investigators that he frequented right-wing discussion boards on 4chan and 8chan and also found YouTube to be \"a significant source of information and inspiration.\" Interested in locations of battles between Christian European nations and the Ottoman Empire, Tarrant went on another series of visits to the Balkans from 2016 to 2018, with Croatia, Bulgaria, Romania, Hungary, Turkey, and Bosnia-Herzegovina. He posted Balkan nationalist material on social media platforms and called for the United States to be weakened to prevent what he saw as NATO intervention in support of Muslims against Christians. He said he was against intervention by NATO because he saw the Serbian military as \"Christian Europeans attempting to remove these Islamic occupiers from Europe\". By June 2016, his family saw a change in Tarrant's personality, which he said was the result of a mugging incident in Ethiopia, and his mother was worrying for his mental health. === Settlement in New Zealand === Tarrant moved to New Zealand in August 2017 and lived in Andersons Bay in Dunedin until the shootings. A neighbour described him as a friendly loner. He was a member of a gun club in southern Otago, where he practised shooting at its range. In 2018, Tarrant was treated for eye and thigh injuries at Dunedin Hospital; he told doctors he got the injuries when he tried to remove an improperly chambered bullet from a gun. The doctors also treated him for steroid abuse, but never reported Tarrant's visit to the authorities, which would have led in police rechecking his health to have a gun license. When living in Dunedin, Tarrant had no job and bought necessities and preparations for the terrorist attack using the money he received from his father and income from investments. When asked, he gave no explanation for his future plans once he ran out of money other than mentioning to his sister the possibility of suicide and later telling family members and gaming friends that he planned to move to Ukraine. Tarrant believed he would run out of his money by August 2019. A document, dated January 2019, was discovered which he wrote \"March is go do rain or shine\". == Planning == In 2016 and 2017, Tarrant is believed to have become obsessed with terrorist attacks committed by Islamic extremists and he started planning his own attacks in 2017 then chose the Al Noor Mosque and Linwood Islamic Centre as targets in December 2018, along with a third mosque in Ashburton which he got arrested before being able to go to during the attacks. Some survivors at the Al Noor Mosque said they saw Tarrant there on Friday prayers before the attack, pretending to pray and asking about the mosque's schedules. The Royal Commission report found no evidence of this, and police said that Tarrant had instead looked at an online tour of the mosque as part of his planning. On 8 January 2019, Tarrant used a drone from a nearby park to look at the outside of the mosque. He used the internet to find pictures of the inside and prayer schedules to figure out when the mosques would have the most people. On the same day, he drove past the Linwood Islamic Centre. === Weaponry === Police found six guns after the shootings: two AR-15 style rifles, two 12-gauge shotguns, a lever-action rifle and bolt-action rifle. Tarrant was granted a gun license in November 2017, and he bought weapons between December 2017 and March 2019, along with more than 7,000 rounds of ammunition. According to a gun shop, Tarrant bought four guns and ammunition online. The shop said they did not see anything strange about him. He used four 30-round magazines, five 40-round magazines, and one 60-round magazine in the shootings. He illegally used higher capacity magazines which went against the rules of Tarrant's gun license. He spent an estimated NZ$30,000 on gun products. The guns and magazines used were covered in the names of battles and people from history, battles between Christian nations and Islamic nations, as well as the names of recent Islamic terrorist attack victims and the names of similar attackers like Alexandre Bissonnette, Luca Traini, Anton Lundin-Pettersson Darren Osbourne. Other words written on the gun include \"Turkofagos\" (, ; this was the nickname of Nikitas Stamatelopoulos during battles in the Greek War of Independence), far-right slogans such as the anti-Muslim phrase \"Remove Kebab\" that comes from Serbia and the Fourteen Words. The Archangel Michael's Cross used by the Romanian fascist organization Iron Guard was one the symbols on the gun. On his armored vest was a Black Sun patch and two dog tags: one with a Celtic cross, and one with a Kolovrat design. His armored vest had seven loaded .223 magazines in the front pockets. He also wore an airsoft helmet with a GoPro camera on it which he used for his live stream. Police also found four incendiary devices in his car after the attack; they were defused by the New Zealand Defence Force. He said, on the livestream, that he had planned to set the mosque on fire. === Manifesto === Tarrant says he is the author of a 74-page manifesto titled The Great Replacement, a reference to the \"Great Replacement\" and \"white genocide\" conspiracy theories. It said that the attacks were planned in 2017 and the locations were selected three months before. Minutes before the attacks began, the manifesto was emailed to more than 30 people, including the prime minister's office and several media outlets, and links were posted on Twitter and 8chan. Seven minutes after Tarrant sent the manifesto to parliament, it was forwarded to the parliament security team, who called the police at 1:40p.m., around the same time the first 111 calls were made from the Al Noor Mosque. In the manifesto, several anti-immigrant ideas are said, including hate speech against migrants, white supremacist beliefs and the plan for all non-European immigrants in Europe that he claimed to be \"invading his land\" to be deported. The manifesto displays neo-Nazi symbols such as the Black Sun and the Odin's cross. He says he isn't a Nazi, instead he says he is a fascist.Multiple sources: * * * * The author said terrorists Anders Behring Breivik and Dylann Roof were an inspiration. He says he agrees with British Union of Fascists leader Oswald Mosley. The author says he first planned to attack the Al Huda Mosque in Dunedin but changed his mind after visiting Christchurch. Tarrant also told readers to assassinate German Chancellor Angela Merkel, Turkish President Recep Tayyip Erdoğan and London Mayor Sadiq Khan. Tarrant said three moments gave him his ideas. The first was the murder of an 11-year-old girl, Ebba Åkerlund, in the 2017 Stockholm attack on 7 April 2017. (Her name was part of the graffiti written on the gun he used to commit the shooting). He also said the loss of Marine Le Pen in the 2017 French presidential election was \"evidence\" that the chance of a democratic solution to stop non-European immigration had \"vanished\". The third event was his trip to France where he had a strong emotional response to his belief that the French had become a minority in their own country. He was also moved by visiting a military cemetery: \"my despair turned to shame, my shame to guilt, my guilt to anger and my anger to rage\". ==Attacks== At 1:32p.m., Tarrant started his live-stream that played for 17 minutes on Facebook Live, starting with the drive to the Al Noor Mosque and ending as he drove away. Just before the shooting, he played songs, including \"Serbia Strong\", a Serbian nationalist and anti-Muslim song; and \"The British Grenadiers\", a British military marching song. === Al Noor Mosque === At 1:39p.m., Tarrant parked his car in the driveway next to the Al Noor Mosque. He then armed himself with the Mossberg 930 and Windham Weaponry AR-15 rifle before walking towards the mosque. At 1:40p.m., Tarrant approached the mosque and fired his shotgun nine times towards the front entrance, killing four worshippers. He dropped the shotgun and shot people inside with the AR-15, killing two men down a hallway near the entrance and even more inside a prayer hall.Multiple sources: * * * A worshipper, Naeem Rashid charged at Tarrant and knocked him down, dislodging a magazine from his vest in the process, but he was then shot several times and fatally wounded. Rashid was posthumously awarded the Nishan-e-Shujaat and the New Zealand Cross, the highest awards of bravery in Pakistan and New Zealand, respectively. Tarrant fired at worshippers in the prayer hall and went outside, where he killed a man, discarded his Windham WW-15 and retrieved a Ruger AR-556 AR-15 from his car. He went to the mosque's gate and killed two people in the car park who were hiding behind cars. He went back in the mosque and shot wounded people, then went outside again, where he killed a woman near his car before driving over her, leaving six minutes after he first got to the mosque. He shot at worshippers who had escaped from the mosque through the windscreen and closed window of his own car using a Remington Model 870 as was driving to the Linwood Islamic Centre. At 1:46p.m., police arrived to the mosque just as Tarrant was leaving, but his car was hidden by a bus, and at the time it was unknown what his car looked like or whether or not he had even left. At 1:51p.m., the livestream ended due to a bad connection, he aimed a shotgun at the driver of a vehicle and tried to fire it twice, but it failed to fire. The GoPro camera on Tarrant's helmet kept recording until he was arrested by police eight minutes later. ===Linwood Islamic Centre=== At 1:52p.m., Tarrant got to the Linwood Islamic Centre, east of the Al Noor Mosque, where about 100 people were inside. He parked his car on the driveway, preventing other cars from getting in or out. According to a witness, he couldn't find the mosque's main door and shot people outside and through a window, killing four people. A worshipper named Abdul Aziz Wahabzada ran outside when Tarrant was getting another gun from his car, Aziz threw a credit card reader at him. Tarrant shot at Aziz, who picked up an empty shotgun that Tarrant dropped. He hid behind cars and tried to get Tarrant's attention by shouting. Regardless, Tarrant went into the mosque, where he shot and killed three people. When Tarrant got back to his car, Aziz came up to him again. Tarrant took a bayonet from his vest but then retreated into his car instead of attacking Aziz. Tarrant drove away at 1:55p.m., with Aziz throwing the shotgun at his car.Multiple sources: * * * Aziz was awarded the New Zealand Cross, New Zealand's highest award for bravery. In May 2023, he represented recipients of the Cross at the coronation of Charles III and Camilla. After being left unused, Linwood Islamic Centre was demolished in November 2023. === Tarrant's arrest === A silver 2005 Subaru Outback matching the description of Tarrant's car was seen by a police officer, and a chase was initiated at 1:57p.m. Two police officers rammed his car off of the road with their police car, and Tarrant was arrested without struggle on Brougham Street in Sydenham at 1:59p.m., 18 minutes after the first emergency call. Police found the four incendiary devices in his car; they were defused by the New Zealand Defence Force. He said, on the livestream, that he had planned to set the mosque on fire. Tarrant said that when he was being arrested, he was on his way to attack a third mosque in Ashburton, southwest of Christchurch. He also told the police that there were \"nine more shooters\", and that there were \"like- minded\" people in Dunedin, Invercargill, and Ashburton, but when he was interviewed later, he told the truth and said that he had did it alone. == Victims == Deaths by citizenship Citizenship Deaths 27 8 5 3 2 1 1 1 1 1 1 Total Fifty-one people died from the attacks: 44 at the Al Noor Mosque and seven at the Linwood Islamic Centre. All but four were male. Their ages ranged from three to 77 years old. Thirty-five others were injured at the Al Noor Mosque and five at Linwood. == Aftermath == === Legal === ==== Arraignment ==== Tarrant appeared in the Christchurch District Court on 16 March, where he was charged with one count of murder. The judge ordered that the courtroom would be closed to the public except for news reporters and allowed Tarrant to be filmed and photographed as long as his face would censored when shown in media coverage. In court, Tarrant smiled at reporters and made an inverted OK gesture below his waist, said to be a \"white power\" sign. The case was transferred to the High Court, and Tarrant was kept in custody as his lawyer did not seek bail. He was transferred to the country's only maximum-security unit at Auckland Prison. He made a formal complaint about his conditions in the prison had no access to newspapers, television, Internet, visitors, or phone calls. On 4 April, police said they had increased the number of charges to 89, 50 for murder and 39 for attempted murder, with other charges still being decided. At the next hearing on 5 April, Tarrant was ordered by the judge to have a psychiatric assessment of his mental fitness to see if he could stand trial. On 20 May, a new charge of committing in a terrorist act was given to Tarrant under the Terrorism Suppression Act 2002. One murder charge and one attempted murder charge were added, bringing the total to 51 and 40. ==== Pre-trial detention ==== On 14 June 2019, Tarrant appeared at the Christchurch High Court via audio-visual link from Auckland Prison. Through his lawyer, he pleaded not guilty to one count of engaging in a terrorist act, 51 counts of murder, and 40 counts of attempted murder. Mental health assessments showed no issues regarding his fitness to plead or stand trial. The trial was first set to start on 4 May 2020, but it was pushed back to 2 June 2020 to avoid happening at the same time as the Islamic holy month of Ramadan. During his time in prison, Tarrant was able to send seven letters, one of which was subsequently posted on the Internet message boards 4chan and 8chan by the person who was sent the letters. Minister of Corrections Kelvin Davis and the Department of Corrections were criticised for letting the sending of the letters happen.Multiple sources: * * * Prime Minister Ardern said that the Government would look into amending the Corrections Act 2004 to restrict what mail can be given to and sent by prisoners. ==== Guilty plea and sentencing arrangements ==== On 26 March 2020, Tarrant appeared at the Christchurch High Court via audio-visual link from Auckland Prison. He pleaded guilty to all 92 charges. As it was happening during the nationwide COVID-19 pandemic lockdown, the public was barred from the hearing. Reporters and representatives for the Al-Noor and Linwood mosques were in the courtroom. According to media reports, Tarrant's lawyers had informed the courts that their client was thinking about changing his plea. On 25 March, Tarrant gave his lawyers formal written instructions confirming that he wanted to change his pleas to guilty. In response, court authorities began making plans for the case to be called as soon as possible in the middle of the COVID-19 lockdown. The judge convicted Tarrant on all charges and kept him in custody to await sentencing. On 10 July, the government said that overseas victims of the shootings would get border exemptions and financial help to fly to New Zealand for the sentencing. On 13 July, it was reported that Tarrant had dismissed his lawyers and would be representing himself during sentencing proceedings. ==== Sentencing ==== Sentencing began on 24 August 2020 before Justice Cameron Mander at the Christchurch High Court, and it was televised. Tarrant did not oppose the sentence put forward and declined to address the court. The Crown prosecutors showed the court how Tarrant had meticulously planned the two shootings and more attacks, while survivors and their relatives gave victim impact statements, which were shown by national and international media.Multiple sources: * * * * Tarrant was then sentenced to life imprisonment without the possibility of parole for each of the 51 murders, and life imprisonment for committing in a terrorist act and 40 attempted murders. The sentence is New Zealand's first terrorism conviction. It was also the first time that life imprisonment without parole, the maximum sentence available in New Zealand, had been given. After the sentencing, Deputy Prime Minister Winston Peters called for Tarrant to serve his sentence in Australia to stop New Zealand having to pay the costs for his life imprisonment. The cost of housing Tarrant in prison was estimated at NZ$4,930 per day, ==== Imprisonment ==== On 14 April 2021, Tarrant appealed against his prison conditions and being classed as a \"terrorist entity\" at the Auckland High Court. According to media reports, he is being imprisoned at a special \"prison within a prison\" known as a \"Prisoners of Extreme Risk Unit\" with two other prisoners. Eighteen guards have been tasked guard Tarrant, who is living in his own area. On 24 April, Tarrant abandoned the appeal. In November 2021, Tarrant's new lawyer said that Tarrant wanted to appeal against his sentence and conviction, claiming that his conditions went against the New Zealand Bill of Rights Act 1990. Survivors have criticised Tarrant's appeal as an attempt to \"re-traumatise\" the Muslim community. === Governmental response === Police told mosques to close until considered safe to reopen and sent officers to patrol and protect places in Christchurch. All Air New Zealand Link flights departing from Christchurch Airport were cancelled due to the absence of security at the terminal. Security was increased at Parliament, and public tours of the buildings were cancelled. In Dunedin, the Police Armed Offenders Squad searched a house, reported to have been rented by Tarrant, and shut off part of the street in Andersons Bay because Tarrant had said on social media that he had originally planned to target the Al Huda Mosque in that city. For the first time in New Zealand history, the terrorism threat level was raised to high. Prime Minister Jacinda Ardern called the attacks an \"act of extreme violence\" on \"one of New Zealand's darkest days\".Multiple sources: * * * She said it was a \"well-planned\" attack and said that the person who committed the attacks to be \"nameless\" while telling the public to say the victims' names instead. Ardern directed that flags on public buildings be flown at half-mast. In May 2019, the NZ Transport Agency offered to replace any vehicle number plates with the prefix \"GUN\" on request. In mid-October 2019, Ardern gave bravery awards to the two police officers who arrested Tarrant at the annual Police Association Conference in Wellington.Multiple sources: * * * On 1 September 2020, Prime Minister Ardern designated Tarrant as a terrorist entity, freezing his assets and making it a criminal offence for anyone to support him with money. === Media response === For the three months after the shooting, almost 1,000 reports were published in news outlets in New Zealand. Less than 10% of news reports published by major media outlets mentioned Tarrant's name. Susanna Every-Palmer, a psychiatrist, said that the media chose to not Tarrant fame and not show his views. The court made the media to censor Tarrant's face when showing the legal proceedings so in New Zealand, he stayed faceless and nameless. Instead, media coverage focused on the victims and their families. The media response in Australia was different, focusing on the violence of the attack, as well as Tarrant and his manifesto. For example, The Australian published audio of cries for help, and The Herald Sun wrote dramatic descriptions of victims being shot and used poetry. Coverage of the victims was focused on things like bloodshed, injuries, and graves being dug. === Other responses in New Zealand === The third test cricket between New Zealand and Bangladesh, that was supposed to happen at Hagley Oval in Hagley Park on 16 March, was cancelled because of security reasons. The Bangladesh team were planning to go to the Friday prayer at the Al Noor Mosque and were moments from entering the building when the incident began. The players then fled on foot to Hagley Oval. Two days later, Canterbury cancelled their match against Wellington in the cricket tournament. The rugby match between the Crusaders, based in Christchurch, and Highlanders, based in Dunedin, was cancelled as \"a mark of respect for the events\". Canadian rock singer- songwriter Bryan Adams and American thrash metal band Slayer cancelled their concerts that were supposed to happen in Christchurch on 17 March, two days after the shootings. Mosques around the World held vigils and tributes.Multiple sources: * * * * The mayor of Christchurch, Lianne Dalziel, encouraged people to put flowers outside the city's gardens. School pupils and other groups performed haka to honour the people killed in the attacks. Street gangs including the Mongrel Mob, Black Power, and the King Cobras sent members to mosques around the country to help protect them during prayer time.Multiple sources: * * * One week after the attacks, an open-air Friday prayer service was held in Hagley Park. Broadcast across New Zealand on radio and television, it was attended by 20,000 people along with Jacinda Ardern,Multiple sources: * * * who said, \"New Zealand mourns with you. We are one.\" The imam of the Al Noor Mosque thanked New Zealanders for their support and said, \"We are broken- hearted but we are not broken.\" ==== Operation Whakahaumanu ==== After the attack, New Zealand Police started Operation Whakahaumanu. The operation was made to reassure New Zealanders after the attack by putting police around streets, schools and religious buildings and to also investigate people who have similar ideas to the gunman. === Charity === An online charity started to support victims and their families had, raised over 10 million New Zealand dollars. Counting other fundraisers, a combined total of $8.4 million had been raised for the victims and their families In late June, it was reported that the Jewish Federation of Greater Pittsburgh had raised more than NZ$967,500 (US$650,000) through its fund for the victims of the Christchurch mosque shootings. This amount also had $60,000 raised by Tree of Life – Or L'Simcha Congregationfollowing the Pittsburgh synagogue shooting in late October 2018.Multiple sources: * * * === Related arrests and incidents === ==== New Zealand ==== Police arrested four people on 15 March, including a woman and a man, after finding a gun in a vehicle which they were travelling in together. A 30-year-old man said he was arrested when he arrived at Papanui High School to pick up his 13-year-old brother-in-law. He was in camouflage clothing. On 4 March 2020, a 19-year-old Christchurch man was arrested for allegedly making a terror threat against the Al Noor Mosque on Telegram.Multiple sources: * * * Media reports said the man was Sam Brittenden, a member of the white supremacist group Action Zealandia. On 4 March 2021, a 27-year-old man was charged with \"threatening to kill\" after making an online threat against both the Linwood Islamic Centre and the Al Noor Mosque on 4chan. ==== Outside New Zealand ==== On 18 March 2019, the Australian police raided the homes of Tarrant's sister and mother near Coffs Harbour and Maclean in New South Wales. Tarrant's sister and mother were helping the police investigation. On 19 March 2019, an Australian man who had praised the shootings on social media was indicted on one count of possession of a gun without a licence and four counts of using an illegal weapon. He was released on bail on the condition that he stay offline.Multiple sources: * * * * A 24-year-old man from Oldham, Greater Manchester, United Kingdom, was arrested on 16 March for making posts on Facebook supporting the shootings. On 20 March, an employee of a company based in the United Arab Emirates, was fired by his company and deported for supporting the shootings. Thomas Bolin, a 22-year-old living in New York, made Facebook messages praising the shootings and talking about a plan to do a similar attack in the United States with his cousin. Bolin was convicted of lying to the FBI for saying he did not own any guns. ==== Inspired incidents ==== Nine days after the attack, a mosque in Escondido, California, was set on fire. Police found graffiti on the mosque's driveway that said \"For Brenton Tarrant\", the police investigated the fire as a terrorist attack. A mass shooting later took place at a synagogue in Poway, California on 27 April 2019, killing a person and injuring three others. The perpetrator of the shooting, 19-year-old John Earnest, also said he committed the fire and praised the Christchurch shootings and Tarrant in a manifesto. On September 30, 2021, Earnest was sentenced to life in prison without the possibility of parole. On 3 August 2019, 21-year-old Patrick Crusius opened fire and killed 23 people and injured 22 others in a mass shooting at a Walmart in El Paso, Texas, targeting Mexicans. In a manifesto posted to 8chan /pol/ board, he said he supported Tarrant and was inspired by him. On 10 August 2019, 21-year-old Philip Manshaus murdered his Chinese adopted stepsister at their home before travelling to a mosque in Bærum, Norway and trying to commit a mass shooting, before being disarmed by a worshipper, Mohammad Rafiq. He called Tarrant as a \"saint\" online. Manshaus was sentenced to 21 years for the attack. On 27 January 2021, the Singaporean intelligence agency said it had arrested a 16-year-old Protestant Indian for plotting to attack the Yusof Ishak Mosque and Assyafaah Mosque on the anniversary of the Christchurch shootings. The youth wrote a manifesto that called Tarrant as a \"saint\" and praised the shootings as the \"justifiable killing of Muslims\". The boy bought a machete and protective vest which he planned to use for the attack. In January 2024, the youth was released after spending almost three years in detention. On 14 May 2022, 18-year-old Payton Gendron killed ten people and injured three others at a Tops Friendly Markets store in Buffalo, New York, targeting Black people. He livestreamed the shooting on Twitch and published a manifesto where he wrote that he was inspired by Tarrant. In response, there a ban on the sharing of Gendron's manifesto within New Zealand. == Response == === World leaders === Queen Elizabeth II, New Zealand's head of state, said she was \"deeply saddened\" by the shootings. Other world leaders also condemned the attacks. The prime minister of Pakistan, Imran Khan, said that Naeem Rashid, the Pakistani worshipper who charged at Tarrant and died, would be honoured with a national award. President Donald Trump called the shootings a \"horrible massacre\". === Far-right === Two New Zealand-based anti-immigration groups, the Dominion Movement and the New Zealand National Front, condemned the attacks and shut their websites down. Others in the far-right celebrated the attacks. Tarrant's manifesto, The Great Replacement, was translated and shared in more than a dozen different languages The United Kingdom's domestic intelligence service, MI5, launched an inquiry into Tarrant's possible links to the British far-right. === Islamic groups === Ahmed Bhamji, chair of the largest mosque in New Zealand, spoke at a rally on 23 March in front of one thousand people. He claimed that Mossad, the Israeli intelligence agency, committed and planned the attack. The claim has been called an antisemitic conspiracy theory. The chairman of the Federation of Islamic Associations of New Zealand said not all New Zealand Muslims agreeed with Bhamji's claim. === People and countries mentioned by Tarrant === Just before committing the attacks, Tarrant told the audience of the livestream to subscribe to PewDiePie, a YouTuber, because at the time, PewDiePie was attempting to get more subscribers than the Indian music record T-Series. PewDiePie, real name Felix Kjellberg, posted on Twitter that he \"felt absolutely sickened\" to have his name spoken by Tarrant. During the attacks, Tarrant played the song \"Fire\" by The Crazy World of Arthur Brown. In a Facebook post, singer Arthur Brown posted his \"horror and sadness\" at the use of his song during the shootings, and cancelled an appearance at Waterloo Records shortly after the shootings. Tarrant also played the Serbian nationalist song \"Serbia Strong\", he main singer of the song, Željko Grmuša, said, \"It is terrible what that guy did in New Zealand, I feel sorry for all those innocent people.\" ==References== Category:2010s in New Zealand Category:March events Category:March 2019 events Category:2019 deaths Category:2019 crimes Category:Attacks on buildings and structures in 2019 Category:2019 mass shootings Category:Murder in 2019 Category:Mass murder in 2019 Category:Terrorist incidents in 2019 Category:Attacks on buildings and structures in the 2010s Category:Terrorist incidents in the 2010s Category:Mass murder in the 2010s Category:Hate crimes Category:Murders by firearm Category:Massacres Category:Massacres of Muslims Category:Pakistani murder victims Category:Indian murder victims Category:Murdered children Category:Nationalist terrorism Category:Terrorist attacks Category:Attacks on religious buildings and structures Category:Attacks on mosques Category:Religious building shootings Category:Political violence Category:Racially-motivated violence Category:Deaths by firearm Category:Jacinda Ardern Category:Christchurch",
 "title": "Christchurch mosque shootings"
}