{
 "id": "685015",
 "text": "The People's Republic of China (PRC) bans a lot of movies for many reasons. China Film Administration (国家电影局) decides for mainland China.https://www.chinafilm.gov.cn/ Hong Kong and Macau have different political systems so the bans below do not apply. Having said that, Glory to Hong Kong is banned. However, this song is allowed under some circumstances such as academic studies and news reporting.Interim Injunction Order CACV 274/2023 (On Appeal from HCA 855/2023) – to restrain four specified criminal acts in relation to a song Baidu Baike's page for 我毕业了 is 小吕演唱的歌曲, but there is no factual statement about how famous is the singer or popular is the song.https://baike.baidu.com/item/%E6%88%91%E6%AF%95%E4%B8%9A%E4%BA%86 The article of South Park is 天津市的餐馆 (a restaurant in Tianjin). The Chinese name of such business is unknown, and the address is 天津和平区河北路330号(睦南道口). No photograph available.https://baike.baidu.com/item/South%20Park The article of Matthew O'Neill is \"...出生于美国的男演员，主要作品《The Fortunes and Misfortunes of Moll Flanders》\".https://baike.baidu.com/item/Matthew%20O'Neill Taiwan, which is known as the Republic of China by those countries that recognize her, is not under the control and jurisdiction of the PRC. ==List of banned movies by subject== ===1989 Tiananmen Square protests=== *Fate in our hands (香港雲起時) 1989 (本剧在片头播放主题曲时出现多个与六四事件及其引申出的香港前途问题游行的图片和剪报https://www.wikiwand.com/zh-sg/articles/%E9%A6%99%E6%B8%AF%E9%9B%B2%E8%B5%B7%E6%99%82). As Macau people can watch TVB (電視廣播有限公司) in China,https://www.ctm.net/en-US/fiveG/T31-010010020110010/20209/bd8af6fb051b415fb5fdb14a55181d97.htmlhttps://www.mytvsuper.com/en/programme/fateinourhands0001_122326/FATE-IN-OUR-HANDS/ it is probable that China is only specifically banning the music video in the beginning of the episodes, because of the politically sensitive content in it.https://search.bilibili.com/all?keyword=%E7%84%A1%E6%82%94%E9%80%99%E4%B8%80%E7%94%9F The story is about love. The story and the lyrics of the theme song are not about the Tiananmen Square protests.https://baike.sogou.com/v75877756.htm *I Have Graduated (我毕业了) 1992Hong Kong Censors Issue Warning Over Tiananmen Film ScreeningsIMDb《我毕业了》王光利 1992. circa 2020 *Moving the Mountain (移山) 1995 *The Gate of Heavenly Peace (film) 1995 天安门 *Goo Goo Gai Pan (2005) * A Taxi Driver (2017). The story of this movie is about the similar Gwangju Uprising or Gwangju Massacre in 1980. *Chimerica (寻找坦克人) 2019 ===Tibet and Xinjiang=== *Kundun (達賴的一生) 1997 *Seven Years in Tibet (1997 film) 西藏七年 *The 10 Conditions of Love (愛的十個條件) 2009 *The Sun Behind the Clouds (云后的太阳) 2010 *One Angry Lisa, season 34, episode 2 of The Simpsons.Disney cuts Simpsons ‘forced labor’ episode in Hong Kong. February 8, 2023 ===Human rights=== *Red Corner (1997) *Big Shorts TV (大褲衩) 2015YouTube *Ten Years (十年) 2015 *South Park‘South Park’ Scrubbed From Chinese Internet After Critical Episode *Nominated in the 93rd Oscars, Do not split (不割席) 2020. Baidu Baike 's article of 奥斯卡金像奖最佳纪录短片 states:- **第91届 最佳纪录短片：《句点》 **第92届 最佳纪录短片：《女孩的战地滑板课》 **第94届 最佳纪录短片：《篮球女王》 **第95届 最佳纪录短片：《小象守护者》奥斯卡金像奖最佳纪录短片 *Eternal Spring (长春) 2022中共为什么把漫画家大雄作品列为禁书How Activists Hacked China's State TV | Eternal Spring (Full Film) ===Migration=== *Mao's Last Dancer (2009) *The Ditch (夹边沟) 2010https://letterboxd.com/film/the-ditch/ *Ai Weiwei: Never Sorry (艾未未：道歉你妹) 2012 produced by Andrew Cohen.https://acfilmsinc.com/about However, Baidu Baike's article of Andrew Cohen is 剪辑师、制作人、副导演、助理导演，主要作品有《阿拉伯巨灵》《沃土》等.https://baike.baidu.com/item/Andrew%20Cohen It also states《阿拉伯巨灵》... 制片地区 阿联酋 (the movie was made in the UAE).https://baike.baidu.com/item/%E9%98%BF%E6%8B%89%E4%BC%AF%E5%B7%A8%E7%81%B5/1046766 ===Organ transplant (surgery)=== *Free China: The Courage to Believe (自由中国：有勇气相信) 2012 starring Jennifer Zeng. *Human Harvest (活摘) December 2014 *The Bleeding Edge (2016) === Banned with explanation by the authority === *The Palace: the Lost Daughter (宫锁连城) April 2014https://weibo.com/u/3137825992琼瑶诉于正案终审落幕维持原判 公开道歉赔500万 .网易娱乐.2015-12-18 *A Chinese Ghost Story (只问今生恋沧溟) 2021 by Zheng Shuang (郑爽). *Glory to Hong Kong (願榮光歸香港) song banned by court in Hong Kong.Gov’t bid to ban ‘Glory to Hong Kong’ protest song approved by appeals court ===Taiwan=== See also: Taiwanese student-occupiers peacefully retreat from the chamber of Legislative Yuan. *Days We Stared at the Sun II (他們在畢業的前一天爆炸2) 2017 *Freewill Of Formosa (自由的向望) 2019 *Island Nation (國際橋牌社) 2020 *Wave Makers (人選之人-造浪者) 2023 ===Xi Jinping=== *Last Week Tonight with John Oliver because of the episode on June 17, 2018. As the Baike (百科) articles are still there, it is not likely that China is banning the entire television program.https://baike.sogou.com/v168132053.htmhttps://baike.baidu.com/item/%E4%B8%8A%E5%91%A8%E4%BB%8A%E5%A4%9C%E7%A7%80 *Years and Years (2019) See also: United States Department of State commented on China's removal of term-limit for her leader. ==Writers of this page cannot figure out the definitive reason== [[File:Kimberley Dailo2014 (cropped).jpg|thumb|left|Kimberley Chen gained celebrity status due to the \"愛你 (2012)\" songKimberley陳芳語《愛你AINI》Official MV陳芳語〈愛你〉登中國排行榜「原唱卻遭換名」！本人7字回應了 which is not banned in China.https://baike.baidu.com/item/%E6%84%9B%E4%BD%A0/130714 Chen was featured in the Fragile (玻璃心) music video, which was banned soon after being released.]] *River Elegy (河殇) 1988 directed by 孙增田.记录片. CCTVhttps://baike.baidu.com/item/%E5%AD%99%E5%A2%9E%E7%94%B0 *China's Unnatural Disaster: The Tears of Sichuan Province (劫后天府泪纵横)劫后天府泪纵横为什么看不了 2009 co-directed by Matthew O'Neill (filmmaker). *In response to the sarcastic song Fragile (玻璃心),黃明志陳芳語創意神曲《玻璃心》被大陸封殺 China has banned many songs by Namewee (黃明志) and Kimberley Chen since 2021 but China might have unbanned certain songs.新歌疑批“小粉红” 黄明志与陈芳语作品在大陆全面下架 *Even though the cinemas agreed to show it, the Winnie the Pooh horror film (小熊维尼：血染蜂蜜 2023) was not shown in Hong Kong and Macau.Winnie the Pooh horror film will not be shown in Hong Kong or Macau This film sold well in other places of the world. This film is not banned in China.小熊维尼：血染蜂蜜_百度百科 *Television Broadcasts Limited decided not to air some episodes of Planet Under Fire (戰場上) during winter 2024.無綫不敵網民腰斬《戰場上》 陳志雲不認同做法：將招牌塗上污點新假期JetSo's post The production of this documentary began in August 2024.参考资料 ===regarding Stranger In The North (song)=== Stranger In The North 2017 was sung by Wang Leehom (王力宏).https://singchinesesongsinenglish.wordpress.com/2018/07/02/stranger-in-the-north-%E6%BC%82%E5%90%91%E5%8C%97%E6%96%B9-by-namewee-%E9%BB%83%E6%98%8E%E5%BF%97-lyrics-pinyin-translation/ According to the information available on the Chinese webpages,飘向北方（那吾克热、尤长靖演唱歌曲）_百度百科飘向北方 - 搜狗百科 \" 中文名 飘向北方 外文名 Stranger In The North; 歌曲原唱 王力宏; 填词 那吾克热\". However, the creator of the song was, in fact, Namewee (黃明志).《漂向北方》果然神曲！不管誰唱都紅了 China is not banning Stranger In The North the song, but is stating something wrong, to the effect, that the \"黃明志 name\" cannot be seen in China. ==People that are in the movies above== [[File:Anastasia Lin and Andrew Hastie MP in Parliamentary Offices 4 December 2018 (DB).jpg|thumb|left|The person on the left is Anastasia Lin (林耶凡). Writing about her is being banned in China (尚未收录词条百度百科 and 没有找到能和“林耶凡”匹配的内容搜狗搜索).]] In alphabetical order:- *Beyond boy band sung the song 無悔這一生, which was used in the beginning of the episode of Fate in our hands (香港雲起時), but the original music video contained politically sensitive content.https://michaelchu-73917.medium.com/%E7%84%A1%E6%82%94%E9%80%99%E4%B8%80%E7%94%9F-%E9%A6%99%E6%B8%AF%E9%9B%B2%E8%B5%B7%E6%99%82-a13de6bbe26bhttps://www.hk01.com/%E5%8D%B3%E6%99%82%E5%A8%9B%E6%A8%82/360329/ *Brad Pitt *CHENG Yu-Chieh郑有杰 - 搜狗百科 *Ethan Gutmann (born in 1958)Ethan Gutmann - IMDb *John Oliver *Kimberley Chen (female singer) and Namewee (male singer).《玻璃心》大戰小粉紅爆紅！ 微博被禁 陳芳語：我還有IG、FB *Li Cunxin - 国际著名芭蕾舞演员https://baike.baidu.com/item/%E6%9D%8E%E5%AD%98%E4%BF%A1/9629975 *Liu Xiaobo *Matt Stone - 1971年5月26日出生于美国德州休斯敦，美国动画师、编剧家、电视片导演、电视片制片人、配音演员、音乐家以及演员。代表作品有《食人魔：歌舞版》https://baike.baidu.com/item/%E9%A9%AC%E7%89%B9%C2%B7%E6%96%AF%E9%80%9A/0 *Richard Gere *Trey Parker - 1969年出生于美国科罗拉多州，电影制作人。2005年、2007年因动画剧集《南方公园》赢得艾美奖最佳动画节目（播出时间超过一小时）奖https://baike.baidu.com/item/%E7%89%B9%E9%9B%B7%C2%B7%E5%B8%95%E5%85%8B *Wang Dan *Wei JingshengJingsheng Wei - IMDb *Zheng Shuang郑爽(涉偷税逃税90后艺人)_搜狗百科 ==Chinese banned broadcaster== If you search \"新唐人电视台\" on the major online video platforms,https://v.qq.com/x/search/?q=%E6%96%B0%E5%94%90%E4%BA%BA%E7%94%B5%E8%A7%86%E5%8F%B0https://so.youku.com/search/q_%E6%96%B0%E5%94%90%E4%BA%BA%E7%94%B5%E8%A7%86%E5%8F%B0https://search.bilibili.com/all?vt=70796687&keyword;=%E6%96%B0%E5%94%90%E4%BA%BA%E7%94%B5%E8%A7%86%E5%8F%B0 you would not find any relevant results/ you cannot find real videos of New Tang Dynasty Television to watch. If you try the Sugou Encyclopedia, you get the \"baike.sogou.com站内没有找到匹配的内容\" result.https://www.sogou.com/sogou?query=%E6%96%B0%E5%94%90%E4%BA%BA%E7%94%B5%E8%A7%86%E5%8F%B0&ie;=utf8&insite;=baike.sogou.com *Laowhy86 (Matthew Tye)嘴上爱中国的老外，背后是什么鬼样？有人看过油管的laowhy86吗？这个人怎么还没被驱逐出境 *LeLe Farley (乐乐法利) (Lawrence Alexander Farley)这个美国人有点无耻，在中国搞不到钱了，开始抹黑中国，变成台独专访中国全网封杀的美国喜剧演员乐乐法利 *SerpentZA (Winston Sterzel)满嘴跑火车的南非白人南非白人毒舌SerpentZa到底是个什么人？ *The Epoch Times抱歉，百度百科尚未收录词条 “大纪元” ==Punishment== *The director of To Live (1994 film) (活着) was banned from filmmaking for 2 years.Ebert, Roger. \"To Live .\" Chicago Sun Times. December 23, 1994. Retrieved November 15, 2011.Zhang Yimou. Frances K. Gateward, Yimou Zhang, University Press of Mississippi, 2001, pp. 63–4.Page 195 of a certain Chinese book *Summer Palace (2006 film) was submitted for competition overseas without being submitted to censorship first, in other words, without China´s authorization. The punishment included a movie production 5-year-ban on the maker of the movie. *For making the Lost in Beijing movie, Fang Li and the production company Beijing Laurel Films were banned from filmmaking for 2 years. ==The 3-tier system== Tong Ying Kit was punished in July 2021 for using a controversial slogan, may or may not be relevant. Inside the Red Brick Wall (理大圍城) was approved by Hong Kong censor - Derek Lee (李統殷) in September 2021. Ying E Chi Cinema As of late 2024, Mr Lee appears to be working at another government department.Government Telephone Directory This is a \"category III\" movie, so it cannot be shown to people under 18 years old.Office for Film, Newspaper and Article Administration In November 2021, the law on censorship was changed.Film Censorship (Amendment) Ordinance 2021 and updated guidelines come into effect It is not clear whether Revolution of Our Times (時代革命) (by Kiwi Chow) is allowed or banned.《时代革命》：“禁片”年代的海外放映 Chow's movie's name is the later half of the Tong's slogan (liberate Hong Kong; revolution of our times) without former half, without the words of \"liberate Hong Kong\".HK documentary takes emotional win ==Related pages== * Movie censorship *NTD Television Network (English) * Political problems of China ==References== Category:Censorship Category:Lists of movies Category:China-related lists",
 "title": "Movies banned in China"
}