{
 "id": "685319",
 "text": "Brenton Harrison Tarrant (born 27 October 1990) is an Australian mass murderer, terrorist, and white nationalist who committed the Christchurch mosque shootings where he murdered 51 people and wounded 40 others on 15 March 2019 before being arrested by police. He is the deadliest murderer in New Zealand's history. == Early life == Tarrant was born on 27 October, 1990 and grew up in Grafton, New South Wales where he where he went to Grafton High School. He had a troubled childhood, starting when his parents separated, his grandfather died and their family home was burnt down in a fire. These events traumatized him and left him with social anxiety disorder, which likely worsened when his mother's new partner assaulted him, his sister and mother. He started gaining weight from age 12, because of this he started getting bullied at school, where he also had few friends. He was unfocused at school but also strangely familiar with topics like World War II. Tarrant showed signs of racism and worries about immigration as young as 12 years old. He frequently made racist comments about his mother's former partner's Indigenous Australian heritage, which worried his high school teachers. He started using 4chan at the age of 14, a site known for sharing extremist content, and start obsessively exercising to lose weight. == Travels == In 2009, Tarrant qualified as a personal trainer at Big River Gym in Grafton. The next year, he found his father dead by suicide, following this he inherited A$457,000 from his father, he stopped working as a personal trainer and used the money to invest and travel across the world.In March 2013, he travelled to New Zealand for a vacation, where he stayed with a friend for three days for gaming. The friend and his parents were gun users. They took Tarrant to a shooting club where he had his first experience with guns. Police in Bulgaria and Turkey investigated Tarrant's visits to their countries. Security officials suspected that he went into contact with far- right organizations about two years before the shootings, while visiting European nations. He donated €3,700 to two Identitarian organizations in Europe and spoke with a group leader using e-mail in January 2018 and July 2018, hoping to meet each other in Vienna.Multiple sources: * * * When he was preparing the attacks, Tarrant made a donation of $106.68 to Rebel Media, a site that showed both the Identitarian movement and several articles discussing the \"white genocide\" and \"Great Replacement\" conspiracy theories. In 2016, left more than 30 comments on the now-deleted \"United Patriots Front\" and \"True Blue Crew\" websites. A Melbourne man said that in 2016, he filed a police complaint after Tarrant told him in an online conversation, \"I hope one day you meet the rope\". He said that the police told him to block Tarrant. The police said that they didn't find a complaint. Tarrant told investigators that he frequented right-wing discussion boards on 4chan and 8chan and also found YouTube to be \"a significant source of information and inspiration.\" == Life in New Zealand == Tarrant moved to New Zealand in August 2017 and lived in Andersons Bay in Dunedin until the shootings. A neighbour described him as a friendly loner. He was a member of a gun club in southern Otago, where he practised shooting at its range. In 2018, Tarrant was treated for eye and thigh injuries at Dunedin Hospital; he told doctors he got the injuries when he tried to remove an improperly chambered bullet from a gun. The doctors also treated him for steroid abuse, but never reported Tarrant's visit to the authorities, which would have led in police rechecking his health to have a gun license. When living in Dunedin, Tarrant had no job and bought necessities and preparations for the terrorist attack using the money he received from his father and income from investments. When asked, he gave no explanation for his future plans once he ran out of money other than mentioning to his sister the possibility of suicide and later telling family members and gaming friends that he planned to move to Ukraine. Tarrant believed he would run out of his money by August 2019. A document, dated January 2019, was discovered which he wrote \"March is go do rain or shine\". == Planning == In 2016 and 2017, Tarrant is believed to have become obsessed with terrorist attacks committed by Islamic extremists and he started planning his own attacks in 2017 then chose the Al Noor Mosque and Linwood Islamic Centre as targets in December 2018, along with a third mosque in Ashburton which he got arrested before being able to go to during the attacks. Some survivors at the Al Noor Mosque said they saw Tarrant there on Friday prayers before the attack, pretending to pray and asking about the mosque's schedules. The Royal Commission report found no evidence of this, and police said that Tarrant had instead looked at an online tour of the mosque as part of his planning. On 8 January 2019, Tarrant used a drone from a nearby park to look at the outside of the mosque. He used the internet to find pictures of the inside and prayer schedules to figure out when the mosques would have the most people. On the same day, he drove past the Linwood Islamic Centre. === Manifesto === Tarrant says he is the author of a 74-page manifesto titled The Great Replacement, a reference to the \"Great Replacement\" and \"white genocide\" conspiracy theories. It said that the attacks were planned in 2017 and the locations were selected three months before. Minutes before the attacks began, the manifesto was emailed to more than 30 people, including the prime minister's office and several media outlets, and links were posted on Twitter and 8chan. Seven minutes after Tarrant sent the manifesto to parliament, it was forwarded to the parliament security team, who called the police at 1:40p.m., around the same time the first 111 calls were made from the Al Noor Mosque. In the manifesto, several anti-immigrant ideas are said, including hate speech against migrants, white supremacist beliefs and the plan for all non-European immigrants in Europe that he claimed to be \"invading his land\" to be deported. The author says he first planned to attack the Al Huda Mosque in Dunedin but changed his mind after visiting Christchurch. == Christchurch mosque shootings == On 15 March 2019, Tarrant started his live-stream that played for 17 minutes on Facebook Live. At 1:39p.m., he arrived at the Al Noor Mosque and fired his shotgun at the entrance, killing four people. He shot people inside with the AR-15 rifle. A worshipper, Naeem Rashid charged at him and knocked him down but was then shot and killed. He went outside, where he killed a man and took a Ruger AR-556 from his car. He killed two people in the car park who were hiding behind cars. He went back in the mosque and shot wounded people, then went outside again, where he killed a woman and drove over her after leaving. He shot at people who had escaped from the mosque through the windscreen and closed window of his own car using a Remington Model 870 when he was driving to the Linwood Islamic Centre. At 1:52p.m., he got to the Linwood Islamic Centre, east of the Al Noor Mosque, where about 100 people were inside. He parked his car on the driveway, stopping other cars from getting in or out. According to a witness, he couldn't find the mosque's main door and shot people outside and through a window, killing four people. A worshipper named Abdul Aziz Wahabzada confronted Tarrant. He hid behind cars and tried to get Tarrant's attention by shouting. Regardless, Tarrant went into the mosque, where he shot and killed three people. When Tarrant got back to his car, Aziz confronted him again. Tarrant drove away at 1:55p.m., with Aziz throwing the shotgun at his car.Multiple sources: * * * After being left unused, Linwood Islamic Centre was demolished in November 2023. A silver 2005 Subaru Outback matching the description of Tarrant's car was seen by a police officer, and a chase was initiated at 1:57p.m. Two police officers rammed his car off of the road with their police car, and Tarrant was arrested without struggle on Brougham Street in Sydenham at 1:59p.m., 18 minutes after the first emergency call. Police found the four incendiary devices in his car; they were defused by the New Zealand Defence Force. He said, on the livestream, that he had planned to set the mosque on fire. == Victims == Deaths by citizenship Citizenship Deaths 27 8 5 3 2 1 1 1 1 1 1 Total Fifty-one people were murdered by Tarrant: 44 at the Al Noor Mosque and seven at the Linwood Islamic Centre. All but four were male. Their ages ranged from three to 77 years old. Thirty- five others were injured at the Al Noor Mosque and five at Linwood. == Legal proceedings == === Arraignment === Tarrant appeared in the Christchurch District Court on 16 March, where he was charged with one count of murder. The judge ordered that the courtroom would be closed to the public except for news reporters and allowed Tarrant to be filmed and photographed as long as his face would censored when shown in media coverage. In court, Tarrant smiled at reporters and made an inverted OK gesture below his waist, said to be a \"white power\" sign. The case was transferred to the High Court, and Tarrant was kept in custody as his lawyer did not seek bail. He was transferred to the country's only maximum-security unit at Auckland Prison. He made a formal complaint about his conditions in the prison as he had no access to newspapers, television, Internet, visitors, or phone calls. On 4 April, police said they had increased the number of charges to 89, 50 for murder and 39 for attempted murder, with other charges still being decided. At the next hearing on 5 April, Tarrant was ordered by the judge to have a psychiatric assessment of his mental fitness to see if he could stand trial. On 20 May, a new charge of committing in a terrorist act was given to Tarrant under the Terrorism Suppression Act 2002. One murder charge and one attempted murder charge were added, bringing the total to 51 and 40. === Pre-trial detention === On 14 June 2019, Tarrant appeared at the Christchurch High Court via audio-visual link from Auckland Prison. Through his lawyer, he pleaded not guilty to one count of engaging in a terrorist act, 51 counts of murder, and 40 counts of attempted murder. Mental health assessments showed no issues regarding his fitness to plead or stand trial. The trial was first set to start on 4 May 2020, but it was pushed back to 2 June 2020 to avoid happening at the same time as the Islamic holy month of Ramadan. During his time in prison, Tarrant was able to send seven letters, one of which was subsequently posted on the Internet message boards 4chan and 8chan by the person who was sent the letters. Minister of Corrections Kelvin Davis and the Department of Corrections were criticised for letting the sending of the letters happen.Multiple sources: * * * Prime Minister Ardern said that the Government would look into amending the Corrections Act 2004 to restrict what mail can be given to and sent by prisoners. === Guilty plea and sentencing arrangements === On 26 March 2020, Tarrant appeared at the Christchurch High Court via audio-visual link from Auckland Prison. He pleaded guilty to all 92 charges. As it was happening during the nationwide COVID-19 pandemic lockdown, the public was barred from the hearing. Reporters and representatives for the Al- Noor and Linwood mosques were in the courtroom. According to media reports, Tarrant's lawyers had informed the courts that their client was thinking about changing his plea. On 25 March, Tarrant gave his lawyers formal written instructions confirming that he wanted to change his pleas to guilty. In response, court authorities began making plans for the case to be called as soon as possible in the middle of the COVID-19 lockdown. The judge convicted Tarrant on all charges and kept him in custody to await sentencing. On 10 July, the government said that overseas victims of the shootings would get border exemptions and financial help to fly to New Zealand for the sentencing. On 13 July, it was reported that Tarrant had dismissed his lawyers and would be representing himself during sentencing proceedings. === Sentencing === Sentencing began on 24 August 2020 before Justice Cameron Mander at the Christchurch High Court, and it was televised. Tarrant did not oppose the sentence put forward and declined to address the court. The Crown prosecutors showed the court how Tarrant had meticulously planned the two shootings and more attacks, while survivors and their relatives gave victim impact statements, which were shown by national and international media.Multiple sources: * * * * Tarrant was then sentenced to life imprisonment without the possibility of parole for each of the 51 murders, and life imprisonment for committing in a terrorist act and 40 attempted murders. The sentence is New Zealand's first terrorism conviction. It was also the first time that life imprisonment without parole, the maximum sentence available in New Zealand, had been given. After the sentencing, Deputy Prime Minister Winston Peters called for Tarrant to serve his sentence in Australia to stop New Zealand having to pay the costs for his life imprisonment. The cost of housing Tarrant in prison was estimated at NZ$4,930 per day, == Imprisonment == On 14 April 2021, Tarrant appealed against his prison conditions and being classed as a \"terrorist entity\" at the Auckland High Court. According to media reports, he is being imprisoned at a special \"prison within a prison\" known as a \"Prisoners of Extreme Risk Unit\" with two other prisoners. Eighteen guards have been tasked guard Tarrant, who is living in his own area. On 24 April, Tarrant abandoned the appeal. In November 2021, Tarrant's new lawyer said that Tarrant wanted to appeal against his sentence and conviction, claiming that his conditions went against the New Zealand Bill of Rights Act 1990. Survivors have criticised Tarrant's appeal as an attempt to \"re-traumatise\" the Muslim community. == Legacy == Tarrant's mass killing would go on to inspire numerous copycats (or similar events), in large part due to its live-streamed nature. The first reported copycat attack would happen merely nine days after the attack, when a mosque in Escondido, California was set on fire. Police found graffiti on the mosque's driveway that said \"For Brenton Tarrant.” The police investigated the fire as a terrorist attack. A mass shooting later took place at a synagogue in Poway, California on 27 April 2019, killing a person and injuring three others. The perpetrator of the shooting, 19-year-old John Earnest, also said he committed the fire and praised the Christchurch shootings and Tarrant in a manifesto. On September 30, 2021, Earnest was sentenced to life in prison without the possibility of parole. On 3 August 2019, 21-year-old Patrick Crusius opened fire and killed 23 people and injured 22 others in a mass shooting at a Walmart in El Paso, Texas, targeting Mexicans. In a manifesto posted to 8chan /pol/ board, he said he supported Tarrant and was inspired by him. On 10 August 2019, 21-year-old Philip Manshaus murdered his Chinese adopted stepsister at their home before travelling to a mosque in Bærum, Norway and trying to commit a mass shooting, before being disarmed by a worshipper, Mohammad Rafiq. He called Tarrant as a \"saint\" online. Manshaus was sentenced to 21 years for the attack. On 27 January 2021, the Singaporean intelligence agency said it had arrested a 16-year-old Protestant Indian for plotting to attack the Yusof Ishak Mosque and Assyafaah Mosque on the anniversary of the Christchurch shootings. The youth wrote a manifesto that called Tarrant as a \"saint\" and praised the shootings as the \"justifiable killing of Muslims\". The boy bought a machete and protective vest which he planned to use for the attack. In January 2024, the youth was released after spending almost three years in detention. On 14 May 2022, 18-year-old Payton Gendron killed ten people and injured three others at a Tops Friendly Markets store in Buffalo, New York, targeting Black people. He livestreamed the shooting on Twitch and published a manifesto where he wrote that he was inspired by Tarrant. In response, there a ban on the sharing of Gendron's manifesto within New Zealand. In Finland on 15 March 2024, the anniversary of Christchurch mosque shooting, a Finnish army Non- commissioned officer was arrested for allegedly planning a mass shooting in a university in Vaasa that day. As her motivation she said the world needed \"a mass culling\" to put an end to \"selfish individualism\", \"human degeneration\", global warming and conspicuous consumption. The Finnish police described her as ecofascist and that she had read books by Nietzsche, Linkola and Kaczynski. Additionally she had praised Pekka-Eric Auvinen in internet conversations and had visited Jokela school where he perpetrated the mass shooting. On 13 August 2024 in Eskisehir, Turkey an 18-year-old suspect, identified as Arda K, would livestream himself stabbing five elderly people in the Tepebaşı mosque on Twitter, the suspect was wearing a bulletproof vest and helmet, the livestream showed him wearing goggles over a mask, completely concealing his face. News sites claimed he wore a “black sun,” a Nazi symbol made up of several swastikas, on his chest He also carried an axe at his waist but didn't use it during his attack. He was apprehended following a police chase, according to the Eskisehir governor’s office. In his manifesto the suspect would write \"Subscribe to Zade\" (a youtuber in Turkey) referencing to Tarrant's name- dropping of Pewdiepie. == Notes == == References == Category:Australian criminals Category:Australian murderers Category:Australian writers Category:People from New South Wales Category:Writers from New South Wales Category:Australian prisoners Category:Conspiracy theorists Category:Nationalists Category:White supremacists Category:20th-century births Category:1990s births Category:1990 births Category:People convicted of attempted murder Category:Murderers Category:People convicted of murder Category:Terrorists Category:Living people",
 "title": "Brenton Tarrant"
}