{
 "id": "685537",
 "text": "The Democratic Labour Party (DLP) is a political party which was founded in Barbados in 1955 by Errol Barrow. It was the ruling party of Barbados 3 times after Barbados became independent on 30 November 1966. It first ruled the Country and the nation of Barbados from 30 November 1966 to 8 September 1976 under Errol Barrow and then from 29 May 1986 to 7 September 1994 first again under Errol Barrow from 29 May 1986 until his death on 1 June 1987. Barrow’s than Deputy prime minister, Erskine Sandiford succeeded him as Prime Minister of Barbados on 1 June 1987. Erskine Sandiford Served as the 4th Prime Minister of Barbados from 1 June 1987 to 7 September 1994. The Democratic Labour Party ruled the country and the nation of Barbados for a third time form 15 January 2008 to 24 May 2018. It first ruled under David Thompson (Barbadian Politician) from 15 January 2008 to 23 October 2010 and then under Freundel Stuart from 23 October 2010 to 24 May 2018, but faced an electoral wipeout and unprecedented defeat in the 2018 Barbadian general election which left the party with no elected Members of Parliament. History The Democratic Labour Party (DLP) was founded in 1955 by Errol Barrow and Co-founded by Fredrick Smith. They were once members and candidates of the then ruling-party of Barbados the Barbados Labour Party (BLP) from 1951 to 1955, these people and 29 more people broke away and stepped down as members and candidates of the Barbados Labour Party (BLP) to form his more left-winged and leaning Social democratic alternative, the Democratic Labor Party (DLP) to challenge the then-ruling Barbados Labour Party in the 1956 Barbadian general election. The Democratic Labour Party (DLP) was a split form the Democratic domain of the Barbados Labour Party In 1955. However, as a result of this common orgin, the two parties have been and is still remaining until today, ideologically similar and has similar believes about governing the affairs of Barbados. But the only difference between the two Political parties of Barbados the Democratic Labour Party (DLP) and Barbados Labour Party (BLP), is that the Democratic Labour Party (DLP) focuses more on Democracy and on Human rights, while the Barbados Labour Party (BLP) focuses more on Republicanism and Labour. The first leadership election was held in the Democratic Labour Party (DLP) headquarters of St. George Street In 1955, one day after the Democratic Labour Party (DLP) was founded by Errol Barrow. Errol Barrow contested in that leadership election against Co-founder of the Democractic Labour Party (DLP), Fredrick Smith. It was a heated and close leadership election, and Errol Barrow defeated Fredrick Smith by a large margin of votes and Errol Barrow secured and won 49% of the vote, while Fredrick Smith secured and won 32% of the vote. Barrow was sworn in as leader and President of the Democratic Labour Party (DLP) and Leader of the Opposition the following day after the 1955 Democratic Labour Party (DLP) leadership election. He appointed his Central Excutive Comitee also. Democratic Labour Party (DLP) Central Executive Commitee 1955: # Errol Barrow - Leader and President of the Democratic Labour Party (DLP) # Fredrick Smith - Chairman of the Democratic Labour Party (DLP) # Charles Broome - Deputy Chairman of the Democratic Labour Party (DLP) # James Cameron Tutor - Vice president of the Democratic Labor Party (DLP) # Theodore Branckler - Vice Chairman of the Democratic Labour Party (DLP) # Wynter Crawford - Secretary-General of the Democratic Labour Party (DLP) == Other websites == * Category:1955 establishments in North America Category:20th- century establishments in Barbados Category:Political parties in North America Category:Social democratic parties Category:Politics of Barbados Category:Organizations based in Barbados",
 "title": "Democratic Labour Party (Barbados)"
}