{
 "id": "685535",
 "text": "Errol Walton Barrow, PC, Queen's Counsel (21 January 1920 - 1 June 1987) was a Barbadian politician and statesman and was the nations and country’s first Prime Minister of Barbados. He served as the first Prime Minister of Barbados from 30 November 1966 - 8 September 1976 for his first term and again from 29 May 1986 - 1 June 1987 as his second term. He served twice as Head of government of Barbados. He also served as the third Premier of Barbados from 4 December 1961 - 30 November 1966 under British rule until independence on 30 November 1966 and as the nation’s and Country‘s first Prime minister after Independence that same year of 1966. He is considered to have been the principal architect of Barbadian Independence. Today he is referred by many as the ‘’Father of the Barbadian Nation’’ and the ‘’National Hero of Barbados’’. Barrow effectively dominated Barbadian politics from 1961 until his death on 1 June 1987, serving as the nation’s and Country Head of government under various titles for most of that period as Premier of Barbados and then Prime Minister of Barbados. Born into a family of political and civic activists in the parish of Saint Lucy, Barbados. He was also known and nicknamed as “Dipper Barrow” within the country and Nation itself because of the great work that he has done and devoted to the country of Barbados itself. == Biography == Born on 21 January 1920 in the Parish of Saint Lucy, Barbados , his parents names are unknown. Errol Walton Barrow was the youngest among his sibling of his Sister Nita Barrow. He had one Sister only. At the age of 7 in 1927, Barrow traveled abroad for his Primary education and Secondary education to the United Kingdom on the advice of his parents because education was weak in Barbados then in the 1920s and his family wanted him to presue his education abroad to become a successful person in the future. So when he and his family reached the United Kingdom In 1927 when Barrow was 7 years old and Nita Barrow was 11 years old. Category:1920 births Category:1987 deaths Category:Prime ministers of Barbados Category:Alumni of the London School of Economics Category:Barbadian lawyers Category:Military personnel of World War II Category:Members of the Privy Council of the United Kingdom Category:Barbadian King's Counsel",
 "title": "Errol Barrow"
}