{
 "id": "68560",
 "text": "A cover version (or simply \"cover\") is a song which is re-recorded by a singer or band, after another artist has released a recording of it. Sometimes the versions are similar, but sometimes they are very different. Many songs become more popular as cover versions than in their original recordings. Paul Revere and the Raiders recorded two songs, \"Louie, Louie\" and \"(I'm Not Your) Steppin' Stone\", that were bigger hits for other bands (The Kingsmen and The Monkees, respectively) than their versions. A few songs are covered so many times by different artists, that the songs become standards. \"Without You\" (written by Peter Ham and Tom Evans of the band Badfinger) was first covered by Harry Nilsson, then later by dozens of other singers, including Mariah Carey. \"Yesterday\" and \"Something\", written by Paul McCartney and George Harrison of The Beatles (respectively), are also standards. ==Famous cover versions== * \"The Twist\" (written and recorded by Hank Ballard, and later covered by Chubby Checker) * \"I Heard It Through the Grapevine\" (first recorded by Gladys Knight and the Pips, then later by Marvin Gaye) * \"Tainted Love\" (first recorded by Gloria Jones, then later by Soft Cell) * \"It's Gonna Take a Miracle\" (first recorded by The Royalettes, then later by Deniece Williams) ==Eurodance cover versions== * 8 feat Mr Mister: Broken Wings (Mr Mister) * 20 Century: You'll Be in My Heart (Phil Collins) * Alcazar: This Is the World We Live In (Genesis) * Andrew Spencer: Zombie (The Cranberries) * Aquagen: Hard to Say I'm Sorry (Chicago) * Aria Pozzi: Joe le taxi (Vanessa Paradis) * Aurora featuring Naimee Coleman: Ordinary World (Duran Duran) * Axxis: Here Comes the Rain Again (Eurythmics) * Beat Factory: Nothing's Gonna Change My Love for You (Glenn Medeiros); Take on Me (A-ha) * Bloqbusters: Forever Young (Alphaville) * Bluestar: Sweet Dreams (Are Made of This) (Eurythmics) * Boney M. vs Sash: Ma Baker (Boney M.) * Boys Town Gang: Can't Take My Eyes Off You (Frankie Valli) * Cascada: What Hurts the Most (Rascal Flatts) * Candy: Words (F. R. David) * Chris Rockford vs Jennifer Paige: Crush (Jennifer Paige) * CK n Supreme Dream Team: Dreamer (Supertramp) * Co.Ro & Taleesa: Because the Night (Patti Smith) * Colton Ford & Pepper Mashay: Signed Sealed Delivered (Stevie Wonder) * Crystal K Feat Melina: The Final Countdown (Europe) * Dana International: Woman in Love (Barbra Streisand) * Dance Floor Dons: Sweet Dreams My LA Ex (Rachel Stevens) * Deja Vu featuring Tasmin: Against All Odds (Phil Collins); I Don't Wanna Miss a Thing (Aerosmith) * DJ Analyser vs D JMC: We Belong (Pat Benatar) * DJ Miko: Hot Stuff (Donna Summer) * DJ Speedo featuring Angelica: There You'll Be (Faith Hill) * DJ Yanou & Do: Heaven (Bryan Adams) * East Side Beat: Ride Like the Wind (Christopher Cross) * E-rotic: Angel Eyes; SOS; The Winner Takes It All (ABBA) * Florida Inc: Fuck It (I Don't Want You Back) (Eamon) * Gigi D'Agostino: The Riddle (Nik Kershaw) * Global Deejays: The Sound of San Francisco (Scott McKenzie: San Francisco) * Hi Tack: Let's Dance (David Bowie) * Ignition X: It's My Life (Talk Talk) * Interactive: Forever Young (Alphaville) * Jan Wayne: Because the Night (Patti Smith); Only You (Yazoo); Take My Breath Away (Berlin); Total Eclipse of the Heart (Bonnie Tyler); Here I Am (Scorpions: Send Me an Angel); She's Like the Wind (Patrick Swayze) * Jaybee featuring Morris: Shattered Dreams (Johnny Hates Jazz) * Johnny Crockett: Shout (Tears for Fears) * Karen Perry: Fame (Irene Cara) * Kate Ryan: Désenchantée; Libertine (Mylène Farmer) * Keira Green: All Out of Love (Air Supply) * King of House: Billie Jean (Michael Jackson) * Kopykatz: Gonna Make You Sweat (C & C Music Factory) * Laurent Wolf featuring Fake: Another Brick (Fake) * Linda O: Because the Night (Patti Smith) * Liquid Dance: First Time (Robin Beck) * Lunatic DJs: Baby Love (The Supremes) * Mad'House: Like a Prayer, Holiday, ... (Madonna) * Mary Griffin: Knock on Wood (Amii Stewart) * Maurizzo: Here Comes the Rain (Eurythmics) * Max Factor: Go Your Own Way (Fleetwood Mac) * Mega Mania: Summer of 69 (Bryan Adams) * Milk Inc.: The Sun Always Shines on TV (A-ha) * Mirabeau: Back from Outta Space (Gloria Gaynor: I Will Survive) * Missingheart: Moonlight Shadow (Mike Oldfield) * Mixtery: Bring Me to Life (Evanescence, Daredevil soundtrack) * N-Trance: Do You Think I'm Sexy (Rod Stewart) * Nightflyer: Voyage voyage (Desireless) * No Secrets: Kids in America (Kim Wilde) * Nouky: When the Rain Begins to Fall (Jermaine Jackson & Pia Zadora) * Novaspace: Beds Are Burning (Midnight Oil); Dancing with Tears in My Eyes (Ultravox); Run to You (Bryan Adams); So Lonely (The Police); Time After Time (Cyndi Lauper); Wicked Game (Chris Isaak); Your Eyes (Vladimir Cosma) * Pascal: I Think We're Alone Now (Tiffany) * Paulina Rubio: I Was Made for Lovin' You (Kiss) * Playhouse: I Think We're Alone Now (Tiffany) * Perfecto: Anything for Love (Meat Loaf) * Power Pull feat Sun Ray: Hungry Eyes (Eric Carmen) * Pulsedriver: Cambodia (Kim Wilde) * Punk Division: Seven Nation Army (The White Stripes) * Richard Grey: Warped Bass (Soft Cell: Tainted Love) * RIP: Shut Up (The Black Eyed Peas) * Rochelle: Bring Me to Life (Evanescence, Daredevil soundtrack) * Royal Gigolos: California Dreaming (The Mamas & the Papas); No Milk Today (Herman's Hermits) * Sugarcubes: 99 Red Balloons (Nena) * Sylver: Lay All Your Love on Me (ABBA) * Tamperer featuring Maya: Feel It (Jackson Five) * The Cover Girlz: You're Beautiful (James Blunt) * Thelma Houston: Don't Leave Me This Way (Harold Melvin & the Blue Notes) * The Kinky Boyz: You Spin Me Round (Dead or Alive) * Ultra Flirt: Dancing with Tears in My Eyes (Ultravox); I Was Made for Lovin' You (Kiss) * Undercover: Baker Street (Gerry Rafferty) * Uniting Nations: Out of Touch (Hall & Oates) * Vanguarde: Gimme Gimme Gimme (ABBA, Façon Benny Benassi) * Vasco & Millboy: The Sun Always Shines on TV (A-ha) * Whigfield: Last Christmas (Wham!) * Wonderland: Heaven Is a Place on Earth (Belinda Carlisle) ==Sources== Category:Musical terminology",
 "title": "Cover version"
}