{
 "id": "685691",
 "text": "Donald Masike'Vanua Kalpokas (23 August 1943 – 20 March 2019) was a ni-Vanuatu politician and diplomat. He served as Prime Minister of Vanuatu twice (September 1991 – December 1991; March 1998 – November 1999). He was a member of the democratic socialist party Vanua'aku Pati. Kalpokas was born on the island of Efate. Kalpokas died on 20 March 2019, at the age of 75. == Biography == Donald Kalpokas was born on August 23, 1943, on Lelepa Island, New Hebrides. After graduating from Onesua School on Efate Island and King George VI School in Honiara, he entered the Teachers College in Auckland. From 1971 to 1974 he studied at the University of the South Pacific in Suva. From 1968 to 1976, he taught on behalf of the British National Service, and from 1975 to 1976 he taught at a British high school. Kalpokas later became the founder and first president of the Teachers' Association and the New Hebrides Cultural Association. === Political activity === In 1975, Kalpokas was first elected to the first House of Representatives. From 1978 to 1979, from 1979 to 1983, he served as Minister of Education in the Government of National Unity and then in the Government of Walter Linnaeus. Together with Walter Lini, he founded the Vanuatu Party, which advocated independence for the Anglo-French condominium New Hebrides, socialist policies, and support for the predominantly English-speaking population of Vanuatu. In 1983, Kalpokas became the country's foreign minister, which became independent in 1980, but resigned a few months later. In 1987, he was re-appointed Minister of Foreign Affairs, remaining in office for four years. On September 6, 1991, Kalkokas and several other members of the Vanuatu party won a no-confidence vote against Prime Minister Walter Linnaeus. After that, Kalpokas became the country's prime minister, remaining in office until the new parliamentary elections, which were won by the Union of Moderate Parties. In March 1998, after a successful parliamentary election for the Vanuatu Party and the National United Party, led by Lina, both parties formed a coalition government in which Kalpokas became prime minister and foreign minister on March 30, 1998. Vanuatu. However, in just a few months, the coalition fell apart, and Kalpokas formed a new coalition with the Union of Moderate Parties. Among his government's main achievements were the privatization of airports and the introduction of a 12.5% VAT. In November 1999, before the vote of no confidence, Kalpokas resigned as prime minister. In 2001, he also resigned as leader of the Vanuatu party. In August 2004, he ran for prime minister, receiving 26 votes in the first round, but was unable to gain the necessary support. In November 2007, Kalpokas was appointed Vanuatu's Permanent Representative to the United Nations and Ambassador to the United States. ==References== Category:1943 births Category:2019 deaths Category:Deaths from disease Category:Diplomats Category:Prime ministers of Vanuatu",
 "title": "Donald Kalpokas"
}