{
 "id": "685829",
 "text": "Dinmukhamed Akhmetuly \"Dimash\" Kunaev (; ; – 22 August 1993) was a Kazakh Soviet communist politician.Vronskaya, Jeanne (24 August 1993) \"Obituary: Dinmukhamed Kunayev\". The Independent London, Gazette Section, p. 18. who served as the First Secretary of the Communist Party of Kazakhstan from 1960 to 1962, and 1964 to 1986. == Early life == Kuneav was born on 12 January 1912, in Verny, Semirechye Oblast. His father, Minliakhmed (Akhmed) Zhumabaievich, a literate worked in agricultural and trade of the Alma-Ata oblast, and could write in both Russian and Kazakh. His mother, Zaure Baiyrovna Kunaeva, came from a poor family. They lived together for a long time. Kunaev might be from the Ysty tribe, and he said his ancestors were from the Baidıbek of the Senior juz. According to the official bio, he's Kazakh, and his ancestors lived near the Ili and Kürtı rivers. Kunaev was born in Almaty and grew up in a regular family. == Carrer == After finishing the Almaty №14th secondary school in 1930, he studied at the Institute of Non- Ferrous and Fine Metallurgy in Moscow, becoming a machine operator by 1936. By 1939, he became the chief engineer of the Pribalkhashatroi mine, joining the Communist Party of the Soviet Union (CPSU). During World War II, from 1942 to 1946, he served as the Deputy Chairman of the Council of People's Commissars of the Kazakh SSR. During his office, he oversaw the establishment of factories and enterprises relocated to Kazakhstan, mobilized and trained personnel for the Red Army, and contributed to wartime efforts. From 1946 to 1952, he was Deputy Chairman of the Council of Ministers of the Kazakh SSR. In 1952, he became the President of the Academy of Sciences of the Kazakh SSR, leading scientific research to develop industry, agriculture, and optimize the use of natural resources. He became the Chairman of the Council of Ministers of the Kazakh SSR, until 1955. Kunaev's political ascent was closely linked to Leonid Brezhnev. In 1960, Kunaev was elected as the First Secretary of the Communist Party of Kazakhstan, succeeding Nikolay Belyayev. == First Secretary == As First Secretary, Kunaev supported the Virgin Lands campaign, which turned many hectares in central Kazakhstan into farmland and attracted many Russian immigrants. However, he lost his job in 1962, because he didn't agree with Khrushchev's idea to give some of Southern Kazakhstan's land to Uzbekistan. Ismail Yusupov, who liked Khrushchev's idea, took his place. After being removed, Kunaev led the Council of Ministers of the Kazakh SSR until 1964. He became First Secretary again that year when Khrushchev was replaced by Brezhnev.Kunaev, Dinmukhammed (1992) O Moem Vremeni, Almaty: Dauir. Kunaev stayed in this powerful position for another 22 years.Drexel, John (1991) \"Kunayev, Dinmukhamed Akhmedovich (1912– )\" The Facts on File Encyclopedia of the Twentieth Century Facts on File, New York He was part of the Politburo, an important political group, from 1967 and became a full member in 1971, staying until 1987. Under Kunaev, many Kazakhs held high positions in government, the economy, and schools. In 1984, he appointed Nursultan Nazarbayev as Chairman of the Council of Ministers. But in 1986, Nazarbayev criticized Askar Kunayev, who was leading the Academy of Sciences and was Kunaev's brother. This made Kunaev very upset. He tried to get Nazarbayev fired, but instead, his brother lost his job, and Nazarbayev kept his. Soon, Mikhail Gorbachev removed Kunaev,\"Memorial plaque put up in Alma-Ata for ex-communist boss\" ITAR-TASS news agency: BBC Summary of World Broadcasts British Broadcasting Company (16 January 1995) and Gennady Kolbin took over, which makes upset many people in Almaty, leading to big protests in December 1986. These protests were the first big ethnic conflicts in Gorbachev's time.\"Kazakh Reformist Party for Renaming Town after Soviet-era Leader\" Global News Wire – Asia Africa Intelligence Wire British Broadcasting Company (23 August 2004) In January 1987, Kunaev was also removed from the Politburo and then from the Central Committee of the CPSU in June 1987. Kunaev lived in his hometown until he died on 22 August 1993 due to a heart attack. He was buried in Alma-Ata a few days later. ==References== Category:1912 births Category:1993 deaths Category:Kazakhstani politicians Category:Soviet politicians",
 "title": "Dinmukhamed Kunaev"
}