{
 "id": "685824",
 "text": "The Prime Minister of Kazakhstan is the head of government of Kazakhstan and the second most powerful person in the country after the President of Kazakhstan. The Prime Minister heads the cabinet and advises the President in the every day plans of the functions of the Parliament of Kazakhstan. ==List of prime ministers (since 1991)== No. Picture Name (Birth–Death) Term of office Term of office Party President of Republic of Kazakhstan 1 Sergey Tereshchenko (1951–2023) 14 October 1991 12 October 1994 Independent Nursultan Nazarbayev 2 Akezhan Kazhegeldin (1952–) 12 October 1994 10 October 1997 People's Union of Kazakhstan Unity Nursultan Nazarbayev 3 Nurlan Balgimbayev (1947–2015) 10 October 1997 1 October 1999 People's Union of Kazakhstan Unity Nursultan Nazarbayev 4 Kassym-Jomart Tokayev (1953–) 1 October 1999 28 January 2002 Otan Nursultan Nazarbayev 5 Imangali Tasmagambetov (1956–) 28 January 2002 13 June 2003 Otan Nursultan Nazarbayev 6 Daniyal Akhmetov (1954–) 13 June 2003 10 January 2007 Otan (2003–2004) ↓ Nur Otan (2004–2007) Nursultan Nazarbayev 7 Karim Massimov (1965–) 10 January 2007 24 September 2012 Nur Otan Nursultan Nazarbayev 8 Serik Akhmetov (1958–) 24 September 2012 2 April 2014 Nur Otan Nursultan Nazarbayev (7) Karim Massimov (1965–) 2 April 2014 8 September 2016 Nur Otan Nursultan Nazarbayev 9 Bakhytzhan Sagintayev (1963–) 8 September 2016 21 February 2019 Nur Otan Nursultan Nazarbayev 10 Askar Mamin (1965–) 21 February 2019 5 January 2022 Nur Otan Kassym-Jomart Tokayev 11 Alihan Smaiylov (1972–) 5 January 2022 5 February 2024 Nur Otan Kassym-Jomart Tokayev — Roman Sklyar (1971–) 5 February 2024 6 February 2024 Nur Otan Kassym-Jomart Tokayev 12 Oljas Bektenov (1980–) 6 February 2024 Incumbent Nur Otan Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev Kassym-Jomart Tokayev ==References== ==Other websites== * Official Site of the Prime Minister of Kazakhstan * PrimeMinister.kz on Youtube * Category:Government of Kazakhstan",
 "title": "Prime Minister of Kazakhstan"
}