{
 "id": "68604",
 "text": "This is a list of episodes for the American television series, Buffy the Vampire Slayer. The series began on March 10, 1997 and aired until May 19, 2003. In that time, 144 episodes of the series were made. Seasons one to five of the series ran on the WB. In 2001, it moved to the United Paramount Network (UPN) for its final two seasons. In the United Kingdom, the entire series aired on Sky One and BBC Two. All the seven seasons of the series are available on DVDs for regions 1 and region 2. Two all-season collections (The Chosen Collection and The Complete DVD Collection) have been also been released. == Summary == Season Episodes Originally aired DVD release date Region 1 Region 2 1 12 1997 January 15, 2002 November 27, 2000 2 22 1997 – 1998 June 11, 2002 May 21, 2001 3 22 1998 – 1999 January 7, 2003 October 29, 2001 4 22 1999 – 2000 June 10, 2003 May 13, 2002 5 22 2000 – 2001 December 9, 2003 October 28, 2002 6 22 2001 – 2002 May 25, 2004 May 12, 2003 7 22 2002 – 2003 November 16, 2004 April 5, 2004 == Season 1 (1997) == \"Welcome to the Hellmouth\" March 10, 1997 4V01 1 1x01 Buffy arrives in Sunnydale and is not happy to meet her new Watcher, Rupert Giles. A mysterious \"friend\" offers guidance, but Buffy resists her destiny until Willow and Jesse are abducted. Buffy saves Willow from an ordinary vampire, but loses track of Jesse in a confrontation with Luke, the Master's vampire Vessel. \"The Harvest\" March 10, 1997 4V02 2 1x02 After escaping from Luke, Buffy goes in search of Jesse, with a little help from Giles and Willow, from her mystery friend, Angel, and from Xander, who braves the dank, dark sewers with her. The Master plots the Harvest, a ritual designed to imbue him with strength enough to open the Hellmouth, but Buffy defeats his minions in a showdown at The Bronze. \"Witch\" March 17, 1997 4V03 3 1x03 Buffy tries out for Sunnydale High's cheerleading squad. The Scoobies at first suspect that Amy is causing all the havoc but discover that her mother, also a practicing witch, has swapped bodies with her. \"Teacher's Pet\" March 25, 1997 4V04 4 1x04 Xander is smitten by the substitute biology teacher, Ms French, who turns out to be a giant praying mantis terrifying enough to make vampires run for cover. Angel's warning gives Buffy a vital clue and she rescues the virgin male students—including Xander—chosen to fertilize the creature's eggs. \"Never Kill a Boy on the First Date\" March 31, 1997 4V05 5 1x05 Buffy's lovelife is looking up when she goes on a date with the normal Owen, but when Owen nearly gets killed during Buffy's battle to save Giles and the others from the Master's vampires, she decides that \"normal\" dating might be too dangerous after all. \"The Pack\" April 07, 1997 4V06 6 1x06 At the zoo, Xander and four other students sneak into the off-limits hyena habitat and become infected by an evil demon spirit. Xander and his pack grow more and more feral until Buffy, Giles and Willow reverse the spell. \"Angel\" April 14, 1997 4V07 7 1x07 Sharing their first kiss, Buffy is horrified to discover that Angel is a vampire. Bent on Slaying him, Buffy learns that Angel's soul was restored by a Gypsy curse, making him unique—and reviled—among his fellow undead. Angel stakes Darla, the vampire who made him, as she attempts to assassinate Buffy for the Master. \"I, Robot... You, Jane\" April 28, 1997 4V08 8 1x08 Willow meets a boy on the Internet, but \"Malcolm\" is really Moloch, an ancient demon released from bondage after Willow scanned his \"book\" into the school's computer. With help from Ms Calendar, Sunnydale High's computer teacher, Buffy foils Moloch's plan to upload himself into a giant robot. \"The Puppet Show\" May 05, 1997 4V09 9 1x09 After Principal Flutie's death, the new sheriff in Sunnydale High, Principal Snyder, forces Buffy and her friends to participate in the school talent show. When a boy's heart is harvested, Buffy suspects a fellow student and his strangely talkative dummy. \"Nightmares\" May 12, 1997 4V10 10 1x10 Sunnydale residents find their worst nightmares coming true and Buffy learns that a little boy in a coma is the cause. To solve the problem, the gang must wake him up and help him confront his fears. \"Out of Mind, Out of Sight\" May 19, 1997 4V11 11 1x11 Ignored by students and teachers alike, Marcie literally becomes invisible, then uses her affliction to terrorize Cordelia and her friends. Sympathetic at first, Buffy nevertheless stops Marcie when she goes too far. Men in black come to take Marcie away. \"Prophecy Girl\" June 02, 1997 4V12 12 1x12 Buffy quits Slaying when a prophecy predicts she will die in battle against the Master and the Anointed One, but soon puts aside her fear and enters the fray on her own timetable and terms. In fulfillment of prophecy, the Master indeed kills the Slayer and opens the Hellmouth, but learns too late that Buffy is resilient and unpredictable—and lethal. == Season 2 (1997 – 1998) == Title Original airdate Code Series # # \"When She Was Bad\" September 15, 1997 5V01 13 2x01 Buffy suffers a vision in which the Master, undead and undusted, kills her once again. The Anointed One plans to resurrect the slain Master in a ritual using his exhumed skeleton, with kidnapped Scooby Gang members as blood sacrifices. Buffy rescues her friends, then deals with her residual fear and anger by obliterating the Master entirely. \"Some Assembly Required\" September 22, 1997 5V02 14 2x02 Bodies of girls killed in traffic accidents are being dug from their graves. The culprits are two science students, Chris and Eric, using pieces of the girls to create a bride for Chris' monstrous brother, Daryl. The only thing the young Frankensteins need now is Cordy's head—can Scooby Gang members arrive in time to save her? \"School Hard\" September 29, 1997 5V03 15 2x03 The Night of St. Vigeous is fast approaching, when the power of all vampires will be at its peak. Spike and Drusilla blast into town and learn that Sunnydale has its very own Slayer. Impatient to add a third notch to his tally of Slayer-kills, Spike attacks Buffy at Sunnydale High on Parent Teacher Night—with disastrous results. \"Inca Mummy Girl\" October 6, 1997 5V04 16 2x04 After the seal of protection lying in her sarcophagus is broken, a mummified Incan girl in a museum exhibit is revivified when she sucks the life-force from a touring student. An unsuspecting Xander falls head over heels for the Latin beauty, Ampata, and must save Willow when his mistake threatens to cost her life. \"Reptile Boy\" October 13, 1997 5V05 17 2x05 Upset again at Angel, Buffy lies to Giles and goes to a frat party with Cordelia, where their dates drug them and chain them in the basement. The house brothers worship a snake demon and sacrifice girls to it annually in exchange for wealth and power. Giles, Angel and Willow compare notes and meet up with Xander just in time to help Buffy break up the cabal. \"Halloween\" October 27, 1997 5V06 18 2x06 Costume shop owner Ethan Rayne casts a spell that transforms kids into their costume personas. Angel and Cordelia try to help as Willow becomes a ghost, Xander a soldier and Buffy a brainless, helpless 18th-century noblewoman. Spike joins the fun and tries to take advantage of the Slayer's predicament, but Giles breaks Ethan's spell at a critical moment. \"Lie to Me\" November 02, 1997 5V07 19 2x07 Out patrolling, Buffy spies Angel with a demonstrative Drusilla, then catches him in a lie later. Billy \"Ford\" Fordham, Buffy's long-time LA school chum, transfers to Sunnydale High, but nobody suspects he is negotiating a deal with Spike—and offering the Slayer as trade goods. Angel enlists Willow's help on the QT. \"The Dark Age\" November 10, 1997 5V08 20 2x08 Haunted by his dark past when he was known as Ripper, Giles confronts his old crony Ethan Rayne in an attempt to save Jenny from the lethal consequences of possession by the demon Eyghon. With Giles and the Slayer slated as its next victims, demon-ridden Angel forces Eyghon to possess him instead. \"What's My Line? - Part 1\" November 17, 1997 5V09 21 2x09 To get help killing Buffy while he intensifies his search for Dru's cure, Spike calls upon the Order of Taraka. Buffy is attacked by a series of assassins, one of whom identifies herself as \"Kendra, the Vampire Slayer.\" Kendra, having seen \"vampire\" Buffy kissing vampire Angel, has already taken Angel out of the picture. \"What's My Line? - Part 2\" November 24, 1997 5V10 22 2x10 While Career Week drags on at Sunnydale High, Buffy and Kendra form an uneasy alliance to stop Spike from sacrificing Angel, whose blood, ritually spilled when the moon is full, is Drusilla's only cure. The Slayers bring Spike's plan, to host a massive killing spree for Dru's \"coming out party,\" down around his ears. \"Ted\" December 8, 1997 5V11 23 2x11 Buffy returns home one evening to find her mother kissing a stranger in the kitchen. Joyce's date, Ted, attacks Buffy, who accidentally kills him in self-defense. Believing herself guilty of manslaughter, the Slayer is hardly relieved to learn that Ted is a serial killer android targeting Joyce as his next wife/victim. \"Bad Eggs\" January 12, 1998 5V12 24 2x12 For Health class, students unknowingly adopt \"eggs\" of a Bezoar demon growing under the school. Its arachnoid \"babies\" are able to directly control a person's central nervous system. Dealing with a pair of outlaw vampire brothers in addition to slaying the enormous Bezoar before its progeny take over Sunnydale, Buffy gets ultra-grounded for her trouble. \"Surprise\" January 19, 1998 5V13 25 2x13 The Scoobies plan a surprise party for Buffy's 17th birthday. Drusilla plans her own celebration as Spike collects her presents: the disassembled pieces of The Judge, an ancient demon called to cleanse the world of humanity. Buffy and Angel try to stop him but they fail. In this episode, Buffy and Angel confess their deepest feelings and make love for the first time. \"Innocence\" January 20, 1998 5V14 26 2x14 Because he finds even \"one moment of true happiness\" in Buffy's arms, Angel's curse is broken; he loses his soul and reverts to the vicious killer, Angelus. Jenny Calendar turns out to be a Gypsy spy. Devastated by these betrayals, Buffy still takes out the reputedly indestructable Judge using her birthday present from Xander—a stolen rocket launcher. \"Phases\" January 27, 1998 5V15 27 2x15 There's a werewolf at large in Sunnydale and the Scoobies discover that it's Oz. Buffy tries to protect Sunnydale residents from the beast, and protect the savage beast from a bounty hunter who doesn't care that his target is human 27 days a month. Angelus stirs up trouble. Willow convinces Oz she still wants to see him, despite everything. \"Bewitched, Bothered and Bewildered\" February 10, 1998 5V16 28 2x16 Valentine's Day has everyone on edge. With secret reluctance, Cordelia dumps Xander to appease her friends. Crushed, Xander pressures Amy into casting a love spell, but it goes wrong and every woman in Sunnydale, except Cordy, becomes madly attracted to him. A smitten Dru saves Xander from Angelus, but who will save him from the screaming mob? \"Passion\" February 24, 1998 5V17 29 2x17 Angelus kicks his terror campaign against Buffy and her friends into high gear, leading them to believe Joyce is his next target. Jenny makes progress finding out the gypsy Ritual of Restoration and gets back together with Giles. Jenny and Giles also work with Buffy and Willow to ritually revoke Angel's invitations into their various homes. \"Killed by Death\" March 03, 1998 5V18 30 2x18 After flu lands Buffy in the hospital, she rescues fevered children from Der Kindestod, a nightmare demon invisible to healthy people. When getting well means losing her ability to fight the demon, Buffy reinfects herself. In saving the other children, she also avenges her young cousin and puts her own hospital phobia to rest. \"I Only Have Eyes for You\" April 28, 1998 5V19 31 2x19 The tortured ghost of a former Sunnydale High student reenacts a murder-suicide on the night of the school's Sadie Hawkins dance. Taken over to play the parts, Buffy and Angelus change the tragic outcome just enough for the lovers' spirits to find peace, and for Buffy to learn about forgiveness. \"Go Fish\" May 05, 1998 5V20 32 2x20 Xander goes undercover on the Sunnydale swim team after members begin turning up dead. The swim-team coach gives fish/steroid cocktails to the swim team to get them to perform, but it turns them into sea monsters. \"Becoming - Part 1\" May 12, 1998 5V21 33 2x21 Kendra's Watcher sends her back to Sunnydale because a dark power is rising: Angelus has found a demon called Acathla and plans to perform the ritual that will allow Acathla to suck every living thing on the planet into hell. \"Becoming - Part 2\" May 19, 1998 5V22 34 2x22 With Kendra murdered by Drusilla, Willow in the hospital with head trauma and Giles kidnapped by Angelus, Buffy must decode Whistler's cryptic clues and accept help from an unexpected source to be able to prevent the world from being sucked into Acathla's hell dimension. == Season 3 (1998 – 1999) == Title Original airdate Code Series # # \"Anne\" September 29, 1998 3ABB01 35 3x01 After sacrificing Angel, a distraught Buffy moves to Los Angeles, where she encounters Lily, a Sunnydale girl she once saved from Spike. When Lily is kidnapped by demons, Buffy rescues her again, then decides she's ready to resume Slaying. \"Dead Man's Party\" October 06, 1998 3ABB02 36 3x02 Buffy struggles to fit back into Sunnydale life. She feels her friends and family have grown distant while she was away. Battling an army of zombies called forth by a Nigerian demon mask brings everyone back together. \"Faith, Hope & Trick\" October 13, 1998 3ABB03 37 3x03 Another Slayer, Faith, arrives in Sunnydale, closely tracked by two vampires, thoroughly modern Mr. Trick and incredibly ancient Kakistos. With Buffy's encouragement, Faith finally stakes the formidable Kakistos. Buffy, finally, accepts Scott Hope's invitation to date, not knowing that Angel has magically returned. \"Beauty and the Beasts\" October 20, 1998 3ABB04 38 3x04 After Oz escapes from his cage, everyone suspects that he committed last night's brutal murders. Only Buffy knows that Angel is a suspect as well. The Scoobies discover that the murderer is their Jekyll/Hyde classmate, Pete. \"Homecoming\" November 03, 1998 3ABB05 39 3x05 Buffy and Cordelia compete for Homecoming Queen while Mr. Trick organizes SlayerFest '98. Willow and Xander kiss, although each sees someone else. Unknown to SlayerFest personnel, Cordelia changes places with Faith. Buffy and Cordy reconcile while defeating Mr. Trick's contestants. \"Band Candy\" November 10, 1998 3ABB06 40 3x06 A candy created by Ethan Rayne causes Sunnydale's adults to behave like teenagers. Buffy confronts Rayne and foils a plan to sacrifice Sunnydale newborns to a monster in the sewers. \"Revelations\" November 17, 1998 3ABB07 41 3x07 Faith's new Watcher, Gwendolyn Post, turns out to be an impostor. Xander discovers Buffy's secret and manipulates Faith into attempting to slay Angel. \"Lovers Walk\" November 24, 1998 3ABB08 42 3x08 A lovelorn Spike returns and kidnaps Willow to cast a love spell on Drusilla. Stashing Willow and a wounded Xander at the factory, Spike soon concocts a new plan and leaves Sunnydale as abruptly as he came, unaware that wedges have been driven into every relationship around him. \"The Wish\" December 08, 1998 3ABB09 43 3x09 Cordelia's pain over Xander's betrayal summons Anyanka, a demon who grants wishes to scorned women. In an alternate reality, the Master rises at the Harvest and takes over Sunnydale, but Giles is able to reverse events by destroying Anyanka's power center. \"Amends\" December 15, 1998 3ABB10 44 3x10 The First Evil is driving Angel insane, appearing as victims of his past crimes, priming him to kill Buffy. Instead, he tries to kill himself by waiting outside for the sunrise, but the sun doesn't shine that unexpectedly wintry day in southern California. \"Gingerbread\" January 12, 1999 3ABB11 45 3x11 Children are being killed as part of a cult sacrifice and Joyce leads the town in a witch hunt. Buffy, Willow and Amy are tied to stakes and Giles and Cordelia rescue them. Amy turns herself into a rat to escape the angry mob. \"Helpless\" January 19, 1999 3ABB12 46 3x12 Giles secretly prepares Buffy for the Cruciamentum, an ordeal the Watchers Council requires every Slayer endure on her eighteenth birthday. Giles helps Buffy, thereby failing his own secret test, and is dismissed from his job as Watcher because he \"feels a father's love\" for his Slayer. \"The Zeppo\" January 26, 1999 3ABB13 47 3x13 Xander tries to be cool and hangs out with Jack O'Toole, who resurrects three of his former buddies. Xander saves the world by defeating Jack in a contest of wills. His quiet victory gives the others the chance they need to prevent the Sisterhood of Jhe from reopening the Hellmouth. \"Bad Girls\" February 09, 1999 3ABB14 48 3x14 The Slayers get a new Watcher, Wesley Wyndam-Pryce. The girls are having a wild night at The Bronze, where Angel brings info on the whereabouts of the demon, Balthazar. While on the hunt, Faith accidentally kills the Deputy Mayor, a human. Buffy wants to come forward, but Faith claims she \"doesn't care.\" \"Consequences\" February 16, 1999 3ABB15 49 3x15 Faith tells Giles that Buffy is the one who slew the Deputy Mayor, but Giles guesses the truth. Angel apprehends Faith, but Wesley thwarts his intervention and allows Faith to escape. She plans to leave town on the next freighter, but secretly enters the Mayor's employ, after dusting his assassin, Mr. Trick. \"Doppelgangland\" February 23, 1999 3ABB16 50 3x16 Wanting to be a vengeance demon again, Anya tricks Willow into helping with a spell to retrieve her power center, the amulet Giles destroyed in an alternate reality (\"The Wish\"). Instead of the amulet, however, the spell transports Willow's vampire version to an unsuspecting Sunnydale. \"Enemies\" March 16, 1999 3ABB17 51 3x17 The Mayor and Faith plot to steal Angel's soul and let Angelus remove Buffy from the picture. An overconfident Faith reveals she's gone rogue, as well as details about the Mayor's Ascension, before Buffy and Angel tell her that it's all been a sting. Afterwards, Buffy tells Angel she needs some time apart. \"Earshot\" September 21, 1999 3ABB18 52 3x18 Buffy is infected by a demon's blood and gains the ability to read minds. As she goes insane, Angel, Giles and Wesley struggle to save her. At Sunnydale High, Buffy and Xander stop a potential sniper and a mass murder. \"Choices\" May 04, 1999 3ABB19 53 3x19 Buffy launches an offensive to shut down the Mayor's plans for Ascension. Willow chooses among colleges while Xander plans a road trip. Buffy and Angel cannot see a way around the obstacles to a successful life together. \"The Prom\" May 11, 1999 3ABB20 54 3x20 Angel decides to do the right thing and break up with Buffy. Buffy saves the prom from Hellhounds with a fetish for formal wear. Angel shows up for the last dance. \"Graduation Day - Part 1\" May 18, 1999 3ABB21 55 3x21 While the Mayor prepares for his Ascension, Buffy battles Faith to save Angel's life, needing her Slayer blood as antidote. She stabs Faith, but Faith jumps off the balcony and lands on a moving flatbed truck. \"Graduation Day - Part 2\" July 13, 1999 3ABB22 56 3x22 Buffy forces Angel to feed on her to save his life and he must rush her to the hospital to save hers. The Mayor Ascends, and the Class of '99 blows him and the school away. Meanwhile, Faith remains in a coma, from which the doctors don't expect her to ever wake. == Season 4 (1999 – 2000) == Title Original airdate Code Series # # \"The Freshman\" October 05, 1999 4ABB01 57 4x01 While Willow blossoms in the college environment, Buffy has a difficult time adjusting - getting lost, getting kicked out of a class for talking, meeting her Cher- loving roommate Kathy - and her Slaying suffers because of it. \"Living Conditions\" October 12, 1999 4ABB02 58 4x02 Buffy becomes convinced that her annoying roommate is evil, but her friends think she is mad. Buffy steals Kathy's toenail clippings to prove that Kathy is a Mok'tagar demon and they get into a fight. \"The Harsh Light of Day\" October 19, 1999 4ABB03 59 4x03 Spike returns to Sunnydale for a gem that will make him invincible, he finds it, but Buffy gets it away from him and decides to send it to Angel; Buffy returns to dating but ends up being let down and hurt. \"Fear, Itself\" October 26, 1999 4ABB04 60 4x04 The gang finds themselves in a real-life house of horrors while a Halloween frat party, in which a fear demon feeds on their individual fears. Meanwhile, Anya needs Giles to help her save Xander when she realizes something is amiss. \"Beer Bad\" November 02, 1999 4ABB05 61 4x05 Xander gets a job bar tending at the college pub; Buffy drinks with an upperclassmen at that pub. It turns out that the bar manager is spiking the beer with some supernatural mojo, causing the targets to revert to caveman mentality. \"Wild at Heart\" November 09, 1999 4ABB06 62 4x06 Oz meets another werewolf (Veruca) and locks her in his cage to prevent her from attacking people. Willow comes to the cage the next morning to find them naked together. Veruca tries to kill Willow, Oz-wolf kills Veruca, and Buffy stops him from attacking Willow. \"The Initiative\" November 16, 1999 4ABB07 63 4x07 Spike, who was captured by the commandos, is being held hostage by them in a hi-tech facility underneath the University. Spike manages to escape and heads to find Buffy, who he assumes is behind this; Riley realizes he has a crush on Buffy. \"Pangs\" November 23, 1999 4ABB08 64 4x08 Xander accidentally releases Hus, a Native American vengeance spirit. Angel secretly arrives in Sunnydale to protect Buffy, who is attempting a perfect Thanksgiving, from the spirit. \"Something Blue\" November 30, 1999 4ABB09 65 4x09 A spell by Willow goes awry, blinding Giles, and causing Buffy and Spike to fall in love and get engaged. Willow breaks the spell and Buffy and Spike find themselves in the middle of a kiss. \"Hush\" December 14, 1999 4ABB10 66 4x10 The Gentlemen steal the voices of the population of Sunnydale, rendering everyone in the town (including the Scooby Gang) unable to speak. Giles reveals that the only thing that can defeat The Gentleman is a real human scream. \"Doomed\" January 18, 2000 4ABB11 67 4x11 An earthquake occurs in Sunnydale, which signifies the Hellmouth is opening. The gang must return to the remains of Sunnydale High to stop it; Buffy and Riley struggle with each other's secrets. \"A New Man\" January 25, 2000 4ABB12 68 4x12 Giles, feeling left out, goes out for drinks with Ethan Rayne. He wakes up in the morning as a Fyarl demon, and hires Spike to help him. Mistaking him for a Fyarl demon, The Initiative and Buffy try to hunt him down. \"The I in Team\" February 08, 2000 4ABB13 69 4x13 When Professor Walsh decides Buffy is a threat to The Initiative, she decides to kill her by sending her on a dangerous mission. Riley discovers that Professor Walsh has tried to kill Buffy and begins to think seriously of leaving the organization. \"Goodbye Iowa\" February 15, 2000 4ABB14 70 4x14 Buffy discovers The Initiative's secret weapon; Riley becomes unstable due to the death of Professor Walsh and drug withdrawal; Adam reveals some information about himself, while trying to learn about people by investigating their insides. \"This Year's Girl\" February 22, 2000 4ABB15 71 4x15 Faith wakes up from her eight month coma and seeks revenge against Buffy. After failing to attack her, she switches bodies with Buffy using a gift given to her by Richard Wilkins III. \"Who Are You?\" February 29, 2000 4ABB16 72 4x16 Buffy (in Faith's body) is abducted by the Council's team, while Faith (in Buffy's body) has ruthless fun on the expense of Buffy. After rescuing a group of people in a church that has been attacked by vampires, they switch their bodies back. \"Superstar\" April 04, 2000 4ABB17 73 4x17 Jonathan casts a spell to cause all of Sunnydale to believe that he is the titular \"superstar\". However, the spell comes with a price - it conjures up a monster which endangers the town. \"Where the Wild Things Are\" April 25, 2000 4ABB18 74 4x18 When Buffy and Riley rouse a supernatural force at the fraternity party house, they are held hostage by ghost children who were abused by a Christian fundamentalist and now seek for revenge. Willow, Tara and Giles perform a spell to stop the spirits. \"New Moon Rising\" May 02, 2000 4ABB19 75 4x19 Oz returns to Sunnydale after learning to control his werewolf instincts. However, he loses control when he suspects Tara and Willow's relationship, and is subsequently caught by the Initiative. \"The Yoko Factor\" May 09, 2000 4ABB20 76 4x20 Riley spars with Angel when Angel visits Sunnydale; Adam convinces Spike that he will take his chip out if he helps him get Buffy where he wants, Spike agrees and sets out to distance the Scoobies from each other. \"Primeval\" May 16, 2000 4ABB21 77 4x21 The Scoobies reveal Adam's plan of releasing an army of hybrid cyborg monsters. Buffy, into an eerie version of herself with the help of the gang's magic, manages to kill Adam after an intense fight. \"Restless\" May 23, 2000 4ABB22 78 4x22 A primordial spirit haunts Buffy, Giles, Willow and Xander in their individual, cryptic nightmares involving the First Slayer as a result from the magic done in the previous episode. == Season 5 (2000 – 2001) == Title Original airdate Code Series # # \"Buffy vs. Dracula\" September 26, 2000 5ABB01 79 5x01 Buffy faces Count Dracula who has come to Sunnydale to make her one of his concubines. Dracula turns Xander into a Renfield of sorts, before being defeated but not killed. \"Real Me\" October 03, 2000 5ABB02 80 5x02 Buffy is having trouble getting along with her new sister Dawn, who is kidnapped by Harmony's gang. Harmony makes two inept attempts on Buffy's life, but fails each time and Dawn is saved. \"The Replacement\" October 10, 2000 5ABB03 81 5x03 Xander is split into two people by a demon, one strong, the other weak. The lame Xander is unhappy that the cool Xander lives his life better than he can, getting an apartment and a date with Anya. \"Out of My Mind\" October 17, 2000 5ABB04 82 5x04 Riley is risking his health to be able to fight with Buffy. His super soldier enhancement is destroying his heart. Buffy enlists Spike to take Riley to the doctor, but instead Spike kidnaps the doctor. \"No Place Like Home\" October 24, 2000 5ABB05 83 5x05 The new Bad Girl (Glory), is looking for \"The Key.\" Buffy meets Glory, who kicks her ass, and a monk, who explains to her that she doesn't actually have a sister — Dawn is The Key, sent to Buffy for protection. \"Family\" November 07, 2000 5ABB06 84 5x06 Tara is about to celebrate her 20th birthday, and her family comes to abduct her before she becomes a demon. Glory sends demons after the Slayer, and Tara accidentally helps them. \"Fool for Love\" November 14, 2000 5ABB07 85 5x07 After a close call, Buffy asks Spike about the slayers he's killed; he exploited their death wish. Buffy rebuffs Spike's advances, and he comforts her after first thinking of killing her. \"Shadow\" November 21, 2000 5ABB08 86 5x08 Joyce Summers has brain cancer, and Buffy worries about how Dawn will take it. In addition, Buffy must keep her sister safe from Glory and her magic snake. \"Listening to Fear\" November 28, 2000 5ABB09 87 5x09 As Buffy and Dawn help their mother prepare for surgery, an extraterrestrial preys on Sunnydale's mental patients and follows Joyce home. The alien was summoned by Ben to clean up Glory's mess, and Buffy kills it. \"Into the Woods\" December 19, 2000 5ABB10 88 5x10 After sex with him, Buffy learns Riley has been going to a vampire brothel to be sucked. She confronts him, and he says he's going away with the military if she doesn't give him a reason to stay. She wants him to stay, but doesn't tell him in time. \"Triangle\" January 09, 2001 5ABB11 89 5x11 Emotions between Willow and Anya come to a boil over Xander, and they summon a troll (Olaf). The troll tries to make Xander choose between the women, but Buffy sends him packing. \"Checkpoint\" January 23, 2001 5ABB12 90 5x12 The Watcher's Council withholds information about Glory from Buffy. Glory and the Knights of Byzantium target Buffy, and she realizes it's because she has power over them. She orders Quentin to give her the scoop on Glory; she's a god, not a demon. \"Blood Ties\" February 06, 2001 5ABB13 91 5x13 Dawn discovers that she is the Key, becomes depressed, and runs away. She tells her tale to Ben, who morphs into Glory. Glory decides Dawn doesn't know the Key's location, and Willow and Tara teleport Glory elsewhere. \"Crush\" February 13, 2001 5ABB14 92 5x14 Spike's profession of love for Buffy is spurned when Drusilla returns. He offers to kill Dru, but Buffy is unimpressed. He saves Buffy from Dru, but has his invitation to the Summers' home revoked. \"I Was Made to Love You\" February 20, 2001 5ABB15 93 5x15 A robot girlfriend, April, is spurned by her creator, Warren. When April goes looking for him, he tells her Buffy is his girlfriend, and she attacks Buffy. Her batteries run down and Buffy convinces her she doesn't need a man. \"The Body\" February 27, 2001 5ABB16 94 5x16 Buffy and the gang are crushed by the death of Joyce. Dawn goes to the morgue to see the body and is attacked by a vampire. Buffy saves her and watches as Dawn reaches to touch Joyce. \"Forever\" April 17, 2001 5ABB17 95 5x17 Buffy is comforted by Angel, although he can't stay. Dawn attempts to resurrect Joyce with the help of Spike and Doc, but stops part way through the ceremony. \"Intervention\" April 24, 2001 5ABB18 96 5x18 The Scoobies discovers Spike's new toy; Glory's minions kidnap Spike, thinking he is the Key. \"Tough Love\" May 01, 2001 5ABB19 97 5x19 Glory thinks she has found the Key - Tara. \"Spiral\" May 08, 2001 5ABB20 98 5x20 Glory discovers the Key, and Buffy and company must flee from the Knights of Byzantium, too. \"The Weight of the World\" May 15, 2001 5ABB21 99 5x21 Willow tries to reach the Slayer, who has been rendered catatonic by Dawn's abduction. \"The Gift\" May 22, 2001 5ABB22 100 5x22 Buffy faces Glory as the ritual commences. == Season 6 (2001 – 2002) == Title Original airdate Code Series # # \"Bargaining - Parts 1 and 2\" October 02, 2001 6ABB01 6ABB02 101 102 6x01 6x02 Giles leaves Sunnydale after wondering whether he still has a place in Sunnydale without Buffy. Meanwhile, a vampire discovers that the Slayer has been replaced by a robot. The Scoobies manage to raise Buffy from the dead with a powerful spell. \"After Life\" October 09, 2001 6ABB03 103 6x03 Spike warns that the resurrection spell could have serious consequences, and his assessment proves to be correct as members of the gang are possessed by an unseen force. \"Flooded\" October 16, 2001 6ABB04 104 6x04 Warren, Andrew, and Jonathan have teamed up in order to take over Sunnydale; they manage to send an M'Fashnik demon to kill Buffy, who they believe to be their biggest threat. \"Life Serial\" October 23, 2001 6ABB05 105 6x05 Buffy will soon be in serious need of money to support herself and Dawn, and she tries to focus on doing something useful and profitable. However, her attempts fail as Jonathan, Warren and Andrew are after her to make her life more difficult. \"All the Way\" October 30, 2001 6ABB06 106 6x06 Xander finally announces his engagement to Anya, and the group make their way back to Buffy's house to celebrate; Dawn sneaks out on Halloween by lying to Buffy; Willow uses magic with abandon. \"Once More, with Feeling\" November 06, 2001 6ABB07 107 6x07 A mysterious force compels Sunnydale residents to break out into song and dance numbers that reveal their true feelings, a new demon in town, Sweet, seems to be responsible for it; Buffy and Spike share a kiss. \"Tabula Rasa\" November 13, 2001 6ABB08 108 6x08 Willow and Tara argue over an amnesia spell, and Tara insists that Willow is dependent on magic. Willow promises to go a week without using magic but breaches the promise, causing the gang to forget who they are. \"Smashed\" November 20, 2001 6ABB09 109 6x09 Willow finds herself alone without Tara and discovers she's now powerful enough to turn the metamorphosed Amy from a rat back into human. Spike discovers that he can hurt Buffy. \"Wrecked\" November 27, 2001 6ABB10 110 6x10 Buffy is shaken by her previous meeting with Spike the night before, which caused the building around them to collapse; Willow gives up magic after abusing it and faces the symptoms of withdrawal. \"Gone\" January 08, 2002 6ABB11 111 6x11 A social services worker threatens to take Dawn away from Buffy; Jonathan, Warren and Andrew attempt to make themselves invisible, but the beam accidentally hits Buffy. \"Doublemeat Palace\" January 29, 2002 6ABB12 112 6x12 Buffy gets a job at the Doublemeat Palace, but suddenly comes with a strange theory over the food ingredients; Anya is visited by an old friend, Halfrek, who questions her relationship with Xander. \"Dead Things\" February 05, 2002 6ABB13 113 6x13 Warren, Andrew and Jonathan try to make Warren's ex-girlfriend Katrina their sexual slave using magic, but when she fights back she accidentally gets killed. They decide to make Buffy think that she has killed Katrina, using magical and demonic forces. \"Older and Far Away\" February 12, 2002 6ABB14 114 6x14 Dawn, feeling that nobody wants to spend time with her, makes a wish in front of a vengeance demon that everyone would stay with her. Fulfilling her wish, the demon causes everyone at Buffy's birthday party to be unable to leave. \"As You Were\" February 26, 2002 6ABB15 115 6x15 Riley returns to town with his new wife Sam, to track down a demon known as \"The Doctor\", which turns out to be Spike. Riley finds about Buffy's affair with Spike, and Buffy decides to break up with him. \"Hell's Bells\" March 05, 2002 6ABB16 116 6x16 Xander's future self suddenly appears, and warns him that his marriage to Anya will be nothing but the beginning of a life of disgrace and pain. Xander believes him and leaves Anya. They eventually find that the future self is a former victim of Anyanka's revenges, and was planning to destroy Anya's life. \"Normal Again\" March 12, 2002 6ABB17 117 6x17 Warren, Jonathan and Andrew unleash a demon whose powers make Buffy believe that her friends are figments of her imagination. Buffy attempts to attack her friends, locks them in her basement and unleashes the same demon on them. Tara eventually finds the trio and Buffy recovers from the Demon's poison by drinking an antidote. \"Entropy\" April 30, 2002 6ABB18 118 6x18 Anya seeks vengeance on Xander and when looking for someone who wants the same, she finds comfort with Spike. Xander sees their impulsive behavior through a camera and tries to stake Spike; Willow and Tara arrange a date, which ends with the two of them kissing. \"Seeing Red\" May 07, 2002 6ABB19 119 6x19 Willow and Tara reconcile, and Tara tells Willow that Spike and Buffy have been having sex; Buffy stops The Trio when attempting a large-scale theft, but Warren manages to escape with a jetpack. He returns the next day and shoots Buffy and Tara. \"Villains\" May 14, 2002 6ABB20 120 6x20 Willow's grief pushes her over the edge. After magically saving Buffy, a dark Willow hunts Warren down and eventually kills him in a gruesome way. \"Two to Go\" May 21, 2002 6ABB21 121 6x21 The Scoobies must protect Jonathan and Andrew from Willow; Giles returns to help. \"Grave\" May 21, 2002 6ABB22 122 6x22 Willow defeats Giles and decides to end her suffering and that of the worlds by bringing on an apocalypse. == Season 7 (2002 – 2003) == Title Original airdate Code Series # # \"Lessons\" September 24, 2002 7ABB01 123 7x01 Dawn finds vengeful spirits in the new Sunnydale High; Giles is rehabilitating Willow in England. \"Beneath You\" October 01, 2002 7ABB02 124 7x02 The gang deals with a giant underground demon; Willow prepares to return home. \"Same Time, Same Place\" October 08, 2002 7ABB03 125 7x03 Willow cannot find her friends in Sunnydale, where bodies are found without skin. \"Help\" October 15, 2002 7ABB04 126 7x04 Buffy becomes a counselor at Sunnydale High and meets a girl who predicts her own death. \"Selfless\" October 22, 2002 7ABB05 127 7x05 Buffy deals with Anyanka after she grants a lethal wish; Anya's background story is also revealed. \"Him\" November 05, 2002 7ABB06 128 7x06 The young women of Sunnydale are falling for the high school quarterback; Xander and Spike become reluctant roommates. \"Conversations with Dead People\" November 12, 2002 7ABB07 129 7x07 Buffy, Dawn, and Willow face individual encounters with familiar faces from their past. Also, Jonathan and Andrew return to Sunnydale to unearth a mysterious symbol. \"Sleeper\" November 19, 2002 7ABB08 130 7x08 Buffy probes a series of grisly murders that may be the work of Spike. \"Never Leave Me\" November 26, 2002 7ABB09 131 7x09 The Summers' home gains two captives: Spike and Andrew. \"Bring on the Night\" December 17, 2002 7ABB10 132 7x10 Giles arrives with three apprentice Slayers; the Scoobies research the First; Buffy fights an ancient vampire. \"Showtime\" January 07, 2003 7ABB11 133 7x11 Buffy must win back the confidence of potential slayers. \"Potential\" January 21, 2003 7ABB12 134 7x12 Buffy and Spike establish a boot camp to prepare the potential slayers for combat, while a spell from Willow reveals another potential in Sunnydale. \"The Killer in Me\" February 04, 2003 7ABB13 135 7x13 Willow must face her own demons; Buffy gets in touch with the government. \"First Date\" February 11, 2003 7ABB14 136 7x14 Buffy accepts a dinner invitation from Principal Wood; Anya is jealous when Xander has a date. \"Get It Done\" February 18, 2003 7ABB15 137 7x15 Buffy learns more about the First Slayer. \"Storyteller\" February 25, 2003 7ABB16 138 7x16 Andrew makes a documentary on the events in Sunnydale. \"Lies My Parents Told Me\" March 25, 2003 7ABB17 139 7x17 The gang investigates Spike's trigger; Principal Wood and Giles team up without Buffy. \"Dirty Girls\" April 15, 2003 7ABB18 140 7x18 Faith returns to Sunnydale; Buffy leads the troops into battle. \"Empty Places\" April 29, 2003 7ABB19 141 7x19 As the residents of Sunnydale evacuate, Buffy loses the trust of the group and is forced out of the house. Faith becomes the leader. \"Touched\" May 06, 2003 7ABB20 142 7x20 A depressed Buffy is comforted by Spike; the Scoobies capture and interrogate a Bringer; Faith decides on a plan. \"End of Days\" May 13, 2003 7ABB21 143 7x21 Buffy finds a scythe in the cave; an old ally returns to Sunnydale. \"Chosen\" May 20, 2003 7ABB22 144 7x22 Buffy and her associates organize an attack on The First Evil. Willow uses a spell to invoke the chosen ones, the slayers. Spike uses the amulet and brings about the end of Sunnydale, and the Hellmouth. Final episode of \"Buffy The Vampire Slayer\" == References == * TV.com . Episode listing/guide. Retrieved October 20, 2006 ** Season 1 , 2, 3, 4, 5, 6, 7 * Next-episode.net. Episode listing/guide. Retrieved October 28, 2006 ** Season 1, 2, 3, 4, 5, 6, 7 * Homepage.mac.com . Episode listing/guide. Retrieved October 28, 2006 ** Season 1 , 2 , 3 , 4 , 5 , 6 , 7 * Buffyguide.com. Episode listing/guide. Retrieved October 28, 2006 ** Season 1, 2, 3, 4, 5, 6, 7 * IMDb.com . Region 1 DVD release dates. Retrieved October 28, 2006 * BBC.co.uk. Region 2 DVD release dates. Retrieved October 28, 2006 === Notes === Category:Buffy the Vampire Slayer episodes Buffy the Vampire Slayer",
 "title": "List of Buffy the Vampire Slayer episodes"
}