{
 "id": "686461",
 "text": "Laura Marie Marano (born November 29, 1995) is an American actress and singer. She is the younger sister of actress Vanessa Marano. Laura played Ally Dawson in the Disney Channel television series Austin & Ally. In the movie A Sort of Homecoming, Marano played Young Amy. Marano was born in Los Angeles, California. ==Filmography== === Film === Year Title Role Notes 2003 Finding Nemo Additional voices 2005 Young Jackie 2006 Ice Age: The Meltdown Additional voices 2007 Goldfish Suzy Short film Superbad Young Becca 2015 Young Amy Alvin and the Chipmunks: The Road Chip Hotel Babysitter 2017 Lady Bird Diana Greenway 2019 The Perfect Date Celia Lieberman In post-production 2019 The War With Grandpa Mia TBA Saving Zoë'' Echo In post-production === Television === Year Title Role Notes 2003–2006 Without a Trace Kate Malone Recurring role (seasons 2–4) 2004 Joan of Arcadia Emily Episode: \"Night Without Stars\" 2005 Medical Investigation Brooke Beck Episode: \"Tribe\" 2005–2006 Scout Y Voice; main role 2006 Ghost Whisperer Audrey Episode: \"Friendly Neighborhood Ghost\" Huff Amelia Episode: \"Black Shadows\" Dexter Young Debra Episodes: \"Let's Give the Boy a Hand\", \"Father Knows Best\" 2007 Are You Smarter than a 5th Grader? Herself / Judge / Mentor Season 1 2007–2008 Back to You Gracie Carr Main role 2007–2010 The Sarah Silverman Program Heather Silverman / Young Sarah Silverman Recurring role 2008 Ni Hao, Kai-Lan Mei Mei Voice; episode: \"Kai-Lan's Trip to China\" Gary Unmarried Louise Brooks Episodes: \"Pilot\", \"Gary Gets Boundaries\" 2009 Heroes Young Alice Shaw Episode: \"1961\" Little Monk Cousin Lauren Episode: \"Little Monk and the Monk Cousin\" 2010 True Jackson, VP Molly Episode: \"Little Buddies\" FlashForward Young Tracy Episode: \"Blowback\" Childrens Hospital Haley Episode: \"Frankfurthers, Allman Brothers, Death, Frankfurters\" 2011–2016 Austin & Ally Ally Dawson Main role 2014 Randy Cunningham: 9th Grade Ninja Rachel Voice; recurring role (season 2) Fish Hooks Girl Hamster #2 Voice; episode: \"Algae Day\" Liv and Maddie Fangs Special guest star; episode: \"Howl-A-Rooney\" 2015 Bad Hair Day Monica Reeves Television film Pickle and Peanut Veronica Voice: \"Gory Agnes, Haunted Couch\" Girl Meets World Ally Dawson Special guest star; episode: \"Girl Meets World of Terror 2\" 2016 Mère et Fille, California Dream Herself Television film 2018 Miraculous: Tales of Ladybug & Cat Noir Clara Nightingale Episode: \"Frightningale\" ==Radio== Year Title Role Notes 2016 For the Record with Laura Marano Host Radio Disney ==Awards and nominations== Year Award Category Work Result 2014 Teen Choice Awards Choice TV Actress: Comedy Austin & Ally 2015 Kids' Choice Awards Favourite TV Actress Austin & Ally Remi Awards Rising Actress A Sort of Homecoming Teen Choice Awards Choice Summer TV Star: Female Austin & Ally Choice TV: Chemistry (with Ross Lynch) Austin & Ally 2016 Kids' Choice Awards Favorite Female TV Star Austin & Ally Teen Choice Awards Choice TV Actress: Comedy Austin & Ally Streamy Awards Original Song Boombox 2017 Detroit Film Critics Society Miglior Ensemble The cast of Lady Bird San Diego Film Critics Society Best Cast The cast of Lady Bird Seattle Film Critics Society Best Ensemble The cast of Lady Bird Florida Film Critics Circle Best Cast The cast of Lady Bird Online Film Critics Society Best Ensemble The cast of Lady Bird 2018 Critics' Choice Movie Awards Best Acting Ensemble The cast of Lady Bird Georgia Film Critics Association Best Ensemble The cast of Lady Bird ==References== Category:American television actors Category:American movie actors Category:Actors from Los Angeles Category:1995 births Category:Living people",
 "title": "Laura Marano"
}