{
 "id": "686787",
 "text": "Microsoft Store (previously Windows Store) is an app store for Microsoft Windows, Windows Server and Xbox OS. It was first made for Windows 8 and Windows Server 2012 to make adding new programs easier for the users. When Windows 10 was released, Microsoft put Xbox Store, Windows Marketplace, Xbox Music, Xbox Video, and the Windows phone store all in one program they called Microsoft Store. In 2015, there were more than 670,000 different programs on Microsoft Store. The biggest groups of programs were Games and Entertainment. Before a program is added to the Microsoft Store, it must pass security, content, and compatibility checks. == History == === The Web-based storefront === Microsoft previously maintained a similar digital distribution system for software known as Windows Marketplace, which allowed customers to purchase software online. The marketplace tracked product keys and licenses, allowing users to retrieve their purchases when switching computers. Windows Marketplace was discontinued in November 2008. At this point, Microsoft opened a Web-based storefront called \"Microsoft Store\". === Windows 8 === Microsoft first announced Windows Store, a digital distribution service for Windows at its presentation during the Build developer conference on September 13, 2011. Further details announced during the conference revealed that the store would be able to hold listings for both certified traditional Windows apps, as well as what were called \"Metro-style apps\" at the time: tightly-sandboxed software based on Microsoft design guidelines that are constantly monitored for quality and compliance. For consumers, Windows Store is intended to be the only way to obtain Metro-style apps. While announced alongside the \"Developer Preview\" release of Windows 8, Windows Store itself did not become available until the \"Consumer Preview\", released in February 2012. Updates to apps published on the store after July 1, 2023, won't be available to all Windows 8 RTM users except Windows Embedded 8 Standard users. Per Microsoft lifecycle policies, Windows 8 reached the end of mainstream support on January 9, 2018 and will reach the end of extended support on January 10, 2023. The mainstream support for Windows Embedded 8 Standard ended on July 10, 2018 and will reach the end of extended support on July 11, 2023. === Windows 8.1 === An updated version of Windows Store was introduced in Windows 8.1. Its home page was remodeled to display apps in focused categories (such as popular, recommended, top free and paid, and special offers) with expanded details, while the ability for apps to automatically update was also added. Windows 8.1 Update also introduced other notable presentation changes, including increasing the top app lists to return 1000 apps instead of 100 apps, a \"picks for you\" section, and changing the default sorting for reviews to be by \"most popular\". Updates to apps published on the Store after July 1, 2023, are no longer available to Windows 8.1. Per Microsoft lifecycle policies, Windows 8.1 reached the end of mainstream support on January 9, 2018 and will reach the end of extended support on January 10, 2023. === Windows RT === The installation of apps and games from the Windows Store is the only way to get apps on Windows RT, a mobile version of Windows 8 or Windows 8.1 designed to run on tablets. Normal apps such as Google Chrome, world's most popular web browser can't be installed through any web browser on the Internet for Windows RT, even through Internet Explorer, which is a built in web browser in Windows RT, and also in Windows 8 or Windows 8.1 and earlier. === Windows 10 === Windows 10 was released with an updated version of the Windows Store, which merged Microsoft's other distribution platforms (Windows Marketplace, Windows Phone Store, Xbox Video and Xbox Music) into a unified store front for Windows 10 on all platforms, offering apps, games, music, film, TV series, themes, and ebooks. In June 2017, Spotify became available in the Windows Store. In September 2017, Microsoft began to re-brand Windows Store as Microsoft Store, with a new icon carrying the Microsoft logo. Xbox Store was merged into this new version of the platform. This is in line with Microsoft's platform convergence strategy on all Windows 10-based operating systems. Web apps and traditional desktop software can be packaged for distribution on Windows Store. Desktop software distributed through Windows Store are packaged using the App-V system to allow sandboxing. In February 2018, Microsoft announced that Progressive Web Apps would begin to be available in the Microsoft Store, and Microsoft would automatically add selected quality progressive web apps through the Bing crawler or allow developers to submit Progressive Web Apps to the Microsoft Store. Starting from Windows 10 version 1803, fonts can be downloaded and installed from the Microsoft Store. === Windows 11 === In Windows 11, Microsoft Store received an updated user interface, and a new pop-up designed to handle installation links from websites. Microsoft also announced a number of changes to its policies for application submissions to improve flexibility and make the store more \"open\", including supporting \"any kind of app, regardless of app framework and packaging technology\", and the ability for developers to freely use first- or third-party payment platforms (in non-game software only) rather than those provided by Microsoft. === Windows Server === Windows Store is available in Windows Server 2012 and Windows Server 2012 R2 but is not installed by default. It's unavailable in Windows Server 2016 and Windows Server 2019. However, UWP apps can be acquired from Microsoft Store for Business (formerly Windows Store for Business) and installed through sideloading. ==Programmer tools== Microsoft Store provides developer (people who write programs) tools for tracking apps in the store. They can track downloads, the money they make, if the program doesn't work, and ratings. ==Most liked apps== These are the most liked apps and games on the Microsoft Store on Mobile and PC. Most liked apps and games on PC Rank Apps Games 1 iTunes Candy Crush Soda Saga 2 Spotify Hidden City: Hidden Object Adventure 3 Netflix Caesars Casino 4 Instagram Roblox 5 Messenger Minecraft for Windows 10 6 Facebook Asphalt 9: Legends 7 Microsoft Sticky Notes March of Empires: War of Lords 8 Hulu Candy Crush Saga 9 Whatsapp Desktop Microsoft Solitaire Collection 10 Pandora Seekers Notes: Hidden Mystery 11 Slack House of Fun Slots Casino 12 Microsoft OneNote Slotomani- Free Casino Slots 13 Adobe Photoshop Express Sniper Fury 14 Honey Disney Magic Kingdoms 15 VLC Asphalt 8: Airborne 16 TED Forza Horizon 4 Ultimate Edition 17 Readtit Age of Empires:Definitive Edition 18 Sway Gear of War 4 19 Picart The Walking Dead: Season 1 20 Twitter Farming Simulator 18 21 Power Director 9 Stat Of Decay 2: Ultimate Edition 22 Affinity photo Minecraft Story Mode: Season Two 23 Affinity Designer Demon Hinter 2: New Chapter 24 Mixer Go Euro Truck Simulator 2017 Pro 25 TikTok ReCore 26 Kodi Bonfire Stories: The Faceless Gravedigger 27 Plex Assassin's Creed Pirates 28 Hotspot Shield Wenjia 29 Share.it Stronghold Kingdoms: Castle Sim 30 Bigo Live Instnt War 31 Linkedln Phantom Trigger 32 We Chat for Window StarTraders:Frontiers 33 Office Lens Asphalt 9: Legends 34 Pinterest Sniper Fury 35 Samsung Flow Hill Climb Racing 36 Cricbuzz Traffic Rider 3D 37 Saavn Music and Radio OverKill 3 38 SoundCloud 39 Dailymotion PUBG 40 Evernote Ludo King 41 Flipboard Cooking Fever 42 LastPass:Free Passward Manager Dead Rivals - Zombie MMO 43 Line CHESS FREE! 44 Wikipedia My Talking Tom 45 Save To Pocket Iron Blade - Meadieval Legenda RPG 46 CNN Word Link 47 Quora Gangster - Guns of Boom 48 Splash Township 49 Drawboard PDF Smash Hit Ball 50 UC Browser Dragon Mania Legends 51 Blender Sunset Overdrive Most Popular apps and games on Mobile Rank Apps Games 1 Facebook Candy Crush Saga 2 Netflix Candy Crush Soda Saga 3 Whatsapp Olympus Rising: Hero Defense 4 Instagram House of Fun Slots Casino 5 Messenger Township 6 Facebook (Beta) Dragon Mania Legends 7 Free Player for YouTube- Watch and Share Bingo Blitz - Free Bingo + Slots 8 Spotify Seekers Notes®: Hidden Mystery 9 Messenger (Beta) Bubble Witch 3 Saga 10 Pandora Subway Surfers 11 Video Player Downloader for YouTube Knife Hit Pro 12 Imo Free Video Calls and Text Hungry Shark Evolution 13 Viber World At Arms - Wage War for Your Nation 14 MyRadar Jewel legend 15 Xodo: PDF Reader and March of Empire: War of Lords 16 Telegram Modern Combat 5 17 Skype Angry Birds 18 Vine Temple Run 2 19 Line Machinarium 20 Yummly Hungry Shark Evolution 21 Shazam FIFA 17 Mobile 22 HULU Stickman Soccer 23 VLC Score! World Goals 24 Bloomberg Pool Tour Masters 25 Flipboard Pocket Tanks 26 Fuse Sniper Fury 27 Adobe Photoshop Express Dredd vs Zombies 28 Oneshot Baseball Riot 29 LastPass Flight Control 30 8 Zip Tap The Frog 31 Uber Cut the Rope (original + Experiments + 2) 32 Yelp Flow Free 33 Avis Epic Battle Dude 34 UC Browser HD Royal Revolt! 35 Evernote Battleloot Adventure 36 eBay Rainbow Tangle 37 Amazon Store Chess By Post 38 Adobe Reader Subway Surfers 39 Instanote Spider-Man Unlimited 40 One Drive Sonic Dash 41 Office Lens Rail Rush 42 Slack (Beta) Despicable Me: Minion Rush 43 Readit Battery Guy 44 TED Crimson Dragon: Side Story 45 IMDb Air Soccer Fever Pro 46 Groove Music Zombie Anarchy 47 OneNote Rainbow Tangle 48 Edmodo Final Fantasy 49 Kahoot! Age of Cavemen 50 PicsArt Age of Empires: Castle Siege == References == == Other websites == * Category:Microsoft Windows software Category:Windows games",
 "title": "Microsoft Store"
}