{
 "id": "687143",
 "text": "Total Drama All Stars and Pahkitew Island make up the fifth season of the Total Drama series. The first half of the season debuted on September 10, 2013, and the other half on July 7, 2014. Total Drama All Stars takes place at Camp Wawanakwa once again. It brings back 14 old contestants; 7 from World Tour and 7 from Revenge of the Island. The characters are split into teams, based on their performances in previous seasons; whether they were evil or good. Total Drama Pahkitew Island brings an all new cast of 14 contestants. It takes places at a new island, called Pahkitew Island. The characters are split into two teams: Waneyihtam Maskwak and Pimâpotew Kinosewak, both in the Cree language meaning Confused Bears and Floating Salmon, respectively. == Total Drama All Stars == === All Stars Contestants === Contestant Team Merge Placing Episode Count Lindsay Heroic Hamsters Didn't Make Merge 14th place 1/13 episodes Lightning Villainous Vultures Didn't Make Merge 13th place 3/13 episodes Jo Villainous Vultures Didn't Make Merge 12th place 3/13 episodes Sam Heroic Hamsters Didn't Make Merge 11th place 4/13 episodes Heather Villainous Vultures Didn't Make Merge 10th place 7/13 episodes Sierra Heroic Hamsters Didn't Make Merge 9th place 7/13 episodes Duncan Heroic Hamsters (Switched from VV) Did Make Merge 8th place 8/13 episodes Cameron Villainous Vultures (Switched from HH) Did Make Merge 7th place 10/13 episodes Alejandro Villainous Vultures Did Make Merge 6th place 11/13 episodes Courtney Villainous Vultures (Switched from HH) Did Make Merge 5th place 11/13 episodes Gwen Villainous Vultures Did Make Merge 4th place 13/13 episodes Scott Villainous Vultures Did Make Merge 3rd place 12/13 episodes Zoey Heroic Hamsters Did Make Merge 1st/2nd place 13/13 episodes Mike Heroic Hamsters Did Make Merge 1st/2nd place 13/13 episodes == Total Drama Pahkitew Island == === Pahkitew Island Contestants === Contestant Team Merge Placing Episode Count Beardo Waneyihtam Maskwak Didn't Make Merge 14th place 1/13 episodes Leonard Waneyihtam Maskwak Didn't Make Merge 13th place 2/13 episodes Amy Pimâpotew Kinosewak Didn't Make Merge 12th place 4/13 episodes Rodney Pimâpotew Kinosewak Didn't Make Merge 11th place 4/13 episodes Samey Pimâpotew Kinosewak Didn't Make Merge 10th place 5/13 episodes Ella Waneyihtam Maskwak Didn't Make Merge 9th place 6/13 episodes Topher Pimâpotew Kinosewak Didn't Make Merge 8th place 8/13 episodes Dave Waneyihtam Maskwak Did Make Merge 7th place 10/13 episodes Scarlett Pimâpotew Kinosewak Did Make Merge 6th place 10/13 episodes Max Waneyihtam Maskwak (Switched from PK) Did Make Merge 5th place 10/13 episodes Jasmine Pimâpotew Kinosewak Did Make Merge 4th place 12/13 episodes Sugar Waneyihtam Maskwak Did Make Merge 3rd place 12/13 episodes Shawn Waneyihtam Maskwak Did Make Merge 1st/2nd place 13/13 episodes Sky Pimâpotew Kinosewak (Switched from WM) Did Make Merge 1st/2nd place 13/13 episodes Category:Total Drama",
 "title": "Total Drama All Stars and Pahkitew Island"
}