{
 "id": "68718",
 "text": "Joe Rogan (born August 11, 1967) is an American podcaster, commentator, comedian, and actor. He has a podcast and YouTube show called The Joe Rogan Experience. Rogan hosted a debate about Internet censorship between Tim Pool and Jack Dorsey. Rogan is also a color commentator for the Ultimate Fighting Championship. He holds a Brown Belt in Brazilian jiu-jitsu under Eddie Bravo and Jean Jacques Machado. A lot of the people that he has interviewed on it are known for being controversial people on the Internet and are called the Intellectual Dark Web. He has also interviewed people with controversial ideas about the vaccine for Covid-19. He played the role of Joe Garrelli in NewsRadio and hosted the television game/reality program Fear Factor. == Politics and Voting History == Rogan has been described as a libertarian. He self-identifies as socially liberal, supporting same-sex marriage, gay rights, women's rights, recreational drug use, universal healthcare, universal basic income, and gun rights Rogan said he liked Bernie Sanders in 2016 but he ended up voting for Gary Johnson because Johnson agreed to be interviewed on Rogan's show. Rogan told Jimmy Dore that he liked Bernie Sanders and Tulsi Gabbard but everyone else could “eat shit.” He told Bari Weiss that he also liked Andrew Yang but that he would probably vote for Sanders. After Sanders lost, Rogan said he wouldn't vote for Joe Biden. In 2024, Rogan interviewed Robert F Kennedy Junior and said he liked him. Rogan later interviewed Donald Trump, JD Vance and Elon Musk and said that he would vote for Trump because Musk convinced him to vote for Trump. ==References== Category:1967 births Category:Living people Category:Actors from Newark, New Jersey Category:American game show hosts Category:American martial artists Category:American television actors Category:American television presenters Category:Comedians from Newark, New Jersey Category:Participants in American reality television series Category:Podcasters Category:Television personalities from New Jersey Category:Libertarians",
 "title": "Joe Rogan"
}