{
 "id": "68712",
 "text": "Anne Jacqueline Hathaway (born November 12, 1982) is an American movie and stage actress. She has won many awards including an Academy Award, a British Academy Film Award, a Golden Globe Award, and a Primetime Emmy Award. == Career == Hathaway became famous for her leading role in The Princess Diaries. and its sequel. Following this, she appeared in several family movies in the early 2000s. She made a transition into adult films with her roles in the 2005 drama Brokeback Mountain and the comedy-drama The Devil Wears Prada (2006). She has since starred in many films including Tim Burton's 2010 Alice in Wonderland, The Dark Knight Rises, Les Misérables and The Devil Wears Prada. She has also done voice acting in movies including Rio. == Life == Anne Jacqueline Hathaway was born in New York City. Her mother is a former actress. She was raised as a Roman Catholic. Hathaway has spoken about her depression when she was a teenager. She originally wanted to be a Catholic nun before starting her acting career. === Marriage and children === Hathaway married actor and businessman Adam Shulman on September 29, 2012. They have two sons together, Jonathan (born 2016) and Jack (born 2019) . == Public image == Forbes reported that Hathaway was one of the world's highest-paid actresses in 2015. In 2009, she was included on Forbes' annual Celebrity 100 list with earnings of $7 million. As of July 2018, her films have grossed $6.7 billion worldwide. She has also done several advertising campaigns for brands. === Activisim and political opinions === Anne Hathaway supports abortion rights, gun control, immigrant rights, gender equality, same-sex marriage and racial equality. Following the Russian invasion of Ukraine, she donated money to charities helping Ukrainians. == Filmography == === Movies === Year Title Role Notes 2001 The Princess Diaries Mia Thermopolis Main role The Other Side of Heaven Jean Sabin 2002 Nicholas Nickleby Madeline Bray 2003 The Cat Returns Haru Yoshioka (voice) 2004 Ella Enchanted Ella of Frell The Princess Diaries 2: Royal Engagement Mia Thermopolis 2005 Hoodwinked! Red Puckett (voice) Havoc Allison Lang Brokeback Mountain Lureen Newsome Twist 2006 The Devil Wears Prada Andy Sachs 2007 Becoming Jane Jane Austen 2008 Get Smart Agent 99 Get Smart's Bruce and Lloyd: Out of Control Agent 99 Cameo appearance Rachel Getting Married Kym Buchman Passengers Claire Summers 2009 Bride Wars Emma Allen Valentino: The Last Emperor Herself Documentary 2010 Valentine's Day Liz Curran Alice in Wonderland Mirana / White Queen Love & Other Drugs Maggie Murdock 10 Mountains 10 Years Narrator (voice) Documentary 2011 Rio Jewel (voice) One Day Emma Morley 2012 The Dark Knight Rises Catwoman Les Misérables Fantine 2013 Girl Rising Narrator (voice) Documentary Don Jon Emily Lombardo Cameo appearance 2014 Song One Franny Ellis Also producer Rio 2 Jewel (voice) Don Peyote Agent of TRUTH Cameo appearance Interstellar Dr. Amelia Brand 2015 The Intern Jules Ostin 2016 Alice Through the Looking Glass White Queen Colossal Gloria Also executive producer 2018 Ocean's 8 Daphne Kluger 2019 Serenity Karen Zariakas The Hustle Josephine Chesterfield Dark Waters Sarah Barlage Bilott 2020 The Last Thing He Wanted Elena McMahon The Witches The Grand High Witch 2021 Locked Down Linda 2022 Armageddon Time Esther Graff 2023 Eileen Rebecca Saint John She Came to Me Patricia Lauddem Also producer TBA Mothers' Instinct Celine The Idea of You Solène Also producer Mother Mary TBA Filming === Television === Year Title Role Notes 1999–2000 Get Real Meghan Green 22 episodes 2007 Elmo's Christmas Countdown Herself Television special 2008 Saturday Night Live Host Episode: \"Anne Hathaway/The Killers\" 2009 The Simpsons Jenny (voice) Episode: \"The Good, the Sad and the Drugly\" 2010 The Simpsons Princess Penelope (voice) Episode: \"Once Upon a Time in Springfield\" Saturday Night Live Host Episode: \"Anne Hathaway/Florence + the Machine\" Family Guy Mother Maggie (voice) Episode: \"Go, Stewie, Go!\" Family Guy Herself (voice) Episode: \"April in Quahog\" 2011 83rd Academy Awards Host Television special; co-host with James Franco Family Guy Hot Blonde (voice) Episode: \"It's a Trap!\" 2012 Saturday Night Live Host Episode: \"Anne Hathaway/Rihanna\" The Simpsons Jenny (voice) Episode: \"Moonshine River\" 2015 HitRecord on TV Vivica Virus Episode: \"Re: The Number Two\" Lip Sync Battle Herself Episode: \"Anne Hathaway vs. Emily Blunt\" 2016 Documentary Now! Herself Episode: \"Mr. Runner Up: My Life as an Oscar Bridesmaid, Part 2\" 2019 Modern Love Lexi 2 episodes 2020 Sesame Street: Elmo's Playdate Herself Television special 2021 RuPaul's Drag Race Herself Episode: \"Social Media: The Unverified Rusical\" Solos Leah Episode: \"LEAH\" 2022 WeCrashed Rebekah Neumann Miniseries (8 episodes); also executive producer Storybots: Answer Time Secret Agent Lady Episode: \"Lasers\" === Stage === Year Title Role(s) Venue 2002 Carnival! Lili New York City Center 2003 The Woman in White Laura Fairlie Sydmonton Workshop 2005 Children and Art Performer New Amsterdam Theatre 2009 Twelfth Night Viola Delacorte Theater 2015 Grounded Unnamed pilot The Public Theater 2017 Woman with unfaithful lover Carnegie Hall ==References== == Other websites == * * * * * Category:1982 births Category:Living people Category:Actors from Brooklyn Category:American movie actors Category:American stage actors Category:American television actors Category:American voice actors Category:BAFTA Award winning actors Category:Best Supporting Actress Academy Award winners Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:Saturn Award winners Category:Screen Actors Guild Award winners Category:Former Roman Catholics Category:American LGBT rights activists Category:Musicians from Brooklyn",
 "title": "Anne Hathaway"
}