{
 "id": "687285",
 "text": "The Speculation and vacancy tax is a provincial property tax levied in the Province of British Columbia starting in 2019. It is an opt-out tax paid when the property is vacant. It is paid in addition to the regular property tax. The rate for this tax is a half per cent of a home's assessed value for owners who are residents of British Columbia (BC), one per cent for Canadians from other provinces and two percent for owners from other countries. Homes that are not exempt from this tax, pay it in addition to their regular property tax. This tax is not to be confused with Vancouver's empty homes tax, which is also being levied on empty homes located in the city of Vancouver.https://www.cbc.ca/news/canada/british-columbia/need-to-know-bc- speculation-tax-1.4999882 All owners of homes in British Columbia are invited to fill out applications for exemption from this tax every year. If a home is owned by more than one person, for example a couple, all owners must complete a separate application for exemption. A part-owner who does not file for an exemption must pay the tax based on their proportional part of the assessed value even if the home is occupied. Tens of thousands of homeowners have not filed for exemption by March 30, 2019. The BC Goverment says the tax is a \"key measure in tackling the housing crisis in major urban centres in British Columbia\". It says that it took this action because the people who live and people who work in BC deserve to have affordable housing. According to the goverment, the tax is a part of it's 30-Point Plan to make housing more affordable. The tax is Targeted at speculators who own homes in BC but do not pay taxes. It changes empty homes into occupied housing. It also creates revenue which will pay for affordable housing. This tax is levied on empty homes in most urban centers: * Metro Vancouver, except Bowen Island and the Village of Lions Bay. * Abbotsford * Mission * Chilliwack * Kelowna * West Kelowna * District of Lantzville * Municipalities within the B.C. Capital Regional District, except Salt Spring Island, Juan de Fuca Electoral Area, and the Southern Gulf Islands. * Nanaimo Within these areas, any reserve lands, treaty lands, or self-government First Nations are exempt. The rate of the tax for all Canadians has been lowered to one half of a percent. This happened after negotiating between the NDP Party and the Green Party. ==Reception== Some commentators such as Douglas Todd believe that this tax has achieved it's goal. He says that prices of homes in Vancouver are moderating as a result of the tax being implemented. The speculation tax has been named as one of the contributors to a slump in commercial real estate investment in Vancouver in 2018. Asian investments in Vancouver declined to less than $350 million from more than $1 billion in 2016 and 2017. According to government figures the tax brought in revenues of $115 million from 12,029 homeowners iduring a 15-months period in the 2018-2019 provincial fiscal yearwhich ended on March 31, 2019. The tax has caught many unaware. For example, a Victoria, BC resident who bought a home in 2018 but worked in the United States the previous year, ended up owing almost five thousand dollars to the BC government. In August of 2019 John Mackie of The Province reported that this provincial vacancy tax and the Empty Homes Tax are leading to larger numbers of real estate listings of luxury condos in downtown Vancouver. ==References== == Other websites == *Official website *Speculation and Vacancy Tax Act Category:British Columbia Category:Taxation in Canada taxation",
 "title": "Speculation tax"
}