{
 "id": "68727",
 "text": "Darin Zanyar (born June 2, 1987), known simply as Darin, is a pop singer from Sweden. Darin was the first place runner-up in the Swedish Idol 2004, acquiring a fanbase primarily of teenage girls. Darin lives in Vällingby outside of Stockholm. He is of Kurdish heritage, and he speaks Central Kurdish. He won the Kurd of the year award in 2005 presented by Swedish Minister for Public Health and Social Services Morgan Johansson. Darin released his first album in February 2005, with songs by Swedish hit maker Max Martin and Swedish artist Robyn. The same year he released his 2nd album “Darin” which went platinum and provided him even more success than his debut album. At the end of 2006, Darin released his 3rd album “Break the News”. It went straight to number 1 in the chart and went gold the first day. Following his success in Sweden, Darin signed a new deal with EMI Germany, Switzerland and Austria. Zanyar currently has an entry in the Melodifestivalen 2010 in hopes of representing Sweden at the Eurovision Song Contest 2010 in Oslo. Today he is one Sweden's best selling artists with 7 number one albums. In 2018 Darin was the most played artist on radio in all of Sweden, thanks to his songs \"Tvillingen\" and \"Astronaut\". The following year he held his first arena tour in Stockholm Globen, Gothenburg Scandinavium and Malmö Malmö Arena. ==Albums== *The Anthem (2005) *Darin (2005) *Break the News (2006) *Flashback (2008) *Lovekiller (2010) *Exit (2013) *Fjärilar i magen (2015) *Tvillingen (2017) ==Singles== * 2005 – \"Money for Nothing\" * 2005 – \"Why Does It Rain\" * 2005 – \"Step Up\" * 2005 – \"Who's That Girl\" * 2005 – \"Want Ya!\" * 2006 – \"Perfect\" * 2006 – \"Everything But The Girl\" * 2006 – \"Desire\" * 2007 – \"Insanity\" * 2008 – \"Breathing Your Love\" feat. Kat DeLuna * 2008 – \"See U At The Club\" * 2008 – \"Runaway\" * 2008 – \"What If\"[förtydliga] * 2009 – \"Viva La Vida\" * 2010 – \"You're Out Of My Life\" * 2010 – \"Can't Stop Love\" * 2010 – \"Lovekiller\" * 2010 – \"Microphone\" * 2012 – \"Nobody Knows\" * 2012 – \"Stockholm\" * 2012 – \"En Apa Som Liknar Dig\" * 2012 – \"I Can't Get You Off My Mind\" * 2012 – \"Astrologen\" * 2012 – \"Seven Days a Week\" * 2013 – \"Playing With Fire\" * 2013 – \"So Yours\" * 2013 – \"Check You Out\" * 2014 – \"Dream Away\" feat. Eagle-Eye Cherry * 2014 – \"All Our Babies\" feat. Sophie Zelmani * 2014 – \"Mamma Mia\" * 2015 - \"Ta mig tillbaka\" * 2017 - \"Tvillingen\" * 2020 - \"En säng av rosor\" == References == ==Other websites== Category:1987 births Category:Living people Category:Swedish singers",
 "title": "Darin (singer)"
}