{
 "id": "687367",
 "text": "Darren Everett Criss (born February 5, 1987) is an American actor and singer- songwriter. He is known for his roles as Blaine Anderson in the series Glee and as serial killer Andrew Cunanan in the limited crime series The Assassination of Gianni Versace: American Crime Story (2018). For his role as Cunanan, he won an Emmy Award and a Golden Globe Award. ==Filmography== Year Title Role Notes 2005 I Adora You Josh Short film, minor role 2009 Walker Phillips Elliott Short film 2010 The Chicago 8 Yippee Man Minor role 2011 Glee: The 3D Concert Movie Blaine Anderson Concert documentary 2012 Girl Most Likely Lee Feature film debut 2013 The Wind Rises Katayama Voice 2013 The Tale of the Princess Kaguya Sutemaru Voice (English dub) 2013 Six by Sondheim Franklin Shepard HBO documentary 2014 Stan Lee's Mighty 7 Micro Voice 2015 Wrestling Isn't Wrestling Theatre Audience Member Short film 2019 Batman vs. Teenage Mutant Ninja Turtles Raphael Voice; direct-to-video 2019 Midway Commander Eugene E. Lindsey 2020 Superman: Man of Tomorrow Clark Kent/Superman Voice; direct-to-video 2021 Justice Society: World War II Clark Kent/Superman (Earth-1); Superman (Earth-Two) 2023 Legion of Super-Heroes Clark Kent/Superman 2023 Justice League: Warworld Clark Kent/Superman == Television == Year Title Role Notes 2009 Eastwick Josh Burton Recurring role, 5 episodes Little White Lie Toby Phillips 11 episodes; also co-songwriter and musical producer 2010 Cold Case Ruben Harris Episode: \"Free Love\" 2010–15 Glee Blaine Anderson Recurring role (Season 2); 14 episodes Main role (seasons 3–6) 2011 Archer Mikey and Tommy Voice, episode: \"Placebo Effect\" Life of LeopoldLife Of Leopold . Life Of Leopold; retrieved June 20, 2011. Leopold Bonar Voice 2011–12 The Glee Project Himself 4 episodes 2012 Glee: Don't Stop Believing Himself Documentary on Glee The Cleveland Show Hunter Voice, episode: \"Jesus Walks\" 2013 Web Therapy Augie Sayles 3 episodes 2013 Teen Choice Awards Co-host Co-hosted with Lucy Hale 2014 Whose Line Is It Anyway? Himself Episode: \"Darren Criss\" 2015–17 Transformers: Robots in Disguise Sideswipe Voice 2015 American Horror Story: Hotel Justin Recurring role, 2 episodes 2016 Teenage Mutant Ninja Turtles: Turtles Take Time (and Space) Raphael Voice, short Transformers: Rescue Bots Sideswipe Voice, episode: \"The Need for Speed\") Hairspray Live! Himself Television special, NBC 2017 Supergirl Music Meister Episode: \"Star-Crossed\" The Flash Music Meister Episode: \"Duet\" 2018 The Assassination of Gianni Versace: American Crime Story Andrew Cunanan 9 episodes 2020 Saturday Night Seder Himself Television special The Disney Family Singalong Himself Television special Hollywood Raymond Ainsley 7 episodes; also executive producer Royalties Pierce 10 episodes; also executive producer Wayward Guide for the Untrained Eye Ryan Reynolds 1 episode 2021 Trese Marco Voice Rick and Morty Bruce Chutback Voice, episode: \"Amortycan Grickfitti\" Muppets Haunted Mansion The Caretaker TV special 2022 Green Eggs and Ham Looka Voice, 7 episodes ==References== Category:Golden Globe Award winning actors Category:Emmy Award winning actors Category:1987 births Category:Living people Category:American LGBT rights activists Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:American pop singers Category:American pop musicians Category:American pianists Category:American guitarists Category:American drummers Category:Musicians from San Francisco Category:Writers from San Francisco Category:Actors from San Francisco Category:Singer-songwriters from California Category:American Internet celebrities",
 "title": "Darren Criss"
}