{
 "id": "687365",
 "text": "Andrew Phillip Cunanan (August 31, 1969 – July 23, 1997) was an American serial killer and gold digger. He murdered five people, including Italian fashion designer Gianni Versace and Chicago real estate developer Lee Miglin, during a three-month period from April to July 1997. He was a gay prostitute. ==Early life== Cunanan was born in National City, California. He lived in San Diego, California. He had antisocial personality disorder. Cunanan studied, but dropped out shortly afterwards from the University of California, San Diego. ==Murders== Cunanan's serial killings began in Minneapolis on April 27, 1997, with the murder of his close friend 28-year-old Jeffrey Trail. He later murdered his ex-boyfriend David Madson by shooting him in the back near Rush City, Minnesota. On May 4, 1997, he drove to Chicago where he killed real estate developer Lee Miglin at his Gold Coast home by stabbing him multiple times. Five days later, Cunanan shot and killed 45-year-old cemetery caretaker William Reese and stole his red pickup truck. On July 15, Cunanan murdered Italian fashion designer Gianni Versace, shooting him twice on the front stairway of his Miami Beach mansion, Casa Casuarina. A witness pursued Cunanan but was unable to catch him. ==Final days and suicide== On July 23, 1997, eight days after killing Versace, Cunanan killed himself with a gunshot through the mouth while living in a boat as police officials were close to arresting him. He was 27 years old. ==Pop culture== Cunanan was played by Darren Criss in The Assassination of Gianni Versace: American Crime Story, which premiered on January 17, 2018. Criss won an Emmy Award for \"Outstanding Lead Actor in a Limited Series or Movie\" and a Golden Globe Award for \"Best Actor – Miniseries, or Television Film\" for his portrayal. ==References== Category:1969 births Category:1997 deaths Category:Murderers who committed suicide Category:American serial killers Category:People with antisocial personality disorder Category:Gay men Category:LGBT criminals Category:LGBT people from California Category:Criminals from California Category:People from San Diego",
 "title": "Andrew Cunanan"
}