{
 "id": "687346",
 "text": "TRAPPIST-1 (or 2MASS J23062928-0502285) is an ultracool red dwarf star located almost 40 light years away from the Sun in the constellation of Aquarius. The red dwarf is known for having seven Earth-sized rocky planets around it.https://www.space.com/41714-water-rich-exoplanets-trappist-1-system.html | TRAPPIST-1 Worlds Are Rocky and Rich in Water, New Research Uncovers | September 05, 2018 These planets were discovered between 2016 and 2017, and are likely rocky and some may even have liquid water on them.https://www.nasa.gov/feature/jpl/new-clues-to-trappist-1-planet-compositions-atmospheres | New Clues to TRAPPIST-1 Planet Compositions, Atmospheres | Feb. 5, 2018 | NASA Four of these planets (d, e, f, and g) are in the habitable zone, so they are most likely to have liquid water. Three other planets here (b, c, and h) are not in the habitable zone, and are likely not habitable. ==Planets== In August of 2017, the Hubble Space Telescope possibly found traces of possible water in the atmospheres of some of the TRAPPIST-1 planets.https://www.spacetelescope.org/news/heic1713/ | Hubble delivers first hints of possible water content of TRAPPIST-1 planets | 31 August, 2017 *Trappist 1-b - The closest planet to Trappist 1 and likely akin to Venus. It's extremely hot (over 1400°K/ 1224°C at the surface) due to the planet only being 1.7 million km from its star. The planet has a likely runaway greenhouse effect that immures almost all of the heat that hits it. *Trappist 1-c - The next closest planet to Trappist 1 and also likely Venus like. *Trappist 1-d - At the innermost edge of the system's habitable zone, Trappist 1-d could be livable or too hot like Venus, it is debatable. *Trappist 1-e - Squarely in the habitable zone, this planet is likely to have a slightly higher land to ocean ratio than Earth. *Trappist 1-f - This planet is probably a water world. *Trappist 1-g - The furthest planet from Trappist 1 that is confirmed to be in the system's liveable zone and could be a water world with little dry land. *Trappist 1-h - The furthest out and the smallest planet in the system. The gravity is similar to that of the Moon and it's likely to be covered in an ice shell. ==References== Category:Red dwarfs Category:Aquarius (constellation) Category:TRAPPIST-1",
 "title": "TRAPPIST-1"
}