{
 "id": "687401",
 "text": "The following is a list of deaths that should be noted in April 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==April== ===1=== * Dimitar Dobrev, 87, Bulgarian wrestler. * Sinethemba Jantjie, 30, South African footballer (Free State Stars), car crash.PSL star Sinethemba Jantjie killed in car accident, Free State Stars confirm * Francisco Massiani, 74, Venezuelan writer and painter.Fallece el escritor venezolano Francisco Massiani * Vonda N. McIntyre, 70, American science fiction author (Dreamsnake), pancreatic cancer.Vonda N. McIntyre (1948-2019) * Ruth-Margret Pütz, 89, German coloratura soprano.Zum Tode von Ruth-Margret Pütz * Rafael Sánchez Ferlosio, 91, Spanish writer, Cervantes Prize winner (2004).Muere Rafael Sánchez Ferlosio, maestro singular de las letras españolas, a los 91 años * Vodka, 14, Japanese racehorse, laminitis. ===2=== * Matoug Adam, 93, Libyan politician, Minister of Tourism (1968–1969) and Interior (1969).اهم الاخبار وفاة آخر وزير داخلية في حكومة “المملكة” * Herman Braun-Vega, 85, Peruvian painter.Fallece el pintor peruano Herman Braun-Vega a los 85 años * J. Mahendran, 79, Indian movie director (Mullum Malarum, Nenjathai Killathe, Kamaraj) and actor.A big loss for cinema: veteran actor- director Mahendran no more * Jamshid Mashayekhi, 84, Iranian actor (The Cow, Qeysar, Hezar Dastan), pneumonia caused by laryngeal cancer. * Sergio Valdés, 85, Chilean footballer (Universidad Católica, national team), leukaemia.Falleció Sergio Valdés: exdefensor que consiguió el tercer lugar en el Mundial de 1962 * Franz Weber, 91, Swiss environmentalist and animal welfare activist.Pioneering environmentalist Franz Weber dies aged 91 * Don Williamson, 85, American businessman and politician, Mayor of Flint, Michigan (2003–2009), problems from a respiratory illness. ===3=== * Aleksey Buldakov, 68, Russian actor (The Guard, Peculiarities of the National Hunt, Hitler Goes Kaput!), blood clot.Умер актер Алексей Булдаков * Billy Mainwaring, 78, Welsh rugby union player (Aberavon, Bridgend, national team). * Gabriel Piroird, 86, French Roman Catholic prelate, Bishop of Constantine (1983–2008).Bishop Gabriel Piroird * Maurice Pon, 97, French lyricist.Maurice Pon Le Parolier de Henri Salvador est mort * Carmelita Pope, 94, American actress (A Streetcar Named Desire).Carmelita Pope * Shawn Smith, 53, American singer, songwriter and musician (Brad, Satchel, Pigeonhed), torn aorta and high blood pressure.Soulful Seattle singer Shawn Smith dead at 53 * Radenko Radenkovic, 69,Serbian solider,died as a result of metastasis on his liver and pancreas. ===4=== * Alberto Cortez, 79, Argentine singer and songwriter, gastric haemorrhage.Muere el músico Alberto Cortez, autor de 'Castillos en el aire' * Georgiy Daneliya, 88, Russian movie director (Walking the Streets of Moscow, Afonya) and screenwriter (Mimino), People's Artist of the USSR (1989), respiratory and heart failure.Умер Георгий Данелия * Đồng Sĩ Nguyên, 96, Vietnamese military officer and politician, Deputy Prime Minister (1982–1991).Trung tướng, cựu ủy viên Bộ Chính trị Đồng Sĩ Nguyên qua đời * Mike Jakubo, 71, Canadian ice hockey player (Los Angeles Sharks, Fort Wayne Komets, Virginia Wings), problems caused by Alzheimer's disease.Michael Jakubo * Barry Malkin, 80, American movie editor (The Godfather Part II, Big, Rumble Fish).Barry Malkin, ‘The Godfather: Part II’ Editor, Dies at 80 * Thompson Mann, 76, American swimmer, Olympic champion (1964).Passages: 1964 Olympic Gold Medalist Thompson Mann, 76 * Marilyn Mason, 93, American concert organist and academic (University of Michigan).Marilyn Mason * Ivan Mrázek, 93, Czech basketball player and coach, European champion (1946).Smutná zpráva pro český basketbal. Zemřel mistr Evropy z roku 1946 Ivo Mrázek * Arthur Polonsky, 93, American painter.Artist Arthur Polonsky at 93 * Louis Rosenblum, 95, American research scientist and activist.Louis Rosenblum, 95, NASA innovator, led drive to free Soviet Jews ===5=== * Sydney Brenner, 92, South African biologist, Nobel Prize in Physiology or Medicine winner (2002).Nobel laureate Sydney Brenner, who helped place Singapore on biotech world stage, dies at 92 * Nikolay Kovalyov, 69, Russian politician, Director of the Federal Security Service (1996–1998).Скончался депутат Госдумы, экс-глава ФСБ Николай Ковалев * Nina Lagergren, 98, Swedish activist, co-founder of the Raoul Wallenberg Academy.Nina Lagergren, medgrundare av Raoul Wallenberg Academy, har lämnat oss i stor saknad * Gianfranco Leoncini, 79, Italian footballer (Juventus, Atalanta, national team), leukaemia.È morto l'ex Juve Gianfranco Leoncini * John Quarmby, 89, English actor (Fawlty Towers, K-9 and Company, A Christmas Carol).Fawlty Towers star John Quarmby dead at 89, confirms co-star John Cleese (death announced on this date) * Lasse Pöysti, 92, Finnish actor (Moomins, Vita lögner).Skådespelaren Lasse Pöysti död * Davey Williams, 66, American avant-garde music guitarist (Curlew) and music critic (Birmingham News), cancer. ===6=== * Jim Glaser, 82, American country singer (\"You're Gettin' to Me Again\") and musician (Tompall & the Glaser Brothers), heart attack.Jim Glaser Dead at 82 * Fritz Hollings, 97, American politician, U.S. Senator (1966–2005), Governor of South Carolina (1959–1963), and 1984 presidential candidate.Former SC Governor, U.S. Senator Ernest F. ‘Fritz’ Hollings dies at 97 * Olli Mäki, 82, Finnish boxer, European amateur champion (1959), problems caused by Alzheimer's disease.Nyrkkeilijä Olli Mäki on kuollut * Lloyd McDermott, 79, Australian rugby union player (national team), nation's first indigenous barrister. * Nadja Regin, 87, Serbian actress (From Russia with Love, Goldfinger, Runaway).Nadja Regin: Bond actress dies aged 87 * David J. Thouless, 84, British physicist, Nobel Prize in Physics winner (2016), problems caused by dementia.David J. Thouless ===7=== * Hugo Ballesteros Reyes, 88, Chilean politician, Deputy (1957–1965), Ambassador to the United Nations (1964) and Senator (1969–1977), brain cancer.Fallece Hugo Eugenio Ballesteros Reyes (QEPD) ex Senador y Diputado DC * Michael E. Busch, 72, American politician, Speaker of the Maryland House of Delegates (since 2003), pneumonia caused by liver surgery.Michael Busch, Maryland's longest- serving House speaker, dies at 72 * Seymour Cassel, 84, American actor (Faces, The Royal Tenenbaums, Dick Tracy), problems caused by Alzheimer's disease.Seymour Cassel, Familiar Face in Cassavetes Films, Dies at 84 * Cho Yang-ho, 70, South Korean businessman (Korean Air, Hanjin).Hanjin Group's Cho Yang-ho Dies at Hospital in Los Angeles * Arie Irawan, 28, Malaysian golfer. * Víctor Manzanilla Schaffer, 94, Mexican politician, Governor of Yucatán (1988–1991), Senator (1967) and Deputy (1967–1970, 1976–1979).Fallece el exgobernador Víctor Manzanilla Schaffer * Mya-Lecia Naylor, 16, English actress (Millie Inbetween), hanged by misadventure.Mya-Lecia Naylor * Sandy Ratcliff, 70, English actress (EastEnders).\"Sandy Ratcliff dies aged 70: Original EastEnders actress remembered by co-star\" * Jan Wraży, 75, Polish footballer (Katowice, Valenciennes, national team).Jan Wraży nie żyje ===8=== * Leif Haraldseth, 89, Norwegian trade unionist and politician, Minister of Local Government (1986–1987).Tidligere LO-leder Leif Haraldseth er død * Josine Ianco-Starrels, 92, Romanian-born American art curator.Josine Ianco- Starrels, curator who helped shape L.A. art scene, dies at 92 * Vasily Likhachyov, 67, Russian politician.Василий Лихачев скончался на 68-м году жизни ===9=== * Elwyn Berlekamp, 78, American mathematician, inventor of the Berlekamp–Welch algorithm and combinatorial game theory, problems caused by pulmonary fibrosis. * Richard E. Cole, 103, American Air Force officer, last living member of the Doolittle Raid. * Nikolai Gorbachev, 70, Belarusian sprint canoer, Olympic (1972) and world champion (1974).Умер чемпион Олимпиады-1972 белорус Николай Горбачев * James D. Hudnall, 61, American comic book writer (Espers), problems caused by diabetes.James Hudnall, Creator of ESPers, Has Died Aged 61 * K. M. Mani, 86, Indian politician, MLA of the Kerala Legislative Assembly (since 1965), problems caused by COPD.Veteran Kerala political leader KM Mani passes away at 86 * Marilynn Smith, 89, American Hall of Fame golfer, Titleholders champion (1963, 1964). * Al Staley, 90, Canadian ice hockey player (New York Rangers).Remembering: Allan Staley 1928–2019 * Charles Van Doren, 93, American academic, writer and television quiz contestant, part of the 1950s quiz show scandals, vice-president of the Encyclopædia Britannica (1959–1982).Charles Van Doren, a Quiz Show Whiz Who Wasn’t, Dies at 93 ===10=== * Werner Bardenhewer, 90, German Roman Catholic priest and humanitarian, Dean of Wiesbaden (1974–1996).Wir trauern um Pfarrer Joseph Werner Bardenhewer * Randall C. Berg Jr., 70, American lawyer, Executive Director of the Florida Justice Institute (1978–2018), ALS.Randall Berg, attorney who fought for prison reform and affordable legal help, dies at 70 * Earl Thomas Conley, 77, American country singer-songwriter (\"Holding Her and Loving You\") and guitarist, problems caused by dementia.Earl Thomas Conley Dead: Country Legend Dies at 77 * Barbara Marx Hubbard, 89, American non- fiction writer, problems caused from an infection.Tribute to Barbara Marx Hubbard * Irwin L. Jacobs, 77, American investor and businessman (Genmar Holdings), suicide by gunshot. * Estrella Zeledón Lizano, 89, Costa Rican politician, First Lady (1978–1982).Murió esta madrugada la exprimera dama Estrella Zeledón ===11=== * Alexander V. Acebo, 91, American politician, Vermont State Auditor (1970–1993).Alexander Valentino Acebo * Can Bartu, 83, Turkish basketball player (Fenerbahçe, national team) and footballer (Fenerbahçe, national team).Son dakika: Fenerbahçe efsanesi Can Bartu yaşamını yitirdi * Geoffrey Chew, 94, American theoretical physicist. * Ian Cognito, 60, British stand-up comedian, heart attack.Ian Cognito: Comedian dies on- stage in Bicester * Monkey Punch, 81, Japanese manga artist (Lupin the Third), pneumonia.'Lupin the Third' Creator Monkey Punch Dies * Stanley Plumly, 79, American poet, multiple myeloma.Stanley Plumly (1939-2019) Remembered at University of Maryland * Dmitri Savitski, 75, Russian novelist (Waltz for K) and poet.Умер писатель Дмитрий Савицкий * Max van Weezel, 67, Dutch journalist and political commentator (Vrij Nederland), pancreatic cancer.Journalist Max van Weezel (67) overleden ===12=== * Ivor Broadis, 96, English footballer (Carlisle United, Manchester City, national team).Ivor Broadis - the Ex-Carlisle United and England international has died aged 96 * Dina, 62, Portuguese pop singer (\"Amor d'água fresca\"), Eurovision contestant (1992), idiopathic pulmonary fibrosis.Morreu a cantora Dina * Georgia Engel, 70, American actress (The Mary Tyler Moore Show, Open Season, Everybody Loves Raymond).Georgia Engel, Gentle-Voiced ‘Mary Tyler Moore’ Actress, Is Dead at 70 * Forrest Gregg, 85, American Hall of Fame football player (Green Bay Packers, Dallas Cowboys) and coach (Cincinnati Bengals, Cleveland Browns), problems caused by Parkinson's disease.Hall of Fame lineman Forrest Gregg dies at 85 * John McEnery, 76, British actor (Romeo and Juliet, Nicholas and Alexandra, The Land That Time Forgot). * Tommy Smith, 74, English footballer (Liverpool, national team), dementia. Tommy Smith: Liverpool great dies, aged 74 ===13=== * Francisca Aguirre, 88, Spanish poet, National Prize for Spanish Literature winner (2018).Muere a los 88 años Francisca Aguirre, poeta de la desolación y la lucidez * D. Babu Paul, 78, Indian civil servant, multiple organ failure.An IAS officer Keral revered: Dr. D Babu Paul passes away * Tony Buzan, 76, English author and educational consultant, heart attack. * Wally Carr, 64, Australian boxer, cancer.Boxing legend fights to the very end * Neus Català, 103, Spanish Resistance fighter, Holocaust survivor and political activist.Muere a los 103 años Neus Català, la superviviente de los campos de exterminio nazi * Mark Connolly, 63, American politician, brain hemorrhage.Mark Connolly, former candidate for governor of New Hampshire, dies at 63 * Paul Greengard, 93, American neuroscientist, Nobel Prize in Physiology or Medicine winner (2000).Pioneering neuroscientist and Nobel laureate Paul Greengard dies at 93 * Norio Kaifu, 75, Japanese astronomer, Director-General of the National Astronomical Observatory of Japan (2000–2006) and President of the International Astronomical Union (2012–2015), pancreatic cancer.Dr. Norio Kaifu, Former Director General of NAOJ, Passes Away * Paul Raymond, 73, English keyboardist and guitarist (UFO, Savoy Brown), heart attack.PAUL RAYMOND, UFO KEYBOARDIST AND GUITARIST, DIES * S. K. Shivakumar, 66, Indian rocket scientist (Indian Space Research Organisation), Director of ISTRAC (1998–2010) and Padma Shri recipient (2015), problems caused by jaundice.Former Isro scientist SK Shivakumar dies at 66 * Lydia Wideman, 98, Finnish cross-country skier, Olympic champion (1952).Maailman vanhin elossa ollut olympiavoittaja Lydia Wideman-Lehtonen on kuollut * Yvette Williams, 89, New Zealand Hall of Fame athlete, Olympic (1952) and Commonwealth (1950, 1954) champion. ===14=== * Bibi Andersson, 83, Swedish actress (Persona, The Seventh Seal, Wild Strawberries), problems caused by a stroke.Skådespelaren Bibi Andersson är död * Giuseppe Ciarrapico, 85, Italian politician and football executive, Senator (2008–2013) and President of Roma (1991–1993).È morto Giuseppe Ciarrapico, l’ultimo editore * Colin Collindridge, 98, English footballer (Sheffield United).RIP Colin Collindridge (death announced on this date) * David Brion Davis, 92, American historian.David Brion Davis, Founding Director of the GLC (1927-2019) * Abdallah Lamrani, 72–73, Moroccan footballer (FAR Rabat, national team).السابق الراحل عبد الله العمراني برقية مواساة.. الملك يعزي أسرة اللاعب الدولي * Mirjana Marković, 76, Serbian politician and political criminal, First Lady (1997–2000) and President of the Yugoslav Left (2002–2003), problems caused by surgery.Umrla Mira Marković, supruga Slobodana Miloševića * Jacek Namieśnik, 69, Polish chemist, Dean of the Gdańsk University College of Chemistry (1996–2002, 2005–2012), possible heart failure.Zmarł rektor Politechniki Gdańskiej prof. Jacek Namieśnik. W RMG wystawiona księga kondolencyjna * Gene Wolfe, 87, American science fiction (The Book of the New Sun) and fantasy writer (Soldier of Sidon), Nebula (1974, 1981) and multi-Locus Award winner, heart disease.Author and Grand Master Gene Wolfe, 1931-2019 ===15=== * Warren Adler, 91, American author (The War of the Roses, Random Hearts), problems caused by liver cancer.Warren Adler Dies: ‘The War Of The Roses’ Author Was 91 * Jerry Clack, 92, American classics scholar.Obituary: Jerry Clack / Classics professor, opera lover, old-world gentleman * Owen Garriott, 88, American astronaut (Skylab 3).Enid-born astronaut Owen K. Garriott dies at age 88 * Aleksandar Kostov, 81, Bulgarian footballer.Почина легендата Сашо Костов * Les Reed, 83, English songwriter (\"It's Not Unusual\", \"Delilah\", \"The Last Waltz\").Les Reed: Delilah songwriter dies aged 83 * José María Rico, 84, Costa Rican lawyer, First Gentleman (2010–2014), problems caused by Alzheimer's disease.Muere José María Rico, esposo de la expresidenta Laura Chinchilla * Winston L. Shelton, 96, American inventor and entrepreneur.Winston Shelton: Prolific engineer, inventor for GE, KFC dies at age 96 * Joaquim Alberto Silva, 45, Angolan footballer (Porto, national team, Xiamen Lanshi), heart attack.Morreu Quinzinho, ex-jogador do FC Porto ===16=== * Jörg Demus, 90, Austrian pianist.Österreichischer Pianist Jörg Demus gestorben * Ahmad Eghtedari, 93–94, Iranian teacher, lawyer and writer, lung and kidney disease.احمد اقتداری از دنیا رفت * Guro Fjellanger, 55, Norwegian politician, Minister of the Environment (1997–2000).Grande om Guro Fjellangers død: En av Venstres mest markante politikere * Kent Harris, 88, American songwriter (\"Shoppin' for Clothes\") and record producer, cancer.Legendary songwriter Kent \"Boogaloo\" Harris dies at 88 * Fay McKenzie, 101, American actress (Down Mexico Way, Heart of the Rio Grande, Breakfast at Tiffany's).Fay McKenzie Dies at 101, Almost the Length of Her Screen Career * Ignace Murwanashyaka, 55, Rwandan rebel, leader of the Democratic Forces for the Liberation of Rwanda. * Bazilije Pandžić, 101, Croatian historian, archivist and orientalist.U 102. godini života umro fra Bazilije Pandžić * Juan Francisco Rodríguez, 68, Spanish Olympic boxer (1972), European Amateur champion (1971).Fallece el mítico púgil almeriense Juan Francisco Rodríguez * Suzanne Twelftree, 62, Australian Paralympic wheelchair tennis player and powerlifter (1992, 2000).Twelftree, Suzanne * Mountaineers killed in the Howse Peak avalanche:Canada avalanche: bodies of three renowned mountaineers found ** Hansjörg Auer, 35, Austrian ** David Lama, 28, Austrian ** Jess Roskelley, 36, American ===17=== * Peter Cartwright, 78, New Zealand lawyer, Viceregal consort (2001–2006).Peter Cartwright death notice * Alan García, 69, Peruvian politician, President (1985–1990, 2006–2011), suicide by gunshot.Ex-President Alan García of Peru Is Dead After Shooting Himself During Arrest * Frederick Hemke, 83, American saxophonist.Frederick Hemke (1935-2019) * Kazuo Koike, 82, Japanese manga artist (Lone Wolf and Cub, Lady Snowblood), pneumonia.Lone Wolf & Cub Manga creator Kazuo Koike passes away * Ya'akov Nehoshtan, 93, Israeli politician and diplomat, member of the Knesset (1969–1974) and Ambassador to the Netherlands (1982–1985).Former MK Yaakov Nehoshtan Passes Away * James V. Schall, 91, American Jesuit Roman Catholic priest, teacher and writer, bone cancer.Jesuit Father James Schall has died at age 91 * Pieter Verhoeff, 81, Dutch movie director (The Dream, The Sunday Child, The Moving True Story of a Woman Ahead of Her Time).Regisseur Pieter Verhoeff (81) overleden ===18=== * Con de Lange, 38, South African-born Scottish cricketer (Northamptonshire, national team), brain tumour. * Jameel Jalibi, 89, Pakistani linguist, writer and educator, Vice-Chancellor of the University of Karachi (1983–1987). * Lyra McKee, 29, Northern Irish journalist, shot.Journalist shot dead in Derry during rioting in the city * Ira Neimark, 97, American retail executive (Bergdorf Goodman).Ira Neimark, the Bergdorf Goodman Chief Who Boosted the Brand, Dies at 97 * Lorraine Warren, 92, American paranormal investigator, subject of The Conjuring.Paranormal Investigator Lorraine Warren Has Died at 92 * Siegmar Wätzlich, 71, German footballer (Dynamo Dresden, East German national team) and Olympic bronze medalist (1972).Dynamo Dresden trauert um Siegmar Wätzlich ===19=== * Martin Böttcher, 91, German composer, arranger and conductor.Winnetou-Komponist Martin Böttcher gestorben * William Krehm, 105, Canadian Trotskyist activist and Spanish Civil War veteran. * Massimo Marino, 59, Italian television presenter and actor.Morto Massimo Marino: attore e conduttore televisivo di ViviRoma * Yuriy Pimenov, 61, Russian rower, Olympic silver medalist (1980).Юрий Пименов скончался на 62-м году жизни * Patrick Sercu, 74, Belgian cyclist, Olympic champion (1964).L'ex- cycliste Patrick Sercu est décédé à l'âge de 74 ans * Rodolfo Severino Jr., 82, Filipino diplomat, Secretary-General of the ASEAN (1998–2002) and Ambassador to Malaysia (1992–1989), problems caused by Parkinson's disease. * Xiao Yang, 80, Chinese judge, President of the Supreme People's Court (1998–2008) and Minister of Justice (1993–1998).Xiao Yang, China's Former Supreme Court President, Dies at 81 * Okiharu Yasuoka, 79, Japanese politician, Minister of Justice (2000, 2008), pancreatic cancer. ===20=== * Joe Armstrong, 68, British computer scientist, designer of Erlang.RIP Joe Armstrong, the author of Erlang * Jarosław Biernat, 58, Polish footballer (Eintracht Frankfurt, SG Union Solingen, SpVgg Bayreuth).Zmarł Jarosław Biernat * Reggie Cobb, 50, American football player (Tampa Bay Buccaneers, Green Bay Packers, New York Jets), heart attack.49ers scout Reggie Cobb dies from suspected heart attack * Monir Shahroudy Farmanfarmaian, 96, Iranian artist.Iranian artist Monir Farmanfarmaian passes away * Karl Grob, 72, Swiss footballer (Zürich, national team), heart failure.Karl Grob mit 72 Jahren verstorben * Braulio Lara, 30, Dominican baseball player (SK Wyverns), car accident.Tampa Bay Rays: Former minor leaguer Braulio Lara killed in car accident * David V. Picker, 87, American movie executive (United Artists, Paramount Pictures) and producer (The Jerk), problems from colon cancer.David Picker Dies: Former President Of Untied Artists, Paramount And Columbia Was 87 * Jacqueline Saburido, 40, Venezuelan-American anti-drunk driving campaigner, cancer.Famous face of 'anti-drunk driving campaign' dies at 40 * Valdiram, 36, Brazilian footballer (CR Vasco da Gama), beaten.Valdiram, ex-atacante do Vasco, é encontrado morto em São Paulo ===21=== * Peter Colotka, 94, Slovak academic, lawyer and politician, Prime Minister of the Slovak Socialist Republic (1969–1988).Vo veku 94 rokov zomrel vysoký komunistický politik Peter Colotka * Hannelore Elsner, 76, German actress (Die Kommissarin), breast cancer.Schauspielerin Hannelore Elsner ist tot * Steve Golin, 64, American movie producer (Spotlight, Eternal Sunshine of the Spotless Mind, The Revenant), founder and CEO of Anonymous Content, Oscar winner (2016), cancer.Steve Golin Dies: Anonymous Content CEO & Oscar-Winning Producer Was 64 * Aminul Haque, 76, Bangladeshi politician, MP (1991–2006) and Minister of Posts and Telecommunications (2001–2006), liver cancer.Former minister and BNP Vice Chairman Barrister Aminul Haque dies * Ken Kercheval, 83, American actor (Dallas, Network, The Seven-Ups), pneumonia. * Shantha Mayadunne, Sri Lankan chef, bombing.Sri Lanka attack: TV chef and daughter among first victims of horrific bombings * Amelia Vargas, 91, Cuban actress (Arroz con Leche, The Phantom of the Operetta, Cleopatra Was Candida) and dancer.Falleció la actriz y bailarina cubana Amelita Vargas ===22=== * Krasimir Bezinski, 57, Bulgarian footballer (CSKA Sofia, Portimonense, national team), colorectal cancer.Отиде си Красимир Безински * Robert L. Butler, 92, American lawyer and politician, Mayor of Marion, Illinois (1963–2018).Former Marion Mayor Bob Butler dies at 92 * Heather Harper, 88, Northern Irish soprano, Grammy winner (1980, 1985).Heather Harper obituary * Stanisław Jędryka, 85, Polish movie director (The Impossible Goodbye).Zmarł Stanisław Jędryka. Zawdzięczamy mu \"Podróż za jeden uśmiech\" i \"Tolka Banana\" * Ventseslav Konstantinov, 78, Bulgarian writer, aphorist and translator.Почина изтъкнатият преводач Венцеслав Константинов * Lê Đức Anh, 98, Vietnamese military officer and politician, Chief of the General Staff (1986–1987), Minister of Defence (1987–1992) and President (1992–1997), problems from a stroke.Nguyên Chủ tịch nước Lê Đức Anh từ trần * Billy McNeill, 79, Scottish football player (Celtic, national team) and manager (Aberdeen, Celtic, Manchester City, Aston Villa), dementia.Family’s immense sadness as Celtic legend Billy McNeill passes away * John Quinn, 78, Canadian professional wrestler (NWA, WWWF).Big John Quinn Dead At 78 * Greg Theakston, 65, American comics artist (Mad).Comics Archivist and Publisher Greg Theakston Has Died, Aged 65 * Oiva Toikka, 87, Finnish glass designer.Lasilinnuistaan tunnettu Oiva Toikka on kuollut * Julio César Toresani, 51, Argentine football player (River Plate, Boca Juniors) and manager (Colón), suicide.Conmoción en Santa Fe: encuentran muerto al ex futbolista Julio César Toresani ===23=== * Henry W. Bloch, 96, American businessman and philanthropist, co-founder of H&R; Block.Henry Bloch, H&R; Block founder, philanthropist, dies at 96 * Matthew Buckland, 44, South African businessman, cancer.Digital pioneer Matthew Buckland dies * Viggo Fossum, 69, Norwegian politician, Mayor of Målselv (2003–2011) and Deputy MP (2009–2013).Viggo Fossum er død * George Haigh, 103, English footballer (Stockport County).George Haigh RIP * Jean, 98, Luxembourgish royal, Grand Duke (1964–2000), lung infection.Grand Duke Jean of Luxembourg dies at the age of 98 * Denton Lotz, 80, American Baptist minister, Secretary of the Baptist World Alliance (1988–2007).Former BWA General Secretary Denton Lotz dies * Mark Medoff, 79, American playwright (When You Comin' Back, Red Ryder?, Children of a Lesser God) and screenwriter, Tony winner (1980), problems caused by a fall and cancer.Dramatist and educator Mark Medoff, author of 'Children of a Lesser God,' dies at 79 * Juan José Muñante, 70, Peruvian footballer (Universatario, Pumas, national team), lung cancer.Muere Juan José Muñante, ex campeón con los Pumas * Johnny Neumann, 68, American basketball player (Memphis Tams, Virginia Squires, Los Angeles Lakers), cancer.Local basketball legend, former Ole Miss star Johnny Neumann dies at 68 * Nils John Nilsson, 86, American computer scientist, creator of Shakey the robot.Nils Nilsson, 86, Dies; Scientist Helped Robots Find Their Way * Tadeusz Pluciński, 92, Polish actor (Westerplatte, Stawka większa niż życie, Czterdziestolatek).Nie żyje Tadeusz Pluciński. Legendarny amant miał 92 lata * Lorenzo Quinteros, 73, Argentine actor (Man Facing Southeast, A Wall of Silence, Valentín).Tenía 73 años Murió Lorenzo Quinteros, un maestro de actores * Terry Rawlings, 85, British movie editor (Alien, Blade Runner, Chariots of Fire), heart failure.Terry Rawlings, Film Editor on 'Alien,' 'Blade Runner' and 'Chariots of Fire,' Dies at 85 * José Rizo Castellón, 74, Nicaraguan politician, economist and lawyer, Vice President (2002–2005).Muere José Rizo, exvicepresidente de Nicaragua y candidato presidencial en 2006 * Peter Skipper, 61, English footballer (Hull City), problems from a stroke.Peter Skipper dies: Hull City mourning the loss of club legend and 'warrior' * Scott W. Sloan, 64, Australian civil engineer and academic. * David Winters, 80, English-American actor and choreographer (West Side Story). * Johan Witteveen, 97, Dutch politician and economist, Deputy Prime Minister (1967–1971) and Managing Director of the IMF (1973–1978).Oud-minister van Financiën Johan Witteveen (97) overleden ===24=== * Hubert Hahne, 84, German racing driver, dementia.Obituary: F2 and touring car ace Hubert Hahne - 1935-2019 * Martin Kilson, 88, American political scientist. * Jean-Pierre Marielle, 87, French actor (Cookies, Without Apparent Motive, The Da Vinci Code).L'acteur Jean-Pierre Marielle est mort à l'âge de 87 ans * Zoran Marojević, 76, Yugoslav basketball player, Olympic silver medallist (1968).Preminuo Zoran Marojević * Sergey Pogorelov, 44, Russian handball player, Olympic champion (2000).В Волгограде сегодня не стало олимпийского чемпиона * Dick Rivers, 74, French rock singer (Les Chats Sauvages) and actor (La candide madame Duff), cancer.Dick Rivers, icône du rock’n’roll à la française, est mort ===25=== * Robbert de Greef, 27, Dutch cyclist, heart attack and brain haemorrhage.Dutch cyclist Robert de Greef dies aged 27, three weeks after suffering heart attack * John Havlicek, 79, American Hall of Fame basketball player (Boston Celtics), problems caused by Parkinson's disease.Boston Celtics legend John Havlicek dies at 79 * Larry \"Flash\" Jenkins, 63, American actor (Ferris Bueller's Day Off, Fletch, The White Shadow), heart attack.Larry “Flash” Jenkins Dies: Actor, Director And Producer For Five Decades Was 63 * Manuel Lujan Jr., 90, American politician, member of the House of Representatives (1969–1989) and Secretary of the Interior (1989–1993), congestive heart failure.Former U.S. House Rep. Lujan dies at 90 * Faty Papy, 28, Burundian footballer (MVV Maastricht, Bidvest Wits, national team).Papy Faty: Burundi star, 28, dies after collapsing on pitch * Feargal Quinn, 82, Irish businessman and politician, founder of Superquinn, Senator (1993–2016).Superquinn founder Feargal Quinn dies aged 82 ===26=== * Jimmy Banks, 54, American soccer player (Milwaukee Wave, national team), pancreatic cancer.World Cup Veteran Jimmy Banks Passes Away at Age 54 * Elina Bystritskaya, 91, Russian actress (Unfinished Story, And Quiet Flows the Don, All Remains to People), People's Artist of the USSR.Умерла актриса Элина Быстрицкая * Nasser Farbod, 96–97, Iranian political activist and military officer, Chief-of-Staff (1979).دومین رییس ستاد ارتش پس از پیروزی انقلاب درگذشت * Jessie Lawrence Ferguson, 76, American actor (Prince of Darkness, Darkman, Boyz n the Hood).'Boyz n the Hood' Dirty Cop Actor Jessie Lawrence Ferguson Dead At 76 * Eric Kent, 99, Australian politician, member of the Victorian Legislative Council (1970–1976, 1979–1985). * Phil McCormack, 58, American singer (Molly Hatchet). * Petar Omčikus, 92, Serbian painter, member of the Serbian Academy of Sciences and Arts.Preminuo Petar Omčikus * Ken Rothman, 83, American politician, Lieutenant Governor of Missouri (1981–1985), member (1963–1981) and Speaker of the Missouri House of Representatives (1977–1981).Kenneth Rothman, former Missouri House speaker and lieutenant governor, dies * Ellen Schwiers, 88, German actress (When the Bells Sound Clearly, The Inheritance of Bjorndal, God's Thunder).Ellen Schwiers ist tot * Reijo Taipale, 79, Finnish pop singer (\"Elämän virta\", \"Sateen hiljainen ääni\", \"Valon lapsi\"), dementia.Reijo Taipale on kuollut – sairasti vuosia ===27=== * Bart Chilton, 58, American civil servant, Commissioner of the Commodity Futures Trading Commission (2007–2014), pancreatic cancer. * Aleksey Lebed, 64, Russian military officer and politician, Head of the Republic of Khakassia (1997–2009), internal bleeding.Умер экс-глава Хакасии Алексей Лебедь * María de los Ángeles Moreno, 74, Mexican politician, Secretary of Fisheries (1988–1991).Fallece María de los Ángeles Moreno, expresidenta nacional del PRI * Negasso Gidada, 75, Ethiopian politician, President (1995–2001).Breaking: former president Dr. Negasso Gidada passed away ===28=== * Bruce Bickford, 72, American clay animator (Baby Snakes, The Dub Room Special, The Amazing Mr. Bickford).Bickford, Bruce (1947-2019) * Caroline Bittencourt, 37, Brazilian model, drowned.Família confirma que corpo encontrado é da modelo Caroline Bittencourt * Sylvia Bretschneider, 58, German politician, member of the Landtag of Mecklenburg-Vorpommern (since 1994), cancer.Sylvia Bretschneider ist tot * Wayson Choy, 80, Canadian writer (The Jade Peony, All That Matters).Wayson Choy, author of The Jade Peony, dead at 80 * Daniel Horlaville, 73, French footballer (Paris, Rouen, national team).Ancienne légende de Quevilly et du FC Rouen, Daniel Horlaville est mort * Damon Keith, 96, American judge, member of the United States Court of Appeals for the Sixth Circuit (since 1977), problems caused by leukemia and heart disease.Federal judge, civil rights icon Damon Keith dies at age 96 * Jo Sullivan Loesser, 91, American actress (The Most Happy Fella), heart failure.Jo Sullivan Loesser Dies: Broadway Actress, Manager Of Frank Loesser Catalogue Was 91 * Richard Lugar, 87, American politician, U.S. Senator (1977–2013), Mayor of Indianapolis (1968–1976) and 1996 presidential candidate, problems caused by CIDP.Former Indiana Senator Richard Lugar, a foreign policy giant, dies * Karol Modzelewski, 81, Polish historian, writer, politician and academic.Nie żyje profesor Karol Modzelewski * Genrikh Novozhilov, 93, Soviet and Russian aircraft designer.Soviet and Russian aircraft designer Genrikh Novozhilov dies aged 93 * Alejandro Planchart, 83, Venezuelan-born American musicologist. * Menachem Mendel Taub, 96, Israeli Hasidic rebbe and concentration camp survivor.Rabbi Menachem Mendel Taub dies aged 96 ===29=== * Eldon Bargewell, 71, American Army general, Commander of Delta Force (1996–1998), lawnmower accident.Retired Army major general dies after lawnmower accident * Stevie Chalmers, 83, Scottish footballer (Celtic, national team).Family's great sadness as Celtic legend Stevie Chalmers passes away * Gino Marchetti, 93, American Hall of Fame football player (Baltimore Colts), problems caused by pneumonia.Hall of Fame DE Gino Marchetti dies at 92 * Les Murray, 80, Australian poet.Australian poet Les Murray dies at 80 * José Rodrigues Neto, 69, Brazilian footballer (Flamengo, Ferro Carril Oeste, national team), thrombosis.Rodrigues Neto, 13º jogador que mais vestiu a camisa do Flamengo, morre aos 69 anos * John Singleton, 51, American movie director (Boyz n the Hood, 2 Fast 2 Furious, Four Brothers) and television producer (Snowfall), stroke.John Singleton Dies: Trailblazing ‘Boyz N The Hood’ Filmmaker Was 51 * Su Yu-chang, 78, Chinese martial artist, scholar and physician.Fallece en La Palma el gran maestro Su Yu-Chang, doctor en medicina tradicional china, filosofía oriental y acupuntura * Josef Šural, 28, Czech footballer (Slovan Liberec, Sparta Praha, Alanyaspor, national team), car crash.Alanyaspor bus crash: Josef Sural killed on bus journey back from Kayserispor * Ellen Tauscher, 67, American politician, Under Secretary of State for Arms Control and International Security Affairs (2009–2012) and member of the U.S. House of Representatives from California's 10th congressional district (1997–2009), pneumonia.Former Rep. Tauscher, arms negotiator and Wall Street ground- breaker, dies at 67 ===30=== * Anémone, 68, French actress (Santa Claus Is a Stinker, The Grand Highway, Le Petit Prince a dit, Something Fishy), César winner (1988), lung cancer.L'actrice Anémone est morte à 68 ans * Beth Carvalho, 72, Brazilian samba singer (Estação Primeira de Mangueira), problems caused by a staph infection.Beth Carvalho morre aos 72 anos * Luciano Comaschi, 87, Italian football player (Brescia, Napoli) and manager.È morto a 87 anni Luciano Comaschi, calciatore del Napoli * Dunaden, 13, French racehorse, Melbourne Cup winner (2011), problems caused by a paddock accident.Melbourne Cup winner Dunaden dies * Luis Maldonado Venegas, 62, Mexican politician, Deputy (2015–2018), problems caused by surgery.Fallece Luis Maldonado Venegas * Peter Mayhew, 74, English actor (Star Wars), heart attack.Peter Mayhew, Chewbacca in 'Star Wars' Films, Dies at 74 * S. P. Y. Reddy, 68, Indian politician, MP (since 2004), lung infection.Nandyal MP SPY Reddy dies aged 69 ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *4 Deaths",
 "title": "Deaths in April 2019"
}