{
 "id": "687658",
 "text": "Sinéad Cusack (born Jane Moira Cusack; 18 February 1948) is an award-winning Irish movie, stage and television actress. Her first acting roles were at the Abbey Theatre in Dublin, Ireland. She moved to London in 1975 to join Royal Shakespeare Company. Cusack won the Critic's Circle and Evening Standard Awards for Our Lady of Sligo. She received two Tony Award nominations: one for Best Leading Actress in Much Ado About Nothing (1985). She received the other nomination for Best Featured Actress in Rock 'n' Roll (2008). Cusack acted in many movies. She played Diana Grayson in the 1996 romantic drama movie Stealing Beauty She played a mother in The Cement Garden in 1993. Also in 1993, she played Ellie McAllister in the comedy-drama movie Bad Behaviour. Cusack was also on television. She played Sybil in the 2011 TV series Camelot. She played one half of a couple in the BBC sitcom Home Again. She won the RTS Award for Best Actress for her role in Have Your Cake and Eat It. Cusack was born in Dublin, Ireland. ==Personal life== Cusack married actor Jeremy Irons in 1978. They have two sons. ==Awards and nominations== Year Award Work Category 1981 Clarence Derwent Award for Best Supporting Actress As You Like It 1981 Olivier Award for Best Actress in a Supporting Role As You Like It 1981 Olivier Award for Best Actress in a Revival The Maid's Tragedy 1983 Olivier Award for Best Actress in a Revival The Taming of the Shrew 1985 Tony Award for Best Actress in a Play Much Ado About Nothing 1998 RTS Television Award for Best Actor - Female Have You Cake And Eat It 1998 Evening Standard Award for Best Actress Our Lady of Sligo 1999 Critics' Circle Award for Best Actress Our Lady of Sligo 1999 Olivier Award for Best Actress in a Play Our Lady of Sligo 2007 Olivier Award for Best Actress in a Play Rock 'n' Roll 2007 Tony Award for Best Actress in a Play Rock 'n' Roll 2007 IFTA Award for Best Actress in a Supporting Role - Film The Tiger's Tail 2014 IFTA Award for Best Actress in a Supporting Role - Film The Sea 2015 IFTA Award for Best Actress in a Supporting Role - Film Queen and Country 2015 Irish Times Theatre Awards for Best Actress Our Few And Evil Days ==References== Category:Irish actors Category:Actors from Dublin Category:1948 births Category:Living people",
 "title": "Sinéad Cusack"
}