{
 "id": "687733",
 "text": "Peter Edward Rose Sr. (April 14, 1941 - September 30, 2024), also known by his nickname \"Charlie Hustle\", was an American professional baseball player and manager. He played in Major League Baseball from 1963 to 1986. He managed from 1984 to 1989. ==Career== Rose played for the Cincinnati Reds from 1963 to 1978. He then played for the Philadelphia Phillies from 1979 to 1983. Rose later played for the Montreal Expos in 1984. Rose returned to play for the Cincinnati Reds from 1984 to 1986. Rose had also managed the Cincinnati Reds from 1984 to 1989. His career ended when he was accused of gambling while managing the Reds. As a result of an investigation that proved this, Rose was made illegible to be honored into the National Baseball Hall of Fame. Rose won three World Series rings, three batting titles, one Major League Baseball Most Valuable Player Award and one Major League Baseball Rookie of the Year Award. Between 1998 and 2000, Rose appeared at World Wrestling Federation's (now WWE) annual WrestleMania pay-per-view event. He was a \"guest ring announcer\" before a match between Kane and the Undertaker. Rose took to the ring and began to make fun of the Boston crowd about the Reds beating the Red Sox in the 1975 World Series. On June 16, 2014, Rose returned to managing a professional baseball team for one game, serving as guest manager of the Bridgeport Bluefish, a Connecticut-based team. In April 2015, it was announced that Rose had been hired by Fox Sports to serve as a guest studio color analyst for MLB coverage on Fox and Fox Sports 1. He was let go in August 2017 when the details of his sexual relationship with a teenager in the 1970s was revealed. ==Personal life== Rose was born in Cincinnati, Ohio. Rose was married to Karolyn Englehardt from 1964 to 1980. They had two children, including Pete Jr.. He had a daughter from an extramarital affair in the 1970s.Rose admits he is 18-year-old's father; Heard charged with stalking 'Homicide' actress . The Philadelphia Inquirer. November 24, 1996. Retrieved January 21, 2014. In 1984, he married Carol J. Woliung and they had two children. They divorced in 2011. Rose was engaged to model Kiana Kim from 2011 until his death. ===Legal issues=== On April 20, 1990, Rose pleaded guilty to two charges of filing income tax returns. On July 19, he was sentenced to five months in the medium security prison camp in Marion, Illinois. He was fined $50,000. He was released on January 7, 1991. In 2016, Rose was accused of statutory rape, after being accused of having a sexual relationship with a minor in the 1970s in a lawsuit. ===Death=== Rose died at his home in Las Vegas, Nevada, on September 30, 2024 from heart disease at the age of 83. The day before, he travelled to Franklin, Tennessee for an autograph event. ==References== ==Other websites== * * * * Category:1941 births Category:2024 deaths Category:Cincinnati Reds players Category:Philadelphia Phillies players Category:Montreal Expos players Category:Sportspeople from Cincinnati Category:WWE Hall of Fame Category:American sports commentators Category:American professional wrestlers Category:Deaths from cardiovascular disease",
 "title": "Pete Rose"
}