{
 "id": "68773",
 "text": "Flinders Street Station is the central railway station of the rail network of Melbourne, Australia. It is on the corner of Flinders and Swanston Streets next to the Yarra River in the middle of the city, stretching from Swanston Street to Queen Street and covering two city blocks. Each weekday, about 105,000 people and 1,500 trains use the station. It is serviced by Metro's suburban and city loop services, and V/Line's regional services. ==History== The first railway station in the Flinders Street site was called Melbourne or City Terminus, and was a collection of sheds. It was completed in 1854 and was officially opened on 12 September by Sir Charles Hotham. The terminus was the first city railway station in Australia, and the opening day saw the first steam train trip in the country. It travelled to Sandridge (now Port Melbourne), over the Sandridge Bridge (which has now been redeveloped in 2006 as a pedestrian and cycle bridge across the Yarra River), travelling along the now light rail Port Melbourne line. Melbourne's two other early central-city stations, Spencer Street Station (now Southern Cross Station) and Princes Bridge, opened in 1859. Princes Bridge was originally separated from Flinders Street, even though it was only on the opposite side of Swanston Street. Once the railway line was extended under the street to join the two, Princes Bridge slowly became amalgamated into Flinders Street. Federation Square now occupies its site. In 1882 the government decided to build a new central passenger station to replace the existing construction. A worldwide design competition was held in 1899, with 17 entries received. The £500 first prize went to railway employees J. W. Fawcett and H. P. C. Ashworth, whose design included a giant dome and clock tower. Work began in 1901 and ended in 1910. ==Platforms== Flinders Street Station's platforms are numbered from north to south, with Platform No. 1 being the farthest north, and generally serve specific lines as follows. Platform 1: Mernda and Hurstbridge Platforms 2 & 3: Belgrave, Glen Waverley, Alamein and Lilydale Platforms 4 & 5: Alamein, Blackburn trains on the Belgrave and Lilydale lines (both platform 4 only); Cragieburn, Sunbury and Upfield Platforms 6 & 7: Cranbourne and Pakenham Platforms 8 & 9: Frankston, Werribee and Williamstown Platform 10 & 12 : Various Werribee and Williamstown services, depending on day and time. Platform 13: Sandringham Platform 14: Out of use Note that the eastern end of Platform No. 1 is designated as Platform No. 14, past the Platform 1 escalators. Platform 11 is out of use and has no track. ==Station redevelopment== Flinders Street is currently undergoing redevelopment. It will involve cleaning and repair, as well as improving general ability for people who are disabled to move around the station. The works include: * Works on Platform 10, including putting a new ground covering on it * New escalators to provide better access to Platforms 10, 12 and 13 * An additional lift on Platform 10 (giving a total of two lifts for Platforms 10, 12 and 13) * New lighting * Relocating the V/Line booking office to the main ticket office * Developing a new commercial area on the site of the V/Line booking office * Improving the underground footway from Elizabeth Street to Southbank and Degraves Street to Flinders Street * Waterproofing the roof * Developing a business case for possible uses of vacant space, including the disused ballroom (pictured here). * Steam cleaning the facade * New LCD Passenger Information Displays (PIDS) installed on the platforms, subways and in the main entrance. ==Trivia== *The main steps are embedded with electrical circuits to keep them dry, fitted in June 1985. *Platform No. 1, where Mernda & Hurstbridge line trains depart, is the longest railway platform in Australia, and the fourth longest in the world, at 708 metres long. *The building contains a ballroom (not in use), and a Day care centre was inside the main dome for a while. It included an open-air playground on an adjoining roof. *One of the original platform verandas from the Melbourne Terminus building was dismantled and re-erected at Hawthorn station, in the inner-eastern suburbs. *Flinders Street Station became a sister station of Mojiko Station in Japan on November 14, 1993. ==References== * ==Other websites== *Victorian Department of Infrastructure article on Flinders Street Station <Station Navigation <Station Navigation <Station Navigation <Station Navigation <Station Navigation <Metropolitan service <Metropolitan service <Metropolitan service <Metropolitan service <Metropolitan service \"City Loop\" \"City Loop\" \"City Loop\" \"City Loop\" \"City Loop\" Anti - Clockwise Parliament | Southern Cross Clockwise Alamein, Belgrave, Cranbourne, Frankston, Glen Waverley, Lilydale, Pakenham & Sandringham lines Alamein, Belgrave, Cranbourne, Frankston, Glen Waverley, Lilydale, Pakenham & Sandringham lines Alamein, Belgrave, Cranbourne, Frankston, Glen Waverley, Lilydale, Pakenham & Sandringham lines Alamein, Belgrave, Cranbourne, Frankston, Glen Waverley, Lilydale, Pakenham & Sandringham lines Alamein, Belgrave, Cranbourne, Frankston, Glen Waverley, Lilydale, Pakenham & Sandringham lines Previous Station Refer to City Loop | Richmond Next Station Epping & Hurstbridge lines Epping & Hurstbridge lines Epping & Hurstbridge lines Epping & Hurstbridge lines Epping & Hurstbridge lines Previous Station Refer to City Loop | Jolimont Next Station <Regional service <Regional service <Regional service <Regional service <Regional service Bairnsdale line Bairnsdale line Bairnsdale line Bairnsdale line Bairnsdale line Previous Station Southern Cross → | → Richmond Next Station <Entire metropolitan network <Entire metropolitan network <Entire metropolitan network <Entire metropolitan network <Entire metropolitan network < Entire regional network < Entire regional network < Entire regional network < Entire regional network < Entire regional network Category:Railway stations in Melbourne Category:1854 establishments Category:1850s establishments in Australia",
 "title": "Flinders Street Station"
}