{
 "id": "687888",
 "text": "Regina Marie Fischer (born March 7, 1974), better known as Jenna Fischer, is an American actress. She was born in Fort Wayne, Indiana, but was raised in St. Louis, Missouri. Fischer is best known for her role as Pam Beesly on the NBC sitcom The Office. ==Filmography== ===Film=== List of films and roles Year Title Role Notes 1998 Channel 493 Rane Born Champion Wendy Miller 2002 Les superficiales Bitchy French Girl Short film 2003 Doggie Tails, Vol. 1: Lucky's First Sleepover Kelsey Voice Melvin Goes to Dinner Sister / Hostess 2004 Employee of the Month Whisper Leslie Short film LolliLove Jenna Gunn Also director/co-writer 2005 The 40-Year-Old Virgin Woman #1 Uncredited 2006 Slither Shelby 2007 Blades of Glory Katie Van Waldenberg Michelle Walk Hard: The Dewey Cox Story Darlene Madison 2008 Jen Stauber 2009 Solitary Man Susan Porter 2010 Laura Pehlke 2011 Hall Pass Maggie Mills 2012 Janice Also producer 2013 Are You Here Alli 2014 Kiss Me Vera 2017 Brad's Status Melanie Sloan 2018 The 15:17 to Paris Heidi Skarlatos 2024 Mean Girls Ms. Heron ===Television=== List of television appearances and roles Year Title Role Notes 2001 Undeclared Betty / Sorority Girl 2 episodes Spin City Waitress Episode: \"A Shot in the Dark: Part 2\" 2002 Off Centre Melanie Episode: \"The Backup\" What I Like About You Kim Episode: \"Copy That\" 2003 Strong Medicine Camille Freemont Episode: \"Maternal Mirrors\" Miss Match Connie Episode: \"Kate in Ex-tasy\" 2004 Cold Case Dottie (1943) Episode: \"Factory Girls\" 2005 That '70s Show Stacy Wanamaker Episode: \"Don't Lie to Me\" Six Feet Under Sharon Kinney 2 episodes 2005–2013 Pam Beesly Main cast; 188 episodes Also producer (2012–2013) 2012 Dan Vs. Amber (voice) Episode: \"Anger Management\" 2014 Comedy Bang! Bang! Herself Episode: \"Jenna Fischer Wears a Floral Blouse & Black Heels\" 2015 Newsreaders Kelly Spears Episode: \"The FMK Killer; Newsreaders: Behind the Scenes\" You, Me and the Apocalypse Rhonda MacNeil Main cast; 10 episodes Also associate producer 2016 The Mysteries of Laura Jennifer Lambert Recurring role; 3 episodes The Grinder Kelly Episode: \"Genesis\" Drunk History Katharine Wright Haskell Episode: \"Siblings\" 2017 The Guest Book Dr. Laurie Galiff Episode: \"Story Eight\" 2018–2019 Splitting Up Together Lena Main cast ==Awards and nominations== Year Association Category Nominated work Result 2004 St. Louis International Film Festival Screen Actors Guild Emerging Actor Award LolliLove 2005 TromaDance Film Festival Independent Soul Award (as director) 2007 Primetime Emmy Award Outstanding Supporting Actress in a Comedy Series The Office Screen Actors Guild Award Outstanding Performance by an Ensemble in a Comedy Series 2008 2009 Teen Choice Award Choice TV Actress – Comedy Screen Actors Guild Award Outstanding Performance by an Ensemble in a Comedy Series 2010 St. Louis International Film Festival Cinema St. Louis Award Body of Work 2011 Screen Actors Guild Award Outstanding Performance by an Ensemble in a Comedy Series The Office 2012 2013 2020 Shorty Award Best Podcaster (with Angela Kinsey) Office Ladies ==References== ==Other websites== * * Category:1974 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Indiana Category:Actors from St. Louis, Missouri Category:People from Fort Wayne, Indiana",
 "title": "Jenna Fischer"
}