{
 "id": "688089",
 "text": "Angela's Ashes is a 1999 British and American historical drama movie. It is based on a memoir of the same name by Frank McCourt. It was co-produced between the United States, United Kingdom and Ireland. ==Cast== * Emily Watson as Angela McCourt * Robert Carlyle as Malachy McCourt * Devon Murray as Middle Malachy * Joe Breen as Young Frank * Ciaran Owens as Middle Frank * Michael Legge as Older Frank * Kerry Condon as Theresa Carmody * Ronnie Masterson as Grandma Sheehan * Pauline McLynn as Aunt Aggie * Liam Carney as Uncle Pa Keating * Eanna MacLiam as Uncle Pat * Susan Fitzgerald as Sister Rita * Eamonn Owens as Quasimodo * Eileen Colgan as Philomena * Martin Benson as Christian brother * Andrew Bennett as Narrator (voice) * Alan Parker (cameo) as Dr. Campbell * Brendan O'Carroll as Man in pub ==Production== The movie is set in and around Limerick. However, many scenes were filmed in Cork. ==Reception== Angela's Ashes had a $25 million budget. But it only made $13,042,112 in the United States. That made the movie a box office bomb. The movie has a 52% \"rotten\" rating on the Rotten Tomatoes. However, the audience rated the movie at 82%. Roger Ebert gave Angela's Ashes two and a half stars. ==Awards== * Winner Best Picture – Irish Film and Television Awards * Winner Best Costume Design – Irish Film and Television Awards (Consolata Boyle) * Winner Best Director – Karlovy Vary International Film Festival (Audience Award) (Alan Parker) * Winner Best Original Score – Las Vegas Film Critics Society (John Williams) * Winner Best Actress – London Film Critics Circle (Emily Watson) * Nominee Best Original Score – Academy Awards (John Williams) * Nominee Best Original Score – Golden Globes (John Williams) * Nominee Best Actress – BAFTA (Emily Watson) * Nominee Best Cinematography – BAFTA (Michael Seresin) * Nominee Best Production Design – BAFTA (Geoffrey Kirkland) * Nominee Best British Film – Empire Awards * Nominee Best British Actor – Empire Awards (Robert Carlyle) * Nominee Best Actress – Irish Film and Television Awards (Emily Watson) * Nominee Best Actor – Irish Film and Television Awards (Robert Carlyle) * Nominee Newcomer of Year – London Film Critics Circle (Michael Legge) ==References== Category:1990s historical movies Category:1990s American drama movies Category:1999 drama movies",
 "title": "Angela's Ashes"
}