{
 "id": "688312",
 "text": "Sir Gustav Victor Joseph Nossal (born 4 June 1931) is an Austrian-born Australian research biologist. He is famous for his work in the fields of antibody formation and immunological tolerance. ==Life and career== Nossal was born in Bad Ischl. He first grew up in the Austrian capital city of Vienna. After the Anschluss (Nazi Germany's annexation of Austria), he and his family moved to Australia. This was because, although not of Jewish faith, his father's grandparents were Jewish. This meant that Nossal was at risk of being sent to concentration camps due his Jewish background. Nossal was baptised, like his father, and is a Roman Catholic. He studied at the University of Sydney. Nossal has written five books and 530 scientific articles on immunology and similar fields. From 1959 to 1961, he was the assistant professor of genetics at Stanford University. He began serving as director of the Walter and Eliza Hall Institute of Medical Research from 1965. At the same time, he was Professor of Medical Biology at the University of Melbourne. He retired from both of these roles in 1996. Nossal was president of the Australian Academy of Science from 1994 to 1998. He was the chairman of the comittee running the World Health Organization's Vaccines and Biologicals Program from 1993 to 2002. He also served as Chairman of the Strategic Advisory Council of the Bill & Melinda Gates Foundation Children's Vaccine Program from 1998 to 2003. Nossal is married to Lyn Beatrix (née Dunnicliff). The couple have four children (two sons and two daughters). ==Awards and honours== In 1970, Nossal was made a Commander of the Order of the British Empire. He was knighted for his services to science in 1977. In 1989, he was made a Companion of the Order of Australia. In 1990, he was awarded the Albert Einstein World Award of Science. In 2000, he was named Australian of the Year. Nossal High School in Berwick, Victoria, is named after him. ==References== ==Other websites== * Sir Gustav Nossal at the Walter and Eliza Hall Institute website Category:1931 births Category:Living people Category:Australian academics Category:Australian biologists Category:Australian educators Category:Australian Jews Category:Australian medical researchers Category:Australian Roman Catholics Category:Commanders of the Order of the British Empire Category:Immunologists Category:Jewish academics Category:Jewish scientists Category:Jewish writers Category:Knights Bachelor Category:Naturalised citizens of Australia Category:Order of Australia Category:Scientists from Vienna Category:Writers from Vienna Category:University of Sydney alumni Category:Writers from Sydney",
 "title": "Gustav Nossal"
}