{
 "id": "68853",
 "text": "A bird of prey (also called raptor) is a bird that mainly uses its claws (called talons) to seize prey. They have strong sharp, hooked beaks and claws and have sharp eyesight. They are not classified into one natural family or group. The behaviour evolved many times in different groups. This is an illustration of convergent evolution. == Classification by ancestry == === Daytime birds === Those bird of prey that are active during the day (diurnal) are classified into five families in two orders. The orders are the Falconiformes and Accipitriformes. * Accipitridae: hawks, eagles, buzzards, harriers, kites and Old World vultures * Pandionidae: the osprey * Sagittariidae: secretary-bird * Falconidae: falcons, caracaras and forest falcons === Nighttime birds === Nocturnal birds of prey – the owls – are classified separately, as members of two families of the order Strigiformes. == Common names == * Eagles are large birds with long, broad wings and massive feet. Booted eagles have feathered legs and build large stick nests. *Ospreys are one species found worldwide. They specialize in catching fish. They also build large stick nests. * Kites have long wings and weak legs. They spend much of their time soaring. They will take live vertebrates, but mostly feed on insects and carrion. * Hawks are medium to large-sized birds of prey that usually belong to the genus Accipiter. They are mainly woodland birds that hunt by sudden dashes from a concealed perch. They usually have long tails for tight steering. * Buzzards are raptors with a robust body and broad wings, or, alternatively, any bird of the genus Buteo (also commonly known as hawks in North America). * Harriers are large, slender hawk-like birds with long tails and long thin legs. They hunt small vertebrates by sight, gliding and circling low over grasslands and marshes on their long broad wings. *Vultures are carrion-eating raptors of two different families. Members of both groups have heads either partly or fully devoid of feathers. The vultures are also regarded as birds of prey, although they may not be closely related to the other groups. The Eastern vultures and the western New World vultures are two groups which have evolved separately. Their similarities are due to convergent evolution. **The Accipitridae only occurs in the Eastern Hemisphere; and **The Cathartidae only occurs in the Western Hemisphere. * Falcons are small to medium-sized birds of prey with long pointed wings. Unlike most other raptors, they belong to the Falconidae rather than the Accipitridae. Many are particularly swift flyers. Instead of building their own nests, falcons appropriate old nests of other birds, but sometimes they lay their eggs on cliff ledges or in tree hollows. Kestrels are the smallest birds in the group. Caracaras are a subgroup of the Falconidae unique to the New World, and most common in the tropics. * Owls are variable-sized nocturnal hunting birds. They fly soundlessly and have very acute senses of hearing and sight. **Strigidae (typical owls) **Tytonidae (barn and bay owls) ==Gallery== File:Buitre leonado Morelia.jpg|A griphon vulture, an Old World vulture. File:Secretary Bird.jpg|A secretary bird. File:Brown-Falcon,-Vic,-3.1.2008.jpg|A brown falcon, a kind of falcon. File:Mountain caracara.jpg|A mountain cacara. File:Eastern Screech Owl.jpg|Eastern screech owl, a typical owl. File:Tyto alba close up.jpg|The barn owl. File:Condor02 ST 98.jpg|The Andean condor is one of the largest birds able to fly. It is a New World vulture. File:Northern Goshawk ad M2.jpg|Northern goshawk, a kind of hawk. File:Caracolero.jpg|A snail kite, a kind of kite. == Other websites == *Explore Birds of Prey with The Peregrine Fund *Birds of prey videos on the Internet Bird Collection *Helydon Show Dogs and Birds of Prey *Bird of Prey Pictures *Global Raptor Information Network Category:Birds Category:Strigiformes Category:Falconiformes Category:Accipitriformes",
 "title": "Bird of prey"
}