{
 "id": "688504",
 "text": "Edmund Gunter (1581 – 10 December 1626) was an English clergyman, mathematician, geometer and astronomer of Welsh descent. He is best remembered for his practical inventions for measurement. These include the Gunter's chain, Gunter's quadrant, and the Gunter's scale.Stenstrom, Guy O. 1967. Surveying ready reference manual. McGraw–Hill, p7. In 1620, he invented the first successful analogue device which he developed to calculate logarithmic tangents.Homer, Trevor 2012. The Book of Origins: the first of everything – from art to zoos. Hachette UK.Maor, Eli 2013. Trigonometric delights. Princeton University Press. These inventions are related to the main practical maths interests of England at that time. These were maritime navigation, land surveying and accounting. Gunter was taught mathematics by Henry Briggs. He became a Gresham Professor of Astronomy, from 1619 until his death.Burns, William E. 2001. The Scientific Revolution: an encyclopedia, ABC-CLIO, p125. Gunter invented the terms cosine and cotangent, == Gunter's scale == Gunter’s scale (called by seamen \"the Gunter\") is a large plane scale, usually 2 ft. long by about 1½ in. broad, and engraved with various lines of numbers. By means of this scale questions in navigation, trigonometry etc. are solved with the aid of a pair of compasses. The slide rule was invented around 1620–1630, shortly after John Napier's publication of the concept of the logarithm. In 1620 Gunter developed his calculating device with a single logarithmic scale. With additional measuring tools it could be used to multiply and divide. In c. 1622, William Oughtred of Cambridge combined two handheld Gunter rules to make a device that is the modern slide rule. == Gunter's chain == Gunter's chain was in common use in surveying up to modern times. It is 22 yards long and is divided into 100 links. Its usefulness comes from its decimal division, and the fact that 10 square chains make an acre. It folds up in sections, and is carried by the surveyor. == Gunter's quadrant == His quadrant of 1623 was used to tell the time, find the length of day, when the sun had risen and set, the date, and the meridian. It used scales and curves of the quadrant and related tables. Gunter's quadrant was fairly simple, and was widely used in the 17th and 18th centuries. This instrument is used to find the hour of the day, the sun’s azimuth, and other common problems of the globe, and also to take the altitude of an object in degrees. These things are needed by ships on long voyages, and on long overland excursions. == Controversies == Like his contemporary at Cambridge, Isaac Newton, Oughtred taught his ideas privately to his students. Also like Newton, he became involved in a controversy over priority (who invented what and when). This involved his one-time student Richard Delamain. Oughtred's ideas were only made public in publications of his student William Forster in 1632 and 1653. == References == Category:1581 births Category:1626 deaths Category:People educated at Westminster School, London Category:British geometers",
 "title": "Edmund Gunter"
}