{
 "id": "688501",
 "text": "Gresham College is an institution of higher learning in London. It does not enroll students and does not award any degrees. It was founded in 1597 under the will of Sir Thomas Gresham. The College gives over 140 free public lectures every year. Since 2001, all lectures have also been made available online. ==Professors== There seven original Gresham College Professorships that date back to the origins of the college. They are in Astronomy, Divinity, Geometry, Law, Music, Physic and Rhetoric. These subjects reflect the curriculum of the medieval university (the trivium and quadrivium). The college played an important role in the Enlightenment and in the formation of the Royal Society. Early distinguished Gresham College professors included Christopher Wren, who lectured on astronomy in the 17th century, and Robert Hooke, who was Professor of Geometry from 1665 until 1704. The professors received £50 a year. The terms of their position were very precise, for example: :The geometrician is to read as followeth, every Trinity term arithmetique, in Michaelmas and Hilary terms theoretical geometry, in Easter term practical geometry. The astronomy reader is to read in his solemn lectures, first the principles of the sphere, and the theory of the planets, and the use of the astrolabe and the staff, and other common instruments for the capacity of mariners.\"Who invented the calculus? – and other 17th century topics\" Gresham lecture by Robin Wilson, 16 November 2005. Retrieved 16 February 2006. Today three further Professorships have been added to take account of areas not otherwise covered by the original Professorships: * Commerce, established in 1985. * Environment, established in 2014.\"Gresham Professor of the Environment: Carolyn Roberts appointed to only the second new Professorship in 400 years\" , Gresham College press release, 25 June 2014 (accessed 27/07/15) * Information technology, established in 2015.\"Elizabethan \"University\" Appoints Professor of IT\" , Gresham College press release, 26 June 2015 (accessed 27/07/15) The professors currently hold their positions for three years, extendable for a fourth year. They give six lectures a year. There are also visiting professors appointed to give series of lectures at the College. There are a number of single-lecture speakers. The lectures are often given in the Museum of London, which has a bigger lecture room than the College. == References == Category:1590s establishments in England Category:Colleges and universities in London",
 "title": "Gresham College"
}