{
 "id": "688632",
 "text": "The Communist Party of Greece (; Kommounistikó Kómma Elládas, KKE) is a Marxist–Leninist political party in Greece. It was founded in 1918 as the Socialist Labour Party of Greece (adopting its current name in November 1924). It is the oldest political party in modern Greek politics. The party played a significant role in the Greek resistance. The party's membership was largest in the mid-1940s. It participated in the Greek Civil War, but ended on the losing side and was banned until 1974. The party took part in a coalition government in 1989 when it got more than 13% of the vote. == History == === Foundation === The October Revolution of the Bolsheviks in Russia in 1917 gave rise to the foundation of communist parties in many countries all over the globe. KKE was founded on 4 November 1918 as the Socialist Labour Party of Greece (Greek: Σοσιαλιστικό Εργατικό Κόμμα Ελλάδας, Sosialistikó Ergatikó Kómma Elládas; acronym: ΣΕΚΕ, SEKE). The party was run by a five-member central committee. The committee consisted of Nikos Dimitratos, D. Ligdopoulos, M. Sideris, A. Arvanitis and S. Kokkinos. The background of KKE has roots in more than 60 years of small socialist, anarchist and communist groups. These groups were mainly in industrialized areas. They followed the example of the Paris Commune and the 1892 Chicago workers' movement for the eight-hour working day. These groups pushed for the unification of Greek workers into trade unions, the implementation of an eight-hour day in Greece and better salaries for workers. Inspiration came from the Paris Commune and the communist revolutionary efforts at the beginning of the century. The destruction almost 20 years of wars brought upon the Greek workers also played a role. As a result, a unified Social-Communist party was founded in Greece. At the Second Congress of the SEKE in April 1920, the party decided to affiliate with Comintern. The Comintern was an international communist organisation founded in Moscow in 1919. The SEKE changed its name to the Socialist Labour Party of Greece-Communist (SEKE-K). A new central committee was elected, which included Nikos and Panaghis Dimitratos, Yannis Kordatos, G. Doumas and M. Sideris. At the Third Extraordinary Congress of the SEKE-K in November 1924, the party was renamed the Communist Party of Greece and adopted Marxism–Leninism. Pandelis Pouliopoulos was elected as general-secretary. Ever since, the party has functioned on the basis of democratic centralism. === KKE between the two World Wars === KKE strongly opposed Greece's involvement in the Greco-Turkish War of 1919–1922. It considered the war an imperialistic plot to control the market of Asia Minor. KKE members advocated this position both on the front as well as in the mainland. KKE worked with the Soviet ambassador to persuade Venizelos' administration to withdraw its troops from Asia Minor. KKE also tried to persuade the Soviet Union to pressure Mustafa Kemal Atatürk to allow autonomy for Greek cities in Asia Minor. == References == ==Other websites== * Category:20th-century establishments in Greece Category:1918 establishments in Europe Category:Communist parties in Europe Category:Political parties in Greece Category:Athens",
 "title": "Communist Party of Greece"
}