{
 "id": "690094",
 "text": "T.U.F.F. Puppy is an American action animated children's television series created by Butch Hartman. It premiered on October 2, 2010, along with Planet Sheen, which premiered a half hour earlier. T.U.F.F. Puppy is Hartman's third animated show for Nickelodeon, after The Fairly OddParents and Danny Phantom and also before Bunsen is a Beast. The show was cancelled after 3 seasons and aired its final episode on April 4, 2015. ==Plot== The show is about a dog named Dudley Puppy, who works as a spy for T.U.F.F. HQ. His partner is Kitty Katswell, a cat. Other helpers are The Chief and Keswick. This takes place in the fictional city of Petropolis (distinct from the Brazilian city of Petrópolis, which is named after Pedro II of Brazil), which is populated by anthropomorphic animals. As a member of T.U.F.F. HQ, Dudley helps Kitty protect Petropolis from villains, such as Verminious Snaptrap, The Chameleon, Bird Brain, Larry, Ollie, Francisco, Zippy, Owl, Bad Dog, and Skunk. ==Episodes== ==Characters== === Main === ==== T.U.F.F. ==== The Turbo Undercover Fighting Force (T.U.F.F.) headquarters (HQ) is an organization that protects Petropolis from crime. * Dudley Puppy (voiced by Jerry Trainor) is a white dog who wears a black t-shirt. * Kitty Katswell (voiced by Grey DeLisle- Griffin) is a cat who's Dudley Puppy's partner. * The Chief (voiced by Daran Norris) is a good-natured flea who leads T.U.F.F. HQ. * Keswick (voiced by Jeff Bennett) is a prairie dog who's a scientist with glasses. Also in T.U.F.F. are various personnel that appear as background characters whether as agents, office workers, and/or scientists. Some of the minor members of T.U.F.F. that have been identified or mentioned include: * Agent Groundhog (voiced by Jeff Bennett) is a T.U.F.F. Agent who first made a cameo in \"Hot Dog\". He resides under an office printer and is the one who tells about the end of winter. * Agent Jumbo (voiced by Grey DeLisle) is an elephant T.U.F.F. Agent who has a fear of mice which would result in her jumping up when she sees them and accidentally crushing anyone. * Agent Moby (voiced by Maddie Taylor) is a big whale T.U.F.F. Agent who might appear in the special episode \"A Doomed Christmas\". Like Agent Jumbo, Agent Moby also has a tendency to accidentally crush The Chief. * Agent Nutz (voiced by Jeff Bennett) is a squirrel T.U.F.F. Agent who would always freak out about something completely random and blast it with his laser. * Tammy (voiced by Grey DeLisle) is a rabbit that works as a secretary at T.U.F.F. HQ. ====Main villains==== * Verminious Snaptrap (voiced by Maddie Taylor) is an evil rat who is leader of the Diabolical Order of Mayhem. * The Chameleon (voiced by Daran Norris) is an evil green chameleon who might wear a molecular transformation suit which allows him to blend in with walls and disguise himself as anything or anyone. * Bird Brain (voiced by Rob Paulsen) is an evil blue-bottomed booby bird genius who can't fly naturally. =====Snaptrap's Henchmen or D.O.O.M.===== * Larry (voiced by Jeff Bennett) is a shrew and Snaptrap's brother-in-law. * Ollie (voiced by Jeff Bennett) is a sensible and smart British possum who is one of Snaptrap's main henchmen. * Francisco (voiced by Daran Norris) is a green alligator with red and yellow eyes who is another one of Snaptrap's main henchmen. * Bad Dog (voiced by Daran Norris) is a pit bull who is one of Snaptrap's henchmen. He stops appearing after the first season. * Leather Teddy (voiced by Eric Bauza) is a leather clad blue bear and one of Snaptrap's henchmen. He wears an eyepatch. He stops appearing after the first season. * The Mole (voiced by Maddie Taylor) is a literal mole who is a spy for Snaptrap. He stops appearing after the first season. =====Bird Brain's Henchmen===== * Zippy (voiced by Grey DeLisle) is Bird Brain's scatterbrained hummingbird sidekick/partner. *Owl (voiced by Jeff Bennett). *Bat (voiced by Daran Norris impersonating Bela Lugosi). *Duck (voiced by Jeff Bennett). * Ewe (voiced by Grey DeLisle) is a female sheep. ===Recurring and one-off characters=== ====Other villains==== * R.I.T.A. (voiced by Grey DeLisle) is a super-intelligent toaster created by Keswick. * Snowflake (voiced by Mary Birdsong) and Slush (voiced by Dave Boat) are evil rabbit siblings. * Dr. Rabies (voiced by Jerry Trainor) and Madame Catastrophe (voiced by Grey DeLisle) are two villains who resemble Dudley Puppy and Kitty Katswell with eyepatches and goatees. * Crazy Horse (voiced by Daran Norris) is a horse who uses chainsaws. * Jack Rabbit (voiced by Daran Norris) is Kitty's T.U.F.F. partner. * The Caped Cod (voiced by Chris Parnell and later by Mick Wingert) is a crazy cod who thinks he is the ruler of the seven seas. *The Stink Bug (voiced by Carlos Alazraqui) is Petropolis' worst smelling villain. * Desirah (voiced by Kari Wahlgren) is a golden jackal genie who grants wishes to masters and mistresses. * Lunch Lady Bug (voiced by Candi Milo) is a ladybug who worked as a lunch lady at Petropolis High School and makes disgusting food that only Dudley likes. * Quacky the Duck (voiced by Maddie Taylor) was originally a kid show host seen in \"Kid Stuff\". * The Sharing Moose (voiced by Jeff Bennett) is a moose that is the buff and violent best friend of Quacky the Duck. * Katty Katswell (voiced by Grey DeLisle) is Kitty Katswell's evil twin sister. F.L.O.P.P. – Short for Fiendish League of Potential Perpetrators, F.L.O.P.P. is a criminal organization that would often do minor criminal activities. *Meerkat (voiced by Daran Norris) is a meerkat with a black cowboy hat who is the eccentric leader of F.L.O.P.P. * Wanna-Bee (voiced by Jerry Trainor) is a bee who is a member of F.L.O.P.P. * Escape Goat (voiced by Maddie Taylor) is an escape artist goat who is a member of F.L.O.P.P. ====Citizens of Petropolis==== * Peg Puppy (voiced by Leslie Carrara-Rudolph) is Dudley's overprotective mother. * Mrs. Katswell (voiced by Grey DeLisle) is Kitty and Katty Katswell's mother. * Wolf Spitzer (voiced by Daran Norris) is a gray wolf who is Petropolis local news reporter for KPET News; the character is an obvious parody of CNN anchor Wolf Blitzer. * Eric (voiced by Daran Norris) is a buff cat who delivers the water to T.U.F.F. * Bob Barky (voiced by Daran Norris) is a dog game show host who hosts various game shows in Petropolis.. * Phil (voiced by Maddie Taylor) is a bulldog who is Dudley's friend. * Mr. Wong (voiced by Maddie Taylor) is a duck who is the owner of \"Wong's Chinese Buffet\". ==Production== Butch Hartman said that he created the central character and wanted to make a crime-fighting show based on him. Because his previous animated series Danny Phantom already involved superheroes, Hartman decided that he would focus on making Dudley a secret agent. He pitched the series to Nickelodeon as \"Get Smart with a dog.\" Eric Bauza, (who voices Foop in The Fairly OddParents and Leather Teddy in T.U.F.F. Puppy), was originally chosen to be the voice of Dudley Puppy, but the creators didn't feel that he was right for the character and Jerry Trainor was chosen instead. The original title of the show was Stud Puppy. ==Home media== Season Season Episodes Years active Release dates Season Season Episodes Years active 1 26 2010–12 iCarly: Season 2, Volume 3: April 5, 2011 Episodes: \"Purr-fect Partners\" / \"Doom-mates\" * * * SpongeBob SquarePants: Heroes of Bikini Bottom: June 14, 2011 Episodes: \"Mall Rat\" / \"Operation: Happy Birthday\" * * * SpongeBob SquarePants: Frozen Face-Off: January 10, 2012 Episodes: \"Snappy Campers\" / \"Lucky Duck\" * * * It's a Nicktoons Christmas!: October 30, 2012 Episodes: \"A Doomed Christmas\" Note: This disc was exclusively included with copies of the It's a SpongeBob Christmas! DVD sold at Target. * * * The Complete First Season: June 23, 2014 Episodes: Entire season included 2 26 2012–14 The Complete Second Season: January 8, 2015 Episodes: Entire season included Note: The episode \"A Doomed Christmas\" along with Christmas episodes of The Fairly OddParents and Fanboy & Chum Chum were supposed to be on the It's a SpongeBob Christmas! DVD, but they were dropped from the actual release. However, the Target exclusive of It's A SpongeBob Christmas! included the Christmas episodes of those shows on a bonus disc. It's currently unknown if Nickelodeon will ever announce a Season 3 DVD release. ==Reception== ===Critical=== Following the show's premiere, the series received mixed to positive reviews. Emily Ashby of Common Sense Media gave the series 2 out of 5 stars; criticizing the “iffy messages” the show sends to kids and the frequent use of name calling, but adding, “Kitty's attractive appearance and overly emotional response to Dudley's successes are memorable.” ===Ratings=== The series premiere of T.U.F.F. Puppy drew 3.6 million viewers. ===Awards and nominations=== Year Award Category Nominee Result 2011 38th Annie Awards Outstanding Achievement in Storyboarding in an Animated Television Production Fred Gonzales Outstanding Achievement in Character Design in a Television Production Ernie Gilbert Gordon Hammond 38th Daytime Emmy Awards Outstanding Individual Achievement in Animation Kaz Aizawa 2012 39th Annie Awards Outstanding Achievement in Character Design in a Television Production Gordon Hammond and Mike Dougherty Outstanding Achievement in Directing in a Television Production Ken Bruce Outstanding Achievement in Storyboarding in a Television Production Dave Thomas and Fred Gonzales Outstanding Achievement in Writing in a Television Production Ray DeLaurentis, William Schifrin, and Kevin Sullivan for episode \"Thunder Dog\" 39th Daytime Creative Arts Emmy Awards Outstanding Individual Achievement in Animation Ernie Gilbert Outstanding Music Direction and Composition Guy Moon 2013 40th Annie Awards Outstanding Achievement in Character Design in an Animated Television/Broadcast Production Gordon Hammond for episode \"Dudley Do-Wrong\" Outstanding Achievement in Music in an Animated Television/Broadcast Production Guy Moon for episode \"Mission: Really Big Mission\" Outstanding Achievement in Voice Acting in an Animated Television/Broadcast Production Jeff Bennett as \"Keswick\" for episode \"Pup Daddy\" 40th Daytime Creative Arts Emmy Awards Outstanding Performer in an Animated Program Jerry Trainor as \"Dudley Puppy\" ==Notes== ==References== ==Other websites== * Category:2010 American animated television series debuts Category:2015 American television series endings Category:2010s American animated comedy television series Category:2010s American children's comedy television series Category:2010s American comic science fiction television series Category:2010s Nickelodeon original programming Category:American children's animated action television series Category:American children's animated adventure television series Category:American children's animated comic science fiction television series Category:American children's animated science fantasy television series Category:American children's animated superhero television series Category:American spy comedy television series Category:Animated television series about dogs Category:Animated television series about cats Category:American English-language television shows Category:Television series created by Butch Hartman Category:Fictional spies Category:Nicktoons Category:Nicktoons (TV network) original programming Category:Annie Award–winning television shows Category:Children's television series about talking animals",
 "title": "T.U.F.F. Puppy"
}