{
 "id": "69017",
 "text": "Batman Begins is a 2005 superhero movie directed by Christopher Nolan and written by Nolan and David S. Goyer. Based on the fictional DC Comics character Batman, it stars Christian Bale, Michael Caine, Gary Oldman, Liam Neeson, Katie Holmes, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, and Morgan Freeman. The movie reboots the Batman movie series, telling the origin story of Bruce Wayne from the death of his parents to his journey to become Batman and his fight to stop Ra's al Ghul and the Scarecrow from plunging Gotham City into chaos. Batman Begins was successful, and in 2008 a sequel titled The Dark Knight was released. Batman Begins was the first movie in Christopher Nolan's The Dark Knight Trilogy. == Cast == *Christian Bale as Bruce Wayne / Batman: A billionaire industrialist whose parents were killed by a mugger when he was eight years old. He returns to Gotham after traveling the world for several years to seek the means to fight injustice. At night, Bruce becomes Batman, Gotham City's protector. *Michael Caine as Alfred Pennyworth: The trusted butler to Bruce Wayne's parents who continues his loyal service to their son after their deaths. He is Bruce Wayne's closest confidante. Nolan felt Caine would effectively portray the foster father element of the character. Although Alfred's family is shown in the movie as having served the Wayne family for generations, Caine created his own backstory, in that before becoming Wayne's butler, Alfred served in the Special Air Service. After being wounded, he was invited to the position of the Wayne family butler by Thomas Wayne because, \"He wanted a butler, but someone a bit tougher than that, you know?\" *Liam Neeson as Henri Ducard / Ra's al Ghul: While in the guise of Ducard, Ra's trains Bruce in distinctive forms of martial arts. *Katie Holmes as Rachel Dawes: A childhood friend of Bruce who serves as Gotham City's assistant district attorney, fighting against the corruption in the city. *Gary Oldman as Sgt. James Gordon: One of the few uncorrupted Gotham City police officers. He was the officer on duty the night of the murder of Bruce Wayne's parents. In this way, he shares a special bond with the adult Bruce (and thus with Batman). *Cillian Murphy as Dr. Jonathan Crane / The Scarecrow: A psychopharmacologist who works at Arkham Asylum and has developed chemical that causes fear. He uses the character of the Scarecrow to scare others and further his study of fears. *Morgan Freeman as Lucius Fox: A high-ranking Wayne Enterprises employee who was demoted to working in the company's Applied Science Division, where he conducts advanced studies in biochemistry and mechanical engineering. *Colin McFarlane as Commissioner Gillian B. Loeb: The main commissioner of the Gotham police department. *Larry Holden as Finch: A Gotham City attorney and detective who was friends with Rachel until he was killed by Ra's al Ghul's henchmen. *Gerard Murphy as Judge Faden: A corrupt Gotham City judge. *Tom Wilkinson as Carmine Falcone: The most powerful Mafia boss in Gotham. He had shared a prison cell with Joe Chill after Chill murdered Wayne's parents. *Rutger Hauer as William Earle: The CEO of Wayne Enterprises who takes the company public in the long-term absence of Bruce Wayne. *Mark Boone Junior as Detective Arnold Flass: Gordon's corrupt partner and is a drug dealer. *Ken Watanabe as Ra's al Ghul's decoy: a decoy of Ra's al Ghul. == References == == Other websites == *Official site *Official production notes *Film analysis at IGN *Scene-by- scene annotations of Batman Begins *Comic Vs. Film analysis at IGN * * * * * Category:2005 action movies Category:2005 thriller movies Category:2000s action thriller movies Category:2000s superhero movies Category:English- language movies Category:Batman movies Category:Warner Bros. movies Category:Movies based on comic book characters Category:Movies shot in Chicago Category:Nonlinear narrative movies Category:American action thriller movies Category:Movies composed by Hans Zimmer Category:Movies composed by James Newton Howard Category:Movies directed by Christopher Nolan Category:Movies produced by Charles Roven Category:The Dark Knight Trilogy Category:Reboot movies Category:American superhero movies",
 "title": "Batman Begins"
}