{
 "id": "69043",
 "text": "Rodrigo Junqueira dos Reis Santoro (born August 22, 1975) is a Brazilian Actor. He started his career acting in different soap operas in his country. In the last few years, he has become known after his roles in the movies Love Actually and 300. Santoro was born in Petrópolis, Rio de Janeiro. He is half of Italian descent. ==Filmography== Films & TV Year Movie Role Notes 1993 Olho no Olho Pedro Brazilian Telenovela 1994 Pátria Minha Fernando Brazilian Telenovela 1995 Explode Coração Sérgio Brazilian Telenovela 1996 Depois do Escuro Julio short 1996 A Comédia da Vida Privada Brazilian Miniseries 1996 Sai de Baixo Gama Episode: O Sexo Nosso de Cada Dia 1997 O Amor Está no Ar Léo Brazilian Telenovela 1998 Como Ser Solteiro Himself 1998 Hilda Furacão Frei Malthus Brazilian Miniseries 1999 O Trapalhão e a Luz Azul Musketeer Movie 1999 Suave Veneno Eliseu Vieira Brazilian Telenovela 2001 Bicho de Sete Cabeças Wilson Souza Neto Movie 2001 Abril Despedaçado Tonho Movie 2001 Estrela-Guia Carlos Charles Brazilian Telenovela 2001 Os Normais Júlio Episode: Grilar É Normal 2002 Pastores da Noite Padre Gomes Brazilian Miniseries 2003 Carandiru Lady Di Movie 2003 Charlie's Angels: Full Throttle Randy Emmers Cameo 2003 Love Actually Karl 2003 The Roman Spring of Mrs Stone Young Man TV Movie 2003 Mulheres Apaixonadas Diogo Ribeiro Brazilian Telenovela 2004 A Dona da História Luiz Cláudio/Young 2005 Hoje é Dia de Maria Amado/Dom Chico Chicote Brazilian Miniseries 2006–2007 Lost Paulo Regular; Season 3; 14 episodes 2007 300 Xerxes Nominated - MTV Movie Awards for Best Villain 2007 Não Por Acaso Pedro 2008 Live, Love, Laugh, But... Bellboy Short 2008 Redbelt Bruno Silva 2008 Leonera Ramiro 2008 Che Raúl Castro 2008 Os Desafinados Joaquim (young)/ Antonio Goldfaber Movie 2009 Post Grad David Santiago 2009 I Love You Phillip Morris Jimmy 2009 Som & Fúria Sanjay Brazilian Miniseries 2010 Afinal, o Que Querem as Mulheres? Rodrigo Santoro Brazilian Miniseries 2010 Papai Noel Existe Robson Luiz Brazilian Series 2011 There Be Dragons Oriol 2011 Rio Túlio / Soccer Announcer Voice only 2011 Meu País Marcos Movie 2011 Homens de Bem Ciba TV Movie 2012 Reis e Ratos Roni Rato 2012 Hemingway & Gellhorn Zarra TV Movie 2012 As Brasileiras Carioca Episode: A Indomável do Ceará 2012 Heleno Heleno de Freitas Movie 2012 What to Expect When You´re Expecting Alex 2013 The Last Stand Frank Martinez Post-production 2013 The Blind Bastard Club Pre-production 2013 300: Battle of Artemisia Xerxes Pre-production ==Awards and nominations== * Brasília Film Festival ** 2000 – Best Actor for Bicho de Sete Cabeças (Won) * Recife Film Festival ** 2001 – Best Actor for Bicho de Sete Cabeças (Won) *Brazil Quality Award ** 2001 – Best Actor for Bicho de Sete Cabeças (Won) *Santo Domingo Film Festival ** 2001 – Best Actor for Bicho de Sete Cabeças (Won) *SESC Best Film Festival ** 2001 – Best Actor for Bicho de Sete Cabeças (Won) *Cinema Brazilian Grand Prix ** 2002 – Best Actor for Bicho de Sete Cabeças (Won) *APCA Trophy ** 2002 – Best Actor for Bicho de Sete Cabeças (Won) * Cartagena Film Festival ** 2002 – Best Actor for Bicho de Sete Cabeças (Won) *Cero Latitud Film Festival ** 2003 – Best Actor for Bicho de Sete Cabeças (Won) * Brasília Film Festival ** 2003 – Best Actor for Carandiru (Nominated) * Cannes Film Festival ** 2004 – Chopard Trophy of Male Revelation (Won) * MTV Movie Awards ** 2007 – Best Villain for 300 (Nominated) * Brasília Film Festival ** 2011 – Best Actor for Meu País (Won) *Havana Film Festival ** 2011 – Best Actor for Heleno (Won) ==References== ==Other websites== * Category:1975 births Category:Living people Category:Actors from Rio de Janeiro Category:People from Petrópolis",
 "title": "Rodrigo Santoro"
}