{
 "id": "69047",
 "text": "Sir Michael Caine CBE ; (born Maurice Joseph Micklewhite Jr., 14 March 1933) is a retired English actor, producer, and author. Caine is known for his distinctive cockney accent and he has appeared in over 115 movies, and is regarded as a British movie icon. ==Career== His early role in Alfie (1966) earned him an Academy Award nomination. He also starred in The Italian Job (1969) and Battle of Britain (1969). His roles in the 1970s included Get Carter (1971), The Last Valley (1971), Sleuth (1972), for which he earned his second Academy Award nomination, The Man Who Would Be King (1975) and A Bridge Too Far (1977). In 1986, he received an Academy Award for Best Supporting Actor for his performance in Woody Allen's Hannah and Her Sisters. Caine played Ebenezer Scrooge in The Muppet Christmas Carol (1992). In 1999, he won a second Academy Award for Best Supporting Actor for The Cider House Rules.\"Sir Michael Caine collects top French honour\". BBC. Retrieved 14 July 2012 Caine played Nigel Powers, Austin Powers' father in the 2002 parody Austin Powers in Goldmember, and Alfred Pennyworth in Christopher Nolan's The Dark Knight Trilogy. He appeared in several other of Nolan's movies, including The Prestige (2006), Inception (2010) and Interstellar (2014). He also appeared in Alfonso Cuarón's Children of Men and Matthew Vaughn's action comedy movie Kingsman: The Secret Service. Caine is one of only two actors nominated for an Academy Award for acting in every decade from the 1960s to the 2000s, the other one being Jack Nicholson.Michael Caine: A Life Large Enough For An Encore ==Personal life== Caine was married to Patricia Haines from 1955 until they divorced in 1962. He later married Shakira Baksh in 1973. Caine has two children. He supports the Conservative Party and voted for Brexit. In July 2016, Caine legally changed his name from Maurice Joseph Micklewhite to Michael Caine in order to make security checks at airports easier. \"[A security guard] would say, 'Hi Michael Caine,' and suddenly I'd be giving him a passport with a different name on it. I could stand there for an hour. So I changed my name.\" ==Selected awards== Caine won the Academy Award for Best Supporting Actor for his roles in Hannah and Her Sisters and The Cider House Rules. He won the BAFTA Award for Best Actor in a Leading Role for his role in Educating Rita.100 BAFTA Moments - Sir Michael Caine Receives his First BAFTA Nomination He won the following Golden Globe Awards:Michael Caine *Best Actor – Motion Picture Musical or Comedy for his role in Educating Rita *Best Actor – Miniseries or Television Film for his role in Jack the Ripper *Best Actor – Motion Picture Musical or Comedy for his role in Little Voice ==References== == Other websites == *The Official Michael Caine website * *Michael Caine's Norfolk childhood *PLAY DIRTY/Caine Special on Location in Spain *Carfax Theatre Horsham Scene of Sir Michael's first professional acting role Category:1933 births Category:Living people Category:Actors from London Category:BAFTA Award winning actors Category:Best Supporting Actor Academy Award winners Category:English movie actors Category:English stage actors Category:English television actors Category:English voice actors Category:Golden Globe Award winning actors Category:Military personnel of the Korean War Category:Screen Actors Guild Award winners Category:Stage names",
 "title": "Michael Caine"
}