{
 "id": "69063",
 "text": "Jak 3 is a video game for Sony's PlayStation 2 made by Naughty Dog. It is the third game in the Jak and Daxter series. ==Story== Jak, Daxter, and Pecker are thrown into the desert by their own people one year after the previous game, Jak II, ended. They are found by Damas, Kleiver, and another wastelander. Jak is tested in an arena, and wins a fight, proving him worthy to not be killed. He and Daxter then explore, meeting Seem, a monk and Errol along the way. This starts a \"friendship\" with the some well-known citizens of Spargus, and Jak and Daxter soon become used to the city of Spargus, completing missions and looking around the desert for artifacts, or out of mere curiosity. Further throughout the game, Ashelin (a key character in Jak 2), asks Jak to come back to Haven City. Jak refuses, telling her \"they could rot for all I care\", still angry for them throwing him and Daxter out of Haven City for the wrong reason. Later on, he decides to go back, and meets everybody once again. He gains new light powers that give him the ability to fly, make a shield around him, slow time, and heal himself. With his newfound powers he saves Haven City and Spargus City from attacks multiple times. In the end, Jak finds out that Damas was his father, and Veger took him away from him. Jak chases Veger towards the catacombs, and meets the Precursors themselves. It is also found out that Daxter is a Precursor too. Jak and Daxter is sent to Errol to stop him. When he is defeated, Jak, Daxter, and all the others gather together in the arena, while the Precursors make their speech. ==Main characters== *Jak: He is the main character of the game series. He is accompanied with Daxter. *Daxter: Jak's sidekick. He sits on Jak's shoulder while they go on adventures. He is hyperactive and \"immature\", which brings laughter into the game. He is playable in this game. *Ashelin: She was once part of the Krimzon Guard, but then turned to the other side after she realized what her father was up to. She is now head leader of Haven City, having begun a new force, (replacing the Krimzon Guard from Jak 2), called the Freedom League. *Samos: He is also the controller of Green eco. He is Jak and Daxter's \"mentor\". In Jak 2, he was The Shadow, leader of The Underground, which was a movement against Baron Praxis. *Keira: She helps with Jak's missions, and also is his love interest, Jak is also her love interest. *Pecker: Pecker is a talking bird that often joins Jak and Daxter on their missions, and was thrown out along with Jak and Daxter into the desert. He is mostly with Onin, his human \"mother\", but during most of the game he took the role as Damas's advisor instead. He and Daxter have a lot of scuffles and arguments, though that can be presumed as their way of friendliness. *Torn: He was part of the Underground. He and Ashelin usually work together. He befriended Jak the hard way in Jak 2, but he still is not friends with Daxter. He helps out Ashelin in Freedom League business. *Damas: Jak's father. He was the king of Spargus City, and before that, the leader of Haven City. He dies after his own car is flipped onto his body. ==References== Category:2004 video games Category:3D platformers Category:Jak and Daxter Category:Naughty Dog games Category:Open-world video games Category:PlayStation 2 games Category:PlayStation 2-only games Category:Single-player video games Category:Sony Interactive Entertainment games Category:Video game sequels Category:Video games about alien invasions Category:Video games developed in the United States",
 "title": "Jak 3"
}