{
 "id": "690888",
 "text": "Carrie Alexandra Coon (born January 24, 1981) is an American actress. She won a Critics' Choice Television Award for Best Actress in a Drama Series. She won that for playing Nora Durst in the HBO series The Leftovers Coon later played Gloria Bungle in the third season of the television series Fargo For that, she was nominated for a Primetime Emmy Award. She also won a TCA Award for the Individual Achievement in Drama for both performances. On stage, Coon was nominated for a Tony Award for the 2012 revival of Who's Afraid of Virginia Woolf?. Coon was born in Copley, Ohio. ==Awards and nominations== Year Award Category Work Result 2013 Theatre World Award Who's Afraid of Virginia Woolf? 2013 Tony Award Best Featured Actress in a Play Who's Afraid of Virginia Woolf? 2014 St. Louis Gateway Film Critics Association Award Best Supporting Actress Gone Girl 2014 San Diego Film Critics Society Award Best Supporting Actress Gone Girl 2014 Phoenix Film Critics Society Awards Best Actress in a Supporting Role Gone Girl 2014 Awards Circuit Community Awards Best Actress in a Supporting Role Gone Girl 2014 Golden Schmoes Awards Best Supporting Actress of the Year Gone Girl 2014 IGN Summer Movie Awards Best Movie Supporting Actress Gone Girl 2014 IndieWire Critics Poll Best Supporting Actress Gone Girl 2014 Village Voice Film Poll Best Supporting Actress Gone Girl 2015 Empire Award Best Female Newcomer Gone Girl 2015 Central Ohio Film Critics Association Best Ensemble (shared with Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, Kim Dickens, Patrick Fugit, David Clennon and Lisa Banes) Gone Girl 2015 Georgia Film Critics Association Best Ensemble (shared with Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, Kim Dickens, Patrick Fugit, David Clennon and Lisa Banes) Gone Girl 2015 Gold Derby Awards Ensemble Cast (shared with Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, Kim Dickens, Patrick Fugit, Boyd Holbrook, Lola Kirke, Missi Pyle, Emily Ratajkowski, Sela Ward and Casey Wilson) Gone Girl 2015 Gold Derby Awards Breakthrough Performer 2015 Critics' Choice Television Award Best Supporting Actress in a Drama Series The Leftovers 2016 Critics' Choice Television Award Best Actress in a Drama Series The Leftovers 2017 Primetime Emmy Award Outstanding Lead Actress in a Limited Series or Movie Fargo 2017 TCA Award Individual Achievement in Drama The Leftovers and Fargo 2018 Chlotrudis Awards Best Supporting Actress Strange Weather Critics' Choice Television Awards Best Actress in a Movie/Miniseries Fargo Drama Desk Awards Outstanding Actress in a Play Mary Jane Lucille Lortel Awards Outstanding Lead Actress in a Play Mary Jane MTV Movie & TV Awards Best Fight (shared with Scarlett Johansson, Danai Gurira, and Elizabeth Olsen) Avengers: Infinity War Obie Awards Distinguished Performance by an Actress Mary Jane Satellite Awards Best Actress in a Drama / Genre Series The Leftovers 2019 Critics' Choice Television Awards Best Actress in a Movie/Miniseries The Sinner ==References== Category:American television actors Category:American stage actors Category:American movie actors Category:Actors from Ohio Category:1981 births Category:Living people",
 "title": "Carrie Coon"
}