{
 "id": "690937",
 "text": "Descendants 2 is an American musical fantasy television movie. It premiered as a Disney Channel Original Movie on July 21, 2017 on Disney Channel. It was simulcast on Disney-owned networks ABC, Disney XD, Freeform, Lifetime and Lifetime Movies. It is the second installment in the Descendants franchise and the sequel to the 2015 movie Descendants. The movie stars Dove Cameron, Cameron Boyce, Sofia Carson, Booboo Stewart, Mitchell Hope and China Anne McClain. A third movie, Descendants 3, premiered on August 2, 2019. ==Cast== * Dove Cameron as Mal, daughter of Maleficent * Cameron Boyce as Carlos, son of Cruella De Vil * Sofia Carson as Evie, daughter of The Evil Queen * Booboo Stewart as Jay, son of Jafar * Mitchell Hope as Ben, son of Belle and Beast * Brenna D'Amico as Jane, daughter of the Fairy Godmother * Melanie Paxson as the Fairy Godmother, the headmistress of Auradon Prep and Jane's mother * Bobby Moynihan as the Voice of Dude, Carlos' dog who gains the power of speech. * Thomas Doherty as Harry Hook, son of Captain Hook * Dylan Playfair as Gil, son of Gaston * Dianne Doan as Lonnie, daughter of Fa Mulan and Li Shang * Jedidiah Goodacre as Chad Charming, son of Cinderella and Prince Charming * Zachary Gibson as Doug, son of Dopey the Dwarf * Anna Cathcart as Dizzy Tremaine, daughter of Drizella Tremaine and granddaughter of Lady Tremaine * Dan Payne as the Beast, Queen Belle's husband and Ben's father * Keegan Connor Tracy as Belle, Beast's wife and Ben's mother * China Anne McClain as Uma, daughter of Ursula ==References== ==Other websites== * Category:2017 comedy-drama movies Category:2017 fantasy movies Category:2010s teen drama movies Category:American family movies Category:American musical comedy movies Category:American teen comedy movies Category:American teen drama movies Category:American television movies Category:Disney movies Category:2010s English-language movies Category:Movies based on fairy tales Category:Movies directed by Kenny Ortega",
 "title": "Descendants 2"
}