{
 "id": "690932",
 "text": "Descendants is a 2015 American musical fantasy television movie. It was directed and choreographed by Kenny Ortega. The movie stars Dove Cameron, Sofia Carson, Booboo Stewart, and Cameron Boyce. It is about the heroes and villains of Disney animated movies. The movie tells the story of the children of villains Maleficent (Sleeping Beauty), The Evil Queen (Snow White and the Seven Dwarfs), Jafar (Aladdin), and Cruella de Vil (One Hundred and One Dalmatians). Their children are Mal, Evie, Jay, and Carlos. The children are given a chance to be with the heroes at Auradon Prep outside their island prison, The Isle of the Lost. Maleficent instructs Mal to steal the Fairy Godmother's magic wand and free their parents from captivity. However, they instead adjust to their new life and learn to be good. Mal falls in love with Ben, the son of King Beast and Queen Belle (Beauty and the Beast). The movie debuted on July 31, 2015, as a Disney Channel Original Movie, to positive reviews and 6.6 million viewers. The movie also stars Mitchell Hope, Melanie Paxson, Brenna D'Amico, Sarah Jeffery, Zachary Gibson, Jedidiah Goodacre, Dianne Doan, Dan Payne, Keegan Connor Tracy, Wendy Raquel Robinson, Maz Jobrani, Kathy Najimy, and Kristin Chenoweth. The movie is the first installment in the Descendants franchise. It was spun off into a CGI animated short-form series titled Descendants: Wicked World. Two sequels to the movie were made. The first sequel was Descendants 2, which premiered on July 21, 2017. The second sequel was Descendants 3, which premiered on August 2, 2019. ==Cast== * Dove Cameron as Mal, daughter of Maleficent * Cameron Boyce as Carlos, son of Cruella de Vil * Booboo Stewart as Jay, son of Jafar * Sofia Carson as Evie, daughter of Evil Queen * Mitchell Hope as Ben, son of Queen Belle and Beast * Melanie Paxson as Fairy Godmother from Cinderella, the headmistress of Auradon Prep and Jane's mother * Brenna D'Amico as Jane, daughter of Fairy Godmother * Sarah Jeffery as Audrey, daughter of Princess Aurora and Prince Phillip * Zachary Gibson as Doug, son of Dopey from Snow White and the Seven Dwarfs * Jedidiah Goodacre as Chad Charming, son of Cinderella and Prince Charming * Dianne Doan as Lonnie, daughter of Fa Mulan and Li Shang * Dan Payne as Beast from Beauty and the Beast, king of Auradon and Ben's father * Keegan Connor Tracy as Belle from Beauty and the Beast, queen of Auradon and Ben's mother * Wendy Raquel Robinson as Cruella de Vil from One Hundred and One Dalmatians, Carlos' mother * Maz Jobrani as Jafar from Aladdin, Jay's father who owns his own junk shop * Kathy Najimy as Evil Queen from Snow White and the Seven Dwarfs, Evie's mother who still has issues with her stepdaughter, Snow White * Kristin Chenoweth as Maleficent from Sleeping Beauty, Mal's mother who is known as the worst and cruelest villain in Auradon == References == == Other websites == * * Category:2015 comedy- drama movies Category:2015 fantasy movies Category:2010s teen drama movies Category:American family movies Category:American musical comedy movies Category:American teen comedy movies Category:American teen drama movies Category:American television movies Category:Disney movies Category:2010s English-language movies Category:Movies based on fairy tales Category:Movies directed by Kenny Ortega",
 "title": "Descendants"
}