{
 "id": "690928",
 "text": "The Fox and the Hound is a 1981 American animated comedy drama movie. It was produced by Walt Disney Productions. It is loosely based on the 1967 book with the same name by Daniel P. Mannix. It is the 24th Disney animated movie. The movie tells the story of the unlikely friendship between a red fox named Tod and a hound dog named Copper. The two friends have trouble keeping their friendship despite their emerging instincts, as well as the people around them saying that they have to be enemies. Tod was raised by an old farmer named Widow Tweed after his mom was killed. Copper was raised by an old hunter named Amos Slade. The movie has a sub-plot in which a sparrow named Dinky and a woodpecker named Boomer chase a caterpillar named Squeeks for food. The movie was directed by Ted Berman, Richard Rich and Art Stevens. It was produced by Ron Miller, Wolfgang Reitherman and Art Stevens. The movie has the voices of Mickey Rooney, Kurt Russell, Pearl Bailey, Jack Albertson, Sandy Duncan, Jeanette Nolan, Pat Buttram, John Fiedler, John McIntire, Dick Bakalyan, Paul Winchell, Keith Mitchell and Corey Feldman. Walt Disney Productions first bought the rights to make a movie based on the novel by Daniel P. Mannix in 1967. However, the making of the movie did not actually happen until spring 1977. The Fox and the Hound was the last movie to involve the remaining members of Disney's Nine Old Men. Frank Thomas and Ollie Johnston were two of them. In the end, the movie was handed over to a new generation of animators after the retirement of the old animators. However, the old animators had involvement in the early making of the movie. Also, The Fox and the Hound was the first movie for future directors including Tim Burton, Brad Bird and John Lasseter. During the making of the movie, the movie's release was delayed by over six months. This was because of the sudden and unexpected retirement of Don Bluth and his team of animators. In the part of the movie where the character Chief is hit by a train, the movie makers were originally going to have him die like in the book. This was changed so that Chief survives with a broken leg. This decision was controversial with the movie makers. The Fox and the Hound was released to movie theaters on July 10, 1981 by Buena Vista Distribution. The movie was a success at the box office. It was the 14th highest-grossing movie of the year and made $39.9 million in the United States. At the time of release, it was the most expensive animated movie produced to date. It cost $12 million to make the movie. It was re-released to theaters on March 25, 1988. An intermediate follow-up, The Fox and the Hound 2, was released directly-to-DVD on December 12, 2006. == Cast == * Mickey Rooney as Tod * Kurt Russell as Copper, a Bloodhound. * Pearl Bailey as Big Mama * Jack Albertson as Amos Slade * Sandy Duncan as Vixey * Jeanette Nolan as Widow Tweed * Pat Buttram as Chief * John Fiedler as The Porcupine * John McIntire as Mr. Digger * Dick Bakalyan as Dinky * Paul Winchell as Boomer * Keith Mitchell as Young Tod * Corey Feldman as Young Copper * Squeeks the Caterpillar was credited as \"himself\" == Release == === Home media === The Fox and the Hound was first released on VHS on March 4, 1994. This release was the last entry in the Walt Disney Classics collection. It was placed into moratorium on April 30, 1995. On May 2, 2000, the movie was released on Region 1 DVD for the first time. This was part of the Walt Disney Gold Classic Collection line. A 25th anniversary special edition DVD was released on October 10, 2006. The Fox and the Hound was released on Blu-ray on August 9, 2011. This was to honor the movie's 30th anniversary. The movie was released in a 3-disc Blu-ray/DVD Combo pack alongside its direct-to video follow-up The Fox and the Hound 2 in a 2-movies Collection Edition. The Blu-ray has a new digital restoration. It presents the movie for the first time in 1.66:1 widescreen. It also has 5.1 DTS-HD Master Audio. The Fox and the Hound 2 is presented in 1.78:1 widescreen. It has the same sound as the first movie. A DVD-only edition was also released on the same day. == Awards == The movie was awarded a Golden Screen Award () in 1982. In the same year, it was also nominated for a Young Artist Award and the Saturn Award for Best Fantasy Film. Year Ceremony Award Result 1981 9th Saturn Awards Best Fantasy Film 1982 Golden Screen Awards 5th Youth in Film Awards Best Motion Picture - Fantasy or Comedy - Family Enjoyment == Follow-up == A follow-up, The Fox and the Hound 2, was released directly-to-DVD on December 12, 2006. The follow-up takes place during the childhood of Tod and Copper. This is before the events of the later half of the first movie. The story-line is about Copper wanting to join a band of singing stray dogs. This puts his friendship with Tod to the test. The follow-up received negative reception. Critics considered it to be a poor copy of the first movie. == References == == Other websites == * * * * (Dead link) * * * Category:1980s animated movies Category:1980s buddy movies Category:1980s comedy-drama movies Category:American buddy comedy movies Category:American family comedy movies Category:American comedy-drama movies Category:Disney animated movies Category:Movies about dogs Category:Movies based on books Category:1980s English-language movies Category:American coming-of-age movies Category:1980s American drama movies Category:Movies about birds Category:Buddy drama movies Category:Movies about old age Category:Movies set on farms Category:Movies about hunters Category:Movies about animal cruelty Category:1980s coming-of-age movies Category:Coming-of- age comedy movies Category:Coming-of-age drama movies Category:1981 comedy movies Category:1981 drama movies Category:Movies about friendship",
 "title": "The Fox and the Hound"
}