{
 "id": "691018",
 "text": "Emory University is a private university in Atlanta, in the U.S. state of Georgia. The university was started by the Methodist Episcopal Church as Emory College in 1836 in Oxford, Georgia. It was named after Methodist bishop John Emory. The college moved to Druid Hills after Asa Griggs Candler, a wealthy businessperson from the slave owning Magruder family, offered it money and land there. ==Notable people from Emory== File:Alben Barkley, Vice- President.jpg|Alben Barkley, 35th Vice President of the United States (1900C, 1949H) File:Bobby Jones 1930 winnaar US Amateur.jpg|Bobby Jones, Only golfer to win a Grand Slam and founder of the Masters Tournament (1929JD) File:Robert Winship Woodruff, President of the Coca-Cola Company.jpg| Robert W. Woodruff, President of The Coca-Cola Company from 1923 until 1954 File:Kiyoshi Tanimoto, Emory University.jpg|Kiyoshi Tanimoto, Hibakusha portrayed in John Hersey's Hiroshima, Organized the Hiroshima Maidens Program (1940T, 1986H) File:Larry Palmer ambassador portrait.jpg|Larry Leon Palmer, United States Ambassador to Barbados and the Eastern Caribbean (1970C) File:Bernice King at LBJ Presidential Library and Mueseum, 2014.png|Bernice King, American minister and activist, the youngest child of Martin Luther King, Jr. and Coretta Scott King (1990JD) File:Natasha Trethewey during book signing at the University of Michigan.jpg|Natasha Trethewey, 19th US Poet Laureate, Robert W. Woodruff Professor of English and Creative Writing File:Archbishop-Tutu- medium.jpg|Desmond Tutu, South African social rights activist, Recipient of 1984 Nobel Peace Prize for opposition to Apartheid (Professor) File:William H. Foege Color.jpg|William Foege, 10th Centers for Disease Control and Prevention Director, Credited for global eradication of Smallpox (Professor) File:Dalailama1 20121014 4639.jpg|Tenzin Gyatso, 14th Dalai Lama, Recipient of 1989 Nobel Peace Prize and Congressional Gold Medal in 2007 (Professor) File:JimmyCarterPortrait2.jpg|Jimmy Carter, 39th President of the United States, Recipient of 2002 Nobel Peace Prize (Professor) ==References== ==Other websites== * Official website Category:1830s establishments in Georgia (U.S. state) Category:1836 establishments in the United States Category:Emory University Category:Buildings and structures in Atlanta",
 "title": "Emory University"
}