{
 "id": "691045",
 "text": "The Rijksmuseum is a Dutch museum. It is run by the government and focused on the arts and history of Amsterdam. The museum is located in Amsterdam Museumplein , I Amsterdam. Retrieved 4 April 2013. The Rijksmuseum was opened in The Hague in 1800. It then moved to Amsterdam in 1808. The current main building was designed by Pierre Cuypers and opened in 1885.The renovation, Rijksmuseum. Retrieved on 4 April 2013. In 2013 and 2014, it was the most visited museum in the Netherlands. It is also the largest art museum in the country. The museum has 8,000 items that can be seen by those who go to it. This is out of a total of 1 million items. The collection includes items by Rembrandt, Frans Hals, and Johannes Vermeer. The museum also has a small collection of Asian items. ==History== ===18th century=== The year 1795 marked the start of the Batavian Republic. One of the members of the new government was Isaac Gogel. He suggested a new national museum, like the French Louvre. On 19 November 1798, the government agreed to the museum. Roelof van Gelder, Schatkamer met veel gezichten, 2000. Retrieved 15 April 2013. On 31 May 1800, the new museum opened. It was at first known as the National Art Gallery (Dutch: Nationale Kunst-Galerij). It had about 200 paintings and other items. These came from the collections of the Dutch stadtholders. ===19th century=== In 1806, the Kingdom of Holland was established by Napoleon Bonaparte. It replaced the Batavian Republic. In 1808, the museum moved to Amsterdam as ordered by Louis Bonaparte. After the move, more paintings were added. These included The Night Watch by Rembrandt. In 1863, there was a design contest for a new building for the museum. None of the submissions were selected. In 1876, a new contest was held and this time Pierre Cuypers won. His design was a mix of gothic and renaissance. The work on the new building start on 1 October 1876. It opened on 13 July 1885. In 1890, another building was added a short distance to the south-west of the Rijksmuseum. This one was made out of pieces of demolished buildings. It has since become known as the 'fragment building'. It is also known as the 'south wing' and is currently (in 2013) branded as the Philips Wing. ===20th century=== In 1906, the hall for the Night Watch was rebuilt. More changes were made between the 1920s and 1950s. In the 1960s extra rooms and floors were built. Other changes and fixes were done in 1984, 1995–1996 and 2000. The south wing of the museum was repaired in 1996.A new art: photography in the 19th century. The photo collection of the Rijksmuseum, Amsterdam, edited by curators Mattie Boom and Hans Rooseboom, preface by Peter Schatborn and Ronald de Leeuw, essays by Jan Piet Filedt Kok, Mattie Boom, Hans Rosenboom, Robbert van Venetie, Hedi Hegeman, Andreas Blühm, Saskia Asser and Annet Zondervan, Rijksmuseum & Van Gogh Museum, 1996, ===21st century=== In December 2003, the main building was closed for repair. During these repairs, about 400 items could still be viewed in the south wing. These included Rembrandt's The Night Watch and other 17th-century paintings. The repairs were completed on 16 July 2012. On 13 April 2013, the main building was opened again. == Building == The main building was designed by Pierre Cuypers and opened in 1885. It has two squares with an atrium in each centre. The Rijksmuseum is a national heritage site since 1970. Monumentnummer: 5680 , Rijksdienst voor het Cultureel Erfgoed. Retrieved on 6 March 2014. File:Trippenhuis Amsterdam interior 003.jpg|The Rijksmuseum was in the Trippenhuis building between 1817 and 1885. File:P.J.H. Cuypers Rijksmuseum perspective.jpg|Drawing of the design by Pierre Cuypers in 1876. File:Rijksmuseum Amsterdam ca 1895.jpg|Front of Cuypers' building, about 1895. File:Museo Nacional, Ámsterdam, Países Bajos, 2016-05-30, DD 16-18 HDR.jpg|View of the facade by night. File:Amsterdam 2016 Rijksmuseum.webm|Video of the Rijksmuseum (2016). ==Collection== The collection has 1 million items of arts, crafts, and history. These come from the years 1200 to 2000. Around 8000 of these items can be viewed in the museum. The collection has more than 2,000 paintings from the Dutch Golden Age. Some are from notable painters such as Jacob van Ruisdael, Frans Hals, Johannes Vermeer, Jan Steen, Rembrandt, and Rembrandt's students. The museum also has a small Asian collection. It also displays the stern of HMS Royal Charles which was captured in the Raid on the Medway, and the Hartog plate. In 2012, the museum made 125,000 high-resolution images available for download.Rijkstudio promotes and enables the reuse of the Rijksmuseum collection. It plans to add another 40,000 images per year until the entire collection is available. ==Gallery== File:Frans Hals - Wedding portrait of Isaac Abrahamsz Massa and Beatrix van der Laan.jpg|Portrait of a Young Couple (1622) by Frans Hals File:Rembrandt Harmensz. van Rijn - Jeremia treurend over de verwoesting van Jeruzalem - Google Art Project.jpg|Jeremiah Lamenting the Destruction of Jerusalem (1630) by Rembrandt File:Frans Hals, De magere compagnie.jpg|The Meagre Company (1633–37) by Frans Hals and Pieter Codde File:The Nightwatch by Rembrandt.jpg|The Night Watch (1642) by Rembrandt File:Bartholomeus van der Helst, Banquet of the Amsterdam Civic Guard in Celebration of the Peace of Münster.jpg|Banquet at the Crossbowmen’s Guild in Celebration of the Treaty of Münster (1648) by Bartholomeus van der Helst File:De bedreigde zwaan Rijksmuseum SK-A-4.jpeg|The Threatened Swan ( 1650) by Jan Asselijn File:Johannes Vermeer - Het melkmeisje - Google Art Project.jpg|The Milkmaid ( 1657–58) by Johannes Vermeer File:Rembrandt Harmensz. van Rijn - Portret van een paar als Oud-Testamentische figuren, genaamd 'Het Joodse bruidje' - Google Art Project.jpg|The Jewish Bride ( 1667) by Rembrandt File:Portret van een meisje in het blauw Rijksmuseum SK-A-3064.jpeg|Girl in a Blue Dress (1641) by Johannes Cornelisz Verspronck File:Jacob Isaacksz. van Ruisdael - Landschap met waterval - Google Art Project.jpg|Landscape with Waterfall (1660s) by Jacob van Ruisdael == Visitors == year visitors year visitors year visitors 1975 1,412,000 Openingsjaar Rijksmuseum breek alle records , Rijksmuseum, 2013. Retrieved on 2013-12-27. 2000 1,146,438 Jaarverslag 2001, Rijksmuseum, 2002. Retrieved 25 April 2013. 2010 896,393 2001 1,015,561 2011 1,010,402 1992 1,216,103 2002 1,100,488 Jaarverslag 2003, Rijksmuseum, 2004. Retrieved 25 April 2013. 2012 894,058Jaarverslag 2012 (in Dutch), Rijksmuseum. Retrieved 23 January 2017. 1993 936,400 \"Museumbezoek in 1993 sterk gedaald\", NRC Handelsblad, 1994. Retrieved 21 November 2016. 2003 833,450 2013 2,246,122 1994 1,002,000 \"Nieuwe musea hadden in 1995 een goede start\", de Volkskrant, 1996. Retrieved 21 November 2016. 2004 812,102 Jaarverslag 2005, Rijksmuseum, 2006. Retrieved 25 April 2013. 2014 2,474,352 1995 942,000 \"Grote musea trokken in 1995 minder bezoekers\", Trouw, 1996. Retrieved 21 November 2016. 2005 842,586 2015 2,345,666 1996 1,275,000 Rijksmuseum en Kunsthal trekken veel bezoekers, de Volkskrant, 1997. Retrieved 25 April 2013. 2006 1,142,182 Jaarverslag 2011, Rijksmuseum, 2012. Retrieved on 25 April 2013. 2016 2,200,000 (est.) 1997 1,084,652 Jaarverslag 1998, Rijksmuseum, 1999. Retrieved 25 April 2013. 2007 969,561 1998 1,229,445 Jaarverslag 1999, Rijksmuseum, 2000. Retrieved 25 April 2013. 2008 975,977 1999 1,310,497 2009 876,453 == Restaurant == Rijks, stylized as RIJKS®, is a restaurant in the Philips Wing.Brooke Bobb, \"Go for the Art, Stay for the Food: The 7 Best Museum Restaurants Around the World \", Vogue, 2016. Retrieved 10 January 2017. Joris Bijdendijk has been the chef since the opening in 2014.\"Joris Bijdendijk verantwoordelijk voor nieuwe restaurant Rijksmuseum\", Het Parool, 2014. Retrieved 10 January 2017. The restaurant was awarded a Michelin star in 2017.\"Michelinster voor Amsterdamse restaurants Rijks, Bolenius en Mos\", Het Parool, 2016. Retrieved 10 January 2017. ==Notes== ==References== ==Other websites== *Rijksmuseum, official website Category:1800 establishments Category:1800s establishments in Europe Category:19th-century establishments in the Netherlands Category:Art museums Category:Museums in the Netherlands Category:National museums Category:Buildings and structures in Amsterdam",
 "title": "Rijksmuseum"
}