{
 "id": "691105",
 "text": "John Daniel Singleton (January 6, 1968 - April 28, 2019) was an American movie director, screenwriter, and producer. He was best known for directing Boyz n the Hood (1991). He was nominated for the Academy Award for Best Director, becoming the first African American and youngest person to have ever been nominated for the award, at age 24. His other works included Poetic Justice (1993), Higher Learning (1995), and Baby Boy (2001). == Death == On April 17, 2019, Singleton had a massive stroke and was hospitalized in the intensive care unit in Los Angeles. On April 25, it was reported that he was in a coma. On April 29, he was said to be on life-support, but he actually died on April 28 at the age of 51 at Cedars-Sinai Hospital. ===Filmography=== Year Title Director Writer Producer Notes 1991 Boyz n the Hood Nominated- Academy Award for Best Director Nominated- Academy Award for Best Original Screenplay 1993 Poetic Justice 1995 Higher Learning 1997 Rosewood 2000 Shaft 2001 Baby Boy 2003 2 Fast 2 Furious 2005 Four Brothers 2011 Abduction Final Film Producer only {| class=\"wikitable\" Year Title Notes 2005 Hustle & Flow 2006 Black Snake Moan 2007 Illegal Tender Also music supervisor 2008 The Making of 'Illegal Tender' Documentary short ====Acting credits==== Year Title Role Notes 1991 Boyz n the Hood Mailman 1994 Beverly Hills Cop III Fireman 1995 Your Studio and You Himself Short film; Uncredited 2000 Shaft Bored Cop with Tea Cup Uncredited 2001 Baby Boy Man Selling Bootleg Movies Uncredited 2002 8 Mile Bouncer 2003 Baadasssss! Detroit J ====Other credits==== Year Title Credit Notes 2002 sIDney Mentor to the director Short === Television === Year Title Director Executive Producer Writer Notes 2009 81st Academy Awards Segment: The Biggest Movie Event of the Year\" 2010 30 for 30 Episode \"Marion Jones: Press Pause\" 2015 Empire Episode \"Dangerous Bonds\" 2016 American Crime Story Episode \"The Race Card\" 2017 L.A. Burning: The Riots 25 Years Later Documentary television film Rebel Director (episode \"Pilot\"); Executive producer (3 episodes) Billions Episode \"Victory Lap\" 2017–19 Snowfall Co-creator; Director (2 episodes); Writer (2 episodes) ====Acting credits==== Year Title Credit Notes 2013 The Game Himself 2 episodes 2014 Real Husbands of Hollywood Himself 2 episodes ====Other credits==== Year Title Credit Notes 1986 Pee- wee's Playhouse Production assistant 1988 Beach Boys: Endless Summer Production assistant ==References== ==Other websites== *The Films of John Singleton * Category:1968 births Category:2019 deaths Category:Deaths from stroke Category:Movie directors from Los Angeles Category:Movie producers from Los Angeles Category:Screenwriters from Los Angeles",
 "title": "John Singleton"
}