{
 "id": "691213",
 "text": "The epidermis in plants is a single layer of cells. It covers the leaves, flowers, roots and stems of plants. It divides the plant from the outside environment. The epidermis has more than one function. It protects the plant from loss of water. It controls gas exchange. It makes metabolic compounds. In the roots it takes in water and nutrients. Some parts of a plant may have a different cover called a periderm. Potatoes have that kind of covering. The epidermis is the outer cell layer of a plant. It is also the main part of the dermal tissue of leaves, stems, roots, flowers, fruits, and seeds.Evert, Ray F; Eichhorn, Susan E. 2006. Esau's Plant Anatomy: meristems, cells, and tissues of the plant body: their structure, function, and development. Wiley- Liss. ISBN 978-0471738435 It is usually transparent. The cells of the epidermis can vary in the way they are made and how they work. Most plants have an epidermis that is a single cell layer thick. Some plants, however, have an epidermis with more than one layer. Epidermal cells are linked tightly to each other. They give strength and protection to the plant. In the parts of the plant that are above ground, the epidermal cells contain cutin and are covered with a cuticle. This cuticle reduces loss of water. It is sometimes covered with wax. The wax gives some plants a whitish or bluish surface color. It also protects the plant from sunlight and wind.Raven, Peter H. et al 1981. Biology of plants. New York, N.Y. Worth Publishers, p427–28. ISBN 0-87901-132-7 The epidermis has more than one cell type. It can include epidermal cells, guard cells, subsidiary cells, and epidermal hairs (Trichomes). There are more epidermal cells than the other types. Trichomes (or hairs) grow out from the epidermis in many plants. ==Related pages== * Bark * Cork cambium * Periderm ==References== ==Other websites== * Plant tissue systems Category:Plant anatomy Category:Plant tissues",
 "title": "Epidermis (botany)"
}