{
 "id": "691837",
 "text": "The Gandalf Awards honor excellent writing in fantasy literature. The World Science Fiction Society gave the awards each year from 1974 to 1981. They were named for Gandalf the wizard from the Middle-earth stories by J. R. R. Tolkien. The award was started and sponsored by Lin Carter\"Lin Carter Dies\" (obituary) in Locus, March 1988, p. 69. and the Swordsmen and Sorcerers' Guild of America (SAGA).Gandalf Award and subsidiary pages. The Internet Speculative Fiction Database. Retrieved 2011-07-29. People at the World Science Fiction Conventions voted to choose the winners. They used the same rules as the older Hugo Awards. The awards were given in two categories: one, for life achievement, and two, for a book published the year before. ==Gandalf Grand Master Award== The Gandalf Grand Master Award for life achievement in fantasy writing was awarded every year from 1974 to 1981. The first winner was J. R. R. Tolkien who had died recently in 1973. The next four Grand Masters were all members of the SAGA: Fritz Leiber, L. Sprague de Camp, Andre Norton, and Poul Anderson. The last three were Ursula K. Le Guin, Ray Bradbury, and C. L. Moore. *1974 - J. R. R. Tolkien *1975 - Fritz Leiber *1976 - L. Sprague de Camp *1977 - Andre Norton *1978 - Poul Anderson *1979 - Ursula K. Le Guin *1980 - Ray Bradbury *1981 - C. L. Moore There was no voting in 1981.1981 Gandalf Award. The Internet Speculative Fiction Database. Retrieved 2011-07-29. ==Gandalf Award for Book-Length Fantasy== The Gandalf Award for Book-Length Fantasy was awarded only in 1978 and 1979. Again the first winner was Tolkien. The winning book was The Silmarillion with Christopher Tolkien as editor. The second was The White Dragon by Anne McCaffrey. Fantasy fiction often wins the older Hugo Award for Best Novel, so Worldcon organizers thought the Gandalf Award may be a duplicate and this was not awarded again. *1978 - The Silmarillion, J. R. R. Tolkien, edited by Christopher Tolkien *1979 - The White Dragon, Anne McCaffrey ==References== Category:Literary awards",
 "title": "Gandalf Award"
}