{
 "id": "691843",
 "text": "The Avengers is a 1998 American action and spy movie. It comes from the British television series of the same name. ==Plot== John Steed, the agent of the Ministry, completes a training course. Dr. Emma Peel gets a phone call telling her to go to a gentlemen's club. She meets Steed for the first time there. The two head off to the Ministry to meet Mother. Mother tells them the Prospero project-a try to change the weather-was sabotaged by Emma Peel. Dr. Peel says she's innocent. She is then sent to work with Steed to find the real suspect. Steed and Emma follow a lead to the Wonderland Weather. It's a business that creates heat or other weather with a special machine. Steed and Emma find two dead men in teddy bear suits. Members of a secret organization led by Sir August de Wynter wear teddy bear suits to disguise their identities. However, one of them looks like another Emma Peel. Steed arrives in time to save the real Emma Peel. Steed and Emma go off and visit de Wynter at his mansion. But then, they are attacked by mechanical bees. Alice, a Ministry agent, helps Steed and Emma flee. However, de Wynter catches Emma as she tries to escape though finds herself trapped. It is later revealed that the other Emma Peel is a clone. Father and the Peel clone catch the real Emma Peel. They're angrily met by Mother. Mother is then incapacitated. Father and Peel's clone take the real Emma to a hot air balloon. Father and Peel's clone die when the balloon crashes and explodes. Invisible Jones learns de Wynter is using the Prospero instruments on a secret island. Steed and Emma arrive at the island to stop him. ==Cast== * Ralph Fiennes as John Steed, a British Ministry agent * Uma Thurman as Emma Peel, Scientist, Ministry agent * Sean Connery as Sir August de Wynter, a weather scientist and a terrorist * Jim Broadbent as Mother, Director of the Ministry * Fiona Shaw as Father, Deputy Director of the Ministry, ally of Sir August * Eddie Izzard as Bailey, Sir August's henchman * Eileen Atkins as Alice, a Ministry Agent * Carmen Ejogo as Brenda, a Ministry Agent, Mother's aide * John Wood as Trubshaw, Steed's tailor * Keeley Hawes as Tamara, Agent of Sir August * Patrick Macnee (voice) as Invisible Jones, a Ministry Agent * Lorraine McBride as Nun ==Critical response== The Avengers was hated by many movie critics. The Rotten Tomatoes gave this movie a 5% rating, meaning \"rotten\". The Metacritic rated the movie at 12/100. That rating meant \"overwhelming dislike\". The movie won two awards: one Golden Raspberry Award for Worst Remake or Sequel, and a Stinkers Bad Movie Award for Worst Resurrection of a TV show. ===Awards=== Award Category Nominee Result Razzie Award Worst Picture Jerry Weintraub Razzie Award Worst Director Jeremiah S. Chechik Razzie Award Worst Screenplay Don Macpherson Razzie Award Worst Actor Ralph Fiennes Razzie Award Worst Screen Couple Ralph Fiennes Razzie Award Worst Screen Couple Uma Thurman Razzie Award Worst Actress Uma Thurman Razzie Award Worst Supporting Actor Sean Connery Razzie Award Worst Original Song Storm Razzie Award Worst Remake or Sequel Jerry Weintraub Stinkers Bad Movie Awards Worst Picture Jerry Weintraub Stinkers Bad Movie Awards Worst Director Jeremiah S. Chechik Stinkers Bad Movie Awards Worst Actor Ralph Fiennes Stinkers Bad Movie Awards Worst On-Screen Couple Ralph Fiennes Stinkers Bad Movie Awards Worst On-Screen Couple Uma Thurman Stinkers Bad Movie Awards Worst Actress Uma Thurman Stinkers Bad Movie Awards Most Annoying Fake Accent Uma Thurman Stinkers Bad Movie Awards Worst Supporting Actor Sean Connery Stinkers Bad Movie Awards Worst Resurrection of a TV Show Jerry Weintraub ==References== Category:1998 action movies Category:1998 thriller movies Category:1990s action thriller movies Category:1990s spy movies Category:American action thriller movies Category:American spy movies",
 "title": "The Avengers (1998 movie)"
}