{
 "id": "692259",
 "text": "Hand2Mouth Theatre is a theater group in Portland, Oregon. The group works together to create their performances. They decide all languages, movements and designs themselves, instead of working from a script. ==Influences== Hand2Mouth Theatre is influenced by the work of Forced Entertainment http://seattletimes.nwsource.com/html/thearts/2003990369_mouth03.html Elevator Repair Service, and Jerzy Grotowski. ==History== Jonathan Walters founded Hand2Mouth in 2000. He had trained with street theatre troupe Teatr Biuro Podrozyhttp://www.teatrbiuropodrozy.ipoznan.pl/indexeng.html in Poland. As of 2009, Hand2Mouth had created 15 original performances. The group had grown to include a core of company members and associate artists. Company members have traveled and studied in London, New York, Poland, Denmark and Mexico City. ==Performance History== 2002 - Blue Mountain Community College, Pendelton, OR (Jerusalem) 2003 - River Theatre, Astoria, OR (Posture Queen) 2004 - Open Theatre International Festival, Katowice, Poland (Blue with Stacja Szamocin) 2004 - Pablo Neruda Centenary Festival, Portland State University, Portland, OR (Slender with Carpetbag Brigade) 2004 - PuppetLove! Festival, San Francisco, CA (The Wild Child) 2004 - River Theatre, Astoria, OR (Thirst) 2005 - Festival Malta, Poznan, Poland (Blue with Stacja Szamocin) 2005 - Kalisz Theatre Festival, Kalisz, Poland (Blue with Stacja Szamocin) 2005 - Edmonds Community College, Seattle, WA (The Wild Child) 2005 - Willamette University, Salem, OR (The Wild Child) 2006 - Just Add Water Festival, Portland Center Stage, Portland, OR (After Hours) 2007 - On the Boards, Seattle, WA (Repeat After Me) 2007 - Time-Based Art Festival, Portland Institute for Contemporary Art, Portland, OR (Repeat After Me) 2007 - Northwest New Works Festival, On the Boards, Seattle, WA (Repeat After Me - excerpt) 2008 - Myrna Loy Center, Helena, MT (Repeat After Me) 2008 - Bumbershoot Arts Festival, Seattle, WA (Project X: You Are Here) 2008 - NW New Works Festival, Seattle, WA (Undine) 2008 - 10 Tiny Dances, Portland, OR (Project X: You Are Here) 2009 - Fury Festival, Fury Factory, San Francisco, CA (Repeat After Me) 2013 - The Left Hand of Darkness, Portland, Oregon. 2015 - Time, A Fair Hustler, Fertile Ground Festival, Portland, OR. ==References== ==Other websites== * Official website - www.hand2mouththeatre.org * Portland Mercury feature article on Repeat After Me * Seattle PI review of Repeat After Me * Oregonian review of Project X: You Are Here * Portland Mercury review of Undine * Oregonian review of Everyone Who Looks Like You Category:Portland, Oregon Category:Theater",
 "title": "Hand2Mouth Theatre"
}