{
 "id": "692678",
 "text": "Diane Larsen-Freeman (born 1946) is an American linguist. She is now a Professor Emerita in Education and in Linguistics at the University of Michigan in Ann Arbor, Michigan. She works in Applied linguistics. She studies in second language acquisition, English as a second or foreign language, language teaching methods, teacher education, and English grammar. Her work on the complex/dynamic systems approach to second language development is very important and well-known. ==Career== Larsen-Freeman began her career as a Peace Corps volunteer. She taught English in Sabah, Malaysia from 1967 to 1969. She says this experience started her interest in language acquisition. She went on to graduate studies at the University of Michigan, earning her PhD in linguistics in 1975. Larsen-Freeman worked at the faculty of the University of California, Los Angeles and then the SIT Graduate Institute. In 2002, she returned to the University of Michigan to direct the English Language Institute. She was also Professor in the School of Education and the Department of Linguistics. She retired from the University of Michigan in 2012. She has emerita positions at the English Language Institute and in Education and Linguistics at the University of Michigan, and at the SIT Graduate Institute. She is still active in her field, and teaches courses on the structure of English and second language development as a visiting senior fellow at the University of Pennsylvania Graduate School of Education. Larsen- Freeman mostly researches second language acquisition. She also studies English grammar. She thinks grammar is not only a set of structural patterns, but also important for making meaning and for changing language to meet a communicative context. She thinks that complexity theory is a new and useful way to understand language, its acquisition, and its use. She sees all three as complex changing processes that do not move neatly in a straight line. She applied this idea to teaching grammar, or “grammaring” as she calls it. The dynamic approach to second language development includes the idea that students each have their own path to learning, and that teaching is fundamentally a process of managing learning. Larsen-Freeman was also the editor of the journal Language Learning for five years. In 1997, she wrote a leading article applying complex/dynamic systems theory to study second language acquisition. A book of papers in her honor, Complexity Theory and Language Development, was published in 2017. ==Writing== ===Books=== *Larsen- Freeman, D. (Editor) (1980). Discourse Analysis in Second Language Research. Newbury House. *Celce-Murcia, M., & Larsen-Freeman, D. (1983). The Grammar Book: An ESL/EFL Teacher's Course. Newbury House. *Larsen-Freeman, D. (1986). Techniques and Principles in Language Teaching. Oxford University Press. *Larsen-Freeman, D., & Long, M.H. (1991). An Introduction to Second Language Acquisition Research. *Celce-Murcia, M., & Larsen-Freeman, D. (1999). The Grammar Book: An ESL/EFL Teacher’s Course (2nd edition). Heinle & Heinle. *Larsen-Freeman, D. (2000). Techniques and Principles in Language Teaching (2nd edition). Oxford University Press. *Larsen-Freeman, D. (Series Director) (2002). Olympic English. Mc-Graw Hill. *Larsen-Freeman, D. (2003). Teaching Language: From Grammar to Grammaring. Heinle Cengage. *Larsen-Freeman, D., & Cameron, L. (2008). Complex Systems and Applied Linguistics. Oxford University Press. *Larsen-Freeman, D. (Series Director) (2008). Grammar Dimensions: Form, Meaning, and Use (Revised edition). National Geographic Learning. *Ellis, N.C., & Larsen-Freeman, D. (Editors) (2009). Language as a Complex Adaptive System. Wiley-Blackwell. *Larsen-Freeman, D., & Anderson, M. (2011). Techniques and Principles in Language Teaching (3rd edition). Oxford University Press. *Larsen-Freeman, D., & Celce-Murcia, M. (2015). The Grammar Book: Form, Meaning and Use for English Language Teachers (3rd edition). National Geographic Learning/Cengage Publishing Company. ===Articles=== * Larsen-Freeman, D.E. (1975). The acquisition of grammatical morphemes by adult ESL students. TESOL Quarterly, 9(4), 409-419. *Larsen-Freeman, D. (1985). Overviews of theories of language learning and acquisition. In Issues in English Language Development, National Clearinghouse for Bilingual Education. ERIC: ED273145. *Larsen-Freeman, D. (1989). Pedagogical descriptions of language: Grammar. Annual Review of Applied Linguistics, 10, 187-195. *Larsen- Freeman, D. (1991). Second language acquisition research: Staking out the territory. TESOL Quarterly, 25(2), 315-350. *Larsen-Freeman, D. (1997). Chaos/complexity science and second language acquisition. Applied Linguistics, 18(2), 141-165. *Larsen-Freeman, D. (2002). Making sense of frequency. Studies in Second Language Acquisition, 24(2), 275-285. *Larsen-Freeman, D. (2004). Conversation analysis for second language acquisition? It all depends. The Modern Language Journal, 88(4), 603-607. * Larsen-Freeman, D. (2006). The emergence of complexity, fluency, and accuracy in the oral and written production of five Chinese learners of English. Applied Linguistics, 27(4), 590-619. *Ellis, N.C., & Larsen-Freeman, D. (2006). Language emergence: Implications for applied linguistics. Applied Linguistics, 27, 558-589. * Larsen-Freeman, D. (2007). On the complementarity of chaos/complexity theory and dynamic systems theory in understanding the second language acquisition process. Bilingualism: Language and Cognition, 10(1), 35-37. *Larsen-Freeman, D., & Freeman, D. (2008). Language moves: The place of \"foreign\" languages in classroom teaching and learning. Review of Research in Education, 32(1), 147-186. *Larsen-Freeman, D., & Cameron, L. (2008). Research methodology on language development from a complex systems perspective. The Modern Language Journal, 92(2), 200-213. *Larsen-Freeman, D. (2009). Teaching and testing grammar. In M. Long & C. Doughty (Eds.), The Handbook of Language Teaching. Blackwell. *Ellis, N.C., & Larsen-Freeman, D. (2009). Constructing a second language: Analyses and computational simulations of the emergence of linguistic constructions from usage. Language Learning, 59(s1), 90-125. *Larsen-Freeman, D. (2011). Key concepts in language learning and language education. In J. Simpson (Ed.), Routledge Handbook of Applied Linguistics. *Larsen-Freeman, D. (2012). Complex, dynamic systems: A new transdisciplinary theme for applied linguistics? Language Teaching, 45(2), 202-214. *Larsen- Freeman, D. (2012). From unity to diversity... to diversity within unity. English Teaching Forum, 50(2), 28-38. *Larsen-Freeman, D. (2012). On the role of repetition in language teaching and learning. Applied Linguistics Review, 3(2), 195-210. *Larsen-Freeman, D. (2012). The emancipation of the language learner. Studies in Second Language Learning and Teaching, 2(3), 297-309. *Larsen-Freeman, D. (2013). Transfer of learning transformed. Language Learning, 63(s1), 107-129. *Larsen-Freeman, D. (2015). Saying what we mean: Making the case for second language acquisition to become second language development. Language Teaching, 48(4), 491-505. *Larsen-Freeman, D. (2015). Research into practice: Grammar learning and teaching. Language Teaching, 48(2), 263-280. *The Douglas Fir Group. (2016). A transdisciplinary framework for SLA in a multilingual world. The Modern Language Journal, 16, 19-47. *Larsen-Freeman, D. (2016). Classroom-oriented research from a complex systems perspective. Studies in Second Language Learning and Teaching, 6(3), 377-393. ==Awards== *Kenneth W. Mildenberger Prize with Lynne Cameron for Complex Systems and Applied Linguistics, awarded by the Modern Language Association (2008) *Distinguished Scholarship and Service Award, awarded by the American Association of Applied Linguistics (2011) *50 at 50 Leader in TESOL, selected by TESOL International Association (2016) == Related pages == List of women linguists ==References== == Other websites == * Larsen-Freeman on the University of Michigan's website Category:1946 births Category:Living people Category:University of California faculty Category:American linguists Category:Educators from Los Angeles Category:Academics from Michigan Category:Academics from Pennsylvania",
 "title": "Diane Larsen-Freeman"
}