{
 "id": "693215",
 "text": "Kenneth Clark Loggins (born January 7, 1948) is an American singer-songwriter and guitarist. Loggins was born in Everett, Washington. ==Career== He first became well-known in the 1970s as one half of the rock-pop duo Loggins and Messina with Jim Messina. In the 1980s, Loggins became known for his songs, many of which were hits, for movie soundtracks. He famously sung \"Danger Zone\" (peaked at #2 in the U.S.) and \"Playing with the Boys\" from Top Gun (1986) and \"Footloose\" (#1 in the U.S., Australia, Canada, New Zealand and South Africa) and \"I'm Free (Heaven Helps the Man)\" from Footloose (1984). For \"Footloose\", he was nominated for an Academy Award for Best Original Song. He also performed the songs \"I'm Alright\" (peaked at #7 in the U.S.), \"Mr. Night\" and \"Lead the Way\" from Caddyshack (1980), and \"Meet Me Half Way\" from Over the Top (1987). Loggins wrote the song \"What a Fool Believes\" with Michael McDonald. The single was performed by the Doobie Brothers, reaching #1 in the U.S. and Canada in 1979. In 1981, he won the Grammy Award for Best Male Pop Vocal Performance for his song \"This Is It\". He was also a member of USA for Africa, singing on the 1985 fundraising single \"We Are the World\". Loggins voiced himself, the host of Los Santos Rock Radio, in the 2013 video game Grand Theft Auto V. He has also had guest appearances in the animated series Archer and Family Guy. ==Personal life== He was married to Eva Ein from 1978 to 1990. The couple had three children, Crosby (born 1980), Cody (born 1983) and Isabella (born 1988). He was married to Julia Cooper from 1992 to 2004. They have two children, Lukas (born 1993) and Hana (born 1997). ==Filmography== * Yakety Yak, Take it Back (1991) ... Himself ==References== ==Other websites== * * Category:1948 births Category:Living people Category:American composers Category:American country guitarists Category:American country singers Category:American pop singers Category:American rock guitarists Category:American rock singers Category:American singer-songwriters Category:American Grammy Award winners Category:Musicians from Washington",
 "title": "Kenny Loggins"
}