{
 "id": "693472",
 "text": "Robert Brown FRS FRSE FLS (21 December 1773 – 10 June 1858) was a Scottish botanist. Brown made important contributions to botany by using the microscope. He made an early description of the cell nucleus and cytoplasmic streaming. He saw Brownian motion in pollen grains.Harris, Henry 1999. The Birth of the Cell. Yale University Press. pp. 76–81. ISBN 9780300073843 He did early work on plant pollination and fertilisation.Mabberley, David 1985. Jupiter botanicus: Robert Brown of the British Museum. British Museum (Natural History). pp. 15–18. ISBN 978-3-7682-1408-7 Brown was the first to list the difference between gymnosperms and angiosperms. He did some of the earliest studies in palynology. He worked on plant taxonomy. He identified plant families which are still accepted today. Brown explored Australia with Matthew Flinders.Flinders, Matthew (1966) [1814]. A Voyage to Terra Australis : undertaken for the purpose of completing the discovery of that vast country, and prosecuted in the years 1801, 1802, and 1803 in His Majesty's ship the Investigator, and subsequently in the armed vessel Porpoise and Cumberland Schooner; with an account of the shipwreck of the Porpoise, arrival of the Cumberland at Mauritius, and imprisonment of the commander during six years and a half in that island (Facsimile ed.). Adelaide: Libraries Board of South Australia. p. 215 & 242\\. Retrieved 5 January 2014. Facsimile reprint of: London : G. and W. Nicol, 1814 ed. In two volumes, with an Atlas (3 volumes) Based on what he saw and collected, he named many Australian plant genera and species. In Western Australia alone he is the author of nearly 1200 species. After the division of the Natural History Department of the British Museum into three sections in 1837, Robert Brown became the first Keeper of the Botanical Department. He kept this appointment until his death until his death in 1858. == References == Category:1773 births Category:1858 deaths Category:Scottish biologists Category:Fellows of the Royal Society Category:British botanists",
 "title": "Robert Brown"
}