{
 "id": "69340",
 "text": "Crochet is a way of creating fabric from yarn or thread using a crochet hook to pull loops of yarn through other loops. It is similar to knitting, except that usually only one loop is active at one time, and that a crochet hook is used instead of knitting needles. Also, crochet can not be made by machine. Crochet uses more yarn than knitting but is faster to make by hand. Crochet is used to make clothing, household items like tablecloths, blankets and potholders, and toys. Lace is often made by crocheting, though it can be made by knitting and weaving as well. Crocheting is also a great craft for younger children. The stitches are easy and their small hands are able to hold the crochet hook. They are also able to see progress very quickly and that motivates them to continue. It is very easy to start again after setting the project down, which will help to keep young people involved in the craft. ==Stitch Abbreviations== ===Basic=== *ch: chain stitch *yoh: yarn over hook *bl: back loops *fl: front loops *rs: right side *ws: wrong side *sc: single crochet *dc: double crochet *tc: triple crochet *sk or sk st: skip stitch *sl st: slip stitch *rnd: round(s) **: repeat instructions following the \"*\" ===Advanced=== *bp: back post *fp: front post *bpdc: back post double crochet *fpdc: front post double crochet *tog: together *dc2tog: double crochet 2 stitches together *hdc: half double crochet *dec: decrease == US and UK Terminologies == The US and the UK use different names for the same crochet stitches. If you are using a pattern, make sure you know if it uses US or UK terminology so you read it correctly. Here are the main differences. Crochet Stitches US Name UK Name Single crochet (sc) Double crochet (dc) Double crochet (dc) Treble crochet (tr) Treble crochet (tr) Double treble crochet (dtr) ==Other websites== *Learn to crochet: 5 basic crochet stitches *Learn to crochet: Stitch Variations *UK to US crochet conversion chart Category:Needlework",
 "title": "Crochet"
}