{
 "id": "69358",
 "text": "Hugo Wallace Weaving (born 4 April 1960) is a British-Australian actor. He is also well known as a voice actor. Weaving is most famous for his roles as Agent Smith in The Matrix and Elrond in The Lord of the Rings movie trilogy, the main character of V for Vendetta and the voices of Noah the Elder in Happy Feet, Megatron in Transformers and Rex in Babe and Babe: Pig in the City. He was born in Nigeria to English parents. He spent his childhood in South Africa and then moved to the United Kingdom when he was a teenager. He moved to Australia in 1976. ==Filmography== Year Title Role Notes 1981 Student 2 1983 The City's Edge Andy White 1986 For Love Alone Jonathan Crow 1987 Ned Devine 1990 Jake 1991 Proof Martin AACTA Award for Best Actor in a Leading Role 1992 Road to Alice Louis 1993 Frauds Jonathan Wheats Reckless Kelly Sir John Det. Church 1994 Exile Innes Anthony \"Tick\" Belrose / Mitzi Del Bra Nominated — AACTA Award for Best Actor in a Leading Role What's Going On, Frank? Strange Packer in Supermarket 1995 Babe Rex the Male Sheepdog (voice) 1996 The Hunchback of Notre Dame Frollo's Soldiers (voice) 1997 True Love and Chaos Morris 1998 Babe: Pig in the City Rex the Male Sheepdog (voice) Bedrooms and Hallways Jeremy Eddie Rodney Fleming AACTA Award for Best Actor in a Leading Role Montreal World Film Festival Award for Best Actor Nominated — FCCA Award for Best Supporting Actor Barry 1999 Strange Planet Steven Little Echo Lost Echo Man Agent Smith Nominated — Blockbuster Entertainment Award for Favorite Villain Nominated — Saturn Award for Best Supporting Actor 2000 The Magic Pudding Bill Barnacle (voice) 2001 Russian Doll Harvey The Old Man Who Read Love Stories Rubicondo (Dentist) Nominated — AACTA Award for Best Actor in a Supporting Role Nominated — FCCA Award for Best Supporting Actor Elrond Nominated — Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2002 2003 Broadcast Film Critics Association Award for Best Cast National Board of Review Award for Best Cast Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture 2003 Agent Smith Nominated — MTV Movie Award for Best Fight (shared with Keanu Reeves) 2003 2004 Everything Goes Ray Inside Film Awards: Best Short Film Peaches Alan 2005 Little Fish Lionel Dawson AACTA Award for Best Actor in a Leading Role FCCA Award for Best Actor in a Supporting Role Inside Film Award for Best Actor V for Vendetta V Nominated — International Award for Best Actor 2006 Happy Feet Noah (voice) 2007 Transformers Megatron (voice) Nominated — Teen Choice Award for Choice Movie Villain In the Company of Actors Himself / Judge Brack 2008 McHeath 2009 Transformers: Revenge of the Fallen Megatron (voice) Last Ride Kev Nominated — AACTA Award for Best Actor in a Leading Role 2010 Detective Francis Abberline Oranges and Sunshine Jack AACTA Award for Best Actor in a Supporting Role Nominated — Satellite Award for Best Supporting Actor in a Motion Picture Legend of the Guardians: The Owls of Ga'Hoole Noctus and Grimble (voice) 2011 Transformers: Dark of the Moon Megatron (voice) Captain America: The First Avenger Johann Schmidt / Red Skull Nominated — Teen Choice Award for Choice Movie Fight (with Chris Evans) Nominated — Scream Award for Best Villain Happy Feet Two Noah (voice) 2012 Cloud Atlas Haskell Moore Tadeusz Kesselring Bill Smoke Nurse Noakes Boardman Mephi Old Georgie Elrond 2013 Mystery Road Johnno The Turning Bob Lang Nominated — AACTA Award for Best Actor in a Leading Role 2014 Healing Matt Perry The Mule Croft Nominated — AFCA Award for Best Supporting Actor The Hobbit: The Battle of the Five Armies Elrond 2015 Strangerland David Rae The Dressmaker Sergeant Farrat AACTA Award for Best Actor in a Supporting Role AFCA Award for Best Supporting Actor Nominated — Film Critics Circle of Australia for Best Supporting Actor 2016 Hacksaw Ridge Tom Doss AACTA Award for Best Actor in a Supporting Role 2017 Jasper Jones Mad Jack Lionel Nominated — AACTA Award for Best Actor in a Supporting Role 2018 Black '47 Hannah Mortal Engines Thaddeus Valentine 2019 Hearts and Bones Daniel Fisher == Other websites == * * Hugo Weaving at the National Film and Sound Archive Category:1960 births Category:Living people Category:Australian movie actors Category:Australian stage actors Category:Australian voice actors",
 "title": "Hugo Weaving"
}