{
 "id": "69369",
 "text": "The Tour of Britain is the name of a cycle race held in United Kingdom. The race is made up of several parts in which the racers go from place to place across parts of Great Britain. The history of the event dates back to 1951. The Tour of Britain is part of the UCI's European Tour. The race includes teams from Scotland and Wales, as well as a Great Britain team. In recent years, no English team has been entered. Teams from outside the UK compete too, for example in 2007 Team T-Mobile will take part. The latest version, a professional stage race, was first run in 2004. ==History== The Tour of Britain has had different names. This is because many different companies or groups of people have provided the money needed to have the event happen (sponsors). *the Daily Express Tour of Britain (1951-1955) ::Scot Ian Steel won the 1951 edition, in which Jimmy Savile (later to become a famous DJ and television personality and child molester) also raced. The 1955 edition was organised by the British League of Racing Cyclists. *the Milk Race (1958-1993) ::This was a two-week amateur event but from about 1983, the event was also opened to professional teams. The Milk Marketing Board also sponsored the Scottish Milk Race, a smaller tour in Scotland. *the Kellogg's Tour (1987-1994) ::Winners included: Malcolm Elliot (1988), Robert Millar (1989), Phil Anderson (1991, 1993), Max Sciandri (1992) and, in its final year, Maurizio Fondriest. *the Prudential plc-sponsored PruTour (1998-1999) ::Stuart O'Grady (Crédit Agricole) won the 1998 edition; Marc Wauters (Rabobank) won in 1999. ==The modern tour== ===2004 Tour of Britain=== The first edition of the latest version of the Tour of Britain took place over five days in early September 2004. It was organised by SweetSpot along with British Cycling. The race was sponsored by the organisers of London's 2012 Olympics bid. It was well-promoted and many well-known teams were a part of the race. Such teams included T-Mobile (Germany) and U.S. Postal Service (USA). This was partly due to it being a 2.3 category race on the Union Cycliste Internationale (UCI) calendar. The 2004 route ended with a 45 mile (72 km) criterium in London, where tens of thousands of people watching saw a long break by Londoner Bradley Wiggins last until the final lap. Enrico Degano of Team Barloworld passed him on the final lap to win that stage of the race. The Colombian Mauricio Ardila, of Chocolade Jacques, won the Tour overall. ====Stages==== Stage Date Start Finish Distance Winner Winner Team Time 1 1 September 2004 Manchester Manchester 207 km Stefano Zanini QSD 5h 01'23\" 2 2 September 2004 Leeds Sheffield 172 km Mauricio Ardila CHO 4h 26'26\" 3 3 September 2004 Bakewell Nottingham 192 km Tom Boonen QSD 4h 30'55\" 4 4 September 2004 Newport Newport 160 km Mauricio Ardila CHO 3h 32'37\" 5 5 September 2004 London London 72 km Enrico Degano TBL 1h 27'30\" ====Final General Classification==== Name Nationality Team Time 1 Mauricio Ardila CHO 18h 58'36\" 2 Julian Dean C.A + 00'12\" 3 Nick Nuyens QSD + 00'17\" ===2005 Tour of Britain=== The 2005 race was run as a UCI 2.1 category in six stages starting in Glasgow on 30 August and finishing in London on 4 September: ====Stages==== Stage Date Start Finish Distance Winner Winner Team Time 1 30 August 2005 Glasgow Castle Douglas 185 km Nick Nuyens QSI 4h 24'32\" 2 31 August 2005 Carlisle Blackpool 160 km Roger Hammond GBR 3h 58'48\" 3 1 September 2005 Leeds Sheffield 160 km Luca Paolini QSI 4h 27'24\" 4 2 September 2005 Buxton Nottingham 195 km Serguei Ivanov TMO 4h 24'17\" 5 3 September 2005 Birmingham Birmingham (ITT) 4 km Nick Nuyens QSI 4'54.06\" 6 4 September 2005 London London 60 km Luca Paolini QSI 1h 30'54\" ====Final General Classification==== Name Nationality Team Time 1 Nick Nuyens QSI 19h 04'32\" 2 Michael Blaudzun CSC + 00'08\" 3 Javier Cherro Molina ECV + 00'22\" ===2006 Tour of Britain=== The Tour of Britain 2006 took place from the 29 August to 3 September as a UCI category 2.1 event. Martin Pedersen and Andy Schleck of Team CSC won the overall and King of the Mountains classification, respectively. Mark Cavendish (T-Mobile Team) won the points classification and Johan Van Summeren (Davitamon-Lotto) captured the sprints classification. ====Stages==== Stage Date Start Finish Distance Winner Winner Team Time 1 29 August 2006 Glasgow Castle Douglas 162.6 km Martin Pedersen CSC 4h 03'38\" 2 30 August 2006 Blackpool Liverpool 163 km Roger Hammond GBR 3h 54'15\" 3 31 August 2006 Bradford Sheffield 180 km Filippo Pozzato QSI 4h 28'18\" 4 1 September 2006 Wolverhampton Birmingham 130.3 km Frederik Willems JAC 2h 54'12\" 5 2 September 2006 Rochester Canterbury 152.6 km Francesco Chicchi QSI 4h 24'42\" 6 3 September 2006 Greenwich The Mall 82 km Tom Boonen QSI 2h 00'41\" ====Final General Classification==== Name Nationality Team Time 1 Martin Pedersen CSC 21h 51'24\" 2 Luis Pasamontes UNI + 00'51\" 3 Filippo Pozzato QSI + 02'11\" ===2007 Tour of Britain=== The 2007 edition of the Tour of Britain stage race was run as a UCI 2.1 category in seven stages starting in London on 9 September and finishing in Glasgow on 15 September. The Tour was extended to seven days for 2007, with the extra day being used to run a stage in Somerset for the first time. Instead of finishing in London as in previous years, the 2007 race started in London and finished in Glasgow, which is using the event to boost its bid to host the 2014 Commonwealth Games. ==Other websites== *Tour of Britain official site Category:Cycle races Category:Sport in the United Kingdom",
 "title": "Tour of Britain"
}