{
 "id": "693713",
 "text": "The following is a list of notable deaths in September 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non- humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==September 2016== ===1=== *Ruth Hubbard, 92, Austrian-born American biologist.Ruth Hubbard, 92, first woman tenured in biology at Harvard *Kacey Jones, 66, American singer- songwriter (\"I'm the One Mama Warned You About\"), producer and humorist, cancer. *Jon Polito, 65, American actor (Miller's Crossing, The Rocketeer, Homicide: Life on the Street), multiple myeloma.Jon Polito, Actor in Cohen Brothers Films and 'Homicide: Life on the Street,' Dies at 65 ===2=== *Nalinidhar Bhattacharya, 94, Indian poet and literary critic. *Blackie Gejeian, 90, American race car driver and hot rod builder. *Jerry Heller, 75, American music manager (N.W.A), heart attack.Jerry Heller, Early N.W.A Manager, Dies at 75 *John Hostetter, 69, American actor (Murphy Brown, G.I. Joe: A Real American Hero, Heartbreak Ridge), complications from cancer.John Hostetter Dies: ‘Murphy Brown’ Alum & Veteran Character Actor Was 69 *Islam Karimov, 78, Uzbek politician, President (since 1990), stroke.Islam Karimov: Uzbekistan president's death confirmed *Gerald Lehner, 48, Austrian football referee.Gerald Lehner hat die Sprache der Spieler gesprochen *Margrit Mondavi, 91, Swiss-born American businesswoman, Vice President of Cultural Affairs at Robert Mondavi Winery.Margrit Mondavi Dies at Age 91 *Antonina Seredina, 87, Soviet Russian sprint canoeist, Olympic champion (1960).Ушла из жизни Середина А.А. ===3=== *Mir Quasem Ali, 63, Bangladeshi businessman, politician and war criminal, execution by hanging.Bangladesh executes last prominent Jamaat leader *Maria Isabel Barreno, 77, Portuguese feminist writer. *Carlos Bulgheroni, 71, Argentine businessman, CEO of Bridas.Carlos Bulgheroni, Politics-Savvy Argentine Oilman, Dies at 71 *Claudio Olinto de Carvalho, 74, Brazilian football player and coach (Cagliari).Cagliari mourn title hero Nene *Anna Dewdney, 50, American children's author and illustrator, brain cancer.Obituary: Anna Dewdney *John W. Drummond, 96, American politician, member of the South Carolina Senate (1966–2008).Sen. John Drummond dies at 96 *Albert Hofstede, 75, American politician, Mayor of Minneapolis (1974–1975, 1978–1979), respiratory failure.Albert Hofstede, former mayor of Minneapolis, dies at 75 *Jaakko Kolmonen, 75, Finnish chef.Rakastettu kokki Jaakko Kolmonen on kuollut *Norman Kwong, 86, Canadian football player (Calgary Stampeders, Edmonton Eskimos) and politician, Lieutenant Governor of Alberta (2005–2010).Former Lt.-Gov. Norman Kwong has died *Leslie H. Martinson, 101, American movie and television director (Batman: The Movie, CHiPs, Fantasy Island). *Johnny Rebel, 77, American country singer. *Jean- Christophe Yoccoz, 59, French mathematician, Fields Medalist (1994).Le mathématicien français Jean-Christophe Yoccoz, médaille Fields, est mort ===4=== *Bob Bissonnette, 35, Venezuelan-born Canadian singer, ice hockey player (Hull Olympiques, Acadie–Bathurst Titan) and baseball team owner (Québec Capitales), helicopter crash.Bob Bissonnette, killed in helicopter crash, left his mark on Quebec sports scene *Peter Janich, 74, German philosopher, cancer.Ein Geistesverwandter von Mises, Rothbard und Hoppe *Klaus Katzur, 73, German swimmer, Olympic silver medalist (1972).Olympiamedaillengewinner Klaus Katzur verstorben *Novella Matveyeva, 81, Russian poet and singer-songwriter.Умерла поэтесса Новелла Матвеева *Richard Neville, 74, Australian writer and editor (Oz).Richard Neville obituary *Zoran Šami, 67, Serbian politician, President of the Assembly (2004–2006).Preminuo Zoran Šami *Yang Jingnian, 107, Chinese economist.中国著名经济学家杨敬年去世享年107岁 ===5=== *She'ar Yashuv Cohen, 88, Israeli chief rabbi of Haifa.Rabbi She'ar Yashuv Cohen, 'scholar and warrior,' dies at 88 *Duane Graveline, 85, American astronaut.Duane 'Doc' Graveline, scientist- astronaut who resigned from NASA, dies at 85 *Sir Fred Holliday, 80, British marine biologist.Sir Frederick Holliday, marine biologist and university vice- chancellor – obituary *Hugh O'Brian, 91, American actor (The Life and Legend of Wyatt Earp, The Shootist, Twins).Hugh O'Brian, actor who played Wyatt Earp, dies at 91 *Donald Ranvaud, 62, Italian-born British journalist and movie producer (The Constant Gardener, Central Station, City of God), heart attack.Donald Ranvaud, producer and World Film Festival jurist, dead at 62 *Phyllis Schlafly, 92, American constitutional lawyer, conservative activist and author, pancreatic cancer.Conservative icon Phyllis Schlafly dies at 92 ===6=== *H. Joel Deckard, 74, American politician, member of the United States House of Representatives from Indiana's 8th congressional district (1979–1983). *Nauyane Ariyadhamma Mahathera, 77, Sri Lankan Buddhist monk and author. *Lewis Merenstein, 81, American record producer (Van Morrison), pneumonia. *Lilian Uchtenhagen, 87, Swiss economist and politician.Première femme candidate au Conseil fédéral Lilian Uchtenhagen est morte ===7=== *José Barluenga, 76, Spanish chemist.Professor José Barluenga, in memoriam *Bob Dailey, 63, Canadian ice hockey player (Vancouver Canucks, Philadelphia Flyers), cancer.Former Flyers d-man Bob Dailey passes away at age 63 *Joseph Keller, 93, American mathematician.Stanford Professor Emeritus Joseph Keller, an applied mathematician whose work investigated atomic explosions and oscillating ponytails, dies at 93 *Norbert Schemansky, 92, American weightlifter, Olympic champion (1952).Four-time Olympian, Dearborn native Norbert 'Norb' Schemansky dead at age 92 *Farhang Sharif, 84–85, Iranian musician and tar player.استاد تار ایران درگذشت *Ye Xiushan, 81, Chinese philosopher.哲学家叶秀山逝世 ===8=== *Hannes Arch, 48, Austrian race pilot, world champion (2008), helicopter crash.Red Bull race pilot dies in mystery helicopter crash *Johan Botha, 51, South African operatic tenor, cancer.Johan Botha, Operatic Tenor in Difficult Roles, Dies at 51 *Inga Clendinnen, 82, Australian historian.Vale, Inga Clendinnen *Hazel Douglas, 92, British actress (Harry Potter and the Deathly Hallows – Part 1).Obituary: Hazel Douglas *The Lady Chablis, 59, American actress (Midnight in the Garden of Good and Evil), pneumonia.Savannah legend Lady Chablis dies *Bert Llewellyn, 77, English footballer (Crewe, Port Vale, Wigan).Bert Llewellyn (1939–2016) *Dragiša Pešić, 62, Montenegrin politician, Prime Minister of Yugoslavia (2001–2003).Dragisa Pesic passed away *Prince Buster, 78, Jamaican ska musician (\"One Step Beyond\", \"Al Capone\").Prince Buster dead: Ska and rocksteady pioneer dies at 78 *Roman Romanchuk, 37, Ukrainian-born Russian boxer and kickboxer, heart attack.Roman Romanchuk passed away *Greta Zimmer Friedman, 92, American dental assistant, subject in V-J Day in Times Square photo.Greta Friedman, believed to be woman kissed in iconic V-J Day photo, dead at 92 ===9=== *Sylvia Gore, 71, English football player (national team) and manager (Wales national team), cancer.Sylvia Gore: England women's first goalscorer dies aged 71 *Luke Herrmann, 84, German-born British art historian.Luke Herrmann *Lord Littlebrook, 87, British midget wrestler, trainer and booking manager.Lord Littlebrook dies at 87 *Bill Nojay, 59, American politician, member of the New York State Assembly (since 2013), suicide by gunshot.NY Assemblyman Bill Nojay dies of apparent suicide *Mario Spezi, 71, Italian journalist and author (The Monster of Florence: A True Story).Addio al giornalista Mario Spezi, si occupò del Mostro di Firenze *James Stacy, 79, American actor (Lancer, The Adventures of Ozzie and Harriet, Something Wicked This Way Comes), anaphylaxis.Maurice William (aka: James Stacy) Elias ===10=== *Jutta Limbach, 82, German jurist and politician, President of the Federal Constitutional Court (1994–2002).Jutta Limbach, First Woman to Lead Germany's Highest Court, Dies at 82 *Chris Stone, 81, American recording studio owner (Record Plant) and entrepreneur, heart attack and stroke.Christopher Stone, Dead at 81 ===11=== *Alexis Arquette, 47, American actress (The Wedding Singer, Pulp Fiction, Lords of Dogtown), cardiac arrest.Alexis Arquette Dead: Transgender Actress Dies at 47, Siblings Patricia and Richmond Arquette Pay Tribute *Mbaye-Jacques Diop, 80, Senegalese politician, member of the National Assembly (1983–2004), Mayor of Rufisque (1987–2002).Décès de l'ancien maire de Rufisque, Me M'baye Jacques Diop *Norman May, 88, Australian sports broadcaster.Norman May dead, aged 88 *Lyn Wilde, 93, American singer and actress.Lyn Cathcart Oberlink Oct. 10, 1922 – Sept. 11, 2016 ===12=== *Gunnila Bernadotte, 93, Swedish countess.Countess Gunilla Bernadotte af Wisborg Has Died *Ellen Burka, 95, Dutch-born Canadian figure skater and coach, Dutch national champion (1946, 1947).Renowned Canadian figure skating coach Ellen Burka dies at 95 *Sándor Csoóri, 86, Hungarian poet, essayist, writer, and politician. *Ali Javan, 89, Iranian- American physicist, heart attack.Photonics community loses HeNe pioneer Ali Javan *Hidayat Inayat Khan, 99, English-French composer and conductor.Passing of Murshid Hidayat Inayat Khan (as) 12 September, 2016, Munich Germany *Stanley Sheinbaum, 96, American peace and human rights activist.Stanley Sheinbaum, L.A. liberal lion who shaped decades of political dialogue, dead at 96 ===13=== *Ottavio Bugatti, 87, Italian footballer (Napoli, Inter Milan).Il Napoli piange la morte di Bugatti, entrò nella leggenda per una vittoria a Torino ===14=== *Dick Adams, 96, American baseball player (Philadelphia Athletics).Richard Adams Obituary *Don Buchla, 79, American synthesizer designer.Modular synthesizer pioneer Don Buchla has died *Kim McGuire, 60, American actress (Cry-Baby), pneumonia.RIP Kim McGuire \"Hatchet-Face\" *Hilmar Thate, 85, German actor (Veronika Voss).Schauspieler Hilmar Thate gestorben ===15=== *John Gudenus, 75, Austrian politician and convicted Holocaust denier.Ex-FPÖ-Politiker John Gudenus verstorben *Deborah S. Jin, 47, American physicist, cancer. *Rose Mofford, 94, American politician, Governor of Arizona (1988–1991).Rose Mofford, first woman to serve as Arizona governor, has died *Haakon Sørbye, 96, Norwegian engineer and resistance member.Haakon Sørbye ===16=== *Tarık Akan, 66, Turkish actor (Yol), lung cancer.Renowned Turkish actor Tarık Akan dies aged 66 *Edward Albee, 88, American playwright (Who's Afraid of Virginia Woolf?, A Delicate Balance, The Goat, or Who Is Sylvia?), Tony (1963, 2002) and Pulitzer Prize winner (1967, 1975, 1994).Pulitzer Prize- winning playwright Edward Albee dies at age 88 *Carlo Azeglio Ciampi, 95, Italian banker and politician, President (1999–2006) and Prime Minister (1993–1994), multiple organ failure complicated by pneumonia.Former Italian president, prime minister Ciampi dies *Charles H. Henry, 79, American physicist.Charles H. Henry *W. P. Kinsella, 81, Canadian writer (Shoeless Joe), euthanasia.Shoeless Joe author W.P. Kinsella has died *Gérard Louis- Dreyfus, 84, French-born American businessman (Louis Dreyfus Company).William Louis-Dreyfus, actress' dad, dies at age 84 *António Mascarenhas Monteiro, 72, Cape Verdean politician, President (1991–2001).Presidential campaign suspended in Cape Verde *Qiao Renliang, 28, Chinese singer and actor, suicide. *Joe Seng, 69, American politician, member of the Iowa House of Representatives (2001–2003) and Senate (since 2003), brain cancer.State Sen. Joe Seng dies after battling cancer ===17=== *Theodore Wilbur Anderson, 98, American mathematician and statistician, heart failure. *Charmian Carr, 73, American actress and singer (The Sound of Music), complications from dementia.'Sound of Music' star Charmian Carr dies aged 73 *Bahman Golbarnezhad, 48, Iranian Paralympic racing cyclist (2012, 2016), race collision.Iranian cyclist Bahman Golbarnezhad dies after crash in road race *C. Martin Croker, 54, American voice actor and animator (Space Ghost Coast to Coast, Aqua Teen Hunger Force, The Brak Show), sepsis. *Roman Ivanychuk, 87, Ukrainian writer.Скончался украинский писатель Роман Иваничук *Rune Larsson, 92, Swedish athlete, Olympic bronze medalist (1948).Minnessida för Rune Larsson ===18=== *Robert W. Cone, 59, American Army general, Commander of the Army Training and Doctrine Command (2011–2014), prostate cancer.NH native Gen. Robert W. Cone dies at 59 *David Kyle, 97, American science fiction writer. *Rose Pak, 68, Chinese-born American political activist. *András Prékopa, 87, Hungarian mathematician.Elhunyt Prékopa András matematikus, az MTA rendes tagja *Hassan Sharif, 65, Emirati artist, cancer.UAE's artistic giant Hassan Sharif dies age 65 ===19=== *Karl Dietrich Bracher, 94, German political scientist and historian.Karl Dietrich Bracher, German Historian of Nazi Era, Dies at 94 *Bobby Breen, 88, Canadian-born American actor (Let's Sing Again, Rainbow on the River, Fisherman's Wharf) and singer.Bobby Breen *Gerwald Claus-Brunner, 44, German politician, member of the Berlin House of Representatives (since 2011), suicide.Berlin Pirate politician Gerwald Claus-Brunner dies *Bill Glassford, 102, American football player and coach.Former NU coach Glassford dies at 102 *Allister Sparks, 83, South African writer, journalist (The Rand Daily Mail) and political commentator. *Boris Trakhtenbrot, 95, Russian- Israeli mathematician.In Memoriam: Boris Trakhtenbrot, 1921–2016 *Bill Zucker, 60, American actor and comedian, heart attack.Entertainer Bill Zucker, native of Longmeadow, dead at 60 ===20=== *Bill Barrett, 87, American politician, member of the United States House of Representatives from Nebraska's 3rd congressional district (1991–2001).Ex-Nebraska Rep. Bill Barrett, who pushed farm issues, dies *Richie Dunn, 59, American ice hockey player (Buffalo Sabres, Calgary Flames, Hartford Whalers).Former Buffalo Sabres defenseman Richie Dunn dead at age 59 *Jack Garman, 72, American computer engineer and NASA official, key figure in the Apollo 11 mission, bone cancer.Jack Garman, NASA engineer who 'saved' Apollo 11 from alarms, dies at 72 *Peter Leo Gerety, 104, American Roman Catholic prelate, Bishop of Portland (1969–1974) and Archbishop of Newark (1974–1986), world's oldest living Catholic bishop.Former Archbishop Peter Leo Gerety, world's oldest Catholic bishop, dead at 104 *Erwin Hahn, 95, American physicist. *Curtis Hanson, 71, American movie director and screenwriter (L.A. Confidential, 8 Mile, Wonder Boys), Oscar winner (1998).Curtis Hanson, Director and Oscar-Winning Writer on 'L.A. Confidential,' Dies at 71 *Micki Marlo, 88, American singer and model.Micki Marlo, Popular 1950s Singer and Nightclub Performer, Dies at 88 *Foil A. Miller, 100, American chemist and philatelist.In Memoriam: Foil A. Miller *Edmund F. O'Connor, 94, American Air Force officer.Edmund F. O'Connor Obituary *Victor Scheinman, 73, American inventor.Victor Scheinman, Assembly Line Robot Inventor, Dies at 73 ===21=== *Shawty Lo, 40, American hip-hop musician (D4L), car crash. *John D. Loudermilk, 82, American singer-songwriter (\"Tobacco Road\", \"Then You Can Tell Me Goodbye\", \"Indian Reservation\"), bone cancer.Nashville Songwriters Hall Of Fame Member John D. Loudermilk Dies At 82 ===22=== *Kjell Albin Abrahamson, 71, Swedish journalist (Sveriges Radio), stroke.Kjell Albin Abrahamson död *Joseph Harmatz, 91, Lithuanian World War II Jewish partisan fighter and anti-Nazi avenger.Jewish WWII ‘Avenger’ Joseph Harmatz dead at 91 *Gian Luigi Rondi, 94, Italian screenwriter (Obsession) and movie director, President of the Academy of Italian Arts - David di Donatello (since 1981).Morto il critico cinematografico Gian Luigi Rondi, ex direttore della Mostra del Cinema di Venezia: aveva 94 anni *Ed Temple, 89, American track and field coach (Tennessee State Lady Tigers, women's Olympic team).Ed Temple, Track Coach Who Produced Olympians and National Titles, Dies at 89 ===23=== *Yngve Brodd, 86, Swedish footballer (Toulouse, Sochaux-Montbéliard, IFK Göteborg).Fotbollslegendaren Yngve Brodd är död *Max Mannheimer, 96, Czech-born German painter, author and Holocaust survivor.Holocaust survivor Max Mannheimer dies in Germany at age 96 *Michel Rousseau, 80, French cyclist, Olympic champion (1956).Décès de Michel Rousseau, ancien champion olympique sur piste *Andrzej Tarkowski, 83, Polish embryologist.Andrzej Tarkowski, brilliant Polish embryologist – obituary ===24=== *Vladimir Kuzmichyov, 37, Russian footballer (Spartak Moscow, CSKA Moscow), car crash.Прошлый футболист ЦСКА Владимир Кузьмичев умер в автокатастрофе Белрынок *Bill Mollison, 88, Australian researcher, author, teacher and biologist. *Bill Nunn, 63, American actor (Do the Right Thing, Spider-Man, Sister Act), leukemia.Bill Nunn, Who Played Radio Raheem in ‘Do the Right Thing,’ Dies at 63 *Buckwheat Zydeco, 68, American accordionist and bandleader, lung cancer.Dural, leader of Buckwheat Zydeco, dies ===25=== *José Fernández, 24, Cuban-born American baseball player (Miami Marlins), boat crash.Jose Fernandez dies in boating accident *Dawn Hampton, 88, American cabaret and jazz singer- songwriter (Malcolm X), saxophonist and dancer.Dawn Hampton obituary *David Padilla, 89, Bolivian politician, President (1978–1979).Falleció el expresidente David Padilla Arancibia *Arnold Palmer, 87, American Hall of Fame professional golfer.Arnold Palmer, Golf Legend and Hall of Famer, Dies at 87 *Jean Shepard, 82, American honky tonk singer-songwriter (\"A Dear John Letter\", \"Slippin' Away\"), Parkinson's disease.Country Music Hall of Famer Jean Shepard dead at 82 ===26=== *Don Brothwell, 83, British archaeologist.Don Brothwell remembered *Mark Dvoretsky, 68, Russian chess player and trainer.Mark Dvoretsky passes away at 68 *Giacomo Fornoni, 76, Italian racing cyclist, Olympic gold medalist (1960).Ciclismo: addio al bergamasco Giacomo Fornoni, medaglia d’oro olimpica *Herschell Gordon Lewis, 87, American movie director (Blood Feast, Two Thousand Maniacs!).Herschell Gordon Lewis, filmmaker and ‘godfather of gore,' dies at 87 *Wilhelm Mohr, 99, Norwegian aviation officer. Krigshelt Wilhelm Mohr er død *Ioan Gyuri Pascu, 55, Romanian singer, producer, actor and comedian, heart attack. *Curtis Roosevelt, 86, American writer, heart attack.Curtis Roosevelt, grandson of a president, dies at 86 *Karel Růžička, 76, Czech jazz pianist, Anděl Award winner (1993).Zemřel jazzový klavírista Růžička. Hrál v Semaforu i s Lacem Deczim *Jackie Sewell, 89, English footballer (Notts County, Sheffield Wednesday, Aston Villa). *Toughie, Panamanian frog, last surviving of the Rabbs fringe-limbed treefrog.Toughie the frog, likely the last of his species, dies ===27=== *Jamshid Amouzegar, 93, Iranian politician, Prime Minister (1977–1978) and Minister of Finance (1965–1974).جمشید آموزگار درگذشت+تصاویر *Syed Shamsul Haque, 81, Bangladeshi poet and writer.Syed Shamsul Haq passes away *Luis Ossio, 86, Bolivian politician, Vice President (1989–1993).Muere exvicepresidente Luis Ossio Sanjinés *Charles Schultze, 91, American economist and public policy analyst, Chair of the Council of Economic Advisers (1977–1981), complications from sepsis.Charles L. Schultze, economist in two administrations, dies at 91 ===28=== *Joseph V. Charyk, 96, Canadian-born American engineer, Under Secretary of the Air Force (1960–1963).Vincent Charyk *Malcolm Lucas, 89, American judge, Chief Justice of the California Supreme Court (1987–1996), U.S. District Court Judge for the Central District of California (1971–1984).Former California Chief Justice Malcolm Lucas dies at 89 *Sreten Mirković, 58, Serbian boxer.Preminui Sreten Mirković: Legenda zauvek napustila ring *Gloria Naylor, 66, American novelist (The Women of Brewster Place).Rest in Power: Gloria Naylor, Author of 'The Women of Brewster Place,' Has Died *Agnes Nixon, 93, American television writer and producer (One Life to Live, All My Children, Guiding Light).Agnes Nixon, creator of Main Line-set 'All My Children,' 'One Life to Live,' dies at 88 *Shimon Peres, 93, Polish-born Israeli statesman, President (2007–2014) and Prime Minister (1977, 1984–1986, 1995–1996), Nobel Peace Prize winner (1994), stroke. *Max Walker, 68, Australian Test cricketer and football player, myeloma.Max Walker died of a blood cancer called myeloma, not melanoma ===29=== *Cheng Yu-tung, 91, Hong Kong businessman (Chow Tai Fook).Cheng Yu-Tung, Hong Kong Jeweler Turned Billionaire, Dies *Miriam Defensor Santiago, 71, Filipino politician, Senator (1995–2001, 2004–2016) and International Criminal Court Judge (2012–2014), lung cancer.Miriam Defensor-Santiago passes away at 71 *Shirley Jaffe, 93, American painter and sculptor. *Joni Madraiwiwi, 59, Fijian lawyer and politician, Vice President of Fiji (2004–2006) and Chief Justice of the Supreme Court of Nauru (since 2014).Fiji's Ratu Joni Madraiwiwi dies *Joseph Verner Reed Jr., 78, American banker and politician, Ambassador to Morocco (1981–1985) and Chief of Protocol (1989–1991).Joseph Verner Reed Jr., 78, Dies; Envoy Became White House Chief of Protocol *Mark Ricks, 92, American politician, Lieutenant Governor of Idaho (2006–2007) and State Senator (1979–1994). *Laura Troschel, 71, Italian actress (Four Flies on Grey Velvet), singer, and model.Addio a Laura Troschel, attrice e cantante degli anni ’70 e moglie di Pippo Franco *Brahim Zniber, 96, Moroccan businessman and vintner.Moroccan Multi-millionaire Brahim Zniber Dies at 96 ===30=== *Bjarni Jónsson, 96, Icelandic mathematician.Noted algebraist Bjarni Jónsson dies ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * Deaths in 2014 * Deaths in 2015 ==References== ==Other websites== * The Guardian, UK obituaries * Obituaries, Los Angeles Times * Obituaries, Chicago Tribune * The New York Times, US obituaries * The Sydney Morning Herald, Australian obituaries * The Telegraph obituaries *09 Category:September 2016 events",
 "title": "Deaths in September 2016"
}