{
 "id": "693775",
 "text": "Hello, Dolly! is a 1969 American musical and romantic comedy movie. It is based on the Broadway production of the same name. Louis Armstrong recorded the title tune of the same name. That tune hit #1 in May 1964. ==Plot== In 1890, all of New York City is excited because widowed and brassy Dolly Levi is in town. She is currently seeking a wife for grumpy \"half a millionaire\" Horace Vandergelder. It becomes clear, however, that Dolly wants to marry Horace herself. She travels to Yonkers, New York to visit Horace. Horace tells his two clerks, Barnaby Tucker and Cornelius Hackl, that he is about to get married because \"It Takes a Woman\" to do all the household chores. Dolly comes to Yonkers and sends Horace to the city. Cornelius decides he and Barnaby need to leave Yonkers. Dolly knows two ladies in New York City they can call on: Irene Molloy, and her shop assistant, Minnie Fay. After meeting an old friend, Gussie Granger, on a float in a parade, Dolly catches up with the annoyed Horace. He is marching in the parade. She tells him the heiress Ernestina Semple would be perfect for him. She asks him to meet her at the Harmonia Gardens that evening. Cornelius wants to get a kiss before the night is over. The clerks have no money to hire a carriage. They then tell the girls that walking to the restaurant shows that they have \"Elegance\". At the Harmonia Gardens Restaurant, the head waiter, Rudolph, gets his crew into shape for Dolly Levi's return. Horace arrives to meet his date. But she is really Dolly's friend Gussie. Gussie isn't elegant or rich as Dolly had said. She soon leaves after being bored by Horace. Cornelius, Barnaby and their dates arrive at the restaurant. They're not aware Horace is also at the restaurant. Cornelius is scared of being caught. He tells the ladies he and Barnaby didn't have any money all along. Irene knew the two men pretended being rich. Horace tells Dolly life would be dull without her. Dolly promises she will never go away again. ==Cast== * Barbra Streisand as Dolly Levi * Walter Matthau as Horace Vandergelder * Michael Crawford as Cornelius Hackl * Marianne McAndrew as Irene Molloy * E. J. Peaker as Minnie Fay * Danny Lockin as Barnaby Tucker * Joyce Ames as Ermengarde Vandergelder * Tommy Tune as Ambrose Kemper * Judy Knaiz as Gussie Granger; Ernestina Semple * David Hurst as Rudolph Reisenweber * Fritz Feld as Fritz, German waiter * Richard Collier as Joe, Vandergelder's barber * J. Pat O'Malley as Policeman in park * Louis Armstrong as Orchestra leader * Tucker Smith (uncredited) as Dancer * Jennifer Gan (uncredited) as Miss Bolivia ==Release== ===U.S. showings=== The movie began showing in New York City at the Rivoli Theater on December 16, 1969. It later began showing at the Grauman's Chinese Theater near Los Angeles on December 19. The movie got favorable reviews upon release. ===Box office=== The movie opened strongly. It took in more than The Sound of Music four years earlier. It made $33.2 million at the box office. ==Awards== The movie won three Academy Award. It was nominated for another four. ;Won * Best Art Direction - Set DecorationJohn DeCuir, Jack Martin Smith, and Herman A. Blumenthal (Art Direction); Walter M. Scott, George James Hopkins, and Raphaël Bretton (Set Decoration) * Best Music, Score of a Musical PictureLennie Hayton and Lionel Newman * Best SoundJack Solomon and Murray Spivack ;Nominated * Best PictureErnest Lehman * Best CinematographyHarry Stradling (posthumous nomination) * Best Costume DesignIrene Sharaff * Best Film EditingWilliam H. Reynolds ;Other awards * 23rd British Academy Film Awards ** BAFTA Award for Best Actress in a Leading RoleBarbra StreisandNomination ** BAFTA Award for Best Actor in a Leading RoleWalter MatthauNomination (also for his role in The Secret Life of an American Wife) ** BAFTA Award for Best Art DirectionJohn DeCuirNomination ** BAFTA Award for Best CinematographyHarry StradlingNomination * 27th Golden Globe Awards ** Golden Globe Award for Best Motion Picture - Musical or Comedy Nomination ** Golden Globe Award for Best DirectorGene Kelly Nomination ** Golden Globe Award for Best Actress – Motion Picture Musical or ComedyBarbra Streisand Nomination ** Golden Globe Award for Best Supporting Actress – Motion PictureMarianne McAndrew Nomination ** Golden Globe Award for New Star of the Year – ActressMarianne McAndrew Nomination * Directors Guild of America Awards 1970 ** Outstanding Directorial Achievement in Feature FilmGene Kelly Nomination * American Cinema Editors ** Best Edited Feature FilmWilliam H. ReynoldsWon ==References== Category:Movies based on plays Category:American romantic comedy movies Category:American musical comedy movies Category:Academy Award winning movies Category:1969 musical movies Category:1969 romantic comedy movies Category:Movies set in the 1890s",
 "title": "Hello, Dolly! (movie)"
}