{
 "id": "69398",
 "text": "The Battle of Leyte Gulf, was the biggest naval battle in modern history. The battle was part of World War II, and happened in the seas near the Philippines island of Leyte. It took place from 23 October to 26 October 1944, between the Allies and the Empire of Japan. The Allies started the battle to cut the way between Japan and its colonies in South East Asia. Japan took its oil for fuel from that area. The Japanese gathered all the ships they had left to fight the Allied troops. However, they failed and lost many ships and aircraft. The battle was the last big naval fight of World War II. Without fuel, the Imperial Japanese Navy never again sailed to battle. Most of their ships returned to Japan, and were inactive for the rest of the war. The first use of kamikaze aircraft was during this battle. A kamikaze hit the Australian flagship HMAS Australia on 21 October. Many other suicide attacks by the \"Special Attack Force\" began on 25 October, and did great damage to the Allied ships. ==References== == Other websites == * WW2DB: Leyte Campaign * Animated History of The Battle of Leyte Gulf * Battle Experience: Battle for Leyte Gulf * Task Force 77 Action Report: Battle of Leyte Gulf * \"Turkey Trots to Water\" — detailed description of the battle from battleship.org * Orders of battle: Sibuyan Sea, Surigao Strait, Cape Engaño, Samar. * \"Glorious Death: The Battle of Leyte Gulf\" by Tim Lanzendörfer * battle-of-leyte-gulf.com * The Battle Off Samar - Taffy III at Leyte Gulf by Robert Jon Cox * Leyte Gulf Naval Chess Game, a free, educational boardgame of the battle, to print off, assemble, and play * Return to the Philippines: public domain documents from ibiblio.org * The Battle for Leyte Gulf Revisited by Irwin J. Kappes * Timeline for USS Samuel B. Roberts (DE 413) * Japan's TA-Operation: A Blueprint for Disaster by Irwin J. Kappes Leyte Gulf Category:1944 in Asia Category:1940s in the Philippines Category:October 1944 events",
 "title": "Battle of Leyte Gulf"
}