{
 "id": "694092",
 "text": "The following is a list of notable deaths in November 2016. For notable deaths before the current month, please see \"Months\". Names under each date are reported in alphabetical order by last name or pseudonym. Deaths of non-humans are reported here also if notable. * Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, nationality, what the person is known for, cause of death (if known) and most importantly a source. __TOC__ ==November 2016== ===1=== * Tina Anselmi, 89, Italian politician, Minister of Health (1978–1979).È morta Tina Anselmi, prima donna ministro della Repubblica italiana * Rosanne Bailey, 66, American Air Force general and academic administrator.Memorial for ‘Ro’ Bailey to be held Monday * Bap Kennedy, 54, Northern Irish singer- songwriter, pancreatic and bowel cancer.West Belfast singer Bap Kennedy dies at 54 * John Orsino, 78, American baseball player (Baltimore Orioles). ===2=== * Bob Cranshaw, 83, American jazz bassist (Blue Note Records, Musicians Union), cancer.Jazz Bassist Bob Cranshaw Dies at 83 * A. Thomas Kraabel, 81, American classics scholar. * Martin Lippens, 82, Belgian footballer (Anderlecht, national team) and coach.Décès de Martin Lippens, ancien joueur d'Anderlecht et 33 fois international * Oleg Popov, 86, Russian clown (Moscow State Circus), heart attack.Famous Soviet-era clown Oleg Popov dies at 86 * Jean-Marie Trappeniers, 74, Belgian footballer (Anderlecht, national team).Opnieuw Anderlecht-icoon overleden: Jean Trappeniers sterft op 74-jarige leeftijd * Egon Wolff, 90, Chilean playwright.Muere a los 90 años el dramaturgo chileno Egon Wolff ===3=== * Misha Brusilovsky, 85, Russian artist. * Clive Derby-Lewis, 80, South African politician, MP (1987–1989), convicted of conspiracy to murder Chris Hani, lung cancer.Clive Derby-Lewis dies * Yawar Hayat Khan, 73, Pakistani television producer, lung disease.TV producer Yawar Hayat dies * Börje Lampenius, 94, Finnish actor (Adventure in Morocco) and director.Skådespelaren Börje Lampenius är död * Kay Starr, 94, American singer (\"Wheel of Fortune\", \"The Rock and Roll Waltz\"), complications from Alzheimer's disease.Kay Starr, ferociously expressive singer who had pop hit with \"Wheel of Fortune,\" dies at 94 ===4=== * Eddie Carnett, 100, American baseball player (Boston Braves, Chicago White Sox, Cleveland Indians). * Jean- Jacques Perrey, 87, French electronic music producer (\"The In Sound from Way Out!\", \"Kaleidoscopic Vibrations: Electronic Pop Music from Way Out\"), lung cancer.Co-composer of Disney's Electrical Parade music dies * Mansour Pourheidari, 70, Iranian football player (national team) and manager (Esteghlal), cancer.منصور پورحیدری درگذشت * Gunnar Sandgren, 87, Swedish novelist.Gunnar E. Sandgren ===5=== * John Carson, 89, English actor (Doomsday, Captain Kronos – Vampire Hunter, Doctor Who). * Ralph Cicerone, 73, American scientist, President of National Academy of Sciences (2005–2016). * Mel Lawrence, 81, American movie director (Qatsi trilogy) and festival promoter.Mel Lawrence * Laurent Pardo, 55, French bassist (Elliott Murphy).Le Havre. Laurent Pardo, le bassiste des Normandy All Stars, est mort * Marek Svatoš, 34, Slovakian ice hockey player (Colorado Avalanche, Hershey Bears), mixed drug intoxication.Former NHLer Marek Svatos dies at 34 ===6=== * Edward Itta, 71, American Iñupiat politician, Mayor of North Slope Borough, Alaska (2005–2011) and member of U.S. Arctic Research Commission (2012–2015), cancer.Edward Itta dies: Inupiaq whaling captain and former North Slope mayor * Biser Kirov, 74, Bulgarian pop singer.Почина големият певец Бисер Киров * Zoltán Kocsis, 64, Hungarian pianist, conductor and composer.Hungarian pianist and conductor Zoltan Kocsis dies at age 64 * Georgie Sicking, 95, American rancher and poet. * Marc Sleen, 93, Belgian cartoonist and comics artist (The Adventures of Nero).Striptekenaar Marc Sleen is overleden * Vautour, 7, French-born Irish-trained racehorse, euthanised. ===7=== * Leonard Cohen, 82, Canadian singer-songwriter (\"Hallelujah\", \"Suzanne\", \"First We Take Manhattan\"), poet and novelist (Beautiful Losers), complications from a fall and leukemia.Leonard Cohen, singer-songwriter of love, death and philosophical longing, dies at 82 * Julie Gregg, 79, American actress (The Godfather, The Happy Time, Batman), cancer.Julie Gregg, Sonny's Wife Sandra in the First Two 'Godfather' Films, Dies at 79 * Jayawantiben Mehta, 77, Indian politician, MP (1989–1991, 1996–1998, 1999–2004).Former Union minister Jayawantiben Mehta passes away * Janet Reno, 78, American lawyer and politician, first female U.S. Attorney General (1993–2001), Parkinson's disease. * Samuel Sitta, 73, Tanzanian politician, MP (2005–2015) and Speaker of the National Assembly (2005–2010).Mugufuli mourns Sitta * Sir Jimmy Young, 95, British radio personality (Radio 2) and singer (\"Unchained Melody\", \"The Man from Laramie\"), cancer.Veteran broadcaster Sir Jimmy Young dies aged 95 ===8=== * Peter Brixtofte, 66, Danish politician, Tax Minister (1992–1993).Politikeren Peter Brixtofte er død * Marlan Coughtry, 82, American baseball player (Boston Red Sox).James \"Marlan\" Coughtry * Ho Chih-chin, 64, Taiwanese politician, Minister of Finance (2006–2008).Former finance minister Ho Chih-chin dies * Touran Mirhadi, 89, Iranian educator.«توران میرهادی» درگذشت * Russ Nixon, 81, American baseball player (Boston Red Sox, Cleveland Indians) and manager (Atlanta Braves).Reds: Former manager Nixon passes away at 81 * Umberto Veronesi, 90, Italian oncologist.È morto Umberto Veronesi, ha dato la speranza ai malati di tumore ===9=== * Greg Ballard, 61, American basketball player (Washington Bullets, Golden State Warriors), prostate cancer. ===10=== * Francisco Nieva, 91, Spanish playwright.Fallece el dramaturgo Francisco Nieva a los 91 años * Bill Stanfill, 69, American football player (Miami Dolphins), complications from a fall.Former UGA, Dolphins legend Bill Stanfill dies ===11=== * Ilse Aichinger, 95, Austrian writer.Postwar narrator of Nazi persecution, Ilse Aichinger, dies aged 95 * Victor Bailey, 56, American bassist (Weather Report, Madonna, Lady Gaga), complications from Charcot- Marie-Tooth disease and ALS.Victor Bailey, RIP * Doug Edwards, 70, Canadian musician and composer (\"Wildflower\"), cancer.Canadian rocker Doug Edwards dies at 70 * Aileen Mehle, 98, American gossip columnist (The Miami Daily News, New York Journal-American, Women's Wear Daily).Aileen Mehle, Gossip's Grande Dame Known as ‘Suzy,’ Dies at 98 * Sir James McNeish, 85, New Zealand writer.Wellington writer James McNeish has died * Alfred Schmidt, 81, German footballer (Borussia Dortmund, national team).BVB trauert um Alfred Schmidt * Ray Singleton, 79, American songwriter (Motown) and record producer, brain cancer.In Memory of Raynoma Gordy Singleton * Robert Vaughn, 83, American actor (The Man from U.N.C.L.E., The Magnificent Seven, Bullitt), leukemia.Robert Vaughn Dies: ‘Man From U.N.C.L.E’ Star Was 83 ===12=== * Malek Chebel, 63, Algerian anthropologist and philosopher, cancer.Décès de l’anthropologue Malek Chebel, défenseur d’un «islam des Lumières» * Dawn Coe- Jones, 56, Canadian golfer, bone cancer. * Louis Devereux, 85, English cricketer (Worcestershire, Glamorgan).Former Worcestershire cricketer Louis Devereux dies * Jerry Dumas, 86, American cartoonist (Sam and Silo). * Eivor Olson, 94, Swedish shot putter.Eivor Olsson Lagman * James Dale Ritchie, 40, American serial killer, shot.Serial killer: Police say James Dale Ritchie committed 5 murders in 2016 * Edgard Sorgeloos, 85, Belgian racing cyclist.L'ancien coureur Edgard Sorgeloos est décédé * Lupita Tovar, 106, Mexican-American actress (Drácula, Santa, Miguel Strogoff), heart disease.Lupita Tovar, protagonista de la primera película del cine sonoro mexicano, fallece a los 106 años * Paul Vergès, 91, Thai-born French Réunionese politician, MEP (2004–2010), member of the National Assembly (1956–1958, 1986–1987, 1993–1996) and Senate (1996–2004, since 2011).Paul Vergès est décédé * Jacques Werup, 71, Swedish musician and writer, thyroid cancer.Jacques Werup död ===13=== * Luigi Caccia Dominioni, 102, Italian architect.È morto Luigi Caccia Dominioni, il grande architetto del dopoguerra * Frederick Irving, 91, American politician, Ambassador to Iceland (1972–1976) and Ambassador to Jamaica (1977–1978).FREDERICK IRVING * Laurent Pokou, 69, Ivorian footballer (Rennes).Côte d’Ivoire: l’ancien international de football, Laurent Pokou, est décédé * Leon Russell, 74, American Hall of Fame musician (The Wrecking Crew) and songwriter (\"Tight Rope\"). * Aloysius Ferdinandus Zichem, 83, Surinamese Roman Catholic Redemptorist prelate, Bishop of Paramaribo (1971–2003).Bishop Aloysius Ferdinandus Zichem, C.SS.R. ===14=== * Diana Balmori, 84, American landscape designer.Landscape architect Diana Balmori passes away * Vladimir Belov, 58, Russian handball player, Olympic silver medalist (1980).Kаптан сьорной СССР Владимир Белов скончался на 59-м жизни * Houston Conwill, 69, American sculptor, prostate cancer.Houston Conwill, Whose Sculptures Celebrated Black Culture, Dies at 69 * Holly Dunn, 59, American country music singer-songwriter (\"Daddy's Hands\", \"Are You Ever Gonna Love Me\", \"You Really Had Me Going\"), ovarian cancer.Holly Dunn, 59, Country Singer-Songwriter, Dies; 'Daddy's Hands' Was a Hit * Marti Friedlander, 88, New Zealand photographer, breast cancer.Acclaimed New Zealand photographer Marti Friedlander dies * Gwen Ifill, 61, American journalist (PBS NewsHour, Washington Week), endometrial cancer.PBS newscaster Gwen Ifill has died * Gardnar Mulloy, 102, American tennis player, winner of the US Open (1942, 1945, 1946, 1948) and Wimbledon Championships (1957), complications from a stroke.Tennis legend Gardnar Mulloy of Miami dies at 102 * Janet Wright, 71, Canadian actress (Corner Gas, The Perfect Storm, McCabe & Mrs. Miller). ===15=== * Bob Addis, 91, American baseball player (Chicago Cubs, Boston Braves).Robert \"Bob\" Addis * Mose Allison, 89, American jazz pianist and singer-songwriter (\"Young Man Blues\").RIP Mose Allison, One-of-a-Kind Jazz Pianist/Songwriter * Rod Bieleski, 85, New Zealand plant physiologist.Roderick Leon Bieleski * Sixto Durán Ballén, 95, Ecuadorian politician, President (1992–1996).Former Ecuador President Sixto Duran-Ballen dies at 95 * Ken Grieve, 74, British television director (The Bill, Peak Practice, Doctor Who). * Daniel Leab, 80, German-born American historian.Passing of Dan Leab * Chester E. Norris, 88, American diplomat, Ambassador to Equatorial Guinea (1988–1992).Longtime diplomat Chester Norris dies at 88 * Milt Okun, 92, American singer and music producer.Milton T. Okun, Music Producer for John Denver, Peter, Paul and Mary Dies ===16=== * Len Allchurch, 83, Welsh footballer (Swansea City, Sheffield United, national team).Len Allchurch: Former Wales and Swansea footballer dies aged 83 * Joan Carroll, 85, American child actress (Meet Me in St. Louis).Joan Carroll, Child Actress in 'Meet Me in St. Louis' and 'The Bells of St. Mary's,' Dies at 85 * Jay Wright Forrester, 98, American computer engineer and systems scientist.Jay W. Forrester Dies at 98; a Pioneer in Computer Models * Melvin Laird, 94, American politician and writer, Secretary of Defense (1969–1973) and U.S. Representative from Wisconsin's 7th congressional district (1953–1969), respiratory failure.Melvin Laird, Defense Secretary Who Challenged Vietnam Policy, Dies at 94 * Daniel Prodan, 44, Romanian footballer (Steaua Bucharest, Atlético Madrid, national team), heart attack.Veste tragică pentru fotbalul românesc. Didi Prodan a decedat la numai 44 de ani, după un infarct ===17=== * Virgilio Godoy, 82, Nicaraguan politician, Vice President (1990–1995).Muere Virgilio Godoy, ex vicepresidente de Nicaragua * Ruth Gruber, 105, American journalist (New York Herald Tribune).Journalist and author Ruth Gruber dies in NY at age 105 * Marzieh Hadidchi, 77, Iranian Revolutionary Guard commander and politician, MP (1984–2000).«مرضیه دباغ» دار فانی را وداع گفت * Saki Kaskas, 45, Greek video game music composer (Need for Speed, Sleeping Dogs, Mass Effect 2).Obituary: Need for Speed and Sleeping Dogs composer, Saki Kaskas * Whitney Smith, 76, American vexillologist, designer of the flag of Guyana, co-designer of the flag of Bonaire.Whitney Smith, Whose Passion for Flags Became a Career, Dies at 76 ===18=== * Denton Cooley, 96, American heart surgeon.Dr. Denton Cooley, pioneer of heart transplants, dies at 96 * Ed Francis, 90, American professional wrestler and promoter.PBS Hawai'i on Twitter * Sharon Jones, 60, American singer (Sharon Jones & The Dap-Kings), pancreatic cancer.Sharon Jones Dead at 60 * Yevgeni Lazarev, 79, Russian- American actor (Iron Man 2, The Sum of All Fears, Call of Duty 4: Modern Warfare), heart failure.Названа причина смерти актера Евгения Лазарева * Liu Sung-pan, 84, Taiwanese politician, member (1973–2004) and President (1992–1999) of the Legislative Yuan.立法院前院長劉松藩 85歲在美病故 * Kervin Piñerua, 25, Venezuelan volleyball player (national team), heart attack. * Freddie L. Poston, 91, American Air Force lieutenant general.Freddie Poston Obituary ===19=== * Irving A. Fradkin, 95, American philanthropist, founder of Scholarship America.Philanthropist Dr. Irving Fradkin, founder of Dollars for Scholars, dies at 95 * Jan Huberts, 79, Dutch motorcycle road racer.Voormalig Grand Prix coureur en DeeCee Racing Teambaas Jan Huberts overleden * Ida Levin, 53, American violinist, leukemia.American Violinist Ida Levin has Passed Away – Aged 53 * Paul Sylbert, 88, American production designer (Heaven Can Wait, The Prince of Tides, One Flew Over the Cuckoo's Nest), Oscar winner (1979).Paul Sylbert, Oscar-winning production designer for 'Heaven Can Wait', dies at 88 ===20=== * Gabriel Badilla, 32, Costa Rican footballer (Saprissa, New England Revolution), heart failure.Costa Rican soccer player Gabriel Badilla died today * Maria Glazovskaya, 104, Russian scientist and agrochemist.20 ноября 2016 года скончалась Мария Альфредовна Глазовская * Konstantinos Stephanopoulos, 90, Greek politician, President (1995–2005), pneumonia.Έφυγε από τη ζωή ο πρώην Πρόεδρος της Δημοκρατίας Κωστής Στεφανόπουλος * William Trevor, 88, Irish writer (Love and Summer, Two Lives, The Children of Dynmouth).William Trevor, watchful master of the short story, dies aged 88 ===21=== * Jan Sonnergaard, 53, Danish writer, heart attack.Jan Sonnergaard er død * René Vignal, 90, French footballer (Toulouse, RC Paris, national team).L'ancien international René Vignal est décédé ===22=== * M. Balamuralikrishna, 86, Indian Carnatic musician and composer.Balamuralikrishna, veteran Carnatic musician, dies aged 86 * Chen Yingzhen, 79, Taiwanese writer.Minister, friends mourns death of writer Chen Ying-chen * Carlos Fayt, 98, Argentine lawyer and politician, Minister of the Supreme Court (1983–2015) and President (2003–2004).Murió Carlos Fayt, el exjuez de la Corte Suprema de Justicia * Moeenuddin Ahmad Qureshi, 86, Pakistani politician, Acting Prime Minister (1993), lung infection.Former caretaker PM Moeen Qureshi passes away * Viveki Rai, 92, Indian author.Bhojpuri writer Viveki Rai passes away * Ram Naresh Yadav, 90, Indian politician, Chief Minister of Uttar Pradesh (1977–1979), Governor of Chhattisgarh (2014) and Madhya Pradesh (2014–2016).Ex-Governor of MP Ram Naresh Yadav dies ===23=== * Rita Barberá, 68, Spanish politician, Mayor of Valencia (1991–2015) and Senator (since 2015), heart attack due to cirrhosis .Spanish ex-mayor Rita Barbera dies amid corruption case * Ralph Branca, 90, American baseball player (Brooklyn Dodgers, Detroit Tigers).Ralph Branca, beloved Brooklyn Dodgers pitcher who gave up ‘Shot Heard ‘Round the World’ home run, dead at 90 * Michel Deza, 77, Russian-born French mathematician. * Karin Johannisson, 72, Swedish idea historian, member of the Royal Swedish Academy of Sciences (until 2016), cancer.Nekrolog: Karin Johannisson * Peggy Kirk Bell, 95, American professional golfer (LPGA).Peggy Kirk Bell, one of the game's most influential figures, dies at 95 * Abdul-Karim Mousavi Ardebili, 90, Iranian cleric and jurist, Chief Justice of Iran (1981–1989).آیت‌الله موسوی اردبیلی دعوت حق را لبیک گفت * Ryu Mi-yong, 95, North Korean politician, Chairwoman of the Chondoist Chongu Party (since 1995), lung cancer.S.Korea permits son of deceased religious leader to visit North Korea * Andrew Sachs, 86, German-born British actor (Fawlty Towers, Coronation Street, Hitler: The Last Ten Days), dementia.Fawlty Towers star Andrew Sachs dies aged 86 * Fred Stobaugh, 99, American songwriter.In Memory of Fred Stobaugh * Jerry Tucker, 91, American child actor (Our Gang). ===24=== * Marcos Ana, 96, Spanish communist activist, poet and veteran of the Spanish Civil War, political prisoner (1939-1961).Communist Poet, Longest-Serving Prisoner of Franco, Dies at 96 * Al Brodax, 90, American movie and television producer (Yellow Submarine).R.I.P. \"Yellow Submarine\" Producer Al Brodax (1926–2016) * Bob Chase, 90, American broadcaster (WOWO, Fort Wayne Komets), heart failure. * Dave Ferriss, 94, American baseball player (Boston Red Sox).Former Red Sox pitcher David ‘Boo’ Ferriss dead at 94 * Shirley Bunnie Foy, 80, American jazz musician.RIP Shirley Bunnie Foy * Paul Futcher, 60, English footballer (Manchester City, Barnsley, Grimsby Town), cancer.Paul Futcher: Grimsby Town and Barnsley legend dies at the age of 60 * Florence Henderson, 82, American actress (The Brady Bunch) and singer, heart failure. * William Mandel, 99, American broadcast journalist, political activist and author.Legendary KPFA broadcaster William Mandel dies at age 99 * Luis Miquilena, 97, Venezuelan politician, Minister of Interior and Justice (2001–2002).Fallece en Caracas el político venezolano Luis Miquilena * Pauline Oliveros, 84, American composer and accordionist. * George C. Royal, 95, American microbiologist.GEORGE ROYAL Jr. Notice * Sabrina, 80, British model and actress (The Phantom Gunslinger, Blue Murder at St Trinian's, The Ice House).Sabrina (Norma Ann Sykes) * Charles M. Stein, 96, American statistician.Charles M. Stein, extraordinary statistician and anti-war activist, dies at 96 ===25=== * Erich Bloch, 91, German-born American electrical engineer, Director of the National Science Foundation (1984–1990).Erich Block Notice * Fidel Castro, 90, Cuban politician, Prime Minister (1959–1976) and President (1976–2008).Cuba's Fidel Castro dies aged 90 * Ron Glass, 71, American actor (Barney Miller, Firefly, Lakeview Terrace), respiratory failure.'Barney Miller' and 'Firefly' Star Ron Glass Dead at 71 * Trevor Goddard, 85, South African cricketer.Trevor Goddard dies aged 85 * David Hamilton, 83, British photographer.British photographer David Hamilton dies in Paris – police source * Burton J. Lee III, 86, American doctor, Physician to the President (1989–1993), bladder cancer.Dr. Burton J. Lee, 86, Reagan AIDS Panelist and Bush's White House Physician, Dies * Margaret Rhodes, 91, British writer, cousin of Elizabeth II.Queen's cousin and best friend Margaret Rhodes dies aged 91 * Richard Dean Rogers, 94, American district court judge, U. S. District Court for the District of Kansas (since 1975).Richard Rogers, who spent 40 years as a federal judge here, dies at 94 * Peter Schweri, 77, Swiss painter.Schweri, Peter * Thomas Taylor, Baron Taylor of Blackburn, 87, British politician, member of the House of Lords (since 1978), mobility scooter crash.Lord Taylor dies after mobility scooter crash ===26=== * Ida Blom, 85, Norwegian historian.Ida Blom er død * Miriam Eshkol, 87, Israeli education administrator.Miriam Eshkol, wife of Israel's third prime minister, passed away aged 87 * Peter Hintze, 66, German politician, General Secretary of the CDU (1992–1998) and vice-president of the Bundestag (since 2013), cancer. * Peter Hans Kolvenbach, 87, Dutch religious leader, Superior General of the Society of Jesus (1983–2008).Fr. Peter-Hans Kolvenbach, S.J., 29th Superior General of the Society of Jesus, Passes Away * Chad Robinson, 36, Australian rugby league footballer (Sydney Roosters, Parramatta Eels), suicide by traffic collision.Electricity workers have discovered Chad Robinson’s body in a car at Kenthurst * Fritz Weaver, 90, American actor (Fail Safe, Holocaust, Creepshow), Tony winner (1970).Fritz Weaver, Tony-Winning Character Actor, Dies at 90 ===27=== * Nijolė Ambrazaitytė, 77, Lithuanian opera singer and politician.Mirė garsi operos solistė, signatarė Nijolė Ambrazaitytė * Bernard Gallagher, 87, British actor (Casualty, Crown Court, Downton Abbey).Bernard Gallagher 1929 – 2016 * Ioannis Grivas, 93, Greek politician, Prime Minister (1989).Πέθανε ο πρώην πρόεδρος του Αρείου Πάγου και υπηρεσιακός πρωθυπουργός Ιωάννης Γρίβας * Viktor Ivannikov, 76, Russian computer scientist.Академик РАН Виктор Петрович Иванников * Dick Logan, 86, American football player (Green Bay Packers).Richard Logan of Logan Sports dies ===28=== * William Christenberry, 80, American artist, Alzheimer's disease.Renowned artist from Tuscaloosa dies * Jim Delligatti, 98, American entrepreneur, creator of the Big Mac.Big Mac creator Jim Delligatti dies at 98 * John C. Harkness, 99, American architect.Chip Harkness, 99, last living founder of The Architects Collaborative * Georg Lhotsky, 79, Austrian actor and director (Moss on the Stones).Schauspieler und Filmemacher Georg Lhotsky gestorben * Ng Bi-chu, 88, Taiwanese activist, complications of diabetes.Massacre archive founder Juan died at age 90: family * Mark Taimanov, 90, Russian Soviet-era chess grandmaster and concert pianist, USSR chess champion (1956).Soviet chess legend Taimanov dies at 90 * Grant Tinker, 90, American television executive, CEO of NBC (1981–1986).Legendary TV Executive Grant Tinker Dead at 90 * Van Williams, 82, American actor (The Green Hornet), renal failure.‘Green Hornet’ Star Van Williams Dies at 82 * Notable Brazilian people killed in the crash of LaMia Flight 2933: ** Ailton Canela, 22, football player (Chapecoense). ** Dener Assunção Braz, 25, football player (Chapecoense). ** Sérgio Manoel Barbosa Santos, 27, football player (Chapecoense). ** Matheus Biteco, 21, football player (Chapecoense, Grêmio). ** Mateus Caramelo, 22, football player (Chapecoense). ** Ananias Eloi Castro Monteiro, 27, football player (Chapecoense, Portuguesa). ** Victorino Chermont, 43, reporter (Fox Sports). ** Paulo Julio Clement, 51, commentator (Fox Sports). ** José Gildeixon Clemente de Paiva, 29, football player (Chapecoense, Coritiba). ** Guilherme Gimenez de Souza, 21, football player (Chapecoense). ** Lucas Gomes da Silva, 26, football player (Chapecoense).Los 19 jugadores que perdieron la vida en la tragedia del Chapecoense ** Josimar, 30, football player (Chapecoense). ** Caio Júnior, 51, football player and manager (Chapecoense, Vitória de Guimarães).Plane Carrying Brazil's Chapecoense Soccer Team Crashes in Colombia ** Everton Kempes dos Santos Gonçalves, 34, football player (Chapecoense, JEF United Chiba). ** Filipe Machado, 32, football player (Chapecoense, CSKA Sofia). ** Arthur Maia, 24, football player (Chapecoense, Vitória). ** Marcelo Augusto Mathias da Silva, 25, football player (Chapecoense, Flamengo). ** Delfim Peixoto, 75, politician and football executive, vice-president of CBF, president of Federação Catarinense de Futebol and congressman.Tragedia en Colombia: quiénes son las 71 víctimas del terrible accidente aéreo ** Mário Sérgio Pontes de Paiva, 66, football player, manager, and commentator (Fox Sports). ** Bruno Rangel, 34, football player (Chapecoense). ** Cléber Santana, 35, football player (Chapecoense, Atlético Madrid). ** Tiaguinho, 22, Brazilian football player (Chapecoense). ** Thiego, 30, football player (Chapecoense, Grêmio). ===29=== * Ray Columbus, 74, New Zealand rock singer (Ray Columbus & the Invaders).NZ pop pioneer Ray Columbus dies * Marcos Danilo Padilha, 31, Brazilian football player (Chapecoense), injuries sustained in a plane crash.Colombia plane crash: Fans gather to mourn Chapecoense footballers among 75 killed – as it happened * Joe Dever, 60, British author (Lone Wolf), complications from bile duct surgery.Tributes flood in for legendary fantasy author, Chingford-born Joe Dever * Luis Alberto Monge, 90, Costa Rican politician, President (1982–1986), cardiac arrest.Muere expresidente Luis Alberto Monge, el último constituyente * Hardy Myers, 77, American politician, Attorney General for Oregon (1997–2009), complications from pneumonia.Hardy Myers, former three-time Oregon attorney general, dies at 77 * Richard B. Teitelman, 69, American judge, Chief Justice of the Supreme Court of Missouri (2011–2013). ===30=== * Alice Drummond, 88, American actress (Ghostbusters, Awakenings, Doubt), complications from a fall.Alice Drummond, Character Actress, Dies at 88 * Peng Chang-kuei, 97, Taiwanese chef, inventor of General Tso's chicken, pneumonia. * Sinclair Stevens, 89, Canadian politician, Leader of the Progressive Canadian Party (since 2007), heart attack.Former MP, PC minister, Sinclair Stevens has died * Royce Womble, 85, American football player (Baltimore Colts), complications from Alzheimer's disease.Royce Cullen Womble ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==References== *11 Category:November 2016 events",
 "title": "Deaths in November 2016"
}