{
 "id": "694108",
 "text": "Forensic anthropology is the analysis of human remains for the purpose of solving criminal cases and identifying the cause of death. To understand the death of a person, forensic anthropologists collect information from their bones.Wiersema, Jason M. “Evolution of Forensic Anthropological Methods of Identification.” Academic forensic pathology vol. 6,3 (2016): 361-369. doi:10.23907/2016.038 Forensic anthropologists use bone analysis to learn more about the person who died. == Methods in bone analysis == === Age === How old was the person when they died? Scientists can discover the stages of growth and development that the bones were in when a person died to guess their age. Bones such as the femur can be measured to determine what stage of life a person was in. A child’s bones would typically be shorter than an adult’s bones, and a child's bones would not have the epiphyses, the growing part of a bone, attached completely. Another way to determine age is to look for cartilage, a tissue that is replaced by hard bone as a person gets older. Younger children will have more cartilage in their bones while adults will have more hard bone. Using these methods can help guess the age of a person when they died. === Cause of death === How did they die? Causes of death are usually related to injury and/or disease. Forensic anthropologists study bone to see if injuries were caused by bullets, blunt objects, sharp objects, or other weapons. Injuries that cause death can also be accidental, like falling or a car accident. They may also be able to see if a person had a disease that caused their death.Erickson, Paul A, and Liam D. Murphy. A History of Anthropological Theory. Toronto: University of Toronto Press, 2013. Print Some diseases can cause changes in the structure of bone. Anemia can cause bones in the skull to flatten. Diseases like scurvy and rickets can cause bones to soften and bend. Diseases like rickets can also be used to identify the person if their doctor or the police knew they had the disease. === Sex === What is the sex of the person who died? Sexual dimorphism is most clear in the pelvis of the skeleton and the skull. Boas, Franz. “Changes in the Bodily Form of Descendants of Immigrants.” American Anthropologist, vol. 14, no. 3, 1912, pp. 530–562. JSTOR, www.jstor.org/stable/659886. Forensic anthropologists can determine a persons' sex by studying these bones. Since females give birth, their pelvic bones are usually wider and fan out more to allow room for the baby. For the skull, males generally have larger skulls than females due to the larger amount of muscle that male skulls have to support.Dwight, T. (1905). The size of the articular surfaces of the long bones as characteristic of sex; an anthropological study. The American Journal of Anatomy. === Time of death === When did they die? To find out when a person died, anthropologists use taphonomy, or the study of the natural processes that affect the condition of human remains. Wind, water, soil erosion, and sand can all affect the state of bones. Anthropologists can create a timeline of when these factors to guess when a person died. === Ancestry === What is the individual’s ancestry? Anthropologists can study ancestry by studying which features of the skeleton are more common in particular populations compared to others. Forensic anthropologists collect data by measuring different features of the cranium, such as width, length, shape and thickness. Once these measurements are collected, anthropologists find a reference sample in the Forensic Anthropology Databank. Elizabeth A. DiGangi, Joseph T. Hefner, Chapter 5 - Ancestry Estimation, Editor(s): Elizabeth A. DiGangi, Megan K. Moore, Research Methods in Human Skeletal Biology, Academic Press, 2013, Pages 117-149, ISBN 9780123851895, https://doi.org/10.1016/B978-0-12-385189-5.00005-4. This databank can group the data from the individual into an existing reference group, indicating the individual's ancestry. Ancestry studying in forensic anthropology has been argued against. The studying of ancestry is based on works by Franz Joseph Gall who used ancestry as an excuse for racism. Many forensic anthropologists argue against using ancestry studies due to its racist history and suggest using better methods that are not racist === Bone Markings === Occupational Markers When looking at bones, anthropologists look for markings left on bones caused by stress. These markings are called stress markers or occupation markers. Occupational markers can be found in cases where muscles or tendons insert into the cortical tissue of bone by the periosteum, or where there is hypertrophy (growth) of muscular attachments on the bones. The cause of the markers left are from repetitive activities over a long period of time. But some studies do not think occupational markers are very helpful for forensic identification and may be a source of bias. == History of forensic anthropology == === Early history === The use of anthropology for criminal cases began when physical anthropology was growing in the United States in the early 1900s.Golda, Stephanie D. “A Look at the History of Forensic Anthropology: Tracing My Academic Genealogy.” JOURNAL OF CONTEMPORARY ANTHROPOLOGY, vol. 1, no. 1, 2010, pp. 35-47. Edward Hooton was an important anthropologist. He began physical anthropology in the US to study criminals. He thought that you could know who was a criminal by looking at body parts. The use of criminal anthropology came from eugenics and anthropometry for criminal traits. As forensic anthropology grew, it moved away from eugenics and toward a better methodology for solving criminal cases. This was done in the 1940s with William Krogman. Krogman wrote two articles on skeletal identification among law enforcement agencies, like the FBI, at the time. This gave people more knowledge about the use of physical anthropology to solve criminal cases. === Growth and modern forensic anthropology === Modern forensic science in the U.S.A. was started in the 1950s. At the end of World War II and the Korean War the U.S. Army used physical anthropologists to identify dead soldiers. This created a base for physical anthropologists to identify better ways to see skeletal structures. With Krogman’s work, physical anthropologists began to work as true “forensic anthropologists” at this time. In 1948, the Physical Anthropology Section of the American Academy of Forensic Sciences made learning forensic anthropology at a higher level possible.Field, Kenneth S. History of the American Academy of Forensic Sciences, 1948-1998. West Conshohocken, PA: ASTM, 1998. The study of forensic anthropology was a separate field from physical anthropology. This gave it more value in criminal cases. It also made the field grow toward scientific skeletal analysis. One part of the growth in forensic anthropology is the field of transgender and queer anthropology. As a group that is attacked more than other groups, forensic anthropology moved to identify the problems that queer people face. One example of this is the skeletal analysis of sexual reassignment surgery and what marks it leaves on the body of the transgender person.Tallman, Sean, Caroline Kincer, and Eric Plemons. “Centering Transgender Individuals in Forensic Anthropology and Expanding Binary Sex Estimation in Casework and Research.” Forensic Anthropology, March 19, 2021. https://doi.org/10.5744/fa.2020.0030. Identifying these marks is harder because they are not commonly discovered. The field of forensic anthropology works to identify these people by using new ways of thought that work with older and new methods to find the truth. == References == == Related pages == *Forensic science Category:Anthropology Category:Forensics Category:Physical anthropology",
 "title": "Forensic anthropology"
}