{
 "id": "694327",
 "text": "Hahm Eun-jung (born December 12, 1988), is a South Korean singer and actress. She is known by the stage name Eunjung and also as Elsie. She has been a member of the girl group T-ara since 2009. She also performs as a solo artist and is an actress in movies and television. ==Life== Hahm was born in Seoul, South Korea. When in seventh grade, Hahm took taekwondo lessons and won three competitions. Later that year, Hahm went to Dongguk University. 티아라 은정 \"가장 해보고 싶은 것은 액션 영화\" (T-ara's Eunjung wants to act in action movies) . Sportsseoul.com. July 4. 2010. Retrieved July 27, 2010. She is an only child. ==Work== ===1995–2008=== In 1995, when Hahm was seven years old, she participated in the \"Little Miss Korea\" pageant and won. Baek Jieun: 티아라 은정, 가수 데뷔 전 드라마 '궁' 출연? 화제 (Eun-jeong debuted as an actor before a singer). SportsChosun.com. October 18, 2009. Retrieved July 26, 2010. That same year, she was in the youth drama A New Generation of Adults. 티아라 은정 “이대 음대 나온 엄마께 죄송하고 감사해요” (Eunjung: \"I'm sorry and thankful towards my mother\") . ISplus. March 25, 2010. Retrieved July 26, 2010. Later, she had several minor roles in movies and Korean dramas. She was also in a few commercials. In 2007, Hahm was in a few music videos. One was SG Wannabe's music video \"Gasiri\" (\"가시리\") from their 2007 album Story In New York. Others were FT Island's music videos Thunder (\"천둥\"), Only One Person (\"한사람만\"), and A Man's First Love Follow Him To The Grave (\"남자의 첫사랑은 무덤까지 간다\"). She also was in the 2008 horror film Death Bell. She plays a student who is murdered by her teacher. ===2009–2012=== Hahm became a member of the girl group T-ara in 2009.Lynn Kim & Jessica Kim: T-ara to become 7-member group . 10asia. July 16, 2010. Retrieved July 26, 2010. 티아라, 은정→보람 리더 교체 왜? (\"Why did T-ara change its leaders from Eunjung to Boram?\"). StarNews. July 16, 2010. Retrieved July 27, 2010. Hahm featured in Davichi's music video \"Time, Please Stop\" (\"시간아 멈춰라\") which was released on May 6, 2010. 티아라 은정, 다비치 ‘시간아멈춰라’ 뮤비 출연 ‘불량 백설공주 변신’ (T-ara's Eunjung to appear as a 'Snow White turned bad' in Davichi's new music video). Newsen. May 3, 2010. Retrieved July 27, 2010. Her first major acting role after joining T-ara was in the SBS drama Coffee House, in 2010. 함은정, \"티아라 인기 업고 주인공 발탁? 너무 억울해요\" . Chosun.com. May 16, 2010. Retrieved July 27, 2010.New drama brewing. Yonhap/JoongAng Daily. May 11, 2010. Retrieved July 27, 2010. 티아라 은정, '한효주 언니처럼 좋은 배우, 되겠죠?' . The Star. May 31, 2010. July 27, 2010.Han Sang-hee: New drama to bring more than coffee. The Korea Times. May 16, 2010. Retrieved July 26, 2010. ‘커피하우스’ 아쉬운 시청률 ‘신선한 장르+연기력 빛났다’(종영) . Newsen/Joins.com. July 27, 2010. Retrieved July 27, 2010. That same year, she was in the horror film White: The Melody of the Curse. 김기방 공포영화 ‘화이트’ 출연 . Daum.net. July 7, 2010. Retrieved July 26, 2010. ‘아이스크림소녀’ 최아라, 티아라 은정과 스크린 걸그룹 호흡 . Daum.net. June 25, 2010. Retrieved July 26, 2010. In 2011 she had a leading role in the teen drama Dream High.PREVIEW: KBS TV series \"Dream High\" , 10.asiae.co.kr, 28 December 2010. From 2011-2012, she was in MBC's variety program We Got Married. Hahm was also in dramas The King of Legend and Insu, The Queen Mother. ===2014–2017=== In 2014 she was in the SBS' drama Endless Love. In 2015, she had the lead role in the Thai comedy Micro Love. In May 2015, Hahm made her solo debut as a singer with the name ELSIE. In 2016, Hahm was in Flowers of Evil, a thriller. In 2017, Hahm was in MBC's daily drama Sisters- in-Law. ===2018–present=== In 2018, Hahm was cast in the KBS's drama Lovely Horribly. In 2019, Hahm was announced as the narrator for the documentary The Muse Story. ==List of albums== ===Extended plays=== Title Album details Peak positions Sales KOR I'm Good * Released: May 7, 2015 * Label: MBK Entertainment, LOEN Entertainment * Format: CD, digital download 6 * KOR: 6,517+ * Re-released: October 30, 2015 Good Bye (EP) * Label: MBK Entertainment, LOEN Entertainment * Format: CD, digital download 9 * KOR: 2,552+ Desire * Released: June 12, 2019 * Label: Akatsuki * Format: CD, digital download * JPN: ===Singles=== Title Year Peak chart positions Sales Album KOR Gaon KOR Billboard CHN V Chart \"Two As One\" 2013 — — — \"I'm Good\" 2015 * KOR (DL): 41,346+ I'm Good \"I'm Good (Chinese Version)\" \"Goodbye\" Goodbye \"Goodbye (Chinese Version)\" ===Soundtracks and solo performances=== Year Album Title Duration Notes 2009 \"N-Time\" 2:57 with Hwang Jung-eum and Hyomin 2010 Coffee House OST \"Coffee House\" 2:57 Solo \"Wonder Woman\" 3:38 with Hyomin, Seeya and Davichi 2011 \"Crazy4s\" 0:00 with Kim Soo-hyun 2013 Bunny Style! \"Dangerous Love\" 3:40 with Jiyeon and Hyomin 2015 White Snow \"Don't Forget Me\" 3:58 with various artists 2018 My Secret Terrius OST Part 4 \"Shout To The Sky\" 4:25 Solo 2019 I Hate You Juliet OST Part 3 \"You Are My Star\" 3:54 Solo ===Music videos=== Year Music video Director Notes 2015 \"I'm Good\" Original Version \"Goodbye\" Original Version Chinese Version ==Movies and Television== ===Movie=== Year Title Role Note Ref 1999 A-rong's Big Expedition Song-i 2002 Dodge Go! Go! Min Sang-mi Madeleine Sung-hae (young) 2005 The Beast and the Beauty Hae-mi 2006 Ice Bar Mi-sook World of Silence Min-hee 2007 Dating On Earth Yun Yi-soo 2008 Death Bell Kim Ji-won Supporting role 2011 White: The Melody of the Curse Eun-joo Main role Gisaeng Ryung Cameo 2017 Micro Love Kim Min-jee Main role 2017 Missing 2 Sun-young Main role ===Television series=== Year Title Role Network Note Ref 1995 A New Generation of Adults Jessica KBS 2004 Little Women Hyun- deuk (young) SBS Age of Heroes Layla MBC Toji, the Land Bong-soon (young) SBS 2005 Lovers in Prague Cameo Cute or Crazy Hello, My Teacher 2006 Princess Hours MBC My Love SBS 2010 Master of Study KBS2 Coffee House Kang Seung-yeon SBS Main role 2011 Dream High Yoon Baek-hee KBS2 King Geunchogo Jin Ah-yi KBS1 Supporting role 2012 Insu, The Queen Mother In-soo (young) JTBC 2014 Endless Love Tae Cho-ae SBS 2015 Love on a Rooftop Min Chae-won KBS2 2015 Sweet Temptation Eun-jin Naver TV Cast Main role 2017 Sisters-in-Law Hwang Eun-byul MBC 2018 Lovely Horribly Shin Yoon-ah KBS2 Supporting role ===Variety shows=== Year Title Roles Network Notes 2011–12 We Got Married Main cast MBC with Lee Jang-woo 2016 Master of Driving tcast TV 2017 Enchanted Lesson Birdie Birdie JTBC Golf 2018 King of Mask Singer Contestant MBC as \"Strawberry Girl\" ==Awards== Year Award Category Nominated Work Result 2010 SBS Drama Awards New Star Award Coffee House 2011 MBC Entertainment Awards Best Newcomer (Variety) We Got Married 2011 47th Baeksang Arts Awards Most Popular Actress (TV) Dream High 2016 Yinyuetai V-Chart Awards Most Popular Korean Solo Artist I'm Good 2017 ShinFilms Art Film Festival Awards Popularity Award for Commercial Films ==References== ==Other websites== * Category:1988 births Category:Living people Category:K-pop singers Category:South Korean actors Category:South Korean singers Category:T-ara members",
 "title": "Hahm Eun-jung"
}