{
 "id": "694431",
 "text": "Park Ji-yeon is a South Korean singer and actress. She is known by the stage name Jiyeon. She has been a member of girl group T-ara since 2009. She also performs as a solo artist and is an actress in movies and television. ==Life== Park was born in Seoul, South Korea, on June 7, 1993. 티아라 지연, '악성루머'에도 '엠카'서 MC 활약 '눈길. Naver. 10 October 2010. accessed 14 November 2015. ‘엠카 MC 나선’ 티아라 지연, 음란채팅 루머에도 ‘씩씩’ \". Naver News. 9 October 2010. retrieved 14 November 2015. She went to Hyehwa Girls' High School and Lila Art High School. ==Work== ===2008–2009=== She and Hahm Eun-jung are the only two members of T-ara to be trained in acting.Lynn Kim & Jessica Kim: \"T-ara to become 7-member group\" , 10Asia. 16 July 2010. retrieved 26 July 2010. 티아라, 은정→보람 리더 교체 왜? (\"Why did T-ara change its leaders from Eunjung to Boram?\"). Star News. 16 July 2010. retrieved 27 July 2010. Park had a desire to be a model. In 2008, she was in several advertisements for clothing. '음중' 새 4MC 온유·민호·지연·수지, 무난한 데뷔 . Naver News. 30 October 2010. retrieved 4 November 2010. In early 2009 she sang with Davichi and SeeYa in the song Women's Generation. This made her the first member of T-ara to appear in public. She also was in SG Wannabe's music videos I Love You and Crybaby in 2009. He first appearance with T-ara was on July 29, 2009. ===2010–2013=== In 2010, Park was in the movie Master of Study. That same year, she had a lead role in horror film Death Bell 2: Bloody Camp. She was also in the movie Jungle Fish 2. In 2010, Park became the host for MBC's Show! Music Core, alongside Bae Suzy, Choi Min-ho and Onew. She also was in SBS's television show Heroes. In 2011, Park was a voice actor in the Korean translation of Gnomeo and Juliet. In 2012, she was in the drama Dream High 2. ===2014–2017=== Park made her solo debut in May 2014. It was with her song Never Ever. The music video ranked number one on China's YinYueTai for two weeks. In June 2014, Park was in MBC's television series Triangle. The same month, she began hosting SBS MTV's The Show: All About K-pop. In May 2015, Park was in the Korean-Chinese movie Encounter. In July 2015, she sang the song Summer Love with 2BiC's Jun-hyung. In 2016, Park was in the drama My Runway. The drama was released on Netflix in December 2016. In February 2017, Park said she would make a new solo album. It was later cancelled. ===2018–present=== In early 2018, Park and her fellow T-ara members left MBK Entertainment when their contracts finished. While they stated they would stay together as a group, they have not released any new music as a group since then. In May 2018, Park joined Chinese agency Longzhen Culture Development. She then made a song with Vietnamese singer Soobin Hoàng Sơn. The title is Between Us. In November 2018, she signed with Partners Park for her work in Korea. In December 2018, Park made music videos for her song One Day and said they were a gift to her fans. In 2019, she was cast in the drama Let Me Hear Your Song. ==List of albums== ===Extended plays=== Title Album details Peak positions Sales KOR TWN TWN East Asian Never Ever * Released: 20 May 2014 * Label: Core Contents Media, KT Music * Format: CD, digital download 3 11 2 * KOR: 15,639+ ===Singles=== Title Year Peak positions Sales Album KOR CHN Gaon Hot. \"Rolling\" (또르르) 2010 8 — — rowspan=\"2\" Master of Study OST \"My Sea\" 2013 — — — Bunny Style! \"1 Minute 1 Second (Never Ever)\" 2014 17 6 1 * KOR (DL): 322,949+Total sales for 1 Minute 1 Second (Never Ever): * Never Ever \"Summer Love\" 2016 — — — Summer Love \"One Day\" 2018 — — 1 ===Soundtracks=== Year Album Song Duration Notes 2009 Cinderella Man \"Women's Generation\" 3:32 with Seeya and Davichi \"Forever Love\" 3:32 2010 Master of Study \"Rolling\" 4:01 Solo Jungle Fish 2 OST \"Little By Little\" 4:10 2012 Dream High 2 \"Superstar\" 3:42 with Hyorin and Ailee 2012 \"Together\" 4:19 with JB 2012 \"Day After Day\" 3:43 Solo 2013 Bunny Style! \"Dangerous Love\" 3:40 with Hahm Eun-jung and Hyomin 2014 Triangle \"Kiss And Cry\" 3:31 with Cho Seunghee (F-ve Dolls) and Shorry J (Mighty Mouth) 2017 What's My Name \"Lullaby\" 3:12 Solo 2018 Queen of Mystery 2 \"The Path Leading To Home\" 3:14 ===Other songs=== Year Title Peak positions Album KOR 2014 \"Yeouido Cherry Blossom\" 70 Never Ever \"Marionette\" 80 ===Music videos=== Year Music video Director Notes 2014 \"1 Minute 1 Second (Never Ever)\" Hong Se-hyun Original Version 2018 \"One Day\" Original Version 2018 Chinese Version ==Movies and television== ===Movies=== Year Title Role Ref 2010 Death Bell 2: Bloody Camp Lee Se-hee 2011 Gnomeo & Juliet Juliet Gisaeng Ryung Cameo 2015 Encounter ===Television series=== Year Title Role Network Notes Ref 2007 Hello! Miss Student KBS2 Cameo Lobbyist Deaf daughter's friend SBS Cameo 2008 Aeja's Older Sister, Minja Maeng Na-yeon Supporting role 2009 Soul Yoon Doo-na MBC High Kick! Lee Yu-ri Cameo 2010 Master of Study Na Hyun-jung KBS2 Supporting role Jungle Fish 2 Seo-yul Lead role 2011 Miss Ripley Yu MBC Cameo 2012 The Thousandth Man Han Yi-seul Cameo Dream High 2 Ri-an/Lee Ji-kyung KBS2 Lead role 2014 Triangle Seong Yoo-jin MBC Supporting role 2015 Sweet Temptation Ji-ho Naver TV Cast Web drama 2016 My Runway Han Seo-yeon Netflix Web drama 2019 Let Me Hear Your Song Ha Eun-joo KBS2 Main role ===Musical=== Year Title Role Ref. 2012 Our Youth, Roly Poly Musical Han Joo-young ===Variety shows=== Year Title Role Network Notes Ref 2010–2011 Heroes Cast SBS 2010–2011 Music Core Host MBC 2014–2015 The Show SBS MTV 2017 Living Together in Empty Room Cast MBC with Oh Chang-seok (Episode 16–19) 2018 Video Star Special Host MBC Every 1 Episode 121 ==Awards== Year Award Category Nominated Work Result 2010 SBS Entertainment Award Best Teamwork Heroes KBS Drama Awards Best New Actress Master of Study Best Couple Award with Yoo Seung-ho 2014 16th Seoul International Youth Film Festival Best Young Actress Triangle 2015 Cable TV Broadcast Awards Popularity Award The Show The 3rd Yinyuetai VChart Award Best Korea Female Singer Never Ever Yahoo Asia BUZZ Award Most Popular Asian İdol ==References== ==Other websites== Park Ji-yeon at Hancinema Category:1993 births Category:Living people Category:K-pop singers Category:South Korean singers Category:South Korean models Category:Actors from Seoul Category:T-ara members",
 "title": "Park Ji-yeon"
}