{
 "id": "694532",
 "text": "\"I Don't Care\" is a song recorded by English singer Ed Sheeran and Canadian singer Justin Bieber. It was released on May 10, 2019. as the lead single from Sheeran's fourth studio album, No. 6 Collaborations Project. The two wrote the song with Jason Boyd and its producers, Fred Gibson, Max Martin, and Shellback. The song is Sheeran's and Bieber's third collaboration together. Sheeran co-wrote Bieber's 2015 song \"Love Yourself\", and the two appeared on the 2019 single \"Earth\" by rapper Lil Dicky. The song entered at the top of the Australian and UK charts and at number two in the US and New Zealand. ==Charts== ===Weekly charts=== Chart (2019) Peak position Argentina (Argentina Hot 100) 24 Bolivia (Monitor Latino) 1 Brazil (Top 100 Brasil) 49 Bulgaria (PROPHON) 1 Colombia (National-Report) 18 China Airplay/FL (Billboard) 1 Croatia (HRT) 1 Estonia (Eesti Tipp-40) 2 Euro Digital Songs (Billboard) 1 France (SNEP) 5 Global 200 (Billboard) 106 Greece (IFPI) 1 Iceland (Tonlist) 1 Ireland (IRMA) 1 Israel (Media Forest) 1 Japan (Japan Hot 100) 10 Latvia (LAIPA) 3 Lebanon (Lebanese Top 20) 2 Lithuania (AGATA) 3 Luxembourg Digital Songs (Billboard) 1 Malaysia (RIM) 1 Mexico (Mexico Airplay) 1 Netherlands (Mega Top 50) 1 Panama (Monitor Latino) 3 Puerto Rico (Monitor Latino) 16 Romania (Airplay 100) 2 Serbia (Radiomonitor) 1 Singapore (RIAS) 3 Slovenia (SloTop50) 1 South Korea (Gaon) 67 Spain (PROMUSICAE) 8 US Rolling Stone Top 100 1 ===Monthly charts=== Chart (2019) Peak position Brazil Streaming (Pro-Música Brasil) 23 ===Year-end charts=== Chart (2019) Position Argentina Airplay (Monitor Latino) 29 Australia (ARIA) 6 Austria (Ö3 Austria Top 40) 5 Belgium (Ultratop Flanders) 10 Belgium (Ultratop Wallonia) 10 Canada (Canadian Hot 100) 8 CIS (Tophit) 27 Denmark (Tracklisten) 7 France (SNEP) 31 Germany (Official German Charts) 9 Hungary (Dance Top 40) 43 Hungary (Rádiós Top 40) 26 Hungary (Single Top 40) 16 Ireland (IRMA) 8 Italy (FIMI) 21 Japan (Japan Hot 100) 94 Latvia (LAIPA) 18 Malaysia (RIM) 9 Netherlands (Dutch Top 40) 2 Netherlands (Single Top 100) 4 New Zealand (Recorded Music NZ) 6 Poland (ZPAV) 34 Portugal (AFP) 6 Romania (Airplay 100) 8 Russia Airplay (Tophit) 21 Slovenia (SloTop50) 8 Sweden (Sverigetopplistan) 6 Switzerland (Schweizer Hitparade) 11 UK Singles (OCC) 3 US Billboard Hot 100 16 US Adult Contemporary (Billboard) 14 US Adult Top 40 (Billboard) 3 US Dance/Mix Show Airplay (Billboard) 4 US Mainstream Top 40 (Billboard) 4 US Rolling Stone Top 100 56 Chart (2020) Position Australia (ARIA) 55 Canada (Canadian Hot 100) 46 Denmark (Tracklisten) 64 Hungary (Dance Top 40) 52 Hungary (Rádiós Top 40) 35 Netherlands (Single Top 100) 99 Romania (Airplay 100) 92 Russia Airplay (Tophit) 118 Sweden (Sverigetopplistan) 75 Switzerland (Schweizer Hitparade) 79 UK Singles (OCC) 42 US Adult Contemporary (Billboard) 5 US Adult Top 40 (Billboard) 49 == References == Category:2019 songs Category:Pop songs Category:Justin Bieber songs Category:Ed Sheeran songs",
 "title": "I Don't Care (Ed Sheeran and Justin Bieber song)"
}