{
 "id": "694588",
 "text": "Revaz (Rezo) Cheishvili (, 24 April 1933 – 11 September 2015) was a Georgian writer and scriptwriter. ==Early life and education== Cheishvili was born in Kutaisi, Georgian SSR, Soviet Union in 1933. He moved to Tbilisi, the capital, in 1954 to continue his studies. In 1958 he graduated from Tbilisi State University with a degree in Georgian language and literature. ==Career== ===Film=== Cheishvili worked from 1961 to 1992 at the 'Georgian Film' studio as a film editor and served on the Film Script Administrative Board. He was a leading member of the Creative Association. He edited various Georgian literary journals and newspapers. Rezo Cheishvili was the scriptwriter of feature-length films My Friend Nodari, Samanishvili’s Stepmother and the widely famed The Blue Mountains, which was directed by noted Georgian director Eldar Shengelaia. ===Literature=== Cheishvili’s short stories and novels have been published in several countries.Reso Tscheischwili: Die himmelblauen Berge ==Personal life== Cheishvili died at his Kutaisi apartment on 11 September, 2015, aged 82. == Books == * Blue Mountains, 1980; Bakur Sulakauri Publishing 2013 * New Kuru, Palitra L Publishing, 2011 * Works in Seven Volumes, Kutaisi publishing Centre, 2010-2012 * Red Flower of Wild Rose, Palitra L Publishing, 2010 * Third Way: About Kutaisi and others, Kutaisi publishing Centre, 2003 * Selected Short Stories, Kutaisi publishing Centre, 2003 * Month of Ripening, Kutaisi publishing Centre, 2003 * Three Novels, Kutaisi publishing Centre, 2003 * A Comet, Merani Publishing, 1999 * Robbers, Merani Publishing 1999 * Dali, Merani Publishing, 1992 * My Friend Nodar, Nakaduli Publishing, 1990 * Selected Works in two Volumes, Sov. Georgia, 1989-1993 * First, Sov. Georgia Publishing, 1988 * Oh, My Vineyard, Merani Publishing, 1987; Bakur Sulakauri Publishing 2003 == Prizes and awards == * Literary award SABA 2012 for the Contribution in the Development of Literature * Soviet Union State Award 1984 for the script of the film The Blue Mountains * Shota Rustaveli State Prize for his Literary Works * State Prize of Georgia for his Contribution in Georgian Literature ==References== Category:1963 births Category:2015 deaths Category:Writers from Tbilisi Category:Soviet screenwriters Category:Movie editors",
 "title": "Rezo Cheishvili"
}