{
 "id": "694615",
 "text": "Baker Mayfield (born April 14, 1995) is an American football player for the NFL. He selected 1st overall by the Cleveland Browns in 2018 and started for the Browns for two seasons. After two seasons at Carolina, he is now the starting quarterback at Tampa Bay. Before that, he played college football at Texas Tech University before he moved on to Oklahoma University, where won the Heisman Trophy, which is an award for the most outstanding college football player in the nation. In his first year, Mayfield broke a record for most touchdown passes by a rookie and also helped the Browns rebound from a very bad season the previous year. In 2020, he helped Cleveland make the playoffs for the first time since 2002, and they also won a playoff game. However, after Mayfield struggled with injuries in 2021 and did not get along with new coach Kevin Stefanski, the Browns traded for embattled quarterback Deshaun Watson, all but marking the end of Mayfield's time in Cleveland. Mayfield himself was traded to the Tampa Bay Buccaneers before the 2023-2024 season. ==Early years== Mayfield was born on April 14, 1995 in Austin, Texas to James and Gina Mayfield and has two brothers. He played high school football for Lake Travis High School and grew up a fan of Oklahoma. Mayfield's father James played football for the University of Houston and eventually became a businessman focusing on private equity. The Mayfield family was well off until they ran into hard times during Baker's last year of high school, when they had to sell their house. ==College career== ===Texas Tech=== Mayfield first decided to enroll at Texas Tech University after finishing high school. He signed up for their football team as a walk-on, and eventually became their starting quarterback that year. He did well for the first few games before he got hurt and was benched for Davis Webb. ===Oklahoma=== Mayfield transferred to Oklahoma after his first year, as he believed his treatment at Texas Tech was not fair. Because of rules for transfer students, Mayfield would have to sit out for one year in 2014 before being able to play for Oklahoma in 2015. This sparked a debate and eventually led to the creation of the \"Baker Mayfield rule\", which allows walk-on players to play immediately after transferring to another school in the same conference. After winning the competition for starting quarterback from previous starter Trevor Knight in 2015, Mayfield passed for over 3,700 yards and averaged almost 40 passing touchdowns in all three years he was Oklahoma's quarterback. He finished near the top in Heisman Trophy voting before winning it in his senior year. Oklahoma would also win the Big 12 Conference championship in all three years, also making it to the Sugar Bowl in 2016 and the Rose Bowl in 2017. ==References== Category:1995 births Category:Living people Category:Cleveland Browns players Category:Heisman Trophy winners Category:Los Angeles Rams players Category:Sportspeople from Texas Category:Tampa Bay Buccaneers players",
 "title": "Baker Mayfield"
}