{
 "id": "69503",
 "text": "Toy Story 2 (also known as Toy Story 2: The Search for Woody) is a 1999 American computer-generated animation movie and a sequel to the 1995 movie Toy Story. It was released on November 24, 1999. It is the third Disney/Pixar full-length movie and was released to movie theaters by Buena Vista Pictures Distribution. It is about toys that come alive when people are not around. Woody is kidnapped by a toy collector so Buzz Lightyear and his friends go on a mission to save him. Toy Story 2 was Pixar's first sequel and Pixar's only sequel released before Disney's acquisition of the studio. A sequel to this movie, Toy Story 3, was released in 2010. == Plot == The plot begins with a Buzz Lightyear video game played by Rex, where Zurg ends up defeating Buzz Lightyear with a single shot, leaving Rex frustrated at being defeated by Zurg. Meanwhile, Woody was preparing to go to summer camp with Andy (who is now 10 years old) for the weekend, but ends up missing his hat which was held by Buster, Andy's dachshund, and the hat is retrieved by Slinky. Afterwards, Andy plays with his toys before leaving, but accidentally breaks Woody's right arm, so his mother decides to leave him on a shelf despite her offering to fix it. At the bookshelf, Woody discovers that Andy's mother is having a yard sale in her yard and takes several old items from Andy's bedroom, including an old rubber penguin named Wheezy. With Buster's help, Woody sneaks out to the yard and saves Wheezy, but falls in the yard and is found by a toy collector, who ends up stealing Woody when Andy's mother refuses to sell him. The thief is recognized by Buzz and the other toys as Al McWhiggin, who is the owner of Al's Toy Warehouse and whom Andy's toys recognize as the \"Chicken Man\" from his TV commercials. To carry out the search mission, Buzz recruits Mr. Potato Head, Slinky, Rex, and Hamm to get out of the house and rescue Woody before Andy returns home. At Al's apartment, Woody discovers that he is a priceless collector's item from \"Woody's Roundup\", a popular 1950s children's show, and meets other toys from the franchise: Jessie the cowgirl, Bullseye, his trusty horse, and Stinky Pete the Prospector, who is still sealed in his box. With the addition of Woody, Al plans to sell the entire \"Woody's Roundup\" collection to a toy museum in Tokyo, Japan, for a large sum of money. However, that same night, Woody's arm breaks when Al takes it out of its case to take some photos, so Al desperately hires the services of an elderly toy repairman to repair Woody's torn arm and touch it up. The other three toys are excited about the trip, but Woody, still Andy's toy and eager to return home, waits only for the toy repairman to fix his arm so he can return to Andy. This causes a disagreement between him and Jessie, who fears being returned and put in a box where she has been for years, since the toy museum would not accept the entire collection without Woody. That night Woody tries to escape with his arm but the television turns on and is then caught by Al, and Woody believes that Jessie turned it on to prevent him from leaving them. The next day, the repairman arrives and repairs his arm, leaving it as good as new. Woody then prepares to return to Andy, but the Prospector convinces him to talk to Jessie before he can leave. Jessie reveals that she had also been a very beloved toy by her owner, a girl named Emily, from whom she was inseparable, until she ended up forgetting her and giving her away when she was a teenager. Shortly after, when Woody was finally getting ready to leave, the Prospector tries to reflect with him for the second time, telling him that Andy is growing up and he couldn't do anything to stop it, also that he must choose between returning and being forgotten or accompanying them and being something forever, being loved and remembered by many generations. Realizing all of this, Woody thinks better of it and decides to stay with the trio. While all this is going on, Buzz and the rest of the group arrive at the toy store that is right in front of Al's house. And just when he separates from the rest of the toys, Buzz runs into a new Buzz Lightyear (who was actually the Buzz from Al's store), and who believes that he is really a space ranger, just as Buzz had believed before. Because the Buzz from the store believes that Andy's Buzz has broken a rule and must be punished, both of them fight and Andy's Buzz ends up being locked in a box, while the other toys end up being confused with the Buzz from the store, as if it were Andy's Buzz (which is why he had a belt on) and although Rex tries to tell him that he has a solution to beat Zurg, without the new Buzz knowing that he was alluding to the video game, which is why he ends up following them. Andy's toys and the new Buzz arrive at the office of the premises, where Al is making a telephone communication with the owner of the Tokyo museum and confirms the payment for the complete collection. And taking advantage of the occasion, the toys enter Al's briefcase, while he excitedly leaves the room. The real Buzz manages to escape from the box and chases after them, however, as he leaves the warehouse he accidentally frees an \"Evil Emperor Zurg\" action figure from its box. The toys enter the vents and reach the elevator of the apartment building and Andy's Buzz catches up with the others, proving to be Andy's real toy as well. They try to return home with Woody, but the latter refuses. Buzz then reminds Woody that a toy is meant to be played with by a child, not watched through glass. Woody initially doesn't accept being abandoned by the other toys, but upon watching a child play with the puppet from the Woody's Roundup show, he comes to his senses and convinces Jessie and Bullseye to become Andy's toys, but Stinky Pete, believing the trip to the museum to be his only chance to be remembered since he was never sold, breaks out of his packaging and secures the grate, trapping Woody, Jessie, and Bullseye helplessly, Woody figuring that it was Prospector who had prevented Woody from escaping by turning on the television the night before. Al then arrives and packs Woody up with the rest of the toys and heads to customs. As Buzz and company try to catch up, they encounter Emperor Zurg and he begins to battle the New Buzz, but Zurg ends up being accidentally defeated by Rex, falling to the bottom of the elevator and Rex emerging victorious by defeating Zurg. Buzz and the others (except the new Buzz who stays with Zurg) board an abandoned Pizza Planet delivery van and chase Al to the airport (in the course of the chase, Mr. Potato Head ends up rescuing three tiny Aliens from Pizza Planet Aliens, who were accessories on the van) where they watch as Al deposits the suitcase (with Woody, Jessie, Bullseye, and Stinky Pete) in the cargo area. Moments later, inside the loading and unloading area, they are attacked by the Prospector, who fights with Woody, breaking his arm again, although fortunately he ends up being defeated by Andy's toys and Woody decides to teach him about the life of a toy by putting him in a little girl's suitcase. Meanwhile, Jessie ends up being boarded on a cargo truck bound for Tokyo, Japan; However, Woody manages to sneak into the truck's van \"by hiding in a briefcase\" and rescue her, however, they almost get trapped inside the trailer when they were about to leave, and the vehicle drives off. Woody asks Jessie to trust him to get out of the place, through an emergency exit hatch that was on one of the sides of the car. Suddenly, Buzz and Bullseye manage to catch up with them and also catch the hat that Woody had dropped (who almost falls to the asphalt, and is tied to the rear bumper and Jessie's arm). Jessie, very scared, tells Woody that his idea was crazy, but Woody asks her to imagine that it is as if it were the final episode of \"Woody's Roundup\" and she agrees, Woody and Jessie jump out of the truck seconds before it enters the highway and end up presumably on the road or in the middle of nowhere. Although they manage to fall on Bullseye and Buzz. The toys soon return to Andy's house, just before Andy returns from camp the next morning, and await his return. Andy first takes Jessie, Bullseye, and the three Pizza Planet Aliens as his five new recruits. The toys learn that Al's business has gone bankrupt due to a failed attempt to sell and deliver the merchandise to the Tokyo museum. While the new toys get used to having a new owner, Mrs. Potato Head adopts the three Pizza Planet Martians, who were rescued by Mr. Potato Head, as her children. A squeaky Wheezy (due to Mr. Shark finding a new squeaker) sings the Frank Sinatra -style song \"You've Got a Friend in Me\", while Woody tells Buzz not to worry about Andy growing up, because when he does, Woody will still have Buzz to keep him company \"To infinity and beyond\". ==Soundtrack== #Woody's Roundup by Riders in the Sky #Hold On, I'm Comin' by The Neville Brothers #Wipe Out by The Surfaris #When She Loved Me by Sarah McLachlan #Pizza Planet Rocks! by Sum 41 #You've Got a Friend in Me by Lyle Lovette ==Cast== * Tom Hanks as Sheriff Woody * Tim Allen as Buzz Lightyear * Joan Cusack as Jessie * Kelsey Grammer as Stinky Pete the Prospector * Frank Welker as Bullseye * Don Rickles as Mr. Potato Head * Jim Varney as Slinky Dog * Wallace Shawn as Rex * John Ratzenberger as Hamm * Annie Potts as Bo Peep * Wayne Knight as Al McWhiggin * John Morris as Andy Davis * Laurie Metcalf as Andy's Mom * Estelle Harris as Mrs. Potato Head * R. Lee Ermey as Sarge * Jodi Benson as Tour Guide Barbie, Amy's Barbie doll * Jonathan Harris as Geri the Cleaner * Joe Ranft as Wheezy, Heimlich * Andrew Stanton as Emperor Zurg * Jeff Pidgeon as Aliens, Mr. Spell * Lee Unkrich as Red Rock 'Em Sock 'Em Robot * John Lasseter as Blue Rock 'Em Sock 'Em Robot * Patrick Warburton as Ultra Buzz Lightyear * Jack Angel as Rocky Gibraltar * Corey Burton as Woody's Roundup Announcer * Hannah Unkrich as Molly Davis * Andi Peters as Luggage Handler 2 * Dave Foley as Flik ==Notes== == References == ==Other websites== * Pixar Wiki: Toy Story 2 Category:1999 movies Category:1999 animated movies Category:1999 comedy movies Category:1999 computer-animated movies Category:1990s buddy movies Category:American sequel movies Category:American buddy comedy movies Category:1990s sequel movies Category:English-language movies Category:Movies composed by Randy Newman Category:Pixar movies Category:Toy Story Category:3D re-releases Category:American 3D animated movies Category:Movies directed by John Lasseter Category:American family comedy movies Category:Adventure comedy movies Category:Movies set in the 1990s",
 "title": "Toy Story 2"
}