{
 "id": "695362",
 "text": "The following is a list of territories where English is an official language. As of 2019, there were 55 sovereign states and 27 non-sovereign states where English was an official language. ==Overview== ===British Empire=== Most countries where English is a prominent or official language are former colonies of the British Empire. Notable exceptions include Rwanda, which was a former Belgian colony, and Eritrea, which was an Italian colony where the British Empire controlled it only in World War II and shortly after (19411952). English is the sole official language of the Commonwealth of Nations and the Commonwealth Games. ===International organizations=== English is one of the official languages of the United Nations, the European Union and the International Olympic Committee. ===United States=== Although English is not classified as an official language in the United States, many states and regions within the U.S. do have English as an official language. ===India=== India's linguistic picture is complex. According to the Constitution of India, \"Hindi in the Devanagari script\" is the official language of the union; and English the 'subsidiary official language'; however, English must be used for the official texts of all federal laws and Supreme Court decisions (with Hindi). It is one of the two languages of the Indian Parliament. English is taught in schools. The quality and effectiveness of the teaching is very varied.English language education in rural schools of India: the situation, the policy and the curriculum. British Council, Teaching English English is used almost exclusively for higher education. ===Pakistan=== The situation of Pakistan is also complex. While the national language is Urdu, English is an official language and used in business, government and law. ==Sovereign states== Countries where English is a de facto official language Country Region Population Primary language? Oceania 25,019,600 Yes Oceania 4,893,830 Yes Europe 66,040,229 Yes North America 325,719,178 Yes Countries where English is a de jure official language Country Region Population Primary language? Official language; Caribbean 85,000 Yes Caribbean 331,000 Yes Caribbean 294,000 Yes English usage; Central America 288,000 Yes Africa 1,882,000 No Africa 10,114,505 No Africa 22,534,532 No North America 35,985,751 Yes (except Quebec, northern New Brunswick and Nunavut) Oceania 20,000 Yes Caribbean 73,000 Yes Africa 1,141,000 No Oceania 828,000 Yes (used as lingua franca, mostly and widely spoken, educational, commerce, and government) Africa 1,709,000 No Africa 27,000,000 Yes (used as lingua franca) Caribbean 111,000 Yes (except for small French Creole population) South America 738,000 Yes Asia 1,247,540,000 No (but official and educational) The Constitution Europe 4,900,000 Yes (Irish is co-official) The Constitution of Jamaica (section 20(6e) ? implicit) Caribbean 2,714,000 Yes Africa 45,010,056 Yes (in business and education) Oceania 95,000 No Africa 2,008,000 No Africa 3,750,000 Yes Africa 16,407,000 No Europe 430,000 No (but official and educational) Oceania 59,000 No Africa / Indian Ocean 1,262,000 No Oceania 110,000 No Africa 2,074,000 No (used as lingua franca) English and Nauruan are official. Oceania 10,000 No Africa 182,202,000 Yes (used as lingua franca) Oceania 1,600 No Asia 199,085,847 No (but official and educational) Oceania 20,000 No Oceania 7,059,653 No (See Article XIV, Section 7) Asia 102,885,100 No (but official and educational) Africa 11,262,564 No (but official and educational) Caribbean 50,000 Yes Caribbean 165,000 Yes Caribbean 120,000 Yes Languages for official legislation are Samoan and English. Oceania 188,000 No Africa / Indian Ocean 87,000 No Africa 6,190,280 Yes Asia 5,469,700 Yes (used as lingua franca, mostly and widely spoken, and educational) Oceania 507,000 No Africa 54,956,900 No (but official, educational and lingua franca in formal economy ) Africa 12,340,000 No Africa 40,235,000 No Africa 51,820,000 No English and Tongan are listed as official. Oceania 100,000 No Caribbean 1,333,000 Yes Oceania 11,000 No Africa 37,873,253 No (official and educational) Oceania 226,000 No Africa 16,212,000 No Africa 13,061,239 No (used as lingua franca) Countries where English is a de facto official language, but not primary language Country Region Population Asia / Middle East 1,378,000 \"[T]eaching of English continued in primary, secondary and tertiary level not because it was the official language but it became thelanguage of trade and commerce. Over the years, the prominence of English continued to rise. ... English language is dominantly present in every side of our national life while on the other hand in our constitution it is clearly declared that the language of the country is Bengali. In fact, nothing is said about the status of English language in our constitution. On one hand, economic activities in the private companies are carried out in English while there is a government law (Bengali procholon ain1987) that government offices must use Bengali in their official works. So from the government point of view Bengali is the national-official language of Bangladesh and English is the most important foreign language. But in reality English is the second language of the country and in many places English is more important than Bengali in Bangladesh.\" https://www.scribd.com/doc/53272796/Sucess-of-English-language- in-Bangladesh-rec Asia 150,039,000 English is a \"Statutory national working language.\" Lewis, M. Paul, Gary F. Simons, and Charles D. Fennig (eds.). 2013. \"Brunei.\" Ethnologue: Languages of the World, Seventeenth edition. Dallas, Texas: SIL International. Online edition: https://www.ethnologue.com/country/BN Accessed 30 March 2014.Under the constitution of 1959, Malay is the official language of Brunei; but English may be used \"for all official purposes.\" Laws are written in English and Malay, with the English version being the authoritative one. Asia 415,717 Europe, Asia / Middle East 1,141,166 Africa 6,234,000 Africa 85,000,000 North America 56,367 Europe 366,425 Asia / Middle East 8,051,200 \" English, though without official status, is widely spoken throughout the country and is the de facto language of commerce and banking, as well as a co-official status in the education sector; almost all university-level classes are held in English and almost all public schools teach English along with Standard Arabic.\" Asia / Middle East 9,882,401 \" English is widely spoken. It is used in business and is a compulsory second language in schools.\" Asia / Middle East 4,348,395 \"English remains an active second language, and serves as the medium of instruction for maths and sciences in all public schools. Malaysian English, also known as Malaysian Standard English, is a form of English derived from British English. Malaysian English is widely used in business, along with Manglish, which is a colloquial form of English with heavy Malay, Chinese, and Tamil influences. The government discourages the misuse of Malay and has instituted fines for public signs that mix Malay and English.\" Asia 30,018,242 \"Other languages spoken in Maldives include English, which is also recognized as the second main language. Initially, Dhivehi was used as the medium of teaching in schools, but the need to promote higher education led to the conversion of syllabus in English. Now, English is widely spoken by the locals of Maldives.\" Asia 427,756 Lintner, Bertil (2003), \"Myanmar/Burma\", in MacKerras, Colin, Ethnicity in Asia, Routledge, Asia 51,486,253 Asia / Middle East 2,675,522 English is a \"De facto national working language, used in government.\" Lewis, M. Paul, Gary F. Simons, and Charles D. Fennig (eds.). 2013. \"Sri Lanka.\" Ethnologue: Languages of the World, Seventeenth edition. Dallas, Texas: SIL International. Online edition: https://www.ethnologue.com/country/LK Accessed 30 March 2014.Under the constitution of 1978, Sinhala and Tamil are the official languages of Sri Lanka, but English is \"the link language.\" Any person is entitled \"to receive communications from, and to communicate and transact business with, any official in his official capacity\" in English, to receive an English translation of \"any official register, record, publication or other document,\" and \"to communicate and transact business in English.\" English translations must be made for \"all laws and subordinate legislation,\" \"all Orders, Proclamations, rules, by-laws, regulations and notifications.\" Asia 20,277,597 Asia / Middle East 5,779,760 ==Non-sovereign entities== Non- sovereign entities where English is a de jure official language Entity Region Population Primary language Europe 15,700 No Oceania 67,700 No Caribbean 13,101 Yes North America 65,000 Yes Caribbean 23,000 Yes Caribbean 47,000 Yes Caribbean 150,563 No South Atlantic 3,000 Yes Europe 33,000 No Oceania 173,000 No (<50% of population) Asia 7,097,600 No (Cantonese mostly spoken) Europe 80,058 Yes Europe 89,300 Yes Australia 1,828 Yes Oceania 53,883 No Oceania 50 Yes Caribbean 3,991,000 No (Spanish is the primary language) According to Art. 1 para 2. Constitution of Sint Maarten : \"The official languages are Dutch and English\" Caribbean 40,900 Yes Caribbean 26,000 Yes Caribbean 111,000 Yes Non-sovereign entities where English is a de facto official language Entity Region Population Indian Ocean 3,000 Europe 61,811 Caribbean 5,900 South Atlantic 5,660 Non-sovereign entities where English is a de facto official, but not primary, language Entity Region Population Australia 1,508 Australia 596 Oceania 1,400 ==Country subdivisions== In these country subdivisions, English has de jure official status, but English is not official in their relevant countries at the national level. Country subdivisions where English is a de jure official language Subdivision Country Region Population North America 4,833,722 North America 735,132 North America 6,626,624 North America 2,959,373 North America 38,332,521 North America 5,268,367 North America 19,552,860 North America 9,992,167 Oceania 1,404,054 North America 1,612,136 North America 12,882,135 North America 6,570,902 North America 3,090,416 North America 2,893,957 North America 4,395,295 North America 4,670,724 North America 6,794,422 North America 2,991,207 North America 6,083,672 North America 1,015,165 North America 1,868,516 North America 1,323,459 North America 9,848,060 North America 723,393 Europe 1,876,695 North America 3,850,568 English can be used in relations with the government Caribbean 1,991 South America 75,167 Asia 2,471,140 Europe 5,424,800 Caribbean 3,897 North America 4,774,839 North America 844,877 North America 6,495,978 North America 27,469,114 North America 2,900,872 North America 8,260,405 Europe 3,125,000 North America 1,844,128 North America 582,658 ==Related pages== *Anglo-America *Commonwealth of Nations *British Overseas Territories *English-speaking world *List of countries by English-speaking population *British Empire ==Footnotes== : The population figures are based on the sources in List of countries by population, with information as of 23 January 2009 (UN estimates, et al.). : In 2025, President Donald Trump signed an executive order to make English the official language of the U.S., but executive orders do not apply to the entire government and are not laws. :Hong Kong is a former British Crown colony (1843-1981) and British Dependent Territory (1981-1997); it is currently a Special Administrative Region of the People's Republic of China (1997- present) :Puerto Rico is, historically and culturally, connected to the Spanish-speaking Caribbean; Spanish is also an official language on the island. Puerto Rico is an unincorporated United States territory referred to as a \"Commonwealth\" :Guam is an organized unincorporated territory of the United States :The US Virgin Islands is an insular area of the United States :Jersey is a British Crown dependency :The Northern Mariana Islands is a commonwealth in political union with the United States :Isle of Man is a British Crown dependency :Bermuda is a British Overseas Territory :Guernsey is a British Crown dependency :American Samoa is an unincorporated U.S. territory :Christmas Island is an external territory of Australia :Pitcairn Islands is a British Overseas Territory :The Cook Islands and Niue are associated states of New Zealand that are not really known. :Cocos (Keeling) Islands is an external territory of Australia ==References== * Countries Category:Language-related lists Category:Lists of countries",
 "title": "List of territorial entities where English is an official language"
}