{
 "id": "695727",
 "text": "Lifeline Theatre started in Chicago, Illinois, United States, in 1983. Five Northwestern University graduates started the theater group. They moved to Rogers Park—a converted Commonwealth Edison substation— in 1986. This includes a 99-seat theater, rehearsal and office space, a scene shop, and costume, prop, and scenery storage. == Awards == === Chicago/Illinois awards === Since 1986, Lifeline members have received 48 Joseph Jefferson Awards. === National awards === Member Meryl Friedman won the 1999 Distinguished Play Award in the Elementary Category from the American Alliance of Theatre and Education for her adaptation of Journey of the Sparrows, produced at Lifeline in 1996. The American Alliance for Theater and Education awarded Lifeline the 2003 Sara Spencer Artistic Achievement Award for sustained and successful achievement in the field of theater for young audiences. == Production History == Lifeline Theatre's work includes MainStage productions: * Pride and Prejudice * The Overcoat * The Left Hand of Darkness * The Talisman Ring * Jane Eyre * Cat's Cradle * Around the World in 80 Days * The Killer Angels * A Room with a View * The Island of Dr. Moreau * The Mark of Zorro * Treasure Island * Neverwhere * The Moonstone * Watership Down * The Count of Monte Cristo Family MainStage productions have included: * A Wrinkle in Time * Lizard Music * The Snarkout Boys and the Avocado of Death * The Phantom Tollbooth * Journey of the Sparrows * The Silver Chair * Johnny Tremain In 1986 Lifeline started its KidSeries program. Productions have included: * Mr. Popper's Penguins * Mike Mulligan and His Steam Shovel * Bunnicula * James and the Giant Peach * The Story of Ferdinand * Mrs. Piggle-Wiggle * My Father's Dragon * Click Clack Moo: Cows That Type * The Stinky Cheese Man * Duck for President * The True Story of the 3 Little Pigs! * The Velveteen Rabbit * The Last of the Dragons * Arnie the Doughnut. == Players == Lifeline Theatre's members are: Patrick Blashill, Christina Calvit, Victoria DeIorio, Alan Donahue, Kevin D. Gawley, Peter Greenberg, James E. Grote, Chris Hainsworth, John Hildreth, Paul S. Holmquist, Elise Kauzlaric, Robert Kauzlaric, Frances Limoncelli, Katie McLean Hainsworth, Dorothy Milne (Artistic Director), Shole Milos, Sandy Snyder Pietz, Suzanne Plunkett, Phil Timberlake, Jennifer Tyler, Christopher M. Walsh, and Elizabeth Powell Wislar. Emeritus members include: Eric Lane Barnes, Meryl Friedman, Rebecca Hamlin, James Sie, and Steve Totland. ==References== ==Other websites== *Lifeline Theatre official website Category:Chicago Category:Theater",
 "title": "Lifeline Theatre"
}