{
 "id": "696568",
 "text": "The 2020 Belizean general election elected the members of the House of Representatives in the National Assembly. On 14 March 2017, Prime Minister of Belize, Dean Barrow stated that he would call for early elections in November 2019. But in March 2018, Barrow pushed back and set it for 13 February 2020. On 22 May 2019, Barrow insisted that there would be no General election before 1 November 2020 in Belize. ==Date== ===Deadline=== The deadline for nominations was 21 October 2020, with political campaigning lasting for four weeks until Polling day on 11 November 2020. On the Day of the Election, Polling across the Country opened from 7 am, and closed at 10 pm. It was the third to be held in November since 1979. ===Eligibility=== Individuals eligible to vote have to be registered to vote by Midnight on 26 September 2020. To be eligible to vote, Individuals had to be aged 18 or over; residing as a Commonwealth citizen at an address in Belize, or a Belizean citizen overseas who registered to Vote in the last 15 years and not legally excluded (on grounds of detainment in Prison, a Mental hospital, or on the run from Law enforcement) or disqualified from Voting. Anyone who qualified as an Anonymous elector will have until midnight on 26 October to Register. ===Previous election=== The previous general election was held on 4 November 2015, and the new National Assembly was opened on 13 November 2015, which was also the date that the first sitting of the National Assembly of Belize began after the 2015 Belizean general election. According to Section 84 of the Constitution of Belize, the National Assembly of Belize (House of Representatives and Senate) must be dissolved every “five years from the date when the two Houses, first met” unless dissolved sooner by the Governor-General of Belize upon the advice of the Prime Minister. A general election must be called within three months of a dissolution, meaning the latest possible date for Barrow to call the next Belizean general election is on 13 February 2021. If by any chance the next Belizean general election is not held by 13 February 2021, Barrow may be forced to vacate the office of Prime Minister, however he may still remain as Leader of the United Democratic Party (UDP), but he will have to make a Snap! decision on a Caretaker Prime Minister of Belize to formally announce a date for the next general election. The Caretaker Prime Minister must be from the ruling, UDP and must also be a Cabinet minister in government. Despite the five-year term of the National Assembly, three of the last four general elections have been called at least a year early. Both Prime Minister, Dean Barrow and Leader of the Opposition, Johnny Briceño of the People’s United Party (PUP) are on record supporting lowering the maximum five-year term of the National Assembly of Belize to four years. This was also one of the promises that Briceño promised the People of Belize should the PUP be elected in the next election. ===Leadership=== Barrow first declared on 1 March 2016 that he would be stepping down as Prime Minister on 13 February 2020 and was finding a suitable successor. He also told the Media that the next election is likely to be held in early 2020 and also scheduled a UDP Leadership convention and election in May 2019. His remarks came as he was being questioned about the then pending United Democratic Party First Deputy Leadership election and convention. On 1 April 2017, at the Belize Chamber of Commerce and Industry annual general meeting Barrow narrowed down his departure as Prime Minister to less than a year and stated that he will retire in March 2018. He also narrowed down the date of the Leadership convention to 13 February 2018. He also declared that “Since this will be my last opportunity to address your annual gathering, I close by saying how thankful I am for what has in the main been a constructive relationship with the Chamber”. In early 2017, Barrow was ailing with excruciating back pain; a serious condition that he was enduring for some time. He could barely sit upright without visible signs of pain on his face, It is understandable then, that in such a poor and un-stabilised state of health he would welcome retirement. But on 1 September 2018, things changed, after enduring the back pain for more than a year, Barrow went to Cuba and requested the Doctors in a hospital there to perform a Spinal Surgery. The Cuban Doctors did as they were told by Barrow and they also did a phenomenal job. The surgery was a success and after one week of rest and recovery, Barrow returned to perfect health. So after the surgery was over, Barrow rescheduled his retirement once again this time to December 2019 and hinted he could do so earlier and also rescheduled the date for the UDP’s Leadership convention back to May 2019. On 18 November 2018, Barrow’s cabinet urged him to remain as Prime Minister until the 2020 general election. They also urged him to remain as Leader of the UDP until February 2020. He said he will take that move and eventually for the final time, rescheduled the convention to February 2020. On 4 December 2018, Minister of Human Development and Minister of Social Transformation, Anthony Martinez revealed to the media on why he and the Cabinet urged Barrow to remain as Prime Minister until 2020. Martinez stayed on course saying that Barrow ultimately took the decision and that the goal is for the currently leadership to take the UDP into a fourth term in government. A fourth term will be historic for the UDP as no political party in post-independence Belize has ever had a fourth term. Plus this will also be a major upset for the majority of Belizeans who were expecting the PUP to win at the next election. ==Background== ===Contesting parties=== With the exception of the Belize Progressive Party, led by Patrick Rogers in the 2015 elections, all parties were contesting under first-time leaders. Party Position Ideology Leader Slogan and Manifesto Campaign Song United Democratic Party (UDP) Centre-right Conservatism Patrick Faber \"Because YOUR Future Matters\" \"Your Future Matters!\" \"Staying with the UDP\" People's United Party (PUP) Centre to centre-left Christian democracy Social democracy Nationalism Johnny Briceño \"#PlanBelize\" \"Vote BLU, Everybody fi win\" (Todos Ganamos)\" Belize Progressive Party (BPP) Centre-left to left-wing Social democracy Reformism Republicanism Patrick Rogers \"Changing the system in Belize\" \"For Progress! BPP for Belize!\" Belize People's Front (BPF) Centre to centre-left Progressivism Christian democracy Nancy Marin \"Breaking Corruption. Building a Nation.\" \"Time fi mek di change\" \"BELIZE\" ==References== Belizean Category:Elections in Belize Category:General elections",
 "title": "2020 Belizean general election"
}