{
 "id": "696595",
 "text": "== Main Info == The Kingdom of Kquoja, also known as Koya, Koya Temne, or the Temne Kingdom (1505–1896), was a pre-colonial African state situated in the northern region of present-day Sierra Leone, with its original capital at Robaga (No Longer Exists) Near Modern day Freetown. The kingdom was founded by the Temne ethnic group, who were migrants from the north, arriving in the area around 1505. These migrants sought to establish trade networks with the Portuguese traders operating along the southern coast, which became a fundamental motivation for their settlement and the kingdom’s subsequent development. The kingdom was governed by a Monarch known as a Bai or Obai, whose authority extended over a network of sub-kingdoms ruled by nobles titled \"Gbana\". This decentralized structure allowed the kingdom to manage its vast territory and diverse population effectively. Throughout its history, Koya maintained diplomatic and commercial relations with both European powers and neighboring African states. Notably, the kingdom engaged in trade with Islamic states to its north, incorporated Muslims within its borders, and fostered connections with the British and French as early as the 18th century. == Prior to Migration == The Temne people are believed to have migrated from the Futa Jallon region of Guinea, likely fleeing Fula jihads in the 15th century. They then settled in the Sierra Leone region, particularly the area between the Kolenté and Rokel River. While the exact timeline is not precisely known, their presence in Futa Jallon is thought to date back to the 1460s. === Cause of Migration === In the 14th Century, Tenguella (a Fula Leader) served as both a religious and political leader (silatigi) among the Fula people in Futa Toro. In response to pressure from the expanding Jolof Empire during the 1450s, he led a migration eastward, where he founded the state of Futa Kingi within the territory of the Kingdom of Diarra. Using Futa Kingi as his base, Tenguella extended his influence by launching military campaigns into surrounding regions and disrupting established trade networks. His son, Koli, was later sent to Futa Jallon to rally the local Fula population in resistance against Mande control. From this, The Temne was most likely Caught in the cross fire and migrated Southwest. ==== Portuguese Interaction ==== Apon Arrival to North Sierra leone, The Temne began trading with the Portuguese in the late 15th century as Portuguese explorers and traders sailed along the West African coast seeking routes to India and China. The first documented contacts between the Portuguese and the Temne are recorded in the memoirs of explorers such as Valentim Fernandes and Pacheco Pereira, who described Temne society and culture as early as 1505–1508. These Portuguese records mention Temne words for gold, water, and rice, and note that the Temne lived in communities near water, practiced local religious customs, and had organized village courts The events of migration, trade and other systems had eventually caused the Temne to establish the Kingdom of Koya Which was Situated North of Sierra leone, Spreading southwards more and eventually making Either Robaga (According to Elders and Scholars) or Cape Mount their capital. == The Slave Trade == The Kingdom of Koya became involved in the Atlantic slave trade, though this participation was generally more decentralized than in many other West African kingdoms. While the central royal authority sometimes attempted to regulate or even oppose the trade, many local subjects engaged in the sale of enslaved people directly with European traders on the coast, often acting independently of the state. This dynamic made it difficult for the Bai and other leaders to control the extent or impact of the trade within their territories. Despite the pressures of the slave trade, Koya maintained a degree of autonomy and influence in the region. The kingdom continued to interact with European powers, notably signing a treaty in the late 18th century that allowed for the establishment of a British colony on the Sierra Leone peninsula. However, conflicts with the British and neighboring groups, such as the Susu, Led to territorial set backs and a Distruption in Koya’s power. The Exact Number of Slaves that were taken from Modern day Sierra Leone is not known, but Annual exports in the late 18th century show About 3,000 per year Came from the Nunez River to Sherbro (within Sierra Leone), And Annual exports from Senegambia and Sierra Leone combined With About 7,000 per year in the 1780s == Naimbanna II == Naimbanna II (c. 1720 – 11 November 1793) was Obai (King) of the Temne people of Sierra Leone. He was known to be a kind ruler. Naimbanna II led the Koya Kingdom during a period of significant hopes for modernization and interaction with European powers, particularly the British, who sought to establish settlements in the region. In 1786, the British government agreed to help the Committee for the Relief of the Black Poor in relocating freed Africans to West Africa, and intended to purchase land from the Temne people. An initial agreement was made without Naimbanna's full knowledge with one of his local chiefs, Tombo (called \"King Tom\" by the British), to cede land for what became known as the Province of Freedom. Tombo, unable to read or write, was likely unaware of the full implications of the treaty. After Tombo's death, Naimbanna became aware of the details and requested a new treaty, which was signed in 1788. Agents of the Sierra Leone Company negotiated with Naimbanna in 1788 and persuaded him to sign over some of his land for the Company’s settlement. Naimbanna later expressed concerns that the deal had been negotiated too hastily and should not have been given consent. Despite these misgivings, he maintained a pragmatic approach, seeking both to benefit from the new colony’s opportunities and to retain his authority as the rightful leader of the region. Naimbanna II was notable for his openness to Western education and influence. In 1791, he sent his eldest son, John Frederick Naimbanna, to England to be educated under the sponsorship of abolitionist Granville Sharp and reformer Henry Thornton. While in London, his son became a Christian and adopted the forenames Henry and Granville as a tribute to his mentors. Naimbanna also sent another son, Pedro, to France for education. Despite his efforts to foster good relations with the British, cordial relations did not last. Naimbanna II died in 1793, as did his son John Frederick Naimbanna, who died while returning to Sierra Leone from England. == Battle of Port Loko & The Northern Coast == From 1801 to 1807, Koya fought a war with British colonists and the Susu Koya lost the northern shoreline of Sierra Leone to the British and Port Loko to the Susu. However, they remained a power in the region. In 1815, the Temne fought another war with the Susu and regained the Port & Coast. In 1841, the Temne defeated the Loko of Kasona on the Mabaole River dispersing many of the people. In response to a British bombardment, the kingdom expelled the Church Missionary Society missionaries operating at Magbela in 1860. The kingdom became a British protectorate August 31, 1896. At that point the Koya kings lost almost all power. Revolts of the Temne and Mende in 1898 were fierce but futile. The British would govern the area of the former kingdom until 1961. == References == * J. D. Fage, John E. Flint, John Desmond Clark et al.: The Cambridge History of Africa. Cambridge University Press, 1976, ISBN 0-521-20701-0, S. 174ff. * Adam Jones: The Kquoja Kingdom: A Forest State in Seventeenth Century West Africa. In: Paideuma. 29, 1983, S. 23–43. * Kenneth C. Wylie: The political kingdoms of the Temne. Africana Pub, 1977, ISBN 0-8419-0149-X Stewart, John (1989). African States and Rulers. London: McFarland. p. 155. ISBN 0-89950-390-X. Category:Former monarchies of Africa",
 "title": "Kingdom of Koya"
}