{
 "id": "696657",
 "text": "KylieFever2002 was the seventh concert tour by Australian singer Kylie Minogue. The tour was created to promote her eighth studio album, Fever (2001). It began in Cardiff, Wales on 26 April 2002 and ended on 16 August 2002 in Melbourne, Australia. == Background == At the time, KylieFever2002 was the biggest tour Minogue had created. The album and its music videos were able to provide and inspire multiple stage sets and costume changes. It also had a much larger budget than past tours, due to the success of the album and its singles. The tour was sponsored by Evian, a brand of mineral water, and Vodafone, a mobile phone network operator. At each of the shows in the United Kingdom, Evian provided free bottles of their water with the name 'Kylie' written on them. A special webcast of a show at the Manchester Evening News Arena was shown on MSN UK live for fans across the world. == Set list == Act 1: Silvanemesis # \"The Sound of Music\" (introduction) # \"Come into My World\" # \"Shocked\" (contains \"Madskillz-Mic Chekka\") # \"Love at First Sight\" # \"Fever\" Act 2: Droogie Nights # \"Symphony No. 9, Op. 125 (Ode to Joy)\" (interlude) # \"Spinning Around\" (contains \"September\") Act 3: The Crying Game # \"Where Is the Feeling?\" (interlude) # \"The Crying Game\" / \"Put Yourself in My Place\" (contains \"Teardrop\") / \"Finer Feelings\" / \"Dangerous Game\" / \"The Crying Game\" Act 4: Street Style # \"GBI: German Bold Italic\" (interlude) # \"Confide in Me\" # \"Cowboy Style\" (contains \"Double Dutch Bus\", \"Double Dutch\", \"Buffalo Gals\" and \"The Real Slim Shady\") # \"Kids\" Act 5: Sex in Venice # \"On a Night Like This\" # \"The Locomotion\" # \"In Your Eyes\" / \"Please Stay\" / \"Rhythm of the Night\" / \"In Your Eyes\" Act 6: Cybertronica # \"Cybertronica\" (interlude) # \"Limbo\" # \"Light Years\" / \"I Feel Love\" # \"I Should Be So Lucky\" (contains \"Dreams\") Act 7: Voodoo Inferno # \"Burning Up\" # \"Better the Devil You Know\" Encore # \"Can't Get You Out of My Head\" (contains \"Blue Monday\") == Tour dates == Date City Country Venue Europe 26 April 2002 Cardiff Wales Cardiff International Arena 27 April 2002 28 April 2002 29 April 2002 1 May 2002 Manchester England Manchester Evening Arena 2 May 2002 3 May 2002 4 May 2002 6 May 2002 Birmingham NEC Arena 7 May 2002 8 May 2002 9 May 2002 11 May 2002 Manchester Manchester Evening News Arena 12 May 2002 14 May 2002 Sheffield Sheffield Arena 15 May 2002 17 May 2002 Glasgow Scotland SECC Concert Hall 4 18 May 2002 19 May 2002 21 May 2002 Newcastle England Telewest Arena 22 May 2002 24 May 2002 London Wembley Arena 25 May 2002 26 May 2002 27 May 2002 30 May 2002 Stockholm Sweden Hovet 31 May 2002 Oslo Norway Oslo Spektrum 1 June 2002 Copenhagen Denmark Forum Copenhagen 3 June 2002 Munich Germany Olympiahalle 4 June 2002 Vienna Austria BA-CA Halle 6 June 2002 Zürich Switzerland Hallenstadion 8 June 2002 Berlin Germany Velodrom 9 June 2002 Hamburg Alsterdorfer Sporthalle 11 June 2002 Frankfurt Festhalle Frankfurt 12 June 2002 Rotterdam Netherlands Sportpaleis van Ahoy 13 June 2002 Oberhausen Germany König Pilsener Arena 15 June 2002 Paris France Palais Omnisports de Paris-Bercy 18 June 2002 Milan Italy Mediolanum Forum Australia 2 August 2002 Sydney Australia Sydney Entertainment Centre 3 August 2002 4 August 2002 6 August 2002 7 August 2002 8 August 2002 11 August 2002 Melbourne Rod Laver Arena 12 August 2002 14 August 2002 15 August 2002 16 August 2002 == References == Category:Concerts Category:Concert tours",
 "title": "KylieFever2002"
}