{
 "id": "696609",
 "text": "{{Infobox settlement | name = Colchagua | official_name = | native_name = Provincia de Colchagua | native_name_lang = es | settlement_type = Province of Chile | image_skyline = Gobernación Provincial de Colchagua (Ex Intendencia), 2005.jpg | image_alt = Government of Colchagua's headquarters | image_caption = Government of Colchagua's headquarters | nickname = | image_seal = | motto = | image_map = Mapa No. 19. Provincia de Colchagua-7930026 (cropped).jpg | mapsize = | map_alt = Colchagua Province | map_caption = Colchagua Province in 1903 | pushpin_map = Chile | coordinates = | subdivision_type = Country | subdivision_name = | parts_type = Comunas | parts_style = para | parts = 15 (See list) | p1 = | established_title = | established_date = | seat_type = Capital | seat = San Fernando | government_footnotes = | government_type = Provincial | leader_party = | leader_title = Intendant | leader_name = Hernán Rodríguez (1975, final) | unit_pref = | area_footnotes = | area_total_km2 = | elevation_footnotes = | elevation_m = | population_footnotes = | population_total = | population_as_of = | population_density_km2 = | population_demonym = | population_blank1_title = | population_blank1 = | demographics_type1 = | demographics1_footnotes = | demographics1_title1 = | demographics1_info1 = | timezone = CLT | utc_offset = -4 | timezone_DST = CLST | utc_offset_DST = -3 | postal_code_type = | postal_code = | area_code_type = | area_code = | website = | footnotes = }} The historical province of Colchagua was one of the regions of Chile, between 1826 and 1976. Its capital was located in San Fernando during most of its existence. For some years, Curicó and Rancagua were capitals of Colchagua. ==History== The province of Colchagua was one of the eight provinces of Chile (Coquimbo, Aconcagua, Santiago, Colchagua, Maule, Concepción, Valdivia, and Chiloé) created by the federal laws of 31 January 1826. Its territory comprised former delegations of Colchagua, Curicó and Talca.V. Pérez-Rosales, 1857. \"Essai sur le Chili\". Hambourg : F.H. Nestler & Melle, 1857. 455 p. The province was sanctioned by the 1828 Constitution. During its early years, Colchagua was divided into the departments of San Fernando (cap. San Fernando), Curicó (cap. Curicó), and Talca (cap. Talca). In 1833, a new Constitution reorganized the country, creating departments, subdelegations and districts as lower entities of provinces. Later that year, by law dated August, the department of Talca was separated to create the province of Talca, and in 1834, the department of Caupolicán was created, with Rengo as its capital. Although the title of provincial capital was disputed by San Fernando, Curicó and Talca a September 1840 decree established San Fernando as the capital. In 1865, the department of Curicó was separated from Colchagua, in order to create the province of Curicó. On 17 September 1925, by Law Decree N.° 529, the department of San Vicente was created, separated from Caupolicán. In 1928, the government of Carlos Ibáñez del Campo decided to reorganize the provinces of Chile, by Decree with Law Force N.° 8.582 dated 28 January 1929. The new province of Colchagua incorporated the departments of Rancagua (cap. Rancagua) and Cachapoal (cap. Peumo), originally from the province of O'Higgins, and the department of Santa Cruz (cap. Santa Cruz), which belonged to the province of Curicó.LeyChile, Norma 5656, Version 1928-02-01, DFL 8582: Decreto que fija la nueva división territorial de la República, Ministerio del Interior de Chile, accessed 15 Nov. 2014 Because of public discontent, the former provinces of O'Higgins and Colchagua were re-established by Law 5.376, in January 1934. Colchagua kept the departments of San Fernando and Santa Cruz. In 1973, under the government of Salvador Allende, the department of Cardenal Caro was created (cap. Marchigüe). In July 1974, a new reform took place, directed by the military dictatorship of Augusto Pinochet, who created regions. On 1 January 1976, the new VI Región (Sixth Region) came into existence, with the territory of former provinces of O'Higgins and Colchagua. Former departments of San Fernando, Santa Cruz and Cardenal Caro were supressed. In 1979, the region was renamed VI Región del Libertador General Bernardo O'Higgins (Sixth Region of Liberator General Bernardo O'Higgins, in short, Region of O'Higgins). Its territory comprises current provinces of Cachapoal, Colchagua and Cardenal Caro. ==References== Category:Regions of Chile",
 "title": "Colchagua (historical province)"
}