{
 "id": "697442",
 "text": "\"Bad Guy\" (stylized in lowercase) is a song recorded by American singer Billie Eilish. It is featured on her second album, When We All Fall Asleep, Where Do We Go?. Eilish co-wrote the song with her brother Finneas, who produced it. The song reached the top of the charts in Australia, Canada, and the US. \"Bad Guy\" is mostly an electroscopic song but features a trap music breakdown in the last 33 seconds of the song. It features finger snaps and clicks throughout the song. On July 11, 2019, Eilish released a remix of the song with Canadian singer Justin Bieber. He tweeted, \"Remix\" a few days before this version's release. On August 19, 2019, Billboard announced that \"Bad Guy\" had reached the top of the Hot 100 in the US, after spending nine weeks at number two. This made Eilish the first artist born in the 21st century to get a number-one song. At the 62nd Annual Grammy Awards on January 26, 2020, the song won Record of the Year and Song of the Year. It was nominated for Best Pop Solo Performance but lost to \"Truth Hurts\" by Lizzo. ==Charts== ===Weekly charts=== Chart (2019–2020) Peak position Argentina (Argentina Hot 100) 20 Brazil (Top 100 Brasil) 84 China Airplay/FL (Billboard) 3 Croatia (HRT) 15 Colombia (National-Report) 22 Ecuador (National-Report) 40 Estonia (Eesti Ekspress) 1 Global 200 (Billboard) 55 Greece (IFPI) 1 Iceland (Tonlist) 1 Japan (Japan Hot 100) 7 Latvia (LAIPA) 1 Lithuania (AGATA) 1 Luxembourg Digital Songs (Billboard) 3 Malaysia (RIM) 2 Paraguay (SGP) 53 Mexico Ingles Airplay (Billboard) 1 Romania (Airplay 100) 41 Serbia (Radiomonitor) 2 Singapore (RIAS) 5 South Korea (Gaon) 5 US Billboard Hot 100 1 US Rolling Stone Top 100 3 ===Monthly charts=== Chart (2019) Peak position Brazil Streaming (Pro-Música Brasil) 46 Russia Airplay (Tophit) 1 Ukraine Airplay (Tophit) 10 ===Year-end charts=== Chart (2019) Position Australia (ARIA) 3 Austria (Ö3 Austria Top 40) 2 Belgium (Ultratop Flanders) 4 Belgium (Ultratop Wallonia) 6 Canada (Canadian Hot 100) 3 CIS (Tophit) 3 Denmark (Tracklisten) 5 France (SNEP) 19 Germany (Official German Charts) 6 Hungary (Dance Top 40) 28 Hungary (Rádiós Top 40) 29 Hungary (Single Top 40) 2 Ireland (IRMA) 3 Japan (Japan Hot 100) 71 Latvia (LAIPA) 1 Netherlands (Dutch Top 40) 58 Netherlands (Single Top 100) 13 New Zealand (Recorded Music NZ) 3 Paraguay (SGP) 53 Poland (ZPAV) 61 Portugal (AFP) 4 Russia Airplay (Tophit) 2 South Korea (Gaon) 14 Sweden (Sverigetopplistan) 5 Switzerland (Schweizer Hitparade) 6 Ukraine Airplay (Tophit) 47 UK Singles (OCC) 4 US Billboard Hot 100 4 US Adult Top 40 (Billboard) 23 US Dance/Mix Show Airplay (Billboard) 12 US Mainstream Top 40 (Billboard) 8 US Rock Airplay (Billboard) 13 US Rolling Stone Top 100 5 Chart (2020) Position Argentina Airplay (Monitor Latino) 92 Australia (ARIA) 22 Austria (Ö3 Austria Top 40) 29 Belgium (Ultratop Flanders) 64 Belgium (Ultratop Wallonia) 71 Canada (Canadian Hot 100) 18 Denmark (Tracklisten) 37 France (SNEP) 52 Germany (Official German Charts) 40 Hungary (Dance Top 40) 4 Hungary (Rádiós Top 40) 12 Hungary (Single Top 40) 15 Ireland (IRMA) 34 Japan (Japan Hot 100) 24 Netherlands (Single Top 100) 92 New Zealand (Recorded Music NZ) 43 South Korea (Gaon) 37 Sweden (Sverigetopplistan) 40 Switzerland (Schweizer Hitparade) 18 UK Singles (OCC) 26 US Billboard Hot 100 46 ===Decade-end charts=== Chart (2010–2019) Position US Billboard Hot 100 61 ==References== Category:2019 songs Category:Pop songs Category:Billie Eilish songs",
 "title": "Bad Guy (Billie Eilish song)"
}