{
 "id": "697612",
 "text": "The 2019 Conservative Party leadership election happened when the prime minister and leader of the Conservative Party, Theresa May, announced on 24 May 2019 that she would resign as leader on 7 June, and resign as Prime Minister when a replacement is elected. Nominations closed on 10 June 2019 with ten candidates officially being nominated. The first ballot of MPs took place on 13 June. A second one took place on 18 June with a third on 19 June and a fourth and fifth ballot on 20 June. The entire contest is expected to be completed by mid-July. After the fifth ballot, Jeremy Hunt and Boris Johnson were the final two candidates. The general membership of the party elected Johnson as the leader by postal ballot on 22 July 2019. ==Candidates== ===Nominated=== The following MPs were officially nominated by the Conservative Party as candidates for the leadership position. Each candidate passed the first five ballots. File:Official_portrait_of_Mr_Jeremy_Hunt_crop_2.jpg|Foreign Secretary Jeremy Hunt from Surrey File:Boris_Johnson_election_infobox.jpg|Former Foreign Secretary and Mayor of London Boris Johnson from Greater London ===Eliminated=== ====Fifth ballot==== The following MP was eliminated on the fifth ballot on 20 June. They failed to obtain over 24% of the votes to advance further into the contest. File:Official portrait of Michael Gove crop 2.jpg|Environment Secretary Michael Gove from Surrey ====Fourth ballot==== The following MP was eliminated on the fourth ballot on 20 June. They failed to obtain over 50 votes to advance further into the contest. File:Official portrait of Sajid Javid MP.jpg|Home Secretary Sajid Javid from Worcestershire ====Third ballot==== The following MP was eliminated on the third ballot on 19 June. They failed to obtain over 30 votes to advance further into the contest. File:Official portrait of Rory Stewart crop 2.jpg|International Development Secretary Rory Stewart from Cumbria ====Second ballot==== The following MP was eliminated on the second ballot on 18 June. They failed to obtain over 30 votes to advance further into the contest. File:Official portrait of Dominic Raab crop 2.jpg|Former Brexit Secretary Dominic Raab from Surrey ====First ballot==== The following MPs were eliminated on the first ballot on 13 June. They failed to obtain 17 votes to advance further into the contest. File:Official portrait of Andrea Leadsom crop 2.jpg|Former Leader of the House of Commons Andrea Leadsom from Northamptonshire File:Official portrait of Mr Mark Harper crop 2.jpg|Former Chief Whip Mark Harper from Gloucestershire File:Official_portrait_of_Esther_McVey_crop_2.jpg|Former Work and Pensions Secretary Esther McVey from Cheshire ===Withdrawn=== ====During the ballot==== The following individuals were officially nominated as a candidate for the leadership of the Conservative Party but then eventually withdrew after the first ballot of the race, due to insufficient support or other reasons: File:Official portrait of Matt Hancock crop 2.jpg|Health Secretary Matt Hancock from Suffolk ====Before the ballot==== The following individuals announced that they would seek the leadership of the Conservative Party but then eventually did not stand, or withdrew before the first ballot of the race, due to insufficient support or other reasons: File:Official portrait of James Cleverly crop 2.jpg|Parliamentary Brexit Secretary James Cleverly from Essex File:Official portrait of Mr Sam Gyimah crop 2.jpg|Former Universities Minister Sam Gyimah from Surrey File:Official portrait of Kit Malthouse crop 2.jpg|Housing Secretary Kit Malthouse from Hampshire ==Timeline== Candidate status Candidate on membership ballot Candidate eliminated during MP ballots Candidate withdrew Events Theresa May announces resignation Theresa May resigns as Conservative leader Nominations close MP ballot Postal ballots distributed to party members Final leadership hustings Results announced == Results == After each ballot of Conservative MPs, the candidate with the fewest votes is eliminated. A new rule was introduced in 2019 due to the number of candidates: In the first ballot, held on 13 June 2019, candidates also needed to pass a threshold of 17 votes to avoid elimination. In the second ballot, held on 18 June, candidates needed to pass a threshold of 33 votes to avoid elimination. Candidate First ballot: 13 June 2019 Second ballot: 18 June 2019 Third ballot: 19 June 2019 Fourth ballot: 20 June 2019 Fifth ballot: 20 June 2019 Members' vote Candidate Votes % Votes % Votes % Votes % Votes % Votes % Boris Johnson 114 36.4 126 40.3 143 45.7 157 50.2 160 51.1 92,153 66.1 Jeremy Hunt 43 13.7 46 14.7 54 17.3 59 18.8 77 24.6 46,656 33.5 Michael Gove 37 11.8 41 13.1 51 16.3 61 19.5 75 24.0 colspan=\"2\" Sajid Javid 23 7.3 33 10.5 38 12.1 34 10.9 colspan=\"4\" Rory Stewart 19 6.1 37 11.8 27 8.6 colspan=\"6\" Dominic Raab 27 8.6 30 9.6 colspan=\"8\" Matt Hancock 20 6.4 colspan=\"10\" Andrea Leadsom 11 3.5 colspan=\"10\" Mark Harper 10 3.2 colspan=\"10\" Esther McVey 9 2.9 colspan=\"10\" Spoilt ballots 0 0.0 0 0.0 0 0.0 2 0.6 1 0.3 509 0.4 Turnout 313 100.0 313 100.0 313 100.0 313 100.0 313 100.0 139,318 87.4 ==References== Category:2019 in the United Kingdom Category:July 2019 events Category:June 2019 events Category:2019 elections in Europe",
 "title": "2019 Conservative Party leadership election"
}