{
 "id": "697635",
 "text": "Matthew John David Hancock (born 2nd October 1978) is a British politician. He has been the MP of West Suffolk since 2010. He was Secretary of State for Health and Social Care from 2018 until 2021. Hancock was suspended from the Conservative Party in November 2022. == Political roles == On 9 July 2018, after the promotion of Jeremy Hunt to Foreign Secretary, Hancock was named Secretary of State for Health and Social Care. On 25 May 2019, Hancock announced his plans to run for leadership of the Conservative Party. He withdrew from the race on 14 June shortly after winning only twenty votes on the first ballot. In May 2021, Hancock was filmed kissing an assistant during the COVID-19 pandemic. He also attended Boris Johnson's party during the national quarantine. Both of these events angered many people. He announced his resignation as Secretary for Health on 26 June 2021, with Sajid Javid taking over as Health Secretary. == Television == In November 2022, Matt Hancock was announced as a contestant on I'm a Celebrity...Get Me Out of Here (a show where celebrities live in a jungle). He was suspended from the Conservative Party because of this. Hancock made it to the final and finished in third place out of 12 celebrities. He will also be a contestant on SAS: Who Dares Wins. == Book == Matt Hancock released a book named Pandemic Diaries. The journalist Isabel Oakeshott worked with Hancock as the ghostwriter on his Pandemic Diaries. He gave her his WhatsApp messages and she later gave them to the Daily Telegraph. He said this was a “massive betrayal of trust”. == References == Category:1978 births Category:Living people Category:Alumni of the University of Cambridge Category:Alumni of the University of Oxford Category:Conservative Party (UK) MPs Category:Members of the British House of Commons for English constituencies Category:People from Chester Category:Members of the Privy Council of the United Kingdom Category:Secretaries of State for Health and Social Care Category:UK MPs 2010–2015 Category:UK MPs 2015–2017 Category:UK MPs 2017–2019 Category:UK MPs 2019–2024 Category:People with dyslexia Category:Politicians from Cheshire",
 "title": "Matt Hancock"
}