{
 "id": "697611",
 "text": "The following is a list of deaths that should be noted in June 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==June== ===1=== *Leah Chase, 96, American Creole chef and civil rights activist.Leah Chase, New Orleans’ matriarch of Creole cuisine, dead at 96 *John Myers, 60, British radio executive (GMG Radio, Radio Academy) and presenter.Radio executive John Myers has died aged 60 *José Antonio Reyes, 35, Spanish footballer (Sevilla, Arsenal, Atlético Madrid, national team), car accident.Jose Antonio Reyes: Former Arsenal winger dies aged 35 *Michel Serres, 88, French philosopher, theorist and writer, member of the Académie française (since 1990).Le philosophe et académicien Michel Serres est mort *Ani Yudhoyono, 66, Indonesian socialite, First Lady (2004–2014), leukaemia.Ani Yudhoyono Meninggal Dunia ===2=== *Momtazuddin Ahmed, 84, Bangladeshi dramatist and educator.Thespian Momtazuddin Ahmed passes away *Alistair Browning, 65, New Zealand actor (The Lord of the Rings: The Two Towers, The Return of the King), cancer.Award-winning Kiwi actor Alistair Browning dies after battle with cancer *Donald M. Fraser, 95, American politician, Mayor of Minneapolis (1980–1994) and member of the U.S. House of Representatives from Minnesota's 5th congressional district (1963–1979).A Minnesota politician for four decades, Don Fraser has died at 95 *Queen Harish, 39, Indian folk dancer. *Barry Hughes, 81, Welsh football manager (Go Ahead Eagles, Sparta Rotterdam, HFC Haarlem).Markante oud-trainer Barry Hughes (81) overleden *Alexey Kazannik, 77, Russian lawyer and politician, Prosecutor General (1993–1994) and Deputy Governor of Omsk Oblast (1995–2003).Умер бывший генпрокурор России Алексей Казанник *Mart Nutt, 57, Estonian politician and historian, MP (since 1992).MP Mart Nutt dies at 57 *Maciej Parowski, 72, Polish science fiction writer and editor (Nowa Fantastyka).Nie żyje Maciej Parowski, pisarz i twórca \"Nowej Fantastyki\" ===3=== *Atsushi Aoki, 41, Japanese professional wrestler (AJPW, NOAH), motorcycle crash.All Japan Pro Wrestling Star Atsushi Aoki Passes Away After Motorcycle Accident *Javier Barreda Jara, 52, Peruvian politician, Minister of Labor and Promotion of Employment (2018), heart attack.Falleció el exministro de Trabajo Javier Barreda tras sufrir un infarto *David Bergland, 83, American politician, Chair of the Libertarian National Committee (1977–1981, 1998–2000) and 1984 presidential candidate, prostate cancer.David Bergland, RIP: 1984 Libertarian Party Candidate for President *Paul Darrow, 78, English actor (Blake's 7, Doctor Who), problems caused by an aortic aneurysm.Paul Darrow dead: Doctor Who and Blake's 7 star dies aged 78 *Evangelina García Prince, 84, Venezuelan women rights activist, politician and academic, Senator (1988–1991, 1994–1996) and member of the Comisión para la Reforma del Estado.Falleció a los 84 años Evangelina García Prince *Jurica Jerković, 69, Croatian footballer (Hajduk Split, Zürich, Yugoslavia national team).Umro Jurica Jerković *Ken Matthews, 84, English Hall of Fame athlete, Olympic champion (1964). (death announced on this date) *Stanley Tigerman, 88, American architect (Illinois Holocaust Museum and Education Center), problems caused by COPD. ===4=== *Keith Birdsong, 59, American illustrator (Star Trek, Shadowrun), car crash. Acclaimed 'Star Trek' artist Keith Birdsong dies *Linda Collins-Smith, 57, American politician, member of the Arkansas House of Representatives (2011–2013) and Senate (2015–2019), shot.Former Arkansas Senator Collins-Smith dies at 57, GOP says (body discovered on this date) *George Darwin, 87, English footballer (Derby County).Former Derby County playmaker who was 'a joy to watch' dies (death announced on this date) *Billy Gabor, 97, American basketball player (Syracuse Orangemen, Syracuse Nationals), pneumonia.Syracuse great, NBA star Billy Gabor dies at age of 97 *Robin Herd, 80, British engineer, designer and businessman, co-founder of March Engineering.Robin Herd: 1939-2019 *Lennart Johansson, 89, Swedish sports official, President of UEFA (1990–2007).Tidigare UEFA-ordföranden Lennart Johansson är död *Lawrie Leslie, 84, Scottish footballer (Hibernian, Stoke City, national team). *Zakaria Ben Mustapha, 93, Tunisian politician, Governor of Gabès (1967–1969), Mayor of Tunis (1980–1986) and Minister of Culture (1986–1988).Ancien ministre de la Culture et maire de Tunis, le chef scout Zakaria Ben Mustapha est décédé *Nechama Rivlin, 73, Israeli socialite, First Lady (since 2014), problems caused by lung transplant.Nechama Rivlin, Wife of Israeli President, Dies at 73 *Geevarghese Mar Timotheos, 91, Indian Eastern Catholic prelate, Bishop of Tiruvalla (1988–2003).Former bishop Geevarghese Mar Timotheos, 91, passes away ===5=== *Alejandro Jadresic, 62, Chilean engineer and politician, Minister of Energy (1994–1998), brain cancer.Falleció el exministro y actual presidente de la Fundación Chile, Alejandro Jadresic *Jan Karwecki, 70, Polish footballer (Lech Poznań, Szombierki Bytom, national team).Jan Karwecki nie żyje *Max Kay, 82, Scottish-born Australian entertainer and manager (Andy Stewart), pneumonia caused by cancer. *Jonathan Nichols, 53, American politician, member of the Oklahoma Senate (2001–2013), shot.‘He served humbly’: Former Sen. Jonathan Nichols has died at age 53 *Lloyd John Ogilvie, 88, American Presbyterian minister, Chaplain of the U.S. Senate (1995–2003).In Memoriam: Lloyd John Ogilvie *Albert Rohan, 83, Austrian diplomat, Permanent Secretary of the Austrian Foreign Minister (1996–2001).Spitzendiplomat Albert Rohan gestorben *Elio Sgreccia, 90, Italian Roman Catholic cardinal, President of Pontifical Academy for Life (2005–2008).Bioetica: morto il card. Elio Sgreccia, “padre” della bioetica *Peter Toogood, 89, Australian amateur golfer. ===6=== *Dr. John, 77, American Hall of Fame singer-songwriter (\"I Walk on Guilded Splinters\", \"Right Place, Wrong Time\", \"Down in New Orleans\"), heart attack. *Alexander Kuznetsov, 59, Russian-born American actor (The Alaska Kid, The Peacemaker, Space Cowboys).Умер актер «Джека Восьмеркина...» Александр Кузнецов *Rolf Maurer, 81, Swiss road racing cyclist.Svizzera, la scomparsa di Rolf Maurer *Bolesław Pylak, 97, Polish Roman Catholic prelate, Bishop and Archbishop of Lublin (1975–1997).Bolesław Pylak 1921 - 2019. Rektor KUL wspomina zmarłego arcybiskupa *Johnny Robinson, 83, English footballer (Bury, Oldham Athletic). (death announced on this date) ===7=== *Noémi Ban, 96, Hungarian-born American public speaker and Holocaust survivor.Holocaust survivor Noémi Ban dies at 96 *Ryszard Bugajski, 76, Polish movie director (Interrogation, Clearcut, Generał Nil).Ryszard Bugajski nie żyje. Reżyser, scenarzysta i pisarz zmarł w wieku 76 lat *Nonnie Griffin, 85, Canadian actress (The Believers, Good Fences, If You Could See What I Hear) and voice actress, ruptured aortic aneurysm.Toronto actress Nonnie Griffin dies at 85 on eve of debuting new one-woman show *Narciso Ibáñez Serrador, 83, Uruguayan-born Spanish movie director (The House That Screamed, Who Can Kill a Child?, Historias para no dormir), urinary tract infection.Muere Chicho Ibáñez Serrador, clásico de la televisión en España *Noel Lloyd, 72, Welsh academic, vice-chancellor of Aberystwyth University (2004–2011).Aberystwyth University former vice-chancellor Noel Lloyd dies *Julie Payne, 78, American actress (Honeymoon Hotel, Island of the Blue Dolphins, Don't Make Waves), problems caused by COPD.Julie Payne Obituary *Tony Rodham, 64, American businessman and political consultant, brother of Hillary Clinton.Hillary Clinton's youngest brother, Tony Rodham, dies ===8=== *Milan Asadurov, 69, Bulgarian science fiction writer.Скръбна вест! Милан Асадуров напусна този свят *Lucho Avilés, 81, Uruguayan-born Argentine entertainment journalist (Crónica), heart attack.Murió Lucho Avilés, el pionero de los chimentos en la televisión *Spencer Bohren, 69, American roots guitarist, prostate cancer.New Orleans guitarist Spencer Bohren has died *Jorge Brovetto, 86, Uruguayan engineer, academic and politician, President of Broad Front (2004–2012) and Minister of Education and Culture (2005–2008).Falleció Jorge Brovetto *Norman Dewis, 98, British racing driver and engineer (Jaguar Cars).Former Jaguar engineering chief Norman Dewis dies aged 98 *Justin Edinburgh, 49, English football player (Tottenham Hotspur) and manager (Leyton Orient), cardiac arrest.Justin Edinburgh: Leyton Orient manager dies at the age of 49 *Karl Hurm, 88, German painter.Trauer in Haigerloch Künstler Karl Hurm und Ehefrau Anni gestorben *Frank Lucchesi, 92, American baseball player, coach (Texas Rangers) and manager (Philadelphia Phillies).Former Rangers manager Frank Lucchesi has died *Andre Matos, 47, Brazilian heavy metal vocalist and musician (Viper, Angra, Shaman), heart attack.Morre André Matos, ex-vocalista e fundador do Angra, aos 47 anos ===9=== *Wim Betz, 76, Belgian physician.Arts en scepticus Wim Betz overleden *Bushwick Bill, 52, Jamaican-American rap artist (Geto Boys), pancreatic cancer.Geto Boys Rapper Bushwick Bill Dies at 52 *Juhani Wahlsten, 81, Finnish ice hockey player (SM-sarja, KalPa, Helsingin Jalkapalloklubi).Suomalaisen jääkiekon suurmies Juhani ”Juuso” Wahlsten on kuollut *William D. Wittliff, 79, American screenwriter (Lonesome Dove, Legends of the Fall, The Perfect Storm), heart attack.'Lonesome Dove' screenwriter Bill Wittliff dies at 79 ===10=== *Chuck Glaser, 83, American country singer (Tompall & the Glaser Brothers).The Glaser Brothers’ Chuck Glaser Dies At 83 *Erich Iltgen, 78, German politician, President of the Landtag of Saxony (1990–2009).Früherer Landtagspräsident Erich Iltgen gestorben. *Girish Karnad, 81, Indian actor (Iqbal, Ek Tha Tiger), writer (Taledanda) and director (Tabbaliyu Neenade Magane), multiple organ failure.Girish Karnad, Veteran Actor-Writer, Dies Aged 81 *Lee Hee-ho, 96, South Korean socialite, First Lady (1998–2003), liver cancer.Lee Hee-ho, widow of ex-President Kim Dae-jung, dies at 97 *Crazy Mohan, 66, Indian comedian, actor (Vasool Raja MBBS) and screenwriter (Panchatanthiram, Jerry), heart attack.Comedy legend Crazy Mohan passes away due to cardiac arrest in Chennai *Paul \"Lil' Buck\" Sinegal, 75, American zydeco and blues guitarist and singer-songwriter.Paul 'Lil' Buck' Sinegal remembered for his talent and kindness *Michel Sitjar, 76, French rugby player (Sporting Union Agenais, XIII Catalan, national team), suicide.Michel Sitjar s'est fait une dernière malle *Wang Jun, 78, Chinese business executive, Chairman of the Poly Group and the CITIC Group.Wang Jun, who chaired one of the world’s biggest asset-owning state conglomerates at Citic Group, dies at the age of 78 ===11=== *Carl Bertelsen, 81, Danish footballer (Esbjerg, Kilmarnock, national team), problems caused by Alzheimer's disease.Tidligere dansk landsholdsspiller er død *Domenico De Simone, 93, Italian politician, Mayor of Torremaggiore (1960–1976), Senator (1976–1979) and Deputy (1979–1983).È morto il senatore Domenico De Simone, fu sindaco di Torremaggiore, senatore e deputato *Martin Feldstein, 79, American economist, Chairman of the Council of Economic Advisers (1982–1984), cancer. Influential economist Martin Feldstein dies at 79 *Gabriele Grunewald, 32, American middle-distance runner, problems caused by salivary gland cancer.Gabriele Grunewald, Pro Runner Who Raced Through Treatment for Rare Cancer, Dies at 32 *Billy McKee, 97, Irish republican, founding member and leader of the Provisional Irish Republican Army.Former IRA leader Billy McKee dies aged 97 *Velvel Pasternak, 85, Canadian-born American musicologist.Velvel Pasternak, who worked to preserve Jewish musical heritage, dies at 86 *Valeria Valeri, 97, Italian actress (Seasons of Our Love, Catherine and I, Un medico in famiglia).Valeria Valeri: muore a 97 anni l'attrice dal sorriso garbato ===12=== *Armand De Decker, 70, Belgian lawyer and politician, President of the Senate (1999–2004, 2007–2010) and Mayor of Uccle (until 2017).L'ex- président du Sénat et ex-bourgmestre d'Uccle Armand de Decker (MR) est décédé *Léon Kalenga Badikebele, 62, Congolese Roman Catholic prelate, Apostolic Nuncio to Argentina (since 2018) and Archbishop of Magnetum (since 2008).Murió León Kalenga, embajador del Vaticano en la Argentina *Chang Liyi, 89, Taiwanese pilot (ROCAF), member of the Black Cat Squadron, heart attack.黑貓飛官張立義91歲病逝 留下動人愛情故事 *Philomena Lynott, 88, Irish author (My Boy) and businesswoman, mother of Phil Lynott, lung cancer.Phil Lynott's mother Philomena has died aged 88 *Sylvia Miles, 94, American actress (Midnight Cowboy, Farewell, My Lovely, She-Devil), respiratory failure caused by anemia.Sylvia Miles, Scene-Stealer in 'Midnight Cowboy' and 'Farewell, My Lovely,' Dies at 94 *Elfriede Ott, 94, Austrian actress (Hallo – Hotel Sacher ... Portier!, The Unintentional Kidnapping of Mrs. Elfriede Ott) and singer.Schauspielerin Elfriede Ott ist tot *Igor Solopov, 58, Russian-born Estonian Olympic table tennis player (1992), European championship bronze medalist (1978).Печальная весть ===13=== *Pat Bowlen, 75, American Hall of Fame sports executive, majority owner of the Denver Broncos (since 1984), problems caused by Alzheimer's disease.Pat Bowlen dies: Hall of Fame Broncos owner was 75 *Nature Ganganbaigal, 29, Chinese musician (Tengger Cavalry) and composer.Nature Ganganbaigal, Tengger Calvary Frontman, Dies at 29 *Edith González, 54, Mexican actress (Sí, mi amor, Bianca Vidal, Doña Bárbara) and dancer, ovarian cancer.Murió la actriz Edith González tras una lucha contra el cáncer de ovario *Şeref Has, 82, Turkish footballer (Fenerbahçe, national team).Fenerbahçe'nin efsanesi, \"Barcelona'da oynayan ilk Türk\" Şeref Has 82 yaşında hayatını kaybetti *Geoff Lees, 85, English footballer (Barnsley, Bradford City).Rest in peace Geoff Lees (death announced on this date) *Heinrich Reichert, 69, Swiss neurobiologist.Heinrich Reichert *Wilhelm Wieben, 84, German journalist (Tagesschau), actor and author.Ex-\"Tagesschau\"-Sprecher Wilhelm Wieben ist tot ===14=== *Roger Béteille, 97, French aeronautical engineer (Airbus) and businessman.Décès de Roger Béteille, père fondateur d'Airbus *George E. Felton, 98, British computer scientist, developer of GEORGE operating system.Much Loved: George Eric Felton *Bernard M. Judge, 79, American newspaper editor (Chicago Sun- Times), pancreatic cancer.Bernie Judge, former CDLB publisher, dead at 79 *Ricardo Migliorisi, 71, Paraguayan painter and designer.Falleció Ricardo Migliorisi *Ebert Van Buren, 94, Honduran-born American football player (Philadelphia Eagles). *James Wyngaarden, 94, American physician and academic administrator, director of the National Institutes of Health (1982–1989). ===15=== *Daniel Colin, 85, French politician, Deputy (1986–1997).Daniel Colin, ancien député du Var, est décédé *David Esterly, 75, American woodcarver, problems caused by ALS.David Esterly, 75, Master Carver Steeped in History and Nature, Dies *Marta Harnecker, 82, Chilean sociologist, political scientist, journalist and activist.Murió la activista y escritora chilena Marta Harnecker a los 82 años *Wilhelm Holzbauer, 88, Austrian architect.Architekt Wilhelm Holzbauer im Alter von 88 Jahren gestorben *Kevin Killian, 66, American poet.Kevin Killian *Aldo Pignanelli, 69, Argentine accountant and politician, President of the Central Bank (2002), prostate cancer.Murió Aldo Pignanelli, expresidente del Banco Central *Charles A. Reich, 91, American scholar and writer (The Greening of America).‘Greening of America’ author Charles Reich dead at 91 *Josl Rieder, 86, Austrian Olympic alpine skier (1956), world champion (1958).Traueranzeige von Josef Rieder vom 18.06.2019 *Franco Zeffirelli, 96, Italian movie director (Romeo and Juliet, Jesus of Nazareth, The Taming of the Shrew) and politician, Senator (1994–2001).Legendary Italian director Franco Zeffirelli dies aged 96 ===16=== *Frederick Andermann, 88, Ukrainian-born Canadian neurologist and epileptologist.In memoriam Frederick Andermann *Bishop Bullwinkle, 70, American singer (\"Hell to the Naw Naw\") and comedian, heart attack.Bishop Bullwinkle death: Pastor and viral ‘Hell 2 Da Naw Naw’ singer dead at 70 *Erzsébet Gulyás-Köteles, 94, Hungarian gymnast, Olympic champion (1956), silver medallist (1948, 1952, 1956) and bronze medallist (1952).Meghalt Reviczkyné Köteles Erzsébet *Frank LaMere, 69, American Winnebago activist, bile duct cancer. *Simona Mafai De Pasquale, 90, Italian politician, Senator (1976–1979), stroke.Morta Simona Mafai, l'ex senatrice e storica dirigente del Pci aveva 91 anni *Sergey Ostroumov, 53, Russian drummer (Mashina Vremeni).Умер участник группы «Машина Времени» *Charles Wyrsch, 98, Swiss artist.Charles Wyrsch ===17=== *Philipp Bobkov, 93, Russian intelligence officer (KGB).Умер Филипп Бобков *Jerome Ch'en, 99, Chinese-Canadian historian.Jerome CH'EN *Friederike de Haas, 74, German politician, member of the Landtag of Saxony (1990–2009).Sächsische CDU-Politikerin Friederike de Haas ist tot *Darwin Hindman, 86, American politician, Mayor of Columbia, Missouri (1995–2010), lung disease.Darwin Hindman, Columbia's longest-serving mayor, dies *Jean-Marie Hullot, 65, French computer scientist and programmer (Apple Inc.).Jean-Marie Hullot Avis de décès *Mohamed Morsi, 67, Egyptian politician, President (2012–2013), heart attack.Egypt's ousted president Mohammed Morsi dies during trial *Salvatore Senese, 84, Italian magistrate and politician, Deputy (1992–1994) and Senator (1994–2001).È morto Salvatore Senese, ex magistrato e politico, tra i fondatori di Magistratura Democratica *Gloria Vanderbilt, 95, American socialite, artist and fashion designer, stomach cancer.Gloria Vanderbilt, heiress and jeans queen, dies at 95 *Jean Vanderpump, 84, English socialite, mother of Mark and Lisa, deep vein thrombosis. ===18=== *Stephen Blaire, 77, American Roman Catholic prelate, Bishop of Stockton (1999–2018).Stockton Diocese Bishop Emeritus Blaire dies at 77 in Modesto after prolonged illness *Pavel Chihaia, 97, Romanian novelist and political dissident.A murit scriitorul constănţean Pavel Chihaia, autorul „Blocadei“, romanul scos de comunişti din librării şi topit *Molara Ogundipe, 78, Nigerian writer and women's rights activist.Molara Ogundipe, frontline Nigerian Feminist dies ===19=== *Etika, 29, American internet personality, suicide by drowning. *Peng Xiaolian, 65, Chinese movie director (Once Upon a Time in Shanghai, Shanghai Story, Shanghai Rumba).Fifth-Gen Filmmaker Peng Xiaolian Passes Away at 66 *Rafael de la Sierra, 70, Spanish politician, President of the Parliament of Cantabria (1999–2003) and Minister of the Presidency and Justice of Cantabria (2015–2019).Fallece el ex consejero del Gobierno cántabro Rafael de la Sierra *Dmytro Tymchuk, 46, Ukrainian politician, military expert and blogger, member of the Verkhovna Rada (since 2014), accidental gunshot.В Киеве погиб нардеп от \"Народного фронта\" Дмитрий Тымчук *Ioannis Veryvakis, 88, Greek Army general, Chief of the Hellenic National Defence General Staff (1990–1993).Πέθανε ο Επίτιμος Αρχηγός ΓΕΕΘΑ Στρατηγός Ιωάννης Βερυβάκης ===20=== *Wibke Bruhns, 80, German television journalist (heute).Journalistin Wibke Bruhns ist tot *Dumitru Focșeneanu, 83, Romanian Olympic bobsledder (1972), stroke.Dumitru Focşeneanu a murit ieri. A făcut parte din echipajul de bob al României care a fost medaliat la campionatele mondiale și europene. A participat la Jocurile Olimpice din 1972 *Eddie Garcia, 90, Filipino actor (Beast of the Yellow Night, Rainbow's Sunset, FPJ's Ang Probinsyano), director and television personality, problems caused by a fall.Eddie Garcia dead: Veteran actor and film director dies at 90 after fall left him in coma *Gunther Kress, 78, Austrian-born British semiotician, heart failure. *Peter Matić, 82, Austrian actor (I Learned It from Father, Everyone Dies Alone, Wahnfried).Burgschauspieler Peter Matic ist tot *Rubén Suñé, 72, Argentine footballer (Boca Juniors, Huracán, national team).Murió el ex futbolista e ídolo de Boca Rubén \"Chapa\" Suñé *Mark Warawa, 69, Canadian politician, MP (since 2004), pancreatic cancer.Conservative MP Mark Warawa dies after battle with cancer ===21=== *Susan Bernard, 71, American actress (Faster, Pussycat! Kill! Kill!) and model (Playboy), heart attack.Susan Bernard Dies: ‘Faster, Pussycat! Kill! Kill!’ Actress, Publisher Of Iconic Hollywood Photo Archive Was 71 *Ralph Brill, 83, American legal scholar.In Memoriam: Professor of Law Emeritus Ralph Brill *Demetris Christofias, 72, Cypriot politician, President (2008–2013), respiratory failure. *Bubba Green, 61, American football player (Baltimore Colts), cancer.Anthony Bubba Green, former Baltimore Colts player, has passed away *Eugene V. Lux, 92, American politician, member of the Washington State Senate (1973, 1988) and State House of Representatives (1975–1988).Eugene Victor (Gene) Lux *Jan Meyers, 90, American politician, member of the U.S. House of Representatives from Kansas's 3rd congressional district (1985–1997), problems caused by heart disease.‘She was a pioneer.’ Former Kansas congresswoman Jan Meyers passes away ===22=== *Miguel Ángel Falasca, 46, Argentine-born Spanish volleyball player (Pòrtol, Skra Bełchatów, national team) and coach, heart attack.Lutto: è morto Miguel Angel Falasca *Judith Krantz, 91, American author (Scruples, Princess Daisy, Till We Meet Again).Judith Krantz Dies: Best-Selling Author And Journalist Was 91 Years Old *Leevi Lehto, 68, Finnish poet, translator and programmer, problems caused by MSA.HS: Kirjailija Leevi Lehto on kuollut 68-vuotiaana *Se'are Mekonnen, Ethiopian army officer, Chief of General Staff (since 2018), shot.Failed coup sees Ethiopia army chief shot dead by bodyguard *Zdeněk Remsa, 90, Czech Olympic ski jumper (1948) and coach.Zemřel Zdeněk Remsa, jedna z největších osobností českého skoku na lyžích *Stepan Shakaryan, 84, Azerbaijani-born Armenian composer.Famous Armenian composer Stepan Shakaryan died ===23=== *Peter Ball, 87, English Anglican cleric and convicted sex offender, Bishop of Lewes (1977–1992) and Gloucester (1992–1993).Peter Ball, former bishop jailed for sexual abuse, dead at 87 *Dave Bartholomew, 100, American Hall of Fame musician, bandleader and songwriter (\"Ain't That a Shame\", \"I Hear You Knocking\", \"I'm Walkin'\"), heart failure. *Andrey Kharitonov, 59, Russian actor (The Gadfly, The Invisible Man, The Devil's Flower), stomach cancer.Умер актер Андрей Харитонов, сыгравший Овода *Fernando Roldán, 97, Chilean footballer (CD Universidad Católica, national team).A los 97 años, murió Fernando Roldán, seleccionado mundialista en 1950 *George Rosenkranz, 102, Hungarian-born Mexican chemist, developed the birth control pill.George Rosenkranz, a Developer of the Birth Control Pill, Dies at 102 *Abdul Sattar, 88, Pakistani political scientist and diplomat, Minister of Foreign Affairs (1993, 1999-2002). ===24=== *Jeff Austin, 45, American mandolinist and singer (Yonder Mountain String Band).Jeff Austin, Formerly Of Yonder Mountain String Band, Has Passed Away *Graham Barnett, 83, English footballer (Port Vale, Halifax Town) and manager (South Coast United).Graham Barnett, promotion winner, supreme goal poacher and only man to pay to play for Port Vale, dies at 83 (death announced on this date) *Billy Drago, 73, American actor (The Untouchables, Pale Rider, The Hills Have Eyes), problems caused by a stroke.Billy Drago Dies: Hollywood ‘Bad Guy’ Character Actor Was 73 *Steve Dunleavy, 81, Australian-born American journalist (New York Post).Tabloid legend Steve Dunleavy dead at 81, family confirms *Jonás Gómez Gallo, 95, Chilean businessman and politician, Senator (1961–1969) and Deputy (1957–1961).A los 96 años falleció el reconocido empresario y político Jonás Gómez Gallo *José Huerta, 71, Peruvian politician, Minister of Defense (since 2018), heart attack.Peru's defence minister dies of heart attack at 71 *Yekaterina Mikhailova-Demina, 93, Russian military doctor.Легендарный санинструктор морской пехоты ушла в бессмертие *Jörg Stübner, 53, German footballer (Dynamo Dresden, Sachsen Leipzig, East Germany national team).Dynamo Dresdens Idol Jörg Stübner ist tot ===25=== *Ken Behring, 91, American real estate developer and businessman, owner of the Seattle Seahawks.Former Seahawks owner Kenneth Behring, billionaire philanthropist and Blackhawk developer, dies *Kevin McKenna, 75, Irish politician, Chief of Staff of the Provisional Irish Republican Army (1983–1997).One of the IRA's most influential leaders during the Troubles has died *Astrid North, 45, German soul singer-songwriter (Cultured Pearls, Soulounge), pancreatic cancer.Astrid North ist tot *Edgardo Mesa, 81, Argentine radio journalist (Entre Ríos) and actor (Los reyes del sablazo, Galería del terror), emphysema.Murió Edgardo Mesa *Sascha Pohflepp, 41, German artist.Sascha Pohflepp (1978–2019) (death announced on this date) *Alla Pokrovskaya, 81, Russian actress (July Rain, Take Aim, Fox Hunting) and educator, sepsis caused by liver disease.Умерла актриса Алла Покровская *Isabel Sarli, 89, Argentine actress (Thunder Among the Leaves) and glamour model, Miss Argentina (1955).Murió Isabel “la Coca” Sarli ===26=== *Georges Brossard, 79, Canadian entomologist, founder of the Montreal Insectarium, lung cancer.L'entomologiste Georges Brossard est décédé *Beth Chapman, 51, American bounty hunter and reality television personality (Dog the Bounty Hunter), throat cancer.Beth Chapman Dies: ‘Dog The Bounty Hunter’ Star Was 51 *Douglas Fielding, 73, British actor (Z-Cars, EastEnders) and narrator (Nightfall in Middle-Earth).Douglas Fielding dead: EastEnders and Z Cars star dies at 73 *Gerald McCann, 87, British fashion designer.Gerald McCann *Manuel Real, 95, American lawyer and politician, Judge of the U.S. District Court for the Central District of California (1966–2018).Manuel Real, Long-Serving and Frequently Reversed District Judge, Dies at 95 *Andrey Nikolayevich Sakharov, 89, Soviet-born Russian historian, member of the Russian Academy of Sciences (since 1991).Экс-директор Института российской истории РАН Андрей Сахаров умер на 90-м году жизни *Édith Scob, 81, French actress (Eyes Without a Face, Summer Hours, Holy Motors).Décès d'Edith Scob, éternelle héroïne des Yeux sans visage *Max Wright, 75, American actor (ALF, Reds, All That Jazz), lymphoma.Max Wright Dies: Father On ’80s Sitcom ‘Alf’ Was 75 ===27=== *Gualberto Castro, 84, Mexican singer (Los Hermanos Castro), actor (West Side Story) and television personality (La Carabina de Ambrosio), lung infection caused by bladder cancer.El cantante Gualberto Castro falleció a los 84 años de edad *David Golomb, 86, Israeli politician, member of the Knesset (1968–1969, 1977–1981).מת חבר הכנסת לשעבר דוד גולומב *Hartmut Nickel, 74, German Olympic ice hockey player (1968).Eishockey-Legende Hartmut Nickel mit 74 Jahren gestorben *Justin Raimondo, 67, American author, co-founder and editorial director of Antiwar.com, lung cancer.Justin Raimondo, RIP (1951-2019) ===28=== *František Čuba, 83, Czech agronomist and politician, Senator (2014–2018), received Medal of Merit (2013).Zemřel František Čuba *Willie Frazer, 58, Northern Irish loyalist activist and victims advocate, multiple organ failure.Willie Frazer, founder of Families Acting for Innocent Relatives, dies *Lisa Martinek, 47, German actress (Blankenese, The Old Fox, Der Kriminalist), swimming accident.Schauspielerin stirbt in Italien: Lisa Martinek wurde beim Schwimmen bewusstlos ===29=== *Yevheniya Dembska, 98, Ukrainian actress (White Acacia).Умерла Почетный гражданин Одессы Евгения Дембская *Gary Duncan, 72, American rock guitarist (Quicksilver Messenger Service), problems caused by a fall and seizure. Gary Duncan, Quicksilver Messenger Service Guitarist, Dies *Dieter Enders, 73, German chemist.Dieter Enders (1946 – 2019) *Jeon Mi-seon, 48, South Korean actress (Moon Embracing the Sun, Hide and Seek, Love Is a Crazy Thing), suicide by hanging.Actress found dead in Jeonju hotel *Ilkka Nummisto, 75, Finnish Olympic sprint canoer (1964, 1968, 1972, 1976).Kaikkien tuntema voimamies Ilkka Nummisto on kuollut: \"Hän oli sitkeä sissi\" *Gunilla Pontén, 90, Swedish fashion designer.Modeikonen Gunilla Pontén är död *Whitney North Seymour Jr., 95, American attorney and politician, U.S. Attorney for the Southern District of New York (1970–1973) and member of the New York State Senate (1966–1968).Whitney North Seymour Jr., Former U.S. Prosecutor Who Fought Corruption, Dies at 95 ===30=== *Sebastián Alarcón, 70, Chilean movie director and screenwriter (Night Over Chile), cancer.Ушел из жизни чилийский режиссер Себастьян Аларкон *David Binder, 88, American journalist (The New York Times), kidney disease.David Binder, 88, Dies; Chronicled the Cold War and Its Aftermath *Momir Bulatović, 62, Montenegrin politician, President of the Republic of Montenegro (1990–1998) and Prime Minister of the Federal Republic of Yugoslavia (1998–2000), heart attack.Former president of Montenegro, Momir Bulatovic, dies at 62 *Mitchell Feigenbaum, 74, American physicist, discoverer of Feigenbaum constants.Mitchell Feigenbaum, physicist who pioneered chaos theory, has died *David Koloane, 81, South African artist and political writer.David Koloane dies at 81; tributes pour in for legendary South African artist *Guillermo Mordillo, 86, Argentine cartoonist.Muere el dibujante argentino Guillermo Mordillo a los 86 años *Borka Pavićević, 72, Serbian dramaturge and newspaper columnist.Preminula Borka Pavićević *Noel White, 89, British businessman and football club chairman (Liverpool).RIP Noel White ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *6 Deaths",
 "title": "Deaths in June 2019"
}