{
 "id": "697745",
 "text": "Morris County is a county in the U.S. state of New Jersey, close to New York City. As of 2020, there were 509,285 people living in the county. This made it the 10th-most populous county in New Jersey.Table1. New Jersey Counties and Most Populous Cities and Townships: 2020 and 2010 Censuses, New Jersey Department of Labor and Workforce Development. Accessed December 1, 2022. The county seat is Morristown. The place where most people live at is Parsippany- Troy Hills Township, with 56,162 people, while the largest place is Rockaway Township, at . ==History== Lenape Native Americans used to live in New Jersey. They lived near rivers and hunted, fished, and got plants and nuts. Henry Hudson explored New Jersey in the 1600s. After he did, the Dutch came and made small towns and cities. They traded tools with the Native Americans for food and fur. Then, the British took over the land that the Dutch owned. They built the first towns and mines in what is now Morris County.\"Third Anglo-Dutch War, 1672-1674\". www.historyofwar.org. Retrieved 2019-03-23.Morris County profile[permanent dead link], Choose: New Jersey. Accessed October 6, 2013. But by 1750, there were no more Native Americans in New Jersey, because the Native Americans lost their land, grew less food, and got very sick. They all went to the Ohio Valley or Eastern Canada instead. Morris County was made for real in 1739, from parts of Hunterdon County.Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606–1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 191. Accessed January 21, 2013. It was named after a governor named Lewis Morris.\"Morris County Web Site – History – The Land Past and Present\". Co.morris.nj.us. Archived from the original on August 22, 2009. Retrieved August 9, 2011. During the battles of Trenton and Princeton during the American Revolution, George Washington and his men camped here. You can still see the place where they camped today; it's called Jockey Hollow.Adams, III, Charles J. \"Jockey Hollow Was Refuge For Continental Army\", Reading Eagle, July 20, 2006. Accessed October 6, 2013. ==Geography== This county is , according to the 2020 Census. ==References== Category:18th-century establishments in New Jersey Category:1730s establishments in the Thirteen Colonies Category:1739 establishments Category:New Jersey counties",
 "title": "Morris County, New Jersey"
}