{
 "id": "697742",
 "text": "Nova Scotia is the seventh-most populous province in Canada with 969,383 residents as of the 2021 Census of Population, and the second-smallest province in land area at . Nova Scotia's 49 municipalities cover of the territory's land mass, and are home to of its population. == List of municipalities == Halifax Canada Day 2007.jpg|alt=Skyline of Halifax|Halifax is Nova Scotia's capital and largest municipality by population. Louisbourg harbor, NS.jpg|alt=Louisbourg harbour|Harbour of Louisbourg in Cape Breton, Nova Scotia's second-most populated municipality Minas Basin from lookoff.JPG|alt=Eastern Kings County|The Municipality of the County of Kings is Nova Scotia's largest county municipality by population. Name Municipal type Incorporation date 2021 Census of Population 2021 Census of Population 2021 Census of Population 2021 Census of Population 2021 Census of Population Name Municipal type Incorporation date Population (2021) Population (2016) Change Land area (km²) Population density Cape Breton Regional municipality Halifax Regional municipality Queens Regional municipality West Hants Regional municipality Annapolis County municipality Antigonish County municipality Colchester County municipality Cumberland County municipality Inverness County municipality Kings County municipality Pictou County municipality Richmond County municipality Victoria County municipality Argyle District municipality Barrington District municipality Chester District municipality Clare District municipality Digby District municipality East Hants District municipality Guysborough District municipality Lunenburg District municipality Shelburne District municipality St. Mary's District municipality Yarmouth District municipality Amherst Town Annapolis Royal Town Antigonish Town Berwick Town Bridgewater Town Clark's Harbour Town Digby Town Kentville Town Lockeport Town Lunenburg Town Mahone Bay Town Middleton Town Mulgrave Town New Glasgow Town Oxford Town Pictou Town Port Hawkesbury Town Shelburne Town Stellarton Town Stewiacke Town Trenton Town Truro Town Westville Town Wolfville Town Yarmouth Town Total regional municipalities -- -- Total county municipalities -- -- Total district municipalities -- -- Total towns -- -- Total municipalities -- -- Province of Nova Scotia -- -- ==References== Notes Municipalities Nova Scotia",
 "title": "List of municipalities in Nova Scotia"
}