{
 "id": "697864",
 "text": "The 2018–19 UEFA Europa League knockout phase began on 12 February and ended on 29 May 2019 with the final at the Olympic Stadium in Baku, Azerbaijan, to decide the champions of the 2018–19 UEFA Europa League. A total of 32 teams competed in the knockout phase. For the first time, the video assistant referee (VAR) system was used in the competition, where it was implemented in the final. Times are CET/CEST, as listed by UEFA (local times, if different, are in parentheses). == Qualified teams == The knockout phase involved 32 teams: the 24 teams which qualify as winners and runners-up of each of the twelve groups in the group stage, and the eight third-placed teams from the Champions League group stage. === Europa League group stage winners and runners-up === Group Winners (seeded in round of 32 draw) Runners-up (unseeded in round of 32 draw) A Bayer Leverkusen Zürich B Red Bull Salzburg Celtic C Zenit Saint Petersburg Slavia Prague D Dinamo Zagreb Fenerbahçe E Arsenal Sporting CP F Real Betis Olympiacos G Villarreal Rapid Wien H Eintracht Frankfurt Lazio I Genk Malmö FF J Sevilla Krasnodar K Dynamo Kyiv Rennes L Chelsea BATE Borisov === Champions League group stage third-placed teams === == Bracket == == Round of 32 == The draw for the round of 32 was held on 17 December 2018, 13:00 CET. === Summary === The first legs were played on 12 and 14 February, and the second legs were played on 20 and 21 February 2019. |} === Matches === Dinamo Zagreb won 4–2 on aggregate. \\---- Red Bull Salzburg won 5–2 on aggregate. \\---- Inter Milan won 5–0 on aggregate. \\---- Slavia Prague won 4–1 on aggregate. \\---- 1–1 on aggregate. Krasnodar won on away goals. \\---- Napoli won 5–1 on aggregate. \\---- Chelsea won 5–1 on aggregate. \\---- Eintracht Frankfurt won 6–3 on aggregate. \\---- Valencia won 3–0 on aggregate. \\---- Rennes won 6–4 on aggregate. \\---- Dynamo Kyiv won 3–2 on aggregate. \\---- Sevilla won 3–0 on aggregate. \\---- Zenit Saint Petersburg won 3–2 on aggregate. \\---- Villarreal won 2–1 on aggregate. \\---- Arsenal won 3–1 on aggregate. \\---- Benfica won 2–1 on aggregate. == Round of 16 == The draw for the round of 16 was held on 22 February 2019, 13:00 CET. === Summary === The first legs were played on 7 March, and the second legs were played on 14 March 2019. |} Notes === Matches === Chelsea won 8–0 on aggregate. \\---- Eintracht Frankfurt won 1–0 on aggregate. \\---- Benfica won 3–1 on aggregate. \\---- Napoli won 4–3 on aggregate. \\---- Valencia won 3–2 on aggregate. \\---- Slavia Prague won 6–5 on aggregate. \\---- Arsenal won 4–3 on aggregate. \\---- Villarreal won 5–2 on aggregate. == Quarter-finals == The draw for the quarter-finals was held on 15 March 2019, 13:00 CET. === Summary === The first legs were played on 11 April, and the second legs were played on 18 April 2019. |} Notes === Matches === Arsenal won 3–0 on aggregate. \\---- Valencia won 5–1 on aggregate. \\---- 4–4 on aggregate. Eintracht Frankfurt won on away goals. \\---- Chelsea won 5–3 on aggregate. == Semi-finals == The draw for the semi-finals was held on 15 March 2019, 13:00 CET (after the quarter-final draw). === Summary === The first legs were played on 2 May, and the second legs were played on 9 May 2019. |} === Matches === Arsenal won 7–3 on aggregate. \\---- 2–2 on aggregate. Chelsea won 4–3 on penalties. == Final == The final was played on 29 May 2019 at the Olympic Stadium in Baku. The \"home\" team (for administrative purposes) was determined by an additional draw held after the quarter-final and semi-final draws. == Notes == == References == 3",
 "title": "2018–19 UEFA Europa League knockout phase"
}