{
 "id": "69785",
 "text": "Crysis is a first person shooter computer game involving science fiction. In the game, humans must survive an invasion by aliens. This is the first game to use all of the features of DirectX 10. It's a free-to-explore game. This game takes place in 2020 on an island south of China that is hit by a meteor. Both the North Korean and American army gets involved, but the North Korean Army gets there first. Both armies later find out that the meteor is an alien ship. At that time an alien invasion threatens the whole world. Meanwhile, the American forces attack the island to take control from the Koreans. == Main features == *Time of lighting: The game represents a true time of the day. *Real Time Ambient (means surroundings) Maps: CryENGINE 2 pre-determines the amount of ambient light in indoor surfaces, improving the quality of lighting when applying new light sources and shadows. This means current light position and color can be dynamically added to light intensity (means strength or density of lights) applied in interiors. *Dynamic Soft Shadows: natural looking shadows. *Light Beams: Like ones you will find between the leaves of trees. *Long Range View Distance: of about 8 kilometers range. *Parallax Occlusion Mapping: for greater sense of depth. In other words, to let the hero concentrate on an attractive thing. Such as an explosion. *3D Ocean Technology: to create a realistic ocean depends on wind and wave variables. *Facial Animation: to let the faces in the game look realistic as they react with the environment. *Object Motion Blur: this feature will help to blur things when they move fast. *Depth of Field: like of the camera's. *Breakable Buildings: So someone can break anything in the game. *Breakable Vegetation System: Even the jungles can be affected by weapons. *Advanced Rope Physics: These ropes can even be affected even by the rain. *Component Vehicle Damage: Every thing in a car, plane, boat etc. is breakable. *Next-Gen Physics System: allows game developers to make a full-of-life game. == Story == You play a soldier called Nomad. You and three soldiers look for missing people on an island. You find that Koreans attacked the island. America attacks the island. In the middle of the fighting, aliens come out of a mountain. Aliens then make a cold sphere (ball shape) on the island. America shoots a nuke at the sphere. The sphere becomes bigger, because it took the energy from the explosion. You then fight a big alien on a big ship. == Game information == The publisher is EA Games and it is developed by Crytek. It was released on November 16 2007. A sequel, Crysis 2, was released in March 2011. == Other websites == *Technical support *Official Site *Recent news Category:2007 video games Category:Electronic Arts video games Category:First-person shooters Category:Multiplayer and single-player video games Category:Nintendo Switch games Category:PlayStation 3 games Category:PlayStation 4 games Category:Science fiction video games Category:Stealth video games Category:Video games about alien invasions Category:Video games about Delta Force Category:Video games about extraterrestrial life Category:Video games about the United States Marine Corps Category:Windows games Category:Xbox 360 games Category:Xbox One games",
 "title": "Crysis (video game)"
}