{
 "id": "698488",
 "text": "Daniel Emiliano Mora Zevallos (born 18 February 1945 in Callao) is a Peruvian military officer and politician. He is a former Minister of Defence of Peru and former congressman. == Education and career == From 1963 to 1967, Daniel Mora attended the Chorrillos Military School, specialising in engineering. He took post-gradual courses at the École d'application du génie (French school of military engineering) in Angers, from 1972 to 1973. Additionally, he studied education administration at the University of Lima in 1985/86, and international humanitarian law in armed conflicts at the International Institute of Humanitarian Law in San Remo, Italy, in 1998. From 1976 to 1980, Daniel Mora was a professor at the Political Academy of Chile. At the end of the Cenepa Warbetween Peru and Ecuador in 1995, Mora was the Peruvian negotiator for the treaty of Itamaraty. == Political career == === Early political career === Daniel Mora was a founding member of the Possible Peru party of former president Alejandro Toledo in 2000. In the 2000 general elections, he unsuccessfully ran for Congress for the We Are Peru party of then Lima Mayor Alberto Andrade. Since his adhesion, he has held different executive positions in the party organisation. In Toledo's administration, Mora was secretary-general in the Ministry of Transport and Communication from 2002 to 2003, head of the advisory staff of the same ministry, and chairman of the National Intelligence Council (CNI), from 2003 to 2004. From 2005 to 2006 he was a presidential counsellor in the Peruvian Government Palace, assigned to decentralization. In the 2006 general elections, Mora ran for a seat in Congress, representing the Constitutional Province of Callao under the Possible Peru party, but he was not elected. === Congressman === In the 2011 general election, Daniel Mora was elected to the Congress on the Possible Peru Alliance list to represent the Constitutional Province of Callao. On 28 July 2011, newly elected president Ollanta Humala appointed him as Minister of Defense, due to a coalition agreement between Possible Peru and Humala's Peru Wins movement. He resigned when the cabinet was reshuffled on 11 December 2011. During his congressional term, he distanced himself from Possible Peru. Category:1945 births Category:Peruvian politicians Category:South American military people Category:Living people Category:Callao",
 "title": "Daniel Mora"
}