{
 "id": "698596",
 "text": "The Redwood National and State Parks (RNSP) are a group of state and national parks in the United States. They are on the coast of northern California. These parks include Redwood National Park, Del Norte Coast Redwoods State Park, Jedediah Smith Redwoods State Park, and Prairie Creek Redwoods State Park. Together, the parks contain , The parks have old-growth temperate rainforests. The four parks include 45% of all remaining coast redwood forests. These total at least . These trees are the tallest and one of the biggest trees on Earth. In addition to the redwood forests, the parks protect much nature within the area. In 1850, old-growth redwood forest covered more than of the California coast. The northern part of that area was noticed by lumbermen and others when a gold rush brought them to the region. As they did not become rich from gold, these men decided to log the gigantic trees. The timber went to San Francisco and other places on the West Coast. After many decades of logging, efforts were started in conservation. In the 1920s the Save the Redwoods League worked to save old-growth redwoods. Due to their efforts, a number of State Parks were formed. Then in 1968, Redwood National Park was created. By that time nearly 90% of the original redwood trees had been logged. The National Park Service (NPS) and the California Department of Parks and Recreation (CDPR) combined the management of Redwood National Park with the three Redwood State Parks in 1994. The ecosystem of the RNSP preserves a number of threatened animal species. These include the tidewater goby, Chinook salmon, northern spotted owl, and Steller's sea lion. The United Nations made the parks a World Heritage Site on 5 September 1980. Other parts of the area were added on 30 June 1983. == References == ==Related pages== *National park == Other websites == * Official website of the National Park Service * Chronology: Establishment of the Redwood National Park by Willard E. Pratt. Forest History Society website. * The HSU Redwoods Project * Inventory of the Redwood National Park Collection, 1926–1980 at the Forest History Society archives. Category:Biosphere reserves Category:National parks in the United States Category:State parks in the United States Category:World Heritage Sites in the United States Category:Western United States Category:Geography of California Category:1968 establishments in the United States",
 "title": "Redwood National and State Parks"
}