{
 "id": "698709",
 "text": "The First World War, which lasted from 1914 to 1918, was caused by the build- up of tension between European countries. Three long-term causes were the formation of empires, the rising size of armies and weapons, and the number of alliances. The trigger cause, however, was the assassination of Austro- Hungarian Archduke Franz Ferdinand. One of the causes of the war involved European countries that wanted to form empires, called imperialism. From the late 1800s, the power of an empire was judged by its size. The United Kingdom had the largest empire, with many territories overseas like India. People would say that \"the sun never sets on the British Empire\" because there were British holdings all over the world and so it was always daytime in some part of the empire. During the Moroccan Crisis, the European superpowers had colonised Africa and obtained raw materials to fuel their economic growth. Furthermore, France became entitled to being policemen in Morocco, but that escalated tensions with the Germans to the extent that they sent a warship, Panther. Another long-term cause was that to conquer far-away places on different continents, imperial powers had built large armies and navies. European cultures valued fighting, called militarism. Countries spent large amounts of money in a short amount of time to build their armies. In the early 1900s, the British had the largest navy in the world, which made Germany want to have a large navy that would rival it. When the British launched a new kind of ship, the dreadnought, Germany launched its own version to compete with them. The third long-term cause was military alliances. The main countries in Europe formed two sides: the Triple Entente (France, the United Kingdom, and Russia) and the Triple Alliance (Germany, Austria-Hungary, and Italy). The Triple Entente, worried about the growing strength of Germany, agreed to help its members if any of them was attacked. Germany objected to that arrangement because with France and the United Kingdom on the west and Russia on the east, it would be surrounded. That made Germany form the Triple Alliance. The trigger cause of the war was the assassination of Archduke Franz Ferdinand, who as the heir to the throne, was supposed to be the next Austro-Hungarian emperor. He and his wife, Sophie, Duchess of Hohenberg, were killed in Sarajevo, the capital of Bosnia, on June 28, 1914, while they on a state visit there. A Serbian secret society, the Black Hand, wanted Bosnia and other Slavic nations to break free from Austria-Hungary with the help of Russia. Both had arrived at 9:30 a.m. and got into an open-topped car at the train station. Members of the Black Hand had learned the route that would be taken to the destination. When the time came, one member threw a hand grenade at the car, but it bounced off the back, and the car drove on. Their bomb had injured the driver and passengers in the car behind Franz Ferdinand instead. When Franz Ferdinand realized that he was a target, he immediately abandoned his planned trip and went to visit a hospital instead. However, the driver took a wrong turn on Franz Joseph Street and had to reverse. By chance, the driver slowed down in front of Gavrilo Princip, a member of the Black Hand. Seeing that was his only chance to carry out the assassination, Princip pulled his gun and fired. He killed Franz Ferdinand and Sophie, who was pregnant. Princip was immediately arrested and beaten up on the street for his rebellious act. Franz Joseph Street has a placard, that describes those events. Austria- Hungary, outraged that its heir had been killed, blamed Serbia and bombed the country's capital, Belgrade, even though many Serbians tried to make peace. Serbia's ally, Russia, helped to defend it from the attack. Germany, an ally of Austria-Hungary, soon declared war on Russia and started to move towards French territory ready to invade. The German soldiers attacked Belgium as they progressed. France started to get ready for a German invasion. When Germany invaded Belgium, the British told Germany to get out of Belgium, who had been neutral. When the Germans kept on invading Belgium, the British declared war on Germany. Finally, Austria-Hungary declared war on Russia, and the war spread. Soon, more than 32 countries joined the war. Category:World War I",
 "title": "Causes of World War I"
}