{
 "id": "698886",
 "text": "Justin Charles Edinburgh (18 December 1969 – 8 June 2019) was an English professional football player and manager. He played as a left back. ==Life and career== Edinburgh was born in Basildon. He started his playing career at Southend United in 1988. He was loaned to Tottenham Hotspur in 1990 and signed a contract with the club that same year. During his time at Totteham between 1990 and 2000, Edinburgh made 258 appearances for the club and scored once. He also won two trophies with Spurs, the 1990–91 FA Cup and the 1998–99 Football League Cup. He signed for Portsmouth in 2000. He left the club in 2003 to become player-manager of Billericay Town. After retiring from playing, Edinburgh moved into full-time management, starting in 2006. He managed many lower-league and non-league clubs, including Rushden & Diamonds, Newport County, Gillingham and Northampton Town. He was the manager of Leyton Orient at the time of his death in June 2019. Edinburgh was married and had two children. He died of a cardiac arrest on 8 June 2019, at the age of 49. ==Managerial statistics== Managerial record by team and tenure Team From To Record Record Record Record Record Team From To Grays Athletic 5 January 2007 20 February 2008 Rushden & Diamonds 10 February 2009 7 July 2011 Individual seasons accessed via dropdown menu. Newport County 4 October 2011 7 February 2015 Gillingham 7 February 2015 3 January 2017 Northampton Town 16 January 2017 31 August 2017 Leyton Orient 29 November 2017 8 June 2019 Total Total Total — ==Honours== ===As a player=== Tottenham Hotspur *FA Cup: 1990–91 *FA Charity Shield: 1991 (shared) *Football League Cup: 1998–99 ===As a manager=== Newport County *FA Trophy runner-up: 2011–12 *Conference Premier play-offs: 2013 Leyton Orient *National League: 2018–19 *FA Trophy runner-up: 2018–19 ===Individual=== *Conference Premier/National League Manager of the Month: April/May 2013, November 2018, March 2019 *Leyton Orient Hall of Fame ==References== ==Other websites== * Category:1969 births Category:2019 deaths Category:Deaths from cardiac arrest Category:English footballers Category:English football managers Category:Portsmouth F.C. players Category:Sportspeople from Essex Category:Tottenham Hotspur F.C. players Category:Premier League players",
 "title": "Justin Edinburgh"
}