{
 "id": "699019",
 "text": "Girish Raghunath Karnad (19 May 1938 – 10 June 2019) was an Indian actor, movie director, screenwriter, playwright and a Rhodes Scholar. His works were based in Kannada. He was a recipient of the 1998 Jnanpith Award. His best acting roles were as Guruji in Iqbal movie (2005) and as Dr. Shenoy in Ek Tha Tiger (2012) and in the sequel Tiger Zinda Hai (2017). Karnad was born in Matheran in present-day Maharashtra. He studied at Karnatak University and at the University of Oxford. His son, Raghu, is a journalist. Karnad died of multiple organ failure caused by a long-illness on 10 June 2019 at a hospital in Bengaluru, Karnataka at the age of 81. ==Early Life and Education== Girish Karnad was born on 19 May 1938 in Matheran, which is now in the state of Maharashtra, India. He belonged to a Konkani-speaking family. Karnad grew up in different parts of Karnataka and studied at Karnatak University in Dharwad. He was a very bright student and later went to the University of Oxford in England as a Rhodes Scholar, where he studied philosophy, politics and economics. ==Writing and Theater== Karnad became famous as a playwright. His first play, Yayati, was written in Kannada and published in 1961. His second play, Tughlaq (1964), became very popular and is still performed today. His plays often mixed history and mythology with modern-day themes. He wrote about society, power and human emotions in a deep but simple way. Many of his plays were translated into other Indian languages and English. He helped bring modern themes into Indian theater and inspired many other writers. ==Awards and Recognition== Girish Karnad won many awards during his lifetime: * Jnanpith Award (1998) for his contribution to literature. * Padma Shri (1974) and Padma Bhushan (1992) from the Government of India. * Sangeet Natak Akademi Award and many national film awards for his work in movies. ==References== ==Other websites== *Profile of Girish Karnad * *Profile of Girish Karnad on Virtual Bangalore Category:1938 births Category:2019 deaths Category:Deaths from multiple organ failure Category:Disease-related deaths in India Category:Indian movie actors Category:Indian television actors Category:Indian stage actors Category:Indian movie directors Category:Indian playwrights Category:Indian screenwriters",
 "title": "Girish Karnad"
}