{
 "id": "699327",
 "text": "Beginning with Pixar's second film A Bug's Life, all subsequent Pixar feature films, except Coco, have been shown in theaters along with a Pixar-created original short film, known as a \"short.\" Other Pixar shorts, released only on home media, were created to showcase what Pixar has technologically in their works. ==Shorts== ===Original=== Title Year Director(s) Initial release with Academy Award for Best Animated Short Film Theatrical HomeNon-compilation The Adventures of André & Wally B.Produced by The Graphics Group, a subsidiary of Lucasfilm which would later become Pixar. 1984 Alvy Ray Smith Luxo Jr. 1986 John Lasseter Toy Story 2 Red's Dream 1987 rowspan=2 Tin Toy 1988 Toy Story Knick Knack 1989 Finding Nemo Geri's Game 1997 Jan Pinkava A Bug's Life rowspan=2 For the Birds 2000 Ralph Eggleston Monsters, Inc. Boundin' 2003 Bud Luckey The Incredibles rowspan=4 One Man Band 2005 Andrew Jimenez and Mark Andrews Cars Lifted 2006 Gary Rydstrom Ratatouille Presto 2008 Doug Sweetland WALL-E Partly Cloudy 2009 Peter Sohn Up Day & Night 2010 Teddy Newton Toy Story 3 rowspan=2 La Luna 2011 Enrico Casarosa Brave The Blue Umbrella 2013 Saschka Unseld Monsters University rowspan=2 Lava 2014 James Ford Murphy Inside Out Sanjay's Super Team 2015 Sanjay Patel The Good Dinosaur Piper 2016 Alan Barillaro Finding Dory Lou 2017 Dave Mullins Cars 3 Bao 2018 Domee Shi Incredibles 2 ===Feature-related=== Title Year Director(s) Initial release with Academy Award for Best Animated Short Film Theatrical HomeNon-compilation Mike's New Car 2002 Pete Docter and Roger L. Gould rowspan=8 Monsters, Inc. Jack-Jack Attack 2005 Brad Bird The Incredibles rowspan=\"12\" Mater and the Ghostlight 2006 John Lasseter Cars Your Friend the Rat 2007 Jim Capobianco Ratatouille BURN-E 2008 Angus MacLane WALL-E Dug's Special Mission 2009 Ronnie del Carmen Up George and A.J. 2009 Josh Cooley The Legend of Mor'du 2012 Brian Larsen Brave Party Central 2013 Kelsey Mann Muppets Most Wanted Riley's First Date? 2015 Josh Cooley rowspan=4 Inside Out Marine Life Interviews 2016 Ross Haldane Stevenson Finding Dory Miss Fritter's Racing Skoool 2017 James Ford Murphy Cars 3 Auntie EdnaBrad Bird on Twitter: \"Many of you have suggested we show what transpired the night E babysat Jack-Jack. Well, we were WAAAY ahead of you! AUNTIE EDNA, an all-new short direct... 2018 Ted Mathot Incredibles 2 ===Notes=== ==Short series== ===Cars Toons=== ====Mater's Tall Tales==== Title Year Director(s) Premiered Rescue Squad Mater 2008 John Lasseter Toon Disney Mater the Greater 2008 John Lasseter Toon Disney El Materdor 2008 John Lasseter Toon Disney Tokyo Mater 2008 John Lasseter Theatrical with Bolt Unidentified Flying Mater 2009 John Lasseter Disney Channel Monster Truck Mater 2010 John Lasseter Heavy Metal Mater 2010 John Lasseter Moon Mater 2010 Rob Gibbs DVD+Blu-ray with Mater's Tall Tales Mater Private Eye 2010 Rob Gibbs DVD+Blu-ray with Mater's Tall Tales Air Mater 2011 Rob Gibbs DVD+Blu-ray with Cars 2 Time Travel Mater 2012 Rob Gibbs Disney Channel ====Tales from Radiator Springs==== Title Year Director(s) Premiered Hiccups 2013 Jeremy Lasky Disney Channel Bugged Spinning The Radiator Springs 500½ 2014 Rob Gibbs and Scott Morse Disney Movies Anywhere ===Toy Story Toons=== Title Year Director(s) Premiered Hawaiian Vacation 2011 Gary Rydstrom Theatrical with Cars 2 Small Fry 2011 Angus MacLane Theatrical with The Muppets Partysaurus Rex 2012 Mark Walsh Theatrical with Finding Nemo 3D ===SparkShorts=== Title Year Director(s) Premiered Purl 2019 Kristen Lester YouTube Smash and Grab Brian Larsen Kitbull Rosana Sullivan Loop Erica Milsom Disney+ Wind Edwin Chang Float Bobby Rubio ==Television specials== Title Year Director(s) Network Toy Story of Terror! 2013 Angus MacLane ABC Toy Story That Time Forgot 2014 Steve Purcell ABC ==Compilations== Compilation title Release date Format Tiny Toy Stories October 29, 1996 VHS Pixar Short Films Collection, Volume 1 November 6, 2007 DVD, Blu-ray, Digital download Cars Toons: Mater's Tall Tales November 2, 2010 Pixar Short Films Collection, Volume 2 November 13, 2012 Pixar Short Films Collection, Volume 3 November 13, 2018 ==Other work== Title Year Commissioned for Blowin' in the Wind 1985 Beach Chair 1986 Flags and Waves Volume Visualization with the Pixar Image Computer 1987 Dance of the Waterlilies 1989 Toppan Printing Wake Up Tropicana Babies 1990 Life Savers Galaxy Toppan Printing Dancing Cards California Lottery Quite a Package Trident La Nouvelle Polo Volkswagen Pump Pillsbury Light & Heavy and Surprise Sesame Street Boxer Listerine Cracks 1991 Fleischmann's Moving Target Cellular One Gummie Savers Conga-Clio-award winner Life Savers Life At The Beach Orange Kiwi Passion Tropicana Warehouse Three Fruits Dancing Grand Opening Toys \"R\" Us Lunchbox Tetra Pak Knight Listerine Introduction Apple Mac Classic Interview 1992 Volkswagen Polo Swinging Bottle Listerine Daydream Tetra Pak Balloon Kellogg's All-Bran Hourglass Logo IBM Chomp Chomp IncrediBites[citation needed] Ladybug La Poste In the Mood Bunn Coffee Makers Cello 1993 Kellogg's All-Bran Sprinkler Front and Back and Up and Down Sesame Street Hungry Bank South[citation needed] Chase Stranded Tetra Pak Bursting Carefree Chuckling Straws Fresca Launching Magic Jordan Magic Toothbrush[citation needed] Ideas at Work Dow Corning Arrows-Clio-award winner 1994 Listerine Mission Kaleidoscope Coca-Cola About to Uncover Arm & Hammer Here, There and Everywhere Woman Getting What She Wants Levi's We've Got Taste Nutri Grain Wacky Frootz-Clio-award winner Life Savers Fresh Salad Boston Chicken Shaping Up Nicely Prime Option Credit Card[citation needed] Strong Option Logo Paramount Pictures Disney Videos Buena Vista Home Video Balloon 1995 Chips Ahoy Circus Flamingo Ortho Pinheads Dockers Amazin' Straws Hershey's Learning Lesson Coca-Cola Secret Weapon Pin Box Toy Story video game commercial Disney Interactive Art Store Break McDonald's Christmas Conga Tower Records Magic Desktop 1996 Sun Microsystems Magnets-Clio-award winner Hallmark Check Me Out Twizzlers Let Me In 68th Academy Awards (Toy Story segment) Academy of Motion Picture Arts and Sciences The Tastetations Hershey's Toy Story CD-Rom – \"Out of the Box\" Disney Interactive Wild Frijoles Rosarita[citation needed] Shake It Levi's Jeans for Women Tex THX Toy Story Treats ABC Look Away 1997 Nickelodeon & UNICEF Moo Can THX Logo 1998 Buena Vista Home Video/Entertainment A Bug's Life – \"Belt Loop 1\" McDonald's A Bug's Life – \"Belt Loop 2\" A Bug's Life – \"Big Toys\" A Bug's Life – \"Nothing Good on TV\" A Bug's Life – \"Nothing Good on TV Jr.\" A Bug's Life – \"Ponkickies\" 1999 Gachapin 71st Academy Awards (A Bug's Life segment) Academy of Motion Picture Arts and Sciences Toy Story 2 – \"Up Periscope\" McDonald's Toy Story 2 – \"Remote\" Toy Story 2 – \"Toys vs. Candy\" Toy Story 2 – \"Surveillance\" Toy Story 2 Bumpers ABC Toy Story 2 Monday Night Football Toy Story 2 – \"Ponkickies\" Gachapin 72nd Academy Awards (Toy Story 2 segment) 2000 Academy of Motion Picture Arts and Sciences Jessie's Acceptance Speech Cowgirl Hall of Fame SIGGRAPH 2001 Opening Video (Buzz Lightyear sequence) 2001 SIGGRAPH Logo Walt Disney Home Entertainment Disney DVD Intro Monsters, Inc. Bumpers ABC Monsters, Inc. Monday Night Football Monsters, Inc. — \"Happy Meal Toy\" McDonald's Monsters, Inc. — \"Ponkickies\" Gachapin Buzz Blasts 2002 Kellogg's Disney Cereal — \"CDs\" (Buzz Lightyear sequence) Finding Nemo — \"Ponkickies\" 2003 Gachapin Finding Nemo — \"Laugh\" McDonald's The Incredibles — \"Happy Meal Toys\" 2004 The Incredibles — \"SBC YAHOO!\" YAHOO! Vowellett – An Essay by Sarah Vowell 2005 The Incredibles two-disc collector's edition DVD set Disney DVD New Intro Walt Disney Home Entertainment Tex Action 2006 THX Cars — \"Happy Meal Toys\" McDonald's Cars — \"State Farm\" State Farm Cars — \"Walmart\" Walmart Cars — \"Hertz\" Hertz Cars — \"Opel Promotion 1\" Opel Cars — \"Opel Promotion 2\" Cars — \"AT&T; Yahoo Broadband\" AT&T; Cars — \"Energizer\" Energizer Wal-Mart Exclusive Cars DVD 2-pack Advertisement Wal-Mart Ratatouille — \"Nissan Note\" 2007 Nissan Monster Moo Can 2009 THX Up — \"Aflac\" Aflac Toy Story 3 2010 USPS Toy Story 3 — \"Target\" Target Toy Story 3 — \"Visa\" Visa Toy Story 3 — \"Aflac\" Aflac Toy Story's Search Story Google Toy Story The Third Dimension Dolby Cars 2 — \"Mom on a Mission\" 2011 Target Cars 2 — \"State Farm\" State Farm Cars 2 — \"V12 TV\" V12 TV Cars 2 — \"RTS\" Russian Traffic Safety Cars 2 — \"Profil Plus\" / \"Answer Seguros\" Profil Plus Publicité Oscaro Cars 2 pour l'émission Tout le sport Oscaro Oscaro.com , partenaire de la saga Cars Oscaro Mater Sheds Some Lights at Cars Land 2012 Cars Land Cars Land Opening Day Mater Bells Monsters University — \"Mess\" 2013 Swiffer Toy Story of Terror! — \"Sky\" Sky UK Toy Story That Time Forgot — \"Sky\" 2014 Inside Out — \"Clorox\" 2015 Clorox Inside Out — \"State Farm\" State Farm Inside Out — \"Sky\" Sky UK Inside Out — \"Lunch\" Subway 88th Academy Awards (Woody and Buzz segment) 2016 Academy of Motion Picture Arts and Sciences Cars 3 — \"Alamo Promo Ad\" 2017 Alamo Rent a Car Cars 3 — \"Broken Part\" Allianz Cars 3 — \"Die neue Allianz Autoversicherung\" Allianz Cars 3 — \"Every Car Has a Personality\" Autotrader.com Cars 3 — \"Sun Protection\" Coppertone Cars 3 — \"Duracell Breaking News\" Duracell Cars 3 x Oscaro Oscaro Incredibles 2 — \"Sky\" 2018 Sky UK Incredibles 2 — \"Happy Meal\" McDonald's Toy Story 4 — \"Happy Meal\" 2019 Toy Story 4 — \"Dance Party\" Chrysler Pacifica Toy Story 4 — \"Snack Attack\" Babybel Toy Story 4 Seiban Toy Story 4 2 Toy Story 4 — \"Make Joy Happen\" JD.com Toy Story 4 AR Regal Cinemas Pixar: 30 Years of Art & Animation Vivid Sydney Halloween Time at the Disneyland Resort Disneyland Resort Onward — \"Happy Meal\" 2020 McDonald's Onward Whirlpool Corporation Soul Allianz Soul — \"Happy Meal\" McDonald's Luca — \"Happy Meal\" 2021 Lightyear — \"Happy Meal\" 2022 Elemental — \"Happy Meal\" 2023 The Pixar Co-op Program, a part of the Pixar University professional development program, allows their animators to use Pixar resources to produce independent films. Some of their Co-op work includes: === Co-op Program === Title Year Director(s) Premiered The Dam Keeper 2014 Robert Kondo and Daisuke Tsutsumi 64th Berlin International Film Festival Borrowed Time 2016 Andrew Coats and Lou Hamou-Lhadj Austin Film Festival Weekends 2017 Trevor Jimenez Warsaw International Film Festival Automaton 2020 Krzysztof Rost SIGGRAPH Pete 2022 Brett Parker Tribeca Film Festival Starling 2023 Mitra Shahidi Tribeca Film Festival == References == ==Other websites== * at Pixar Category:Pixar",
 "title": "List of Pixar shorts"
}