{
 "id": "699519",
 "text": "The following is a list of notable deaths in December 2016. Entries for each day are listed _alphabetically_ by surname. A typical entry lists information in the following sequence: * Name, age, country of citizenship at birth, subsequent country of citizenship (if applicable), reason for notability, cause of death (if known), and reference. ==December 2016== ===1=== *Don Calfa, 76, American actor (The Return of the Living Dead, Weekend at Bernie's, Me, Myself and I).Don Calfa, the Mortician in 'The Return of the Living Dead,' Dies at 76 *Peter Corrigan, 75, Australian architect.Acclaimed Melbourne architect Peter Corrigan dies after long illness *Inkulab, 72, Indian poet and political activist.'Makkal Kavignar' Inquilab passes away *Joe McKnight, 28, American football player (New York Jets), shot.Former NFL, USC RB Joe McKnight killed in shooting *Ljubo Sirc, 96, Slovene economist.Umrl je Ljubo Sirc ===2=== *Coral Atkins, 80, English actress (A Family at War, Emmerdale), cancer.Coral Atkins obituary *Lyle Bouck, 92, American military officer and war veteran (Battle of the Bulge), pneumonia.Lyle Bouck Jr: Recipient of Distinguished Service Cross, former P.O.W., dies *Billy Chapin, 72, American child actor (The Night of the Hunter).Billy Chapin Dead: ‘Night Of The Hunter’ Child Actor Was 72 *Cherushii, 33, American electronic musician and radio host (KALX), injuries from fire.Chelsea Faith Dolan, musician and radio host, among victims of Oakland warehouse fire *Paul de Wispelaere, 88, Belgian writer.Auteur Paul de Wispelaere overleden *Sammy Lee, 96, American diver, Olympic champion (1948, 1952), pneumonia.Diving Legend Sammy Lee Passes Away At Age 96 *Gisela May, 92, German actress and singer (Berliner Ensemble).Gisela May gestorben ===3=== *Susan Cummings, 86, German-born American actress (Union Pacific), problems caused by a heart attack.Notice of death of actress Susan Cummings , westernboothill.blogspot.com; accessed August 9, 2017. *Newman Darby, 88, American sailboard inventor.S. Newman Darby, Inventor of the Sailboard, Dies at 88 *Herbert Hardesty, 91, American jazz musician.Herb Hardesty, best known as Fats Domino's saxophonist, dies at 91 *Brockway McMillan, 101, American government official and scientist, Director of the National Reconnaissance Office (1963–1965). *Antonio Membrado, 81, Spanish classical guitarist.Antonio Membrado nous a quitté ce jour *Rémy Pflimlin, 62, French businessman, CEO of France Télévisions, cancer.Rémy Pflimlin, ancien président de France Télévisions, est mort *Bekal Utsahi, 92, Indian poet and politician, MP (1986–1992), brain haemorrhage. ===4=== *Hiroshi Arakawa, 86, Japanese baseball player (Mainichi Orions), batting coach (Yomiuri Giants) and manager (Yakult Swallows), cardiac arrest.Oh mentor Arakawa dies at 86 *Julia Gomelskaya, 52, Ukrainian composer, car crash.Завтра в Одессе пройдет гражданская панихида по композитору и ее мужу, погибшим при ДТП *Gotlib, 82, French comics artist (Gai-Luron, Les Dingodossiers, La Rubrique-à-Brac).L’auteur de bande dessinée Gotlib est mort *Ferreira Gullar, 86, Brazilian writer, essayist and art critic, pneumonia.Ferreira Gullar morre aos 86 anos no Rio. *Radim Hladík, 69, Czech musician (Blue Effect), pulmonary fibrosis.Zemřel legendární kytarista Radim Hladík, zakládající člen Blue Effectu *Stu Locklin, 88, American baseball player (Cleveland Indians).Stuart Carlton \"Stu\" Locklin *Patricia Robins, 95, British novelist, problems caused by a fall. *Margaret Whitton, 67, American actress (Major League, The Secret of My Success, Steaming), cancer. ===5=== *Charles H. Belzile, 83, Canadian army general, Commander of the Canadian Army (1992-1996). *Mogens Camre, 80, Danish politician, MP (1968–1987) and MEP (1999–2009).Mogens Camre er død *Geydar Dzhemal, 69, Russian Islamic revolutionist and activist.Умер Гейдар Джемаль *Jayalalithaa, 68, Indian actress (Sri Krishna Satya, Galatta Kalyanam, Deiva Magan), Chief Minister of Tamil Nadu (1991–1996, 2001, 2002–2006, 2011–2014, since 2015), heart attack. *Rashaan Salaam, 42, American football player (Chicago Bears), Heisman Trophy winner (1994), suicide by gunshot. *Robert Sumner, 94, American Baptist pastor and author. ===6=== *Adolf Burger, 99, Slovak-born Czech typographer, memoirist and Holocaust survivor.Zemřel Adolf Burger, poslední padělatel z nacistické „Ďáblovy dílny“ *Brittany CoxXx, 38, American trans woman and performer. *Charles B. Reed, 75, American educator, Chancellor of State University System of Florida (1985–1998) and California State University (1998–2012). *Peter Vaughan, 93, British actor (Game of Thrones, Brazil, The Remains of the Day), epilepsy. ===7=== *Warren Allmand, 84, Canadian politician, member of the House of Commons of Canada (1965–1997) and Cabinet minister (1972–1979). *Paul Elvstrøm, 88, Danish yachtsman, Olympic champion (1948, 1952, 1956, 1960).Paul Elvstrøm er død *Hildegard Hamm-Brücher, 95, German politician, 1994 presidential candidate.Ehemalige FDP-Politikerin stirbt mit 95 Jahren *Junaid Jamshed, 52, Pakistani musician, television personality and preacher, plane crash. *Alex Johnstone, 55, Scottish politician, MSP for North East Scotland (since 1999), cancer. *Mike Kelly, 74, American politician, member of the Alaska House of Representatives (2005–2011), plane crash.Wife: Ex-state Rep. Mike Kelly dies in Alaska plane crash *Greg Lake, 69, English singer and musician (King Crimson, Emerson, Lake & Palmer), cancer. *İsmet Sezgin, 88, Turkish politician, Deputy Prime Minister and Minister of National Defence (1997–1999), multiple organ failure. *Benny Woit, 88, Canadian ice hockey player (Detroit Red Wings). ===8=== *Joop Braakhekke, 75, Dutch restaurateur and television presenter, pancreatic cancer.Tv-kok en restauranthouder Joop Braakhekke overleden *Putsy Caballero, 89, American baseball player (Philadelphia Phillies). *John Glenn, 95, American astronaut (Mercury-Atlas 6) and politician, U.S. Senator from Ohio (1974–1999). *Joseph Mascolo, 87, American actor (Days of Our Lives, The Bold and the Beautiful, Jaws 2), problems caused by Alzheimer's disease. *Dame Sheila Quinn, 96, British nurse, President of the Royal College of Nursing (1982-1986). *Peter van Straaten, 81, Dutch comics artist and political cartoonist (Vader & Zoon).Tekenaar Peter van Straaten (81) overleden *Palani Vaughan, 72, American Hawaiian music singer. ===9=== *Élcio Álvares, 84, Brazilian politician, Senator (1991–1994, 1995–1999), Minister of Defence (1999–2000), and Governor of Espírito Santo (1975–1979).Morre ex-governador do ES Elcio Alvares *Nola Ochs, 105, American centenarian, world's oldest college graduate. *Rob Sherman, 63, American political activist, plane crash. *William N. Small, 89, American admiral. ===10=== *Peter Brabrook, 79, English footballer (Chelsea, West Ham United). *Felix Browder, 89, American mathematician. *Bill Dineen, 84, Canadian ice hockey player (Detroit Red Wings) and coach. *Wolfgang Eisenmenger, 86, German physicist.Wolfgang Eisenmenger *Damião Experiença, 81, Brazilian outsider musician.Morre Daminhão Experiença, figura folclórica da música brasileira *Étienne Fabre, 20, French racing cyclist, fall. *A. A. Gill, 62, British writer and restaurant critic (The Sunday Times), lung cancer. *Ken Hechler, 102, American politician, U. S. Representative from West Virginia's 4th congressional district (1959–1977) and Secretary of State of West Virginia (1985–2001), stroke. *Hans-Eric Hellberg, 89, Swedish author (Kram) and journalist.Hans- Eric Hellberg är död *George Klein, 91, Hungarian-Swedish biologist.Georg Klein har avlidit *Miles Lord, 97, American federal judge, U. S. District Court for the District of Minnesota (1966–1985) and Attorney General of Minnesota (1955–1960). *John Montague, 87, Irish poet. *William Usery, Jr., 92, American politician, Secretary of Labor (1976–1977), heart failure. ===11=== *Sadiq Jalal al-Azm, 82, Syrian philosopher and academician. *João Castelo, 79, Brazilian politician, Governor of Maranhão (1979–1982), complications from surgery.Morre em São Paulo deputado tucano João Castelo *Marie Muhammad, 77, Indonesian politician, Finance Minister (1993–1998), brain cancer. *Marion Pritchard, 96, Dutch-born American social worker and Righteous Among the Nations, brain disease. *Esma Redžepova, 73, Macedonian Romani singer. *Thressa Stadtman, 96, American biochemist, member of the National Academy of Sciences (since 1981). ===12=== *E. R. Braithwaite, 104, Guyanese novelist (To Sir, With Love) and diplomat, heart failure.'To Sir, With Love' author ER Braithwaite dead at 104 *Myron H. Bright, 97, American judge, U. S. Court of Appeals for the Eighth Circuit (1968–2016). *Jean-Claude Deret, 95, French screenwriter (Thierry la Fronde).Décès de Jean-Claude Deret, scénariste de Thierry La Fronde *Anne Deveson, 86, Australian writer and broadcaster, Alzheimer's disease. *Jean Fisher, 74, British art critic and writer.Jean Fisher obituary *Shirley Hazzard, 85, Australian-born American writer (The Bay of Noon, The Great Fire). *Ratan Kumar, 75, Pakistani actor (Boot Polish, Jagriti, Do Bigha Zamin). *Jim Lowe, 93, American singer- songwriter (\"Green Door\"). *Jim Prior, Baron Prior, 89, British politician, Secretary of State for Northern Ireland (1981–1984) and Employment (1979–1981). *Konrad Reuland, 29, American football player (Baltimore Ravens), brain aneurysm. *Javier Echevarría Rodríguez, 84, Spanish Roman Catholic prelate, head of the Prelature of the Holy Cross and Opus Dei (since 1994).Fallece en Roma el prelado del Opus Dei, el español Javier Echevarría *Leo Sharp, 92, American drug dealer.Leo Sharp's epitaph: he was the world's oldest drug mule *Charles Mwando Simba, 80, Congolese politician, First Vice- President of the National Assembly (since 2012).Charles Mwando Nsimba du G7 décède à Bruxelles! ===13=== *Roy Harrover, 88, American architect, emphysema. *Betsy Pecanins, 62, American-born Mexican singer, songwriter and record producer, stroke.Muere Betsy Pecanins, La reina del blues. *Thomas Schelling, 95, American economist and professor, Nobel Prize winner (2005), problems caused by a hip fracture. *David Strangway, 82, Canadian geophysicist. *Alan Thicke, 69, Canadian actor (Growing Pains, Not Quite Human), talk show host (The Alan Thicke Show), and songwriter, ruptured aorta. ===14=== *Paulo Evaristo Arns, 95, Brazilian Roman Catholic prelate, Cardinal (since 1973) and Archbishop of São Paulo (1970–1998), pneumonia.Dom Paulo Evaristo Arns morre em São Paulo aos 95 anos *Bernard Fox, 89, Welsh actor (Titanic, Bewitched, The Mummy), heart failure. *Garrett K. Gomez, 44, American jockey, drug overdose. *Hurricane Run, 14, Irish racehorse, euthanized. *Karel Husa, 95, Czech-born American composer.Karel Husa (1921–2016) *Halfdan T. Mahler, 93, Danish physician, Director-General of the World Health Organization (1973–1988).Dr Halfdan T. Mahler, WHO’s third Director-General, dies at 93 *Sadatoshi Ozato, 86, Japanese politician, member of the House of Representatives (1979–2005) and Minister of Labour (1990–91). *Päivi Paunu, 70, Finnish singer, cancer.Laulaja Päivi Paunu on kuollut *Bunny Walters, 63, New Zealand singer (\"Brandy\"). ===15=== *Howard Bingham, 77, American photographer and biographer (Muhammad Ali). *Leanna Brown, 81, American politician, member of the New Jersey General Assembly (1980–1984) and State Senate (1984–1993).Leanna Brown, pioneering politician from Chatham, has died *Shep Houghton, 102, American actor (The Wizard of Oz, Gone with the Wind, Perry Mason). *Osiride Pevarello, 96, Italian actor (Caligula, Ator 2 - L'invincibile Orion).Cinema, morto Osiride Pevarello: attore e stuntman tanto amato ad Ostia *Craig Sager, 65, American sportscaster (NBA on TNT), leukemia. *Bohdan Smoleń, 69, Polish comedian, singer and actor, lung infection.Nie żyje Bohdan Smoleń. Zmarł w wieku 69 lat *Ron Ziel, 77, American railway historian. ===16=== *Faina Melnik, 71, Ukrainian-born Russian discus thrower, Olympic champion (1972).Соболезнуем *Jim Williams, 90, American politician, Lieutenant Governor of Florida (1975–1979). ===17=== *Eric Defoort, 73, Belgian politician, President of the European Free Alliance (since 2010).N-VA-pionier Eric Defoort is overleden *Benjamin A. Gilman, 94, American politician, member of the U.S. House of Representatives from New York's 20th, 22nd and 26th congressional districts (1973–2003), problems caused by hip surgery. *Bill Hanna, 86, American politician, Mayor of Shreveport, Louisiana (1978–1982). *Henry Heimlich, 96, American physician, inventor of the Heimlich maneuver, problems caused by a heart attack. *Gordon Hunt, 87, American voice director (The Jetsons, Uncharted) and voice actor (Dilbert), Parkinson's disease. *Leanid Marakou, 58, Belarusian journalist, writer and historian, brain cancer.Умер писатель и историк Леонид Моряков ===18=== *Zsa Zsa Gabor, 99, Hungarian-born American actress (Moulin Rouge, Touch of Evil, Lili) and socialite, heart attack. *William H. Hudnut III, 84, American politician, member of the U.S. House of Representatives from Indiana's 11th congressional district (1973–1975), Mayor of Indianapolis (1976–1992) and Mayor of Chevy Chase, Maryland (2004–2006). *Gustavo Quintero, 76, Colombian singer-songwriter, stomach cancer. *Gordie Tapp, 94, Canadian country singer and entertainer (Hee Haw). ===19=== *Ger Blok, 77, Dutch football manager (Honduras and Myanmar national teams).Voormalig trainer Ger Blok (77) overleden *Lionel Blue, 86, British rabbi, journalist and broadcaster, complications from Parkinson's disease. *Anne Borg, 80, Norwegian ballet dancer.Anne Borg døde natt til 19. desember *Phil Gagliano, 74, American baseball player (St. Louis Cardinals, Chicago Cubs, Boston Red Sox). *Hugh Iltis, 91, Czechoslovakian-born American botanist, complications of a vascular disease. *Andrei Karlov, 62, Russian politician, Ambassador to Turkey (since 2013), shot. *Dick Latessa, 87, American actor (Hairspray, Promises, Promises, Stigmata), heart failure. *Anupam Mishra, 68, Indian author, journalist and environmentalist. *Anique Poitras, 55, Canadian writer.L'écrivaine Anique Poitras s'éteint à 55 ans *Kishori Sinha, 91, Indian politician, MP for Vaishali (1980–1989).Kishori Sinha passes away *Fidel Uriarte, 71, Spanish footballer (Athletic Bilbao, national team). ===20=== *Raymond Heacock, 88, American engineer. *El Hortelano, 62, Spanish painter.Muere El Hortelano, pintor de la Movida madrileña *Patrick Jenkin, Baron Jenkin of Roding, 90, British politician, Secretary of State for Social Services (1979-1981), Industry (1981-1983), and Environment (1983-1985). *Andrew Karpati Kennedy, 85, Hungarian-born British author and literary critic. *Michèle Morgan, 96, French actress (Port of Shadows, Passage to Marseille, La Symphonie pastorale).La comédienne Michèle Morgan est morte à 96, ans *Archie Norman, 104, British paediatrician.Archie Norman obituary ===21=== *Welington de Melo, 70, Brazilian mathematician.Morre o matemático Welington de Melo, orientador do medalha Fields *Sidney Drell, 90, American physicist. *Abdul Gafur Hali, 87, Bangladeshi singer, composer and lyricist. *John Gwilliam, 93, Welsh rugby union player (national team). *Robert Leo Hulseman, 84, American entrepreneur, inventor of the red solo cup. *Jaan Klõšeiko, 77, Estonian printmaker and photographer. ===22=== *Mocho Cota, 62, Mexican professional wrestler (CMLL).Falleció el luchador Mocho Cota *Yevgeny Dzhugashvili, 80, Russian-Georgian activist and politician. *Solomon Levy, 80, Gibraltarian politician, Mayor of Gibraltar (2008–2009). *Philip Saville, 86, British television director (A Night Out, Madhouse on Castle Street) and screenwriter. *Franca Sozzani, 66, Italian journalist, Editor-in-chief of Vogue Italia (since 1988). *Sir Dwight Venner, 70, Vincentian banker. *Lella Vignelli, 82, Italian designer, dementia. *Lillian Walker, 93, American politician. *Miruts Yifter, 72, Ethiopian long distance runner, Olympic champion (1980), respiratory failure. ===23=== *John Aitchison, 90, Scottish statistician. *Anis Amri, 24, Tunisian terrorism suspect, shot. *Robert Hinde, 93, British zoologist, Master of St John's College, Cambridge (1989-1994). *Andrés Rivera, 88, Argentine writer.Murió Andrés Rivera, el escritor argentino que pensó la revolución como un sueño eterno *Piers Sellers, 61, British astronaut and meteorologist, pancreatic cancer. *Luba Skořepová, 93, Czech actress (Arabela).Ve věku 93 let zemřela herečka Luba Skořepová *Vesna Vulović, 66, Serbian flight attendant, world record holder for longest fall and sole survivor of JAT Flight 367. ===24=== *Edith Ackermann, 70, Swiss-born American psychologist.Edith Ackermann, developmental psychologist and learning researcher, dies at 70 *Richard Adams, 96, British author (Watership Down, The Plague Dogs, Shardik), complications from a blood disorder.Watership Down author Richard Adams dies aged 96 *Pape Badiane, 36, French basketball player (Chorale Roanne, Poitiers Basket 86, national team), car crash.Basket – Carnet : Décès De Pape Badiane, Ancien International Français *Jeffrey Hayden, 90, American television director and producer (Peyton Place, The Donna Reed Show).Jeffrey Hayden Dies: ‘Peyton Place’, ‘Donna Reed Show’ Director Was 90 *Ted Meines, 95, Dutch military officer and veteran affairs activist.‘Veteranen-generaal’ Ted Meines overleden *Rick Parfitt, 68, British singer, songwriter and guitarist (Status Quo), sepsis caused by an infection.Quo guitarist Rick Parfitt dies aged 68 *Edwin Reinecke, 92, American politician, member of the U.S House of Representatives from California's 27th congressional district (1965–1969) and Lieutenant Governor of California (1969–1974).Reinecke, who resigned as California's lieutenant governor after a perjury conviction, dies at 92 *Liz Smith, 95, English actress (The Royle Family, I Didn't Know You Cared, Charlie and the Chocolate Factory).Royle Family and Dibley actress Liz Smith dies aged 95 ===25=== *Karl Golser, 73, Italian Roman Catholic prelate, Bishop of Bolzano-Bressanone (2008–2011).Si è spento il vescovo Karl Golser *George Michael, 53, British singer (Wham!) and songwriter (\"Wake Me Up Before You Go-Go\", \"Careless Whisper\", \"Faith\"), Grammy winner (1987, 1989), cardiomyopathy. *Alphonse Mouzon, 68, American jazz drummer (Weather Report, The Eleventh House) and record label owner, neuroendocrine cancer. *Miriam Pirazzini, 98, Italian opera singer.Italiaanse mezzosopraan Miriam Pirazzini overleden (98) *Vera Rubin, 88, American astronomer, innovator of dark matter theory, dementia. * Notable Russian people killed in the Russian Defence Ministry Tupolev Tu-154 crash: **Elizaveta Glinka, 54, humanitarian worker and charity activist. **Anton Gubankov, 51, scholar and journalist, Director of the Department of Culture (since 2013). **Valery Khalilov, 64, military band conductor. ===26=== *Kyriakos Amiridis, 59, Greek diplomat, Ambassador to Brazil, murdered. *Jaume Camprodon i Rovira, 90, Spanish Roman Catholic prelate, Bishop of Girona (1973–2001). *George S. Irving, 94, American actor (Underdog, Me and My Girl, The Year Without a Santa Claus), heart failure. *József Katona, 75, Hungarian swimmer.Meghalt Katona József, Európa-bajnok úszó *Seth J. McKee, 100, American military officer. *Peter Nowell, 88, American cancer researcher. *Luciano Panetti, 87, Italian football player and manager.Calcio in lutto, morto il \"puma\" Luciano Panetti *Elvio Porta, 71, Italian screenwriter and film director (What if Gargiulo Finds Out?).Elvio Porta: addio all’autore di “Masaniello” e del film “Scugnizzi” *Martin Reagan, 92, English football player and manager (women's national team). *Barbara Tarbuck, 74, American actress (General Hospital, Short Circuit, American Horror Story), Creutzfeldt–Jakob disease. ===27=== *Maurice Failevic, 83, French film director.Mort de Maurice Failevic, éternel «rouge» du cinéma français *Carrie Fisher, 60, American actress (Star Wars, When Harry Met Sally...), novelist and screenwriter (Postcards from the Edge), cardiac arrest. *Claude Gensac, 89, French actress (Scènes de ménages).Mort de la comédienne Claude Gensac, épouse à l’écran de Louis de Funès *Hans Tietmeyer, 85, German economist, President of Deutsche Bundesbank (1993–1999). *Ratnasiri Wickremanayake, 83, Sri Lankan politician, Prime Minister (2000–2001, 2005–2010). *Chuck Wright, 97, American politician, Mayor of Topeka (1965–1969).Chuck Wright, Topeka mayor during the 1966 tornado, dies at age 97 ===28=== *Gregorio Conrado Álvarez, 91, Uruguayan politician, President (1981–1985). *Pierre Barouh, 82, French actor (A Man and a Woman), writer and musician, heart attack. *Gilles Borrie, 91, Dutch politician and historian, Mayor of Sleen (1960–1968), Tiel (1968–1973), Rheden (1973–1979), and Eindhoven (1979–1987).Oud-burgemeester van Eindhoven Gilles Borrie overleden (91) *Michel Déon, 97, French novelist and literary columnist, pulmonary embolism. *Donya Fannizadeh, 49, Iranian puppeteer (Kolah Ghermezi), cancer. *Debbie Reynolds, 84, American actress (Singin' in the Rain, The Unsinkable Molly Brown, Irene), dancer and singer (\"Tammy\"), stroke. *Edgar Robles, 39, Paraguayan footballer (Libertad).Falleció Édgar Robles *Jean-Christophe Victor, 69, French political scientist, heart attack.Jean-Christophe Victor, expert en géopolitique et créateur de l’émission « Le dessous des cartes », est mort ===29=== *Raymond Burki, 67, Swiss cartoonist, cancer.Burki, disparition d’une institution du dessin de presse *Kamal Mani Dixit, 87, Nepalese writer. *LaVell Edwards, 86, American football coach (BYU Cougars), problems caused by a broken hip. *Néstor Gonçalves, 80, Uruguayan footballer (Peñarol).Falleció Néstor Gonçalves, símbolo máximo de la historia de Peñarol *Santi Ibáñez, 58, Spanish actor (El Cor de la Ciutat), lung cancer.Mor l'actor Santi Ibáñez als 58 anys *Aleksander Koj, 81, Polish biochemist.Zmarł prof. Aleksander Koj, trzykrotny rektor Uniwersytetu Jagiellońskiego *Ferdinand Kübler, 97, Swiss racing cyclist, Tour de France winner (1950).L'aigle d'Adliswil s'est envoé pour toujours *Maurice M. Paul, 84, American judge. *William Salice, 83, Italian businessman and inventor (Kinder Surprise), stroke.Der Erfinder des Überraschungseis ist tot *Peter Tamm, 88, German publishing manager (Axel Springer Verlag).Ex-Springer-Chef Peter Tamm gestorben *Olga Ulianova, 53, Russian-Chilean historian, cancer.Pesar en el mundo académico por el fallecimiento de la historiadora ruso-chilena Olga Ulianova *Philip Wolfe, 89, American mathematician. ===30=== *Thomas Ludger Dupré, 83, American Roman Catholic prelate, Bishop of Springfield in Massachusetts (1995–2004). *Judith Ortiz Cofer, 64, Puerto Rican-American writer, liver cancer. *Gopal Rath, 71, Indian poet. *Glen L. Rudd, 98, American general authority of The Church of Jesus Christ of Latter-day Saints. *Huston Smith, 97, American religious scholar and author (The World's Religions). *Sutter Brown, 13, American Welsh Corgi belonging to Governor of California Jerry Brown. *Allan Williams, 86, English businessman and promoter (The Beatles). *Tyrus Wong, 106, Chinese-born American artist and movie production illustrator (Bambi, Around the World in 80 Days). ===31=== *William Christopher, 84, American actor (M*A*S*H, Gomer Pyle, U.S.M.C., The Smurfs), small-cell carcinoma. *Henning Christophersen, 77, Danish politician, Foreign Minister (1978–1979), Finance Minister (1982–1984), Vice-President of the European Commission (1985–1995).Venstre- legenden Henning Christophersen er død *Henk Koning, 83, Dutch politician, MP (1967–1977, 1981–1982, 1986, 1989–1991).Overleden: Henk Koning, Gilles Borrie, Debbie Reynold en Carrie Fisher *David Meltzer, 79, American poet and musician, stroke. *Shirley Neil Pettis, 92, American politician, member of the U.S. House of Representatives from California's 37th congressional district (1975–1979). Former U.S. Congresswoman Shirley Neil Pettis dead at 92 *Prince Dimitri Romanov, 90, Russian prince, banker, philanthropist, and author, claimant to the headship of the Imperial House of Russia.В Дании скончался старший в роду Романовых князь Димитрий Романович ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==References== *12 Deaths",
 "title": "Deaths in December 2016"
}