{
 "id": "69987",
 "text": "Nymphadora Tonks is a fictional character in the Harry Potter book series written by J. K. Rowling. The character is played by actress Natalia \"Nat\" Tena in the Harry Potter movies. Tonks, as she is known, is the only daughter of Andromeda Black and Ted Tonks. She is a Half-Blood, but both of her parents are actually magical. Her mother is a pureblood from the ancient wizarding family of the Blacks, and her father is a muggle born, therefore considering that the majority of her father's family are muggles she is considered a half- blood, even though he is not a muggle himself. Tonks is a metamorphmagus, which means that she can change her appearance at will. Her Patronus was a jackrabbit, but it changed into a wolf (Remus's Patronus) due to her love for Remus Lupin. She heavily dislikes being called by her first name and prefers to be called Tonks. Tonks is first described in the books as having a pale heart-shaped face, dark twinkling eyes, and short, spiky hair that was a violent shade of violet. She helped Harry pack up his things with a \"Pack,\" a spell that is used to pack things, but this only made all of Harry's belongings soar messily into his trunk. She also changed her hair color to pink (being a metamorphmagus) (wasn't depicted in the movies for the fear that the audience would associate her with Dolores Umbridge), and commented on Harry's Firebolt jealously. She knocked over a plate in the Dursley's kitchen when the 'Advance Guard' came to pick up Harry to take to number twelve, Grimmauld Place. She also knocked over the troll umbrella stand, which made Sirius's mother, Walburga Black, start screaming. She is known as \"seriously clumsy,\" because of the amount of things she knocked over or broke. Tonks was born between 1st september 1972 and 31st august 1973. She attended Hogwarts School of Witchcraft and Wizardry from 1984-1991, the time of Charlie Weasley, and was Sorted into Hufflepuff House. She never became a Prefect in her 5th year, because her Head of House, Pomona Sprout, said she lacked necessary qualities, such as the ability to behave herself. She works as an Auror in the Ministry of Magic under the eye of Mad-Eye Moody, and qi. She worked as a spy for the Order of the Phoenix. So did Arthur Weasley, Kingsley Shacklebolt, and a few others, as they themselves worked inside the Ministry. In Harry Potter and the Deathly Hallows, she marries the werewolf Remus Lupin (even though she is 13 years younger than him), and many people disapprove of her choice. Remus Lupin feels that he has endangered her and her son (who isn't born yet), and leaves her at the beginning of the Deathly Hallows. Harry, already lost his parents and his godfather, mocks him to be a coward, resulting in Harry was thrown into a wall by an angry Remus. But Remus Lupin decided that Harry was right and come back a few days later. They have a son named Edward Remus 'Teddy' Lupin. He is a metamorphmagus, just like his mother, Tonks, and is known for having aqua colored hair. Both Tonks and Lupin are murdered during the Battle of Hogwarts, Lupin by Antonin Dolohov, and Tonks by Bellatrix Lestrange, Tonks' maternal aunt. Following their death, Teddy Lupin lives under the care of Andromeda, Tonks' widowed mother, and his godfather, Harry Potter. Category:Harry Potter characters",
 "title": "Nymphadora Tonks"
}