{
 "id": "699995",
 "text": "The 2019 Memorial Cup (branded as the 2019 Memorial Cup presented by Kia for sponsorship reasons) was a four-team, round-robin format tournament held at the Scotiabank Centre in Halifax, Nova Scotia from May 17–26, 2019. ==Round- robin standings== Indicates team advanced directly to the championship game Indicates team advanced to the semifinal game Team GP W L GF GA PTS Halifax Mooseheads (QMJHL/host) 3 2 1 11 7 4 Guelph Storm (OHL) 3 2 1 12 8 4 Rouyn- Noranda Huskies (QMJHL) 3 2 1 12 11 4 Prince Albert Raiders (WHL) 3 0 3 6 15 0 ==Schedule== All times local (UTC −3) ===Round-robin=== ===Playoff round=== ====Semifinal==== ====Final==== ==Statistical leaders== ===Skaters=== Player Team GP G A Pts PIM Rouyn-Noranda Huskies 5 2 6 8 0 Guelph Storm 4 3 4 7 0 Guelph Storm 4 2 5 7 2 Rouyn-Noranda Huskies 5 5 1 6 8 Guelph Storm 4 3 3 6 8 Guelph Storm 4 3 3 6 0 Halifax Mooseheads 4 1 5 6 2 Rouyn-Noranda Huskies 5 1 5 6 0 Rouyn-Noranda Huskies 5 4 1 5 6 Halifax Mooseheads 4 3 2 5 2 GP = Games played; G = Goals; A = Assists; Pts = Points; PIM = Penalty minutes ===Goaltending=== This is a combined table of the top goaltenders based on goals against average and save percentage with at least 60 minutes played. The table is sorted by GAA. Player Team GP W L OTL SA GA GAA SV% SO TOI Halifax Mooseheads 4 2 2 0 134 11 2.78 .918 0 237 Guelph Storm 4 2 2 0 125 13 3.28 .896 0 238 Rouyn-Noranda Huskies 4 3 1 0 127 15 3.75 .882 0 240 Prince Albert Raiders 3 0 3 0 93 13 4.36 .860 0 179 GP = Games played; W = Wins; L = Losses; SA = Shots against; GA = Goals against; GAA = Goals against average; SV% = Save percentage; SO = Shutouts; TOI = Time on ice (minutes:seconds) ==Awards== The CHL handed out the following awards at the conclusion of the 2019 Memorial Cup: * Stafford Smythe Memorial Trophy (Most outstanding player): Joël Teasdale, Rouyn-Noranda Huskies * Ed Chynoweth Trophy (Top scorer): Jakub Lauko, Rouyn-Noranda Huskies * George Parsons Trophy (Most sportsmanlike player): Nick Suzuki, Guelph Storm * Hap Emms Memorial Trophy (Best goaltender): Alexis Gravel, Halifax Mooseheads * Memorial Cup All-Star Team: ::Goaltender: Alexis Gravel, Halifax Mooseheads ::Defence: Sean Durzi, Guelph Storm; Noah Dobson, Rouyn-Noranda Huskies ::Forwards: Isaac Ratcliffe, Guelph Storm; Félix Bibeau, Rouyn-Noranda Huskies; Benoit-Olivier Groulx, Halifax Mooseheads ==Rosters== ===Halifax Mooseheads (host)=== *Head coach: Éric Veilleux Pos. No. PlayerHalifax Mooseheads roster G 1 Alexis Gravel G 29 Cole McLaren D 2 Denis Toner D 3 Walter Flower D 12 Patrick Kyte D 14 Jared McIsaac D 16 Jake Ryczek D 20 Justin Barron D 79 Jocktan Chainey F 8 Brock McLeod F 19 Benoit-Olivier Groulx F 21 Arnaud Durandeau F 23 Keith Getson F 28 Ben Higgins F 48 Ostap Safin F 50 Raphaël Lavoie F 61 Joel Bishop F 67 Xavier Parent F 71 Maxim Trépanier F 72 Samuel Asselin F 88 Antoine Morand F 91 Marcel Barinka F 94 Samuel Dubé ===Rouyn-Noranda Huskies (QMJHL)=== *Head coach: Mario Pouliot Pos. No. PlayerRouyn-Noranda Huskies roster G 1 Samuel Harvey G 31 Zachary Emond D 3 Jacob Neveu D 4 Justin Bergeron D 6 Samuel Régis D 7 Alexis Arsenault D 8 William Cyr D 27 Ryan MacLellan D 53 Noah Dobson F 10 Louis-Filip Côté F 11 Rafaël Harvey-Pinard F 12 William Rouleau F 13 Jakub Lauko F 14 Mathieu Gagnon F 15 Vincent Marleau F 16 Alex Beaucage F 19 Patrik Hrehorcak F 20 Tommy Beaudoin F 21 Félix Bibeau F 22 Peter Abbandonato F 23 Samuel Naud F 24 Joël Teasdale F 25 Tyler Hinam ===Guelph Storm (OHL)=== *Head coach: George Burnett Pos. No. PlayerGuelph Storm roster G 32 Anthony Popovich G 35 Nico Daws D 4 Owen Lalonde D 5 Dmitri Samorukov D 6 Sean Durzi D 11 Daniil Chayka D 22 Jack Hanley D 23 Zack Terry D 25 Markus Phillips D 29 Fedor Gordeev F 7 Zachary Roberts F 8 Cam Hillis F 9 Nick Suzuki F 10 MacKenzie Entwistle F 12 Keegan Stevenson F 13 Alexey Toropchenko F 14 Cedric Ralph F 15 Liam Hawel F 16 Nate Schnarr F 17 Pavel Gogolev F 19 Isaac Ratcliffe F 20 Ben McFarlane F 21 Ty Collins F 27 Domenico Commisso ===Prince Albert Raiders (WHL)=== *Head coach: Marc Habscheid Pos. No. PlayerPrince Albert Raiders roster G 33 Ian Scott G 35 Boston Bilous D 3 Jeremy Masella D 5 Zack Hayes D 6 Kaiden Guhle D 8 Brayden Pachal D 10 Max Martin D 12 Sergei Sapego D 14 Loeden Schaufler F 11 Spencer Moe F 15 Brian Harris F 16 Jakob Brook F 17 Dante Hannoun F 18 Noah Gregor F 19 Ozzy Wiesblatt F 20 Brett Leason F 21 Aliaksei Protas F 23 Eric Pearce F 24 Cole Fonstad F 25 Sean Montgomery F 27 Parker Kelly F 29 Justin Nachbaur ==Road to the Cup== ===OHL playoffs=== ===QMJHL playoffs=== ===WHL playoffs=== ==References== ==Other websites== * Memorial Cup * Canadian Hockey League Memorial Cup Category:Memorial Cup",
 "title": "2019 Memorial Cup"
}