{
 "id": "70009",
 "text": "DNA repair means the processes by which a cell identifies and corrects damage to its DNA molecules. In cells, normal metabolic activities and environmental factors such as UV light and radiation damage DNA. There are as many as a million molecular lesions per cell per day.Lodish H. et al 2004. Molecular biology of the cell. 5th ed, New York: Freeman, p963. Many of these lesions cause structural damage to the DNA molecule and can alter or eliminate the cell's ability to transcribe the affected gene. Other lesions induce potentially harmful mutations in the cell's genome, which affect the survival of its daughter cells after it divides. The DNA repair process must be constantly active so it can respond rapidly to any damage in the DNA structure. The rate of DNA repair depends on many factors, including the cell type, the age of the cell, and the extracellular environment. A cell that has accumulated a lot of DNA damage, or one that no longer effectively repairs damage, can enter one of three states: # an irreversible state of dormancy, known as senescence # cell suicide, also known as apoptosis (programmed cell death) # unregulated cell division, which can lead to the formation of a tumor that is cancerous == DNA repair == The rate of DNA repair depends on many factors, including the cell type, the age of the cell, and the extracellular environment. Many genes that were initially shown to influence life span have turned out to be involved in DNA damage repair and protection.Browner W.S. et al 2004. The genetics of human longevity. Am J Med 117 (11): 851–60. == Damage and mutation == DNA damages and mutation are fundamentally different. *Damages are physical abnormalities in the DNA, such as single- and double- strand breaks. DNA damages can be recognized by enzymes, and so they can be repaired. Repair needs the undamaged sequence in the complementary DNA strand or in a homologous chromosome. If a cell retains DNA damage, transcription of a gene can be prevented, and, thus, translation into a protein will also be blocked. Replication may also be blocked or the cell may die. *A mutation is a change in the base sequence of the DNA. A mutation cannot be recognized by enzymes once the base change is present in both DNA strands, so a mutation cannot be repaired. At the cellular level, mutations can cause alterations in protein function and regulation. Mutations are replicated when the cell replicates. In a population of cells, mutant cells will increase or decrease in frequency according to the effects of the mutation on the ability of the cell to survive and reproduce. Although different from each other, DNA damages and mutations are related because DNA damages often cause errors of DNA synthesis during replication or repair; these errors are a major source of mutation. DNA damages in frequently dividing cells, because they give rise to mutations, are a prominent cause of cancer. In contrast, DNA damages in infrequently dividing cells are likely a prominent cause of aging. == 2015 Nobel Prize research == The 2015 Nobel Prize for Chemistry went to three scientists who each discovered part of the DNA repair story. *Tomas Lindahl FRS, who is Swedish and works in the UK, discovered a mechanism called base excision repair. It counteracts the degradation of DNA. *Turkish-born Aziz Sancar, professor at the University of North Carolina, found a different DNA repair called nucleotide excision repair. *American Paul Modrich, at Duke University in North Carolina, showed how how cells correct DNA flaws which occur in cell division. This mechanism, called mismatch repair, results in a 1,000-fold reduction in the error frequency when DNA is replicated.Rincon, Paul 2015. Chemistry Nobel: Lindahl, Modrich and Sancar win for DNA repair. BBC News Science & Environment. == References == == Other websites == *Human DNA repair diseases *DNA Repair *DNA Damage and DNA Repair Category:DNA",
 "title": "DNA repair"
}