{
 "id": "700199",
 "text": "A water supply system or 'water supply network' is an engineering system which provides a supply of water. A water supply system typically includes: # A supply of pure water for drinking and other uses. That is why almost all large cities are are on or near to rivers. However, water can be moved distances along pipes or aquifers. # Water storage facilities such as reservoirs, water tanks, or water towers are necessary. Smaller water systems may store the water in cisterns or pressure vessels. Tall buildings may need to store water locally in pressure vessels in order for the water to reach the upper floors. # Water pressurizing by such as pumping stations are usually needed at the outlet of underground or above ground reservoirs or cisterns (if gravity flow is impractical). # A pipe network for distribution of water to the consumers (which may be private houses or industrial, commercial or institution establishments) and other usage points (such as fire hydrants). The second part of the system is dealing with the sewage and waste water which is eventually put back or comes back into the system. Crittenden, John C. et al (eds) 2005. Water treatment: principles and design. 2nd ed, Hoboken, NJ. Wiley. ISBN 0-471-11018-3 If this' waste water' is not purified, cholera and typhoid epidemics will occur, and still do occur, in cities where the water engineering has not kept pace with population increase.Neumann H. 1981. Bacteriological safety of hot tap water in developing countries. Public Health Rep. 84:812-814. # Water purification facilities. After any solids in the water have settled out, the water is aerated. This is done by running it slowly over an aerated pebble bed, or through a sand bed. The oxygen in the water kills off the bacteria which are anaerobic. Sometimes poisonous red algae survive, and if so these are killed by adding chlorine to the water. The water is then examined (sampled) under a microscope, and its bacterial content recorded. There are standards set by government for the permitted limits to any kind of foreign objects and to the chemical and biological composition of the water. #Treated water is transferred using water pipes (usually underground). This type of system was a consequence of the work of John Snow on the mid-19th century cholera plagues in London.History of the chelsea Waterworks. Despite all efforts, epidemics do still occur if there are leaks in the underground sewage system and leaks in the underground water pipes. *The engineer responsible for the creation of a sewer network for central London was Joseph Bazalgette. This work relieved the city from cholera epidemics (Great Stink), and started cleaning the River Thames. == References == Category:Engineering Category:Microbiology Category:Water Category:Plague",
 "title": "Water supply system"
}