{
 "id": "700184",
 "text": "is a Japanese professional baseball pitcher that plays for the Los Angeles Dodgers of Major League Baseball (MLB). He previously played for the Los Angeles Angels (MLB) and the Hokkaido Nippon-Ham Fighters of Nippon Professional Baseball's (NPB) Pacific League. Carrer Ohtani was the first pick of the Fighters in the 2012 draft. He played in NPB for the Fighters from 2013 through 2017 as a pitcher and an outfielder. Ohtani recorded the fastest pitch by a Japanese pitcher and in NPB history at 165 kilometres per hour (102.5 mph). The Fighters posted Ohtani to MLB after the 2017 season, and he signed with the Angels. He won the 2018 American League Rookie of the Year Award. He hit for the cycle on June 13, 2019.In the 2021 season, he became only the second Japanese player in history (and only the second Asian player in history) to win the season MVP and Silver Slugger Award since Ichiro in 2001. The Angels' Shohei Ohtani's 2021 season was selected No. 1 on the list. In the same month, he won the Associated Press Male Athlete of the Year award.On August 9, 2022, he became the first MLB player in nearly 104 years since Babe Ruth to reach double-digit wins and double-digit home runs; on October 5, he became the first player in the modern MLB to reach regulation innings (pitched and batted in) as both a pitcher and hitter.In the 2023 WBC, he made a major contribution to the Japanese national team as an ace and hitter, becoming the first player in WBC history to be named to the All-WBC team in two categories (pitcher and designated hitter) and the MVP of the WBC. In the season, he became the first Japanese and the first Asian in history to hit the most home runs. He also won the Silver Slugger Award for the second time in Japanese history (and the second time in Asian history), and became the first Japanese (and the first Asian) to win the MVP award for the second time in a season. He also won the Hank Aaron Award, the first ever for a Japanese or an Asian. ==Controversy over interpreter's payment to bookmaker== Ohtani speaks some English, but is not fluent; He knows Spanish, but prefers to speak to the media through an interpreter who translates from Japanese to English, and English to Japanese. Ippei Mizuhara was Ohtani's personal interpreter when Ohtani played for the American teams Angels and Dodgers; That interpreter has known Ohtani since he was 18, starting in 2013 when Ohtani played for a Japanese team. Mizuhara also became a confidant, conditioning coach, and throwing partner. In March 2024, an investigation by ESPN, found that $4.5 million in wire payments, were made from Ohtani's bank account to a Southern California bookmaking operation that was under investigation by federal law enforcement; On the evening of March 19, Mizuhara told ESPN in a 90-minute interview that he had asked Ohtani to repay the debts and that Ohtani himself transferred them to the bookie; Mizuhara also told this story to the Dodgers clubhouse after a game that day. However, as ESPN prepared to air the interview on the morning of March 20, Ohtani's law firm issued a statement reading, \"We discovered that Shohei has been the victim of a massive theft, and we are turning the matter over to the authorities.\" That afternoon, the Dodgers fired Mizuhara, who had signed a contract with the team when Ohtani joined. \"Ohtani’s representatives accused his interpreter, Ippei Mizuhara, of a “massive theft” of Ohtani’s money in order to pay off an illegal bookmaker [...]. And whether it involves Ohtani or not, it’s already baseball’s biggest gambling scandal since Pete Rose in 1989\", according to a Politico article in 2024's first quarter.https://www.politico.com/news/magazine/2024/03/21/sports- gambling-scandals-legalization-00148243. Retrieved 2024-03-21 On June 4, Ohtani was officially cleared of any wrongdoing in the incident. == References == Category:1994 births Category:Japanese baseball players Category:Los Angeles Angels of Anaheim players Category:Los Angeles Angels players Category:Sportspeople from Iwate Prefecture Category:Living people",
 "title": "Shohei Ohtani"
}