{
 "id": "700344",
 "text": "St. Mary's Food Bank Alliance is a nonprofit, nonsectarian organization in Phoenix, Arizona. It was founded in 1967 by John van Hengel. St. Mary's was the first modern organization to operate using the food bank model. This spread throughout the U.S and the rest of the world. Today, St. Mary's is known as the world's first food bank.https://www.feedingknowledge.net/02-search?p_p_id=1_WAR_feeding_knowledgeportlet&p;_p_lifecycle=2&p;_p_state=maximized&p;_p_mode=view&p;_p_cacheability=cacheLevelPage&_1_WAR_feeding_knowledgeportlet_cmd=serveAttachment&_1_WAR_feeding_knowledgeportlet_stepAttachmentId=9107&_1_WAR_feeding_knowledgeportlet_callId=6204&_1_WAR_feeding_knowledgeportlet_mvcPath=%2Fcalls%2Fview_all_steps.jsp&_1_WAR_feeding_knowledgeportlet_languageId=en_GB ==Operation== Since its creation, St. Mary's has expanded its operations to 9 of Arizona's 15 counties.https://www.firstfoodbank.org/ They have given millions of pounds of food each year. ==Pantry== St. Mary's also operates its own food pantry. It allows people to get food directly from the warehouse. ==Programs== St. Mary's is a member of Feeding America, a network of hunger-relief organizations also founded by van Hengel for giving food to people across the country. ===Partnerships and Support=== Companies and organizations that have partnered with St. Mary's include: ===Education=== The organization also offers specialized programs apart from food banking. It includes after-school programs for children and career training for adults. ==Community involvement== St. Mary's depends on involvement from people within the community to continue operating. Some of the ways that people have involved include: == References == ==Other websites== * St. Mary's Food Bank website * Feeding America website * Charity Navigator profile | St. Mary's Food Bank Category:Pages created with the Article Wizard from 2019 Category:Non-profit organizations of the United States Category:Phoenix, Arizona Category:1967 establishments in the United States Category:20th-century establishments in Arizona",
 "title": "St. Mary's Food Bank Alliance"
}