{
 "id": "70039",
 "text": "The Apprentice is a reality television show that first aired in 2004 in the United States. The person who came up with the show was Mark Burnett, who earlier successfully brought the British series Survivor to the US. Until 2016, it was hosted by then-businessman Donald Trump, but in 2005, there was a spin-off hosted by Martha Stewart. The American version of the show had fifteen seasons. In the first six seasons and the 10th season, the people who appeared on the show were ordinary people. In seasons 7 to 9 and from season 11 onwards, these people were celebrities, who try to win money for charities instead of running one of Trump's companies. This version of the show is called The Celebrity Apprentice. == Format == In the program, a group of 14 to 18 people hope to get a job worth US$250,000 to run one of Trump's companies. In each episode, the contestants are split into two teams who each have to do a task. The task could be selling something, making an advertisement, or running a stall at an event. In the end, one team will win (usually because they have made the most money) and they will get a prize of some sort. The people on the team that loses have to explain to Trump what went wrong, and at the end of every episode, Trump will say \"You're fired!\" to one or more people from this team, who then no longer appears in the show for the rest of the season. However, in the very last episode, Trump says \"You're hired!\" to the person who wins the grand prize instead. === Seasons === Year Series Host Location Winner Contestants Tasks Average viewers (Millions) 2004 1 Donald Trump New York City Bill Rancic 16 14 20.7 2 Kelly Perdew 18 15 16.1 2005 3 Kendra Todd 16 14.0 4 Randall Pinkett 12 11.0 2006 5 Sean Yazbeck 14 9.7 2007 6 Los Angeles Stefanie Schaeffler 13 7.5 2010 10 New York City Brandy Kuentzel 16 4.7 Seasons 7 to 9 were released under the title of Celebrity Apprentice because the contestants were famous. Because of this, the seventh version of the original show (with ordinary people) is titled as season 10. == Hosting == Trump hosted the show until he became President of the United States in 2016.\"NBC officially fires Donald Trump from 'Celebrity Apprentice'.\" Associated Press (via Fox News). 2015-08-13. Retrieved 2015-03-21. The most recent season, which aired in 2017, had Arnold Schwarzenegger in charge, but Trump continued to be the executive producer. However, Schwarzenegger left the show at the end of the season after he was criticized by Trump for low ratings. Many countries have their own version of The Apprentice, each having a different person in charge. For example, the version from the United Kingdom has Alan Sugar. == Spin-offs == === The Apprentice: Martha Stewart === The Apprentice: Martha Stewart was a one-time spin-off of the main show which featured Martha Stewart instead of Donald Trump. The show had a very similar format, with 16 contestants competing for a job. The show was not as popular as Donald Trump's and ended after one season. The winner was Dawna Stone. === The Celebrity Apprentice === The Celebrity Apprentice was a version of Donald Trump's show which featured celebrities and famous people as contestants instead of ordinary businesspeople. Each celebrity had a charity that they were representing. The celebrities would have to complete challenges in teams (much like the original version). The winning team would get money for their charities but one person from the losing team would be removed from the game. The last person remaining won more money for their charity. Year Series Host Location Winner Contestants Tasks Average viewers (Millions) 2008 7 Donald Trump New York City Piers Morgan 14 13 11.0 2009 8 Joan Rivers 16 9.0 2010 9 Bret Michaels 14 11 7.4 2011 11 John Rich 16 13 8.8 2012 12 Arsenio Hall 18 15 7.1 2013 13 Trace Adkins 14 12 5.6 2015 14 Leeza Gibbons 16 13 7.6 2017 15 Arnold Schwarzenegger Los Angeles Matt Iseman 4.8 Seasons of Celebrity Apprentice were run alongside the original show. Because of this, the first season of Celebrity Apprentice is the seventh season of the show overall. == Seasons == === The Apprentice === *Season 1 ran from January to April 2004. It was watched by 20.7 million people and the winner was Bill Rancic. *Season 2 ran from September to December 2004. It was watched by 16.1 million people and the winner was Kelly Perdew. *Season 3 ran from January to May 2005. It was watched by 14.0 million people and the winner was Kendra Todd. *Season 4 ran from September to December 2005. It was watched by 11.0 million people and the winner was Randal Pinkett. *Season 5 ran from February to June 2006. It was watched by 9.7 million people and the winner was Sean Yazbeck. *Season 6 ran from January to April 2007. It was watched by 7.5 million people and the winner was Stefanie Schaeffer. *Season 10 ran from September to December 2010. It was watched by 4.7 million people and the winner was Brandy Kuentzel. === The Celebrity Apprentice === *Season 7 ran from January to March 2008. It was watched by 11.0 million people and the winner was Piers Morgan. *Season 8 ran from March to May 2009. It was watched by 9.0 million people and the winner was Joan Rivers. *Season 9 ran from March to May 2010. It was watched by 7.4 million people and the winner was Bret Michaels. *Season 11 ran from March to May 2011. It was watched by 8.8 million people and the winner was John Rich. *Season 12 ran from February to May 2012. It was watched by 7.1 million people and the winner was Arsenio Hall. *Season 13 ran from March to May 2013. It was watched by 5.6 million people and the winner was Trace Adkins. *Season 14 ran from January to February 2015. It was watched by 7.6 million people and the winner was Leeza Gibbons. *Season 15 ran from January to February 2017. It was watched by 4.9 million people and the winner was Matt Iseman. == Other versions == The series was very popular in America and was adapted in several other countries, most notably in the UK and Australia. == Sources == == Other websites == * Category:2004 American television series debuts Category:English-language television programs",
 "title": "The Apprentice"
}