{
 "id": "700340",
 "text": "The Kansas Historical Society is the official state historical society of Kansas. It is in Topeka. ==History== The Kansas Editors' and Publishers' Association created the Kansas Historical Society in 1875. They wanted to save old and new documents. In 1879, the Kansas Legislature said that the Kansas Historical Society was the official group for saving Kansas's history.Larry O. Jochims and Virgil W. Dean, \"Pillars of Society: A Brief History of the Kansas Historical Society,\" Kansas History: A Journal of the Central Plains, 2 (Autumn 1995):142-163. Autumn 1995 Accessed 13 October 2013KSHS History Accessed 13 October 2013 Their budget is about six million dollars, and they have about 100 employees. The Kansas Historical Society's first website was created in 1993 by two KU students. It was on the University of Kansas's website. It was the first state or city historical society website ever. The Kansas Historical Society created its own website in 1998. It has about 4,000 pages of information, and it has received many awards. ==Awards== The Kansas Historical Society has received many awards from other groups related to history:KSHS Awards Accessed 13 October 2013 * 1998 - American Association for State and Local History * 1999 - Santa Fe Trail Association * 2001 - American Association for State and Local History * 2001 - American Association for State and Local History * 2002 - American Association for State and Local History * 2002 - American Association for State and Local History * 2003 - Travel Industry Association of Kansas * 2004 - American Association for State and Local History * 2006 - American Association for State and Local History * 2006 - American Association for State and Local History * 2007 - Family Tree Magazine Award * 2008 - American Association for State and Local History * 2008 - American Association for State and Local History * 2008 - Western Writer’s Association of America * 2009 - Oregon-California Trail Association * 2011 - United States Department of the Interior Partners in Conservation Award ==References== ==Other websites== * Official website * Kansas Memory, the Society's digital portal * Register of Historic Kansas Places database Category:Historical societies Category:1875 establishments in Kansas",
 "title": "Kansas Historical Society"
}