{
 "id": "70047",
 "text": "Rock art is a term in archaeology for any markings that were made on natural stone by human beings.The term \"rock art\" appears to have been used first used in about 1959: \"The rock art tells us little for certain about marriage customs.\" J D. Clark, Prehist. S. Afr. ix. 248, 1959 They can be divided into: *Petroglyphs – carvings into stone surfaces *Pictographs – rock and cave paintings In addition, there is rock art made by aligning or piling natural stones. The stones themselves are used as large markings on the ground. ==Location== One can find petroglyphs and pictographs on the walls of a cave or on rock in open-air. == Similar terms == Rock art has also been described as rock records,Moore G. 1861. The lost tribes and the Saxons of the East: with translations of rock-records in India. rock sculptures,Tylor 1865. Early history of Man. v. 88, \"Rock-sculptures may often be symbolic boundary marks\". rock inscriptions,Deutsch, Rem. 177, 1874: The long rock-inscription of Hamamât. rock carvings,Chadwick H.M. 1907. The rock-carvings at Tegneby. Origin Eng. Nation xii. 306. rock paintings,Encycl. Relig. & Ethics I. 822/2, 1908: \"The rock-paintings are either stencilled or painted in outline\". rock engravings,Wells H.G. 1920 Outl. Hist. I. xvii. 126/1: \"From rock engravings we may deduce the theory that the desert was crossed from oasis to oasis\". rock drawings,Winkler H.A. 1938. Rock-drawings of southern Upper Egypt I. 26. rock pictures,Man No. 119. 178/2, 1939: \"On one of the stalactite pillars was found a big round stone with traces of red paint on its surface, as used in the rock-pictures\" == Gallery == Image:Buddhas at ili.jpg|Buddhist stone carvings at Ili River, Kazakhstan Image:Bhimbetka.JPG|Rock Shelters of Bhimbetka rock painting, World Heritage Site File:Sweden-Brastad-Petroglyph Skomakaren-Aug 2003.jpg|\"The Shoemaker\", Brastad, Sweden == Related pages == *Cave painting *Upper Palaeolithic == References == == Further reading == *Malotki, Ekkehart and Weaver, Donald E. Jr., 2002, Stone Chisel and Yucca Brush: Colorao Plateau Rock Art, Kiva Publishing Inc., Walnut, CA, (cloth). For the \"general public\", this book has well over 200 color prints with commentary on each site where the photos were taken; the organization begins with the earliest art and goes to modern times. *Rohn, Arthur H. and Freguson, William M, 2006, Puebloan ruins of the Southwest, University of New Mexico Press, Albuquerque, NM, (pbk, : alk. paper). Adjunct to the primary discussion of the ruins, contains color prints of rock art at the sites, plus interpretations. *Schaafsma, Polly, 1980, Indian Rock Art of the Southwest, School of American Research, Sana Fe, University of New Mexico press, Albuquerque, NM, . Scholarly text with 349 references, 32 color plates, 283 black and white \"Figures\", 11 Maps, and 2 Tables. == Other websites == * Ekaterina, Devlet. 2001. Rock Art and the material culture of Siberian and central Asian shamanism. In The Archaeology of Shamanism. 43-54. 01/04/2007. * Rock Art studies - A Bibliographic database at the Bancroft Library containing over 10,000 citations to the world's rock art literature. * The website of Rock Art Foundation - Native American Rock Art * Trust for African Rock Art * British Rock Art Collection * ARARA American Rock Art Research Association. * Rupestre.net A rock art site, mainly devoted to Valcamonica and Alpine Rock Art. * EuroPreArt The database of European Prehistoric Art. * Art and Archaeology of the Dampier Archipelago * Bradshaw Foundation Supports dissemination of information on rock art, migration, and the study of artistic man around the world. *Rock Art in South Africa http://rockart.wits.ac.za/origins/ * UNESCO World Heritage: Rock Shelters of Bhimbetka Category:Stone Age art",
 "title": "Rock art"
}