{
 "id": "700458",
 "text": "The New-York Historical Society is an American history museum and library located in New York City. It is at the corner of 77th Street and Central Park West on the Upper West Side of Manhattan. The group was created in 1804 as New York's first museum. It has exhibitions, public programs, and research about the history of New York and the United States. It focuses on Manhattan. It has been at its current place since 1908. Louise Mirrer has been the president of the Historical Society since 2004. ==References== ==Further reading== *Shapiro, Gary. “Celebrations of Learning Knickerbocker”, The New York Sun, May 4, 2006 *Regis, Necee. “Don’t Expect to Relax on your visit to NYC”, The Boston Globe, November 21, 2005 *Fine Art Connoisseur, November/December 2006 *The American Musicals Project , Official website *Miller, Dan. “Focus on Education: Fifth Graders Visit Slavery Exhibit”, The Queens Times, November 24, 2005 *Review of Alexander Hamilton: The Man Who Made Modern America, Teachinghistory.org ==Other websites== * New-York Historical Society website * New-York Historical Society archival records at the New-York Historical Society Library * New-York Historical Society at Google Cultural Institute * The New–York Historical Society Documentary produced by Treasures of New York * General Index – Documents relative to the Colonial History of the State of New York by John Romeyn Brodhead * Documents relative to the Colonial History of the State of New York, Vol. 1 * Documents relative to the Colonial History of the State of New York, Vol. 2, 6, 7, 13, 14, 15, * Documents relative to the Colonial History of the State of New York, Vol. 3 * Documents relative to the Colonial History of the State of New York, Vol. 4 * Documents relative to the Colonial History of the State of New York, Vol. 5 * Documents relative to the Colonial History of the State of New York, Vol. 1–14 * Paris Documents 1-8, Vol. 9 (1631-1744) * - Paris Documents 9-17, (1745-1774) * Paris Vol. 11 * London Documents, 9–16 (1693-1706) * London Documents, 17–24 (1707-1733) * London Documents, (1734-1755) * London Documents, (1756-1767) * London Documents, (1768-1782) Category:Historical societies",
 "title": "New-York Historical Society"
}