{
 "id": "700577",
 "text": "Benjamin \"Ben\" Parker (better known as Uncle Ben) is a fictional character appearing in Marvel Comics by Stan Lee and Steve Ditko. The character appears in Spider-Man stories. == Fictional character biography == He is an uncle of Peter Parker because he is the brother of Peter's father Richard Parker. Uncle Ben and his wife Aunt May raised Peter since his parents died. Peter gets bitten by a radioactive spider and gets its powers. Peter sees a robbery happening and can do something about it but chooses not to. The criminal gets away and later kills Uncle Ben. Peter believes it is his fault for not having done anything to stop the robber so he decides to fight criminals by becoming the superhero Spider-Man. Uncle Ben was introduced in a Marvel Comics story called Amazing Fantasy # 15 in 1962. Unlike many comic book characters he stays dead. In later comics he is the one who told Peter Parker \"With great power, comes great responsibility.\" ==Uncle Ben in film== Uncle Ben was played by Cliff Robertson in the 2002 Spider-Man movie. In it Peter Parker fights back against a bully named Flash Thompson. Uncle Ben tells him to be careful about when to use his strength and that \"with great power, comes great responsibility.\" Peter says Uncle Ben is not his father and should stop pretending to be. When Peter finds Uncle Ben's killer, the killer pulls a gun at him and Peter pushes him out of a window. Peter later tells the Green Goblin \"I had a father. His name was Ben Parker.\" In the 2012 reboot The Amazing Spider-Man, Uncle Ben is played by Martin Sheen. Unlike in the original movie, and in the comics, Peter does not catch Uncle Ben's killer. Uncle Ben does teach Peter the importance of responsibility but he never says \"With great power, comes great responsibility.\" Uncle Ben did not appear, nor was he mentioned, in the movie Spider-Man: Homecoming or its sequel Spider- Man: Far From Home but was mentioned (though he didn’t appear) in its sequel Spider-Man: No Way Home. Category:Fictional characters introduced in 1962 Category:Marvel Comics superheroes",
 "title": "Uncle Ben"
}