{
 "id": "700723",
 "text": "hings Fall Apart is a novel that was written by Chinua Achebe. It came out in 1958. The story talks about life in Nigeria before colonialism and the Europeans came to Africa in the 19th century. The main character in the book is a man named Okonkwo. He is an Igbo man that lives in a fictional clan in Nigeria called Umuofia. There are three main parts of the story. The first part talks about Okonkwo's personal life and the Igbo culture and traditions. The second and third parts talk about the British colonialists and Christian missionaries. Things Fall Apart is a very important book. Many people see it as an archetype (something that other works have been based on) for other African novels.Sickels, Amy. \"The Critical Reception of Things Fall Apart\", in Booker (2011). The book has been sold over 20 million times. Time magazine said it was one of the best 100 English-language books from 1923 to 2005. == Story == === Part 1 === Okonkwo is a wrestling champion and a hardworking man. He was born in a poor family because his father was lazy and was in a lot of debt. This makes him hate his father. He tries to be the opposite of everything his father was. === Part 2 === In this part of the novel, Okonkwo and his family are away. Meanwhile, white men come to Umuofia and introduce their religion, Christianity. Okonkwo's son Nwoye becomes a Christian. === Part 3 === The village destroys the church because a convert disrespected an elder during a ritual. Because of that event, Okonkwo and other leaders go to jail. Okonkwo kills a messenger. However, the other ones escape. He realizes that the village will not fight back. Okonkwo kills himself to avoid being tried in court. Suicide is not acceptable to the Igbo and so Okonkwo loses his good name. == Characters == * Okonkwo is the main character. He has 3 wives and 10 kids. He tries very hard to not be like his father, who was considered an abomination (a terrible thing) because he died of swelling. However, he ends up as an abomination himself because suicide is not allowed in Igbo culture. ==References== Category:1958 books Category:English-language novels Category:Nigerian literature Category:Suicide in fiction",
 "title": "Things Fall Apart"
}