{
 "id": "700722",
 "text": "The Fulbright Program, including the Fulbright–Hays Program, is one of several United States Cultural Exchange Programs. The goal is to improve intercultural relations, cultural diplomacy, and intercultural competence between people from the United States and other countries by exchanging of people, knowledge, and skills. It is one of the most prestigious and fellowship programs in the world. It is also very difficult to receive a grant. American citizens including students, scholars, teachers, professionals, scientists and artists may receive scholarships or grants to study, do research, teach, or exercise their talents abroad. Citizens of other countries may do the same in the United States of America. The program was started by United States Senator J. William Fulbright in 1946 and is one of the most widely recognized and prestigious scholarships in the world. The program provides 8,000 grants annually. The Fulbright Program is administered by cooperating organizations such as the Institute of International Education. It is in over 160 countries around the world. The Bureau of Educational and Cultural Affairs of the U.S. Department of State sponsors the Fulbright Program and gets funding from the United States Congress from annual appropriation bills. Additional direct and in-kind support comes from partner governments, foundations, corporations, and host institutions both in and outside the U.S. In 49 countries, a bi-national Fulbright Commission administers and oversees the Fulbright Program. In countries without a Fulbright Commission but that have an active program, the Public Affairs Section of the U.S. Embassy manages the Fulbright Program. More than 370,000 people have participated in the program since it began; 59 Fulbright alumni have won Nobel Prizes; 82 have won Pulitzer Prizes. == History == In 1945, Senator J. William Fulbright proposed a bill to use the profits from selling surplus U.S. government war property to fund international exchange between the U.S. and other countries. The timing after the Second War was important. Alongside the United Nations, the Fulbright Program was an attempt to promote peace and understanding through educational exchange. The bill had a plan to forgive the debts foreign countries piled up during the war and in return for funding an international educational program. This program was planned to be an essential vehicle to promote peace and mutual understanding between individuals, institutions and future leaders anywhere in the world. On August 1, 1946, President Harry S. Truman signed the bill into law, and Congress created the Fulbright Program in what became the largest education exchange program in history. Since it began, the program has operated on a bi-nationally. Each country in the Fulbright Program has an agreement with the U.S. government. The first countries to sign agreements were China in 1947 and Burma, the Philippines, and Greece in 1948. == Program == The Fulbright Program works two ways: U.S. citizens may receive funding to go to a foreign country (U.S. Student Program, U.S. Scholar Program, Teacher Exchange Program, etc.) and non-U.S. citizens may come to the U.S. (Foreign Student Program, Visiting Scholar Program, Teacher Exchange Program, etc.). Candidates recommended for Fulbright grants should have high academic achievement, a strong project proposal or statement of purpose, demonstrated leadership potential, and flexibility and adaptability to work successfully with the host community abroad. Fulbright grants are offered in almost all academic disciplines except clinical medical research with patient contact. === Student grants === * The Fulbright U.S. Student Program offers fellowships for U.S. graduating seniors, graduate students, young professionals and artists to research, study, or teach English abroad for one academic year. * The Fulbright Foreign Student Program enables graduate students, young professionals and artists from abroad to conduct research and study in the United States. Some scholarships are renewed after the first year of study. * The Fulbright Foreign Language Teaching Assistant Program provides opportunities for young English teachers from overseas to refine their teaching skills and broaden their knowledge of American culture and society while strengthening the instruction of foreign languages at colleges and universities in the United States. * The International Fulbright Science and Technology Award, part of the Fulbright Foreign Student Program, supports doctoral study at leading U.S. institutions in science, technology, engineering or related fields for outstanding foreign students. This program is not active noew. * The Fulbright-mtvU Fellowships award up to four U.S. students to study the power of music as a cultural force abroad. Fellows do research for one academic year on projects of their own design about a chosen musical aspect. They share their experiences during their Fulbright year via video reports, blogs and podcasts. * The Fulbright-Clinton Fellowship lets U.S. students work in professional placements in foreign government ministries or institutions to get hands-on public sector experience in participating foreign countries. === Scholar grants === * The Fulbright Distinguished Chair Awards are about forty distinguished lecturing, distinguished research and distinguished lecturing/research awards. They are for three to 12 months. Fulbright Distinguished Chair Awards are some of the most prestigious appointments in the U.S. Fulbright Scholar Program. Candidates should be very well-known scholars and have a significant publication and teaching record. * The Fulbright Bicentennial Chair in American Studies at the University of Helsinki brings scholars of various disciplines to Finland. * The Fulbright U.S. Scholar Program sends American faculty members, scholars and professionals abroad to lecture or do research for up to a year. * The Fulbright Specialist Program sends U.S. academics and professionals to work as expert consultants on curriculum, faculty development, institutional planning, and related subjects at overseas institutions for a period of two to six weeks. * The Fulbright Visiting Scholar Program and Fulbright Scholar-in- Residence Program bring foreign scholars to lecture or do post-doctoral research for up to a year at U.S. colleges and universities. * The Fulbright Regional Network for Applied Research (NEXUS) Program is a network of junior scholars, professionals and mid-career applied researchers from the United States, Brazil, Canada, and other Western Hemisphere nations in a year-long program that includes multi-disciplinary, team-based research, a series of three seminar meetings, and a Fulbright exchange experience. === Teacher grants === * The Fulbright Teacher Exchange Program supports one-to-one exchanges of teachers from K–12 schools and a few post-secondary institutions. * The Distinguished Fulbright Awards in Teaching Program sends teachers abroad for a semester to do individual projects, research, and lead master classes or seminars. === Grants for professionals === * The Hubert H. Humphrey Program brings outstanding mid-career professionals from the developing world and societies in transition to the United States for one year. Fellows participate in a non-degree program of academic study and gain professional experience. * The Fulbright U.S. Scholar Program sends American scholars and professionals abroad to lecture or conduct research for up to a year. * The Fulbright Specialist Program sends U.S. faculty and professionals to serve as expert consultants on curriculum, faculty development, institutional planning, and related subjects at overseas academic institutions for two to six weeks. * The Fulbright U.S. Student Program offers fellowships for U.S. graduating seniors, graduate students, young professionals and artists to study abroad for one academic year. The Program also includes English Teaching Assistants. * The Fulbright Foreign Student Program helps graduate students, young professionals and artists from abroad do research and study in the United States. Some scholarships are renewed after the first year of study. === Fulbright–Hays Program === * Part of the Fulbright Program is a budget in the United States Department of Education for the Fulbright–Hays Program. * These grants are awarded to individual U.S. K through 14 pre-teachers, teachers and administrators, pre-doctoral students and post-doctoral faculty, as well as to U.S. institutions and organizations. Funding supports research and training efforts overseas. The training should focus on non-western foreign languages and area studies. == Notable alumni == Fulbright alumni have occupied key roles in government, academia, and industry. Of the 325,000+ alumni: * 84 have received the Pulitzer Prize * 72 have been MacArthur Fellows * 59 have received a Nobel Prize * 37 have served as head of state or government * 10 have been elected to US Congress * 1 has served as secretary general of the United Nations == Related pages == * German Academic Exchange Service (Deutscher Akademischer Austauschdienst) * Rhodes Scholarship == References == == Other websites == * U.S. Department of State Fulbright Website, the program's sponsor * Fulbright–Hays information, U.S. Department of Education * Fulbright Student Program Homepage * Fulbright Scholar Program, grants for university and college faculty, administrators and professionals * Fulbright Teacher Exchange Programs , K–12 Teacher Exchange ;Lists of past grantees * Fulbright Scholar Directory * US Student Program * Foreign Student Program Category:1946 establishments in the United States Category:United States Department of State Category:American awards",
 "title": "Fulbright Program"
}