{
 "id": "700727",
 "text": "Eutin () is the district capital of Eastern Holstein county. It is in the north German state of Schleswig-Holstein. As of 2015, about 17,000 people lived in the town. ==History== The name Eutin (originally Utin) is Slavic. Its meaning is not clear. It probably came from the personal name \"Uta\". The Slavic Obotrites tribe settled eastern Holstein in the 7th/8th centuries A.D. and built a castle on Pheasant Island in the lake now called the Großer Eutiner See. Dutch settlers came to live in Utin in the twelfth century. In 1156 Eutin became a market town. It later became the seat of the Prince- Bishopric of Lübeck because Lübeck itself was an imperial free city. When the bishopric was secularized in 1803, Eutin became part of the Duchy of Oldenburg. In the Greater Hamburg Act of 1937, Eutin passed from the Free State of Oldenburg to the Prussian Province of Schleswig-Holstein. After World War II, it became part of the modern Bundesland of Schleswig-Holstein. ==Culture== Eutin is birthplace of composer Carl Maria von Weber. To honor him, an open-air theater () was built in the park of Eutin Castle in 1951. Operas are performed there in July and August during the Eutin Opera Summer Festival (). The seating capacity of this open-air venue is about 2000. The festival includes music students in Eutin aand students from the University of Kansas in Lawrence, Kansas, United States. Lawrence is a twin city with Eutin. Eutin has an annual Blues Festival (Bluesfest Eutin) at the beginning of summer. Local musicians, as well as up and coming blues artists from around the world, come to play at this three-day outdoor blues festival. The festival is in the market place in the center of town. Admission is free. File:Eutin Marktplatz.jpg|Eutin central market place 'Marktplatz' File:Eutin All Time Stars.jpg|Eutin All Time Stars, BluesBaltica/Bluesfest 2014 ==Geography and economy== Eutin is surrounded by lakes of the Holsteinische Schweiz, including the Großer Eutiner See, Kleiner Eutiner See, Kellersee and Ukleisee. There are forests around the lakes. Popular activities on these lakes include boating, canoeing, rowing, swimming, and fishing. Schleswig-Holstein, particularly Eutin, has many rapeseed fields. They produce biofuel. Wind turbines are also a common in this rural region. ==International relations== Eutin is twinned with: * Nykøbing Falster, Denmark * Putbus auf Rügen, Germany * Lawrence, Kansas, US Each summer, Lawrence and Eutin have an exchange program. High- school students from Lawrence and college students from the University of Kansas have some weeks in Eutin. German students from Eutin come to Lawrence to study. The University of Kansas also created an internship exchange program with Eutin. ==References== ==Other websites== *Official website *Website of the Eutin Opera Summer Festival *View of Eutin from a live webcam on top of the Water Tower. Category:Towns in Schleswig-Holstein",
 "title": "Eutin"
}