{
 "id": "700708",
 "text": "Greta Thunberg (born 3 January 2003) is a Swedish activist. She is known for her work against climate change, a popular example of youth activism. She started protesting on 20 August 2018, outside of the Swedish Parliament in Stockholm. In December 2018, she attended the UN Climate Change Conference. In the next month, she gave a speech on the World Economic Forum in Davos. She has received many awards. Three Norwegian MPs nominated her for the 2019 Nobel Peace Prize. On 15 March 2019, approximately 1,400,000 people around the world, mainly students, protested against climate change. On 24 May 2019, a second major protest took place.. In December 2019, Time magazine named Thunberg Time Person of the Year 2019. == Early life == Greta Thunberg was born on 3 January 2003. She is the oldest daughter of Malena Ernman, an opera singer and actor Svante Thunberg. Her grandfather is actor and director Olof Thunberg. At a TEDx speech in November 2018, Thunberg stated that she first heard about climate change at the age of eight, but could not understand why so little was being done about it. At age 11, she had depression and stopped talking. Later, she was diagnosed with Asperger syndrome, obsessive–compulsive disorder (OCD), and selective mutism. She added that selective mutism means that she was speaking only when she needed to and that \"now is one of those moments\". She further added that the \"spectrum\" was an advantage \"as almost everything is black or white\". She said: \"I feel like I am dying inside if I don't protest\". She hands out leaflets outside the Swedish parliament with the phrase \"I am doing this because you adults are shitting on my future.\" Her father doesn't like that she misses school but says: \"[We] respect that she wants to make a stand. She can either sit at home and be really unhappy, or protest, and be happy\". To lower her family's carbon footprint, she insisted on becoming vegan and give up flying. She said she persuaded her parents to give up eating meat by making them feel guilty. \"I kept telling them that they were stealing our future.\" Her mother gave up her international career as an opera singer. Despite invitations to speak at international events, Greta also avoids flying. Thunberg says her teachers are divided in their views about her missing class to make her protest. She says: \"As people they think what I am doing is good, but as teachers they say I should stop.\" A teacher who supports her said: \"Greta is a troublemaker, she is not listening to adults. But we are heading full speed for a catastrophe, and in this situation the only reasonable thing is to be unreasonable.\" == Works == In May 2019 Penguin, a British publishing house, published No One Is Too Small to Make a Difference, which is a collection of her speeches. Penguin published Scenes from the Heart, the Thunberg family's story, in August 2018. All earnings from these books will be donated to charity. In the same month, artist Jody Thomas painted a mural of Thunberg on a wall in Bristol. It portrays the bottom half of her face as if under rising sea water. In 2022 she published The Climate Book. == References == ==Other websites== * * Category:Time People of the Year Category:2003 births Category:Living people Category:Climate activists Category:Swedish environmentalists Category:Writers from Stockholm Category:Youth activists",
 "title": "Greta Thunberg"
}