{
 "id": "700890",
 "text": "The Bengali–Assamese script (also Eastern Nagari script\". In fact, the term 'Eastern Nagari' seems to be the only designation which does not favour one or the other language.\" ) is the fifth most widely used writing system in the world. It is the basis of the Bengali alphabet, Assamese alphabet and Tirhuta (a mix of Devanagari and Eastern Nagari). It is the official script for three official languages, which are Assamese language, Bengali language and Meitei language (constitutionally termed as \"Manipuri\"). Besides its official usages, it is also used to write Kokborok (Tripuri) and Bishnupriya, Angika, Bodo, Karbi, Maithili and Mising to some extend.Prabhakara, M S Scripting a solution , The Hindu, 19 May 2005. Modern Sylheti uses the alphabet, alongside Sylheti Nagari. It was originally used to write Sanskrit. Today, in Eastern India, the use of Eastern Nagari for Sanskrit continues. == Description == The Bengali—Asamese script wasn't created to write a certain language, but it was the main script in the eastern regions of Medieval India. The script was also used to write Sanskrit. In this region, Hindu epics (Mahabharata, Ramayana etc.) were written in older versions of the Eastern Nagari script in this region. After the medieval period, Pali succeeded Sanskrit as the new written language in the region. The vernacular dialects of Pali eventually evolved into Bengali, Assamese and other related languages. Sankardev used the script in the 15th and 16th centuries to compose his writings in Assamese. Madhava Kandali used it to write the Assamese Ramayana in the 14th century. It was also used by the later Ahom kings to write the Buranjis, the Ahom chronicles, in the Assamese language. There is a rich legacy of Eastern Indian literature written in this script, which is still occasionally used to write Sanskrit today. Like Devanagari, Eastern Nagari also uses dozens of consonant clusters. They are represented by different and sometimes quite irregular characters. Thus, learning to read the script is complicated by the many characters and character combinations, numbering about 500. Efforts at standardizing the script for the Bengali language continue, but there isn't a uniform spelling for Bengali, as many people continue to use various archaic forms of letters. Among the regional variations within this script, only the Bengali and Assamese variations exist today in the formalized system. It seems that the need to typeset Eastern Nagari on computers will influence greatly its standardization. Since around 2001, there is work to develop Unicode fonts, and it seems likely that it will split into two variants, traditional and modern. == Script == In this and other articles on Wikipedia dealing with the Assamese and Bengali languages, a Romanization scheme used by linguists specializing in Assamese and Bengali phonology is included along with IPA transcription. === Vowels === * Assamese Vowels * Bengali Vowels * Maithili Vowels The script presently has 11 vowel letters, used to represent the seven vowel sounds of Bengali and eight vowel sounds of Assamese, along with a number of vowel diphthongs. All of these vowel letters are used in both Assamese and Bengali. Some of the vowels have different sounds depending on the word. There's a number of vowel distinctions who are preserved in the writing system but they are not pronounced as such in modern spoken Bengali or Assamese. For example, the script has two letters for the vowel sound [i] and two letters for the vowel sound [u]. This difference arised from the time when Eastern Nagari was used to write Sanskrit, a language that had a short and a long , and a short and a long . These letters are preserved in the script with their traditional names of \"short i\" and \"long i\", etc., despite that they are no longer pronounced differently in ordinary speech. Two additional modified Vowels, and , are not considered letters of the Eastern Nagari script, but are often used in Assamese and Bengali (respectively) to represent certain vowels when the intended pronunciation would otherwise be ambiguous. The latter vowel, which is used in Bengali, is used frequently to transcript texts originally written in other alphabets, most notably Latin. Vowel Table Vowels Vowel Diacritic symbol Assamese Bengali BishnupriyaManipuri MeiteiManipuri Sylheti Hajong Rabha Rajbongsi – ô ô/o ô ô/a o o ô ô ʼ o – – – – – – – a a a a꞉ a a a a – æ – – – – – – – – – – – â â – i i i i i i i i – – – – – – î – ী i i i – ī – – (i) u u u u u u u u – – – – – – â – u u u – ū – – (u) ri ri ri – ri – – ri rii rii – – – – – – li li – – – – – – lii lii – – – – – – ê e/ê e e ê e e ê e – – – – – – – ôi ôi ôi ei oi oi – ôi û o u o/ô – ô o o ôu ôu ôu ou ou ôu – ôu Vowel signs can be used in conjunction with consonants to modify the consonant's pronunciation (e.g. , kô). When there isn't a vowel diacritic symbol, the vowel \"\" (ô) is the default vowel for the consonant. For example, under this rule, the letter চ is pronounced cho. To note the absence of a vowel, a hôsôntô (্) may be written underneath the consonant, e.g. দ্ d. === Consonants === The names of the consonant letters in Eastern Nagari are typically just the consonant's main pronunciation plus the inherent vowel \"\" ô. Since the inherent vowel is not written, most letters' names look identical to the letter itself (e.g. the name of the letter \"\" is itself ghô, not gh). Some letters that have lost their distinctive pronunciation in Modern Assamese and Bengali are having the same pronunciation with other letters. For example, since the consonant phoneme /n/ is represented by the consonants , , or (depending on the spelling of the particular word). These letters aren't called simply nô. Instead, they are called \"dental nô\", \"cerebral nô\" and niô. Similarly, the phoneme in Bengali and in Assamese can be written as \"palatal shô/xhô\" , \"cerebral shô/xhô\" , or \"dental sô/xô\" , depending on the word. Consonant Table Consonant Assamese Bengali BishnupriyaManipuri MeiteiManipuri Sylheti Hajong Maithili kô kô kô kô xo ko kô khô khô khô khô xo kho khô gô gô gô gô go go gô ghô ghô ghô ghô go gho ghô ungô ngô ngô ngô – ngo ngo sô cô cô cô so co cô sô chô chô – so so - – – – – – - chô zô jô jô jô zo jo jô zhô jhô jhô jhô zo jho - – – – – – – jhô niô nô nô – – – niô tô ţô ţô – to – – – – – – – – ţô thô ţhô ţhô – to – ţhô dô đô đô – do - dô rô ŗô ŗô – ŗo – – dhô đhô đhô – do - dô rhô ŗhô ŗhô – ro – – nô nô nô – no - - tô tô tô tô ṭo to tô thô thô thô thô ṭo tho thô dô dô dô dô ḍo do dô dhô dhô dhô dhô ḍo dho dhô nô nô nô nô no no nô pô pô pô pô fo po pô fô phô fô fô fo fo - – – – – – – phô bô bô bô bô bo bo ra bhô bhô bhô bhô bo bho bhô mô mô mô mô mo mo ma zô jô jô – zo - ya yô yô yô yô – yo – (wô) rô rô rô ro wõ va rô (rô) – – ro ro rô lô lô lô lô lo – – – – – – – – la wô – wô wô o wo – xô şô şô – – - shô xô şşô şşô – – - sshô xô şô sô sô şo - sô hô hô hô hô ho ho - – – – – – - hô === Digits === Eastern Nagari script has its own set of digits. Digits Western Arabic numerals 0 1 2 3 4 5 6 7 8 9 Bengali numerals Assamese names xuinno ek dui tini sari pãs soy xat ath no Bengali names shunnô æk dui tin char pãch chhôy shat aţ nôy Meitei names (Manipuri names) phul (phun) amā ani ahum mari ma-ngā taruk taret nipa꞉n ma꞉pan Sylheti names shuinno ex dui tin sair fas soe shat/hat aŧ noe শুইন্য় এখ দুই তিন ছাইর ফাছ ছয় সাত/হাত আট নয় Maithili names shūnyô ek du tin chari pãch chhô: sat aţh nôu ==Related pages== * Bengali–Arabic script == Notes == == References == * * * * == Other websites == * Omniglot – Assamese Alphabet * Omniglot – Bengali Alphabet * Omniglot – Meitei Script (Manipuri Script) Category:Brahmic scripts Category:Writing systems",
 "title": "Bengali–Assamese script"
}