{
 "id": "700820",
 "text": "The liberalisation and democratisation efforts of Alexander Dubchek and Czechoslovakia's Communist Party, known as Prague Spring, took place in 1968. As the Soviet Union thought that Czechoslovakia was moving away of communism, an alliance of Warsaw Pact countries (Soviet Union, Bulgaria, Poland, and Hungary) invaded Czechoslovakia on August 20–21, 1968. Immediately after the invasion, a series of protests took place in Czechoslovakia. Prague Spring symbolizes the experiment of establishing of a socialism with a human face, in post-war Eastern Bloc and its violent suppression from Warsaw Pact countries in August 21, 1968. The event is included in a greater series of Cold War- related unrests. Some examples are May 1968 in France, the student protests against Vietnam War and the military junta in Greece (1967-1974). After the invasion, the most reforms who took place during Prague Spring were reversed or halted. This period after Prague Spring is known as normalization. The only exception was the federalisation of Czechoslovakia. Czechoslovakia became officially a federal country on January 1, 1969. This invasion, was the result of several other factors such as poor living standards, economic hardships, etc. Dubček introduced several political and apolitical reforms to the country including freedom of speech, reduced censorship, legalisation of opposition political parties, and economic liberalisation. The reforms were seen as a direct challenge to Soviet control. Despite Dubček's commitment to remaining within the Soviet sphere, the Soviet leadership viewed these changes as a threat. On August 20, 1968, Soviet forces invaded Czechoslovakia, brutally crushing the movement and reinstating strict communist control. The Prague Spring represented a critical moment in Cold War history, symbolizing the tension between reform-minded communists and the rigid Soviet system. It demonstrated the Soviet Union's unwillingness to tolerate political liberalization within its satellite states. Category:Czechoslovakia",
 "title": "Prague Spring"
}