{
 "id": "700887",
 "text": "Mumbai Hindi, also known as Mumbaiya Hindi, Bambaiyya, Mumbaiyya or Mumbai Hindi-Urdu, is a variety of Hindi-Urdu, spoken in Mumbai (formerly Bombay), India. The words and pronunciations of Bombay Hindi are derived mainly from Hindi and Urdu, collectively known as Hindi-Urdu or Hindustani. In addition, the predominant substratum influence on Bombay is Marathi. Marathi is the official and majority language of Maharashtra. Bombay Hindi also incorporates words from Gujarati and Konkani. == General == Unlike the most local dialects which are used primarily in the metropolitan centres, Bombay Hindi is widely known throughout India, as a result of its frequent use in Bollywood movies. Initially, this dialect was used to represent crooks and uncouth characters. According to Shoma A. Chatterji, \"Indian films have the unique quality of different characters speaking different varieties of Hindi according to their social status, their caste, communal identity, education, profession, financial status, etc. [...] The villain's goons, speak in a special vulgarised, Bambaiya Hindi concocted specifically to typify such screen characters in Hindi cinema.\".See 'The Language Detail' in Shoma A. Chatterji's paper, The Culturespecific Use of Sound in India Cinema, presented in 1999. A particular genre of movies, named Munnabhai, in which the lead characters - being members of the Mumbai criminal underworld - speak entirely in this dialect, helped to spread the dialect.The Hindu newspaper, 11 May 2007. Chronicles of the City. Read online . Despite this increase in popularity, there are people who criticize the use of this dialect. Sometimes, Mumbaiya are seen as being disrespectful and demeaning.DNA, Verbal assault of Bambaiya Hindi, 12 December 2006. Read online. Some neologisms which originated in Bambaiya Hindi have spread throughout India. Some examples are the words bindaas (a compound word, constituted from the Marathi words Bin and Dhast = Without Fear. Bindaas means 'relaxed' and this word was incorporated into the Oxford English Dictionary in 2005Indian Express, 10 August 2005, 'Bindaas' finds its way to the Oxford Dictionary. Read online .) and Gandhigiri (invented in the movie Lage Raho Munna Bhai, a portmanteau of Gandhi and -giri, which is similar to the English 'ism' (as in Gandhi-ism), though slightly more informal). Thanks to Bollywood, some Marathi words, such as Thaska, Wakda, Porgi, Navri, Navrai, Kombdi, and Mulga/Mulgi, have been incorporated in Hindi vocabulary. Many Hindi songs have some Marathi words added. == References == Category:Hindi",
 "title": "Bombay Hindi"
}