{
 "id": "701270",
 "text": "This is a list of the heads of state of The Gambia, from the independence of The Gambia in 1965 to the present day. From 1965 to 1970 the head of state under the Gambia Independence Act 1964 was the Queen of The Gambia, Elizabeth II, who was also the Monarch of the United Kingdom and the other Commonwealth realms. The Queen was represented in The Gambia by a Governor-General. The Gambia became a republic in 1970 and the Monarch and Governor-General were replaced by an executive President. == Monarch (1965–1970) == The succession to the throne was the same as the succession to the British throne. № Monarch Portrait Reign Royal House Prime Minister Reign start Reign end Time in Office 1 Queen Elizabeth II 1965 1970 5 years, 66 days Windsor Jawara === Governor- General === The Governor-General was the representative of the Monarch in The Gambia and exercised most of the powers of the monarch. The Governor-General was appointed for an indefinite term, serving at the pleasure of the Monarch. The Governor-General was appointed solely on the advice of the Cabinet of The Gambia without the involvement of the British government. In the event of a vacancy the Chief Justice served as Officer Administering the Government. ; Status № Governor-General Portrait Tenure Monarch Prime Minister Took office Left office Time in Office 1 Sir John Paul 1965 1966 356 days Elizabeth II Jawara 2 Sir Farimang Mamadi Singateh 1966 1970 4 years 75 days Elizabeth II Jawara Political affiliation (at time of appointment) People's Progressive Party chairman National Revolutionary Council, in rebellion People's Progressive Party Military Armed Forces Provisional Ruling Council ; Political affiliation (at time of appointment) Alliance for Patriotic Reorientation and Construction United Democratic Party == President == The President of the Republic of the Gambia is the head of state and head of government of the Gambia. The president leads the executive branch of the government of the Gambia and is the commander-in-chief of the Military of the Gambia. The post was created in 1970, when the Gambia became a republic and has been held by three people: Dawda Jawara, who ruled from 1970 until 1994, Yahya Jammeh, who seized power in a bloodless coup that year and Adama Barrow, who defeated Jammeh in elections held in December 2016.Wiseman, John A. (2004) Africa South of the Sahara 2004 (33rd edition): The Gambia: Recent History, Europa Publications Ltd. p. 456. № President Portrait Tenure Elected Political affiliation Took office Left office Gambia Colony and Protectorate (1961–1965) 1 Pierre Sarr N'Jie 14 March 1961 12 June 1962 1961 People's Progressive Party 2 Dawda Jawara 12 June 1962 18 February 1965 1965 People's Progressive Party The Gambia (1965–1970) 3 Dawda Jawara 18 February 1965 24 April 1970 1965 People's Progressive Party The Gambia 4 Sir Dawda Jawara 1970 1981 1972 1977 People's Progressive Party chairman National Revolutionary Council, Gambia Socialist Revolutionary Party 5 Kukoi Sanyang 30 July 1981 5 Aug 1981 chairman National Revolutionary Council, Gambia Socialist Revolutionary Party 5 6 7 Kukoi Sanyang , Ousman Bojang , Gibril George 5 August 1981 5 August 1981 – chairman National Revolutionary Council, Gambia Socialist Revolutionary Party The Gambia 8 Sir Dawda Jawara 5 August 1981 22 July 1994 1982 1987 1992 People's Progressive Party Military rule (1994–1996) coup d'état Armed Forces Provisional Ruling Council 22 July 1994 22 July 1994 Armed Forces Provisional Ruling Council 9 Colonel Yahya Jammeh 22 July 1994 18 October 1996 Armed Forces Provisional Ruling Council Second Republic (1996–2006) 10 Yahya Jammeh 18 October 1996 18 October 2006 1996 2001 2006 Alliance for Patriotic Reorientation and Construction 11 Lang Tombong Tamba 18 October 2006 18 October 2006 — Armed Forces Provisional Ruling Council Third Republic (2006 — 2014 ) 12 Yahya Jammeh 18 October 2006 30 December 2014 2006 2011 Alliance for Patriotic Reorientation and Construction 13 Colonel Yahya Jammeh , Ousman Badjie 30 December 2014 30 December 2014 – Armed Forces Provisional Ruling Council 14 Independent Fourth Republic (2014 — 2017 ) 15 Yahya Jammeh 30 December 2014 21 January 2017 — ECOWAS military intervention in the Gambia Alliance for Patriotic Reorientation and Construction 2016–17 Gambian constitutional 16 Yahya Jammeh 9 December 2016 21 January 2017 Independent 17 Adama Barrow Five Republic (2017 — Incumbent) 18 Adama Barrow 19 January 2017 9 December 2023 2016 United Democratic Party 19 Sanna Fadera 9 December 2023 25 December 2023 — Armed Forces 20 Adama Barrow 25 December 2023 Incumbent 2021 United Democratic Party == President Candidates== Nominations were accepted between 30 October and 5 November. From twenty-one nominees, six candidates were approved to run by the Independent Electoral Commission (IEC): Name Party Position Adama Barrow National People's Party (NPP) Incumbent President (2017-present) Ousainou Darboe United Democratic Party (UDP) Former Vice President (2018-2019) Essa M. Faal Independent Chief Prosecutor of the Truth, Reconciliation and Reparations Commission (2018-present) Mama Kandeh Gambia Democratic Congress (GDC) MP in Pan-African Parliament Abdoulie Ebrima Jammeh National Union Party (NUP) Former Director General of The Gambia Civil Aviation Authority Halifa Sallah People's Democratic Organisation for Independence and Socialism (PDOIS) Special Advisor to the President on Governance (2017), National Assembly Minority Leader (2002-2007) ==Vice president== # Name Term of office Political party 1 Sheriff Mustapha Dibba 1970 1972 PPP 2 Assan Musa Camara 1972 1977 PPP 3 Alieu Badara Njie 1977 1981 PPP 2 Assan Musa Camara 1981 May 1982 PPP 4 Bakary Bunja Darbo 12 May 1982 1992 PPP 5 Saihou Sabally 1992 22 July 1994 PPP 6 Edward Singateh 1996 1997 7 Isatou Njie-Saidy 20 March 1997 18 January 2017 APRC Fatoumata Tambajang 23 January 2017 9 November 2017 UDP 8 9 November 2017 29 June 2018 9 Ousainou Darboe 29 June 2018 15 March 2019 UDP 10 Isatou Touray 15 March 2019 4 May 2022 Independent 11 Badara Joof 4 May 2022 17 January 2023 Independent Vacant (17 January – 24 February 2023) 12 Muhammad B. S. Jallow 24 February 2023 Incumbent Independent * Edward Singateh, designated vice president in 1996, == Related pages == * List of colonial governors of the Gambia * List of heads of government of the Gambia * Lists of rulers in the Gambia * Lists of office- holders == References == * Guinness Book of Kings, Rulers & Statesmen, Clive Carpenter, Guinness Superlatives Ltd * African States and Rulers, John Stewart, McFarland == Other websites == * World Statesmen – The Gambia * Rulers.org – The Gambia Category:Lists of heads of state heads of state",
 "title": "List of heads of state of the Gambia"
}