{
 "id": "701395",
 "text": "Dragon Tales, also spelled \"DragonTales\", was a Canadian-American animated educational fantasy television series produced by Sony Pictures Television and Sesame Workshop. It was broadcasted on PBS Kids from September 6, 1999. ==Characters== * Emily \"Emmy\" (voiced by Andrea Libman) is a 6-year-old girl, who commonly appears as the leader of the group until she gave her position to Enrique while helping him get used to Dragon Land in a self-colored-in dimension. She's Max's older sister. Her best friend is Cassie, and she's perhaps known for saying \"Definitely!\", whenever a good idea arises. Though Emmy is not ashamed to do girly things with Cassie, she's also heavily into sports and games and generally is up for any activity. Though she experiences occasional jealousy of her brother, the 2 are otherwise usually together within Dragon Land and share many adventures. Though a brave, smart natural leader, she's also impulsive and doesn't always think before she acts. She could also occasionally be seen being kind of bossy. * Max (voiced by Danny McKinnon) is 4 years old, and is Emmy's younger brother. For the most part, he and Emmy get along fine, but occasionally have arguments due to him being prone to anger. His best friend is Ord. Though Max loves Emmy, he sometimes struggles with being the younger brother, and is usually frustrated about being too little to do certain things, or when Emmy acts in certain ways, and he's perhaps known for saying \"It's not fair!\", whenever he gets upset. He's of an adventurous sort and sometimes helps to give courage to Ord when he's afraid of certain things. He's kind to others, but often enjoys acting silly or goofy. He sometimes acts in a stubborn manner, determined to prove that a child his age can do things on his own, even when he really needs help. Max was named after the son of executive producer Jim Coane. * Enrique (voiced by Aida Ortega) is 8 years old. He is Emmy and Max's new best friend and next- door neighbor who moved from Colombia to the United States and also once lived in Puerto Rico. He first appears in the Season 3 episode \"To Fly with a New Friend\", and travels to Dragon Land with the children when Max encourages Emmy to share their secret. He speaks Spanish with a very strong accent, and his recent experiences in South America provide more opportunities for the characters to demonstrate the meanings of new Spanish words. He misses his former homeland in Colombia and is often saddened by reminders of times from his old home in the country he no longer lives in. He usually rides on his first and second best friends Zak and Wheezie, the two-headed dragon who rarely flew with any human friends prior to Enrique's debut in Season 3, and sometimes rides on the wheelchair of his third best friend Lorca. His personality is somewhat bashful but he is sometimes shy to join in on new experiences. However, he finds that he enjoys himself when he allows himself to let go, express his feelings and then move forward to have fun. He's raised by his father and grandmother and described as an intensely smart, good, and logical character. A series of moves throughout his early life has left him jaded and wary of both making new friends and trying new things. Enrique received mixed reviews. The presence of Enrique on the program, in conjunction with Max and Emmy, was the subject of a study \"'They Are?!' Latino Difference vis-à-vis Dragon Tales,\" which was critical of the show's use of the characters, feeling that the series ultimately \"undermines multiculturalism because it fails to nurture children's ability to live fearlessly with and within difference. * Ordan \"Ord\" (voiced by Ty Olsson) is a strong blue male winged alien who is Max's best friend. He is extremely fond of food and always carries some just in case; a running gag in the show features Ord making \"Dragon Corn\" by throwing the kernels in the air and popping them with his fire breath. He's also allergic to dandelions. Despite his physical strength, Ord is sometimes scared due to his fear of the dark, thunder and bugs, and possesses a magical tendency to turn invisible when he is upset or frightened. However, he does learn to overcome those fears and also wishes he could be braver. Ord's sun-shaped Dragon Badge glows when he faces his fears. Ord is extremely sweet and kind in nature, he learns moral lessons when he is not being very kind. For instance, in \"Kingdom Come\" he refuses to share his huge cupcake, but finally gives in and learns moral lessons. * Cassie (voiced by Chantal Strand) is a shy, cute, reserved and sweet pink female winged alien who is Emmy's best friend. She possesses a magical tendency to shrink when she is too shy, sad, or may occasionally come across as slightly insecure and uncertain, and is prone to worrying, especially about making a mistake. However, Cassie is distinguished by her kind heart and maternal sweetness, primarily as a result of her responsibilities as an older sister and babysitter to a myriad of younger siblings. Cassie also is characterized by her color combination of pink and yellow, along with blue speckles in some areas. Cassie knows just about everything there is to know about Dragon Land and has a deep love of fairytales, both stemming from her love of reading, as well as being an amazing singer and dancer. Her dragon orb-shaped badge glows when she feels confident and believes in herself. * Zakkie \"Zak\" (voiced by Jason Michas) and Wheezie (voiced by Kathleen Barr) are a conjoined twin green and purple winged alien with opposite personalities; Zak is a male, and Wheezie is a female. Zak is neat and clean, he also however worries a lot, and is pessimistic about many things, which he often complains about. His can also be lazy and act in a stubborn way. His catchphrase is \"Take it easy, Wheezie!\", which he often says when Wheezie takes off running, dragging him with her. Wheezie, on the other hand, is bold, hyper, energetic, confident, and free-spirited, with a tendency to be messy, much to her brother's annoyance. Her catchphrase is \"Love it!\", when she loves something. The two have a shared love of music and performing and they often perform in talent shows and recitals together. Zak and Wheezie always fly with Enrique, though they rarely flew with any human friends in the first two seasons. In the third season, Enrique became their partner following his debut. Their dragon badges are musical notes that glow when they work together and get along, though they will sometimes glow independently when one of them accomplishes something on their own of significance. Although they usually argue a lot with each other, they're very close friends and also love and care about each other very much. In the episode \"Not Separated at Birth\", the viewers get a view of what Wheezie and Zak would look like separately as if they were born that way. They get in an argument complaining about how one of them always has to do what the other wants to do, and Queztal decides to grant them their request to be separated. Finally being able to live separately, it's only short lived as they realize how much they need each other and want to be back together. * Quetzal (voiced by Eli Gabay) is an elderly yellow male winged alien originally from Mexico who is the teacher at the School in the Sky where young dragons attend. He tries to encourage his students to find solutions to their problems on their own, but is a sounding board who offers stability and comfort, as well as sound advice. In the episode \"Snow Dragons\", Quetzal mentions it has been hundreds of years since he visited the dragon snow sculpture as a child, implying he is centuries old. He speaks Spanish with a very strong accent. He also has an identical twin brother named Fernando who works in his garden. ==Broadcast == It was broadcast on PBS Kids. ==References== Category:1999 American television series debuts Category:1999 Canadian television series debuts Category:English-language television programs",
 "title": "Dragon Tales"
}