{
 "id": "701471",
 "text": "The President of Iceland () is the head of state of Iceland. The incumbent is Halla Tómasdóttir, who became president in 2024. The president is elected to a four-year term by popular vote, is not term-limited, and has limited powers. The presidential residence is in Bessastaðir in Garðabær, near the capital city Reykjavík. ==List== There have been seven presidents since the creation of the republic. Term: 1 appointed · 2 died in office · 3 uncontested Nº President Took office Left office Duration Term Prime ministers 1 Sveinn Björnsson (1881–1952) 17 June 1944 25 January 19522 7 years, 7 months, 8 days (2,778 days) 1 (1944)1 Björn Þórðarson Ólafur Thors Stefán Jóhann Stefánsson Ólafur Thors Steingrímur Steinþórsson 2 (1945)3 3 (1949)3 Regent of Iceland 1941–1944, later became the first president of Iceland. In 1950 considered forming a government that did not rely on parliamentary support after leaders of the parliamentary parties had reached an impasse. The only president to die in office; this led to a vacancy, the powers of the office being constitutionally vested jointly in the prime minister (Steingrímur Steinþórsson), the president of the Parliament (Jón Pálmason) and the president of the Supreme Court (Jón Ásbjörnsson). 2 Ásgeir Ásgeirsson (1894–1972) 1 August 1952 31 July 1968 16 years (5,844 days) 4 (1952) Steingrímur Steinþórsson Ólafur Thors Hermann Jónasson Emil Jónsson Ólafur Thors Bjarni Benediktsson Ólafur Thors Bjarni Benediktsson 5 (1956)3 6 (1960)3 7 (1964)3 First president elected by popular vote. 3 Kristján Eldjárn (1916–1982) 1 August 1968 31 July 1980 12 years (4,383 days) 8 (1968) Bjarni Benediktsson Jóhann Hafstein Ólafur Jóhannesson Geir Hallgrímsson Ólafur Jóhannesson Benedikt Sigurðsson Gröndal Gunnar Thoroddsen 9 (1972)3 10 (1976)3 At one point considered forming a government that did not rely on parliamentary support after leaders of the parliamentary parties had reached an impasse. 4 Vigdís Finnbogadóttir (born 1930) 1 August 1980 31 July 1996 16 years (5,844 days) 11 (1980) Gunnar Thoroddsen Steingrímur Hermannsson Þorsteinn Pálsson Steingrímur Hermannsson Davíð Oddsson 12 (1984)3 13 (1988) 14 (1992)3 Was the world's first elected female president. Won first term in office with the lowest historical share of the votes for a first-term election (33.79%) but overwhelmingly won her third- term election in 1988. 5 Ólafur Ragnar Grímsson (born 1943) 1 August 1996 31 July 2016 20 years (7,305 days) 15 (1996) Davíð Oddsson Halldór Ásgrímsson Geir Haarde Jóhanna Sigurðardóttir Sigmundur Davíð Gunnlaugsson Sigurður Ingi Jóhannsson 16 (2000)3 17 (2004) 18 (2008)3 19 (2012) First to use the constitutional veto power under Article 26 to deny signing a law from the Parliament. Used it again on two occasions. 6 Guðni Thorlacius Jóhannesson (born 1968) 1 August 2016 31 July 2024 ( days) 20 (2016) Sigurður Ingi Jóhannsson Bjarni Benediktsson Katrín Jakobsdóttir Bjarni Benediktsson 21 (2020) Overwhelmingly won his second-term election in 2020. 7 Halla Tómasdóttir (born 1968) 1 August 2024 ( days) 22 (2024) Bjarni Benediktsson Won with the second lowest historical share of the votes for a first-term election (34.15%). This was her second attempt at a presidential run, the first one having been in 2016 where she came in second. ==References==",
 "title": "President of Iceland"
}