{
 "id": "701565",
 "text": "Hutchinson is the biggest city and county seat in Reno County, Kansas, United States. It is on the Arkansas River. In 2020, 40,006 people lived there. ==History== Hutchinson was created in 1871. It banned alcohol, and people called it the \"Temperance City\".Dex One Company. DexKnows . Hutchinson, KS Yellow Pages It officially became a city in August 1872. In 1887, the Chicago, Kansas and Nebraska Railway built a railroad from Herington through Hutchinson to Pratt. Also in 1887, local salt deposits were found. Salt mining would become a big industry in Hutchinson. The city eventually got the nickname \"Salt City\". ==Geography== Hutchinson is at (38.0608445, -97.9297743) at an elevation of 1,535 feet (468 m). Hutchinson is on the northeast bank of the Arkansas River in the Great Bend Sand Prairie region of the Great Plains. Cow Creek, a tributary of the Arkansas River, goes southeast through the city. The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Weather=== Hutchinson has a humid continental climate (Köppen Dfa). It is almost a humid subtropical climate (Köppen Cfa). It has hot, humid summers and cold, dry winters. ==People== ===2020 Census=== In 2020, there were 40,006 people, 16,535 households, and 9,708 families living in Hutchinson. Of the households, 61.3% owned their home and 38.7% rented their home. The median age was 39.8 years. Of the people, 81.7% were White, 4.3% were Black, 1.0% were Native American, 0.7% were Asian, 0.1% were Pacific Islanders, 3.8% were from some other race, and 8.5% were two or more races. Hispanic or Latino of any race were 12.9% of the people. ===2010 Census=== In 2010, there were 42,080 people, 16,981 households, and 10,352 families living in Hutchinson. ==Government== Hutchinson is a city of the first class with a council-manager form of government. Hutchinson is the county seat of Reno County, so it is the administrative center of Reno County. The county courthouse is downtown, and all departments of the county government have their operations in the city. Hutchinson is in Kansas's 1st U.S. Congressional District. In the Kansas Legislature, Hutchinson is in the 34th district of the Kansas Senate. It is in the 102nd, 104th, and 114th districts of the Kansas House of Representatives. ==Infrastructure== ===Transportation=== Reno County Area Transit (RCAT) provides local public transport bus service. It has three bus routes. The routes are colored Red, Blue, and Yellow. Greyhound Lines offers long-distance bus service on its route through Hutchinson from Wichita to Pueblo. Bus service is provided daily towards Wichita and Salina by BeeLine Express (subcontractor of Greyhound Lines). Three railroads go through Hutchinson. One is the La Junta Subdivision of the BNSF Railway. It runs east–west through the city. Amtrak uses the La Junta Subdivision to give passenger rail service. Hutchinson is a stop on the Southwest Chief. It provides daily train service between Chicago and Los Angeles. Another railroad is the Tucumcari Line of the Union Pacific Railroad. It runs northeast–southwest through the city. Lastly, Hutchinson is the end point of two lines of the Kansas and Oklahoma Railroad: the Hutchinson Subdivision, which enters the city from the south, and the Great Bend Subdivision, which enters the city from the northwest. ===Health care=== There are two hospitals in Hutchinson. Hutchinson Regional Medical Center is a not-for-profit general medical and surgical facility. It offers many different services including emergency care. The other hospital is Summit Surgical. It is a specialized corporate surgical facility. ==Media== The Hutchinson News is the city's main newspaper. It is published every day. Hutchinson Community College publishes a weekly student newspaper, the Collegian. ==Parks== The Sand Hills State Park is on the northern part of Hutchison. ==References== ==Other websites== ;City * ;News * The Hutchinson News, local newspaper ;Schools * USD 308, local school district ;Historical * Hutchinson, Kansas History * Hutchinson, Kansas Community Networks * , from Hatteberg's People on KAKE TV news * , from Hatteberg's People on KAKE TV news ;Maps * Hutchinson City Map , KDOT Category:Cities in Reno County, Kansas Category:County seats in Kansas",
 "title": "Hutchinson, Kansas"
}