{
 "id": "701585",
 "text": "The Lawrence Public Library is a public library in Lawrence, Kansas. ==History== ===1800s=== The first library in Lawrence was built in October 1854. It cost $1 per year to be a member. People could pay $25 to be a member for their life. Amos A. Lawrence brought many books to Lawrence in 1855. In 1863, the library burned in Quantrill's Raid. A new library was built in 1866. In the first two years of the library, 75 volumes were purchased, and 150 volumes were donated. The city took control of the library in September 1871. They moved it into the Lawrence National Bank building. It took up three rooms on the second floor. ===1900s=== ====Carnegie Library==== The old library was getting too many books, so they needed to build a bigger library. They had 6,000 volumes. $1 per year was not enough money to build a new library. One resident, Peter Emery, asked philanthropist Andrew Carnegie to give money for a new library. Carnegie said yes, and he gave $27,500 for a new library. He said he would only give this money if Lawrence made the new library free to use, and if they spent $2,750 per year to maintain it. It was put to a vote, and the city voted yes by a lot. The library officially opened to on December 26, 1904. ====Growing==== After the Carnegie library opened, the Lawrence Public Library grew a lot. By 1922 children liked the library so much that a new room was added to for the children to use. By 1936, 40% of all people in Lawrence had a library card. In 1937, they had to make their storage bigger. They made the library better in 1957. They wanted to make it more modern. ====New building==== The Carnegie Library didn't have enough space for the amount of books they had. Lawrence had an idea to make a new building. They decided that the new building would be close to the old building. In 1970, a vote in the city for $1,575,000 to be used for a new building passed easily. This building opened in August 1972. The Carnegie building became the location for the Friends of the Library association. ===2000s=== On November 10, 2010 an $18 million budget was proposed by the Library Board of Trustees. They said that since 1972, the number of people who used the library more than doubled. This proposal was accepted by voters in 2010. Construction finished in July 2014. After the new building opened, the Lawrence Public Library won the AIA/ALA Library Building Award in 2016. Elle Decor said the library was 16th in the top \"50 Best Libraries in America\". ==References== == Other websites == Category:Libraries in the United States Category:Buildings and structures in Lawrence, Kansas Category:1854 establishments in Kansas Territory",
 "title": "Lawrence Public Library"
}