{
 "id": "701534",
 "text": "Salina is a city in Saline County in the U.S. state of Kansas. It is the county seat of Saline County. In 2020, 46,889 people lived there. ==Geography== Salina is at (38.8402805, -97.6114237. It has an elevation of . It is in north-central Kansas at the intersection of Interstate 70 and Interstate 135. It is north of Wichita, Kansas, west of Kansas City, Missouri, and east of Denver, Colorado. Salina is in the Smoky Hills area in the Great Plains. It is close to the Smoky Hills River and the Saline River. Used Latitude/Longitude of river confluence from United States Geological Survey and the latitude/longitude given on this page for Salina to calculate distance. The United States Census Bureau said the city has a total area of . of that is land and is water. ===Weather=== Salina has a lot of severe thunderstorms, and they can get tornadoes. ==People== ===2020 census=== The 2020 census says that there were 46,889 people, 19,295 households, and 11,543 families living in Topeka. Of the households, 61.3% owned their home and 38.7% rented their home. The median age was 38.7 years. Of the people, 78.1% were White, 3.8% were Black, 2.3% were Asian, 0.7% were Native American, 0.1% were Pacific Islanders, 4.5% were from some other race, and 10.4% were two or more races. Hispanic or Latino of any race were 13.4% of the people. ==Economy== Salina was the first place for Lee Jeans. They opened in 1889. The biggest employers are: # Employer # of Employees 1 Tony's Pizza 2,000 2 Salina Regional Health Center 1,082 3 USD 305 935 4 Exide 800 5 Great Plains Manufacturing 650 6 Philips Lighting 600 7 City of Salina 493 8 Saline County 277 9 ElDorado National 255 ==Media== The Salina Journal is the local newspaper. They publish every day. ==References== ==Other websites== ===City=== * City of Salina * Salina - Directory of Public Officials * Salina - Chamber of Commerce ===Schools=== * USD 305, Salina Public Schools * Sacred Heart Junior/Senior High School ===Historical=== * Smoky Hill Museum * Salina Arts & Humanities Commission * Special Collections: A gift of William A. Phillips, the founder of Salina * , from Hatteberg's People on KAKE TV news ===Maps=== * Salina City Map , KDOT Category:Cities in Saline County, Kansas Category:1858 establishments in Kansas Territory Category:County seats in Kansas",
 "title": "Salina, Kansas"
}