{
 "id": "701677",
 "text": "Reginald's Tower is a historic tower in Waterford, Ireland. The tower has been in use for many centuries and is an important landmark in Waterford and an important part of its medieval defence. It is the oldest civic building in Ireland and it is the only city monument in Ireland to retain a Norse or Viking name.McEneaney, 2001. Discover Waterford, O'Brien Press p. 70. . == Early history == Reginald's Tower was built by the Normans when they came to Waterford. The tower's name is derived from a form of the Irish name Raghnall. The tower's name seems to refer to one of the many Viking rulers of the town that bore the name. It might be Ragnall mac Gillemaire, the last Norse ruler of the town. The tower was probably built in the 13th or 14th century; it may have been constructed between 1253 and 1280.J.S. Carroll, Decies Journal XXVI Summer 1984. pp.22–27 In 1185 Prince John of England landed in Waterford and organised the rebuilding of the city walls, including the tower.Reginald's Tower, visitors guide, Office of Public Works The tower is 54 feet high and it is circular. It is 42½ feet in diameter with a cone-shaped roof. There is a spiral staircase within the thick walls - these are 10 feet wide at the base, going down to 7 feet at the top. It was part of the old city walls of Waterford which were in a triangle formed by three structures — Turgesius Tower on Barronstrand Street, St. Martins Castle on Lady Lane, and Reginald’s Tower at the Quay and the Mall. It was on the high ground between St. John's River on the southeast (since drained, and now known as the Mall) and the River Suir to the north. It is also very close to the historic French Church. It is also known as the Ring Tower. It was one of seventeen towers which circled the city of Waterford in medieval times. Today, it is the largest of the six surviving towers, which are considered the best examples of medieval urban defence in Ireland. The other surviving towers are the Watch Tower, Double Tower, French Tower, Semi-Lunar Tower and Beach Tower. == Medieval history == The tower has been used as a coin mint, a prison, and a military storehouse. It is also famous for being the location of the wedding of Richard de Clare, the second Earl of Pembroke, and Aoife (pronounced eefa), daughter of Dermot MacMurrough, King of Leinster. It sometimes was a royal castle and was visited by King John in 1210, who ordered new coins to be made there. Richard II visited the tower in 1394 and again in 1399. He used the tower to store his munitions. On 27 July 1399, Richard left Reginald's Tower as King of England and Wales; on his arrival in England, he was captured by the future Henry IV. In 1463, coins were minted in Reginald's Tower by order of the Irish Parliament, which, at that time, was meeting in the city. The coins had the words \"Civitas Waterford\" struck on one side. In 1495, the tower’s cannons successfully beat off the forces of Perkin Warbeck, the pretender to the throne of Henry VII. Cannons from the tower sank one of his ships during an 11-day battle. This was the first successful use of artillery by an Irish city. A cannon from this ship was recovered from the River Suir in 1901. This victory earned the city its motto Urbs Intacta Manet - \"Waterford remains the unconquered city\". In 1649, Waterford was attacked by the army of Oliver Cromwell, but he failed to capture the city. They returned in 1650, and this time they were successful. A cannonball, visible high up the wall on the north side of the building, is lodged firmly in the wall, and is said to be from this siege. In 1690, following his defeat at the Battle of the Boyne, James II of England is supposed to have climbed to the top of the tower to take a last look at his lost kingdom before embarking for exile in France. During the 17th and 18th centuries, the tower was used to store ammunition. In the early 19th century it was a prison. == Present day == In 1861, Reginald's Tower became the property of the Waterford Corporation, and the house of the Chief Constable of Waterford. It continued to be lived in until 1954 when the last person left and the building was turned into a museum. During the Second World War it was an air raid shelter. Now it is the Waterford Viking Museum and exhibits many of the archaeological finds from the 2003 dig at Woodstown on the River Suir near the city. It is located in the area of Waterford Viking Triangle in the centre of Waterford city. A Viking longship is kept outside Reginald's Tower. == References == Category:Waterford Category:Buildings and structures in the Republic of Ireland Category:13th-century buildings and structures",
 "title": "Reginald's Tower"
}