{
 "id": "701697",
 "text": "The President of Tunisia, formally known as the President of the Republic of Tunisia (, ) is the head of state of Tunisia.The position was created in 1957 when Habib Bourguiba,who had been prime minister,overthrew the King.Thirty years later Bourguiba was overthrown by his own prime minister.Today the president is freely elected. Tunisia is a semi-presidential republic, whereby the president is the head of state and the prime minister (named Head of Government of Tunisia) is head of government. Under Article 77 of the Constitution of Tunisia, the president is also the commander-in-chief of the Tunisian Armed Forces. In July 2022, in a referendum, voters approved a new constitution which would expand the powers given to the president, changing the republic from a semi-presidential system to a presidential system.Tunisia referendum: Voters give president near unchecked power == List == Portrait Name Start of term End of term Political affiliation Notes 1 Habib Bourguiba 25 July 1957 7 November 1987 Neo-Destour Prime Minister under Muhammad VIII al-Amin, Bey of Tunis, Bourguiba ousted the sovereign by proclaiming a republican regime on 25 July 1957, of which he was elected president. Elected overwhelmingly as President of the Tunisian Republic on 8 November 1959, and being the only candidate in this election, Bourguiba was elected president for life on 18 March 1975. He was dismissed on 7 November 1987 by his prime minister Zine El Abidine Ben Ali. SDP 2 Zine El Abidine Ben Ali 7 November 1987 14 January 2011 SDP Prime Minister and Minister of Interior of President Bourguiba, Ben Ali had the head of state dismissed, citing an age that was too high to continue presiding over the country. In December 2010, he faced a major wave of popular protests; he finally left the presidency on 14 January 2011, under pressure from demonstrators, and took refuge in Saudi Arabia, with his wife Leïla Ben Ali. DCR (-) Fouad Mebazaa 15 January 2011 13 December 2011 DCR As President of the Chamber of Deputies, Mebazaa became interim president of the republic on 15 January 2011, after the departure of President Ben Ali to Saudi Arabia. He convenes the Constituent Assembly. Independent 3 Moncef Marzouki 13 December 2011 31 December 2014 CFR The first president of the republic to be inaugurated after the Tunisian revolution which led to the fall of President Ben Ali, Moncef Marzouki is also the first president not to come from the ranks of the ruling party since independence. 4 Beji Caid Essebsi 31 December 2014 25 July 2019 † Nidaa Tounes By winning the 2014 presidential elections in the second round against the outgoing president, Marzouki, Caïd Essebsi became the first president elected democratically by direct universal suffrage after the revolution. He dies in office on 25 July 2019. (-) Mohamed Ennaceur 25 July 2019 23 October 2019 Nidaa Tounes He acts as interim Speaker of the Assembly of the Representatives of the People for a maximum of 90 days. 5 Kais Saied 23 October 2019 present Independent By winning the 2019 presidential election in the second round against Nabil Karoui, Saïed becomes the first independent elected President of the Republic. He is also the first president born after independence, as well as the first born under the mandate of one of his predecessors. On 25 July 2021, he suspended Parliament and dismissed the head of government Hichem Mechichi then published a decree on exceptional powers during the period preceding the adoption of a new Constitution. ==References== *",
 "title": "President of Tunisia"
}