{
 "id": "701788",
 "text": "The following is a list of deaths that should be noted in July 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==July== ===1=== * Bob Collymore, 61, Guyanese-born British businessman, Chief Executive of Safaricom (since 2010), acute myeloid leukaemia.Safaricom boss Bob Collymore is dead * Norman Geisler, 86, American theologian, co-creator of the Chicago Statement on Biblical Inerrancy, cerebral thrombosis.Died: Apologist Norman Geisler, Who Didn’t Have ‘Enough Faith to Be an Atheist’ * Rolland Golden, 87, American artist.Rolland Golden, noted Louisiana artist, dies at 87 * Oss Kröher, 91, German folk singer-songwriter.Pirmasenser Liedermacher Oskar Kröher ist tot * Sándor Popovics, 80, Hungarian-Dutch footballer (Újpesti Dózsa, Sparta Rotterdam) and football manager (N.E.C., De Graafschap), Alzheimer's disease.Oud-trainer Popovics van De Graafschap en NEC overleden * Sid Ramin, 100, American composer (West Side Story, Too Many Thieves, Stiletto), Oscar winner (1962).Sid Ramin, Oscar-Winning Composer- Arranger, Dies at 100 * Bogusław Schaeffer, 90, Polish composer, musicologist and graphic artist.Zmarł kompozytor Bogusław Schaeffer * Tyler Skaggs, 27, American baseball pitcher (Arizona Diamondbacks, Los Angeles Angels).L.A. Angels Pitcher Tyler Skaggs Found Dead In Texas at 27 ===2=== * Élie Brousse, 97, French rugby league player (Roanne, Lyon, national team).Rugby à XIII : Élie Brousse, le \"Tigre de Sydney\", est décédé à l'âge de 97 ans * Costa Cordalis, 75, Greek-German schlager singer.\"Anita\" machte ihn berühmt - Schlagersänger Costa Cordalis ist tot * Lee Iacocca, 94, American automobile executive and writer (Where Have All the Leaders Gone?), President of Ford Motor Company (1970–1978) and Chairman of Chrysler (1979–1992), problems caused by Parkinson's disease.Auto Industry Legend Lee Iacocca Dead at 94 * W. Thomas Molloy, 78, Canadian politician, Lieutenant Governor of Saskatchewan (since 2018), pancreatic cancer. * Bruce Wallrodt, 67, Australian athlete, Paralympic champion (1988, 1992, 1996).Vale Bruce Wallrodt OAM ===3=== * Sudarshan Agarwal, 88, Indian politician, Governor of Uttarakhand (2003–2007) and Sikkim (2007–2008).Ex-Uttarakhand Governor Sudershan Agarwal passes away * Koldo Aguirre, 80, Spanish football player (Athletic Bilbao, national team) and manager (Hércules).Légende de l'Athletic Bilbao, Koldo Aguirre est mort * June Bacon-Bercey, 90, American meteorologist (NOAA, National Weather Service, USAEC), first African-American woman to have a meteorology degree and to forecast weather on television, frontotemporal dementia.Television meteorologist June Bacon-Bercey dies * Basant Kumar Birla, 98, Indian businessman, Chairman of B.K. Birla Institute of Engineering & Technology (since 2007).Nonagerian industrialist BK Birla passes away * Mitsuo Itoh, 82, Japanese Grand Prix motorcycle road racer.【訃報】日本人唯一のマン島TTレース勝者、伊藤光夫さん亡くなる * Arte Johnson, 90, American comedian and actor (Rowan & Martin's Laugh-In), Emmy Award winner (1969), bladder and prostate cancer.Arte Johnson, Master of Manic Characters on 'Laugh-In,' Dies at 90 * Malva Landa, 100, Ukrainian-born Russian geologist and human rights activist, member of the Moscow Helsinki Group (since 1976).Умерла правозащитница Мальва Ланда * Jared Lorenzen, 38, American football player (New York Giants, Indianapolis Colts), heart and kidney failure caused by an infection.Former Kentucky, Giants QB Jared Lorenzen Dies at Age 38 * Arseny Mironov, 101, Russian aeronautical engineer.Прощание с легендой: не стало Арсения Дмитриевич Миронова * Edward Shotter, 86, British Anglican priest and author, Dean of Rochester (1989–2003).Edward Shotter ===4=== * Chris Cline, 60, American billionaire mining entrepreneur, helicopter crash.Billionaire West Virginia coal operator and philanthropist Chris Cline dies in helicopter crash * Eduardo Fajardo, 94, Spanish actor (The Two Faces of Fear, Nightmare City, Exterminators of the Year 3000).Fallece el actor Eduardo Fajardo a los 94 años * Arturo Fernández Rodríguez, 90, Spanish actor (Red Cross Girls, College Boarding House, The Locket), problems caused by a fall.Muere Arturo Fernández, galán eterno del teatro, a los 90 años * Bob Gilliland, 93, American pilot, first man to fly SR-71 Blackbird. * Eva Mozes Kor, 85, Romanian-born American Holocaust survivor and author, founder of CANDLES Holocaust Museum and Education Center.Eva Kor, a Holocaust survivor and forgiveness advocate, dies at 85 * Pierre Lhomme, 89, French cinematographer (Cyrano de Bergerac, Lovers Like Us, Deadly Circuit).Pierre Lhomme Dies: Celebrated French Cinematographer Of ‘Cyrano De Bergerac’ Was 89 * Robert F. Marx, 85, American scuba diver.Robert F. Marx * Vivian Perlis, 91, American musicologist.Obituary of Vivian L. Perlis ===5=== * Gerry Fairhead, 96, Canadian Olympic sailor (1948).Arthur Fairhead * Ugo Gregoretti, 88, Italian movie director (Ro.Go.Pa.G., Omicron, Beautiful Families).Morto Ugo Gregoretti: il regista romano aveva 88 anni * John McCririck, 79, British horse racing journalist (ITV Sport, Channel 4), lung cancer. * Adila Mutallibova, 81, Azerbaijani socialite, First Lady (1991–1992).Трагедия в семье экс-президента: первая леди внезапно ушла из жизни, похоронят рядом с сыном * Godfried Toussaint, 75, Canadian computer scientist.Mourning the Passing of Godfried Toussaint (death announced on this date) * Paolo Vinaccia, 65, Italian-Norwegian jazz percussionist, pancreatic cancer.Paolo Vinaccia er død ===6=== * Cameron Boyce, 20, American actor (Jessie, Gamer's Guide to Pretty Much Everything, Descendants), seizure.Disney Channel star Cameron Boyce dies at 20 * João Gilberto, 88, Brazilian singer- songwriter (\"Getz/Gilberto\", \"Eu Sei que Vou Te Amar\") and guitarist, pioneer of bossa nova music style and Grammy winner (1965).João Gilberto: Brazilian 'father of bossa nova' dies aged 88 * Thommy Gustafsson, 71, Swedish keyboardist (Sven-Ingvars).Sven-Ingvars tidigare pianist död * Parviz Jalayer, 79, Iranian weightlifter, Olympic silver medalist (1968) and Asian Games champion (1966).نایب قهرمان وزنه‌برداری المپیک درگذشت * Arman Kirakossian, 62, Armenian diplomat, Minister of Foreign Affairs (1992–1993), Ambassador to the United States (1999–2005) and United Kingdom (since 2018).Armenia's ambassador to UK and Northern Ireland Arman Kirakosyan passed away ===7=== * Artur Brauner, 100, Polish-born German movie producer (The Plot to Assassinate Hitler, Angry Harvest, Europa Europa).Mit 100 Jahren Medienbericht: Berliner Filmproduzent Artur Brauner tot * Steve Cannon, 84, American novelist, playwright, and arts impresario (A Gathering of the Tribes), sepsis caused by a ruptured cyst.Poet Steve Cannon, 84, of A Gathering of the Tribes * Patricia Gallerneau, 64, French politician, Deputy (2017–2019), cancer.Mort de Patricia Gallerneau, députée MoDem de Vendée * Greg Johnson, 48, Canadian ice hockey player (Detroit Red Wings, Nashville Predators, Pittsburgh Penguins), Olympic silver medalist (1994), suicide by firearm. * Ekaterina Koroleva, 20, Russian handballer (national team), drowned. * Ora Namir, 88, Israeli politician and diplomat, member of the Knesset (1973–1996), Minister of Labor (1992–1996) and Ambassador to China and Mongolia (1996–2000).Former minister Ora Namir dies at 88 * Sutopo Purwo Nugroho, 49, Indonesian civil servant and academic, Head of Indonesian National Board for Disaster Management Public Relations (since 2010), lung cancer.Kepala Pusdatinmas BNBP Sutopo Purwo Nugroho Meninggal Dunia di China ===8=== * James Henke, 65, American music journalist (Rolling Stone) and museum curator (Rock and Roll Hall of Fame), dementia.James Henke, Rolling Stone Writer and Rock and Roll Hall of Fame Chief Curator, Dead at 65 * Charles Levin, 70, American actor (Alice, Hill Street Blues, Seinfeld).Remains found in Oregon likely ‘Seinfeld’ actor Charles Levin: police * Arthur Ryan, 83, Irish businessman, founder and chairman of Primark.Penneys Founder Passes Away ===9=== * Husaini Abdullahi, 80, Nigerian military personnel and politician, Governor of Bendel State (1976–1978). * Miriam Butterworth, 101, American politician and educator, heart disease.Miriam Butterworth * William E. Dannemeyer, 89, American politician, member of the California State Assembly (1963–1967, 1976–1978) and the U.S. House of Representatives (1979–1993), problems caused from dementia.Obit: Rep. William Dannemeyer, a face of Orange County conservatism in the age of Reagan * Philip Freelon, 67, American architect (National Museum of African American History and Culture, National Center for Civil and Human Rights, Museum of the African Diaspora), problems caused by ALS.Acclaimed African-American Architect Phil Freelon Dies * Freddie Jones, 91, British actor (The Elephant Man, Emmerdale, Dune).Freddie Jones: Tributes paid to Emmerdale and Elephant Man star * Ross Perot, 89, American businessman (Electronic Data Systems) and politician, presidential candidate (1992, 1996) and founder of the Reform Party, leukemia. * Robert Rackstraw, 75, American pilot and criminal, suspect in D. B. Cooper case, heart disease.San Diegan featured in program about notorious D.B. Cooper skyjacking case dies in Bankers Hill home * Aaron Rosand, 92, American violinist.American violinist Aaron Rosand has died aged 92 * Fernando de la Rúa, 81, Argentine lawyer and academic, President (1999–2001), heart and kidney failure.Murió Fernando de la Rúa: de la militancia al poder, con una breve y conflictiva gestión * Rip Torn, 88, American actor (Cross Creek, The Larry Sanders Show, Men in Black), Emmy winner (1996).Rip Torn, Artie the Producer on 'The Larry Sanders Show,' Dies at 88 ===10=== * Paulo Henrique Amorim, 77, Brazilian journalist, heart attack.Morre o jornalista Paulo Henrique Amorim * Jim Bouton, 80, American baseball player (New York Yankees, Houston Astros), writer (Ball Four), and actor (The Long Goodbye), co-creator of Big League Chew, cerebral amyloid angiopathy.Former Yankees pitcher Jim Bouton, author of Ball Four, dead at 80 * Valentina Cortese, 96, Italian actress (Malaya, The Barefoot Contessa, Brother Sun, Sister Moon).Addio Valentina Cortese, l'ultima diva * Motto McLean, 93, Scottish-born Canadian ice hockey player (Omaha Knights).Emmanuel H. R. “Motto” McLean * Walt Michaels, 89, American football player (Cleveland Browns) and coach (New York Jets). * Denise Nickerson, 62, American actress (Willy Wonka & the Chocolate Factory, Dark Shadows, Smile), seizure caused by pneumonia.‘Willy Wonka’ Star Denise Nickerson Dead at 62 * Dorothy Toy, 102, American tap dancer (Toy & Wing).Dorothy Toy, dazzling dancer known as the ‘Asian Ginger Rogers,’ dies at 102 * Gerald Weissmann, 88, Austrian-born American physician, editor-in-chief of The FASEB Journal (2006–2016).Gerald Weissmann ===11=== * Dengir Mir Mehmet Fırat, 76, Turkish politician, member of the Grand National Assembly (1999–2011, since 2015), lung cancer.Former Turkish deputy Dengir Mir Mehmet Fırat dies aged 76 * Brendan Grace, 68, Irish actor (Moondance), comedian (Father Ted) and singer, lung cancer.Irish comedian Brendan Grace has died * Rumen Surdzhiyski, 75, Bulgarian movie director (Swan, Snapshots as Souvenirs, Place Under the Sun) and screenwriter.Rumen Surdzhiyski Death Certificate ===12=== * Jorge Aguado, 93, Argentine politician, de facto Governor of Buenos Aires Province (1982–1983) and Minister of Agriculture and Livestock (1981).Falleció el exgobernador bonaerense, empresario y ruralista Jorge Aguado * Fernando J. Corbató, 93, American computer scientist, Turing Award winner (1990), problems caused from diabetes.Fernando Corbató, a Father of Your Computer (and Your Password), Dies at 93 * Hodan Nalayeh, 42, Somali- Canadian businesswoman, television journalist (Citytv) and producer (American Idol, So You Think You Can Dance), bombing.Kismayo attack: At least 26 dead as gunmen storm Somali hotel * Eberhard Kummer, 78, Austrian folk singer and lawyer.Bassbariton Eberhard Kummer ist gestorben * Claudio Naranjo, 86, Chilean-born American psychiatrist and writer, co-developer of the Enneagram of Personality.Murió Claudio Naranjo, reconocido psiquiatra chileno * M. J. Radhakrishnan, 61, Indian cinematographer (Deshadanam, Karunam, Naalu Pennungal), cardiac arrest. * Jean-Pierre Worms, 84, French sociologist and politician, Deputy (1981–1993).Décès de Jean-Pierre Worms : Les Radicaux de Gauche viennent de perdre un ami ===13=== * Richard Carter, 65, Australian actor (Mad Max: Fury Road, The Great Gatsby, Rafferty's Rules).Vale Richard Carter, actor * Michael English, 88, British politician, MP (1964–1983).Members of our Association who have died during 2019 * Augusto Fantozzi, 79, Italian lawyer and politician, Minister of Economy and Finance (1995–1996) and Foreign Trade (1996–1998).Morto Augusto Fantozzi, fu ministro e commissario Alitalia * Sadashiv Vasantrao Gorakshkar, 86, Indian writer and art curator.ज्येष्ठ वस्तुसंग्रहालयतज्ज्ञ पद्मश्री सदाशिव गोरक्षकर यांचं निधन * Paul F. Markham, 89, American attorney, U.S. Attorney for the District of Massachusetts (1966–1969), key figure in the Chappaquiddick incident.Paul Markham Obituary * Mona Malden, 102, American actress (The Gentle People, I'll Take the High Road).Mona Malden, Actress and Widow of Karl Malden, Dies at 102 * Rod Richards, 72, Welsh politician, MP for Clwyd North West (1992–1997) and Leader of the Welsh Conservative Party (1999), cancer.Former Conservative politician Rod Richards dies ===14=== * Hussain Muhammad Ershad, 89, Bangladeshi military officer and politician, Chief of Army Staff (1978–1986), President (1983–1990) and Leader of the Opposition (since 2019), myelodysplastic syndrome.Former Bangladesh military dictator Ershad dies at 89 * Terry Hodgkinson, 70, British businessman, Chairman of Yorkshire Forward (2003–2010).Former Yorkshire Forward chair Terry Hodgkinson dies * Nereo Laroni, 76, Italian politician, Mayor of Venice (1985–1987) and MEP (1989–1994), problems caused by heart surgery.Morto Nereo Laroni. Si è spento al'ospedale di Mestre dopo un intervento * Pernell Whitaker, 55, American boxer, four-weight world champion, Olympic champion (1984), hit by a car.Former champion Whitaker hit by car, dies * Paul Albert Zipfel, 83, American Roman Catholic prelate, Bishop of Bismarck (1996–2011), dementia. ===15=== * Mortimer Caplin, 103, American lawyer and educator, Commissioner of Internal Revenue (1961–1964).Mortimer Caplin, charismatic and hard-driving IRS commissioner, dies at 103 * Ousmane Tanor Dieng, 72, Senegalese politician, Vice-president of the Socialist International (since 1996) and presidential candidate (2007). * Craig Fallon, 36, British judoka, world champion (2005).Obituary: Craig Fallon * Alexis Galanos, 78, Cypriot politician, President of the House of Representatives (1991–1996) and Mayor-in-exile of Famagusta (since 2006). * Edith Irby Jones, 91, American physician, first African-American student to go to a racially mixed class in the Southern United States, President of the National Medical Association (1985–1988).Dr. Edith Irby Jones dies in Houston at age 91 * Bruce Laingen, 96, American politician, United States Ambassador to Malta (1977–1979), taken hostage during the Iran crisis, problems caused by Parkinson's disease.Diplomat held hostage in Iran's revolution, a Minnesota native, dies * Werner Müller, 73, German businessman and politician, Federal Minister for Economic Affairs and Energy (1998–2002), cancer.Werner Müller: Früherer Bundeswirtschaftsminister ist tot - DER SPIEGEL * John Tanton, 85, American anti-immigration activist, founder of the Federation for American Immigration Reform, Parkinson's disease.Anti-immigrant leader Dr. John Tanton of Michigan dies at 85 ===16=== * Rosa María Britton, 82, Panamanian physician and writer.Muere Rosa María Britton * Ernie Broglio, 83, American baseball player (St. Louis Cardinals, Chicago Cubs), cancer.Former Cardinal pitcher Ernie Broglio dies at 83 * Daniel Callahan, 88, American philosopher, co-founder of The Hastings Center.Daniel Callahan, a pioneer in bioethics, dies at 88 * Chung Doo-un, 62, South Korean politician, Vice-Mayor of Seoul (2000–2003) and MP (since 2004), suicide.Ex-lawmaker Chung Doo-un found dead on Seoul mountain * Johnny Clegg, 66, South African singer and musician (Juluka, Savuka), pancreatic cancer. * Barry Coe, 84, American actor (Jaws 2, Peyton Place, Bonanza), myelodysplastic syndrome. Barry Coe * Raja Dhale, 78, Indian writer and political activist, co-founder of Dalit Panthers, problems caused from a fall. * Howard Engel, 88, Canadian writer (Benny Cooperman) and television executive (CBC), pneumonia.Acclaimed Mystery Author Howard Engel Dies at 88 * John Paul Stevens, 99, American judge, Associate Justice of the Supreme Court (1975–2010), problems caused by a stroke.Retired Supreme Court Justice John Paul Stevens dead at age 99 ===17=== * Andrea Camilleri, 93, Italian writer (Salvo Montalbano) and television writer (Le inchieste del commissario Maigret), problems caused by a heart attack.Andrea Camilleri è morto, addio al papà di Montalbano * Pumpsie Green, 85, American baseball player (Boston Red Sox, New York Mets).Pumpsie Green, First Black Red Sox Player, Dies At 85 * Nikola Hajdin, 96, Serbian civil engineer, President of the Serbian Academy of Sciences and Arts (2003–2015).Преминуо академик Никола Хајдин * Wesley Pruden, 83, American journalist (The Washington Times).Washington Times editor, columnist Wesley Pruden dies at 83 after remarkable six-decade career ===18=== * Yukiya Amano, 72, Japanese politician, Director General of the International Atomic Energy Agency (since 2009). * Charles Ceccaldi-Raynaud, 94, French lawyer and politician, Senator (1995–2004), Deputy (1993–1995) and Mayor of Puteaux (1969–2004).Décès de l'ancien maire de Puteaux Charles Ceccaldi-Raynaud * Luciano De Crescenzo, 90, Italian screenwriter (In the Pope's Eye) and director (Così parlò Bellavista), pneumonia.Roma, Luciano De Crescenzo è morto nella sua casa romana * David Hedison, 92, American actor (Voyage to the Bottom of the Sea, The Fly, Live and Let Die).David Hedison Dies: ‘Voyage To The Bottom Of The Sea’ Actor Was 92 * Kurt Julius Isselbacher, 93, American gastroenterologist and medical editor (Journal of Clinical Investigation), member of the National Academy of Sciences (since 1973), stroke.KURT J. ISSELBACHER Obituary * Roelof Nelissen, 88, Dutch politician and banker, Deputy Prime Minister (1971–1973), Minister of Finance (1971–1973) and CEO of the AMRO Bank (1983–1991).Oud-minister, fusiebankier en republikein Roelof Nelissen overleden ===19=== * Inger Berggren, 85, Swedish singer (\"Sol och vår\"), Eurovision participant (1962).Svenska Mello-vinnaren Inger Berggren död – blev 85 år gammal * John Elya, 90, Lebanese-born American Melkite Greek Catholic prelate, Eparch of Newton (1993–2004).Bishop John Adel Elya, B.S. † * Rutger Hauer, 75, Dutch actor (Soldier of Orange, Blade Runner, Batman Begins), Golden Globe winner (1987).Rutger Hauer, ‘Blade Runner’ Co-Star, Dies at 75 * Ágnes Heller, 90, Hungarian philosopher and political theorist (The New School), drowned.Hungarian philosopher Agnes Heller dies at age of 90 * Jeremy Kemp, 84, British actor (The Winds of War, Z-Cars, The Blue Max).Jeremy Kemp obituary * Don Mossi, 90, American baseball player (Cleveland Indians, Detroit Tigers, Chicago White Sox).Don Mossi, 1954 Cleveland Indians Relief Star Dies At 90 * César Pelli, 92, Argentine architect (Petronas Towers, Carnegie Hall Tower, One Canada Square).Cesar Pelli, Argentine architect behind the Petronas Towers, dies aged 92 * Bert Rechichar, 89, American football player (Baltimore Colts).Former Colt Bert Rechichar, who once held record for NFL’s longest field goal, dies * Yao Lee, 96, Chinese singer (\"Gong Xi Gong Xi\", \"Rose, Rose, I Love You\").《玫瑰玫瑰我爱你》原唱姚莉去世，享年96岁 ===20=== * Sheila Dikshit, 81, Indian politician, MP (1984–1989), Chief Minister of Delhi (1998–2013) and Governor of Kerala (2014), cardiac arrest.Sheila Dikshit, Three-time Delhi Chief Minister and Congress Leader, Passes Away at 81 * R. James Harvey, 97, American politician and lawyer, Mayor of Saginaw (1957–1959), member of the U.S. House of Representatives (1961–1974) and Judge of the U.S. District Court for the Eastern District of Michigan (1973–1984).James Harvey -mayor, congressman, judge - dies at 97 * Peter McNamara, 64, Australian tennis player and coach, prostate cancer.Décès de l'ancien joueur de tennis australien Peter McNamara * Ilaria Occhini, 85, Italian actress (Doctor and the Healer, Welcome to Home Gori, Loose Cannons).Addio all'attrice Ilaria Occhini, aveva 85 anni * Liane Russell, 95, Austrian-born American geneticist and conservationist. ===21=== * Hugo Cóccaro, 65, Argentine politician, Governor of Tierra del Fuego (2005–2007), cancer.Tenía 64 años: Falleció en Buenos Aires el ex gobernador Hugo Cóccaro * Antonino Cuffaro, 87, Italian politician, MP (1976–1987, 1994–1996).Morto Antonino Cuffaro, esponente del Pci e della Trieste ‘scientifica’ * Francisco Grau, 72, Spanish military officer and composer, Director of the Musical Unit of the Royal Guard (1988–2008).Muere el compositor Francisco Grau * Paul Krassner, 87, American writer (The Realist) and political activist.Paul Krassner Dies: Author And Radical Activist Was 87 * José Manuel Estepa Llaurens, 93, Spanish Roman Catholic cardinal, Military Ordinary of Spain (1986–2003).Muere el arzobispo emérito castrense Card. José Manuel Estepa Llaurens * Robert Morgenthau, 99, American lawyer, New York County District Attorney (1975–2009) and U.S. Attorney for the Southern District of New York (1961–1962; 1962–1970).Robert Morgenthau, Longtime Manhattan District Attorney, Dies at 99 ===22=== * Peter Hamm, 82, German poet and journalist (Der Spiegel, Die Zeit).Peter Hamm, der kompromisslose Anwalt des Dichterischen, ist tot * Christopher C. Kraft Jr., 95, American aerospace engineer, Director of Johnson Space Center (1972–1982).Christopher Columbus Kraft, NASA’s legendary flight director, has died * Brigitte Kronauer, 78, German writer, Georg Büchner Prize winner (2005).Award winning German author Brigitte Kronauer dies at 78 * Hans Lagerqvist, 79, Swedish Olympic pole vaulter (1972), brain cancer.Hans Lagerqvist har avlidit * Li Peng, 90, Chinese politician, Vice Premier (1983–1987), Premier (1988–1998) and Chairman of the Standing Committee of the National People's Congress (1998–2003).China's former premier Li Peng dies at 90 * Art Neville, 81, American singer-songwriter and keyboardist (The Meters, The Neville Brothers).New Orleans legend Art Neville, founder of the Meters and Neville Brothers, dies at 81 * Godfried Toussaint, 75, Canadian computer scientist. (death announced on this date) ===23=== * Chaser, 15, American Border Collie, largest-tested non-human memory.‘World’s smartest dog’ that understood more than 1,000 words dies at age 15 * Maxim Dadashev, 28, Russian boxer, head injuries caused by boxing. * Ruth Gotlieb, 96, British-born New Zealand politician, Wellington City Councillor (1983–2001).Long-serving Wellington politician Ruth Gotlieb dies aged 96 * Michael Roth, 83, German engineer.Nachruf für Papa * Barney Smith, 98, American plumber, artist and museum curator.San Antonio's Toilet Seat Art Museum owner Barney Smith dead at 98 * Ferdinand von Bismarck, 88, German businessman and lawyer, Prince of Bismark (since 1975).Prince Ferdinand of Bismarck dies at 88 * Lois Wille, 87, American journalist (Chicago Daily News, Chicago Sun-Times, Chicago Tribune), Pulitzer winner (1963, 1989), stroke.Lois Wille, 2-time Pulitzer Prize-winner who wrote and edited for 3 Chicago newspapers, has died at 87 ===24=== * Claes Andersson, 82, Finnish writer, psychiatrist and politician, Minister of Culture (1995–1998) and MP (1987–1999, 2007–2008).Kirjailija ja kulttuurivaikuttaja Claes Andersson on kuollut * Margaret Fulton, 94, Scottish-born Australian chef and cookbook writer (The Margaret Fulton Cookbook).Margaret Fulton, who inspired Australians to undertake culinary adventures, is dead at 94 * Cathy Inglese, 60, American college basketball coach (University of Vermont, Boston College, University of Rhode Island), problems caused from a fall.Former Boston College women's basketball coach Cathy Inglese dies at 60 * Michael Kittredge, 67, American home decor executive and philanthropist, founder of Yankee Candle.Yankee Candle founder Michael Kittredge II died at 67 ===25=== * Beji Caid Essebsi, 92, Tunisian politician, Prime Minister (2011) and President (since 2014).Tunisian president Beji Caid Essebsi dies * Jesper Juul, 71, Danish writer and family therapist, pneumonia.Jesper Juul ist tot * Jorma Kinnunen, 77, Finnish javelin thrower, Olympic silver medalist (1968).Keihäänheiton maailmanennätysmies Jorma Kinnunen on kuollut 77-vuotiaana * Danny McCarthy, 76, Welsh footballer (Cardiff City, Abergavenny Thursdays, Merthyr Tydfil).Thursdays legend remembered (death announced on this date) * Jimmy Patton, 87, British comedian (Patton Brothers), cancer.Third Chuckle Brother Jimmy Patton dies aged 87 a year after Barry * Pierre Péan, 81, French journalist and writer.Mort de l’écrivain et journaliste d’investigation Pierre Péan * Óscar Enrique Sánchez, 64, Guatemalan footballer (Comunicaciones, Municipal, national team) and Olympian (1976), problems caused from heart surgery.Fallece Óscar el «Conejo» Sánchez, leyenda del futbol guatemalteco ===26=== * Arnie Brown, 77, Canadian ice hockey player (New York Rangers, Detroit Red Wings, Toronto Maple Leafs).Brown, longtime NHL defenseman, dies at 77 * Graham Freudenberg, 85, Australian political speechwriter (Australian Labor Party) and writer (A Certain Grandeur – Gough Whitlam in Politics).Labor speechwriter Graham Freudenberg dies, aged 85 * Jaime Lucas Ortega y Alamino, 82, Cuban Roman Catholic cardinal, Archbishop of San Cristóbal de la Habana (1981–2016), pancreatic cancer.Cardinal Ortega, former archbishop of Havana, dies at 83 * Kevin Roster, 36, American poker player and assisted death activist, euthanized by medial aid.Dying Poker Player Kevin Roster Passes Peacefully, Lived Out Dream of Playing in WSOP * Russi Taylor, 75, American actress (Disney's House of Mouse, The Simpsons, DuckTales), colon cancer.Disney Legend Russi Taylor Dies at 75 ===27=== * Carlos Cruz-Diez, 95, Venezuelan artist.Falleció el artista venezolano Carlos Cruz- Diez * Humphrey Mijnals, 88, Surinamese-born Dutch footballer (Robinhood, DOS Utrecht, national team).Surinaams icoon en pionier Humphrey Mijnals (88) overleden * Mike Roarke, 88, American baseball player and coach (Detroit Tigers, St. Louis Cardinals, San Diego Padres).West Warwick native Mike Roarke, former MLB player and coach, dies at 88 * John Robert Schrieffer, 88, American physicist, Nobel Prize in Physics winner (1972).Nobel Prize-winning physicist John Schrieffer dies in Florida ===28=== * Eduardo Gómez, 68, Spanish actor and comedian (Aquí no hay quien viva, La que se avecina, Butterfly's Tongue), laryngeal cancer.Muere Eduardo Gómez, actor de 'Aquí No Hay Quien Viva' y 'La Que Se Avecina', a los 68 años * George Hilton, 85, Uruguayan-born Italian actor (The Masked Man Against the Pirates, The Brute and the Beast, Man Called Invincible).Addio a George Hilton, icona dello spaghetti western * Vladimir Kara-Murza Sr., 59, Russian journalist, television presenter and political activist, co-founder of NTV.Died in Moscow the journalist Kara-Murza * Loek van Mil, 34, Dutch baseball player (Curaçao Neptunus, Tohoku Rakuten Golden Eagles, national team), problems caused from a hiking injury.Nederlands honkbalinternational Loek van Mil (34) * Jaipal Reddy, 77, Indian politician, Minister of Earth Sciences and Science and Technology (2012–2014) and MP (1984–2014), pneumonia.Former union minister S. Jaipal Reddy passes away * Ruth de Souza, 98, Brazilian actress (The Landowner's Daughter, Macumba Love, A Glass of Rage), pneumonia.Atriz Ruth de Souza morre no Rio aos 98 anos * Richard B. Stone, 90, American lawyer and politician, U.S. Senator from Florida (1975–1980) and U.S. Ambassador to Denmark (1991–1993).Richard Stone, Florida's first Jewish Senator since Civil War, dies at 90 ===29=== * Egil Danielsen, 85, Norwegian javelin thrower and politician, Olympic champion (1956).OL-helten Egil Danielsen er død * Enrique Lafourcade, 91, Chilean writer (Palomita Blanca), critic and journalist (El Mercurio).A los 91 años muere el escritor chileno Enrique Lafourcade * Vasil Metodiev, 84, Bulgarian footballer (Akademik Sofia, Lokomotiv Sofia, Dobrudzha Dobrich)Почина Васил Методиев-Шпайдела * Mona-Liisa Nousiainen, 36, Finnish Olympic cross-country skier (2014), cancer.Maastohiihtäjä Mona-Liisa Nousiainen on kuollut * Tuvya Ruebner, 95, Israeli poet and translator.המשורר טוביה ריבנר, חתן פרס ישראל, הלך לעולמו בגיל 95 * Zdeněk Srstka, 83, Czech Olympic weightlifter (1960), stuntman and actor (Poslední propadne peklu).Zemřel herec, kaskadér a sportovec Zdeněk Srstka, bylo mu 83 let ===30=== * Marcian Bleahu, 95, Romanian geologist, writer and politician, Senate (1990–2000).Academicianul Marcian Bleahu a încetat din viață * Nick Buoniconti, 78, American Hall of Fame football player (Miami Dolphins, Boston Patriots) and medical research activist (Miami Project to Cure Paralysis).Hall of Fame LB Nick Buoniconti dies at 78 * Deep Impact, 17, Japanese champion racehorse (Japan Cup) and sire, euthanized. * W. Roy McCutcheon, 89, Canadian educator, President of Seneca College (1984–1992).W. Roy McCucheon 1929-2019 * Werner von Moltke, 83, German Olympic decathlete (1968).Der USC trauert um Werner v. Moltke ===31=== * Martín Arzola Ortega, 42, Mexican convicted drug lord (Jalisco New Generation Cartel), shot.\"El 53\" o \"El Negro\": uno de los muertos en Plaza Galerías de Zapopan sería integrante del CJNG * María Auxiliadora Delgado, 82, Uruguayan civil servant, First Lady (2005–2010, since 2015), heart attack.Fallece María Auxiliadora Delgado, esposa del presidente de Uruguay, Tabaré Vázquez * Hamza bin Laden, 29–30, Saudi jihadist (al-Qaeda), son of Osama bin Laden.Hamza bin Laden, Son and Heir to Qaeda Founder, Is Dead. (death announced on this date) * Raffaele Pisu, 94, Italian comedian and actor (Susanna Whipped Cream, Weekend, Italian Style, The Consequences of Love), Nastro d'Argento winner (2005).E' morto Raffaele Pisu * Harold Prince, 91, American theatre director and producer (The Phantom of the Opera, Fiddler on the Roof, West Side Story), multi-Tony winner.Harold Prince Dies: Broadway Legend Who Produced Original ‘West Side Story’, ‘Fiddler’, ‘Phantom’ & More Was 91 * Jean-Luc Thérier, 73, French rally driver.Jean-Luc Thérier est mort ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *7 Deaths",
 "title": "Deaths in July 2019"
}