{
 "id": "701990",
 "text": "The 2020 United Democratic Party leadership election and convention elected the leader of the United Democratic Party (UDP). It was triggered on 18 November 2018, when Prime Minister of Belize, Dean Barrow‘s cabinet urged him to remain as Prime Minister of Belize until 2 November 2020, a day after the Next Belizean general election on 1 November 2020. Barrow’s Cabinet also urged him to remain as Leader of the UDP until February 2020. He said he would take that move and eventually scheduled the United Democratic Party leadership election and convention to February 2020. . Nominations would be opened in January 2020. There will be three ballots. The first ballot will be endorsement and voting by Dean Barrow.The second ballot will be from the former members and Candidates of the UDP who will be voting and the third ballot is from the people of Belize. There will also be a exhaustive ballot of MPs also talking place in mid-February 2020. The ultimate decision will be made by the general membership of the party who will elect the leader by postal ballot. The results will be announced by the end of February 2020. Speculation about a leadership election started in 2006. Barrow told LOVE FM that he would resign as Leader of the UDP If his party loses the Municipal Elections. The UDP had not defeated the than rulling People’s United Party in any election until the 2006 municipal elections and the UDP was not doing very well after Barrow called for Civil Unrest In 2005. However, that all changed after the UDP won a landslide victory in the 2006 Municipal elections and eventually took control of the government in the 2008 Belizean general election. Background After being in power for seven years the People’s United Party was desperate to win the 2006 Belizean municipal elections and govern the country like never before. It has never lost any election since coming to power after the 1998 Belizean general election. The UDP however, was faced with a shocking traumatic defeat in the 1998 general election with only three of the UDP Candidates getting elected.. Barrow and Member of Parliament for Mesopotamia constituency, Michael Finnegan were the only two Members of Parliament and Area Representatives to be re-elected to their constituencies. Erwin Contreras narrowly defeated PUP’s Amin Hegar In Cayo West constituency and became the only newly elected UDP MP and Area Representative. Several UDP Ministers and Members went down to defeat. One of them was prominent then Leader of the UDP, Manuel Esquivel who also served as Prime Minister of Belize since 1984 and has been leading the UDP since 1983. After the 1998 Belizean general election, Esquivel stepped down as Leader of the UDP after being it's leader for 15 years. Esquivel also called a snap 1998 United Democratic Party (Belize) leadership election and convention. In his last address to the nation as leader of the UDP, Esquivel said that it's time for the UDP to “renew itself from the top and embark once more on the road to victory”. Nomination day was open on 29 August 1998 and the First Deputy Leader of the UDP, Barrow was the only person who submitted his nominations to contest in the UDP leadership election. Category:2020 Category:Politics of Belize",
 "title": "2020 United Democratic Party (Belize) leadership election and convention"
}