{
 "id": "702020",
 "text": "The Indian Space Research Organisation is the agency of India that deals with space exploration and astronomy. Also known as ISRO, the organisation has made many successes since its creation in 1969. It built and launched the Mars Orbiter Mission which made India the first country to get to Mars on its first try. == Creation == Organised research about space in India was led by two scientists: Vikram Sarabhai and Homi Bhaba. Bhaba was the secretary of the Department of Atomic Energy when it was founded in 1950. He supported Sarabhai in creating India's first rocket launch station. In 1962, the Indian National Committee for Space Research was set up by India's first prime minister, Jawaharlal Nehru.Pushpa M. Bhargava; Chandana Chakrabarti (2003). The Saga of Indian Science Since Independence: In a Nutshell. Universities Press. pp. 39–. ISBN 978-81-7371-435-1. In 1969, ISRO was created to follow INCOSPAR. == Space flight programs == Like other space programs, ISRO has had many successes and failures. In the beginning, ISRO built satellites that were then launched by other countries, like the Soviet Union. Later, ISRO built many types of rockets. Some of those rockets are now decommissioned, meaning ISRO does not use them anymore. In the future, India also wants to send people to space and send more missions to other planets. === Launch vehicles === During the 1960s and 1970s India began its own rocket program. ISRO has had five different types of rockets. The Satellite Launch Vehicle was a 4-stage solid-propellant light launcher. It was supposed to be tall and be able to carry . The first launch was in 1979 and launched every year until 1983. It launched successfully for the first time on July 18, 1980. This means that India is the sixth country to get spaceflight by itself. It is now decomissioned. The Augmented Satellite Launch Vehicle was a five-stage solid propellant rocket. It was able to carry into low Earth orbit. The design was based on the SLV and the project started in the 1980s. The rocket was tested in 1987, 1988, 1992, and 1994 and only two of them were successful. It is now decommissioned. The Polar Satellite Launch Vehicle uses an expendable launch system to carry things into space. It is still in use. The Geosynchronous Satellite Launch Vehicle also uses an expendable launch system, this time to launch INSAT-type satellites. Currently it is India's second-heaviest launch vehicle and can launch up to into low Earth orbit. There are multiple marks, or versions of this rocket. It is still in use. === Satellites === India's first satellite, which was called the Aryabhata, was launched by the Soviet Union. Since then India has built and launched many different satellites. ==== Rohini series ==== Rohini is a series of four satellites. These satellites were launched by the Satellite Launch Vehicle, and three of them were able to make it into orbit. ==== INSAT series ==== The Indian National Satellite System (INSAT) is a series of satellites built and launched by ISRO. These help India with telecommunications, broadcasting, meteorology, and search-and-rescue. ==== IRS series ==== The Indian Remote Sensing satellites (IRS) are a series of satellites built and launched by ISRO. It is the largest series of remote sensing satellites for regular people in the world. ==== Radar Imaging Satellites ==== India(Bharat) has two Radar Imaging Satellites (RISAT). ==== South Asia Satellite ==== The South Asia Satellite is a communications satellite launched in 2017 as a gift to the other countries in the South Asian Association for Regional Cooperation. ==== GPS-aided geo-augmented navigation satellite system ==== Also known as GAGAN, this is a national plan for satellite navigation. ==== IRNSS satellite navigation system ==== The Independent Regional Navigation Satellite System is made to have accurate position information to people in India as well as 1500 km from its borders. It is made like this because in bad situations, people cannot rely on GPS. ISRO first planned to launch the satellites between 2012 and 2014, but it had to be moved to later years. === Human spaceflight === The first Indian cosmonaut is Rakesh Sharma, who flew with two Russians in Salyut 7 in 1984. The first female Indian astronaut was Kalpana Chawla. She died in in 2003. The second female Indian astronaut, Sunita Williams, spent 321 days 17 hours 15 minutes in space. === Exploring other planets === In 2008 ISRO sent Chandrayaan-1 to the moon. It helped discover evidence of water on the moon. ISRO flew the Mars Orbiter Mission in 2013 and it reached Mars in 2014, making India the 4th country to put a spacecraft in orbit around Mars. Chandrayaan-2 was India's second moon mission. It was launched on 22 July 2019 at 2:43 PM IST (09:13 UTC) to the Moon by a Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III). It includes an orbiter, lander, and rover that would study the moon both on and above the surface. The mission spent some time orbiting Earth before going to the moon. The lander failed to reach the lunar south pole on 6 September 2019 due to a software glitch. == Future == The next Mars mission will be the Mars Orbiter Mission 2, and will be launched in 2024. The first mission to the Sun will be a probe called Aditya-L1. It was originally planned for 2012, but was delayed to 2021 and then January 2023. It will study solar wind and space weather. The first mission to Venus will be an orbiter mission called Shukrayaan-1, that will launch in 2028. The ISRO created Vyommitra, a female humanoid robot, who will travel to space as a crew member on future Gaganyaan missions. == References == Category:1969 establishments in Asia",
 "title": "Indian Space Research Organisation"
}