{
 "id": "702121",
 "text": "Jamin Pugh (January 25, 1984 – January 17, 2023) was an American professional wrestler best known by his ring name Jay Briscoe. He was best known for his time with Ring of Honor, where at the time of his death was one-half of the ROH World Tag Team Champions with his brother Mark Briscoe in their 13th reign. He was also a two-time ROH World Champion and ROH World Six-Man Tag Team Champions. On January 17, 2023, Briscoe died in a car accident in Laurel, Delaware, 8 days before he would have turned 39. His death was announced on Twitter by AEW and ROH owner, Tony Khan. == Championships and accomplishments == *Combat Zone Wrestling ** CZW World Tag Team Championship (2 times) – with Mark Briscoe *Extreme Rising **Match of the Year (2012) with Mark Briscoe vs. Blk Out vs. los Dramáticos **Extreme Rising Moment of the Year (2012) with Mark Briscoe Debut in a Cage match against Blk Out and los Fantásticos. *Full Impact Pro **FIP Tag Team Championship (1 time) – with Mark Briscoe *Game Changer Wrestling **GCW Tag Team Championship (3 times) – with Mark Briscoe * House of Glory ** HOG Tag Team Championship (1 time) – with Mark Briscoe *Impact Wrestling **Impact World Tag Team Championship (1 time) – with Mark Briscoe *Indie Wrestling Hall of Fame **Class of 2024https://www.pwinsider.com/article/180604/jay-and-mark-briscoe-to-be- inducted-into-indie-wrestling-hall-of-fame-class-of-2024.html?p=1 *Jersey All Pro Wrestling **JAPW Tag Team Championship (1 time) – with the Insane Dragon * National Wrestling Alliance ** Crockett Cup (2022) – with Mark Briscoe *New Japan Pro-Wrestling **IWGP Tag Team Championship (1 time) – with Mark Briscoe **NEVER Openweight 6-Man Tag Team Championship (2 times, first) – with Mark Briscoe and Toru Yano *NWA Wildside **NWA Wildside Tag Team Championship (1 time) – with Mark Briscoe *Premier Wrestling Federation **PWF United States Heavyweight Championship (1 time) **PWF United States Heavyweight Championship Tournament (2009) * Pro Wrestling Illustrated ** Ranked No. 7 of the top 500 wrestlers in the PWI 500 in 2015 *Pro Wrestling Noah **GHC Junior Heavyweight Tag Team Championship (1 time) – with Mark Briscoe *Pro Wrestling Unplugged **PWU Tag Team Championship (1 time) – with Mark Briscoe *Real Championship Wrestling **RCW Tag Team Championship (1 time) – with Mark Briscoe **RCW Tag Team Championship Tournament (2009) – with Mark Briscoe *Ring of Honor **ROH World Championship (2 times) **ROH World Six-Man Tag Team Championship (1 time) – with Bully Ray and Mark Briscoe **ROH World Tag Team Championship (13 times) – with Mark Briscoe **Honor Rumble (2009)Jay and his brother Mark were the co-winners of the 2009 Honor Rumble due to it using a tag team-oriented format rather than a singles wrestler-oriented format. **ROH Year-End Award (3 times) ***Tag Team of the Year (2019) – ***Tag Team of the Decade (2010s) – ***Tag Team of the Year (2021) – **ROH Hall of Fame (class of 2022) *Squared Circle Wrestling **2CW Tag Team Championship (1 time) – with Mark Briscoe *USA Xtreme Wrestling **UXW Tag Team Championship (1 time) – with Mark Briscoe *Wrestling Observer Newsletter **Tag Team of the Year (2007) – with Mark Briscoe ** Feud of the Year (2022) ** Shad Gaspard/Jon Huber Memorial Award (2023) == Footnotes == == References == Category:1984 births Category:2023 deaths Category:American professional wrestlers Category:Sportspeople from Delaware",
 "title": "Jay Briscoe"
}