{
 "id": "70224",
 "text": "Baron Edouard Louis Joseph Merckx () (born June 17, 1945, Meensel-Kiezegem, Vlaams Brabant, Belgium) is a former Belgian professional road racing cyclist. Merckx, regarded as the greatest and most successful cyclist of all time, established several world cycling records, some of which remain unbroken to this day. ==Racing career== ===Early successes in stage racing and single day races=== Merckx started competing in 1961. Three years later he became Amateur World Champion. He turned professional in 1965. In 1966 he won the first of seven editions of Milan-Sanremo. He started his first Grand Tour at the 1967 Giro d'Italia. He won his first stage here and finished seventh overall. Later that year he outsprinted Jan Janssen to become Professional World Champion at Heerlen, The Netherlands. He was world champion twice more. In 1968 Merckx moved to the Italian Faema team. As world champion he wore the rainbow jersey and won the Paris-Roubaix race for the first time. He also won the Giro d'Italia . He won the Giro three more times. Starting the 1969 season, he won Paris-Nice stage race. In the time trial, he overtook the five-time Tour de France winner Jacques Anquetil. Anquetil was so good at time trailing many people thought he was unbeatable. Merckx went on to win Milan-Sanremo and Ronde van Vlaanderen several weeks later. In his Tour de France debut (first entry) in 1969, Merckx immediately won the yellow jersey (overall leader), the green jersey (best sprinter) and the red polka-dotted jersey (\"King of the Mountains\" - best climber in the mountain stages). No other cyclist has won the three jerseys in one Tour de France, and only Tony Rominger in 1993 and Laurent Jalabert in 1995 have been able to match this feat in any Grand Tour. Both were in the Tour of Spain. Merckx was only 24, so would have won the white jersey (for best rider under 25 years of age) but the Tour de France did not give a white jersey until the 1970s. Eddy Merkx was the first Belgian to win the Tour de France since Sylvère Maes in 1939. Merckx became a national hero. He won the Tour four more times: in 1970, 1971, 1972 and 1974, equalling Jacques Anquetil. Over the next 25 years, only Bernard Hinault and Miguel Indurain were able to equal the five victories. Merckx still holds the records for stage wins (34) and number of days in the Yellow Jersey (96). ===Challenges to Merckx's domination in the Grand Tours=== The greatest challenge to Merckx was in the 1971 Tour de France. Luis Ocana attacked and won the maillot jaune by several minutes. Ocana held his lead until he crashed and had to abandon (leave) the tour. Many people hoped they would race against each other again.of a rematch between the two. Before that could happen, Merckx raced in the 1972 edition of the Giro d'Italia and beat the mountain racing expert Jose Manuel Fuente in the mountain stages. In that year's Tour de France Ocana was sick and withdrew. In 1973 Merckx rode in the Vuelta a España where he beat Luis Ocana and Bernard Thévenet and then went on to win the Giro d'Italia. Merckx's final victory in the Giro d'Italia in the 1974 edition was a tight battle between Merckx and two Italians. In the end, Merckx won by the very narrow margin of twelve seconds over Gianbattista Baronchelli and 33 seconds over Felice Gimondi. ===Classics victories=== In addition to Grand Tour successes, Merckx has a long list of victories in one-day races. Among the highlights are * a record seven victories in Milan-Sanremo * two victories in the Ronde van Vlaanderen * three wins in Paris-Roubaix * a record five wins in Liège-Bastogne-Liège and * two in the Giro di Lombardia That is a total of 19 victories in the Classics. He also won the World Road Racing Championship a record three times in 1967, 1971 and 1974, and every Classic except Paris-Tours. Finally, he won 17 six-day track races, often with Patrick Sercu. Merckx retired from racing in 1978, at the age of 33. ===Setbacks and lesser days=== The blackest day in Merckx's career was in 1969, when he crashed in a derny race towards the end of the season. A pacer and a cyclist fell in front of Merckx's pacer, Fernand Wambst. Wambst and Merckx crashed. Wambst was killed instantly, and Merckx suffered concussion and fell unconscious. This accident cracked a vertebra and twisted his pelvis. Afterwards he said his riding was never the same, because he always be in pain, especially while climbing. That same year, during the Giro d'Italia, was found to have used drugs and disqualified. He cried in front of reporters and still protests his innocence. He argued that there were no counter-experts nor counter-analysis and that foreign supporters hated him. Further, he stated that the stage during which he was allegedly using drugs was an easy one, so there was no need to use drugs. The Belgian prince sent a plane to bring him to Belgium. This incident was one of the reasons why Merckx thought his first Tour de France victory, later that year, his best ever win The end of his Tour-career came in 1975 (although he did compete in 1977 he finished 6th that year). That year, he attempted to win his sixth but became a victim of violence. Many Frenchmen were upset that a Belgian might beat the record five wins set by Jacques Anquetil. Merckx held the yellow jersey for eight days, which raised his record to 96 days, but during stage 14 a French spectator punched him in the liver. A later collision with the Danish rider Ole Ritter broke his jaw. Although he could not eat solid food and was barely able to talk, Merckx did not retire. During the last stage, he attacked leader Bernard Thevenet (but was caught by the peloton). ===Records=== Merckx set these records during his career. * Most career victories by a professional cyclist: 525. * Most victories in one season: 54. * Most stage victories in the Tour de France: 34. * Most stage victories in one Tour de France: 8, in 1970 and 1974 (shared with Charles Pelissier in 1930 and Freddy Maertens in 1976). * Most days with the yellow jersey in the Tour de France: 96. * The only cyclist to have won the yellow, green and red polka-dotted jersey in the same Tour de France (1969). * Most victories in the Classic cycle races: 28. * Most victories in one single Classic cycle race: 7 (in Milan-Sanremo). ===Hour record=== Merckx set the hour record in October 25, 1972. He covered 49.431 km at high altitude in Mexico City. The record was unbeaten until 1984, when Francesco Moser broke it using a specially designed bicycle. During the next 15 years, various racers improved the record to more than 56 km. However, because of the more and more strange designs of the bikes and position of the rider, in 2000 the UCI said a \"traditional\" bike must be used. When Chris Boardman had another go at Merckx's reinstated record in 2000, he beat it by slightly more than 10 metres at sea level. But, Merckx had raced a full road season winning the Tour, Giro and four Classics, while Boardman was a time trial specialist who had retired from road racing and had prepared specially for the 2000 Hour Record. ==After retirement== Having retired, Merckx has a bicycle factory and is a race commentator. He was coach of the Belgian national cycling team during the mid-90s, and part of the Belgian Olympic Committee. Merckx is still asked to comment as an authority on cycling. As such, he has also figured as special advisor for the recent UCI addition \"Tour of Qatar\" since 2002. In May 2004, he underwent an oesophagus operation to cure the constant stomach ache which he suffered since he was a young man. He lost almost 30 kg in the process, and started cycling again, but only for leisure. ==Personal life== In 1967 Merckx married Claudine Acou. Merckx's mother asked the priest to celebrate the ceremony in French, a choice that ended up being a contentious issue in Belgium. They had two children: a daughter (Sabrina), and a son (Axel) who was a professional cyclist for Team T-Mobile. Despite this early incident, Merckx is a perfect ambassador to Belgium (because he does not support Flanders more than Wallonia, but supports the unity of the country). Because of this, he came 4th in the Walloon version of the \"Greatest Belgian\" contest in 2005, and third in the Flemish (3rd) version.. In 1996 the Belgian king gave him the title of baron. In 2000 he was chosen Belgian \"Sports Figure of the Century\". Merckx is known as a quiet and modest person. Many of his former helpers have worked in his bicycle factory and join him during recreational bike tours. Merckx has condemned doping (he tested positive twice in his career). At the same time he has been quick to point out that cycling is unfairly treated when compared to other sports. In the 1990s, he became a friend of Lance Armstrong and supported him when he was accused of drug use, stating he \"believed what Lance told him than what appeared in newspapers\". After Armstrong won his third Tour de France, Merckx predicted he would go on to win as many as seven. ==Trivia and cultural references== * Merckx was nicknamed \"the cannibal\" because he wanted to win every race he participated in, never \"arranging\" a race with another competitor. Other nicknames were \"the Einstein of the two-wheelers\", and, courtesy of Jacques Goddet, \"Le Géant\" (The Giant). * Eddy Merckx has a namesake who is a multiple Belgian Champion and world champion 2006 in three cushion billiards. * While climbing Mont Ventoux in 1970 to a stage win, he pushed himself so hard that oxygen had to be administered. * In the mid- seventies Merckx figured in some television commercials for cigarettes; an act for which he was criticized and which he now regrets.\"Duo interview Tom Boonen - Eddy Merckx\", Gazet van Antwerpen, February 3, 2007 * When the United States Secretary of State Condoleezza Rice visited Belgium in 2005, she met Merckx as a cultural representative of Belgium. * The Eddy Merckx metro station on the Brussels metro is named in his honour. His hour world record bike is at this station. * A cycling contest, The Eddy Merckx Grand Prix, is named in his honour. * In the French comedy Les Aventures de Rabbi Jacob (The Mad Adventures of Rabbi Jacob) (1973) with Louis de Funès, de Funès' character hears a conversation between a kidnapper and his victim, a revolutionary. When the revolutionary says: \"The revolution is like a bike ( http://likeabikes.com ): When it doesn't move forward, it falls.\", de Funès attributes the line to Eddy Merckx. One of the kidnappers corrects him and says Che Guevara once said this. * In the comic strip Asterix Merckx makes a cameo as a \"fast runner\" in the album Asterix in Belgium. * In 2000, the Belgian magazine Knack declared him to be \"Belgian of the Century\" and another four years later, the magazine Humo called him \"the Greatest Belgian\". * Paul Van Himst, another Belgian sport legend, is one of his closest friends. * Merckx cameoed as himself in several movies, of which the 1985 movie American Flyers, starring Kevin Costner, is the best known. ==Significant victories by race== ===Grand Tours (11)=== Eddy Merckx Grand tour results 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 Tour de France general classification - - 1 1 1 1 - 1 2 - 6 Tour de France mountains classification - - 1 1 3 2 - 2 2 - ? Tour de France points classification - - 1 2 1 1 - 2 2 - 5 Tour de France stages won - - 6 8 4 6 - 8 2 - 0 Giro d'Italia general classification 9 1 DSQ 1 - 1 1 1 - 8 - Giro d'Italia mountains classification 3 1 DSQ 4 - 2 2 2 - 7 - Giro d'Italia points classification 2 1 DSQ 3 - 2 1 4 - 2 - Giro d'Italia stages won 2 3 4 3 - 4 6 2 - 0 - Vuelta a España general classification - - - - - - 1 - - - - Vuelta a España mountains classification - - - - - - 2 - - - - Vuelta a España points classification - - - - - - 1 - - - - Vuelta a España stages won - - - - - - 6 - - - - * 5× Tours de France, 34 stage wins * 5× Giro d'Italia, 24 stage wins * 1× Vuelta a España, 6 stage wins ===Other stage races=== * 1× Tour de Suisse * 2× Tour of Belgium * 3× Paris-Nice * 1× Tour de Romandie * 1× Dauphiné Libéré * 1× Midi Libre * 4× Tour of Sardinia ===Classic cycle races (28)=== * 7× Milan-Sanremo * 2× Ronde van Vlaanderen * 3× Paris-Roubaix * 5× Liège-Bastogne-Liège * 2× Giro di Lombardia * 2× Amstel Gold Race * 3× La Flèche Wallonne * 1× Paris-Brussels * 3× Ghent-Wevelgem ===World titles=== * 3× World Championships * 1× Amateur World Championships ===Track races=== * 17 six-day races * 3× European Championships * 7× Belgian Madison Championships (with Patrick Sercu) ==Significant victories by year== ;1964 :World Amateur Road Race Champion ;1965 : Six Days of Gent (with Patrick Sercu) ;1966 (Team Peugeot-BP) :Milan-Sanremo :Trofeo Angelo Baracchi, with Ferdi Bracke :Championship of Flanders :Tour de Morbihan ;1967 (Team Peugeot-BP) : World Pro Road Race :Milan-Sanremo :La Flèche Wallonne :Gent-Wevelgem :Trofeo Angelo Baracchi, with Ferdi Bracke :2 stages, Giro d'Italia :Critérium des As :Six Days of Gent (with Patrick Sercu) ;1968 (Team Faema) : Giro d'Italia, including ::Mountains Classification ::Points Classification ::4 stages :Volta a Catalunya :Tour de Romandie :Paris-Roubaix :Tre Valli Varesine :Tour of Sardinia :G.P. Lugano :A travers Lausanne ;1969 (Team Faema) :Tour de France ::Overall classification :: Mountains Classification :: Points Classification ::6 stages :Paris-Luxembourg :Milan-Sanremo :Ronde van Vlaanderen :Liège- Bastogne-Liège :Paris-Nice, including ::4 stages :Super Prestige Pernod International ;1970 (Team Faema-Faemino) :Tour de France ::Overall classification :: Mountains Classification ::8 stages :Giro d'Italia, including ::3 stages :Paris-Nice :Tour of Belgium :Paris-Roubaix :La Flèche Wallonne :Gent-Wevelgem :Critérium des As : National Cycling Championship Road Race :Super Prestige Pernod International ;1971 (Team Molteni) :Tour de France ::Overall classification :: Points Classification ::4 stages : World Pro Road Race :Milan-Sanremo :Liège-Bastogne-Liège :Giro di Lombardia :Rund um den Henninger Turm :Omloop \"Het Volk\" :Paris-Nice :Dauphiné Libéré :GP du Midi Libre :Tour of Belgium :Super Prestige Pernod International ;1972 (Team Molteni) :Tour de France ::Overall classification :: Points Classification ::6 stages :Giro d'Italia, including ::4 stages :Milan-Sanremo :Liège-Bastogne- Liège :Giro di Lombardia :La Flèche Wallonne :Giro dell'Emilia :Giro del Piemonte :Grote Scheldeprijs :Trofeo Angelo Baracchi, with Roger Swerts :Hour Record - 49.431 km :Super Prestige Pernod International ;1973 (Team Molteni) :Giro d'Italia, including ::Points Classification ::6 stages :Vuelta a España, including ::Points Classification ::Sprints Classification ::Combined Classification ::6 stages :Paris-Roubaix :Liège-Bastogne-Liège :Grand Prix des Nations :Amstel Gold Race :Gent-Wevelgem :Omloop \"Het Volk\" :Paris-Brussels :GP Fourmies :Super Prestige Pernod Trophy ;1974 (Team Molteni) :Tour de France ::Overall classification ::8 stages :Giro d'Italia, including ::2 stages : World Pro Road Race :Tour de Suisse, including ::Points Classification ::KoM ::3 stages :Critérium des As :Super Prestige Pernod Trophy ;1975 (Team Molteni) :Milan-Sanremo :Ronde van Vlaanderen :Liège- Bastogne-Liège :Amstel Gold Race :Catalan Week :2 stages, Tour de France :1 stage, Tour de Suisse :Super Prestige Pernod Trophy : Six Days of Gent (with Patrick Sercu) ;1976 (Team Molteni) :Milan-Sanremo :Catalan Week ;1977 (Team Fiat) : 1 stage, Tour de Suisse : Tour Méditerranéen : Six Days of Munich (with Patrick Sercu) : Six Days of Zürich (with Patrick Sercu) : Six Days of Gent (with Patrick Sercu) == Doping == Merckx twice tested positive for doping in his career. Because he has admitted doing this publicly the city of Stuttgart, Germany did not want to invite him to the world cycling championships being held in the city in 2007 ==Related pages== * Cycling records ==Notes== ==References== * * * * Category:1945 births Category:Belgian cyclists Category:Belgian nobility Category:Doping cases in cycling Category:Giro d'Italia winners Category:Living people Category:People from Flemish Brabant Category:Tour de France winners Category:Vuelta a España winners Category:World cycling champions",
 "title": "Eddy Merckx"
}