{
 "id": "702206",
 "text": "Djibouti participated in the 1988 Summer Olympics in Seoul, South Korea. This was the second time Dijibouti went to the Olympics. Dijibouti sent six athletes to this Olympics. They sent; Hoche Yaya Aden, Ismael Hassan, Talal Omar Abdillahi, Hussein Ahmed Salah, Omar Moussa and Robleh Ali Adou. All but Robleh Ali Adou competed in track and field athletics events. Robleh Ali Adou competed in sailing. == Medalists == Before this Olympics Djibouti had not won a medal. Hussein Ahmed Salah won the county's first Olympic medal. Ahmed Salah won a bronze medal in the men's marathon.Gildea, William (October 2, 1988). \"Italy's Bordin Mines Last of Seoul's Gold; 2:10:32 Marathon Ends Competition\". The Washington Post. p. B1. Ahmed Salah won the medal with a time of two hours, ten minutes and fifty-nine seconds, only twenty-seven seconds behind the gold medalist. Ahmed Salah finished the qualification for this event in 2:07:07, breaking the previous world record of 2:07:12. The record was also broken by Carlos Lopes, who finished faster than Salah. Lopes became the new world record holder. Marathon; 2:06:49 Clocking is World Best\". New York Times. Associated Press. April 18, 1988. p. C6.Wright, G (April 18, 1988). \"Record Pressure on Deek\". The Herald.\"Deek Shows the Way to Our Young Stars\". Sunday Mail. QNP. September 18, 1988. Medal Name Sport Event Date Hussein Ahmed Salah Athletics Men's marathon October 2 == Athletics == Five male athletes from Dijibouti went to the Olympics to compete in athletics events. They were; Hoche Yaya Aden, Ismael Hassan, Talal Omar Abdillahi, Hussein Ahmed Salah, and Omar Moussa. This were the first Summer Olympic Games for Aden, Hassan, Abdillahi, and Moussa. Salah competed in the 1984 Summer Olympics in Los Angeles. Hoche Yaya Aden competed in the men's 1500 meters, where he finished twelfth in his heat. He did not go onto the next round. The medals went to Kenya, Great Britain and East Germany. Ismael Hassan competed in the men's 5000 meters, where he finished fourteenth in his heat. He did not go onto the next round. The medals went to Kenya, West Germany, and East Germany. == References == Category:Sport in Djibouti Category:1988 Summer Olympics",
 "title": "Djibouti at the 1988 Summer Olympics"
}