{
 "id": "702361",
 "text": "The list of University of Kansas people includes notable alumni and faculty of the University of Kansas. The university is in Lawrence, Kansas. == Alumni == === Nobel laureates === People who have won a Nobel Award include: * Frank Rowland (1956–64), awarded the 1995 Nobel Prize in Chemistry * Vernon Smith (M.A. in economics 1952), awarded the 2002 Nobel Memorial Prize in Economics === Politics, government and education === People in the areas of politics, government and education include: * Juan Manuel Santos, Former President of Colombia, elected in 2010; Nobel Peace Prize winner (2016) * William H. Avery (1934), 37th governor of Kansas (1965–1967) * Sheila C. Bair, former Chairman of the Federal Deposit Insurance Corporation (FDIC) * Kay Barnes, Mayor of Kansas City, Missouri (1999–2007) * Carol A. Beier, Kansas Supreme Court Justice * Robert Frederick Bennett, 39th governor of Kansas (1975–1979) * George L. Brown, first African-American elected lieutenant governor and first African-American elected to statewide office in Colorado * Sam Brownback, United States Ambassador-at-Large for International Religious Freedom; former Governor of Kansas; former U.S Senator for Kansas; former U.S. Representative for the Second District of Kansas; former Secretary of Agriculture, Kansas * Thomas W. Butcher, president of Kansas State Teachers College (Emporia State University) (1913–1943) * Francisco Santos Calderón, 9th vice president of Colombia * Arthur Linton Corbin (1894), professor at Yale Law School and scholar of contract law * Jonathan M. Davis, 22nd governor of Kansas * George Docking (1925), 35th governor of Kansas (1957–1961) * Robert Docking (1948), 38th governor of Kansas (1967–1975) * Bob Dole, former U.S. Senate majority leader and Senator from Kansas (1969–1996), presidential and vice-presidential nominee, played football and basketball while attending. * Jerry Elliott, Kansas jurist * Sam C. Ford, the 12th governor of Montana * Thomas Frank, author, What's the Matter with Kansas? * Frederick Funston, attended 1885–1888, US Army general, recipient of Medal of Honor * John B. Gage (1907), mayor of Kansas City, Missouri (1940–1946) * Robert L. Gernon (BS 1966), Kansas Supreme Court Justice * Arthur Harkins (BA 1959, PhD 1968), UMN Graduate Certificate in Innovation Studies * Jane Dee Hull (1957), 24th governor of Arizona (1997–2003) * Todd Ames Hunter (BA 1975), member of the Texas House of Representatives from Corpus Christi, 1989–1997; attorney since 2009 * John E. Jacobs, interim president of Emporia State in 1953; Director of Special Education for the Kansas State Department of Education, 1953–1957 * Dusty Johnson, former South Dakota PUC Commissioner and chief of staff to the Governor of South Dakota * Lee A. Johnson (BS 1964), Kansas Supreme Court Justice * Nancy Landon Kassebaum (1954), first female U.S. senator (1979–1997) elected without having been preceded in office by her husband * Kenton Keith, U.S. ambassador to Qatar (1992–1995) * Marisa Kelly (BA 1986), political scientist and President of Suffolk University in Boston, Massachusetts * Joan F. Kessler, Wisconsin Court of Appeals Judge * Phill Kline (JD 1987), former Attorney General of Kansas (2003–2006), District Attorney of Johnson County (2007–2008) * Ron Kuby, civil rights attorney * Alf Landon (1908), 26th governor of Kansas (1933–1937) and Republican nominee in the 1936 presidential election * Delano Lewis, former National Public Radio CEO and ambassador to South Africa * Caroline Lucas, first Member of Parliament (UK) elected as a Green Party of England and Wales candidate * Deane Waldo Malott (1921), former Chancellor of KU and 6th president of Cornell University (1951–1963) * David McClain, President, University of Hawaii * John H. McClendon, African-American studies scholar at Michigan State University * Merritt C. Mechem, 5th governor of the State of New Mexico (1921–1923) * Kenneth Megill, philosopher, trade unionist, social activist, records and knowledge manager * Alexander C. Mitchell (1889), Kansas Board of Regents, State House and Representative to the Sixty-second US Congress * Dennis Moore, U.S. Congressman for Kansas District 3 (1999–2011) * Franklin David Murphy (B.S. 1936), Chancellor of the University of Kansas and Chancellor of the University of California, Los Angeles * Lawton Nuss (BA 1975, JD 1982), Kansas Supreme Court Justice * Frank D. Parent, California municipal court judge * William C. Perry (1922), Chief Justice Oregon Supreme Court * Eric Rosen, Kansas Supreme Court Justice * Jim Ryun, former U.S. Congressman Kansas District 2 (1997–2007), three-time U.S. Olympic runner and silver medalist * Mike Schreiner (BA '92), Leader of the Green Party of Ontario 2009–present * Kathleen Sebelius, Secretary of Health and Human Services under Obama, 44th governor of Kansas (2003–2009) * Michael Shonrock – former president of Emporia State University; now president of Lindenwood University * Stephen Six, Attorney General of Kansas * Sam V. Stewart, Montana Supreme Court Justice and the sixth governor of Montana * David Stras, Justice of the Minnesota Supreme Court and Donald Trump's nominee to the United States Court of Appeals for the Eighth Circuit * Walter R. Stubbs, 18th governor of Kansas * Deanell Reece Tacha (BA 1968), former chief judge of the U.S. Court of Appeals for the Tenth Circuit (2001–present) * Rosalie E. Wahl (1946), first woman appointed to the Minnesota Supreme Court * Bob Whittaker, U.S. Representative from Kansas * Kevin Yoder, U.S. Representative from Kansas District 3 (2011–2019) * Shombi Sharp, United Nations Resident Coordinator (Ambassador), Republic of Armenia (2018–) === Media and the arts === * Gina Adams, Ojibwe-American cross-media artist and activist * Wendall Anschutz, bachelors and masters in communications, long time KCTV news anchor * Sanora Babb, novelist, best known for An Owl on Every Post and Whose Names Are Unknown * Scott Bakula, actor, star of Quantum Leap and Star Trek: Enterprise * James Barnes, professor and award-winning composer * Etta Moten Barnett, actress and singer, the first black artist to perform at the White House * Liliana V. Blum, Mexican writer * Danni Boatwright, former Miss Teen USA and Miss USA contestant, winner of Survivor: Guatemala * Kara Brock, television and movie actress * Terry Bryant, journalist; sports and weather anchor, KMPH FOX 26, Fresno, California * Igor Buketoff, conductor * Trai Byers, actor, star of Empire * Christina Chang, television actress * Jan Chiapusso, piano pedagogue * Evan S. Connell, novelist, best known for Mrs. Bridge and Mr. Bridge * Steve Doocy, Fox News anchor, New York Times bestselling author * Bob Dotson, documentarian and NBC reporter, four-time Emmy Award winner * Bill Downs, CBS and ABC News correspondent and one of the original Murrow Boys * Robert Ebendorf, international metalsmith and jeweler who uses found objects in his artwork * C. L. Edson, newspaper columnist, humorist, and poet * Gillian Flynn, writer, novel Gone Girl * Heidi Gardner, comedian, Saturday Night Live * Kori Gardner, vocalist, organist, and pianist in Mates of State; writer of Band on the Diaper RunBand on the Diaper Run * Frances Ginsberg, opera singer * Nikki Glaser, comedian * Cara Gorges, Miss Kansas USA 2007, controversial 2nd runner-up in Miss USA pageant * Moses Gunn, actor, TV mini-series Roots * Sherman Halsey, music video director, producer and artist manager * Ann Hamilton (BFA 1979), sculptor, installation artist and 1993 MacArthur Fellow recipient * Jason Hammel, musician, member of Mates of State * Kevin Harlan, broadcaster for CBS and TNT sports * Herk Harvey, award-winning director of over 400 industrial and educational short movies and cult movie Carnival of Souls * Scott Heim, novelist * Kevin Helliker, Chicago bureau chief of the Wall Street Journal, awarded the 2004 Pulitzer Prize for Explanatory Reporting * Caroline Henderson, teacher, farmer, author * Bob Holtzman, ESPN bureau-reporter for SportsCenter * William Inge, Pulitzer Prize and Academy Award-winning author and playwright * Don Johnson, actor, co-star of Miami Vice and Nash Bridges * Tim Joyce, television journalist, writer, meteorologist * Tom Kane (BA 1985), voice actor, best known roles: Yoda, Admiral Ackbar, Academy Awards announcer, voice of The Walt Disney Parks and Monorail, Professor Utonium... * Jay Karnes, television actor, most notably from The Shield * John Kessel, Nebula Award-winning author, editor, professor of creative writing * George E Kimball III, author, poet * Terry Kiser, actor who portrayed the title character of the comedy Weekend at Bernie's * Bill Kurtis, television journalist and producer, host of A&E; shows including American Justice and Cold Case Files * Neil LaBute, filmmaker/screenwriter, wrote and directed In the Company of Men, nominated for Palme D'Or for Nurse Betty * Wayne Lamb, Broadway dancer, choreographer and Professor Emeritus at Purdue University * Margaret Larkin, writer, poet, singer-songwriter, theater personality, researcher, and union activist * Jack Lembeck, painter and sculptor * Keith Loneker, NFL player, St. Louis Rams and Atlanta Falcons; actor, Leatherheads, Superbad, Lakeview Terrace * Laura Moriarty, novelist * Robert Morris, contemporary sculptor and painter (transferred to Reed College) * Rob Neyer, baseball author and columnist for ESPN.com * Sara Paretsky, novelist, best known for her frequent protagonist V.I. Warshawski * Mandy Patinkin, Emmy and Tony Award-winning actor and singer (Yentl, The Princess Bride; TV's Criminal Minds) * Artur Pizarro, concert pianist * Maurice Prather, motion picture and still photographer and movie director * Unique Priscilla, Indonesian-born actress and model * Betsy Randle, actress best known as the mother on Boy Meets World * Rob Riggle, comedian, The Daily Show correspondent and former Saturday Night Live cast member * Melissa Rooker, Director of Development of Malpaso Productions *Aaron S. Rosenberg, author and game designer * Paul Rudd, actor from TV's Friends, Clueless, The Cider House Rules, Anchorman: The Legend of Ron Burgundy, and Ant-Man * Dan Ryckert, video game journalist * Heidi Schwegler, artist * Devin Scillian, television journalist and children's author * Gary Mark Smith, artist, author, master global street photographer * William Stafford (BA 1937), poet and pacifist, winner of the National Book Award for Travelling Through the Dark * Oscar S. Stauffer (1910), founder of Stauffer Communications * Craig Stevens, movie, television and stage actor; star of the detective series Peter Gunn, 1958–1961 * Mimi Thebo (BA 1985), Carnegie-nominated children's author * Laurence Traiger, composer * Kari Wahlgren (BA 1999), voice actor * Dee Wallace, actress (E.T. the Extra-Terrestrial, The Howling) * Catherine Warren, Miss Illinois USA 2006 * William Allen White, Pulitzer Prize-winning journalist and author * Frank Wilcox, actor (attended for one year before transferring to St. Benedict's College) === Science and technology === *Henry K. Beecher (BA 1926, MA 1927), anesthesiologist, medical ethicist, and investigator of the placebo effect *Jon Davies (BS 1980), meteorologist, expert on severe thunderstorm environments and forecasting * Paul R. Ehrlich (MA/PhD 1957), entomologist, researcher and author of The Population Bomb, and 1990 MacArthur Fellow recipient * Joe Engle (BS 1955), former NASA astronaut and a retired U.S. Air Force colonel * Ronald E. Evans (BS 1956), former NASA astronaut and a retired U.S. Navy captain * Robert M. Haralick (BA 1964, BS 1966, MS 1967, PhD 1969), Distinguished Professor of Computer Science, Graduate Center, City University of New York * Steve Hawley (BA 1973), former NASA director and astronaut; Professor of Physics and Astronomy at KU * Erasmus Haworth, founder of the Kansas Geological Survey * David Hillis, evolutionary biologist and 1999 MacArthur Fellow recipient * Wes Jackson (MA 1960), environmental historian and founder of the Land Institute, a 1992 MacArthur Fellow recipient * Bill James, baseball sabermetrician; author of The Bill James Baseball Abstract, starting in 1977; named to the Time 100 in 2006 * Richard F. Johnston, ornithologist and author, onetime curator of the Natural History Museum *William T. Kane, physicist in field of fiber optics * Joseph W. Kennedy (MA 1937), co-discoverer of the element plutonium * Thomas Kunz (PhD 1971), researcher notable for insights into bat ecology * Warren P. Mason (B.Sc 1927), electrical engineer and physicist, founder of the field of distributed element circuits * Brian McClendon (BSEE 1986), VP of Engineering for Google Earth, formerly Keyhole, Inc. * Elmer McCollum, co-discoverer of Vitamin A * Nariman Mehta, pharmacologist, developer of the antidepressant and smoking cessation drug bupropion * Rear Admiral Wayne E. Meyer, \"father\" of the Aegis Combat System and namesake of the USS Wayne E. Meyer naval destroyer * Douglas Shane (BS 1982), director of flight operations for SpaceShipOne, which made the first privately funded human spaceflight * Vernon L. Smith (M.A. in economics 1952), awarded the 2002 Nobel Memorial Prize in Economics * Kathryn Stephenson (MD 1941), first American woman board-certified plastic surgeon * Walter Sutton, pioneer of cellular biology and genetics, physician, inventor * George Tiller (BS 1963, MD 1967), physician, abortion provider, pro-choice advocate * Clyde Tombaugh, astronomer, discoverer of the dwarf planet Pluto * Kent Whealy, co-founder of the Seed Savers Exchange; 1988 MacArthur Fellow recipient ===Business=== * Bud Adams, CEO of Adams Resources, owner of the Tennessee Titans until his death * Kenneth S. \"Boots\" Adams (1921), former President and CEO of Phillips 66 Petroleum Company * Kjell Almskog, Norwegian businessman; former chief executive officer of Kværner and many other companies * Philip Anschutz (1961), billionaire, founder of Qwest * Sue Anschutz-Rodgers (1955), cattle ranch owner and philanthropist * Cynthia Carroll, CEO of Anglo American, one of the world’s largest independent mining companies * Linda Z. Cook (1980), executive director of Shell Gas & Power, part of Royal Dutch Shell * David Dillon, Chairman and CEO, Kroger Co. * Robert Eaton, former CEO of Chrysler Corporation * Brad Garlinghouse, CEO of Ripple * Robert Kaplan, president and CEO of the Federal Reserve Bank of Dallas, former Vice Chairman of the Goldman Sachs Group * Lou Montulli, co- founder of Netscape * Alan Mulally (BS/MS), President and CEO of Ford Motor Company * Christopher A. Sinclair (1971), Chairman and CEO of Mattel; former CEO of Pepsi-Cola Co. * Harry F. Sinclair, founder of Sinclair Oil Corporation * Charles E. Spahr (1934), former CEO of Standard Oil of Ohio * Kenneth A. Spencer (1926), Spencer Chemical Company founder whose philanthropies to KU include the Kenneth Spencer Research Library and the Helen Foresman Spencer Museum of Art * David Wittig (1977), former President and CEO of Westar Energy * Cheryl Womack, founder of insurance company for National Association of Independent Truckers, who donated the money for Arrocha Ballpark on the KU campus == Honorary alumni == * Donald J. Hall, Sr., Chairman of the Board and former President and CEO of Hallmark Cards * Chester Nez, WWII veteran and the last living of the 29 Navajo Code Talkers == Faculty == * Raj Bhala, distinguished Professor of Law and the Associate Dean for International and Comparative Law * Jan Chiapusso, Dutch-born pianist and pedagogue * J C D Clark, Ph.D., Cambridge University; Professor of History, History of Political Thought, 17th and 18th-century Britain, History of Religion * Anthony Corbeill, classics professor and writer specializing in political humor, Roman gesture, and grammatical gender * Loren Eiseley, anthropology professor from 1937 to 1944 * Michael S. Engel, distinguished Professor of Ecology and Evolutionary Biology; Curator of Entomology; expert on fossil insects * Bryant C. Freeman, founded the Institute of Haitian studies at KU, was given the protocol rank of major general with the U.N. peacekeeping force, and has published dictionaries in the language. * James Gunn, Hugo Award-winning science fiction author and creative writing professor * Steve Hawley, Professor of Physics and Astronomy, former astronaut and director of flight crew operations of Johnson Space Center * Kij Johnson, creative writing professor, Nebula-winning fantasy author * Kermit E Krantz MD, LittD (deceased 2007), University distinguished Professor; Professor and Chairman Emeritus, Department of Obstetrics and Gynecology; developed the Marshall–Marchetti–Krantz (MMK) surgical procedure; invented the expandable tampon * Solomon Lefschetz (1884–1972), known for his topological fixed-point theorem * Stanley Lombardo, classics professor and translator of classical works into English, including the Iliad, Odyssey, and Aeneid * Adrian Melott, Professor of Physics and Astronomy; astrophysicist and astrobiologist, researched the large-scale structure of the Universe and mass extinctions * Charles D. Michener; former chairman of KU Entomology Department, ex-director of the Snow Entomological Museum; distinguished Professor Emeritus * Richard Moore, distinguished Professor emeritus * Jan Roskam, emeritus professor of aerospace engineering, author of eleven books on airplane design and flight dynamics * Susan Scholz, Harper Faculty Fellow * Kevin Willmott, associate professor of theater and film; writer and director of the movie C.S.A.: The Confederate States of America, won Academy Award for Best Adapted Screenplay (along with Spike Lee, David Rabinowitz, and Charlie Wachtel) for BlacKkKlansman * Donald Worster, distinguished Professor Emeritus of History, considered one of the founders of the field of environmental history == Athletes and coaches == For athletes and coaches, see the relevant section in Kansas Jayhawks ===Baseball=== * Bob Allison, All-Star outfielder of the Washington Senators and Minnesota Twins, 1959 American League Rookie of the Year * Jeff Berblinger, former Major League Baseball player * Brett Bochy. former Major League Baseball pitcher * Mike Getto, Head Baseball Coach, All- American in football, Head Coach for the Brooklyn Dodgers team in 1942 * Tom Gorzelanny, former Major League Baseball pitcher * Travis Metcalf, former Major League Baseball player * Steve Renko, major league pitcher, winner of 136 games for seven different teams * Rob Thomson, major league coach for the Philadelphia Phillies * Mike Zagurski, major league pitcher for the Arizona Diamondbacks * TJ Walz, minor league pitcher for the Oakland A’s ===Basketball=== * Cole Aldrich, 2010 All-American, 11th pick in the 2010 NBA draft, Oklahoma City Thunder * Phog Allen, head basketball coach; won three national championships, 10th winningest coach in college basketball history and #1 winningest when he retired, also had brief stints as the head football coach and head baseball coach * Darrell Arthur, 2008 National Champions, 27th pick of 2008 NBA draft, Memphis Grizzlies * Nick Bradford, basketball player 1997–2000, played professionally in Iceland, France, and Romania * Bill Bridges, All-American, 1975 NBA Championship with Golden State Warriors * Mario Chalmers, 2007 Big 12 Co-Defensive Player of the Year, 2008 National Champions, MOP of 2008 Championship Game, 34th pick of 2008 NBA draft, Miami Heat, 2012 and 2013 NBA Finals Champion with the Miami Heat, currently an NBA free agent * Wilt Chamberlain, two-time All-American, Naismith Basketball Hall of Famer and NBA all-time leader for career rebounds and most points in a single game with 100 points * Sherron Collins, 2010 All-American, NBA player for Charlotte Bobcats, currently with Windsor Express * Nick Collison, All- American, NBA player for the Oklahoma City Thunder also known as \"Mr. USA Basketball\" for representing the country in international basketball *Cheick Diallo, NBA player for the New Orleans Pelicans. * Joel Embiid, NBA player for the Philadelphia 76ers * Drew Gooden, All-American, 4th pick 2002 NBA draft, Basketball America Player of the Year 2002, Milwaukee Bucks * Xavier Henry, All Big 12 honorable mention, 12th pick in the 2010 NBA draft, Memphis Grizzlies * Kirk Hinrich, All-American, NBA player with the Chicago Bulls *Josh Jackson, 4th pick in the 2017 NBA Draft, NBA player for the Phoenix Suns * Tom Kivisto (basketball), played on 1971 and 1974 Final Four Teams * Raef LaFrentz, All-American, NBA player with the Portland Trail Blazers * Keith Langford, professional basketball player (with Maccabi Tel Aviv) * Clyde Lovellette, All-American; first basketball player in history to play on NCAA, Olympic, and NBA championship squads; three NBA Finals titles and 1952 Olympic gold medal and NCAA Champion * Danny Manning, basketball player and coach; two-time All-American, 1988 recipient of the Naismith and Wooden Awards, Big 8 Player of the Decade for the 1980s, two-time NBA all-star * Frank Mason III, NBA player for the Sacramento Kings * Ben McLemore, 7th pick of 2013 NBA draft, Sacramento Kings * Ralph Miller, former men's basketball coach at Oregon State University, the University of Iowa, and Wichita State University, member of the Basketball Hall of Fame * Marcus Morris, All-American basketball player, fourteenth pick in the 2011 NBA draft, Houston Rockets * Markieff Morris, thirteenth pick of the 2011 NBA draft, Phoenix Suns * James Naismith, inventor of basketball * Gregory Donovan Ostertag, NBA Utah Jazz 1995–2012, retired * Paul Pierce, All-American, NBA All-Star, 2008 NBA Finals Champion and NBA Finals MVP with the Boston Celtics, now on the Los Angeles Clippers * Scot Pollard, NBA, free agent * Thomas Robinson, NBA player for the Sacramento Kings * Dave Robisch, two-time All-American, 13 seasons in the ABA and NBA * Adolph Rupp, former men's basketball coach at the University of Kentucky and the third winningest coach in the sport; two-time Helms National Championship team member at KU * Brandon Rush, two-time All-American, MVP of the 2008 Big 12 Tournament, 2008 National Champions, 13th pick of 2008 NBA draft, Indiana Pacers, 2015 NBA Finals Champion as a member of the Golden State Warriors * Wayne Selden Jr., NBA player for Memphis Grizzlies * Wayne Simien, two-time All-American, 2005 Big 12 Player of the Year * Dean Smith, basketball coach at the University of North Carolina; third winningest coach in the sport; 1952 NCAA Basketball title at KU * Tyshawn Taylor, NBA player for the Brooklyn Nets * Mark Turgeon, former player and current head coach for University of Maryland, formerly at Wichita State and Texas A&M; * Darnell Valentine, All- American, three-time Academic All-American, 16th pick in 1981 NBA draft, 10 years in NBA * Jacque Vaughn, head coach of Orlando Magic, two-time All- American, and 27th pick in 1997 NBA draft * Jo Jo White, All-American, 1968 gold medal Mexico City Olympics, named the most valuable player of the 1976 NBA Finals, seven-time NBA All-Star with Boston Celtics * Lynette Woodard, four-time All-American at KU; major college basketball's career women's scoring leader; first female member of the Harlem Globetrotters; Olympic women's basketball gold medalist * Julian Wright, All-American, 13th pick of 2007 NBA draft, Toronto Raptors * Andrew Wiggins, first pick in the 2014 NBA draft, 2015 NBA Rookie of the Year, current Minnesota Timberwolves player ===Football=== * Gilbert Brown, NFL nose tackle for Super Bowl XXXI Champion Green Bay Packers; 11 seasons in NFL * Jon Cornish, CFL running back for the Calgary Stampeders; 2013 CFL season Most Outstanding Player and Most Outstanding Canadian; 2012 CFL season Most Outstanding Canadian; played in and won the 96th Grey Cup * Nolan Cromwell, All-American; in 1976 set NCAA rushing record for a quarterback; 1980 NFC Defensive Player of the Year; four-time pro bowl selection in 11 years with the Los Angeles Rams * J.P. Darche, former NFL long-snapper for the Seattle Seahawks and Kansas City Chiefs, graduated from the KU Medical School in 2014 following his retirement from football (played football at and received undergraduate degree from McGill University in Canada) * Dick Davis, American Football League champion with the 1962 Dallas Texans * Jack Del Rio, former NFL linebacker and coach Did not play football at Kansas, attended and graduated from the school while playing for the Kansas City ChiefsGarfield, David. \"NFL success, KU degree among Del Rio's rewards,\" KU Alumni magazine, Issue 5, 2007, page 55. *Bobby Douglass, KU and NFL quarterback; led 9–1 Jayhawks to Orange Bowl in 1968; All-American 1968, drafted 2nd round by Chicago Bears in 1969, retired 1978 * Mike Getto, Head Baseball Coach, All-American in Football, Head Coach for the Brooklyn Dodgers in 1942 * John Hadl, two-time All-American, once as halfback and once as quarterback; KU Football Player of the Century; NFL quarterback 1962–1977 * Chris Harris Jr., cornerback for Denver Broncos; Super Bowl 50 champion; two- time Pro Bowler * James Holt, 2008 Insight Bowl defensive MVP; signed by the San Diego Chargers as an undrafted free agent in 2009 * Ron Jessie, former NFL Pro Bowl wide receiver * Mike Johnson, NFL player * Rod Jones, Aloha Bowl Champion 1995, National Football League 1996–2002, Cincinnati Bengals, St. Louis Rams, Washington Redskins * Curtis McClinton, played in Super Bowl IV with the Kansas City Chiefs; sixth-leading rusher in franchise history; MVP * Monte Merkel, NFL guard * Tyler Patmon, NFL cornerback, graduated from Kansas but did not finish college football career at Kansas. * Elvis Patterson, former NFL cornerback, two-time Super Bowl champion (XXI, XXVIII) * Willie Pless, star football linebacker in the Canadian Football League; NCAA and Big 8 record holder for tackles with 633 (in only 3 years); 11-time All-Pro and 5-time Defensive Player of the Year in CFL * John Riggins, Super Bowl XVII MVP; Pro Football Hall of Fame inductee * Gale Sayers, All-American, Pro Football Hall of Fame running back * Laverne Smith, NFL running back, Pittsburgh Steelers * Dana Stubblefield, NFL all-pro defensive end; drafted in the first round of the 1993 NFL Draft, 26th overall, by the San Francisco 49ers; NFL Defensive Rookie of the Year; four-time All-Pro selection (1994, 1995, 1996, 1997); NFL Defensive Player of the Year 1997 * Darrell Stuckey, NFL safety, San Diego Chargers * Aqib Talib, 2008 Orange Bowl MVP; first round NFL draft pick of the Tampa Bay Buccaneers * Broderick Thompson, former NFL offensive lineman * John E. Zook, defensive end, KU (1966–1968), NFL (1969–1979); KU All-Time team, All-American 1968, 2nd-Team All-Pro 1973, 2nd- Team All-NFC 1972 & 1973, 1973 Pro Bowl; missed only three games in ten years before final pro season ===Golf=== * Matt Gogel, professional golfer on the PGA Tour; winner of the 2002 AT&T; Pebble Beach National Pro-Am on the PGA Tour * Gary Woodland, professional golfer on the PGA Tour; winner of the 2011 Transitions Championship at Innisbrook, the 2013 Reno Tahoe Open, the 2018 Waste Management Phoenix Open on the PGA Tour, and the 2019 U.S. Open ===Track and field=== * Bill Alley, javelin, Olympian and US record holder * Glenn Cunningham, former world record holder in 1500m and the mile, silver medal in 1936 Olympics in 1500m * Bill Dotson, former distance runner; broke four minute mile on both indoor and outdoor tracks * Billy Mills, the only US Olympic 10,000m gold medal winner; former world record holder * Bill Nieder, shot put; won silver at the 1956 Summer Olympics and gold in 1960 Summer Olympics; set three shot put world records * Al Oerter, All-American, four consecutive gold medals in olympic discus throw; two-time world record holder * Jim Ryun, former U.S. congressman; three-time Olympic runner and silver medalist; held world records in the 880, 1,500m, and indoor and outdoor miles * Wes Santee, middle distance runner, Olympian ===Athletic directors=== * Kent Weiser, current athletic director at Emporia State University; former women's golf coach at Kansas ==Related pages== * List of people from Lawrence, Kansas == References == Category:University of Kansas",
 "title": "List of University of Kansas people"
}