{
 "id": "702452",
 "text": "Keiran Lee (born Adam Diksa on 15 January 1984) is a British pornographic actor, director, and producer who works mainly for pornographic production company Brazzers. His penis was insured for $1 million in 2012 by Brazzers. He performed in over 3,500 porn videos in his pornographic career. He is one of the highest paid pornographic actors. == Early life and education == Lee was born and raised in the Littleover area of Derby, England. He is of half-Indian descent, his father being Indian. Growing up, he attended Saint Benedict Catholic Voluntary Academy. By the age of 18, he was working as a project manager for Network Rail. == Filmography == Television Year Title Role Notes 2012 The Jerry Springer Show Himself 1 episode 2016 The Sex Factor Judge 10 episodes === Movies === As an actor : * Nasty Intentions (2009) * Filthy Habits (2010) * No Way Out (2014) * Kill Bill (2015) * In the Ass at Last (2016) As a director : * Hot Chicks Meet Big Fangs (2013) == Awards and nominations == Lee won many major award nominations in his pornographic career. He won 2 awards from 49 nominations. Some notable awards and nominations: List of accolades received by Keiran Lee {| class=\"collapsible collapsed\" style=\"width:100%;\" {| class=\"collapsible collapsed\" style=\"width:100%;\" {| class=\"collapsible collapsed\" style=\"width:100%;\" Awards and nominations Award Won Nominated ;AVN Awards ;XRCO Awards ;XBIZ Awards ;UK Adult Film and Television Awards Award Year Nominated work Category Result AVN Award 2009 Nasty Intention Best Sex Scene in a Foreign-Shot Film rowspan=\"10\" 2010 Keiran Lee Male Performer of the Year Filthy Habits Most Outrageous Sex Scene Keiran Lee Unsung Male Performer of the Year 2011 Male Performer of the Year 2012 2013 2014 2015 2017 In the Ass at Last Best Anal Sex Scene Keiran Lee Favorite Male Performer Male Performer of the Year rowspan=\"2\" 2019 UK Adult Film and Television Award 2007 Best Male Actor XBIZ Award 2014 Male Performer of the Year rowspan=\"5\" 2017 XRCO Award 2013 2015 Best Director (Web) 2017 == Related pages == * List of British pornographic actors ==References== == Other websites == * * * Category:1984 births Category:Living people Category:British movie actors Category:British movie directors Category:British movie producers Category:British sex industry people Category:Pornographic actors Category:Pornographic movie directors Category:Pornographic movie producers Category:AVN Award winners",
 "title": "Keiran Lee"
}