{
 "id": "702812",
 "text": "John Frederick Clute (born 12 September 1940) is a Canadian-born author and critic. He mainly writes about science fiction and fantasy literature, He has lived in England and the United States since 1969. He is a very important person in the history of science fiction.Davis, Matthew John Clute: Yakfests of the Empyrean , Strange Horizons, 18 September 2006. He was one of eight people who started the English magazine Interzone in 1982 (the others including Malcolm Edwards, Colin Greenland, Roz Kaveney, and David Pringle). Clute's articles on science fiction have appeared in many publications since the 1960s. He is a co-editor of The Encyclopedia of Science Fiction (with Peter Nicholls) and of The Encyclopedia of Fantasy (with John Grant), and The Illustrated Encyclopedia Of Science Fiction. All three won Hugo Awards for Best Non-Fiction. He earned the Pilgrim Award from the Science Fiction Research Association for Lifetime Achievement in the field of science fiction scholarship, in 1994. ==Personal life== Raised in Canada, Clute lived in the United States from 1956 until 1964. He earned a Bachelor of Arts degree at New York University in 1962 while living with writer and artist Pamela Zoline. Clute married artist Judith Clute in 1964. He has been the partner of Elizabeth Hand since 1996. ==Career== Clute's first professional publication was a long science-fiction poem called \"Carcajou Lament.\" It appeared in TriQuarterly in 1959. His first short story was \"A Man Must Die\" in New Worlds in 1966. In 1960, he was Associate Editor of Collage, a magazine in Chicago which had only two issues. It published early work by Harlan Ellison and R. A. Lafferty. In 1977, Clute published his first novel, The Disinheriting Party. Clute's second novel, Appleseed (2001). ==Written works== ===Criticism=== *Strokes [1966-1986] (Serconia Press, 1988), *Look at the Evidence: Essays and Reviews [1987-1993] (Serconia Press, 1996) [title page misdated], (hardcover), (paper) *Scores [1993-2003] (Beccon Publications, 2003), *The Darkening Garden: A Short Lexicon of Horror (Payseur & Schmidt, 2006), *Canary Fever (Beccon Publications, 2009), *Pardon This Intrusion: Fantastika in the World Storm (Beccon Publications, 2011), *Stay (Beccon Publications, 2014), ===Fiction=== *The Disinheriting Party (Allison and Busby, 1977), *Appleseed (Orbit, 2001), ==References== ==Other websites== * The Encyclopedia of Science Fiction, third edition * * Category:1940 births Category:Living people Category:British science fiction writers Category:Canadian science fiction writers Category:British critics Category:Canadian critics",
 "title": "John Clute"
}