{
 "id": "702934",
 "text": "Jeet Gannguli (born Chandrajeet Ganguly, Bengali: চন্দ্রজিৎ গাঙ্গুলী on 24 May 1977), popularly known as Jeet, is a score composer of Bengali and Hindi movies. Ganguly is a music director in Bollywood, scoring music for films.Mid- year review: Roy, Hamari Adhuri Kahani, Badlapur -Top 5 hit music albums of the year. India.com. Retrieved on 15 March 2017. ==Early life and education== Ganguly was initiated into the world of music at the age of three. He was a student of Baranagore Ramakrishna Mission Ashrama High School from where he completed his schooling. Later he graduated from the University of Calcutta. He is trained in Indian classical music under the guidance of his father Kali Ganguly and his pisima (father's sister) Shibani Roychowdhury. He studied western classical music, jazz and rock with jazz guitarist Carlton Kitto. ==Personal life== Ganguly is married to Chandrani Ganguly. ==Discography== ==Awards and nominations== ===Bengali Cinema Awards=== Year Film Award Category Result 2006 Yuddho Filmfare Awards East Best Music Director rowspan=\"11\" Shubhodrishti Anandalok Awards 2007 MLA Fatakeshto Tele Cine Awards 2008 Minister Fatakeshto Tele Cine Awards 2009 Chirodini Tumi Je Amar Anandalok Award 2010 Challenge Anandalok Award Poran Jaye Jolia Re Star Jalsa Entertainment Award 2013 Bapi Bari Jaa Tele Cine Awards 2014 Boss: Born to Rule Kalakar Award Boss: Born to Rule Mirchi Music Awards Bangla Rangbaaz Zee Bangla Gaurav Samman Award ===Hindi Cinema Awards=== Year Film/Song Award Category Result 2009 Morning Walk Mirchi Music Awards Upcoming Music Composer of The Year rowspan=\"14\" 2013 \"Tum Hi Ho\" from Aashiqui 2 BIG Star Entertainment Awards Most Entertaining Song 2014 Bollywood Hungama Surfers' Choice Music Awards Best Song Global Indian Music Academy Awards Zee Cine Awards Aashiqui 2 Filmfare Awards Best Music Director Zee Cine Awards IIFA Awards Bollywood Hungama Surfers' Choice Music Awards Best Soundtrack Global Indian Music Academy Awards Best Film Album IBNLive Movie Awards Best Music Director 2014 Mirchi Music Awards Album of The Year 2015 CityLights \"Muskurane\" from CityLights Music Composer of The Year 2015 Bollywood Hungama Surfers' Choice Music Awards Best Song rowspan=\"2\" \"Suno Na Sangemarmar\" from Youngistaan Bollywood Hungama Surfers' Choice Music Awards ==References== ==Other websites== * * Jeet Ganguly on Facebook * Jeet Ganguly on Twitter * Jeet Ganguly first time working with Pandit Ajoy Chakroborty in a Bengali film Bhorer Allo produced by Green Pigeon Movies Category:Living people Category:1977 births Category:Movie score composers Category:People from Baranagar Category:Baranagore Ramakrishna Mission Ashrama High School alumni Category:Bengali musicians",
 "title": "Jeet Gannguli"
}