{
 "id": "703050",
 "text": "Salman Khan awards and nominations Khan at People's Choice Awards in 2012 {| class=\"collapsible collapsed\" width=100% {| class=\"collapsible collapsed\" width=100% {| class=\"collapsible collapsed\" width=100% Awards & Nominations Awards & Nominations Awards & Nominations Award Won Nominated ;National Film Awards ;Filmfare Awards ;Screen Awards ;IIFA Awards ;Zee Cine Awards ;Producers Guild Film Awards ;Stardust Awards ;BIG Star Entertainment Awards ;Other Awards ;International recognitions Salman Khan is an Indian film actor and producer. In 1999, Khan won the Filmfare Award for Best Supporting Actor for his extended guest appearance in Kuch Kuch Hota Hai (1998). In 2011, he won the Screen Award for Best Actor for his performance in Dabangg and in 2012, he won the Best Actor Popular Choice for his performances in Ek Tha Tiger and Dabangg 2. Eight of the films he has acted in, have accumulated gross earnings of over worldwide. He played leading roles in five consecutive blockbusters including Dabangg, Ready, Bodyguard, Ek Tha Tiger, and Dabangg 2. He has starred in more than 80 Hindi films and thus far has established himself as a leading actor of Hindi cinema. ==National Film Awards== Year Category Film Result 2012 Best Children's Film Chillar Party 2016 Best Popular Film Providing Wholesome Entertainment Bajrangi Bhaijaan ==Filmfare Awards== Year Category Film Result 1990 Best Male Debut Maine Pyar Kiya 1990 Best Actor rowspan=4 1996 Best Actor Karan Arjun 1997 Best Supporting Actor Jeet 1999 Best Actor Pyaar Kiya To Darna Kya Best Supporting Actor Kuch Kuch Hota Hai 2000 Best Performance in a Comic Role Biwi No.1 rowspan=11 Best Actor Hum Dil De Chuke Sanam 2004 Best Actor Tere Naam Best Supporting Actor Baghban 2006 Best Performance in a Comic Role No Entry 2011 Best Actor Dabangg 2012 Best Actor Bodyguard 2013 Best Actor Dabangg 2 2016 Best Film Bajrangi Bhaijaan Best Actor 2017 Best Actor Sultan ==Star Screen Award== Year Category Film Result 1996 Best Actor Karan Arjun rowspan=8 1999 Pyaar Kiya To Darna Kya 2000 Hum Dil De Chuke Sanam 2004 Tere Naam 2005 Garv 2009 Best Jodi No 1 with Katrina Kaif Yuvvraaj 2010 Best Actor (Popular Choice) Wanted Jodi of the Decade (along with Aishwarya Rai) 2011 Best Actor Dabangg Best Actor (Popular Choice) Dabangg rowspan=3 2012 Bodyguard & Ready 2013 Best Actor Dabangg 2 Best Actor (Popular Choice) Ek Tha Tiger & Dabangg 2 2015 Kick rowspan=\"4\" 2016 Bajrangi Bhaijaan Best Actor Best Jodi with Kareena Kapoor Best Film ==IIFA Awards== Year Category Film Result 2000 Best Actor Hum Dil De Chuke Sanam rowspan=\"4\" 2004 Tere Naam 2005 Mujhse Shaadi Karogi 2008 Partner 2010 Habitat Humanity Ambassadorship 2010 Best Actor Wanted rowspan=\"4\" 2011 Dabangg 2012 Bodyguard Star Plus Hottest Pair Award along with Kareena Kapoor Bodyguard 2016 IIFA Award for Best Film Bajrangi Bhaijaan Best Actor 2017 Best Actor Sultan ==Zee Cine Awards== Year Category Film Result 1999 Best Actor Jab Pyaar Kisise Hota Hai rowspan=\"9\" Pyaar Kiya To Darna Kya 2000 Biwi No.1 Hum Saath Saath Hain 2004 Tere Naam 2005 Mujhse Shaadi Karogi 2006 Best Supporting Actor No Entry 2011 Best Actor Dabangg 2012 Bodyguard 2013 Dabangg 2 rowspan=\"4\" 2016 Bajrangi Bhaijaan Best Film Bajrangi Bhaijaan 2017 Best Actor Sultan ==Apsara Film & Television Producers Guild Award== Year Category Film Result 2008 Apsara Award for Jodi Of the Year with Govinda Partner rowspan=\"2\" 2011 Apsara Award for Best Actor in a Leading Role Dabangg 2012 Bodyguard rowspan=\"2\" 2016 Sony Guild Award for Best Actor in a Leading Role Bajrangi Bhaijaan Sony Guild Award for Best Film ==Stardust Awards== Year Category Film Result 2004 Star of the Year - Male Tere Naam rowspan=\"6\" 2005 Mujhse Shaadi Karogi 2006 Maine Pyaar Kyun Kiya & Kyon Ki 2007 Jaan-E-Mann 2009 Yuvvraj 2010 Wanted 2011 Dabangg Best Thriller/Action Actor 2012 Star of the Year - Male Bodyguard & Ready Best Drama Actor Bodyguard rowspan=\"7\" Best Comedy/Romance Actor Ready Best Film Chillar Party 2013 Best Thriller/Action Actor Dabangg 2 & Ek Tha Tiger Star of the Year - Male Dabangg 2 & Ek Tha Tiger 2014 Kick 2015 Bajrangi Bhaijaan & Prem Ratan Dhan Payo Best Film of the Year Bajrangi Bhaijaan ==BIG Star Entertainment Awards== Year Category Film Result 2010 Film Actor of Decade (Male) Most Entertaining Film Actor - Male Dabangg rowspan=\"3\" 2011 Most Entertaining Actor in an Action Role Bodyguard Most Entertaining On- Screen Couple with Kareena Kapoor Most Entertaining Actor in a Romantic Role rowspan=\"7\" Most Entertaining Film Actor - Male Most Entertaining Actor in a Comic Role Ready 2012 Most Entertaining Television Reality Show Host Bigg Boss (Season 6) Most Entertaining Film Actor - Male Ek Tha Tiger Most Entertaining Actor in a Romantic Role Most Entertaining Actor in an Action Role Most Entertaining Actor in a Thriller Role 2013 Most Entertaining Actor in an Action Role Dabangg 2 rowspan=\"4\" 2014 Jai Ho & Kick 2015 Most Entertaining Actor in a Romantic Role Prem Ratan Dhan Payo Most Entertaining Actor in a Drama Role Most Entertaining Film Actor - Male Bajrangi Bhaijaan & Prem Ratan Dhan Payo rowspan=\"4\" Most Entertaining Actor in a Social Role Bajrangi Bhaijaan Most Entertaining Social Most Entertaining Film == Other awards == Year Category Film Result 1999 Bollywood Movie Award - Best Actor Pyaar Kiya To Darna Kya 2002 Bollywood Movie Award - Most Sensational Actor Chori Chori Chupke Chupke 2004 Bollywood Movie Award - Best Actor Tere Naam 2008 Rajiv Gandhi Award for Outstanding Achievement in Entertainment rowspan=\"32\" ITA Best Anchor Dus Ka Dum 2009 ITA Best Anchor ITAA Best Anchor - Game/Quiz Show 2010 Aaj Tak Movie Masala Awards Wanted AXN Action Awards 2011 Dabangg Aaj Tak Awards - Best Actor Bhaskar Bollywood Awards - Action Hero Of The Year Male Bhaskar Bollywood Awards - Most Extraordinary Performance of the Year Airtel Super Star Awards Unique Andaz Colors Golden Petal Awards for Most Chahita Personality 2012 ETC Bollywood Business Award - Most Profitable Actor Bodyguard Bhaskar Bollywood Awards - Most Seductive Body- Male People's Choice Awards India Favorite Movie Actor Ek Tha Tiger People's Choice Awards India Favorite Movie Action Actor Masala Award Box Office Star Of The Year Male Airtel Super Star Awards Romantic Jodi Kareena kapoor Airtel Super Star Awards Super Star Hero ETC Bollywood Business Award - Most Profitable Actor 2013 IAA Leadership Awards for Brand Endorser of the Year (Male) Lions Favorite Philanthropic NGO in India for Being Human 2014 Times Celebex Awards - Star of the Year Times Celebex Awards - Most Searched Online Times Celebex Awards - Most Popular in Print media Times Celebex Awards - Box Office King Star Box Office Award - Mr Money Bags 2016 ETC Bollywood Business Award - Highest Grossing Male Actor Bajrangi Bhaijaan ETC Bollywood Business Award - Highest Grossing Film ETC Bollywood Business Award - The 300 crore club DMA Awards 2016 - Marketing Innovation Award (Social) Times Of India Film Award For Best Film Times Of India Film Award For Best Actor ==International recognitions== * 2004 - 7th Best looking man in world - People Magazine, USA * 2008 - Wax Statue in London's Madaeme Tusssads Museum. * 2010 - Sexiest Man Alive - People Magazine, India. * 2012 - Wax Statue in New York's Madame Tussaud's Museum * In August 2012, he was voted no.3 \"India's Greatest Actor\" in NDTV poll. * In August 2013 India's Most Searched Celebrity Online. * In 2014 he topped the Forbes India chart in terms of both fame and revenue. * Salman Khan ranked 71 in the 'Celebrity 100 : The World's top paid entertainers' by the Forbes Magazine, USA. He was the only Indian in the list with earnings worth $33.5 million. * He was ranked 7th in the first global list of the World's Highest Paid Actors in 2015 by the Forbes. * In 2016 he was ranked as No. 7 on the World's Most Handsome Faces list on worldstopmost.com * In a poll conducted by Ormax Media, Salman Khan was named as the 'Most Popular Bollywood Star', a distinction he has achieved for 5 consecutive years starting from 2010 to 2015. ==References== ==Other websites== * Category:Lists of awards and nominations Category:Salman Khan",
 "title": "List of Salman Khan's awards and nominations"
}