{
 "id": "703221",
 "text": "Antonio Alonso Martinez (born 29 April, 1963) is a Portuguese-Spanish painter and multidisciplinary artist based in Lisbon, Portugal. Martinez argues that humanity will find their own spiritual reality which has been the theme of his work since the mid-80s. ==Early life== Martinez was born in Oeiras, Portugal, in 1963, to Spanish parents. He chose Spanish nationality in 1978. In Lisbon, he attended Centro de Arte e Comunicação Visual (Ar.Co) where he graduated in Fine arts in 1985. During his years at the Ar.Co, Martinez co-authored the Manifest of the Multi-instrumentalist Painting which was published in the Portuguese national newspaper, Jornal de Letras, Artes e Ideias on 26 June 1984. This manifest was accompanied by an exhibition at the University of Fine Arts of Lisbon, creating enthusiasm among the new artists and critics. ==Career== Martinez started his professional career as a painter in his early 20s. His paintings are inspired by his belief that humanity will find their spiritual reality on their own. Martinez's painting were exhibited at Galician Cultural Centre in Lisbon, in 1988, in his first solo show. In 1989, his paintings were exhibited at the National Society of Fine Arts, Lisbon in a solo as well as in a group exhibition.”. Martinez was awarded with Paul VI Centre Art Prize by the Sanctuary of Fátima in 1990 where his works are the part of the permanent collections for public display. In 1990 and 1991, his works were exhibited in the solo exhibitions entitled Altarpieces at Galeria Monumental, Lisbon and Módulo Centro Difusor de Arte, Porto respectively. Between 1992 and 1998, Martinez's paintings were exhibited in various solo and group exhibitions around Europe including at Guimaraes, Lisbon, Rouen, Sintra, Haute-Vienne and Saint-Malo. In January 2011, one of his works - Portrait of Kurt Cobain (Retrato de Kurt Cobain) - reached the second highest value in the sale of contemporary art at the Austrian auction house, Dorotheum. In September 2012, another portrait of Kurt Cobain by Martinez was sold at Christie's in London. In January 2013, in Warsaw one of his works - Diana - reached the highest value on the auction at Forbes Millionaires Club. == References == ==Other websites== *Official Site Category:1963 births Category:Living people",
 "title": "Antonio Alonso Martinez"
}