{
 "id": "70339",
 "text": "Asexuality is a sexual orientation. Asexual people do not have sexual attraction towards anyone and nothing, no matter what sex they have or only a few sexual attraction only to a special person after forming a strong emotional (romantic or platonic bond) with them and so are demisexual on the asexual spectrum or they can also be its contrary: fraysexual so they lose their sexual attraction to people after forming a strong emotional bond with them or they can be graysexual and have a few sexual attraction to people without any condition. Asexuality has nothing to do with a person's romantic/aesthetic/sensual attraction. The opposite of an asexual is an allosexual. Allosexuality means that a person feels full sexual attraction towards real life adult human beings so are hetero, homo or bisexual. ==Meaning== Asexuality is described as a spectrum. Demisexual people are on the asexual spectrum. They feel sexual attraction, but only to people who they feel a connection to. About 1% of people identify as asexual. Alfred Kinsey used the label \"X\" to describe asexual people.Kinsey, Alfred C. (1948). Sexual Behavior in the Human Male. W.B. Saunders. ISBN 0-253-33412-8. Grey-asexual people are people who feel like they are not asexual, but they're not sexual either. For example, a grey-asexual person doesn't feel sexual attraction often. Some asexuals also identify with a romantic identity as well, meaning they may feel the need to form relationships, while others may not. Some asexual people identify as queer. However, some people think that 'queer' is not an appropriate word for asexual people. Not having sex (celibacy), is not always asexuality. Some homosexuals, for example, don't want to have sex because they feel guilty about their sexual attraction.https://www.washingtonpost.com/local/gay-christians-choosing- celibacy-emerge-from-the- shadows/2014/12/13/51c73aea-6ab2-11e4-9fb4-a622dae742a2_story.htmlMargaret Jordan Halter, Elizabeth M. Varcarolis (2013). Varcarolis' Foundations of Psychiatric Mental Health Nursing. Elsevier Health Sciences. p. 382. ISBN 1-4557-5358-0. Retrieved May 7, 2014. ==Studies== In 2001, David Jay started the Asexual Visibility and Education Network. A 2012 study found that asexuals are just as discriminated against as gay men, lesbians, or bisexuals. Asexuality has only recently been studied. One writer, S.E. Smith speculates that it has not increased, its just people have only just started noticing it. Acceptance of asexuality as a subject of scientific has only begun recently. == Libido == Libido, or sex drive, is the sexual arousal that humans feel. Some asexual people have a libido, this does not mean they are allosexual. They feel it as the body just doing it's thing, and often masturbate to relieve it. == Romantic orientation == Some asexual people are aromantic. This means that they do not feel romantic attraction such as getting a crush on someone. Others can be homoromantic, heteroromantic, biromantic, etc. == References == Category:Human sexuality Category:LGBT identities",
 "title": "Asexuality"
}