{
 "id": "70356",
 "text": "Macedonian language () is a Eastern South Slavic language spoken mainly in North Macedonia and other parts of the Balkans, including South-West Bulgaria, Eastern Albania and Gora region in Kosovo. The Macedonian language has many similarities with Bulgarian and Serbian. Most Bulgarian historians do not recognize the language and label Macedonian as a dialect of Bulgarian, as do some linguists. Some estimate that there are around 3 million speakers in the world. == Distrubution == Today in Albania, the Macedonian language is spoken mostly in Mala Prespa, Golo Brdo and almost all border areas with the Republic of North Macedonia. In Bulgaria, the Macedonian language is spoken in Blagoevgrad Province and in Serbia it is spoken in the border region with North Macedonia and in the Gora area of Kosovo.Конески, Блаже (1967). Историја на македонскиот јазик. Скопје: Култура. In Greece, the Macedonian language is still spoken by some Slavic speakers but the number of remaining speakers is not clear. == History == In terms of Macedonian historians the history of the language is divided as the following periods: * First appearance and documentation: IX — XI c. * Macedonian dialects influence on Old Slavonic: XII and XIII c. * Church Slavonic written language from the Macedonian dialcets and from a mixed type: XIV and XVIII c. * beginning of the Macedonian literary language (the appearance of the National Revival during Ottoman rule): XVI century. * discussion about the appearance and basis of the modern written language for Macedonians: second half of the XIX century. * first attempt of standardization of the modern Macedonian language from the book \"On Macedonian Matters\" by Krste Misirkov from 1903. * Final standardization of the language from 1944 and 1945. === Attempts of codifying a Macedonian language === The idea of standardization of the Macedonian language has its roots in the 19th century, but the first serious attempt at a scientific approach was the publication of the book \"On Macedonian Matters\" by Krste Petkov Misirkov in 1903, on the basis of which in 1945 and the standardization of the modern Macedonian language was carried out. This book was criticized by the Bulgarian public, because around the time the Bulgarian propaganda was trying to push the theory that the Macedonian language and people were Bulgarians, so it was immediately seized and destroyed. Only a few copies remained, one of which was found by K. Nedelkovski in the Sofia library.Груевска-Маџоска, Симона (2020). „За стандардизацијата на македонскиот јазик во XX век од социолингвистички аспект“. Македонскиот јазик - континуитет во простор и време. Скопје: Македонска академија на науките и уметностите. стр. 241–242. Based on the ideas about the uniqueness of the Macedonian language and the need for its codification published by Gjorgija Pulevski, and the ones published by Krste Petkov Misirkov, when codifying the language they did the following: * Make the main grammar and spelling be based of the dialect the central region (Veles‒Prilep‒Bitola‒Ohrid); * Make the language a phonetic language (spelt exactly as it's pronounced with no silent letters or different sounding letters) * lexical fund of all Macedonian languages. === Codification === The codification of the Macedonian language is related to the following historical events: * with the decision of the first session of ASNOM (August 2, 1944) for the introduction of Macedonian as an official language in the Macedonian state * with the official adoption of the Macedonian alphabet * with the official adoption of Macedonian spelling Macedonian statehood is strengthened with the historic decisions of the First Session of ASNOM. Among those decisions of particular importance is the Decision to introduce the Macedonian literary language as an official language in the Macedonian state. Also, the Presidium of ASNOM, as the highest body of the Macedonian state, in November 1944 appointed a commission composed of Macedonian philologists and social actors who were to submit a proposal for the alphabet and spelling of the Macedonian language. The issue of the alphabet and spelling was resolved in May 1945. Along with this issue, the members of the commission considered several issues of particular importance for the formation of the Macedonian literary language. The codification of the Macedonian literary language reflects the Macedonian language practice. Blaže Koneski has made a significant contribution to the codification of the Macedonian literary language and to the standardization of the literary-linguistic norm. The Macedonian language has similarities with other Slavic languages, and mostly with the Serbian language. The Macedonian and Bulgarian languages are the only ones from the group of Slavic languages that lost their case forms in the course of development, and only the vocative (Македонијо; Мајко; професоре, etc.) remains, as well as in some words (немо, нему, скришум, etc.). == Phonology == Vowels of Macedonian Front Central Back Close и у Mid е о Open а Bilabial Labio- Dental Dental Alveolar Post- Alveolar Palatal Velar Nasal Plosive Affricate Fricative Approximant Trill Lateral == Alphabet == The Macedonian language uses a Cyrillic alphabet. The following table provides the upper and lower case forms of the Macedonian alphabet, along with the IPA value for each letter: CyrillicIPA А а/a/ Б б/b/ В в/v/ Г г/ɡ/ Д д/d/ Ѓ ѓ /ɟ/ Е е/ɛ/ Ж ж/ʒ/ З з/z/ Ѕ ѕ /dz/ И и/i/ CyrillicIPA Ј ј/j/ К к/k/ Л л/l/ Љ љ/lj/ М м/m/ Н н/n/ Њ њ/ɲ/ О о/ɔ/ П п/p/ Р р/r/ С с/s/ CyrillicIPA Т т/t/ Ќ ќ /c/ У у/u/ Ф ф/f/ Х х /x/ Ц ц/ts/ Ч ч/tʃ/ Џ џ/dʒ/ Ш ш/ʃ/ == References == == Other websites == * Ethnologue report for Macedonian * Digital Dictionary of the Macedonian Language * The Macedonian Language * Macedonian e-learning Courses * Websters Online, Macedonian — English Dictionary * BBC Education, Languages: Macedonian, Makedonski * University of North Carolina, Reading and Pronouncing Macedonian: An Interactive Tutorial * Victor Friedman, A grammar of Macedonian * Mladen Srbinovski, Nature of Standard Macedonian language Category:South Slavic languages Category:Languages of Albania Category:Languages of North Macedonia Category:Languages of Serbia",
 "title": "Macedonian language"
}