{
 "id": "703543",
 "text": "The following table indicates the party of elected officials in the U.S. state of Kansas: *Governor *Lieutenant Governor *Secretary of State *Attorney General *State Treasurer *Insurance Commissioner The table also indicates the historical party composition in the: *State Senate *State House of Representatives *State delegation to the U.S. Senate *State delegation to the U.S. House of Representatives For years in which a presidential election was held, the table indicates which party's nominees received the state's electoral votes. The parties are as follows: (D), (Farm. All./P), (R), and . Year Executive offices Executive offices Executive offices Executive offices Executive offices Executive offices Executive offices State Legislature State Legislature United States Congress United States Congress United States Congress Electoral College votes Year Governor Lieutenant Governor Secretary of State Attorney General Treasurer Insurance Comm. Auditor State Senate State House U.S. Senator (Class II) U.S. Senator (Class III) U.S. House Electoral College votes 1861 Charles L. Robinson (R)Impeached but acquitted of charges and was not removed from office. Joseph Pomeroy Root (R) John Winter Robinson (R)Elected in December 1859 in anticipation of statehood and sworn in after Kansas was admitted to the Union in February 1861. As a result of a bond scandal, was impeached on February 26, 1862, along with Governor Charles L. Robinson and state Auditor George S. Hillyer. Robinson was convicted by the state Senate on June 12, 1862 and removed from office, becoming the first state executive branch official to be impeached and removed from office in U.S. history. Benjamin Franklin Simpson (R) Hartwin Rush Dutton (R) post created 1871 George S. Hillyer (R) 22R, 3D 64R, 11D James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Martin F. Conway (R) 1861 Charles L. Robinson (R)Impeached but acquitted of charges and was not removed from office. Joseph Pomeroy Root (R) John Winter Robinson (R)Elected in December 1859 in anticipation of statehood and sworn in after Kansas was admitted to the Union in February 1861. As a result of a bond scandal, was impeached on February 26, 1862, along with Governor Charles L. Robinson and state Auditor George S. Hillyer. Robinson was convicted by the state Senate on June 12, 1862 and removed from office, becoming the first state executive branch official to be impeached and removed from office in U.S. history. Charles Chadwick (R) Hartwin Rush Dutton (R) post created 1871 George S. Hillyer (R) 22R, 3D 64R, 11D James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Martin F. Conway (R) 1862 Charles L. Robinson (R)Impeached but acquitted of charges and was not removed from office. Joseph Pomeroy Root (R) John Winter Robinson (R)Elected in December 1859 in anticipation of statehood and sworn in after Kansas was admitted to the Union in February 1861. As a result of a bond scandal, was impeached on February 26, 1862, along with Governor Charles L. Robinson and state Auditor George S. Hillyer. Robinson was convicted by the state Senate on June 12, 1862 and removed from office, becoming the first state executive branch official to be impeached and removed from office in U.S. history. Sanders R. Shepard (R)Succeeded to office on July 28, 1862. Hartwin Rush Dutton (R) post created 1871 David L. Lakin (I) 22R, 3D 64R, 11D James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Martin F. Conway (R) 1863 Thomas Carney (R) Thomas Andrew Osborn (R) Warren Wirt Henry Lawrence (R) Warren William Guthrie (R) William Spriggs (R) post created 1871 Asa Hairgrove (R) 20R, 2D, 2I, 1ID 57R, 8D, 7U, 1I, 1 Abol. 1? James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Abel Carter Wilder (R) 1864 Thomas Carney (R) Thomas Andrew Osborn (R) Warren Wirt Henry Lawrence (R) Warren William Guthrie (R) William Spriggs (R) post created 1871 Asa Hairgrove (R) 20R, 2D, 2I, 1ID 30R, 3D, 42? James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Abel Carter Wilder (R) Abraham Lincoln and Andrew Johnson (NU) 1865 Samuel J. Crawford (R)Resigned to take command of the 19th Kansas Infantry. James McGrew (R) Rinaldo Allen Barker (R) Jerome D. Brumbaugh (R) William Spriggs (R) post created 1871 John R. Swallow (R) 19R, 2I, 2 War. Dem., 1D, 1 Nat. 62R, 7D, 4 Abol., 1I, 1IR, 1 War. Dem., 2? James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Sidney Clarke (R) Abraham Lincoln and Andrew Johnson (NU) 1866 Samuel J. Crawford (R)Resigned to take command of the 19th Kansas Infantry. James McGrew (R) Rinaldo Allen Barker (R) Jerome D. Brumbaugh (R) William Spriggs (R) post created 1871 John R. Swallow (R) 19R, 2I, 2 War. Dem., 1D, 1 Nat. 61R, 10D, 1I, 1IR, 1 Admin. Dem., 1 Whig, 3? James H. Lane (R)Died in office. Samuel C. Pomeroy (R) Sidney Clarke (R) Abraham Lincoln and Andrew Johnson (NU) 1867 Samuel J. Crawford (R)Resigned to take command of the 19th Kansas Infantry. Nehemiah Green (R) Rinaldo Allen Barker (R) George H. Hoyt (R) Martin Anderson (R) post created 1871 John R. Swallow (R) 20R, 5D 69R, 13D Edmund G. Ross (R) Samuel C. Pomeroy (R) Sidney Clarke (R) Abraham Lincoln and Andrew Johnson (NU) 1868 Samuel J. Crawford (R)Resigned to take command of the 19th Kansas Infantry. Nehemiah Green (R) Rinaldo Allen Barker (R) George H. Hoyt (R) Martin Anderson (R) post created 1871 John R. Swallow (R) 20R, 5D 62R, 26D Edmund G. Ross (R) Samuel C. Pomeroy (R) Sidney Clarke (R) Ulysses S. Grant and Schuyler Colfax (R) 1868 Nehemiah Green (R)As lieutenant governor, filled unexpired term. vacant Rinaldo Allen Barker (R) George H. Hoyt (R) Martin Anderson (R) post created 1871 John R. Swallow (R) 20R, 5D 62R, 26D Edmund G. Ross (R) Samuel C. Pomeroy (R) Sidney Clarke (R) Ulysses S. Grant and Schuyler Colfax (R) 1869 James M. Harvey (R) Charles Vernon Eskridge (R) Thomas Moonlight (R) Addison Danford (R) George Graham (R) post created 1871 Alois Thoman (R) 24R, 1D 84R, 6D Edmund G. Ross (R) Samuel C. Pomeroy (R) Sidney Clarke (R) Ulysses S. Grant and Schuyler Colfax (R) 1870 James M. Harvey (R) Charles Vernon Eskridge (R) Thomas Moonlight (R) Addison Danford (R) George Graham (R) post created 1871 Alois Thoman (R) 24R, 1D R Majority Edmund G. Ross (R) Samuel C. Pomeroy (R) Sidney Clarke (R) Ulysses S. Grant and Schuyler Colfax (R) 1871 James M. Harvey (R) Peter Percival Elder (R) William Hillary Smallwood (R) Archibald L. Williams (R) Josiah E Hayes (R) William C. Webb (R) Alois Thoman (R) 25R 82R, 16D Alexander Caldwell (R) Samuel C. Pomeroy (R) David Perley Lowe (R) Ulysses S. Grant and Schuyler Colfax (R) 1872 James M. Harvey (R) Peter Percival Elder (R) William Hillary Smallwood (R) Archibald L. Williams (R) Josiah E Hayes (R) William C. Webb (R) Alois Thoman (R) 25R R Majority Alexander Caldwell (R) Samuel C. Pomeroy (R) David Perley Lowe (R) Ulysses S. Grant and Henry Wilson (R) 1873 Thomas A. Osborn (R) Elias Sleeper Stover (R) William Hillary Smallwood (R) Archibald L. Williams (R) Josiah E Hayes (R) Edward Russell (R) Daniel W. Wilder (R) 27R, 5 Farm., 1D 51R, 34 Farm., 18I, 2D Robert Crozier (R) John James Ingalls (R) 3R Ulysses S. Grant and Henry Wilson (R) 1874 Thomas A. Osborn (R) Elias Sleeper Stover (R) William Hillary Smallwood (R) Archibald L. Williams (R) Samuel Lappin (R) Harrison Clarkson (R) Daniel W. Wilder (R) 27R, 5 Farm., 1D 57R, 18 Ref., 10I, 9 Farm., 4 Lib., 3D, 2IR, 1 Lib. Ind., 2?, 1 vac. James M. Harvey (R) John James Ingalls (R) 3R Ulysses S. Grant and Henry Wilson (R) 1875 Thomas A. Osborn (R) Melville J. Salter (R)Resigned July 10, 1877. Thomas Horne Cavanaugh (R) Asa Maxson Fitz Randolph (R) John Francis (R) Orrin T. Welch (R) Daniel W. Wilder (R) 21R, 9 Ref., 3D 75R, 20 Ref., 10D, 2? James M. Harvey (R) John James Ingalls (R) 2R, 1D Ulysses S. Grant and Henry Wilson (R) 1876 Thomas A. Osborn (R) Melville J. Salter (R)Resigned July 10, 1877. Thomas Horne Cavanaugh (R) Asa Maxson Fitz Randolph (R) John Francis (R) Orrin T. Welch (R) Daniel W. Wilder (R) 21R, 9 Ref., 3D 77R, 9D, 9I, 4IR, 3 Ref., 1 Ref. Rep., 1? James M. Harvey (R) John James Ingalls (R) 2R, 1D Rutherford B. Hayes and William A. Wheeler (R) 1877 George T. Anthony (R) Melville J. Salter (R)Resigned July 10, 1877. Thomas Horne Cavanaugh (R) Willard Davis (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 35R, 5D 107R, 18D Preston B. Plumb (R) John James Ingalls (R) 3R Rutherford B. Hayes and William A. Wheeler (R) 1877 George T. Anthony (R) Lyman U. Humphrey (R)Elected November 6, 1877, to fill vacancy. Thomas Horne Cavanaugh (R) Willard Davis (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 35R, 5D 107R, 18D Preston B. Plumb (R) John James Ingalls (R) 3R Rutherford B. Hayes and William A. Wheeler (R) 1878 George T. Anthony (R) Lyman U. Humphrey (R)Elected November 6, 1877, to fill vacancy. Thomas Horne Cavanaugh (R) Willard Davis (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 35R, 5D 107R, 18D Preston B. Plumb (R) John James Ingalls (R) 3R Rutherford B. Hayes and William A. Wheeler (R) 1879 John P. St. John (R) Lyman U. Humphrey (R)Elected November 6, 1877, to fill vacancy. James Smith (R) Willard Davis (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 35R, 5D 108R, 17D Preston B. Plumb (R) John James Ingalls (R) 3R Rutherford B. Hayes and William A. Wheeler (R) 1880 John P. St. John (R) Lyman U. Humphrey (R)Elected November 6, 1877, to fill vacancy. James Smith (R) Willard Davis (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 35R, 5D 108R, 17D Preston B. Plumb (R) John James Ingalls (R) 3R James A. Garfield and Chester A. Arthur (R) 1881 John P. St. John (R) David Wesley Finney (R) James Smith (R) William Agnew Johnston (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 37R, 2D, 1 Fus. 112R, 9D, 4 Fus. Preston B. Plumb (R) John James Ingalls (R) 3R James A. Garfield and Chester A. Arthur (R) 1882 John P. St. John (R) David Wesley Finney (R) James Smith (R) William Agnew Johnston (R) John Francis (R) Orrin T. Welch (R) Parkinson I. Bonebrake (R) 37R, 2D, 1 Fus. 112R, 9D, 4 Fus. Preston B. Plumb (R) John James Ingalls (R) 3R James A. Garfield and Chester A. Arthur (R) 1883 George W. Glick (D) David Wesley Finney (R) James Smith (R) William Agnew Johnston (R) Samuel T. Howe (R) Richard B. Morris (D) Edward P. McCabe (R) 37R, 2D, 1 Fus. 86R, 26D, 13G Preston B. Plumb (R) John James Ingalls (R) 7R James A. Garfield and Chester A. Arthur (R) 1884 George W. Glick (D) David Wesley Finney (R) James Smith (R) George Price Smith (D) Samuel T. Howe (R) Richard B. Morris (D) Edward P. McCabe (R) 37R, 2D, 1 Fus. 86R, 26D, 13G Preston B. Plumb (R) John James Ingalls (R) 7R James G. Blaine and John A. Logan (R) 1885 John A. Martin (R) Alexander Pancoast Riddle (R) Edwin Bird Allen (R) Simeon Briggs Bradford (R) Samuel T. Howe (R) Richard B. Morris (D) Edward P. McCabe (R) 37R, 3D 107R, 11D, 7I Preston B. Plumb (R) John James Ingalls (R) 7R James G. Blaine and John A. Logan (R) 1886 John A. Martin (R) Alexander Pancoast Riddle (R) Edwin Bird Allen (R) Simeon Briggs Bradford (R) Samuel T. Howe (R) Richard B. Morris (D) Edward P. McCabe (R) 37R, 3D 107R, 11D, 7I Preston B. Plumb (R) John James Ingalls (R) 7R James G. Blaine and John A. Logan (R) 1887 John A. Martin (R) Alexander Pancoast Riddle (R) Edwin Bird Allen (R) Simeon Briggs Bradford (R) James William Hamilton (R) Daniel W. Wilder (R) Timothy McCarthy (R) 37R, 3D 97R, 24D, 3I, 1 Lab. Preston B. Plumb (R) John James Ingalls (R) 7R James G. Blaine and John A. Logan (R) 1888 John A. Martin (R) Alexander Pancoast Riddle (R) Edwin Bird Allen (R) Simeon Briggs Bradford (R) James William Hamilton (R) Daniel W. Wilder (R) Timothy McCarthy (R) 37R, 3D 97R, 24D, 3I, 1 Lab. Preston B. Plumb (R) John James Ingalls (R) 7R Benjamin Harrison and Levi P. Morton (R) 1889 Lyman U. Humphrey (R) Andrew Jackson Felt (R) William Higgins (R) Lyman Beecher Kellogg (R) James William Hamilton (R) Daniel W. Wilder (R) Timothy McCarthy (R) 39R, 1D 121R, 2D, 2 Union Labor Preston B. Plumb (R) John James Ingalls (R) 7R Benjamin Harrison and Levi P. Morton (R) 1890 Lyman U. Humphrey (R) Andrew Jackson Felt (R) William Higgins (R) Lyman Beecher Kellogg (R) William Sims (R) Daniel W. Wilder (R) Timothy McCarthy (R) 39R, 1D 121R, 2D, 2 Union Labor Preston B. Plumb (R) John James Ingalls (R) 7R Benjamin Harrison and Levi P. Morton (R) 1891 Lyman U. Humphrey (R) Andrew Jackson Felt (R) William Higgins (R) John Nutt Ives (D) Solomon G. Stover (R) W. H. McBride (R) Charles M. Hovey (R) 39R, 1D 92 Farm. All., 26R, 7D Preston B. Plumb (R) William A. Peffer (P) 5P, 2R Benjamin Harrison and Levi P. Morton (R) 1892 Lyman U. Humphrey (R) Andrew Jackson Felt (R) William Higgins (R) John Nutt Ives (D) Solomon G. Stover (R) W. H. McBride (R) Charles M. Hovey (R) 39R, 1D 92 Farm. All., 26R, 7D Bishop W. Perkins (R) William A. Peffer (P) 5P, 2R James B. Weaver and James G. Field (P) 1893 Lorenzo D. Lewelling (P) Percy Daniels (P) Russell Scott Osborn (P) John Thomas Little (P) William H. Biddle (P) S. H. Snider (R) Van B. Prather (P) 23P, 15R, 2D 64R, 58P, 2D, 1I John Martin (D) William A. Peffer (P) 5P, 2R, 1D James B. Weaver and James G. Field (P) 1894 Lorenzo D. Lewelling (P) Percy Daniels (P) Russell Scott Osborn (P) John Thomas Little (P) William H. Biddle (P) S. H. Snider (R) Van B. Prather (P) 23P, 15R, 2D 64R, 58P, 2D, 1I John Martin (D) William A. Peffer (P) 5P, 2R, 1D James B. Weaver and James G. Field (P) 1895 Edmund N. Morrill (R) James Armstrong Troutman (R) William Corydon Edwards (R) Fernando Brenton Dawes (R) Otis L. Atherton (R) George T. Anthony (R) George Ezekiel Cole (R) 23P, 15R, 2D 91R, 33P, 1D Lucien Baker (R) William A. Peffer (P) 7R, 1P James B. Weaver and James G. Field (P) 1896 Edmund N. Morrill (R) James Armstrong Troutman (R) William Corydon Edwards (R) Fernando Brenton Dawes (R) Otis L. Atherton (R) Alexander P. Riddle (R) George Ezekiel Cole (R) 23P, 15R, 2D 91R, 33P, 1D Lucien Baker (R) William A. Peffer (P) 7R, 1P William Jennings Bryan and Arthur Sewall (D) 1897 John W. Leedy (P) Alexander Miller Harvey (P) William Eben Bush (P) Louis C. Boyle (P) David Heflebower (P) Webb McNall (P) William H. Morris (P) 27P, 11R, 2D 67P, 47R, 8D, 3SR Lucien Baker (R) William A. Harris (P) 6P, 2R William Jennings Bryan and Arthur Sewall (D) 1898 John W. Leedy (P) Alexander Miller Harvey (P) William Eben Bush (P) Louis C. Boyle (P) David Heflebower (P) Webb McNall (P) William H. Morris (P) 27P, 11R, 2D 67P, 47R, 8D, 3SR Lucien Baker (R) William A. Harris (P) 6P, 2R William Jennings Bryan and Arthur Sewall (D) 1899 William E. Stanley (R) Harry E. Richter (R) George Alfred Clark (R) Aretas Allen Godard (R) Frank Grimes (R) Willard V. Church (R) George Ezekiel Cole (R) 27P, 11R, 2D 92R, 33P Lucien Baker (R) William A. Harris (P) 7R, 1P William Jennings Bryan and Arthur Sewall (D) 1900 William E. Stanley (R) Harry E. Richter (R) George Alfred Clark (R) Aretas Allen Godard (R) Frank Grimes (R) Willard V. Church (R) George Ezekiel Cole (R) 27P, 11R, 2D 92R, 33P Lucien Baker (R) William A. Harris (P) 7R, 1P William McKinley and Theodore Roosevelt (R) 1901 William E. Stanley (R) Harry E. Richter (R) George Alfred Clark (R) Aretas Allen Godard (R) Frank Grimes (R) Willard V. Church (R) George Ezekiel Cole (R) 31R, 7P, 2D 81R, 30P, 12D, 2SR Joseph R. Burton (R) William A. Harris (P) 7R, 1D William McKinley and Theodore Roosevelt (R) 1902 William E. Stanley (R) Harry E. Richter (R) George Alfred Clark (R) Aretas Allen Godard (R) Frank Grimes (R) Willard V. Church (R) George Ezekiel Cole (R) 31R, 7P, 2D 81R, 30P, 12D, 2SR Joseph R. Burton (R) William A. Harris (P) 7R, 1D William McKinley and Theodore Roosevelt (R) 1903 Willis J. Bailey (R) David John Hanna (R) Joel Randall Burrow (R) Chiles Crittendon Coleman (R) Thomas Kelly (R) Charles H. Luling (R) Seth G. Wells (R) 31R, 7P, 2D 95R, 30D Joseph R. Burton (R) Chester I. Long (R) 8R William McKinley and Theodore Roosevelt (R) 1904 Willis J. Bailey (R) David John Hanna (R) Joel Randall Burrow (R) Chiles Crittendon Coleman (R) Thomas Kelly (R) Charles H. Luling (R) Seth G. Wells (R) 31R, 7P, 2D 95R, 30D Joseph R. Burton (R) Chester I. Long (R) 8R Theodore Roosevelt and Charles W. Fairbanks (R) 1905 Edward W. Hoch (R) David John Hanna (R) Joel Randall Burrow (R) Chiles Crittendon Coleman (R) Thomas Kelly (R) Charles H. Luling (R) Seth G. Wells (R) 37R, 3D 110R, 15D Joseph R. Burton (R) Chester I. Long (R) 8R Theodore Roosevelt and Charles W. Fairbanks (R) 1906 Edward W. Hoch (R) David John Hanna (R) Joel Randall Burrow (R) Chiles Crittendon Coleman (R) Thomas Kelly (R) Charles H. Luling (R) Seth G. Wells (R) 37R, 3D 110R, 15D Alfred W. Benson (R) Chester I. Long (R) 8R Theodore Roosevelt and Charles W. Fairbanks (R) 1907 Edward W. Hoch (R) William James Fitzgerald (R) Charles Eugene Denton (R) Fred Schuyler Jackson (R) Mark Tulley (R) Charles W. Barnes (R) James M. Nation (R) 37R, 3D 94R, 31D Charles Curtis (R) Chester I. Long (R) 8R Theodore Roosevelt and Charles W. Fairbanks (R) 1908 Edward W. Hoch (R) William James Fitzgerald (R) Charles Eugene Denton (R) Fred Schuyler Jackson (R) Mark Tulley (R) Charles W. Barnes (R) James M. Nation (R) 37R, 3D 94R, 31D Charles Curtis (R) Chester I. Long (R) 8R William Howard Taft and James S. Sherman (R) 1909 Walter R. Stubbs (R) William James Fitzgerald (R) Charles Eugene Denton (R) Fred Schuyler Jackson (R) Mark Tulley (R) Charles W. Barnes (R) James M. Nation (R) 34R, 6D 84R, 40D, 1I Charles Curtis (R) Joseph L. Bristow (R) 8R William Howard Taft and James S. Sherman (R) 1910 Walter R. Stubbs (R) William James Fitzgerald (R) Charles Eugene Denton (R) Fred Schuyler Jackson (R) Mark Tulley (R) Charles W. Barnes (R) James M. Nation (R) 34R, 6D 84R, 40D, 1I Charles Curtis (R) Joseph L. Bristow (R) 8R William Howard Taft and James S. Sherman (R) 1911 Walter R. Stubbs (R) Richard Joseph Hopkins (R) Charles Harrison Sessions (R) John Shaw Dawson (R) Mark Tulley (R) Isaac S. Lewis (R) William E. Davis (R) 34R, 6D 71R, 53D, 1I Charles Curtis (R) Joseph L. Bristow (R) 8R William Howard Taft and James S. Sherman (R) 1912 Walter R. Stubbs (R) Richard Joseph Hopkins (R) Charles Harrison Sessions (R) John Shaw Dawson (R) Mark Tulley (R) Isaac S. Lewis (R) William E. Davis (R) 34R, 6D 71R, 53D, 1I Charles Curtis (R) Joseph L. Bristow (R) 8R Woodrow Wilson and Thomas R. Marshall (D) 1913 George H. Hodges (D) Sheffield Ingalls (R) Charles Harrison Sessions (R) John Shaw Dawson (R) Earl Akers (R) Isaac S. Lewis (R) William E. Davis (R) 21D, 18R, 1 Soc. 72D, 51R, 2 Soc. William H. Thompson (D) Joseph L. Bristow (R) 5D, 3R Woodrow Wilson and Thomas R. Marshall (D) 1914 George H. Hodges (D) Sheffield Ingalls (R) Charles Harrison Sessions (R) John Shaw Dawson (R) Earl Akers (R) Isaac S. Lewis (R) William E. Davis (R) 21D, 18R, 1 Soc. 72D, 51R, 2 Soc. William H. Thompson (D) Joseph L. Bristow (R) 5D, 3R Woodrow Wilson and Thomas R. Marshall (D) 1915 Arthur Capper (R) William Yoast Morgan (R) John Thomas Botkin (R) Sardius Mason Brewster (R) Earl Akers (R) Carey J. Wilson (R) William E. Davis (R) 21D, 18R, 1 Soc. 66R, 49D, 9 Prog., 1 Soc. William H. Thompson (D) Charles Curtis (R) 6D, 2R Woodrow Wilson and Thomas R. Marshall (D) 1916 Arthur Capper (R) William Yoast Morgan (R) John Thomas Botkin (R) Sardius Mason Brewster (R) Earl Akers (R) Carey J. Wilson (R) William E. Davis (R) 21D, 18R, 1 Soc. 66R, 49D, 9 Prog., 1 Soc. William H. Thompson (D) Charles Curtis (R) 6D, 2R Woodrow Wilson and Thomas R. Marshall (D) 1917 Arthur Capper (R) William Yoast Morgan (R) John Thomas Botkin (R) Sardius Mason Brewster (R) Walter Payne (R) Carey J. Wilson (R) Fred W. Knapp (R) 31R, 9D 86R, 37D, 2 Soc. William H. Thompson (D) Charles Curtis (R) 5D, 3R Woodrow Wilson and Thomas R. Marshall (D) 1918 Arthur Capper (R) William Yoast Morgan (R) John Thomas Botkin (R) Sardius Mason Brewster (R) Walter Payne (R) Carey J. Wilson (R) Fred W. Knapp (R) 31R, 9D 86R, 37D, 2 Soc. William H. Thompson (D) Charles Curtis (R) 5D, 3R Woodrow Wilson and Thomas R. Marshall (D) 1919 Henry Justin Allen (R) Charles Solomon Huffman (R) Lewis Julian Pettijohn (R) Richard Joseph Hopkins (R) Walter Payne (R) Frank L. Travis (R) Fred W. Knapp (R) 31R, 9D 110R, 15D Arthur Capper (R) Charles Curtis (R) 7R, 1D Woodrow Wilson and Thomas R. Marshall (D) 1920 Henry Justin Allen (R) Charles Solomon Huffman (R) Lewis Julian Pettijohn (R) Richard Joseph Hopkins (R) Walter Payne (R) Frank L. Travis (R) Fred W. Knapp (R) 31R, 9D 110R, 15D Arthur Capper (R) Charles Curtis (R) 7R, 1D Warren G. Harding and Calvin Coolidge (R) 1921 Henry Justin Allen (R) Charles Solomon Huffman (R) Lewis Julian Pettijohn (R) Richard Joseph Hopkins (R) E.T. Thompson (R) Frank L. Travis (R) N. A. Turner (R) 38R, 2D 113R, 12D Arthur Capper (R) Charles Curtis (R) 8R Warren G. Harding and Calvin Coolidge (R) 1922 Henry Justin Allen (R) Charles Solomon Huffman (R) David Owen McCray (R) Richard Joseph Hopkins (R) E.T. Thompson (R) Frank L. Travis (R) N. A. Turner (R) 38R, 2D 113R, 12D Arthur Capper (R) Charles Curtis (R) 8R Warren G. Harding and Calvin Coolidge (R) 1923 Jonathan M. Davis (D) Ben Sanford Paulen (R) Frank Joseph Ryan (R) Charles Benjamin Griffith (R) E.T. Thompson (R) William R. Baker (R) N. A. Turner (R) 38R, 2D 95R, 30D Arthur Capper (R) Charles Curtis (R) 7R, 1D Warren G. Harding and Calvin Coolidge (R) 1924 Jonathan M. Davis (D) Ben Sanford Paulen (R) Frank Joseph Ryan (R) Charles Benjamin Griffith (R) E.T. Thompson (R) William R. Baker (R) N. A. Turner (R) 38R, 2D 95R, 30D Arthur Capper (R) Charles Curtis (R) 7R, 1D Calvin Coolidge and Charles G. Dawes (R) 1925 Benjamin S. Paulen (R) De Lanson Alson Newton Chase (R) Frank Joseph Ryan (R) Charles Benjamin Griffith (R) Carl White (R) William R. Baker (R) William E. Davis (R) 32R, 8D 92R, 33D Arthur Capper (R) Charles Curtis (R) 6R, 2D Calvin Coolidge and Charles G. Dawes (R) 1926 Benjamin S. Paulen (R) De Lanson Alson Newton Chase (R) Frank Joseph Ryan (R) Charles Benjamin Griffith (R) Carl White (R) William R. Baker (R) William E. Davis (R) 32R, 8D 92R, 33D Arthur Capper (R) Charles Curtis (R) 6R, 2D Calvin Coolidge and Charles G. Dawes (R) 1927 Benjamin S. Paulen (R) De Lanson Alson Newton Chase (R) Frank Joseph Ryan (R) William A. Smith (R) Carl White (R) William R. Baker (R) Will J. French (R) 32R, 8D 92R, 33D Arthur Capper (R) Charles Curtis (R) 7R, 1D Calvin Coolidge and Charles G. Dawes (R) 1928 Benjamin S. Paulen (R) De Lanson Alson Newton Chase (R) Frank Joseph Ryan (R) William A. Smith (R) Carl White (R) William R. Baker (R) Will J. French (R) 32R, 8D 92R, 33D Arthur Capper (R) Charles Curtis (R) 7R, 1D Herbert Hoover and Charles Curtis (R) 1929 Clyde M. Reed (R) Jacob W. Graybill (R) Edgbert Albert Cornell (R) William A. Smith (R) Tom Boyd (R) Charles F. Hobbs (R) Will J. French (R) 37R, 3D 101R, 24D Arthur Capper (R) Henry Justin Allen (R) 7R, 1D Herbert Hoover and Charles Curtis (R) 1930 Clyde M. Reed (R) Jacob W. Graybill (R) Edgbert Albert Cornell (R) Roland Boynton (R) Tom Boyd (R) Charles F. Hobbs (R) Will J. French (R) 37R, 3D 101R, 24D Arthur Capper (R) Henry Justin Allen (R) 7R, 1D Herbert Hoover and Charles Curtis (R) 1931 Harry H. Woodring (D) Jacob W. Graybill (R) Edgbert Albert Cornell (R) Roland Boynton (R) Tom Boyd (R) Charles F. Hobbs (R) Will J. French (R) 37R, 3D 77R, 48D Arthur Capper (R) George McGill (D) 7R, 1D Herbert Hoover and Charles Curtis (R) 1932 Harry H. Woodring (D) Jacob W. Graybill (R) Edgbert Albert Cornell (R) Roland Boynton (R) Tom Boyd (R) Charles F. Hobbs (R) Will J. French (R) 37R, 3D 77R, 48D Arthur Capper (R) George McGill (D) 7R, 1D Franklin D. Roosevelt and John Nance Garner (D) 1933 Alfred M. Landon (R) Charles W. Thompson (R) Frank Joseph Ryan (R) Roland Boynton (R) William Marion Jardine (R) Charles F. Hobbs (R) Will J. French (R) 23R, 17D 65R, 60D Arthur Capper (R) George McGill (D) 4R, 3D Franklin D. Roosevelt and John Nance Garner (D) 1934 Alfred M. Landon (R) Charles W. Thompson (R) Frank Joseph Ryan (R) Roland Boynton (R) J. J. Rhodes (R) Charles F. Hobbs (R) Will J. French (R) 23R, 17D 65R, 60D Arthur Capper (R) George McGill (D) 4R, 3D Franklin D. Roosevelt and John Nance Garner (D) 1935 Alfred M. Landon (R) Charles W. Thompson (R) Frank Joseph Ryan (R) Clarence Victor Beck (R) J. J. Rhodes (R) Charles F. Hobbs (R) Ed J. Powers (D) 23R, 17D 75R, 50D Arthur Capper (R) George McGill (D) 4R, 3D Franklin D. Roosevelt and John Nance Garner (D) 1936 Alfred M. Landon (R) Charles W. Thompson (R) Frank Joseph Ryan (R) Clarence Victor Beck (R) J. J. Rhodes (R) Charles F. Hobbs (R) George S. Robb (R) 23R, 17D 75R, 50D Arthur Capper (R) George McGill (D) 4R, 3D Franklin D. Roosevelt and John Nance Garner (D) 1937 Walter A. Huxman (D) William M. Lindsay (D) Frank Joseph Ryan (R) Clarence Victor Beck (R) J. J. Rhodes (R) Charles F. Hobbs (R) George S. Robb (R) 25R, 15D 74R, 51D Arthur Capper (R) George McGill (D) 5R, 2D Franklin D. Roosevelt and John Nance Garner (D) 1938 Walter A. Huxman (D) William M. Lindsay (D) Frank Joseph Ryan (R) Clarence Victor Beck (R) Jibo Hewitt (D) Charles F. Hobbs (R) George S. Robb (R) 25R, 15D 74R, 51D Arthur Capper (R) George McGill (D) 5R, 2D Franklin D. Roosevelt and John Nance Garner (D) 1939 Payne Ratner (R) Carl E. Friend (R) Frank Joseph Ryan (R) Jay S. Parker (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 25R, 15D 108R, 17D Arthur Capper (R) Clyde M. Reed (R) 6R, 1D Franklin D. Roosevelt and John Nance Garner (D) 1940 Payne Ratner (R) Carl E. Friend (R) Frank Joseph Ryan (R) Jay S. Parker (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 25R, 15D 108R, 17D Arthur Capper (R) Clyde M. Reed (R) 6R, 1D Wendell Willkie and Charles L. McNary (R) 1941 Payne Ratner (R) Carl E. Friend (R) Frank Joseph Ryan (R) Jay S. Parker (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 35R, 5D 98R, 27D Arthur Capper (R) Clyde M. Reed (R) 6R, 1D Wendell Willkie and Charles L. McNary (R) 1942 Payne Ratner (R) Carl E. Friend (R) Frank Joseph Ryan (R) Jay S. Parker (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 35R, 5D 98R, 27D Arthur Capper (R) Clyde M. Reed (R) 6R, 1D Wendell Willkie and Charles L. McNary (R) 1943 Andrew F. Schoeppel (R) Jess C. Denious (R) Frank Joseph Ryan (R) Alexander Baldwin Mitchell (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 35R, 5D 113R, 12D Arthur Capper (R) Clyde M. Reed (R) 6R Wendell Willkie and Charles L. McNary (R) 1944 Andrew F. Schoeppel (R) Jess C. Denious (R) Frank Joseph Ryan (R) Alexander Baldwin Mitchell (R) Walter Wilson (R) Charles F. Hobbs (R) George S. Robb (R) 35R, 5D 113R, 12D Arthur Capper (R) Clyde M. Reed (R) 6R Thomas E. Dewey and John W. Bricker (R) 1945 Andrew F. Schoeppel (R) Jess C. Denious (R) Frank Joseph Ryan (R) Alexander Baldwin Mitchell (R) Elmer T. Beck (R) Charles F. Hobbs (R) George S. Robb (R) 39R, 1D 120R, 5D Arthur Capper (R) Clyde M. Reed (R) 6R Thomas E. Dewey and John W. Bricker (R) 1946 Andrew F. Schoeppel (R) Jess C. Denious (R) Frank Joseph Ryan (R) Alexander Baldwin Mitchell (R) Elmer T. Beck (R) Charles F. Hobbs (R) George S. Robb (R) 39R, 1D 120R, 5D Arthur Capper (R) Clyde M. Reed (R) 6R Thomas E. Dewey and John W. Bricker (R) 1947 Frank Carlson (R)Resigned to take an elected seat in the United States Senate. Frank L. Hagaman (R) Frank Joseph Ryan (R) Edward F. Arn (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 39R, 1D 108R, 17D Arthur Capper (R) Clyde M. Reed (R) 6R Thomas E. Dewey and John W. Bricker (R) 1948 Frank Carlson (R)Resigned to take an elected seat in the United States Senate. Frank L. Hagaman (R) Frank Joseph Ryan (R) Edward F. Arn (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 39R, 1D 108R, 17D Arthur Capper (R) Clyde M. Reed (R) 6R Thomas E. Dewey and Earl Warren (R) 1949 Frank Carlson (R)Resigned to take an elected seat in the United States Senate. Frank L. Hagaman (R) Larry Ryan (D) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 34R, 6D 95R, 30D Andrew F. Schoeppel (R) Clyde M. Reed (R) 6R Thomas E. Dewey and Earl Warren (R) 1950 Frank Carlson (R)Resigned to take an elected seat in the United States Senate. Frank L. Hagaman (R) Larry Ryan (D) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 34R, 6D 95R, 30D Andrew F. Schoeppel (R) Harry Darby (R) 6R Thomas E. Dewey and Earl Warren (R) 1950 Frank L. Hagaman (R) vacant Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 34R, 6D 95R, 30D Andrew F. Schoeppel (R) Harry Darby (R) 6R Thomas E. Dewey and Earl Warren (R) 1951 Edward F. Arn (R) Fred Hall (R) Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 34R, 6D 105R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 6R Thomas E. Dewey and Earl Warren (R) 1952 Edward F. Arn (R) Fred Hall (R) Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 34R, 6D 105R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 6R Dwight D. Eisenhower and Richard Nixon (R) 1953 Edward F. Arn (R) Fred Hall (R) Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 35R, 5D 105R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Dwight D. Eisenhower and Richard Nixon (R) 1954 Edward F. Arn (R) Fred Hall (R) Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 35R, 5D 105R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Dwight D. Eisenhower and Richard Nixon (R) 1955 Fred Hall (R)|Resigned with 11 days left in his term. The first act of his successor was to appoint him to the Kansas Supreme Court. John McCuish (R) Paul R. Shanahan (R) Harold Ralph Fatzer (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 35R, 5D 89R, 36D Andrew F. Schoeppel (R) Frank Carlson (R) 6R Dwight D. Eisenhower and Richard Nixon (R) 1956 Fred Hall (R)|Resigned with 11 days left in his term. The first act of his successor was to appoint him to the Kansas Supreme Court. John McCuish (R) Paul R. Shanahan (R) John Anderson, Jr. (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 35R, 5D 89R, 36D Andrew F. Schoeppel (R) Frank Carlson (R) 6R Dwight D. Eisenhower and Richard Nixon (R) 1957 John McCuish (R) vacant Paul R. Shanahan (R) John Anderson, Jr. (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 32R, 8D 82R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Dwight D. Eisenhower and Richard Nixon (R) 1957 George Docking (D) Joseph W. Henkle, Sr. (D) Paul R. Shanahan (R) John Anderson, Jr. (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 32R, 8D 82R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Dwight D. Eisenhower and Richard Nixon (R) 1958 George Docking (D) Joseph W. Henkle, Sr. (D) Paul R. Shanahan (R) John Anderson, Jr. (R) Richard Fadely (R) Frank Sullivan (R) George S. Robb (R) 32R, 8D 82R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Dwight D. Eisenhower and Richard Nixon (R) 1959 George Docking (D) Joseph W. Henkle, Sr. (D) Paul R. Shanahan (R) John Anderson, Jr. (R) George Hart (D) Frank Sullivan (R) George S. Robb (R) 32R, 8D 69R, 56D Andrew F. Schoeppel (R) Frank Carlson (R) 3D, 3R Dwight D. Eisenhower and Richard Nixon (R) 1960 George Docking (D) Joseph W. Henkle, Sr. (D) Paul R. Shanahan (R) John Anderson, Jr. (R) George Hart (D) Frank Sullivan (R) George S. Robb (R) 32R, 8D 69R, 56D Andrew F. Schoeppel (R) Frank Carlson (R) 3D, 3R Richard Nixon and Henry Cabot Lodge Jr. (R) 1961 John Anderson, Jr. (R) Harold H. Chase (R) Paul R. Shanahan (R) William M. Ferguson (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 82R, 43D Andrew F. Schoeppel (R) Frank Carlson (R) 5R, 1D Richard Nixon and Henry Cabot Lodge Jr. (R) 1962 John Anderson, Jr. (R) Harold H. Chase (R) Paul R. Shanahan (R) William M. Ferguson (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 82R, 43D James B. Pearson (R) Frank Carlson (R) 5R, 1D Richard Nixon and Henry Cabot Lodge Jr. (R) 1963 John Anderson, Jr. (R) Harold H. Chase (R) Paul R. Shanahan (R) William M. Ferguson (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 89R, 36D James B. Pearson (R) Frank Carlson (R) 5R Richard Nixon and Henry Cabot Lodge Jr. (R) 1964 John Anderson, Jr. (R) Harold H. Chase (R) Paul R. Shanahan (R) William M. Ferguson (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 89R, 36D James B. Pearson (R) Frank Carlson (R) 5R Lyndon B. Johnson and Hubert Humphrey (D) 1965 William H. Avery (R) John Crutcher (R) Paul R. Shanahan (R) Robert C. Londerholm (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 27R, 13D 80R, 45D James B. Pearson (R) Frank Carlson (R) 5R Lyndon B. Johnson and Hubert Humphrey (D) 1966 William H. Avery (R) John Crutcher (R) Elwill M. Shanahan (R) Robert C. Londerholm (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 27R, 13D 80R, 45D James B. Pearson (R) Frank Carlson (R) 5R Lyndon B. Johnson and Hubert Humphrey (D) 1967 Robert Docking (D) John Crutcher (R) Elwill M. Shanahan (R) Robert C. Londerholm (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 27R, 13D 77R, 48D James B. Pearson (R) Frank Carlson (R) 5R Lyndon B. Johnson and Hubert Humphrey (D) 1968 Robert Docking (D) John Crutcher (R) Elwill M. Shanahan (R) Robert C. Londerholm (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 27R, 13D 77R, 48D James B. Pearson (R) Frank Carlson (R) 5R Richard Nixon and Spiro Agnew (R) 1969 Robert Docking (D) James H. DeCoursey, Jr. (D) Elwill M. Shanahan (R) Kent Frizzell (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 87R, 38D James B. Pearson (R) Bob Dole (R) 5R Richard Nixon and Spiro Agnew (R) 1970 Robert Docking (D) James H. DeCoursey, Jr. (D) Elwill M. Shanahan (R) Kent Frizzell (R) Walter Peery (R) Frank Sullivan (R) Clay E. Hedrick (R) 32R, 8D 87R, 38D James B. Pearson (R) Bob Dole (R) 5R Richard Nixon and Spiro Agnew (R) 1971 Robert Docking (D) Reynolds Shultz (R) Elwill M. Shanahan (R) Vern Miller (D) Walter Peery (R) Fletcher Bell (R) Clay E. Hedrick (R) 32R, 8D 84R, 41D James B. Pearson (R) Bob Dole (R) 4R, 1D Richard Nixon and Spiro Agnew (R) 1972 Robert Docking (D) Reynolds Shultz (R) Elwill M. Shanahan (R) Vern Miller (D) Walter Peery (R) Fletcher Bell (R) Clay E. Hedrick (R) 32R, 8D 84R, 41D James B. Pearson (R) Bob Dole (R) 4R, 1D Richard Nixon and Spiro Agnew (R) 1973 Robert Docking (D) Dave Owen (R) Elwill M. Shanahan (R) Vern Miller (D) Tom Van Sickle (R) Fletcher Bell (R) Clay E. Hedrick (R) 27R, 13D 80R, 45D James B. Pearson (R) Bob Dole (R) 4R, 1D Richard Nixon and Spiro Agnew (R) 1974 Robert Docking (D) Dave Owen (R) Elwill M. Shanahan (R) Vern Miller (D) Tom Van Sickle (R) Fletcher Bell (R) Clay E. Hedrick (R) 27R, 13D 80R, 45D James B. Pearson (R) Bob Dole (R) 4R, 1D Richard Nixon and Spiro Agnew (R) 1975 Robert Frederick Bennett (R) Shelby Smith (R) Elwill M. Shanahan (R) Curt T. Schneider (D) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 27R, 13D 72R, 53D James B. Pearson (R) Bob Dole (R) 4R, 1D Richard Nixon and Spiro Agnew (R) 1976 Robert Frederick Bennett (R) Shelby Smith (R) Elwill M. Shanahan (R) Curt T. Schneider (D) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 27R, 13D 72R, 53D James B. Pearson (R) Bob Dole (R) 4R, 1D Gerald Ford and Bob Dole (R) 1977 Robert Frederick Bennett (R) Shelby Smith (R) Elwill M. Shanahan (R) Curt T. Schneider (D) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 21R, 19D 65D, 60R James B. Pearson (R) Bob Dole (R) 3R, 2D Gerald Ford and Bob Dole (R) 1978 Robert Frederick Bennett (R) Shelby Smith (R) Jack Brier (R) Curt T. Schneider (D) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 21R, 19D 65D, 60R James B. Pearson (R) Bob Dole (R) 3R, 2D Gerald Ford and Bob Dole (R) 1979 John W. Carlin (D) Paul V. Dugan (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 21R, 19D 69R, 56D Nancy Kassebaum (R) Bob Dole (R) 4R, 1D Gerald Ford and Bob Dole (R) 1980 John W. Carlin (D) Paul V. Dugan (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 21R, 19D 69R, 56D Nancy Kassebaum (R) Bob Dole (R) 4R, 1D Ronald Reagan and George H. W. Bush (R) 1981 John W. Carlin (D) Paul V. Dugan (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 23R, 17D 72R, 53D Nancy Kassebaum (R) Bob Dole (R) 4R, 1D Ronald Reagan and George H. W. Bush (R) 1982 John W. Carlin (D) Paul V. Dugan (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 23R, 17D 72R, 53D Nancy Kassebaum (R) Bob Dole (R) 4R, 1D Ronald Reagan and George H. W. Bush (R) 1983 John W. Carlin (D) Thomas R. Docking (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 23R, 17D 72R, 53D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D Ronald Reagan and George H. W. Bush (R) 1984 John W. Carlin (D) Thomas R. Docking (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 23R, 17D 72R, 53D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D Ronald Reagan and George H. W. Bush (R) 1985 John W. Carlin (D) Thomas R. Docking (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 24R, 16D 76R, 49D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D Ronald Reagan and George H. W. Bush (R) 1986 John W. Carlin (D) Thomas R. Docking (D) Jack Brier (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 24R, 16D 76R, 49D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D Ronald Reagan and George H. W. Bush (R) 1987 Mike Hayden (R) Jack D. Walker (R) Bill Graves (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 24R, 16D 74R, 51D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D Ronald Reagan and George H. W. Bush (R) 1988 Mike Hayden (R) Jack D. Walker (R) Bill Graves (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 24R, 16D 74R, 51D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D George H. W. Bush and Dan Quayle (R) 1989 Mike Hayden (R) Jack D. Walker (R) Bill Graves (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 22R, 18D 67R, 58D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D George H. W. Bush and Dan Quayle (R) 1990 Mike Hayden (R) Jack D. Walker (R) Bill Graves (R) Robert Stephan (R) Joan Finney (D) Fletcher Bell (R) Office Abolished 1975 22R, 18D 67R, 58D Nancy Kassebaum (R) Bob Dole (R) 3R, 2D George H. W. Bush and Dan Quayle (R) 1991 Joan Finney (D) James Francisco (D) Bill Graves (R) Robert Stephan (R) Sally Thompson (D) Ronald L. Todd (R) Office Abolished 1975 22R, 18D 63D, 62R Nancy Kassebaum (R) Bob Dole (R) 3R, 2D George H. W. Bush and Dan Quayle (R) 1992 Joan Finney (D) James Francisco (D) Bill Graves (R) Robert Stephan (R) Sally Thompson (D) Ronald L. Todd (R) Office Abolished 1975 22R, 18D 63D, 62R Nancy Kassebaum (R) Bob Dole (R) 3R, 2D George H. W. Bush and Dan Quayle (R) 1993 Joan Finney (D) James Francisco (D) Bill Graves (R) Robert Stephan (R) Sally Thompson (D) Ronald L. Todd (R) Office Abolished 1975 26R, 14D 66R, 59D Nancy Kassebaum (R) Bob Dole (R) 2D, 2R George H. W. Bush and Dan Quayle (R) 1994 Joan Finney (D) James Francisco (D) Bill Graves (R) Robert Stephan (R) Sally Thompson (D) Ronald L. Todd (R) Office Abolished 1975 26R, 14D 66R, 59D Nancy Kassebaum (R) Bob Dole (R) 2D, 2R George H. W. Bush and Dan Quayle (R) 1995 Bill Graves (R) Sheila Frahm (R)Resigned as Lieutenant Governor on June 11, 1996 and was appointed by Governor Bill Graves to fill a vacancy in the United States Senate. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 26R, 14D 80R, 45D Nancy Kassebaum (R) Bob Dole (R) 4R George H. W. Bush and Dan Quayle (R) 1996 Bill Graves (R) Sheila Frahm (R)Resigned as Lieutenant Governor on June 11, 1996 and was appointed by Governor Bill Graves to fill a vacancy in the United States Senate. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 26R, 14D 80R, 45D Nancy Kassebaum (R) Bob Dole (R) 4R Bob Dole and Jack Kemp (R) 1996 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 26R, 14D 80R, 45D Nancy Kassebaum (R) Sheila Frahm (R) 4R Bob Dole and Jack Kemp (R) 1996 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 26R, 14D 80R, 45D Nancy Kassebaum (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 4R Bob Dole and Jack Kemp (R) 1997 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 27R, 13D 77R, 48D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 4R Bob Dole and Jack Kemp (R) 1998 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Sally Thompson (D) Kathleen Sebelius (D) Office Abolished 1975 27R, 13D 77R, 48D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 4R Bob Dole and Jack Kemp (R) 1999 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Tim Shallenburger (R) Kathleen Sebelius (D) Office Abolished 1975 27R, 13D 77R, 48D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D Bob Dole and Jack Kemp (R) 2000 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Tim Shallenburger (R) Kathleen Sebelius (D) Office Abolished 1975 27R, 13D 77R, 48D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2001 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Tim Shallenburger (R) Kathleen Sebelius (D) Office Abolished 1975 30R, 10D 79R, 46D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2002 Bill Graves (R) Gary Sherrer (R)The state's first appointed lieutenant governor, he was appointed on July 18, 1996 to fill a vacancy and was elected in his own right in November 1998. Ron Thornburgh (R)Resigned. Carla Stovall (R) Tim Shallenburger (R) Kathleen Sebelius (D) Office Abolished 1975 30R, 10D 79R, 46D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2003 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. John E. Moore (D) Ron Thornburgh (R)Resigned. Phill Kline (R) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 80R, 45D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2004 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. John E. Moore (D) Ron Thornburgh (R)Resigned. Phill Kline (R) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 80R, 45D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2005 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. John E. Moore (D) Ron Thornburgh (R)Resigned. Phill Kline (R) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 83R, 42D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2006 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. John E. Moore (D) Ron Thornburgh (R)Resigned. Phill Kline (R) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 83R, 42D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D George W. Bush and Dick Cheney (R) 2007 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. Mark Parkinson (D) Ron Thornburgh (R)Resigned. Paul J. Morrison (D) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 78R, 47D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 2R, 2D George W. Bush and Dick Cheney (R) 2008 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. Mark Parkinson (D) Ron Thornburgh (R)Resigned. Paul J. Morrison (D) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 78R, 47D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 2R, 2D John McCain and Sarah Palin (R) 2008 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. Mark Parkinson (D) Ron Thornburgh (R)Resigned. Stephen Six (D) Lynn Jenkins (R)Elected in November 2008 to U.S. House representing Kansas's 2nd congressional district. Sandy Praeger (R) Office Abolished 1975 30R, 10D 78R, 47D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 2R, 2D John McCain and Sarah Palin (R) 2009 Kathleen Sebelius (D)Resigned to take office as United States Secretary of Health and Human Services. Mark Parkinson (D) Ron Thornburgh (R)Resigned. Stephen Six (D) Dennis McKinney (D) Sandy Praeger (R) Office Abolished 1975 31R, 9D 77R, 48D Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D John McCain and Sarah Palin (R) 2009 Mark Parkinson (D) Troy Findley (D) Ron Thornburgh (R)Resigned. Stephen Six (D) Dennis McKinney (D) Sandy Praeger (R) Office Abolished 1975 31R, 9D 76R, 49D On January 12, 2009, incumbent Republican Dale Swenson switched parties to Democratic. Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D John McCain and Sarah Palin (R) 2010 Mark Parkinson (D) Troy Findley (D) Chris Biggs (D)Appointed by Governor to fill vacancy. Stephen Six (D) Dennis McKinney (D) Sandy Praeger (R) Office Abolished 1975 31R, 9D 76R, 49D On January 12, 2009, incumbent Republican Dale Swenson switched parties to Democratic. Pat Roberts (R) Sam Brownback (R)Defeated Sheila Frahm in the primary, and took the seat early on November 7, 1996 after the special general election. 3R, 1D John McCain and Sarah Palin (R) 2011 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Sandy Praeger (R) Office Abolished 1975 32R, 8D 92R, 33D Pat Roberts (R) Jerry Moran (R) 4R John McCain and Sarah Palin (R) 2012 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Sandy Praeger (R) Office Abolished 1975 32R, 8D 92R, 33D Pat Roberts (R) Jerry Moran (R) 4R Mitt Romney and Paul Ryan (R) 2013 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Sandy Praeger (R) Office Abolished 1975 32R, 8D 92R, 33D Pat Roberts (R) Jerry Moran (R) 4R Mitt Romney and Paul Ryan (R) 2014 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Sandy Praeger (R) Office Abolished 1975 32R, 8D 93R, 32DOn May 30, 2014, incumbent Democrat Jan Pauls switched parties to Republican. Pat Roberts (R) Jerry Moran (R) 4R Mitt Romney and Paul Ryan (R) 2015 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Ken Selzer (R) Office Abolished 1975 32R, 8D 98R, 27D Pat Roberts (R) Jerry Moran (R) 4R Mitt Romney and Paul Ryan (R) 2016 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Ron Estes (R) Ken Selzer (R) Office Abolished 1975 32R, 8D 98R, 27D Pat Roberts (R) Jerry Moran (R) 4R Donald Trump and Mike Pence (R) 2017 Sam Brownback (R)Resigned to take office as United States Ambassador-at-Large for International Religious Freedom. Jeff Colyer (R) Kris Kobach (R) Derek Schmidt (R) Jacob LaTurner (R) Ken Selzer (R) Office Abolished 1975 31R, 9D 85R, 40D Pat Roberts (R) Jerry Moran (R) 4R Donald Trump and Mike Pence (R) 2018 Jeff Colyer (R) Tracey Mann (R) Kris Kobach (R) Derek Schmidt (R) Jacob LaTurner (R) Ken Selzer (R) Office Abolished 1975 30R, 9D, 1I On March 7th 2018, Sen. John Doll changed party affiliation to Independent. 85R, 40D Pat Roberts (R) Jerry Moran (R) 4R Donald Trump and Mike Pence (R) 2019 Laura Kelly (D) Lynn Rogers (D) Scott Schwab (R) Derek Schmidt (R) Jacob LaTurner (R) Vicki Schmidt (R) Office Abolished 1975 28R, 11D, 1I On December 12th 2018, Sen. Barbara Bollier changed her party affiliation from Republican to Democratic.On December 18th 2018, Sen. Dinah Sykes changed her party affiliation from Republican to Democratic. 84R, 41D On December 18th, 2018, Rep. Stephanie Clayton changed her party affiliation from Republican to Democratic. Pat Roberts (R) Jerry Moran (R) 3R, 1D Donald Trump and Mike Pence (R) Year Governor Lieutenant Governor Secretary of State Attorney General Treasurer Insurance Comm. Auditor State Senate State House U.S. Senator (Class II) U.S. Senator (Class III) U.S. House Electoral College votes Year Executive offices Executive offices Executive offices Executive offices Executive offices Executive offices Executive offices State Legislature State Legislature United States Congress United States Congress United States Congress Electoral College votes ==Related pages== *Law and government in Kansas ==Notes== Category:Government of Kansas",
 "title": "Political party strength in Kansas"
}