{
 "id": "703686",
 "text": "Mary Elizabeth Barkworth (born 1941 Marlborough UK) is a Canadian who has worked most of her life as a botanist. She has spent most of her working life as a faculty member at Utah State University. During that time, she worked primarily on grasses, particularly members of the Stipeae and Triticeae, but she also had primary responsibility for production of the two grass [=Poaceae, Gramineae] volumes (volumes 24 & 25) in the Flora of North America series. These two volumes served as the basis for three other resources: The Manual of Grasses for North America, Grasses of the Intermountain Region, and the Manual of Grasses on the web. This last was taken down for security concerns. Most of its resources, some updated, are available through OpenHerbarium.org (descriptions and illustrations) and Keybase. Barkworth retired from Utah State University in 2012. Since retiring, she has focused on two areas, expanding digitization of herbarium collections using OpenHerbarium.org and developing access to biodiversity education in Somaliland through the Somaliland Biodiversity Foundation. Her name is usually abbreviated as «Barkworth» when citing a botanical name. ==Taxa by Barkworth== Aloe sanguinalis Awale & Barkworth Nassella duriuscula (Phil.)Barkworth Piptochaetium fuscum (Ness ex Steud.) Barkworth, Cialdella et Gandhi.Rodriguez RA et al. 2018 catálogo == Works == * 1975. Intraspecific variation in Brodiaea douglasii Watson, Liliaceae. xiii + 138 pp. * 1981. Foliar epidermes and taxonomy of North American Stipeae (Gramineae). Syst. Botany 6(2):136—152 * 1982. Bur buttercup: A weedy immigrant. Utah Sci.43:6—9 * 1982. Embryological characters and the taxonomy of the Stipeae (Gramineae). Taxon:31(2):233—243 *-- Maze, J. 1982. The identity of Stipa columbiana and S. viridula var. minor Vasey (Gramineae, Stipeae): A rebuttal. Taxon 31(2):290—299 *Dewey RD, & Adkins RJ 1983. New generic concepts in the Triticeae of the Intermountain Region: Key and comments. Great Basin Naturalist: Vol. 43 : No. 4 , Article 5. https://scholarsarchive.byu.edu/gbn/vol43/iss4/5. * 1984. Stipa lemmonii (Vasey) Scribner (Poaceae): A taxonomic and distributional study. Madroño 31(1):48—56 * & Dewey DR 1985. Genomically based genera in the perennial Triticeae of North America: Identification and membership. Amer.J.Bot. 767—776 Jstor * 1986. Piptochaetium Presl (Gramineae, Stipeae) in North and Mesoamerica: Taxonomic and distributional observations Brenesia 25-26, 169—178 * 1988. New taxa in Piptochaetium (Stipeae, Gramineae) from Mexico. Syst. Botany 13(2): 196—201 Jstor * --Burkhammer RI, Talbert,LE 1997. Elymus calderi: A new species in the Triticeae (Poaceae). Syst.Botany 21(3):349 *-- Kathleen M. Capels and Sandy Long 1993. Flora of North America: North of Mexico. Magnoliophyta: Commelinidae (in part Poaceae) *2011 Triticeae Gramineae in Australasia Telopea DOI: 10.7751/ 13(1-2): 37–57 *--; Cialdella, A.M.; Gandhi, K. 2014 Piptochaetium fuscum (Nees ex Steud.) Barkworth, Ciald., & Gandhi, a new combination replacing Piptochaetium setosum (Trin.) Arechav. Phytokeys 35:17-22 *2016 Knapp, S., Turland, N.J., Barkworth, M.E., Barrie, F.R., Fortunato, R.H., Gandhi, K. et al., ‘(286) Proposal to replace Division III of the International Code of Nomenclature for algae, fungi, and plants’, Taxon 65, 661–664. https://doi.org/10.12705/653.41 ==References== ==Other websites== * Information on Mary Barkworth at Utah State University Category:1941 births Category:Living people Category:Botanists",
 "title": "Mary E. Barkworth"
}