{
 "id": "704023",
 "text": "A naval ship is a military ship (or sometimes boat, depending on classification) used by a navy. ==Types of ships== *Aircraft carrierships that are mobile seaborne airfields. They were designed for the purpose of doing combat by Carrier-based aircraft. They do attacks against airborne, surface, sub-surface and shore targets. *Surface combatantbig, heavily armed surface ships. They are designed mostly to engage enemy forces on the high seas, including various types of battleship, battlecruiser, cruiser, destroyer, frigate, and corvette. *Submarineself-propelled sjips that go underwater. They can be combatant, auxiliary, or research and development vehicles which have at least a slight combat ability. *Patrol combatantcombatants whose mission may extend beyond coastal duties and whose characteristics include adequate endurance and sea keeping providing a capability for operations exceeding 48 hours on the high seas without support. *Amphibious warfareships having organic capability for amphibious assault and which have characteristics enabling long duration operations on the high seas. *Combat logisticsships that have the capability to provide underway replenishment to fleet units. *Mine warfareships whose primary function is mine warfare on the high seas. *Coastal defenseships whose primary function is coastal patrol and interdiction. *Sealiftships that have the capability to provide direct material support to other deployed units operating far from home base. *Supportships, such as oilers, designed to operate in the open ocean in a variety of sea states to provide general support to either combatant forces or shore based establishments. (Includes smaller auxiliaries which, by the nature of their duties, leave inshore waters). *Service type craftnavy-subordinated craft (including non-self-propelled) designed to provide general support to either combatant forces or shore-based establishments. ==Size== In weight (largest to smallest), modern naval ships are often put into different groups (called classes). The bigger ships in the list can also be classed as capital ships: * Aircraft carrier * Helicopter carrier * Battleship * Battlecruiser * Heavy cruiser * Light cruiser * Destroyer * Frigate * Corvette * Patrol boat * Fast attack craft ==References== ==Other websites== * * * Category:Navy",
 "title": "Naval ship"
}