{
 "id": "704142",
 "text": "{{Infobox settlement | name = Damascus Governorate | native_name = مُحافظة دمشق | native_name_lang = ar | settlement_type = Governorate | image_skyline = | image_alt = | image_caption = | image_map = Damascus in Syria (+Golan hatched).svg | map_alt = | map_caption = Map of Syria with Damascus highlighted | coordinates = | coor_pinpoint = Damascus | coordinates_footnotes = | subdivision_type = Country | subdivision_name = Syria | parts_type = Manatiq (Districts) | parts_style = para | p1 = | established_title = | established_date = | seat_type = Capital | seat = Damascus | leader_title = Governor | leader_name = Adel al-Olabi | unit_pref = Metric | area_footnotes = | area_total_km2 = | population_footnotes = | population_total = 1,711,000 | population_as_of = 2010 est. | population_density_km2 = auto | blank_name_sec1 = Main language(s) | blank_info_sec1 = Arabic | timezone1 = EET | utc_offset1 = +2 | timezone1_DST = EEST | utc_offset1_DST = +3 | iso_code = SY-DI | website = | footnotes = }} Damascus Governorate ( ) is one of the fourteen governorates (provinces) of Syria. Completely surrounded by the Rif Dimashq Governorate, it consists only of the city of Damascus, the capital of Syria, and the suburb of Yarmouk Camp. The governorate's area is around 107 km2, encompassing the area of the city of Damascus and the Yarmouk Camp, while the population is around 1,711,000. == Geography == Damascus occupies a strategic location on a plateau which rises 680 m (2,230 ft) above sea level and about 80 km (50 mi) inland from the Mediterranean, sheltered by the Anti-Lebanon mountains, supplied with water by the Barada River. The Anti-Lebanon mountains which mark the border between Syria and Lebanon, bock precipitation from the Mediterranean sea, so that the region of Damascus is sometimes subject to droughts. However, in ancient times this was mitigated by the Barada River, which originates from mountain streams fed by melting snow. Damascus is surrounded by the Ghouta, an irrigated farmland where many vegetables, cereals, and fruits have been farmed since ancient times. The governorate occupies an area of 107 km2, 79 km2 of which is urban (77 in Damascus, 2 in Yarmouk Camp) while the rest is occupied by Mount Qasioun which overlooks the city. == Climate == Damascus has a cold desert climate (BWk) in Köppen-Geiger system, due to the rain shadow effect of the Anti-Lebanon mountains and the prevailing ocean currents. Summers are dry and hot with less humidity. Winters are cool and somewhat rainy; snowfall is infrequent. Annual rainfall is around , occurring from October to May. == References == Category:Governorates of Syria",
 "title": "Damascus Governorate"
}