{
 "id": "704117",
 "text": "Pittsburg is a city in Crawford County, Kansas, United States. It is in Southeast Kansas near the Missouri state border. It is the biggest city in Crawford County and southeast Kansas. In 2020, 20,646 people lived there. ==Geography== Pittsburg is at . The United States Census Bureau says that the city has a total area of . Of that, is land and is water. Pittsburg is in the Ozark Highlands region. That region is a mix of prairie and forests. It is west of Springfield, Missouri, south of Kansas City, Missouri, and northeast of Tulsa, Oklahoma. ==People== ===2020 census=== The 2020 census says that there were 20,646 people, 8,268 households, and 4,123 families living in Pittsburg. Of the households, 42.3% owned their home and 57.7% rented their home. The median age was 27.7 years. Of the people, 77.3% were White, 3.7% were Black, 1.8% were Asian, 1.1% were Native American, 0.8% were Pacific Islanders, 5.4% were from some other race, and 10.0% were two or more races. Hispanic or Latino of any race were 10.5% of the people. ===2010 census=== The 2010 census says that there were 20,233 people, 8,142 households, and 4,087 families living in Pittsburg. ==Government== The Pittsburg government has a mayor and four commissioners. The commission meets the 2nd and 4th Tuesday of each month at 5:30 pm.Pittsburg - GovernmentPittsburg - Directory of Public Officials ==Media== The Pittsburg Morning Sun is the main newspaper in Pittsburg. It is published five days per week.(24 March 2017). Morning Sun to move to five day schedule, Morning Sun In addition, Pittsburg State University publishes a weekly student newspaper, the Collegio. ==References== ==Other websites== ;City * City of Pittsburg * Pittsburg - Directory of Public Officials * Pittsburg Area Chamber of Commerce ;Schools * USD 250, local school district ;Historical * * * ;Maps * Pittsburg City Map , KDOT Category:Cities in Crawford County, Kansas Category:1876 establishments in Kansas",
 "title": "Pittsburg, Kansas"
}