{
 "id": "704236",
 "text": "Chandrayaan-2, meaning Lunar Craft or Moon Craft, ( ) is India's second moon mission after Chandrayaan-1. Made by the Indian Space Research Organisation (ISRO), the mission was launched from the second launch pad at Satish Dhawan Space Centre on 22 July 2019 at 2:43 PM IST (09:13 UTC) to the Moon by a Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III).Chandrayaan-2 Launch Mission: Bahubali rocket set to take-off at 2:43 pm on Monday - SCIENCE News A proper landing on the lunar south pole would make India the 4th country to achieve a soft landing on the Moon, after the space agencies of the USA, USSR, and China. The mission landing was expected on 7 September 2019 at 01:55 AM IST (6 September 2019, 20:25 UTC) but crashed when it lost communication at a 2100 metre altitude. == History == On 12 November 2007, the Russian Federal Space Agency (Roscosmos) and ISRO agreed to work together on the Chandrayaan-2 project. ISRO would be in charge of the orbiter and rover, while Roscosmos was to build the lander. The design of the spacecraft was completed in August 2009, with scientists of both countries conducting a joint review. Although ISRO finalised the payload for Chandrayaan-2 on schedule, the mission was moved to 2016 because Russia was unable to build the lander on time. When Russia decided it would not be able to build a lander by 2015, India decided to develop the lunar mission on its own. The spacecraft's launch had been scheduled for March 2018, but was delayed. Two of the lander's legs got minor damage during one of the tests in February 2019, making the launch date even later. == Goals == The main goals of Chandrayaan-2 are to demonstrate the ability to soft-land on the lunar surface and operate a robotic rover on the surface. Studies of lunar topography,mineralogy, elemental abundance, the lunar exosphere, and signatures of hydroxyl and water ice are the scientific goals. The orbiter will survey the lunar surface and help to prepare 3D maps of it. The onboard radar will also survey the surface while studying the water ice in the lunar south pole and thickness of the Lunar soil on the surface. == References == Category:Spacecrafts launched in 2010s Category:Planetary rovers Category:Indian Space Research Organisation Category:September 2019 events",
 "title": "Chandrayaan-2"
}