{
 "id": "704309",
 "text": "The Eurovision Song Contest 2020 was a cancelled singing competition that was to be held in The Netherlands, after Duncan Laurence won the Eurovision Song Contest 2019 with the song ”Arcade”. ==Cancellation== On 18 March 2020, it was announced that the contest would be cancelled due to the 2019–20 coronavirus pandemic in Europe. It's the first in the history of the contest to be cancelled. After the show was cancelled, the European Broadcasting Union organised a replacement show called Eurovision: Europe Shine a Light, to show the selected entries in place of the Grand Final on 16 May. Rotterdam remained as the host city of the next year's contest. == Planned contestants == Country Broadcaster Artist Song Language RTSH Arilena Ara \"Fall from the Sky\" English AMPTV Athena Manoukian \"Chains on You\" English SBS Montaigne \"Don't Break Me\" English ORF Vincent Bueno \"Alive\" English İTV Efendi \"Cleopatra\" English BTRC VAL \"Da vidna\" () Belarusian VRT Hooverphonic \"Release Me\" English BNT Victoria \"Tears Getting Sober\" English HRT Damir Kedžo \"\" Croatian CyBC Sandro \"Running\" English ČT Benny Cristo \"Kemama\" English DR Ben and Tan \"Yes\" English ERR Uku Suviste \"What Love Is\" English Yle Aksel \"Looking Back\" English France Télévisions Tom Leeb \" (The Best in Me)\" French, English GPB Tornike Kipiani \"Take Me as I Am\" English NDR Ben Dolic \"Violent Thing\" English ERT Stefania \"Supergirl\" English RÚV Daði og Gagnamagnið \"Think About Things\" English RTÉ Lesley Roy \"Story of My Life\" English IPBC Eden Alene \"Feker Libi\" () English, Amharic RAI Diodato \"\" Italian LTV Samanta Tīna \"Still Breathing\" English LRT The Roop \"On Fire\" English PBS Destiny \"All of My Love\" English TRM Natalia Gordienko \"Prison\" English AVROTROS Jeangu Macrooy \"Grow\" English MRT Vasil \"You\" English NRK Ulrikke \"Attention\" English TVP Alicja \"Empires\" English RTP Elisa \"\" Portuguese TVR Roxen \"Alcohol You\" English C1R Little Big \"\" English, Spanish SMRTV Senhit \"Freaky!\" English RTS Hurricane \"Hasta la vista\" Serbian RTVSLO Ana Soklič \"\" Slovene RTVE Blas Cantó \"\" Spanish SVT The Mamas \"Move\" English SRG SSR Gjon's Tears \"\" French UA:PBC Go_A \"Solovey\" () Ukrainian BBC James Newman \"My Last Breath\" English Due to the rules of the Contest, the entries from the cancelled 2020 Contest were not allowed to participate in the Eurovision Song Contest 2021. However, many of the original artists returned with new songs while others were replaced. ==References== ==Other websites== * Category:2020 in the Netherlands Category:2020 in music 2020 Category:Rotterdam",
 "title": "Eurovision Song Contest 2020"
}