{
 "id": "704485",
 "text": "Harry Osborn is a fictional character appearing in Marvel Comics created by Stan Lee and Steve Ditko for the Amazing Spider-Man #31 in 1965. == Fictional character biography == He is the son of Norman Osborn and his mother died in childbirth. His father blames him for her death and as such is dismissive and impatient with him. Harry constantly tries and fails to win his father's approval. Harry meets Peter Parker at University and at first can't stand him. He later gets to know him better and becomes his best friend. Harry's father Norman then becomes the supervillain the Green Goblin and Harry starts to use drugs. Green Goblin then kills Spider-Man's girlfriend Gwen Stacy and accidentally kills himself during a battle with Spider-Man. Harry blames Spider-Man for his father's death and wants to get revenge by becoming a supervillain the second Green Goblin. ==Harry Osborn in film== Harry Osborn is played by James Franco in the 2002 Spider-Man movie. In it, Harry Osborn goes to high school with Peter Parker and is the only person aside from Mary-Jane Watson who is nice to him. Harry is Peter's best friend and does not get along well with his father. Harry dates Mary-Jane Watson even though Peter loves her. Harry's father tells him that she is no different from Harry's mother and that all she cares about is his money. Harry defends her. She tells Harry that his father is a creep and Harry defends him. Mary-Jane then breaks up with him. Harry later goes to win her back and realizes she is in love with Peter. Harry's father who is secretly the Green Goblin finds out from Harry that Peter loves Mary-Jane Watson. After he died Norman makes Peter swear not to tell Harry that he is the Green Goblin. Harry swears to kill Spider-Man for revenge. In Spider-Man 2 Harry is willing to work with Doctor Octopus to kill Spider-Man. At the end of the movie he is horrified to discover that Peter Parker is Spider-Man. In Spider-Man 3, Harry becomes a supervillain so that he can kill Spider-Man and avenge his father's death. In the end of the movie, he agrees to work with Spider-Man to rescue Mary-Jane Watson from the supervillains the Venom and the Sandman and Harry dies so that Peter can kill the Venom and rescue Mary-Jane. Harry Osborn is played by Dane DeHaan in The Amazing Spider-Man 2. Category:Animated characters Category:Fictional characters introduced in 1965 Category:Fictional criminals Category:Marvel Comics superheroes Category:Movie characters Category:Spider-Man",
 "title": "Harry Osborn"
}