{
 "id": "704480",
 "text": "Coffeyville is a city in southeastern Montgomery County, Kansas, United States, located along the Verdigris River in the state's southeastern region. As of the 2020 census, the city population was 8,826. It is the most populous city of Montgomery County and with its southeast Kansas location is in the Tulsa, Oklahoma media market. The town of South Coffeyville, Oklahoma is located approximately 1 mile south of the city, existing as a separate political entity immediately south of the state line. ==History== The city was first incorporated in 1872, but the charter was voided as illegal. The city was re-incorporated in March 1873. ==Geography== The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== ==People== ===2020 census=== The 2020 census says that there were 8,826 people, 3,587 households, and 2,013 families living in Coffeyville. Of the households, 60.0% owned their home and 40.0% rented their home. The median age was 37.7 years. Of the people, 64.7% were White, 11.2% were Black, 4.2% were Native American, 0.7% were Asian, 0.1% were Pacific Islanders, 6.5% were from some other race, and 12.7% were two or more races. Hispanic or Latino of any race were 12.6% of the people. ===2010 census=== The 2010 census says that there were 10,295 people, 4,226 households, and 2,456 families living in Coffeyville. ==Media== The Coffeyville Journal is the local newspaper. They publish twice per week. ==References== ==Other websites== ;City * City of Coffeyville * Coffeyville - Directory of Public Officials ;Schools * USD 445, local school district ;Historical * Coffeyville, Kansas: The Town That Stopped the Dalton Gang, a National Park Service Teaching with Historic Places (TwHP) lesson plan * Kristine Crispel's horse farm outside Coffeyville has the distinction of being the center of the world—according to Google. ;Maps * Coffeyville City Map , KDOT Category:Cities in Montgomery County, Kansas Category:1869 establishments in Kansas",
 "title": "Coffeyville, Kansas"
}