{
 "id": "704611",
 "text": "Grammatical gender is a way of organizing words in a language. It is a way of deciding the inflection, or change in form, that a word has. Some languages have grammatical gender, like Spanish and Arabic, but others do not, like Chinese, Japanese, and Estonian. == Indo-European languages == Proto-Indo- European, the supposed ancestor language of Indo-European languages, had three genders, masculine, feminine, and neuter. A word's gender decides how to say a word. For example, the German word for man is masculine (der Mann), the word for woman is feminine (die Frau), and the word for girl is neuter (das Mädchen). The gender of a word may not have connection with its biological sex in certain languages; it is instead a way to organize words grammatically. Many Indo-European languages, like Russian, German, and Latin, still have all three genders. Some Indo-European languages have lost the neuter gender and either replaced it or completely got rid of it. In French, all singular nouns are either masculine (the boy \"le garçon\") or feminine (the girl \"la fille\"), but all plural nouns use the same articles (the boys \"les garçons\" and the girls \"les filles\"). In Spanish, there are only masculine and feminine nouns, but they are usually marked by a vowel at or near the end. Most masculine nouns end with the vowel \"-o\", and most feminine nouns end with the vowel \"-a\". For animate (living) nouns, the gender of the noun is always connected to its biological gender. For example, a male dog is \"perro\", and a female dog is \"perra\". If the gender is unknown, the noun is automatically masculine. In plural forms, if at least one of the nouns is male, the plural noun must be masculine, even if most of the members are feminine, like in the friends \"los amigos\". However, if all of the members of a plural noun are female, the plural noun is feminine, as in \"las amigas\". English has three genders, but most nouns are not marked by gender. However, the genders of pronouns must match the biological sex of animate nouns. Males must be masculine, and females must be feminine. All plural and inanimate (non-living) nouns must be neuter. Some linguists call English's gender system to represent \"natural gender\". == Other languages == In Chinese, words have no grammatical gender, but there are still three gendered pronouns. The masculine pronoun is written as 他, the feminine is 她, and the neuter is 它. Even though all three are written in a different Chinese character, they are all still pronounced exactly the same: \"tā\" in Mandarin. That is why many Chinese learners of English do not use English pronouns correctly. In some contexts, if the gender is unknown, the pronoun will be written in pinyin as \"ta\" even if the rest of the document is written in Chinese characters. In Japanese, grammatical gender is not used since people are usually referred to by name and/or title, rather than a pronoun. However, men and women are expected to use different pronouns. For example, women are supposed to say \"watakushi\", \"watashi\", or \"atashi\" to speak in the first person, but men usually say \"watashi\" to speak politely and \"boku\" or \"ore\" to speak plainly. == Related pages == *Common gender == References == Category:Gender Category:Grammar",
 "title": "Grammatical gender"
}