{
 "id": "704677",
 "text": "The Arab Revolt was a revolt of various Arab tribes who came together and fought against the Ottoman Empire during World War I. Up until before the First World War the Arabs had been subjects to the Ottomans. The revolt was launched by the Shairf of Mecca, Hussein bin Ali, after he had made a deal with the British Empire, who wanted to defeat the Ottomans. In this deal the British Empire promised Sharif Hussein and the leader of the Arabs an independent Arab state in exchange for their attack against the Ottoman Empire. This agreement is known as the Hussein-McMahon correspondence. On June 10th, 1916, the Arab Revolt began in Mecca and was led by Sharif Hussein's son Emir Faysal and T.E. Lawrence, also known as \"Lawrence of Arabia\". On 1st October 1918, Faysal and the Arabs reached Damascus, installing an Arab government under British supervision. However, although the Ottomans were defeated, the British did not keep their promise, and the Arab world would be instead come under indirect and direct influence of the British and the French powers. == Background == The Arab Revolt concluded four centuries of Ottoman control of Arab lands. The Arab lands included areas from Syria and Mesopotamia, to Yemen and North Africa, with the exception of Morocco. In Arab historiography, the revolt was the arrival of an ‘Arab Awakening’ which had progressed for some time. The relationship between the Arabs and the Turks can be seen as amicable from the Ottoman conquest in 1517 until the late stages of Sultan Abdul Hamid II’s reign. In an example of their good relationship, the Arabs regarded the Ottoman Sultan-Caliph as the defender of their faith, Islam. == Beginnings of Arab Nationalism == In the middle of the eighteenth century, the Ottomans began a series of reforms to re-stabilise and modernise their regime, however, these were only implemented with effect in the middle of the nineteenth century. The impact of the Arab reforms differed throughout the Empire. For example, the reform movement was heavily applied in places such as Syria, Beirut and Aleppo whereas the reforms in Baghdad and Basra were more discrete, ultimately in Yemen and al-Hijāz there were little administrative changes. In the regions where the reforms were more heavily applied, a stronger sense of the origins of the Arab national movement against the Ottomans emerged in response to these changes. Alongside the period of reforms the Ottomans began to centralise their government, inspired by the French system of government. In doing so, the Ottomans adhered to a rigid regime which was very detrimental to the Arab territories. This disagreement over the Ottoman regime did factor into the Arab Revolt and the consequential break from the Ottoman Empire in 1916. After the 1908 Turkish revolution, the tension between the Ottomans and the Arabs became politicised during the first election under the new constitution. . The constituencies had been established to favour the Turks over the other nationalities in the Empire, noting that the actual population ratio of Turks to Arabs in the Empire was 2:3. . Once the Committee of Union and Progress had been elected, with a Turkish majority, it became clear that they were not interested in dismissing the previous centralisation policies of which the Arabs suffered from. . == British Interest in Arab Territories == During World War One, the British fought off the Ottoman fourth army at the Suez Canal for the second time, in 1916, they planned a series of offensives to take place in the Arab provinces to weaken the Ottoman's resource supply. As an alternative to these offences, the British stationed in the Middle East understood that a revolt from within the Ottoman Empire would also be beneficial to their war effort. If they were to foment an Arab revolt, the Ottoman troops would be diverted away from the British front lines and it would restrict access between the Ottomans in the Middle East and the Germans in North Africa. == Historical Events of the Arab Revolt == Preface The British are trying to beat the Ottomans but struggle strategically because the Ottoman Empire is spread through various areas of Arab Lands. They are planning to organise an Arab revolt to try to get Arab countries involved in the battlefield as well. To start the revolt they are searching for an Arab leader who can take the lead. They end up focusing on Sharif Hussein and his family. His family have been loyal and part of the Ottoman government for years. They are descendents of Muhammed and part of the Hashemites. Hussein has been named the protect of Mecca and Medina. However, since the centralisation initiatives of the Ottoman Sultan Abdul Hamit II's Hussein feels his power has been threatened. He sees the WOI as a great opportunity to start rebelling against the Ottoman Empire to gain more power again. Because he is the protector of Mecca and Medina he is a good candidate for claiming to be the leader of Arab Muslims. In the end of 1915 negotiations started between Hussein and Sir Henry Mcmahon, a high commissioner in Cairo, about starting an Arab Revolt. This was called the Hussein-Mcmohan correspondence. Hussein claimed to act in the best interest of the Arab people. He want Britain to acknowledge that he will become the independent leader of the new formed Arab state after the Arab revolt. The new formed Arab state consists of the Arabian Peninsula, the Levant and Iraq. In this way he could get more power again. In return he would help the British to defeat the Ottoman Empire. McMahon claimed he fought for what was best for Britain, he wanted certain regions in Iraq and Syria to remain under British and French power. In return they gave Hussein resources such as weaponry, food, gold which were provided by Britain were essential in launching the attack. 1916 Start of the Arab Revolt On the 10th of June the Arab Revolt began, the leaders involved here were Emir Faysal, the son of Hussein and T.E. Lawrence, a British official. The army conquered many towns of the Ottomans and also attacked the Hijazi Railway. They also succeeded in stopping Ottoman troops becoming closer to the German troops in Africa. In total they stopped about 30.000 troops. They defeated the forces of Djemal Pasha. T.E. Lawrence his nickname was 'Lawrence of Arabia', he was seen as a successful military player in the conquerings of Ottoman areas, especially in the eyes of Europeans. He started working on mapping the whole area of Arab land and also helped plan the Arab Revolt. He had a huge advantage due to his maps because of this he knew the area well. He helped map out the military strategy of Britain. 1917 Conquering of seaport of Aqaba The seaport of Aqaba was the best place for German troops to land.In June 1917 the Arab Revolt conquered this and afterwards they moved up North. Faysal struggled with explaining the various tribes here why it was a good idea to rebel against the Ottoman Empire. He did this in the name of his father, who called it a Jihad (holy war). He succeeded in some tribes joining the force and others just let him pass. 1918 Victory of Damascus On the first of October the Arab revolt conquered Damascus. A big help with this was Faysal changing his strategy to persuade to rebel against the Ottoman Empire. He stated that he did this because of Arab nationalism. In this way he won over Arabian activists that were in Damascus. In 1918 the Arab revolt established an Arab government in Damascus with Faysal as their leader. This was under supervision of the British. It was an Arab government financed by the British government. They ruled over what is nowadays Syria and Jordan. == Arab revolt and Arab nationalism == It turns out that the Arab revolt was an important event to solidify Arab nationalism. Even though Husseins ideology did not meet with the emergence of Arabism he used it as a strategy to win various Arabic tribes on his side. Arab nationalism was thus a helpful source for many parties in WOI. Such as the Arab tribes and the British who used the revolt to their advantages and a key motivator for the conflict that happened in the Hijaz area. == Aftermath == After World War I ended in 1918, the Arabs had done their bit to support the Allied forces in their win against the Ottoman Empire. In the Paris Peace Talks 1919–1920, the British and French did not endorse their previous support of the Arab state as they had made a secret treaty, the Sykes-Picot Agreement, which ensured their influence in the Middle East after World War I. == Reference list == Category:1910s in the Ottoman Empire Category:World War I",
 "title": "Arab Revolt"
}