{
 "id": "704679",
 "text": "The Allied Powers of World War I were the countries who fought against the Central Powers in World War I. Major countries included the British Empire, France, the Russian Empire, the United States, Italy, and Japan. Most of these countries would fight alongside each other again in World War II, except that Italy and Japan would fight alongside Germany instead. The Allied Powers in Europe were already allies before the war began. Serbia was an ally of Russia, and Russia was an ally of Britain and France. The war started because the Austro-Hungarian Empire declared war on Serbia in 1914, which led to a chain reaction of countries declaring war on each other. At first, the United States was neutral, it was not part of either side. However, after several acts made by Germany against the US, the US declared war on Germany in 1917 and would fight for the Allied Powers. Russia's campaign against the Central Powers went very poorly. Many Russian soldiers were poorly equipped and trained, many Russians were killed, and poverty and starvation became worse problems than before. Many Russians blamed Czar Nicholas II's poor leadership for Russia's problems, so he was overthrown and sent to exile. The Russian Provisional Government who replaced him also made many Russians upset because they promised that Russia would continue fighting the war. After the March Revolution that overthrew the Czar, communist revolutionary Vladimir Lenin made a deal with Germany. The deal was that he would stop the fighting between Russia and Germany if they sent him to Russia to overthrow the government. Lenin's slogan for his communist government was \"peace, land, and bread\". This meant that the communist government promised no more fighting in the war, land redistribution so that everyone in Russia could have an equal amount of property, and that food would be plentiful. After the Communist Party took over Russia in the October Revolution, they fulfilled their promise to Germany and ended Russia's fighting in the war. In World War II, Italy would join Germany in the Axis Powers because its leader, Benito Mussolini, had a similar ideology to Nazism. Japan was disappointed with the end of World War I because it did not gain as much as it wanted. Japan would also join the Axis Powers because it thought it would help the Japanese Empire grow faster than if it did with the Allies. Category:World War I",
 "title": "Allied Powers of World War I"
}