{
 "id": "704653",
 "text": "Bonner Springs is a city in Wyandotte, Leavenworth, and Johnson counties, Kansas, United States. It is part of the Kansas City Metropolitan Area. In 2020, 7,837 people lived there. Bonner Springs became a city on November 10, 1898. ==Geography== Bonner Springs is at (39.0597260, −94.8835754), mostly north of the Kansas River. It is mainly in southwestern Wyandotte County. There are small parts of the city going west into Leavenworth County and south across the Kansas River into Johnson County. It is bordered to the north by Kansas City, Kansas, to the east by Edwardsville, and to the south across the Kansas River by Shawnee. Interstate 70, goes through the northern part of the city. I-70 goes east to Kansas City, Missouri, and west to Lawrence. US-73 goes north to Leavenworth, and K-7 goes south to Olathe. K-32 goes through the center of Bonner Springs close to the Kansas River. It goes east into Edwardsville and west to Linwood. The United States Census Bureau says that the city has a total area of . Of that, are land and , or 2.3%, are water. ===Climate=== Bonner Springs has a humid continental climate. They have hot, humid summers and cold, dry winters.Peel, M. C., Finlayson, B. L., and McMahon, T. A.: Updated world map of the Köppen-Geiger climate classification, Hydrol. Earth Syst. Sci., 11, 1633–1644, doi:10.5194/hess-11-1633-2007, 2007. ==People== ===2020 census=== The 2020 census says that there were 7,837 people, 3,037 households, and 2,065 families living in Bonner Springs. Of the households, 66.0% owned their home and 34.0% rented their home. The median age was 37.0 years. Of the people, 76.2% were White, 6.7% were Black, 1.1% were Native American, 0.7% were Asian, 0.2% were Pacific Islanders, 3.8% were from some other race, and 11.3% were two or more races. Hispanic or Latino of any race were 13.2% of the people. ===2010 census=== The 2010 census says that there were 7,314 people, 2,810 households, and 1,917 families living in Bonner Springs. ==Related pages== *Great Flood of 1951 ==References== ==Other websites== ;City * City of Bonner Springs official website * Bonner Springs – Directory of Public Officials * Bonner Springs / Edwardsville Area Chamber of Commerce ;Schools * USD 204, local school district ;Maps * Bonner Springs City Map , BonnerSprings.org * Bonner Springs City Map , KDOT Category:Cities in Johnson County, Kansas Category:Cities in Leavenworth County, Kansas",
 "title": "Bonner Springs, Kansas"
}