{
 "id": "704658",
 "text": "Bel Aire is a city in Sedgwick County, Kansas, United States. It is a suburb of Wichita. In 2020, 8,262 people lived there. ==History== Bel Aire was created in January 1955 when a group of local residents asked the county government to create it. They wanted this place to be an improvement district for water. On November 26, 1980, Bel Aire officially incorporated as a city. This was after a two-year legal dispute with the Wichita city government. The dispute was about whether or not Pratt had the right to become its own city. The case went to the Kansas Supreme Court, and the Court ruled in Bel Aire's favor. ==Geography== Bel Aire is at (37.763758, −97.266177). It has an elevation of 1,394 feet (425 m). It is on the north side of the East Fork of Chisholm Creek. It is about northeast of the Arkansas River in the Wellington- McPherson Lowlands region of the Great Plains. It is on the south side of K-254 in south-central Kansas. Bel Aire is within the Wichita metropolitan area, bordered by Wichita to the south and west and bordered by Kechi to the north. The United States Census Bureau says the city has a total area of . Of that, is land and is water. ==People== Bel Aire is part of the Wichita, KS Metropolitan Statistical Area. ===2020 census=== The 2020 census says that there were 8,262 people, 3,080 households, and 2,234 families living in Bel Aire. Of the households, 76.0% owned their home and 24.0% rented their home. The median age was 38.3 years. Of the people, 74.3% were White, 9.9% were Black, 4.6% were Asian, 0.5% were Native American, 2.0% were from some other race, and 8.7% were two or more races. Hispanic or Latino of any race were 7.6% of the people. ===2010 census=== The 2010 census says that there were 6,769 people, 2,465 households, and 1,854 families living in Bel Aire. ==References== ==Other websites== ;City * City of Bel Aire * Bel Aire - Directory of Public Officials ;Schools * USD 259, local school district * USD 375, local school district ;Maps * Bel Aire City Map , KDOT Category:Cities in Sedgwick County, Kansas",
 "title": "Bel Aire, Kansas"
}