{
 "id": "704744",
 "text": "During the Arab Winter there was a resurgence of authoritarianism, absolute monarchies and Islamic extremism. The Arab Winter started in 2014 and happened four years afterAhmed H Adam and Ashley D Robinson. Will the Arab Winter spring again in Sudan?. Al-Jazeera. 11 June 2016. facebook \"The Arab Spring that swept across the Middle East and succeeded in overthrowing three dictatorships in Tunisia, Egypt and Libya in 2011 was a pivotal point in the history of nations. Despite the subsequent descent into the \"Arab Winter\", the peaceful protests of young people were heroic...\" the Arab Spring.Radoslaw Fiedler, Przemyslaw Osiewicz. Transformation processes in Egypt after 2011. 2015. p182. It includes civil wars, mounting regional instability, economic and demographic decline of Arab countries, and ethno-religious wars. By the summer of 2014, the Arab Winter had resulted in nearly a quarter of a million deaths and millions of refugees. Perhaps the most significant event was the rise of the Islamic State of Iraq and the Levant from 2014 to the present. == What happened? == * Syrian Civil War, * the Iraqi insurgency and the following civil war, the Egyptian Crisis, * the Libyan Crisis; Various militias and tribes have started fighting in Libya after a breakdown in negotiations. * the Crisis in Yemen. * the removal of Mohamed Morsi and rise of General Abdel Fattah el-Sisi in an anti-Muslim Brotherhood campaign. * return to authoritarianism and suppression of civil liberties in Egypt since July 3, 2013. * The arenas of Lebanon and Bahrain. * The Northern Mali conflict was often described as part of the \"Islamist Winter\".\"In Mali AQ achieved to infiltrate and take over Tuareg insurgency. If AQ succeeds to keep the Arab Spring countries destabilized, this will lead to a viral reproduction of Azawad scenario. AQ is the \"Islamic Winter\".\" * Political changes which occurred in Tunisia, involving a change in government, * a possible ISIL insurgency. * Qatar-Saudi Arabia diplomatic conflict Chinese professor Zhang Weiwei first predicted an \"Arab Winter\" in his June 2011 debate with Francis Fukuyama. \"My understanding of the Middle East leads me to conclude that the west should not be too happy. It will bring enormous problems to American interest. It is called \"Arab Spring\" for now, and I guess it will soon turn to be the winter for the Middle East.\" In early 2016, The Economist said the Winter was ongoing and \"worse than ever\". == Consequences == According to the Moshe Dayan Center for Middle Eastern and African Studies, as of January 2014, the Arab Winter cost the Arab League $800 billion USD. In 2014, sixteen million people in Syria, Egypt, Iraq, Jordan and Lebanon were expected to need help. According to a study by the American University of Beirut, as of the summer of 2014, a quarter of a million died, and millions are refugees. Political columnist and commentator George Will said that as of early 2017, over 30,000 died in Libya, 220,000–320,000 were killed in Syria, and 4 million refugees had fled the Syrian Civil War alone. There is chaos and violence. So many people fled the Middle East and North Africa to Europe, it has resulted in the European migrant crisis.“Displacement in the Middle East and North Africa: Between an Arab Winter and the Arab Spring”. \"In the midst of ongoing uprisings, violence, and political turmoil, widespread population displacement took place as a result of the conflict in Libya, the violence in Syria and upheaval in Yemen. In each of these contexts, the new waves of displacement took place in or to areas already struggling with previous waves, leading to multi-layered and complex crises.\" As a result, \"boat-people\", which was once commonly referred to Vietnamese boat people, became frequently used. These include refugees from Libya or Tunisia, escaping to the European Union across the Mediterranean Sea. Some European politicians fear the migrants might \"flood\" their shores. So many Europeans are working on laws to help manage the arrivals along their nations' borders. == Related pages == * Islamic State of Iraq and the Levant ** International military intervention against ISIL * List of modern conflicts in North Africa * Spillover of the Syrian Civil War * Iran–Saudi Arabia proxy conflict * Qatar-Saudi Arabia diplomatic conflict == References == == Other websites == * RT – Flames, Fury & Frustration: Arab Spring spins into Arab Winter? * RT – CrossTalk: Arab Winter? * Arirang News – Prime Talk: Are we approaching an Arab Winter? Jang Ji-hyang, Asan Institute for Policy Studies * VICE – Arab Winter: Syrian refugees in Lebanon Bekaa Valley * Dimitar Mihaylov – Why the Arab Spring Turned into Arab Winter: Understanding the Middle East Crises through Culture, Religion, and Literature Category:History of the Middle East Category:2010s in Asia Category:2010s in Africa",
 "title": "Arab Winter"
}