{
 "id": "704703",
 "text": "The Abyssinia Crisis happened in 1935. It started with the Walwal incident, a conflict between the Kingdom of Italy and the Empire of Ethiopia (then commonly known as \"Abyssinia\"). The League of Nations said Italy could not intervene and voted to punish Italy's economy. But the League did not follow through, and Italy quit the League, made special deals with Britain and France and invaded Abyssinia. The crisis made the League look bad, and made Fascist Italy closer friends with Nazi Germany. Both Italy and Ethiopia did not like each other. The League of Nations said: > At places where there is not a single Italian national, a consul establishes > himself in an area known as consular territory with a guard of about ninety > men, for whom he claims jurisdictional immunity. This is an obvious abuse of > consular privileges. The abuse is all the greater that the consul's duties, > apart from the supplying of information of a military character, take the > form of assembling stocks of arms, which constitute a threat to the peace of > the country, whether from the internal or the international point of > view.League of Nations Official Journal, 1935, 1601. Quoted G.T.Garratt, > Mussolini's Roman Empire, Penguin Books, April 1938, pp.46–47 == Related pages == * Kellogg-Briand Pact of 1929 * Munich Crisis of 1938 == Notes == ; Footnotes == Further reading == * Baer, George W. Test Case: Italy, Ethiopia, and the League of Nations (1976). * * Corthorn, Paul Steven. \"The British labour party and the League of Nations 1933-5\" (PhD disst. Durham University, 1999). online. * Fronczak, Joseph. \"Local People’s Global Politics: A Transnational History of the Hands Off Ethiopia Movement of 1935\" Diplomatic History (2014): * Kent, Peter G. \"Between Rome and London: Pius XI, the Catholic Church, and the Abyssinian Crisis of 1935–1936.\" International History Review 11#2 (1989): 252–271. * * * * * Post Jr, Gaines. \"The Machinery of British Policy in the Ethiopian Crisis.\" International History Review 1#4 (1979): 522–541. * Strang, G. Bruce. \"'The Worst of all Worlds:' Oil Sanctions and Italy's Invasion of Abyssinia, 1935–1936.\" Diplomacy and Statecraft 19.2 (2008): 210–235. == Other websites == * * Ethiopia 1935 to 1936 Category:1930s in Italy Category:History of the United Kingdom Category:World War II Category:1935",
 "title": "Abyssinia Crisis"
}