{
 "id": "704872",
 "text": "The Algerian War, also known as the Algerian War of Independence or the Algerian Revolution ( ; ; or ) was fought between France and the Algerian National Liberation Front (. FLN) from 1954 to 1962. The war led to Algeria gaining its independence from France. It was known for its use of guerrilla warfare and for the massive use of torture on both sides.Keith Brannum, University of North Carolina Asheville, The Victory Without Laurels: The French Military Tragedy in Algeria(1954–1962) Irwin M. Wall, France, the United States, and the Algerian War, pp, 68–69. The war took place mainly in Algeria. It brought France to the verge of military coup d'état; which caused the fall of the Fourth Republic (1946-58), and transformed the French constitution. == Background and causes == === Conquest of Algeria === Until the early nineteenth century, Algeria or the Regency of Algeris was part of the Ottoman Empire. The area was governed by local governors called dey. The population was made up largely of Arabs and Berbers, but there were other tribal communities spread throughout the provinces and the Sahara. After the French Revolution and the defeat of Napoleon Bonaparte at the Battle of Waterloo in 1815, the French Republic had bought 8 million francs worth of grain from the Algerians. That was to be refunded later, which did not happen. In 1827, the dey invited a French ambassador to pay some of the debt. The encounter resulted into a conflict in which the Algerian dey hit the French consul in the face with a fly-whisk. The French were furious and decided to blockade the Algerian city of Algiers. However, historians agree that the fly- whisk incident, as serious as it was, was only a pretext. The initial French conquest of Algeria was relatively easy. French troops left Toulon on May 25 1830, landed in Algeria on June 14, and by July 5, Algiers had capitulated. The French troops slaughtered civilians, looted, and destroyed mosques and cemeteries. In 1834, the dey was overthrown, and Algeria became a colony of France. In 1848, France added the region to its own empire and divided it into three departments: Alger, Oran and Constantine. The French thought that they would conquer the rest of the country in a matter of time, but they faced a strong resistance from Algerians that could not be put down until 1857 with the bloody Campaign of Kabylie and the Battle of Icheridden. Moreover, French became the official language. Many French people and other Europeans migrated to Algeria. Known as pieds-noirs (literally \"black feet\"), they were Algerian- born French and often cruel against indigenous populations. They killed and expelled many local inhabitants. According to the American historian Jennifer Sessions, the local population shrank from more than 4 million to 2.3 million during the first 25years of French colonisation (1830-1855). === Algerian Nationalism === The first expressions of Algerian nationalism started with the revolt of an Algerian chief, Emir Abdelkader, against French colonial rule in the 1830s. It was only a stubborn and unsuccessful opposition, Abdelkader's defence of his country can be seen as the first step to an eventual nationalist identity. It was, however, by no means the end of the resistance to the French presence in Algeria since outbreaks of armed rebellion continued throughout the 19th century. The Kabyles in the mountains east of Algiers, for example, fought in the Battle of Icheridden in 1857 and rose again in 1871, when France had lost a war against Prussia. Anti-French revolts came up in the southern towns of Touggourt and Ouargla about the same time. In the early 20th century, Algerians again sought for equality of rights and the removal of special administrative powers over Muslims. Algerian nationalism arose out of the efforts of four different groups. # The first group, the Young Algerians (Jeunesse Algérienne), established in 1907, consisted of French-educated intellectuals and elite such as Khalid ibn Hashim and Ferhat Abbas. As assimilationists, they wanted to foster political, legal, social, and economic assimilation by having French citizenship and keeping their Muslim personal status. Citizenship in Algeria was governed by the 1865 sénatus-consulte legislation, which stated that Algerians were French but not citizens of France. To become citizens, they had to renounce their Muslim civil status. The Blum-Viollette Proposal would have allowed a small number of Algerians to obtain full French citizenship without forcing them to renounce their Muslim civil status, but massive European opposition stopped the proposal from ever passing. The Young Algerians published a number of newspapers and journals, such as L'Islam, known as \"the democratic organ of the Algerian Muslims,\" and El-Hack. # The second group consisted of Muslim teachers and students who founded the Association of Algerian Muslim Ulama (Association des Oulémas Musulmans Algériens; AUMA) in 1931. They were inspired by al-Afghani and the Egyptian reformers Muhammad 'Abduh and Muhammad Rashid Rida. They stressed the Arab and Islamic roots of the country and promoted a purification of Islam in Algeria and a return to the Qur'an and the Sunnah. This group was not a political party but created a strong sense of Muslim Algerian nationality among the Algerian masses. The slogan of the founder Ben Badis was \"Islam is our religion, Arabic our language, and Algeria our country.\" # The third group was more radical and originated in Paris. It was organised among North African and other egrants in France in the 1920s under the leadership of Ahmed Messali Hadj. He organised the North African Star (Étoile Nord-Africain) and, when it had been banned in 1937, the Algerian People's Party (Parti du peuple algérien; PPA). He called for an uprising against French colonial rule and total independence. The PPA laid the foundation for modern nationalism in Algeria. # The communists constituted another group with the Algerian Communist Party in 1935. However, there was no real sense of class consciousness because the group consisted predominantly of Europeans. that made it have littlepolitical role during the nationalist struggle for independence. The National Liberation Front (Front de libération nationale; FLN), founded in 1954, succeeded Hadj's Algerian People's Party (PPA). It soon established a military wing, the National Liberation Army (Armée de libération nationale; ALN), and called on all Algerians to rise and fight for their freedom. By 1957, the ALN reached 40,000 well-disciplined men, some from the country and others stationed in Morocco and Tunisia. The revolution had begun. ==== Sétif and Guelma Massacre ==== On May 8 1945, shortly after the end of the World War II, Algerian civilians organised a demonstration in which they demanded independence. The demonstrations turned into a bloodbath. The protesters killed more than 100 European settlers. The French army killed at least 6,000 and 50,000 Algerian civilians (estimates vary widely). John P. Entelis estimated the number of Algerians civilians killed by the suppression of the riots as 15,000. === Effects of French colonialism on Algeria === French colonialism had a devastating effect on lives of Algerians. By World War I, the number of settlers from France and other European countries, mostly from Italy, Spain, and Malta, reached 800,000 in a native population of 4.5-5 million. About half of the European settlers were working-class wageearners. Their standard of living was in general lower than that of their equivalents in Metropolitan France but much higher than that of Algerians. French settlers took possession of 6 millions acres, which represented 40% of all agricultural and 98% of the country's most productive land. The Europeans also controlled almost all the country's infrastructure, industry, and commerce and dominated its government and the judicial and educational systems. In sum, the French government created a feudal system in which a few thousand Europeans ruled over millions of Algerians. Only the European settlers and a tiny minority of privileged Algerians enjoyed full French citizenship; most Algerians were French subjects but not French citizens and had little voice on how their country was run. The Code de L'Indigénat (Native status code), which was established at the end of the conquest in 1881 and in effect until 1944, forced Algerians to pay special taxes. The harm done to Algerians was not only economic but also educational and cultural. The government took over religious institutions, distributed them a budget and appointed the imams. Moreover, the French destroyed the Algerian educational system; before the French conquest, the literacy rate in Algeria was higher than in France, but by 1954 only 25% of Algerian children attended school. == Course of the war (1954-1962) == === Beginning of hostilities === On November 1 1954, the FLN started the struggle for national independence in Algeria and declared war on France. Algerian armed troops revolted in several places and were supported by Egyptian President Gamal Abdel Nasser (1918-1970), who promoted Arab nationalism and decolonisation throughout Africa. In the beginning, it was mainly a guerrilla war in which Algerian maquisards (guerrillas) attacked French settlers. The FLN called on Muslims in Algeria to unite and join in a national struggle for the \"restoration of the Algerian state, sovereign, democratic, and social, of the principles of Islam\" since it considered that independence was not enough. French Interior Minister François Mitterrand, responded that \"the only possible negotiation is war'\". Initially, the higher-ranking French military was targeted, but in August 1955, the FLN targeted the civilian population as well. That began with the slaughter of 123 French-Algerian civilians, the murders of women and children, and the mutilation of corpses in Philippeville by the FLN on August 20 1955 and the death of some 50 Muslims. The FLN was also engaged in civil wars with the Algerian National Movement (Mouvement national algérien; MNA), founded by Messali Hadj. The MNA had a similar policy of violent revolution and total independence, but the FLN largely wiped out the MNA in Algeria. The MNA's remaining support was among Algerians within France. Their fighting during the war also took place in France itself and is called the \"café wars\" in which supporters of the FLN and the MNA supporters attacked one another in French cafés and restaurants; 5,000 people were killed. French troops took revenge after the Battle of Philippeville and killed 1,270 (according to France) to 12,000 (according to Algeria) local Algerian Muslims. Moreover, after the attack, the French increased their troops to 250,000. Moreover, as soon as Tunisia and Morocco became independent from France in March 1956, both countries supported Algerian rebels in their fight against the French so that Algeria could become independent as well. They issued passports to FLN representatives to enable them to travel abroad and to make necessary arrangements for the purchase of arms. Egypt and the other Arab states of the Middle East also supported the Algerian rebels. One of the purposes for the formation of the League of Arab States in 1945 had been to allow independent Arab countries to help other Arab peoples achieve independence. === Battle of Algiers === Meanwhile, as a way to draw attention to its struggle, the FLN began to target urban areas and larger cities. On September 30 1956, the Battle of Algiers had begun by three women allied with the FLN simultaneously placing bombs in public places in Algiers, including an Air France terminus and a popular bar for pieds-noirs. Both sides fought against each other: Algerian nationalists bombed and waged guerrilla warfare, and in turn,the French repeatedly tortured and murdered Algerian prisoners. From 1957 to 1960, the French tried to deal with the guerrillas by attacking villages and by bombing or burning them if suspected guerrillas were suspected to be present. Over 800 villages, especially in the mountains, were completely destroyed. The inhabitants were moved from their villages and regrouped in camps on flat areas, where it was difficult to rebuild their previous economic and social systems. The regroupement program was a French strategy to fight against the guerrillas of the FLN. It led to the displacement of more than 2,5 million Algerians and to the weakening of peasant communities and populations already weakened in the colonial context. The so-called harkis, from the Algerian-Arabic dialect word harki (soldier), were indigenous Muslim Algerians who fought alongside the French during the colonial period. The term also came to include civilian indigenous Algerians who supported a French Algeria, such as Spahis, Tirailleurs, and Moghaznis. According to French archives, there were around 200,000 Algerian Muslims who fought alongside the French Army during the Algerian War and, by extension, their families. The French recruited and trained harkis by using guerrilla tactics similar to those of the FLN. They were an ideal instrument of counterinsurgency warfare for the French. An important turning point in the war, was the election of Charles de Gaulle as president of the Fifth Republic in 1958. De Gaulle wanted to end the war through negotiations. From May 1961, the first negotiations between the French Army and the FLN started in Évian. Initially, they went smoothly. In the Évian Accords of 18 March 1962, the negotiating parties (France, the Algerian Republic and the FLN) reached agreement on a ceasefire, the release of prisoners, and the recognition of Algeria's sovereignty and independence. However, that did not mean that the war was immediately over. From March to June 1962, French pieds-noirs of the Secret Armed Organisation (Organisation armée secrète; OAS) carried out numerous terrorist attacks, both in Algeria and metropolitan France. The OAS terrorists bombed and blew up schools, burned libraries, set fire to oil wells and pipelines, and killed. Finally, in June , the FLN and the OAS concluded a ceasefire. In April , a referendum was held in France in which more than 90 percent voted for Algeria's independence. Finally, increasing pressure from the United Nations made France, led by de Gaulle, declare Algerian independence on 3 July 1962. On July 5, Algeria became independent. == Consequences of the Algerian War == Immediately after Algerian independence, a massive outflow started. About 650,000 people left Algeria, most of them withdrawing to France. Over the time span of four months, the total refugee population equalled five years of former migration waves during French colonisation. The sudden migration occurred during the period between the Évian Agreements and the first months following Algeria’s independence. The migration was understandable because after the war, the FLN took revenge on former opponents and collaborators. The harkis were particularly hard hit. The peace agreements did not save them from the wrath of their countrymen, who considered them nothing but traitors. Out of the quarter of a million who had worked for the French less than 15,000 succeeded to escape from Algeria. Estimates on the numbers of Algerians killed vary between 30,000 and 150,000. ==Battles and operations== * Battle of Philippeville * Battle of Algiers (1956–1957) * Operation Jumelles * Plan Challe * Sétif and Guelma massacre * ==References== Category:Wars involving France Category:1950s in Europe Category:1960 in Europe Category:1961 in Europe Category:1962 in Europe Category:20th century in Algeria Category:1950s conflicts Category:1960s conflicts Category:National liberation movements Category:Incidents of violence against women",
 "title": "Algerian War"
}