{
 "id": "705000",
 "text": "The Chinese economic reform () refers to the economic reforms in the People's Republic of China between the 1970s and 1990s. They were led by the Communist Party of China and Deng Xiaoping and started in December 1978. They were also called \"Socialism with Chinese characteristics\". == Why reform? == Before the eighteenth century, China had one of the world's largest and most advanced economies.Dahlman, Carl J; Aubert, Jean-Eric. China and the Knowledge Economy: Seizing the 21st century. WBI Development Studies. World Bank Publications. Accessed January 30, 2008. Adam Smith agreed. Compare: However, Chinese economy began to slow down and even got worse by the 20th century.Maddison, Angus (2007): \"Contours of the World Economy, 1–2030 AD. Essays in Macro- Economic History\", Oxford University Press, , p. 382, table A.7. This was due to things like the First Sino-Japanese War and Second Sino-Japanese War. Other than that, in 1978 the Chinese economy was on the brink of disaster as a consequence of the decisions of Mao Zedong. == How did they reform? == The Communist Party began to fix the economy. It introduced market principles in 1978. Part 1: In the 70s and 80s, they stopped requiring everybody to farm and stopped sending young people to the countryside. They also opened China to foreign investment, allowing people to start businesses. However, most businesses remained owned by the government. Part 2: In the 80s and 90s, the PRC allowed much more private control of business (less government control, privatization). They removed price controls, protectionist policies, and regulations. Still state monopolies in banking and petroleum remained. == What happened next? == The private sector grew remarkably, becoming 70% of China's gross domestic product by 2005. From 1978 until 2013, unprecedented growth happened, with the economy increasing by 9.5% each year. After 2005, Hu Jintao and Wen Jiabao controlled the economy more heavily, reversing some reforms. Xi Jinping undid some more reforms by allowing the government greater control in some areas of the economy. Chinese society changed a lot because of these reforms. They greatly reduced poverty and increased average income. They have also led to China's rise as a world power. == References == Category:Pages with unreviewed translations Category:History of the People's Republic of China",
 "title": "Chinese economic reform"
}