{
 "id": "705275",
 "text": "The Khazars were a semi-nomadic Turkic people. They formed an empire called Khazaria in Russia from the 6th to 10th century CE. They are said to have originated from the Western Turkic Khaganate of the Eurasian steppe, a vast plain encompassing Central Asia and southeastern Europe. ==Overview== Khazaria was an international trading center. It was a hub on the Silk Road that linked ancient China, the Middle East and the Kievan Rus'. For three centuries (c. 650–965), the Khazars conquered the area from the Volga-Don steppes to Crimea and the Caucasus. Khazaria was located between the Byzantine Empire, the steppe nomads and the Umayyad Caliphate. It helped the Byzantines defend itself from the Sasanian Persian empire. The alliance ended around 900. Between 965 and 969, the Kievan Rus replaced Khazaria. ==Name== Khazar or Xazar may have come from *Qasar. The Turkic root qaz- means \"to ramble, to roam\" (used in Qazaqsa or Kazakh), similar to the Common Turkic kez-. Some claimed that it came from qas- (\"tyrannize, oppress, terrorize\") because it is similar to the Uyghur name Qasar. citing L. Bazin, 'Pour une nouvelle hypothèse sur l'origine des Khazar,' in Materialia Turcica, 7/8 (1981–1982): 51–71. Others see it as a person or tribe's name. For instance, the Chinese name Kesa for Khazars may be one of the tribal names of the Uyğur Toquz Oğuz of the Göktürks, namely the Gésà. However, others say Kesa was not a tribal name but the name of the chief of the Sijie (思結) tribe of the Toquz Oğuz. In Middle Chinese, the name Khazars always comes before the word Tūjué (Tūjué Kěsà bù: 突厥可薩部; Tūjué Hésà: 突厥曷薩).. Kěsà (可薩) would have been pronounced as something like kha'sat in both Early Middle Chinese (EMC) and Late Middle Chinese (LMC), while Hésà (曷薩) would yield γat-sat in (EMC) and xɦat sat (LMC) respectively, where final t often transcribes –r- in foreign words. Thus, while these Chinese forms could transcribe a foreign word of the type *Kasar/*Kazar, *Gatsar, *Gazr, *Gasar, there is a problem phonetically with assimilating these to the Uyğur word Qasar/ Gesa (EMC/LMC Kat-sat= Kar sar= *Kasar). Khazar language is extinct, while modern Turkic languages still refer to the Caspian Sea as the Khazar Sea. ==Religions== Tengrism might have been the main religion of the Khazars just as the Huns and other Turkic tribes, while Abrahamic religions were popular as well. The Khazar ruling class is said to have converted to Judaism in the 8th century.2007a ==Language== No known records of the Khazar language have survived. The state was polyglot and polyethnic..'there must have been many different ethnic groups within the Khazar realm ... These groups spoke different languages, some of them no doubt belonging to the Indo-European or different Caucasian language families.'. The high chancery official of the Abbasid Caliphate under Al-Wathiq, Sallām the interpreter (Sallam al-tardjuman), famous for his reputed mastery of thirty languages, might have been both Jewish and a Khazar. referring to. The ruling elite probably spoke an eastern dialect of Shaz Turkic. The ordinary people may have spoken Lir Turkic, such as Oğuric, Bulğaric, Chuvash, and Hunnish. The Persian historian al-Iṣṭakhrī said that the Khazar language was different from any other known language..'Oğuric Turkic, spoken by many of the subject tribes, doubtless, was one of the linguae francae of the state. Alano-As was also widely spoken. Eastern Common Turkic, the language of the royal house and its core tribes, in all likelihood remained the language of the ruling elite in the same way that Mongol continued to be used by the rulers of the Golden Horde, alongside of the Qipčaq Turkic speech spoken by the bulk of the Turkic tribesmen that constituted the military force of this part of the Činggisid empire. Similarity, Oğuric, like Qipčaq Turkic in the Jočid realm, functioned as one of the languages of government.'. al-Iṣṭakhrī 's account however then contradicts itself by likening the language to Bulğaric. After some Khazars became Jewish, they may have written in the Hebrew alphabet.: Ibn al-Nadīm commenting on script systems in 987 ‒ 8 recorded that the Khazars wrote in Hebrew. Though they spoke a Türkic language, they might have also spoken Hebrew.: \"The chancellery of the Jewish state of the Khazars is therefore also likely to have used Hebrew writing even if the official language was a Turkic one.\" ==History== ===Origin=== They appear to have come from Mongolia (蒙古) or northern China after the Xiōngnú (Huns) were defeated by Han dynasty (漢朝) of China (Han–Xiongnu war). The tribes probably had Iranian,; note that Dieter Ludwig, in his doctoral thesis Struktur und Gesellschaft des Chazaren-Reiches im Licht der schriftlichen Quellen, (Münster,1982) suggested that the Khazars were Turkic members of the Hephthalite Empire, where the lingua franca consisted of a variety of Iranian. proto-Mongolic, Uralic and Palaeo- Siberians. The Turkic tribes might have conquered the Western Eurasian steppe as early as 463. In 552, they conquered the Rouran Khaganate (柔然汗國) and moved westwards, taking more people from Sogdia. The ruling family might have come from the Āshǐnà (阿史那) clan of the West Türkic (西突厥) tribes. The Chinese and Arabic records are almost identical, indicating strong support for this theory. The leader might have been associated with Yǐpíshèkuì (乙毗射匱). He died around 651. Moving west, the Khazars reached Akatziroi,. In this view, the name Khazar would derive from a hypothetical *Aq Qasar. one of the important friends of Byzantium fighting Attila's army. ===Khazaria=== Khazaria is said to have emerged after 630., citing also It is said to have come from the Göktürk Qağanate following their defeat by the Tang Dynasty (唐朝) between 630 and 650. The Göktürk armies conquered Volga by 549. The Āshǐnà clan whose tribal name was 'Türk' (the strong one) arrived in 552. They overthrew the Rourans and created the Göktürk Qağanate.. The word Türk, Whittow adds, had no strict ethnic meaning at the time: 'Throughout the early middle ages on the Eurasian steppes, the term 'Turk' may or may not imply membership of the ethnic group of Turkic peoples, but it does always mean at least some awareness and acceptance of the traditions and ideology of the Gök Türk empire, and a share, however distant, in the political and cultural inheritance of that state.' ====War with Tang Dynasty==== The Chinese Tang Dynasty defeated the Turkic Qağanate and set up the Anxi protectorate (安西都護府) in Central Asia. The Khaganate split into several tribes. The Duōlù (咄陸) were the left wing of the On Oq, the Nǔshībì (弩失畢: *Nu Šad(a)pit), and together they were registered in ancient Chinese sources as ten names (shí míng: 十名). Some tribes went west to the Sea of Azov area. Ashina and the Khazars went further west. In 657, General Sū Dìngfāng (蘇定方) dominated the Turks and Central Asia. They imposed Chinese overlordship to the east of those Turkic tribes. In 659 the Chinese defeated the remaining tribes. The Khazars did not dare return. ====War with Bulgars==== Instead, the Khazars defeated the Bulgars further west. The Khazars Khaganate was then founded from the ruins of a nomadic empire destroyed by the Tang armies to the east, becoming the westernmost successor state of the Göktürks. ====Later conquests==== The Khazars conquered the lower Volga region and the area between the Danube and the Dniepr. In 670, they also conquered the Onoğur-Bulğar union and made the Onogur-Bulgar language the official language of the empire. ===Khazar Empire=== The empire is sometimes called steppe Atlantis (stepnaja Atlantida, Cyrillic: Степная Атлантида). Historians often refer to this period as Pax Khazarica. The state became an international center of trade. Ibn al-Balḫî wrote in Fârsnâma (c. 1100) that the Sasanian Shah (ruler), Ḫusraw 1, Anûsîrvân, said there were three kings who had as much power as he did: the King of China, the King of Byzantium, and the king of the Khazars. ==Modern period== Despite the disappearance of the Khazars from history, conspiracy theories about the Cossacks, Muslim Kumyks, Kazakhs and European Jews having descended from the Khazars are widely circulated. * * * Most scholars disagree with such theories. * * * : \"Most scholars are sceptical about the hypothesis (that has its roots in the late 19th century) that Khazars became a major component in the ethnogenesis of the Ashkenazic Jews.\" * Particularly, the theory that \"European Jews descended from the Khazars\" is commonly known as the Khazar myth, which is by now a disproven antisemitic conspiracy theory.* * * * * Rory Miller(2020) The anti-Zionist ‘Jewish Khazar’ syndrome in the official British mind Decades of peer-reviewed genetic studies have found no scientific evidence for the Khazar myth. * , Hum Mutat 24:248–260, 2004. * * Behar, Doron M.; et al.: \"The genome-wide structure of the Jewish people\". Nature, 2010. * * Rubin, Rita. \"Jews a Race' Genetic Theory Comes Under Fierce Attack by DNA Expert\". The Forward, 7 May 2013. * * * Yet, the Khazar myth is still widely promoted by far-right groups, including but not limited to the KKK,.'The formative period of Christian Identity could roughly be said to be the three decades between 1940 and 1970. Through missionaries like Wesley Swift, Bertrand Comparet and William Potter Gale, it took on a white racialist, anti-Semitic, anti-Communist and far-right conservative political outlook. Combined with the teachings of early disciples Richard G. Butler, Colonel Jack Mohr and James K. Warner, a distinctly racist theology was gradually formed. Whites were said to be the Adamic people, created in His likeness. A notion of a pre-earthly existence is found in an important substratum, teaching that whites either had a spiritual or extraterrestrial pre-existence. Blacks were either pre-Adamic soulless creatures or represented fallen, evil spirits, but they were not the chief target of fear and hatred. This position was reserved for Jews. The latent anti-Semitism found in British-Israelism rose to prominence. Jews were, at best, reduced to mongrelized imposters, not infrequently identified with Eurasian Khazars without any legitimate claim to a closeness with God, and at worst denounced as the offspring of Satan.' Neo-Nazis, Arab nationalists,: \"Arab anti-Semitism might have been expected to be free from the idea of racial odium, since Jews and Arabs are both regarded by race theory as Semites, but the odium is directed, not against the Semitic race, but against the Jews as a historical group. The main idea is that the Jews, racially, are a mongrel community, most of them being not Semites, but of Khazar and European origin.\" This essay was translated from Harkabi Hebrew text 'Arab Antisemitism' in Shmuel Ettinger, Continuity and Discontinuity in Antisemitism (Hebrew), 1968, p.50. the Nation of Islam (NOI) * * * * * * * and the Black Hebrew Israelite (BHI) movement, * * * * * with a substantial degree of influence in Western academia. ==Related pages== * Bulgars * Kipchaks * Scythians * Seljuk Empire * Ottoman Empire ==References== Category:Caucasus Category:Turkic peoples Category:Nomadic people Category:History of Asia Category:History of Europe Category:Ethnic groups in Asia Category:Ethnic groups in Russia Category:Ethnic groups in Europe Category:960s disestablishments Category:Former countries in Asia Category:Former monarchies of Asia Category:Former countries in Europe Category:Former monarchies of Europe Category:650s establishments",
 "title": "Khazars"
}