{
 "id": "705359",
 "text": "Han Buddhism () or Chinese buddhism refers to Buddhism written in Chinese characters (hanzi) or that of the East Asian cultural sphere. It is one of the three main existing schools of Buddhism: the other two are Tibetan Buddhism and Theravada. It is mainly practiced in China, Japan, Korea, and Vietnam. It has had a great impact on East Asian culture. Like Tibetan Buddhism, Han Buddhism comes from Mahayana, the branch of Buddhism written mainly in Sanskrit and from northern Gandhara (modern-day Pakistan). Han Buddhism has a lot of interaction between Buddhism and Taoism. == History == There are legends that Laozi was the Buddha himself, or that the Buddha came from the Tibetan kingdom of Zhangzhung. There are other legends that Buddhism had existed in China since ancient times (before the Qin dynasty). === Qin dynasty (221–206 bc) === The Shiji 《史記·秦始皇本紀》has a section called「禁不得祠」(jin bude ci). It says: “徙謫，實之初縣。禁不得祠。明星出西方。”《史記·秦始皇本紀》：“三十三年，發諸嘗逋亡人、贅婿、賈人略取陸梁地，為桂林、象郡、南海，以適遣戍。西北斥逐匈奴。自榆中並河以東，屬之陰山，以為十四縣，城河上為塞。又使蒙恬渡河取高闕、山、北假中，築亭障以逐戎人。徙謫，實之初縣。禁不得祠。明星出西方。” In the 20th century, Japanese scholar Fujita Toyohachi (藤田丰八) said Buddhism entered China during the Qin dynasty. The word 不得 (pinyin: \"bude\"; rough pronunciation: boo-duh) is pronounced nearly exactly like the Sanskrit word \"Buddha\". It was used to write down Buddha in the Chinese language. Others (like 铃木券太郎) disagreed.《爾雅》釋詁：“禋，祀，祠，烝，嘗，禴，祭也。” 釋天：“春祭曰祠，夏祭曰礿，秋祭曰嘗，冬祭曰蒸，……。” 《說文解字》：“春祭曰祠。品物少，多文詞也。从示司聲。(《禮記》月令)仲春之月，祠不用犧牲，用圭璧及皮幣。” 《史記》陳涉世家：“又間令吳廣之次所旁叢祠中，夜篝火，狐鳴呼曰「大楚興，陳勝王」。” 《漢書》宣帝紀：“修興泰一、五帝、後士之祠，祈為百姓蒙祉福。” Moreover it is unlikely 得 would be used to transliterate. And based on the evolution of Chinese tones, 不得 would sound something like putug (郑张尚芳 says “不得” is [pɯtɯːɡ]). === Han Dynasty (206 bc–220 ce) === It is generally believed Buddhism was introduced during the (Western, before 1 BC) Han dynasty. It came from the western regions and Silk Road. According to the Weilüe《魏略‧西戎傳》、《魏書‧釋老志》and other records, Emperor Ai of Han's men gave the people the Pagoda Sutra《浮屠经》。 In 67, Emperor Ming of Han dreamed of the \"Golden People\". He sent people to meet monks in the western regions. These monks brought back more Buddhist texts. He built the White horse temple (白马寺) and translated 42 chapters of the scripture 《四十二章經》。梁代慧皎《高僧傳》記載此事：“漢明帝夢一金人於殿廷，以佔所夢，傅毅以佛對。帝遣郎中蔡愔、博士弟子秦景等往天竺。愔等於彼遇見摩騰、竺法蘭二梵僧，乃要還漢地，譯《四十二章經》，二僧住處，今雒陽門白馬寺也。” There is one account that Emperor Ming of Han (28–75 CE) helped introduce Buddhism into China. The (3rd - 5th century) Mouzi Lihuolun says:Ming then sent people to Tianzhu (Southern India) to learn more.Hill (2009), p. 31. Buddhist scriptures returned to China on the backs of white horses, after which White Horse Temple was named. Two Indian monks also returned with them, named Dharmaratna and Kaśyapa Mātaṅga. Whether Emperor Ming actually dreamed of Golden people is debated. However scholars agree that around his time Buddhism arrived from the xiyu. A Parthian prince named An Shigao traveled to China and helped translate some Indian texts into Chinese. In 167 some Yuezhi (tribes of Central Asia) also helped translate some stuff. During this time, Mahayana Buddhism became popular in China. The Han would then \"sinicize\" it to turn it into Han Buddhism. In Chongqing an ancient Yao Qian Shu (money tree artifact) was dug up. A Buddha was sitting on it. It said it was made in the fourth year of Yan guang (125 CE). This is the earliest known bronze Buddha found in China. There is another early Buddha sculpture in Sichuan above a grave.唐長壽. 《樂山麻浩、柿子灣崖墓佛像年代新探》. 東南文化. 1989年, (2期): 13 ==== Early Buddhist schools ==== The Sarvastivadinns, Dharmaguptakas, and other schools were important for Han Buddhism. === Six Dynasties (220–589) === Some Chinese thought Buddhism was harmful to the authority of the government, that Buddhists did help improve the economy, that Buddhism was barbaric and did not deserve to be part of Chinese culture.Bentley, Jerry. Old World Encounters: Cross-Cultural Contacts and Exchanges in Pre-Modern Times 1993. p. 82 However, others mixed Buddhism with Taoism. The two went well together. Both encourage meditation. And so Buddhist ideas were used in Taoism and vice versa.Oh, Kang- nam (2000). The Taoist Influence on Hua-yen Buddhism: A Case of the Sinicization of Buddhism in China. Chung-Hwa Buddhist Journal, No. 13, (2000). Source: (accessed: January 28, 2008) p.286 Further discussion of can be found in T'ang, Yung-t'ung, \"On 'Ko-I',\" in Inge et al. (eds.): Radhakrishnan: Comparative Studies in Philosophy Presented in Honour of His Sixtieth Birthday (London: Allen and Unwin, 1951) pp. 276–286 (cited in K. Ch'en, pp. 68 f.) Around this time, Han Buddhism began spreading to Korea, Japan, and Vietnam. It was already popular in South China. ==== Kumārajīva (334–413) ==== China controlled Kucha, a Buddhist kingdom in Xinjiang. They imprisoned Kumarajiva but released him in 401 because he was good at Buddhism. He became influential in Han Buddhism. Emperor Yao Xing of the state of Later Qin liked him. He made a number of good translations (from AD 402–413). This includes the Diamond Sutra, the Amitabha Sutra, the Lotus Sutra, the Vimalakīrti Nirdeśa Sūtra, the Mūlamadhyamakakārikā, and the Aṣṭasāhasrikā Prajñāpāramitā Sūtra. ==== Chán Buddhism ==== In the 5th century, the Chán (Zen) teachings began in China. Bodhidharma, a legend, started it. The school follows the Laṅkāvatāra Sūtra and Diamond Sūtra (Vajracchedikā Prajñāpāramitā Sūtra) . It was also called the \"One Vehicle School.\"The Platform Sutra of the Sixth Patriarch, translated with notes by Philip B. Yampolsky, 1967, Columbia University Press, , page 29, note 87 They were famous for their encounter stories and koans and their teaching methods. Nan Huai-Chin says: === Tang Dynasty (618–907) === ==== Xuanzang's journey to the west ==== During the Tang dynasty and 629 - 645, the monk Xuanzang went to India and visited over one hundred kingdoms. He and wrote about his journey to the west. His writing is important for studying India during this period of time. He visited many spiritual sites, many spiritual people, and learned a lot of spiritual things. He met Buddhist celebrities. He returned to China with 657 Sanskrit texts, gifts, statues, and Buddhist souvenirs, all on twenty-two horses.Jerry Bentley, \"Old World Encounters: Cross-Cultural Contacts and Exchanges in Pre-Modern Times\" (New York: Oxford University Press, 1993), 81. Xuanzang created a translation center in Chang'an (now Xi'an). It attracted people from all over East Asia. Xuanzang translated 1,330 books into Chinese. His favorite part of Buddhism was Yogācāra, or \"Consciousness-only\". During this time, Han Chan Buddhism became popular in Japan. === Song Dynasty (960–1279) === During the Song dynasty, Chán (禪) was used by the government to strengthen its control over the country. Chán became the most popular type of Chinese Buddhism. === Yuan Dynasty (1279–1368) === During the Yuan dynasty, the Mongol emperors liked Tibetan Buddhism so they hired Tibetan monks as government officials.Nan Huai- Chin. Basic Buddhism: Exploring Buddhism and Zen. York Beach: Samuel Weiser. 1997. p. 99. This caused corruption. Later the Ming dynasty overthrew the Yuan, and Tibetan lamas no longer influenced the court. === Ming dynasty (1368–1644) === The Chan school was so popular that all monks belonged to it.Stanley Weinstein, \"The Schools of Chinese Buddhism,\" in Kitagawa & Cummings (eds.), Buddhism and Asian History (New York: Macmillan 1987) pp. 257–265, 264. Male and female Chinese buddhists wrote nice poetry during this time. === Qing dynasty (1644–1911) === The Qing supported Tibetan Buddhism.Mullin 2001, p. 358 Around 1900, Buddhists from other Asian countries became interested in Chinese Buddhism. Anagarika Dharmapala visited Shanghai in 1893.Lewis Hodus (1923), Buddhism and Buddhists in China. Chapter IX: Present-Day Buddhism He and other Indians tried to get Chinese to help revive Buddhism in India. Japanese Buddhists also visited China. By this point (and perhaps earlier) China had the most Buddhists in the world. == Teachings == Han Buddhism uses concepts from Buddhism, Confucianism and Taoism. They worship the Buddha and Bodhisattvas by giving food, flowers, etc. They are vegans. They believe in god and hell, life after death and karma. == Related pages == *Neo-Confucianism *Religion in China ==References== Category:Buddhism Buddhism",
 "title": "Han Buddhism"
}