{
 "id": "705391",
 "text": "Slavic paganism describes Slavic pagan beliefs before ChristianisationThere are still modern pagan groups,that practice slavic beliefs Slavs had their own mythology. Sources about Slavs and their beliefs mainly come from the old Ruthenian chronicles and notes of German bishops. A lot of information is in Helmold's Chronica Sclavorum. There's also Chronicle of Thietmar, and the other chronicles, although they are not the only sources of information about Slavs and their beliefs. There's also for example the diary of a Jewish trader of the Slaves - Ibrahim Ibn Jacob. ==Gods and Goddesses== The pantheon of gods in Slavic beliefs was large. Some of the most important are: God/Goddesses God/Goddesses of (specialisation) Dazhbog giver god, providing sun Rod (east slavs only) Creator of world Veles king of the undergrounds stribog son of rerun, god of wind, air and sky. always on the move simargl/semargl god of fire and fertility hors god of the solar disk. moved across sky hid underground at night. Perun god of sky, thunder and war Mokosh goddess of fate and protector of women in childbirth. Some regions had different gods for different concepts. For example, West Slavs (mainly Polabians and Volinians) believed that Svetovid was a creator of the world while eastern ones believed that it was Rod. ==Demons== Slavs had their own demonology. One of the most well-known demons in Slavic beliefs is Baba Yaga, with the appearance of an ugly and deformed woman. Baba Yaga has counterparts in many European beliefs, such as the German Frau Holle and Italian Befana. There are also a lot of similarities with the Greek mythological witch Circe. There are also : * Poroniec, * Utopiec, * Klobuk, * Rarog, * Wilkolak (Werewolf), * Wampir (Vampire) There are just the most important demons ==History== ===Poland=== Polans and other Polish tribes came to the territory of today's Poland, probably in the VIII and IX century, bringing their beliefs on the west. Polans and their beliefs are described in the Primary Chronicle by Ruthenian chronicler Nestor. There are also famous Helmold's Chronica Slavorum and the other chronicles and notes of German bishops, geographs, as well as the old Ruthenian chroniclers and Jewish or Arabian traders of Slavs. The history of paganism as the main religion in Poland ends in the Baptism of Poland in 966, but it is not the end of Slavic paganism. Pagans would not agree to the Christian reforms of Mieszko I and his sons, causing a Pagan Reaction in Poland. There was an uprising of pagans in 1037-1038 (later supressed by Casimir the Restorer). During the uprising, pagans killed priests and destroyed churches. The end of the uprising was not the end of paganism in Poland. Pagans lived in Poland even to the XII century, when the last pagans were Christianised in West Pomerania by bishop Otto from Bamberg and Boleslav III Wrymouth. ===Bohemia=== The beginnings of Czech statehood were in 895, when there was founded the first Czech country ruled by the Premyslid dynasty. It was pagan until 925, when the country was baptized from the hands of east Franks. Pagan elites knew that it would cause moving them away from power and increased Frankish influence. They rebelled against Vaclav, which failed. The leader of the rebellion was his wife - Drahomira. Although she lost the rebellion, there were still elites that resisted the reigns of Vaclav, so the brother of the Duke Boleslav I organised a coup against him. Probably in 935 during the feast, one of the followers of Boleslav, murdered Vaclav and his brother became the Duke of Bohemia. During his reign there were many pagans, many of which were Christianised after his death. It is unknown when the last Czech pagans were Christianised. ===Ruthenia=== The term \"Ruthenia\" can refer to Kievan Rus', Novogrodian Rus', or Volynians and other Ruthenian, east Slavic countries and tribes. Paganism survived among the Eastern Slavs the longest time without being baptized. The baptism of Kievan Rus' by the Byzantines, didn't end Paganism in this country, although it caused paganism to become less popular, and many people didn't admit to practicing Slavic beliefs. Vladimir the Great started the mass baptism of people in Dnieper, which didn't end paganism among people. The family of Vladimir was officially baptized, but still practiced paganism for a long time. There still existed Ruthenian tribes that were pagan, for example Volynians or White Croats. The last pagans survived maybe even to the XIII century. ===Serbia=== White Serbs, a Slavic tribe from White Serbia first settled in an area near Thessaloniki on the Balkans and in the 6th and early 7th century, established the Serbian Principality. The Serbian rulers adopted the Byzantine Rite in 870. Serbians adopted well to the new religion and, unlike in the countries above, there were not any pagan rebellions against Christianity. ==Related pages== * Slavic Native Faith ==Sources== * Helmoldi presbyteri Chronica Slavorum : Helmold, Johann Martin Lappenberg , Georg Heinrich Pertz : Free Download, Borrow, and Streaming : Internet Archive * Full text of \"The Russian Primary Chronicle\" * Chronicon; : Thietmar, von Merseburg, Bishop of Merseburg, 975-1018 : Free Download, Borrow, and Streaming : Internet Archive * * * * https://www.jassa.org/?page_id=10175 == References == Category:Paganism Category:Slavic mythology Category:History of Poland Category:History of Serbia",
 "title": "Slavic paganism"
}