{
 "id": "705360",
 "text": "is a Japanese video game programmer, designer, and producer. He is best known as the former head of Sonic Team, where he was the lead programmer of the original Sonic the Hedgehog series of games on the Sega Genesis. In 2006, he created Prope, an independent game company. In January 2018, he joined Square Enix. == Career == Naka learned how to program by copying and debugging video game code printed in magazines. The experience made him want to study assemblers and practice writing code during his school classes. After graduating high school, Naka decided to skip university and stay in his home town. Around 1983, Naka saw that Sega was looking for programming assistants. He decided to apply. After a short interview, he started working for Sega in April 1984. His first task was designing maps and checking floppy disks for a game called Road Runner for the SF-7000. Naka can't remember if the game was ever released. His first major project was a game called Girl's Garden. He and Hiroshi Kawaguchi created it together as part of their training process. ==Production history== Year Game Role 1984 Girl's Garden Game designer, programmer 1986 Spy vs. Spy (Master System port) Programmer Black Belt 1987 Phantasy Star 1989 Phantasy Star II Ghouls 'n Ghosts (Genesis port) 1991 Sonic the Hedgehog 1992 Sonic the Hedgehog 2 1994 Sonic the Hedgehog 3 Programmer, producer Sonic & Knuckles 1996 Nights into Dreams 1998 Burning Rangers Producer Sonic Adventure 1999 ChuChu Rocket! Director, producer 2000 Samba de Amigo Producer Phantasy Star Online 2001 Sonic Adventure 2 Sonic Advance 2002 Sonic Advance 2 Director, producer 2003 Sonic Pinball Party Producer Billy Hatcher and the Giant Egg Sonic Battle Sonic Heroes 2004 Sonic Advance 3 Puyo Pop Fever 2005 Sakura Wars: So Long, My Love Shadow the Hedgehog Sonic Rush Puyo Pop Fever 2 General producer 2006 Sonic Riders Executive producer Phantasy Star Universe 2008 Let's Tap Producer 2009 Ivy the Kiwi? 2011 Fishing Resort 2013 StreetPass Mansion / Monster Manor 2014 Hi-sCoool! SeHa Girls Voice acting (\"Center-sensei\") 2015 Rodea the Sky Soldier (original Wii version) Producer StreetPass Fishing / Ultimate Angler 2016 StreetPass Chef / Feed Mii 2017 Legend of Coin ==References== == Other websites == * Official Prope website (Japanese) * Sonic Team Speaks (archived by the WaybackMachine) * Sega's Yuji Naka Talks! * Yuji Naka On New Beginnings At His Studio, Prope * Life after Sega: The Sonic creator talks about being free of the hedgehog Category:1965 births Category:Sega people Category:Living people",
 "title": "Yuji Naka"
}