{
 "id": "705488",
 "text": "Fujita Toyohachi (Kanji: 藤田豊八；Hiragana: ふじたとよはち; 19 October 1869 - 15 July 1929) is a Japanese writer and professor in East Asian History. He is from Tokushima Prefecture. His (Chinese) pen name name was Jianfeng / Kenfou (劍峰). He founded a school in Jiangsu, China. He was a teacher at Beijing University (the Imperial University, 京師大學堂), author of Secondary Education East Asian history《中等教育東洋史》and Research on the History of East-West Interactions《東西交涉史之研究（東西交渉史の研究）》。 He collected over 1700 Chinese books. After he died, those were sent to the Toyo Bunko (東洋文庫) and put into a section called Fujita's library「藤田文庫」。 == Life == In 1869, Fujita was born in Awa Province (Tokushima). In 1895, he graduated from the University of Tokyo Liberal arts school with a degree in Chinese language studies. After that he taught the history of Chinese literature at Waseda University, Toyo University, and other schools In 1896, he cofounded the Dongya Xueyuan (東亞學院, East Asia College) with Oyanagi Shigeta and others. Fujita also founded the journal \"Jiangsu Wenxue\"《江湖文學》(Jiangsu Literature). In 1897, he visited Shanghai. In 1898, he helped create the Dongwen Xueshe (東文學社, East Asian literature society) with Luo Zhenyu. After 1904, Cen Chunxuan (岑春煊) governor of Guangxi and Guangdong asked Fujita to help with education. In 1905, he also helped create Suzhou high school (江苏师范学堂). He invited more than 10 teachers from Japan. The Qing dynasty then awarded him a medal. In 1909 Fujita became a professor at the prestigious Beijing University. In 1912, Japan returned to Japan. He lived in Tokyo and researched the history of east–west interactions. In 1920 he got a PhD in literature. In 1923, he was professor at Waseda University. He taught the history of east–west sea transportation and the history of the Western regions (China, Xiyu, modern day Xinjiang). In 1925, he became professor at the imperial Tokyo University and first lecturer on East Asian history. In 1928, he became a professor and Minister of culture and politics at Taibei Imperial University (臺北帝國大學). In May 1929 he returned to Tokyo to give a lecture on the history of the Xiyu again. But in July he died of kidney failure. == Works == * 東洋史 文学社, 1896－97 * 先秦文学 支那文学史稿 東華堂, 1897 * 東洋歴史物語 アルス (日本児童文庫), 1929 * 東西交渉史の研究 南海篇 岡書院, 1932 * 東西交渉の研究 巻上・下(南海篇,西域篇及附篇) 萩原星文館, 1943 == Citations == Category:1929 deaths Category:1869 births Category:People from Tokushima Prefecture Category:Waseda University faculty",
 "title": "Fujita Toyohachi"
}