{
 "id": "705467",
 "text": "Zhangzhung (Tibetan: ཞང་ཞུང; Tibetan pinyin: Xangxang; Chinese: 象雄; pronounced Shangshung) was a kingdom in western Tibet before the 7th century. The religion of Zhangzhung was Bon, and the people are sometimes called Bonpo. The Bon religion influenced Tibet and Tibetan Buddhism. The Zhangzhung are mentioned frequently in Tibetan texts as the original rulers of central and western Tibet. We are still trying to learn more about them. == Location == Zhang Zhung had three different regions: # sGob-ba, the outer; Western Tibet, from Gilgit in the west to Dangs-ra khyung-rdzong in the east, next to lake gNam-mtsho, and from Khotan, Xinjiang in the north to Chu-mig brgyad-cu rtsa- gnyis in the south. # Phug-pa, the inner; The inner region is said to be sTag- gzig (Tazig) [often identified with Bactria, Central Asia. # and Bar-ba, the middle, not yet identified. It was an independent kingdom and covered all of Western Tibet, Baltistan and Ladakh.Karmey, Samten G. (1979). A General Introduction to the History and Doctrines of Bon, p. 180. The Toyo Bunko, Tokyo.Stein, R. A. (1972). Tibetan Civilization. Stanford University Press, Stanford, California. (cloth); . The capital was Khyunglung, the \"Silver Palace of Garuda\", southwest of Mount Kailash, with palaces found in the upper Sutlej Valley.Allen, Charles. (1999). The Search for Shangri-La: A Journey into Tibetan History. Abacus Edition, London. (2000), pp. 266-267; 273-274. . == History == === Iron Age === Scientists dug stuff in the Chang Tang plateau and found iron. These may be the Zhangzhung's iron. === Unification of Tibet === The Tang Annals say that the Tibetan emperor Songtsen Gampo conquered and unified the Zhangzhung. In 634, Yangtong (Zhang Zhung) and various Qiang tribes, \"altogether submitted to him.\" Gampo then united the Yangtong to defeat the 'Azha or Tuyuhun and conquer two more Qiang tribes. He then threatened Songzhou (China) with an army of more than 200,000 men. He then sent gifts of gold and silk to the Tang emperor to marry a princess. At first the Emperor Gaozong of Tang refused so Gampo attacked Songzhou. But Gampo later gave up and apologized so the emperor married him to Princess Wencheng.Lee, Don Y. (1981). The History of Early Relations between China and Tibet: From Chiu t'ang-shu, a documentary survey, pp. 7-9\\. Eastern Press, Bloomington, IN.Pelliot, Paul. (1961). Histoire ancienne du Tibet, pp. 3-4\\. Librairie d'Amérique et d'orient, Paris. == Language == There are some Zhangzhung texts and 11th century bilingual Tibetan documents. The Zhangzhung language was related to Kinnauri, a Sino–Tibetan language. The Bonpo claim that the Tibetan writing system is derived from the Zhangzhung alphabet. However Tibetan script comes from the subcontinent. Non-Bon Tibetan texts agree. == History == Bonpo religion was founded by a Buddha-like person named Tonpa Shenrab Miwoche. Tonpa's teachings are very similar to Gautama Buddha. Bonpos claim that Tonpa lived 18,000 years ago and visited Tibet from the land of Tagzig Olmo Lung Ring. The Bonpo claim that during this time Lord Tonpa's teachings entered the Indian subcontinent and helped develop the Vedic religion (Hinduism). An example of this link between Bon and Hinduism is Mount Kailash, the center of Zhang Zhung culture and also most sacred mountain to Hindus. As a result, the Bonpos claim that Hinduism owes its origin to Tonpa Shenrab Miwoche. == References == Category:Pages with unreviewed translations Category:History of China Category:Former countries in Asia Category:Tibet",
 "title": "Zhangzhung"
}