{
 "id": "705498",
 "text": "The American Indian Wars (also known as the Indian Wars or the First Nations Wars; ) is the name for the various battles that were fought by European, American, and Canadian governments and colonists against various Native American and First Nation tribes. The conflicts happened in North America from the time of the earliest colonial settlements in the 17th century to the 1920s. The various Indian Wars resulted from a wide variety of factors, including cultural differences, land disputes, and crimes committed by both sides. The European powers and their colonies also enlisted Native tribes to help them in their wars against one another's colonial settlements. After the American Revolutionary War, many conflicts were local to specific states or regions. The conflicts were usually about disputes over land use; some had cycles of violent actions. The Royal Proclamation of 1763, which is now part of the Canadian Constitution, banned white settlers from taking the lands of Natives unless treaties were signed with the British Crown. The 11 Numbered Treaties limited the number of conflicts. As settlers went westward across North America after 1780, the size, length, and intensity of conflicts increased between settlers and Native tribes. The most important came during the War of 1812, which resulted in the defeat of major Indian coalitions in the Midwestern and Southern United States that were supported by the British. Conflict with settlers happened less often, and treaties became more common. The Indian Removal Act of 1830 allowed the US government to remove natives from east of the Mississippi River to west of it, which the government believed to be empty American frontier. (Many tribes had a territory in the area, however.) The federal policy of removal was eventually changed in the West to relocating Native tribes to specially-designated and federally- protected reservations. ==Other websites== * Indian Wars National Association * Indian Wars and Pioneers of Texas by John Henry Brown, published 1880, hosted by the Portal to Texas History. * The Indian Wars and African American Soldiers, US Army * Increase Mather, A Brief History of the War with the Indians in New-England, (1676) Online Edition * www.history.com; American- Indian Wars * Highlighting Native Nations in the War of 1812 Category:Wars involving North America Category:History of Native Americans",
 "title": "American Indian Wars"
}