{
 "id": "705508",
 "text": "Nicodemus is an unincorporated community in Graham County, Kansas, United States. The community was created in 1877. it is named after the Biblical figure Nicodemus.Kansas Place-Names, John Rydjord, University of Oklahoma Press, 1972, The Nicodemus National Historic Site is in Nicodemus. The place commemorates the only remaining western town created by African Americans during the Reconstruction Period. During the last weekend of July, former residents and their descendants return for celebrations and parades. In 1976, Nicodemus was named a National Historic Landmark. As of 2018, its First Baptist Church, African Methodist Episcopal Church, and other historic buildings are in bad condition that they cannot be opened to the public. ==Geography== The United States Census Bureau says that the Nicodemus township has an area of 32.4 square miles. The town is along Highway 24 in the Great Plains. ===Climate=== Summer is typically long and hot. Thunderstorms are common during summer. Spring and fall are usually short, while winter is cold. The average precipitation is about 22 inches. ==More reading== * Crockett, Norman I. The Black Towns. Lawrence: Regents Press of Kansas, 1979. * Hamilton, Kenneth Marvin. Black Towns and Profit: Promotion and Development in the Trans-Appalachian West, 1877–1915. Urbana: University of Illinois Press, 1991. * Hamilton, Kenneth Marvin. \"The Origins and Early Promotion of Nicodemus: A Pre-Exodus, All-Black Town.\" Kansas History 5 (winter 1982): 220–242. * Promised Land on the Solomon: Black Settlement at Nicodemus, Kansas. Washington, D.C.: U.S. Department of the Interior, National Park Service, Rocky Mountain Region, n.d. * Schwendemann, Glen. \"Nicodemus: Negro Haven on the Solomon.\" Kansas Historical Quarterly 29 (spring 1963): 10–31. * Shaw, Bill & Daniel Chu. Going home to Nicodemus: The story of an African American frontier town and the pioneers who settled it. Morristown: Silver Burdett Press, 1994. * Shortridge, James R. Peopling the plains: Who Settled Where in Frontier Kansas. Lawrence: University Press of Kansas, 1995 * Athearn, Robert G. In Search Of Canaan: Black Migration to Kansas 1879–80. Lawrence: Regents Press of Kansas, 1978 * Ravage, John W. Black Frontiers: Images of the Black Experience on the North American Frontier. Salt Lake City: University of Utah Press, 1997. ==References== ==Other websites== * Nicodemus National Historic Site * Nicodemus Photo Tour * Kansas State Historical Society, Portrait of Nicodemus * A history of Nicodemus, Graham County, Kansas * Nicodemus: Negro haven on the Solomon - 1971 * 1877 Historic Flyer * Category:Unincorporated communities in Kansas Category:Graham County, Kansas",
 "title": "Nicodemus, Kansas"
}