{
 "id": "705694",
 "text": "Plymouth Congregational Church of Lawrence, Kansas is church that was created in 1854, months after the Territory of Kansas was opened to settlement. The present-day church building was built in 1870, and it is on the National Register of Historic Places. The architect was John G. Haskell. He designed the Kansas State Capitol. ==History== The Territory of Kansas was opened to settlement by the Kansas–Nebraska Act on May 30, 1854. Reverend Samuel Y. Lum of Middletown, New York was sent by the American Home Missionary Society to create a church in the Kansas Territory. This would become the first church in the entire territory. Before he came, sermons were given by laymen. The first service of Plymouth Congregational Church was held by Lum on October 1, 1854 in a mudbrick boarding house. Settlers who had come from New England came to the service. Reverend Richard Cordley became a pastor in 1857. This was when the people moved into its first permanent building, called the \"Stone Church.\" Though the building was not completed until 1862. Cordley was an abolitionist and was a free-stater. During the American Civil War, some members were killed by pro-Confederate soldiers in the Lawrence Massacre of 1863. Cordley's home was burned, but the church building was not hurt. ===The Brick Church=== The present-day building, also called \"The Brick Church,\" was designed by architect John G. Haskell. Haskell also worked on other churches, schools, and the Kansas State Courthouse. Construction started in 1868. It was finished in May 1870. it costed $45,000. The windows were made in England. Services have been held regularly in the building since 1870. The building was added to the National Register of Historic Places on September 2, 2009. The building's architectural style is described as a Victorian-era church building with Gothic and Romanesque Revival characteristics. ==Famous members== * Alan Mulally – The president of the Ford Motor Company said Rev. Dale Turner was \"a mentor and an inspiration.\" ==References== ==Other websites== * Plymouth Congregational Church website * The Lawrence Massacre by Richard Cordley, D.D. (1865) * A History of Lawrence, Kansas by Richard Cordley, D.D. (1895) * Pioneer Days in Kansas by Richard Cordley, D.D. (1903) Category:1854 establishments in Kansas Territory Category:Churches in the United States Category:Buildings and structures in Lawrence, Kansas Category:Lawrence, Kansas Category:National Register of Historic Places in Douglas County, Kansas",
 "title": "Plymouth Congregational Church (Lawrence, Kansas)"
}