{
 "id": "70578",
 "text": "Alkanes are chemical compounds, made of carbon and hydrogen. The simplest alkane is methane, which is made of one carbon atom and four hydrogen atoms. Larger alkanes have two or more carbon atoms connected or bonded together in a chain. The carbon atoms of alkanes are joined together by single bonds, which is what makes them different from alkenes. The alkane's general formula is CnH2n+2. These are some alkanes: * Methane (CH4) * Ethane (C2H6) * Propane (C3H8) * Butane (C4H10) * Pentane (C5H12) * Hexane (C6H14) * Heptane (C7H16) * Octane (C8H18) * Nonane (C9H20) * Decane (C10H22) * Undecane (C11H24) * Dodecane (C12H26) * Tridecane (C13H28) * Tetradecane (C14H30) * Pentadecane (C15H32) * Hexadecane (C16H34) * Heptadecane (C17H36) * Octadecane (C18H38) * Nonadecane (C19H40) * Icosane (C20H42) * Heneicosane (C21H44) * Docosane (C22H46) In an alkane, each carbon atom is sp3-hybridized with 4 sigma bonds (either C–C or C–H), and each hydrogen atom is joined to one of the carbon atoms (in a C–H bond). The longest link of carbon atoms in a molecule is known as its carbon skeleton or carbon backbone. The number of carbon atoms may be thought of as the size of the alkane. The alkanes have two main commercial sources: petroleum (crude oil) and natural gas. An alkyl group is an alkane- based molecular fragment that has one open valence for bonding. They are generally abbreviated with the symbol for any organyl group, R. Although Alk is sometimes used to abbreviate an alkyl group. == Production == Alkanes come from crude oil. Crude oil is a natural resource, a thick black fluid found by drilling underground. Crude oil is a mixture of alkanes of different chain length - composed of different numbers of carbon atoms. It also has laboratory method of production. Fractional distillation is the method used to separate the different hydrocarbons in crude oil, used to get a purer or more distilled, sample of a single alkane. == References ==",
 "title": "Alkane"
}