{
 "id": "706058",
 "text": "The Atchison, Topeka and Santa Fe Railway (often referred to as the Santa Fe or AT&SF;) was a large railroad in the United States. Created in February 1859, the railroad reached the Kansas-Colorado border in 1873 and Pueblo, Colorado, in 1876. To create a demand for its services, the railroad set up real estate offices and sold farm land. Despite the name, its main railroad never served Santa Fe, New Mexico. This was because the terrain was too rough. A branch line from Lamy reached Santa Fe instead. The railroad officially ended on December 31, 1996, when it merged with the Burlington Northern Railroad to form the Burlington Northern and Santa Fe Railway. The Atchison, Topeka & Santa Fe Railway (AT&SF;) was created on February 11, 1859, to join Atchison and Topeka, Kansas, with Santa Fe, New Mexico. In its early years, the railroad helped people settle in Kansas. A lot of its revenue came from wheat grown there and from cattle driven north from Texas to Wichita and Dodge City by September 1872. AT&SF; reached Albuquerque in 1880. Santa Fe (the original goal of the railroad) was on a short branch from Lamy, New Mexico. == Burlington Northern merger == On September 22, 1995, AT&SF; merged with Burlington Northern Railroad to form the Burlington Northern & Santa Fe Railway (BNSF). The two lines kept separate operations until December 31, 1996 when it officially became BNSF. 1870 1945 Gross operating revenue $182,580 $528,080,530 Total track length 62 miles (100 km) 13,115 miles (21,107 km) Freight carried 98,920 tons 59,565,100 tons Passengers carried 33,630 11,264,000 Locomotives owned 6 1,759 Unpowered rolling stock owned 141 81,974 freight cars 1,436 passenger cars :Source: Santa Fe Railroad (1945), Along Your Way, Rand McNally, Chicago, Illinois. Revenue Freight Ton-Miles (Millions) ATSF/GC&SF;/P&SF; Oklahoma City-Ada-Atoka FtWorth & Rio Grande KCM&O;/KCM&O; of Texas Clinton & Oklahoma Western New Mexico Central 1925 13862 14 42 330 2 1 1933 8712 12 18 (incl P&SF;) (incl P&SF;) (incl ATSF) 1944 37603 45 (incl GC&SF;) 1960 36635 20 1970 48328 (merged) Revenue Passenger-Miles (Millions) ATSF/GC&SF;/P&SF; Oklahoma City-Ada-Atoka FtWorth & Rio Grande KCM&O;/KCM&O; of Texas Clinton & Oklahoma Western New Mexico Central 1925 1410 5 6 8 0.1 0.1 1933 555 0.1 0.8 (incl P&SF;) (incl P&SF;) (incl ATSF) 1944 6250 0.2 (incl GC&SF;) 1960 1689 0 1970 727 (merged) ==References== ==More reading== * * * The Cosmopolitan (February 1893), The Atchison Topeka and Santa Fe. Retrieved May 10, 2005. * * ** * * * * Duke, Donald. Fred Harvey, civilizer of the American Southwest (Pregel Press, 1995); The passenger trains stopped for meals at Fred Harvey restaurants. * Dye, Victoria E. All Aboard for Santa Fe: Railway Promotion of the Southwest, 1890s to 1930s (University of New Mexico Press, 2007). * * Frailey, Fred W. (1998). Twilight of the Great Trains, p. 108\\. Waukesha, Wisconsin: Kalmbach Publishing. . * Richard H. Frost, The Railroad and the Pueblo Indians: The Impact of the Atchison, Topeka and Santa fe on the Pueblos of the Rio Grande, 1880-1930. 2016, Salt Lake City: University of Utah Press. * * Goen, Steve Allen (2000). Santa Fe in the Lone Star State * * Marshall, James Leslie. Santa Fe: the railroad that built an empire (1945). * * * Pratt School of Engineering, Duke University (2004), Alumni Profiles: W. John Swartz. Retrieved May 11, 2005. * Santa Fe Railroad (1945), Along Your Way, Rand McNally, Chicago, Illinois. * Santa Fe Railroad (November 29, 1942), Atchison, Topeka and Santa Fe Railway System Time Tables, Rand McNally and Company, Chicago, Illinois. * * Solomon, Brian. Santa Fe Railway (Voyageur Press, 2003). * * Snell, Joseph W. and Don W. Wilson, \"The Birth of the Atchison, Topeka and Santa Fe Railroad,\" (Part One) Kansas Historical Quarterly (1968) 34#2 pp 113–142. online ** Snell, Joseph W. and Don W. Wilson, \"The Birth of the Atchison, Topeka and Santa Fe Railroad,\" (Part Two) Kansas Historical Quarterly (1968) 34#3 pp 325–356 online * ==Other websites== * \"Along Your Way\", 1946 edition * Atchison, Topeka, and Santa Fe photos and other documents on Kansas Memory, the digital portal of the Kansas Historical Society (over 2800 AT&SF; items) * Atchison, Topeka, and Santa Fe Company Records at the Kansas Historical Society, Topeka, Kansas * Russell Crump's Santa Fe Archives — a very extensive set of resources for Santa Fe history. * Santa Fe All-Time Steam Roster * Santa Fe Preserved Locomotives * Santa Fe Preserved Passenger Cars * Santa Fe Railway Historical and Modeling Society official website * \"Diesel Locomotives\" article from the May 18, 1947 issue of Life Magazine featuring the Santa Fe fleet. * James William Steele. Rand, McNally & Co.'s new overland guide to the Pacific Coast. Chicago: Rand, McNally & Co., 1888. Illustrated guide to the Santa Fe trip circa 1888. * Encyclopedia of Oklahoma History and Culture – Atchison, Topeka, and Santa Fe Railway * Atchison, Topeka and Sante Fe Railroad Records at Baker Library Historical Collections, Harvard Business School * Oklahoma Digital Maps: Digital Collections of Oklahoma and Indian Territory Category:Rail transport in the United States Category:Defunct companies of the United States",
 "title": "Atchison, Topeka and Santa Fe Railway"
}