{
 "id": "706410",
 "text": "John Trumbull (; June 6, 1756November 10, 1843) was an American artist during the American Revolutionary War. He created many historical paintings. He has been called The Painter of the Revolution. Trumbull's Declaration of Independence (1817), one of his four paintings which hang in the United States Capitol Rotunda, was used on the reverse the two-dollar bill. ==Early life== Trumbull was born in Lebanon, Connecticut, in 1756. His father was Jonathan Trumbull, and his mother was Faith (née Robinson) Trumbull. His father was the Governor of Connecticut from 1769 to 1784. The young Trumbull entered the 1771 junior class at Harvard College at age fifteen. He graduated in 1773. Due to a childhood accident, Trumbull lost use of one eye. This may have influenced his detailed painting style. ==Revolutionary War== As a soldier in the American Revolutionary War, Trumbull drew plans of the British and American lines and works.Sketch of British and American Lines and Fortifications in Boston Area by John Trumbull , 1775. ==Gallery== ===Historic events=== File:The death of general warren at the battle of bunker hill.jpg|The Death of General Warren at the Battle of Bunker's Hill, June 17, 1775 (event 1775, painted 1786) File:The Death of General Montgomery in the Attack on Quebec December 31 1775.jpeg|The Death of General Montgomery in the Attack on Quebec, December 31, 1775 (event 1775, painted 1786) File:Declaration of Independence (1819), by John Trumbull.jpg|The Declaration of Independence (event 1776, painted 1819) File:The Capture of the Hessians at Trenton December 26 1776.jpeg|The Capture of the Hessians at Trenton, December 26, 1776 (event 1776, painted 1786–1828) File:The Death of General Mercer at the Battle of Princeton January 3 1777.jpeg|The Death of General Mercer at the Battle of Princeton, January 3, 1777 (event 1777, –) File:Surrender of General Burgoyne.jpg|Surrender of General Burgoyne (event 1777, painted 1821) File:Surrender of Lord Cornwallis.jpg|Surrender of Lord Cornwallis (event 1781, painted 1820) File:General George Washington Resigning his Commission.jpg|General George Washington Resigning His Commission (event 1783, painted 1824) File:The Sortie Made by the Garrison of Gibraltar.jpg|The Sortie Made by the Garrison of Gibraltar (1789) ===Portraits=== File:Self Portrait John Trumbull 1777.jpeg|Self-portrait, 1777 File:George Washington MET DT2823.jpg|George Washington, 1780 File:Washington at Verplanck's Point by John Trumbull.jpg|Washington at Verplanck's Point, 1790 File:General George Washington at Trenton by John Trumbull.jpeg|General George Washington at Trenton, 1792 File:George Clinton by John Trumbull 1791.jpg|George Clinton, 1791 File:John Trumbull, Lady in White.jpg|Woman in a white dress in a painting File:Self Portrait by John Trumbull circa 1802.jpeg|Self-portrait, File:Sarah Trumbull with a Spaniel by John Trumbull.jpeg|Mrs Sarah Trumbull with a spaniel 1802 File:Alexander Hamilton A17950.jpg|Alexander Hamilton, 1792 File:Hamilton Trumbull 1792.jpg|Alexander Hamilton, 1792 File:Hamilton Trumbull - 1805.jpg|Alexander Hamilton, 1805 File:Alexander Hamilton by John Trumbull 1832.jpeg|Alexander Hamilton, 1832 ===Miniature portraits/sketches=== File:Israel Putnam by Trumbull - Project Gutenberg eText 17049.png|Israel Putnam, 1790 File:Richard butler.jpg|Richard Butler (general), 1790 File:Charles Cotesworth Pinckney by John Trumbull.jpg|Charles Cotesworth Pinckney, 1791 File:George Wythe by John Trumbull.jpg|George Wythe, 1791 ==Notes== ==References== * * * * * * * ==Other websites== *The Winterthur Library Overview of an archival collection on John Trumbull. *Union List of Artist Names, Getty Vocabularies. ULAN Full Record Display for John Trumbull. Getty Vocabulary Program, Getty Research Institute. Los Angeles, California. *Art and the empire city: New York, 1825–1861, an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on Trumbull (see index) *Guide to the John Trumbull Papers, 1775–1842 * Category:1756 births Category:1843 deaths Category:American artists",
 "title": "John Trumbull"
}