{
 "id": "706507",
 "text": "Ulysses (pronounced ) is a city in and the county seat of Grant County, Kansas, United States. It is named after Ulysses S. Grant, the 18th President of the United States. In 2020, 5,788 people lived there. ==History== In 1831, south of the future site of Ulysses, Kansas, (at that time, it was a part of Northern Mexico Territory), explorer Jedediah Smith was killed by Comanche warriors. This was on May 27, 1831. The first Ulysses town was created in June 1885. It was about two miles east of present-day Ulysses. About six weeks later Ulysses' first newspaper, The Grant County Register, started publishing.Ulysses 1885-1909 From Boom to Bust; compiled by The Historic Adobe Museum Staff of Ulysses, Kansas; 2009. ==Geography== Ulysses is at (37.580055, -101.357532). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== ==People== ===2020 census=== In 2020, there were 5,788 people, 2,084 households, and 1,487 families living in Ulysses. Of the households, 71.6% owned their home and 28.4% rented their home. The median age was 33.7 years. Of the people, 53.9% were White, 2.0% were Native American, 0.2% were Asian, 0.1% were Black, 0.1% were Pacific Islanders, 23.1% were from some other race, and 20.6% were two or more races. Hispanic or Latino of any race were 57.4% of the people. ===2010 census=== In 2010, there were 6,161 people, 2,140 households, and 1,618 families living in Ulysses. ==Transportation== ===Roads=== U.S. Route 160 goes West to east though Ulysses. It goes across the state of Kansas. K-25 (Kansas highway) goes north to south through the city and the state of Kansas. ===Air=== Ulysses airport (KULS) is in the county. It has a 6,000 ft. x 100' north south (35-17) runway and a second 4'600 x 60' runway (12-30). ==Media== ===Television=== Ulysses is in the Wichita-Hutchinson, Kansas television market. ==References== ==Other websites== ;City * City of Ulysses * Ulysses - Directory of Public Officials ;Schools * Ulysses USD 214 ;Maps * Ulysses City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas",
 "title": "Ulysses, Kansas"
}