{
 "id": "706600",
 "text": "The Sevastopol Naval Base is a naval base located in Sevastopol, Crimea. It the main base of Russian Navy's Black Sea Fleet. ==Geography== The base is located in theadministrative territory of Sevastopol. It has several places for ships to dock which includes: * Severnaya (; ) * Yuzhnaya (; ) * Karantinnaya (; ) ==History== Work to build the port was started in 1772. At the time, the Russo-Turkish War (1768–1774) was happening. Russia had annexed Crimea, and finished the port in 1783. On 13 May 1783, the first eleven ships of the Imperial Russian Navy reached the Sevastopol Bay. In the Crimean War (1853–1856), all large ships were sunk on purpose in the entrance to the bay. This was done to stop enemy ships from being able to enter the bay. The city defended itself for 349 days against France, the United Kingdom, the Ottoman Empire and Piedmont-Sardinia. On 9 September 1855 the Russians left Sevastopol. During World War I, the German army took over Sevastopol on 1 May 1918. Later, a few ships from the Black Sea Fleet were sunk by their crews. During World War II, the Black Sea Fleet of the Soviet Navy was at first able to defend against Nazi Germany. However, after the city defended itself for 250 days, Sevastopol fell to the Germans on 4 July 1942. After the dissolution of the Soviet Union at the end of 1991, Sevastopol became part of Ukraine. Russia made a treaty with Ukraine to use the base for the Russian Navy. In order to do so, Russia paid an annual amount to Ukraine. Since the Russia took over Crimea in 2014, the base is under Russian control. ==Gallery== File:First map of Sevastopol Bay by Ivan Baturin 1773.jpg|The first map of the Akhtiar (Sevastopol) Bay, created by navigator Ivan Baturin and his team, 1773. File:Ivan Constantinovich Aivazovsky - The Russian Squadron on the Sebastopol Roads.jpg|The Russian Squadron on the Sebastopol Roads (1846), by Ivan Aivazovsky. File:1904 Sevastopol.png|Map of Sevastopol, 1904. File:Sebastopol vers 1905 photo couleur.jpg|Color view of part of the port, 1905. File:Port-Sevastopol1918.jpg|Aerial view of the port, August 1918. File:Aleksandrovets&Muromets2005Sevastopol.jpg;|Russian ships in Sevastopol, 2005. File:Ivanovets R-334 and 962 project 12417 2008 G1.jpg|Russian ships in Sevastopol, 2008. File:418 дивизион тральщиков 68-ой бригады кораблей ОВР. Севастополь. Крым. Россия. Май 2015 - panoramio.jpg|Russian ships in Sevastopol, 2015. ==References== ==Other websites== * Photos Black Fleet Category:Military of Russia Category:Military of Ukraine Category:History of the Soviet Union Category:18th-century establishments in the Russian Empire Category:21st century in Ukraine Category:Ports and harbours of Europe",
 "title": "Sevastopol Naval Base"
}