{
 "id": "706893",
 "text": "The following is a list of deaths that should be noted in August 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==August== ===1=== *Gordon Brand Jnr, 60, Scottish golfer.Former Ryder Cup player Brand Jr. dies at age 60 *Puși Dinulescu, 76, Romanian novelist (Îngerul contabil) and movie director (Întâlnirea din Pământuri), heart attack.Dramaturgul şi regizorul Puşi Dinulescu a murit la vârsta de 76 de ani *Ian Gibbons, 67, English keyboardist (The Kinks), bladder cancer. *Sadou Hayatou, 77, Cameroonian politician, Prime Minister (1991–1992).Décès de Sadou Hayatou, ancien Premier Ministre du Cameroun *Saoirse Kennedy Hill, 22, American essayist and activist, granddaughter of Robert F. Kennedy, suspected drug overdose.Saoirse Kennedy Hill's Death Adds to Family's Tragic History *Annemarie Huber-Hotz, 70, Swiss politician, Federal Chancellor (2000–2007) and President of the Swiss Red Cross (since 2011), heart attack.È morta Annemarie Huber-Hotz *D. A. Pennebaker, 94, American documentary filmmaker (Dont Look Back, Monterey Pop, Ziggy Stardust and the Spiders from Mars).D.A. Pennebaker, Master Director of Documentaries, Dies at 94 *Milovan Minja Prelević, 49, Montenegrin football player (Budućnost, OFK Beograd) and manager (Hangzhou Wuyue Qiantang).Iznenada preminuo trener Milovan Prelević *Harley Race, 76, American Hall of Fame professional wrestler (AWA, CSW) and trainer (Harley Race's Wrestling Academy), lung cancer.Hall of fame wrestling legend Harley Race, an eight-time NWA champion, dies at 76 *Anders P. Ravn, 71, Danish computer scientist.Anders Peter Ravn ===2=== *Vahakn Dadrian, 93, Armenian-American sociologist and historian.Breaking News: The dean of Armenian Genocide studies, Prof. Dr. Vahakn Dadrian has just passed away *Deepak Obhrai, 69, Canadian politician, MP (since 1997), liver cancer.Conservative MP Deepak Obhra dies of cancer *Schoschana Rabinovici, 86, French-born Lithuanian-Israeli Holocaust survivor and writer.Zum Tod von Schoschana Rabinovici *Jocelyne Roy-Vienneau, 63, Canadian politician, Lieutenant Governor of New Brunswick (since 2014), cancer.New Brunswick's lieutenant-governor dies after battle with cancer *Alexandra Strelchenko, 82, Russian folk singer, People's Artist of the RSFSR (1984).Умерла певица Александра Стрельченко ===3=== *Miklós Ambrus, 86, Hungarian water polo player, Olympic champion (1964).Meghalt Ambrus Miklós olimpiai bajnok vízilabdázó *Jean-Claude Bouttier, 74, French boxer and actor (Les Uns et les Autres).Jean-Claude Bouttier est mort à 74 ans *Cliff Branch, 71, American football player (Oakland Raiders).Former Raiders receiver Cliff Branch dies at 71 *Sir Brian Lochore, 78, New Zealand Hall of Fame rugby union player and coach (national team, Wairarapa-Bush), bowel cancer.Former All Blacks captain and coach Sir Brian Lochore dies following cancer battle *Thomas Remengesau Sr., 89, Palauan politician, President (1988–1989) and Vice President (1985–1988).Former Palau president dies at age 89 *John Philip Saklil, 59, Indonesian Roman Catholic prelate, Bishop of Timika (since 2003).Uskup Timika John Saklil meninggal dunia *Mike Troy, 78, American swimmer, Olympic champion (1960), world-record holder – 200m butterfly (1959–1960).1960 US Olympic Gold Medalist Mike Troy Dies at 78 ===4=== *Ernie Bowman, 84, American baseball player (San Francisco Giants).Former Major League player Bowman dead at 84 *Connor Stephen Betts, 24, American mass murderer, perpetrator of the Dayton shooting, shot.Dayton shooting: What we know about the gunman *Nuon Chea, 93, Cambodian politician, Acting Prime Minister (1976) and chief ideologist of Khmer Rouge, sepsis.Nuon Chea, ideologue of Cambodia's Khmer Rouge, dies at 93 *André Goosse, 93, Belgian grammarian (Le Bon Usage).Le grammairien belge André Goosse est décédé à l’âge de 93 ans *Stu Rosen, 80, American voice director (Hulk Hogan's Rock 'n' Wrestling, The Legend of Prince Valiant) and actor (Fraggle Rock: The Animated Series), cancer.Stu Rosen Dies: Emmy Winning 'Dusty's Treehouse' Creator, 'Fraggle Rock' Voice Actor Was 80 *Willi Tokarev, 84, Russian-American singer-songwriter (\"Murmanchanochka\"), cancer. *Bob Wilber, 91, American jazz clarinetist and bandleader.Jazz Revival Clarinetist Bob Wilber has Died ===5=== *Josef Kadraba, 85, Czech footballer (Sparta Prague, Slavia Prague, national team).Fotbalový svět opustil Josef Kadraba, vicemistr světa z Chile 1962 *Bjorg Lambrecht, 22, Belgian racing cyclist, race crash.Bjorg Lambrecht dies at age 22 *Asif Mohseni, 84, Afghani religious leader (marja') and politician, founder of the Islamic Movement of Afghanistan.Well-Known Cleric Sheikh Asif Mohseni Passes Away *Toni Morrison, 88, American writer (The Bluest Eye, Song of Solomon, Beloved), Pulitzer Prize for Fiction winner (1988) and Nobel Prize in Literature winner (1993), problems caused by pneumonia.Beloved Author Toni Morrison Has Died at 88 ===6=== *Alejandro Serrano, 86, Ecuadorian politician, Vice President (2005–2007), problems caused by surgery.Falleció el exvicepresidente Alejandro Serrano Aguilar *Sushma Swaraj, 67, Indian politician, MP (1996–1999, 2009–2019), Chief Minister of Delhi (1998) and Minister of External Affairs (2014–2019), heart attack.BJP Leader And Former Foreign Minister Sushma Swaraj Dies At 67 *Maimun Zubair, 90, Indonesian Nahdlatul Ulama Islamic cleric and politician, member of the People's Consultative Assembly (1987–1999).Senior NU cleric Maimun Zubair passes away ===7=== *David Berman, 52, American singer-songwriter (The Silver Jews, Purple Mountains) and poet (Actual Air), suicide by hanging.David Berman (Silver Jews, Purple Mountains) Dead at 52 *Chris Birch, 68, American politician and engineer, member of the Alaska House of Representatives (2017–2019) and Senate (since 2019), aortic dissection.Anchorage state Sen. Chris Birch dies at 68 *Kary Mullis, 74, American biochemist, creator of the polymerase chain reaction and Nobel Prize in Chemistry winner (1993), pneumonia.Dreher High School grad who revolutionized DNA has died *Rostislav Rybakov, 81, Russian writer, President of the Institute of Oriental Studies of the Russian Academy of Sciences (2006–2008).Ушёл из жизни Ростислав Борисович Рыбаков *Fabio Zerpa, 90, Uruguayan parapsychologist, ufologist and journalist (El Quinto Hombre).Murió Fabio Zerpa ===8=== *Ernie Colón, 88, American comic book artist (Arak, Casper the Friendly Ghost, Richie Rich), colon cancer.Comic Book Creator Ernie Colón Dies at 88 *Stanisław Konturek, 87, Polish physiologist and gastroenterologist, member of the Polish Academy of Sciences (since 1986).Nie żyje prof. Konturek, wybitny fizjolog i gastroenterolog *Mazhar Krasniqi, 87, Yugoslav-born New Zealand Muslim community activist, President of the Federation of Islamic Associations of New Zealand (1979–1981).Mazhar Krasniqi, 'a real kaumatua' of New Zealand Muslim community, passes away *Manfred Max-Neef, 86, Chilean economist (Fundamental human needs) and politician, Right Livelihood Award winner (1983) and presidential candidate (1993).Fallece el destacado ecologista Manfred Max Neef *Jean-Pierre Mocky, 86, French movie director (Les Dragueurs, The Miracle), screenwriter and actor (The Abandoned), kidney failure.Le réalisateur Jean-Pierre Mocky est mort *Dave Parks, 77, American football player (New Orleans Saints, San Francisco 49ers, Houston Oilers) and businessman. *Fabrizio Saccomanni, 76, Italian politician and economist, Minister of Economy and Finance (2013–2014) and Director General of the Bank of Italy (2006–2013), heart attack.Morto Saccomanni, presidente di Unicredit ===9=== *Paul Findley, 98, American politician, member of the U.S. House of Representatives from Illinois's 20th congressional district (1961–1983), congestive heart failure.Former US Rep. Paul Findley of Illinois dies at age 98 *Altair Gomes de Figueiredo, 81, Brazilian footballer (Fluminense, national team) and manager.Campeão do mundo em 62, 'melhor marcador de Garrincha' e ídolo do Fluminense, Altair morre aos 81 *Fahrudin Jusufi, 79, Yugoslavian footballer (Partizan, Eintracht Frankfurt, national team) and manager.Preminuo Fahrudin Jusufi, legendarni član \"Partizanovih beba\" *Oscar Malbernat, 75, Argentine footballer (Estudiantes, national team) and manager (Audax Italiano), kidney failure.Murió Cacho Malbernat, una gloria con el estilo de la mejor época de Estudiantes ===10=== *Jeffrey Epstein, 66, American financier (Bear Stearns), philanthropist (Jeffrey Epstein VI Foundation) and convicted sex offender, suicide by hanging.Jeffrey Epstein Dead in Suicide at Manhattan Jail, Officials Say *Jim Forbes, 95, Australian politician, MP (1956–1975), Minister for the Army (1963–1966), Navy (1963–1964), Health (1966–1971) and Immigration (1971–1972). *Cándido Sibilio, 60, Dominican-born Spanish Olympic basketball player (1980), problems caused by diabetes.Fallece el exjugador de baloncesto 'Chicho' Sibilo *Piero Tosi, 92, Italian costume designer (Senso, Yesterday, Today and Tomorrow, The Night Porter), Honorary Oscar winner (2013).Morto il costumista Piero Tosi ===11=== *Bluey Adams, 84, Australian football player (Melbourne), cancer.Man behind game’s ‘:9#5 brutal collision’ loses battle with cancer *Darryl Drake, 62, American football player (Washington Redskins) and wide receiver coach (Chicago Bears, Arizona Cardinals).Pittsburgh Steelers wide receivers coach Darryl Drake dies at 62 *Michael E. Krauss, 84, American linguist, founder of the Alaska Native Language Center.Celebrated linguist of Alaska Native Languages Michael Krauss dies *Ningali Lawford, 52, Australian actress (Bran Nue Dae, Last Cab to Darwin), asthma attack.Broome actress Ningali Lawford-Wolf dies in UK *Barbara March, 65, Canadian actress (Star Trek), cancer.Barbara March, TNG, DS9's Klingon Lursa, passes away *Walter Martínez, 37, Honduran footballer (Victoria, Beijing Guoan, national team), heart attack.Falleció el ex seleccionado hondureño Walter Pery Martínez *J. Neil Schulman, 66, American novelist (Alongside Night, The Rainbow Cadenza), pulmonary embolism.J. Neil Schulman (1953-2019) ===12=== *DJ Arafat, 33, Ivorian disc jockey and musician, motorcycle crash.DJ Arafat: Top Ivory Coast singer dies in road accident *José Luis Brown, 62, Argentinian footballer (Estudiantes de la Plata, national team) and manager (Ferro Oeste), World Cup winner (1986), problems caused by Alzheimer's disease.Adiós al Tata Brown, un campeón del mundo *Florin Halagian, 80, Romanian football player (Dinamo București) and manager (Argeș Pitești, national team).Doliu în fotbalul românesc! A murit Florin Halagian! *Reuven Hammer, 86, American-Israeli conservative rabbi and journalist (The Jerusalem Post), brain cancer.Beacon of Masorti Judaism, Rabbi Reuven Hammer, dies at 86 *Lu Yonggen, 88, Chinese agronomist and plant geneticist, President of South China Agricultural University (1983–1995) and member of the Chinese Academy of Sciences (since 1993).卢永根院士逝世 生于香港曾获感动中国2017年度人物 *Jim Marsh, 73, American basketball player (Portland Trail Blazers) and broadcaster (Seattle SuperSonics), Parkinson's disease.Former Sonics broadcaster, Seattle youth-basketball legend Jim Marsh dies at 73 *Paule Marshall, 90, American writer (Brown Girl, Brownstones, Praisesong for the Widow), dementia. *Hussein Salem, 85, Egyptian-Spanish businessman, co-owner of East Mediterranean Gas Company.Mubarak’s era business tycoon Hussein Salem dies in Madrid *Jan Simonsen, 66, Norwegian politician, MP (1989–2005), cancer.Jan Simonsen er død (66) ===13=== *Kip Addotta, 75, American comedian (The Tonight Show) and television presenter (Everything Goes).Kip Addotta Dies: Comedian Appeared On ‘The Tonight Show’, Was 75 *Cecilia Caballero Blanco, 105, Colombian socialite, First Lady (1974–1978).Falleció la exprimera dama Cecilia Caballero de López *Guo Zhenqian, 86, Chinese politician, Governor of Hubei Province (1985–1990), Vice Governor of the People’s Bank (1990–1993) and Auditor-General of the National Audit Office (1994–1998).审计署原审计长、党组书记郭振乾逝世，享年86岁 *Tim Means, 75, American-Mexican environmentalist, problems caused by diabetes.Timothy Means, Whose Ecotourism Made a Difference, Dies at 75 *Nadia Toffa, 40, Italian journalist and television presenter (Le Iene), brain cancer.È morta Nadia Toffa ===14=== *Graham Farmer, 84, Australian footballer (East Perth, Geelong) and manager (West Perth), Alzheimer's disease.Aussie rules great Graham ‘Polly’ Farmer dies aged 84 at Fiona Stanley Hospital *Karim Olowu, 95, Nigerian Olympic sprinter and long jumper (1952, 1956), Commonwealth Games silver medalist (1954).Nigeria: First Nigerian Commonwealth Games Medalist, Kab Olowu, Dies At 95 *Héctor Rivoira, 59, Argentine football player (Almirante Brown) and manager (Quilmes, Atlético Tucumán), colorectal cancer.Murió Héctor \"Chulo\" Rivoira, histórico entrenador del ascenso *Gjergj Xhuvani, 55, Albanian movie director (Slogans, East, West, East: The Final Sprint) screenwriter and producer, suspected heart attack.Ndahet nga jeta regjisori i njohur shqiptar Gjergj Xhuvani ===15=== *Eddie Marlin, 89, American professional wrestler (NWA) and promoter, multiple organ failure.Eddie Marlin dead at 89 *Qin Hanzhang, 111, Chinese engineer and food scientist, heart attack.酒业泰斗秦含章逝世 享年112岁 *Antonio Rastrelli, 91, Italian politician, MP (1979–1995) and President of Campania (1995–1999).Centrodestra, morto a 91 anni Antonio Rastrelli *Vidya Sinha, 71, Indian actress (Rajnigandha, Chhoti Si Baat, Qubool Hai), respiratory failure caused by heart and lung disease.Veteran actress Vidya Sinha dies at 71 *Glenn Tasker, 67, Australian sports administrator, President of the Australian Paralympic Committee (2013–2018), problems caused by cardiac arrest.Paralympics Australia deeply saddened by the loss of Glenn Tasker *Wrestling Pro, 81, American professional wrestler (NWA).\"Wrestling Pro\", who entertained fans for decades, has died ===16=== *Gustavo Barreiro, 60, Cuban-born American politician, member of the Florida House of Representatives (1998–2006), heart attack.Former State Rep. Gus Barreiro, advocate for vulnerable children, dead at 60 *Princess Christina, 72, Dutch royal, sister of Queen Beatrix, bone cancer.Prinses Christina (72) overleden aan gevolgen van botkanker *Peter Fonda, 79, American actor and screenwriter (Easy Rider, Ulee's Gold, 3:10 to Yuma), Golden Globe winner (1997, 1999), respiratory failure caused by lung cancer.Peter Fonda, 'Easy Rider' Architect and Counter-Cultural Icon, Dies at 79 *Felice Gimondi, 76, Italian racing cyclist, Grand Tour winner (1965, 1967, 1968), heart attack.Addio a Felice Gimondi: l'ex corridore è morto a 76 anni *Jim Hardy, 96, American football player (Los Angeles Rams, Chicago Cardinals, Detroit Lions).Hardy, oldest USC and Rams player, dies at 96 *C. S. Holling, 88, American-born Canadian ecologist, co-founder of ecological economics.In Memoriam: Crawford Stanley (Buzz) Holling, OC FRSC *Faisal Masud, 64, Pakistani physician and educator, Vice-Chancellor of King Edward Medical University (2013–2017), cardiac arrest.Prof Dr Faisal Masood dies of cardiac arrest *José Nápoles, 79, Cuban-born Mexican Hall of Fame boxer, world welterweight champion (1969–1970, 1971–1975).Welterweight legend Napoles dies at age 79 *Anna Quayle, 86, English actress (Grange Hill, Chitty Chitty Bang Bang, A Hard Day's Night), Tony winner (1963), Lewy body dementia.Grange Hill and Chitty Chitty Bang Bang star Anna Quayle dies aged 86 after dementia battle *Richard Williams, 86, Canadian-British animator and director (The Thief and the Cobbler, Who Framed Roger Rabbit, The Return of the Pink Panther), three-time Oscar winner, cancer.Acclaimed animator who created Roger Rabbit dies aged 86 ===17=== *Cedric Benson, 36, American football player (Texas Longhorns, Cincinnati Bengals, Chicago Bears), motorcycle crash.Report: Former No. 4 overall pick RB Cedric Benson dies in motorcycle crash *Walter Buser, 93, Swiss politician, Federal Chancellor (1981–1991).È morto l'ex cancelliere federale Walter Buser *František Derfler, 77, Czech actor and political activist, signatory of Charter 77.Zemřel brněnský herec a režisér František Derfler, signatář Charty 77 *Jacques Diouf, 81, Senegalese diplomat, Director General of the Food and Agriculture Organization (1994–2011).Le diplomate sénégalais Jacques Diouf est décédé à l'âge de 81 ans *Donald A. B. Lindberg, 85, American mathematician, Director of the United States National Library of Medicine (1984–2015), fall.Donald Allen Bror Lindberg *José A. Martínez Suárez, 93, Argentine movie director (Yesterday's Guys Used No Arsenic) and screenwriter, pneumonia.Murió José Martínez Suárez, el hermano de Mirtha Legrand *Bill McDonagh, 91, Canadian ice hockey player (New York Rangers). ===18=== * Kathleen Blanco, 76, American politician, Governor of Louisiana (2004–2008), Lieutenant Governor of Louisiana (1996–2004), member of the Louisiana House of Representatives (1984–1989), liver and eye cancer.Former Louisiana Gov. Kathleen Blanco dies at 76 *Karel Kuklík, 82, Czech photographer.Zemřel fotograf Karel Kuklík *Encarna Paso, 88, Spanish actress (Begin the Beguine), pneumonia.Muere la actriz Encarna Paso a los 88 años *Jack Whitaker, 95, American sportscaster (CBS, ABC), The NFL Today host (1971–1974).Jack Whitaker, legendary CBS Sports announcer, has died at 95 ===19=== *Benjamin N. Bellis, 95, American Air Force lieutenant general.(Ret.) Lt Gen Benjamin Neil Bellis (1924 - 2019) *Al Jackson, 83, American baseball player (Pittsburgh Pirates, New York Mets, St. Louis Cardinals).Al Jackson, Member Of Original 1962 Mets, Dies At 83 *Mohammed Zahur Khayyam, 92, Indian music director and movie score composer (Kabhie Kabhie, Umrao Jaan, Dil-e-Nadaan), cardiac arrest caused by a lung infection.Music composer Khayyam passes away at 92 *Gina Lopez, 65, Filipino environmentalist and politician, Secretary of Environment and Natural Resources (2016–2017) and Chair of the Pasig River Rehabilitation Commission (since 2010), multiple organ failure caused by brain cancer.Ex-DENR chief Gina Lopez dies at 65 *Jagannath Mishra, 82, Indian politician, Chief Minister of Bihar (1975–1977, 1980–1983, 1989–1990), cancer.Bihar former CM Jagannath Mishra passes away in Delhi *Jan Ruff O'Herne, 96, Dutch-Australian comfort women human rights activist.'Comfort woman' who was repeatedly raped by Japanese troops dies at 96 *Larry Taylor, 77, American bass guitarist (Canned Heat), lung cancer.Canned Heat’s Larry ‘The Mole’ Taylor has died aged 77 ===20=== *Giovanni Buttarelli, 62, Italian politician, European Data Protection Supervisor (since 2014), problems caused by ALS.È morto il garante per la privacy europeo Giovanni Buttarelli *Rudolf Hundstorfer, 67, Austrian trade unionist and politician, President of the Austrian Trade Union Federation (2006–2008) and 2016 presidential candidate, heart attack.Rudolf Hundstorfer verstorben *John H. McArthur, 85, Canadian-American educator and business theorist, Dean of the Harvard Business School (1980–1995).APF Canada Mourns Loss of Former Board Chair, Dr. John H. McArthur *Larry Siegel, 93, American humorist (Mad Magazine, Playboy) and television writer (The Carol Burnett Show), three-time Emmy winner, problems caused by Parkinson's disease.Larry Siegel — RIP ===21=== *Dina bint Abdul-Hamid, 89, Jordanian princess, Queen consort (1955–1957). *Babulal Gaur, 89, Indian politician, Chief Minister of Madhya Pradesh (2004–2005), cardiac arrest.Babulal Gaur, former MP chief minister and senior BJP leader, dies in Bhopal *Celso Piña, 66, Mexican cumbia singer-songwriter, composer and accordionist, heart attack.Muere Celso Piña, el \"Rebelde del acordeón\" *Ines Torelli, 88, Swiss comedian and actress (Fascht e Familie, Chikita).Ines Torelli ist tot ===22=== *Junior Agogo, 40, Ghanaian footballer (Bristol Rovers, Nottingham Forest, national team).Former Ghana striker Junior Agogo is dead *Gary Ray Bowles, 57, American serial killer, executed by lethal injection.Gary Ray Bowles: Florida executes killer who preyed on gay men *Bobby Dillon, 89, American football player (Green Bay Packers). *Tim Fischer, 73, Australian politician, Leader of the National Party (1990–1999), Deputy Prime Minister (1996–1999) and Ambassador to the Holy See (2009–2012), acute myeloid leukemia.Former deputy prime minister Tim Fischer dies *Tom Nissalke, 87, American basketball coach (Houston Rockets, San Antonio Spurs, Utah Jazz).Former NBA coach Nissalke dies at 87 ===23=== *Amath Dansokho, 82, Senegalese politician, Minister of Urban Planning and Housing (1991–1995, 2000) and Mayor of Kédougou (2005–2012).Sénégal : mort du ministre Amath Dansokho, ex-figure majeure de l’opposition *Carlo Delle Piane, 83, Italian actor (The Piano Tuner Has Arrived, A School Outing, Christmas Present), Nastro d'Argento winner (1984).E' morto Carlo Delle Piane, 110 film in 70 anni di carriera *David Koch, 79, American businessman and political activist, Executive Vice President of Koch Industries (1983–2018), prostate cancer.David Koch, billionaire conservative activist and philanthropist, dies at 79 *Roaring Lion, 4, British racehorse, euthanised.Roaring Lion loses life after suffering another bout of colic *Walter Thiel, 70, German theoretical chemist, President of the World Association of Theoretical and Computational Chemists (since 2011).Walter Thiel (1949 – 2019) *Egon Zimmermann, 80, Austrian ski racer and businessman, Olympic champion (1964), problems caused by multiple sclerosis.Olympiasieger Egon Zimmermann ist tot ===24=== *Blanca Fernández Ochoa, 56, Spanish alpine ski racer, Olympic bronze medallist (1992), fall.Olympic skiing legend found dead after massive search in Spanish mountains (body found on this date) *Arun Jaitley, 66, Indian politician, MP (since 2000), Minister of Information and Broadcasting (1999–2000, 2014–2016), Law and Justice (2000–2002, 2003–2004), Defence (2014, 2017), Corporate Affairs and Finance (2014–2019), problems caused from diabetes.Armin Jaitley passes away at 66 *Rick Loomis, 72, American game designer, founder of Flying Buffalo, lymphoma.RIP Rick Loomis *Massimo Mattioli, 75, Italian cartoonist, comics writer and artist (Squeak the Mouse, Pinky).È morto il fumettista Massimo Mattioli *Sidney Rittenberg, 98, American journalist, educator and Chinese linguist, first American to join the Communist Party of China.Sidney Rittenberg, Idealistic American Aide to Mao Who Evolved to Counsel Capitalists, Dies at 98 ===25=== *Timothy Bell, Baron Bell, 77, British advertising and public relations executive (Bell Pottinger).Tim Bell, Margaret Thatcher’s spin doctor, dies at 77 *Alfred C. Haynes, 87, American airline pilot captain, United Airlines Flight 232 crash survivor. *Ferdinand Piëch, 82, Austrian Hall of Fame businessman and engineer, Chairman of Volkswagen Group (1993–2015).Ferdinand Piëch ist tot *Mona Lisa, 97, Filipino actress (Insiang, Giliw Ko, Cain at Abel), problems caused by Alzheimer's disease.Veteran actress Mona Lisa passes away *Vince Naimoli, 81, American businessman and philanthropist, founder of the Tampa Bay Rays, problems caused by progressive supranuclear palsy.Original Rays franchise owner Vince Naimoli dies at age 81 *Anne Grete Preus, 62, Norwegian rock singer and musician, liver and kidney cancer.Anne Grete Preus er død *Jerry Rook, 75, American basketball player (Arkansas State Red Wolves, New Orleans Buccaneers).Arkansas State & NEA basketball legend Jerry Rook passes away *Jafar Umar Thalib, 57, Indonesian Islamic militant and educator, founder of Laskar Jihad, heart attack.Sakit Jantung, Eks Laskar Jihad Jafar Umar Thalib Tutup Usia *Lodewijk Woltjer, 89, Dutch astronomer and editor (The Astronomy and Astrophysics Review, The Astronomical Journal), Director-General of the European Southern Observatory (1975–1987) and President of the International Astronomical Union (1994–1997).Oud-directeur ESO en oud-president IAU Lodewijk Woltjer (1930–2019) overleden *Fernanda Young, 49, Brazilian screenwriter (Como Aproveitar o Fim do Mundo), actress (Os Normais) and model, cardiopulmonary arrest caused by asthma.Escritora, atriz e roteirista Fernanda Young morre aos 49 anos ===26=== *Pal Benko, 91, French-born Hungarian-American chess grandmaster.Pal Benko, 1928-2019 *Christian Bonaud, 62, French Islamologist and philosopher, drowned.Iran's Larijani condoles death of French philosopher Yahya Bonaud *Neal Casal, 50, American rock singer-songwriter and musician (Ryan Adams & the Cardinals, Blackfoot, Chris Robinson Brotherhood), suicide.Neal Casal Dead: Circles Around the Sun Guitarist Dies at 50 *Colin Clark, 35, American footballer (Colorado Rapids, Houston Dynamo, national team), heart attack.Fort Collins native, former Colorado Rapids soccer star Colin Clark dies *Tom Jordan, 99, American baseball player (Chicago White Sox, Cleveland Indians, St. Louis Browns), problems caused from a heart attack.Tom Jordan, Oldest Living ex-MLB Player, Dies at 99 *Pita Paraone, 73, New Zealand politician, MP (2002–2008, 2014–2017), problems caused from heart surgery.Ngāti Hine in mourning after death of Waitangi stalwart, Pita Paraone *Isabel Toledo, 59, Cuban-born American fashion designer, breast cancer.Designer Isabel Toledo Has Died *Gavin Watson, 71, South African businessman, CEO of Bosasa (since 2000), car crash. ===27=== *Albert Vickers Bryan Jr., 92, American politician and lawyer, Chief Judge of the District Court for the Eastern District of Virginia (1985–1991), pneumonia.Albert V. Bryan Jr., federal judge who presided over ‘rocket docket,’ dies at 92 *Jessi Combs, 39, American racer and television host (Xtreme 4x4, MythBusters, Overhaulin'), jet-car crash.Jessi Combs, \"fastest woman on four wheels,\" dies during land speed-record attempt *Frances Crowe, 100, American peace activist, heart failure.Longtime Valley peace activist Frances Crowe dies at 100 *Donnie Fritts, 76, American keyboardist (Kris Kristofferson) and songwriter, problems caused by heart surgery.Donnie Fritts, Acclaimed Muscle Shoals Session Musician & Songwriter, Passes at 76 *Abel González Chávez, 76, Colombian radio and television personality, stroke.Fallece el periodista y locutor barranquillero Abel Gonzalez Chávez *Sir Dawda Jawara, 95, Gambian politician, Prime Minister (1962–1970) and President (1970–1994).The Gambia's first president, Dawda Jwara, dies aged 95 - Presidency *Paul Meger, 90, Canadian ice hockey player (Montreal Canadiens), Stanley Cup champion (1953).Paul Meger *Tahu Potiki, 52, New Zealand Māori politician and businessman, Chief Executive of Te Rūnanga o Ngāi Tahu (2002–2006), multiple organ failure.Former Ngai Tahu CEO dies *Martin Weitzman, 77, American environmental economist.The Man Who Got Economists to Take Climate Nightmares Seriously ===28=== *Donnie Green, 71, American football player (Buffalo Bills, Philadelphia Eagles, Detroit Lions).Bills 'Electric Company' lineman Donnie Green passes *Nancy Holloway, 86, American singer (\"T'en va pas comme ça\") and actress (Seek the idol, Man from Cocody).Nancy Holloway est décédée à Paris à l'âge de 86 ans *Nicolás Leoz, 90, Paraguayan-Colombian football executive, President of CONMEBOL (1986–2013), cardiac arrest.Morre o paraguaio Nicolás Leoz, ex-presidente da CONMEBOL *Sogyal Rinpoche, 72, Tibetan Dzogchen lama and writer (The Tibetan Book of Living and Dying), founder of Rigpa organization, pulmonary embolism caused by colorectal cancer. *Sean Stephenson, 40, American self-help writer and motivational speaker, problems caused from a concussion.Sean Stephenson death: Author and therapist dies due to complications after suffering head injury *Randy Romero, 61, American Hall of Fame jockey, stomach cancer.Randy Romero, classy Cajun with deft touch and strong spirit, dies at 62 ===29=== *Lila Cockrell, 97, American politician, Mayor of San Antonio (1975–1981, 1989–1991).Lila Cockrell, first woman mayor of San Antonio, has died *Terrance Dicks, 84, English screenwriter (Doctor Who, Crossroads, Space: 1999).Doctor Who writer and script editor Terrance Dicks dies, aged 84 *Maria Dolors Renau, 82, Spanish politician, Deputy (1982–1986, 1989–1993), MEP (1986–1987) and president of Socialist International Women (1999–2003).Mor Maria Dolors Renau, expresidenta de la Internacional Socialista de les Dones *Guy Innes-Ker, 10th Duke of Roxburghe, 64, British aristocrat, esophageal cancer.Duke of Roxburghe dies, aged 64 *Juhani Kärkinen, 83, Finnish Olympic ski jumper (1960), world champion (1958).Mäkihypyn maailmanmestari Juhani Kärkinen kuollut *Jim Langer, 71, American Hall of Fame football player (Cleveland Browns, Miami Dolphins, Minnesota Vikings), heart failure.In Memoriam | Jim Langer | 1948 - 2019 *Jim Leavelle, 99, American homicide detective, police escort for Lee Harvey Oswald, heart attack caused by hip surgery.Dallas Detective Cuffed to Oswald Dies at 99 *Brad Linaweaver, 66, American science fiction novelist (Moon of Ice) and screenwriter (The Brain Leeches), cancer.Brad Linaweaver (1952-2019) *Achille Silvestrini, 95, Italian Roman Catholic politician and cardinal, Prefect of the Congregation for the Oriental Churches (1991–2000).Addio a Silvestrini, uno dei protagonist della diplomazia vaticana *Vladimir Veličković, 84, Serbian painter, member of the Serbian Academy of Sciences and Arts (since 1985) and Académie des Beaux-Arts (since 2005), congestive heart failure.Preminuo slikar Vladimir Veličković ===30=== *Franco Columbu, 78, Italian bodybuilder and actor (Conan the Barbarian, The Terminator), Mr. Olympia winner (1976, 1981), drowned due to a heart attack.Franco Columbu Dead: Former Mr. Olympia Dies at 78 *Dennis Fentie, 68, Canadian politician, Premier of Yukon (2002–2011) and MLA (1996–2011), cancer.Dennis Fentie, former Yukon premier, dies at the age of 68 *Bernard F. Grabowski, 96, American politician, member of the U.S. House of Representatives from Connecticut's from at-large (1963–1965) and 6th congressional district (1965–1967).Bernard Francis Grabowski *A. James Gregor, 90, American historian and political scientist.È morto lo storico A. James Gregor, il più grande esperto di ideologia fascista *Valerie Harper, 80, American actress (The Mary Tyler Moore Show, Rhoda, Valerie), Emmy Award winner (1971, 1972, 1973, 1975), meningitis caused by brain cancer.Actress Valerie Harper, known for 'Rhoda,' 'Mary Tyler Moore Show,' dies at 80, family says *Hans Rausing, 93, Swedish-British businessman and philanthropist, Chairman of Tetra Pak (1985–1993).Hans Rausing, head of Tetra Pak family, dies aged 93 *Udo Schaefer, 92, German lawyer and Bahá'í writer (Bahá'í Ethics in Light of Scripture, Beyond the Clash of Religions: The Emergence of a New Paradigm).Udo Schaefer verstorben ===31=== *Alec Holowka, 35, Canadian video game developer (Aquaria, I'm O.K – A Murder Simulator, Night in the Woods), suicide.Night in the Woods Developer Alec Holowka Dies *Anthoine Hubert, 22, French racing driver, GP3 Series champion (2018), race crash.Statement: Incident during FIA Formula 2 Sprint Race, Spa-Francorchamps *Marita Lorenz, 80, German-born American conspiracy theorist, heart failure.Marita Lorenz, Who Told Tales of Castro and Kennedy, Dies at 80 *William J. Larkin Jr., 91, American politician, member of the New York State Assembly (1979–1990) and Senate (1991–2018).Former NYS Senator Bill Larkin Dies At 91 *Mary Ma, 66, Chinese business executive, CFO of Lenovo, pancreatic cancer.Former Lenovo Executive Mary Ma Dies at 66 *Ryszard Czerniawski, 67, Polish lawyer and economist, Vice-Chairman of the Board of Warsaw Stock Exchange (1994–2006) and vice-ombudsman (2012–2015).Ryszard Czerniawski *Immanuel Wallerstein, 88, American sociologist, created the World-systems theory.Immanuel Wallerstein vefat etti *Wang Buxuan, 97, Chinese thermal physicist, member of the Chinese Academy of Sciences (since 1980).工程热物理学科的开拓者、中国科学院院士王补宣逝世 *Zbigniew Zaleski, 72, Polish politician, MEP (2004–2009, 2013–2014).Odszedł do Pana Pan Profesor Zbigniew Zaleski ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *8 Deaths",
 "title": "Deaths in August 2019"
}