{
 "id": "707143",
 "text": "Thomas Esang \"Tommy\" Remengesau Jr. is a Palauan politician. He became Palau's president in 2013 and was re-elected in 2016. He also served as president from 2001 to 2009 and was a Senator in the Palau National Congress in between. Remengesau aimed to reduce Palau's reliance on U.S. aid by boosting tourism with the slogan \"Preserve the Best and Improve the Rest.\" This means preserving the rich marine resources around Palau, known for its top-tier underwater attractions. In international affairs, he elevated Palau's status in the United Nations and led environmental initiatives like the Micronesian Challenge. He's a strong advocate for addressing global warming in the South Pacific. ==Early Life== Remengesau was born in Koror, Palau. His father, Thomas Remengesau Sr., held various important roles in Palau, including District Administrator and Vice President. His mother, Ferista Esang Remengesau, also served as First Lady of Palau. Remengesau studied at Grand Valley State University in Allendale, Michigan, USA, and graduated from there. ==Political Career== ===Early Political Roles and Presidential Terms=== Thomas Esang \"Tommy\" Remengesau Jr. embarked on his political career at a young age. At just 28, he targeted the youth voting bloc in Palau and emerged as a prominent advocate for the nation's youth. In 1984, he clinched a historic victory, becoming Palau's youngest senator. His election was a testament to his grassroots campaign and widespread support from the youth. He later ascended to the role of Vice-President of Palau in 1992 and successfully served two terms in this position. Additionally, he held the important portfolio of Minister of Administration. In the year 2000, with the endorsement of outgoing President Kuniwo Nakamura, he secured the presidential election, defeating his opponent by a margin of 52% to 46%. Remengesau's triumph in the 2004 re-election was even more decisive, with a victory margin of 66.5% to 33.5%. This race was marked by rumors of potential financial influence from Taipei and Beijing. ===Return to the Senate=== After completing his presidential term, Remengesau announced his candidacy for a senatorial seat in the Palauan Senate in 2008. Despite his extensive political experience, he came in 11th place in the election. ===Charges and Verdict=== Following his presidency, legal issues arose concerning property disclosure. While these charges primarily revolved around technical aspects related to the filing of personal assets under the Code of Ethics law, they led to an investigation and legal proceedings. Remengesau emerged from this trial with insights into the importance of asset disclosure for public officials. ===Second Presidential Term=== In 2013, Remengesau assumed office for his second term as President, winning the Palauan election of 2012. His commitment to environmental initiatives garnered significant recognition. He received prestigious awards such as the Pacific Champion Award and the United Nations' Champion of the Earth title in 2013, as well as the Inspiring Conservation Award and the IGFA Conservation Award in 2014. In 2016, he continued his mission, earning the Peter Benchley Ocean Award for Excellence in National Stewardship. For his efforts in raising awareness about the vulnerability of Palau to sea-level rise, Remengesau made an appearance in the 2016 documentary film \"Before the Flood.\" In the November 2016 election, he faced a formidable challenge from his brother-in-law, Senator Surangel Whipps Jr., in his bid for a fourth presidential term. Despite a competitive race, Remengesau secured victory with 5109 votes compared to Whipps' 4854. ==References== Category:1956 births Category:Living people Category:Presidents of Palau",
 "title": "Thomas Remengesau Jr."
}