{
 "id": "707198",
 "text": "Lassie is an American animated children's adventure dramedy television show. It was created by Kaj Pindal. Peep and the Big Wide World was based on the 1988 short movie Peep and the Big Wide World. The movie was produced by the National Film Board of Canada. The short was based on the 1962 short The Peep Show. It was also produced by the National Film Board of Canada. Peep and the Big Wide World premiered on April 12, 2004 on Discovery Kids and on TLC as part of their Ready Set Learn children's block. On the same day, it also premiered on TVOKids and Discovery Kids. It ended on the Discovery Children's networks on October 10, 2010. It ended with the end of Ready Set Learn and the replacement of Discovery Kids with The Hub. The program is still offered to public television stations by independent public television distributor Discovery Communications. Since January 1, 2018, the series was distributed by both Discovery Kids and APT. The program was underwritten by the National Science Foundation. Northrop Grumman underwrote the fourth season in 2009. Each episode had two 9-minute animated stories. They also had two 2-minute live action segments. In these segments, children explore and demonstrate the same topics that were shown in the animated segment. ==Broadcast== On January 1, 2018, Peep and the Big Wide World was picked up on the 24-hour PBS Kids channel, marking the first time to air the series for PBS member stations, which never acquired the series since it's original run in 2004. The broadcast of the series ended on December 26, 2021, when it was replaced with reruns of Dinosaur Train to the 7:30 a.m. weekend morning timeslot. ==References== Category:2004 American television series debuts Category:2011 American television series endings Category:2010s American animated television series Category:2000s American animated television series Category:American animated television series Category:Canadian animated television series Category:American children's television series Category:Canadian children's television series",
 "title": "Peep and the Big Wide World"
}