{
 "id": "707174",
 "text": "Pedro Rafael Pierluisi Urrutia (born April 26, 1959) is a Puerto Rican attorney, lobbyist, and politician. He was the Governor of Puerto Rico from January 2, 2021 until January 2, 2025. He lost his re-elected in 2024 to Jenniffer González-Colón. == Biography == Pierluisi was the de facto Governor of Puerto Rico. He was sworn-in on August 2, 2019. Five days later, the Puerto Rico Supreme Court ruled that Pierluisi was sworn in on unconstitutional grounds and removed him from office, effective 5 p.m. AST on August 7. He was the Resident Commissioner of Puerto Rico in 2009–2017, as well as the Secretary of Justice of Puerto Rico in the 1990's. Pierluisi, a member of New Progressive. On January 2, 2021, Pierluisi was sworn in. there was a private ceremony in which he was sworn in by the Chief Justice of the Supreme Court, Maite Oronoz Rodríguez. This was followed by a controversial public ceremony on the north side of the Puerto Rican Capitol, where Pierluisi took the oath of office publicly in front of 400 guests during the COVID-19 pandemic and delivered his inagural speech. In February 2021, Pedro Pierluisi, said Congress was \"morally obligated\" to respond to last year's referendum. On March 15, 2021, Pedro Pierluisi indicated that the state of emergency related to maritime transport from the main island to Vieques and Culebra would remain in effect until 2022 when the ferry transport system would be privatized. After group protests against the inadequate ferry service, which led to clashes between police and protesters, Pedro Pierluisi said he supported the actions of the \"Fuerzas Unidas de Rapida Acción\", the local branch of the forces of security involved in the demonstration. On March 20, 2022, the assembly general assembly of the Nouveau Parti Progressist, the governor Pedro Pierluisi announcing that he had issued a second mandate. In an interview on August 28, 2022, it was confirmed that the press said it was now open.. In February 2023, Pedro Pierluisi pleaded before the Senate in Washington D.C. for the United States of America to approve the bill which provides for an electoral consultation in Puerto Rico between the options of American statehood, independence or of independence in free association with the United States of America. . In June 2024, Pedro Pierluisi obtained a hearing in the Senate of the United States of America, concerning draft statute 3231, from Democrat Martin Heinrich. This measure is the Senate version of House Bill 2757 and provides for a binding plebiscite authorized by the U.S. Congress that allows residents of Puerto Rico to choose between U.S. statehood and full independence. and sovereignty in free association with the United States of America. On July 2, 2024, Pedro Pierluisi calls a self-determination referendum for Puerto Rico, in November 2024, for the first time, the Commonwealth status of Puerto Rico, does not appear in this self-determination referendum. ==Notes== ==References== Category:1959 births Category:Living people Category:Lawyers from New Orleans Category:Governors of Puerto Rico Category:Politicians from New Orleans Category:Lawyers from Washington, D.C. Category:Politicians from Washington, D.C. Category:Resident commissioners of Puerto Rico Category:Secretaries of state of Puerto Rico",
 "title": "Pedro Pierluisi"
}