{
 "id": "70723",
 "text": "The 2010 Winter Olympics, officially known as the XXI Olympic Winter Games, were the Winter Olympics that were held in Vancouver, British Columbia, Canada in 2010. Both the Olympic and Paralympic Games were organized by the Vancouver Organizing Committee (VANOC). The XXI Olympic Winter Games were held from February 14 2010 to February 28 2010. Many of the 2010 events were held in the nearby resort community called Whistler, about an hour's drive north of Vancouver. The 2010 Winter Olympics is the third Olympics hosted by Canada, and the first by the province of British Columbia. Previously, Canada was home to the 1976 Summer Olympics in Montreal and the 1988 Winter Olympics in Calgary. The villages of Whistler and Garibaldi bid for the games in 1976 but failed to win. ==Participating nations== 82 National Olympic Committees had teams in the 2010 Winter Olympics. Cayman Islands, Colombia, Ghana, Montenegro, Pakistan, Peru and Serbia were in their first winter Olympics. Also Jamaica, Mexico and Morocco came back to the Games after missing the Turin Games. * Albania(1) * Algeria(1) * Andorra(6) * Argentina(7) * Armenia(4) * Australia (40) * Austria(81) * Azerbaijan(2) * Belarus(50) * Belgium(9) * Bermuda(1} * Bosnia and Herzegovina(5) * Brazil(5) * Bulgaria(19) * * Cayman Islands(1) * Chile(3) * * Colombia(1) * Croatia(19) * Cyprus(2) * Czech Republic(92) * Denmark(18) * Estonia(30) * Ethiopia(1) * Finland(95) * France(108) * Georgia(8) * * Ghana(1) * Great Britain(52) * * Hong Kong(1) * Hungary(16) * Iceland(4) * India(3) * Iran(4) * Ireland(7) * Israel(3) * Italy(109) * Jamaica(1) * Japan(94) * Kazakhstan(38) * North Korea(2) * South Korea(46) * Kyrgyzstan(2) * Latvia(59) * Lebanon(3) * Liechtenstein(7) * Lithuania(8) * Macedonia(4) * Mexico(1) * Moldova(7) * Monaco(6) * Mongolia(2) * Montenegro(1) * Morocco(1) * Nepal(1) * Netherlands(34) * New Zealand(16) * Norway(99) * Pakistan(1) * Peru(3) * Poland(50) * Portugal(1) * Romania(29) * Russia(177) * San Marino(1) * Senegal(1) * Serbia(11) * Slovakia(73) * Slovenia(50) * South Africa(2) * * Sweden(106) * Switzerland(146) * Chinese Taipei(1) * Tajikistan(1) * Turkey(5) * Ukraine(47) * * Uzbekistan(3) Costa Rica, Kenya, Luxembourg, Madagascar, Thailand, United States Virgin Islands and Venezuela did not join the 2010 Winter Olympics. ==Sports== Fifteen winter sports events were in the 2010 Winter Olympics. The eight sports grouped as ice sports were: bobsled, luge, skeleton, ice hockey, figure skating, speed skating, short track speed skating and curling. The three sports grouped as alpine skiing and snowboarding events were: alpine skiing, freestyle skiing and snowboarding. The four sports grouped as Nordic events were: biathlon, cross-country skiing, ski jumping and Nordic combined. Numbers in parentheses show the number of medal events for each sport. * Alpine skiing (10) * Biathlon (10) * Bobsleigh (3) * Cross-country skiing (12) * Curling (2) * Figure skating (4) * Freestyle skiing (6) * Ice hockey (2) * Luge (3) * Nordic combined (3) * Short track speed skating (8) * Skeleton (2) * Ski jumping (3) * Snowboarding (6) * Speed skating (12) The opening and closing ceremonies and the events grouped as ice sports (excluding bobsleigh, luge and skeleton) were held in Vancouver and Richmond. The sports grouped as \"Nordic events\" were held in the Callaghan Valley near Whistler. All alpine skiing events were held on Whistler Mountain (Creekside) and sliding events (bobsleigh, luge and skeleton) were held on Blackcomb Mountain. Cypress Mountain was the place for the freestyle skiing (aerials, moguls and ski cross), and all snowboard events (half-pipe, parallel giant slalom, snowboard cross). Vancouver 2010 was the first winter Olympics that both men's and women's hockey were played on a narrower, NHL-sized ice rink, measuring 200 ft × 85 ft (61 m × 26 m), instead of the international size of 200 ft × 98.5 ft (61 m × 30 m). The games were played at General Motors Place, home of the NHL's Vancouver Canucks, which was temporarily renamed Canada Hockey Place for the time of the Olympics. This change saved $10 million in construction costs and allowed an additional 35,000 spectators to attend Olympic hockey games. However, some European countries felt this would give North American players an advantage since they grew up playing on the smaller NHL-sized rinks. ==Medal table== Here is the top of the medal table at the end of the games. Medal numbers shown in bold are the highest in their section. Canada, the host nation is highlighted in lavender. Rank Nation Gold Silver Bronze Total 1 Canada (CAN) 14 7 5 26 2 Germany (GER) 10 13 7 30 3 United States (USA) 9 15 13 37 4 Norway (NOR) 9 8 6 23 5 South Korea (KOR) 6 6 2 14 6 Switzerland (SUI) 6 0 3 9 7 China (CHN) 5 2 4 11 7 Sweden (SWE) 5 2 4 11 9 Austria (AUT) 4 6 6 16 10 Netherlands (NED) 4 1 3 8 ==References== == Other websites == * Vancouver 2010 Olympic and Paralympic Winter Games, official website * The lighting ceremony in Olympia for the Vancouver 2010 Olympic Winter Games. * Government of Canada 2010 Federal Secretariat * Road to the Games | Vancouver 2010 Winter Olympic Games | CBC B.C. Feature * CTV Television network Official website * City of Vancouver, official Host City page * The official Whistler website of the Vancouver 2010 Olympic and Paralympic Winter Game * Vancouver 2010 Schedule - Venue Information and Maps * Winter Olympics Vancouver 2010 - News, Tickets, Venues, Sport events, Schedules Category:February 2010 events",
 "title": "2010 Winter Olympics"
}