{
 "id": "707266",
 "text": "U.S. Route 400 (US 400) is a mostly east–west U.S. Highway. It was created in 1994. The highway's western endpoint is in Granada, Colorado, at an intersection with US 385\\. The highway's eastern endpoint is southwest of Joplin, Missouri, near Loma Linda, at an interchange with Interstate 44. It originally ended in Garden City, Kansas; in 1996 it was made longer to its current western endpoint. Its route number does not follow the usual AASHTO numbering scheme, as there is no \"parent\" US 0\\. ==Route description== ===Colorado=== US 400 begins in Granada at an intersection with US 385. It then goes along with US 50 through Holly east to the Kansas border. ===Kansas=== US-400 and US-50 enter Kansas west of Coolidge. They go together through Garden City, where it intersects US-83. They separate at Dodge City. This is where it intersects US-56 and US-283. It goes southeast from Dodge City and first intersects US-54 at Mullinville. US-400 and US-54 start going together at Mullinville. This goes through Greensburg, Pratt and Kingman before going into Wichita. While in Wichita, US-400 and US-54 intersect Interstate 235. It goes along with US-81 and Interstate 135. K-96 provides a short freeway connection to Interstate 35, which is also the Kansas Turnpike. At Augusta, US-400 and US-54 goes along with US-77. US-400 separates at Haverhill. US-400 goes east through several small towns before turning southeast to go through the Fredonia area. It intersect US-75 at Neodesha. After going along with US-75, it turns east. It intersects U.S. Route 169 near Morehead and then US-59 near Parsons. Then it intersects US-69 south of Pittsburg. It then turns south with US-69. At Crestline, it follows US-69A south to Riverton. US-400 then turns east with US-166 at Baxter Springs. The two highways go eastward into Missouri. ===Missouri=== US 400, along with US 166, ends at I-44 about one mile (1.6 km) east of the Kansas-Missouri state line. It is three miles (5 km) west of Joplin. ==Major intersections== == Notes == ==References== ==Other websites== * Kansas Highway Maps: Current , Historic , KDOT *Sanderson, Dale End of U.S. Highway 400 (with maps of US 400 and related routes) Category:U.S. Highways",
 "title": "U.S. Route 400"
}