{
 "id": "707289",
 "text": "Wilson Lake is a reservoir in the U.S. state of Kansas. It is on the border of Russell County and Lincoln County. It was built and managed by the U.S. Army Corps of Engineers for flood control. It is also used for wildlife management and recreation. Several parks are along its shoreline, including Wilson State Park. ==History== The Corps of Engineers planned, designed, and built Wilson Dam. They completed it in 1964 for $20 million. ==Geography== Wilson Lake is at (38.9401464, -98.5567638) at an elevation of . It is in north-central Kansas in the Smoky Hills region of the Great Plains. Most of Wilson Lake is in Russell County. A small part of its southeastern part goes into Lincoln County. The reservoir is impounded at its northeastern end by Wilson Dam. The dam is at (38.9666777, -98.4947876) at an elevation of . The Saline River is the reservoir's main inflow of water from the west. It is also the reservoir's main outflow to the east. Smaller tributaries include Elm Creek, which flows from the south into the western part of the reservoir, and Hell Creek, which feeds the reservoir's southeastern arm. Kansas Highway 232 goes north-south along the reservoir's eastern shore. It also goes across the top of Wilson Dam. Shoreline Road, a paved county road, goes east-west parallel to the southern shore. It crosses the reservoir's southeastern part. ==Hydrography== The surface area, surface elevation, and water volume of the reservoir changed based on inflow and local climate. When the reservoir is full, it has a surface area of , a surface elevation of , and a volume of . ==Infrastructure== Wilson Dam is a dam that has a floor made of rock and soil. It is tall and long. ==References== ==Other websites== * Wilson Lake, U.S. Army Corps of Engineers * Wilson State Park, Kansas Department of Wildlife, Parks and Tourism * Wilson Wildlife Area, Kansas Department of Wildlife, Parks and Tourism Category:Geography of Kansas Category:Lakes of Kansas",
 "title": "Wilson Lake (Kansas)"
}