{
 "id": "707543",
 "text": "Washburn University (WU) is a co-educational, public university in Topeka, Kansas, United States. It has undergraduate and graduate programs. It also has professional programs in law and business. Washburn has 550 faculty members. There are more than 6,100 undergraduate students and nearly 800 graduate students. The university's assets include a $158 million endowment. ==History== Washburn University was created in February 1865 as Lincoln College by a charter issued by the State of Kansas and the General Association of Congregational Ministers and Churches of Kansas. It was built on land given by abolitionist John Ritchie. The school was renamed Washburn College in 1868 after Ichabod Washburn gave $25,000 to the school. Washburn was a church deacon, abolitionist and industrialist who lived in Worcester, Massachusetts. During World War II, Washburn Municipal University was one of 131 colleges and universities in the United States that took part in the V-12 Navy College Training Program. It was a program which offered students a path to a Navy commission. On June 8, 1966, much of the campus was destroyed by a tornado. All of the trees were gone too. ===Law School=== The Washburn School of Law was created in 1903. It was one of the first in the country to have a legal clinic where students are able to actively practice the law. The Washburn Law Library has over 380,000 volumes. It is the biggest in Kansas. Notable graduates include Bob Dole, Roy Wilford Riegle, Dennis Moore, Kim Phillips, Bill Kurtis and Fred Phelps. ==Fight Song== \"The name of Washburn shall never fall, Midst the great and small, she's the best of all; For her fair name, Then, we'll win the game, And add another victor's crown So then, we'll smash, crash against the line \"As in Auld Lang Syne,\" Crush them down, So Cheer now, yes, cheer, cheer, cheer Just for Washburn and her team!\" ==References== ==Other websites== * * Washburn Athletics website * * * Washburn Mabee Library Website Category:1860s establishments in Kansas Category:1865 establishments in the United States Category:Colleges and universities in Kansas Category:Topeka, Kansas",
 "title": "Washburn University"
}