{
 "id": "707506",
 "text": "==Monarch (1964–1966)== The succession to the throne was the same as the succession to the British throne. No. Monarch Portrait Reign Royal House Prime Minister No. Monarch Portrait Reign start Royal House Prime Minister Reign end Time in office 1 Queen Elizabeth II 1964 1966 2 years Windsor Banda ===Governor-General=== The Governor-General was the representative of the monarch in Malawi and exercised most of the powers of the monarch. The Governor-General was appointed for an indefinite term, serving at the pleasure of the monarch. After the passage of the Statute of Westminster 1931, the Governor-General was appointed solely on the advice of the Cabinet of Malawi without the involvement of the British government. In the event of a vacancy the Chief Justice served as Officer Administering the Government. ;Status No. Governor-General Portrait Tenure Monarch Prime Minister No. Governor-General Portrait Took office Monarch Prime Minister Left office Time in office 1 Sir Glyn Jones 1964 1966 2 years Elizabeth II Banda == List == Portrait Name (Birth–Death) Term of office Political Party Sir Charles Coghlan † (1863–1927) 1 October 1923 28 August 1927 Rhodesia Party Howard Unwin Moffat (1869–1951) 2 September 1927 5 July 1933 Rhodesia Party George Mitchell (1867–1937) 5 July 1933 12 September 1933 Rhodesia Party Viscount Godfrey Huggins (1883–1971) 12 September 1933 7 September 1953 United Party Sir Garfield Todd (1908–2002) 7 September 1953 17 February 1958 United Rhodesia Party Sir Edgar Whitehead (1905–1971) 17 February 1958 17 December 1962 United Federal Party Winston Field (1904–1969) 17 December 1962 13 April 1964 Rhodesian Front Ian Smith (1919–2007) 13 April 1964 2 March 1970 Rhodesian Front Godfrey Huggins 7 September 1953 2 November 1956 United Rhodesia Party Roy Welensky 2 November 1956 31 December 1963 United Federal Party Kenneth Kaunda 1 January 1964 24 October 1964 UNIP Reuben Kamanga 24 October 1964 October 1967 UNIP Hastings Banda 1966 1994 MCP Bakili Muluzi 1994 2004 UDF Bingu wa Mutharika 2004 2012 UDF DPP Joyce Banda 2012 2014 PP Peter Mutharika 2014 2020 DPP Lazarus Chakwera 2020 Incumbent MCP == References == Malawi",
 "title": "Prime Minister of Malawi"
}