{
 "id": "707533",
 "text": "De Soto is a city in Johnson and Leavenworth counties in the U.S. state of Kansas. It is part of the Kansas City Metropolitan Area. Most of the city, , is in Johnson County. In 2020, 6,118 people lived there. ==History== De Soto was platted in spring 1857. It was named after sixteenth-century Spanish explorer Hernando de Soto. ==Geography== De Soto is in northwestern Johnson County and southern Leavenworth County at (38.9791709, -94.9685783). It is along Kansas River. The United States Census Bureau says that the city has a total area of . Of that, are land and , or 1.7%, are water. ==People== ===2020 census=== The 2020 census says that there were 6,118 people, 2,295 households, and 1,635 families living in De Soto. Of the households, 67.0% owned their home and 33.0% rented their home. The median age was 39.4 years. Of the people, 79.9% were White, 1.0% were Native American, 0.9% were Black, 0.7% were Asian, 7.2% were from some other race, and 10.4% were two or more races. Hispanic or Latino of any race were 16.9% of the people. ===2010 census=== The 2010 census says that there were 5,720 people, 2,007 households, and 1,523 families living in De Soto. ==Economy== Two local companies, Great American Bank and Custom Foods, Inc., and one national company, Goodcents Deli Fresh Subs, are headquartered in De Soto. Huhtamaki Americas, Inc. and Engineered Air, two international companies, chose De Soto for their North American headquarters. Merck Animal Health, one of the world's biggest manufacturers of animal health supplies, chose De Soto for one of its U.S. manufacturing facilities. ===Biggest employers=== as of January 2017, the largest employers in the city are: # Employer # of Employees 1 De Soto USD #232 1,655 2 Huhtamaki 640 3 Engineered Air 270 4 Merck Animal Health 180 5 Rehrig Pacific 110 6 Custom Foods Inc 108 7 Goodcent's Deli Fresh Subs Headquarters 95 8 Hillside Village 86 9 Harps Food Stores 31 ==Government== The De Soto government is made of a mayor and five council members. It has a president that is chosen by the council. Mayor * Rick Walker (term expires 2022) City Council President * Lori Murdock (term expires 2020) City Council * Danny Lane (term expires 2020) * Kevin Ritter (term expires 2021) * Kevin Honomichl (term expires 2022) * Rob Daniels (term expires 2022) ==Education== The city of De Soto is served by the De Soto school district. * De Soto School District Other local education institutions near De Soto include: * University of Kansas * Ottawa University adult campus * University of Kansas-Edwards Campus * Johnson County Community College * Baker University Overland Park Campus * Emporia State University - Overland Park Campus (Metro Learning Center) ===Library=== The Johnson County Library System maintains the De Soto Downtown Library. ==Media== ===Newspapers=== The De Soto Explorer was started in 1998, and it was De Soto's main news source for 14 years. It closed in 2012. In the fall of 2015, Discovering De Soto magazine released its first preview edition.Discovering Desoto online magazine. In 2017, the De Soto City Council funded issues of Discovering De Soto. This was done in order to distribute the magazine by mail and around local businesses. In 2018, the De Soto City Council funded issues of Discovering De Soto for the year. The Kansas City Star and the Lawrence Journal-World both cover and deliver to De Soto. ===Television=== All Kansas City stations broadcast in De Soto. ===Radio=== All Topeka and Kansas City stations broadcast in De Soto. ==Transportation== ===Road=== Several highways go to De Soto: * runs through most portions of southern De Soto. Two exits have a direct connection to De Soto. ** Exit – Edgerton Road **Exit – Lexington Avenue, formerly (Decommissioned in 1999) ** Exit – Kill Creek Road * runs about north of De Soto. Two junctions have a direct connection to De Soto. ** Junction – 189th Street (Leavenworth County) ** Junction – 158th Street (Leavenworth County) * S. Wyandotte Road / 158th Street (Leavenworth County) *(Leavenworth County) *(Leavenworth County) *(Leavenworth County) ===Rail=== In 1857, the Atchison, Topeka, Santa Fe Railway built a railroad through northern parts of town. It was built parallel to the river. De Soto's train depot was built along a siding around 1860. ==Famous people== Notable people who were born in and/or have lived in De Soto include: * Stanley Adams (1922-1999), U.S. Army Lieutenant Colonel, Medal of Honor Recipient * John Anderson, Jr. (1917-2014), 36th Governor of Kansas * Howard Gloyd (1902-1978), herpetologist * Greyson Jenista (1996), Atlanta Braves minor league, right fielder * Frank Lee (1873-1952), U.S. Representative from Missouri * John Outland (1871-1941), American Football Player and Coach * Kenneth Spencer (1902-1960) ==References== ==Other websites== * City of De Soto official website * De Soto - Directory of Public Officials * De Soto Chamber of Commerce * De Soto City Map , KDOT * * , from Hatteberg's People on KAKE TV news Category:Cities in Johnson County, Kansas Category:1857 establishments in Kansas Territory Category:Cities in Leavenworth County, Kansas",
 "title": "De Soto, Kansas"
}