{
 "id": "707607",
 "text": "The University of Zurich (UZH, ), located in the city of Zürich, is the largest university in Switzerland, with about 25,000 students. It was founded in 1833 and has seven faculties. == History == === The Beginning === The University of Zurich was founded in 1833 from three existing colleges of law, theology and medicine. It was the first university in Europe to be started by a democratic state and not by a church or royalty. It came around 400 years after the University of Basel which started in 1460. Since 1525 there had already been a law, medicine and theology college in Zurich, so when the university began, the college became part of it. It was called the Universitas Turicensis. In the first semester, there were 161 students. Of which, 16 were studying theology, 26 law, 98 medicine and 21 philosophy. There were 26 professors and 29 lecturers. In 1840 the first women were allowed to sit in on lectures at the university. == Campus == The university campus has buildings all over the city of Zürich. The main campuses are in the city centre, Irchelpark and Oerlikon. The construction of the university buildings started in 1973. The campus was inaugurated in 1979. == Museums == There is a Museum of Medical History in the main building of the University. == Academics == University of Zurich and the ETH (Federal Institute for Technology) work together in the fields of bioscience and finance. === Rankings === The Times Higher Education ranked the University of Zurich 26th place in Europe and 85th worldwide. Newsweek ranked the university 11th in Europe and 46th worldwide. == Student Life == The University of Zurich has an Academic Sports Association (ASVZ). The ASVZ offers a wide range of classes. The student association (VSUZH) organizes events and works with the university administration. == Canteens == The university has 16 canteens. Students and Staff get a discount when they show their university ID. ‘Obere Mensa’ is the biggest canteen on campus. They have three set menus for lunch every day. You can choose from two meat options or a vegetarian/vegan option. ‘Untere Mensa’ is just a few steps away and offers three other menus. The menus cost can vary in price, from 6CHF to 17CHF depending on what you choose. Both canteens have a large salad and dessert buffet bar. == Other websites == * Category:19th-century establishments in Switzerland Category:1833 establishments in Europe Zurich Category:Organizations based in Zürich",
 "title": "University of Zurich"
}