{
 "id": "70768",
 "text": "Reductio ad absurdum is a Latin phrase which means \"reduction to the absurd\". The phrase describes a kind of indirect proof. It is a proof by contradiction,Weston, Anthony. (2009). A Rulebook for Arguments, pp. 43-44. and is a common form of argument. It shows that a statement is true because its denial leads to a contradiction, or a false or absurd result. It is a way of reasoning that has been used throughout the history of mathematics and philosophy from classical antiquity onwards. The ridiculous or \"absurdum\" conclusion of a reductio ad absurdum argument can have many forms. For example, * Rocks have weight, otherwise we would see them floating in the air. * Society must have laws, otherwise there would be chaos. *There is no smallest positive rational number, because if there were, it could be divided by two to get a smaller one. == History == The phrase can be traced back to the Greek η εις άτοπον απαγωγή (hê eis átopon apagogê). This phrase means \"reduction to the impossible\". It was often used by Aristotle.Heath, Thomas Little 1908. The Thirteen Books of Euclid's Elements, Vol. 1, p. 136. The method is used a number of times in Euclid's Elements. ==Method== Reduction ad absurdum can be a tool of discovery.Polya, Goerge. (2008). How to Solve It: A New Aspect of Mathematical Method, p. 169. The method of proving something works by first assuming something about it. Then other things are deduced from that. If there is a contradiction, it shows that the first something cannot be correct. For example, > :To prove A is true, correct, valid, credible .... ::Assume the opposite -- > that \"not-A\" is true.... ::Assume that if \"not-A\" is true, then it must mean > or imply B. ::Show that B is false, incorrect, invalid, incredible ... > :Therefore, A must be true after all. ==Related pages== * Mathematical proof * Proof by induction * Straw man * Boltzmann brain ==References== ==Other websites == * Conditional Proof and Reductio ad Absurdum Category:Mathematics Category:Logical fallacies",
 "title": "Reductio ad absurdum"
}