{
 "id": "70765",
 "text": ": See also: Ranked list of Dominican Provinces The Dominican Republic has thirty-one (31) provinces (in Spanish, provincias). The President of the Republic appoints a Civil Governor (Gobernador Civil) in every province. The only function of the Governor is to represent the President of the Republic in the province. The people who live in the province elect one Senator (Senador) and at least two (2) Representatives (Diputados) for the National Congress. The National District (Distrito Nacional) is similar to a province but without a Civil Governor and with only one municipality, Santo Domingo de Guzmán, the national capital. There are two (2) or more municipalities (in Spanish and in singular, municipio) in every province. The municipalities are governed by municipal councils and mayors elected by popular vote. The municipal districts (in Spanish and in singular, distrito municipal) are subdivisions of some municipalities ruled by a municipal council and a mayor. The Dominican Republic has 154 municipalities and 202 municipal districts. The following is a table of the provinces and their capital cities. Population figures in the following table are from the 2010 census. Province Capital Area (km²) Population Density Map Azua Azua de Compostela 1 Baoruco Neiba 2 Barahona Santa Cruz de Barahona 3 Dajabón Dajabón 4 Distrito Nacional Santo Domingo de Guzmán D.N. Duarte San Francisco de Macorís 5 Elías Piña Comendador 6 El Seibo Santa Cruz del Seibo 7 Espaillat Moca 8 Hato Mayor Hato Mayor del Rey 9 Hermanas Mirabal Salcedo 21 Independencia Jimaní 10 La Altagracia Salvaleón de Higüey 11 La Romana La Romana 12 La Vega Concepción de la Vega 13 María Trinidad Sánchez Nagua 14 Monseñor Nouel Bonao 15 Monte Cristi San Fernando de Monte Cristi 16 Monte Plata Monte Plata 17 Pedernales Pedernales 18 Peravia Baní 19 Puerto Plata San Felipe de Puerto Plata 20 Samaná Santa Bárbara de Samaná 22 Sánchez Ramírez Cotuí 23 San Cristóbal San Cristóbal 24 San José de Ocoa San José de Ocoa 25 San Juan San Juan de la Maguana 26 San Pedro de Macorís San Pedro de Macorís 27 Santiago Santiago de los Caballeros 28 Santiago Rodríguez San Ignacio de Sabaneta 29 Santo Domingo Santo Domingo Este 30 Valverde Mao 31 Total - == References == == Other websites == * Political Database of the Americas - Dominican 2002 Constitution * Oficina Nacional de Estadística, Statistics Portal of the Dominican Republic",
 "title": "Provinces of the Dominican Republic"
}