{
 "id": "70787",
 "text": "Lawrence Mark Sanger (born July 16, 1968) is an American internet project developer. He worked with Jimmy Wales to create the online encyclopedias, Nupedia and Wikipedia before he created his own online encyclopedias Digital Universe and Citizendium. Since leaving Wikipedia, he has criticised the site for having a left-wing bias. == Career == Jimmy Wales, through his company Bomis, paid Sanger to help them to maintain Nupedia. On January 2, 2001, Ben Kovitz, Larry Sanger's friend, had the idea to use a wiki to help to make Nupedia better. Larry Sanger in turn told Wales, and on January 15, 2001, Wikipedia was launched. There are different opinions on which of the three people are most responsible for Wikipedia. In 2005, Larry Sanger created Digital Universe, an online encyclopedia like Wikipedia. In 2006, Larry Sanger created Citizendium, another online encyclopedia. Citizendium uses the MediaWiki engine (like Wikipedia) but the rules are different. People must use their given name on Citizendium and experts are given special status in approving articles. In December 2017, Larry Sanger joined Everipedia. He left the project in 2019. In February 2025, Larry Sanger asked Tesla CEO Elon Musk to investigate which branches of the United States government \"have employees who are paid to edit, monitor, update, or lobby on Wikipedia\" and advocated that such departments \"should be defunded\". Musk responded, \"Good idea\".Wikipedia co-founder calls on Elon Musk to probe possible government influence on 'fully woke' site https://nypost.com/2025/03/07/media/wikipedia- co-founder-calls-on-elon-musk-to-investigate-government-influence-over-online- encyclopedia March 7, 2025. New York Post.Wikipedia co-founder may just have agreed with Elon Musk in his 'first viral post in a few years' http://timesofindia.indiatimes.com/articleshow/118593724.cms February 27, 2025 Times of India. Wikipedia co-founder calls on Elon Musk to investigate government influence over online encyclopedia https://www.foxnews.com/media/wikipedia-co-founder-calls-elon-musk- investigate-government-influence-online-encyclopedia March 7, 2025. == References == ==Other websites== * Category:1968 births Category:Living people Category:Wikipedia people Category:American bloggers",
 "title": "Larry Sanger"
}