{
 "id": "707981",
 "text": "The Sniper Elite series is a series of stealth-based World War II third-person shooter video games with special attention placed on long-distance bullet physics. In these games, players need to pay attention to how far their enemies are, the effective range of their sniper rifles, and how hard the wind is blowing, since all of these will affect where the player's bullets will hit. Most of the levels are about the player going to the vantage point (the best place for a sniper to kill his or her target), killing or destroying his or her target, and evacuating the area. Players will need to use stealth throughout the levels, since the player can die with just a few hits. If players fire their rifles when there are loud noises in the background, the player can kill enemy soldiers without other soldiers noticing. However, the player must be careful to hide dead bodies or shoot when no one is watching, since dead bodies will alert other enemy soldiers and make them harder to hit. If the player holds his or her lungs, the in-game time will slow down and there will be a marker that shows where the bullet will hit. The games have an X-ray feature that shows where the bullets hit the enemy and how the bullets injure enemies. Points are awarded based on how far the player is, where the player hits the enemy, and whether other enemy soldiers notice the player killing them. Along with a sniper rifle, the player can also carry a pistol, a submachine gun, and explosives. Some pistols have a suppressor so that the player can kill enemies without being heard, others do not, so the player must be careful when choosing his or her weapons. Submachine guns are best used in emergency close-quarters firefights, but the player must be careful not to waste ammo. Explosives can be used to lay traps for the enemy or protect the player from being flanked. In some of the games, there are DLC levels where the player is sent to assassinate Adolf Hitler. Category:Video game series",
 "title": "Sniper Elite"
}