{
 "id": "708485",
 "text": "The Vermilion Bird is one of the Four Symbols of the Chinese constellations. It represents the fire-element, the south direction, and the season summer correspondingly. Sometimes it is called the Vermilion Bird of the South (, Nán Fāng Zhū Què). It is known as Zhū Què in post Manchu dynasty Standard Modern Mandarin Chinese, Suzaku in Modern Japanese, and Jujak in Modern Korean. The color vermilion is often called chinese red. It is described as a red bird that resembles a pheasant with a five-colored plumage (bird's feathers) and is covered in flames. It is often mistaken for the Fenghuang (Named Chinese Phoenix) due to similarities in appearance, but the two are different creatures. == Seven Mansions of the Vermilion Bird == As with the other three Symbols, there are seven astrological \"Mansions\" (positions of the Moon) within the Vermilion Bird. The names and determinative stars are: Mansion no. Name (pinyin) Translation Determinative star 22 (Jǐng) Well (Good) μ Gem 23 (Guǐ) Ghost θ Cnc 24 (Liǔ) Willow δ Hya 25 (Xīng) Star α Hya 26 (Zhāng) Extended Net υ¹ Hya 27 (Yì) Wings α Crt 28 (Zhěn) Chariot γ Crv == Nature of the symbol == The Vermilion Bird is elegant and noble in both appearance and behavior, with feathers in many different colors of vermilion. It is very selective about what it eats and where it perches. == Stars == Four Symbols Mansion (Chinese name) Romanization Translation Asterisms (Chinese name) Romanization Translation Western star name Chinese star name Romanization Translation Vermilion Bird of the South (南方朱雀)''' Guǐ Ghost Wàichú Outer Kitchen 2 Hya style=\"background: #E34234; color: #FFD700\" Wàichúyī 1st star 3 Hya / HD 74395 style=\"background: #E34234; color: #FFD700\" Wàichúèr 2nd star 14 Hya style=\"background: #E34234; color: #FFD700\" Wàichúsān 3rd star Liǔ Willow Liǔ Willow AEEA (Activities of Exhibition and Education in Astronomy) 天文教育資訊網 2006 年 5 月 28 日 δ Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùyī 1st star style=\"background: #E34234; color: #FFD700\" Liǔxiùjùxīng Separated star style=\"background: #E34234; color: #FFD700\" Liǔxiùxītoudìsānxīng 3rd star in the upper west style=\"background: #E34234; color: #FFD700\" Yùjǐngxīběixīng Star in northwest of Jade Well constellation style=\"background: #E34234; color: #FFD700\" Wǔ The thong style=\"background: #E34234; color: #FFD700\" Chúnhuǒxīng The phoenix σ Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùèr 2nd star η Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùsān 3rd star ρ Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùsì 4th star ε Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùwǔ 5th star ζ Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùliù 6th star ω Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùqī 7th star θ Hya style=\"background: #E34234; color: #FFD700\" Liǔxiùbā 8th star Xīng Star Xīng Star AEEA (Activities of Exhibition and Education in Astronomy) 天文教育資訊網 2006 年 5 月 29 日 α Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùyī 1st star style=\"background: #E34234; color: #FFD700\" Xīngxiùjùxīng Separated star style=\"background: #E34234; color: #FFD700\" Xīngxiùzhōngyāngdàxīng Big star in the center τ1 Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùèr 2nd star τ2 Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùsān 3rd star ι Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùsì 4th star 26 Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùwǔ 5th star 27 Hya style=\"background: #E34234; color: #FFD700\" Xīngxiùliù 6th star HD 82477 & HD 82428 style=\"background: #E34234; color: #FFD700\" Xīngxiùqī 7th star Zhāng Extended Net Zhāng Extended Net AEEA (Activities of Exhibition and Education in Astronomy) 天文教育資訊網 2006 年 5 月 30 日 υ1 Hya style=\"background: #E34234; color: #FFD700\" Zhāngxiùyī 1st star λ Hya style=\"background: #E34234; color: #FFD700\" Zhāngxiùèr 2nd star μ Hya style=\"background: #E34234; color: #FFD700\" Zhāngxiùsān 3rd star HD 87344 style=\"background: #E34234; color: #FFD700\" Zhāngxiùsì 4th star κ Hya style=\"background: #E34234; color: #FFD700\" Zhāngxiùwǔ 5th star φ Hya style=\"background: #E34234; color: #FFD700\" Zhāngxiùliù 6th star Yì Wings Yì Wings AEEA (Activities of Exhibition and Education in Astronomy) 天文教育資訊網 2006 年 5 月 31 日 夢之大地 @ 國立成功大學 WebBBS DreamLand @ National Cheng Kung University WebBBS System ν Hya style=\"background: #E34234; color: #FFD700\" Yìxiùwǔ 5th star HD 100307 style=\"background: #E34234; color: #FFD700\" Yìxiùshíbā 18th star HD 96819 style=\"background: #E34234; color: #FFD700\" Yìxiùshíjiǔ 19th star χ1 Hya style=\"background: #E34234; color: #FFD700\" Yìxiùèrshí 20th star HD 102620 style=\"background: #E34234; color: #FFD700\" Yìxiùèrshíyī 21st star HD 103462 style=\"background: #E34234; color: #FFD700\" Yìxiùèrshíèr 22nd star Zhěn Chariot Qīngqiū Green Hill AEEA (Activities of Exhibition and Education in Astronomy) 天文教育資訊網 2006 年 7 月 22 日 β Hya style=\"background: #E34234; color: #FFD700\" Qīngqiūyī 1st star style=\"background: #E34234; color: #FFD700\" Tǔgōngxīxīng Star in the west of Official for Earthworks and Buildings constellation HD 103596 style=\"background: #E34234; color: #FFD700\" Qīngqiūèr 2nd star 17 Crtthe star is actually located in the constellation Hydra style=\"background: #E34234; color: #FFD700\" Qīngqiūsān 3rd star HD 100393 style=\"background: #E34234; color: #FFD700\" Qīngqiūsì 4th star ξ Hya style=\"background: #E34234; color: #FFD700\" Qīngqiūwu 5th star ο Hya style=\"background: #E34234; color: #FFD700\" Qīngqiūqī 7th star 軍門 Jūnmén Military Gate HD 104309 style=\"background: #E34234; color: #FFD700\" Jūnményī 1st star == In popular culture == *In the mobile game Puzzle & Dragons, the Vermilion Bird is depicted as a beautiful, phoenix-like, winged woman who wields the power of flames, known as the \"Incarnation of Suzaku, Leilan\". *In the Beyblade series, the Vermilion Bird is called Dranzer. *In B-Daman Fireblast, the main protagonist Kamon Godai's B-daman is named Drive Garuburn, whose B-Animal is the Vermilion Bird of the South. *In the Digimon series, Zhuqiaomon is designed after it. *In the Fushigi Yugi series, Miaka Yūki's journey in the Universe of the Four Gods involves her becoming the Priestess of Suzaku. The god is shown as a bird for most of the series, with only the final few episodes showing him in a humanoid, winged form. *In the video game Final Fantasy Type-0 the Vermilion Bird is the name of one of the four Crystals of Orience, representing the Dominion of Rubrum. *In the video game Final Fantasy XIV Suzaku is one of the auspices introduced in the second expansion of the game, Stormblood. *In the film Gamera 3: The Revenge of Iris, the monster Iris is at one point suggested to be the Vermilion Bird. *In the Yu Yu Hakusho series, Suzaku is portrayed in a humanoid form as leader of the Underworld group The Four Beasts. *In the Sunrise anime series Code Geass, a character is named Suzaku Kururugi. *In the PlayStation 4 exclusive game titles Nioh, there is a spirit guardian phoenix named Suzaku that will resurrect players upon death by activating their living weapon. Once the living weapon runs out, the player is brought back with one hit point. *In Tokyo Majin, the Vermilion Bird has a vessel who is a character known as Marie Claire. *In Kemono Friends, the Vermilion Bird is anthropomorphised (Designed differently) along with the other Chinese Four Symbols. *In Yami no Matsuei, the Vermillion Bird, known only as Suzaku, appears as a shikigami (conjured spirit) that is summoned by Asato Tsuzuki *In Overwatch's 2018 Chinese New Year (Year of the Dog) event, Mercy, one of the game's support heroes, has a cosmetic skin (alternative design for the character) based on this legendary bird. *In World of Warcraft: Mists of Pandaria, the Vermillion bird has been used as the major inspiration to create Chi-Ji, the Red Crane. *In Sekiro, the upgrade to the Loaded Umbrella prosthetic tool, Suzaku’s Lotus Umbrella is a red shield that protects the player from fire damage. == Related pages == *Fenghuang *Phoenix (mythology) == References == Category:Legendary creatures",
 "title": "Vermilion Bird"
}