{
 "id": "708688",
 "text": "NSYNC (sometimes called *NSYNC or 'N Sync) was an American vocal group and pop boy band formed by Chris Kirkpatrick in Orlando, Florida, in 1995 and launched in Germany by BMG Ariola Munich. The group consists of Kirkpatrick, JC Chasez, Joey Fatone, Justin Timberlake, and Lance Bass. Their self-titled debut album was successfully released to European countries in 1997, and later entered the U.S. market with the single \"I Want You Back\". The group's third studio album, No Strings Attached, sold over one million copies in one day and 2.42 million copies in one week, which was a record for over fifteen years. They also provided songs on the Billboard Hot 100 including Bye Bye Bye, Tearin' Up My Heart, and It's Gonna Be Me, which became NSYNC's only number-one song on the chart. They took a break after their very last concert, but never released new music since. Afterwards, Timberlake and Chasez released solo albums. Justin Timberlake went on to become one of the world's best-selling music artists, with more than 56 million records sold throughout his solo career. NSYNC went on a hiatus in 2002 and briefly reunited at the 2023 MTV Video Music Awards and presented the Best Pop Award. They recorded \"Better Place\", their first new song in 23 years, for the DreamWorks Animation film Trolls Band Together. In November 2024, JC Chasez stated during a podcast appearance that there are no immediate plans, for NSYNC going into the future. == Band members == * JC Chasez \\- Melody/1st tenor (1995–2004; 2023–2024) * Justin Timberlake \\- Melody/2nd tenor (1995–2004; 2023–2024) * Chris Kirkpatrick \\- Countertenor (1995–2004; 2023–2024) * Joey Fatone \\- Baritone (1995–2004; 2023–2024) * Lance Bass \\- Bass (1995–2004; 2023–2024) === Former member === * Jason Galasso – Bass (1995) == Albums == **NSYNC - May 26, 1997 (Germany) | March 24, 1998 (US) *Home For Christmas - November 10, 1998 *The Winter Album - November 16, 1998 (Germany) *No Strings Attached - March 21, 2000 *Celebrity - July 24, 2001 *Greatest Hits - October 25, 2005 == Tours == *Headlining ** For the Girl Tour (1997) ** NSYNC in Concert (1998–2000) ** No Strings Attached Tour (2000) ** PopOdyssey Tour (2001) ** Celebrity Tour (2002) * Supporting Act ** The Velvet Rope Tour (supporting Janet Jackson) (1998) ==Legacy== Entertainment Weekly ranked NSYNC as the best boy band of the period late 90s and 2000s; editor Madelne Boardman stated, \"the group has a spot in pop history more than a decade late.\" The Washington Post stated it was one of the two boy bands \"that dominated the late '90s and early '00s.\" According to Billboard, No Strings Attached was the top album of the 2000s (decade), with The Independent listing it among the albums \"that marked the decade.\" Billboard also ranked the group at number four on their list of the biggest boy bands (from the period 1987–2012) according to chart performance, with the staff writing, \"despite having one of the most short-lived boy band careers, 'N Sync was arguably the most famous.\" Several acts have cited the group as an influence, including Kelsea Ballerini, Selena Gomez, Meghan Trainor, Why Don't We and Hayley Williams. On April 30, 2018, NSYNC reunited to receive a star on the Hollywood Walk of Fame. ==Notes== ==References== == Other websites == * Official site * Facebook Category:1995 establishments in the United States Category:1990s American music groups Category:1990s establishments in Florida Category:American boy bands Category:American pop music groups Category:Musical groups established in 1995 Category:Musical groups from Orlando, Florida Category:Musical quintets Category:20th-century disestablishments in Florida Category:2002 disestablishments in the United States Category:Musical groups established in the 2020s",
 "title": "NSYNC"
}