{
 "id": "708864",
 "text": "Jana Pidrmanová (born March 17, 1985, Cheb) is a Czech theatre and film actress. ==Biography== She spent her childhood in Františkovy Lázně and graduated from a hotel high school. After graduation she studied at the Theatre Faculty of the Academy of Performing Arts (DAMU) from 2004 to 2008. Some of her teachers were Eva Salzmannová, Alois Švehlík, Jan Nebeský and Daria Ullrichová. She also studied special education at the University of Hradec Králové. After graduating from the Theatre Faculty of the Academy of Performing Arts (DAMU), she first performed at the South Bohemian Theater (Jihočeské divadlo, České Budějovice) and since 2009 has been performing at the National Theater in Prague. ==Selected theatre roles== * 2008 Hadar Galron: Mikve, Tehíla, Stavovské divadlo, dir. Michal Dočekal * 2010 David Harrower: Blackbird, Una, Divadlo Kolovrat, dir. Jiří Pokorný * 2011 William Shakespeare: Zkrocení zlé ženy, Bianco, Vdova, Národní divadlo, dir. Martin Čičvák * 2011 William Shakespeare: Král Lear, Regan, Národní divadlo, dir. Jan Nebeský * 2012 Molière: Pán z Prasečkova, Julie, Stavovské divadlo, dir. Hana Burešová * 2013 F. F. Šamberk: Jedenácté přikázání, Julie, Stavovské divadlo, dir. David Drábek * 2014 Josef Čapek, Karel Čapek: Ze života hmyzu, Inženýr moderátorka, Jeho larvička, Mravenec, Národní divadlo, dir. Daniel Špinar * 2014 William Shakespeare: Othello, benátský mouřenín, Bianco, Stavovské divadlo, dir. Daniel Špinar * 2015 Mike Bartlett: Zemětřesení v Londýně, Freya, Nová scéna, dir. Daniel Špinar * 2015 Ondřej Havelka, Martin Vačkář: V rytmu swingu buší srdce mé, Zdenka, a mnohé jiné, Národní divadlo, dir. Ondřej Havelka * 2015 Maurice Maeterlinck: Modrý pták, Světlo, Noc, Dcerka, Stavovské divadlo, dir. Štěpán Pácl * 2016 Vítězslav Nezval: Manon Lescaut, Manon, Národní divadlo, dir. Daniel Špinar * 2016 A. P. Čechov: Tři sestry, Máša, Stavovské divadlo, dir. Daniel Špinar == Selected film roles == Year Title Role Director Notes 2007 V hlavní roli film Sabrina Petr Slavík 2009 2Bobule (2Grapes) Marie Vlad Lanné 2010 Bludičky Marie Irena Pavlásková 2010 Okresní přebor, part 6. - Lucka Lucka Luňáková Jan Prušinovský 2010 Poste Restante Lída Rantlová, zahradnice Karel Smyczek 2012 O pokladech Barborka Vít Karas 2013 Cirkus Bukowsky Pokorná Jan Pachl 2013 Škoda lásky, part 8. - Diamantová svatba Lenka Černá, redaktorka Vít Karas 2014 Kriminálka Anděl IV. Jiří Chlumský, Jaroslav Fuit npor. Lída Rysová 2014 Poslední z Aporveru (The Last Children of Aporver) Maysu Tomáš Krejčí not yet completed 2016 Mordparta Vendy Róbert Šveda, Peter Bebjak 2018 Zbraslavské pašije smrtka (Death) Oldřich Vlček 2018 Balada o pilotovi Olina Mossová Ján Sebechlebský 2018 Alenka v zemi zázraků mother Jana Studničková, Otakáro Maria Schmidt 2019 Za oponou Adéla Dan Pánek ==References== ==Other websites== *Jana Pidrmanová in Czech National Theater Archive *Jana Pidrmanová on Česko-Slovenská filmová databáze (Czechoslovak film database) *Jana Pidrmanová on Filmová databáze (Film database) *Jana Pidrmanová on IMDb Category:1985 births Category:Living people Category:Czech stage actors Category:Czech movie actors Category:Czech television actors",
 "title": "Jana Pidrmanová"
}