{
 "id": "709541",
 "text": "Victoria Mary Talbot, born in 1931, is an Australian painter and illustrator. She started her career in Melbourne in 1958. She moved to London where she worked for the well-recognized solo-exhibitionist Arthur Jeffress' Gallery in 1961. This period were successful and became her great breakthrough. During this period, she also finished the portraits of The Duke of Bedford, Lady Astor and Princess Ujrvala Bistraw Shah. In 1962 she had her first solo exhibition in Paris. There were several exhibitions in Australia in 1964. She travelled to Thailand, Cambodia, Hong Kong, Japan and America. After completing her exhibition in Los Angeles in 1965, she returned to London where she commissioned painting the Maharaja by Ciich-Behar. Her colourful and interesting life is reflected in her imaginative images, varied expressions from the observant and quality-conscious eye of an international connoisseur. She moved to Norway in November 1965, fell in love with the country and the tranquility. == Exhibitions == Year City Gallery exhibitions held 1957 Melbourne Australian Galleries 1957 Sydney Terry-Clune Gallery 1961 London Arthur Jeffress Gallery 1962 Paris Jean Giraudoux Galerie 1963 Melbourne South Yarra Gallery 1964 London The Trafford Gallery 1964 London The Trafford Gallery 1967 Paris La Galerie Mouffe 1969 London The Trafford Gallery 1971 Asker Galleri Pan 1973 Melbourne South Yarra Gallery 1976 Oslo Galleri Galtung 1979 Oslo Galleri Galtung 1982 Oslo Galleri Galtung 1986 Elverum Glomdalsmuseet 1988 Melbourne Westpac Victorian Arts Centre Trust Year City Gallery exhibitions held 1989 Sydney Casey Galleries 1992 Oslo Galleri Galtung 1996 Shawnee Oklahoma Mabee & Gerrer Museum of Art – USA Year City Gallery exhibitions held 1998 Roma Galleria Lazzari 1999 Mantova Galleria Accademia, Italia 2005 Oslo Interiør-Galleriet 2011 Oslo Interiør-Galleriet Interiør-Galleriet == Further reading == * McCulloch, Alan McCulloch, Susan McCulloch, Emily McCulloch-Childs. The New McCulloch's Encyclopedia of Australian Art. 4th Edition, Aus Art Melbourne & The Miegunyah Press, 2006. Page 934 * Germaine, Max. Artists and Galleries of Australia, Volumes 1 & 2, Third Edition. Craftsman Press, Sydney, 1990. Page 659 * Germaine, Max. A Dictionary of Women Artists of Australia. Craftsman House, Sydney, 1991. Page 433 * Campbell, Jean. Australian Watercolour Painters: 1780 to the Present Day. Craftsman House, Sydney, 1989. Page 371 * Dictionary of Australian Artists Online, an online resource for biographical data about Australian artists, designers, craftspeople and curators. Category:Australian painters Category:Artists from South Australia Category:Illustrators Category:1931 births Category:Living people",
 "title": "Victoria Mary Talbot"
}