{
 "id": "709672",
 "text": "Quinton is a town of Pittsburg County in the state of Oklahoma in the United States. The population was 863 at the 2020 census. The town was named for Elizabeth Quinton who lived to be 116 years old. Her family still resides in and around the town of Quinton. == Geography == Quinton is at (35.125904, -95.367470). According to the United States Census Bureau, the town has a total area of , of which, of it is land and 0.88% is water. == Demographics == As of the census of 2020, there were 863 people, 334 households, and 218 families in the town. The population density was 965.3 people per square mile (372.7/km²). There were 401 housing units at an average density of 448.5 per square mile (173.2/km²). There were 64.9% White, 0.3% African American, 18.5% Native American, 0.3% Asian, 2.1% from other races, and 13.8% from two or more races. Hispanic or Latino of any race were 5.0% of the population. There were 334 households out of which 35.6% had children under the age of 18 living with them, 44.3% were married couples living together, 29.9% had a female householder with no partner present, 18.6% had a male householder with no partner present, and 34.7% were non-families. 28.1% of all households were made up of individuals and 8.4% had someone living alone who was 65 years of age or older. The average household size was 2.58. In the town, the population was spread out with 28.4% under the age of 18, 8.8% from 18 to 24, 20.4% from 25 to 44, 26.2% from 45 to 64, and 16.2% who were 65 years of age or older. The median age was 37.6 years. For every 100 females, there were 98.4 males. For every 100 females age 18 and over, there were 84.2 males. As of 2022, the median (middle) yearly income for a household was about $28,864, and the median income for a family was about $43,500. The per capita income was about $16,234. About 27.9% of families and 33.0% of all people in Quinton lived below the poverty line. This includes 44.4% of children under 18 years old and 18.5% of people over 65 years old. == References == == Other websites == *Quinton at The Encyclopedia of Oklahoma History and Culture Category:Towns in Oklahoma",
 "title": "Quinton, Oklahoma"
}