{
 "id": "70973",
 "text": "Ancient Armenia was a rocky land of ravines, rivers, rugged cliffs, and hundreds of stone monuments and churches. Many survive to this day inside the Turkish border near Armenia.PRESERVING LOST ARMENIA PHOTO EXHIBIT AT THE STATE HOUSE DRAMATIZES NEED FOR RESTORATION, Carol Stocker - Boston Globe Armenia anciently had far more bigger land than it has now.The Christian Remembrancer - Page 352 by William Scott Ancient Armenia grew larger into parts of what are now Turkey and Iran.Armenia - World Almanac and Book of Facts 2001 == Religion == De Morgan has said there are signs which show that the Armenians, as their other Aryan relatives, were nature worshipers and that this faith in time was later changed to the worship of national gods, of which many were the equivalents of the gods in the Roman, Greek and Persian cultures. The main proto-Armenian (Aryan) god was Ar, the god of Sun, Fire and Revival.Angela Teryan, The cult of Ar god, Yerevan, Aghvank, 1995, p. 3 (in Armenian) The Armenian hypothesis of Indo-European origins connects the name with the Ar- Armenian root meaning light, sun, fire found in Arev (Sun), Arpi (Light of heaven), Ararich (God or Creator), Ararat (place of Arar), Aryan, Arta etc.T. V. Gamkrelidze and V. V. Ivanov, The Early History of Indo-European (aka Aryan) Languages, Scientific American, March 1990; James P. Mallory, \"Kuro- Araxes Culture\", Encyclopedia of Indo-European Culture, Fitzroy Dearborn, 1997. According to the researchers, the name of Ardini religious center of ancient Urartu also related to the god Ar-Arda.(in Russian) Тер-Саркисянц, Алла, История и культура армянского народа с древнейших времен до начала 19 в.. М. Вост. лит., 2005, 686 с., c. 54 The cult of Ar appear in Armenian Highland during 5-3th millennium BC and had common Indo-European recognition: Ares (Greek), Ahuramazd (Persian) Ertag (German), Ram (Indian), Yar-Yarilo (Slavonic) etc.Grigor Kapantsian, The cult of Ara Geghetsik, Yerevan, 1944, p. 84 After adoption of Christianity the cult of Ar was also evident in Armenia, remembered in the national myth, poetry, art and architecture. ==Related pages== * Urartu * Armens * Nairi * Religion in ancient Armenia == References == == Other websites == * History of Armenia * Ancient Armenia on ArmeniaPedia.org * History of Ancient Armenia and Urartu Category:Ancient Armenia",
 "title": "Ancient Armenia"
}