{
 "id": "70993",
 "text": "During the 175 years since its independence, the Dominican Republic has counted 53 people in the presidential office, whether constitutional, provisional or interim, divided into 66 periods of government. Likewise, there are also those periods in which the head of the State has been exercised by collegiate bodies (such as triumvirates, military juntas or councils of state). == Republic of Spanish Haiti (1821–1822) == Portrait Name (Birth-Death) Term of office Notes Start End José Núñez de Cáceres (1772-1846) 1 December 1821 9 February 1822 President of Spanish Haiti. == Haitian annexation (1822–1844) == Portrait Name (Birth-Death) Term of office Notes Start End Jean-Pierre Boyer (1776-1850) 9 February 1822 13 February 1843 President of Haiti. Exiled in Jamaica. Charles Rivière-Hérard (1789-1850) 4 April 1843 27 February 1844 President of Haiti. ==Presidents of the Dominican Republic (1844–present)== === First Republic (1844–1861) === ==== Central Government Junta ==== The Central Government Junta was the first body of a collegiate and provisional nature to exercise the executive, legislative and judicial powers of the nascent Dominican state. It was provisionally constituted on 28 February 1844 and subsequently formalized on 1 March 1844; it went through two coups d'état, and finally dissolved with the proclamation of the first Constitution on 6 November 1844. Portrait Name (Birth–Death) Term of office Notes Start End 1 Francisco del Rosario Sánchez (1817–1861) 28 February 1844 1 March 1844 Interim president of the Central Government Junta. 2 Tomás Bobadilla (1795–1871) 1 March 1844 9 June 1844 President of the Central Government Junta. Ousted from office by a coup d'état. 1 Francisco del Rosario Sánchez (1817–1861) 9 June 1844 12 July 1844 President of the Central Government Junta. Ousted from office by a coup d'état. 3 Pedro Santana (1801–1864) 12 July 1844 14 November 1844 President of the Central Government Junta. ==== Presidents ==== Portrait Name (Birth–Death) Term of office Elections Notes Start End 3 Pedro Santana (1801–1864) 14 November 1844 4 August 1848 1844 Resigned. 4 Manuel Jimenes (1808–1854) 8 September 1848 29 May 1849 1848 Ousted from office by a coup d'état. 3 Pedro Santana (1801–1864) 30 May 1849 23 September 1849 — He hold the title \"Supreme Chief\" (meaning \"Jefe Supremo\" in Spanish). 5 Santiago Espaillat (1785–185?) President-elect Espaillat never took office. — July 1849 Espaillat was senator for Santiago when he was elected President by the electoral college, but he did not accept the office as he was afraid that his predecessor (Santana) would undermine his ability to govern. 6 Buenaventura Báez (1812–1884) 24 September 1849 15 February 1853 Aug. 1849 3 Pedro Santana (1801–1864) 15 February 1853 26 May 1856 1853 Resigned. 7 Manuel de Regla Mota (1795–1864) 2 January 1855 30 May 1855 — Vice-president under Pedro Santana. Acting president. 2 July 1855 5 September 1855 — Vice-president under Pedro Santana. Acting president. 26 May 1856 8 October 1856 — Vice-president under Pedro Santana, assumed the presidency after his resignation. Resigned. 6 Buenaventura Báez (1812–1884) 8 October 1856 12 June 1858 — Vice-president under Manuel de Regla Mota, assumed the presidency after his resignation. Resigned. 8 José Desiderio Valverde (1822–1903) 7 July 1857 31 August 1858 — Self-appointed president in Santiago de los Caballeros. 3 Pedro Santana (1801–1864) 13 June 1858 31 January 1859 — 31 January 1859 18 March 1861 1859 Approved the annexation of the country to Spain. === Spanish annexation (1861–1865) === Portrait Name (Birth–Death) Term of office Notes Start End 3 Pedro Santana (1801–1864) 18 March 1861 20 July 1862 Captain-General of Santo Domingo. Resigned. Created 1st Marquess of Las Carreras in 1862. 9 Felipe Ribero y Lemoyne (1797–1873) 20 July 1862 22 October 1863 Captain-General of Santo Domingo. 10 Carlos de Vargas Machuca y Cerveto (1803–1879) 23 October 1863 30 March 1864 Captain-General of Santo Domingo. 11 José de la Gándara y Navarro (1820–1885) 31 March 1864 11 July 1865 Captain-General of Santo Domingo. === Dominican Restoration War (1863–1865) === Portrait Name (Birth–Death) Term of office Notes Start End 12 José Antonio Salcedo (1816–1864) 14 September 1863 10 October 1864 13 Gaspar Polanco (1801–1864) 10 October 1864 24 January 1865 14 Benigno Filomeno de Rojas (1821–1865) 24 January 1865 24 March 1865 15 Pedro Antonio Pimentel (1830–1874) 25 March 1865 11 July 1865 Spain concedes defeat and orders a withdraw from the island. === Presidents of the Second Republic (1865–1916) === * * * * Portrait Name (Birth–Death) Term of office Elections Political party Notes Start End 15 Pedro Antonio Pimentel (1830–1874) 11 July 1865 4 August 1865 — — Ousted from office by a coup d'état. 16 José María Cabral (1816–1899) 4 August 1865 15 November 1865 — Blue Cabral was proclaimed \"Protector of the Republic\" until the election of a new president by the National Convention. 17 Pedro Guillermo (1814–1867) 15 November 1865 8 December 1865 — — Guillermo was appointed as Interim President until the arrival to the Dominican Republic of Buenaventura Báez, who was exiled in Curaçao. 6 Buenaventura Báez (1812–1884) 8 December 1865 29 May 1866 1865 Red Ousted from office by a coup d'état. 18 Triumvirate 29 May 1866 22 August 1866 — — Members: Pedro Antonio Pimentel, Gregorio Luperón, Federico de Jesús García. The Electoral College system was abolished and replaced by universal direct suffrage. 16 José María Cabral (1816–1899) 22 August 1866 29 September 1866 — Blue Interim president. 29 September 1866 31 January 1868 1866 Blue Cabral was the first Dominican president elected by universal direct suffrage. Ousted from office by a coup d'état. 19 Manuel Altagracia Cáceres (1838–1878) 31 January 1868 13 February 1868 — — 20 Junta of Generals 13 February 1868 2 May 1868 — — Members: José Antonio Hungría, Francisco Antonio Gómez Báez, José Ramón Luciano y Franco. 6 Buenaventura Báez (1812–1884) 2 May 1868 2 January 1874 1868 Red Ousted from office by defeat in the Six Years' War. 21 Ignacio María González (1838–1915) 25 November 1873 21 January 1874 — Green Supreme chief. 19 Ignacio María González (1838–1915) Manuel Altagracia Cáceres (1838–1878) 21 January 1874 5 February 1874 — — Generals in charge of the Supreme Power of the Nation. 21 Ignacio María González (1838–1915) 5 February 1874 23 February 1876 1874 Green Resigned. 22 Council of Secretaries of State 23 February 1876 29 April 1876 — — Members: Pedro Tomás Garrido Matos, José de Jesús Eduardo de Castro Álvarez, Pedro Pablo de Bonilla y Correa-Cruzado, Juan Bautista Zafra y Miranda, Pablo López Villanueva (until 7 March 1876), Jacinto Peynado y Tejón (since 7 March 1876). 23 Ulises Francisco Espaillat (1823–1878) 29 April 1876 5 October 1876 1876 Blue Ousted from office by a coup d'état. 24 Superior Governing Junta 5 October 1876 11 November 1876 — — Members: Pedro Tomás Garrido Matos, José de Jesús Eduardo de Castro Álvarez, Juan Bautista Zafra y Miranda, Pablo López Villanueva, José Caminero Matías, Fidel Rodríguez Urdaneta, Juan Esteban Ariza Matos. 21 Ignacio María González (1838–1915) 11 November 1876 9 December 1876 — Green Resigned. 25 Marcos Antonio Cabral (1842–1903) 10 December 1876 26 December 1876 — — President of the Provisional Government Junta. 6 Buenaventura Báez (1812–1884) 27 December 1876 2 March 1878 — Red Ousted from office by a coup d'état. 21 Ignacio María González (1838–1915) 1 March 1878 3 May 1878 — Green President of the Provisional Government of the National Movement. 26 Council of Secretaries of State 2 March 1878 5 March 1878 — — Members: José María Cabral, Joaquín Montolío. 27 Cesáreo Guillermo (1847–1885) 5 March 1878 6 July 1878 — Red Interim president. 21 Ignacio María González (1838–1915) 6 July 1878 2 September 1878 1878 Green Ousted from office by a coup d'état. 28 Superior Leaders of the Revolutionary Movement 2 September 1878 6 September 1878 — — Members: Ulises Heureaux, Cesáreo Guillermo. 29 Jacinto de Castro (1811–1896) 7 September 1878 29 September 1878 — — President of the Supreme Court of Justice. Resigned. 30 Council of Secretaries of State 30 September 1878 27 February 1879 — — Members: Cesáreo Guillermo, Alejandro Angulo Guridi, Pedro María Aristy. 27 Cesáreo Guillermo (1847–1885) 27 February 1879 6 December 1879 1879 Red Ousted from office by a coup d'état. 31 Gregorio Luperón (1839–1897) 6 October 1879 1 September 1880 — Blue 32 Fernando Arturo de Meriño (1833–1906) 1 September 1880 1 September 1882 1880 Blue 33 Ulises Heureaux (1845–1899) 1 September 1882 1 September 1884 1882 Blue 34 Francisco Gregorio Billini (1844–1898) 1 September 1884 16 May 1885 1884 Blue Resigned. 35 Alejandro Woss y Gil (1856–1932) 16 May 1885 6 January 1887 — Blue Vice-president under Francisco Gregorio Billini, assumed the presidency after his resignation. 33 Ulises Heureaux (1845–1899) 6 January 1887 27 February 1889 1886 Blue 27 February 1889 27 February 1893 1888 Blue 27 February 1893 27 February 1897 1892 Blue 27 February 1897 26 July 1899 1896 Blue Assassinated. 36 Wenceslao Figuereo (1834–1910) 26 July 1899 30 August 1899 — Blue Vice-president under Ulises Heureaux, assumed the presidency after his assassination. Ousted from office by a coup d'état. 37 Council of Secretaries of State 31 August 1899 — — Members: Tomás Demetrio Morales, Arístides Patiño, Enrique Henríquez y Alfau, Jaime R. Vidal, Braulio Álvarez. 38 People's Revolutionary Governing Junta 31 August 1899 4 September 1899 — — Members: Mariano Cestero, Álvaro Logroño, Arístides Patiño, Pedro María Mejía. 39 Horacio Vásquez (1860–1936) 4 September 1899 15 November 1899 — Red Interim president. 40 Juan Isidro Jimenes Pereyra (1846–1919) 15 November 1899 2 May 1902 1899 Blue Ousted from office by a coup d'état. 39 Horacio Vásquez (1860–1936) 26 April 1902 23 April 1903 — Red Ousted from office by a coup d'état. 35 Alejandro Woss y Gil (1856–1932) 23 March 1903 1 August 1903 — Blue Interim president. 1 August 1903 24 November 1903 1903 Blue Ousted from office by a coup d'état. 41 Carlos Felipe Morales (1868–1914) 24 November 1903 17 June 1904 — Red Interim president. 17 June 1904 24 December 1905 1904 Red Resigned. 42 Council of Secretaries of State 24 December 1905 29 December 1905 — — Members: Manuel Lamarche García, Emiliano Tejera, Andrés Julio Montolío, Francisco Leonte Vásquez Lajara, Carlos Ginebra, Eladio Victoria, Federico Velásquez y Hernández. 43 Ramón Cáceres (1866–1911) 29 December 1905 1 July 1908 — Red Vice-president under Carlos Felipe Morales, assumed the presidency after his resignation. 1 July 1908 19 November 1911 1908 Red Assassinated at the start of the 1911–12 Civil War. 44 Council of Secretaries of State 19 November 1911 5 December 1911 — — Members: Miguel Antonio Román, José María Cabral. 45 Eladio Victoria (1864–1939) 5 December 1911 27 February 1912 — — Interim president appointed by the Congress. 27 February 1912 30 November 1912 1912 — Resigned. 46 Adolfo Alejandro Nouel (1862–1937) 1 December 1912 13 April 1913 — — Archbishop of Santo Domingo, interim president appointed by the Congress. Resigned. 47 José Bordas Valdez (1874–1968) 14 April 1913 15 June 1914 — — Interim president appointed by the Congress. 15 June 1914 27 August 1914 June 1914 — Resigned. 48 Ramón Báez (1858–1929) 28 August 1914 5 December 1914 — — Interim president. 40 Juan Isidro Jimenes Pereyra (1846–1919) 6 December 1914 4 May 1916 Oct. 1914 Blue === United States occupation (1916–1924) === * * * Portrait Name (Birth–Death) Term of office Notes Start End 40 Juan Isidro Jimenes Pereyra (1846–1919) 4 May 1916 7 May 1916 Resigned due to the United States occupation. 49 Council of Secretaries of State 7 May 1916 31 July 1916 Members: Jaime Mota, Bernardo Pichardo, Federico Velásquez y Hernández. 50 Francisco Henríquez y Carvajal (1859–1935) 31 July 1916 29 November 1916 Interim president appointed by the Congress. Removed by the United States. 51 Harry Shepard Knapp (1856–1923) 29 November 1916 18 November 1918 Military Governor. 52 Edwin Anderson Jr. (1860–1933) 23 August 1917 11 September 1917 Acting Military Governor. 53 Joseph Henry Pendleton (1860–1942) 5 February 1918 17 March 1918 Acting Military Governor. 6 April 1918 1 June 1918 Acting Military Governor. 2 July 1918 1 September 1918 Acting Military Governor. 54 Ben Hebard Fuller (1870–1937) 18 November 1918 25 February 1919 Military Governor. 55 Thomas Snowden (1857–1930) 25 February 1919 3 June 1921 Military Governor. 56 Samuel Shelburne Robison (1867–1952) 3 June 1921 21 October 1922 Military Governor. 57 Harry Lee (1872–1935) 3 January 1922 19 February 1922 Acting Military Governor. 14 June 1922 24 July 1922 Acting Military Governor. 58 Juan Bautista Vicini Burgos (1871–1935) 21 October 1922 12 July 1924 Interim president. === Presidents of the Third Republic (1924–1965) === * * * * * * * Portrait Name (Birth–Death) Term of office Elections Political party Notes Start End 39 Horacio Vásquez (1860–1936) 12 July 1924 3 March 1930 1924 Red Ousted from office by a coup d'état. 59 Rafael Estrella Ureña (1889–1945) 3 March 1930 16 August 1930 — Republican Minister of Interior and Police under Horacio Vásquez, assumed the presidency after coup d'état. Puppet president of Rafael Trujillo. 60 Rafael Trujillo (1891–1961) 16 August 1930 16 August 1934 1930 Confederation of Parties 16 August 1934 16 August 1938 1934 PD 61 Jacinto Peynado (1878–1940) 16 August 1938 7 March 1940 1938 PD Died in office. Puppet president of Rafael Trujillo. 62 Manuel de Jesús Troncoso (1878–1955) 7 March 1940 18 May 1942 — PD Vice-president under Jacinto Peynado, assumed the presidency after his death. Puppet president of Rafael Trujillo. 60 Rafael Trujillo (1891–1961) 18 May 1942 16 August 1947 1942 PD Finished the presidential term of Jacinto Peynado ending on 16 August 1942. 16 August 1947 16 August 1952 1947 PD 63 Héctor Trujillo (1908–2002) 1 March 1951 1 October 1951 — PD Acting president. 16 August 1952 16 August 1957 1952 PD Puppet president of Rafael Trujillo. 16 August 1957 3 August 1960 1957 PD Resigned. Puppet president of Rafael Trujillo. 64 Joaquín Balaguer (1906–2002) 3 August 1960 31 December 1961 — PD Vice-president under Héctor Trujillo, assumed the presidency after his resignation. Puppet president of Rafael Trujillo until the assassination of Trujillo on 30 May 1961. Resigned. 65 — Council of State 1 January 1962 16 January 1962 — — Members: Joaquín Balaguer (President), Rafael Filiberto Bonnelly (Vice-president), Eduardo Read Barreras (Second Vice-president), Eliseo Pérez Sánchez, Nicolás Pichardo, Luis Amiama Tió, Antonio Imbert Barrera. Ousted from office by a coup d'état. 66 — Civic-Military Junta 16 January 1962 18 January 1962 — Military Members: Huberto Bogaert (President), Armando Óscar Pacheco, Luis Amiama Tió, Antonio Imbert Barrera, Enrique Valdez Vidaurre, Wilfredo Medina Natalio, Neit Rafael Nivar Seijas. 67 — Council of State 18 January 1962 27 February 1963 — — Members: Rafael Filiberto Bonnelly (President), Eduardo Read Barreras, Eliseo Pérez Sánchez, Nicolás Pichardo, Luis Amiama Tió, Antonio Imbert Barrera, Donald Reid Cabral. 68 Juan Bosch (1909–2001) 27 February 1963 25 September 1963 1962 PRD Ousted from office by a coup d'état. 69 Víctor Elby Viñas Román (1925–2004) 25 September 1963 26 September 1963 — Military President of the Provisional Government Junta. 70 — Triumvirate 26 September 1963 23 December 1963 — Military Members: Emilio de los Santos (President), Manuel Enrique Tavares Espaillat, Ramón Tapia Espinal. 71 — Triumvirate 23 December 1963 25 April 1965 — Military Members: Donald Reid Cabral (President), Ramón Tapia Espinal (resigned on 8 April 1964), Ramón Cáceres Troncoso (since 8 April 1964), Manuel Enrique Tavares Espaillat (resigned on 27 June 1964). Deposed during the Dominican Civil War. === Dominican Civil War (1965) === Faction Portrait Name (Birth–Death) Term of office Notes Start End 72 — — Revolutionary Committee 25 April 1965 Members: Vinicio Fernández Pérez, Giovanni Gutiérrez Ramírez, Francisco Caamaño, Eladio Ramírez Sánchez, Pedro Bartolomé Benoit. 73 Constitutionalist (Pro-Bosch) José Rafael Molina Ureña (1921–2000) 25 April 1965 27 April 1965 Resigned. 74 Francisco Caamaño (1932–1973) 4 May 1965 3 September 1965 President appointed by the Congress. Resigned. 75 Loyalist (Government) (Anti-Bosch) colspan=5 76 — Military Junta 1 May 1965 7 May 1965 Members: Pedro Bartolomé Benoit (President), Olgo Santana Carrasco, Enrique Apolinar Casado Saladín. Resigned. 77 — Government of National Reconstruction 7 May 1965 30 August 1965 Members: Antonio Imbert Barrera (President), Carlos Grisolía Poloney, Alejandro Zeller Cocco, Pedro Bartolomé Benoit, Julio Desiderio Postigo Arias (resigned on 10 August 1965), Leonte Bernard Vásquez (since 10 August 1965). Resigned. 78 Transitional Government Héctor García-Godoy (1921–1970) 3 September 1965 1 July 1966 === Presidents of the Fourth Republic (1966–present) === * * * Portrait Name (Birth–Death) Term of office Elections Political party Notes Start End 64 Joaquín Balaguer (1906–2002) 1 July 1966 16 August 1970 1966 PRSC 16 August 1970 16 August 1974 1970 PRSC 16 August 1974 16 August 1978 1974 PRSC 79 Antonio Guzmán Fernández (1911–1982) 16 August 1978 4 July 1982 1978 PRD Committed suicide. 80 Jacobo Majluta Azar (1934–1996) 4 July 1982 16 August 1982 — PRD Vice-president under Antonio Guzmán, assumed the presidency after his suicide. 81 Salvador Jorge Blanco (1926–2010) 16 August 1982 16 August 1986 1982 PRD 64 Joaquín Balaguer (1906–2002) 16 August 1986 16 August 1990 1986 PRSC 16 August 1990 16 August 1994 1990 PRSC 16 August 1994 16 August 1996 1994 PRSC After fraud charges in the elections, an agreement known as the Pact for Democracy (Pacto por la Democracia) was reached, which shortened the presidential term to two years. 82 Leonel Fernández (1953–) 16 August 1996 16 August 2000 1996 PLD 83 Hipólito Mejía (1941–) 16 August 2000 16 August 2004 2000 PRD 84 Leonel Fernández (1953–) 16 August 2004 16 August 2008 2004 PLD 16 August 2008 16 August 2012 2008 PLD 85 Danilo Medina (1951–) 16 August 2012 16 August 2016 2012 PLD 16 August 2016 16 August 2020 2016 PLD 86 Luis Abinader 16 August 2020 16 August 2024 2020 PRM 16 August 2024 Incumbent 2024 PRM ==See also== *President of the Dominican Republic *Vice President of the Dominican Republic *List of colonial governors of Santo Domingo *Politics of the Dominican Republic ==References== Dominican Republic Presidents Presidents",
 "title": "List of presidents of the Dominican Republic"
}