{
 "id": "709995",
 "text": "Foot odor (or foot odour) is a type of body odor that affects the feet of humans. Some people think it is an unpleasant smell. Others may enjoy it when they have a foot fetish or olfactophilia (being attracted to certain smells). A 1994 study found that 45% of people with a foot fetish were also aroused by smelly socks and/or feet. ==Causes== The main cause of foot odor is foot sweat. Sweat itself does not smell a lot, but some bacteria can grow better in a sweaty environment, which then cause the odor. These bacteria are normally on our skin and are not harmful. The front part of the foot produces the most sweat. Sweating on the feet can be increased by wearing closed shoes or boots. Especially thick materials such as leather or rubber will hold the sweat in them and can increase the odor intensity. Certain types of socks can also make the smell stronger. ==Odor qualities== The quality (aroma) of foot odor is often described as thick and smelling like cheese. This is because some of the bacteria that create foot odor (like Brevibacteria) are also used in the production of cheese. They produce the chemical 3-Methylbutanoic acid, which is a main part that is responsible for the odor. This chemical is also often used to make perfumes. Because of acids in the foot sweat, the odor may also be sour, similar to that of vinegar. Other things that can influence foot smell are the type of socks and shoes a person wears, how long they are worn at a time, and many individual factors, for example if the person does a lot of sports or other physical activities. Because men sweat more than women, they generally have smellier feet. ==Prevention== The best method for preventing food odor is to maintain a good foot hygiene. Regular cleaning of the feet removes dead skin cells from the feet, along with sebum (a type of body oil). This reduces the opportunities for bacteria to cause smelly feet. By regularly cleaning feet properly, feet will not have a strong foot odor. A foot file or pumice stone can be used to remove dead skin cells. ==References== Category:Hygiene Category:Feet",
 "title": "Foot odor"
}