{
 "id": "710026",
 "text": "Montero Lamar Hill (born April 9, 1999), known by his stage name Lil Nas X ( ), is an American rapper, singer, and songwriter. Hill came to international attention for his country rap single \"Old Town Road\", which first achieved viral popularity on the micro-platform video sharing app TikTok in early 2019, and was Diamond Certified by November the same year.Espinoza, Joshua (March 13, 2019). \"Rapper Lil Nas X Scored a Billboard Hot 100 Hit Thanks to a TikTok Meme.\" Complex.com. Retrieved April 8, 2019. The song reached number one on the US Billboard Hot 100 and remained there for nineteen weeks, the longest for any song since the chart debuted in 1958. He produced the original version song by buying a $30 beat off of the internet and paying $20 to record for an hour in a discount Atlanta studio. In June 2019, Nas X came out as gay, the only artist ever to have done so while having a number-one record. \"Old Town Road\" earned him two MTV Video Music Awards including Song of the Year and the American Music Award for Favorite Rap/Hip Hop Song. Nas X is the only openly LGBTQ artist to win a Country Music Association award. He won two Grammy Awards for Best Music Video and Best Pop Duo/Group Performance, along with being nominated six others, the most for any male in 2019. TIME named him to their inaugural TIME 100 Next list. == Songs == His debut EP, 7, was released in June 2019 with its second single, \"Panini\", peaking at number five on the Hot 100 and three on Rolling Stone's Top 100. Its third single \"Rodeo\" with Cardi B, peaked at number nine on the Rolling Stone Top 100. , his songs have been streamed over 2.3 billion times. == Discography == * Nasarati (2018) * October 31st (2018) * 7 (2019) * MONTERO (2021) * Days Before Dreamboy (2025) ==Notes== ==References== Category:1999 births Category:Living people Category:LGBT African-Americans Category:American TikTokers Category:Twitch (service) streamers Category:Singers from Georgia (U.S. state) Category:LGBT singers Category:Country musicians from Georgia (U.S state) Category:American rock singers Category:American pop singers Category:Rappers from Georgia (U.S. state) Category:Hip hop musicians Category:American Grammy Award winners Category:American singer-songwriters Category:Writers from Georgia (U.S. state) Category:African-American rappers Category:American country singers Category:American pop rappers Category:American hip hop singers Category:LGBT people from Georgia (U.S. state) Category:American LGBT rights activists Category:Musicians from Atlanta Category:Pseudonyms Category:Tenors",
 "title": "Lil Nas X"
}