{
 "id": "710184",
 "text": "The Minister of Home Affairs (or simply, the Home Minister) is the head of the Ministry of Home Affairs of the Government of India. ==List of Home Ministers== № Name Portrait Term of office Political party (Alliance) Political party (Alliance) Prime Minister 1 Vallabhbhai Patel 15 August 1947 12 December 1950 Indian National Congress Jawaharlal Nehru 2 Jawaharlal Nehru 12 December 1950 26 December 1950 3 C. Rajagopalachari 26 December 1950 05 November 1951 4 Kailash Nath Katju 05 November 1951 10 January 1955 5 Govind Ballabh Pant 10 January 1955 25 February 1961 6 Lal Bahadur Shastri 25 February 1961 01 September 1963 7 Gulzarilal Nanda 01 September 1963 09 November 1966 Jawaharlal Nehru Lal Bahadur Shastri Indira Gandhi 8 Indira Gandhi 09 November 1966 13 November 1966 Indira Gandhi 9 Yashwantrao Chavan 13 November 1966 27 June 1970 (8) Indira Gandhi 27 June 1970 05 February 1973 10 Uma Shankar Dikshit 05 February 1973 10 October 1974 11 Kasu Brahmananda Reddy 10 October 1974 24 March 1977 12 Charan Singh 24 March 1977 01 July 1978 Janata Party Morarji Desai 13 Morarji Desai 01 July 1978 24 January 1979 14 Hirubhai M. Patel 24 January 1979 28 July 1979 (9) Yashwantrao Chavan 28 July 1979 14 January 1980 Janata Party (Secular) Charan Singh 15 Zail Singh 14 January 1980 22 June 1982 Indian National Congress Indira Gandhi 16 R. Venkataraman 22 June 1982 02 September 1982 Indian National Congress Indira Gandhi 17 Prakash Chandra Sethi 02 September 1982 19 July 1984 Indian National Congress Indira Gandhi 18 P. V. Narasimha Rao 19 July 1984 31 December 1984 Indian National Congress Indira Gandhi Rajiv Gandhi 19 Shankarrao Chavan 31 December 1984 12 March 1986 Indian National Congress Rajiv Gandhi (19) P. V. Narasimha Rao 12 March 1986 12 May 1986 Indian National Congress 20 Buta Singh 12 May 1986 02 December 1989 Indian National Congress 21 Mufti Mohammad Sayeed 02 December 1989 10 November 1990 Janata Dal (National Front) V. P. Singh 22 Chandra Shekhar 10 November 1990 21 June 1991 Samajwadi Janata Party (National Front) Chandra Shekhar (20) Shankarrao Chavan 21 June 1991 16 May 1996 Indian National Congress P. V. Narasimha Rao 23 Murli Manohar Joshi 16 May 1996 1 June 1996 Bharatiya Janata Party Atal Bihari Vajpayee 25 H. D. Deve Gowda 1 June 1996 29 June 1996 Janata Dal (United Front) H. D. Deve Gowda 25 Indrajit Gupta 29 June 1996 19 March 1998 Communist Party of India (United Front) H. D. Deve Gowda I. K. Gujral 26 L. K. Advani 19 March 1998 22 May 2004 Bharatiya Janata Party (National Democratic Alliance) Atal Bihari Vajpayee 27 Shivraj Patil 22 May 2004 30 November 2008 Indian National Congress (United Progressive Alliance) Manmohan Singh 28 P. Chidambaram 30 November 2008 31 July 2012 29 Sushilkumar Shinde 31 July 2012 26 May 2014 30 Rajnath Singh 26 May 2014 30 May 2019 Bharatiya Janata Party (National Democratic Alliance) Narendra Modi 31 Amit Shah 30 May 2019 Incumbent ==Ministers of State of Home Affairs== № Name Term of office Political Party Prime Minister Minister of Home Affairs 1 Subodh Kant Sahay April 1990 November 1990 Janata Dal (National Front) V. P. Singh Mufti Mohammed Sayeed 2 Shriprakash Jaiswal 23 May 2004 2009 Indian National Congress (United Progressive Alliance) Manmohan Singh Shivraj Patil P. Chidambaram 3 R. P. N. Singh 28 October 2012 26 May 2014 Sushilkumar Shinde 4 Kiren Rijiju 26 May 2014 30 May 2019 Bharatiya Janata Party (National Democratic Alliance) Narendra Modi Rajnath Singh 5 G. Kishan Reddy 30 May 2019 Incumbent Amit Shah 6 Nityanand Rai ==References== ==Other websites== * Home Ministry, Govt. of India * Amit Shah take charge of Home Ministry of India 2019 Category:Government of India",
 "title": "Minister of Home Affairs (India)"
}