{
 "id": "710255",
 "text": "Iñigo Manterola Ondarra (born 1973 in Orlo) is a Spanish painter and Basque sculptor. == Biography == Iñigo Manterola was born in Orio in 1973. He was born in a familiar core of sailor tradition. Since he was little showed a lot of interest by the drawing and the painting. When he had only 8 years old, his teacher spoke with his mother and aimed him to extracurricular classes of painting. Because of this passion by the art , Iñigo starts his studies of painting in the Faculty of Fine arts in Bilbao between 1993 and 1998, licensing in the speciality of painting. After finishing his studies, Iñigo made diverse workshops between which stand out, on the one hand the workshop of MASTER painting OF THE FIGURACIÓN, together with Antonio López García and Juan José Aquerreta , in the School of Architecture of Pamplona in 2006. On the other hand, the workshop TEXTURES, given by the Australian artist David Kelly with reason o the exhibition AUSTRALIS in the room Kubokutxa of Donostia- San Sebastián in 2010. Besides, we can stand out a lot of projects during his artistic path, as well as Way between two waters, of the figuración to the abstraction ,in 2005, multidisciplinary exhibition that presented to the Gallery ISPILU of Zarautz as in Madrid in the gallery JOVENART. In 2007 Animated Paintings, a seasickness in the Bay of Biscay, in the gallery 3And of Bilbao. In the year 2011 made a project beside the artist Gorka Larrañaga, Txantxareatzen that consisted in making a plastic exercise between both with his back exhibition in the gallery THE HOUSE in Mexico D.F. In the year 2016, made RTRAZO, X-ray of a gesture agonizante, in the room POLVORÍN of the Citadel of Pamplona, that later travelled to the gallery ENELESTUDIO of San Sebastián. == Path == If there is something that stand out in the path of Iñigo is his constant and vital evolution. The need to go burning stages and to present new proposals is tangible. After devoting him 15 years exclusively to the painting, began to incorporate in his projects another type of disciplines like the sculpture, the photography and the installation, with spirit to go growing in his work. Iñigo has been able to expose more than 50 individual exhibitions and 20 collective ,in cities like San Sebastián , Vitoria, Pamplona, Bilbao, Valencia, Seville, Madrid, Barcelona, Biarritz, Mexico D.F , Port wine, Abu Dabi etc., in all has been able to see his evolution. Recently, Iñigo has incorporated the resin to make his pieces and also the dibond like support in his paintings, specifically in the series Rtrazo. Besides, on 21 June of the 2019, Iñigo inaugurated his new study in Zarautz. == Way of work == As Iñigo was born in a family of sailor tradition, his thematic shows prompt to the balcony of the pesqueros of bajura, the arrantzales and the bustle of the port. And it has not changed until today, I save in his exercises, that submerge it by a time in the language no figurativo. Also Manterola has worked the sculpture, converting each piece in an only piece using different materials so much the iron , steel cut ,copper , iron galvanised , nylon, stainless steel, resin or iron painted. Another of the appearances to stand out of Manterola is that it believes in the synergies and in the collaborations with other artists and disciplines. It says that it exists a mutual enrichment in all maridaje. Proof of this are the exercises with artists like Gorka Larrañaga and Samuel Dougados, the project UNYON beside Ivory Jewellers and, more recently, the collaboration with the chef French Hélène Darroze, that has 3 stars Michelin, for the one who has designed the servilleteros of his restaurant of Paris and where in each table luce one of his sculptures. File:Pescadores de bonito.jpg|Fishermen of beautiful. == Bibliography == * Article of Him Figaro of 18 September 2016. == References == == Other websites == * Website * Video New presentation study in Zarautz * Video \"Vision of the art\" Category:Spanish sculptors Category:Spanish painters Category:1973 births Category:Living people Category:20th-century artists Category:21st-century artists",
 "title": "Iñigo Manterola Ondarra"
}