{
 "id": "710547",
 "text": "Kansas State Department Board of Education (KSDE) is Kansas's Board of Education. Its headquarters are in Topeka.\"Welcome to KSDE.\" Kansas State Department of Education. Retrieved on October 25, 2009. The board of education that controls the department is a constitutional group created in Article 6 of the Kansas Constitution. The Board helps decide educational policy for the state's primary and secondary schools. ==References== ==More reading== * Kester, D., & Kester, J. (1985). History of the Kansas State Department of Education. Topeka, KS: Kansas Department of Education. * Throckmorton, A.F. (1967). Kansas Educational Progress: 1858-1967. Topeka, KS: Kansas State Department of Public Instruction. * Throckmorton, Adel F. (1960). Our Kansas System of Education. Topeka, KS: Kansas State Department of Public Instruction. * Yudhijit Bhattacharjee, Strategies Evolve as Candidates Prepare for Kansas Board Races. Science 3 February 2006 311: 588-589 DOI 10.1126/science.311.5761.588 * Yudhijit Bhattarcharjee, Evolution Trumps Intelligent Design in Kansas Vote. Science 11 August 2006 313: 743 DOI 10.1126/science.313.5788.743 * AAAS Board of Directors, On the Kansas State Board of Education Decision on the Education of Students in the Science of Evolution and Cosmology. Science 12 November 1999 286: 1297 DOI 10.1126/science.286.5443.1297b ==Other websites== ;KSDE * * Kansas School District Boundary Map, KSDE ;KGI Online Library * Kansas State Board of Education Meeting Minutes (1968-present) * Kansas Educational Directory (1941-present) * Kansas Education Accountability Report (2000/01-present) * Other KSDE publications at KGI Online Library ;Controversy * Kansas education board downplays evolution State school board OKs standards casting doubt on Darwin. * Kansas Rewrites Science Standards Again * Letters to the Kansas State Board of Education regarding evolution and science curriculum standards , June 7, 2005 * Kansas board of education scraps standards questioning evolution Category:Government of Kansas",
 "title": "Kansas State Department of Education"
}