{
 "id": "710658",
 "text": "The following is a list of deaths that should be noted in September 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==September== ===1=== *Kenneth Baugh, 78, Jamaican politician, MP and Leader of the Opposition (2005).Former JLP MP Dr Ken Baugh has died *Alison Cheek, 92, Australian-born American priest, first female Episcopalian priest.RIP: The Rev. Alison Cheek, first female Episcopal priest to celebrate Eucharist, dies at 92 *Alberto Goldman, 81, Brazilian politician, MP (1979–2006), Minister of Transport (1992–1993) and Governor of São Paulo (2010–2011), problems caused from cancer-related surgery.Morre o ex-governador de SP Alberto Goldman *Katherine MacLean, 94, American science fiction writer (The Missing Man), Nebula Award winner (1971).Katherine MacLean (1925-2019) *Nikon of Boston, 73, American-Albanian Eastern Orthodox prelate, Archbishop of the Albanian Archdiocese (since 2003) and New England (since 2005).In Memoriam: His Eminence, Archbishop Nikon *Joana Sainz García, 30, Spanish dancer and choreographer, injuries caused from a pyrotechnic explosion.Joana Sainz Garcia: Spanish performer killed by exploding pyrotechnic *Jukka Virtanen, 86, Finnish television presenter (Levyraati), movie director (Noin 7 Veljestä), screenwriter (Pähkähullu Suomi) and songwriter, prostate cancer.Viihteen monitaituri Jukka Virtanen on kuollut ===2=== *Atli Eðvaldsson, 62, Icelandic football player (Borussia Dortmund, Fortuna Düsseldorf, national team) and manager, pancreatic cancer.Früherer Fortuna-Profi Edvaldsson mit 62 Jahren gestorben *Carlo Fonseka, 86, Sri Lankan physician, President of the Sri Lanka Medical Council (2012–2017).Professor Carlo Fonseka passed away *Gyoji Matsumoto, 85, Japanese footballer (national team), heart disease.高校サッカー、松本暁司氏が死去 「赤き血のイレブン」モデル *Helmut Rauch, 80, Austrian physicist, member of the Austrian Academy of Sciences (since 1979).Kernphysiker Helmut Rauch verstorben *Joan Antoni Solans Huguet, 77, Spanish urban planner, hit by a car.Muere atropellado el exdirector de Urbanismo de la Generalitat Joan Antoni Solans ===3=== *Halvard Hanevold, 49, Norwegian biathlete, Olympic champion (1998, 2002, 2010).Halvard Hanevold (49) er død *Peter Lindbergh, 74, German fashion photographer (Rolling Stone) and movie director (Inner Voices, Pina Bausch, Der Fensterputzer).Photographer Peter Lindbergh dies aged 74 *Carol Lynley, 77, American actress (Return to Peyton Place, The Pleasure Seekers, The Poseidon Adventure) and model, heart attack.Carol Lynley, ‘The Poseidon Adventure’ Star, Dies at 77 *José de Jesús Pimiento Rodríguez, 100, Colombian Roman Catholic cardinal, Bishop of Montería (1959–1964), Bishop of Garzón (1964–1975) and Archbishop of Manizales (1975–1996), heart failure caused by a fall.Fallece en Santander el que sería el cardenal más viejo del mundo ===4=== *Edgardo Andrada, 80, Argentinian footballer (Rosario Central, Vasco, national team).Morre Andrada, goleiro que levou o milésimo gol de Pelé *Dai Tielang, 88, Singaporean-born Chinese animator (Black Cat Detective, A Deer of Nine Colors, Where is Mama), multiple organ failure.动画片黑猫警长导演戴铁郎逝世 *Patrick Dehornoy, 66, French mathematician, discoverer of Dehornoy order.Décès de Patrick Dehornoy 1952-2019 *Peter Ellis, 61, New Zealand convicted child sex-offender and activist, bladder cancer.Christchurch Civic Creche sex abuser Peter Ellis dies while appealing conviction *Roger Etchegaray, 96, French Roman Catholic cardinal, Auxiliary Bishop of Paris (1969–1970), Archbishop of Marseille (1970–1985) and President of PCCU (1984–1995).French Cardinal Etchegaray, former vice-dean of College of Cardinals, dead at 96 *Stuart B. Levy, 80, American microbiologist, founder of the Alliance for the Prudent Use of Antibiotics, Parkinson's disease.Remembering Stuart Levy: Scientist Behind Animal Husbandry Advocacy ===5=== *Ji Guobiao, 87, Chinese engineer, member of the Chinese Academy of Engineering (since 1994), laryngeal cancer.87岁中国化纤工程技术开拓者季国标逝世！今年已痛失23位院士 *Kiran Nagarkar, 77, Indian novelist (Cuckold) and critic, cerebral hemorrhage.Author Kiran Nagarkar passes away at 77 in Mumbai *Bob Rule, 75, American basketball player (Seattle SuperSonics, Philadelphia 76ers, Cleveland Cavaliers).Bob Rule, forward for original Sonics team, dies at 75 *Francisco Toledo, 79, Mexican expressionist artist, Right Livelihood Award recipient (2005). ===6=== *Chris Duncan, 38, American baseball player (St. Louis Cardinals), glioblastoma.Former Cardinals player Chris Duncan dies at 38 after battle with brain cancer *Robert Mugabe, 95, Zimbabwean politician, Prime Minister (1980–1987), Secretary-General of the Non-Aligned Movement (1986–1989), Chairperson of the African Union (2015–2016) and President (1987–2017), prostate cancer.Zimbabwe ex-President Robert Mugabe dies aged 95 *Abdul Qadir, 63, Pakistani cricketer (national team), heart attack.Pakistan's Abdul Qadir dies aged 63 *Chester Williams, 49, South African rugby union player (Western Province, national team) and coach (Blitzboks), heart attack.Springbok legend Chester Williams dies ===7=== *Robert Axelrod, 70, American actor (Mighty Morphin Power Rangers, The Blob, Digimon Adventure), problems caused from spinal surgery.Robert Axelrod, Actor Who Voiced Lord Zedd in ‘Mighty Morphin Power Rangers,’ Dies at 70 *Roger Boutry, 87, French composer and conductor, Music Director of the Republican Guard (1973–1977).Disparition de Roger Boutry, compositeur et président honoraire de l’Orchestre de la Garde républicaine *Al Carmichael, 90, American football player (Green Bay Packers, Denver Broncos) and stuntman (Spartacus).Al Carmichael, former Broncos player who scored 1st touchdown in team history, has died at 90 *Naiyyum Choudhury, 72, Bangladeshi biochemist, member of the Bangladesh Academy of Sciences (since 2000).Prof Naiyyum Choudhury passes away *Peter Nichols, 92, British playwright (A Day in the Death of Joe Egg, Passion Play, Poppy).Peter Nichols, playwright best known for Joe Egg, dies aged 92 *James Robertson, 81, American politician and lawyer, Judge of the U.S. District Court for the District of Columbia (1994–2010) and member of the U.S. Foreign Intelligence Surveillance Court (2002–2005), heart failure. *Charlie Silvera, 94, American baseball player (New York Yankees, Chicago Cubs) and scout (Atlanta Braves).Charlie Silvera, San Francisco native and longtime Yankees backup catcher, dies at 94 *John Wesley, 72, American actor (Stop! Or My Mom Will Shoot, Superhuman Samurai Syber-Squad, Hang 'Em High), multiple myeloma.‘Fresh Prince of Bel Air’ Actor John Wesley Dies at 72 *Wally Westlake, 98, American baseball player (Pittsburgh Pirates, St. Louis Cardinals, Cleveland Indians).Wally Westlake, one of the last living members of 1954 team, dies at 98 ===8=== *Henri de Contenson, 93, French archaeologist.Comte Henri de CONTENSON *Sir Christopher Dobson, 69, British chemist, Master of St John's College, Cambridge (since 2007), cancer.Professor Sir Christopher Dobson, master of St John’s College, Cambridge, dies at 69 *Ram Jethmalani, 95, Indian lawyer and politician, MP (1977–1984, since 2010), Minister of Law and Justice (1996, 1999–2000) and Urban Development (1998–1999).Ram Jethmalani, Eminent Supreme Court Lawyer and Former Law Minister, Passes Away at 96 *Yisrael Kessar, 88, Yemeni-born Israeli politician, member of the Knesset (1984–1995) and Minister of Transport and Road Safety (1992–1996), pneumonia.Former minister, labor union head Yisrael Kessar dies at 88 *Joseph P. Kolter, 93, American politician and convicted fraudster, member of the U.S. House of Representatives from Pennsylvania's 4th congressional district (1983–1993).Joseph P. Kolter *Lito Legaspi, 77, Filipino actor (Sinong Kapiling? Sinong Kasiping?, Pugoy Hostage: Davao, The Good Daughter), cardiac arrest.Veteran actor Lito Legaspi passes away *Christopher James, 5th Baron Northbourne, 93, British aristocrat, member of the House of Lords (1982–2018).Northbourne *Camilo Sesto, 72, Spanish singer- songwriter (\"Algo Más\", \"Amor Mío, ¿Qué Me Has Hecho?\") and musician, heart failure.Spanish singer-songwriter Camilo Sesto Dies at 72 *Olav Skjevesland, 77, Norwegian Roman Catholic prelate, Bishop of Agder og Telemark (1998–2012).Biskop Olav Skjevesland er død *Carlos Squeo, 71, Argentine footballer (Racing Club, Boca Juniors, national team).Falleció Carlos Squeo, exasistente de Miguel Ángel Brindisi en Barcelona SC ===9=== *Robert Frank, 94, Swiss-American photographer (The Americans) and documentary filmmaker (Cocksucker Blues).Robert Frank, Pivotal Figure in Documentary Photography, Is Dead at 94 *Danny Frawley, 56, Australian footballer (St Kilda, Victoria team), coach (Richmond) and sports commentator (Fox Sports), car crash.St Kilda AFL great Danny Frawley killed in car accident *Jim Greengrass, 91, American baseball player (Cincinnati Reds/Redlegs, Philadelphia Phillies). *Gru, 46, Serbian rapper (\"Da li imaš pravo?\", \"Biću tu\", \"I dalje me žele\") and DJ, paragliding accident.POGINUO GRU Slavni reper Dalibor Andonov stradao u nesreći u Zemunu *Lavrentis Machairitsas, 62, Greek rock songwriter and musician, heart attack.Greek rock star Lavrentis Machairitsas passes away *Fred McLeod, 67, American sportscaster (Cleveland Cavaliers, Detroit Pistons).A Very Sad Cavaliers Family Announcement *Michael Shenstone, 91, Canadian politician, Ambassador to Saudi Arabia (1974–1978) and Austria (1985–1990), key figure during the Iran hostage crisis.Michael Shenstone ===10=== *Stefano Delle Chiaie, 82, Italian political activist, founder of the National Vanguard.Strage di Bologna, è morto Stefano Delle Chiaie *Jeff Fenholt, 68, American musician (Bible Black, Geezer Butler Band), actor (Jesus Christ Superstar) and television evangelist.Jeff Fenholt Dies: Broadway’s Original ‘Jesus Christ Superstar’ Was 68 *Greg Thompson, 72, Canadian politician, MP (1988–1993, 1997–2011) and Minister of Veterans Affairs (2006–2010). ===11=== *B. J. Habibie, 83, Indonesian politician, Vice President (1998) and President (1998–1999), heart failure caused by cardiomyopathy.Former Indonesian President Bacharuddin Jusuf Habibie dies at 83 *Daniel Johnston, 58, American singer-songwriter (\"Walking the Cow\") and visual artist, heart attack.Austin Songwriting Genius Daniel Johnston Dead at 58 *T. Boone Pickens, 91, American businessman and philanthropist, problems caused from a stroke.T. Boone Pickens, the ‘Oracle of Oil,’ corporate raider and billionaire philanthropist, dies at 91 *László Rajk Jr., 70, Hungarian architect (Aquincum Museum) and politician, MP (1988–1994).Elhunyt Rajk László *Shafie Salleh, 72, Malaysian politician, MP (1999–2004) and Minister of Higher Education (2004–2006), liver failure.Ketua Pengakap Negara meninggal dunia *Anne Rivers Siddons, 83, American novelist (The House Next Door, Peachtree Road, Sweetwater Creek), lung cancer.Anne Rivers Siddons, novelist who attended Auburn, dies at 83 *Sándor Tóth, 80, Hungarian poet, journalist and politician, MP (1990–1994).Elhunyt Tóth Sándor író, költő, újságíró *Penny Whetton, 61, Australian climatologist, co-creator of the IPCC Fourth Assessment Report.Penny Whetton, wife of Senator Janet Rice, climate scientist and transgender woman, dies ===12=== *Michael E. Haynes, 92, American minister and politician, member of the Massachusetts House of Representatives (1965–1969).Rev. Dr. Michael E. Haynes *I. Beverly Lake Jr., 85, American politician and lawyer, Chief Justice of the North Carolina Supreme Court (2001–2006). *László Marton, 76, Hungarian theatre director.Meghalt Marton László *ʻAkilisi Pōhiva, 78, Tongan politician and activist, Prime Minister (since 2014), pneumonia and liver disease.Tongan PM 'Akilisi Pohiva dies, aged 78 ===13=== *Asadollah Asgaroladi, 85, Iranian businessman, stroke.Former chairman of Iran-China Joint Chamber of Commerce passes away *Cynthia Cockburn, 85, British academic (Gender & Development), political activist and feminist journalist (Feminist Review), thyroid cancer.Fredsaktivisten och feministen Cynthia Cockburn är död *Paul Cronin, 81, Australian actor (The Sullivans, Matlock Police, State Coroner).Australian TV star Paul Cronin dies aged 81 *Dennis Edwards, 82, English footballer (Slough Town, Charlton Athletic, Portsmouth).Portsmouth mourn death of former Fratton Park and Charlton centre-forward Dennis Edwards *Alex Grammas, 93, American baseball player (St. Louis Cardinals) and coach (Cincinnati Reds, Detroit Tigers).Johnny Bench, Marty Brennaman remember Alex Grammas, Big Red Machine third base coach *Bruno Grandi, 85, Italian sports executive, President of the International Gymnastics Federation (1996–2016).Ginnastica in lutto, è morto Bruno Grandi *Rudi Gutendorf, 93, German footballer (TuS Koblenz) and manager (FC Luzern).Coach legend Rudi Gutendorf is dead *Ghulam Shah Jeelani, 62, Pakistani politician, member of the Provincial Assembly of Sindh (since 2008), kidney failure.PPP lawmaker Ghulam Shah Jeelani passes away in Karachi *György Konrád, 86, Hungarian novelist and political dissident, President of PEN International (1990–1993). *Joachim Messing, 73, German-American microbiologist.Joachim Messing, 73, Who Charted the DNA of Viruses and Plants, Dies *Eddie Money, 70, American pop rock singer-songwriter (\"Baby Hold On\", \"Two Tickets to Paradise\", \"Take Me Home Tonight\") and musician, problems caused from heart surgery and esophageal cancer.Eddie Money, Archetype Of Rock Radio, Dies At Age 70 ===14=== *John Ralston, 92, American Hall of Fame football coach (Utah State, Stanford, Denver Broncos).Legendary and beloved former coach John Ralston dies ===15=== *Lol Mahamat Choua, 80, Chadian politician, President (1979).Tchad : l’ancien président de la République Lol Mahamat Choua est mort à 80 ans *Chadlia Caid Essebsi, 83, Tunisian consort, First Lady (2014–2019), heart attack. *Roberto Leal, 67, Portuguese-Brazilian singer-songwriter (\"Bate o Pé, Clareou\", \"O Vinho de Meu Amor\", \"Marrabenta\"), kidney failure caused by skin cancer.Aos 67 anos, morre o cantor português Roberto Leal *Phyllis Newman, 86, American actress (Subways Are for Sleeping, Mannequin, The Beautician and the Beast), singer and activist, Tony winner (1962), problems caused from lung disease.Phyllis Newman, Tony-Winning Actress in 'Subways Are for Sleeping,' Dies at 86 *Ric Ocasek, 75, American Hall of Fame musician (The Cars), singer-songwriter (\"My Best Friend's Girl\", \"You Might Think\", \"Emotion in Motion\"), and record producer, hypertension and heart disease.Ric Ocasek, Lead Singer of The Cars, Dead in New York at 75 *Mike Stefanik, 61, American racing driver, seven-time NASCAR Whelen Modified Tour champion, plane crash.Nine-Time NASCAR Champion, Modified Racing Legend Mike Stefanik Killed In Plane Crash ===16=== *Henry Buttelmann, 90, American Air Force fighter pilot and flying ace.Henry Buttelmann, the youngest Korean War ace, has passed away *Luigi Colani, 91, German industrial designer and architect.German industrial designer Luigi Colani dies at 91 *Steve Dalachinsky, 73, American poet (A Superintendent’s Eyes), stroke.In Memoriam Steve Dalachinsky *Manuel Delgado Parker, 82, Peruvian businessman, founder of Grupo RPP and Society of Latin America Broadcasting.Fallece Manuel Delgado Parker *H. S. Dillon, 74, Indonesian agricultural expert, political economist and human rights activist. *B. J. Khatal-Patil, 100, Indian politician, activist and writer, MLA (1962–1978, 1980–1985), pneumonia.Congress veteran BJ Khatal Patil passes away at 100 *Sakahoko Nobushige, 58 Japanese sumo wrestler, head coach of Izutsu stable, pancreatic cancer.元関脇逆鉾、井筒親方が死去 58歳すい臓がんか - 大相撲 : 日刊スポーツ *Kodela Siva Prasada Rao, 72, Indian politician, APLA (since 1983), suicide by hanging.Andhra Pradesh: Ex-Speaker Kodela Siva Prasad Rao dies after suicide attempt *Sander Vanocur, 91, American political journalist (NBC, PBS, ABC News) and actor (Without Warning), problems caused from dementia.Sander Vanocur, TV Newsman who covered Kennedy, dies at 91 ===17=== *Khem Singh Gill, 89, Indian geneticist and plant breeder, Vice- Chancellor of the Punjab Agricultural University (1990–1993). *Jessica Jaymes, 40, American Hall of Fame pornographic actress and model (Hustler, Penthouse).Porn star Jessica Jaymes dead at 43 *Imata Kabua, 76, Marshallese politician, President (1997–2000). *Cokie Roberts, 75, American journalist (ABC News, NPR), political commentator, and author, problems caused from breast cancer.Legendary journalist and political commentator Cokie Roberts dies at 75 *Ye Xuanping, 94, Chinese politician, Mayor of Guangzhou (1980–1985) and Governor of Guangdong (1985–1991).Ye Xuanping, a Chinese economic reform warrior, dies, aged 94 ===18=== *Ibrahim El-Orabi, 88, Egyptian military officer, Chief of Staff of Armed Forces (1983–1987).بعد وفاته .. 7 معلومات عن الفريق إبراهيم العرابي *Graeme Gibson, 85, Canadian novelist (Eleven Canadian Novelists) and union leader, Chair of the Writers' Union of Canada (1974–1975) and co-founder of the Writers' Trust of Canada, dementia. *Tony Mills, 57, English rock singer (\"Atlantis\") and musician (Shy, TNT), pancreatic cancer.Tidlegare TNT-vokalist er død *Shyam Ramsay, 67, Indian movie director (Darwaza, Veerana), producer (Ghutan) and screenwriter (Zee Horror Show), pneumonia.Film-maker Shyam Ramsay passes away at 67 *Fernando Ricksen, 43, Dutch footballer (Rangers, Zenit Saint Petersburg, national team), problems caused from ALS. ===19=== *Zine El Abidine Ben Ali, 83, Tunisian military officer and politician, Prime Minister (1987) and President (1987–2011), prostate cancer.Former Tunisian President Zine El Abidine Ben Ali dies aged 83, reports say *Irina Bogacheva, 80, Russian mezzo- soprano.Умерла народная артистка СССР Ирина Богачева *Wim Crouwel, 90, Dutch graphic designer, type designer and typographer. *Marco Feingold, 106, Austrian Holocaust survivor.Morto a 106 anni Marko Feilgold, fu la salvezza di 100000 ebrei *Maurice Ferré, 84, Puerto Rican-born American politician, Mayor of Miami (1973–1985) and member of the Florida House of Representatives (1967–1968), spinal cancer.Former mayor Maurice Ferré, considered the father of modern-day Miami, is dead *Charles Gérard, 96, French actor (The Toy, Animal, A Man and a Woman: 20 Years Later). *Bert Hellinger, 93, German psychotherapist (Family Constellations).Bert Hellinger muere: adiós al padre de las Constelaciones Familiares *Barron Hilton, 91, American businessman, Chairman of Hilton Hotels Corporation (1966–2007), co-founder of the AFL and owner of the Los Angeles Chargers (1960–1966).Conrad N. Hilton Foundation announces the death of Barron Hilton *Sandie Jones, 68, Irish pop singer (\"Ceol an Ghrá\"), Eurovision contestant (1972), cancer.Irish Eurovision singer Sandie Jones dies aged 68 *Harold Mabern, 83, American jazz pianist and composer.Memphis jazz great Harold Mabern has died *María Rivas, 59, Venezuelan Latin jazz singer (\"Muaré\"), composer and painter, cancer.Suena triste ‘El Manduco’: Cáncer acaba con la vida de la cantante María Rivas *Levente Riz, 44, Hungarian politician, MP (2010–2014) and Mayor of Rákosmente (since 2006).Meghalt Riz Levente *Larry Wallis, 70, English songwriter and rock guitarist (Pink Fairies, Motörhead).Larry Wallis, formerly of Motorhead, dies at age 70 ===20=== *Robert Boyd, 91, American journalist (Knight Ridder), Pulitzer winner (1973), congestive heart failure. *Howard Cassady, 85, American Hall of Fame football player (Philadelphia Eagles, Detroit Lions, Cleveland Browns), Heisman Trophy winner (1955).Howard Cassady, former American football player passes away at 85 *Séamus Hegarty, 79, Irish Roman Catholic prelate, Bishop of Raphoe (1982–1994) and Derry (1994–2011), neurodegenerative disease.Former Bishop of Derry Seamus Hegarty dies at 79 *Jan Merlin, 94, American actor (Hell Bent for Leather, Gunfight at Comanche Creek, The St. Valentine's Day Massacre).Jan Merlin obituary *Gregorio Martínez Sacristán, 72, Spanish Roman Catholic prelate, Bishop of Zamora (since 2007).Fallece el obispo de Zamora, Gregorio Martínez Sacristán *Yonrico Scott, 63, American drummer (The Derek Trucks Band).Yonrico Scott, Former Derek Trucks Band Drummer, Has Passed Away *Su Beng, 100, Taiwanese dissident, political activist and historian (Modern History of Taiwanese in 400 Years), Senior advisor (since 2016), pneumonia.快讯：台独教父史明 今晚病逝 享年102岁 ...转自多维新闻网 ===21=== *Napoleon Chagnon, 81, American anthropologist, member of the National Academy of Sciences (since 2012).Napoleon Alphonseau Chagnon *Aron Eisenberg, 50, American actor (Star Trek: Deep Space Nine, The Horror Show, Prayer of the Rollerboys), heart attack caused by kidney disease.Aron Eisenberg Dead: Star Trek’s ‘Nog’ Dies *Sid Haig, 80, American actor (Jason of Star Command, House of 1000 Corpses, 3 From Hell), cardiopulmonary arrest caused by COPD and bowel obstruction.\"3 from Hell\"-Star Sid Haig ist gestorben *Sigmund Jähn, 82, German cosmonaut (Soyuz 31, Soyuz 29), first German to fly in space.Raumfahrer Sigmund Jähn ist tot *Günter Kunert, 90, German writer and political commentator, pneumonia.Dichter Günter Kunert stirb mit 90 *Karin Larsson, 78, Swedish Olympic swimmer (1956, 1960).Karin Ahlström *Woo Hye-mi, 31, South Korean pop singer (The Voice of Korea).Voice of Korea's Woo Hye Mi found deceased in her home (death announced on this date) ===22=== *Vytautas Briedis, 79, Lithuanian rower, Olympic bronze medalist (1968).Netektis irklavimo pasaulyje: užgeso olimpinio prizininko Vytauto Briedžio gyvybė *Harry Joseph Flynn, 86, American Roman Catholic prelate, Archbishop of Saint Paul and Minneapolis (1995–2008), bone cancer.Former Archbishop Harry Flynn dies at 86 *Ivan Kizimov, 91, Russian equestrian, Olympic champion (1968, 1972).Ушел из жизни выдающийся спортсмен и тренер Иван Михайлович Кизимов) *J. Michael Mendel, 54, American television producer (The Simpsons, Rick and Morty, The Critic), Emmy Award winner (1995, 1997, 1998, 2018).J. Michael Mendel, Producer on 'The Simpsons' and 'Rick and Morty,' Dies at 54 *Tom Polanic, 76, Canadian ice hockey player (Minnesota North Stars).Thomas Joseph Polanic *Carl Ruiz, 44, American chef and television personality (Food Network), heart attack. *Sándor Sára, 85, Hungarian cinematographer (Ten Thousand Days, Szindbád) and movie director (The Upthrown Stone).Meghalt Sára Sándor *Jevan Snead, 32, American football player (Tampa Bay Buccaneers, Tampa Bay Storm).Jevan Snead Dead: Former Texas Longhorns QB Dies ===23=== *Al Alvarez, 90, English poet (The New Poetry) and writer (The Biggest Game in Town), pneumonia.Al Alvarez obituary *Madhav Apte, 86, Indian cricketer (national team), President of Cricket Club of India (since 1989), cardiac arrest.Former India opener Madhav Apte dies at 86 *Elaine Feinstein, 88, English poet and novelist, member of the Royal Society of Literature (since 1980). *Robert Hunter, 78, American Hall of Fame lyricist (Grateful Dead, Jerry Garcia, Bob Dylan), poet and guitarist, problems caused by surgery.Robert Hunter, Grateful Dead Collaborator and Lyricist, Dead at 78 *Artūras Rimkevičius, 36, Lithuanian footballer (national team, FK Liepājas Metalurgs, Šiauliai), suicide by gunshot.Tragiška žinia: rastas negyvas buvęs Lietuvos rinktinės puolėjas ir A lygos rekordininkas *Curt Wittlin, 78, Swiss philologist, President of the North-American Catalan Society (1990–1993) and member of the Institute for Catalan Studies (since 1997).El meu Curt Wittlin (1) ===24=== *Mordicai Gerstein, 83, American illustrator (Something Queer Is Going On), movie director (The Berenstain Bears' Christmas Tree) and writer (The Man Who Walked Between the Towers), cancer.Acclaimed artist and children's book author Mordicai Gerstein dies at 83 *Donald L. Tucker, 84, American politician, member of the Florida House of Representatives (1966–1978) and Speaker (1975–1978), cancer.Former Florida House Speaker Donald L. Tucker dies at 84 *Roger H. Zion, 98, American politician, member of the U.S. House of Representatives from Indiana's 8th congressional district (1967–1975). ===25=== *Jesper Hoffmeyer, 77, Danish biologist, heart attack.Nekrolog: Biosemiotikeren Jesper Hoffmeyers historie ville være utænkelig i dag *Arne Weise, 89, Swedish journalist and television personality (SVT).Arne Weise är död 89 år gammal ===26=== *Giovanni Bramucci, 72, Italian road cyclist, Olympic bronze medalist (1968).Ciclismo in lutto, è scomparso Giovanni Bramucci *Jacques Chirac, 86, French politician, President and Co-Prince of Andorra (1995–2007), Prime Minister (1974–1976, 1986–1988) and Mayor of Paris (1977–1995).Jacques Chirac, former French president, dies aged 86 *William Levada, 83, American Roman Catholic cardinal, Archbishop of Portland (1986–1995) and San Francisco (1995–2005). *Ronald L. Schlicher, 63, American politician, Ambassador to Lebanon (1994–1996) and Cyprus (2005–2008).Former U.S. Ambassador Ronald Schlicher, who grew up in Chattanooga, dies at 63 *Kåre Tønnesson, 93, Norwegian historian and educator, Chair of the Norwegian Historical Association (1970–1974).Aftenposten - 28 September 2019 ===27=== *William J. Edwards, 91, American politician, member of the U.S. House of Representatives from Alabama's 1st congressional district (1965–1985), pancreatic cancer.Former Alabama congressman Jack Edwards dies at 91 *Rob Garrison, 59, American actor (The Karate Kid, Iron Eagle, Prom Night).‘Karate Kid’ actor Robert Garrison dead at 59 *John J. Snyder, 93, American Roman Catholic prelate, Bishop of St. Augustine (1979–2000).Retired leader of Diocese of St. Augustine dies at 93 *Joseph C. Wilson, 69, American writer (The Politics of Truth) and politician, Ambassador to Gabon (1992–1995), multiple organ failure.Joseph Wilson, Who Challenged Iraq War Narrative, Dies at 69 ===28=== *José Aldunate, 102, Chilean Roman Catholic theologian and human rights activist.A los 102 años fallece sacerdote jesuita José Aldunate Lyon *Suad Beširević, 56, Slovenian football player (Borac Banja Luka, Apollon Limassol) and manager (Olimpija Ljubljana).Umrl je nekdanji trener Olimpije *Ismail Petra of Kelantan, 69, Malaysian royal, Sultan of Kelantan (1979–2010).28th Kelantan ruler dies *Jan Kobuszewski, 85, Polish actor (Kwiecién, Alternatywy 4, Czterdziestolatek).Famous Polish film and theatre actor dies *José José, 71, Mexican singer (\"El Triste\", \"Como Tú\") and actor (Gavilán o Paloma), pancreatic cancer.Muere el cantante José José a los 71 años de edad *Mark Zakharov, 85, Russian theater and movie director (The Twelve Chairs, An Ordinary Miracle, To Kill a Dragon), pneumonia.Russian theater and film director Mark Zakharov dies at 85 ===29=== *Beatriz Aguirre, 94, Mexican actress (The Tiger of Jalisco, Flight 971, My Mother Is Guilty).Murió la actriz mexicana Beatriz Aguirre a los 94 años *Martin Bernheimer, 83, German-born American music critic (New York Post, The Los Angeles Times), Pulitzer Prize winner (1982), sarcoma.Pulitzer Prize winner and former L.A. Times music critic Martin Bernheimer dies at 83 *Ilkka Laitinen, 57, Finnish military officer and politician, Executive Director of Frontex (2005–2015) and Chief of the Border Guard (2018–2019).Rajavartiolaitosta johtanut Ilkka Laitinen on kuollut *Yuriy Meshkov, 73, Russian politician, Prime Minister (1994) and President of Crimea (1994–1995).Ушел из жизни первый и единственный президент Крыма Юрий Мешков ===30=== *Sir David Akers-Jones, 92, British politician, Chief Secretary for Administration (1985–1987) and Governor of Hong Kong (1986–1987), colon cancer.David Akers-Jones, Hong Kong’s former No 2 under British rule, dies at 92 *Wayne Fitzgerald, 89, American movie (Bonnie and Clyde, The Godfather Part II) and television (The Bronx Zoo) title designer, Emmy winner (1987), problems caused by influenza.Wayne Fitzgerald, Prolific Main Title Designer, Dies at 89 *Viju Khote, 77, Indian actor (Sholay, Andaz Apna Apna, Zabaan Sambhalke), multiple organ failure.Veteran actor Viju Khote dies, best known as Kalia from Sholay *Kornel Morawiecki, 78, Polish politician and theoretical physicist, Senior Marshal of the Sejm (since 2015), Chairman of Freedom and Solidarity (since 2016) and 2010 presidential candidate, pancreatic cancer. Kornel Morawiecki nie żyje. Marszałek senior Sejmu zmarł w wieku 78 lat *Jessye Norman, 74, American opera singer, Grammy Award winner (1984, 1988, 1989, 1998), multiple organ failure and sepsis caused by a spinal cord injury.Jessye Norman, international opera star, dead at 74 *Ben Pon, 82, Dutch racing driver, Olympic sports shooter (1972) and businessman.'Mister Porsche' Ben Pon overleden ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *9 Deaths",
 "title": "Deaths in September 2019"
}