{
 "id": "710809",
 "text": "Georgia Holt (born Jackie Jean Crouch; June 9, 1926 – December 10, 2022) was an American singer-songwriter, actress, and model. She was the mother of singer and actress Cher and the grandmother of Chaz Bono. ==Personal life== Holt was born in Kensett, Arkansas. She was married to six men, one of them twice. ==Career== Holt appeared as a model on two episodes of I Love Lucy. She was an audience polling member as part of a group of ten mothers of famous celebrities on the U.S. game show Card Sharks from July 4–8, 1988. Holt also released her album Honky Tonk Woman, which was recorded in 1982, in 2013. The album includes a duet with Cher titled \"I'm Just Your Yesterday\". Holt appeared on talk shows hosted by Mike Douglas, Merv Griffin, Dinah Shore, Jay Leno and Ellen DeGeneres. ==Appearances== Year Title Role Notes 1950 A Life of Her Own Uncredited Movies Watch the Birdie Grandpop's Girl 1951 Grounds for Marriage First Girl 1955 The Adventures of Ozzie & Harriet Bride TV episode \"David's Engagement\" Arists and Models Uncredited Movie 1956 I Love Lucy Jaques Marcel Model TV episode \"Paris At Last\" 1966 The Lucy Show Model TV episode \"Lucy and Pat Collins\" 1978 Cher... Special Herself Voice only 1979 The Mike Douglas Show TV series 1980 The Merv Griffin Show 1987 Superstars and Their Moms TV movie, also co-executive producer 1999 Behind The Music TV series documentary episode \"Cher\" 2011 Becoming Chaz TV series 2013 Entertainment Tonight Television infotainment series The Tonight Show With Jay Leno Late night comedy program (NBC-TV) The Ellen DeGeneres Show TV series Good Morning America Morning news program (ABC-TV) Access Hollywood Television infotainment series Dear Mom, Love Cher TV documentary 20/20 Weekly news program (on ABC-TV) 2013 Sunday Morning Herself Weekly news program 2014 RuPaul's Drag Race Herself/Guest Judge TV Episode 609 \"Queens of Talk\" ==References== ==Other websites== * Category:1926 births Category:2022 deaths Category:American movie actors Category:American models Category:Actors from Alabama Category:Singers from Alabama Category:Writers from Alabama Category:American country singers Category:American singer-songwriters Category:Actors from Arkansas Category:Singers from Arkansas Category:Writers from Arkansas Category:American television actors",
 "title": "Georgia Holt"
}