{
 "id": "71093",
 "text": "DNA replication is the process of copying a double-stranded DNA molecule. Both strands serve as templates for the reproduction of the opposite strand. The process is sometimes called \"semi-conservative replication\" because the new DNA from the original strand contains half of the original and half of the newly synthesized DNA. This process occurs in all life forms with DNA.Most viruses use RNA instead. There are some differences in the control of DNA replication in prokaryotic and eukaryotic organisms. In a cell, DNA replication begins at specific places in the genome, called origins.Chapter 27, Section 4: DNA Replication of both strands proceeds rapidly from specific start sites As the DNA unwinds and as DNA helicase rips apart the double helix structure of DNA, the synthesis of new strands forms at a replication fork. In addition to DNA polymerase,The enzyme which synthesizes new DNA by adding nucleotides matched to the template strand. other enzymes at the fork help to start and continue the DNA synthesis. == DNA polymerase == DNA polymerases are a family of enzymes that carry out all forms of DNA replication. Chapter 27, Section 2: DNA Polymerases require a template and a primer However, a DNA polymerase can only extend an existing DNA strand paired with a template strand; it cannot begin the synthesis of a new strand. To begin synthesis, a short fragment of DNA or RNA, called a 'primer', is created and paired with the template DNA strand. In general, DNA polymerases are extremely accurate, making less than one mistake for every 107 (10 million) nucleotides added. Even so, some DNA polymerases also have 'proofreading' ability: they can remove nucleotides from the end of a strand in order to correct mismatched bases. == DNA repair == DNA in cells is constantly being damaged.Causes include reactive molecules, chemicals and radiation from the environment, and damage caused by heat. The nucleus of cells contains a number of repair mechanisms which fix almost all of this damage. \"A large set of DNA repair enzymes continuously scan the DNA and repair any damaged nucleotides\".Alberts B et al 2002. Molecular biology of the cell. 4th ed, Garland. p275. == References == == Other websites == * DNA Workshop * WEHI-TV - DNA Replication video - Detailed DNA replication animation from different angles with description below. * Basic Polymerase Chain Reaction Protocol * Animated Biology * DNA makes DNA (Flash Animation) * DNA replication info page by George Kakaris MSc. * Reference website on eukaryotic DNA replication *[“DNA Replication.” Genome.gov, https://www.genome.gov/genetics-glossary/DNA- Replication.] *[“Structure and Composition of DNA.” Encyclopædia Britannica, Encyclopædia Britannica, Inc., https://www.britannica.com/science/heredity- genetics/Structure-and-composition-of-DNA#ref944097.] Category:Cell biology Category:DNA",
 "title": "DNA replication"
}