{
 "id": "711449",
 "text": "Suraphol Sombatcharoen (, born 25 September 1930 - died 16 August 1968) was a Thai luk thung singer.Khanthong, Thanong (September 6, 2002). \"OVERDRIVE: PM Thaksin to embrace Suraphol Doctrine?\" Dubbed the \"King of Luk Thung\", he was one of the first major stars of Thailand's own country music genre. He was fatally shot while seated in his own car after a live performance in Nakhon Pathom. The Nation\"SUNDAY TALK: 'Look thung' family keeps going strong\" , August 26, 2001, The NationNapack, Jonathan (May 12, 1999) \"A revival of authentic Thai pop\", The New York Times ==Biography== Born in Suphan Buri Province, he chose Suraphol as his stage name. His first hit came in 1954 with \"Nam Ta Sao Wieng\" (\"Tears of a Lao Girl\"). It marked the emergence of luk thung, a Thai counterpart to such crooning styles as Japanese enka and Indonesian kroncong, and embodied such influences as Hollywood film music, American country music, Malay pop and Afro-Cuban rhythms. Enjoying popularity at the same time as Elvis Presley and The Beatles, Suraphol was sometimes called the \"Thai Elvis\". By the 1960s, there was no Thai performer who was better known than Suraphol Sombatcharoen. Suraphol composed more than 100 songs. Among his best known are \"Sao Suan Taeng\" (\"The Girl from the Cucumber Field\"), \"Mong\" (\"Look\"), \"Nam Ta Ja Tho\" (\"The Tears of a Corporal\"), \"Khong Plom\" (\"Fake Stuff\"), and \"Muai Cham\" (\"Broken-Hearted Chinese Girl\"). Shortly before his murder, he released his last and most memorable song, \"Siphok Pi Haeng Khwam Lang\" (\"สิบหกปีแห่งความหลัง\" or \"16 Years of Our Past\"), in which told sadly about the end of his own 16-year marriage, reflecting on both the happiness and bitterness of the union. ==Discography== * เสียวใส้ (Siew Sai) * ของปลอม (Khong Plom) * คนหัวล้าน (Khon Hua Lan) * แซซี้อ้ายลือเจ็กนัง (Sae See Ai Lue Jek Nung) * ยิกเท้าโหลซัวะ (Yik Tao Low Suea) * ลืมไม่ลง (Luem Mai Long) * แก้วลืมดง (Kaew Luem Dong) * สิบหกปีแห่งความหลัง (Sip Hok Pee Haeng Kwam Lang) ==References== Category:Thai singers Category:1930 births Category:1968 deaths Category:Thai Buddhists Category:Assassinated people",
 "title": "Suraphol Sombatcharoen"
}