{
 "id": "71178",
 "text": "The classic cycle races are the most important one-day professional cycling road races in the international calendar (list of races) All of the races are run in western Europe. Most of the events have been on the professional calendar for decades and the oldest ones date back to the 19th Century. They are normally held at roughly the same time each year. In the last few years, the five top races are sometimes described as the 'Monuments'. From 2005, the Classics have formed part of the UCI ProTour run by the Union Cycliste Internationale. This event series also includes various stage races including the Tour de France, Giro d'Italia, Vuelta a España, Paris-Nice and the Critérium de Dauphiné Libéré, and various non-Classic single day events. The ProTour replaced the UCI Road World Cup series which contained only one-day races. ==The Classics== Race Country Started Notes Milan-Sanremo 1907 The first true Classic of the year, its Italian name is La Primavera (the spring), this race is normally held in late March. . Ronde van Vlaanderen 1913 The first of the 'Spring Classics', is normally raced in early April. Paris- Roubaix 1896 La Reine (\"Queen of the Classics\") or l'Enfer du Nord (\"Hell of the North\") is traditionally one week after the Ronde van Vlaanderen. Amstel Gold Race 1966 Normally held mid-April. La Flèche Wallonne 1936 The Walloon Arrow is traditionally held mid-week between the Amstel Gold and Liège- Bastogne-Liège. Liège-Bastogne-Liège 1892 late April. La Doyenne, the oldest Classic, was first held in 1892 as an amateur event; a professional edition following in 1894. Rund um den Henninger Turm Clásica de San Sebastián San Sebastian Classic Züri-Metzgete Championship of Zürich Paris-Brussels / Paris- Tours Giro di Lombardia 1905 Also known as the \"Race of the Falling Leaves\", is normally held in October. First called the Milano-Milano (Milan to Milan) in 1905, it became the Giro di Lombardia in 1907. Some races that were Classics are no longer run. These include the gruelling (very hard) 560km, Derny event, Bordeaux-Paris, run from 1891 to 1988. ==The 'Monuments'== Five of the classic races are sometimes called \"the Monuments\" #Milan-Sanremo #Ronde van Vlaanderen #Paris-Roubaix #Liège-Bastogne-Liège #Giro di Lombardia Only three riders have won all five 'Monument' one-day races during their careers: Roger De Vlaeminck, Rik Van Looy and Eddy Merckx. All were from Belgium. Seán Kelly of Ireland won four Monuments but only finished second in the Ronde van Vlaanderen on three occasions (1984,1986,1987). Monument winners since 1960 Year Milan – San Remo Tour of Flanders Paris–Roubaix Liège–Bastogne–Liège Giro di Lombardia 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 ==Related pages== *List of important cycling events Category:Cycle races",
 "title": "Classic race"
}