{
 "id": "711932",
 "text": "Doom 64 is a video game that first came out only on the Nintendo 64, but can now be played on today's video game consoles. It is a direct sequel to Doom 2, making it the third part of the Doom story. This is ironic because the story of Doom 3 is not related to Doom or Doom 2, but it is a reboot, which means it is a new start to the Doom story. Doom 64 has all the same weapons and monsters from Doom 2, but it has a few more new types of monsters and a new weapon, the Unmaker. The weapons and monsters look a little different from the earlier games, but there are fewer differences than in Doom 3. Other than the new graphics and new weapon, the gameplay was not much different from the earlier Doom games. It came out in 1997, but the game did not sell well because many popular FPS games came out that same year, including GoldenEye 007, Quake II, Turok: Dinosaur Hunter, and Star Wars: Dark Forces II: Jedi Knight. However, the game does have a cult following and fans had made unlicensed mods on the PC and other video game consoles. Due to its popularity, Bethesda announced during Nintendo Direct 2019 that it would sell the game digitally on the Nintendo Switch, Xbox One, PlayStation 4, and Steam on November 22, 2019. However, it was delayed until March 20, 2020, so that it could be sold the same day as Doom Eternal, the sequel to Doom (2016). It was the same game, but the lighting of the game was fixed, which was a major criticism of the N64 version of the game. ==References== Category:1997 video games Category:1990s horror video games Category:Doom (franchise) Category:DOS games Category:First-person shooters Category:Id Software games Category:Midway video games Category:Multiplayer and single-player video games Category:Nintendo 64 games Category:Nintendo Switch games Category:PlayStation 4 games Category:Video game spin-offs Category:Video games developed in the United States Category:Windows games Category:Xbox One games",
 "title": "Doom 64"
}