{
 "id": "711917",
 "text": "Edmund Kean (4 November 1787 – 15 May 1833) was a British Shakespearean stage actor born in England. ==Biography== ===Early life=== Kean was born in Westminster, London. His father was Edmund Kean, an architect’s assistant, and his mother, Anne Carey, was an actress. His mother was the daughter of the 18th-century composer and playwright Henry Carey. Kean starting acting at the age of four, as a Cupid in Jean-Georges Noverre’s ballet of Cymon. As a child, his cheerfulness made him a universal favourite, but his background and lack of discipline, helped him develop independence and stubborn habits. In 1794, a few kind-hearted people paid for his school fees. Even though he did well in school, he found it unbearable. As such, he decided to work as a cabin boy at Portsmouth. Finding life at sea even more limiting, he pretended to be deaf and lame so skilfully that he managed to trick the doctors at Madeira. After returning to England, he requested for the protection of his uncle, Moses Kean, an entertainer, who introduced Kean to the study of Shakespeare. At the same time, Miss Charlotte Tidswell, an actress who had been especially kind to him since he was young, taught him the basics of acting. When his uncle died, Miss Charlotte was responsible in looking after Kean, and he began studying the main characters of Shakespeare. Kean displayed the creativeness of his mind by acting in a very different way from John Philip Kemble, an actor for many Shakespearean characters. A Mrs Clarke adopted Kean for his talents and appearance, but he was upset about a visitor's comments and suddenly left her house and went back to Miss Charlotte. ===Discovery=== At the young age of 14, Kean was hired to act as main characters for 20 nights in the York Theatre, acting as Hamlet, Hastings and Cato. While he was at Richardson's Theatre, a travelling theatre company, the news of his talents reached George III, who ordered him to be at Windsor Castle. Kean later joined Saunders's circus, where while performaning as a horse rider, he fell and broke both legs. The accident left swelling on his foot throughout his life. Kean learned music from Charles Incledon, dancing from D’Egville, and fencing from Angelo. In 1807, he had a chance to act in leading parts at the Belfast theatre with Sarah Siddons, who began by calling him \"a horrid little man\" and changed to saying that he \"played very, very well,\" but that \"there was too little of him to make a great actor\" after seeing his abilities. The next year, Kean joined Samuel Butler's provincial troupe and went on to marry Mary Chambers of Waterford, a leading actress, on 17 July. His wife gave birth to two sons, one of whom was actor Charles Kean. ===Drury Lane and New York=== For several years, Kean's career had little chances to grow. But in 1814, the committee of Drury Lane Theatre, which was about to go bankrupt, decided to give Kean a chance among the \"experiments\" they were making to gain more popularity. When the hope of his first appearance in London got higher, he was so nervous that he exclaimed, \"If I succeed I shall go mad.\" As he was unable to pay for his elder son's medical treatment for some time, his son died the day after Kean signed the three-year Drury Lane contract. His appearance at the Drury Lane Theatre on 26 January 1814 as Shylock left the audience enthusiastic. People recognised that Kean had brought self-respect and humanity to his role of the character. Jane Austen refered to his popularity in a letter she wrote to her sister, Cassandra, on 2 March 1814: \"Places are secured at Drury Lane for Saturday, but so great is the rage for seeing Kean that only a third and fourth row could be got\".Jane Austen letters 28A11/B26 Appearances in Richard III, Hamlet, Othello, Macbeth and King Lear demonstrated his ability to control his range of emotions. His joy was so great that he himself said, \"I could not feel the stage under me.\" In 1817, Charles Bucke, a local playwright, submitted his play The Italians, or; The Fatal Accusation to Drury Lane, for which Kean was to play the main role. The play was well received by everyone until Kean said that his part was too small for him. Then, after a performance in February 1819 where Kean went to make a mess at the opening night of Switzerland by historical novelist Jane Porter, for whom Kean had had a personal dislike, Bucke pulled the play out of disrespect for Kean's actions.The Works of Lord Byron, footnote pg. 202 After much persuasion to still perform the play by the theater staff, Mr. Bucke then later had it republished with a introduction concerning the incident, including parts of conversation between the involved parties, which was later questioned in two books, The Assailant Assailed and A Defense of Edmund Kean, Esq. The result was embarassment on both sides and the play being performed anyway on 3 April 1819 to a terrible reception thanks to the dispute already surrounding the play and Kean's previous conduct.\"The Italians, or; The Fatal Accusation\", preface pages v through xxvi On 29 November 1820, Kean appeared for the first time in New York City as Richard III. The success of his visit to America was unmistakable, although he fell into a annoying dispute with the news media. In 1821, Kean appeared in Boston with Mary Ann Duff in The Distrest Mother, by Ambrose Philips, an adaptation of Racine's Andromaque. On 4 June 1821, he returned to England. Kean was the first to fix the terrible ending to Shakespeare's King Lear, which had been replaced on stage since 1681 by Nahum Tate's happy ending adaptation The History of King Lear. Kean had previously acted as Tate's Lear, but told his wife that the London audience \"have no notion of what I can do till they see me over the dead body of Cordelia.\"Edward Dowden, \"Introduction to King Lear\" in Shakespeare Tragedies, Oxford University Press, 1912, p. 743. Kean played as Lear for a few performances. They were not well received, though one critic described his dying scene as \"deeply affecting\",George Daniel, quoted in Grace Ioppolo, William Shakespeare's King Lear: A Sourcebook. London, Routledge, 2003, p. 79. and with regret, he changed back to Tate.Stanley Wells, \"Introduction\" from King Lear Oxford University Press, 2000, p. 69. ===Private life=== Kean's lifestyle disrupted his career. As a result of his relationship with Charlotte Cox, the wife of a London city council member, Kean was sued by Mr Cox for criminal conversation (adultery). Kean was ordered to pay £800 to Mr Cox by a jury that only discussed for just 10 minutes. The Times launched a violent attack on him. The decision in the criminal conversation case of Cox v. Kean on 17 January 1825 caused his wife to leave him, and caused him to have such bitter feeling that he was boo-ed and attacked with fruits when he re-appeared at Drury Lane and nearly decided to retire permanently into private life. For many years, he lived at Keydell House, Horndean. ===Second visit to America=== The purpose of Kean's second visit to America in 1825 was due to the repeated abuse he suffered in England. Some cities showed him a spirit of charity; many audiences submitted him to insults and even violence. In Quebec City, he was amazed with the kindness of some Huron Indians who went to his performances. He was made an honorary (unofficial) chief of the tribe, receiving the name Alanienouidet.* Hillebrand, Harold Newcomb. Edmund Kean New York, Columbia University Press, 1933 p 275 Kean's last appearance in New York was on 5 December 1826 in Richard III, playing the same role in which he first acted in America. ===Decline and death=== When Kean returned to England, he was received with favour in the end. However, his heavy reliance on the use of stimulants caused him his talents. Still, his great powers was successful during the moments of his creativity over the absolute ruin of his physical potential. His appearance in Paris was a failure due to being drunk. His last appearance on the stage was at Covent Garden on 15 March 1833, when he played in Othello. When saying \"Villain, be sure,\" in scene 3 of act iii, Kean suddenly started crying in a stammered voice \"O God, I am dying. Speak to them, Charles,\" fell unconscious into his son, Charles Kean's, arms. He died in Surrey in 1833, and is honoured in the Parish Church where there is a memorial tablet on the floor, marking his grave and a wall plaque originally on the outside but moved inside and heavily restored during restoration work in 1904. He is buried in the parish church of All Saints, in the village of Catherington, Hampshire. His last words were claimed to have been \"dying is easy; comedy is hard.\" In Dublin, Gustavus Vaughan Brooke acted as William Tell after Kean's death. ==Artistic legacy== As stated in the Encyclopædia Britannica Eleventh Edition, it was in the impression of the great creations of Shakespeare's fine mind that the varied beauty and magnificence of the acting of Kean were displayed in their highest form, although probably his most powerful character was Sir Giles Overreach in Philip Massinger’s A New Way to Pay Old Debts, the effect of his first performance of which was such that the pit rose altogether, and even the actors and actresses themselves were defeated by the terrific dramatic illusion. His main disadvantage as an actor was his height. Coleridge said, \"Seeing him act was like reading Shakespeare by flashes of lightning.\"Coleridge, Samuel Taylor, Table Talk, 27 April 1823 in ==Strangeness== His strangeness at the height of his fame were numerous. Sometimes he would carelessly ride on his horse, Shylock, throughout the night. He was offered a tame lion with which he might be found playing in his drawing-room. Prize-fighters Mendoza and Richmond the Black were among his visitors and Henry Grattan was his loyal friend. ==Appraisals== In his earlier days, François Talma said of Kean, \"He is a magnificent uncut gem; polish and round him off and he will be a perfect tragedian.\" William Macready, who was amazed by Kean's Richard III, met the actor at supper, speaks of his \"unassuming manner ... partaking in some degree of shyness\" and of the \"touching grace\" of his singing. Kean's way of saying \"I answer—No!\" while acting as Sir Edward Mortimer in The Iron Chest, made Macready know that he had no chance of getting the role from Kean. Kean's life was so full of dramatic interest that it was the subject (topic) for the play \"Kean\" by Jean- Paul Sartre as well as a play by Alexandre Dumas, entitled Kean, ou Désordre et génie, where actor Frédérick Lemaître achieved one of his greatest success. In 1924, director Alexandre Volkoff made play by Alexandre Dumas into a French silent feature film with Russian actor Ivan Mosjoukine, who was then living in Paris, as the lead actor. ==Theatrical works== Quite a number of theatrical works have been based on Kean's life, such as: * Kean, a drama by Alexandre Dumas, père, 1836 * Kean, a comedy by Jean-Paul Sartre, 1953 (produced 1954 with Pierre Brasseur, revived London 1990 starring Derek Jacobi and in 2007 starring Antony Sher) * Kean, a Broadway musical by Peter Stone, Robert Wright, and George Forrest, 1961 * Kean, 1978, a BBC Play of the Month with Anthony Hopkins * Kean, 1983, a YTV biography with Ben Kingsley * Kean IV, a tragicomedy by Grigoriy Gorin, 1991 ==Cultural influence== Peter O'Toole, a well-known 20th century British theatre and film actor, owned a ring that had once belonged to Kean, and he used the ring as a muse (insipration) for the writing of the second part of his autobiography Loitering With Intent: The Apprentice (1997).'The South Bank Show' - 'Peter O'Toole', London Weekend Television documentary (1993). O'Toole said the line, \"dying is easy; comedy is hard\" and credited it to the last words of Kean in the 1982 movie My Favorite Year. == References == ==Sources== * Francis Phippen, Authentic memoirs of Edmund Kean, containing a specimen of his talent at composition (London, 1814) * B. W. Procter, The Life of E. K. (London, 1835) * Frederick William Hawkins, The life of Edmund Kean (Tinsley Brothers, London, 1869) * George Henry Lewes, On Actors and the Art of Acting (Smith Elder, London, 1875) * Henry Barton Baker Our Old Actors, (R. Bentley & Son, London, 1881) * Edwin Booth, \"Edmund Kean,\" in Actors and Actresses of Great Britain and the United States from the days of David Garrick to the present time, edited by Brander Matthews and Laurence Hutton, volume iii (Cassell & Co., New York, 1886) * Joseph Fitzgerald Molloy, The Life and Adventures of Edmund Kean, Tragedian, 1787-1833 (Downey & Co. Limited, London, 1897) * Edward Stirling, Old Drury Lane: Fifty Years' Recollections of Author, Actor, and Manager (Chatto and Windus, London, 1887). * Lynch, Jack (2007). Becoming Shakespeare: The Strange Afterlife That Turned a Provincial Playwright into the Bard. New York: Walker & Co. * Hillebrand, Harold Newcomb: Edmund Kean, New York, Columbia University Press, 1933 * ==Other websites== *Richard Henry Dana on Edmund Kean's Acting, report by Carol McCluer of an Aesthetic Realism lecture by Eli Siegel *Caricatures, cartoons and portraits of Edmund Kean, 1812-1833, held by the Billy Rose Theatre Division, New York Public Library for the Performing Arts Category:1789 births Category:1833 deaths Category:English stage actors Category:People from the City of Westminster",
 "title": "Edmund Kean"
}