{
 "id": "71197",
 "text": ":For the type of cycling race see Criterium The Critérium du Dauphiné Libéré is an annual cycling road race, run over eight stages in the Dauphiné region in France during the first half of June. It is organised by the Le Dauphiné Libéré newspaper. Along with the Tour de Suisse, the Dauphiné Libéré is an important race in the lead-up to the Tour de France in July. Because the Dauphiné is a mountainous area, the winners are often climbing specialists. Many climbs that are famous from the Tour de France, like the Mont Ventoux, the Col du Galibier or Col de la Chartreuse appear often in the Dauphiné Libéré. All cyclists who have won the Tour de France five times or more have also won the Dauphiné Libéré. The first Dauphiné Libéré was held in 1947 when Eduard Klablinski from Poland was the winner. Nello Lauredi, Luis Ocaña, Charly Mottet and Bernard Hinault share the record of the most wins, with three each. Iban Mayo won in 2004, when he climbed Mont Ventoux very quickly. In the 2005 Dauphiné the winner was Iñigo Landaluze, of the Euskaltel-Euskadi team. == Winners == === 1947 to 1999 === {|class=\"wikitable\" Year Winner Nat Team Team Nat 1947 Édouard Kablinski 1948 Édouard Fachleitner 1949 Lucien Lazarides France Sport-Dunlop 1950 Nello Lauredi 1951 Nello Lauredi 1952 Jean Dotto France Sport 1953 Lucien Teisseire Terrot-Hutchinson 1954 Nello Lauredi 1955 Louison Bobet Stella/Mercier 1956 Alex Close Elvé-Peugeot 1957 Marcel Rohrbach 1958 Louis Rostollan 1959 Henry Anglade 1960 Jean Dotto Liberia- Grammont 1961 Brian Robinson Rapha-Gitane-Dunlop 1962 Raymond Mastrotto Gitane-Leroux-Dunlop 1963 Jacques Anquetil Saint-Raphaël 1964 Valentin Uriona 1965 Jacques Anquetil Ford-Gitane 1966 Raymond Poulidor Mercier-BP 1969 Raymond Poulidor Mercier-BP 1970 Luis Ocaña Bic 1971 Eddy Merckx Peugot-BP- Michelin 1972 Luis Ocaña Bic 1973 Luis Ocaña Bic 1974 Alain Santy Gan-Mercier === After 1999 === Year Winner Nat Team Team Nat 2000 Tyler Hamilton U.S. Postal Service 2001 Christophe Moreau Festina 2002 ~~Lance Armstrong~~ U.S. Postal Service 2003 ~~Lance Armstrong~~ U.S. Postal Service 2004 Iban Mayo Euskaltel-Euskadi 2005 Iñigo Landaluze Euskaltel-Euskadi 2006 Levi Leipheimer Team Gerolsteiner 2007 Christophe Moreau Ag2r 2008 Alejandro Valverde 2009 Alejandro Valverde 2010 Janez Brajkovič == Other websites == * Official website Category:UCI ProTour Category:Cycle racing in France",
 "title": "Critérium du Dauphiné Libéré"
}