{
 "id": "71203",
 "text": "The 1900 Summer Olympics (), officially called the Games of the II Olympiad, were held in Paris, France. The games went from 14 May to 28 October 1900. The games were part of the 1900 Exposition Universelle (Paris World's Fair). The sports events were not well planned. The games were not thought to be a success.Zarnowski, C. Frank. \"A Look at Olympic Costs,\" Citius, Altius, Fortius (US). Summer 1992, Vol. 1, Issue 1, p. 19 [4 of 17 PDF]; retrieved 2012-7-24. In total, there were 1,226 athletes. These athletes were played in 19 different sports. 720 of the 997 athletes were from France. France won the most gold, silver, and bronze awards. U.S won the 2nd most awards. Britain won the 3rd most awards. This was the first Olympic Games where women competed. The sailor Hélène de Pourtalès was the first woman to win an Olympic game. The 1900 Olympic Games were also very unusual. There were many events that were only at this Olympics. These events were angling, motor racing,Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 8, by Karl Lennartz, Tony Bijkerk and Volker Kluge ballooning,Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 13, by Karl Lennartz, Tony Bijkerk and Volker Kluge cricket,Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 32, by Karl Lennartz, Tony Bijkerk and Volker Kluge croquet,Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 33, by Karl Lennartz, Tony Bijkerk and Volker Kluge Basque pelota,Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 52, by Karl Lennartz, Tony Bijkerk and Volker Kluge 200m swimming obstacle race and underwater swimming.Journal of Olympic History, Special Issue – December 2008, The Official Publication of the International Society of Olympic Historians, p. 77, by Karl Lennartz, Tony Bijkerk and Volker Kluge This was also the only Olympic Games to use live animals as a target in shooting. == Sports == Weightlifting and wrestling were not in the 1900 Olympics, even though they were in the 1896 Summer Olympics. However, 12 new sports were added. Croquet was the only sport where only French players played. The number of events is in parentheses. == Venues == There were 14 venues (or places) at the 1900 Summer Olympics. Venue Sports Capacity Ref. 7th arrondissement (Place de Breteuil) Equestrian Not listed. 1900 Summer Olympics official report. p. 16. Accessed 14 November 2010. Bois de Boulogne Croquet, Polo, Tug of war Not listed. Sports-reference.com Summer Olympics Paris 28 June 1900 croquet mixed singles one-ball results. Accessed 14 November 2010.Sports-reference.com Summer Olympics Paris 28 May-2 June 1900 men's polo results. Accessed 20 February 2011.Sports-reference.com Summer Olympics Paris 16 July 1900 tug-of-war men's results. Accessed 14 November 2010. Bois de Vincennes Archery Not listed. Sports-reference.com Summer Olympics Paris 27 May – 14 August 1900 men's archery au chapelet 33 m results. Accessed 14 November 2010. Boulogne-Billancourt Shooting Not listed. Compiègne Golf Not listed. 1900 Summer Olympics official report. p. 15. Accessed 14 November 2010. Croix-Catelan Stadium Athletics Not listed. Le Havre Sailing Not listed. Meulan-en-Yvelines Sailing Not listed. Sports- reference.com Summer Olympics Paris 20 May 1900 sailing mixed open results. Accessed 14 November 2010. Neuilly-sur-Seine Basque pelota Not listed. Sports- reference.com Summer Olympics Paris 14 June 1900 men's basque pelota two-teams results. Accessed 14 November 2010. Puteaux Tennis Not listed. Sports- reference.com Summer Olympics Paris 6-11 July 1900 tennis men's singles results. Accessed 14 November 2010. Satory Shooting Not listed. Seine Rowing, Swimming, and Water polo Not listed. 1900 Summer Olympics official report. pp. 17-18. Accessed 14 November 2010. Tuileries Garden Fencing Not listed. Vélodrome de Vincennes Cricket, Cycling, Football, Gymnastics, and Rugby union Not listed. 1900 Summer Olympics official report. pp. 15-16. Accessed 14 November 2010. ==Participating nations== There were 24 nations that sent athletes to compete at the Paris games.Taking part in the games for the first time were Argentina, Belgium, Bohemia, Canada, Cuba, India, Mexico, Netherlands, Norway, Romania, Russia, Spain. * * * * * * * * * * * * * * * * * * * * * * * * == Medals == The 1900 Olympics is the only Olympic Games that had rectangle medals. These medals were made by . Gilt silver medals were given to 1st place in shooting, lifesaving, automobile racing and gymnastics. 2nd place silver medals were given in shooting, rowing, yachting, tennis, gymnastics, sabre, fencing, equestrian and athletics. 3rd place bronze medals were given in gymnastics, firefighting and shooting. In many sports, there were no medals given. Many of the prizes were cups or other trophies. After the Olympic Games, the International Olympic Committee gave the athletes gold, silver, and bronze medals to the athletes who were in 1st, 2nd or 3rd-place. These are the top ten nations that won medals at the 1900 Games. Select \"Paris 1900\", select \"Go to medal table\" to arrive at \"Paris 1900 Medal Table\" Key ==Related pages== ==Notes== * The IOC used to say that there were 85 events, 24 nations, and 997 athletes. The Olympic historian and author, Bill Mallon, said that there 95 events. There were some events that had different rules. In some events, amateurs could not compete. In some events, not every country was allowed to compete. According to Mallon, these should still be Olympic events. In July 2021, the IOC said there was 95 events now, instead of 85. Because of this, they also put the number of countries as 26 and athletes as 1226. The IOC now says the 1900 Summer Olympics had 95 events, 26 nations, and 1226 athletes. ==References == ==Other websites== * * Official Report * GB Athletics website – Olympic Games Medallists – Other Sports – Demonstration & Unofficial Sports Olympics Category:19th century in France Summer Olympic 1900 Category:Summer Olympics in France Category:1900s in Europe Category:1900 Summer Olympics",
 "title": "1900 Summer Olympics"
}