{
 "id": "71209",
 "text": "Mont Ventoux is a mountain in the Provence region of southern France, about 20 km north-east of Carpentras, Vaucluse. It is the largest mountain in the region and has the nicknames \"Giant of Provence\" and \"The Bald Mountain\". == History == Jean Buridan climbed the mountain early in the fourteenth century; Petrarch repeated the feat on April 26, 1336, and claimed to have been the first to climb a mountain since antiquity, which has been widely repeated since.Lynn Thorndike, Renaissance or Prenaissance, Journal of the History of Ideas, Vol. 4, No. 1. (Jan., 1943), pp. 69-74. JSTOR link to a collection of several letters in the same issue. In the 15th century a chapel was built on the top. It was dedicated to the Holy Cross. In 1882, a meteorological station was constructed on the summit, but it is not used now. In the 1960s a 50m-high telecommunications mast was built. == Road cycling == For road bicycle racing enthusiasts, the mountain can be climbed by three roads. * South from Bédoin: 22 km over 1610 m. This is the most famous and difficult ascent. The road to the summit has an average gradient of 7.6%. Until Saint-Estève, the climb is easy, but the 16 remaining kilometres have an average gradient of 10%. The last kilometres have strong, violent winds. The ride takes 2–3 hours for trained amateur individuals, and professionals can ride it in 1-1.5 hours. The fastest time so far recorded has been that of Iban Mayo in the individual climbing time trial of the 2004 Dauphiné Libéré: 55' 51\". The time was measured from Bédoin for the first time in the 1958 Tour de France, in which Charly Gaul was the fastest at 1h 2' 9\". * North from Malaucène: 21 km over 1570 m. A little easier than the Bédoin ascent, better sheltered against the wind. * East from Sault: 26 km over 1220 m. The easiest route. After Chalet Reynard (where the \"lunar landscape\" of the summit starts), the climb is the same as the Bédoin ascent. Average gradient of 4.4%. Every year there are amateur races to climb the mountain as quickly and often as possible in 24 hours. On May 16 2006, Jean-Pascal Roux from Bédoin broke the record of climbs in 24 hours, with eleven climbs, all of them from Bédoin. === Tour de France === Mont Ventoux is the one of the most gruelling climbs in the Tour de France. The Tour has visited the mountain thirteen times since 1951. The route is usually the Bédoin. British cyclist Tom Simpson, who died here on July 13, 1967 from a combination of amphetamines, alcohol and heat exhaustion. He began to weave across the road before he fell down twice. He was delirious, but his last words were not \"put me back on my bike\", that was what a journalist wrote. Amphetamines were found in his jersey and bloodstream. There is a memorial to Simpson near the summit which has become a shrine to fans of cycling, who often leave small tokens of remembrance there. In 1970, Eddy Merckx rode himself to the brink of collapse but won the stage. He received oxygen, recovered, and won the Tour. In 1994, Eros Poli, not known for his climbing ability, stole away at the beginning of the day's stage, built up a big time gap from the peloton, and was first over the Ventoux and was the stage winner despite. The last winner on the Ventoux was the French climber Richard Virenque. ==== Winners of the Mont Ventoux stage at the Tour de France ==== * 1951: Lucien Lazarides * 1952: Jean Robic * 1955: Louison Bobet * 1958: Charly Gaul * 1965: Raymond Poulidor * 1967: Julio Jimenez * 1970: Eddy Merckx * 1971: Gonzalo Aja * 1972: Bernard Thévenet * 1987: Jean- Francois Bernard * 1994: Eros Poli * 2000: Marco Pantani * 2002: Richard Virenque * 2009: Juan Gárate * 2013: Chris Froome == References == == Other websites == * Mont Ventoux: Picture Gallery * Velo News: The curse of the Ventoux * Réserve de Biosphère du Mont Ventoux (in French) * winter picture mont ventoux * Mont Ventoux cycling. Pictures and profiles. (in French) Category:Biosphere reserves Category:Alps Category:Mountains of France Category:Vaucluse",
 "title": "Mont Ventoux"
}