{
 "id": "712898",
 "text": "The Kansas Pacific Railway (KP) was a historic railroad company. They operated in the western United States in the late 19th century. The railroad was consolidated with the Union Pacific in 1880. Its mainline is still an important part of the Union Pacific network today.William R. Petrowski, \"The Kansas Pacific Railroad in the Southwest.\" Arizona and the West (1969): 129-146. ==References== ==More reading== * Babbitt, James E. \"From Albuquerque to Tucson in 1867: The Kansas Pacific Railway Survey Photographs of William A. Bell.\" Journal of Arizona History (1998): 289-306. in JSTOR * Klein, Maury. Union Pacific: 1862-1893 (Vol. 1. 1987), passim. * Petrowski, William R. The Kansas Pacific: a study in railroad promotion (Arno Press, 1981). * Petrowski, William R. \"The Kansas Pacific Railroad in the Southwest.\" Arizona and the West (1969): 129-146. in JSTOR * Petrowski, William R. \"Kansas City to Denver to Cheyenne: Pacific Railroad Construction Costs and Profits.\" Business History Review 48#2 (1974): 206-224. online ===Primary sources=== * Leland, Charles Godfrey. The Union Pacific Railway, Eastern Division: or, Three thousand miles in a railway car (1867) online ==Other websites== *University of Kansas: Kansas Pacific Railroad * Map: Native Americans and Kansas Pacific *UP Limon Subdivision: building of the Kansas Pacific *Thomas Ewing Jr. and the origin of the Kansas Pacific *John H. McDowell Papers, 1853-1884 . McDowell was part owner of the Leavenworth, Pawnee and Western Railroad Company and this collection documents the business of the railroad while he was associated with it. .44 cubic feet (processed). Finding aid compiled by Susan Wheatley. Eastern Kentucky University Special Collections and Archives Category:Trains Category:American transport companies Category:1860s establishments in Kansas Category:Companies based in Kansas Category:1863 establishments in the United States Category:1880 establishments in the United States Category:Defunct companies of the United States",
 "title": "Kansas Pacific Railway"
}