{
 "id": "71328",
 "text": "Nicholas II (Nikolai Alexandrovich Romanov; 186817 July 1918) was the last Emperor of Russia, King of Congress Poland, and Grand Duke of Finland from 1894 until his abdication in March 1917. Following the Russian Revolution, his reign ended the Russian Empire and the Romanov dynasty's 300 year rule of Russia. He married Princess Alix of Hesse, who was the daughter of Princess Alice of the United Kingdom and the granddaughter of Queen Victoria and they had five children, Olga, Tatiana, Maria, Anastasia, and Alexei. His son suffered from a disease called haemophilia, which caused his parents incredible sadness. After 1905, the royal family became friends with Grigori Rasputin, whom they believed could treat Alexei.Rasputin is sometimes described as being a monk or a priest, but he did not have any job in the Russian Orthodox Church. In the first 20 years of his reign, Nicholas tried to make Russia more modern, but these plans were held back by the nobles and the Tsar's weak leadership. He and his chief ministers Sergei Witte and Pyotr Stolypin encouraged railways, land reform, education, the borrowing of money and friendship with France and the United Kingdom. In 1905, after Russia lost a war with Japan and the killing of protestors on Bloody Sunday, there were large protests against his government by people who wanted a parliament. He created the Duma, but he would not allow it to have many powers. His reign also saw the Khodynka Tragedy, attacks on the Russian Jews, anger over the power of Rasputin, and the imprisonments and executions of people who opposed the government. In 1914, he led Russia into World War I, but the war went badly for Russia and caused great hardship. It led to the fall of the monarchy in the Russian Revolution in 1917. He abdicated from the throne in March of that year. He and his family were held as prisoners under house arrest. On July 17, 1918, Nicholas, his wife and their children were killed by a firing squad, on the orders of the new Bolshevik government. In 1981, the Tsar and his family were made Saints by the Russian Orthodox Church. In 1990, the bones of the Tsar and his family were found in the woods and given a proper burial in St Petersburg in 1998. The historians of the Soviet Union often described Nicholas as a tyrant. Modern historians see him as a man who tried to do what was right for his country but did not have the skills and was easily led by people who gave him bad advice.Ferro, Marc (1995) Nicholas II: Last of the Tsars. New York: Oxford University Press, , p. 2 == Notes == == References == == Other websites == * alexanderpalace.org * FrozenTears.org A media library of the last Imperial Family. Category:1868 births Category:1918 deaths Category:House of Romanov Category:House of Holstein-Gottorp-Romanov Category:Assassinations in the Russian Revolution Category:Russian tsars Category:Russian Orthodox saints Category:Emperors and Empresses of Russia",
 "title": "Nicholas II"
}