{
 "id": "713470",
 "text": "Alan Roger Mulally (born August 4, 1945) is an American engineer, business executive, and former President and Chief Executive Officer of the Ford Motor Company. He retired from Ford Motor Company on July 1, 2014. Ford had been struggling during the late-2000s recession. Mulally made it profitable again. Because of him, Ford was the only American major car manufacturer to avoid a bailout fund given by the government. On July 15, 2014, he was chosen to be on the Google Board of Directors. Mulally was the executive vice president of Boeing and the CEO of Boeing Commercial Airplanes (BCA). He started his career with Boeing as an engineer in 1969. He was mostly credited with BCA's :simple:wikt:resurgence against Airbus in the mid-2000s. In 2015, Mulally was inducted into the International Air & Space Hall of Fame at the San Diego Air & Space Museum.Sprekelmeyer, Linda, editor. These We Honor: The International Aerospace Hall of Fame. Donning Co. Publishers, 2006. . == Early life == Mulally was born in Oakland, California. He was the son of Lauraine Lizette (Clark) and Charles R. Mulally, who met at a USO dance. Mulally grew up in his mother's hometown of Lawrence, Kansas. This was where he was a member of Plymouth Congregational Church. He considered Rev. Dale Turner \"a mentor and an inspiration\". He used to sit at the front of the church to study the minister's influence on the congregation. Mulally said that he was motivated at the age of 17 by president John F. Kennedy's challenge to send a man to the moon. === Education === Mulally graduated from the University of Kansas. It was also his mother's alma mater. He graduated with Bachelor of Science (1968) and Master of Science (1969) degrees in aeronautical and astronautical engineering. He was also a member of the Kappa Sigma Fraternity. == References == == Other websites == * Biography: Alan Mulally at Ford Motor Company * * * * Profile at Bloomberg Businessweek * Alan Mulally's federal campaign contributions from Newsmeat * Category:1945 births Category:Living people Category:Ford Category:People from Lawrence, Kansas",
 "title": "Alan Mulally"
}