{
 "id": "713471",
 "text": "Lawrence High School (LHS) is a public secondary school in Lawrence, Kansas, USA. It is operated by Unified School District 497. It serves students of grades 9 to 12. The school is one of the two public high schools located in the city. Lawrence High had 1,260 students in the 2007–2008 school year. The school colors are red and black. The mascot is the \"Chesty Lion\". Lawrence High School was created in 1857. It was created to help educate Lawrence because there were a lot of people living there. The first classes were held in the basement of a Unitarian Church. Three years later, the school was moved to the current place of Liberty Memorial Central Middle School, on Massachusetts Street. In 1930, the Lion became the school symbol. In 1946, it made its official debut as the school mascot. Lawrence High moved to its current place on Louisiana Street in 1954. ==Extracurricular activities== ===Athletics=== Currently Lawrence High has more than 100 state championships in various sports, one of the highest totals in the United States. The first state championship was won in 1914 in boys basketball. Due to the success of Lawrence High and the University of Kansas, Lawrence was featured as a candidate for Titletown, United States by ESPN. ====Football==== The Lawrence High School Chesty Lions have 31 undefeated seasons in football. This is the most in the United States. The Chesty Lions won a High School Football National Championship in 1960. From 1930–2008, games were played at Haskell Memorial Stadium. Once the new football stadium was finished being built at Lawrence High School, the football team started playing games at the new stadium in 2009. ===State Championships=== Lawrence High has won the following state championships: State Championships Season Sport Number of Championships Year Fall Football 27 1919^, 1927^, 1928^, 1945^, 1946^, 1947+, 1952+, 1956+, 1957+, 1958+, 1959+, 1960+, 1962+, 1963+, 1964+, 1966+, 1968+, 1979, 1984, 1986, 1987, 1989, 1990, 1991, 1992, 1993, 1995 Cross Country, Boys 2 2008, 2009 Cross Country, Girls 3 1985, 1986, 1987 Volleyball 16 1975, 1976, 1977, 1978, 1979, 1980, 1983, 1984, 1985, 1989, 1990, 1991, 1992, 1994, 1995, 2018 Gymnastics, Girls 3 2004, 2005, 2006 Gymnastics, Boys 21 1960, 1961, 1962, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1979, 1980, 1981, 1983, 1984, 1986, 1988 Winter Basketball, Boys 4 1914, 1948, 1983, 1995 Basketball, Girls 3 1984, 1992, 2008 Swimming, Boys 1 1997 Indoor Track, Girls 2 1977, 1978 Spring Golf, Boys 1 1983 Golf, Girls 4 1975, 1977, 1982, 1984 Tennis, Boys 2 1981, 1995 Tennis, Girls 1 1989 Baseball 3 1996, 2000, 2009 Softball 1 1977 Swimming, Girls 7 1986, 1989, 1990, 1991, 1992, 1993, 1994 Track and Field, Boys 5 1989, 1990, 1991, 1997, 2006 Track and Field, Girls 4 1978, 1979, 2015, 2019 Total 110 :^ predates KSHSAA playoffs and AP poll :+predates KSHSAA playoffs; ranked #1 in final AP poll ==Notable alumni== * Erin Brockovich, had a movie made about her when she helped a town win a $333 million lawsuit because Pacific Gas and Electric Company had contaminated their water supply * Danny Manning, led the University of Kansas basketball team to the 1988 NCAA Men's Division I Basketball Tournament championship * Brian McClendon, Google Earth creator * Alan Mulally, former Ford Motors CEO * Sri Srinivasan, Judge, United States Court of Appeals for the District of Columbia Circuit ==References== ==Other websites== * * Category:Lawrence, Kansas Category:High schools in the United States",
 "title": "Lawrence High School (Kansas)"
}