{
 "id": "713555",
 "text": "Dennis Edwards (19 January 1937 – 13 September 2019) was an English professional footballer. He played as an inside forward in the Football League. He played for Charlton Athletic, for whom he made over 170 appearances. He also played league football for Portsmouth, Brentford and Aldershot. He was a goalscorer in non-league football for Slough Town and Wycombe Wanderers. He capped by England at amateur level. Edwards died on 13 September 2019 in Denmead, Portsmouth at the age of 82. == Personal life == Edwards was educated at the Lea School and Slough Grammar School. After leaving school he worked as a clerk for ICI and served his national service in the RAF. Edwards was a Brentford supporter. After retiring from football, he lived in Denmead and established a frozen food business. == Career statistics == Appearances and goals by club, season and competition Club Season League FA Cup League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Slough Town 1954–55 Corinthian League 7 1 0 0 — 74 appearances in Berks & Bucks Senior Cup, 3 appearances and 1 goal in Corinthian League Memorial Shield 1 14 1 1955–56 23 19 2 1 — 104 appearances and 7 goals in Berks & Bucks Benevolent Cup, 4 appearances and 1 goal in Berks & Bucks Senior Cup, 1 appearance and 2 goals in Corinthian League Memorial Shield, 1 appearance and 1 goal in FA Amateur Cup 11 35 31 1956–57 5 7 0 0 — 32 appearances and 1 goal in Berks & Bucks Benevolent Cup, 1 appearance in Berks & Bucks Senior Cup 1 8 8 Total 35 27 2 1 — 20 12 57 40 Portsmouth 1964–65 Second Division 16 2 0 0 0 0 — 16 2 1965–66 32 10 2 0 2 0 — 36 10 1966–67 22 2 4 2 1 0 — 27 4 1967–68 1 0 0 0 0 0 — 1 0 Total 71 14 6 2 3 0 — 80 16 Brentford (loan) 1967–68 Fourth Division 11 2 — — — 11 2 Career total 117 43 8 3 3 0 20 12 148 58 == Honours == Slough Town *Berks & Bucks Senior Cup: 1954–55 *Berks & Bucks Benevolent Cup (2): 1955–56, 1956–57 ==References== Category:1937 births Category:2019 deaths Category:English footballers Category:Brentford F.C. players Category:Charlton Athletic F.C. players Category:People from Portsmouth Category:Portsmouth F.C. players",
 "title": "Dennis Edwards (footballer)"
}