{
 "id": "713632",
 "text": "Blue Beetle is the name of three fictional superheroes who appear in DC Comics. They bought the rights to the character in 1983, using the name for three distinct characters over the years. == Publication history == The original Blue Beetle was created by Charles Nicholas Wojtkoski and Fox Comics and later owned by Charlton Comics. == Fictional character biographies == === Dan Garrett === The first Blue Beetle was Dan Garret (later spelled Dan Garrett), who initially gained superpowers from a special vitamin, which was later changed to gaining powers from a \"sacred scarab\". The original Blue Beetle was featured in not only his own comic but also a weekly radio serial. === Ted Kord === The second Blue Beetle, created by Charlton and later taken over by DC Comics, was the successor to Dan Garrett known as Ted Kord. Kord \"jumped\" to the DC Comics universe during the Crisis on Infinite Earths alongside a number of other Charlton Comics characters. The second Blue Beetle later starred in his own 24-issue comic. Kord never had any super powers but used science to create various devices to help him fight crime. He became a member of the Justice League of America and was later killed during the prelude to DC Comics' Infinite Crisis cross over. === Jaime Reyes === The third Blue Beetle, created by DC Comics, is Jaime Reyes, a teenager who discovered that the original Blue Beetle scarab morphed into a battle suit allowing him to fight crime and travel in space. == In other media == The character has appeared in television series, action figures, and video games. A movie about Blue Beetle was released in 2023 by Warner Bros. with Xolo Maridueña playing Jaime Reyes as the main character. ==Other websites== * Blue Beetle (Dan Garrett)( from the original December 4, 2011) and Blue Beetle (Ted Kord) (archived from the original December 4, 2011) at Don Markstein's Toonopedia. * Blue Beetle (Dan Garrett) and Blue Beetle (Ted Kord) at the International Catalogue of Superheroes Category:DC Comics superheroes Category:Fictional characters introduced in 1983",
 "title": "Blue Beetle"
}