{
 "id": "713637",
 "text": "Starfire (Princess Koriand'r) is a fictional superheroine appearing in books published by DC Comics. She made her first appearance in DC Comics Presents #26 (October 1980). She was created by Marv Wolfman and George Pérez. The character has been a member of the Teen Titans and has also appeared on several other teams, including the Outsiders, Outlaws, and Justice League Odyssey. == Publication history == The name \"Starfire\" first appeared in a DC Comic in the story \"The Answer Man of Space\", in Mystery in Space #73, February 1962, written by Gardner F. Fox. In 2013, Starfire placed 21st on IGN's \"Top 25 Heroes of DC Comics\".Schedeen, Jesse (November 19, 2013). \"The Top 25 Heroes of DC Comics\". IGN. == Fictional character biography == Within the main continuity of the DC Universe, her origin is revealed to be Princess Koriand'r, an alien princess from the planet Tamaran and heir to the throne until she was ousted in a coup by her elder sister, Komand'r (also known as Blackfire), whom sold her into slavery. Subjected to torture and sexual exploitation, Koriand'r would later receive additional powers following experimentations by alien scientists. Escaping her captors, the character would find herself on Earth and befriended the Teen Titans, becoming a long- lasting member of the team over the years. While on Earth, the character has been depicted as a model under the alias Kory Anders, occasionally the leader of the Teen Titans, and was the principal of Teen Titans Academy during a period in which the Titans help trained future superheroes of the DC Universe. == Powers and abilities == The radiation is then converted to pure energy, allowing her to fly at supersonic speeds. Starfire is capable of using this power to fly in space and even go fast enough to cross several solar systems in minutes to seconds. This energy also gives her incredible superhuman strength and durability. == In other media == Starfire has appeared in many cartoon television shows and movies, including as a member of the Teen Titans in Cartoon Network's eponymous series, voiced by Hynden Walch. She also appears in the DC Universe series Titans, played by Anna Diop. ==References== ==Other websites== *DC Comics: Starfire Category:DC Comics aliens Category:DC Comics superheroes Category:Fictional characters with fire or heat abilities",
 "title": "Starfire (Teen Titans)"
}