{
 "id": "713675",
 "text": "The Moody Blues are an English rock band. They were created in Birmingham in 1964. At first, the band had keyboardist Mike Pinder, multi-instrumentalist Ray Thomas, guitarist Denny Laine, drummer Graeme Edge, and bassist Clint Warwick. The group came became famous for their rhythm and blues music. They made some changes in musicians but settled on a line-up of Pinder, Thomas, Edge, guitarist Justin Hayward, and bassist John Lodge, who stayed together for most of the band's \"classic era\" into the early 1970s. Their second album, Days of Future Passed, which was released in 1967, was a combination of rock with classical music. This made the band early creators in the development of art rock and progressive rock. It has been described as a \"landmark\" and \"one of the first successful concept albums\". The group toured a lot in the early 1970s. Then, they took a long break from 1974 until 1977. Founder Mike Pinder left the group a year after they re-formed. He was replaced by Swiss keyboardist Patrick Moraz in 1978. In the following decade they took on a more synth-pop sound. They created The Other Side of Life in 1986. This made them the first band to earn each of its first three top 10 singles in the United States in a different decade. Health problems led to a smaller role for founder Ray Thomas throughout the 1980s. However, he made more music after Moraz left in 1991. Thomas left the band in 2002. The band's most recent album was December (2003), a collection of Christmas music. They continued to tour throughout the first decade of the 2000s. They still regroup for some events, one-off concerts, short tours, and cruises. The Moody Blues' most successful songs include \"Go Now\", \"Nights in White Satin\", \"Tuesday Afternoon\", \"Question\", and \"Your Wildest Dreams\". The band has sold 70 million albums worldwide. This includes 18 platinum and gold LPs. They were inducted into the Rock and Roll Hall of Fame in 2018. All five original members of the Moody Blues – Warwick, Thomas, Edge, Laine and Pinder – had died by 2024. Rod Clark, who briefly replaced Warwick as the band's bassist, died in 2025. Hayward, Lodge and Moraz all remain musically active. == Members == * Graeme Edge (b. 30.03.1941 – d. 11.11.2021) – drums, percussion, vocals (1964–2018; died 2021) * Ray Thomas (b. 29.12.1941 – d. 04.01.2018) – flute, harmonica, saxophone, percussion, vocals (1964–2002; died 2018) * Mike Pinder (b. 27.12.1941 – d. 24.04.2024) – keyboards, vocals (1964–1978; died 2024) * Denny Laine (b. 29.10.1944 – d. 5.12.2023) – guitar, vocals (1964–1966; died 2023) * Clint Warwick (b. 25.06.1940/1945 – d. 15.05.2004) – bass, vocals (1964–1966; died 2004) *Rod Clark (b. 23.11.1942 – d. 17.03.2025) – bass, vocals (1966; died 2025) * Justin Hayward (born 14.10.1946) – guitar, vocals (1966–2018) * John Lodge (born 20.07.1943/1945) – bass, guitar, vocals (1966–2018) * Patrick Moraz (born 24.06.1948) – keyboards (1978–1991) ==References== ==Other websites== Category:Musical groups established in 1964 Category:1960s establishments in England Category:English rock bands",
 "title": "The Moody Blues"
}