{
 "id": "713646",
 "text": "Deadshot (Floyd Lawton) is a fictional character appearing in American comic books published by DC Comics. He was created by David Vern Reed, Lew Schwartz, and Bob Kane. The character made his first appearance in Batman #59 (June–July 1950). Deadshot is a villain of the superhero Batman. He is seen as a supervillain, though he is sometimes depicted as an antihero. Since then, he has been a recurring character in Batman comics. Since 1986, Deadshot has also been frequently portrayed in comics books featuring the Suicide Squad. IGN's ranked Deadshot as the 43rd Greatest Comic Book Villain of All Time in 2009. == Fictional character biography == As a child, Lawton idolized his brother. When his mother convinced his brother to kill their father, his brother locked Floyd outside. Floyd, wishing to save his brother from a grim future, took a rifle to shoot the gun out of his brother's hand. The character was not seen again until twenty-nine years later when writer Steve Englehart along with artists Marshall Rogers and Terry Austin retooled him in Detective Comics (vol.1) #474 (1979), now presenting him with customized wrist-mounted guns and a unique mask featuring a multi-use lens over his right eye. == Powers and abilities == Deadshot is an expert in firearms and an excellent sniper who regularly boasts of never missing a shot. He is often considered one of the deadliest assassins in the DC Universe. Lawton is eventually brought to justice by the superhero Batman, who becomes Lawton's most recurring enemy over the years (though he also occasionally comes into conflict with other heroes). While typically portrayed as a supervillain, he is also sometimes depicted as an antihero as a member of the Suicide Squad where he fights more dangerous villains and threats, his need to protect those he regards as family, and his occasional efforts to hold himself accountable to a personal code of ethics. == In other media == The character has been substantially adapted from the comics into various forms of media, including television series, feature movies and video games. Deadshot was portrayed by Bradley Stryker in the final season of Smallville, by Michael Rowe in the live-action Arrowverse franchise. In the live-action 2016 movie Suicide Squad, he was played by Will Smith. ==References== Category:Batman characters Category:DC Comics characters Category:Fictional characters introduced in the 1950s",
 "title": "Deadshot"
}