{
 "id": "713784",
 "text": "Margaret of Anjou (; 23 March 1430 – 25 August 1487) was the queen consort of England by marriage to King Henry VI from 1445 to 1461 and again from 1470 to 1471. She was born in the Duchy of Lorraine into the House of Valois-Anjou. Margaret was the second-eldest daughter of René, King of Naples, and Isabella, Duchess of Lorraine. Margaret was important in the Wars of the Roses. At times, she personally led the House of Lancaster into battle. Her husband had several nervous breakdowns. They were seen as insanity and so Margaret ruled the kingdom in his place. She is the one who called for a Great Council in May 1455, which excluded the House of York, headed by Richard of York, 3rd Duke of York. That started a series of civil wars that lasted for more than thirty years and caused the deaths of thousands of men. One of those who died was her only son, Edward of Westminster, Prince of Wales, at the Battle of Tewkesbury in 1471. Margaret was taken prisoner by the Yorkists after the Lancastrian defeat at Tewkesbury. In 1475, she was ransomed by her cousin, King Louis XI of France. She went to live in France as a poor relation of the French king. She died in France at the age of 57. ==Early life and marriage== Margaret was born on 23 March 1430 at Pont-à-Mousson, in the Duchy of Lorraine. Margaret was the second daughter of René, King of Naples, and of Isabella, Duchess of Lorraine. She had five brothers and four sisters, as well as three half- siblings from her father's relationships with mistresses. Her father, popularly known as \"Good King René\", was Duke of Anjou and titular king of Naples, Sicily and Jerusalem. He was described as \"a man of many crowns but no kingdoms\". Margaret was baptised at Toul, Lorraine. She spent her early years at the castle at Tarascon, on the Rhône River, in Provence and in the old royal palace at Capua, near Naples, in the Kingdom of Sicily. Her mother took care of her education and may have arranged for her to have lessons with the scholar Antoine de la Sale, who taught her brothers. In childhood, Margaret was known as la petite créature. On 23 April 1445, Margaret married King Henry VI of England, at Titchfield Abbey, in Hampshire. Henry was eight years older than she was. The King and the Queen of France were the uncle and aunt of the groom and the bride, respectively: Henry's late mother, Catherine of Valois, had been the sister of King Charles VII, whose wife, Marie of Anjou, was a sister of Margaret's father René. Further, Henry claimed for himself the Kingdom of France. He also controlled parts of northern France. That made the French king agree to the marriage of Margaret to his rival on the condition that he would not have to provide the customary dowry and instead would receive the lands of Maine and Anjou from England. The English government, fearing a highly-negative reaction, kept that provision secret from the English public. At the age of 15, Margaret was crowned Queen Consort of England on 30 May 1445 at Westminster Abbey by John Stafford, Archbishop of Canterbury.Margaret Lucille Kekewich, The Good King: René of Anjou and Fifteenth Century Europe, (Palgrave Macmillan, 2008), 101. She was described as beautiful and furthermore \"already a woman: passionate and proud and strong-willed\".Kendall, p.19. Those who anticipated the future return of English claims to French territory believed that she already understood her duty to protect the interests of the Crown fervently. She seems to have inherited this from her mother, who fought to establish her husband's claim to the Kingdom of Naples, and from her paternal grandmother, Yolande of Aragon, who actually governed Anjou \"with a man's hand\" by puttingthe province in order and keeping out the English. Thus, by family example and her own forceful personality, she was fully capable of becoming the \"champion of the Crown\". ===Birth of a son=== Henry was more interested in religion and learning than in military matters and was not a successful king. He had ruled since he was only a few months old. Many of his actions had been done by people who ruled in his place. When he married Margaret, his mental condition was already unstable.When their only son, Edward of Westminster, Prince of Wales, was born on 13 October 1453, Henry had already suffered a complete breakdown. There were rumours that he was incapable of fathering a child and that the new Prince of Wales was the result of an adulterous liaison. Many have speculated that either Edmund Beaufort, 2nd Duke of Somerset, or James Butler, 5th Earl of Ormond, was the young prince's actual father. Both were faithful allies of Margaret. Although Margaret was aggressively partisan and had a volatile temperament, she shared her husband's love of learning because of her cultured upbringing. She also gave her patronage to the founding of Queens' College, Cambridge. Elizabeth Woodville (born ca. 1437), later Queen of England as future wife of Margaret's husband's rival, King Edward IV, may have served Margaret of Anjou as a maid of honour. However, there is little evidence to permit historians to establish that with absolute certainty, and several women at Margaret's court bore the name Elizabeth or Isabella Grey. Smith, George (1975). The Coronation of Elizabeth Wydeville. Gloucester: Gloucester Reprints. p.28 ==Beginnings of conflict== ===Enmity between Margaret and the Duke of York=== After retiring from London to live in lavish state at Greenwich, Margaret was occupied with the care of her young son and did not display any signs of political will until she believed her husband was threatened with deposition by the ambitious Richard of York, 3rd Duke of York,Kendall, pp.30–31. who had been appointed Lord Protector while Henry was mentally incapacitated from 1453 to 1454. The Duke of York was a credible claimant to the English throne and by the end of his protectorship had many powerful nobles and relatives prepared to back his claim. The Duke of York was powerful; Henry's advisers corrupt; Henry himself trusting, pliable, and increasingly unstable; Margaret, defiantly unpopular, grimly and gallantly, determined to maintain the English crown for her children. However, at least one scholar identifies the source of the eventual Lancastrian downfall not as Richard's ambitions nearly so much as Margaret's ill-judged enmity toward Richard and her over-indulgence in unpopular allies.Kendall, pp. 18, 19 & 24: \"Excessive greed and ambition—the besetting sins of his contemporary peers—seem to have been largely absent from his character. It would require the unrelenting enmity of a queen to remind him that he owned a better title to the throne than Henry the Sixth,\" id. at 18.\" It appears that Richard, Duke of York, was neither aiming at the crown nor seeking more of a voice in the government than he was entitled to. He represented, to many Englishmen of the day, the only hope of rescue from the swamp of disorder and evil rule in which the realm was floundering.\" Id. at p.517, n8. Nevertheless, Margaret was a powerful force in the world of politics. Henry easily followed whenever she wanted something done.Fraser, p.139. Margaret's biographer Helen Maurer, however, disagrees with earlier historians, who dated the much-vaunted enmity between Margeret and Richard to the time he obtained the office of the protectorship. She suggests the mutual antagonism came about two years later, in 1455, in the wake of the First Battle of St Albans, when Margaret perceived him as a challenge to the king's authority. Maurer bases that conclusion on a study of Margaret's pattern of presenting gifts, which revealed that Margaret took a great deal of care to demonstrate that she favoured both Edmund Beaufort (Somerset) and Richard equally in the early 1450s. Maurer also claims that Margaret appeared to accept Richard's protectorship and asserts there is no substantial evidence to back up the long-standing belief that she was responsible for the Yorkists' exclusion from the Great Council after Henry's recovery (see below).Review of Maurer, Helen (2003). Margaret of Anjou: Queenship and Power in Late Medieval England. Retrieved 1 March 2011 The late historian Paul Murray Kendall, on the other hand, maintained that Margaret's allies Edmund Beaufort (Somerset) and William de la Pole, Earl of Suffolk, had no difficulty in persuading her that York, who had been one of Henry VI's most trusted advisers, was responsible for her unpopularity and was already too powerful to be trusted. Margaret convinced Henry to recall Richard from his post as governor in France and banish him instead to Ireland but also she attempted to have him assassinated during his travels to and from Ireland, once in 1449 and again in 1450.Kendall, pp. 21–23, citing The Paston Letters, vol. 4, as original source. Edmund Beaufort (Somerset) and Suffolk's joint responsibility for the secret surrender of Maine in 1448 and the subsequent disastrous loss of the rest of Normandy in 1449 embroiled Margaret and Henry's court in riots, uprisings by the magnates and calls for the impeachment and execution of Margaret's two strongest allies. It also might have made an ultimate battle to the death between Margaret and the House of York inevitable by making manifest Richard's dangerous popularity with the Commons. Richard, safely returned from Ireland in 1450, confronted Henry and was readmitted as a trusted advisor. Soon thereafter, Henry agreed to convene Parliament to address the calls for reform. When Parliament met, the demands could not have been less acceptable to Margaret: both Edmund Beaufort (Somerset) and Suffolk were impeached for criminal mismanagement of French affairs and subverting justice, and it was also charged as a crime against Suffolk, now a duke, that he had antagonised the king against the Duke of York. Further, the demands for reform put forward included that the Duke of York be acknowledged as the first councillor to the king, and the Speaker of the Commons, perhaps with more fervour than wisdom, even proposed Richard, Duke of York, be recognised as heir to the throne.Kendall, pp.21–23. Within a few months, however, Margaret had regained control of Henry, Parliament was dissolved, the incautious Speaker was thrown in prison and Richard of York retired to Wales for the time being.Kendall, pp.13–14. When York and the king and queen met again, on a field of truce at Blackheath in 1452, he found himself ambushed and taken prisoner while Edmund Beaufort (Somerset) was again restored to honours. Id. In 1457, the kingdom was again outraged when it was discovered that Pierre de Brézé, a powerful French general and an adherent of Margaret, had landed on the English coast and burnt the town of Sandwich. As leader of a French force of 4,000 men from Honfleur, he aimed at taking advantage of the chaos in England. The mayor, John Drury, was killed in the raid. It thereafter became an established tradition, which survives to this day, that the Mayor of Sandwich wears a black robe in mourning the ignoble deed. Margaret, in association with de Brézé, became the object of scurrilous rumours and vulgar ballads. Public indignation was so high that Margaret, with great reluctance, was forced to give the Duke of York's kinsman Richard Neville, 16th Earl of Warwick, a commission to keep the sea for three years. He already held the post of Captain of Calais.Kendall, p.32. ===Leader of Lancastrian faction=== Hostilities between the rival Yorkist and Lancastrian factions soon flared into armed conflict. In May 1455, just over five months after Henry VI recovered from a bout of mental illness, and Richard of York's protectorship had ended. Margaret called for a Great Council from which the Yorkists were excluded. The Council called for an assemblage of the peers at Leicester to protect the king \"against his enemies\". York apparently was prepared for conflict and soon was marching south to meet the Lancastrian army marching north. The Lancastrians suffered a crushing defeat at the First Battle of St Albans on 22 May 1455. Edmund Beaufort (Somerset), the Earl of Northumberland and Lord Clifford were killed, Wiltshire fled the battlefield and King Henry was taken prisoner by the victorious Duke of York. In March 1458, along with her husband and leading nobles of the warring factions, she took part in the Loveday procession in London. In 1459, hostilities resumed at the Battle of Blore Heath, where James Tuchet, 5th Baron Audley, was defeated by a Yorkist army under Richard Neville, 5th Earl of Salisbury ==Wars of the Roses== ===Early campaigns=== While Margaret was attempting to raise further support for the Lancastrian cause in Scotland,Haigh, p.32. her principal commander, Henry Beaufort, 3rd Duke of Somerset,Wagner, p.26. gained a major victory for her at the Battle of Wakefield on 30 December 1460 by defeating the combined armies of the Duke of York and the Earl of Salisbury. Both men were beheaded and their heads displayed on the gates of York. As Margaret was in Scotland at the time the battle had taken place, it was impossible that she issued the orders for their executions despite popular belief to the contrary.Kendall, pp.39–40. She followed up with a victory at the Second Battle of St Albans, at which she was present, on 17 February 1461. In the battle, she defeated the Yorkist forces of Richard Neville, 16th Earl of Warwick, and recaptured her husband. It was after this battle that she, in a blatant act of vengeance, ordered the execution of two Yorkist prisoners of war, William Bonville, 1st Baron Bonville, and Sir Thomas Kyriell, who had kept watch over Henry to keep him out of harm's way during the battle. The king had promised the two knights immunity, but Margaret gainsaid him and ordered their executions by decapitation. It is alleged that she put the men on trial at which her son presided. \"Fair son\", she allegedly asked, \"what death shall these knights die?\" Prince Edward replied that their heads should be cut off despite the king's pleas for mercy.Costain, p.305. ===Stay in France=== The Lancastrian army was beaten at the Battle of Towton on 29 March 1461 by the son of the late Duke of York, the future Edward IV of England, who deposed King Henry and proclaimed himself king. Margaret was determined to win back her son's inheritance and fled with him into Wales and later Scotland. Finding her way to France, she made an ally of her cousin, King Louis XI of France, and at his instigation, she allowed an approach from Edward's former supporter, Richard Neville, Earl of Warwick, who had fallen out with his former friend as a result of Edward's marriage to Elizabeth Woodville and was now seeking revenge for the loss of his political influence. Warwick's daughter, Anne Neville, was married to Margaret's son, Edward, to cement the alliance. Margaret insisted for Warwick to return to England to prove himself before she followed. He did so and restored Henry VI briefly to the throne on 3 October 1470. ===Final defeat at Tewkesbury=== When Margaret and her son and daughter-in-law (Anne) were ready to follow Warwick back to England, the tables had again turned in favour of the Yorkists, and Warwick was defeated and killed by the returning King Edward IV in the Battle of Barnet on 14 April 1471. Margaret was forced to lead her own army at the Battle of Tewkesbury on 4 May 1471 at which the Lancastrian forces were defeated and her 17-year-old son Edward was killed. The circumstances of Edward's death have never been made clear; it is not known whether he was killed in the actual fighting or executed after the battle by the Duke of Clarence. If he died in battle, he was the only Prince of Wales ever to do so. Over the previous ten years, Margaret had gained a reputation for aggression and ruthlessness, but after her defeat at Tewkesbury and the death of her only son, she was completely broken in spirit. After she was taken captive by William Stanley at the end of the battle, Margaret was imprisoned by the order of King Edward. She was sent first to Wallingford Castle and then was transferred to the more secure Tower of London. Henry VI was also imprisoned in the Tower in the wake of Tewkesbury and died there on the night of 21 May. The cause of his death is unknown, but it is suspected to be violent. In 1472, she was placed in the custody of her former lady-in- waiting Alice Chaucer, Duchess of Suffolk, where she remained until ransomed by Louis XI in 1475.Hartley, Cathy (2003). A Historical Dictionary of British Women. London: Europa Publications Ltd. p.298 ==Death== Margaret lived in France for the next seven years as a poor relation of the king. She was hosted by Francis de Vignolles and died in his castle of Dampierre-sur-Loire, near Saumur, in Anjou, on 25 August 1482 at the age of 52.Hookham, Mary Ann The life and times of Margaret of Anjou, queen of England and France; and of her father René \"the Good,\" king of Sicily, Naples, and Jerusalem, Tinsley brothers eds. London, 1872, p. 369-71, retrieved on 17 December 2016. She was entombed next to her parents in Angers Cathedral, but her remains were removed and scattered by revolutionaries who ransacked the cathedral during the French Revolution. == Letters == Many letters written by Margaret during her tenure as queen consort still exist. One was written to the Corporation of London regarding injuries inflicted on her tenants at the manor of Enfield, which comprised part of her dower lands.Letters of Queen Margaret of Anjou and Bishop Beckington and Others, edited by Cecil Monro, Esq., published for the Camden Society, M.DCCC.LXIII, pp.98–98, Google Books, retrieved on February 24, 2010 Another letter was written to the Archbishop of Canterbury.Monro, pp.99–100.As the letter was not dated, it is not known which Archbishop this was; Munro suggests it was most likely to have been either John Stafford, (13 May 1443 – 25 May 1452) or Cardinal John Kemp, (21 July 1452 – 22 March 1454). Margaret's letters, which are typically headed with the words \"By the Quene,\"Monro, pp.89–165 are compiled in a book edited by Cecil Monro, which was published for the Camden Society in 1863.Letters of Queen Margaret of Anjou and Bishop Beckington, and Others, edited by Cecil Monro, Esq., published for the Camden Society, M.DCCC.LXIII, Google Books, retrieved on 24 February 2010. ==Ancestors== == References == ==Sources== * * * * * * * * * * * * * ==Other websites== * Comprehensive catalogue of depictions of Margaret, from the 15th century to modern times. * * |- |- Category:1430 births Category:1482 deaths Category:Kings and Queens consort of England Category:French royalty Category:House of Lancaster",
 "title": "Margaret of Anjou"
}