{
 "id": "713842",
 "text": "Mort the Chicken is a platformer video game developed by AndNow. It was published by Crave Entertainment. It was released in the United States on November 30, 2000 for the PlayStation. It was released in Europe on January 19, 2001. In 2023, the titular character, Mort, would appear in indie game Pizza Tower as a power-up. ==Story== The chickens live peacefully in a different universe, where chickens are the main species. Mort the Chicken is the star of his own television show. In another universe, cube-like creatures called The Boolyon are spying on the chickens. The leader of the cubes, General Cubicles, notices that the chickens have stacks of hay. The Cubicles mistake them for kidnapped citizens of their universe. While Mort is filming his own TV show, the cubes reach their universe via a well and kidnap all the baby chicks, scattering them across the cube universe. Mort is the only one brave enough to stop the cubes, so he jumps down the well. This is when he starts his adventure to save the baby chicks. ==Gameplay== Mort the Chicken is a platformer. The player controls Mort as he explores his world. The player needs to rescue baby chicks and kill cubes. Mort can destroy the cubes using the comb on his head. That comb can be used as a whip. Some cubes cannot be killed. Every time Mort gets hit, the cubes take a chick from Mort and imprison it. Mort's health bar is shown by two stalks of corn. When Mort loses health, part of the corn goes away. Each level has up to 10 chicks to rescue. Mort can also get power-ups. These power-ups include making him jump higher, become bigger, attract chicks, make his neck-whip attack longer, or have chicks attack enemies. Eggs and chicken food are around the levels, and Mort can peck at these with his beak. Eggs give Mort power-ups. Chicken food gives health. ==Reception== Mort the Chicken received \"unfavorable\" reviews according to the review aggregation website GameRankings. ==References== Category:Platform games Category:2000 video games",
 "title": "Mort the Chicken"
}