{
 "id": "713967",
 "text": "The domain name gov is the generic top-level domain used by government websites used in the United States at the federal, state, and local levels. It was one of the first top-level domains, made in January 1985. The U.S. is the only country that has a government-specific top-level domain in addition to its ccTLD. Other countries typically use a second-level domain for this purpose, e.g., .gov.au for Australia, .gov.uk for the United Kingdom, .gc.ca for Canada, and .gouv.fr for France. Since the United States controls the .gov Top Level Domain, it would be impossible for another country to create a domain ending in .gov, for example, .jp.gov. Some U.S. federal agencies use .fed.us rather than .gov. The Department of Defense and its subsidiary organizations use .mil. Some U.S. governmental entities use other domains, such as the use of .com domains by the United States Postal Service (usps.com) and the United States Army (goarmy.com). Internet purists consider these usages to be improper, as these are governmental or military entities rather than commercial ones. All governments in the U.S. are allowed to use .gov, such as atlantaga.gov for the city of Atlanta, and georgia.gov for the U.S. state of Georgia. This was not always true; under an earlier policy, only federal agencies were allowed to use the domain, and agencies beneath cabinet level were needed to use subdomains of their parent agency. The usage of .gov as a gTLD controlled only by the U.S. is controversial, as some people believe this to be an example of arrogance by the U.S. - such views hold that usage of .fed.us or a new second-level domain of .gov.us would be more suitable. Others believe that U.S. control of .gov is a natural result of the fact that the U.S. federal government was responsible for the initial creation of the Internet and its first user. == Other websites == * IANA .gov whois information == References == Category:Top-level domains Category:United States",
 "title": ".gov"
}