{
 "id": "714046",
 "text": "Weekend View was a weekend morning show on The Weather Channel that aired from 5:00 to 11:00 a.m. Eastern Time on Saturday and Sunday mornings. It gave the forecast for the weekend, as well as the week ahead. == Program history == Weekend View was supposed to debut on September 17, 2005, but it was delayed to October 1, 2005 due to the busy Atlantic hurricane season. Initial plans included a primetime talk show in the second quarter of 2006, but that never came to function. In fall 2006, Stephanie Abrams left the show for Abrams & Bettes Beyond the Forecast with Mike Bettes and was not replaced. A year later, Samantha Mohr joined The Weather Channel to replace Kelly Cass, who moved to PM Edition. Cass returned to the program in May 2008. In April of that year, Dao Vu (who was the second non-meteorologist to host a live program, the other being Liz Jarvis-Fabian, who was with The Weather Channel from 1986 to 1989) left and was not replaced. In March 2009, Weekend View was extended to 5-11 a.m. ET, replacing Weekend Outlook. By this point Bill Keneely was moved to PM Edition, and Betty Davis joined Kelly Cass on the 7-11 a.m. block. Jeff Morrow and Alex Wallace hosted the new 5-7 a.m. block. In July 2010, Betty Davis left the show and The Weather Channel. She was replaced by Maria LaRosa. In November 2010, Cass moved to Weather Center and Maria LaRosa joined Todd Santos for Weekend Now. Jen Carfagno and Eric Fisher were their replacements on the 7-11 a.m. block. In July 2012, Wallace left for First Outlook, and was replaced by Danielle Banks. In October, Morrow left The Weather Channel, and was replaced by Ray Stagich. In November, Banks left for Weekend Now and Weather Center Live, but was not replaced. In July 2013, Eric Fisher left The Weather Channel, and was replaced by Reynolds Wolf. On November 10, 2013, Weekend View aired its last broadcast. It was replaced by Weather Center Live on November 16, as part of the 2013 relaunch of The Weather Channel. Category:The Weather Channel shows Category:2000s American television series Category:2005 American television series debuts Category:2010s American television series Category:English-language television programs",
 "title": "Weekend View"
}