{
 "id": "714082",
 "text": "{{Infobox writer | name = Marina Tsvetaeva | image = Marina Tsvetaeva.jpg | pseudonym = | birth_name = Marina Ivanovna Tsvetaeva | birth_date = | birth_place = Moscow, Russian Empire | death_date = | death_place = Yelabuga, Tatar ASSR, Soviet Union | occupation = Poet and writer | spouse = Sergei Efron | children = 3 | education = Sorbonne, Paris | movement = Russian symbolism | genre = | notableworks = | subject = | signature = Tsvetaeva signature 1941.jpg }} Marina Ivanovna Tsvetaeva (; 31 August 1941) was a Russian-Soviet poet. Her work is thought to be some of the greatest in twentieth century Russian literature.\"Tsvetaeva, Marina Ivanovna\" Who's Who in the Twentieth Century. Oxford University Press, 1999. ==Life== She lived through and wrote of the Russian Revolution of 1917 and the Moscow famine that followed it. In an attempt to save her daughter Irina from starvation, she placed her in a state orphanage in 1919, where she died of hunger. Tsvetaeva left Russia in 1922 and lived with her family in increasing poverty in Paris, Berlin and Prague before returning to Moscow in 1939. Her husband Sergei Efron and her daughter Ariadna Efron (Alya) were arrested on espionage charges in 1941; her husband was executed. Tsvetaeva committed suicide by hanging hereself in 1941. ==Books of Tsvetaeva poetry in English translation== * Marina Tsvetaeva: Selected Poems, trans. Elaine Feinstein. (Oxford University Press, 1971) * The Ratcatcher: A Lyrical Satire, trans. Angela Livingstone (Northwestern University, 2000) * A Captive Spirit: Selected Prose, trans. J. Marin King (Vintage Books, 1994) * Earthly Signs: Moscow Diaries, 1917–1922, ed. & trans. Jamey Gambrell (Yale University Press, 2011) * Poem of the End: Selected Narrative and Lyrical Poems , trans. Nina Kossman (Ardis / Overlook, 1998, 2004) *Moscow in the Plague Year, translated by Christopher Whyte (180 poems written between November 1918 and May 1920) (Archipelago Press, New York, 2014), 268pp, ISBN 978-1-935744-96-2 *Milestones (1922), translated by Christopher Whyte (Bristol, Shearsman Books, 2015), 122p, ISBN 978-1-84861-416-1 *After Russia: the First Notebook, translated by Christopher Whyte (Bristol, Shearsman Books, 2017), 141 pp, ISBN 978 1 84861 549 6 *After Russia: The Second Notebook, translated by Christopher Whyte (Bristol, Shearsman Books, 2018) 121 pp, ISBN 978 1 84861 551 9 *In the Inmost hour of the Soul: Poems , trans. Nina Kossman (Humana Press, 1989) * Black Earth, trans. Elaine Feinstein (The Delos Press and The Menard Press, 1992) ISBN I-874320-00-4 and ISBN I-874320-05-5 (signed ed.) * Phaedra: a drama in verse; with New Year's Letter and other long poems, trans. Angela Livingstone (Angel Classics, 2012) * \"Starry Sky to Starry Sky (Miles)\", trans. Mary Jane White. (Holy Cow Press, 1988), (paper) and (cloth) * \"Poem of the End\" in \"From A Terrace In Prague, A Prague Poetry Anthology\", trans. Mary Jane White, ed. Stephan Delbos (Univerzita Karlova v Praze, 2011) *\"After Russia\", trans. Michael Nayden (Ardis, 1992). * \"To You – in 10 Decades\", trans. by Alexander Givental and Elysee Wilson-Egolf (Sumizdat 2012) * Marina Tsvetayeva: Selected Poems, trans. David McDuff. (Bloodaxe Books, 1987) ==References== ==Other websites== * \"Marina Tsvetaeva, Poet of the extreme\" by Belinda Cooke from South magazine #31, April 2005. Republished online in the Poetry Library's Poetry Magazines site. * A small site dedicated to Tsvetaeva * Poetic translations into English * Marina Tsvetaeva biography at Carcanet Press, English language publisher of Tsvetaeva's Bride of Ice and \"Marina Tsvetaeva: Selected Poems\", translated by Elaine Feinstein. * Heritage of Marina Tsvetayeva, a resource in English with a more extensive version in Russian. * Тоска по родине / Nostalgia and four more poems from the book \"To You – in 10 Decades\", translated by Alexander Givental and Elysee Wilson-Egolf and provided by Sumizdat, the publisher. * \"She Means It When She Rhymes: Marina Tsvetaeva: Selected Poems.\" Review from Thumbscrew #17, Winter 2000/1, of works translated by Elaine Feinstein. Category:1892 births Category:1941 deaths Category:Russian poets Category:Soviet writers Category:Suicides by hanging Category:Writers from Moscow",
 "title": "Marina Tsvetaeva"
}