{
 "id": "714142",
 "text": "Child World was a toy store chain founded by Sid Shneider and Joseph Arnesano. In 1962 they opened their first store in Quincy, Massachusetts, inspired by the popularity of Toys \"R\" Us, which had already been around for a few decades and was favoured by most parents. == Stores and marketing == In 1977, Child World took over Children's Palace, another toy store chain founded in 1968. With that, they became the second biggest toy store behind Toys R Us, which in some areas had stores close to Child World locations. Child World's main (\"flagship\") store opened in 1989 in Framingham, Massachusetts, near the Shoppers World mall. The store was a success, and Child World changed the layout of eleven other stores to match up with the Framingham location. === Mascot === In 1979, Child World introduced a mascot named Peter, a panda who wore overalls with his name on them. == Bankruptcy == Child World started to struggle financially in the 1990s. Eventually toy makers stopped shipping to Child World stores, which made it hard to keep toys on the shelves for customers. In an attempt to save the company, Child World fired many of its employees and replaced them with people who had previously worked for Toys R Us. In May 1992 Child World filed for bankruptcy, held clearance sales at all 71 of its locations, and closed half of its stores. The company attempted to merge with Kiddie City, another toy store chain which was struggling financially. However, the plan failed, and by the end of 1992 Child World closed all 71 of its stores. Children's Palace still operates five stores in year-round locations (three in Ohio and two in Florida) as well as multiple pop-up locations during the holiday season. Category:Defunct companies of the United States Category:1970 establishments in the United States Category:1992 disestablishments in the United States Category:Toy companies Category:Companies based in Massachusetts Category:Retail companies of the United States",
 "title": "Child World"
}