{
 "id": "714253",
 "text": "The Addams Family (1991) is an American movie based on the cartoon by Charles Addams and the TV series by David Levy. It was the first movie directed by Barry Sonnenfeld. A sequel was released in 1993. == Plot == Gomez Addams (Raul Julia) misses his brother Fester (Christopher Lloyd), who left 25 years earlier after they had a big fight. Gomez's lawyer, Tully Alford (Dan Hedaya), owes money to Abigail Craven (Elizabeth Wilson), and notices that her adopted son, Gordon looks like Fester. Tully tells Gordon to pretend to be Fester to get close to the Addams family and find their riches. Tully and his wife, Margaret (Dana Ivey), join Grandmama to try to talk to Fester's ghost. Gordon arrives, pretending to be Fester, and Abigail tells the family Fester has been in the Bermuda Triangle. Gomez takes him to the family vault to watch home movies from their childhood. Gordon learns that Gomez was jealous of Fester, and he dated the Amor twins to get even with Fester. Gomez starts to think that this is not the real Fester. Gordon tries to return to the vault, but can't get past a booby trap. Gomez's wife, Morticia (Anjelica Huston), threatens the fake Fester, saying how much the Addamses love family, and don't trust outsiders. Gordon grows closer to the Addams family, particularly the children Wednesday (Christina Ricci) and Pugsley (Jimmy Workman), and he teaches them about swords for a school play. Fake Fester goes to the play, even though Abigail told him not to do so. After the play, Abigail says fake Fester must go away again, so the Addamses throw a large party. Wednesday hears Abigail and Gordon talking about plans to break into the vault. Tully learns that Fester, as the biggest brother, owns all of the Addams property. The Addamses' neighbor, Judge George Womack (Paul Benedict), helps the bad guys kick the Addamses out of their house. Abigail, Gordon and Tully try and fail many times to get past the booby trap blocking the vault. The Addams family must move to a motel and get jobs. Morticia tries being a preschool teacher, Wednesday and Pugsley sell poisoned lemonade, and Thing (Christopher Hart)—the family's living hand—becomes a \"delivery hand.\" Gomez is too sad to work. Morticia returns to the Addams home and Abigail and Tully catcher her and punish her, trying to learn how to get in the vault. Thing sees them and tells Gomez. The Addamses rush to save Morticia. Abigail threatens to kill Morticia unless they give her their money. Gordon stops Abigail. He uses a magic book to make a storm hit the house. Lightening strikes his head and launches Tully and Abigail out a window and into graves Wednesday and Pugsley had dug. Gordon's memory returns after the lightening strike, and he remembers that he was the real Fester all along. Morticia tells Gomez that she is pregnant. == Cast == * Anjelica Huston as Morticia Addams * Raul Julia as Gomez Addams * Christopher Lloyd as Uncle Fester * Christina Ricci as Wednesday Addams * Jimmy Workman as Pugsley Addams * Judith Malina as Grandmama * Carel Struycken as Lurch * Christopher Hart's hand as Thing * John Franklin as Cousin Itt * Rick Gomez as the voices of Cousin Itt and Digit Addams * Elizabeth Wilson as Abigail Craven * Dan Hedaya as Tully Alford * Dana Ivey as Margaret Alford * Paul Benedict as George Womack * Mercedes McNab as the girl scout * Sally Jessy Raphael as Herself * Tony Azito as Digit Addams * Barry Sonnenfeld as Passenger On Gomez's Train. == Music score == The soundtrack for The Addams Family features the song \"Addams Groove\" by MC Hammer. == Other websites == * * * * * Category:The Addams Family Category:1991 comedy movies Category:1991 fantasy movies Category:1990s American fantasy movies Category:American black comedy movies Category:Halloween movies Category:Movies about families Category:Movies based on TV series Category:Movies directed by Barry Sonnenfeld Category:Paramount Pictures movies Category:1990s dark fantasy movies Category:1990s black comedy movies",
 "title": "The Addams Family (1991 movie)"
}