{
 "id": "714430",
 "text": "Baxter Springs is a city in Cherokee County, Kansas, United States. It is along the Spring River. In 2020, 3,888 people lived there. It is the biggest city in Cherokee County. ==History== One of the largest Osage bands was led by Chief Black Dog (Manka - Chonka). His men finished what became known as the Black Dog Trail by 1803. It started from their winter territory. This territory was east of Baxter Springs, and it went southwest to their summer hunting area at the Great Salt Plains in present-day Alfalfa County, Oklahoma.Burl E. Self, \"Black Dog\" , Oklahoma Encyclopedia of History and Culture, accessed 5 Nov 2009 The Osage regularly stopped at the springs for healing on their way to summer hunting area. They made the trail by clearing it of brush and big rocks. They built ramps from the ground to the fords. The trail was the first improved road in Kansas and Oklahoma. It was big enough for eight horsemen to be riding side-by-side.Louis F. Burns, \"Osage\" , Oklahoma Encyclopedia of History and Culture, accessed 5 Nov 2009 ==Geography== Baxter Springs is at (37.023062, -94.734762). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ==People== ===2020 census=== The census of 2020 says that there were 3,888 people, 1,595 households, and 979 families living in Baxter Springs. Of the households, 63.9% owned their home and 36.1% rented their home. The median age was 38.8 years. Of the people, 78.9% were White, 7.1% were Native American, 0.6% were Asian, 0.5% were Pacific Islanders, 0.4% were Black, 1.1% were from some other race, and 11.5% were two or more races. Hispanic or Latino of any race were 3.1% of the people. ===2010 census=== The census of 2010 says that there were 4,238 people, 1,754 households, and 1,151 families living in Baxter Springs. ==References== ==Other websites== ;City * City of Baxter Springs * Baxter Springs - Directory of Public Officials * Baxter Springs Heritage Center and Museum ;Schools * USD 508, local school district ;Maps * Baxter Springs City Map , KDOT Category:Cities in Cherokee County, Kansas Category:1868 establishments in Kansas",
 "title": "Baxter Springs, Kansas"
}