{
 "id": "714435",
 "text": "The 1896 United States presidential election was the 28th presidential election in the United States. It happened on Tuesday, November 3, 1896. Former Governor William McKinley, the Republican candidate, defeated Democrat William Jennings Bryan. The 1896 campaign happened during an economic depression called the Panic of 1893. The election is considered to mark the change from the \"Third Party System\" to the \"Fourth Party System\".Williams (2010) Although, McKinley's 1896 nomination was his first time securing the nomination, he had received 10+ delegates in every convention since 1888. == Candidates == === Republican Party === * William McKinley, former Governor of Ohio (1892-1896) (Nominee) * Thomas B. Reed, Speaker of the United States House of Representatives (1889-1891; 1895-1899) * Matthew Quay, Senator of Pennsylvania (1887-1899; 1901-1904) * Levi P. Morton, 22nd Vice President of the United States (1889-1893) and Governor of New York (1895-1896) * William B. Allison, Senator of Iowa (1873-1908) === Democratic Party === * William Jennings Bryan, former Congressman of Nebraska (1891-1895) (Nominee) * Richard P. Bland, former Congressman of Missouri (1873-1895; 1897-1899) * Robert E. Pattison, former Governor of Pennsylvania (1883-1887; 1891-1895) * Joseph Blackburn, Senator of Kentucky (1885-1897; 1901-1907) * Horace Boies, former Governor of Iowa (1890-1894) * John R. McLean, newspaper publisher from Ohio (1877-1914) * Claude Matthews, Governor of Iowa (1893-1897) * Sylvester Pennoyer, former Governor of Oregon (1887-1895) ==References== ==Other websites== * * Presidential Election of 1896: A Resource Guide from the Library of Congress * 1896 popular vote by counties * How close was the 1896 election? — Michael Sheppard, Massachusetts Institute of Technology * McKinley & Hobart campaign handkerchief in the Staten Island Historical Society Online Collections Database * Election of 1896 in Counting the Votes Category:United States presidential elections Category:1896 in the United States",
 "title": "1896 United States presidential election"
}