{
 "id": "714438",
 "text": "The Odawa (also Ottawa or Odaawaa ) are an Indigenous American ethnic group. Their name means \"traders\". They are part of the Northeastern Woodlands cultures. Their language is part of the Algonquian language family. They mostly live in the northern United States and southern Canada. The US Government federally recognizes these Native Americans as a tribe. They have numerous recognized First Nations bands in Canada. They are one of the Anishinaabeg. They are related to but different from the Ojibwe and Potawatomi peoples.Odawa at The Canadian Encyclopedia, accessed September 4, 2019 == History == The Odawa may have come from some Hopewell traditions. The Odawa were historically grouped with the Ojibwe and Potawatomi. The three were allied in the Council of Three Fires.Williamson, Pamela, and Roberts, John (2nd ed. 2004). First Nations Peoples, p. 102. Toronto: Emond Montgomery Publications. ISBN 1-55239-144-2. The fought against other tribes like the Iroquois and Dakota. The Odawa were important in the fur trade. They traded beaver, deer, marten, raccoon, fox, otter, and muskrat. The Odawa got metal tools, cloths, weapons, jewelry and alcohol in return.The Wisconsin Cartographers' Guild (1998). Wisconsin's Past and Present: A Historical Atlas. Madison, WI: The University of Wisconsin Press. p. 4. The Odawa fought wars over trading. They fought against the powerful Mohawk and Iroquois in the Beaver Wars. Many Natives later died from European diseases. The natives were not immune to these new diseases. In 1752, the French Charles Langlade attacked the Miami people at Pickawillany with Odawa, Potawatomi, and Ojibwe. The Miami surrendered and handed over Englishmen for negotiations. The Odawa ate one Englishman and the Chief of the town. This was one of the events that led to increased tension in the Ohio Country. This eventually led to the French and Indian War between France and Britain. The Odawa were together with the French against the British in the French and Indian War or Seven Years' War (1756-1763). Pontiac was an important Odawa chief. Chief Egushawa allied with the British during the American Revolution (1775-1783).Barnes, Celia (2003). Native American Power in the United States, 1783–1795, p. 203. Fairleigh Dickinson University Press. ISBN 0-8386-3958-5. After the American Revolution, Odawa and other tribes fought against the United States in the Northwest Indian War. The natives lost this war and had to give up much land The Odawa gave lands in the Treaty of Greenville (1795). They gave up more land in the Treaty of Detroit (1807). After the Indian Removal Act of 1830, the remaining Odawa moved to Kansas. ==References== ==Other websites== *\"Ottawa History\" Shultzman, L. (2000). First Nations Histories. *Frederick Webb Hodge, \"Ottawa\", Handbook of American Indians North of Mexico, Vol. N-Z, Washington, DC: U.S. Government Printing Office, 1910, pp. 167–172, full text online *\"The Middle Woodland Period\", The Archaeology of Ontario *Odawa at The Canadian Encyclopedia *Odawa – First Nations seeker *Odawa – Word finder ==Official Tribal Websites== *Grand Traverse Band of Ottawa and Chippewa Indians *Little River Band of Ottawa Indians *Little Traverse Bay Bands of Odawa Indians *Ottawa Tribe of Oklahoma Category:Native Americans",
 "title": "Odawa"
}