{
 "id": "71466",
 "text": "An atlas is a collection of maps or manifolds, traditionally bound into book form, but also found in multimedia formats. It may show geographic features and political boundaries, but often social, religious and economic statistics as well. ==History== The earliest atlases were not called by that name at the time of their publication. The first book that could be called an atlas was constructed from the calculations of Claudius Ptolemy, a geographer who worked in Alexandria circa A.D. 150. The first edition was published in Bologna in 1477 and was illustrated with a set of 27 maps, though scholars say that it is not known whether the printed maps were engraved versions of original maps made by Ptolemy, or whether they were constructed by medieval Greek scholars from Ptolemy's text. From about 1544, many maps were produced, especially in the important trading centers of Rome and Venice. Each publisher worked independently. They produced maps based upon their own needs. The maps often varied dramatically in size. Over time, it became common to bind the maps together into one book. Although the term atlas was not in use in 1544, these works are now called \"IATO\" atlases - (Italian, Assembled to Order) or more frequently \"Lafreri atlases\" after one of the leading publishers of the period. ==Modern atlases== With the coming of the global market, publishers in different countries can reprint maps from plates made elsewhere. This means that the place names on the maps often use the designations or abbreviations of the language of the country in which the feature is located, to serve the widest market. For example, islands near Russia have the abbreviation \"O.\" for \"ostrov\", not \"I.\" for \"island\". This practise differs from what is standard for any given language. ==Selected general atlases== Some cartographically or commercially important atlases include the following: ;17th century and earlier *Piri Reis Map (Ottoman Empire, 1570-1612) *Theatrum Orbis Terrarum (Netherlands, 1570-1612) *Dell'Arcano del Mare (England/Italy, 1645-1661) ;18th century *Cartes générales de toutes les parties du monde (France, 1658-1676) *Britannia Depicta (London, 1720) *Atlas Nouveau (Amsterdam, 1742) *Cary's New and Correct English Atlas (London, 1787) ;19th century *Stielers Handatlas (Germany, 1817-1944) *Andrees Allgemeiner Handatlas (Germany, 1881-1939; in the UK as Times Atlas of the World, 1895) *Rand McNally Atlas (United States, 1881-present) ;20th century *Times Atlas of the World (United Kingdom, 1895-present) *Atlante Internazionale del Touring Club Italiano (Italy, 1927-1978) *Atlas Mira (Russia, 1937-present) *Gran Atlas Aguilar (Spain, 1969/1970) *Pergamon World Atlas (1962/1968) * National Geographic Atlas of the World (United States, 1963-present) *Historical Atlas of China (China) See Other websites below for online modern atlases and digitized historical atlases. The collection of digitized world atlases at DavidRumsey.com lists many significant atlases of the 18th-20th centuries. ==Related pages== * Cartography * Geography * Google Maps * Manifold * Atlas Shrugged ==Other websites== ===Sources=== *On the origin of the term \"Atlas\" ===Online atlases=== * Gheos Worldguide, world atlas with maps and statistical information from all countries of the world. * Microsoft/Encarta/Expedia World atlas, world atlas, plus atlas for North America and Europe to street level. * MapChart EarthAtlas, free online atlas with interactive maps about topics like demography, economy, health and environment. * Multimap World atlas: on UK, US, Canada, Australia and Western Europe more detailed than the rest of the world * world atlas by country * Atlas of the World A world atlas with hundreds of very detailed and elaborate maps * AtlasPhysical of the World Online world atlas with physical maps * National Atlas of the United States * Geospatial One-Stop geodata.gov * Geography Network * National Geographic MapMachine * Tirolatlas An online atlas of North-, South- and Eastern-Tyrol (Austria), requires SVG capabilities in the browser. ===History of atlases=== * Atlases, at the US Library of Congress site - a discussion of many significant atlases, with some illustrations. Part of Geography and Maps, an Illustrated Guide. ===Historical atlases online=== * Atlases at DavidRumsey.com includes many important atlases from the 18th-20th centuries, primarily from France, Germany, the United Kingdom and the United States. The site also presents maps from several centuries. About 13,600 high resolution images can be viewed and downloaded. * Ryhiner Collection Composite atlas with maps, plans and views from the 16th to the 18th century, covering the whole globe, with about 16,000 images in total, including title pages of atlases * 1645 Latin edition of Blaeu's Atlas at UCLA (partial copy) * Historical map web sites list, Perry-Castañeda Library, University of Texas * Charting North America , maps and atlases in the New York Public Library Digital Collection * maphistory.info links * A historical atlas from 1815 till today, in French * Historical Atlas of Europe from AD 1 to 2000 * Centennia Historical Atlas * World History Maps at KMLA * Historical and Political Maps of the Modern Age ===Other websites=== * Live Maps: 2D and 3D interactive maps on live.com. * Google Earth: a visual 3D interactive atlas. * World Atlas * Atlas World: a directory of atlases currently in print. * NASA's World Wind software * One Planet, Many People UN Atlas of the Human impact on the Environment * Malaria Atlas Project * InstantAtlas Create your own interactive atlas for any area Category:Cartography",
 "title": "Atlas"
}