{
 "id": "714740",
 "text": "An impeachment inquiry against Donald Trump began on September 24, 2019, when Nancy Pelosi, the Speaker of the United States House of Representatives, announced in a televised speech the beginning of a formal impeachment inquiry into Donald Trump, the 45th president of the United States. It began after President Trump and his personal attorney Rudy Giuliani repeatedly wanted the Ukrainian government to investigate Hunter Biden, the son of former vice president and 2020 presidential candidate Joe Biden, in what was seen as an attempt to hurt Biden's candidacy for president and for Trump to gain advantages in the 2020 election. In July prior to the phone call with Ukraine's President Volodymyr Zelensky, Trump stopped military aid to Ukraine; he released the hold in September. Further revelations have been revealed, including; President Trump claiming to Russian officials in 2017 that he was unconcerned with Russian interference in the 2016 United States presidential election, U.S. Secretary of State Mike Pompeo participating in the phone call to the Ukrainian President despite not being present in the released memo from the Trump Administration, as well as President Trump also pressuring Australian Prime Minister Scott Morrison in a phone call to investigate the origins of the Mueller Report in an attempt to discredit it. On October 28, 2019, Speaker Pelosi announced she would hold a floor vote on a resolution to formally establish the procedures for the impeachment hearings. On October 31, 2019, the House voted 232–196 to create procedures for public hearings. The inquiry ended on December 3. On December 5, Nancy Pelosi asked the Judiciary Committee to draft articles of impeachment against President Trump. On December 16, the House Judiciary Committee released a report specifying criminal bribery and wire fraud charges as part of the abuse of power charge. The house voted to impeach Trump on December 18, 2019. On February 5, 2020 the Senate acquitted Trump on both count. The votes were 52-48 to acquit on the first count and 53-47 to acquit on the second count. ==References== Category:Presidency of Donald Trump Category:2019 in the United States Category:September 2019 events Category:October 2019 events Category:November 2019 events Category:December 2019 events",
 "title": "Impeachment inquiry against Donald Trump"
}