{
 "id": "714811",
 "text": "The Treaty of Fort Wise of 1861 was a treaty signed between the United States and six chiefs of the Southern Cheyenne and four of the Southern Arapaho Indian tribes. Many Cheyenne people hated this treaty because only a minority of Cheyenne chiefs had signed. They were also angry because those chiefs signed asking the rest of the tribe what they wanted. Different responses to the treaty were a reason why there was conflict between whites and Indians. This led to the Colorado War of 1864, including the Sand Creek Massacre. ==Treaty of Fort Laramie (1851)== The 1851 Treaty of Fort Laramie between the United States and various tribes including the Cheyenne and Arapaho\"Treaty of Fort Laramie with Sioux, Etc., 1851.\" 11 Stats. 749, Sept. 17, 1851. says that the Cheyenne and Arapaho were supposed to have a very big amount of territory in the area between the North Platte River and Arkansas River and eastward from the Rocky Mountains to western Kansas. This area included present-day southeastern Wyoming, southwestern Nebraska, most of eastern Colorado, and the westernmost parts of Kansas.Greene 2004, p. 27. However, in November 1858, people found gold in the Rocky Mountains in ColoradoHoig 1980, p. 61. (then part of the western Kansas Territory).Greene 2004, p. 12. This created a gold rush. A lot of white people went across Cheyenne and Arapaho lands. Colorado territory officials asked federal authorities to change the size of Indians lands in the treaty. In Fall 1860, A.B. Greenwood, Commissioner of Indian Affairs, came to Bent's New Fort along the Arkansas River to make a new treaty. ==Treaty of Fort Wise (1861)== On February 18, 1861, six chiefs of the Southern Cheyenne and four of the Arapaho signed the Treaty of Fort Wise with the United States.\"Treaty with the Arapaho and Cheyenne, 1861\" (Treaty of Fort Wise). 12 Stat. 1163, p. 810. This was at Bent's New Fort at Big Timbers. This was near what is now Lamar, Colorado. Lamar had been recently leased by the U.S. Government, and the name changed to Fort Wise. The Native Americans gave most of the lands given to them by the Fort Laramie treaty to the United States. ==References== Category:1861 in the United States",
 "title": "Fort Wise Treaty"
}