{
 "id": "714924",
 "text": "The 40th parallel north is a circle of latitude that is 40 degrees north of the Earth's equatorial plane. It crosses Europe, the Mediterranean Sea, Asia, the Pacific Ocean, North America, and the Atlantic Ocean. At this latitude, the sun can be seen for 15 hours, 1 minute during the summer solstice and 9 hours, 20 minutes during the winter solstice. ==Around the world== Starting in Spain at the Prime Meridian and heading eastwards, the parallel 40° north passes through: : Co-ordinates Country, territory or sea Notes Valencian Community Mediterranean Sea Passing just north of the island of Majorca, Island of Menorca Mediterranean Sea Island of Sardinia Mediterranean Sea Tyrrhenian Sea Campania Mediterranean Sea Gulf of Policastro Basilicata, Calabria Mediterranean Sea Gulf of Taranto Apulia Mediterranean Sea Strait of Otranto Passing just north of Sarandë and just south of Gjirokastër Mediterranean Sea Aegean Sea Kassandra and Sithonia Mediterranean Sea Aegean Sea Island of Lemnos Mediterranean Sea Aegean Sea Passing just north of Ankara Passing through Verin Artashat and Norashen, Ararat Passing through Nagorno- Karabakh Caspian Sea For about 9 km Sokh exclave - for about 7 km Shohimardon exclave - for about 4 km Xinjiang Gansu Inner Mongolia Shanxi Hebei Beijing (passing just north of the city centre) Hebei Tianjin Hebei Liaoning (for about 8 km) Pacific Ocean Liaodong Bay, Yellow Sea Liaoning (Liaodong Peninsula) North Pyeongan Province - Passing through Sinuiju Jagang Province South Hamgyeong Province - Passing just north of Hamheung Pacific Ocean Sea of Japan Mayang Island Pacific Ocean Sea of Japan Island of Honshū — Akita Prefecture — Iwate Prefecture Pacific Ocean California - passing though Cooks Valley Nevada Utah Colorado Nebraska / Kansas border Missouri Illinois Indiana Ohio - passing just north of Columbus West Virginia Pennsylvania - passing through Philadelphia New Jersey Atlantic Ocean Passing just north of Corvo Island, Azores, Passing near Pombal and Covilhã Extremadura Castile-La Mancha Community of Madrid - for about 10 km Castile-La Mancha Valencian Community - Rincón de Ademuz exclave, for about 4 km Castile-La Mancha - for about 5 km Aragon Valencian Community ==United States== The parallel 40° north forms the boundary between the states of Kansas and Nebraska. On 30 May 1854, the Kansas–Nebraska Act created the Territory of Kansas and the Territory of Nebraska divided by the parallel 40° north. ==References== n40",
 "title": "40th parallel north"
}