{
 "id": "715009",
 "text": "Rachel Leah Bloom (born April 3, 1987) is an American comedian, writer, actress and singer-songwriter. She played the lead role of Rebecca Bunch in the CW comedy-drama series Crazy Ex-Girlfriend. For this, she won a Golden Globe Award for Best Actress-Television Series Musical or Comedy. For that same act, she also won a Critics' Choice Television Award for Best Actress in a Comedy Series. In May 2013, Bloom released her first musical comedy album Please Love Me. Bloom was born in Los Angeles. == Awards and nominations == Year Ceremony Category Nominated work Result Ref 2011 Hugo Awards Best Dramatic Presentation Fuck Me, Ray Bradbury 2013 Web Awards Best YouTube Song You Can Touch My Boobies 2015 67th Primetime Emmy Awards Short-format Animation Robot Chicken 2016 Golden Globe Awards Best Actress – Television Series Musical or Comedy Crazy Ex-Girlfriend 2016 Gold Derby Awards Best Comedy Actress Crazy Ex-Girlfriend 2016 Gold Derby Awards Breakthrough Performer of the Year Crazy Ex-Girlfriend 2016 Television Critics Association Individual Achievement in Comedy Crazy Ex-Girlfriend 2016 Online Film and Television Awards Best Actress in a Comedy Series Crazy Ex-Girlfriend 2016 EWwy Awards Best Actress, Comedy Crazy Ex-Girlfriend 2016 68th Primetime Emmy Awards Outstanding Original Music and Lyrics Crazy Ex-Girlfriend 2016 68th Primetime Emmy Awards Outstanding Main Title Theme Music Crazy Ex-Girlfriend 2016 Gotham Awards Breakthrough Series – Long Form Crazy Ex-Girlfriend 2016 Critics' Choice Television Awards Best Actress in a Comedy Series Crazy Ex- Girlfriend 2017 Golden Globe Awards Best Actress – Television Series Musical or Comedy Crazy Ex-Girlfriend 2017 69th Primetime Emmy Awards Outstanding Original Music and Lyrics Crazy Ex-Girlfriend 2018 Television Critics Association Individual Achievement in Comedy Crazy Ex-Girlfriend 2019 71st Primetime Emmy Awards Outstanding Original Music and Lyrics Crazy Ex- Girlfriend 2019 Outstanding Main Title Theme Music Crazy Ex-Girlfriend == References == == Other websites == * Category:Comedians from Los Angeles County, California Category:American television actors Category:American movie actors Category:Actors from Los Angeles Category:1987 births Category:Living people",
 "title": "Rachel Bloom"
}