{
 "id": "715094",
 "text": "Ashley Nicolette Frangipane ( ; born September 29, 1994), known by her professional name Halsey ( ), is an American singer. == Early life == Ashley Nicolette Frangipane was born in Edison, New Jersey. Her mother is of Italian and Hungarian descent, while her father is mostly African American with some distant Irish ancestry. She has two younger brothers. == Career == Halsey was signed by Astralwerks in 2014. She released her first EP, Room 93, later that year. In 2015, she released her album Badlands, which went to number two on the Billboard 200 chart. She released Hopeless Fountain Kingdom in 2017, which reached number one. Halsey was featured on the Chainsmokers' 2016 single \"Closer\", which entered at the top of the charts in several countries worldwide. She released \"Without Me\" in October 2018 as the lead single from her studio album, Manic (2020). \"Without Me\" became her second US number one hit after \"Closer\". Manic went to number two in the US. In December 2020, she revealed the use of she/they pronouns in her Instagram bio. She released a makeup line, About-Face, in January 2021. After 10 years experience in UMG, she departed the music business group and signed with Sony Music's Columbia Records on June 14, 2023. == Artistry == Halsey is a soprano with three-octave vocal range. Her voice is often described as “smoky” or “husky.” This is typically a quality found in lower-pitched voices. Additionally, her vocal range spans from about F3 to C5. However, this worth noting that her voice has a lot of versatility. She is able to sing both lower and higher pitched notes with relative ease. == Personal life == Halsey is bisexual. She has a son, Ender Ridley Aydin (born July 14, 2021) with her former boyfriend Alev Aydin, a Turkish-American filmmaker. The two separated at some point. Halsey requested custody of their son so she could take him on tour but also wanted Aydin to have joint custody and visitation. She was previously dated rapper G-Eazy in 2017 to 2018. She is currently dating Canadian actor Avan Jogia. == Discography == * Badlands (2015) * Hopeless Fountain Kingdom (2017) * Manic (2020) * If I Can't Have Love, I Want Power (2021) * The Great Impersonator (2024) == Filmography == ===Music videos=== Year Song title Role Notes 2017 \"Now or Never\" Co-director Co-directed with Sing J Lee 2017 \"Bad at Love\" Co- director Co-directed with Sing J Lee 2018 \"Sorry\" Co-director Co-directed with Sing J Lee 2018 \"Alone\" (featuring Big Sean and Stefflon Don) Co-director Co- directed with Hannah Lux Davis 2018 \"Strangers\" (featuring Lauren Jauregui) Co-director Co-directed with Jessie Hill 2018 \"I Found You\" (Benny Blanco) Herself Cameo appearance ===Film=== Year Title Role Notes 2018 Teen Titans Go! To the Movies Wonder Woman Voice A Star Is Born Herself Cameo 2021 If I Can't Have Love, I Want Power Queen Lila / Lilith Companion hour-long film to the album of the same name Sing 2 Porsha Crystal Voice 2023 Americana Mandy Starr 2024 MaXXXine Tabby Martin ===Television=== Year Title Role Notes 2016 Roadies Herself Episodes: \"The Load Out\" and \"Carpet Season\" 2017 American Dad! Cindy Voice, episode: \"A Nice Night for a Drive\" 2018–2021 Saturday Night Live Herself (musical performer/host) 5 episodes 2018 RuPaul's Drag Race Herself/guest judge Episode: \"PharmaRusical\" 2018 The Doctors Celebrity guest Episode: \"#10126\" 2018 The Voice Guest performer/Guest advisor Season 14: Guest performer Season 15: Guest advisor for Team Jennifer, guest performer 2020 Scooby-Doo and Guess Who? Herself Voice, episode: \"The New York Underground!\" The Disney Family Singalong: Volume II Performer Television special ===Web=== Year Title Role Notes 2019–2020 Road to Manic Herself Web series; 10 episodes == Tours & Live Performances == Headlining * Badlands Tour (2015–2016) * Hopeless Fountain Kingdom World Tour (2017–2018) * Manic World Tour (2020) * Love and Power Tour (2022) Co-headlining * The American Youth Tour (2015) (with Young Rising Sons) Opening act * Imagine Dragons Smoke + Mirrors Tour (2015) * The Weeknd The Madness Fall Tour (2015) Promotional/Live Performances: Date Event Performed song(s) 2015 Vevo Lift Hold me Down, New Americana, BADLANDS & Ghost 2016 Roman Holiday & Is There Somewhere MTV Video Music Awards Closer Nobel Peace Prize Concert Castle & Colors Outside Lands Festival Gasoline, Hold Me Down, Castle, Haunting, The Feeling (cover), Roman Holiday, Drive, Ghost, Is There Somewhere, Hurricane, Coming Down, New Americana, Colors pt. II, Colors Sweetlife Festival Gasoline, Hold Me Down, Castle, Haunting, Roman Holiday, Control, Drive, Ghost, Is There Somewhere, Colors pt II, Colors, Hurricane, New Americana, Young God 2017 Vevo Presents Now or Never, Heaven In Hiding, We Could Talk, Lie, Strangers, Eyes Closed & 100 Letters The Tonight Show with Jimmy Fallon Now Or Never IHeart Radio Summer 2017 Bad at Love Good Morning America Him & I Dick Clark's New Year's Rockin’ Eve 2018 Saturday Night Live Bad At Love Victoria Secret Fashion Show Without Me Saturday Night Live Him & I & Bad at Love American Music Awards Eastside 2019 Saturday Night Live Without Me & Eastside Dick Clark's New Year's Rockin’ Eve Without Me The Voice Nightmare Billboard Music Awards Boy With Luv, Without Me Capital Summertime Ball Eastside, Nightmare, Closer, Without Me 2020 The Ellen Show Graveyard MTV Europe Music Awards American Music Awards ARIA Awards Saturday Night Live You should be sad &Finally; // beautiful stranger 2021 I am not a woman, I'm a god & Darling 2022 Hangout Festival Nightmare, Castle, Easier Than Lying, You should be sad, 1121, Die for Me, Graveyard, Colors, Hurricane, The Lighthouse, Be Kind (stripped), Honey, 3am, Bad at Love, Gasoline, Nightmare (reprise), Without Me 2024 IHeart Radio Music Festival Nightmare, You should be sad, Closer, Without Me & Ego MTV Video Music Awards Ego Flow Festival Life of the Spider, Nightmare, Castle, Easier Than Lying, You should be sad, Graveyard, Lucky, Hurricane, The Lighthouse, Honey, Bad at Love, 3am, Closer (Rock Version), Lonely is the Muse (Snippet), Gasoline, Experiment on me, I am not a woman but a god, Without Me Vevo Live Panic Attack == Awards and nominations == Award Year Recipient(s) and nominee(s) Category Result American Music Awards 2017 \"Closer\" Favorite Pop/Rock Song Collaboration of the Year 2019 Herself Artist of the Year \"Without Me\" Best Music Video Favorite Pop/Rock Song Billboard Music Awards 2017 \"Closer\" Top Hot 100 Song Top Selling Song Top Radio Song Top Streaming Song (Audio) Top Streaming Song (Video) Top Collaboration Top Dance/Electronic Song 2018 Herself Top Radio Songs Artist Top Female Artist 2019 \"Without Me\" Top Selling Song Billboard Women in Music 2016 Herself Rising Star BMI Pop Awards 2017 \"Closer\" Award Winning Songs 2018 \"Now or Never\" 2019 \"Bad at Love\" \"Him & I\" 2020 \"Eastside\" \"Without Me\" Song of the Year 2021 Herself Songwriter of the Year \"Be Kind\" Award Winning Songs \"Graveyard\" \"Nightmare\" \"You Should Be Sad\" CMT Music Awards 2020 \"Graveyard\" CMT Performance of the Year 2021 \"The Other Girl\" Gaon Chart Music Awards 2020 \"Boy with Luv\" Song of the Year April GLAAD Media Awards 2018 Herself Outstanding Music Artist 2021 Global Awards 2019 Herself Rising Star Award Best Female Social Media Superstar \"Eastside\" Best Song Grammy Awards 2017 Purpose Album of the Year \"Closer\" Best Pop Duo/Group Performance 2022 If I Can't Have Love, I Want Power Best Alternative Music Album iHeartRadio Music Awards 2017 \"Closer\" Song of the Year Dance Song of the Year Best Collaboration Best Lyrics 2018 Herself Female Artist of the Year 2019 Fangirls Award \"Without Me\" Best Lyrics \"Lucid Dreams\" Best Cover Song 2020 Herself Female Artist of the Year \"Boy with Luv\" Best Music Video Best Lyrics \"Nightmare\" \"Without Me\" Best Remix iHeartRadio MMVAs 2018 \"Bad at Love\" Video of the Year Herself Best Pop Artist or Group Fan Fave Artist iHeartRadio Titanium Award 2018 \"Bad at Love\" 1 Billion Total Audience Spins on iHeartRadio Stations \"Him & I\" 2019 \"Without Me\" 1 Billion Total Audience Spins on iHeartRadio Stations \"Eastside\" (with Benny Blanco & Khalid) Meus Prêmios Nick 2019 \"Boy with Luv\" Favorite International Hit MTV Europe Music Awards 2015 Herself Artist on the Rise 2016 Best Push Act 2019 Best Pop Best Look \"Boy with Luv\" Best Collaboration 2021 Herself Best Alternative MTV Italian Music Awards 2017 \"Closer\" Best Video MTV Millennial Awards 2019 \"Without Me\" Global Hit MTV Millennial Awards Brazil 2019 MTV Video Music Awards 2016 \"Closer\" Song of Summer 2017 Best Collaboration Best Editing \"Now or Never\" Best Cinematography 2019 Herself Artist of the Year \"Boy with Luv\" Best Collaboration Best K-Pop Best Art Direction Best Choreography \"Nightmare\" Video for Good Best Power Anthem 2020 \"You Should Be Sad\" Best Pop \"Graveyard\" Best Editing 2021 \"Be Kind\" Best Choreography Myx Music Awards 2017 \"Closer\" Favorite International Video 2020 \"Boy with Luv\" Nickelodeon Kids' Choice Awards 2021 \"Be Kind\" Favorite Music Collaboration 2023 \"Stay with Me\" NME Awards 2016 Herself Best New Artist 2020 \"Boy with Luv\" Best Collaboration 2022 Herself Innovation Award If I Can't Have Love, I Want Power Best Album in the World Best Music Film People's Choice Awards 2016 Herself Favorite Breakout Artist 2019 \"Boy with Luv\" Music Video of 2019 2020 \"Be Kind\" Collaboration Song of the Year Radio Disney Music Awards 2017 \"Closer\" Song of the Year Best Song To Lyp Sync To 2018 Herself Breakout Artist of the Year RTHK International Pop Poll Awards 2017 \"Closer\" Top Ten International Gold Songs 2020 \"Boy with Luv\" Songwriters Hall of Fame 2019 Herself Hal David Starlight Award Teen Choice Awards 2017 \"Closer\" Choice Pop Song Herself Choice Breakout Artist Choice Summer Female Artist 2018 \"Bad at Love\" Choice Song: Female Artist 2019 \"Nightmare\" \"Boy with Luv\" Choice Collaboration Herself Choice Female Artist Choice Summer Female Artist Telehit Awards 2019 \"Boy with Luv\" People's Best Video ==Notes== ==References== == Other websites == * * Category:1994 births Category:Living people Category:21st-century American singer-songwriters Category:Activists from New Jersey Category:African-American singers Category:American feminists Category:American record producers Category:American singer-songwriters Category:American pop singers Category:American movie actors Category:American television actors Category:American voice actors Category:Bisexual people Category:Hungarian singers Category:Italian singer-songwriters Category:21st-century Italian singers Category:21st-century Italian songwriters Category:Irish singer- songwriters Category:LGBT African-Americans Category:LGBT people from New Jersey Category:LGBT singers Category:People with bipolar disorder Category:Singers from New Jersey",
 "title": "Halsey (singer)"
}