{
 "id": "71515",
 "text": "Daniel Louis Castellaneta (born October 29, 1957) is an Emmy award-winning American actor, voice actor, comedian and screenwriter best known for providing the voice of Homer Simpson and other characters on the long-running FOX animated series The Simpsons. As well as being a voice actor for The Simpsons, Dan Castellaneta has also written a few episodes of The Simpsons along with his wife, Deb Lacusta. == Full list of Simpsons Characters Voiced By Dan Castellaneta == * Homer Simpson * Abraham Simpson * Krusty The Clown * Barney Gumble * Groundskeeper Willie * Mayor Quimby * Hans Moleman * Sideshow Mel * Itchy * Kodos * Gil Gunderson * Squeaky Voiced Teen * Blue-Haired Lawyer * Rich Texan * Louie * Bill * Arnie Pie * Mr. Teeny * Yes Guy * Scott Christian * Assistant Superintendent Leopold * Rabbi Krustofski * Charlie * Gary * Santa's Little Helper * Frankie the Squealer ==Filmography== ===Film=== Year Film Role Notes 1986 Nothing in Common Brian 1989 Say Anything... Diane's teacher Uncredited 1989 K-9 Maitre D' 1989 The War of the Roses Gavin's client 1991 Don't Tell Mom the Babysitter's Dead Animated Mrs. Sturak 1993 Super Mario Bros. Narrator Credited as \"Dan Castellenetta\" 1994 The Client Slick Moeller 1994 The Return of Jafar Genie 1994 Love Affair Phil 1994 The Land Before Time II Ozzy 1995 Forget Paris Man test-driving car Uncredited 1996 All Dogs Go to Heaven 2 Tall customs dog 1996 Space Jam Male fan 1998 Plump Fiction Bumpkin 1998 Aladdin's Arabian Adventures Genie Vols. 1-4: Team Genie, Creatures of Invention, Magic Makers, Fearless Friends; direct-to-video release 1998 My Giant Partlow 1999 The Settlement Neal 2000 Joseph: King of Dreams Auctioneer Horse Trader Direct-to-video release 2000 Rugrats in Paris: The Movie Priest 2001 Recess: School's Out Guard #1 2002 Harold Buttleman, Daredevil Stuntman Human Canonball 2002 Return to Never Land Additional voices 2002 Hey Arnold!: The Movie Grandpa Phil Nick Vermicelli 2003 Kim Possible: The Secret Files Drakken's Goons Direct-to- DVD release 2003 The Cat in the Hat Voice of Thing One and Two 2003 Recess: Taking the Fifth Grade BoE Agent #2 Direct-to-video release 2004 Adventures in Homeschooling Gus Hemple Short film 2006 I-See-You.Com Jim Orr 2006 I Want Someone to Eat Cheese With Dick 2006 Scooby-Doo! Pirates Ahoy! Mr. Mysterio Woodenleg Wally Direct-to-DVD release 2006 The Pursuit of Happyness Alan Frakesh 2007 Hellboy Animated: Iron Shoes Iron Shoes Short film on DVD of Hellboy: Blood and Iron 2007 Chasing Robert Dan the Bookie 2007 The Simpsons Movie Homer Simpson Various characters 2008 Superhero Movie Carlson 2008 Futurama: The Beast with a Billion Backs The Robot Devil Direct-to-DVD release 2008 Immigrants (L.A. Dolce Vita) Mr. Csapo Dub of Hungarian film 2008 Remembering Phil Dr. Seymour 2008 Horton Hears a Who! The Wickersham Brothers 2011 Super 8 Izzy 2011 Scratching the Surface Mr. Edelman 2014 Humphrey Humphrey (voice) 2015 Fantastic Four Mr. Kenny ===Television=== Year Series Role Notes 1987–1990 The Tracey Ullman Show Various characters 1989–present The Simpsons Homer Simpson, Abe Simpson, Krusty the Clown, Barney Gumble, Various characters Has also written four episodes Won four Primetime Emmy Awards 1990 ALF Steve Michaels Episode 4.21: \"Stayin' Alive\" 1990 TaleSpin Dr. Zibaldo Episode 63: \"The Incredible Shrinking Molly\" 1990 Bagdad Café Gilbert Episode 2.6: \"Rainy Days and Mondays\" 1990 Working Tra$h George Agrande 1990 42nd Primetime Emmy Awards Homer Simpson TV special 1990, 1992 Married... with Children Pete Funeral Director Episode 5.5: \"Dance Show\" Episode 7.9: \"Death of a Shoe Salesman\" 1991 Dream On Phil Episode 2.3: \"The 37-Year Itch\" 1991 Taz-Mania Mister Thickley Recurring role 1991 Sibs Warren Morris Recurring role 1991 Sesame Street Homer Simpson Voice; guest star (Celebrity Monster in the Mirror) 1991–1992 Darkwing Duck Megavolt/Elmo Sputterspark Appeared in 12 episodes 1991–1992 Back to the Future: The Animated Series Dr. Emmett Brown Appeared in all 26 episodes 1992 Lady Against the Odds Len Chisholm television film 1992 Fievel's American Tails Chula the Tarantula Appeared in nine episodes 1992 L.A. Law David Champion Episode 7.1: \"L.A. Lawless\" 1992 Dinosaurs Zabar Episode 3.6: \"Germ Warfare\" 1992 Tiny Toon Adventures Jeffries Harvey Episode 3.13: \"Grandma's Dead\" Episode 3.20: \"It's a Wonderful Tiny Toon Christmas Special\" 1992 Goof Troop Coach Roach, Talent Scout, Game Announcer Episode 1.64: \"To Catch A Goof\" 1992–1997 Eek! The Cat Mittens Bill Appeared in 11 episodes 1993 Animaniacs Dracula episode 29 Draculee Draculaa/Franken Runt 1993 The Pink Panther Voodoo Man Additional voices Recurring roles 1993 Tracey Ullman Takes On New York Gordon HBO one-off special 1993 Sonic the Hedgehog Lazaar Episode 1.5: \"Super Sonic\"; uncredited 1993 Marsupilami Stewart Episodes 1.7 and 1.11 1994 The Critic Homer Simpson Episode 1.3: \"Dial 'M' for Mother\" 1994 Wings George Wexler Episode 5.18: \"Moonlighting\" 1994 The George Carlin Show Passenger Episode 1.7: \"George Gets Some Money\" 1994 Related by Birth Warren Morris 1994 Bakersfield P.D. Darian Ferguson Episode 1.17: \"Last One Into the Water\" 1994 Grace Under Fire Mr. Rudder Episode 2.5: \"Jimmy's Girl\" 1994 The Tick Mole King Episode 1.11: \"The Tick vs. the Mole-Men\" 1994–1995 Aladdin Genie Frajhid the Ice Efreet Appeared in all 86 episodes Episode 27: \"Of Ice and Men\" 1995 Murphy Brown Tony Lucchesi Episode 7.17: \"Specific Overtures\" 1995 The Computer Wore Tennis Shoes Alan Winsdale 1995–1996 Earthworm Jim Earthworm Jim Evil Jim Appeared in all 23 episodes 1996-2003 Dexter's Laboratory Additional characters 1996 The Spooktacular New Adventures of Casper Additional voices 1996 Friends Zoo Janitor Episode 2.12: \"The One After the Super Bowl: Part 1\" 1996 NYPD Blue Gus Episode 3.15: \"Head Case\" 1996 Quack Pack Gil (voice) Episode 1.13: \"Koi Story\" 1996–2004 Hey Arnold! Grandpa Phil 1997 Cybill DaVolio Episode 3.17: \"Kiss Me, You Fool\" 1997 The Drew Carey Show Stan Episode 2.20: \"Two Drews and the Queen of Poland\" 1997 Nightmare Ned Number 1 Episode \"Alien Abduction\" 1997 The Online Adventures of Ozzie the Elf Comet & Blitzen 1997–1999 Cow and Chicken Earl and various characters 1998 Rhapsody in Bloom Chelton Television film 1998 Hercules: The Animated Series Homer the reporter Episodes 1.18: \"Hercules and the Comedy of Arrows\" and 1.26: \"Hercules and the Trojan War\" 1998–2001 Histeria! Additional voices Recurring role 1998–2001 Everybody Loves Raymond Bryan Episodes 2.20: \"T-Ball\" and 6.8: \"It's Supposed to Be Fun\" 1998–2003 Rugrats Jonathan Recurring role 1999 Mad About You Rory O'Grady Episode 7.10: \"Win a Free Car\" 1999 Detention Additional voices Recurring role 1999 Johnny Bravo Harvey Episode 2.11: \"A League of His Own/Johnny Goes to Camp/Buffoon Lagoon\" 1999 Oh, Grow Up Sven Jorgensen Episode 1.7: \"Hunter's Metamorphosis\" 1999 Nash Bridges Eddie Day Episode 5.9: \"Crosstalk\" 1999 Olive, the Other Reindeer The Postman TV special 1999–2013 Futurama Robot Devil Episodes \"Hell is Other Robots\", \"The Devil's Hands Are Idle Playthings\", \"Ghost in the Machines\", \"The Six Million Dollar Mon\", and \"Calculon 2.0\". 2000 Buzz Lightyear of Star Command Various characters Appeared in eight episodes 2000, 2001 Batman Beyond Mr. Brooks Guard Kobra Commado Episode 2.13: \"Terry's Friend Dates a Robot\" Episode 3.10: \"The Curse of the Kobra: Part 1\" Episode 3.11: \"The Curse of the Kobra: Part 2\" 2000-2003 Poochini's Yard Various characters Recurring role 2001 The New Woody Woodpecker Show Additional voice Episode \"Ya Gonna Eat That?/Chilly & Hungry/Brother Cockroach\" 2001-2004 Lloyd in Space Dunkirque/Mr. Blobberts/Driver/Rodeo Clown Lloyd/Repairman/Park Ranger/Plumber/Delivery Man/Harvulian Melblatznak/Intrepidville Personnel/Joe/Doctor/Blobullon/Additional Voices Recurring role 2001 Yes, Dear Walt Episode 1.12: \"Where There's a Will, There's a Waiver\" 2001 Laughter on the 23rd Floor Milt Fields Television film 2001 Disney's House of Mouse Genie Episode 1.2: \"Big Bad Wolf Daddy\" 2002 Jackie Chan Adventures Jumba Episode 2.23: \"Into the Mouth of Evil\" 2002 Kim Possible Various characters Appeared in three episodes 2002–2003 Reba Eugene Fisher Episodes 2.7: \"Mommy Nearest\" and 2.17: \"The Feud\" 2003 The Pitts Morty Episode 1.4: \"Dummy and Dummier\" 2003 All Grown Up! Jonathan 2003 The Adventures of Jimmy Neutron: Boy Genius Professor Crank Hulk Jimmy Episode 2.5: \"Operation: Rescue Jet Fusion\" Episode 3.10 \"The N-Men\" 2003 The Shnookums and Meat Funny Cartoon Show Kung- fu Trainer Episode 1.1: \"Kung-fu Kitty\" 2003 Justice League Minister Episodes 2.7 and 2.8: \"Maid of Honor\" Parts 1 and 2 2003 Duck Dodgers Martian sage Football player #3 Episode 1.10: \"Quarterback Quack/To Love a Duck\" 2003 Frasier Brad Episode 11.7: \"Maris Returns\" 2003 That '70s Show Agent Armstrong Episode 6.5: \"I'm Free\" 2004 Party Wagon Wild Bill Hickok Clerk Cheyenne #2 Television film 2004 Behind the Camera: The Unauthorized Story of 'Charlie's Angels' Aaron Spelling Television film 2004 The Jimmy Timmy Power Hour Goddard's evil robot voice Television film 2004 Foster's Home For Imaginary Friends Additional voices Recurring role 2004 As Told by Ginger Dave Bishop Jeweler Episode 3.3: \"About Face\" 2004 Complete Savages Frog Mr. Horner Episode 1.6: \"Free Lily\" 2004–2008 The Batman Arnold Wesker/Scarface Appeared in three episodes 2005 Stargate SG-1 Joe Spencer Episode 8.15: \"Citizen Joe\" 2005 What's New, Scooby-Doo? Officer McBride Episode: \"A Scooby-Doo Valentine\" 2005 Arrested Development Dr. Stein Episode 2.15: \"The Sword of Destiny\" 2005 Firehouse Tales Stinky TV series 2005 Loonatics Unleashed College Professor Episode 1.6: \"The Comet Cometh\" 2006 The Jeff Garlin Program Ted 2006 Veronica Mars Dr. Kinny Episode 3.2: \"My Big Fat Greek Rush Week\" 2006 Casper's Scare School Stretch Television film 2006 Legion of Super Heroes Boris Captain Howdy Coluans Episode 1.4: \"Fear Factory\" 2006–2007 Campus Ladies Dean Dewey Episodes 1.7: \"Safety Bathroom\" and 2.7: \"Safety First\" 2007 Sands of Oblivion Cecil B. DeMille Television film 2007 Entourage Andrew Preston Episodes 4.2: \"The First Cut Is the Deepest\" and 4.7: \"The Day Fuckers\" 2007–2011 Greek Dr. Milton Hastings Appeared in nine episodes 2008 Monk Tiny Werner Episode 6.12: \"Mr Monk Goes to the Bank\" 2008 Reno 911! Commissioner Jerry Salerno Episode 5.11: \"Junior Runs for Office\" 2008 Relative Stranger Gary Television film 2009 Castle Judge Markway Episode 1.1: \"Pilot\" and 1.8: \"Ghosts\" 2009 Ghost Whisperer Frank the Ghost Episode 4.12 \"The Joint's Haunted\" 2009 How I Met Your Mother Milt Episode 4.22: \"Right Place Right Time\" 2009 Bones Officer Novarro Episode 5.7: \"The Dwarf in the Dirt\" 2009 Desperate Housewives Jeff Bicks Episode 6.10: \"Boom Crunch\" 2010, 2012 Late Show with David Letterman Homer Simpson Episodes \"17.69\" and \"20.38\" 2010 Tracey Ullman's State of the Union Agent Episode 3.5 2010 The Good Guys Walter Diparko Episode 1.7: \"Hunches & Heists\" 2010 The Simpsons 20th Anniversary Special – In 3-D! On Ice! Himself Homer Simpson TV special 2011 Parks and Recreation Derry Murbles Episodes 4.3: \"Born & Raised\", 5.8: \"Pawnee Commons\" and 6.14 \"Anniversaries\" 2012 FOX 25th Anniversary Special Homer Simpson TV special 2012 The Office CEO of Prestige Direct Sale Solutions Episode 8.23: \"Turf War\" 2012, 2014 Family Guy Homer Simpson Episode 11.2: \"Ratings Guy\" and Episode 13.1: \"The Simpsons Guy\" 2013 Major Crimes Ray Winters Episode 27: \"Year-End Blowout\" 2013 Dads British Narrator Episode 1: \"Pilot\" 2013 The Mindy Project Marty Episode 18: \"Danny's Friend\" 2013 Wendell & Vinnie Mr. Lipshitz Episode 1: \"Pilot\" 2014 Last Week Tonight with John Oliver Homer Simpson Episode 1.24: \"Episode 24\" 2014 The League Dr. Harvat Episode 67: \"Taco Standard Time\" 2014 Quick Draw Deacon Jim Episode 10: \"Deacon Jim\" 2014 Hot in Cleveland Dr. McNally Episode 99: \"Straight Outta Cleveland\" ===Music videos=== Year Song Role Artist 1990 \"Do the Bartman\" Homer Simpson Nancy Cartwright ===Video games=== * The Simpsons (1991) - Homer Simpson * The Simpsons Cartoon Studio (1996) - Various characters * Toonstruck (1996) - Flux Wildly * Virtual Springfield (1997) - Various characters * Herc's Adventures (1997) - Hercules * ClayFighter 63 1/3 (1997) - Earthworm Jim, Boogerman * Driver (1998) - Answering machine callers * Planescape: Torment (1999) - Nordom * Y2K: The Game (1999) - Additional voices * Earthworm Jim 3D (1999) - Earthworm Jim * The Simpsons Bowling (1999) - Various characters * Aladdin in Nasira's Revenge (2001) - Genie * The Simpsons Wrestling (2001) - Various characters * The Simpsons: Road Rage (2001) - Various characters * Kingdom Hearts (2002) - Genie * The Simpsons Skateboarding (2002) - Various characters * The Simpsons: Hit & Run (2003) - Various characters * Metal Arms: Glitch in the System (2003) - Krunk * Kingdom Hearts II (2005) - Genie * Cartoon Network Racing (2006) - Earl * Happy Feet (2006) - Ramon, Elephant seal #1 * The Simpsons Game (2007) - Various characters * Kingdom Hearts Re:Chain of Memories (2008) - (archived voice acting) * BioShock (2007) - Toasty splicer * Bioshock 2 (2010) - Toasty splicer * The Simpsons: Tapped Out (2012) - Various characters * Kingdom Hearts HD 1.5 Remix (2013) - Genie * Kingdom Hearts HD 2.5 Remix (2014) - Genie (Kingdom Hearts II Final Mix) * Lego Dimensions (2015) - Homer Simpson, Krusty the Clown (archived voice acting) * Kingdom Hearts III (2019) - Genie ===Theater=== * American Splendor - Harvey Pekar ===Theme park=== * The Simpsons Ride (2008) - Homer Simpson, Various characters ==References== Category:American movie actors Category:Comedians from Chicago Category:American television actors Category:American voice actors Category:Actors from Chicago Category:1957 births Category:Living people Category:Emmy Award winning actors",
 "title": "Dan Castellaneta"
}