{
 "id": "715127",
 "text": "Marsha P. Johnson (August 24, 1945 – July 6, 1992) was an American gay and transgender rights activist. They are best known for participating in the Stonewall riots in 1969. A founding member of the Gay Liberation Front, Johnson co-founded the advocacy group S.T.A.R. (Street Transvestite Action Revolutionaries), alongside their friend Sylvia Rivera. From 1987 through 1992, Johnson was an AIDS activist with ACT UP. == Early life == Johnson was born in Elizabeth, New Jersey on August 24, 1945. They were one of seven children. Their father, Malcolm Michaels Sr, worked for General Motors. Their mother, Alberta Claiborne, was a housekeeper. Johnson attended an African Methodist Episcopal Church as a child. Johnson was very religious. They were very interested in Catholicism, and kept a private altar at home. Johnson began wearing dresses at the age of five but stopped due to bullying from boys in their neighborhood. Johnson did not come to terms with being gay until the age of 17. Their mother was reportedly very homophobic, but Johnson has said that their mother was unaware of the LGBT community. After graduating from high school, Johnson moved to Greenwich Village, New York on their own. They supported themself by waiting tables. After meeting other gay people in the city, Johnson gained the confidence to come out themself. == Working as a performer == Johnson began working as a drag queen after coming out as gay. They chose the drag name \"Marsha P. Johnson\". Johnson comes from the restaurant Howard Johnson's. They said that the \"P\" stood for \"pay it no mind,\" a phrase they would use when people asked their gender. Johnson referred to themself as gay, a transvestite, and a drag queen interchangeably and preferred \"they,\" rather than \"she,\" to be used as a pronoun. Although they never referred to themself as being transgender, many modern scholars believe that was only because the term still was rarely used during their lifetime. Johnson said that their style of drag was not serious because they could not afford expensive clothes. They made flower crowns out of leftover flowers from the Flower District of Manhattan, which they began well known for wearing. Johnson was tall, thin and wore long flowing clothes, red high heels and bright wigs. This tended to draw a lot of attention. Their style was often described as being masculine and feminine at the same time. In 1972, Johnson became a member of the New York-based drag performance troupe Hot Peaches. Johnson also performed with the troupe The Angels of Light. In 1975, Johnson was photographed by famous artist Andy Warhol, as part of a series called \"Ladies and Gentlemen\". == Stonewall riots and activism == The Stonewall riots were a series of riots in New York City in 1969. They happened after the police raided the Stonewall Inn, a gay bar in Greenwich Village. Johnson is often said to have been one of the first people to begin rioting against the police, some going as far to say they \"threw the first brick at Stonewall\". Johnson denied this, but they did become heavily involved in gay rights activism after the police raid. After the Stonewall uprising, Johnson joined the Gay Liberation Front, which worked to fight against homophobia. They participated in a rally on the first anniversary of the Stonewall riots in 1970. Also in 1970, Johnson and their fellow GLF members staged a sit-in protest at New York University after the university staff canceled a dance when they learned it was sponsored by gay organizations. Johnson and their close friend Sylvia Rivera co-founded the Street Transvestite Action Revolutionaries (STAR) organization. STAR advocated for transgender rights and also provided shelter for gay and transgender youth in the \"STAR House\", which also provided shelter for sex workers. Johnson worked to provide food, clothing, emotional support and a sense of family for homeless gay and transgender youth. The two were banned from participating in the gay pride parade in 1973 when the staff running the event stated they were not going to allow drag queens at marches because they were \"giving them a bad name\". Their response was to march defiantly ahead of the parade. They believed it was their right to participate in pride alongside other members of the LGBT community. == Mental health and death == When they first came to New York City, Johnson became a sex worker to make money. They were arrested many times due to laws against prostitution. Johnson spoke of first having a mental breakdown in 1970. They would purposefully get themself arrested so that they would be given antipsychotic medication. Though remembered by most as a kind and generous person, they were known to have occasional bouts of anger and aggression. It is believed that they may have suffered from a mental illness which caused mood swings. Johnson was found dead shortly after the 1992 pride parade. Their body was discovered floating in the Hudson River. According to their friend, Randy Wicker, a witness saw Johnson fighting a man who later bragged about killing a drag queen named \"Marsha\". No arrests were made following this. Many locals believed that the law enforcement was unwilling to investigate Johnson's death because of their status as a drag queen and a sex worker. Johnson was cremated and their ashes were released over the Hudson River by her friends following a funeral at the local church. In November 2012, activist Mariah Lopez was able to get the New York police department to reopen the case as a possible homicide. == Tributes and legacy == Johnson is remembered by many as an important figure in the fight for gay liberation. The 2012 documentary Pay It No Mind – The Life and Times of Marsha P. Johnson features segments from a 1992 interview with Johnson, which was filmed shortly before their death. Many of their friends from Greenwich Village are interviewed for the documentary. In 2018 the New York Times published a belated obituary for them. On May 30, 2019, it was announced that Johnson and Sylvia Rivera would be honored with monuments at Greenwich Village, near the site of the Stonewall club. In June 2019, Johnson was one of fifty American “pioneers, trailblazers, and heroes” inducted on the National LGBTQ Wall of Honor within the Stonewall National Monument (SNM) in New York City’s Stonewall Inn. category:1945 births category:1992 deaths Category:LGBT African-Americans Category:American civil rights activists Category:American LGBT rights activists",
 "title": "Marsha P. Johnson"
}