{
 "id": "715579",
 "text": "The following is a list of deaths that should be noted in October 2019. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==October== ===1=== * Joseph Bismuth, 92, Tunisian businessman and politician, member of the Chamber of Advisors (since 2005). * Cain Hope Felder, 76, American theologian and writer.Noted Biblical Scholar and Pastor Cain Hope Felder Passes Away at 76 * Karel Gott, 80, Czech pop singer (\"Tausend Fenster\"), Eurovision contestant (1968), acute myeloid leukemia.Zemřel Karel Gott. Legendě české pop music bylo 80 let * Miguel León-Portilla, 93, Mexican anthropologist and historian.Miguel León-Portilla murió a los 93 años * C. K. Menon, 70, Indian businessman and philanthropist, Padma Shri recipient (2009).C. K. Menon, Doha industrialist and philanthropist, dies aged 70 * Eric Pleskow, 95, Austrian-born American movie producer, President of United Artists (1973–1978), Orion Pictures (1978–1992) and Vienna International Film Festival (since 1998).Hollywoodlegende Eric Pleskow ist tot * Peter Sissons, 77, English journalist and broadcaster (BBC News, ITN, Question Time).Former newsreader Peter Sissons dies * Arto Tchakmaktchian, 86, Egyptian-born Armenian-Canadian sculptor and painter, member of the Royal Canadian Academy of Arts (since 1974).Մահացել է անվանի քանդակագործ Արտո Չաքմաքչյանը ===2=== * Bill Bidwill, 88, American businessman and philanthropist, owner and Chair of the Arizona Cardinals (since 1972).Arizona Cardinals owner Bill Bidwill dies at 88 * Julie Gibson, 106, American actress (Nice Girl?, The Feminine Touch, Lucky Cowboy) and singer.Julie Gibson, Singer in 'The Feminine Touch' and 'Hail the Conquering Hero,' Dies at 106 * Tiny Hill, 92, New Zealand rugby union player (Canterbury, Counties, national team) and selector.Rugby: All Blacks legend Tiny Hill dies at age 92 * Giya Kancheli, 84, Georgian composer (Unusual Exhibition, Don't Grieve, Mimino).Умер Гия Канчели - создатель музыки к \"Мимино\" и \"Кин-дза-дза\" * Jafar Kashani, 75, Iranian footballer (Shahin, Persepolis, national team), heart attack.Iran and Persepolis football great Kashani dies * John Kirby, 79, American lawyer, namesake of Kirby, problems caused by myelodysplastic syndrome.John Kirby * Isaac Promise, 31, Nigerian footballer (Gençlerbirliği, Antalyaspor, national team), Olympic silver medalist (2008), heart attack.Isaac Promise: former Nigerian international dies at 31 * Kim Shattuck, 56, American punk rock singer-songwriter and guitarist (The Muffs, The Pandoras, Pixies), problems caused by ALS.Kim Shattuck, Muffs Founder and Singer, Dead at 56 * Hargovind Laxmishanker Trivedi, 87, Indian nephrologist, Padma Shri recipient (2015), problems caused by Parkinson's disease.Dr HL Trivedi Dies: Veteran Indian Nephrologist and Padma Awardee Passes Away in Ahmedabad; PM Narendra Modi Pays Tribute ===3=== * John Buchanan, 88, Canadian politician, MLA (1967–1990) and Premier of Nova Scotia (1978–1990).Former N.S. premier and senator John Buchanan dies at 88 * Diogo Freitas do Amaral, 78, Portuguese politician, acting Prime Minister of Portugal (1980–1981), President of the United Nations General Assembly (1995–1996), Minister of National Defence (1981–1983) and Foreign Affairs (1980–1981, 2005–2006), 1986 CDS presidential nominee, bone cancer. * Hu Yamei, 96, Chinese physician and medical researcher, member of the Chinese Academy of Engineering (since 1994).中国工程院院士、儿科血液学专家胡亚美病逝，享年95岁 * Stephen J. Lukasik, 88, American physicist, respiratory failure.Stephen Lukasik, Who Pushed Tech in National Defense, Dies at 88 * Ignacio Noguer Carmona, 88, Spanish Roman Catholic prelate, Bishop of Guadix (1976–1990) and Huelva (1993–2006).Bishop Ignacio Noguer Carmona ===4=== * Mikhail Biryukov, 27, Russian tennis player, Youth Olympic silver medalist (2010). * Diahann Carroll, 84, American actress (Julia, Dynasty, White Collar), model and singer, Tony (1962) and Golden Globe winner (1968), cancer.Diahann Carroll Dies: Groundbreaking African-American Actress, Star Of TV’s ‘Julia’ Was 84 * Bill McKnight, 79, Canadian politician, MP (1979–1993).Former Sask. Treaty Commissioner Bill McKnight dies at 79 * Alberto Testa, 96, Italian dancer and choreographer, pneumonia.Morto Alberto Testa, il 'prof' della Danza ===5=== * Andy Etchebarren, 76, American baseball player (Baltimore Orioles, California Angels, Milwaukee Brewers).Andy Etchebarren, who led York Revolution to two Atlantic League titles, dies at age 76 * Marcello Giordani, 56, Italian operatic tenor, heart attack. * David Greaves, 73, English snooker player.David Greaves * Tony Hoar, 87, British racing cyclist, cancer.Tour de France cult figure, inventor Tony Hoar dies at 87 * Henry Keizer, 58, Dutch businessman and politician, Chairman of the People's Party for Freedom and Democracy (2014–2017).Voormalig VVD-voorzitter Henry Keizer (58) plotseling overleden * Blaine Lindgren, 80, American sprinter, Olympic silver medalist (1964).Harold Blaine Lindgren * Margaret Lyons, 95, Canadian radio executive, first female Vice President of the Canadian Broadcasting Corporation, assisted suicide.Margaret Lyons, 95, was an influential executive who sparked CBC’s Radio Revolution * John Mbiti, 87, Kenyan-born Swiss scholar.Celebrated Kenyan Scholar Dies in Switzerland * Philippe Vandevelde, 62, Belgian comics writer (Le Petit Spirou, Soda, Spirou et Fantasio).Philippe Vandevelde Philippe Vandevelde ===6=== * Ginger Baker, 80, English Hall of Fame drummer (Cream, Blind Faith, Ginger Baker's Air Force), subject of Beware of Mr. Baker, problems caused by COPD.Ginger Baker, Legendary Cream drummer, dies aged 80 * Yevgeny Bushmin, 61, Russian politician, member of the Federal Assembly (since 2001).Стала известна причина смерти вице-спикера Совета Федерации Евгения Бушмина * Vlasta Chramostová, 92, Czech actress (The Trap, The Cassandra Cat, The Cremator).Acting great and Charter 77 signatory Vlasta Chramostová dies at 92 * Stuart Heydinger, 92, British photojournalist (The Observer).Stuart Heydinger obituary * Masaichi Kaneda, 86, Japanese Hall of Fame baseball player (Kokutetsu Swallows, Yomiuri Giants) and manager (Lotte Orions), sepsis.元巨人の金田正一さんが死去 前人未到400勝投手 * Khenpo Karthar Rinpoche, 95, Tibetan Karma Kagyu lama, abbot of Karma Triyana Dharmachakra (since 1976).KTD Abbot Khenpo Karthar Rinpoche passes on * Martin Lauer, 82, German sprinter, Olympic champion (1960).Die deutsche Leichtathletik trauert um Martin Lauer * Neale Lavis, 89, Australian equestrian, Olympic champion and silver medalist (1960).Equestrian legend Neal Lavis dies * Karen Pendleton, 73, American actress (The Mickey Mouse Club), heart attack.Karen Pendleton, One of the Original Mouseketeers, Dies at 73 * David Petel, 98, Iraqi-born Israeli politician, member of the Knesset (1959–1969).Knesset Member, David Petel * Richard Pfeiffer, 70, American LGBT activist, Director of Chicago Pride Parade (since 1974), cancer.Richard Pfeiffer, coordinator of Chicago Pride Parade since 1974, dies at 70 * Rip Taylor, 84, American actor (The $1.98 Beauty Show, Chatterbox, Jackass) and comedian, congestive heart failure caused by a seizure.Rip Taylor, Flamboyant Comic and Host of 'The $1.98 Beauty Show,' Dies at 84 ===7=== * Pepe Oneto, 77, Spanish journalist (Cambio 16) and writer, sepsis caused by peritonitis.Muere el periodista Pepe Oneto a los 77 años * Ella Vogelaar, 69, Dutch politician and trade union leader, Minister for Housing, Communities and Integration (2007–2008), suicide.Voormalig minister Ella Vogelaar (69) overleden ===8=== * Eduard Admetlla i Lázaro, 95, Spanish scuba diver, photographer and inventor, first person to dive 100 meters underwater.Mor el pionier del submarinism català Eduard Admetlla * Francis S. Currey, 94, American Army technical sergeant, Medal of Honor recipient (1944).Local WWII veteran, Medal of Honor recipient dies at 94 * Ted Green, 79, Canadian ice hockey player (Boston Bruins, Winnipeg Jets) and coach (Edmonton Oilers).Former Oilers coach, Bruins defenceman Ted Green dies at 79 * Reg Watson, 93, Australian television producer (Prisoner, Neighbours, Sons and Daughters) and screenwriter. ===9=== * Richard Askey, 86, American mathematician, discoverer of Askey–Wilson polynomials, Askey scheme and Askey–Gasper inequality. * Beppe Bigazzi, 86, Italian journalist and businessman, liver cancer.È morto Beppe Bigazzi, l'esperto gastronomo della 'Prova del cuoco' * Lorand Gaspar, 94, Hungarian-born French poet. * Andrés Gimeno, 82, Spanish tennis player, French Open champion (1972), cancer.Andres Gimeno, Roland Garros' Oldest Champion of Modern Era, Dies at 82 * James O. Mason, 89, American physician and public health administrator, Director of the Centers for Disease Control and Prevention (1983–1989), Surgeon General (1989–1990) and Assistant Secretary for Health (1989–1993).Elder James O. Mason — emeritus General Authority Seventy — dies at age 89 * Filippo Penati, 66, Italian politician, Mayor of Sesto San Giovanni (1994–2001) and Milan (2004–2009), pancreatic cancer.È morto Filippo Penati, ex presidente della Provincia di Milano * Jan Szyszko, 75, Polish environmental scientist and politician, Minister of Environment (1997–1999, 2005–2007, 2015–2018), heart attack.Poland's former environment minister dies aged 75 * David Weisman, 77, American movie director (Ciao! Manhattan), producer (Kiss of the Spider Woman) and author, problems caused by West Nile virus.David Weisman, 'Kiss of the Spider Woman' Producer, Dies at 77 * Louis-Christophe Zaleski-Zamenhof, 94, Polish engineer.Zmarł Ludwik Krzysztof Zaleski-Zamenhof. Był Honorowym Obywatelem Białegostoku ===10=== * Raymond Baumhart, 95, American educator, President of Loyola University Chicago (1970–1993). * Ugo Colombo, 79, Italian racing cyclist.Scomparso Ugo Colombo * Richard Jeranian, 98, Armenian-French painter and draftsman.French-Armenian artist Richard Jéranian dies aged 98 * Tarek Kamel, 57, Egyptian politician and computer engineer, Minister of Communications and Information Technology (2004–2011). * Juliette Kaplan, 80, British actress (Last of the Summer Wine, Coronation Street), cancer of unknown primary origin.Juliette Kaplan: Last of the Summer Wine actress dies * Enrique Moreno, 63, Mexican-American lawyer, problems caused from cancer. * Marie-José Nat, 79, French actress (A Woman in White, Violins at the Ball, La Vérité), cancer.L'actrice Marie-José Nat, star des annèes 60 et 70 est morte ===11=== * Sam Bobrick, 87, American television writer (Saved by the Bell, Gomer Pyle, U.S.M.C., The Smothers Brothers Comedy Hour), stroke.Sam Bobrick, 'Saved by the Bell' Creator, Dies at 87 * Robert Forster, 78, American actor (Jackie Brown, The Black Hole, Medium Cool), brain cancer.Robert Forster, Resurgent Oscar Nominee From 'Jackie Brown,' Dies at 78 * John Giorno, 82, American poet and performance artist (Sleep), heart attack.John Giorno, Who Moved Poetry Beyond the Printed Page, Dies at 82 * Kadri Gopalnath, 69, Indian saxophonist and composer (Duet), cardiac arrest.Saxophone wizard Kadri Gopalnath dies at 69 * Alexei Leonov, 85, Russian cosmonaut (Voskhod 2), first person to walk in space, problems caused from diabetes.Soviet Cosmonaut Alexei Leonov Dies at 85 ===12=== * Mel Aull, 90, Canadian football player (Ottawa Rough Riders).Melvin Andrew Aull (1928 - 2019) * Carlo Croccolo, 92, Italian actor (47 morto che parla, After the Fox, Three Men and a Leg) and comedian, pneumonia.È morto Carlo Croccolo, attore comico napoletano * Sara Danius, 57, Swedish writer and professor, member of the Swedish Academy (2013–2019), breast cancer.Sara Danius död efter lång tids sjukdom * Ding Shisun, 92, Chinese mathematician and politician, President of Peking University (1984–1989), Chairman of the China Democratic League (1996–2005) and Vice Chairperson of the National People's Congress (1998–2008). * Hevrin Khalaf, 35, Syrian politician and activist, Secretary General of the Kurdish Future Movement in Syria, shot.Senior female Kurdish political leader killed in ambush in Syria * Emilio Nicolas Sr., 88, Mexican-American television station owner (KWEX), co-founder of Univision, problems caused by progressive supranuclear palsy.Univision Founding Pioneer Emilio Nicolás Sr Dies At 88 * Yoshihisa Yoshikawa, 83, Japanese sport shooter, Olympic bronze medalist (1960, 1964), heart failure.東京五輪射撃銅メダリストの吉川貴久さん死去 ８３歳 ===13=== * Scotty Bowers, 96, American author (Full Service) and pimp, kidney failure.Scotty Bowers, \"Male Madam\" to the Stars, Dies at 96 * Richard Huckle, 33, British convicted sex offender, stabbed.Richard Huckle stabbed to death in Full Sutton Prison * Charles Jencks, 80, American architect and philanthropist, co-founder of Maggie's Centres, cancer.Charles Jencks, co-founder of Maggie's cancer charity, dies at 80 * Vasim Mammadaliyev, 77, Azerbaijani theologian and orientalist, member of the Azerbaijan National Academy of Sciences (since 1989). * Adolfo Mexiac, 92, Mexican graphic artist.Muere Adolfo Mexiac, el gran artista del grabado, a los 92 años ===14=== * Harold Bloom, 89, American literary critic and writer (The Anxiety of Influence, The Western Canon: The Books and School of the Ages).Harold Bloom, Critic Who Championed Western Canon, Dies at 89 * Bohdan Butenko, 88, Polish cartoonist.Zmarł Bohdan Butenko. \"Artysta o doświadczeniu mistrza i wyobraźni dziecka\" * Emmett Chappelle, 93, American astronomer (NASA) and World War II veteran (Buffalo Soldier), kidney failure.Emmett W. Chappelle * Louis Frey Jr., 85, American politician and radio personality (WMFE-FM), member of the U.S. House of Representatives from Florida's 5th and 9th congressional district (1969–1979), problems caused by dementia.Lou Frey: Former longtime congressman from Winter Park has died * Anke Fuchs, 82, German lawyer and politician, Federal Minister of Health (1982) and Vice President of the Bundestag (1998–2002).Trauer um SPD-Politikerin und Ex-Gesundheistsministerin Anke Fuchs * Rosemary Harris, 96, British children's writer (The Moon in the Cloud). * Baby Saroja, 88, Indian actress (Balayogini, Thyaga Bhoomi, Kamadhenu).Baby Saroja, child star of yesteryear, dies at 88 * Jeffrey Spalding, 67, Scottish-born Canadian artist and art curator.'A great loss to the art community': Former Glenbow president Jeffrey Spalding dead at 67 * Sulli, 25, South Korean singer- songwriter (f(x)), actress (Ballad of Seodong, Real), and model, suspected suicide.Singer and actor Sulli found dead ===15=== * Tamara Buciuceanu, 90, Romanian actress (Premiera, Silent Wedding, Everybody in Our Family), heart disease.A murit marea actriţă Tamara Buciuceanu Botez * Cacho Castaña, 77, Argentine singer-songwriter, actor (Merry Christmas) and composer (Los Hijos de López, El Cabo Tijereta), problems caused by COPD.Murió \"Cacho\" Castaña * Hossein Dehlavi, 92, Iranian composer (Mana and Mani), problems caused by Alzheimer's disease.“Sabokbal” composer Hossein Dehlavi passes away at 92 * Michael D. Reynolds, 65, American astronomer and educator, cardiac arrest. ===16=== * Ed Beck, 83, American basketball player (Kentucky Wildcats). * Paolo Bonaiuti, 79, Italian politician and journalist (Il Giorno), member of the Chamber of Deputies (1996–2013) and Senate (2013–2018).E' morto Paolo Bonaiuti, ex portavoce di Berlusconi * Leah Bracknell, 55, British actress (Emmerdale, Casualty 1900s, The Royal Today), lung cancer.Former Emmerdale actress Leah Bracknell dies (death announced on this date) * John Clarke, 88, American actor (Days of Our Lives), problems caused by pneumonia.John Clarke Dies: ‘Days Of Our Lives’ Actor & Lifetime Achievement Emmy Recipient Was 88 * Bernard Fisher, 101, American physician and surgeon, redeveloped methods to treat breast cancer.Bernard Fisher, M.D., Pioneer in Breast Cancer Research, Dies at 101 * Morton Mandel, 98, American industrial parts executive and philanthropist.Jewish philanthropist Morton Mandel dies at 98 * John Tate, 94, American mathematician (Tate conjecture, Tate module), Abel Prize laureate (2010).Disparition du mathématicien John Tate, amateur de courbes elliptiques ===17=== * Alicia Alonso, 98, Cuban ballet dancer (Giselle, Carmen) and choreographer, founder of the Cuban National Ballet.‘A genius of dance.’ Cuban ballet icon Alicia Alonso dies at age 98 * Hildegard Bachert, 98, German-born American art dealer (Galerie St. Etienne) and gallery director.Hildegard Bachert, Veteran Dealer Who Championed Overlooked Artists, Is Dead at 98 * Elijah Cummings, 68, American politician and civil rights activist, member of the U.S. House of Representatives from Maryland's 7th congressional district (since 1996) and Maryland House of Delegates (1983–1996).Congressman Elijah Cummings Dead: Central Figure in Trump Impeachment Inquiry Dies Aged 68 * Bob Kingsley, 80, American Hall of Fame radio host (American Country Countdown, Bob Kingsley's Country Top 40), bladder cancer.Bob Kingsley, Legendary Country Radio DJ, Dies at 80 * Márta Kurtág, 92, Hungarian pianist.Décès de la pianiste hongroise Márta Kurtág * Bill Macy, 97, American actor (Maude, The Jerk, Analyze This).Bill Macy, Bea Arthur's Husband on 'Maude,' Dies at 97 * Göran Malmqvist, 95, Swedish linguist, sinologist and literary historian, member of the Swedish Academy (since 1985).Göran Malmqvist har avlidit * Ángel Pérez García, 62, Spanish football player (Real Madrid, Real Murcia) and manager (Sangonera), cancer.Pérez García passes away ===18=== * Nicolás Díaz, 90, Chilean politician and cardiologist, member of the Christian Democrat Party of Chile (PDC) and Mayor of Rancagua (1963–1964, 1967–1968).Falleció ex alcalde de Rancagua y ex senador Nicolas Diaz * Michael Flaksman, 73, American cellist.Obituary: Michael Flaksman, cellist, 1947-2019 * Horace Romano Harré, 91, New Zealand-born British philosopher and psychologist.Rom Harré (1927-2019) * Mark Hurd, 62, American businessman, CEO of Hewlett- Packard (2005–2010) and Oracle Corporation (since 2014).Mark Hurd, Oracle CEO, has died * Rui Jordão, 67, Angolan-born Portuguese footballer (Benfica, Sporting CP, national team), heart disease.Morreu Rui Jordão, o grande goleador que se zangou com o futebol * William Milliken, 97, American politician, Governor of Michigan (1969–1983).Bill Milliken, Michigan's longest-serving governor, dies * Mike Reilly, 77, American football player (Chicago Bears, Minnesota Vikings).Former Iowa football All-American, broadcaster Mike Reilly dies * Mikhail Innokentyevich Semyonov, 80, Russian politician, Chairman of the People's Khural of the Republic of Buryatia (1994–2002).Скончался первый председатель Народного Хурала Бурятии * Meir Shamgar, 94, Israeli lawyer and politician, Chief Justice of the Supreme Court (1983–1995). ===19=== * Erhard Eppler, 92, German politician, Minister for Economic Development (1968–1974).Erhard Eppler ist tot * Salvador Giner, 85, Spanish sociologist, President of the Institute of Catalan Studies (2005–2013).Fallece el sociólogo y jurista Salvador Giner, Premio Nacional en 2006 * Ishmael Levenston, 79, Saban politician, MP (1975–1979, 1983–1987), founder of the Saba Labour Party, heart failure.Saba mourns the passing of veteran politician, Ishmael Levenston * Joseph Lombardo, 90, American mafioso, member of the Chicago Outfit.Chicago mobster 'Joey the Clown' Lombardo dies in prison * Warren Rosenthal, 96, American restaurateur (Long John Silver's) and philanthropist.Lexington businessman, philanthropist Warren Rosenthal has died * Alexander Volkov, 52, Russian tennis player.СПОРТ Умер теннисист Александр Волков ===20=== * Eric Cooper, 52, American baseball umpire, blood clot caused by knee surgery.Iowa native, veteran MLB umpire Eric Cooper dead at 52 * Thomas D'Alesandro III, 90, American politician, Mayor of Baltimore (1967–1971), problems caused by a stroke.Former Baltimore Mayor Thomas 'Young Tommy’ D’Alesandro III dies at 90 * Huang Yong Ping, 65, Chinese-French avant- garde artist, cerebral hemorrhage.Huang Yong Ping, Provocateur Artist Who Pushed Chinese Art in New Directions, Has Died at 65 * Aquilino Pimentel Jr., 85, Filipino politician, President of the Senate (2000–2001) and Senator (1987–1992, 1998–2010), pneumonia caused by lymphoma.Former Senate President Nene Pimentel dies at 85 ===21=== * Gilberto Aceves Navarro, 88, Mexican painter and sculptor, lung disease.Murió el artista Gilberto Aceves Navarro * Willie Brown, 78, American Hall of Fame football player (Denver Broncos, Oakland Raiders) and coach. * Josip Elic, 98, American actor (The Twilight Zone, One Flew Over the Cuckoo's Nest), problems caused by a fall.Josip Elic, Actor in 'One Flew Over Cuckoo's Nest,' Dies at 98 * Bengt Feldreich, 94, Swedish television journalist (Sveriges Television) and presenter (From All of Us to All of You), pneumonia.Tv-profilen Bengt Feldreich är död * Taras Kutovy, 43, Ukrainian politician, member of Verkhovna Rada (2012–2014) and Minister of Agrarian Policy and Food (2016–2018), helicopter crash.В авіакатастрофі під Полтавою загинув екс-міністр Тарас Кутовий * Lho Shin- yong, 89, South Korean politician, Minister of Foreign Affairs (1980–1982) and Prime Minister (1985–1987).Lho Shin-yong, advocate of 1980s military junta and mentor of ex-UN chief, dies at 89 * Aila Meriluoto, 95, Finnish poet (Lasimaalaus) and translator.Runoilija Aila Meriluoto on kuollut ===22=== * Manfred Bruns, 85, German lawyer and LGBTQ rights activist, liver failure.Trauer um Manfred Bruns * Vicki Ann Funk, 71, American botanist and researcher. * Til Gardeniers-Berendsen, 94, Dutch politician, Minister of Health (1981–1982), MP (1971–1977, 1981–1983) and member of the Council of State (1983–1995).Oud-bewindsvrouw Til Gardeniers (94) overleden * Gustav Gerneth, 114, German supercentenarian, world's oldest man (since 2019).Altester Mann der Welt stirbt im Alter von 114 Jahren * Ole Henrik Laub, 81, Danish children's writer (Et Sværd Dyppet i Honning) and artist, stomach cancer.Nekrolog: Forfatteren Ole Henrik Laub er dod, 81 ar * Raymond Leppard, 92, British-American conductor and composer (Lord of the Flies), Director of the Indianapolis Symphony Orchestra (1987–2001).Conductor and Composer Raymond Leppard - A Champion Of The Old And The New - Has Died * Sadako Ogata, 92, Japanese academic and politician, President of UNICEF (1978–1979) and United Nations High Commissioner for Refugees (1990–2000).Sadako Ogata, first female United Nation High Commissioner for Refugees, dies at 92 * Miguel Saiz, 70, Uruguayan-born Argentine politician, Governor of Río Negro (2003–2011), heart failure.Falleció el exgobernador rionegriono Miguel Saiz * Marieke Vervoort, 40, Belgian wheelchair racer, Paralympic champion (2012), assisted suicide by euthanasia.Rolstoelatleet Marieke Vervoort (40) is overlden na euthanasie * Hans Zender, 82, German conductor and composer (Stephen Climax).Zum Tod des Komponisten und SWR Gastdirigenten Hans Zender * Therese Zenz, 87, German sprint canoer, Olympic silver medalist (1956, 1960).Das saarlandische \"Silbermadchen\" Therese Zenz ist tot * Jo Ann Zimmerman, 82, American politician, Lieutenant Governor of Iowa (1987–1991), problems caused by pulmonary fibrosis.Iowa's first female lieutenant governor, Jo Ann Zimmerman, dies at 82 ===23=== * Santos Juliá, 79, Spanish historian and sociologist.Muere Santos Juliá, el gran historiador del siglo XX español * James W. Montgomery, 98, American Episcopalian prelate, Bishop of Chicago (1971–1987).In Memoriam: Bishop James Montgomery, 1921-2019 * Rolando Panerai, 95, Italian baritone singer, heart attack.E' morto il baritono Rolando Panerai * Bernie Parrish, 83, American football player (Cleveland Browns, Houston Oilers), prostate cancer.Bernie Parrish dies at 83 * Francis A. Sullivan, 97, American theologian and Jesuit priest. * Alfred Znamierowski, 79, Polish vexillologist and editor (Voice of America), heart attack.Zmarł Alfred Znamierowski - jeden z czołowych helardyków na świecie ===24=== * Janusz A. Brzozowski, 84, Polish-Canadian computer scientist, cancer.In memoriam: Distinguished Professor Emeritus Janusz (John) A. Brzozowski * Walter Franco, 74, Brazilian rock singer (\"Especial Tom Jobim\") and composer, stroke.Walter Franco more em Sao Paulo aos 74 anos * Kaoru Yachigusa, 88, Japanese actress (Samurai Trilogy, Hachiko Monogatari, Agatha Christie's Great Detectives Poirot and Marple), pancreatic cancer.女優の八千草薫さん死去 88歳 ===25=== * Chou Wen-chung, 96, Chinese-born American composer.“父亲让我自己去思考。” * Salvador Freixedo, 96, Spanish ufologist and Jesuit priest.Adios a Salvador Freixedo * Mike Stone, 80, American baseball executive, President of the Texas Rangers and Commissioner of the Northern League. * Carlo Strenger, 61, Swiss-Israeli psychologist and philosopher.Der NZZ-Kolumnist Carlo Strenger ist verstorben * Don Valentine, 87, American venture capitalist (Sequoia Capital).Sequoia Capital founder Don Valentine dies ===26=== * Abu Bakr al-Baghdadi, 48, Iraqi militant, Emir of the Islamic State of Iraq (2010–2013) and Leader of the Islamic State of Iraq and the Levant (since 2013), suicide by explosive vest.Islamic State leader al- Baghdadi believed to be killed * Paul Barrere, 71, American rock guitarist (Little Feat), liver cancer. * Enriqueta Basilio, 71, Mexican Olympic sprinter and hurdler (1968), pneumonia. * Robert Evans, 89, American movie producer (Chinatown, Marathon Man) and studio executive (Paramount Pictures), problems caused by a stroke.Robert Evans, ‘Chinatown’ Producer and Paramount Chief, Dies at 89 * Chuck Meriwether, 63, American baseball umpire, cancer.MLB mourns passing of former umpire Meriwether * Silvia Montanari, 76, Argentine actress (Son de ten, Alen Moonlight, Gasoleros), cancer.Murió la actriz Silvia Montanari a los 76 años de edad: tenía cáncer * V. Nanammal, 99, Indian yoga educator, problems caused by a fall.V Nanammal, India's oldest yoga teacher, passes away in Tamil Nadu * Gregory E. Pyle, 70, American politician, Chief of the Choctaw Nation of Oklahoma (1997–2014).Former Choctaw Nation Chief Gregory Pyle dies at 70 * Pascale Roberts, 89, French actress (The Women Couldn't Care Less, The Sleeping Car Murders, Plus belle la vie), colorectal cancer.Pascale Roberts, actrice dans \"Plus belle la vie\", est morte ===27=== * Vladimir Bukovsky, 76, Russian-born British human rights activist and political dissident, 2008 presidential candidate, heart failure.Soviet dissident Vladimir Bukovsky dies aged 76 * Stephen P. Cohen, 83, American political scientist and security expert.Stephen Cohen, pioneering strategic affairs expert on India, dies at 83 * John Conyers, 90, American politician and civil rights activist, Dean (2015–2017) and member of the U.S. House of Representatives from Michigan's 1st, 14th and 15th congressional districts (1965–2017).Former Rep. John Conyers, Longest-Serving Black Member Of Congress, Dies At 90 * Ivan Milat, 74, Australian serial killer (backpacker murders), oesophageal and stomach cancer.Australia’s worst serial killer Ivan Milat has died aged 74 * Anne Phelan, 75, Australian actress (Bellbird, Prisoner, Winners & Losers).'One of the best humans': Prisoner actress Anne Phelan dies, aged 75 (death announced on this date) * Natalia Pugachova, 83, Russian singer (Buranovskiye Babushki), stomach cancer.Muere a los 83 años Natalia Pugacheva, la abuela de Eurovisión ===28=== * Al Bianchi, 87, American basketball player (Syracuse Nationals/Philadelphia 76ers), coach (Seattle SuperSonics) and general manager (New York Knicks), congestive heart failure.Knicks News: Former GM Al Bianchi Dies of Natural Causes at Age 87 * Kay Hagan, 66, American politician, U.S. Senator from North Carolina (2009–2015) and member of the North Carolina Senate (1999–2009), problems caused by encephalitis.Former US Senator Kay Hagan dead at 66 after three-year battle with encephalitis * Zoltán Jeney, 76, Hungarian composer.Meghalt Jeney Zoltán ===29=== * Gerald Baliles, 79, American politician, Governor (1986–1990), Attorney General of Virginia (1982–1985) and member of the Virginia House of Delegates (1976–1982), pulmonary fibrosis caused by kidney cancer.Former Governor Gerald Baliles passes away * Kees Driehuis, 67, Dutch television presenter (Per Seconde Wijzer), bladder cancer.Reacties op overlijden Kees Driehuis: 'Deugde tot in diepste van zijn vezels' * Hans- Peter Uhl, 75, German politician, MP (1998–2017).CSU-Grande Hans-Peter Uhl ist tot * John Witherspoon, 77, American actor (Friday, Vampire in Brooklyn, The Boondocks), heart attack.John Witherspoon, Comedian And ‘Friday’ Star, Dead At 77 ===30=== * Russell Brookes, 74, British rally driver, British Rally Championship champion (1977, 1985).British rallying legend Russell Brookes dies * Ron Fairly, 81, American baseball player (Los Angeles Dodgers, St. Louis Cardinals) and broadcaster (Seattle Mariners), cancer.Former Seattle Mariners broadcaster Ron Fairly dies at 81 * Jim Gregory, 83, Canadian Hall of Fame ice hockey coach (Toronto Marlboros) and executive (Toronto Maple Leafs), amyloidosis.Former Maple Leafs GM Jim Gregory dies at 83 * William J. Hughes, 87, American politician, member of the U.S. House of Representatives from New Jersey's 2nd congressional district (1975–1995) and Ambassador to Panama (1995–1998).Former Congressman William Hughes dead at 87 * Mobolaji Johnson, 83, Nigerian military officer and politician, Governor of Lagos State (1967–1975).First Lagos military gov, Mobolaji Johnson, dies * Bernard Slade, 89, Canadian-American playwright (Same Time, Next Year) and screenwriter (The Flying Nun, The Partridge Family), problems caused by Lewy body dementia.Bernard Slade, 'Partridge Family' Creator and 'Same Time, Next Year' Writer, Dies at 89 * Azam Taleghani, 76, Iranian politician, activist and journalist, MP (1980–1984), cerebral hemorrhage caused by a fall.اعظم طالقانی درگذشت * J. Bob Traxler, 88, American politician, member of the U.S. House of Representatives from Michigan's 8th congressional district (1974–1993) and Michigan House of Representatives (19621974).FFormer US Rep. 'Bingo Bob' Traxler dies at 88, served in Washington nearly 20 years ===31=== * Ebrahim Abadi, 85, Iranian actor (Mokhtarnameh, Dar Chashm-e Baad, Grand Cinema), problems caused by a heart attack.ابراهیم آبادی درگذشت * Enrico Braggiotti, 96, Turkish-born Monegasque banker, President of the Banca Commerciale Italiana (1988–1990).È morto l'ex banchiere Enrico Braggiotti * Ann Crumb, 69, American actress (Anna Karenina), animal rights activist and singer, ovarian cancer.Tony Nominee Ann Crumb Passes Away from Ovarian Cancer * Geetanjali, 72, Indian actress (Seetharama Kalyanam, Murali Krishna, Kalam Marindi), cardiac arrest.Veteran actress Geetanjali Ramakrishna passes away ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *910 Deaths",
 "title": "Deaths in October 2019"
}