{
 "id": "715698",
 "text": "Daniel Ricardo Manning (born May 17, 1966) is an American college basketball coach and retired NBA player. He is the current men's head coach at Wake Forest. Manning played high school basketball at Lawrence High School in Lawrence, Kansas, college basketball at The University of Kansas, and played in the NBA for 14 years. After he retired from professional basketball, Manning became an assistant coach at the University of Kansas. He won the national championship with the Jayhawks in 1988 as a player. He won it again as an assistant in 2008. He is the all-time leading scorer in Kansas basketball history with 2,951 points. The next closest player to his point total is Nick Collison, who is 854 points behind Manning. ==Early life== Manning is the son of Ed Manning, who was a longtime NBA and ABA player and professional and college coach. When he was a junior at Page High School in Greensboro, North Carolina, Manning averaged 18.8 points and nine rebounds per game. He led the Pirates to a 26–0 record and the state title. When Ed Manning became an assistant coach at the University of Kansas before Manning's senior year, the family moved to Lawrence, Kansas. Manning went to Lawrence High School. While he was there as a senior, he was named Kansas Player of the Year. While in Lawrence High, Manning played along future United States federal judge Sri Srinivasan. ==College coaching== ===Wake Forest=== On April 4, 2014, Manning agreed to become the head coach at Wake Forest University.app Wake Forest hires Danny Manning – ESPN ===Head coaching record=== ==Personal life== Manning is the son of former NBA player, Ed Manning. Manning's own son, Evan, accepted a walk-on invitation for the men's basketball team at Kansas for the 2012–13 season.Bedore, Gary. Evan Manning to join KU as walk-on, Lawrence Journal-World, April 6, 2012Manning's son will walk on to KU hoops team | Campus Corner His daughter, Taylor, is a member of the Kansas volleyball team. ==NBA career statistics == SEASON TEAM GP MPG SPG BPG RPG APG PPG Hi 40+ 50+ TD DD 1988–89 LA Clippers 26 36.5 1.7 1.0 6.6 3.1 16.7 29 0 0 0 4 1989–90 LA Clippers 71 32.0 1.3 0.5 5.9 2.6 16.3 39 0 0 0 4 1990–91 LA Clippers 73 30.1 1.6 0.8 5.8 2.7 15.9 31 0 0 0 6 1991–92 LA Clippers 82 35.4 1.6 1.5 6.9 3.5 19.3 34 0 0 0 13 1992–93 LA Clippers 79 34.9 1.4 1.3 6.6 2.6 22.8 36 0 0 0 16 1993–94 LA Clippers/ Atlanta 42 26 38.0 35.6 1.3 1.8 1.4 1.0 7.0 6.5 4.2 3.3 23.7 15.7 43 24 1 0 0 0 1 0 9 5 1994–95 Phoenix 46 32.8 0.9 1.2 6.0 3.3 17.9 33 0 0 0 7 1995–96 Phoenix 33 24.7 1.2 0.7 4.3 2.0 13.4 32 0 0 0 0 1996–97 Phoenix 77 27.7 1.1 1.0 6.1 2.2 13.5 26 0 0 0 12 1997–98 Phoenix 70 25.6 1.0 0.7 5.6 2.0 13.5 35 0 0 0 6 1998–99 Phoenix 50 23.7 0.7 0.8 4.4 2.3 9.1 19 0 0 0 1 1999–00 Milwaukee 72 16.9 0.9 0.4 2.9 1.0 4.6 19 0 0 0 0 2000–01 Utah 82 15.9 0.6 0.4 2.6 1.1 7.4 25 0 0 0 0 2001–02 Dallas 41 13.5 0.5 0.5 2.6 0.7 4.0 13 0 0 0 0 2002–03 Detroit 13 6.8 0.7 0.2 1.4 0.5 2.6 18 0 0 0 0 Career 7 teams 883 27.4 1.1 0.9 5.2 2.3 14.0 43 1 0 1 83 ==References== ==Other websites== * Wake Forest profile * Category:1966 births Category:Living people Category:African- American basketball players Category:College basketball coaches Category:Sportspeople from Lawrence, Kansas Category:Olympic bronze medalists for the United States Category:Atlanta Hawks players Category:Dallas Mavericks players Category:Detroit Pistons players Category:Los Angeles Clippers players Category:Medalists at the 1988 Summer Olympics Category:Milwaukee Bucks players Category:Phoenix Suns players Category:Sportspeople from Mississippi Category:Utah Jazz players",
 "title": "Danny Manning"
}