{
 "id": "715604",
 "text": "Michael James Ryan (June 18, 1976 - September 29, 2019), known professionally as busbee, was an American songwriter, record producer, publisher, record label executive and multi-instrumentalist. ==Biography== Busbee was born in Walnut Creek, California and began playing music when he was seven years old, living in Los Angeles with his family. He later wrote and produced music, and was nominated for a Grammy Award in 2017. Busbee marched with the World Class Drum Corps, Blue Devils Busbee worked with a broad range of artists including Gwen Stefani, P!nk, Maren Morris, Timbaland featuring Katy Perry, Keith Urban, Jon Bellion, Kelly Clarkson, and Lady Antebellum. Busbee died of brain cancer on September 29, 2019, in San Francisco, California, at age 43. ==Discography== ===Songs written=== Discography Artist Album Song Co-written with Notes 5 Seconds of Summer 5 Seconds of Summer (2014) \"Don't Stop” Luke Hemmings, Calum Hood, Steve Robson Single \"The Only Reason” Steve Robson, Michael Clifford rowspan=\"6\" Christina Aguilera Lotus (2012) \"Empty Words\" Christina Aguilera, Nikki Flores, Ali Tamposi Lauren Alaina Road Less Traveled (2016) \"Doin' Fine\" Lauren Alaina, Emily Shackleton \"My Kinda People\" Jason Aldean My Kinda Party (2010) \"Days Like These\" Neil Thrasher, Wendell Mobley Night Train (2012) \"This Nothing Town\" Allstar Weekend All the Way (2011) \"Not Your Birthday\" (feat. Anth) Anthony Melo, JP Clark, Jayce Levi Single \"Do It 2 Me\" Zachary Porter, JP Clark, Jayce Levi rowspan=\"14\" Backstreet Boys This Is Us (2009) \"Masquerade\" Brian Kennedy, Alex James, Antwoine Collins Jon Bellion The Human Condition (2016) \"80's Films\" Jon Bellion \"Maybe IDK\" Better Than Ezra Paper Empire (2009) \"Black Light\" Kevin Griffin \"Turn Up The Bright Lights\" Kevin Griffin, Michelle Lewis \"In Between The Moments\" Kevin Griffin \"Wounded\" \"All in\" Kevin Griffin, James Bourne Boyzone Brother (2010) \"Nothing Without You” Catt Gravitt, Tom Shapiro Danielle Bradbery Danielle Bradbery (2013) \"Yellin' From The Rooftop\" Sarah Buxton \"Endless Summer” Sarah Buxton, Jedd Hughes Toni Braxton Pulse (2010) \"If I Have to Wait\" Toni Braxton, Jud Friesman, Allan Rich Garth Brooks Man Against Machine (2014) \"People Loving People\" Lee Thomas Miller, Chris Wallin Alexandra Burke Overcome (2009) \"Bad Boys\" (feat. Flo Rida) Melvin K. Watson Jr., Larry Summerville Jr., Alex James, Lauren Evans Tramar Dillard Single (#1 UK Singles Chart, Brit Award Nomination) Kelly Clarkson Stronger (2011) \"Dark Side\" Alexander Geringas Single (#1 Billboard Dance Chart) Daughtry Break the Spell (2011) \"We're Not Gonna Fall\" Chris Daughtry, Zac Maloy rowspan=\"10\" \"Gone Too Soon\" Chris Daughtry \"Losing My Mind\" Baptized (2013) \"I'll Fight” \"High Above The Ground” Gavin DeGraw Make a Move (2013) \"Who's Gonna Save Us\" Gavin DeGraw Lee DeWyze Live It Up (2010) \"A Song About Love\" Lee DeWyze, Espen Lind, Amund Bjørklund, David Hodges \"It's Gotta Be Love\" Lee DeWyze, Espen Lind, Amund Bjørklund, Claude Kelly \"Stay Here\" Lee DeWyze, Espen Lind, Claude Kelly Colton Dixon A Messenger (2013) \"Noise\" Colton Dixon \"You Are” Colton Dixon, Rhyan Shirley, Jared Martin Single Sara Evans Slow Me Down (2014) \"Good Love Is Hard To Find” Sarah Buxton, Dave Berg Florida Georgia Line Dig Your Roots (2016) \"H.O.L.Y\" Nate Cyphert, William Wiik Larsen Single Dia Frampton Red (2011) Don't Kick The Chair (feat. Kid Cudi)\" Dia Frampton, Scott Mescudi, Julie Frost Single \"I Will\" (feat. Blake Shelton) Dia Frampton, Tom Shapiro rowspan=\"5\" \"Good Boy\" Dia Frampton, Chris Seefried \"Love Can Come From Anywhere\" Dia Frampton The Fray Helios (2014) \"Hold My Hand” The Fray \"Give it Away” \"Our Last Days” Martin Garrix \"Don't Look Down\" (2015) \"Don't Look Down (Ft. Usher)\" feat. Usher Martin Garrix, Usher Raymond, James Abrahart Single Girls' Generation Run Devil Run (2010) \"Run Devil Run\" Alex James, Kalle Engström, Hong Ji-yoo, Nakamura Kanata Single Giorgia Dietro le apparenze (2011) \"Hostage\" (È l'amore che conta) Giorgia Todrani, Allan Rich, Jud Firdman Single \"Did I Lose You\" (feat. Olly Murs) colspan=\"2\" Hunter Hayes Hunter Hayes (2011) \"Storm Warning\" Hunter Hayes, Gordie Sampson Single Jana Kramer Thirty One (2015) \"Said No One Ever\" Nicolle Gaylon, Natalie Hemby Single Lady Antebellum Need You Now (2010) \"Our Kind of Love\" Hillary Scott, Charles Kelley, Dave Haywood Single (#1 Billboard US Country) \"Ready to Love Again\" rowspan=\"4\" Own the Night (2011) \"When You Were Mine\" 747 (2014) \"Falling for You\" The Best of Me (2014) Heart Break (2017) \"You Look Good\" Ryan Hurd, Hillary Lindsey Single (#9 US Billboard Hot Country Songs) '\"Somebody Else's Heart\" Hillary Scott, Charles Kelley, Dave Haywood, Shane McAnally rowspan=\"11\" \"Army\" Hillary Scott, Charles Kelley, Dave Haywood, Nicolle Galyon \"Good Time to Be Alive\" Hillary Scott, Charles Kelley, Dave Haywood, Will Weatherly, Emily Weisband \"Stars\" Hillary Scott, Charles Kelley, Dave Haywood \"Home\" Adam Lambert Trespassing (2012) \"Take Back\" Adam Lambert Little Big Town Pain Killer (2014) \"Quit Breaking Up With Me\" Natalie Hemby, Shane McAnally Scotty McCreery See You Tonight (2013) \"Now” Scotty McCreery, Frank Rogers \"Buzzin” Frank Rogers Katharine McPhee Unbroken (2010) \"How\" Lucie Silvas, Alex James Bea Miller Young Blood (2014) \"Enemy Fire\" Meghan Kabir Maren Morris Hero (2016) \"My Church\" Maren Morris Single (#5 Billboard Hot Country Songs) \"80s Mercedes\" Maren Morris rowspan=\"4\" \"How It's Done\" Maren Morris, Natalie Hemby \"Once\" Maren Morris Kellie Pickler The Woman I Am (2013) \"I Forgive You\" Hillary Lindsey, Aimee Mayo P!nk The Truth About Love (2012) \"Try\" Ben West Single (#1 Billboard Adult Pop Chart, Billboard Adult Contemporary Chart) Cassadee Pope Frame by Frame (2013) \"Edge of a Thunderstorm” Cassadee Pope, Liz Rose rowspan=\"2\" Rascal Flatts Still Feels Good (2007) \"Better Now\" Gregory Becker, Darrell Brown Unstoppable (2009) Summer Nights\" Gary LeVox, Brett James Single (#2 Billboard Country Chart) Nothing Like This (2010) \"Sunday Afternoon\" Joe Don Rooney rowspan=\"2\" Rewind (2014) \"She Must Like Broken Hearts” Rascal Flatts Haley Reinhart Listen Up! (2012) \"Free\" Lucie Silvas Single \"Wasted Tears\" Haley Reinhart, Jonthan Green rowspan=\"2\" \"What You Don't Know\" Haley Reinhart, Sam Watters Chris Rene I'm Right Here (2012) \"Trouble\" Jason Bonilla, Alex Lambert Single The Rosso Sisters Hola Hola (2014) \"We Don't Care About That Anyway\" rowspan=\"3\" Shakira Shakira (2014) \"Broken Record\" Shakira Blake Shelton If I'm Honest (2016) \"Every Goodbye\" Ryan Hurd, Liz Rose Jessica Sutta \"Show Me\" (2011) Alexander Geringas, Paddy Dalton Single (#1 Billboard Dance Chart) Timbaland Shock Value II (2009) \"If We Ever Meet Again\" (feat. Katy Perry) T.Mosley, James Washington Single (#3 UK Singles Chart) Keith Urban Get Closer (2010) \"All For You” Chris Eaton rowspan=\"5\" Ripcord (2016) \"Sun Don't Let Me Down\" (featuring Nile Rodgers and Pitbull) Keith Urban, Nile Rodgers, Pitbull \"The Fighter\" (feat. Carrie Underwood) Keith Urban \"Your Body\" Vedera Stages (2009) \"Goodbye My Love” Vedera, Simon Wilcox, James Bourne, Kasia Livingston Carly Pearce Every Little Thing (2017) \"Every Little Thing\" Carly Pearce, Emily Shackelton Single \"Everybody Gonna Talk\" Carly Pearce, Emily Weisband rowspan=\"7\" \"Catch Fire\" Natalie Hemby \"If My Name Was Whiskey\" Carly Pearce, Shane McNally \"Color\" Carly Pearce, Laura Veltz \"Feel Somethin’\" Shane McNally, Natalie Hemby \"You Know Where to Find Me\" Carly Pearce, Emily Shackelton \"Honeysuckle\" Barry Dean, Hillary Lindsey ===Production and co-production=== Discography Artist Album Song Co-produced with Christina Aguilera Lotus (2012) \"Empty Words\" rowspan=\"5\" Lauren Alaina Lauren Alaina EP (2015) \"Next Boyfriend\" (2015) Road Less Traveled (2016) All tracks Allstar Weekend All the Way (2011) \"Not Your Birthday\" (feat. Anth) \"Do It 2 Me\" Daughtry Baptized (2013) \"I'll Fight” DreZa \"High Above The Ground” Mason \"MdL\" Levy Gavin DeGraw Make a Move (2013) \"Who's Gonna Save Us\" DreZa Dia Frampton Red (2011) \"I Will\" (feat. Blake Shelton) \"Good Boy\" J. Bonilla Girl's Generation Run Devil Run (2010) \"Run Devil Run\" Alex James, Kalle Engström Lady Antebellum 747 (2014) \"Falling for You\" rowspan=\"3\" The Best of Me (2014) Heart Break (2017) All tracks Adam Lambert Trespassing (2012) \"Take Back\" J. Bonilla Ingrid Michaelson Lights Out (2014) \"Time Machine\" rowspan=\"2\" Bea Miller Young Blood (2014) \"Enemy Fire\" Maren Morris Hero (2016) \"My Church\" Maren Morris \"80's Mercedes\" \"Sugar\" \"How It's Done\" \"Rich\" \"Just Another Thing\" \"Second Wind\" \"I Could Use A Love Song\" \"Once\" \"Company You Keep\" Maren Morris, Brad Hill \"Drunk Girls Don't Cry\" Haley Reinhart Listen Up! (2012) \"What You Don't Know\" J. Bonilla \"Walking on Heaven\" rowspan=\"3\" \"Hit the Ground Running\" \"Baby, It's Cold Outside\" Chris Rene I'm Right Here (2012) \"Trouble\" J. Bonilla Shakira Shakira (2014) \"Broken Record\" Shakira \"Medicine\" (feat. Blake Shelton) \"23\" Keith Urban Ripcord (2016) \"Sun Don't Let Me Down\" (feat. Pitbull) Keith Urban, Nile Rodgers \"The Fighter\" Keith Urban \"Your Body\" ====Other songs==== *Cris Cab – \"The Truth\", \"The Sun Is Gonna Rise Again\" *Eliza Doolittle – \"I'm in Love With You” *Edurne – \"Pretty Boy\" *Mickey Guyton – \"Safe\" *Girls Generation – \"Chain Reaction\" *Danny Gokey – \"I Still Believe\" *Francesca Michielin – \"Il più bell'abbraccio\" *Ryan Star – \"Stay Awhile\" Single' *Westlife – \"Get Away” *Elliott Yamin -\"In Love With You Forever\", \"The Bridge Is Burning\" *Dima Bilan & Anastacia - \"Safety\" *Cale Dodds - \"I Like Where This Is Going\" ==References== ==Other websites== *The official website of Busbee *Interview, HitQuarters 4 Apr 2011 * as Mike Busbee * as Michael James Ryan Category:1976 births Category:2019 deaths Category:Musicians from California Category:American record producers Category:American songwriters Category:People from Walnut Creek, California",
 "title": "Busbee"
}