{
 "id": "715690",
 "text": "Ronald Ellwin Evans Jr. (November 10, 1933 – April 7, 1990), (Capt, USN), was an American naval officer and aviator, electrical engineer, aeronautical engineer, and NASA astronaut. He was one of 24 people to have flown to the Moon. ==Biography== ===Early life and education=== Evans was born on November 10, 1933, in St. Francis, Kansas. His parents were Clarence Ellwin Evans (1911–1985) and Marie A. Evans (; 1913–1992). He had two siblings, Larry Joe Evans (1935–1951) and Jay Evans.Ron Evans' family He was active in the Boy Scouts of America. He achieved its second highest rank, Life Scout. He graduated from Highland Park High School in Topeka, Kansas in 1951. He received a Bachelor of Science degree in Electrical Engineering from the University of Kansas in 1956. He received a Master of Science degree in Aeronautical Engineering from the U.S. Naval Postgraduate School in 1964. He was a member of Tau Beta Pi, Society of Sigma Xi, and Sigma Nu. ===NASA career=== Evans was one of the 19 astronauts chosen by NASA in April 1966. He served as a member of the astronaut support crews for the Apollo 7 and Apollo 11 flights. He was in the backup Command Module Pilot for Apollo 14. ===Later years=== Evans retired from NASA in March 1977. He wanted to get a career in the coal industry. Later, he worked with Western American Energy Corporation in Scottsdale, Arizona. He was Director of Space Systems Marketing for Sperry Flight Systems. He died in his sleep of a heart attack in Scottsdale, Arizona, on April 7, 1990. He was survived by his widow Jan, his daughter, Jaime D. Evans (born August 21, 1959), and his son, Jon P. Evans (born October 9, 1961).Date of death according to death certificate issued by the State of Arizona on April 27, 1990, Certificate Number 169985, signed by G.E. Bolduc, MD. ==References== ==Other websites== * Astronautix biography of Ronald Evans * National Space Society: Ad Astra magazine * Evans at Encyclopedia of Science * * Ronald Evans at the Kansas Historical Society Category:1933 births Category:1990 deaths Category:Deaths from myocardial infarction Category:Apollo astronauts Category:Scientists from Kansas",
 "title": "Ronald Evans (astronaut)"
}