{
 "id": "716036",
 "text": "In economics, the marginal propensity to consume (MPC) is a measurement that can put induced consumption into numbers. Induced consumption is the idea that an increase in personal consumer spending (consumption) happens with an increase in disposable income (income after taxes and transfers). The proportion of disposable income which people spend on consumption is called the propensity to consume. MPC is the proportion of more income that a person spends. For example, if a household earns one extra dollar of disposable income, and the marginal propensity to consume is 0.65, then the household will spend 65 cents and save 35 cents of that dollar. Obviously, the household cannot spend more than the extra dollar (without borrowing). John Maynard Keynes says that the marginal propensity to consume is less than one. The MPC is higher for poorer people than in rich. == Background == Mathematically, the \\mathit{MPC} function is written as the derivative of the consumption function C with respect to disposable income Y, i.e., the instantaneous slope of the C-Y curve. :\\mathit{MPC}=\\frac{dC}{dY} or, approximately, :\\mathit{MPC} = \\frac{\\Delta C}{\\Delta Y}, where \\Delta C is the change in consumption, and \\Delta Y is the change in disposable income that created the consumption. Marginal propensity to consume can be found by dividing change in consumption by a change in income, or \\mathit{MPC}=\\Delta C/\\Delta Y. The MPC can be explained with the simple example: Income Consumption 120 120 180 170 Here \\Delta C= 50; \\Delta Y= 60 Therefore, \\mathit{MPC}=\\Delta C/\\Delta Y= 50/60= 0.83 or 83%. For example, suppose you receive a bonus with your paycheck, and it's $500 on top of your normal annual earnings. You now have $500 more in income than you did before. If you decide to spend $400 of this marginal increase in income on something, your marginal propensity to consume will be 0.8 (\\$400/\\$500). ==Related pages== *Average propensity to save *Average propensity to consume *Keynesian economics ==References== ==More reading== * * * Category:Economic indicators",
 "title": "Marginal propensity to consume"
}