{
 "id": "716141",
 "text": "Hubert Blaine Wolfe­schlegel­stein­hausen­berger­dorff Sr. (a.k.a. Hubert Wolfstern, Hubert B. Wolfe + 988 Sr., Hubert Blaine Wolfe+585 Sr., and Hubert Blaine Wolfe+590 Sr., among others) is the shortened name of a man who has had the record for the longest personal name ever used. Hubert's given name is made up from 27 names. Each of those names start with a different letter of the alphabet in alphabetical order; these are followed by a very long name. No one can agree on the exact length and spelling of his name. This is because it has been spelled differently over the years. Many of those spellings have mistakes in them. One of the longest and most reliable published versions, with a 666-letter surname, is: ==Biography== Wolfe­schlegel­stein­hausen­berger­dorff was born in Bergedorf (now part of Hamburg), Germany. Later, he moved to Philadelphia in the United States. His birthdate has been given as February 29, 1904. However, he was also reported to be age 47 in a 1964 story. Philadelphia County death records list a birthdate of August 4, 1914. He became a typesetter according to Bennett Cerf. He is also known to have been a member of the American Name Society for a while. His name first got attention when it was shown in the 1938 Philadelphia telephone directory on page 1292, column 3, line 17, and in a court order of judge John Boyle of May 25, 1938: \"Wolfe­schlegel­stein­hausen­berger­dorff, Jr., etc., vs. Yellow Cab Co., petition for compromise settlement granted\"—with people believing that the case was settled because \"they couldn't pronounce it\". In the 1970s and 1980s, Wolfe­schlegel­stein­hausen­berger­dorff appeared in the Guinness Book of World Records as having the longest personal name. His picture was taken for the book in front of a New York City marquee displaying his name. His name was misspelled. ==References== ==Other websites== Category:1914 births Category:1997 deaths Category:People from Hamburg",
 "title": "Hubert Blaine Wolfeschlegelsteinhausenbergerdorff Sr."
}