{
 "id": "716184",
 "text": "Varsity Blues is a 1999 American comedy and drama sports movie. It is about a small town high school football team and their coach. ==Plot== Jonathan \"Mox\" Moxon is an intelligent and academically talented quarterback on the West Canaan High School football team. But although he is popular at school, has a smart girlfriend and has easy friendships with other players, he isn't satisfied with his life. He wants to attend Brown University in Rhode Island. He is constantly disagreeing with his football-obsessed father Sam. The verbally abusive Bud Kilmer cares just for winning, and at all costs. Kilmer has won two state titles and 22 district championships. His philosophy, though, begins taking a toll on the team's all state starting quarterback, Lance Harbor. Harbor is Jules's brother. ==Cast== * James Van Der Beek as Jonathon \"Mox\" Moxon, an academically successful, rebellious backup quarterback * Jon Voight as Bud Kilmer, the Coyotes' 30-year head coach * Paul Walker as Lance Harbor, the original captain and starting quarterback of the Coyotes, and Jules's older brother * Amy Smart as Jules Harbor, Mox's girlfriend and Lance's younger sister * Ron Lester as Billy Bob, an overweight, powerful offensive guard * Scott Caan as Charlie Tweeder, a wild, hard partying wide receiver for the Coyotes * Eliel Swinton as Wendell Brown, the running back and one of three African American players on the team * Ali Larter as Darcy Sears, Lance's girlfriend and the head cheerleader * Richard Lineback as Joe Harbor, Lance's and Jules's father * Thomas F. Duffy as Sam Moxon, Mox's football-obsessed father * Joe Pichler as Kyle Moxon, Mox's younger brother who is into religion rather than football ==Reception== The movie opened at #1 at the United States' box office. It made $17.5 million in its opening week. Roger Ebert of the Chicago Sun-Times said in his review: \"Scenes work, but they don't pile up or build momentum.\" ==Awards== ; 1999 Teen Choice Awards * Choice Movie: Breakout Star — James Van Der Beek (won) * Choice Movie: Drama (nominated) * Choice Movie: Soundtrack ; 1999 MTV Movie Awards * Best Breakout Male Performance: James Van Der Beek (won) * Best Movie Song: Nice Guys Finish Last by Green Day (nominated) ; 2000 Blockbuster Entertainment Awards * Best Male Newcomer: James Van Der Beek (nominated) ==References== Category:1999 comedy-drama movies Category:1990s sports movies Category:American comedy-drama movies Category:American sports movies",
 "title": "Varsity Blues"
}