{
 "id": "716515",
 "text": "Stephen Joseph \"Steve\" Lukasik (March 19, 1931 – October 3, 2019) was an American physicist. He worked in multiple high-level defense and scientific related jobs for advancing the technologies for national defense.Dr. Steven Lukasik Oral History , U.S. Department of Defense, 17 January 2007. This official DOD history is one of three done with Lukasik, and where among other things, he mentions the impact on his career of seeing the Hiroshima coverage in the newspaper. All three histories combined with the copious listed Congressional Record testimony, articles, and curriculum vitae, provide the Wikipedia material.].Oral history interview with Stephen Lukasik. Charles Babbage Institute. Retrieved from the University of Minnesota Digital Conservancy, 1991.Stephen Lukasik Oral history, American Institute of Physics, 21 April 1987, updated in 2004. He was the second longest serving Director of DARPA - the Defense Advanced Research Projects Agency.Reddy credits Lukasik in 1971 with changing the direction of DARPA Internet development. “the thing that changed it was, Lukasik, in 1970, I think, was asking for, \"What great ideas are there? What are the new things that ought to be undertaken?\" An Interview with Dabbala Rajagopal Reddy at 24, 12 June 1991. Charles Babbage Institute.Oral history interview with Lawrence G. Roberts, University digital conservancy, 3 Apr 1989.An Interview with Edward Feigenbaum , Stanford University Computer Science Department, 1 Mar 1989.Arlington County Virginia, The Team Behind the Internet, 19 May 2011.Stephen Lukasik, “Why the ARPANET Was Built,” IEEE Annals of the History of Computing, Mar. 2011. He was also the first Chief Scientist of the Federal Communications Commission where he created its Office of Science and Technology and which facilitated the commercial deployment of new technology that included spread spectrum technology.Records of the Federal Communications Commission.Marcus,Early Civil Spread Spectrum History. He was born in Staten Island, New York. Lukasik died on October 3, 2019 in Fairfax, Virginia of respiratory failure at the age of 88. ==References== Category:1931 births Category:2019 deaths Category:American physicists Category:Scientists from New York City",
 "title": "Stephen J. Lukasik"
}