{
 "id": "71672",
 "text": "Kew Gardens or the Royal Botanic Gardens, Kew is a UNESCO World Heritage Site in the London Borough of Richmond upon Thames in the United Kingdom.UNESCO, \"Royal Botanical Gardens, Kew\"; retrieved 2012-4-20. Kew’s historic landscapes and buildings are a collection of gardens and parks and glasshouses.Royal Botanic Gardens (Kew). About World Heritage Status ; retrieved 2012-4-20. Kew has the world's largest collection of plant specimens, and is one of the most important centres of research in botany. Kew Gardens are open to visitors who pay to enter. ==History== Early work on the gardens started in the 17th century when King Henry VII built Richmond Lodge in the area. 16th & 17th Centuries: Royal Influences\" ; retrieved 2012-4-20. The land was a private royal garden until the Victorian era. In 1840, the Royal Botanic Garden was established.Kew, \"Questions in Parliament 1837-1840\" ; retrieved 2012-4-20. The great expansion of the British Empire in the 19th century brought an expanded interest in exotic plants, so the gardens expanded.Kew, \"1841 - 1885: The expansion of the Royal Botanic Gardens\" ; retrieved 2012-4-20. In the 20th century, the gardens continued to grow larger and even more important in plant science.Kew, \"Unification and expansion of the Gardens\" ; retrieved 2012-4-20. The gardens were named a UNESCO World Heritage Site in 2003. The Temperate glass house was fixed over 5 years. It opened again in 2018. ==Gallery== File:Kew Gardens 004.JPG|Orangerie at Kew File:Kew Mersekelt1.jpg|Temperate House at Kew File:Kew Gardens Alpine House.jpg|Alpine House at Kew File:Kew Gardens Water Lily House.jpg|Water Lily House at Kew File:Princess of Wales Conservatory, Kew Gardens - July 2009.jpg|Princess of Wales Conservatory at Kew File:Japanese gateway in spring, Kew Gardens - geograph.org.uk - 166671.jpg|Japanese garden at Kew in Spring == Related pages == *List of World Heritage Sites of the United Kingdom *List of botanical gardens ==References== ==Other websites== * Royal Botanic Gardens, Kew website * Millennium Seed Bank Project * Images and some highlights of Kew * BBC, Marianne North collection of plant paintings Category:World Heritage Sites in the United Kingdom Category:Botanical gardens in the United Kingdom Category:Buildings and structures in the London Borough of Richmond upon Thames",
 "title": "Kew Gardens"
}