{
 "id": "716787",
 "text": "John Bannister Goodenough (July 25, 1922 - June 25, 2023) was an American professor and solid-state physicist. He was a professor of mechanical engineering and materials science at University of Texas at Austin. He is known for his creation of the lithium-ion battery, which is used on cellphones such as iphones. ==Career== In 2014, he won the Charles Stark Draper Prize for his works on the lithium-ion battery. Charles Stark Draper Prize News, National Academy of Engineering. Retrieved March 1, 2015. In 2019, he was awarded the Nobel Prize in Chemistry with M. Stanley Whittingham and Akira Yoshino. At age 97, he is the oldest person to win a Nobel prize. His other works also focus on the field of magnetism. He was a Professor at The University of Texas at Austin. During his time there, he has worked on research on ionic conducting solids and electrochemical devices. He wanted to study fixing materials for batteries to help create electric vehicles and help end the use of fossil fuels. Goodenough discovered the polyanion class of cathodes. They showed that positive electrodes having polyanions, sulfates, create higher voltages than oxides because of the inductive effect of the polyanion. In 2011, Goodenough was honored with the National Medal of Science by President Barack Obama. ==Personal life== Goodenough was born in Jena, Germany, to American parents. During and after graduating from Yale University, Goodenough was a U.S. military meteorologist in World War II. He got a Ph.D. in physics from the University of Chicago. He became a researcher at MIT Lincoln Laboratory, and later the head of the Inorganic Chemistry Laboratory at the University of Oxford. He was married to Irene Wiseman from 1954 until her death in 2016. Goodenough turned 100 in July 2022.Podcast: For John Goodenough’s 100th birthday, Stereo Chemistry revisits a fan-favorite interview with the renowned scientist Goodenough died on June 25, 2023 in Austin, Texas at the age of 100. ==References== ==Other websites== *Faculty Directory at University of Texas at Austin *Array of Contemporary American Physicists *History of the lithium-ion battery, Physics Today, Sept. 2016 * by The Electrochemical Society, October 5, 2016 *Are Solid State Batteries about to change the world?, Joe Scott, November 2018, Goodenough and team research on more energy dense solid state Li-ion chemistry featured 3:35–12:45. * Pr John Goodenough's interview GOODENOUGH John B., 2001-05 - Sciences : histoire orale on École supérieure de physique et de chimie industrielles de la ville de Paris history of science website Category:1922 births Category:2023 deaths Category:American chemists Category:American inventors Category:Scientists from Massachusetts Category:American centenarians Category:Educators from Massachusetts Category:University of Texas faculty",
 "title": "John B. Goodenough"
}