{
 "id": "716987",
 "text": "Lightspeed is an American online fantasy and science fiction magazine. John Joseph Adams edits and publishes the magazine. The first issue was published in June 2010Klima, John. Tor.com Lightspeed Magazine #1 June 2010. It is published every month. The magazine publishes four new, original stories and four reprints in every issue. It also includes interviews with the authors and other nonfiction. All of the content published in each issue is sold as as an ebook and for free on the magazine's website. Lightspeed also makes a free podcast with some stories.SFFAudio.com Lightspeed Magazine will have a podcast! May 2010. Stefan Rudnicki produces the podcast. ==History== Lightspeed was started by publisher Sean Wallace of Prime Books with John Joseph Adams as editor.Locus Online. John Joseph Adams to Edit Lightspeed Oct. 2009 Wallace also published Fantasy Magazine. Adams also started to edit Fantasy Magazine from March 2011. Lightspeed became an SFWA-qualifying market in July 2011.Science Fiction & Fantasy Writers of America. Lightspeed Magazine is SFWA's newest qualifying market 2011. In November of 2011 Adams purchased Lightspeed and Fantasy Magazine from Wallace.Locus Online. John Joseph Adams Buys Lightspeed and Fantasy Nov. 2011 From January 2012 issue, both magazines were combined with the name Lightspeed. Fantasy Magazine stopped publishing.Locus Online. Lightspeed and Fantasy Merge Dec. 2011 The Fantasy Magazine staff was also absorbed into Lightspeed. In September 2013, Lightspeed published their first Special Issue. It was called \"Women Destroy Science Fiction\", an anthology entirely written and edited by women. Lightspeed got $53,136 from a Kickstarter to pay for the special issue. This was much more than their goal of $5,000. The additional funds allowed Lightspeed to publish further volumes, entitled \"Women Destroy Fantasy\" and \"Women Destroy Horror.\" ==Awards and recognition== Lightspeed was nominated for the Hugo Award for Best Semiprozine in 2011The Official Site for the Hugo Awards. 2011 Hugo Awards 2011 and 2012,The Official Site for the Hugo Awards. 2012 Hugo Awards 2012. and, 2013,The Official Site for the Hugo Awards. 2013 Hugo Awards and won the Hugo in 2014.The Official Site for the Hugo Awards. 2014 Hugo Awards In 2011 its podcast was awarded a Parsec award for Maggie Clark's \"Saying the Names.\" In 2010 two Lightspeed stories were finalists for the Nebula Award for Best Short Story: Adam-Troy Castro's \"Arvies\" and Vylar Kaftan's \"I'm Alive, I Love You, I'll See You in Reno.\" In 2011 \"Amaryllis\" by Carrie Vaughn was a finalist for the Hugo Award for Best Short story. Also in 2011, Adam-Troy Castro's \"Her Husband's Hands\" and Tom Crosshill's \"Mama, We are Zhenya, Your Son\" were finalists for the Best Short Story Nebula. Jake Kerr's \"The Old Equations\" was nominated for Best Novella. In 2012, Maria Dahvana Headley's \"Give Her Honey When You Hear Her Scream\" and Ken Liu's \"The Bookmaking Habits of Select Species\" were both finalists for the Best Short Story Nebula. In 2014, Ken Liu's \"The Litigation Master and the Monkey King\" and Christopher Barzak's \"Paranormal Romance\" were both finalists for the Best Novelette Nebula. In 2014, Matthew Kressel's \"The Sounds of Old Earth\" and Sylvia Spruck Wrigley's \"Alive, Alive Oh\" were both finalists for the Best Short Story Nebula. Some stories were nominated for the Theodore Sturgeon Award: Yoon Ha Lee's \"Flower, Mercy, Needle, Chain\" in 2011, Jake Kerr's \"The Old Equations\" in 2012, and Ken Liu's \"The Bookmaking Habits of Select Species\" in 2013 . Several stories from the magazine have been printed again in anthologies showing excellent writing: * The Year’s Best Science Fiction, edited by Gardner Dozois, \"Flower, Mercy, Needle, Chain\" by Yoon Ha Lee, \"In- Fall\" by Ted Kosmatka, and \"Amaryllis\" by Carrie Vaughn * The Year’s Best Science Fiction and Fantasy edited by Rich Horton, \"Arvies\" by Adam-Troy Castro, \"No Time Like the Present\" by Carol Emshwiller, \"Flower, Mercy, Needle, Chain\" by Yoon Ha Lee, and \"Standard Loneliness Package\" by Charles Yu * The Best Science Fiction and Fantasy of the Year edited by Jonathan Strahan, \"The Zeppelin Conductors' Society Annual Gentlemen's Ball\" by Genevieve Valentine * Year’s Best SF 16, edited by David G. Hartwell and Kathryn Cramer, \"How to Become a Mars Overlord\" by Catherynne M. Valente, and \"The Cassandra Project\" by Jack McDevitt ==References== ==Other websites== * Category:American monthly magazines Category:2010 establishments",
 "title": "Lightspeed (magazine)"
}