{
 "id": "716992",
 "text": "Nalo Hopkinson (born 20 December 1960) is a Jamaican-born Canadian speculative fiction writer and editor. She lives and teaches in Riverside, California.Mindy Farabee, \"Nalo Hopkinson's science fiction and real-life family\", Los Angeles Times, 21 March 2013. Her novels (Brown Girl in the Ring, Midnight Robber, The Salt Roads, The New Moon's Arms) and short stories such as those in her collection Skin Folk often use Caribbean history and language. Hopkinson's favorite writers include Samuel R. Delany, Tobias S. Buckell, and Charles Saunders. ==Awards== Hopkinson won the 1999 John W. Campbell Award for Best New Writer\"John W. Campbell Award for Best New Writer\", Writertopia. Retrieved 21 June 2011. and the Ontario Arts Council Foundation Award for Emerging Writers. Brown Girl in the Ring was nominated for the Philip K. Dick Award in 1998, and received the Locus Award for Best First Novel. Skin Folk received the World Fantasy Award and the Sunburst Award for Canadian Literature of the Fantastic in 2003. ==Writing== ===Novels=== * Brown Girl in the Ring (1998) * Midnight Robber (2000) * The Salt Roads (2003) * The New Moon's Arms (2007) * The Chaos (2012) (Young adult fiction) * Sister Mine (2013) ===Collections and anthologies=== * Whispers from the Cotton Tree Root: Caribbean Fabulist Fiction (2000, anthology) * Skin Folk (2001) (short stories) * Mojo: Conjure Stories (2003, anthology) * So Long Been Dreaming (2004, anthology) * Report From Planet Midnight (2012) (short stories, interview and speech) * Falling in Love With Hominids (2015) (short stories) ===Short fiction=== * \"Slow Cold Chick\" in anthology Northern Frights 5 (1998) * \"A Habit of Waste\" in anthology Women of Other Worlds: Excursions through Science Fiction and Feminism (1999) * \"Precious\" in anthology Silver Birch, Blood Moon (1999) * \"The Glass Bottle Trick\" in anthology Whispers From the Cotton Tree Root: Caribbean Fabulist Fiction (2000) * \"Greedy Choke Puppy\" and \"Ganger (Ball Lightning)\" in anthology Dark Matter: A Century of Speculative Fiction From the African Diaspora * \"Midnight Robber\" (excerpt from novel) reprinted in Young Bloods: Stories from Exile 1972–2001 (2001) * \"Delicious Monster\" in anthology Queer Fear II (2002) * \"Shift\" in journal Conjunctions: the New Wave Fabulists. * \"Herbal\" in The Bakkanthology * \"Whose Upward Flight I Love\" reprinted in African Voices * \"The Smile on the Face\" in anthology Girls Who Bite Back: Witches, Mutants, Slayers and Freaks (2004) === Comic Book Series === * The Sandman Universe: House of Whispers (DC/Vertigo) (2018- ) ==References== ==Further reading== * ==Other websites== * * ;Bibliographies * Bibliography on Scifan.com * Biography, bibliography, & appreciation by G. E. Rutledge ;Interviews * \"Nalo Hopkinson: As Magic Does\" excerpt from Locus interview (2013) * \"Nalo Hopkinson's science fiction and real-life family\" by Mindy Farabee at the L.A. Times (2013) * Interview on SFFWorld.com * Interview on Locus * \"Nalo Hopkinson uses SF to probe the inner and outer worlds of alienation\" by David Soyka on SciFi.com (2001) * A Conversation With Nalo Hopkinson on the SF Site * Avni Sejpal, \"Waving at Trains: An interview with Nalo Hopkinson\", Boston Review, October 18, 2017 Category:1960 births Category:Living people Category:Canadian LGBT writers Category:People from Kingston, Jamaica",
 "title": "Nalo Hopkinson"
}