{
 "id": "71705",
 "text": "Dell Inc. is a private company that makes laptop and desktop computers and computer accessories. It was formed in 1984. It is named after Michael Dell, the CEO and creator of the company. Dell makes computers for businesses and home users, and they also make computer monitors and Printers. They used to make portable music players, called the Dell DJ, and PDAs too. Their company is in Round Rock, Texas. In 2006, they employed over 78,000 people. Some of their computers have a Linux operating system. Most computers for consumer usage will come with Microsoft Windows. == History == Michael Delle — Founder of the Company. Founded by Michael Delle, in 1984 in the city of Austin (Texas) as PC Limited, since 1988 — Dell Computer, after 2003 — Dell, Inc. In 1987, Dell entered the European market, in 1994 they went to the market of the Asia-Pacific region. In 2005, Fortune called Dell \"the company causing the greatest admiration in the United States\" (in the world ranking Dell was third place). The growth rates of profit and sales volumes of the late 1990's to the early 2000's significantly exceeded industry indicators. In 2013, Michael Dell at the expense of its own funds and funds provided by the investment company Silver Lake Partners, for $25 billion bought a controlling stake in the company from the exchange, 75% of the company passed under the control of Dell. === Mergers and acquisitions === Dell acquired Perot Systems, Ross Perot's IT infrastructure services company, for approximately $3.9 billion. On October 12, 2015, the American corporation Dell signed an agreement to acquire EMC for $67 billion, which is the largest deal in the history of the IT industry. On September 7, 2016, the acquisition of EMC was completed, the acquired EMC became part of the updated Dell Technologies Corporation as a subsidiary with the name \"Dell EMC\", moreover, it is planned to transfer Dell units involved in the sale of corporate servers to this business unit, data storage systems and some others related to the corporate market. == Other websites == * Dell website Category:1984 establishments in the United States Category:1980s establishments in Texas Category:American computer hardware manufacturers Category:Companies based in Texas",
 "title": "Dell"
}