{
 "id": "71717",
 "text": "The Simpsons shorts is a series of one-minute television shorts that ran on the variety show The Tracey Ullman Show for three seasons. The shorts were created by cartoonist Matt Groening. == Season 1: 1987 == # Airdate Title 1 - 101 April 19, 1987 \"Good Night\" Marge and Homer say goodnight to their kids but all does not go to plan. Bart philosophically contemplates (first time and last) the wonders of the mind, Lisa hears Marge say \"don't let the bed bugs bite\" and fears that her bed bugs will eat her, and Maggie is traumatized by the lyrics of \"rock-a-bye-baby\" 2 - 102 May 3, 1987 \"Watching TV\" Bart and Lisa quarrel over what channel they should watch. Repeatedly Maggie comes up to the television and changes the channel. The only thing they eventually agree on is to stop Maggie changing the channel. Later Homer is saying a speech about family matters and stops when the show comes back on. 3 - 103 May 10, 1987 \"Jumping Bart\" Homer makes several attempts to have Bart jump into his arms. Each time Bart jumps Homer is distracted and fails to catch him. 4 - 104 May 31, 1987 \"Babysitting Maggie\" Marge puts Bart and Lisa in charge of babysitting Maggie. They totally ignore her, and she receives an electric shock, falls down the stairs and chases a butterfly onto the roof only to fall off the roof. 5 - 105 June 21, 1987 \"The Pacifier\" Bart and Lisa take Maggie's pacifier away to stop her from sucking on it. Maggie has an entire drawerful of them and refuses to kick the habit. 6 - 106 June 28, 1987 \"Burping Contest\" Bart, Lisa and Maggie compete in a contest to see who can make the most disgusting burp. Marge objects several times, but was no use. When Homer comes home, he makes the most disgusting burp ever. The kids then congratulate him, much to Marge's disapproval. 7 - 107 July 12, 1987 \"Dinnertime\" Marge serves the family dinner and the family sits down for the meal. Marge insists that family should have table manners, but the family's crude eating habits are hard to stop. == Season 2: 1987-1988 == # Airdate Title 8 - 201 September 22, 1987 \"Making Faces\" The kids make scary faces at each other. Marge warns them that if they make scary faces, the faces will stay there forever. This warning has the opposite effect. 9 - 202 October 4, 1987 \"The Funeral\" Uncle Hubert is dead and the family attends his funeral. Bart is determined to see his uncle's corpse, but faints when he glances into the coffin. 10 - 203 October 11, 1987 \"What Maggie's Thinking\" Bart and Lisa wonder what's inside Maggie's mind when looking at her in her crib. Maggie sees them as demons and later as infants with her being the grown up. 11 - 204 October 18, 1987 \"Football\" Homer promises the kids chocolate milkshakes if Bart can catch one of his father's long football passes. Unfortunately, there are many obstacles to overcome, but Bart finally manages to catch the football, only with his mouth. 12 - 205 October 25, 1987 \"House of Cards\" Bart tries to make a house of cards, but Lisa and Maggie make noises that cause the house to fall every time. 13 - 206 November 1, 1987 \"Bart and Homer's Dinner\" The girls are out watching a ballet and Homer is in charge of the dinner. Bart cannot stomach it when he is forced to eat a mix of fish nuggets and pork-a-roni. 14 - 207 November 8, 1987 \"Space Patrol\" Bart, Lisa and Maggie play a game of \"Space Patrol\" while Homer and Marge are out. Lisa plays a superhero with Maggie as her sidekick, while Bart puts a jug on his head with the pretense of it being the helmet of an alien warlord. However, his head gets stuck in the jug and Lisa \"frees\" Bart using a croquet mallet. 15 - 208 November 15, 1987 \"Bart's Haircut\" Bart's hair is too long and he is sent to a barber. His hair cut is too short and he tries multiple ways to hide it. 16 - 209 November 22, 1987 \"World War III\" Homer wakes up the family to practice for a nuclear drill. After multiple drills the family gets tired of him and traps him in the basement. 17 - 210 December 13, 1987 \"The Perfect Crime\" Marge bakes a batch of delicious cookies and Bart attempts to steal them, when everyone except him and Maggie leave the kitchen. Homer and Marge come back to find the tray empty, but Maggie guides them along a trail of cookies running across the floor. The family catches Bart lying on his back in his bedroom amidst a pile of cookie crumbs. 18 - 211 December 20, 1987 \"Scary Stories\" Bart tells Lisa and Maggie a series of scary stories in the dark only to believe they're coming true. 19 - 212 January 10, 1988 \"Grampa and the Kids\" Grampa tells the kids stories from the good old days. When the kids stop paying attention to him, he feigns his own death to recapture their attention. The short marks the first speaking appearance of Abraham Simpson. 20 - 213 January 24, 1988 \"Gone Fishin'\" Bart and Homer go on a fishing trip. Homer asks Bart for a bologna sandwich, but Bart forgot the bologna. He puts the bait on the sandwich instead. When they get the boat in the water they hit rapids and later fall off of a waterfall. 21 - 214 February 7, 1988 \"Skateboarding\" Bart teaches his sisters how to skateboard, but is outdone every time he tries to show off. 22 - 215 February 14, 1988 \"The Pagans\" When the family is on their way to church, the kids declares themselves pagans. After the car breaks down in the nature, the kids start acting like pagans much to Homer's disliking. 23 - 216 February 21, 1988 \"Closeted\" Bart tries to avoid to doing chores and ends up hiding in the closet. He finds himself locked in and must find a way to bust out. 24 - 217 February 28, 1988 \"The Aquarium\" Homer takes Bart, Lisa and Maggie to the aquarium. Bart finds a way to get into the shark tank and swims with a shark. 25 - 218 March 6, 1988 \"Family Portrait\" Homer has trouble taking a normal family portrait. Every time they are close to a good picture the family sabotages the shot. 26 - 219 March 13, 1988 \"Bart's Hiccups\" Lisa and Maggie try to cure Bart's hiccups. The cure is some rather unorthodox methods. 27 - 220 March 20, 1988 \"The Money Jar\" Marge warns the kids that they should not steal from the money jar. Bart, Lisa and Maggie tries to fight the temptation of stealing the money. 28 - 221 May 1, 1988 \"The Art Museum\" The Simpsons go to an art museum. Bart stares at a nude painting and Lisa plays with an ancient vase. Marge realizes that the kids are too young to appreciate fine arts. 29 - 222 May 8, 1988 \"Zoo Story\" The family goes to the zoo and find a lot of similarities between them and the monkeys. Homer unwisely teases a monkey at the zoo and gets a face full of poo for his trouble. == Season 3: 1988-1989 == # Airdate Title 30 - 301 November 6, 1988 \"Shut Up, Simpsons\" Maggie squeaks her toy, which causes a chain reaction of anger in the family. An attempt for reconciliation leads to even more anger. 31 - 302 November 13, 1988 \"Shell Game\" Bart tries to hide one of the cookies he stole from the jar by distracting his parents with the shell game. Although his plan seems to succeed, he is bested by Maggie, who then eats the cookie. 32 - 303 November 20, 1988 \"The Bart Simpson Show\" The kids are watching TV and Homer tells them to stop watching \"Itchy and Scratchy\" because it's \"too violent\".Unable to watch cartoons Bart puts on his own show, which eventually angers Homer even more. Note: First appearance of Itchy and Scratchy. 33 - 304 November 27, 1988 \"Punching Bag\" Bart and Lisa take out their frustrations on a punching bag with a face of Homer on it. When Homer commands Marge to make the kids stop, he later finds her punching the bag. Nte: This is the first time Homer says D'oh. 34 - 305 December 18, 1988 \"Simpson Christmas\" Bart tells a story of a traditional Christmas in the Simpson family in the style of \"The Night Before Christmas\". 35 - 306 January 1, 1989 \"The Krusty the Clown Show\" The kids get to see Krusty's show live for the first time. Bart notices that it is an impostor and exposes it on television, much to his parents' dismay. Note: First appearance of Krusty the Clown. 36 - 307 January 29, 1989 \"Bart the Hero\" Sent out to exercise, Bart foils a robbery attempt. 37 - 308 February 5, 1989 \"Bart's Little Fantasy\" After the kids are ordered to clean their room by Homer and Marge; Bart tells a story about large kids who throw their small parents into a small room. 38 - 309 February 12, 1989 \"Scary Movie\" Bart, Lisa and Maggie go to the movie to see \"The Return of the Happy Little Elves\" (much to Bart's dismay), but Bart convinces the girls to see \"Revenge of the Space Mutants\" instead. However, Bart ends up being scared by it, and Lisa and Maggie attempted to comfort him. 39 - 310 February 19, 1989 \"Home Hypnotism\" Homer tries hypnosis to calm down his crazy kids. 40 - 311 February 26, 1989 \"Shoplifting\" Bart tries to steal chocolate from the Supermarket, but gets caught. 41 - 312 March 12, 1989 \"Echo Canyon\" The family drives to Echo Canyon, takes turns making echoes, and Bart almost makes a boulder crunch the family car. 42 - 313 March 19, 1989 \"Bathtime\" Homer makes Bart take his \"Sunday Night Bath\", only to flood the bathroom. At that rate, Homer angrily goes after Bart. 43 - 314 April 2, 1989 \"Bart's Nightmare\" In this sequel to \"Shell Game\", Bart has a nightmare after eating every single cookie from the cookie jar. 44 - 315 April 16, 1989 \"Bart of the Jungle\" The kids swing from the trees off Homer's ties, and Homer, who is angered by this, ends up being in their trap made by his ties. 45 - 316 April 23, 1989 \"Family Therapy\" Homer takes the family to a psychologist, but to no avail. * 46 - 317 April 30, 1989 \"Maggie in Peril (Chapter One)\" After Maggie accidentally kicks her ball on Bart's face, he kicks it out of sight and she takes off to retrieve it back. (To be Continued...) 47 - 318 May 7, 1989 \"Maggie in Peril (The Thrilling Conclusion)\" Part 2. Maggie floats in the air hanging on to balloons and lands safely back in her playpen. 48 - 319 May 14, 1989 \"TV Simpsons\" Homer attempts to fix the television antenna on the roof, but he ends up falling from the roof. ==Related pages== * The Simpsons * The Tracey Ullman Show == References == Category:The Simpsons",
 "title": "The Simpsons shorts"
}