{
 "id": "7172",
 "text": "{{Infobox U.S. state symbols |Name = Washington, D.C. |Bird = Wood Thrush |Tree = Scarlet Oak |Flower = American Beauty rose |Beverage = Rickey |Dinosaur = Capitalsaurus |Food = Cherry |Rock = Potomac bluestone |Slogan = Federal City |Route Marker = |Quarter = File:2009 DC Proof.png |QuarterReleaseDate = 2009 }} Washington, D.C. (also known as simply Washington or D.C., and officially as the District of Columbia) is the capital of the United States. It is a federal district. The President of the United States, the United States Congress, the United States Supreme Court and many major national government offices are in the territory. This makes it the political center of the United States of America. Washington was named after the first U.S. President George Washington. \"D.C.\" stands for \"District of Columbia\". At first, it was made up of a piece from Virginia south of the Potomac River and a piece from Maryland north of the Potomac River. In 1847, Virginia's piece was returned to it, and is now Arlington County and part of the city of Alexandria. Since 1847, all of the District of Columbia is on the north side of the Potomac River. The District of Columbia used to have other small towns which used \"D.C.\". Since 1800, the District of Columbia has been the home of all three branches of the U.S. government: Congress, the President, and the Supreme Court. All of the major political parties are based here. It is also the headquarters of the World Bank, the International Monetary Fund (IMF), and the Organization of American States (OAS). Because it is the home of the President and is important to American politics, many groups often hold large demonstrations and protests here. These are often at the National Mall, a large open park which has many monuments and museums. The District of Columbia’s many museums and monuments make it a popular place for tourists to visit. In 2020, the United States Census Bureau said that 689,545 people lived within the District of Columbia. == History == When English people first came to the area, there was a Native American village on the spot called Nakochtank. This name survives in the name of the Anacostia River. This river was known for the healing properties of its pure water and it is recorded that the Emperor Powhatan, who lived in what is now Richmond, Virginia, made the trip all the way to Nakochtank once for this reason. The 1789 United States Constitution said that a capital city would be created in a district, but did not say where it should be. James Madison and others thought it should be far away from other states and cities. This way, it would be independent and not controlled by any state. In 1790, a compromise was reached and capital was placed between Virginia and Maryland. It was a square, ten miles (16 km) long on each side, and split by the Potomac River, which separated the two states. Half of the district was in Maryland and the other half was in Virginia, and the two states gave this land to the government. In 1791, it was named Washington, the District of Columbia to honor George Washington. Columbia was another name for North America. During the War of 1812, the British burned down many government buildings, including the White House. == City design == Washington, D.C. was planned before it was built. Pierre L'Enfant drew a plan for the city that said where all the streets, parks, and important buildings would be. Unlike most cities in the United States, D.C. has many roundabouts or traffic circles. The city was supposed to have long and wide avenues, and many open spaces for monuments and parks. The National Mall is an example of this. == Representation == === Local Government === Washington, D.C. is not a state. Its citizens have less control over their city than most Americans, but D.C. has had an elected mayor and a city council since 1973. But Congress can make it so that a local law doesn't happen. The current mayor of Washington, D.C. is Muriel Bowser, a Democrat. === In Congress === The license plates on the cars in Washington, D.C. say, \"Taxation Without Representation.\" This is a protest from people who live in Washington, D.C. about having to pay taxes to the United States without having a vote in the United States House of Representatives. It resembles the protest made by colonists before the American Revolution about having to pay taxes to Great Britain. Some people are against letting Washington, D.C. have a Congressman or Congresswoman because the Constitution only allows states to have Congressmen or Congresswomen. == Culture == === Performing arts and music === Washington, D.C. is the center of the nation for its arts. The National Symphony Orchestra, the Washington National Opera, and the Washington Ballet are all inside the John F. Kennedy Center for the Performing Arts. The Kennedy Center Honors are given every year to the people who have greatly helped the cultural life of the United States. The President and First Lady usually go to the Honors ceremony. === Museums === There are also many museums and memorials in Washington, D.C.. The Smithsonian runs many museums. == Geography == === Climate === Washington D.C. has a humid subtropical climate (Köppen climate classification: Cfa). Summers are hot and humid, winters are cool to cold, and spring and fall are mild. The average yearly precipitation is fairly high at , and is regular throughout the year. Snow falls a few times each winter, and sometimes in spring and fall, which is usually light and lasts no longer than a few days. Blizzards do occur, but not every winter. The city gets many summer heat waves that can last for many days, and less commonly winter cold waves that usually last for a few days. ==Media== As the national capital of the United States, Washington, D.C. has numerous media outlets in various mediums. Some of these media are known throughout the United States, including The Washington Post and various broadcasting networks headquartered in D.C. ===Newspapers=== The Washington Post is a daily newspaper in Washington, D.C. The Washington Post was awarded the Pulitzer Prize for its reporting on the Watergate scandal in 1973. The Washington Post Company has multiple media holdings, including a daily free newspaper called the Express, the Washington Post News Service with Bloomberg News, Fashion Washington, El Tiempo Latino (a Spanish-language publication), the Slate Group, The Daily Herald (in Washington state), as well as the education company Kaplan, Inc. The Washington Post emphasizes national and political news coverage but also covers regional and local stories. Headquartered in downtown Washington, the newspaper employs journalists at 11 regional bureaus in Maryland and Virginia and 14 international bureaus. Content is shared across titles within the Washington Post Company, and the Express, in particular, often reprints content from the Associated Press, Getty Images, and other wire sources.Kristine Gloria and Kara Hadge, \"An Information Community Case Study: Washington, DC, \" Washington, DC: New America Foundation, 2010, http://mediapolicy.newamerica.net/publications/policy/an_information_community_case_study_washington_dc . Retrieved 9 Sept. 2010. Washington Times and Washington City Paper also have substantial readership in the District. On February 1, 2005, the free daily tabloid Washington Examiner debuted, having been formed from a chain of suburban newspapers known as the Journal Newspapers. Washington Blade and Metro Weekly focus on gay issues and the Washington Sun, the Washington Informer, and also Washington Afro on African American issues. Bi-weekly Street Sense focuses on issues of homelessness poverty, and life on the streets. Other special-interest papers include Roll Call, a daily paper focused on politics. Many neighborhoods in the District have their own community newspapers. Some of these include The Current Newspapers, which has editions serving Dupont Circle, Foggy Bottom, Georgetown, Chevy Chase and Upper Northwest, and a Capitol Hill paper called The Capitol Hill Current/Voice of the Hill. Additional papers include In-Towner (Dupont Circle, Logan Circle and Adams Morgan), Hill Rag (Capitol Hill), East of the River (Anacostia) and D.C. North (Northeast D.C.). In addition, several specialty newspapers serve the U.S. Congress; most notable are Roll Call, The Hill, and Politico. ===Television=== As of 2008, the Washington Metropolitan Area was the 9th largest designated market area in the United States, with 2,321,610 television homes (2.028% of the U.S. population). The following is a list of television stations serving the metro area: Columbus Digital Channel Digital Subchannel Analog Channel Callsign Network City of License Notes 4 (Virtual); 48 4.1 - WRC-TV NBC Washington, D.C. - 4 (Virtual); 48 4.2 - WRC-TV Cozi TV Washington, D.C. 5 (Virtual); 36 5.1 - WTTG-TV Fox Washington, D.C. - \\- - 6 WDCN-LP - Fairfax, Virginia Spanish audio only 7 7.1 - WJLA-TV ABC Washington, D.C. Broadcasts from Arlington, Virginia 7 7.2 - WJLA-TV MeTV Washington, D.C. Broadcasts from Arlington, Virginia 7 7.3 - WJLA-TV Live Well Network Washington, D.C. Broadcasts from Arlington, Virginia 9 9.1 - WUSA-TV CBS Washington, D.C. - 9 9.2 - WUSA-TV Bounce TV Washington, D.C. 14 (Virtual); 15 15.1 - WFDC-DT Univision Arlington, Virginia Broadcasts from Washington 20 (Virtual); 35 20.1 - WDCA MyNetworkTV Washington, D.C. - 22 (Virtual); 42 22.1 - WMPT PBS Annapolis, Maryland - 22 (Virtual); 42 22.2 - WMPT - Annapolis, Maryland MPT2 22 (Virtual); 42 22.3 - WMPT V-me Annapolis, Maryland - \\- - 23 WDDN-LD Daystar Washington, D.C. - \\- - 25 WZDC-CD Telemundo Washington, D.C. - 26 (Virtual); 27 26.1 - WETA-TV PBS (HD) Washington, D.C. Broadcasts from Arlington, Virginia 26 (Virtual); 27 26.2 - WETA-TV Create Washington, D.C. Broadcasts from Arlington, Virginia 26 (Virtual); 27 26.3 - WETA-TV - Washington, D.C. WETA Kids Channel; Broadcasts from Arlington, Virginia 26 (Virtual); 27 26.4 - WETA-TV PBS (SD) Washington, D.C. Broadcasts from Arlington, Virginia 30 (Virtual); 24 30.1 - WNVC MHz Worldview Fairfax, Virginia Broadcasts from Falls Church, Virginia 30 (Virtual); 24 30.2 - WNVC NHK World Fairfax, Virginia Broadcasts from Falls Church, Virginia 30 (Virtual); 24 30.3 - WNVC Metro Chinese Network Fairfax, Virginia Broadcasts from Falls Church, Virginia 30 (Virtual); 24 30.4 - WNVC RT (English) Fairfax, Virginia Broadcasts from Falls Church, Virginia 30 (Virtual); 24 30.5 - WNVC Al Jazeera English Fairfax, Virginia Broadcasts from Falls Church, Virginia 30 30.6 - WNVT Euronews/VTV4 Goldvein, Virginia Broadcasts from Falls Church, Virginia 30 30.7 - WNVT France 24 Goldvein, Virginia Broadcasts from Falls Church, Virginia 30 30.8 - WNVT RT (Spanish) Goldvein, Virginia Broadcasts from Falls Church, Virginia 30 30.9 - WNVT Arirang Goldvein, Virginia Broadcasts from Falls Church, Virginia 30 30.10 - WNVT ETV Goldvein, Virginia Broadcasts from Falls Church, Virginia 32 (Virtual); 33 32.1 - WHUT-TV PBS (HD) Washington, D.C. Howard University 32 (Virtual); 33 32.2 - WHUT-TV PBS (SD) Washington, D.C. Howard University 47 (Virtual); 8 47.1 - WMDO-CA UniMás Washington, D.C. - 47 (Virtual); 8 47.2 - WMDO-CA LATV Washington, D.C. - 50 50.1 - WDCW-TV CW Washington, D.C. - 50 50.2 - WDCW-TV Antenna TV Washington, D.C. - 50 50.3 - WDCW-TV This TV Washington, D.C. - \\- - 58 WIAV-LD AsiaVision Washington, D.C. Broadcasts from Greenbelt, Maryland 66 (Virtual); 43 66.1 - WPXW-TV ION Manassas, Virginia Broadcasts from Fairfax Station, Virginia 66 (Virtual); 43 66.2 - WPXW-TV qubo Manassas, Virginia Broadcasts from Fairfax Station, Virginia 66 (Virtual); 43 66.3 - WPXW-TV ION Life Manassas, Virginia Broadcasts from Fairfax Station, Virginia Most Baltimore area television stations can be seen in the Washington region. Besides being viewed clearly in the District, they can especially be seen in the suburbs of the Interstate 95 corridor between both cities. They are: WMAR 2 (ABC), WBAL 11 (NBC), WJZ 13 (CBS), WMPT 22 / WMPB 67 (PBS/MPB), WUTB 24 (MyNetwork TV), WBFF 45 (FOX), and WNUV 54 (The CW). A DC-MD-VA regional news station, TBD TV, is carried on Channel 8 on all cable systems in Washington, D.C. and surrounding communities. Public, educational, and government access (PEG) on cable television is provided by the Public Access Corporation of the District of Columbia on two channels simulcast to both local cable television systems. One channel is devoted to religious programming and the other channel provides a diversity of offerings. The District's two Public, educational, and government access (PEG) Channels are DCTV, a non-profit media outlet that provides training and production opportunities to local residents, and OCT TV-16, which provides information about government programs, services, and related opportunities. Major national broadcasters and cable outlets including NBC, ABC, CBS, FOX, and CNN maintain a significant presence in Washington, as do those from around the world including the BBC, CBC, and Al Jazeera. The Public Broadcasting Service (PBS) is headquartered in Arlington, Virginia. Also, several cable television networks have their headquarters in the Washington area, including: * BET * C-SPAN * Discovery Channel in Silver Spring, Maryland * National Geographic Channel * Travel Channel in Chevy Chase, Maryland ===Radio=== As of 2008, the Washington Metropolitan Area was the 9th largest radio market in the United States with a Metro 12+ Population of 4,238,100. The following is a list of radio stations serving the metro area: ===AM=== Frequency Callsign Format City of License Notes 540 WGOP Adult Standards/MOR Pocomoke City, Maryland Broadcasts from Damascus, Maryland 570 WSPZ Sports Bethesda, Maryland Broadcasts from Rockville, Maryland 630 WMAL News/Talk Washington, D.C. - 730 WTNT Talk Alexandria, Virginia Broadcasts from Rockville, Maryland 780 WAVA Christian Arlington, Virginia - 900 WILC Spanish Contemporary Laurel, Maryland - 950 WCTN Spanish Contemporary Potomac, Maryland - 980 WTEM Sports Washington, D.C. ESPN Radio; Broadcasts from Rockville, Maryland 1030 WWGB Spanish Christian Indian Head, Maryland Broadcasts from Suitland, Maryland 1050 WZAA News/Talk Silver Spring, Maryland Broadcasts from Washington 1120 WUST World Ethnic Washington, D.C. Broadcasts from Falls Church, Virginia 1160 WMET Variety Gaithersburg, Maryland Broadcasts from Silver Spring, Maryland 1220 WFAX Christian Falls Church, Virginia - 1260 WWRC News/Talk Washington, D.C. Broadcasts from Rockville, Maryland 1310 WDCT Korean Fairfax, Virginia - 1340 WYCB Urban Gospel Washington, D.C. Broadcasts from Lanham, Maryland 1390 WZHF News Arlington, Virginia Voice of Russia English language service; Broadcasts from Rockville, Maryland 1450 WOL News/Talk Washington, D.C. Broadcasts from Lanham, Maryland 1460 WKDV Spanish Variety Manassas, Virginia - 1480 WPWC Mexican Regional Dumfries, Virginia Broadcasts from Woodbridge, Virginia 1500 WFED News/Talk Washington, D.C. - 1540 WACA Spanish Contemporary Wheaton, Maryland - 1560 WKIK Country La Plata, Maryland Broadcasts from Mechanicsville, Maryland 1580 WJFK News/Talk Morningside, Maryland Broadcasts from Lanham, Maryland 1600 WLXE Spanish Rockville, Maryland - ===FM=== Frequency Callsign Format City of License Notes 88.1 WMUC-FM Freeform College Park, Maryland UMD college radio 88.5 WAMU News/Talk Washington, D.C. NPR 89.3 WPFW Jazz Washington, D.C. - 90.1 WCSP-FM News/Talk Washington, D.C. C-SPAN 90.9 WETA Classical Washington, D.C. Broadcasts from Arlington, Virginia 91.9 WGTS Contemporary Christian Takoma Park, Maryland - 92.7 WWXT Sports Prince Frederick, Maryland Repeater of WTEM 93.9 WKYS Urban Contemporary Washington, D.C. Broadcasts from Lanham, Maryland 94.7 WIAD Hot Adult Contemporary Bethesda, Maryland Broadcasts from Silver Spring, Maryland 95.5 WPGC-FM Rhythmic CHR Morningside, Maryland Broadcasts from Lanham, Maryland 96.3 WHUR-FM Urban Adult Contemporary Washington, D.C. - 97.1 WASH-FM Adult Contemporary Washington, D.C. Broadcasts from Rockville, Maryland 98.7 WMZQ-FM Country Washington, D.C. Broadcasts from Rockville, Maryland 99.1 WNEW-FM News/Talk Bowie, Maryland Broadcasts from Lanham, Maryland 99.5 WIHT Pop CHR Washington, D.C. Broadcasts from Rockville, Maryland 100.3 WBIG-FM Classic Hits Washington, D.C. Broadcasts from Rockville, Maryland 101.1 WWDC Alternative Rock Washington, D.C. Broadcasts from Rockville, Maryland 102.3 WMMJ Urban Adult Contemporary Bethesda, Maryland Broadcasts from Lanham, Maryland 103.5 WTOP-FM News Washington, D.C. - 104.1 WPRS-FM Urban Gospel Waldorf, Maryland Broadcasts from Lanham, Maryland 105.1 WAVA-FM Contemporary Christian Arlington, Virginia - 105.9 WMAL-FM News/talk Woodbridge, Virginia Broadcasts from Washington 106.7 WJFK- FM Sports Manassas, Virginia Broadcasts from Fairfax, Virginia 107.3 WRQX Pop CHR Washington, D.C. - 107.9 WLZL Spanish Tropical Annapolis, Maryland - == Transportation == According to a 2010 study, Washington-area commuters spent 70 hours a year in traffic delays, which tied with Chicago for having the nation's worst road congestion. However, 37% of Washington-area commuters take public transportation to work, the second-highest rate in the country. An additional 12% of D.C. commuters walked to work, 6% carpooled, and 3% traveled by bicycle in 2010. Washington has very few freeways. The funds that had been dedicated for freeway construction were instead redirected to the region's public transportation infrastructure. The interstate highways that do continue into Washington, including Interstate 66 and Interstate 395, both terminate shortly upon entering the city. The Washington Metropolitan Area Transit Authority (WMATA) operates the Washington Metro, the city's rapid transit system, as well as Metrobus. Both systems serve the District and its suburbs. Metro opened on March 27, 1976 and presently consists of 86 stations and of track. With an average of about one million trips each weekday, Metro is the second-busiest rapid transit system in the country, after the New York City Subway. Metrobus serves over 400,000 riders each weekday, making it the nation's sixth-largest bus system. The city also operates its own DC Circulator bus system, which connects commercial areas within central Washington. Union Station is the main train station in Washington, D.C., and handles about 70,000 people each day. It is Amtrak's second-busiest station with 4.6 million passengers annually and serves as the southern terminus for the Northeast Corridor and Acela Express routes. Maryland's MARC and Virginia's VRE commuter trains and the Metrorail Red Line also provide service into Union Station. Expansion plans announced in 2011 will make Union Station the city's primary intercity bus transit center. A new streetcar system opened in 2016. Three major airports serve The District. The Ronald Reagan Washington National Airport is across from downtown Washington in Arlington, Virginia and has its own Metrorail station. Major international flights arrive and depart from Washington Dulles International Airport, west of the District in Fairfax and Loudoun counties in Virginia. Dulles gained its own Metrorail station in 2016. Baltimore/Washington International Thurgood Marshall Airport is northeast of the District in Anne Arundel County, Maryland. == References == == Other websites == * * Guide to Washington, D.C., materials from the Library of Congress Category:United States capital cities Category:1790 establishments in the United States",
 "title": "Washington, D.C."
}