{
 "id": "7174",
 "text": "The president of the United States (POTUS) is the head of state and head of government of the United States of America and the commander-in-chief of the United States Armed Forces. The president is also the head of the executive branch of the federal government of the United States and is the chairman of the presidential cabinet. Donald J. Trump is the 47th and current president of the United States, in office since January 2025. == Eligibility and requirements == Article II, Section 1, Clause 5 of the constitution states for a person to serve as president must: * be a natural-born citizen of the United States. Foreign-born American citizens who met the age and residency requirements at the time the Constitution was adopted were also eligible for the presidency. However, this allowance has since become obsolete. * be at least thirty-five years old. * be a permanent resident in the United States for at least fourteen years. ==Election process and presidential terms== The president is elected by the people through the Electoral College to a four- year term, along with the vice presidential candidate or the incumbent vice president as their running mate.Our Government • The Executive Branch , The White House. The presidential candidate or incumbent president must have at least 270 electoral college votes in order to win the election. Under the Twenty-second amendment to the constitution prevents anyone from being elected president more than twice. This amendment was added after Franklin Roosevelt served four terms from 1933 until his death in 1945. == President-elect of the United States == The president-elect of the United States is the candidate who has won the United States presidential election and is awaiting inauguration to become the president. ==Presidential Inauguration== The president-elect and vice president-elect immediately began their four-year team on inauguration day every four years on January 20. The original inauguration date was held on March 4, but was later changed in 1933. == Executive Office of the President == The Executive Office of the President consists of the offices and agencies that support the work of the president at the center of the executive branch of the U.S. federal government. The office consists of several offices and agencies, such as the White House Office, the staff working directly for and reporting to the president, including White House staff, the National Security Council and the Office of Management and Budget. ==Presidential line of succession== If the president dies, resigns, or is impeached, the vice president will succeed the presidential office and duties. fifteen other federal government officials also rank in the succession of the president. Abraham Lincoln, James A. Garfield, William McKinley, and John F. Kennedy were assassinated while in office. William Henry Harrison, Zachary Taylor, Warren G. Harding and Franklin Roosevelt died from illness while president. Calvin Coolidge became president, when Warren G. Harding died while in office. Richard Nixon is the only U.S. president to have resigned from office. Andrew Johnson, Bill Clinton, and Donald Trump are the only presidents to have been impeached. == Travel and Transportation == == Residences == The White House is the official residence of the president and the first family of the United States. it has been the official residence of every U.S. president since John Adams in 1800. Camp David is the official presidential retreat residence if the president decides to go on vacation along with his family. Blair House is the official presidential guest house for foreign diplomats and heads of state. == Protection == The United States Secret Service is in charge with protecting the president and the first family. As part of their protection, presidents, first ladies, their children and other immediate family members are given Secret Service codenames. These codenames are used for security and safety reasons. ==List of living former presidents== There are four living former presidents. ==Presidential rankings and approval ratings== By a majority of historical sources by historians or by the American people; Abraham Lincoln, George Washington, Franklin D. Roosevelt, Dwight D. Eisenhower, Woodrow Wilson, Ronald Reagan, John F. Kennedy, Calvin Coolidge, Bill Clinton and Thomas Jefferson are ranked high on polls. On the other hand; James Buchanan, Warren G. Harding, Herbert Hoover, Richard Nixon, George W. Bush and Franklin Pierce are thought to be the worst. ==Presidential libraries and museums== Since Herbert Hoover, each president has created an institutional place known as a presidential library for preserving and making available his papers, records, and other documents and materials. There are currently thirteen presidential libraries in the NARA system. Several presidential libraries contain the graves of the president such as Richard Nixon, Ronald Reagan and George H. W. Bush. ==Notes== ==References== ==Other websites== * * Category:Heads of state of the United States",
 "title": "President of the United States"
}