{
 "id": "717752",
 "text": "Over two billion people speak English. It is the largest language by number of speakers. It is the fourth largest language by number of native speakers. English is the most widely spoken second language. The United States of America is the largest English-speaking country, with 300 million native speakers. There are 60 million native speakers in the United Kingdom, 29 million in Canada, 25.1 million in Australia, 4.7 million in the Republic of Ireland, and 4.9 million in New Zealand. In the European Union, English is one of 24 official languages and is widely used by institutions, and by almost all of the population as the native language in the United Kingdom and Ireland.Though the Welsh language is spoken by about one-fifth of the people in Wales, they almost all speak English as well. It is a second language in other member states. == Second language == Estimates that include second language speakers vary greatly, from 470 million to more than 2 billion. David Crystal calculates that, as of 2003, non-native speakers outnumbered native speakers by a ratio of 3 to 1.p69 When combining native and non-native speakers, English is the most widely spoken language worldwide. Besides the main dialects of English, countries such as South Africa, India, Nigeria, the Philippines, Jamaica and Trinidad and Tobago have millions of native speakers of dialect continua. These versions range from English-based creole languages to Standard English. Other countries such as Ghana and Uganda also use English as their primary official languages. India claims to be the world's second- largest English-speaking country. The most reliable estimate is about 10% of its population or 125 million people, second only to the US. It may be four times larger in the next decade from 2012.BBC News 27 Nov 2012: English or Hinglish - which will India choose? == Countries by English-speaking percentage == Below is a list of some countries by the rank proficiency in English (listed alphabetically), according to the English Proficiency Index. === Europe === ==== Very high ==== * Austria * Belgium * Denmark * Finland * Germany * Luxembourg * Netherlands * Norway * Sweden ==== High ==== * Bulgaria * Czech Republic * Estonia * France * Greece * Hungary * Latvia * Lithuania * Poland * Romania * Serbia * Slovakia * Switzerland ==== Moderate ==== * Albania * Belarus * Georgia * Italy * Moldova * Russia * Spain * Ukraine ==== Low ==== * Armenia * Azerbaijan * Turkey === South America === ==== Very high ==== * Guyana ==== High ==== * Bolivia * Chile * Costa Rica * Cuba * Dominican Republic * El Salvador * Honduras * Paraguay * Peru * Suriname * Uruguay ==== Moderate ==== * Argentina * Brazil * Colombia * Guatemala * Nicaragua * Panama * Venezuela ==== Low ==== * Ecuador * Haiti * Mexico === Asia === ==== Very high ==== * Iran * Lebanon * Singapore ==== High ==== * Bahrain * Kuwait * Malaysia * Philippines * Qatar * United Arab Emirates ==== Moderate ==== * China * Hong Kong (China) * India * Iraq * Jordan * Macau (China) * Oman * Saudi Arabia * South Korea ==== Low ==== * Bangladesh * Indonesia * Japan * Mongolia * Nepal * Pakistan * Sri Lanka * Syria * Vietnam ==== Very low ==== * Afghanistan * Cambodia * Kazakhstan * Kyrgyzstan * Myanmar * Tajikistan * Thailand * Uzbekistan * Yemen === Africa === ==== Very high ==== * South Africa ==== High ==== * Kenya * Nigeria * Uganda ==== Moderate ==== * Ghana * Tunisia ==== Low ==== * Algeria * Egypt * Ethiopia * Madagascar * Morocco * Mozambique * Tanzania ==== Very low ==== * Angola * Cameroon * Democratic Republic of Congo * Ivory Coast * Libya * Rwanda * Somalia * South Sudan * Sudan == References == Category:English language",
 "title": "English-speaking world"
}