{
 "id": "717846",
 "text": "Serbo-Croatian is the name of a South Slavic language, which is spoken in modern-day Croatia, Serbia, Bosnia and Herzegovina, and Montenegro. After the breakup of Yugoslavia, it has been divided into four variants. The variants of this language are all based on a single dialect, Shtokavian. Speakers of these variants can understand each other. ==History== Between 1954 and 1992, it was one of the official languages of Yugoslavia (the others were Slovenian and Macedonian). The term Serbo-Croatian was first used in the 1830s. Today, people often speak about Croatian, Serbian, Bosnian and Montenegrin languages. Research has also shown that what is called Serbo-Croatian language, is in fact a number of slightly different sub-dialects. People speaking one of the dialects easily understand other people speaking a different dialect. People in Croatia use the Latin alphabet to write the language, while people in other parts use both the Latin and Cyrillic alphabet == Writing and pronunciation == === Writing === Unlike English, Serbo-Croatian words are written the same way they're said, with every letter representing one sound. === Vowels === Serbo- Croatian has 5 vowels. Latin Alphabet Cyrillic Alphabet English (not exactly) A a А а f _a_ ther E e Е е d _e_ n I i И и s _ee_ k O o О о s _o_ ck U u У у l _oo_ k === Consonants === Serbo-Croatian has 25 consonants. Latin Alphabet Cyrillic Alphabet English (not exactly) B b Б б _b_ all V v В в _v_ ax (roughly) G g Г г _g_ ood D d Д д _d_ ad Đ đ Ђ ђ - Ž ž Ж ж vi _si_ on Z z З з _z_ ero J j Ј ј _y_ ou K k К к _c_ all L l Л л _l_ oss Lj lj Љ љ - M m М м _m_ om N n Н н _n_ ose Nj nj Њ њ _n_ ews P p П п _p_ oll R r Р р _r_ at S s С с _s_ on T t Т т _t_ ax Ć ć Ћ ћ _Q_ ing F f Ф ф _f_ ork H h Х х _h_ arp (roughly) C c Ц ц po _ts_ Č č Ч ч _ch_ eck Dž dž Џ џ _G_ eorge Š š Ш ш _Sh_ arp ==Comparison of Serbo-Croatian dialects== English Croatian Bosnian Serbian January siječanj januar February veljača februar March ožujak mart April travanj april May svibanj maj June lipanj juni jun July srpanj juli jul August kolovoz august avgust September rujan septembar October listopad oktobar November studeni novembar December prosinac decembar ==References== Category:South Slavic languages",
 "title": "Serbo-Croatian"
}