{
 "id": "717888",
 "text": "Graham Douglas Caie is an emeritus Scottish scholar, who is vice president of ALLEA, the European Federation of Academies of Sciences and Humanities. In 2015, Graham Caie was appointed a Commander of the Order of the British Empire (CBE) for his services to Education and Research in Britain and Europe. == Education and career == Graham Caie was born and raised in Aberdeen, Scotland and attended the Aberdeen Grammar School. He completed his MA (hons) in English at the Aberdeen University in 1968, then obtained the degrees of MA (research) and PhD at McMaster University, Canada. In 1972, Graham was appointed lecturer at the University of Copenhagen, where he co-founded the Centre for Medieval Studies at Copenhagen, University of Copenhagen. In 1990, he was appointed to the Chair of English Language at Glasgow University. In 2004, he was elected as a Vice President of the Royal Society of Edinburgh.He was Clerk of Senate and Vice Principal at the University of Glasgow from 2008-12 and retired from the University of Glasgow in 2012. In 2014, he became a member of the British Council’s Advisory Committee for Scotland. He has been a member of Court of Queen Margaret University and is at present an Independent Governor of the Glasgow School of Art. == Fellowships and honors == * Founding Fellow of the English Association, University of Leicester * Research Fellow, University of Glasgow * Professorial Research Fellow, University of Glasgow * Commander of the British Empire (CBE), 2015. * Fellowship of the Royal Society of Edinburgh (FRSE), 2004 == Publications == * The Judgment Day Theme in Old English Poetry, 1976 * The Merchant's Tale: Notes, 1982 * Beowulf (York Notes), 1984 * Geoffrey Chaucer's Merchant's Tale, 1991 * The Flouer O Makarheid, 2003 * Medieval Texts in Context, 2008 * Transitional states : change, tradition, and memory in medieval literature and culture, 2018 == References == == Other websites == * The Royal Society of Edinburgh Category:1945 births Category:Living people Category:Academics of the University of Glasgow Category:People from Aberdeen",
 "title": "Graham Douglas Caie"
}