{
 "id": "718116",
 "text": "China Tom Miéville ( ; born 6 September 1972) is a British urban fantasy fiction author, essayist, comic book writer, socialist political activist and literary critic. He often describes his work as weird fiction. Miéville has won many awards, including the Arthur C. Clarke Award (thrice), the British Fantasy Award (twice), Locus Awards for Best Fantasy Novel (four times) and Best Science Fiction Novel and Best Novelette and Best Young Adult Book, as well as the Hugo, Kitschies, and World Fantasy Awards. == Early life == Born in Norwich, Miéville was brought up in Willesden and has lived in London since early childhood. He grew up with his sister Jemima and mother Claudia, a translator, writer and teacher. His parents separated soon after his birth. He has said that he \"never really knew\" his father. They chose his first name, China, from a dictionary, looking for a beautiful name. Because his mother was born in New York City, Miéville is an American and British citizen. == Education == Miéville studied at Oakham School, a co-educational independent school in Oakham, Rutland, for two years. At the age of eighteen, in 1990, he taught English for a year in Egypt, where he developed an interest in Arab culture and in Middle Eastern politics. Miéville studied for a BA degree in social anthropology at Clare College, Cambridge. He graduated in 1994. He next earned a master's degree and then a PhD in international relations from the London School of Economics in 2001. Miéville has also held a Frank Knox fellowship at Harvard University. After becoming dissatisfied with the ability of post-modern theories to explain history and political events, he became a Marxist at university. A book version of his PhD thesis, Between Equal Rights: A Marxist Theory of International Law, was published in the UK in 2005 by Brill in their \"Historical Materialism\" series, and in the United States in 2006 by Haymarket Books. == Politics == Miéville has been a member of the International Socialist Organization (US) and, until 13 March 2013, was also a member of the Socialist Workers Party (UK).\"Resigning from the Socialist Workers Party\", International Socialism, 11 March 2013 He stood for the House of Commons of the United Kingdom in the 2001 general election as a candidate for the Socialist Alliance. He did not win. He got 459 votes, or 1.2%, in Regent's Park and Kensington North, a Labour constituency.Ansible 168, July 2001. == Bibliography == === Fiction === ==== Bas-Lag series ==== * Perdido Street Station (2000) * The Scar (2002) * Iron Council (2004) ==== Stand-alone novels ==== * King Rat (1998) * Un Lun Dun (2007) 978-0230015869 * The City & the City (2009) * Kraken (2010) * Embassytown (2011) * Railsea (2012) ==== Novellas ==== * The Tain (2002) * This Census-Taker (2016) * The Last Days of New Paris (2016) ==== Short story collections ==== * Looking for Jake (2005) * The Apology Chapbook (2013) * Three Moments of an Explosion: Stories (2015) ==== Children's picture books ==== * The Worst Breakfast (2016), co-written and illustrated by Zak Smith ==== Comic books ==== * Hellblazer (1988) – No. 250 \"Holiday Special\": \"Snow Had Fallen\" * Justice League (2011) – #23.3 \"Dial E #1: Dial Q for Qued\" * Dial H (2012–2013) ==== Other ==== * Pathfinder Chronicles: Guide to the River Kingdoms (2010), with Elaine Cunningham, Chris Pramas, and Steve Kenson. Paizo Publishing. === Nonfiction === ====Books==== * Between Equal Rights: A Marxist Theory of International Law (2005). * Red Planets: Marxism and Science Fiction (2009), with Mark Bould. Middletown, Conn.: Wesleyan University Press. * October: The Story of the Russian Revolution (2017). Verso. * A Spectre Haunting Europe (2020) ====Essays==== * \"London's Overthrow\" (2011). Reprinted in a shorter version as \"Oh, London, You Drama Queen\", The New York Times Magazine 2012-03-01: 42. * \"Preface to a Book not yet Written nor Disavowed\" (2015). China Miéville: Critical Essays, eds. Caroline Edwards and Tony Venezia. == Awards == * Perdido Street Station won the 2001 Arthur C. Clarke Award and the 2001 British Fantasy Award, and was nominated for the Hugo, Nebula, World Fantasy, Locus and British Science Fiction awards. * The Scar won the 2003 British Fantasy Award and the 2003 Locus Award for Best Fantasy Novel, was nominated for the Hugo, Arthur C. Clarke, World Fantasy, Locus, Philip K. Dick, and British Science Fiction awards, and received a Philip K. Dick Award special citation. * Iron Council won the 2005 Arthur C. Clarke Award and the 2005 Locus Award for Best Fantasy Novel, and was nominated for the Hugo and World Fantasy awards. * Un Lun Dun won the 2008 Locus Award for Best Young Adult Book. * The City & the City won the 2010 Arthur C. Clarke Award, 2010 Hugo Award, 2009 Kitschies and 2010 World Fantasy Award, as well as being a Nebula Award nominee in the Best Novel category. * He was a 2018 Guggenheim Fellow in Fiction. ==References== Category:1972 births Category:Alumni of the London School of Economics Category:English children's writers Category:Living people Category:Writers from Norwich Category:English atheists Category:English science fiction writers Category:Marxists",
 "title": "China Miéville"
}