{
 "id": "718187",
 "text": "East Lancashire Coachbuilders Limited was a builder of bus bodies, They was founded in 1934 in Blackburn, Lancashire, England. == History == On 17 August 2007, the company went into administration, but was saved and bought out by the Darwen Group. The new company was called Darwen East Lancs. In 2008, Darwen East Lancs was purchased by Optare. East Lancs bodies stopped being built and the factory in Blackburn closed in 2012. == Products == === Past === East Lancs had many different types of bodywork. They misspelled names on pupose, replacing the letter i with a letter y. ==== East Lancs (1934–2007) ==== *Greenway *EL2000 *Cityzen *Pyoneer ;Single-decker *Myllennium for DAF SB220, MAN 14.220, Scania N94UB and Alexander Dennis Dart *Hyline, a high- floor variant of the standard Myllennium single-decker body but used to re- body older chassis ;Double-decker *Lolyne for Dennis Trident *Vyking for Volvo B7TL *Lowlander for DAF/VDL DB250 *Nordic for 3-axle Volvo B7L/B9TL *Myllennium Lolyne for Dennis Trident *Myllennium Vyking for Volvo B7TL *Myllennium Lowlander for DAF/VDL DB250LF *Nordic for 3-axle Volvo B7L/Volvo B9TL ;Single-decker *Spryte for Dennis Dart and Volvo B6BLE chassis *Flyte for longer step-entrance and high-floor buses. ==== Darwen Darwen East Lancs (2007–2008) ==== ;Single-decker *OmniTown for Scania N94UB chassis ;Double- decker *OmniDekka for Scania N94UD/N230UD/N270UD chassis ==== Optare (2008–2012) ==== ;Single-decker *Esteem for Alexander Dennis Enviro200 Dart, MAN 12.240, Scania N230UB, Scania N94UB and Alexander Dennis Enviro300 chassis *Kinetec ;Double-decker *Olympus for Alexander Dennis Enviro400, VDL DB250, Volvo B9TL and Scania N230UD chassis *Visionaire open-top body for Volvo B9TL chassis ==== Kinetec series ==== The Kinetec was made in 2006. They are low- floor bodies for MAN chassis. They have the Esteem/Olympus body but with MAN's own Lion's City design front and rear. *Kinetec+ ==References== == Other websites == * * Official website Category:East Lancashire Coachbuilders Category:1930s establishments in England Category:British transport companies",
 "title": "East Lancashire Coachbuilders"
}