{
 "id": "718357",
 "text": "Vyda Kęsgailaitė-Ragulskienė was a Lithuanian scientist, inventor, and professor. She was the first woman to attain habilitation in engineering in Lithuania. == Life == Ragulskienė was born in 1931 in the village of Dapšiai, Lithuania. In 1955, she graduated from Kaunas Polytechnical Institute. She then became a research associate at the Lithuanian Academy of Sciences until 1967. From 1967 to 1993 she worked at Kaunas Polytechnical Institute. She was married to engineer Kazimieras Ragulskis. == Science == In 1965, she wrote her thesis in engineering, and was granted a doctorate. Then in 1973 she was given the title \"doctor of sciences\" (habilitated doctor). In 1977 she became a professor of sciences. She wrote part of six research monographs (a type of research paper). She also wrote about two hundred research papers and was granted 97 patents. For her research work she was awarded the State Prize of the Lithuanian SSR (Soviet Union) in 1983. Ragulskienė was also a consultant for others on more than fifty thesis papers. Her research made known and explained new details of \"non-linear vibro-impact systems\". To arrive at her results, she used experiments as well as computer analysis. She then shared the results in her research papers. She was also able to put the results of this research into use with new inventions, for which she obtained patents. == Other works == She translated Samogitia: The Unknown in History from English from English into Lithuanian.Yves Drolet, The Aryan Order of America and the College of Arms of Canada 1880–1937, Montréal: Yves Dolet, 2015, 62–65 and 88. She helped collect data for the encyclopedia The Officers of the Lithuanian Armed Forces 1918–1953. She also wrote about the history of her native village of Dapšiai. == References == # Voverienė O. Prominent Scientists of Lithuania of the XX Century. Vilnius: Mokslo aidai, 2009, 640 p. # Самосинхронизация механических систем / К. Рагульскис, И. Виткус, В. Рагульскене. – Вильнюс: Минтис, 1965. – Т. 1: Самосинхронные и виброударные системы. – 186 с. # Ртутные коммутирующие элементы для устройств автоматики / В. - С. С. Зарецкас, В. Л. Рагульскене. – Москва: Энергия, 1971. – (Библиотека по автоматике. Вып. 447) – 104 с. # Виброударные системы / В. Л. Рагульскене. – Вильнюс: Минтис, 1974. – 320 с. # Двумерные вибрационные приводы / Р. Э. Курило, В. Л. Рагульскене. – Вильнюс: Мокслас, 1986. – 137 с. # Контактные системы / В. В. Осташявичюс, Б. В. Рудгальвис, В. Л. Рагульскене, Б. П. Бакшис. – Ленинград: Машиностроение, Ленинградское отделение, 1987. – 279 с. # Vibroengineering / One of the authors V. Ragulskienė. – Monograph. Science and Arts of Lithuania. Book 19. Vilnius: Academia Scientiarum Lithuaniae, 1998. – 572 p. # Professor Vyda Kęsgailaitė – Ragulskienė (1931–2009) / Monograph. Science and Arts of Lithuania. Book 74. Vilnius: Mokslotyros Institutas, 2009. – 568 p. # Ch. L. T. Pichel. Žemaitija. Kaunas: Ajeta, 1991. Translated from the English language by V. Ragulskienė. # Translation from the English language by V. Ragulskienė: Ch. L. T. Pichel. Žemaitija, nežinoma istorija. Klaipėda: Samogitia Media, 2007. # Multi-volume encyclopedia publication „Lietuvos kariuomenės karininkai 1918–1953”. Vilnius, 2001–2009. # Šiaudytis V. Lietuvos šviesuoliai. Kaunas: Aušra, 2010, 368 p. # Šiaudytis V. Gyvenimas – tai paukščio skrydis prie saulutės arčiau į mėlyną mėlyną dangų... Kaunas: Aušra, 2011, 200 p. Specific Category:1931 births Category:2009 deaths Category:Physicists Category:Lithuanian people Category:Soviet engineers",
 "title": "Vyda Ragulskienė"
}