{
 "id": "718645",
 "text": "Clearwater is a city in Sedgwick County, Kansas, United States. In 2020, 2,653 people lived there. ==History== Clearwater was created in 1870. It was platted as a city in 1872.Kansas: A Cyclopedia of State History; 1912. It was named Clearwater because of the local river named Ninnescah, which translates to \"clear water\" in English. The first post office in Clearwater was created in 1871. The name of the post office called Clear Water until 1894. The Chisholm Trail went along the east side of the city from 1867 to 1871.Route of the Chisholm cattle trail in Kansas; Kansas Historical Society, 1960s. ==Geography== Clearwater is southwest of Wichita, Kansas at (37.505646, -97.501516). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census said that there were 2,653 people, 934 households, and 689 families living in Clearwater. Of the households, 70.3% owned their home and 29.7% rented their home. The median age was 35.8 years. Of the people, 90.9% were White, 0.8% were Native American, 0.3% were Asian, 0.2% were Black, 0.6% were from some other race, and 7.2% were two or more races. Hispanic or Latino of any race were 3.7% of the people. ===2010 census=== The 2010 census said that there were 2,481 people, 908 households, and 660 families living in Clearwater. ==Education== Clearwater has the Clearwater USD 264 public school district. ==Famous people== * Raymond Goertz, roboticist * Cara Gorges, 2007 Miss Kansas USA * Pamela Horton, Playboy Playmate of the Month for October 2012. * Logan Mize, Country Artist ==References== ==Other websites== ;City * City of Clearwater * Clearwater - Directory of Public Officials ;Schools * USD 264, local school district * USD 264 School District Boundary Map , KDOT ;Historical * Clearwater Historical Society ;Maps * Clearwater City Map , KDOT Category:Cities in Sedgwick County, Kansas Category:1870 establishments in Kansas",
 "title": "Clearwater, Kansas"
}