{
 "id": "71895",
 "text": "Genetic drift is a random effect on biological populations. Its effect is to remove genetic variation from a population of living organisms.Gillespie, John H. 2004. Population genetics: a concise guide. 2nd ed, Johns Hopkins University Press, Baltimore. Chapter 2 and 4.3 In natural populations there are a number of forces acting. There are forces which add heritable variation to the population, such as mutation and recombination. There are also factors which remove variation from the population, and drift is one of these. == Overview == In a species, or an interbreeding population, there is usually a great deal of genetic variation. This genetic variation is in the form of different alleles at many loci (gene positions) on the chromosomes. Changes in allele frequency are mainly caused by natural selection, that is, by differential survival, and contribution to the next generation. But as populations get smaller, there is a tendency for each generation to become more homozygous, with less variety of alleles. This is an effect similar to inbreeding: it leads to genetic uniformity. Genetic drift is the name given to this loss of variation. It can affect evolution in surprisingly big ways, but only when populations are quite small. What 'small' means would depend on the organism. 50 individuals is small, 5000 is not, 500 is maybe. The basic mechanism of drift is that genetic variety is reduced by chance, making the individuals more similar to each other, and hence more vulnerable. Genetic drift reduces genetic variation in populations, potentially reducing a population’s ability to survive new selective pressures. Genetic drift acts faster and has more drastic results in smaller populations.Klug W.S. et al 2012. Concepts of genetics. Pearson, p710. The effects of gentic drift on small populations can vary due to evoultionary change and chance events which determine which alleles are passed to the next generation. Since genetic drift acts by random chance alone, it causes allele frequencies to fluctuate at random. With small populations, the acts of random chance can cause frequencies to increase creating more richness or decrease, increasing the rate of extinction within species. Some alleles may disappear entirely, and others may reach 100 percent frequency fixation. Since some alleles are lost during genetic drift, genetic variations of populations will decrease. Not looking at the founder effect, alleles will be lost and be recoverable in these populations. This can also increase the differences in difference populations. When genetic variation in species decrease, the same genes are going to be moving in the same directions within populations. Neighboring populations will start to look either drastically different, or start to look similar when looking at genetic variation. With that, the frequency of harmful alleles can increase. However, if the allele has harmful or damaging effects to a population, genetic drift can override and cancel natural selection. If the frequency of harmful alleles are high, natural selection will not be able to compensate for the population. The population will have too many harmful alleles in the gene pool. Genetic drift may contribute to speciation, if the small group does survive. Bottleneck events: when a large population is suddenly and drastically reduced in size by some event, the genetic variety will be very much reduced. Infections and extreme climate events are frequent causes. Occasionally, invasions by more competitive species can be devastating.The extinction of many Australian marsupials by foreign species is a famous example. ♦ In the 1880/90s, hunting reduced the Northern elephant seal to only about 20 individuals. Although the population has rebounded, its genetic variability is much less than that of the Southern elephant seal. ♦ Cheetahs have very little variation. We think the species was reduced to a small number at some recent time. Because it lacks genetic variation, it is in danger from infectious diseases.O'Brien S. Wildt D. & Bush M. 1986. The Cheetah in genetic peril. Scientific American 254: 68–76. Skin grafts between non-related cheetahs illustrate this point: there is no rejection of the donor skin. Founder events: these occur when a small group buds off from a larger population. The small group then lives separately from the main population. The human species is often quoted as having been through such stages, for example, when groups left Africa to set up elsewhere (see human evolution). Apparently, we have less variation than would be expected from our worldwide distribution. Groups that arrive on islands far from the mainland are also good examples. These groups, by virtue of their small size, cannot carry the full range of alleles to be found in the parent population.Evolution 101:Sampling Error and Evolution and Effects of Genetic Drift from the Understanding Evolution webpages made by the University of California at BerkeleyEvolution 101: Peripatric Speciation from the Understanding Evolution webpages made by the University of California at Berkeley == Related pages == * Evolution * Natural selection * Hardy–Weinberg law * Population genetics == References == # Category:Evolutionary biology Category:Classical genetics",
 "title": "Genetic drift"
}