{
 "id": "719110",
 "text": "Basshunter, a Swedish singer, record producer and DJ, has released five studio albums, two compilation albums, 29 singles, five promotional singles and seven remixes. The Bassmachine, Basshunter's debut studio album, was released by Alex Music on 25 August 2004. In April 2006, he signed his first contract with Extensive Music and Warner Music Sweden. His single \"Boten Anna\" charted at number one on the Danish singles chart, where it stayed for fourteen weeks; it was certified triple platinum by IFPI Danmark. \"Boten Anna\" also reached number one in the Swedish singles chart and was certified platinum by IFPI Sverige. His second studio album LOL, released on 28 August 2006, charted in the top five in Sweden, Denmark and Finland. The album was certified platinum by IFPI Finland and double platinum by IFPI Danmark. In late 2006, Basshunter released his albums The Bassmachine and The Old Shit through his own website. Basshunter's third single \"Vi sitter i Ventrilo och spelar DotA\" was certified gold by IFPI Danmark. Basshunter collaborated with the duo Patrik & Lillen on his single \"Vifta med händerna\". The single \"Now You're Gone\", which uses the same music as \"Boten Anna\", was originally recorded by Mental Theo and sung by Sebastian Westwood but in 2007, Basshunter recorded a shorter version of \"Now You're Gone\" to appeal to international audiences. The song subsequently charted at number one on the British and Irish singles charts, and stayed there for five weeks. It was also certified platinum by the British Phonographic Industry and Recorded Music NZ. The second single released was a cover of the KC and the Sunshine Band song \"Please Don't Go\". The third single was \"All I Ever Wanted\", which uses the music from \"Vi sitter i Ventrilo och spelar DotA\" in the style of \"Now You're Gone\". It charted at number one in Ireland and at number two in the United Kingdom, and was certified gold by the British Phonographic Industry and Recorded Music NZ. Now You're Gone – The Album was released on 14 July 2008 and like the single was certified platinum by the British Phonographic Industry and Recorded Music NZ. The fourth single was \"Angel in the Night\", which was followed by a cover of Westlife's song \"I Miss You\". Basshunter's sixth and final single from Now You're Gone – The Album was \"Walk on Water\", which accompanied a deluxe edition re-release of the album featuring new remixes and the previous four singles from the album. The single \"Every Morning\" was released before Basshunter's fifth studio album Bass Generation, which was released on 25 September 2009. The album was certified silver by the British Phonographic Industry. The second single was \"I Promised Myself\", a cover of a Nick Kamen song. A compilation album titled The Early Bedroom Sessions was released on 3 December 2012; it Includes seven songs from The Old Shit, all ten songs from The Bassmachine, and the tracks \"Go Down Now\", \"Trance Up\" and \"Wacco Will Kick Your Ass\", which had previously appeared on singles, and three unreleased songs. On 13 May 2013 he released his sixth studio album Calling Time. The album charted on the American Dance/Electronic Albums chart at number 25. Five tracks from the album were released as singles: \"Saturday\" (2010), \"Fest i hela huset\" (2011), \"Northern Light\", \"Dream on the Dancefloor\" (2012), \"Crash & Burn\" and \"Calling Time\" (2013). \"Saturday\" was certified gold by Recorded Music NZ. \"Fest i hela huset\" charted at number five in Sweden; it was recorded in collaboration with participants from the Swedish Big Brother series. ==Albums== ===Studio albums=== List of studio albums, with selected chart positions and details, certifications and sales figures Title Album details Peak chart positions Sales Certifications SWE AUT DEN EUR Studio albums positions on European Albums: * LOL and Bass Generation: * Now You're Gone – The Album: FIN FRA Studio albums positions in France: * LOL and Now You're Gone – The Album: * Bass Generation: Find \"Basshunter\" from the list of artists and click \"Ok\". IRL NOR NZL UK Select \"Albums\" tab. The Bassmachine * Released: 25 August 2004 * Label: Alex Music * Format: CD, digital download — — — — — — — — — — LOL * Released: 28 August 2006 * Label: Warner Music Sweden * Format: CD, digital download, streaming 5 12 3 82 4 51 — 19 — — * FIN: 33,365 * IFPI DEN: 2× Platinum * IFPI FIN: Platinum Now You're Gone – The Album * Released: 14 July 2008 * Label: Hard2Beat * Format: CD, CD+DVD, digital download, streaming 38 17 — 6 35 36 2 — 1 1 * UK: 376,017 * NZL: 22,000 * BPI: Platinum * IFPI DEN: Gold * RMNZ: Platinum Bass Generation * Released: 25 September 2009 * Label: Warner Music Sweden * Format: CD, 2×CD, digital download, streaming — — 39 58 — 41 16 — 2 16 * BPI: Gold Calling Time * Released: 13 May 2013 * Label: Gallo Record Company * Format: CD, digital download, streaming — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that territory. ===Compilation albums=== List of compilation albums, with selected details Title Album details The Old Shit * Released: Second half of 2006Release of The Old Shit: * * Requires Adobe Flash Player software. * * Label: Self-released * Format: Digital download The Early Bedroom Sessions * Released: 3 December 2012 * Label: Rush Hour * Format: 2×CD, digital download, streaming ==Singles== ===As lead artist=== List of singles as lead artist, with selected chart positions, certifications and album name Title Year Peak chart positions Sales Certifications Album SWE AUT DEN FIN GER Select tab \"111 Titel von Basshunter\". IRL NLD NOR NZL UK \"The Big Show\" 2004 — — — — — — — — — — The Bassmachine \"Welcome to Rainbow\" 2006 — — — — — — — — — — \"Boten Anna\" 1 2 1 4 9 — 2 3 — — * DEN: 61,000 * SWE: 60,000 * FIN: 8,044 * IFPI DEN: 3× Platinum * IFPI SWE: Platinum * IFPI AUT: Gold LOL \"Vi sitter i Ventrilo och spelar DotA\" 6 18 7 2 33 49 9 7 — — * IFPI DEN: Gold \"Jingle Bells\" 13 — — — — — 31 9 — 35 \"Vifta med händerna\" (vs. Patrik & Lillen) 25 — — 7 — — — — — — \"DotA\" 2007 — — — — 30 — — — — — \"Now You're Gone\" (feat. DJ Mental Theo's Bazzheadz) 2 14 14 8 18 1 — 10 3 1 * UK: 667,000 * BPI: Platinum * RMNZ: Platinum Now You're Gone – The Album \"Please Don't Go\" 2008 6 — — — — — — — — — \"All I Ever Wanted\" 58 15 — — 35 1 — 3 17 2 * BPI: Platinum * RMNZ: Gold \"Angel in the Night\" 50 — — — — 10 — — — 14 * UK: 4,592 * BPI: Silver \"Russia Privjet (Hardlanger Remix)\" — — — — — — — — — — \"I Miss You\" 45 — — — 70 — — — — 32 \"Walk on Water\" 2009 — — — — — — — — — 76 \"Al final\" (feat. Dani Mata) — — — — — — — — — — \"Every Morning\" 24 — — — 76 17 — — 14 17 * UK: 12,876 Bass Generation \"I Promised Myself\" — — — — — — — — — 94 \"Saturday\" 2010 — — — — — 37 — — 14 21 * RMNZ: Gold Calling Time \"Fest i hela huset\" (vs. Big Brother) 2011 5 — — — — — — — — — \"Northern Light\" 2012 — — — — — — — — — — \"Dream on the Dancefloor\" — — — — — — — — — — \"Crash & Burn\" 2013 — — — — — — — — — — \"Calling Time\" — — — — — — — — — — \"Elinor\" — — — — — — — — — — rowspan=\"7\" \"Masterpiece\" 2018 — — — — — — — — — — \"Home\" 2019 — — — — — — — — — — \"Angels Ain't Listening\" 2020 — — — — — — — — — — \"Life Speaks to Me\" 2021 — — — — — — — — — — \"End the Lies\" 2022 — — — — — — — — — — \"Ingen kan slå (Boten Anna)\" 2023 4 — — — — — — — — — \"—\" denotes a recording that did not chart or was not released in that country. ===Promotional singles=== List of promotional singles and album name Title Year Album \"Syndrome de Abstenencia\" 2004 The Bassmachine \"Wacco Will Kick Your Ass\" 2005 The Early Bedroom Sessions \"I Can Walk on Water I Can Fly\" 2007 \"Russia Privjet\" LOL \"Megamix\" 2008 == Other charted songs == List of songs, with selected chart positions and album name Title Year Peak chart positions Album SWE \"Hallå där\" 2006 51 LOL ==Remixes== === Singles === List of remixes, artist and album name Title Year Artist(s) Album \"Dancing Lasha Tumbai\" (Basshunter Remix) 2007 Verka Serduchka rowspan=\"3\" \"Du hast den schönsten Arsch der Welt\" (Basshunter's Bass My Ass Radio Remix) \"Du hast den schönsten Arsch der Welt\" (Basshunter's Bass My Ass Extended Remix) Alex C. feat. Y-ass \"Ieva's polka (Ievan polkka)\" [Basshunter Remix] Loituma \"When You Leave (Numa Numa)\" (Basshunter Radio Mix) 2008 Alina Everybody Wants Me \"When You Leave (Numa Numa)\" (Basshunter Extended Mix) 2009 \"Crash & Burn\" (Basshunter Remix) 2013 Basshunter \"Sex Love Rock n Roll (SLR)\" [Basshunter Remix] \"Sex Love Rock n Roll (SLR)\" [Basshunter Remix Extended Version] 2014 Arash feat. T-Pain Superman === Promotional singles === List of remixes, artist and album name Title Year Artist(s) Album \"Calcutta 2008\" (Basshunter Remix) 2007 Dr. Bombay The Hits ==Writing discography== List of written songs, artist, album name and the co- writers Title Year Artist(s) Peak chart positions Album Co-written with SWE BEL (WA) Select tab \"Ultratop Wallonie\". \"Mange kommer hem till dig\" 2015 Mange Makers — — rowspan=\"3\" \"Shut Up Chicken\" 2020 El Capon — — \"Charlie\" Lana Scolaro — — \"—\" denotes a recording that did not chart or was not released in that country. ==Related pages== * List of songs recorded by Basshunter ==Notes== ==References== ==Other websites== * Category:Discographies Discography",
 "title": "Basshunter discography"
}