{
 "id": "719291",
 "text": "Bee Movie is a 2007 comedy movie made by DreamWorks Animation. It is about a bee attempting to restore flowers for honey. == Plot == The main character is Barry B. Benson, who is a bee. Barry leaves his beehive for a job and meets a woman called Vanessa. They both become friends and when they are at the shop, Barry sees honey and realises that humans have been stealing their honey, so he and Vanessa go to court to give all of the honey back to the bees. After they win the lawsuit, all bees lose their jobs and the flowers start dying because they aren't getting pollinated by the bees. Barry and Vanessa go to the flower parade (where the last alive flowers are), steal a festival car and bring it into a plane. They want to bring the flowers back to the bees to make the flowers alive again. Vanessa is forced to fly the plane with the help of Barry halfway through the flight and successfully lands with the help of the bees. In the end, they manage to pollinate the flowers, make the nature alive again and all bees get their jobs back. == Voice cast == * Jerry Seinfeld as Barry B. Benson * Renée Zellweger as Vanessa Bloome * Matthew Broderick as Adam Flayman * John Goodman as Layton T. Montgomery * Patrick Warburton as Ken * Chris Rock as Mooseblood the Mosquito * Kathy Bates as Janet B. Benson * Barry Levinson as Martin B. Benson * Megan Mullally as Trudy, Honex Tour Guide * Rip Torn as Pollen Jocks General Lou Lo Duca * Oprah Winfrey as Judge Bumbleton * Michael Richards as Bud Ditchwater * Larry King as Bee Larry King, a fictionalized bee version of himself * Larry Miller as Dean Buzzwell * Jim Cummings as Title Narrator and Graduation Announcer * David Moses Pimentel as Hector * Chuck Martin as Andy * Brian Hopkins as Sandy Shrimpkin and TSA Agent * John DiMaggio as Bailiff and Janitor * Tress MacNeille as Jeanette Chung and Mother * Wayne Knight as Giraffe * Simon J. Smith as Truck Driver and Chet * Ray Liotta as Himself * Sting as Himself * Nick Nolte as Vincent * Robert Jayne as Bee (uncredited) * Carl Kasell as Himself (uncredited) == Reference == Category:2007 computer-animated movies Category:2007 comedy movies Category:DreamWorks Animation movies Category:American comedy movies Category:Movies about insects",
 "title": "Bee Movie"
}