{
 "id": "719292",
 "text": "Russell is the biggest city in Russell County, Kansas, United States. It is also the county seat of Russell County. In 2020, 4,401 people lived there. ==History== In 1871, colonists from Ripon, Wisconsin created Russell. It was named after the county. Russell was incorporated and became the temporary county seat in 1872. After a two-year disagreement with Bunker Hill, it became the permanent county seat in 1874. In 1876, Volga Germans, mostly from the area around Saratov and Samara in Russia, started moving in and around Russell. The first discovery oil well in Russell County was drilled west of Russell in 1923. An oil boom started and lasted through the 1930s, attracting settlers from Oklahoma and Texas. Petroleum production became an important part of the local economy. Russell came to national attention in the mid-1990s. This was because it was the hometown of U.S. Senators Bob Dole and Arlen Specter when both men campaigned for the U.S. presidency. Dole was born and raised in Russell, and it remained his official place of residence throughout his political career. ==Geography== Russell is at (38.889807, -98.857113). It has an elevation of 1,827 feet (557 m). It is in north-central Kansas at the intersection of Interstate 70 and U.S. Route 281. Russell is about northwest of Wichita, west of Kansas City, and east-southeast of Denver. The city is in the Smoky Hills region of the Great Plains. It is about south of the Saline River and north of the Smoky Hill River. Fossil Creek, a tributary of the Smoky Hill River, goes just south of the city. It has been dammed to make a small reservoir called Fossil Lake. The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 4,401 people, 1,930 households, and 1,091 families living in Russell. Of the households, 68.1% owned their home and 31.9% rented their home. The median age was 42.9 years. Of the people, 90.4% were White, 1.2% were Black, 0.7% were Native American, 0.4% were Asian, 1.0% were from some other race, and 6.3% were two or more races. Hispanic or Latino of any race were 4.2% of the people. ===2010 census=== The 2010 census says that there were 4,506 people, 2,041 households, and 1,216 families living in Russell. ==Infrastructure== ===Health care=== Russell Regional Hospital is the only hospital in Russell. It was created in 1942. It is a private, non-profit, 54-bed general medical and surgical facility. ==Media== The Russell County News is the local newspaper. it is published weekly on Thursdays. It was a daily newspaper until 2000. It then became a twice-weekly newspaper from 2001-15. Russell is in the Wichita- Hutchinson, Kansas television market. ==Famous people== Notable individuals who were born in and/or have lived in Russell include: ==References== ==Other websites== ;City * City of Russell * Russell - Directory of Public Officials ;Schools * USD 407, local school district ;Historical * Historic Images - Wichita State University Libraries * Russell County Historical Society ;Maps * Russell City Map , KDOT * Topo Map of Russell area, USGS Category:Cities in Russell County, Kansas Category:1871 establishments in the United States Category:County seats in Kansas",
 "title": "Russell, Kansas"
}