{
 "id": "719334",
 "text": "Doom Eternal is the sequel to the 2016 video game Doom. It can be played on the PC, Xbox One,PlayStation 4, Nintendo Switch, PlayStation 5 and Xbox Series, and can also be played on most devices with the help of cloud play, as seen on here where Doom Eternal is hacked onto a $10 calculator (credit to Taki Udon). Similar to the story of Doom 2, the demons from Hell invade Earth. According to Id Software, they hoped to expand the Doom story much more than in the earlier Doom games. Places where the player goes include Earth, Mars, Phobos (one of Mars's moons), Sentinel Prime, Argent d'Nur, Nekravol, and even the game's version of Heaven, Urdak. Some of these planets have been taken over or are being taken over by the Hell dimension. The monsters and weapons have been redesigned so that they look more like the ones in Doom and Doom 2. Each weapon received new attachments, so they play differently than they did in Doom (2016). The game also added new mechanics like extra lives, wall- climbing, air-dashing, swinging from monkey bars, and swinging from grappling hooks. The player also received a flamethrower so that they can gain armor points when they damage inflamed enemies. The game is designed where certain body parts of the demon enemies can be damaged, so attacking and destroying those body parts can disable certain attacks and make them easier to kill, these are called weak points, examples include: Arachnotron turrets, Mancubus guns, and Revenant turrets, just to name a few. The game is designed to be much more difficult than the earlier games because the player has much less ammunition and the enemies are more aggressive. The game has multiplayer like its prequel, but there is a new mechanic called Invasion Mode where players can play as demons and invade other players' campaigns to kill them, though Id Software said that players allowing this feature in their own campaigns would be up to themselves (Editor's Note: Invasion mode will likely never be added, as it has been 3 years since release and we have heard nothing yet from ID Software). A successor, Doom: The Dark Ages, was released in 2025. ==References== Category:2020 video games Category:Doom (franchise) Category:Bethesda Softworks games Category:Apocalyptic video games Category:First-person shooters Category:Horror video games Category:Id Software games Category:Multiplayer and single-player video games Category:Multiplayer online games Category:Nintendo Switch games Category:Permadeath games Category:PlayStation 4 games Category:PlayStation 5 games Category:Video game sequels Category:Video games about extraterrestrial life Category:Video games developed in the United States Category:Video games set in hell Category:Windows games Category:Xbox One games Category:Xbox Series X and Series S games",
 "title": "Doom Eternal"
}