{
 "id": "719432",
 "text": "Juana Maria, born on San Nicolas Island, CA, better known to history as the Lone Woman of San Nicolas Island, was a Native American woman who was the last surviving member of her tribe, the Nicoleño. She lived alone on San Nicolas Island off the coast of California from 1835 until her rescue in 1853. She died after getting dysentery. A children's book, \"Island of the Blue Dolphins\" was based on her. Most of her tribe was killed in massacres, which took place in 1814. In 1835, most of the remaining tribe was brought to the mainland, where they died of different diseases. Since then, Juana Maria was probably the only person to live on the island. She was found and brought to the mainland, in 1853. At that time, no one could understand her language any more, and people could only communicate with her using hand signs. Today, only a few isolate words and two songs are known of the language. == Language == The Nicoleño language has been extinct since Juana Maria's death. It is only known from four words and two songs attributed to her. This evidence was recorded by non-speakers, because no one could be found who could understand Juana Maria. The four Nicoleño words that were translated were \"tocah\", meaning \"animal hide\", \"nache\", meaning \"man\", \"toygwah\", meaning \"sky\", and \"puoochay\", meaning \"body\". One of the songs was recorded as follows: > Toki Toki yahamimena (×3) > weleshkima nishuyahamimena (×2) > Toki Toki ... (continue as above) The following text was published by an anonymous writer in Sacramento's Daily Democratic State Journal on October 13, 1853: > The wild woman who was found on the island of San Nicolas about 70 miles > from the coast, west of Santa Barbara, is now at the latter place and is > looked upon as a curiosity. It is stated she has been some 18 to 20 years > alone on the island. She existed on shell fish and the fat of the seal, and > dressed in the skins and feathers of wild ducks, which she sewed together > with sinews of the seal. She cannot speak any known language, is good- > looking and about middle age. She seems to be contented in her new home > among the good people of Santa Barbara. == References == Category:1800s births Category:1853 deaths Category:Infectious disease deaths in California Category:Missing people Category:Native American people Category:People from Ventura County, California Category:Deaths from dysentery",
 "title": "Juana Maria"
}