{
 "id": "719597",
 "text": "Hiawatha (Ioway: H치ri W치ta pronounced ) is the biggest city in Brown County, Kansas, United States. It is also the county seat of Brown County. In 2020, 3,280 people lived there. == History == Hiawatha was created in 1857. This makes it one of the oldest towns in Kansas. John M. Coe, John P. Wheller, and Thomas J. Drummond were important in creating the city, and the place was found on February 17, 1857. B.L. Rider was responsible for naming Hiawatha. It was named after Henry Wadsworth Longfellow's poem, The Song of Hiawatha.Kansas Place-Names, John Rydjord, University of Oklahoma Press, 1972, p. 436 . Hiawatha became the Brown County Seat in 1858. The first school opened in 1870. The main street was called Oregon Street after the Oregon Trail. Parallel streets north of it were named after Indian tribes north of the Trail, and streets south carried tribal names of those south of the Trail. Hiawatha is named after a poem by Henry Wadsworth Longfellow called The Song of Hiawatha. The Onondaga and Mohawk Indian leader Hiawatha is in the poem. Next the former Ioway-Sac reservation and the present-day Ioway Tribe of Kansas and Nebraska, Hiawatha is called H치ri W치ta in Ioway. It means \"I am looking far away\".Goodtracks, Jimm (1992) Baxoje-Jiwere-Nyut'aji - Ma'unke: Iowa-Otoe-Missouria Language to English. Boulder, CO: Center for the Study of the Languages of the Plains and Southwest. This name may be the result of choosing Ioway words that sound like the English name. It has nothing to do with the Onondaga-Mohawk leader. The city has also had the oldest Halloween parade in the United States. They started it in 1914. == Geography == Hiawatha is at (39.851855, -95.537999). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 3,280 people, 1,378 households, and 798 families living in Hiawatha. Of the households, 60.7% owned their home and 39.3% rented their home. The median age was 41.4 years. Of the people, 85.6% were White, 2.6% were Native American, 1.8% were Black, 0.8% were Asian, 1.5% were from some other race, and 7.7% were two or more races. Hispanic or Latino of any race were 4.4% of the people. ===2010 census=== The 2010 census says that there were 3,172 people, 1,369 households, and 843 families living in Hiawatha. ==Famous people== * Bion Barnett - banker * Al Buell - pinup artist * William Gallagher - 1953 Pulitzer Prize-winning photographer * Bill Martin, Jr. - children's book author * Homer McCrerey - commissioned US Naval Academy officer and bioengineering oceanographer * John McLendon - inducted into Basketball Hall of Fame in 1979 * Joe Wilhoit - baseball player, record holder for longest consecutive game hitting streak in professional baseball (69) ==References== ==Other websites== ;City * City of Hiawatha * Hiawatha - Directory of Public Officials ;Schools * USD 415, local school district ;Maps * Hiawatha City Map , KDOT Category:1857 establishments in the United States Category:Cities in Brown County, Kansas Category:County seats in Kansas",
 "title": "Hiawatha, Kansas"
}