{
 "id": "719602",
 "text": "Norton is a city in Norton County, Kansas, United States. It is also the county seat of Norton County. In 2020, 2,747 people lived there. ==History== Norton was created in 1872. It was named after Capt. Orloff Norton. The first hotel in Norton was a log house. It was built in 1873. One of the first pictures of a tornado was taken in Norton in 1909. The photographer was Will Keller. ==Geography== Norton is at (39.836219, -99.891596). The United States Census Bureau says that the city has a total area of . All of it is land. The city is on the north side of Prairie Dog Creek in Norton County. Before the Bureau of Reclamation built Keith Sebelius Lake in 1963, Norton had a lot of floods. The dam has since fixed the problem, and it created the current reservoir that sits southwest of Norton. The Nebraska border is north of Norton. ==Weather== ==People== ===2020 census=== The 2020 census says that there were 2,747 people, 1,213 households, and 692 families living in Norton. Of the households, 66.5% owned their home and 33.5% rented their home. The median age was 42.0 years. Of the people, 90.2% were White, 0.8% were Black, 0.7% were Asian, 0.5% were Native American, 1.1% were from some other race, and 6.6% were two or more races. Hispanic or Latino of any race were 5.3% of the people. ===2010 census=== The 2010 census says that there were 2,928 people, 1,290 households, and 763 families living in Norton. ==Famous people== * Nick Allen, baseball player * Kathleen Sebelius (nee Gilligan), the former Secretary of Health and Human Services and a former governor of Kansas; daughter of former Ohio governor John J. Gilligan * Keith Sebelius, former member of the United States House of Representatives from Kansas from 1969 to 1981 *K. Gary Sebelius, US Magistrate Judge, son of Keith Sebelius, husband of Kathleen Sebelius ==References== ==Other websites== ;City * Norton Area Chamber of Commerce * Norton County ;Schools * USD 211, local school district ;Maps * Norton City Map , KDOT Category:1872 establishments in Kansas Category:Cities in Kansas Category:County seats in Kansas Category:Norton County, Kansas",
 "title": "Norton, Kansas"
}