{
 "id": "719618",
 "text": "WaKeeney is a city in Trego County, Kansas, United States. It is also the county seat of Trego County. In 2020 census, 1,799 people lived there. ==History== In 1877, James Keeney, a land speculator in Chicago, bought land at the place of modern-day WaKeeney from the Kansas Pacific Railway. He, and business partner Albert Warren, created Warren, Keeney, & Co., surveyed and plotted the site in 1878. They created a colony there in 1879. They named the colony WaKeeney, a portmanteau of their last names. They said it was \"The Queen City of the High Plains\", advertising and holding celebrations to attract settlers. The colony grew quickly, but crop failures made settlers leave in 1880 as quickly as they had come. By 1882, all that was left were \"five poorly patronized retail stores\". Years later, Volga Germans began settling the area. WaKeeney became the county seat in June 1879. It was incorporated as a city in 1880. ==Geography== WaKeeney is at (39.023449, -99.881455) at an elevation of 2,447 feet (746 m). It is in northwestern Kansas at the intersection of Interstate 70 and U.S. Route 283. It is northwest of Wichita, east-southeast of Denver, and west of Kansas City. WaKeeney is in the High Plains region of the Great Plains. It is about north of Big Creek, a tributary of the Smoky Hill River. A small tributary of Big Creek goes south from near the center of the city. The United States Census Bureau says that the city has a total area of . All of it is land. ==Climate== WaKeeney has a humid continental climate (Köppen Dfa). It has hot, humid summers and cold, dry winters. The average temperature is 52.8 °F (11 °C), and the average yearly precipitation is 23.6 inches (600 mm). Snowfall averages 25.2 inches (640 mm) per year. On average, January is the coldest month, and July is both the hottest month and the wettest month. The hottest temperature ever in WaKeeney was 110 °F (43 °C) in 1980; the coldest temperature ever was -25 °F (-32 °C) in 1989. ==People== ===2020 census=== The 2020 census says that there were 1,799 people, 837 households, and 482 families living in the city. Of the households, 73.5% owned their home and 26.5% rented their home. The median age was 47.4 years. Of the people, 93.6% were White, 0.6% were Asian, 0.2% were Black, 0.1% were Native American, 0.4% were from some other race, and 5.2% were two or more races. Hispanic or Latino of any race were 2.5% of the people. ===2010 census=== The 2010 census says that there were 1,862 people, 864 households, and 500 families residing in the city. ==Infrastructure== Interstate 70 and U.S. Route 40 run concurrently southeast- northwest just south of WaKeeney. They intersect U.S. Route 283, which goes north-south through WaKeeney. U.S. 283 goes east-west for one mile in downtown WaKeeney. It is concurrent with U.S. Route 40 Business and the old alignment of U.S. 40. Trego WaKeeney Airport is on the west side of U.S. 283. It is just south of I-70. The airport is publicly owned. It has one concrete runway. It is used for general aviation. Union Pacific Railroad has one freight railroad, the Kansas Pacific (KP) line, through WaKeeney. It goes east-west through the WaKeeney. ==Media== The Western Kansas World is the local newspaper. It is published once per week. K231BG is a translator of radio station KJIL in Copeland, Kansas. It broadcasts from WaKeeney on 94.1 FM. It plays a Contemporary Christian format. WaKeeney is in the Wichita-Hutchinson, Kansas television market. ==Famous people== *Charles Harris Garrigues (1903-1974), journalist *Steve Gotsche (1961- ), former PGA Tour and Nationwide Tour golfer *Andrew J. Harlan (1815-1907), U.S. Representative from Indiana *Frank Mechau (1904-1946), painter *Mike Schreiner (1969- ), Green Party of Ontario leader and Member of Provincial Parliament in the Legislative Assembly of Ontario since 2018 election *Orrin Upshaw (1874-1937), U.S. Olympic tug of war athlete ==References== ==Other websites== ;City * City of WaKeeney * WaKeeney - Directory of Public Officials ;Schools * USD 208, local school district ;Historical * History of WaKeeney ;Maps * WaKeeney City Map , KDOT Category:1879 establishments in Kansas Category:Cities in Kansas Category:County seats in Kansas Category:Trego County, Kansas",
 "title": "WaKeeney, Kansas"
}