{
 "id": "719621",
 "text": "Hoxie is a city in Sheridan County, Kansas, United States. It is also the county seat of Sheridan County. In 2020, 1,211 people lived there. ==History== Hoxie was planned in early 1886. The town creators convinced the residents of Kenneth, a community three miles to the north and the current county seat, to move south (including their buildings) at their expense to the new site of Hoxie. The people of Kenneth knew a railroad would go through Hoxie and not Kenneth, so the offer sounded good. The towns agreed to consolidate and carry out that plan, making Hoxie the new county seat. It was named for H. M. Hoxie, a railroad official. The railroad (which became part of the Union Pacific Railroad) came in 1888. The 99-mile Plainville-Colby line of the Union Pacific railroad was abandoned in 1998. It went through Hoxie.Surfact Transportation Board Decision, Docket No. AB-33, March 21, 1997 , STB.gov, Retrieved 23 October 2017The Plainville Branch, Abandonedrails.com, Retrieved 23 October 2017 ==Geography== Hoxie is at (39.355828, -100.439844). The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Hoxie has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Hoxie has a humid subtropical climate, abbreviated \"Cfa\" on climate maps. ==People== ===2020 census=== The 2020 census says that there were 1,211 people, 504 households, and 300 families living in Hoxie. Of the households, 70.2% owned their home and 29.8% rented their home. The median age was 40.4 years. Of the people, 90.4% were White, 0.6% were Native American, 0.6% were Asian, 0.2% were Black, 2.0% were from some other race, and 6.3% were two or more races. Hispanic or Latino of any race were 8.3% of the people. ===2010 census=== The 2010 census says that there were 1,201 people, 546 households, and 341 families living in Hoxie. ==Media== The Sheridan Sentinel is the local newspaper. It was published once per week. The name changed from The Hoxie Sentinel in 2016. The Hoxie Sentinel was created in 1884. It was called the Weekly Sentinel. It was called The Hoxie Sentinel from 1886 to 2016.About the Weekly Sentinel, Chronicling America, Retrieved 24 October 2017History of Kansas newspapers, p. 299 (1916) ==Famous people== * Les Barnhart, Major League Baseball player * Nick Hague, NASA astronaut * Dirk Johnson, professional football player, NFL * Brad Lambert, Head Coach, Charlotte 49ers (Collegiate football) * Urbane Pickering, Major League Baseball player * Gordon Sloan, associate justice of the Oregon Supreme Court * Erastus Turner, U.S. Representative from Kansas ==References== ==Other websites== ;City * Hoxie - Directory of Public Officials ;Schools * USD 412, local school district ;Historical * Sheridan County Historical Society & Mickey’s Museum ;Maps * Hoxie City Map , KDOT ;Newspaper * The Sheridan Sentinel Category:Cities in Kansas Category:County seats in Kansas",
 "title": "Hoxie, Kansas"
}