{
 "id": "719734",
 "text": "Jetmore is a city in Hodgeman County, Kansas, United States. It is also the county seat of Hodgeman County. In 2020, 770 people lived there. ==History== Jetmore was first called Buckner. It was planned as Buckner in 1879. The name was changed to Jetmore in 1880 in honor of Col. Abraham Buckles Jetmore.Bio of Abraham Buckles Jetmore in History of Kansas Abraham Jetmore was lawyer from Topeka. He was important in being able to get a railroad line through the city. He also helped make Jetmore the county seat.History of Jetmore, Kansas Another history of Jetmore ==Geography== Jetmore is at (38.084137, -99.895999). The United States Census Bureau says that the city has a total area of . All of it is land. The Buckner Creek, a tributary of the Pawnee River, flows through Jetmore. The surface rocks in this area include Greenhorn limestone and Graneros shale. ===Climate=== Jetmore has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Jetmore has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Jetmore, Kansas ==People== ===2020 census=== The 2020 census says that there were 770 people, 333 households, and 208 families living in the city. Of the households, 73.9% owned their home and 26.1% rented their home. The median age was 44.1 years. Of the people, 89.9% were White, 1.6% were Black, 0.8% were Asian, 0.5% were Native American, 0.1% were Pacific Islanders, 1.6% were from some other race, and 5.6% were two or more races. Hispanic or Latino of any race were 5.8% of the people. ===2010 census=== The 2010 census says that there were 867 people, 366 households, and 232 families residing in the city. ==References== ==Other websites== ;City * City of Jetmore * Jetmore - Directory of Public Officials ;Schools * USD 227, local school district ;Historical * Early History of Jetmore, 1912 ;Maps * Jetmore City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1879 establishments in Kansas",
 "title": "Jetmore, Kansas"
}