{
 "id": "719744",
 "text": "This is a list of vice presidents of the United States by time in office. ==Vice presidents by time in office== Rank Vice President Length in days Order of vice presidency President served under 1 tie Daniel D. Tompkins James Monroe 1 tie Thomas R. Marshall Woodrow Wilson 1 tie Richard Nixon Dwight D. Eisenhower 1 tie George H. W. Bush Ronald Reagan 1 tie Al Gore Bill Clinton 1 tie Dick Cheney George W. Bush 1 tie Joe Biden Barack Obama 8 John Nance Garner Franklin D. Roosevelt 9 John Adams George Washington 10 John C. Calhoun John Quincy Adams and Andrew Jackson 11 George Clinton Thomas Jefferson and James Madison 12 Spiro Agnew Richard Nixon 13 tie Aaron Burr Thomas Jefferson 13 tie Martin Van Buren Andrew Jackson 13 tie Richard Johnson Martin Van Buren 13 tie George M. Dallas James K. Polk 13 tie John C. Breckinridge James Buchanan 13 tie Hannibal Hamlin Abraham Lincoln 13 tie Schuyler Colfax Ulysses S. Grant 13 tie William A. Wheeler Rutherford B. Hayes 13 tie Levi P. Morton Benjamin Harrison 13 tie Adlai Stevenson Grover Cleveland 13 tie Charles W. Fairbanks Theodore Roosevelt 13 tie Charles G. Dawes Calvin Coolidge 13 tie Charles Curtis Herbert Hoover 13 tie Henry A. Wallace Franklin D. Roosevelt 13 tie Alben W. Barkley Harry S. Truman 13 tie Hubert Humphrey Lyndon B. Johnson 13 tie Walter Mondale Jimmy Carter 13 tie Dan Quayle George H. W. Bush 13 tie Mike Pence Donald Trump 32 Thomas Jefferson John Adams 33 James S. Sherman William Howard Taft 34 Lyndon B. Johnson John F. Kennedy 35 Henry Wilson Ulysses S. Grant 36 Garret Hobart William McKinley 37 Calvin Coolidge Warren G. Harding 38 Nelson Rockefeller Gerald Ford 39 Elbridge Gerry James Madison 40 Millard Fillmore Zachary Taylor 41 Thomas A. Hendricks Grover Cleveland 42 Gerald Ford Richard Nixon 43 Chester A. Arthur James A. Garfield 44 Theodore Roosevelt William McKinley 45 Harry S. Truman Franklin D. Roosevelt 46 William R. King Franklin Pierce 47 Andrew Johnson Abraham Lincoln 48 Kamala Harris Joe Biden 49 John Tyler William Henry Harrison ==Related pages== * Acting president of the United States * United States presidential line of succession ===Notes=== ==References== Category:Vice presidents of the United States",
 "title": "List of vice presidents of the United States by time in office"
}