{
 "id": "719736",
 "text": "Kingman is a city in Kingman County, Kansas, United States. It is also the county seat of Kingman County. In 2020, 3,105 people lived there. ==History== Kingman was planned out in 1874. It was named for Samuel A. Kingman, chief justice of the supreme court. ==Geography== Kingman is at (37.647712, -98.115993). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Kingman has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Kingman has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Kingman, Kansas ==People== ===2020 census=== The 2020 census says that there were 3,105 people, 1,335 households, and 782 families living in Kingman. Of the households, 64.2% owned their home and 35.8% rented their home. The median age was 43.7 years. Of the people, 90.9% were White, 1.0% were Asian, 0.6% were Native American, 0.6% were Black, 2.0% were from some other race, and 4.9% were two or more races. Hispanic or Latino of any race were 5.2% of the people. ===2010 census=== The 2010 census says that there were 3,177 people, 1,346 households, and 810 families living in Kingman. ==Transportation== Bus service is provided daily east to Wichita, Kansas and west to Pueblo, Colorado by BeeLine Express (subcontractor of Greyhound Lines).BeeLine ExpressGreyhound Lines ==Famous people== * George Aiton, Major League Baseball player. * Clyde Cessna, founder of the Cessna Aircraft Corporation. * Martin Dewey, American orthodontist. * Eugene John Gerber, Roman Catholic bishop. * Don Lock, Major League Baseball player. ==References== ==Other websites== ;City * City of Kingman * Kingman - Directory of Public Officials ;Schools * USD 331 , local school district ;Maps * Kingman City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1874 establishments in Kansas",
 "title": "Kingman, Kansas"
}