{
 "id": "719732",
 "text": "Johnson City is a city in Stanton County, Kansas, United States. It is also the county seat of Stanton County. In 2020, 1,464 people lived there. ==History== Johnson City was created in 1885; it was first called Veteran because many of its creators were American Civil War veterans. It was renamed Johnson City in 1886, in honor of A. S. Johnson, a railroad worker. ==Geography== Johnson City is at (37.569623, -101.752901). The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== The Köppen Climate Classification system says that Johnson City has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Johnson City, Kansas ==People== ===2020 census=== The 2020 census says that there were 1,464 people, 531 households, and 366 families living in Johnson City. Of the households, 70.4% owned their home and 29.6% rented their home. The median age was 34.4 years. Of the people, 50.5% were White, 2.2% were Native American, 0.3% were Black, 0.1% were Asian, 28.8% were from some other race, and 18.1% were two or more races. Hispanic or Latino of any race were 53.1% of the people. ===2010 census=== The 2010 census says that there were 1,495 people, 533 households, and 381 families living in Johnson City. ==Education== Johnson has the USD 452 Stanton County. The Stanton County High School mascot is Stanton County Trojans. Prior to school unification, Johnson High School also used the mascot Trojans.\"Johnson Trojans\", Garden City Telegram, 14 October 1978, p.8. In 2016, Stanton County Elementary School, which is in Johnson City, was given the Charlotte F. Lockhart Award for Excellence in Literacy Education. ==References== ==Other websites== ;City * City of Johnson City * Johnson City - Directory of Public Officials ;Schools * USD 452 , local school district ;Maps * Johnson City Map , KDOT Category:1885 establishments in Kansas Category:Cities in Kansas Category:County seats in Kansas",
 "title": "Johnson City, Kansas"
}