{
 "id": "719874",
 "text": "Coldwater is a city in Comanche County, Kansas, United States. It is also the county seat of Comanche County. In 2020 census, 687 people lived there. ==History== In 1884 G.W. Vickers, thought of planning out a town in the northern part of Comanche county. He did this with Timothy Shields, J.P. Grove, Samuel Sisson, C.M. Cade and C.D. Bickford. All of them were from Harper county. They got some land, had it platted off as a town site, and they named it after the city of Coldwater, Michigan. Early in 1885, the county had the necessary number of people. They asked the governor organize the county. On February 27, 1885, it was organized. Owen Connaughton, George M. Morris, and David T. Mclntire became county commissioners, and R.A. Grossman became the county clerk. Coldwater became the county seat.History of Comanche County, Kansas. A Cyclopedia of State History. Frank Wilson Blackmar, 1912. The first post office in Coldwater was created on October 17, 1884. ==Geography== The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Coldwater has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Coldwater has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Coldwater, Kansas ==People== ===2020 census=== The 2020 census says that there were 687 people, 345 households, and 176 families living in Coldwater. Of the households, 76.8% owned their home and 23.2% rented their home. The median age was 45.4 years. Of the people, 91.8% were White, 0.6% were Black, 0.1% were Native American, 1.3% were from some other race, and 6.1% were two or more races. Hispanic or Latino of any race were 6.0% of the people. ===2010 census=== The 2010 census says that there were 828 people, 380 households, and 217 families living in Coldwater. ==Education== Coldwater is served by the South Central USD 300. South Central High School is located in Coldwater. ==Famous people== * Chick Brandom, baseball player * Harold S. Herd, former Kansas Supreme Court justice and mayor of Coldwater, ==References== ==Other websites== ;City * City of Coldwater * Coldwater - Directory of Public Officials ;County * Comanche County ;Schools * USD 300, local school district ;Photos and Videos * KWCH 'One of a Kind' Kansas road trip in 2011: Photos, Video 1, Video 2. Towns included were Coldwater, Sterling, Atwood, Lucas, Marion. ;Maps * Coldwater City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:Comanche County, Kansas",
 "title": "Coldwater, Kansas"
}