{
 "id": "719872",
 "text": "Cimarron is a city in Gray County, Kansas, United States. It is also the county seat of Gray County. In 2020 census, 1,981 people lived there. ==History== Cimarron was first settled in 1878. It took its name from a fork in the Chisholm Trail. The fork led people to the Cimarron River. Between 1887 and 1893, a county seat war happened in Gray County. It involved several famous Old West figures, such as Bat Masterson, Bill Tilghman, and Ben Daniels. Because of the dispute, Cimarron became the permanent county seat of Gray County. In the early morning of June 10, 1893, Bill Doolin and four members of his gang robbed a train one-half mile east of Cimarron.Bailey C. Hanes, Bill Doolin: Outlaw O.T., Norman, 1968, pages 79-85 In 2016, the Southwest Chief owned by Amtrak derailed. Amtrak and BNSF filed a lawsuit against one of the companies in Cimarron for using a road vehicle to damage the rails. ==Geography== Cimarron is at (37.808332, −100.347413). The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== The Köppen Climate Classification system says that Cimarron has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Cimarron, Kansas ==People== ===2020 census=== The 2020 census says that there were 1,981 people, 745 households, and 526 families living in Cimarron. Of the households, 71.5% owned their home and 28.5% rented their home. The median age was 37.1 years. Of the people, 80.3% were White, 0.7% were Native American, 0.6% were Black, 0.4% were Asian, 7.6% were from some other race, and 10.4% were two or more races. Hispanic or Latino of any race were 20.4% of the people. ===2010 census=== The 2010 census says that there were 2,184 people, 789 households, and 569 families living in Cimarron. ==Famous people== * Ian Campbell, former defensive end for Kansas State University * Nicholas Klaine, journalist (editor of the Dodge City Times and New West Echo), built the Cimarron Hotel ==Related pages== * Santa Fe Trail ==References== ==Other websites== ;City * City of Cimarron * Cimarron – Directory of Public Officials ;Schools * USD 102, local school district ;Maps * Cimarron City Map , KDOT Category:Cities in Gray County, Kansas Category:County seats in Kansas Category:1878 establishments in Kansas",
 "title": "Cimarron, Kansas"
}