{
 "id": "719852",
 "text": "Anthony is a city in Harper County, Kansas, United States. It is also the county seat of Harper County. In 2020, 2,108 people lived there. ==History== The Anthony townsite was planned out in 1878. The city was named after the 7th governor of Kansas, George T. Anthony. He was governor at the time. After Harper County was reorganized in 1878, Anthony became the temporary county seat. This is because Bluff City, which was county seat of the fraudulent county organization, did not exist at the time. In 1879, a county seat election was held, and Anthony won over Harper City even though 2,960 ballots were cast with 800 legal voters in the county. ==Geography== Anthony is at (37.153902, -98.029396). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Anthony has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Anthony has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Anthony, Kansas ==People== ===2020 census=== The 2020 census says that there were 2,108 people, 922 households, and 538 families living in Anthony. Of the households, 65.7% owned their home and 34.3% rented their home. The median age was 41.7 years. Of the people, 90.3% were White, 2.1% were Native American, 0.6% were Black, 0.4% were Asian, 0.1% were Pacific Islanders, 0.9% were some other race, and 5.6% were two or more races. Hispanic or Latino of any race were 5.2% of the people ===2010 census=== The 2010 census says that there were 2,269 people, 977 households, and 631 families living in the city. ==Education== Anthony is served by USD 361 Anthony-Harper. ==Famous people== * Dennis Moore, Congressman, 3rd District Kansas 1999-2011, born in Anthony.Dennis Moore, Biographical Directory of the United States Congress. Retrieved 23 August 2016. * Virgil A. Richard, United States Army general, was born in Anthony.Virgil Richard-obituary ==References== ==Other websites== * City of Anthony * Anthony Chamber of Commerce * Anthony City Map , KDOT Category:1878 establishments in Kansas Category:Cities in Harper County, Kansas Category:County seats in Kansas",
 "title": "Anthony, Kansas"
}