{
 "id": "719888",
 "text": "George Henry Crumb Jr.Richard Steinits, \"Crumb, George (Henry)\", The New Grove Dictionary of Music and Musicians, secnd edition, edited by Stanley Sadie and John Tyrrell (London: Macmillan Publishers, 2001).Nicolas Slonimsky, Laura Kuhn, and Dennis McIntire, \"Crumb, George (Henry Jr.)\", Baker's Biographical Dictionary of Musicians, edited by Nicolas Slonimsky and Laura Kuhn (New York, NY: Schirmer, 2001): 2:765–66. (October 24, 1929 - February 6, 2022) was an American composer. His works were modern classical and avant-garde music. He is known for creating unusual timbres, alternative forms of notation, and extended instrumental and vocal techniques. Crumb’s most famous works include Ancient Voices of Children (1970), Black Angels (1971), and Makrokosmos III (1974). Crumb won the 1968 Pulitzer Prize for Music for his orchestral work Echoes of Time and the River and a 2000 Grammy Award for Best Contemporary Composition for his work Star-Child . Crumb was born in Charleston, West Virginia. He studied at the University of Charleston, University of Illinois at Urbana-Champaign and at the University of Michigan. He had one son, composer David and had one daughter actress Ann Crumb (who died in October 2019). Crumb died on February 6, 2022 in Media, Pennsylvania at the age of 92.George Crumb, Eclectic Composer Who Searched for Sounds, Dies at 92 ==References== ==Other websites== *Official home page *Crumb's bio from Naxos *George Crumb interview by Bruce Duffie, August 27, 1988 *Art of the States: George Crumb four works by the composer *George Crumb: Voice of the Whale plays Vox Balaenae with a synchronized display of its score *An interview with George Crumb in September, 2009 by Marc Medwin *Recordings of premiere performances of The Yellow Moon of Andalusia and Yesteryear (revised 2015) San Francisco Contemporary Music Players Category:1929 births Category:2022 deaths Category:American Grammy Award winners Category:Pulitzer Prize winners Category:American composers Category:Writers from West Virginia Category:People from Charleston, West Virginia",
 "title": "George Crumb"
}