{
 "id": "719870",
 "text": "Atwood is a city in Rawlins County, Kansas, United States. It is also the county seat of Rawlins County. In 2020, 1,290 people lived there. ==History== In 1875, T.A. Andrews and J.M. Matheny went to Rawlins County. They started a town site about two miles east of the current city. The city of Attwood (with two t's) was named after Attwood Matheny. He was the 14-year-old son who went with his father on the trip. In 1882, the U.S. Post Office requested permission to drop one \"t\" thus becoming Atwood. In 1881, Atwood became the county seat of Rawlins County.Atwood history ==Geography== Atwood is at (39.8099, -101.041893). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== The Köppen Climate Classification system says that Atwood has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Atwood, Kansas ==Area attractions== * Rawlins County Historical Museum, 308 State Street. * Shirley Opera House (NRHP), 503 Main Street. ==Area events== * Rawlins County Fair, held in July. * Smokin on the Beaver BBQ competition, held the last full weekend in September. * Annual Rod Run, held annually in May. ==People== ===2020 census=== The 2020 census says that there were 1,290 people, 557 households, and 324 families living in Atwood. Of the households, 68.4% owned their home and 31.6% rented their home. The median age was 42.4 years. Of the people, 87.2% were White, 1.0% were Black, 0.3% were Asian, 0.2% were Native American, 3.6% were from some other race, and 7.7% were two or more races. Hispanic or Latino of any race were 9.5% of the people. ===2010 census=== The 2010 census says that there were 1,194 people, 568 households, and 299 families living in Atwood. ==Famous people== *Mike Hayden, 41st Governor of Kansas 1987–1990. * Ted Uhlaender, Major League Baseball outfielder for the Minnesota Twins, Cleveland Indians and Cincinnati Reds from –.Moss, Irv. \"Uhlaender, big-league outfielder and scout, dies,\" The Denver Post, Friday, February 13, 2009. Katie Uhlaender (born July 17, 1984) is an American skeleton racer who has competed since 2003. She won four medals at the FIBT World Championships with one silver (women's skeleton: 2008) and three bronzes (women's skeleton: 2007, mixed bobsleigh-skeleton team event: 2008, 2009). ==References== ==Other websites== ;City * City of Atwood * Atwood – Directory of Public Officials ;County * Rawlins County ;Schools * USD 105, local school district ;Newspapers * Square Deal News ;Photos and Videos * Historic city photograph * KWCH 'One of a Kind' Kansas road trip in 2011: Photos, Video 1, Video 2, Video 3, Video 4, Video 5. Towns included were Coldwater, Sterling, Atwood, Lucas, Marion. ;Maps * Atwood City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1875 establishments in Kansas",
 "title": "Atwood, Kansas"
}