{
 "id": "719970",
 "text": "Al Hunter Ashton (26 June 1930 – 27 April 2007), born Alan Hunter, was an English actor and script writer. ==Life== Hunter was born in Birmingham, Warwickshire. He came from a working-class background. He was named Alan Hunter at birth. He later changed his name by deed poll to Al Hunter. He wrote scripts for his own amusement from the age of 15. In his spare time he worked for £15 a night as a stand-up comedian in clubs. On discovering that he could earn the same amount for shedding his clothes every evening, he became a stripper. \"My stripping routine was actually funnier than my stand-up one,\" he said. He wrote under the name \"Al Hunter\" but needed to change his name for acting as there was already an Al Hunter actor. He choose \"Al Ashton\" to ensure he appeared high up in any alphabetical credits. Later he combined the two, acting and writing under the name \"Al Hunter Ashton\". He also wrote under the alias Alun Nipper., ==Work== His first professional acting work was with a Theatre in Education company in Melton Mowbray, Leicestershire. He was then cast in Willy Russell plays; Breezeblock Park (at the Liverpool Playhouse) and Blood Brothers (at the Derby Playhouse). In 1985, Russell commissioned him to write the BBC Schools television play Teaching Matthew. This is a satire on Russell's own Educating Rita. Hunter often wrote himself parts in the scripts he produced. In Teaching Mathew he had a small role as a policeman. Hunter worked very closely with the Stage 22 School of Arts Network in the UK. Following his death, children from the school made their own version of the Queen hit Only the Good Die Young which was dedicated to him and his three young children. ===List of acting roles (incomplete)=== * Angels. Played Mike Hathaway in the long running BBC TV drama series. * Crossroads. Soap. Played Ray Grice. 108 episodes. Central TV. * The Brittas Empire. Appeared as a tanker driver in Episode 8 of Series 4. * Jack & the Beanstalk. Pantomime. Playing Fireman Sampson in the Stage 22 production at the Towngate Theatre, Basildon - Christmas 2006. * Jekyll. Serial drama. Played Christopher. * London's Burning. LWT's drama series about firefighters. Played Raymond \"Pitbull\" Darby, the loud mouthed station bully. * Emmerdale. Soap. Played Colin Long. 7 episodes. Yorkshire Television. * Mr In-Between. Film. Played Fat Dave. * The 10th Kingdom A TV mini-series. As a prisoner alongside Jimmy Nail (Clayface the Goblin). * Wire in the Blood. Darren Toynton. ITV. Dir: Robson Green * Sisterhood (2008). Film. Played Reggie ===List of writing credits (incomplete)=== * Alison BBC TV screenplay * EastEnders. BBC TV soap. Regular contributor since 1987. Writer/storyliner. * Holby City. Lead core writer, storyliner, producer. * Pieces of a Silver Lining. BBC Afternoon Theatre with Martin Jameson * Safe. BAFTA winner. Best Single Drama. see Other websites below * Teaching Matthew. BBC TV. Script writer and actor * The Broker's Man. Creator and writer. (with Tim O'Mara). * The Firm. BBC TV film. Writer (as Al Hunter). * Alive and Kicking. Film shown in series 3 of BBC drama anthology 'Screen One'. == Death == On 27 April 2007 Al Hunter Ashton died of heart failure in his home in High Wycombe, Buckinghamshire. Episode eight of series five of the New Tricks TV series, titled \"Mad Dogs\", was dedicated to his memory. ==Awards== * Safe (1993), a harrowing tale of homelessness. Won the 1994 BAFTA award for Best Single Drama. Al Ashton, writer. ==Filmography== Year Title Role Notes 1982 Remembrance John 1986 Agent on Ice Thug 1988 A Fish Called Wanda Warder 1998 Ever After Cargomaster 1999 Treasure Island George Merry 2000 Gladiator Rome Trainer #1 2000 The Wedding Tackle Taxi Driver 2001 From Hell Stonecutter 2001 Mr In-Between Fat Dave 2008 Incendiary Male Survivor 2008 Sisterhood Reggie (final film role) ==Notes== ==Other websites== * * Safe (1993) at Screenonline * * BBC Comedy Guide * Category:1957 births Category:2007 deaths Category:English movie actors Category:20th-century English writers Category:English television actors Category:Television writers",
 "title": "Al Hunter Ashton"
}