{
 "id": "720240",
 "text": "Sadeque Hossain Khoka (12 May 1952 – 4 November 2019) was a Bangladeshi politician. He served as the 2nd mayor of Dhaka City Corporation during 2002 to 2011. He was the vice chairman of the Bangladesh Nationalist Party and was President of undivided Dhaka city BNP for longest period of the organisation's existence. ==Early life and career== Khoka was born in a Muslim family. His father was an engineer and a social worker. Khoka attended Dhaka University and completed M.A. in psychology. In 1971 at the age of 19 he fought in the Bangladesh Liberation War. After independence, he worked in organizing soccer, rising to the positions of General Secretary of the Dhaka Metropolitan Football Association and Joint General Secretary of the Bangladesh Football Federation. Khoka was the key person of the football club Brothers Union. Khoka was first elected to the Jatiyo Sangshad (national legislature) in 1991. In the same year he was made State Minister of Youth and Sports. Khoka also won from his constituency in elections in 1996 and 2001. After Bangladesh Nationalist Party's victory in 2001, Khoka was made Cabinet Minister of Fisheries and Livestock. Being in the office, he fought the Dhaka City Corporation election for mayorship and won. He took office as the Mayor of Dhaka on 25 April 2002. He served as both Minister and Mayor till 2004 when he resigned from the ministry. Khoka resigned from the mayoral duties of Dhaka on 29 November 2011, when the government passed a bill in parliament to split DCC (Dhaka City Corporation) into two parts and renamed them DCC North and DCC South. In 2013, Khoka compared the crackdown on Hefazat protestors to the Pakistani crackdown on 25 March and Jalianwala Bagh massacres. In response, Detective Branch police raided the houses of Sadeque Hossain Khoka and Bangladesh Jatiya Party chairman Andaleeve Rahman Partha. ==Family== Khoka was married to Ismat Ara and had two sons and a daughter. His eldest son Ishraque Hossain is a politician and Bangladesh Nationalist Party candidate in 2018 Mayoral election in Dhaka. Another son Ishfaque Hossain is now a Bachelor level student from University of Hertfordshire. His daughter Sarika Sadeque is married to Ahmed Iftekhar, Son of Ahmad Nazir, Ex Parliament Member. Both of them pursued MBA degree from Durham University. == Death == Khoka died from cancer on 4 November 2019 in New York. ==References== Category:1952 births Category:2019 deaths Category:Bangladeshi politicians Category:People from Dhaka Category:5th Jatiya Sangsad members Category:6th Jatiya Sangsad members Category:7th Jatiya Sangsad members Category:8th Jatiya Sangsad members",
 "title": "Sadeque Hossain Khoka"
}