{
 "id": "720464",
 "text": "Larned is a city in Pawnee County, Kansas, United States. It is also the county seat of Pawnee County. In 2020, 3,769 people lived there. ==History== Larned was planned out in 1873. The first post office in Larned was created in 1872. The city was named after nearby Fort Larned, which operated from 1859 to 1878. It was also named after Colonel Benjamin F. Larned, U.S. Army Paymaster from July 1854 to his death September 6, 1862. ==Geography== Larned is at (38.18339, -99.101261). The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== Larned has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Larned has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Larned, Kansas ==People== ===2020 census=== The 2020 census says that there were 3,769 people, 1,704 households, and 919 families living in Larned. Of the households, 64.5% owned their home and 35.5% rented their home. The median age was 42.6 years. Of the people, 85.8% were White, 2.4% were Black, 0.6% were Native American, 0.4% were Asian, 0.1% were Pacific Islanders, 1.7% were from some other race, and 9.0% were two or more races. Hispanic or Latino of any race were 8.5% of the people. ===2010 census=== The 2010 census says that there were 4,054 people, 1,824 households, and 1,027 families living in Larned. ==Media== The local newspaper is Larned Tiller & Toiler. ==Famous people== * Belle Jennings Benchley, \"the Zoo lady\", former director of the San Diego Zoo * Gene Keady, current Big Ten sportscaster, former head coach for the Purdue Boilermakers men's basketball team * Hal Patterson, former professional football player and member of the Canadian Football Hall of Fame * Glee S. Smith, Jr., former Kansas state legislator and lawyer * Ralph Terry, retired New York Yankees pitcher, 2× All- Star (1961, 1962), 2× World Series champion (1961, 1962), World Series MVP (1962), AL wins leader (1962), former professional golfer in retirement * Mitch Webster, retired Major League Baseball outfielder * John Zook, former football player, all-state, all Big 8 (University of Kansas), and all-pro NFL player ==Related pages== * Santa Fe Trail ==References== ==Other websites== ;City * City of Larned ;Schools * USD 495 , local school district ;Historical * Fort Larned National Historic Site * Santa Fe Trail Center * Historic Passenger Rail service in Pawnee County * Postcards from Larned * Historic Images of Larned, Special Photo Collections at Wichita State University Library. ;Maps * Larned City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:Pawnee County, Kansas",
 "title": "Larned, Kansas"
}