{
 "id": "720462",
 "text": "La Crosse is a city in Rush County, Kansas, United States. It is also the county seat of Rush County. In 2020, 1,266 people lived there. La Crosse calls itself the \"Barbed Wire capital of the world.\" ==History== La Crosse was created in 1876. It was named after the city of La Crosse, Wisconsin. La Crosse subsequently became the intended county seat, and county records were transferred there from the temporary county seat, nearby Rush Center. A county seat war ensued between the two communities, lasting until La Crosse was declared the permanent county seat and the construction of the county courthouse in 1888. In the 1960s, La Crosse became a regional center of barbed wire collecting, leading to the establishment of the Kansas Barbed Wire Museum and the nicknaming of the city as \"The Barbed Wire Capital of the World\". ===Tornado of 2012=== On May 25, 2012, an EF-1 tornado caused about four blocks of a lot of damage, and two businesses were destroyed. A third of the businesses had very bad damage. There were no injuries.La Crosse residents continue to clean up after twister ; KWCH; May 27, 2012. ==Geography== La Crosse is at (38.532014, -99.308614). It has an elevation of 2,057 feet (627 m). It is in the Smoky Hills region of the Great Plains. It is about south of the Smoky Hill River and north of Walnut Creek, which is a tributary of the Arkansas River. Sand Creek, a tributary of Walnut Creek, goes southeast around the southwestern and southern parts of the city. Mule Creek, a small tributary of Sand Creek, flows southeast through the city. It is in west-central Kansas at the intersection of U.S. Route 183 and K-4. La Crosse is northwest of Wichita, west-southwest of Kansas City, and east-southeast of Denver. The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== On average in La Crosse, July is the hottest month, January is the coldest month, and May is the wettest month. The hottest temperature ever in La Crosse was 115 째F (46 째C) in 1954; the coldest temperature ever was -24 째F (-31 째C) in 1989. ==People== ===2020 census=== The 2020 census says that there were 1,266 people, 547 households, and 318 families living in La Crosse. Of the households, 73.5% owned their home and 26.5% rented their home. The median age was 45.6 years. Of the people, 94.8% were White, 0.3% were Black, 0.3% were Asian, 0.1% were Native American, 0.7% were from some other race, and 3.8% were two or more races. Hispanic or Latino of any race were 4.7% of the people. ===2010 census=== The 2010 census says that there were 1,342 people, 606 households, and 350 families living in La Crosse. ==Education== La Crosse Public Schools (USD 395) controls three schools in the city. ==Infrastructure== ===Transportation=== Rush County Airport is northeast of the city. It is on the north side of K-4. It is publicly owned. It has one runway. It is used for general aviation. A railroad of the Kansas and Oklahoma Railroad goes southeast-northwest through La Crosse. ==Media== The Rush County News is the local newspaper. It is published once per week in La Crosse. La Crosse is in the Wichita-Hutchinson, Kansas television market. ==References== ==Other websites== ;City * City of La Crosse * La Crosse - Directory of Public Officials ;Schools * USD 395, local school district ;Historical * History of Cities in Rush County * La Crosse Info, Legends of Kansas ;Maps * La Crosse City Map , KDOT Category:Cities in Rush County, Kansas Category:County seats in Kansas Category:1876 establishments in Kansas",
 "title": "La Crosse, Kansas"
}