{
 "id": "720437",
 "text": "Cottonwood Falls is the biggest city of Chase County, Kansas. It is also the county seat of Chase County. In 2020, 851 people lived there. ==History== The first settlement in the Cottonwood Falls area was in 1854. An Indian trader named Seth Hayes created a cattle ranch on the Cottonwood River. In 1859, the area around the town was organized as Chase County. Cottonwood Falls was chosen to be the temporary county seat. Other early people came in Cottonwood and nearby land from 1856 to 1858.William G. Cutler's History of the State of Kansas http://www.kancoll.org/books/cutler/chase/chase-co-p1.html The first post office in Cottonwood Falls was created in 1858. In 1873, the city's French Renaissance style Chase County courthouse was built. Around the same time, the Atchison, Topeka and Santa Fe Railway reached Cottonwood Falls area. Through the late 19th century and early 20th century the area around the city was mostly farms and cattle ranches. ==Geography== Cottonwood Falls is at (38.368211, -96.542755). It is in the Flint Hills of the Great Plains. The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Cottonwood Falls has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Cottonwood Falls has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Cottonwood Falls, Kansas ==People== Cottonwood Falls is part of the Emporia Micropolitan Statistical Area. ===2020 census=== The 2020 census says that there were 851 people, 318 households, and 179 families living in Cottonwood Falls. Of the households, 74.2% owned their home and 25.8% rented their home. The median age was 41.9 years. Of the people, 77.3% were White, 1.9% were Black, 0.9% were Asian, 0.2% were Native American, 0.2% were Pacific Islanders, 14.9% were from some other race, and 4.5% were two or more races. Hispanic or Latino of any race were 17.7% of the people. ===2010 census=== The 2010 census says that there were 903 people, 342 households, and 205 families living in Cottonwood Falls. ==Education== Cottonwood Falls is part of Unified School District 284.USD 284Kansas School District Boundary Map ==Infrastructure== ===Transportation=== K-177 highway goes north-south through the city. Chase County Airport, FAA:9K0, is south- east of 8th St and Airport Rd.Chase County Airport information ==Things to see== Cottonwood Falls has five things on the National Register of Historic Places (NRHP). * Cartter BuildingNational Register of Historic Places - Cartter Building (NRHP). * Chase County CourthouseNational Register of Historic Places - Chase County Courthouse (NRHP). It is the oldest courthouse in continual use in the state of Kansas and one of the oldest in continual use West of the Mississippi. * Chase County National BankNational Register of Historic Places - Chase County National Bank (NRHP). * Cottonwood River BridgeNational Register of Historic Places - Cottonwood River Bridge (NRHP).Cottonwood Falls Dam & Bridge - Kansas Travel * Samuel N Wood HouseNational Register of Historic Places - Samuel N Wood House (NRHP). * Kansas Historical Marker - A Landmark Of Distinction, located in courthouse square.Kansas Historical Marker - A Landmark Of Distinction * Chase Lake FallsChase Lake Falls - Kansas Travel ==Famous people== * John Campbell III, U.S. Representative from California, accountant, automobile dealer. * Dudley Doolittle (1881-1957), U.S. Representative from Kansas, lawyer, banker. * Harley Martin (1880-1951), Wisconsin state legislator and farmer'Wisconsin Blue Book 1933,' Biographical Sketch of Harley A. Martin, pg. 253 * William Morgan (1866-1932), newspaper publisher and editor, author, lieutenant governor of Kansas 1915-19 * Samuel Wood (December 30, 1825 – June 23, 1891), was an American attorney and Kansas politician. ==Related pages== * Great Flood of 1951 ==References== ==Other websites== ;City * City of Cottonwood Falls * Cottonwood Falls - Directory of Public Officials * Chase County Chamber of Commerce ;Schools * USD 284, school district for all of Chase County. * USD 284 School District Boundary Map , KDOT ;Historical * Rockne Memorial , Knute Rockne crash site. * Poster from Chase County Agricultural Fair from October 7-9, 1891 ;Lodging * Grand Central Hotel ;Maps * Cottonwood Falls City Map , KDOT * Topo Map of Cottonwood Falls / Bazaar area, USGS * Chase County Maps: Current , Historic , KDOT Category:Cities in Chase County, Kansas Category:County seats in Kansas Category:Chase County, Kansas",
 "title": "Cottonwood Falls, Kansas"
}