{
 "id": "720428",
 "text": "is a well known developer of video games. They are famous for their The King of Fighters series, Fatal Fury series, Metal Slug series, Samurai Shodown series, Psycho Soldier, Art of Fighting series, and much more games. They were founded on July 22, 1978 as Shin Nihon Kikaku by Eikichi Kawasaki and began by developing coin-op games. In March 1988, SNK staff moved to a building in Suita, Osaka, Japan. SNK would end up declaring bankruptcy on October 30, 2001. After bankruptcy proceedings began, SNK-related rights were auctioned off, and Playmore, a former affiliate company (later SNK Playmore → second generation SNK), won the bid. Currently, the company is still announcing sequels to some of SNK's works. Three Neo Geo Land stores near Esaka Station continued to operate even after SNK went bankrupt, but all of them were closed by 2005 due to a review of SNK Playmore's operations. Most of the site has been demolished and is now used as a parking lot, but only the site (building) of the second Esaka store remains, and is occupied by tenants. SNK Playmore is headquartered in Suita City, the same city as the old company, and in 2016 changed its name to \"SNK Corporation\", the same as the old company. == Message == SNK, the developer and inventor of the NeoGeo, are now out of business. On their website, the SNK team says goodbye and thanks all SNK fans. SNK had been supplying arcades with titles like Ikari Warriors and Prehistoric Isle since 1978, long before the NeoGeo. Today, Monday (October 29, 2001), which will probably go down in NeoGeo history as Black Monday, marks the end of the SNK era after 23 years. As a final gimmick, SNK is offering a wallpaper for download on their website, as a kind of farewell gift for fans. Since the website is a bit overwhelmed at the moment, you can also download It from us and SNK's message to all its fans: == References == Category:Video game companies of Japan Category:1978 establishments in Japan Category:2001 disestablishments Category:2000s disestablishments in Japan",
 "title": "SNK"
}