{
 "id": "720542",
 "text": "Rob Moran, is an actor and producer. Moran has appeared in over 60 films. He has produced a few of them. ==Personal life== In 1982, Moran graduated from Emerson College. In 1985, Rob and actress Julie Bryan began dating. They met on a Ford automotive commercial. They were married in 1987. In 1999, their daughter Maiya Dupree was born. In 2004, their second daughter Makayla-Amet was born. ==Filmography== Year Film Part Pre-Production Touch the Fire Allanson's Dad 2019 The Legend of 5 Mile Cave William Davis 2018 Run the Race Mac 2018 American Dresser Brian (also Executive Producer) 2018 Lez Bomb Ken (also Producer) 2017 Sex.Sound.Silence Mike Diesel 2016 Long Nights Short Mornings (Executive Producer) 2014 Blended Baseball Dad 2014 Heaven Is For Real Dr. O'Holleran 2013 Star Trek Into Darkness U.S.S. Vengeance Ensign 2013 The B.S. Club Peter 2012 Just an American A.J. 2011 You're Next Paul 2011 Hall Pass Ed Long 2009 The Things We Carry Steven 2009 The Outside Tim Evans 2009 2:13 Russell's Father 2008 Proud American A.J. 2008 Meet Dave ER Doctor 2007 National Lampoon's Bag Boy Ralph Riley (and Producer) 2006 Peaceful Warrior Dan Millman Sr. 2004 The Almost Guys Team Rep 2001 Shallow Hal 2nd Hostess Tiffany 2000 Me, Myself & Irene Trooper Finneran 1999 Late Last Night (Director) 1998 Beach Movie Reporter Brett Bronson 1997 Fallen Arches Company Rep 1996 Kingpin Stanley Osmanski 1994 Dumb & Dumber Bartender 1994 The Cowboy Way Bartender 1991 Ted & Venus Patient 1991 Wedlock Security Guard 1990 Navy SEALs (film) U.S. Navy Co-Pilot 1989 the Runnin' Kind Jerk in Jeep 1986 Quiet Cool Briggs ==Television== Year Show Part 2019 Wedding at Graceland Tyler 2014 Rake (American TV Series) Slater 2012 Hatfields & McCoys (miniseries) John B. Floyd 2009 United States of Tara Pastor Hitch Maurio 2009 Men of a Certain Age 2008 According to Jim 2008 South of Nowhere Arthur Carlin 2008 3Way Brick Schtouse 2007 Fetch Husband 2006 NUMB3RS Jon Northrup 2005 Without a Trace Scott Mohr 2005 CSI: Miami Walter Rockingham 2004 Cold Case Max Tanning 2003 The West Wing Art Hughes 2003 Knee High P.I. Policeman 2002-2003 Days of Our Lives Mayor Arthur Shepard 2001 It's Like, You Know... Slick Guy 2001 JAG (TV series) Cyrus Fortney 2000 The Man Who Ate a Car Michael Walter 1999 JAG (TV series) Cop 1990 Designing Women 1990 FM Drew 1990 Matlock Assistant D.A. John 1989 Cheers Dennis 1989 Tour of Duty Aide 1988 Police Story: The Watch Commander Chuck Stone ==References== ==Other websites== * * Category:Living people Category:American movie actors Category:American television actors Category:Mexican movie actors Category:1963 births Category:People from San Luis Potosí",
 "title": "Rob Moran"
}