{
 "id": "720631",
 "text": "Mankato is a city in Jewell County, Kansas, United States. It is also the county seat of Jewell County. In 2020, 836 people lived there. ==History== Mankato was first called Jewell Center. It planned out in 1872. It was renamed to Mankato in 1880, it was named after Mankato, Minnesota. Mankato was incorporated as a city in 1880. The first post office in the town was created in August 1872. It was first called \"Jewell Center.\" The post office was renamed to Mankato in April 1880. ==Geography== Mankato is at (39.787220, -98.209274). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 836 people, 404 households, and 217 families living in Mankato. Of the households, 70.3% owned their home and 29.7% rented their home. The median age was 50.0 years. Of the people, 92.2% were White, 0.8% were Native American, 0.7% were Asian, 0.2% were Black, 0.8% were from some other race, and 5.1% were two or more races. Hispanic or Latino of any race were 2.6% of the people. ===2010 census=== The 2010 census says that there were 869 people, 405 households, and 242 families living in Mankato. ==Education== Mankato has USD 107 Rock Hills. The Rock Hills High School mascot is the Grizzlies. Before school unification, Mankato was home to Mankato High School. Its mascot was the Cougars. The Mankato Cougars\"Mankato Downs White Rock 46-26\", The Belleville Telescope, 26 September 1985, p.10. won the Kansas State High School boys class B basketball championship in 1943. ==Famous people== * Wint Smith (1892–1976) Congressman, represented Kansas from 1947-1961. * Ernest Tippin (1890-1958) Olympic sharpshooter. *Gregg Doud, Chief Agricultural Negotiator, Rank of Ambassador, in the Office of the United States Trade Representative, being confirmed March 1, 2018. ==References== ==Other websites== ;City * City of Mankato * Mankato - Directory of Public Officials ;Schools * USD 107, local school district ;Maps * Mankato City Map , KDOT Category:Cities in Jewell County, Kansas Category:County seats in Kansas Category:1872 establishments in Kansas",
 "title": "Mankato, Kansas"
}