{
 "id": "720670",
 "text": "Oskaloosa is a city in Jefferson County, Kansas, United States. It is also the county seat of Jefferson County. In 2020, 1,110 people lived there. ==History== Oskaloosa was created in 1856. It was named after the city of Oskaloosa, Iowa. The first post office in Oskaloosa was created in November 1856. In 1888, Oskaloosa people elected Mary D. Lowman mayor with a city council composed entirely of women. This makes the city the first in Kansas to elect a city administration that has only women.\"The Latest Kansas Innovation: A Municipal Government Composed of Women\". Frank Leslie's Illustrated Newspaper, vols. 65–67, pp. 149–151 (April 21, 1888).Willard, Frances Elizabeth. A woman of the century: Fourteen hundred-seventy biographical sketches accompanied by portraits of leading American women in all walks of life. New York: Moulton, 1893, p. 476. ==Geography== Oskaloosa is at (39.215988, -95.314713). It is at the intersection of U.S. Route 59 and K-92, about 15 miles north of Lawrence. The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Oskaloosa has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Oskaloosa has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Oskaloosa, Kansas ==People== Oskaloosa is part of the Topeka, Kansas Metropolitan Statistical Area. ===2020 census=== The 2020 census there were 1,110 people, 411 households, and 255 families living in Oskaloosa. Of the households, 68.9% owned their home and 31.1% rented their home. The median age was 38.7 years. Of the people, 91.8% were White, 0.5% were Native American, 0.4% were Asian, 0.3% were Black, 0.1% were Pacific Islanders, 0.9% were from some other race, and 6.0% were two or more races. Hispanic or Latino of any race were 3.6% of the people. ===2010 census=== The 2010 census there were 1,113 people, 435 households, and 281 families living in Oskaloosa. ==Famous people== * Roger Barker, pioneering sociologist who studied everyday life in Oskaloosa. * McKinley Burnett, leading figure in Brown v. Board of Education. * James Reynolds, actor on Days of Our Lives for over 30 years. * C. Wesley Roberts, Chairman of the Republican Party, father of U.S. Senator Pat Roberts. * Dummy Taylor, deaf Major League Baseball pitcher. ==References== ==Other websites== ; City * City of Oskaloosa * Oskaloosa - Directory of Public Officials ; Schools * USD 341, local school district ; Maps * Oskaloosa City Map , KDOT Category:1856 establishments in Kansas Territory Category:Cities in Kansas Category:County seats in Kansas",
 "title": "Oskaloosa, Kansas"
}