{
 "id": "720640",
 "text": "Oakley is a city in Gove, Logan, and Thomas counties in the U.S. state of Kansas. It is also the county seat of Logan County. In 2020, 2,046 people lived there. ==History== The area that would become Oakley was settled in the 1870s and 1880s by people on the Smoky Hill Trail. Oakley was created in 1884 by Judge Fredman and David D. Hoag. It was first named Carlyle. Its name was changed to Cleveland. The name changed again to Oakley in 1885. It was named after Hoag's mother, Elizabeth Oakley Gardner Hoag. ==Geography== Oakley is at (39.128023, -100.854490). It has an elevation of 3,064 feet (934 m). It is about 1 mile (1.6 km) south of the South Fork of the Saline River in the High Plains region of the Great Plains. The city is at the intersection of Interstate 70, U.S. Route 40, and U.S. Route 83 in northwest Kansas. It is in the northeast corner of Logan County, and portions of it extend into Gove County and Thomas County. Oakley is about 211 miles (340 km) northwest of Wichita, 227 miles east-southeast of Denver, and 335 miles (539 km) west of Kansas City. The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== Oakley has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Oakley has a humid continental climate, abbreviated \"Dfa\" on climate maps.Climate Summary for Oakley, Kansas ==People== ===2020 census=== The 2020 census says that there were 2,046 people, 896 households, and 540 families living in Oakley. Of the households, 68.3% owned their home and 31.7% rented their home. The median age was 40.1 years. Of the people, 90.0% were White, 0.5% were Asian, 0.1% were Black, 0.1% were Pacific Islanders, 3.9% were from some other race, and 5.4% were two or more races. Hispanic or Latino of any race were 8.3% of the people. ===2010 census=== The 2010 census says that there were 2,045 people, 920 households, and 562 families living in Oakley. ==Media== The Oakley Graphic is the local newspaper. It is published once per week. The first edition of the newspaper was published on November 22, 1889. ==References== ==Other websites== ;City * City of Oakley * Oakley - Directory of Public Officials ;Schools * USD 274, local school system ;Historical * Fick Museum * Historic Images - Wichita State University Libraries ;Maps * Oakley City Map , KDOT ;Other * Palace Community Theatre Category:Cities in Thomas County, Kansas Category:County seats in Kansas Category:1884 establishments in Kansas",
 "title": "Oakley, Kansas"
}