{
 "id": "720618",
 "text": "The Governor of Nebraska holds the \"supreme executive power\" of the U.S. state of Nebraska. The current office holder is Jim Pillen, a Republican, who was sworn in on January 5, 2022. ==List of State Governors== ; Parties # Governor Party Took office Left office Lt. Governor Notes 1 David Butler Republican February 21, 1867 June 2, 1871 None Elected, but not inaugurated, before Nebraska's statehood. Impeached and removed from office for misappropriation of state funds; the impeachment was expunged six years later. William H. James Republican June 2, 1871 January 13, 1873 None Secretary of StateAs state secretary of state, acted as governor for unexpired term. 2 Robert Wilkinson Furnas Republican January 13, 1873 January 11, 1875 None 3 Silas Garber Republican January 11, 1875 January 9, 1879 None Othman A. Abbott 4 Albinus Nance Republican January 9, 1879 January 4, 1883 Edmund C. Carns 5 James W. Dawes Republican January 4, 1883 January 6, 1887 Alfred W. Agee Hibbard H. Shedd 6 John Milton Thayer Republican January 6, 1887 February 8, 1892 Hibbard H. Shedd George D. Meiklejohn Thomas J. Majors James Boyd won the 1890 election, and was sworn in on January 8, 1891. However, due to a question of his U.S. citizenship and eligibility for the office, he did not take office until February 8, 1892. 7 James E. Boyd Democratic February 8, 1892 January 13, 1893 Thomas J. Majors 8 Lorenzo Crounse Republican January 13, 1893 January 3, 1895 Thomas J. Majors 9 Silas A. Holcomb Fusion January 3, 1895 January 5, 1899 Robert E. Moore James E. Harris 10 William A. Poynter Fusion January 5, 1899 January 3, 1901 Edward A. Gilbert 11 Charles H. Dietrich Republican January 3, 1901 May 1, 1901 Ezra P. Savage ResignedResigned to take an elected seat in the United States Senate. 12 Ezra P. Savage Republican May 1, 1901 January 8, 1903 None Lt-Gov.As lieutenant governor, became governor for unexpired term. 13 John H. Mickey Republican January 8, 1903 January 3, 1907 Edmund G. McGilton 14 George L. Sheldon Republican January 3, 1907 January 7, 1909 Melville R. Hopewell 15 Ashton C. Shallenberger Democratic January 7, 1909 January 5, 1911 Melville R. Hopewell 16 Chester H. Aldrich Republican January 5, 1911 January 9, 1913 Melville R. Hopewell 17 John H. Morehead Democratic January 9, 1913 January 4, 1917 Samuel R. McKelvie (Republican) James Pearson (Democratic) 18 Keith Neville Democratic January 4, 1917 January 9, 1919 Edgar Howard 19 Samuel R. McKelvie Republican January 9, 1919 January 3, 1923 Pelham A. Barrows 20 Charles W. Bryan Democratic January 3, 1923 January 8, 1925 Fred G. Johnson (Republican) 21 Adam McMullen Republican January 8, 1925 January 3, 1929 George A. Williams 22 Arthur J. Weaver Republican January 3, 1929 January 8, 1931 George A. Williams 23 Charles W. Bryan Democratic January 8, 1931 January 3, 1935 Theodore Metcalfe (Republican) Walter H. Jurgensen (Democratic) 24 Robert Leroy Cochran Democratic January 3, 1935 January 9, 1941 Walter H. Jurgensen (Democratic) Nate M. Parsons (Democratic) William E. Johnson (Republican) 25 Dwight Griswold Republican January 9, 1941 January 9, 1947 William E. Johnson Roy W. Johnson 26 Val Peterson Republican January 9, 1947 January 8, 1953 Robert B. Crosby Charles J. Warner 27 Robert B. Crosby Republican January 8, 1953 January 6, 1955 Charles J. Warner 28 Victor E. Anderson Republican January 6, 1955 January 8, 1959 Charles J. Warner Dwight W. Burney 29 Ralph G. Brooks Democratic January 8, 1959 September 9, 1960 Dwight W. Burney Died.Died in office. 30 Dwight W. Burney Republican September 9, 1960 January 5, 1961 Dwight W. Burney Lt-Gov. 31 Frank B. Morrison Democratic January 5, 1961 January 5, 1967 Dwight W. Burney (Republican) Philip C. Sorensen (Democratic) 32 Norbert Tiemann Republican January 5, 1967 January 7, 1971 John E. Everroad 33 J. James Exon Democratic January 7, 1971 January 4, 1979 Frank Marsh (Republican) Gerald T. Whelan (Democratic) 34 Charles Thone Republican January 4, 1979 January 6, 1983 Roland A. Luedtke 35 J. Robert Kerrey Democratic January 6, 1983 January 9, 1987 Donald F. McGinley 36 Kay A. Orr Republican January 9, 1987 January 9, 1991 William E. Nichol First and (as of June 2016) only female governor of Nebraska 37 Ben Nelson Democratic January 9, 1991 January 7, 1999 Maxine B. Moul Kim M. Robak 38 Mike Johanns Republican January 7, 1999 January 20, 2005 David I. Maurstad David Heineman ResignedResigned to become United States Secretary of Agriculture. 39 Dave Heineman Republican January 20, 2005 January 8, 2015 Rick Sheehy Lavon Heidemann John E. Nelson Lt-Gov.As lieutenant governor, succeeded to the office of governor for Johann's unexpired term, and was later elected in his own right. 40 Pete Ricketts Republican January 8, 2015 January 5, 2023 Mike Foley 41 Jim Pillen Republican January 5, 2023 Incumbent Joe Kelly ==References== *",
 "title": "List of governors of Nebraska"
}