{
 "id": "720624",
 "text": "Lincoln Center, more commonly known as Lincoln, is a city in Lincoln County, Kansas, United States. It is also the county seat of Lincoln County. In 2020, 1,171 people lived there. ==History== Settler George Green created the town of Lincoln in 1870. He named it after the county. \"Center\" was added to its name to indicate its location in the central part of the county. County residents initially voted to place the county seat in Lincoln Center. However, elections in November 1870 led to the seat being moved to nearby Abram. This started a county seat war. Another vote in February 1872 reversed the switch, and Lincoln Center became the permanent county seat. The people moved all the buildings in Abram to Lincoln, combining the two communities. In 1879, the town was incorporated as the city of Lincoln Center. It is still officially called \"Lincoln Center\" in the United States Census. However, both the city government and local chamber of commerce call the city Lincoln. It shows as \"Lincoln\" on state maps and signs. In 1906, the city's first power plant opened, providing electric power. By 1950, the state highway commission had completed K-14 and K-18 through Lincoln. In 1989, because Lincoln had been using post rock limestone in local buildings for so long, the Kansas Legislature named Lincoln County as \"The Post Rock Capital of Kansas\". ==Geography== Lincoln Center is at (39.041744, -98.146760). It has an elevation of . The city is on the north side of the Saline River. It is in the Smoky Hills region of the Great Plains. Yauger Creek, a tributary of the Saline River, goes south along the eastern edge of the city. It goes until its confluence with the Saline just south of the city. The confluence of the Saline and Lost Creek, another of the river's tributaries, is southwest of the city. It is at the intersection of Kansas Highway 14 (K-14) and Kansas Highway 18 (K-18) in north-central Kansas. Lincoln Center is northwest of Wichita, west of Kansas City, and east-southeast of Denver. The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Lincoln Center has hot, humid summers and cold, dry winters. The average temperature is 55.1 °F (12 °C), and the average precipitation per year is 27.4 inches (69 cm). Snowfall averages 19.3 inches (49 cm) per year. On average, July is the warmest month, January is the coldest month, and May is the wettest month. The hottest temperature ever in Lincoln was 117 °F (47 °C) in 1947; the coldest temperature ever was -27 °F (-33 °C) in 1989. ==People== ===2020 census=== The 2020 United States Census says that there were 1,171 people, 522 households, and 296 families living in Lincoln Center. Of the households, 70.9% owned their home and 29.1% rented their home. The median age was 45.0 years. Of the people, 89.8% were White, 0.7% were Asian, 0.5% were Black, 0.3% were Native American, 3.7% were from some other race, and 5.1% were two or more races. Hispanic or Latino of any race were 8.5% of the people. ===2010 census=== The 2010 United States Census says that there were 1,297 people, 576 households, and 324 families living in Lincoln Center. ==Education== Lincoln Unified School District 298 (USD 298) controls two public schools in Lincoln Center: Lincoln Elementary School (Grades Pre-K-6) and Lincoln Junior/Senior High School (7-12). ==Infrastructure== Lincoln Municipal Airport is about a mile northwest of Lincoln Center on K-18. It is used for general aviation A railroad of the Kansas and Oklahoma Railroad goes through the west side of the city. ==Media== The Lincoln Sentinel-Republican is the local newspaper. It is published once per week. ==Famous people== * William Baker (1831-1910), U.S. Representative from Kansas * Jessa Crispin (1978- ), book critic * Don Wendell Holter (1905-1999), Methodist bishop * Daniel Ray Hull (1890-1964), landscape architect * Martin Johnson (1884-1937), adventurer, explorer, and documentary filmmaker * Bessie Anderson Stanley (1879-1952), poet * Uncas A. Whitaker (1900-1975), engineer, entrepreneur ==References== ==Other websites== ;City * City of Lincoln * Lincoln - Directory of Public Officials ;Schools * USD 298, local school district ;Historical * , from Hatteberg's People on KAKE TV news * Historic Images - Wichita State University Libraries ;Maps * Lincoln City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1870 establishments in Kansas Category:Lincoln County, Kansas",
 "title": "Lincoln Center, Kansas"
}