{
 "id": "720639",
 "text": "Mound City is a city in Linn County, Kansas, United States. It is also the county seat of Linn County. In 2020, 647 people lived there. It is part of the Kansas City metropolitan area. ==History== Mound City was created in 1855. It was named from Sugar Mound nearby, a hill covered with sugar maple trees. During the Civil War, a military post was created at Mound City. On October 25, 1864, Mound City was attacked twice by Confederates retreating south. They were retreating after their defeat at the Battle of Westport. The military post was closed in June 1865 after the end of the war. ==Geography== Mound City is at (38.142026, -94.812186). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Mound City has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system, Mound City has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Mound City, Kansas ==People== ===2020 census=== The 2020 census says that there were 647 people, 285 households, and 183 families living in Mound City. Of the households, 77.5% owned their home and 22.5% rented their home. The median age was 43.4 years. Of the people, 92.9% were White, 0.9% were Black, 0.8% were Native American, 0.2% were Asian, 0.2% were Pacific Islanders, 0.9% were from some other race, and 4.2% were two or more races. Hispanic or Latino of any race were 3.6% of the people. ===2010 census=== The 2010 census says that there were 694 people, 297 households, and 177 families living in Mound City. ==Education== Mound City is served by Jayhawk USD 346. The district high school is Jayhawk-Linn High School. Before school unification, the Mound City High School mascot was the Eagles. ==References== ==Other websites== ;City * City of Mound City * Mound City - Directory of Public Officials ;Schools * USD 346, local school district ;Maps * Mound City Map , KDOT Category:1855 establishments in Kansas Territory Category:Cities in Kansas Category:County seats in Kansas Category:Linn County, Kansas",
 "title": "Mound City, Kansas"
}