{
 "id": "720630",
 "text": "Lyons is a city in Rice County, Kansas, United States. It is also the county seat of Rice County. In 2020, 3,611 people lived there. ==History== Lyons was originally called Atlanta, and it was created in 1870. Its name changed to Lyons in 1876, in honor of Freeman J. Lyons. In 1878, Atchison, Topeka and Santa Fe Railway and people from Marion County and McPherson County started the Marion and McPherson Railway Company.Marion County Kansas : Past and Present; Sondra Van Meter; MB Publishing House; LCCN 72-92041; 344 pages; 1972. In 1879, a railroad was built from Florence to McPherson. In 1880, it was extended to Lyons. In 1881, it was extended to Ellinwood.Fourth Annual Report of the Board of Railroad Commissioners for the Year Ending December 1, 1886 in State of Kansas; Kansas Publishing House; 1886. The line was controlled by the Atchison, Topeka and Santa Fe Railway. The line from Florence to Marion, was left in 1968.Railway Abandonment 1968 In 1992, the line from Marion to McPherson was sold to Central Kansas Railway. In 1993, because of heavy flood damage, the line from Marion to McPherson was left. The original branch line connected Florence, Marion, Canada, Hillsboro, Lehigh, Canton, Galva, McPherson, Conway, Windom, Little River, Mitchell, Lyons, Chase, and Ellinwood. Lyons was incorporated as a city in 1880, the same year the railroad was built through it. In 1890, the Western Salt Company built its first shaft to mine salt in Lyons.One of World's Largest Salt Producting Centers on Frisco Lines at Lyons, Kansas; The Frisco Employes' Magazine; November 1926. In the 1970s, the federal government was interested in using a local area to bury high-level nuclear waste.Brown, Taylor Kate. (March 6, 2014). \"The radiation leak site that wants more nuclear waste\". BBC website Retrieved January 29, 2017. ==Geography== Lyons is at (38.344962, -98.202493). The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== The Köppen climate classification says that Lyons has a humid continental climate, Dfa on climate maps. Climate Summary for Lyons, Kansas ==People== ===2020 census=== The 2020 census says that there were 3,611 people, 1,462 households, and 946 families living in Lyons. Of the households, 67.5% owned their home and 32.5% rented their home. The median age was 38.1 years. Of the people, 74.5% were White, 1.1% were Black, 0.8% were Native American, 0.2% were Asian, 8.1% were from some other race, and 15.4% were two or more races. Hispanic or Latino of any race were 25.6% of the people. ===2010 census=== The 2010 census says that there were 3,739 people, 1,503 households, and 952 families living in Lyons. ==Famous people== * William Borah (1865-1940), U.S. Senator from Idaho * Marshall Christmann (1976- ), Kansas state legislator * James Fankhauser (1939- ), conductor, singer * Orville Harrold (1878-1933), actor, opera singer * James Pulliam (1925-2005), architect * Marcia Rodd (1940- ), actress * Jerry Cox Vasconcells (1892-1950), U.S. Army captain, World War I flying ace * Milton R. Wolf (1971- ), radiologist, Kansas politician ==References== ==Other websites== ;City * City of Lyons * Lyons - Directory of Public Officials ;Schools * USD 405, local school district ;Historical * Santa Fe Trail Research * , from Hatteberg's People on KAKE TV news ;Maps * Lyons City Map , KDOT Category:Cities in Rice County, Kansas Category:County seats in Kansas Category:1870 establishments in Kansas",
 "title": "Lyons, Kansas"
}