{
 "id": "720995",
 "text": "Scott City is a city in Scott County, Kansas, United States. It is also the county seat of Scott County. In 2020, 4,113 people lived there. ==History== ===Early history=== Scott City was created in 1885. Like Scott County, the city is named after United States General, Winfield Scott. In October 1884, two women from Chicago claimed the land that Scott City is on. They built a cabin. In February 1885, two men from Chicago came to the cabin and settled. Soon after, many people started coming to the county. Scott City was then created in 1885. Before being created, Mrs. M.E. De Geer, one of the women that came from Chicago, started a newspaper called the Western Times in March 1885. The county then started to fill quickly. The Kansas Legislature created Scott County in 1873. At this time it was named in honor of General Winfield Scott. Since it was such a small town with so few people, there was no need for a local government. Therefore, it was connected to Ford County for judicial things. ==Geography== Scott City is at (38.4825192, −100.9070949). The United States Census Bureau says that the city has a total area of . All of it is land. It is located in the Great Plains and at the elevation of 2969 ft. ===Climate=== The Köppen Climate Classification system says that Scott City has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Scott City, Kansas The average temperature is 52.4 °F (11.34 °C) and has an average rain fall of 20.16 inches per year. The average snow fall for a year is 23 in. (.58 m). ==People== ===2020 census=== The 2020 census says that there were 4,113 people, 1,629 households, and 1,075 families living in Scott City. Of the households, 68.4% owned their home and 31.6% rented their home. The median age was 38.0 years. Of the people, 78.6% were White, 0.9% were Native American, 0.3% were Asian, 0.2% were Black, 0.2% were Pacific Islanders, 7.5% were from some other race, and 12.3% were two or more races. Hispanic or Latino of any race were 22.5% of the people. ===2010 census=== The 2010 census says that there were 3,816 people, 1,583 households, and 1,029 families living in Scott City. ==Education== The USD 466 Scott County mascot is the beaver. A giant welded beaver is on display at the football field.http://www.usd466.com/ ==Infrastructure== === Transportation === K-96 and US-83 highways go through the Scott City. The Scott City Airport is a publicly owned airport. It is in the south east part of Scott City. ==Media== The Scott County Record is the local newspaper. This weekly publication has been in business since 1993.\"The Scott County Record\" In 2016, editor Rod Haxton was honored by the Kansas Press Association with the Clyde M. Reed Master Editor Award.\"GC Telegram\" ==Famous people== *Ron Baker, former NBA player for the New York Knicks and Washington Wizards ==Related pages== * El Quartelejo Ruins ==References== ==Other websites== ;City * * Scott City - Directory of Public Officials * Lake Scott State Park * El Quartelejo Museum - local history ;Schools * USD 466, local school district ;Maps * Scott City Map, Scott City CofC * Scott City Map, KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1885 establishments in Kansas",
 "title": "Scott City, Kansas"
}