{
 "id": "721027",
 "text": "Columbus is the second biggest city Cherokee County, Kansas, United States. It is about 15 miles south-southwest of Pittsburg. It is also the county seat of Cherokee County. In 2020, 2,929 people lived there. ==History== The first settlement at Columbus was created in 1868. The first post office in Columbus was created in 1869. Columbus was a railroad junction for the Saint Louis and San Francisco, and the Missouri, Kansas, and Texas railroads. It was named Columbus by A.L. Peters, one of the European-American creators of the city. It was named after his hometown of Columbus, Ohio; the name is indirectly named after Christopher Columbus, the explorer.The Modern Light, Columbus, August 16, 1951 Coal, lead and zinc were found in the area. Columbus had a big trade in agricultural products. Its businesses had machine shops, grain elevators, flour mills, a cigar factory, bottle works (soft drinks), a canning factory, and a big brick-making factory. In 1875, Robert A. Long and Victor Bell created the Long-Bell Lumber Company in Columbus. From one lumberyard, Long- Bell grew their businesses and holdings to become one of the biggest vertically integrated lumber companies in the United States. In 1956, it was bought by International Paper.William E. Connelley, A Standard History of Kansas and Kansans,, Chicago: Lewis Publishing Company, 1918 ==Geography== Columbus is at (37.171614, -94.844076). The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Columbus has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Columbus has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Columbus, Kansas ==People== ===2020 census=== The 2020 census says that there were 2,929 people, 1,251 households, and 746 families living in Columbus. Of the households, 63.5% owned their home and 36.5% rented their home. The median age was 39.8 years. Of the people, 86.8% were White, 3.1% were Native American, 0.5% were Black, 0.2% were Asian, 0.8% were from some other race, and 8.7% were two or more races. Hispanic or Latino of any race were 3.4% of the people. ===2010 census=== The 2010 census says that there were 3,312 people, 1,424 households, and 850 families living in Columbus. ==Famous people== * Marcellus Boss, 5th Civilian Governor of Guam * Elizabeth W. Crandall, educator * James Reed Hallowell, politician * Robert A. Long, lumber baron, developer, investor, newspaper owner, and philanthropist * Doro Merande, film, stage and television actress * Merle Evans, bandleader for Ringling Brothers and Barnum & Bailey Circus * Norma Terris, singer and actress * Leland Justin Webb, 1st Mayor of Columbus, lawyer, served in American Civil War and 19th Kansas Cavalry Regiment * Thomas Daniel Winter, US Representative from Kansas, 1939-1947. ==References== ==Other websites== ;City * City of Columbus * * ;Schools * USD 493, local school district ;Historical * , Special Photo Collections at Wichita State University Library ;Maps * Columbus City Map , KDOT Category:Cities in Cherokee County, Kansas Category:County seats in Kansas Category:1868 establishments in Kansas",
 "title": "Columbus, Kansas"
}