{
 "id": "721015",
 "text": "Medicine Lodge is the biggest city in Barber County, Kansas, United States. It is also the county seat of Barber County. In 2020, 1,781 people lived there. ==History== Settlers led by a man named John Hutchinson founded Medicine Lodge in February 1873. It was created north of the confluence of Elm Creek and the Medicine Lodge River. The community grew quickly, and it had a hotel, stores, and a post office established within a year. In 1874, in response to Native raids in the region, residents and the state militia constructed a stockade. A group of Osage killed three settlers within a few miles of the compound, but no direct attack on the fortifications occurred. Medicine Lodge was incorporated as a city in 1879. Temperance activist Carrie Nation launched her crusade against the sale of alcohol while living in Medicine Lodge in 1900. Her home and a recreation of the 1873 stockade are open to the public. ==Geography== Medicine Lodge is at (37.284352, -98.580977) in south-central Kansas. It is in the Red Hills region of the Great Plains. The city is north of the confluence of the Medicine Lodge River and Elm Creek. The city is on the northeast side of the river. Elm Creek goes south around the eastern and southern sides of the city. A tributary of Elm Creek, which goes south through Medicine Lodge, has been dammed north of the city to form a reservoir. This reservoir is Barber County State Lake. The city is at the junction of U.S. Routes 160 and 281.DeLorme. Kansas Atlas & Gazetteer. 4th ed. Yarmouth: DeLorme, 2009, p. 72-73. . The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Medicine Lodge has a humid subtropical climate (Köppen Cfa). It has hot, humid summers and cold, dry winters. The average temperature in Medicine Lodge is 57.3 °F (14 °C), and the average precipitation per year is 26.2 inches (660 mm). On average, January is the coldest month, July is the warmest month, and June is the wettest month. The hottest temperature ever in Medicine Lodge was 118 °F (48 °C) in 1936; the coldest temperature ever was -22 °F (-30 °C) in 1905. ==People== ===2020 census=== The 2020 census says that there were 1,781 people, 806 households, and 459 families living in Medicine Lodge. Of the households, 68.0% owned their home and 32.0% rented their home. The median age was 41.0 years. Of the people, 89.7% were White, 1.5% were Native American, 0.4% were Asian, 0.3% were Black, 0.1% were Pacific Islanders, 3.0% were from some other race, and 4.9% were two or more races. Hispanic or Latino of any race were 5.7% of the people. ===2010 census=== The 2010 census says that there were 2,009 people, 876 households, and 530 families living in Medicine Lodge. ==Infrastructure== Medicine Lodge is the western endpoint of the Medicine Lodge railroad of the V&S; Railway. The rail line runs northwest- southeast through the southwestern part of the city. ==Media== The Gyp Hill Premiere is the local newspaper. It is published once per week. ==Famous people== * Carleton Beals, journalist * B.H. Born, All American basketball player, University of Kansas * Dorothy DeLay, violin instructor at Juilliard. * Edward Joseph Hunkeler, Roman Catholic Archbishop * Chester I. Long, U.S. Representative and U.S. Senator from Kansas * Martina McBride, American country music singer * Carrie Nation, temperance activist * Jerry Simpson, U.S. Representative from Kansas * Jasper N. Tincher, U.S. Representative from Kansas ==References== ==Other websites== ;City * City of Medicine Lodge * Medicine Lodge Chamber of Commerce * Lincoln Library * Medicine Lodge - Directory of Public Officials ;Schools * USD 254, local school district ;Events * Medicine Lodge Peace Treaty Pageant ;Historical * Medicine Lodge, Kansas Barber County, Kansas: History and Genealogy * Digital Medicine Lodge History ;Maps * Medicine Lodge City Map , KDOT Category:Cities in Barber County, Kansas Category:County seats in Kansas Category:1873 establishments in Kansas",
 "title": "Medicine Lodge, Kansas"
}