{
 "id": "721007",
 "text": "Syracuse is a city in Hamilton County, Kansas, United States. It is also the county seat of Hamilton County. In 2020, 1,826 people lived there. ==History== Syracuse was first called Holidaysburg. It was created in 1873. It was renamed Syracuse before 1878. It was named after the city of Syracuse, New York. ==Geography== Syracuse is at (37.982938, -101.751224). It is along U.S. Route 50 and the Atchison, Topeka and Santa Fe Railway. It is sixteen miles (twenty- six kilometers) away from the Colorado border. The Arkansas River goes south of the City of Syracuse. The countryside south of the Arkansas River has sandhills. The \"Syracuse Sand Dunes\" is in these sandhills. It is a city park covering , including a fishing pond. The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== The Köppen Climate Classification system says that Syracuse has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Syracuse, Kansas ==People== ===2020 census=== The 2020 census says that there were 1,826 people, 673 households, and 449 families living in Syracuse. Of the households, 68.6% owned their home and 31.4% rented their home. The median age was 33.0 years. Of the people, 57.8% were White, 1.2% were Native American, 0.5% were Black, 0.2% were Asian, 24.8% were from some other race, and 15.6% were two or more races. Hispanic or Latino of any race were 49.4% of the people. ===2010 census=== The 2010 census says that there were 1,812 people, 715 households, and 460 families living in Syracuse. ==Education== Syracuse High School is the unified high school for Hamilton County USD 494. The Syracuse school mascot is Bulldogs.maxpreps.com ==Related pages== * Santa Fe Trail ==References== ==Other websites== ;City * City of Syracuse * Syracuse - Directory of Public Officials ;Schools * USD 494, local school district ;Maps * Syracuse City Map , Category:Cities in Kansas Category:County seats in Kansas Category:1873 establishments in Kansas",
 "title": "Syracuse, Kansas"
}