{
 "id": "721042",
 "text": "Educating Rita is a British 1983 drama/comedy movie directed by Lewis Gilbert. The screenplay is by Willy Russell based on his 1980 stage play. The film stars Michael Caine, Julie Walters, Michael Williams and Maureen Lipman. It won multiple major awards for best actor and best actress and was nominated for three Academy Awards. Caine and Walters both won BAFTA and Golden Globe awards for best actor and actress. The British Film Institute ranked Educating Rita the 84th greatest British film of the 20th century.British Film Institute - Top 100 British Films (1999). Retrieved 27 October 2017 ==Plot== Rita (Julie Walters) is a 26-year-old Liverpudlian working-class hairdresser. She is dissatisfied with the routine of her work. She is reluctant to have a child. She fears it will tie her to the same monotonous routine for life. She yearns to escape to something, without exactly knowing what that is. She signs up for an Open University course in English Literature. Her assigned tutor is Frank Bryant (Michael Caine). Bryant is a jaded university lecturer. He describes his abilities as \"appalling but good enough for his appalling students\". His passion for literature is reignited by Rita. Her ability for the subject is limited by her lack of education. Frank finds her enthusiasm refreshing. Frank's cynicism returns as he notices Rita beginning to adopt the pretensions of the university culture he despises. The film ends with Frank being sent to Australia. ==Cast== * Michael Caine as Professor Frank Bryant * Julie Walters as Susan \"Rita\" White * Michael Williams as Brian * Dearbhla Molloy as Elaine * Jeananne Crowley as Julia, Frank's girlfriend * Malcolm Douglas as Denny White, Rita's husband * Godfrey Quigley as Rita's father * Patricia Jeffares as Rita's mother * Maeve Germaine as Sandra, Rita's sister * Maureen Lipman as Trish, Rita's roommate * Gerry Sullivan as Security Officer * Pat Daly as Bursar * Kim Fortune as Collins * Philip Hurdwood as Tiger * Hilary Reynolds as Lesley * Jack Walsh as Price * Christopher Casson as Professor * Gabrielle Reidy as Barbara * Des Nealon as Invigilator * Marie Conmee as Customer in Hairdresser's * Oliver Maguire as Tutor * Derry Power as Photographer * Alan Stanford as Bistro Manager ==Production== Lewis Gilbert says it was difficult to raise finance for the film. \"Columbia wanted me to cast Dolly Parton as Rita\". Julie Walters, in her feature-film debut, reprised her role from the stage production. The film was shot in Dublin. Trinity College, Dublin, is used as the setting for the university. University College Dublin, in Belfield, Dublin, is used for Rita's summer school. The room used by Bryant as his office is in the College Historical Society. The room used by Bryant as his tutorial room is in the University Philosophical Society. The production left portraits of Douglas Hyde and Isaac Butt, and a bust of John Pentland Mahaffy on display. Number 8 Hogan Avenue in Dublin near Grand Canal Dock was used for Rita's house. A house in Burlington Road, Ballsbridge was used for Bryant's. The scene set in France was filmed in Maynooth, County Kildare. Pearse Station and Dublin Airport were also used. The scene in the pub was shot in The Stag's Head pub on Dame Court in Dublin. ==Reception== ===Critics=== The American Variety magazine in December 1982 praised Walters' interpretation of Rita as \"witty, down-to-earth, kind and loaded with common sense.\" Ian Nathan reviewing the film for Britain's Empire film magazine calls it a \"gem,\". He gave it four out of five stars. American critic Janet Maslin called the film \"the perfect play about literature for anyone who wouldn't dream of actually reading books\". Chicago critic Roger Ebert gave the film two stars out of four. He said Russell's screen adaptation \"added mistresses, colleagues, husbands, in-laws, students and a faculty committee, [that were] all unnecessary\". ==Awards and nominations== ===Academy Awards=== * Academy Award for Best Actor (Michael Caine) - Nominated * Academy Award for Best Actress (Julie Walters) - Nominated * Academy Award for Best Adapted Screenplay (Willy Russell) - Nominated ===Golden Globe Awards=== * Golden Globe Award for Best English-Language Foreign Film - Nominated * Golden Globe Award for Best Actor - Motion Picture Musical or Comedy (Michael Caine) - Won * Golden Globe Award for Best Actress - Motion Picture Musical or Comedy (Julie Walters) - Won * Golden Globe Award for Best Screenplay (Willy Russell) - Nominated ===British Academy Film Awards=== * BAFTA Award for Best Film - Won * BAFTA Award for Best Actor in a Leading Role (Michael Caine) - Won * BAFTA Award for Best Actress in a Leading Role (Julie Walters) - Won * BAFTA Award for Best Actress in a Supporting Role (Maureen Lipman) - Nominated * BAFTA Award for Most Promising Newcomer to Leading Film Roles (Julie Walters) - Nominated * BAFTA Award for Best Adapted Screenplay (Willy Russell) ===National Board of Review=== * National Board of Review: Top Ten Films - Won ===Retrospective assessments=== In 1999, the film was among the BFI Top 100 British films. In 2007, while promoting the remake of Sleuth, Caine called Educating Rita \"the last good picture [he] made before [he] mentally retired.\" ==Home media== The film was released on DVD in the UK and the US. In 2008, ITV Studios released it on Blu-Ray in the UK (Region B) as a 25th Anniversary edition. ==Proposed remake== In November 2002, the then-82-year-old director Lewis Gilbert said he would like to remake it \"with a black cast that could include Halle Berry and Denzel Washington\". principal photography was to commence in 2003. The project was abandoned. ==References== ==Other websites== * Educating Rita at BFI Screenonline * * * * Educating Rita at Shot at Trinity (database of films shot at Trinity College Dublin) Category:1983 comedy-drama movies Category:British comedy-drama movies Category:Columbia Pictures movies Category:Movies about educators Category:Movies set in universities and colleges Category:Open University Category:BAFTA Award winning movies Category:Movies directed by Lewis Gilbert",
 "title": "Educating Rita (movie)"
}