{
 "id": "721000",
 "text": "Sharon Springs is a city in Wallace County, Kansas, United States. It is also the county seat Wallace County. In 2020, 751 people lived there. ==History== Sharon Springs was first called Eagle Tail station when it was created in 1868. It was renamed Sharon Springs in 1886, after Sharon Springs, New York. Sharon Springs was incorporated as a city in 1890. In 2013, the biggest sinkhole in Kansas opened north of Sharon Springs. As of December 2013, the sinkhole was about deep and across. ==Geography== Sharon Springs is at (38.894334, -101.751163). The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== The Köppen Climate Classification system says that Sharon Springs has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Sharon Springs, Kansas ==People== ===2020 census=== The 2020 census says that there were 751 people, 320 households, and 182 families living in Sharon Springs. Of the households, 75.0% owned their home and 25.0% rented their home. The median age was 47.4 years. Of the people, 88.4% were White, 0.5% were Native American, 0.3% were Black, 0.1% were Pacific Islanders, 4.4% were from some other race, and 6.3% were two or more races. Hispanic or Latino of any race were 7.5% of the people. ===2010 census=== The 2010 census says that there were 748 people, 327 households, and 197 families living in Sharon Springs. ==Infrastructure== Sharon Springs is on U.S. Route 40. ==References== ==Other websites== ;City * City of Sharon Springs * Sharon Springs - Directory of Public Officials * Wallace County , Wallace County economic development alliance * Wallace County, skyways.lib.ks.us * Sharon Springs and Wallace County, kansastowns.us ;Schools * USD 241, local school district ;Historic * Historic Photograph of City * Pet Kansas badger once roamed White House , Wichita Eagle ;Maps * Sharon Springs City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas Category:1868 establishments in Kansas",
 "title": "Sharon Springs, Kansas"
}