{
 "id": "721006",
 "text": "Sublette is a city in Haskell County, Kansas, United States. It is also the county seat of Haskell County. In 2020, 1,413 people lived there. ==History== Sublette was created in 1912. It was named after William Lewis Sublette, a French Huguenot who was a partner in the Rocky Mountain Fur Company. Sublette was a mountain man, fur trapper and pioneer who blazed a trail through the area and was known by the local natives as \"Cut Face\".Kansas Place-Names, John Rydjord, University of Oklahoma Press, 1972, p. 121 . The first post office in Sublette was created in January 1913. ==Geography== Sublette is at (37.482226, -100.846492). The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== The Köppen Climate Classification system says that Sublette has a semi-arid climate, abbreviated \"BSk\" on climate maps.Climate Summary for Sublette, Kansas ==People== ===2020 census=== The 2020 census says that there were 1,413 people, 520 households, and 376 families living in Sublette. Of the households, 76.9% owned their home and 23.1% rented their home. The median age was 34.3 years. Of the people, 73.6% were White, 0.8% were Black, 0.1% were Native American, 0.1% were Asian, 13.9% were from some other race, and 11.6% were two or more races. Hispanic or Latino of any race were 30.4% of the people. ===2010 census=== The 2010 census says that there were 1,453 people, 556 households, and 409 families living in Sublette. ==Media== The Haskell County Monitor-Chief is the local newspaper. Sublette is in the Wichita-Hutchinson, Kansas television market. KDGL-LD is licensed to Sublette Kansas and is the flagship station of High Plains Broadcasting, LLC. KDGL broadcasts on RF channel 23 carrying 6 video streams. Current Networks are Retro TV, Tuff TV, AMG TV, Launch TV, TheWalk TV, and PBJ TV. KDGL uses TV23 as branding for all 5 licenses including Dodge City, Garden City, Liberal, and Ulysses. Sublette was chosen for its central location in the Southwest Kansas Market and to streamline future news gathering for NewsWest23 newscasts. ==Famous people== * Jack Christiansen, Hall of Fame football player for the Detroit Lions * Shalee Lehning, former professional basketball player for the Atlanta Dream, and associate head coach on the Northern Colorado women's basketball team * Otto Schnellbacher, (1923-2008), played both basketball and football (American) professionally * Ted Trimpa, Democratic strategist and political consultant ==References== ==Other websites== ;City * Sublette - Directory of Public Officials ;Schools * USD 374, local school district ;Maps * Sublette City Map , KDOT Category:Cities in Kansas Category:County seats in Kansas",
 "title": "Sublette, Kansas"
}