{
 "id": "721199",
 "text": "Duty to rescue is a concept that many law systems have. In certain circumstances, a person can be held responsible for not helping another person who is in danger of injury or death. People are required to help to the best of their abilities. As a bare minimum, this often means alerting emergency services (for example, by calling 9-1-1 or 9-9-9). == Legal duty to rescue == In general, duty-to-rescue laws say: * The person helping must be able to recognize the emergency. *The danger must be immediate: not helping will mean injury or death. * There is no requirement to help IF helping would put the helpers in danger. * There may be an extra duty to rescue in the case of \"special relationships\" (for example, if a family member, spouse, or coworker needs help). *Some professions (such as healthcare professionals) have an extended duty to help. Many places have laws that protect helpers against legal consequences if they make an error while trying to help. In many cases, the duty to rescue has become customary law. Helping people at sea is one example of a customary duty to rescue. ==Moral duty to help== A moral or ethical duty to rescue may exist even where there is no legal duty to rescue. Such a duty can be justified in different ways. === Duty to strangers === One kind of justification is general and applies regardless of role-related relationships: Under this general justification, people have a duty to rescue other people in distress because of their common humanity. With this justification, the specific skills of the rescuer or the nature of the victim's distress are irrelevant. This kind would justify cases of rescue and in fact make such rescue a duty even between strangers. With this justification in mind, philosopher Peter Singer suggests that if one saw a child drowning and could intervene to save him, they should do so, if the cost is moderate to themselves. Damage to their clothing or shoes or how late it might make them for a meeting would be an insufficient excuse to avoid assistance. Singer goes on to say that one should also try to rescue distant strangers, not just nearby children, because globalization has made it possible to do so.Peter Singer, \"The Drowning Child and the Expanding Circle\", New Internationalist, April, 1997; http://www.utilitarian.net/singer/by/199704--.htm Such general arguments for a duty to rescue also explain why after the 2010 Haiti earthquake, Haitians were digging family members, friends, and strangers out of the rubble with their bare hands and carrying injured persons to whatever medical care was available.David Gardner and Liz Hazelton, \"Haiti earthquake: Bodies piled up on the streets as disaster leaves 'thousands' dead\", The Guardian, January 14, 2010, http://www.dailymail.co.uk/news/worldnews/article-1242885/Haiti- earthquake-Victims-forced-dig-rubble-bare-hands-free-surivors.html They justify journalist Anderson Cooper's attempt to shepherd an injured young boy away from some \"toughs\" nearby in the aftermath of the Haiti earthquake.David Folkenflik, \"Reporters Who Are MDs Find Lines Blurred in Haiti\", National Public Radio, January 20, 2010, https://www.npr.org/templates/story/story.php?storyId=122784322 It also explains why various physician-journalists like Sanjay Gupta began treating injuries rather than just acting as journalists. Specific arguments for such a duty to rescue include the Golden Rule, Utilitarianism, and rules of humanity. === The Golden Rule === The Golden Rule says a person should treat others the way they want to be treated. This assumes that all persons would wish to be rescued if they were in distress, and so they should in turn rescue those in distress to the best of their abilities. What counts as distress requiring rescue may, of course, differ from person to person. However, being trapped or at risk of drowning are emergency situations which this position assumes all humans would wish to be rescued from. === Utilitarianism === Utilitarianism posits that actions are right if they maximize happiness and reduce suffering (\"maximize the good\").John Stuart Mill, Utilitarianism available from many publishers and on-line, first published in 1863 Utilitarian reasoning generally supports acts of rescue which contribute to overall happiness and reduced suffering. Rule utilitarianism would look not just at whether individual acts of rescue maximize the good, but whether certain types of acts do so. It then becomes one's duty to perform those types of actions. Generally, having strangers rescue those in distress maximizes good so long as the rescue attempt does not make things worse, so one has a duty to rescue to the best of her or his ability as long as doing so will not make things worse. === Rules of humanity === The rules of humanity advise that the essence of morality and right behavior is tending to human relationships. Therefore, virtues (desirable character traits) such as compassion, sympathy, honesty, and fidelity are to be admired and developed.page 19-20 in Tom L. Beauchamp, LeRoy Walters, Jeffrey P. Kahn, and Anna C. Mastroianni, Contemporary Issues in Bioethics, 7th edition, Wadsworth: Belmont, CA, 2008 Acting out of compassion and sympathy will often require rescue where someone is in need. Indeed, it would not be compassionate to ignore someone's need, though the way one fulfills that need may vary. In cases of emergency, rescue would be the most compassionate act compared with allowing a person to remain trapped in rubble. === Skill-specific duties === There are also ethical justifications for role-specific or skill-specific duties of rescue, such as those described above under the discussion of U.S. Common Law. Generally, these justifications are rooted in the idea that the best rescues, the most effective rescues, are done by those with special skills. Such persons, when available to rescue, are thus even more required to do so ethically than regular persons who might simply make things worse. (For a utilitarian, rescue by a skilled professional in a relevant field would maximize the good even better than rescue by a regular stranger). This particular ethical argument makes sense when considering the ability of healthcare personnel to provide medical rescue or firefighters to get both themselves and victims safely out of a burning building.Kevin Williams, \"Medical Samaritans: Is There A Duty To Treat?\", Oxford Journal of Legal Studies 21(3): 393–413. 2001. Williams argues that medical personnel have a duty of medical rescue even when there is no prior patient-provider relationship, as when a provider happens to pass an accident site with no EMTs to hand. == References == Category:Law",
 "title": "Duty to rescue"
}