{
 "id": "72143",
 "text": "The 2012 Summer Olympic Games, officially known as the Games of the XXX Olympiad, were held in London, United Kingdom from 27 July to 12 August 2012, followed by the 2012 Paralympic Games from 29 August to 9 September. London became the first city to host the modern Olympic Games three times; London also hosted the 1908 Summer Olympics and the 1948 Summer Olympics. == The bidding process == By the bid submission deadline of 15 July 2003, nine cities had submitted bids to host the 2012 Olympics. These cities were Havana, Istanbul, Leipzig, London, Madrid, Moscow, New York, Paris, and Rio de Janeiro. On 18 May 2004 the International Olympic Committee (IOC) reduced the number of cities to five: London, Madrid, Moscow, New York, and Paris. The IOC inspection team visited the five candidate cities during February and March 2005. On 6 June 2005, the International Olympic Committee released its evaluation reports for the five candidate cities. Although these reports did not contain any scores or rankings, the evaluation report for Paris was seen as the most positive, followed closely by London. During the process, many thought Paris was most likely to win the nomination, largely because this was its third bid in recent years. In late August 2004, reports came out predicting a London and Paris tie in the 2012 bid. On 6 July 2005, London was announced as the winner of the bid at the Raffles City Convention Centre in Singapore. ==The Games== Athletes from 204 National Olympic Countries took part. In addition, four individual athletes competed under the Olympic flag—one from South Sudan and three from the region of the former Netherlands Antilles \"London 2012: Refugee runs for world, family walk 50km to watch,\" NDTV (New Delhi Television), 11 August 2012; retrieved 2012-8-16. ===Participating nations=== Listed below are NOCs who have qualified at least one athlete. As of 7 June 2011, 101 nations have qualified at least one athlete. * Algeria * Andorra * Argentina * Australia * Austria * Bahamas * Belarus * Belgium * Bosnia and Herzegovina * Brazil * Bulgaria * Canada * Cayman Islands * Chile * China * Colombia * DR Congo * Côte d'Ivoire * Croatia * Cuba * Cyprus * Czech Republic * Denmark * Dominican Republic * Ecuador * Egypt * Eritrea * Ethiopia * Estonia * Finland * France * Georgia * Germany * Ghana * Great Britain (Host) * Greece * Grenada * Guatemala * Haiti * Hong Kong * Hungary * India * Iran * Ireland * Israel * Italy * Jamaica * Japan * Kazakhstan * Kenya * North Korea * South Korea * Kuwait * Latvia * Libya * Lithuania * Luxembourg * Malta * Mexico * Moldova * Mongolia * Morocco * Namibia * Netherlands * New Zealand * Nigeria * Norway * Pakistan * Panama * Peru * Poland * Portugal * Puerto Rico * Qatar * Romania * Russia * Saint Kitts and Nevis * San Marino * Saudi Arabia * Serbia * Singapore * Slovakia * Slovenia * South Africa * Sri Lanka * Spain * Sudan * Sweden * Switzerland * Chinese Taipei * Tajikistan * Tanzania * Thailand * Trinidad and Tobago * Turkey * Uganda * Ukraine * United States * Uruguay * Uzbekistan * Vietnam * Zambia * Zimbabwe === Medal table === ===Sports=== The 2012 Summer Olympics event has 26 sports. The International Olympic Committee executive board met on 13 August 2009 and approved the addition of women's boxing. The International Boxing Federation proposed that 40 athletes compete in five different weight classes. * Aquatics ** ** ** ** * * * * * * ** Sprint (12) ** Slalom (4) * ** BMX (2) ** Mountain biking (2) ** Road (4) ** Track (10) * ** Dressage (2) ** Eventing (2) ** Jumping (2) * * * * ** Artistic (14) ** Rhythmic (2) ** Trampoline (2) * * * * * * * * * * * ** Volleyball (2) ** Beach volleyball (2) * * ** Freestyle (11) ** Greco-Roman (7) == Motto == The official motto for the 2012 Summer Olympics is \"Inspire a generation\". It was chosen to highlight the organiser's commitment to inspire the world to get involved in sporting events through the olympic games' legacy. == Mascots == The official mascots for the Olympics and Paralympic Games were revealed in May 2010. They were called Wenlock and Mandeville. == Sponsors == The 2012 Olympics had many sponsors. Some of the most popular ones are McDonald's, Acer, Samsung, Coca-Cola, Adidas, and Panasonic. == References == == Other websites == * Official London 2012 Website * London Olympics All news and info about the Games Category:2012 in sports",
 "title": "2012 Summer Olympics"
}