{
 "id": "721479",
 "text": "The Samsung Galaxy S10, Samsung Galaxy S10+, Samsung Galaxy S10 5G and Samsung Galaxy S10e are smartphones made and developed by the electronics company Samsung. They were announced at an Galaxy unpacked event on February 20, 2019. They were released on March 8, 2019 for Samsung Galaxy S10e, Samsung Galaxy S10 and Samsung Galaxy S10+. It was released on April 5, 2019 for Samsung Galaxy S10 5G. It has three sister models, the Samsung Galaxy S10e, the Samsung Galaxy S10+ and the Samsung Galaxy S10 5G. The Samsung Galaxy S10 5G is the first smartphone to have 5G. The Samsung Galaxy S10 became the first Samsung smartphone to have a Qualcomm in-screen ultrasonic fingerprint sensor. == Features == The Samsung Galaxy S10 series runs One UI 1 with Android 9 Pie for the first launch, Samsung Galaxy S10e has a 5.8 inch display, Dynamic AMOLED display, Samsung Galaxy S10 has a 6.1 inch display, Dynamic AMOLED display, Samsung Galaxy S10+ has a 6.4 inch display, and Dynamic AMOLED display. Samsung Galaxy S10 5G has a 6.7 inch display, Dynamic AMOLED display. The Samsung Galaxy S10e has a 3100mAh battery capacity, Samsung Galaxy S10 has a 3400mAh battery capacity, Samsung Galaxy S10+ has a 4100mAh battery capacity and Samsung Galaxy S10 5G has a 4500mAh battery capacity. Samsung Galaxy S10e, Galaxy S10 and Galaxy S10+ has a 4G, The Samsung Galaxy S10 5G has a 5G. == Problems == The people with an Samsung Galaxy S10 say it keeps restarting and does not work after One UI 6.1 updates cases by SmartThings framework updates, The other older samsung phones such as Samsung Galaxy Note 10, Samsung Galaxy M51 and Samsung Galaxy A90 are cannot start operating system and keeps restarting after One UI 6.1 updates. == Related pages == *Samsung Galaxy S series == References == == Other websites == *Official Websites Category:Samsung Galaxy Category:Mobile phones introduced in 2019 Category:Mobile phones with multiple rear cameras",
 "title": "Samsung Galaxy S10"
}