{
 "id": "722003",
 "text": "Cuba is a city in Republic County, Kansas, United States. In 2020, 140 people lived there. ==History== The community was created in 1868 by American southerners going west after the American Civil War. The city got its name from one person who had once lived on the island of Cuba. Other early settlers of Cuba are Czech immigrants from Bohemia that moved to Cuba in the mid-1870s. Originally most of the people of Cuba were of Czech and Austrian descent. The entire town of Cuba moved to its current place in 1884 in order to be on the railroad that had been built through that territory. The town has received attention due to its small town American nature documented by photographer Jim Richardson. The city of Cuba and Jim Richardson were shown on the CBS News Sunday Morning show in 1983 and in 2004, as well as the May 2004 issue of National Geographic magazine.Pulling Together: 30 Years in the Life of Cuba, Kansas , Jim Richardson, National Geographic ==Geography== Cuba is at (39.802346, -97.457422). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 140 people, 69 households, and 40 families living in Cuba. Of the households, 88.4% owned their home and 11.6% rented their home. The median age was 59.0 years. Of the people, 95.7% were White, 0.7% were from some other race, and 3.6% were two or more races. Hispanic or Latino of any race were 0.7% of the people. ===2010 census=== The 2010 census says that there were 156 people, 79 households, and 48 families living in Cuba. ==Government== The Cuba government has of a mayor and five council members. The council meets once a month. == Cultural events == ===Czech Day=== Each year, a local club, The Cuba Booster Club, organizes Czech Day. This is a three-day event. The main activity is people rocking in rocking chairs without stopping. This is called a Rock-A-Thon. Some other activities are an auction and a Czech dinner. Because of Covid 19, Czech Day was not held for two years. ==References== ==Other websites== ;City * Cuba - Directory of Public Officials ;Schools * USD 109, local school district ;Photos * Photos of Cuba * Videos of Cuba ;Maps * Cuba City Map , KDOT Category:Cities in Kansas Category:1868 establishments in Kansas",
 "title": "Cuba, Kansas"
}