{
 "id": "722029",
 "text": "Victoria is a city in Ellis County, Kansas, United States. In 2020, 1,129 people lived there. ==History== A group of British people led by a Scotsman named George Grant created Victoria in 1873. They created it on land he had bought from the Kansas Pacific Railway. They named the settlement after Queen Victoria. Grant wanted Victoria to be a ranching community. He was apparently responsible for bringing the first Aberdeen Angus cattle to the United States. Most of the colonists, however, were remittance men more interested in sports and dancing than in raising animals. Their families soon learned of this and lowered the remittances. This caused most of the colonists to leave by 1880. Some returned to Britain; others left for South America. In 1876, Volga Germans from villages near Saratov, Russia created the settlement of Herzog one half mile north of Victoria. Herzog's Roman Catholic settlers built a many churches. Herzog grew quickly and later took over Victoria, eventually taking the older settlement's name. Herzog was officially renamed Victoria in 1913. In 1942, the U.S. Army built Walker Army Airfield 3 miles northeast of Victoria. During World War II, thousands were put there at the airfield. The military closed the base in 1946. In 1966, Interstate 70 reached Victoria, going north of the city. ==Geography== Victoria is at (38.853758, -99.147397). It has an elevation of 1,926 feet (587 m). It is on Kansas Highway 255 (K-255) south of Interstate 70 in northwestern Kansas. Victoria is about east of Hays (the county seat), northwest of Wichita, and west of Kansas City. The city is about north of the Smoky Hill River in the Smoky Hills region of the Great Plains. The city is on the east side of the North Fork of Big Creek, part of the Smoky Hill River watershed. The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 United States Census says that there were 1,129 people, 479 households, and 308 families living in Victoria. Of the households, 79.5% owned their home and 20.5% rented their home. The median age was 41.8 years. Of the people, 95.3% were White, 0.5% were Black, 0.2% were Native American, 1.1% were from some other race, and 2.9% were two or more races. Hispanic or Latino of any race were 2.4% of the people. ===2010 census=== The 2010 United States Census says that there were 1,214 people, 496 households, and 316 families living in Victoria. ==Infrastructure== ===Transportation=== Interstate 70 and U.S. Route 40 go concurrently east-west about one mile north of Victoria. K-255 goes north-south from I-70 to Victoria's northern city limits. The Kansas Pacific (KP) line of the Union Pacific Railroad goes northeast-southwest through the southern part of the city. ===Utilities=== Water, sewage, and trash are done of the city government. Midwest Energy, Inc. gives electric power. Local residents mostly use natural gas for heating fuel; service is provided by Kansas Gas Service. ==Media== Victoria is in the Wichita-Hutchinson, Kansas television market. ==Famous people== *Monty Beisel (1978- ), football linebacker *Lucy Isabella Buckstone (1857-1893), actressForsythe, James L. The English Colony at Victoria, Another View. Retrieved 29 July 2013 *Nate Dreiling (1990- ), football linebacker *James \"Scotty\" Philip (1858-1911), American bison rancher *Theodore McCarrick, laicized American cardinal of the Catholic Church and former Archbishop of Washington, D.C. ==Sister cities== * Kubelstein, Scheßlitz, Germany ==References== ==Other websites== ;City * City of Victoria * Victoria - Directory of Public Officials ;Schools * USD 432, local school district ;Events * Herzogfest ;Photos * Saint Fidelis Catholic Church \"Cathedral of the Plains\", photos. * Kansas Photo Tour - Victoria * Historic Images of Victoria, Special Photo Collections at Wichita State University Library ;Maps * Victoria City Map , KDOT Category:Cities in Kansas Category:1873 establishments in Kansas",
 "title": "Victoria, Kansas"
}