{
 "id": "722202",
 "text": "Tampa is a city in Marion County, Kansas, United States. In 2020, 105 people lived there. ==History== In 1887, the Chicago, Kansas and Nebraska Railway built a railroad from Herington through Tampa to Pratt. The Golden Belt Town Company filed the plat for Tampa in 1887. The city name is said to have been suggested by a railroad engineer who rode one of the first trains through Tampa. Tampa was incorporated as a city in 1908.Marion County Kansas, Past and Present; Sondra Van Meter; 1972. A post office was created in Tampa on April 17, 1888. ==Geography== Tampa is at (38.548087, -97.154181). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 105 people, 51 households, and 32 families living in Tampa. Of the households, 64.7% owned their home and 35.3% rented their home. The median age was 40.5 years. Of the people, 86.7% were White, 1.0% were from some other race, and 12.4% were two or more races. Hispanic or Latino of any race were 8.6% of the people. ===2010 census=== The 2010 census says that there were 112 people, 48 households, and 27 families living in Tampa. ==Economy== The Tampa State BankTampa State Bank and Tampa Cafe are in Tampa. ==Education== Tampa is part of Unified School District 397.Kansas School District Boundary Map ==Media== * Hillsboro Free Press, free newspaper for greater Marion County area. * The Herington Times, newspaper from Herington. * The Salina Journal, regional newspaper from Salina. ==References== ==More reading== * A History of Tampa, Kansas, and Its Environs, 1887–1987; Tampa Centennial Committee; 1986. ==Other websites== ;City * Tampa - Official, archive of former website * Tampa - Directory of Public Officials, League of Kansas Municipalities ;Schools * USD 397, Centre school district for Lincolnville, Lost Springs, Pilsen, Tampa, Ramona, Antelope, Burdick, nearby rural areas of Marion / Morris / Dickinson / Chase Counties * USD 397 School District Boundary Map, KDOT ;Historical * 1968 photo of Tampa Rock Island Depot * Marion County cemetery list, archive of KsGenWeb * Marion County history bibliography, Marion County school bibliography, Kansas Historical Society ;Maps * Tampa City Map , KDOT * Topo Map of Tampa / Durham / Ramona / Dillon / Elmo area, USGS * Marion County Maps: Current , Historic , KDOT Category:1887 establishments in Kansas Category:Cities in Marion County, Kansas",
 "title": "Tampa, Kansas"
}