{
 "id": "722351",
 "text": "Mulvane is a city in Sedgwick and Sumner counties in the U.S. state of Kansas. It is a suburb of Wichita. In 2020, 6,286 people lived there. ==History== Mulvane was planned out in 1879. It is at the junction of five Santa Fe rail lines. It is named after Joab R. Mulvane, a railroad official who was importatnt in bringing the Atchison, Topeka, and Santa Fe Railroad to Mulvane. Mulvane's Main Street follows part of the Sedgwick and Sumner county lines. The town center is about five miles west of the spot where Sedgwick, Sumner, Butler and Cowley counties meet. ==Geography== Mulvane is at (37.479746, -97.242309). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ==People== Mulvane is part of the Wichita, KS Metropolitan Statistical Area. ===2020 census=== The 2020 census says that there were 6,286 people, 2,338 households, and 1,656 families living in Mulvane. Of the households, 75.7% owned their home and 24.3% rented their home. The median age was 37.0 years. Of the people, 89.0% were White, 1.0% were Native American, 0.6% were Asian, 0.5% were Black, 0.1% were Pacific Islanders, 0.6% were from some other race, and 8.2% were two or more races. Hispanic or Latino of any race were 4.9% of the people. ===2010 census=== The 2010 census says that there were 6,111 people, 2,244 households, and 1,661 families living in Mulvane. ==Education== Mulvane is part of Mulvane USD 263. ==Famous people== * Laura M. Cobb, United States Navy nurse during World War II * Dennis Franchione, college football coach. ==References== ==Other websites== ;City * City of Mulvane * Mulvane - Directory of Public Officials ;Schools * USD 263, local school district * USD 263 School District Boundary Map , KDOT ;Historical * , from Hatteberg's People on KAKE TV news ;Maps * Mulvane City Map , KDOT Category:Cities in Sedgwick County, Kansas Category:Cities in Sumner County, Kansas Category:1879 establishments in Kansas",
 "title": "Mulvane, Kansas"
}