{
 "id": "722360",
 "text": "Altamont is a city in Labette County, Kansas, United States. In 2020, 1,061 people lived there. ==History== Altamont had started in 1879 when a railroad was built through there. The first people of Altamont was the Huston family. When they went to the nearby town of Oswego, people would ask them where they lived. They would say about a mile east of the lone tree. Since there were not many trees in Kansas at the time, it was easy to know what tree they were talking about. It was named after Altamont, Illinois. Altamont was incorporated in 1884. ==Geography== Altamont is at (37.189803, -95.293529). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Altamont has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Altamont has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Altamont, Kansas ==People== ===2020 census=== The 2020 census says that there were 1,061 people, 428 households, and 301 families living in Altamont. Of the households, 70.8% owned their home and 29.2% rented their home. The median age was 38.2 years. Of the people, 84.9% were White, 1.9% were Native American, 0.6% were Black, 0.4% were Asian, 0.8% were some other race, and 11.4% were two or more races. Hispanic or Latino of any race were 3.3% of the people. ===2010 census=== The 2010 census says that there were 1,080 people, 419 households, and 291 families living in Altamont. ==Education== Altamont is served by Labette County USD 506 school district. The Labette County High School mascot is the Grizzlies, and their colors are red and gold. ==References== ==Other websites== ;City * City of Altamont * Altamont - Directory of Public Officials ;Schools * USD 506, local school district ;Maps * Altamont City Map, KDOT Category:Cities in Labette County, Kansas Category:1879 establishments in Kansas",
 "title": "Altamont, Kansas"
}