{
 "id": "722357",
 "text": "H.O.T. is a South Korean boy band that formed in 1996. They are thought of as the first K-pop idol group. Their formula became the model for many K-pop groups that have followed since. The members are: Moon Hee-joon, Jang Woo- hyuk, Tony An, Kangta, and Lee Jae-won. H.O.T. was successful in South Korea, China, and Japan. They were among the first stars of the Korean Wave in Asia. The group broke up in 2001 after a disagreement with SM Entertainment. However, they later reunited in 2018. == Formation == H.O.T. was formed in 1996 by record producer Lee Soo-man of SM Entertainment. Lee had done a survey of high school students to find out what their ideal pop group would be like. He used this information to create H.O.T. The first member to join was Kangta, who Lee discovered at an amusement park. Next to join were Moon Hee-joon and Lee Jae-won. The fourth to join was Jang Woo-hyuk who Lee found when he won first place in a dance contest. Finally, Tony An joined the group after an audition in Los Angeles. == Career == === 1996–1997 === H.O.T. made their first album in September 1996. It is called We Hate All Kinds of Violence and sold 1.5 million copies. Their first single was \"Descendants of Warriors\" which was a criticism of bullying. Their second single, \"Candy,\" was a cheerful bubblegum pop song. That year, H.O.T. won Best New Artist at the Golden Disc Awards. In July 1997, H.O.T. released their second album. It has the title Wolf and Sheep, and sold 1 million copies in ten days. The album included the singles \"Wolf and Sheep,\" \"Happiness,\" and \"We Are the Future\". The album won the Grand Prize at both the 1997 Golden Disc Awards and the 1997 Seoul Music Awards. The song \"We Are the Future\" was also nominated for an International Viewer's Choice Award at the 1998 MTV Video Music Awards. By this time, H.O.T. had become a \"social sensation\" in South Korea. With their success came the rise of K-pop fan culture. In 1997, H.O.T. made their first Chinese album. === 1998 === H.O.T. released their third album in September 1998. The title is Resurrection and it included a variety of styles. It had sold more than 1.1 million copies by the following year. At the 1998 Seoul Music Awards, it was awarded the Grand Prize. Some accused the group of plagiarism as their song \"Line Up!\" was similar to a song by Rage Against the Machine. === 1999–2000 === H.O.T. made greatest hits album in April 1999. Then in June, they sang with Michael Jackson and S.E.S. at a concert in Seoul. In September 1999, H.O.T. released their fourth album. It had the title I Yah!. The title track is about a 1999 fire that killed kindergarten students at the Sealand Youth Training Center in South Korea. The album sold more than 1.3 million copies. That month, H.O.T. also became the first K-pop group to perform at the Seoul Olympic Stadium. === 2000 === In February 2000, H.O.T. held their first concert in China. As a result they became popular in China. This inspired other South Korean groups to also hold concerts in China. In September they released their fifth called Outside Castle. That year, the group also starred in the sci-fi movie Age of Peace. Despite H.O.T.'s popularity at the time, the movie was not a hit. === 2001: Disbandment === H.O.T. announced in May 2001 that the group would break up. The members told the public that this was due to a contract dispute with S.M. Entertainment. In the following days, hundreds of fans protested outside of S.M. Entertainment. Some fans blocked roads and threw rocks at the company's windows. === 2018: Reunion === In February 2018, H.O.T. appeared as a group on the South Korean television show Infinite Challenge. This was their first appearance as a group since 2003. On October 13 and 14, the group held a reunion concert at the Seoul Olympic Main Stadium with 100,000 present. == List of albums== === Studio albums === Title Album details Peak chart positions Sales KOR We Hate All Kinds of Violence * Released: September 7, 1996 * Label: SM Entertainment * Format: CD, cassette, digital download rowspan=\"2\" * KOR: 1,500,000+ Wolf and Sheep * Released: July 11, 1997 * Label: SM Entertainment * Format: CD, cassette, digital download * KOR: 1,000,000+ Resurrection * Released: September 24, 1998 * Label: SM Entertainment * Format: CD, cassette, digital download 12 * KOR: 1,103,439 I Yah! * Released: September 15, 1999 * Label: SM Entertainment * Format: CD, cassette, digital download 2 * KOR: 1,350,153 Outside Castle * Released: September 29, 2000 * Label: SM Entertainment * Format: CD, cassette, digital download 1 * KOR: 879,613 === Live albums === Title Album details Peak chart positions Sales KOR Greatest Hits: Song Collection Live Album * Released: April 12, 1999 * Label: SM Entertainment * Formats: CD, cassette, digital download 3 * KOR: 175,314 99 Live in Seoul * Released: January 6, 2000 * Label: SM Entertainment * Formats: CD, cassette, digital download 4 * KOR: 110,542 H.O.T. Forever * Released: April 27, 2001 * Label: SM Entertainment * Formats: CD, cassette, digital download 6 * KOR: 138,616 === Compilation albums === Title Album details Peak chart positions Sales KOR Age of Peace: The Original Soundtrack * Released: July 16, 2000 * Label: SM Entertainment * Format: CD, digital download 39 * KOR: 231,223 === Singles === Title Year Album \"Warrior's Descendant\" 1996 We Hate All Kinds of Violence \"Candy\" \"Wolf and Sheep\" 1997 Wolf and Sheep \"Full of Happiness\" \"We Are the Future\" \"Line Up!\" 1998 Resurrection \"Hope\" \"I Yah!\" 1999 I Yah! \"Git It Up\" \"It's Been Raining Since You Left Me\" \"Outside Castle\" 2000 Outside Castle \"We Can Do It\" \"A Song For Lady\" == List of movies == * Age of Peaces (2000) == Concert and tours == *1998 - H.O.T. The 1st Concert, Olympic Gymnastics Arena *1998.Feb.21 ~ Mar.31 - USA Live Tour, New York, Washington, Los Angeles, Hawaii *1999.Jan.22 ~ Feb.3 - H.O.T. The 2nd Concert, Seoul Sejong Center, Busan, Gwangju (65,400 attendees) *1999.Sept.18 - 99 Live In Seoul, Seoul Olympic Main Stadium (45,000 attendees) *2000.Feb.1 - 2000 H.O.T. Live Concert In Beijing (15,000 attendees) *2001.Feb.27 - 2001 H.O.T. Live Concert - H.O.T. Forever, Seoul Olympic Main Stadium (80,000 attendees) *2018.Oct.13 ~ 14 - 2018 Forever [High-five Of Teenagers] Concert, Seoul Olympic Main Stadium (100,000 attendees) *2019.Sep.20 ~ 11 ~ 22 - 2019 [High-five Of Teenagers] NEXT MESSAGE Concert, Gocheok Sky Dome (60,000 attendees) == Awards == === Golden Disc Awards === Year Category Recipient Result 1996 Best New Artist H.O.T. 1997 Grand Prize (Daesang): Best Album Wolf and Sheep Main Prize (Bonsang): Best Artist H.O.T. 1998 1999 ===Mnet Asian Music Awards=== Year Category Recipient Result 1999 Best Popular Music Video (Daesang) \"I Yah!\" Best Group Best Dance Performance Best Music Video Director Hong Jong-ho for \"I Yah!\" 2000 Best Popular Music Video (Daesang) \"Outside Castle\" 2000 Best Dance Performance 2000 Best Male Group 2008 10th Anniversary Remember 1999 H.O.T. === MTV Video Music Awards === Year Category Recipient Result 1998 International Viewer's Choice Award for MTV Asia \"We Are the Future\" 1999 International Viewer's Choice Award for MTV Korea \"Line Up!\" === Seoul Music Awards === Year Category Recipient Result 1997 Grand Prize (Daesang) H.O.T. Main Prize (Bonsang) 1998 Grand Prize (Daesang) H.O.T. (shared with Sechs Kies) Main Prize (Bonsang) H.O.T. 1999 == References == == Other websites == * * Official website (archived) (in Korean) Category:1996 establishments in South Korea Category:Hip hop bands Category:K-pop music groups Category:Musical groups established in 1996 Category:SM Entertainment artists Category:South Korean boy bands",
 "title": "H.O.T. (band)"
}