{
 "id": "722459",
 "text": "The is a recitation show at Yahashira shrine in Kami-fukawa village, near the city of Nara .高橋・鹿谷1991年 pp.110-112 The Shinto Temple in Kamifukawa has a tradition of accepting a 17-year-old boy as a member of a religious organization that carries out religious ceremonies at the temple. The acceptance of a boy into the organization at the temple is an acknowledgment that the child has become an adult. == The performance == Young men, aged 17 (If there are not enough boys aged 17 years, boys who are not yet 17 years old or are over 17 years old are also included in the performance) stand in a semi-circle dressed in samurai clothes and carrying bows. One by one, they are called to the centre by an old man who reads the name of a character in the tales of the feud between the Genji and Heike clans. There is no musical accompaniment. When all twenty-six characters have spoken, the youths rhythmically stamp their feet and sing offstage.Terence Lancashire, An Introduction to Japanese Folk Performing Arts (2011), et 196. Originally a rite of passage at the age of seventeen to mark the formal acceptance of the eldest son into the community of the twenty-two families of Kami-fukawa, the Daimokutate is now performed annually in mid-October by young men of various ages and from many different families.Unique in Japan as a dramatic performance without acting or music, the Daimokutate is an important marker of identity and plays an indispensable role in maintaining solidarity in this mountainous town. == History == The Daimokutate was performed around the end of the Muromachi period (XVI century). Daimokutate is the last living example of a tradition of reciting in sanctuary by ordinary people, attested for the first time in a document of 1534.E. Oyler, Daimokutate: Ritual Placatory Performance of the Genpei War, Oral Tradition 21 (2006), . Documents collected by the folklore specialist Hosen Jungo between 1953 and 1955, have been preserved, but it is likely that the repertoire was much larger.高橋・鹿谷1991年 pp.110-112 Daimokutate was inscribed in 2009 on the Representative List of the Intangible Cultural Heritage of Humanity of Unesco .Decision of the Intergovernmental Committee: 4.COM 13.48 == References == Category:Nara Prefecture Category:Festivals in Japan Category:October observances",
 "title": "Daimokutate"
}