{
 "id": "722496",
 "text": "Haghpat Monastery, also known as Haghpatavank (), is a medieval monastery complex in Haghpat, Armenia. == The monastery == The monastery was founded by Queen Khosrovanuysh, wife of the Bagratid king Ashot III, probably in 976. The nearby monastery at Sanahin was built around the same time. Haghbat, p534-535, in \"Armenian Art\", Donabedian, Patrick; Thierry, Jean-Michel. New York: 1989, Harry N. Abrams, Inc. ISBN 978-0810906259. The largest church in the complex, the Cathedral of Surb Nishan, probably begun in 976, was completed in 991 by king Smbat. It is a typical example of tenth century Armenian architecture, its central dome rests on the four imposing pillars of the lateral walls. The Armenian Prince Khutulukhaga, is depicted in the south transept (a transversal nave intersecting the main nave). The sons of the church's founder, Princes Smbat and Kurike, are shown with Queen Khosravanuysh in a bas-relieff. Excepet from one or two minor restorations carried out in the eleventh and twelfth centuries, the church is preserved its original character. There are several other structures at the site as well. There is the small domed Church of Sourb Grigor (St. Gregory ) from 1005. Two side chapels were added to the original church; the larger one built in the beginning of the 13th century and the smaller, known as \"Hamazasp House\", built in 1257. In 1245. Other 13th century additions include the chapel of Sourb Astvatsatsin, the scriptorium, and a large refectory which is outside the monastery limits. There are also a number of splendid khachkars (cross-stones) of the 11th-13th centuries standing on the territory of the monastery. The monastery has been damaged many times. Sometime around 1130, an earthquake destroyed parts of Haghpat Monastery and it was not restored until fifty years later. It also suffered numerous attacks by armed forces in the many centuries of its existence and from a major earthquake in 1988. But much of the complex is still intact today without substantial alterations. Today the area is an popular tourist site. == UNESCO World Heritage Site == Described as a \"masterpiece of religious architecture and a major center of learning in the Middle Ages\", Haghpat monastery, together with Sanahin monastery, was placed on UNESCO's World Heritage List in 1996. The monasteries at Haghpat and Sanahin were chosen as UNESCO World Heritage Sites because: > The two monastic complexes represent the highest flowering of Armenian > religious architecture, with unique style developed from a mix of elements > of Byzantine ecclesiastical architecture and the traditional vernacular > architecture of the Caucasian region. == Gallery == File:Monasterio de Haghpat, Armenia, 2016-09-30, DD 05.jpg|The belltower at Haghpat Monastery File:Monasterio de Haghpat, Armenia, 2016-09-30, DD 18.jpg|Another view of the belltower and the Church of Sourb Nshan File:Armenia Haghbat.jpg|Artistically carved entranceway to one of the buildings File:Map of Haghpat.gif|Road map of the Haghpat-Sanahin area File:Haghpat Monestary Ceiling, Armenia.jpg|Haghpat Monastery Ceiling, Armenia File:Haghpat From Inside.jpg|Haghpat, looking from inside out; note cross stones or khachkar's on left and right File:Cross-Stones-Haghpat.jpg|Cross stones or khachkars at Haghpat Monastery, Armenia File:Monasterio de Haghpat, Armenia, 2016-09-30, DD 28-30 HDR.jpg|Interior view of the church File:Monasterio de Haghpat, Armenia, 2016-09-30, DD 06.jpg|Scriptorium, Haghpat. Holes in floor for hiding scrolls during times of peril == References == Category:Pages with unreviewed translations Category:Buildings and structures in Armenia Category:World Heritage Sites",
 "title": "Haghpat Monastery"
}