{
 "id": "72256",
 "text": "The Proto-Indo-Europeans were a group of people after the last Ice age. Their existence, from 4000 BC or earlier, is implied by their language. They were the speakers of the Proto-Indo-European language (PIE), an unwritten but now partly reconstructed prehistoric language. == People == Knowledge of them comes not only from language, but also from archaeology and archaeo-genetics. They were a group of loosely related peoples ancestral to the Bronze Age Indo- Europeans. The Proto-Indo-Europeans likely lived during the Copper Age, or roughly the 5th to 4th millennia BC. Mainstream scholarship places them in the general region of the steppes in Eastern Europe and Central Asia. Some scholars would extend the time of PIE much further back. More recent studies support an origin in today's northern Iran and the Armenian Highland.Reich, David (2018), Who We Are and How We Got Here: Ancient DNA and the New Science of the Human Past, Knopf Doubleday Publishing Group By the mid-2nd millennium BC offshoots of the Proto-Indo-Europeans had reached Anatolia, the Aegean, Indus Valley, Ganges Plain, and likely Western Europe.Mallory J.P. & Adams D.Q. 2006. The Oxford introduction to Proto-Indo-European and the Proto-Indo- European world. Oxford University Press. , == Culture == The Proto-Indo- European culture had some or all of these features: * stockbreeding and animal husbandry, including domesticated cattle, horses, and dogs * agriculture and cereal cultivation, including technology commonly ascribed to early farming communitiesMallory J.P. 1989. In search of the Indo-Europeans: language, archaeology and myth, London: Thames & Hudson. * a climate with winter snow\"The Indo-Europeans knew snow in their homeland; the word sneigwh- is nearly ubiquitous.\" The American Heritage Dictionary of the English Language, Fourth Edition. 2000 * transportation by or across water * the solid wheel, used for carts, but not yet chariots with spoked wheelsp249 * worship of a sky god, *dyeus ph2tēr (literally 'sky father': Ancient Greek Ζευς (πατηρ) / Zeus (patēr); dieu-ph2tēr Latin Jupiter.)\"Yet, for the Indo-European-speaking society, we can reconstruct with certainty the word for 'god', deiw-os, and the two-word name of the chief deity of the pantheon, dyeu-pəter- (Latin Iūpiter, Greek Zeus patēr, Sanskrit Dyau pitar, and Luvian Tatis Tiwaz)\". The American Heritage Dictionary of the English Language, Fourth Edition. 2000 * oral epic poetry or song lyrics that used stock phrases such as imperishable fame * a patrilineal kinship system based on relationships between men The Proto-Indo-Europeans were a patrilineal society, probably half-nomadic, relying on animal husbandry, notably of cattle and sheep. These people were probably the ones to domesticate the horse – hekwos (cf. Latin equus, Ancient Greek ῐ̔́ππος / hippos). The cow (gwous) played a central role, in religion and mythology as well as in daily life. A man's wealth would have been measured by the number of his animals (small livestock), peḱus (cf. English fee, Latin pecunia). They practiced a polytheistic religion centered on sacrificial rites, probably administered by a priestly caste. Burials in barrows or tomb chambers (see Kurgan hypothesis). Important leaders would have been buried with their belongings, and possibly also with members of their households or wives (human sacrifice, suttee). Many Indo-European societies know a threefold division of priests, a warrior class, and a class of peasants or husbandmen. If there was a separate class of warriors, it probably consisted of single young men. They would have followed a separate warrior code unacceptable in the society outside their peer-group. Traces of initiation rites in several Indo-European societies suggest that this group identified itself with wolves or dogs (see also Berserker, werewolf). Reconstructions of their language suggest other animals they knew were the sheep - *owis, goats - *heyg, pigs - *suhs, and beavers - *bebrus. As for technology, reconstruction suggests a culture of the early Bronze Age, with bronze tools and weapons. Silver and gold were known. Sheep were kept for wool, and textiles were woven. The wheel was known, certainly for ox-drawn carts, and late Proto-Indo European warfare may also have made use of horse- drawn chariots. The native name of this people cannot be reconstructed with certainty. Aryo- (interpreted by some as meaning \"those who plow\"), sometimes upheld as a self-identification of the Proto-Indo-Europeans (see Aryan), is shown only in the Indo-Iranian subfamily, since it appears on written inscriptions; however, the Proto-Indo-Europeans themselves had not yet adopted writing, so there is no way to verify that Aryo- was their self- identification. ==Related pages== * Proto-Indo-European language * Comparative linguistics * List of Indo-European roots * Urheimat * Armenian hypothesis * Archaeogenetics * Kurgan * Aryan == References == == Further reading == * * . * . * C. Renfrew 1987. Archaeology and language, the puzzle of Indo-European origins. London, Penguin. * Brian Sykes 2001. The seven daughters of Eve. London. Corgi Books. * . == Other websites == * Indo-European Roots Index, from The American Heritage® Dictionary * Kurgan culture * Indo-European Origins in Southeast Europe Category:Indo-European",
 "title": "Proto-Indo-Europeans"
}