{
 "id": "722731",
 "text": "This is a list of prime ministers of Japan: ==List of prime ministers== Contents by era Portrait Portrait Prime Minister Term of office & mandate Term of office & mandate Term of office & mandate Party Government Monarch Itō Hirobumi 伊藤 博文 1885 1888 — None 1. Itō I Itō Hirobumi 伊藤 博文 1\\. Itō I Kuroda Kiyotaka 黒田 清隆 1888 1889 — None 2. Kuroda Kuroda Kiyotaka 黒田 清隆 2\\. Kuroda Sanjō Sanetomi 三條 實美 1889 1889 — None Sanjō (interim) Sanjō Sanetomi 三條 實美 Sanjō (interim) Yamagata Aritomo 山縣 有朋 1889 1891 — Military 3\\. Yamagata I Yamagata Aritomo 山縣 有朋 1889 1891 1890 3. Yamagata I Yamagata Aritomo 山縣 有朋 3\\. Yamagata I Matsukata Masayoshi 松方 正義 1891 1892 — None 4. Matsukata I Matsukata Masayoshi 松方 正義 1891 1892 1892 4. Matsukata I Matsukata Masayoshi 松方 正義 4\\. Matsukata I Itō Hirobumi 伊藤 博文 1892 1896 — None 5. Itō II Itō Hirobumi 伊藤 博文 1892 1896 Mar. 1894 5. Itō II Itō Hirobumi 伊藤 博文 1892 1896 Sep. 1894 5. Itō II Itō Hirobumi 伊藤 博文 5\\. Itō II During this interval, Privy Council Chairman Kuroda Kiyotaka was the acting Prime Minister. Matsukata Masayoshi 松方 正義 1896 1898 — None 6. Matsukata II Matsukata Masayoshi 松方 正義 6\\. Matsukata II Itō Hirobumi 伊藤 博文 1898 1898 — None 7. Itō III Itō Hirobumi 伊藤 博文 1898 1898 1898 7. Itō III Itō Hirobumi 伊藤 博文 7\\. Itō III Ōkuma Shigenobu 大隈 重信 1898 1898 — Kenseitō 8. Ōkuma I Ōkuma Shigenobu 大隈 重信 1898 1898 1898 8. Ōkuma I Ōkuma Shigenobu 大隈 重信 8\\. Ōkuma I Yamagata Aritomo 山縣 有朋 1898 1900 — Military 9\\. Yamagata II Yamagata Aritomo 山縣 有朋 9\\. Yamagata II Itō Hirobumi 伊藤 博文 1900 1901 — Rikken Seiyūkai 10. Itō IV Itō Hirobumi 伊藤 博文 10\\. Itō IV During this interval, Privy Council Chairman Saionji Kinmochi was the acting Prime Minister. Katsura Tarō 桂 太郎 1901 1906 — Military 11\\. Katsura I Katsura Tarō 桂 太郎 1901 1906 1902 11. Katsura I Katsura Tarō 桂 太郎 1901 1906 1903 11. Katsura I Katsura Tarō 桂 太郎 1901 1906 1904 11. Katsura I Katsura Tarō 桂 太郎 11\\. Katsura I Saionji Kinmochi 西園寺 公望 1906 1908 — Rikken Seiyūkai 12. Saionji I Saionji Kinmochi 西園寺 公望 1906 1908 1908 12. Saionji I Saionji Kinmochi 西園寺 公望 12\\. Saionji I Katsura Tarō 桂 太郎 1908 1911 — Military 13\\. Katsura II Katsura Tarō 桂 太郎 13\\. Katsura II Saionji Kinmochi 西園寺 公望 1911 1912 — Rikken Seiyūkai 14. Saionji II Saionji Kinmochi 西園寺 公望 1911 1912 1912 14. Saionji II Saionji Kinmochi 西園寺 公望 14\\. Saionji II Katsura Tarō 桂 太郎 1912 1913 — None 15. Katsura III Katsura Tarō 桂 太郎 15\\. Katsura III Yamamoto Gonnohyōe 山本 權兵衛 1913 1914 — Military 16\\. Yamamoto I Yamamoto Gonnohyōe 山本 權兵衛 16\\. Yamamoto I Ōkuma Shigenobu 大隈 重信 1914 1916 — Rikken Dōshikai 17. Ōkuma II Ōkuma Shigenobu 大隈 重信 1914 1916 1915 17\\. Ōkuma II Ōkuma Shigenobu 大隈 重信 17\\. Ōkuma II Terauchi Masatake 寺内 正毅 1916 1918 — Military 18\\. Terauchi Terauchi Masatake 寺内 正毅 1916 1918 1917 18\\. Terauchi Terauchi Masatake 寺内 正毅 18\\. Terauchi Hara Takashi 原 敬 1918 1921 — Rikken Seiyūkai 19. Hara Hara Takashi 原 敬 1918 1921 1920 19\\. Hara Hara Takashi 原 敬 19\\. Hara During this interval, Foreign Minister Uchida Kosai was the acting Prime Minister. Takahashi Korekiyo 高橋 是清 1921 1922 — Rikken Seiyūkai 20. Takahashi Takahashi Korekiyo 高橋 是清 20\\. Takahashi Katō Tomosaburō 加藤 友三郎 1922 1923 — Military 21\\. Katō To. Katō Tomosaburō 加藤 友三郎 21\\. Katō To. During this interval, Foreign Minister Uchida Kosai was the acting Prime Minister. Yamamoto Gonnohyōe 山本 權兵衛 1923 1924 — Military 22\\. Yamamoto II Yamamoto Gonnohyōe 山本 權兵衛 22\\. Yamamoto II Kiyoura Keigo 清浦 奎吾 1924 1924 — None 23. Kiyoura Kiyoura Keigo 清浦 奎吾 23\\. Kiyoura Katō Takaaki 加藤 高明 1924 1926 1924 Kenseikai 24. Katō Ta. Katō Takaaki 加藤 高明 24\\. Katō Ta. During this interval, Interior Minister Wakatsuki Reijirō was the acting Prime Minister. Wakatsuki Reijirō 若槻 禮次郎 1926 1927 — Kenseikai 25. Wakatsuki I Wakatsuki Reijirō 若槻 禮次郎 25\\. Wakatsuki I Tanaka Giichi 田中 義一 1927 1929 — Rikken Seiyūkai 26. Tanaka G. Tanaka Giichi 田中 義一 1927 1929 1928 26\\. Tanaka G. Tanaka Giichi 田中 義一 26\\. Tanaka G. Osachi Hamaguchi 濱口 雄幸 1929 1931 — Rikken Minseitō 27. Hamaguchi Osachi Hamaguchi 濱口 雄幸 1929 1931 1930 27\\. Hamaguchi Osachi Hamaguchi 濱口 雄幸 27\\. Hamaguchi During this interval, Foreign Minister Kijūrō Shidehara was the acting Prime Minister. Wakatsuki Reijirō 若槻 禮次郎 1931 1931 — Rikken Minseitō 28. Wakatsuki II Wakatsuki Reijirō 若槻 禮次郎 28\\. Wakatsuki II Inukai Tsuyoshi 犬養 毅 1931 1932 — Rikken Seiyūkai 29. Inukai Inukai Tsuyoshi 犬養 毅 1931 1932 1932 29\\. Inukai Inukai Tsuyoshi 犬養 毅 29\\. Inukai During this interval, Finance Minister Takahashi Korekiyo was the acting Prime Minister. Saitō Makoto 齋藤 實 1932 1934 — Military 30\\. Saitō Saitō Makoto 齋藤 實 30\\. Saitō Keisuke Okada 岡田 啓介 1934 1936 — Military 31\\. Okada Keisuke Okada 岡田 啓介 1934 1936 1936 31\\. Okada Keisuke Okada 岡田 啓介 31\\. Okada During this interval, Interior Minister Fumio Gotō was the acting Prime Minister. Kōki Hirota 廣田 弘毅 1936 1937 — None 32. Hirota Kōki Hirota 廣田 弘毅 32\\. Hirota Senjūrō Hayashi 林 銑十郞 1937 1937 — Military 33\\. Hayashi Senjūrō Hayashi 林 銑十郞 1937 1937 1937 33\\. Hayashi Senjūrō Hayashi 林 銑十郞 33\\. Hayashi Fumimaro Konoe 近衞 文麿 1937 1939 — None 34. Konoe I Fumimaro Konoe 近衞 文麿 34\\. Konoe I Kiichirō Hiranuma 平沼 騏一郞 1939 1939 — None 35. Hiranuma Kiichirō Hiranuma 平沼 騏一郞 35\\. Hiranuma Nobuyuki Abe 阿部 信行 1939 1940 — Military 36\\. Abe N. Nobuyuki Abe 阿部 信行 36\\. Abe N. Mitsumasa Yonai 米内 光政 1940 1940 — Military 37\\. Yonai Mitsumasa Yonai 米内 光政 37\\. Yonai Fumimaro Konoe 近衞 文麿 1940 1941 — None 38. Konoe II Fumimaro Konoe 近衞 文麿 1940 1941 — Taisei Yokusankai 38. Konoe II Fumimaro Konoe 近衞 文麿 39\\. Konoe III Hideki Tōjō 東條 英機 1941 1944 — Taisei Yokusankai 40. Tōjō Hideki Tōjō 東條 英機 1941 1944 1942 40\\. Tōjō Hideki Tōjō 東條 英機 40\\. Tōjō Kuniaki Koiso 小磯 國昭 1944 1945 — Taisei Yokusankai 41. Koiso Kuniaki Koiso 小磯 國昭 41\\. Koiso Kantarō Suzuki 鈴木 貫太郞 1945 1945 — Taisei Yokusankai 42. Suzuki K. Kantarō Suzuki 鈴木 貫太郞 None 42. Suzuki K. Naruhiko Higashikuni 東久邇宮稔彦王 1945 1945 — Imperial Family 43. Higashikuni no miya 43\\. Higashikuni no miya Kijūrō Shidehara 幣原 喜重郞 1945 1946 — Progressive 44. Shidehara Kijūrō Shidehara 幣原 喜重郞 44\\. Shidehara Shigeru Yoshida 吉田 茂 1946 1947 1946 Liberal 45. Yoshida I Shigeru Yoshida 吉田 茂 45\\. Yoshida I Tetsu Katayama 片山 哲 Rep for Kanagawa 3rd 1947 1948 1947 Socialist 46. Katayama Tetsu Katayama 片山 哲 Rep for Kanagawa 3rd 46\\. Katayama Hitoshi Ashida 芦田 均 Rep for Kyōto 2nd 1948 1948 — Democratic 47. Ashida Hitoshi Ashida 芦田 均 Rep for Kyōto 2nd 47\\. Ashida Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 1948 1954 — Democratic Liberal 48. Yoshida II Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 1948 1954 1949 49\\. Yoshida III Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 1948 1954 1949 49\\. Yoshida III Liberal Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 1948 1954 1952 50\\. Yoshida IV Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 1948 1954 1953 51\\. Yoshida IV Shigeru Yoshida 吉田 茂 Rep for Kōchi At-large 51\\. Yoshida IV Ichirō Hatoyama 鳩山 一郎 Rep for Tokyo 1st 1954 1956 — Democratic 52. Hatoyama I. I Ichirō Hatoyama 鳩山 一郎 Rep for Tokyo 1st 1954 1956 1955 53\\. Hatoyama I. II Ichirō Hatoyama 鳩山 一郎 Rep for Tokyo 1st 1954 1956 — Liberal Democratic 54. Hatoyama I. III Ichirō Hatoyama 鳩山 一郎 Rep for Tokyo 1st 54\\. Hatoyama I. III Tanzan Ishibashi 石橋 湛山 Rep for Shizuoka 2nd 1956 1957 — Liberal Democratic 55. Ishibashi Tanzan Ishibashi 石橋 湛山 Rep for Shizuoka 2nd 55\\. Ishibashi Nobusuke Kishi 岸 信介 Rep for Yamaguchi 1st 1957 1960 — Liberal Democratic 56. Kishi I Nobusuke Kishi 岸 信介 Rep for Yamaguchi 1st 1957 1960 1958 57\\. Kishi II Nobusuke Kishi 岸 信介 Rep for Yamaguchi 1st 57\\. Kishi II Hayato Ikeda 池田 勇人 Rep for Hiroshima 2nd 1960 1964 — Liberal Democratic 58. Ikeda I Hayato Ikeda 池田 勇人 Rep for Hiroshima 2nd 1960 1964 1960 59\\. Ikeda II Hayato Ikeda 池田 勇人 Rep for Hiroshima 2nd 1960 1964 1963 60\\. Ikeda III Hayato Ikeda 池田 勇人 Rep for Hiroshima 2nd 60\\. Ikeda III Eisaku Satō 佐藤 榮作 Rep for Yamaguchi 2nd 1964 1972 — Liberal Democratic 61. Satō I Eisaku Satō 佐藤 榮作 Rep for Yamaguchi 2nd 1964 1972 1967 62\\. Satō II Eisaku Satō 佐藤 榮作 Rep for Yamaguchi 2nd 1964 1972 1969 63\\. Satō III Eisaku Satō 佐藤 榮作 Rep for Yamaguchi 2nd 63\\. Satō III Kakuei Tanaka 田中 角榮 Rep for Niigata 3rd 1972 1974 — Liberal Democratic 64. Tanaka K. I Kakuei Tanaka 田中 角榮 Rep for Niigata 3rd 1972 1974 1972 65\\. Tanaka K. II Kakuei Tanaka 田中 角榮 Rep for Niigata 3rd 65\\. Tanaka K. II Takeo Miki 三木 武夫 Rep for Tokushima At-large 1974 1976 — Liberal Democratic 66. Miki Takeo Miki 三木 武夫 Rep for Tokushima At-large 66\\. Miki Takeo Fukuda 福田 赳夫 Rep for Gunma 3rd 1976 1978 1976 Liberal Democratic 67. Fukuda T. Takeo Fukuda 福田 赳夫 Rep for Gunma 3rd 67\\. Fukuda T. Masayoshi Ōhira 大平 正芳 Rep for Kagawa 2nd 1978 1980 — Liberal Democratic 68. Ōhira I Masayoshi Ōhira 大平 正芳 Rep for Kagawa 2nd 1978 1980 1979 69\\. Ōhira II Masayoshi Ōhira 大平 正芳 Rep for Kagawa 2nd 69\\. Ōhira II During this interval, Chief Cabinet Secretary Masayoshi Ito was the acting Prime Minister. Zenkō Suzuki 鈴木 善幸 Rep for Iwate 1st 1980 1982 1980 Liberal Democratic 70. Suzuki Z. Zenkō Suzuki 鈴木 善幸 Rep for Iwate 1st 70\\. Suzuki Z. Yasuhiro Nakasone 中曽根 康弘 Rep for Gunma 3rd 1982 1987 — Liberal Democratic 71. Nakasone I Yasuhiro Nakasone 中曽根 康弘 Rep for Gunma 3rd 1982 1987 1983 72\\. Nakasone II Yasuhiro Nakasone 中曽根 康弘 Rep for Gunma 3rd 1982 1987 1986 72\\. Nakasone II Yasuhiro Nakasone 中曽根 康弘 Rep for Gunma 3rd 72\\. Nakasone II Noboru Takeshita 竹下 登 Rep for Shimane At-large 1987 1989 — Liberal Democratic 74. Takeshita Noboru Takeshita 竹下 登 Rep for Shimane At-large 74\\. Takeshita Sōsuke Uno 宇野 宗佑 Rep for Shiga At-large 1989 1989 — Liberal Democratic 75. Uno Sōsuke Uno 宇野 宗佑 Rep for Shiga At-large 75\\. Uno Toshiki Kaifu 海部 俊樹 Rep for Aichi 3rd 1989 1991 — Liberal Democratic 76. Kaifu I Toshiki Kaifu 海部 俊樹 Rep for Aichi 3rd 1989 1991 1990 77\\. Kaifu II Toshiki Kaifu 海部 俊樹 Rep for Aichi 3rd 77\\. Kaifu II Kiichi Miyazawa 宮澤 喜一 Rep for Hiroshima 3rd 1991 1993 — Liberal Democratic 78. Miyazawa Kiichi Miyazawa 宮澤 喜一 Rep for Hiroshima 3rd 78\\. Miyazawa Morihiro Hosokawa 細川 護熙 Rep for Kumamoto 1st 1993 1994 1993 New 79. Hosokawa Morihiro Hosokawa 細川 護熙 Rep for Kumamoto 1st 79\\. Hosokawa Tsutomu Hata 羽田 孜 Rep for Nagano 2nd 1994 1994 — Renewal 80. Hata Tsutomu Hata 羽田 孜 Rep for Nagano 2nd 80\\. Hata Tomiichi Murayama 村山 富市 Rep for Ōita 1st 1994 1996 — Socialist 81. Murayama Tomiichi Murayama 村山 富市 Rep for Ōita 1st 81\\. Murayama Ryūtarō Hashimoto 橋本 龍太郎 Rep for Okayama 4th 1996 1998 — Liberal Democratic 82. Hashimoto I Ryūtarō Hashimoto 橋本 龍太郎 Rep for Okayama 4th 1996 1998 1996 83\\. Hashimoto II Ryūtarō Hashimoto 橋本 龍太郎 Rep for Okayama 4th 83\\. Hashimoto II Keizō Obuchi 小渕 恵三 Rep for Gunma 5th 1998 2000 — Liberal Democratic 84. Obuchi Keizō Obuchi 小渕 恵三 Rep for Gunma 5th 84\\. Obuchi Yoshirō Mori 森 喜朗 Rep for Ishikawa 2nd 2000 2001 — Liberal Democratic 85. Mori I Yoshirō Mori 森 喜朗 Rep for Ishikawa 2nd 2000 2001 2000 86\\. Mori II Yoshirō Mori 森 喜朗 Rep for Ishikawa 2nd 86\\. Mori II Junichirō Koizumi 小泉 純一郎 Rep for Kanagawa 11th 2001 2006 — Liberal Democratic 87. Koizumi I Junichirō Koizumi 小泉 純一郎 Rep for Kanagawa 11th 2001 2006 2003 88\\. Koizumi II Junichirō Koizumi 小泉 純一郎 Rep for Kanagawa 11th 2001 2006 2005 89\\. Koizumi III Junichirō Koizumi 小泉 純一郎 Rep for Kanagawa 11th 89\\. Koizumi III Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 2006 2007 — Liberal Democratic 90. Abe S. I Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 90\\. Abe S. I Yasuo Fukuda 福田 康夫 Rep for Gunma 4th 2007 2008 — Liberal Democratic 91. Fukuda Y. Yasuo Fukuda 福田 康夫 Rep for Gunma 4th 91\\. Fukuda Y. Tarō Asō 麻生 太郎 Rep for Fukuoka 8th 2008 2009 — Liberal Democratic 92. Asō Tarō Asō 麻生 太郎 Rep for Fukuoka 8th 92\\. Asō Yukio Hatoyama 鳩山 由紀夫 Rep for Hokkaido 9th 2009 2010 2009 Democratic 93. Hatoyama Y. Yukio Hatoyama 鳩山 由紀夫 Rep for Hokkaido 9th 93\\. Hatoyama Y. Naoto Kan 菅 直人 Rep for Tokyo 18th 2010 2011 — Democratic 94. Kan Naoto Kan 菅 直人 Rep for Tokyo 18th 94\\. Kan Yoshihiko Noda 野田 佳彦 Rep for Chiba 4th 2011 2012 — Democratic 95. Noda Yoshihiko Noda 野田 佳彦 Rep for Chiba 4th 95\\. Noda Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 2012 2020 2012 Liberal Democratic 96. Abe S. II Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 2012 2020 2014 97\\. Abe S. III Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 2012 2020 2017 98\\. Abe S. IV Shinzō Abe 安倍 晋三 Rep for Yamaguchi 4th 98\\. Abe S. IV Yoshihide Suga 菅 義偉 Rep for Kanagawa 2nd 2020 2021 — Liberal Democratic 99. Suga Yoshihide Suga 菅 義偉 Rep for Kanagawa 2nd 99\\. Suga Fumio Kishida 岸田 文雄 Rep for Hiroshima 1st 2021 2024 2021 Liberal Democratic 100. Kishida Fumio Kishida 岸田 文雄 Rep for Hiroshima 1st 100\\. Kishida Shigeru Ishiba 石破 茂 Rep for Tottori 1st 2024 Incumbent — Liberal Democratic 101. Shigeru Shigeru Ishiba 石破 茂 Rep for Tottori 1st 101\\. Shigeru ==References== * Japan",
 "title": "List of prime ministers of Japan"
}