{
 "id": "722975",
 "text": "Bunker Hill is a city in Russell County, Kansas, United States. In 2020, 103 people lived there. ==History== In Summer 1871, J. B. Corbett and Valentine Harbaugh, leaders of a place from Ohio, created Bunker Hill at a place on the Kansas Pacific Railway. The settlement was named after a Butterfield Overland Despatch station, built in 1865. That station was at the place before Bunker Hill was. County commissioners said Bunker Hill was the county seat in 1872. Two years later, a popular vote moved the seat to nearby Russell. Many Bunker Hill residents moved there too. This made it hard for the town to grow. By 1883, a small business community grew, including a hotel, flour mill, and several shops. ==Geography== Bunker Hill is at (38.874716, -98.702759). It is at an elevation of 1,860 feet (567 m). It is in north-central Kansas. Bunker Hill is 108 miles (174 km) northwest of Wichita and 221 miles (355 km) west of Kansas City. Located 1 mile (1.7 km) north of Interstate 70, it is roughly 8 miles (13 km) east of Russell, the county seat. The community is in the Smoky Hills region of the Great Plains. It is about 5 miles (8 km) north of the Smoky Hill River and 7 miles (11 km) south of the Saline River. Wilson Lake lies 6 miles (10 km) to the northeast. The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Bunker Hill has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Bunker Hill has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Bunker Hill, Kansas ==People== ===2020 census=== The 2020 census says that there were 103 people, 44 households, and 21 families living in Bunker Hill. Of the households, 95.5% owned their home and 4.5% rented their home. The median age was 46.8 years. Of the people, 99.0% were White and 1.0% were two or more races. None were Hispanic or Latino. ===2010 census=== The 2010 census says that there were 95 people, 47 households, and 21 families living in Bunker Hill. ==Economy== The cost of living in Bunker Hill is somewhat low; the cost of living index for Bunker Hill is 80.0, when compared to the U.S. average of 100. ==Government== Bunker Hill is a city of the third class with a mayor- council form of government. The city council has of five members. It meets on the second Tuesday of each month. ==Education== Bunker Hill is part of USD 407 Russell County Schools. The district high school is Russel High School in Russell. Bunker Hill schools were closed because of school unification. The Bunker Hill High School mascot was White Owls.\"The good ole days\", The Salina Journal, December 1, 1994, p.17. ==Infrastructure== ===Transportation=== Interstate 70 and U.S. Route 40 run concurrently east-west a mile south of the city. Bunker Hill-Luray Road, a paved county road, goes north-south along the city's western part. Union Pacific Railroad has one freight rail line through Bunker Hill. It is the Kansas Pacific (KP) Line. The line goes east-west through the community. ===Utilities=== Western Electric provides electricity to the people of Bunker Hill. Rural Telephone provides landline telephone service. Nex-Tech offers cable television and internet access. Most people use natural gas for heating; service is provided by Midwest Energy, Inc. ==Media== Bunker Hill is in the Wichita-Hutchinson, Kansas television market. Smoky Hills Public Television, part of the PBS network for western Kansas, is headquartered in Bunker Hill. ==Famous people== *Mary Ann Bickerdyke (1817-1901), American Civil War nurse ==References== ==Other websites== ;City * Bunker Hill - Directory of Public Officials ;Schools * USD 407, local school district ;Maps * Bunker Hill City Map , KDOT Category:Cities in Russell County, Kansas Category:1871 establishments in Kansas",
 "title": "Bunker Hill, Kansas"
}