{
 "id": "72296",
 "text": "Dame Margaret Natalie Smith (28 December 1934 - 27 September 2024) was a British actress. She made her stage debut in 1952 and her career lasted for over 70 years. She won many awards for acting, both for the stage and for movies, including seven BAFTA Awards (five competitive awards and two special awards including the Bafta Fellowship in 1996), two Academy Awards, two Golden Globes, two Emmy Awards, a Laurence Olivier Award, two SAG Awards and a Tony Award. ==Career== Her award-winning movies include Othello (1965), The Prime of Miss Jean Brodie (1969), Travels with My Aunt (1972), California Suite (1978), Clash of the Titans (1981), A Room with a View (1985) and Gosford Park (2001). She has also been in a number of widely-popular movies, including Hook (1991), Sister Act (1992) and as Professor Minerva McGonagall in the Harry Potter movie series. Smith said that acting in the Harry Potter movies was not fully satisfying. However, she said she enjoyed being a part of the franchise because it allowed her to bond with her grandchildren. Smith underwent intensive chemotherapy for breast cancer while filming Half-Blood Prince. The treatment left her feeling \"horribly sick\", but she eventually made a full recovery. She had a role in the drama Downton Abbey as Violet Crawley, the Dowager Countess of Grantham, for which she has won an Emmy. ==Personal life== Smith was born in Ilford, Essex. She moved to Oxford at age four and went to Oxford High School. Smith has been married twice. She married actor Robert Stephens on 29 June 1967 at Greenwich. The couple had two sons: actors Chris Larkin (born in 1967) and Toby Stephens (born in 1969). They divorced on 6 May 1974.Maggie Smith biography . Tiscali.film & TV.Maggie Smith. Film Reference.com. She married playwright Beverley Cross on 23 August 1975 at Guildford. He died on 20 March 1998. In 2007, The Sunday Telegraph reported that she had breast cancer. She has made a full recovery. Smith died on 27 September 2024 at the Chelsea and Westminster Hospital in London, at the age of 89. ==Filmography== ===Television and cinema=== Year Title Role Notes 1958 Nowhere to Go Bridget Howard Nominated — BAFTA Award for Best Newcomer 1962 Go to Blazes Chantal 1963 Miss Mead Nominated — Golden Globe Award for New Star of the Year – Actress 1964 Philpot 1965 Othello Desdemona 1965 Young Cassidy Nora Nominated — BAFTA Award for Best Actress in a Leading Role 1967 Sarah Watkins 1968 Hot Millions Patty Terwilliger Smith 1969 Jean Brodie 1969 Oh! What a Lovely War Music Hall Star 1972 Travels with My Aunt Aunt Augusta 1973 Love and Pain and the Whole Damn Thing Lila Fisher 1974 Gwendylspire Boughgrough 1975 Ms. Collins 1976 Murder by Death Dora Charleston 1978 Death on the Nile Miss Bowers Nominated — BAFTA Award for Best Actress in a Supporting Role 1978 California Suite Diana Barrie 1981 Quartet Lois Heidler Nominated — BAFTA Award for Best Actress in a Leading Role 1981 Clash of the Titans Thetis Nominated — Saturn Award for Best Supporting Actress 1982 Evil Under the Sun Daphne Castle 1982 Lady Isabel Ames 1982 Better Late Than Never Miss Anderson 1984 Joyce Chilvers BAFTA Award for Best Actress in a Leading Role 1984 Lily in Love Lily Wynn Nominated — British Academy Television Award for Best Actress 1985 Charlotte Bartlett 1987 Judith Hearne BAFTA Award for Best Actress in a Leading Role 1987 Talking Heads Susan Nominated — British Academy Television Award for Best Actress 1991 Hook Wendy Darling 1992 Sister Act Reverend Mother 1992 Memento Mori Mrs. Mabel Pettigrew Nominated — British Academy Television Award for Best Actress 1993 Suddenly, Last Summer Violet Venable Nominated — Emmy Award for Outstanding Lead Actress – Miniseries or a Movie 1993 Sister Act 2: Back in the Habit Reverend Mother 1993 Mrs. Medlock Nominated — BAFTA Award for Best Actress in a Supporting Role 1995 Richard III Duchess of York 1996 Gunilla Garson Goldberg National Board of Review Award for Best Cast 1997 Washington Square Aunt Lavinia Penniman Nominated — Chlotrudis Award for Best Supporting Actress 1999 Curtain Call Lily Gale 1999 Lady Myra Naylor 1999 Tea with Mussolini Lady Hester Random BAFTA Award for Best Actress in a Supporting Role 1999 All the King's Men Queen Alexandra 1999 David Copperfield Betsey Trotwood 2001 Gosford Park Constance, Countess of Trentham 2001 Harry Potter and the Sorcerer's Stone Professor Minerva McGonagall 2002 Harry Potter and the Chamber of Secrets Professor Minerva McGonagall Nominated — Phoenix Film Critics Society Award for Best Cast 2002 Divine Secrets of the Ya-Ya Sisterhood Caro Eliza Bennett 2003 My House in Umbria Emily Delahunty 2004 Harry Potter and the Prisoner of Azkaban Professor Minerva McGonagall 2004 Ladies in Lavender Janet Widdington Nominated — European Film Award for Best Actress 2005 Keeping Mum Grace Hawkins 2005 Harry Potter and the Goblet of Fire Professor Minerva McGonagall 2007 Harry Potter and the Order of the Phoenix Professor Minerva McGonagall 2007 Becoming Jane Lady Gresham 2007 Capturing Mary Mary Gilbert Nominated — Emmy Award for Outstanding Lead Actress – Miniseries or a Movie 2009 Harry Potter and the Half-Blood Prince Professor Minerva McGonagall 2009 From Time to Time Linnet Oldknow 2010 Nanny McPhee and the Big Bang Mrs. Docherty 2010–2022 Downton Abbey Violet Crawley, the Dowager Countess of Grantham Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie TV Times Award for Best Actress Nominated — BAFTA Award for Best Supporting Actress Nominated — Broadcasting Press Guild Award for Best Actress Nominated — Golden Globe Award for Best Supporting Actress - Series, Miniseries or Television Film Nominated — Monte Carlo Television Festival Award for Outstanding Actress Nominated — Satellite Award for Best Supporting Actress - Series, Miniseries or Television Film Nominated — Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie 2011 Gnomeo & Juliet Lady Bluebury 2011 Harry Potter and the Deathly Hallows – Part 2 Professor Minerva McGonagall 2012 The Best Exotic Marigold Hotel Muriel Donnelly 2012 Quartet Jean Horton post-production ===Theatre roles=== * Twelfth Night, Oxford Playhouse, 1952 * He Who Gets Slapped, Clarendon Press Institute, 1952 * Cinderella, Oxford Playhouse, 1952 * Rookery Nook, Oxford Playhouse, 1953 * The Housemaster, Oxford Playhouse, 1953 * Cakes and Ale (revue), Edinburgh Festival, 1953 * The Love of Four Colonels, Oxford Playhouse, 1953 * The Ortolan, Maxton Hall, 1954 * Don’t Listen Ladies, Oxford Playhouse, 1954 * The Government Inspector, Oxford Playhouse, 1954 * The Letter, Oxford Playhouse, 1954 * A Man About The House, Oxford Playhouse, 1954 * On the Mile (revue), Edinburgh Festival, 1954 * Oxford Accents, New Watergate Theatre, London, 1954 * Theatre 1900, Oxford Playhouse, 1954 * Listen to the Wind, Oxford Playhouse, 1954 * The Magistrate, Oxford Playhouse, 1955 * The School For Scandal, Oxford Playhouse, 1955 * New Faces (revue), Ethel Barrymore Theatre, New York, 1956 * Share My Lettuce (revue), Lyric Hammersmith and Comedy Theatre, 1957 * The Stepmother, St. Martin's Theatre, 1958 * The Double Dealer, Old Vic, 1959 * As You Like It, Old Vic, 1959 * Richard II, Old Vic, 1959 * The Merry Wives of Windsor, Old Vic, 1959 * What Every Woman Knows, Old Vic, 1960 * Rhinoceros, Strand Theatre, 1960 * Strip the Willow, UK Tour, 1960 * The Rehearsal, Bristol Old Vic and Globe Theatre, 1961 * The Private Ear and The Public Eye, Globe Theatre, 1962 * Mary, Mary, Queen's Theatre, 1963 * The Recruiting Officer, National Theatre/Old Vic, 1963 * Othello, National Theatre/Old Vic, 1964 * The Master Builder, National Theatre/Old Vic, 1964 * Hay Fever, National Theatre/Old Vic, 1964 * Much Ado About Nothing, National Theatre/Old Vic, 1965 * Trelawney of the Wells, National Theatre/Old Vic, 1965 * Miss Julie, National Theatre/Old Vic, 1966 * Black Comedy, National Theatre/Old Vic, 1966 * A Bond Honoured, National Theatre/Old Vic, 1966 * The Country Wife, Chichester Festival Theatre, 1969 * The Beaux Stratagem, National Theatre/Old Vic and Ahmanson Theatre, Los Angeles, 1970 * Hedda Gabler, National Theatre/Cambridge Theatre, 1970 * Design For Living, Ahmanson Theatre, Los Angeles, 1971 * Private Lives, Queen's Theatre, 1972 * Peter Pan, London Coliseum, 1973 * Snap, Vaudeville Theatre, 1974 * Private Lives, US tour and 46th Street Theatre, New York, 1975 [Tony nomination] * The Way of the World, Stratford, Canada, 1976 * Antony and Cleopatra, Stratford, Canada, 1976 * Three Sisters, Stratford, Canada, 1976 * The Guardsman, Stratford, Canada and Ahmanson Theatre, Los Angeles, 1976 * A Midsummer Night's Dream, Stratford, Canada and Ahmanson Theatre, Los Angeles, 1977 * Richard III, Stratford, Canada, 1977 * As You Like It, Stratford, Canada, 1977 * Hay Fever, Stratford, Canada, 1977 * Macbeth, Stratford, Canada, 1978 * Private Lives, Stratford, Canada, 1978 * Night and Day, Phoenix Theatre, Washington D.C. and ANTA Playhouse, New York, 1979 [Tony nomination] * Much Ado About Nothing, Stratford, Canada, 1980 * The Seagull, Stratford, Canada, 1980 * Virginia, Stratford, Canada, 1980 and Theatre Royal Haymarket, 1981 * The Way of the World, Chichester Festival Theatre and Theatre Royal Haymarket, 1984 * The Interpreters, Queen's Theatre, 1985 * The Infernal Machine, Lyric Hammersmith, 1986 * Coming Into Land, National Theatre/Lyttelton, 1987 * Lettice and Lovage, Globe Theatre, 1987 * Lettice and Lovage, Ethel Barrymore Theatre, New York, 1990 [Tony win] * The Importance of Being Earnest, Aldwych Theatre, 1993 * Three Tall Women, Wyndham's Theatre, 1994 and 1995 * Talking Heads, Chichester Festival Theatre and Comedy Theatre, 1996 * A Delicate Balance, Theatre Royal Haymarket, 1997 * The Lady in the Van, Queen's Theatre, 1999 * The Breath of Life, Theatre Royal Haymarket, 2002 * Talking Heads, Australian tour, 2004 * The Lady From Dubuque, Theatre Royal Haymarket, 2007 ==References== == Other websites == * Category:1934 births Category:2024 deaths Category:British Academy Award winning actors Category:Actors from Essex Category:Actors from Oxford Category:BAFTA Award winning actors Category:Emmy Award winning actors Category:English movie actors Category:English stage actors Category:English television actors Category:Golden Globe Award winning actors Category:Knights and Dames Commander of the Order of the British Empire Category:Laurence Olivier Award winners Category:People from Ilford Category:Tony Award winning actors",
 "title": "Maggie Smith"
}