{
 "id": "723000",
 "text": "Burlingame is a city in Osage County, Kansas, United States. In 2020, 971 people lived there. ==History== Burlingame was originally created as Council City and was an stop on the Santa Fe Trail. The Council City post office was opened on April 30, 1855.\"Kansas Post Offices Database\", The Kansas Historical Society The city and post office name was changed from Council City to Burlingame on January 30, 1858. It was named after Anson Burlingame. During the American Civil War the townspeople built a stone fort in the middle of the town. Burlingame's Fort was torn down after the war. ==Geography== Burlingame is on U.S. Route 56, about south of Topeka. The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== Burlingame has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Burlingame has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Burlingame, Kansas ==People== Burlingame is part of the Topeka, Kansas Metropolitan Statistical Area. ===2020 census=== The 2020 census says that there were 971 people, 437 households, and 259 families living in Burlingame. Of the households, 63.6% owned their home and 36.4% rented their home. The median age was 41.0 years. Of the people, 93.9% were White, 0.4% were Native American, 0.2% were Asian, 0.4% were from some other race, and 5.0% were two or more races. Hispanic or Latino of any race were 3.3% of the people. ===2010 census=== The 2010 census says that there were 934 people, 404 households, and 250 families living in Burlingame. ==Famous people== * Maurice Mehl (1887-1966), paleontologist, was born in Burlingame, Kansas * Victor Murdock (1871-1945), U.S. Representative from Kansas, Progressive Party presidential nominee, 1916. * Carla Provost (b. 1970), chief of the Border Patrol * Kenny Starr (b. 1952), Country and Western singer * Earl Sutherland, Jr. (1915–1974), winner of the 1971 Nobel Prize in physiology and medicine. * Ron Thornburgh (b. 1962), former Kansas Secretary of State (1994-2010). * Muriel Window (1892-1965), vaudeville star, Ziegfeld girl, pilot, businesswoman, born in Burlingame ==References== ==Other websites== ;City * City of Burlingame * Burlingame - Directory of Public Officials ;Schools * USD 454, local school district ;Newspaper * The Osage County Herald-Chronicle ;Historical * Early Burlingame History ;Maps * Burlingame City Map , KDOT Category:Cities in Osage County, Kansas Category:1855 establishments in Kansas Territory",
 "title": "Burlingame, Kansas"
}