{
 "id": "723004",
 "text": "Bazine is a city in Ness County, Kansas, United States. In 2020, 282 people lived there. ==History== Bazine was a station and shipping point on the Atchison, Topeka and Santa Fe Railway. The community was named after the French general François Achille Bazaine. The first post office in Bazine was created in 1874. ==Geography== Bazine is at (38.446126, -99.693006). The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== Bazine has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Bazine has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Bazine, Kansas ==People== ===2020 census=== The 2020 census says that there were 282 people, 116 households, and 85 families living in Bazine. Of the households, 85.3% owned their home and 14.7% rented their home. The median age was 39.2 years. Of the people, 66.0% were White, 0.1% were Native American, 0.1% were Pacific Islanders, 19.9% were from some other race, and 13.5% were two or more races. Hispanic or Latino of any race were 29.4% of the people. ===2010 census=== The 2010 census says that there were 334 people, 135 households, and 92 families living in Bazine. ==Education== Western Plains USD 106 serves Arnold, Bazine, Brownell, Ransom and Utica. The Western Plains High School mascot is Bobcats. Bazine High School was closed because of school unification. The Bazine High School mascot was the Indians.\"Western Kansas Basketball Results\", Great Bend Tribune, 13 December 1967, p.5. In 2004, Bazine High School was posted on eBay. The 78-year-old building was bought by a California businessman for $55,000. ==References== ==Other websites== ;City * City of Bazine * Bazine - Directory of Public Officials ;Schools * USD 106, local school district ;Photos * Photos of Bazine ;Maps * Bazine City Map , KDOT Category:Cities in Ness County, Kansas",
 "title": "Bazine, Kansas"
}