{
 "id": "723166",
 "text": "Blue Rapids is a city in Marshall County, Kansas, United States. In 2020, 928 people lived there. ==History== The first try to create a town below the junction of the rivers was in 1857. It failed. No tried to make a city until 1869–1870. A group of about 50 families from Genesee County, New York came. They bought land and water power rights, and they started building a community. The Blue Rapids Town Company was created. By 1870, 250 people lived there. In 1872, Blue Rapids was incorporated. In 1870, a stone dam and an iron bridge was built on the Big Blue River. A hydroelectric power plant was added. It would provide power for manufacturing and for the town. The power plant was destroyed by a flood in 1903. In the late 19th century and early 20th century there were four gypsum mines in the area. Around 1910, more than 1,750 people lived in Blue Rapids. The public library was built in 1875. It is the oldest library west of the Mississippi that is still being used in the same building. Blue Rapids was where the pancreatic cancer drug Streptozotocin was created. The bacterium from which the drug is taken was found in the late 1950s. It was found in a soil sample taken from \"an uncultivated sandy soil in a grassland region\" at Blue Rapids. Blue Rapids says it is the smallest town in the U.S. to have hosted a national league baseball game. On October 24, 1913, more than 3,000 people watched the Chicago White Sox and New York Giants play a world tour exhibition game on the local ball field. that is still in use today. In 2001, Blue Rapids became the place of a new NOAA Weather Radio transmitter, KZZ67. It would provide weather and emergency information from the National Weather Service in Topeka, Kansas to people living in north-central and northeast Kansas. ==Geography== Blue Rapids is in northeast Kansas. It is near the junction of the Little Blue and Big Blue rivers, at . Its elevation is above sea level. It is on highway US-77/K-9. Blue Rapids is east of Waterville, south of the county seat Marysville, west of Frankfort, and north of Manhattan. The United States Census Bureau says that the city has a total area of . Of that, is land and is water. Georgia-Pacific has a gypsum mine near Blue Rapids containing some of the purest gypsum in the world. ==People== ===2020 census=== The 2020 census says that there were 928 people, 376 households, and 243 families living in Blue Rapids. Of the households, 80.6% owned their home and 19.4% rented their home. The median age was 43.6 years. Of the people, 95.4% were White, 0.2% were Native American, 1.1% were from some other race, and 3.3% were two or more races. Hispanic or Latino of any race were 1.6% of the people. ===2010 census=== The 2010 census says that there were 1,019 people, 415 households, and 263 families living in Blue Rapids. ==Education== Blue Rapids is a part of USD 498 Valley Heights. Valley Heights Jr/Sr High School is halfway between the towns of Blue Rapids and Waterville. The Valley Heights mascot is Mustangs. ==References== ==Other websites== ;City * City of Blue Rapids * Blue Rapids – Directory of Public Officials ;Schools * USD 498, local school district ;History * History and images ;Maps * Blue Rapids City Map, KDOT Category:Cities in Marshall County, Kansas Category:1869 establishments in Kansas",
 "title": "Blue Rapids, Kansas"
}