{
 "id": "723168",
 "text": "Burns is a city in Marion County, Kansas, United States. The city was named after a nearby train station, which was named before the city was incorporated. In 2020, 234 people lived there. ==History== In 1877, the Florence, El Dorado, and Walnut Valley Railroad Company built a branch line from Florence to El Dorado, and a station called Burns was built north of the present city location. In 1881, the rail line was extended to Douglass, then later to Arkansas City.Marion County Kansas : Past and Present; Sondra Van Meter; MB Publishing House; LCCN 72-92041; 344 pages; 1972.1935 Rand McNally Standard Map of Kansas The line was leased and operated by the Atchison, Topeka and Santa Fe Railway. The line from Florence through Burns to El Dorado was abandoned in 1942.Railway Abandonment 1942 The original branch line connected Florence through El Dorado to Arkansas City. At the current place, a city named St. Francis was platted in August 1880. When the town incorporated, they found the official city name of St. Francis was already used, so they changed the name to be the same as the nearby Burns train station. The station was moved into Burns. The original station was named after a railroad company official. A post office in burns was created on November 30, 1880. ===21st century=== In 2010, the Keystone-Cushing Pipeline (Phase II) was built 6.5 miles west of Burns, north to south through Marion County. There was a lot of controversy over road damage, tax exemption, and environmental concerns (if a leak ever occurs).Keystone Pipeline - Marion County Commission calls out Legislative Leadership on Pipeline Deal; April 18, 2010. Keystone Pipeline - TransCanada inspecting pipeline; December 10, 2010.Keystone Pipeline - County ask TransCanada for pipeline emergency plan; Hillsboro Free Press; February 15, 2011. A pumping station named Burns was built 2 miles north of Potwin. ==Geography== Burns is at (38.090692, -96.887103), in the Flint Hills. The United States Census Bureau says that the city has a total area of . All of it is land. The south city border of Burns is the county line of Marion County and Butler County. ===Weather=== Burns has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Burns has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Burns, Kansas ==People== ===2020 census=== The 2020 census says that there were 234 people, 83 households, and 56 families living in Burns. Of the households, 80.7% owned their home and 19.3% rented their home. The median age was 33.3 years. Of the people, 96.6% were White and 3.4% were two or more races. Hispanic or Latino of any race were 0.4% of the people. ===2010 census=== The 2010 census says that there were 228 people, 93 households, and 59 families living in Burns. ===Education=== Burns is a part of Peabody-Burns USD 398 public school district.USD 398 Kansas School District Boundary Map ==In popular culture== * Mars Attacks!, 1996 comedy science fiction movie, the Perkinsville scenes from this movie was filmed around Burns. The beginning cattle segment was filmed near Leon, and the retirement community where Grandma Norris lived was filmed in northeast Wichita.Mars Attacks - Film Locations 1.Mars Attacks - Film Locations 2.20 years since \"Mars Attack\"ed Burns; Hillsboro Star-Journal; October 20, 2016. ==References== ==Other websites== ;City * * Burns - Directory of Public Officials, League of Kansas Municipalities ;Schools * USD 398, school district for Peabody, Burns, Wonsevu, nearby rural areas of Marion / Chase / Harvey / Butler Counties * USD 398 School District Boundary Map, KDOT ;Historical * Historic Images of Burns, Special Photo Collections at Wichita State University Library. * 1901 Keystone Ranch history * The Burns Citizen newspaper, Tidbits from 1926 to 1933 * PRIDE Roosters, Community Center, International Student Hosting, Huck Boyd National Institute for Rural Development * Marion County cemetery list, archive of KsGenWeb * Marion County history bibliography, Marion County school bibliography, Kansas Historical Society ;Maps * Burns City Map , KDOT * Topo Map of Burns area, USGS * Marion County Maps: Current , Historic , KDOT Category:Cities in Marion County, Kansas Category:1880 establishments in the United States Category:1880s establishments in Kansas",
 "title": "Burns, Kansas"
}