{
 "id": "723243",
 "text": "Tanja Magdalena Schuster is a taxonomist from Kaindorf, Austriahttps://prod.wp.cdn.aws.wfu.edu/sites/59/2017/04/2011.commencement.pdf and the first Pauline Ladiges Plant Systematics Fellow, holding a joint position with the School of Biosciences, University of Melbourne, Victoria, Australia, and the National Herbarium of Victoria, Royal Botanic Gardens Melbourne. Schuster also worked as curator of the Norton-Brown Herbarium at the University of Maryland, College Park. In 2011, Schuster created the genus Duma for some species previously placed in Muehlenbeckia, but which were shown by molecular phylogenetic studies to form a distinct clade. The name is derived from the Latin for \"thorn-bush.\" ==Selected works== * Sanchez, A., Schuster, T.M. and Kron, K.A. (2009). A large scale phylogeny of Polygonaceae and its implications for taxonomic circumscriptions. International Journal of Plant Sciences 170, 1044-1055. * Sanchez, A., Schuster, T.M., Burke, J. and Kron, K.A. (2011). Taxonomy of Polygonoideae (Polygonaceae): A new tribal classification. Taxon 60, 151-160. * Schuster, T.M., Reveal, J.L. and Kron, K.A. (2011). Phylogeny of Polygoneae (Polygonaceae: Polygonoideae). Taxon 60, 1653-1666. * Schuster, T.M., Wilson, K.L. and Kron, K.A. (2011). Phylogenetic relationships of Muehlenbeckia, Fallopia and Reynoutria investigated with chloroplast and nuclear data. International Journal of Plant Sciences 172, 1053-1066. * Schuster, T.M., Setaro, S.D. and Kron, K.A. (2013). Age estimates for the buckwheat family Polygonaceae based on sequence data calibrated by fossils and with a focus on the amphi-Pacific Muehlenbeckia. PLoS ONE. 10.1371/journal.pone.0061261. ==Taxa authored by Schuster== Schuster is listed in the International Plant Names Index as the author or co-author of 62 names, including: * Duma T.M.Schust. *Koenigia alaskana T.M.Schust. & Reveal (syn. Polygonum alpinum) *Koenigia alpina T.M.Schust. & Reveal (syn. Aconogonon alpina) *Koenigia campanulata (Hook.f.) T.M.Schust. & Reveal (syn. Persicaria campanulata) *Koenigia davisiae T.M.Schust. & Reveal == References == ==Other websites== *Tanja Schuster at the Plant Systematics Research Group Category:Living people Category:Austrian botanists",
 "title": "Tanja M. Schuster"
}