{
 "id": "723379",
 "text": "Kiowa is a city in Barber County, Kansas, United States. In 2020, 902 people lived there. ==History== ===19th century=== Kiowa was created in 1872. It was named after the Kiowa people. ===20th century=== On June 7, 1900, anti-saloon advocate Carrie Nation vandalized her first saloon in Kiowa. In 1905, the Denver, Enid and Gulf Railroad was built from Enid, Oklahoma to Kiowa. In 1907, it was sold to the Atchison, Topeka and Santa Fe Railway. In 1996, the railroad from Kiowa to Blanton, Oklahoma was abandoned. ==Geography== Kiowa is at (37.017405, -98.484819). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== The 2020 census says that there were 902 people, 404 households, and 230 families living in Kiowa. Of the households, 84.7% owned their home and 15.3% rented their home. The median age was 43.9 years. Of the people, 90.8% were White, 0.4% were Native American, 0.4% were Asian, 0.4% were Pacific Islanders, 1.9% were from some other race, and 6.0% were two or more races. Hispanic or Latino of any race were 3.3% of the people. ===2010 census=== The 2010 census says that there were 1,026 people, 466 households, and 273 families living in Kiowa. ==Education== Kiowa is a part of USD 255 South Barber. The Kiowa Chieftains won the Kansas State High School class B Track & Field championship in 1940. ==Media== The Kiowa News is the local newspaper. It is published once per week. ==Famous people== * Marcellus Boss, the 5th Civilian Governor of Guam; former Kiowa city attorney. * Charles E. Brown, Jr., Chief of Chaplains of the U.S. Army. * Bill Tidwell, Four-time NAIA middle distance champion at Kansas State Teachers College (ESU), later coached Oberlin University and Emporia State University where he was Athletic Director (1971-1979). ==References== ==Other websites== ;City * City website ;Schools * USD 255, local school district ;Historical * Kiowa, Barber County, Kansas Barber County, Kansas: History and Genealogy ;Maps * Kiowa City Map , KDOT Category:Cities in Barber County, Kansas Category:1872 establishments in Kansas",
 "title": "Kiowa, Kansas"
}