{
 "id": "723542",
 "text": "Derby Playhouse was a theatre production company based in Derby. It was also the former name of the theatre it owned and operated. The theatre opened in 1975. In 2008, the company ceased and the theatre closed. The Derby Playhouse company had a national reputation for its productions. It premiered new theatrical works and the regional premieres of others. In 2009, the theatre was reopened as the Derby Theatre. It is owned and operated by the University of Derby. ==Early history== In 1948, the original Playhouse opened as the Little Theatre in a converted church hall on Becket Street.Derby Telegraph (1 April 2013).\"Heckling from the amateurs in early days of forerunner to Playhouse\" Retrieved 4 April 2013. In 1952, the company moved to a venue in Sacheverel Street. In 1956, it survived a major fire.Derby Telegraph (5 November 2009). \"107 years young, Reg still on song thanks to faith, laughter and gin!\". Retrieved 10 January 2013. In the 1960s and early 1970s the British government invested in the Arts Council of Great Britain's \"Housing the Arts\" fund. The fund enabled cities to renovate existing theatres and commission new ones. In response, the company formed the New Theatre Trust to fund its own purpose-built theatre. Roderick Ham was commissioned to design the new theatre. Derby City Council offered the land. This was part of the new Eagle Centre shopping development.Picturethepast.org.uk and Derby Telegraph. \"Derby Playhouse entrance\". Retrieved 14 January 2013. The new Derby Playhouse was opened on 20 September 1975 by the 11th Duke of Devonshire. It had a seating capacity of 535.BBC News. (20 September 2005). \"Replacement for Playhouse urged\". Retrieved 10 January 2013. ==Disestablishment== In 2002, the company had money problems. It had a debt of £400,000, the biggest in its history, and it nearly closed. By 2004 it had recovered and was breaking box-office records.Orme, Steve (2004). \"Karen Hebden – Rescuing Derby\" . British Theatre Guide. Retrieved 10 January 2013. In 2007, the company again ran into serious money problems. The Board of Trustees of the theatre asked Derby City Council to advance £40,000 from their 2008 grant. It was refused. On 29 November, the Board of Trustees of the theatre announced that it was going into voluntary liquidation and that performances would immediately stop.Martin, Francesca (5 December 2007). \"Derby Playhouse closes its doors after council refuses pleas for emergency funds\". The Guardian. Retrieved 10 January 2013. Nevertheless, the cast and crew of Treasure Island put on that evening's performance.Atkins, Tom (30 November 2007). \"Board Shuts Derby Playhouse, Cancels Xmas Show\" . Whatsonstage. Retrieved 10 January 2013. After the curtain call, the cast were joined on stage by the staff, the theatre's chief executive and director of the show (Karen Hebden), and two former chairmen of the Playhouse board (Michael Hall, and Jonathan Powers). They addressed the audience and press and asked them to fight for the city's theatre and get the Playhouse open again.Ashworth, Pat (3 December 2007). \"Dark times for Derby Playhouse as board closes theatre\". The Stage. Retrieved 10 January 2013. The following day, the Board of Trustees announced that the company had been put into administration.Derby Telegraph (13 September 2008). \"Abridged Version Of Playhouse Drama\" . Retrieved 10 January 2013. The administrators allowed the Playhouse to reopen on 7 December 2007 to finish its run of Treasure Island.Orme, Steve (December 2007). \"Review: Treasure Island, Robert Louis Stevenson, adapted by Karen Louise Hebden, Derby Playhouse. British Theatre Guide. Retrieved 10 January 2013. The theatre was being operated by a skeleton of essential staff, initially working unpaid. A fund was set up to accept donations to keep the Playhouse going. It was now operating as a charitable trust and relied on ticket sales and donations alone. Tickets for a Spring/Summer 2008 season had already been on sale before the closure. They were put back on sale while an appeal was made to the Arts Council. The Arts Council refused the appeal in January 2008. The theatre closed after the last performance of Treasure Island on 2 February 2008. On 30 July 2008, the creditors voted to accept a rescue package put together by the company's new board of trustees.Derby Telegraph (30 July 2008). Playhouse-board-given-ahead- reopen-theatre \"Playhouse board given go-ahead to reopen theatre\". Retrieved 10 January 2013. The theatre reopened on 13 September 2008 with The Killing of Sister George. This ran until 18 October.Derby Telegraph (15 September 2008). \"Playhouse reopening proves it can thrive with fans' support\". Retrieved 10 January 2013. It was the company's last production. The theatre was then sold to the University of Derby. It reopened in October 2009 as the Derby Theatre.Derby Telegraph (8 October 2009). \"Theatre stages a remarkable comeback\" . Retrieved 10 January 2013. ==Productions== The new Derby Playhouse opened with My Fair Lady. The first season also included Hamlet and Alan Bates in The Seagull. Mark Woolgar was Resident Director for the first five seasons. Plays by Shakespeare, Shaw, Ibsen, Ayckbourn, Orton and Coward were put on. ===1980s=== In 1980, Christopher Honer joined the Playhouse as Artistic Director. Over the next seven years, the Playhouse's productions included All My Sons with Miranda Richardson, Piaf with Caroline Quentin, The Resistible Rise of Arturo Ui starring Ben Roberts. New plays included Rony Robinson's The Brewery Beano and Don Shaw's The Conspirator.Derby Telegraph (5 April 2011). \"Author's free play offer to help theatre\" . Retrieved 13 January 2013. Box office successes included Funny Peculiar, Having A Ball! and Blood Brothers. During this time, the Derby Playhouse Studio, under the direction of John North, David Milne and Claire Grove, provided a year-round programme of productions. They also put on community tours and a Theatre in Education programme.Derby Telegraph (2 November 2007). \"Studio Demise Is Bemoaned\". . In 1987, Annie Castledine became Artistic Director. During the next three years, the Playhouse saw a completely different style of theatre.Gardner, Lyn (4 April 2001). \"The power behind the scenes\". The Guardian. Retrieved 13 January 2013. Plays included The Innocent Mistress, The Children's Hour and The Dark at the Top of the Stairs and classic plays such as A Doll's House and Jane Eyre. Other plays included Arsenic and Old Lace, Gaslight and Noises Off alongside new work such as Sunday's Children, The Queen of Spades, Selling the Sizzle and Self Portrait. There was a series of co-productions with the companies Shared Experience, Paines Plough and Temba. During this period, the theatre's productions became known for the strength of their on-stage visual imagery. The Playhouse was shortlisted for the Prudential Awards.Giannachi, Gabriella and Luckhurst, Mary (1999). On Directing: Interviews with Directors, p. 7. Palgrave Macmillan. ===1990s=== In the summer of 1990, Derbyshire County Council cut their entire arts budget. This took £130,000 of revenue grant from the Playhouse.Morrison. James (2011). Essential Public Affairs for Journalists, p. 572. Oxford University Press. The City Council offered the theatre a small grant. This enabled the Playhouse to continue to operate. According to Lyn Gardner writing in The Guardian, \"it was Castledine's head that was demanded by the council as the price of underwriting the theatre's deficit.\" Castledine left the Playhouse. From the summer of 1990 to Christmas 1991, Executive Director, David Edwards, was in charge of the programme. This ended with the Playhouse's production of Hobson's Choice. This won the Theatrical Management Association's Regional Theatre Award for Best Overall Production.Theatrical Management Association. Previous Awards . Retrieved 11 January 2013. In spring 1991, Mark Clements was appointed Artistic Director. His first season opened with a production of And A Nightingale Sang. The production of John Godber's On The Piste, was repeated later in the year, and again in 2001. Godber's work remained a popular part of the programme while Clements' was in charge.Derby Telegraph (27 January 2010). \"Our favourite playwright returns to the city stage\". Retrieved 13 January 2013. During the Clements period the programme included a variety of work, ranging from classics such as Death of a Salesman, Aphra Behn's Lucky Chance and Shakespeare's Richard III, to contemporary drama such as Our Boys, The Rise and Fall of Little Voice and Children of a Lesser God, and newly commissioned work such as Tess of the d'Urbervilles, Passion Killers and Blood Money.Milwaukee Repertory Theater. \"Mark Clements\" . Retrieved 13 January 2013. Musicals became an important part of the programme, including Grease, Little Shop of Horrors, Cabaret and Assassins. The pantomimes written by Mark Clements and Michael Vivian drew in record numbers at Christmas time.Powlson, Nigel (7 February 2012). \"Panto favourite Pete is loving life back on the theatre stage\". Derby Telegraph Retrieved 13 January 2013. ===2000s=== In 2002, Mark Clements and David Edwards left the company. Karen Hebden was appointed as chief executive and Stephen Edwards as Creative Producer. Over the following years the Playhouse gained a national reputation for its productions.Orme, Steve (September 2002). British Theatre Guide \"Review: Arsenic and Old Lace, Derby Playhouse\". British Theatre Guide. Retrieved 11 January 2013. There were in-house productions of Sweeney Todd, Into the Woods, Company and Merrily We Roll Along.Gardner, Lyn (7 December 2007). \"Derby Playhouse's last leg\". Retrieved 14 January 2013. Three of these productions featured Glenn Carter. One of these was a new music drama, Moon Landing, in which he played Buzz Aldrin. It was written, composed and directed by Stephen Edwards. Moon Landing was nominated in the Best Musical Production category of the 2008 TMA Awards.Theatrical Management Association. TMA Theatre Awards Winners & Nominees 2008 . Retrieved 11 January 2013. An original cast recording of the final performance was made. The company's last production before its permanent closure was The Killing of Sister George starring Jenny Eclair and directed by Cal McCrystal. Its run ended on 18 October 2008. The rest of the 2008 autumn season, including the Christmas production of Peter Pan, was cancelled.Orme, Steve (30 November 2008). \"Derby Playhouse: Future Settled in Two Weeks?\" . British Theatre Guide. Retrieved 11 January 2013. ==References== ==Other websitess== *Derby Playhouse official website (no longer updated) *Past versions of the official website dating back to 2001 archived on the Wayback Machine. Category:Derby Category:Defunct companies of the United Kingdom",
 "title": "Derby Playhouse"
}