{
 "id": "723515",
 "text": "Cambridge is a city in Cowley County, Kansas, United States. In 2020, 92 people lived there. ==History== When the Kansas City, Lawrence & Southern Railroad was built a mile south of Lazette, a new place was created by Benjamin H. Clover on May 3, 1880. Cambridge was named after Cambridge University, in England.http://www.ausbcomp.com/~bbott/wortman/archive2005/CloverBH.htm The first post office in Cambridge was created on January 30, 1880. On December 15, 1880 the Atchison Topeka & Santa Fe Railway got nearly all the stock of the Kansas City, Lawrence & Southern Railroad. They operated the railroad as the Southern Kansas Railroad. Cambridge was a station and shipping point on the Atchison, Topeka and Santa Fe Railway. Cambridge Public Emergency Radio Tower is one of two former emergency transmission facilities built during the Cold War. ==Geography== Cambridge is at (37.317776, -96.667166). The United States Census Bureau says that the city has a total area of . All of it is land. Cambridge is on US Route 160 at State Highway 7. Cambridge is 45 miles southeast of Wichita. ===Weather=== Cambridge has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Cambridge has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.Climate Summary for Cambridge, Kansas ==People== ===2020 census=== The 2020 census says that there were 92 people, 43 households, and 34 families living in Cambridge. Of the households, 86.0% owned their home and 14.0% rented their home. The median age was 42.0 years. Of the people, 84.8% were White, 5.4% were Native American, 1.1% were from some other race, and 8.7% were two or more races. Hispanic or Latino of any race were 2.2% of the people. ===2010 census=== The 2010 census says that there were 82 people, 39 households, and 28 families living in Cambridge. ==Education== Cambridge is a part of USD 462 Central of Burden. The Burden High School mascot is Burden Raiders. ==References== ==Other websites== ;City * ;Schools * USD 462, local school district ;Maps * Cambridge City Map , KDOT Category:Cities in Cowley County, Kansas",
 "title": "Cambridge, Kansas"
}