{
 "id": "723723",
 "text": "The Hong Kong Polytechnic University (PolyU) is a public research university in Hung Hom, Hong Kong. The history of PolyU goes back to 1937. It became a full university in 1994. PolyU has 8 faculties and schools. There are programs in applied science, business, construction, environment, engineering, social science, health, humanities, design, hotel and tourism management. The university teaches 220 postgraduate, undergraduate and sub-degree programmes for more than 32,000 students every year. As of 2019, THE ranks the university 19th in Asia. QS ranks it 8th in young universities and 91st internationally. ==History== === Origins and establishment === The Government Trade School started in 1937 at Wood Road, Wan Chai. The school was the first public post- secondary technical institution in Hong Kong. After World War II, the school became the Hong Kong Technical College. It opened a new campus in Hung Hom in 1957. In 1972, the Government Trade School became the Hong Kong Polytechnic was formally established. Its goal is to educate qualified workers. It gained full university status and changing its name to The Hong Kong Polytechnic University in 1994. === 2019 police siege === In November 2019, protesters occupied the university as part of the 2019 Hong Kong protests. Students fought with the Hong Kong Police Force from 17 November to 19 November. On November 16th, police tried to enter the campus, but protesters kept them out with road blocks and petrol bombs. The police then blocked all exits from the university campus and asked all protesters inside to give up and come out. On November 18, the police shot 1,491 canisters of tear gas at protesters and shot 1,981 rubber bullets, bean bags, and sponge grenades. The university has been called a battleground. The university was later closed off by police, but protesters still escaped. More than 280 protesters were injured and more than 1,000 people were arrested. ==Campus== === Main campus === PolyU's main campus is in Yau Tsim Mong District. It has mare than 20 buildings. Many buildings connect to each other. The campus has student hostels, a multi-purpose auditorium, sports, recreational and catering facilities, and a bookstore and banks. The Jockey Club Auditorium opened in 2000. Its balcony and main floor seats up to 1,084 people. PolyU has many sports facilities, including: a swimming pool, 2 indoor sports grounds, a outdoor sports ground with basketball and soccer fields and jogging track, 2 outdoor tennis courts, and a joint-sports center. ==== Innovation Tower ==== The Jockey Club Innovation Tower is at the northeastern side of the university campus. This 15-story building has 15,000 square meters of floor area. It is for design education. The tower has exhibition areas, multi-functional classrooms and lecture halls, design studios and workshops, and a lounge. Zaha Hadid designed the tower. ====Pao Yue-kong Library==== The library started on 1 August 1972. There were two centers atHung Hom and Quarry Bay until 1976. They moved together into one building in 1976. The library was named after shipping entrepreneur and philanthropist Yue-Kong Pao in 1995. In 2014, there were over 2.77 million of library holdings in total, with nearly 600,000 electronic resources. The six- storey library provides 3,900 study spaces and is equipped with a 24-hour study centre and audio-visual information areas. === Hotel Icon === Hotel Icon opened in September 2011. The hotel is owned by the university as a teaching and research hotel of the School of Hotel and Tourism Management. ===Community college=== PolyU started the Hong Kong Community College (HKCC) in 2001. It is a offers associate degree and higher diploma programs in arts, science, social sciences, business, health care, and design. HKCC classes are at the Hung Hom Bay and West Kowloon campuses. == Academics == ===Faculties and schools=== The University has 8 faculties and schools. Students may study in more than 220 postgraduate, undergraduate and sub-degree programs. Service learning subjects are offered by 20 departments from all faculties and schools. They do many kinds of community service projects. Faculty of Applied Science and Textiles Faculty of Business, The Hong Kong Polytechnic University|Faculty of Business Faculty of Construction and Environment *Department of Applied Biology and Chemical Technology *Department of Applied Mathematics *Department of Applied Physics *Institute of Textiles and Clothing *School of Accounting and Finance *Department of Logistics and Maritime Studies *Department of Management and Marketing *Department of Building and Real Estate *Department of Building Services Engineering *Department of Civil and Environmental Engineering *Department of Land Surveying and Geo-Informatics Faculty of Engineering Faculty of Health and Social Sciences Faculty of Humanities *Department of Biomedical Engineering *Department of Computing *Department of Electrical Engineering *Department of Electronic and Information Engineering *Department of Industrial and Systems Engineering *Department of Mechanical Engineering *Interdisciplinary Division of Aeronautical and Aviation Engineering *Department of Applied Social Sciences *Department of Health Technology and Informatics *Department of Rehabilitation Sciences *School of Nursing *School of Optometry *Department of Chinese and Bilingual Studies *Department of Chinese Culture *Department of English *Chinese Language Centre *Confucius Institute of Hong Kong *English Language Centre *General Education Centre School of Design School of Hotel and Tourism Management College of Professional and Continuing Education (CPCE) *Hong Kong Community College (HKCC) *School of Professional Education and Executive Development (SPEED) ===Research=== There are several research centers at PolyUhttp://www.polyu.edu.hk/web/sc/research/research_institutes_research_centres/index.html HKPU Research Website Each faculty or school has its own centers. Institutes for public policy research and sustainable urban development are run by the Areas of Excellence Committee. PolyU started the Aviation Services Research Centre with Boeing. PolyU also has The Hong Kong Research Institute of Textiles and Apparel. ===Important projects=== Important PolyU research projects include: *Safety monitoring of high speed rail *Eco-blocks (a construction material made from recycled glass and demolition waste) *Electric vehicles *Electronic “bat ears” for people with vision problems *Nano- particles for purifying dirty water *Organic photovoltaics and LEDs *Tools and instruments used in space exploration ===Reputation and rankings=== World Rankings of PolyU * QS \"Top 50 Under 50\" list of world's top young universities (2016/17): 7th in the world, 3rd in Hong Kong * QS Asian University Rankings 2016/17: 6th in Asia, 5th in Hong Kong * QS World University Rankings 2018: 95th in the world, 5th in Hong Kong * Times Higher Education's World University Rankings 2017: 192nd in the world * Times Higher Education's 150 Under 50 World University Rankings 2016: 27th in the world * Times Higher Education's Asia University Rankings 2017: 17th in the Asia, 5th in Hong Kong World Rankings of Faculties, Schools and Disciplines Faculty of Applied Science and Textiles * 45th in the subject of statistics and operational research according to the QS World University Rankings by Subject 2014 Faculty of Business * 55th in the Top 100 World Rankings of Business Schools by University of Texas at Dallas, based on research contributions to 24 leading business journals from 2012 to 2016 * 1st in shipping research in the world, based on 2010 to 2012 data from Thomson Reuters' ISI Web of Science * 1st in PolyU Maritime School Research Rankings from 2010 to 2014. * 4th in the world in the area of port research, according to an analysis of port literature presented at the 2011 International Association of Maritime Economists conference in a paper entitled \"Port Research since 1980: An analysis of Authorship and Institutional Affiliation\". * 6th in the field of commerce, management, tourism and service of 2014-15 University Ranking by Academic Performance (URAP). * 11th in the world according to the Worldwide Business Research Rankings compiled by Korea University Business School (KUBS). * 42nd in the world for Finance and Economics research by a study published in the Journal of Financial Economics 93 (2009) 353, 356 * 40th in the world at the QS World University Rankings by Subject 2017 - Business & Management Studies sector Faculty of Construction and Environment * 4th in the quality and impact of research publications in the area of civil engineering, according to the National Taiwan University Ranking 2013 * 10th in the subject of civil and structural engineering, according to the QS World University Rankings by Subject 2017 Faculty of Engineering * 24th in the subject of computer science, according to the National Taiwan University Ranking 2013 * 39th in the subject of mechanical engineering, according to the National Taiwan University Ranking 2013 * 51st-100th in the subject of engineering – mechanical, aeronautical and manufacturing, according to the QS World University Rankings by Subject 2015 * 51st-100th in the subject of computer science and information systems, according to the QS World University Rankings by Subject 2015 Faculty of Humanities * 23rd in the subject of linguistics, according to the QS World University Rankings by Subject 2014 School of Nursing 35th in the QS World University Rankings by Subject 2018. School of Design * among top 3 design schools in Greater China, according to BusinessWeek (Oct 2009 issue) * among top 25 design schools in the world and is the only selected design school in Asia, according to Business Insider magazine (Dec 2012 issue) School of Hotel and Tourism Management * 2nd in research and scholarly activities among institutions specializing in hospitality and tourism, according to the World Ranking of Top 100 Hospitality and Tourism Programs by Journal of Hospitality & Tourism Research (Nov 2009 issue) * 3rd in the subject of Hospitality & Leisure Management, according to the QS World University Rankings by Subject 2017 ==Student life== === Student halls === There are two student halls of residence buildings provided by the university, in Hung Hom Bay and Ho Man Tin. The university also has off-campus housing in Sham Shui Po, Mong Kok, and Tsim She Tsui. === Student organization === The Hong Kong Polytechnic University Students’ Union (HKPUSU) is run by students. It is not controlled by the university administration. The HKPUSU helps full-time undergraduate students. === Sports teams === * Athletics * Badminton * Basketball * Fencing * Handball * Karate-do * Rowing * Rugby * Soccer * Squash * Swimming * Table Tennis * Taekwondo * Tennis * Volleyball * Woodball ==Controversy== The university's faculty-led Student Discipline Committee, with the support of the university council chairman Lam Tai-fai, expelled one student and suspended another for one year because the students posted on the \"Democracy Wall\" bulletin board in 2018. The students' union managed the bulletin board then. The students had posted messages remembering the fourth anniversary of the \"Umbrella Movement\" democracy protests of 2014. They also said Hong Kong should be independent from the People's Republic of China. Two more students were ordered to do community service as punishment. The students were not allowed to have help from lawyers. The committee saw video of the students shouting and knocking on doors. Some people said that the students had made negative comments, attacked a staff member, and damaged property. The students said they did not do any of those things. The students were all current or past leaders of school organizations. They are not allowed to appeal the decision Many pro-democracy groups protested the committee's decision. More than a dozen legislators and 19 student organisations protested. The Hong Kong Professional Teachers' Union described the punishments as too hard. That union has more than 90,000 members. ==Notable alumni== ===Academics=== * Kim Man Lui (2006, Ph.D. in Software Engineering) – Author, business, and professor at Hong Kong Polytechnic University ===Politicians and public organization=== * Leung Chun Ying (1974, Higher Diploma in Surveying) - Chief Executive of Hong Kong * Chan Kam Lam (1971) - member (Kowloon East) of the Legislative Council of Hong Kong SAR ===Design=== * Vivienne Tam - fashion designer * Wong Kar-wai - film director * Gigi Leung - singer, songwriter and actor * Raman Hui - animator * Paul Wong - composer, songwriter, singer and the lead guitarist of the band Beyond. * Alice Mak - artist and cartoonist, mother of cartoon characters McMug and McDull * Pinky Lai - designer of the original Porsche Boxster and Cayman ==References== == Other websites == * Category:1937 establishments in Asia Category:Colleges and universities in Hong Kong",
 "title": "Hong Kong Polytechnic University"
}