{
 "id": "724076",
 "text": "Ute Berling (born 1957 in Heidelberg, West Germany) is a German singer. == Life and career == Ute Berling was born in Heidelberg, West Germany. She appeared under a stage name. She created German-language songs, and German- language cover versions of songs in other languages. Berling appeared on the ARD television program Musikladen in 1978 and on the ZDF television program Disco in 1980 and on the ZDF-Hitparade in 1981. In 1981, with a German- language cover version of the song Bette Davis Eyes, Als ob sie Bette Davis wär, she ranked at number 21 in the German music charts for one week. == Singles == * 1976: Einmal mußt du dich entscheiden / Leben, das heißt lieben – M Records * 1977: Kasimir, der Elternschreck / Samstagabend in der Großstadt – M Records * 1978: My Baby Blue (German-language cover version of My Baby Blue from Michel Costa)Ute Berling on coverinfo.de / Ich will frei sein, ich will leben – M Music * 1979: Spiel’ dich nicht auf / Wenn du die Tür schließt – M Music * 1979: Okay, wir haben Spaß gehabt / Denn sie will nicht, daß du gehst – M Music * 1980: Amerika (German-language cover version of America from Gianna Nannini) / Spiel dich nicht auf – M Music * 1981: Als ob sie Bette Davis wär (German-language cover version of Bette Davis Eyes) / Der Himmel macht zu – M Music * 1982: Lady Rock’n’Roll / Kalter Morgen – M Music * 1983: Kinder im All / Computerspiele – Mercury * 1986: Alles, was ich will, bist du (German-language cover version of Saving All My Love for You from Marilyn McCoo and Billy Davis Jr.) / Himmel und Hölle – Coconut * 1986: Ich will mit dir geh’n (German-language cover version of Take My Breath Away from Berlin) / Herz an Herz – Coconut == References == Werner Zeppenfeld: Tonträger in der Bundesrepublik Deutschland: Anatomie e. medialen Massenmarkts, Brockmeyer, 1978 Ute Berling on chartsurfer.de == Other websites == * Ute Berling on www.was-wurde-aus.at * Ute Berling on Discogs Category:1957 births Category:Living people Category:German singers Category:People from Heidelberg",
 "title": "Ute Berling"
}