{
 "id": "724340",
 "text": "Dieter \"Maschine\" Birr (born 22 March 1944 in Köslin, Pommern) is a German singer, guitarist and composer. He was a longtime member of the rock band Puhdys, which dissolved in 2016. == Life and career == Dieter Birr was trained as a grinder and at the same time taught himself how to play the guitar. From 1966 to 1972 he studied dance music, music theory and guitar at Musikschule Friedrichshain in East Berlin. Until 1969 he was a member of the bands Telestars, Luniks (including Fritz Puppel), Jupiters and Evgeni-Kantschew- Quintett. In 1969, he became frontman of the Puhdys, which became the most commercially successful rock band in GDR history. Birr composed around 250 songs for the band.Maschine – Wenn ein Mensch lebt. Der Tagesspiegel. 18 March 2014. Retrieved 9 April 2014. He got his nickname \"Maschine\" after band member Peter Meyer described him as an \"eating machine\".Porträt auf der Website der Puhdys . Retrieved 9 April 2014. In 1974, Birr appeared in a supporting role in the DEFA film Elective Affinities. In 1986, Amiga released his first solo album, Intim, which was not commercially successful.Götz Hintze: Rocklexikon der DDR. 2. Auflage. Schwarzkopf & Schwarzkopf, Berlin 2000, , S. 235. In the meantime, he worked on lyrics for Dunja Rajter and the Wildecker Herzbuben, and others.Die Endlosband. pnn.de. 3 January 2009. Retrieved 5 October 2016. In his second solo album, Maschine, released in 2014, Julia Neigel, Wolfgang Niedecken and Toni Krahl also appeared as duet partners. The album contains some new additions to well-known Puhdys hits from the 1970s, including Geh zu ihr and Wenn ein Mensch lebt. Also in 2014, on his 70th birthday, Birr's autobiography Maschine – Die Biografie. was released. In 2016, the third solo album Neubeginner was released after the end of the Puhdys. In 2017, he sang together with Romano on the song Karl May, which appeared on his album Copyshop. In 2019, he appeared at Lieder auf Banz with Julia Neigel. == Personal life == Birr lives in Neuenhagen bei Berlin and has been married since 1979 in his second marriage. He has two children. His son Andy Birr is a vocalist, guitarist and drummer of the pop band Bell, Book & Candle. == Awards == * 1982: National Prize of the German Democratic Republic == Discography == * 1986: Intim (Amiga) * 2014: Maschine (Universal) * 2016: Neubeginner (Heart of Berlin) * 2018: Alle Winter wieder (Universal) == Autobiography == * Maschine – Die Biografie. Zusammen mit Wolfgang Martin. Neues Leben, Berlin 2014, . == Literature == * Rainer Bratfisch: Dieter Birr . In: Wer war wer in der DDR? 5. Ausgabe. Band 1, Ch. Links, Berlin 2010, . ==Other websites== * Offizielle Website * „Ich wüsste gar nicht, was ich sonst machen sollte“ – Dieter Birr im Interview mit Die Tageszeitung (taz) vom 4. Februar 2017, S. 46–47. == References == Category:Rock musicians Category:East German entertainers Category:German musicians Category:Living people Category:1944 births",
 "title": "Dieter Birr"
}