{
 "id": "724877",
 "text": "Patrick Cullen Pinney (born June 30, 1952) is an American singer and television, film and voice actor. ==Early life, family and education== Pinney was born in San Francisco County, California. His mother's maiden name is his middle name. He attended college at University of the Pacific in Stockton, California, where producer and director Dennis Jones was a classmate and roommate of his. Pinney's friends included assistant director Michele Panelli Venetis and San Francisco Bay area costumer Alison Barnwell Morris, with whom he costarred in The Deputy at the school's Rotunda Theatre. == Filmography == === Movies === Year Title Role Note(s) Source 1986 G.I. Joe: Arise, Serpentor, Arise! Mainframe Television film 1987 G.I. Joe: The Movie Mainframe Direct-to- video 1987 The Chipmunk Adventure Additional voices Credited as Pat Pinney 1988 Christmas in Tattertown Television film 1989 The Little Mermaid Sailor #2 1990 DuckTales the Movie: Treasure of the Lost Lamp Additional Voices 1991 Ghoulies III: Ghoulies Go to College Fish Ghoulie Direct-to-video 1991 Beauty and the Beast Walter 1991 An American Tail: Fievel Goes West One-Eye 1992 Aladdin Arab #2 1993 Look Who's Talking Now Dog Voices 1995 Toy Story Pizza Delivery Guy, Angry Driver #2 1996 The Hunchback of Notre Dame Quasimodo's Father, Guard 1997 Hercules Cyclops, Rock Titan's Left Head 1998 Mulan Fa Deng 1998 The Wacky Adventures of Ronald McDonald: Scared Silly Phantom Head Direct-to-video 1999 Tarzan Florentino 2001 Atlantis: The Lost Empire Smithsonian Board Member #2, Viking Captain 2002 Lilo & Stitch Firefighter 2002 Treasure Planet Aquanoggin 2003 Brother Bear Male Bear #1 2004 The Incredibles Oliver Sansweet === TV shows === Year Title Role Note(s) Source 1987 Fraggle Rock: the animated series Uncle Travelling Matt, Pa Gorg, Flange Doozer Main Role 1987–88 Mighty Mouse: The New Adventures Mighty Mouse Main role 1989 X-Men: Pryde of the X-Men Wolverine TV pilot 1997 Spider-Man The Thing / Ben Grimm 2 episodes 1999 The Wild Thornberrys MacWhirter, Radio Voice Ep. \"You Ain't Seen Nothing Yeti\" 1999–present SpongeBob SquarePants Painty the Pirate Performer: \"SpongeBob SquarePants Theme\" 2000 Johnny Bravo Bailiff, Defense Attorney, Juror #1 Ep. \"I Dream of Johnny/One Angry Bravo/Carnival of the Darned\" 2003 My Life as a Teenage Robot Dismal, Soggy, Rich Guy Ep. \"Attack of the 5 1/2 Ft. Geek/Doom with a View\" 2007–present Robot Chicken He-Man / Prince Adam, Arnold Schwarzenegger / Terminator, Sylvester, Monterey Jack, Stu Pickles, Ted Kennedy, Dick Cheney, O. J. Simpson, Various Voices 14 episodes 2018 Trolls: The Beat Goes On! Nangus Ep. \"Royal Review/Funishment\" == References == == Other websites == * * http://www.patpinney.com/ Category:1952 births Category:Living people Category:Actors from Los Angeles Category:American voice actors Category:American video game actors",
 "title": "Patrick Pinney"
}