{
 "id": "724881",
 "text": "Kelly Lynn Loeffler (; born November 27, 1970) is an American businesswoman, political donor and politician who has been the 28th and current Administrator of the Small Business Administration since 2025. Loeffler was the United States Senator from Georgia from January 6, 2020 to January 20, 2021. Before becoming senator, she was a businesswoman. She is a member of the Republican Party. She was the chief executive officer of Bakkt and the part-owner of the Atlanta Dream of the Women's National Basketball Association. In November 2019 Governor Brian Kemp's said that Loeffler was his top pick to replace Senator Johnny Isakson. Kemp formally picked Loeffler as his senate pick. She lost her re-election bid in January 2021 to Raphael Warnock. In December 2024, President-elect Donald Trump nominated Loeffler to serve as the Administrator of the Small Business Administration under his second administration. She was confirmed by the U.S. Senate in February 2025. ==Early life== Loeffler was born on November 27, 1970, in Bloomington, Illinois. She was raised on the family farm in Stanford, Illinois. She graduated with a Bachelor of Science from the University of Illinois at Urbana–Champaign and a Master of Business Administration from DePaul University. ==Business career== In 2010, Loeffler bought a minority stake in the Atlanta Dream of the Women's National Basketball Association (WNBA). In 2011, she and Mary Brock]bought the team from Kathy Betty. Loeffler took an active role in the team, arranging her travel schedule to attend all games and often meeting with head coach Michael Cooper during halftime to analyze the first half of the game. Due to her criticisms of the Black Lives Matter movement, many players on the Dream roster and within the league would criticize her publicly. As a result, in February 2021, Loeffler sold her stake in the team. According to the non- partisan Center for Responsive Politics, Loeffler and her husband have donated 3.2 million dollars to political committees. While the majority of these donations have gone to the Republican Party, some donations have gone to Democrats, including Representative David Scott (GA–13), a Democrat, who received $10,200. Loeffler donated $750,000 to Restore Our Future, a Super PAC supporting former Governor Mitt Romney's 2012 presidential campaign. The National Republican Senatorial Committee received $247,500 from Loeffler and her husband. Loeffler first considered running for office in 2014. She briefly expressed interest in seeking the Republican nomination in the 2014 United States Senate election in Georgia but ultimately passed on the race because of Intercontinental Exchange's pending acquisition with the New York Stock Exchange. ==U.S. Senate== Brian Kemp, the Republican Governor of Georgia, appointed Loeffler to the U.S. Senate in December 2019 after Senator Johnny Isakson resigned for health reasons. Loeffler was a strong supporter of President Donald Trump in her time in the Senate. She said she had a \"100 percent Trump voting record\" during her campaigns. After the November 2020 election, Loeffler and Perdue claimed without evidence that there was voter fraud in the 2020 presidential election, and called for the resignation of Georgia secretary of state Brad Raffensperger, who did not support these claims. She later supported a lawsuit by Trump allies who wanted to overturn the election results, and also announced her plan to object to the certification of the Electoral College results in Congress. After the attack on the U.S. Capitol on January 6, 2021, Loeffler announced that she would end her objection to the certification of the electoral votes and later voted to certify. Loeffler ran in the 2020 Georgia U.S. Senate special election. She finished second in the November 3 election, advancing to a runoff with Democrat Raphael Warnock held on January 5, 2021, where she lost. ==Administrator of the SBA== During the 2024 presidential election, Loeffler was a top donor to Donald Trump, giving more than $4.9 million to his re- election campaign. On December 4, 2024, President-elect Trump picked Loeffler to be the Administrator of the Small Business Administration under his second administration. She appeared before the Senate Committee on Small Business and Entrepreneurship on January 29, 2025. The committee advanced her nomination in a 12-7 vote on February 5. On February 19, the Senate confirmed her nomination in a 52–46 vote. == Personal life == Loeffler is a Roman Catholic. In 2004, Loeffler, then 34, married businessman Jeffrey Spreecher. Spreecher is 15 years older than Loeffler. They have no children. ==References== Category:1970 births Category:Living people Category:United States senators from Georgia Category:Politicians from Chicago Category:Businesspeople from Chicago Category:Businesspeople from Georgia (U.S. state) Category:Republican Party (United States) politicians Category:DePaul University alumni Category:People from Bloomington, Illinois Category:Administrators of the Small Business Administration",
 "title": "Kelly Loeffler"
}