{
 "id": "724905",
 "text": "North Sulawesi () is a province of Indonesia. It is on the northeastern peninsula of the island of Sulawesi. This is called the Minahasa Peninsula. The province is south of the Philippines and southeast of Sabah, Malaysia. The Maluku Sea is to the east, the Gorontalo and Celebes Sea is to the west, and the Gulf of Tomini is to the southwest. The province's area is 13851.64 sq.km, and its population was 2,270,596 at the 2010 census; The province's capital, business center, and largest city is Manado. Other major towns are Tomohon and Bitung. There are many tall mountains from high. The province is a young volcanic region. There are many eruptions and active volcanic cones. In the past, Portuguese, Spanish, Dutch and the Kingdoms around this area fought over the riches in North Sulawesi such as spices, rice and gold. The region was also the trading route between west and east and this helped the spread of Christianity, Islam, and other religions. The Portuguese first landed in the 16th century. The Spanish and the Dutch came and the Portuguese fought them. Finally, the Dutch got control in the 17th century. The Dutch ruled the area for three centuries until the Japanese came at the start of World War II. After the Japanese lost WWII in 1945, the Dutch controlled the area again for a short time. They left in 1949. , following the Round Table Conference, in which the Dutch recognized the newly created United States of Indonesia (RIS). So, North Sulawesi became part of the territory of the State of East Indonesia (NIT). The people did not like NIT, so it became part of the Republic of Indonesia in 1950. At first, the island of Sulawesi was one single province. Soon it separated into several different provinces. So, the province of North Sulawesi started on 14 August 1959. ==Name== The area around North Sulawesi used to be called Minahasa. The name is still used sometimes. The word Minahasa comes from the words Mina-Esa (Minaesa) or Maesa which means being one or uniting This name shows hope to unite the ethnic groups of the area including the: Tontemboan, Tombulu, Tonsea, Tolour (Tondano), Tonsawang, Ponosakan, Pasan, and Bantik. The word \"Minahasa\" was first used by J.D. Schierstein, the Dutch regent of Manado, in his report to the Governor of Maluku on 8 October 1789. ==History== ===Pre-historic=== Archaeological research has revealed signs of human life in North Sulawesi since 30,000 years ago, based on evidence in the cave Liang Sarru on the island of Salibabu. Other evidence shows life about 6,000 years ago on the Passo Hillside Site in Kakas District and 4,000 years ago to early AD at the Liang Tuo Mane'e cave in Arangkaa on Karakelang Island. ===Early period=== ===Colonial Period=== At the end of the 16th century, Portuguese and Spanish arrived in North Sulawesi. The Portugal was the first western nation to arrive in North Sulawesi. A Portuguese ship landed at Manado The Sultanate of Maguindanao controlled the northern islands at that time. The Portuguese built the fort at Amurang. The Spanish ship docked on the island of Talaud and Siau, on to Ternate. Spain built the Fort in Manado, since then Minahasa started in control of Spain. The resistance against the Spanish occupation culminated in 1660–1664. The Dutch ship landed in Manado City in 1660 in assisting the struggle of the Minahasa Confederation against Spain. The United Nations republican association of members of the Minahasa Confederation entered into a Trade Agreement with the VOC. This trade cooperation agreement then made the VOC monopolize the trade, which gradually began to impose its will, eventually leading to the 1700s resistance in Ratahan which culminated in the Dutch Minahasa-War in 1809–1811 at Tondano. The Spanish had already colonized the Philippine Islands. They made Minahasa a coffee plantation. Spain made Manado a center of coffee trade for Chinese merchants. Some Minahasan tribes helped Spain capture the Portuguese fort at Amurang in the 1550s. The Spanish colonists then built the fort in Manado. Finally, Spain controlled all Minahasa. In the 16th century one of the first Indo-Eurasian communities in the archipelago was in Manado. The first king of Manado was Muntu Untu (1630). He was half Spanish ancestry. Spain later gave Minahasa to the Portuguese in exchange for 350,000 ducats in a treaty. The rulers of Minahasa sent Supit, Pa'at, and Lontoh to fight with the Dutch to force the Portuguese out of Minahasa. They succeeded in 1655. They built their own fortress in 1658 and forced out the last Portuguese a few years later. By the beginning of the 17th century the Dutch had overthrown the sultanate of Ternate. They began to reduce the power of Spain and Portugal in the archipelago. In 1677 the Dutch conquered the Sangir archipelago. Two years later, Robert Padtbrugge, the governor of Maluku, visited Manado. He made an agreement with the Minahasan chiefs. This let the Dutch dominate for the next 300 years. However, direct rule by the Dutch only began in 1870. The Dutch helped unite the Minahasa confederation. In 1693 the Minahnians won a military victory against the Mongondow tribe in the south. Dutch influence increased and Christianity and European culture grew in Minahasa. The missionary schools in Manado in 1881 were one of the first attempts of mass education in Indonesia. Graduates of the schools could find work as civil servants, in the army, and in the Dutch East Indies government. Minahasa relations with the Dutch were often poor. There was a war between the Dutch and Tondano in 1807 and 1809. The Minahasa territory was not under Dutch direct rule until 1870. But eventually the Dutch and Minahasa became very close. So, Minahasa was often called the 12th Dutch province. Even in 1947, Manado formed the political movement of Twapro, short for Twaalfde Profincie (Twelfth Province) who wanted formal integration of Minahasa into the Kingdom of the Netherlands. ===Independence=== The Japanese occupied the area from 1942 to 1945. was a period of deprivation, and the allied forces bombed Manado greatly in 1945. During the period of independence thereafter, there was a split between pro- Indonesian and pro-Dutch Minahasa. The appointment of Sam Ratulangi as the first East Indonesia governor then succeeded in winning Minahasa support to the Republic of Indonesia. After Indonesian independence, Indonesia is divided into 8 Provinces, and Sulawesi is one of these provinces. Sulawesi's first governor was S.G.J.Ratulangi, also known as a national hero. In 1948 in Sulawesi was formed the State of East Indonesia, which later became one of the states within the United States of Indonesia. The State of East Indonesia was dissolved, and merged into the Republic of Indonesia. Based on Law Number 13 Year 1964, formed North Sulawesi Province. 14 August 1959 was designated as the anniversary of the province. In March 1957, North and South Sulawesi military leaders demanded more freedom from Java. They wanted more active development, sharing tax money fairly, and help against Kahar Muzakar's rebellion in South Sulawesi. They wanted a central government led by both Sukarno and Hatta equally. At first the movement of the 'Permesta' (Charter of the Struggle of the Universe) was merely a movement of reform rather than a separatist movement. Negotiations between the central government and Sulawesi military leaders prevented violence in South Sulawesi, but Minahasan leaders were not satisfied with the outcome of the agreement and the movement broke out. Fearful of southern dominance, Minahasan leaders declared their own North Sulawesi autonomous state in June 1957. At that time the central government had controlled South Sulawesi, but in the North there were no strong figures of the central government and there were rumors that the United States was armed with rebellion in Sumatra North, also has links with Minahasan leaders. The possibility of foreign intervention prompted the central government to request military assistance from southern Sulawesi. The Permesta forces were later removed from Central Sulawesi, Gorontalo, Sangir, and Morotai in Maluku. Permesta planes (supplied by the US and flown by Philippine, Taiwanese, and American Pilots) were destroyed. The US then moved on, and in June 1958 the central government army landed in Minahasa. The Permesta uprising ended in mid-1961. The Sumatra and Sulawesi rebellions failed. They even helped to create what they did not want as the center reacted to the threat of rebellion. The central government authority increased while regional autonomy became weaker. Radical nationalism became stronger. Communist party power and Sukarno's power increased while Hatta weakened. Sukarno finally established guided democracy in 1958. Since the 1998 reforms, the Indonesian government has begun to adopt laws that enhance regional autonomy, the main idea that Permesta fights for. == Environment == ===Climate=== The climate of North Sulawesi is tropical with muzon winds. The West winds bring rain to the north coast from November to April. It changes to a dry south wind from May to October. Annual rainfall is from 2000 to 3000 mm. There are about 90–140 rainy days. Temperatures average 25 degrees Celsius. The average maximum air temperature was recorded at 30 degrees Celsius and the minimum average air temperature was 22.1 degrees Celsius. ===Geography=== The province of North Sulawesi is in the northern peninsula of Sulawesi Island. It is one of three provinces in Indonesia in important places on the Pacific Rim. The other two provinces are North Sumatra and Aceh Special Region. North Sulawesi is near the equator at 0.30–4.30 North Latitude (Lu) and 121–127 East Longitude (BT). The peninsula stretches from east to west. The Sangihe and Talaud Islands are the parts of the province farthest north. These are North Sulawesi's boundaries: North Celebes Sea, Pacific Ocean and the Philippines South Gulf of Tomini East Maluku Sea, Maluku and North Maluku West Gorontalo Most of mainland North Sulawesi Province is mountains and hills with valleys in between. Some mountains in North Sulawesi are Mount Klabat (1,895 m) in North Minahasa, Mount Lokon (1,579 m), Mount Mahawu (1,331 m) in Tomohon, Mount Soputan (1,789 m) in Southeast Minahasa, Mount Dua Saudara (1,468 m) in Bitung, Mount Awu (1,784), Mount Space (1,245 m), Mount Karangketang (1,320 m), Mount Dalage (1,165 m), in Sangihe and Talaud, Mount Ambang (1,689 m), Mount Gambula (1954 m) and Mount Batu Balawan (1,970 m). The two largest lakes are: Lake Tondano (area of 4,278 ha) in Minahasa and Lake Moat (area 617 ha) in East Bolaang Mongondow. The main rivers are Tondano River (40 km), Poigar River (54.2 km), Ranoyapo River (51.9 km), Talawaan River (34.8 km) in Minahasa. Dumoga River (87.2 km), Sangkub River (53.6 km), and Ongkaw River (42.1 km) are in Bolmong and Bolmut. Along the coast of North Sulawesi, both on the mainland coast and on the coast of the islands, there are several headlands and bays. The soil in the area was fertile for agriculture. ===Plants and Animals=== Most of the plants and animals in North Sulawesi are like those in other parts of Indonesia. But, there are some animals in the province such as Deer, Maleo, Taong, Mini Tarsius Spectrum in Bitung City Nature Reserve And Coelacanth off the coast of Manado. In the sea off North Sulawesi, there are several species of fish, coral, and plankton. Some marine fish are important sources of foreign exchange, including: tuna, skipjack, yellow tail, lobster, and others. Much of North Sulawesi is forest. Forests start at sea level and may continue to mountain tops. Good quality timber, including ebony (wooden) iron wood, linggua, cempaka, wooden nantu, gopasa, and meranti. There are also plantation crops such as coconut, nutmeg, and cloves. ==People== North Sulawesi counted 2,270,596 people in the 2010 Census. The population was 1.41% higher than ten years before.BPS The largest ethnic groups are the Minahasan in the north of the province and the Mongondow to the south. The province's main city is Manado (population of 432,300 in 2019). In 2010, about 68% were Christian. Christians in North Sulawesi are mostly Protestant but there are also some Catholics. This is unusual in mostly Muslim Indonesia. Dutch missionaries were very successful during the colonial time. Also, because the Muslim-majority region of Gorontalo left North Sulawesi to become the new Gorontalo (province) in 2000. Muslim, Hindu, and Buddhist minorities also live in the province. Manado also has a significant Judaism community. Currently, the only synagogue in Indonesia is in Manado. There are an estimated 800 Jewish people in Manado. ===Ethnic groups=== Many groups of people live together in this province. The largest group of people are the Minahasa people. They mostly lived in Bitung City, Manado City, Tomohon City, Minahasa Regency, North Minahasa Regency, South Minahasa Regency and Southeast Minahasa Regency. Other ethnic groups are the Bolaang Mongondow, Sangihe, Talaud and Siau. Ethnicity in North Sulawesi is more heterogeneous then other parts of Indonesia. The Minahasan and Bolaang Mongondow are spread almost throughout the region of North Sulawesi mainland. The Sangihe, Talaud and Siau mostly inhabit the Sangihe Islands, Talaud Island, and Lembeh Island, especially in coastal areas north, east and west of mainland North Sulawesi. The Bajau people are seafaring nomads who has migrated from the Sulu Archipelago in the Philippines, due to the conflict in Mindanao. They live in coastal villages of North Sulawesi in the northern part of North Minahasa Regency. In addition to the natives, North Sulawesi is also home to migrants. There are a significant Chinese population in North Sulawesi, especially around the city of Manado. The Chinese are also one of the first people to have contact with the local people before the European came. According to the discovery of Chinese ancient letters in the Tompaso area, Minahasa shows the cultural interaction between the Chinese and Minahasa have existed since the Han dynasty. Most of the Chinese people in North Sulawesi are Hakka, but some Hokkien and Cantonese people also live there. Other ethnic groups such as the Javanese and the Sundanese also exist. They are mostly migrated from where they come from due to the Transmigration program enacted by the Dutch during the colonial era until the Suharto era. They generally live in urban areas, such as Manado and Tomohon. ===Language=== North Sulawesi is a multilingual culture. Many languages are used and people usually speak at least two and often more languages. Indonesian is the official language of the province an other parts of Indonesia. Official documents from the provincial government and road signs are all written in Indonesian. However, most people in the province communicate everyday in Manado Malay. This language is like Indonesian but not the same. Minahasan people speak Minahasan languages. These are the five Minahasan languages in the area: Tonsawang, Tontemboan, Toulour, Tonsea and Tombulu. To the south, people speak Mongondow language and Gorontalo language. In the north islands near the Philippines, local people speak Visayan languages. Other language in North Sulawesi are Javanese, Sundanese, and Balinese. People from other parts of Indonesia speak these languages. Hakka is also spoken by some Chinese people in Manadao. Hokkien and Cantonese are also spoken. English and Mandarin are often understood where there are many tourists, such as the Bunaken National Park. Older people may understand Dutch and Portuguese. People who lived in islands near the Philippines may understand Tagalog. ==Administrative divisions== North Sulawesi has eleven regencies () and four independent cities (). They are listed below. Name Area (km2) Population Census 2010 Population Census 2015 Population Estimate 2019 Capital HDI 2014 Estimates Sangihe Islands Regency (Kepulauan Sangihe) 461.11 126,100 129,560 131,800 Tahuna 0.668 () Sitaro Islands Regency (Kepulauan Siau Tagulandang Biaro) 275.96 63,801 65,529 67,000 Ondong Siau 0.643 () Talaud Islands Regency (Kepulauan Talaud) 1,240.40 83,434 88,589 92,500 Melonguane 0.665 () Northern (islands) sector 1,977.47 273,335 283,678 291,300 Bitung (city) 302.89 187,652 205,379 220,700 0.708 () Manado (city) 157.27 410,481 425,420 432,300 0.772 () Tomohon (city) 114.20 91,553 100,193 107,600 0.735 () Minahasa Regency 1,114.87 310,384 328,700 341,500 Tondano 0.727 () North Minahasa Regency (Minahasa Utara) 918.49 188,904 197,861 203,200 Airmadidi 0.705 () South Minahasa Regency (Minahasa Selatan) 1,409.97 195,553 204,832 210,400 Amurang 0.683 () Southeast Minahasa Regency (Minahasa Tenggara) 710.83 100,443 104,465 106,500 Ratahan 0.678 () Eastern (Minahasa) sector 4,728.52 1,494,970 1,566,850 1,622,200 Kotamobagu (city) 68.06 107,459 119,277 130,000 0.704 () Bolaang Mongondow Regency 2,871.65 213,484 232,968 249,600 Kotamobagu 0.645 () East Bolaang Mongondow Regency (Bolaang Mongondow Timur) 910.18 63,654 68,622 72,600 Tutuyan 0.631 () North Bolaang Mongondow Regency (Bolaang Mongondow Utara) 1,680.00 70,693 76,264 80,700 Boroko 0.642 () South Bolaang Mongondow Regency (Bolaang Mongondow Selatan) 1,615.86 57,001 62,162 66,500 Molibagu 0.635 () Western (Bolaang Mongondow) sector 7,145.75 512,291 559,293 599,400 == References == ==Other websites==",
 "title": "North Sulawesi"
}