{
 "id": "724998",
 "text": "Nigel George Planer (born 22 February 1943) is an English actor, comedian, novelist and playwright. He played Neil in the cult BBC comedy The Young Ones and Ralph Filthy in Filthy Rich & Catflap. He has been in many West End musicals. He won a BRIT award in 1977 and has been nominated for Olivier, TMA, What's On Stage, and BAFTA awards. ==Early life== Planer was born in Westminster, London. He studied at the University of Sussex. He left to become an actor. ==Career== He is a founding member of the London Comedy Store. He is an original member of The Comic Strip. They were pioneers of the alternative comedy movement in the United Kingdom. Planer worked with Peter Richardson. They were a double act called \"The Outer Limits\". Planer and Richardson also wrote the That's Life! parody on Not the Nine O'Clock News. He went on to star in film, theatre and television. He created the spoof actor character \"Nicholas Craig\", with help from Christopher Douglas. The Craig character appears in book, radio, TV and articles as well as live. The character appeared at the Royal Festival Hall, London, in Stewart Lee's At Last the 1984 show. Planer is also the author of several books, plays, radio plays, and TV scripts as well as a small volume of poetry. In June 2011, he was awarded an Honorary Doctor of Arts degree from Edinburgh Napier University. ===Television=== Planer is best known for his role as Neil, the hippie housemate in the cult BBC comedy The Young Ones. The series ran from 1982 to 1984. He has starred in The Comic Strip Presents..., a series of short films broadcast from 1975 onwards, as various odd outsiders. In 1995, Planer played Professor Dumbledore in a Harry Potter parody, Harry Potter and the Secret Chamber Pot of Azerbaijan. He appeared on a BBC 4 programme in the guise of \"Nicholas Craig\" in 1999, in which he was interviewed by Mark Lawson. Planer guest-starred in \"The Pale Horse\", a 2010 episode of Agatha Christie's Marple. In 2011's The Hunt for Tony Blair, he played Peter Mandelson. In 1998-2001, He Was Narrator in UK Dub of First Base and His Friends and William and Millie, Meanwhile Alan Marriott, He Was Narrator in US Dub of First Base and His Friends and Animal Stories While Alec Baldwin Narrator William and Millie and Thomas and Friends - Series 5-6. Planer's guest appearances include programmes such as The Bill, French and Saunders, Jonathan Creek, Blackadder III, The Last Detective, the Paul Merton Show, the Lenny Henry Show, Death in Paradise (TV series) and Gary Wilmot's Songs from the Shows. He also guest-starred in an episode of This is Jinsy entitled \"Nameworm\", and in the BBC series Boomers. Planer played Matt LeBlanc's lawyer in the TV series Episodes. Leading roles on television include Shine on Harvey Moon, Filthy, Rich and Catflap, The Grimleys, King and Castle, Bonjour La Classe and Roll Over Beethoven. He also starred in Michael Palin's Number 27, Simon Gray's Two Lumps of Ice, Emma Tennant's Frankenstein's Baby, and Blackeyes by Dennis Potter. ===Theatre=== His first break in the theatre was understudying David Essex as Che Guevara in the original West End run of Evita. Planer played Amos Hart in the original London cast of Chicago. He played Pop in the original West End cast of Ben Elton's Queen musical We Will Rock You. In 1990, he replaced Michael Gambon in Alan Ayckbourn's Man of the Moment in the West End. Leading roles followed in other productions at the Bush Theatre, the Lyric Theatre, the Traverse, the Young Vic, the West Yorkshire Playhouse, Regent's Park Open-Air Theatre, Chichester Festival Theatre, Plymouth Drum and the Hampstead Theatre. In 2006, he was the narrator in The Rocky Horror Show, taking on the role in Manchester and Bromley. He then starred as The Wizard in the original West End production of Wicked alongside Idina Menzel. The show opened at the Apollo Victoria Theatre on 27 September 2006. Planer ended his run on 7 June 2008 and was replaced by Desmond Barrit. In 2009, he took over the role of Wilbur in the West End production of Hairspray.Ball and Jones Extend Run in London Hairspray; Planer and Rushworth to Join Cast In 2010, Planer returned to the role of the narrator in the UK Tour of The Rocky Horror Show, playing in Cambridge and Northampton. He reprised the role of Wilbur in Manchester and Leeds. He was in Doctor Who: Live touring the UK, as Vorgenson The Inter-Galactic Showman. He then played Captain Hook in Pantomime at the Lyceum Theatre in Sheffield. In 2013, Planer starred as Grandpa Joe in the original production of Charlie and the Chocolate Factory in London's West End. From September 2018 to November 2018, Planer toured with Ade Edmondson in a play that they wrote together called Vulcan 7. ===Film=== Planer has appeared in films, including Flood, Virgin Territory, Bright Young Things, Hogfather, The Colour of Magic, The Wind in the Willows, The Land Girls, Clockwork Mice, Carry on Columbus, Brazil, The Supergrass, I Give It a Year, The Apple Picker and Yellowbeard. ===Music=== Planer played Den Dennis, one of the four members of the 1980s spoof rock band, Bad News. They made two albums which were produced by Brian May. They also performed at the Hammersmith Apollo as well as the Donington and Reading Rock Festivals. In 1984, as Neil from The Young Ones, Planer had a number two hit single called \"Hole in My Shoe\". This had originally been a hit for 1960s band Traffic). A cover of Tomorrow's \"My White Bicycle\" was a less successful follow up, only reaching No.97 in the charts. After that, an album was produced, entitled Neil's Heavy Concept Album. Planer also toured Neil's stage act in the \"Bad Karma in The UK\" tour. This culminated in a month-long run at St. Mary's Hall at the Edinburgh Festival Fringe. In 1986, The Young Ones appeared on Cliff Richard's charity rerecording of \"Living Doll\". This spent three weeks at number one in the UK. Planer has a silver and a gold disc and has a Brit award from his musical career. In 2015 he started a new music project called Rainsmoke with Chris Wade, of Dodson and Fogg, and Roger Planer. In 2017 he recorded two songs for the album Wit & Whimsy - Songs by Alexander S. Bermange. One he performed solo and one featured all of the album's 23 artists. It reached No. 1 in the iTunes comedy album chart. ===Voice acting=== Planer is the main reader for the audiobook editions of many of Terry Pratchett's Discworld novels. He also appeared in the television adaptations of both Terry Pratchett's Hogfather and The Colour of Magic, and performed as a voice artist in the games Discworld 2 and Discworld Noir. ====Discworld Audiobooks narrated by Planer==== (the number in brackets indicates the order of the book in the Discworld series) * The Colour of Magic (1) * The Light Fantastic (2) * Mort (4) * Sourcery (5) * Wyrd Sisters (6) * Pyramids (7) * Guards! Guards! (8) * Moving Pictures (10) * Reaper Man (11) * Witches Abroad (12) * Small Gods (13) * Lords and Ladies (14) * Men at Arms (15) * Soul Music (16) * Interesting Times (17) * Maskerade (18) * Feet of Clay (19) * Hogfather (20) * Jingo (21) * The Last Continent (22) * Carpe Jugulum (23) ====Other voice roles==== Planer was the narrator of Grizzly Tales for Gruesome Kids, the title character of Romuald the Reindeer, and Dr. Marmalade in an episode of SpongeBob SquarePants (alongside Young Ones co-stars Christopher Ryan and Rik Mayall). Planer has also been the narrator of many of BBC Four's Britannia series of documentaries, including Prog Rock Britannia, Blues Britannia and Heavy Metal Britannia. Planer voiced Frodo in The Adventures of Tom Bombadil from the 1992 radio series Tales from the Perilous Realm. He was a narrator in a direct-to-video version of Val Biro's Gumdrop book series in 1994. He also narrated two short surreal monologues on the album In A Strange Slumber, by Dodson and Fogg, Chris Wade's progressive folk rock project. Planer narrated as a thirty-something Adrian Mole in the radio adaptation of Adrian Mole: The Cappuccino Years. In 2018, he voiced the character of Henry Davenant Hythe in the Big Finish Productions original production, Jeremiah Bourne in Time, which he also wrote. ==Credits== His television comedy and satire work includes: * Boom Boom...Out Go The Lights (1980) * Shine on Harvey Moon (1982) * The Young Ones (12 episodes) (1982–84) * Yellowbeard (1983) * The Comic Strip Presents… (25 episodes) (1983–2012) * Roll Over Beethoven (9 episodes) (1985) * Brazil (1985) * King and Castle (12 episodes) (1986–88) * Filthy Rich & Catflap (6 episodes) (1987) * Blackeyes by Dennis Potter (1989) * Frankenstein's Baby (1990) * Nicholas Craig – The Naked Actor (1990) * Nicholas Craig's Interview Masterclass (1990) * Oh, No! Not THEM! (1990) * Nicholas Craig's Masterpiece Theatre (1992) * The Nicholas Craig Masterclass (1992) * Carry On Columbus (1992) * The Magic Roundabout (English adaptation and narrator on previously unseen episodes) * Bonjour la Classe (1993) * Sherlock Holmes (1993) * Let's Get Divorced (1994) * Wake Up! With Libby And Jonathan (1994) * Blackadder the Third * French & Saunders * Jonathan Creek * The Grimleys (1997–2001) * Grizzly Tales for Gruesome Kids (1999–2007) * First Base and His Friends (1998–2001) (UK Dub) * William and Millie (1998—2001) (UK Dub) * Wicked (2006–08) * Terry Pratchett's Hogfather (2006) * Flood (2007) * Terry Pratchett's The Colour of Magic (2008) * Hairspray (2009) * M.I.High (2009) * Death in Paradise (TV series) (2018) He has published several books including the novels The Right Man (2000) () and Faking It (2003) (). Planer also wrote A Good Enough Dad (1992) () after his first son was born, talking about coping with becoming a father. ===Discography=== *\"Hole in My Shoe\" (1984) *Neil's Heavy Concept Album (1984) *\"Living Doll\" (1986) *\"Rough with the Smooth\" (1986) *Bad News (1987) *Bad News Bootleg (1988) *Bad News The Cash In Compilation (1992) *The Last Night (1993) *Chicago cast recording (1995) *The Dreaded Lurgie (1998) *Three Men in a Boat (1999) *Adrian Mole the Cappuccino Years (2000) *There was also a soundtrack to The Grimleys (2000), Planer's character appearing on the album. *We Will Rock You (The Original London Cast Recording) (2002) *Cabaret (2005) *The Robe of Skulls (2008) *Charlie and the Chocolate Factory (The Original London Cast Recording) (2013) *Dodson and Fogg – In A Strange Slumber (2014) ==References== ==Other websites== * Official Nigel Planer website * * The Times Article September 2006 article about Planer Category:1945 births Category:Living people Category:People from Westminster Category:People educated at Westminster School, London Category:British movie actors Category:British stage actors Category:British television actors Category:British voice actors Category:Writers from London Category:British singers",
 "title": "Nigel Planer"
}