{
 "id": "725070",
 "text": "James Michael Aloysius Bradford (born 16 March 1954), known as Jimmy Nail, is an English singer-songwriter, actor, film producer, and television writer. He is known for his role as Leonard \"Oz\" Osborne in the hit television show Auf Wiedersehen, Pet, his title role in Spender, and his 1992 number one single, \"Ain't No Doubt\". ==Early life== James Michael Aloysius Bradford was born in Newcastle upon Tyne. His father is called Jimmy and his mother is Laura. His father was a shipyard worker, an amateur boxer, and professional footballer. His sister, Shelagh, died aged 20 when he was 13. He later spent time drinking and fighting. He was involved in a fight after a football match and was sent to prison. After being released he worked in a glass factory. While opening a crate of glass he stood on a six-inch spike that went through his foot. After this he was called \"Nail\". He later used \"Nail' as his professional surname. At that time he played guitar in a rock band called the King Crabs. His sister, Val McLane, was a successful actress and later became Head of Drama at Sunderland University. ==Career== ===Television=== Nail's partner, Miriam, encouraged him to audition for a television show even though he had no experience as an actor. He won the role of Leonard Jeffrey \"Oz\" Osborne in Auf Wiedersehen, Pet, an ITV comedy drama about construction workers working abroad in Germany. The show made him famous. After the first two series of Auf Wiedersehen, Pet, Nail created the detective series Spender. He co-wrote it with Ian La Frenais. The show ran for three series from 1990 to 1993. In 1994, Nail created, wrote and starred as songwriter Jed Shepherd in the TV series Crocodile Shoes. In 2000 he began work on reviving the Auf Wiedersehen, Pet series, this time for the BBC. It was filmed in Middlesbrough and Arizona in 2001. It was shown on TV in 2002 and had 13 million viewers. Another series saw the brickies in Cuba. The final two-hour instalment was set in Laos. It was shown on Christmas 2004 snd had seven million viewers. In 2008, Nail created and starred as Phil Parker in Parents of the Band. The series was shown on BBC1. It revolves around a group of teenagers who form a band just for their own fun, but their parents expect them to be the next Led Zeppelin. Ratings were disappointing, around three million, and there was no second series. ===Music=== Nail had pop hits with *\"Ain't No Doubt\", co-written written by Nail, Danny Schogger, Guy Pratt and Charlie Dore. *\"Crocodile Shoes\" *\"Love Don't Live Here Anymore\". His 1992 album Growing Up in Public featured Gary Moore, David Gilmour, Elliot Randall and George Harrison. His 1994 album Crocodile Shoes was based on the BBC television series of the same name. The album sold more than one million copies in the UK. His 2001 album Big River featured guitarist Mark Knopfler. It included cover versions of \"Walking on the Moon\" by the Police, \"Something\" by the Beatles, and \"Overjoyed\" by Stevie Wonder. Nail sang on the film soundtracks for Evita and Still Crazy. With Tim Healy, Nail created the Sammy Johnson Memorial Fund, in memory of their friend and colleague, established to help young talent in North East England. To aid this, he participated in the Sunday for Sammy benefit concerts, until workload forced him to resign from the board. In 2020 it will be the concerts’ 20th anniversary. ===Theatre and film=== In 2005, Nail played gamekeeper \"Rabbetts\" in Danny, the Champion of the World, based on the novel of the same name by Roald Dahl. In 2014, Nail came out of retirement to act and sing in The Last Ship, a musical by Sting about the shipbuilders of Newcastle-upon-Tyne, the hometown of both Nail and Sting. Sting grew up in Wallsend, down the street from the shipyards. Nail worked in the shipyards and is the son of a shipyard foreman. The show opened in Chicago. On Broadway, when ticket sales began to drop, Sting replaced Nail to try to save the musical, but it ended after a short run. Nail sang on the Original Broadway Cast Recording and on Sting's album, The Last Ship. In 2016, Nail played Parson Nathaniel in War of the Worlds alongside David Essex at the Dominion Theatre, London. In 2018, Nail had been due to reprise his role in The Last Ship in the UK. The show's producer Karl Sydow stated: \"After protracted negotiations carried out in good faith, we regret to announce the production's offer of employment to Jimmy Nail has been withdrawn. Joe McGann replaced him. Nail said \"I was very much looking forward to appearing in Sting's The Last Ship, particularly here in my home city, Sadly that's not to be.\" ==Lawsuit== In 2004, Nail successfully sued News Group Newspapers and Harper Collins Publishers. The lawsuit concerned false and defamatory allegations made two years before in an article in the News of the World and Nailed, a biography which was the newspaper's source for the claims. He described reading the article as one of the worst experiences of his life. He received damages of £30,000. ==Awards and honours== Nail has received five BAFTA nominations. Three for Auf Wiedersehen, Pet', one for Spender, and one for Crocodile Shoes. He has received a Golden Globe nomination for Best Original Song – \"Still Crazy\". He has had an Ivor Novello nomination for \"Ain't No Doubt\". ==Personal life== Nail married Miriam Jones. They have two boys, Tommy and Freddie, and live in London. ==Selected filmography== ===Television=== * Auf Wiedersehen, Pet (1983–'84, 1986, 2002, 2004)... as Leonard Jeffrey \"Oz\" Osborne * Spyship (1983) ... as Metcalfe * Minder (1984)... as Nathan Loveridge in the episode \"The Car Lot Baggers\" * Blott on the Landscape (1985)... as Edwards * Master of the Game (1985)... as Schmidt * Raoul Wallenberg (1986)... as Vilmos Langfelder * Nicking Kids (1986)...as Criminal 1 * Lenny Henry Tonite (1986) as Guest Star * Shoot for the Sun (1986)... as Geordie * Spender (1991–93)... as Freddie Spender * Crocodile Shoes (1994, 1996)... as Jed Shepperd * Parents of the Band (2008) ... as Phil Parker ===Movies=== *Morons from Outer Space (1985)... as Desmond *Howling II: Your Sister Is a Werewolf (1985)...as \"Punk\" *Dream Demon (1987)... as Paul *Just Ask for Diamond (1988)... as Boyle *Crusoe (1989)... as Tarik *Danny, the Champion of the World (1990)... as Rabbets *Evita (1996)... as Agustín Magaldi *Still Crazy (1998)... as Les Wickes *The 10th Kingdom (2000)... as Clayface the Goblin alongside Al Hunter Ashton ==Own projects== *Spender (1991–93) – actor, writer, producer, creator *Crocodile Shoes (1994) – actor, writer, executive producer, creator *Crocodile Shoes II (1996) – actor, writer, executive producer, title music composer, creator *Parents of the Band (2008–09) – actor, creator, executive producer, title music composer ==Discography== ==References== ==Sources== * Larkin, Colin. The Encyclopedia of Popular Music, 3rd edition, Macmillan, 1998. ==Other websites== * Category:1954 births Category:Living people Category:British musicians Category:British actors Category:English autobiographers Category:English singer-songwriters Category:English television producers Category:English television writers Category:English singers Category:English writers Category:20th-century English composers Category:21st-century English composers",
 "title": "Jimmy Nail"
}