{
 "id": "725286",
 "text": "Quwwat-ul-Islam mosque (built 1192 - 1316) Quwwat-ul-Islam was sponsored by Qutb-ud-din Aibak, founder of the Delhi Sultanate. The Quwwat-ul-Islam is best known for its tower of victory, celebrating the Islamic conquest of India. 27 Jain and Hindu temples were dismantled and their stonework salvaged into the Quwwat-ul-Islam mosque. It consists of a rectangular courtyard enclosed by cloisters. Perhaps it was the first monument of iconoclast in India. It is in contradiction to Hasan Nizami's account of Aibak as peaceful and 'Lakh Baksh' or 'giver of lakhs' in his book Taj-ul-Masir. It is said he was generous and spent huge sums in charity. But it may also be that the monument was hurriedly built with the building material from the temple as Aibak had not established himself firmly in India at that time. Quwwat-ul-Islam, the \"Glory of Islam,\" was hastily erected by the young amir, who conscripted an army of local craftsmen, presumably Hindus, to assemble the structure thought there is no evidence to confirm the religious demography of the craftsmen The Qūwat-ul- Islām mosque (completed 1196), consisting of cloisters around a courtyard with the sanctuary to the west, was built in Delhi from the remains of demolished temples celebrating the Muslim conquest of India. It is built of red sandstone, gray quartz, and white marble, but is probably inspired by the “Iron Pillar \" that stands on the site. Built in the Gupta dynasty in the 6th century, it is the only piece of the temple that stands in its original location. Qutb built around it when he constructed the mosque. Although made of iron, it has resisted rust for over 1,500 years. Later, a lofty arched screen was erected and the mosque was enlarged by later Delhi sultans Shams- ud-Din Iltutmish (A.D. 1210 - 1235) and Ala-ud-Din Khalji. The Iron Pillar in the courtyard bears an inscription in Sanskrit in Brahmi script of fourth century A.D., according to which the pillar was set up as a Vishnudhvaja (standard of god Vishnu) on the hill known as Vishnupada in memory of a mighty king named Chandra. A deep socket on the top of the ornate capital indicates that probably an image of Garuda was fixed into it.This was congregational mosque of the first city built by sultans, described in chronicles as Dehli-i- Kuhna (the old city). == References == Category:Mosques in India Category:Mamluk dynasty (Delhi) Category:Monuments and memorials in India Category:Mughal architecture Category:World Heritage Sites in India Category:13th-century buildings and structures",
 "title": "Quwwat-ul-Islam mosque"
}