{
 "id": "725531",
 "text": "The 2019 Hyderabad gang rape was the murder of a 26 year old veterinary doctor. It had an effect across all of India. Her body was found in Shadnagar on 28 November 2019, a day after her death. Four suspects were arrested and, according to the Hyderabad Metropolitan Police, confessed to having raped and killed the doctor. On 6 December, the police took the accused to the scene of the crime, and shot them dead,News Service, Express (6 December 2019). \"Hyderabad rape-murder accused shot dead: How the 'encounter' with Telangana Police unfolded\". The Indian Express. prompting accusations of extrajudicial execution \"Indian police kill rape-murder suspects, sparking celebrations\". AFP.com. and celebrations of the killings. Pandey, Geeta (6 December 2019). \"Why Indians are celebrating the killings in Hyderabad\". The following account is based on the police report. The victim had parked her scooter near a toll plaza, and caught the attention of two lorry drivers and their assistants. They deflated her tire, pretended to help her, and pushed her into nearby bushes, where they raped and smothered her. Then they loaded her corpse onto a lorry and dropped it on the roadside. The police got evidence from CCTV cameras and from the victim's mobile phone. The accused were arrested and were put in Cherlapally Central Jail for fourteen days. The Telangana Chief Minister ordered a fast-track court to try the accused for their alleged crimes. The rape and murder caused outrage in several parts of the country. Protests and public demonstrations against rape were organized nationwide after the incident, with the public demanding stricter laws against rape and rapists. The Minister of Home Affairs criticized the Telangana Police and stated that the government intended to amend the Indian Penal Code and Code of Criminal Procedure to introduce laws for quicker punishment by fast-track courts. All four accused were killed by police on 6 December 2019, under a bridge on Bangalore Hyderabad national highway, while they were in police custody. According to the police, the suspects were taken there for a reconstruction of the crime scene. Two of them allegedly snatched guns and attacked the police. In the ensuing shootout, all four suspects were shot dead. Thousands of people celebrated the men's deaths. The event has no religious angle : the accused included men of both main religions. == References == Category:2019 murders in Asia Category:2019 in India Category:November 2019 events Category:2010s murders in India Category:Rape in India Category:Hyderabad, India Category:Incidents of violence against women",
 "title": "2019 Hyderabad gang rape"
}