{
 "id": "725646",
 "text": "Clyde is a city in Cloud County, Kansas, United States. As of the 2020 census, 694 people lived there. == History == Clyde was planned out in 1867 that makes it the oldest town in Cloud County. It was named after the River Clyde, in Scotland. According to another source, it was named for Clyde, OhioKansas Place-Names, John Rydjord, University of Oklahoma Press, 1972, p. 273 (which also is named indirectly for the River Clyde.) Clyde experienced growth in 1877 when the Central Branch Railroad was built through it. == Geography == Clyde is at (39.59183, -97.400212). According to the United States Census Bureau says that the city has a total area of . All of it is land. == Demographics == === 2020 census === The 2020 census says that there were 694 people, 287 households, and 181 families living in the city. Of the households, 79.1% owned their home and 20.9% rented their home. The median age was 47.6 years. Of the people, 95.5% were White, 0.9% were Native American, and 3.6% were two or more races. Hispanic or Latino of any race were 0.3% of the people. === 2010 census === The 2010 census says that there were 716 people, 297 households, and 194 families living in the city. == Education == Clyde is part of the Clifton-Clyde Unified School District 224.USD 224 The school district includes Clifton, Clyde, Vining, Ames, St. Joseph, and nearby rural areas of Clay, Cloud, Washington counties. The district has three schools: * Clifton-Clyde Senior High School, in Clyde. * Clifton-Clyde Middle School, in Clifton. * Clifton-Clyde Grade School, in Clifton. The Clifton- Clyde High School mascot is Eagles. Before to school unification in 1981, the Clyde High School mascot was Bluejays.\"North Central Wins District\", The Belleville Telescope, 8 March 1973, p.7. The Clifton Cardinals won the state 1A football championship in 1969 The Clyde Bluejays won the Kansas State High School 1A Football championship in 1977 and the boys 1A Basketball championship in 1979. == Notable people == * George Dockins, Major League Baseball pitcher for the St. Louis Cardinals (1945) and Brooklyn Dodgers (1947). * Louis M. Mollier (1846–1911), pioneer Roman Catholic priest for the Vicariate of Kansas (1874–1876), Diocese of Leavenworth (1877–1887), and Diocese of Concordia (later Salina) (1887–1911). == References == == Other websites == ;City * City of Clyde * Clyde - Directory of Public Officials ;Schools * Clifton-Clyde USD 224, local school district ;Historical * , from Hatteberg's People on KAKE TV news ;Maps * Clyde City Map , KDOT Category:Cities in Cloud County, Kansas",
 "title": "Clyde, Kansas"
}