{
 "id": "725868",
 "text": "Rosetta Code is a wiki-based website that features ways to solve various programming problems in many different programming languages.Ralf Lämmel. \"Software chrestomathies\". . 2013. ==Website== Rosetta Code was created in 2007 by Michael Mol. The site's content is licensed under the GNU Free Documentation License 1.2, though some components may have two licenses under less strict terms. Rosetta Code's collection of code examples shows how the functionality the user desires is achieved differently in various ways,Neil Walkinshaw. Chapter One: \"Reverse-Engineering Software Behavior\". \"Advances in Computers\". 2013. p. 14.Geoff Cox. \"Speaking Code: Coding as Aesthetic and Political Expression\". MIT Press, 2013. p. 6. and how \"the same\" task can be done in different programming languages.Nick Montfort \"No Code: Null Programs\" . 2013. p. 10. , Rosetta Code has: ::* 971 programming problems ::* 225 additional draft programming tasks ::* 723 programming languages ::* 66,679 programming language examples ===Data and structure=== The Rosetta Code site is organized as a browsable cross-section of programming problems and programming languages. A programming problem's page displays solutions contributed by visitors in various programming languages, allowing someone who views the solution to compare the solution to the programming problem. Each programming language has its own page, which contains a list of programming problems that have solutions in that programming language. For example, a task that has a solution in the C programming language will appear in the listing for the C programming language, and if the same task has a solution in the Ruby programming language, the task will also appear in the listing for the Ruby programming language. ===Languages=== Some programming languages that are listed on Rosetta Code are: A list of all programming languages that have solutions to programming problems on Rosetta Code is available. ===Tasks=== Some tasks that are listed on Rosetta Code are: ==Related pages== * Example- centric programming ==References== ==Other websites== * Category:Wikis",
 "title": "Rosetta Code"
}