{
 "id": "72592",
 "text": "This is a list of Members of the Red Army Faction. After Andreas Baader escaped from jail in 1970, the media began referring to the \"Baader-Meinhoff Gang\". When Baader and Meinhof were arrested, they became known as the Red Army Faction. == First generation == These are the earliest members, from the late 1960s. The most important had all been arrested by 1972. Name Born Died Notes Andreas Baader 1943 1977 Suicide in prison, with Raspe and Ensslin Gudrun Ensslin 1977 Suicide in prison Baader and Raspe Ulrike Meinhof 1976 Suicide in prison Jan Carl Raspe 1977 Suicide in prison, with Baader and Ensslin Irmgard Möller Attempted suicide in prison, with Baader and Ensslin She was released from prison in the 1990s Astrid Proll Fled to England. Arrested and returned to Germany. She did not rejoin the Baader- Meinhof Gang after 5 ½ years in prison. Holger Meins 1974 hunger strike. Horst Mahler Lawyer and founder of the group. Released after 14 years in prison. He recently joined the right wing Nationaldemokratische Partei Deutschlands. Ingrid Schubert 1977 Committed suicide in prison two weeks after Baader Monika Berberich Horst Mahler's secretary. Helped Andreas Baader's escape in 1970. In a 1995 interview for a BBC documentary, she said she has not changed her passion against the \"fascism\" of the German state. Marianne Herzog 1939 girlfriend of Jan Carl Raspe Hans-Jürgen Bäcker Suspected by the gang to be working with the police. In 1974 he was tried and acquitted of taking part in the raid that rescued Baader. Thomas Weissbecker 1944 1972 Minor member of the Baader-Meinhof gang. Shot dead by the police. Wolfgang Grundmann 1948 Released from prison in 1976, after four years. Werner Hoppe 1949 Surrendered when Petra Schelm was killed. Imprisoned. Ingeborg Barz 1948 1972 Wanted to leave the gang. Disappeared and thought to have been killed by Baader. A decomposed body was found beside the autobahn near Munich in July 1973, believed, but not proven, to have been Barz's. Karl- Heinz Ruhland 1938 Ruhland provided detailed accounts of his time with the RAF and informed Police about the whereabouts of some safe houses. Uli Scholze 1947 Only involved with the Gang for a few months in 1970. Arrested and released the next day, he quit the Baader-Meinhof Gang and returned to college. In 2007 he was a professor (Prof. Dr.-Ing.) in Hochschule Reutlingen. Manfred Grashof 1946 An army deserter. Arrested 1972 in Hamburg He was sentenced to life imprisonment on June 2 1977. Heinrich Jansen 1948 He was known for getting drunk.. Arrested with Scholze, charged with attempted murder and sentenced to 10 years in prison. Petra Schelm 1950 1971 Shot at the police to try to escape arrest. Killed by a single gunshot wound through the eye. Brigitte Asdonk Arrested 1970 with Irene Goergens Peter Homann 1936 It is thought that he helped Meinhof free Andreas Baader from police custody in 1970, along with Ingrid Schubert, Gudrun Ensslin and Irene Goergens. In 1997 he gave an interview to Der Spiegel and said that Horst Mahler had \"sentenced\" Homann to death in Jordan in 1970 Ilse Stachowiak 1954 'Tinny' was one of the youngest members of the group. When she joined in late 1970 she was only 16 years old. She was arrested. In April 1971, given a short sentence and as soon as she was released she went immediately back to the gang. In 1972 she was involved in the bombing of the Springer Headquarters in Hamburg in which 17 people were injured. A month later the apartment she was staying in was wrecked by explosions. She survived and to escaped, but was rearrested on 1 February 1974 and imprisoned. Irene Goergens 1951 Daughter of an American soldier. She lived in a state home and it was there that she met Ulrike Meinhof (who was doing research for her movie Bambule). She was involved in the freeing of Andreas Baader in 1970 (along with Ingrid Schubert, Gudrun Ensslin, Peter Homann and Meinhof). She was arrested in October 1970 with Brigitte Asdonk. She was released from prison with remission on 13 May 1977 and did not rejoin the Gang. Beate Sturm 1950 Briefly joined the Baader- Meinhof Gang in late 1970. Sturm was often selected to go into shops to buy things because it was believed that she was the one who looked the most bourgeois. In January 1971, she decided she no longer wanted to live a life of crime. She called home and subsequently left the Gang without ever having committed any crimes. She later provided detailed information about the workings and structure of the gang. Eric Grusdat 1936 Was a mechanic who fixed stolen vehicles for the Baader-Meinhof Gang. He was arrested and imprisoned on 4 December 1970. Katharina Hammerschmidt 1943 1975 The gang used her house from around late 1970. Her house was raided by police and Hammerschmidt fled abroad. Arrested in 1972 she developed a brain tumour from which she died in 1975. Edelgard G also provided accommodation for Baader- Meinhof members around late 1970. However her house was raided by police and she was arrested. She was told by police that she would never see her child again if she did not make a statement and after 3 weeks she talked and was set free. A month or so later, Baader-Meinhof gang members tarred Edelgard, took a photo of her and sent it to a German press agency with a message that said; This is Edelgard G., an informer who is hand in glove with the killer pigs. Long live the RAF! Edelgard refused to make another statement when police questioned her again. ==Second generation Red Army Faction== Other young terrorists available to swell the shrinking ranks of the Gang. Like the first generation they were mostly middle class and a lot of them were students. A lot of them were terrorists who joined the Gang after their own groups dissolved (e.g. the Socialist Patients' Collective (SPK), J2M). Name Born Died Notes Karl-Heinz Dellwo 1952 Took part in the 1975 Occupation of the West German embassy in Stockholm. In July 1977 he was sentenced to two terms of life imprisonment for his participation in the Occupation, by a Dusseldorf Court. He was released in 1995. Klaus Jünschke 1947 Student member of the SPK, he escaped arrest when police came after members of the SPK in 1971. He joined the Red Army Faction. Arrested on March 2 1971. He was tried at a Kaiserslautern court and sentenced to life imprisonment in 1977. Hanna-Elise Krabbe 1945 Took part in the 1975 Occupation of the West German embassy in Stockholm. She was the only female terrorist involved in the occupation. Sentenced in 1977, to two terms of life imprisonment. Released from prison in 1996, after serving 21 years. Friederike Krabbe 1950 She is the younger sister of Hanna-Elise Krabbe. She is believed to have been one of the terrorists who kidnapped Hanns Martin Schleyer. According to Monika Helbing, after Schleyer was murdered in 1977, Krabbe fled to Baghdad along with Elisabeth von Dyck. Around this time Krabbe disappeared, and her whereabouts are still unknown today. Siegfried Hausner 1952 1975 Student member of the SPK and later the RAF, especially involved in the ‘working circle explosives.’ He was involved in the bombing of the Axel Springer Verlag on 19 May, 1972. In Stockholm he supervised the 1975 Occupation of the West German embassy in which he accidentally blew himself up, and died from serious injuries after being flown back to West Germany. Sieglinde Hofmann 1945 A nurse and social worker and a member of the SPK and the RAF. She was involved in many terrorist acts through the late seventies - most noticeably she was involved in the Jurgen Ponto murder, as well as Hanns Martin Schleyer kidnap/murder. She was arrested in Paris in 1980 and was sentenced to fifteen years imprisonment for her involvement in the Ponto murder, and in 1995, three days before her sentence was finished, she was tried again for other offences and sentenced to life imprisonment. Brigitte Mohnhaupt 1949 She was involved in the Jürgen Ponto murder, and the kidnap/murder of Hanns Martin Schleyer. Arrested in June 1972 in Berlin and was released in 1977 where she returned to her life of crime. She was re-arrested in 1982 and sentenced to five times life imprisonment. On February 122007 a court in Stuttgart ruled that she qualified for early release. Brigitte Mohnhaupt was released from the Aichach prison in Germany on March 252007, after serving 24 years of her sentence. Carmen Roll was a member of the SPK and the RAF. She was especially involved in; ‘working circle explosives’. In February 1971, Roll, along with Hausner, planned to bomb the President of the Federal Republic’s special train in Heidelberg station, but she arrived too late with the explosives and the plot fell through. In 1972, Roll was spotted with Tommy Weissbecker outside a hotel in Augsburg. Weissbecker was shot dead and Roll was arrested. Two weeks later she was given a near-fatal dose of ether by prison doctors. In 1976 Roll was freed from prison, she moved to Italy and became a nurse. Bernhard Rössner 1946 He was a school failure, took part in the 1975 Occupation of the West German embassy with him. The Occupation failed and Rössner was arrested and imprisoned. In July 1977 he was sentenced to twice life imprisonment for his participation in the Occupation, by a Düsseldorf Court. He was released in 1996. Margrit Schiller 1948 Student member of the SPK and was one of the members who turned militant in 1970. After the SPK dissolved Schiller joined the Red Army Faction. She was involved in the murder of a policeman in 1971 and was arrested. In 1979 she was released from prison. Lutz Taufer 1944 He had links with the SPK and he protested against the supposed torture of political prisoners in the Federal Republic in 1974. In 1975 he took part in the 1975 Occupation of the West German embassy in Stockholm, and was arrested after the Occupation failed and was subsequently imprisoned. In July 1977 he was sentenced to twice life imprisonment for his participation in the Occupation, by a Düsseldorf Court. He was released in 1996. Taufer has been living in Brazil with his sister since 1999. Elisabeth von Dyck 1951 1979 In 1975 Von Dyck, along with Siegfried Haag, was arrested on suspicion of smuggling weapons out of Switzerland and served six months in a detention centre in Cologne before being released. However a warrant went out for her arrest in 1977 stating that she supported a terrorist organisation. Von Dyck went underground and Monika Helbing stated that around this time she fled to Baghdad for a while with Friederike Krabbe. Von Dyck returned to West Germany at some stage between 1977 and 1979, and on the 4 May 1979, Von Dyck entered a house, thought to have been an RAF hideout, in Nuremberg which was under police surveillance. The police shot Von Dyck through the back, killing her. A gun was found on her body. Von Dyck was shot even though she was only suspected of being involved with the RAF, and was not a high-priority on the wanted list, however it was alleged that the police shot her after she first drew a pistol and aimed it at them. Ulrich Wessel 1946 1975 The son of a rich Hamburg businessman. Wessel was a millionaire. He was involved with the SPK and took part in the 1975 Occupation of the West German embassy in Stockholm. He died during the Occupation when the TNT was accidentally exploded; the force of the explosion startled him so much that he dropped a grenade he was holding and it exploded on him. He died soon afterwards. ==Third Generation Red Army Faction== This generation was active mostly throughout the 1980s and early 1990s. More vicious than their predecessors, they did not have as much cause as the earlier generations to rebel. * Wolfgang Grams * Birgit Hogefeld * Andrea Klump * Eva Sybille Haule- Frimpong ==References== * Jillian Becker Hitler's Children * Tom Vague Televisionaries: The Red Army Faction Story 1963-1993 * Baader-Mienhof.com Guide to Baader-Meinhof Gang Members * RAF information site * The Stoke Newington 8 Defence Group Armed Resistance in West Germany: Notes From The Red Army Fraction (1972) Red Army Faction Category:German terrorists Category:Red Army Faction",
 "title": "List of members of the Red Army Faction"
}