{
 "id": "726090",
 "text": "Katherine Megan McArthur (born August 30, 1971) is an American oceanographer and a National Aeronautics and Space Administration (NASA) astronaut. She has served as a Capsule Communicator (CAPCOM) for both the space shuttle and space station. Megan McArthur has flown one space shuttle mission, STS-125, where she served as Mission Specialist in repairing the Hubble Space Telescope. McArthur has served in a number of positions including working in the Shuttle Avionics Laboratory (SAIL). She is currently in space as the Commander of the NASA SpaceX Crew-2 mission to the ISS. She launched on 23 April 2021. == Childhood == Megan McArthur was born in Honolulu, Hawaii, to Don and Kit McArthur. Her father was a career naval aviator, and the McArthur family later relocated to the Moffett Field Naval Air Station, which shares the same base as NASA’s Ames Research Center. This is where her inspiration of become an astronaut grew. McArthur attended St. Francis High School in Mountain View, CA. She holds a Bachelor of Science in Aerospace Engineering from the University of California, Los Angeles, and a Ph.D. in Oceanography from the University of California, San Diego where she performed research activities at the Scripps Institution of Oceanography. Megan enjoys SCUBA diving, backpacking, and cooking. She is married to fellow astronaut Bob Behnken, and together they have one child. == Oceanography Career == At the Scripps Institution of Oceanography, McArthur conducted graduate research in nearshore underwater acoustic propagation and digital signal processing. Her research focused on determining geoacoustic models to describe very shallow water waveguides using measured transmission loss data in a genetic algorithm inversion technique. She served as Chief Scientist during at-sea data collection operations, and has planned and led diving operations during sea- floor instrument deployments and sediment-sample collections. While at Scripps, she participated in a range of in-water instrument testing, deployment, maintenance, and recovery, and collection of marine plants, animals, and sediment. During this time, McArthur also volunteered at the Birch Aquarium at Scripps, conducting educational demonstrations for the public from inside a 70,000 gallon exhibit tank of the California Kelp Forest. == NASA Career == Selected as a Mission Specialist by NASA in July 2000, McArthur reported for training in August 2000. Following the completion of two years of Astronaut Candidate training and evaluation, she was assigned to the Astronaut Office Shuttle Operations Branch working technical issues on shuttle systems in the Shuttle Avionics Integration Laboratory (SAIL). She has also worked in the International Space Station and Space Shuttle Mission Control Centers as a Capsule Communicator (CAPCOM) and has served as a Crew Support Astronaut for Expedition Crews during their six-month missions aboard the International Space Station. McArthur was the Astronaut Office Lead for visiting vehicles during the first commercial cargo missions to the International Space Station. Currently, she provides support to crews in training and aboard the International Space Station, as Deputy Chief of the Astronaut Office ISS Operations Branch. Megan McArthur was a member of the STS-125 mission to service the Hubble Space Telescope. McArthur was the ascent and entry flight engineer and was the lead STS-125 (May 11 through May 24, 2009). This was the fifth and final Hubble Space Telescope servicing mission. McArthur worked as the flight engineer during launch, rendezvous with the telescope, and landing. She also carefully retrieved the telescope, using the shuttle’s robotic arm, and placed it in the shuttle’s cargo bay. The 19-year- old telescope then spent six days undergoing an overhaul during 5 days of spacewalks. The spacewalkers were supported by McArthur operating the robotic arm. The team overcame frozen bolts, stripped screws, and stuck handrails. The refurbished Hubble Telescope then had four new or rejuvenated scientific instruments, new batteries, new gyroscopes, and a new computer. The STS-125 mission was accomplished in 12 days, 21 hours, 37 minutes and 9 seconds, traveling 5,276,000 miles in 197 Earth orbits. McArthur is currently assigned as the Commander of the NASA SpaceX Crew-2 mission to the ISS, scheduled to launch in April 2021 and return in the fall 2021. == References == Category:1971 births Category:Living people Category:People from Honolulu Category:Scientists from Hawaii Category:Scientists from California Category:American astronauts",
 "title": "K. Megan McArthur"
}