{
 "id": "726012",
 "text": "Matthew Julius \"Mat\" Taylor (born January 1971), better known by his stage name Techmoan, is a YouTuber and blogger who has been active since May 2009, featuring reviews of consumer electronics (or consumer tech) and \"RetroTech\" documentaries. He lives in Wigan, Greater Manchester. The Daily TelegraphWhy a dashcam could save you money on your car insurance, The Daily Telegraph, 11 April 2016 and GizmodoBryan Menegus: Yup, This Vertical Record Player Is Rad 6 May 2016Bryan Menegus: There's a Good Reason This Weird, Old Cassette Format Didn't Work Out, 31 August 2017Rhett Jones: Music Designed for an Oscilloscope Looks and Sounds Cool as Hell , 24 November 2016 has quoted his statements. MarketWatch listed the YouTube Channel 6th in its \"binge-watching\" top tenShawn Langlois: 10 YouTube channels for binge-watching, 19 July 2017 using ratings on Reddit. Websites such as AVclub, Gizmodo, Hackaday, El Español and Popular Mechanics reference his videos. == Career == In 2006, Taylor started a YouTube channel called \"Vectrexuk\", with videos of similar items of technology, such as installing a home cinema and controlled toasters, to prove people will watch anything on YouTube.Techmoan - Not the 10th Anniversary Show, 25 July 2017 The channel \"Techmoan\" was started on May 31, 2009. The first video uploaded on Techmoan was a tour of a 2009 Piaggio MP3, which was filmed at 480p and had a very basic sound quality. In 2015, he started another channel, called \"Youtube Pedant\", to host videos not about technology.About the YouTube Channel \"Youtube Pedant\" In 2016, in a video covering the DVHS format, he uncovered 1080p video footage of New York City from 1993. This footage was uploaded separately to his \"Youtube Pedant\" channel where, as of December 2019, it has received 3.8 million views, and it has also been widely shared on websites such as Reddit and The Verge. As of June 2019, the main channel has over 870,000 subscribers and over 180 million views. Some videos on the main channel have had over 3 million views. === Later documentary videos === Techmoan has made documentary videos that are about forgotten magnetic tape recording formats, such as the OMNI Entertainment System,MB OMNI Entertainment System - The 1980s 8-Track games machine., 6 August 2017 which uses 8-track tape storage, and the HiPac, a successor of the PlayTape and related uses of it. Other videos show some of the smallest and largest analog recording tape cartridges ever made, such as the PicocassetteThe Picocassette – Smallest Analogue Cassette Tape ever made, 2 August 2015 for dictation machines or the Cantata 700 background music system.Retro Tech: This 1960s BGM Machine played the Biggest Cassettes ever made, 11 May 2016 Further videos show other discontinued ¼-inch-tape cartridge formats, such as the Sabamobil,Forgotten Format: The Sabamobil, 22 June 2017 which uses existing 3-inch open reels in a portable format, and the portable Sanyo Micro Pack 35,Forgotten Format: SANYO Micro-Pack 35 Tape Recorder, 31 August 2017 as well as RCA tape cartridgeRetroTech: RCA Victor Tape Cartridge - A trailblazing failure, 22 September 2016 and the Sony ElcasetForgotten Audio Formats: DCC & Elcaset 6 May 2014 with another compromise of playtime and sound quality, oddities and gimmicks on Compact Cassettes as \"reinventing the reel\",TEAC O'Casse Open Cassette - Reinventing the Reel, 16 May 2015Audio Craft Cassette Cartridge: More music per pocket., 12 April 2017 several ways of autoreverse,Auto-Reverse: The Hard Way, 26 February 2016 automatic multiple cassette players,What a 10hr music playlist looked like in 1992, 30 December 2015Retro-Tech: The 1972 Desktop 'iPod', 14 August 2016 endless loop cassettes,Cassettes: Lenticular Classics & Endless Loops, 13 September 2016 and cassette mass production technology.Cassettes - better than you don't remember, 1 February 2016Pre-recorded Cassettes' Last Stand 24 January 2017 Other documentary videos Techmoan has made are about formats of vinyl recording, such as the TefifonVintage Electronics - The Tefifon, 6 April 2015Tefifon Update - more info, more music, bigger.... and smaller. 4 May 2015 endless cartridge, the Seeburg 1000 background music system,RetroTech: Seeburg 1000 BMS1 Background Music System (1959-1986), 28 February 2017Seeburg 1000 BGM Part 2: The DIY version, 1 March 2017 vertical turntables,Rescued 1980s Relic: The Sharp RP-114 Vertical Turntable, 9 June 2014 and other audio encodings CX and dbx, which are systems that were designed to reduce noise on vinyl records.CX Discs : Better, Worse & the Same as a normal record - A Forgotten Format, 19 October 2017 Further documentaries show other items, such as the mechanical Curta calculator,1950 Curta Calculator, 24 December 2014 devices with Nixie tube displays,The Nixie Watch, 15 March 2010 wire recording,Retro Tech: The Wire Recorder, 3 July 2016 and the WikiReader.WikiReader: the Internet without the Internet, 3 September 2018 ==References== == Other websites == * Techmoan YouTube Channel * Techmoan Website * Techmoan - Not the 10th Anniversary Show with an about introduction Category:1971 births Category:Living people Category:British YouTubers Category:People from Greater Manchester",
 "title": "Techmoan"
}