{
 "id": "726081",
 "text": "Yoshie Akiba (b. 1942, 秋葉好江) is the founder of an jazz club in Oakland, CA. The music club is famous internationally. She also started Elevate Oakland. Elevate Oakland brings music education to students in Oakland schools. Akiba teaches classes as California State University East Bay. She helps build Japanese cultural centers in California. == Early life == Akiba was born in Yokohama, Japan. Her parents both died when she was five years old. Her father died in a Russian World War II prison camp. Her mother died from tuberculosis. It was during World War II. She grew up in an orphanage in Zushi, Japan. She enjoyed music and dance. The orphanage was near a United States military base. The military invited orphans to give music performances. On the military base Akiba first heard jazz music. On the base, Akiba met a man who was an officer in the United States Navy. They got married when she was 19. They moved together to Baltimore, Maryland, United States, in 1963. Her husband promised she coul study dance in the United States. Akiba did not like the culture in Maryland. They divorced in 1968. She moved to Berkeley, California. She began studying dance at University of California, Berkeley. At Berkeley Akiba discovered Zen Buddhism. She had not been religious in Japan. Living in the United States she felt the need to stay connected to Japanese culture. She married her Berkeley friend Kaz Kajimura. The started a business toether. They divorced. They still ran their business together. Akiba later married Zen Buddhist priest Reverend Gengo Akiba. == Career == Akiba's career has focused on music and dance. She works on both music education and providing music performances. Akiba works to keep Japanese culture alive in California. === Yoshi's === Akiba wanted to remember Japanese culture. She worked with Kaz Kajimura and Hiroyuki Hori small sushi restaurant in Berkeley in 1973. Hori was the chef. In 1979 they moved the resturaunt to Oakland. Akiba and Kaz Kajimura liked attending jazz performances. In 1985 they started having jazz performances in the resturuant. Yoshi's moved to Oakland's Jack London Square in 1997. The new resturaunt space had 310 seats in the club, a seperate 250 seat restaurant, and a 60 seat bar. They could have much larger performaces. They could also continue to represent Japanese culture in the resturuant space and represent jazz culture in the club space. Famous performers have included Chick Correa, Wynton Marsalis, Sarah Vaughan, Max Roach, Carlos Reyes, Pete Escovedo, Arturo Sandoval, Oscar Peterson, Betty Carter, Dee Dee Bridgewater, and Pharoah Sanders. The same year, Akiba won the 1997 Global Award for Outstanding Community Leadership. In 2007, Akiba and her partners opened a second Yoshi's location in San Francisco's Filmore District. Despite multiple bailouts from the city of San Francisco, it eventually sold to a large corporation. However, the Oakland location survived, even the COVID-19 lockdown. In 2022, Yoshi's celebrated its 50th anniversary. === Teaching === Akiba teaches about the Japanese Tea Ceremony. She teaches at California State University East Bay and in her own home. Her home in Oakland also includes a Zen meditation space, the Oakland Zen Center, that is open to the public once a week. Teaching the traditional ceremony is a way of teaching about Buddhism. === Elevate Oakland === In 2012 Akiba and a teacher named Jason Hofmann started 51Oakland. Akiba remembers that music made her feel better when her life was hard. She wants students in Oakland, California, to learn about music also. She wants students to know they can work hard at something they enjoy and have success. 51Oakland brings musicians to school to talk to students about surviving hard lives. The organization also offers music lessons and organizes student performances at Yoshi's. Artists like Stevie Wonder help support the organization. The organization is now called \"Elevate Oakland.\" Shiela E. and Lynn Mabry are also leaders of Elevate Oakland. == References == Category:Living people Category:California State University faculty Category:1942 births",
 "title": "Yoshie Akiba"
}