{
 "id": "726056",
 "text": "Maha Elgenaidi is an activist in the United Sates. She fights Islamophobia. Elgenaidi works to normalize the existence of Muslim Americans in communities in the United States. She fights for safety of Muslim Americans. She also fights all hate based on religion, including Antisemitism. Elgenaidi organizes interfaith conversations. She is best known for founding Islamic Networks Group (ING). She is recognized as a \"prominent Islamic American writer.\" == Early life == Elgenaidi's family came to the United States from Egypt. Her parents suggested she return to Egypt for college. They wanted her to learn about her background. She decided to study math at the American University in Cairo. She graduated with degrees in economics and political science. She returned to the United States to attend graduate school. Growing up, Elgenaidi worried that Islam was sexist. She did not follow Islam. After returning to the United Sates she started learning about Judaism, Buddhism, and Christianity. She then studied Islam. She changed her thinking about her own religion. She decided that Islam was very inclusive to other religions. She decided that the best way to change someone’s views is to educate them. == Career == Elgenaidi's first work was in market analysis. Maha’s career started when she noticed that people were thinking badly about Muslims and the religion of Islam. She noticed that many of these unkind thoughts were from lack of education. This led to her career in educating people about Islam. She has worked with the general public, police, businesses and health care workers.Economides, E. (2006, November 20). Islamic Network Group builds bridges, informs community. Oakland Tribune, The (CA). Her goal was to help other Americans see Muslim Americans as real people. === Islamic Networks Group === Elgenaidi and Ameena Jandali founded Islamic Networks Group in 1993.Mattson, I. (2006). Women, Islam, and Mosques. In R.S. Keller & R.R. Reuther (Eds.), Encyclopedia of Women and Religion in North America (615-619). Indiana University Press. p. 618.Yuskaev, T. and H. Stark (2022). The American 'ulama' and the public sphere. In R. Tottoli (ed.), Routledge Handbook of Islam in the West, 2nd edition (357-373). New York: Routledge. p. 364. It is located in the San Francisco Bay Area, in California, United States. Their original name was \" Bay Area Media Watch.\" They wanted fight against incorrect comments about American Muslims in the media. After six months they decided that getting angry at the media was not helpful. It was better to educate reporters. They started having \"conversations\" with news companies about new ways to write about Muslim Americans. First they worked with around fifty media companies in the San Francisco Bay Area. Then, Elgenaidi worked with other news companies, like The New York Times, The Wall Street Journal, Time and Newsweek. Elgenaidi and ING started a Speaker's Bureau and trained other Muslim Americans to talk about Muslim people in America and religious pluralism. By 2006, ING had speakers in 20 states, Canada and the United Kingdom. ING was a founding member of the Obama administration's \"Know Your Neighbor\" campaign to fight islamophobia and antisemitism. The White House selected ING to continue Know Your Neighbor when Donald Trump was elected president in 2016. ING now has three speakers bureaus, including teen and adult speakers: Intercultural Speakers Bureau, the Interfaith Speakers Bureau, and the Islamic Speakers Bureau. They train teachers in all fifty states. ING's main focus is organizing a group of educators who go to different communities and schools to teach people about Islam. She has won many awards for her efforts, including the Civil Rights Leadership Award, Citizen of the Year, and Dorothy Irene Height Community Award. == References == Category:Living people Category:People from California Category:Year of birth missing (living people) Category:American activists",
 "title": "Maha Elgenaidi"
}