{
 "id": "726027",
 "text": "Dan Arne Tillberg (born 9 April 1953 in Ystad) is a Swedish artist and producer. He is the son of Arne Tillberg and Ettie Tillberg.Sveriges befolkning 1970, (CD-ROM version 1.04) Sveriges Släktforskarförbund 2003 ==Career== Dan Tillberg started his career in 1973 as a singer, guitarist and percussionist in the progg-influenced duo Änglabarn, along with Sven Ingmar Olsson. In 1977, he started his own recording studio in Malmö, Bellatrix, and a record label of the same name in 1978. In 1979, his first LP, Gatstenar, came out, which had Swedish-language cover versions of Rolling Stones songs on it. In 1981, this was followed by the LP Mors och fars kärlek, which made him successful. The next year, his next LP, Kärlek minus noll, came out, which featured Swedish-language cover versions of Bob Dylan songs. In 1983, his next LP, \"Genom tårar\", was released, followed by \"Erogena zoner\" in 1985, which might have become his biggest success. In Melodifestivalen 1985, he came in second place with \"Ta min hand\", and also took part in Melodifestivalen 1986 with \"ABCD\". In 1987, his LP \"Raka vägen till paradiset\" was released, which was his last LP released before a long break. In 1986, Tillberg starred in an episode of the TV series \"Skånska mord\", with Ernst-Hugo Järegård in the lead role. After that, he became less popular, and he went on to run an advertising company, which became bankrupt in 2001.http://sydsvenskan.se/malmo/article9651.ece Tillberg anmäld för grova skattebrott – Malmö – Sydsvenskan – Nyheter dygnet runt] Then he began to devote himself to music again and released some CD singles. These were followed in 2005 by Akten tar gestalt, an album that came out on two CDs and has a collection of his old songs on it, released on Mixed Media Records, a record label he started with Rickard Mattsson, also in 2005. The record label, which borrowed its name from the band Mixed Media, which was previously signed to Tillberg's former record label, Bellatrix, is now bankrupt,Kvällsposten 16 april 2008: Krävs på 35 000 – för ett kök han inte vill ha . Retrieved 19 September 2014. and the record label business with the associated recording studio has ended. While Tillberg worked as a producer, he was active in the kitchen industry through the companies Köket i första rummet AB and Skånekök & Måleri AB.Sydsvenskan 26 maj 2010: Förskottsbetalda kök levererades inte . Retrieved 19 September 2014. ==Music== *1973 – Änglabarn (LP) *1979 – Gatstenar (LP, Rolling Stones) *1981 – Mors och fars kärlek (LP) *1982 – Kärlek minus noll (LP, Bob Dylan) *1983 – Genom tårar (LP) *1985 – Erogena zoner (LP) *1987 – Raka vägen till paradiset (LP) *2005 – Akten tar gestalt (double CD) == References == Category:1953 births Category:Living people",
 "title": "Dan Tillberg"
}