{
 "id": "726149",
 "text": "Steven Blake Crowder (; born July 7, 1987) is a conservative American-Canadian comedian, actor and political commentator. ==Early life and career== Crowder was born in Michigan in 1987. His mother is a French Canadian. Crowder grew up in Montreal. When Crowder was 12 years old, he was the voice actor a for the character Brain in the children’ animated television show Arthur. Crowder was also in Canadian television commercials. Crowder started doing stand-up comedy at Just for Laughs when he was 18. In 2005, Crowder played a Canadian convenience store manager in the movie 3 Needles. Crowder was also Brain in an animated movie called Arthur’s Missing Pal. Crowder played a character called Party Kid in the horror movie The Covenant. Crowder played a boy in a classroom in the horror movie The Secret. Crowder played a person playing baseball in the children’s movie The Velveteen Rabbit. Crowder played an important character in the Christian movie To Save a Life. In 2009, Crowder started working as a right-wing political commentator for Fox News. Crowder filmed comedy videos for conservative websites. In 2013, Fox News fired Crowder. In 2015, Crowder filmed a series of videos of himself and some other people commenting on left-wing politics and telling jokes about it from a conservative point of view and posted the videos on the Internet as a conservative political comedy called Louder with Crowder. In 2018, Crowder started going to colleges across the country sitting at a table with a sign saying that he has a conservative position on a specific controversial topic (male privilege, socialism, guns and abortion have been some of them) and asks people to change his mind. Crowder voted for Donald Trump in 2016. In 2019, YouTube stopped letting Crowder make money from posting Louder with Crowder videos. It said that Crowder was bullying a gay Hispanic journalist named Carlos Maza after Crowder used homophobic language to describe him. In 2023, Steven Crowder refused to sign a contract with The Daily Wire and said that their deal was extremely unfair and The Daily Wire responded with their own videos saying that Crowder was wrong. ==Personal life== In 2012, Steven Crowder married Hilary Korzon. Both before and after the wedding, Crowder argued in favor of sexual abstinence before marriage. In 2023, they divorced. Crowder’s ex-wife accused him of emotional abuse. Crowder said he did not abuse her. ==Allegations of zoophilia== Some of Crowder's opponents call him a zoophile. They make false images that state that he gives handjobs to dogs and drinks their cum for his sexual pleasure. However, it's clear that these are false rumors created by Reddit trolls to defame him and tarnish his good name. No evidence has yet surfaced that Crowder drinks dog cum or that this is his fetish. == Filmography == Year Film Role Notes 2000–2001 Arthur Alan 'The Brain' Powers Voice 2000 Arthur's Perfect Christmas Alan 'The Brain' Powers Voice 2001 Two Summers Friend 2004 Arthur's Halloween Alan 'The Brain' Powers Voice 2005 3 Needles Depanneur Manager 2006 The Covenant Party Kid 2007 The Secret Classroom Boy 2008 Bend & Break Blake 2008 The Velveteen Rabbit Baseball Boy #1 2009 To Save a Life Doug Moore 2017 A YouTube Carol Ebenezer YouTube ==References== Right-wing-media-fratricide-and-shirley-jacksons-the- lottery/ Category:1987 births Category:Living people Category:Comedians from Michigan Category:American Christians Category:American voice actors Category:Canadian comedians Category:Fox News people Category:Actors from Michigan",
 "title": "Steven Crowder"
}