{
 "id": "726390",
 "text": "The Chipko movement was a group action in India with the goal of saving trees. This is mainly done through the act of hugging trees to protect them from being cut. It was also known as Chipko Andolan. Those who were part of it used nonviolent protests. The Chipko movement began in the early 1970s in Uttarakhand. It then spread to Uttar Pradesh. By the 1980s it had spread across most of India. The Chipko leads to a change in policies to stop the clear cutting of trees in some regions.The women of Chipko Staying alive: women, ecology, and development, by Vandana Shiva, Published by Zed Books, 1988. ISBN 0-86232-823-3. Page 67. (Clear cutting is a type of logging where all trees in an area are cut down). Chipko movement was started by Sunderlal Bahuguna. The name of the Chipko moment originated from the word 'embrace' as the villagers used to hug the trees and protect them from wood cutters from cutting them. In 1731, the king of Jodhpur in Rajasthan asked one of his ministers to arrange wood for constructing a new palace. The minister and workers went to a forest near a village, inhabited by Bishnois, to cut down trees. A Bishnoi woman Amrita Devi showed exemplary courage by hugging a tree and daring king’s men to cut her first before cutting the tree. The tree mattered much more to her than her own life. Sadly, the king’s men did not heed to her pleas, and cut down the tree along with Amrita Devi. Her three daughters and hundreds of other Bishnois followed her, and thus lost their lives saving trees. The incident inspired the several other rural women, who launched such similar movements in different parts of India. The Chipko Movement gained momentum under Sunderlal Bahuguna, an activist, who spent his whole life persuading and educating the villagers, to protest against the destruction of the forests and the Himalayan mountains by the government. The Chipko protests achieved a major victory in 1980 with a 15 years ban on tree felling in the Himalayan forests of the state by the order of Mrs. Indira Gandhi. Now, even an Amrita Devi Award is given to those involved in wildlife protection and conservation. == References == Category:20th-century protests Category:Organizations based in India",
 "title": "Chipko movement"
}