{
 "id": "726317",
 "text": "The Caine Mutiny is a 1951 Pulitzer Prize winning war novel by American Jewish author Herman Wouk. In 1953, Herman Wouk wrote a play called The Caine Mutiny Court Martial based on the trial from the book and in which Henry Fonda played Greenwald. In 1954, there was a movie based on the book, in which Humphrey Bogart played Queeg. ==Synopsis== Willis Seward Keith has graduated Princeton University studying literature. Willie’s mother wants him to continue his studies and get a masters degree. Willie plays piano and wants to go into show business. As a result, Willie meets and starts dating a singer whose stage name is May Wynn. Then the Japanese bomb Pearl Harbor and Willie is afraid he’ll have to be sent to the army. So that that doesn’t happen, Willie joins the Navy. Willie is assigned to a ship called the USS Caine. He hates the captain for being too laidback and easygoing and sarcastic and not caring about how things look. The captain is then replaced by a new captain named Queeg. Queeg is mean, gets very angry is almost paranoid and always wants everything to be done his way. Queeg makes everyone on the Caine miserable. Tom Keefer, who is trying to write a novel about how horrible the navy is can’t get any work on his book done so he tries to convince Steve Maryk, who is Queeg’s second in command, that Queeg is insane and cannot command a ship in a time of war. Maryk doesn’t want to believe Keefer but then the ship ends up in the middle of a typhoon. Since there is no written rule about how to get out of a typhoon, Queeg tries to get out by following the rule to avoid getting into a typhoon. Since it doesn’t seem to be working Maryk decides Queeg is insane and takes over as captain with Willie’s help. Queeg has them put on trial for mutiny as soon as they get back to the United States. A Jewish lawyer named Lieutenant Barney Greenwald agrees to defend them because no one else will. When the trial begins, Willie realizes that the reason he helped Maryk wasn’t because he thought Queeg was crazy but because he hated Queeg. He still admits to what he’s done in the trial. Keefer, on the other hand, lies to the jury and says he knew nothing about the mutiny until after it happened. Greenwald still wins the trial by getting Queeg to get angry and act like he is completely crazy. Greenwald then goes to Maryk, Keefer, and Willie and tells them that they are guilty and that if there were anyone else willing to defend them he would have been the one to prosecute them. Greenwald says Queeg was actually a hero because while Willie was at Princeton and Keefer was writing his books and Greenwald was defending the Cherokee, Queeg was risking his own life to protect the country so that Greenwald’s mother didn’t get melted down into a bar of soap by the Nazis. Greenwald calls Keefer a coward for having convinced Maryk to mutiny and then betrayed Maryk during the trial. Greenwald then throws wine at Keefer’s face and says he’ll be waiting in the lobby if Keefer wants revenge and that since they are both drunk it will be a fair fight. Maryk is fired from the Navy and Keefer becomes captain. A Japanese kamikaze crashes his plane into the ship, so Keefer jumps and abandons the crew to save his own life. Willie stays on board and actually risks his own life to save everyone else and actually manages to do that. Willie then starts thinking about what is important and decides that he should marry May Wynn and have kids with her. When he comes back to America, she is using her real name and working for a soon to be divorced man who wants to have sex with her though they have not yet since she is not going to have sex with someone to whom she is not married. Willie then meets the man and he realizes that he reminds him of Keefer. Willie then knows that he can and will win her back. Category:1951 books Category:20th-century American novels",
 "title": "The Caine Mutiny"
}