{
 "id": "726816",
 "text": "Background music (British English: piped music) is music that is not the main focus. It is chosen to affect how people feel and act, like helping them concentrate or relax. People often cannot control its volume or content. The effects of background music can change based on where and when it is played. Background music is played in places with no people, like hallways or restrooms. It is also used during phone calls and in video games. It is usually played softly from many small speakers. Music can help people think better and process more information. Background music became popular in the 1930s with Muzak. It was simple and repetitive music. Today, it is used worldwide and is based on research about how it affects shoppers and workers.Lanza, Joseph. Elevator Music: A Surreal History of Muzak, Easy-listening, and Other Moodsong, University of Michigan Press (2004) Background music is used in many places like doctor's offices and airports. Many styles of music are used, but not songs with words or complex music. Some people think background music is low-quality. Some composers write music just for background music companies. Studies show background music can make people spend more money in stores.Milliman, R.E. (1982). Using Background Music to Affect the Behavior of Supermarket Shoppers. Journal of Marketing. 46(3). 86–91. ==Types== ===Incidental music=== Incidental music has been used since ancient Greek drama. Many classical composers wrote incidental music for plays. Famous examples include Henry Purcell's Abdelazer music, George Frideric Handel's The Alchemist music, Joseph Haydn's Il distratto music, Wolfgang Amadeus Mozart's Thamos, King of Egypt music, Ludwig van Beethoven's Egmont music, Carl Maria von Weber's Preciosa music, Franz Schubert's Rosamunde music, Felix Mendelssohn's A Midsummer Night's Dream music, Robert Schumann's Manfred music, Georges Bizet's L'Arlésienne music, and Edvard Grieg's Peer Gynt music. These pieces are often played in concerts without the plays. Vocal incidental music sets the tone for films with beats or sounds to show emotions. Unlike Broadway or film musicals, incidental music is not essential to the work and many plays have no incidental music. ===Furniture music=== Erik Satie coined the term furniture music in 1917. He made three sets of compositions: Musique d'ameublement (1917), Sons industriels (1920), and Tenture de cabinet préfectoral (1923). The genre fell into disuse after Satie died but was revived later. Furniture music is played during awkward pauses to help audiences stay immersed in the performance. It consists of short musical passages repeated many times.Hervé Vanel. Triple Entendre: Furniture Music, Muzak, Muzak-Plus, Oxford Academic (2013), ch.1 ===Muzak / Elevator music=== Elevator music, also known as Muzak, is played in places where many people gather and during phone calls on hold. It usually features simple instrumental themes from \"soft\" popular music or \"light\" classical music played by slow strings. Modern elevator music can be computer-generated. It can also include easy listening, piano solo, jazz, middle of the road music, or \"beautiful music\" radio stations. ===Corporate music=== Corporate music is background music for company presentations. It is subtle and unobtrusive. It is different from \"corporate pop,\" which is pop music produced by corporations. ===Video game music=== Video game music (VGM) is the soundtrack for video games. It can be original music composed for the game or preexisting music licensed for use in the game. VGM can be heard on the game's title screen, menus, and during gameplay. Sometimes, video game soundtracks are released separately, like with GTA V's in-game \"radio stations\". ===Website music=== The early social media website Myspace allowed users to set specific songs to play automatically on their profile pages. ===Group fitness music=== With the rise of boutique fitness classes in the late 2010s, there is more focus on properly licensing music for group fitness classes. The licensing and cost structures are different because the music is more interactive than traditional background music. ===Internet-delivered background music=== Internet-delivered background music is provided by companies like Mood Media, which acquired Trusonic and Muzak. This allows retailers to update music and messages instantly at the store level instead of using older compact disc and satellite technologies. This technique helps convey more meaning and emotions in the work. ==Background non-music== ===Business audio=== Business audio is sound used in businesses. It is licensed to be played in public places. Business audio can include news or background music. Some companies that provide business audio are: * Cloud Cover Media, Inc. * StoreStreams Inc * Muzak Holdings LLC * DMX * PlayNetwork * MTI Digital * XM for Business * Music Choice * CUSTOMtronics Sound * Applied Media Technologies Corporation * Trusonic * Couture Media, Inc. In the United States, \"elevator music\" and \"Muzak\" are common terms for business audio services in stores. ==History== Muzak was started in 1934. It was one of the first companies to provide background music. Business audio is made in one place and sent to clients in different ways. These include satellite, cable, radio, internet, CDs, and tapes. Most music is only for personal use. Business audio services let clients use music in public places by paying fees to music rights groups like ASCAP, BMI, SESAC, and GEMA in Germany. ===Historical devices=== * The 1959 Seeburg 1000 was a record player that could play up to 1000 songs from special records. * The Rowe Customusic used tape cartridges and could play six at once. * The 1964 3M Cantata 700 used large tapes that could play for up to 26 hours. * The Reditune system by Rediffusion was popular in the UK in the 1960s. ==Related pages== * Soundtrack ==References== ===Works cited=== * Britannica, The Editors of Encyclopaedia. \"incidental music\". Encyclopedia Britannica, 18 Dec. 2014, https://www.britannica.com/art/incidental-music * BridgeTTC. “What Is Acting?” The Bridge Theatre Training Company, 18 Apr. 2023, http://www.thebridge-ttc.org/what-is-acting/#:~:text=The%20purpose%20of%20acting%20is * Potter, Caroline. Erik Satie: A Parisian Composer and His World. NED-New edition, Boydell & Brewer, 2016. JSTOR, http://www.jstor.org/stable/10.7722/j.ctt18gzfkq. Accessed 29 Apr. 2024. * MFP, JEAN. “Importance of Background Music | Music for Productions.” Music for Productions, Stock Music, Production Music, 6 Oct. 2020, http://musicforproductions.com/importance-of-background-music-in-your-videos-2/ Category:Music Category:Psychology Category:Broadcasting",
 "title": "Background music"
}