{
 "id": "72706",
 "text": "The United Arab Republic (UAR) was a country in the Middle East. The UAR was a political union between Syria and Egypt from 1958 till 1961. It came into being on the first of February 1958. It was the first step towards a pan- Arabic state. Over 33 million people lived in the UAR. The capital of the UAR was Cairo, which was also its biggest city. Other big cities in the UAR include: Aleppo, Damascus, Alexandria and Giza. The flag contains three stripes: red, white and black. Which stand for (in aforementioned order): The Hashemite dynasty which represents the bloody fight for freedom, the Umayyad dynasty which represents a bright and peaceful future and the Abbasid dynasty, which represents strong rule. The green stars represent the Fatimid dynasty which represents Egypt and Syria together. == UAR's history == === Origins === In 1952, after the creation of the Republic of Egypt, Gamal Abdel Nasser pursued the unification of all Arab nations, Pan-Arabism. Another keypoint of this ideology was to rid the Arab world from Western influences. From 1952-1952 he served as Egypt's prime-minister and from 1954-1970 he served as Egypt's president. Syria's and Egypt's relations improved in 1955 when they signed their first military agreement. In 1958 the Syrian government proposed a union with Egypt. The Syrian government feared a communist take-over and they felt intimidated by the Baghdad pact which included neighboring Jordan and Iraq. There was also the threat of war with Turkey after skirmishes at the border. In Syria the worker's unions and the socialist party thought that a union with the socialistic Egypt of Nasser would help speed up the process of Syria's ‘conversion’ to socialism. Also the landowning elites and the bourgeoisie thought the union with Egypt would improve the economic situation in Syria. For Nasser it was an opportunity to make the first step in his dream of creating a Pan-Arab nation. On the first of February 1958 the union was formed. === Political history === In contrast to the expectations of Nasser's Syrian supporters (mostly advocates of the Syrian Ba’ath Party), Nasser was not aiming at an equal control of power between the two countries. This governmental structure (announced on March 6, 1958) consisted of twenty Egyptian ministers and fourteen Syrian ministers. Only Egyptians got the highest positions in the government and this unbalanced division of power caused a disruption in the trust of Syria in Egypt. In October 1958, Sabri al- Asali, a Syrian vice-president, was compelled to resign due to his involvement in interventions for an Iraqi-Syrian union. This was followed by a reconstruction of the central cabinet which then consisted of fourteen Egyptian ministers and seven Syrian ministers. This was the starting point of a system wherein the central cabinet was in charge of the general policymaking and the regional cabinet controlled the day-by-day administration. In the winter and spring to 1959–1960, Ba'th ministers removed themselves from the cabinet and simultaneously the Syrian resistance to the UAR grew. While the Syrian region of the UAR experienced frequent political changes, the Egyptian area experienced a stability. The Syrian instability was a result of the constant replacement of resigning ministers and ministers that got removed from the cabinet. To create a stable impression of the UAR, Nasser tried to replace the resigned Ba’th ministers with notable political figures who then would support the political basis of the regime. Furthermore, right-wing politicians got approached by Nasser. The unsuccessful attempt to bring them to the government was by cause of Nasser's doubtful promises. === Collapse === The decline of support in the union between Syria and Egypt, the fading popularity of the president and the instability of the government formed the first fractions in the UAR. Nasser's economic reforms in 1960 failed in aligning Syria's economy with that of Egypt. Instead, Nasser, for example, nationalized banks, revised textbooks to strengthen Egypt's Arab identity, and curtailed the land limit. This new UAR identity was embodied by the new flag that was announced in 1958. The nationalized UAR opposed Egyptian on a weakened Syria. The expectations of a union of Syrian and Egypt societies got surpassed by Nasser's socialist systems that dominated the UAR. Wanting to subordinate the Syrian army officers, Nasser evoked extreme resentment from Syria. The constant diminishes of Syrian influence led to the Syrian coup d'état in September 1961, ending the UAR. The United Arab States, the UAR's affiliation with Yemen, was disbanded shortly afterwards. Egypt tried to save the union, but they were unsuccessful. Even after Nasser's death in 1970, Egypt was still referred to as “the United Arab Republic”. ==References== Category:1957 establishments Category:1961 disestablishments Category:Former countries in Africa Category:Former countries in the Middle East Category:20th century in Egypt Category:20th century in Syria",
 "title": "United Arab Republic"
}