{
 "id": "727127",
 "text": "Marcus Rashford (born 31 October 1997) is an English footballer. He plays as a forward for Manchester United and the England national team. Rashford has been with Manchester United since he was seven years old. He made his debut for the first team in 2016 in a game against Midtjylland. He scored two goals in that game, and two more in his next game against Arsenal. Rashford also scored in his first game for the England national team in May 2016. Rashford also campaigns on issues of child food poverty and literacy in the UK. Rashford was awarded Member of the Order of the British Empire for his charity work. In addition, he was also awarded an honorary doctorate from the University of Manchester. == Club career == === Early life and career === Marcus Rashford was born in Wythenshawe, a town in south Manchester. He started playing football at the age of five for Fletcher Moss Rangers. When he was seven, Rashford started at the pre-academy program at Manchester United. Rashford was playing with the Manchester United under-18 team when he got a call to the first-team. Rashford has said that the Brazilian footballer Ronaldo was his idol growing up. === Manchester United first team === ==== 2015-16 season: debut ==== Rashford was on the bench on 21 November 2015 when Manchester United won 2-1 against Watford. His first start was against Midtjylland in the UEFA Europa League. Anthony Martial was injured in the warm-up to that game, and Rashford replaced him in the starting team. Rashford scored two goals in the game and United won 5-1. Three days later, he started in the game vs Arsenal. In that game, he scored two more goals and provided an assist. United won 3-2. In the 2015-16 season, Rashford scored a total 8 goals in 18 appearances, and won the FA Cup. ==== 2016-17 season ==== Marcus Rashford took number 19 for the new season. Rashford won the EFL Cup with Manchester United in 2017. Rashford scored the crucial winning goal in the Europa League quarter-final. He also started in the Europa League final. Manchester United won 2-0 against Ajax to win the trophy. In total, Rashford scored 11 goals and made 6 assists in the 16/17 season. ==== 2017-18 season ==== Rashford scored against Basel in his UEFA Champions League debut on 12 September. With that goal, he had scored in his first appearances in six different competitions. He scored 13 goals in 52 appearances in the 2017-18 season. ==== 2018-19 season ==== Rashford got the number 10 shirt after Zlatan Ibrahimović left Manchester United. Rashford had a successful season, scoring 13 goals and assisting 9. Rashford helped Manchester United reach the quarterfinals of the UEFA Champions League. United defeated PSG in the process, with Rashford scoring the decisive goal. ==== 2019-20 season ==== The 2019-20 season was Rashford's best season by stats so far. In total, Rashford scored 22 goals including 17 in the Premier League. During the season, he struggled with a back injury. This limited his total game time. ==== 2020-21 season ==== Rashford scored 21 club goals in the 2020-21 season and made 15 assists. He enjoyed a particularly good goal-scoring run in the UEFA Champions League. In that competition, he has scored 6 goals in 6 appearances. Rashford was selected for England national team squad in Euro 2021. == Style of play == Marcus Rashford plays either as a center forward or a wide forward. Rashford has said that he prefers playing as a left winger. Rashford uses his speed and dribbling to play direct football. These qualities make him more effective on the wings. == Personal life == Rashford comes from a working class family; his mother is Melanie Maynard, a single parent who often had to work multiple jobs to feed their family, sometimes skipping meals herself to ensure Rashford and his siblings ate.In 2012, Rashford was invited to an England under-16 training camp, and was later selected to play in the Victory Shield against Northern Ireland under-16s in September, and Wales under-16s in October. Under-16's manager Kenny Swain later revealed that Rashford only played two appearances for the side due to an understanding with coaches at Manchester United regarding him being underdeveloped physically, and also thought the exposure would have been \"too much\" for him. Three weeks after making his senior début for United in early 2016, Rashford made his first appearance for the England under-20 team, providing an assist for Kasey Palmer in a 2–1 defeat to Canada under-20s. Despite already making his senior début earlier in the year, Rashford was called up to the England under-21 team for the first time in August 2016 for a fixture in September against Norway under-21s. He scored a hat-trick in the 6–1 home victory over Norway in his only appearance for the team, scoring the third with a penalty, his first since turning professional. Under-21 manager Gareth Southgate praised Rashford for his humility in dropping down to under-21 level. Despite having already made his senior tournament début, it was expected Rashford would be available for selection for the 2017 UEFA European Under-21 Championship, with the hopes of gaining more tournament experience. United manager José Mourinho responded to these reports by stating it would make no sense for his development as he was already playing senior football. In April 2017, Mourinho appeared to concede Rashford would attend the tournament, saying he had no right to stop him from participating, but later in the month reiterated his opinion that dropping down wouldn't make sense, with Rashford having gained so much senior experience throughout the season. In May, Rashford made the decision not to go to the tournament, and was instead selected for the senior squad by Southgate, the new manager. Southgate praised the decisions taken by United coaching staff in helping maximise the potential of Rashford by not allowing him exposure at youth level for England, saying his development had been handled well by all parties. === Charity and activism === Rashford has teamed up with poverty and food waste charity FareShare to provide meals to poor schoolchildren in the Greater Manchester area. Because of COVID-19 related lockdowns, schoolchildren were not receiving free school meals during this time. Eventually, the charity was able to raise enough money to reach four million children across the country. On 15 June 2020, Rashford wrote an open letter calling for the UK government to end child poverty. Bowing to the building pressure, the government extended free school meals for children during summer holidays. On 1 September, Rashford collaborated with multiple parties to create Child Food Poverty Task Force to help further this cause. In October, Rashford was appointed Member of the Order of the British Empire. == References == Journal of Physics A: Mathematical and Theoretical, Volume 40, Number 28 Category:1997 births Category:Footballers from Manchester Category:2018 FIFA World Cup players Category:Association football forwards Category:Black British sportspeople Category:Living people Category:Manchester United F.C. players Category:Premier League players Category:UEFA Euro 2016 players Category:2022 FIFA World Cup players",
 "title": "Marcus Rashford"
}