{
 "id": "727260",
 "text": "Glide is a 3D graphics API made by 3dfx Interactive for their Voodoo Graphics 3D accelerator cards. It was proprietary at first, then 3dfx later made it open source. It was only designed to draw graphics, mostly geometry and texture mapping, in data formats like those used in their cards. It was popular in the late 1990s because 3Dfx 3D accelerator cards were widely used, but became obsolete because Microsoft's Direct3D got better, full OpenGL implementations from other graphics card vendors came out, and 3D hardware became more diverse. == API == Glide is based on the basic geometry and \"world view\" of OpenGL 1.1. That version of OpenGL is an API that has 336 calls, most of which were not of use to draw graphics for video games at the time. Glide was designed to only have the features that were of use to draw graphics for video games at the time. The allowed the API to be small enough to fully run using late-1990s hardware. == Use in games == Voodoo cards dominated the video game market during the last half of the 1990s because they ran fast and Glide was easy to use. The name Glide was chosen to reference OpenGL, which it was based on, while being different enough to not make trademark problems happen. == Glide wrappers and emulators == Glide emulator development started in the late 1990s. Before 3dfx ended, the company tried very hard to stop these attempts, ending early emulation projects using legal threats. Before it ended and Nvidia bought its assets, 3dfx made the Glide API, and also the Voodoo 2 and Voodoo 3 specifications, open source. It later became an open source project. No games released after 1999 only support Glide for 3D acceleration (Direct3D and OpenGL are used instead), but Glide emulation is still needed to run older games with hardware acceleration. Because the specifications and code are now open source, multiple emulators and wrappers are available that allow older games that use the Glide API to run on non-Voodoo hardware. Other projects, such as Glidos, allow even older games to use Glide. == Related pages == * Vulkan (API) * 3dfx Interactive * MiniGL * Mantle (API), another low-level API == References == == Other websites == * Glide SourceForge Project * GLIDE programming manual * Glide Wrappers List * OpenGL Documentation Category:Computer graphics Category:Software",
 "title": "Glide (API)"
}