{
 "id": "727228",
 "text": "Mikey Madison (born Mikaela Madison Rosberg; March 25, 1999) is an American actress. She is best known for starring as Anora in the 2024 movie Anora, which won her the Academy Award for Best Actress. Madison also starred as Max Fox on the FX television comedy series Better Things (2016–2022) and as Manson Family follower Susan Atkins (Sadie) in Once Upon a Time ... in Hollywood (2019). She also played Amber Freeman in Scream (2022). ==Personal life== Madison was born in Los Angeles, California and grew up in the San Fernando Valley. She is Jewish. Madison originally trained as a competitive horseback rider before switching to acting at age 14. She was homeschooled after the seventh grade. Milkey is not dating to someone in the industry or neigther in relationship at moment. ==Career== Madison had her first acting role in 2012, appearing in the short movies Retirement and Pani's Box. In 2014, after appearing in the short movie Bound for Greatness, she had her first role in a major movie, Liza, Liza, Skies Are Grey, which was not released until 2017. In 2016, Madison began a starring role as Max Fox, a sullen teenager, in the FX comedy-drama series Better Things created by Louis C.K.. From 2017 to 2018, she guest starred in the Bravo dark comedy series Imposters. Madison had her first popular role as Manson Family member Susan \"Sadie\" Atkins in Quentin Tarantino's movie Once Upon a Time in Hollywood. She also had a voice role in the animated black comedy movie The Addams Family. The following year, Madison was cast as Amber Freeman in Scream, the fifth movie of the Scream franchise. In 2024, Madison starred as the main role as Anora, a stripper, in the Sean Baker movie Anora which premiered at the 2024 Cannes Film Festival. The movie won the Palme d'Or at the 2024 Cannes Film Festival. Madison won a BAFTA Award and an Academy Award for this role and was nominated for an Screen Actors Guild Award and a Golden Globe Award. This made her the first Gen Z winner in an acting category at the Academy Awards. In March 2025, Madison was a guest host for the 50th season of Saturday Night Live. ==References== ==Other websites== * Category:1999 births Category:Living people Category:American movie actors Category:American television actors Category:American child actors Category:Actors from Los Angeles Category:American voice actors Category:BAFTA Award winning actors Category:Best Actress Academy Award winners",
 "title": "Mikey Madison"
}