{
 "id": "727776",
 "text": "Fluminense de Feira Futebol Clube, usually known as Fluminense de Feira, or just Fluminense are a Brazilian football team from Feira de Santana, Bahia, Brazil, founded on January 1, 1941. Games are played in the Joia da Princesa stadium, capacity 16,274. The team plays in white, red and green striped shirts, white shorts and white socks. ==History== On January 1, 1941, Fluminense de Feira Futebol Clube was founded. Fluminense de Feira became a professional team in 1954. Two years later, the club was runner-up in Campeonato Baiano. In 1963, the club won Campeonato Baiano, its first professional title. In 1968, the club was again Campeonato Baiano runner-up. In the following year, the club won again the state championship. In 1992, Fluminense de Feira was runner-up of Brazilian Third Division, after losing the final to Tuna Luso. But, no promotion was given to Fluminense de Feira or Tuna Luso, because neither the second division, nor the third division were disputed in 1993. In 1998, after a very poor campaign, ending in 10th of 12 teams, the club was relegated to the Campeonato Baiano Second Division. In 1999, Fluminense de Feira competed in the Campeonato Baiano Second Division, ending the competition as runner-up, after a 1–1 home match draw, and a 0–0 away match draw against Colo-Colo of Ilhéus. The team gained promotion to the following year's Campeonato Baiano first division. ==Achievements== *Campeonato Baiano: 2 ::1963, 1969 *Taça Estado da Bahia: 2 ::1998, 2009 ==Stadium== Fluminense de Feira's stadium is Estádio Joia da Princesa, built in 1953, with a maximum capacity of 16,274 people. ==Symbols== The club is named after Fluminense Football Club of Rio de Janeiro city. Fluminense de Feira's kit, as well as the club logo, are very similar to the Rio de Janeiro's Fluminense ones. The club's nickname, Touro do Sertão, means Backland's Bull. Fluminense de Feira's mascot is a bull. ==References== ==Other websites== * Official Site *Fluminense de Feira at Aquivo de Clubes *Torcida Organizada Fluminantes Category:1940s establishments in Brazil Category:1941 establishments Category:Brazilian football clubs Category:Bahia",
 "title": "Fluminense de Feira Futebol Clube"
}