{
 "id": "727786",
 "text": "is a Japanese variety entertainer represented by Avilla. ==Biography== Sakaguchi was born in Tokyo, She graduated from Shōtō Kindergarten, Seijo Gakuen Primary School, Seijo Gakuen Junior High School and High School, and Horikoshi High School. Sakaguchi's mother is actress Ryoko Sakaguchi, her father was formerly a real estate company executive, her stepfather is the professional golfer Tateo Ozaki. She has a brother that is two years older than her. Her parents divorced on 1994, and she grew up with her mother.O ne Mans. Nippon TV. January 13, 2009. Sakaguchi was a fan of Morning Musume and joined the entertainment industry in 2008.Dancing Sanma Palace. Nippon TV. March 23, 2010. Her first leading film role was in Honey Flappers in 2014. She became an adult video actress, releasing her first video in October 2016. Sakaguchi began stripping in June 2018, and began working as a hostess. ==Filmography== === Adult Video === Year Title Publisher ID 2016 ANRI - What a day!\" MUTEKI TEK085 2017 'The Entertainer ANRI by KING' MOODYZ MIDE406 2017 'The Entertainer ANRI by Tsu' MOODYZ MIDE417 2017 'Why not Deflower a Real Celebrity?' MOODYZ MIDE428 2017 Miss ANRI the Celebrity is a Soapland Girl MOODYZ MIDE438 2017 Celebrity Loud Hot rhythmic Giant Gangbang MOODYZ MIDE446 ===TV series=== Year Title Network Notes 2009 Ongaku Baka TV Tokyo Dancing Sanma Palace NTV 2010 Quiz! Hexagon II Fuji TV 2012 Cream Quiz Miracle 9 TV Asahi London Hearts TV Asahi Akashiya TV MBS ===Dramas=== Year Title Role Network Notes 2015 Garo: Gold Storm Sho Mina TV Tokyo Episode 3 ===Radio series=== Year Title Network Notes 2011 Gurabiya Raibowtown FM 2013 Recommen! NCB ===Films=== Year Title Role Notes Ref. Twilight File V Famille: French Pan to Watashi 2014 Honey Flappers Mika Kirishima Lead role ==References== ==Other websites== * - MUTEKI official website specializing in entertainers * - Wayback Machine * - Ameba Blog (June 27, 2008 - December 21, 2015) * - GREE (January 19, 2010 - May 12, 2011) Category:1991 births Category:Living people Category:People from Tokyo Category:Japanese entertainers",
 "title": "Anri Sakaguchi"
}