{
 "id": "728286",
 "text": "Sidney is a city in the U.S. state of Nebraska. It is the county seat of Cheyenne County. The population was 6,410 at the 2020 census. == History == The city was founded in 1867 by the Union Pacific railroad company. It grew up around the military base called Fort Sidney (also known as Sidney Barracks). The soldiers there were stationed to guard transcontinental railroad from potential Indian attacks. When the railroad reached Sidney, it was the end of a sub-division of the rail line. Sidney had a roundhouse, repair facilities, and a railroad hotel for passengers. The city was named after Sidney Dillon. He was president of the Union Pacific Railroad at that time. The town became the southern end of the Sidney Black Hills Stage Road in the late 1870s and 1880s. Sidney has one of the Old West's Boot Hill cemeteries. Many of the people buried there were soldiers from the fort.http://www.sidneyboothill.com/ In the first two decades of the twenty-first century, the largest employer in the city was Cabela's, a company that makes items for outdoor recreation. In 2016, it was sold to Bass Pro Shops. Then it moved out of Sidney. Many jobs were lost. == Geography == According to the United States Census Bureau, the city has a total area of , all land. Sidney is near the western edge of the midwestern wheat-growing region. West of the city, the land is increasingly used for cattle ranching. Sidney is located along Lodgepole Creek, which is along present-day Interstate 80. == Commerce == Near the city is the junction of two major highways: US 385 and I-80. This junction is about halfway between Cheyenne, Wyoming, and North Platte, Nebraska. This location has encouraged the growth of Sidney as a major transportation service area on the Interstate highway. Because the I-80/US 385 interchange is many miles southeast of the town center, a new commercial area has developed. This area includes truck stops, convenience stores, shopping centers, motels, restaurants, and other commercial enterprises. Companies in Sidney include: Adams Industries, 21st Century Water Technologies, KISST Organics-Health & Wellness Store/Firearms Division, Nexgen Outfitters, Highby Outdoors, Lukjan Great Plains, Agri- Plastics, 308 Ag LLC and Sidney Foundry. https://www.manta.com/mb_51_ALL_CGZ/sidney_nehttps://kticradio.com/regional- news/city-of-sidney-featured-on-fox-news-city-manager-says-its-not-all-doom- and-gloom/ == Demographics == ===2020 census=== As of the 2020 census, there were 6,410 people, 2,806 households, and 1,696 families living in Sidney. The population density was 856.4 people per square mile (330.6/km²). There were 3,210 housing units. The breakdown by race was 87.8% White, 1.2% Asian, 0.8% Black, 0.7% Native American, 3.9% from one other race, and 5.6% from two or more races. Hispanics and Latinos made up 10.1% of the people. Of the 2,806 households, 28.6% had children under age 18, 44.7% had a married couple, 6.2% had an unmarried couple, 27.7% had a woman with no partner, 21.4% had a man with no partner, and 35.0% had one person living alone. The average household size was 2.24 people. The median (middle) age was 39.6 years. The age breakdown was 23.9% under age 18, 56.3% from 18 to 65, and 19.7% over 65. The gender breakdown was 49.4% male and 50.6% female. == Education == The Sidney public schools educate 1,200 children from pre-kindergarten through twelfth grade. Western Nebraska Community College has a campus in Sidney. ==Services== ===Library=== Sidney has a public library. It is at 1112 12th Avenue. The library has almost 50,000 volumes. its services include a bookmobile serving all of Cheyenne County, a genealogy room, and reading programs. ===Medical care=== The Sidney Regional Medical Center provides a variety of medical care at a number of sites in Chappell and Sidney. https://www.sidneyrmc.com/ === Activities=== The Cheyenne County Community Center, 627 Toledo St, provides sports facilities, daycare, and other activities. == References == == Other websites == * City of Sidney Category:Cities in Nebraska Category:County seats in Nebraska",
 "title": "Sidney, Nebraska"
}