{
 "id": "72834",
 "text": "Molecular biology is the study of biology at a molecular level. The field overlaps with other areas of biology and chemistry, particularly cell biology, genetics, biophysics and biochemistry.Alberts B. Johnson A. Lewis J. Raff M. Roberts K. Walter P. 2008. Molecular biology of the cell, 5th ed. Garland. Lodish H. Berk A. Matsudaira P. Kaiser C.A. Krieger M. Scott M.P. Zipurksy S.L. Darnell J. 2004. Molecular cell biology, 5th ed. Freeman, NY. Molecular biology tries to explain the interactions between the various systems of a cell. It studies the relationship of DNA, RNA and how proteins are made, and how these interactions are regulated. == Relationship to other specialities == Researchers in molecular biology use specific techniques that are typical for molecular biology, but they combine these with techniques and ideas from genetics and biochemistry. This diagram shows one possible view of the relationship between the fields: *Biochemistry is the study of the chemical substances and vital processes occurring in living organisms. *Genetics is the study of inheritance: the effect of genetic differences on organisms. *Molecular biology includes the study of the structure and function of all carbon-based macromolecules. This includes the chain of events from gene to protein: replication, transcription and translation. Much of the work in molecular biology is quantitative, and recently much work has been done at the interface of molecular biology and computer science in bioinformatics and computational biology. As of the early 2000s, the study of the genome has been amongst the most prominent sub-field of molecular biology. *Cytology, which includes the appearance of cells and cell structures, microscopy, and the use of stains and tags to help distinguish organelles and processes. == Related pages == *DNA and chromosome structure *Genome *Cell *Cell biology *Cytology *Sequence analysis *Transcription (genetics) *Transformation (genetics) *Translation (genetics) == References== *Cohen S.N. Chang A.C.Y. Boyer H. & Heling R.B. 1973. Construction of biologically functional bacterial plasmids in vitro. PNAS 70, 3240–3244. *Rodgers M. 1975. The Pandora's box congress. Rolling Stone 189, 37–77. ==Other websites== === Other reliable accounts === *Stanford Encyclopedia of Philosophy entry * A brief history of molecular biology === Personal accounts of Nobel Prize winners === * Max Perutz Freeview Video interview with Max Perutz by the Vega Science Trust. * Frederick Sanger Freeview Video Interview/Documentary by the Vega Science Trust. * Christiane Nüsslein-Volhard Freeview interview by the Vega Science Trust. ===Other=== * DNA from the beginning *Scientific American Magazine (April 2004) Evolution encoded * DNA Interactive *Nature Reviews Molecular Cell Biology ( journal home)",
 "title": "Molecular biology"
}