{
 "id": "728317",
 "text": "Princess Märtha Louise of Norway (born 22 September 1971) is a Norwegian princess. She is the only daughter and elder child of King Harald V and Queen Sonja. She is fourth in the line of succession to the Norwegian throne, after her brother Haakon and his children. Family life: In 2002 she was married to Ari Behn, in Nidaros cathedral (a kind of church) in Trondheim.https://www.royalcourt.no/artikkel.html?tid=28745&sek;=27287#:~:text=Princess%20M%C3%A4rtha%20Louise%20became%20engaged,Trondheim%20on%2024%20May%202002. Retrieved 2024-07-28 The marriage lasted many years, however Behn later died. On 31 August 2024, she married American Durek Verrett. The marriage was controversial in Norway as Verrett is a known conspiracy theorist and convicted felon, having spent time in prison for multiple crimes. ==Title and Styles== 22 September 1971-1 February 2002: Her Royal Highness Princess Martha Louise of Norway 1 February 2002-present: Her Highness: Princess Martha Louise of Norway == Honors == === National Honors === * Norway: Grand Cross with Collar of the Order of Saint Olav * Norway: Dame of the Royal Family Decoration of King Olav V of Norway * Norway: Dame of the Royal Family Decoration of King Harald V of Norway * Norway: Recipient of the Medal of the 100th Anniversary of the Birth of King Haakon VII * Norway: Recipient of the King Olav V Silver Jubilee Medal * Norway: Recipient of the King Olav V Commemorative Medal * Norway: Recipient of the 100th Anniversary of the Birth of King Olav V * Norway: Recipient of the Royal House Centennial Medal * Norway: Recipient of the King Harald V Silver Jubilee Medal === Foreign Honors === * Denmark: Knight of the Order of the Elephant * Finland: Grand Cross of the Order of the White Rose * Iceland: Grand Cross of the Order of the Falcon * Jordan: Grand Cordon of the Order of the Star of Jordan * Netherlands: Grand Cross of the Order of the Crown * Luxembourg: Grand Cross of the Order of Adolphe of Nassau * Portugal: Grand Cross of the Order of Prince Henry * Spain: Dame Grand Cross of the Order of Civil Merit * Sweden: Commander Grand Cross of the Royal Order of the Polar Star, Recipient of the 50th Birthday Medal of King Carl XVI Gustaf, Recipient of the 70th Birthday Medal of King Carl XVI Gustaf ==References== ==Other websites== * Official Site of the Norwegian Royal Family * Official Site of the Norwegian Royal Family: Princess Märtha Louise Category:1971 births Category:Living people Category:Norwegian princesses Category:People from Oslo",
 "title": "Princess Märtha Louise of Norway"
}