{
 "id": "729026",
 "text": "Parspatunik,Parspatuniq(in , also Parasapatene and Patsparunik, Parparunik) was the 26th district of Vaspurakan province and the largest region (550 km ²Еремян С.Т. Армения по “Ашхарацуйц”-у.(Армянской географии VII века) (опыт реконструкции армянской карты VII века на современной картографической основе). - Ереван, 1963 - С. 117.) of the kingdom of Greater Armenia. After 72 A.D. Parspatuniq became principality of Great Armenia, which owned two regions (Parspatunik and Marand) in the province of Vaspurakan. The region belonged to the princely family of Parspatuni(Patsparuni, Parspuni, Parsparuni). == History == In antiquity, the main territory of Parspatunik (modern Karadag) was part of the Scythian state-tribal entity. In the western part of Parspatunik, Marand, the center of the ancient region Sangibutu,Ulhu was located . Then the region was part of the kingdom of Urartu. Subsequently, these areas again fell into the power of the Scythians. They later became part of the Median Empire. After the division of the empire of Alexander the Great,еаstern Parspatunik became part of the Media Atropatena. Artashes I annexed еastern Parspatunik to Great Armenia during the military campaign . Marand was part of the Armenian kingdom before the conquests of King Artashes I. The princely clan of Parspatuni descended from the Matianian kings of Sangibutu. Having become princes, the naxarars of Parspatuni united under their rule the regions of Parspatunik and Marand, choosing the Marand's Bakurarakert(Greco-Roman Philadelphia) as their capital. Parspatunik was not included into Vaspurakan after the second partition of Great Armenia in 591 by the Roman and Sasanids empires. Then, later, under the rule of the Arab caliphate, the region is no longer part of Vaspurakan.1 The population of Parspatunik was significantly Islamized during the Caliphate. == Geographical location and population == Parspatunik was located between the river Araxes from the north and Parthian empire in the south. The wooded mountain range of Parspatunik(Matiani mts.) was also known in Antiquity as Αρμενιωο Ορη - the Armenian Mountains, in which there was a passage Αρμενιων πυλών - Armenian Gate (Դրունք Հայոց), what was described in the III-rd century B.C. by a Greek author Eratosthenes(280-202 B.C.) and mentioned again by a XIV-th century Muslim historiographer Hamballah Ghazvini. The road passing through the Armenian Gate in the Middle Ages led to the famous Khudapery Bridge. By its geographical position, Parspatunik was located on the border of the Armenian and Parthian kingdoms. This circumstance explains the Armenian name of the region, which translates as “Wall of Persia” from the words “Pars”(Persia) and “pat”(wall), due to the fact that the Matiani mountains of Parspatunik served as the ancient border between Armenia and Iran. In the I-VI centuries, this region was the 26th ghawar(region) and the principality of the Armenian province of Vaspurakan, as mentioned by the 7th-century Armenian geographer and historian Anania Shirakatsi . The population of Parspatunik consisted mоstly of Iranian(Atropatenian and Caspian) tribes. The Armenian population, previously Matiene and Alarodian tribes, was concentrated in the towns and wooded mountainous areas near the fortresses, where it still existing to this day in modern Iran. In the mountainous wooded territory of Parspatunik (Karadag), adjacent to the right bank of the Araxes, there were small Armenian melikdoms until the end of the First World War.https://iarmenia.org/wp- content/uploads/2017/10/Khamsa-Union.png Political map of the Armenian Highlands in the 16th century during the period of the Turkish-Persian Wars,map of the region in the first half of the XVIIIth century Some of the Armenian melikdoms of Karadag(Parspatunik) were founded by settlers from Karabakh(Artsakh). The modern historical region of Parspatunik is located on the territory of the Iranian region Arasbaran(Karadag) and was abandoned by the majority of the Armenian population during the repatriation period 1946-1947. A large number of monuments of Armenian architecture have been preserved in the region. The remaining Armenian population of Parspatunik (Karadag) is concentrated in the mountainous region, on the border of the Iranian provinces of Ardabil and East Azerbaijan.http://gulf2000.columbia.edu/images/maps/Iran_Ethnic_lg.png ==References== Category:Ancient Armenia Category:History of Iran",
 "title": "Parspatunik"
}