{
 "id": "729158",
 "text": "The following is a list of deaths that should be noted in January 2020. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==January== ===1=== *János Aczél, 95, Hungarian-Canadian mathematician and journalist (Aequationes Mathematicae), member of the Royal Society of Canada (since 1971) and Hungarian Academy of Sciences (since 1990). *Chris Barker, 39, English footballer (Barnsley, Cardiff City, Southend United). (body discovered on this date) *Joan Benson, 94, American keyboard player. *Martin Bundi, 87, Swiss politician, President of the National Council (1985–1986).Ex- Nationalratspräsident Martin Bundi gestorben *Alexander Frater, 82, British- Australian travel writer, documentary filmmaker (The Last African Flying Boat) and journalist (Punch). *Tommy Hancock, 90, American swing fiddler (The Flatlanders) and bandleader. *Walter Hayman, 93, German-born British mathematician. *Don Larsen, 90, American baseball player (New York Yankees, Baltimore Orioles, San Francisco Giants), esophageal cancer. *Peter Lo Sui Yin, 96, Malaysian politician, Chief Minister of Sabah (1965–1967). *Roland Minson, 90, American basketball player (BYU Cougars). *Ng Jui Ping, 71, Singaporean businessman and army general, Chief of Defence Force (1992–1995), pancreatic cancer. *Dick Scott, 96, New Zealand historian. *David Stern, 77, American Hall of Fame sports executive and businessman, Commissioner of the National Basketball Association (1984–2014), cerebral hemorrhage. ===2=== *John Baldessari, 88, American conceptual artist. *Fazilatunnesa Bappy, 49, Bangladeshi lawyer and politician, MP (2011–2018). *Nick Fish, 61, American politician and lawyer, Portland City Commissioner (since 2008), stomach cancer. *Yukiko Miyake, 54, Japanese politician, MP (2009–2012), suicide by drowning.三宅雪子元議員、入水自殺か…都内の海岸で遺体発見 *Roger Phillips, 73, British football manager (Corinthian-Casuals), heart disease. *Bogusław Polch, 78, Polish artist.To on rysował \"Wiedźmina\" i \"Kapitana Żbika\". Zmarł Bogusław Polch *Shen Yi-ming, 62, Taiwanese Air Force commander, Chief of the General Staff (since 2019), helicopter crash. *Sam Wyche, 74, American football player (Washington Redskins), coach (Cincinnati Bengals, Tampa Bay Buccaneers) and politician, member of the Pickens County Council (since 2008), problems caused by melanoma. ===3=== *Derek Acorah, 69, English self-styled spiritual medium and television personality (Most Haunted, Celebrity Big Brother, Derek Acorah's Ghost Towns), sepsis caused by pneumonia. *Pete Brewster, 89, American football player (Cleveland Browns, Pittsburgh Steelers) and coach. *Wolfgang Brezinka, 91, German-Austrian educational scientist.Wolfgang Brezinka *Domenico Corcione, 90, Italian general, Minister of Defence (1995–1996).Generale ed ex Ministro della difesa, è morto Domenico Corcione *Mónica Echeverría, 99, Chilean journalist, feminist writer (Crónicas vedadas, Sudamericana) and actress (La colonia penal).A los 99 años muere la destacada escritora y dramaturga Mónica Echeverría *Reuben Hersh, 92, American mathematician philosopher (The Mathematical Experience) and academic (Scientific American). *Nathaël Julan, 23, French footballer (Le Havre, Valenciennes, Guingamp), road accident.Nathaël Julan (Guingamp) mort dans un accident de la route *Stella Maris Leverberg, 57, Argentine politician and trade unionist, Deputy (2007–2015), cardiac arrest caused by road accident.Falleció Stella Maris Leverberg, víctima del despiste de la camioneta en la que viajaba *Notable people killed in the Baghdad International Airport airstrike: **Abu Mahdi al-Muhandis, 66, Iraqi military commander, head of the Popular Mobilization Forces. **Qasem Soleimani, 62, Iranian major general, commander of the Quds Force (since 1998). ===4=== *Oliver Batali Albino, 84, South Sudanese politician, Minister of Housing and Public Utilities (1975–1978) and Minister of Labour (1985), heart failure. *Guy Arnold, 87, English writer and explorer, problems caused by dementia. *Russell Bannock, 100, Canadian Air Force fighter ace. *Herbert Binkert, 96, German football player (1. FC Saarbrücken, Saarland national team) and manager (FC 08 Homburg).Saar-Fußballer Herbert Binkert gestorben *Júlio Castro Caldas, 76, Portuguese lawyer and politician, MP (1980–1983) and Minister of National Defence (1999–2001).Morreu Júlio Castro Caldas, antigo ministro da difesa *John R. Cunningham, 92, Canadian medical physicist. *Tom Long, 51, American- born Australian actor (Two Hands, The Dish, The Postcard Bandit), encephalitis caused by multiple myeloma. *Lorenza Mazzetti, 92, Italian movie director (Together) and novelist.Morta la scrittrice e regista Lorenza Mazzetti *K. S. S. Nambooripad, 84, Indian mathematician, academic and computer scientist. *Walter Ormeño, 93, Peruvian footballer (Club América, Atlante, national team).Fallece Walter Ormeño, exfutbolista y director técnico de equipos mexicanos *Zdravko Tomac, 82, Croatian politician and writer, MP (1995–2005).Umro Poznati političar: Zdravko otišao posle kratke i teške bolesti ===5=== *James Barber, 79, British biochemist, member of the Australian Academy of Science (since 1995) and Royal Swedish Academy of Sciences (since 2003). *T. N. Chaturvedi, 90, Indian politician, Comptroller and Auditor General (1984–1989), Governor of Karnataka (2002–2007) and Kerala (2004), 2017 presidential candidate, heart attack.Former Karnataka Governor Tn Chaturvedi Passed Away in Noida *Anri Jergenia, 78, Abkhazian politician, Prime Minister (2001–2002), 2004 presidential candidate.Ушел из жизни абхазский политический деятель Анри Джергения *Walter Learning, 81, Canadian actor, playwright and theatrical director (A Gift to Last), founder of Theatre New Brunswick. *Liu Zhongyi, 89, Chinese politician, Vice Minister of the National Development and Reform Commission (1985–1990) and Minister of Agriculture (1990–1993).原农业部部长、党组书记刘中一病逝，享年90岁 *Antoni Morell Mora, 78, Spanish-born Andorran diplomat and writer, Ambassador to the Holy See (2005–2010), heart failure.Mor Antoni Morell als 78 anys *Hans Tilkowski, 84, German football player (Westfalia Herne, Borussia Dortmund, West Germany national team) and manager. ===6=== *Bernt Andersson, 86, Swedish football player (Djurgården) and manager (Halmstad, Helsingborg).Sump-Hugo har gått ur tiden – blev 86 år *Mike Fitzpatrick, 56, American politician, member of the U.S. House of Representatives from Pennsylvania's 8th congressional district (2005–2007, 2011–2017), melanoma. *Prem Nath Hoon, 90, Indian military officer, General Officer Commanding-in-Chief of the Western Command (1986–1987). *Oswaldo Larriva, 74, Ecuadorian academic and politician, Deputy (1992–1994, 2013–2017) and Governor of Azuay Province (2007–2009, 2019), leukemia.Oswaldo Larriva, exgobernador de Azuay, fallece a los 74 años *Aloïse Moudileno Massengo, 86, Congolese politician and lawyer, Vice President (1971–1972).Disparition : Aloïse Moudileno-Massengo a tiré sa révérence *Luís Morais, 89, Brazilian footballer (Corinthians, Portuguesa, national team).Morre Cabeção, o quarto goleiro com mais jogos na história do Corinthians ===7=== *Khamis Al-Dosari, 46, Saudi Arabian footballer (Al- Hilal, Al-Ittihad, national team), brain cancer.وفاة نجم الكرة السعودية خميس العويران بعد صراع مع المرض *Vincenzo Cerundolo, 60, Italian medical researcher. (death announced on this date) *Fakhruddin G. Ebrahim, 91, Pakistani politician and lawyer, Attorney General (1971–1977), Governor of Sindh (1989–1990) and Chief Election Commissioner (2012–2013). *Larry Gogan, 81, Irish broadcaster (RTÉ Gold, RTÉ 2fm). *Silvio Horta, 45, American movie and television writer (Ugly Betty, Jake 2.0, Urban Legend), suicide by gunshot. *Neil Peart, 67, Canadian Hall of Fame drummer (Rush) and lyricist (\"The Spirit of Radio\", \"Tom Sawyer\"), glioblastoma. *George Perles, 85, American football player and coach (Pittsburgh Steelers, Michigan State Spartans), Parkinson's disease. *Abderrazak Rassaa, 90, Tunisian politician and economist, Minister of Finance (1969–1971).Décès de l’ancien ministre Abderrazak Rassaa *Elizabeth Wurtzel, 52, American feminist writer (Prozac Nation), journalist (The Wall Street Journal) and essayist, subject of Prozac Nation movie adaptation, meningitis caused by breast cancer. ===8=== *Edd Byrnes, 86, American actor (77 Sunset Strip, Grease) and recording artist (\"Kookie, Kookie (Lend Me Your Comb)\"), suspected stroke. *Buck Henry, 89, American actor (The Man Who Fell to Earth), screenwriter (The Graduate, Get Smart) and director (Heaven Can Wait), Emmy winner (1967), heart attack. *David Montgomery, 2nd Viscount Montgomery of Alamein, 91, British peer and businessman, member of the House of Lords (1976–1999, 2005–2015). *Infanta Pilar, Duchess of Badajoz, 83, Spanish royal, colon cancer.Muere la infanta Pilar de Borbón a los 83 años *Zhu Yuli, 85, Chinese politician and businessman, Vice Minister of the Ministry of Astronautics Industry (1992–1993) and General Manager of the Aviation Industry Corporation of China (1993–1999).原中国航空工业总公司总经理朱育理逝世，享年85岁 ===9=== *Walter J. Boyne, 90, American Air Force officer and writer (The Wild Blue: The Novel of the U.S. Air Force). *Galen Cole, 94, American World War II veteran, businessman and philanthropist, manager of the Cole Land Transportation Museum, Purple Heart recipient. *Rudolf de Korte, 83, Dutch politician, Deputy Prime Minister (1986–1989), Minister of Economic Affairs (1986–1989). *Pete Dye, 94, American Hall of Fame golf course designer (TPC at Sawgrass), problems caused by dementia. *Pampero Firpo, 89, Argentine-American professional wrestler. *David Glass, 84, American businessman, CEO of Walmart (1988–2000), former owner of the Kansas City Royals, problems caused by pneumonia. *Robert Molimard, 92, French physician.Décès de Robert Molimard, « père de la défume en France » *Ivan Passer, 86, Czech-American movie director and screenwriter (Cutter's Way), problems caused by COPD. *Matthew Quashie, 68, Ghanaian Navy admiral, Chief of Naval Staff of the Ghana Navy (2009–2013) and Chief of Defence Staff of the Ghana Armed Forces (2013–2016). *Mike Resnick, 77, American science fiction writer (The Goddess of Ganymede, Stalking the Unicorn, Kirinyaga) and editor (Jim Baen's Universe), multi-Hugo Award winner, lymphoma. *Carol Serling, 90, American actress (Twilight Zone: The Movie) and producer (The Twilight Zone). *Hal Smith, 89, American baseball player (Baltimore Orioles, Kansas City Athletics, Pittsburgh Pirates). *Yong Pung How, 93, Singaporean lawyer and banker, Chief Justice (1990–2006). ===10=== *Tom Alexander, 85, Scottish folk musician (The Alexander Brothers). (death announced on this date) *Neda Arnerić, 66, Serbian actress (Shaft in Africa, Venom, The End of the War).Preminula Neda Arnerić *John Crosbie, 88, Canadian politician, MHA (1966–1976), MP (1976–1993) and Lieutenant Governor of Newfoundland and Labrador (2008–2013). *Alun Gwynne Jones, Baron Chalfont, 100, British politician and historian, Minister of State for Foreign Affairs (1964–1970) and member of the House of Lords (1964–2015).Lord Chalfont obituary *Wolfgang Dauner, 84, German jazz fusion pianist (United Jazz + Rock Ensemble) and composer.Jazzmusiker Wolfgang Dauner gestorben *Guido Messina, 89, Italian racing cyclist, Olympic (1952) and world champion (1948, 1953, 1954, 1955, 1956).Addio a Guido Messina, era la maglia rosa più anziana *Marc Morgan, 57, Belgian singer-songwriter.Marc Morgan est décédé *Petko Petkov, 73, Bulgarian football player (Austria Wien, national team) and manager (Beroe). *Qaboos bin Said al Said, 79, Omani royal, Sultan (since 1970), colon cancer. *Carlos Cuco Rojas, 65, Colombian harpist (Cimarrón) and songwriter, heart attack.Murió el arpista Carlos “Cuco” Rojas, director de Cimarrón *Wu Shuqing, 88, Chinese economist, President of Peking University (1989–1996).著名经济学家、北京大学原校长吴树青逝世，享年88岁 ===11=== *Tom Belsø, 77, Danish motor racing driver, stomach cancer. *Musharraf Karim, 74, Bangladeshi journalist and children's writer, Bangla Academy Literary Award winner (2003).কবি মুশাররাফ করিমের ইন্তেকাল *Stan Kirsch, 51, American actor (Highlander: The Series), suicide by hanging. *Valdir Joaquim de Moraes, 88, Brazilian football player (Palmeiras, national team) and manager, multiple organ failure.Valdir Joaquim de Moraes morre aos 88 anos *La Parka II, 54, Mexican luchador (AAA), lung and kidney failure. *Kazuo Sakurada, 71, Japanese professional wrestler (Stampede Wrestling, CWF, BJPW) and trainer, arrhythmia. *Steve Stiles, 76, American cartoonist (Underground comix, Heavy Metal) and writer, Hugo Award winner (2016), cancer. ===12=== *William Bogert, 83, American actor (Small Wonder, Death Wish, WarGames). *Tony Garnett, 83, British movie producer (Kes, Earth Girls Are Easy). *Paulo Gonçalves, 40, Portuguese motorcycle rally racer, race crash. *Rolf Koschorrek, 64, German politician, MP (2005–2013), cancer.CDU-Politiker Rolf Koschorrek gestorben *Jayalath Manoratne, 71, Sri Lankan actor (Doo Daruwo, Handaya, Hiripoda Wassa), brain cancer. *Sir Roger Scruton, 75, English philosopher and writer (Sexual Desire, How to Be a Conservative), editor of The Salisbury Review (1982–2001), lung cancer. *Aart Staartjes, 81, Dutch actor and presenter (De Stratemakeropzeeshow, Sesamstraat, Pinkeltje), car crash.Tv-maker en Sesamstraat-icoon Aart Staartjes na ongeluk overleden ===13=== *Carlos Girón, 65, Mexican diver, Olympic silver medalist (1980), pneumonia. *Murad Wilfried Hofmann, 88, German politician and writer, Ambassador to Algeria (1987–1990) and Morocco (1990–1994).Murad Wilfried Hoffmann gestorben *Jaime Humberto Hermosillo, 77, Mexican filmmaker (Homework). *Jack D. Shanstrom, 87, American politician and lawyer, Judge of the U.S. District Court for the District of Montana (1990–2001), problems caused by Parkinson's disease. *Isabel-Clara Simó, 76, Spanish journalist (Avui, El Punt) and writer, neurodegenerative disease.Fallece la escritora Isabel-Clara Simó a los 76 años ===14=== *John N. Brandenburg, 90, American Army lieutenant general. *Chamín Correa, 90, Mexican guitarist and record producer, heart attack.Tocó para Parral en 2012, descanse en paz Chamin Correa *Eville Gorham, 94, Canadian-American biochemist and ecologist. *Jack Kehoe, 85, American actor (Serpico, The Sting, The Untouchables), problems caused by a stroke. *Liang Jun, 90, Chinese tractor driver. ===15=== *Bobby Brown, 96, Scottish Hall of Fame football player (Rangers, Queen's Park) and manager (national team). *Mark Harris, 72, Australian rugby league player (Eastern Suburbs, North Sydney Bears, national team), throat cancer. *Rocky Johnson, 75, Canadian Hall of Fame professional wrestler (NWA, WWE) and trainer, World Tag Team champion (1983), pulmonary embolism. *Kotaro Suzumura, 76, Japanese economist, pancreatic cancer.鈴村興太郎さんが死去 一橋大名誉教授、厚生経済学 *Christopher Tolkien, 95, British academic and editor (The Silmarillion, The History of Middle-earth). *Nikolai Tsymbal, 94, Soviet-Russian Air Force general.Соболезнование в связи с кончиной Николая Андреевича Цымбала *Ivan Ustinov, 100, Russian intelligence officer (NKVD, SMERSH, KGB).Военный контрразведчик Иван Устинов скончался на 101 году жизни ===16=== *Magda al-Sabahi, 88, Egyptian actress (Jamila, the Algerian). *Harry G. Haskell Jr., 98, American politician and businessman, member of the U.S. House of Representatives from Delaware's at-large congressional district (1957–1959) and Mayor of Wilmington (1969–1973). *Efraín Sánchez, 93, Colombian football player (San Lorenzo, Independiente Medellín, national team) and manager.Muere a los 93 años ‘el Caimán’ Sánchez, leyenda del arco de la Selección Colombia *R. Sathyanarayana, 93, Indian musicologist, Padma Shri recipient (2018). *Barry Tuckwell, 88, Australian horn player and conductor, heart disease. *Zhao Zhongxiang, 78, Chinese television news anchor (Xinwen Lianbo) and presenter (CCTV New Year's Gala), liver cancer. ===17=== *Pietro Anastasi, 71, Italian footballer (Juventus, Inter, national team), cancer.Il calcio piange Pietro Anastasi: fu un simbolo della Juve negli Anni 70 *Thérèse Dion, 92, Canadian television personality. *Rahşan Ecevit, 97, Turkish politician and political writer, founder and Leader of the Democratic Left Party (1985–1987). *Derek Fowlds, 82, British actor (Yes Minister, Yes Prime Minister, Heartbeat), sepsis and heart failure caused by pneumonia. *Terence Hallinan, 83, American politician and lawyer, District Attorney for San Francisco (1996–2004). *Hwang Sun-hui, 100, North Korean politician and military personnel, Director of the Korean Revolution Museum (since 1990), pneumonia.김정은, 리설주 여사와 빈소 찾아 조문 故 황순희, 김일성·김정숙 등과 항일운동 *Bobby Kay, 70, Canadian professional wrestler (Cormier wrestling family) and promoter (Eastern Sports Association). *John Klyberg, 88, British priest, Bishop of Fulham (1985–1996). *Khagendra Thapa Magar, 27, Nepali record holder, world's shortest man (2010–2011), pneumonia. *Walter E. Powell, 88, American politician, member of the U.S. House of Representatives from Ohio's 8th congressional district (1971–1975). *Lech Raczak, 73, Polish theatre director, heart attack.Nie żyje Lech Raczak *Steve Rayner, 66, British sociologist and climate critic (Intergovernmental Panel on Climate Change). *Claudio Roditi, 73, Brazilian jazz trumpeter, prostate cancer.Morre aos 73 anos o trompetista brasileiro Cláudio Roditi, referência do samba jazz nos EUA *Stanisław Stefanek, 83, Polish Roman Catholic prelate, bishop of Łomża (1996–2011).W lubelskim szpitalu zmarł biskup Stanisław Stefanek *Morimichi Takagi, 78, Japanese Hall of Fame baseball player (Chunichi Dragons), heart failure.「ミスタードラゴンズ」高木守道さん急死 12日にはラジオ出演…急性心不全78歳 *Rhona Wurtele, 97, Canadian Olympic skier (1948). ===18=== *Mario Bergamaschi, 91, Italian footballer (Milan, Sampdoria, national team).Se ne va Mario Bergamaschi, due scudetti con il Milan negli Anni 50 *Ashwini Kumar Chopra, 63, Indian journalist (Punjab Kesari), cricketer and politician, MP (2014–2019), cancer.करनाल के पूर्व भाजपा सांसद अश्विनी चोपड़ा का देहांत, लंबे समय से कैंसर से जूझ रहे थे *Steve Gillespie, 56, Canadian professional wrestler (Stampede Wrestling, FMW). *Egil Krogh, 80, American lawyer, criminal and politician, Under Secretary of Transportation (1973), key figure of the Watergate scandal, heart failure. *Robert Maclennan, Baron Maclennan of Rogart, 83, British politician, MP (1966–2001), Leader of the Social Democratic Party (1987–1988) and President of the Liberal Democrats (1995–1998). *David Olney, 71, American folk singer- songwriter and guitarist, heart attack. *Petr Pokorný, 86, Czech Protestant theologian.Zemřel profesor Nového zákona Petr Pokorný *Piri Sciascia, 73, New Zealand Māori leader, kapa haka exponent and university administrator. *Jack Van Impe, 88, American televangelist and critic, problems caused by a fall. ===19=== *Manfred Clynes, 94, Austrian-born Australian-American scientist, inventor and musician. *Urs Egger, 66, Swiss movie director (Children of the Open Road, Opernball) and journalist (Neue Zürcher Zeitung).\"Das Wunder von Wörgl\"-Regisseur stirbt mit 66 Jahren *Jimmy Heath, 93, American jazz saxophonist. *James Mollison, 88, Australian arts administrator, director of the National Gallery of Australia (1971–1990) and the National Gallery of Victoria (1989–1995). *Robert Parker, 89, American R&B; singer (\"Barefootin'\"). *Sunanda Patnaik, 85, Indian Gwalior gharana classical singer. *Blagovest Sendov, 87, Bulgarian diplomat, mathematician and politician, Chairperson of the National Assembly (1995–1997) and Ambassador to Japan (2004–2009).Отиде си акад. Благовест Сендов *Shin Kyuk-ho, 98, South Korean businessman, founder of Lotte Corporation.Lotte founder passes away *Danny Talbott, 75, American football player (Washington Redskins), problems caused by cancer. ===20=== *Herbert Baumann, 94, German composer. *Wolfgang J. Fuchs, 74, German historian and comic book translator. *Joseph Hannesschläger, 57, German actor (Die Rosenheim-Cops) and musician, neuroendocrine tumor.Joseph Hannesschläger ist tot: „Rosenheim Cops“-Star verliert Kampf gegen Krebsleiden *Jaroslav Kubera, 72, Czech politician, President of the Senate (since 2018) and Mayor of Teplice (1994–2018), 2018 presidential candidate. *Tom Railsback, 87, American politician, member of the Illinois (1962–1966) and U.S. House of Representatives from the 19th congressional district (1967–1983).Ex-U.S. Rep. Tom Railsback — who crossed party lines on Nixon impeachment — dies at 87 *Joe Shishido, 86, Japanese actor (Youth of the Beast, Branded to Kill, A Tale of Sorrow and Sadness).Mort de l'acteur Joe Shishido, le \"Jean-Paul Belmondo japonais\" *Michael I. Sovern, 88, American legal scholar and academic administrator, President of Columbia University (1980–1993), cardiomyopathy. *George Herbert Walker III, 88, American businessman and politician, Ambassador to Hungary (2003–2006), cousin of George H. W. and George W. Bush, problems caused by a stroke. ===21=== *Norman Amadio, 91, Canadian jazz pianist and bandleader. *Hédi Baccouche, 90, Tunisian politician, Prime Minister (1987–1989).Hédi Baccouche n’est plus *Eugène Berger, 59, Luxembourgish politician, MP (1994–2004, since 2007). *Terry Jones, 77, Welsh comic actor, historian (Ancient Inventions), screenwriter and movie director (Monty Python), problems caused by primary progressive aphasia. *Ismat Ara Sadique, 77, Bangladeshi politician, Minister of Primary and Mass Education (2014) and Public Administration (2014–2018) and MP (since 2014). *Boris Tsirelson, 69, Russian-Israeli mathematician (Tsirelson's bound, Tsirelson space, Gaussian isoperimetric inequality), euthanasia. *Ian Tuxworth, 77, Australian politician, Chief Minister of the Northern Territory (1984–1986). *Tengiz Sigua, 85, Georgian politician, Prime Minister (1992–1993).Gruzja: Zmarł były premier Tengiz Sigua *Theodor Wagner, 92, Austrian football player (Wacker Wien, national team) and manager (Wacker Innsbruck).ÖFB-Legende „Turl“ Wagner 92-jährig verstorben! *De'Runnya Wilson, 25, American football player (Mississippi State Bulldogs), murdered. ===22=== *Hercules Ayala, 69, Puerto Rican professional wrestler (Stampede Wrestling, NJPW, WWC). *Paul Murphy, American politician and judge, member of the Massachusetts House of Representatives (1961–1970, 1971–1974). *John Karlen, 86, American actor (Daughters of Darkness, Dark Shadows, Cagney & Lacey), congestive heart failure. *Gerda Kieninger, 68, German politician, member of the Landtag of North Rhine-Westphalia (1995–2017).Awo-Vorsitzende Gerda Kieninger ist gestorben ===23=== *Robert Archibald, 39, British basketball player (Memphis Grizzlies, Toronto Raptors, Club Joventut Badalona). *Sir Frederick Ballantyne, 83, Vincentian cardiologist and politician, Governor- General (2002–2019). *Clayton Christensen, 67, American businessman, venture capitalist and writer (The Innovator's Dilemma), problems caused by leukemia. *Jake Godbold, 86, American politician, Mayor of Jacksonville, Florida (1978–1987). *Robert Harper, 68, American actor (Frank's Place, Once Upon a Time in America, Creepshow), cancer. *Adolf Holl, 89, Austrian theologian.\"Kirchenrebell\" Adolf Holl ist tot *Stephen James Joyce, 87, French-born Irish-American literacy expert and executor, grandson of James Joyce. *Alfred Körner, 93, Austrian football player (Rapid Wien, national team) and manager (First Vienna).Rapid-Legende Alfred Körner ist tot *Jim Lehrer, 85, American journalist (PBS NewsHour) and novelist, heart attack. *Franz Mazura, 95, Austrian operatic bass-baritone (Metropolitan Opera) and actor (Parsifal), Grammy winner (1981, 1986).Bassbariton Franz Mazura ist tot *Gudrun Pausewang, 91, German children's writer (The Last Children of Schewenborn, Die Wolke).Schriftstellerin Gudrun Pausewang ist tot *Armando Uribe, 86, Chilean writer and diplomat, Ambassador to China (1971–1973), winner of the National Prize for Literature (2004).Fallece el escritor Armando Uribe a los 86 años de edad ===24=== *Duje Bonačić, 90, Croatian rower, Olympic champion (1952).Preminuo Duje Bonačić, najstariji hrvatski olimpijac i osvajač zlatne olimpijske medalje 1952. u Helsinkiju *Chai Chidchob, 92, Thai politician, President of the National Assembly (2008–2011). *Robert Erwin, 85, American lawyer and politician, Justice of the Alaska Supreme Court (1970–1977), problems caused from heart failure. *Leila Janah, 37, American businesswoman and writer, founder of Samasource, soft-tissue sarcoma. *Justice Pain, 41, American professional wrestler (CZW). *Seamus Mallon, 83, Northern Irish Gaelic footballer (Middletown) and politician, Senator (1982), Deputy First Minister (1998–2001) and MP (1986–2005), cancer. *Joe Payne, 35, American metal bassist (Divine Heresy, Nile). (death announced on this date) *Ibsen Pinheiro, 84, Brazilian prosecutor and politician, President of the Chamber of Deputies (1991–1993) and Deputy (1983–1994, 2003–2011), cardiac arrest.Morre Ibsen Pinheiro, presidente da Câmara no impeachment de Collor *Juan José Pizzuti, 92, Argentine football player (Banfield, Racing Club, national team) and manager.Murió Juan José Pizzuti, un emblema fundamental en la historia grande de Racing *Sean Reinert, 48, American drummer (Cynic, Death, Æon Spoke). *Rob Rensenbrink, 72, Dutch footballer (DWS, Anderlecht, national team), problems caused by PMA. *Pete Stark, 88, American politician, banker and attorney, member of the U.S. House of Representatives from California (1973–2013), leukemia. ===25=== *Liang Wudong, 60, Chinese physician, COVID-19.感染新型肺炎去世的医生梁武东为新华医院退休职工 *Tor Obrestad, 81, Norwegian author.Tor Obrestad er dod *Narciso Parigi, 92, Italian singer and actor.È morto il cantante fiorentino Narciso Parigi, aveva 92 anni *Todd Portune, 61, American politician, Hamilton County Commissioner (2001–2019), spinal cancer. *Stephen R. Reed, 70, American politician, member of the Pennsylvania House of Representatives (1975–1980) and Mayor of Harrisburg (1982–2010), prostate cancer. *Jordan Sinnott, 25, English footballer (Altrincham, Halifax Town), beaten. *Monique van Vooren, 92, Belgian-born American actress (Tarzan and the She-Devil, Happy Anniversary, Fearless Frank) and dancer.È morta Monique van Vooren, membro e sostenitrice della Ibla Foundation ===26=== *Maharaj Kishan Bhan, 72, Indian virologist and pediatrician, cancer. *Kobe Bryant, 41, American basketball player (Los Angeles Lakers), Olympic champion (2008, 2012) and Oscar winner (2018), helicopter crash. *Vsevolod Chaplin, 51, Russian Orthodox clergyman and writer.На 52-м году жизни умер протоиерей Всеволод Чаплин *Maurice Sanford Fox, 95, American geneticist and molecular biologist. *Lucy Jarvis, 102, American television producer (Family Reunion). *Nathaniel R. Jones, 93, American politician and lawyer, Judge of the Court of Appeals for the Sixth Circuit (1979–2002), congestive heart failure. *Michou, 88, French cabaret artist, pulmonary embolism.Michou, figure de la nuit parisienne, est mort *Hubert Mingarelli, 64, French writer, cancer.Le romancier Hubert Mingarelli, Prix Médicis 2003, est mort *Louis Nirenberg, 94, Canadian-American mathematician, co-developer of Gagliardo–Nirenberg interpolation inequality, Abel Prize winner (2015).Morto il grande matematico Louis Nirenberg *Bob Shane, 85, American singer and guitarist (The Kingston Trio), problems caused by pneumonia. *Clifford Wiens, 93, Canadian architect. ===27=== *Lina Ben Mhenni, 36, Tunisian political activist and blogger, stroke caused by an autoimmune disease.Disparition de Lina Ben Mheni *Jack Burns, 86, American comedian (The Andy Griffith Show), television writer (The Muppet Show) and actor (The Partridge Family), respiratory failure caused by pancreatic cancer. *Alberto Naranjo, 78, Venezuelan jazz musician and composer.Falleció El baterista y compositor Alberto Naranjo a los 78 anos ===28=== *Chris Doleman, 58, American Hall of Fame football player (Minnesota Vikings, Atlanta Falcons, San Francisco 49ers), glioblastoma. *Marj Dusay, 83, American actress (Guiding Light, The Facts of Life, MacArthur). *Frank Edwards, 69–70, American politician, Mayor of Springfield, Illinois (2010–2011), plane crash. *Narciso Elvira, 52, Mexican baseball player (Milwaukee Brewers), shot. *Paul Farnes, 101, British Royal Air Force pilot (The Few). *Harriet Frank Jr., 96, American screenwriter (Hud, Norma Rae, The Carey Treatment). *Tofig Gasimov, 81, Azerbaijani politician, Minister of Foreign Affairs (1992–1993). *Abdul Ghafoor, 60, Indian politician, MLA (1995–2005, since 2010). *Oscar N. Harris, 80, American politician, member of the North Carolina Senate (1998–2002), mayor of Dunn, North Carolina (1987–1995, 2003–2019). *Othmar Mága, 90, Czech-born German conductor (Odense Symphony Orchestra, KBS Symphony Orchestra, Theater Krefeld und Mönchengladbach).Dirigent Othmar Mága gestorben *Nicholas Parsons, 96, British actor (Four Feather Falls), radio and television presenter (Just a Minute, Sale of the Century), Rector of the University of St Andrews (1988–1991), problems caused from a fall. *Dyanne Thorne, 83, American actress (Ilsa, She Wolf of the SS, Chesty Anderson, USN, Hellhole) and stage performer, pancreatic cancer. *Yang Xiaobo, 56–57, Chinese engineer, businessman and politician, Mayor of Huangshi (2009–2014), pneumonia caused by novel coronavirus (2019-nCoV).武汉肺炎 武汉任职一前市长重症病毒死亡 (death announced on this date) ===29=== *Frank Press, 95, American geophysist and scientific writer, Director of the Office of Science and Technology Policy (1977–1981) and President of the National Academy of Sciences (1981–1993). *Yannis Tseklenis, 82, Greek fashion designer. ===30=== *John Andretti, 56, American racing driver (Nascar Cup Series, CART), colon cancer. *Miguel Arroyo, 53, Mexican road racing cyclist, National champion (2000), problems caused by surgery.Murió Miguel Arroyo, uno de los máximos exponentes del ciclismo en México *Lucien Barbarin, 63, American jazz trombonist, cancer. *Vitaliy Boiko, 82, Ukrainian lawyer and politician, Minister of Justice (1990–1992), Ambassador to Moldova (1993–1994) and Chairman of the Supreme Court (1994–2002).Умер бывший председатель Верховного Суда, экс-министр юстиции Украины Бойко *Luboš Dobrovský, 87, Czech journalist, activist and politician, Minister of Defence (1990–1992) and Ambassador to Russia (1996–2000), Charter 77 signer. *Jörn Donner, 86, Finnish screenwriter (Rooftree), movie director (Men Can't Be Raped, Anna) and politician, MP (1987–1995, 2007, 2013–2015) and MEP (1996–1999), lung disease.Jörn Donnerin puoliso MTV Uutisille: \"Hän menehtyi pitkäaikaisen keuhkosairauden jälkeen ydinperheensä läsnäollessa\" *Homero Gómez González, 50, Mexican environmental activist, engineer and politician, Mayor of Rosario, Michoacán, murdered. (body discovered on this date) *Roger Holeindre, 90, French military officer and politician, MP (1986–1988).Hommage à Roger Holeindre qui vient de nous quitter *Fred Silverman, 82, American television producer (Scooby-Doo, The Waltons, All in the Family) and businessman, CEO of NBC (1978–1981), cancer. ===31=== *Khaled Bichara, 48, Egyptian businessman, CEO of Orascom Telecom Holding (since 2009), car crash. *Alexander Joseph Brunett, 86, American Roman Catholic prelate, Archbishop of Seattle (1997–2010). *Anne Cox Chambers, 100, American media businesswoman (Cox Enterprises) and politician, Ambassador to Belgium (1977–1981). *Tony Ford, 77–78, New Zealand lawyer and jurist, Chief Justice of Tonga (2006–2010). *Mary Higgins Clark, 92, American author (A Stranger Is Watching, A Cry in the Night, Remember Me). *Janez Stanovnik, 97, Slovenian economist and politician, President (1988–1990).Janez Stanovnik (1922–2020): Partizan, ki je v žepu hkrati nosil člansko izkaznico komunistične partije in rožni venec *Dalip Kaur Tiwana, 84, Indian writer, Padma Shri recipient (2004), lung disease. ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths from the COVID-19 pandemic ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *01 Deaths",
 "title": "Deaths in January 2020"
}