{
 "id": "729191",
 "text": "Cysticercosis is a tissue infection in the body caused by young pork tapeworms. People often have few or no symptoms for years. In some cases, particularly in Asia, solid lumps of between one and two centimetres may develop under the skin. After months or years, the lumps can become painful and swollen, and then be cured. A type which is called neurocysticercosis affects the brain, and can lead to seizures. This is one of most common causes of seizures in developing countries. People usually get cysticercosis when they eat food or drink water that has tapeworms' eggs from human excrement. Tapeworm eggs are found in the excrement of someone who is infected with the adult worms, a condition called taeniasis. Taeniasis is a different disease which is caused by eating cysts in poorly cooked pork. People who live with someone who has pork tapeworms in their intestines have a higher chance of getting cysticercosis than others. Doctors can diagnose cysticercosis by taking a sample from a cyst. This process is called aspiration. Using CT scans or MRIs to take pictures of the brain is helpful for checking the brain for disease. An increased number of eosinophils, a type of white blood cell, in the cerebrospinal fluid and blood also suggests the disease. Infection can be prevented through good personal hygiene and sanitation. This includes cooking pork thoroughly, using proper toilets, practicing good hygiene, and having access to clean water. It is also important to treat people with taeniasis to stop the spread. Sometimes, surgery is done to remove the cyst. Pork tapeworm is mostly found in Asia, Sub-Saharan Africa, and Latin America. It is rare in the developed world. In 2015, it killed around 400 people worldwide. Cysticercosis also affects pigs and cows, but they rarely show symptoms as they are usually slaughtered before symptoms start. It is one of the neglected tropical diseases. ==References== Category:Infectious diseases",
 "title": "Cysticercosis"
}