{
 "id": "729135",
 "text": "Courtney Bernard Vance (born March 12, 1960) is an American actor. He was known for his roles in the movies Hamburger Hill and The Hunt for Red October, the television series Law & Order: Criminal Intent, in which he played Assistant District Attorney Ron Carver and The People v. O. J. Simpson: American Crime Story, in which he played Johnnie Cochran. He won a Tony Award in 2013 and an Emmy Award in 2016. == Filmography == Film Year Title Role Notes 1983 First Affair Male student TV Movie 1987 Hamburger Hill Spc. Abraham 'Doc' Johnson 1990 The Hunt for Red October Seaman Jones 1991 The Emperor's New Clothes Scribe (voice) TV Short 1992 In the Line of Duty: Street War Justice Butler TV Movie 1993 The Adventures of Huck Finn Jim 1993 Beyond the Law Conroy Price 1993 Percy & Thunder Thunder TV Movie 1994 Race to Freedom: The Underground Railroad Thomas TV Movie 1994 Holy Matrimony Cooper 1995 The Piano Lesson Lymon TV Movie 1995 Panther Bobby Seale 1995 Dangerous Minds George Grandey 1995 The Tuskegee Airmen Lt. Glenn TV Movie 1995 The Last Supper Luke 1995 The Affair Travis Holloway 1996 The Boys Next Door Lucien P. Singer TV Movie 1996 The Preacher's Wife Reverend Henry Biggs 1997 12 Angry Men Foreman TV Movie 1998 Blind Faith John Williams 1998 Ambushed Jerry Robinson 1998 Naked City: Justice with a Bullet Officer James Halloran TV Movie 1998 Naked City: A Killer Christmas Officer James Halloran TV Movie 1999 Cookie's Fortune Otis Tucker 1999 Love and Action in Chicago Eddie Jones co- producer 2000 Space Cowboys Roger Hines 2002 Eye See You Reverend Jones 2002 Whitewash: The Clarence Brandley Story Clarence Brandley TV Movie 2008 Nothing But the Truth Agent O'Hara 2009 Hurricane Season Mr. Randolph 2010 Extraordinary Measures Marcus Temple 2011 The Divide Delvin 2011 Final Destination 5 Agent Jim Block 2012 Joyful Noise Pastor Dale 2012 Let It Shine Pastor Jacob DeBarge TV Movie 2013 Book of the Year producer, pre-production 2014 The Farm The Sheriff (rumored) pre-production ==Television== TV Series Year Title Role Notes 1987 The 41st Annual Tony Awards Himself Performer & Nominee: Best Featured Actor in a Play 1990-1995 Law & Order Benjamin 'Bud' Greer / Mayor's Assistant Episode: By Hooker, by Crook (1990), Rage (1995) 1995 The 47th Annual Primetime Emmy Awards Himself 1995 Picket Fences Warren Grier Episode: Final Judgement, Without Mercy 1998 Any Day Now Mr. James Jackson Episode: Unfinished Symphony 1998 The Wild Thornberrys Makai (voice role) Episode: Naimina Enkiyio 2000 Boston Public Walter Harrelson 2002-2004 The American Experience Dr. Vivien Thomas / Narrator Episode: Partners of the Heart, The Fight TV series/documentary 2001-2006 Law & Order: Criminal Intent A.D.A. Ron Carver 2007 State of Mind William Banks 2008-2009 ER Russell Banfield 2009-2010 FlashForward Stanford Wedeck / Narrator 2010-2011 The Closer Chief Tommy Delk 2012 Revenge Benjamin Brooks 2013 Graceland Sam Campbell post-production ==References== Category:Tony Award winning actors Category:Emmy Award winning actors Category:1960 births Category:Living people Category:American movie actors Category:American television actors Category:American stage actors Category:American voice actors Category:Actors from Detroit",
 "title": "Courtney B. Vance"
}