{
 "id": "72962",
 "text": "A California hurricane is a tropical cyclone that affects the state of California. Usually Pacific hurricanes weaken a lot before getting to land. O Normally, rainfall is the only effect that Pacific hurricanes have on California. Sometimes, this rainfall is strong enough to cause flooding and some damage. For example, floods from Hurricane Kathleen in 1976 created damages scattered across the southeastern California area and killed three people. ==Why hurricanes do not normally hit California== The main reason why hurricanes do not hit California is because of cold sea surface temperatures off the California coastline and the California Current. Tropical cyclones usually need sea surface temperatures above 26.5 째C (80 째F) with a depth of 50 meters (160 feet) to survive. But the waters off the California coast are too cold for tropical cyclones, even during the summer.NOAA Tropical Cyclone FAQ Normally, the waters' temperatures do not get above 17 째C (70 째F), although El Nino effects may periodicly warm the pacific waters off of the California coastline. Also the California Current moves down from the northwestern US coast to the southern tip of the Baja California peninsula, which is the opposite in which Northern Hemisphere tropical cyclones move. While a few tropical cyclones may hit the southern and central areas of the Baja California peninsula, they do not make landfall any farther north than that. ==List of California hurricanes== ===1950s to 1990s=== * August 27 - August 29, 1951: The remnants of a tropical cyclone brought enough rain to wash out some roads in southern California. * September 10 - September 11, 1976 : Hurricane Kathleen crossed the peninsula of Baja California and moved into California as a tropical storm. Yuma, Arizona reported sustained winds of 91 km/h (57 mph). Rainfall from Kathleen created huge damages to southeastern California and killed at least three people. * August 18 - August 19, 1977: Hurricane Doreen dissipated off the coast of California. The remnants moved inland and created flooding and crop damage as 7.01 inches (178 mm) of rain fell on Yuma Valley, Arizona. * October 5 - October 12, 1987: Weather associated with Hurricane Ramon caused moderate to heavy rains in southern California. The highest amount noted was 2.14 inches (54 mm) at Camp Pendleton.National Weather Service Forecast Office San Diego, California. A History of Significant Local Weather Events. Retrieved on February 2, 2007. * September 13 - September 14, 1997: Hurricane Linda was at one point predicted to make landfall in California.NHC Linda Preliminary Report Instead, it moved out to sea. * September 25 - September 26, 1997: After making landfall in Baja California, Hurricane Nora kept tropical storm strength into California and Arizona. Moderate to heavy rains fell across southeast California and Arizona, with a new 24-hour maximum for Arizona 305 mm (12 inches) falling in the Mogollon Rim. Damage totaled up to several hundred million,NHC Nora Preliminary Report including US$40 million to lemon trees. The remnants of the hurricane knocked down trees in higher areas of Utah as the circulation aloft was slower to spin down than its remnant surface low. There were a few indirect deaths made by the hurricane. ===2000s=== * September 2000: The remnant low from Hurricane Lane made landfall in California with minimal effects. * September 2001: The remnants of Hurricane Flossie dissipated over the deserts of the Southwest United States and caused minor damage. * September 30, 2001: Thunderstorms from the remnants of Hurricane Juliette caused minor damage to California and brought rain of less than an inch (25 mm) to the area.http://www.hpc.ncep.noaa.gov/tropical/rain/tcmaxima.html * September 2006: Remnants of Hurricane John triggered flash flood watches.Flash Flood Watch * August 26, 2007: Remnants of Hurricane Dean made landfall in Santa Barbara area, triggering heavy rains and minor flooding throughout the Southern California Area. * August 25 2008: Tropical Storm Julio affects the state. ===2010s=== * August 6, 2015: Hurricane Guillermo results in a rare dry-season atmospheric river.http://www.weatherwest.com/wp- content/uploads/2015/08/wv.jpg ==Preparations== Because of a possible threat of California hurricanes in the future and from the damaging effects of a 1858 tropical storm,The San Diego Hurricane the National Weather Service created tropical cyclone warning stations across the southern California coast. But because of the fact that Pacific hurricanes rarely affected California, the idea of a warning station was later brought down. The most serious damage from a California hurricane would be from heavy rainfall rather than hurricane force-winds or a storm surge, although distant hurricanes may still create heavy surf, maybe hurting or killing people. NHC Linda Preliminary Report ==Related pages== * Tropical cyclone ==References== ==Other websites== * Tropical Cyclone Rainfall for the Western United States * NOAA Tropical Cyclone FAQ Subject G9 * The San Diego Hurricane of 2 October 1858 * NHC International Breakpoints list Hurricanes in California * Hurricanes in California *",
 "title": "List of California hurricanes"
}