{
 "id": "730278",
 "text": "The Phrygian cap () or liberty cap is a soft cap, in the shape of a cone, with the apex bent over, which people in antiquity thought had to do with many different peoples in Eastern Europe and Anatolia, including Phrygia, Dacia, and the Balkans. During the French Revolution it came to mean freedom and the pursuit of liberty, but Phrygian caps did not originally have this meaning.Richard Wrigley, \"Transformations of a revolutionary emblem: The Liberty Cap in the French Revolution, French History 11(2) 1997, p. 132. The original cap of liberty was the Roman pileus, the felt cap of freed slaves of ancient Rome, which also had to do with Libertas, the Roman goddess of liberty. In the 16th century, the Roman icons of liberty were used again in emblem books and coin studying handbooks where the figure of Libertas is usually shown with a pileus.Carol Louise Janson, “The Birth of Dutch Liberty. Origins of the Pictorial Imagery”, Diss. phil. University of Minnesota 1982 (microfilm), p. 35. The most common use of a headgear as a symbol of freedom in the first two centuries after the Roman iconography was commonly used again was in the Netherlands, where the cap of liberty was used in the form of a hat of that time.ibd. p. 98. In the 18th century, the traditional liberty cap was often used in English prints and from 1789 on in French prints, too; but it was not until the early 1790s, that the French cap of liberty was most often used in the Phrygian form. It is used in the coats of arms of some republics in the place where in a monarchy a crown would be used. It thus came to be identified as a symbol of the republican form of government. A number of national personifications, most commonly France's Marianne, are usually depicted wearing the Phrygian cap. ==Olympic Phryge== The name of the Paris 2024 mascot is Olympic Phryge, based on the traditional small Phrygian hats that the mascots are shaped after. The name and design were chosen as symbols of freedom and to represent allegorical figures of the French republic.https://olympics.com/en/olympic-games/paris-2024/mascot == References == Category:Hats",
 "title": "Phrygian cap"
}