{
 "id": "730406",
 "text": "The American Academy of Arts and Letters is a 250-member honor society. Its goal is to support excellence in American literature, music, and art. It is in the Washington Heights neighborhood of Manhattan in New York City. It is in Audubon Terrace on Broadway between West 155th and 156th Streets, with the Hispanic Society of America and Boricua College. The academy's galleries are open to the public. Exhibits include paintings, sculptures, photographs and works on paper from contemporary artists chosen by its members. Also works by newly elected members and award winners are shown. A permanent exhibit of the recreated studio of composer Charles Ives was opened in 2014. Musicians and engineers like to record live there because the acoustics are among the city's finest. Hundreds of commercial recordings have been made there.John Updike, ed. A Century of Arts & Letters, Columbia University Press (1998), p. 263.Barbara S. Christen and Steven Flanders, eds. Cass Gilbert, Life and Work: Architect of the Public Domain, W. W. Norton and Company (2001), p. 12. == Membership == Members are chosen for life. They have been some of the leading people in American art. Members are in committees that give annual prizes to help new artists.\"Rival to the Great French Academy Limited to 50 Members, Receives Official Recognition From the U.S. Senate; Something About Those on the Original List\", The New York Times. January 26, 1913. Women were not elected to membership in the early years.\"Immortals' Plan Hall of Fame Here; Women Would Be Eligible- But \"Better Form a Hall of Their Own\", The New York Times. November 16, 1913. In 1908, poet Julia Ward Howe was elected to the AAA, becoming the first female member.First woman elected to American Academy of Arts and Letters, Jan. 28, 1908. This is a list of some past members of the American Academy of Arts and Letters and the National Institute and Academy of Arts and Letters:The history of the National Institute of Arts & Letters and the American Academy of Arts & Letters as Told, Decade by Decade, by Eleven Members: Louis Auchincloss, Jack Beeson, Hortense Calisher, Ada Louise Huxtable, Wolf Kahn, R. W. B. Lewis, Richard Lippold, Norman Mailer, Cynthia Ozick, Arthur Schlesinger, Jr.- John Updike, Editor, Columbia University Press, New York, 1998. * Henry Brooks Adams\"Academicians Meet Here This Week; Members of Institute Will Join Them in Sessions at the Ritz-Carlton. France to send Greeting; Concert Wherein All Works Are by American Composers Will Be Heard\", The New York Times. November 12, 1916. * Herbert Adams\"Two New Members for the Academy; Dr. Barrett Wendell and Garl Melchers, the Painter, Honored at Meeting\", The New York Times. November 16, 1916. * Henry Mills Alden * Nelson Algren * Hannah Arendt * Newton ArvinAmerican Academy of Arts and Letters: Deceased Members . Retrieved January 5, 2010. * Wystan Hugh Auden * Paul Wayland Bartlett * Chester Beach\"W. R. Thayer Wins Medal; J.G. Huneker and Others Elected to Arts and Letters Institute. * Stephen Vincent Benét * William Rose Benét * Edwin Howland Blashfield * William Brownell * George de Forest Brush * John Burroughs\"Academy Honors John Burroughs; Naturalist Praised by Bliss Perry and Hamlin Garland at Memorial Meeting\", The New York Times, November 19, 1921. * William S. Burroughs * Nicholas Murray Butler * George Washington Cable * Hortense Calisher * Joseph Campbell * George Whitefield Chadwick * William Merritt Chase * Chou Wen-chung * Timothy Cole * Kenyon Cox * John Dos Passos * Bob Dylan * Thomas Harlan EllettThe Los Angeles Times, May 30, 1943, p. 49. * Stanley Elkin * Duke Ellington * Ralph Ellison * Daniel Chester French * William Gaddis * Hamlin Garland\"Elected to Academy; Brand Whitlock and Hamlin Garland in Arts and Letters\", The New York Times. January 12, 1918. * Charles Dana Gibson * Cass Gilbert * Richard Watson Gilder * Basil Lanneau Gildersleeve * Brendan Gill * William Gillette * Daniel Coit Gilman * Allen Ginsberg * Bertram G. Goodhue * Robert Grant * William Elliot Griffis\"Dr. Griffis, Friend of Japan, Dies; Educator Who Helped Japanese Adapt Themselves to Western Civilization\", The New York Times. February 6, 1928. * Arthur Twining Hadley * Childe Hassam * Thomas Hastings * David Jayne Hill * Ripley Hitchcock * Cecil de Blaquiere Howard * Julia Ward Howe * William Henry Howe * William Dean Howells * Archer Milton Huntington\"Huntington Gives Site for Academy; Men of Arts and Letters to Erect Building Near Riverside Drive and 155th St. Next to Hispanic Museum; National Institute and American Academy Accept Offer of Eight City Lots for Site\", The New York Times. January 25, 1915. * Charles Ives * Henry James * Robert Underwood Johnson * Louis I. Kahn * Kenneth Koch * Maxine Kumin * Sinclair Lewis * Roy Lichtenstein * Henry Cabot Lodge * Abbott Lawrence Lowell * Mary McCarthy * Hamilton Wright Mabie * Archibald MacLeish * Frederick William MacMonnies * Brander Matthews * William Keepers Maxwell Jr. * William Rutherford Mead * Gari Melchers * Willard Metcalf * Edna St. Vincent Millay * Charles MooreCaemmerer, H. Paul. \"Charles Moore and the Plan of Washington.\" Records of the Columbia Historical Society. Vol. 46/47 (1944/1945): 237–258, 254. * Douglas Moore * Paul Elmer More * Robert Motherwell * Georgia O'Keeffe * Thomas N. Page * Horatio Parker * Joseph PennellJoseph Pennell, Noted Artist, Dead; Won High Honors as Etcher and Illustrator — Later Taught Art and Wrote Books\", The New York Times. April 24, 1926. * Bliss Perry * William Lyon Phelps * Charles Adams Platt\"Academy Elects Gay and Lippman; Artist and Journalist Named to Vacancies Left by Deaths of Platt and Shorey\", The New York Times. November 9, 1934. * Ezra Pound * James Ford Rhodes * James Whitcomb Riley * George Lockhart Rives * Elihu Root * Theodore Roosevelt * Mark Rothko * Eero Saarinen * Carl Sandburg * John Singer Sargent * Meyer Schapiro * Arnold Schoenberg * Harry Rowe Shelley * Stuart Sherman\"First Women Elected to Institute of Arts; Edith Wharton Among the Four Chosen — American Academy Makes Two Men Members\", The New York Times. November 12, 1926. * Robert E. Sherwood * Paul Shorey\"Would Encourage Study of Classics; Academy of Arts and Letters Suggests Courses for Schools and Colleges; Sees Aid to Civilization; Resolution Says Opposite Policy Would Lower the Culture of the American People\", The New York Times. December 16, 1918. * William Milligan Sloane * Wallace Stevens * Meryl Streep\"Streep would like to thank the (arts) academy\" \"DesMoines Register.\" April 12, 2010. * Lorado Taft\"Mr. Lorado Taft Dies; Leading Sculptor; Creator of Some of Country's Outstanding Monuments is Stricken at 76; Was Teacher in Chicago; Fountain of Time and Columbus Memorial in Washington Among Chief Works\", The New York Times. October 31, 1936. * Josef Tal * Booth Tarkington * Abbott Handerson Thayer * William Roscoe Thayer * Augustus Thomas * Virgil Thomson * Lionel Trilling * Henry van Dyke * John Charles Van Dyke * Elihu Vedder * Kurt Vonnegut * Julian Alden Weir * Barrett Wendell * Edith Wharton * Andrew Dickson White * Thornton Wilder * Brand Whitlock * William Carlos Williams * Woodrow Wilson * Owen Wister * George Edward Woodberry * Frank Lloyd Wright * James A. Wright == References == ;Notes ;Sources * == Other websites == * American Academy of Arts & Letters — official website * Cornell Legal Institute: Title 36 > Subtitle II > Part B > Chapter 203 > § 20301 et seq. — easiest to read * United States House of Representatives: ** United States Government Publishing Office (GPO): — revised §4701 et seq. (1916–1998) * American Academy of Arts and Letters records, 1864–1942 from the Smithsonian Archives of American Art Category:Manhattan Category:1904 establishments Category:American writers' organizations Category:Museums in New York City Category:Organizations based in New York City",
 "title": "American Academy of Arts and Letters"
}