{
 "id": "73044",
 "text": "Gene expression is how the information in a gene (the sequence of DNA base pairs) is made into a product (such as a protein or RNA). The basic idea is that DNA is transcribed into RNA, which is then translated into proteins. Proteins make many of the structures and all the enzymes in a cell or organism. Several steps in gene expression may be tuned. This includes both the transcription and translation stages, and the final folded state of a protein. Gene regulation switches genes on and off, and so controls cell differentiation, and morphogenesis. Gene regulation may also serve as a basis for evolutionary change: control of the timing, location, and amount of gene expression can have a profound effect on the development of the organism. The expression of a gene may vary a lot in different tissues. That is how the tissues become different from each other. This is called pleiotropism. This term is important in genetics. == Epigenetics == In biology, epigenetics is the study of inherited changes in phenotype (appearance). Gene expression can be adjusted in ways other than the underlying DNA sequence. These changes may remain through cell divisions for the remainder of the individual's life, and may also last for more than one generation. However, there is no change in the underlying DNA sequence of the organism. PMID 17522671 Instead, non-genetic factors cause the organism's genes to behave (express themselves) differently. The best example of epigenetic changes in eukaryote biology is the process of cellular differentiation. Embryos start with their cells totipotent: they could become any tissue. . As embryos develop, their cells become specialised. They develop a particular function, and are part of an organ of the body. This is called morphogenesis. Epigenetic changes are long-term. During morphogenesis, totipotent stem cells become the various cell lines of the embryo, which in turn become fully differentiated cells. In other words, a single fertilized egg cell – the zygote – divides and develops. The daughter cells change into the many cell types of the mature embryo. These include neurones, muscle cells, epithelium, blood vessels and so on. This happens by activating some genes while inhibiting others. == Gene regulation == === Up- regulation and down-regulation === Up-regulation increases the expression of one or more genes and so the protein(s) coded by those genes. Down-regulation is a process resulting in decreased gene and protein expression. === Induction vs repression === Gene regulation can be summarized as: * Inducible systems: an inducible system is off unless there is the presence of some molecule (called an inducer) that allows for gene expression. * Repressible systems: a repressible system is on except in the presence of some molecule (called a corepressor) that suppresses gene activity. The molecule is said to repress expression. === Regulatory RNAs === There are a number of RNAs which regulate genes, that is, they regulate the rate at which genes are transcribed or translated. The following are two important examples ==== miRNA ==== Micro RNAs (miRNA) act by joining an enzyme and blocking mRNA (messenger RNA), or speeding its breakdown. This is called RNA interference. ==== siRNA ==== Small interfering RNAs (sometimes called silencing RNAs) interfere with the expression of a specific gene. They are quite small (20/25 nucleotides) double-stranded molecules. Their discovery has caused a surge in biomedical research and drug development. First description of siRNAs. == Related pages == *Genetic engineering *RNA splicing *ENCODE *Zinc finger *Epigenetics *Imprinting (genetics) *CRISPR == References == Category:Genetics Category:Cell biology Category:Molecular biology Category:Epigenetics",
 "title": "Gene expression"
}