{
 "id": "730565",
 "text": "This article lists nicknames for the city of Chicago, Illinois. ==Main nicknames== * \"Mud City\" – possibly the oldest nickname for the city, referring to the fact that the terrain of the city used to be a mud flat\"The city had been built, inexplicably, in the middle of a mud flat, which necessitated raising portions of the downtown area on stilts above the sloshy earth, giving Chicago the first of many nicknames: Mud City.\", Paddy whacked: The Untold Story of the Irish American Gangster, Thomas J. English, HarperCollins (c) 2005, , pp73-74, https://www.harpercollins.com/9780060590031/paddy-whacked * \"Windy City\" – origins of this name are disputed; see Windy City (nickname) * \"Chi-Town\" (pr. Shy-Town) – also used for the hockey teams Chi-Town Shooters and Chi-Town Shamrocks * \"Second City\" – this could either be coming from the fact that Chicago had the second largest metropolitan area in the United States from 1889 to 1984 (Los Angeles is now larger) or most likely it is coming from the rebuilding of the city between the Great Chicago Fire of 1871 and the World's Columbian Exposition of 1893 * \"City of the Big Shoulders\" – taken from the fifth line of Carl Sandburg's poem \"Chicago\" ==Other Nicknames== ** \"City by the Lake\" – used as early as the 1890sSeeger, Eugen. \"Chicago, the Wonder City\" (p. 384) G. Gregory Printing Company, 1893 – Chicago ** \"City in a Garden\" – English translation of the Latin motto on the city seal: \"Urbs in Horto\" ** \"The City that Works\" – slogan from Mayor Richard J. Daley's tenure as mayor, describing Chicago as a blue-collar, hard-working city, which ran relatively smoothlyAdams, Cecil (2009) \"What's the origin of 'The city that works'? \" ** \"Great Commercial Tree\" – from the State Anthem of Illinois ** \"Heart of America\" – Chicago is one of the largest transportation centers in America and its location is near the center of the United States ** \"The Great American City\" – taken from Pulitzer Prize-winning novelist Norman Mailer's book \"Miami and the Siege of Chicago\" (1968): \"Chicago is the great American city ... perhaps [the last] of the great American cities\";Mailer, Norman (1968). \"Miami and the Siege of Chicago: An Informal History of the Republican and Democratic Conventions of 1968\" (p. 83) New American Library – New York, 1968 \"the notion that Chicago is arguably the most quintessential American city\"Sampson, Robert J. (2012). \"Great American City: Chicago and the Enduring Neighborhood Effect\" (p. 77) University of Chicago Press – Chicago was central to Robert J. Sampson's landmark research on communities, criminology, and urban sociology - Great American City: Chicago and the Enduring Neighborhood Effect (2012) ** \"My Kind of Town\" – from the song \"My Kind of Town (Chicago Is)\" (music by Jimmy Van Heusen, words by Sammy Cahn, 1964) popularized by Frank Sinatra in the movie Robin and the Seven Hoods about a fictional popular Chicago gangster ** \"The City Beautiful\" – reference to the reform movement sparked by the World's Columbian Exposition,Levy, John M. (2009) Contemporary Urban Planning. used by Hawk Harrelson when the Chicago White Sox open a game at U.S. Cellular Field ** \"Chi-beria\" – a play on Siberia, a nickname largely used during the 2014 North American Cold Wave and during harsh cold winter timesParker, Alex (January 5, 2014). \"Chicago Extreme Cold: City Dubbed 'Chiberia' as Dangerous Weather Moves In\" , DNAinfo. Retrieved January 23, 2016. ** \"Chiraq\" or \"Chi-Raq\" – a very controversial nickname coming from the combination of Chicago and Iraq. This is because of Chicago's high crime rates to the war-torn country Iraq; Spike Lee's 2015 movie Chi-Raq uses it as the title; considered offensive by many residents of the Chicago area **The 312 – reference to the area code used in The Loop and is seen on AT&T; ads in the city ==References== Category:Chicago Nicknames",
 "title": "List of nicknames for Chicago"
}