{
 "id": "730762",
 "text": "A spaniel is a type of gun dog. Spaniels were especially bred in the 1700's in Great Britain to flush game birds out of thick bushesGoodall and Gasow, The New Complete English Springer Spaniel, 1984. There are many types of spaniel dogs, the most popular ones are the Cocker Spaniel, the English Springer Spaniel, the Field Spaniel and the Welsh Springer Spaniel. ==Types of Spaniel== ===Recent species=== Type of Spaniel Also known as Country/region of origin Min. height Max. height Min. weight Max. weight Image American Cocker Spaniel Cocker Spaniel (in the United States) United States Fogle (2006): p. 152 American Water Spaniel United States Palika (2007): p. 131 Blue Picardy Spaniel Epagneul Bleu de Picardie France Fogle (2006): p. 230 Boykin Spaniel United States Palika (2007): p. 172 Cavalier King Charles Spaniel England Clumber Spaniel England Smith (2002): p. 128 Drentse Patrijshond Dutch Partridge Dog Netherlands English Cocker Spaniel Cocker Spaniel (In the United Kingdom) England English Springer Spaniel Springer England Smith (2002): p. 134 Field Spaniel England Palika (2007): p. 237 German Spaniel Deutscher Wachtelhund Germany Fogle (2006): p. 344 Irish Water Spaniel Whiptail, Shannon Spaniel, Rat Tail Spaniel, and Bog Dog Ireland Palika (2007): p. 269 King Charles Spaniel English Toy Spaniel (in the United States) England Palika (2007): p. 232 Kooikerhondje Netherlands Markiesje Dutch tulip dog Netherlands Papillon Continental Toy Spaniel, Épagneul Nain Continental France Palika (2007): p. 311 Phalène Continental Toy Spaniel, Épagneul Nain Continental Belgium Picardy Spaniel Épagneul Picard France Pont-Audemer Spaniel Épagneul Pont-Audemer France Russian Spaniel Russian hunting spaniel (Русский охотничий спаниель) Russia Stabyhoun Frisian Pointer dog Netherlands Sussex Spaniel England Welsh Springer Spaniel Welshie Wales Smith (2002): p. 122 ===Extinct=== Type of Spaniel Country/region of origin Period of extinction Image Alpine Spaniel Switzerland 1830s English Water Spaniel England 1930s Norfolk Spaniel England 1902 Toy Trawler Spaniel United Kingdom 1920s Tweed Water Spaniel England 19th century ===Wrongly named=== The following types are not spaniels. They are called spaniels as they looked like spaniels. Type of Spaniel Also known as Country/region of origin Min. height Max. height Min. weight Max. weight Image Japanese Chin Japanese Spaniel Japan Fogle (2006): p. 67 Pekingese Chinese Spaniel China Palika (2007): p. 315 Tibetan Spaniel Tibet Palika (2007): p. 375 ==References== * * * Category:Hunting Category:Working dogs",
 "title": "Spaniel"
}