{
 "id": "730907",
 "text": "Ireland is mostly the Republic of Ireland (which does not have a monarchy) and partly Northern Ireland (whose monarch is Charles III). Northern Ireland is part of the United Kingdom of Great Britain and Northern Ireland, a constitutional monarchy. Until the 20th century, all Ireland had a constitutional monarchy and was a part of the United Kingdom since 1801. Monarchies were in existence through most of the history of Ireland. In the High Middle Ages, the Gaelic kingdoms of Ireland ended when the Normans invaded Ireland. Ireland became a fief of the Papal States (the government of the Pope). The King of England's government started to control many of the lands of Ireland. This continued until the English Reformation, when the Kingdom of England got full ownership of Ireland. The Kingdom of Ireland came into existence in the reign of Henry VIII. Henry VIII was the first to be both King of England and King of Ireland. The Kingdom of Ireland started in 1542. Before 1603, Ireland shared a monarch with the Kingdom of England (but not with the Kingdom of Scotland) in a personal union. When Henry VIII's daughter Elizabeth I died in 1603, James VI and I became the first to be King of Ireland, King of England, and King of Scotland in a three-kingdom personal union. Between 1603 and 1707, the Kingdom of Ireland shared the monarchs of the Kingdom of Scotland and the Kingdom of England. Anne was the Queen of Ireland when the United Kingdom of Great Britain came into existence in 1707. Anne was Queen of Ireland and Queen of Great Britain. Between 1707 and 1801, the Kingdom of Ireland shared the British monarchy with the United Kingdom of Great Britain. (During the government of Oliver Cromwell, the British Isles became a republic: the Commonwealth of England, Scotland, and Ireland.) George III was King of Ireland when the United Kingdom of Great Britain and Ireland came into existence at the start of 1801. George III was the first to be king of the new kingdom, which combined the whole British Isles (except the Isle of Man) into one kingdom for the first time. In December 1922, most of Ireland left the United Kingdom to become part of the Irish Free State, a dominion within the British Empire; the rest, Northern Ireland, remained within the United Kingdom. In 1937, after George V died, the Free State changed its laws to give the British monarchs much less power. In April 1949, the Republic of Ireland stopped having a monarchy entirely, and left the Commonwealth of Nations. Since then, the only part of Ireland to have a monarchy is Northern Ireland (because it is part of the United Kingdom). Elizabeth II was the former queen, but passed in 2022. Charles, Prince of Wales was named the King of the United Kingdom in September 2022. ==References== Category:Ireland Category:Monarchy Category:Northern Ireland Category:British royalty",
 "title": "Monarchy of Ireland"
}