{
 "id": "731177",
 "text": "Scene is a British television anthology drama/documentary series. It was made by the BBC for teenagers. It had plays on current issues and some documentaries. The plays were by leading contemporary playwrights. Playwrights included Willy Russell, Fay Weldon, Tom Stoppard, Alan Plater, Al Hunter Ashton. They were first broadcast to a school audience as part of BBC Schools. Dramas from the series were also broadcast for a wider adult audience. The series ran from 1968 to 2002. Some of the dramas received awards. Scene was a series of 30 minute dramas and documentaries suitable for showing to teenage schoolchildren as part of the English and Humanities curriculum. It was thought that the dramas shown would stimulate discussion in the classroom about contemporary issues relevant to teenagers. This included topics such as race, drugs, sex, and disability. Critical reaction was positive with praise for the high production standards.Wheatley, p188. Some of the actors featured in Scene became successful. for example: Jemima Rooper (Junk, 1999), Sarah Jane Potts, Jack Deam, Lucy Davis (Alison, 1996), Adrian Lester (Teaching Matthew, 1993), Sean Maguire (A Man of Letters, 1994), Peter Howitt (Stone Cold). ==Award winners and nominees== *Terry (1969) – BAFTA Flame of Knowledge Award. *A Collier's Friday Night (1976) – BAFTA Flame of Knowledge Award. *Loved Up (1996) – BAFTA for best schools drama. Series Ass.Producer Andy Rowley *Alison (1996) – BAFTA nomination for best schools drama. Series Producer Andy Rowley *United (1998) – BAFTA for best schools drama. Produced and directed by Michael McGowan. *Junk (1999) – BAFTA for best schools drama. *Offside (2002) – BAFTA for best schools drama. *Split game (2005) – BAFTA nomination for best schools drama.See BAFTA nominations database *Stone Cold' BAFTA nomination 1998 Producer Andy Rowley Director Stephen Whittaker ' ==Selected episodes== Terraces (1993). The residents of a street of terraced houses decide to paint them all in the colours of their local football team – all except one man who refuses to conform to mob rule. Written by Willy Russell. Loved Up (1995). A young woman leaves home to live with her boyfriend and discovers the rave scene and ecstasy. Series producer Andy Rowley. A 2 x 30 minute abridged version of a BAFTA-winning drama. Alison (1996): BAFTA- nominated Comedy-drama. Terry Kennett decides to return to his home town after a ten-year absence. He bumps into old friends and his former girlfriend Alison who shows him around their old haunts. They reminisce about their teenage romance, first sexual experience and the reasons for their eventual breakup. Terry is shocked to find that Alison is now a young single mother, but decides to rekindle their relationship in the hope that former mistakes are behind them. Written and directed by Al Hunter Ashton and produced by Andy Rowley. Starring Sarah Jane Potts and Jack Deam. Teaching Matthew written by Al Hunter Ashton. A satire on Willy Russell's Educating Rita. Adrian Lester played Matthew. Ashton acted in the film. He played Sergeant Conway. Stone Cold (1997) Starring Peter Howitt. Link becomes homeless after abuse at home and is prey to a street killer. Directed by Stephen Whittaker and produced by Andy Rowley. BAFTA nominated. Junk (1999): Bafta-winning drama. Following difficulties with her parents, teenager Gemma Brogan leaves home. She falls under the spell of a young woman who introduce her to the world of alternative youth culture and drugs. Initially her new life seems glamorous and exciting but she soon discovers its dark side as she slides into heroin addiction.Junk (English and media.co.uk) Starring Jemima Rooper. ==References== ==Further reading== *Wheatley, Helen. Re-viewing television history: critical issues in television historiography (I. B. Tauris & Co., 2007), p186 ff. ==Other websites== *Scene at BroadcastForschools.co.uk *Scene at the BFI Film and Television Database Category:1960s British television series Category:1970s British drama television series Category:1980s British drama television series Category:1990s British drama television series Category:2000s British drama television series",
 "title": "Scene (British TV series)"
}