{
 "id": "731332",
 "text": "The Wolfsberg District is a district in the state of Carinthia in Austria. The capital is Wolfsberg. == Municipalities == Towns are indicated in boldface; market towns in italics; suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. *Bad Sankt Leonhard im Lavanttal (1) **Bad St. Leonhard im Lavanttal, Erzberg, Görlitzen, Gräbern, Gräbern, Kalchberg, Kliening, Lichtengraben, Mauterndorf, Prebl, Raning, Schiefling, Schönberg, Steinbruch, Twimberg, Wartkogel, Wiesenau, Wisperndorf *Frantschach-Sankt Gertraud (2) **Frantschach, Hintergumitsch, Hinterwölch, Kaltstuben, Kamp, Kamperkogel, Limberg, Obergösel, Praken, St. Gertraud, Trum- und Prössinggraben, Untergösel, Vorderlimberg, Vorderwölch, Zellach *Lavamünd (3) **Achalm, Ettendorf, Hart, Krottendorf, Lamprechtsberg, Lavamünd, Lorenzenberg, Magdalensberg, Pfarrdorf, Plestätten, Rabenstein, Rabensteingreuth, Schwarzenbach, St. Vinzenz, Unterbergen, Unterholz, Weißenberg, Witternig, Wunderstätten, Zeil *Reichenfels (5) **Reichenfels, Sommerau, St. Peter im Lavanttal, Weitenbach *Preitenegg (4) **Kleinpreitenegg, Oberauerling, Oberpreitenegg, Preitenegg, Unterauerling, Unterpreitenegg *Sankt Andrä (6) **Aich, Blaiken, Burgstall-Pölling, Burgstall-St. Andrä, Dachberg, Eisdorf, Eitweg, Farrach, Fischering, Framrach, Gemmersdorf, Goding, Gönitz, Hainsdorf, Höfern, Jakling, Kienberg, Kleinedling, Kleinrojach, Kollegg, Lamm, Langegg, Langgen, Lindhof, Magersdorf, Maria Rojach, Messensach, Mettersdorf, Mitterpichling, Mosern, Mühldorf, Oberagsdorf, Oberaigen, Obereberndorf, Oberpichling, Paierdorf, Pichling, Pirk, Pölling, Pustritz, Ragglach, Ragglbach, Reisberg, Schaßbach, Schobersberg, Schönweg-Pustritz, Schönweg-St. Andrä, Siebending, St. Andrä, St. Jakob, St. Ulrich, Streitberg, Tschrietes, Unteragsdorf, Unteraigen, Untereberndorf, Unterrain, Völking, Wimpassing, Winkling-Nord, Winkling-Süd, Wölzing-Fischering, Wölzing-St. Andrä, Zellbach *Sankt Georgen im Lavanttal (7) **Allersdorf, Andersdorf, Fransdorf, Götzendorf, Gundisch, Herzogberg, Krakaberg, Matschenbloch, Niederhof, Oberrainz, Pfaffendorf, Pontnig, Raggane, St. Georgen im Lavanttal, Steinberg-Hart, Steinberg-Oberhaus, Steinberg- Unterhaus, Unterpichling, Unterpichling, Unterrainz *Sankt Paul im Lavanttal (8) **Deutsch-Grutschen, Gönitz, Granitztal-St. Paul, Granitztal-Weißenegg, Hundsdorf, Johannesberg, Kampach, Kollnitzgreuth, Legerbuch, Loschental, Schildberg, St. Margarethen, St. Martin, St. Paul im Lavanttal, Stadling, Unterhaus, Unterholz, Weinberg, Windisch-Grutschen, Winkling, Zellbach *Wolfsberg (9) **Aichberg, Altendorf, Arling, Auen, Eselsdorf, Forst, Glein, Gräbern, Gries, Großedling, Hartelsberg, Hartneidstein, Hattendorf, Hintertheißenegg, Kleinedling, Kleinwinklern, Klippitztörl, Kötsch, Kragelsdorf, Lading, Lausing, Leiwald, Magersdorf, Maildorf, Michaelsdorf, Oberleidenberg, Paildorf, Pfaffendorf, Pollheim, Prebl, Preims, Priel, Raggl, Reding, Reideben, Reinfelsdorf, Reisberg, Rieding, Riegelsdorf, Ritzing, Schilting, Schleifen, Schoßbach, Schwemmtratten, Siegelsdorf, St. Jakob, St. Johann, St. Marein, St. Margarethen im Lavanttal, St. Michael, St. Stefan, St. Thomas, Thürn, Unterleidenberg, Völking, Vordergumitsch, Vordertheißenegg, Waldenstein, Weißenbach Gumitsch, Weißenbach Rieding, Witra, Wois, Wolfsberg, Wolkersdorf, Wölling Category:Districts of Carinthia (state)",
 "title": "Wolfsberg District"
}