{
 "id": "73162",
 "text": "X-Men is a 2000 superhero movie based upon the fictional characters the X-Men. The movie is about mutants who are the next evolutionary step of humanity. These mutants are feared and hated by most of humanity. The movie was directed by Bryan Singer. It deals with the ideas of prejudice and discrimination in the United States. The screenplay was written by David Hayter. A sequel, X2, was released in 2003 and a third movie, X-Men: The Last Stand, was released in 2006. A fourth film, X-Men: Days of Future Past. A prequel trilogy has been made, the prequel series is currently formed by X-Men: First Class, X-Men: Apocalypse and Dark Phoenix. == Plot == Professor Charles Xavier (the world's most powerful telepath) takes gifted children and teaches them to control their powers for good. He does this at Xavier's Academy for Gifted Youngsters, his school for mutants. This school is the home to the X-Men. The story is about the X-Men trying to stop Erik Lehnsherr (also known as Magneto), a mutant who blames humanity for the death of his family during the Holocaust. Magneto does not believe that humans and mutants can live together in peace. He builds a machine that turns humans into mutants. == Cast == * Hugh Jackman as Logan / Wolverine * Patrick Stewart as Professor Charles Xavier * Anna Paquin as Marie D'Ancanto / Rogue * Ian McKellen as Erik Lehnsherr / Magneto * Bruce Davison as Senator Kelly * James Marsden as Scott Summers / Cyclops * Famke Janssen as Dr. Jean Grey * Halle Berry as Ororo Munroe / Storm * Rebecca Romijn-Stamos as Mystique * Ray Park as Toad * Tyler Mane as Sabretooth * Shawn Ashmore as Bobby Drake / Iceman === Filming === Filming took place from September 22, 1999 to March 3, 2000 in Toronto. Wolverine's claws required a full silicone cast of Hugh Jackman's arm, and 700 versions for Jackman and his stunt doubles. === Music === Bryan Singer asked John Williams to compose the music for the movie, but Williams was too busy composing for Saving Private Ryan. == Reactions and box office == The movie was one of the biggest hits of 2000. It earned more than $296 million worldwide and was the 8th highest grossing movie in the United States that year. == Crazy credits == * When the 20th Century Fox logo disappears the \"X\" in \"Fox\" glows and remains on a black background than the other letters. ==References== == Other websites == * TheXverse.com: X-Men Movie News * * * X-Men on Marvel.com * X-Men Comics Message Board Category:2000 movies Category:2000s superhero movies Category:X-Men movies Category:Movies directed by Bryan Singer Category:Movies produced by Avi Arad Category:Movies produced by Lauren Shuler Donner Category:Movies composed by Michael Kamen Category:Movies set in New York City Category:Movies set in the 1940s Category:20th Century Fox movies",
 "title": "X-Men (movie)"
}