{
 "id": "731869",
 "text": "{{Infobox cat breed | name = Maine Coon | image = Maine Coon cat by Tomitheos.JPG | imagecaption = A Maine Coon in the snow | altname = Coon Cat Maine Cat Maine Shag American Longhair American Coon Cat American Forest Cat | nickname = Gentle giants | country = Maine, United States | notrecognized = | extinct = | cfastd = http://www.cfa.org/Portals/0/documents/breeds/standards/maine.pdf | fifestd = http://www1.fifeweb.org/dnld/std/MCO.pdf | ticastd = http://www.tica.org/members/publications/standards/mc.pdf | gccfstd = http://www.gccfcats.org/Portals/0/MaineCoon.SOP.pdf | acfastd = http://www.acfacat.com/Breed%20Standards/MAINE%20COON.pdf | acfstd = http://www.acf.asn.au/notices/notices/standards/2015_Group%201_Maine%20Coon.pdf | ccastd = | otherstd = | note = |}} The Maine Coon is the biggest cat breed used as a pet. It has a unique look and good hunting skills. It is one of the oldest natural breeds in North America. It is native to the state of Maine, where it is the official state cat. Nobody knows for sure how the Maine Coon got to the United States, so there are many different ideas. The breed was popular in cat shows in the late 19th century. It almost became extinct in the early 20th century because of long-haired breeds being more popular. The Maine Coon became more popular in the 1970s. It is now one of the most popular cat breeds in the USA. The Maine Coon is a large and friendly cat. This is how it got its nickname, \"the gentle giant\". It is known for having a big ruff along its chest, robust bone structure, rectangular body shape, an uneven two layered coat, and a long, bushy tail. The breed can be many different colors. If a Maine Coon is chocolate or lilac colored, it could be a crossbreed. People often say the Maine Coon is similar to dogs. Because the cat is so big, professionals have seen certain health problems that Maine Coons get. Some of these are feline hypertrophic cardiomyopathy and hip dysplasia. Many breeders do things to make these problems happen less. == References == Category:Cat breeds Category:Natural cat breeds",
 "title": "Maine Coon"
}