{
 "id": "731894",
 "text": "The Croatian checkerboard or chequy (Croatian: šahovnica ) is the national symbol of Croatia. It is the main shield of the Croatian coat of arms. On top of the main shield is the crown with five smaller shields, each representing a region of Croatia. The squares in the šahovnica are always arranged the right way, colored red and white. Historically, the order varied. ==Origin== There is a legend, probably from the 19th century, which talks about how the Croatian king Držislav, captured by the Venetians, played a chess match. His opponent was Doge Pietro II Orseolo. He won and became free, and in some versions of the story he also got power over the Dalmatian cities. Then he put the chessboard in his coat of arms. It first came into use in Croatian coat of arms around year 1495, as depicted on a temple hall located in Innsbruck, Austria. There is likelyhood that it has been borrowed by the House of Habsburg (who ruled the Hungarian-Croatian throne at the time) from other West Slavic coats of arms, as the silver-red colored pattern was popular among the 12–14th century Polish and Czech noble families. The cheque pattern in European heraldry was likely inspired by the board game of chess. It is considered as the national symbol of Croatia, and is prominently displayed at sporting events. As such, the pattern in these colors remains associated mostly with the nation of Croatia. ==Gallery== Croatian chequey.jpg|The Croatian chequy on a church in Baška Croatian_Coat_of_Arms_1495.JPG|The first known Croatian chequy as shown in Innsbruck, Austria (1495). Croatian coa 1527.png|The coat of arms of Croatia, used in 1527 as part of a seal on the Cetingrad Charter. Wappen_K%C3%B6nigreich_Croatien_%26_Slavonien.png|Coat of arms of the Kingdom of Croatia (1525-1868). Wappen_K%C3%B6nigreich_Croatien.jpg|Coat of arms of the Croatian Crown land (until 1868) Coa Croatia Country History (with crown) (1868-1918).svg|Coat of arms of the Kingdom of Croatia-Slavonia (1868–1918). Coa Hungary Country History Mid (1867).svg|Coat of arms of Transleithania (1868-1915). Domoljubna značka 1914.jpg|Patriotic badge from 1914 Coat of Arms of the Banate of Croatia.svg|Banovina of Croatia (1939–1943). Greater coat of arms of the Banate of Croatia.svg|Banovina of Croatia greater version (1939–1943). Coat of arms of Croatia (1941–1945).svg|Independent State of Croatia (1941–1945). Coat of Arms of Socialist Republic of Croatia.svg|Socialist Republic of Croatia (1947–1990). Coat of arms of Croatia (white chequy).svg|Early coat of arms of the Republic of Croatia (1990). Croatia COA heater.svg|Coat of arms of Croatia proper ==References== Category:Coats of arms Category:History of Croatia Category:Chess Category:National symbols of Croatia",
 "title": "Croatian checkerboard"
}