{
 "id": "731914",
 "text": "Bacterial vaginosis (BV) is a disease of the vagina caused by a large growth of bacteria. Common symptoms include increased vaginal discharge that often smells like fish. The discharge is usually white or gray in color. Burning with urination may occur It also increases the risk of early delivery among pregnant women. == Diagnosis == To make a diagnosis of bacterial vaginosis, a swab from inside the vagina is taken. These swabs can be tested for: * Gram stain which shows the depletion of lactobacilli and overgrowth of Gardnerella vaginalis bacteria. Bacterial vaginosis is usually confirmed by a Gram stain of vaginal secretions. * A characteristic \"fishy\" odor on wet mount. This test, called the whiff test, is performed by adding a small amount of potassium hydroxide to a microscope slide containing the vaginal discharge. A characteristic fishy odor is considered a positive whiff test and is suggestive of bacterial vaginosis. * Loss of acidity. To control bacterial growth, the vagina is normally slightly acidic with a pH of 3.8–4.2. A swab of the discharge is put onto litmus paper to check its acidity. A pH greater than 4.5 is considered alkaline and is suggestive of bacterial vaginosis. * The presence of clue cells on wet mount. Similar to the whiff test, the test for clue cells is performed by placing a drop of sodium chloride solution on a slide containing vaginal discharge. If present, clue cells can be visualized under a microscope. They are so-named because they give a clue to the reason behind the discharge. These are epithelial cells that are coated with bacteria. Differential diagnosis for bacterial vaginosis includes the following: * Normal vaginal discharge. * Candidiasis (thrush, or a yeast infection). * Trichomoniasis, an infection caused by Trichomonas vaginalis. * Aerobic vaginitis The Center for Disease Control (CDC) defines STIs as \"a variety of clinical syndromes and infections caused by pathogens that can be acquired and transmitted through sexual activity.\" But the CDC does not specifically identify BV as sexually transmitted infection. ==References== Category:Diseases caused by bacteria Category:Diseases and disorders of the female reproductive system",
 "title": "Bacterial vaginosis"
}