{
 "id": "731978",
 "text": "Vita Kin (; 25 November 1969) is a Ukrainian fashion designer and photographer. Author of embroidered dresses, founder of the Vita Kin brand. == Biography == Vita Kin was born in Kyiv, Ukraine. She has been engaged in advertising and fashion photography since 2010. Her work has often been seen in fashion magazines in Ukraine. In 2008, Kin launched her own clothing brand Vita Kin for Kindom, which specialized in dresses for the 70s. This brand worked until 2013. In 2013, the designer created the Vyshyvanka by Vita Kin brand, which is based on outfits inspired by the Ukrainian national costume, Vyshyvanka. The first collections were released under the motto \"Chic Nationale\". During Paris Fashion Week 2015, Ukrainian fashion designer Vita Kin was featured in Vogue magazine and in Harper's Bazaar for introducing vyshyvankas as modern Bohemian style designs. In April 2015, a Vita Kin collection of embroidered dresses was noted by The Guardian, which quotes the designer as saying that \"she can’t stand politics, and she doesn’t want her clothing in any way associated with it\". Also in 2015, The Wall Street Journal named embroidered shirts from Vita kin the most popular summer dresses of 2015. In September, Vita became \"The Best Newscomer of 2015\" of the Best Fashion Awards. In November 2015, Kin became “The Best Womenswear Designer in Ukraine” of the Elle Style Awards. In February 2018, Vita Kin was included in the Top 20 Ukrainian innovators according to Focus magazine. In the spring of 2018, Vita Kin presented a joint collection with the Eres brand. In 2019, Vita presented a new collection of dresses. In December 2019, Vita Kin collaborated with Amanda Brooks to create a collection of table linens. === Recognition === * 2015 — Best Fashion Awards — The Best Newscomer * 2015 — Elle Style Awards — The Best Womenswear Designer in Ukraine * 2018 — Focus magazine — The Top 20 Ukrainian Innovators === Personal life === Since 1999, Vita Kin is married to Roman Kindrachuk, co-owner of Radioaktive Film production. == References == ==Other websites== * Category:People from Kyiv Category:1969 births Category:Living people",
 "title": "Vita Kin"
}