{
 "id": "732102",
 "text": "Holby City (styled as HOLBY CI+Y) is a British medical drama television series shown weekly on BBC One. The series was created by Tony McHale and Mal Young as a spin-off from the BBC medical drama Casualty. It was first shown on 12 January 1999; the show ran until 29 March 2022. It is set in the same hospital as Casualty in the fictional city of Holby. Some episodes have characters and plots shared with Casualty. There have been episodes broadcast as Casualty@Holby City. Some episodes have characters and plots shared with the show's 2007 police procedural spin-off HolbyBlue. Holby City is shown once a week, all year round. Each series now contains 52 episodes. The show follows the lives of medical and ancillary staff at the fictional Holby City Hospital. As of January 2020, twenty-one series of Holby City have been shown. It is made at the BBC Elstree Centre in Hertfordshire. It has featured episodes filmed on location abroad. From October 2010, Holby City moved to high definition broadcasting. The series uses a team of researchers to ensure medical accuracy. Surgeons check the scripts. Cast members are taught to perform basic medical procedures. They spend time on hospital wards for research. Holby City has been nominated for over 100 television awards. It has won ten awards. The 2008 British Academy Television Award for Best Continuing Drama, one Black Entertainment Film Fashion Television and Arts (BEFFTA) award, two Ethnic Multicultural Media Awards, two Music Video and Screen Awards, and four Screen Nation awards. The first series averaged 9.27 million viewers. The eleventh series averaged 5.44 million viewers. Later series have had over 4 million viewers per week. ==Production== The first series had eleven main characters. All have since left the show. New main characters have been written in and out of the series. There are fifteen main characters. Well known actors regularly appear. Cast members have included Patsy Kensit, Jane Asher, Robert Powell, Ade Edmondson, John Michie, Al Hunter Ashton, Alex Walkinshaw and Jemma Redgrave. In September 2016 the BBC said the show would be put up for tender. The tender document said the contract would be open to independent producers and BBC Studios. It would be for three series of at least 50 episodes each. It would be delivered from December 2017 with no break in transmission. It would be produced at BBC Elstree Centre. BBC Studios was the winning bidder and will continue to produce the show to 2020. ===Development=== Holby City was created by Tony McHale and Mal Young as a spin-off from the BBC medical drama Casualty. It is set in the fictional Holby City Hospital. Young wanted to explore what happened to patients treated in Casualty once they were taken to the hospital's surgical wards. The stories on Casualty are limited to the \"accident of the week\". Holby City has stories about long-term care, rather than immediate life and death decisions. The series was commissioned by BBC One Controller Peter Salmon. It was first shown on BBC One on 12 January 1999. Since its beginning, it has expanded to cover other wards. These include a gynaecology ward, an acute assessment unit and a maternity ward. Young explained that new wards are necessary to allow the crew to rotate sets. Episodes of Holby City cost around £370,000 to produce. This is more than the BBC soap opera EastEnders which costs £130,000 per episode. Casualty costs £450,000 per episode. As Holby City is a high-volume, year- round production, it has relatively low production costs. Set-up costs can be spread over many years. Sets can be re-used. This is not the case for shorter series or one-off dramas. Former Casualty producer Johnathan Young was an executive producer of Holby first series. Mal Young was executive producer of Holby City until 2004. Kathleen Hutchison worked with Mal Young as co- executive producer from 2003 to 2004. She left the series to become executive producer of EastEnders. In March 2011, Johnathan Young returned to the BBC as executive producer of both Casualty and Holby City. ===Writing=== Holby City storylines are planned eight months in advance. The series has a number of scriptwriters. They are found and scheduled by script development editor Simon Harper. Harper finds some writers through the BBC Writers Academy. This is a course which gives its graduates the chance to work on prime time television. McHale teaches at the academy, and graduate Abi Bown went on to become a regular writer for Holby City. Harper also recruits writers through the BBC's Continuing Drama Shadow Scheme. McHale wrote the series' first episode, and served as the show's lead writer. His 2006 promotion to executive producer was part Controller of BBC Drama Production John Yorke's plan to \"put writers back at the heart of the process\". Yorke said McHale's promotion was \"fantastic. It means that for the first time you've got a writer running one of our big powerhouse BBC1 shows.\" After McHale resigned the lead writer was Justin Young. He wants a more writer-led process from series 13 onwards. Writers will create more of the story of their episodes than before. ===Medical accuracy=== The serial employs a team of researchers to advise writers on nursing issues and health service politics. One medical advisor was given a cameo appearance in the series as an orthopaedic surgeon. Another advisor, recovery nurse Rachel Carter, appears in Holby City as a scrub nurse. The programme uses different types os surgeons to check scripts for accuracy. Carter believes this is important as viewers might copy what they see in the show, such as CPR. Actor Amanda Mealing said: \"We pride ourselves on being realistic. You need to know what you are doing and why. It is a complex and foreign thing to act out an operation. For training, I watched a number of real ones.\" Cast members are taught how to give injections, monitor blood pressure and check a pulse, and some watch procedures in hospitals. Original cast member George Irving observed coronary artery bypass surgery performed at Papworth and Middlesex Hospital in preparation for his role as Anton Meyer. Edward MacLiam observed laparoscopic surgery being performed before joining the cast as Greg Douglas in series twelve. ===Filming and on-screen output=== Holby City and Casualty are both set in Holby City Hospital. This is in the fictional county of Wyvern in the southwest of England close to the Welsh border. Bristol is used for city exteriors. Interior filming of Holby City is at BBC Elstree Centre in Borehamwood, Hertfordshire. The Casualty set in Bristol was not large enough for the surgical ward and operating theatre needed for Holby City. So some scenes in the first episode had to be shot twice, first on the Casualty set and then again at Elstree, with cast members travelling between the two locations. In October 2007, The Daily Telegraph reported that the Elstree site would be sold, and Holby City moved to share a set with Casualty, possibly in Cardiff. In March 2009, the BBC said that Casualty would move to a new set in Cardiff. In April 2009, The Guardian said that the BBC would retain Elstree Studios for at least another four years. Some episodes have been shot on location abroad. In 2004, the romance between nurse Jess Griffin (Verona Joseph) and anaesthetist Zubin Khan (Art Malik) had an episode set in Paris. In 2005, registrar Diane Lloyd (Patricia Potter) followed consultant Ric Griffin (Hugh Quarshie) to Ghana. This was part of the BBC's \"Africa lives\" series, a week of programmes bringing African culture to UK audiences. In 2006, an episode in Switzerland had consultant Elliot Hope's (Paul Bradley) wife Gina (Gillian Bevan) committing assisted suicide after her motor neurone disease worsened. A 2007 episode in Dubai focused on Holby registrar Joseph Byrne (Luke Roberts) meeting new nurse Faye Morton (Patsy Kensit). In 2008, Joseph and consultant Linden Cullen (Duncan Pow) travelled to Cape Town. In November 2008, series producer Diana Kyle said that they would not be filming abroad again for the \"foreseeable future\". On 10 December 2012, it was announced that the show had filmed one episode in Stockholm. This focussed on Jac tracking down hospital CEO Henrik Hanssen (Guy Henry). Holby City is shot using the single-camera setup. Filming occurs from 8 am until 6 pm daily, 50 weeks a year. From July 2007 onwards, the show took on the filmising technique, giving the impression of having been shot on film. On 28 May 2010, the BBC announced that Holby City would move to HD by the end of the year. The series moved to HD broadcasting, with a BBC HD simulcast, from the start of series 13 in October 2010. ===Music=== From the eleventh series a musical montage segment was included in each episode. This was introduced by McHale to modernise the show. This use of songtages was first popularised by the US medical drama Grey's Anatomy. McHale stated he was unaware of this until after Holby City had used the technique. Music is selected by each episode's scriptwriter. Sometimes the producers and director would select the music in post-production. Actors have had some input: Hugh Quarshie selected the music he believed his character Ric Griffin would listen to in theatre. Asked in June 2010 whether she felt songtages were appropriate for a serious drama show, Kyle said: \"they are an excellent way of telling stories visually\". ===Broadcast=== Holby City was first shown on 12 January 1999 on BBC One. The show's first series ran for nine episodes. In June 2000, then Director-General of the BBC Greg Dyke pledged extra funding for BBC One, some of which was used for extra episodes of Holby City. The second series ran for 16 episodes. The third series ran for 30 episodes. Episodes were shown weekly from the fourth series onwards. Series four to nine ran for 52 episodes. Series ten ran for 53 episodes, including the stand-alone finale episode \"Mad World\", set outside the hospital. Series eleven ran for 52 episodes. Series twelve had 55 episodes. All series from then on had 52 episodes. The series reached its 500th episode on 13 April 2010. In the first series episodes were 50 minutes long. From the second series episodes have been one hour. The first series was shown on Tuesday nights at 8.10 pm. The second series moved to Thursdays. Halfway through the third series in 2001, Holby moved back to Tuesday night at 8.05 pm. It then moved into the 8pm timeslot, where it has remained. The show is occasionally shown on a different day. In 2007, the show moved to Thursday nights to allow HolbyBlue to be shown in the 8pm Tuesday timeslot. BBC One Scotland has often shown the series at a later time. In February 2019, it was announced that repeats of Holby City would begin on the channel Drama. This would begin with the first series. In Finland it is shown on the channel Yle TV2 and is called \"Holby Cityn sairaala\". Series twenty-two started on 7 January 2020. ==Characters and cast== ===Characters=== Holby City follows the professional and personal lives of medical and ancillary staff at Holby General. It has an ensemble cast of main and recurring characters. The show has 10 to 20 main characters. The original cast of 11 characters featured in the show's first episode was consultants Anton Meyer (George Irving) and Muriel McKendrick (Phyllis Logan), registrars Nick Jordan (Michael French) and Kirstie Collins (Dawn McDaniel), senior house officer Victoria Merrick (Lisa Faulkner), ward sister Karen Newburn (Sarah Preston), theatre sister Ellie Sharpe (Julie Saunders), senior staff nurse Ray Sykes (Ian Curtis), staff nurses Julie Bradford (Nicola Stephenson) and Jasmine Hopkins (Angela Griffin), and ward clerk Paul Ripley (Luke Mably). ===Casting=== For the first series, Young selected actors who were already established and had a soap opera background. Young had previously worked on the soap operas Brookside and Family Affairs French had starred in the BBC's EastEnders, while Stephenson and Faulkner had starred in Brookside. Griffin had also appeared in ITV's Coronation Street. Hiring of established actors continued as the soap progressed, with former Brookside actress Patricia Potter cast as registrar Diane Lloyd, Star Wars actor Denis Lawson cast as consultant Tom Campbell- Gore, and Family Affairs star Rocky Marshall cast as SHO Ed Keating. Later, roles were given to comedian Adrian Edmondson, film actress Patsy Kensit, and Jesus of Nazareth star Powell. There is a casting department at Elstree Studios which casts actors for Holby City as well as Casualty, EastEnders and Doctors. The programme also has two casting directors who bring in actors for the producer and director to audition. Some cast members who play main characters have made previous appearances in minor Holby City roles. Current characters include acting chief executive officer and consultant neurosurgeon Max McGerry (Jo Martin), consultant general surgeon and medical director Ric Griffin (Hugh Quarshie), consultant cardiothoracic surgeons lead Jac Naylor (Rosie Marcel) and Kian Madani (Ramin Karimloo), consultant general surgeons Ben Sherwood (Charlie Condou), Ange Godard (Dawn Steele), Sacha Levy (Bob Barrett), and Serena Campbell (Catherine Russell), speciality registrars Dominic Copeland (David Ames), Xavier Duval (Marcus Griffiths), and Chloe Godard (Amy Lennox), foundation training doctors Nicky McKendrick (Belinda Owusu) and Cameron Dunn (Nic Jackman), director of nursing Adrian \"Fletch\" Fletcher (Alex Walkinshaw), and senior staff nurses Donna Jackson (Jaye Jacobs) and Essie Harrison (Kaye Wragg). ===Guest stars=== Holby City has had a number of famous guest stars. In the first few series: *Emma Samms *Ronald Pickup *Leslie Phillips In the fiftieth episode *Anita Dobson *Peter Bowles *Susannah York Other notable guest stars include *Paul Blackthorne, *Suzanne Shaw, *Geoffrey Hutchings, *Richard Todd, *Johnny Briggs, *Terence Rigby, *Michael Obiora, *Lionel Jeffries. *Richard Briers appeared as patient George Woodman in the Christmas episode \"Elliot's Wonderful Life\". *Eric Sykes played Roger Ludlow, a patient with Alzheimer's disease. *Phill Jupitus starred as morbidly obese patient Andy Thompson. *Kieron Dyer was in four episodes as an injury prone footballer. *Denise Welch had a recurring role as risk manager Pam McGrath, mother of nurse Keri. *Clarke Peters appeared for five episodes in 2009 as the father of nurse Donna Jackson. *Graeme Garden had a recurring role from 2003 to 2007 as cardiothoracic consultant Edward Loftwood. *Cascade Brown played Sophie Hindmarsh in 2004. *Antonio Fargas appeared in 2003 as Victor Garrison, a patient with Parkinson's disease. *Sheridan Smith appeared for six episodes in 2001 as teenage stalker Miranda Locke. *David Soul made two appearances as Professor Alan Fletcher. *Ron Moody guest starred in 2012 as patient Vincent Mancini, a war veteran. ===Walk-on roles=== In 2003, the BBC reached an agreement with the actors' union Equity to cease offering walk- on drama series roles to members of the public as prizes. When an untrained person won such a role in Holby City in a competition, Equity complained to the broadcaster that such prizes were \"demeaning\" to actors, depriving them of paid employment. The competition winner was allowed to visit the Holby City set, but did not appear on-screen as a result of the policy change. ==Adaptations and other appearances== ===Casualty@Holby City=== The BBC has shown occasional crossover mini-dramas entitled Casualty@Holby City. It has a number of characters from each of the two casts. Before Casualty@Holby City, the two shows had occasionally crossed-over storylines and cast members before. For example developing a romance between Holby City Ben Saunders (David Paisley) and Casualty Tony Vincent (Lee Warburton). The first full crossover was made by Casualty executive producer Mervyn Watson, and Holby City McHale. Work on both shows had to be halted for two weeks to release cast members to appear in the special. A second crossover was commissioned in 2005 as part of the BBC's DoNation season. This aimed to raise public awareness of organ donation and to decide to sign up to the Organ Donor Register. An interactive episode of Casualty@Holby City was one of the headlining shows of the season, allowing viewers to vote by phone to determine the outcome of a fictional organ donation. The third Casualty@Holby City crossover aired in October 2005. The four-part storyline tackled the issue of youth violence, following the events of a turbulent A&E; demonstration at an inner-city school. Another crossover was ordered for Christmas 2005. Rather than dividing the episodes between the two series' crews as had previously been standard, this crossover operated as an entirely separate production, with Kyle producing and Paul Harrison directing. In February 2010, another crossover occurred when Casualty Charlie Fairhead (Derek Thompson) was operated on by Holby City Elliot Hope after suffering a heart attack. The storyline was shown as Casualty and Holby City episodes, rather than under the Casualty@Holby City title. Casualty series producer Oliver Kent commented that, while it is \"fantastic\" to be able to produce crossover episodes, they are logistically difficult, and it is unlikely that another Casualty@Holby City episode will be produced in the \"foreseeable future\". In September 2010, Holby City nurse Donna Jackson (Jaye Jacobs) appeared in Casualty, and Kent hopes that characters from the two shows will begin to crossover two or three times a year. ===HolbyBlue=== On 27 April 2006, the BBC announced Holby Blue, a police procedural spin-off from Holby City. It was created by Tony Jordan. Holby City was moved to Thursdays for the duration of HolbyBlue first series, with the spin-off broadcast on Tuesday nights at 8 pm. In 2008, a two-part crossover episode with Holby City was developed for the beginning of the show's second series. The episodes were written by McHale and Jordan. Holby City registrar Jac Naylor accused of murder. Yorke compared the crossover to the American CSI franchise, in that: \"You really believe it's a world.\" The second series attracted 5.6 million viewers to its opening episode. By the end of May 2008 viewer numbers had fallen to 2.5 million. In August 2008, the BBC announced that, due to lower ratings, Holby Blue would not be recommissioned for a third series. ===Other appearances=== In June 2002, cast members from Holby City and Casualty competed against the EastEnders cast for the first Sport Relief fundraiser, dubbed \"Sport in the Square\". The teams competed in events such as taxi pulling, melon tossing and a beer keg relay. The competition was shown on BBC One, and the event raised £10 million. In October 2003, BBC One aired a \"Kenyon Confronts\" documentary by Panorama reporter Paul Kenyon, investigating hospitals run by the Private Finance Initiative. He discovered many problems within the hospitals, which were dramatised by the Holby City cast in specially written scenes. In March 2004, the documentary \"Making It at Holby\" was made as part of a BBC initiative to develop new acting talent. The documentary followed the casting process of Holby City and Casualty, from the audition stages to the filming of the selected actors' first scenes. In November 2006, the Children in Need charity telethon included a segment featuring the Holby City cast performing a comical version of \"Hung Up\" by Madonna. In November 2007 Children in Need appeal again contained a musical performance from Holby City cast members. Sharon D Clarke, backed by Nadine Lewington, Rakie Ayola and Phoebe Thomas performed a soul version of Aretha Franklin's signature song, \"Respect\". On 28 June 2008, Holby City stars competed against their Casualty counterparts in a special charity edition of BBC Two game-show The Weakest Link. In February 2010, Holby City and Casualty cast members performed a dance rendition of \"Jai Ho\" for Let's Dance for Sport Relief. ==Reception== ===Critical response=== Holby City has been compared to other medical dramas, often unfavourable. In November 2002, John Whiston, then head of drama at Granada Television, accused the BBC of producing inferior \"parodies\" of ITV drama. He commented \"With Holby City cloned out of Casualty, the BBC has even ended up copying itself.\" Paul Hoggart of The Times says that the differences between the two shows are \"mild\", calling Holby City: \"Casualty cute little sister\". Kevin Lygo, director of television at Channel 4, referred to Holby City as \"sudsy drama\", deeming it, Casualty and HolbyBlue \"all decent programmes, but strikingly similar in many aspects of their tone and construction.\" Holby City has been unfavourably compared with the American medical drama ER. Television producer Paul Abbott has commented that although he watches ER, he does not watch Holby City as: \"it looks like you've crammed one hour's drama into 26 episodes.\" In October 2009, former Holby City writer Peter Jukes wrote a critical piece for Prospect magazine, contrasting the show negatively with the standard of American television dramas. Jukes wrote that Holby City has become a soap opera, rather than a drama, and deemed the episodes he worked on \"the most dispiriting experiences in [his] 25 years as a dramatist.\" In August 2002, Paul Bolt, director of the Broadcasting Standards Commission criticised BBC programming as being \"humdrum\" and \"formulaic\", saying of Holby City and the police procedural Mersey Beat: \"One begins to wonder what really is the point of the BBC bringing this to us. Let's have something a bit different.\" Then head of BBC drama Jane Tranter responded that Bolt's examples were \"highly selective\" as well as \"hugely patronising to the millions of viewers who enjoy popular dramas like Holby City – week in, week out\". Young, who at the time held the position of head of drama serials, told The Guardian: \"Popular drama has always been singled out for criticism, but people are increasingly voting with their on-buttons.\" At the 2003 Edinburgh International Television Festival, BSykB chief executive Tony Ball called for stricter restrictions on how the BBC spent licence payers' money, suggesting that Holby City be sold to the channel's commercial rivals, with the proceeds used to develop more original programming. The BBC refused Ball's suggestion, responding in a statement: \"This speech clearly reflects BSkyB's view that programmes are merely a commodity to be bought and sold.\" In 2003, former BBC host Sir Ludovic Kennedy complained that ethnic minorities were over- represented on television, prompting a BBC spokeswoman to explain that Holby City has more ethnic characters as it is set in an area where minorities account for up to 30% of the population. According to the 2001 census, the population of Bristol – which the city of Holby is loosely based upon – is 88% white and 12% ethnic minorities. In October 2003, Holby City was praised by campaigners for the Royal National Institute for Deaf People (RNID), when an episode which coincided with \"Learn To Sign Week\" used deaf actors, and featured characters communicating through British Sign Language. RNID chief executive John Low stated: \"Too often individuals have to rely on family members or friends to communicate complicated personal information to professionals. This is the reason the RNID is calling on the government to channel funding into the training of British Sign Language interpreters who could then be available to NHS staff treating deaf patients.\" Stokes commented: \"The writer had a great story he wanted to tell – for us, that's what matters first and foremost.\" In June 2004, Charles Allen, chief executive of ITV plc questioned the amount of funding spent on lengthened episodes of Holby City, A 2008 a Channel 4 report into ethnic diversity on television, cited Holby City as a positive example of \"diverse British programm[ing]\". In January 2010, Janet Street-Porter in The Independent, said Holby City had \"come to the end of [its] natural life\" and should be cancelled. ===Realism=== The show has been criticised for its lack of realism. In February 2004, nurse Vici Hoban said that there were three nurse stereotypes. \"Sex object, doctor's handmaiden, or angel\". She felt that the media had increased these misconceptions. She said that with \"the syringe-toting serial killer Kelly in Holby City, realism has never been top of TV's agenda.\" Hoban felt that the worst offender at the time was the Channel 4 medical drama No Angels. She described as: \"so inaccurate that it makes Holby City look like a factual documentary.\" In November 2009, Antony Sumara, CEO of the Mid Staffordshire NHS Foundation Hospital Trust, wrote a column criticising Holby City for misrepresenting real hospital life. In December 2009, Tom Sutcliffe of The Independent reviewed an episode, finding it \"astonishing\" that any patients leave Holby General alive, as the staff are \"so busy looking stricken or lovelorn at each other\". Misuse of alcohol has been criticised. In December 2003, The Times Libby Purves wrote a critical opinion piece, observing that Holby City medical staff are often depicted getting drunk in clubs, but afterwards are able to function properly at work, and that as a result, alcohol \"is made to look innocent\". In October 2004, Canon Kenyon Wright, chair of Alcohol Focus Scotland, criticised an episode of Holby City which saw doctors downing tequila slammers, stating that it glamorised irresponsible drinking. In October 2007, drinks' industry body the Portman Group made an official complaint to communications regulator Ofcom about a scene in Holby City which depicted two medics drinking five shots of tequila following a stressful day at work. The body's chief executive David Poley claimed that in failing to show the negative consequences of this action, the series was presenting a \"highly irresponsible portrayal of excessive and rapid drinking\". Ofcom received a total of eight complaints about the incident. Holby City has also been accused of medical inaccuracies. In January 2004, the British Medical Association denounced an episode which showed organ donation being done despite withdrawal of consent by the patient's relatives. Dr Michael Wilks, chairman of the Medical Ethics Committee stated: \"This simply would not happen, but its portrayal, even in a drama, is totally irresponsible and risks causing huge damage to the already struggling transplant programme.\" In 2005, the British Medical Association said that the show was giving viewers an unrealistic impression of resuscitation by typically presenting only two outcomes, death or total recovery. Andrew Thomson, a Dundee GP, deemed this \"a terrible distortion of the truth.\" In 2009, The Times, Vivienne Parry highlighted the fact that in reality, less than half of patients who require resuscitation survive the initial event. Of those, only a third live to leave hospital. In April 2010, at the Royal College of Nursing (RCN) conference in Bournemouth, Holby City was accused of fostering unrealistic expectations of the NHS, encouraging patients to believe in miracles and fuelling a compensation culture. Accident and Emergency nurse John Hill stated: \"In A&E; it is sometimes a fact that sadly we cannot get people through the trauma they have received. Unfortunately, unlike in Holby City, I am a mere mortal and cannot perform miracles. But many relatives believe because of that, you can. And the injury lawyers assure them that if you don't they will get recompense for it.\" ===Impact=== In October 2000, Dr John Ryan, an Accident & Emergency consultant at the Royal Sussex County Hospital in Brighton criticised the number of patients visiting the department for minor problems without first seeing their GP. Ryan attributed this to patients watching Holby City and falsely seeing hospitals as glamorous. In September 2008, a three-year Belgian research project, presented at a British Psychological Society meeting, claimed that watching Holby City and similar medical dramas such as Casualty and ER had a subliminal influence on fear of illness. 1,300 teenagers were questioned on their viewing habits, and those who watched more medical dramas were found to be up to 10% more fearful about their health. In 2008, Conservative Party strategists identified four archetypes based on TV programmes to help the party target swing voters. Alongside \"Top Gear man\", \"Apprentice generation\" and \"Grand Designs couple\", they identified \"Holby City worker\", a middle-ranking health service worker. In 2009, they identified \"Holby City woman\" as a key voter demographic who may help the party win the 2010 General Election. The \"Holby City woman\" is a female voter in her 30s or 40s, employed in a clinical or clerical position or some other public sector job. She is a swing voter in General Elections, The \"Holby City woman\" archetype is modelled on the character of Faye Morton. In January 2009, Jill Berry, president of the Girls' Schools Association and head teacher at the Dame Alice Harpur School in Bedford, cited medical dramas such as Holby City as an inspiring force in increasing numbers of female students deciding to pursue careers in medicine. Berry explained: \"The girls see that as an exciting and dynamic way of life. They see it as making a difference to people's lives. It gives them a sense sometimes of the pressures, responsibility and adrenaline. Such TV programmes can be good, as long as they give a realistic impression.\" Similarly, consultant surgeon Andrew Raftery uses clips from Holby City as part of the University of Sheffield Outreach and Access to Medicine Scheme, to inspire pupils from under-represented social and educational backgrounds to pursue careers in medicine. ===Awards and nominations=== Holby City has been nominated for over 100 awards. It has won six. The series has received five nominations for the British Academy Television Awards, winning one. Minkie Spiro was nominated for the \"Best New Director (Fiction)\" award in 2003 for her work on the series. The show was nominated for the \"Best Continuing Drama\" award in 2004, 2005 and 2006, winning in 2008. Holby City received multiple BBC Drama Award nominations between 2002 and 2006. Its best results saw the show voted fifth \"Best Drama\" in 2004 and 2006. Amanda Mealing was voted fourth \"Best Actress\" in 2006 for her role as Connie Beauchamp. The \"Casualty@Holby City\" moment where doctor Jim Brodie (Maxwell Caulfield) sacrifices his life for midwife Rosie Sattar (Kim Vithana) was voted viewers' fourth \"Favourite Moment\" of 2004. The series has been nominated for the \"Best Drama\" award at the Inside Soap Awards in 2004, 2006, 2007, 2008, 2009, 2010 Holby City has received multiple long-list nominations at the National Television Awards and TV Choice Awards. Mealing was short-listed for the \"Most Popular Newcomer\" award in 2005, and for the \"Best Actress\" award in 2008. At the 2000 Royal Television Society Awards, Sean De Sparengo and Richard Gort were nominated for the \"Best Graphic Design – Titles\" award. The show was nominated in the \"Soap and Continuing Drama\" category in 2007. Holby City was nominated \"Best Serial Drama\" at the 2008 Digital Spy Soap Awards, In 2009, Stella Gonet was nominated for the \"Acting Performance in TV (Female)\" award at the British Academy Scotland Awards for her role as CEO Jayne Grayson. In 2010, the series was shortlisted in the \"Best Television Continuing Drama\" category at the Writers' Guild of Great Britain Awards. In 2000, at the Ethnic Multicultural Media Awards, Angela Griffin won \"Best Actress\" for her role as nurse Jasmine Hopkins. In 2002, she was nominated \"Best TV Actress\" alongside co-star Thusitha Jayasundera for her role as registrar Tash Bandara. In 2004, Art Malik won the \"Best TV Actor\" award for his role as anaesthetist Zubin Khan. The show has won three Screen Nation Awards, and received nominations for a further seven. Jaye Jacobs won the \"Emerging Talent\" award in 2005 for her role as nurse Donna Jackson. In 2006, Rakie Ayola and Hugh Quarshie were nominated for the Female and Male \"Performance in TV\" awards for their roles as Kyla Tyson and Ric Griffin. Sharon D. Clarke won the 2007 \"Female Performance in TV\" award for her role as Lola Griffin. Ginny Holder was nominated in the same category for her role as Thandie Abebe. In 2007, Roger Griffiths was nominated for the \"Male Performance in TV\" award for his role as Harvey Tyson. Quarshie won \"Favourite Male TV Star\" in 2008. In 2008, the show was nominated for the \"Diversity in Drama Production\" award. ===Ratings=== Series Episodes Premiere Finale Viewers (in millions) Notes 1 9 9.24 2 16 8.98 3 30 7.75 4 52 7.51 5 52 7.77 6 52 7.69 7 52 7.04 8 52 6.50 9 52 5.86 10 53 5.62 11 52 5.44 12 55 5.62 13 52 5.65 14 52 4.92 15 52 4.61 16 52 4.38 17 52 4.64 18 52 4.53 19 64 4.54 20 52 2019 == Notes == ==References== ==Other websites== * * * Category:1999 British television series debuts Category:1990s British drama television series Category:1990s British workplace television series Category:1990s medical television series Category:1990s workplace drama television series Category:2000s British drama television series Category:2000s British workplace television series Category:2000s medical television series Category:2000s workplace drama television series Category:2010s British drama television series Category:2010s British workplace television series Category:2010s medical television series Category:2010s workplace drama television series Category:2020s British drama television series Category:2022 British television series endings Category:BBC television dramas Category:British workplace drama television series Category:English-language television programs",
 "title": "Holby City"
}