{
 "id": "732110",
 "text": "Phir Laut Aayi Naagin () was a Hindi-language Indian television supernatural series produced by Triangle Film Corporation. It stars Nikita Sharma, Jatin Bharadwaj, and Abhimanyu Chaudhary. It aired from 2 September 2019 to 17 January 2020 on Dangal TV. The show went off the air after a successful run. ==Plot== Shivani is a naagin (shape shifting serpent) who has returned after 12 years to find her love to the city in Anand's house whose is a joint family. Her guru told that her Nagaraja (Ankit Arora), who was killed for naagamani, made his rebirth in Anand's house. So Shivani in the form of a 12 year old girl went there to find her nagraj. There she finds that the two boys Raj and Rohit was been born on the same day, which makes her be confused. So she appeals to her guru who says that she only can identify her nagraj. So she remembers that one-day nagraj had told her about the star symbol on his mole which will be on him even he take 100 births. So with the help of this, she tries to find him but fails several times. Meanwhile, Anand found that a serpent in the form of a small girl is around his house with the help of a sage. Anand is the one with the help of his friends, and his driver Lakshman, killed Nagraj for the nagmani. Then he realised that the naagin has come to kill him. When Shivani found that Raj is her Nagraj by seeing the star symbol on his arm, she was captured by the sage and is kept in the cremated box under a tree for nine years. After nine years, Anand with the power of naagmani became one of the wealthiest people in the world. He announces that his son Rohit would take his new project at the press meet. Returning from the land, Rohit and raj is returning to their house. Shivani sets out find who is Raj as she knows he is her nagraj. Shivani then disguises as Nandini, and comes with the help of a naagin, Priya and a naag as the daughter of a wealthy person and buys a mansion close to Raj's house. Rohit sees her and fell in love with her. Raj also likes her the moment he saw her but for Rohit's sake, he hides the love. Rohit sends Raj to see Nandini and tell him Rohit's love but fails several times. Then Anand knowing that Nandini is the daughter of a wealthy person, makes friends with her. Meanwhile, one of Rohit's friend falls for Nandini and tries to abuse her but Raj saves. In this incident, Raj gets shot by a gun. Nandini gets to know Raj. She tries to make him remember his past life but cannot. Meanwhile, another naagin, Ragini who loved nagraj comes there. She tries to kill Nandini so that she can marry Raj. Rohit tries to abuse Nandini many times. At last, he dies by falling from a cliff while fighting with Raj for Nandini. Anand decides to take revenge on Nandini and Raj because they were the reason for Rohit's death. Raj's and Ragini's marriage gets fixed but fails. Raj finds out that he is a shape shifting serpent but is unable to control himself. So he takes help from a sage and is able to control and change forms. But he does not remember anything. It is revealed that Ragini was the one who lead Anand and his friends to nagmani on the intention of killing Shivani but Anand kills the nagraj instead. Raj's and Nandini's marriage gets fixed but failed. Raj gets to know that Nandi ni is a naagin who was killing Anand's friends. Ragini tells Anand that Nandini is the Naagin so he tells Raj to kill Nandini so that Anand can kill Raj after that. Raj reaches the temple where Nandini was. He took the gun for killing her but could not because he remembers everything. Lakshman reveals to Raj that when Anand killed nagraj, a light came out from his chest and came into Lakshman's chest. When the child of Lakshman was born, it actually died, but then the light from his chest went into the baby's chest and so he would be the nagraj. So Raj and Nandini went to kill Anand but finds out that Anand had become a shape shifting snake with the power of nagmani. They kill Anand and the nagmani gets back to its real owner, the nagraj. Finally Raj and Shivani gets united. == Cast == ===Main=== * Nikita Sharma as Shivani/Nandini * Jatin Bhardwaj as Raj * Abhimanyu Chaudhary as Rohit * Manish Khanna as Anand * Manu Malik as Laxman * Ankit Arora as NagRaj * Lakshya Handa as Bobby ===Recurring=== * Kashvi Kothari as small Shivani * Amrita Tanganiya as Priya * Richa Pradhan as Poonam, Mohan's younger sister * Bindiya Kalra as Naina, Anand's sister * Tanu Vidyarthi as Meena, Raj's mother * Pyumori Mehta Kosh as Neelam, Raj and Poonam's mother * Soniya Singh as Ragini * Ayyan Zubbair Rahmani as small Raj * Heer Morabia as small Rohit == Reception == Phir Laut Aayi Naagin Is Dangal TV’s most viewed serial and recorded one of the highest TRP ratings of any program on Dangal TV. Also, the show is the most watched show on Dangal TV Youtube channel. Due to the success of the 1st season, makers and channel launched Season 2 named Ek Anokhi Rakshak - Naagkanya which had a different cast & storyline. However, Season 2 failed to grab viewers' attention and went off air within 1 month of launch owing to low TRP’s. == References == Category:2019 Indian television series debuts",
 "title": "Phir Laut Aayi Naagin"
}