{
 "id": "732453",
 "text": "This is a list of cartridges and cassettes for the Intellivision game system. Some cartridges were released by both Mattel Electronics and Sears Tele-Games, and later Intellivision Inc. Between 1979 and 1989, a total of 133 titles were released: * 118 cartridges, and also one compilation cartridge, for the Master Component * 6 cartridges for the ECS Computer Adapter. Sometimes 7. * 8 cassettes and 1 cartridge for the Keyboard Component Most of this information is from the Game Catalog of IntellivisionLives.com. Some games were also released under different names when they were released again in Intellivision Lives!. == Table Key == ^ For two players only * Compilation of previously released games † Intellivoice voice synthesis cartridge ‡ ECS Computer Adapter cartridge § Keyboard Component cassette All early games that were published by Mattel Electronics were categorized as \"Network\"s. Each network had its own color that was used for the game box. The network concept was abandoned in late 1982. Sports network Action network Space Action network Strategy network Gaming network Children's Learning network Arcade network == Master Component Releases == These are the cartridges released from 1979 to 1990, back when the Intellivision was made. The cartridges that use the Intellivision are included here. Even though the cartridges are designed to be played with the Intellivoice peripheral, they can be played without the Intellivoice peripheral. Title Genre Developer Publisher Released Notes Auto Racing Racing APh Technological Consulting Mattel Electronics Running change with steering changed from \"directional\" to \"realistic\" (left/right). Boxing ^ Sports APh Technological Consulting Mattel Electronics Two players are required. Major League Baseball ^ Sports APh Technological Consulting Mattel Electronics It was also called Baseball, Big League Baseball, and two players are required. NASL Soccer ^ Sports APh Technological Consulting Mattel Electronics It was also called Soccer, and two players are required. NBA Basketball ^ Sports APh Technological Consulting Mattel Electronics It was also called Basketball, and two players are required. NFL Football ^ Sports APh Technological Consulting Mattel Electronics It was also called Football, and two players are required. NHL Hockey ^ Sports APh Technological Consulting Mattel Electronics It was also called Hockey, and two players are required. PBA Bowling Sports Mattel Electronics Mattel Electronics It was also called Bowling. PGA Golf Sports APh Technological Consulting Mattel Electronics It was also called Golf. Tennis ^ Sports APh Technological Consulting Mattel Electronics Two players are required. U.S. Ski Team Skiing Sports APh Technological Consulting Mattel Electronics It was also called Skiing. ADVANCED DUNGEONS & DRAGONS Cartridge Action-adventure APh Technological Consulting Mattel Electronics It was also called Advanced Dungeons & Dragons Cloudy Mountain, Adventure, Crown of Kings. It was programmed by Chris Hawley, Tom Soulanille, and Tom Loughry. Armor Battle ^ Action APh Technological Consulting Mattel Electronics Running change with faster tank turning. Two players are required. Frog Bog Platform APh Technological Consulting Mattel Electronics Lock 'N Chase Stealth Mattel Electronics Mattel Electronics Night Stalker Stealth Mattel Electronics Mattel Electronics Sea Battle ^ Action, Strategy APh Technological Consulting Mattel Electronics Two players are required. Shark! Shark! Action Mattel Electronics Mattel Electronics Sharp Shot APh Technological Consulting Mattel Electronics It was designed for voice activated control for the TV Powww call-in game show. Snafu Action Mattel Electronics Mattel Electronics Sub Hunt Action, Simulation APh Technological Consulting Mattel Electronics It was programmed by John Hershberger and Tom Loughry. Triple Action ^ Action APh Technological Consulting Mattel Electronics album cartridge: Battle Tanks, Racing Cars, and Biplanes, and two players are required. for Biplanes and Battle Tanks. In addition to Rich O'Keefe, programming credits are also given to Shal Farley. Tron: Deadly Discs Action Mattel Electronics Mattel Electronics Tron: Maze-a- Tron Action Mattel Electronics Mattel Electronics Astrosmash Shooter Mattel Electronics Mattel Electronics Space Armada Shooter APh Technological Consulting Mattel Electronics Space Battle Action APh Technological Consulting Mattel Electronics Originally part of Action network. Running change added a fifth \"super advanced\" difficulty level. Space Hawk Action Mattel Electronics Mattel Electronics Star Strike Action APh Technological Consulting Mattel Electronics Running change fixes bug with left controller. ABPA Backgammon Board Game APh Technological Consulting Mattel Electronics It was also called Backgammon. Checkers Board Game APh Technological Consulting Mattel Electronics It was also called Draughts in some markets. Reversi Board Game APh Technological Consulting Mattel Electronics USCF Chess Board Game Mattel Electronics Teletape Inc. Mattel Electronics It was also called Chess. Utopia Construction and management simulation Mattel Electronics Mattel Electronics Credited as the game that spawned the construction and management simulation genre. For one or two players. Horse Racing Gambling APh Technological Consulting Mattel Electronics Las Vegas Poker & Blackjack Gambling APh Technological Consulting Mattel Electronics It was also called Blackjack & Poker; pack-in game 1980-1982. Las Vegas Roulette Gambling APh Technological Consulting Mattel Electronics Programmed by Walter Bright Intellivision Lives also credits John Brooks. Royal Dealer Card Game APh Technological Consulting Mattel Electronics The Electric Company: Math Fun Educational APh Technological Consulting Mattel Electronics It was also called Math Masters; Running change had digit entry changed from right to left to left to right. The Electric Company: Word Fun Educational APh Technological Consulting Mattel Electronics album cartridge: Crosswords, Word Hunt, and Word Rockets Vectron Shooter Mattel Electronics Mattel Electronics B-17 Bomber † Action Mattel Electronics Mattel Electronics Bomb Squad † Puzzle Mattel Electronics Mattel Electronics Space Spartans Action Mattel Electronics Mattel Electronics Tron: Solar Sailer † Action Mattel Electronics Mattel Electronics ADVANCED DUNGEONS & DRAGONS: TREASURE OF TARMIN Cartridge Role-playing APh Technological Consulting Mattel Electronics It was also called Minotaur. Bump 'n' Jump Racing Technology Consultants Mattel Electronics BurgerTime Stealth Mattel Electronics Mattel Electronics Buzz Bombers Shooter Mattel Electronics Mattel Electronics Kool-Aid Man Action Mattel Electronics Mattel Electronics Loco- Motion Puzzle Mattel Electronics Mattel Electronics Masters of the Universe: The Power of He-Man Action Mattel Electronics Mattel Electronics Mission X Shooter Mattel Electronics Mattel Electronics Motocross Racing Mattel Electronics Mattel Electronics Pinball Action Mattel Electronics Mattel Electronics Beamrider Shooter Cheshire Engineering Activision Happy Trails Puzzle Activision Activision Pitfall! Platform Activision Activision River Raid Shooter Activision Activision Stampede Shooter Activision Activision The Dreadnaught Factor Action Cheshire Engineering Activision Worm Whomper Shooter Cheshire Engineering Activision Centipede Shooter Atari Atarisoft Defender Shooter Atari Atarisoft Pac-Man Stealth Atari Atarisoft Later re-released by INTV Corporation. Carnival Shooter Roklan Coleco Donkey Kong Platform Roklan Coleco Donkey Kong Jr. Platform Roklan Coleco Lady Bug Stealth Coleco Mouse Trap Stealth Roklan Coleco Turbo Racing Coleco Venture Shooter Roklan Coleco Zaxxon Shooter Roklan Coleco Atlantis Shooter Imagic Imagic Beauty & the Beast Platform Imagic Imagic Demon Attack Shooter Imagic Imagic Dracula Action Imagic Imagic Dragonfire Action Imagic Imagic Fathom Action-adventure Imagic Imagic Ice Trek Action Imagic Imagic Microsurgeon Action, Simulation Imagic Imagic Nova Blast Shooter Imagic Imagic Safecracker Action Imagic Imagic Swords & Serpents Action-adventure Imagic Imagic Tropical Trouble Platform Imagic Imagic Truckin' Driving, Simulation Imagic Imagic White Water! Action Imagic Imagic Blockade Runner Shooter Interphase Technologies Inc. Interphase Technologies Inc. Sewer Sam Shooter Interphase Technologies Inc. Interphase Technologies Inc. Frogger Platform Roklan Parker Brothers Popeye Platform Roklan Parker Brothers Q*bert Platform Roklan Parker Brothers Star Wars: The Empire Strikes Back Shooter Roklan Parker Brothers Super Cobra Shooter Roklan Parker Brothers It was not available in the United States. Tutankham Shooter Roklan Parker Brothers It was not available in the United States. Congo Bongo Platform Beck-Tech Sega Championship Tennis Sports Nice Ideas Dextell Ltd. World Cup Soccer Sports Nice Ideas Dextell Ltd. When used with the ECS Computer Adapter up-to four controllers and cooperative two-player game-play is supported. It was also called Super Soccer. Body Slam: Super Pro Wrestling Action Realtime Associates INTV Corporation Chip Shot: Super Pro Golf Sports Realtime Associates INTV Corporation Commando Shooter Realtime Associates INTV Corporation Dig Dug Action Atari INTV Corporation Diner Action Realtime Associates, Mattel Electronics INTV Corporation Hover Force Action Realtime Associates, Mattel Electronics INTV Corporation Programmed with ChromaDepth 3-D technology and shown publicly by Mattel Electronics as HoverForce 3-D at 1984 January CES. Released by INTV with modified game-play, 3-D glasses not included. Learning Fun I Educational Realtime Associates, Mattel Electronics INTV Corporation It was also called Factor Fun; also includes Math Master from Math Fun cartridge. Learning Fun II Educational Realtime Associates, Mattel Electronics INTV Corporation It was also called Memory Fun; also includes Word Rockets, Word Hunt, Crosswords from Word Fun cartridge. Mountain Madness: Super Pro Skiing Sports Realtime Associates, APh Technological Consulting INTV Corporation It is an updated version of U.S. Ski Team Skiing. Pole Position Racing Realtime Associates INTV Corporation Slam Dunk: Super Pro Basketball Sports Realtime Associates, APh Technological Consulting INTV Corporation It is an updated version of NBA Basketball. Slap Shot: Super Pro Hockey Sports Realtime Associates, APh Technological Consulting INTV Corporation It is an updated version of NHL Hockey. Spiker! Super Pro Volleyball Sports Realtime Associates INTV Corporation Stadium Mud Buggies Racing Realtime Associates INTV Corporation Super Pro Decathlon Sports Realtime Associates INTV Corporation Super Pro Football Sports Realtime Associates, APh Technological Consulting INTV Corporation It is an updated version of NFL Football. Thin Ice Action Mattel Electronics INTV Corporation Thunder Castle Stealth Mattel Electronics INTV Corporation Tower of Doom Role-playing Realtime Associates, Mattel Electronics INTV Corporation Programmed by Daniel Bass as ADVANCED DUNGEONS & DRAGONS Tower of Mystery Cartridge. Game-play and strategy was incomplete when Mattel Electronics closed in 1984. John Tomlinson prepared the game for the 1987 INTV release. Triple Challenge Board game Mattel Electronics Teletape Inc. APh Technological Consulting INTV Corporation Compilation of previously released games Chess, Checkers, and Backgammon. World Championship Baseball Sports APh Technological Consulting INTV Corporation It was also called All-Star Major League Baseball; It is an updated version of Major League Baseball. == Entertainment Computer System Releases == Except for one of these cartridges, these cartridges need the ECS Computer Adapter and either the Computer Keyboard or Music Synthesizer peripherals. Title Genre Developer Publisher Released Notes The Jetsons' Ways With Words ‡ Educational Mattel Electronics Mattel Electronics Developed with Mattel's Educational Product Department. Melody Blaster ‡ Music Mattel Electronics Mattel Electronics It is designed for the Music Synthesizer piano keyboard. Mind Strike ‡ Strategy Mattel Electronics Mattel Electronics Mr. Basic Meets Bits 'N Bytes ‡ Educational Mattel Electronics Mattel Electronics It runs without the ECS Computer Module, but with limited features. Scooby Doo's Maze Chase ‡ Stealth Mattel Electronics Mattel Electronics World Series Major League Baseball † ‡ Sports Mattel Electronics Mattel Electronics It was also called Super Series Big League Baseball; First sports simulation and management video-game. == Keyboard Component Releases == Keyboard Component cassettes had limited availability through direct mail or select markets. Only 4000 Keyboard Components were made. Title Genre Developer Publisher Released Notes BASIC Cassette & Cartridge Programming APh Technological Consulting, Microsoft Mattel Electronics Based on Microsoft BASIC v2.0b for MOS 6502. Unique cartridge using one of the Keyboard Component I/O ports. Conversational French § Educational APh Technological Consulting Mattel Electronics Crosswords I § Puzzle Mattel Electronics Mattel Electronics Requires the BASIC cartridge. Crosswords II § Puzzle Mattel Electronics Mattel Electronics Requires the BASIC cartridge. Crosswords III § Puzzle Mattel Electronics Mattel Electronics Requires the BASIC cartridge. Family Budgeting § Financial Mattel Electronics Requires the BASIC cartridge. Geography Challenge § Educational Mattel Electronics Mattel Electronics Requires the BASIC cartridge. Programmed by Don Daglow and Julie Hoshizaki in BASIC. Jack LaLanne's Physical Conditioning § Fitness APh Technological Consulting Mattel Electronics Intellivisionlives.com lists Hal Finney as the programmer; there was also an unknown programmer and programmer Tom Loughry; graphics designed by Karen Nugent of Mattel. Spelling Challenge § Educational APh Technological Consulting Mattel Electronics Programmed by Peter Kaminski, who also worked on an unreleased Math Challenge. == Unreleased == This is a list of Intellivision games that were mostly completed but not released. Keyboard Component software that would have been on cassette tape is also included. Technical demos, store demos, and test cartridges are not included. Air Strike is one game that is possibly unfinished, but is included in this list because the found prototype is a playable game. Hypnotic Lights is not included because it is mostly a technical demo. Grid Shock is excluded due to a lack of game play. Some of the games were not released because of marketing decisions, and others because Mattel Electronics shut down in January 1984. Except for where it otherwise says, this information comes from the list of Unreleased Intellivision Games at IntellivisionLives.com. In a 2014 interview, APh programmer Tom Loughry said in 1982, he and another APh programmer started a third Advanced Dungeons & Dragons game which was abandoned when he left the company. He also worked on a Keyboard Component cassette game called Super Football. It is not known how complete Super Football is. In a 2015 interview with Russ Haft, manager of the Intellivision programming group at Atari, it was said as well as the four games, released versions of Joust, Jungle Hunt, Pole Position, and Missile Command were completed or close to completion. Missile Command would have been dropped because of poor playability. A June 1983 press release from CBS Electronics announced Wizard of War and Gorf to be released in July 1983 and Blueprint, Solar Fox, and Omega Race cartridges in August 1983. This suggests Wizard of War and Gorf were completed and programming on the others at least started. Other announced games such as Imagic Wing War and Moonsweeper have little information about their status. Title Genre Developer Publisher Copyright Notes Adventures of TRON Platform APh Technological Consulting Mattel Electronics 1982 An Atari 2600 conversion of Mazeatron converted back to Intellivision. It was rejected by Mattel marketing. Air Strike Action APh Technological Consulting Mattel Electronics 1982 Unfinished but playable. It was rejected by Mattel marketing. It was released in 1998 as part of Intellivision Lives! for Windows and Mac Brickout! Action APh Technological Consulting Mattel Electronics 1981 Created for the Triple Action cartridge. Dropped due to legal concerns. It was released in 1998 as part of Intellivision Lives! for Windows and Mac. Chartcraft Stock Analysis § Financial APh Technological Consulting Mattel Electronics Keyboard Component cancelled Choplifter! Action Realtime Associates INTV Corporation 1990 lacks some sound effects. Deep Pockets Super Pro Pool & Billiards Sports Realtime Associates INTV Corporation 1990 Released in 1998 Intellivision Lives! PC/Mac and Intellivision for PC Volume 2 Doubles Tennis Sports Mattel Electronics Mattel Electronics 1982 Ray Kaestner It is an updated version of the original Intellivision Tennis with computer controlled players and support for ECS four controllers.Intellivisionairies Podcast Episode 26 time 2h:59m Unrelated to Championship Tennis. Fireman Action Nice Ideas The Flintstones' Keyboard Fun ‡ Educational Mattel Electronics Mattel Electronics 1983 Developed with Mattel's Educational Product Department. Game Factory ‡ Educational Mattel Electronics Mattel Electronics 1983 Video-game construction kit. Released in 2001 Intellivision Rocks Gli Spartani Dello Spazio † Action Mattel Electronics Mattel Electronics 1982 Space Spartans with Italian speech; requires the unreleased International Intellivoice Go for the Gold Sports Mattel Electronics Mattel Electronics 1983 Compilation of previously released games Skiing, Hockey, Basketball, and Boxing Hockey (Pong) Action APh Technological Consulting Mattel Electronics 1981 Created for the Triple Action cartridge. Dropped due to legal concerns. Illusions Puzzle Nice Ideas Mattel Electronics 1983 Jeanne Dixon Astrology § Entertainment APh Technological Consulting Mattel Electronics Keyboard Component cancelled Joust Action Atari Atarisoft 1983 no known prototype found; unreleased due to market crash Jungle Hunt Action Atari Atarisoft 1983 no known prototype found; unreleased due to market crash King of the Mountain Action-adventure Mattel Electronics Mattel Electronics 1982 Lacks sound effects and only mountains 1 and 6 accessible. Programmed by Judy Mason. It was released in 1998 as part of Intellivision Lives! for Windows and Mac. Land Battle ^ Action, Strategy APh Technological Consulting Mattel Electronics 1982 Two-players are required. Cancelled by marketing. It was released in 1998 as part of Intellivision Lives! for Windows and Mac. Las Vegas Craps Gambling APh Technological Consulting Mattel Electronics League of Light Music Activision Activision 1983 Released in 2001 Intellivision Rocks. Programmers, Russ Lieblich and Peter Kaminski, switched to Commodore 64 development and released the game as Master of the Lamps in 1985. Les Spartiates De L'Espace † Action Mattel Electronics Mattel Electronics 1982 Space Spartans with French speech; requires the unreleased International Intellivoice Magic Carousel † Children's Educational Mattel Electronics Mattel Electronics 1983 Postponed by Mattel marketing. Released in 2001 Intellivision Rocks Magic Carpet Action Nice Ideas Mattel Electronics Meteor Shooter Mattel Electronics Mattel Electronics 1981 Unfinished but playable; embedded in Astrosmash. Dropped due to legal concerns. It was released in 1998 as part of Intellivision Lives! for Windows and Mac Missile Command Shooter Atari Atarisoft 1983 no known prototype found; unreleased due to poor playability Number Jumble Educational Mattel Electronics Mattel Electronics 1983 ECS provides scratchpad work area but plays without it. Developed with Mattel's Educational Product Department. It was released in 1998 as part of Intellivision Lives! for Windows and Mac. Party Line: Blow Out Party games Mattel Electronics Mattel Electronics 1983 Part of the Party Line album cartridge. Released in 2004 Intellivision Lives! for Nintendo DS Party Line: Hard Hat Party games Nice Ideas Mattel Electronics 1983 Part of the Party Line album cartridge. It was released in 1998 as part of Intellivision Lives! for Windows and Mac Party Line: Space Cadet Party games Mattel Electronics Mattel Electronics 1983 Part of the Party Line album cartridge. It was released in 1998 as part of Intellivision Lives! for Windows and Mac PizzaTime Stealth Nice Ideas Mattel Electronics BurgerTime sequel Pole Position Racing Atari Atarisoft 1983 no known prototype found; unreleased due to market crash Robot Rubble Action Activision Activision 1983 Released in 2001 Intellivision Rocks Rocky & Bullwinkle Puzzle Mattel Electronics Mattel Electronics 1983 Cancelled by new management. Scarfinger Action Nice Ideas Mattel Electronics 1983 It was rejected by Mattel marketing. Shootin' Gallery Shooter Imagic Imagic Atari 2600 version sold poorly. Spartaner aus dem All † Action Mattel Electronics Mattel Electronics 1982 Space Spartans with German speech; requires the unreleased International Intellivoice Spina the Bee Action Nice Ideas Mattel Electronics 1983 It was also called Zzzz! Spina the Bee. Based on a European cartoon character, popular with little girls. It was rejected by Mattel marketing. Super NFL Football ‡ Sports Mattel Electronics Mattel Electronics 1983 Takeover ^ Real-time strategy APh Technological Consulting Mattel Electronics 1982 Two-players are required. It was rejected by Mattel marketing. It was released in 1998 as part of Intellivision Lives! for Windows and Mac Tetris Puzzle Realtime Associates Programmed by David Warhol to test new PC development system; not for release. Yogi's Frustration Platform Mattel Electronics Mattel Electronics 1983 == Tutorvision == These are white cased game cartridges that can only be played on the unreleased World Book Tutorvision console, which uses its own REXEC and REXGROM. Games were designed by World Book, J. Hakansson Associates, and programmed by Realtime Associates. The Tutorvision and cartridges listed below were developed in 1989, but not released. Title Genre Developer Publisher Notes Busy Bodies Educational (young children) Realtime Associates World Book Geo Graphics Educational Realtime Associates World Book Geography Level 2 Jungle Math Educational (young children) Realtime Associates World Book Map Mazes Educational (young children) Realtime Associates World Book Social Studies Level 1 Nounsense Educational (young children) Realtime Associates World Book Shapes In Space Educational (young children) Realtime Associates World Book Math Level 1 Story Stopper Educational Realtime Associates World Book Tale Teller Educational (young children) Realtime Associates World Book Time Trip Educational Realtime Associates World Book Time Trip (Canadian Edition) Educational Realtime Associates World Book Tops In Terms Educational Realtime Associates World Book Wordcalc Educational Realtime Associates World Book Wordsmith Educational Realtime Associates World Book Write It Right Educational Realtime Associates World Book Zoo Review Educational (young children) Realtime Associates World Book == Homebrew == There are games Intellivision fans and hobbyists created. Title Genre Developer Publisher Released 4-Tris Puzzle Joe Zbiciak Joe Zbiciak Minehunter Puzzle Ryan Kinnen Ryan Kinnen Same Game and Robots Michael Hayes, David Harley Michael Hayes, David Harley Stonix Arnauld Chevallier, David Harley, Heather Harley Arnauld Chevallier, David Harley, Heather Harley Space Patrol Shooter Joe Zbiciak Joe Zbiciak Blix Puzzle Michael Hayes Good Deal Games Piggy Bank Action Mark Ball BBWW Games Christmas Carol vs. The Ghost Of Christmas Presents Action James Pujals Left Turn Only == Related == * Lists of video games ==References== Category:Lists of video games by platform",
 "title": "List of Intellivision games"
}