{
 "id": "73254",
 "text": "Team Fortress 2 (TF2) is a free-to-play multiplayer first-person shooter video game. It is made by Valve Corporation, who developed and published the game. The game has nine characters, called classes. Players can choose which one of these classes they want to play, and can change classes in the middle of a round. There are many different game modes, such as Payload, which has one team pushing a cart along a track while the other team tries to stop them, and a version of Capture the Flag, where players must capture a briefcase with important papers. The game is set in 1968, in an alternate history. The game also takes inspiration from many famous spy movies and TV shows, taking elements from James Bond, The Man from U.N.C.L.E., and Get Smart. The game was first released in October of 2007 in The Orange Box, a package with Half Life 2, Portal and Team Fortress 2. It was later released separately for the Playstation 3, Xbox 360, Microsoft Windows, Linux and Mac computers. It became free to play on June 23, 2011. However, on June 12, 2024, Valve stopped support for Mac computers. Players are Split between 2 Teams: BLU and RED. RED stands for Reliable Excavation Demolition. Players on this team have red uniforms. RED is mostly involved with Defense such as in Payload and Mann vs. Machine. Buildings owned by the RED team are also usually red and made of wood. BLU stands for Builders League United. Players on this team wear blue uniforms. BLU is mostly involved with Offense. Buildings owned by the BLU team are usually blue and made of concrete. ==Classes== Team Fortress 2 has nine classes. The classes are split into groups of three, which are offense, defense and support. Each class has its own strengths and weaknesses, causing the classes to rely on each other to win, promoting teamwork. Also, each class can change their weapons to different ones that they find over time or make from scrap metal. For example, the Soldier could change his normal rocket launcher into 'The Direct Hit.' It shoots faster, stronger rockets at the cost of having a smaller explosion size. In general, the different weapons are not upgrades, but rather 'side-grades.' They are better at certain times, while worse at other times. ===Offense=== The offensive classes are the Scout, the Soldier, and the Pyro. These classes have abilities that make them best suited for attacking the other team. ====Scout==== The Scout is a young man from Boston with an interest in baseball. He is the fastest runner in the game, making him a good class to use in capture the flag, as he can quickly run in, grab the enemy team's briefcase, and quickly run out. He also captures control points at twice the speed of any other class. However, he is also tied for the lowest health of any class. His default weapons include a scattergun, a pistol, and a baseball bat. ====Soldier==== The Soldier is a middle-aged man from the American midwest. His main weapon is a rocket launcher which he can use to blow up enemies, or, if fired at his own feet, can be used to make him jump very high. This is called 'rocket jumping.' Rocket jumping will hurt the Soldier, though, and if he is low on health, could kill him. Rocket jumping can also make the Soldier move forward very fast, sometimes even faster than the Scout. Soldier also uses shotguns and shovels to attack. The Soldier is a good offensive class but he cannot move very fast and is easy to hit. The Soldier has a large amount of health, the second highest of all the classes. ====Pyro==== The Pyro is a character wearing a full-body rubber suit and gas mask, so nobody knows their race, age, or gender. They also speak in a muffled voice so nobody knows what they're really saying. Pyro's main weapon is a flamethrower, used to set enemies on fire. Once an enemy is set on fire, they will burn for several seconds, meaning they can die even if they have killed the Pyro that set them on fire. This is called \"Afterburn\". For backup, they have a shotgun and a fire axe. The Pyro is good for checking for Spies using their flamethrower. This is called \"Spy-checking\". Pyros can help against Übercharged players by pushing them back with an \"air blast\" or \"compression blast\". The air blast can also reflect projectiles, such as grenades or rockets, back at the enemy team, which will inflict bonus damage. They are weak at long range. The Pyro has a good amount of both health and speed, though can run out of ammo quickly if players don't find ammo drops fast enough. ===Defense=== The defensive classes are the Demoman, the Heavy Weapons Guy, and the Engineer. The abilities of these classes make them best for defending things their team needs, such as control points, briefcases, and carts. ====Demoman==== The Demoman, short for Demolition Man, is a black Scotsman with an eyepatch. His main weapons are a grenade launcher and sticky bombs. Grenades will explode immediately if you hit a player before the grenade hits the ground, or a few seconds after being shot if they do not hit anything. Sticky bombs can stick to walls and then be set off by the Demoman when an enemy gets close. The Demoman can also replace his sticky launcher for a shield. The shield lets the Demoman charge forward at high speeds, and do more damage with his close-ranged weapon. There is a subclass for him called The Demoknight where he can use his melee weapon only or you could be a hybrid knight with a grenade launcher, shield, and his melee weapon. His close-range weapon is a bottle of whiskey. The Demoman is a very strong class. His sticky bombs do great damage, and can be used to 'sticky jump' much like how a Soldier can rocket jump. ====Heavy Weapons Guy (Heavy)==== The Heavy Weapons Guy, also known as the Heavy, is a middle-aged man from the Soviet Union who is built like a tank. Because of his large size, he has the highest health of all the classes, but is the slowest runner and is a huge target. His main weapon is a minigun which he named Sasha and treats like a person. The minigun does by far the most damage at close range of any gun in the game, due to its high fire rate and damage. It uses a lot of ammunition very quickly, so if he runs out, he can use his shotgun for close range kills or his fists to punch his enemies. The Heavy is great at close range or in small, cramped places. Spies and Snipers are useful for killing Heavies because they are capable of doing high damage instantly with backstabs (Spy) and headshots (Sniper). ====Engineer ==== The Engineer is a middle-aged man from Bee Cave, Texas with 11 Ph.D.s. His main use is to make buildings. His first building, the Sentry Gun, is a non-moving gun that targets enemies and shoots automatically. It can be improved to have more health and firepower. His next building is the Dispenser, which gives teammates nearby health and ammo. Finally, he can also build teleporters, which is a building that can teleport teammates from the first link to the second link, however enemies cannot go through the teleporters. However, disguised enemy Spies can enter these teleporters. The Engineer also has a shotgun, pistol, and a wrench to defend himself. His Sentries are great for stopping anything short of an Übercharged player. The Engineer himself is weak, and poorly placed Sentries can be blown up by experienced Soldiers and Demomen. Spies are the most lethal to an engineer due to their sappers. ===Support=== The last class type are the supporting classes, which are the Medic, the Sniper, and the Spy. Their abilities are there to help the team, so they do not typically engage in direct combat, but can if they must. ====Medic==== The Medic is an older man from Stuttgart, Germany. His main duty is healing the other classes. He has a machine called the Medi-gun which, when pointed at a teammate, slowly restores their health. He can also 'overheal' players, which gives them more health than they can normally have. This overheal slowly fades over time. After healing for a few minutes, the Medic is able to use an Übercharge, which makes him and his heal target invincible for a few seconds. For defense, the Medic has a bone saw and a gun that shoots syringes. The Medic is a very powerful teammate, but is easy to kill at the same time. Since he loses almost every direct fight, he usually stays with a teammate who he heals, which game-socially is called a 'Medic Buddy' or 'Pocket'. This Pocket player's job is to keep the Medic safe. The Pocket is usually a Heavy, Soldier, or Demoman due to their large health and firepower. ====Sniper==== The Sniper is a middle-aged man born in New Zealand. His main weapon is a sniper rifle. He often stays in one area away from the main battlefield and shoots enemies from a distance using careful aim. He also has a kukri and a sub-machine gun he can use in close combat. The Sniper is very good at killing the enemy Medics, Heavies, and Engineers. While using his sniper rifle, he can focus his aim to charge his shot, dealing more damage. An uncharged shot to the head does 150 damage. Only Pyros, Demomen, Soldiers, and Heavies can survive this without an overheal. A fully charged shot to the head deals 450 damage, enough to kill even an overhealed Heavy. ====Spy==== The Spy is a French man. His main asset is stealth. He has a watch which makes him invisible for short periods of time, and a cigarette case with disguises in it. He can disguise as any member of the other team to trick them into thinking he's a teammate. This disguise also tricks Sentry Guns built by Engineers. However, there are ways to find and kill spies, commonly called \"spy-checks\". The Spy can also place 'sappers' on enemy buildings, damaging them and disabling them until an Engineer can remove the sapper. For combat, he has a revolver and a butterfly knife. The knife allows the Spy to kill an enemy instantly if he stabs them in the back, but deals 40 damage from any other angle. He is useful for killing Medics, Heavies, Engineers, and Snipers. The Pyro is able to easily stop him, as even when he turns invisible or is disguised, players can still see the fire on him. The Spy is considered a \"pick class\", meaning he is very dispensable but also very useful to get certain kills. == Matchmaking == The game has different Matchmaking options which Allows players to play in Official Valve Matchmaking Servers and Level up their Rank. === Casual === Casual is the Main mode of TF2 and Added with the Meet Your Match Update. Players can choose what map they want to Queue in from any Gamemode. Players earn XP by earning Points during a match, Getting Autobalanced, or winning a match. After a Game, Players choose from 3 Maps. The First being the same Map, and the other 2 being Randomly Selected by the game for voting. This Mode has Gained some Controversy during Day 1 of the Update for Punishing Players with a Matchmaking Cooldown if they leave a Casual match while it's still going. This was later removed 2-7 Days after the Update. Competitive is the only Matchmaking mode with a Matchmaking Cooldown Penalty Today. ==== Quickplay ==== Quickplay is a Now Deleted Matchmaking mode for TF2. It was the Old and Only current way to Find a match Quickly and get into a Game. With the Release of the Meet Your Match Update, This mode was Removed and replaced with Casual. Since 2023-2024, There exists a Community run Version of Quickplay, Which randomly Puts the player onto a Select list of Community Servers. It was appreciated by the Community, Since it had 2 Benefits: It allowed Vanilla, Unmodified TF2 Servers to become popular, And it also was the Quickest way to get into a Server. === Competitive === Competitive, more known by the community as \"Valve Competitive\" is the same as Casual, but Players cannot choose what map they want to play on. This mode was also added with the Meet Your Match Update. The game Randomly Determines which map will be Selected for Competitive Matches. You also need a TF2 Premium Account status, at least Level 3 Casual Rank and a Verified Phone Number. This mode also disables Random Crits, Which allows certain weapons to randomly fire a Critical hit, which deals 3x the Normal Damage. Players Play in a 6v6 Format, Meaning that there are 6 Players on One team, and 6 on the other Team. Competitive Also includes a Stopwatch Mode which is Exclusive to Payload Maps. When the First Team selected as Offense role Pushes a Cart and gets the Cart to Capture Points, the Stopwatch will Increase. When the Round ends and the Roles Swap, the New Offensive team must Push the Cart to the capture points faster than the previous team. If the team beats the other team's time, they win. Otherwise, the other team Wins. This Matchmaking Mode has gained a lot of controversy over the years. One example is a Capture the flag map being in the Competitive Map Rotation. The Capture the Flag map has no time limit, which means that Games can keep going for a very long time with no Stalemate. This Matchmaking Mode has since become Very Unpopular and is almost barely Played. == Official Game modes == There are several different official ways the game can be played, each with different goals for the two opposing teams. ===Payload=== The Payload game mode has the BLU Team pushing a cart with a bomb on it along a track while the RED Team tries to stop them. If the offensive team cannot get the cart to the end of the track before the time limit runs out, they lose. If they are successful, the defending team's base is blown up and leads to a victory. Along the track are Checkpoints. Each Checkpoint the offensive team pushes the cart over will give them extra time to get the cart to the end of the track. ====Payload Race==== Valve later added a race mode to Payload maps, where both teams push a cart along a track to the other team's base. The team that gets the cart to the other team's base first wins. There are only 4-5 Maps made for Payload Race, one of them being Hightower, the most popular Payload Race Map. ===Control Points=== Control Point maps involve both teams attacking and defending the opposing team's Control Points. A Control Point is a circle on the ground that glows the color of the team that has captured it. Control Points are captured by standing on them for a certain length of time. There are three kinds of Control Point maps. ====Standard Control Points==== Standard Control Point, or Linear Control Point, maps play symmetrically. Both teams start with two controlled points, and a central point starts out neutral. The team that captures all control points wins. Traditional Control Point maps will go into Sudden Death (or Stalemate) if no team captures all the control points before times runs out. Control points closer to a team's spawn point are captured more quickly by the enemy team. ====Attack/Defend==== Attack/Defend maps play asymmetrically. RED begins with all the points in their control. BLU wins if it captures all of RED's points, but RED wins if the timer runs out before BLU can capture them all. Points may only be captured in a set order (though some maps, such as Gravel Pit and Steel, may make exceptions). RED wins if it prevents BLU from capturing all points before the timer expires. Points captured by BLU are typically locked and cannot be captured again by RED. ====Territorial Control==== In Territorial Control, the goal is to take over the entire map by capturing \"territories\". Each game is randomly selected from the six available layouts in a 'point against point' game where both teams must capture the opposite point while defending their own. After a team successfully captures the opposite point, the next round takes place in a different area of the map which is also randomly selected. After a team captures all four territories, that team must capture the enemy team's base. If the base point is captured (in Hydro, the Radar Dish for RED, the Power Plant for BLU), the attacking team wins the game. When the next round begins, territories are reset and a new random layout is selected. The Territorial Control game mode is not very popular amongst players. ====Domination Control Point==== In Domination Control Point, maps play symmetrically. Both teams start with no controlled points, and all points start out neutral. The team that captures all control points wins. Traditional Control Point maps will go into Sudden Death (or Stalemate) if no team captures all the control points before times runs out. Unlike Standard Control Point, once a team has all three points they win regardless of how much capture progress the other team has. There is currently only one ===Capture the Flag=== In Capture the Flag mode, the map is split into two nearly identical bases; one for each team. Both bases have a briefcase in them. The goal is for one team to grab the other team's briefcase and bring it back to their own base, while defending their own briefcase. You must capture the enemy intelligence 3 times in order to win the game, but server modifications can alter the number. When a player carrying the briefcase is killed, the intelligence is on the ground and returns to its base after a 60 second time period. The player who dropped the intelligence or his team can pick up the briefcase before it returns and still capture it. If a player drops the intelligence by falling into a bottomless pit, it automatically returns to its base. The briefcase can also be manually dropped. ===King of the Hill=== In King of the Hill mode, two teams fight to gain control over one point which is in the center of the map. Each team has their own time limit. When one team captures the point, they must defend it until their teams time runs out to win. During this time, the enemy team can attack and capture the point too. This happens over and over again until one team successfully holds the point until their time runs out. ===Arena=== In Arena mode, two teams fight to the death. Once a team is completely wiped out, the other team wins. There is no respawning in Arena mode. Another way to win is to capture the control point that wont be activated until one minute in the match. Once this point is captured by a team, that team wins. This mode was removed off of official matchmaking on July 7th, 2016, in the Meet Your Match update, however, can still be played in community servers. ===Medieval Mode=== Medieval Mode is just like Attack/Defend except that only prehistoric Weapons are allowed. Players can use melee weapons and weapons that don't have firepower but cannot use guns, rocket launchers, flame throwers, stickybomb launchers, or grenade launchers. So far, there is 3 Medieval Mode maps with DeGroot Keep being added Officially, which is DeGroot Keep, which is a huge medieval-type castle with many entrances and halls, Sandcastle, which is the same as DeGroot Keep but set in a sandbox and Burghausen. A certain loadout for Demoman, commonly called a \"Demoknight build\" from the fan-base, is useful for this map because of his high-damage swords. ===Special Delivery=== Special Delivery is a Game Mode released as part of the Pyromania Update. Like Capture the Flag gamemode, an initially neutral briefcase of Australium must be transported to Poopy Joe's rocket before the opposing team can do the same. If a player picks up the Australium and is killed while holding it, only players from the same team as the dead briefcase carrier can pick it up again. If the team fails to do so within a few seconds, the briefcase is sent back to its original position. The player who has hold of the Australium must be on the platform that is raised to the compartment at the head of the rocket and must stay on the platform as the Australium is placed into the compartment, launching the rocket and winning the round. There is currently only one official Special Delivery map, and that is Doomsday. ===Mann vs. Machine=== In Mann vs. Machine (commonly shortened to MvM), a team of six players (all wearing RED uniforms) must stop hordes of robots divided into waves from deploying a portable bomb into their base. When a robot is destroyed, it drops an in-game currency known as \"credits.\" Players can pick up these credits before they disappear and use them to buy upgrades for their weapons and themselves that are gamemode-exclusive. Some weapon upgrades include more damage, faster firing speed, more ammo, etc. Some player upgrades include faster speed, higher jump height, health regeneration, etc. There are different kinds of robots with different weapons and abilities. Some robots are known as \"Giants.\" A giant normally has far better weapons and abilities than their normal counterparts. ====Mann Up==== There is a special type of MvM known as \"Mann Up\" mode. In Mann Up mode, players complete Tours using Tour of Duty Tickets or Squad Surplus Vouchers they have bought from the online store, known as the Mann Co. Store, and from the Steam Community Market. Each Operation has a specific number of Tours in them. Finish all the waves in a Tour and all the Tours to complete the Operation. Different Tours are for different skill levels and have different robots. Completing Tours and Operations will give the players \"loot\" or special in-game cosmetic items players use to customize their character. In Mann Up mode, the gameplay (upgrades, maps, robots) are the same in standard MvM. === PASS Time === In PASS Time, Two teams fight to score a goal with a ball known as the JACK. Players hold the JACK like it’s American football. There are 3 goals. Run-in goals, Throw-in goals and Bonus goals. When a team scores a goal at the enemy team's Run in or Throw in goals, They give the scoring team 1 point. If a team scores a goal at the enemy team's Bonus goal, Always at hard to reach places, The scoring team gets 3 points and the Bonus goal closes. If a Player is holding the JACK, They will be Marked-For-Death. This means that All Damage Recieved by enemy players will be Critical Hits (which causes 3x the normal damage). Players are able to Pass to other players in order to get the Bonus goals open on both sides. The longer a (successful) pass takes, The Faster the Bonus Goal Opens. Passes can also be stopped by enemy players. The first team to score 5 points wins the round. If a team wins 2 rounds, they win the entire game. If the Time Limit ends and there is a tie in score between both teams, the Round ends in a Stalemate, and Nobody Wins. In PASS time, there are only 4 maps. == Community Game modes == There are also Game modes created by the Community via the Steam Workshop, which has been Selected by Valve to be added into the official game. These games often have lots of differences from the original game. === Versus Saxton Hale (VSH) === Versus Saxton Hale is a Community Game mode Created by LizardOfOz, Who Previously made a older version of this Game mode around 2010. In VSH, All Players are ordered by Grey Mann, Current CEO of the fictional Company Mann Co. which is responsible for Supplying the BLU and RED Team with Weapons and Ammunition, to fight against a randomly selected player. When a player is selected, They get to play as Saxton Hale, Who is Australian and is the Former CEO of Mann Co. Some weapons have been changed and balanced for this Game mode. Saxton Hale wins by Killing all other players (the mercenaries) Or by Capturing the Main Control point after a Time limit, Similar to Arena. The Mercenaries win by Killing Hale, or by Capturing the Control point as well. If after the time limit Hale or the Mercenaries are not dead and if the central point is not captured after a few minutes, The Round ends in a Stalemate. Saxton Hale has Special abilities in order to help with killing the other players. These are: * Brave Jump * Charge Attack * Ground Slam * Saxton Punch == Marketing == Valve Corporation posted several animations using their Source FilmMaker (commonly shortened to SFM) program from 2009 to 2012. Each one of these videos are short skits using humorous depictions of the 9 Team Fortress 2 classes in their real lives, and out in battle. Some of these videos have been viewed many times with, \"Meet The Medic\", at 93 Million views. And, \"Meet The Spy\", at 57 Million views, and more. ==Development== === Origins and early development === The original Team Fortress was developed by Robin Walker and John Cook. This early version of Team Fortress was a free mod for the 1996 PC game Quake. In 1998, Walker and Cook were employed by Valve. At the time, Valve just released its first game, Half-Life. Valve began developing Team Fortress 2 as a separate retail game using one of Valve's own game engines, GoldSrc. In 1999, Valve released Team Fortress Classic, a port of the original Team Fortress, as a free Half-Life mod. Team Fortress Classic was developed using the publicly available Half- Life software development kit as an example to the community and industry of the flexibility of the Half-Life game. Unlike the original Team Fortress, Valve originally planned Team Fortress 2 to have a modern war theme. It would feature a command hierarchy including a Commander class, parachute drops over enemy territory, networked voice communication, and many other unique features. The Commander class played similarly to a real-time strategy game, with the player viewing the game from a bird's-eye perspective and issuing orders to players and AI-controlled soldiers. Team Fortress 2 was first shown at the trade event E3 1999. At E3 1999, Valve had showcased new technologies that they had developed while making Team Fortress 2. This included parametric animation, which blended animations for smoother, more lifelike movement. The game also showcased Intel's multi-resolution mesh technology, which increased performance for the game by reducing detail of on-screen elements that are far away from the screen. The game earned several awards including Best Online Game and Best Action Game. In mid-2000, Valve announced that Team Fortress 2 had been delayed for a second time. They stated that they delayed Team Fortress 2 because they were going to make Team Fortress 2 run on an engine they own, the Source engine. After their official announcement of the delay of Team Fortress 2, Valve stopped releasing information about the game. Later, the game entered six years of silent development. Walker and Cook worked on various other Valve projects; Walker was project lead on Half-Life 2: Episode One and Cook became a Steam developer. Team Fortress 2 became a prominent example of vaporware. It was a long-anticipated game that had seen years of development, and was often mentioned alongside another much-delayed game, Duke Nukem Forever. Walker later stated that Valve built \"three to four\" different versions of Team Fortress 2 before settling on their final design. Shortly before the release of Half-Life 2 in 2004, Valve's marketing director Doug Lombardi confirmed that Team Fortress 2 was still in development. Valve reintroduced Team Fortress 2 at the July 2006 EA Summer Showcase event with a much different visual design. === Final design === Valve reintroduced Team Fortress 2 at the July 2006 EA Summer Showcase event with a much different visual design. Instead of having realistic visual design like other Valve games, Team Fortress 2 features a cartoon-like visual style influenced by 20th-century commercial illustrations and the artwork of J. C. Leyendecker, Dean Cornwell, and Norman Rockwell, Video summary (WMV, 75.4MB) achieved through a visual technique called Gooch shading. Team Fortress 2 was first launched with the Source engine's new dynamic lighting, shadowing and soft particle technologies, and gave the same visual enhancements to Half-Life 2: Episode Two, another one of their games. Team Fortress 2 was the first game to use the Source engine's new Facial Animation 3 features. Valve abandoned the realistic style when it became impossible to balance it with the unrealistic gameplay. For example, it is not realistic to have opposing armies to construct heavily detailed bases directly next to each other. The Commander class was abandoned because players would simply refuse to follow the player's orders. Valve designed each character, team, and equipped weapon to be easy to identify, even at long range. For example, the coloring draws attention to the chest area, bringing focus on the equipped weapon. The voices for each of the classes were based on imagining what people from the 1960s would expect the classes to have sounded like, according to writer Chet Faliszek. The map design has an \"evil genius\" theme. In typical maps, there are colored enemy buildings on opposite sides of the two enemies. Enemy buildings have a complex set of pathways that the player must go through to reach the objectives. These buildings are often concealed within various other constructed objects in between. Between each enemy side, maps are usually separated by a neutrally themed space. The bases hide exaggerated super weapons such as laser cannons, nuclear warheads, and missile launch facilities, taking the role of objectives. The maps are designed to have little visual clutter and have a theme, as well as have enough careful attention to effective visual design while still allowing enemies to be spotted more easily. This is achieved by using \"impressionist modeling\". The textures used in-game are based on photos that are filtered and improved by hand, making them look visually appealing and giving Team Fortress 2 its distinct look. The bases are designed to let players immediately know where they are. RED bases use warm colors (e.g. red), natural materials, and angular shapes (e.g. circles). On the other hand, BLU bases use cool colors (e.g. blue), industrial materials, and orthogonal shapes (e.g. squares). === Release === During the July 2006 Electronic Arts press conference, Valve revealed that Team Fortress 2 would arrive as the multiplayer component of The Orange Box. In a conference trailer, the whimsical new visual style of Team Fortress 2 of all nine mercenary classes were shown. Managing director of Valve Gabe Newell said that the company's goal was to create \"the best looking and best-playing class-based multiplayer game\". On September 17, 2007, a beta release of the entire game was released to Steam. On the same date, a the same beta release of the entire Team Fortress 2 game was made available for customers who had pre-purchased The Orange Box, as well as for customers who had activated their Black Box coupon. The Black Box coupon was included with the ATI HD 2900XT Graphics cards. The beta of Team Fortress 2 was also given to members of Valve's Cyber Café Program. The beta continued until the game's final release. The game was released on October 10, 2007, both as a standalone product via Steam and at retail stores as part of The Orange Box compilation pack. Both the Steam version and the retail The Orange Box compilation packs were priced at each gaming platform's recommended retail price. The Orange Box also contains Half- Life 2, Half-Life 2: Episode One, Half-Life 2: Episode Two, and Portal. Valve offered The Orange Box at a ten percent discount for those who pre-purchased it on Steam before the October 10 release, as well as the opportunity to participate in the beta test. == Problems == === Cheating === Since 2019, Team Fortress 2 has seen lots of bots join the casual servers. Even though the bots had been an issue back in 2019, many sources have seen a spike in the amount of bots. The activities of these bot accounts include causing servers to crash, spamming swears and slurs using the in-game text and voice chat, stealing other people's usernames to trick players into harassing the innocent person and using cheat software to help hit headshots. Some bots were using a TF2 source code leak which was confirmed by the game's creator Valve Software in April of 2020. On the 16th of June 2020, Valve responded by removing the ability to use text and voice chat for players that did not have Premium Account Status for TF2. Later that month, on the 24th, all players were not able to change their Steam username while they were in any Valve matchmaking server. This was done to stop the bots from changing their usernames to impersonate real players which let the bots avoid being removed from the game because there was more than one of the same name. ==== The \"#SaveTF2\" and \"#FixTF2\"movement ==== On the 26th of May 2022, people of the game's community held a peaceful protest using the hashtag '#savetf2' with the goal being to get Valve to respond. They were able to get a response from Valve with them responding by saying: \"TF2 community, we hear you! We love this game and know you do, too. We see how large this issue has become and are working to improve things.\" 1 year later, Another Protest using the hashtag '#fixtf2' was held. This time, the Protesters did not buy Anything from the official Mann. Co Store Until the Bots were gone before the Summer 2023 Update. There was also a Petition held with all of the Signers names/e-mails being Printed onto a Book which was later Sent to Valve. Since then, There has been a significant decrease in Bots thanks to VAC (Valve Anti-Cheat)'s Mass Ban Wave, however Human Cheaters still roam the Game. == Notes == == References == ==Other websites== Category:2007 video games Category:First-person shooters Category:Free-to-play video games Category:Hero shooters Category:Linux games Category:MacOS games Category:Multiplayer and single-player video games Category:Multiplayer online games Category:PlayStation 3 games Category:Valve Corporation games Category:Video game sequels Category:Video games developed in the United States Category:Virtual reality games Category:Windows games Category:Xbox 360 games",
 "title": "Team Fortress 2"
}