{
 "id": "732768",
 "text": "Ralf Alastair John Little (born 8 February 1980) is an English actor, writer, and semi-professional footballer. Little is known for acting in comedy shows. He has played Antony Doyle in The Royle Family and Jonny Keogh in the first six series of Two Pints of Lager and a Packet of Crisps on BBC Two, as well as known for playing Joseph in an episode of the second season for the BBC series Robin Hood. ==Filmography== ===Film=== Year Title Role Notes 2002 24 Hour Party People Hooky (Peter Hook) Al's Lads Dan Also known as Capone's Boys 2004 Fat Slags Milkman 2005 Frozen Eddie Zemanovaload Kev 2007 The Waiting Room Stephen 2008 Telstar: The Joe Meek Story Chas Hodges 2011 Life of the Party Jason Short film The Itch of the Golden Nit Fireboy (voice) Short film Powder Syd 2012 Get Lucky Miles Short film 2013 The Unbeatables Captain Skip (voice, UK dub) Also known as Metagol, Underdogs and Foosball 2014 Nativity 3: Dude, Where's My Donkey?! Charlie Ford (Sophie's brother) 2017 National Theatre Live: Ugly Lies the Bone Stevie ===Television=== Year Title Role Notes 1994–1995 Sloggers Scooby 7 episodes 1995 Heartbeat Eddie Tinniswood Episode: \"Vigilante\" Elidor Morris Dancer's Son 2 episodes: \"#1.1\" and \"#1.4\" 1998 The Ward Robbie Episode: \"#10.11\" 1998–2010 The Royle Family Antony Royle Main role. 22 episodes 1999 Coronation Street Mark Stranks 3 episodes City Central Dave Episode: \"Life, Liberty and Pursuit\" Bostock's Cup Norman Lewis Television film The Flint Street Nativity Clive Cattle / Star of Bethlehem Television film Heartbeat Julian Episode: \"Fire and Ashes\" 2000 Monkey Trousers Various characters Always and Everyone Frankie 2 episodes: \"Outbreak\" and \"The Darkest Corners\" Aladdin Wishee Washee Television film 2001 The Bill Tommy Lawson 3 episodes Is Harry on the Boat? Trevor Television film 2001–2006 Two Pints of Lager and a Packet of Crisps Jonny Keogh Main role. 55 episodes 2002 North Face Paul Television short film 2002–2003 Paradise Heights / The Eustace Bros. Richard Eustace Main role. 12 episodes 2004 The Comic Side of 7 Days Narrator (voice) 2006 Brief Encounters Simon Mini-series. Episode: \"Small Things\" 2007 Heartbeat Stephen Lansbury Episode: \"Seeds of Destruction\" KateModern Gavin Taylore Robin Hood Joseph Episode: \"The Angel of Death\" 2008 Massive Danny Stewart 6 episodes Marple Sergeant Pickford Episode: \"A Pocketful of Rye\" 2010 Married Single Other Clint 6 episodes 2011 Little Crackers Colin Smith Episode: \"Sheridan Smith's Little Cracker: The Daltons\" 2011–2013 The Café Richard Dickens Main role. 13 episodes 2013 Death in Paradise Will Teague Episode: \"A Dash of Sunshine\" 2014 Our Zoo Billy Atkinson Mini-series. 6 episodes 2015 Drunk History 'Colonel' Thomas Blood Episode: \"Blackbeard / Colonel Blood / Henry VIII\" The Interceptor Alex Mini-series. Episode: \"#1.6\" Lewis Sean Wilkinson 2 episodes: \"One for Sorrow: Parts 1 & 2\" 2016 The Girl Whisperer Sam 3 episodes Midsomer Murders Jared Horton Episode: \"Saints and Sinners\" Hoff the Record Barman Episode: \"Wedding\" 2016–2017 Borderline Narrator / Barry the Plumber Main role. 12 episodes 2016–2020 The A Word Stuart 4 episodes 2017 Doctor Who Steadfast Episode: \"Smile\" 2020 Inside No. 9 Phil Episode: \"The Referee's a W***er\" 2020–present Death in Paradise DI Neville Parker Main role. 30 episodes (as of 24 February 2023) 2023 Beyond Paradise DI Neville Parker Episode: \"#1.6\" ==Awards and nominations== Year Award Work Result Ref 2017 Los Angeles Web Series Festival Best Web Comedy The Girl Whisperer 2020 TV Times Award for Favourite Actor Death in Paradise 2021 TV Times Award for Favourite Actor Death in Paradise ==References== Category:1980 births Category:British movie actors Category:British television actors Category:English atheists Category:English footballers Category:Living people",
 "title": "Ralf Little"
}