{
 "id": "732838",
 "text": "The following is a list of deaths that should be noted in February 2020. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. ==February== ===1=== * Péter Andorai, 71, Hungarian actor (My Father's Happy Years, Bizalom, My 20th Century).Elhunyt Andorai Péter * Ilie Bărbulescu, 62, Romanian footballer (Argeș Pitești, Steaua, national team), heart attack.A murit Ilie Bărbulescu, câștigător al Cupei Campionilor Europeni cu Steaua, în 1986 * Harold Beane, 73, American funk guitarist (Isaac Hayes, Funkadelic). * Leons Briedis, 70, Latvian poet and novelist, Vice-President of the Latvian PEN Club (1993–1997).Mūžībā devies dzejnieks Leons Briedis * John A. DiBiaggio, 87, American educator, President of the University of Connecticut (1970–1985), Michigan State University (1985–1992) and Tufts University (1992–2001). * Lila Garrett, 94, American television writer (Bewitched, All in the Family, Baby, I'm Back). * Andy Gill, 64, English post-punk guitarist (Gang of Four) and record producer, pneumonia. * Clarence \"Jeep\" Jones, 86, American community activist. * Jaswant Singh Kanwal, 100, Indian writer. * Luciano Ricceri, 79, Italian production designer (A Special Day, Captain Fracassa's Journey).Da Scola a Montalbano, addio al grande scenografo Ricceri * Peter Serkin, 72, American classical pianist, Grammy winner (1966), pancreatic cancer. * Charles Wood, 87, British screenwriter and playwright (The Knack ...and How to Get It, Help!, Iris). ===2=== * Bernard Ebbers, 78, Canadian-American communications businessman and convicted fraudster, co- founder and CEO of WorldCom (1985–2002), problems caused by dementia and heart disease. * Mad Mike Hoare, 100, British mercenary leader (Congo Crisis, Operation Angela). * Ivan Král, 71, Czech-born American jazz-pop singer- songwriter (\"Ask the Angels\", \"Pumping (My Heart)\", \"Dancing Barefoot\"), musician and filmmaker (The Blank Generation), cancer. * Philip Leder, 85, American geneticist (Nirenberg and Leder experiment), member of the National Academy of Sciences (since 1990), National Medal of Science awardee (1991), problems caused from Parkinson's disease. * Mike Moore, 71, New Zealand politician, Prime Minister (1990), Director-General of the World Trade Organization (1999–2002) and Ambassador to the United States (2010–2015). * Gale Schisler, 86, American politician, member of the U.S. House of Representatives from Illinois's 19th congressional district (1965–1967). * Robert Sheldon, Baron Sheldon, 96, British politician, MP (1964–2001), Financial Secretary to the Treasury (1974–1979) and member of the House of Lords (2001–2015), heart attack. * Salahuddin Wahid, 77, Indonesian politician and Islamic educator, MP (1998–1999) and 2004 vice presidential candidate, problems caused by surgery.Innalilahi Wa Inna Ilaihi Raji'un, Gus Solah Wafat ===3=== * Deborah Batts, 72, American lawyer and politician, Judge of the U.S. District Court for the Southern District of New York (1994–2012), first openly gay federal judge, problems caused by knee surgery. * Gene Reynolds, 96, American actor (Gallant Sons) and television producer (M*A*S*H, Lou Grant), Emmy winner (1975, 1976), heart failure. * Frank H. T. Rhodes, 93, British- American geologist and academic, President of Cornell University (1977–1995) * George Steiner, 90, French-American literary critic, Holocaust survivor and essayist (After Babel). * Willie Wood, 83, American Hall of Fame football player (Green Bay Packers) and assistant coach (San Diego Chargers, Toronto Argonauts), problems caused by dementia. ===4=== * Claudio Bonadio, 64, Argentine lawyer and politician, Judge of the Federal Criminal and Correctional Court (since 1994), oversaw the Notebook scandal and AMIA bombing, brain cancer. * Kamau Brathwaite, 89, Barbadian poet and academic. * Gil Coan, 97, American baseball player (Washington Senators, Baltimore Orioles, New York Giants). * José Luis Cuerda, 72, Spanish movie director (Butterfly's Tongue, Amanece, que no es poco), producer (The Others) and screenwriter, Goya winner (1987, 1988, 2000, 2009).Muere José Luis Cuerda a los 72 años * Terry Hands, 79, British theatre director (Royal Shakespeare Company, Theatr Clwyd). * Peter Hogg, 80, New Zealand-born Canadian lawyer and legal scholar. * Volker David Kirchner, 77, German violist and composer.Mainzer Komponist Volker David Kirchner gestorben * Nadia Lutfi, 83, Egyptian actress (The Night of Counting the Years, Saladin the Victorious). * Alice Mayhew, 87, American book editor and publisher (Simon & Schuster). * L. Jacques Ménard, 74, Canadian businessman and educator, Chancellor of Concordia University (2012–2014). * Daniel arap Moi, 95, Kenyan politician, MP (1963–2004), Vice President (1967–1978) and President (1978–2002), problems caused by multiple organ failure. * Teodor Shanin, 89, Lithuanian-born British-Russian sociologist (The Awkward Class) and educator. ===5=== * Carlos Barisio, 69, Argentine footballer (Gimnasia, All Boys, Ferro Carril Oeste), lung cancer. * Buddy Cage, 73, American pedal steel guitarist (New Riders of the Purple Sage, Great Speckled Bird), multiple myeloma. * Stanley Cohen, 97, American biochemist, discovered the epidermal growth factor, Nobel Prize winner (1986).Biochemist and Nobel Prize winner Stanley Cohen dies in Nashville at age 97 * Kevin Conway, 77, American actor (Gettysburg, Thirteen Days, Invincible), heart attack. * Kirk Douglas, 103, American actor (Spartacus, Paths of Glory, The Bad and the Beautiful) and writer, Golden Globe winner (1956) and Honorary Oscar winner (1996). * Abadi Hadis, 22, Ethiopian Olympic long-distance runner (2016). * Beverly Pepper, 97, American sculptor. * Lawrence W. Pierce, 95, American lawyer and politician, Judge of the U.S. District Court for the Southern District of New York (1971–1981) and Court of Appeals for the Second Circuit (1981–1990). ===6=== * Francie Brolly, 82–83, Northern Irish politician, MLA (2003–2010). * Lynn Evans, 95, American singer (The Chordettes), stroke. * Roger Kahn, 92, American writer (The Boys of Summer). * Malik Ata Muhammad Khan, 78, Pakistani feudal lord and politician, MLA (1990–1993), President of the Equestrian Federation (since 1982) and Vice President of the International Tent Pegging Federation (since 2013). * Ola Magnell, 74, Swedish pop-rock singer-songwriter (\"Jag fryser (på dej)\", \"Kärlek\", \"Fan på väggen\") and guitarist, heart failure.Ola Magnell död – blev 74 år gammal * J. B. Sumarlin, 87, Indonesian economist and politician, Minister of Finance (1988–1993). * Jhon Jairo Velásquez, 57, Colombian hitman, drug dealer and extortionist (Medellín Cartel), esophageal cancer.Décès de Jhon Jairo Velásquez, alias «Popeye», tueur à gages le plus célèbre de Pablo Escobar * Wang Jin, 93, Chinese archaeologist (Qujialing culture, Panlongcheng), tuberculosis.中国第一代女考古学家王劲病逝，享年94岁 ===7=== * Orson Bean, 91, American actor (The Twilight Zone, The Hobbit, Dr. Quinn, Medicine Woman) and game show panelist (To Tell the Truth), road accident. * Angel Echevarria, 48, American baseball player (Colorado Rockies, Milwaukee Brewers, Chicago Cubs), fall. * Lucille Eichengreen, 95, German-American Holocaust survivor and writer. * Brian Glennie, 73, Canadian ice hockey player (Toronto Maple Leafs, Los Angeles Kings, Tulsa Oilers), Olympic bronze medalist (1968). * Li Wenliang, 34, Chinese physician, novel coronavirus (2019-nCoV). * Nexhmije Pagarusha, 86, Albanian singer (\"Kur më del në derë\", \"Dallëndyshe\") and actress (Lepuri me pesë këmbë). * Larry Popein, 89, Canadian ice hockey player (New York Rangers, Oakland Seals) and coach (Omaha Knights). * Harold Strachan, 94, South African writer and anti-apartheid activist, problems caused from liver disease. * Ann E. Todd, 88, American child actress (Homesteaders of Paradise Valley, Arthur Takes Over, Cover Up), problems caused by dementia. ===8=== * Robert Conrad, 84, American actor (The Wild Wild West, Baa Baa Black Sheep, Jingle All the Way), heart failure. * Victor Gorelick, 78, American comic book editor (Archie Comics). * Paula Kelly, 77, American actress (Night Court, Santa Barbara, Soylent Green) and dancer, problems caused by COPD. * Erazim Kohák, 86, Czech philosopher and writer.Zemřel filozof Erazim Kohák. Bylo mu 86 let * Ron McLarty, 72, American writer (The Memory of Running), narrator and actor (Spenser: For Hire, Courage the Cowardly Dog), problems caused by dementia. * Yi Hae-won, 100, South Korean princess, head of the House of Yi (since 2005).조선황실 마지막 옹주 이해원씨 별세 고종의 손녀, 의친왕의 차녀, 노환으로 향년 103세에 세상 떠나 ===9=== * Mirella Freni, 84, Italian operatic soprano, problems caused by degenerative disease and multiple strokes.Morta Mirella Freni, grande soprano e sorella di latte di Pavarotti * Margareta Hallin, 88, Swedish operatic soprano, actress and composer, member of the Swedish Society of Composers (since 1990).Operasångerskan Margareta Hallin är död * Giriraj Kishore, 82, Indian writer, Padma Shri awardee (2007), heart attack. * P. Parameswaran, 91, Indian historian and political activist (Rashtriya Swayamsevak Sangh), Padma Shri awardee (2004). * Carlos Julio Pereyra, 97, Uruguayan politician, Senator (1966–2005), 1989 and 1994 presidential candidate, kidney failure.Falleció el dirigente del Partido Nacional Carlos Julio Pereyra ===10=== * Efigenio Ameijeiras, 88, Cuban revolutionary and military commander, key figure during the Bay of Pigs Invasion, sepsis.Fallece el General de División Efigenio Ameijeiras Delgado * Diana Garrigosa, 75, Spanish teacher and activist (Pasqual Maragall Foundation).Muere Diana Garrigosa, esposa del expresidente de la Generalitat, Pasqual Maragall * Lyle Mays, 66, American jazz pianist and composer (Pat Metheny Group), multi-Grammy winner. * Shariff Abdul Samat, 36, Singaporean footballer (Home United, Tampines Rovers, national team), heart attack. ===11=== * François André, 52, French politician, Deputy (since 2012), lung cancer.Ille-et-Vilaine. Le député François André est décédé * Claire Bretécher, 79, French cartoonist and writer, co-founder of L'Echo des savanes.Décès de la dessinatrice Claire Bretécher à l’âge de 79 ans * Bob Cashell, 81, American businessman and politician, Lieutenant Governor of Nevada (1983–1987) and Mayor of Reno (2002–2014), problems caused from heart disease. * George Coyne, 87, American Jesuit priest and astronomer, Director of the Vatican Observatory (1978–2006), George Van Biesbroeck Prize winner (2009), bladder cancer. * Ron Haddrick, 90, Australian cricketer and actor (The Stranger, Dot and Santa Claus, Quigley Down Under).Leading man — in art and life * Louis-Edmond Hamelin, 96, Canadian geographer.Le géographe Louis- Edmond Hamelin s’éteint à l'âge de 96 ans * Jacques Mehler, 83–84, Spanish- born French-American cognitive psychologist, member of the American Academy of Arts and Sciences (since 2001) and American Association for the Advancement of Science (since 2003). * Katsuya Nomura, 84, Japanese Hall of Fame baseball player (Nankai Hawks) and manager (Yakult Swallows), heart attack. * Marcelino dos Santos, 90, Mozambican poet and politician, Vice President of FRELIMO (1970–1977) and President of the Assembly of the Republic (1977–1994). * Joseph Shabalala, 78, South African singer and musician (Ladysmith Black Mambazo), problems caused from back surgery. * Betty Siegel, 89, American academic, President of Kennesaw State University (1981–2006). ===12=== * Benon Biraaro, 61, Ugandan military officer and politician, Commander of the People's Defence Force and 2016 presidential candidate, colon cancer. * Christie Blatchford, 68, Canadian journalist (The Globe and Mail, National Post, Toronto Sun), lung cancer. * Hubert Boulard, 49, French comic book author.Le scénariste de bande dessinée Hubert est mort * Paul English, 87, American drummer (Willie Nelson), pneumonia. * Geert Hofstede, 91, Dutch social psychologist. * Frederick R. Koch, 86, American businessman (Koch Industries), art collector and philanthropist, heart failure. * Wendell Rodricks, 59, Indian fashion designer (De Beers) and activist, member of the Fashion Design Council of India (since 1998), Padma Shri awardee (2014), cardiac arrest. * Brenda Galweski 53, Aide at Decorah Elementary School, brain injury * Nikitas Venizelos, 89, Greek businessman (Venizelos SA) and politician, MP (1974–1981, 1993–1996) and Deputy Speaker (1993–1996).Πέθανε ο πρώην βουλευτής Νικήτας Βενιζέλος, εγγονός του εθνάρχη * Tamás Wichmann, 72, Hungarian sprint canoeist, Olympic silver (1968, 1972) and bronze (1976) medalist. ===13=== * Aleksey Botyan, 103, Soviet-Armenian spy and intelligence officer. * Sir Des Britten, 80, New Zealand television chef, businessman and Anglican priest, cancer. * Renzo Chiocchetti, 74, Italian Olympic cross-county skier (1972, 1976).Lutto nel mondo sportivo fassano: è morto Renzo \"Nacio\" Chiocchetti * Rajendra K. Pachauri, 79, Indian economist and engineer, Chairman of the Intergovernmental Panel on Climate Change (2002–2015), problems caused from heart surgery. * Daniel M. Pierce, 91, American politician and lawyer, member of the Illinois House of Representatives (1965–1985) and Mayor of Highland Park (1987–1995, 1999–2003). * Charles H. Pitman, 84, American Marine Corps lieutenant general, cancer. * Jacob Thiele, 40, American rock keyboardist (The Faint). * Jimmy Thunder, 54, Samoan-born New Zealand heavyweight boxer, Commonwealth Games champion (1986), problems caused from brain surgery. ===14=== * Alwin Brück, 88, German politician, Deputy MP (1965–1969) and MPACE (1969–1970).SPD-Politiker Alwin Brück ist tot * Lynn Cohen, 86, American actress (Sex and the City, Munich, The Hunger Games: Catching Fire). * Christophoros, 88, Greek Orthodox prelate.Καναδά Σωτήριος: Ο Επίσκοπος Χριστοφόρος ήταν «Άνθρωπος του Θεού» * Reinbert de Leeuw, 81, Dutch conductor, composer and pianist.Dirigent en componist Reinbert de Leeuw (81) is overleden. Dat heeft een woordvoerder namens de familie en vriendenkring laten weten * Decebal Traian Remeș, 70, Romanian economist and politician, Minister of Finance (1998–2000).Fostul ministru Decebal Traian Remeș a murit * John Shrapnel, 77, English actor (Gladiator, Troy, 101 Dalmatians), cancer. * Masao Takahashi, 90, Canadian judoka, World Judo bronze medalist (1979). * Clayton Williams, 88, American businessman and politician, problems caused from pneumonia. ===15=== * Tony Fernández, 57, Dominican baseball player (Toronto Blue Jays, San Diego Padres, Cleveland Indians), problems caused from kidney disease and stroke. * Caroline Flack, 40, English radio and television presenter (I'm a Celebrity: Extra Camp, The Xtra Factor, Love Island), suicide. * A. E. Hotchner, 102, American editor and novelist, co-founder of Newman's Own. * Éric Laforge, 56, French radio personality (Europe 1, RTL2, Radio France), problems caused from surgery.Eric Laforge est décédé * Vatroslav Mimica, 96, Croatian movie director (Prometheus of the Island, The Falcon) and screenwriter (The Jubilee of Mr Ikel).OTIŠAO JE VELIKAN NAŠE KINEMATOGRAFIJE Preminuo doajen hrvatskog filma, redatelj, scenarist i producent Vatroslav Mimica * David Sturtevant Ruder, 90, American jurist and academic, Chair of the U.S. Securities and Exchange Commission (1987–1989). * Donald Stratton, 97, American Naval military personnel (USS Arizona) and writer, Pearl Harbor survivor. * José Zalaquett, 77, Chilean lawyer and civil rights activist, member (2002–2005) and President of the Inter-American Commission on Human Rights (2004–2005), problems caused from Parkinson's disease.Muere José Zalaquett, destacado abogado y defensor de derechos humanos ===16=== * Graeme Allwright, 93, New Zealand-born French singer-songwriter.Le chanteur folk Graeme Allwright est mort * Joan Armengol, 97, Andorran politician, Mayor of Andorra la Vella (1970–1971).L'ex cònsol major d'Andorra la Vella, Joan Armengol mor als 97 anys * Zoe Caldwell, 86, Australian actress (Master Class, Lilo & Stitch, Extremely Loud & Incredibly Close), multi-Tony winner, problems caused from Parkinson's disease. * Pearl Carr, 98, English singer (Pearl Carr & Teddy Johnson), Eurovision contestant (1959). * Jason Davis, 35, American actor (Recess, Beverly Hills Ninja, Roseanne). * Harry Gregg, 87, Northern Irish footballer (Manchester United, national team) and manager (Shrewsbury Town), survivor of the Munich air disaster. * Jerzy Gruza, 87, Polish movie director (Dzięcioł) and screenwriter (Czterdziestolatek).Stworzył \"Wojnę domową\" i \"Czterdziestolatka\". Zmarł Jerzy Gruza * Loek Hollander, 81, Dutch karate practitioner.Karateka-legende Loek Hollander overleden * Barry Hulshoff, 73, Dutch footballer (Ajax, national team) and manager (Lierse), European Cup champion (1971, 1972, 1973).Voormalig Ajax-verdediger Barry Hulshoff (73) overleden * Robert B. Jordan, 87, American politician, Lieutenant Governor of North Carolina (1985–1989) and member of the North Carolina Senate (1977–1985). * Kellye Nakahara, 72, American actress (M*A*S*H, Clue, 3 Ninjas Kick Back) and artist, cancer. * Glenn E. Summers, 94, American politician, member of the Florida House of Representatives (1947–1951). * Larry Tesler, 74, American computer scientist (Apple Corps, Xerox), designer of cut, copy, and paste, problems caused from a bike accident. ===17=== * Owen Bieber, 90, American labor union executive, President of the United Automobile Workers (1983–1995). * Ja'Net DuBois, 87, American actress (Good Times, I'm Gonna Git You Sucka, The PJs) and singer, Emmy winner (1999, 2001), cardiac arrest. * Henry Gray, 95, American Hall of Fame blues pianist and singer. * Terry Lineen, 84, New Zealand rugby player (Auckland, national team). * Mário da Graça Machungo, 79, Mozambican politician, Prime Minister (1986–1994).Morreu Mário Machungo, antigo primeiro- ministro de Moçambique * Kizito Mihigo, 38, Rwandan gospel singer-songwriter, musician and political activist, suspected suicide. * Charles Portis, 86, American writer (True Grit, Norwood, Gringos), problems caused from Alzheimer's disease. * Giorgi Shengelaia, 82, Georgian movie director (The Journey of a Young Composer) and screenwriter. * Andrew Weatherall, 56, British music producer (Screamadelica), disc jockey, and musician (The Sabres of Paradise, Two Lone Swordsmen), pulmonary embolism. * Ror Wolf, 87, German novelist and poet.Schriftsteller Ror Wolf gestorben * Mickey Wright, 85, American Hall of Fame golfer, AP Athlete of the Year (1963, 1964), heart attack. ===18=== * Kishori Ballal, 82, Indian actress (Gair Kaanooni, Ek Alag Mausam, Aakramana). * José Bonaparte, 91, Argentine paleontologist.El reconocido paleontólogo José Bonaparte falleció este martes * Flavio Bucci, 72, Italian actor (Suspiria, Last Stop on the Night Train, Il divo), heart attack.È morto Flavio Bucci * Jon Christensen, 76, Norwegian jazz drummer and composer.Jon Christensen er død * Linda P. Johnson, 74, American politician, member of the North Carolina House of Representatives (since 2001), stroke caused by cancer. * Peter Montgomery, 72, American mathematician. * Tapas Paul, 61, Indian actor (Dadar Kirti, Bhalobasa Bhalobasa, Mayabini) and politician, MLA (2001–2009) and MP (2009–2019), cardiac arrest. * Sonja Ziemann, 94, German actress (The Black Forest Girl, The Heath Is Green, The Bridge at Remagen).Schwarzwaldmädel-Star Sonja Ziemann ist tot * Bert Sutherland, 83, American computer scientist (Sun Microsystems, PARC, ARPANET).复制粘贴 UI 之父、Java 和互联网创建者相继离世 ===19=== * Pete Babando, 94, Canadian ice hockey player (Boston Bruins, Detroit Red Wings, Chicago Black Hawks), Stanley Cup champion (1950). * Beatriz Bonnet, 89, Argentine actress (Mansedumbre), problems caused by Alzheimer's disease.Murió la actriz Beatriz Bonnet: tenía 89 años * Heather Couper, 70, British astronomer and broadcaster (BBC, Channel 4), President of the British Astronomical Association (1984–1986). * Jean Daniel, 99, Algerian-born French journalist, founder of L'Obs.Morto a 99 anni Jean Daniel, il fondatore dell'Obs: \"Una lunga vita di passione, impegno e creazione\" * Wilfred De'ath, 82, British journalist (The Oldie). * Hector, 73, French singer.Mort d'Hector, le chanteur rebelle des années twist, à l'âge de 73 ans * Jos van Kemenade, 82, Dutch politician and sociologist, Minister of Education and Sciences (1973–1977, 1981–1982), Queen's Commissioner of North Holland (1992–2002) and Minister of State (since 2002).Oud-onderwijsminister Jos van Kemenade (82) overleden * Yervand Manaryan, 95, Iranian-born Armenian actor. * José Mojica Marins, 83, Brazilian movie director (\"Coffin Joe\", At Midnight I'll Take Your Soul), bronchopneumonia.Morre o cineasta José Mojica Marins, o Zé do Caixão * Jens Nygaard Knudsen, 78, Danish designer, inventor of the Lego minifigure, problems caused by ALS. * Jerry G. Melvin, 90, American politician, member of the Florida House of Representatives (1968–1971, 1973–1978, 1995–2005), heart failure. * Fernando Morán, 93, Spanish politician, Minister of Foreign Affairs (1982–1985), Ambassador to the United Nations (1985–1987) and MEP (1987–1999).Muere Fernando Morán, primer ministro de Exteriores de Felipe González * Germaine Poliakov, 101, Turkish-born French music teacher and Holocaust survivor.Avis de décès de Madame Germaine POLIAKOV née ROUSSO * Andrzej Popiel, 84, Polish actor (Smażalnia story, Na kłopoty Bednarski, Lokatorzy).Zmarł Andrzej Popiel, aktor Teatru Muzycznego * John Robertson, 90, Canadian Olympic sailor (1948, 1952). * Pop Smoke, 20, American rapper (\"Welcome to the Party\"), shot. ===20=== * Peter Dreher, 87, German painter.Maler Peter Dreher gestorben: Bilderserie „Tag um Tag guter Tag“ bekanntestes Werk * István Gáli, 76, Hungarian Olympic boxer (1968).Gyász: elhunyt az 1967-ben Eb-bronzot nyerő ökölvívó, Gáli István * Usman Ullah Khan, 45, Pakistani Olympic boxer (1996, 2000), cancer. * Jean-Claude Pecker, 96, French astronomer, Secretary-General of the International Astronomical Union (1964–1967) and President of the Société Astronomique (1973–1976).Disparition de Jean-Claude Pecker astrophysicien et professeur émérite au Collège de France ===21=== * Shlomo Aronson, 83, Israeli historian and political scientist.הלך לעולמו חוקר השואה שלמה אהרונסון * A.P. Indy, 31, American racehorse and sire. * Lal Khan, 63, Pakistani Marxist political theorist, Leader of The Struggle Pakistan (since 1980), cancer. * Boris Leskin, 97, Romanian-born Russian-American actor (Heavenly Swallows, Vampire's Kiss, Men in Black).Скончался советский и американский актёр Борис Лескин * Phil Maloney, 92, Canadian ice hockey player (Boston Bruins, Chicago Blackhawks) and coach (Vancouver Canucks). * Lisel Mueller, 96, German-born American poet, Pulitzer Prize winner (1997), problems caused from pneumonia. * Tao Porchon-Lynch, 101, American yoga master and author. ===22=== * Krishna Bose, 89, Indian social worker and politician, MP (1996–2004), problems caused from a stroke. * June Dally-Watkins, 92, Australian model, etiquette coach and businesswoman. * Kiki Dimoula, 88, Greek poet, member of the Academy of Athens (since 2002), European Prize for Literature awardee (2009), cardiac arrest caused by COPD and heart failure. * Jacques Houplain, 99, French painter and engraver.Décès du graveur Jacques Houplain, à Limoux * Mike Hughes, 64, American daredevil and flat Earth conspiracy theorist, rocket crash. * Jeff Kimpel, 77, American meteorologist. * Maryan Plakhetko, 74, Ukrainian footballer (SKA Lviv, CSKA Moscow, Soviet Union national team).Умер чемпион СССР по футболу Марьян Плахетко * B. Smith, 70, American restaurateur, model and television host, first African-American model to be featured in Mademoiselle magazine, problems caused from Alzheimer's disease. * Thích Quảng Độ, 91, Vietnamese Buddhist monk, patriarch of the Unified Buddhist Sangha of Vietnam (since 2008), problems caused from diabetes.HT Thích Quảng Độ ‘hiến dâng cả đời đấu tranh cho tự do tôn giáo’ * Linda Wolfe, 87, American journalist and author (Wasted: The Preppie Murder), problems caused from surgery. ===23=== * Ramón Conde, 85, Puerto Rican baseball player (Chicago White Sox).Muere el beisbolista Ramón \"Wito\" Conde * János Göröcs, 80, Hungarian footballer (Újpest, Tatabánya, national team) and manager.Meghalt Göröcs János * Zoran Modli, 71, Serbian journalist, radio disc jockey (Modulacije) and aviator.Preminuo Zoran Modli * Chitetsu Watanabe, 112, Japanese supercentenarian, world's oldest living man (since 2019).男性世界最高齢の渡邉智哲さん死去 今月12日にギネス記録認定 112歳 ===24=== * Bob Andelman, 59, American journalist, author and talk show host, cancer. * Diana Serra Cary, 101, American actress (Little Red Riding Hood, The Darling of New York, Captain January). * Ben Cooper, 86, American actor (Johnny Guitar, Gunfight at Comanche Creek, Rebel in Town), problems caused from dementia. * István Csukás, 83, Hungarian poet and author.Meghalt Csukás István * Clive Cussler, 88, American adventure novelist (Raise the Titanic!, Sahara) and underwater explorer, founder of the NUMA. * John Franzese, 103, Italian-born American mobster (Colombo crime family) and movie producer (Deep Throat, The Texas Chain Saw Massacre). * Katherine Johnson, 101, American NASA mathematician, depicted in Hidden Figures. * Jan Kowalczyk, 78, Polish show jumper, Olympic champion (1980).Nie żyje Jan Kowalczyk, mistrz olimpijski z Moskwy * Roy Norris, 72, American serial killer. * David Roback, 61, American guitarist (Mazzy Star, Rain Parade, Opal) and songwriter, cancer. * Jahn Teigen, 70, Norwegian musician (Popol Ace).Jahn Teigen er død * Olof Thunberg, 94, Swedish actor (Winter Light , Bamse, Amorosa).Skådespelaren Olof Thunberg är död ===25=== * Javier Arias Stella, 95, Peruvian pathologist and politician, Minister of Health (1963–1965, 1967–1968) and Foreign Affairs (1980–1983) and President of the United Nations Security Council (1984–1985), discovered the Arias-Stella reaction.Fallece excanciller Javier Arias Stella * Lee Phillip Bell, 91, American television producer (The Bold and the Beautiful, The Young and the Restless). * Mario Bunge, 100, Argentine philosopher of science.Murió el científico argentino Mario Bunge * Bruce George, 77, British politician, MP (1974–2010), problems caused from Alzheimer's disease. * Nexhmije Hoxha, 99, Albanian politician, MP (1948–1985) and Chairwoman of the Democratic Front (1985–1990). * Naimatullah Khan, 89, Pakistani politician, Mayor of Karachi (2001–2005). * Adam Maher, 47, Australian rugby league player (Cronulla Sharks, Gateshead Thunder, Hull F.C.), motor neurone disease. * Hosni Mubarak, 91, Egyptian military officer and politician, Vice-President (1975–1981), Prime Minister (1981–1982) and President (1981–2011), problems caused from surgery. * Erico Spinadel, 90, Austrian-Argentine industrial engineer.Fallece, a los 90 años, Erico Spinadel, pionero de la energía eólica * Dmitry Yazov, 95, Russian military officer, Minister of Defence (1987–1991) and Marshal of the Soviet Union (1990). ===26=== * Sam Boghosian, 88, American football player (UCLA Bruins) and coach (Oregon State Beavers, Los Angeles Raiders). * Betsy Byars, 91, American children's writer (Summer of the Swans), Newbery Medalist (1971), problems caused from a fall. * Michel Leplay, 92, French Protestant pastor.Le pasteur Michel Leplay, une belle vie * Michael Medwin, 96, English actor (Shoestring, Scrooge, The Army Game). * Kostas Voutsas, 88, Greek actor (Law 4000, Alice in the Navy, The Downfall) and writer, lung infection. ===27=== * R. D. Call, 70, American actor (Golden Years, Into the Wild, EZ Streets), problems caused from back surgery. * Sudhakar Chaturvedi, 122, Indian Vedic scholar and longevity claimant. * Valdir Espinosa, 72, Brazilian football manager (Cerro Porteño, Botafogo, Corinthians), problems caused from surgery.Técnico Valdir Espinosa morre aos 72 anos * Samvel Karapetyan, 58, Armenian historian and researcher. * Hadi Khosroshahi, 81, Iranian cleric and politician, Ambassador to the Vatican (1981), COVID-19. * Leroy Suddath, 89, American Army major general. * Braian Toledo, 26, Argentine javelin thrower, Youth Olympic champion (2010), motorcycle crash. * Suthep Wongkamhaeng, 85, Thai Luk krung singer, problems caused from a blood infection.Crooner Suthep Wongkamhaeng dies at 86 ===28=== * Johnny Antonelli, 89, American baseball player (Boston/Milwaukee Braves, New York/San Francisco Giants, Cleveland Indians) and businessman, cancer. * Jaime Carbonell, 66, Uruguayan-born American computer scientist. * Janusz Cisek, 65, Polish historian and academic, Executive Director of the Józef Piłsudski Institute of America (1992–2000), leukemia.Zmarł profesor doktor habilitowany Janusz Cisek, znany historyk pochodzący ze Stalowej Woli. Przegrał walkę z chorobą * Joe Coulombe, 89, American entrepreneur (Trader Joe's). * Burkhard Driest, 80, German actor (Stroszek, Cross of Iron, Querelle).Burkhard Driest ist nach Langer Krankheit gestorben * Freeman Dyson, 96, British-born American physicist and mathematician (Dyson's transform, Rank of a partition, Dyson series), problems caused from a fall. * Sir Lenox Hewitt, 102, Australian politician, Secretary of the Prime Minister's Department (1968–1971), problems caused by Lewy body dementia. * Balbir Singh Kullar, 77, Indian field hockey player, Olympic bronze medallist (1968), heart attack. ===29=== * Nicholas Alahverdian, 32, Child welfare activist, political scientist, and whistleblower, non-Hodgkin lymphoma. * Bill Bunten, 89, American politician, member of the Kansas House of Representatives (1962–1990) and Senate (2002–2004), Mayor of Topeka (2005–2013), problems caused from pneumonia. * Raymond C. Fisher, 80, American politician and lawyer, U.S. Associate Attorney General (1997–1998) and Judge of the Court of Appeals for the Ninth Circuit (since 1999), cancer. * Éva Székely, 92, Hungarian Hall of Fame swimmer, Olympic champion (1952).Elhunyt Székely Éva olimpiai bajnok úszó ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths from the COVID-19 pandemic ==References== ==Other websites== * The Guardian, UK obituaries * The Telegraph obituaries * Obituaries, Chicago Tribune * Obituaries, Los Angeles Times * The New York Times, US obituaries * The Washington Post obituaries * The Sydney Morning Herald, Australian obituaries *02 Deaths",
 "title": "Deaths in February 2020"
}