{
 "id": "73378",
 "text": "The Irish War of Independence was fought by the Irish Republican Army (IRA) against the British soldiers (known as the Black and Tans because of the colour of their uniform) who were trying to keep Ireland under British control. The war was fought between 1919 and June 1921. The fighting stopped while a peace treaty was worked out. == Events == The Irish War of Independence began because of the 1916 Easter Rising. During this rebellion, The Irish Republican Brotherhood (IRB) fought British soldiers in Dublin. The IRB wanted Ireland to be its own country and wanted Britain to move its army out of Ireland. IRB members were killed during the rebellion, including 3 who were executed. These executions angered the Irish people, leading many of them to become Republicans. Republicans lived mostly in the south of Ireland. Meanwhile, because of the Ulster Plantations, Ulster was the most unionist part of Ireland. The Unionists wanted to stay under control of the British Government. In 1917 the IRB was renamed the IRA. The fighting started two years later. By the end of 1919, the IRA had defeated the Royal Irish Constabulary (RIC), the armed police of the United Kingdom in Ireland, and Ireland had no police forces. In London, the British government began to debate who should rule Ireland. == Peace treaty == The war waged on until 1921, when Irish Sinn Féin leaders and British Members of Parliament made a peace treaty (called the Anglo-Irish Treaty). This treaty created the Irish Free State, which meant that Ireland was given Dominion Status. The treaty gave all the same rights to the Irish government as the Canadian and Australian governments had. The treaty also gave the Irish Government power of 26 of the 32 counties in the country. The British Government kept the other 6 counties, which were all in Ulster, and formed Northern Ireland. ==Related pages== * History of Ireland *Irish Republican Army Category:20th century in Ireland Category:Wars involving the United Kingdom Category:Irish War of Independence Category:Rebellions in Europe Category:20th-century rebellions Category:1919 in the United Kingdom Category:1920 in the United Kingdom Category:1921 in the United Kingdom",
 "title": "Irish War of Independence"
}