{
 "id": "733936",
 "text": "The Amstetten District is a district in the state of Lower Austria in Austria. == Municipalities == Suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. *Allhartsberg **Angerholz, Kröllendorf, Kühberg, Maierhofen, Wallmersdorf *Amstetten **Edla, Greinsfurth, Hausmening, Mauer bei Amstetten, Neufurth, Preinsbach, Schönbichl, Ulmerfeld *Ardagger **Ardagger Markt, Ardagger Stift, Kollmitzberg, Stephanshart *Aschbach-Markt **Abetzberg, Aschbach-Dorf, Krenstetten, Mitterhausleiten, Oberaschbach *Behamberg **Badhof, Penz, Ramingdorf, Wanzenöd *Biberbach *Ennsdorf *Ernsthofen **Aigenfließen, Rubring *Ertl *Euratsfeld **Aigen, Gafring *Ferschnitz **Innerochsenbach *Haag **Edelhof, Gstetten, Heimberg, Holzleiten, Knillhof, Krottendorf, Porstenberg, Radhof, Reichhub, Salaberg, Schudutz *Haidershofen **Brunnhof, Dorf an der Enns, Sträußl, Tröstlberg, Vestenthal *Hollenstein an der Ybbs **Berg, Dornleiten, Garnberg, Grießau, Hohenlehen, Krengraben, Oberkirchen, Oisberg, Sattel, Thalbauer, Thomasberg, Walcherbauer, Wenten *Kematen an der Ybbs *Neuhofen an der Ybbs **Amesleithen, Kornberg, Neuhofen an der Ybbs, Perbersdorf, Scherbling, Schindau, Toberstetten *Neustadtl an der Donau **Berghof, Freyenstein, Hößgang, Kleinwolfstein, Nabegg, Neustadtl-Markt, Neustadtl-Umgebung, Schaltberg, Windpassing *Oed- Öhling **Oed, Öhling *Opponitz **Graben, Gstadt, Hauslehen, Ofenberg, Schwarzenbach, Strubb, Thann *Seitenstetten **Seitenstetten Dorf, Seitenstetten Markt *Sonntagberg **Baichberg, Böhlerwerk, Bruckbach, Gleiß, Hilm, Rosenau am Sonntagberg, Rotte Wühr, Sonntagberg *Sankt Georgen am Reith **Hochau, Kogelsbach, Königsbergau, St. Georgen am Reith *Sankt Georgen am Ybbsfelde **Hart, Hermannsdorf, Krahof, Leutzmannsdorf, Matzendorf, St. Georgen am Ybbsfelde *Sankt Pantaleon-Erla **Erla, St. Pantaleon *Sankt Peter in der Au **Hohenreith, Kürnberg, St. Johann in Engstetten, St. Michael am Bruckbach, St. Peter in der Au-Dorf, St. Peter in der Au-Markt *Sankt Valentin **Altenhofen, Endholz, Hofkirchen, Rems, St. Valentin, Thurnsdorf *Strengberg **Au, Limbach, Ottendorf, Ramsau, Strengberg, Thürnbuch *Viehdorf **Hainstetten, Seisenegg, Viehdorf *Wallsee-Sindelburg **Igelschwang, Ried, Schweinberg, Wallsee *Weistrach **Grub, Hartlmühl, Holzschachen, Rohrbach, Schwaig, Weistrach *Winklarn **Haag Dorf, Winklarn *Wolfsbach **Bubendorf, Meilersdorf, Wolfsbach *Ybbsitz **Großprolling, Haselgraben, Hubberg, Kleinprolling, Knieberg, Maisberg, Prochenberg, Schwarzenberg, Schwarzois, Ybbsitz, Zogelsgraben *Zeillern Category:Districts of Lower Austria",
 "title": "Amstetten District"
}