{
 "id": "733905",
 "text": "Noah Takes a Photo of Himself Every Day for 6 Years (as it is called on YouTube), or Everyday (as it is called on the title card), is a viral video made by Noah Kalina, a photographer from New York. Thousands of pictures of himself he took over six years are shown fast in time order. ==Video== Noah started to take a photo of himself every day on January 11, 2000, when he was 19 years old. The video shows the photos in time order, six per second, with original music played on piano by his ex-girlfriend Carly Comando. In each photo, his face is in the center of the frame, and shows no emotion. He uploaded the video to Vimeo on August 8, 2006, and on YouTube on August 27, 2006. Everyday was shown on an episode of VH1's Web Junk 20, and on commercials for Time Warner Cable's Roadrunner service. In a New York Times article, it was said William A. Ewing, director of the Musée de l'Élysée, said \"Noah’s video represents a phenomenal amplification not just in what he produced and how he did it, but how many people the piece touched in such a short period of time. There is nothing comparable in the history of photography.\" , Everyday had more than 26.4 million views on YouTube. Noah originally wanted Everyday to be a photo project, but wanted to make a film instead after seeing a video by Ahree Lee, which did the same thing, but for three years. He put his photographs into a video and released it on YouTube. In December 2006, because Everyday was so popular, VH1 asked Noah to take photographs of himself in the same pose as he did in Everyday, but with some celebrities, including Paris Hilton, Lance Bass, David Hasselhoff, Jenna Jameson, will.i.am, Flavor Flav, lonelygirl15 and \"Weird Al\" Yankovic. The photographs were taken backstage at the VH1 Big in '06 Awards. In the ceremony, which was shown on television, several of the pictures were shown before and after commercial breaks. Kalina also posted the photographs on Flickr. On July 16, 2012, Noah announced an longer version of the video, called \"Noah takes a photo of himself every day for 12.5 years\", on his website. The video, which came out on YouTube on September 4, 2012, shows 12 years and 5 months of his photographs of himself over 7 minutes and 34 seconds (10 frames per second, or 1 month every 3 seconds). On January 14, 2020, Noah released \"Noah takes a photo of himself every day for 20 years\" on YouTube. This video shows 20 years of his photographs of himself over 8 minutes and 17 seconds (15 frames per second, or 1 month every 2 seconds). ==Noah Kalina== Noah, who was born on July 4, 1980, lives in Williamsburg, Brooklyn, New York. He grew up in Centerport, New York, and went to Harborfields High School. He graduated from the School of Visual Arts. ==In popular culture== The Simpsons episode \"Eternal Moonshine of the Simpson Mind\" includes a parody of the video, in which all 39 years of Homer Simpson's life are shown in the same way. Family Guy also has a parody of the video, in which Peter Griffin takes a picture of himself every day for one year in the same way, except the song \"Hey There Delilah\" by the Plain White T's is used. The National Basketball Association used the song in \"Where Amazing Happens\", an advertising campaign that happened from 2007 to 2008. ==References== ==Other websites== * * Noah Kalina's official homepage on the Everyday Project Category:2006 movies Category:2012 movies Category:2020 movies",
 "title": "Everyday (video)"
}