{
 "id": "734051",
 "text": "Screen One is a British television anthology drama series, produced by BBC Studios and distributed by BBC Worldwide. It was shown on BBC1 between 1991 and 1998. Sixty films were made over six series. Some were shown as stand- alone specials. The BBC's Play for Today ran from 1970 to 1984. After it ended, Kenneth Trodd was asked to make a new series of one-off television dramas. These became Screen Two. They were shown on BBC2 in 1985. Play for Today had often been a studio-based form of theatre on television. Screen Two was shot entirely on film. In 1989, the series was adapted for more mainstream audiences on BBC1 as Screen One. It followed the lead taken by Channel 4, whose television films had later been released in Cinemas. Screen One had actors familiar to television and film audiences, including Alfred Molina, Sean Bean, David Thewlis, Ray Winstone, Alan Bates, Judi Dench, James Fox, Keith Allen, Bob Peck, Alun Armstrong, Marina Sirtis, David Jason, Brenda Blethyn, James Bolam, Adrian Edmondson, Alison Steadman, Timothy West, Clive Russell and Janet McTeer. Several actors also made their on-screen debuts during the series, including Keira Knightley in the fifth series episode Royal Celebration. In 1993, the BBC moved away from single dramas to make series and serials. In 1994, Screen One was a six-episode series. This was the last full- length series of Screen One. Eight one-off specials followed. The last one was shown on 15 February 1998. ==Transmissions== ==Episodes== ===Series 1 (1991)=== Episode Title Written by Directed by Original airdate ===Series 2 (1992—1993)=== Episode Title Written by Directed by Original airdate ===Series 3 (1994—1995)=== Episode Title Written by Directed by Original airdate ===Series 4 (1995)=== Episode Title Written by Directed by Original airdate ===Series 5 (1995-1996)=== Episode Title Written by Directed by Original airdate ===Series 6 (1996)=== Episode Title Written by Directed by Original airdate ===Specials (1997—1998)=== Episode Title Written by Directed by Original airdate ==References== ==Other websites== * * * * Category:1980s British drama television series Category:1989 television series debuts Category:1990s British drama television series Category:English-language television programs Category:1998 British television series endings Category:BBC television dramas",
 "title": "Screen One"
}