{
 "id": "734189",
 "text": "The Gmünd District is a district in the state of Lower Austria in Austria. It is in the northwestern region of Waldviertel. == Municipalities == Towns are indicated in boldface; market towns in italics; suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. *Amaliendorf-Aalfang **Aalfang, Amaliendorf, Falkendorf *Bad Großpertholz **Abschlag, Angelbach, Bad Großpertholz, Hirschenstein, Karlstift, Mühlbach, Reichenau am Freiwald, Scheiben, Seifritz, Steinbach, Watzmanns, Weikertschlag *Brand-Nagelberg **Alt-Nagelberg, Brand, Finsternau, Neu-Nagelberg, Steinbach *Eggern **Eggern, Reinberg-Heidenreichstein, Reinberg-Litschau *Eisgarn **Eisgarn, Groß-Radischen, Klein-Radischen, Wielings *Gmünd **Breitensee, Eibenstein, Gmünd, Grillenstein *Großdietmanns **Dietmanns, Ehrendorf, Eichberg, Höhenberg, Hörmanns bei Weitra, Reinpolz, Unterlembach, Wielands *Großschönau **Engelstein, Friedreichs, Großotten, Großschönau, Harmannstein, Hirschenhof, Mistelbach, Rothfarn, Schroffen, Thaures, Wachtberg, Wörnharts, Zweres *Haugschlag **Griesbach, Haugschlag, Rottal, Türnau *Heidenreichstein **Altmanns, Dietweis, Eberweis, Guttenbrunn, Haslau, Heidenreichstein, Kleinpertholz, Motten, Seyfrieds, Thaures, Wielandsberg, Wolfsegg *Hirschbach **Hirschbach, Stölzles *Hoheneich **Hoheneich, Nondorf *Kirchberg am Walde **Fromberg, Hollenstein, Kirchberg am Walde, Süßenbach, Ullrichs, Weißenalbern *Litschau **Gopprechts, Hörmanns bei Litschau, Josefsthal, Litschau, Loimanns, Reichenbach, Reitzenschlag, Saaß, Schandachen, Schlag, Schönau bei Litschau *Moorbad Harbach **Harbach, Hirschenwies, Lauterbach, Maißen, Schwarzau, Wultschau *Reingers **Grametten, Hirschenschlag, Illmanns, Leopoldsdorf, Reingers *Schrems **Anderlfabrik, Ehrenhöbarten, Gebharts, Kiensaß, Kleedorf, Kottinghörmanns, Kurzschwarza, Langegg, Langschwarza, Neulangegg, Neuniederschrems, Niederschrems, Pürbach, Schrems *St. Martin **Anger, Breitenberg, Harmanschlag, Joachimstal, Langfeld, Maißen, Oberlainsitz, Reitgraben, Rörndlwies, Roßbruck, Schöllbüchl, Schützenberg, St. Martin, Zeil *Unserfrau-Altweitra **Altweitra, Heinrichs bei Weitra, Ober-Lembach, Pyhrabruck, Schagges, Ulrichs, Unserfrau *Waldenstein **Albrechts, Groß- Höbarten, Groß-Neusiedl, Grünbach, Klein-Ruprechts, Waldenstein, Zehenthöf *Weitra **Großwolfgers, Oberbrühl, Oberwindhag, Reinprechts, Spital, St. Wolfgang, Sulz, Tiefenbach, Unterbrühl, Walterschlag, Weitra, Wetzles Category:Districts of Lower Austria",
 "title": "Gmünd District"
}