{
 "id": "734349",
 "text": "James BondStockdale's given names--\"James Bond\"--are unrelated to James Bond, the hero of Ian Fleming's spy novels. Fleming had never heard of Stockdale when he coined the name long after the latter's birth (). Stockdale (December 23, 1923 – July 5, 2005) was a United States Navy vice admiral and aviator. He was awarded the Medal of Honor in the Vietnam War, during which he was a prisoner of war for over seven years. He was President of the Naval War College from October 1977 until, he retired from the Navy in 1979. As Vice Admiral, Stockdale became the President for The Citadel, The Military College of South Carolina. Stockdale held this position from 1979 to 1980. Stockdale was a candidate for Vice President of the United States in the 1992 presidential election, on Ross Perot's independent ticket. ==Writings by James Stockdale== ; Books *Taiwan and the Sino-Soviet Dispute, Stanford, California, 1962. *The Ethics of Citizenship, University of Texas at Dallas, 1981, Andrew R. Cecil lectures on moral values in a free society featured Stockdale and other speakers. *James Bond Stockdale Speaks on the \"Melting Experience: Grow or Die\", Hoover Institution, Stanford, 1981 speech to the graduating class of John Carroll University in Cleveland, Ohio. *A Vietnam Experience: Ten Years of Reflection, Hoover Institution, Stanford, 1984, . *In Love and War: The Story of a Family's Ordeal and Sacrifice During the Vietnam Years **1984 Original, Harper & Row, New York, . **1990 Reprint, Naval Institute Press, Annapolis, Maryland, . *Courage Under Fire: Testing Epictetus's Doctrines in a Laboratory of Human Behavior , Hoover Institution, Stanford, 1993, . *Thoughts of a Philosophical Fighter Pilot, Hoover Institution, Stanford, 1995 . ; Other writings *Stockdale on Stoicism I: The Stoic Warrior's Triad *Stockdale on Stoicism II: Master of My Fate ==References== Category:1923 births Category:2005 deaths Category:Deaths from Alzheimer's disease Category:Disease-related deaths in California Category:American military personnel of the Vietnam War Category:Independent politicians in the United States Category:Writers from Illinois Category:Politicians from Illinois Category:Military people from Illinois",
 "title": "James Stockdale"
}