{
 "id": "734331",
 "text": "Blanche Lambert Lincoln (born Blanche Meyers Lambert on September 30, 1960) is an American politician and lawyer. She was a U.S. Senator from Arkansas from 1999 to 2011. She was a member of the Democratic Party. She was the first woman elected to the Senate from Arkansas and, at aged 38, was the youngest woman ever elected to the Senate. She was in the U.S. House of Representatives, representing from 1993 to 1997. ==Early life, education and private career== Blanche Lambert was born in Helena, Arkansas. She is the daughter of Martha (née Kelly) and Jordan Bennett Lambert. Her father was a rice and cotton farmer. Her older sister, Mary Lambert, is a film director. Lincoln went to the University of Arkansas in Fayetteville. She was a member of the Chi Omega sorority while she went there. She graduated from Randolph- Macon Woman's College (now known as Randolph College) in Lynchburg, Virginia, in 1982. She earned a Bachelor's degree in biology. She originally wanted to go into nursing. After graduating from college, Lincoln was an assistant for U.S. Representative Bill Alexander, a Democrat from . She worked for him until 1984. She married her husband Steve Lincoln in 1994. Lincoln is a distant relative of former President of the United States Abraham Lincoln. ==U.S. House of Representatives== In 1992, Lincoln defeated Bill Alexander in the Democratic primary, by a margin of 60 to 40 percent. She then won the general election, beating Republican Terry Hayes with 70% of the vote. Her election to the House of Representatives happened at the same time as the election of Bill Clinton, who was also from Arkansas, as President of the United States. She called herself a centrist Democrat and was part of the minority of Democrats who support CAFTA. She was reelected to a second term under her married name, Blanche Lincoln, and served in the House of Representatives until 1997. Lincoln chose not to run for reelection in 1996. She was pregnant at that time. ==U.S. Senate== === First term === In the 1998 Senate election, Lincoln returned to politics. She ran for the Senate seat being vacated by incumbent Senator Dale Bumpers. She defeated her Republican opponent, Fay Boozman, a state senator and the brother of future U.S. Representative John Boozman, 55 percent to 42 percent. === Second term === In the 2004 election, Lincoln was re-elected, defeating Republican state Senator Jim Holt (R-Springdale) by 56 percent to 44 percent. In March 2007, Lincoln called for Attorney General Alberto Gonzales to resign. Gonzales resigned in August 2007. In September 2009, Lincoln pledged to filibuster any legislation that had a Public health insurance option, such as the Affordable Health Care for America Act (the Democratic-controlled, House of Representatives' preferred health care reform bill). In November 2009, Lincoln voted against bringing Guantanamo Bay prisoners to the United States for trial. On December 9, 2010, Lincoln missed a vote to repeal Don't ask, don't tell by three minutes. She missed it because of an appointment at the dentist. A supporter of the bill, She said that she would have voted for repeal had she made it to the vote. On December 18, she voted for the bill. === 2010 re-election campaign === With the Obama administration having become very unpopular in her home state, Lincoln's strategy to be re-elected in the 2010 election was to make herself look independent of the Democrats. After defeating the state's then-Lieutenant Governor Bill Halter with an early endorsement from former President and Governor of Arkansas Bill Clinton, Lincoln lost in November to Republican congressman John Boozman by 58 percent to 37 percent. === Caucuses and committees === In 2004, Lincoln co-founded the Senate Hunger Caucus. The caucus was established to provide a bipartisan forum for Senators to work on national and international hunger and food insecurity issues. ==After Congress== In July 2013, Lincoln made her own political consulting firm called Lincoln Policy Group. As of November 2020, Lincoln is an advisor to the RATE Coalition (Reforming America’s Taxes Equitably), which has lobbied for competitive corporate tax rates during the Biden administration. ==References== Category:1960 births Category:Living people Category:Lawyers from Arkansas Category:Businesspeople from Arkansas Category:United States senators from Arkansas Category:United States representatives from Arkansas Category:Democratic Party (United States) politicians",
 "title": "Blanche Lincoln"
}