{
 "id": "734722",
 "text": "Incendiary is a 2008 British drama film. It is about what happens after a terrorist attack at a football match. It is directed by Sharon Maguire. It stars Michelle Williams, Ewan McGregor, and Matthew Macfadyen. It is about a suicide bombing at the Emirates Stadium during an Arsenal F.C. match, and about the life of a woman who loses her husband and young son in the attack. It is based on the 2005 novel Incendiary by Chris Cleave. ==Plot== A young East Ender woman, played by Michelle Williams, is married to bomb-disposal officer Lenny, played by Nicholas Gleaves. They have a four-year-old son, played by Sidney Johnston. The young mother is having an affair with a reporter called Jasper, palyed by Ewan McGregor. Lenny, their son, and about 1000 others are killed in a terrorist attack carried out by six suicide bombers at a football match. Terrence Butcher, played by Matthew Macfadyen, is in charge of the anti-terrorist division. Jasper and Terrence try to comfort the mother. Both are also romantically interested in her. Through Jasper's investigation into the bombing, the mother discovers the identity of one of the terrorists. She befriends his teenage son, played by Usman Khokhar. He only knows that his father is missing since the attacks. When he finds out what his father did, he panics and runs. This causes the police to suspect him to be a terrorist. When he tries to take something out of his pocket they think he has a gun or wants to trigger a bomb. They shoot at him, but he is unarmed. The mother, who tried to protect him, is wounded, but not severely. Later, the terrorist's wife and son apologize to the mother for his part in the killings. Terrence confesses to the mother that he knew that a suicide attack was going to happen and could have stopped it. He did not stop it so that he was able to continue his investigation of the terrorist group. He says that he did not know in which stadium it would happen, and also thought it would be of a smaller scale. Although he knew Lenny and his son would be going, he did not warn them. Sometimes the mother is confused, thinking that nothing has happened to her son. Throughout the film, she writes a letter addressed to Osama bin Laden. He is assumed to be responsible for the attack. == Cast == * Michelle Williams – Young Mother * Ewan McGregor – Jasper Black * Matthew Macfadyen – Terrence Butcher * Nicholas Gleaves – Lenny * Sidney Johnston – The Boy * Usman Khokhar – The Bomber's Son * Sasha Behar – Mrs. Ghorbani, the Bomber's Wife * Ed Hughes – Danny Walsh (as Edward Hughes) * Alibe Parsons – Pearl * Stewart Wright – Charlie * Al Hunter Ashton – Male Survivor * Benjamin Wilkin – Young Policeman * Robin Berry – Dazed Supporter * Mercy Ojelade – Nurse Mena * Joe Marshall – Gary / VT Man == Production== Filming began on 26 March 2007 in London, England. Scenes were filmed on location in Northampton Square and the Brunswick Estate in Islington, North London. Filming also took place at Leyton Orient's Brisbane Road stadium and around St Albans Cathedral, St Albans School, and Westminster Lodge. The production also visited The Metropolitan Training College facilities near Gravesend to shoot the scenes at the football stadium, after the bomb has exploded. == Reception == The film received poor reviews. Tom Charity, after viewing the film at the 2008 Sundance Film Festival, gave it one star out of five. He called it an \"ambitious/opportunistic effort that misses the mark, from the one-dimensional characters to the craven plotting and sentimental tone.\"Review of Incendiary , a January 2008 article from The Times of London Philip French called it an \"ambitious British picture on an urgent topical subject [that] is torpedoed by a poor script.\"Review of Incendiary, an October 2008 article from The Observer Time Out gave it two stars out of six. It wrote \"there are so many things wrong with writer-director Sharon Maguire’s first film since Bridget Jones's Diary in 2001 that it's hard to know where to start, but the fatal problem is that this is a film with an identity crisis\"; the film at times seems like a \"study of guilt and grief\" and at other times a \"conspiracy thriller\" but \"ends up being a compendium of bizarre diversions, most of which are utterly surplus to the film’s half-cocked desire to stick with the experience and emotions of its main character.\"Review of Incendiary, an October 2008 article from Time Out London ==References== ==Other websites== * * Category:English-language movies Category:Movies about terrorism Category:2008 drama movies Category:British drama movies Category:Movies set in London",
 "title": "Incendiary (movie)"
}