{
 "id": "735033",
 "text": "Collectivism is a kind of ethics based on people being a group. Its opposite is individualism which is based on people being individuals. Collectivists focus on what's good for a whole group. Individualists focus on what's good for each person. Collectivism and individualism are and are also part of politics. The word \"individualism\" was originally used by socialists to attack their enemies. They said that individualists were selfish for not supporting socialism. Instead, individualists support people being independent and chasing their own goals. They also believe in having lots of freedoms. Collectivists believe that one person is not as important as a group of many people. They often believe people should compromise to make things better for each other instead of just themselves. They also think that letting someone do whatever they want is not good if it hurts lots of other people. Collectivism has many different types. It can mean serving your community, your government, your social class, your race, or some other group. == Research == *In 1930 Max Weber compared two ways of thinking in religion: one where people focus on themselves (individualism) and the other where they focus on being part of a group (collectivism). Weber thought that Protestants were more independent, while Catholics were more into having a structured community. *Ferdinand Tönnies talked about collectivism and individualism using concepts such as Gemeinschaft (community) and Gesellschaft (society). He used these words to describe two types of relationships: one where people care a lot about their community, especially in small villages, and another where people are more focused on society as a whole. An anthropologist named Redfield also talked about this idea in 1941 when comparing village life to city life. *In 1980 Geert Hofstede became influencial in cultural comparision. According to him, collectivism and individualism are two ends of a spectrum, where someone leaning more towards collectivism cares more about the goals of their social group rather than their individual goals. == References == Category:Ethics Category:Political philosophy Category:Philosophical movements and positions Category:Communism Category:Fascism Category:Nationalism Category:Socialism",
 "title": "Collectivism"
}