{
 "id": "7353",
 "text": "A nickname is a word used to substitute for a person's birth name. The term comes from the Middle English word ekename, which means “also-name.\" Nicknames are not legal names. They are often given by friends or family members. == Types == There are many types of nicknames. Below are a few examples. === Shortened names === Some nicknames are shortened or different versions of a birth name. For example: * U.S. President James Earl Carter called himself Jimmy Carter, even as president * Baseball player Alex Rodriguez is nicknamed \"A-Rod,\" a contraction of his name * English writer John Ronald Reuel Tolkien went by J.R.R. Tolkien * Famous actor Alfredo James Pacino uses the name Al Pacino === Affectionate names === Some nicknames are affectionate or given to honor a person. For example: * Honest Abe for U.S. President Abraham Lincoln * The Bard for Shakespeare * El Libertador (The Liberator) for Simon Bolivar Affectionate nicknames are common in sports. For example: * Pele was nicknamed O Rei (The King) because he was one of the greatest players in the history of football * Michael Jordan was nicknamed Air Jordan to point out how high he could jump * Nolan Ryan (a baseball pitcher who threw extremely fast) was nicknamed The Express to highlight his pitching speed === Descriptive names === Some nicknames are descriptions. For example: * Red for someone who has red hair * Doc for a doctor * Shorty for a short person Using descriptive nicknames is more accepted in some cultures than others. In Thailand, people are often given nicknames based on how they look. For example, someone can be called ผู้ชายสูง (phuchay sung), which means being tall. In some Spanish- speaking countries, calling a child or partner Gordo/a or Gordito/a is an accepted way to express affection. === Unkind names === Nicknames can be unkind, mocking, and/or bullying. For example: * Fatso, Loser, or Four Eyes are common childhood insults * Kamala Harris has been called Comrade Kamala to compare her policies to communism * President Martin van Buren's critics called him Martin van Ruin because the economy was failing === Place names === Places can have nicknames too. For example: * The Windy City for Chicago, Illinois *Sin City for Las Vegas, Nevada *Southie for South Boston, Massachusetts Sometimes people or groups get nicknames based on where they live. For example, people from the northern United States (or, overseas, people from anywhere in the United States) are sometimes called Yankees. Nicknames can also be given to tribes. For example, the Dhulbahante tribe are often called reer Darawiish because the former anti-colonial Dervish state was a Dhulbahante state.Duplantis, Andie. \"Shared Perspectives of Divided Space: Perceptions of the Urban Environment among Jerusalemites.\" (2016). === Political nicknames === * Haitian dictator Francois Duvalier called himself Papa Doc; his son Jean-Claude, who succeeded him, was Baby Doc * U.K. Prime Minister Margaret Thatcher was nicknamed The Iron Lady for her strong leadership * Uncle Sam is a nickname for the United States government * Ratko Mladić, a Bosnian Serb general, was called The Butcher of Bosnia because he participated in the Bosnian genocide ==References== Category:Names",
 "title": "Nickname"
}