{
 "id": "73545",
 "text": "The Powerpuff Girls is an American comedy-action satirical adventure superhero children's animated television series. It aired on Cartoon Network from 1998 to 2005. It is about three superheroes named Blossom, Bubbles, and Buttercup who live in Townsville, USA, nicknamed “The Powerpuff Girls”. The Powerpuff Girls are kindergarteners with certain superpowers, and use their powers to save the world from villains. The show is based on a short made by the series creator from 1992 originally called Whoopass Stew. The original show was created by Craig McCracken, and the 2016 revival series was developed by Nick Jennings and Bob Boyle. It was created and produced by Hanna-Barbera and Cartoon Network Studios, who also developed a theatrical film adaption in 2002 titled The Powerpuff Girls Movie by Warner Bros. Pictures. == Story == A lonely scientist named Professor Utonium one day decided to create a \"perfect daughter\" using sugar, spice and everything nice. However, a special potion named Chemical X was accidentally added to the pot, creating the three Powerpuff Girls, who had superpowers and have dedicated their lives to fighting crime and evil in Townsville. == Characters == Blossom, Bubbles, and Buttercup are 3 kindergarten superheroes who live with their father, Professor Utonium, in the City of Townsville. It is their job to use their powers to reduce crime and defend the town from evil villains who want to take it over while also partaking in normal activities like chores and going to school. ===The Powerpuff Girls=== *Blossom - the pink Powerpuff girl and the leader with a pink dress with a black belt, long white tights and black shoes. *Bubbles - the light blue Powerpuff girl and the cutest with a light blue dress with a black belt in the middle, long white tights and black shoes. *Buttercup - the lime green Powerpuff girl and the strongest with a lime green dress with a black belt down the middle, long white tights and black Mary Jane shoes. ===Villains=== === The Rowdyruff Boys === The Rowdyruff Boys are the Powerpuff Girls' evil male counterparts, created by Mojo Jojo using a mixture of \"snips, snails, a puppy dog tail\", and radioactive toilet water, and possess the same powers as them. They are destroyed when the girls kiss them, but are later resurrected by HIM. However, the group is formed by Brick, Boomer and Butch. * Brick (voiced by Rob Paulsen): Blossom's male counterpart and the Rowdyruff Boys' self-proclaimed leader. His short temper and rashness often causes conflict with his brothers. His signature is red, and he wears a backwards red baseball cap compared to Blossom's bow. * Boomer (voiced by Rob Paulsen): Bubbles' male counterpart. He is a loud-mouthed dunce, in contrast to Bubbles' sweetness, and likes disgusting things. Boomer is the least intelligent of the boys, and they often bully and boss him around. His signature is blue and Boomer's hair parts in a curved fashion like Bubbles', but is longer and spiky on each end, in a wings haircut. * Butch (voiced by Roger L. Jackson): Buttercup's male counterpart. He is hyperactive and easily excited. His signature is green and his hair is spiked upwards, abandoning his previous cowlick from his first appearance. He also shares Buttercup's small triangular hair parting. *Mojo Jojo - a monkey with a high white helmet with purple stripes that protects his brain which has overgrown during the explosion of the X during the birth of the Powerpuff Girls on the outside of his skull, a white and blue headpiece, a white, blue and purple outfit and white gloves. *HIM - a demon so evil that people do not say his true name. He is the most powerful villain in the show and is often said to be the most frightening *Fuzzy Lumpkins - a strange beetle with pink fur who wishes to be left alone. *Princess Morbucks - a rich girl who wants to become a Powerpuff Girl, but became a villain after being rejected. *Gangreen Gang - a group of green-skinned teenagers *Amoeba Boys - three single-cell gangsters *Sedusa - a woman with a red suit and boots and black fishnet stockings === Others === * Professor Utonium - the father of the Powerpuff Girls * The Mayor - the mayor of Townsville who calls the Girls whenever there is trouble. * Ms Bellum - the mayor's secretary. * Ms Keane - a school teacher ==Original Voice Cast== *Cathy Cavadini - Blossom (US) *Maria Darling - Blossom (UK) *Tara Strong - Bubbles (US) *Emma Tate - Bubbles (UK) *E. G. Daily - Buttercup (US) *Jo Wyatt - Buttercup (UK) *Tom Kane - Professor Utonium (US/UK) *Tom Kenny - The Mayor of Townsville (US) *Corey Burton - The Narrator (US/UK) *Rob Rackstraw - The Mayor of Townsville (UK) *Jennifer Hale - Miss Keane (US), Sedusa, Princess Morbucks (US/UK) *Jennifer Martin - Miss Sarah Bellum (US/UK) *Teresa Gallagher - Miss Keane (UK) == Other media == === Movie === The Powerpuff Girls Movie is an animated film which serves as a prequel to the series. It tells the full story of how the girls were created, revealing that Mojo Jojo (the series' main villain) was partly responsible. The main cast of the series returns. It was released in 2002. === Video games === Two video games were made featuring the main cast. They were: * The Powerpuff Girls: Chemical X-Traction (2001) * The Powerpuff Girls: Relish Rampage (2002) === Television special === In 2009, a ten-year anniversary special was released titled The Powerpuff Girls Rule. The story centres around the Key to the World being brought to Townsville. The Girls and every villain who appeared in the series search for the Key. Eventually, Mojo Jojo finds it and reveals that he will use it to create world peace. === Anime adaptation === In 2006, the Powerpuff Girls Z was released. Many major characters returned but personalities and appearances were altered. Instead of being superheroes from birth, the girls were teenagers who were struck by \"Z Rays\" which turned them into superheroes. === 2016 remake === The Powerpuff Girls is a reboot of the original series. Although it follows the same backstory and has similar characters, many things are changed. === Live action sequel === A live action sequel was in development. It was said to depict the Girls now as adults returning to their superhero duties. However, it was cancelled. ==Home media== The show saw several VHS and DVD releases while it was on the air, and the entire series was released on DVD in 2009 to celebrate the show's 10th anniversary. ==Similar television series== * Dexter's Laboratory, which shared similar production staff and voice actors as Powerpuff Girls also features a child with uncanny abilities fighting against his neighbor named Mandark. ==References== ==Other websites== * * * Category:1990s American animated television series Category:1990s American comedy television series Category:1998 American television series debuts Category:2000s American animated television series Category:2000s American comedy television series Category:2000s American sitcoms Category:2005 American television series endings Category:Action television series Category:American children's television series Category:American satirical television series Category:American science fiction television series Category:American television series revived after cancellation Category:Animated adventure television series Category:Cartoon Network series Category:Comedy science fiction Category:English-language television programs Category:Media franchises Category:Television series about sisters Category:Traditional animation Category:Television series by Rough Draft Studios",
 "title": "The Powerpuff Girls"
}