{
 "id": "735588",
 "text": "Jekyll is a British television drama serial shown on BBC One. Steven Moffat wrote all six episodes. Douglas Mackinnon and Matt Lipsey directed three episodes each. It was made by Hartswood Films and Stagescreen Productions. The series also got funding from BBC America. The series is a sequel to the novella Strange Case of Dr Jekyll and Mr Hyde, and not an adaptation of it. The Robert Louis Stevenson tale is used as a backstory within the series. It stars James Nesbitt as Tom Jackman, a modern-day descendant of Dr. Jekyll. He has recently begun transforming into a version of Mr. Hyde (also played by Nesbitt). Jackman is aided by psychiatric nurse Katherine Reimer, played by Michelle Ryan. Gina Bellman appears as Claire, Tom's wife. Filming took place around southern England in late 2006. The series was first shown on BBC One in June and July 2007. ==Plot== Doctor Tom Jackman (James Nesbitt) is a married father of two. He has abandoned his family without explanation to live in a heavily fortified basement flat. He hires psychiatric nurse Katherine Reimer (Michelle Ryan) to help him. After explaining a set of elaborate security procedures to Katherine, he straps himself into a metal chair and undergoes a transformation. Katherine observes that Tom's alter ego exhibits rage, heightened senses, strength and speed, and a flirtatious manner. She assures this persona she will keep his secrets just as she keeps Tom's. She asks for guarantees he will not harm her. Tom's alter ego takes Hyde's name. The two agree an uneasy truce. They share a body, but neither remembers what the other did while in charge. They use a micro cassette recorder to leave messages for each other. When Tom began transforming into the violent Hyde, he feared for his family's safety. He chose to isolate himself from them. He visits his wife Claire (Gina Bellman). During the visit, Hyde assumes control and learns about Tom's family. Miranda Callendar, played by Meera Syal, is a detective employed by Claire. She tells Tom that Jekyll and Hyde was not fiction, but a version of actual events. Miranda shows Tom a picture of the real Doctor Jekyll who lived in Edinburgh in the 19th century. Tom is startled to see that Jekyll looks exactly like him. Tom is also being watched by a private security team led by an American named Benjamin, played by Paterson Joseph. The team works for his former employers at the biotechnology firm, Klein and Utterson. The team is directed by his friend Peter Syme, played by Denis Lawson. When Benjamin puts Tom's children at risk, Hyde asserts himself, and kills a lion. At the hospital he is approached by Sophia, an elderly woman who claims to be his mother, but before he can question her she disappears. Tom confronts Peter, who attempts to drug him. This provokes Hyde to appear and take Peter and Claire hostage. Claire argues that they need to find a cure for Tom's condition. Hyde kills Benjamin. Peter says that Klein and Utterson have had a cure for a long time. Tom is captured and locked inside a metal coffin. Katherine and Miranda confront Peter, claiming they know the truth about Tom. Miranda thinks that Klein and Utterson have access to cloning technology and that Tom is Jekyll's clone. Peter denies this and orders them taken away to be killed. Peter reveals to Claire that Tom's treatment will make him into one persona. If it is Hyde, he will be kept for research. They will make the potion that turned the original Jekyll into Hyde. If it is Tom, she will be free to take him home. When the box is opened, Hyde is dominant. In a flashback triggered by genetic memory, Hyde has a vision of a meeting between Jekyll and Robert Louis Stevenson, the author of Strange Case of Dr Jekyll and Mr Hyde. Stevenson agrees to write a fictional version of Jekyll's case but reveals that he knows the truth: there is no potion. Instead, Jekyll was transformed into Hyde by his love for Alice, a maid within his household. Flashbacks into Tom's own life show his Hyde first appeared during a seaside holiday with Claire, after the pair were accosted by hooligans. Enraged by further threats to Tom's family, Hyde escapes from Klein and Utterson. Ms. Utterson, a ruthless redheaded American woman at the head of Klein and Utterson, takes Claire and her sons hostage at a private estate. She locks the twins in miniature versions of the coffin used on their father. Tom's alleged mother, Sophia, appears on the premises and helps Claire escape her locked bedroom. She tells Claire how Klein and Utterson had tried to clone Doctor Jekyll but had been unsuccessful. Claire meets several of the failed attempts in the basement of the building. They are disfigured and in a near-vegetative state. Sophia explains that Tom is a descendant of Doctor Jekyll, through Mr Hyde, and by chance \"a perfect throwback, a chance in a million\". Klein and Utterson had discovered this and had watched him from when he was six-months- old. In order to trigger his transformation into Hyde, they created a clone of Alice, the maid whom Jekyll had loved. This clone is Claire herself. Hyde tries to rescue Tom's family from Klein and Utterson. He kills Peter. There is a stand-off, with Tom and Claire's sons held hostage and suffocating. The Hyde personality is apparently killed when he is shot with multiple bullets and then manages to avoid 'sharing the damage' by taking the wounds onto himself while allowing Tom to assume his undamaged, healthy form, leaving Doctor Jackman as the only personality. Six months later, Tom has tracked down Sophia, the woman who claimed to be his mother. When he questions her about his father, she reveals that she is the descendant of Hyde. He had inherited the family curse from her. As Tom watches horrified, the powerless, tired, grey-haired Sophia transforms into her own version of the Hyde persona, the red-headed Ms Utterson. == Cast == *James Nesbitt as Dr. Tom Jackman/Hyde *Gina Bellman as Claire Jackman *Paterson Joseph as Benjamin Maddox *Denis Lawson as Peter Syme *Michelle Ryan as Katherine Reimer *Meera Syal as Miranda Callender *Fenella Woolgar as Min *Linda Marlowe as Ms Utterson *Andrew Byrne as Eddie Jackman *Christopher Day as Harry Jackman *Al Hunter Ashton as Christopher == Episodes == # Title Directed by Written by Viewers / Share (million) / (%) Original air date Production code ==Production== ===Development=== Jeffrey Tayor of Stagescreen Productions had the idea of a modern version of Strange Case of Dr Jekyll and Mr Hyde in the mid-1990s. He attempted to get it produced in the United States, but all three attempts fell through. He returned to England and joined with Hartswood Films when Elaine Cameron was looking for ideas for a supernatural thriller.\"Jekyll: The Tale Retold\", featurette on Jekyll DVD, Contender Home Entertainment Cameron approached Steven Moffat for a script. A six-part series was commissioned by the BBC's Jane Tranter and John Yorke in November 2005. BBC America gave co-production funding in March 2006. The producers regularly met with Moffat for brainstorming sessions. The producers invited Moffat to \"write anything\", with the intention of cutting the material back later. However, they were reluctant to cut material once they saw it on the page. The first episode starts with Jackman already knowing about his alter ego. Because the plot of Jekyll begins after the story has developed for the characters, Nesbitt says that the show feels like it is a second series. Moffat explicitly describes the series as a sequel, rather than an adaptation. He said the Jekyll of the original story really existed, and Jackman is his \"modern-day descendant dealing with the same problems\". As Jekyll and Hyde is such a well- known phrase, Moffat labored over what to call the series, eventually deciding upon Jekyll because that word \"carries the name Hyde\". The final episode replaces the title \"Jekyll\" with \"Hyde\". Producer Elaine Cameron says the one word title gives the series a \"very modern feel\". Moffat initially named the character Jekyll rather than Jackman, but found it cumbersome to constantly explain that the book had not been written in this alternate universe. Instead he chose a version where the book exists, but changed the name to Jackman. Otherwise, Cameron felt, the character would appear stupid by not realising what was happening when turning into Hyde. The scene between Tom and Katherine was expanded slightly in the sixth episode to keep their relationship active to facilitate a second series. However, no further episodes were commissioned. In an August 2007 interview, Moffat told Alan Sepinwall of The Star-Ledger that he had a sequel written for the miniseries \"should the BBC be interested\". Following Jekyll, Moffat became a co-writer on Sherlock. ===Casting=== James Nesbitt and his agent attended a meeting with Jane Tranter in late 2005 regarding the 2006 series of Murphy's Law. At the conclusion of the meeting, she offered him a script for Jekyll, suggesting that he might like the role. Nesbitt took the script role as a way of putting a distance between his previous work. The casting of Nesbitt as Tom Jackman and Hyde was publicised on 12 December 2005, but filming was not scheduled to begin until September 2006, increasing Nesbitt's anticipation to play the roles. Writer Steven Moffat said that the dual-role required a very skilled actor, and a well-known actor was necessary because it was such an expensive show to produce. The production team decided Nesbitt's two characters would be mainly differentiated over a change in performance rather than by extensive make-up because they wanted Hyde to be able to walk around in public without attracting attention. Michelle Ryan was revealed to have been cast as Jekyll's assistant, Katherine Reimer, in August 2006. Ryan believed herself to be too young for the part, though that aspect had already been written into the character. To prepare, she consulted the Royal College of Psychiatry. Ryan dyed her hair red for the role to help differentiate her from Tom Jackman's wife. Denis Lawson was cast as Peter Syme. The actor consulted his post- graduate son for information on Syme's job. Moffat initially doubted Gina Bellman's suitability for the role of Claire Jackman because he associated her too much with Jane Christie, the character she had played in his sitcom Coupling. Moffat did not imagine the character to be as beautiful as Bellman, but her audition was so good that he revised his vision of the character. Bellman originally auditioned for the role of Katherine, but the producers wanted someone younger to play that role. However, Bellman said that she talked herself out of the role by arguing that there should be an age gap between Katherine and Claire to avoid Katherine becoming a threat to the wife. Bellman approached her role as if Claire had become caught up in Tom's mid- life crisis, an angle that impressed the producers. Meera Syal was attracted to her role because Miranda was not a clichéd private detective and she thought the humour was \"fresh\". During the second filming block, Mark Gatiss briefly joined the cast, playing the small but important role of Robert Louis Stevenson in flashback scenes in episode five. Other roles included Paterson Joseph as Benjamin Maddox, Linda Marlowe as Ms Utterson and Al Hunter Ashton as Christopher. ===Production=== The series was filmed in two blocks of three episodes. The first three were directed by Douglas Mackinnon and the second three episodes by Matt Lipsey. It took an hour of make-up each day to turn Nesbitt into Hyde; a hairpiece lowered his hairline and prosthetics were added to his chin, nose and ear lobes. He also wore black contact lenses to make Hyde \"soulless\". The producers decided that Hyde's imminent arrival would be indicated by the flash of a black eye. The eye imagery evolved during filming, and did not appear in the script. Filming began in September 2006 with the zoo sequence from the second episode. Benjamin's team have set Tom up to force out Hyde by placing his son, Eddie, in the lion's den.\"Anatomy of a Scene\", Jekyll DVD, Contender Home Entertainment Writing the sequence at a late stage in the production, Moffat wanted to compare Hyde's natural instinct to kill to that of a lion. This was shot on location at Heythrop Zoo, a private zoo in Chipping Norton run by Jim Clubb, whose firm Amazing Animals specialises in training animals for cinema and television. The Norman Foster-designed building in Chertsey, Surrey, which then housed the European Headquarters of video game designer and publisher Electronic Arts, was used as The Klein & Utterson Institute. A large country estate near Henley-on-Thames and in Bognor Regis was used for some of the scenes. A disused Boys' school in Gloucestershire, and the Hammer House in Wardour Street, Soho were used in episode six. Filming concluded on 20 December 2006. The production team had twelve days to shoot each episode. Director Douglas Mackinnon says this was the biggest challenge of the project. The required amount of material was shot for most of the episodes. However, an extra twenty minutes of material was filmed for episode six. Director Matt Lipsey recalls that the team struggled to cut the extra material whilst maintaining the integrity of the episode. Lipsey credits Moffat for not \"being precious\" over his material during the editing process. His willingness to cut superfluous material meant that he was taken seriously when he argued for something to be retained. The music was composed by Debbie Wiseman. ==Broadcast and reception== Jekyll was shown on BBC One on Saturday nights at 9p.m. A two-week break occurred between showings of the third and fourth episodes because the Live Earth benefit concert was broadcast during its timeslot on 7 July. The series began on BBC America from 4 August 2007, as part of a \"Supernatural Saturday\" programming strand. In Australia, Jekyll began on ABC1, Sundays at 8.30 p.m. from 2 March 2008. There was a double episode back-to-back each week. In Canada, Jekyll began on Showcase, at the end of August 2007 and on BBC Canada, Wednesdays at 10:00 p.m. from 26 March 2008. In Hong Kong, Wednesday at 11:55 p.m. from 11 February 2009 on TVB Pearl. In the Netherlands, Jekyll was broadcast in the summer of 2009 on Sci-Fi Channel. Certain edits were made to the United Kingdom broadcasts in order to remove language unsuitable for Saturday night BBC One audiences. For example, a line spoken by Hyde in episode one was changed from \"Who the fuck is Mr Hyde?\" to \"Who the hell is Mr Hyde?\" James Jackson of The Times rated the first episode four out of five stars, calling Nesbitt's performance as Hyde \"as entertainingly [over the top] as a dozen Doctor Who villains, with a palpable sense of menace to boot\". The conspiracy plot is praised as a storyline that separates this series from other adaptations. The Daily Telegraph's Stephen Pile criticised the script for \"veering between Hammer horror and larky humour\". James Walton called the first episode a combination of \"a good yarn with several nicely thoughtful touches\". David Cornelius of DVDTalk said \"six episodes, 300 minutes, not a single one of them wasted. 'Jekyll' is this year's finest television event\". The Australian Broadcasting Corporation, commenting on the series being part of their 2008 line-up, said \"This classic horror tale has been given a modern make-over that will leave you on the edge of your seat and begging for more. James Nesbitt is outstanding as the new Dr Jekyll and Mr Hyde\". Nesbitt was nominated for the Golden Globe Award for Best Performance by an Actor in a Mini-Series or Motion Picture Made for Television for his roles. Paterson Joseph received a mention in the nominations for the 2008 Screen Nation awards. ==Home release== The BBFC rated all episodes as a 15 certificate on 11 June 2007.British Board of Film Classification (2007-06-11). Episode 1 , Episode 2 , Episode 3 , Episode 4 , Episode 5 , Episode 6 . Retrieved on 2007-07-28. Jekyll: Season One was released for region 2 on 30 July 2007 by Contender Home Entertainment. It includes uncut episodes, including restoration of some swearing cut from the BBC broadcasts. As DVD Verdict says about this uncut version, \"the language is saucier, the violence a bit more bloody, and the sex more primal.\" The disc contains audio commentaries on two episodes: producer Elaine Cameron, writer Steven Moffat and first-block director Douglas Mackinnon comment on episode one, while executive producer Beryl Vertue, second-block director Matt Lipsey and actress Gina Bellman comment upon the sixth episode. The set also contains two documentaries: \"Anatomy of a Scene\" focuses upon the production of the zoo sequence in episode two, while \"The Tale Retold\" covers the evolution of the series. The first Region 1 release occurred in the United States on 18 September 2007, although the Region 1 Canadian release was delayed until 9 October, following the Canadian broadcast of the series on Showcase, which commenced at the end of August 2007. ==American remake== In May 2016, Variety reported that Lionsgate will develop an adaptation of the BBC miniseries with Ellen DeGeneres and Jeff Kleeman In July 2016, it was announced that Chris Evans would play the leading role. In December 2016, it was announced that Ruben Fleischer will direct the film. ==References== ==Other websites== * *Jekyll at Hartswood Films *Jekyll at BBC America *Jekyll at the British Film Institute * * Category:2000s British drama television series Category:2007 British television series debuts Category:2007 British television series endings Category:BBC television dramas Category:English-language television programs",
 "title": "Jekyll (TV series)"
}