{
 "id": "735638",
 "text": "Ayden is a town in Pitt County, North Carolina in the United States. The population was 4,977 at the 2020 Census. The town is a part of the Greenville Metropolitan Area of North Carolina's Inner Banks region. The town holds an annual Collard Festival, and is home to many local businesses. It is one of North Carolina's smallest towns. ==Geography== Ayden is located at (35.470973, -77.420740). According to the United States Census Bureau, the town has a total area of , all of it land. ==History== In 1891, William Henry Harris asked the Atlantic Coast Line Railroad to build a railroad depot on a portion of his farm in order to create a village. A parcel of land was divided into residential lots surrounding the depot in \"Harristown\". Harris owned every other lot in Harristown. Lots were sold and homes were built. Businesses began to open up to support the new residents, and on February 3, 1891, people in the town created a local government as \"Ayden.\" Within a few years, the Carolina Christian College and the Free Will Baptist Seminary were established. By 1919, Ayden had full-time electricity supplied by the Ayden municipal light plant. In 1922, the Mutual Building and Loan Association of Ayden was organized to help families obtain mortgages (or loan) to build homes in Ayden. After experiencing tough times during the Great Depression, and after the Second World War, the town began to grow. As the town got bigger, they made commercial, cultural, religious, and other establishments within and around Ayden. The community is still growing today, thanks to the continued development of Greenville because Greenville is an industrial and economic center for eastern North Carolina.Ayden.com - Town Of Ayden, North Carolina - History The Ayden Historic District was listed on the National Register of Historic Places in 1994. ==Population data== As of the census of 2020, there were 4,977 people in the city, organized into 2,206 households. This represents a population increase of 45 persons, or 0.9%, when compared to the 2010 census. The median age is 42.1 years for all persons (44.4 for females, 38.0 for males). Of the total population, 21.3% are at least 65 years old, 23.9% are under the age of 18, with the remaining 54.8% of the population being from 18 to 64. Males comprise 44.5% and females make up 55.5% of the total population. Whites (non-Latino) make up 45.4% of the total population, African-Americans (non-Latino) make up 44.9%, Hispanics or Latinos represent 4.7%, and 3.8% of the population identifies itself as Two or more races, non- Latino. Other races each represent less than 1% each of the total population. Of the total 2,206 households, 1,293 are considered Family households, and 689 have children under 18. The average household size is 2.26 persons. There are 2,516 total housing units, of which the 2,206 are households, for an occupancy rate of 87.7%. Of these households, 51.6% are owner-occupied, while 48.4% are renters. As of 2022, the median (middle) income for a household in the city was $53,000, and the median income for a family was $71,354. The per capita income for the city was $25,067. 10.9% of families and 20.9% of the population are below the poverty line. Out of the total population, 19.0% of those under the age of 18 and 26.2% of those 65 and older are living below the poverty line. == Government structure == Ayden has used the council-manager form of government since 1957. Under this form of government, the Town Board of Commissioners is the final authority of most matters related to managing the government. The Town Board employs a Town Manager to oversee the day-to-day operations of the Town. The Mayor and Town Board of Commissioners are the governing body of the Town. The Mayor acts as the official head of the government and spokesperson of the Board. The Mayor presides at all meeting of the Board and signs all documents authorized by the Board. The Mayor Pro-Tem is selected by each new Board, and assumes all duties and responsibilities of the Mayor in his absence. The Mayor and Town Board, together, are responsible for establishing the policies for the general operation of the Town. The Town Board adopts ordinances, resolutions, budgets, authorizes contracts, and approves the financing of all Town operations. The Board also appoints the Town Manager and Town Attorney, along with members of various boards and commissions. ==Education== Education in Ayden is administered by the Pitt County Public School System. The three schools in Ayden include: Ayden Elementary School, Ayden Middle School and Ayden-Grifton High School. Higher education is provided by Pitt Community College, located between Ayden and Greenville. East Carolina University is in downtown Greenville. ==Local events== The Ayden Collard Festival is held the week immediately following Labor Day in September. The annual event started in 1975 and includes a Collard Queen contest which has been renamed as the Miss Ayden contest, sporting events, rides, live music, food, and a parade.AydenCollardFestival.com - Ayden Collard Festival, Ayden, NC, Eastern North Carolina ==References== ==Other websites== * Official Ayden, NC website * Ayden Collard Festival Category:Towns in North Carolina",
 "title": "Ayden, North Carolina"
}