{
 "id": "735637",
 "text": "Pitt County is a county in the U.S. state of North Carolina. In 2020, 170,243 people lived there. Its county seat is Greenville. Pitt County includes the Greenville Metropolitan Statistical Area. It is one of the fastest growing centers in the state. Since 1990, the population has grown a lot. ==History== The county was made in 1760 from part of Beaufort County. It was named for William Pitt the Elder. Pitt was an English statesman and orator, born in London, England. He studied at Oxford University. In 1731, he joined the army. Pitt led the young \"Patriot\" Whigs. In 1756, he became secretary of state. There he was a pro-freedom speaker in British Colonial government. ==Geography== The total area of Pitt County is . Of that, (0.49%) is water. ===Bordering counties=== *Martin County – northeast *Beaufort County – east *Craven County – south-southeast *Lenoir County – south-southwest *Greene County – southwest *Wilson County – west *Edgecombe County – northwest ==Demographics== At the census of 2020, there were 170,243 people, 70,016 households, and 42,015 families living in the county. The population density was 261 people per square mile (101/km²). There were 80,515 housing units, at an average density of 123 per square mile (48/km²). The racial makeup of the county was 52.2% White, 35.5% Black or African American, 1.8% Asian, 0.4% Native American, 0.1% Pacific Islander, 4.6% from other races, and 5.5% from two or more races. The population was 7.6% Hispanic or Latino of any race. There were 70,016 households, out of which 29.9% had children under the age of 18 living with them, and 38.3% had a married couple living together. 31.7% of all households had one person living alone, and 9.8% had someone living alone who was 65 years of age or older. The average household size was 2.36. Of the total population, 22.3% were under 18 years old, 13.7% were 18 to 24, 26.3% were 25 to 44, 23.2% were 45 to 64, and 14.5% were 65 or over. The median age was 35 years. The population was 47.0% male and 53.0% female. As of 2022, the median (middle) yearly income for a household was about $54,915, compared to $66,186 in North Carolina and $75,149 in the United States. The median income for a family was about $73,970, compared to $82,890 in North Carolina and $92,646 in the United States. The per capita income was about $32,224. About 11.9% of families and 20.0% of all people in Pitt County lived below the poverty line. This includes 22.8% of children under 18 years old and 11.3% of people over 65 years old. About 36.4% of people over 25 years old living in Pitt County had a bachelor's degree. This compares to 35.9% in North Carolina and 35.7% in the United States. About 6.5% of people in Pitt County were born in another country, compared to 8.6% in North Carolina and 13.9% in the United States. About 90.6% of people in Pitt County spoke only English at home, and 9.4% spoke another language. === Racial breakdown by year === Race or ethnicity 2020 2010 2000 1990 1980 White 52.2% 58.9% 62.2% 65.5% 65.1% Black/African-American 35.5% 34.1% 33.7% 33.3% 34.4% Native American 0.4% 0.3% 0.4% 0.2% 0.1% Asian 1.8% 1.6% 0.9% 0.6% 0.3% Pacific Islander 0.1% 0.1% 0.1% 0.0% Other races 4.6% 3.1% 1.5% 0.4% 0.1% Two or more races 5.5% 2.0% 1.1% - - Hispanic or Latino 7.6% 5.5% 3.1% 0.9% 0.9% ==Communities== ===Cities=== *Greenville (county seat) ===Towns=== *Ayden *Bethel *Falkland *Farmville *Fountain *Grifton *Grimesland *Simpson *Winterville ===Census-designated places=== *Bell Arthur *Belvoir *Stokes ===Unincorporated communities=== *Bell's Fork *Black Jack *Chicod *House *Pactolus ===Townships=== *Arthur *Ayden *Belvoir *Bethel *Black Jack *Carolina (Stokes) *Chicod *Falkland *Farmville *Fountain *Greenville *Grifton *Grimesland *Pactolus *Simpson *Swift Creek *Winterville ==Politics, law and government== In the early twentieth century Pitt was a typical Democratic \"Solid South\" county, where many blacks were blocked from voting. The small number of white voters voted overwhelming majorities for the Democratic Party. Pitt County voted for the Democratic Party in every election from at least 1876 until American Independent candidate George Wallace gained a plurality in 1968. Apart from Richard Nixon's overwhelming victory over George McGovern in 1972, Pitt has since been a closely contested swing county, with no major party candidate falling under 40% after 1972. Pitt County is a member of the Mid-East Commission regional council of governments. Pitt County is represented by Gloristine Brown and Timothy Reeder in the North Carolina House of Representatives and Kandie Smith in the North Carolina Senate. ==Education== === Private === Private schools in Pitt County include: *Brookhaven SDA School *Calvary Christian Academy *Children's Montessori School *Christ Covenant School *Community Christian Academy *Faith Christian Academy *Greenville Christian Academy *Greenville Montessori School *John Paul II Catholic HS *The Oakwood School *Roseleaf Academy *Saint Peter Catholic School *Trinity Christian School === Public === Public schools in Pitt County are managed by Pitt County Schools. ==== Elementary schools ==== *Ayden Elementary School *Belvoir Elementary School *Creekside Elementary School *Eastern Elementary School *Elmhurst Elementary School *Falkland Elementary School *H. B. Sugg School (K–2) *Lake Forest Elementary School *Northwest Elementary School *Ridgewood Elementary School *Sam D. Bundy School (3–5) *South Greenville Elementary School *W. H. Robinson Elementary School *Wahl-Coates Elementary School *Wintergreen Intermediate School (3–5) *Wintergreen Primary School (K–2) ==== K–8 schools ==== *Bethel School *Chicod School *G. R. Whitfield School *Grifton School *Pactolus School *Stokes School ==== Middle schools ==== *A. G. Cox Middle School *Ayden Middle School *C. M. Eppes Middle School *E. B. Aycock Middle School *Farmville Middle School *Hope Middle School *Wellcome Middle School ==== High schools ==== *Ayden-Grifton High School *D. H. Conley High School *Farmville Central High School *J. H. Rose High School *North Pitt High School *South Central High School ==== Alternative schools ==== *Pitt County Schools Early College High School === Post-secondary schools === *East Carolina University *Pitt Community College *Miller-Motte Technical College ==Transportation== ===Airport=== American Airlines (Piedmont Airlines) serves the Pitt-Greenville Airport daily with connecting flights to Charlotte Douglas International Airport. == References == ==Further reading== * Kahrl, Andrew W., \"The 'Negro Park' Question: Land, Labor, and Leisure in Pitt County, North Carolina, 1920–1930,\" Journal of Southern History (Feb. 2013) 79#1 pp 113–42. ==Other websites== * *Pitt County Development Commission Website *NCGenWeb Pitt County - free genealogy resources for the county Category:1760s establishments in North Carolina Category:1760",
 "title": "Pitt County, North Carolina"
}