{
 "id": "73570",
 "text": "This is a list of winners and nominations for the Tony Award for Best Musical, first awarded in 1949. ==Awards and nominations== *1949 Kiss Me, Kate - Music and lyrics by Cole Porter, book by Samuel and Bella Spewack. *1950 South Pacific - Music by Richard Rodgers, lyrics by Oscar Hammerstein II, book by Oscar Hammerstein II and Joshua Logan. *1951 Guys and Dolls - Music and lyrics by Frank Loesser, book by Jo Swerling and Abe Burrows. *1952 The King and I - Book and lyrics by Oscar Hammerstein II, music by Richard Rodgers. *1953 Wonderful Town - Book by Joseph Fields and Jerome Chodorov, music by Leonard Bernstein, lyrics by Betty Comden and Adolph Green. *1954 Kismet - Book by Charles Lederer and Luther Davis, music by Alexander Borodin, adapted and with lyrics by Robert Wright and George Forrest. *1955 The Pajama Game - Book by George Abbott and Richard Bissell, music and lyrics by Richard Adler and Jerry Ross. **Fanny **Peter Pan. Book by Jerome Robbins, music by Moose Charlap and Jule Styne and lyrics by Carolyn Leigh, Betty Comden and Adolph Green **Plain and Fancy. Book by Joseph Stein and Will Glickman, music by Albert Hague, and lyrics by Arnold Horwitt. **Silk Stockings. Book, music abd lyrics by Cole Porter *1956 Damn Yankees - Book by George Abbott and Douglass Wallop, music by Richard Adler and Jerry Ross. **Pipe Dream. Book and lyrics by Oscar Hammerstein II, music by Richard Rodgers. *1957 My Fair Lady - Book and lyrics by Alan Jay Lerner, music by Frederick Loewe. **Bells Are Ringing. Book and lyrics by Betty Comden and Adolph Green, music by Jule Styne. **Candide. Book by Lillian Hellman, music by Leonard Bernstein, lyrics by Richard Wilbur. **The Most Happy Fella. Book, music, and lyrics by Frank Loesser. *1958 The Music Man - Book by Meredith Willson and Franklin Lacey, music and lyrics by Meredith Willson. **West Side Story. Book by Arthur Laurents, music by Leonard Bernstein, lyrics by Stephen Sondheim. **New Girl In Town. Book by George Abbott, music and lyrics by Bob Merrill. **Oh, Captain!. Book by Al Morgan and José Ferrer, music and lyrics by Jay Livingston and Ray Evans. **Jamaica. Book by E. Y. Harburg and Fred Saidy, music by Harold Arlen, lyrics by E. Y. Harburg. *1959 Redhead - Book by Herbert and Dorothy Fields, Sidney Sheldon and David Shaw, music by Albert Hague, lyrics by Dorothy Fields. **Flower Drum Song. Book by Oscar Hammerstein II and Joseph Fields, lyrics by Oscar Hammerstein II, music by Richard Rodgers. **La Plume de Ma Tante. Written, devised, and directed by Robert Dhery, music by Gérard Calvi, English lyrics by Ross Parker. *1960 (tie) - The Sound of Music - Book by Howard Lindsay and Russel Crouse. Lyrics by Oscar Hammerstein II, music by Richard Rodgers. *AND Fiorello!. Book by Jerome Weidman and George Abbott. Lyrics by Sheldon Harnick, music by Jerry Bock. (This is the only tie for Best Musical in the history of the Tony Awards.) **Gypsy. Book by Arthur Laurents. Lyrics by Stephen Sondheim, music by Jule Styne. **Once Upon a Mattress. Book by Jay Thompson, Marshall Barer, and Dean Fuller. Lyrics by Marshall Barer, music by Mary Rodgers. **Take Me Along. Book by Joseph Stein and Robert Russell, lyrics and music by Bob Merrill. *1961 Bye Bye Birdie - Book by Michael Stewart, music by Charles Strouse, lyrics by Lee Adams. **Do Re Mi. Book by Garson Kanin, music by Jule Styne, lyrics by Betty Comden and Adolph Green. **Irma La Douce. Book and lyrics by Alexandre Breffort, music by Marguerite Monnot. English book and lyrics by Julian More, David Heneker and Monty Norman. *1962 How to Succeed in Business Without Really Trying - Book by Abe Burrows, Jack Weinstock and Willie Gilbert, music and lyrics by Frank Loesser. **Carnival!. Book by Michael Stewart and Helen Deutsch, music and lyrics by Bob Merrill. **Milk and Honey. Book by Don Appell, lyrics and music by Jerry Herman. **No Strings. Book by Samuel A. Taylor, music and lyrics by Richard Rodgers. *1963 A Funny Thing Happened on the Way to the Forum - Book by Burt Shevelove and Larry Gelbart, music and lyrics by Stephen Sondheim. **Little Me. Book by Neil Simon, music by Cy Coleman, lyrics by Carolyn Leigh. **Oliver!. Book, music, and lyrics by Lionel Bart. **Stop the World - I Want to Get Off. Book, music, and lyrics by Leslie Bricusse and Anthony Newley. *1964 Hello, Dolly! - Book by Michael Stewart, music and lyrics by Jerry Herman. **Funny Girl. Book by Isobel Lennart, music by Jule Styne, lyrics by Bob Merrill. **High Spirits. Book, lyrics, and music by Hugh Martin and Timothy Gray. **She Loves Me. Book by Joe Masteroff, music by Jerry Bock, lyrics by Sheldon Harnick. *1965 Fiddler on the Roof - Book by Joseph Stein, music by Jerry Bock, lyrics by Sheldon Harnick. **Golden Boy. Book by Clifford Odets and William Gibson, music by Charles Strouse, lyrics by Lee Adams. **Half a Sixpence. Book by Beverly Cross, music and lyrics by David Heneker. **Oh! What a Lovely War. Devised by Joan Littlewood for Theatre Workshop, Charles Chilton and Members of the Cast. *1966 Man of La Mancha - Book by Dale Wasserman, music by Mitch Leigh, lyrics by Joe Darion. **Mame. Book by Jerome Lawrence and Robert E. Lee, music and lyrics by Jerry Herman. **Skyscraper. Book by Peter Stone, music by Jimmy Van Heusen, lyrics by Sammy Cahn. **Sweet Charity. Book by Neil Simon, music by Cy Coleman, lyrics by Dorothy Fields. *1967 Cabaret - Book by Joe Masteroff, music by John Kander, lyrics by Fred Ebb. **I Do! I Do!. Book and lyrics by Tom Jones, music by Harvey Schmidt. **The Apple Tree. Book by Sheldon Harnick and Jerry Bock, music by Jerry Bock, lyrics by Sheldon Harnick. **Walking Happy. Book by Roger O. Hirson and Ketti Frings, music by Jimmy Van Heusen, lyrics by Sammy Cahn. *1968 Hallelujah, Baby! Book by Arthur Laurents, music by Jule Styne, lyrics by Betty Comden and Adolph Green. **The Happy Time. Book by N. Richard Nash, music by John Kander, lyrics by Fred Ebb. **How Now, Dow Jones. Book by Max Shulman, music by Elmer Bernstein, lyrics by Carolyn Leigh. **Illya, Darling. Book by Jules Dassin, music by Manos Hadjidakis, lyrics by Joe Darion. *1969 1776 - Book by Peter Stone, music and lyrics by Sherman Edwards. **Hair. Book by Gerome Ragni and James Rado, music by Galt MacDermot, lyrics by James Rado. **Promises, Promises. Book by Neil Simon, music by Burt Bacharach, lyrics by Hal David. **Zorba. Book by Joseph Stein, music by John Kander, lyrics by Fred Ebb. *1970 Applause - Book by Betty Comden and Adolph Green, music by Charles Strouse, lyrics by Lee Adams. **Coco. Book and lyrics by Alan Jay Lerner, music by Andre Previn. **Purlie. Book by Ossie Davis, Philip Rose, and Peter Udell, music by Gary Geld, lyrics by Peter Udell. *1971 Company. - Book by George Furth, music and lyrics by Stephen Sondheim **The Me Nobody Knows. - Book by Robert H. Livingston, Herb Schapiro, Stephen M. Joseph, music by Gary William Freedman, lyrics by Will Holt. **The Rothschilds. - Book by Sherman Yellen, music by Jerry Bock, lyrics by Sheldon Harnick. *1972 Two Gentlemen of Verona. - Based on the play by William Shakespeare. Music by Galt MacDermot, lyrics by John Guare. **Ain't Supposed to Die a Natural Death. - Book, music, and lyrics by Melvin Van Peebles. **Follies. - Book by James Goldman, music and lyrics by Stephen Sondheim. **Grease. *1973 A Little Night Music. - Book by Hugh Wheeler, music and lyrics by Stephen Sondheim. **Don't Bother Me, I Can't Cope. - Book, music, and lyrics by Micki Grant **Pippin. - Book by Roger O. Hirson and Bob Fosse, music and lyrics by Stephen Schwartz. **Sugar. - Book by Peter Stone, music by Jule Styne, lyrics by Bob Merrill *1974 Raisin. - Book by Robert Nemiroff and Charlotte Zaltzberg, music by Judd Woldin, lyrics by Robert Brittan. **Over Here!. - Book by Will Holt, music and lyrics by Richard M. Sherman and Robert B. Sherman. **Seesaw - Book by Michael Bennett, music by Cy Coleman, lyrics by Dorothy Fields. *1975 The Wiz. - Book by William F. Brown, music and lyrics by Charlie Smalls. **Mack and Mabel. - Book by Michael Stewart, music and lyrics by Jerry Herman. **The Lieutenant. - Book, music, and lyrics by Gene Curty, Nitra Scharfman, and Chuck Strand. **Shenandoah. - Book by James Lee Barrett, Peter Udell, and Philip Rose, music by Gary Geld, lyrics by Peter Udell. *1976 A Chorus Line. - Book by James Kirkwood, music by Marvin Hamlisch, lyrics by Edward Kleban. **Bubbling Brown Sugar. - Book by Loften Mitchell. **Chicago. - Book by Fred Ebb and Bob Fosse, music by John Kander, lyrics by Fred Ebb. **Pacific Overtures. - Book by John Weidman, music and lyrics by Stephen Sondheim. *1977 Annie. - Book by Thomas Meehan, music by Charles Strouse, lyrics by Martin Charnin **Happy End. - Music by Kurt Weill, lyrics by Bertolt Brecht. **I Love My Wife. - Book and lyrics by Michael Stewart, music by Cy Coleman. **Side by Side by Sondheim. - Music and lyrics by Stephen Sondheim. *1978 Ain't Misbehavin'. - Music by Thomas \"Fats\" Waller. **Dancin'. - No credited authors; directed and choreographed by Bob Fosse. **On the Twentieth Century. - Book and lyrics by Betty Comden and Adolph Green, music by Cy Coleman. **Runaways. - Book, music, and lyrics by Elizabeth Swados. *1979 Sweeney Todd. - Book by Hugh Wheeler, music and lyrics by Stephen Sondheim. **Ballroom. - Book by Jerome Kass, music by Billy Goldenberg, lyrics by Alan Bergman and Marilyn Bergman. **The Best Little Whorehouse in Texas. - Book by Larry L. King and Peter Masterson, music and lyrics by Carol Hall. **They're Playing Our Song. - Book by Neil Simon, music by Marvin Hamlisch, lyrics by Carole Bayer Sager. *1980 Evita. - Book and lyrics by Tim Rice, music by Andrew Lloyd Webber. **A Day in Hollywood / A Night in the Ukraine - Book and lyrics by Dick Vosburgh, music by Frank Lazarus. **Barnum. - Book by Mark Bramble, music by Cy Coleman, lyrics by Michael Stewart. **Sugar Babies. - Written by Ralph G. Allen, music by Jimmy McHugh, lyrics by Dorothy Fields and Al Dubin. *1981 42nd Street. - Book by Michael Stewart and Mark Bramble, music by Harry Warren, lyrics by Al Dubin. **Sophisticated Ladies. - Music by Duke Ellington **Tintypes. - Book by Mel Marvin and Gary Pearle. **Woman of the Year. - Book by Peter Stone, music by John Kander, lyrics by Fred Ebb. *1982 Nine. - Book by Arthur Kopit, music and lyrics by Maury Yeston. **Dreamgirls. - Book and lyrics by Tom Eyen, music by Henry Krieger. **Joseph and the Amazing Technicolor Dreamcoat. - Book and lyrics by Tim Rice, music by Andrew Lloyd Webber. **Pump Boys and Dinettes. - Book, music, and lyrics by Pump Boys and Dinettes (theatre organization featuring John Foley, Mark Hardwick, Debra Monk, Cass Morgan, John Schimmel, and Jim Wann). *1983 Cats. - Music by Andrew Lloyd Webber, lyrics from the poems of T. S. Eliot with additional lyrics by Trevor Nunn. **Blues in the Night. - No credited authors, conceived and directed by Sheldon Epps. **Merlin. - Book by Richard Levinson and William Link, music by Elmer Bernstein, lyrics by Don Black. **My One and Only. - Book by Peter Stone and Timothy S. Mayer, music by George Gershwin, lyrics by Ira Gershwin. *1984 La Cage aux Folles. - Book by Harvey Fierstein, music and lyrics by Jerry Herman. **Baby. - Book by Sybille Pearson, music by David Shire, lyrics by Richard Maltby, Jr. **Sunday in the Park with George. - Book by James Lapine, music and lyrics by Stephen Sondheim. **The Tap Dance Kid. - Book by Charles Blackwell, music by Henry Krieger, lyrics by Robert Lorick. *1985 Big River. - Book by William Hauptman, music and lyrics by Roger Miller. **Grind. - Book by Fay Kanin, music by Larry Grossman, lyrics by Ellen Fitzhugh. **Leader of the Pack . - Book by Anne Beatts **Quilters.. - Book by Molly Newman and Barbara Damashek, music and lyrics by Barbara Damashek. *1986 The Mystery of Edwin Drood. - Book, music, and lyrics by Rupert Holmes. **Big Deal. - Book by Bob Fosse. **Song and Dance. - Music by Andrew Lloyd Webber, lyrics by Don Black. **Tango Argentino. - No credited authors, conceived and directed by Claudio Segovia and Héctor Orezzoli *1987 Les Misérables. - Book by Claude-Michel Schönberg and Alain Boublil, music by Claude-Michel Schönberg, lyrics by Herbert Kretzmer. **Me and My Girl. - Book and lyrics by L. Arthur Rose and Douglas Furber, music by Noel Gay. **Rags. - Book by Joseph Stein, music by Charles Strouse, lyrics by Stephen Schwartz. **Starlight Express. - Music by Andrew Lloyd Webber, lyrics by Richard Stilgoe. *1988 The Phantom of the Opera. - Book by Richard Stilgoe and Andrew Lloyd Webber, music by Andrew Lloyd Webber, lyrics by Charles Hart. **Into the Woods. - Book by James Lapine, music and lyrics by Stephen Sondheim. **Romance/Romance. - Book and lyrics by Barry Harman, music by Keith Herrmann. **Sarafina!. - Book, music, and lyrics by Mbongeni Ngema. *1989 Jerome Robbins' Broadway. - No credited authors, directed by Jerome Robbins. **Black and Blue. - No credited authors, conceived and directed by Claudio Segovia and Héctor Orezzoli **Starmites. - Book by Stuart Ross and Barry Keating, music and lyrics by Barry Keating. *1990 City of Angels - Book by Larry Gelbart, lyrics by David Zippel, music by Cy Coleman **Aspects of Love - Book by Andrew Lloyd Webber, lyrics by Don Black and Charles Hart, music by Andrew Lloyd Webber **Grand Hotel - Book by Luther Davis, music & lyrics by George Forrest and Robert Wright **Meet Me in St. Louis - Book by Hugh Wheeler, music & lyrics by Ralph Blane and Hugh Martin *1991 The Will Rogers Follies - Book by Peter Stone, lyrics by Betty Comden and Adolph Green, music by Cy Coleman **Miss Saigon - Book by Alain Boublil and Claude-Michel Schönberg, lyrics by Alain Boublil and Richard Maltby, Jr., music by Claude-Michel Schönberg **Once on This Island - Book & lyrics by Lynn Ahrens, music by Stephen Flaherty **The Secret Garden - Book & lyrics by Marsha Norman, music by Lucy Simon *1992 Crazy for You - Book by Ken Ludwig, lyrics by Ira Gershwin, music by George Gershwin **Falsettos - Book by William Finn and James Lapine, music & lyrics by William Finn **Five Guys Named Moe - Conceived by Clarke Peters, music & lyrics by various composers **Jelly's Last Jam - Book by George C. Wolfe, lyrics by Susan Birkenhead, music by Jelly Roll Morton *1993 Kiss of the Spider Woman - Book by Terrence McNally, lyrics by Fred Ebb, music by John Kander **Blood Brothers - Book, music, & lyrics by Willy Russell **The Goodbye Girl - Book by Neil Simon, lyrics by David Zippel, music by Marvin Hamlisch **The Who's Tommy - Book by Pete Townshend and Des McAnuff, music & lyrics by Pete Townshend *1994 Passion - Book by James Lapine, music & lyrics by Stephen Sondheim **A Grand Night for Singing - Music by Richard Rodgers, lyrics by Oscar Hammerstein II **Beauty and the Beast - Book by Linda Woolverton, lyrics by Howard Ashman and Tim Rice, music by Alan Menken **Cyrano: The Musical - Book & lyrics by Koen van Dijk, music by Ad van Dijk *1995 Sunset Boulevard - Book by Christopher Hampton and Don Black, lyrics by Don Black, music by Andrew Lloyd Webber **Smokey Joe's Cafe - Music & lyrics by Jerry Leiber and Mike Stoller *1996 Rent - Book, music, and lyrics by Jonathan Larson **Bring in 'da Noise/Bring in 'da Funk - Book by Reg E. Gaines; lyrics by Reg E. Gaines, George C. Wolfe, and Ann Duquesnay; music by Daryl Waters, Zane Mark, and Ann Duquesnay **Chronicle of a Death Foretold - Book adapted by Graciela Daniele and Jim Lewis, based on the novel by Gabriel García Márquez; music by Bob Telson **Swinging on a Star - Book by Michael Leeds, lyrics by Johnny Burke, music by various composers *1997 Titanic - Book by Peter Stone, music & lyrics by Maury Yeston **Juan Darien - Book by Elliot Goldenthal and Julie Taymor, lyrics by Elliot Goldenthal, music by Elliot Goldenthal **Steel Pier - Book by David Thompson, lyrics by Fred Ebb, music by John Kander **The Life - Book by Cy Coleman, David Newman, and Ira Gasman; lyrics by Ira Gasman; music by Cy Coleman *1998 The Lion King - Book by Roger Allers and Irene Mecchi; lyrics by Tim Rice; music by Elton John; additional music & lyrics by Lebo M, Mark Mancina, Jay Rifkin, Julie Taymor, and Hans Zimmer **Side Show - Book & lyrics by Bill Russell, music by Henry Kreiger **The Scarlet Pimpernel - Book & lyrics by Nan Knighton, music by Frank Wildhorn **Ragtime - Book by Terrence McNally, lyrics by Lynn Ahrens, music by Stephen Flaherty *1999 Fosse - Conceived by Richard Maltby, Jr., Chet Walker and Ann Reinking, music & lyrics by various composers **The Civil War - Book by Gregory Boyd and Frank Wildhorn, lyrics by Jack Murphy, music by Frank Wildhorn **It Ain't Nothin' But the Blues - Book by Charles Bevel, Lita Gaithers, Randal Myler, Ron Taylor, and Dan Wheetman; music & lyrics by various composers **Parade - Book by Alfred Uhry, music & lyrics by Jason Robert Brown *2000 Contact - Conceived by Susan Stroman and John Weidman, book by John Weidman, music & lyrics by various composers **James Joyce's The Dead - Book by Richard Nelson, music by Shaun Davey, lyrics by Richard Nelson and Shaun Davey **Swing! - Conceived by Paul Kelley, music & lyrics by various composers **The Wild Party - Book by Michael John LaChiusa and George C. Wolfe, music & lyrics by Michael John LaChiusa *2001 The Producers - Book by Mel Brooks and Thomas Meehan, music & lyrics by Mel Brooks **A Class Act - Book by Linda Kline and Lonny Price, music & lyrics by Edward Kleban **The Full Monty - Book by Terrence McNally, music & lyrics by David Yazbek **Jane Eyre - Book by John Caird, lyrics by John Caird and Paul Gordon, music by Paul Gordon(songwriter) *2002 Thoroughly Modern Millie - Book by Richard Morris and Dick Scanlan, new lyrics by Dick Scanlan, new music by Jeanine Tesori **Mamma Mia! - Book by Catherine Johnson, music & lyrics by Benny Andersson and Björn Ulvaeus **Sweet Smell of Success: The Musical - Book by John Guare, lyrics by Craig Carnelia, music by Marvin Hamlisch **Urinetown The Musical - Book by Greg Kotis, lyrics by Greg Kotis and Mark Hollman, music by Mark Hollman *2003 Hairspray - Book by Thomas Meehan, music by Marc Shaiman, lyrics by Scott Wittman and Marc Shaiman **Amour - Book & original French lyrics by Didier Van Cauwelaert, book adaptation and English lyrics by Jeremy Sams; music by Michel Legrand **A Year with Frog and Toad - Book & lyrics by Willie Reale, music by Robert Reale **Movin' Out - Conceived by Twyla Tharp, music & lyrics by Billy Joel *2004 Avenue Q - Book by Jeff Whitty, music & lyrics by Robert Lopez and Jeff Marx **The Boy from Oz - Book by Martin Sherman (original book by Nick Enright), music & lyrics by Peter Allen **Caroline, or Change - Book & lyrics by Tony Kushner, music by Jeanine Tesori **Wicked - Book by Winnie Holzman, music & lyrics by Stephen Schwartz *2005 Monty Python's Spamalot - Book by Eric Idle, music by John Du Prez and Eric Idle, lyrics by Eric Idle' based on the film Monty Python and the Holy Grail **The Light in the Piazza - Book by Craig Lucas, music & lyrics by Adam Guettel **Dirty Rotten Scoundrels - Book by Jeffrey Lane, music & lyrics by David Yazbek **The 25th Annual Putnam County Spelling Bee - Book by Rachel Sheinkin, music & lyrics by William Finn *2006 Jersey Boys - Book by Marshall Brickman and Rick Ellice, music and lyrics by Bob Gaudio and Bob Crewe **The Color Purple - Book by Marsha Norman, music & lyrics by Brenda Russell, Allee Willis, and Stephen Bray **The Drowsy Chaperone - Book by Bob Martin and Don McKellar, music & lyrics by Lisa Lambert and Greg Morrison **The Wedding Singer - Book by Tim Herlihy and Chad Beguelin, music by Matthew Sklar, lyrics by Chad Beguelin *2007 Spring Awakening - Book by Steven Sater, music by Duncan Sheik, lyrics by Steven Sater **Curtains - Book by Rupert Holmes, music by John Kander, lyrics by Fred Ebb **Grey Gardens - Book by Doug Wright, music by Scott Frankel, lyrics by Michael Korie **Mary Poppins - Book by Julian Fellowes, music and lyrics by Robert B. Sherman, Richard M. Sherman, George Stiles, and Anthony Drewe *2017 Dear Evan Hansen - Music and lyrics by Benj Pasek and Justin Paul, book by Steven Levenson Musical",
 "title": "Tony Award for Best Musical"
}