{
 "id": "735817",
 "text": "Owen Benjamin (born Owen Benjamin Smith; May 24, 1980) is an American comedian. He is known for his hatred of political correctness as he believes it is a euphemism for censorship. He often discusses radical right-wing conspiracy theories. == Early life and education == Owen Benjamin was born in 1980. He went to Plattsburgh State University. He started out as an actor in television in 2006. In 2008, Benjamin played a supporting character in the movie The House Bunny. In 2009, he starred in the movie All's Faire in Love, co-starring Christina Ricci. In 2012, Benjamin started playing the protagonist’s best friend in the sitcom Sullivan and Son. == Comedy == Benjamin modelled his comedy after that of Adam Sandler and Vince Vaughn. He says the most offensive things he can think of about everyone because he wants to show that no one gets to tell him what he can or cannot say. == Politics == Owen Benjamin says that the transgender movement is just a modern day version of eugenics and that radio host Jesse Thorn is a child molester because he transitioned his kid. Benjamin says he wants to bring back slavery as he believes that it can solve the abortion dilemma. Benjamin is a creationist and does not believe that dinosaurs ever existed. == Views on race == Owen Benjamin has said that Hitler did not really hate the Jews but was trying to \"clean Germany up\" to get rid of the \"parasites\". Benjamin says that Jews control the media, Hollywood and pornography and that no one but the Jews wants any of them. Benjamin also said that if the Jews end up with power they will destroy civilization. Benjamin also supports Peter Brimelow. Benjamin made up lines from the Talmud to prove that it supports Jewish Supremacy Benjamin also makes fun of people who do not like Holocaust denial. ==Alternative right== In a video attacking Ben Shapiro for criticizing Nick Fuentes and people on the Alt-right who support conspiracy theories, Owen Benjamin describes himself as on the Alt-right by saying “Do you know anyone else on the Alt-right who sings about moon landing conspiracies” and that “what Ben Shapiro doesn’t understand is that all that it means when we say we’re Alt-right is that we’re an alternative to the mainstream right!”. == Personal life == In 2008, Owen Benjamin got engaged to Christina Ricci but later called off their marriage. He eventually married someone else and had 4 children to date. == References == Category:1980 births Category:Living people Category:Comedians from New York (state) Category:Actors from New York (state)",
 "title": "Owen Benjamin"
}