{
 "id": "736263",
 "text": "The following is a list of deaths that should be noted in March 2020. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non- humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==March== ===1=== *István Balsai, 72, Hungarian jurist and politician, Minister of Justice (1990–1994) and MP (1990–2011).Meghalt Balsai István alkotmánybíró *Ernesto Cardenal, 95, Nicaraguan poet (The Gospel in Solentiname), theologian and Roman Catholic priest, heart and kidney disease. *John Currier, 66–67, American Coast Guard vice admiral, Vice Commandant of the U.S. Coast Guard (2012–2014).Decorated Retired Coast Guard Vice Admiral Dies *Jacques Lesourne, 91, French economist, director of Le Monde (1991–1994).Jacques Lesourne, ancien directeur du « Monde », est mort *Stefan Lindqvist, 52, Swedish footballer (Halmstad, IFK Göteborg, national team), problems caused from ALS.Stefan Lindqvist är död – endast 52 år gammal *Siamand Rahman, 31, Iranian powerlifter, Paralympic champion (2012, 2016), cardiac arrest.World's Strongest Paralympian Siamand Rahman Dies at 31 *Jan Vyčítal, 77, Czech caricaturist and country singer- songwriter.Zemřel Greenhorn a karikaturista Jan Vyčítal, bylo mu 77 let *Jack Welch, 84, American businessman and chemical engineer, CEO of General Electric (1981–2001), kidney failure.Jack Welch, former chairman and CEO of GE, dies at 84 ===2=== *Elizabeth Nelson Adams, 79, American artist and poet.Elizabeth Nicholson Nelson Adams (1941 - 2020) *Rafael Cancel Miranda, 89, Puerto Rican independence activist, writer and convicted attempted murderer, co-perpetrator of the 1954 U.S. Capitol shooting, congestive heart failure.Fallece Rafael Cancel Miranda, ex preso político y el último sobreviviente del ataque al Congreso en 1954 *Viktor Josef Dammertz, 90, German Roman Catholic prelate, Bishop of Augsburg (1993–2004).Früherer Bischof Viktor Josef Dammertz ist tot *James Lipton, 93, American screenwriter (Capitol), actor (Arrested Development) and television host (Inside the Actors Studio), bladder cancer.James Lipton, Creator and Host of 'Inside the Actors Studio,' Dies at 93 *Mohammad Mirmohammadi, 70, Iranian politician, member of the Expediency Discernment Council (since 2012), COVID-19.Expediency Council member Mohammad Mirmohammadi dies *Barbara Neely, 78, American author (Blanche on the Lam).Barbara Neely, creator of black female sleuth series, dies *Vera Pless, 88, American mathematician.Vera Pless *Ulay, 76, German performance artist, lymphoma.Ulay è morto *Vladimir Shuralyov, 84, Soviet-Russian military officer and politician, Deputy Minister of Defence (1990–1991), hit by car.Советский генерал скончался после наезда на него иномарки в Москве *Peter Wieland, 89, German singer and actor (The White Horse Inn).DDR-Schlagerstar und Schauspieler: Peter Wieland mit 89 Jahren gestorben *Susan Weinert, 54 , German jazz guitarist, problems caused from cancer.Susan Weinert ist tot ===3=== *Bobbie Battista, 67, American journalist (CNN), cervical cancer.Former CNN Anchor Bobbie Battista dead at 67 *Alain Bertrand, 69, French politician, Senator (2011, since 2012) and Mayor of Mende, Lozère (2008–2016).Décès du sénateur PS de Lozère et ancien maire de Mende Alain Bertrand *Roscoe Born, 69, American actor (One Life to Live, Santa Barbara, The Young and the Restless), suicide.Soap Vet Roscoe Born Passes Away *CC, 18, American tabby cat, first cloned pet, kidney failure.World's first cloned cat passes away *Henry N. Cobb, 93, American architect (Hyatt Center, John Hancock Tower, U.S. Bank Tower).Henry N. Cobb dies at 93 (death announced on this date) *Alf Cranner, 83, Norwegian folk singer-songwriter and composer.Visesangeren Alf Cranner er død 83 år gammel *Freimut Duve, 83, German politician and writer, MP (1980–1998).Politiker und Publizist Freimut Duve gestorben (in German) *Georges Fontès, 96, French politician, Mayor of Béziers (1983–1989) and General Councillor of Hérault (1982–2015).L'ancien maire de Béziers Georges Fontès est mort, il avait 96 ans *Wendell Goler, 71, American journalist (Fox News), kidney failure.Wendell Goler Dead: Former Fox News Reporter Dies at 70 *Stanisław Kania, 92, Polish politician, First Secretary of the United Workers' Party (1980–1981), pneumonia and heart failure.Nie żyje Stanisław Kania, były przywódca Polskiej Zjednoczonej Partii Robotniczej *James Otis, 71, American actor (Star Trek: Deep Space Nine, The Black Dahlia, The Prestige).James Patrick Otis *Nicolas Portal, 40, French racing cyclist, sporting director of Team Sky/Ineos (since 2013), cardiac arrest or heart attack.Nicolas Portal dies of heart attack at 40 *Charles J. Urstadt, 91, American real estate executive and investor, helped create Battery Park City, problems caused from a stroke. ===4=== *Adelaide Chiozzo, 88, Brazilian actress (Deus Nos Acuda) and accordionist.Morre cantora Adelaide Chiozzo, que deu voz a 'Beijinho doce *Eskandar Firouz, 93, Iranian environmentalist and politician, Director of the Department of Environment (1971–1977).Eskandar Firouz, Founder of Iran’s Department of Environment, Dies at 93 *Stratis Haviaras, 84, Greek-American novelist and poet. *Amo Houghton, 93, American businessman (Corning Inc.) and politician, member of the U.S. House of Representatives from New York (1987–2005).Former congressman, Corning Inc. chairman Amo Houghton dies *Kerry Marshall, 81, New Zealand politician, Mayor of Richmond (1986–1989), Tasman (1989–1998), and Nelson (2007–2010).Former Nelson and Tasman Mayor Kerry Marshall has died *Frank McLaughlin, 84, American comics artist (Judomaster, Gil Thorp).Francis McLaughlin *Javier Pérez de Cuéllar, 100, Peruvian politician, Secretary- General of the United Nations (1982–1991) and Prime Minister (2000–2001).Javier Pérez de Cuéllar: Diplomático falleció este miércoles a los 100 años *Robert Shavlakadze, 86, Georgian high jumper, Olympic champion (1960).Советский олимпийский чемпион Шавлакадзе умер в Тбилиси *Alexey Sorokin, 97, Russian military officer and politician, Admiral of the Fleet (1988–1992) and Deputy (1989–1991).Адмирал флота Алексей Сорокин умер на 97-м году жизни *Rosalind P. Walter, 95, American riveter and philanthropist, namesake of Rosie the Riveter.Rosalind P. Walter, the First 'Rosie the Riveter,' Has Died ===5=== *Katcho Achadjian, 68, Armenian-American businessman and politician, member of the California State Assembly (2010–2016).Former Assemblymember Katcho Achadjian Dies at 68 *Solomon Berewa, 81, Sierra Leonean politician, Vice-President (2002–2007) and 2007 presidential candidate.Sierra Leone’s former Vice President Solomon Berewa has died *Emilio Caprile, 91, Italian footballer (Genoa, Juventus, national team).Addio Caprile, ex Juve e Nazionale. Quel famoso viaggio in nave... *Jeanette Fitzsimons, 75, New Zealand politician and environmentalist, co- leader of the Green Party of Aotearoa New Zealand (1995–2009) and MP (1996–2010), stroke caused from a fall.Former Green Party co-leader Jeanette Fitzsimons has died *Antonio Permunian, 89, Swiss footballer (Bellinzona, Luzern, national team).L’Acb piange Antonio Permunian *Hossein Sheikholeslam, 67, Iranian politician and activist, Ambassador to Syria (1998–2003) and MP (2004–2008), took part in the Iran hostage crisis, COVID-19.دیپلمات سابق ایران بر اثر ابتلا به کرونا درگذشت؛ ل فاطمه رهبر «وخیم» اعلام شد *Alejandro Sieveking, 85, Chilean playwright and theatre director.Fallece a el dramaturgo chileno Alejandro Sieveking a los 85 años ===6=== *Stanislav Bogdanovich, 27, Ukrainian chess player, nitrous oxide overdose.Ukrainian GM Stanislav Bogdanovich and his girlfriend found dead in Moscow: Report *Bélgica Castro, 99, Chilean actress (Little White Dove, Old Cats, La Recta Provincia), problems caused from dementia.A los 99 años y un día después del deceso de su esposo muere actriz Bélgica Castro *Henri Richard, 84, Canadian Hall of Fame ice hockey player (Montreal Canadiens), eleven-time Stanley Cup champion, problems caused from Alzheimer's disease.Canadiens legend Henri Richard passes away at age 84 *Elinor Ross, 93, American operatic soprano, renal failure.Fallece la soprano estadounidense Elinor Ross a los 93 años de edad *Danny Tidwell, 35, American dancer and reality television contestant (So You Think You Can Dance), car accident.Danny Tidwell's Death Mourned by So You Think You Can Dance Stars and Other Celebs *Tom Turnipseed, 83, American politician, member of the South Carolina Senate (1976–1980), respiratory failure.Longtime SC political figure and progressive activist, Tom Turnipseed, dies *McCoy Tyner, 81, American jazz pianist (John Coltrane Quartet) and composer. *Patrick Wright, Baron Wright of Richmond, 88, British politician, Ambassador to Luxembourg (1977–1979), Syria (1979–1981) and Saudi Arabia (1984–1986) and member of the House of Lords (1994–2019).Lord Wright of Richmond obituary ===7=== *K. Anbazhagan, 97, Indian politician, MLA (1957–1962, 1971–1991, 1996–2011) and MP (1962–1967), multiple organ failure.DMK general secretary Anbazhagan no more *Mart Crowley, 84, American playwright (The Boys in the Band), heart attack caused from surgery.Playwright Mart Crowley, Best Known For The Boys in the Band, Has Died at 84 *William Benner Enright, 94, American politician and lawyer, Judge of the U.S. District Court for Southern California (since 1972).William Benner Enright July 12, 1925 - March 07, 2020 *Jair Marinho, 83, Brazilian footballer (Fluminense, Corinthians, national team), World Cup winner (1962).Morre Jair Marinho, ídolo do Fluminense e campeão mundial pelo Brasil em 1962 *Fatemeh Rahbar, 56, Iranian politician, MP (2004–2016), COVID-19.Iranian lawmakers passes away from coronavirus *Houshang Zarif, 81, Iranian tar player, heart failure.استاد هوشنگ ظریف درگذشت ===8=== *H. R. Bhardwaj, 82, Indian politician, Minister of Law and Justice (2004–2009), Governor of Karnataka (2009–2014) and Kerala (2012–2013), cardiac arrest.Hans Raj Bhardwaj, former law minister and senior Congress leader, passes away at 83 *Martin Davorin-Jagodić, 84, Croatian composer. *Jan-Henrik Fredriksen, 63, Norwegian politician, MP (2005–2017).Jan-Henrik Fredriksen er død *Luis Racionero, 80, Spanish writer, Director of National Library (2001–2004).Muere Luis Racionero, el introductor de la contracultura en España que acabó siendo liberal *Max von Sydow, 90, Swedish-born French actor (The Seventh Seal, The Exorcist, Flash Gordon).Max Von Sydow: Actor dies aged 90 *Johnny Yune, 83, South Korean-American actor (They Call Me Bruce?, Nothing in Common, They Still Call Me Bruce) and comedian, cerebral hemorrhage.미국인 웃겼던 코미디언 자니윤 별세…이제 무대는 천국으로 ===9=== *John Bathersby, 83, Australian Roman Catholic prelate, Archbishop of Brisbane (1991–2011) and Bishop of Cairns (1986–1991).Brisbane Archdiocese’s former shepherd Archbishop John Bathersby has died aged 83 *Lorenzo Brino, 21, American child actor (7th Heaven), car crash.7th Heaven Child Star Lorenzo Brino Dies at 21 Following Car Collision *Anton Coppola, 102, American orchestra conductor and composer.Anton Coppola, Opera Tampa’s founding ‘Maestro,’ dies at 102 *Italo De Zan, 94, Italian racing cyclist, COVID-19.Coronavirus a Treviso, morto Italo De Zan: l'ex campione di ciclismo amico di Coppi e Bartali *Richard K. Guy, 103, British-Canadian mathematician (Winning Ways for your Mathematical Plays), co-creator of combinatorial game theory.Richard K. Guy (1916–2020) *José Jiménez Lozano, 89, Spanish writer, Miguel de Cervantes Prize winner (2002).Muere a los 89 años el escritor abulense José Jiménez Lozano, Premio Cervantes y Nacional de las Letras *Lee Cha-su, 62, South Korean politician and activist, COVID-19.이차수 전 대구 북구의장 코로나19 사망 소식에 보건당국 비상 *Keith Olsen, 74, American record producer, sound engineer and musician (The Music Machine), cardiac arrest.Keith Olsen, Producer of Fleetwood Mac, Pat Benatar, Dies *John Havelock Parker, 91, Canadian politician, Mayor of Yellowknife (1964–1967) and Commissioner of the Northwest Territories (1979–1989).John Parker, N.W.T. commissioner who quietly shed power, dies at 91 *Mohammad-Reza Rahchamani, 67, Iranian physician and politician, MP (1984–2000), COVID-19.Former Iranian MP dies of coronavirus *Eric Taylor, 70, American folk singer-songwriter and guitarist, liver disease.Houston loses quintessential folk songwriter, Eric Taylor ===10=== *Mohammad Alavi Tabar, 89, Iranian politician, MP (1980–1988), COVID-19.سید محمد علوی تبار از نزدیکان رهبر ایران و نماینده پیشین مجلس بر اثر ابتلا به کرونا درگذشت. *Jack Buechner, 79, American politician and lawyer, member of the U.S. House of Representatives from Missouri's 2nd congressional district (1987–1991), heart attack.Former St. Louis-area congressman dies *Alessandro Criscuolo, 82, Italian politician and lawyer, President of the Constitutional Court (2014–2016).Morto Alessandro Criscuolo, ex presidente della Corte Costituzionale: aveva 82 anni *Kurt Liander, 88, Swedish footballer (AIK, IFK Stockholm, national team).AIK Fotboll sörjer Kurt Liander ===11=== *Didier Bezace, 74, French actor (The Little Thief, Les Voleurs, The Minister).L'acteur et metteur en scène Didier Bezace est mort *Ted Cox, 65, American baseball player (Boston Red Sox, Cleveland Indians, Seattle Mariners), multiple myeloma.Ted Cox *Sir Rob Fenwick, 68, New Zealand environmentalist and businessman, cancer.Environmentalist Sir Rob Fenwick dies at age 68 *Burkhard Hirsch, 89, German politician, Vice President (1994–1998) and MP (1972–1975, 1980–1998).Burkhard Hirsch ist tot *Irina Kirichenko, 82, Russian sprint cyclist, World champion (1964, 1968).Светлой памяти Кириченко Ирины Ивановны *Del Shofner, 85, American football player (Los Angeles Rams, New York Giants).Legendary Giants receiver Del Shofner dies at age 85 *War Emblem, 21, American Thoroughbred racehorse, Kentucky Derby (2002) and Preakness Stakes (2002) winner.Dual Classic Winner War Emblem Dies *Charles Wuorinen, 81, American composer and educator (Manhattan School of Music), Pulitzer Prize winner (1970), problems caused from a fall.Pulitzer Prize- winning composer Charles Wuorinen dies at 81 *Boris Yaro, 81, American photojournalist (The Los Angeles Times).Boris Yaro, whose photo of a 1968 assassination endures, has died at 81 ===12=== *Sir John Chalstrey, 88, British surgeon and politician, Lord Mayor of London (1995–1996). *Wolfgang Hofmann, 78, German judoka, Olympic silver medalist (1964).Judo-Deutschland trauert um Wolfgang Hofmann *Tonie Marshall, 68, French-American actress (A Slightly Pregnant Man) and movie director (Venus Beauty Institute, The Missionaries).Actress and director Tonie Marshall dies aged 68 *Sir John Lyons, 87, British linguist.Sir John Lyons 1932-2020 *Giovanni Battista Rabino, 88, Italian politician, MP (1983–1994), COVID-19.Morto per il coronavirus l’ex parlamentare Coldiretti Gianni Rabino *Michel Roux, 78, French-born British chef and restaurateur (Le Gavroche, The Waterside Inn), idiopathic pulmonary fibrosis. *Danny Ray Thompson, 72, American jazz saxophonist.Sun Ra Arkestra’s Danny Ray Thompson Dead at 72 ===13=== *Alejandro Betts, 72, Argentine historian and political activist.Falleció Alejandro Betts, el malvinense que defendió la soberanía argentina sobre las Islas Malvinas *Lucien Braun 97, French historian and philosopher.Lucien Braun nous a quittés *Ivor Danvers, 87, English actor (Howards' Way). *Gerard du Prie, 82, Dutch strongman and powerlifter, Strongest Man of the Netherlands (1979).‘Sterkste man’ Gerard du Prie overleden *Barbara C. Harris, 89, American Episcopal prelate, suffragan bishop of Massachusetts (1989–2003), problems caused from gastrointestinal surgery.RIP: The Rt. Rev. Barbara C. Harris, Anglican Communion’s first female bishop, dies at 89 *Eugene Thomas Long, 84, American philosopher.Eugene \"Gene\" Thomas Long III *Dorothy Maclean, 100, Canadian writer and educator.Findhorn Foundation's founder Dorothy Maclean dies aged 100 *Giwi Margwelaschwili, 92, German-Georgian writer and philosopher.Giwi Margwelaschwili ist tot *Moon Deoksu, 91, South Korean poet.예술원 회원 문덕수 시인 타계 …모더니즘 문학에 기여한 거목 *Filippos Petsalnikos, 69, Greek politician, Speaker of the Hellenic Parliament (2009–2012), leukemia.Former Speaker of the House Filippos Petsalnikos Dies at 70 *Nasser Shabani, Iranian brigadier general (Revolutionary Guard), COVID-19.Iranian Gen. Shabani dies from coronavirus *Breonna Taylor, 26, American emergency medical technician, shot.Woman shot and killed by Kentucky police who entered wrong home, family says *Mart Ummelas, 66, Estonian journalist and television executive (Tallinna TV).66-aastaselt suri kauaaegne ajakirjanik Mart Ummelas *Yang Mu, 79, Taiwanese poet and essayist.Noted Taiwanese poet Yang Mu dies at 79 *Dana Zátopková, 97, Czech javelin thrower, Olympic champion (1952). ===14=== *Gustavo Bebianno, 56, Brazilian politician, Acting President of the Social Liberal Party (2018) and Secretary-General of the Presidency (2019), heart attack.Pré-candidato do PSDB à prefeitura do Rio, ex-ministro Gustavo Bebianno morre em Teresópolis, aos 56 anos *Doriot Anthony Dwyer, 98, American flutist (Boston Symphony Orchestra, National Symphony Orchestra, Los Angeles Philharmonic).Doriot Anthony Dwyer, second ever female principal chair at major U.S. orchestra, dies at 98 *René Follet, 88, Belgian illustrator, comics writer and artist.Décès de l'illustrateur et dessinateur René Follet *Jon Atle Gaarder, 85, Norwegian diplomat, Ambassador to Saudi Arabia (1984–1990), India (1990–1994) and Lithuania (1999–2001).Jon Atle Gaarder *Giancarlo Ghironzi, 88, Sammarinese politician, Captain Regent (1961, 1969–1970).Si è spento Giancarlo Ghironzi *Mubashir Hassan, 98, Pakistani politician, Minister of Finance (1971–1974).Founding PPP member Mubashir Hasan passes away in Lahore: family sources *Phil Phillips, 94, American singer and songwriter (\"Sea of Love\").Philip Baptiste *John L. Pickitt, 86, American Air Force lieutenant general, Director of the Defense Threat Reduction Agency (1985–1987).Lieutenant General John L. Pickitt, USAF, Ret. *Eva Pilarová, 80, Czech singer-songwriter.Eva Pilarová. Poslední rozloučení kvůli koronaviru nebude *Genesis P-Orridge, 70, English musician (Throbbing Gristle, Psychic TV) and performance artist (COUM Transmissions), leukaemia.Genesis Breyer P-Orridge Dead at 70 *Mariano Puga, 88, Chilean Roman Catholic priest and human rights activist, lymphoma.El adiós del cura obrero: fallece Mariano Puga a los 88 años *Puthussery Ramachandran, 91, Indian poet.കവി പുതുശ്ശേരി രാമചന്ദ്രൻ അന്തരിച്ചു, വിപ്ലവസാഹിത്യത്തിന്‍റെ മുന്നണിക്കാരിൽ ഒരാൾ *Chris Reed, 30, American-born Japanese Olympic figure skater (2010, 2014), cardiac arrest.Former Japan ice dancing champion Reed dead at 30 ===15=== *Mohammad Ami-Tehrani, 84, Iranian Olympic weightlifter (1960).پیشکسوت وزنه‌برداری درگذشت *Suzy Delair, 102, French actress (Quai des Orfèvres).Suzy Delair (Quai des Orfèvres), doyenne des comédiennes, est morte à 102 ans *Vittorio Gregotti, 92, Italian architect, pneumonia caused from COVID-19.Morto Vittorio Gregotti, maestro dell’architettura del Novecento *Richard L. Hanna, 69, American politician, member of the U.S. House of Representatives from New York (2011–2017), cancer. *Roy Hudd, 83, English actor (The Blood Beast Terror, Up the Chastity Belt, The Alf Garnett Saga) and comedian.Roy Hudd dies aged 83 *Mick Morris, 77, English footballer (Oxford United, Port Vale, Stafford Rangers).Tributes are paid to former Port Vale forward Mick Morris *Aytaç Yalman, 79, Turkish general, General Commander of the Gendarmerie (2000–2002) and Commander of the Turkish Army (2002–2004), COVID-19.Aytaç Yalman’ın corona virüsü nedeniyle öldüğü kesinleşti ===16=== *Nicolas Alfonsi, 83, French politician, MP (1973–1988, 2001–2014) and MEP (1981–1984), COVID-19.Nicolas Alfonsi est décédé *Sergio Bassi, 68–69, Italian rock singer-songwriter, COVID-19.L'addio a Bassi, il menestrello della Bassa che cantava il Po *David Briggs, 102, English educator, Headmaster of King's College School, Cambridge (1959–1977).Broadcaster Anne Atkins reveals death of father in 'extraordinary' and 'moving' Thought for The Day *Menachem Friedman, 83, Israeli sociologist.פרופ' מנחם פרידמן הלך לעולמו *Hashem Bathaie Golpayenagi, 78, Iranian Ayatollah, member of the Assembly of Experts (since 2016), COVID-19.Senior Iranian cleric among those tasked with choosing supreme leader dies of coronavirus infection *Francesco Saverio Pavone, 75, Italian magistrate, COVID-19.Coronavirus, morto Francesco Saverio Pavone, l'ex Procuratore che smantellò la Mala del Brenta *Saskia Post, 59, American-born Australian actress (Sons and Daughters, Dogs in Space, Eugénie Sandler P.I.), cardiac arrest.'Dogs In Space' Star Passes Away *Stuart Whitman, 92, American actor (The Mark, The Comancheros, Those Magnificent Men in their Flying Machines), skin cancer.Actor Stuart Whitman dead at 92: report ===17=== *Vittoria Bogo Deledda, 53, Italian politician, Senator (since 2018), cancer.La senatrice Vittoria Bogo Deledda stroncata da un tumore *Michael Broadbent, 92, British wine critic and writer.Michael Broadbent MW dies aged 92 *Gerald Freedman, 92, American theatre director, librettist and lyricist, kidney failure.Great Lakes Theater Legend Gerald Freedman Dies at 92 *Eduard Limonov, 77, Russian publicist, political writer and dissident, co-founder of National Bolshevik Party and Leader of The Other Russia (since 2010), problems caused from surgery.Умер Эдуард Лимонов *Roger Mayweather, 58, American boxer and boxing trainer, WBA super featherweight (1983–1984) and WBC super lightweight champion (1987–1989), problems caused from diabetes.Floyd Mayweather Uncle Roger Mayweather Dies ... Legendary Boxing Trainer *Manuel Serifo Nhamadjo, 61, Bissau-Guinean politician, Acting President of the National People's Assembly (2009, 2012) and Acting President (2012–2014).Décès de l’ancien président bissau-guinéen Manuel Serifo Nhamadjo *Arvo Sarapuu, 66, Estonian politician, Deputy Mayor of Tallinn (2011–2017), County Governor of Järva County (1989–1997).Lahkus poliitik Arvo Sarapuu *Stephen Schwartz, 78, American pathologist (University of Washington), COVID-19.UW pathologist Stephen Schwartz, 78, dies after COVID-19 hospitalization *Lyle Waggoner, 84, American actor (Love Me Deadly, The Carol Burnett Show, Wonder Woman) and model, problems caused from cancer.Lyle Waggoner dead: Carol Burnett Show and Wonder Woman star dies at 84 *Betty Williams, 76, Northern Irish political activist, Nobel Prize winner (1976).E' morta Betty Williams, premio Nobel e ideatrice della Città della Pace ===18=== *Patrick J. Duggan, 86, American politician and lawyer, Judge of the U.S. District Court for the Eastern District of Michigan (1986–2000).Former Judge Patrick J. Duggan, father of Detroit Mayor Mike Duggan, dies at 86 *Luciano Federici, 82, Italian footballer (Cosenza Calcio, A.C. Pisa 1909), COVID-19.Addio all'ex calciatore Luciano Federici *Catherine Hamlin, 96, Australian physician and philanthropist, co-founder of the Addis Ababa Fistula Hospital.Catherine Hamlin, 'Saint of Addis Ababa', dies at 96 *Emil Karewicz, 97, Polish actor (Stawka większa niż życie, How I Unleashed World War II, Knights of the Teutonic Order).Emil Karewicz nie żyje. Popularny aktor zmarł w wieku 97 lat *Joaquín Peiró, 84, Spanish football player (Atlético Madrid, Roma, national team) and manager.Fallece Joaquín Peiró a los 84 años *Henri Richelet, 75, French painter, COVID-19.Hommage à Henri Richelet, peintre du temps qui passe *John Solomon, 90, Australian rugby union player (national team).Australian Rugby Hall of Famer, former Wallabies skipper John Solomon dies *Thomas A. Wiseman Jr., 89, American politician and lawyer, member of the Tennessee House of Representatives (1964–1968), Tennessee State Treasurer (1971–1974) and U.S. District Judge for the Middle District of Tennessee (1978–1995).U.S. District Middle Tennessee Judge Thomas Wiseman, a 'giant as a jurist,' dies at 89 *Alfred Worden, 88, American astronaut (Apollo 15) and politician, stroke.Apollo Astronaut Al Worden, one of the few who orbited the moon, dies ===19=== *Enrico Decleva, 78, Italian historian, Rector of the University of Milan (2001–2012).Milano: morto Enrico Decleva, rettore Università Statale per 11 anni *Innocenzo Donina, 69, Italian footballer (Reggio Audace, Atalanta, Bari), COVID-19.Coronavirus, muore l'ex Bari Innocenzo Donina *Max Engman, 73, Finnish historian and translator.Max Engman in memoriam *Hamid Kahram, 62, Iranian politician and veterinarian, MP (2000–2004), COVID-19.Former Iran MP Hamid Kahram dies from coronavirus *Richard Tracey, 77, British politician, MP (1983–1997). *Peter Whittingham, 35, English footballer (Cardiff City, Aston Villa, Blackburn Rovers), problems caused by a fall.Peter Whittingham: Cardiff City legend dies aged 35 ===20=== *Cengiz Bektaş, 85, Turkish architect (Mertim) and writer (Evrensel), heart failure.Mimar ve şair Cengiz Bektaş vefat etti *Harry van den Bergh, 77, Dutch politician, MP (1977–1987).Harry van den Bergh (1942-2020) heeft de PvdA nooit losgelaten *Amadeo Carrizo, 93, Argentine footballer (River Plate, Millonarios, national team).Murió Amadeo Carrizo, una leyenda de River *Carlos Falcó, 5th Marquess of Griñón, 83, Spanish nobleman, socialite and businessman, Grandee of Spain, COVID-19.Muere Carlos Falcó, marqués de Griñón, a los 83 años por coronavirus *Willigis Jäger, 95, German Benedictine monk and Zen master.Benediktinermönch und Zen-Meister: Willigis Jäger starb mit 95 Jahren *Shapi Kaziev, 63, Russian historian, screenwriter and playwright, member of the Union of Soviet Writers (since 1989).Умер дагестанский писатель и драматург Шапи Казиев *Ali Habib Mahmud, 81, Syrian military officer, Chief of Staff (2004–2009) and Minister of Defense (2009–2011). *Enrique del Portal, 87, Spanish operatic tenor and actor (Doña Francisquita, Don Gil de Alcalá, La vida breve), gastroenteritis caused by a fall.Muere el tenor Enrique del Portal, víctima de «la otra epidemia», según la viuda *Marino Quaresimin, 82, Italian politician, Mayor of Vicenza (1995–1998), COVID-19.Coronavirus, morto l'ex sindaco Marino Quaresimin *Kenny Rogers, 81, American Hall of Fame country singer-songwriter (\"The Gambler\", \"Coward of the County\", \"Islands in the Stream\") and actor, multi-Grammy winner.Country Music Icon Kenny Rogers Dies at 81 *Robert H. Scarborough, 97, American Coast Guard vice admiral, Vice Commandant of the U.S. Coast Guard (1978–1982).Robert H. Scarborough Jr. *Borislav Stanković, 94, Serbian Hall of Fame basketball player (Partizan) and coach (OKK Beograd, Cantù), Secretary General of FIBA (1976–2003).Borislav Stankovic passes away at age 94 *Vladimír Zábrodský, 97, Czech Hall of Fame ice hockey player (national team, Praha, Sparta Praha), World Champion (1947, 1949) and Olympic silver medalist (1948).CZECH HOCKEY LEGEND VLADIMIR ZÁBRODSKÝ DIES AT 97 ===21=== *Aileen Baviera, 60, Filipino academic, pneumonia caused from COVID-19.Former dean of UP Asian Center dies due to pneumonia, COVID-19 *Dov Ben-Meir, 92, Israeli politician, member of the Knesset (1981–1988).דב בן-מאיר ז\"ל *Vicente Capdevila, 83, Spanish lawyer and politician, Mayor of Hospitalet de Llobregat (1973–1977) and Deputy (1977–1979), COVID-19.Mor per coronavirus l'exalcalde de l'Hospitalet Vicenç Capdevila *Sol Kerzner, 84, South African hotelier, founder of Southern Sun Hotel Group and Sun International, cancer.Sol Kerzner dies after struggle with cancer *Mariko Miyagi, 93, Japanese actress (Panda and the Magic Serpent, Ten Dark Women, Barefoot Gen) and singer, lymphoma.宮城まり子さん死去 「やさしいことはつよいのよ」 *Hiroshi Masuoka, 83, Japanese voice actor (Sazae-san, Anpanman, Dragon Ball Z), rectal cancer.Sazae-san, Anpanman Voice Actor Hiroshi Masuoka Passes Away Due to Cancer at 83 *Jacques Oudin, 80, French politician, Senator (1986–2004), COVID-19.Vendée : les hommages à l’ancien sénateur Jacques Oudin, décédé *Soundaraj Periyanayagam, 69, Indian Roman Catholic prelate, Bishop of Vellore (since 2006).Bishop of Vellore Dr Soundararaju (70) Passes Away *Lorenzo Sanz, 76, Spanish sports administrator, President of Real Madrid (1995–2000), COVID-19.Former Real Madrid president Lorenzo Sanz dies age 76 after coronavirus infection *Hellmut Stern, 91, German violinist (Berlin Philharmonic), problems caused by Parkinson's disease.Zum Tod des Geigers Hellmut Stern Der musizierende Weltbürger ===22=== *Petru Bogatu, 68, Moldovan journalist and writer, cancer.S-a stins din viață jurnalistul Petru Bogatu *Germà Colón, 91, Spanish philologist, COVID-19.S’ha mort el lingüista Germà Colón, víctima de la Covid-19 *Gabi Delgado-López, 61, Spanish-born German singer-songwriter (Deutsch Amerikanische Freundschaft) and composer.Gabi Delgado (DAF) ist tot *Julie Felix, 81, American-British folk singer and guitarist.American-born folk singer Julie Felix dies aged 81 *Ciprian Foias, 86, Romanian mathematician. *Benito Joanet, 84, Spanish football player (RCD Espanyol, Real Zaragoza) and coach (RCD Mallorca), COVID-19.Fallece Benito Joanet, víctima del coronavirus *Serena Liu, 44, Taiwanese actress (How Much Sorrow Do You Have, The Rise of the Tang Empire) and dancer, problems caused by heart valve repair surgery.快訊／劉真等不到心臟病逝！ 享年44歲 *Carmen de Mairena, 87, Spanish transformist actress, cuplé singer and television personality.Muere Carmen de Mairena, pionera del transformismo y estrella de 'Crónicas Marcianas' *James Martin Munley, 83, American politician and lawyer, Judge of the U.S. District Court for the Middle District of Pennsylvania (1998–2009).’A terrible loss:’ U.S.Judge James M. Munley dies at 83, is second Middle District judge to die this month *Daniel Edward Pilarczyk, 85, American Roman Catholic prelate, Archbishop of Cincinnati (1982–2009) and President of the U.S. Conference of Catholic Bishops (1989–1992).Archbishop Emeritus Daniel Pilarczyk has passed away *Harkishan Singh, 91, Indian pharmaceutical chemist. *Ronnie Thompson, 85, American politician and country singer, Mayor of Macon, Georgia (1967–1975).Former Macon Mayor Ronnie Thompson passes away *Eric Weissberg, 80, American folk singer (\"Dueling Banjos\") and guitarist (The Tarriers), problems caused by Alzheimer's disease.Eric Weissberg, 'Dueling Banjos' Musician, Dead at 80 *Jürg Zeltner, 52, Swiss banking executive (KBL), brain cancer.Jürg Zeltner has succumbed to a brain tumor ===23=== *Alberto Arbasino, 90, Italian writer, essayist and politician, Deputy (1983–1987).Morto Alberto Arbasino, lo scrittore aveva 90 anni *Maurice Berger, 63, American cultural historian and art critic, heart failure caused by COVID-19.The Jewish Museum Remembers Maurice Berger (1956–2020) *Lucia Bosè, 89, Italian actress (No Peace Under the Olive Tree, Story of a Love Affair, Rome 11:00), Miss Italia (1947), pneumonia caused by COVID-19.È morta Lucia Bosé. La ragazza di piazza di Spagna amata da Visconti e Antonioni *Carlo Casini, 85, Italian politician, Deputy (1979–1994) and MEP (1984–1999, 2006–2014), problems caused by ALS.E' morto Carlo Casini, fondatore del Movimento per la Vita *Branko Cikatić, 65, Croatian heavyweight kickboxer and actor (Skyscraper), K-1 World Grand Prix champion (1993), problems caused by Parkinson's disease.Kickbokslegende Branko Cikatic (65) overleden: ‘Mijn hart huilt’ *David Collings, 79, British actor (Scrooge, The Thirty Nine Steps, The Invisible Woman).RIP David Collings *Maurice Delbez, 97, French movie director (Dans l'eau qui fait des bulles).Maurice Delbez (1922-2020) *José Folgado, 75, Spanish businessman and politician, President of Red Eléctrica de España (2012–2018), Deputy (2000, 2004–2008) and Mayor of Tres Cantos (2007–2012), COVID-19.Muere el ex-presidente de Red Eléctrica José Folgado por coronavirus *Tristan Garel-Jones, 79, British politician, MP (1979–1997), Minister for Europe (1990–1993) and Treasurer of the Household (1989–1990).Tristan Garel- Jones, Tory ‘wet’ and able deputy chief whip under Margaret Thatcher – obituary *Jack Jones, 95, Australian footballer (Essendon), cancer.Beloved Essendon figure Jack Jones dies aged 95 *Pyotr Lysenko, 88, Belarusian archaeologist.Умер археолог, открывший древнее Берестье и Туровский крест, который обещал восстановить президент *Lucien Sève, 93, French philosopher and political activist (French Communist Party), COVID-19.Disparition. Lucien Sève s’est éteint. *Stanley Sporkin, 88, American politician and lawyer, Judge of the U.S. District Court for the District of Columbia (1985–1999), congestive heart failure.Stanley Sporkin, Ex-Head of SEC Enforcement Unit, Dies at 88 *William Stern, 84, Hungarian-born British businessman, COVID-19.'Devastating': vicar and headteacher among latest UK coronavirus victims (death announced on this date) ===24=== *Lorenzo Acquarone, 89, Italian lawyer and politician, MP (1987–2006), COVID-19.Coronavirus, è morto a Genova il professor Lorenzo Acquarone *John Davies, 90, Australian-American Hall of Fame swimmer and politician, Olympic champion (1952), Judge of the U.S. District Court for the Central District of California (1986–1998), cancer.John G. Davies, 90, Retired Judge Of U.S. District Court, Dies *Manu Dibango, 86, Cameroonian saxophonist (\"Soul Makossa\"), COVID-19.Le saxophoniste Manu Dibango est mort des suites du Covid-19, annoncent ses proches *William Dufris, 62, American voice actor (Patlabor: The Movie, Rocky and the Dodos, Bob the Builder), cancer.Voice Actor William Dufris Passes Away Due to Cancer *John Eriksson, 91, Swedish footballer (Djurgården, national team).John \"Jompa\" Eriksson har gått ur tiden *Mohamed Farah, 59, Somali footballer (national team), COVID-19. *Alan Finder, 72, American journalist (The New York Times), COVID-19.Former New York Times reporter Alan Finder dies of coronavirus *David Greetham, 78, English-American literary critic and essayist.The Graduate Center Mourns the Loss of Retired Professor David Greetham *Alfred Gomolka, 77, German politician, Minister-President of Mecklenburg-Vorpommern (1990–1992), President of the German Bundesrat (1991–1992) and MEP (1994–2008), fall.Erster Regierungschef von MV: Alfred Gomolka verstorben *Stuart Gordon, 72, American movie director (Re-Animator, From Beyond, Dagon), multiple organ failure caused by kidney disease.Stuart Gordon, Cult Classic Horror Director, Dies at 72 *Terrence McNally, 81, American playwright (Ragtime, Kiss of the Spider Woman, Love! Valour! Compassion!) and screenwriter, Tony winner (1993, 1995, 1996), COVID-19.Multiple Tony-winning playwright Terrence McNally dies at 81 *Juan Padrón, 73, Cuban comics artist (Elpidio Valdés) and animator (Vampires in Havana), lung disease.Fallece en Cuba el reconocido realizador audiovisual Juan Padrón *Bill Rieflin, 59, American rock drummer (Ministry, Revolting Cocks, King Crimson), cancer.Bill Rieflin, Drummer for King Crimson, Ministry, R.E.M., Dies at 59 *Tony Rutter, 78, British motorcycle racer, Formula TT world champion (1981–1984).Racing legend Tony Rutter sadly passes away *Edward Tarr, 83, American trumpeter and educator, Grammy winner, problems caused by heart surgery.Trauer um den Trompeter und Musikwissenschaftler Edward H. Tarr *Ignacio Trelles, 103, Mexican football player (Necaxa) and manager (Toluca, national team), heart attack.Murió Ignacio Trelles a los 103 años, mítico entrenador del fútbol mexicano *Albert Uderzo, 92, French comic book artist (Asterix, Oumpah-pah), heart attack.Francia, è morto Albert Uderzo: fu il disegnatore di Asterix ===25=== *Harry Aarts, 90, Dutch politician, MP (1973–1993), COVID-19.CDA'er en Brabander in hart en nieren Harry Aarts (90) overleden aan coronavirus *Edman Ayvazyan, 88, Iranian-Armenian painter, COVID-19.London-based Armenian painter Edman Ayvazian passed away *William Bartholomay, 91, American insurance executive, owner of the Milwaukee and Atlanta Braves.Bill Bartholomay has died *Floyd Cardoz, 59, Indian-American chef (Top Chef Masters), COVID-19.Famed Chef Floyd Cardoz Dies of Coronavirus at 59 *Hugh Conaghan, 93, Irish politician, TD (1977–1989).Former Donegal TD Hugh Conaghan dies aged 93 *Nemai Ghosh, 85, Indian photographer (Goopy Gyne Bagha Byne, Agantuk), problems caused by surgery.Nemai Ghosh (1934-2020): ‘Boswell with a camera’ dies at 86 *Paul Goma, 84, Romanian-Moldovan writer, political dissident (Charter 77) and critic, COVID-19.Scriitorul Paul Goma, ucis de coronavirus. Disidentul a murit într-un spital din Paris *Bob Lee, 82, American baseball player (California Angels).Robert Dean Lee *Robert Levinson, 58–72, American FBI intelligence agent, missing since 2007.FBI agent Robert Levinson dies 'in Iranian custody,' family announces (death announced on this date) *Liesbeth List, 78, Dutch pop singer, actress and television personality. *Inna Makarova, 93, Russian actress (The Young Guard, The Return of Vasili Bortnikov, The Rumyantsev Case).Умерла народная артистка СССР Инна Макарова *Detto Mariano, 82, Italian musician (I Ribelli) and composer, COVID-19.È morto Detto Mariano, ha composto canzoni per Celentano, Mina e Battisti *Vusamazulu Credo Mutwa, 98, South African traditional healer, writer and conspiracy theorist.Credo Mutwa passes on at 98 years old *Nimmi, 87, Indian actress (Aan, Mere Mehboob, Pooja Ke Phool), heart attack.Veteran actor Nimmi dies at 87, Rishi Kapoor and Mahesh Bhatt lead Bollywood in paying tribute *Richard Reeves, 83, American political writer, columnist (Universal Press Syndicate) and correspondent (The New York Times), cardiac arrest.Richard Reeves, Columnist and Author on Presidents, Dies at 83 *Mike Stratton, 78, American football player (Buffalo Bills, San Diego Chargers), heart attack caused by a fall.Bills 50th All-Time team member Mike Stratton passes *Farzaneh Taidi, 74–75, Iranian actress (Not Without My Daughter), cancer.فرزانه تأییدی، بازیگر سینما و تئاتر در تبعید درگ *Terry Tausch, 61, American football player (Minnesota Vikings, San Francisco 49ers).Football great Terry Tausch passes away *Jean-Yves Veillard, 81, French historian.Rennes. Jean-Yves Veillard, ancien conservateur du musée de Bretagne, est décédé ===26=== *Joe Baltake, 74, American movie critic (Sacramento Bee, Philadelphia Enquirer), multiple myeloma. *Jean-Louis Bernard, 81, French politician, Mayor of Orléans (1988–1989) and MP (1993–2012).Ancien maire d'Orléans, le docteur Jean-Louis Bernard est décédé *MaryAnn Black, 76, American politician, member of the North Carolina House of Representatives (since 2017), cancer.NC Rep. MaryAnn Black, a former Durham County commissioner, dies at 76 *Mark Blum, 69, American actor (Crocodile Dundee, Desperately Seeking Susan, You), COVID-19.Mark Blum, Star of ‘Desperately Seeking Susan’ and ‘You,’ Dies at 69 Due to Coronavirus Complications *Princess Maria Teresa of Bourbon-Parma, 86, Spanish royal, COVID-19.Muere por coronavirus María Teresa de Borbón-Parma, la «princesa roja» *Jenny Clack, 72, English palaeontologist.Jenny Clack *Martinho Lutero Galati, 66, Brazilian conductor, COVID-19.Maestro Martinho Lutero Galati de Oliveira morre em São Paulo após contrair coronavírus *Satish Gujral, 94, Indian painter and sculptor. *Michel Hidalgo, 87, French football player (Monaco, Reims) and manager (national team).L'ancien sélectionneur de l'équipe de France Michel Hidalgo est décédé *Rolf Huisgen, 99, German chemist, discovered 1,3-Dipolar cycloaddition.Rolf Huisgen (1920 – 2020) *Rade Mihaljčić, 83, Serbian historian and academic.Preminuo akademik Rade Mihaljčić *Curly Neal, 77, American basketball player (Harlem Globetrotters).Harlem Globetrotter legend Fred “Curly” Neal passes away *John O'Leary, 70, Irish golfer and executive (PGA European Tour), winner of Irish Open (1982).Former Irish Open champion John O'Leary passes away *John Sears, 79, American political strategist and lawyer, heart attack.John Sears, Strategist for Nixon and Reagan, Dies at 79 *Michael Sorkin, 71, American architect, critic and writer, COVID-19.Michael Sorkin, visionary and incisive architect, educator, critic, has passed away from COVID-19 *Manuel del Valle, 80, Spanish lawyer and politician, Mayor of Seville (1983–1991), leukaemia.Muere Manuel del Valle, el exalcalde de Sevilla que rediseñó la ciudad *Naomi Munakata, 64, Japanese-Brazilian conductor, COVID-19.Naomi Munakata, maestrina titular do Coral Paulistano, morre aos 64 anos por coronavirus em SP *Hamish Wilson, 77, Scottish actor (Doctor Who) and radio producer (Radio Forth, Radio Clyde), COVID-19.A tribute to my good friend Hamish Wilson *Jimmy Wynn, 78, American baseball player (Houston Astros, Los Angeles Dodgers, Atlanta Braves).Legendary Astros outfielder Jimmy Wynn dies at age 78 ===27=== *Jacques F. Acar, 88, French physician, scientific editor (Clinical Microbiology and Infection) and microbiologist, COVID-19.Jacques F. Acar (1931 – 2020 *Roberto Alemann, 97, Argentine politician, Minister of Economy (1961–1962, 1981–1982).Murió Roberto Alemann, ministro de Economía de Frondizi y del genocida Galtieri *Bob Andy, 75, Jamaican reggae singer-songwriter (The Paragons, Bob and Marcia) and actor (The Mighty Quinn). *Daniel Azulay, 72, Brazilian comic book artist and cartoonist, COVID-19.Desenhista Daniel Azulay morre no Rio vítima de coronavírus *Mirna Doris, 79, Italian singer, heart failure caused by diabetes.Mirna Doris è morta, l'annuncio della clinica: la regina della canzone napoletana stroncata da un cancro *Harriet Glickman, 93, American schoolteacher, inspired the first black character in Peanuts, problems caused by myelodysplastic syndrome.Peanuts: Harriet Glickman, Who Inspired Franklin's Creation, Passes Away *Les Hunter, 77, American basketball player (Baltimore Bullets, Miami Floridians, Loyola Ramblers), National Champion (1963), cancer.Les Hunter, star on 1963 Loyola title team, dies at 77 *Hamed Karoui, 92, Tunisian politician, Minister of Justice (1988–1989) and Prime Minister (1989–1999).Dernière minute: Décès de Hamed Karoui à 92 ans *Joseph Lowery, 98, American minister and activist, President of the Southern Christian Leadership Conference (1977–1997). *Lanny D. Schmidt, 81, American chemist, member of the National Academy of Engineering (since 1994).In Memoriam: Lanny Schmidt, Regents Professor Emeritus ===28=== *Roger Baens, 86, Belgian racing cyclist.Décès à 87 ans de l'ancien coureur Roger Baens, ex- équipier de Rik Van Looy *John Callahan, 66, American actor (All My Children, Falcon Crest, Days of Our Lives), stroke.R.I.P. John Callahan - 'All My Children' Star Dead at 66 *Tom Coburn, 72, American politician, member of the U.S. House of Representatives from Oklahoma's 2nd congressional district (1995–2001) and U.S. Senator (2005–2015), prostate cancer.Former U.S. Sen. Tom Coburn dies at 72 *Matthew Faber, 47, American actor (Welcome to the Dollhouse, The Pallbearer, Natural Born Killers).Actor Matthew Faber Dead at 47 *Chato Galante, 71–72, Spanish political prisoner and human rights activist, COVID-19.Muere por coronavirus el activista y expreso político madrileño Chato Galante *Grim Sleeper, 67, American serial killer.'Grim Sleeper' Serial Killer Lonnie Franklin Dies in California Prison Cell *Jan Howard, 91, American country singer-songwriter (\"The One You Slip Around With\", \"For Loving You\", \"Evil on Your Mind\"), pneumonia.Jan Howard, Grand Ole Opry Stalwart, Dead at 91 *Dan McCauley, 84, British football chairman (Plymouth Argyle). *Monroe G. McKay, 91, American politician and lawyer, Judge of the U.S. Court of Appeals for the Tenth Circuit (since 1977). *Barbara Rütting, 92, German actress (Doctor Sibelius, Town Without Pity, Turtledove General Delivery) and politician, member of the Landtag of Bavaria (2003–2009).Autorin, Schauspielerin und Politikerin Barbara Rütting ist tot *Thomas Schäfer, 54, German politician, Minister of Finance of Hesse (2010–2020), suicide by train.Hessens Finanzminister Thomas Schäfer ist tot *David Schramm, 73, American actor (Wings, Johnny Handsome, Kennedy), heart attack.David Schramm, Star of ’90s Sitcom ‘Wings,’ Dies at 73 *Edoardo Vesentini, 91, Italian mathematician (Andreotti-Vesentini theorem) and politician, Director of the Scuola Normale Superiore di Pisa (1978–1987) and Senator (1987–1992).E' morto Edoardo Vesentini, direttore emerito della Scuola Normale Superiore di Pisa ===29=== *Attilio Bignasca, 76, Swiss politician, National Councilor (2003–2009).È morto Attilio Bignasca *Philip W. Anderson, 96, American physicist (Anderson localization, Anderson Hamiltonian, Anderson orthogonality theorem), Nobel Prize winner (1977).20世纪物理学巨人、诺奖得主菲利普安德森逝世，享年96岁 *Yuri Bondarev, 96, Soviet-born Russian novelist, essayist and screenwriter (Liberation).Умер писатель Юрий Бондарев *José Luis Capón, 72, Spanish footballer (Atlético Madrid, Elche, national team), COVID-19.Fallece Jose Luis Capón por coronavirus, histórico lateral del Atlético de Madrid *Jean- François Cesarini, 49, French politician, Deputy (since 2017), cancer.Vaucluse : le député Jean-François Cesarini est décédé à 49 ans *Daniel Davisse, 81, French politician, Mayor of Choisy-le-Roi (1996–2014) and General Councilor (2004–2011), COVID-19.Daniel Davisse, ancien maire PCF de Choisy-le-Roi, emporté par le Covid-19 *Patrick Devedjian, 75, French politician, Mayor of Antony (1983–2002) and President of the General Council of Hauts-de-Seine (since 2007), COVID-19.Coronavirus : Patrick Devedjian, président des Hauts- de-Seine et ancien ministre, est mort du Covid-19 *Joe Diffie, 61, American country singer-songwriter (\"Home\", \"Third Rock from the Sun\", \"Pickup Man\"), Grammy winner (1998), COVID-19.Joe Diffie, Nineties Country’s ‘Pickup Man,’ Dead at 61 *Robert H. Garff, 77, American businessman and politician, member (1978–1987) and Speaker of the Utah House of Representatives (1985–1987), COVID-19.Utah business titan Bob Garff dies from COVID-19, his daughter says *Henry C. Gonzalez, 84, American politician, mayor of South Gate, California (1983, 1987, 1998, 1999, 2004, 2009).Henry C. Gonzalez, former South Gate mayor who survived a gunshot to the head, dies at 84 *Maria Mercader, 54, American news producer (CBS, 60 Minutes, CBS Sunday Morning), COVID-19.CBS mourns longtime journalist Maria Mercader, who died at 54 from coronavirus *Alan Merrill, 69, American rock singer (Arrows), songwriter (\"I Love Rock 'n' Roll\") and musician, COVID-19.Alan Merrill, ‘I Love Rock ‘N Roll’ Writer, Dies at 69 *Joseph A. O'Hare, 89, American Jesuit priest, editor (America) and educator, President of Fordham University (1984–2003), problems caused by liver cancer.Joseph A. O’Hare, S.J., former editor of America and president of Fordham, dies at 89 *Krzysztof Penderecki, 86, Polish composer (Threnody to the Victims of Hiroshima, Anaklasis, Utrenja) and conductor, multi-Grammy winner.Nie żyje Krzysztof Penderecki. Wybitny polski kompozytor i dyrygent miał 86 lat *James Ramsden, 96, British politician, MP (1954–1974), Secretary of State for War (1963–1964) and Minister for the Armed Forces (1964). *Francis Rapp, 93, French medieval historian and editor, member of the Academy of Inscriptions and Fine Letters (since 1993), COVID-19.Nécrologie. Francis Rapp s’en est allé, emporté par le Covid-19 *Isaac Robinson, 44, American politician, member of the Michigan House of Representatives (since 2019), suspected COVID-19.State Rep. Isaac Robinson dies of suspected coronavirus infection *Ken Shimura, 70, Japanese comedian (The Drifters) and television personality (Kato-chan Ken-chan Gokigen TV), COVID-19. ===30=== *Joe Ashton, 86, British politician, MP (1968–2001). *Maurice Bidermann, 87, Belgian-born French businessman and philanthropist, COVID-19.L’industriel Maurice Bidermann, frère de Régine et figure de l’affaire Elf, est mort *Lorena Borjas, 59, Mexican-American transgender rights activist, COVID-19.Lorena Borjas, Pioneering Transgender Latina Activist in NYC, Dies From COVID-19 *Henry Brabham, 90, American Hall of Fame ice hockey executive, co-founder of the ECHL.ECHL Mourns Loss of League Co-Founder, Hall of Fame member Henry Brabham *Arianne Caoili, 33, Filipino-Australian chess player, car crash.Aronian’s wife, Arianne Caoili, dies aged 33 *Tomie dePaola, 85, American children's writer (Strega Nona), illustrator (26 Fairmount Avenue), and television personality (Telling Stories with Tomie dePaola), problems caused by a fall.Strega Nona’ author Tomie dePaola is dead at age 85 *Louise Ebrel, 87, French singer (Les Ramoneurs de menhirs) and guitarist.Louise Ebrel, grande voix de la chanson en Bretagne s'est éteinte *William Gianelli, 101, American politician, lawyer and engineer, U.S. Assistant Secretary of the Army for Civil Works (1981–1984).IN MEMORIAM: WILLIAM R. GIANELLI *Manolis Glezos, 97, Greek resistance fighter and politician, MEP (1984–1985, 2014–2015), heart failure.Greek Resistance Hero Manolis Glezos Dies at 98 *Hau Pei-tsun, 100, Taiwanese military officer and politician, Chief of the General Staff (1981–1989) and Premier (1990–1993), multiple organ failure.Former Premier Hau Pei-tsun dies at 100 *Milutin Knežević, 71, Serbian Orthodox prelate, Bishop of Australia and New Zealand (2003–2006) and Valjevo (since 2006), COVID-19.В Сербии от коронавируса скончался епископ Валевский *Riachão, 98, Brazilian samba composer and singer, suspected heart attack.Com poucas pessoas para evitar aglomeração, sambista Riachão é sepultado sob aplausos em Salvador *Bill Withers, 81, American Hall of Fame singer- songwriter (\"Lean on Me\", \"Use Me\", \"Ain't No Sunshine\"), Grammy winner (1972, 1982, 1988), heart disease. *Joachim Yhombi-Opango, 81, Congolese politician, President (1977–1979) and Prime Minister (1993–1996), COVID-19.Coronavirus : décès de l'ex-président congolais Yhombi Opango ===31=== *Mark Azbel, 87, Soviet-born Israeli physicist.В Израиле умер известный физик Марк Азбель *Jim Bailey, 90, Australian Olympic athlete (1956).Vale: Jim Bailey – 1956 Olympian *Pierre Bénichou, 82, French journalist.Mort de Pierre Bénichou, ancien dirigeant de « L’Obs » et chroniqueur des « Grosses Têtes » *Julie Bennett, 88, American actress (What's Up, Tiger Lily?, The Yogi Bear Show, Sole Survivor), COVID-19.‘The Yogi Bear Show’ Voice Actress Julie Bennett Dies At 88 Of COVID-19 *Zev Buffman, 89, Israeli theatre producer, President and CEO of Ruth Eckerd Hall (2011–2018), pancreatic cancer.Ruth Eckerd Hall's Former President and CEO Zev Buffman Passes Away At Age 89 *Michel Chodkiewicz, 90, French writer and educator, Director-General of Éditions du Seuil (1977–1989).Fransız İslam düşünürü Michel Chodkiewicz vefat etti *Pape Diouf, 68, Senegalese journalist and football administrator, president of Olympique de Marseille (2005–2009), COVID-19.De nombreux joueurs réagissent à la mort de Pape Diouf *Rafael Gómez Nieto, 99, Spanish Civil War veteran and member of the French resistance, last living member of La Nueve, COVID-19.Fallece el último superviviente de la compañía que liberó París de los nazis *James Gordon, Baron Gordon of Strathblane, 83, Scottish businessman and politician, founder of Radio Clyde, COVID-19.Radio Clyde founder sadly passes away due to coronavirus *Andrew Jack, 76, British dialect coach (The Lord of the Rings, GoldenEye) and actor (Star Wars), COVID-19.Star Wars Actor Andrew Jack Dies From Coronavirus *Abdul Halim Khaddam, 87, Syrian politician, Vice President (1984–2005), Acting President (2000) and Minister of Foreign Affairs (1970–1984), heart attack. *Eva Krížiková, 85, Slovak actress (In the Coat of Lioness' Arms).Zomrela slovenská herečka Eva Krížiková, mala 85 rokov *Reimar Lüst, 97, German astrophysicist, President of the Max Planck Society (1972–1984) and General-Director of the European Space Agency (1984–1990).Souveräner Steuermann der Wissenschaft *Ivo Mahlknecht, 80, Italian Olympic alpine skier (1964, 1968).Ski-Pionier Ivo Mahlknecht ist tot *Vincent Marzello, 68, American actor (The Witches, Never Say Never Again, Bob the Builder), problems caused by dementia.The Witches star Vincent Marzello dies aged 68 *Zoltán Peskó, 83, Hungarian conductor and composer.Elhunyt Peskó Zoltán világhírű magyar karmester *Gita Ramjee, 63, Ugandan-South African HIV prevention researcher, COVID-19.Renowned SA scientist Gita Ramjee dies of complications due to Covid-19 *James A. Redden, 91, American lawyer and politician, Oregon State Treasurer (1973–1977), Attorney General (1977–1980) and Judge of the U.S. District Court for the District of Oregon (since 1980), congestive heart failure. *Wallace Roney, 59, American jazz trumpeter, COVID-19. *Kiyoshi Sasabe, 62, Japanese movie director (Chirusoku no natsu, Half a Confession, Town of Evening Calm, Country of Cherry Blossoms), problems caused by a fall.「半落ち」佐々部清監督、死去 62歳 *Jack Schofield, 72, British technology journalist (The Guardian), heart attack.Jack Schofield, Guardian's Ask Jack tech columnist, dies at 72 ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths from the 2019–20 coronavirus pandemic ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *03 Deaths",
 "title": "Deaths in March 2020"
}