{
 "id": "736687",
 "text": "Holly Marie Willoughby (born 10 February 1981) is a British television presenter, model and author. She works for ITV. She is best known as for being a co-presenter of This Morning (from 2009–2023) and Dancing on Ice (2006–2011, 2018–present) alongside Phillip Schofield (2007–2023) and Stephen Mulhern. Willoughby and Schofield are presenting duos known as Holly & Phillip. == Career == In 2000, she became a presenter on the children's TV channel CITV. She became famous from this and was chosen to present Dancing on Ice with Phillip Schofield. Willoughby and Schofield also began co-hosting the show This Morning together. From 2008 to 2020, she was a team captain on ITV2's Celebrity Juice alongside Fearne Cotton. From 2012 to 2015, Willoughby presented the series Surprise Surprise. Other TV work includes The Xtra Factor (2008–2009), The Voice UK (2012–2013) and Play to the Whistle (2015–2017). In 2018, she hosted the eighteenth series of I'm a Celebrity...Get Me Out of Here! alongside Declan Donnelly. In September 2022, following the death of Elizabeth II, many members of the public formed a queue to see the Queen's coffin. Holly Willoughby and Phillip Schofield were spotted by many skipping the queue and going inside the building where the coffin was. This made many people angry. In early 2023, Phillip Schofield and Holly Willoughby were reported to be arguing. Not long after, Schofield resigned after it was revealed he had an affair with an employee over thirty years younger than him. Willoughby now presents This Morning alone with a selection of other presenters. On 10 October 2023, she announced that she was leaving This Morning. == Murder plot == On 4 October 2023, a man was arrested after he was suspected of plotting to kidnap and kill Holly Willoughby. The following day, Willoughby was taken into police protection and did not appear on TV, with Alison Hammond filling in her role. == Personal life == Willoughby was born in Brighton. She married Dan Baldwin in 2007. The couple have three children. Willoughby is dyslexic. ==References== ==Other websites== * * Category:1981 births Category:Living people Category:BBC television presenters Category:English models Category:English television presenters Category:Entertainers from Brighton Category:ITV presenters Category:People with dyslexia",
 "title": "Holly Willoughby"
}