{
 "id": "736880",
 "text": "U.S. Route 101, or U.S. Highway 101, (US 101) is a north–south United States Numbered Highway that goes along the West Coast of the United States. It goes through the states of California, Oregon, and Washington. It goes alongside, and often joins onto, California State Route 1 when going through California. Unlike most other 3 digit routes in the system which are treated as spurs of their two digit parent routes, US 101 is treated as a two digit Route with a first digit of \"10\". The reason for this was that if the west coast highway was numbered US 91, there would be no room to establish US 93, US 95, US 97, and US 99, all of which must be west of US 91. So, they decided to call the west coast highway US 101 instead. The '10' could have been underlined so that people think that this route is a two digit route rather than a spur route of US 1, the US Highway on the east coast. The route starts in Los Angeles at the junction of the Interstate 5, Interstate 10, and California State Route 60. It goes west past the north side of Downtown Los Angeles towards the coast. It meets the coast near Oxnard and goes north along the coast from here. The main cities it passes through in California is Santa Maria, San Jose, San Francisco, Santa Rosa, and Eureka, California. In San Francisco, the route goes over the Golden Gate Bridge. The main cities the route passes in Oregon is North Bend, Florence, Newport, and Astoria. These cities are small, as no large cities are on Oregon's coast. It runs near to the Interstate 5, which goes through larger cities like Salem and Portland. In Washington, the main cities it passes through is Aberdeen, Forks and Port Angeles. It ends at the Interstate 5 in Olympia. The route is about in total. The route used to be the main highway along the West Coast, but now most people use the Interstate 5 to go along the coast. The US 101 used to go south to San Diego, but the part of the US 101 between here and Los Angeles was totally replaced by the I-5 in the 1960s. When it first opened, the US 101 used small roads that had already been built. In 1933, a new highway with bridges and ramps was built so it was faster for people to use. ==Important intersections== ;California : in Los Angeles : in Los Angeles : in Los Angeles : in Los Angeles : in San Jose : in San Jose : on the San Bruno–South San Francisco city line : in San Francisco : in San Francisco : in San Rafael : northeast of Crescent City ;Oregon : in Newport : northeast of Cannon Beach : in Astoria ;Washington : in Aberdeen : in Tumwater ==Related pages== *British Columbia Highway 101 ==References== Category:Roads in California Category:Roads in Oregon Category:Roads in Washington (state) Category:U.S. Highways",
 "title": "U.S. Route 101"
}