{
 "id": "736944",
 "text": "The Kong Meng San Phor Kark See Monastery (also the Bright Hill Pujue Chan Monastery) (), is a Buddhist temple located at Bright Hill Road in Bishan, Singapore. Built by Zhuan Dao in the early 20th century to propagate Buddhism and to provide lodging for monks, this monastery is the largest Buddhist temple in Singapore. ==History== Between 1920 and 1921, the Monastery was built on the a plot of land in Thomson Road that was donated by Tay Woo Seng, a Chinese businessmen. It was the first traditional Chinese forest monastery to be built in Singapore. Its name was taken from Kong Meng San (\"Bright Hill\", formerly \"Hai Nan Mountain\"), the place where the monastery is located at. The original temple consisted of a two-storey building, a shrine room, a visitors' room and living quarters. In 1980, the temple began to build Evergreen Bright Hill Home, which opened in 1983, with the donation of S$5.3 million from Hong Choon's followers, He Hui Zhong's family's company. The monastery opened the Buddhist College of Singapore on 13 September 2006. As the country's first Buddhist college, it offers a four-year bachelor's degree in Buddhism. Lessons were held within the temple until a new $35 million five- storey building is completed. On 21 June 2008, the temple raised over $1 million for the reconstruction of schools destroyed in the 12 May Sichuan earthquake, by organising the Great Compassion; Great Aspiration Charity Show. ==Present day== ===Premises=== The modern day monastery premises consist of prayer halls, crematorium and columbarium which contains over 200,000 niches, bell and drum towers, and an outdoor statue of Avalokitesvara stands between the Dharma Hall and the Pagoda of 10,000 Buddhas. The Hong Choon Memorial Hall of the temple was built in 2004. Another notable feature of the monastery is a Bodhi Tree which was brought from the sacred Bodhi tree at Anuradhapura, Sri Lanka. The tree in Sri Lanka was brought from Bodh Gaya, India where Shakyamuni Buddha was said to have attained enlightenment. The large bronze Buddha statue, located in the temple's Hall of No Form, is one of Asia's largest Buddha statue. It has a height of and it weighs . ===Practices, charities and events=== The monastery celebrates Vesak Day every year with a variety of ceremonies such as \"Bathing the Buddha\", and \"Three-Steps-One-Bow\". Other major events include the Qingming Festival. As the East Asian traditional practice of burning incense and joss materials remain despite repeated pleas and discouragement, costlier alternatives appeared which include the installation of a new four-storey, $1 million eco-friendly burner in 2014. When Singapore's founding Prime Minister Lee Kuan Yew died in 2015, the monastery conducted the primary Buddhist prayer service on 26 March 2015 together with the Singapore Buddhist Federation, ==References== ==Other websites== * Category:1921 establishments Category:Buddhist temples",
 "title": "Kong Meng San Phor Kark See Monastery"
}