{
 "id": "737436",
 "text": "Jenna Marie Ortega (born September 27, 2002) is an American actress. She is noted for her roles on television as young Jane in Jane the Virgin, Harley Diaz in Stuck in the Middle and Ellie Alves in You. In 2016, she began voicing Princess Isabel in the Disney Channel animated series Elena of Avalor. Ortega's movie work includes starring as Annie in Insidious: Chapter 2 (2013), Mary Ann in The Little Rascals Save the Day (2014) and Dawn in Saving Flora (2018). In 2022, she became well known for playing Wednesday Addams in the Netflix series Wednesday. In 2024, she appeared in Beetlejuice Beetlejuice. ==Filmography== === Film === Year Title Role Notes 2013 Iron Man 3 Vice President's daughter Insidious: Chapter 2 Annie 2014 Direct-to-video film 2015 After Words 2018 Saving Flora Dawn 2019 Wyrm Suzie 2020 2021 Yes Day 2022 Scream Studio 666 X American Carnage Camila Montes 2023 Scream VI Finestkind Mabel 2024 Miller's Girl Cairo Sweet Remi Post-production; also executive producer Astrid Deetz Post-production Klara Post-production Ridley Post-production; also executive producer Post-production; also executive producer === Television === Year Title Role Notes 2012 Rob Girl Episode: \"The Baby Bug\" CSI: NY Episode: \"Unspoken\" 2013 Days of Our Lives Hayley Episode: \"12062\" 2014 Rake Recurring role 2014–2019 Jane the Virgin Recurring role 2015 Richie Rich Darcy Main role 2016–2018 Stuck in the Middle Lead role 2016–2020 Elena of Avalor Main voice role 2016 Elena and the Secret of Avalor Voice role; television film 2018 Bizaardvark Izzy Episode: \"The BFF (Before Frankie Friend)\" 2019–2023 Big City Greens Voice role; 6 episodes 2019 You Main role (season 2) 2020 Home Movie: The Princess Bride Episode: \"Chapter Six: The Fire Swamp\" 2020–2022 Jurassic World Camp Cretaceous Brooklynn Main voice role 2022–present Wednesday Lead role; also executive producer (season 2) 2023 Saturday Night Live Herself (host) Episode: \"Jenna Ortega/The 1975\" === Music videos === * \"Chapstick\" (2017), by Jacob Sartorius == Awards and nominations == Award Year Category Nominated work Result AACTA Awards 2024 Audience Choice Favourite Actress Austin Film Critics Association Awards 2023 The Robert R. \"Bobby\" McCurdy Memorial Breakthrough Artist Award The Fallout, Scream, X, and Studio 666 Critics' Choice Super Awards 2023 Best Actress in a Horror Series Wednesday 2024 Best Actress in a Horror Movie Scream VI Dorian Awards 2023 Rising Star Award Fangoria Chainsaw Awards 2023 Best Supporting Performance Scream Golden Globe Awards 2023 Best Actress in a Television Series – Musical or Comedy Wednesday Hollywood Critics Association Midseason Film Awards 2022 Best Actress The Fallout Imagen Awards 2016 Best Young Actor – Television Stuck in the Middle 2018 Best Young Actor – Television Stuck in the Middle 2019 Best Young Actor – Television Stuck in the Middle 2021 Best Actress – Feature Film Yes Day 2023 Best Actress – Comedy (Television) Wednesday MTV Movie & TV Awards 2022 Most Frightened Performance Scream 2023 Best Performance in a Show Wednesday Best Hero Wednesday Best Duo Wednesday Nickelodeon Kids' Choice Awards 2023 Favorite Female TV Star (Family) Wednesday People's Choice Awards 2024 The Drama Movie Star of the Year Scream VI Primetime Emmy Awards 2024 Outstanding Lead Actress in a Comedy Series Wednesday Saturn Awards 2024 Best Performance by a Younger Actor in a Television Series Wednesday Screen Actors Guild Awards 2023 Outstanding Performance by a Female Actor in a Comedy Series Wednesday == Notes == == Sources == *https://www.fernsehserien.tv/serien-mit- jenna-ortega.shtml == References == Category:People from Palm Desert, California Category:Actors from California Category:2002 births Category:Living people Category:American child actors Category:American movie actors Category:American voice actors Category:American television actors",
 "title": "Jenna Ortega"
}