{
 "id": "73750",
 "text": "Supergiants are some of the largest stars in the universe. They are larger than giant stars, and less luminous than hypergiants. They vary greatly in size. They are towards the top of the Hertzsprung–Russell diagram, a graph showing star development. Some are only 50 million kilometers across, small enough to fit inside the orbit of Mercury. The largest and brightest supergiants, also called hypergiants, are 2,200 million km across, between the sizes of the orbits of Jupiter and Saturn. Supergiants are the old forms of old main sequence stars that had a high mass. These expanded when hydrogen ran out for fusion in their core to become red and blue supergiants. Typically, when the hydrogen in the core runs out, the star becomes a blue supergiant and then a red supergiant when hydrogen fusion occurs in a layer surrounding the core. When helium fusion starts, the red supergiant becomes a blue supergiant again. When the core becomes multi-layered with heavier elements being produced by fusion, it may turn into a red supergiant again. However, supergiants may go through the red-blue supergiant cycle numerous times, and both red and blue supergiants can end their life in a supernova explosion.https://arxiv.org/abs/0906.2284 Yellow supergiants are the rarest supergiant type and are not stable. However, they are still important stars and include the Cepheid variables. They are likely just a midway point when a red supergiant changes to a blue supergiant and vice versa. Larger and brighter yellow supergiants are called yellow hypergiants.https://arxiv.org/abs/astro-ph/9910164 ==Examples== Supergiants are rare but easy to find because they are so bright. Many stars in the night sky that the naked eye can see are rare supergiants. ===Blue=== * Rigel * Deneb * Alnilam * Many stars in the Jewel Box Cluster * Rho Leonis ===Yellow=== * Polaris * Gamma Cygni * Delta Canis Majoris * Epsilon Aurigae * Betelgeuse (3000-2000 years ago)https://academic.oup.com/mnras/article/516/1/693/6651563 The yellow supergiants famously include the Cepheid variables. ===Red=== * Antares * Betelgeuse * Epsilon Pegasi * Zeta Cephei * VV Cephei A == References ==",
 "title": "Supergiant"
}