{
 "id": "7375",
 "text": "The White Stripes were an American rock duo from Detroit, Michigan. There were two people in the band: Jack White (songwriter, vocals, guitar, piano, and bass) and Meg White (drums, percussion, and vocals). They are influential in the 2000s indie rock and garage rock revival. The White Stripes started in Detroit, and released two albums: their self-titled debut (1999) and De Stijl (2000). They became famous with their third album, White Blood Cells (2001). Their fourth album, Elephant (2003), won the Grammy Award for Best Alternative Music Album. Their last two albums, Get Behind Me Satan (2005) and Icky Thump (2007), each won the same award. After a break, they ended in 2011. The White Stripes were known for presenting in strictly red, white, and black colors, and their frequent use of the number three. Jack and Meg White were married when they started the band, but divorced after its formation. They did not want people to know that they were once married, and told the public that they were brother and sister. == Members == * Jack White – vocals, guitar, keyboards, piano, bass, percussion * Meg White – drums, percussion, vocals == Awards == The White Stripes won a lot of awards. They won three Grammy Awards and five MTV Video Music Awards. Two of their albums are on Rolling Stone's \"500 Greatest Albums of All Time\" list. Rolling Stone called them the sixth greatest duo of all time. == Discography == Studio albums * The White Stripes (1999) * De Stijl (2000) * White Blood Cells (2001) * Elephant (2003) * Get Behind Me Satan (2005) * Icky Thump (2007) == References == == Other websites == * Category:1990s establishments in Michigan Category:1997 establishments in the United States Category:1990s American music groups Category:2000s American music groups Category:2010s American music groups Category:2011 disestablishments in the United States Category:American punk bands Category:American rock bands Category:Blues bands Category:American Grammy Award winners Category:Musical duos Category:Musical groups disestablished in 2011 Category:Musical groups established in 1997 Category:Musical groups from Detroit",
 "title": "The White Stripes"
}