{
 "id": "737950",
 "text": "The Chordettes were a female popular singing quartet, usually singing a cappella. Their songs were mainly traditional popular music. They are best known for their hit songs \"Mr. Sandman\" and \"Lollipop\". ==Singles== Year Single (A-side, B-side) Both sides from same album except where indicated Chart positions Album U.S. U.S. R&B; U.S. AC UKNugent, Stephen / Fowler, Anne / Fowler, Pete (1976): Chart Log of American/British Top 20 Hits, 1955-1974. In: Gillett, Charlie / Frith, Simon (ed.): Rock File 4. Frogmore, St. Albans: Panther Books, p. 113f 1954 \"Mr. Sandman\" b/w \"I Don't Wanna See You Cryin'\" (Non-album track) 1Whitburn, Joel (1973): Top Pop Records 1940-1955. Menomonee Falls, Wisconsin: Record Research, p. 13 3 11 The Chordettes 1955 \"Lonely Lips\" b/w \"The Dudelsack Song\" (Non-album track) 7 All the Very Best of the Chordettes \"Humming Bird\" b/w \"I Told a Lie\" (Non-album track) 9 The Chordettes 1956 \"The Wedding\" b/w \"I Don't Know, I Don't Care\" (Non-album track) 91Whitburn, Joel (1994): Top Pop Singles 1955-1993. Menomonee Falls, Wisconsin: Record Research Ltd., p. 112 5 All the Very Best of the Chordettes \"Eddie My Love\" b/w \"Whistlin' Willie\" (Non-album track) 14 3 The Chordettes \"Born to Be with You\" b/w \"Love Never Changes\" 5 4 8 \"Lay Down Your Arms\" / 16Whitburn, Joel (2005): The Billboard Book Of Top 40 Hits. 7. überarbeitete und erweiterte Auflage, New York City, New York: Billboard Books, p. 129 2 \"Teen Age Goodnight\" 45 8 1957 \"Come Home to My Arms\" b/w \"(Fifi's) Walkin' the Poodle\" (Non-album track) 7 \"Echo of Love\" b/w \"Like a Baby\" (from The Chordettes) 56 Non-album track \"Just Between You and Me\" / 8 8 The Chordettes \"Soft Sands\" 73 1 \"Baby of Mine\" b/w \"Photographs\" 3 Non-album tracks 1958 \"Lollipop\" b/w \"Baby, Come-a Back-a\" (Non-album track) 2 3 6 All the Very Best of the Chordettes \"Zorro\" b/w \"Love Is a Two-Way Street\" (Non-album track) 17 5 1959 \"No Other Arms, No Other Lips\" b/w \"We Should Be Together\" (Non-album track) 27 6 \"A Girl's Work Is Never Done\" b/w \"No Wheels\" (Non-album track) 89 0 1960 \"A Broken Vow\" b/w \"All My Sorrows\" — 4 Non-album tracks 1961 \"Never on Sunday\" / 13 2 4 Never on Sunday \"Faraway Star\" 90 5 All the Very Best of the Chordettes \"The Exodus Song\" b/w \"Theme from 'Goodbye Again'\" 6 Never on Sunday 1962 \"The White Rose of Athens\" b/w \"Adios\" 5 Non-album tracks \"In the Deep Blue Sea\" b/w \"All My Sorrows\" 1 1963 \"True Love Goes On and On\" b/w \"All My Sorrows\" 8 ==References== ==Notes: The Chordettes originally started off as a quartet but multiple people come and go thruout the bands lifetime== ==Other websites== * Picture and names of The Chordettes * * * The Chordettes' page on the Primarily A Cappella site * Chordette Lynn Evans harmonizes in classroom while a teacher * * Chordettes sing \"Lollipop\" and \"Mr. Sandman\" on the Saturday Night Beech-Nut Show, February 22, 1958 * Carol Buschmann Interview NAMM Oral History Library (2010) * Dorothy Schwartz Interview NAMM Oral History Library (2010) Category:Musicians from Wisconsin Category:People from Sheboygan, Wisconsin",
 "title": "The Chordettes"
}