{
 "id": "737988",
 "text": "The Kingdom of Aksum (), also known as the Kingdom of Axum or the Aksumite Empire, was an ancient kingdom centered in what is now Eritrea and the Tigray Region of northern Ethiopia.The wealth of Africa – The kingdom of Aksum – Teachers’ notes britishmuseum.org Axumite Emperors were powerful sovereigns, styling themselves King of kings, king of Aksum, Himyar, Raydan, Saba, Salhen, Tsiyamo, Beja and of Kush.Dr. Stuart Munro-Hay, Aksum: An African Civilisation of Late Antiquity. Chap. 11, Inscription DAE 8 Ruled by the Aksumites, it existed from approximately 80 BC to AD 825. It was centered in the city of Axum and grew from the proto-Aksumite Iron Age period around the 4th century BC. It became important by the 1st century AD. Aksum became a major player on the commercial route between the Roman Empire and Ancient India. The Aksumite rulers made trade easier by minting their own Aksumite currency. The state also assumed its hegemony over the declining Kingdom of Kush. It also regularly entered the politics of the kingdoms on the Arabian Peninsula and eventually extended its rule over the region with the conquest of the Himyarite Kingdom. The Manichaei prophet Mani (died 274 AD) regarded Axum as one of the four great powers of his time; the others were Persia, Rome, and China.Daily Life in Aksum eduplace.com The Aksumites built monumental stelae, which served a religious purpose in pre-Christian times. One of these granite columns is the largest such structure in the world, at 90 feet. Under Ezana (fl. 320–360) Aksum adopted Christianity. In the 7th century, early Muslims from Mecca sought refuge from Quraysh persecution by travelling to the kingdom, a journey known in Islamic history as the First Hijra. The kingdom's ancient capital, also called Axum, is now a town in Tigray Region (northern Ethiopia). The Kingdom used the name \"Ethiopia\" as early as the 4th century.Paul B. Henze, Layers of Time: A History of Ethiopia, 2005. Tradition claims Axum as the alleged resting place of the Ark of the Covenant and the purported home of the Queen of Sheba. ==References== Category:History of Africa Category:Former monarchies of Africa Category:1st-century BC establishments Category:960s disestablishments",
 "title": "Kingdom of Aksum"
}