{
 "id": "738250",
 "text": "Marcella is a British television show about a detective in London. The main actor is Anna Friel and she plays as the person Marcella Backland. The show is in the \"noir\" style which means that serious, sexual or shocking things might happen. In the past Marcella Backland worked for the police and her job was to be a detective. This means she was a person who found the people who did crimes. Marcella stopped her job to start a family. Now she returns to her job and there is an open case from 11 years ago. This means there was a crime, but the police are still looking for the person who did it. In this example, a person who killed many people in the past stopped doing it for a while, but now the killer has started again. It is important for Marcella and the police to find the killer to stop them, or other people may die. Marcella also has problems about herself. She ended her marriage with her husband, and she has blackout episodes where she is sick and can not remember things. This is tough for her and she does not know what to do about the marriage or the illness. Hans Rosenfeldt made the show. He made important decisions about it like writing what the people say, telling the actors what to do, and organizing the people making the show. He also made The Bridge which is another TV show and also in the \"noir\" style. The show started for the first time in April 2016 and had eight episodes. There was a second group of eight episodes in 2018, and a third group of eight episodes in 2021. It is a serial show, which means that the episodes are connected one after the other, and it is better to watch them in order. The company that sent it to the television is called ITV. ==References== ==Other websites== * Category:2016 television series debuts Category:2010s British drama television series Category:British crime drama television series Category:Detective television series Category:ITV television programmes Category:Television series set in London Category:English-language television programs Category:2020s British drama television series",
 "title": "Marcella (TV series)"
}