{
 "id": "738249",
 "text": "William Sami Étienne Girgahcine (born 13 June, 1986), better known by his stage name DJ Snake, is a French DJ from Algeria and record producer who mixes hip hop and electronic music. He gained international success with the singles \"Bird Machine\" and \"Turn Down For What\" in 2013. He collaborated with Dillon Francis and Diplo in 2014. \"Bird Machine\" is a collaboration with French act Alesia. The song was released in February 2013 on Mad Decent, a Los Angeles- based record label run by Diplo. In June 2013, DJ Snake was invited by Diplo to do a live mix on his radio show \"Diplo & Friends\" which airs on BBC Radio 1. == Career == === Lady Gaga === In 2011, Snake produced an album for Lady Gaga. He also co-produced the Lady Gaga songs \"Applause\" and \"Do What U Want\" featuring R. Kelly. === Singles released === In 2013, he released \"Bird Machine\" with Alesia and \"Turn Down For What\" with Lil Jon. On 11 February 2014, he collaborated with Dillon Francis on his single \"Get Low\". In March 2015, he collaborated with American electronic dance music trio Major Lazer on their single \"Lean On\". He released \"Talk\" with George Maple and \"Let Me Love You\" with Justin Bieber in 2016. He also released \"Taki Taki\" with Selena Gomez, Cardi B, and Ozuna. Also he released songs with Sean Paul and Young Thug. === Remixes === As a remixer, Snake has made remixes for artists, including AlunaGeorge, Kanye West, Major Lazer, Duck Sauce, Junior Senior, amongst others. == Discography == === 2013 === * \"Turn Down For What\" (with Lil Jon) === 2014 === * \"Get Low\" (with Dillon Francis) === 2015 === * \"Lean On\" (with Major Lazer) * \"Middle\" (with Bipolar Sunshine) === 2016 === * \"Talk\" (with George Maple) * \"Let Me Love You\" (featuring Justin Bieber) === 2018 === * \"Taki Taki\" (with Selena Gomez, Cardi B and Ozuna) === Remixes === * AlunaGeorge - \"You Know You Like It\" * Junior Senior - \"Move Your Feet\" * Major Lazer - \"Bubble Butt\" ==References== Category:French DJs Category:Hip hop musicians Category:Living people Category:Musicians from Paris Category:Pop musicians Category:French record producers Category:Trap musicians Category:1986 births",
 "title": "DJ Snake"
}