{
 "id": "738433",
 "text": "Edmonson County is a county in the U.S. state of Kentucky. As of the 2020 census, the population was 12,126. Its county seat is Brownsville. This is a dry county where the sale of alcohol is prohibited. == History == The county was formed on January 12, 1825 from land given by Grayson, Hart and Warren counties and named for Captain John \"Jack\" Edmonson (1764–1813), who was killed at the Battle of Frenchtown during the War of 1812. == Geography == According to the U.S. Census Bureau, the county has a total area of , of which is land and (1.7%) is water. === Bordering counties === * Grayson County (north) * Hart County (east) * Barren County (southeast) * Warren County (southwest) * Butler County (west) === National protected area === * Mammoth Cave National Park == Demographics == As of the census of 2020, there were 12,126 people living in the county. The population density was . There were 6,358 housing units at an average density of . The racial makeup of the county was 95.2% White, 0.8% Black or African American, 0.3% Native American, 0.3% Asian, 0.5% from other races, and 3.0% from two or more races. 1.3% of the population were Hispanic or Latino of any race. There were 4,885 households out of which 29.9% had children under the age of 18 living with them, 54.5% were married couples living together, 5.7% were unmarried couples living together, 22.5% had a female householder with no husband present, and 17.4% had a male householder with no wife present. 25.4% of all households were made up of individuals and 12.4% had someone living alone who was 65 years of age or older. The average household size was 2.48. In the county, the population was spread out with 21.6% under the age of 18, 8.1% from 18 to 24, 22.5% from 25 to 44, 28.2% from 45 to 64, and 19.5% who were 65 years of age or older. The median age was 43 years. For every 100 males there were 100.6 females. For every 100 males age 18 and over, there were 102.2 females. In 2021, the median income for a household in the county was $41,533, and the median income for a family was $55,351. The per capita income for the county was $23,329. About 10.7% of families and 16.9% of the population were below the poverty line, including 14.0% of those under age 18 and 14.3% of those age 65 or over. == Communities == === City === * Brownsville (county seat) === Unincorporated communities === * Asphalt * Bee Spring * Big Reedy * Cedar Spring * Chalybeate * Huff * Lincoln * Lindseyville * Ollie * Pig * Rhoda * Rocky Hill * Roundhill (partly in Butler County) * Straw * Sunfish * Sweeden * Windyville == References == Category:1825 establishments in Kentucky Category:Kentucky counties",
 "title": "Edmonson County, Kentucky"
}