{
 "id": "73864",
 "text": "In Christianity, an archbishop is an important bishop. The jurisdiction or area governed by an archbishop is called a metropolis (or metropolitan (arch)diocese). In the Catholic Church, when a bishop becomes an archbishop, he does not receive any additional Holy Orders or other sacrament. == Catholicism == In the Catholic Church, archbishops usually oversee archdioceses, which are important regions or cities. While an archbishop takes precedence over a regular bishop, his sacramental role remains the same, have an equal rank to the bishop, and reports to the Pope. Like regular bishops, archbishops are responsible for maintaining the unity of the church within their own jurisdiction and may also have involvement over multiple dioceses, especially those that are part of the metropolitan province and have connection with the archdiocese. The head of an archdiocese is often called a metropolitan archbishop. Although not all archbishops and regular bishops are cardinals, some archbishops, especially those in large or important cities, may be appointed as cardinals by the Pope. The title archbishop ad personam is an honorary title and it is granted to a bishop who is appointed as an archbishop but does not have jurisdiction over a specific archdiocese. The title Archbishop Emeritus is given to retired archbishops who continue to hold their title without active jurisdiction. == Orthodox Church == In the Eastern Orthodox Church, archbishops often oversee large or historically important areas. The structure may vary, as in some Orthodox traditions, archbishops are ranked lower than metropolitans. == Anglican Communion == In the Anglican Communion, archbishops hold similar responsibilities to those in the Catholic Church. The most notable example is the Archbishop of Canterbury, who is considered the spiritual leader of the Church of England and the Anglican Communion worldwide. == Related pages == * Archbishop ad personam * Nuncio * Titular bishop * Auxiliary bishop == References == Category:Christian religious occupations Category:Bishops by type",
 "title": "Archbishop"
}