{
 "id": "738607",
 "text": "Taarak Mehta Ka Ooltah Chashmah ( Taarak Mehta's inverted spectacles; sometimes abbreviated as TMKOC) is an Indian Hindi Language television sitcom. One of India's longest running television shows, it is produced by Neela Tele Films. The show went on air on 28 July 2008. It airs from Monday to Saturday on SAB TV. Reruns of the show started on Sony Pal from 2 November 2015. The show is based on the column Duniya Ne Undha Chashma written by columnist and journalist/playwright Taarak Mehta for the Gujarati weekly magazine Chitralekha. == Plot == The series takes place at the Gokuldham Co-operative Society, an apartment complex in Powder Gali, Goregaon East, Mumbai around Gada Family which consists of a successful businessman Jethalal Champaklal Gada, his father Champaklal Jayantilal Gada, his wife Daya and their naughty son Tipendra Gada (Tapu) who is the leader of his friend circle called \"Tapu Sena.\" Jethalal calls his father Champaklal to keep an eye on Tapu but the opposite happens and he joins hands with Tapu. Most of the episodes are based on Jethalal being stuck in a problem and Taarak Mehta, his best friend, helps him out of it whom Jethalal calls \"Fire Brigade.\" The show covers topical issues which are socially relevant. The residents of Gokuldham faces daily life problems and finds solutions for it but with a moral value too in a hilarious manner. Although Gokuldham Society consists of 50 flats but the show mostly focuses on the lives of the families, that are of; Jethalal Champaklal Gada, a Gujarati; Taarak Mehta, who is from Rajasthan; Aatmaram Tukaram Bhide, who belongs to Marathi culture; Dr. Hansraj Hathi, a Bihari overweight doctor; Krishnan Iyer, a scientist from Chennai but has a Bengali wife; Roshan Singh Sodhi, A Punjabi but has a Parsi wife and Patrakaar Popatlal from Bhopal, a bachelor from eleven years. They always help each-other in their problems, to promote Unity in Diversity. == Cast and Characters == Main Gada Family: Dilip Joshi as Jethalal Champaklal Gada (2008-present) Disha Vakani/Kajal Pisal as Daya Jethalal Gada (2008-2017/2025-present) Amit Bhatt as Champaklal Jayantilal Gada (2008-present) Bhavya Gandhi / Raj Anadkat / Nitish Bhaluni as Tipendra Jethalal Gada (Tapu) (2008-2017/2017-2022/2023-present) Mehta Family: Shailesh Lodha / Sachin Shroff as Taarak Mehta (2008-2022 / 2022-present) Neha Mehta / Sunanya Fozdar as Anjali Mehta (2008-2020/2020-present) Iyer Family: Tanuj Mahashabde as Krishnan Subramaniam Iyer (2008-present) Munmun Dutta as Babita Iyer (2008-present) Bhide Family: Mandar Chandwadkar as Aatmaram Tukaram Bhide (2008-present) Sonalika Joshi as Madhavi Aatmaram Bhide (2008-present) Jheel Mehta / Nidhi Bhanushali / Palak Sidhwani / Khushi Mali as Sonalika Aatmaram Bhide (Sonu) (2008-2012/2012-2019/2019-2024/2024-present) Sodhi Family: Gurcharan Singh / Laad Singh Mann / Balvinder Singh Suri as Harjeet Singh Sodhi (2008-2013,2014-2020/2013-2014/2020-present) Jennifer Mistry Banshiwal / Dilkhush Reporter / Monaz Mevawala as Roshan Kaur Sodhi (2008-2013,2016-2023/2013-2016/2023-present) Samay Shah as Gurcharan Singh Sodhi (Gogi) (2008-present) Hathi Family: Nirmal Soni / Kavi Kumar Azad as Dr. Hansraj Hathi (2008-2009,2018-present/2009-2018) Ambika Ranjankar as Komal Hathi (2008-present) Kush Shah / Dharmit Turakhiya as Gulabkumar Hathi (Goli) (2008-2024/2024-present) Others: Azhar Shaik as Pankaj Diwan Sahay (Pinku) (2008-present) Sharad Sankla as Abdul (2008-present) Shyam Pathak as Patrakar Popatlal Bhagwati Pandey (2009-present) Ghanashyam Nayak / Kiran Bhatt as Natwarlal Prabhashankar Udhaiwala (Nattu Kaka) (2008-2020, 2021/2022-present) Tanmay Vekaria as Bagheshawar Dadukh Udhaiwala (Bagha) (2011-present) Monika Bhadoriya / Navina Wadakar as Bawri Dhondulal Kanpuria (2013-2019/2023-present) Mayur Vakani as Sundarlal (2008-present) Priya Ahuja / Mihika Verma as Rita Srivastava (2009-2010,2013-present/2010-2013) Daya Shankar Pandey as Inspector Chalu Pandey (2010-present) Asitkumarr Modi as himself (2008-present) Guests ==References== Category:2010s Indian television series Category:2020s Indian television series Category:Soap operas",
 "title": "Taarak Mehta Ka Ooltah Chashmah"
}