{
 "id": "739526",
 "text": "Giovanni Dall'Orto (21 July 1958) is an italian historian, journalist and pro- gay activist. According to William A. Percy, he is, by common consent, the leading scholar of the history of homosexuality in Italy.Giovanni Dall’Orto , Encyclopedia of Homosexuality. == Biography == Born in Milan, Dall'Orto became a gay activist in 1976, committing himself increasingly also to history and scholarship. In 1981 he wrote the first book about AIDS published in Italy. From 1985 to 1998 he published extensively in the monthly Babilonia: he was general editor of this magazine from 1997 to 1998. From 1999 onwards he has worked with the monthly Pride, of which he serves as general editor. He has had great success in enriching the gay aspects of the Italian edition of Wikipedia. He has also collaborated in the realization of two LGBT encyclopedias: Encyclopaedia of Homosexuality (1990) and Who's Who in Gay and Lesbian History: From Antiquity to World War II (2000). In 2012 he founded Wikipink, a gay encyclopedia that is part of the \"Wiki\" project.Francesco Bennardo, Giovanni Dall'Orto on Wikipink. After a long study and research work, in May 2015 he published Tutta un'altra Storia: a book about the history of homosexuality from antiquity to the second post-war period in which, for the first time in the history of Italy, topics relating to the daily life of gay life over the centuries are fathomed. His H-Index is 10.Giovanni Dall'Orto on googlescholar. == Bibliography == *Leggere omosessuale. Bibliografia, Edizioni Gruppo Abele, Torino 1983; *Aids [with Dr. Riccardo Ferracini], Edizioni Gruppo Abele, Torino 1985 [four editions]; *La pagina strappata. Interviste su omosessualità e cultura, Edizioni Gruppo Abele, Torino 1985; *Figli diversi (with his mother, Paola Dall'Orto), Sonda, Torino 1991 [fourth edition: 1999]; *Manuale per coppie diverse, Editori Riuniti, Roma 1994 [two editions]; *Tutta un'altra storia, il Saggiatore, Milán 2015. == Other websites == * La gaya scienza, official website. * A caccia di guay, personal blog. * Youtube Channel * In altre parole, a series of interviews with Dall'Orto, done in 2016 == References== Category:1958 births Category:Living people Category:Italian historians Category:Italian journalists Category:Italian LGBT people",
 "title": "Giovanni Dall'Orto"
}