{
 "id": "73964",
 "text": "John Sidney McCain III (August 29, 1936 – August 25, 2018) was an American politician. He was a United States Senator from Arizona. McCain was the Republican Party's candidate in the 2008 United States presidential election. McCain married businesswoman Cindy McCain in 1980. McCain's father and grandfather had been Admirals in the United States Navy. His great-great- grandfather was a slave owner in Mississippi. He served as a naval aviator during the Vietnam War. When his plane was shot down, he was captured by the North Vietnamese military. He was a prisoner of war with Colonel and future Washington State Senator Leo K. Thorsness for more than five years. During that time, he was tortured. == Politics == In 1982, McCain was elected to the United States House of Representatives. He represented Arizona. In 1987, he became a U.S. Senator for Arizona. In 2000, McCain tried to be the Republican Party candidate for President of the United States, but George W. Bush was chosen. In 2008, he was chosen as the Republican candidate. His running mate was Sarah Palin. He opposed several foreign policies of the Obama administration. On November 4, 2008, he lost to Barack Obama. McCain was popular for his support of the Arab Spring, protests and uprisings inside the Arab World, and protests outside those regions like many Russian protests. He said that the recent protests were worldwide and he encouraged intervention in the Syrian civil war. ==Health== In July 2017, McCain under went surgery to remove a blood clot, causing Senate Majority Leader Mitch McConnell to delay a vote on the Better Care Reconciliation act to replace Obamacare.Mattingly, Phil et al. \"McConnell delays health care vote while McCain recovers from surgery\", CNN (July 16, 2017). On July 19, 2017, it was announced McCain had glioblastoma, an aggressive brain cancer. On April 15, 2018, he underwent surgery for an infection complicated by diverticulitis and the following day was reported to be in stable condition. On August 24, 2018, McCain's family announced that he was stopping treatment for his brain cancer. McCain died the next day at his home in Cornville, Arizona, four days before his 82nd birthday. == Legacy == After McCain's death, Senate Minority Leader Chuck Schumer (D-NY) announced that he would introduce a resolution to rename the Russell Senate Office Building after McCain. ==Notes== ==References== Category:1936 births Category:2018 deaths Category:American aviators Category:American Baptists Category:American military personnel of the Vietnam War Category:Arizona Republicans Category:Cancer deaths in Arizona Category:Deaths from glioblastoma Category:Prisoners of war Category:Purple Heart recipients Category:2000 United States presidential candidates Category:2008 United States presidential candidates Category:Torture victims Category:United States representatives from Arizona Category:United States senators from Arizona Category:Republican Party (United States) politicians",
 "title": "John McCain"
}