{
 "id": "739694",
 "text": "Long division is a method of dividing two numbers, using repeated multiplications and subtractions in a tableau. Because it is easy to do, it is usually taught in schools. There are other methods which are faster, or easier to program with a computer, but they are more difficult to understand and perform manually. If we have a large or complicated division problem, we can use long division to break it down into a series of easier calculations. Long division can also be done on polynomials as well. == Overview == As with most division problems we have three numbers: the dividend, our first number; the divisor, the second number we divide it by; and the quotient, which is the result. Long division is a kind of algorithm, which means it helps us to find the solution to a problem by following a set of clearly-defined steps: # First, we need to split our first number (dividend) into a separate number for each digit. If our dividend is 123, then we would split this into 1, 2 and 3. # Next, we need to divide each of these digits by our second number (divisor). If our divisor is 8, then we would do 1 / 8, 2 / 8, followed by 3 / 8. #* If the division has a remainder, then the remainder is carried to the next step. #* If the division is less than 0 (for example. when trying to divide a small number by a large number), then the dividend, instead of the remainder, is carried to the next step. # Once all of the numbers have been processed, every result (quotient) would then be combined into a single number again. For example. if the quotients are 7, 8 and 2, then the final result would be 782. #* Any leftover remainders make up the decimal part of the answer. == Examples == === Basic case === Let's assume we want to divide 780 by 4. To do so with long division, we need to split 780 into digits -- 7 and 8 and 0 -- and then divide each one by 4, carrying any remainders to the next step. 7 / 4 = _1_ R 3 \\-- since we have a remainder of 3, we have to carry this down. 38 / 4 = _9_ R 2 \\-- we carry our remainder of 2 down. 20 / 4 = _5_ R 0 -- we have reached the end. By using long division, we have found that 780 / 4 = _195_. === Complex case === Let's perform a similar calculation where our numbers do not divide easily: 468 / 12 4 / 12 = 0 R 0 -- we cannot perform this division as 4<12, so we have to carry our dividend like a remainder. 46 / 12 = _3_ R 10 \\-- we carry our remainder of 10 down. 108 / 12 = _9_ R 0 -- we have reached the end. By the same process we have found that 468 / 12 = _39_. === Decimal Answers === Let's follow the same process for numbers that give an answer with a decimal because they don't have common factors: 123 / 8 1 / 8 = 0 R 0 -- we cannot perform this division as 1<8, so we have to carry our dividend like a remainder. 12 / 8 = _1_ R 4 \\-- we carry our remainder of 4 down. 43 / 8 = _5_ R 3 \\-- we have reached the end with a remainder, which we have to add to our final answer. 123 / 8 = _15_ R 3, which equals 15.375 (15 3/8). ==Related pages== * Chunking, a different type of long division done in the UK. * Divisor, a number which evenly divides another number * Short division, a faster version of long division done with smaller numbers. * Synthetic division, an alternate algorithm for polynomial long division == References == Category:Algorithms Category:Arithmetics",
 "title": "Long division"
}