{
 "id": "740567",
 "text": "The 2021 Christian Democratic Union leadership election is set to take place during the Christian Democratic Union party's 33rd Congress. It was set to take place in Berlin on the 25 April 2020, following Annegret Kramp- Karrenbauer's decision in February 2020 to resign as Leader of the party. However, the election was delayed due to the coronavirus pandemic. On 14 September 2020, it was announced that the election would be held as a one-day meeting on 4 December 2020, during which the leadership election would take place. In October 2020, it was postponed again to 15 and 16 January 2021. ==Background== After her announcement, Norbert Röttgen surprisingly announced on 18 February 2020 his intention to run for the leadership. This was followed by a joint announcement on 25 February 2020 by Armin Laschet and Jens Spahn, in which Spahn endorsed Laschet for the leadership and Laschet announced his intention to stand. A couple of hours later on 25 February 2020 Friedrich Merz in turn announced his intention to stand for the leadership of the party. == Candidates == === Declared === Name Offices held State Announcement date Armin Laschet Minister President of North Rhine-Westphalia (2017-present) Deputy Leader of the Christian Democratic Union (2012-present) Leader of the Christian Democratic Union in North Rhine-Westphalia (2012-present) 25 February 2020 Friedrich Merz Leader of CDU/CSU Group in the Bundestag/Leader of the Opposition (2000-2002) Member of the Bundestag (1994-2009) Member of the European Parliament (1989-1994) 25 February 2020 Norbert Röttgen Chair of the Bundestag Foreign Affairs Committee (2014-present) Member of the Bundestag (1994-present) Federal Minister for the Environment, Nature Conservation and Nuclear Safety (2009-2012) Deputy Leader of the Christian Democratic Union (2010-2012) Leader of the Christian Democratic Union in North Rhine-Westphalia (2010-2012) 18 February 2020 ==References== Category:2021 elections in Europe Category:January 2021 events Category:Elections in Germany Category:2021 in Germany",
 "title": "January 2021 Christian Democratic Union of Germany leadership election"
}