{
 "id": "740666",
 "text": "Attica is a town in Harper County, Kansas, United States. In 2020, 516 people lived there. The town was named after the historical area of Attica, in Greece. ==History== Land for the City of Attica was bought in late June 1884. It became the end of the Atchison, Topeka, and Santa Fe Railway. The town was incorporated on February 16, 1885, and 1,500 people lived there. More people came to Attica until the Cherokee Outlet in northern Oklahoma was opened by a Land run in 1893. Many people moved south to that area. On May 12, 2004, the town was damaged by an F4 tornado. It was shown on an episode of Shockwave on the History Channel. ==Geography== Attica is at (37.242124, -98.227489). The United States Census Bureau says that the city has a total area of . All of it is land. ===Weather=== Attica has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Attica has a humid subtropical climate, shortened to \"Cfa\" on climate maps.Climate Summary for Attica, Kansas ==People== ===2020 census=== The 2020 census says that there were 516 people, 218 households, and 127 families living in Attica. Of the households, 72.9% owned their home and 27.1% rented their home. The median age was 47.6 years. Of the people, 90.1% were White, 2.1% were Native American, 0.4% were Asian, 1.6% were from some other race, and 5.8% were two or more races. Hispanic or Latino of any race were 5.8% of the people. ===2010 census=== The 2010 census says that there were 626 people, 246 households, and 155 families living in Attica. ===2000 census=== The 2000 census says that there were 636 people, 254 households, and 154 families living in Attica. ==Education== Attica is served by USD 511 Attica Public Schools. The Attica High School mascot is the Bulldogs. ==References== ==Other websites== ;City * City of Attica * Attica - Directory of Public Officials ;Schools * USD 511, local school district ;Maps * Attica City Map , KDOT Category:Cities in Harper County, Kansas Category:1884 establishments in Kansas",
 "title": "Attica, Kansas"
}