{
 "id": "741028",
 "text": "\"Stupid Love\" is a song recorded by American singer Lady Gaga. It was the lead single from her sixth studio album, Chromatica, known to her fans as \"LG6\". The song was officially released on February 28, 2020, although it was leaked online a few weeks earlier. Gaga wrote the song with well-known pop songwriter Max Martin, Ely Rise, and its producers, BloodPop and Tchami. Reviewers have said that the song marked a return to dance-pop for Gaga, after she released Joanne in 2016, which contained country influences. Writing for The Atlantic, Spencer Kornhaber called \"Stupid Love\" \"a glorious comeback,\" \"irrepressible,\" and \"fantastic.\" Dan Adler from Vanity Fair said that the song \"suggests a return to the thunderous high-concept anthems that shaped Gaga’s initial rise.\" Courteney Larocca from Business Insider writes that Gaga's inflection of the chorus \"I want your stupid love\" creates a double entendre, sounding instead like, \"I want just to be loved.\" The song entered the Australian ARIA Chart at number seven and the UK and US charts at number five. == Charts == === Weekly charts === Weekly chart performance for \"Stupid Love\" Chart (2020) Peak position Bolivia (Monitor Latino) 16 Bulgaria (PROPHON) 9 Costa Rica (Monitor Latino) 11 Croatia (HRT) 2 Ecuador (National-Report) 15 El Salvador (Monitor Latino) 1 Estonia (Eesti Tipp-40) 11 Greece (IFPI) 10 Latvia (Latvijas Radio) 4 Lebanon (OLT20) 6 Lithuania (AGATA) 9 Mexico (Mexico Airplay) 8 Panama (Monitor Latino) 17 Paraguay (Monitor Latino) 8 Romania (Airplay 100) 95 Serbia (Radiomonitor) 5 Singapore (RIAS) 20 Slovenia (SloTop50) 3 US Rolling Stone Top 100 4 Venezuela (Record Report) 39 === Monthly charts === Monthly chart performance for \"Stupid Love\" Chart (2020) Peak position Brazil (Pro-Música Brasil) 33 Paraguay (SGP) 35 Slovenia (SloTop50) 6 ===Year-end charts=== Yearly chart performance for \"Stupid Love\" Chart (2020) Position Argentina Airplay (Monitor Latino) 18 Belgium (Ultratop Wallonia) 75 Bolivia (Monitor Latino) 91 Canada (Canadian Hot 100) 59 Chile (Monitor Latino) 67 Croatia (HRT) 21 El Salvador (Monitor Latino) 32 Honduras (Monitor Latino) 72 Hungary (Rádiós Top 100) 20 Hungary (Single Top 100) 43 Paraguay (Monitor Latino) 53 Slovenia (SloTop50) 39 UK Singles (OCC) 98 US Adult Contemporary (Billboard) 49 US Adult Top 40 (Billboard) 34 US Hot Dance/Electronic Songs (Billboard) 6 == References == Category:Lady Gaga songs Category:2020 songs Category:Dance-pop songs Category:Disco songs",
 "title": "Stupid Love (Lady Gaga song)"
}