{
 "id": "741060",
 "text": "was a Japanese novelist and translator. She translated Anne of Green Gables by L.M. Montgomery to Japanese. == Early life and education == Muraoka was born on June 21, 1893, in Kofu, Yamanashi Prefecture. Her birth name was Hana Annaka. Her parents were Methodists. She was raised as a Christian. She studied at the Tokyo Eiwa Jogakuin. She began writing children's stories when she was encouraged by translator Hiroko Katayama. She graduated from school in 1913. == Career == After graduation, Muraoka returned to Yamanashi and taught at a branch of the Toyo Eiwa Jogakuin there. In 1917 she published her first book, Rohen. She married Keizo Muraoka in 1919. They had a son in 1920. Keizo's printing company went bankrupt in 1926 after the 1923 Great Kanto Earthquake. They restarted the company in their home. Soon after that, their son died and Muraoka became depressed. Katayama encouraged her to translate Mark Twain's The Prince and the Pauper, and this helped her return to regular life. In 1932, Muraoka started a radio show She read the news to children. The show became very popular, and children all over Japan called her the \"Rajio no Obasan\" (Radio Auntie). The show ended in the early 1940s as World War II began. Muraoka did not want to read news that called Canadians the enemy because many of her friends were Canadian. In 1939 her friend Loretta Leonard Shaw gave Muraoka the book Anne of Green Gables. Muraoka translated it during the war. The book was published in 1952 and became a bestseller. It became part of the Japanese school curriculum in the 1970s. Some translators later criticized Muraoka's translation because she had left some parts out. Muraoka planned her first trip to Prince Edward Island in 1968. But, she did not visit before she died of a stroke on October 25, 1968. A television drama called Hanako to Anne was broadcast in 2014. It was based on a book about her life called An no Yurikago Muraoka Hanako no Shogai, written by her granddaughter, Eri Muraoka. == Some of her works == === Translations === * Mark Twain's The Prince and the Pauper (1927) * Eleanor H. Porter's Pollyanna (1930) * Harriet Beecher Stowe's Uncle Tom's Cabin (1948) * Emma Orczy's The Scarlet Pimpernel (1950) * Oscar Wilde's The Happy Prince (1951) * Jean Webster's Daddy-Long- Legs (1951) * L.M. Montgomery's Anne of Green Gables (1952) (sequels published from 1954-1959) * Marie Louise de la Ramée's A Dog of Flanders (1952) * Lewis Carroll's Alice's Adventures in Wonderland (1952) * Frances Hodgson Burnett's A Little Princess (1954) * Frances Hodgson Burnett's The Secret Garden (1955) * Charles Kingsley's The Water-Babies, A Fairy Tale for a Land Baby (1956) * Marjorie Kinnan Rawlings's The Yearling (1958) * Mark Twain's Adventures of Huckleberry Finn (1959) * L.M. Montgomery's Jane of Lantern Hill (1960) * L.M. Montgomery's Emily's Quest (1969) == References == Category:1893 births Category:1968 deaths Category:People from Yamanashi Prefecture Category:Japanese novelists Category:Japanese translators",
 "title": "Hanako Muraoka"
}