{
 "id": "741282",
 "text": "The Emu War, also called the Great Emu War, was a military operation in Australia in late 1932. Emus are large birds that cannot fly. Wild emus only live in Australia. The Australian army killed many emus because the farmers thought they were pests. Farmers were having trouble with the many emus invading the Campion district of Western Australia. Soldiers tried to kill emus with Lewis guns. The media called the military action against birds the \"Emu War\". The army did kill some, but there were still many emus and they continued to destroy crops. ==Background== After World War I, the Australian government gave land to many ex-soldiers from Australia and some from Great Britain. The government gave these settlers land to farm in Western Australia. Much of the land was not very good. When the Great Depression hit Australia in 1929, the government told these farmers to grow more wheat. The government promised to help by giving money to farmers. But the farmers did not get the money. Wheat was losing its worth. By October 1932, there were big problems in Western Australia. The farmers were ready to harvest the season's crop but they also threatened the government. They said they might not deliver the wheat. Farmers' lives and work became even worse when about 20,000 emus arrived. Emus regularly migrate (move from one area to another in big groups) after breeding each year. They return to the coast from inland areas. Western Australian farmers had cleared more land and made water supplies for their livestock and crops better. The emus went to the settlers' farms. They were good places for the emus to live. Emus began to move into farms. Many moved into the farms around Chandler and Walgoolan. The emus ate and ruined the crops. They also made large holes in fences where rabbits could enter and cause more problems. Farmers complained to the government about the birds destroying the crops. A group of veteran settler-farmers went to meet with the Minister of Defence, Sir George Pearce. The settler-farmers had been soldiers in World War I. They understood machine guns. They asked the government to send machine guns. The minister agreed. But, he wanted soldiers to use the guns, not the settler-farmers. The Western Australian government would pay to transport the soldiers. The farmers would give them food and places to live. The farmers would also pay for the bullets. Pearce also wanted to send the guns because the birds would be good target practice for the soldiers. Some in the government may have thought the military operation would make the government look good. People would see that they were helping the Western Australian farmers. They wanted to stop a plan for Western Australia to become an independent country. A cinematographer (movie-maker) from Fox Movietone joined the soldiers. == The \"war\" == The military began to fight the birds in October 1932. The \"war\" was conducted under the command of Major G.P. Wynne- Aubrey Meredith of the Seventh Heavy Battery of the Royal Australian Artillery. Meredith commanded soldiers Sergeant S. McMurray and Gunner J. O'Halloran. They were armed with two Lewis guns and 10,000 rounds of ammunition. Some soldier-settlers also helped them. The operation was delayed, however, by rain that caused the emus to spread out all over a wider area. The rain stopped by 2 November 1932. So, then the troops were sent with orders to help the farmers. A newspaper reported that soldiers were told to collect 100 emu skins. Feathers from these skins could be used to make hats for light horsemen. ===First attempt=== On 2 November, the men travelled to Campion. They saw about 50 emus there. The birds were too far from the guns, so the local settlers tried to herd the emus into an ambush. This failed. The birds split into small groups and ran so it was difficult to shoot them. But, while the first shots from the machine guns did not hurt the emus because they were far away, a second round of gunfire killed \"a number\" of birds. Later the same day, settlers found a small flock and killed about a dozen birds. Next, on 4 November, Meredith prepared an ambush near a local dam. They saw more than 1,000 emus heading towards Meredith and his soldiers. This time, the gunners waited until the birds were very close. Then, they started to fire their guns. The guns jammed after only twelve birds were killed. The surviving birds ran away before any more could be shot. Meredith and the soldiers did not see any more birds that day. After losing the Battle of the Dam, Meredith moved further south, because he heard the birds were \"fairly tame\".West Australian, 4 March 1932, quoted in Johnson (2006), p152 But, again, he had only limited success even though he and his men tried very hard to kill more emus. By the fourth day of the campaign, army observers reported that birds looked well organised. \"Each pack seems to have its own leader now – a big black-plumed bird which stands fully six feet high and keeps watch while his mates carry out their work of destruction and warns them of our approach\". Meredith was desperate. He even tried to put one of the guns on a truck. This failed because the truck was slower than the emus. The ride was so rough that the gunner could not fire any shots. By 8 November, six days after the fighting started, the soldiers had fired 2,500 bullets. Nobody knows how many birds were killed. One estimate was 50 birds. Others said from 200 to 500 birds. Settlers gave the large estimate. Meredith's official report said that none of his men were injured. On 8 November, members of the Australian House of Representatives discussed the operation. Following the negative coverage in the local media, that included claims that \"only a few\" emus had died, Pearce took out the military personnel and the guns on 8 November. After the withdrawal, Major Meredith compared the emus to Zulus and commented on the striking maneuverability (ability to move quickly and carefully) of the emus, even while badly hurt. === Second attempt === After the soldiers retreated, the emus continued to attack crops. Farmers again asked for support, citing the hot weather and drought that brought emus invading farms in the thousands. James Mitchell, the Premier of Western Australia, lent his strong support to renewal of the military assistance. At the same time, a report from the Base Commander was issued that indicated 300 emus had been killed in the initial operation. On November 12, the Minister of Defence started the war again because of the settlers' requests and the Base Commander's report. He explained the decision to the Senate. He said they needed soldiers to fight the serious agricultural threat from the big emu population. The army had agreed to lend the guns to the Western Australian government. The army expected people from the Western Australian government would use the guns. But, there were not enough experienced machine gunners in the state, so Meredith was sent to fight again. The military started to attack on 13 November 1932. They were successful during the first two days, and killed about 40 of the invading emus. The third day, 15 November, was less successful. By 2 December, the soldiers were killing about 100 emus per week. Meredith was recalled on 10 December, and in his report he claimed 986 kills with 9,860 rounds, at a rate of exactly 10 rounds per confirmed kill. In addition, Meredith claimed 2,500 wounded birds had died as a result of their injuries. In judging the success of the war, an article in the Coolgardie Miner on 23 August 1935 reported that although the use of machine guns had been \"criticised in many quarters, the method proved effective and saved what remained of the wheat\". == Aftermath == In and after 1930, farmers built fences to keep emus out of farms. The fences stopped dingoes and rabbits too.New Strategy in a War on the Emu, The (Sydney) Sunday Herald, (Sunday, 5 July 1953), p13. By December 1932, people in the United Kingdom had heard about the Emu War. Some people who cared about animals said killing the emus was bad. They called it \"extermination of the rare emu\". Dominic Serventy and Hubert Whittell, Australian ornithologists, described the \"war\" as \"an attempt at the mass destruction of the birds\".Crew, B., \"The Great Emu War: In which some large, flightless birds unwittingly foiled the Australian Army\", Scientific American Blogs, Monday, 4 August 2014. Some farmers asked the army to fight the emus again in 1934, 1943, and 1948. Each year, the government said no.Request to Use Bombs to Kill Emus, The (Adelaide) Mail, (Saturday, 3 July 1943), p.12. Instead, the government continued the bounty system that had started in 1923. This worked. For six months in 1934, Western Australians killed 57,034 emus and asked for the bounty money. In November 1950, Hugh Leslie, a newspaper editor and state and federal politician from Western Australia, complained about emus in federal parliament. He asked the Army Minister Josiah Francis to give .303 ammunition from the army to farmers to kill the emus. The minister said yes and gave 500,000 bullets to the farmers. ==Legacy== Playwright Simeon Yialeloglou and composer James Court made a musical adaptation of the story in Melbourne in 2019. A movie about the War, written by John Cleese, Monty Franklin, and Rob Schneider, is being planned. == Related pages == * Emu == References == ==Other websites== * How we lost the \"Emu War\" * Plants & Animals: Emu * Category:Birds of Australia Category:Pests Category:Military of Australia Category:1932",
 "title": "Emu War"
}