{
 "id": "741542",
 "text": "By-elections to the 32nd Canadian Parliament were held to fill vacancies in the House of Commons of Canada between the 1980 federal election and the 1984 federal election. The Liberal Party of Canada led a majority government for the entirety of the 32nd Canadian Parliament, though their number did decrease from by-elections. 27 seats became vacant during the life of the Parliament. 12 of these vacancies were filled through by-elections, and 15 seats remained vacant when the 1984 federal election was called. By-election Date Incumbent Party Party Winner Party Party Cause Retained Mission—Port Moody August 29, 1983 Mark Rose New Democratic Party Gerry St. Germain Progressive Conservative Resignation No Central Nova August 29, 1983 Elmer M. MacKay Progressive Conservative Brian Mulroney Progressive Conservative Resignation to provide a seat for Mulroney Yes Brandon—Souris May 24, 1983 Walter Dinsdale Progressive Conservative Lee Clark Progressive Conservative Death (kidney failure) Yes Broadview—Greenwood October 12, 1982 Bob Rae New Democratic Party Lynn McDonald New Democratic Party Resigned to become leader of New Democratic Party of Ontario Yes Leeds—Grenville October 12, 1982 Tom Cossitt Progressive Conservative Jennifer Cossitt Progressive Conservative Death (heart attack) Yes Timiskaming October 12, 1982 Bruce Lonsdale Liberal John A. MacDougall Progressive Conservative Death (car accident) No Spadina August 17, 1981 Peter Stollery Liberal Dan Heap New Democratic Party Called to the Senate No Joliette August 17, 1981 Roch La Salle Progressive Conservative Roch La Salle Progressive Conservative Resignation to contest the 1981 Quebec election Yes Lévis May 4, 1981 Raynald Guay Liberal Gaston Gourde Liberal Resignation Yes London West April 13, 1981 Judd Buchanan Liberal Jack Burghardt Liberal Resignation Yes Cardigan April 13, 1981 Daniel J. MacDonald Liberal W. Bennett Campbell Liberal Death Yes Hamilton West September 8, 1980 Lincoln Alexander Progressive Conservative Stan Hudecki Liberal Resignation No ==References== * Parliament of Canada–Elected in By-Elections Category:1983 in North America Category:1982 elections Category:1981 elections Category:1980 elections Category:1980s elections in Canada Category:1981 in Canada",
 "title": "By-elections to the 32nd Canadian Parliament"
}