{
 "id": "741531",
 "text": "The 1997 Alberta general election was the twenty-fourth general election for the Province of Alberta, Canada. It was held on March 11, 1997, to elect members of the Legislative Assembly of Alberta. == Results == Party Party Party leader # of candidates Seats Seats Seats Popular vote Popular vote Popular vote Party Party Party leader # of candidates 1993 Elected % Change # % % Change Ralph Klein 83 51 63 +23.5% 483,914 51.17% +6.68% Grant Mitchell 83 32 18 -43.8% 309,748 32.75% -6.98% Pam Barrett 77 - 2 83,292 8.81% -2.20% Randy Thorsteinson 70 - - - 64,667 6.84% +4.43% Maury Shapka 16 - - - 1,303 0.14% -0.37% David Parker 7 - - - 1,039 0.11% -0.09% Independent Independent 6 - - - 1,092 0.11% -0.82% William Finn 4 * - * 597 0.06% * Naomi Rankin 1 - - - 61 0.01% x Total Total Total 347 83 83 - 945,713 100% Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Source: Elections Alberta Notes: * Party did not nominate candidates in the previous election. x – less than 0.005% of the popular vote ==Members elected== For complete electoral history, see individual districts 24th Alberta Legislative Assembly 24th Alberta Legislative Assembly 24th Alberta Legislative Assembly 24th Alberta Legislative Assembly District District Member Party Athabasca-Wabasca Mike Cardinal Progressive Conservative Airdrie-Rocky View Carol Haley Progressive Conservative Banff-Cochrane Janis Tarchuk Progressive Conservative Barrhead-Westlock Ken Kowalski Progressive Conservative Bonnyville-Cold Lake Denis Ducharme Progressive Conservative Calgary-Bow Bonnie Laing Progressive Conservative Calgary-Buffalo Gary Dickson Liberal Calgary-Cross Yvonne Fritz Progressive Conservative Calgary-Currie Jocelyn Burgener Progressive Conservative Calgary-East Moe Amery Progressive Conservative Calgary-Egmont Denis Herard Progressive Conservative Calgary- Elbow Ralph Klein Progressive Conservative Calgary-Fish Creek Heather Forsyth Progressive Conservative Calgary-Foothills Pat Black1 Progressive Conservative Calgary-Fort Wayne Cao Progressive Conservative Calgary-Glenmore Ron Stevens Progressive Conservative Calgary-Lougheed Marlene Graham Progressive Conservative Calgary-McCall Shiraz Shariff Progressive Conservative Calgary- Montrose Hung Pham Progressive Conservative Calgary-Mountain View Mark Hlady Progressive Conservative Calgary-North Hill Richard Magnus Progressive Conservative Calgary-North West Greg Melchin Progressive Conservative Calgary- Nose Creek Gary Mar Progressive Conservative Calgary-Shaw Jon Havelock Progressive Conservative Calgary-Varsity Murray Smith Progressive Conservative Calgary-West Karen Kryczka Progressive Conservative Cardston-Taber-Warner Ron Hierath Progressive Conservative Clover Bar-Fort Saskatchewan Rob Lougheed Progressive Conservative Cypress-Medicine Hat Lorne Taylor Progressive Conservative Drayton Valley-Calmar Tom Thurber Progressive Conservative Drumheller-Chinook Shirley McClellan Progressive Conservative Dunvegan Glen Clegg Progressive Conservative Edmonton-Beverly-Clareview Julius Yankowsky Progressive Conservative Edmonton-Calder Lance White Liberal Edmonton-Castle Downs Pamela Paul Liberal Edmonton-Centre Laurie Blakeman Liberal Edmonton- Ellerslie Debby Carlson Liberal Edmonton-Glengarry Bill Bonner Liberal Edmonton-Glenora Howard Sapers Liberal Edmonton-Gold Bar Hugh MacDonald Liberal Edmonton-Highlands Pam Barrett NDP Edmonton-Manning Ed Gibbons Liberal Edmonton-McClung Grant Mitchell Liberal Edmonton-Meadowlark Karen Leibovici Liberal Edmonton-Mill Creek Gene Zwozdesky Liberal Edmonton-Mill Woods Don Massey Liberal Edmonton-Norwood Sue Olsen Liberal Edmonton-Riverview Linda Sloan Liberal Edmonton-Rutherford Percy Wickman Liberal Edmonton-Strathcona Raj Pannu NDP Edmonton-Whitemud David Hancock Progressive Conservative Fort McMurray Guy C. Boutilier Progressive Conservative Grande Prairie-Smoky Walter Paszkowski Progressive Conservative Grande Prairie-Wapiti Wayne Jacques Progressive Conservative Highwood Don Tannas Progressive Conservative Innisfail-Sylvan Lake Gary Severtson Progressive Conservative Lac La Biche-St. Paul Paul Langevin Progressive Conservative Lacombe-Stettler Judy Gordon Progressive Conservative Lesser Slave Lake Pearl Calahasen Progressive Conservative Leduc Albert Klapstein Progressive Conservative Lethbridge-East Ken Nicol Liberal Lethbridge-West Clint Dunford Progressive Conservative Little Bow Barry McFarland Progressive Conservative Livingstone-Macleod David Coutts Progressive Conservative Medicine Hat Rob Renner Progressive Conservative Olds-Didsbury-Three Hills Richard Marz Progressive Conservative Peace River Gary Friedel Progressive Conservative Ponoka-Rimbey Halvar Jonson Progressive Conservative Red Deer-North Stockwell Day Progressive Conservative Red Deer-South Victor Doerksen Progressive Conservative Redwater Dave Broda Progressive Conservative Rocky Mountain House Ty Lund Progressive Conservative Sherwood Park Iris Evans Progressive Conservative St. Albert Mary O'Neill Progressive Conservative Spruce Grove-Sturgeon-St. Albert Colleen Soetaert Liberal Stony Plain Stan Woloshyn Progressive Conservative Strathmore-Brooks Lyle Oberg Progressive Conservative Vegreville-Viking Ed Stelmach Progressive Conservative Vermilion-Lloydminster Steve West Progressive Conservative Wainwright Robert Fischer Progressive Conservative West Yellowhead Ivan Strang Progressive Conservative Wetaskiwin-Camrose LeRoy Johnson Progressive Conservative Whitecourt-Ste. Anne Peter Trynchy Progressive Conservative Note: *1 Pat Black later changed her last name to Nelson. == References == Category:1997 elections Category:1990s elections in Canada Category:Elections in Alberta Category:General elections in Canada Category:1997 in Canada",
 "title": "1997 Alberta general election"
}