{
 "id": "741605",
 "text": "Ishi (c. 1861 - March 25, 1916) was the last known member of the Native American Yahi people from California in the United States. The rest of the Yahi (as well as many members of their parent tribe, the Yana) were killed in the California genocide in the 19th century. Ishi lived most of his life isolated from modern American culture. In 1911, aged 50, he came out near the foothills of Lassen Peak in Northern California. Ishi, which means \"man\" in the Yana language, is an adopted name. The anthropologist Alfred Kroeber gave him this name because in the Yahi culture, tradition demanded that he not speak his own name until formally introduced by another Yahi. When asked his name, he said: \"I have none, because there were no people to name me,\" meaning that there was no other Yahi to speak his name for him. Ishi was taken in by anthropologists at the University of California, Berkeley, who both studied him and hired him as a janitor. He lived most of his remaining five years in a university building in San Francisco. His life was shown and discussed in many films and books. A popular biography was Ishi in Two Worlds published by Theodora Kroeber in 1961. ==Biography== ===Early life=== In 1865, Ishi and his family were attacked in the Three Knolls Massacre, in which 40 of their tribesmen were killed. Although 33 Yahi survived to escape, cattlemen killed about half of the survivors. The last survivors, including Ishi and his family, went into hiding for the next 44 years. Their tribe was believed to be extinct.Ishi: A Real-Life Last Of The Mohicans, Mohican Press Prior to the California Gold Rush of 1848–1855, the Yahi population numbered 404 in California, but the total Yana in the larger region numbered 2,997.Rockafellar, Nancy (date unknown). \"The story of Ishi: A Chronology\". Retrieved on 2011-01-14 from https://history.library.ucsf.edu/ishi.html. The gold rush brought tens of thousands of miners and settlers to northern California, putting pressure on native populations. Gold mining polluted the water and killed fish. Deer left the area. The settlers brought new infectious diseases such as smallpox and measles.\"Ishi Biography\" The northern Yana group became extinct while the central and southern groups (who later became part of Redding Rancheria) and Yahi populations dropped dramatically. Searching for food, they came into conflict with settlers, who set bounties of 50 cents per scalp and 5 dollars per head on the natives. In 1865, the settlers attacked the Yahi while they were still asleep. Since then more has been learned. It is estimated that with this massacre, Ishi's entire cultural group, the Yana/Yahi, may have been reduced to about sixty people. From 1859 to 1911, Ishi's remote band became more and more mixed with non-Yahi Indian representatives, such as Wintun, Nomlaki, and Pit River members. In 1879, the federal government started Indian boarding schools in California. Some men from the reservations became renegades in the hills. Volunteers among the settlers and military troops carried out more campaigns against the northern California Indian tribes during that period.Burrill, Richard (2001). Ishi Rediscovered. Barron's art guides, Anthro Company, 2001. . In late 1908, a group of surveyors found the camp with two men, a middle-aged woman, and an elderly woman. These were Ishi, his uncle, his younger sister, and his mother. Three ran away while the old woman hid herself in blankets because she was sick and unable to run away. The surveyors stole from the camp, and Ishi's mother died soon after he came back. His sister and uncle never returned. ===Walking into the modern world=== After the 1908 attack, Ishi spent three more years in the wilderness, alone. Finally, starving on August 29, 1911, Ishi was captured trying to get meat near Oroville, California, after forest fires in the area. The local sheriff took the man into custody for his protection. The \"wild man\" caught the imagination and attention of thousands of onlookers and curiosity seekers. Professors at the University of California, Berkeley, Museum of Anthropology—now the Phoebe A. Hearst Museum of Anthropology (PAHMA)—read about him and brought him to the university. Studied by the university, Ishi also worked as a janitor and lived in an apartment at the museum for most of the remaining five years of his life. In June 1915, he lived in Berkeley with the anthropologist Thomas Talbot Waterman and his family. Waterman and Alfred L. Kroeber, director of the museum, studied Ishi closely over the years. They talked with him for a long time. They wanted to understand Yahi culture. He described families, Yahi names, and the ceremonies that he knew. Much tradition had already been lost when he was growing up, as there were few older people in his group. Ishi taught his native Yana language. It was recorded and studied by the linguist Edward Sapir, who had previously done work on the northern dialects. Ishi died of tuberculosis on March 25, 1916. It is said his last words were \"You stay. I go.\" His friends at the university tried to prevent an autopsy on Ishi's body, since Yahi tradition kept the body in one piece. But the doctors at the University of California medical school performed an autopsy before Waterman could stop them. Ishi's brain was preserved and the body cremated.\"Ishi's Hiding Place\", Butte County , A History of American Indians in California: Historic Sites, National Park Service, 2004, accessed November 5, 2010 Kroeber put Ishi's preserved brain in a Pueblo Indian pottery jar wrapped in deer skin. He sent it to the Smithsonian Institution in 1917. August 10, 2000, the Smithsonian returned it to the descendants of the Redding Rancheria and Pit River tribes. This followed the National Museum of the American Indian Act of 1989. According to Robert Fri, director of the National Museum of Natural History, \"Ishi was not the last of his kind ... We learned that as a Yahi–Yana Indian his closest living descendants are the Yana people of northern California.\" His remains were also returned from Colma, and the tribal members intended to bury them in a secret place. ==Legacy and honors== * Ishi is revered by flintknappers as probably one of the last two native stone tool makers in North America. His techniques are widely imitated by knappers. Ethnographic accounts of his toolmaking are considered to be the Rosetta Stone of lithic tool manufacture. * Kroeber and Waterman's 148 wax cylinder recordings (totaling 5 hours and 41 minutes) of Ishi speaking, singing, and telling stories in the Yahi language were selected by the Library of Congress as a 2010 addition to the National Recording Registry. This is an annual selection of recordings that are \"culturally, historically, or aesthetically significant\". * Writer and critic Gerald Vizenor led people to ask to have the courtyard in Dwinelle Hall at the University of California, Berkeley renamed as \"Ishi Court\". * The Ishi Wilderness Area in northeastern California, believed to be the ancestral grounds of his tribe, is named in his honor. * Ishi Giant, a very large giant sequoia discovered by naturalist Dwight M. Willard in 1993, is named in his honor. * Ishi was the subject of a sculpture by Thomas Marsh in his 1990 work, Called to Rise. Isshi is one of twenty noteworthy San Franciscans in the work on the facade of the 25-story highrise at 235 Pine Street, San Francisco. * Anthropologists at the University of California, Berkeley wrote a letter in 1999 apologizing for Ishi's treatment. ==Ishi in popular culture== ===Films=== * Ishi: The Last of His Tribe (airdate December 20, 1978), with Eloy Casados in the title role, was telecast on NBC. The film was written by Christopher Trumbo. * The Last of His Tribe (1992), with Graham Greene as Ishi, was produced as a TV movie. * Ishi: The Last Yahi (1992), is an award-winning documentary film by Jed Riffe. * In Search of History: Ishi, the Last of His Kind (1998), is a 1998 television documentary about him. ===Literature=== * Lawrence Holcomb wrote a novel, The Last Yahi: A Novel About Ishi (2000). * Othmar Franz Lang's young adult novel, Meine Spur löscht der Fluss (1978), is a fiction story in German. * ===Stage productions=== * Ishi (2008), a play written and directed by John Fisher, was performed from July 3–27, 2008 at Theatre Rhinoceros in San Francisco. ===Music=== Shown in the video for \"blue train lines\" a song by Mount Kimbie and King Krule. The video tells the story of the two anthropologists falling out. One sells all of Ishi's possessions on eBay. (kimbie.2017) ===Comics=== * Osamu Tezuka: The story of Ishi the primitive man, (first appeared in Weekly- Shonen-Sunday, Shogakkan in Japan, issue of Oct. 20th 1975, total 44pages）. ==References== ==More reading== * * Anthropologist Theodora Kroeber's book, Ishi in Two Worlds (1961), is a popular account of Ishi's life story. She published it after the death of her husband Alfred, who had worked with Ishi. * Theodora Kroeber published Ishi: Last of His Tribe (1964), a partially fictionalized version of his account. * Ishi the Last Yahi: A Documentary History (1981), edited by Robert Heizer and Theodora Kroeber, contains additional scholarly materials. * Ishi in Three Centuries (2003), edited by anthropologists Clifton and Karl Kroeber, Theodora and Alfred Kroeber's sons, is the first scholarly book on Ishi to include essays by Native Americans. Native writers, such as Gerald Vizenor, had been commenting on the case since the late 1970s. * Samuel J. Redman's Bone Rooms: From Scientific Racism to Human Prehistory in Museums (2016), explores the complex story of efforts by tribes and the Smithsonian to collect and repatriate Ishi's bodily remains. * Anthropologist Orin Starn's book, Ishi's Brain: In Search of America's Last \"Wild\" Indian (2004), recounts the author's quest to find the remains of Ishi, while interpreting what Ishi meant to Americans and the modern American Indians today. (In 2000, Ishi's brain was returned to the descendant tribes, who placed it with his cremated remains.) * See also audio narration at LibriVox's Short Nonfiction Collection Vol. 026 (2012). * * Ishi's Brain: In Search of America's Last 'Wild' Indian Starn, Orin, New York: W.W. Norton, 2004. () ==Other websites== * \"A Compromise between Science and Sentiment: A Report on Ishi's Treatment at the University of California, 1911–1916\", University of California, San Francisco * Ishi being from two tribes, Press Release, UC Berkeley * Ishi: The Last Yahi (1992) documentary synopsis * * * Richard Burrill, \"Synopsis of Ishi's Life\" , Ishi Facts Website * Books on Ishi by Richard Burrill * Saxton Pope, Hunting with the Bow and Arrow, includes discussion about Ishi * Saxton Pope, \"Yahi Archery\", University of California Publications in American Archaeology and Ethnology, The Archery Library * The Story of Ishi: A Chronology by Nancy Rockafellar, University of California, San Francisco Category:1860s births Category:1916 deaths Category:Native American people Category:People from California Category:American artists",
 "title": "Ishi"
}