{
 "id": "742204",
 "text": "The Lewis gun (or Lewis automatic machine gun or Lewis automatic rifle) is a First World War–era light machine gun. == History == The Lewis gun was invented by U.S. Army colonel Isaac Newton Lewis in 1911, based on initial work by Samuel Maclean. The start of the First World War increased demand for the Lewis gun. BSA began production, under the name Model 1914. The design was officially approved for service on 15 October 1915 under the name \"Gun, Lewis, .303-cal.\" No Lewis guns were produced in Belgium during the war; all manufacture was carried out by BSA in England and the Savage Arms Company in the US. == Production == The Lewis was produced by BSA and Savage Arms during the war. The two versions were very similar, but there were enough differences to stop them being completely interchangeable. This problem was fixed by the time of the Second World War. == Design details == The Lewis gun was gas operated. The Lewis gun used a pan magazine holding 47 or 97 rounds. The gun fired about 500–600 rounds per minute. It weighed 28 lb (12.7 kg), only about half as much as a typical medium machine gun of the era, such as the Vickers machine gun. It could be carried and used by one soldier. == Service == === First World War === During the first days of the war, the Belgian Army had put in service 20 prototypes (5 in 7.65×53mm and 15 in .303) for the defense of Namur. ==== Aircraft use ==== The Lewis was the first machine gun fired from an airplane. On 7 June 1912, Captain Charles Chandler of the US Army fired a Lewis gun from the foot-bar of a Wright Model B Flyer. == Notes == == References == * Pages 62–64, 66, 69-70, 85-86. * * * * * * * * * * * * == More reading == * == Other websites == * Scans of Lewis gun manual of 1917 * at Modern Firearms * Animation of Lewis machine gun 1916 * Lewis gun with cooling shroud in demonstration firing Category:Light machine guns Category:Machine guns of the United States Category:World War I",
 "title": "Lewis gun"
}