{
 "id": "742314",
 "text": "Nicholas Alahverdian (born 1987/1988) is an Armenian American sex offender who faked his own death in 2020. ==Life== Alahverdian said that he was abused as a minor while under the care of the Rhode Island Department of Children, Youth & Families. Over this, he sued the organization in 2011 in federal court, then withdrew the lawsuit when Rhode Island waived his ~$200,000 medical fees. In 2008, Alahverdian, then known as Nicholas Rossi, was convicted of \"sexual imposition\" and public indecency over an incident with another student at Ohio's Sinclair Community College, where he studied in. Alahverdian requested that the trial be restarted based on new evidence from the Internet. A computer expert analyzed the new evidence in 2011. He was 90% confident that it was fake, pointing to a date error which only a human would make, not a computer. The judge refused Alahverdian's request for the trial as the new evidence was \"not credible\". ==Personal life== In 2015, Alahverdian was married for the second time; the couple ended their marriage by 2017, after a court ruled that Alahverdian was \"guilty of gross neglect of duty and extreme cruelty\" towards his wife. In January 2020, Alahverdian said that he had been diagnosed with non-Hodgkin lymphoma. According to his family, Alahverdian died of the disease on February 29, 2020. His wife said that Alahverdian would be cremated and that Alahverdian's remains would be scattered at sea. Upon Alahverdian's death, WPRI reported that he had moved out of the United States around four years earlier, with his wife saying that it was because they were not safe in the United States. ==Faked death== In July 2020, Rhode Island State Police looked into whether Alahverdian's reported death was real; no conclusion was reached by January 2021. The investigation occurred due to claims that Alahverdian was still alive, plus a warrant against Alahverdian as he was accused of failing to register as a sex offender in Rhode Island due to his 2008 conviction. Just before his illness and death, Alahverdian knew that the Federal Bureau of Investigation was investigating him for fraud, said his former lawyer Jeffrey Pine. The FBI's investigation happened because his foster mother Sharon Lane claimed that he opened 22 credit cards under her husband's name, spending over $200,000 which her husband now owed. Pine was suspicious whether Alahverdian really died, because his illness and death were reported so quickly after Alahverdian learned of the FBI investigation. Lane believed that Alahverdian was still alive, because in her opinion, the obituary and memorials written about him had a writing style matching Alahverdian's. A person claiming to be Alahverdian's widow denied that he had faked his death, but also refused to provide copies of his death certificate to the media. According to a Rhode Island pastor, he had been contacted by a person claiming to be Alahverdian's widow, who had requested the holding of a mass in tribute to Alahverdian. The pastor said that a Rhode Island policeman told him not to hold the event, and that the policeman also said that Alahverdian had faked his death, with the person claiming to be Alahverdian's widow possibly being Alahverdian himself using a \"device that can change people's voices\". A person claiming to be Alahverdian's widow, 'Louise', also sent an email in January 2021 to The Providence Journal, which included criticism of people who had past connections to Alahverdian, including the victim of Alahverdian's sexual offenses, the police officer who took Alahverdian's sexual offenses case, the judge who oversaw Alahverdian's sexual offenses case, and Alahverdian's former foster parents. ==References== Category:American sex offenders Category:1980s births Category:Living people Category:Writers from Providence, Rhode Island",
 "title": "Nicholas Alahverdian"
}