{
 "id": "742654",
 "text": "Abdel Fattah Abdelrahman Burhan (; born 11 July 1960) is a Sudanese politician and soldier who is the Interim President of Sudan since 2021 and the Chairman of the Transitional Military Council from 2019 until the council was dissolved in October 2021, and again since the council was restored in November 2021. Burhan is also the Commander-in-Chief of the Sudanese Armed Forces. Following the 2019 Sudanese coup d'état which overthrew President Omar al-Bashir, in April 2019, Burhan took part in the new military junta led by Ahmed Awad Ibn Auf. However, a day later, Auf stepped down and Burhan became the chairman of the Transitional Military Council. In August of the same year, Burhan dissolved the TMC and formed the Transitional Military Council and Burhan headed the council. In May 2019, Burhan's first international trip as president was to Egypt to meet President Abdel Fattah el-Sisi. His second visit was to the United Arab Emirates. In August 2020, Burhan signed the Juba Agreement, this allowed Burhan to continue to lead the Transitional Sovereignty Council until in October 2021 where the council will be dissolved rather than as originally planned in February 2021. Burhan led another coup d'état in October 2021 which deposed Prime Minister Abdalla Hamdok and his cabinet members and put them under house arrest and also declared himself Interim President. However, a month later in November, Hamdock and Burhan signed an agreement to make Hamdock as Prime Minister again. However, in January 2022, Hamdok resigned following massive protests and a political deadlock. In April 2023, Burhan's vice president, Mohammed Hamdan Dagalo, who's relationship with Burhan has soured since February 2023 because of the 2021 coup has rebelled against Burhan which started the Third Sudanese Civil War thus dividing the country. Dagalo has blamed Burhan for the war stating that he wanted to divide the country. However, Burhan has denied those clames and said that it was Dagalo who wanted to divide the country. He is leading the SAF against the Rapid Support Forces (RSF) in the ongoing Third Sudanese Civil War. Burhan survived an assassination attempt while attending a military graduation ceremony in Gebeit. Five people were killed in the drone attack. ==Notes== ==References== Category:1960 births Category:Presidents of Sudan Category:Current national leaders Category:Living people",
 "title": "Abdel Fattah al-Burhan"
}