{
 "id": "742675",
 "text": "The following is a list of deaths that should be noted in April 2020.. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==April== ===1=== *Branislav Blažić, 63, Serbian surgeon and politician, Minister of Environmental Protection (1998–2000), COVID-19.Serbian state secretary dies from coronavirus *Cristina, 61, American singer (Sleep It Off), COVID-19.Things Fall Apart singer Cristina reportedly dies from coronavirus *David C. Driskell, 88, American visual artist and academic, COVID-19.Passing of Professor David C. Driskell *Kevin Duffy, 87, American politician and lawyer, Judge of the U.S. District Court for the Southern District of New York (1972–2016), COVID-19. *Ed Farmer, 70, American baseball player (Cleveland Indians, Chicago White Sox, Philadelphia Phillies) and broadcaster, kidney disease.White Sox Broadcaster, Ex-MLB Player Ed Farmer Dies at Age 70 *Edward L. Feightner, 100, American Navy Rear admiral and flying ace.Edward Lewis Feightner *Luiz Flávio Gomes, 62, Brazilian jurist, professor and politician, Deputy (since 2019), acute myeloid leukaemia.Deputado Luiz Flávio Gomes morre aos 62 anos, em São Paulo *Sir James Gowans, 95, British immunologist.Gowans *Nur Hassan Hussein, 83, Somali politician, Prime Minister (2007–2009) and Ambassador to Italy (2009–2013), COVID-19.Ex-Somali PM dies of Coronavirus in London *Martin Khor, 68, Malaysian journalist (The Star) and economist, Executive Director of the South Centre (2009–2018), cancer.Former Third World Network director Martin Khor dies of cancer *Gérard Mannoni, 92, French sculptor, COVID-19.Gérard, Philippe, Joseph Mannoni : Décès *Ellis Marsalis Jr., 85, American jazz pianist, suspected COVID-19.New Orleans jazz piano legend Ellis Marsalis dies, city officials say *Rüdiger Nehberg, 84, German activist and survival expert.Rüdiger Nehberg’s dead: Survival expert and activist dies aged 84 *Dirceu Pinto, 39, Brazilian Paralympic boccia player (2008, 2012, 2016), arrhythmia.Aos 39 anos, morre Dirceu Pinto, dono de quatro ouros paralímpicos na bocha *Bucky Pizzarelli, 94, American jazz guitarist, COVID-19.Guitarist Bucky Pizzarelli has Died at 94 *Harold Rubin, 87, South African-born Israeli jazz clarinetist.מת הרולד רובין, מחלוצי הג'ז החופשי בישראל *Gerardo Ruiz Esparza, 70, Mexican politician, Secretary of Communications and Transportation (2012–2018), stroke.Ruiz Esparza, former Secretary of Communications and Transportation, dies *Adam Schlesinger, 52, American rock guitarist (Fountains of Wayne) and songwriter (\"That Thing You Do\", \"Stacy's Mom\"), Emmy winner (2012, 2013, 2019), COVID-19.Adam Schlesinger Dies of Coronavirus Complications at 52 ===2=== *Goyo Benito, 73, Spanish footballer (Real Madrid, Rayo Vallecano, national team), problems caused by Alzheimer's disease and COVID-19. *Patricia Bosworth, 86, American actress (The Nun's Story) and author, COVID-19.Patricia Bosworth, Hollywood Actress and Marlon Brando Biographer, Dies at 86 From Coronavirus Complications *Bernardita Catalla, 62, Filipino politician, Ambassador to Lebanon (2017–2020), COVID-19.Philippines ambassador to Lebanon dies from coronavirus complications *Mario Chaldú, 77, Argentine footballer (Club Atlético Banfield, Racing Club, national team).Falleció el exfutbolista Mario Chaldú *Oskar Fischer, 97, German politician, Minister for Foreign Affairs of the GDR (1975–1990).Langjähriger DDR-Außenminister Oskar Fischer gestorben *William Frankland, 108, British allergist and immunologist, COVID-19.Obituary: Dr. Alfred William Frankland MBE, Honorary President of the Anaphylaxis Campaign *Juan Giménez, 76, Argentine comic book artist (Heavy Metal, Métal hurlant), COVID-19.Veteran comic book artist Juan Giménez's death from coronavirus leaves industry members devastated *Ron Graham, 93, English-Australian actor (Home and Away, Waterloo Station).Ronald Graham *James Megellas, 103, American military officer.World War II hero dies at 103 *Astrid Nøklebye Heiberg, 83, Norwegian humanitarian and politician, MP (1985–1989, since 2018) and President of the International Federation of Red Cross and Red Crescent Societies (1997–2001).Astrid Nøklebye Heiberg er død *Daniel Jacoby, 86, French lawyer and human rights activist.Disparition de Maître Daniel Jacoby, ancien président de la FIDH *Anick Jesdanun, 51, American technology journalist (Associated Press), COVID-19.Anick Jesdanun, longtime AP technology writer, dies at 51 *Eddie Large, 78, Scottish comedian (Little and Large), COVID-19.Eddie Large dies aged 78 *Maeve Kennedy McKean, 40, American lawyer, health official, and academic, member of the Kennedy family, drowned.RFK granddaughter, 40, and son, 8, presumed dead after Chesapeake Bay mishap, family says *Johannes van Knobelsdorff, 102, Dutch politician, Mayor of Goedereede–Stellendam (1947–1961) and Sassenheim (1961–1974).Oud-dijkgraaf Johannes baron van Knobelsdorff overleden *Carl Tacy, 86, American college basketball coach (Wake Forest, Marshall).Former Wake Forest Basketball Coach Carl Tacy Passes Away *Aptripel Tumimomor, 53, Indonesian politician and businessman, Regent of North Morowali (since 2016), COVID-19.Bupati Morowali Utara Dimakamkan dengan Protokol Covid-19 *Logan Williams, 16, Canadian actor (The Flash, When Calls the Heart), drug overdose.Coquitlam teen actor Logan Williams – young Flash in the TV series – dies suddenly *Keizo Yamada, 92, Japanese Olympic long-distance runner (1952).山田敬蔵さんが92歳で死去…53年の米ボストン・マラソンで優勝 ===3=== *Yūtokutaishi Akiyama, 85, Japanese engraver and photographer.「ポップ・ハプニング」美術家の秋山祐徳太子さん死去、８５歳 *Robert Armstrong, Baron Armstrong of Ilminster, 93, British civil servant and life peer, Cabinet Secretary (1979–1987) and member of the House of Lords (since 1988).Lord Armstrong of Ilminster obituary *Ira Einhorn, 79, American convicted murderer and environmentalist, heart disease.‘Unicorn Killer’ Ira Einhorn Dies In Prison At 79 *Giovanni Paolo Gibertini, 97, Italian Roman Catholic prelate, Bishop of Ales-Terralba (1983–1989) and Reggio Emilia-Guastalla (1989–1998), COVID-19.E’ morto questa notte il Vescovo Emerito di Reggio Emilia Paolo Gibertini *Andrea Mitchell, 64, Australian politician, MLA (2008–2017).Obituary: Andrea Mitchell *C. W. Nicol, 79, Welsh-born Japanese writer, cancer.C・W・ニコルさん死去 環境保護活動家で作家、79歳 *Hans Prade, 81, Surinamese politician, Ambassador to the Netherlands (1981–1982), 1991 presidential candidate, COVID-19.Oud-voorzitter Rekenkamer Suriname Hans Prade overleden *Omar Quintana, 76, Ecuadorian politician and sports businessman, President of the National Congress (2005) and President of C.S. Emelec, COVID-19.Falleció Omar Quintana, expresidente de Emelec *Tim Robinson, 85, English writer and cartographer, COVID-19.Author and cartographer Tim Robinson dies from coronavirus *Sergio Rossi, 84, Italian shoe designer (Sergio Rossi), COVID-19.Sergio Rossi Dies at 84 *Yusuf Kenan Sönmez, 71–72, Turkish politician and businessman, member of the Grand National Assembly, COVID-19.Yusuf Kenan Sönmez kimdir? Yusuf Kenan Sönmez kaç yaşında ve nereli? *Eric Verdonk, 60, New Zealand rower, Olympic bronze medallist (1988), cancer.Rowing Olympic medallist Eric Verdonk dies following cancer battle *Constand Viljoen, 86, South African military officer and politician, MP (1994–2001). ===4=== *Jerónimo Arango, 92–93, Mexican businessman (Walmart de México y Centroamérica), co-founder of Aurrerá.Fallece el empresario Jerónimo Arango, uno de los creadores de Aurrera *Arminsyah, 59, Indonesian politician and lawyer, Vice Attorney General (since 2017) and Acting Attorney General (2019), car crash.Meninggal dalam Kecelakaan Maut, Ini Profil Wakil Jaksa Agung Arminsyah *Luis Eduardo Aute, 76, Spanish singer-songwriter, actor and artist.Muere Luis Eduardo Aute a los 76 años *Jay Benedict, 68, American actor (Foyle's War, Aliens, Star Wars), COVID-19.Rest in peace Jay Benedict, Deak in A New Hope *Philippe Bodson, 75, Belgian businessman and politician, Senator (1999–2003), COVID-19.Coronavirus : Philippe Bodson, ex-patron de Tractebel, de la FEB et Glaverbel, est décédé ce matin *Timothy Brown, 82, American actor (M*A*S*H), football player (Philadelphia Eagles, Baltimore Colts) and singer, problems caused by dementia.1960s Eagles great Timmy Brown dies at 82 *Rafael Leonardo Callejas Romero, 76, Honduran politician, President (1990–1994), cardiac arrest caused by acute myeloid leukemia.Muere el expresidente de Honduras, Rafael Leonardo Callejas *Irena Chalmers, 84, British-born American cookbook writer, educator and essayist, esophageal cancer.Irena Chalmers, 84, Is Dead; Writer Anticipated a Food Revolution *Forrest Compton, 94, American actor (The Edge of Night, Gomer Pyle, U.S.M.C.), COVID-19.Update: Town announces the first deaths from coronavirus *Tom Dempsey, 73, American football player (New Orleans Saints, Philadelphia Eagles, Los Angeles Rams), COVID-19.Tom Dempsey, historic New Orleans Saints placekicker, dies at 73 after coronavirus battle *Xavier Dor, 91 French embryologist and anti-abortion activist, COVID-19.Hommage au Dr Xavier Dor : une vie au service de la Vie (rediffusion) *Bashirul Haq, 77, Bangladeshi architect.Architect Bashirul dies *Arnold Heertje, 86, Dutch economist and columnist, member of the Royal Dutch Academy of Sciences (since 1997).Econoom Arnold Heertje (86) overleden *Pertti Paasio, 81, Finnish politician, Minister of Foreign Affairs (1989–1991), MP (1975–1979, 1982–1996) and MEP (1996–1999).Politician Pertti Paasio is dead *Susanna Ramel, 100, Swedish actress.Susanna Ramel *Harland Svare, 89, American football player and coach (New York Giants, Los Angeles Rams), respiratory arrest.Harland Svare, former Chargers and Rams coach, dies at 89 *Alexander Thynn, 7th Marquess of Bath, 87, English politician and artist, Lord Temporal (since 1992), COVID-19.Coronavirus: Lord Bath dies after contracting Covid-19 *Ivan Vakarchuk, 73, Ukrainian physicist, Minister of Education and Science (2007–2010) and rector of the University of Lviv (1990–2007, 2010–2013).Помер Іван Вакарчук - колишній міністр та батько Святослава Вакарчука *Ezio Vendrame, 72, Italian footballer (Lanerossi Vicenza, Napoli, Padova) and writer, cancer.Lutto nel mondo del calcio, è morto Ezio Vendrame: il genio friulano del pallone ===5=== *Ray Authement, 91, American educator, President of the University of Louisiana at Lafayette (1974–2008). *Ed Biles, 88, American football coach (Houston Oilers), leukemia.Former Oiler coach Ed Biles dies *Honor Blackman, 94, English actress (The Avengers, Goldfinger, The Upper Hand) and singer.Honor Blackman, James Bond's Pussy Galore, dies aged 94 *Margaret Burbidge, 100, British-born American astronomer, problems caused by a fall.E. Margaret Burbidge, Astronomer Who Blazed Trails on Earth, Dies at 100 *Gregory W. Carman, 83, American politician and lawyer, member of the U.S. House of Representatives from New York's 3rd congressional district (1981–1983) and Judge of the U.S. Court of International Trade (1983–2014). *Shirley Douglas, 86, Canadian actress (Wind at My Back, Lolita, Barney's Great Adventure) and civil rights activist, problems caused by pneumonia. *Ronnie Earle, 78, American politician and lawyer, District Attorney of Travis County, Texas (1977–2009).Ronnie Earle *Lee Fierro, 91, American actress (Jaws), COVID-19.Lee Fierro, ‘Jaws’ Actor, Dies of Coronavirus at 91 (death announced on this date) *Bob Hermann, 97, American businessman and soccer executive (St. Louis Stars), co-founder of the North American Soccer League.Robert Ringen \"Bob\" Hermann *Mahmoud Jibril, 67, Libyan politician, Minister of Foreign Affairs and Prime Minister (2011), COVID-19.Former Libyan PM Mahmoud Jibril has died from complications related to coronavirus *Sir John Laws, 74, English jurist, High Court Judge (1992–1998) and Lord Justice of Appeal (1999–2016), COVID-19.Retired judge and Cummings' uncle Sir John Laws dies after contracting coronavirus *Pentti Linkola, 87, Finnish deep ecologist, writer and fisherman.Luonnonsuojelija Pentti Linkola on kuollut (death announced on this date) *Bobby Mitchell, 84, American Hall of Fame football player (Cleveland Browns, Washington Redskins) and manager. *George Ogilvie, 89, Australian theatre and movie director (Mad Max Beyond Thunderdome), cardiac arrest.Vale: George Ogilvie *Peter Walker, 84, English cricketer (Glamorgan, national team), stroke.Obituary: Glamorgan and England cricketer Peter Walker ===6=== *Radomir Antić, 71, Serbian football player (Partizan) and manager (Atlético Madrid, national team), pancreatitis.Legendary LaLiga boss Radomir Antić passes away *M. K. Arjunan, 84, Indian Malayalam composer.Veteran Malayalam music director MK Arjunan Master passes away *Helène Aylon, 89, American ecofeminist artist, COVID-19.Helène Aylon, Eco-Feminist Artist Who Pondered Change, Is Dead at 89 of Coronavirus-Related Causes *Claude Barthélemy, 74, Haitian footballer (Detroit Cougars, national team).Haiti-Foot: Claude Barthélemy de la génération 1974 est mort *Steven C. Beering, 87, German-born American physician and academic, President of Purdue University (1983–2000). *Black the Ripper, 32, British grime MC, rapper and cannabis activist.Black The Ripper dead at 32 - Rapper who fought to legalise marijuana in UK dies *Josep Maria Benet i Jornet, 79, Spanish playwright and television writer (Nissaga de poder, El Cor de la Ciutat, Ventdelplà), COVID-19.Muere Benet i Jornet, referente de la dramaturgia catalana, a los 79 años a causa del coronavirus *Marc Chardonnens, 59–60, Swiss government official, Director of the Federal Office for the Environment (2016–2020).Ancien directeur de l'OFEV, le Fribourgeois Marc Chardonnens est décédé *James Drury, 85, American actor (The Virginian, Forbidden Planet, The Young Warriors) and businessman.James Drury, Star of 'The Virginian,' Dies at 85 *Jock Edwards, 64, New Zealand cricketer (Central Districts, national team).One of New Zealand cricket's first big-hitting batsmen has died *Armando Francioli, 100, Italian actor (The Pharaohs' Woman, The Opium Den, Hawk of the Caribbean).E' morto Francioli, con il suo spot lanciò su Carosello l'industria aretina e la Fiera *Earl G. Graves Sr., 85, American businessman and publisher (Black Enterprise), problems caused by Alzheimer's disease.Earl Graves, Sr., founder of Black Enterprise, dies at 85 *Jack Hill, 75, American politician, member of the Georgia State Senate (since 1991).Georgia state Sen. Jack Hill has died *Al Kaline, 85, American Hall of Fame baseball player (Detroit Tigers).Al Kaline, Detroit Tigers legend, dies at age 85 *Jean Little, 88, Canadian writer (Mine for Keeps, From Anna, Orphan at My Door).Renowned Guelph children's author Jean Little passes away *Art Paleczny, 91, Canadian politician, Mayor of Waterloo, Ontario (1966–1967), COVID-19. *Trevor Platt, 78, British marine scientist.Marine scientist Trevor Platt passes away *Bullet Prakash, 44, Indian comedian and actor (Mast Maja Maadi, Aithalakkadi, Aryan), acute liver failure.Kannada comedian Bullet Prakash succumbs to a liver problem *Fred Singer, 95, Austrian-born American physicist, climate change denier and writer (Unstoppable Global Warming: Every 1,500 Years).Dr. S. Fred Singer, R.I.P. *Hal Willner, 64, American music producer (Saturday Night Live, Stay Awake), COVID-19.Hal Willner, Music Producer and Longtime 'SNL' Music Supervisor, Dead at 64 *Jean-Marie Zoellé, 75, French politician, Mayor of Saint-Louis (since 2011), COVID-19.Haut-Rhin : le maire de Saint-Louis, Jean-Marie Zoellé, est mort du coronavirus ===7=== *Albert Almoznino, 97, Moroccan-born Israeli artist.אמן הצלליות ממרוקו שכבש את *Roger Chappot, 79, Swiss Olympic (1964) and professional ice hockey player (Villars, Genève-Servette, national team), COVID-19.La légende du hockey Roger Chappot a perdu son dernier match *Jean-Laurent Cochet, 85, French theatre director and actor (A Thousand Billion Dollars, Fort Saganne), COVID-19.Mort de Jean-Laurent Cochet, le maître de théâtre de Depardieu, Huppert, Auteuil, Béart... *Steve Farmer, 71, American rock guitarist (The Amboy Dukes) and singer-songwriter (\"Journey to the Center of the Mind\").Steven O. Farmer December 31, 1948 ~ April 7, 2020 *Allen Garfield, 80, American actor (The Conversation, Nashville, Beverly Hills Cop II), COVID-19.Allen Garfield, Actor in 'The Conversation,' 'The Stunt Man' and 'Nashville,' Dies at 80 *Henry Graff, 98, American historian and political writer, COVID-19.Henry Graff *Irene Hirano, 71, American business executive, President of U.S.-Japan Council (since 2009) and the Japanese American National Museum (2008–2012), leiomyosarcoma.Irene Hirano Inouye, widow of Sen. Inouye, dies at 71 *Sasi Kalinga, 59, Indian actor (Paleri Manikyam: Oru Pathirakolapathakathinte Katha, Pranchiyettan & the Saint, Indian Rupee), liver disease.Actor Sasi Kalinga passes away *Mishik Kazaryan, 72, Armenian-born Russian physicist, USSR State Prize awardee (1980), COVID-19.Профессор-физик Мишик Казарян умер в Москве от осложнений COVID-19 *Jan Křen, 89, Czech historian, academic and dissident, Charter 77 signer, COVID-19.Ve věku 89 let zemřel profesor, historik a disident Jan Křen. *Yaakov Perlow, 89, American Novominsk rebbe, President of Agudah (since 1998), COVID-19.Head of Agudath Israel, the Novominsker Rebbe, Succumbs to the Coronavirus at 89 *John Prine, 73, American singer-songwriter (\"Sam Stone\", \"Angel from Montgomery\") and guitarist, Grammy winner (1992, 2006), COVID-19.John Prine, One of America’s Greatest Songwriters, Dead at 73 *Barbara Smoker, 96, British humanist activist, President of the National Secular Society (1972–1996).Veteran UK atheist Barbara Smoker dies aged 96 *André Stordeur, 79, Belgian electronic musician.In memoriam: André Stordeur (1941–2020) *Jan Reijnen, 93, Dutch politician, mayor of Wervershoof (1964–1969), Oldenzaal (1969–1976) and Heerlen (1976–1986), Senator (1972–1977).Oud-burgemeester van Oldenzaal Jan Reijnen (93) overleden *Miguel Ángel Tábet, 78, Venezuelan theologian, COVID-19.Falleció en Roma el padre venezolano de ascendencia libanesa, Miguel Ángel Tábet *Harry Wouters van den Oudenweijer, 86, Dutch equestrian show jumper, European team champion (1977).Oud-ruiter Wouters (86), lid van Sportploeg van 1977, overleden ===8=== *Dirk van den Broek, 96, Dutch businessman, founder of Dirk and D-reizen.Supermarket founder Dirk van den Broek dies age 96 *Jaroslava Brychtová, 95, Czech glass artist, heart failure. *Robert L. Carroll, 81, American-Canadian paleontologist, COVID-19.COVID-19 has taken our parents, our grandparents, our friends. Here are a few, to help remember the many | National Post *Carl Dobkins Jr., 79, American rockabilly singer (\"My Heart Is an Open Book\").Carl E. Dobkins *Peter Ecklund, 74, American jazz cornetist, problems caused by Parkinson's disease.Cornetist Peter Ecklund has died *Madeleine Fischer, 84, Italian actress (Le Amiche, The Bachelor, The Day the Sky Exploded).Addio a Madeleine Fischer, la «ragazza triste» di Antonioni *Glenn Fredly, 44, Indonesian R&B; singer-songwriter, record producer and guitarist, meningitis.Glenn Fredly Meninggal Dunia *Miguel Jones, 81, Equatoguinean-born Spanish footballer (Barakaldo, Indautxu, Atlético Madrid), COVID-19.Muere por coronavirus Miguel Jones, otra leyenda del Atlético de Madrid *Francesco La Rosa, 93, Italian footballer (Pro Patria, Palermo, national team), COVID-19.Dalla serie A alla morte al Pat: addio a Francesco La Rosa *Lars-Eric Lundvall, 85, Swedish ice hockey player (national team, Frölunda), world champion (1962) and Olympic silver medalist (1964).Frölundas första guldkapten död *Valeriu Muravschi, 70, Moldovan politician, Prime Minister (1991–1992), Minister of Finance (1990–1991) and MP (1998–2001).Скончался бывший премьер Молдовы Валериу Муравски *Norman I. Platnick, 68, American biological systematist and arachnologist, problems caused from a fall.One of the fathers of modern Arachnology has just passed away, Norm Platnick *John A. Rocco, 83, American politician, Mayor of Cherry Hill (1975–1977) and member of the New Jersey General Assembly (1980–1998), respiratory failure.Dr. John A. Rocco, South Jersey educator, politician, and family man, dies at 83 *Chynna Rogers, 25, American rapper and model, accidental drug overdose.Chynna Rogers, Philadelphia rapper, dies of drug overdose at 25 *Pat Stapleton, 79, Canadian ice hockey player (Boston Bruins, Chicago Blackhawks, Indianapolis Racers), problems caused by stroke. *Linda Tripp, 70, American civil servant and whistleblower (Lewinsky scandal), pancreatic cancer.Linda Tripp dead: Clinton sex scandal whistleblower dies from cancer aged 70 *Te Huirangi Waikerepuru, 91, New Zealand trade unionist and Māori language activist. *Albert H. Wilkening, 74, American major general, pancreatic cancer.ormer Wisconsin National Guard leader, retired Maj. Gen. Albert Wilkening, dies after battling cancer *Rick May, 79, Canadian-American voice actor, COVID-19. ===9=== *Raj K. Aggarwal, 70, Kenyan-born British businessman, COVID-19. *Dame Jocelyn Barrow, 90, British educator, community activist and politician, co-founder of Campaign Against Racial Discrimination.Obituary: Dame Jocelyn Barrow, pioneer who was champion of race equality *Jim Bolger, 88, American baseball player (Cincinnati Reds, Chicago Cubs).Purcell all-state athlete, Cincinnati Reds outfielder Jim Bolger dead at 88 *Malcolm Dixon, 66, English actor (Time Bandits, Return of the Jedi, Willy Wonka & the Chocolate Factory).Malcolm Dixon, Leektar the Ewok in Return of the Jedi, Has Passed Away (death announced on this date) *Mort Drucker, 91, American caricaturist and comics artist (Mad).Mort Drucker, the iconic Mad magazine cartoonist, dies at 91 *Paul Gilissen, 85, Dutch politician, Mayor of Valkenburg-Houthem (1976–1982) and Valkenburg aan de Geul (1982–1990, 1991).Oud-burgemeester Paul Gilissen van Valkenburg overleden *Zdeněk Jičínský, 91, Czech lawyer and politician, Deputy (1996–2002, 2003–2010).Zemřel právník a někdejší politik Zdeněk Jičínský *Bert van de Kamp, 73, Dutch music journalist.Voormalig OOR-redacteur Bert van de Kamp (73) overleden *Phyllis Lyon, 95, American gay rights activist, feminist writer (Lesbian/Woman) and editor (The Ladder), co-founder of Daughters of Bilitis and the first lesbian to get married in San Francisco.Lesbian pioneer Phyllis Lyon dies *Ernst-Georg Schwill, 81, German actor (Alarm in the Circus, A Berlin Romance, The Shield and the Sword), heart attack.Schauspieler Ernst-Georg Schwill gestorben *Junzo Sekine, 93, Japanese Hall of Fame baseball player (Osaka Kintetsu Buffaloes, Yomiuri Giants) and manager (Yakult Swallows).関根潤三さん死去 大洋とヤクルトで監督 93歳 *Dmitri Smirnov, 71, Russian-born British composer (Tiriel, The Lamentations of Thel), COVID-19.Скончался композитор Дмитрий Смирнов *Ksenia Tripolitova, 104, Russian-born French ballet dancer.Умерла старейшая русская балерина ===10=== *Bruce Baillie, 88, American avant-garde filmmaker (Castro Street), founder of Canyon Cinema.Bruce Baillie, Catalytic Avant-Garde Filmmaker, Dies at 88 *Rifat Chadirji, 94, Iraqi architect (The Monument to the Unknown Soldier) and writer, COVID-19.Prominent Iraqi architect Rifat Chadirji dies in London aged 94 *Hilary Dwyer, 74, English actress (Witchfinder General, Wuthering Heights) and movie producer (An Awfully Big Adventure), COVID-19.Hilary Heath, Actress in 'Witchfinder General,' Dies of COVID-19 Complications at 74 (death announced on this date) *Frits Flinkevleugel, 80, Dutch footballer (national team, FC Amsterdam, DWS), COVID-19.Oud-international Flinkevleugel, die met DWS historie schreef, overleden *Ronald J. Kurth, 88, American Navy rear admiral and educator, Chief of Naval Operations (1981–1983) and President of the Naval War College (1987–1990).Rear Adm. Ronald J. Kurth, 45th President, Naval War College, Passes Away *Marianne Lundquist, 88, Swedish Olympic swimmer (1948, 1952), COVID-19.Gifta i 65 år – Marianne och Kjell dog i corona *Jymie Merritt, 93, American jazz bassist (The Jazz Messengers), liver cancer.Jymie Merritt, Bassist Who Brought a Rooted Yet Exploratory Spirit to Post-Bop, Dies at 93 *Enrique Múgica, 88, Spanish lawyer and politician, Minister of Justice (1988–1991), Deputy (1977–2000) and Ombudsman (2000–2010), COVID-19.Muere Enrique Múgica, ex ministro de Justicia y Defensor del Pueblo *Nobuhiko Obayashi, 82, Japanese movie director (House, Toki o Kakeru Shōjo, Hanagatami), screenwriter and editor, lung cancer.映画監督の大林宣彦氏、８２歳で死去 肺がんで余命３か月の宣告から３年８か月 *Carlo Sabatini, 88, Italian actor (Senso, Strangled Lives, Sacco & Vanzetti).Carlo Sabatini, morto il doppiatore di Morgan Freeman e Ian Mckellen *Hans Verhagen, 81, Dutch journalist, poet and painter.In Vlissingen geboren dichter Hans Verhagen overleden: ‘Zonder overdrijving de grootste dichter van Nederland’ *Tom Webster, 71, Canadian ice hockey player (Boston Bruins, Detroit Red Wings, California Golden Seals) and coach, brain cancer.Tom Webster, former Kings coach and standout WHA player, dies at 71 *Iris M. Zavala, 83, Puerto Rican author, independence activist and educator, COVID-19.Muere la escritora puertorriqueña Iris Zavala por coronavirus en España ===11=== *Simon Barrington-Ward, 89, English Anglican clergyman, General–Secretary of Church Missionary Society (1975–1985) and Bishop of Coventry (1985–1997).Bishop Simon Barrington-Ward has died *Colby Cave, 25, Canadian ice hockey player (Boston Bruins, Edmonton Oilers), problems caused by intracerebral hemorrhage.RIP, Colby Cave *John Horton Conway, 82, English mathematician (Conway's Game of Life, surreal numbers, monstrous moonshine), COVID-19.COVID-19 Kills Renowned Princeton Mathematician, 'Game Of Life' Inventor John Conway In 3 Days *Kristin Jacobs, 60, American politician, Mayor of Broward County (2004–2005, 2012–2013) and member of the Florida House of Representatives (since 2014), colon cancer. *Edem Kodjo, 81, Togolese politician, Prime Minister (1994–1996, 2005–2006) and Chairperson of the African Union Commission (1978–1983).Edem Kodjo: Togo mourns ex-Prime Minister, Africa remembers ex-OAU chief *Muid Latif, 41, Malaysian web designer and graphic artist.In Memory of Muid Latif *Liu Dehai, 82, Chinese pipa player.琵琶大师刘德海病逝，终年82岁 *Wynn Handman, 97, American educator and artist, co-founder of The American Place Theatre, pneumonia caused by COVID-19.Wynn Handman, co-founder of the American Place Theatre, dies at 97 *Lowell A. Reed Jr., 89, American politician and lawyer, Judge for the U.S. District Court for East Pennsylvania (since 1988), problems caused by Parkinson's disease.Lowell Reed Jr., federal judge in Philadelphia for more than two decades, dies at 89 *Gus Rodríguez, 59, Mexican video game journalist and voice actor, lung cancer.Muere Gus Rodríguez, escritor, conductor y gamer, confirmó su amigo Eugenio Derbez *Alojz Uran, 75, Slovenian Roman Catholic prelate, Auxiliary Bishop (1992–2004) and Archbishop of Ljubljana (2004–2009).Umrl je upokojeni ljubljanski nadškof metropolit Alojz Uran ===12=== *Eliyahu Bakshi-Doron, 78, Israeli rabbi, Rishon LeZion (1993–2003), COVID-19.Former Chief Rabbi Eliyahu Bakshi-Doron passes away of coronavirus *Camillo Ballin, 75, Italian Roman Catholic prelate, Apostolic Vicar of Northern Arabia (since 2001).Apostolic Vicar of Northern Arabia, Bishop Camillo Ballin passes away at 75 *Glenn Beckert, 79, American baseball player (Chicago Cubs, San Diego Padres).Former Cubs second baseman Glenn Beckert has died *Axel Berg, 81, Norwegian footballer (Lyn, national team).Til Minne Om Axel Berg *Peter Bonetti, 78, English footballer (Chelsea, Dundee United, national team), world champion (1966).Peter Bonetti dead: Former Chelsea and England goalkeeper 'The Cat' passes away, aged 78 *Tim Brooke-Taylor, 79, English comedian (The Goodies) and panellist (I'm Sorry I Haven't a Clue), COVID-19.Tim Brooke-Taylor dead: Comedian and actor dies aged 79 after contracting coronavirus *Chung Won-shik, 91, South Korean politician, Prime Minister (1991–1992), kidney disease.'격동의 시대'를 살았던 보수원로, 정원식 전 국무총리 별세 *Anthony Causi, 48, American photographer (New York Post), COVID-19.Anthony Causi, beloved Post sports photographer, dies of coronavirus at 48 *Jacques De Decker, 74, Belgian writer.Jacques De Decker, écrivain et ancien journaliste au «Soir», a tiré sa révérence *Louis van Dijk, 78, Dutch pianist, cancer.Pianist Louis van Dijk overleden *Ted Evans, 79, Australian politician and economist, Secretary of the Department of the Treasury (1993–2001).Former Treasury secretary Ted Evans dead at 79 *Jim Frey, 88, American baseball manager (Kansas City Royals, Chicago Cubs).Former Royals, Cubs Manager Jim Frey Dies at Age 88 *Keiji Fujiwara, 55, Japanese voice actor (Fullmetal Alchemist, Death Note, Attack on Titan), cancer.声優・藤原啓治さん死去 55歳 『クレヨンしんちゃん』野原ひろし役など *Danny Goldman, 80, American actor (The Smurfs, M*A*S*H, Young Frankenstein), problems caused by multiple strokes. *Tarvaris Jackson, 36, American football player (Minnesota Vikings, Seattle Seahawks, Buffalo Bills), car crash.Former NFL QB Tarvaris Jackson dies in car crash *Jacques Maury, 99, French pastor, President of Reformed Church of France (1968–1977) and Chair of the World Council of Churches (1981–1990).Jacques Maury, un raconteur d'H (h)istoire, par le pasteur Stéphane Lavignotte *Charles Miossec, 81, French politician, Deputy (1978–2002).Finistère. Décès de Charles Miossec, ancien président du conseil général et maire de Landisiviau *Sir Stirling Moss, 90, British Hall of Fame Formula One driver.F1 legend Sir Stirling Moss dies, age 90 *Jon Ola Norbom, 96, Norwegian economist and politician, Leader of the Young Liberals (1950–1952) and Minister of Finance (1972–1973).Jon Ola Norbom *Ahfazur Rahman, 78, Pakistani journalist, poet and progressive political writer.Progressive journalist-poet and activists Ahfazur Rahman passed away *Joel M. Reed, 86, American movie director, producer and screenwriter (The G.I. Executioner, Blood Sucking Freaks, Night of the Zombies), COVID-19.Joel M. Reed Dies, Bloodsucking Freaks Director Was 86 *Doug Sanders, 86, American golfer, problems caused by dementia. *Charles Alexander Shaw, 75, American politician and lawyer, Judge of the U.S. District Court for Eastern Missouri (since 1993).Statement on the Passing of Hon. Charles A. Shaw *Bernard Stalter, 63, French businessman and politician, member of the Regional Council of Grand Est (since 2016) and the French Economic, Social and Environmental Council (since 2015), COVID-19.Coronavirus : Bernard Stalter, président de la chambre des métiers d'Alsace et de France, est mort ===13=== *Elisabeth Berge, 65, Norwegian businesswoman and politician, Under-Secretary of Petroleum and Energy (2004–2019).Minneord om Elisabeth Berge *Jacques Blamont, 93, French astrophysicist and writer, member of the Academy of Technologies (since 2000).L’astrophysicien, Jacques Blamont, un des pères de l’aventure spatiale française, est mort *Juan Cotino, 70, Spanish businessman and politician, Directorate-General of the Police (1996–2002), Deputy (2007–2014) and President of Valencian Courts (2011–2014), COVID-19.Muere por coronavirus Juan Cotino, exdirector de la Policía Nacional y antiguo dirigente del PP *Ashok Desai, 77, Indian politician and lawyer, Solicitor General (1989–1990) and Attorney General (1996–1998).Senior Advocate And Former Attorney General For India Ashok Desai Passes Away *Ryo Kawasaki, 73, Japanese jazz fusion guitarist, composer and software programmer (Kawasaki Synthesizer).Suri Ryo Kawasaki *Landelino Lavilla Alsina, 85, Spanish politician and lawyer, Minister of Justice (1976–1979), Senator (1977–1979), Deputy (1979–1983) and President of the Congress of Deputies (1979–1982).Muere Landelino Lavilla, ministro de Justicia con Suárez y presidente del Congreso el 23-F *Vicente Magsaysay, 80, Filipino politician, Governor of Zambales (1968–1986, 1998–2007).Former Zambales governor Vic Magsaysay passes away *Rick May, 79, American voice actor (Team Fortress 2, Star Fox 64), COVID-19.Rick May, voice of the Soldier in Team Fortress 2, has died *Moraes Moreira, 72, Brazilian guitarist and singer (Novos Baianos), heart attack.Morre o cantor e compositor Moraes Moreira *U Pannya Jota Mahathera, 64, Bangladeshi Theravada Buddhist monk and judge, founder of Buddha Dhatu Jadi, cardiac arrest.Buddhist monk U Pannya Jota Mahathera passes away *Dennis G. Peters, 82, American chemist, COVID-19.In memory of Prof. Dennis G. Peters 1937-2020 *M. V. Rajasekharan, 91, Indian politician, MP (1967–1970). *Ann Sullivan, 91, American animator (The Lion King, The Little Mermaid, Atlantis: The Lost Empire), COVID-19.Ann Sullivan, Longtime Disney Animator, Is Third Coronavirus Death At Motion Picture Home Facility ===14=== *Pip Baker, 91, British screenwriter (Doctor Who), problems caused by a fall.Pip Baker 1928 - 2020 *Haydar Baş, 73, Turkish politician and media businessman, founder and Leader of the Independent Turkey Party (since 2002), COVID-19.Лидер турецкой партии умер от COVID-19 *Miguel Ángel D'Annibale, 61, Argentine Roman Catholic bishop, Bishop of Río Gallegos (2013–2018) and San Martín (since 2018), acute myeloid leukaemia.Falleció Mons. Miguel Ángel D'Annibale, obispo de San Martín *Mario Donatone, 86, Italian actor (Phenomena, The Godfather Part III, John Wick: Chapter 2).Addio all’attore Mario Donatone, da sicario del Padrino 3 ai film di Tomas Milian *Margit Feldman, 90, Hungarian-American educator, activist, and Holocaust survivor, COVID-19.Holocaust survivor who shared her story with students dies from coronavirus *John Forester, 90, American engineer and cycling activist.Death Of A ‘Dinosaur:’ Anti-Cycleway Campaigner John Forester Dies, Aged 90 *Cyril Lawrence, 99, English footballer (Rochdale, Wrexham), COVID-19.99 year old Salford man and ex-pro footballer beaten by coronavirus *Kerstin Meyer, 92, Swedish mezzo-soprano.Hovsångerskan Kerstin Meyer död *Luis Parodi Valverde, 83, Ecuadorian engineer and politician, Vice President (1988–1992).El exvicepresidente Luis Parodi falleció en Guayaquil por complicaciones de salud *Ignacio Pichardo Pagaza, 84, Mexican politician, Governor of the State of Mexico (1989–1993) and President of the Institutional Revolutionary Party (1994), problems caused by surgery.Murió Ignacio Pichardo Pagaza, ex gobernador del Estado de México y ex secretario de Energía *Sir Hugh Rossi, 92, British politician, MP (1966–1992) and Minister for Social Security (1981–1983). (death announced on this date) *Hank Steinbrenner, 63, American businessman, co-owner of the New York Yankees (since 2008), problems caused by liver disease.Hank Steinbrenner, Yankees co-owner, dead at 63 *Ron Wylie, 86, Scottish football player (Notts County, Aston Villa, Birmingham City) and manager.Aston Villa and Birmingham City stalwart Ron Wylie dies aged 86 ===15=== *Adam Alsing, 51, Swedish television and radio presenter (Big Brother, Adam Live, Mix Megapol), COVID-19.Adam Alsing död i Covid19 *Sean Arnold, 79, English actor (Grange Hill, Bergerac).Bergerac star Sean Arnold dies *John Briggs, 90, American politician and anti-LGBTQ+ activist (Briggs Initiative), member of the California State Assembly (1967–1976) and State Senate (1976–1982).Remembering state Sen. John Briggs *Joe Brown, 89, English mountaineer.Climbing Pioneer Joe Brown dies aged 89 *Ranjit Chowdhry, 64, Indian actor (Bollywood/Hollywood, The Office, Last Holiday), problems caused by gastrointestinal bleeding.Khubsoorat actor Ranjit Chowdhry passes away at the age of 65 *Eddie Cooley, 87, American R&B; singer-songwriter (\"Fever\", \"Priscilla\"). Eddie Cooley, April 15, 1933 - April 15, 2020 *Allen Daviau, 77, American cinematographer (E.T. the Extra-Terrestrial, The Color Purple, Empire of the Sun), COVID-19.Allen Daviau, Spielberg Cinematographer and Five-Time Oscar Nominee, Dies of Coronavirus Complications at 77 *Willie Davis, 85, American Hall of Fame football player (Cleveland Browns, Green Bay Packers) and media businessman, kidney failure. *Bernard Deconinck, 83, French track cyclist, amateur world motor-paced silver medallist (1959).Bernard Deconinck RIP *Brian Dennehy, 81, American actor (First Blood, Cocoon, Romeo + Juliet), Tony (1999, 2003) and Golden Globe (2000) winner, cardiac arrest caused by sepsis.‘Dynasty’ star Brian Dennehy dies at 81 *Rubem Fonseca, 94, Brazilian writer (A Grande Arte, The Taker and Other Stories) and translator, heart attack.Morre o escritor Rubem Fonseca aos 94 anos *Dámaso García, 63, Dominican baseball player (Toronto Blue Jays, Montreal Expos) and footballer (national team).Former Blue Jays 2B Damaso Garcia dies at 63 *Ed Genson, 78, American lawyer (R. Kelly, Rod Blagojevich, Conrad Black), bile duct cancer.Legendary criminal defense attorney Ed Genson, who represented the famous and the infamous, has died *Henry Grimes, 84, American jazz musician, COVID-19.Bassist Henry Grimes dies at 84 *Dries Holten, 84, Dutch singer-songwriter (Rosy & Andres), Eurovision contestant (1972).Zanger Dries Holten (84) overleden *Sir John T. Houghton, 88, Welsh atmospheric physicist, co-chair of the Intergovernmental Panel on Climate Change and founder of the Hadley Centre, COVID-19.From the archives: Interview: Sir John Houghton, meteorologist, climate-change expert *Lee Konitz, 92, American jazz composer and alto saxophonist, COVID-19. Jazz innovator Lee Konitz has died of Covid-19 at age 92 *Gérard Mulumba Kalemba, 82, Congolese Roman Catholic bishop, Bishop of Mweka (1989–2017), COVID-19.RDC: l’oncle du président Tshisekedi, Gérard Mulumba Kalemba, meurt du coronavirus *Ashley Mattingly, 33, American model (Playboy), suicide.Former Playboy playmate Ashley Mattingly dies by suicide *Gary McSpadden, 77, American gospel singer-songwriter (The Imperials, The Gaither Vocal Band), pastor and television host (PTL Today), pancreatic cancer.Gary McSpadden passes away *George Curtis Smith, 84, American politician and lawyer, Judge of the U.S. District Court for Southern Ohio (since 1987), heart and kidney failure. ===16=== *Christophe, 74, French singer-songwriter (\"Aline\"), keyboardist and record producer, problems caused by COPD and COVID-19.Le chanteur Christophe est mort *Gene Deitch, 95, American illustrator, animator (Munro, Tom Terrific, Nudnik) and comics artist, bowel obstruction. *Francesco Di Carlo, 79, Italian mobster (Sicilian Mafia), COVID-19.Coronavirus, morto a Parigi il pentito Francesco Di Carlo *Howard Finkel, 69, American Hall of Fame wrestling ring announcer (WWE), problems caused by brain disease.WWE Hall of Famer Howard Finkel passes away *Danièle Hoffman-Rispal, 68, French politician, Deputy (2002–2012).Danièle Hoffman-Rispal, ancienne députée et conseillère de Paris, est décédée (death announced on this date) *Jane Dee Hull, 84, American politician, Secretary of State (1995–1997) and Governor of Arizona (1997–2003).Former Arizona Gov. Jane Dee Hull and her husband die within hours of each other *Milena Jelinek, 84, Czech-American screenwriter (Forgotten Light), playwright and educator, COVID-19.US-Based Screenwriter and Teacher Milena Jelinek Dies At 84 *Ulrich Kienzle, 83, German author and journalist (ARD, ZDF).Zum Tod von Ulrich Kienzle: Auslandskorrespondent blieb er sein Leben lang *Leonie Kooiker, 92, Dutch children's writer (Het oerlanderboek, Het malle ding van bobbistiek).Leonie Kooiker (1927-2020) *Santiago Lanzuela, 71, Spanish politician, President of the Government of Aragon (1995–1999), COVID-19.Muere el expresidente Santiago Lanzuela *Arne Nilsen, 96, Norwegian politician, Minister of Local Government (1978–1979) and Social Affairs (1979–1981).Tidligere statsråd Arne Ragnar Nilsen er død *Luis Sepúlveda, 70, Chilean novelist and journalist, COVID-19.El escritor chileno Luis Sepúlveda muere con coronavirus en Oviedo *Jack Wallace, 86, American actor (Death Wish, Eagleheart, Boogie Nights).Actor Jack Wallace is dead at 86: From Chicago’s Kingston Mines, he was a tough guy for real and Mamet’s muse ===17=== *Bennie G. Adkins, 86, American Army Green Beret and intelligence sergeant major, Medal of Honor recipient, COVID-19.Medal of Honor recipient Bennie Adkins has died of coronavirus *Barney Ales, 85, American record producer and executive (Motown).Barney Ales, Indispensable Motown Executive, Is Dead at 85 *Jean-François Bazin, 77, French journalist (Les Echos, Le Moniteur Universel) and politician, Municipal Councillor for Dijon (1971–2008).Jean-François Bazin ancien président du Conseil Régional de Bourgogne est mort *Carlos Contreras Guillaume, 81, Chilean footballer (Universidad de Chile, national team), problems caused by Alzheimer's disease.Muere Carlos ‘Pluto’ Contreras, mundialista de 1962 y baluarte del Ballet Azul *Sergio Fantoni, 89, Italian actor (Von Ryan's Express, Esther and the King, The Manageress).È morto Sergio Fantoni, una vita per cinema e sceneggiati *Norman Hunter, 76, English football player (Leeds United, Bristol City, national team) and manager, world champion (1966), COVID-19.Norman Hunter, former Leeds and England defender, dies aged 76 *Abba Kyari, 67, Nigerian politician, Chief of Staff to the President (since 2015), COVID-19. *Giuseppi Logan, 84, American jazz musician, COVID-19.Giuseppi Logan, Free-Jazz Multireedist Who Returned Once From Oblivion, Has Died at 84 *Lukman Niode, 56, Indonesian Olympic swimmer (1984), COVID-19.Olimpian Indonesia Lukman Niode Meninggal Dunia *Matthew Seligman, 64, English new wave bassist (The Soft Boys, Thompson Twins), COVID-19.The Soft Boys’ Matthew Seligman Has Died *Robin Seymour, 94, American disc jockey, creator of Swingin' Time and Teen Town.Detroit radio, TV personality Robin Seymour dies at 94 *Jesús Vaquero, 70, Spanish neurosurgeon, COVID-19.Fallece a los 70 años el prestigioso neurocirujano Jesús Vaquero Crespo *Bobby Winkles, 90, American Hall of Fame baseball coach (Arizona State Sun Devils) and manager (California Angels, Oakland Athletics).Bobby Winkles, former Arizona State baseball coaching great, dies at 90 ===18=== *Allan Gotlieb, 92, Canadian public servant, Ambassador to the United States (1981–1989), cancer and Parkinson's disease.Former ambassador and public servant Allan Gotlieb dies at 92 *Bob Lazier, 81, American racing driver (CART), COVID-19.Former CART Rookie of the Year Bob Lazier dies at 81 *Paul H. O'Neill, 84, American businessman (Alcoa, RAND) and politician, Secretary of the Treasury (2001–2002), lung cancer. *Willy Quadackers, 82, Dutch footballer (Fortuna '54, MVV Maastricht, national team).Voormalig international Willy Quadackers (82) overleden *Jacques Rosny, 81, French actor (The Tenant, Catherine & Co., L.627) and comedian, COVID-19.La mort du comédien Jacques Rosny *Claude Silberzahn, 85, French politician, Prefect of French Guiana (1982–1984), Seine-Maritime (1985–1986) and Doubs (1986–1989), Director of the Directorate-General for External Security (1989–1993) and Mayor of Simorre (2001–2014).Mort de Claude Silberzahn, directeur général de la DGSE de 1989 à 1993 *Erik Súñiga, 44, Salvadorean-born Guatemalan politician, Mayor of Ayutla, San Marcos (2008–2019), pancreatic cancer.Fallece Erik Súñiga, exalcalde de Tecún Umán señalado por Estados Unidos de narcotráfico *Lucien Szpiro, 78, French mathematician, member of the Academia Europaea (since 2014), heart failure.Lucien Szpiro 1941-2020 *Richard Wood, 93, American business executive, President and CEO of Eli Lilly and Company (1973–1991).Former Eli Lilly head Richard Wood dies; led company for nearly two decades (death announced on this date) ===19=== *Edmond Baraffe, 77, French football player (Toulouse, national team) and manager (Le Touquet).Edmond Baraffe, ancien entraîneur du Touquet, est décédé *Peter Beard, 82, American photographer.Famed Photographer Peter Beard Dead at 82: 'He Died Where He Lived: In Nature,' His Family Says (body discovered on this date) *Noach Dear, 66, American politician and lawyer, Justice of the New York Supreme Court (since 2015), COVID-19.Former City Councilman Noach Dear dies of coronavirus *John A. Gordon, 73, American general and politician, Deputy Director of the Central Intelligence Agency (1997–2000), Under Secretary of Energy for Nuclear Security (2000–2002) and Homeland Security Advisor (2003–2004).John Gordon, Aug. 22, 1946 — April 19, 2020 *Índio, 89, Brazilian footballer (Flamengo, Espanyol, national team).Morre Índio, décimo maior artilheiro da história do Flamengo *Sergio Onofre Jarpa, 99, Chilean politician, Senator (1973, 1990–1994) and Minister of the Interior (1983–1985), COVID-19.Falleció el ex senador Sergio Onofre Jarpa, uno de los fundadores de RN *Aleksandr Kapto, 87, Ukrainian-Russian sociologist, political scientist and politician, Ambassador to Cuba (1985–1990) and North Korea (1990–1991) and Chair of the Institute of Socio-Political Research (since 2008).О кончине А.С.Капто *Claude Lafortune, 83, Canadian television presenter (Sol et Gobelet), sculptor and costume designer, COVID-19.L'animateur Claude Lafortune emporté par la COVID-19 *Philippe Nahon, 81, French actor (High Tension, I Stand Alone, Calvaire), COVID-19.Le comédien Philippe Nahon est mort *Bob Oliver, 77, American baseball player (Kansas City Royals, California Angels, Pittsburgh Pirates).Member of inaugural Royals team Bob Oliver dead at 77 *Alexander Vustin, 76, Russian composer (The Devil in Love), pneumonia.От пневмонии умер композитор Александр Вустин *Ian Whitcomb, 78, English singer-songwriter (\"You Turn Me On\") and author, problems caused by a stroke. Ian Whitcomb ‘You Turn Me On’ Singer, Dead at 78 *Gabriel Wortman, 51, Canadian denturist and mass murderer, perpetrator of the Nova Scotia killings, shot.Nova Scotia shooting: shock at killings by 'quiet, gentle' denturist ===20=== *Heherson Alvarez, 80, Filipino politician, Minister of Agrarian Reform (1986–1987), Senator (1987–1998) and member of the House of Representatives (1998–2001), COVID-19.Former Senator Heherson Alvarez passes away after battling COVID-19 *Mike Curtis, 77, American football player (Baltimore Colts, Seattle Seahawks, Washington Redskins) and autobiographer.Baltimore Colts Linebacker 'Mad Dog' Mike Curtis Passes Away *Claude Evrard, 86, French actor (Circus Angel, Le Distrait, If the Sun Never Returns).La mort de Claude Evrard *Horacio Fontova, 73, Argentine singer-songwriter, actor (The Plague, Aballay, Underdogs) and comedian, cancer.Argentine Musician, Actor & Comedian Horacio Fontova Dies at 73 *Tom Lester, 81, American actor (Green Acres, Benji, Gordy), problems caused by Parkinson's disease.Thomas William Lester *Krystyna Łybacka, 74, Polish politician, MP (1991–2014), Minister of National Education and Sport (2001–2004) and MEP (2014–2019).Krystyna Łybacka nie żyje. Była minister edukacji miała 74 lata *Ronan O'Rahilly, 79, Irish businessman, founder of Radio Caroline, vascular dementia.Radio Caroline founder Ronan O’Rahilly has died *Gabriel Retes, 73, Mexican movie director (Paper Flowers, Broken Flag, A Sweet Scent of Death).Murió el cineasta Gabriel Retes, director de “El Bulto” *Rudratej Singh, 46, Indian businessman, CEO of BMW India (since 2019), cardiac arrest.Rudratej Singh, President & CEO of BMW Group India is no more *Arsen Yegiazarian, 49, Armenian chess grandmaster and FIDE trainer.Մահացել է գրոսմայստեր Արսեն Եղիազարյանը ===21=== *Richard Akinjide, 89, Nigerian politician and jurist, Minister of Justice (1979–1983).Richard Akinjide, Former Justice Minister, Is Dead *Koos van den Berg, 77, Dutch politician, MP (1986–2002), COVID-19.Oud-SGP-Kamerlid Van den Berg overlede *José María Calleja, 64, Spanish journalist (CNN+), political prisoner and anti-ETA activist, COVID-19.José María Calleja fallece por coronavirus *Ernest Courant, 100, German-born American physicist (Brookhaven National Laboratory), helped create modern-day particle accelerator ideas and member of the National Academy of Sciences.Ernest Courant *Dimitri Diatchenko, 52, American actor (Chernobyl Diaries, Indiana Jones and the Kingdom of the Crystal Skull, Get Smart), heart attack.'Chernobyl Diaries' Star Dimitri Diatchenko Dead at 52 *Abdurrahim El-Keib, 70, Libyan politician and businessman, Acting Prime Minister (2011–2012), heart attack.Former Libyan Premier El-Keib Dead After Heart Attack *Derek Jones, 35, American rock guitarist (Falling in Reverse).R.I.P. Derek Jones, Falling in Reverse Guitarist Dies at 35 *Donald Kennedy, 88, American politician, biologist, journalist (Science) and educator, Commissioner of Food and Drugs (1977–1979) and President of Stanford University (1980–1992), COVID-19.Former Stanford President Donald Kennedy dies at 88 of COVID-19 *Liu Ping-wei, 67, Taiwanese politician, MLY (1999–2002), oral cancer.前台灣省議會議長劉炳偉病逝 享壽67歲 *Lewis MacAdams, 75, American conservationist, poet and artist, co-founder of FoLAR, problems caused by Parkinson's disease.Lewis MacAdams, famed crusader for the Los Angeles River, dies at 75 *Teruyuki Okazaki, 88, Japanese karate master, founder of the International Shotokan Karate Federation, COVID-19.Fallece el sensei Teruyuki Okazaki *Jacques Pellen, 63, French jazz guitarist, COVID-19.Coronavirus : le guitariste breton Jacques Pellen est décédé *Laisenia Qarase, 79, Fijian politician, Prime Minister (2000–2001, 2001–2006).Laisenia Qarase, former Fiji PM bookended by coups, dies at 79 *Joel Rogosin, 87, American television producer and writer (The Virginian, Ironside, Magnum, P.I.), COVID-19.Joel Rogosin, Producer on 'The Virginian,' Ironside' and 'Magnum, P.I.,' Dies of COVID-19 Complications at 87 *Florian Schneider, 73, German electronic pop singer and musician (Kraftwerk), cancer.Kraftwerk Co-Founder Florian Schneider Dies at Age 73 *Miguel Ángel Troitiño, 72–73, Spanish geographer, COVID-19.Fallece con coronavirus Miguel Ángel Troitiño, geógrafo \"clave\" en la declaración de Cuenca como Ciudad Patrimonio *Betsy Wyeth, 98, American model and art preservationist.Betsy Wyeth, Andrew Wyeth’s Widow and Collaborator, Dies at 98 *Shōmei Yokouchi, 78, Japanese politician, MP (1993–2002) and Governor of Yamanashi Prefecture (2007–2015).知事を２期８年 横内正明元知事が死去 ７８歳 ===22=== *Terence Frisby, 87, British playwright (There's a Girl in My Soup) and actor.Terence Frisby, actor and playwright who made his name with ‘There’s a Girl in My Soup’ – obituary *El Príncipe Gitano, 88, Spanish flamenco singer and actor, COVID-19.Fallece por coronavirus a los 88 años el 'Príncipe gitano' *Hartwig Gauder, 65, German race walker and architect, Olympic champion (1980), heart attack caused by kidney failure.Trauer um Geher-Legende Hartwig Gauder *Jimmy Goodfellow, 76, English football player (Workington, Rotherham United) and manager (Cardiff City).Jimmy Goodfellow: Former Cardiff City manager dies aged 76 *Rich Hacker, 72, American baseball player (Montreal Expos) and coach (St. Louis Cardinals, Toronto Blue Jays), leukemia.Former Cardinals coach Rich Hacker, a New Athens product like Herzog, dies at 72 *Saadat Husain, 73, Bangladeshi civil servant, Chairman of the Public Service Commission (2007–2011), kidney disease.Ex-cabinet secy Dr Saadat Husain passes away *Shirley Knight, 83, American actress (The Dark at the Top of the Stairs, Sweet Bird of Youth, As Good as It Gets), Tony (1976), Golden Globe (1995) and Emmy (1988, 1995) winner.Shirley Knight, Adventurous Actress and Two-Time Oscar Nominee, Dies at 83 *Marcos Mundstock, 77, Argentine musician, comedian and actor (Les Luthiers), brain tumour.Muere Marcos Mundstock, narrador de Les Luthiers, el mayor ingenio de las palabras *John E. Otto, 81, American politician, Acting Director of the FBI (1987).John E. Otto *Catherine Paysan, 93, French novelist and poet.L'auteure sarthoise Catherine Paysan est décédée *Paul Ronty, 91, Canadian ice hockey player (New York Rangers, Boston Bruins).Boston Bruin Paul Ronty, 91, NHL All-Star & Weston High Hockey Coach ===23=== *Bruce Allpress, 89, New Zealand actor (Came a Hot Friday, The Lord of the Rings: The Two Towers, The Water Horse: Legend of the Deep), problems caused by ALS.Kiwi actor Bruce Allpress dies aged 89 *James M. Beggs, 94, American businessman and politician, Administrator of NASA (1981–1985), congestive heart failure. *Norbert Blüm, 84, German politician, MP (1972–1981, 1983–2002) and Federal Minister for Social Affairs and Labour (1982–1998), problems caused by sepsis.Norbert Blüm gestorben *Heda Čechová, 91, Czech journalist and politician, member of the Czech National Council (1990–1992).Zemřela oblíbená televizní hlasatelka Heda Čechová. Bylo jí 91 let *Lloyd deMause, 88, American sociologist and psychohistorian, founder of Journal of Psychohistory.Lloyd deMause *Fred the Godson, 35, American DJ and rapper, COVID-19.Fred the Godson Dies at 35 From Coronavirus *Jacques Kazadi, 83, Congolese economist, professor, and politician.Jacques Kazadi Nduba wa Dile, par Dr. Godwin R. Murunga *Akira Kume, 96, Japanese actor (The Insect Woman, Tora-san's Sunrise and Sunset, The Resurrection of the Golden Wolf), heart failure.Narrator/Voice Actor Akira Kume Passes Away Due to Heart Condition *Henk Overgoor, 75, Dutch footballer (Go Ahead Eagles, De Graafschap), COVID-19.De Graagschap clubheld Henk Overgoor overleden *Dan Walters, 53, American baseball player (San Diego Padres) and police officer, problems caused by tetraplegia.Dan Walters, former Padre and San Diego police officer, dies at 53 ===24=== *Abdullah al-Hamid, 69, Saudi poet, human rights activist and political prisoner, co-founder of the Saudi Civil and Political Rights Association, stroke caused by electrical injury.وفاة المعارض السعودي البارز عبد الله الحامد في السجن *Ebrahim Amini, 94, Iranian politician, Member of the Assembly of Experts (1983–2007, since 2016).Ayatollah Ibrahim Amini Passes Away at 94 *Giuseppe Gazzoni Frascara, 84, Italian businessman and football executive, Chairman of Bologna (1993–2001).Il saluto del Bologna a Gazzoni *Tiede Herrema, 99, Dutch businessman, kidnapped by the Provisional Irish Republican Army in 1975.‘Great friend of Ireland’: IRA kidnap victim Tiede Herrema dies aged 99 *Grandma Lee, 85, American stand-up comedian, problems caused by a broken hip.'AGT' Season 4 Star Grandma Lee Dead at 85 *Stefan Lippe, 64, German insurance businessman, CEO of Swiss Re (2009–2012), COVID-19.Ex-Swiss Re CEO Dies of Coronavirus *Mircea Mureșan, 91, Romanian movie director (Răscoala, Blestemul pământului, blestemul iubirii, Toate pînzele sus).A murit regizorul Mircea Mureşan, rămas definitiv în memoria cinefililor datorită serialului „Toate pânzele sus“ *Yukio Okamoto, 74, Japanese politician and analyst, Adviser to the Prime Minister (1996–1998, 2003–2004), pneumonia caused by COVID-19.Japanese diplomatic analyst Okamoto dies of virus-caused pneumonia *Joseph S. Pulver Sr., 64, American horror novelist and poet, problems caused by COPD.Joseph S. Pulver, Sr. (1955-2020) *Lynn Faulds Wood, 72, Scottish television presenter (Watchdog) and journalist, stroke.Former Watchdog host Lynn Faulds Wood dies aged 72 *Harold Reid, 80, American country singer-songwriter (The Statler Brothers), Grammy winner (1965, 1965, 1972), kidney failure. *Graeme Watson, 75, Australian cricketer (national team) and rules footballer (Melbourne), cancer.Obituary: Graeme Watson *Lee Roy West, 90, American politician and lawyer, Judge of the U.S. District Court for Western Oklahoma (since 1979).Lee West ===25=== *Alan Abel, 91, American percussionist (Philadelphia Orchestra) and music educator, COVID-19.Alan Abel, Former Philadelphia Orchestra Percussionist and Renowned Teacher, Dies at 91 *India Adams, 93, American singer (The Band Wagon, Torch Song) and stage actress.Actress and Singer India Adams Dies at 93 *James B. Adams, 93, American politician and lawyer, Associate Director (1973–1979) and Acting Director of the FBI (1978), suspected heart attack.Colonel James Blackburn Adams *Erin Babcock, 38, Canadian politician, MLA (2015–2019), uterine cancer.Former Stony Plain MLA Erin Babcock dies of cancer *Ricardo Brennand, 92, Brazilian businessman and art collector, founder of Ricardo Brennand Institute, COVID-19.Morre Ricardo Brennand, vítima da Covid-19 *Fré Vooys-Bosma, 93, Dutch politician, member of The Hague City Council (1974–1990).Eerste vrouwelijke PVDA wethouder van Den Haag overleden *Per Olov Enquist, 85, Swedish author (The Visit of the Royal Physician) and journalist, multiple organ failure.Forfatteren P.O. Enquist er død *John W. Foss, 87, American Army general.FORMER TRADOC COMMANDER GEN. JOHN FOSS DIES *Thomas Huang, 83, Chinese-born American computer scientist.「華人計算機視覺鼻祖」黃煦濤逝世 享年84歲 *Henri Kichka, 94, Belgian writer, educator and Holocaust survivor, COVID-19.Coronavirus: Auschwitz survivor Henri Kichka dies of Covid-19 *Kim Chungyum, 96, South Korean politician, Minister of Finance (1966) and Industry (1967–1969), Chief of Staff to the President (1969–1979) and Ambassador to Japan (1979–1980).김정렴 전 비서실장 별세···\"차지철도 꼼짝못한 박정희정부 실세\" *Devanand Konwar, 77, Indian politician, Governor of West Bengal (2009–2010), Bihar (2009–2013) and Tripura (2013–2014).Assam: Former Bihar Governor Devanand Konwar passes away *Mahendra Kumar, 47, Indian political activist (Bajrang Dal) and criminal, co-perpetrator of the 2008 Karnataka Christian attacks, heart attack.JD(S) leader Mahendra Kumar no more *Zarina, 83, Indian-born American artist, problems caused by Alzheimer's disease.Artist Zarina Hashmi dies at 83 ===26=== *Emilio S. Allué, 85, Spanish-born American Roman Catholic prelate, Auxiliary Bishop of Boston (1996–2010), COVID-19.Bishop Bishop Emilio Simeón Allué Carcasona, S.D.B. *Tomás Balcázar, 88, Mexican footballer (Guadalajara, national team).Muere Tomás Balcázar, histórico de Chivas y abuelo de ‘Chicharito’ *Laura Bernal, 64, Argentine politician, Ambassador to Ireland (since 2016), COVID-19.Funeral of Argentinian Ambassador to take place in Mayo *Big Al Carson, 66, American blues and jazz singer, heart attack.\"Big Al\" Carson, New Orleans bluesman and Bourbon Street singer, dies at 66. *Giulietto Chiesa, 79, Italian journalist and politician, MEP (2004–2009).È morto Giulietto Chiesa, giornalista e politico *Guillermo Chifflet, 93, Uruguayan journalist and politician, Deputy (1989–2005) and co-founder of Frente Amplio.A los 93 años falleció Guillermo Chifflet, histórico dirigente socialista *Aarón Hernán, 89, Mexican actor (The Garden of Aunt Isabel, Apolinar, Deathstalker and the Warriors from Hell), heart attack.Actor Aarón Hernán dies at 89 years of age *Kauko Juhantalo, 77, Finnish politician, Minister of Trade and Industry (1991–1992) and MP (1979–1993, 1995–1999, 2003–2007, 2015–2019), cancer.Entinen kansanedustaja Kauko Juhantalo on kuollut *Nick Kotz, 87, American journalist and political writer, Pulitzer Prize winner (1968), hit by a car.Nick Kotz, author and Pulitzer Prize-winning journalist, dies at 87 *Ron Marlenee, 84, American politician, member of the U.S. House of Representatives from Montana's 2nd congressional district (1977–1993).Eight-term Montana congressman Ron Marlenee dies *Marcel Ospel, 70, Swiss banker, Chairman of UBS AG (2001–2008).UBS, è morto Marcel Ospel *Gideon Patt, 87, Israeli politician, member of the Knesset (1970–1996), Minister of Industry (1979–1984) and Tourism (1981, 1988–1992).Former MK Gideon Patt passes away at 87 *Carlos Regazzoni, 76, Argentine sculptor. *Henri Weber, 75, French politician, Senator (1995–2004) and MEP (2004–2014), COVID-19.Coronavirus : le décès de Henri Weber, figure du PS et de mai 68 ===27=== *Maryna Bazhanova, 57, Russian handball player, Olympic bronze medalist (1988, 1992).Скончалась трехкратная чемпионка мира по гандболу Марина Базанова *Eavan Boland, 75, Irish poet, stroke.Poet Eavan Boland passes away aged 75 *Sir Brian Brown, 85, British Royal Navy admiral, Second Sea Lord (1988–1991).Obituary: Sir Brian Brown *Lam Dorji, 86, Bhutanese military officer, COO of the Royal Bhutan Army (1964–2005). *Bernard Gersten, 97, American theatrical producer (New York Shakespeare Festival), Special Tony winner (2013), pancreatic cancer.Bernard Gersten, Major Player in New York Nonprofit Theatre World, Dies at Age 97 *Lynn Harrell, 76, American cellist, Music Director of the Los Angeles Philharmonic Institute (1988–1992), cardiac arrest.Luminary American Cellist Lynn Harrell Has Passed Away – Aged 76 *Robert Herbin, 81, French footballer (Saint-Étienne, national team) and manager (Red Star), heart failure.Robert Herbin passes away at the age of 81 *Ramon Jimenez Jr., 64, Filipino advertising businessman and politician, Secretary of Tourism (2011–2016). *Francesco Perrone, 89, Italian Olympic long-distance runner (1960), COVID-19.Ucciso dal virus il maratoneta che aveva sfidato Abebe Bikila *Mohammad Shariff, 99, Pakistani admiral, Chief of Naval Staff (1975–1979) and Chairman Joint Chiefs of Staff Committee (1977–1980).Former naval chief Muhammad Sharif passes away *Troy Sneed, 52, American gospel singer-songwriter, COVID-19.Jacksonville-area gospel singer Troy Sneed dies from coronavirus *Nur Yerlitaş, 64, Turkish fashion designer, brain cancer.Nur Yerlitaş’ın vasiyeti ortaya çıktı! *Young Jessie, 83, American R&B; singer-songwriter (The Flairs, The Coasters).Young Jessie (1936-2020) *Dragutin Zelenović, 91, Serbian politician and academic, Prime Minister (1991).Preminuo Dragutin Zelenović ===28=== *Jinnat Ali, 23, Bangladeshi record holder, tallest person in Bangladesh, brain cancer.Bangladesh’s tallest man dies *Louis Cardiet, 77, French footballer (Stade Rennais, Paris Saint-Germain, national team).Louis Cardiet, légende du Stade Rennais F.C., s’est éteint *Jamilur Reza Choudhury, 76, Bangladeshi engineer and educator, Vice-Chancellor of BRAC University (2001–2010) and University of Asia Pacific (since 2012), heart attack.Jamilur Reza Chowdhury passes away *Jill Gascoine, 83, British actress (The Gentle Touch, C.A.T.S. Eyes, The Onedin Line), problems caused by Alzheimer's disease.The Gentle Touch star Jill Gascoine dies aged 83 *Ladislav Hejdánek, 92, Czech philosopher and political dissident, Charter 77 signer.Zemřel profesor Hejdánek, signatář a mluvčí Charty 77 *Bobby Lewis, 95, American R&B; singer (\"Tossin' and Turnin'\"). *Robert May, Baron May of Oxford, 84, Australian scientist, Chief Scientific Advisor to the UK Government (1995–2000) and member of the House of Lords (2001–2017), pneumonia caused by Alzheimer's disease.Robert May, former UK chief scientist and chaos theory pioneer, dies aged 84 *Alexander Münninghoff, 76, Polish-born Dutch journalist (Haagsche Courant) and chess player.Alexander Münninghoff (76) overleden *Eddy Pieters Graafland, 86, Dutch footballer (Ajax, Feyenoord, national team).Legendarische Feyenoord-doelman Pieters Graafland (86) overleden *Michael Robinson, 61, English-born Spanish footballer (Brighton & Hove Albion, Liverpool, Republic of Ireland national team) and sports commentator, melanoma.Michael Robinson, former Liverpool and Brighton player, dies aged 61 *Syahrul, 59, Indonesian politician, Mayor of Tanjung Pinang (since 2018), COVID-19.Positif Corona COVID-19, Wali Kota Tanjungpinang Meninggal Dunia ===29=== *Hema Bharali, 101, Indian independence activist and social worker. *Vincent van der Burg, 75, Dutch politician, MP (1982–1998).Oud-CDA-Tweede Kamerlid Vincent van der Burg overleden *Germano Celant, 80, Italian art historian, curator (Solomon R. Guggenheim Museum) and critic, COVID-19.Morto a 80 anni il critico d’arte Germano Celant, “creatore” del movimento Arte povera *Trevor Cherry, 72, English footballer (Leeds United, Huddersfield Town, national team), suspected heart attack.Trevor Cherry: England & Leeds defender dies, aged 72 *Al Edwards, 83, American politician and businessman, member of the Texas House of Representatives (1978–2007, 2009–2011).Al Edwards, former state rep whose bill created Juneteenth holiday, dies at 83 *Alexander Fernando, 79, Sri Lankan actor (Ahas Gauwa, Christhu Charithaya, Supiri Balawatha) and stuntman.Veteran actor, Alexander Fernando passed away *Denis Goldberg, 87, South African lawyer and political activist (Rivonia Trial), lung cancer.ANC Stalwart Denis Goldberg Passes Away at 87 *Gale Halderman, 87, American automotive designer, co-creator of the Ford Mustang, liver cancer.Legendary Tipp City designer of iconic Ford Mustang dies *Yahya Hassan, 24, Danish poet and political activist.Yahya Hassan er død *Ji Chaozhu, 90, Chinese politician, Ambassador to Fiji (1985–1987) and United Kingdom (1987–1991).著名外交家、联合国原副秘书长冀朝铸逝世 享年91岁 *Irrfan Khan, 53, Indian actor (Slumdog Millionaire, Life of Pi, The Lunchbox), colitis caused by neuroendocrine tumor.Irrfan Khan passes away *Jānis Lūsis, 80, Latvian Hall of Fame javelin thrower, Olympic champion (1968), silver (1972 and bronze (1964) medalist, cancer.Miris leģendārais Latvijas šķēpmetējs Jānis Lūsis *Giacomo dalla Torre del Tempio di Sanguinetto, 75, Italian nobility, Prince and Grand Master of the Sovereign Military Order of Malta (2008, since 2017), throat cancer. *Maj Sjöwall, 84, Swedish author (Martin Beck), COPD.Författaren Maj Sjöwall död *Paul J. Smith, 88, American artist and curator, Director of the Museum of Arts and Design (1963–1979).Paul J. Smith, Renowned Curator and Director Who Championed American Craft, Has Died at 88 (death announced on this date) ===30=== *Tony Allen, 79, Nigerian drummer (Fela Kuti, The Good, the Bad & the Queen, Rocket Juice & the Moon), aortic aneurysm.BREAKING: Fela's Ex-drummer, Tony Allen, Dies In France *John Bryant, 76, British journalist and newspaper editor (The Daily Telegraph, The European, The Sunday Correspondent). *Óscar Chávez, 85, Mexican folk singer-songwriter (\"Por Ti\", \"Macondo\"), COVID-19.Muere Óscar Chávez tras ser hospitalizado con síntomas de coronavirus *Jordan Cox, 27, English rugby league player (Hull Kingston Rovers, Warrington Wolves, Doncaster).Jordan Cox: Ex-Hull KR & Warrington player dies, aged 27 *Chuni Goswami, 82, Indian footballer (Mohun Bagan, national team) and cricketer (Bengal), cardiac arrest.Chuni Goswami, Indian football legend, passes away at 82 years *Kundanika Kapadia, 93, Indian feminist novelist and essayist, colorectal cancer.Gujarati author Kundanika Kapadia dies at 93 *Rishi Kapoor, 67, Indian actor (Bobby, Do Dooni Chaar, Kapoor & Sons), respiratory failure caused by bone marrow cancer.Rishi Kapoor dies at 67, brother Randhir Kapoor confirms *Frederick Kroesen, 97, American Army general, Commander of NATO Central Army Group (1979–1983).Former Vice Chief Gen. Frederick Kroesen Dies *Sam Lloyd, 56, American actor (Scrubs, Desperate Housewives) and capella singer (The Blanks), brain cancer. ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths from the 2019–20 coronavirus pandemic ==Related pages== * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *04 Deaths",
 "title": "Deaths in April 2020"
}