{
 "id": "74265",
 "text": "Synapsids are one of the two major groups of vertebrates which evolved from basal amniotes. 'Synapsids' means 'fused arch', and refers to their skulls. The group includes mammals and earlier groups related to mammals. They were originally called \"mammal-like reptiles\", which is a bit confusing. Synapsids are one of the two major groups of amniotes. Both groups evolved from early amniotes about 345 million years ago during the early or mid Carboniferous period. The other is the sauropsids, the group which includes reptiles and birds. Synapsids include the Pelycosauria (Pennsylvanian to Permian), and the Therapsida (Lower Permian to present). The pelycosaurs were dominant on land in the Permian, and many species became extinct at the Permian–Triassic extinction event.A few relics survived into the Lower Triassic. The therapsids were still dominant on land in the Lower Triassic, but by the Upper Triassic the dinosaurs had taken over. == Primitive and advanced synapsids == Synapsids have a primitive group and an advanced group. These are known, respectively, as pelycosaurs and therapsids. Pelycosaurs are a paraphyletic group of six primitive families of synapsids.Benton, Michael J. 2005. Vertebrate paleontology. 3rd ed, Oxford: Blackwell. 120 They were all rather lizard-like with sprawling gait and possibly horny scutes. The therapsids are the more advanced synapsids. They have a more erect posture (way of standing) and maybe hair, at least in some forms.McLaughlin J.C. 1980. Synapsida: a new look into the origin of mammals. Viking, New York. ISBN 0-670-68922-X. They are the ancestors of mammals. So each of the two synapsid groups represent evolutionary grades: the pelycosaurs have given rise to the therapsids, who in their turn have given rise to the mammals. == Mammals and reptiles == The therapsids ('beast face') used to be called mammal-like reptiles. This was a mistake, because they were never reptiles. The split between Synapsids and Sauropsids (the group which gave rise to reptiles) took place long before therapsids evolved.Kemp T.S. 1995. The origin and evolution of mammals. Oxford University Press, p18 et seq. ISBN 0-19-850761-5 There are a number of characteristics which cannot be seen on fossils, but which are of great importance. Mammals are distinguished from reptiles by fundamental differences in the development of the blood system.Goodrich E.S. 1930. Studies on the structure and development of vertebrates. Macmillan, London.Kermack D.M. & K.A. 1984. The evolution of mammalian characters. Croom Helm, London. p6/7 These differences are such that it would be almost impossible for mammals to be derived from reptiles. :\"It is clearly quite impossible for the condition found in birds and modern reptiles to have arisen from that found in mammals or vice versa\". Kermack.6 This supports the division of amniotes into the Sauropsida and the Synapsida. == Synapsid skull == === Temporal openings === Synapsids evolved a fenestra (hole) behind each eye orbit. It allows better attachment sites for jaw muscles than the original anapsid condition. A parallel development took place in the diapsida, who evolved two rather than one opening behind each eye. Originally, the opening in the skull left the inner cranium only covered by the jaw muscles, but in higher therapsids and mammals the sphenoid bone has expanded to close the opening. === Teeth === Synapsids had differentiated teeth. These include the canines, molars, and incisors. The trend towards differentiation is found in some labyrinthodonts and early anapsid reptilians. They have enlarged first teeth on the maxilla, forming a form of proto-canines. This trait was subsequently lost in the sauropsid line, but developed further in the synapsids. Early synapsids could have 2 or even 3 enlarged 'canines', but in the therapsids, the pattern had settled to one canine in each upper jaw half. The lower canines developed later. ==Taxonomy== Note: in evolutionary terms, the mammals are entirely within the Synapsida. Their status as a separate class is traditional Linnaean taxonomy: as a clade they are a sub-group of the Therapsida. * Series Amniota ** Class †SYNAPSIDA * *** Order †Pelycosauria * **** Suborder †Caseasauria **** Suborder †Eupelycosauria * *** Order †Therapsida * **** Suborder †Biarmosuchia * **** Suborder †Dinocephalia **** Suborder †Anomodontia **** Suborder †Gorgonopsia **** Suborder †Therocephalia **** Suborder †Cynodontia * ** Class MAMMALIA == References ==",
 "title": "Synapsid"
}