{
 "id": "74366",
 "text": "Swordfish (Xiphias gladius), also known as broadbills in some countries, are large predatory fish with a long, flat bill. They are a popular sport fish. Swordfish are elongated, round-bodied, and lose all teeth and scales by adulthood. The International Game Fish Association's all-tackle angling record for a swordfish was a 1,182 lb (535.15 kg) specimen taken off Chile in 1953. They are the only member of their family, Xiphiidae. == Features == The swordfish is named after its sharp bill, resembling a sword (Latin gladius), which together with its streamlined physique (smooth body) allows it to cut through the water with great ease and agility. Swordfish are fast predators of other fish. The \"sword\" is not used to spear, but may be used to slash at its prey to injure the prey animal, to make for an easier catch.Gardieff S. Swordfish. Florida Museum of Natural History. Mainly, the swordfish relies on its great speed and agility in the water to catch its enemy. It is among the fastest fish.ReefQuest Centre for Shark Research. Haulin' Bass. Quote: \"The 60 mph figure listed for the swordfish is based on a corrupted version of calculations made by Sir James Gray to estimate the impact speed necessary for a hypothetical 600-lb swordfish to embed its sword 3 feet in the timbers of ships, as has been known to occur. The figure seems to have entered the literature without question.\" Accessed 26 December 2011. == As food == Swordfish is a particularly popular fish for cooking. Since swordfish are large animals, meat is usually sold as steaks, which are often grilled. The color of the flesh varies by diet, with fish caught on the east coast of North America often being rosier. However, many sources including the United States Food and Drug Administration warn about potential toxicity (how poisonous it is) from high levels of methylmercury in swordfish. \"What you need to know about mercury in fish and shellfish.\" == References == * Michael Hopkin (2005): Swordfish heat their eyes for better vision. Nature, 10 January 2005 * Fritsches, Kerstin A., Brill, Richard W., and Warrant, Eric J. (2005): Warm Eyes Provide Superior Vision in Swordfishes . Current Biology 15, 55−58 * FDA Consumer:Mercury In Fish:Cause For Concern? == Other websites == * http://www.flmnh.ufl.edu/fish/Gallery/Descript/Swordfish/Swordfish.html * More info on FDA Mercury Advice from Oceana * http://www.fenton.com/pages/3_ourwork/4_casestudies/environment/swordfish.htm * http://www.mbayaq.org/cr/cr_seafoodwatch/content/media/MBA_SeafoodWatch_SwordfishReport.pdf Category:Edible fish Category:Istiophoriformes",
 "title": "Swordfish"
}