{
 "id": "743788",
 "text": "The Deputy Prime Minister of New Zealand () is the second-most senior minister in the Government of New Zealand, although this seniority does not necessarily translate into power. The office was created as a ministerial portfolio in 1954. The officeholder usually deputises for the prime minister at official functions. The current Deputy Prime Minister is Winston Peters since 2023. ==List of deputy prime ministers of New Zealand== ;Key No. No. Name Portrait Concurrent portfolio(s) Term of office Term of office Prime Minister Prime Minister 1 Keith Holyoake Minister of Agriculture 13 November 1954 20 September 1957 Holland 2 Jack Marshall Attorney-General Minister of Justice 20 September 1957 12 December 1957 Holyoake 3 Jerry Skinner Minister of Agriculture Minister of Lands 12 December 1957 12 December 1960 Nash (2) Jack Marshall Minister of Overseas Trade Minister of Industries and Commerce Minister of Labour Minister of Immigration 12 December 1960 9 February 1972 Holyoake 4 Robert Muldoon Minister of Finance Minister of Statistics 9 February 1972 8 December 1972 Marshall 5 Hugh Watt Minister of Labour Minister of Works 8 December 1972 1 September 1974 Kirk 6 Bob Tizard Minister of Finance 10 September 1974 12 December 1975 Rowling 7 Brian Talboys Minister of Foreign Affairs Minister of Overseas Trade 12 December 1975 4 March 1981 Muldoon 8 Duncan MacIntyre Minister of Agriculture 4 March 1981 15 March 1984 Muldoon 9 Jim McLay Attorney-General Minister of Justice 15 March 1984 26 July 1984 Muldoon 10 Geoffrey Palmer Attorney-General Minister of Justice 26 July 1984 8 August 1989 Lange 11 Helen Clark Minister of Labour Minister of Health 8 August 1989 2 November 1990 Palmer 11 Helen Clark Minister of Labour Minister of Health 8 August 1989 2 November 1990 Moore 12 Don McKinnon Minister of Foreign Affairs Minister of Overseas Trade 2 November 1990 16 December 1996 Bolger 13 Winston Peters Treasurer 16 December 1996 14 August 1998 Bolger 13 Winston Peters Treasurer 16 December 1996 14 August 1998 Shipley 14 Wyatt Creech Minister of Education Minister of Health 14 August 1998 10 December 1999 Shipley 15 Jim Anderton Minister of Economic Development Minister of Customs 10 December 1999 15 August 2002 Clark 16 Michael Cullen Minister of Finance Treasurer Leader of the House 15 August 2002 19 November 2008 Clark 17 Bill English Minister of Finance Minister for Infrastructure 19 November 2008 12 December 2016 Key 18 Paula Bennett Minister of State Services Minister of Police Minister of Tourism 12 December 2016 26 October 2017 English (13) Winston Peters Minister of Foreign Affairs Minister for State Owned Enterprises Minister of Racing 26 October 2017 6 November 2020 Ardern 19 Grant Robertson Minister of Finance Minister for Infrastructure Minister of Racing Minister for Sport and Recreation 6 November 2020 25 January 2023 Ardern 20 Carmel Sepuloni Minister for Social Development Minister for ACC Minister for Arts, Culture and Heritage 25 January 2023 27 November 2023 Hipkins (13) Winston Peters Minister of Foreign Affairs Minister for State Owned Enterprises Minister of Racing 27 November 2023 Incumbent Luxon Luxon ==Living former deputy prime ministers== As of , there are nine living former New Zealand deputy prime ministers, as seen below. The most recent Deputy Prime Minister to die was Michael Cullen (served 2002–2008), on 19 August 2021, aged 76. File:Jim McLay (cropped).jpg|Sir Jim McLay served 1984 born 1945 (age ) File:SirGeoffreyPalmer.jpg|Sir Geoffrey Palmer served 1984–1989 born 1942 (age ) File:Helen Clark UNDP 2010.jpg|Helen Clark served 1989–1990 born 1950 (age ) File:Don McKinnon (cropped).jpg|Sir Don McKinnon served 1990–1996 born 1939 (age ) File:Wyatt Creech.jpg|Wyatt Creech served 1998–1999 born 1946 (age ) File:Bill English July 2017.jpg|Sir Bill English served 2008–2016 born 1961 (age ) File:Paula Bennett in 2018.png|Paula Bennett served 2016–2017 born 1969 (age ) File:Hon Grant Robertson.jpg|Grant Robertson served 2020–2023 born 1971 (age ) File:Carmel Sepuloni.jpg|Carmel Sepuloni served 2023 born 1977 (age ) ==References== *",
 "title": "Deputy Prime Minister of New Zealand"
}