{
 "id": "743923",
 "text": "Syed Abdullah Shah QadriThe Life of Bulleh Shah (Punjabi/) (Shahmukhi); 1680–1757) famously known as Bulleh Shah (), was a Mughal-era Punjabi Islamic philosopher and Sufi poet. His first spiritual teacher was Shah Inayat Qadiri, a Sufi mentor of Lahore == Life == === Early life === He was born in 1680 in the city of Uch, during the Mughal Empire (present day Pakistan). After his early education, he went to Lahore where he met Inayat Arian, and became his student. === Later years and death === He died in 1757, at the age of 77. He was buried in Kasur, and a shrine was built over his grave. His funeral prayer was led by Qazi Hafiz Syed Zahid Hamdani a great religious personality of Kasur. === Shrine === He was buried in Kasur when he died in 1757. There is a clean and very huge veranda which leads to the Tomb of Baba Bulleh Shah as you enter the shrine. The ceiling of shrine is decorated with the verses of Bulleh Shah in elegant calligraphy. == Poetry == Amongst Urdu poets, Bulleh Shah lived 400 miles away from Mir Taqi Mir (1723–1810) of Agra. Bulleh Shah practised the Sufi tradition of Punjabi poetry . The verse form Bulleh Shah which is mainly involved is the Kafi, popular in Western Punjabi and Sindhi poetry. Many people have put his Kafis to music, from humble street-singers to renowned Sufi singers like Nusrat Fateh Ali Khan, Pathanay Khan, Abida Parveen, the Waddali Brothers and Sain Zahoor, from the synthesised techno qawwali remixes of UK-based Asian artists to the Pakistani rock band Junoon. == Modern renderings == === Bands and albums === In the 1990s, Junoon, a rock band from Pakistan, furnished his poems \"Bullah Ki Jaana\" and \"Aleph\" (\"Ilmon Bas Kareen O Yaar\"). In 2004, Indian musician Rabbi Shergill turned the abstruse metaphysical poem \"Bullah Ki Jaana\" into a rock/fusion song in his debut album Rabbi; the song was a chart-topper in 2005, helping the album to eventually sell over 10,000 copies and became immensely popular in India and Pakistan. The Wadali Bandhu, a Punjabi Sufi group from India, have also released a version of \"Bullah Ki Jaana\" in their album Aa Mil Yaar... Call of the Beloved. Also in 2016, a collaboration between two EDM artists (Headhunterz and Skytech) named \"Kundalini\" used words created by Bulleh Shah, as well as having the words Bulleh Shah in the lyrics. Bulleh Shah's verses have been an inspiration to painters as well, as in the two series of paintings (Jogia Dhoop and Shah Shabad) by an Indian painter Geeta Vadhera inspired by the poetry of Bulleh Shah and other Sufi poets and saints. In 2017, British Pakistani singer Yasir Akhtar used Bulleh Shah's poetry in his song \"Araam Naal Kar – Take it Easy\". In 2019, Sona Mohapatra used a Kalam of Bulleh Shah in her song \"R.A.T Mashup\". === Coke Studio === In 2009, the season 2 of Coke Studio featured \"Aik Alif\" performed by Sain Zahoor and Noori. Ali Zafar also used some of Bulleh Shah and Shah Hussain's verses in his \"Dastan-e-Ishq\". In 2010, the season 3 featured \"Na Raindee Hai\" and \"Makke Gayaan Gal Mukdi Nahi\" performed by Arieb Azhar. In 2012, Shah's poetry was featured with Hadiqa Kiani performing \"Kamlee\". In 2016, Ahmed Jahanzeb and Umair Jaswal performed \"Khaki Banda\"; and Rizwan Butt and Sara Haider performed \"Meri Meri\", In third episode of season 11 Fareed Ayaz, Abu Muhammad Qawal & Brothers performed a Qawwali based on Kalam by Bulleh Shah. In season 12 Hadiqa Kiani used verses of Shah in song \"Daachi Waaleya\". ==Related pages== * Sufism == References == == Further reading == * * Great Sufi Poets of the Punjab, by R. M. Chopra, Iran Society, Kolkata, 1999. ==Other websites== * * English Writing} * * Complete poetry of Bulleh Shah in Shahmukhi * Punjabi Poetry of Bulleh Shah * Kulliyat e Bulleh Shah === Works online === * Bulleh Shah Ki shairi * Articles on Bulleh Shah's life and poetry (apna.org) * Bulleh Shah: Poems (English translations) and Biography (poetry- chaikhana.com) Category:1680 births Category:1757 deaths Category:Pakistani Muslims Category:Pakistani literature Category:Pakistani poets Category:Pakistani Sufi saints Category:Punjabi people Category:Sufis",
 "title": "Bulleh Shah"
}