{
 "id": "744367",
 "text": "The Best European Goalkeeper award (also known as UEFA Goalkeeper of the Season award) is a football award given to the best goalkeeper in Europe as voted by the UEFA's panel of judges. It has been awarded every year since 1990. From 1998 to 2009, the winners of this award were the same as those of UEFA goalkeeper of the season award but in 2009, ESM became the giver of the award and the two awards were given separately until 2016. Since 2016, both the awards have been re-merged into one. == Procedure of selecting the winner == The award is given to the best goalkeeper in Europe based on the votes by the UEFA's group of judges. The group is made up of the coaches of all of the 32 teams which played in the group stages of the same UEFA Champions League season and 55 journalists selected by the European Sports Media (ESM) group, standing for each of UEFA's member associations. Coaches are not allowed to vote for the players of their own teams. The judges choose their top three goalkeepers of the season. The first ranked goalkeeper in a judge's list receives 5 points, the second ranked gets 3 points and the third ranked gets 1 point. The goalkeeper who receives the combined highest points is named the winner. ==List of winners== Source: * 1990 – Walter Zenga * 1991 – Bodo Illgner * 1992 – Peter Schmeichel * 1993 – Peter Schmeichel * 1994 – Michel Preud'homme * 1995 – Edwin van der Sar * 1996 – Andreas Köpke * 1997 – Jens Lehmann * 1998 – Peter Schmeichel * 1999 – Oliver Kahn * 2000 – Oliver Kahn * 2001 – Oliver Kahn * 2002 – Oliver Kahn * 2003 – Gianluigi Buffon * 2004 – Vítor Baía * 2005 – Petr Čech * 2006 – Jens Lehmann * 2007 – Petr Čech * 2008 – Petr Čech * 2009 – Edwin van der Sar * 2010 – Iker Casillas * 2011 – Manuel Neuer * 2012 – Petr Čech * 2013 – Manuel Neuer * 2014 – Manuel Neuer * 2015 – Manuel Neuer * 2016 – Gianluigi Buffon * 2017 – Gianluigi Buffon * 2018 – Keylor Navas * 2019 – Alisson * 2020 - Manuel Neuer == Awards by country == *Germany - 13 *Italy - 4 *Czech Republic - 4 *Denmark - 3 *Netherlands - 2 *Spain - 1 *Portugal - 1 *Belgium - 1 *Brazil - 1 *Costa Rica - 1 == References == Category:European footballers Category:UEFA",
 "title": "Best European Goalkeeper"
}