{
 "id": "744430",
 "text": "Paw Patrol is a children's TV show created by Keith Chapman. It's produced by Spin Master Entertainment. The show aired on Nickelodeon and Nick Jr. Channel. ==Story== In a town called Adventure Bay, a 10-year-old boy named Ryder leads a team of 6 dogs who call themselves the Paw Patrol. Their names are \"Chase\", \"Marshall\", \"Rocky\", \"Skye\", \"Rubble\", and \"Zuma\". They work together to protect their town. Each dog has a set of skills based on emergency service jobs, such as a firefighter, a police officer, and an aviation pilot. They all reside in doghouses that transform into customized vehicles for their missions. They are also equipped with backpacks called \"pup packs\" that contain tools that relate to the pups' jobs. Spin Master has developed the show into a media franchise and released an ongoing line of toys based on it. Paw Patrol toy sales have generated millions of dollars in revenue for the corporation and increased Spin Master's presence in the preschool toy market. The show, and its associated products, have received a variety of awards and nominations from associations such as the Academy of Canadian Cinema & Television and the Academy of Television Arts & Sciences. ==Renewal== On February 19, 2020, the series was renewed for an eighth season of 26 half-hour episodes. On February 18, 2021, the series was renewed for a ninth season. A theatrical feature film, titled Paw Patrol: The Movie, was released on August 20, 2021. ==Characters== === Original members === * is leader of the Paw Patrol. His vehicle is the red ATV that is able to convert into a PWC and snowmobile. He was voiced by Owen Mason from Season 1 to Season 2, by Elijha Hammill from Season 3, Jaxon Mercey from Season 4 to Mid-Season 6, Joey Nijem from Late-Season 6 to Mid-season 7, Beckett Hipkiss from Late-season 7 onwards - Collin Dean in Paw Patrol: The Movie. * is a 7-year-old German Shepherd who serves as a police and spy dog. He has a good sense of smell and sight. He also has a cat and feather allergy. His vehicle is the royal blue police cruiser. He was voiced by Tristan Samuel from Season 1 to Season 2, by Max Calinescu from Season 3 to Season 4 and by Justin Paul Kelly in Season 5 onwards. Chase is also voiced by Iain Armitage in Paw Patrol: The Movie. As of Paw Patrol: The Movie, Chase has gone on to become one of the two mascots (alongside Marshall) of Spin Master Entertainment and is featured in their production logo. * is a clumsy but competent 6-year-old Dalmatian who serves as a firefighter and paramedic dog. He is also featured in most episodes and is the most used pup. His vehicle is the red fire truck. He was voiced by Gage Munroe from Season 1, by Drew Davis from Season 2 to Season 5, by Lukas Engel from Season 6 and by Jeremy Maguire from Season 7 onwards. As of Paw Patrol: The Movie, Marshall has gone on to become the other mascot of Spin Master Entertainment and is featured in their production logo. * is a 7-year-old cockapoo who serves as the air pup. She pilots a grey helicopter with pink highlights. She was voiced by Kallan Holley from Season 1 to Season 5 and by Mckenna Grace from Season 6 onwards. * is a 6-year-old grey and white Schnauzer/Scottish Terrier/mixed-breed pup who serves as a recycling and handyman pup. He drives the lime green recyling truck. He was voiced by Stuart Ralston from Season 1 to Season 2, by Samuel Faraci from Season 3 to Mid- Season 7 and by Jackson Reid from Late-Season 7 onwards, as well as Ethan William Childress in Paw Patrol: The Movie. * is a 5-year-old Labrador retriever who serves as an aquatic rescue pup. His vehicle is the orange hovercraft which can run quite well on land as well as water. He was voiced by Alex Thorne from Season 1 to Mid-Season 4, Carter Thorne from Mid-Season 4 to Season 5 and by Sunny Suljic from Season 6 onwards. * is a 5-year-old bulldog who serves as a construction pup. His vehicle is the yellow bulldozer. He was voiced by Devan Cohen from Season 1 to Season 5 and by Izaac Wang from Season 6 onwards. ===Later members=== *Everest is an 8-year-old Siberian Husky who serves as a snowy mountain pup. She's Marshall's girlfriend. Her vehicle is a metal snowcat with the orange and teal color. She's very cool. She's best friends with Skye. She was voiced by Berkeley Silverman. She's very ready for ice and snow. Bayberry the skunk sprays Everest in the episode. *Tracker is a 6-year-old Chihuahua. He is a jungle pup. His vehicle is a silver jeep with the olive green color. He speaks Spanish. *Tuck is a Golden Retriever who serves as a Mighty Pup along with his twin sister, Ella. His superpower, which is opposite of Ella's, is shrinking to a very small size. He was introduced in Season 6 in a Mighty Pups: Super Paws special episode. His vehicle is a motorcycle which combined with the other half (used by Ella) can become a car. *Ella is a Golden Retriever who serves as a Mighty Pup along with her twin brother, Tuck. Her superpower, which is opposite of Tuck's, is growing very tall. She was introduced in Season 6 in a Mighty Pups: Super Paws special episode. Her vehicle is a motorcycle which combined with the other half (used by Tuck) can become a car. *Rex is a Bernese mountain dog who serves as a dinosaur helper in the dino wilds. He was introduced in Season 7 in a Dino Rescue special episode. His vehicle is also an azure jeep. *Wild (formerly Wildcat) is a Ginger Tabby Cat and is the very first cat member of the Paw Patrol and the leader of the Cat Pack. He was introduced in Season 7 in a Moto Pups special episode. His vehicle in Season 7 is a gray and red motorcycle. His vehicle in season 8 is a cheetah-themed motorcycle. *Liberty is a dachshund who serves as a guide throughout Adventure City. She was introduced in Paw Patrol: The Movie. Liberty first appeared in the series in the first episode of Season 9. Her vehicle is an extendable pink and light blue motorcycle. *Al is a basset hound who serves as a trucker. He loves driving his big truck. He is the only Paw Patrol pup whose name doesn't relate to his job. He was introduced in Season 9 in a Big Truck Pups special episode. His vehicle is a white and red big truck with a long arm. *Coral is a cockapoo mer-pup who serves as a helper around Puplantis and Skye's cousin. She was introduced in Season 9 in a Aqua Pups special episode, which was the special episode series to celebrate the series' 10th anniversary. Her vehicle is seahorse-shaped. ==Broadcast == TVO (Ontario) CBC Television Treehouse (Canada) Télé-Québec (Quebec) and Knowledge Kids (British Columbia) Nickelodeon Nick Jr. and Nicktoons (United States) CCTV-4 and CCTV-14 (China) DD India (India) Canal 5 and Canal Once (Mexico) Senal Colombia (Colombia) SBS and ABC (Sydney) TVNZ (Auckland) Cartoon Network (Turkey) Nick Jr Channel 4 BBC One and CBeebies (United Kingdom and Ireland) ARD and DW-TV (Germany) KBS1 KBS World and EBS (South Korea) La 1 and TVE Internacional (Spain) TVP1 and TVP Polonia (Poland) Russia-1 and RTR-Planeta (Russia) Rai Yoyo Rai 1 and Rai Italia (Italy) RTP1 and RTP Internacional (Portugal) SBT TV Brasil TV Cultura and TV Brasil Internacional (Brazil) TF1 and TV5Monde (France) and NHK General TV and NHK World-Japan (Japan). ==References== Category:2013 Canadian television series debuts Category:2013 anime television series Category:Action television series Category:2010s animated television series Category:Canadian animated television series Category:Canadian children's television series Category:2010s comedy television series Category:Nick Jr. Category:English- language television programs",
 "title": "Paw Patrol"
}