{
 "id": "74452",
 "text": "Gotha is a town in Thuringia, in Germany. It is the capital of the District of Gotha. The population was 46,205 in 2004. == History == The town has existed at least since the 8th century, when its name was mentioned in a document signed by Charlemagne, in which it appears as Villa Gotaha (\"Good Waters\"). In 1640 Gotha became the capital city of Saxe-Gotha. In the 18th century the French philosopher Voltaire stayed for a long time, and the Royal court became one of the centres of the Enlightenment in Germany. From 1826 to 1918, Gotha was one of the two capitals of the Duchy of Saxe-Coburg and Gotha. Gotha has played an important role in the Germany's workers' movement: the German socialist party (SPD) was founded in Gotha in 1875, when the Social Democratic Workers' Party, led by August Bebel and Wilhelm Liebknecht, and the General German Workers' Association, founded by Ferdinand Lassalle joined together. The compromise was known the Gotha Program and was opposed by Karl Marx. Gotha has also been traditionally a centre of publishing. The firm of Justus Perthes (now called Hermann Haack) began publishing the Almanach de Gotha in 1763. The almanach was a very important directory of the world's major ruling dynasties and Europe's high nobility. From 1949 to 1990 the city of Gotha was in the German Democratic Republic. == Sights == * The main attraction in the town is the Schloß Friedenstein, the former ducal palace, built in 1643-1655. It is Germany’s oldest early Baroque palace. The palace also houses the Museum of Regional History including the historic Ekhof Theatre, the oldest preserved baroque theatre in the world. * Town Hall, built between 1567 and 1577 in Renaissance style, noteworthy for a richly decorated façade in its north side. * A Market place (Hauptmarkt) surrounded by restored patrician houses with Baroque doorways. * Augustinian Church (Gothic, 13th century), with former abbey. * St Margaret’s Church (Margarethenkirche), from the end of the 15th century. * Gotha is host to the annual Freakstock Christian music festival. == Sister cities == * Martin * Gastonia, North Carolina * Kielce Poland * Martin * Romilly-sur-Seine * Salzgitter == References == == Other websites == * Official website * Official website * Tram in Gotha Category:Verwaltungsgemeinschaftfrei towns in Thuringia Category:Gotha Rural District",
 "title": "Gotha"
}