{
 "id": "74477",
 "text": "Palm Island, also known as Great Palm Island, or by the Aboriginal name Bukaman,Bindloss, Joseph (2002) page 330 is an island with about 2,000 people living on it. == Names == The small town on the island has many names such as Palm Island, the Mission, Palm Island Settlement or Palm Community. == Location == The island is north-west of Townsville, on the east coast of Queensland, Australia. It is the biggest of the Greater Palm group of islands. It has small bays, sandy beaches and steep forested mountains rising to high.Palm Island - The Place, Reconciliation and Social Justice Library (1996) Auslii website. accessed 23 January 2007. Other close by islands outside the Palm group include Rattlesnake Island and Magnetic Island. == History == Palm Island is often called a \"tropical paradise\" because of its natural beauty, but it has had a sad past since Europeans arrived in Australia. For much of the 20th Century it was used by the Queensland Government as a town for Aboriginals thought to be guilty of such crimes as being \"disruptive\", being pregnant to a white man or being born with \"mixed blood\". The community created by this history has had many problems and has often been debated about by political and social writers. Of major concern is a lack of jobs and housing. Since it became a Aboriginal reserve, Palm Island has been a symbol of aboriginal hardship and violence. At the same time it has been at the centre of political campaigning to improve the lives and treatment of Australia's Indigenous peoples as well as seeking people to recognise the bad history which lead to the Palm Island of today. ==References== * * * * * * ==Footnotes== ==Other websites== *Bwgcolmacom Community School website *Local Council information *Palm Island PCYC webpage *Database of Agreements to which the Palm Island Aboriginal Shire Council are parties *Joyce Palmer Health Service webpage *Dunn, Peter \"WW2 Palm Island naval base\" Australia @ War, 22 May 2004 (and updated since) *Queensland Government information webpage on Palm Island and alcohol management *Queensland Government information webpage on Community Renewal on Palm Island *Queensland Government map of alcohol restriction zone *Australian Government Shared Responsibility Agreement - Palm Island our horses, our responsibility ===Articles produced by The Brisbane Institute think tank=== *Professor Steffen Lehmann Lessons from Palm Island The Brisbane Institute, 17 November 2005 *Boe, Andrew Palm Island: something is very wrong The Brisbane Institute, 21 April 2005 *Boe, Andrew Palm Island Inquest findings – the unacceptable political inertia The Brisbane Institute, 06 October 2006 Category:Islands of Australia Category:Indigenous Australian communities Category:Geography of Queensland",
 "title": "Great Palm Island"
}