{
 "id": "745141",
 "text": "Ahmad Reza Abedzadeh (, born 25 May 1966) is an Iranian former footballer who played as a goalkeeper. He played for Esteghlal, Sepahan, Persepolis and the Iranian national team. He made 79 appearances for Iran, and played for his country at the 1998 FIFA World Cup. ==Club career== Abedzadeh had an unbeaten record in the Tehran derby with 13 matches, 7 wins and 6 draws. While playing for Persepolis, he went 802 consecutive minutes without conceding a goal. ==International career== Abedzadeh was called up at the age of 18 for the Iran national under-20 football team in 1984. After his good shows, he was invited to the senior team in 1987 by then-manager Parviz Dehdari. Abedzadeh made his debut in the match against Kuwait on 27 February 1987, in which he conceded a goal in a 2–1 victory. He started in the 1990 Asian Games, where they won the gold medal after defeating North Korea in the final and Abedzadeh saved two penalties. At the tournament, he conceded only two goals which were both scored from penalty kicks. Iran defeated Australia in the FIFA World Cup qualification play-offs to reach 1998 FIFA World Cup, their second participation in the World Cup and first since 1978. He missed the first match at the World Cup against Yugoslavia due to injury, then captained Iran at the next two matches against United States and Germany. Iran finished third at their group and Abedzadeh announced his retirement from international football after the final match. ==Post-playing career== Abedzadeh suffered a stroke in 2001 and that was the point in which he let go of professional football. He was released some weeks later, but required a number of surgeries after, and even to this day, has side effects from his stroke. Abedzadeh suffered again on 11 March 2007 when his mother died. He has also been the goalkeeping coach for many clubs after retiring from playing football. He coached Saipa in 2001, Esteghlal Ahvaz in 2005, Persepolis from 2008 to 2009, Steel Azin in 2010 and Los Angeles Blues from 2011 to 2012. ==Legacy== Dubbed the Eagle of Asia for his ability to protect the net, his international career stretched for an illustrious 11 years, a tenure that provided stability and uncanny leadership. In 2009, he was named in a poll as Iran's favorite player of last 30 years. His goalkeeping legacy in Iran is rivaled only by Nasser Hejazi. ==Personal life== He married in 1988 at the age of 23 and has one daughter, Negar and one son, Amir, also a goalkeeper, who plays for C.S. Marítimo and the Iran national team. Abedzadeh also runs a restaurant in Motelghoo, one of the cities of Northern Iran ==Honours== ===Club=== ;Esteghlal * Iranian Football League (1): 1989–90 * Asian Club Championship (1): 1990–91, 1991 (Runner-up) ;Persepolis * Iranian Football League (4): 1995–96, 1996–97, 1998–99, 1999–2000 * Hazfi Cup (1): 1998–99 ===National=== ;Iran * Asian Games Gold Medal (1): 1990 ==References== == Other websites == * RSSSF archive of Ahmad Reza Abedzadeh's international appearances Category:1966 births Category:Iranian association football goalkeepers Category:Iran international footballers Category:1992 AFC Asian Cup players Category:1998 FIFA World Cup players Category:Esteghlal F.C. players Category:Persepolis F.C. players Category:Living people Category:Asian Games gold medalists for Iran Category:Asian Games medalists in football Category:Footballers at the 1990 Asian Games Category:1988 AFC Asian Cup players Category:1996 AFC Asian Cup players Category:Iranian football managers Category:Medalists at the 1990 Asian Games",
 "title": "Ahmad Reza Abedzadeh"
}