{
 "id": "745286",
 "text": "Almuth Schult (; born 9 February 1991) is a German footballer. She currently plays for VfL Wolfsburg and the German national team as a goalkeeper. ==Career== ===Club=== At the age of five, Schult began her career at her local football club FC SG Gartow, before moving to Hamburger SV in 2007. She joined Magdeburger FFC in 2008, where she played in the third-tier Regionalliga. At Magdeburg Schult became a regular starter and achieved promotion with her team to the second Bundesliga, where she played two full seasons. In 2011, Schult signed a three-year contract with Bundesliga side SC 07 Bad Neuenahr. In 2013, she signed a two years contract with Bundesliga and UEFA Champions League champions VfL Wolfsburg. ===International=== Schult reached third-place with Germany at the 2008 FIFA U-17 Women's World Cup, appearing in two matches. Two years later, she was Germany's first choice goalkeeper at the 2010 U-20 Women's World Cup, which the team won. The tournament was played on home soil in Germany. Schult was called up as third goalkeeper for Germany's 2011 Women's World Cup squad.Bundestrainerin benennt 21-köpfigen WM-Kader. Kicker.de. 27 May 2011. Accessed 7 June 2011. Her first team debut was on 15 February 2012 against Turkey.DFB-Frauen glanzlos an die Spitze. Kicker.de. 15 February 2012. 15 February 2012. After the retirement of Nadine Angerer, Schult's first major tournament as the starting goalkeeper for Germany came at the 2016 Summer Olympics, where she played every minute and earned Germany their first ever gold medal in women's Olympic football. ==Honours== ===Domestic=== *Bundesliga: Winner 2013–14, 2016–17, 2017–18, 2018–19 *DFB- Pokal: Winner 2014–15, 2015–16, 2016–17, 2017–18, 2018–19 ===International=== *UEFA Women's Champions League: Winner 2014 *UEFA Women's Championship: Winner 2013 *FIFA U-20 Women's World Cup: Winner 2010 *FIFA U-17 Women's World Cup: Third-place 2008 *Summer Olympic Games: Gold medal, 2016 *Algarve Cup: Winner 2012, 2014 ===Individual=== *IFFHS World's Best Woman Goalkeeper: 2014 ==References== ==Other websites== *Profile at DFB *Player German domestic football stats at DFB * * * * * Category:1991 births Category:Living people Category:German women's footballers Category:2011 FIFA Women's World Cup players Category:2015 FIFA Women's World Cup players Category:VfL Wolfsburg (women) players Category:Germany women's international footballers Category:Women's association football goalkeepers Category:Footballers at the 2016 Summer Olympics Category:Olympic gold medalists for Germany Category:Medalists at the 2016 Summer Olympics Category:Olympic medalists in football Category:Frauen-Bundesliga players Category:2019 FIFA Women's World Cup players",
 "title": "Almuth Schult"
}