{
 "id": "745396",
 "text": "The President pro tempore of the Senate of the Philippines is the second highest-ranking official of the Senate of the Philippines. When the Senate President cannot do his job in the Senate, the Senate President pro tempore presides over the Senate. ==List of Senate presidents pro tempore== President pro tempore Party Term start Term end Legislature Senate President Senate of the Philippine Islands Esperidion Guanco Nacionalista 1919 1922 5th Legislature Manuel L. Quezon Sergio Osmeña Nacionalista 1922 1934 6th Legislature 7th Legislature 8th Legislature 9th Legislature Manuel L. Quezon Jose Clarin Nacionalista 1934 1935 9th Legislature Manuel L. Quezon Jose Avelino Nacionalista 1935 1935 10th Legislature Manuel L. Quezon No Senate Senate of the Commonwealth of the Philippines Elpidio Quirino Nacionalista July 9, 1945 May 25, 1946 1st Congress Manuel Roxas Melecio Arranz Liberal May 25, 1946 July 4, 1946 2nd Congress José Avelino Senate of the Philippines Melecio Arranz Liberal July 4, 1946 December 30, 1949 1st Congress José Avelino Mariano Jesús Cuenco Quintin Paredes Liberal January 31, 1950 March 5, 1952 2nd Congress Mariano Jesús Cuenco Esteban Abada Liberal March 5, 1952 May 7, 1952 2nd Congress Quintín Paredes Camilo Osías Eulogio Rodriguez Manuel Briones Nacionalista May 7, 1952 April 17, 1953 2nd Congress Eulogio Rodriguez Jose Zulueta Liberal April 17, 1953 April 30, 1953 2nd Congress Camilo Osías Manuel Briones Nacionalista April 30, 1953 December 10, 1957 2nd Congress 3rd Congress José Zulueta Fernando Lopez Democratic January 27, 1958 December 17, 1965 4th Congress 5th Congress Eulogio Rodriguez Ferdinand Marcos Nacionalista Lorenzo Sumulong Nacionalista January 17, 1966 December 30, 1966 6th Congress Arturo Tolentino Gil Puyat Jose J. Roy Nacionalista January 26, 1967 September 23, 1972 7th Congress Gil Puyat No Senate Senate of the Philippines Teofisto Guingona Jr. Liberal July 27, 1987 July 23, 1990 8th Congress Jovito Salonga Sotero Laurel Nacionalista July 23, 1990 January 18, 1992 8th Congress Jovito Salonga Neptali Gonzales Ernesto Maceda PDP–Laban January 18, 1992 January 18, 1993 8th Congress 9th Congress Neptali Gonzales Teofisto Guingona Jr. Lakas January 18, 1993 July 6, 1993 9th Congress Edgardo Angara Leticia Ramos- Shahani Lakas July 6, 1993 October 10, 1996 9th Congress 10th Congress Edgardo Angara Neptali Gonzales Blas Ople LDP October 10, 1996 June 29, 1999 10th Congress 11th Congress Ernesto Maceda Neptali Gonzales Marcelo Fernan LAMMP John Henry Osmeña LAMMP June 29, 1999 July 12, 2000 11th Congress Blas Ople Blas Ople LAMMP July 12, 2000 June 30, 2001 11th Congress Franklin Drilon Aquilino Pimentel Jr. Manuel Villar Independent July 23, 2001 August 12, 2002 12th Congress Franklin Drilon Juan Flavier Lakas August 12, 2002 June 30, 2007 12th Congress 13th Congress Franklin Drilon Manuel Villar Jinggoy Estrada PMP July 23, 2007 June 30, 2013 14th Congress 15th Congress Manuel Villar Juan Ponce Enrile Ralph Recto Liberal July 22, 2013 June 30, 2016 16th Congress Franklin Drilon Franklin Drilon Liberal July 25, 2016 February 27, 2017 17th Congress Koko Pimentel Ralph Recto Liberal February 27, 2017 June 2, 2022 17th Congress 18th Congress Koko Pimentel Tito Sotto Nacionalista Juan Miguel Zubiri Acting Independent June 2, 2022 July 25, 2022 18th Congress Tito Sotto Loren Legarda July 25, 2022 May 20, 2024 19th Congress Juan Miguel Zubiri Jinggoy Ejercito Estrada May 20, 2024 Present 19th Congress Francis Escudero ==Living former Senate Presidents pro tempore== Currently there are five living former Senate Presidents pro tempore: File:Vp guingona.jpg|Teofisto Guingona, Jr. (Lakas-CMD), served 1987–1989,1993 File:Manny Villar T'nalak Festival 2009.jpg|Manuel Villar (Independent), served 2001-2002 File:Jinggoy Estrada.jpg|Jinggoy Estrada (PMP), served 2007-2013 File:Franklin Drilon jun2017.jpg|Franklin Drilon (Liberal), served 2016-2017 File:Sen Ralph Recto.jpg|Ralph Recto (Nacionalista), served 2017-2022 ==References== *List of Senators of the Philippines ==Other websites== *Senate of the Philippines",
 "title": "President pro tempore of the Senate of the Philippines"
}