{
 "id": "745442",
 "text": "The prime minister of the Philippines () was the official job of the head of the government (whereas the President of the Philippines was the head of state) of the Philippines from 1978, until the People Power Revolution in 1986. A limited version of this office existed for a short time in 1899, during the First Philippine Republic. ==List of prime ministers== # Name Name Name Party Took office Left office President Legislature Era 1 Apolinario Mabini Non-partisan January 2, 1899 January 23, 1899 Emilio Aguinaldo Malolos Congress Revolutionary Government 1 Apolinario Mabini Non-partisan January 23, 1899 May 7, 1899 Emilio Aguinaldo Malolos Congress First Republic 2 Pedro A. Paterno Non-partisan May 8, 1899 November 13, 1899 Emilio Aguinaldo Malolos Congress First Republic Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 Office abolished November 14, 1899—October 14, 1943 \\- Jorge B. Vargas Nacionalista Party October 14, 1943 August 17, 1945 Jose P. Laurel National Assembly Second Republic Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 Office abolished October 14, 1943—June 12, 1978 3 Ferdinand E. Marcos KBL June 12, 1978 June 30, 1981 Ferdinand E. Marcos Interim Batasang Pambansa Martial law 4 Cesar E. A. Virata KBL July 28, 1981 July 23, 1984 Ferdinand E. Marcos Interim Batasang Pambansa Fourth Republic 4 Cesar E. A. Virata KBL July 23, 1984 February 25, 1986 Ferdinand E. Marcos Regular Batasang Pambansa Fourth Republic 5 Salvador H. Laurel UNIDO February 25, 1986 March 25, 1986 Corazon C. Aquino Regular Batasang Pambansa Fourth Republic The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution The presidential system is used; the President is head of both state and government by virtue of the 1987 Constitution ==More readings== * * * Digitally archived and reproduced at the University of Michigan Library, Ann Arbor, Michigan, United States since 2005. * * *",
 "title": "Prime Minister of the Philippines"
}