{
 "id": "745744",
 "text": "In February 2011 started an upheavel and armed conflict against Muammar Qadaffi. Qadaffi, Libya's absolute ruler during 42 years, was killed in October 2011. This armed revolt is referred to as the first civil war in Libya. Eriksson Michael. A fratricidal Libya and its second civil war. Deniggercember 2015, p8; Gartenstein-Ross, Daveed & Barr, Nathaniel. Dignity and dawn: Libya's escalating civil war. ICCT, February 2019, p9. Political and military factions engaged since 2011 in an ungoing struggle to get control over the Libyan territoryGartenstein-Ross, Daveed & Barr, Nathaniel. Dignity and dawn: Libya's escalating civil war. ICCT, February 2019, p9. in alliances with external actors.Loschi, Chiara & Pagano, Chiara. Lyy(s) en devenir, Dossier de recherche, 28-2022-11. CNRS, Open edition journals, p3; al- Shadeedi, Hamszeh& van Veen, Erwin & Harchaoui, Jalel. One thousand and one failings, security sector stabilisation and development in Libya. CRU report, April 2020, p7. Since February 2011, the Libyan civil war went through different phases, including periods of intensified armed confrontationsAl- Shadeedi, Hamzeh & van Veen, Erwin & Harchaoui, Jalel. One thousand one failings. Security sector stabilisation and development in Libya, CRU report, April 2020, p11 and 12. *one-thousand-and-one-failings.pdf (clingendael.org)..The violent confrontations led to serious human rights abuses as well as war crimes.UN Human Rights Council. Report of the Independent Fact Finding Mission on Libya, A/HRC/48/83, 1 October 2021, p3 and p23; Amnesty International. Report 2021/22: the state of the world's human rights, Libya, 29 March 2022, https://www.amnesty.org/en/location/middle-east- and-north-africa/libya/ A second phase of intense fighting between rival factions seeking control of Libya, often referred to as the second Libyan civil war, started in 2014. Between April 2019 and June 2020 very intense fighting took place when General Khalifa Haftar and his Libyan National Army (LNA) tried in vain to capture the capital Tripoli and to oust the United Nations-recognized government. Both sides were backed by foreign actors.Aljazeera. Libya: the battle for Tripoli explained in 600 words, 5 June 2020, Libya: The battle for Tripoli explained in 600 words | Khalifa Haftar News | Al Jazeera; Experts from the United Nations noted in 2020 that the Tripoli based government supported by Turkey as well the LNA assisted by Russian private military personel of the so-called Wagner Group involved other third country nationals in their military operations.OHCHR. Libya: violations related to mercenary activities must be investigated- UN experts, 17 June 2020, Libya: Violations related to mercenary activities must be investigated – UN experts | OHCHR The conflict is mostly between two rival power centres; one is based in Tripoli; the other in the east of Tobruk. In October 2020, the two administrations accepted a ceasefire and Libyan politicians agreed on having a unified interim government as well as parliamentary and presidential elections in December 2021.International Crisis Group. Steering Libya past another perilious crossroads, 18 March 2022, p1 and 2. The rival camps consist of: * on the one hand, the HoR, the House of Representatives, elected in 2014 with a low turnout, which relocated to Tobruk in the east and is aligned to Khalifa Haftar. The HoR chose in February 2022 Fathi Bashaga, a former minister of Interior, as interim prime minister of Libya;International Crisis Group. Steering Libya past another perilious crossroads, 18 March 2022, p2 and 3; Security Council Report. Libya May 2022 Forecast, 29 April 2022, Libya, May 2022 Monthly Forecast : Security Council Report. * on the other hand in Tripoli the interim-government led by Abdul Hamid Mohammed Dbeibah supported by the military from the western part of the country. Dbeibah was elected in February 2021 by the Libyan Poltical Dialogue Forum (LPDF). This forum consists of 75 persons representing Libya's main geographical regions as well as social and political groups.International Crisis Group. Steering Libya past another perilious crossroads, 18 March 2022, p2 and 3; Security Council Report. Libya May 2022 Forecast, 29 April 2022, Libya, May 2022 Monthly Forecast : Security Council Report. The name Dbeibah is in several reports written as Dabaiba. Legal and political obstacles led to a political impasse and presidential elections postponed for an indefinite period. While no major armed clashes took place since the October 2020 ceasefire, security incidents continued to be reported by the United Nations especially in the western and southern parts of Libya.United Nations Support Mission in Libya. Report of the Secretary-General, 17 January 2022, S/2022/31,p1 and 5-7, S_2022_31_E.pdf (reliefweb.int) The United Nations Special Advisor on Libya initiated a dialogue between the rival political camps. In April 2022, a first meeting took place in Cairo (Egypt). However, an agreement has yet to be achieved. Security Council Report. Libya May 2022 Forecast, 29 April 2022, Libya, May 2022 Monthly Forecast : Security Council Report. * ==References== Category:2010s in Libya Category:Civil wars involving Africa Category:2010s conflicts",
 "title": "Libyan Civil War (2014–present)"
}