{
 "id": "745727",
 "text": "Jojo Rabbit is a 2019 comedy-drama movie written and directed by Taika Waititi, based on Christine Leunens's book Caging Skies. Roman Griffin Davis plays Johannes \"Jojo\" Betzler, a Hitler Youth member who finds out his mother (Scarlett Johansson) is hiding a Jewish girl (Thomasin McKenzie) in their attic. He also deals with an imaginary friend-version of Adolf Hitler (Waititi). The movie also stars Rebel Wilson, Stephen Merchant, Alfie Allen, and Sam Rockwell. The movie had its world premiere at the 44th Toronto International Film Festival on September 8, 2019. Jojo Rabbit was released theatrically in the United States on October 18, 2019, and in New Zealand on October 24, 2019. It had strong positive reviews, although many criticized how Hitler and the Nazis were shown as almost harmless and funny. ==Awards and nominations== Award Year Category Work Result Ref. Chicago Film Critics Association Most Promising Performer Jojo Rabbit Columbus Film Critics Association Breakthrough Film Artist Critics' Choice Movie Awards Best Young Actor/Actress Dorian Film Awards Rising Star of the Year Florida Film Critics Circle Pauline Kael Breakout Award Gold Derby Film Awards Best Breakthrough Performer Golden Globe Awards Best Actor in a Motion Picture, Musical/Comedy Greater Western New York Film Critics Association Best Breakthrough Performance Hollywood Film Critics Association Best Performance by an Actor 23 and Under Indiana Film Journalists Association Best Actor Breakout of the Year Las Vegas Film Critics Society Youth in Film - Male London Film Critics Circle Young British/Irish Performer of the Year Music City Film Critics Association Best Young Actor North Texas Film Critics Association Best Newcomer Online Association of Female Film Critics Best Breakthrough Performance Online Film and Television Association Best Youth Performance Best Breakthrough Performance: Male Phoenix Film Critics Society Best Performance by a Youth Best Breakthrough Performance San Diego Film Critics Society Breakthrough Artist Seattle Film Critics Society Best Youth Performance Washington D.C. Area Film Critics Association Best Youth Performance ==References== Category:2019 comedy-drama movies Category:American comedy-drama movies Category:Czech comedy movies Category:Czech drama movies Category:New Zealand comedy movies Category:New Zealand drama movies Category:Movies directed by Taika Waititi Category:American satirical movies Category:World War II movies Category:English-language movies Category:Movies composed by Michael Giacchino Category:2010s satirical movies Category:Movies about Adolf Hitler Category:Movies about antisemitism",
 "title": "Jojo Rabbit"
}