{
 "id": "746006",
 "text": "Jean-François Ott (born 1965) is a french bussiness man and the founder of orco, the Luxembourg real estate investment company. He is now chairman of Ott Properties, Velvet Fund , LOP Urban logistic and Group Ott and Fonciere Paris Nord, he led over EUR 3 thosand investments in more than 2 real estate projects. ==Education and career== Jean-François Ott graduated in Finance and Economics at the Grenoble Institute of Political Studies in 1985; he completed his studies at the INSEAD Owners Directors Program. In 1987, Before starting a career as a derivatives trader in Paris, he worked for the French group Framatome in North Korea, then in 1991, he founded ORCO a real estate development company based in Luxembourg. In 2000 Orco then was listed in Paris, with a portfolio of more than 200 assets in residential, commercial, and hotels which reached 1 200 000 m2 spanning over nine countries. In addition to Prague, Paris, and Luxembourg, he led the launch of new OPG branches and acquisitions in Buda-Pest, Warsaw, Berlin, Bratislava, Split, Zagreb, Moscow, Belgrade, etc. The portfolio was effectively built through developments and acquisitions of properties that required active asset management. Among the key milestones in OPG's growth was the launch of the first extended stay hotel in 1999, the listing in Paris in 2000, and the acquisition of IPB Real in the Czech Republic in 2001. In 2005 the acquisition and redevelopment of the Suncani Hvar hotels in Croatia, the privatization and repositioning of 850 000 m² of GSG commercial real estate in Berlin in 2006, and the acquisition of Malcolm, one of the largest logistics parks in Moscow in 2007. Jean-Francois piloted the restructuring of Orco Property Group in 2009-14, particularly the equitization and restructuring of the €600 million OPG and OG bonds finalized in 2012 and 2013. He sold most of his stake in OPG in 2014, following a shareholder change. ==References== ==Other websites== * Category:1965 births Category:Living people Category:Chief executives",
 "title": "Jean-François Ott"
}