{
 "id": "746461",
 "text": "Social distancing, also less confusingly called physical distancing is one way to help stop the spread of infection from viruses and bacteria between people. The goal is to lower the chance for an infection to spread from person to person. This can reduce the number of infected people at one time, which lowers the burden on health care. By lowering the number of people who get sick, lives can also be saved.Pandemic Planning – Social Distancing Fact Sheet Social distancing works for infections that are spread by droplets (cough or sneeze), physical contact, contaminated surfaces, or in the air.\"Information about Social Distancing\" , Santa Clara Public Health Department. Social distancing does not work well for infections that are spread through food, water, or insects.\"Interim Pre-Pandemic Planning Guidance: Community Strategy for Pandemic Influenza Mitigation in the United States—Early, Targeted, Layered Use of Nonpharmaceutical Interventions\", CDC, February 2007 Types of social distancing are: * closing schools * closing places of work * isolation * quarantine * cordon sanitaire * protective sequestration * canceling gatherings of people, such as sports or entertainment shows * travel restrictions * closing gyms, pools, or other such areas * encouraging people to stay at home * asking people to keep a certain distance between each other if they do need to interact All of these may have negative effects on people.Emily Arntsen, \"Closing borders can delay, but can't stop the spread of COVID-19, new report says\", News@Northeastern, March 6, 2020. However, these may be preferred to the effects of a specific disease. == References == == Other websites == * * Harry Stevens, \"Why outbreaks like coronavirus spread exponentially, and how to 'flatten the curve'\" , The Washington Post, 14 March 2020, \"These simulations show how to flatten the coronavirus growth curve\" Category:Infectious diseases Category:Epidemiology Category:Medicine",
 "title": "Social distancing"
}