{
 "id": "746824",
 "text": "Pamela Jo Bondi (born November 17, 1965) is an American attorney and politician serving as the 87th U.S. attorney general under the second Trump administration since 2025. Before, she was the 37th attorney general of Florida from 2011 to 2019, the first woman elected to the office. In November 2024, then-President-elect Donald Trump announced Bondi to be attorney general after former representative Matt Gaetz withdrew from consideration. She was confirmed in a 54–46 Senate vote on February 4, 2025, and sworn in the next day. ==Early life== Bondi was born in Tampa, Florida. She grew up in nearby Temple Terrace. Bondi graduated from the University of Florida in 1987 with a degree in criminal justice. She earned a Juris Doctor from Stetson Law School in 1990.\"Lawyer info-Pam Bondi\" Florida Bar, Find a Lawyer == Attorney General of Florida == Bondi ran for Florida Attorney General in the 2010 election. She ran against former state representative Holly Benson and lieutenant governor Jeff Kottkamp in the Republican primary. She won the primary with 37.89% of the vote. In the general election, she ran against Democratic nominee Dan Gelber. She won the election with 54% of the vote and became state's first female Attorney General. Bondi was the lead attorney general in an unsuccessful lawsuit wanting to overturn the Patient Protection and Affordable Care Act. In 2018, Bondi joined with 19 other Republican-led states in a lawsuit to overturn the ACA's bans on health insurance companies charging people with medical conditions that got sick before they had insurance. Bondi was against same-sex marriage and other LGBT rights. In August 2018, while still serving as Florida Attorney General, Bondi co-hosted The Five on Fox News three days in a row. Bondi was re-elected in November 2014, receiving 55% of the vote. === Support of Donald Trump === In 2016, a supporter of Donald Trump, Bondi gave a speech at the Republican National Convention, during which she started the \"Lock her up\" chants meant at the Democratic nominee Hillary Clinton. ===First Trump impeachment=== In November 2019, she was hired by the first Trump administration to help the White House during Trump's first impeachment trial. Her role on the impeachment defense team was to \"attack the process\" of the impeachment inquiry. On January 17, 2020, Bondi was named as part of Trump's defense team for the Senate impeachment trial. ===2020 presidential election claims=== Bondi spoke in support of Trump at the 2020 Republican National Convention. While votes were being counted in the 2020 United States presidential election, Bondi supported Trump's claims that there was voter fraud in Georgia, Pennsylvania, and Wisconsin. On November 5, 2020, host Steve Doocy asked Bondi to show evidence for her claims of fraud, to which she refused. Bondi later claimed that Trump had won Pennsylvania, despite votes there still being counted. During the final months of his presidency, Trump appointed Bondi to the board of trustees of the John F. Kennedy Center for the Performing Arts. ==U.S. Attorney General== ===Nomination=== On November 13, 2024, President-elect Donald Trump announced he would nominate then-U.S. Representative Matt Gaetz to serve as United States attorney general for his second administration. However Gaetz's nomination became controversial after sexual abuse and sex trafficking accusations. A week later on November 21, Gaetz withdrew his nomination. Hours after Gaetz withdrew his nomination, President-elect Trump nominated Bondi to serve as Attorney General. Bondi had two hearing dates before the United States Senate Committee on the Judiciary on January 15 and January 16, 2025. During her hearing, some issues about her lobbying career with special interest groups and foreign governments were raised. On January 29, the Senate Judiciary Committee approved her nomination in a 12-10 vote, with all Democrats voting against her nomination. On February 3, the United States Senate advanced her nomination for a full vote after voting to limit debate on her nomination by a 52 to 46 vote. She was confirmed in a 54–46 Senate vote on February 4, 2025. The only Democratic Senator who voted \"aye\" was Senator John Fetterman. ===Tenure=== Bondi was sworn-in by Associate Justice Clarence Thomas on February 5, 2025 at the White House. That same day, she made orders for the Justice Department to help President Trump's mass deportation efforts, to help states secure and execute the death penalty and to stop funding sanctuary cities. ==Personal life== Bondi married Garret Barnes in 1990; however the couple divorced after 22 months of marriage. In 1996, Bondi married Scott Fitzgerald. They divorced in 2002. She was engaged to Greg Henderson in 2012. Since 2017, she has been in a relationship with John Wakefield. ==References== ==Other websites== * Pam Bondi for Attorney General (Campaign website - not found on 1/31/2019) * Category:1965 births Category:Living people Category:American lobbyists Category:Florida attorneys general Category:Politicians from Tampa, Florida Category:Republican Party (United States) politicians Category:United States Attorneys General",
 "title": "Pam Bondi"
}