{
 "id": "746910",
 "text": "\"Say So\" is a song recorded by American rapper and singer Doja Cat. It was sent to pop radio on January 28, 2020, as a single from her second studio album, Hot Pink (2019). The song became viral when it was used on the social media app TikTok. It was written by Doja Cat and Lydia Asrat, along with its producers, Dr. Luke and Yeti Beats. So far, it reached the top ten in the US, UK, Australia, New Zealand, and Canada. On May 1, 2020, a remix of the song with Trinidadian-born American rapper Nicki Minaj was released, containing hip hop beats. Another Minaj remix was released May 8 (called the \"original version\"), which keeps the disco beat of the song. On May 11, 2020, Billboard announced that “Say So” had topped the Hot 100. It became both Doja’s and Minaj’s first number-one single in the US. The solo version of the song reached the top of the Mainstream Top 40/Pop Songs airplay chart. ==Charts== ===Weekly charts=== Chart (2020) Peak position Brazil (Top 100 Brasil) 42 Bulgaria (PROPHON) 9 Colombia (National- Report) 37 Croatia (HRT) 9 Denmark (Tracklisten) 9 El Salvador (Monitor Latino) 6 Estonia (Eesti Tipp-40) 5 France (SNEP) 9 Global 200 (Billboard) 50 Greece (IFPI) 13 Iceland (Tonlist) 5 Italy (FIMI) 45 Japan Hot Overseas (Billboard) 9 Latvia (Latvijas Top 40) 1 Lebanon (OLT20) 5 Lithuania (AGATA) 5 Malaysia (RIM) 2 Mexico (Monitor Latino) 2 Mexico Airplay (Billboard) 1 New Zealand (RMNZ) 3 Norway (VG-lista) 19 Panama (Monitor Latino) 8 Paraguay (SGP) 94 Romania (Airplay 100) 20 Serbia (Radiomonitor) 2 Singapore (RIAS) 4 Slovenia (SloTop50) 3 South Korea (Gaon) 143 Spain (PROMUSICAE) 80 Sweden (Sverigetopplistan) 17 US Rolling Stone Top 100 2 ===Year-end charts=== Chart (2020) Position Argentina Airplay (Monitor Latino) 41 Australia (ARIA) 10 Belgium (Ultratop Flanders) 25 Belgium (Ultratop Wallonia) 14 Canada (Canadian Hot 100) 8 CIS (Tophit) 21 Denmark (Tracklisten) 36 France (SNEP) 40 Hungary (Dance Top 40) 67 Hungary (Rádiós Top 40) 55 Hungary (Single Top 40) 96 Ireland (IRMA) 10 Netherlands (Dutch Top 40) 64 Netherlands (Single Top 100) 52 New Zealand (Recorded Music NZ) 12 Romania (Airplay 100) 68 Russia Airplay (Tophit) 20 Sweden (Sverigetopplistan) 59 Switzerland (Schweizer Hitparade) 56 UK Singles (OCC) 13 US Billboard Hot 100 11 US Adult Top 40 (Billboard) 20 US Dance/Mix Show Airplay (Billboard) 4 US Hot R&B;/Hip-Hop Songs (Billboard) 8 US Mainstream Top 40 (Billboard) 7 US Rhythmic (Billboard) 8 ===Certifications=== == References == Category:2019 songs Category:2020 songs Category:Disco songs Category:Hip hop songs Category:R&B; songs Category:Doja Cat songs Category:Nicki Minaj songs",
 "title": "Say So"
}