{
 "id": "747026",
 "text": "The Mighty Peking Man or Goliathon is a 1977 Hong Kong adventure monster movie produced by Shaw Brothers Studio to capitalize on the attempted surrounding the King Kong (1976). The film was originally released in the US in March 19, 1980 as Goliathon dubbed by Les Filmes Jacques Willemetz-Paris. as the critics entry for Infra-Man. as a mockbuster of King Kong probably made by Hong Kong cinema and Japanese special effects. this film later inspired by the mockbuster Powerpuff-inspired series, Nutri Ventures or Mighty King Man by Bob Boyle. ==Synopsis== A giant Himalayan cryptid-like ape named Utam, Johhny find tries to save a sexy Russian Tarzanette from a sleazy show-biz promoter. then in a earthquake middle of the Himalayas erupting the mountain where the ape monster called Peking Man goes rampage in a nearby village. Arriving in India, Johnny finds an giant footprint from a 70-foot creature. In middle of morning where Johnny surround Utam's hand and drops down and attacking him, saved by Samantha. and finds a crashing plane wherabouts herself by parents killed. then in flashback, Samantha as a child arriving a giant cryptid. Samantha went eating fruit, a snake bitten her the thigh and a jaguar brawls off the snake. in nightfall, Utam tells leaving India, then move on. they captured by Lu Tien catching Utam was carried by a tanker ship as a exhibit in Hong Kong Stadium, the ship went underby storm and crashing onto the rock and pushes left. next morning when the crowd where Utam pushed by a chains onto the dump trucks and a wheel loaders. Utam shows Samantha slapped by Lu Tien, escaping Utam inside the cage breaks, Utam finds Samantha, wrecking the buildings. Utam smashing the window holds Lu Tien grabs by creature's hand and throws Lu Tien on the ground, and squashed his foot also killed. Utam went angrily to destroy several humans, buildings. arrived by a military armored cars and helicopters to shoot Utam. the creature climbing the Connaught Centre or Jardine House attacked by helicopters. to surrender Utam stopped by Samantha, continue to firing the creature. Utam destroyed the chopper, the army detonating the water tanks by gas and time bomb to explode the creature. Utam saving Samantha by an bombs inside the building, then Utam burns onto the fire his back onto and fell off the building and exploded Utam to rubble. Johnny find Samantha dead. ==Cast== * Danny Lee - Johnny Feng (Gregory Snegoff, voice) * Evelyne Kraft - Samantha (Mickie McGowan, voice) * Ku Feng - Lu Tien (Barry Haigh, voice) * Lin Wei-tu - David Chen * Norman Chui - Ah Lung * Keizo Murase - Utam/Ah Wang (Peking Man) * Ted Thomas - Commissioner General (Ted Rusoff, voice) * Chen Ping - Lucy (Jessica Harper, voice) also additional cast, Steve Nicholson as Soldier 11, Alexander Grand as Radio operator, Hsiao Yao, Chen Ping, Corey Yuen ==Release dates== 9 December 1983 March 19, 1980/April 23, 1999 (Re- release) Mexico 3 December 1979 May 24, 1978 20 January 1978 24 December 1979 6 January 1981 13 September 1979 20 January 1981 12 June 1981 28 September 1983 Hong Kong 11 August 1977 1 April 1981 6 April 1980 16 April 1998 13 May 1980 26 December 1979 22 November 1978 30 September 1981 4 March 1978 ==Trivia== *production begins in 1976, Shaw Brothers producing an monster movie in 1977, called Mighty Peking Man or Xing Xing Wang/Orangutan King special effects done by a Japanese crew include, Keizo Murase, Sadamasa Arikawa and Koichi Kawakita creating miniatures, vehicle models and the creature Peking Man or Utam in English dub, by themselves. filmed in India and Hong Kong from 1976 to 1977. ===Soundtrack=== * Supression - Jack Trombley * Forces of Integration - Edward Michael * Always - Roger Webb * Could It Be Love - Jan Butler, Frank McDonald, Chris Rae * Revolt - Eric Towren * Wheeling and Dealing, The Jam - Soul City Orchestra * Symphony No. 9. Moderato and Finale - Dmitri Shostakovich == References == * Category:1977 horror movies Category:Giant gorilla movies Category:1977 adventure movies Category:Hong Kong adventure movies Category:Hong Kong horror movies Category:Mockbuster movies Category:1970s monster movies Category:Movies set in Asia Category:Buena Vista International movies Category:Lionsgate movies Category:Exploitation movies",
 "title": "Goliathon (1977 movie)"
}