{
 "id": "747181",
 "text": "Viruses are the ultimate expression of parasitism. They not only take nutrition from the host cell but also direct it metabolic machinery to synthesize new virus particles. viral chemotherapy was considered impossible, as it would require interference with cellular metabolism in the host. ==Classification== 1\\. Anti-Herpes virus : idoxurudine, trifluridine, Acyclovir, valacyclovir, Famciclovir, Ganciclovir, Valganciclovir, Cidofovir, Foscarnet, Fomivirsen 2\\. Anti-Influenza virus: Amantadine, rimantadine, Oseltamivir, Zanamivir 3\\. Anti-Hepatitis virus/nonselective antiviral drugs Primarily for hepatitis B: Lamivudine, Adefovir dipivoxil, Tenofovir Primarily for hepatitis C: Ribavirin, Interferon α 4\\. Anti retrovirus: (A) neucleoside rivers transcriptas inhibitor: Zidovudine Didanosine, Stavudine, lamivudine, Abacavir, Emtricitabine, Tenofovir (B) nonnucleoside reverse transcriptase inhibitors (NNRTIs): Nevirapine, Efavirenz, Delavirdine (C) Protease inhibitors: Ritonavir, Atazanavir, Indinavir, Nelfinavir, Saquinavir, Amprenavir (D) Entry (Fusion) inhibitor: Enfuvirtide (E) CCR5 receptor inhibitor: Maraviroc (F) Integrase inhibitor: Raltegravir == Acyclovir == This deoxiguanosine analogue antiviral drug requires a virus specific enzyme for conversion to the active metabolite that inhibits DNA synthesis and viral replication. Acyclovir is taken by the virus infected cells. Because of selective generation of the active inhibitor in the virus infected cell and its greater inhibitory effect on viral DNA synthesis, acyclovir has low toxicity for host cells: a several hundred-fold chemotherapeutic index has been noted. === Pharmacokinetics === Only about 20% of an oral dose of acyclovir is absorbed. It is little plasma protein bound and is widely distributed attaining CSF concentration that is 50% of plasma concentration. After topical application, it penetrates cornea well. Acyclovir is primarily excreted unchanged in urine, both by glomerular filtration and tubular secretion; plasma t½ is 2–3 hours. === Use === * Acyclovir is very usefull in patients with normal as well as deficient immune status. * genital Herpes simplex generally caused by type 2 virus can be treated by topical, oral or parenteral acyclovir depending on stage & severity of disease. * Primary disease: Topical treatment has low efficacy; 5% ointment is applied locally 6 times a day for 10 days. This is useful if started early and in mild cases. Late and more severe cases should receive oral therapy (1 g/day in 5 divided doses or 400 mg TDS for 10 days) in addition to local therapy. Both local and oral therapies afford symptomatic relief and rapid healing of lesions, but do not prevent recurrences * Mucocutaneous H. simplex It is a type-1 virus disease, remains localized to lips and gums; does not usually require specific treatment, but acyclovir skin cream may provide some relief. Spreading lesions may be treated with 10 day oral acyclovir. The disease often gets disseminated in immunocompromised individuals and may be treated with oral or i.v. acyclovir (15 mg/kg/day) for 7 days, but recurrences are not prevented. * H. simplex encephalitis (type-1 virus): Acyclovir 10 to 20 mg/kg/8 hr i.v. for >10 day is the drug of choice. Treatment is effective only if started early: delay precludes salutary effect on mortality and neurological complications. === Side effects === * topical: Stinging & burning sensation after each application. * oral: The drug is used for headache, nausea, malaise and some CNS effects. * Intravenous: Rashes, sweating, emesis and fall in BP occur only in few patients. Dose-dependent decrease in g.f.r. is the most important toxicity; occurs especially in those with kidney disease; normalises on discontinuation of the drug == Amantadine == Chemically, it is a unique tricyclic amine unrelated to any nucleic acid precursor, but inhibits replication of influenza A virus. the activity of amantadine is strain specific, influenza b is not affected. H5N1 and H1N1 strains of Influenza A are resistant in most areas. it appears to act an early step (possibly uncoating) as well as at a late step (viral assembly) in viral replication. protein designated M2 which acts as an Ion channel has been identify as one of is targets of action. Resistance to amantadine develops by mutation causing amino acid substitutions in the M2 protein. === Uses === * Prophylaxis of influenza A2 during an epidemic or seasonal influenza, especially in high risk patients. Influenza season and epidemics generally last ~ 2 months, and only this period needs to be covered by prophylaxis. * when the Epidemic causing strain of virus is known to be sensitive to amantadine, should prophylactic use be considered. * However, amantadine is no longer recommended in united kingdom, either for prophylaxis or for treatment of influenza. * Treatment of influenzal (A2) illness: a modest therapeutic effect (reduction in fever, congestion, cough and quicker recovery) occurs if the drug is given immediately after the symptoms appear. A 5 day treatment is advised. === Adverse effects === Nausea, Anorexia, Insomnia, Dizziness, Nightmares, Lack of mental concentration, Rarely Hallucinations have been reported. Ankle edema occurs due to local vasoconstriction. === Interferon α === α Interferons (IFNs)are low molecular weight glycoprotein cytokines produced by host cells in response to viral infections, TNFα, IL-1 and some other inducers. They have nonspecific antiviral activity as well as other complex effects on immunity and cell proliferation. interferons binds to a very specific cell surface receptors and affect its replication at multiple steps, viral penetration, synthesis of viral mRNA, assembly of viral particles and their release, but the most widespread effect is direct or indirect suppression of viral protein synthesis, i.e. inhibition of translation. interfeorn receptor like JAK STAT tyrosine protein kinase receptors which on activation phosphorylate cellular proteins. These then migrate to the nucleus and induce transcription of ‘interferon-inducedproteins’ which exert antiviral effects === Uses === * Chronic hepatitis B: IFNα2Α 2.5−5 ΜU/m2 or IFNα2Β 5−10 ΜU given 3 times per week for 4–6 months causes disappearance of HBVDNA from plasma and improvement in liver function tests/histology in nearly half of the patients. High doses (10 MU) injected thrice weekly for 6 months often produce prolonged remission, but relapses do occur. The pegIFNs 180 μg s.c. weekly for 24 to 48 weeks produce better and more sustained responses. * Chronic hepatitis C: IFNα2Β 3ΜU 3 times weekly for 6–12 months has produced remission in 50–70% patients. Viral RNA becomes undetectable and liver function tests return to normal. Histology improves if response is sustained. However, relapses occur in majority of patients. PegIFNs 180 μg/week are more effective and induce longer lasting remissions. Combination therapy with IFN/pegIFN + ribavirin is particularly indicated in patients who do not respond to IFN alone. * AIDS- related Kaposi’s sarcoma: IFN is used to treat AIDS related Kaposi’s sarcoma, but not to treat HIV as such. However, interferon accentuates haematological toxicity of zidovudine. * Condyloma acuminata: caused by papilloma virus is usually treated with topical podophyllin. Intralesional interferon injection may be used in refractory cases. === Adverse effects === * Flu-like symptoms—fatigue, aches and pains, malaise, fever, dizziness, anorexia, nausea, taste and visual disturbances develop few hours after each injection, but become milder later. * neurotoxicity - numbness, neuropathy, altered behaviour, mental depression, tremor, sleepiness, very rarely convulsions Antiviral drugs are a type of drug used for treating viral infection. Most antivirals are used for specific viral infections, while a broad-spectrum antiviral works against a wide range of viruses. Unlike most antibiotics, antiviral drugs do not destroy their target pathogen (something that causes disease); instead they stop their development. Antiviral drugs are a type of antimicrobials, a larger group which also includes antibiotic (also called antibacterial), antifungal and antiparasitic drugs, or antiviral drugs based on monoclonal antibodies. Most antivirals do not cause much damage to the body, and can be used to treat infections. They are different from viricides, which are not medicine but deactivate or destroy virus particles inside or outside the body. Natural antivirals are made by some plants such as eucalyptus and Australian tea trees. == References == all drugs mechanism of action by uvmedicine.store ==Related pages== *Antibiotics Category:Drugs Category:Virology",
 "title": "Antiviral drug"
}