{
 "id": "747252",
 "text": "Douglas Craig Emhoff (born October 13, 1964) is an American lawyer who served as the second gentleman of the United States from 2021 to 2025 as the husband of Kamala Harris, the 49th U.S. vice president. As the first husband of a vice president, Emhoff is the first second gentleman in U.S. history. He is also the first Jewish spouse of a U.S. vice president. ==Biography== === Early life === Douglas Craig Emhoff was born on October 13, 1964, in New York City to Jewish parents. From 1969 to 1981, he grew up in Matawan and Old Bridge Township, New Jersey. When he was 17, he moved with his family to Southern California. He earned a Bachelor of Arts degree in communication studies from California State University, Northridge, in 1987 and a Juris Doctor from the USC Gould School of Law in 1990. === Legal career === Emhoff is an entertainment lawyer. He opened his own firm with Ben Whitwell in 2000 in California. His clients included Walmart and Merck, and he became managing director of Venable's West Coast offices. === 2020 presidential election === Emhoff joined DLA Piper as a partner in 2017, working at its Washington, D.C., and California offices. Following the announcement that his wife would be the running mate of Joe Biden in the 2020 U.S. presidential election, Emhoff took a leave of absence from the firm. After the Biden–Harris ticket won, the campaign announced Emhoff would leave DLA Piper before inauguration day. In August 2020, Kamala Harris was announced as Biden's running mate in the presidential election, making Emhoff the third man in U.S. history to be a spouse of the vice presidential candidate of a major party. == Second gentleman of the United States (2021–2025) == Emhoff became the second gentleman of the United States when his wife was sworn-in as the 49th U.S. vice president on January 20, 2021. He became the first second gentleman of the United States in U.S. history. He is also the first Jewish spouse of a U.S. vice president. In his role as second gentleman, Emhoff said he wanted to focus on equal access to justice and legal representation. In March 2021, while second gentleman, Emhoff began teaching at Georgetown University Law Center. During his time as second gentlemen, he also helped the Joe Biden administration in fighting against antisemitism. Emhoff was part of the White House team that launched the U.S. National Strategy to Counter Antisemitism, the country's first combatting antisemitism strategy, on May 25, 2023. == Subsequent activities (2025–present) == After his wife's vice presidency ended on January 20, 2025, they moved back to Los Angeles, where they helped distribute food to victims of the Palisades Fire. Emhoff announced he would return to his law job at Willkie Farr & Gallagher to become a partner at the corporate law firm , splitting his time between Los Angeles and New York. He will advise companies on crises including litigation and corporate investigations. ==Personal life== Emhoff was married to movie producer Kerstin Mackin from 1992 to 2008. They have two children together, Cole and Ella. While Emhoff and Mackin continue to be friends after their divorce, Emhoff has said that he had an extramarital affair with one of his children's teachers. In 2013, Emhoff was set up on a blind date with then-attorney general of California, Kamala Harris. They became engaged in March 2014, and were married on August 22, 2014. As of August 2019, Emhoff and Harris had a net worth of $5.8million. Emhoff and Harris have homes in Los Angeles, San Francisco, and Washington, D.C. == Related pages == * Joe Biden (former - or 46th - president to the United States) * United States Presidents (president of the United States) ==References== ==Other websites== * Douglas Emhoff on White House website * Category:1964 births Category:Living people Category:Lawyers from New York City Category:Second Spouses of the United States Category:Kamala Harris Category:Lawyers from Washington, D.C. Category:Lawyers from New Jersey Category:Academics from New Jersey Category:Academics from New York City Category:Academics from Washington, D.C. Category:Jewish American academics",
 "title": "Doug Emhoff"
}