{
 "id": "747264",
 "text": "John Griffith Davies (17 May 1929 - 24 March 2020) was an Australian-American breaststroke swimmer and politician. Davies won a gold medal in the 200-metre breaststroke at the 1952 Summer Olympics in Helsinki and set a world record in the 200 yard breaststroke (short course)Cedar Rapids Gazette 29 March 1952 Page 4 and tied the world record in the 200 m breaststroke (long course). After retiring from competition swimming, he became a lawyer in California. He was appointed a United States District Judge of the United States District Court for the Central District of California by President Ronald Reagan in 1986.rConfirmation hearings on federal appointments : hearings before the Committee on the Judiciary, United States Senate, Ninety-ninth Congress, first session, on confirmation hearings on appointments to the federal judiciary and the Department of Justice. pt.4 (1985), page 45 He presided over the trial of the Los Angeles Police Department officers charged with assaulting Rodney King. He retired from the court in 1998. Davies was born in Willoughby, New South Wales, Australia.John Davies . sports-reference.com He studied at the University of Michigan and at the University of California at Los Angeles. He moved to the United States in 1955. Davies was added into the International Swimming Hall of Fame in 1984,International Swimming Hall of Fame, Honorees, John Davies (AUS) . Retrieved 16 March 2015. and the Sport Australia Hall of Fame in 1992. He received an Australian Sports Medal in 2000. Davies died of cancer in Pasadena, California on 24 March 2020, aged 90.John G. Davies, 90, Retired Judge Of U.S. District Court, Dies ==References== Category:1929 births Category:2020 deaths Category:Cancer deaths in California Category:Naturalized citizens of the United States Category:Olympic gold medalists for Australia Category:Australian swimmers Category:American judges Category:Lawyers from Los Angeles Category:Sportspeople from New South Wales Category:Politicians from Los Angeles Category:Republican Party (United States) politicians",
 "title": "John Davies (swimmer)"
}