{
 "id": "747203",
 "text": "NASA assigned 32 American astronauts to the Apollo lunar landing program, and 24, flying on nine missions between December 1968 and December 1972, orbited the Moon. During six two-man landing missions twelve astronauts walked on the lunar surface, and six of those drove Lunar Roving Vehicles. Three flew to the Moon twice, one orbiting both times and two landing once apiece. == Apollo astronauts who walked on the Moon == Image Name Born Died Age at first step Mission Lunar EVA dates Military service Alma Mater 1 Neil Armstrong 38y 11m 15d Apollo 11 July 21, 1969This date is based on Coordinated Universal Time (UTC). Americans alive at the time remember it as the night of July 20, 1969 (Armstrong set foot on the Moon at 10:56 p.m. Eastern Daylight Time), but the official NASA chronology was kept in Greenwich Mean Time (GMT), so the first step was 2:56 a.m. on the 21st: CivilianArmstrong had mustered out of the United States Navy and was already a NASA employee when he and Elliot See became the first civilian astronauts in Astronaut Group 2; see Armstrong's NASA biography and a description of his receiving a NASA award , among others. Purdue University, University of Southern California 2 Buzz Aldrin 39y 6m 0d Air Force United States Military Academy, MIT 3 Pete Conrad data-sort-value=\"1999-07-08\" 39y 5m 17d Apollo 12 November 19–20, 1969 Navy Princeton University 4 100px Alan Bean 37y 8m 4d Navy University of Texas, Austin 5 Alan Shepard 47y 2m 18d Apollo 14 February 5–6, 1971 Navy United States Naval Academy, Naval War College 6 Edgar Mitchell 40y 4m 19d Navy Carnegie Mellon University, Naval Postgraduate School, MIT 7 100px David Scott 39y 1m 25d Apollo 15 July 31 – August 2, 1971 Air Force University of Michigan, United States Military Academy, MIT 8 James Irwin data-sort- value=\"1991-08-08\" 41y 4m 14d Air Force United States Naval Academy, University of Michigan 9 100px John Young data-sort-value=\"2018-01-05\" 41y 6m 28d Apollo 16 April 21–23, 1972 Navy Georgia Institute of Technology 10 Charles Duke 36y 6m 18d Air Force United States Naval Academy, MIT 11 100px Eugene Cernan 38y 9m 7d Apollo 17 December 11–14, 1972 Navy Purdue University, Naval Postgraduate School 12 Harrison Schmitt 37y 5m 8d CivilianSchmitt, a geologist, was chosen as a scientist in Astronaut Group 4. Caltech, University of Oslo, Harvard University == Apollo astronauts who flew to the Moon without landing == Image Name Born Died Age Mission Military service Notes 1 Frank Borman November 7, 2023 (aged 95) 40 Apollo 8 December 21–27, 1968 Air Force 2 Jim Lovell 40 42 Apollo 8 December 21–27, 1968 Apollo 13 April 11–17, 1970 Navy Intended to land on Apollo 13; only person to fly to the Moon twice without landing. 3 Bill Anders June 7, 2024 (aged 90) 35 Apollo 8 December 21–27, 1968 Air Force 4 Tom Stafford September 17, 1930 March 18, 2024 (aged 93) 38 Apollo 10 May 18–26, 1969 Air Force Later flew on Apollo–Soyuz Test Project. 5 Michael Collins October 31, 1930 April 28, 2021 (aged 90) 38 Apollo 11 July 16–24, 1969 Air Force 6 Dick Gordon 40 Apollo 12 November 14–24, 1969 Navy Trained to land, slated for Apollo 18 (canceled). 7 Jack Swigert 38 Apollo 13 April 11–17, 1970 Air Force 8 Fred Haise 36 Apollo 13 April 11–17, 1970 Marines, Air Force Intended to land; later trained to land and slated to command Apollo 19 (canceled); flew the Space Shuttle on approach / landing tests. 9 Stu Roosa 37 Apollo 14 January 31 – February 9, 1971 Air Force In rotation to land on Apollo 20 (canceled). 10 Al Worden 39 Apollo 15 July 26 – August 7, 1971 Air Force 11 Ken Mattingly October 31, 2023 (aged 87) 36 Apollo 16 April 16–27, 1972 Navy Later flew two Space Shuttle missions. 12 Ron Evans 39 Apollo 17 December 7–19, 1972 Navy ==Related pages== * Moonwalkers ==References== * Apollo astronauts",
 "title": "List of Apollo astronauts"
}