{
 "id": "747645",
 "text": "List of the statues and memorials in Baku, the capital of Azerbaijan. == Statues == Statues of outstanding people Year Image Person Location Note 1930 Mirza Fatali Akhundov At the intersection of Bunyad Sardarov and Said Rustamov, Ahmed Javad streets 1923 26 Baku Commissars In the square of 26 Baku Commissars (Current name of street is Sahil Garden) 1949 Nizami Ganjavi In front of Nizami Museum of Azerbaijani Literature 1958 Mirza Alakbar Sabir In the Istiglaliyyat Street, Mirza Alakbar Sabir Garden From 1922 to 1958, there was another statue in the place of the monument of the poet. 1960 Uzeyir Hajibeyov İn front of the National Conservatory of Azerbaijan 1955 Vladimir Lenin at the 11th Red Army square (now - Azadlig Square). On the building of the House of Government of Azerbaijan In 1991, the monument was replaced by the national flag of the Republic of Azerbaijan. 1961 Samad Vurgun Pushkin Street (Baku) 1962 Fuzûlî In front of the Azerbaijan State Academic National Drama Theatre 1968 26 Commissars Memorial In the square of 26 Baku Commissars (Current name of street is Sahil Garden) 1968 Mikayil Mushfig Inshaatchilar Avenue 1972 Nariman Narimanov Nariman Narimanov Avenue 1973 Mehdi Huseynzade At the intersection of Tbilisi Avenue and Bakikhanov Street 1980 Imadaddin Nasimi At the intersection of Samad Vurgun Street and Nizami Street 1998 Yusif Mammadaliyev In the Istiglaliyyat Street, near the Ismailiyya Palace 2002 Azim Azimzade In the Old City (Baku) 2012 Koroğlu At the intersection of Azadlig Avenue and Vagif Avenue 2014 Gara Garayev In the 28 May Street == Busts == Year Person Image Location Note 1920s Friedrich Engels Primorsky Boulevard The monument is written in Azerbaijani with Arabic letters: ENGELS == Monuments and memorials == Year Name Image Location Note 1960 Statue of a Liberated Woman At the intersection of Shikhali Gurbanov and Jafar Jabbarli's streets The monument depicts a woman removing the veil. İt was built by Fuad Abdurahmanov 1988 \"Eternal Flame\" Martyrs' Lane ==Related pages== * Statue * Monument * Baku == References == Baku Statues Category:Azerbaijan-related lists Category:Tourist attractions in Azerbaijan",
 "title": "List of statues in Baku"
}