{
 "id": "747856",
 "text": "Mastic ice creams (resin based ice cream) is popularly termed for stretchy and sticky textured ice cream, named after the spice - \"Mastic (Pistacia lentiscus resin)\". These ice creams are based on of Salep or cornflour, rose water, and the \"Mastic resin\" that contributes to the texture (as opposed to the texture of other ice creams that have a more airy texture) and are commonly used in Middle Eastern cuisine. Today, due to the very high price of the gum spice and the difficulty of obtaining it, there are ice cream sellers who usually replace it with glucose or other ice cream conducive to appear as a sticky dish. == History == Mastic ice cream was first invented in Turkey during the Ottoman Empire and was called: \"Dondurma\" and it has been around for 300 years when its recipe was kept secret for many years. there are places in Turkey where it is customary to put the ice cream in a large container equipped with huge spoons for constant stirring, so that you do not over-firm, and serve it in a plate with a knife and fork. The ice cream is very popular in Turkey and there are even street stalls especially for Turkish Mastic ice cream where they pour boiling chocolate syrup over an ice cream cup. There are ice cream vendors who practice juggling and street shows for tourists with ice cream because of its great flexibility and resistance to melting. The ice cream's massive publicity in Turkey has made Istanbul's neighborhood known as \"Dondorma\". === Syrian ice cream === In the middle of the 19th century a Syrian merchant brought the secret recipe of ice cream from Turkey to Damascus, where he developed a softer local version of ice cream called \"Booza\", which is lighter And airy from the Turkish version, and from there it was distributed to Arab countries. in the Middle East only sells the Arabic version of the ice cream, while in the Far East only the Turkish version of the ice cream sells. == Related pages == * Kulfi * Bastani sonnati",
 "title": "Mastic ice creams"
}