{
 "id": "747942",
 "text": "Joan Didion (; December 5, 1934 – December 23, 2021) was an American writer. She was born in Sacramento, California. In the 1960s, she released a collection of essays titled Slouching Towards Bethlehem (1968). In 1970, she released Play It as It Lays. She was seen as an important writer during the New Journalism period. ==Early life== Didion was born on December 5, 1934, in Sacramento, California, to Eduene (née Jerrett) and Frank Reese Didion. She received a B.A. in English from University of California, Berkeley, in 1956. Didion wrote her first novel, which was about a woman dying in the Sahara Desert, when she was five years old. ==Career== In 1991, she wrote the earliest mainstream media article to suggest the Central Park Five had been wrongfully convicted. In 2005, she won the National Book Award for Nonfiction and was a finalist for both the National Book Critics Circle Award and the Pulitzer Prize for Biography/Autobiography for The Year of Magical Thinking. In 2017, a Netflix documentary about her career, The Center Will Not Hold, was released. ==Personal life== Didion was married to writer John Gregory Dunne from 1964 until his death in 2003. They adopted one daughter, Quintana Roo Dunne. Didion died from problems caused by Parkinson's disease at her home in New York City on December 23, 2021, at the age of 87. ==References== ==Other websites== * Official website * Joan Didion on The California Museum's California Legacy Trails * The New York Review of Books: Joan Didion * * * Joan Didion, on Enciclopedia Britannica, Encyclopædia Britannica, Inc * Joan Didion, on Open Library, Internet Archive * Joan Didion, on Goodreads * Joan Didion, on AllMovie, All Media Network * Joan Didion, on Internet Broadway Database, The Broadway League Category:1934 births Category:2021 deaths Category:American novelists Category:American political writers Category:American essayists Category:Writers from Sacramento, California Category:Deaths from Parkinson's disease",
 "title": "Joan Didion"
}