{
 "id": "747946",
 "text": "Notre Dame College, Dhaka () is a Catholic higher secondary school as well as a degree college, in Dhaka. A society of priests named Congregation of Holy Cross started it in 1949. According to the result of HSC exam, it is one of the best colleges of Bangladesh. Every year 3290 students get the opportunity to enroll and study here. ==History== Notre Dame College was first established at Luxmibazar of Old Dhaka in November, 1949 with the name \"St. Gregory College\". In 1954-55, the institution moved to Arambagh, Motijheel with the present name – \"Notre Dame\", referring to Mary or Maryam, mother of Jesus Christ. == Campus == === Buildings === Name Picture Built Description Father Harrington Building 1955 It is a 3-story building. Valerian Gracias (Cardinal of Bombay) laid its foundation stone on 17 January 1954. Father Martin Building 1960 It is a 4-story residential building. There is an auditorium on its ground floor. Mathis House 1964 It was built as a house for the priests in 1964. In 1972, Christo Dorshan Seminary was established here. Archbishop Ganguli Building 1997 It is a 6 stored academic building. Father Timm Building 2016 It is a 6-story academic building. Father Peixotto Building 2019 It is a 6-story building. Its ground floor is used as a canteen. == Administration == The college is administered by a governing body, led by the Archbishop of Dhaka. === Principal === The college's principal is always a priest of the Congregation of Holy Cross. The first principal was Father John J. Harrington and the current principal is Father Hemanto Pius Rozario. Since its establishment, ten priests have served as the principal of the college: # John J. Harrington (1949—1954) # James L. Martin (1954—1960) # Theotonius Amal Ganguly (March 1960—October 1960) # William Graham (1960—1967) # John Vanden Bossche (1967—1969) # Richard William Timm (1970—1971) # Ambrose Wheeler (1971—1976) # Joseph S. Peixotto (1976—1998) # Benjamin Costa (1998—2012) # Hemanto Pius Rozario (2012—present) == Notes == == References == ==Other websites== * Official website * Notre Dame Science Club * Notre Dame International Understanding and Relation Club * Rotaract Club of Notre Dame College * Notre Dame IT Club Category:Colleges and universities in Dhaka Category:20th-century establishments in Bangladesh Category:1949 establishments in Asia Category:Colleges in Dhaka District Church of Bangladesh",
 "title": "Notre Dame College, Dhaka"
}