{
 "id": "74809",
 "text": "Andrzej Wiktor Schally (also known as Andrew W. Schally; November 30, 1926 - October 17, 2024) was a Polish-born American endocrinologist. In 1977, He won the Nobel Prize in Physiology or Medicine. While he lived in a Jewish community and subsequently fled Poland, a genealogical investigation cited in the footnotes of JINFO.org found that Schally's background was \"predominantly Polish, and not Jewish\". Born in Poland, Andrew Schally received his education in Scotland and England. In 1952, he moved to Canada. He received his doctorate in endocrinology from McGill University in 1957. That same year he left for a research career in the United States where he has worked mainly at Tulane University. A Canadian citizen when he left Canada, Schally became a naturalized citizen of the United States in 1962. He was affiliated with the Baylor College of Medicine for some years in Houston, Texas.Bio at Nobelprize.org He developed a whole new realm of knowledge concerning the brain’s control over the body chemistry. His works also addressed birth control methods and growth hormones. He - as well as Roger Guillemin- described the neurohormone GnRH that controls FSH and LH. He was awarded an honorary Doctoral Degree from Jagiellonian University at Kraków. Schally died at his home in Miami Beach, Florida, on October 17, 2024, at the age of 97. ==Books== * * * Nicholas Wade (1981). The Nobel Duel, Anchor Press/Doubleday, Garden City, NY. ==References== Category:1926 births Category:2024 deaths Category:American Nobel Prize winners Category:American physicians Category:Jewish American academics Category:Jewish American scientists Category:Jewish Nobel Prize winners Category:Naturalized citizens of the United States Category:People from Vilnius Category:Polish Jews Category:Refugees from Nazism Category:Academics from Louisiana Category:American biochemists Category:American physiologists Category:Canadian physicians Category:Nobel Prize in Physiology or Medicine winners Category:Polish Nobel Prize winners Category:Polish academics Category:Polish physicians",
 "title": "Andrew Schally"
}