{
 "id": "748294",
 "text": "Playdate is an handheld video game console by Panic that came out in 2020, however it was delayed from releasing to most people until April 18, 2022. It was first introduced on May 22, 2019 on the cover of Edge magazine. Panic worked with Teenage Engineering, a Swedish consumer electronics company, to design the Playdate. The Playdate has a black-and-white 1-bit screen, 4 way directional pad, two game buttons, and a mechanical crank on the side. == Technical specifications == The Playdate allows games that are not part of a season to be sideloaded without needing to jailbreak it. Games were made using an SDK that came with a simulator and debugger and worked with C and Lua, programming languages. It is only available with the developer kit for Mac. However, in a response, Playdate said they were open to creating software for Windows, and compiling was already available, and the simulator is a work in progress. The screen technology used is Sharp's Memory LCD, which has some features of e-paper displays. Each pixel can remember if it is black or white without having to be refreshed, resulting in faster refreshing and lower power usage, whilst also being \"viewable in any light, from edge-of-vision darkness to brightest sunlight\" and having a wide 170° viewing angle. == Games == Games for the handheld came out in 12-game \"seasons\". A new game was sent over Wi-Fi every week. Each game's contents was kept secret until the week it came out, and would be automatically downloaded. The first season of games were included in the price of the console. Video games were made by Panic, and notable indie game developers such as Keita Takahashi, Zach Gage, Bennett Foddy, Shaun Inman, and Chuck Jordan. Later game titles included Crankin's Time Travel Adventure, b360, Zipper, Executive Golf DX, Snak, and Sasquatchers. List of Playdate games Season Title Developer(s) Publisher Release date 1 b360 Panic Inc. Panic Inc. 2020 1 Crankin's Time Travel Adventure Keita Takahashi, Shaun Inman Panic Inc. 2020 1 Executive Golf DX Dave Makes Panic Inc. 2020 1 Sasquatchers Chuck Jordan Panic Inc. 2020 1 Snak Zach Gage Panic Inc. 2020 1 Zipper Bennett Foddy Panic Inc. 2020 == Ideals == In a developer survey, Panic said they would like to include games by underrepresented developers, and said season one would contain games by women, and games by \"queer/trans/enby\" people. == Criticism == In May 2019, Panic were told off after the details of an email they had sent to an indie video game event that was also named Playdate said to change their name to avoid confusion. The next day, one of Panic's founders cancelled the request, saying \"My intention was always to find a way for our Playdates to co-exist [...] but we remain fine with you using the name Playdate.\" On January 29, 2020, the team behind the event (now named \"Playdate Pop Up\") announced Panic were joining the event as a sponsor, and would help the event to be considered as non-profit. == References == Category:Video game consoles",
 "title": "Playdate (console)"
}