{
 "id": "748348",
 "text": "The Prime Minister of Syria is the head of government of the Syrian Arab Republic. The Prime Minister is appointed by the President of Syria. He works with other ministers and members of the government that the new Prime Minister recommends. In 2004, Arnous was selected to serve as executive director of the General Establishment for Road Transport. He then served as governor of Deir ez-Zor and Quneitra governorates. ... Arnous served as Minister of Public Works and Housing from 2013 until 2018 and as Minister of Water Resources since 26 November 2018. The People's Council of Syria then approve the legislative program of the new government, before the new government formally take office. There are no constitutional limits on a Prime Minister's term, and several of them served multiple non-consecutive terms. ==List of officeholders== ===Syria (1920–1958)=== No. Portrait Name Term of office Political party Note(s) Took office Left office Time in office Arab Kingdom of Syria (1920) 1 Rida Pasha al-Rikabi 9 March 1920 3 May 1920 Independent Previously Military Governor in the Occupied Enemy Territory Administration — Hashim al-Atassi 3 May 1920 25 July 1920 Independent 2 Aladdin Al-Droubi 26 July 1920 21 August 1920 Independent 3 Jamil al-Ulshi 6 September 1920 30 November 1920 Independent State of Syria (under French mandate; 1925–1930) 4 Subhi Bey Barakat 26 January 1925 21 December 1925 Independent — Taj al-Din al-Hasani 29 December 1925 6 January 1926 Independent 5 Ahmad Nami 27 April 1926 9 February 1928 Independent 6 Taj al-Din al-Hasani 15 April 1928 14 May 1930 Independent First Syrian Republic (1930–1950) Mandatory Syrian Republic (1930–1946) (6) Taj al-Din al-Hasani 14 May 1930 19 November 1931 Independent 7 Haqqi al-Azm 7 June 1932 16 March 1934 Independent 8 Taj al-Din al-Hasani 16 March 1934 22 February 1936 Independent 9 Ata Bey al-Ayyubi 22 February 1936 21 December 1936 Independent 10 Jamil Mardam Bey 21 December 1936 18 February 1939 National Bloc 11 Lutfi al-Haffar 23 February 1939 13 March 1939 National Bloc 12 Nasuhi al-Bukhari 6 April 1939 9 July 1939 Independent 13 Khalid al-Azm 4 April 1941 21 September 1941 Independent 14 Hassan al-Hakim 21 September 1941 19 April 1942 Independent 15 Husni al-Barazi 19 April 1942 10 January 1943 Independent 16 Jamil al-Ulshi 10 January 1943 25 March 1943 Independent 17 Ata Bey al-Ayyubi 25 March 1943 17 August 1943 Independent 18 Saadallah al-Jabiri 19 August 1943 14 October 1944 National Bloc 19 Fares al-Khoury 14 October 1944 1 October 1945 National Bloc 20 Saadallah al-Jabiri 1 October 1945 17 April 1946 National Bloc Independent First Syrian Republic (1946–1950) (20) Saadallah al-Jabiri 17 April 1946 16 December 1946 National Bloc — Khalid al-Azm 16 December 1946 29 December 1946 Independent 21 Jamil Mardam Bey 29 December 1946 17 December 1948 National Bloc 22 Khalid al-Azm 17 December 1948 30 March 1949 Independent 23 Husni al-Za'im 17 April 1949 26 June 1949 Syrian Social Nationalist Party 24 Muhsin al-Barazi 26 June 1949 14 August 1949 Independent 25 Hashim al-Atassi 17 August 1949 24 December 1949 People's Party 26 Nazim al-Qudsi 24 December 1949 27 December 1949 People's Party 27 Khalid al-Azm 27 December 1949 4 June 1950 Independent 28 Nazim al-Qudsi 4 June 1950 5 September 1950 People's Party Second Syrian Republic (1950–1958) (28) Nazim al-Qudsi 5 September 1950 27 March 1951 People's Party 29 Khalid al-Azm 27 March 1951 9 August 1951 Independent 30 Hassan al-Hakim 9 August 1951 13 November 1951 Independent — Zaki al-Khatib 13 November 1951 28 November 1951 People's Party 31 Maarouf al-Dawalibi 28 November 1951 29 November 1951 People's Party 32 Fawzi Selu 3 December 1951 19 July 1953 Military Selu had no power, real power laid in the hands of Adib Shishakli. 33 Adib Shishakli 19 July 1953 25 February 1954 Arab Liberation Movement Shishakli resigned from office because of threats of a coup in 1954. He fled the country, claiming that he did not want the country to fall into a civil war. 34 Sabri al-Asali 1 March 1954 19 June 1954 National Party 35 Said al-Ghazzi 19 June 1954 3 November 1954 Independent 36 Fares al-Khoury 3 November 1954 13 February 1955 People's Party 37 Sabri al-Asali 13 February 1955 13 September 1955 National Party 38 Said al-Ghazzi 13 September 1955 14 June 1956 Independent 39 Sabri al-Asali 14 June 1956 22 February 1958 National Party ===United Arab Republic (1958–1961)=== No. Portrait Name Term of office Political party Took office Left office Time in office 40 Nur al-Din Kahala 7 October 1958 20 September 1960 National Union 41 Abdel Hamid al-Sarraj 20 September 1960 16 August 1961 National Union ===Syria (1961–present)=== No. Portrait Name Term of office Political party Government Note(s) Took office Left office Time in office Second Syrian Republic (Syrian Arab Republic; 1961–1963) 42 Maamun al-Kuzbari 29 September 1961 20 November 1961 Independent al-Kuzbari Kuzbari took office following the 1961 coup d'état, which dissolved the United Arab Republic. 43 Izzat al-Nuss 20 November 1961 14 December 1961 Military al-Nuss 44 Maarouf al-Dawalibi 22 December 1961 28 March 1962 People's Party al-Dawalibi 45 Bashir al-Azma 16 April 1962 14 September 1962 Independent al-Azma 46 Khalid al-Azm 17 September 1962 9 March 1963 Independent al-Azm The 1963 coup d'état, an event known as the 8th of March Revolution, toppled Azm and brought the National Council for the Revolutionary Command (NCRC) to government, although real power lay with the Ba'athist Military Committee, which organized the coup. Ba'athist Syria (Syrian Arab Republic; 1963–2024) 47 Salah al-Din al- Bitar 9 March 1963 11 May 1963 Ba'ath Party al-Bitar I — Sami al-Jundi 11 May 1963 13 May 1963 Ba'ath Party al-Bitar I (47) Salah al-Din al-Bitar 13 May 1963 11 November 1963 Ba'ath Party al-Bitar II–III 48 Amin al-Hafiz 12 November 1963 13 May 1964 Ba'ath Party al-Hafiz I 49 Salah al-Din al-Bitar 14 May 1964 3 October 1964 Ba'ath Party al-Bitar IV 50 Amin al-Hafiz 4 October 1964 22 September 1965 Ba'ath Party al-Hafiz II 51 Yusuf Zuayyin 22 September 1965 21 December 1965 Ba'ath Party Zuayyin I 52 Salah al-Din al-Bitar 1 January 1966 23 February 1966 Ba'ath Party al-Bitar V Bitar was overthrown by the Military Committee because of his support for Michel Aflaq and the National Command of the Arab Socialist Ba'ath Party. 53 Yusuf Zuayyin 1 March 1966 29 October 1968 Syrian Ba'ath Party Zuayyin II 54 Nureddin al-Atassi 29 October 1968 18 November 1970 Syrian Ba'ath Party al-Atassi Atassi was overthrown when a falling out occurred between Salah Jadid, the real ruler of Syria from 1966 to 1970, and Hafez al-Assad, the Minister of Defense. Assad initiated the Corrective Movement in 1970. 55 Hafez al-Assad 21 November 1970 3 April 1971 Syrian Ba'ath Party al-Assad 56 Abdul Rahman Khleifawi 3 April 1971 21 December 1972 Syrian Ba'ath Party Khleifawi I 57 Mahmoud al-Ayyubi 21 December 1972 7 August 1976 Syrian Ba'ath Party al-Ayyubi 58 Abdul Rahman Khleifawi 7 August 1976 27 March 1978 Syrian Ba'ath Party Khleifawi II 59 Muhammad Ali al-Halabi 27 March 1978 9 January 1980 Syrian Ba'ath Party al-Halabi 60 Abdul Rauf al-Kasm 9 January 1980 1 November 1987 Syrian Ba'ath Party al-Kasm 61 Mahmoud Al-Zoubi 1 November 1987 7 March 2000 Syrian Ba'ath Party Al-Zoubi 62 Muhammad Mustafa Mero 7 March 2000 10 September 2003 Syrian Ba'ath Party Mero I–II 63 Muhammad Naji al-Otari 10 September 2003 14 April 2011 Syrian Ba'ath Party Naji al-Otari 64 Adel Safar 14 April 2011 23 June 2012 Syrian Ba'ath Party Safar 65 Riyad Farid Hijab 23 June 2012 6 August 2012 Syrian Ba'ath Party Hijab Defected to the opposition during the civil war. — Omar Ibrahim Ghalawanji 6 August 2012 9 August 2012 Independent Hijab 66 Wael Nader al-Halqi 9 August 2012 3 July 2016 Syrian Ba'ath Party al-Halqi I–II 67 Imad Khamis 3 July 2016 11 June 2020 Syrian Ba'ath Party Khamis 68 Hussein Arnous 11 June 2020 14 September 2024 Syrian Ba'ath Party Arnous I–II 69 Mohammad Ghazi al-Jalali 14 September 2024 9 December 2024 Syrian Ba'ath Party al-Jalali Syrian Transitional Government (2024–present) 70 Mohammed al-Bashir 9 December 2024 Incumbent Independent Transitional Member of the Syrian Salvation Government. ==References== Category:Prime ministers of Syria",
 "title": "Prime Minister of Syria"
}