{
 "id": "748497",
 "text": "Gas is a city in the northwestern part of Allen County, in southeast Kansas, in the Central United States. In 2020, 475 people lived there. The city was named for the natural gas that was found in the area. ==History== In the summer of 1898 in Elm Township, E.K. Taylor sold of his farm to some spelter companies when natural gas was found in the area. This was the beginning of \"Gas City\". The place grew quickly. In 1910 the population was 1,281, and the city had a bank, a daily and a weekly newspaper, an opera house, an international money order postoffice (first opened in August 1899 Containing information taken from ). ==Geography== Gas is at (37.92257, -95.344956). It is along U.S. Route 54 in Elm Township. Gas is about three miles (5 km) east of Iola (the county seat) and 2½ miles west of the city of La Harpe. The interchange between U.S. Routes 54 and 169 is about two miles (3 km) west of Gas. The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== In the 2020 census, there were 475 people, 193 households, and 124 families living in Gas. Of the households, 83.4% owned their home and 16.6% rented their home. The median age was 41.1 years. Of the people, 89.9% were White, 1.9% were Native American, 1.3% were Black, 1.3% were Asian, 0.4% were from some other race, and 5.3% were two or more races. Hispanic or Latino of any race were 2.5% of the people. ===2010 census=== In 2010, there were 564 people, 216 households, and 149 families living in Gas. ===2000 census=== In 2000, there were 556 people, 217 households, and 167 families living in Gas. ==References== ==More reading== ==Other websites== ;City * City of Gas * Gas - Directory of Public Officials ;Schools * USD 257, local school district ;Maps * Gas City Map , KDOT Category:Cities in Allen County, Kansas Category:19th-century establishments in Kansas Category:1898 establishments in the United States",
 "title": "Gas, Kansas"
}