{
 "id": "748699",
 "text": "The president of Somalia () is the head of state of Somalia. The President is also commander-in-chief of the Somali Armed Forces. The president represents the Federal Republic of Somalia.*Provisional Constitution (adopted August 1, 2012) The office of President of Somalia was created with the proclamation of the Republic of Somalia on 1 July 1960. The first president of Somalia was Aden Abdullah Osman Daar.The Illustrated Library of The World and Its Peoples: Africa, North and East, Greystone Press: 1967, p. 338 ==History== The first president of Somalia was Aden Abdullah Osman Daar, one of the leaders of the Somali Youth League (SYL), who took office on 1 July 1960, the day on which Somalia was declared a republic. Since then the office has been held by seven further people: Abdirashid Ali Shermarke, Mohamed Siad Barre, Ali Mahdi, Abdiqasim Salad, Abdullahi Yusuf, Sharif Sheikh Ahmed, and Hassan Sheikh Mohamud. In addition, Sheikh Mukhtar acted as president between Shemarke's assassination and the coup d'état, and Aden Madoobe acted as president after Yusuf's resignation in the 2008. Sharif Sheikh Ahmed took office on 31 January 2009, after being elected by the presidential election held in January 2009. Ahmed's term as President of Somalia officially ended In August 2012, concurrent with the conclusion of the transitional federal government's mandate and the start of the federal government of Somalia. He was succeeded in office by General Muse Hassan, who had been serving in an interim capacity. President Hassan Sheikh Mohamud took office on 16 September 2012, after being elected by the presidential election held on 10 September 2012. ==Duties and responsibilities== An outline of the duties are as follow: * Appoint the prime minister, * Serve as Commander-in-Chief of the Somali Armed Forces; * Declare a state of emergency and war in accordance with the law, * Appoint and dismiss the commanders of the forces at the federal government level on the recommendation by the Council of Ministers; * Dismiss ministers, state ministers and deputy ministers on the recommendation of the prime minister; * Sign draft laws passed by the federal Parliament in order to bring them into law; * Open the House of the People of the Federal Parliament; * Hold an annual session with the House of the People of the Federal Parliament; * Appoint the chairman of the Constitutional Court, the High Court, and other judges at the federal government level in accordance with the recommendation of the Judicial Service Commission; * Appoint senior federal government officials and the heads of the federal government institutions on the recommendation of the Council of Ministers; * Appoint ambassadors and high commissions on the recommendation of the Council of Ministers; * Receive foreign diplomats and consuls; * Confer state honours on the recommendation of the Council of Ministers; * Dissolve the House of the People of the Federal Parliament when its term expires, thereby prompting new elections; * Pardon offenders and commute sentences on the recommendation of the Judicial Service Commission; and * Sign international treaties proposed by the Council of Ministers and approved by the House of the People of the Federal Parliament. ==List== Portrait Name Term of office Term of office Term of office Political party Election Portrait Name Took office Left office Time in office Political party Election • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Republic (1960–1969) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Somali Democratic Republic (1969–1991) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • • Interim Government of Somalia (1991–1997) • Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) Vacant (3 January 1997–27 August 2000) • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional National Government of Somalia (2000–2004) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Transitional Federal Government of Somalia (2004–2012) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • • Federal Republic of Somalia (2012–present) • ==Living former presidents== As of , there are three living former presidents of Somalia, as seen below. File:Abdiqasimsalad.jpg|Abdiqasim Salad served 2000–2004 born 1941 (age ) File:Somali President Sheik Sharif visits Balad Town 12 (7703057976) (cropped).jpg|Sharif Sheikh_Ahmed served 2009-2012 born 1964 (age ) File:Mohamed Abdullahi Farmajo (cropped).jpg|Mohamed Abdullahi Mohamed served 2017–2022 born 1962 (age ) The most recent president to die was Ali Mahdi Muhammad (served 1991–1997), on 10 March 2021, at the age of 82. ==References==",
 "title": "President of Somalia"
}