{
 "id": "748892",
 "text": "Downs is a city in Osborne County, Kansas, United States. In 2020, 800 people lived there. ==History== Downs started in the year 1879 when the Central Branch Railroad was extended to that point. It was named after William F. Downs, a railroad employee from Atchison, Kansas. Downs became an incorporated town in December of 1879. In 1910, 1,427 people lived there. There were two newspapers, a public library, flour mills, grain elevators, and an opera house. ==Geography== Downs is at (39.503305, -98.543500). The United States Census Bureau says that the city has a total area of . All of it is land. ==People== ===2020 census=== In 2020, there were 800 people, 384 households, and 202 families living in Downs. The population density was . 92.8% of the people were White, 1.1% were Native American, 0.4% were Asian, 1.4% were from other races, and 4.4% were from two or more races. 2.4% of the people were Hispanic or Latino of any race. ===2010 census=== In 2010, there were 900 people, 424 households, and 239 families living in Downs. The population density was . 97.6% of the people were White, 0.1% were African American, 1.1% were Native American, 0.6% were Asian, and 0.7% were from two or more races. 0.9% of the people were Hispanic or Latino of any race. ===2000 census=== In 2000, there were 1,038 people, 474 households, and 273 families living in Downs. The population density was 941.4 people per square mile (364.3/km²). 98.75% of the people were White, 0.67% were Native American, 0.29% were Asian, 0.10% were from other races, and 0.19% were from two or more races. 0.48% of the people were Hispanic or Latino of any race. ==Education== Downs is a part of USD 272 Waconda. The district elementary school is Lakeside Elementary School in Cawker City. The district high school is Lakeside High School in Downs; the mascot is Knights. School unification combined Downs and Waconda East schools into USD 272 in 2003. The combined high school became Lakeside Jr./Sr. High School in Downs. Downs High School was closed because of school unification. The Downs High School mascot was Dragons.\"Downs Dragons Hit Hard By Loss Of Veterans\", The Salina Journal, 6 September 1951, p.14. The Downs Dragons won the following Kansas State High School championships: * 1938 Boys Basketball - Class B * 1950 Boys Basketball - Class B * 1988 Boys Cross Country - Class 2-1A Downs Elementary School and Downs Junior High School was in Downs.Home. Waconda USD 272. April 9, 2002. Retrieved on February 25, 2017. ==Famous people== * Francis Schmidt, football and basketball coach ==Related pages== * Meades Ranch Triangulation Station, the geodetic base point for the North American Datum of 1927 (NAD 27), which was used as a reference point until 1983. * Waconda Lake and Glen Elder State Park. ==References== ==Other websites== ;City * City of Downs * Downs - Directory of Public Officials ;Schools * USD 272, local school district ;Pictures * Historic Images of Downs, Wichita State University Library ;Maps * Downs City Map , KDOT Category:Cities in Osborne County, Kansas Category:1879 establishments in Kansas",
 "title": "Downs, Kansas"
}