{
 "id": "748885",
 "text": "Frankfort is a city in Marshall County, Kansas, United States. In 2020, 730 people lived there. ==History== Frankfort was laid out in 1867 when the Central Branch Union Pacific Railroad was built through the area. The nearby post office of Nottingham, created in 1857, moved about a half-mile northwest to be at the railroad. It was named after Frank Schmidt, a member of the town company. Frankfort was incorporated as a city of the third class in 1875. The town is famous for the 32 men it lost during World War II. This was more per capita than any other community in the United States. ==Geography== Frankfort is at (39.703810, -96.417925). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ==People== ===2020 census=== In 2020, there were 730 people, 311 households, and 198 families living in Frankfort. The population density was 97.4% of the people were White, 0.1% were African American, 0.4% were Native American, 0.1% were Asian, and 1.8% were from two or more races. 0.8% of the people were Hispanic or Latino of any race. ===2010 census=== In 2010, there were 726 people, 307 households, and 195 families living in Frankfort. The population density was . 98.8% of the people were White, 0.6% were African American, 0.1% were Asian, and 0.6% were from two or more races. 1.2% of the people were Hispanic or Latino of any race. ===2000 census=== In 2000, there were 855 people, 367 households, and 230 families living in Frankfort. The population density was 842.2 people per square mile (323.6/km²). 98.25% of the people were White, 0.35% were African American, 0.12% were Native American, 0.12% were Pacific Islander, and 1.17% were from two or more races. 0.35% of the people were Hispanic or Latino of any race. ==Education== Frankfort is a part of USD 380 Vermilion. The Frankfort Wildcats won the Kansas State High School boys basketball class 2A championship in 1973 and the class 1A DII championship in 2012. Frankfort football teams have won state titles in 1983 in Class 1A, as well as 1996 in Class 2-1A. Both teams were coached by Larry Schroeder; he is a member of the KSHSAA Hall of Fame. Frankfort also won the 1A volleyball state championship in both 1986 and 2009. ==References== ==Other websites== ;City * City of Frankfort * Frankfort - Directory of Public Officials * Frankfort - Information , TheTaleOfTheTrail.org ;Schools * USD 380, local school district ;Maps * Frankfort City Map , KDOT Category:Cities in Marshall County, Kansas Category:1867 establishments in Kansas",
 "title": "Frankfort, Kansas"
}