{
 "id": "748883",
 "text": "Plains is a city in Meade County, Kansas, United States. In 2020, 1,037 people lived there. Its main street is the widest in the United States; the street is wide. ==History== Plains was first called West Plains, and it was platted as West Plains in January 1885. ==Geography== The United States Census Bureau says that the city has a total area of . All of it is land. ===Climate=== The Köppen Climate Classification system says that Plains has a semi-arid climate, shortened to \"BSk\" on climate maps.Climate Summary for Plains, Kansas ==People== ===2020 census=== In 2020, there were 1,037 people, 367 households, and 268 families living in Plains. The population density was . 65.0% of the people were White, 0.1% were African American, 17.6% were from other races, and 17.3% were from two or more races. 43.0% of the people were Hispanic or Latino of any race. ===2010 census=== In 2010, there were 1,146 people, 385 households and 310 families living in Plains. The population density was . 88.1% of the people were White, 0.3% were African American, 1.0% were Native American, 0.4% were Asian, 8.5% were from other races, and 1.7% were from two or more races. 36.0% of the people were Hispanic or Latino of any race. ===2000 census=== In 2000, there were 1,163 people, 402 households and 303 families living in Plains. The population density was 1,175.8 per square mile (453.6/km²). 82.12% of the people were White, 1.29% were Native American, 14.27% were from other races, and 2.32% were from two or more races. 26.23% of the people were Hispanic or Latino of any race. ==Education== Plains is a part of USD 483 Southwestern Heights. The district high school, Southwestern Heights, is between Kismet and Plains. The Southwestern Heights High School mascot is Southwestern Heights Mustangs. ==References== ==Other websites== ;City * Plains - Directory of Public Officials * Plains Economic Development ;Schools * USD 483, local school district ;Historical * Photos of early Plains ;Maps * Plains City Map , KDOT Category:Cities in Meade County, Kansas",
 "title": "Plains, Kansas"
}