{
 "id": "748942",
 "text": "\"The Blue and the Gray\" is the thirteenth episode of the twenty-second season of The Simpsons. It was first shown on television on the Fox network on February 13, 2011. The episode was watched by 5.618 million people when it was first shown on television. == Plot == Moe spends Valentine's Day alone again, so he goes to a seminar led by a man named Dr. Kissingher so he may get more condifence in getting women. Moe wants Homer to be his wingman, to help him with getting women. While this happens, Marge starts getting gray hair. She finds out that her hair was always gray, and the fumes from the chemicals she uses make her forget. She sees a couple in gray hair, so she does not worry. She surprises the family and the neighborhood with her gray hair. Bart gets annoyed when the neighborhood teases Marge for her gray hair, and Marge is annoyed because the women in the neighborhood think she is older than she really is. Homer tells Marge that she is her \"silver bellie\" to make her feel better, but he spends more time helping Moe get women to avoid looking at her. Homer becomes popular with the women he helps Moe with. Patty and Selma tell Marge that Homer would not try to be clever if he really liked Marge's new hair. Two women behind them talk about Homer at a club, making Marge jealous. While she tries to go over to the club, a couple of accidents make her look like a witch. When Marge gets to the club, she confronts Homer with a crowd of women near him. Homer helps Marge figure out that he only likes her and shows that he still loves her. After this, Marge changes her hair color back to blue, but Homer dyes his hair blue as well. == Reception == Eric Hochberger called the episode a \"funny, mediocre episode.\" Rob LaZebnik was nominated at the Writers Guild of America Award for Outstanding Writing in Animation at the 64th Writers Guild of America Awards for writing the episode. == References == == Other websites == * * Category:The Simpsons episodes Category:2011 in American television Category:2011 television episodes",
 "title": "The Blue and the Gray"
}