{
 "id": "749191",
 "text": "Validated numerics (or reliable computation) is a numerical analysis with mathematically strict error evaluation. Tucker, Warwick (2011). Validated Numerics: A Short Introduction to Rigorous Computations. Princeton University Press. In order to do so, a technology called interval arithmetic is used.Alefeld, G., & Mayer, G. (2000). Interval analysis: theory and applications. Journal of Computational and Applied Mathematics, 121(1-2), 421-464.Mayer, G. (2017). Interval analysis: and automatic result verification. Walter de Gruyter GmbH & Co KG. Validated numerics is needed for the following reasons. # It is difficult to avoid numerical errors in numerical computation, and computation without error evaluation may cause unfortunate results. # It can be applied to computer-assisted proofs for mathematical problems.Meyer, K. R., & Schmidt, D. S. (Eds.). (2012). Computer aided proofs in analysis. Springer Science & Business Media.M. Nakao, M. Plum, Y. Watanabe (2019) Numerical Verification Methods and Computer-Assisted Proofs for Partial Differential Equations (Springer Series in Computational Mathematics). One of the most known implementation of validated numerics is INTLABRump, S. M. (2010). Verification methods: Rigorous results using floating-point arithmetic. Acta Numerica, 19, 287-449.Moore, R. E., Kearfott, R. B., & Cloud, M. J. (2009). Introduction to Interval Analysis. Society for Industrial and Applied Mathematics.S.M. Rump: INTLAB - INTerval LABoratory. In Tibor Csendes, editor, Developments in Reliable Computing, pages 77-104. Kluwer Academic Publishers, Dordrecht, 1999.Hargreaves, G. I. (2002). Interval analysis in MATLAB. Numerical Algorithms, (2009.1). (Interval Laboratory). INTLAB was used to create other numerical libraries, and it was also used to solve the Hundred-dollar, Hundred-digit Challenge problems.Bornemann, F., Laurie, D., & Wagon, S. (2004). The SIAM 100-digit challenge: a study in high- accuracy numerical computing. Society for Industrial and Applied Mathematics. == References == == Related pages == * Affine arithmetic * Kantorovich theorem (A theorem frequently used in the context of validated numerics) * Numerical digit * Numerical integration * Numerical linear algebra * Numerical methods for ordinary differential equations * Numerical methods for partial differential equations * International Symposium on Scientific Computing, Computer Arithmetic, and Validated Numerics == Other websites == * Validated Numerics for Pedestrians * Reliable Computing, An open electronic journal devoted to validated numerics. Category:Numerical analysis",
 "title": "Validated numerics"
}