{
 "id": "749213",
 "text": "É or é is a letter that is not regularly found in the English language. It is the letter E with an acute accent above it. It can be found in the Afrikaans, Catalan, Czech, Danish, Emilian-Romagnol, French, Galician, Hungarian, Icelandic, Irish, Italian, Kashubian, Luxembourgish, Occitan, Norwegian, Portuguese, Slovak, Spanish, Swedish, Vietnamese, and Welsh languages. In the English language, it can be found in loanwards (for example, résumé and cliché) and romanizations (for example, Pokémon). == Use in languages == === Czech and Slovak === É is the 9th letter of the Czech alphabet and the Slovak alphabet. In the IPA, it represents /ɛː/ in these languages. === Danish, Norwegian, and Swedish === In the Danish, Norwegian and Swedish languages, the letter É is used to show that the regular letter E is stressed. It is used to change the meaning of a word. === Dutch === É is found in foreign words, mostly from French. It is also used to tell apart the Dutch words \"een\" (meaning \"a\" or \"an\" in English) and \"één\" (meaning the number one in English). It adds stress in the same way English sometimes uses italics. In Dutch, some people may use the Dutch word \"hé\" to greet eachother, meaning \"hey\" or \"hi\". === Emilian-Romagnol === In Emilian, é is used as [e] in IPA (for example, récc, meaning \"rich\" in English). In Romagnol, é is used as [eː] (for example, lédar, meaning \"thieves\" in English). === English === The letter É appears in words that came from the French language. For example, née, résumé, fiancée, sauté, and coupé. It is also used in names, such as Beyoncé, Breneé, JonBenét, and Théo. === French === The letter É is widely used in French. It is pronounced as /e/ in IPA. Another french letter, È, is pronounced as /ɛ/. The two letters look the same, but they are not the same letter. === Hungarian === É is the 9th letter of the Hungarian alphabet and is used as /eː/ in IPA. === Icelandic === É is the 7th letter of the Icelandic alphabet and is used as /jɛː/ in IPA. === Irish === In Irish, an acute accent is used to mark a vowel as a long vowel. É is used as /eː/ in IPA. === Italian === É is used as /e/ in IPA and it carries a tonic accent. It is only used in the last letter of a word (except when a different wikt:pronunciation may change the meaning of a word). For example, perché (meaning \"why\" or \"because\" in English) and pésca (which means \"fishing\" in English). The letter È is also in the Italian alphabet, which is the letter E with a grave accent. Instead of /e/, the letter È is used as /ɛ/ in IPA. === Kashubian === É is the 8th letter of the Kashubian alphabet and is used as /ɛ/ in IPA. === Portuguese === É is used to stress an /ɛ/ when the stressed syllable is not known that well (for example, péssimo, meaning \"very bad\" in English). É can also mean the word \"is\", as in ela é bonita (meaning \"she is pretty\" in English). Another letter in Portuguese, the letter Ê, uses /e/. Ê is the letter E with a circumflex. === Spanish === The letter é is pronounced the same as e (/e/). The accent marks the letter with a stressed syllable in words that do not usually have stress, such as éxtasis and bebé. === Scottish Gaelic === The letter É used to be used in the Scottish Gaelic language, but it has been replaced with the letter È, an E with a grave accent. === Welsh === The letter É is used to put stress on a short vowel. For example, personél (meaning \"personnel\" in English), sigarét (meaning \"cigarette\" in English), and ymbarél (meaning \"umbrella\" in English). === Vietnamese === The letter É indicates a rising tone in Vietnamese. It can also be combined with a circumflex to make the letter \"Ế\". == Character mappings == === Keys === * People who use Microsoft Windows can type a lowercase é with the alt code + or + using the numeric pad to type numbers. The uppercase É can be typed by pressing + or +. * With the US international and UK English keyboards, the letter É can be typed by pressing the two keys +. This can also be done with other letters with acute accents. * On Microsoft Word, the letter é can be typed by pressing + then , or + for the capital É. * On macOS, the letter é can be typed by pressing + and then or + for é or É. * With a compose key, users can hold and press or for é or É. * On a standard Android, Windows Mobile, or iOS keyboard, the user can hold the key until characters appear, slide to the é, then let go of the key. == References == Category:Latin letters with diacritics Category:Vowel letters",
 "title": "É"
}