{
 "id": "749297",
 "text": "Olga Konstantinovna Bogdanova (Russian: Ольга Константиновна Богда́нова; 29 June n.s., 1896 — March 1982) was a Soviet chemist, a specialist in organic catalysis. == Biography == In the 1920s Bogdanova worked in a laboratory at a synthetic rubber factory. From the early 1930s she worked at the N. D. Zelinsky Institute of Organic Chemistry of the Academy of Sciences of the Soviet Union (now: Russian Academy of Sciences). Bordanova was a student and, for many years, a colleague of Academicians N. D. Zelinsky and A. A. Balandin. === Main achievements === * In 1941—1942 A. A. Balandin, O. K. Bogdanova, and A. P. Shcheglova developed and implemented at a synthetic rubber factory a method for producing a gas-resistant (polysulfide or thio) rubber, which was widely used in the production of a “self-tightening” – or, more accurately, “self-sealing” when struck by bullets – coating for aircraft fuel tanks. * In 1946—1952, a new method was developed for obtaining 1,3 butadiene from petroleum feedstock on chromium oxide catalysts, which found industrial application at synthetic rubber factories in Sterlitamak and Sumgait (O. K. Bogdanova and A. P. Shcheglova) * In 1974—1981 O. K. Bogdanova and D. P. Belomestnykh developed a way to produce styrene (vinylbenzene) and its homologues through the oxidative decomposition of alkyl-benzene over a complex chromium oxide catalyst, which surpassed all known industrial catalysts used to decompose ethylbenzene. Bogdanova held a Ph.D. in Chemistry, and she was a senior research associate. She was buried in the Vagankovo Cemetery. == Awards and prizes == * Stalin Prize, 2nd degree (1950) – for the development and industrial application of a catalyst used in a new chemical process * Order of the Red Banner of Labour (1953, 1967) * Medals == References == * Вклад ученых Института органической химии им. Н.Д. Зелинского РАН в развитие органического катализа * Из истории катализа в производстве синтетического каучука (о работах О. К. Богдановой в связи со 110-летием со дня её рождения) [Текст] / М. А. Ряшенцева // Катализ в промышленности. — 2007. — N 3. — С. . 51-54. — Библиогр.: с. 54 (19 назв.); in English: The History of Catalysis in the Production of Synthetic Rubber (about the career of O. K. Bogdanova on the 110th anniversary of her birth) [Text] / M. A. Riashentseva // Industrial Catalysis, 2007 (№ 3), 51-54. Bibliography: p. 54 (19 items) * ВКЛАД ИНСТИТУТА ОРГАНИЧЕСКОЙ ХИМИИ АН СССР В ДОСТИЖЕНИЕ ПОБЕДЫ В ВЕЛИКОЙ ОТЕЧЕСТВЕННОЙ ВОЙНЕ 1941—1945 гг. Category:Soviet scientists Category:1982 deaths Category:1896 births",
 "title": "Olga Bogdanova"
}