{
 "id": "749248",
 "text": "International Symposium on Scientific Computing, Computer Arithmetic, and Validated Numerics (abbreviated as SCAN) is an international conference about numerical analysis (such as numerical integration, numerical linear algebra, numerical methods for partial differential equations, interval arithmetic and validated numerics etc.).Scientific Computing, Computer Arithmetic, and Validated Numerics 16th International Symposium, SCAN 2014, W체rzburg, Germany, September 21-26, 2014. Revised Selected Papers. Editors: Marco Nehmeier, J체rgen Wolff von Gudenberg, :en:Warwick Tucker. Published by Springer.13th GAMM-IMACS International Symposium on Scientific Computing, Computer Arithmetic and Verified Numerical Computations (SCAN'2008), Proceedings of a meeting held 29 September - 3 October 2008, El Paso, Texas, USA. Special volume devoted to materials presented at SCAN 2012. Published by the Institute of Computational Technologies12th GAMM-IMACS International Symposium on Scientific Computing, Computer Arithmetic and Validated Numerics (SCAN 2006), Proceedings of a meeting held 26-29 September 2006, Duisburg, Germany. Published by the Institute of Electrical and Electronics Engineers (IEEE) It is held once in 2 years. ==Prizes== At each SCAN, the R. E. Moore Prize will be given. This is a prize for researchers in the field of validated numerics, and the name of the prize came from Ramon E. Moore, one of the greatest expert of interval arithmetic (an important technology for validated numerics).Moore, R. E., Kearfott, R. B., & Cloud, M. J. (2009). Introduction to interval analysis. Society for Industrial and Applied Mathematics.Moore, R. E. (1979). Methods and applications of interval analysis. Society for Industrial and Applied Mathematics.Moore, R. E. (1966). Interval analysis. Englewood Cliffs, NJ: Prentice-Hall. ==References== ==Other websites== * SCAN2018@TOKYO : SEP. 10-15, 2018 - Held at Waseda University (Tokyo) * SCAN 2016 UPPSALA UNIVERSITY SEPTEMBER 26-29, 2016 - Held at Uppsala University (Sweden) * SCAN2014 - Universit채t W체rzburg - Held in Germany * SCAN'2012 - Held in Russia Category:Mathematics Category:Technology Category:Numerical analysis",
 "title": "International Symposium on Scientific Computing, Computer Arithmetic, and\nValidated Numerics"
}