{
 "id": "749548",
 "text": "\"SpongeBob SquarePants vs. The Big One\" is the eleventh episode of the sixth season of SpongeBob SquarePants. It was first shown on television on April 17, 2009. 5.8 million people watched the episode on television when it was first shown. In the episode, SpongeBob, Patrick, Squidward, Mr. Krabs, and Sandy are pulled away by a giant wave. SpongeBob, Patrick, and Squidward get stuck on an island. They look for a surf guru named Jack Kahuna Laguna who can teach them how to get past a wave that is hard to find, called The Big One, so that they can get back to Bikini Bottom. On March 3, 2009, both a DVD and a video game based on the episode were released. == Plot == Mr. Krabs sees people going to Goo Lagoon, a beach, so he goes there to sell Krabby Patties. SpongeBob, Squidward, and Mr. Krabs get on a surfboard and find Patrick and Sandy. Patrick tries to get on the surfboard, but he causes it to fall and it gets into a giant wave that separates everyone. SpongeBob, Patrick, and Squidward end up on an island with other surfers. Mr. Krabs is all alone in the middle of the ocean with his cash register, Cashy. Sandy gets put on a different island and builds a helicopter. The surfers tell SpongeBob, Patrick, and Squidward that the only way to get back to Bikini Bottom is to surf there, but they do not know how to. One of the surfers, named Twitch, tells them that the only person who can teach them is a surfer named Jack Kahuna Laguna. Once the three find Jack Kahuna Laguna, he comes out a hut with a long surfboard and says that they have to ride a big wave called The Big One to get back home. They practice surfing to get ready for The Big One. Before they start surfing on The Big One, Jack Kahuna Laguna says that it wants a sacrifice. SpongeBob, Patrick, and Squidward surf The Big One and find Mr. Krabs and Cashy. Mr. Krabs gets on the board but drops Cashy. Jack Kahuna Laguna goes and gets Cashy and acts as the sacrifice. Once the wave disappears, SpongeBob, Patrick, Squidward, and Mr. Krabs are near Goo Lagoon. Sandy's helicopter crashes into Goo Lagoon as well. The people in Goo Lagoon throw a party for them coming back. == Reception == Carey Bryson of About.com said that \"parents will also be pleased, as the episode contains no rude words or inappropriate jokes.\" Maddy Pumilia for Blogcrotics reviewed the episode and wrote \"Like most SpongeBob episodes, this episode was comic genius. I especially enjoyed Mr. Krabs' love affair with his cash register, Cashy. It's hilarious. Best part of the show, in my opinion.\" Ian Jane of DVD Talk said \"[the episode] is absolutely worth a watch thanks to the series high standard of quality, quirky animation, and multilayered humor.\" David Hinckly of the New York Daily News gave the episode 4 out of 5 stars and said \"It's all good when you never forget to have fun.\" == Products == SpongeBob vs. The Big One: Beach Party Cook-Off is a video game that is based on the episode. It was released on March 3, 2009 for the Nintendo DS and was published by THQ. Surf's Up, SpongeBob! is a book that is based on the episode. It was written by David Lewman in 2009 and was published by Simon Spotlight and Nickelodeon. == References == == Other websites == * * Category:SpongeBob SquarePants episodes Category:2009 television episodes",
 "title": "SpongeBob SquarePants vs. The Big One"
}