{
 "id": "749609",
 "text": "{{Infobox settlement |name = Lakewood, Colorado |settlement_type = Home rule municipality |motto = |image_skyline = Green Mountain (Lakewood, Colorado).jpg |imagesize = |image_caption = Green Mountain as seen from Mt. Zion |image_flag = Flag of Lakewood, Colorado.svg |image_seal = |seal_size = |image_shield = |shield_size = |image_blank_emblem = |blank_emblem_type = |blank_emblem_size = |image_map = Jefferson County Colorado Incorporated and Unincorporated areas Lakewood Highlighted.svg |mapsize = |map_caption = Location of the City of Lakewood in |image_map1 = |mapsize1 = |map_caption1 = |image_dot_map = |pushpin_map = USA |pushpin_label = Lakewood |pushpin_label_position = right |pushpin_map_caption = Location of the City of Lakewood in the |subdivision_type = Country |subdivision_name = United States |subdivision_type1 = State |subdivision_name1 = Colorado |subdivision_type2 = County |subdivision_name2 = Jefferson County |subdivision_type3 = City |subdivision_name3 = Lakewood |government_footnotes = |government_type = Home rule municipality |leader_title = |leader_name = |leader_title1 = |leader_name1 = |leader_title2 = |leader_name2 = |leader_title3 = |leader_name3 = |leader_title4 = |leader_name4 = |established_title = Founded |established_date = 1889 |established_title2 = Incorporated |established_date2 = 1969 |established_title3 = |established_date3 = |unit_pref = US |total_type = Total |area_footnotes = |area_total_km2 = 115.635 |area_land_km2 = 112.595 |area_water_km2 = 3.040 |population_as_of = 2020 |population_footnotes = |population_total = 155,984 |population_rank = 5th in Colorado 167th in the United States |population_density_sq_mi = 3,588 |population_metro = 2,963,821 (19th) |population_blank1_title = CSA |population_blank1 = 3,623,560 (17th) |population_blank2_title = Front Range |population_blank2 = 5,055,344 |timezone1 = MST |utc_offset1 = −07:00 |timezone1_DST = MDT |utc_offset1_DST = −06:00 |coordinates = |elevation_footnotes = |elevation_m = |elevation_ft = 5518 |postal_code_type = ZIP codes |postal_code = Denver 80214-80215, 80227, 80226-80228, 80232, 80235-80236 Golden 80401 Littleton 80123 |area_code = Both 303 and 720 |blank_name = FIPS code |blank_info = 08-43000 |blank1_name = GNIS feature ID |blank1_info = 0181620 |website = }} Lakewood is a city in Colorado, the United States. It was founded in 1889. Its population ranks fifth of all the Colorado cities. It ranks 167th (in population) out of all the cities in the United States. In 2020, the population was 155,984. Lakewood is to the west of Denver, Colorado's capital. It is one of the key cities of the Denver–Aurora–Lakewood, CO Metropolitan Statistical Area and a major city of the Front Range Urban Corridor. ==History== This urban and suburban community was started in 1889 by Charles Welch and W.A.H. Loveland; who platted a 13-block area along Colfax Avenue west of Denver in eastern Jefferson County. Loveland used to be the president of the Colorado Central Railroad and lived in Golden. After retiring, he moved to the new area known as Lakewood. Up until 1969, this area known as Lakewood didn't have a city government. Instead, they relied on water districts, fire districts, and the government of Jefferson County. This area known as Lakewood was more of a community and had been around for 80 years. Police protection was provided to them by the Jefferson County Sheriff and volunteers from fire districts. In 1969, the City of Lakewood was legally turned into Jefferson City. Not too long after, they held an election. They decided to change the city's name to Lakewood because the majority disliked \"Jefferson City,\" and believes it would be confused with existing communities in Colorado and Missouri. At this time, the population was already over 90,000. Lakewood never had a traditional downtown area. West Colfax Avenue served the metropolitan area as U.S. Route 40 and the main route that joined Denver with the Rocky Mountains. Colfax from Harlan west to Kipling and beyond had mostly commercial establishments. Originally, in Lakewood, there was only the Jewish Conspumtive Relief Society (JCRS) for tuberculosis patients, a small, frame Methodist Church, and telephone exchange. However, by the 1950s, grocery and drug stores, gas stations, restaurants and taverns, several motels, branch banks, a movie theater, a roller rink, a bowling alley, and used car lots could be found as well. Several shopping centers with multiple businesses also developed. In 2011, Lakewood was named an All-America City for the first time. ==Geography== Lakewood is located at at an elevation of . It is located in the middle of U.S. Route 6 and Colorado State Highway 121 in central Colorado,positioned immediately west of Denver and north-northwest of Colorado Springs. Lakewood lies in the Colorado Piedmont on the western edge of the Great Plains, just east of the Front Range of the southern Rocky Mountains. Green Mountain, a mesa tall, is located in the far west-central part of the city. Lakewood is located in the watershed of the South Platte River. Several small tributaries of the river flow east through it. From north to south, this includes Lakewood Gulch, Weir Gulch, Sanderson Gulch, and Bear Creek. Two tributaries of Lakewood Gulch, Dry Gulch and McIntyre Gulch, flow east through the northern part of the city. Turkey Creek, a tributary of Bear Creek, flows northeast through the far southwestern part of the city. In addition, Lena Gulch, a tributary of Clear Creek to the north, flows east then north through the extreme northwestern part of the city. Several small lakes and reservoirs are in Lakewood. The Soda Lakes lie in the far southwestern part of the city. East of them lies Bear Creek Lake, a reservoir fed by Bear Creek and Turkey Creek. Clustered near each other in central Lakewood are Main Reservoir, East Reservoir, Smith Reservoir, Kendrick Lake, and Cottonwood Lake. Northeast of them lies Kountze Lake. In the northwestern part of the city, Lena Gulch both feeds and drains Maple Grove Reservoir. In the far southern part of the city lies Bowles Reservoir No. 1 and, just outside the city limits to the reservoir's northeast, Marston Lake. According to the United States Census Bureau, the city has a total area of . Of which are land and (2.6%) are covered by water. As a suburb of Denver, Lakewood is part of both the greater Denver metropolitan area and the Front Range Urban Corridor. It borders other communities on all sides, including Wheat Ridge to the north, Edgewater to the northeast, Denver to the east and southeast, Dakota Ridge to the south, Morrison to the southwest, and Golden, West Pleasant View, East Pleasant View, and Applewood to the northwest. ==Climate== Lakewood experiences a semiarid climate (Köppen BSk) with winters tha fluctuate between mild to cold and snowy while summers are warm to hot, with great temperature differences (about 30°F) between day and night year round. Precipitation happens mostly in the spring and summer. ==Demographics== As of the 2020 census, 155,984 people lived in the city. These people belonged to 67,292 households. The population density was 3,588 people per square mile (1,385/km). Its 65,758 housing units averaged 1,533.5 per square mile (591.9/km). The racial makeup of the city was 72.1% White, 3.8% Asian, 1.9% Black, 1.6% Native American, 0.1% Pacific Islander, 7.7% from other races, and 12.7% from two or more races. Hispanics and Latinos of any race were 22.7% of the population. Out of the 67,292 households, 23.5% had children under the age of 18 living with them, 39.6% were married couples living together, 22.8% had a male householder with no wife present, and 28.9% had a female householder with no husband present. About 32.3% of all households were a single person living alone, and 12.0% had someone living alone who was 65 years of age or older. The average household size was 2.32 people. When looking at the population by age, it was 17.9% under the age of 18, 8.9% from 18 to 24, 31.5% from 25 to 44, 24.3% from 45 to 64, and 17.4% who were 65 years of age or older. The median age was 38.4 years. The population divided by gender was 49.5% male and 50.5% female. In 2021, the median income for a household in the city was $77,122, and for a family was $95,805. The city's per capita income was $46,404. About 5.7% of families and 9.5% of the population were below the poverty line, including 13.1% of those under age 18 and 11.3% of those age 65 or over. ==Economy== Lakewood makes money in a lot of different way, but gets the most money from the government. Companies based in Lakewood include Einstein Bros. Bagels, FirstBank, and The Integer Group. As of 2021, 62.3% of the population over the age of 16 had a job, and 3.9% were unemployed (not working but looking for a job). The different types of the employed civilian labor force was 52.5% in management, business, science, and arts; 17.3% in sales and office occupations; 15.5% in service occupations; 7.8% in production, transportation, and material moving; and 6.9% in natural resources, construction, and maintenance. The three industries employing the largest percentages of the working civilian labor force were educational services, health care, and social assistance (19.2%); professional, scientific, and management, and administrative and waste management services (18.1%); and arts, entertainment, and recreation, and accomodation and food services (10.2%). ==References== Category:Cities in Colorado",
 "title": "Lakewood, Colorado"
}