{
 "id": "749654",
 "text": "\"Screenless\" is the fifteenth episode of the thirty-first season of The Simpsons. It was first shown on television on the Fox network on March 8, 2020. In the episode, Marge wants the family to lower their screen time. However, she later finds out she needs to lower her screen time the most. The episode was dedicated to James Lipton who died on March 2, 2020, six days before the episode was shown on television. He guest starred in the episodes \"The Sweetest Apu\" and \"Homer the Father\". == Plot == The Simpsons family is watching a murder show on TV. Lisa sees Maggie trying to get their attention so she changes the channel to a show that teaches babies sign language. Maggie was trying to tell them that Hans Moleman is stuck under a tree that fell, but the family does not notice. In the morning, they keep watching the show and Hans is taken to an ambulance. The show is cancelled because the government stopped funding the show, so Marge tries teaching Maggie sign language herself. Marge tries to tell the family about Maggie's development, but the family is too busy on their devices. Marge decides to limit everyone's screen time to half an hour a week. Marge catches Homer, Bart, and Lisa having their screen time changed by a technician, so she puts away the devices completely. Homer is bored at work, so he starts playing word puzzles in a newspaper. Marge sees how strong devices are affecting Patty and Selma. Bart uses his imagination at school when he gets a toy rocket down from the school roof. Lisa gets the feeling of joy when she finds books from the library without using devices. Marge can not find the recipe she is looking for, so when the family comes back home, they find her in the closet with her phone and laptop. Marge admits that she is the one who is addicted to devices. She signs the family up for a month at the Screen Addiction Rehab Center, a place to treat screen addictions. The next day, they get in to the center and find out it is a pleasant place. The owner, Dr. Lund, shows them around the place and what you can do. The family starts to recover, but they can not hold back for long. They find the workers all using computers and sending spam mail after stealing the patients' accounts. The family can not leave because they signed a non- disclosure contract which does not let them leave the center. At night, the family uses sign language to communicate with each other and escape the center. The next day, Dr. Lund is arrested for scamming. == Reception == Dennis Perkins of The A.V. Club gave the episode a score of B- and says that \"there's not enough else to recommend 'Screenless,' as the Simpsons’ individual journeys through the hell of online withdrawal are short-changed and unsatisfying.\" Den of Geek gave the episode a 3.5 out of 5 stars and says that the episode \"is a sweet episode because it promises that families can be in the same room as each other and still be together.\" == References == == Other websites == * Category:The Simpsons (season 31) episodes Category:2020 television episodes",
 "title": "Screenless"
}