{
 "id": "749888",
 "text": "{{Infobox writer | name = Ha Seung-moo | image = Poet Ha Seung Moo.jpg | image_size = 250px | alt = | caption = | pseudonym = | birth_name = | birth_date = | birth_place = Sacheon, South Korea | death_date = | death_place = | resting_place = | occupation = Professor of historical theology, author, poet | language = Korean | nationality = Korean | ethnicity = | citizenship = | education = B.A., Ed.M., M.Div., Th.M., Ph.D.Cand. | alma_mater = Catholic University of Daegu | period = 1991-Present | genre = | subject = | movement = Poetry | notableworks = | spouse = | partner = | children = | relatives = | awards = The 34th Busan Metropolitan City Citizen Award(2018), 2018 National Theologian Award, others | signature = | signature_alt = | module = | website = | portaldisp = }} Ha Seung Moo (born October 13, 1963; also spelled Ha Seung moo) is a Korean poet, pastor, educator and historical theologian. == Early life == Ha was born on February 5, 1964 in Sacheon, South Korea. Ha is the grandson of Sir Ha Yeon, who is the twenty-first grandson of Joseon's most notable prime minister, Yeonguijeong.Jin-yang Hassi Daedongbo(Genealogy books of Ha family . Genealogy books of Ha family, vol 5, p.543(2000). Inje University Genealogy Library After his basic education, Ha began to read modern literature. He was motivated by a bookseller who visited the school and purchased a series of books on modern Korean literature. Thereafter, readings of Korean literature sparked his interest in writing and philosophy. In this process, Ha began to question humanity and thing-in-itself. During the high school years, Ha's spiritual journey continued. He pursued truth, the meaning of life and humanity in Buddhism, Hinduism and other major religions. In this spiritual journey, he read many western philosophical classics. Ha was influenced by the works of Sigmund Freud, Carl Gustav Jung, Immanuel Kant and Søren Kierkegaard. Ha experienced spiritual progression recognizing the importance and meaning of human existence, and the 'despair' of Kierkegaard and the 'reason' of Kant became a less serious issue to his life and study. At the end of 12th grade, Ha had a mystical religious experience that made him confess that God is the only answer to his quest for meaning. Ha then became a Christian.Poet.Ha Seung-Moo's Site .Hangyŏre Munhak. Publisher: The Han-Kyorerh Literature 1 May 1994. pp.282-290. His poetry became an artistic stimulus for artists in parts of England and America.Busan Christian Writers Association in Korea . == Career == Ha became a Presbyterian minister and a professor of historical theology at Korea Presbyterian Theological Seminary. He teaches Biblical Exposition. Ha established Korea Presbyterian Church and the Korea Presbyterian Seminary, serving as Pastoral General, Christian education, Missions etc., at his own expense. His theological thought is inherited from the original church, unlike the Roman Catholic or Reformed Church, or of the Protestant church, which offer traditional Christian interpretation. Ha presented the historical point of view of the Orthodox Church, describing how the confession of faith and the historical context coincide.Korea Presbyterian Theological Seminary. “Church History knowledge and Overcoming Existing Church History”(2012. KPTS Open Seminar Special Lecture Paper, Publisher: KPTS PRESS) Ha is a poet, and a reformist theologian. He debuted as a poet by the recommendation of fellow poet Park Jaesam and two others in Hankyoreh Literature Magazine in 1994. * 4th Secretary General, The World Association of Korean Writers(2024~) * Chief Ed officer, Korea Creative Writing Education Institute(2024~) * President of Korea Headquarters, International Union of Reformed Churches (2024~) * 4th President, Korea Presbyterian Theological Seminary (2024~) * President, Busan Social Information Forum (BSIF)(NPO, 2003~)Hana Good News * Catholic University of Daegu Graduate School, Department of History Lecturer (2021-2024.3) * President, Busan Christian Writers Association (BCWA)(2013~)Busan Cultural Foundation E-Archive in Korea * Research Committee Member of the World Association of Korean Writers(2008~ )^ \"WAKW Introduction\" World Association of Korean Writers * President & Moderator(1st, 2nd), General Assembly of the Orthodox Presbyterian Church of Korea(2014-2017) * Professor of Historical Theology, Korea Presbyterian Theological Seminary(2012~) * First President, Korea Presbyterian Theological Seminary (2012-2015)Yonhap News Agency * Council Member of National Unification Advisory Council (2003-2007)Gwangnamilbo(Daily Newspaper) * Expert Member(Unification Education) of Ministry of Unification (2004-2005) * CG & Chief Executive of Hyundai PR Research Center (2004-2006) * CG & Chief Executive of Korea IT Cultural Content Research Institute (2003-2004) * First Vice Chairman, Korea Universities PR Association (1997) * Chief Editor, Pusan International Forum (Quarterly Academic journal, 1994–1997) == Notable awards == * 2024 National Assembly of the Republic of Korea Chairman's Merit Medal(Social Contribution)VERITAS a(alpha). April 23, 2020The korea.April 23, 2020CRSNews. May 11, 2023K-channel. April 23, 2020Toktok News. April 23, 2020Mudeung Ilbo(Daily News).April 23, 2020The Chunnam Maeil(Daily News). April 23, 2020 * Edurank (World Universities Ranking Agency), 'Notable Kosin University Alumni in 2024' 1st placeEdurank,2024 * Edurank (World Universities Ranking Agency), 'Notable Busan University of Foreign Studies Alumni in 2024' 2nd placeEdurank,2024 * Edurank (World Universities Ranking Agency), 'Notable Catholic University of Daegu Alumni in 2024' 2nd placeEdurank,2024 * Edurank (World Universities Ranking Agency), 'Notable Gwangju University Alumni in 2024' 3rd placeEdurank,2024 * Pride Korea Awards 2020(10th)Gukje News, 25 Nov 2020 * Busan branch Citation of the Korea Military Merit Awardees Association(2020) * The 34th Busan Metropolitan City Citizen Award(2018) * 2018 National Theologian Award * Military Manpower Administration Citation(2017) * Ministry of Foreign Affairs Overseas Koreans Foundation Gold Award(2006) * National Forum Union & 21 century Bundang Forum Achievement Award(2006) * Busan University of Foreign Studies Graduate School of Education Achievement Award(1997) * The 3rd Hankyore New Literary Prize(1994) * Busan Korea's Christian Literary Society Best Work Award(1995) * Army Dulumi Church' Merit Appreciation Plaque(in 133rd ADA Battn, 1987) * Commander Award of the 1st ADA Bde(1986) * Commander Award of the 1st ADA Bde(1985) * BnCmd Award of the 1st ADA Bde 133rd ADA Battn.(1986) * BnCmd Award of the 1st ADA Bde 133rd ADA Battn.(1985) * Dongmyeong Technical High School Achievement Award (1984) == Works == *The Southern Poetry (Nambu-eui si: Busan siin sagwajip, 남부의 시: 부산 시인 사화집, 1999). Publisher: Busan Poets' Association (1999) *Guerrilla, Vol 3. Publisher: Yeni (1999) *Guerrilla, Vol 4. Publisher: Yeni (1999) *Australia Korean Literature (Hoju-Hanin Munhak, 호주한인문학). Publisher: The Association of Korean Writers in Australia (2002) *Australia Korean Literature (Hoju-Hanin Munhak, 호주한인문학). Publisher: The Association of Korean Writers in Australia (2003) *Flowers on the Blue Stem (Ggodi pinda pureun julgie, 꽃이 핀다 푸른 줄기에,2006). *Seihan Gobi (Seihan gobi, 세이한 고비, 2008). *Hornbeam Forest (Sosanamu sup, 소사나무 숲, 2011). ==Notes== * Who's Who in Korea (Hangugeul umjigineun inmuldeul, 한국을 움직이는 인물들, 2 vols). Publisher: Chungang Ilbosa(1995) * Ha Seung Moo, Received \"Proud Busan citizen prize\" The Busan Ilbo(The Busan Daily News) * International(Kookje) Poetry Poem ‘Shooting Star’/ Ha Seung Moo The Kookje Daily News * Poem and painting of our era Maeil Jong-gyo Shinmun(Daily religious newspaper). * Bridgenews One's family with a story * The Hankyoreh Newspaper Poet Ha Seung Moo, Received '2018 Korean Theological Education Award' * The Kookje Daily News List of writers of declaration of the state of affairs * Hankook Ilbo List of writers of declaration of the state of affairs * Special Column \"Political participation of today's Korean Christian, it will not help the state,\" Korea Journal. Maeil Jong-gyo Shinmun(Daily religious newspaper). ==References== ==Other websites== * 한국사 대한민국 * Poet Ha Seung Moo * Doosan Encyclopedia(in Korean 하승무) * Daum Person Encyclopedia(in Korean 하승무) * Naver Person Search(in Korean 하승무) * Yonhapnews Person Search(in Korean 하승무) * JoongAng Ilbo Person Search(in Korean 하승무) * Chosun Ilbo Person Search(in Korean 하승무) Category:1964 births Category:Living people",
 "title": "Ha Seung Moo"
}