{
 "id": "749922",
 "text": "Busan Social Information Forum (abbreviation: BSIF, Korean: 부산사회정보포럼) was founded on March 1, 2003, at Busan Forum, led by Chairman Seung-Moo Ha. Following the Busan Forum, it is the second non-profit forum organization founded in the Busan area. == Overview == On April 11, 2004, we participated in a member organization of the Korea Forum Union,Electronic Times, \"Prime Minister Cheng Yun-san to give a lecture at the National Forum Union Lecture\" an association of 33 regional forums scattered throughout the country. Until 2016 National Forum Association is disbanded, it participated in the national forum of activities, thereafter, in the center of Busan, online network between experts and non-experts who are active in a variety of fields around the country to build, has been working.Oh My News, \"Alliance of National Forums, Disturbing Equilibrium and Decentralization\"Purpose of Establishing Busan Social Information Forum Through people-to-people exchanges, it provides a mutual exchange and various regional information between the hierarchy. == Activity == * Holding seminars and symposiums * Business for mutual fellowship and exchange between members * Derivation of policy alternatives and business to spread them * Opinion presentation on important national issues * Businesses that contribute to the development of other regions and nations * Provision of employment information == History == * Busan Social Information Forum completes re-registration of non-profit social groups on March 6, 2020 * On February 24, 2020, the Korean Social Policy Forum changed the name of the organization to “Busan Social Information Forum”. • Revised the rules and applied for re-registration of social organizations. * On September 14, 2017, Prevention of Ha Seung Moo Chairman of the Blue House (selected as the Korea Veteran Family) * On June 10, 2015, Korea PR Specialist Forum(KPRF) changed its name to Korea Social Policy Forum * On June 21, 2007, the organization name was changed to “Korea PR Specialist Forum(KPRF)” at the Busan Youth Forum * On April 01, 2006, he received a Merit Award from President Ha Seung Moo(Korea Forum Union and the 21st Century Bundang Forum) Lee Young-Hae Standing Representative. * On April 11, 2003, participated in the founder and member organization of the Korea Forum Union(elected Vice President of Ha Seung Moo Korea Forum Union and Chair of the First Public Relations Committee) * Busan Youth Forum established on March 01, 2003 ==References== ==Other websites== *BSIF Official site Category:Non-profit organizations of Asia Category:2003 establishments in South Korea Category:Organizations based in South Korea",
 "title": "Busan Social Information Forum"
}