{
 "id": "750052",
 "text": "Siegfried Fred Singer (September 27, 1924 – April 6, 2020) was an Austrian- born American physicist and climate change denier. He was an emeritus professor of environmental science at the University of Virginia.\"Retired faculty\" , University of Virginia, accessed December 28, 2010. Singer trained as an atmospheric physicist and was known for his criticism of scientific evidence between UV-B and melanoma ratesSinger, S. Fred. \"Ozone, Skin Cancer, and the SST\" , Science & Environmental Policy Project, July 1994, accessed May 18, 2010. * Singer, S. Fred. \"The hole truth about CFCs\" , Science & Environmental Policy Project, March 21, 1994, accessed May 18, 2010. Singer, S. Fred. \"Five Scientific Questions On The CFC-Ozone Issue\" , Science & Environmental Policy Project, October 16, 2009, accessed May 18, 2010. the health risks of smoking, and for supporting climate change denial.Leaked Email Reveals Who's Who List of Climate Denialists. Bagley, Katherine. Inside Climate News, March 12, 2015 He was the author or editor of many books including Global Effects of Environmental Pollution (1970), The Ocean in Human Affairs (1989), Global Climate Change (1989), The Greenhouse Debate Continued (1992), and Hot Talk, Cold Science (1997). He also co-authored Unstoppable Global Warming: Every 1,500 Years (2007) with Dennis Avery, and Climate Change Reconsidered (2009) with Craig Idso.Scheuering, Rachel White, \"S. Fred Singer,\" in Shapers of the Great Debate on Conservation: A Biographical Dictionary, Greenwood Press, 2004, p.115-127, Science & Environmental Policy Project, accessed May 13, 2010. * Zeller, Tom. \"And in This Corner, Climate Contrarians\", The New York Times, December 9, 2009; the NYT article calls him an \"atmospheric physicist\". Singer died on April 6, 2020 at a nursing home in Rockville, Maryland at the age of 95. ==References== Category:1924 births Category:2020 deaths Category:Naturalized citizens of the United States Category:American physicists Category:American critics Category:American political writers Category:Writers from Vienna Category:Scientists from Vienna Category:Scientists from Maryland Category:University of Virginia faculty",
 "title": "Fred Singer"
}