{
 "id": "750053",
 "text": "The Klagenfurt-Land District (German: Bezirk Klagenfurt-Land, Southern Austro- Bavarian: Beziak Klognfuat-Laund) is a district in the state of Carinthia in Austria. The capital is Klagenfurt. == Municipalities == Towns (Städte) are indicated in boldface; market towns (Marktgemeinden) in italics; suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. The point represents the administrative seat, Klagenfurt, but this statutory city doesn't belong to the district. *Ebenthal in Kärnten (Slov.: Žrelec) (2) **Aich an der Straße, Berg, Ebenthal, Goritschach, Gradnitz, Gurnitz, Haber, Hinterberg, Kohldorf, Kosasmojach, Kossiach, Kreuth, Lipizach, Mieger, Moosberg, Niederdorf, Obermieger, Obitschach, Pfaffendorf, Priedl, Radsberg, Rain, Reichersdorf, Rosenegg, Rottenstein, Saager, Sabuatach, Schwarz, Tutzach, Untermieger, Werouzach, Zell, Zetterei, Zwanzgerberg *Feistritz im Rosental (Slov.: Bistrica v Rožu) (3) **Bärental, Feistritz im Rosental, Hundsdorf, Matschach, Rabenberg, St. Johann im Rosental, Suetschach, Weizelsdorf, Ladinach, Polana, Sala *Ferlach (Slov.: Borovlje) (1) **Babniak, Bodental, Dörfl, Dornach, Ferlach, Glainach, Görtschach, Jaklin, Kappel an der Drau, Kirschentheuer, Laak, Laiplach, Loibltal, Otrouza, Rauth, Reßnig, Seidolach, Singerberg, Strau, Strugarjach, Tratten, Unterbergen, Unterferlach, Unterglainach, Unterloibl, Waidisch, Windisch Bleiberg *Grafenstein (Slov.: Grabštajn) (4) **Aich, Althofen, Dolina, Froschendorf, Grafenstein, Gumisch, Haidach, Hum, Klein Venedig, Lind, Münzendorf, Oberfischern, Oberwuchel, Pakein, Pirk, Replach, Saager, Sabuatach, Sand, Schloss Rain, Schulterndorf, Skarbin, St. Peter, Tainacherfeld, Thon, Truttendorf, Unterfischern, Unterwuchel, Werda, Wölfnitz, Zapfendorf *Keutschach am See (Slov.: Hodiše) (7) **Dobein, Dobeinitz, Höflein, Höhe, Keutschach, Leisbach, Linden, Pertitschach, Plaschischen, Plescherken, Rauth, Reauz, Schelesnitz, St. Margarethen, St. Nikolai *Köttmannsdorf (Slov.: Kotmara vas) (8) **Aich, Am Teller, Gaisach, Göriach, Hollenburg, Köttmannsdorf, Lambichl, Mostitz, Neusaß, Plöschenberg, Preliebl, Rotschitzen, Schwanein, St. Gandolf, St. Margarethen, Thal, Trabesing, Tretram, Tschachoritsch, Tschrestal, Unterschloßberg, Wegscheide, Wurdach *Krumpendorf am Wörthersee (Slov.: Kriva Vrba) (9) **Görtschach, Krumpendorf, Nußberg, Pritschitz, Tultschnig *Ludmannsdorf (Slov.: Bilčovs) (10) **Bach, Edling, Fellersdorf, Franzendorf, Großkleinberg, Ludmannsdorf, Lukowitz, Moschenitzen, Muschkau, Niederdörfl, Oberdörfl, Pugrad, Rupertiberg, Selkach, Strein, Wellersdorf, Zedras *Magdalensberg (Slov.: Štalenska Gora) (11) **Christofberg, Deinsdorf, Dürnfeld, Eibelhof, Eixendorf, Farchern, Freudenberg, Gammersdorf, Geiersdorf, Göriach, Gottesbichl, Großgörtschach, Gundersdorf, Haag, Hollern, Kleingörtschach, Kreuzbichl, Kronabeth, Lassendorf, Latschach, Leibnitz, Magdalensberg, Matzendorf, Ottmanach, Pirk, Pischeldorf, Portendorf, Reigersdorf, Schöpfendorf, Sillebrücke, St. Lorenzen, St. Martin, St. Thomas, Stuttern, Timenitz, Treffelsdorf, Vellach, Wutschein, Zeiselberg, Zinsdorf *Maria Rain (Slov.: Žihpolje) (12) **Angern, Angersbichl, Ehrensdorf, Göltschach, Haimach, Maria Rain, Nadram, Oberguntschach, Obertöllern, Saberda, St. Ulrich, Stemeritsch, Strantschitschach, Toppelsdorf, Tschedram, Unterguntschach,Untertöllern *Maria Saal (Slov.: Gospa Sveta) (5) **Arndorf, Bergl, Dellach, Gröblach, Hart, Höfern, Judendorf, Kading, Karnburg, Kuchling, Lind, Maria Saal, Meilsberg, Meiselberg, Möderndorf, Poppichl, Poppichl, Pörtschach am Berg, Possau, Prikalitz, Ratzendorf, Rosendorf, Rotheis, Sagrad, St. Michael am Zollfeld, Stegendorf, Stuttern, Techmannsdorf, Thurn, Töltschach, Treffelsdorf, Walddorf, Willersdorf, Winklern, Wrießnitz, Wutschein, Zell, Zollfeld *Maria Wörth (Slov.: Otok) (13) **Maiernigg, Maria Wörth, Oberdellach, Raunach, Reifnitz, Sekirn, St. Anna, Unterdellach *Moosburg (Slov.: Možberk) (6) **Ameisbichl, Arlsdorf, Bärndorf, Dellach, Faning, Freudenberg, Gabriel, Goritschitzen, Gradenegg, Hohenfeld, Knasweg, Knasweg, Krainig, Kreggab, Malleberg, Moosburg, Nußberg, Obergöriach, Polan, Prosintschach, Ratzenegg, Rosenau, Seigbichl, Simislau, St. Peter, Stallhofen, Tigring, Tuderschitz, Untergöriach, Unterlinden, Vögelitz, Wielen, Windischbach, Windischbach-Gegend, Witsch, Witsch, Ziegelsdorf *Poggersdorf (Slov.: Pokrče) (14) **Ameisbichl, Annamischl, Eibelhof, Eiersdorf, Erlach, Goritschach, Haidach, Kreuth, Kreuzergegend, Krobathen, Lanzendorf, Leibsdorf, Linsenberg, Pischeldorf, Poggersdorf, Pubersdorf, Rain, Raunachmoos, St. Johann, St. Michael ob der Gurk, Ströglach, Wabelsdorf, Wirtschach *Pörtschach am Wörthersee (Slov.: Poreče ob Vrbskem jezeru) (15) *Sankt Margareten im Rosental (Slov.: Šmarjeta v Rožu) (16) **Dobrowa, Dullach, Gotschuchen, Gupf, Hintergupf, Homölisch, Niederdörfl, Oberdörfl, Sabosach, Seel, St. Margareten im Rosental, Trieblach *Schiefling am See (Slov.: Škofiče) (17) **Aich, Albersdorf, Auen, Farrendorf, Goritschach, Ottosch, Penken, Raunach, Roach, Roda, Schiefling, St. Kathrein, Techelweg, Zauchen *Techelsberg (Slov.: Teholica) (18) **Arndorf, Ebenfeld, Greilitz, Hadanig, Karl, Pavor, Pernach, Saag, Schwarzendorf, Sekull, St. Bartlmä, St. Martin am Techelsberg, Tibitsch, Töpriach, Töschling, Trabenig, Trieblach *Zell (Slov.: Sele) (19) **Zell- Freibach, Zell-Homölisch, Zell-Koschuta, Zell-Mitterwinkel, Zell-Oberwinkel, Zell-Pfarre, Zell-Schaida Category:Districts of Carinthia (state)",
 "title": "Klagenfurt-Land District"
}