{
 "id": "750051",
 "text": "The Hermagor District is a district in the state of Carinthia in Austria. The capital is Hermagor-Pressegger See. == Municipalities == Towns (Städte) are indicated in boldface; market towns (Marktgemeinden) in italics; suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. *Dellach (Slov.: Dole) (4) **Dellach, Goldberg, Gurina, Höfling, Leifling, Monsell, Nölbling, Rüben, Siegelberg, St. Daniel, Stollwitz, Wieserberg *Gitschtal (Slov.: Višprijska Dolina) (5) **Brunn, Golz, Jadersdorf, Langwiesen, Lassendorf, Leditz, Regitt, St. Lorenzen im Gitschtal, Weißbriach, Wulzentratten *Hermagor-Pressegger See (Slov.: Šmohor - Preseško jezero) (1) **Achleiten, Aigen, Bergl, Braunitzen, Brugg, Burgstall, Danz, Dellach, Egg, Eggforst, Förolach, Fritzendorf, Görtschach, Götzing, Grafenau, Grünburg, Guggenberg, Hermagor, Jenig, Kameritsch, Khünburg, Kleinbergl, Kraschach, Kraß, Kreuth ob Mellweg, Kreuth ob Möschach, Kreuth ob Rattendorf, Kühweg, Kühwegboden, Latschach, Liesch, Mellach, Mellweg, Micheldorf, Mitschig, Möderndorf, Nampolach, Neudorf, Neuprießenegg, Obermöschach, Obervellach, Paßriach, Podlanig, Postran, Potschach, Potschach, Presseggen, Presseggersee, Radnig, Radnigforst, Rattendorf, Schinzengraben, Schlanitzen, Schmidt, Siebenbrünn, Sonnenalpe Naßfeld, Sonnleitn, Süßenberg, Toschehof, Tröpolach, Untermöschach, Untervellach, Watschig, Wittenig, Zuchen *Kirchbach (Slov.: Cirkno) (2) **Anraun, Bodenmühl, Forst, Goderschach, Grafendorf, Griminitzen, Gundersheim, Hochwart, Katlingberg, Kirchbach, Krieben, Lenzhof, Oberbuchach, Oberdöbernitzen, Rauth, Reisach, Reißkofelbad, Rinsenegg, Schimanberg, Schmalzgrube, Schönboden, Staudachberg, Stöfflerberg, Stranig, Tramun, Treßdorf, Unterbuchach, Unterdöbernitzen, Waidegg, Wassertheurerberg, Welzberg *Kötschach-Mauthen (Slov.: Koče - Muta) (3) **Aigen, Buchach, Dobra, Dolling, Gailberg, Gentschach, Gratzhof, Höfling, Kosta, Kötschach, Kreuth, Kreuzberg, Krieghof, Kronhof, Laas, Lanz, Mahlbach, Mandorf, Mauthen, Nischlwitz, Passau, Plöcken, Plon, Podlanig, Sittmoos, St. Jakob im Lesachtal, Strajach, Weidenburg, Wetzmann, Würda, Würmlach *Lesachtal (Slov.: Lesna dolina) (6) **Assing, Birnbaum, Durnthal, Egg, Frohn, Guggenberg, Klebas, Kornat, Ladstatt, Liesing, Maria Luggau, Mattling, Moos, Niedergail, Nostra, Obergail, Oberring, Pallas, Promeggen, Raut, Rüben, Salach, St. Lorenzen im Lesachtal, Stabenthein, Sterzen, Tiefenbach, Tscheltsch, Tuffbad, Wiesen, Wodmaier, Xaveriberg *Sankt Stefan im Gailtal (Slov.: Štefan na Zilji) (7) **Bach, Bichlhof, Bodenhof, Dragantschach, Edling, Hadersdorf, Karnitzen, Köstendorf, Latschach, Matschiedl, Nieselach, Pölland, Pörtschach, Schinzengraben, Schmölzing, St. Paul an der Gail, St. Stefan an der Gail, Sussawitsch, Tratten, Vorderberg Category:Districts of Carinthia (state)",
 "title": "Hermagor District"
}