{
 "id": "750045",
 "text": "Kayleigh McEnany (born April 18, 1988) is an American spokesperson, political commentator, and writer. McEnany was the 33rd White House Press Secretary from 2020 to 2021. She was a former CNN contributor. She was made national spokesperson for the Republican National Committee in 2017. ==White House Press Secretary== In February 2019, she was named national press secretary for Donald Trump's 2020 presidential campaign. On April 7, 2020, she was appointed White House Press Secretary. On October 5, 2020, McEnany tested positive for COVID-19 during the White House COVID-19 outbreak. While ballots were still being counted on 2020 election day, McEnany made an early false statement saying that Trump won the election. After Joe Biden won the election and President Donald Trump refused to say he lost, McEnany spread false claims of fraud in the 2020 election. On November 20, 2020, McEnany falsely claimed Trump was not given an \"orderly transition of power\". McEnany's comment was stated while Trump himself was refusing to recognize his opponent Joe Biden's victory as legitimate; Trump was also actively delaying the start of a transfer of power to president-elect Biden for two weeks. After Biden was inaugurated, she began working for Fox News. ==Personal life== McEnany was born on April 18, 1988, in Tampa, Florida and was raised in Tampa. She majored in international politics at Georgetown University's School of Foreign Service in Washington, D.C. and she studied abroad at St Edmund Hall, Oxford. After graduating from Georgetown, McEnany spent three years as a producer on the Mike Huckabee Show. She later studied at University of Miami School of Law, before transferring to Harvard Law School. She completed her second and third years of law school at Harvard, and graduated from Harvard in 2016. McEnany married Sean Gilmartin, a pitcher in Major League Baseball, in November 2017. The couple have one daughter. McEnany had a double mastectomy in 2018 after finding a gene making her at risk for breast cancer. ==Written works== * * ==References== ==Other websites== * Twitter * Category:1988 births Category:Living people Category:White House Press Secretaries Category:American political commentators Category:CNN people Category:American political writers Category:Writers from Tampa, Florida Category:Politicians from Florida Category:Republican Party (United States) politicians Category:Fox News people",
 "title": "Kayleigh McEnany"
}