{
 "id": "750086",
 "text": "{{Infobox settlement | name = | native_name = St. Veit an der Glan District | native_name_lang = de | settlement_type = District | image_skyline = | image_alt = | image_caption = | image_flag = | flag_alt = | image_seal = | seal_alt = | image_shield = | shield_alt = | image_map = | map_alt = | map_caption = | pushpin_map = | pushpin_label_position = | pushpin_map_alt = | pushpin_map_caption = | coordinates = | coordinates_footnotes = | subdivision_type = Country | subdivision_name = Austria | subdivision_type1 = State | subdivision_name1 = Carinthia | subdivision_type2 = Number of municipalities | subdivision_name2 = | subdivision_type3 = | subdivision_name3 = | established_title = | established_date = | founder = | seat_type = | seat = | government_footnotes = | leader_party = | leader_title = | leader_name = | unit_pref = Metric | area_footnotes = | area_total_km2 = 1,493.67 | area_land_km2 = | area_water_km2 = | area_water_percent = | area_note = | elevation_footnotes = | elevation_m = | population_footnotes = | population_total = 58,742 | population_as_of = 15 May 2001 | population_density_km2 = auto | population_demonym = | population_note = | timezone1 = CET | utc_offset1 = +01:00 | timezone1_DST = CEST | utc_offset1_DST = +02:00 | iso_code = | website = | footnotes = | blank_name_sec1 = | blank_info_sec1 = }} The District of St. Veit an der Glan is an administrative district in Carinthia, Austria. The administrative center is also named St. Veit an der Glan. ==Communities== The district is divided into 20 municipalities, of which 4 are towns and 9 are market towns. ===Towns=== *Althofen (Slov.: Stari Dvor)(4,732) **Aich, Althofen, Eberdorf, Epritz, Krumfelden, Muraniberg, Rabenstein, Rain, Töscheldorf, Treibach *Friesach (Slov.: Breže)(5,462) **Dobritsch, Dobritsch, Dörfl, Engelsdorf, Friesach, Gaisberg, Grafendorf, Guldendorf, Gundersdorf, Gunzenberg, Gwerz, Harold, Hartmannsdorf, Hundsdorf, Ingolsthal, Judendorf, Kräuping, Leimersberg, Mayerhofen, Moserwinkl, Oberdorf I, Oberdorf II, Olsa, Pabenberg, Reisenberg, Roßbach, Sattelbogen, Schratzbach, Schwall, Silbermann, St. Johann, St. Salvator, St. Stefan, Staudachhof, Stegsdorf, Timrian, Wagendorf, Wels, Wiegen, Wiesen, Zeltschach, Zeltschachberg, Zienitzen, Zmuck *St. Veit an der Glan (Slov.: Šentvid ob Glini)(12,839) **Affelsdorf, Aich, Altglandorf, Arndorf, Baardorf, Baiersdorf, Beintratten, Blintendorf, Dellach, Draschelbach, Eberdorf, Galling, Gersdorf, Glandorf, Holz, Hörzendorf, Karlsberg, Karnberg, Laasdorf, Lebmach, Mairist, Milbersdorf, Muraunberg, Niederdorf, Pflugern, Pörtschach am Berg, Preilitz, Projern, Radweg, Raggasaal, Ritzendorf, St. Andrä, St. Donat, St. Veit an der Glan, Streimberg, Tanzenberg, Ulrichsberg, Unterbergen, Untermühlbach, Unterwuhr, Wainz *Straßburg (Slov.: Štrasberk)(2,335) **Bachl, Buldorf, Dielach, Dobersberg, Dörfl, Drahtzug, Edling, Gassarest, Glabötsch, Gruschitz, Gundersdorf, Hackl, Hausdorf, Herd, Hohenfeld, Höllein, Kraßnitz, Kreuth, Kreuzen, Kulmitzen, Langwiesen, Lees, Lieding, Machuli, Mannsdorf, Mellach, Mitterdorf, Moschitz, Olschnitz, Olschnitz-Lind, Olschnögg, Pabenberg, Pöckstein-Zwischenwässern, Pölling, Ratschach, Schattseite, Schmaritzen, Schneßnitz, St. Georgen, St. Jakob, St. Johann, St. Magdalen, St. Peter, Straßburg-Stadt, Unteraich, Unterfarcha, Unterrain, Wildbach, Wilpling, Winklern ===Market Towns=== *Brückl (Slov.: Mostič)(3,110) **Brückl, Christofberg, Eppersdorf, Hart, Hausdorf, Johannserberg, Krainberg, Krobathen, Labegg, Michaelerberg, Oberkrähwald, Ochsendorf, Pirkach, Salchendorf, Schmieddorf, Selesen, St. Filippen, St. Filippen, St. Gregorn, St. Ulrich am Johannserberg, Tschutta *Eberstein (Slov.: Svinec)(1,505) **Baumgarten, Eberstein, Gutschen, Hochfeistritz, Kaltenberg, Kulm, Mirnig, Rüggen, St. Oswald, St. Walburgen *Gurk (Slov.: Krka)(1,311) **Dörfl, Finsterdorf, Föbing, Gassarest, Glanz, Gruska, Gurk, Gwadnitz, Hundsdorf, Kreuzberg,Krön, Masternitzen, Niederdorf, Pisweg, Ranitz, Reichenhaus, Straßa, Sutsch, Zabersdorf, Zedl, Zedroß, Zeltschach *Guttaring (Slov.: Kotarče)(1,565) **Baierberg, Dachberg, Deinsberg, Dobritsch, Gobertal, Guttaring, Guttaringberg, Höffern, Höffern, Hollersberg, Maria Hilf, Oberstranach, Rabachboden, Ratteingraben, Schalkendorf, Schelmberg, Schrottenbach, Sonnberg, St. Gertruden, Übersberg, Urtl, Urtlgraben, Verlosnitz, Waitschach, Weindorf *Hüttenberg (Slov.: Železni Hrib)(1,804) **Andreaskreuz, Gobertal, Gossen, Heft, Hinterberg, Hüttenberg, Hüttenberg Land, Jouschitzen, Knappenberg, Lichtegg, Lölling Graben, Lölling Schattseite, Lölling Sonnseite, Obersemlach, Semlach, St. Johann am Pressen, St. Martin am Silberberg, Stranach, Unterwald, Waitschach, Zosen *Klein St. Paul (Slov.: Mali Št. Pavel)(2,195) **Buch, Drattrum, Dullberg, Filfing, Grünburg, Katschniggraben, Kirchberg, Kitschdorf, Klein St. Paul, Maria Hilf, Mösel, Müllergraben, Oberwietingberg, Prailing, Prailing, Raffelsdorf, Sittenberg, Unterwietingberg, Wietersdorf, Wietersdorf, Wieting *Liebenfels (Slov.: Lepo Polje)(3,273) **Bärndorf, Beißendorf, Eggen I, Eggen II, Freundsam, Gasmai, Glantschach, Gößeberg, Graben, Gradenegg, Grassendorf, Grund, Hardegg, Hart, Hoch-Liebenfels, Hohenstein, Kraindorf, Kulm, Ladein, Lebmach, Liebenfels, Liemberg, Lorberhof, Mailsberg, Metschach, Miedling, Moos, Pflausach, Pflugern, Pulst, Puppitsch, Radelsdorf, Rasting, Reidenau, Rohnsdorf, Rosenbichl, Sörg, Sörgerberg, St. Leonhard, Tschadam, Waggendorf, Wasai, Weitensfeld, Woitsch, Zmuln, Zojach, Zwattendorf, Zweikirchen *Metnitz (Slov.: Metnica)(2,450) **Auen, Feistritz, Felfernigthal, Grades, Klachl, Laßnitz, Maria Höfl, Marienheim, Metnitz, Mödring, Oberalpe, Oberhof Schattseite, Oberhof Sonnseite, Preining, Schnatten, Schwarzenbach, Teichl, Unteralpe, Vellach, Wöbring, Zanitzberg, Zwatzhof *Weitensfeld im Gurktal (Slov.: Prečpolje ob Krki)(2,474) **Ading, Aich, Altenmarkt, Bach (Zweinitz), Braunsberg, Brunn (Zweinitz), Dalling, Dielach, Dolz, Edling, Engelsdorf, Grabenig, Grua, Hafendorf, Hardernitzen, Hundsdorf, Kaindorf, Kleinglödnitz, Kötschendorf, Kraßnitz, Lind, Massanig, Mödring, Mödritsch, Nassing, Niederwurz, Oberort, Planitz, Psein, Reinsberg, Sadin, St. Andrä, Steindorf, Traming, Tschriet, Weitensfeld, Wullroß, Wurz, Zammelsberg, Zauchwinkel, Zweinitz ===Municipalities=== *Deutsch-Griffen (Slov.: Slovenj Grebinj)(1,023) **Albern, Arlsdorf, Bach, Bischofsberg, Brunn, Deutsch Griffen, Faulwinkel, Gantschach, Göschelsberg, Graben, Gray, Hintereggen, Hochrindl, Leßnitz, Meisenberg, Messaneggen, Mitteregg, Oberlamm, Pesseneggen, Ratzendorf, Rauscheggen, Sand, Spitzwiesen, Tanzenberg, Unterlamm *Frauenstein (Slov.: Ženji Kamen)(3,528) *Glödnitz (Slov.: Glodnica)(1,004) **Altenmarkt, Bach, Brenitz, Eden, Flattnitz, Glödnitz, Grai, Hohenwurz, Jauernig, Kleinglödnitz, Laas, Lassenberg, Moos, Rain, Schattseite, Torf, Tschröschen, Weißberg, Zauchwinkel *Kappel am Krappfeld (Slov.: Kapela na Krapskem polju)(2,107) **Boden, Dobranberg, Dürnfeld, Edling, Freiendorf, Garzern, Gasselhof, Geiselsdorf, Gölsach, Grillberg, Gutschen, Haide, Haidkirchen, Kappel am Krappfeld, Krasta, Krasta, Landbrücken, Latschach, Lind, Mannsberg, Mauer, Möriach, Muschk, Oberbruckendorf, Passering, Pölling, Poppenhof, Rattenberg, Schöttlhof, Silberegg, St. Florian, St. Klementen, St. Martin am Krappfeld, St. Willibald, Unterbergen, Unterpassering, Unterstein, Windisch, Zeindorf *Micheldorf (Slov.: Mihaelova vas)(1,201) **Gasteige, Gaudritz, Gulitzen, Hirt, Lorenzenberg, Micheldorf, Ostrog, Ruhsdorf, Schödendorf, Schödendorf *Mölbling (Slov.: Molnek)(1,273) **Bergwerksgraben, Breitenstein, Brugga, Dielach, Drasenberg, Eixendorf, Gaming, Gerach, Gratschitz, Gunzenberg, Kogl, Mail, Meiselding, Mölbling, Pirka, Rabing, Rastenfeld, Ringberg, St. Kosmas, St. Stefan am Krappfeld, Stein, Stein, Stoberdorf, Straganz, Treffling, Tschatschg, Unterbergen, Unterdeka, Wattein, Welsbach *St. Georgen am Längsee (Slov.: Šentjurij ob Dolgem jezeru)(3,551) **Bernaich, Dellach, Drasendorf, Fiming, Fiming, Garzern, Goggerwenig, Goggerwenig, Gösseling, Hochosterwitz, Kreutern, Krottendorf, Labon, Launsdorf, Maigern, Mail-Süd, Niederosterwitz, Pirkfeld, Podeblach, Pölling, Rain, Reipersdorf, Rottenstein, Scheifling, Siebenaich, St. Georgen am Längsee, St. Martin, St. Peter, St. Sebastian, Stammerdorf, Taggenbrunn, Thalsdorf, Töplach, Tschirnig, Unterbruckendorf, Unterlatschach, Weindorf, Wiendorf, Wolschart (all populations are from the 2001 census) Category:Districts of Carinthia (state)",
 "title": "St. Veit an der Glan District"
}