{
 "id": "750040",
 "text": "Deborah Lynn Derryberry (born September 27, 1967) is a voice actress. She worked \"Squeeze Toy Aliens\" in Toy Story and Toy Story 2. She is known as the voice of Jimmy Neutron in The Adventures of Jimmy Neutron: Boy Genius. ==Career== Derryberry also voiced characters in the Pixar films Toy Story, A Bug's Life, Toy Story 2, and Incredibles 2. She is the voice of Clay in the Playhouse Disney segments Derryberry's only role in anime is the voice of Candy in the Glitter Force series. ==Filmography== ===Animation=== List of voice performances in animation Year Title Role Notes Source -1998 Bobby's World Jackie Resume -1995 Taz-Mania Jake The Addams Family Wednesday Addams Aaahh!!! Real Monsters Various characters Life with Louie Jeannie Harper What-A-Mess Daughter -1999 Jumanji Judy Resume Johnny Bravo Various characters Cow and Chicken Various characters Bad Baby Eubie / Kelly CatDog Various characters Oswald Weenie, Catrina, others Jay Jay the Jet Plane Jay Jay, Savvanah, Herky, Revvin Evan -2002 Grim and Evil Various characters Resume -2006 The Adventures of Jimmy Neutron, Boy Genius Jimmy Neutron, Amber, Nissa, others Fillmore! Various characters -2007 Playhouse Disney Clay (Host) Resume -2004 LeapFrog video series Tad (character) As Dee Dee Green Mona the Vampire Poussinet Ep. \"Garage Sale Genie\" / \"Ghouls and Dolls\" Castle in the Sky Sheeta (Young), Madge, Additional Voices Disney dub -2006 The Jimmy Timmy Power Hour Jimmy Neutron cross-over episodes Stroker and Hoop Jack's Girl, Miss Squash Casserole Danger Rangers Emily, Mark Curious George Various characters Resume -2013 Monster High Draculaura As Dee Dee Green TripTank Billy Ep. \"Ricky the Rocketship\" / \"Show for All Ages\" Madison & Samantha & Mellow & Lellow's Toy Store The Queen Be Cool, Scooby-Doo! Various characters -present F Is for Family Maureen Murphy Hanazuki: Full of Treasures Various characters Buddy Thunderstruck Muncie, others Tigtone Helpy ===Anime=== List of dubbing performances in anime Year Title Role Notes Source - present Glitter Force Candy Netflix series Facebook Glitter Force Doki Doki Maya Aida Netflix series Tweet ===Film=== ====Feature films==== List of voice performances in feature films Year Title Role Source 1992 Aladdin Harem Girl 1995 Babe Puppies 1995 Toy Story Aliens, Pizza Planet Announcer 1996 Laputa: The Castle in the Sky Additional voices 1996 The Hunchback of Notre Dame Mother 1997 Cats Don't Dance Additional voices 1997 Hercules Greece Woman 1998 A Bug's Life Baby Maggots 1999 Tarzan Various Monkeys 1999 Princess Mononoke Additional voices 1999 Toy Story 2 Aliens, Amy 2001 Jimmy Neutron: Boy Genius Jimmy Neutron Resume 2003 Brother Bear Female Bear #2 2004 Home on the Range Saloon Girls 2006 Ice Age: The Meltdown Diatryma Mom 2006 The Wild Monkey Girl 2007 Happily N'Ever After Additional voices 2008 Horton Hears a Who Who Mom 2012 The Lorax Additional voices 2012 Wreck- It Ralph Additional voices 2013 Despicable Me 2 Additional voices 2017 Smurfs: The Lost Village Additional voices 2018 The Son of Bigfoot Additional voices 2018 Incredibles 2 Additional voices 2018 The Christmas Chronicles Additional voices ====Direct-to-video and television films==== List of voice performances in direct-to-video and television films Year Title Role Notes Source 1996 Dot & Spot's Magical Adventure Dot 1996 Tenchi the Movie: Tenchi Muyo in Love Ryo-Ohki 1998 O' Christmas Tree Tree, Chipmunk 1999 The Nuttiest Nutcracker Marie, Fritz 2000 Whispers: An Elephant's Tale Whispers 2001 Recess: School's Out Additional voices 2001 Lady and the Tramp 2: Scamp's Adventure Annette 2001 Vampire Hunter D: Bloodlust Girl 2003 Charlotte's Web 2: Wilbur's Great Adventure Fern 2003 The Animatrix Child 2005 Mulan II Additional voices 2005 The Muppet Movie Various characters Disney video release Resume 2006 Casper's Scare School History Teacher, Banana Lady 2009 Curious George: A Very Monkey Christmas Gnocchi 2010 The Legend of Secret Pass Shelby 2012 Monster High: Ghouls Rule Draculaura As Dee Dee Green 2013 Monster High: 13 Wishes Draculaura As Sue Swan 2014 Monster High: Frights, Camera, Action! Draculaura As Sue Swan 2014 Alpha and Omega 3: The Great Wolf Games Runt As Dee Dee Greene 2014 Legends of Oz: Dorothy's Return Stenographer 2014 Monster High: Freaky Fusion Draculaura As Sue Swan 2014 Alpha and Omega 4: The Legend of the Saw-Toothed Cave (2014) Runt As Dee Dee Greene 2015 Alpha and Omega 5: Family Vacation Runt As Sue Swan 2015 Monster High: Haunted Draculaura As Sue Swan 2015 Monster High: Boo York, Boo York Draculaura As Sue Swan 2016 Norm of the North Little Girl 2016 Monster High: Great Scarrier Reef Draculaura 2016 Alpha and Omega 6: Dino Digs Runt As Hunter Swan 2016 Barbie: Dreamtopia Otto's Mom 2016 Welcome to Monster High Draculaura 2016 Trolland Jessica, Adrian, Kid #1 2016 Alpha and Omega 7: The Big Fureeze Runt As Hunter Swan 2017 Monster High: Electrified Draculaura 2017 Alpha and Omega 8: Journey to Bear Kingdom Runt As Hunter Swan ===Video games=== List of voice performances in video games Year Title Role Notes Source 1990 Ys I & II Feena English Language Version 2000 Orphen: Scion of Sorcery Dortin, Jado 2001 Crash Bandicoot: The Wrath of Cortex Coco Bandicoot 2001 Jimmy Neutron: Boy Genius Jimmy Neutron 2001 Final Fantasy X Fayth 2002 Nickelodeon Party Blast Jimmy Neutron 2003 Arc the Lad: Twilight of the Spirits Bebedora 2003 The Adventures of Jimmy Neutron Boy Genius: Jet Fusion Jimmy Neutron 2003 Crash Nitro Kart Coco Bandicoot, Polar 2004 Tales of Symphonia Noishe 2004 Crash Twinsanity Coco Bandicoot, Young Dr. Cortex 2004 The Adventures of Jimmy Neutron Boy Genius: Attack of the Twonkies Jimmy Neutron 2005 Killer7 Love Wilcox 2005 Crash Tag Team Racing Coco Bandicoot 2005 Nicktoons Unite! Jimmy Neutron 2006 Nicktoons Winners Cup Racing Jimmy Neutron 2006 Ape Escape 3 Monkey Pink 2006 Over the Hedge Kid 2006 Yakuza Haruka Sawamura 2006 Nicktoons: Battle for Volcano Island Jimmy Neutron 2007 Crash of the Titans Coco Bandicoot Nina Cortex DS version only 2007 Nicktoons: Attack of the Toybots Jimmy Neutron 2008 God of War: Chains of Olympus Calliope 2008 Crash: Mind over Mutant Coco Bandicoot 2008 SpongeBob SquarePants featuring Nicktoons: Globs of Doom Jimmy Neutron 2010 No More Heroes 2: Desperate Struggle Matt Helms, Mimmy 2010 White Knight Chronicles Rocco 2010 God of War III Calliope 2011 White Knight Chronicles II Rocco 2012 Nicktoons MLB Jimmy Neutron Nintendo 3DS version only 2012 Street Fighter x Tekken PAC-MAN 2013 The Wonderful 101 Luka Alan Smithee, Young Will 2014 Guild Wars 2 Taimi, others 2016 FNaF World Chica's Magic Rainbow 2017 Mobius Final Fantasy Elder Moogle 2017 Crash Bandicoot N. Sane Trilogy Coco Bandicoot, Tawna Bandicoot 2017 Wolfenstein II: The New Colossus Young William Blazkowicz 2019 Crash Team Racing: Nitro Fueled Coco Bandicoot, Baby Coco, Nina Cortex, Pasadena O'Possum ===Live action=== List of live action performances in television Year Title Role Notes Source 1988 Hey Vern, It's Ernest! Skeeter / Willie the Robots Friend / Alien Child 1999 Party of Five Mrs. Pinchon Episode: \"Fate, Hope and Charity\" 2008-2009 iCarly Principal Ted Franklin's Assistant 3 episodes List of live action performances in theatrical films Year Title Role Notes Source 2007 Jekyll Cancer Patient 2018 Gamers Anonymous Phyllis List of voice performances in direct-to-video and television films Year Title Role Notes Source 1990 Archie: To Riverdale and Back Again Midge Mason TV movie 2004 Comic Book: The Movie Debbie Newman ===Theme parks=== List of voice performances in theme park rides Year Title Role Notes Source 1993 Walt Disney's Carousel of Progress Patricia 2003 Jimmy Neutron's Nicktoon Blast Jimmy Neutron ===Other roles=== * The character Speedy in Alka- Seltzer commercials. * The character Zack Putterman in Duracell commercials. ==References== Category:American voice actors Category:1967 births Category:Living people Category:Actors from California",
 "title": "Debi Derryberry"
}