{
 "id": "75012",
 "text": "Dangerously in Love is the debut studio album by American singer and songwriter Beyoncé, released on June 20, 2003 by Columbia Records. During the recording of Destiny's Child's third studio album, Survivor (2001), the group announced that they would produce solo albums to be released. Recording sessions for the album took place from March 2002 to March 2003 at several studios, whilst Destiny's Child were on a break. ==Track listing== ;Notes * signifies a co-producer * signifies a vocal producer * \"Crazy in Love\" samples \"Are You My Woman (Tell Me So)\" (1970) by the Chi-Lites * \"Naughty Girl\" contains interpolations from \"Love to Love You Baby\" (1975) by Donna Summer * \"Baby Boy\" contains interpolations from \"Hot Stepper\" (1990) by Ini Kamoze * \"Be with You\" samples \"Ain't Nothing I Can Do\" (1979) Tyrone Davis and contains interpolations from \"I'd Rather Be with You\" (1976) by Bootsy's Rubber Band and \"Strawberry Letter 23\" (1977) by the Brothers Johnson * \"That's How You Like It\" contains interpolations from \"I Like It\" (1982) by DeBarge * \"Gift from Virgo\" samples \"Rainy Day\" (1974) by Shuggie Otis * \"'03 Bonnie & Clyde\" contains interpolations from \"If I Was Your Girlfriend\" (1987) by Prince and samples of \"Me and My Girlfriend\" (1996) by 2Pac * \"What's It Gonna Be\" samples \"Do It Roger\" (1981) by Roger Troutman ;Unreleased Tracks * \"I Can't Take No More\" (Beyoncé Knowles, Mario Winans, Sean Combs, V. Smith, T. Shropshire, S. Jordan, Angela Beyince) * \"Ice Cream\" (Beyoncé Knowles, Soul Diggaz) * \"My Man\" (Beyoncé Knowles, Angela Beyince, Waller Robert, Scott Storch) (later appeared on the Wal-Mart edition of Destiny Fulfilled) * \"Settle 4 U\" (Beyoncé Knowles, Shawn Carter, Makeda Davis, Bryce Wilson) * \"Sexuality\" (Beyoncé Knowles, LL Cool J) ==Personnel== * Beyoncé Knowles – lead vocals, producer, executive producer, vocal producer, songwriter * Nat Adderley, Jr. – producer, arranger, electric piano, string arrangements * Tawatha Agee – backing vocals * Vincent Alexander – engineer * Sanford Allen – concertmaster * Chuckie Amos – hair stylist * Skip Anderson – arranger, programming, additional keyboards * Ray Bardani – string engineer, mixing * Sherrod Barnes – producer * Mark Batson – producer, arranger, instrumentation, conductor * Carlos Bedoya – engineer, vocal engineer * Big Boi – rap, additional vocal production * Kevin Bird – prop stylist * Craig Brockman – co- producer * John \"Jab\" Broussard – additional guitar * Al Brown – string contractor * Dan Bucchi – assistant mix engineer * Chris Carmouche – additional engineer * Jim Caruana – engineer * Demacio \"Demo\" Castellon – assistant mix engineer * Tom Coyne – mastering * Ian Cuttler – art director * Dahlen – photography * Jason Dale – assistant mix engineer * Makeda Davis – backing vocals * Delroy \"D-Roy\" Andrews – producer * Missy Elliott – rap, producer * Focus... – producer, engineer, instrumentation * Guru – engineer * Phil Hamilton – guitar * Ivan Hampden – drums * Rich Harrison – producer, instrumentation * Andreao \"Fanatic\" Heard – producer * Cissy Houston – backing vocals * James Hunter – graphic artist * Jay-Z – rap * Bashiri Johnson – percussion * Scott Kieklak – mixing * Markus Klinko and Indrani – photography * Mathew Knowles – executive producer * Tina Knowles – stylist * Brendan Kurtz – assistant mix engineer * Tony Maserati – mixing * Errol \"Poppi\" McCalla, Jr. – producer * Byron Miller – bass * Mr. B – producer * Sean Paul – vocals * Greg Price – assistant engineer * Mally Roncal – make-up * Dexter Simmons – mixing * Sleepy Brown – vocals * Matt Snedecor – assistant mix engineer * Brian Springer – engineer * Nisan Stewart – co-producer * Scott Storch – producer * Candace Thomas – backing vocals * Pat Thrall – engineer * Luther Vandross – vocals, vocal arrangement * Luz Vasquez – assistant mix engineer * Stan Wallace – engineer * Brenda White-King – backing vocals * Theresa LaBarbera Whites – A&R; * Bryce Wilson – producer * Pat Woodward – assistant mix engineer * Dan Workman – guitar, engineer ==Charts== ===Weekly charts=== Chart (2003–04) Peak position Australian Albums Chart 2 Austrian Albums Chart 3 Belgian Albums Chart (Flanders) 3 Belgian Albums Chart (Wallonia) 13 Canadian Albums Chart 1 Danish Albums Chart 5 Dutch Albums Chart 4 European Top 100 Albums 1 Finnish Albums Chart 6 French Albums Chart 14 German Albums Chart 1 Greek Albums Chart 1 Hungarian Albums Chart 18 Irish Albums Chart 1 Italian Albums Chart 16 Japanese Albums Chart 12 New Zealand Albums Chart 8 Norwegian Albums Chart 1 Polish Albums Chart 18 Scottish Albums Chart 1 Portuguese Albums Chart 16 Swedish Albums Chart 11 Swiss Albums Chart 2 UK Albums Chart 1 U.S. Billboard 200 1 U.S. Top R&B;/Hip-Hop Albums 1 ===Year-end charts=== Chart (2003) Position Australian Albums Chart 51 Australian Urban Albums Chart 7 Belgian Albums Chart (Flanders) 39 Dutch Albums Chart 31 Finnish Albums Chart 38 French Albums Chart 73 German Albums Chart 37 Hungarian Albums Chart 87 Irish Albums Chart 10 New Zealand Albums Chart Note: The reader must select \"2003\" → \"Albums\". 36 Swedish Albums Chart 66 Swiss Albums Chart 13 UK Albums Chart 15 U.S. Billboard 200 19 U.S. Top R&B;/Hip-Hop Albums 12 Worldwide 5 Chart (2004) Position Australian Albums Chart 74 Australian Albums Urban Chart 9 Belgian Albums Chart (Flanders) 78 Dutch Albums Chart 79 French Albums Chart 128 UK Albums Chart 96 U.S. Billboard 200 29 U.S. Top R&B;/Hip-Hop Albums 12 Chart (2005) Position U.S. Billboard 200 195 U.S. Top R&B;/Hip-Hop Albums 98 ===Decade-end charts=== Chart (2000–09) Position U.S. Billboard 200 59 U.S. Top R&B;/Hip-Hop Albums 67 ;Chart precession and succession |- |- |- ;Singles Year Single Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Peak chart positions Certifications Year US U.S. Club AUS AUT CAN FRA GER NZ SWI UK 2003 \"Crazy in Love\" 1 1 2 8 2 21 6 2 3 1 *AUS: Platinum *BPI: Platinum *NZ: Gold *US: Gold \"Baby Boy\" 1 2 3 18 2 8 4 2 5 2 *AUS: Platinum *US: Gold \"Me, Myself and I\" 4 3 11 51 7 — 35 18 41 11 2004 \"Naughty Girl\" 3 1 9 29 2 18 16 6 18 10 *AUS: Gold *NZ: Platinum *US: Gold \"—\" denotes releases that did not chart or were not released. ==Certifications== Country Certification Argentina Gold Australia 3× Platinum Austria Gold Belgium Gold Canada Platinum Europe Platinum France 2× Gold Germany Platinum Greece Gold Hong Kong Gold Japan Gold Netherlands Gold New Zealand Platinum Note: The reader must select \"Chart #1370 – Sunday 10 August 2003\". Norway Gold Russia Platinum Sweden Gold Switzerland Platinum United Kingdom 4× Platinum United States 4× Platinum ==Awards== Awards ceremony Year Nominated Work Award Results BET Awards 2004 \"Crazy in Love\" (Jay-Z) Best Female R&B; Artist Best Collaboration BRIT Awards Dangerously in Love Best International Female Solo Artist Grammy Awards 2004 \"Crazy in Love\" (with Jay-Z) Best R&B; Song Best Rap/Sung Collaboration \"Dangerously in Love 2\" Best Female R&B; Vocal Performance Dangerously in Love Best Contemporary R&B; Album \"The Closer I Get to You\" Best R&B; Performance by a Duo or Group with Vocal International Dance Music Awards 2003 \"Crazy in Love\" (with Jay-Z) Best R&B;/Urban Dance Track MTV Music Video Awards Video Music Awards Best Female Video Video Music Awards Best R&B; Video Video Music Awards Best Choreography 2004 \"Naughty Girl\" Video Music Awards Best Female Video MTV Europe Music Awards 2003 \"Crazy in Love\" (with Jay-Z) Europe Music Awards Best R&B; Song Europe Music Awards Best Song of the year MTV Video Music Awards Japan 2004 Best Collaboration POP Music Awards 2003 \"03 Bonnie & Clyde\" (with Jay-Z) Most Performed Song \"Crazy in Love\" (with Jay-Z) Most performed song 2005 \"Baby Boy\" (with Sean Paul) Most performed song \"Me, Myself and I\" Most performed song \"Naughty Girl\" Most performed song Songwriter of the year New Musical Express, UK (NME) 2003 \"Crazy in Love\" (with Jay-Z) NME Rocklist (End-of-Year Review) NME Record of the Year (Singles) Nickelodeon Kids' Choice Awards 2004 \"Crazy in Love\" (with Jay-Z) Favorite Female Performer Soul Train Music Awards, USA Dangerously in Love Best R&B;/Soul Album Vibe Awards, USA 2003 \"Crazy in Love\" (with Jay-Z) Coolest Collaboration ==Notes== ==References== Category:2003 albums Category:Beyoncé albums Category:Hip hop albums Category:Neo soul albums Category:R&B; albums Category:Columbia Records albums",
 "title": "Dangerously in Love"
}