{
 "id": "750166",
 "text": "{{Infobox settlement | name = | native_name = Bezirk Villach-Land | native_name_lang = de | settlement_type = District | image_skyline = | image_alt = | image_caption = | image_flag = | flag_alt = | image_seal = | seal_alt = | image_shield = | shield_alt = | nickname = | motto = | image_map = | map_alt = | map_caption = | pushpin_map = | pushpin_label_position = | pushpin_map_alt = | pushpin_map_caption = | coordinates = | coordinates_footnotes = | subdivision_type = Country | subdivision_name = Austria | subdivision_type1 = State | subdivision_name1 = Carinthia | subdivision_type2 = Number of municipalities | subdivision_name2 = 19 | subdivision_type3 = | subdivision_name3 = | established_title = | established_date = | founder = | seat_type = | seat = | government_footnotes = | leader_party = | leader_title = | leader_name = | unit_pref = Metric | area_footnotes = | area_total_km2 = 1009.3 | area_land_km2 = | area_water_km2 = | area_water_percent = | area_note = | elevation_footnotes = | elevation_m = | population_footnotes = | population_total = 64,698 | population_as_of = 2001 | population_density_km2 = auto | population_demonym = | population_note = | timezone1 = CET | utc_offset1 = +01:00 | timezone1_DST = CEST | utc_offset1_DST = +02:00 | postal_code_type = | postal_code = | area_code_type = Telephone prefix | area_code = | iso_code = | website = | footnotes = | blank_name_sec1 = NUTS code | blank_info_sec1 = }} Villach-Land is a district in Carinthia, Austria. The administrative center is Villach. ==Municipalities== Towns are in boldface; market towns in italics; suburbs, hamlets and other subdivisions of a municipality are in small characters. *Arnoldstein (Slov.: Podklošter) (1) **Agoritschach, Arnoldstein, Erlendorf, Gailitz, Greuth, Hart, Hart, Krainberg, Krainegg, Lind, Maglern, Neuhaus an der Gail, Oberthörl, Pessendellach, Pöckau, Radendorf, Riegersdorf, Seltschach, St. Leonhard bei Siebenbrünn, Thörl-Maglern-Greuth, Tschau, Unterthörl *Bad Bleiberg (Slov.: Plejberk pri Beljaku) (2) **Bad Bleiberg, Bleiberg-Kreuth, Bleiberg-Nötsch, Hüttendorf, Kadutschen *Finkenstein am Faaker See (Slov.: Bekštanj) (3) **Altfinkenstein, Faak am See, Finkenstein, Fürnitz, Gödersdorf, Goritschach, Höfling, Kopein, Korpitsch, Latschach, Ledenitzen, Mallenitzen, Müllnern, Neumüllnern, Oberaichwald, Oberferlach, Outschena, Petschnitzen, Pogöriach, Ratnitz, Sigmontitsch, St. Job, Stobitzen, Susalitsch, Techanting, Unteraichwald, Unterferlach, Untergreuth *Nötsch im Gailtal (Slov.: Čajna) (4) **Bach, Dellach, Emmersdorf, Förk, Glabatschach, Hermsberg, Kerschdorf, Kreublach, Kühweg, Labientschach, Michelhofen, Nötsch, Poglantschach, Saak, Semering, St. Georgen im Gailtal, Wertschach *Paternion (Slov.: Špaterjan) (5) **Aifersdorf, Boden, Duel, Ebenwald, Feffernitz, Feistritz an der Drau, Feistritz an der Drau-Neusiedlung, Kamering, Kamering, Kreuzen, Mühlboden, Neu-Feffernitz, Nikelsdorf, Patendorf, Paternion, Pobersach, Pogöriach, Pöllan, Rubland, Tragail, Tragin *Rosegg (Slov.: Rožek) (6) **Berg, Bergl, Buchheim, Dolintschach, Drau, Duel, Emmersdorf, Frög, Frojach, Kleinberg, Obergoritschach, Pirk, Raun, Rosegg, St. Johann, St. Lambrecht, St. Martin, Untergoritschach *Sankt Jakob im Rosental (Slov.: Šentjakob v Rožu) (7) **Dragositschach, Dreilach, Feistritz, Fresnach, Frießnitz, Gorintschach, Greuth, Kanin, Längdorf, Lessach, Maria Elend, Mühlbach, Rosenbach, Schlatten, Srajach, St. Jakob im Rosental, St. Oswald, St. Peter, Tallach, Tösching, Winkl *Treffen (Slov.: Trebinje) (8) **Annenheim, Äußere Einöde, Buchholz, Deutschberg, Eichholz, Görtschach, Innere Einöde, Kanzelhöhe, Köttwein, Kras, Lötschenberg, Niederdorf, Oberdorf, Ossiachberg, Pölling, Retzen, Sattendorf, Schloss Treffen, Seespitz, Stöcklweingarten, Töbring, Treffen, Tschlein, Verditz, Winklern * Velden am Wörther See (Slov.: Vrba) (9) **Aich, Augsdorf, Bach, Dieschitz, Dröschitz, Duel, Fahrendorf, Göriach, Kantnig, Kerschdorf, Köstenberg, Kranzlhofen, Latschach, Lind ob Velden, Oberdorf, Oberjeserz, Oberwinklern, Pulpitsch, Rajach, Saisserach, Selpritsch, Sonnental, St. Egyden, Sternberg, Treffen, Unterjeserz, Unterwinklern, Velden am Wörther See, Weinzierl, Wurzen *Afritz am See (Slov.: Zobrce) (10) **Afritz, Berg ob Afritz, Gassen, Kraa, Lierzberg, Möderboden, Scherzboden, Tassach, Tauchenberg, Tobitsch *Arriach (Slov.: Arjoh) (11) **Arriach, Berg ob Arriach, Dreihofen, Hinterbuchholz, Hinterwinkl, Hundsdorf, Innerteuchen, Laastadt, Oberwöllan, Sauboden, Sauerwald, Stadt, Unterwöllan, Vorderwinkl, Waldweg *Feistritz an der Gail (Slov.: Bistrica na Zilji) (12) *Feld am See (Slov.: Obernšec) (13) **Erlach, Feld am See, Feldpannalpe, Klamberg, Rauth, Schattseite, Untersee, Wiesen *Ferndorf (Slov.: Perja vas) (14) **Beinten, Döbriach, Ferndorf, Glanz, Gschriet, Insberg, Lang, Politzen, Rudersdorf, Sonnwiesen, St. Jakob, St. Paul *Fresach (Slov.: Brežnje) (15) **Amberg, Fresach, Laas, Mitterberg, Mooswald, Tragenwinkel *Hohenthurn (Slov.: Straja vas) (16) **Achomitz, Draschitz, Dreulach, Göriach, Hohenthurn, Stossau *Stockenboi (Slov.: Štokboj) (17) **Aichach, Alberden, Drußnitz, Gassen, Hammergraben, Hochegg, Hollernach, Liesing, Mauthbrücken, Mösel, Ried, Rosental, Scharnitzen, Seetal am Goldeck, Stockenboi, Tragail, Unteralm, Weißenbach, Wiederschwing, Ziebl, Zlan *Weißenstein (Slov.: Bilšak) (18) **Gummern, Kellerberg, Lansach, Lauen, Puch, Stadelbach, Stuben, Töplitsch, Tscheuritsch, Uggowitz, Weißenbach, Weißenstein *Wernberg (Slov.: Vernberg) (19) **Damtschach, Dragnitz, Duel, Föderlach I, Föderlach II, Goritschach, Gottestal, Kaltschach, Kantnig, Kletschach, Krottendorf, Lichtpold, Neudorf, Neudorf, Ragain, Sand, Schleben, Stallhofen, Sternberg, Terlach, Trabenig, Umberg, Wernberg, Wudmath, Zettin Category:Districts of Carinthia (state)",
 "title": "Villach-Land"
}