{
 "id": "750171",
 "text": "{{Infobox settlement | name = | native_name = Bezirk Krems | native_name_lang = de | settlement_type = District | image_skyline = | image_alt = | image_caption = | image_flag = | flag_alt = | image_seal = | seal_alt = | image_shield = | shield_alt = | image_map = | map_alt = | map_caption = | pushpin_map = | pushpin_label_position = | pushpin_map_alt = | pushpin_map_caption = | coordinates = | coordinates_footnotes = | subdivision_type = Country | subdivision_name = Austria | subdivision_type1 = State | subdivision_name1 = Lower Austria | subdivision_type2 = Number of municipalities | subdivision_name2 = 29 | subdivision_type3 = | subdivision_name3 = | established_title = | established_date = | founder = | seat_type = | seat = | government_footnotes = | leader_party = | leader_title = | leader_name = | unit_pref = Metric | area_footnotes = | area_total_km2 = 923.95 | area_land_km2 = | area_water_km2 = | area_water_percent = | area_note = | elevation_footnotes = | elevation_m = | population_footnotes = | population_total = 56,268 | population_as_of = 2015 | population_density_km2 = auto | population_demonym = | population_note = | timezone1 = CET | utc_offset1 = +01:00 | timezone1_DST = CEST | utc_offset1_DST = +02:00 | iso_code = | website = | footnotes = | blank_name_sec1 = NUTS code | blank_info_sec1 = AT124 }} Bezirk Krems is a district of the state of Lower Austria. The administrative center is Krems an der Donau. ==Municipalities== Suburbs, hamlets and other subdivisions of a municipality are indicated in small characters. * Aggsbach ** Aggsbach Markt, Groisbach Köfering, Willendorf in der Wachau * Albrechtsberg an der Großen Krems ** Albrechtsberg an der Großen Krems, Arzwiesen, Attenreith, Els, Eppenberg, Gillaus, Harrau, Klein-Heinrichschlag, Marbach an der Kleinen Krems, Purkersdorf * Bergern im Dunkelsteinerwald ** Geyersberg, Maria Langegg, Nesselstauden, Oberbergern, Paltmühl, Plaimberg, Scheiblwies, Schenkenbrunn, Unterbergern, Wolfenreith * Droß ** Droß, Droßeramt * Dürnstein ** Dürnstein, Dürnsteiner Waldhütten, Oberloiben, Rothenhof, Unterloiben * Furth bei Göttweig ** Aigen, Furth bei Göttweig, Klein-Wien, Oberfucha, Palt, Steinaweg, Stift Göttweig *Gedersdorf ** Altweidling, Brunn im Felde, Donaudorf, Gedersdorf, Schlickendorf, Stratzdorf, Theiß * Gföhl ** Felling, Garmanns, Gföhl, Gföhleramt, Großmotten, Grottendorf, Hohenstein, Lengenfelderamt, Litschgraben, Mittelbergeramt, Moritzreith, Neubau, Ober-Meisling, Rastbach, Reisling, Reittern, Seeb, Unter-Meisling, Wurfenthalgraben * Grafenegg ** Diendorf am Kamp, Engabrunn, Etsdorf am Kamp, Grafenegg, Grunddorf, Haitzendorf, Kamp, Sittendorf, Walkersdorf am Kamp * Hadersdorf-Kammern ** Hadersdorf am Kamp, Kammern * Jaidhof ** Eisenbergeramt, Eisengraben, Eisengraberamt, Jaidhof, Schiltingeramt, Schiltingeramt * Krumau am Kamp ** Eisenberg, Idolsberg, Krumau am Kamp, Krumauer Waldhütten, Preinreichs, Thurnberg, Tiefenbach, Unterdobrawaldhütten * Langenlois ** Gobelsburg, Langenlois, Mittelberg, Reith, Schiltern, Zeiselberg, Zöbing * Lengenfeld * Lichtenau im Waldviertel ** Allentsgschwendt, Brunn am Wald, Ebergersch, Engelschalks, Erdweis, Gloden, Großreinprechts, Jeitendorf, Kornberg, Ladings, Lichtenau, Loiwein, Obergrünbach, Pallweis, Scheutz, Taubitz, Wietzen, Wurschenaigen * Maria Laach am Jauerling ** Benking, Felbring, Friedersdorf, Gießhübl, Haslarn, Hinterkogel, Hof, Kuffarn, Litzendorf, Loitzendorf, Maria Laach am Jauerling, Mitterndorf, Nonnersdorf, Oberndorf, Schlaubing, Thalham, Weinberg, Wiesmannsreith, Zeißing, Zintring * Mautern an der Donau ** Baumgarten, Hundsheim, Mautern an der Donau, Mauternbach * Mühldorf ** Amstall, Elsarn am Jauerling, Mühldorf, Niederranna, Oberranna, Ötz, Ötzbach, Povat, Trandorf * Paudorf ** Eggendorf, Höbenbach, Hörfarth, Krustetten, Meidling, Paudorf, Tiefenfucha * Rastenfeld ** Marbach im Felde, Mottingeramt, Niedergrünbach, Ottenstein, Peygarten-Ottenstein, Rastenberg, Rastenfeld, Sperkental, Zierings * Rohrendorf bei Krems ** Neustift an der Donau, Neuweidling, Oberrohrendorf, Unterrohrendorf * Rossatz-Arnsdorf ** Bacharnsdorf, Hofarnsdorf, Mitterarnsdorf, Oberarnsdorf, Rossatz, Rossatzbach, Rührsdorf, St. Johann im Mauerthale, St. Lorenz * St. Leonhard am Hornerwald ** Obertautendorferamt, St. Leonhard am Hornerwald, Untertautendorferamt, Wilhalm, Wolfshoferamt * Schönberg am Kamp ** Altenhof, Buchberger Waldhütten, Fernitz, Freischling, Kriegenreith, Mollands, Oberplank, Plank am Kamp, Raan, Schönberg, Schönberg-Neustift, See, Stiefern, Thürneustift * Senftenberg ** Imbach, Meislingeramt, Priel, Reichaueramt, Senftenberg, Senftenbergeramt * Spitz ** Gut am Steg, Schwallenbach, Spitz, Vießling * Straß im Straßertale ** Diendorf am Walde, Elsarn im Straßertal, Obernholz, Straß im Straßertale, Wiedendorf * Stratzing * Weinzierl am Walde ** Großheinrichschlag, Habruck, Himberg, Lobendorf, Maigen, Neusiedl, Nöhagen, Ostra, Reichau, Stixendorf, Weinzierl am Walde, Wolfenreith * Weißenkirchen in der Wachau ** Joching, St. Michael, Weißenkirchen in der Wachau, Wösendorf in der Wachau Category:Districts of Lower Austria",
 "title": "Krems District"
}