{
 "id": "75023",
 "text": "Punjab () is a province in Pakistan. The capital of Punjab is Lahore. Punjab has a population of about 120 million people and an area of 79,284 mi² or (205,344 km²). The province of Punjab is greater in area than Kyrgyzstan but smaller than Belarus. ==Etymology== The word Punjab is a combination of the Indo-Iranian words panj (five) and āb (water), and thus the (land of) five rivers. The five rivers are the Indus, Chenab, Jhelum, Ravi and Sutlej. Sometimes, in English, there can be a definite article before the name i.e. the Punjab. The name is also sometimes spelled as Panjab or Panjaab or Punjaab. The name Punjab was given to the region by Turkic Muslim conquerors and popularized during the reign of the Mughal Empire in the 17th century CE. == History == Before 1947 both Pakistan and the Republic of India were ruled by the British. The Punjab province used to be a part of British Punjab. In 1947 the population voted on partition. The Muslim majority voted yes, Sikh minority voted yes, Hindu minority voted no. As a result the British province of Punjab was split between Pakistan and Bharat via the Radcliffe Line and the Ferozpur District and the sub-district of Gurdaspur awards were originally meant to go to the Pakistanis, however it was decided on August 18th to allocate them to East Punjab. Since 1966, India has a state called Punjab. A bus service was launched in 2006 connecting Lahore in Pakistani Punjab with Amritsar in the Republic of India, through the Wagah international border. This was the first bus service between the two Punjabs for almost 60 years.India-Pakistan bus links Punjab - BBC News ==Overview== Wagah, named Wahga in Pakistan, is a village through which the controversial Radcliffe Line, the boundary dividing the Indian Punjab from Pakistani Punjab upon the Partition of India, was drawn. The village was divided by independence in 1947. Today, the eastern half of the village remains in the Republic of India while the western half is in Pakistan. It is particularly known for the elaborate Wagah border ceremony that happens at the International border gate before 5PM each day. Punjab industrialized rapidly beginning in the 1950s. New factories were established in Lahore, Multan, Sialkot and Wah. In the 1960s the new city of Islamabad was built near Rawalpindi. Agriculture continues to be the largest sector of Punjab's economy. The province is the breadbasket of the country as well as home to the largest ethnic group in Pakistan, the Punjabis. Unlike in neighbouring India, there was no large-scale redistribution of agricultural land. As a result, most rural areas are dominated by a small set of feudalistic Zamindar, the land-owning families. In the 1950s there was tension between the eastern and western halves of Pakistan. In order to address the situation, a new formula resulted in the abolition of the province status for Punjab in 1955. It was merged into a single province West Pakistan. In 1972, after East Pakistan seceded and became Bangladesh, Punjab again became a province. Punjab witnessed major battles between the armies of India and Pakistan in the wars of 1965 and 1971. Since the 1990s Punjab hosted several key sites of Pakistan's nuclear program such as Kahuta. It also hosts major military bases such as at Sargodha and Rawalpindi. The peace process between India and Pakistan, which began in earnest in 2004, has helped pacify the situation. Trade and people-to-people contacts through the Wagah border are now starting to become common. Indian Sikh pilgrims visit holy sites such as Nankana Sahib. Starting in the 1980s, large numbers of Punjabis migrated to the Middle East, Britain, Spain, Canada and the United States for economic opportunities, forming the large Punjabi diaspora. Business and cultural ties between the United States and Punjab are growing. About 120 million people live in Punjab, just over half of Pakistan's population of 225 million. ==Geography== Punjab is Pakistan's second largest province at after Balochistan and is located at the northwestern edge of the geologic Indian plate in South-central Asia. The capital and largest city is Lahore which was the historical capital of the wider Punjab region. Other important district cities include Multan, Faisalabad, Sheikhupura, Sialkot, Gujranwala, Jhelum and Rawalpindi. Undivided Punjab is home to six rivers, of which five flow through Pakistani Punjab. From west to east, these are: the Indus, Jhelum, Beas, Chenab, Ravi and Sutlej. Nearly 60% of Pakistan's population lives in the Punjab. It is the nation's only province that touches every other province; it also surrounds the federal enclave of the national capital city at Islamabad.This geographical position and a large multi-ethnic population strongly influence Punjab's outlook on National affairs and induces in Punjab a keen awareness of the problems of the Pakistan's other important provinces and territories. In the acronym P-A-K-I-S-T-A-N, the P is for PUNJAB. The province is a mainly a fertile region along the river valleys, while sparse deserts can be found near the border with Rajasthan and the Sulaiman Range. The region contains the Thar and Cholistan deserts. The Indus River and its many tributaries traverse the Punjab from north to south. The landscape is amongst the most heavily irrigated on earth and canals can be found throughout the province. Weather extremes are notable from the hot and barren south to the cool hills of the north. The foothills of the Himalayas are found in the extreme north as well. == Religion == According to the census done in 2017, nearly 110.5 million people lived in Punjab. About 108 million said they were Muslim. Most of these are Sunni, of the Hanafi school. A minority are Shi'a. The largest non-Muslim minority are Christians, with about 2.1 million people. Most Pakistani Christians live in Punjab. Lahore and Faisalabad have more Christian population than any other cities in Punjab. Most Punjabi Christians are converts from the Hindu Churas and Mazhabi Sikh caste to Christianity during the British Raj in colonial India.Alter, J.P and J. Alter (1986) In the Doab and Rohilkhand: north Indian Christianity, 1815–1915. I.S.P.C.K publishing p196 Many Christians in Punjab are persecuted. The high-profile Asia Bibi blasphemy case was a famous example of this. Bibi was arrested in Punjab in 2009 under the blasphemy law in Pakistan, found guilty and sentenced to execution.NPR website After ten years in prison, and an international campaign, she was acquitted and she and her family moved to Canada, then on to France. The governor of Punjab, Salman Taseer, was assassinated for his defence of Bibi.BBC website There have been cases where people were forced to convert from one religion to Islam. In Pakistan, this mostly applied to the minority religions Hinduism, Christianity, and Sikhism. There are reports that people from these communities are often kidnapped, and forced to convert to Islam. People estimate that there are several hundred cases per year. == Districts of Punjab (Pakistan) == ==Related pages== * Provincial Government of Punjab (Pakistan) == References == Category:1972 establishments in Asia Category:1970s establishments in Pakistan",
 "title": "Punjab (Pakistan)"
}