{
 "id": "75020",
 "text": "The Inquisition was the legal agent of the Roman Catholic Church against heresy in the Middle Ages. Its full name was the Sacred Congregation for the Propagation of the Faith () of the Catholic Church. The word Inquisition comes from the Latin word quaerere, which means to turn or to ask a question. ==Purposes== The Inquisition issued a list of banned books called The Index. The Church had decided these books contained heresy and forbade the faithful to read them. The Inquisition also prosecuted individuals who were accused of heresy. Later versions of the Inquisition had the power to use torture (or the threat of torture) to get confessions and force people to convert to Catholicism. It also had the power to order executions, which civil authorities carried out. Usually heretics were burned alive or strangled in public. ==History== The Inquisition developed in stages. The first permanent Inquisition was established in Rome in 1229. It was run by the Dominican Order.Lea, Henry Charles 1888. Chapter VII. The Inquisition Founded. A History of the Inquisition In The Middle Ages, 1. . The judicial use of torture was as yet happily unknown... In 1478, Ferdinand II of Aragon and Queen Isabella I of Castile set up the Spanish Inquisition. It played an important role in European history. In 1542 Pope Paul III established the Congregation of the Holy Office of the Inquisition as a tribunal staffed with cardinals and other officials. This version supervised the local Inquisitions in other countries, and also investigated important cases from Italy. The most famous person it tried was Galileo Galilei in 1633. ==Denial== ===The Vatican=== In 2004, the Roman Catholic Church published findings that the judges of the Inquisition were \"not as brutal as previously believed\". * * * The Church also denied that most trials were carried out by Catholic courts. It said the court's victims were often \"tortured for only 15 minutes in the presence of doctors\". ===Spain=== For the past decade, movements within Spain have emerged to rewrite the history of the Spanish Inquisition. Members of the movements released a series of books, films, TV programs and mobile exhibitions to beautify the Inquisition-associated Spanish history. ==Related pages== * Ustaše * Antisemitism * Supersessionism * Spanish Inquisition * Index Librorum Prohibitorum * Independent State of Croatia * The Protocols of the Elders of Zion ==Other websites== * The Catholic Church * The Secret of the Inquisition * Antisemitism in History: From the Early Church to 1400 * Foundations of Holocaust: From Inquisition to “Purity of Blood” * The Roman Catholic Church, the Holocaust, and the demonization of the Jews. Response to “Benjamin and us: Christanity, its Jews, and history” by Jeanne Favret-Saada ==References== Category:Europe Category:Racism Category:Courts (law) Category:Catholicism Category:Law of Spain Category:Antisemitism Category:South America Category:Discrimination Category:History of Spain Category:Establishments in Spain Category:1830s disestablishments Category:1470s establishments in Europe Category:Christianity of the Middle Ages Category:19th-century disestablishments in Europe",
 "title": "Inquisition"
}