{
 "id": "750335",
 "text": "The regions of Chad are divided into 61 departments. The following is a list of departments grouped by region. Shown next to each department is its population as of 2009, the name of its capital or main town, and a list of sub-prefectures. == Bahr El Gazel == Created in 2008 from the Kanem region's former Barh El Gazel department. Department Pop. 2009 Capital Sub-prefectures Bahr el Gazel Nord Salal Dourgoulanga, Mandjoura, Salal Bahr El Gazel Sud Moussoro Amsilep, Chadra, Michemiré, Moussoro == Batha == Department Pop. 2009 Capital Sub-prefectures Batha Est Oum Hadjer Am Sack, Assinet, Haraze Djombo Kibit, Oum Hadjer Batha Ouest Ati Ati, Djédaa, Koundjourou, Hidjelidjé Fitri Yao N'Djamena Bilala, Yao == Borkou == Created in 2008 from the Borkou- Ennedi-Tibesti region's former Borkou department. Department Pop. 2009 Capital Sub-prefectures Borkou Faya-Largeau Faya-Largeau (Faya), Kouba Olanga Borkou Yala Kirdimi, Yarda == Chari-Baguirmi == Department Pop. 2009 Capital Sub-prefectures Baguirmi Massenya Dourbali, Maï Aïche, Massenya Chari Mandélia Koundoul, La Loumia, Linia, Lougoun, Mandélia Loug Chari Bousso Bä Illi, Bogomoro, Bousso, Kouno, Mogo == Ennedi == Created in 2008 from the Borkou-Ennedi-Tibesti region's former Ennedi Est and Ennedi Ouest departments. Department Pop. 2009 Capital Sub-prefectures Ennedi Fada Fada, Gouro, Kalait, Ounianga, Nohi Wadi Hawar Amdjarass Amdjarass, Bahaï, Bao Billiat, Kaoura, Mourdi == Guéra == Department Pop. 2009 Capital Sub-prefectures Abtouyour Bitkine Bang Bang, Bitkine Barh Signaka Melfi Chinguil, Mélfi, Mokofi Guéra Mongo Baro, Mongo, Niergui Mangalmé Mangalmé Bitchotchi, Eref, Kouka Margni, Mangalmé == Hadjer-Lamis == Department Pop. 2009 Capital Sub-prefectures Dababa Bokoro Bokoro, Gama, Moïto Dagana Massakory Karal, Massakory, Tourba Haraze Al Biar Massaguet Mani, Massaguet, N'Djamena Fara == Kanem == Department Pop. 2009 Capital Sub-prefectures Kanem Mao Kekedina, Mao, Melea, Wadjigui Nord Kanem Nokou Nokou, Ntiona, Rig Rig, Ziguey Wadi Bissam Am Doback, Mondo == Lac == Department Pop. 2009 Capital Sub-prefectures Mamdi Bol Bagassola, Bol, Daboua, Kangalam, Liwa Wayi Ngouri (N'Gouri) Doum Doum, Kouloudia, Ngouri (N'Gouri) == Logone Occidental == Department Pop. 2009 Capital Sub-prefectures Dodjé Beinamar Béïnamar, Béïssa, Laoukassy, Tapol Guéni Krim Krim Bao, Bémangra, Doguindi, Krim Krim Lac Wey Moundou Bah, Déli, Dodinda, Mbalkabra, Mballa Banyo, Moundou, Ngondong Ngourkosso Benoye Bébalem, Békiri, Béladjia, Benoye, Bourou, Saar Gogné == Logone Oriental == Department Pop. 2009 Capital Sub-prefectures Kouh-Est Bédjo, Bodo, Béti Kouh-Ouest Béboto Baké, Béboto, Dobiti La Nya Bébédjia Bébédjia, Béboni, Komé, Mbikou, Miandoum La Nya Pendé Goré Békan, Donia, Goré, Yamodo La Pendé Doba Doba, Kara, Madana Monts de Lam Baïbokoum Baïbokoum, Béssao, Laramanaye, Mbaïkoro, Mbitoye == Mandoul == Department Pop. 2009 Capital Sub-prefectures Barh Sara Moïssala Béboro, Békourou, Bouna, Dembo, Moïssala Mandoul Occidental Bédjondo Bébopen, Bédjondo, Békamba, Peni Mandoul Oriental Koumra Bédaya, Béssada, Goundi, Koumra, Mouroum Goulaye, Ngangara == Mayo-Kebbi Est == Department Pop. 2009 Capital Sub-prefectures Kabbia Gounou Gaya Berem, Djodo Gassa, Gounou Gaya, Pont Karwal Mayo-Boneye Bongor Bongor, Gam, Kim, Koyom, Moulkou, Rigaza, Samga Mayo-Lémié Guélengdeng, Katoa, Nanguigoto Mont Illi (Mont d'Illi) Fianga Fianga, Hollom Gamé, Kéra, Tikem, Youé == Mayo-Kebbi Ouest == Department Pop. 2009 Capital Sub-prefectures Lac Léré Léré Binder, Guégou, Lagon, Léré Mayo- Dallah Pala Gagal, Lamé, Pala, Torrock == Moyen-Chari == Department Pop. 2009 Capital Sub-prefectures Barh Köh Sarh Balimba, Korbol, Koumogo, Moussa Foyo, Sarh Grande Sido Danamadji, Djéké Djéké, Maro, Sido Lac Iro Kyabé Alako, Bohobé, Baltoubaye, Boum Kebbir, Dindjebo, Kyabé, Ngondeye, Roro, Singako == Ouaddaï == Department Pop. 2009 Capital Sub-prefectures Abdi Abdi, Abkar Djombo, Biyeré Assoungha Adré Adré, Borota, Hadjer Hadid, Mabrone, Molou, Tourane Ouara Abéché Abéché, Abougoudam, Amleyouna, Bourtaïl, Chokoyan, Gurry, Marfa == Salamat == Department Pop. 2009 Capital Sub-prefectures Aboudeïa Aboudeïa Abgué, Aboudeïa, Am Habilé Barh Azoum (Barh-Azoum) Am Timan Am Timan, Djouna, Mouraye Haraze-Mangueigne Haraze Daha, Haraze, Mangueigne == Sila == Created in 2008 from the Ouaddaï region's former Sila and Djourf Al Ahmar departments. Department Pop. 2009 Capital Sub-prefectures Djourf Al Ahmar (Djourouf Al Ahmar) Am Dam Am Dam, Haouich, Magrane Kimiti Goz Beïda Adé, Goz Beïda, Kerfi, Koukou-Angarana, Mogororo, Moudeïna, Tissi == Tandjilé == Department Pop. 2009 Capital Sub-prefectures Tandjilé Est Laï Deressia, Dono Manga, Guidari, Laï, N'Dam Tandjilé Ouest Kélo Baktchoro, Béré, Bologo, Dafra, Delbian, Dogou, Kélo, Kolon == Tibesti == Created in 2008 from the Borkou-Ennedi-Tibesti region's former Tibesti department. Department Pop. 2009 Capital Sub-prefectures Tibesti Est Bardaï Aouzou, Bardaï, Yebbibou, Zoumri Tibesti Ouest Zouar Goubonne, Wour, Zouar == Wadi Fira == Department Pop. 2009 Capital Sub-prefectures Biltine Biltine Am Zoer, Arada, Biltine, Mata Dar Tama Guéréda Guéréda, Kolonga, Sirim Birke Kobé Iriba Iriba, Matadjana, Tiné Djagaraba === N'Djamena (capital) === N'Djamena, the capital city of Chad, is also a special statute region. It has no departments, but is divided into 10 arrondissements. Category:Geography of Chad",
 "title": "Departments of Chad"
}