{
 "id": "750678",
 "text": "== Pre-Buddhist Era == Most Sinhalese in the island claim that Sri Lanka was ruled by nagas and yakkas before Vijaya( a prince from India ) came to Sri Lanka. The most famous of these legendary kings is Ravana. Most people in the country believe that Ravana is still alive but in deep sleep. But most prominent historians regard Vijaya as Sri lanka's first king. Vijaya is an Indian prince who because of misbehavior was put in a boat with his 700 friends was sent off. He was the son of king Sinhabahu who was in fact the son of a Lion. Hence most Sinhalse claim to be descending from the Lion's blood. There were several kings who ruled Sri Lanka after Vijaya but the most important after that was Pandukabaya because he chose Anuradhapura as the country's capital. == Colonial Era == The first Portuguese arrived at Sri Lanka in 1505. == Civil War == Sri Lanka experienced the Civil war through years 1983 to 2009. Racial discrimination after the post colonial era was the main reason for civil war as such. The sinhala only act which was passed in 1953 was one of the main reasons for a war as such. This act led to about 1/3 of the population facing difficulties when performing daily tasks. It also gave superior status to the Sinhalese component of the population. Even though most people criticize the Act, it can be argued as a healthy decision as previously Lanka used colonial English to handle work at courts which limited amout of people understood. So it was really a choice between making more people understand or making the population literate in English. The war was between the LTTE and the Sri Lankan army. Due to careful planning and expert battling techniques of Sarath Fonseka under the guidance of former president Mahinda Rajapakse and former defence secreatariat Gotabaya Rajapakse, the brutal civil war ended in May 2009 as the LTTE admitted defeat. == Post-War Era == Sri Lanka had to gain international confidence after the war. == References == == Further Reading == # (PDF) Producing and using the Historical Relation of Ceylon: Robert Knox, the East India Company and the Royal Society An historical relation of Sri Lanka # Road to Nandikadal (Sinhala Translation): Kamal Gunaratne: 9789554323711: Amazon.com: Books # https://www.sarasavi.lk/Book/Sinhalayo-9559170120 Sinhalayo By Senarath Paranavithana Category:History of Asia by country Category:History of Sri Lanka",
 "title": "History of Sri Lanka"
}