{
 "id": "75070",
 "text": "Me, Myself and I Cover Singel Beyoncé Knowles from the album Dangerously in Love Released October 21 2003 Genre Length 3:58 (Radio Edit) 5:01 (Album Version) Label Columbia Writer Beyoncé Knowles, Scott Storch, Robert Waller Producer Beyoncé Knowles, Scott Storch Beyoncé Knowles singles chronology Fighting Temptation (2003r.) Me, Myself and I Summertime (2004r.) Dangerously in Love track listing Be with you (5) Me, Myself and I (6) Yes (7) Live at Wembley track listing Destiny`s Child`s Medley (10) Me, Myself and I (11) Summertime (12) Me, Myself and I is an R&B;/neo soul song written by Beyoncé Knowles, Scott Storch, and Robert Waller for Knowles' solo debut studio album Dangerously in Love (2003). In this laid-back, but strong-willed female- empowerment anthem, the singer comes to terms with a cheating boyfriend, and declares that in the world that there is only one person she can trust who never lets her down: herself. \"Me, Myself and I\" was the third single to be released from the album, in the last quarter of 2003. It reached number four on the Billboard Hot 100 for two weeks, becoming Beyoncé's fourth consecutive top five single in the United States; it also reached eleven in the United Kingdom. == Official versions == * \"Me, Myself and I\" (Acapella) * \"Me, Myself and I\" (Instrumental) * \"Me, Myself and I\" (Radio Edit) * \"Me, Myself and I\" (Bama Boys Sexy Remix) * \"Me, Myself and I\" (Bama Boys Throwback Remix) * \"Me, Myself and I\" (Eastern Daylight Mix By Punjabi MC & Raj Asia) * \"Me, Myself and I\" (Grizzly Mix - with Rap) (featuring Ghostface Killah) * \"Me, Myself and I\" (J'TY Remix) (featuring Grafh) * \"Me, Myself and I\" (Junior Vasquez Radio Edit) * \"Me, Myself and I\" (Junior's Radio Mix) * \"Me, Myself and I\" (Junior's Marathon Mix) * \"Me, Myself and I\" (Junior's World Club Mix) * \"Me, Myself and I\" (Tony Moran & Warren Rig Club Mix) * \"Me, Myself and I\" (Warren Rigg Vocal Mix) * \"Me, Myself and I\" (DJ Streetz/Street Mix) Category:2003 songs Category:Beyoncé songs Category:Songs about infidelity Category:Hip hop soul songs Category:R&B; songs",
 "title": "Me, Myself and I"
}