{
 "id": "750877",
 "text": "An underwater museum is a museum that is made, designated or put underwater, in particular, in a natural body of water. The category includes naturally or historically occurring settings that have been designated museums. These museums can be visited by glass-bottomed boats, snorkeling, or scuba diving, depending on the site. This list includes \"preserves\" which legally protect submerged ships or other cultural items. *The Alexandria Underwater Museum Project will create an underwater museum displaying artifacts found in the submerged port of Alexandria, Egypt. * Alley of Leaders, Cape Tarkhankut, Crimea is a collection of relatively modern sculptures placed in this Black Sea location. The core of the collection consists of sculptures from the USSR. * Baia Underwater Park, in the Mediterranean Sea north of Naples, Italy, contains a naturally inundated city. Baia was abandoned in the eight century. * Baiheliang archaeological site in Fuling, China was created by the flooding caused by the building of the Three Gorges Dam. It includes ancient inscriptions in stone, recording the water level of the Yangtze River for some 1,200 years. * De Tour Passage Underwater Preserve, near Drummond Island has shipwrecks. * Grand Traverse Bay Underwater Preserve, Traverse City, Michigan has a number of shipwrecks at various depths. * Herod's Harbor, in Caesarea, Israel is an inudated port from the Roman era. *Keweenaw Underwater Preserve by Copper Harbor, Michigan, USA has twelve shipwrecks. * Manitou Passage Underwater Preserve surronding the Manitou Islands in Michigan, USA includes a number of wrecks, not all of which are submerged. * Molinere Underwater Sculpture Park is a collection of ecological art off Grenada in the Caribbean Sea. * Monterrosa's Roatan Underwater Museum, Honduras has archaeological, historic and replica artifacts. * Museo Atlántico Lanzarote is a sculpture museum by Lanzarote in the Canary Islands. * Museo Subacuático de Arte [Spanish] known as MUSA (English: Cancún Underwater Museum) is a sculpture museum in the Caribbean Sea, near Cancún, Mexico. * Museum of Underwater Art known as MOUA is a sculpture museum in the Great Barrier Reef near Townsville, Australia * Ngaro Underwater Sculpture Trail, Whitsundays is a collection of six site specific sculptures planted within the fringing reefs of the Whitsunday Islands at the heart of the Great Barrier Reef in Australia. One of these 'Anthozoa' by artist Jessa Lloyd is the single largest underwater sculpture in the world. It is a scaled up replica of a single coral polyp, the life source of the reef and at 5,000 times its normal size rises over six metres from the ocean floor. Anthozoa is located on Langford Reef between Hayman Island and Hook Island (GPS Coordinates: 20° 0.8342' South, 148° 88.197' East). * Shipwreck Trail, Florida Keys National Marine Sanctuary, off the southern tip of Florida, USA, is as collection of sunken ships dating from the 18 through the 20th century. All but the most recent ship were naturally sunk. *Thumb Area Bottomland Preserve, Port Austin, Michigan, USA has over twenty wrecks, some of them visible from the surface. * Thunder Bay National Marine Sanctuary’s Great Lakes Maritime Heritage Center, Alpena, Michigan, USA has a “Shipwreck Alley” with wrecks dating from 1849 to 1966. * Underwater Museum of Art, Grayton Beach State Park in South Walton, Florida, USA started with seven sculptures. It rotates juried pieces every year. https://umafl.org/ * Underwater museum of Marseille, Monumental and majestic sculptures have been placed at a depth of 5 meters (16 feet) so that the public can come and admire them. There are currently eight of them. The museum aims to raise public awareness of environmental issues, marine biology and to awaken people to the world of art and water sports (snorkeling, diving). * Underwater Observatory Marine Park Eilat is a facility in Israel. * Underwater Pavillions is an art installation of three interactive sculptures by Doug Aitken off Catalina Island, California, USA. https://www.travelandleisure.com/culture- design/visual-arts/underwater-sculptures-california * Whitefish Point Underwater Preserve, Michigan, USA contains numerous shipwrecks. ==References== Underwater",
 "title": "List of underwater museums"
}