{
 "id": "750812",
 "text": "Rifat Chadirji ( Rifa’a al-Khādarjī, also Romanized Rifa'at Al Chaderchi; December 6, 1926 – April 10, 2020) was an Iraqi architect, photographer, author and activist. He was born in Baghdad, Iraq. He was often seen as the father of modern Iraqi architecture. He designed more than 100 buildings across the country. His best known work was the The Monument to the Unknown Soldier in Baghdad. Chadriji died from COVID-19 in London on April 10, 2020, at the age of 93. ==Some works== ===Architecture works=== Site Location Country Central Post Office (1975)Elsheshtawy, Y. (ed.), Planning Middle Eastern Cities: An Urban Kaleidoscope, Routledge, 2004, p. 72 Baghdad Iraq Hamood Villa (1972)Frampton, K. and Khan, H-U. (eds), World Architecture 1900-2000: The Middle East, Vol. 5, Armenian Research Center, 2000, [World Architecture Series], p. xxx Baghdad Iraq National Insurance Company Mosul Iraq Offices and Tobacco Warehouses (1965) Baghdad Iraq The Monument to the Unknown Soldier (erected 1959: replaced 1983)Bernhardsson, M.T., \"Visions of the Past: Modernizing the Past in 1950s Baghdad,\" in Sandy Isenstadt and Kishwar Rizvi, Modernism and the Middle East: Architecture and Politics in the Twentieth Century,\" University of Washington Press, 2008, p.92 Baghdad Iraq Rafiq Residence (1965)Hagan, S., Taking Shape: A New Contract Between Architecture and Nature, Routledge, 2007, p. 124 Baghdad Iraq ===Written works=== Author Title Year Chadirji, Rifat Introduction to Urban Design and Architecture in Lebanon 2004 Chadirji, Rifat Medina Interviews Architect 1999 Chadirji, Rifat The Photographs of Kamil Chadirji 1995 Khan, Hasan-Uddin Regional Modernism: Rifat Chadirji's Portfolio of Etchings 1984 Chadirji, Rifat Concepts and Influences:Towards a Regional International Architecture, 1952-1978 1986 ==References== Category:1926 births Category:2020 deaths Category:Deaths from the COVID-19 pandemic in London Category:Iraqi writers Category:Architects Category:Photographers Category:People from Baghdad",
 "title": "Rifat Chadirji"
}