{
 "id": "751058",
 "text": "Timothy Julian Brooke-Taylor OBE (17 July 194012 April 2020) was an English actor and comedian. Brooke-Taylor became known for his work on BBC Radio with I'm Sorry, I'll Read That Again. He later moved into television with At Last the 1948 Show. He was best known as a member of The Goodies, starring in the television series throughout the 1970s. He was a panellist on I'm Sorry I Haven't a Clue for almost 50 years.The Goodie Life Retrieved 12 February 2010 Brooke-Taylor died of problems from COVID-19 on 12 April 2020, aged 79. ==Filmography == ===Film=== Year Title Role Notes 1968 One Man Band Reporter / Young Aristocrat Uncompleted / Unreleased 1969 The Thirteen Chairs Jackie 1971 The Statue Hillcrest 1971 Willy Wonka & the Chocolate Factory Computer Scientist Uncredited 1976 Pleasure at Her Majesty's Tim (with The Goodies) 1981 The Secret Policeman's Other Ball Various 1986 Whoops Apocalypse Man Who Walks to the Phone 1988 Under the Bed Bin Man 1989 Asterix and the Big Fight Cacofonix Voice, English Version ===Television=== Year Title Role Notes 1966 The Wednesday Play Uncredited Role Episode: Cathy Come Home 1967–1968 At Last the 1948 Show Various Characters Also Writer 1968 How to Irritate People Various Characters Also Writer 1968–1969 Marty Various Characters Also Writer 1968–1969 Broaden Your Mind Various Characters Also Writer 1970–1982 The Goodies Tim Also Writer 1976–1979 Hello Cheeky Himself Also Writer 1983–1984 Bananaman Voice 1984–1988 Me and My Girl Derek Yates 1985 Assaulted Nuts Various Characters 1987–1988 You Must Be the Husband Tom Hammond 1989 Barney Barney Voice 1991 Qd - The Master Game Himself Presenter 1992 The Upper Hand Trevor Episode: Blind Date 1996 Dennis the Menace Barney Voice, Episode: Unidentified Funny Object 1997 One Foot in the Grave Derek McVitie Episode: \"Endgame\" 1999 2002 TLC Hospital Chaplain 2004 Beat the Nation Quiz Co-Host Co-Host with Graeme Garden 2005 Absolute Power Peter Harrow 2005–2009 Heartbeat Ronnie Smethers Guest Role 2008 Agatha Christie's Marple Dr Edward Humbleby Episode: Murder is Easy 2009 Horne & Corden Vicar 2010–2011 Little Howard's Big Question Various Characters 2013 Animal Antics Co-Host 2015 Doctors Graham Parsons Episode: About Time ===Radio=== Year Show or film Role Notes 1964–1973 I'm Sorry, I'll Read That Again Various Characters Wrote for the series 1973–1979 Hello Cheeky (radio show) Himself Wrote for the series 1972–2020 I'm Sorry I Haven't a Clue Himself Panel show ==References== Category:1940 births Category:2020 deaths Category:Actors from Derbyshire Category:Deaths from the COVID-19 pandemic in the United Kingdom Category:English comedians Category:English movie actors Category:English radio personalities Category:English television actors Category:English television personalities Category:English voice actors",
 "title": "Tim Brooke-Taylor"
}