{
 "id": "75157",
 "text": "Joy Division was an English post-punk band. They formed in 1976 in Salford. Ian Curtis was the lead singer. Peter Hook played bass guitar. Stephen Morris played the drums. Bernard sumner played guitar and sometimes the synthesizer. Ian Curtis died by suicide in 1980. So, the other members formed a new band called New Order. == History == During the Anarchy in the UK tour, the Sex Pistols played in Manchester on June 4. In the audience that night were three young men living around Manchester: school mates Peter Hook and Bernard Albrecht, and Ian Curtis. A few days later, Hook and Albrecht decided to start up a band, with Hook on bass and Albrecht on guitar. They got Terry Mason as a drummer, but still needed a singer. They placed an ad in the Virgin record shop in Manchester. Curtis answered it and became the singer of the band, called at the time the Stiff Kittens. He would also write the lyrics. They practiced a lot during a few months, and wrote their first songs. In May of 1977, they changed the band's name to Warsaw. Tony Tabac replaced Terry Mason as the drummer. Just a month later, Tabac left and Steve Brotherdale was hired as new drummer. It was at the same time that Paul Morley of the NME and DJ Rob Gretton found out about the band and saw its potential. Warsaw made a demo tape with five songs in the Pennine Sound Studios in July, but Brotherdale quit the group a few days later. Finally, Stephen Morris joined the band. In October, they played at the Electric Circus, which was due to close down, along with The Fall and The Buzzcocks. In December, they recorded four songs, which were to appear later as \"An Ideal For Living\". In January of 1978 the band changed its name to Joy Division to avoid any confusion with another group. They practiced a lot and wrote new songs. On April 14 1978, they played along with 16 bands in a contest. Tony Wilson, who worked for Granada TV, and Rob Gretton liked their performance very much. In 1979 Joy Division released their first album Unknown Pleasures which was well received by critics. During 1979 and early 1980 their popularity increased. Also in this period lead singer Ian Curtis suffered worsening bouts of illness caused by epilepsy. The band returned to the studio in 1980 to record their second album Closer and a single \"Love Will Tear Us Apart\". Before these recordings were released Curtis had committed suicide at just 23. The unreleased album and single were subsequently released to critical acclaim. The remaining members of Joy Division reformed in 1980 as New Order and enjoyed considerable worldwide success during the 1980s and 1990s. == Discography == * Unknown Pleasures (1979) * Closer (1980) == Other websites == * Joy Division - The Eternal - Biography, pictures, lyrics, books, videos, press articles, etc. * Joy Division Central – Independent Joy Division site covering every aspect of the band in great detail * Incubation – Joy Division's most detailed discography and press articles * Joy Division Messageboard – A moderated board with over 1400 members covering a wide range of Joy Division related topics Category:1976 establishments in the United Kingdom Category:1970s British music groups Category:1980s British music groups Category:1980s disestablishments in the United Kingdom Category:English punk bands Category:Musical groups disestablished in 1980 Category:Musical groups established in 1976 Category:Musical groups from Greater Manchester Category:1980 disestablishments in the United Kingdom Category:Gothic rock groups",
 "title": "Joy Division"
}