{
 "id": "751977",
 "text": "The National Basketball Association Most Valuable Player Award (MVP) is an annual National Basketball Association (NBA) award given since the 1955–56 season to the best performing player of the regular season. The winner receives the Maurice Podoloff Trophy, which is named in honor of the first commissioner (then president) of the NBA, who served from 1946 until 1963. Until the 1979–80 season, the MVP was selected by a vote of NBA players. Since the 1980–81 season, the award is decided by a panel of sportswriters and broadcasters throughout the United States and Canada. Each member of the voting panel casts a vote for first to fifth place selections. Each first- place vote is worth 10 points; each second-place vote is worth seven; each third-place vote is worth five, fourth-place is worth three and fifth-place is worth one. Starting from 2010, one ballot was cast by fans through online voting. The player with the highest point total wins the award. As of June 2019, the current holder of the award is Joel Embiid of the Philadelphia 76ers. Every player who has won this award and has been eligible for the Naismith Memorial Basketball Hall of Fame has been inducted. Kareem Abdul- Jabbar won the award a record six times. He is also the only player to win the award despite his team not making the playoffs back in the 1975–76 season. Both Bill Russell and Michael Jordan won the award five times, while Wilt Chamberlain and LeBron James won the award four times. Russell and James are the only players to have won the award four times in five seasons.Moses Malone, Larry Bird, Magic Johnson and Nikola Jokic each won the award three times, while Bob Pettit, Karl Malone, Tim Duncan, Steve Nash and Stephen Curry have each won it twice. Only two rookies have won the award: Chamberlain in the 1959–60 season and Wes Unseld in the 1968–69 season. Hakeem Olajuwon of Nigeria, Duncan of the U.S. Virgin Islands, Nash of Canada, Dirk Nowitzki of Germany, and Giannis Antetokounmpo of Greece are the only MVP winners considered \"international players\" by the NBA. Curry in 2015–16 is the only player to have won the award unanimously. Shaquille O'Neal in 1999–2000 and James in 2012–13 are the only two players to have fallen one vote shy of a unanimous selection, both receiving 120 of 121 votes. Since the 1975–76 season, only two players have been named MVP for a season in which their team failed to win at least 50 regular-season games—Moses Malone (twice, 1978–79 and 1981–82) and Russell Westbrook (2016–17). Category:1956 establishments in the United States Category:Most valuable player awards Category:National Basketball Association Category:Sports trophies and awards",
 "title": "NBA Most Valuable Player Award"
}