{
 "id": "75223",
 "text": "Iron Man is a song by the English heavy metal band Black Sabbath. It was first released on 18 September 1970 as the fourth track on the band's second album Paranoid. It was later released as the second and final single from the album in October 1971. The song is one of the band's biggest hits. ==Background and composition== \"Iron Man\" is about a man who travels to the future and sees the apocalypse. On his way back, he is caught in Earth's magnetic field, and turned to steel. When he comes back, he tries to warn the people about the apocalypse, but they do not believe him, and shun him, so he takes his revenge by killing them all, thus bringing about the apocalypse he saw. It would appear that he died and came back to life, for \"vengeance from the grave kills the people he once saved\" is a line from the song. The title of the song was conceived by Ozzy Osbourne. Geezer Butler took to writing the lyrics around the title. The song was called \"Iron Bloke\" originally. Upon hearing the main guitar riff for the first time, Osbourne said it sounded \"like a big iron bloke walking about\".Classic Albums - Paranoid, by Isis Productions/Eagle Rock Entertainment The title was later changed to \"Iron Man\". ==Reception and legacy== The song peaked at number 52 on the Billboard Hot 100 in 1972, and its riff is one of the most easily recognizable in all of music. The live rendition of the song from Black Sabbath's 1998 live album Reunion won them the 2000 Grammy Awards for Best Metal Performance. It ranked in 317th place on the Rolling Stone's 500 Greatest Songs of All Time in 2004, and in 7th place on their \"100 Greatest Heavy Metal Songs of All Time\" list in March of 2023. \"Iron Man\" was used in the end credits of Iron Man (2008), its video game adaptation and the trailer for the 2010 sequel, Iron Man 2. The professional wrestling tag team The Road Warriors used \"Iron Man\" as their entrance theme in the mid-1980s in the American Wrestling Association and other promotions. ==Covers== * Green Day covered part of the song live. * The Cardigans covered a jazz version of the song on their 1996 album, First Band on the Moon. * Cat Rapes Dog covered the song for the 1990 single, \"Fundamental\". * Electric Eel Shock from Japan recorded an up tempo version on their 2005 album Beat Me they also often open live shows with the intro. * Giant Sand covered the song on their 2002 album, Cover Magazine. * The Bad Plus covered the song on their 2004 album, Give. * Sir Mix-a-Lot (backed by metal band Metal Church) covered the song with new lyrics on Mix-A-Lot's 1988 album, Swass. * NOFX recorded a cover of the song which was released years later on their 1992 compilation, Maximum Rocknroll. * Irish band Therapy? covered the song for the 1994 Black Sabbath tribute album, Nativity in Black. Vocals on the track were provided by Ozzy Osbourne, who sang on the original. * Marilyn Manson and the Spooky Kids covered the song on their 1990 demos, albeit with the lyrics altered to make reference to the Son of Sam murders. * Metallica covered the song when Black Sabbath was inducted into the Rock and Roll Hall of Fame in 2006. * Pearl Jam vocalist Eddie Vedder has, on occasion, such as at the Reading Festival 2006, played the song humorously on ukulele. * Kanye West samples the song on his song \"Hell of a Life\" on his album, My Beautiful Dark Twisted Fantasy. * Four Tet performs an instrumental cover on the Black Sabbath covers album, Everything Comes & Goes. * William Shatner covers the song alongside Zakk Wylde (former Ozzy Osbourne's guitarist) on his 2011 album, Seeking Major Tom. * Comedian Bob Rivers recorded a parody as the title track of his album, I Am Santa Claus. * Phish covered the song at their New Year's Eve show at Madison Square Garden on 31 December 2012. The cover was their final song of the encore and tour, with Page McConnell on vocals. * Cancer Bats covered the song on the 2013 re-issue of their 2012 album, Dead Set on Living. This \"Deluxe\" or \"Bat Sabbath\" version included 9 extra tracks, all being Black Sabbath covers. * Tanzwut used the main riff as melody in their song \"Eisenmann\" on their self-titled debut album. ==References== Category:1970 songs Category:Black Sabbath songs Category:Green Day songs Category:The Cardigans songs Category:Metallica songs Category:Marilyn Manson songs",
 "title": "Iron Man (song)"
}