{
 "id": "752340",
 "text": "Supersessionism, or replacement theology, is the idea that one religion ceases to be true once another religion shows up to supersedeTake the place of (a person or thing previously in authority or use). Oxford Languages. it. ==Examples== For instance, Christianity believes that Judaism was true once but that because the Jews rejected Jesus they stopped being the Chosen People and that the New Testament and a faith-based religion replaced Jewish Law. Islam also believes that God gave the Torah alike to the Israelites at Mount Sinai but that the Quran ultimately replaced it. ==Antisemitism== ===Christianity=== Nowadays, supersessionism is widely deemed antisemitic as it laid the groundwork for the two millennia of Christian antisemitism and persecution of Jews that peaked in the Holocaust, killing at least 6,000,000 Jews – 67% of pre-war European Jews. Supersessionism is no longer backed by mainstream churches, reportedly including the Vatican, * * * * * which have switched the focus to Christian–Jewish reconciliation. Some Christians endorse the dual-covenant theology (DCT) which holds that the Old Covenant between Jews and God is eternal, exempting Jews from the need of Christian conversion for receiving salvation. ====Radical taditionalist Catholics==== Despite the growing acceptance of the dual-covenant theology among Christians, the strongest opponents of it are the radical traditionalist Catholics who have significant influence over Catholic churches worldwide, making supersessionism a difficult issue to discuss. Many radical traditionalist Catholics are reported to be Holocaust deniers, * * * * * who have a huge presence on Reddit's subreddits r/Catholicism (240K members) and r/AskAChristian (21K members), while Reddit has been long been criticized for uncontrolled antisemitism. * * * * * ====Christian Identity movement==== A similar, or somewhat overlapping, Christian movement that upholds supersessionism is the Christian Identity (CI) movement, whose followers believe that White people to be the \"real\" descendants of ancient Israelites with whom God have a covenant. * * * * * The Southern Poverty Law Center (SPLC) estimated in 2023 that the CI movement had 10 active groups in the United States.The 10 active groups of the CI movement in 2023 are as follows (place names in brackets are their headquarters' locations): * Assembly of Christian Israelites (Milford, Ohio) * Christogenea (Panama City Beach, Florida) * Church of Israel (Schell City, Missouri) * Covenant People’s Ministry (Brooks, Georgia) * Euro Folk Radio (Chicago, Illinois) * Fellowship of God’s Covenant People (Union, Kentucky) * Kingdom Identity Ministries (Harrison, Arkansas) * Mission to Israel Ministries (Scottsbluff, Nebraska) * Sacred Truth Publishing and Ministries (Mountain City, Tennessee) * Scriptures for America Worldwide Ministries (Laporte, Colorado) ===Non-Christian examples=== ====Black Hebrew Israelites==== Black Hebrew Israelites (BHI) is a modern movement promoting the pseudoscientific belief that African Americans are allegedly the real descendants of ancient Israelites, with some of their factions also seeing Native and Latino Americans as the descendants of ancient Israelites. Their belief is shared by the Nation of Islam (NOI) led by Louis Farrakhan, * * * * * * * * * which is one of the most influential groups among Black Americans. Alberta Williams King, the mother of Martin Luther King Jr., was shot and killed on June 30, 1974 at the age 69 by Marcus Wayne Chenault, a 23-year-old Black man from Ohio subscribed to the theology of a BHI preacher called Hananiah E. Israel of Cincinnati. The assassin had reportedly shown interest in a group called the \"Hebrew Pentecostal Church of the Living God\". Israel, Chenault's mentor, castigated Black civil rights activists and Black church leaders as being evil and deceptive, but claimed in interviews not to have advocated violence. Chenault did not draw any such distinction, and first decided to assassinate Rev. Jesse Jackson in Chicago, but canceled the plan at the last minute. The BHI have also been involved in domestic terrorism towards American Jews since the 1970s, the most recent of which include but not limited to the 2019 Jersey City shooting (7 dead and 3 injured) and the Monsey Hanukkah stabbing (1 dead and 4 injured). * * * * * * Fran Markowitz, a professor of cultural anthropology at the Ben-Gurion University of the Negev, wrote that the BHI's view on the African slave trade conflicts with historical accounts, as does the BHI's belief that Socrates and William Shakespeare were black. Most BHI factions were classified as hate groups by at least two civil rights groups, including but not limited to the SPLC and Anti-Defamation League (ADL). The ADL noted, On the other hand, political observer Ralph Lenoard further analyzed the BHI, Antisemitic BHI factions include but not limited to the Israelite School of Universal Practical Knowledge (ISUPK), House of Israel (HOI), Nation of Yahweh (NOY), Israelites Saints of Christ, True Nation Israelite Congregation and The Israelite Church of God in Jesus Christ (ICGJC). The ADL documented some antisemitic slurs used by the BHI: ==Related pages== * Society of Saint Pius X * The Protocols of the Elders of Zion * Roman Catholics and antisemitism in the 21st century ==Other websites== * Christian Persecution of Jews over the Centuries * 12 Anti-Semitic Radical Traditionalist Catholic Groups * Antisemitism in History: From the Early Church to 1400 * The Evil of Replacement Theology: The Historical Abuse of the Jews by the Church * The Building of a Wall of Separation between New Testament Theology and Its Jewish Roots/Context: A Consideration of Early Church History and a Call for Re-Examination for 21st Century Everyday Theological Reality ==References== Category:Bias Category:Racism Category:Religion Category:Christianity Category:Catholicism Category:Antisemitism Category:Jewish people",
 "title": "Supersessionism"
}