{
 "id": "75247",
 "text": "This is a list of Romanian composers. * Anton Pann (1790s–1854), wrote Romania's national anthem * Ciprian Porumbescu (1853–1883), 19th century composer * George Enescu (1881–1955), 20th century composer, violinist, pianist; spent much of his career in France * Grigoraş Dinicu (1889–1949), 20th century composer best known for his violin showpiece Hora staccato * Martian Negrea (1893–1975), composer, teacher and conductor. His creation involves all musical formes and genres and is distinguished by a personal melodic inspiration. * Sabin Dragoi (1894–1968), composer and folklorist, is one of pioneers of scientific gathering of Romanian folklore. * Theodor Rogalski (1901–1954), composer, conductor and pianist, he had composed chamber and symphonic music. He is one of the biggest Romanian masters of orchestration. * Paul Constantinescu (1909–1963), 20th century composer, best known for religious and vocal music, also wrote music for Romanian films * Tiberiu Brediceanu (1877-1968)-was a Romanian composer and folklorist; * Anatol Vieru (1926–1998), winner of the Herder Prize in 1986, his creation includes symphonic, chamber and choral music. * Ion Ivanovici (1845-1902),was the composer of The Waves of Danube waltz; * Gheorghe Cucu (1882-1932), was a Romanian folklorist and composer; * Filaret Barbu (1903-1984), was a Romanian composer, well known for the operetta Ana Lugojana; * Constantin Dimitrescu (1847-1928), was the composer of Peasant Dance. * Ion Voicu (1923-1997), was a Romanian violinist; * Sergiu Celibidache ( 1912-1996 )-was a Romanian composer and conductor; * Constantin Silvestri (1913-1969),was a composer, who lived in England; * Alexander Flechtenmacher (1823-1829),was not a Romanian composer, but lived in Romania; he composed the operetta Baba Harca * Eduard Caudella (1841-1924)-wrote the first Romanian opera, Petru Rares * Teodor Teodorescu -was the composer of the a cappella work Cucul * Mihail Jora (1891-1971)-was the Parent of Romanian ballet;important works:Intoarcerea din adancuri, La piata etc. * Dinu Lipatti (1917-1950) was a great Romanian pianist; * Nicolae Kirculescu (1903-1985) was a Romanian musician. He composed theatre and film music, amongst which \"Plutasul pe *Bistriţa\", the theme of Teleenciclopedia. * George Grigoriu (1927-1999) was the composer of The Waves of the Danube operetta; * Nicolae Bretan (1887–1968) was an Romanian opera composer, also baritone, conductor and critic. * Paraschiv Oprea (1937-2004) was a Romanian conductor, musician and composer; * Cornel Trăilescu (1926-)is an Romanian opera composer and conductor. * Doina Rotaru (1951-) is a Romanian composer of mostly orchestral and chamber works that have been performed throughout the world. * Cristian Matei (1977-) is a Romanian composer. Matei studied at the National University of Music in Bucharest, film music composition. * George Balint (1961-) is a Romanian composer. * Vladimir Cosma (1940-) is a composer and violinist, born in Bucharest, Romania. * Liviu Dănceanu (1954-)is a Romanian composer; * Dimitrie Cuclin (1885-1978) was a Romanian classical music composer, musicologist, philosopher, translator, and writer. * Valentin Gheorghiu (1928-) is a Romanian pianist and composer; * Ludovic Bacs (1930-) is a Romanian composer, conductor and instrumentalist; * Johnny Răducanu (1931-) is a Romanian jazz composer and conductor; * Matei Socor (1908-1980) was a composer and musician; * Mircea Hoinic (1910-1986) was a composer and conductor; * Ionel Perlea (1900-1970)-was a Romanian composer and conductor; * Cornel Ţăranu (1934-) is a Romanian composer from Cluj-Napoca; * Bogdan Bradu (1968-) is a Romanian composer, singer and violinist; * Octavian Nemescu (1940-) is a Romanian composer of orchestral, chamber, choral, electroacoustic, multimedia, metamusic, imaginary, and ritual works that have been heard throughout Europe and elsewhere. * Pascal Bentoiu (1927-) is a Romanian Modernist composer. Category:Lists of composers *",
 "title": "List of Romanian composers"
}