{
 "id": "75274",
 "text": "thumb |right|250px|The remnants of Hurricane Nora over the Southwestern United States. An Arizona hurricane is a tropical cyclone forming in the eastern Pacific Ocean that affects the state of Arizona in the United States. Usually, the storm makes landfall in the Mexican states of Baja California or Sonora, with the remaining moisture normally having mild rainfall effects on the state. However, a few storms have crossed into Arizona while they still had tropical storm strength. It is extremely difficult for a hurricane to form in Arizona because the normal storms that form in the eastern Pacific Ocean move either parallel or away from the Pacific coast of Northwestern Mexico. As a result, most storms that could affect Arizona, are carried away from the United States, and only 6% of all Pacific hurricanes enter US territory. In average, Arizona experiences the effects of tropical cyclones once every five years. Many, but not all, of these systems also affected California. Tropical storms are one of Arizona's main sources of rainfall, and they infuse the monsoon over the southwestern United States. However, all of the storms that have impacted Arizona have formed in the latter parts of the Pacific hurricane season, and no storm has affected the state before August. Storm Peak intensity Season Intensity Date Unnamed Unknown 1921 Remnant low August 20, 1921 Unnamed Unknown 1921 Tropical depression September 30, 1921 Unnamed Unknown 1926 Remnant low September 20, 1926 Unnamed Unknown 1927 Remnant low September 7, 1927 Unnamed Unknown 1935 Tropical storm August 22, 1935 Unnamed Tropical Storm 1951 Tropical storm August 3, 1951 Unnamed Category 1 1958 Tropical storm October 6, 1958 Claudia Tropical Storm 1962 Tropical storm September 25, 1962 Emily Category 1 1965 Remnant low September 6, 1965 Katrina Category 1 1967 Tropical storm August 29, 1967 Hyacinth Tropical Storm 1968 Tropical depression August 20, 1968 Norma Tropical Storm 1970 Remnant Low Labor day Joanne Category 2 1972 Tropical storm October 4, 1972 Kathleen Category 1 1976 Tropical storm September 10, 1976 Liza Category 4 1976 Remnant low October 2, 1976 Doreen Category 1 1977 Tropical storm August 13, 1977 Heather Category 1 1977 Tropical depression October 4, 1977 Octave Tropical Storm 1983 Tropical storm September 28, 1983 Raymond Category 3 1989 Tropical depression October 5, 1989 Boris Category 1 1990 Remnant low June 11, 1990 Lester Category 1 1992 Tropical storm August 22, 1992 Ismael Category 1 1995 Remnant low September 15, 1995 Nora Category 4 1997 Tropical storm September 25, 1997 Isis Category 1 1998 Remnant low September 5, 1998 Marty Category 2 2003 Remnant low September 22, 2003 Javier Category 4 2004 Remnant low September 20, 2004 John Category 4 2006 Remnant low September 5, 2006 Julio Tropical Storm 2008 Tropical Storm August 25, 2008 Jimena Category 4 2009 Remnant low September 5, 2009 ==Deadly storms== Some of these tropical cyclones have caused deaths or a lot of property damage, usually because of flooding created by rain. In August of 1935, the remnants of an unnamed tropical storm that landed on southern California causing heavy rains and flooding across Arizona, especially along the Santa Cruz River and Rillito Creek on Southern Arizona. The rainfall due to the storm still holds the record rainfall at the National Weather Service office in Tucson. In September of 1970, the remnants of Tropical Storm Norma became Arizona's deadliest storm when they contributed to the disaster known as the \"Labor Day storm of 1970\". As Norma dissipated, moisture from the cyclone was captured in a large extratropical low. The resulting rainfall created deadly floods that killed 23 people and caused huge damages. Two years later, the remnants of Hurricane Joanne caused flooding that created damages up to $10 million (1972 USD) and eight deaths. On September 11, 1976, Hurricane Kathleen killed a man when a gust of wind blew a palm tree down onto his mobile home. Strong flooding and hailstorms also resulted. A weather system, including moisture from Tropical Storm Octave, caused heavy rains over a ten-day period. Fourteen people drowned, 975 were injured, and roughly 10,000 people were left homeless when the flooding ended. The amount of damage from the disaster was put at 370 million (year unknown) USD. ==References== hurricanes Category:Weather lists *Arizona hurricanes, List of",
 "title": "List of Arizona hurricanes"
}