{
 "id": "752766",
 "text": "\"Better Off Ned\" is the 16th episode of the 31st season of The Simpsons. It was first shown on television on the Fox network on March 15, 2020. In the episode, Homer becomes Nelson's mentor to make Bart jealous when Ned takes care of him. The episode was dedicated to Max von Sydow who died on March 8, 2020. He guest starred in the episode \"The War of Art\" as Klaus Ziegler. == Plot == Bart's grandpa tells him a war story and pranks him with a fake grenade. Bart takes the grenade to school and pranks them, causing everyone to run away. Ned Flanders throws himself on the grenade as a sacrifice and to save everyone. Superintendent Chalmers is going to suspend Bart from school, but Ned wants to take care of him with his three P's: persistence, prayer, and persistent prayer. At the Flanders house, Ned goes to take Bart fishing. When Bart catches a fish, Ned teaches him how to roast it in a fire. Bart also joins a church choir and everyone in the church congratulate Ned for making Bart a better person. This makes Homer jealous. Homer walks around the city and finds Nelson Muntz at a landfill crying because of what is going on at his home. Homer brings him to Krusty Burger and says that he will be his mentor, so that he can make Bart jealous. Lisa says that Homer should go to a counselor because he ends up causing problems. The therapist Homer goes to disagrees with what Homer tries. Homer finds Nelson's mother who asks if he will leave Nelson, like a lot of men did in the past. Homer tries to tell Nelson about it, but he gets sad and plans revenge on Bart. At the Christian Pride Parade, Nelson tries to start a praying hands machine in order to crush Bart with the hands. Homer sees Nelson and pushes Bart away, getting crushed by the hands. Homer and Bart ride in the ambulance together. Homer apologizes to Nelson and lets Ned take him as a mentor. == Reception == Dennis Perkins of The A.V. Club gave the episode a score of C- and said that \"'Better Off Ned' isn’t just a lousy half-hour (minus commercials, minus three episode-ending tags in place of any sort of resolution) of The Simpsons because it’s double- dipping on the same premise. It’s a truly lousy episode because it fairly rings with indifference, glib cruelty, and enough lamp-shading of creative exhaustion to serve as platonic ideal for late-run ‘is that show still on?’ disposability.\" Den of Geek gave the episode a 3 out of 5 stars and says \"'Better Off Ned' is sweet but feels like a doughnut where the creamy middle has been sucked out. It doesn’t quite miss the edge as much as it dulls it. The opportunities are here for sharper comedy, but the episode cuts across the surface.\" == References == == Other websites == * Category:The Simpsons (season 31) episodes Category:2020 television episodes",
 "title": "Better Off Ned"
}