{
 "id": "752751",
 "text": "The Batura Muztagh is a group of mountains in the Karakoram mountain range. It was what is called a subrange, or a smaller mountain range inside of a larger one. It is located in Gilgit-Baltistan, in Pakistan. Batura Muztagh is the most western of the Karakoram subranges. It runs from Chalt village in Bar Valley in the east to Kampir Dior in the Kurumbar Valley in the west. This subrange included Muchu Chhish, which is the second highest unclimbed mountain in the world. == Selected mountains == Mountain Height (m) Height (ft) Coordinates Prominence (m) Parent mountain First ascent Ascents (attempts) Batura Sar 7,795 25,574 3,118 Distaghil Sar 1976 4 (6) Shispare 7,611 24,970 1,240 Batura Sar 1974 3 (1) Passu Sar 7,476 24,528 645 Batura Sar 1994 1 (0) Ultar Sar 7,388 24,239 700 Shispare 1996 2 (5) Sangemarmar Sar 7,000 22,966 1,100 Pasu Sar 1984 1 (3) Bublimotin (Ladyfinger Peak) 6,000 19,685 <200 Hunza Peak 1982 2 (5) == Books and maps about Batura Muztagh == *High Asia: An Illustrated History of the 7000 Metre Peaks by Jill Neate, *Batura Mustagh (sketch map and pamphlet) by Jerzy Wala, 1988. *Orographical Sketch Map of the Karakoram by Jerzy Wala, 1990. Published by the Swiss Foundation for Alpine Research. == Related pages == * List of Highest Mountains of the World == Notes == # This data is from the Himalayan Index and is not always correct. In particular it is not clear if Batura Sar has really had four ascents or only three. # Sometimes called Batura I. # Sometimes called Ultar II or Bojohagur Duanasir II. # Also known as Sang-e-Marmar (or Sangemarmar), and sometimes as Marble Peak. # The heights given for this peak vary between 6949 m and 7050 m. # This elevation is approximate. == References == == Other websites == * *A clickable map of the Batura Muztagh *DEM files for the Himalaya (Corrected versions of SRTM data; look for the \"Batura Sar\" tile) Category:Karakoram Category:Mountains of Gilgit-Baltistan",
 "title": "Batura Muztagh"
}