{
 "id": "752953",
 "text": "Halloween Ends is a 2022 American slasher movie directed by David Gordon Green and written by Green, Danny McBride, Paul Brad Logan and Chris Bernier. It is based on characters created by John Carpenter and Debra Hill. It is a sequel to 2021's Halloween Kills, the thirteenth movie in the Halloween franchise. The movie stars Jamie Lee Curtis and Nick Castle returning to their roles as Laurie Strode and Michael Myers. Andi Matichak, Will Patton, and Kyle Richards also star. Filming began in Savannah, Georgia on January 10, 2022. Halloween Ends released on October 14, 2022 by Universal Pictures. ==Plot== On Halloween night in 2019, 21-year-old Corey Cunningham is babysitting a young boy named Jeremy, who pulls a prank on Corey by locking him inside the attic. Just as Jeremy's parents come home, Corey kicks the door open and accidentally knocks Jeremy over a staircase railing to his death. Corey is accused of intentionally killing Jeremy but is cleared of manslaughter. Three years later, the town of Haddonfield, Illinois is still reeling from the aftermath of Michael Myers's latest extended killing spree in 2018, while Michael has vanished. Laurie Strode is writing a memoir, having bought a new house and living with Allyson, her granddaughter, who is now a nurse. Meanwhile, Corey is working at his stepfather's salvage yard. On his way home one day, he is taunted by high school bullies and injures himself in the process. An observing Laurie brings him to the doctor's office where Allyson works. Allyson and Corey develop a relationship and later attend a Halloween party, where Corey is confronted by Jeremy's mother. Corey leaves the party and runs into the bullies, who throw him off a bridge. Dragged into the sewers by an unknown figure, he wakes up and is confronted by Michael, who has been living there for the past four years. After holding him by the throat, Michael lets Corey go. On the way out, Corey is confronted by a homeless man and takes out a knife previously given to him by Laurie. In a struggle, Corey stabs the man to death and flees. Corey and Allyson go on a dinner date, but Allyson's ex- boyfriend, police officer Doug Mulaney, shows up and harasses them both. Corey later lures the cop into the sewer. Michael emerges and although in a weakened state murders Doug to Corey's delight. Corey decides to become a new boogeyman figure and to take vengeance upon anyone who wronged him and Allyson. Allyson is passed over for a promotion at work, in favor of a fellow nurse who is having an affair with the doctor. Corey then kills the doctor at his home while the nurse is killed by Michael, who followed Corey. An unknowing Allyson plans to leave Haddonfield with an insistent Corey because of the past trauma, while Laurie becomes increasingly suspicious of Corey after he begins mimicking Michael's behavior. After finding him sleeping in the spot Jeremy died, Laurie offers to help him on the condition he leaves Allyson alone. Corey retorts by blaming her for the events that have occurred in Haddonfield and says if he cannot have Allyson, no one will. On October 31, Corey returns to the sewers and successfully fights a still-weak Michael for his mask. Meanwhile, Laurie and Allyson argue as she plans to leave and Allyson, too, blames Laurie for Michael's actions. That night, Corey embarks on a rampage, murdering the bullies after luring them to the salvage yard. In the confusion, Corey's stepfather is also accidentally killed. He then goes on to kill his mother, as well as the DJ and receptionist at the radio station. Back at the Strode house, Laurie faux-attempts suicide to lure Corey to her, whom she shoots down the stairs. Corey then stabs himself in the neck to frame Laurie for his death in front of the arriving Allyson. Michael suddenly arrives to retrieve his mask and kills Corey. During a fight between Laurie and Michael, Laurie stabs Michael in the hands, pinning him to the table. She stabs him in the chest and neck before removing his mask and slitting his throat, but he breaks one arm free and strangles her before Allyson arrives and breaks his arm. Laurie slices his wrist, finally killing him. Laurie and Allyson take his body to the salvage yard by police escort, attracting the residents of Haddonfield, who follow them in a procession, and dispose of it in an industrial shredder. In the ensuing days, Allyson and Laurie reconcile, and Allyson leaves Haddonfield while Laurie finishes her memoir and rediscovers her romance with Deputy Hawkins. ==Cast== * Jamie Lee Curtis as Laurie Strode, a survivor of Michael Myers's 1978 killing spree and Allyson's grandmother. * Andi Matichak as Allyson Nelson, Laurie's granddaughter. * Will Patton as Deputy Frank Hawkins, a sheriff's deputy who arrested Michael following his initial killing spree in 1978. * Rohan Campbell as Corey Cunningham, a young man accused of murdering a child while he babysat, leading to him becoming a pariah in Haddonfield. * Kyle Richards as Lindsey Wallace, one of the children Laurie babysat in 1978. * James Jude Courtney as Michael Myers / The Shape, the masked figure who carried out a horrific massacre on Halloween night in 1978, returned to Haddonfield for another killing spree forty years later in 2018. **Nick Castle, who portrayed the character in the original 1978 movie, provides voiceover work for Myers's breathing and makes a cameo appearance in a party scene. Also appearing in the movie are Jesse C. Boyd as Officer Mulaney, Allyson's ex-boyfriend; Joanne Baron as Joan Cunningham, Corey's overbearing mother; Rick Moose as Ronald, Corey's stepfather who owns the salvage yard; Michael Barbieri as Terry, leader of the gang of bullies who target Corey; Destiny Mone as Stacy, Joey Harris as Margo, and Marteen as Billy, members of Terry's gang; Michael O'Leary as Dr. Mathis, Allyson's boss at the local hospital; Michele Dawson as Deb, Allyson's coworker who is having an affair with Dr. Mathis; Keraun Harris as Willy the Kid, a local radio DJ; Jaxon Goldberg as Jeremy Allen, a young boy who dies while Corey is babysitting him; Candice Rose and Jack William Marshall as Mrs. and Mr. Allen, Jeremy's parents; Omar Dorsey as Sheriff Barker, Haddonfield's current sheriff. Additionally, Diva Tyler briefly reprises her role as Sondra Dickerson, who was thought to have been killed in Halloween Kills, while Jibrail Nantambu also reprises his role as Julian Morrisey, a young boy who escaped from Michael's killing spree, from the 2018 movie. ==Notes== ==References== Category:2022 movies Category:2022 horror movies Category:Universal Pictures movies Category:Halloween movies Category:Halloween (franchise) movies Category:American horror movies Category:Movies set in 2018 Category:Sequel movies Category:Movies set in Illinois Category:Movies directed by David Gordon Green",
 "title": "Halloween Ends"
}