{
 "id": "753001",
 "text": "Jugend musiziert is a very common music competition for children's and young people in Germany and Austria. Almost a million children's and young people have in 57. years participated at Jugend Musiziert. For many of them, this was the first step in a very successful music career. == Jugend musiziert in Germany == In Germany, the nationwide competition includes children and adolescents up to the age of 21, for singing and organ up to the age of 27. It serves the musical location, the comparison with others and the promotion. The participants may not yet be in a musical vocational training (full course) or professional practice. The participants play pieces of music from different eras. The length of the lecture depends on the age group and the requirements in the individual categories and ranges from 10 to 20 minutes. The competition is divided into three phases: First, it is held at regional level, in around 140 regions in Germany and at around 30 German schools in other European countries. Bearer of a “1st Prizes at regional level ”are“ passed on ”to the respective national competition (a German school in Northern, Western and Southern Europe also holds its own national competition) and winner of a“ 1. State level ”at the appropriate minimum age for the federal competition. The solo and ensemble categories change every three years. The “classical” orchestral instruments formed the foundation of “Jugend musiziert” from the very beginning. In 1970 the piano was added, later drums, plucked instruments and vocal categories. In 2009 the solo category \"Bass (Pop)\" was introduced, followed by \"Guitar (Pop)\" and \"Vocals (Pop)\". The most recent expansion in 2015 was the solo category \"Special Instrument\", with a chopping board and baglamas. It will be offered as an ensemble category for the first time in 2016. In 2015, “Jugend musiziert” had more than 20,000 participants nationwide. Around 7,500 of them were forwarded to the state competitions; almost 2,400 first state prize winners took part in the federal competition. The nationwide competition, which was held for the first time in 1964, is sponsored by the German Music Council. Leading associations are: Federal Association of Music Lessons, Federal Association of German Orchestra Associations, German Tonkünstlerverband (DTKV), Jeunesses Musicales Deutschland (JMD), Association of German Music Schools (VdM). Jugend musiziert is funded by the Federal Ministry for Family, Seniors, Women and Youth, the local umbrella organizations, the municipalities and as the main sponsor of the Sparkassen-Finanzgruppe. In 2020, all state competitions and the federal competition in Freiburg were canceled for the first time in the 57-year history of Jugend musiziert music because of the COVID-19 Virus. == Jugend musiziert in Austria == The Austrian competition was founded in 1969 by F. Knoppek in Leoben as an instrumental and vocal competition for young people from Austria and South Tyrol aged 10–21 (for brass instrument players, double bass and bassoon up to 23, for singers aged 16–26) . It takes place every two years - since 1975 with preselection in so-called \"state competitions\" in the state capitals and the \"federal competition\" in Leoben. Participants are delegated from all Austrian federal states. The Tyrolean delegation also includes participants from South Tyrol. In the Austrian competition, the number of participants rose from 235 in 1969 to over 2000 from 1989. The representatives of the federal states worked out reform proposals (annual implementation, division into a more funding-oriented basic competition and a top competition based on the professional training standard, inclusion of missing instruments and instrumentation, introduction of a binding “compulsory piece” from the 20th century, etc.). In 1993 the competition was last held nationwide under the old name. As an alternative, the federal states and the federal ministries concerned with the aspects of youth, school and university as well as music funding founded the organization Musik der Jugend, which organizes the Prima la musica competition. In Leoben itself, the sponsoring association continued to hold smaller competitions under the name \"Jugend musiziert\" it protected in the following years, albeit limited to individual categories and at irregular intervals. == References == == Other websites == * Jugend musiziert (official Homepage) * Jugend musiziert - Federal state board Baden-Württemberg * Jugend musiziert - Federal state board Bavaria * Jugend musiziert - Federal state board Berlin * Jugend musiziert - Federal state board Brandenburg * Jugend musiziert - Federal state board Hesse * Jugend musiziert - Federal state board Mecklenburg-Vorpommern * Jugend musiziert - Federal state board Lower Saxony * Jugend musiziert - Federal state board North Rhine-Westphalia * Jugend musiziert - Federal state board Rhineland- Palastinate * Jugend musiziert - Federal state board Saarland * Jugend musiziert - Federal state board Saxony * Jugend musiziert - Federal state board Saxony-Anhalt * Jugend musiziert - Federal state board Schleswig- Holstein * Jugend musiziert - Federal state board Thuringia Category:Austrian culture Category:German music Category:Music competitions",
 "title": "Jugend musiziert"
}