{
 "id": "75319",
 "text": "The iPhone is a series of smartphones made by Apple Inc. since 2007. It is a mobile phone, meaning that it makes calls and sends text messages without wires. There are many types of iPhones. The iPhone can access the Internet as well, either using a cellular network or over Wi-Fi. Like an iPod, it can play music and videos that have been downloaded from the Internet directly, or which have been put on it by connecting it to a personal computer. After years of rumors and speculation, it was officially announced on January 9, 2007, at Macworld, and launched later that year. The iPhone does not have as many buttons as other phones, such as those made by companies like Motorola and Nokia. Instead, it has a touch screen that covers much of the front of the phone. People control the phone by touching the screen. All iPhones run on a mobile operating system which Apple calls \"iOS\". A new version of iOS comes out every year, each having more features than the one before. Each new iPhone comes with the latest version of iOS, and older iPhones usually also get a software update to the latest version. == Models == The first iPhone, iPhone 2G was released on June 29, 2007. In the first month on sale it sold 2.315 million units. On July 11, 2008, the iPhone 3G was released which was upgraded with 3G wireless internet. On June 17, 2009, Apple released the iPhone 3GS which featured a compass and a 3.2-megapixel video camera. On June 24, 2010 the iPhone 4, was released. It has the forward camera included, which is placed on the screen and allows taking self-portraits. This camera is less advanced than the back camera, but can be used for video-telephone, where people talking can see each other on the screen. Additionally, it has an updated operating system that allows quicker navigation of all the features. It has more pixels (326 ppi; 960×640) on the screen than previous version of the iPhone. A minor upgrade to the iPhone 4 was the iPhone 4S. It came on October 14, 2011, and had a new feature called Siri, which is a voice activation system. It is able to record videos in 1080p resolution. The iPhone 5 was released on September 21, 2012. Two new iPhones called the 5C and 5S were released on September 20, 2013. The iPhone 5S has a new unlocking system called Touch ID which reads your fingerprint. The iPhone 5C is a cheaper model of the iPhone 5S which is also the first iPhone available in different colors that aren't black and white. The iPhone 6 and iPhone 6 Plus were released on September 19, 2014. They both have bigger screens than the iPhone 5, measuring at 4.7 inches and 5.5 inches, respectively. A new iPhone has come out each year since 2016. == Jailbreaking == Some people \"jailbreak\" their iPhones to allow them to do more things. Apple does not allow many of these changes. In hopes of discouraging this, Apple voids the warranty when an iPhone is \"unlocked\" or \"jailbroken.\" In August 2011 jailbreaking was declared legal. == Apps == Apple made a Software Development Kit for the iPhone, which lets people make their own software for it. However, the software cannot be sold without Apple's permission. The software that is made is sold at the App Store. More than a million apps are available to buy. == Emergency alerts == Another feature that is being added to almost every iPhone in the world is an Emergency Alert notification system. For most countries, the standard Emergency warning signal will sound in an event of a worldwide disaster. It consists of of 853hz and 960hz sine waves which will signal in a pattern. ==References== == Other websites == * Apple iPhone - Official website Category:Messaging",
 "title": "IPhone"
}