{
 "id": "753347",
 "text": "Kuyavian-Pomeranian Voivodeship is one of the 16 voivodeships of Poland. The capitals are Bydgoszcz and Toruń. == Administrative division == The Kuyavian- Pomeranian Voivodeship is divided into 23 counties (powiats): 4 city counties and 19 land counties. These are further divided into 144 gminas. English and Polish names Area (km²) Population (2007)\"Population size and structure by territorial division as of December 31, 2007\", GUS, Warsaw 2008, .pdf Seat Other towns Total gminas City counties City counties City counties City counties City counties City counties Bydgoszcz 175 361,222 1 Toruń 116 206,619 1 Włocławek 84 118,432 1 Grudziądz 58 99,090 1 Land counties Land counties Land counties Land counties Land counties Land counties Inowrocław County powiat inowrocławski 1,225 164,571 Inowrocław Kruszwica, Janikowo, Gniewkowo, Pakość 9 Bydgoszcz County powiat bydgoski 1,395 99,386 Bydgoszcz * Solec Kujawski, Koronowo 8 Świecie County powiat świecki 1,473 97,037 Świecie Nowe 11 Toruń County powiat toruński 1,230 91,963 Toruń * Chełmża 9 Włocławek County powiat włocławski 1,472 85,303 Włocławek * Brześć Kujawski, Kowal, Lubraniec, Izbica Kujawska, Chodecz, Lubień Kujawski 13 Nakło County powiat nakielski 1,120 85,050 Nakło nad Notecią Szubin, Kcynia, Mrocza 5 Brodnica County powiat brodnicki 1,039 75,204 Brodnica Jabłonowo Pomorskie, Górzno 10 Żnin County powiat żniński 985 69,736 Żnin Barcin, Łabiszyn, Janowiec Wielkopolski 6 Lipno County powiat lipnowski 1,016 66,063 Lipno Skępe, Dobrzyń nad Wisłą 9 Aleksandrów County powiat aleksandrowski 476 55,367 Aleksandrów Kujawski Ciechocinek, Nieszawa 9 Chełmno County powiat chełmiński 528 51,412 Chełmno 7 Tuchola County powiat tucholski 1,075 47,310 Tuchola 6 Mogilno County powiat mogileński 676 46,833 Mogilno Strzelno 4 Golub-Dobrzyń County powiat golubsko-dobrzyński 613 45,111 Golub-Dobrzyń Kowalewo Pomorskie 6 Rypin County powiat rypiński 587 44,143 Rypin 6 Radziejów County powiat radziejowski 607 41,972 Radziejów Piotrków Kujawski 7 Sępólno County powiat sępoleński 791 40,990 Sępólno Krajeńskie Więcbork, Kamień Krajeński 4 Grudziądz County powiat grudziądzki 728 38,559 Grudziądz * Łasin, Radzyń Chełmiński 6 Wąbrzeźno County powiat wąbrzeski 501 34,763 Wąbrzeźno 5 * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county * seat not part of the county == References == Category:Kuyavian-Pomeranian Voivodeship",
 "title": "Kuyavian-Pomeranian Voivodeship"
}