{
 "id": "75354",
 "text": "Verizon Ladies First Tour Tour by Beyoncé Knowles, Alicia Keys & Missy Elliott Supporting album B.K. - Dangerously in Love Start date March 12, 2004 End date April 18, 2004 Legs 1 Shows 24 Beyoncé Knowles tour chronology Dangerously in Love World Tour (2003r./2004r.) Verizon Ladies First Tour The Beyoncé Experience (2007r.) Verizon Ladies First Tour is a 2004 joint concert tour by American R&B;/soul singers Beyoncé and Alicia Keys and American rapper Missy Elliott. ==Tour dates== Date City Country Venue United States United States United States United States March 12, 2004 Ft. Lauderdale, Florida United States National Car Rental Center March 14, 2004 New Orleans, LA United States New Orleans Arena March 15, 2004 Dallas, TX United States Americans Airlines Center March 17, 2004 San Antonio, Texas United States SBC Center March 18, 2004 (Beyoncé only) Houston United States Reliant Stadium March 21, 2004 Greensboro, NC United States Greensboro Coliseum March 23, 2004 Philadelphia, PA United States Wachovia Center March 24, 2004 Boston, MA United States Fleet Center March 26, 2007 Hampton, VA United States The Coliseum March 27 2004 Charlotte, NC United States Charlotte Coliseum March 28, 2004 Atlanta, GA United States Philips Arena March 30, 2004 Cleveland, OH United States Gund Arena April 01, 2004 Minneapolis, MN United States Target Cen April 02, 2004 Chicago, IL United States Allstate Arena April 03, 2004 Detroit, MI United States Palace at Auburn Hills April 04, 2004 St. Louis, MO (Date Cancelled) United States Savvis Center April 06, 2004 Pittsburgh, PA United States University of Pittsburgh Arena April 09, 2004 Hartford, CT United States Civic Center April 10, 2004 Uniondale, NY United States Nassau Coliseum April 11, 2004 Washington, DC United States MCI Center April 12, 2004 New York City, NY United States Madison Square Garden April 15, 2004 Phoenix, AZ United States America West Arena April 16, 2004 Las Vegas, NV United States Mandalay Bay April 17, 2004 Anaheim, CA United States The Pond April 18, 2004 Oakland, CA United States Oakland Arena Category:2004 in the United States Category:Alicia Keys Category:Beyoncé concert tours",
 "title": "Verizon Ladies First Tour"
}