{
 "id": "753507",
 "text": "\"Thanksgiving of Horror\" is the 8th episode of the 31st season of The Simpsons. It was first shown on television on the Fox network on November 24, 2019. The episode is a Thanksgiving themed spin-off of the Treehouse of Horror series. This is the last episode to have Russi Taylor because she died on July 26, 2019. She was a voice actor for characters like Martin Prince, Sherri and Terri, and Üter Zörker. == Plot == Marge gets on a stage and talks about how scary the Thanksgiving holiday is. She then introduces the three segments. === A-Gobble-Ypto === This part of the episode is a parody of Apocalypto. The Simpson family and other characters are shown as turkeys and some are shown as Pilgrims. The Pilgrims capture Homer and many other turkeys. Bart gets away from the Pilgrims. Most of the turkeys are killed, but people start to panic when Grandpa runs around without his head. During the confusion, Bart saves Homer and they get back to their family. Marge lays an egg, but they are found by Chief Wiggum, a Pilgrim. A bear kills Wiggum and the egg hatches to show Maggie. The family finds some Pilgrims eating a turkey dinner. Homer says that times will be dark for them as Thanksgiving becomes a new human tradition. === The Fourth Thursday After Tomorrow === This part of the episode is a parody of the Black Mirror special \"White Christmas\". Homer wants to help Marge with Thanksgiving cooking for dinner, so Homer orders an A.I. with Marge's memories. Marge gets jealous when the A.I. can run the family better than her, so she wants to get rid of the A.I. after Thanksgiving. The A.I. cooks a big meal for dinner, which Marge says she cooked it, and tries to escape to the internet. Marge almost stops her, but the A.I. uses Maggie to help her. The A.I. tells the guests at the dinner party that she cooked the dinner, which makes everyone disappointed and leave the dinner party. Homer tries to make Marge feel better, but he accidentally shows himself as a robot. The A.I. is free and visits places around the internet, starting with Etsy. === The Last Thanksgiving === This part of the episode is a parody of the movies Alien and Life. The kids are on a spaceship, years after the Earth was destroyed. They become awake from hibernation to work before they land on another planet. Bart and Milhouse want to create a Thanksgiving dinner, but they only find a can of cranberry sauce. Bart puts the can in a cloning machine. The cranberry sauce turns alive and starts eating bones. Soon, every kid in the spaceship is dead, except for Bart, Lisa, Milhouse, and Martin. Martin traps them in a room and gets killed by the monster. Milhouse tries to make the monster calm down, but it throws him around. Bart and Lisa trick the monster into letting go of Milhouse and putting it in a large can. They then release the can into space, where it lands on the new planet. Aliens from the planet turn the monster into food, where the Simpson family and the aliens celebrate the First Thanksgiving. The end credits show a Bart Simpson balloon from the Macy's Thanksgiving Day Parade. == Reception == Dennis Perkins of The A.V. Club gave the episode a score of B and says \"'Thanksgiving of Horror' represents the show's writers tossing out a 'Why not?' non-canonical scary story do-over. And, oddly enough, I'm fine with it, especially since this second, Thanksgiving-themed horror outing is scarier, meaner, grosser, and all-around better than this year's original.\" Den of Geek gave the episode a 4 out of 5 starts and says \"The installment doesn’t quite measure up to the classic \"Treehouse of Horror\" episodes, the show overall has undergone a loss of edge since becoming more streamlined. But it is a very good entry for the season.\" On February 1, 2020, Dan Vebber won the Writers Guild of America Award for Outstanding Writing in Animation at the 72nd Writers Guild of America Awards for writing the episode. == References == == Other websites == * Category:2019 television episodes Category:The Simpsons (season 31) episodes Category:Thanksgiving television episodes Category:Treehouse of Horror",
 "title": "Thanksgiving of Horror"
}