{
 "id": "75364",
 "text": "Ciara Princess Harris (born October 25, 1985) professionally known as Ciara, is an American singer, songwriter, record producer, dancer, and actress. == Music career == In 2004, Ciara released her debut studio album Goodies, which produced three hit singles: \"Goodies,\" \"1, 2 Step,\" and \"Oh.\" The album was certified triple platinum by the Recording Industry Association of America (RIAA), and earned her four nominations at the 48th Grammy Awards. She released her second studio album, Ciara: The Evolution, in 2006 which spawned the hit singles \"Get Up,\" \"Promise,\" and \"Like a Boy.\" The album reached number one in the US and was certified platinum. Her third studio album Fantasy Ride, released in 2009, was considerably less successful than Ciara's first two albums. However, it produced the worldwide top-ten hit \"Love Sex Magic\" featuring Justin Timberlake, which earned her a Grammy Award nomination for Best Pop Collaboration with Vocals. The following year, Ciara released her fourth studio album Basic Instinct, which was met with low sales and continued a downward trend in her commercial success. In 2011, she signed a new record deal with Epic Records, and she released her fifth studio album, Jackie, which is preceded by the lead single, \"Sorry” in 2015. In 2019, she released her sixth studio album, Beauty Marks, which is preceded by the hit lead singles, \"Level Up\", “Thinkin Bout You” and the album titled song “Beauty Marks “. ==Personal life== On Ciara's 28th birthday, Future asked her if she would marry him. They became engaged but was the engagement was called off in August 2014 due to his infidelity. Their son, Future Zahir Wilson was born on May 19, 2014. In March 2015, she met Seattle Seahawks NFL star quarterback Russell Wilson and publicly dating this year. The two became engaged in March 2016 and married at Peckforton Castle in Cheshire, England four months later. They have three children together, Sienna Princess (born 2017), Win Harrison (born 2020) and Amora Princess (born 2023). ==Discography== * Goodies (2004) * Ciara: The Evolution (2006) * Fantasy Ride (2009) * Basic Instinct (2010) * Ciara (2013) * Jackie (2015) * Beauty Marks (2019) ==Tours== ;Headlining * 2006: The Evolution Tour * 2007: Screamfest '07 (with T.I.) * 2009: Jay-Z & Ciara Live (with Jay-Z) * 2010: Basic Instanct Tour * 2015: Jackie Tour * 2019: Beauty Marks Tour ;Supporting act * 2005: Harajuku Lovers Tour 2005 * 2007: Good Girl Gone Bad Tour * 2009: The Circus Starring Britney Spears * 2010: Summerbeatz ==References== Category:1985 births Category:Living people Category:Actors from Austin, Texas Category:African-American actors Category:African-American singers Category:American dancers Category:American movie actors Category:American record producers Category:American Grammy Award winners Category:Singer-songwriters from Texas Category:American composers Category:American contemporary R&B; singers Category:American dance musicians Category:American funk singers Category:American hip hop musicians Category:American hip hop singers Category:American models Category:American pop singers Category:Mezzo-sopranos Category:Musicians from Atlanta Category:Musicians from Austin, Texas Category:Singers from Georgia (U.S. state) Category:American sopranos Category:Warner Bros. Records artists Category:American crunk singers",
 "title": "Ciara"
}