{
 "id": "753963",
 "text": "Child care, otherwise known as day care, is the care and supervision of a child or group of children. The age of children in child care range from six weeks to thirteen years. A person who does child care is called a child carer. Learning it might come naturally, or be an acquired skill. Looking after children might be stressful and come with difficulties. It can involve caring for multiple children. Usually child care that can look after (supervise) more children is more difficult and would cost more. It involves multiple people with different jobs and roles like in pregnancy. In professional child care, this might be one person cooking food, feeding them food, another reading books, singing, supervision during sleeping (naps), and sports or running around. Child care can involve many different types of midwifery and nurses. It is a job (employment) and skill. A babysitter is a child carer. Children might learn childcare as a skill from siblings. Child care is the action of supervising young children professionally, usually done with help and supervision. When having two or more carers is not possible, parent contact usually happens more, but supervision of the carer is a secondary way to provide child safety. Emergency services numbers with easy access to a telephone are useful in emergencies, such as to call an ambulance or police. == Goals == The main focus of child care is to provide monitoring and safety to the child, and helping the development of the child, acting as the guardian and giving support to the child. Protection as well as the safe environment are designed to protect the child during time in safety. But the goal of the environment is allowing sensory and physical activity too. This is to meet the needs of the children or child in day care. The emotional ability (for example with colours) and physical needs in the formative years can absorb a lot of resources. Child care providers can be children's first teachers. Quality care from a young age can have a huge impact on the future success of children. Others say that the absence of parents (replacing them with paid workers) leads to abnormal development in children. Preschool (before school) learning is similar to this. Child care can sometimes be educational for the time to be spent learning as well as stimulating senses and creative outlets for children. Children (especially those that are young) can be developing mentally, socially (learning how to act with people), and psychologically (developing in the mind). During childhood, physical development happens, and the child is developing mentally and learning (\"the child's brain is like a sponge\"). Mental development and learning continues until the person reaches the age of 25. == Roles in child care == It is done for example in a day-care center, with nannies, maids, etc. Postpartum care may involve an auxiliary nurse midwife and monthly nurse, and other midwifes. The husband can have a role in child care. His help involves transporting the children to daycare and back, dressing and feeding them, for the child to be nurtured. == Related pages == * Mother and babysitting * Midwifery * Postpartum care ==References== Category:Lifestyles Category:Family Category:Home Category:Pediatrics Category:Occupations Category:Domestic work",
 "title": "Child care"
}