{
 "id": "754112",
 "text": "Shohreh Aghdashloo () (born Pari Vaziri-Tabar; May 11, 1952) is an Iranian actress. Her first major part was in 1977 on the movie The Report. She became well known for her part in House of Sand and Fog which she was considered for Academy Award for Best Supporting Actress. Aghdashloo currently has a starring role in The Expanse. In 2013, she wrote a book about herself called The Alley of Love and Yellow Jasmines. == Early life == Aghdashloo was born in Tehran, Iran. Her parents were Effie al-Sadat and Anushiravan Vaziri-Tabar and she has three brothers: Shahram, Shahriar and Shahrokh. At the age of 19, Aghdashloo married painter Aydin Aghdashloo in 1972. During this time, she went to classes on theater even though her parents did not approve. She and Aydin divorced in 1979 when she left Iran for England during the Iranian Revolution. She went to Brunel University and earned a Bachelor's degree in international relations. Later, she moved to Los Angeles to pursue her acting career. She later became a U.S. Citizen. In 1987, she married actor and playwright Houshang Touzie. She was born to a Muslim family, but says she never practiced the religion. == Filmography == === Films === Year Title Role Notes 1976 Shatranje Bad 1977 The Report 1978 Sooteh-Delan Aghdas 1989 Guests of Hotel Astoria Mrs. Pori Karemnia First American film role 1991 Raha Raha 1993 Twenty Bucks Ghada Holiday 2000 Surviving Paradise Pari First English language Iranian-American feature film distributed theatrically in the United States, written and directed by Kamshad Kooshan 2001 America So Beautiful Exiled Actress 2002 Maryam Mrs. Homa Armin 2003 Possessed Woman Short film by Shirin Neshat Pulse Woman Mystic Iran Narrator Documentary film by Aryana Farshad House of Sand and Fog Nadereh 'Nadi' Behrani Independent Spirit Award for Best Supporting FemaleLos Angeles Film Critics Association Award for Best Supporting ActressNational Society of Film Critics Award for Best Supporting Actress (3rd place) New York Film Critics Circle Award for Best Supporting Actress Online Film Critics Society Award for Best Supporting ActressNominated – Academy Award for Best Supporting Actress Nominated – Vancouver Film Critics Circle Award for Best Supporting Actress 2005 The Exorcism of Emily Rose Dr. Sadira Adani Babak and Friends – A First Norooz Farah Animated film 2006 American Dreamz Mrs. Nazneen Riza The Lake House Dr. Anna Klyczynski X-Men: The Last Stand Dr. Kavita Rao The Nativity Story Elizabeth 2008 The Sisterhood of the Traveling Pants 2 Professor Nasrin Mehani The Stoning of Soraya M. Zahra Khanum Satellite Award for Best Actress – Motion Picture 2010 The Adjustment Bureau The Chairman (Role was cut from finished version) The No Game Aunt Laila 2011 Iranium Narrator Documentary film by Alex Traiman On the Inside Dr. Lofton 2012 The Odd Life of Timothy Green Evette Onat 2013 Percy Jackson: Sea of Monsters The Oracle Voice role Silk Rani Short film by Catherine Dent 2014 Rosewater Moloojoon Still Here Farzaneh Short film by Ethan Rains 2015 Last Knights Maria Septembers of Shiraz Habibeh 2016 Star Trek Beyond Commodore Paris Window Horses Mehrnaz Animated film The Promise Marta Boghosian 2018 A Simple Wedding Ziba Husseini 2020 Run Sweetheart Run 2023 Renfield Bellafrancesca Lobo === Television === Television Year Title Role Notes 1990 Matlock Saleslady Episode: \"Nowhere to Turn\" 1993 Martin Malika Episode: \"Jerome's in the House\" 2001 The Honduran Suburbs Zereshk 2 episodes 2004 The Secret Service Lila Ravan Television film 2005 24 Dina Araz 12 episodes: Day 4 Gold Derby TV Award - Best Drama Supporting Actress Nominated – Satellite Award for Best Supporting Actress – Series, Miniseries or Television Film 2006 Smith Charlie 7 episodes Will & Grace Pam Episode: \"Cowboys and Iranians\" Curious George Hat Salesperson Episode: \"The Clean, Perfect Yellow Hat\" ER Mrs. Riza Kardatay Episode: \"Lost in America\" 2007 Grey's Anatomy Dr. Helen Crawford Episode: \"Scars and Souvenirs\" 2008 House of Saddam Sajida Talfah 4 episodes Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie Nominated - Gold Derby TV Award - Best Miniseries/TV Movie Supporting Actress The Simpsons Mina Episode: \"MyPods and Boomsticks\" 2009 FlashForward Nhadra Udaya 3 episodes 2011 Law & Order: Special Victims Unit Detective Saliyah \"Sunny\" Qadri Episode \"Dirty\" House M.D. Afsoun Hamidi Episode: \"Moving On\" NCIS Mariam Bawali Episode: \"Safe Harbor\" 2012 Portlandia Nelofar Jamshidi Episode: \"Cool Wedding\" The Mob Doctor Dr. Lauren Baylor 3 episodes 2013 Grimm Stefania Vaduva Popescu 7 episodes 2014 Believe Mrs. Delkash Episode: \"Origin\" Bones Azita Vaziri Episode: \"The Cold in the Case\" Scorpion Dr. Cassandra Davis Episode: \"True Colors\" 2015 Elementary Liliane Bellerose Episode: \"Tag, You're Me\" 2015–2022 The Expanse Chrisjen Avasarala Main role 6 seasons 2016 Pearl Arlene TV film 2017 The Punisher Farah Madani 4 episodes 2019 The Lion Guard Queen Janna Voice Role; 4 episodes 2019– Impulse Fatima 2 episodes === Video games === Video Games Year Game Character 2010 Mass Effect 2 Admiral Shala'Raan vas Tonbay (voice) 2012 Mass Effect 3 2014 Destiny Lakshmi-2 (voice) 2017 Destiny 2 === Audio === Year Title Role Notes 2019 The Two Princes Queen Attosa Audio drama == References == Category:1952 births Category:American movie actors Category:Iranian movie actors Category:Living people",
 "title": "Shohreh Aghdashloo"
}