{
 "id": "75417",
 "text": "Syed Pervez Musharraf (11 August 1943 – 5 February 2023) was a Pakistani politician and Four-star general of the Pakistan Army. He was a military dictator and the tenth President of Pakistan from 20 June 2001 to 18 August 2008, when he resigned to avoid impeachment. Previously, he was Chief Executive of Pakistan as well as Chief of Army Staff of the Pakistan Army. He took over power in Pakistan in 1999, by removing the elected government of Nawaz Sharif. He has charged with multiple murders in April 2013 and was given bail in October 2013. Then he was arrested again. In 2019, Musharraf was sentenced to death in absentia over his treason charges. Syed Pervez Musharraf was born on 11 August 1943 in Delhi, British India. Musharraf was raised in Karachi and Istanbul. He studied mathematics at Forman Christian College in Lahore and was also educated at the Royal College of Defence Studies in the United Kingdom. Musharraf entered the Pakistan Military Academy in 1961. He was Commissioned to the Pakistan Army in 1964. He played an active role in the Afghan Civil War. Musharraf saw action during the Indo-Pakistani War of 1965 as a second Lieutenant. By the 1980s, he was commanding an artillery brigade. In the 1990s, Musharraf was promoted to major general and assigned an infantry division. He later commanded the Special Services Group. Soon after, he served as Deputy military secretary and Director General of Military Operations. Musharraf rose to national prominence when he was promoted to a Four-star general by Prime minister Nawaz Sharif in 1998. This made Musharraf the head of the armed forces. He led the Kargil infiltration that almost brought India and Pakistan to a full-fledged war in 1999. On 5 February 2023, Musharraf died due to amyloidosis. He was 79. He had been hospitalised a year prior due to the disease. His body is set to be returned to Pakistan from Dubai on 6 February. == References == Category:1943 births Category:2023 deaths Category:Politicians from Karachi Category:Pakistani generals Category:People from Delhi Category:Pakistani Muslims Category:Presidents of Pakistan Category:Former dictators",
 "title": "Pervez Musharraf"
}