{
 "id": "754195",
 "text": "The modern Republic of India (Hindi: ); has several official National symbols including a historical document, a flag, an emblem, an anthem, a memorial tower, as well as several national heroes, etc. All the symbols were picked up at various times. The design of the national flag was officially adopted by the Constituent Assembly just 21 days before Independence, on the 24th of July in 1947. There are also several other patriotic symbols including the national mammal, bird, fruit, flower, tree, etc. These have all been selected carefully to project the image of to reflect Indian culture and beliefs and also the positive tributes often associated with Indian traditions respectively. ==Other Indian National and Official symbols== Symbol Name Image References National personification Bharatmata Bharat Mata's third temple will be built in Kurukshetra, 5 acres of land will be near Jyotisar National flag Flag of India National emblem Coat of Arms of India National motto Satyameva Jayate Father of the Nation Mohandas Karamchand Gandhi Mother of the Nation Sarojini Naidu National patron saint Sai Baba of Shirdi National hero Bal Gangadhar Tilak What is Swaraj? . Retrieved on July 12, 2007. National poet Rabindranath Tagore National anthem Jana Gana Mana National song Sare Jahan se Accha National slogan Vande Mataram National War Cry Jai Hind National days Independence Day (India) Republic Day (India) National language Hindi Indian English Official language Languages of India National Map Map of India On 250th birthday, Survey of India wants to shed its cloak of secrecy, Indian Express. National deity Shiva National weapon Trishula National epic Mahabharata Religious symbol Ashoka Chakra Religion in India National book Bhagavad Gita 100px National colours Saffron, White, Green (national flag) Sky blue (sports) National passport Indian passport National airline Air India National currency Indian rupee National dresses Sari, Dhoti Indian clothes - Traditional Indian Dhoti, Dhoti Kurta, How to Wear a Dhoti, How to Tie Dhoti National movie studio Bollywood National calendar Indian national calendar Meghnad Saha National flower Indian Lotus National tree Banyan tree National fruit Mango National vegetable Indian pumpkin National dish Khichdi National spice Turmeric National crop Rice National beverage Lassi National confectionery Laddu National pets Indian spitz Blue-winged parakeet National dove Asian emerald dove Jacobin pigeon Seymour, Rev. Colin (Ed)(2006) Australian Fancy Pigeons National Book of Standards. National horse breed Marwari horse National donkey breed Halari Donkey National chicken breed Kadaknath National cattle breed Nagpuri (buffalo) Brahman cattle National goat breed Magra sheep Jamnapari goat \"2.3 Goat Breeds\". National dog breed Indian pariah dog National mammal Indian elephant National bird Blue peafowl National marine mammal South Asian river dolphin National social mammal Langur National bird of prey Brahminy kite 100px National mammal of prey Asiatic lion National big cat Bengal tiger National aquatic bird Sarus crane National reptile King cobra National butterfly Kaiser-i-Hind National fish Indian mackerel National amphibians Himalayan newt Purple frog National insect Giant forest scorpion National oceanic animals Whale shark Indian Ocean humpback dolphin National microorganism Lactobacillus bulgaricus National fossil Asian Straight-tusked Elephant National wild pig Indian boar Lydekker, R. (1900), The great and small game of India, Burma, & Tibet, London : R. Ward, pp. 258-266 National river Ganga river National mountain Nanda Devi Garhwal- Himalaya-Ost, 1:150,000 scale topographic map, prepared in 1992 by Ernst Huber for the Swiss Foundation for Alpine Research, based on maps of the Survey of India. National lake Lake Nakki National mineral Iron ore National gemstone Blue Sapphire National sport Field hockey National dance Bharata Natyam National instrument Veena National fort Red Fort Cultural heritage Elephanta Caves National shrine Ajmer Sharif Dargah Cultural heritage Taj Mahal National shrine Swaminarayan Akshardham (Delhi) National shrine Palitana Jain Temples \"Murtipujakas, Jainism\", Encyclopedia of World Religions (PHILTAR), University of Cambria National shrine Mahabodhi Temple National shrine Golden Temple National mosque of India Jama Masjid, Delhi National park Janeshwar Mishra Park National memorial Gandhi Smriti National stadium Jawaharlal Nehru Stadium (Delhi) National monument India Gate National library National Library of India National museum National Museum of India National passageway Gateway of India National beating retreat or flags lowering ceremony Joint-drill parade ==Related pages== * National symbols of Bangladesh * National symbols of Pakistan ==References== ==Other websites== * The Government of India * Top 23 National symbols of India in Hind * Ministry of Culture, Sports and Youth Affairs Category:National symbols of India Category:National coats of arms",
 "title": "National symbols of India"
}