{
 "id": "754114",
 "text": "The Iranic peoples also sometimes called Iranian peoples, are a ethno- linguistic group who speak Iranian languages, a branch of the Indo-European languages. Modern Iranic peoples include: The Gilaks, Balochs, Kurds, Lurs, Mazanderanis, Ossetians, Tats, Talyshs, Pashtuns, Pamiris, Farsis, Nuristani, Wakhis, and Gilaks. Historical Iranic peoples include the; Alans, Scythians,: \"SCYTHIANS, a nomadic people of Iranian origin (...)\" : \"[B]oth Cimmerians and Scythians were Iranian peoples.\" : \"During the first half of the first millennium B.C., c. 3,000 to 2,500 years ago, the southern part of Eastern Europe was occupied mainly by peoples of Iranian stock [...] [T]he population of ancient Scythia was far from being homogeneous, nor were the Scyths themselves a homogeneous people. The country called after them was ruled by their principal tribe, the \"Royal Scyths\" (Her. iv. 20), who were of Iranian stock and called themselves \"Skolotoi\" (...)\" : \"[T]rue Scyths seems to be those whom [Herodotus] calls Royal Scyths, that is, the group who claimed hegemony [...] apparently warrior-pastoralists. It is generally agreed, from what we know of their names, that these were people of Iranian stock (...)\" : \"The physical characteristics of the Scythians correspond to their cultural affiliation: their origins place them within the group of Iranian peoples.\" : \"The Scythian kingdom [...] was succeeded in the Russian steppes by an ascendancy of various Sarmatian tribes — Iranians, like the Scythians themselves.\" : \"The general view is that both agricultural and nomad Scythians were Iranian.\" : \"The majority of the “Eastern” Iranian tribes – Scythians, Alani, Massagetae, Sakas, Chorasmians, Sogdians – remained on the territory of south-eastern Europe and in Central Asia.\" Dahae, Sakas,: \"The majority of the “Eastern” Iranian tribes – Scythians, Alani, Massagetae, Sakas, Chorasmians, Sogdians – remained on the territory of south-eastern Europe and in Central Asia.\" Medes, Bactrians, Sogdians,: \"The majority of the “Eastern” Iranian tribes – Scythians, Alani, Massagetae, Sakas, Chorasmians, Sogdians – remained on the territory of south-eastern Europe and in Central Asia.\" Sarmatians, Parthians, Persians, Khwarezmians,: \"The majority of the “Eastern” Iranian tribes – Scythians, Alani, Massagetae, Sakas, Chorasmians, Sogdians – remained on the territory of south-eastern Europe and in Central Asia.\" Cimmerians.: \"CIMMERIANS, a nomadic people, most likely of Iranian origin (...)\" : \"[B]oth Cimmerians and Scythians were Iranian peoples.\" ==References== *BORJIAN, Habib. \"NORTH IRANIC PEOPLES IN THE ENCYCLOPÆDIA IRANICA.\" NARTAMONGæ (2019): 413. * *Gregoratti, Leonardo. \"The kings of Parthia and Persia: some considerations on the ‘Iranic’ Identity in the Parthian Empire.\" Dabir 1.1 (2015): 14-16. *Toops, Stanley. \"The Population Landscape of Xinjiang/East Turkestan.\" Inner Asia 2.2 (2000): 155-170. *Gnoli, Gh. \"Iranic Identity as a historical problem: the beginnings of a national awareness under the Achaemenians.\" The East and the Meaning of History (1992): 147-167. *Lambton, Ann KS. \"Persia.\" Journal of the Royal Central Asian Society 31.1 (1944): 8-22. *Lohrasp, G. \"Some remarks on Farabi's background: Iranic (Soghdian/Persian) or (Altaic)?.\" (2009). *صدرا, علیرضا. \"Making Discourse and Realization, Monitoring of Islamic–Iranic Progress' Olgou (executive necessaries of Olgou and Political Plans).\" سیاست متعالیه 10.38 (2022). *Waghmar, Burzine. \"Settled rather than saddled Scythians: the easternmost Sakas.\" (2020): 639-649. *Gregoratti, Leonardo. \"The journey east of the Great King: East and West in the Parthian kingdom.\" The Journey East of the Great King: East and West in the Parthian kingdom (2013): 43-52. *Khudaverdyan, A. Yu. \"A bioarchaeological analysis of the population of the Armenian Highland and Transcaucasus in the Antiquity.\" The Mankind Quarterly 53.1 (2012): 3-35. *Foltz, Richard. The Ossetes: Modern-day Scythians of the Caucasus. Bloomsbury Publishing, 2021. *Watson, William. \"The Chinese contribution to eastern nomad culture in the pre‐Han and early Han periods.\" World Archaeology 4.2 (1972): 139-149. *Kümmel, Martin Joachim. \"“Prothetic h-” in Khotanese and the reconstruction of Proto-Iranic.\" Script and Reconstruction in Linguistic History. *Sharkey, Benjamin. \"Predators and Prey: Cosmological Perspectivism in Scythian Animal Style Art.\" Arts. Vol. 11. No. 6. MDPI, 2022. *Turchin, Peter. \"A theory for formation of large empires.\" Journal of Global History 4.2 (2009): 191-217. *Farrokh, Kaveh. \"Lion and Sun Emblem of Iran, a Pictorial Historical Analysis Historical Analysis in 3 Parts Part 3: Qajars and After.\" *Bekhrad, Joobin. \"Kiss my lips: Female poets in the Persian language.\" TLS. Times Literary Supplement 6099 (2020): 28-29. *Sharif, Nemat. \"A Brief History of Kurds and Kurdistan: Part I: From the Advent of Islam to AD 1750.\" The International Journal of Kurdish Studies 10.1/2 (1996): 105. *Lee, Joo-yup. \"The Sogdian Descendants in Mongol and post-Mongol Central Asia: The Tajiks and Sarts.\" Acta Via Serica 5.1 (2020): 187-198. *Ethington, Michael David. \"The Hunnic Dilemma: Between Identity and Environmental- Economic Crises.\" Journal of Asian Civilizations 44.2 (2021): 109-120. *Turchin, Peter, Thomas E. Currie, and Edward AL Turner. \"Mapping the spread of mounted warfare.\" Cliodynamics 7.2 (2016). *Waghmar, Burzine. \"Settled rather than saddled Scythians: the easternmost Sakas.\" (2020): 639-649. *Scarborough, Matthew JC. \"Bactrian χϸονο ‘(calendar) year,(regnal) year’.\" Journal of the Royal Asiatic Society 31.3 (2021): 599-607. *BORJIAN, Habib. \"NORTH IRANIC PEOPLES IN THE ENCYCLOPÆDIA IRANICA.\" NARTAMONGæ (2019): 413. *Grønbech, Kaare. \"The steppe region in world history. II.\" Acta Orientalia 24 (1959): 14-14. *Salvatori, Sandro. \"Bactria and Margiana seals: a new assessment of their chronological position and a typological survey.\" East and West 50.1/4 (2000): 97-145. *Häberl, Charles. \"Balaybalan.\" (2015). *Mengal, Mir Aqil Khan. \"\" THE BARKI TRIBE AND LANGUAGE.\" Mut̤ālaʻah-yi Pākistān 2 (1991): 83. *Ethington, Michael David. \"The Hunnic Dilemma: Between Identity and Environmental-Economic Crises.\" Journal of Asian Civilizations 44.2 (2021): 109-120. * Kovalevskaia, V. B \"Central Ciscaucasia in Antiquity and Early Middle Ages: Caucasian Substratum and Migrations of the Iranic-Speaking Tribes.\" (1988). ==Further reading== * Balanovsky, Oleg, et al. \"Deep phylogenetic analysis of haplogroup G1 provides estimates of SNP and STR mutation rates on the human Y-chromosome and reveals migrations of Iranic speakers.\" PLoS One 10.4 (2015): e0122968. Category:Ethnic groups in Asia",
 "title": "Iranic peoples"
}