{
 "id": "754225",
 "text": "Daylesford is a town in Victoria, Australia. It is in the foothills of the Great Dividing Range, within the Shire of Hepburn, and about 108 kilometres north-west of Melbourne. The town was first settled in 1852 as a gold-mining town. There were 2,548 people living in Daylesford in 2016. The area around the town, including Hepburn Springs to the north, is known for its natural spring mineral spas. Over 80 per cent of Australia's sparkling mineral water is found in this area. Daylesford is one of Australia's few spa towns. Many people visit for the spas, as well as the restaurants and galleries. It is also the filming location for the third season of The Saddle Club. The area was the home of the Djadja Wurrung Aborigines. Farmers began to move into the district in 1838. In 1848, Irish immigrant John Egan took up land on the future town site then known as Wombat Flat. He and a party of searchers found gold in 1851 on land now covered by Lake Daylesford. This started a local gold rush. More gold was found around the area. The town site was surveyed and founded in 1852. At first the town was called Wombat, and later renamed Daylesford. In 1859 there were 3400 people digging for gold. The post office opened on 1 February 1858 and a telegraph office was opened in August 1859. Daylesford was declared a municipality in 1859 and a borough in the early 1860s. By the 1860s all the alluvial gold had been found. Large mines were built to get the gold that was found underground in the quartz reefs. Mining continued until the 1930s. In later years Daylesford became associated as being a fashionable spa resort, this ended during the Great Depression. In the 1990s it became fashionable again. The Daylesford Magistrates' Court closed on 1 January 1990. == Climate == Daylesford is above sea level. It has a cooler, wetter climate than Melbourne. Summer (January–February) temperatures range from . July temperatures are cold, ranging from about to . Annual precipitation, occasionally falling as snow, averages about . In some years, rainfall has been as low as to over in other years. == Economy == The Daylesford-Hepburn Springs area, has 65 mineral springs. This is more than 80 per cent of Australia’s known mineral water springs. As a result, there are a number of spa developments including Hepburn Bathhouse &amp; Spa, Mineral Spa at Peppers Springs Retreat and Salus Spa, Lake House. The town holds a number of annual events, including the ChillOut Festival in March each year, the largest gay and lesbian festival in rural and regional Australia; the Harvest Week Festival; the lavender festival; and the Hepburn Springs Swiss Italian Festival celebrating the town's Swiss-Italian heritage. Major industries in the economy of Daylesford today are healthcare, accommodation and food, and retail trade. The town has several primary schools and one public secondary school, Daylesford Secondary College. The secondary college began as a mining school in 1890. Other schools include Daylesford Primary School, St. Michael's Primary School, and Daylesford Dharma School. == Transport == The Midland Highway runs directly through the town. It links to Castlemaine in the north and Ballarat in the south-west. The railway to the town closed in 1978. The railway layout at Daylesford station was unusual in that the lines from Creswick and Carlsruhe both entered the station from the same end. The Daylesford Spa Country Railway currently operates a Sunday tourist service to Musk and Bullarto along the line towards Carlsruhe. == Sport == The town has an Australian Rules football team which plays in the Central Highlands Football League. There is also the Daylesford and Hepburn United Soccer Club also known as the Saints .The Saints have won four league titles in their 20-year history along with two cup finals. == Notable people == * David Bromley - (born 1960), artist, worked in Daylesford * Karl von Möller - Movie director and cinematographer (15 Daly Street until 2012) * Michael Leunig - Cartoonist * Eugene von Guerard - Painter * (captain) John Stuart Hepburn - early pastoralist and landholder * John Egan - early pastoralist and landholder * Joseph Furphy - Novelist * George Raymond Johnson - Architect (designed the Daylesford Town Hall) * David Allison - Politician * Keith Bradbury - Politician * Peter Corrigan - Architect * Josh Cowan - AFL football * Bessie Lee Cowie - Social reformer * Charlie Foletta - VFL football * Jack Gervasoni - VFL football * Chris Grant - AFL football * Lynda Heaven - Politician * Merv Hobbs - VFL football * Samuel Johnson - Actor * Peter Loney - Politician * Cecily Maude O'Connell - Trade unionist and religious social worker * Charlie Pannam (footballer, born 1874) - Football * Ambrose McCarthy Patterson - Painter and printmaker * Alfred Cecil Rowlandson - Publisher * Edward Russell - Trade unionist * Jack Stevens - Major General (Australian Army) * Abigail Wehrung - Basketball * Carl Willis - VFL football and cricket * Sir Charles Hotham - State governor * Ferdinand von Mueller - Botanist == Gallery == File:Daylesford ca1908.jpg|Daylesford circa 1908 File:2009-Jul- Daylesford- 003 (3689249371).jpg|Park in autumn == References == == Sources == * Daylesford Advocate, Mercury, Express, Mercury-Express. 1859-1870 == Other websites == * Category:Towns in Victoria (Australia)",
 "title": "Daylesford, Victoria"
}