{
 "id": "754365",
 "text": "State symbols of the United Kingdom, is a list of the National symbols of the United Kingdom. This includes its constituent countries (England, Scotland, Wales and Northern Ireland). Each entry has its own set of unique Symbols respectively. British things which are emblematic, representative or otherwise characteristic of Great Britain or British culture. Some are established, official symbols; for example, the Royal Arms of England, which has been codified in heraldry. Other symbols may not have official status, for one reason or another, but are likewise recognised at a National or International level. == Symbols of England == English trait consist of symbols to represent Anglican traditions and ideals that reflect the different aspects of the cultural life and history. There are also several other symbols including the national animal, bird, flower and tree etc... State Symbols of England England Saint George's Cross Royal Arms of England (French) \"God and my right\" Patron saint St. George National symbol Tudor Rose State icon Big Ben State animal Barbary lion State bird Barn owl State flower Rose State tree Royal oak English breed English Bulldog Folk costume Anglican Clothing English tartan Saint George's Tartan State dance English dance State instrument Guitar State dish Fish and Chips State sport Cricket == Symbols of Scotland == Scottish trait includes symbols to represent Scottish and Celtic/Gaelic traditions and ideals that reflect the different aspects of the cultural life and history. There are also several other symbols including the national animal, bird, flower and tree etc... State Symbols of Scotland Scotland Saint Andrew's Cross Royal Arms of Scotland In Defens (Scots) \"In Defence\" Patron saint St. Andrew National symbol Scottish thistle /Unicorn State icon Edinburgh Castle State animal Scottish Red deer State bird European Golden eagle State flower Bluebell State tree Scottish pine Scottish breed Scottish Terrier Folk costume Highland traditional dress Scottish tartan Saint Andrew's Tartan/Kilts State dance Scottish dance State instrument Bagpipe State dish Haggis State sport Shinty == Symbols of Wales == Welsh trait includes symbols to represent Welsh and Celtic traditions and ideals that reflect the different aspects of the cultural life and history. There are also several other symbols including the national animal, bird, flower and tree etc... State Symbols of Wales Wales Saint David's Cross Royal Arms of Wales Pleidiol Wyf I'm Gwlad\" (Cymraeg) \"In Defence\" Patron saint St. David National symbol Welsh leek /Welsh DragonSee example of dragon supporter Elizabethan Heraldry; \"Heralds and Heraldry in Elizabethen England\"; accessed 6 September 2010 State icon Caerphilly Castle State animal Welsh Mountain sheep State bird Red kite State flower St. Peter's Leek (Dafodil) State tree Durmast oak Welsh breed Corgi Folk costume Traditional Welsh costume Welsh tartan Saint David's Tartan/Kilts State dance Welsh dance State instrument Triple harp State dish Cawl State sport Handball ==References== Category:National symbols of the United Kingdom",
 "title": "List of British national symbols"
}