{
 "id": "75441",
 "text": "Second Life is the biggest online virtual world. It was launched in 2003 by Linden Lab, a Californian software company founded by Philip Rosedale. It is made up of a large number of regions or islands, which can belong to continents. The users are called residents, and technically, they are avatars.An avatar is a picture, or a 3D character, representing a person on the Internet. The piece of software used to log on to Second Life is called a viewer. Some people use this multi-user virtual environment (MUVE) for entertainment purposes, though it is not a game because it does not have any single goal that players must achieve. Other people use it to work or to study. Anyone is free to do anything they want, as long as they respect the Terms of Service. They are also free to create new things and add them to the virtual world. Players can make a lot of different things, including buildings, clothes, and landscapes. This is why Second Life is considered a platform, too.In computing, a platform can mean something which is used as a base from which you make things. Second Life regions are classified as: * general, which must not have nudity or other sexually explicit content. Institutions such as universities, conference organizers, and real-world businesses usually own general regions. * moderate, which host most of the non-adult activities common in Second Life, such as dance clubs, bars, stores and malls, galleries, music venues, beaches, and parks. * adult, which have sexually explicit or violent content, and where minors are not allowed. Many things that people can do in Second Life are about real life. For instance, some universities and companies use Second Life for education and training, including Stanford University, Indiana University and University of Western Australia. Second Life can also be used for foreign language teaching by language educators. English as a foreign language has gained a presence through several schools, such as the British Council. Two popular places where Second Life users meet to practice English are Virtlantis and Cypris Chat. A list of educational projects, which also include some language schools, can be found in the Second Life wiki. ==Related pages== *Active Worlds *IMVU == References == == Other websites == * Official site Category:2003 establishments Category:2003 video games Category:Free online games Category:Linux games Category:MacOS games Category:Massively multiplayer online games Category:Online games Category:Open-world video games Category:Video games developed in the United States Category:Windows games",
 "title": "Second Life"
}