{
 "id": "754666",
 "text": "The American Go Association (AGA) was founded in 1935, and it is responsible to promote and manage the board game of Go in the United States of America. It is also a member of the International Go Federation. ==AGA Activities== The AGA publishes a weekly online newsletter, The American Go E-Journal, and an annual Yearbook. They maintains a national rating system and organizes national events, The US Go Congress and AGA City League. They also select North American representatives in international tournaments;For example, AGA is sending players to the World Amateur Go Championship and the World Youth Go Championship. and support their members as they promote Go in their communities. AGA also holds a youth summer camp that includes instruction from professional players. == AGA Professional System== In December 2011, The AGA made a new professional players system for the US and Canada. Their certification system is open to US and Canadian citizens via invitation. In recognition of this movement, several Asian professional tournaments have invited AGA professionals. ===AGA Professional Players=== Professional status in Go is valid for life unless the player retires (This is also same in Japan and other Asian countries). The dates below indicate when the players were granted the AGA professional status. *2012: Andy Liu 1P and Gansheng Shi 1P *2014: Calvin Sun 1P *2015: Ryan Li 1P *2016: Eric Lui 1P ==Related pages== * British Go Association * European Go Federation * International Go Federation * Nihon Ki-in (Japanese counterpart of AGA) * Kansai Ki-in * Female Go players == References == ==Other websites== * Official site * The American Go E-Journal * AGA Yearbook * AGA ratings * US Go Congress * US Go Summer Camps for Kids category:Board games category:Non-profit organizations of the United States category:Sports organizations of the United States category:1935 establishments in the United States Category:Go organizations",
 "title": "American Go Association"
}