{
 "id": "754999",
 "text": "The Senate Committee on Rules and Administration, also called the Senate Rules Committee, is in charge of the rules of the United States Senate, administration of congressional buildings, monitoring elections and deciding whether or not the members should be there. ==What it does== Rule XXV of the United States Senate says that all legislation, messages, petitions, memorials, and other matters relating to the following subjects is to be given to the Senate Rules Committee: # Administration of the Senate Office Buildings and the Senate wing of the Capitol, including deciding where members' offices will be; # Congressional organization relative to rules and procedures, and Senate rules and regulations, including floor and gallery rules; # Corrupt practices; # Credentials and qualifications of Members of the Senate, contested elections, and acceptance of incompatible offices; # Federal elections generally, including the election of the President, Vice President, and Members of the Congress; # Government Printing Office, and the printing and correction of the Congressional Record, as well as those matters provided for under rule XI; # Meetings of the Congress and attendance of Members; # Payment of money out of the contingent fund of the Senate or creating a charge upon the same (except that any resolution relating to substantive matter within the jurisdiction of any other standing committee of the Senate shall be first referred to such committee); # Presidential succession; # Buying books and manuscripts and creating monuments to the memory of individuals; # Senate Library and statuary, art, and pictures in the Capitol and Senate Office Buildings; # Services to the Senate, including the Senate restaurant; and, # United States Capitol and congressional office buildings, the Library of Congress, the Smithsonian Institution (and the incorporation of similar institutions), and the Botanic Gardens. ==Members, 116th Congress== Majority Minority * Roy Blunt, Missouri, Chairman * Mitch McConnell, Kentucky * Richard Shelby, Alabama * Pat Roberts, Kansas * Lamar Alexander, Tennessee * Ted Cruz, Texas * Shelley Moore Capito, West Virginia * Roger Wicker, Mississippi * Deb Fischer, Nebraska * Cindy Hyde-Smith, Mississippi * Amy Klobuchar, Minnesota, Ranking Member * Dianne Feinstein, California * Chuck Schumer, New York * Dick Durbin, Illinois * Tom Udall, New Mexico * Mark Warner, Virginia * Patrick Leahy, Vermont * Angus King, Maine * Catherine Cortez Masto, Nevada ==Related pages== * Committees of the United States Senate ==Notes== ==References== ==Other websites== * Official site (Archive) * Senate Rules and Administration Committee. Legislation activity and reports, Congress.gov. Rules and Administration Category:1867 establishments in the United States",
 "title": "United States Senate Committee on Rules and Administration"
}