{
 "id": "755399",
 "text": "The following is a list of deaths that should be noted in November 2020. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non- humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==November== ===1=== *Carol Arthur, 85, American actress (Making It, Blazing Saddles, The Good Bad Guy), problems caused by Alzheimer's disease.Carol Arthur, Actress in 'Blazing Saddles' and Wife of Dom DeLuise, Dies at 85 *Julio Bécquer, 88, Cuban baseball player (Washington Senators, Los Angeles Angels, Minnesota Twins).Julio Becquer, member of Twins' first team in 1961, dies at 88 *Tonny Bruins Slot, 73, Dutch football manager (Ajax). *Rachel Caine, 58, American novelist (Glass Houses, Athena Force), soft-tissue sarcoma.It is with a heavy heart... *John R. Dunne, 90, American politician and lawyer, member of the New York Senate (1966–1989) and U.S. Assistant Attorney General for the Civil Rights Division (1990–1994).John Dunne, former New York state senator, dies at 90 *Tuomas Gerdt, 98, Finnish military officer, last surviving Mannerheim Cross recipient.Viimeinen Mannerheim-ristin ritari Tuomas Gerdt on kuollut *Yalçın Granit, 88, Turkish Olympic basketball player (1952).Yalçın Granit *Eddie Hassell, 30, American actor (The Kids Are All Right, Surface, Devious Maids), shot.Eddie Hassell, Actor in ‘The Kids Are All Right’ and ‘Surface,’ Dies at 30 After Being Shot *Pedro Iturralde, 91, Spanish saxophonist and composer.Muere Pedro Iturralde, leyenda del jazz en España, a los 91 años *Phil K, 51, Australian electronic DJ (Lostep) and record producer, bladder cancer.Melbourne DJ Phil K has died following a battle with bladder cancer *Dan Kohn, 47, American businessman, founder of NetMarket, problems caused by colon cancer.An Open Source Leader Is Gone, a Remembrance of Dan Kohn *Burhan Kuzu, 65, Turkish politician, MP (2002–2018), COVID-19.Son dakika… Burhan Kuzu vefat etti *Nikolay Maksyuta, 73, Russian politician, Governor of Volgograd Oblast (1997–2010), COVID-19.Бывший губернатор Волгоградской области Максюта умер от коронавируса *Nikki McKibbin, 42, American rock singer-songwriter and reality show contestant (American Idol), brain aneurysm.'American Idol' Contestant Nikki McKibbin Dead at 42 *Jorge Núñez Sánchez, 73, Ecuadorian writer and historian, cancer.Falleció el historiador Jorge Núñez Sánchez, premio Nacional Eugenio Espejo *Billy Tubbs, 85, American basketball coach (Lamar Cardinals, Oklahoma Sooners, TCU Horned Frogs), leukemia.Billy Tubbs, legendary OU and TCU basketball coach, dies at 85 ===2=== *Dietrich Adam, 67, German actor (Mostly Martha, French for Beginners, Storm of Love).Große Trauer: \"Friedrich Stahl\" ist tot *Robert Sam Anson, 75, American journalist (Vanity Fair, Esquire, The Atlantic) and writer, problems caused by dementia.Robert Sam Anson, 'Bare- Knuckle' Magazine Writer, Dies at 75 *Nancy Darsch, 68, American basketball coach, Olympic champion (1984, 1996), problems caused by Parkinson's disease.Nancy Darsch, who coached all levels of women's basketball, dies at 68 *Tracey Davis, 59, American writer, daughter of Sammy Davis Jr..Tracey Davis, author of 'Sammy Davis Jr.: My Father,' dies at 59 after a short illness *Léo de Almeida Neves, 88, Brazilian politician, economist and lawyer, Deputy (1967–1969, 1983–1987), problems caused by bowel obstruction.Morre o ex- deputado paranaense Leo de Almeida Neves *Rajko Đurić, 73, Serbian writer and politician, President of the International Romani Union and Leader of the Rome Union.Preminuo novinar, književnik i borac za prava Roma Rajko Đurić *Roy Edwards, 66, American politician, member of the Wyoming House of Representatives (since 2015). *Marcel Grün, 73, Czech astronomer.Zemřel Marcel Grün, šéf hvězdárny, popularizátor astronomie a náš kolega *T. N. Krishnan, 92, Indian Carnatic violinist.Chennai: Violin maestro TN Krishnan passes away at 92 *Ahmed Laraki, 89, Moroccan politician, Prime Minister (1969–1971).Décès de l’ancien Premier ministre Moulay Ahmed Laraki *Bhagirathi Majhi, 66, Indian politician, MP (2006–2010), COVID-19.Former Rajya Sabha MP Bhagirathi Majhi Passes Away *Oscar W. McConkie Jr., 94, American writer, LSD leader and politician, President of the Utah State Senate (1965–1966), COVID-19.LDS Democrat and legal giant Oscar McConkie Jr. dies at 94 of COVID complications *Don McDermott, 90, American speed skater, Olympic silver medalist (1952).1952 Speedskating Silver Medalist Don McDermot Passes Away at 90 (death announced on this date) *Raju Mishra, 72, Indian cinematographer (Aranya Rodan, Nirbachana, Joymoti), screenwriter and movie director, cardiac arrest.Odia Film Director Raju Mishra Dies Of Cardiac Arrest *Gigi Proietti, 80, Italian actor (Febbre da cavallo, Lady Liberty, Brancaleone at the Crusades), pop singer and comedian, heart attack.Morto Gigi Proietti, addio al grande mattatore della scena italiana *Park Ji-sun, 35, South Korean actress (Gag Concert, Star Golden Bell, Happy Together) and comedian.개그맨 박지선 자택서 모친과 사망…\"경위조사 중\"(종합) (death announced on this date) *John Sessions, 67, British actor and comedian (Stella Street, Spitting Image, Whose Line Is It Anyway?), heart attack.John Sessions dies aged 67 *Satish Prasad Singh, 84, Indian politician, Chief Minister of Bihar (1968) and MP (1980–1984), COVID-19.Former Bihar CM Satish Prasad Singh passes away in Delhi *Maria Tsien, 95, Filipina- American actress (One-Eyed Jacks, All the Young Men, Brushfire) and philanthropist.Maria Tsien McClay *Max Ward, 98, Canadian aviator and businessman (Wardair).Max Ward, bush pilot turned Canadian aviation pioneer, has died *Baron Wolman, 83, American photographer (Rolling Stone), problems caused by ALS.Baron Wolman, Rolling Stone's First Staff Photographer, Dies At 83 ===3=== *Isaac Alvarez, 90, Egyptian-born French actor (Du rififi chez les femmes, Belphegor, or Phantom of the Louvre, theatre director and mime.Avis de décès *Anthony Van Dyck, 4, Irish racehorse, euthanised.Anthony Van Dyck euthanised after breaking down during Melbourne Cup *Irvin Baxter Jr., 75, American Pentecostal preacher and televangelist, founder of Endtime Ministries, COVID-19.Irvin Baxter *Henry Brind, 93, British politician, Ambassador to Somalia (1977–1980) and High Commissioner to Malawi (1983–1987). *Gennady Bukharin, 91, Soviet-Russian sprint canoeist and Olympic bronze medalist (1956).Умер Геннадий Иванович Бухарин *Taymi Chappe, 52, Cuban-born Spanish Olympic fencer (1996). *Anne Covell, 70, Canadian Olympic athlete (1968).Anne Covell *Matti Laakso, 79, Finnish Olympic wrestler (1960, 1964, 1972).Matti Laakso *Jacques Pereira, 65, Moroccan-born Portuguese footballer (Braga, Porto, national team), heart failure.Morreu Jacques, antigo avançado do FC Porto *Elsa Raven, 91, American actress (Back to the Future, Amen, Titanic).Elsa Raven Dies: ‘Save The Clock Tower’ Lady From ‘Back To The Future’ Was 91 *Don Talbot, 87, Australian Olympic swimming coach (1964, 1972, 1980, 2000).Legendary Australian Swim Coach Don Talbot Dies at 87 ===4=== *Lakhdar Bouregaa, 87, Algerian independentist militant, Commander of the National Liberation Army (1956–1962), COVID-19.Algérie : Le Moudjahid Lakhdar Bouregâa est décédé *Theodore Friend, 89, American historian and educator, President of Swarthmore College (1973–1982), cancer.Theodore Wood Friend 3d, former president of the Eisenhower Fellowships, dies at 89 *Ken Hensley, 75, English rock singer-songwriter and musician (Uriah Heep, Blackfoot, Toe Fat).Ken Hensley, ex-Uriah Heep, dead at 75 *Bruce Hurley, 86, American businessman and politician, member of the Tennessee House of Representatives (1971–1989).Bruce Hurley *Tom Metzger, 82, American white supremacist (Ku Klux Klan) and politician, founder of the White Aryan Resistance.Tom Metzger Dies at 82; Notorious KKK Boss, Supremacist Who Ran for Congress *John Meyer, 78, American football player (Houston Oilers) and coach (Green Bay Packers, Boston/New England Patriots), COVID-19.John Meyer, former Packers defensive coordinator under Bart Starr, dies at 78 *Muhammad Abdul Rashid, 79, Pakistani field hockey player, Olympic silver medalist (1964) and champion (1968).Hockey legend Rasheed Junior passes away *Mariano Francisco Saynez Mendoza, 78, Mexican Navy admiral and politician, Secretary of the Navy (2010–2012).Fallece el exsecretario de Marina Francisco Saynez Mendoza *Matt Tees, 81, Scottish footballer (Grimsby Town, Charlton Athletic, Airdrieonians), problems caused by dementia. ===5=== *Len Barry, 78, American soul singer-songwriter (\"Bristol Stomp\", \"1-2-3\"), musician (The Dovells) and record producer, myelodysplastic syndrome.Len Barry, ‘1-2-3’ and ‘Bristol Stomp’ Singer, Dies *Yuvensius Alfonsius Biakai, 63, Indonesian politician, Regent of Asmat (2005–2015), COVID-19.Mantan Bupati Asmat Pertama Wafat ] *Maggie Crotty, 72, American politician, member of the Illinois House of Representatives (1996–2003), State Senate (2003–2009) and Bremen Township Supervisor (2005–2020).Former legislator, Bremen Township supervisor Maggie Crotty dies at 72 *François d'Harcourt, 91, French politician, Deputy (1973–1997).Normandie. Ancien député du Bessin, François-Henri d'Harcourt est décédé *Jacques Glowinski, 84, French pharmacist and biomedical researcher, member of the French Academy of Sciences (since 1992).Disparition de Jacques Glowinski, professeur émérite et administrateur honoraire du Collège de France *Jim Marurai, 73, Cook Islands politician, MP (1994–2017), Minister of Foreign Affairs (2009) and Prime Minister (2004–2010).Former Cook Islands PM Jim Marurai dies *Leonid Osipov, 77, Russian water polo player, Olympic champion (1972), silver (1968 and bronze medalist (1964).Leonid Osipov *Geoffrey Palmer, 93, British actor (The Fall and Rise of Reginald Perrin, Butterflies, Mr. Men and Little Miss).Geoffrey Palmer, TV and film actor, dies at 93 *Robert Peterson, 83, Canadian politician, Senator from Saskatchewan (2005–2012).Former Saskatchewan senator Bob Peterson dies, remembered as trustworthy *Reynaert, 65, Belgian pop singer-songwriter (\"Laissez briller le soleil\"), Eurovision contestant (1988), COVID-19.Joseph Reynaerts, qui avait représenté la Belgique à l'Eurovision, est décédé du coronavirus *Ossi Runne, 93, Finnish trumpeter, orchestra leader and composer (\"Playboy\").Musikens \"grand old man\" Ossi Runne är död *Jim Ramstad, 74, American politician, member of the Minnesota Senate (1981–1991) and U.S. House of Representatives from Minnesota's 3rd congressional district (1991–2009), problems caused by Parkinson's disease.Longtime Rep. Jim Ramstad, a champion for addiction help, has died *Pierre Simonet, 99, French militant and international civil servant.Pierre Simonet, l'un des trois derniers compagnons de la Libération, est mort à 99 ans *Géza Szőcs, 67, Romanian-Hungarian poet and politician, Secretary of State for Culture (2010–2012), COVID-19.Meghalt Szőcs Géza *Gordon Van Wylen, 100, American physicist and educator, President of Hope College (1972–1987), COVID-19.Former Hope College President Gordon Van Wylen Dies *Joy Westmore, 88, Australian actress (Prisoner, Neighbours, Blue Heelers).Joy Westmore from TV hit series Prisoner dies ===6=== *Caprino Alendy, 68, Surinamese politician, Chairperson of the Brotherhood and Unity in Politics (1987–2012) and MP (1991–2010).Ex-vicevoorzitter DNA Caprino Alendy overleden *Luis Alberto Ammann, 77, Argentine politician, Secretary-General of the Humanist Party (1984–1994, 2001–2003), 2007 presidential candidate, COVID-19.Falleció el político Luis Ammann: tenía coronavirus *Giuseppe Amadei, 101, Italian politician, Deputy (1958–1987) and MEP (1984–1989).Giuseppe Amadei morto, addio al protagonista del Novecento *Jean-Michel Boris, 87, French artistic director, Director General of the Olympia (1979–2001).Décès Jean-Michel Boris, figure emblématique de L'Olympia *Patrick Chokala, 72, Tanzanian politician, Ambassador to Russia (2002–2004), heart attack.Tanzania: Late Ambassador Chokala Laid to Rest in Dar *Ray Daviault, 86, Canadian baseball player (New York Mets).Un nom important du baseball québécois est décédé *Stefano D'Orazio, 72, Italian pop percussionist (Pooh), COVID-19.È morto Stefano D’Orazio, lo storico batterista dei Pooh aveva 72 anni. Loretta Goggi: “È stato il Covid”. A marzo scrisse la canzone per Bergamo *June Foulds, 86, British athlete, Olympic champion (1952) and bronze medalist (1956).June Foulds: Athlete, media star and a true market force (death announced on this date) *Harry Holman, 62, English footballer (Exeter City, Peterborough United).Harry Holman: 1957-2020 *King Von, 26, American rapper, shot.King Von Dead After Being Shot in Atlanta Nightclub Shooting: Reports *Barbara McAulay, 91, Australian Olympic diver (1956).Vale Barbara Donnet - central to a diving dynasty (death announced on this date) *Jim Neilson, 78, Canadian ice hockey player (New York Rangers, California Golden Seals, Cleveland Barons).Neilson, longtime NHL defenseman, dies at 79 *Andrzej Owczarek, 70, Polish activist and politician, Mayor of Łask (1990–1996) and Senator from Łódź Voivodeship (2005–2015), COVID-19.Zmarł Andrzej Owczarek. Chorował na koronawirusa *Sakari Paasonen, 85, Finnish Olympic shooter (1988, 1992).Sakari Paasonen *Luke Rhinehart, 87, American novelist (The Dice Man, Adventures of Wim, The Search for the Dice Man).The Dice Man author George Cockcroft (aka Luke Rhinehart) dies aged 87 *Fernando Solanas, 84, Argentine movie director (The Hour of the Furnaces, Tangos, the Exile of Gardel, Social Genocide) and politician, Senator from Buenos Aires (2013–2019), 2007 presidential candidate, COVID-19.Fernando “Pino” Solanas murió por coronavirus en París *Ken Spears, 82, American animator and television producer (Scooby-Doo, Dynomutt, Dog Wonder, Alvin and the Chipmunks), problems caused by Lewy body dementia.Ken Spears, Co-Creator of ‘Scooby-Doo,’ Dies at 82 *Nathan Zach, 89, German-born Israeli poet, translator and educator, Israel Prize winner (1995), problems caused by Alzheimer's disease.המשורר וחתן פרס ישראל נתן זך מת בגיל 89 *Mikhail Zhvanetsky, 86, Ukrainian-Russian writer and comedian, People's Artist of Russia (2012).Помер Михайло Жванецький ===7=== *Víctor Basterra, 76, Argentine political prisoner, photographer and whistleblower (ESMA).Murió Víctor Basterra, el detenido que se animó a sacar documentación de la ESMA y reveló la identidad de los represores *Cándido Camero, 99, Cuban jazz percussionist.Cándido Camero, A Father Of Latin Jazz, Dies At 99 *Cyril Colbeau-Justin, 50, French movie producer (Me, Myself and Mum, The Last Deadly Mission), cancer.Mort à 50 ans du producteur Cyril Colbeau-Justin *Norm Crosby, 93, American comedian and actor (Eight Crazy Nights, Everything Goes, Farce of the Penguins), heart failure. *John Fraser, 89, Scottish actor (The Good Companions, The Trials of Oscar Wilde, Repulsion) and writer.John Fraser *Vasile Gherasim, 70, Romanian politician, Mayor of Bucharest (2000–2004) and Deputy (2008–2012), COVID-19.A murit Vasile Gherasim, consilier de conturi în cadrul Curţii de Conturi a României şi fost primar al Sectorului 1 *Henry Haller, 97, Swiss-American chef, White House Executive Chef (1966–1987).Henry Haller, unflappable White House chef who cooked for five presidents from LBJ onwards – obituary *Bones Hillman, 62, New Zealand musician (Midnight Oil, The Swingers, Suburban Reptiles), cancer.Midnight Oil bassist Bones Hillman dies *Hou Feng, 92, Chinese plant breeding engineer, member of the Chinese Academy of Engineering (since 1999).“黄瓜王”、工程院院士侯锋逝世，享年92岁 *Pierre Lataillade, 87, French politician, Deputy (1978–1981), Mayor of Arcachon (1985–2001) and MEP (1986–1999).Arcachon : l'ancien maire Pierre Lataillade est décédé *Jeanne Little, 82, Australian television personality (The Mike Walsh Show, Cuckoo in the Nest, Beauty and the Beast) and singer, problems caused by Alzheimer's disease.Legendary Australian entertainer Jeanne Little dies *Mike McCormack, 98, American politician, member of the Washington House of Representatives (1957–1961), State Senate (1961–1970) and member of the U.S. House of Representatives (1971–1981) from Washington's 4th congressional district.McCormack, Mike (1921-2020) *Edward J. Perkins, 92, American politician, Ambassador to Liberia (1985–1986), South Africa (1986–1989), United Nations (1992–1993) and Australia (1993–1996).Statement on the Passing of Ambassador Edward Perkins *Jonathan Sacks, 72, British Orthodox rabbi, philosopher and politician, Chief Rabbi of the United Synagogue (1991–2013) and member of the House of Lords (since 2013), cancer.Rabbi Lord Jonathan Sacks, former chief rabbi of Great Britain dies *Anicetus Bongsu Antonius Sinaga, 79, Indonesian Roman Catholic prelate, Archbishop of Medan (2009–2018), COVID-19.BREAKING NEWS - Uskup Mgr Anicetus AB Sinaga Dikabarkan Wafat di RS Elisabeth Medan *Willie Smith, 64, American sprinter, Olympic champion (1984).Auburn Olympian, National Champion Willie Smith Passes Away *Song Jae-ho, 83, South Korean actor (Yeong-ja's Heydays, Memories of Murder, The President's Last Bang).Veteran actor Song Jae-ho dies *Anatoly Mikhailovich Stepin, 80, Russian mathematician.Скончался Анатолий Михайлович Степин *Sir Philip Lavallin Wroughton, 86, British businessman (Marsh & McLennan Companies) and politician, Lord Lieutenant of Berkshire (1995–2008). *Yang Zhenduo, 94, Chinese martial artist.楊露禪曾孫、楊氏太極拳第四代嫡傳人楊振鐸逝世 *Vera Zima, 67, Croatian actress (Love Letters with Intent, Cashier Wants to Go to the Seaside, Sorry for Kung Fu).U dobi od 67 godina u Zagrebu umrla Vera Zima, jedna od naših najomiljenijih glumica ===8=== *Joseph Altairac, 63, French literary critic and essayist.Joseph Altairac nous a quittés *Mohammed Bakar, 75, Malaysian footballer (Penang FA, national team) and manager, bone marrow failure.Football legend Mohamad Bakar dies *Oscar Benton, 71, Dutch blues pop singer (\"Bensonhurst Blues\").Haarlemse blueszanger Oscar Benton (71) overleden *Clive Griffiths, 91, Australian politician, member (1965–1997) and President of the Western Australian Legislative Council (1977–1997).Clive Edward Griffiths *Raphael Hadane, 97, Ethiopian-Israeli religious leader, Kahen of Beta Israel.Ethiopian High Priest Kes Raphael Hadane passes away *Howie Meeker, 97, Canadian Hall of Fame ice hockey player (Toronto Maple Leafs), commentator (Hockey Night in Canada) and politician, MP (1951–1953), four-time Stanley Cup champion.Canadian hockey and broadcasting legend Howie Meeker dies at age 97 *Jean-Yves Nau, 68, French physician and scientific journalist (Revue Médicale Suisse, La Nouvelle République du Centre-Ouest, Slate).Médecin et journaliste, le Tourangeau Jean-Yves Nau est décédé *Richard Neely, 79, American politician and lawyer, Chief Justice of the Supreme Court of Appeals of West Virginia (1973–1995), liver cancer.Former W.Va. Supreme Court justice Richard Neely passes away *Sanchaman Limboo, 73, Indian politician, Chief Minister of Sikkim (1994). *Heidar Shonjani, 74, Iranian Olympic swimmer (1964) and water polo player (1976).Legendary swimmer Heydar Shonjani dies *Miro Steržaj, 87, Slovenian businessman and politician, Mayor of Ljutomer (1988–1992).Poslovil se je Miroslav Steržaj *Seymour Topping, 98, American journalist and war correspondent (The New York Times), Administrator of the Pulitzer Prize (1993–2002), stroke.Seymour Topping, Former Times Journalist and Eyewitness to History, Dies at 98 *Alex Trebek, 80, Canadian-American game show host (Jeopardy!, High Rollers, Double Dare), 7-time Emmy winner, pancreatic cancer.Alex Trebek, beloved 'Jeopardy!' host, dies after cancer battle at age 80 *Víctor Valencia de los Santos, 61, Mexican politician, Deputy (2006–2008), COVID-19.Pierde la batalla contra el Covid-19 Víctor Valencia *Andrzej Wawrzyniak, 88, Polish politician and art collector (Asia and Pacific Museum), Ambassador to Nepal (1977–1981) and Afghanistan (1990–1993).Andrzej Wawrzyniak : Nekrologi ===9=== *Fernando Atzori, 78, Italian boxer, Olympic champion (1964).Muore a Firenze Fernando Atzori, il sardo medaglia d'oro alle Olimpiadi di Tokyo *Virginia Bonci, 71, Romanian Olympic athlete (1968).Doliu în lumea atletismului românesc! O fostă campioană a încetat din viață *Michael Bundesen, 71, Danish pop singer-songwriter (Shu- bi-dua).Michael Bundesen er død *Domènec Fita i Molat, 93, Spanish painter and sculptor.Mor l'artista Domènec Fita als 93 anys *Israel Horovitz, 81, American playwright and screenwriter (Author! Author!, Sunshine, James Dean), cancer.Addio a Israel Horovitz, grande autore del teatro americano *Harry R. Jackson Jr., 66, American Christian preacher, Pentecostal bishop and political advisor (Donald Trump).Bishop Harry Jackson Hr., Trump evangelical advisor, has died *Gordon Joseloff, 75, American journalist (CBS News), problems caused by myelofibrosis.Gordon Joseloff, longtime CBS News journalist, dies at 75 *John Kinsela, 70, Australian Olympic wrestler (1968, 1972).John Kinsela *Lawrence LeShan, 100, American psychologist, educator and writer.Lawrence LeShan *Edward McClain, 80, American chemist, politician and convicted fraudster, member of the Alabama House of Representatives (1987–1994) and State Senate (1995–2009).Former Alabama Sen. E. B. McClain dead at 80 *Shkëlqim Troplini, 54, Albanian Olympic wrestler (1996), COVID-19.Coronavirus, Famous Wrestler Passes Away *Carlos G. Vallés, 95, Spanish-Indian Jesuit priest and columnist (Kumar, Gujarat Samachar).Gujarat CM condoles demise of Gujarati writer & litterateur Father Valles *Basil Yamey, 101, South African economist and academic, member of the Competition Commission (1966–1978).A trip down memory lane ===10=== *Lucille Bridges, 86, American civil rights activist, mother of Ruby Bridges.Lucille Bridges, Mother Of Anti-Segregation Icon Ruby Bridges, Dies At 86 *Charles Corver, 84, Dutch football referee.Oud-topscheidsrechter Charles Corver (84) overleden *Graham Cowdrey, 56, English cricketer (Kent).Graham Cowdrey, former Kent captain, dies aged 56 *Dino da Costa, 89, Brazilian-born Italian footballer (Botafogo, Roma, Italy national team).E’ morto Dino Da Costa. In viola fu protagonista della memorabile stagione 1960-61 *Saeb Erekat, 65, Palestinian politician and political activist, negotiator for the Oslo Accords, MP (since 1996) and Secretary-General of the PLO (since 2015), COVID-19.Saeb Erekat, top Palestinian negotiator, dies age 65 *Renzo Gattegna, 81, Italian lawyer, President of the Union of Italian Jewish Communities (2006–2016), COVID-19.Roma, morto di Covid Renzo Gattegna, ex presidente dell’Unione delle Comunità ebraiche *Vladimir Găitan, 73, Romanian actor (The Reenactment, Accident, Uncle Marin, the Billionaire), stomach cancer.Actorul Vladimir Găitan a încetat din viață pierzând lupta cu cancerul *Tom Heinsohn, 86, American Hall of Fame basketball player, coach, and broadcaster (Boston Celtics).Longtime Celtics player, coach, and broadcaster Tom Heinsohn dies at 86 *Luis Ibero, 71, Spanish politician, Mayor of Zizur Mayor (1992–1995) and President of the Commonwealth of Pamplona (2003–2007), COVID-19.Muere por coronavirus Luis Ibero, político y exmiembro de la Gestora de Osasuna *Igor Moskvin, 91, Russian figure skater and coach, Soviet national champion (1952, 1953, 1954).Москвин внес огромный вклад в развитие фигурного катания *Günther Pfaff, 81, Austrian canoeist, Olympic bronze medalist (1968).Günther Pfaff *Isidro Pedraza Chávez, 61, Mexican politician, Deputy (2006–2009) and Senator from Hidalgo (2012–2015), COVID-19.Fallece el exsenador Isidro Pedraza por COVID-19 *Mahadeepak Singh Shakya, 98, Indian politician, MP (1977–1998).एटा सीट से छह बार के सांसद रहे डा. महादीपक सिंह शाक्य का निधन *Juan Sol, 73, Spanish footballer (Valencia, Real Madrid, national team).Official announcement: passing of Juan Cruz Sol *Mila del Sol, 97, Filipina actress (Giliw Ko) and businesswoman.Mila del Sol, Queen of Golden Age PH Cinema, dies *Rahayu Supanggah, 71, Indonesian composer.Komposer Rahayu Supanggah Meninggal Dunia *Amadou Toumani Touré, 72, Malian Armed Forces general and politician, President (1991–1992, 2002–2012).Mali: Ex-President Amadou Toumani Toure dies *Tony Waiters, 83, English footballer (Blackpool, national team) and manager (Plymouth Argyle, Canada).In memory of Tony Waiters, Hall of Fame honoured member *Sven Wollter, 86, Swedish actor (The Sacrifice, The Man on the Roof, A Song for Martin), writer and political activist, COVID-19.Sven Wollter är död *Amir Yavari, 88, Iranian Olympic boxer (1960).کاپیتان سابق تیم ملی بوکس درگذشت - برخط نیوز *Mahmoud Yavari, 81, Iranian footballer (PAS Tehran, national team) and manager (Tractor).Ex-Iran football coach Mahmoud Yavari dies ===11=== *Mongameli Bobani, South African politician, Mayor of Nelson Mandela Bay (2018–2019), COVID-19.Former Nelson Mandela Bay mayor Mongameli Bobani dies *Carlos Campos, 83, Chilean footballer (Universidad de Chile, national team), respiratory failure.La partida de un ídolo azul: Carlos Campos falleció a los 83 años *Shegufta Bakht Chaudhuri, 86, Bangladeshi economist and businessman, Governor of Bangladesh Bank (1987–1992).Former BB governor Shegufta Bakht Chaudhuri passes away *Adrian Cionco, 48, Argentine bass player (La Mosca Tsé - Tsé), heart failure.A los 48 años, murió Adrián Cionco, bajista de la banda La Mosca *Francesc Xavier Ciuraneta Aymí, 80, Spanish Roman Catholic prelate, Bishop of Menorca (1991–1999) and Lleida (1999–2007), problems caused by Parkinson's disease.Fallece Mons. Ciuraneta, obispo emérito de Lleida *Justin Cronin, 40, American politician, member of the South Dakota House of Representatives (2009–2017) and State Senate (2017–2019).Former state legislator Justin Cronin dies at 40 *Jean Collet, 88, French journalist (Télérama, Cahiers du Cinéma) and critic (Études).Le critique et théoricien du cinéma Jean Collet est mort *Edward Flak, 72, Polish lawyer and politician, Mayor of Olesno (1990–1994, 1998–2006) and member of the Sejm (1992–1993).Nie żyje Edward Flak, wieloletni burmistrz Olesna, były poseł i jeden z założycieli Mniejszości Niemieckiej *Boris Gurevich, 83, Ukrainian wrestler, Olympic champion (1968).Умер олимпийский чемпион, послуживший моделью для известной скульптуры в США *Juan Gómez-Quiñones, 80, Mexican-born American historian, Chicano activist and editor (Plan de Santa Bárbara). *Dame Margaret Guilfoyle, 94, Northern Ireland-born Australian politician, Senator from Victoria (1971–1987) and Minister for Education (1975), Social Security (1975–1980) and Finance (1980–1983). *Edmund Jagiełło, 73, Polish physician and politician, member of Sejm (1989–1991) and Senator from Sieradz Voivodeship (1991–1993).Zmarł Edmund Jagiełło, znany lekarz z Osjakowa, który był też posłem i senatorem *Khalifa bin Salman Al Khalifa, 84, Bahraini royal and politician, Prime Minister (since 1970), problems caused by heart failure. *Thembekile Kimi Makwetu, 54, South African accountant and politician, Auditor-General (since 2013), lung cancer. *Jorge Llopart, 68, Spanish race walker, Olympic silver medalist (1980), heart attack.Jordi Llopart, legendary Spanish walker, Olympic runner-up in 1980 and European champion in 1978, dies *Giuliana Minuzzo, 88, Italian alpine skier, Olympic bronze medalist (1952, 1960).Sci: morta Giuliana Minuzzo, prima italiana a vincere una medaglia alle Olimpiadi *Michael Mongeau, 74, Canadian actor (How My Mother Gave Birth to Me During Menopause, Gaz Bar Blues, Shake Hands with the Devil).Décès de Michel Mongeau, ancien animateur de «275-Allô» *Abdulkadir Balarabe Musa, 84, Nigerian politician, Governor of Kaduna State (1979–1981).BREAKING: Ex-Kaduna Gov Balarabe Musa dies *Gonçalo Ribeiro Telles, 98, Portuguese landscape architect and politician, co-founder of the People's Monarchist Party and the Earth Party.Morreu o arquitecto paisagista Gonçalo Ribeiro Telles *Theresa Stewart, 90, English politician, Lord Mayor of Birmingham (2000–2001).Theresa Stewart: Former Birmingham council leader dies *Marie-Claude Vayssade, 84, French politician, MEP (1979–1994).Marie-Claude Vayssade nous a quittés *Andrew White, 78, American jazz saxophonist and musicologist.Andrew White, Prolific Multi-Instrumentalist, Scholar and Washington, D.C. Legend, Dies at 78 ===12=== *Asif Basra, 53, Indian actor (Outsourced, One Night with the King, Once Upon a Time in Mumbaai), suicide by hanging.Asif Basra dies by suicide *Wolfgang Engelmann, 78, German politician, MP (1990–1998).Wolfgang Engelmann *Raman Bandarenka, 31, Belarusian designer and shop manager, beating.Боль и скорбь. Что происходит в стране 13 ноября *Walter J. Gex III, 81, American politician and lawyer, Judge of the U.S. District Court for Southern Mississippi (since 1986).Longtime Coast attorney, federal court judge dies at the age of 81 *Alan Glazier, 81, English darts player.Former World Championship semi-finalist Alan Glazier passes away *Kanybek Isakov, 51, Kyrgyz politician and educator, Rector of Osh State University (2011–2019), COVID-19.В Киргизии от пневмонии скончался экс-министр образования *Surendra Singh Jeena, 50, Indian politician, Uttarakhand MLA (since 2007), COVID-19. *Nelly Kaplan, 89, Argentine-born French movie director (A Very Curious Girl) and screenwriter (Austerlitz), COVID-19. *Masatoshi Koshiba, 94, Japanese physicist (Neutrino astronomy), Nobel Prize winner (2002). *Eugeniusz Makulski, 92, Polish Roman Catholic priest and friar, Curator of the Basilica of Our Lady of Licheń.Ksiądz Eugeniusz Makulski nie żyje. Zbudował bazylikę w Licheniu, ciążyły na nim poważne zarzuty *Tibor Méray, 96, Hungarian journalist and writer (Catch Me a Spy).Méray Tibor emlékére *Marc Monchal, 85, French Army general, Chief of Staff of the Army (1991–1996).arbes – Mort du général Monchal : l'hommage du 35e RAP à son ancien chef de Corps *Piem, 97, French cartoonist (Le Figaro, Le Point, La Croix).Mort de Piem, dessinateur satirique du Petit Rapporteur et du Figaro *Leonid Potapov, 85, Russian politician, President of Buryatia (1994–2007), COVID-19.Скончался первый президент Бурятии Леонид Потапов *Dave Quall, 84, American politician, member of the Washington House of Representatives (1993–2011).Longtime Skagit County educator, legislator, coach dies *Albert Quixall, 87, English footballer (Sheffield Wednesday, Manchester United, national team).Owls mourn a legend as Albert Quixall passes away *Jerry Rawlings, 73, Ghanaian Air Force general and politician, President (1979, 1981–2001), COVID-19.Jerry Rawlings, ex-Ghanaian president, dies from COVID-19 *Gernot Roll, 81, German cinematographer (The Last Escape, Zero Hour, Beyond Silence) and movie director.Kameramann Gernot Roll ist tot *Krasnodar Rora, 75, Yugoslav- Croatian footballer (Dinamo Zagreb, Yugoslavia national team) and manager (NK Radnik Velika Gorica).Nadvilo se crnilo nad Maksimir, otišla je zauvijek još jedna Dinamova legenda! Preminuo Krasnodar Rora *Paul Schrieber, 54, American baseball umpire, cerebral hemorrhage.Paul Schrieber *Guy-Olivier Segond, 75, Swiss politician, Mayor of Geneva (1983–1984, 1988–1989) and member of the National Council (1987–1990).L'ex-conseiller d'Etat Guy-Olivier Segond s'est éteint *Waqar Ahmed Seth, 59, Pakistani politician and lawyer, Justice (since 2011) and Chief Justice (since 2018) of the Peshawar High Court, COVID-19.Peshawar High Court Chief Justice Waqar Ahmed Seth passes away from coronavirus *Aldo Tambellini, 90, Italian-American artist, problems caused by surgery.Aldo Tambellini, Avant-Garde Filmmaker and Video Artist, Dies at 90 *Sakata Tōjūrō IV, 88, Japanese kabuki actor.人間国宝の坂田藤十郎さん88歳死去、妻は扇千景 *Jim Tucker, 74, American rock guitarist (The Turtles).Jim Tucker, rhythm guitarist for The Turtles and Grass Valley resident, dies at 74 *Howie Winter, 91, American mobster (Winter Hill Gang), heart attack.Howie Winter, former Winter Hill Gang leader, dies at age 91 ===13=== *Mohammad Ali, 76, Bangladeshi politician, MP (1996–2001).Former lawmaker Mohammad Ali passes away *Vidin Apostolov, 79, Bulgarian footballer (Lokomotiv Sofia, Botev Plovdiv, national team).Почина легендата на Ботев (Пловдив) Виден Апостолов *Ravi Belagere, 62, Indian journalist (Hai Bangalore, O Manase) and novelist, heart attack. *Robert Byron Bird, 96, American chemical engineer, member of the National Academy of Sciences (since 1989), National Medal of Science recipient (1987).Chemical engineering pioneer Robert Byron Bird passes away at 96 *Rik Boel, 89, Belgian politician and lawyer, Minister of the Interior (1977–1979) and Judge of the Constitutional Court (1986–2001).L'ancien ministre Rik Boel est décédé *João Cunha, 81, Brazilian politician, Deputy (1975–1991).João Cunha, deputado que 'elegeu' Tancredo, morre em Ribeirão Preto *Walter Eichner, 70, German politician, Chief Administrative Officer of Landsberg (2002–2014).Landkreis Landsberg: Walter Eichner ist gestorben. Ein Nachruf *Renald Falzon, 46, Maltese politician, Mayor of Qormi (since 2019), COVID-19.Qormi mayor Renald Falzon dies with Covid-19, aged 46 *Terry Duerod, 64, American basketball player (Boston Celtics, Detroit Pistons, Dallas Mavericks), NBA champion (1981), leukemia.Terry Duerod, legendary Detroit basketball player and city firefighter, dies of cancer at 64 *József Halzl, 86, Hungarian electrical engineer and businessman, co-founder of the Hungarian Democratic Forum and CEO of MVM Group (1991–1994).Meghalt Halzl József *Mohand Chérif Hannachi, 70, Algerian footballer (national team) and executive (Kabylie), COVID-19.Carnet : Mohand Chérif Hannachi est décédé *Paul Hornung, 84, American Hall of Fame football player (Green Bay Packers), Super Bowl champion (1966), Heisman Trophy winner (1956), problems caused by dementia.Green Bay Packers, Notre Dame great Paul Hornung dies at 84 *Attila Horváth, 53, Hungarian Olympic discus thrower (1992, 1996), COVID-19.Koronavírusban halt meg Horváth Attila világbajnoki bronzérmes diszkoszvető *Roger Jepsen, 91, American politician, member of the Iowa Senate (1966–1968), Lieutenant Governor (1969–1973) and U.S. Senator (1979–1985).Former Iowa senator Roger Jepsen dies at age 91 *Kjartan Jóhannsson, 80, Icelandic politician, Minister of Fisheries (1978–1980) and Commerce (1979–1980).Kjartan Jóhannsson *Gwyn Jones, 85, Welsh footballer (Wolverhampton Wanderers, Bristol Rovers).Gwyn Jones|1935-2020 *Jay Kerttula, 92, American businessman and politician, member of the Alaska House of Representatives (1961–1963, 1965–1973) and State Senate (1973–1995).Longtime former Alaska lawmaker Jay Kerttula dies at age 92 *Akira Kubodera, 43, Japanese actor (Pretty Guardian Sailor Moon, Kamen Rider Blade, Kamen Rider Kiva), suicide.Japanese actor Akira Kubodera dies at 43 *Halina Kwiatkowska, 99, Polish actress (Ashes and Diamonds, The Doll, And Along Come Tourists) and educator.Zmarła aktorka Halina Kwiatkowska *Pierre Mercier, 83, Canadian politician, MNA for Bellechasse (1973–1976).Décès de l'ancien député Pierre Mercier *Jean Morzadec, 67, French singer-songwriter and media director.Jean Morzadec, créateur du \"Choix des libraires\", est mort *Alfred Muller, 79, French politician, Mayor of Schiltigheim (1977–2008) and Deputy (1993–1997).Alfred Muller, maire emblématique de Schiltigheim, s’est éteint *Louis Rostollan, 84, French road bicycle racer, lung disease.Marseille : Louis Rostollan, figure du cyclisme provençal, s'en est allé *Kićo Slabinac, 76, Croatian pop rock singer-songwriter (\"Tvoj dječak je tužan\") and musician, Eurovision contestant (1971).Odlazak velikana! Kićo Slabinac izgubio bitku za život *Doug Supernaw, 60, American country singer-songwriter (\"I Don't Call Him Daddy\", \"Reno\", \"Not Enough Hours in the Night\") and guitarist, lung and bladder cancer.Doug Supernaw, ’90s Country Star, Dies in Texas *Peter Sutcliffe, 74, English serial killer, COVID-19.Yorkshire Ripper serial killer Peter Sutcliffe has died *Vladimír Székely, 79, Hungarian electrical engineer, member of the Hungarian Academy of Sciences (since 2010).Elhunyt Székely Vladimír *Sir John Meurig Thomas, 87, Welsh chemist and academic administrator, Director of the Royal Institution (1986–1991), Royal Medalist (2016).Sir John Meurig Thomas: Welsh scientist dies aged 87 *Jan van Toorn, 88, Dutch graphic designer.Grafisch ontwerper Jan van Toorn overleden ===14=== *Jay E. Adams, 91, American religious writer, founder of Nouthetic counseling and The Institute for Nouthetic Studies. *Osmo Ala-Honkola, 81, Finnish Olympic shooter (1968, 1972).Osmo Ala-Honkola *Robert J. Brown, 85, American politician and mathematician, member of the Minnesota Senate (1967–1976).Dr. Robert J. Brown *Adolfo Bolea, 87, Spanish football player (Sant Andreu, Tenerife, Cádiz) and manager.Fallece Adolfo Bolea, ex futbolista del Cádiz CF *Gerald Nicholas Dino, 80, American Ruthenian Greek Catholic Church prelate, Bishop of the Byzantine Catholic Eparchy of Phoenix (2008–2016).V Pánovi usnul americký vladyka Gerald Nicholas Dino, ktorý mal korene na Slovensku *Armen Dzhigarkhanyan, 85, Armenian-Russian actor (The New Adventures of the Elusive Avengers, The Crown of the Russian Empire, The Meeting Place Cannot Be Changed), cardiac arrest caused by kidney failure.Armenian actor Armen Dzhigarkhanyan dies aged 85 *Peter Florjančič, 101, Slovene inventor and Olympic skier (1936).Legendary Slovenian inventor dies *Jacques Fornier, 94, French theatrical actor and director (National Theatre of Strasbourg).Côte-d'Or : l'homme de théâtre Jacques Fornier s'est éteint à l'âge de 94 ans *Max Gros-Louis, 89, Canadian politician, indigenous rights activist and businessman, Grand Chief of the Huron-Wendat Nation (1964–1984, 1994–1996, 2004–2008).L’ancien grand chef Max Gros-Louis n’est plus *Abu Hena, Bangladeshi politician, MP (1996–2006), COVID-19.Abu Hena, a former MP from Rajshahi, dies of COVID-19 *Lindy McDaniel, 86, American baseball player (St. Louis Cardinals, New York Yankees, Chicago Cubs), COVID-19.Lindy McDaniel, Ace Reliever for Mediocre Teams, Dies at 84 *Hasan Muratović, 80, Bosnian politician, businessman and educator, Prime Minister (1996–1997) and Minister of Foreign Trade (1997–1999), COVID-19.Doctor Hasan Muratovic dies of Coronavirus in Sarajevo *Des O'Connor, 88, English television presenter (The Des O'Connor Show, Des O'Connor Tonight), comedian and singer (\"I Pretend\"), problems caused by a fall.Entertainer Des O'Connor dies aged 88 *David Stoddart, Baron Stoddart of Swindon, 94, British politician, MP (1970–1983) and member of the House of Lords (since 1983).Deceased Lords *Kay Wiestål, 80, Swedish businessman (Victoria Day) and footballer (Djurgårdens IF), COVID-19.Victoriadagens grundare är död – kungafamiljens sorg ===15=== *Carlos Amadeu, 55, Brazilian footballer (Bahia) and manager (Vitória, Al Hilal), heart attack.Morre Carlos Amadeu, ex-técnico de Bahia, Vitória e seleção sub-20 *Chandrawati, 92, Indian politician, MP (1977–1979) and Lieutenant Governor of Puducherry (1990), COVID-19.Haryana’s first woman MP Chandrawati passes away *Soumitra Chatterjee, 85, Indian actor (The World of Apu, Abhijan, Rupkatha Noy), writer and theatre director, problems caused by COVID-19.Soumitra Chatterjee, One of Bengal's Greatest Actors, Passes Away *Ray Clemence, 72, English footballer (Liverpool, Tottenham Hotspur, national team), prostate cancer.Statement on behalf of the Clemence family *Henrique Córdova, 81, Brazilian politician, Governor of Santa Catarina (1982–1983).Morre o ex-governador de SC Henrique Córdova *Egidio Cosentino, 93, Italian Olympic field hockey player (1952). *Drew S. Days III, 79, American lawyer and politician, Assistant Attorney General for Civil Rights (1977–1980) and U.S. Solicitor General (1993–1996).https://law.yale.edu/yls-today/news/yale-law-school-mourns-death- alfred-m-rankin-professor-law-drew-s-days-iii Yale Law School Mourns the Death of Alfred M. Rankin Professor of Law Drew S. Days III] *Yairus Gwijangge, 51, Indonesian politician, Regent of Nduga (2011–2016, since 2017).Bupati Nduga Yairus Gwijangge Meninggal Dunia karena Sakit *Richard Kosolapov, 90, Soviet- Russian scientist, social philosopher and journalist (Pravda, Kommunist).Памяти Р.И. Косолапова *Fred Morrison, 94, American football player (Chicago Bears, Cleveland Browns), problems caused by a broken hip.Former Ohio State fullback Fred \"Curly\" Morrison dies at age 94 *Victor Popa, 71, Moldovan politician and lawyer, MP (2010–2013) and Justice of the Consitutional Court (since 2013).A decedat Victor Popa, fost judecător la Curtea Constituțională *Anne Rasa, 80, British ethologist.Kalahari Trails on Facebook *Witold Sadowy, 100, Polish actor (Zakazane piosenki, Bad Luck) and columnist (Gazeta Wyborcza).Witold Sadowy nie żyje. Był najstarszym polskim aktorem *Ioannis Tassias, 62, Greek Orthodox prelate, Metropolitan of Langadas (since 2010), COVID-19.Απεβίωσε ο Μητροπολίτης Λαγκαδά, Ιωάννης *Norman Taylor, 55, American-born Australian basketball player (Illawarra Hawks), heart attack.Stormin' Norman Taylor leaves giant Illawarra Hawks legacy *Raúl Eduardo Vela Chiriboga, 86, Ecuadorian Roman Catholic cardinal, Bishop of Azogues (1975–1989), Military Ordinary of Ecuador (1989–2003) and Archbishop of Quito (2003–2010).Descansa en la Paz del Señor Su Eminencia Cardenal Raúl Eduardo Vela Chiriboga *Marvin Zonis, 84, American political economist.Marvin Zonis, Longtime University Of Chicago Professor And CBS 2 International Analyst, Dies ===16=== *Shawkat Ali, 83, Bangladeshi Army colonel, politician and activist, MP (1979–1986, 1991–2014) and Deputy Speaker of the Jatiya Sangsad (2009–2014).Former Deputy Speaker Shawkat Ali passes away *Dairon Blanco, 28, Cuban footballer (Las Tunas, national team), car crash.Fallece en accidente de tránsito el futbolista cubano Dairon Blanco *Raul del Mar, 79, Filipino lawyer and politician, member (1987–1998, 2001–2010, since 2013) and Deputy Speaker (2004–2010) of the House of Representatives.Cebu City congressman Raul del Mar dies at 79 *Campbell Forsyth, 86, Scottish footballer (St. Mirren, Kilmarnock).St Mirren saddened to hear of the passing of Campbell Forsyth (death announced on this date) *Antonis Georgiadis, 87, Greek football manager (AEK Athens, Olympiacos, national team).Πέθανε ο Αντώνης Γεωργιάδης *Henryk Gulbinowicz, 97, Polish Roman Catholic cardinal, Archbishop of Wrocław (1976–2004), cardiorespiratory failure caused by pneumonia.Nie żyje kardynał Henryk Gulbinowicz. Miał 97 lat *David Hemblen, 79, English-born Canadian actor (X-Men, The Sweet Hereafter, Tommy Boy).David Hemblen *Jacob M. Landau, 96, Moldovan-born Israeli political scientist, Israel Prize winner (2005).Passing of Prof. Jacob M. Landau (death announced on this date) *Tomislav Merčep, 68, Croatian politician and convicted war criminal, MP (1993–2000) and 2000 presidential candidate.Umro ratni zločinac Tomislav Merčep *Bill Morgan, 80, Australian-born Canadian journalist and television producer (CBC News).William John Morgan *Walid Muallem, 79, Syrian politician, Ambassador to the United States (1990–2000), Minister of Foreign Affairs (since 2006) and Deputy Prime Minister (since 2012), heart disease. *Sheila Nelson, 83–84, English music educator and composer (English Chamber Orchestra, Royal Philharmonic Orchestra), problems caused by Alzheimer's disease.Sheila M. Nelson (1936-2020) *Hasbullah Osman, 63, Malaysian politician, Perak State MLA (2004–2013), MP (since 2013) and Chairman of SPNB (since 2020), heart attack caused by heart disease.Gerik MP dead from heart disease, says Temenggor rep *Bruce Swedien, 86, American audio engineer and record producer (Thriller), Grammy winner (1983, 1987, 1990, 1992, 1996).Michael Jackson’s engineer Bruce Swedien has died *Harry van Raaij, 84, Dutch football executive, Chairman of PSV Eindhoven (1996–2004).Oud-PSV-voorzitter Harry van Raaij (84) overleden ===17=== *Camille Bonnet, 102, French rugby union player (SU Agen Lot-et-Garonne, Sporting Club Graulhetois), COVID-19.Camille Bonnet, le doyen du rugby français, est mort à 102 ans *Eddie Borysewicz, 81, Polish-American Hall of Fame cyclist and Olympic cycling coach (1984), COVID-19.Eddie Borysewicz, coach to LeMond, Armstrong, dies at 81 *Angelo Caroli, 83, Italian footballer (Juventus, Catania, Lucchese), journalist (Tuttosport) and novelist.Juventus, addio a Caroli, giocatore, giornalista e scrittore *Walt Davis, 89, American high jumper and basketball player (Philadelphia Warriors, St. Louis Hawks), Olympic champion (1952).Buddy Davis, Olympic & NBA champ from Nederland, dies at 89 *Pim Doesburg, 77, Dutch footballer (Sparta Rotterdam, PSV Eindhoven, national team).Oud-keeper en Eredivisie-recordhouder Pim Doesburg (77) overleden *Stanisław Dulias, 81, Polish politician and economist, member of Sejm (2001–2005), COVID-19.COVID zbiera żniwo. Dzisiaj zmarł poseł Dulias, kilka dni wcześniej jego żona *Ljubisav Ivanov-Dzingo, 84, Macedonian football executive and politician, President of the Football Federation of Macedonia (1993–1999).Почина Љубисав Иванов – Ѕинго *Willy Kuijpers, 83, Belgian politician, MP (1971–1984), MEP (1984–1989), Senator (1989–1995) and Mayor of Herent (1995–2012), problems caused by a fall and COVID-19.Oud- burgemeester van Herent en Volksunie-boegbeeld Willy Kuijpers overleden: \"Vlaamse strijder, fijne mens\" *Eitaro Okano, 90, Japanese Olympic sprinter (1952), problems caused by a subarachnoid hemorrhage.岡野栄太郎さん死去 元陸上五輪代表選手、元毎日新聞社取締役 *José Ramón Pérez de Lama, 94, Spanish engineer and politician, Mayor of Sevilla (1978–1979).Muere el ex alcalde de Sevilla José Ramón Pérez de Lama *John Poole, 87, English footballer (Port Vale, Macclesfield Town).Remembering John Poole and Stan Trafford *Anneliese Schuh- Proxauf, 98, Austrian Olympic skier (1948).Anneliese Schuh-Proxauf *Jagmohan Singh, 88, Indian Olympic hurdler (1960), heart attack.Olympian hurdler Jagmohan Singh, who introduced scientific training methods dies *Paul Sobol, 94, French-born Belgian educator, autobiographer and Holocaust survivor, ruptured aneurysm.Paul Sobol voulait témoigner \"afin qu’un Auschwitz n’arrive plus jamais\" *Sheldon Solow, 92, American real estate developer (Solow Building), lymphoma.Obituary: Sheldon Solow, Billionaire Real Estate Developer, Dies at 92 *Roman Viktyuk, 84, Ukrainian-Russian theater actor, playwright and director, People's Artist of Ukraine (2006) and Russia (2009), thrombosis caused by COVID-19.Режисер Роман Віктюк помер після зараження коронавірусом ===18=== *Claire Boudreau, 55, Canadian genealogist, historian, and politician, Chief Herald of Canada (2007–2020), cancer.Décès de Claire Boudreau : héraut d’armes qui aura laissé sa marque *George Carter, 74, American basketball player (Detroit Pistons, Virginia Squires, New York Nets).Bonaventure and WNY great George Carter, who was drafted in three sports, dies at 74 *Iwannis Louis Awad, 86, Syrian Syriac Catholic hierarch, Apostolic Exarch of Venezuela (2003–2011).Apostolic Exarchs of Venezuela (Syriac rite) *László Benkő, 77, Hungarian rock keyboardist (Omega).Meghalt Benkő László, az Omega alapítója *Bobby Brown Jr., 28, American R&B; singer- songwriter, son of Bobby Brown, problems caused by influenza.Singer Bobby Brown's son found dead in Los Angeles at age 28 *Umar Ghalib, 90, Somali politician, Minister of Foreign Affairs (1969–1976) and Prime Minister (1991–1993). *Mokhtar Hashim, 78, Malaysian politician, Minister of Culture (1981–1983) and Youth and Sports (1981–1983). *Tony Hooper, 77, English folk singer-songwriter (\"Oh How She Changed\", \"Forever\") and guitarist (Strawbs).Tony Hooper, Died 18 November 2020 *Arthur Imperatore Sr., 95, American transportation executive and hockey team owner (Colorado Rockies), founder of the NY Waterway. *Draga Olteanu Matei, 87, Romanian actress (The Famous Paparazzo, Uncle Marin, the Billionaire, Explosion), gastrointestinal hemorrhage.Actriţa Draga Olteanu Matei a încetat din viaţă *Kirby Morrow, 47, Canadian actor (Dragon Ball Z, Inuyasha, Ninjago).Actor Kirby Morrow, Stargate’s Daedalus Bridge Officer, Dies At 47 *Adam Musiał, 71, Polish footballer (Wisła Kraków, national team) and manager (Stal Stalowa Wola).Nie żyje Adam Musiał, Orzeł Górskiego. Legenda polskiej piłki. Miał 71 lat *Mridula Sinha, 77, Indian politician and writer, Governor of Goa (2014–2019).Former Goa Governor Mridula Sinha passes away; PM Modi, Amit Shah condole demise of veteran BJP leader *Firsat Sofi, 42, Iraqi politician, Governor of Erbil (since 2019), COVID-19.Erbil governor Firsat Sofi dies of coronavirus *James Wasserman, 72, American author and occultist, member of the Ordo Templi Orientis (since 1976). ===19=== *Michael J. Budds, 73, American musicologist. *Sebouh Chouldjian, 61, Turkish-born Armenian Apostolic prelate, Archbishop of Gougark (since 1996), COVID-19.Primate of Gugark Diocese Archbishop Sebouh Chouldjian dies of Covid-19 *Manvel Grigoryan, 64, Armenian Army military officer and politician, Deputy (2012–2018).Скончался один из главных оккупантов Карабаха Манвел Григорян *Reşit Karabacak, 66, Turkish Olympic wrestler (1984), COVID-19.Former Turkish wrestler dies of coronavirus *Charles Levin, 94, American politician and lawyer, Justice of the Michigan Supreme Court (1973–1996).Former Michigan Supreme Court Justice Charles Levin dies at 94 *Jonas Mello, 83, Brazilian actor (Cassiopeia, The Happy Cricket and the Giant Bugs, A Escrava Isaura).Ator Jonas Mello, de ‘Flor do Caribe’, morre aos 83 anos *Helen Morgan, 54, Welsh field hockey player, Olympic bronze medalist (1992), cancer.GB Hockey Olympian Helen Morgan passes away, aged 54 *Hayford Peirce, 78, American science fiction writer (Napoleon Disentimed), suicide by gunshot.Husband and wife dead after incident in Foothills area *Alcino Pinto, 64, São Toméan politician, President of the National Assembly (2012–2014).Alcino Pinto descansa em paz *André Quilis, 79, French rugby union player (RC Narbonne, national team) and coach.Rugby à XV : décès de l'ex-international et joueur de Narbonne, André Quilis *Khadim Hussain Rizvi, 54, Pakistani Islamic preacher, founder of Tehreek-e-Labbaik Pakistan.TLP chief Khadim Hussain Rizvi passes away in Lahore *Jake Scott, 75, American Hall of Fame football player (Miami Dolphins, Washington Redskins), Super Bowl champion (1973, 1974), Super Bowl MVP (1973), problems caused by a fall.Jake Scott, former Miami Dolphins star and Super Bowl MVP, dies at 75 *Herbert Franklin Solow, 89, American television producer (Mission: Impossible, Star Trek: The Original Series, Man from Atlantis).Herb Solow, Producer Who Sold ‘Star Trek’ to NBC, Dies at 89 *Stan Trafford, 74, English footballer (Port Vale, Macclesfield Town) and cricketer (Staffordshire).People like Stan are not made anymore. We've lost someone you can't replace ===20=== *Antonio Ambrosetti, 75, Italian mathematician, discoverer of the mountain pass theorem.Morto il matematico Antonio Ambrosetti, professore ordinario della Normale di Pisa *Ernesto Canto, 61, Mexican race walker, Olympic champion (1984), liver and pancreatic cancer.Ernesto Canto, medallista olímpico mexicano, falleció este viernes *Marian Cycoń, 80, Polish politician, Mayor of Nowy Sącz (1988–1990) and Stary Sącz (1995–1998, 2002–2011) and Deputy (1997–2001, 2011–2015).Marian Cycoń nie żyje. Był m.in. posłem i burmistrzem Starego Sącza *Jean Darnel, 96–97, French theatre actor and director.Jean Darnel, professeur d'excellence *Rudy del Rosario, 51, Filipino footballer (Kaya, national team) and manager.Former Azkals striker Rudy del Rosario passes away *Jacques Déprez, 82, French Olympic hurdler (1960).Jacky Desprez est mort *Mony Elkaïm, 79, Moroccan-Belgian psychiatrist and psychotherapist.Hommage à Mony Elkaïm, pionnier du champ des thérapies familiales *Irinej, 90, Serbian Eastern Orthodox prelate, Bishop of Niš (1975–2010) and Patriarch of the Serbian Orthodox Church (since 2010), COVID-19.Patriarch of Serbian Orthodox Church dies due to coronavirus *Judith Jarvis Thomson, 91, American moral philosopher (A Defense of Abortion) and metaphysician, member of the American Philosophical Society (since 2019).Judith Jarvis Thomson (1929-2020) *Hannu Lahtinen, 60, Finnish Olympic wrestler (1984), problems caused by ALS.Suru-uutinen: Painin maailmanmestari Hannu Lahtinen, 60, on kuollut *Jan Morris, 94, Welsh historian (Pax Britannica Trilogy) and travel writer.Travel writer and journalist Jan Morris dies at 94 *František Reichel, 82, Czech politician, Deputy Prime Minister of Czechoslovakia (1989–1990).Zemřel vědec a bývalý politik František Reichel, byl jedním z hlavních organizátorů pouti na svatořečení Anežky České *John Rowland, 79, English footballer (Nottingham Forest, Port Vale, Mansfield Town).RIP John Rowland *Rita Sargsyan, 58, Armenian socialite and music educator, First Lady (2008–2018), COVID-19.Armenian ex-President’s wife Rita Sargsyan dies aged 58 *Ken Schinkel, 87, Canadian ice hockey player (New York Rangers, Pittsburgh Penguins).Former Penguins forward, coach, executive Ken Schinkel dies at 87 ===21=== *Chen Ailian, 81, Chinese dancer, stomach cancer.著名舞蹈家陈爱莲逝世 享年81岁 *Dena Dietrich, 91, American actress (Chiffon margarine commercials).Dena Dietrich, Actress Who Played Mother Nature in Margarine Commercials, Dies at 91 *Oliver Friggieri, 73, Maltese poet, writer and philosopher.Oliver Friggieri, a giant of Maltese literature, dies aged 73 *Alvin Holmes, 81, American politician, member of the Alabama House of Representatives (1974–2018).Alvin Holmes, longtime outspoken Alabama legislator who fought for equality, dies *Malcolm Marmorstein, 92, American movie director (Dead Men Don't Die) television writer (Dark Shadows) and screenwriter (Pete's Dragon), cancer.Malcolm Marmorstein Dies: ‘Pete’s Dragon’, ‘Dark Shadows’ Writer Was 92 *Tamás Mihály, 73, Hungarian rock bassist (Omega).Meghalt Mihály Tamás, az Omega együttes basszusgitárosa *Artemije Radosavljević, 85, Serbian Orthodox prelate, Eparch of Raška and Prizren (1991–2010), COVID-19.Preminuo raščinjeni vladika Artemije *Jožef Smej, 98, Slovenian Roman Catholic prelate, Auxiliary Bishop of Maribor (1983–2009).Umrl je upokojeni škof Jožef Smej *Jens Sørensen, 79, Danish Olympic racing cyclist (1960).Jens Sørensen er død *Ricky Yacobi, 57, Indonesian footballer (PSMS Medan, Arseto Solo, national team), heart attack.Mantan Penggawa Timnas Indonesia Ricky Yacobi Meninggal Dunia ===22=== *Sidi Ould Cheikh Abdallahi, 82, Mauritanian politician, President (2007–2008).Ex-Mauritanian President Ould Cheikh Abdallah Dies Aged 82 - State Media *Carlo Ausino, 82, Italian movie director (Double Game, Tony: Another Double Game, Don't Look in the Attic) and cinematographer.Morto Carlo Ausino, il regista di «Torino violenta» *Paul Callan, 81, British journalist (Evening Standard, Daily Mail, Daily Mirror), fall.Daily Mirror legend Paul Callan, 81, tragically dies as tributes paid to journalist *Anwar Aziz Chaudhry, 89, Pakistani Olympic swimmer (1948) and politician, MP (1988–1990).Anwar Aziz Chaudhry, father of PML-N leader Daniyal Aziz passes away *Doris de Agostini, 62, Swiss Olympic alpine skier (1976, 1980).Ski: décès de la Tessinoise Doris De Agostini *Billy Evans, 88, American basketball player (Kentucky Wildcats), Olympic champion (1956).UK Athletics Hall of Famer Billy Evans Dead at 88 *Gonzalo Galván Castillo, 69, Mexican Roman Catholic prelate, Bishop of Autlán (2004–2015).Fallece Gonzalo Galván Castillo, obispo emérito de la Diócesis de Autlán *José Vicente Gimeno Sendra, 71, Spanish politician and lawyer, Judge of the Constitutional Court (1989–1998).Tenía 71 años: fallece Vicente Gimeno Sendra, exmagistrado del Constitucional y jurista muy reconocido *Elena Hrenova, 70, Moldovan politician, MP (2014–2019), COVID-19.Fosta deputată PSRM Elena Hrenova a murit din cauza infecției cu noul coronavirus *Lupo, 8, British royal dog.Lupo, the Cambridge Family dog, has died (death announced on this date) *Hamish MacInnes, 90, Scottish mountaineer.Hamish McInnes, Scotland's greatest ever climber, dies at 90 *Mustafa Nadarević, 77, Bosnian- Croatian actor (When Father Was Away on Business, The Glembays, Silent Gunpowder) and comedian, lung cancer.In memoriam / Preminuo Mustafa Nadarević *Ray Prosser, 93, Welsh rugby union player (Pontypool, British and Irish Lions, Barbarian F.C.).Ray Prosser: Pontypool coaching legend and Wales prop dies aged 93 *Patrick Quinn, 37, American disability activist, co-founder of Ice Bucket Challenge, problems caused by ALS.Pat Quinn, the co-founder of the ALS Ice Bucket Challenge, dies at 37 *Noëlla Rouget, 100, French resistant and teacher.Mort de la résistante Noëlla Rouget, la déportée qui fit gracier son bourreau *Maurice Setters, 83, English football player (West Bromwich Albion, Manchester United) and manager (Doncaster Rovers), problems caused by Alzheimer's disease.Jack Charlton's right-hand man Maurice Setter has died, aged 83 *Corrie van Gorp, 78, Dutch singer and actress (De Wereld Draait Door).Actrice Corrie van Gorp (78) overleden ===23=== *Vinicio Bernardini, 94, Italian politician and businessman, Mayor of Pisa (1971, 1983–1985) and Deputy (1976–1989), problems caused by COVID-19.Morto l’ex sindaco di Pisa Vinicio Bernardini *Vittorio Catani, 80, Italian science fiction writer.Vittorio Catani non c’è più. Tra i primi a scrivere in Italia di Fantascienza *Karl Dall, 79, German actor (Freddy in the Wild West, Hotel Clausewitz, Student of the Bedroom), singer and comedian, problems caused by a stroke.Komiker Karl Dall stirbt mit 79 Jahren *Abby Dalton, 88, American actress (Falcon Crest, The Joey Bishop Show, Hennesey).Abby Dalton, Actress on 'Falcon Crest' and 'The Joey Bishop Show,' Dies at 88 *David Dinkins, 93, American politician, member of the New York State Assembly (1966), Borough President of Manhattan (1986–1989) and Mayor of New York City (1990–1993), respiratory failure.David Dinkins, New York City’s first black mayor, dies at 93 *Otto Duintjer, 88, Dutch philosopher and educator.Otto D. Duintjer Biography *Admir Džubur, 56, Bosnian businessman and football administrator, Chairman of Željezničar Sarajevo (since 2019), COVID-19.Preminuo predsjednik FK Željezničar Admir Džubur, bio zaražen koronavirusom *Marco Virgilio Ferrari, 87, Italian Roman Catholic prelate, Auxiliary Bishop of Milan (1987–2009).Bishop Marco Virgilio Ferrari *John Gilbert Getty, 52, American businessman (Getty Oil) and rock musician, grandson of J. Paul Getty.John Gilbert Getty, heir to the Getty oil fortune, dead at 52 *Tarun Gogoi, 84, Indian politician, Chief Minister of Assam (2011–2016), MP (1971–1984, 1991–1996, 1998–2001) and Assam MLA (1996–1998, since 2001), problems caused by COVID-19.Former Assam CM Tarun Gogoi dies at 86 *Robert Hammerstiel, 87, Yugoslav-born Austrian painter, writer and engraver, member of the Vojvodina Academy of Sciences and Arts.Maler Robert Hammerstiel verstorben *Arthur Hervet, 82, French Roman Catholic priest.Le père Arthur, infatigable «prêtre des Roms» dans la métropole lilloise, est décédé ce lundi *Hal Ketchum, 67, American country singer-songwriter (\"Small Town Saturday Night\", \"Past the Point of Rescue\", \"Hearts Are Gonna Roll\"), problems caused by Alzheimer's disease.Hal Ketchum Dead: Country Singing Icon Dies at 67 After Battle With Dementia *Edward Lazear, 72, American economist and politician, Chairman of the Council of Economic Advisers (2006–2009), pancreatic cancer.Trailblazing economist and presidential adviser Edward Lazear dies at 72 *Peter Lichtner- Hoyer, 93, Austrian Olympic equestrian (1956), pentathlete (1960) and colonel.Reiterwelt trauert um Peter Lichtner-Hoyer *Édouard Marquis, 51, French television news anchor (France 2, France 5, TV5Monde) and radio personality.Propriétaire du château de Culan, Édouard Marquis est décédé à l'âge de 51 ans *Anele Ngcongca, 33, South African footballer (FC Fortune, Genk, national team), car crash. *John Oldham, 97, American basketball player (Fort Wayne Pistons) and coach (Tennessee Tech Golden Eagles, Western Kentucky Hilltoppers).John Oldham, coach of WKU's 1971 Final Four basketball team, dies at age 97 *Günter Rittner, 93, German painter and illustrator. *Józef Rysula, 81, Polish Olympic skier (1960, 1964, 1968).Zmarl Trzykrotny Olimpijczyk Jozef Rysula *Nikola Spasov, 61, Bulgarian footballer (Dunav Ruse, Cherno More) and manager (Kaliakra Kavarna), COVID-19.Бывший тренер \"Кызыл-Жар СК\" скончался от коронавируса *Viktor Zimin, 58, Russian politician, Head of the Republic of Khakassia (2009–2018).Скончался экс-глава Хакасии Виктор Зимин ===24=== *João Alves Filho, 79, Brazilian politician and civil engineer, Governor of Sergipe (1983–1987, 1991–1995, 2003–2007) and Mayor of Aracaju (1975–1979, 2013–2017), COVID-19.Morre, aos 79 anos, o ex-governador de Sergipe João Alves Filho *Rose Marie Battaglia, 91, American Hall of Fame college basketball coach (Bergen Community College, Iona College), lung cancer.Hall of Fame girls basketball coach Dr. Rose Battaglia dies at 91 *Fasih Bokhari, 78, Pakistani military officer and politician, Chief of Naval Staff (1997–1999) and Chairman of the National Accountability Bureau (2011–2013). *Juan de Dios Castro Lozano, 78, Mexican lawyer and politician, MP (1979–1985, 1991–2000, 2003–2006) and President of the Chamber of Deputies (2003–2004), COVID-19.Muere el panista Juan de Dios Castro Lozano *Montserrat Carulla, 90, Spanish actress (Furrows, Companys, procés a Catalunya, The Orphanage).Fallece Montserrat Carulla *José de Bastos, 91, Portuguese footballer (Benfica, Beira-Mar) and manager (Estoril Praia).Morreu José Bastos, antiga glória do Benfica *Christophe Dominici, 48, French rugby union player (Toulon, Stade Français, national team), fall.French rugby legend Dominici dies in park tragedy *Paolo Gabriele, 54, Italian papal personal butler (Benedict XVI) and convicted thief (Vatican leaks scandal).Pope Benedict XVI's former butler, Paolo Gabriele, dies *Erik M. Galimov, 84, Russian geochemist, member of the Russian Academy of Sciences (since 1994).Умер академик Эрик Галимов, руководивший программами по изучению Луны *Julio César Gandarilla Bermejo, 77, Cuban Revolutionary Armed Forces vice admiral and politician, Minister of the Interior (since 2017).Falleció el Vicealmirante Julio Cesar Gandarilla Bermejo *Jim Hanifan, 87, American football coach (St. Louis Cardinals) and player (Toronto Argonauts).Former Cardinals coach Jim Hanifan dies at 87 *Damián Iguacén Borau, 104, Spanish Roman Catholic prelate, Bishop of San Cristóbal de La Laguna (1984–1991), pneumonia caused by COVID-19.Fallece a los 104 años de edad Mons. Damián Iguacen, obispo emérito de Tenerife *Mohammad Khadem, 85, Iranian Olympic wrestler (1960), World Wrestling silver medalist (1962).Former Iran wrestler Mohammad Khadem dies *Kambuzia Partovi, 65, Iranian movie director (Café Transit, Closed Curtain) and screenwriter (The Circle, Muhammad: The Messenger of God), COVID-19.Veteran film director Kambuzia Partovi passes away at 65 *Alan Ramsey, 82, Australian journalist (Sydney Morning Herald) and speechwriter, problems caused by dementia.Alan Ramsey, former Herald journalist, dies aged 82 *Kalbe Sadiq, 81, Indian Islamic scholar and philanthropist, pneumonia caused by colorectal cancer.AIMPLB vice president Maulana Kalbe Sadiq passes away in Lucknow *Fred Sasakamoose, 86, Canadian ice hockey player (Chicago Blackhawks), COVID-19.Fred Sasakamoose, one of NHL's first Indigenous athletes, dead at 86 *Mamadou Tandja, 82, Nigerien politician, President (1999–2010).Niger: décès de l'ancien président Mamadou Tandja *Fernando Vanucci, 69, Brazilian sports journalist and commentator (Rede Globo, TV Bandeirantes, RedeTV!), heart attack.Morre aos 69 anos o jornalista Fernando Vanucci *Vasil Yakusha, 62, Ukrainian-born Soviet-Belarusian rower, Olympic silver (1980) and bronze medalist (1988).На 63-м году жизни ушел из жизни Василий Фёдорович Якуша ===25=== *Uriah Adolphus Ashley Maclean, 76, Panamanian Roman Catholic prelate, Bishop of Penonomé (1993–2015).Bishop Uriah Adolphus Ashley Maclean *Marc-André Bédard, 85, Canadian lawyer and politician, Quebec MNA (1973–1985) and Deputy Premier of Quebec (1984–1985), COVID-19.COVID-19: l’ex-ministre Marc-André Bédard est décédé *Saïd Bouhadja, 82, Algerian politician, member (since 2017) and President of the People's National Assembly (2017–2018), 2019 presidential candidate.Décès de l’ancien président de l’APN Saïd Bouhadja *Diego Maradona, 60, Argentine footballer (Argentinos Juniors, Barcelona, Napoli, national team) and manager, World Cup winner (1986), heart attack.Diego Maradona: Argentina legend dies aged 60 *José Manuel Mireles Valverde, 62, Mexican medical doctor and anti-cartel activist, COVID-19.Fallece José Manuel Mireles, exlíder de las autodefensas de Michoacán, por COVID-19 *Heavy D, 43, British television personality (Storage Hunters, Celebrity Big Brother).Heavy D dead - Celebrity Big Brother star dies aged 43 *Ahmad Mukhtar, 74, Pakistani businessman and politician, Minister of Defence (2008–2012) and Water and Power (2012–2013).Former Defense Minister Ahmad Mukhtar Passes Away *Paul Nyman, 91, Russian-born Finnish Olympic cyclist (1952, 1956, 1960).Paul Nyman *Ahmed Patel, 71, Indian politician, MP (1977–1989, since 1993) and Treasurer of AICC (since 2018), multiple organ failure caused by COVID-19.Senior Congress leader Ahmed Patel dies due to multiple organ failure *Markus Paul, 54, American football player (Chicago Bears) and coach (New York Giants, Dallas Cowboys).Dallas Cowboys strength and conditioning coach Markus Paul, 54, dies *Zenon Plech, 67, Polish motorcycle speedway rider.Żużel. Nie żyje Zenon Plech, jeden z najwybitniejszych polskich żużlowców w historii *Jacques Secrétin, 71, French table tennis player, world champion (1977).Jacques Secrétin, pionnier du tennis de table français, est mort *Flor Silvestre, 90, Mexican bolero singer (\"Cielo rojo\", \"Mi destino fue quererte\"), actress (The Soldiers of Pancho Villa, Ánimas Trujano), and equestrienne.Muere la cantante Flor Silvestre, mamá de Pepe Aguilar *Reinaldo Teles, 70, Portuguese football executive (FC Porto), COVID-19.FC Porto: Faleceu Reinaldo Teles, dirigente histórico dos dragões *Camilla Wicks, 92, American violinist.Camilla Wicks, acclaimed mid-century violin virtuoso, dies at 92 *Sir James Wolfensohn, 86, Australian-American banker and Olympic fencer (1956), President of the World Bank Group (1995–2005), problems caused by pneumonia.Sir James D. Wolfensohn, Who Led the World Bank and Chaired the IAS Board, Dies at 86 ===26=== *George H. Carley, 82, American politician and lawyer, Justice of the Supreme Court of Georgia (1993–2012), COVID-19.Former Georgia Supreme Court chief justice dies from virus *Cecilia Fusco, 87, Italian operatic soprano and educator, COVID-19.Latisana piange la soprano Maria Cecilia Fusco *Jamir Garcia, 42, Filipino alternative metal singer- songwriter (Slapshock), suicide by hanging.Tributes paid to Slapshock vocalist Jamir Garcia, dead at 42 *Vladimir Ivanov, 65, Bulgarian Olympic sprinter (1980), problems caused by COVID-19.Рекордьорът на 200 м Владимир Иванов почина на 65 години *Benjamín Jiménez Hernández, 82, Mexican Roman Catholic prelate, Bishop of Culiacán (1993–2011).Murio el obispo emérito-de Culiacán Benjamín Jiménez Hernández *F. C. Kohli, 96, Indian engineer and software businessman, founder of Tata Consultancy Services and President of NASSCOM (1995–1996), heart attack.Faqir Chand Kohli, father of India's software industry, passes away *Dimitar Largov, 84, Bulgarian footballer (Slavia Sofia, national team).Почина бившият президент на БФС и капитан на България Димитър Ларгов *Sadiq al-Mahdi, 84, Sudanese politician, Prime Minister (1966–1967, 1986–1989), COVID-19. *Alfonso Milián Sorribas, 81, Spanish Roman Catholic prelate, Bishop of Barbastro-Monzón (2004–2014).Fallece a los 81 años Mons. Alfonso Milián, obispo emérito de Barbastro-Monzón *Tevita Momoedonu, 74, Fijian politician, Prime Minister (2000, 2001).Ratu Tevita passes away *Daria Nicolodi, 70, Italian actress (Deep Red, Shock) and screenwriter (Suspiria).Morta Daria Nicolodi, attrice cult di Profondo Rosso: dalla relazione con Dario Argento nacque Asia *Louis Nzala Kianza, 74, Congolese Roman Catholic prelate, Bishop of Popokabaka (1996–2020).Bishop Louis Nzala Kianza † *Hafez Abu Seada, 55, Egyptian politician and human rights activist, Chairman of the Egyptian Organization for Human Rights (since 2004), COVID-19.وفاة حافظ أبو سعدة رئيس المنظمة المصرية لحقوق الإنسان متأثرًا بـ «كورونا» *Kamen Tchanev, 56, Bulgarian operatic tenor, COVID-19.Bulgarian international opera star Kamen Chanev dies of Covid-19 *Celestino Vercelli, 74, Italian Tour de France racing cyclist (1971, 1976).Ciclismo in lutto per Celestino Vercelli, gregario dei campioni e poi imprenditore di successo *Dadang Wigiarto, 53, Indonesian politician, Regent of Situbondo (since 2010), COVID-19.Terpapar Corona, Bupati Situbondo Meninggal Dunia ===27=== *Kevin Burnham, 63, American sailor, Olympic champion (2004) and silver medalist (1992), problems caused by lung disease.Olympic Champion Kevin Burnham Passes Away *Mohsen Fakhrizadeh, 62–63, Iranian Revolutionary Guard general and nuclear scientist (Project 111, Lavizan-Shian), shot.Iran scientist linked to military nuclear program killed *Gene Fraise, 88, American politician, member of the Iowa Senate (1986–2013), COVID-19.Eugene Stace \"Gene\" Fraise *Špiro Guberina, 87, Croatian actor (The Secret of an Old Attic, Agonija, The Last Will).Umro je Špiro Guberina *Tony Hsieh, 46, American internet businessman and venture capitalist, co-founder of LinkExchange and CEO of Zappos (1999–2020), injuries caused by a house fire.Tony Hsieh, former Zappos CEO, passes away at 46 *Madieng Khary Dieng, 88, Senegalese politician, Minister of the Interior (1991–1993) and Ambassador to The Gambia (1996–1998).Décès de l’ancien ministre de l’Intérieur Madieng Khary Dieng *Bob Miller, 94, American baseball player (Philadelphia Phillies).Bob Miller, 2nd-to-last 1950 Phillies Whiz Kid, dies at 94 *Jim McFarland, 73, American football player (St. Louis Cardinals, Miami Dolphins) and politician, member of the Nebraska Legislature (1986–1991), pancreatic cancer.Former Nebraska football player, state senator McFarland dies at 73 *Lou Nistico, 67, Canadian ice hockey player (Toronto Toros, Colorado Rockies).Not many London Knights made their mark like Leapin' Lou Nistico *Juan Carlos Pérez Loizeau, 91, Argentine television news anchor (El Trece), problems caused by pneumonia.Juan Carlos Pérez Loizeau died: he was 91 years old *Dieter Popp, 82, German insurance agent and National People's Army spy.Er warb sogar seinen Liebhaber an Ex-DDR- Spion (82) tot in Bonner Krankenhaus *Parviz Poorhosseini, 79, Iranian actor (Bashu, the Little Stranger, The Fifth Season, Saint Mary), COVID-19.کرونا جان پرویز پورحسینی، بازیگر سینما و تلویزیون، را هم گرفت *Aly Zaker, 76, Bangladeshi actor (Agami, Nodir Naam Modhumoti, Lalsalu), businessman and writer, COVID-19.Ekushey Padak recipient actor, director Aly Zaker passes away ===28=== *Shams Badran, 91, Egyptian politician and military official, Commander of the Egyptian Armed Forces and Minister of Defense (1966–1967).وفاة وزير الحربية المصري الأسبق شمس بدران في لندن *Hakam Balawi, 82, Palestinian politician and writer, Ambassador to Libya (1973–1975) and Tunisia (1983–1984) and Minister of the Interior (2003–2005).وفاة المناضل الفلسطيني حكم بلعاوي *Clifton Bertrand, 84, Trinidadian Olympic sprinter (1960, 1964), Pan American Games bronze medalist (1959, 1963).Olympian Bertrand passes at 84 *Philippe Clair, 90, Moroccan-born French actor (Girl on the Road), filmmaker (Déclic et des claques, Par où t'es rentré ? On t'a pas vu sortir) and comedian.Philippe Clair, réalisateur culte de comédies franchouillardes, nous a quittés *Roger Fite, 82, French rugby union player (Cahors Rugby, CA Brive, national team).L'emblématique 3e ligne du CAB et du Sporting Club Tulliste Roger Fite est décédé *Jan Kilian, 66, Polish politician and businessman, member of the Sejm (2015–2019).Nie żyje Jan Kilian. Miał 67 lat *Vítor Oliveira, 67, Portuguese footballer (Leixões) and manager (Paços de Ferreira, Gil Vicente), heart attack.Morreu o treinador Vítor Oliveira *Bonifácio Piccinini, 91, Brazilian Roman Catholic prelate, Archbishop of Cuiabá (1981–2004).Morre aos 91 anos, Dom Bonifácio Piccinini arcebispo emérito de Cuiabá *Maria Piechotka, 100, Polish architect and politician, member of the Sejm (1961–1965).W wieku 100 lat umarła Maria Piechotkowa *David Prowse, 85, English bodybuilder, weightlifter and actor (Star Wars, A Clockwork Orange, Jabberwocky), COVID-19.David Prowse, Man Behind the Darth Vader Mask, Dies at 85 *Juan de Dios Román, 77, Spanish handball coach (Atlético Madrid BM, BM Ciudad Real, national team) and executive, President of the RFEBM (2008–2013), stroke.Muere a los 77 años Juan de Dios Román, el gran ideólogo del balonmano español *Jean-Louis Servan- Schreiber, 83, French journalist (L'Expansion, Psychologies, L'Express) and human rights activist, member of the Human Rights Watch (since 2007), COVID-19.Jean-Louis Servan-Schreiber est décédé ===29=== *Miša Aleksić, 67, Serbian rock singer-songwriter (\"Mrtva priroda\", \"Zbogom, Srbijo\", \"Ostalo je ćutanje\") and bassist (Riblja Čorba), problems caused by COVID-19.Preminuo basista Riblje čorbe Miša Aleksić *Sahibzada Farooq Ali, 89, Pakistani politician, member (1972–1977) and Speaker of the National Assembly (1973–1977). *José Rafael Barquero Arce, 89, Costa Rican Roman Catholic prelate, Auxiliary Bishop of Alajuela (1980–2007).Muere monseñor José Rafael Barquero, obispo emérito de Alajuela *Ben Bova, 88, American science fiction novelist (The Star Conquerors, Grand Tour, Vengeance of Orion) and literary critic, multi-Hugo Award winner, pneumonia and stroke caused by COVID-19.Legendary Science Fiction Author Ben Bova Has Died *Marco Dino Brogi, 88, Italian Roman Catholic prelate and Vatican City diplomat, Apostolic Nuncio to Egypt (1997–2007) and Delegate to the Arab League (2002–2006).Archbishop Marco Dino Brogi, O.F.M. *Tom Casperson, 61, American politician, member of the Michigan House of Representatives (2003–2008) and State Senate (2011–2018), lung cancer.Former U.P. lawmaker Sen. Tom Casperson dies at 61 *Papa Bouba Diop, 42, Senegalese footballer (Fulham, Portsmouth, national team), problems caused by ALS and Charcot–Marie–Tooth disease.Papa Bouba Diop: Ex-Fulham midfielder dies at 42 *Vladimir Fortov, 74, Russian physicist, member (since 1991) and President of the Russian Academy of Sciences (2013–2017), COVID-19.Умер академик Владимир Фортов *Giorgio Morales, 88, Italian politician and activist, Mayor of Florence (1989–1995), problems caused by pneumonia.E' morto l'ex sindaco Giorgio Morales *Peg Murray, 96, American actress (Cabaret), Tony winner (1967).From Broadway to Southold, Peg Murray inspired a love of performance and connection *Remo Sernagiotto, 65, Italian politician, MEP (2014–2019), heart attack.Morto a Treviso ex deputato europeo Sernagiotto *Ali-Asghar Shahbazi, 98, Iranian actor (A Separation), cardiopulmonary arrest.علی اصغر شهبازی در سکوت درگذشت *Viorel Turcu, 60, Romanian footballer (Argeș Pitești, Steaua București, national team), heart attack.A murit Voirel Turcu! Helmut Duckadam, cu ochii plini de lacrimi: ”Șunt șocat! Vorbisem să ne vedem la un ceaun!” ===30=== *Irina Antonova, 98, Russian art historian, Director of the Pushkin Museum (1961–2013), COVID-19.Умерла президент российского ГМИИ им. Пушкина Ирина Антонова *Dee Benson, 72, American politician and lawyer, member (since 1991) and Chief Justice of the U.S. District Court for the District of Utah (1999–2006), brain cancer.U.S. District Judge Dee Benson dies at age 72 *Betty Bobbitt, 81, American-born Australian actress (Prisoner, Crocodile Dundee II, Crocodile Dundee in Los Angeles), stroke.Prisoner's Betty Bobbitt dies *Liliane Juchli, 87, Swiss nurse and health writer, member of the Merciful Sisters of the Holy Cross, COVID-19.Trauer um Schwester Liliane Juchli *Frank Kramer, 73, Dutch footballer (FC Volendam, Telstar), television presenter and sports commentator (AVRO, Eurosport), problems caused by a stroke.Presentator en oud-voetballer Frank Kramer op 73-jarige leeftijd overleden *Kiran Maheshwari, 59, Indian politician, MP (2004–2009), COVID-19.Ashok Gehlot condoles the death of BJP MLA Kiran Maheshwari *Aleksandr Shatskikh, 46, Kazakh footballer (Kainar, national team) and manager.Ушел из жизни экс-футболист КПЛ и тренер Александр Шатских *Anne Sylvestre, 86, French singer-songwriter and guitarist (\"Fabulettes\"), problems caused by a stroke.Anne Sylvestre, chanteuse pour petits et grands et artiste féministe, est morte *Tan Eng Bock, 84, Singaporean Olympic water polo player (1956), stroke.Obituary: Tan Eng Bock, 'Mr Water Polo', dies at 84 ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *11 Deaths",
 "title": "Deaths in November 2020"
}