{
 "id": "755395",
 "text": "The following is a list of deaths that should be noted in July 2020. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non- humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==July== thumb|right|120px| thumb|right|120px| thumb|right|120px| thumb|right|120px| thumb|right|120px| ===1=== *Kwadwo Owusu Afriyie, 63, Ghanaian politician and businessman, CEO of the Forestry Commission (since 2018), COVID-19. *Edward A. Burkhalter, 91, American Navy vice admiral, heart attack. *Cao Zhi, 92, Chinese politician, Vice Chairman of the National People's Congress (1998–2003).第九届全国人大常委会副委员长曹志逝世 享年93岁 *Max Crook, 83, American keyboard player and songwriter (\"Runaway\"), invented the Musitron. *Gay Culverhouse, 73, American academic administrator and sports executive, President of the Tampa Bay Buccaneers (1991–1994) and Notre Dame College (1995–1996), myelofibrosis.Gay Culverhouse, Ex-Bucs President and Player Safety Advocate, Dies at Age 73 *Hugh Downs, 99, American broadcaster and television host (20/20, Today), heart failure.American broadcaster Hugh Downs dies at age 99 *Luizinho Drummond, 80, Brazilian illegal lottery operator, President of the Independent League of Samba Schools of Rio de Janeiro (1998–2001), stroke.Morre Luizinho Drumond, presidente da Imperatriz *Bill Duplissea, 70, American politician, member of the California State Assembly (1986–1988), cancer.Bill Duplissea, one of the Bay Area’s last Republican legislators, dies at 70 *David F. Gantt, 78, American politician, member of the New York State Assembly (since 1983).State Assemblyman David Gantt Dies *Beate Grimsrud, 57, Norwegian novelist, playwright and screenwriter (Ballen i øyet), breast cancer.Forfatteren Beate Grimsrud er død *Heinrich Fink, 85, German theologian and politician, member of the Bundestag (1998–2001).Theologe Heinrich Fink gestorben *Ida Haendel, 91, Polish-born British violinist, kidney cancer.Ida Haendel obituary *Alfred Kotey, 52, Ghanaian Olympic boxer (1988), WBO bantamweight champion (1993, 1994), problems caused by a stroke. *Lin Moyu, 96, Chinese actress (A Dream of Red Mansions).电影版《红楼梦》“贾母”林默予去世 享年96岁 *Ian MacDougall, 82, Australian Navy admiral, Chief of the Naval Staff (1991–1994). *Santiago Manuin Valera, 63, Peruvian Awajún leader and Indigenous rights activist, COVID-19.Fallece líder awajún Santiago Manuin a causa de la COVID-19 en Chiclayo *Eurídice Moreira, 81, Brazilian politician, Paraíba MLA (1995–1998) and Mayor of Itabaiana (2005–2012), COVID-19.Ex-prefeita e ex-deputada estadual Dona Dida morre em João Pessoa *Latifur Rahman, 75, Bangladeshi businessman (Transcom Group), member of the International Chamber of Commerce (2014–2017).Transcom chairman Latifur Rahman dies *Emmanuel Rakotovahiny, 81, Malagasy politician, Prime Minister (1995–1996), heart disease.L’ancien Premier ministre Emmanuel Rakotovahiny décède *Georg Ratzinger, 96, German Roman Catholic priest, Conductor of the Regensburger Domspatzen (1964–1994), older brother of Pope Benedict XVI.Papst-Bruder Georg Ratzinger ist tot *Pedro Luis Ronchino, 92, Argentine Roman Catholic prelate, Bishop of Comodoro Rivadavia (1993–2005).Bishop Pedro Luis Ronchino *Paul Seban, 90, Algerian-born French movie director (La Musica, French Cancan).Le documentariste Paul Seban est mort *Billy Tang, 69, Hong Kong movie director (Dr. Lamb, Those Were the Days..., Dial D for Demons), nasopharynx cancer.Hong Kong director Billy Tang dead at age 69 *Aleksejs Vidavskis, 76, Latvian politician, Mayor of Daugavpils (1994–2001).Mūžībā devies bijušais Daugavpils mērs un Saeimas deputāts Aleksejs Vidavskis *Sir Everton Weekes, 95, Barbadian cricketer (West Indies, national team). *Sybil Wettasinghe, 92, Sri Lankan children's author and illustrator, heart failure.Veteran children’s author, Kala Keerthi Sybil Wettasinghe passed away at the age of 93 ===2=== *Paolo Cabras, 89, Italian politician, MP (1972–1994).Ci lascia Paolo Cabras *Raymond Carter, 84, British politician, MP (1970–1979).Members of our Association who have died during 2020 *Chiu Chuang-huan, 94, Taiwanese politician, Minister of Interior (1978–1981), Vice Premier (1981–1984) and President of the Examination Yuan (1993–1996), problems caused by pneumonia.Former Examination Yuan head Chiu Chuang-huan dies at 94 *Ole Holsti, 86, American political scientist.Ole Holsti, beloved professor emeritus, passed away *Ángela Jeria, 93, Chilean archaeologist and human rights activist, mother of President Michelle Bachelet.A los 93 años fallece Ángela Jeria, madre de la expresidenta Michelle Bachelet *Nikolai Kapustin, 82, Russian composer and pianist. *Jiří T. Kotalík, 69, Czech art historian, Rector of the Academy of Fine Arts, Prague (1997–2003, 2010–2014).Zemřel emeritní rektor a dlouholetý pedagog AVU, doc. Jiří Tomáš Kotalík *Wanderley Mariz, 79, Brazilian politician, Deputy (1975–1987), COVID-19.Internado com covid-19, morre o ex-deputado Wanderley Mariz *Teodoro Enrique Pino Miranda, 73, Mexican Roman Catholic prelate, Bishop of Huajuapan de León (since 2000), problems caused by cancer.Bishop Teodoro Enrique Pino Miranda *Tilo Prückner, 79, German actor (The NeverEnding Story, Iron Sky, Tatort), heart failure.Tilo Prückner ist tot *Kevin Rafferty, 73, American director (The Atomic Cafe, Blood in the Face) and cinematographer (Roger & Me), cousin of President George W. Bush, cancer.Renowned documentary filmmaker Kevin Rafferty of ‘The Atomic Cafe‘ dies at age 73 *Reckful, 31, Israeli-American Twitch streamer, suicide.Byron ‘Reckful’ Bernstein, Popular Twitch Streamer, Dies at 31 *Ronald L. Schwary, 76, American movie and television producer (Ordinary People, Batteries Not Included, Medium), Oscar winner (1981), multiple system atrophy.Ronald Schwary, Oscar-Winning Producer of 'Ordinary People,' Dies at 76 *Mike Walling, 69, English actor (Alfonso Bonzo, The Smoking Room), screenwriter (Not with a Bang) and comedian.Actor & writer Mike Walling dies at 69 *Yoon Sam-yook, 83, South Korean movie director (I Will Survive) and screenwriter (Yalkae, a Joker in High School, Suddenly at Midnight).시나리오 작가 겸 영화감독 윤삼육 씨 별세 ===3=== *Ejike Obumneme Aghanya, 87, Nigerian Army officer and electrical engineer. *Tyson Brummett, 35, American baseball player (Philadelphia Phillies), plane crash.Former Phillies RHP Tyson Brummett dies at 35 in plane crash *Earl Cameron, 102, Bermudian-born British actor (Doctor Who, Pool of London, The Interpreter), pneumonia. *Hermine de Clermont-Tonnerre, 54, French princess, writer and actress (La Ferme Célébrités, Riches, belles, etc.), motorcycle crash.Hermine de Clermont-Tonnerre est morte *Scott Erskine, 57, American serial killer, COVID-19.2 Condemned San Quentin Inmates Die Of Apparent COVID-19 Complications *Wahidul Haq, 87, Bangladeshi politician, Minister of Finance (1988, 1988–1990).সাবেক অর্থমন্ত্রী ওয়াহিদুল হকের ইন্তেকাল *Saroj Khan, 71, Indian choreographer (Mr. India, Nagina, Chandni), cardiac arrest.Ace choreographer Saroj Khan dies of cardiac arrest *Ardico Magnini, 91, Italian footballer (Pistoiese, Fiorentina, national team).Fiorentina in lutto: è morto Ardico Magnini, eroe del primo scudetto *Claude Mercier-Ythier, 88–89, French harpsichord maker.Décès du facteur de clavecins Claude Mercier-Ythier *Michel Meylan, 81, French politician, Mayor of Bonneville (1983–2001) and Deputy (1988–2002).Figure politique haut- savoyarde Michel Meylan est mort à 81 ans *Rubble, 31, British Maine Coon cat, world's oldest cat (since 2019).World's oldest cat dies aged 31 as heartbroken owner pays tribute (death announced on this date) *Leonardo Villar, 96, Brazilian actor (O Pagador de Promessas, The Hour and Turn of Augusto Matraga, Juego peligroso), cardiac arrest caused by heart failure.Ator Leonardo Villar morre aos 96 anos *Elba Perez-Cinciarelli, 76, American politician, member of the New Jersey General Assembly (2002–2004).Elba Perez- Cinciarelli, former assemblywoman, dies at 76 *Emily Howell Warner, 80, American Hall of Fame airline pilot and instructor, first woman captain of a scheduled American airline, problems caused by a fall and Alzheimer's disease.Emily Howell Warner, Who Broke a Sky-High Glass Ceiling, Dies at 80 ===4=== *Alan S. Becker, 74, American politician, lawyer and educator, member of the Florida House of Representatives (1972–1978), cancer.Alan S. Becker *Angelo Fagiani, 77, Italian Roman Catholic prelate, Archbishop of Camerino- San Severino Marche (1997–2007).Archbishop Angelo Fagiani *Ronnie and Donnie Galyon, 68, American conjoined twins, longest-lived conjoined twins in history, congestive heart failure.Galyon brothers, world’s longest-living conjoined twins from Dayton, die at 68 *Brandis Kemp, 76, American actress (Fridays, AfterMASH), brain cancer and COVID-19.Brandis Kemp Dies: Actress For ABC’s ‘Fridays’ And ‘AfterMASH’ Was 76 *Robert Mack, 61, Austrian Olympic ice hockey player (1988).KAC-Tormannlegende Robert Mack gestorben *Martha Rocha, 83, Brazilian model, Miss Brasil winner (1954), heart attack caused by respiratory failure.Martha Rocha, 1ª Miss Brasil, morre em Niterói, no RJ *Seninho, 71, Portuguese footballer (Porto, New York Cosmos, national team).Morreu Seninho. O ex-jogador do FC Porto que jogou com Pelé e grandes craques *Bhakti Charu Swami, 74, Indian spiritual teacher (International Society for Krishna Consciousness), founder of the A. C. Bhaktivedanta Swami Prabhupada, COVID-19.Bhakti Charu Swami Passes Away: ISKCON चे प्रमुख गुरु ‘भक्ति चारू स्वामी’ यांनी अमेरिकेत घेतला अखेरचा श्वास; कोरोना विषाणूमुळे झाले निधन *Earl Thomas, 71, American football player (Chicago Bears, St. Louis Cardinals, Houston Oilers).Earl Thomas, a former Chicago Bears wide receiver and tight end, dies at 71 *Mary Twala, 80, South African actress (Life, Above All, Beat the Drum, Sarafina!).Veteran actor Mary Twala has died *Kevin Wickham, 80, Australian Olympic rower (1964). ===5=== *Ragaa Al Geddawy, 85, Egyptian actress (The Nightingale's Prayer, A Rumor of Love) and model, COVID-19.Egyptian actress dies in coronavirus quarantine hospital *Bill Barlow, 89, Canadian politician and businessman, Ontario MPP (1981–1987).William Walter Barlow *Horace Barlow, 98, Australian neuroscientist. *Fiorenza Bassoli, 71, Italian politician, Mayor of Sesto San Giovanni (1985–1994).Sesto piange la scomparsa di Fiorenza Bassoli *Léo Bergoffen, 97, German-born French Holocaust survivor.Près d'Angers. Léo Bergoffen, dernier rescapé d'Auschwitz en Anjou, s'est éteint *Nick Cordero, 41, Canadian actor (Bullets Over Broadway, A Bronx Tale, Waitress), problems caused by COVID-19.Nick Cordero, Standout Actor in Broadway Musicals, Dies of COVID-19 Complications at 41 *Ayatullah Durrani, 64, Pakistani politician, MP (2008–2013), COVID-19.PPP leader Ayatullah Durrani passes away *Cleveland Eaton, 80, American jazz bassist.Alabama-born jazz bassist Cleveland Eaton dies at 80 *Bettina Gilois, 58, German-born American screenwriter (Bessie, Glory Road, McFarland, USA), cancer.Bettina Gilois Dies: Award-Winning Screenwriter For ‘Bessie’ And Author *Willi Holdorf, 80, German athlete, Olympic champion (1964).ehnkampf-Olympiasieger Holdorf gestorben *Mauro Mellini, 93, Italian lawyer and politician, Secretary of the Radical Party (1968–1969) and Deputy (1976–1992).Addio a Mauro Mellini, tra i fondatori del Partito Radicale *John Monaco, 78, American politician, Mayor of Mesquite, Texas (2007–2015).Former Mesquite Mayor John Monaco has died, officials confirm *Aubert Pallascio, 82, Canadian actor (The Kidnapping of the President, Black List, Punisher: War Zone) and comedian, cancer.Décès du comédien Aubert Pallascio *Brad Pye Jr., 89, American sports journalist (Los Angeles Sentinel), broadcaster, and community activist.Brad Pye Jr., Trailblazing Sports Writer and Broadcaster, Passes Away *Bob Reade, 87, American Hall of Fame college football player (Cornell University) and coach (Geneseo High School, Augustana College).Legendary Augustana, Geneseo football coach Bob Reade passes away *Juanito Rivera, 89, Filipino militant and politician, co-founder of the NPA, stroke.‘Ka Juaning,’ NPA cofounder, dies at 89 *Grethe Ryen, 70, Norwegian actress (Karjolsteinen, Den sommeren jeg fylte 15).Grethe Ryen *Tiloun, 53, Réunionese singer.Le chanteur de maloya, Tiloun, est décédé *Volodymyr Troshkin, 72, Ukrainian football player (Dynamo Kyiv, USSR national team), manager (Veres Rivne) and executive.Не стало Володимира Трошкіна… *Judy Wade, 81, British journalist (The Sun) and author.FAREWELL TO SUN'S ROYAL ACE Sun royal expert and author Judy Wade dies aged 81 *Ashoka Wadigamangawa, 68, Sri Lankan politician, MP (1989–1994), car crash.Accident kills Ashoka Wadigamangawa *Mahendra Yadav, 70, Indian politician, Delhi MLA (1998–2003) and convicted criminal, COVID-19.Former Delhi MLA and convict in 1984 anti-Sikh riots case dies of Covid-19 ===6=== *Inuwa Abdulkadir, 54, Nigerian lawyer and politician, Minister of Youth Development (2012–2013), COVID-19.Ex-APC NWC Member, Inuwa Abdulkadir, Is Dead *Rosario Bléfari, 54, Argentine actress (Poor Butterfly, I, the Worst of All, Rapado) and rock singer-songwriter, problems caused by leukaemia.Murió Rosario Bléfari: La música, actriz y escritora que representó a toda una generación *Carme Contreras i Verdiales, 87, Spanish actress (El Cor de la Ciutat).Mor l’actriu Carme Contreras, la Roser del Cor de la Ciutat i la veu d’ET *Charlie Daniels, 83, American Hall of Fame country rock singer-songwriter and musician (\"The Devil Went Down to Georgia\", \"Uneasy Rider\"), Grammy winner (1980), stroke.Country Music Hall of Fame member Charlie Daniels dies at 83 *Bishnu Charan Das, 65, Indian politician, MP (2016–2017), stroke.Odisha MLA Bishnu Charan Das No More *Katie G. Dorsett, 87, American politician, member of the North Carolina Senate (2003–2011).Katie Grays Dorsett *Ronald Graham, 84, American mathematician (Graham's number), President of the American Mathematical Society (1993–1994), chronic lung disease.Ronald Graham, 1935-2020 *Andrew Kishore, 64, Bangladeshi playback folk singer, problems caused by non-Hodgkin lymphoma.Andrew Kishore, celebrated playback singer, dies at 64 *Juris Kronbergs, 73, Latvian-Swedish poet and translator.Pēc smagas slimības miris dzejnieks Juris Kronbergs *Ennio Morricone, 91, Italian composer (The Good, the Bad and the Ugly, Once Upon a Time in the West, The Hateful Eight), orchestrator and conductor, Oscar (2016) and three-time Grammy winner, problems caused from a fall.Addio a Ennio Morricone *Zithulele Patrick Mvemve, 79, South African Roman Catholic prelate, Auxiliary Bishop of Johannesburg (1986–1994) and Bishop of Klerksdorp (1994–2013).Bishop Zithulele Patrick Mvemve *Zdzisław Myrda, 69, Polish Olympic basketball player (1980).Nie żyje Zdzisław Myrda, były reprezentant Polski w koszykówce, olimpijczyk, legenda Resovii, odznaczony Brązowym Krzyżem Zasługi *Mark Naley, 59, Australian footballer (South Adelaide, Carlton), brain cancer.Vale Mark Naley: little man, big mark *Freya Pausewang, 87, German author and sociology educator.Wir trauern um Freya Pausewang *Barbara Pec-Ślesicka, 83, Polish production manager and movie producer (Rok pierwszy, Without Anesthesia, Danton).Zmarła Barbara Pec-Ślesicka *Joe Porcaro, 90, American percussionist (Toto, The Wrecking Crew) and educator.Toto: morto Joe Porcaro *Giuseppe Rizza, 33, Italian footballer (Juve Stabia, Arezzo, Pergocrema), problems caused by a ruptured brain aneurysm.Calcio in lutto, è morto Giuseppe Rizza: l’ex Juve aveva 33 anni *Osvaldo Sosa, 72, Argentine football player (Club Almagro, Argentinos Juniors) and manager (Talleres de Córdoba), problems caused by a stroke.Murió Osvaldo “Chiche” Sosa, ex DT de Talleres *Marta Stebnicka, 95, Polish theatre actress (The Undivine Comedy).Marta Stebnicka is dead. She was 95 years old *Zoran Stojković, 73, Serbian politician, Minister of Justice (2004–2007).Преминуо Зоран Стојковић *Sergey Zagraevsky, 55, Russian-Israeli painter, architectural historian and theologian, acute heart failure.Умер художник и писатель Сергей Заграевский ===7=== *Hernán Alemán, 65, Venezuelan politician, Mayor of Cabimas (1989–1996, 2000–2008) and Deputy (since 2011), COVID-19.Murió el diputado Hernán Alemán por covid-19 *Dannes Coronel, 47, Ecuadorian footballer (El Nacional, Macará, national team), heart attack.Falleció Dannes Coronel, histórico del CS Emelec *Jahneil Douglas, 22, American football player (Toledo Rockets), shot.Toledo Rockets DL Jahneil Douglas, 22, dies after being shot outside of pizza restaurant *Elizabeth Harrower, 92, Australian novelist (Down in the City, The Watch Tower, In Certain Circles).Harrower, Elizabeth (1928–2020) *Henry Jansen, 64, South African politician, Mayor of Langeberg, COVID-19.Western Cape municipal mayor dies from Covid-19 *Henry Krtschil, 87, German composer, music producer and pianist.Musiker Henry Krtschil 87-jährig in Berlin gestorben *Mary Kay Letourneau, 58, American convicted rapist and teacher, colon cancer. *Bill Ramsey, 76, English rugby league player (Leeds, Hull, Hunslet).Bill Ramsey: Former Great Britain, Leeds and Hull forward dies, age 76 *Juan Rosai, 79, Italian-born American pathologist.Juan Rosai, MD, a Pioneer in Pathology, Dies at 79 *Chynybaĭ Tursunbekov, 59, Kyrgyz politician, member (since 2010) and President of the Kirghiz Supreme Council (2016–2017), pneumonia caused by COVID-19.Ex-speaker of Parliament of Kyrgyzstan Chynybai Tursunbekov passes away *Wolfgard Voß, 94, German Olympic gymnast (1952).Wölfi Voss, Geb. Mönning *Wang Jiafan, 81, Chinese historian.历史学家、华东师范大学终身教授王家范今晨逝世 ===8=== *Norman Allinger, 92, American chemist, member of the National Academy of Sciences (since 1992).Norman Louis Allinger *Daniel Alvarado, 70, Venezuelan actor (La revancha, Pecado de amor, My Sweet Fat Valentina), fall.Falleció el ´negrito fullero´ Daniel Alvarado tras sufrir un accidente doméstico *Marlene Catzín Cih, 66, Mexican politician, Mayor of Maxcanú (1994–1995, 2010–2012, since 2018), COVID-19.Muere alcaldesa de Yucatán por COVID-19 *Sheng-Chang Chiang, 56, Taiwanese information technology businessman, CEO and President of MSI, suicide by jumping. *Amadou Gon Coulibaly, 61, Ivorian politician, Prime Minister (since 2017), 2020 presidential candidate, problems caused from heart surgery.Ivory Coast's prime minister Amadou Gon Coulibaly dies at 61 *Lambert Croux, 93, Belgian politician, Senator (1977–1981) and MEP (1979–1989).Lambert 'Bertie' Croux *Ramón Escobar Santiago, 83, Spanish politician, Mayor of Segovia (1991–1999).Fallece a los 83 años Ramón Escobar, el alcalde de Segovia que cerró el tráfico por el Acueducto *Jagdeep, 81, Indian actor (Sholay, Andaz Apna Apna), movie director (Soorma Bhopali) and comedian.'Sholay' Actor & Jaaved Jaaferi's Father Jagdeep Passes Away At 81 *Finn Christian Jagge, 54, Norwegian alpine skier, Olympic champion (1992), volvulus.Finn Christian Jagge er død *Wayne Mixson, 98, American politician, member of the Florida House of Representatives (1967–1978), Lieutenant Governor (1979–1987) and Governor (1987).Former Florida governor Wayne Mixson dies *Eldon A. Money, 89, American politician, member of the Utah House of Representatives (1974–1979) and Senate (1980–1997), problems caused by Alzheimer's disease.Eldon A. Money *Ricardo Mthembu, 50, South African politician, Mayor of KwaDukuza (2011–2019), COVID-19.Former KwaDukuza mayor Ricardo Mthembu dies in ICU *Santiago Nchama, 70, Equatoguinean politician, Minister of Foreign Affairs (1999–2003).Fallece Santiago Nsobeya Efuman Nchama, Vicepresidente Primero del Congreso de Diputados de Guinea Ecuatorial *Munah E. Pelham-Youngblood, 36, Liberian politician, member of the House of Representatives (since 2011). *José Antonio Pérez Sánchez, 72, Mexican Roman Catholic prelate, Bishop of the Territorial Prelature of Jesús María del Nayar (1992–2010).Bishop José Antonio Pérez Sánchez, O.F.M. *Ross Pritchard, 95, American academic administrator, Chancellor of the University of Denver (1978–1984).ASU’s fifth president, Dr. Ross Pritchard, has passed away *Alex Pullin, 32, Australian Olympic snowboarder (2010, 2014, 2018), Snowboard Cross World champion (2011, 2013), drowned.Olympic snowboarder Alex 'Chumpy' Pullin dies off Gold Coast beach *Naya Rivera, 33, American actress (Glee, The Royal Family, At the Devil's Door), model and singer, drowned.Jane Lynch, Chris Colfer and More Hollywood Stars Pay Tribute to Naya Rivera *Abdelmajid Tlemçani, 82, Tunisian footballer (Espérance Sportive de Tunis, national team).Décès de Abdelmajid Tlemçani *Brad Watson, 64, American author and academic, heart failure.Brad Watson, whose writing turned an unflinching gaze toward life, dies at 64 *William Wolff, 93, German-British journalist (Daily Mirror) and rabbi (West London Synagogue).‘Ray of hope’ rabbi who made the world laugh dies aged 93; State rabbi William Wolff dies aged 93 (in German) *Flossie Wong-Staal, 73, Chinese- American virologist, problems caused by pneumonia.Flossie Wong-Staal, pioneering UCSD virologist who helped identify AIDS cause, dies ===9=== *Agustín Alezzo, 84, Argentine theater director, problems caused by COVID-19.Falleció el maestro de actores Agustín Alezzo después de pasar un mes internado con coronavirus *Johnny Beattie, 93, Scottish actor (River City) and comedian (Scotch & Wry, Rab C. Nesbitt).Johnny Beattie dead as Scottish comedy and acting legend passes away aged 93 *Robert Curtis Clark, 83, Canadian politician, Alberta MLA (1960–1981).Bob Clark remembered for longtime community service *Roland Desné, 89, French philosopher and writer.Hommage à Roland Desné *Jean-François Garreaud, 74, French actor (Violette Nozière, A Simple Story, I as in Icarus).Mort de Jean-François Garreaud, acteur de \"Plus Belle La Vie\" et \"La Crim\" *Ranjon Ghoshal, 65, Indian theatre director and musician (Moheener Ghoraguli).Theatre director Ranjon Ghosal passes away *Karrar Ibrahim Hashim, 25, Iraqi footballer (Al-Minaa, Naft Al-Junoob, national team).وفاة حارس مرمى عراقي في ظروف غامضة *Sahara Khatun, 77, Bangladeshi politician, member of the Jatiya Sangsad (since 2009) and Minister of Home Affairs (2009–2012) and Posts and Telecommunications (2012–2013).Former minister Sahara Khatun dies in Thailand *Irma Lanzas, 86, Salvadoran writer and educator.Fallece Irma Lanzas, tesorera de la Academia Salvadoreña de la Lengua *Sylvia Martínez Elizondo, 72, Mexican politician, Senator from Chihuahua (2016–2018).Murió Silvia Martínez, esposa de Memo Luján *Bruce Nestande, 82, American politician, member of the California State Assembly (1973–1980), heart attack.Bruce Nestande, three-term California Assemblyman, dies at age 82 *Park Won-soon, 64, South Korean politician, philanthropist and lawyer, Mayor of Seoul (since 2011), suicide.박원순 서울시장 북악산 숙정문 인근서 숨진 채 발견 *Hafiz Rahim, 36, Singaporean footballer (Geylang United, Gombak United, national team), car crash.Former national footballer Hafiz Rahim, 36, dies after traffic accident *Vladimir Salkov, 83, Russian footballer (Shakhtar Donetsk) and manager (Torpedo Moscow, Rotor Volgograd).Умер Владимир Сальков *Lino Sentimenti, 91, Italian footballer (Modena F.C.).E’ scomparso Lino Sentimenti *Tong Binggang, 92, Chinese physicist, member of the Chinese Academy of Sciences (since 1997).流体力学家童秉纲院士逝世 *Joseph Vidal, 87, French politician, member of the National Assembly (1978–1993).Aude : l'ancien député Joseph Vidal est décédé ===10=== *Ben Acton, 92, Australian Olympic ice hockey player (1960).Acton, Ben Maxwell *Morris Cerullo, 88, American Pentecostal televangelist, businessman (Heritage USA) and writer, pneumonia.World-Renowned Evangelist Morris Cerullo Passes Away at 88 *Ananda Mohan Chakrabarty, 82, Indian-American microbiologist (Diamond v. Chakrabarty) and researcher.প্রবাসেই প্রয়াত জীববিজ্ঞানী আনন্দমোহন চক্রবর্তী *Jack Charlton, 85, English football player (Leeds United, national team) and manager (Republic of Ireland national team), world champion (1966), problems caused by dementia and lymphoma.Jack Charlton: England and Leeds United legend dies aged 85 *Vicente Cristófano, 68, Argentine football manager and coach (Club Atlético Brown), COVID-19.Dolor en el mundo del fútbol: murió de coronavirus un histórico técnico del Ascenso *Corra Dirksen, 82, South African rugby player (Northern Transvaal, national team), COVID-19.Former Springbok wing dies of Covid-19 complications *Vikas Dubey, 56, Indian gangster and convicted murderer, shot.Vikas Dubey: India gangster shot dead after arrest *Eddie Gale, 78, American jazz trumpeter, prostate cancer. *Miloš Jakeš, 97, Czech politician, First Secretary of the Communist Party of Czechoslovakia (1987–1989).Zemřel Miloš Jakeš *Ghaida Kambash, 46, Iraqi politician, MP (since 2010), COVID-19.وفاة النائبة غيداء كمبش بسبب فايروس كورونا *Ferenc Koncz, 60, Hungarian politician, MP (1998–2002, 2004–2006, 2010–2014, since 2018) and Mayor of Szerencs (2010–2018), car crash. *Antonio Krastev, 59, Bulgarian weightlifter, world champion (1985, 1986), car crash.Почина великият български щангист Антонио Кръстев *Josep Ramon Mòdol i Pifarré, 62, Spanish sociologist, politician and writer, Deputy (1989–1993) and Senator (1996–2000), cancer.Mor l'escriptor i professor lleidatà Pep Mòdol *Paik Sun-yup, 99, South Korean Army general and politician.Korean War hero Paik Sun-yup dies at 99 *Mahmoud Reda, 90, Egyptian dancer, choreographer and Olympic gymnast (1952).وفاة الفنان محمود رضا أشهر مصمم رقصات مصرى عن عمر يناهز 90 عاما *Mike Ryan, 78, American baseball player (Boston Red Sox, Philadelphia Phillies, Pittsburgh Pirates) and coach.Longtime Phillies coach ‘Irish’ Mike Ryan dies, 78 *Alfredo Sirkis, 69, Brazilian politician, environmentalist and writer, Deputy (2011–2014), 1998 presidential candidate, car crash.Morre o ex-deputado Alfredo Sirkis *Gordon Stone, 70, American bluegrass and fusion musician (Phish).Vermont Musician Gordon Stone Has Died *Olga Tass, 91, Hungarian gymnast, Olympic champion (1956).Gyász: elhunyt az olimpiai bajnok Tass Olga *Michael M. Richter, 82, German mathematician and computer scientist.Nachruf Prof. Dr. Michael M. Richter *Lara van Ruijven, 27, Dutch short track speed skater, Olympic bronze medallist (2018) and world champion (2019), autoimmune disease.Shorttrackster Lara van Ruijven (27) overleden *Genevieve Westcott, 65, Canadian-born New Zealand journalist and television presenter (TVNZ, Newshub), breast cancer.Journalism trailblazer and television presenter Genevieve Westcott dies *Ed Wild, 85, Canadian Olympic basketball player (1956).Ed Wild *Dick Williams, 92, American television personality (Magicland), meteorologist (WMC-TV) and magician.‘Mr. Magic’ of WMC-TV’s ‘Magicland’ dies at age 92 ===11=== *Jyotsna Bhatt, 80, Indian ceramicist and potter, stroke.Renowned ceramic artist Jyotsna Bhatt passes away *Frank Bolling, 88, American baseball player (Detroit Tigers, Milwaukee/Atlanta Braves). *Robert Gnaizda, 83, American civil rights lawyer, co-founder of the Greenlining Institute, heart attack.Robert Gnaizda *Edward Kmiec, 84, American Roman Catholic prelate, Bishop of Nashville (1992–2004) and Buffalo (2004–2012).Former Buffalo Bishop Edward Kmiec dies *Kyaw Hein, 72, Burmese actor (Kanyar Pyo Nae Zayar Ao, Sone Yay, Wai Lae Mhway Kyway Lae Mhway) and Theravada Buddhist monk, problems caused by a stroke.ဦးပဉ္ဇင်း ဦးကိတ္တိသာရ (မင်းသားကြီး (ဦး) ကျော်ဟိန်း) ရဲ့ သမီး မခင်ခင်ခ နဲ့ ဘီဘီစီ ဆက်သွယ်မေးမြန်းချက် *Nicholas Lash, 86, English theologian. *Lim Boo Liat, 94, Malaysian zoologist.Malaysian zoology pioneer Dr Lim Boo Liat dies at 94 *Florence Littauer, 92, American self-help author.Florence Littauer April 27, 1928-July 11, 2020 *Mary Miller, 90, English theatre actress, founding member of the Royal National Theatre.Mary Miller obituary *Rich Priske, 52, Canadian bassist, heart attack. *Gabriella Tucci, 90, Italian operatic soprano.Si è spento a 90 anni il soprano Gabriella Tucci *Donald Whiston, 93, American ice hockey player (Brown Bears), Olympic silver medallist (1952). ===12=== *Jack Ah Kit, 69, Australian politician, Northern Territory MLA (1995–2005).The life and times of Aboriginal rights champion and political trailblazer John Ah Kit, dead at 69 *Rod Bernard, 79, American pop singer (\"Diggy Liggy Lo\", \"This Should Go On Forever\").Swamp pop legend Rod Bernard dies *Steve Bouchie, 59, American basketball player (Indiana Hoosiers, Auxilium Pallacanestro Torino), Indiana Mr. Basketball (1979), problems caused by a heart attack. *Raymundo Capetillo, 76, Mexican actor (Rosa salvaje, Corazón salvaje), COVID-19.Muere el actor Raymundo Capetillo; estaba hospitalizado por coronavirus *Joanna Cole, 75, American children's writer (The Magic School Bus), idiopathic pulmonary fibrosis.Joanna Cole, Author of 'The Magic School Bus' Book Series, Dies at 75 *Judy Dyble, 71, English singer-songwriter (Fairport Convention, Trader Horne), lung cancer.Original Fairport Convention singer Judy Dyble dead at 71 *Hassan Abshir Farah, 75, Somali politician, Prime Minister (2001–2003) and MP (since 2012).Somalia: Former Prime Minister Hassan Farah Passes in Turkey *Bill Gilbreth, 72, American baseball player (Detroit Tigers, California Angels), problems caused by heart surgery.ACU baseball legend Bill Gilbreth, 72, dies *Ignat Kaneff, 93, Bulgarian-Canadian businessman and philanthropist.Почина милионерът-филантроп Игнат Канев *Benjamin Keough, 27, American musician, son of Lisa Marie Presley and grandson of Elvis Presley, suicide by firearm.Lisa Marie Presley's Son Benjamin Keough Dead at 27 *Nelson Meurer, 77, Brazilian politician, Mayor of Francisco Beltrão (1989–1993) and Federal Deputy (1995–2019), COVID-19.Ex-deputado Nelson Meurer morre aos 77 anos vítima de COVID-19 *Manuel Moroun, 93, American transportation businessman, heart failure. *Frank Popper, 102, Czech-born Swiss art and technology historian.FRank Popper (1918-2020) *Kelly Preston, 57, American actress (Jerry Maguire, Twins, Sky High) and model, breast cancer.Kelly Preston Dies of Breast Cancer at 57: 'She Was a Bright, Beautiful and Loving Soul' *Henrik Ripa, 52, Swedish politician, Chairman of Lerum (1998–2010) and MP (2010–2014).Sahlgrenskas styrelseorförande Henrik Ripa har avlidit *Nagindas Sanghavi, 100, Indian political columnist.Critic, columnist Sanghvi dies at 100 *Eleanor Sokoloff, 106, American pianist.Eleanor Sokoloff, 106, who taught at Curtis Institute for more than eight decades, dies *Wim Suurbier, 75, Dutch football player (Ajax, national team) and manager (Tampa Bay Rowdies), cerebral hemorrhage.Ajax and Netherlands legend Wim Suurbier dies aged 75 *Lajos Szűcs, 76, Hungarian footballer (Ferencvárosi, Budapest Honvéd, national team), Olympic champion (1968).Meghalt Szűcs Lajos ===13=== *Hasan al-Lawzi, 68, Yemeni writer and politician, Acting Prime Minister (2011), COVID-19.بعد رحلة علاج فى مصر.. وفاة وزير يمنى أسبق متأثرا بإصابته بكورونا *Luis Arias Graziani, 94, Peruvian Air Force general and politician, Chief of the Joint Command (1979) and Minister of Commerce (1974–1977) and Defence (1978–1980), COVID-19.Falleció Luis Arias, exministro y comisionado de la CVR *Nurul Islam Babul, 74, Bangladeshi businessman, chairman of Jamuna Group, COVID-19.Jamuna Group chairman Babul dies of COVID-19 *Eugene Chelyshev, 98, Russian indologist, member of the Russian Academy of Sciences (since 1987).Челышев Евгений Петрович *Chuck Hulse, 93, American Hall of Fame racing driver.Chuck Hulse 1927–2020 *Moses Costa, 69, Bangladeshi Roman Catholic prelate, Archbishop of Chittagong (since 2017), problems caused by a stroke.Chittagong Archbishop Moses M Costa no more *Bernard Cottret, 69, French historian and literary scholar.Décès de Bernard Cottret, historien français *Hadi Dahane, 76, Moroccan footballer (Union Sidi Kacem, national team).لاعب المنتخب الوطني الأسبق حميد دحان في ذمة الله *Grant Imahara, 49, American electrical engineer (Star Wars, The Matrix), television host (MythBusters) and actor (Star Trek Continues), intracranial aneurysm.Grant Imahara, Host of 'MythBusters' and 'White Rabbit Project,' Dies at 49 *Camilo Lorenzo Iglesias, 79, Spanish Roman Catholic prelate, Bishop of Astorga (1995–2015), lung infection.Fallece el obispo emérito de Astorga, Camilo Lorenzo Iglesias *Zindzi Mandela, 59, South African politician and activist, Ambassador to Denmark (since 2015), daughter of Nelson Mandela, COVID-19.Zindzi Mandela has passed away aged 59 *Pat Quinn, 84, Scottish football player (Motherwell, national team) and manager (East Fife).Former Motherwell star Pat Quinn has passed away *Debendra Nath Roy, 64–65, Indian politician, West Bengal MLA (since 2016), hanging.Debendra Nath Roy: Senior BJP leader Debendra Nath Ray found hanging in North Dinajpur *Roger Simons, 93, Belgian journalist (Leydse Courant).VRT-correspondent Roger Simons (93) overleden (death announced on this date) *Zeng Yi, 91, Chinese virologist and researcher, member of the Chinese Academy of Sciences (since 1993).曾毅院士逝世 ===14=== *Adalet Ağaoğlu, 90, Turkish novelist and playwright, multiple organ failure.Son dakika... Yazar Adalet Ağaoğlu hayatını kaybetti *Bea Gorton, 73, American college basketball coach (Indiana Hoosiers).Remembering former IU women’s basketball coach Bea Gorton *Polad Hashimov, 45, Azerbaijani Armed general, shot.Azerbaijan general among troops killed in Armenia border clash *Brian Hutton, Baron Hutton, 88, British politician and lawyer, Lord Chief Justice of Northern Ireland (1989–1997) and Lord of Appeal in Ordinary (1997–2004).Hutton *Muhammad Mohaiminul Islam, 78, Bangladeshi military officer, Chief of Naval Staff (1991–1995), COVID-19.Former Navy chief dies of COVID-19 *Ronald Johnson, 76, American politician, member of the Alabama House of Representatives (since 1978), liver cancer.Al. Rep Ronald Johnson, longest serving member of the house, dies at age 76 *Jindřich Kabát, 67, Czech psychologist and politician, Minister of Culture (1992–1994).First Czech Culture Minister Jindřich Kabát dies aged 67 *Caesar Korolenko, 86, Polish- born Russian psychiatrist, member of the New York Academy of Sciences, COVID-19.От коронавирусной инфекции умер Цезарь Короленко *Daniel Lewis Lee, 47, American white supremacist and convicted triple murderer, execution by lethal injection.US carries out first federal execution in 17 years after Supreme Court clears the way *J. J. Lionel, 72, Belgian musician (\"La danse des canards\").Triste nouvelle: J.J. Lionel, l’interprète de la «Danse des canards», est décédé *Ron de Lugo, 89, American politician, Delegate U.S. Representative from the U.S. Virgin Islands' at-large congressional district (1973–1979, 1981–1995).Ron de Lugo, the Longest Serving V.I. Delegate to Congress, Died Today. He Was 89. *Maria Lugones, 76, Argentine feminist philosopher.María Lugones (1944-2020) *Noël Martin, 60, Jamaican-born British assisted suicide activist and neo-Nazi victim.Neonazi-Opfer Noël Martin gestorben *Alex McCool, 96, American NASA manager.Alexander \"Mac\" A. McCool Jr. *Abolghasem Sarhaddizadeh, 75, Iranian politician, Minister of Labour and Social Affairs (1983–1989) and MP (1990–1992, 1996–2004).ابوالقاسم سرحدی‌زاده، نماینده مجلس و وزیر کار سابق، درگذشت *Milan Šašik, 67, Slovak-born Ukrainian Ruthenian Catholic hierarch, Bishop of Mukachevo (since 2002).Щойно відійшов до Господа наш батько…. *Shajahan Siraj, 77, Bangladeshi politician, MP (1986–1991) and co-founder of Jatiya Samajtantrik Dal, stomach cancer.BNP leader Shahjahan Siraj dies ===15=== *Carlotta Barilli, 84, Italian actress (Ragazzi del Juke-Box, Howlers in the Dock, La commare secca).Addio a Carlotta Barilli, attrice di cinema, radio e tv *Severino Cavalcanti, 89, Brazilian politician, Deputy (1995–2005) and Mayor of João Alfredo (1964–1966, 2009–2013), problems caused by diabetes.Severino Cavalcanti, ex-presidente da Câmara dos Deputados, morre no Recife aos 89 anos *Igor Chernykh, 88, Russian cinematographer (The Diamond Arm, Particularly Important Task, Private Detective, or Operation Cooperation), COVID-19.«Добрый и отзывчивый человек»: умер оператор «Бриллиантовой руки» Игорь Черных *Paul Fusco, 89, American photojournalist, problems caused by dementia.Paul Fusco: 1930 – 2020 *Louw de Graaf, 90, Dutch politician, member of the Social and Economic Council (1970–1977), MP (1981–1982, 1986) and Minister of Social Affairs (1982, 1987).Oud-bewindsman Louw de Graaf van het CDA overleden *Galyn Görg, 56, American actress (RoboCop 2, M.A.N.T.I.S, Point Break) and dancer, cancer.Galyn Gorg è morta: la ballerina di “Fantastico” avrebbe compiuto proprio oggi 56 anni. La Cuccarini: «Non ci posso credere» *David Kaiser, 50, American businessman and philanthropist, member of the Rockefeller family, glioblastoma.David Kaiser, Rockefeller Heir Who Fought Exxon Mobil, Dies at 50 *Arnol Kox, 67, Dutch street preacher, problems caused by leukaemia.‘Laat het paradijs maar komen', stadsprediker Arnol Kox (67) overleden *Oscar Hugh Lipscomb, 88, American Roman Catholic prelate, Archbishop of Mobile (1980–2008), COVID-19.Catholic Archbishop of Mobile passes away after fight with COVID-19 *Victoria Rodríguez, 88, Spanish theatre actress, pneumonia.Muere la actriz Victoria Rodríguez, viuda de Buero Vallejo Madrid *Maurice Roëves, 83, Scottish actor (Oh! What a Lovely War, Escape to Victory, Judge Dredd).Maurice Roëves dead: Doctor Who actor passes away aged 83 *Eugenio Scarpellini, 66, Italian-born Bolivian Roman Catholic prelate, Auxiliary Bishop (2010–2013) and Bishop of El Alto (since 2013), COVID-19.Covid-19: Bolivia, muore il vescovo di El Alto Eugenio Scarpellini *George Simon, 73, Guyanese artist and archeologist, cancer. *Sir Toke Talagi, 69, Niuean politician, MP (1999–2020) and Premier (2008–2020).Sir Toke Talagi, longtime premier of Niue, dies ===16=== *Ken Chinn, 57, Canadian punk rock singer (SNFU).Edmonton-born SNFU frontman Ken Chinn (aka Mr. Chi Pig) dead at age 57 *Roger Côté, 80, Canadian ice hockey player (Edmonton Oilers, Indianapolis Racers).Regent Cote (Roger) *Christopher Dickey, 68, American journalist, news editor (The Daily Beast) and author, heart failure.Legendary Foreign Correspondent Chris Dickey Dies in Paris *Tony Elliott, 73, English publisher, founder of Time Out Group, lung cancer.Time Out founder Tony Elliott dies *Mason Gaffney, 96, American economist. *Barry Jarman, 84, Australian cricketer (South Australia).Former Australian Test cricketer Barry Jarman dies aged 84 *Azuma Morisaki, 92, Japanese movie director and screenwriter (Tora-san, His Tender Love, Oishinbo, Pecoross' Mother and Her Days), cerebral infarction.Eiga kantoku Morisaki Azuma-san shikyo *Rick Reed, 70, American baseball umpire.Umpire Rick Reed, who worked 1991 World Series, dies at 70 *Phyllis Somerville, 76, American actress (The Big C, Little Children, The Curious Case of Benjamin Button).Phyllis Somerville Dies: Actress In ‘The Big C’, Broadway’s ‘To Kill A Mockingbird’ Was 76 *Tony Taylor, 84, Cuban baseball player (Chicago Cubs, Philadelphia Phillies, Detroit Tigers), problems caused by a stroke.Phillies fan-favorite, defensive whiz Tony Taylor, 84, dies *Alexei Tezikov, 42, Russian ice hockey player (Washington Capitals, Vancouver Canucks, Lada Togliatti), heart attack.Серебряный призер МЧМ и экс-игрок «Вашингтона» Тезиков скончался в возрасте 42 лет. Ему стало плохо на улице *Jamie Oldaker, 68, American drummer (Eric Clapton, The Tractors).Legendary drummer, Tulsa native Jamie Oldaker dies at 68 *Jonathan Oppenheim, 67, American movie editor (Paris Is Burning, The Oath) and producer (Out of the Shadow), brain cancer.Jonathan Oppenheim, 'Paris Is Burning' Editor, Dies at 67 *Víctor Víctor, 71, Dominican singer-songwriter and guitarist, COVID-19.Muere por coronavirus el popular cantautor dominicano Víctor Víctor *David Bobihoe Akib, 64, Indonesian royal, Regent of Gorontalo (2005–2015).Mantan Bupati Gorontalo David Bobihoe Akib Meninggal Dunia ===17=== *Ekaterina Alexandrovskaya, 20, Russian-Australian Olympic pair skater (2018), World Junior champion (2017), suicide by jumping.Former World Junior Skating Champion Alexandrovskaya Dies *Emajuddin Ahamed, 86, Bangladeshi political scientist and educator, Vice–Chancellor of the University of Dhaka (1992–1996) and University of Development Alternative (2002–2016), cerebral hemorrhage.Professor Emajuddin Ahmed dies *José Paulo de Andrade, 78, Brazilian journalist, radio personality (Rádio Bandeirantes São Paulo) and television presenter, problems caused by COPD and COVID-19.Jornalista José Paulo de Andrade morre aos 78 anos em SP após ser diagnosticado com COVID-19 *Gian Franco Anedda, 89, Italian politician, Deputy (1992–2006), Minister of Justice (1994–1995), and member of the High Council of the Judiciary (2005–2010).Politica in lutto: è morto l'ex sottosegretario Gianfranco Anedda *Moussa Benhamadi, 67, Algerian politician and executive (Algérie Télécom), MP (2002–2007), COVID-19.Algérie : l'ancien ministre Moussa Benhamadi meurt en détention du Covid-19 *Brigid Berlin, 80, American artist (The Factory), model (Andy Warhol) and actress (Chelsea Girls, Ciao! Manhattan), cardiac arrest caused by pulmonary embolism.Brigid Berlin, Artist Who Assiduously Documented Warhol’s Factory, Is Dead at 80 *Pierre- Marie Coty, 92, Ivorian Roman Catholic prelate, Bishop of Daloa (1975–2005).Bishop Pierre-Marie Coty *Alex Dawson, 80, Scottish footballer (Manchester United, Preston North End, Brighton & Hove Albion).Alex Dawson dead: Busby Babe hero and former Man Utd striker dies aged 80 *Seyfi Dursunoğlu, 87, Turkish comedian, singer and television presenter (Dans Eder misin?, Popstar Türkiye), pneumonia caused by COPD.Seyfi Dursunoğlu hayata veda etti *Zenon Grocholewski, 80, Polish Roman Catholic cardinal, Prefect of the Congregation for Catholic Education (1999–2015).Kardinal Zenon Grocholewski ist tot. Ein enger Mitarbeiter von Johannes Paul II. Starb *Zizi Jeanmaire, 96, French ballet dancer.È morta Zizi Jeanmaire, danzatrice e showgirl, moglie di Roland Petit *John Lewis, 80, American civil rights activist and politician, member of the U.S. House of Representatives from Georgia's 5th congressional district (since 1987), pancreatic cancer.Georgia congressman and civil rights icon John Lewis has died at age 80 *Shirley Love, 87, American broadcaster (WOAY-TV) and politician, member of the West Virginia Senate (1994–2008) and House of Delegates (2017–2019).Legendary WOAY broadcaster and State Senator Shirley Love passes away *Volodymyr Lozynskyi, 65, Soviet-born Ukrainian football player (Dynamo Kyiv, Soviet Union national team) and manager (Vorskla Poltava).Відійшов у вічність легендарний захисник Динамо 1970-1980-х *Silvio Marzolini, 79, Argentine footballer (Ferro Carril Oeste, Boca Juniors, national team), problems caused by cancer, heart disease and a stroke.Murió Silvio Marzolini, una leyenda del fútbol argentino *John Neale, 93, English Anglican clergyman, Bishop of Ramsbury (1974–1988). *Yoshihiko Matsuo, 86, Japanese car designer (Nissan 240Z, Nissan 350Z, Nissan Z-car).Ontwerper Nissan 240Z overleden (death announced on this date) *J. I. Packer, 93, British-born Canadian evangelical theologian (Knowing God).J. I. Packer (1926–2020) *Bill Scott, 74, British Anglican priest, Deputy Clerk of the Closet (2007–2015).The Rev Prebendary Bill Scott *C. S. Seshadri, 88, Indian mathematician (Seshadri constant), founder of the Chennai Mathematical Institute.C.S. Seshadri, a leader in algebraic geometry *Michael Silverstein, 74, American linguist and anthropologist, brain cancer.Michael Silverstein, groundbreaking anthropologist and linguist, 1945-2020 *Andrzej Strzelecki, 68, Polish actor (Klan, Battle of Warsaw 1920, Barwy szczęścia), satirist and screenwriter, Rector of Aleksander Zelwerowicz National Academy of Dramatic Art in Warsaw (2008–2016), lung cancer. *Ron Tauranac, 95, British-Australian engineer and racing car designer, co-founder of Brabham.Ron Tauranac passes away aged 95 *C. T. Vivian, 95, American author and civil rights activist. *Marian Więckowski, 86, Polish racing cyclist, Tour de Pologne winner (1954, 1955, 1956).Nie żyje Marian Więckowski ===18=== *Vishnu Raj Atreya, 75, Nepali writer and poet, gallbladder cancer.Litterateur ‘Lato Sathi’ passes away at 74 *René Carmans, 75, Belgian footballer (K.F.C. Diest), heart disease.René ‘Black Panther’ Carmans (75) overleden: “Hij was bijna doelman bij de nationale ploeg maar ene Jean Marie Pfaff stak er een stokje voor” (death announced on this date) *Elize Cawood, 68, South African actress (Dis ek, Anna, Red Dust), lung cancer.Renowned SA actress Elize Cawood dies *Derek Ho, 55, American surfer, World Surf League champion (1993), heart attack.RIP Derek Ho *Sanjiv Sam Gambhir, 57, Indian-born American physician, cancer.Molecular Imaging Pioneer Sam Gambhir Passes Away *Ray Hannigan, 93, Canadian-born American ice hockey player (Toronto Maple Leafs) and Roman Catholic priest.Father Raymond James Hannigan *Katherine B. Hoffman, 105, American chemist and academic administrator, COVID-19.Katherine Hoffman, ‘Eternal’ Florida State Figure, Dies at 105 *Dustin Lee Honken, 52, American convicted murderer and drug dealer, execution by lethal injection.Higher courts rebuff late legal efforts, Iowan Dustin Honken put to death *Ashraf Hossain, 79, Bangladeshi politician, MP (1991–1996, 2006–2008), cancer.Former whip Md Ashraf Hossain dies *Myrzageldy Kemel, 71, Kazakh academic, spiritual writer and politician, Deputy (1995–2004).Умер казахстанский писатель и государственный деятель Мырзагельды Кемел *Boško Marinko, 81, Serbian Olympic wrestler (1968, 1972).Boško Marinko *Juan Marsé, 87, Spanish novelist, journalist and screenwriter, Miguel de Cervantes Prize winner (2008), heart failure.Muere el escritor Juan Marsé *Ali Mirzaei, 91, Iranian weightlifter, Olympic bronze medalist (1952) and World Weightlifting champion (1951, 1954).Ex-Iran weightlifter Mirzaei passes away *Martha Mmola, South African politician, MP (2014–2019), COVID-19.ANC MP Martha Mmola dies due to Covid-19 related illness *Haruma Miura, 30, Japanese actor (Spellbound, Crows Zero 2, Attack on Titan) and singer, suicide by hanging. *Cécile Reims, 92, French engraver and writer.La Châtre : Cécile Reims, ancienne résistante et graveuse de renom, est morte à 92 ans *Jope Ruonansuu, 56, Finnish actor (Matti: Hell Is for Heroes), comedian (Jopet Show) and musician, esophageal cancer.Taiteilija Jope Ruonansuu on kuollut *Jaybee Sebastian, 40, Filipino convicted kidnapper and carjacker, COVID-19.Bilibid inmate Jaybee Sebastian, key prison drug trade witness, dies of COVID-19 *Henrique Soares da Costa, 57, Brazilian Roman Catholic prelate, Bishop of Palmares (since 2014), COVID-19.alece o bispo da diocese de Palmares (PE), dom Henrique Soares da Costa *Manuel C. Sobreviñas, 96, Filipino Roman Catholic prelate, Bishop of Imus (1993–2001).Oldest Filipino bishop dies at age 96 *Keith Sonnier, 78, American sculptor and artist, colon cancer.Sculptor Keith Sonnier, America’s Experimental Poet of Light and Neon, Has Died at Age 78 *Baba Ibrahim Suma- Keita, 73, Sierra Leonean Olympic long-distance runner (1980, 1988).Baba Ibrahim Suma-Keita *Lucio Urtubia, 89, Spanish counterfeiter, robber and kidnapper (Anarchist Federation).Fallece el navarro Lucio Urtubia, histórico militante anarquista *Alefoso Yalayalatabua, 43, Fijian rugby union player (Highlanders, Warriors, national team).Former Flying Fijian dies at 43 ===19=== *Sultan Hashim Ahmad al-Tai, 77–78, Iraqi military officer and convicted war criminal, Minister of Defence (1995–2003), heart attack.تلفزيون الناصرية: وفاة وزير الدفاع الاسبق سلطان هاشم في سجن الحوت *Biri Biri, 72, Gambian footballer (Wallidan Banjul, Sevilla, national team). *Bruce G. Blair, 72, American nuclear security expert and scholar, stroke.Bruce G. Blair, acclaimed expert on the risks of nuclear war, dies at 72 *David Cliche, 68, Canadian politician and environmental businessman, Quebec MNA (1994–2002), brain cancer.Décès de l’ancien ministre David Cliche *Giulia Maria Crespi, 97, Italian businesswoman and environmentalist, founder of Fondo Ambiente Italiano.È morta Giulia Maria Crespi: una vita per l'ambiente *Sonia Darrin, 96, American actress (The Big Sleep).Sonia Darrin, Femme Fatale in Bogart's 'The Big Sleep,' Dies at 96 *Seydou Diarra, 86, Ivorian politician, Prime Minister (2000, 2003–2005).L’ancien premier ministre ivoirien, Seydou Diarra, est mort *Louis Dicaire, 73, Canadian Roman Catholic prelate, Auxiliary Bishop of Montreal (1999–2004) and Saint-Jean-Longueuil (since 2004).Bishop Louis Dicaire *Sapardi Djoko Damono, 80, Indonesian poet, multiple organ failure.Penyair Sapardi Djoko Damono Meninggal Dunia *Mikołaj Kubica, 74, Polish Olympic gymnast (1964, 1968, 1972).Zmarł Mikołaj Kubica *Jack McIlhargey, 68, Canadian ice hockey player (Vancouver Canucks, Philadelphia Flyers, Hartford Whalers), cancer.Former Canucks defenceman Jack McIlhargey passes away at age 68 *Lodovico Meneghetti, 94, Italian architect, urban planner and professor.Addio all’architetto Meneghetti, docente al Politecnico di Milano e direttore dell'istituto di Urbanistica *Giuseppe Ottaviani, 104, Italian masters athlete.Morto a 104 anni Ottaviani recordman di atletica master e campione di ottimismo: Marche in lutto *Emitt Rhodes, 70, American singer-songwriter (\"Live\") and musician (The Palace Guard, The Merry-Go- Round).Emitt Rhodes Dead at 70 *Viktor Ryashko, 56, Ukrainian football player (Nyva Ternopil) and manager (Hoverla Uzhhorod), car crash.У ДТП під Мукачевом загинув футбольний тренер Віктор Ряшко *César Salinas, 58, Bolivian football chairman (Bolivian Football Federation, The Strongest), COVID-19.Voorzitter voetbalbond Bolivia overleden aan coronavirus *István Séllyei, 70, Hungarian Olympic wrestler (1976).Olimpiai érmeseink - Séllyei István *Nikolai Tanayev, 74, Kyrgyz politician, Prime Minister (2002–2005).Экс-премьер-министр Николай Танаев дүйнөдөн кайтты *Franciszek Ziejka, 79, Polish literary historian, member of the Polish Academy of Learning (since 1997) and Rector of Jagiellonian University (1999–2005). ===20=== *Muhammad Aslam, 73, Pakistani politician and lawyer, Associate Justice of the Lahore High Court (2003–2008), Chief Justice of Islamabad High Court (2008–2009) and Justice of the Supreme Court (2009–2012). *Hal Bernson, 89, American politician and businessman, member of the Los Angeles City Council (1979–2003).Former L.A. City Councilman Hal Bernson dies at 89 *Michael Brooks, 36, American political commentator (The Majority Report With Sam Seder, The Young Turks), thrombosis.Progressives mourn the loss of political commentator Michael Brooks *Victor Chizhikov, 84, Russian children's book illustrator, designer of Misha. *Ross Dallow, 82, New Zealand police officer and politician, member of the Auckland Council (2010–2016).Ross Philip (Ross) Dallow MNZM QPM NZSSM (Erebus) *Roy Den Hollander, 72, American lawyer and murderer, perpetrator of the Salas home shooting, suicide by gunshot.Esther Salas case: 'Feminazi' rants of lawyer who shot judge's family *Lone Dybkjær, 80, Danish politician and environmentalist, Minister for the Environment (1988–1990), MEP (1994–2004) and MP (1971–1977, 1979–1994, 2005–2011), cancer.Lone Dybkjær er død *Bijay Mohanty, 70, Indian actor (Naga Phasa, Suna Panjuri, Sahara Jaluchi), problems caused by cardiac arrest.Actor Bijay Mohanty no more *Doug Rogers, 79, Canadian judoka, Olympic silver medalist (1964) and Pan American Games champion (1967).Canadian Wall of Famer Doug Rogers Passes Away *Arthur Rotstein, 74, American journalist and political commentator (Associated Press), COVID-19. *Ram Awadhesh Singh, 83, Indian politician, MP (1977–1979, 1986–1992).Veteran socialist leader and Lok Sabha member Ram Awadesh Singh passes away at a private hospital in Patna *Angela Spook, 66, German witch and street performer.Trauer um die „Hexe von der Kö“ *Günter-Helge Strickstrack, 99, German politician and activist, founding member of the Christian Democratic Union of Germany.CDU- Gründungsmitglied gestorben: Günter-Helge Strickstrack ist tot *Shane Tuck, 38, Australian footballer (Hawthorn, Richmond).Former Tiger Shane Tuck passes away *Jorge Villavicencio, 62, Guatemalan surgeon and politician, Minister of Public Health and Social Assistance (2012–2014), COVID-19.Exministro Jorge Villavicencio muere por covid-19 ===21=== *François Amoudruz, 93, French resistant and Holocaust survivor.François Amoudruz, l'infatigable passeur de mémoir *Dobby Dobson, 78, Jamaican reggae singer and record producer, COVID-19.Beloved Jamaican Singer Dobby Dobson Dies At 78 *Suka K. Frederiksen, 55, Greenlandic politician, MP (since 2014) and Minister of Foreign Affairs (since 2017).Suka K. Frederiksen er død *Li Jijun, 87, Chinese geographer and geomorphologist, member of the Chinese Academy of Sciences (since 1991).哀悼！“大先生”李吉均院士逝世 *Margaret McIver, 86, Australian Olympic equestrian (1984).Ballarat in mourning after Olympian Margaret McIver dies, aged 86 *Andrew Mlangeni, 95, South African anti-apartheid activist (Rivonia Trial) and politician, MP (1994–1999, 2009–2014), intestinal blockage.Anti-apartheid stalwart Andrew Mlangeni has died *Lennox Napier, 92, British major Army general. *Francisco Rodríguez Adrados, 98, Spanish Hellenist, translator and linguist, member of the Royal Spanish Academy (since 1990) and Real Academia de la Historia (since 2003).Muere el académico de la RAE Francisco Rodríguez Adrados *Annie Ross, 89, British-American jazz singer (Lambert, Hendricks & Ross), songwriter (\"Twisted\") and actress (Superman III), problems caused by emphysema and heart disease.‘Twisted’ lyricist, vocalese pioneer Annie Ross has Died *Mike Slemen, 69, English rugby union player (Liverpool, national team).England Grand Slam winner Mike Slemen has passed away aged 69 *Tim Smith, 59, English pop rock singer-songwriter (Cardiacs, The Sea Nymphs, Spratleys Japs), musician and record producer, problems caused by a stroke.Tim Smith (Cardiacs) RIP *Wouter Snijders, 92, Dutch politician and legal scholar, Justice (1970–1986) and Vice President of the Supreme Court of the Netherlands (1986–1998).Prof.Mr. W. (Wouter) Snijders *Lalji Tandon, 85, Indian politician, MP (2009–2014) and Governor of Bihar (2018–2019) and Madhya Pradesh (2019–2020), problems caused by urinary tract infection.Madhya Pradesh Governor Lalji Tandon dies *Kansai Yamamoto, 76, Japanese fashion designer, acute myeloid leukaemia.Designer and David Bowie collaborator Kansai Yamamoto dies aged 76 ===22=== *Jos Bax, 74, Dutch footballer (FC Eindhoven, Helmond Sport, VVV-Venlo).Voormalig doelman FC Eindhoven en Helmond Sport Jos Bax (74) overleden (death announced on this date) *Zacharias Chaliabalias, 74, Greek footballer (Iraklis, national team).Θρήνος στον Ηρακλή! Πέθανε ο Χαλιαμπάλιας *Dino De Poli, 90, Italian lawyer and politician, Deputy (1968–1972).È morto Dino De Poli: la sua Fondazione Cassamarca cambiò il volto di Treviso *Charles Dewachtere, 92, Belgian Olympic marathon runner (1952).In Memoriam Olympiër Charles Dewachtere *Charles Evers, 97, American civil rights activist, disc jockey and politician, Mayor of Fayette, Mississippi (1969–1981, 1985–1989). *Evlogy, 83, Russian Orthodox prelate, Metropolitan of Vladimir and Suzdal (1990–2018).Умер митрополит Евлогий *Joan Feynman, 93, American astrophysicist, heart failure.Joan Feynman *Alexander Gusev, 73, Russian ice hockey player (national team), Olympic champion (1976).Скончался советский хоккеист Александр Гусев *Carlton Haselrig, 54, American wrestler, football player (Pittsburgh Steelers, New York Jets) and mixed martial artist, NCAA Wrestling Division I and II champion (1987–1989).Former Steeler, Pitt- Johnstown wrestler Carlton Haselrig dies at 54, coroner says *Aleksandr Ivanitsky, 82, Soviet-Russian wrestler, Olympic champion (1964), suspected drowning.В Подмосковье нашли мертвым олимпийского чемпиона по вольной борьбе Александра Иваницкого *Ralph Liguori, 93, American racing driver (NASCAR Cup Series, USAC Championship Car series).Oval ace Ralph Liguori dies at 93 *Tom Mitchell, 88, Irish republican and politician, MP (1955). (death announced on this date) *Stanley Robinson, 32, American basketball player (Iowa Energy, Moncton Miracles, Reales de La Vega).Former UConn basketball star Stanley Robinson dead at 32 years old *Bob Sebra, 58, American baseball player (Montreal Expos, Philadelphia Phillies, Cincinnati Reds), multiple organ failure.L’ancien lanceur des Expos Bob Sebra est décédé *Chito Soganub, 59, Filipino Roman Catholic priest and kidnap victim, cardiac arrest.Priest who survived Maute captivity passes away *Luzius Wildhaber, 83, Swiss politician and lawyer, President of the European Court of Human Rights (1998–2007).Morto l'esperto in diritto internazionale Luzius Wildhaber ===23=== *Mike Adams, 55, American political writer and columnist (The Daily Wire). *John Blake, 59, American football player and coach (Oklahoma Sooners, North Carolina Tar Heels, Nebraska Cornhuskers), heart attack.Former Oklahoma Head Coach John Blake Dead At 59 *Jean Brankart, 90, Belgian Tour de France racing cyclist.Jean Brankart, tweede in Tour 1955, op 90-jarige leeftijd overleden *Éric de Cromières, 66, French sports executive and businessman (Michelin, ASM Clermont Auvergne), cancer.Eric de Cromières, président du club de rugby de Clermont, est mort *Emmanuel Farhi, 41, French economist. *Joseph Jerome Farris, 90, American politician and lawyer, Judge of the U.S. Court of Appeals for the Ninth Circuit (since 1979).Joseph Jerome Farris *Alan Garner, 69, English footballer (Luton Town, Watford, Millwall).Former Hatters Defender Passes Away - RIP Alan Garner *Noel Jenke, 73, American football player (Minnesota Vikings, Atlanta Falcons, Green Bay Packers), problems caused by surgery.Legendary Big Ten Conference Athlete Has Died At 73 *Tomas Joson III, 72, Filipino politician and businessman, Governor of Nueva Ecija (1992–1995, 1998–2007).Head of Ecija’s most known pol clan, Tomas Joson III, dies at 72 *Jurjaan Koolen, 81, Dutch Olympic volleyball player (1964).In memoriam Jurriaan Koolen *Ward Plummer, 79, American physicist, member of the American Academy of Arts and Sciences (since 2014).LSU Mourns the Passing of Internationally Renowned Professor E. Ward Plummer *Leida Rammo, 96, Estonian actress (A Young Retiree, The Fencer, Padjaklubi) and theatre director.Meie seast lahkus 96-aastasena näitleja Leida Rammo *Sérgio Ricardo, 88, Brazilian movie director (The Night of the Scarecrow), composer (Black God, White Devil) and pianist, heart failure.Morre no Rio o cantor e compositor Sérgio Ricardo *José Said, 90, Peruvian-born Chilean businessman, founder chairman of Parque Arauco S.A. (since 1979).Fallece José Said, socio y presidente de Parque Arauco y Scotiabank Chile *Paolo Sassone-Corsi, 64, Italian molecular biologist (French National Centre for Scientific Research, University of California, Irvine).Morto il biologo e genetista Paolo Sassone-Corsi *Jacqueline Scott, 89, American actress (Macabre, Duel, The Fugitive).Jacqueline Scott, Actress in 'The Fugitive' and 'Charley Varrick,' Dies at 89 *Dominic Sonic, 55, French singer.Le chanteur rock Dominic Sonic s'est éteint *Jerry Taft, 77, American meteorologist (WLS-TV, WMAQ-TV).Jerry Taft, ABC7 meteorologist for 33 years, dies at 77 *Stuart Wheeler, 85, British financier and political activist, founder of IG Group and Treasurer of the UK Independence Party (2011–2014), stomach cancer.Stuart Wheeler, spread-betting mogul who became a leading donor to the Conservative Party – obituary *Paulette Wilson, 64, Jamaican-British human rights activist.Paulette Wilson: Windrush campaigner who faced deportation dies aged 64 ===24=== *Nina Andreyeva, 81, Russian chemist and politician, General Secretary of the All- Union Communist Party of Bolsheviks (since 1991).Умерла автор «манифеста антиперестроечных сил» Нина Андреева *Claude Beausoleil, 71, Canadian writer and poet.Le poète Claude Beausoleil s'éteint *Bo Black, 74, American festival director (Summerfest) and Playboy cover girl.Elizabeth 'Bo' Black, 74, guided Summerfest in its early years and helped make it an international juggernaut *Dick Bond, 84, American lawyer, banker and politician, member of the Kansas Senate (1987–2001).Former Senate President Dick Bond passes away *Maurizio Calvesi, 92, Italian art critic, art historian and essayist.E' morto Maurizio Calvesi. Fu amico di Piero Guccione *Rene Carpenter, 92, American columnist and television personality, congestive heart failure.Rene Carpenter, Astronaut’s Wife Who Broke NASA Mold, Dies at 92 *Janine Despinette, 93–94, French researcher and critic.Disparition de Janine Despinette, spécialiste de la littérature jeunesse *Roberto Draghetti, 59, Italian dubbing actor (Madagascar franchise, Ed, Edd n Eddy, The Fantastic Four), heart attack.Addio a Roberto Draghetti *David Hagen, 47, Scottish footballer (Falkirk, Clyde, Peterhead), motor neuron disease.David Hagen: Tributes paid to former Rangers, Hearts and Falkirk player who has died at 47 *Ben Jipcho, 77, Kenyan athlete, Olympic silver medallist (1972), prostate cancer.Ben Jipcho, Olympic silver medalist who played role in 1968 upset of Jim Ryun, dies at 77 *Nejib Ben Khalfallah, 52–53, Tunisian dancer and choreographer.Décès du chorégraphe Nejib Ben Khalfallah *Mário Maffei, 94, Brazilian politician and engineer, Mayor of São Carlos (1973–1977).Morre Mário Maffei, ex-prefeito de São Carlos *Claude-Gérard Marcus, 86, French politician, Deputy (1968–1997).La disparition de Claude-Gérard Marcus *Benjamin Mkapa, 81, Tanzanian politician, President (1995–2005).Tanzania's former President Benjamin William Mkapa has died *Kundi Paihama, 75, Angolan politician, Minister of Defense (2002–2010) and MP (since 2018). *Bernard Mohlalisi, 87, Lesothan Roman Catholic prelate, Archbishop of Maseru (1990–2009). *Regis Philbin, 88, American entertainer and television personality (The Joey Bishop Show, Live with Regis and Kathie Lee, Who Wants to Be a Millionaire), heart attack caused by coronary artery disease.Regis Philbin, Legendary Television Host, Dies at 88 *Lotty Rosenfeld, 77, Chilean artist, lung cancer.A los 77 años muere Lotty Rosenfeld, la artista que dibujó cruces contra el poder *Amala Shankar, 101, Indian dancer and actress (Kalpana).Renowned danseuse Amala Shankar passes away in Kolkata *Paul Van Roy, 88, Belgian basketball player (national team) and sports journalist (Gazet van Antwerpen), pancreatic cancer.Regiojournalist en basketbalicoon Paul Van Roy (88) overleden (death announced on this date) *Jan Verroken, 103, Belgian politician, member of the Chamber of Representatives (1950–1981), MEP (1979–1984) and Mayor of Oudenaarde (1983–1988).Oud-CVP-politicus Jan Verroken (103) overleden *Zheng Shouren, 81, Chinese engineer, chief designer of the Three Gorges Dam.一生扎根三峡，被称为“工地院士”，中国工程院院士、长江委原总工郑守仁逝世 ===25=== *Azimzhan Askarov, 69, Kyrgyz journalist and human rights activist, pneumonia.Sentenced to life imprisonment Azimzhan Askarov dies in prison *Jim Frick, 68, Swedish horse harness racer, prostate cancer.Travlegendaren Jim Frick är död *Peter Green, 73, English Hall of Fame blues rock singer-songwriter (\"Black Magic Woman\") and guitarist (Fleetwood Mac, Peter Green Splinter Group).Peter Green death: Fleetwood Mac co-founder dies aged 73 *Flor Isava Fonseca, 99, Venezuelan journalist and sports executive.Fallece Flor Isava, la eterna dama del olimpismo venezolano *Olivia de Havilland, 103, British-American actress (Gone with the Wind, Captain Blood, The Adventures of Robin Hood).https://ew.com/movies/gone-with-the-wind-star-olivia-de-havilland-dies- at-104/ 'Gone With the Wind' star Olivia de Havilland dies at 104] *Lou Henson, 88, American Hall of Fame college basketball player (Connors State College), coach (New Mexico State, Illinois) and administrator, bone marrow cancer.Lou Henson, who led Illinois basketball to the 1989 Final Four, dies at 88 *Bernard Ładysz, 98, Polish opera singer and actor (The Quack, The Promised Land, Pierścień i róża).Nie żyje śpiewak Bernard Ładysz *Giulio Maceratini, 82, Italian politician, MEP (1988).E' morto Giulio Maceratini, protagonista della destra italiana *José Mentor, 71, Brazilian lawyer and politician, Deputy (2003–2019), COVID-19.Ex-deputado José Mentor (PT) morre aos 71 anos após ser vítima de coronavírus em SP, diz partido *Maurice Petty, 81, American Hall of Fame racing driver, crew chief, and engine builder.Maurice Petty, NASCAR Hall of Fame engine builder, dies *John Saxon, 83, American actor (A Nightmare on Elm Street, Enter the Dragon, The Girl Who Knew Too Much) and mixed martial artist, problems caused by pneumonia.John Saxon, 'Enter the Dragon,' 'Nightmare on Elm Street' Actor, Dies at 83 *Eddie Shack, 83, Canadian ice hockey player (Toronto Maple Leafs, New York Rangers, Pittsburgh Penguins), four-time Stanley Cup winner (1962–1964, 1967), throat cancer.Shack, four-time Cup-winner, dies at 83 *Janell Smith, 73, American Olympic sprinter (1964), cancer.In Memoriam: Janell Smith, 5/3/1947 - 7/25/2020 *Luciano Fabio Stirati, 97, Italian politician, Senator (1963–1968, 1972–1976).Morto il senatore Luciano Fabio Stirati, il ricordo del presidente della Provincia di Perugia ===26=== *Jim Abbott, 77, Canadian politician, MP (1993–2011). *Edmund Ansin, 84, American businessman, co-founder of Sunbeam Television.Loss of a Leader: WHDH owner Ed Ansin passes away at 84 *Rafael Barraza Sánchez, 91, Mexican Roman Catholic prelate, Bishop of Mazatlán (1981–2005).Bishop Rafael Barraza Sánchez *R. Stephen Berry, 89, American physical chemist. *Alain Cacheux, 72, French politician, Deputy (1997–2002, 2007–2012), heart attack.Alain Cacheux, ancien député PS et figure socialiste du Nord, est décédé *Dame Olivia de Havilland, 104, French-British-American actress (Gone with the Wind, The Adventures of Robin Hood, To Each His Own), Oscar winner (1947, 1950).Olivia de Havilland, star of Gone with the Wind, dies at 104 *Bill English, 91, American computer engineer, co-developer of the computer mouse, respiratory failure.Column: Bill English, wizard behind the scenes of seminal computer technologies, dies at 91 *Francisco Frutos, 80, Spanish politician, General Secretary of the Communist Party of Spain (1998–2009), cancer. *Claudia Giannotti, 83, Italian actress (Il Prof. Dott. Guido Tersilli, primario della clinica Villa Celeste, convenzionata con le mutue).Morta a Torino l’attrice Claudia Giannotti *Dick Klaverdijk, 73, Dutch politician, Mayor of Bergen, Limburg (1988–2011).Oud-burgemeester van Bergen Dick Klaverdijk overleden *Guy Lutgen, 84, Belgian politician, Minister of Agriculture (1988–1999), Senator (1977–1995) and Mayor of Bastogne (1976–2000).Guy Lutgen, ancien ministre et bourgmestre de Bastogne, est mort *Chris Needs, 66, Welsh radio broadcaster (BBC Cymru Wales), heart disease.Legendary BBC Radio Wales DJ Chris Needs has died *Lluís Serrahima, 88, Spanish singer-songwriter.Fallece Lluís Serrahima, uno de los padres de la Nova Cançó *Hans-Jochen Vogel, 94, German politician, Mayor of Munich (1960–1972), Minister of Justice (1974–1981) and Leader of the SPD (1987–1991), problems caused by Parkinson's disease.Germany: Ex-SPD leader Hans-Jochen Vogel dies *John Weeks, 79, American economist.We are greatly saddened by the death of the brilliant progressive heterodox economist John Weeks on 26 July *Roger Williams, 88, British hepatologist. ===27=== *Israfil Alam, 54, Bangladeshi politician, MP (since 2009), COVID-19.AL MP Israfil Alam dies following Covid-19 infection *Owen Arthur, 70, Barbadian politician, Prime Minister (1994–2008), problems caused by heart disease.Former Barbados Prime Minister Owen Arthur Has Died *Bernard Cleary, 83, Canadian politician and indigenous rights activist, MP (2004–2006).Former Bloc MP Bernard Cleary, strong defender of Indigenous rights, has died at 83 *Marcelo Elío Chávez, 54, Bolivian politician and journalist, President of the Plurinational Legislative Assembly (2014–2015).Fallece Marcelo Elío Chávez, expresidente de la Cámara de Diputados *Sir John Guinness, 84, British civil servant and businessman.Guinness *William Hill, 75, Hong Kong Olympic sprinter (1964).Olympian and former Hong Kong 400m record-holder William Hill dies at 75 *Frank A. Howard, 81, American politician, Sheriff of Vernon Parish (1976–2000) and member of the Louisiana House of Representatives (2008–2020), problems caused by COVID-19.Vernon Parish political icon Frank Howard passes away *Denise Johnson, 56, English singer (Primal Scream).Denise Johnson, singer with Primal Scream, dies aged 53 *Kina Kadreva, 88, Bulgarian children’s book writer.Отиде си детската писателка Кина Къдрева *Magda Kósáné Kovács, 79, Hungarian politician, MEP (2004–2009).Elhunyt Kósáné Kovács Magda *Muhammad Asad Malik, 78, Pakistani field hockey player, Olympic champion (1968) and silver medalist (1964, 1972), Asian Games champion (1962, 1970) and silver medalist (1966), car crash.Olympian Asad Malik passes away *Miss Mercy, 71, American groupie and singer (The GTOs).Miss Mercy, Frank Zappa Muse and GTO Co-Founder, Dead at 71 *Jan Skopeček, 94, Czech actor (Hroch, Tam, kde hnízdí čápi) and playwright.Zemřel herec Jan Skopeček *Khalil Taha, 88, Lebanese wrestler, Olympic bronze medalist (1952).Khalil Taha *Gianrico Tedeschi, 100, Italian actor (Susanna Whipped Cream, Il merlo maschio, Dr. Jekyll Likes Them Hot), congestive heart failure.E' morto Gianrico Tedeschi ===28=== *Aleksandr Aksinin, 65, Russian athlete, Olympic champion (1980) and bronze medalist (1976).Александр Аксинин скончался на 66-м году жизни *Junrey Balawing, 27, Filipino record holder, world's shortest man (since 2015).Pinoy na 'World's Shortest Man', pumanaw na *Angelo Carossino, 91, Italian politician, Mayor of Savona (1958–1967), President of Liguria (1975–1979) and MEP (1979–1989).Morto Angelo Carossino, ex presidente Regione Liguria *Bent Fabric, 95, Danish pianist and composer.Bent Fabricius-Bjerre er død *Gisèle Halimi, 93, Tunisian-French lawyer, feminist writer and politician, Deputy (1981–1984) and Ambassador to UNESCO (1985–1987).Avocate et figure féministe, Gisèle Halimi est morte *Gerry Harris, 74, English footballer (Wolverhampton Wanderers).Wolves mourn the loss of hero Gerry Harris *Martin Konings, 91, Dutch politician, MP (1973–1986).Oud-PvdA kamerlid Martin Konings overleden *Kumkum, 86, Indian actress (Ganga Maiyya Tohe Piyari Chadhaibo, Mr. X in Bombay, Gunah Aur Kanoon).86 की उम्र में अभिनेत्री कुमकुम का निधन, किशोर कुमार और गुरु दत्त के संग किया था काम *Raavi Kondala Rao, 88, Indian actor (Ramudu Bheemudu, Preminchi Choodu, Jeevitha Chakram) and writer, cardiac arrest.Veteran Telugu Actor, Writer Raavi Kondala Rao No More *Herbert Leuninger, 87, German Catholic priest, theologian and human rights activist (Pro Asyl).Pro-Asylgründer Herbert Leuninger gestorben Anwalt und Lautsprecher für Flüchtlinge *John McNamara, 88, American baseball manager (San Diego Padres, Cincinnati Reds, Boston Red Sox). *Nicholas Micozzie, 89, American politician, member of the Pennsylvania House of Representatives (1979–2014), problems caused by a fall. *Joseph Moingt, 104, French jesuit.Joseph Moingt, le jésuite qui ne pouvait s'empêcher de vivre *Bill Montgomery, 80, American political activist, founder of Turning Point USA, COVID-19.Turning Point USA co-founder dies of coronavirus-related complications *Paul Morin, 96, French politician, Mayor of Bourg-en-Bresse (1989–1995).Paul Morin, ancien maire de Bourg-en-Bresse et résistant, est décédé *Irene Pollin, 96, American sports executive and philanthropist, co-owner of Washington Capitals and Washington Wizards.Ex-Wizards, Capitals co-owner Irene Pollin dies at 96 *Diana E. H. Russell, 81, South African feminist activist and writer, respiratory failure.Diana Russell *Reese Schonfeld, 88, American television executive, President of CNN (1980–1982) and founder of Food Network, problems caused by Alzheimer's disease.Reese Schonfeld, CNN's founding president, has died at 88 *Terry Waters, 76, Australian footballer (Collingwood), cancer.Collingwood club great Terry Waters passes away after cancer battle ===29=== *Malik B., 47, American rapper (The Roots).Malik B Of The Roots Has Reportedly Died At 47 *Kittie Blakemore, 91, American basketball coach (West Virginia Mountaineers).Kittie Blakemore, pioneer for women’s basketball at WVU, dies at 91 *Salko Bukvarević, 53, Bosnian politician and Army military personnel, Minister for Veterans and Disabled Veterans (since 2015), co-founder of the Party of Democratic Action, COVID-19.Od Covida-19 umro BiH ministar: Stanje mu se pogoršalo prije 10 dana, bio je na respiratoru *Albin Chalandon, 100, French politician, Minister of Public Works (1968–1972) and Justice (1986–1988).L’ancien garde des Sceaux Albin Chalandon est mort à l’âge de 100 ans *Ayo Fasanmi, 94, Nigerian politician and businessman, MP (since 1983).Senator Ayo Fasanmi, Afenifere leader, dies at 94 *Anatoli Fedyukin, 69, Soviet-Russian handball player, Olympic champion (1976) and silver medalist (1980).На 69-м году ушел из жизни выдающийся гандболист сборной СССР и ЦСКА, победитель Олимпийских игр и чемпионата мира Анатолий Федюкин *Mike Gillespie, 80, American baseball player and coach (USC Trojans, national team), College World Series winner (1961, 1998), problems caused by a stroke and lung disease.Longtime college baseball coach Mike Gillespie dies at 80 *Oz Griebel, 71, American banker, lawyer and politician, 2010 and 2018 Connecticut gubernatorial candidate, hit by a car. *Andy Haden, 69, New Zealander rugby union player (Auckland, national team), chronic lymphocytic leukaemia.Rugby: All Blacks legend Andy Haden loses battle with cancer *Joe E. Kernan, 74, American politician and businessman, Mayor of South Bend (1988–1997), Lieutenant Governor (1997–2003) and Governor of Indiana (2003–2005), problems caused by Alzheimer's disease.Former Indiana governor, South Bend mayor Joe Kernan dead at age 74 *Bob McCurdy, 68, American basketball player (Richmond Spiders), anal cancer.Spiders Hall-of-Famer McCurdy Dies at 68 *Mark V. Meierhenry, 75, American lawyer and politician, Attorney General of South Dakota (1979–1987).Mark V. Meierhenry *Hernán Pinto, 67, Chilean politician, Mayor of Valparaíso (1990–2004), COVID-19.Fallece exalcalde de Valparaíso Hernán Pinto por complicaciones derivadas del Covid-19 *Andre Ptaszynski, 67, British theatre producer.Producer Andre Ptaszynski has died aged 67 *David Ramsay, 72, Australian-born Canadian politician, Ontario MPP (1985–2011).Former MPP David Ramsay passes away *Ajip Rosidi, 82, Indonesian writer and poet.Sastrawan Ajip Rosidi Dikabarkan Meninggal Dunia, Sempat Dirawat di Rumah Sakit *Perence Shiri, 65, Zimbabwean Air Force officer and politician, Commander of the Air Force (1992–2017) and Minister of Agriculture (since 2017), COVID-19.Lands Minister Perrance Shiri Has Died *R. Toros, 85, Syrian-born French sculptor.Le célèbre sculpteur Toros est décédé *Don Townsend, 89, English footballer (Charlton Athletic, Crystal Palace).Don Townsend: 1930-2020 (death announced on this date) ===30=== *Karen Berg, 77, American author, co-founder of the Kabbalah Centre.Karen *Maarten Biesheuvel, 81, Dutch writer.Maarten Biesheuvel overleden *Herman Cain, 74, American businessman (Godfather's Pizza) and politician, Chairman of the Federal Reserve Bank of Kansas City (1995–1996), 2012 presidential candidate, COVID-19.Former GOP presidential candidate Herman Cain dies after battle with coronavirus *Connie Culp, 57, American face transplant recipient, problems caused by an infection.Connie Culp, recipient of first face transplant in US at Cleveland Clinic, dies at 57 (death announced on this date) *Bob Dearing, 85, American politician, member of the Mississippi State Senate (1980–2012, 2016–2019).Former Sen. Bob Dearing dies at 85 *Lee Teng-hui, 97, Taiwanese politician, Mayor of Taipei (1978–1981), Vice President (1984–1988) and President (1988–2000), sepsis caused by multiple organ failure.Lee Teng-hui, Taiwan's 'Father of Democracy,' dies at 97 *Sydney Lotterby, 93, British television producer (Last of the Summer Wine, Yes Minister, Open All Hours).Porridge and Open All Hours producer Sydney Lotterby dies aged 93 (death announced on this date) *Somen Mitra, 78, Indian politician, West Bengal MLA (1972–1977, 1982–2009) and MP (2009–2014), cardiac arrest caused by multiple organ failure.West Bengal Congress president Somendranath Mitra passes away *Juan Ramón, 80, Argentine singer and actor, problems caused by pneumonia.Murió el cantante Juan “Corazón” Ramón: tenía 80 años y padecía una pulmonía *Mark Rocco, 69, English professional wrestler (All Star Wrestling, NJPW).Décès de Mark « Rollerball » Rocco à l’âge de 69 ans *Jorge Santibáñez Ceardi, 86, Chilean politician, Deputy (1965–1973) and Mayor of Viña del Mar (1994–1996).Fallece exalcalde de Viña del Mar Jorge Santibáñez a los 86 años: se declaró duelo comunal *Helena Žigon, 92, Slovenian marathon runner.Umrla je tekaška legenda Helena Žigon ===31=== *Mike Clark, 73, American movie critic (USA Today), injuries caused from a fall.Mike Clark Dies: Longtime USA Today Film Critic Was 73 *Mike Gale, 70, American basketball player (San Antonio Spurs, Brooklyn Nets, Portland Trail Blazers). *Sa. Kandasamy, 80, Indian novelist and filmmaker, heart attack.Sa Kandasamy, Tamil writer and documentary filmmaker, dies in Chennai *Gary Knopp, 64, American politician, member of the Alaska House of Representatives (since 2017), plane crash.UPDATE: Rep. Gary Knopp has died in a plane crash near Soldotna *Gilles Lapouge, 96, French writer and journalist (O Estado de S. Paulo, Le Monde).Gilles Lapouge, écrivain et journaliste, est mort *Giulio Lazzarini, 93, Italian politician, Mayor of Lucca (1994–1998).Morto a 93 anni l’ex sindaco di Lucca Giulio Lazzarini *Eusebio Leal, 77, Cuban-Mexican historian, pancreatic cancer.Falleció Eusebio Leal este viernes *Bill Mack, 88, American country music disc jockey (WBAP) and songwriter (\"Blue\", \"Drinking Champagne\"), Grammy winner (1997), COVID-19.Texas Radio's ‘Midnight Cowboy,' Country Songwriter Bill Mack Dies of COVID-19, Family Says *Sir Alan Parker, 76, English movie director (Midnight Express, Pink Floyd—The Wall, Mississippi Burning), BAFTA winner (1977, 1979).Alan Parker Dies: Towering UK Director Of ‘Bugsy Malone’, ‘Midnight Express’ & ‘Evita’ Was 76 *Tamás Pomucz, 63, Hungarian Olympic sailor (1992).Gyász: elhunyt Pomucz Tamás Európa-bajnok vitorlázó *R. D. Pradhan, 92, Indian politician, Governor of Arunachal Pradesh (1987–1990).माजी केंद्रीय गृह सचि व राज्याचे माजी मुख्य सचिव राम प्रधान यांचे निधन *Wim Scherpenhuijsen Rom, 87, Dutch banker, founder of ING.ING-oprichter Wim Scherpenhuijsen Rom (87) overleden *Stephen Tataw, 57, Cameroonian footballer (Tonnerre Yaoundé, Olympic Mvolyé, national team).Cameroon's Italia '90 captain Stephen Tataw dies *Joan Mari Torrealdai, 77, Spanish political writer, sociologist and journalist, member of the Euskaltzaindia (since 2007), cancer.Fallece Joan Mari Torrealdai *Miodrag Živković, 92, Serbian sculptor and educator.Преминуо вајар Миодраг Живковић, творац споменика на Тјентишту ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *07 Deaths",
 "title": "Deaths in July 2020"
}