{
 "id": "75534",
 "text": "Work It Out Cover Singel Beyoncé from the album Austin Powers in Goldmember OST & Dangerously in Love Released June 11 2002\"Beyonce Knowles - Discography - Work It Out\" . Billboard. Genre Funk Length 3:22 Label Columbia Records Writer Beyoncé Knowles, Pharrell Williams, Chad Hugo Producer The Neptunes Beyoncé singles chronology I Got That (2000) Work It Out '03 Bonnie & Clyde (2002) Austin Powers in Goldmember OST track listing Work It Out (1) Miss You (2) Dangerously in Love track listing Gift from virgo (14) Work It Out (15) '03 Bonnie & Clyde (16) Work It Out is a funk song written by American singer-songwriter Beyoncé Knowles and The Neptunes members Pharrell Williams and Chad Hugo (who produced the track) for the soundtrack to the 2002 film Austin Powers in Goldmember—in which she plays Foxxy Cleopatra—and was later featured on the non-U.S. editions of Knowles' solo debut album, Dangerously in Love (2003). Released as a single in June 2002, it failed to chart on the U.S. Billboard Hot 100, but did experience moderate success on the Billboard Hot Dance Club Play chart, debuting at number forty-nine and later peaking at number eleven. Nevertheless, it was a relative hit in European countries such as the United Kingdom and Norway, where it reached number seven and number three respectively. The music video for the song was directed by Matthew Rolston. This funky number features Chad Hugo on the saxophone. == Official versions == * \"Work It Out\" (a capella) * \"Work It Out\" (instrumental) * \"Work It Out\" (demo version) * \"Work It Out\" (radio edit) * \"Work It Out\" (new radio edit) * \"Work It Out\" (alternative bridge version) * \"Work It Out\" (Azza's Nu Soul mix) * \"Work It Out\" (Blow Your Horn dub) * \"Work It Out\" (Charlie's Nu NRG mix) * \"Work It Out\" (Goldmember Shagadelic mix) * \"Work It Out\" (H&D; Nu Rock mix) * \"Work It Out\" (Maurice's Nu Soul mix) * \"Work It Out\" (Rockwilder remix) (featuring Redman) * \"Work It Out\" (T - Gray remix) * \"Work It Out\" (D. Elliot remix) * \"Work It Out\" (Victor Calderone mix) * \"Work It Out\" (K.O. Ragga mix) * \"Work It Out\" (K.O. Underworld dub) * \"Work It Out\" (Illicit Planets of Universe mix) * \"Work It Out\" (Vibelicious club mix) * \"Work It Out\" (RC Groove Nu Electric mix) * \"Work It Out\" (Jared Jones Vibelicious club mix) == References == Category:Beyoncé songs Category:2002 songs",
 "title": "Work It Out"
}