{
 "id": "755397",
 "text": "The following is a list of deaths that should be noted in September 2020. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==September== ===1=== *Wick Allison, 72, American magazine publisher (National Review, The American Conservative), owner (D Magazine) and author, bladder cancer.Wick Allison, publishing entrepreneur and founder of D magazine, dies at 72 *Nada Birko, 88, Croatian Olympic skier (1952).Nada Birko *Edwin M. Cronk, 102, American politician, Ambassador to Singapore (1972–1975).Edwin Cronk *Délio dos Santos, 95, Brazilian pro-democracy lawyer and politician, Deputy (1979–1987), pneumonia.Morre no Rio o ex-deputado federal Délio dos Santos *Melanie Wade Goodwin, 50, American politician, member of the North Carolina House of Representatives (2005–2011), breast cancer.Ex-NC Rep. Goodwin, Who Made History With Childbirth, Dies *Sheila Ingram, 63, American athlete, Olympic silver medalist (1976).Olympian Sheila R. Ingram passes away at age 63 *Boris Klyuyev, 76, Russian actor (D'Artagnan and Three Musketeers, The Adventures of Sherlock Holmes and Dr. Watson, TASS Is Authorized to Declare...), People's Artist (2002), lung cancer.Умер Борис Клюев, звезда сериала «Воронины» и советского «Шерлока Холмса» *Vladislav Krapivin, 81, Russian children's writer and journalist (Ural Pathfinder), pneumonia.Умер писатель Владислав Крапивин *François Lalande, 89, Algerian-born French actor (Herbie Goes to Monte Carlo, French Postcards, The Hour of the Pig).Mort de l'acteur François Lalande, vu dans Les Visiteurs, à 89 ans *John Meyer, Australian slide guitarist (Rose Tattoo, Chain, Swanee). (death announced on this date) *Ian Mitchell, 62, Scottish bass player (Bay City Rollers). *Erick Morillo, 49, Colombian-American DJ (Reel 2 Real), music producer (\"I Like to Move It\") and record label owner, suspected suicide.DJ Erick Morillo found dead in Miami Beach *John Najarian, 92, American transplant surgeon.John Najarian, Pioneering Transplant Surgeon, Dies at 92 *Sue C. Nichols, 55, American animator (The Lion King, The Hunchback of Notre Dame) and screenwriter (Aladdin).Susan Maciorowski *Miloš Říha, 61, Czech ice hockey player (ZUBR Přerov, Dukla Jihlava) and coach (national team).Скончался бывший главный тренер «Спартака», СКА и «Авангарда» Милош Ржига *Terje Steen, 76, Norwegian ice hockey player (national team) and Olympian (1968, 1972).Terje Steen *Thomas L. Steffen, 90, American politician and lawyer, Justice of the Supreme Court of Nevada (1982–1997).Thomas L. Steffen *Jerzy Szczakiel, 71, Polish speedway rider, world champion (1973).Jerzy Szczakiel nie żyje. Był pierwszym polskim mistrzem świata na żużlu *James A. Taylor, 92, Canadian politician and lawyer, Ontario MPP (1971–1987) and Mayor of Prince Edward County (1997–2003). ===2=== *David Capel, 57, English cricketer (Northamptonshire, national team), brain cancer.David Capel, former Northants and England all-rounder, dies aged 57 *Albert Cheesebrough, 85, English footballer (Burnley, Leicester City, Port Vale). *Philippe Daverio, 70, French-born Italian art critic, academic and television presenter, brain cancer.È morto Philippe Daverio, storico dell'arte e divulgatore *Fred Davies, 81, English football player (Wolverhampton Wanderers, Bournemouth) and manager (Weymouth), idiopathic pulmonary fibrosis.Fred Davies | 1939-2020 *Datta Ekbote, 84, Indian activist and politician, Mayor of Pune (1998–2017), COVID-19.Former Pune Mayor Datta Ekbote Dies of COVID As He Couldn’t Get Hospital Bed On Time *David Evans, 95, Australian RAAF Air Marshal, Chief of the Air Staff (1982–1985). *David Graeber, 59, American anthropologist, anarchist activist (Occupy Wall Street) and political writer (Bullshit Jobs, Debt: The First 5000 Years, The Utopia of Rules), hemorrhage caused by pancreatitis.Mort de l’anthropologue David Graeber *Clyde H. Hamilton, 86, American politician and lawyer, Judge of the U.S. Court of Appeals for the Fourth Circuit (since 1991).Longtime SC Judge Hamilton of US 4th Circuit Court of Appeals dies at 86 *Irving Kanarek, 100, American defense attorney (Charles Manson, Jimmy Lee Smith).Irving Kanarek, Lawyer Who Defended Charles Manson, Dies at 100 *Kang Kek Iew, 77, Cambodian prison guard and war criminal, member of the Khmer Rouge and perpetrator of the Tuol Sleng Genocide, lung disease.Khmer Rouge prison commander Comrade Duch dies *Maria Celeste Nardini, 77, Italian politician, Deputy (1994–2006) and Senator (2006–2008).Maria Celeste Nardini: è morta a 77 anni *Ramkrishna Baba Patil, 84, Indian politician, Maharashtra MLA (1985–1995) and MP (1998–2004), problems caused by diabetes.Former MP Ramkrishna Baba Patil passes away *Alexander Priko, 46, Russian singer and keyboardist (Laskovyi Mai), cancer.Ушел из жизни музыкант группы «Ласковый май» Александр Прико *Agustín Roberto Radrizzani, 75, Argentine Roman Catholic prelate, Bishop of Neuquén (1991–2001) and Lomas de Zamora (2001–2007) and Archbishop of Mercedes-Luján (since 2007), COVID-19.Falleció Monseñor Augustín Radrizzani *Wanda Seux, 72, Paraguayan-born Mexican actress (La vida difícil de una mujer fácil, Spicy Chile, Paradas Contínuas) and dancer, problems caused by multiple strokes and breast cancer.Fallece la actriz y vedette Wanda Seux *John Shrapnell, 85, British-born New Zealand television journalist (Today), actor (The Insider's Guide To Happiness) and opera singer (New Zealand Opera).John Shrapnell death notice *Adrianus Johannes Simonis, 88, Dutch Roman Catholic cardinal, Archbishop of Utrecht (1983–2007).Kardinaal Simonis (88) overleden *František Vaněk, 88, Czech Olympic ice hockey player (1956, 1960).Zemřela legenda brněnského hokeje František Vaněk *William Yorzyk, 87, American Hall of Fame swimmer, Olympic champion (1956).Passages: William ‘Bill’ Yorzyk, 1956 Olympic Champion in 200 Butterfly ===3=== *Kathleen Byerly, 76, American Navy captain, cancer.Retired Navy captain and trailblazer for women’s equality in the service dies at 76 *Betty Caywood, 89, American sportscaster (Kansas City Athletics).Betty Congour Caywood Bushman *Michael J. Cleary, 95, Irish-born Gambian Roman Catholic prelate, Bishop of Banjul (1981–2006).President Barrow Commiserates With Catholic Community Over Deaths Of Bishop Cleary And Goerge Gomez *Antônio de Jesus Dias, 78, Brazilian pastor and politician, Deputy (1980–1981, 1987–1991, 1991–1993), COVID-19.Morre pastor Antonio de Jesus Dias, um dos primeiros líderes da UMADEGO *Alércio Dias, 77, Brazilian lawyer and politician, Deputy (1983–1991), problems caused by gastrointestinal hemorrhage.Morre em Rio Branco ex-deputado federal Alércio Dias *Dito, 58, Portuguese football player (Braga, Benfica, national team) and manager, heart attack.Morreu Dito, diretor do Gil Vicente e antigo internacional português *Ahmed Al-Qadri, 64, Syrian agricultural engineer and politician, Minister of Agriculture and Agrarian Reform (2013–2020), COVID-19.وفاة وزير الزراعة السوري السابق أحمد القادري بـ«كورونا» *Karel Knesl, 78, Czech footballer (Dukla Prague, Slavia Prague, Czechoslovakia national team), Olympic silver medalist (1964).Zemřel fotbalista Karel Knesl. S Duklou vyhrál ligu i Americký pohár, s reprezentací olympijské stříbro *Juracy Pires Gomes, 88, Brazilian politician and physician, Mayor of Brumado (1966–1984).Brumado: morre o ex-prefeito e médico Dr. Juracy Pires Gomes *Jean-François Poron, 84, French actor (The Air of Paris, A Captain's Honor, Catherine) and director.Jean-François Poron (Le Masque de fer, Navarro...) : Mort du comédien de 84 ans *Bill Pursell, 94, American composer (\"Our Winter Love\"), pianist and music teacher, COVID-19.William Pursell, Grammy-Nominated Composer, Dies at 94 *Gianni Serra, 86, Italian movie director and screenwriter (Uno dei tre, La ragazza di via Millelire, Una lepre con la faccia di bambina).Morto Gianni Serra: il regista e sceneggiatore aveva 86 anni *Félix Suárez Colomo, 69, Spanish Olympic racing cyclist (1972).Félix Suárez *Birol Ünel, 59, Turkish-born German actor (In July, Head-On, Transylvania), liver cancer.Schauspieler Birol Ünel stirbt mit nur 59 Jahren *Dave Zeller, 81, American basketball player (Cincinnati Royals).The ‘Shooter’…Former Piqua Coach Dave Zeller Dies ===4=== *Ajibade Babalade, 48, Nigerian footballer (Shooting Stars, national team), cardiac arrest.AFCON ’92 Eagles star Babalade dies at 48 *Sir Simon Boyle, 79, British businessman and politician, Lord Lieutenant of Gwent (2001–2016). *Lloyd Cadena, 26, Filipino YouTuber, COVID-19.YouTube sensation Lloyd Cadena passes away at 26 *Annie Cordy, 92, Belgian actress (Victor and Victoria, Ces dames s'en mêlent, Souvenir of Gibraltar) and singer, cardiac arrest.Annie Cordy est décédée à l'âge de 92 ans *Peter Cronjé, 70, South African rugby union player (Golden Lions, national team), cancer.Former Springbok center Peter Cronje passes away aged 70 *Gary Peacock, 85, American jazz double-bassist and composer.Gary Peacock, A Jazz Bassist Always Ahead Of His Time, Dies At 85 *Curtis S. Person Jr., 85, American politician, member of the Tennessee House of Representatives (1966–1968) and State Senate (1968–2006).Former Memphis lawmaker and judge Curtis Person Jr. dies *Aleksandr S. Shengardt, 95, Russian aircraft designer (Tupolev Tu-154).Умер авиаконструктор Александр Шенгардт *Pierre Sidos, 93, French political activist and anarchist, founder of Jeune Nation and L'Œuvre Française.Mort de Pierre Sidos, figure de l’extrême droite pétainiste et nationaliste *Lucille Starr, 82, Canadian country singer-songwriter (\"Cajun Love\").Manitoba-born country music queen Lucille Starr dies at 82 *Dmitry Svetushkin, 40, Moldovan chess grandmaster, suicide by jumping.Погиб один из ведущих гроссмейстеров Молдавии Дмитрий Светушкин *Carl-Henning Wijkmark, 86, Swedish novelist (Stundande natten) and translator.Författaren Carl-Henning Wijkmark är död *Joe Williams, 85, Cook Islands politician, Prime Minister (1999), Minister of Foreign Affairs (1999) and MP (1994–2004), COVID-19.Dr Joe Williams passes on ===5=== *Dwight Anderson, 59, American basketball player (Denver Nuggets, Albuquerque Silvers, Evansville Thunder).Former UK basketball standout Dwight Anderson passes away *Orlando Bauzon, 75, Filipino basketball player (Toyota Super Corollas, national team), coach University of Santo Tomas) and Olympian (1968), cardiac arrest.Former Olympian, Toyota player and UAAP coach Orly Bauzon dies at 75 *Zelmar Casco, 94, Argentine Olympic fencer (1964).Falleció un destacado esgrimista olímpico platense *Žarko Domljan, 87, Croatian politician, Speaker of the Parliament (1990–1992).U dobi od 87 godina preminuo je Žarko Domljan, prvi predsjednik Hrvatskog sabora *Christiane Eda-Pierre, 88, French coloratura soprano.La cantatrice Christiane Éda-Pierre est décédée *David Gaines, 78, American basketball player (Kentucky Colonels) and coach (Detroit Titans, San Diego State Aztecs), cancer.Former College Basketball Coach Has Passed Away *Marian Jaworski, 94, Polish Roman Catholic cardinal, Archbishop of Lviv of the Latins (1991–2008).Nie żyje kardynał Marian Jaworski. Miał 94 lata *Rodney Litchfield, 81, English actor (Early Doors, Coronation Street, Testimony).Early Doors actor Rodney Litchfield dies aged 81, show writer says *Jiří Menzel, 82, Czech movie director (My Sweet Little Village), screenwriter (Closely Watched Trains, Larks on a String) and actor, Oscar winner (1967), pneumonia caused by COVID-19.V osmdesáti dvou letech zemřel režisér Jiří Menzel. *Steve Merrill, 74, American politician and lawyer, Governor of New Hampshire (1993–1997).Former NH Gov. Stephen Merrill has passed away, family says *Brigitte Peskine, 68, French author and screenwriter (Plus belle la vie, Candice Renoir).La romancière et scénariste Brigitte Peskine, qui habitait à Massay, est décédée *Ethan Peters, 17, American beauty influencer, drug overdose.Ethan Peters aka ‘Ethan Is Supreme’ Dies From Apparent Drug Overdose at 17 *Malka Ribowska, 89, Polish-born French actress (Sundays and Cybele, The Shameless Old Lady, Two Men in Town).Malka Ribowska, un grand chemin *Antoine Rufenacht, 81, French politician, President of the Regional Council of Upper Normandy (1992–1998) and Mayor of Le Havre (1995–2010).L'ancien maire du Havre Antoine Rufenacht est mort *Tam Ping-man, 86, Hong Kong actor (Exiled, Wild City, House of Wolves).Bing-Man Tam, HK veteran actor passes away at 86 *Yousef Wali, 90, Egyptian politician, Minister of Agriculture and Land Reclamation (1982–2004).وفاة يوسف والي وزير الزراعة الأسبق *David Walter, 80, New Zealand politician, Mayor of Stratford (1989–1998), leukaemia.Stratford District Council's first mayor David Walter dies age 80 *Al G. Wright, 104, British-born American bandleader and educator, Director of the AAMB (1954–1981).Remembering Al G. Wright *Kevin Zeese, 64, American lawyer and political activist, heart attack.Kevin Zeese Dies of a Sudden, Unexpected Apparent Heart Attack ===6=== *Levon Altounian, 84, Lebanese footballer (Homenetmen, national team).Remembering Levon the great *Sergey Belyayev, 60, Kazakh shooter, Olympic silver medalist (1996).Скончался двукратный серебряный призер Олимпийских игр по пулевой стрельбе *Kesavananda Bharati, 79, Indian civil rights activist (Kesavananda Bharati v. State of Kerala), cardiopulmonary arrest.Kesavananda Bharati, key petitioner in case that led to 'basic structure' of Constitution doctrine, dies *Lou Brock, 81, American Hall of Fame baseball player (Chicago Cubs, St. Louis Cardinals), multiple myeloma.Baseball Hall of Famer, Cardinals legend Lou Brock dies at age 81 *Marco Cariola, 87, Chilean lawyer and politician, Senator (1998–2006).Fallece exsenador y ganadero Marco Cariola *Paul Chittilapilly, 86, Indian Syro-Malabar Catholic prelate, Bishop of Kalyan (1988–1996) and Thamarassery (1996–2010).Syro-Malabar Diocese of Thamarasserry *Kevin Dobson, 77, American actor (Kojak, Knots Landing, Midway), heart attack.Days of our Lives & Knots Landing Actor Kevin Dobson Dead at 77 *Lennart Forsberg, 92, Swedish footballer (GIF Sundsvall, Djurgården).Lennart Forsberg *Bob Fujitani, 98, American comics artist (Flash Gordon), co-creator of Solar.Doctor Solar, Man of the Atom Co-Creator Bob Fujitani Passes Away *Tom Jernstedt, 75, American Hall of Fame basketball administrator, heart attack.Tom Jernstedt, who transformed March Madness and 'loved Indianapolis,' dies at 75 *Sir Vaughan Jones, 67, New Zealand mathematician (Jones polynomial), Fields Medal winner (1990), problems caused by an ear infection. *Anita Lindblom, 82, Swedish actress (Mannequin in Red, Sailors, A Swedish Love Story) and singer.”Sånt är livet”-artisten Anita Lindblom död *Gerry Lynn, 68, American politician and lawyer, member of the Kentucky House of Representatives (2005–2007) and Judge-Executive of Meade County (since 2011).Gerry Lynn, Meade County Judge Executive, dies at 68 *Col Markham, 80, Australian politician, New South Wales MLA (1988–2003).Popular MP Colin Markham passes away *Dragoljub Ojdanić, 79, Serbian military officer and convicted war criminal, Chief of the General Staff (1998–2000) and Minister of Defence of Yugoslavia (2000).Preminuo Dragoljub Ojdanić – general armije u penziji *Mike Sexton, 72, American Hall of Fame poker player and commentator, prostate cancer.Poker player, commentator Mike Sexton dies at 72 *Takashi Sugimura, 94, Japanese biochemist, member (since 1982) and President of Japan Academy (since 2013), heart failure.国立がんセンター名誉総長の杉村隆氏死去 *Dickson Wamwiri, 35, Kenyan Olympic taekwondo practitioner (2008), cardiac arrest.Decorated Kenyan taekwondo star collapses and dies in Nairobi *Bruce Williamson, 49, American singer (The Temptations), COVID-19.Former Temptations Lead Bruce Williamson Dead at 49 From Coronavirus ===7=== *Berni Alder, 94, German-born American physicist, member of the American Academy of Arts and Sciences (since 2008), National Medal of Science winner (2001).Berni Alder *Abdul Qadir Bajamal, 74, Yemeni politician, Minister of Foreign Affairs (1998–2001) and Prime Minister (2001–2007), problems caused by multiple strokes.من هو عبدالقادر باجمال رئيس الوزراء اليمني الذي غيبه الموت اليوم الاثنين؟ *Chen Dingchang, 83, Chinese aerospace engineer, member of the Chinese Academy of Sciences (since 2009).导弹专家陈定昌院士去世 他研制了中国首部激光雷达 *Abdul Malik Fadjar, 81, Indonesian politician and academic, Minister of Religious Affairs (1998–1999) and Minister of Education (2001–2004).Abdul Malik Fadjar, Menteri Pendidikan Kabinet Gotong Royong Wafat *Forrest Fenn, 90, American art dealer and autobiographer, creator of the Fenn treasure hunt.Forrest Fenn, Art Dealer Who Enticed Thousands to Hunt for Hidden Treasure, Dies at 90 *Gao Wenbin, 99, Chinese historian, translator and jurist, last survivor of the Tokyo Trial.Tokyo Trial veteran dies at the age of 99 *Aurelio Iragorri Hormaza, 83, Colombian politician, Governor of Cauca (1975–1976), member of the Chamber of Representatives (1981–1982) and Senator (1991–2014), COVID-19.Falleció expresidente del Congreso Aurelio Iragorri Hormaza *Sergey Koltakov, 64, Russian actor (Mirror for a Hero, New Adventures of a Yankee in King Arthur's Court, The Life of Klim Samgin).Умер актер Сергей Колтаков *Tim Mulherin, 63, Australian politician, Queensland MP (1995–2015).Queensland's former deputy opposition leader Tim Mulherin dies aged 63 *Narendra Kumar Swain, 80, Indian politician, MP (2015–2020).Former MP Narendra Swain passes away *Xavier Ortiz, 48, Mexican actor (Journey from the Fall, Un gancho al corazón), pop singer (Garibaldi) and television host, suicide.Fallece Xavier Ortiz, exintegrante del grupo Garibaldi *Luba Perchyshyn, 96, American folk artist and businesswoman.Luba Perchyshyn (Procai) *Patrick Sweeney, 81, American politician, member of the Ohio House of Representatives (1967–1997) and Senate (1997–1998).Longtime state representative Patrick Sweeney dies at 81 *Patricia Thiel, 67, American chemist and materials scientist, member of the American Academy of Arts and Sciences (since 2019).In Memory: Distinguished Professor Pat Thiel ===8=== *Gene Budig, 81, American academic and baseball executive, Chancellor of the University of Kansas (1980–1994), President of West Virginia University (1977–1981) and the American League (1994–1999), liver disease.Former American League president Gene Budig dies at age 81 *Joseph Chennoth, 76, Indian Syro Malabar Catholic prelate, Archbishop of Milevum (since 1999) and Apostolic Nuncio to Japan (since 2011).Archbishop Joseph Chennoth passes away *Simeon Coxe, 82, American electronic rock musician (Silver Apples), pulmonary fibrosis.Silver Apples’ Simeon Coxe Dead at 82 *Sir Ronald Harwood, 85, South African-born British screenwriter (The Pianist, The Dresser, The Diving Bell and the Butterfly), Oscar winner (2003).Sir Ronald Harwood, playwright and screenwriter noted for The Dresser and The Pianist – obituary *Robert L. Lynn, 88, American poet and educator, President of Louisiana College (1975–1997).Former LC President Robert Lynn passes away *Jim Owens, 86, American baseball player (Philadelphia Phillies, Cincinnati Reds, Houston Colt .45s/Astros).Jim Owens Stats *Claude Peretti, 78, French footballer (Monaco, Ajaccio).Claude Peretti, une ancienne gloire de l'AC Aiacciu, nous a quittés *Jaya Prakash Reddy, 74, Indian actor (Samarasimha Reddy, Jayam Manadera, Chennakesava Reddy), cardiac arrest.Telugu actor Jaya Prakash Reddy passes away at 74 *Alfred Riedl, 70, Austrian footballer (Standard Liège, national team) and manager (Vietnam national team), cancer.Ex-ÖFB-Teamchef Alfred Riedl im Alter von 70 Jahren verstorben *Vexi Salmi, 77, Finnish songwriter (\"Huilumies\", \"Katson sineen taivaan\", \"Kung Fu Fighting\").Folkkära sångtextförfattaren Vexi Salmi är död *Tony Tanner, 87, British actor (Strictly for the Birds, Stop the World – I Want to Get Off), theatre director (Joseph and the Amazing Technicolor Dreamcoat) and choreographer.Tony Tanner, Tony-Nominated Director and Choreographer, Dies at Age 87 *Benedict To Varpin, 84, Papua New Guinean Catholic prelate, Archbishop of Madang (1987–2001).Archbishop Benedict To Varpin ===9=== *, 76, Brazilian footballer (Clube do Remo, Fluminense, Sport Club do Recife).Ídolo de Fluminense e Remo, ex-zagueiro Assis morre aos 76 anos *Ronald Bell, 68, American saxophonist (Kool & the Gang) and singer-songwriter (\"Ladies' Night\", \"Celebration\").Kool & the Gang’s Ronald ‘Khalis’ Bell Dies at 68 *George Bizos, 92, Greek-born South African human rights lawyer (Rivonia Trial, Nelson Mandela) and anti-apartheid activist.Human rights advocate George Bizos has died *Cini Boeri, 96, Italian architect and furniture designer (Knoll, Artemide, Arflex).Morta a Milano Cini Boeri, architetta, designer e staffetta partigiana *Henrietta Boggs, 102, American-Costa Rican writer and socialite, First Lady (1948–1949), subject of First Lady of the Revolution, COVID-19.Murió la exprimera dama Henrietta Boggs *Arnulfo Fuentebella, 74, Filipino politician, member (1992–2001, 2004–2013, 2016–2019) and Speaker (2000–2001) of the House of Representatives, heart failure.Ex-House Speaker Fuentebella passes away *Chhetan Gurung, 41, Nepalese movie director (Damaru Ko Dandibiyo) and screenwriter (November Rain, Classic), liver disease.Film director Chhetan Gurung no more *Shere Hite, 77, American-born German feminist and sex educator, problems caused by Alzheimer's and Parkinson's disease.'She began the real sexual revolution for women': Shere Hite dies aged 77 *Stevie Lee, 54, American professional wrestler and actor (The Babe, Oz the Great and Powerful, Jackass).Pro wrestler Stevie Lee, known as Puppet the Psycho Dwarf, has passed away at age 54 *Amos Luzzatto, 92, Italian writer and essayist, President of the Union of Italian Jewish Communities (1998–2006).Morto Amos Luzzatto, ex presidente della Comunità ebraica italiana *Alan Minter, 69, British boxer, Olympic bronze medalist (1972) and WBA champion (1980), cancer.Former undisputed middleweight champion Alan Minter dies of cancer aged 69 *Sid McCray, American punk rock singer (Bad Brains).Sid McCray, Original Bad Brains Singer, Has Died *Jakob Oetama, 88, Indonesian journalist (Kompas) and media businessman (Kompas Gramedia Group).Tokoh Pers Jakob Oetama Meninggal Dunia *Tadeusz Szelachowski, 88, Polish politician and physician, Minister of Health and Social Security (1980–1985), Vice-Chairman of Council of State and member of Sejm (1985–1989).Pożegnaliśmy Śp. Tadeusza Szelachowskiego, absolwenta I rocznika AMB, byłego Ministra Zdrowia *Edgard Tupët-Thomé, 100, French Free France Resistance fighter.Décès d’un des quatre derniers Compagnons de la Libération *Tony Villars, 68, Welsh footballer (Cardiff City, Newport County, national team).Former Newport County and Wales winger Tony Villars dies aged 68 ===10=== *Vadivel Balaji, 45, Indian actor (Yaaruda Mahesh, Kolamavu Kokila) and television personality, problems caused by a stroke.Tamil comedian Vadivel Balaji dies at 45 in Chennai *Gerald Blidstein, 82, Israeli academic, member of the Israel Academy of Sciences and Humanities (since 2007).ברוך דיין האמת: פרופ' יעקב בלידשטיין הלך לעולמו *Mark Bomani, 88, Tanzanian politician and lawyer, Attorney General (1965–1976).Retired Judge Mark Bomani dies at the age of 88 *Terry Buckle, 80, Canadian Anglican prelate, Archbishop of Yukon (1995–2010), cancer. *Gienek Loska, 45, Belarusian-born Polish singer-songwriter and guitarist, problems caused by a stroke.Nie żyje finalista \"X Factor\". Gienek Loska miał 45 lat *William L. Ogg, 83, American politician, member of the Ohio House of Representatives (1995–2002).Former Rep. Ogg dies at 83 *Florence Pendleton, 94, American politician and activist, U.S. Shadow Senator from the District of Columbia (1991–2007).Florence Pendleton, pioneering DC shadow senator and statehood champion, dies at 94 *Pamela L. Reeves, 66, American politician and lawyer, Judge of the U.S. District Court for the Eastern Tennessee (since 2014), cancer.East Tennessee's first female chief judge, Pamela Reeves, has died *Franco Maria Ricci, 82, Italian art publisher and magazine editor, heart attack.È morto Franco Maria Ricci *Dame Diana Rigg, 82, English actress (The Avengers, On Her Majesty's Secret Service, Game of Thrones), Tony (1994) and Emmy (1997) winner, lung cancer.Actress Dame Diana Rigg dies aged 82 *Barry Scott, 65, American actor (Ernest Goes to Jail, The Expert) and voice-over artist (Impact Wrestling).The wrestling world remembers Barry Scott *Srećko Štiglić, 77, Croatian Olympic athlete (1972).Srećko Štiglić *Leen van der Waal, 91, Dutch engineer and politician, MEP (1984–1997).Oud EP-lid Leen van der Waal (SGP) overleden *Narong Wongwan, 94, Thai businessman and politician, Minister of Agriculture and Cooperatives (1983–1986), Leader of the Opposition (1988–1990) and Deputy Prime Minister (1992), problems caused by dementia.สิ้นแล้ว \"ณรงค์ วงศ์วรรณ\" ตำนานว่าที่นายกฯ ก่อนพฤษภาทมิฬ นอนป่วยติดเตียงกว่า 8 ปี ===11=== *Agnivesh, 80, Indian politician and social activist, Haryana MLA (1977–1979) and founder of the Bandhua Mukti Morcha, multiple organ failure.Arya Samaj leader Swami Agnivesh dies after suffering multi-organ failure *Sonny Allen, 84, American basketball coach (Old Dominion Monarchs, Nevada Wolf Pack, Sacramento Monarchs), problems caused by Parkinson's disease.Sonny Allen, Who Built the Foundation for ODU Basketball and Was an Offensive Innovator, Has Passed Away *Stéphane Caillat, 92, French conductor and composer.Le chef de choeur Stéphane Caillat est mort *Roger Carel, 93, French actor (Meeting in Paris, Le Plumard en folie, The Umbrella Coup).Mort de l’acteur, légende du doublage français, Roger Carel *Anthony Cekada, 69, American Roman Catholic priest and Sedevacantist, problems caused by a stroke.Fr. Anthony Cekada, RIP *Martin J. Dunn, 64, American politician, Mayor of Holyoke, Massachusetts (1987–1991) and member of the Massachusetts Senate (1991–1993).Former Holyoke Mayor and state Sen. Martin J. Dunn dead at 64 *László Gálos, 87, Hungarian Olympic volleyball player (1964).László Gálos *Bill Heller, 85, American politician, member of the Florida House of Representatives (2007–2011).Bill Heller, former USF St. Pete leader and lawmaker, dies *Toots Hibbert, 77, Jamaican reggae singer-songwriter (\"54-46 That's My Number\", \"Do the Reggay\", \"Pressure Drop\") and guitarist (Toots and the Maytals), COVID-19.Legendary Reggae Singer Toots Hibbert, Frontman of the Maytals, Dies at 77 *Reggie Johnson, 79, American jazz double-bassist.Der Jazz-Gigant, der Bern beehrte *Henryk Łapiński, 87, Polish actor (How I Unleashed World War II, Man of Marble, A Short Film About Killing).Nie żyje Henryk Łapiński. Aktor od pewnego czasu przebywał w szpitalu *Grant Larson, 87, American politician, member of the Wyoming Senate (1995–2011).Statesman, bedrock community member Sen. Larson remembered *Christian Manen, 86, French composer.Décès du compositeur et pédagogue Christian Manen *H. Jay Melosh, 73, American geophysicist, member of the National Academy of Sciences (since 2003).H. Jay Melosh *Christian Poncelet, 92, French politician, Senator (1977–2014), MEP (1979–1980) and President of the Senate (1998–2008).Christian Poncelet, ancien président du Sénat et maire de Remiremont est mort à 92 ans *Nadhim Shaker, 61, Iraqi footballer (Al-Tayaran, national team) and manager (Erbil), COVID-19.وفاة ناظم شاكر نجم الكرة العراقية السابق *Lois Stratton, 93, American politician, member of the Washington House of Representatives (1980–1985) and Washington State Senate (1985–1993).'Kindness, respect and compassion': Longtime state legislator Lois Stratton dies at 93 *Richard William Timm, 97, American Roman Catholic priest, missionary and educator, co-founder of Notre Dame College, Dhaka.Father Richard William Timm passes away ===12=== *Navid Afkari, 26–27, Iranian wrestler, political activist (2018 Iranian protests) and convicted murderer, executed by hanging.Iranian champion wrestler Navid Afkari executed despite global outcry *Joaquín Carbonell, 73, Spanish singer-songwriter and poet, COVID-19.Fallece por coronavirus Joaquín Carbonell, figura clave de la cultura popular aragonesa *Carlos Casamiquela, 72, Argentine agricultural engineer and politician, President of INTA (2009–2013) and Minister of Agriculture (2013–2015), COVID-19.Murió Carlos Casamiquela, ex ministro de Agricultura de la Nación, tenía coronavirus *Aline Chrétien, 84, Canadian socialite, Spouse of the Prime Minister (1993–2003), problems caused by Alzheimer's disease.Aline Chrétien, wife of former PM Jean Chrétien, has died at age 84 *Jean Cluzel, 96, French politician, Senator (1971–1998).Figure politique de l'Allier, Jean Cluzel est décédé (death announced on this date) *Sir Terence Conran, 88, English fashion designer (Habitat) and restaurateur (D&D; London).Sir Terence Conran: 'Visionary' designer dies at 88 *Bob Crowell, 74, American politician, Mayor of Carson City, Nevada (since 2009).Carson City Mayor Bob Crowell passes away at 74 *John Fahey, 75, New Zealand-born Australian politician, Premier of New South Wales (1992–1995), Minister for Finance (1996–2001), MP (1996–2001) and President of WADA (2008–2013), leukaemia.\"ACU mourns the death of Chancellor John Fahey\" *Florence Howe, 91, American feminist writer and political activist, founder of The Feminist Press, problems caused by Parkinson's disease.Florence Howe, 'Mother of Women’s Studies,' passes away at 91 *Barbara Jefford, 90, British actress (Ulysses, Philomena, The Ninth Gate).Barbara Jefford: Leading classical actress dies aged 90 *Dominique Kalifa, 63, French historian, educator and columnist (Libération), suicide.L'historien Dominique Kalifa, fidèle contributeur de «Libération», est mort *Azmi Mohamed Megahed, 70, Egyptian Olympic volleyball player (1976), COVID-19.Former Zamalek volleyball star Azmy Megahed passes away of COVID-19 *Annette Jahns, 62, German opera singer and director (Semperoper).Dresdner Opernsängerin Annette Jahns ist tot *Jack Roland Murphy, 83, American jewel thief and murderer, heart and organ failure.Jack (‘Murph the Surf’) Murphy, Heist Mastermind, Dies at 83 *Mark Newman, 71, American baseball coach (Old Dominion Monarchs) and executive (New York Yankees).Mark Newman, who helped spearhead Yankees dynasty, dead at 71 *Linus Okok Okwach, 67, Kenyan Roman Catholic prelate, Bishop of Homa Bay (1993–2002), problems caused by a fall.Retired Homa Bay Catholic Diocese Bishop Linus Okok Okwach dies at 68 *Atilio Pozzobón, 82, Argentine actor (Son of the Bride, Lost Embrace, Ay Juancito).Falleció el actor Atilio Pozzobón *Yousef Saanei, 82, Iranian Twelver Shi'a cleric and politician, member of the Guardian Council (1980–1983) and Attorney-General (1981–1989), kidney failure caused by diabetes.آیت الله یوسف صانعی، مرجع منتقد حکومت ایران درگذشت ===13=== *Sabit Brokaj, 78, Albanian physician and politician, Minister of Health (1991) and Defence (1997–1998), heart attack.Renown Doctor Passes Away, President Condoles His Family *Mario Cafiero, 64, Argentine politician, Deputy (1997–2005), colon cancer.Murió Mario Cafiero, dirigente peronista y tío del Jefe de Gabinete *Antonio Casellati, 92, Italian politician, Mayor of Venice (1987–1990).E' morto l'ex sindaco di Venezia Antonio Casellati *Bernard Debré, 75, French politician and urologist, Mayor of Amboise (1992–2001), Deputy (2012–2017) and Councillor of Paris (since 2008), cancer.Bernard Debré, ancien ministre et député, est mort *John Ferris, 71, American swimmer, Olympic bronze medalist (1968), lung cancer.Passages: Two-Time Olympic Medalist John Ferris Dies at 71 *György Keleti, 74, Hungarian military officer and politician, Minister of Defence (1994–1998) and MP (1992–2010).Elhunyt Keleti György volt honvédelmi miniszter *Paolo Knill, 88, Swiss scientist and educator, founder of the European Graduate School.Paolo Knill *André Lespagnol, 77, French politician, President of the Regional Council of Brittany (2004–2010).André Lespagnol, ancien président de l'université Rennes 2, est décédé *Russ Meekins Jr., 71, American politician, member of the Alaska House of Representatives (1973–1975, 1977–1983). *Raghuvansh Prasad Singh, 74, Indian politician, Minister of Rural Development (2008–2009) and MP (1996–2014), COVID-19.Former Union Minister Raghuvansh Prasad Singh passes away in Delhi *Severo Bueno de Sitjar de Togores, 53, Spanish politician and state lawyer (2017 Catalan independence referendum), problems caused by ALS.Muere el abogado del Estado jefe en Catalunya Severo Bueno ===14=== *Sei Ashina, 36, Japanese actress (Kamen Rider Hibiki, Silk, Kamui Gaiden), suicide by drug overdose.36岁日本女演员芦名星家中去世，曾出演《血色星期一》 *Robert Chabbal, 93, French physician, Director General of the French National Centre for Scientific Research (1976–1979).Disparition de Robert Chabbal, physicien et organisateur de la recherche scientifique *Petko Christov, 69, Bulgarian Roman Catholic prelate, Bishop of Nicopolis (since 1994).Bishop Petko Jordanov Christov, O.F.M. Conv. † *François Debré, 78, French screenwriter and journalist (Le Monde, L'Obs, Le Point).François Debré est mort *Council Julian Dunbar Jr., 98, American politician and businessman, member of the South Carolina House of Representatives (1971–1972).Council Julian Dunbar *Jeff Dunne, 64, Australian footballer (St Kilda), heart attack.Vale Jeff Dunne *Ralph Gants, 66, American politician and lawyer, Associate Justice (2009–2014) and Chief Justice (since 2014) of the Massachusetts Supreme Judicial Court, problems caused by a heart attack.Ralph Gants, Chief Justice of Massachusetts' Top Court, Dies *Bill Gates Sr., 94, American lawyer and philanthropist, father of Bill Gates, problems caused by Alzheimer's disease.Remembering my father *Ann Getty, 79, American socialite, publisher and art dealer, heart attack.Ann Getty, Publisher and Bicoastal Arts Patron, Is Dead at 79 *Al Kasha, 83, American songwriter (\"Operation Heartbreak\", \"The Morning After\". \"We May Never Love Like This Again\"), Oscar winner (1973, 1975).Al Kasha, Oscar-Winning Songwriter of ‘The Morning After,’ Dies at 83 *Enrique Ramón Fajarnés, 91, Spanish lawyer and politician, Mayor of Ibiza (1971–1974), Senator (1982–1986) and Deputy (1986–1993).Muere Enrique Ramon Fajarnés a los 91 años *Daniel Soulage, 78, French politician, Mayor of Monflanquin (1983–2008), Deputy (1993–1997) and Senator (2001–2011).Lot-et-Garonne : Daniel Soulage n’est plus *Anne Stevenson, 87, British-American poet and biographer (Sylvia Plath), Lannan Literary Award winner (2007).Anne Stevenson, 1933–2020 *Herman Th. Verstappen, 95, Dutch geographer, President of the International Geographical Union (1992−1996). ===15=== *Vital Alsar, 87, Spanish-born Mexican sailor and scientist.México.- Muere en México el navegante cántabro Vital Alsar *Faith Alupo, 36, Ugandan politician, MP (since 2018), COVID-19.Ugandan MP dies of COVID-19 as infections rise *Russell A. Anderson, 78, American politician and lawyer, Associate Justice (1998–2006) and Chief Justice (2006–2008) of the Minnesota Supreme Court.Former Minnesota Chief Justice Russell Anderson dies at 78 *Aloysio de Andrade Faria, 99, Brazilian banker, founder of Banco Real.Morre o banqueiro Aloysio de Andrade Faria *Ed Bearss, 97, American military historian (National Park Service) and author.Ed Bearss, Past Chief Historian Of National Park Service, Dies At 97 *Steve Carter, 90, American playwright (Eden, Nevis Mountain Dew, Dame Lorraine).Steve Carter, Playwright in a Black Theater World, Dies at 90 *Sheldon Gomes, 69, Trinidadian cricketer (North Trinidad, East Trinidad, national team). *James \"T\" Jones, 89, American football player (Texas Longhorns) and athletic director (Texas Tech Red Raiders).Longhorn Legend and college athletics icon “T” Jones passes away *Phil Kingsley Jones, 72, Welsh-born New Zealand rugby union coach and player manager (Jonah Lomu).Tributes flow for Phil Kingsley Jones as Jonah Lomu's ex-manager dies *Caroline Kaart, 88, Scottish-born Dutch opera singer and television presenter.Operazangeres Caroline Kaart (88) maakte klassieke muziek weer populair *Momčilo Krajišnik, 75, Bosnian Serb politician, Speaker of the National Assembly (1991–1996) and Serb member of the Presidency of Bosnia and Herzegovina (1996–1998), COVID-19.Momčilo Krajišnik preminuo od posledica koronavirusa *Jan Krenz, 94, Polish composer and conductor.Nie żyje wybitny dyrygent i kompozytor *Paul Méfano, 83, Iraqi-born French composer and conductor.Décès de Paul Méfano, compositeur et fondateur de l'ensemble 2e2m *Nikolay Shmatko, 77, Ukrainian sculptor and painter.Умер украинский скульптор Николай Шматько *Pat Smullen, 43, Irish jockey, pancreatic cancer.Jockey Pat Smullen dies, aged 43 *Peter Starkie, 72, Australian rock guitarist (Skyhooks, Jo Jo Zep & The Falcons), problems caused by a fall.Original Skyhooks Guitarist Peter Starkie Has Died Aged 72 *Moussa Traoré, 83, Malian military officer and politician, President (1968–1991).Mali: l'ancien président Moussa Traoré est mort *Floyd Vrtiska, 93, American politician, member of the Nebraska Legislature (1993–2005).Former state senator Vrtiska leaves a legacy of public service *Wang Zhiliang, 79, Chinese table tennis player, world champion (1963), stroke.世界冠军王志良因病去世 中国首个世乒赛男双冠军 *W. Edward Wood, 79, American journalist (The Providence Journal) and environmentalist, Director of the Rhode Island Department of Environmental Management (1977–1982), heart attack. *Brien S. Wygle, 96, American aviator and test pilot (Boeing).Brien Wygle, an unassuming icon among Boeing test pilots, led an intrepid aviator life ===16=== *Ahmed Ben Salah, 94, Tunisian politician and trade unionist, Minister of Finance (1961–1969).Décès d'Ahmed Ben Salah *Stanley Crouch, 74, American music critic, novelist and poet.Stanley Crouch, Towering Jazz Critic, Dead At 74 *William Henry Danforth, 94, American physician and academic administrator, Chancellor of Washington University in St. Louis (1971–1995), problems caused by a fall.William Danforth dies at 94; grew Washington University into world-class institution *Núria Gispert i Feliu, 84, Spanish politician, Catholic activist and social worker, City Councillor of Barcelona (1979–1995), colon cancer.Muere la maestra y política catalana Núria Gispert Feliu a los 84 años *Alien Huang, 36, Taiwanese actor (Already Famous, Din Tao: Leader of the Parade), television presenter (100% Entertainment) and singer, hemorrhage caused by a fall.Taiwanese celeb Alien Huang aka Xiao Gui dies at 36 *Enrique Irazoqui, 76, Spanish actor (The Gospel According to St. Matthew) and political activist.Muere Enrique Irazoqui, el Jesucristo de Pasolini en ‘El evangelio según San Mateo’ *Jack Kelley, 93, American Hall of Fame ice hockey coach (New England Whalers) and team executive (Pittsburgh Penguins).The Passing of Legendary Hockey Coach Jack Kelley *Maxim Martsinkevich, 36, Russian Neo-Nazi political activist, leader of Format18 and founder of Occupy Pedophilia, suicide.Russian nationalist ‘Tesak’ found dead in prison cell after apparent suicide *Nick Mourouzis, 83, American football player (Miami RedHawks) and coach (DePauw Tigers), problems caused by COVID-19.Nick Mourouzis, DePauw football coaching legend, dies at 83 *Apolonio Lombardo Rangel, 86, Panamanian footballer (national team), problems caused by Alzheimer's and Parkinson's disease.Fallece ex seleccionado nacional Apolonio Lombardo Rangel *Balli Durga Prasad Rao, 64, Indian politician, Andhra Pradesh MLA (1985–1989, 1994–1999, 2009–2014) and MP (since 2019), COVID-19.Tirupati Lok Sabha MP Balli Durga Prasad Rao Garu passes away in Chennai *Roy C, 81, American soul singer-songwriter (\"Impeach the President\") and record producer, liver cancer. *Saefullah, 56, Indonesian politician, Mayor of Central Jakarta (2010–2014) and Regional Secretary of the Jakarta Province (since 2014), sepsis caused by COVID-19.Beberapa Hari Pasca Dirawat Akibat Covid-19, Sekda DKI Tutup Usia *Kapila Vatsyayan, 91, Indian classical art scholar and politician, MP (2006–2012).Kapila Vatsyayan, Indian culture icon, passes away at 91 ===17=== *Hassan Achour, 82, Algerian footballer (CR Belouizdad, national team) and manager (Chéraga).Deces de Hassan Achour: la FAF presente ses condoleances a sa famille et au CRB *Ricardo Ciciliano, 43, Colombian footballer (Deportes Tolima, Millonarios, Juan Aurich), pneumonia caused by COVID-19.Falleció Ricardo Ciciliano tras luchar contra una neumonía *Donald Keith Duncan, 80, Jamaican politician, MP (1976–1983, 2007–2016), COVID-19. *Ashok Gasti, 55, Indian politician, MP (since 2020), COVID-19.BJP's Ashok Gasti, 1st-Time Rajya Sabha Member, Dies Due To COVID-19 *Terry Goodkind, 72, American fantasy writer (The Sword of Truth, The Law of Nines).Terry Goodkind Dead: ‘The Sword of Truth’ Writer Dies at 72 *Robert W. Gore, 83, American engineer and inventor (Gore-Tex), cancer.Gore-Tex technology inventor Robert W. Gore dies at 83 *Winston Groom, 77, American novelist (Forrest Gump, Gump and Co.), heart attack.’Forrest Gump’ author Winston Groom dead at 77 *Reg Harrison, 97, English football player (Derby County, Boston United) and manager (Long Eaton United).'Legend' - Fans pay tribute to Derby County hero Reg Harrison *Harvey Hodder, 77, Canadian politician, Newfoundland and Labrador MHA (1993–2007), cancer.Harvey Hodder, former Speaker and Mount Pearl mayor, dies *Miao Chunting, 101, Chinese politician, Guizhou CPPCC Committee Chairman (1959–1967, 1980–1993).贵州省政协原主席苗春亭逝世 *Luboš Perek, 101, Czech astronomer, General-Secretary of the International Astronomical Union (1967–1970) and member of the Czech Academy of Sciences (since 1992).Great astronomer Luboš Perek dies at 101 *Joe Ruklick, 82, American basketball player (Philadelphia Warriors).Former Northwestern All-American Joe Ruklick, who assisted Wilt Chamberlain’s basket that gave him 100 points in an NBA game, dies at 82 *Pir Hameeduddin Sialvi, 84, Pakistani politician and religious official, Senator (1988–1994).Pir Hameeduddin Sialvi passes away *Liladhar Vaghela, 85, Indian politician, Gujarat MLA (1975–1980, 1985–1990, 1990–1995, 1998–2002, 2007–2014) and MP (2014–2019), acute respiratory failure.Senior BJP leader, former minister Liladhar Vaghela dies *Larry Wilson, 82, American Hall of Fame football player (St. Louis Cardinals), coach and executive, cancer.Cardinals Hall Of Famer Larry Wilson Passes Away ===18=== *Mohamed Atwi, 32, Lebanese footballer (Ansar, Akhaa Ahli Aley, national team), shot.Trágico desenlace: el futbolista Mohamed Atwi muere por un disparo durante un funeral *Talat Basari, 97, Iranian Bahai poet, feminist, academic, and writer.به یاد طلعت بصاری، استاد دانشگاه و پژوهشگر بهایی *Stephen F. Cohen, 81, American historian and editor (The Nation).Stephen F. Cohen, Influential Historian of Russia, Dies at 81 *Georgia Dobbins, 78, American singer (The Marvelettes) and songwriter (\"Please Mr. Postman\").Georgia Dobbins Davis, Unsung Motown Hero Who Co-Wrote ‘Please Mr. Postman,’ Dead at 78 *Ruth Bader Ginsburg, 87, American politician and lawyer, Associate Justice of the Supreme Court of the United States (since 1993), problems caused by pancreatic cancer.Ruth Bader Ginsburg Dies: Supreme Court Justice Was 87 *Pamela Hutchinson, 61, American R&B; singer (The Emotions).The Emotions' Pamela Hutchinson 'Best of My Love' Singer ... Dead at 61 *Joachim Kunert, 90, German movie director (Tatort Berlin, The Second Track, The Adventures of Werner Holt) and screenwriter.Joachim Kunert ist tot *Sam McBratney, 77, Northern Irish writer (Guess How Much I Love You).Guess How Much I Love You author Sam McBratney dies aged 77 *Anacleto Oliveira, 74, Portuguese Roman Catholic prelate, Bishop of Viana do Castelo (since 2010), car crash.Bishop Anacleto Cordeiro Gonçalves de Oliveira *Shah Ahmad Shafi, 104, Bangladeshi Islamic scholar (Hefazat-e-Islam Bangladesh), Rector of the Al-Jamiatul Ahlia Darul Ulum Moinul Islam (since 1986), heart attack caused by diabetes. *Valeriy Shvedyuk, 74, Ukrainian footballer and manager (SC Tavriya Simferopol).Ушел из жизни Валерий Шведюк… *Mike Tilleman, 76, American football player (New Orleans Saints, Atlanta Falcons, Houston Oilers), problems caused by heart disease.Area legend Mike Tilleman passes away at age 76 *John Turner, 91, Canadian politician, MP (1962–1976, 1984–1993), Minister of Finance (1972–1975) and Prime Minister (1984).John Turner, PM and Liberal leader who battled free trade with U.S., dead at 91 ===19=== *David Cook, 76, Northern Ireland politician and activist, member of the Belfast City Council (1973–1985), Mayor of Belfast (1978–1979) and MPA (1982–1986), co-founder of the Alliance Party, COVID-19.Tributes paid to founding member of Alliance Party and former Lord Mayor of Belfast David Cook following death from Covid-19 *Roza Vidyadhar Deshpande, 91, Indian politician, MP (1971–1977).ज्येष्ठ साम्यवादी नेत्या कॉ. रोझा देशपांडे यांचे निधन *J. Delano Ellis, 75, American Pentecostal clergyman.Beloved Cleveland Bishop J. Delano Ellis dies at age of 75 *Károly Fatér, 80, Hungarian footballer (national team), Olympic champion (1968).Károly Fatér *Yutakayama Hiromitsu, 72, Japanese sumo wrestler (JSA), founder of Minato stable, pancreatic cancer.元小結豊山の先代湊親方が死去72歳、膵臓がん *Donald M. Kendall, 99, American businessman and political advisor, CEO of PepsiCo (1971–1986).Donald Kendall, Who Served Pepsi to Khrushchev, Dies at 99 *Lee Kerslake, 73, English rock singer-songwriter and drummer (Uriah Heep, The Gods, Toe Fat), prostate cancer.Ozzy Osbourne and Uriah Heep drummer Lee Kerslake dies aged 73 *Al Langlois, 85, Canadian ice hockey player (Montreal Canadiens, New York Rangers, Detroit Red Wings).Langlois dies at 85, was three-time Stanley Cup champion with Canadiens *Dame Georgina Mace, 67, British ecologist and conservation scientist.Tribute to Professor Dame Georgina Mace CBE *Darvin Moon, 56, American poker player and businessman, problems caused by surgery.Un fulmine a ciel sereno: il ‘boscaiolo’ Darvin Moon si è spento a 56 anni *Dick Nemelka, 76, American basketball player (BYU Cougars, Utah Stars), cancer.Dick Nemelka, BYU All-American, loses battle with cancer at 76 *Irdinansyah Tarmizi, 63, Indonesian politician, Deputy (2014–2015) and Regent of Tanah Datar (since 2016), colon cancer.Bupati Tanah Datar Irdinansyah Tarmizi Meninggal Dunia ===20=== *Meron Benvenisti, 86, Israeli political scientist and politician, Deputy Mayor of Jerusalem (1971–1978), renal failure.Former deputy mayor of Jerusalem Meron Benvenisti dies *Ken Blaiklock, 92, British Antarctic explorer.Blaiklock O.B.E *Michael Chapman, 84, American cinematographer (Taxi Driver, Raging Bull, Space Jam) and movie director, congestive heart failure.Michael Chapman, Cinematographer on 'Taxi Driver' and 'Raging Bull,' Dies at 84 *Robert Graetz, 92, American clergyman and civil rights activist (Montgomery bus boycott), problems caused by Parkinson's disease.Robert Graetz, minister who helped organize Montgomery Bus Boycott, dies at 92 *Shehu Idris, 84, Nigerian royal, Emir of Zazzau (since 1975). *Sir Malcolm Innes of Edingight, 82, Scottish herald, co-founder of the Heraldry Society of Scotland, Lord Lyon King of Arms of Scotland (1981–2001), cancer.Sir Malcolm Rognvald Innes of Edingight *Keith Jobling, 86, English footballer (Grimsby Town) and manager (Boston United).Grimsby Town legend and former captain Keith Jobling passes away *Knut Kloster, 91, Norwegian businessman, co-founder of Norwegian Cruise Line.Skipsreder Knut Utstein Kloster er død *Blanche M. Manning, 85, American politician and laywer, Judge of the U.S. District Court for Northern Illinois (since 1994).Blanche M. Manning *Rosa María Ortiz Ríos, 65, Peruvian lawyer and politician, Minister of Energy and Mines (2015–2016).Falleció Rosa María Ortiz, exministra de Energía y Minas *Ephrem M'Bom, 66, Cameroonian footballer (Canon Yaoundé, national team). *Garland F. Pinholster, 92, American college basketball player (North Georgia), coach (Oglethorpe) and politician, member of the Georgia House of Representatives (1990–2002).Georgia basketball legend, former state legislator dies at 92 *Mary Pruitt, 86, American politician, member of the Tennessee House of Representatives (1985–2013), blood clot caused by a fall. *Rossana Rossanda, 96, Italian politician and journalist, Deputy (1963–1968) and co-founder of Il manifesto.Addio Rossana Rossanda *Moshe Sharoni, 91, Romanian-born Israeli politician, member of Knesset (2006–2009).Knesset Member Moshe Sharoni *Lyon Gardiner Tyler Jr., 90, American lawyer and historian, grandson of President John Tyler, problems caused by Alzheimer's disease.Lyon Gardiner Tyler Jr., Grandson of the 10th President, Dies at 95 *Gerardo Vera, 73, Spanish costume designer (El Amor brujo), movie director (La Celestina, Second Skin) and actor, Goya Award winner (1986), COVID-19.Muere Gerardo Vera a los 73 años ===21=== *Jaime Alves, 55, Portuguese footballer (Boavista, Vitória de Guimarães, national team).Morreu Jaime Alves, antigo jogador do Boavista *Arthur Ashkin, 98, American physicist (optical tweezers), Nobel Prize winner (2018).In Memoriam: Arthur Ashkin, 1922-2020 *Hamdi Benani, 77, Algerian singer and violinist, COVID-19.Hamdi Benani est mort *Virginio Bettini, 78, Italian politician, MEP (1989–1994).Virginio Bettini morto, addio al pionere dell'ecologia *Giuseppe Caldarola, 74, Italian journalist and politician, Deputy (2001–2008).È morto il giornalista Giuseppe Caldarola *Ron Cobb, 83, American-Australian prop and set designer (Star Wars, Back to the Future, Conan the Barbarian), Lewy body dementia. *Tommy DeVito, 92, American Hall of Fame musician and singer (The Four Seasons), COVID-19.Tommy DeVito, original Four Seasons member, dies of COVID-19 at 92 *Roy Head, 79, American rockabilly singer-songwriter (\"Treat Her Right\"), heart attack. Montgomery County Loses An Icon - Roy Head Passes *Lars-Åke Lagrell, 80, Swedish sports personality and politician, President of the Swedish Football Association (1991–2012) and Governor of Kronoberg County (2002–2006).Lars Åke Lagrell är död *Amos Lin, 87, Israeli Olympic basketball player (1952).כדורסלן העבר עמוס לין הלך לעולמו *Michael Lonsdale, 89, French actor (Moonraker, The Day of the Jackal, The Remains of the Day) and writer.Michael Lonsdale, who played James Bond villain in Moonraker, dies aged 89 *Gilbert Meyer, 78, French politician, Deputy (1993–2007) and Mayor of Colmar (1995–2020), stroke caused by glioblastoma.Gilbert Meyer, ancien maire de Colmar, est décédé *Claude Moisy, 93, French journalist and writer, President of the Agence France-Presse (1990–1993).Décès de Claude Moisy, ancien PDG de l'AFP *Wan Mokhtar, 88, Malaysian politician, Menteri Besar of Terengganu (1974–1999) and Terengganu State MLA (1974–1999), problems caused by heart disease.Former Terengganu MB Wan Mokthar Ahmad, 88, dies of heart complications *Jacques-Louis Monod, 93, French composer and pianist.Jacques-Louis Monod, Modernist Composer With a Lyrical Touch, Dies at 93 *Harold Moss, 90, American politician, Mayor of Tacoma, Washington (1994–1996).Harold Moss, Tacoma’s first Black mayor and a city icon, has died *Bob Nevin, 82, Canadian ice hockey player (Toronto Maple Leafs, New York Rangers, Edmonton Oilers).Former NHL star Nevin passes away *Ang Rita, 72, Nepalese mountaineer, problems caused by a stroke. *Robert Freeman Smith, 89, American politician, member of the U.S. House of Representatives from Oregon's 2nd congressional district (1983–1995, 1997–1999).Former Oregon Congressman Bob Smith dies at 89 *Jackie Stallone, 98, American astrologer, mother of Sylvester Stallone.Sylvester Stallone's Mother, Jackie Stallone, Dead at 98 *Ira Sullivan, 89, American jazz trumpeter and composer, pancreatic cancer.Chicago jazz great Ira Sullivan dies at 89 *Sune Wehlin, 97, Swedish Olympic athlete (1948).Sune Wehlin ===22=== *Bob Atkins, 74, American football player (Houston Oilers, St. Louis Cardinals).Former Oilers defensive back Bob Atkins dies at 74 *Neil Brannon, 79, American politician, member of the Oklahoma House of Representatives (2002–2010), heart attack.Neil Brannon *Gerson King Combo, 76, Brazilian soul funk singer-songwriter, problems caused by diabetes.Gerson King Combo, cantor pioneiro do soul e funk, morre aos 76 anos *Mary Gergen, 81, American social psychologist and feminist writer.Sad News to Share.. *Michael Gwisdek, 78, German actor (Good Bye, Lenin!) and movie director (Treffen in Travers, The Big Mambo).Schauspieler Michael Gwisdek gestorben *Sergey Khoruzhiy, 78, Russian theoretical physicist, philosopher and translator (Ulysses), member of the Russian Academy of Natural Sciences (since 1993).Умер крупнейший ислледователь исихазма, физик, математик, философ и переводчик Сергей Хоружий *Frie Leysen, 70, Belgian festival director.Culture booster Frie Leysen passed away – De Standaard *Li Dongying, 99, Chinese metallurgist, member of the Chinese Academy of Engineering (since 1995).中国稀有金属工业创始人之一李东英院士逝世，享年100岁 *Elias Maluco, 54, Brazilian convicted murderer (Tim Lopes), suicide by hanging.Traficante Elias Maluco, encontrado morto na cela, tinha 42 advogados *Dan Olweus, 89, Swedish-Norwegian psychologist.Death of Dan Olweus *Dudley Riggs, 88, American improvisational comedian (Brave New Workshop).Godfather of Twin Cities comedy scene Dudley Riggs dies at 88 *Road Warrior Animal, 60, American Hall of Fame professional wrestler (NWA, WCW, WWF).Road Warrior Animal passes away *Adamu Daramani Sakande, 58, Ghanaian politician, MP (2009–2013). *Jacques Senard, 100, French politician, Ambassador to the Netherlands (1972–1976) and Egypt (1976–1979).Jacques Senard *Agne Simonsson, 84, Swedish footballer (Örgryte, national team) and manager (Iraklis), pneumonia.Fallece Simonsson, delantero sueco que jugó en la Real en los 60 cedido por el Madrid *Andre Vltchek, 57, Russian-born American political analyst, journalist (Der Spiegel, The Guardian) and filmmaker.Turkey probes death of American journalist Andre Vltchek ===23=== *Vakha Agaev, 67, Russian politician, Deputy (since 2011), COVID-19.Дкпутат Госдумы от КПРФ Ваха Агаев умер от коронавируса *Suresh Angadi, 65, Indian politician, MP (since 2004) and Minister of State for Railways (since 2019), COVID-19.MoS Railways Suresh Angadi becomes first Union minister to die of coronavirus *Ray Batten, 75, English rugby league player (Leeds Rhinos, national team) and coach (Wakefield Trinity).Leeds Rhinos mourn club legend Ray Batten - outstanding loose-forward who also coached Wakefield Trinity and was director at York *Yvette Alloo, 90, Belgian table tennis player, Paralympic gold medalist (1960, 1964).Décès d'une «véritable icône», Yvette Alloo, première championne paralympique belge *Eric Bransby, 103, American artist.Colorado Springs arts legend, muralist Eric Bransby dies at 103 *François Diederich, 68, Luxembourgian organic chemist, member of the American Academy of Arts and Sciences and National Academy of Sciences, cancer.Chemiker François Diederich verstorben *Sir Harold Evans, 92, British-American journalist (The Sunday Times, The Week, The Guardian), heart failure.Trailblazing journalist Harold Evans passes away *Colette Giudicelli, 76, French politician, Senator (since 2008).La sénatrice et épouse du maire de Menton, Colette Giudicelli, est décédée *Juliette Gréco, 93, French actress (The Sun Also Rises, Belphegor, or Phantom of the Louvre, The Night of the Generals) and singer.Juliette Gréco est morte à l'âge de 93 ans *Guitar Crusher, 89, American blues singer and guitarist.Er war eine Urgewalt – Sidney \"Guitar Crusher\" Selby ist tot *Zlatko Portner, 58, Serbian handball player, Olympic bronze medalist (1988).In Memoriam – Zlatko Portner *Brenda Robertson, 91, Canadian politician, New Brunswick MLA (1967–2004) and Senator (1984–2004).Brenda Robertson, first woman in New Brunswick Legislature, cabinet dies at 91 *Gale Sayers, 77, American Hall of Fame football player (Chicago Bears) and administrator (Southern Illinois, Tennessee State), subject in Brian's Song, problems caused by dementia.Gale Sayers, Bears legend and Hall of Fame RB, dies at 77 *Steve Smith, 68, American Olympic pole vaulter (1972, 1980).Steve Smith *Laurie Smith Camp, 66, American politician and lawyer, Judge of the U.S. District Court for the District of Nebraska (since 2001).Federal Judge serving U.S. District Court of Nebraska dies unexpectedly *Pierre Troisgros, 92, French restaurateur (Frères Troisgros), heart attack.Pierre Troisgros, le légendaire chef roannais est décédé *Iván Verebély, 82, Hungarian actor (The Boy in the Striped Pyjamas).Hosszú betegség után elhunyt Verebély Iván - A 82 éves színész halálhírét családja tudatta *Bobby Wilson, 84, English tennis player.Former Great Britain Davis Cup player Bobby Wilson dies aged 84 ===24=== *Sekhar Basu, 68, Indian nuclear scientist, Director of BARC (2012–2016) and Chairman of the Atomic Energy Commission (2015–2018), Padma Shri recipient (2014), COVID-19.কোভিড আক্রান্ত হয়ে প্রয়াত পরমাণু বিজ্ঞানী শেখর বসু *Robert Bechtle, 88, American painter, Lewy body dementia.Robert Bechtle, Photorealist Painter of the Everyday Middle Class, Dies at 88 *Jaime Blanco García, 76, Spanish politician, President of Cantabria (1990–1991).Fallece el histórico socialista cántabro Jaime Blanco *Capistrano Francisco Heim, 86, American-born Brazilian Roman Catholic prelate, Territorial Prelate of Itaituba (1988–2010).Bishop Capistrano Francisco Heim *Dean Jones, 59, Australian Hall of Fame cricketer (Victoria, national team) and sports commentator (The Sydney Morning Herald), cardiac arrest caused by a stroke.Former Australia cricketer Dean Jones, in Mumbai for IPL commentary, dies of stroke *John Walter Jones, 74, Welsh businessman and politician, Chief Executive of the Welsh Language Board (1993–2004).Former Welsh language chief John Walter Jones dies (death announced on this date) *Max Merritt, 79, New Zealand pop rock singer-songwriter (\"Slipping Away\") and guitarist, problems caused by goodpasture syndrome.Aussie music legend Max Merritt has died from Goodpasture Syndrome, aged 79 *John J. Myers, 79, American Roman Catholic prelate, Bishop of Peoria (1990–2001), Ecclesiastical Superior of Turks and Caicos (2001–2016) and Archbishop of Newark (2001–2016). *Paul Pettit, 88, American baseball player (Pittsburgh Pirates).First $100,000 ‘bonus baby’ in MLB Paul Pettit passes away at 88 *Corine Rottschäfer, 82, Dutch model and beauty pageant contestant, Miss World winner (1959).Eerste Nederlandse Miss World Corine Spier overleden *Vyacheslav Voynarovskii, 74, Russian opera singer and actor (The Garage, To Kill a Dragon, Mother), People's Artist of Russia (1999).Умер оперный певец Вячеслав Войнаровский *Gerhard Weber, 79, German fashion designer and retail businessman (Gerry Weber).Gerry Weber founder Gerhard Weber dies aged 79 *Zhang Xinshi, 86, Chinese plant ecologist, member of the Chinese Academy of Sciences (since 1991).张新时院士逝世 ===25=== *S. P. Balasubrahmanyam, 74, Indian playback singer (\"Didi Tera Devar Deewana\"), actor (Maya, Mayabazar) and record producer, problems caused by COVID-19.Paadum Nila S. P. Balasubrahmanyam no more *Frans Derks, 89, Dutch football referee (Eredivisie) and executive (Dordrecht).Voormalig scheidsrechter Frans Derks (89) overleden *Peter Hampton, 66, English footballer (Leeds United, Stoke City, Burnley).Shock as ex-Stoke City defender Peter Hampton dies on family holiday *Bernard Madrelle, 75, French politician and lawyer, Deputy (1978–2007) and Mayor of Saint-Seurin-de-Cursac (1983–1989) and Blaye (1989–2008), liver cancer.Gironde : Bernard Madrelle, ancien député socialiste et maire de Blaye, est décédé *Viktor Panin, 89, Soviet-Russian physicist, member of the Russian (since 1991) and National Academy of Sciences of Belarus (since 1999).Скончался основатель ИФПМ томского Академгородка Виктор Панин *Goran Paskaljević, 73, Serbian-French movie director (The Dog Who Loved Trains, Special Treatment, How Harry Became a Tree).Umro Goran Paskaljević *Simos Simopoulos, Greek politician and educator, Minister of Infrastructure and Transport (2012) and Rector of National Technical University of Athens (2010–2014).Σίμος Σιμόπουλος: Πέθανε ο πρώην πρύτανης του ΕΜΠ και υπηρεσιακός υπουργός ===26=== *Erik Bartnes, 80, Norwegian politician, County Mayor of Nord-Trøndelag (2003–2007).Erik Bartnes er død *Isher Judge Ahluwalia, 74, Indian economist and researcher (International Food Policy Research Institute), Padma Bhushan recipient (2009), glioblastoma.Noted economist, Padma Bhushan awardee Isher Judge Ahluwalia dies *Jacques Beurlet, 75, Belgian footballer (Standard Liège, national team).Jacky Beurlet est décédé *Dai Yuanben, 92, Chinese physicist, member of the Chinese Academy of Sciences (since 1980) and Chinese People's Political Consultative Conference.理论物理学家戴元本院士逝世，享年92岁 *Moshe Efrati, 86, Israeli choreographer, Israel Prize winner (1996).\"איש פרא מרתק, אינטלקטואל\" — הרקדן משה אפרתי מת בגיל 86 *Abdul Mahdi Hadi, 74, Iraqi footballer (Al-Mina'a, national team) and manager (Al-Mina'a), COVID-19.وفاة الاعب الدولي السابق عبد المهدي هادي بسبب اصابته بكورونا *Jay Johnstone, 74, American baseball player (Los Angeles Dodgers, Chicago Cubs, New York Yankees), commentator and author, World Series champion (1978, 1981), problems caused by dementia and COVID-19. *Conrad Roland, 86, German architect.Vater der Raumnetze Zum Tod von Conrad Roland *Nasser Sebaggala, 72, Ugandan politician, Mayor of Kampala (1998–1999, 2006–2011), twisted intestine. *Mark Stone, American bassist (Van Halen).Original Van Halen Bassist Mark Stone Dies *Leo Sugar, 91, American football player (Chicago/St. Louis Cardinals, Philadelphia Eagles, Detroit Lions).Flint native Leo Sugar, a former Detroit Lion and college All-American, dies at age 91 (death announced on this date) *Denis Tillinac, 73, French political writer and journalist (Valeurs actuelles).Mort de Denis Tillinac, écrivain, éditeur et polémiste qui animait la vie de la droite *Suzanne Tremblay, 83, Canadian politician, MP (1993–2004) and Opposition House Leader (1997), cancer.L’ancienne députée bloquiste Suzanne Tremblay s'éteint *Nicolas Wildhaber, 90, Swiss Olympic swimmer (1948, 1960) and LEN official.Unser Ehrenpräsident Nicolas Wildhaber ist verstorben *Jimmy Winston, 75, English R&B; keyboardist (Small Faces) and actor (Hair, Doctor Who).Room For Ravers: Jimmy Winston ===27=== *Mahbubey Alam, 71, Bangladeshi politician and lawyer, Attorney General (since 2009), COVID-19.Attorney General Mahbubey Alam passes away at 71 *John D. Barrow, 67, English cosmologist, theoretical physicist and mathematician, colon cancer.Morto John Barrow, cosmologo e divulgatore: aveva 67 anni *Kevin Burns, 65, American movie and television producer (Ancient Aliens, Lost in Space, Poseidon), cardiac arrest.Kevin Burns Dies: ‘Ancient Aliens’ Creator, ‘Lost In Space’ Reboot Co-Producer Was 65 *Wolfgang Clement, 80, German politician, Minister-President of North Rhine-Westphalia (1998–2002) and Minister for Economics and Labour (2002–2005), lung cancer.Sozialdemokrat ohne Parteibuch: Wolfgang Clement ist tot *Mario Luis Bautista Maulión, 85, Argentine Roman Catholic prelate, Auxiliary Archbishop Rosario (1988–1995) and Paraná (1995–2003) and Bishop of San Nicolás de los Arroyos (1995–2003).Archdiocese of Paraná *Yuri Orlov, 96, Soviet-Russian human rights activist and nuclear physicist, founder of the Moscow Helsinki Group. *Oleg Osetinsky, 83, Russian screenwriter (The Captivating Star of Happiness, Takeoff) and documentary movie director.Умер сценарист фильма «Звезда пленительного счастья» Олег Осетинский *Susan Ryan, 77, Australian politician, Senator (1975–1987), Minister for Education (1983–1987) and Age Discrimination Commissioner (2011–2016).Susan Ryan, former minister, age discrimination commissioner, dies aged 77 *Jaswant Singh, 82, Indian politician, Minister of Finance (1996, 2002–2004), Defence (2000–2001) and External Affairs (1998–2002), multiple organ failure.Jaswant Singh: End of a long journey for the Army man-turned-parliamentarian *Yūko Takeuchi, 40, Japanese actress (Ring, Miss Sherlock, FlashForward), suspected suicide. *John Waddy, 100, British Army officer, Colonel SAS (1964–1967).Laatste Airborne-officier John Waddy op 100-jarige leeftijd overleden *Tjalling Waterbolk, 96, Dutch archaeologist.Oud-hoogleraar archeologie Harm Tjalling Waterbolk overleden ===28=== *Robert Adair, 96, American physicist, member of the American Academy of Arts and Sciences (since 1997).Robert K. Adair *Rubén Anguiano, 64, Mexican footballer (Atlético Zacatepec, Atlante, national team), COVID-19.Exfutbolista del Atlante muere a causa del Covid-19 *Tennison Cooray, 68, Sri Lankan actor (Re Daniel Dawal Migel, Cheriyo, Somy Boys) and comedian, heart attack.End of an Era : Tennyson Cooray no more *Frédéric Devreese, 91, Dutch-born Belgian movie score composer (Benvenuta, The Cruel Embrace) and conductor.Frédéric Devreese (91) overleden, componist van veel filmmuziek *Juan Carlos Guerra Zunzunegui, 85, Spanish lawyer and politician, Senator (1977–1986) and Deputy (1986–2008).Fallece a los 85 años Juan Carlos Guerra Zunzunegui, exsenador y exdiputado del PP *Peter Jutzeler, 80, Swiss Olympic wrestler (1964, 1968).Peter Jutzeler *Maynard Solomon, 90, American record producer and musical biographer, co-founder of Vanguard Records, Lewy body dementia.Maynard Solomon, Provocative Biographer of Composers, Dies at 90 *Anwara Taimur, 83, Indian politician, Assam MLA (1972–1985, 1991–1996), Chief Minister of Assam (1980–1981) and MP (1988–1990, 2004–2010), cardiac arrest.Assam's Lone Woman Chief Minister Syeda Anwara Taimur Passes Away at 84 ===29=== *Abd al-Rahman Abd al-Khaliq, 80, Egyptian-Kuwaiti Islamic scholar (Society of the Revival of Islamic Heritage), writer and preacher, heart attack.الشيخ عبد الرحمن عبد الخالق في ذمة الله *Luigi Arisio, 94, Italian politician, Deputy (1983–1987).Morto Luigi Arisio il leader della marcia dei 40 mila che nel 1980 chiuse lo sciopero dei 35 giorni alla Fiat *Silva Batuta, 80, Brazilian footballer (Flamengo, Corinthians, national team).Mor Walter Machado da Silva *Aster Berkhof, 100, Belgian writer.Schrijver Aster Berkhof (bekend van \"Veel geluk, professor!\") is gestorven *Timothy Ray Brown, 54, American health activist, first person cured of HIV/AIDS, leukemia.First person ever cured from HIV infection, Timothy Ray Brown, known as 'the Berlin Patient' dies of cancer *Angelita Castany, 86, Cuban-born Mexican actress (Por mis pistolas, Extraños caminos del amor, Valentina), singer and dancer, respiratory failure.Murió la actriz cubana Angelita Castany, primera esposa de 'Chabelo' *János Dalmati, 78, Hungarian Olympic athlete (1972).Olympedia: János Dalmati *Mac Davis, 78, American country singer-songwriter (\"Baby, Don't Get Hooked on Me\", \"In the Ghetto\"), guitarist and actor (North Dallas Forty), heart attack caused by surgery.‘IN THE GHETTO’ SONGWRITER MAC DAVIS DEAD AT 78 *Helen Reddy, 78, Australian pop singer (\"I Am Woman\", \"Candle on the Water\"), actress (Pete's Dragon) and activist, Grammy winner (1973), problems caused by dementia.Trailblazing Australian singer Helen Reddy dead at 78 *Rocco Prestia, 69, American jazz-funk bassist (Tower of Power), liver disease.Legendary Tower of Power bassist Rocco Prestia dies aged 69 *Doyle Royal, 101, American footballer (Maryland Terrapins) and tennis and soccer coach (University of Maryland).101-YEAR-OLD TENNIS, SOCCER CHAMPION AND WAR HERO DOYLE ROYAL DIES *Sabah Al-Ahmad Al-Jaber Al-Sabah, 91, Kuwaiti royal and politician, Prime Minister (2003–2006) and Emir (since 2006), problems caused by surgery.Kuwait’s Emir Sheikh Sabah dies at age 91 *Carlisle Trost, 90, American Navy admiral, Chief of Naval Operations (1986–1990).Adm. Carlisle A. H. Trost, 23rd Chief of Naval Operations, Passes Away *John Whittaker, 70, New Zealand rugby league player (Warrington, Wellington, national team), cancer.Rugby league mourns 1970s Kiwis star John Whittaker, who has died of cancer *Isidora Žebeljan, 53, Serbian composer and conductor, member of the Serbian Academy of Sciences and Arts.Preminula Isidora Žebeljan posle duge i teške bolesti ===30=== *Ali Bozer, 95, Turkish politician and academic, Acting Prime Minister (1989) and Minister of Foreign Affairs (1990), COVID-19.Eski Dışişleri Bakanı Bozer, coronadan hayatını kaybetti *Jacques Brunhes, 85, French politician, Deputy (1978–2007), Mayor of Gennevilliers (1987–2001) and Minister of Tourism (2001–2002).Gennevilliers pleure son ancien maire, Jacques Brunhes, mort à 86 ans *Simon Eine, 84, French actor (Another Man, Another Chance, Notre musique, Sarah's Key) and comedian.Mort de Simon Eine, sociétaire honoraire de la Comédie-Française *Emyr Humphreys, 101, Welsh novelist (A Toy Epic) and poet.Cofio'r llenor a'r 'cawr diwylliannol' Emyr Humphreys *Lou Johnson, 86, American baseball player (Chicago Cubs, Los Angeles Dodgers, Los Angeles Angels), World Series champion (1965).'Sweet' Lou Johnson passes away at 86 *Pia Juul, 58, Danish poet, novelist and translator, member of the Danish Academy.Forfatter Pia Juul er død, 58 år *John Jenkins, 68, American politician, member of the Maine Senate (1996–1998), Mayor of Lewiston (1994–1998) and Auburn (2007–2009).Former Lewiston and Auburn Mayor John Jenkins dies *Scott Lilienfeld, 59, American psychologist and author (50 Great Myths of Popular Psychology), pancreatic cancer.Scott Lilienfeld remembered for advancing psychology while embodying kindness *Leonard Mastroni, 71, American politician, member of the Kansas House of Representatives (since 2017).Kansas state Rep. Leonard Mastroni dies after lengthy illness *Quino, 88, Argentine cartoonist, creator of Mafalda, stroke.Muere Quino, creador de Mafalda y el dibujante más internacional del idioma español *Eli Ruckenstein, 95, Romanian-born American physical chemist, member of the National Academy of Engineering (since 1990), National Medal of Science winner (1998).Pioneering engineer Eli Ruckenstein dies at 95 *John Russell, 100, American equestrian, Olympic bronze medalist (1952).Olympedia: John Russell *Frank Windsor, 92, British actor (Z-Cars, Softly, Softly, EastEnders).Frank Windsor dead: Z-Cars star dies at home aged 92 surrounded by family ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *09 Deaths",
 "title": "Deaths in September 2020"
}