{
 "id": "75531",
 "text": "\"Check on It\" is an R&B; song written by Beyoncé Knowles, Kasseem Dean, Sean Garrett, Angela Beyincé, and Stayve Thomas for the soundtrack to the 2006 movie The Pink Panther, in which Beyoncé co-stars. Although not included on its soundtrack album (because it only contains the movies scores), the song is included on Destiny's Child's greatest hits album #1's and on selected non-U.S. versions of Knowles' second studio album, B'Day. It was produced by Knowles and Swizz Beatz. ==Formats and track listing== ;CD single # Album version – 3:34 # Instrumental – 3:31 # Bama Boyz After Dark remix – 4:15 # Bama Boyz remix – 3:54 # Grizz remix – 3:19 # Gantman Juke mix – 4:21 ==Music video== When demand was growing for the song, Knowles shot a music video serving as promotion for both #1's and The Pink Panther. The video was directed by Hype Williams, and was premiered on December 16 2005. The remix of the song in the music video features a remix of \"The Pink Panther Theme\" and a rap from Bun B. The video has a pink theme, with Knowles shown in mostly all pink (to fit in with The Pink Panther), and the dancers wear pink PVC jackets and dance around rippling pink satin sheets. The video cuts to Knowles wearing a pink polka dot corset against a hot magenta polka dot wall. Where black bars normally appear on a 4:3 (full screen) television showing a widescreen production, footage is displayed of pink curtains moving in the background. \"Check on It\" won the 2006 MTV Video Music Award for \"Best R&B; Video\" on August 31, 2006. ==Charts== {| class=\"wikitable\" Chart (2005/2006) Peak position Canadian BDS Airplay Chart 20 Chart (2006)mariah-charts.comTop 40 charts Peak position U.S. Billboard Hot 100 1 U.S. Billboard Pop 100 1 U.S. Billboard Hot R&B;/Hip-Hop Songs 3 U.S. Billboard Rhythmic Top 40 1 U.S. Billboard Hot Dance Club Play 1 Austrian Singles Chart 10 Belgium UltraTop 50 9 Brazilian Hot 100 1 Czech Top 100 7 European Singles Chart 6 Finnish Singles Chart 6 French Singles Chart 32 German Singles Chart 11 Irish Singles Chart 2 Japanese Singles Chart 76 Dutch Top 40 5 New Zealand Singles Chart (RIANZ) 1 Norwegian Singles Chart 3 Latvian Airplay Top 11 Peru Top 100 16 Polish hit fmPolish charts hitfm.nasze.pl 1 Swedish Singles Chart 11 Swiss Singles Chart 7 UK Singles Chart 3 ==References== Category:2005 songs Category:Billboard Hot 100 number one songs Category:Destiny's Child songs Category:Beyoncé songs Category:Hip hop songs Category:R&B; songs",
 "title": "Check on It"
}