{
 "id": "755394",
 "text": "The following is a list of deaths that should be noted in June 2020. For deaths that should be noted before the month that the world is in, please see \"Months\". Individuals listed must have notability. Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non- humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==June== thumb|right|120px| ===1=== *Javier Alva Orlandini, 92, Peruvian politician, Congressman (1963–1968, 1980–1985, 1990–1992, 1995–2000), Vice President (1980–1985) and President of the Senate (1981–1982), 1985 presidential candidate.Javier Alva Orlandini, figura histórica de Acción Popular, falleció este lunes *Jean-Michel Cadiot, 67, French novelist and journalist.Décès. Jean-Michel Cadiot, un journaliste de passion *Silver Donald Cameron, 82, Canadian journalist and environmental author, lung cancer. *Pat Dye, 80, American Hall of Fame college football player (Georgia Bulldogs, Edmonton Eskimos), athletic director and coach (Auburn Tigers) and writer, liver and kidney failure.Pat Dye, legendary Auburn football coach, dies at 80 *Asif Farrukhi, 60, Pakistani translator and editor.Pakistani writer Asif Farrukhi passes away *Majek Fashek, 57, Nigerian reggae singer-songwriter and guitarist, esophageal cancer.Nigerian reggae legend Majek Fashek dies at 57 *Lee Grosscup, 83, American football player (New York Giants) and broadcaster, problems caused by a fall.Cal Football: Beloved, Long-Time Bears Broadcaster Lee Grosscup Dies at 83 *Joey Image, 63, American drummer (Misfits), liver cancer.Misfits drummer Joey Image reportedly dead at 63 *Wajid Khan, 43, Indian movie composer (Garv: Pride & Honour, Hello, Ek Tha Tiger), COVID-19 and kidney infection. *Janez Kocijančič, 78, Slovenian politician and lawyer, President of the Slovenian Olympic Committee (1991–2014) and Deputy (1993–1996).EOC President Kocijančič dies aged 78 following illness *Ron Larrieu, 83, American Olympic athlete (1964).Ron Larrieu *Nicolas Rea, 3rd Baron Rea, 91, British politician, member of the House of Lords (since 1982).Lord Rea Labour *Piotr Rocki, 46, Polish footballer (Polonia Warsaw, Górnik Zabrze, Dyskobolia Grodzisk Wielkopolski), aneurysm.Piotr Rocki nie żyje. Poruszający wpis jego syna *Mariya Shtepa, 95, Ukrainian writer.Померла легендарна зв’язкова УПА Марія Штепа *Pedro Ercílio Simon, 78, Brazilian Roman Catholic prelate, Bishop of Uruguaiana (1995–1998) and Archbishop of Passo Fundo (2011–2012).Archbishop Pedro Ercílio Simon *Myroslav Skoryk, 82, Ukrainian composer, Director of the National Opera of Ukraine (2011–2016).Помер український композитор Мирослав Скорик *Josef Smolka, 81, Czech volleyball player, Olympic bronze medalist (1968).Josef Smolka *Christoph Sydow, 35, German journalist (Der Spiegel), suicide.Zum Tod von Christoph Sydow: Mensch, Christoph! ===2=== *Arrogate, 7, American Thoroughbred racehorse, Breeders' Cup Classic winner (2016) and American Champion Three-Year-Old Male Horse (2016), euthanized.Juddmonte Champion Arrogate Dies at 7 *Werner Böhm, 78, German singer and musician, Eurovision entrant (1982).Werner Böhm alias Gottlieb Wendehals gestorben *Geoffrey Burnstock, 91, English-born Australian neuroscientist, created the term purinergic signalling.Burnstock *Paolo Fabbri, 81, Italian semiotician.Addio al semiologo Paolo Fabbri, ha svelato i meccanismi del linguaggio e dell'arte *Roberto Gervaso, 82, Italian writer and journalist, cancer.È morto Roberto Gervaso. Lo scrittore aveva 82 anni *Mary Pat Gleason, 70, American actress (Guiding Light, A Cinderella Story, Mom) and television writer, Emmy winner (1986), uterine cancer.Mary Pat Gleason, ‘A Cinderella Story’ and ‘Mom’ Actor, Dies at 70 *Jean-Claude Hamel, 90, French football businessman, President of Auxerre (1963–2009).Jean-Claude Hamel, une vie de passion *Amalia Megapanou, 91, Greek writer and politician.Εφυγε από τη ζωή η Αμαλία Μεγαπάνου, η πρώην σύζυγος του Κωνσταντίνου Καραμανλή *Jacques Noyer, 93, French Roman Catholic prelate, Bishop of Amiens (1987–2003).Monseigneur Jacques Noyer, ancien évêque d'Amiens, est mort *Roberto Peccei, 78, Italian physicist (Peccei–Quinn theory).Roberto Peccei – In Memoriam *Héctor Suárez, 81, Mexican actor (National Mechanics, El buscabullas, El derecho de nacer) and comedian, bladder cancer.Murió el comediante Héctor Suárez a los 81 años *Lindsay Townsend, 86, New Zealand rugby union player (Otago, national team).Southern All Black Lindsay Townsend dies *Carlo Ubbiali, 90, Italian motorcycle road racer, six-time Grand Prix winner, respiratory failure.Addio a Carlo Ubbiali, leggenda del motociclismo italiano *Wes Unseld, 74, American Hall of Fame basketball player (Washington Bullets) and coach, pneumonia.Wizards, NBA mourn passing of Wes Unseld ===3=== *Marc de Hond, 42, Dutch television presenter (LLiNK, NPO 3, RTL 7) and Paralympic basketball player (men's national team), spinal and bladder cancer.Theatermaker en rolstoelsporter Marc de Hond (42) overleden *Abdelmalek Droukdel, 50, Algerian terrorist, Leader of Al-Qaeda in the Islamic Maghreb, shot.French forces kill al-Qaida's north Africa chief in Mali French forces kill al-Qaida's north Africa chief in Mali *Bruce Jay Friedman, 90, American screenwriter (The Heartbreak Kid, Splash), playwright (Steambath) and novelist, problems caused by peripheral neuropathy.Bruce Jay Friedman, Oscar-Nominated Screenwriter of ‘Splash,’ Dies at 90 *István Kausz, 87, Hungarian fencer, Olympic champion (1964).Elhunyt Kausz István olimpiai bajnok párbajtőröző *Veli Lehtelä, 84, Finnish rower, Olympic bronze medalist (1956, 1960). *Johnny Majors, 85, American Hall of Fame football player (Tennessee Volunteers) and coach (Pitt Panthers, Iowa State Cyclones), national champion (1976).Legendary Tennessee football player, coach Johnny Majors dies *Héctor Ortega, 81, Mexican actor (Las fuerzas vivas, Santa Sangre, Lucía, Lucía).Muere el actor mexicano Héctor Ortega a los 81 años *Valentina Tăzlăuanu, 70, Moldovan essayist, journalist (Sud-Est, Literatura și Arta) and theatre critic.Scriitoarea și jurnalista Valentina Tăzlăuanu s-a stins din viață *Maria Alice Vergueiro, 85, Brazilian actress (O Corpo, Cronicamente Inviável, Tapa na Pantera), pneumonia.Atriz e diretora Maria Alice Vergueiro morre em SP aos 85 anos *Conrad Worrill, 78, American writer and political activist, cancer.Professor Emeritus, former Carruthers Center Director Conrad Worrill dies at 78 ===4=== *Marcello Abbado, 93, Italian pianist and composer.Addio al maestro Marcello Abbado *Milena Benini, 54, Croatian science fiction writer and translator (SFERA Award).Nakon teške bolesti preminula književnica i prevoditeljica Milena Benini *Basu Chatterjee, 90, Indian movie director (Us Paar, Piya Ka Ghar, Chameli Ki Shaadi).Filmmaker Basu Chatterjee passes away *Kathryn Hach-Darrow, 97, American businesswoman and philanthropist.Kitty Hach-Darrow dies at age 97 *Laura Hillman, 96, German-born American Holocaust survivor.Laura Hillman, Holocaust survivor, dies at 96 *Rupert Hine, 72, English singer-songwriter, musician (Quantum Jump) and record producer (The Fixx, Howard Jones), cancer.Rock Producer Rupert Hine, Who Worked Alongside Tina Turner, The Fixx and Rush, Dies at 72 *Mikhail Kokshenov, 83, Russian actor (Zhenya, Zhenechka and Katyusha, The Garage, Sportloto-82), problems caused by a stroke.Скончался актёр Михаил Кокшенов *Pieter van der Kruk, 78, Dutch Olympic weightlifter and shot putter (1968).Piet van der Kruk (78), laatste gewichtheffer op de Spelen, overleden *Bobby Locke, 86, American baseball player (Cleveland Indians, Philadelphia Phillies). *Steve Priest, 72, British rock musician and songwriter (The Sweet).Steve Priest Dies: Bassist Who Co-Founded Sweet Was 72 *Pete Rademacher, 91, American boxer, Olympic champion (1956), problems caused by dementia. *Antonio Rodríguez de las Heras, 72, Spanish historian and academic, COVID-19.Fallece Antonio Rodríguez de las Heras, experto de Levanta la cabeza *Bixente Serrano Izko, 72, Spanish historian and politician, Deputy (2015), problems caused by surgery.Muere en Pamplona el político e historiador Bixente Serrano Izko *Albert N. Whiting, 102, American educator, President of North Carolina Central University (1966–1983).Dr. Albert N. Whiting, Fourth President and First Chancellor of NCCU, Passes Away at 102 ===5=== *Andrée Champagne, 80, Canadian actress (Les Belles Histoires des pays d'en haut) and politician, MP (1984–1993, 2005–2014).L'ex-comédienne Andrée Champagne n’est plus *Jonathan Dowling, 65, Irish-American theoretical physicist.LSU mourns loss of internationally recognized professor of theoretical physics *Jim Fryatt, 79, English footballer (Bradford, Oldham Athletic, Southport).Jim Fryatt (1940-2020) *Boris Gaganelov, 78, Bulgarian football player (Belasita Petrich, CSKA Sofia, national team) and manager. *Jiří Hanák, 82, Czech journalist and political activist, Charter 77 signer.Ve věku 82 let zemřel Jiří Hanák, novinář a komentátor Lidových novin *Tomisaku Kawasaki, 95, Japanese pediatrician, discoverer of Kawasaki disease.「川崎病」発見した小児科医・川崎富作さん死去 95歳 *Vilhelm Kraus, 71, Bulgarian politician and businessman, Minister of Transport (1997–1999).Former Minister of Transport and Deputy Mayor of Sofia Wilhelm Kraus has Passed Away *Carlos Lessa, 83, Brazilian economist, President of the Brazilian Development Bank (2003–2004), COVID-19.Economista Carlos Lessa morre aos 83 anos de Covid-19 *Ved Marwah, 85, Indian politician, Governor of Mizoram (2000–2001), Manipur (1999–2003) and Jharkhand (2000–2004), problems caused by lung disease.Ved Marwah, former chief of Delhi Police, passes away in Goa *John Miller, 79, American baseball player (Baltimore Orioles).Mariners Moose Tracks, 6/7/20: Marco & Monica Gonzales, Buster Olney, and Pokémon *James Albert Murray, 87, American Roman Catholic prelate, Bishop of Kalamazoo (1998–2009).Catholics mourning death of Kalamazoo Bishop Emeritus James A. Murray *George V. Murry, 71, American Roman Catholic prelate, Bishop of Saint Thomas (1999–2007) and Youngstown (since 2007), acute myeloid leukemia.Bishop Murry of Youngstown dies after stepping down due to leukemia *Mary Overlie, 74, American choreographer, dancer and writer (the Six Viewpoints). *Burton Natarus, 86, American political scientist and politician, member of the Chicago City Council (1971–2007).Former Ald. Burton Natarus Dies At 86 *Friedrich Stelzner, 98, Czech-born German surgeon and educator.Friedrich Stelzner : Traueranzeige *Kurt Thomas, 64, American Olympic gymnast (1976), World Champion (1978, 1979), problems caused by a stroke.Kurt Thomas, first US man to win world gym title, dies at 64 *Marian Tomaszewski, 97, Polish military personnel (2nd Polish Corps).Zmarł płk Marian Tomaszewski. Walczył pod Monte Cassino *Shigeru Yokota, 87, Japanese writer and human rights activist, co-founder of NARKN.Shigeru Yokota, father of N Korea abductee, dies at 87 ===6=== *Reche Caldwell, 41, American football player (San Diego Chargers, New England Patriots, Washington Redskins), shot.Former NFL receiver Reche Caldwell killed in Florida *Christel DeHaan, 77, German-born American businesswoman and philanthropist, founder of RCI and Christel House International.Christel DeHaan, prominent Indianapolis philanthropist, dies at age 77 *Milt Earnhart, 102, American politician, member of the Arkansas House of Representatives (1959–1966) and State Senate (1967–1980).Milt Earnhart *Hsu Kun-yuan, 63, Taiwanese politician, Speaker of the Kaohsiung City Council (2010–2014; since 2018), suicide by jumping.Kaohsiung council speaker jumps to death after Han recall election *Marjan, 72, Iranian actress (Morgh-e tokhm-tala, Salam Bar Eshgh, Takye bar baad) and singer.مرجان؛ صدای معترضی که خاموش شد *Jordi Mestre, 38, Spanish actor (Sé lo que hicisteis...) and model, motorcycle crash.Muere el actor Jordi Mestre tras chocar con su moto contra un semáforo en el centro de Madrid *Lester Ryan, 61, Irish hurler (Clara, Kilkenny), bike crash.Former Kilkenny hurler Ryan dies in road accident *T. Terrell Sessums, 89, American politician, member of the State House (1963–1974) and State Speaker (1972–1974).Thomas Terrell Sessums, former Florida House speaker, dead at 89 *Ramadan Shalah, 62, Palestinian Islamic militant, Secretary-general of the Islamic Jihad Movement in Palestine (1995–2018), problems caused by heart surgery.Former Palestinian Islamic Jihad leader Ramadan Shalah dies at 62 *Andrea Veggio, 96, Italian Roman Catholic prelate, Auxiliary Bishop of Verona (1983–2001).Addio a monsignor Veggio: originario di Manerba, è stato vescovo ausiliare di Verona *Constantin Xenakis, 88, Egyptian-born Greek-French painter and sculptor. *John Zook, 72, American football player (Atlanta Falcons, St. Louis Cardinals), cancer.Longtime Atlanta Falcons DE John Zook dies at age 72 ===7=== *Frank Bey, 74, American blues singer. Soul Blues Man Frank Bey Dead at 74 *Hubert Gagnon, 73, Canadian actor (Les Oraliens, Nic and Pic) and voice dubber (Homer Simpson), cancer.Hubert Gagnon, la voix d'Homer Simpson, est décédé *Floyd Lee, 86, American blues musician (Music Under New York), heart failure.Floyd Lee *Liu Aiqin, 92, Chinese educator.媒体：刘少奇长女刘爱琴逝世享年92岁 遗体将捐献 *Paul Lombard, 92, French politician, Mayor of Martigues (1968–2009).Martigues : l'ancien maire Paul Lombard est décédé à l'âge de 92 ans *Alan Metter, 77, American movie director (Back to School, Girls Just Want to Have Fun), heart attack.Alan Metter, Director of Rodney Dangerfield's 'Back to School,' Dies at 77 *Ken Riley, 72, American football player (Cincinnati Bengals) and coach (Florida A&M; Rattlers), heart attack.FAMU, NFL legend Ken Riley passes away *Lynika Strozier, 35, American biologist and researcher, COVID-19. ===8=== *Klaus Berger, 79, German academic theologian.Klaus Berger ist tot *Nicholas Cummings, 95, American psychologist and writer, President of the American Psychological Association (1979–1980).Nicholas A. Cummings *Tony Dunne, 78, Irish football player (Manchester United, Bolton Wanderers, national team) and manager.Tony Dunne dead: Legendary former Man Utd defender passes away aged 78 *Manuel Felguérez, 91, Mexican abstract artist (Generación de la Ruptura), COVID-19.Muere Manuel Felguérez, un grande del arte abstracto mexicano *Marion Hänsel, 71, French- born Belgian movie director and screenwriter (Between the Devil and the Deep Blue Sea).La cinéaste belge Marion Hänsel est décédée *Rosemary Hollis, 67–68, British political scientist. *G. C. Jennings, 81, American politician, member of the Virginia House of Delegates (1982–1994), car crash.Grover Cullen \"G.C.\" Jennings *Sedley Joseph, 80, Trinidadian footballer (national team), kidney disease. *Nemir Kirdar, 83, Iraqi-British banker and financier, founder of Investcorp, problems caused by dementia.Nemir Kirdar, father of private equity globally, dies at 83 *Stan London, 94, American physician (St. Louis Cardinals).Longtime Cardinals team physician Stan London dies at 94 *Gwen Margolis, 85, American politician, member of the Florida House of Representatives (1974–1980), State Senate (1980–1992, 2002–2008, 2010–2016) and State Senate President (1990–1992).Florida’s first woman Senate president, Gwen Margolis, dies at 85 *Fabrizio Mioni, 89, Italian-American actor (Roland the Mighty, Hercules, Get Yourself a College Girl).Fabrizio Mioni *Pierre Nkurunziza, 55, Burundian politician, President (since 2005), heart attack.Burundi president dies of 'heart attack' at 55 *Bonnie Pointer, 69, American singer (The Pointer Sisters), cardiac arrest.Bonnie Pointer of the Pointer Sisters Dies at 69 *Arjun Charan Sethi, 79, Indian politician, MP (1971–1977, 1980–1984, 1991–1996, since 1998).Former Union minister Arjun Sethi passes away *Heli Susi, 90, Estonian teacher and translator, member of PEN International (since 2018).In memoriam Heli Susi 1929--2020 *Ian Taylor, 64, British commodity trading businessman, chairman and CEO of Vitol, pneumonia caused by cancer. *Shim Wan-koo, 81, South Korean politician, MP (1985–1992) and Mayor of Ulsan (1997–2002).심완구 민선 초대 울산시장 지병으로 별세 *Stefan Vodenicharov, 75, Bulgarian educator and politician, President of the Bulgarian Academy of Sciences (2012–2016) and Minister of Education (2013).Stefan Vodenicharov, formerly Bulgaria’s Education Minister, dies aged 75 ===9=== *Parviz Aboutaleb, 78, Iranian football player (Rah Ahan, Esteghlal) and manager (national team), problems caused by Alzheimer's disease.Ex-Iran coach Parviz Aboutaleb passes away *Paul Chapman, 66, Welsh rock guitarist (UFO, Lone Star).Former UFO Guitarist Paul Chapman Dead At 66 *Pau Donés, 53, Spanish singer-songwriter (Jarabe de Palo) and guitarist, colon cancer.Muere Pau Donés, líder de Jarabe de Palo, a los 53 años *Michael Drosnin, 74, American biblical writer and journalist (The Washington Post, The Wall Street Journal), heart disease.Michael Drosnin, Who Found Clues in the Bible, Is Dead at 74 *Ödön Földessy, 90, Hungarian long jumper, Olympic bronze medallist (1952).Meghalt Földessy Ödön olimpiai bronzérmes távolugró *Simon Henshaw, American politician, Ambassador to Guinea (since 2019), heart attack.L’ambassadeur des Etats-Unis en Guinée, Simon Henshaw, est mort à Conakry *Noel Johnson, 47 American college basketball coach (Midwestern State), ovarian cancer.Midwestern State women's hoops coach Noel Johnson dies at 47 *Ain Kaalep, 94, Estonian novelist, poet and editor (Akadeemia), problems caused by Alzheimer's disease.94-aastasena suri Ain Kaalep *Kim Chang-sop, 74, North Korean politician, Vice Minister of the State Security Department (since 2015).Wreath to Bier of Late Kim Chang-sop *Lonnie Wheeler, 68, American sports columnist (USA Today, Cincinnati Post, Cincinnati Enquirer) and baseball biographer.Lonnie Wheeler, Cincinnati Sportswriter And Author, Has Died ===10=== *Duilio Arigoni, 91, Swiss chemist.Prof. em. Duilio Arigoni dies at 91 *Hans Cieslarczyk, 83, German football player (Borussia Dortmund, national team) and manager (SpVgg Fürth).Trauer um den ehemaligen Fußballnationalspieler Hans \"Cissy\" Cieslarczyk *Joan Ferner, 87, Canadian- New Zealand women's rights activist.Joan Ferner *Rosita Fornés, 97, Cuban- American actress (Musical Romance, The Desire, The Unknown Mariachi) and singer, emphysema.Fallece Rosita Fornés, la vedette de Cuba, a los 97 años *Vera Gancheva, 77, Bulgarian translator, publisher and author.Почина проф. Вера Ганчева *Harry Glickman, 96, American Hall of Fame sports reporter (The Oregonian) and executive (Portland Trailblazers). *Araceli Herrero Figueroa, 71, Spanish writer and philologist, COVID-19.Morre Araceli Herrero, pioneira da docencia en galego despois do franquismo *Anita Linda, 95, Filipino actress (Weighed But Found Wanting, Jaguar, Temptation Island). *Elisabeth- Anne de Massy, 73, Monegasque aristocrat.Death announced of Baroness Elisabeth-Anne de Massy *Hans Mezger, 90, German automotive engineer (Porsche).Legendary Porsche Engine Designer Hans Mezger Dies at 90 *Murray Olderman, 98, American sports cartoonist and writer, heart attack.Murray Olderman, Who Both Wrote and Drew About Sports, Dies at 98 *Talat Özkarslı, 82, Turkish football player (Galatasaray, national team) and manager (Gaziantepspor).Talat Özkarslı son yolculuğuna uğurlandı *Mr. Wrestling II, 85, American professional wrestler (CWF, GCW).Johnny “Mr. Wrestling II” Walker dead at age 85 *Wang Dingguo, 108, Chinese politician, member of the Political Consultative Conference (1978–1993).王定国同志逝世 *William Tietz, 92–93, American veterinarian and educator, President of the Montana State University (1977–1990).Former MSU president dies *Aad van den Heuvel, 84, Dutch television presenter and writer.Voormalig televisiemaker Aad van den Heuvel overleden *Claudell Washington, 65, American baseball player (Atlanta Braves, New York Yankees, Oakland Athletics), World Series champion (1974), prostate cancer.Ex-A’s star Claudell Washington of Berkeley dead at 65 *Jas Waters, 39, American television writer (This Is Us, Kidding, The Breaks) and columnist (Vibe), suicide by hanging.Jas Waters, ‘This Is Us’ and ‘Kidding’ Writer, Dies at 39 *Eppie Wietzes, 82, Dutch-born Canadian racing driver.Two-time F1 starter and 1981 Trans-Am champion Eppie Wietzes dies *Sarunyoo Wongkrachang, 59, Thai actor (13 Beloved, Ong Bak 2) and director (Kon Khon), liver cancer.Actor Saranyu Wongkrachang dies at 59 ===11=== *Kraisak Choonhavan, 72, Thai politician, Senator from Nakhon Ratchasima (2000–2006) and Deputy Leader of the Democrat Party (2008–2011), tongue cancer.Kraisak Choonhavan dies at 72 *Katsuhisa Hattori, 83, Japanese composer (Fist of the North Star) and record producer, heart failure.服部克久さんが死去 作編曲家 *Marjorie G. Horning, 102, American biochemist and pharmacologist.Marjorie Horning *Emmanuel Issoze-Ngondet, 59, Gabonese politician, Minister of Foreign Affairs (2012–2016) and Prime Minister (2016–2019), problems caused by asthma.Gabon: l’ancien premier ministre Issoze Ngondet est mort ! *Marcel Maréchal, 82, French actor and director (I as in Icarus, Fanfan).Marcel Maréchal, l'homme qui a révolutionné le théâtre à Marseille, est mort *Basil Meeking, 90, New Zealand Roman Catholic prelate, Bishop of Christchurch (1987–1995).Bishop Basil Meeking, Bishop Emeritus of Christchurch, dies aged 90 *Dennis O'Neil, 81, American comic book writer (Batman, Iron Man) and editor (Marvel Comics), cardiopulmonary arrest.Legendary Batman writer, Denny O'Neil dies at age 81 *Matt Poore, 90, New Zealand cricketer (Canterbury, national team).Obituary: Former New Zealand test cricketer Matt Poore dies at age 90 *Rosa Maria Sardà, 78, Spanish actress (Alegre ma non troppo, My Mother Likes Women, Ocho apellidos catalanes) and comedian, Goya winner (1994, 2002), lymphoma.Muere la actriz Rosa María Sardà a los 78 años *Mel Winkler, 78, American actor (Crash Bandicoot, Devil in a Blue Dress, Doc Hollywood).Mel Winkler, Actor in 'Devil in a Blue Dress' and 'Doc Hollywood,' Dies at 78 ===12=== *Carl Brewer, 63, American politician, Mayor of Wichita (2007–2015).Former Wichita mayor, candidate for governor Carl Brewer has died *Rayshard Brooks, 27, American police detainee, shot.Atlanta police shoot, kill suspect after struggle *Anand Mohan Zutshi Gulzar Dehlvi, 93, Indian poet and journalist, COVID-19.Urdu poet Gulzar Dehlvi dies days after recovering from COVID-19 *Lino Esterino Garavaglia, 92, Italian Roman Catholic prelate, Bishop of Tivoli (1987–1991) and Cesena-Sarsina (1991–2003).Cesena, morto il vescovo emerito Lino Garavaglia *Juli Sanclimens i Genescà, 84, Spanish politician, Mayor of Manresa (1984–1995) and member of the Catalan Parliament (1988–1995).Mor als 84 anys Juli Sanclimens, alcalde de Manresa entre 1987 i 1995 *Emmy Schörg, 90, Austrian stage actress.Emmy Schörg gestorben *William S. Sessions, 90, American politician and lawyer, Chief Judge of U.S. District Court for Western Texas (1971–1987) and Director of the FBI (1987–1993), problems caused by heart failure.William S. Sessions, who led the FBI during a turbulent time and was fired, dies at 90 *Arthur Donald Spatt, 94, American politician and lawyer, Judge for the U.S. District Court for Eastern New York (1989–2004), blood cancer. *Ricky Valance, 81, Welsh singer (\"Tell Laura I Love Her\"), problems caused by dementia.Seventies star Ricky Valance passes away in Spain *Albert Vitali, 64, Swiss politician, member of the National Council (since 2011), cancer.Der Luzerner FDP-Nationalrat Albert Vitali ist verstorben *Parasnath Yadav, 71, Indian politician, Uttar Pradesh MLA (since 2012), bladder cancer.जौनपुर: पूर्व मंत्री और मल्हनी विधायक पारसनाथ यादव का निधन *Perfecto Yasay Jr., 73, Filipino politician, Chairman of SEC (1995–2000) and Secretary of Foreign Affairs (2016–2017), 2010 vice presidential nominee, pneumonia caused by lung cancer.Former DFA chief Perfecto Yasay Jr. dies ===13=== *Sheikh Md Abdullah, 74, Bangladeshi politician, Minister of Religious Affairs (since 2019), COVID-19.Bangladesh Minister dies of coronavirus *Leslie Cohen Berlowitz, 76, American academic administrator, member of the American Academy of Arts and Sciences.Leslie Cohen Berlowitz *Dick Garmaker, 87, American basketball player (Minneapolis Lakers, New York Knicks).Dick Garmaker, former Gophers All-America basketball star, dies at 87 *Jim Grelle, 83, American Olympic middle-distance runner (1960). *B. Kannan, 69, Indian cinematographer (Oru Nadigai Natakam Parkiral, Kadalora Kavithaigal, Solla Thudikuthu Manasu), problems caused by heart disease.Legendary Tamil Cinematographer B. Kannan Passes Away *Mike McCormick, 81, American baseball player (San Francisco Giants, Baltimore Orioles, Kansas City Royals), Parkinson's disease.Mike McCormick, Giants’ first Cy Young Award winner, dies at 81 *Mohammed Nasim, 72, Bangladeshi politician, MP (1986–1987, 1991–2006, since 2014), Minister of Home Affairs (1999–2001) and Health (2014–2019), stroke caused by COVID-19.Mohammed Nasim, AL leader and former health minister, dies at 72 *Maurice Rajsfus, 92, French writer and historian.Disparition de l’écrivain et historien Maurice Rajsfus *Jean Raspail, 94, French author (The Camp of the Saints, Moi, Antoine de Tounens, roi de Patagonie) and explorer.Mort de Jean Raspail, écrivain et explorateur, auteur du «Camp des Saints» *Stuart Lyon Smith, 82, Canadian politician, Ontario MPP (1975–1982) and Leader of the Ontario Liberal Party (1976–1982).Del Duca Makes Statement on the Passing of Stuart Smith (death announced on this date) *Tineke Verburg, 64, Dutch journalist and television presenter.Oud-presentatrice Tineke Verburg (64) overleden *Marc Zermati, 75, French record producer and promoter.Celui qui a fait de Mont-de-Marsan le berceau du punk en France est mort ===14=== *Sally Banes, 69, American dance historian and critic (Village Voice, SoHo Weekly News, Dance Magazine), ovarian cancer.In Memoriam: Sally Banes, A New Kind of Dance Writer (1950-2020) *Luce Douady, 16, French climber, World Youth champion (2019) and IFSC Climbing European bronze medalist (2019), fall.French Rising Star Luce Douady dies aged 16 *Bill Fox, 94, American sports franchise owner (Los Angeles Chargers), President of the San Diego Zoo Global.NFL Team Announces Minority Owner Died On Sunday *William Gildea, 81, American sportswriter (The Washington Post), problems caused by Parkinson's disease.R.I.P. William Gildea (1939-2020) *Elsa Joubert, 97, South African writer, COVID-19.Iconic SA author Elsa Joubert, 97, dies of Covid-19 *Noel Kelly, 84, Australian rugby league player (Ipswich, Western Suburbs Magpies, national team).Vale Noel Kelly: Magpies, Australia great dies, aged 84 *Mohammad-Ali Keshavarz, 90, Iranian actor (The Desert of the Tartars, The Fateful Day, Through the Olive Trees), lung infection.Actor Mohamad Ali Keshavarz passes away at 90 *Aarón Padilla Gutiérrez, 77, Mexican footballer (Pumas, Atlante, national team), COVID-19.Muere Aarón Padilla, exdirectivo de los Pumas de la UNAM, a causa de Covid-19 *Sushant Singh Rajput, 34, Indian actor (M.S. Dhoni: The Untold Story, Chhichhore, Detective Byomkesh Bakshy!), suicide by hanging.Sushant Singh Rajput commits suicide at Mumbai home *Claude Samuel, 88, French music critic and radio businessman.Mort de Claude Samuel, inlassable défenseur de la musique contemporaine *Keith Tippett, 72, British jazz pianist (\"Cat Food\") and composer.Addio a Keith Tippet, icons del jazz-rock più libertario *Raj Mohan Vohra, 88, Indian Army lieutenant general, COVID-19.Fallen warrior: A final farewell ===15=== *Giulio Giorello, 75, Italian philosopher and mathematician, COVID-19.È morto il filosofo Giulio Giorello *Nagendra Nath Jha, 85, Indian politician, Lieutenant Governor of Andaman and Nicobar Islands (2001–2004) and Puducherry (2004). *Badar Uddin Ahmed Kamran, 69, Bangladeshi politician, Mayor of Sylhet (2003–2013), COVID-19.Former mayor of Sylhet City Badar Uddin Ahmed Kamran dies at 69 *Marinho, 63, Brazilian footballer (Atlético Mineiro, Bangu, national team), manager and Olympian (1976), pancreatitis caused by prostate cancer.Morre aos 63 anos Marinho, ex-atacante da seleção *Robert S. Molaro, 69, American politician and lobbyist, State Senator (1993–2003) and member of the Illinois House of Representatives (2003–2009), pancreatic cancer.Former legislator, horse racing lobbyist Robert Molaro dies *Adebayo Osinowo, 64, Nigerian politician, member of the Senate (since 2019) and Lagos State House of Assembly (2003–2019), COVID-19.Senator Bayo Osinowo Is Dead *Haroldo Rodas, 74, Guatemalan politician, Minister of Foreign Affairs (2008–2012), COVID-19.Excanciller Haroldo Rodas falleció de Covid-19 *Anton Schlembach, 88, German Roman Catholic prelate, Bishop of Speyer (1983–2007).Das Bistum Speyer trauert um Bischof Anton Schlembach *Phil Takahashi, 63, Canadian Olympic judoka (1984, 1988), cancer.Philip Masato Takahashi ===16=== *Delbert Africa, 74, American civil rights activist (MOVE), prostate and bone cancer.Delbert Africa, longtime MOVE member recently released from prison, has died *Mohammad Asghar, 74, Welsh politician, MNA (since 2007).Conservative MS Mohammad Asghar has died after being rushed to hospital *Knut Bohwim, 89, Norwegian movie director (Olsen Gang).Regissør Knut Bohwim er død *Fred Jarvis, 95, British trade union leader, President of the National Union of Students (1952–1954) and General-Secretary of the National Union of Teachers (1975–1989).Fred Jarvis, combative leader of the National Union of Teachers – obituary *Valério Breda, 75, Italian-born Brazilian Roman Catholic prelate, Bishop of Penedo, Brazil (since 1997).Morre dom Valério Breda, bispo de Penedo (AL), aos 75 anos *Eduardo Cojuangco Jr., 85, Filipino businessman (San Miguel Corporation) and politician, Governor of Tarlac (1967–1969) and member of the House of Representatives (1969–1972), 1992 presidential candidate, heart failure and pneumonia caused by cancer.Eduardo ‘Danding’ Cojuangco Jr. dies, 85 *John Madigan, 53, Australian politician, Senator (2011–2016), liver and bowel cancer.Tributes flow for down-to-earth former Senator John Madigan *John J. Mooney, 90, American chemical engineer, problems caused by a stroke. *Gerda Mylle, 67, Belgian politician, Mayor of Izegem (2007–2012).Oud-burgemeester Gerda Mylle (67) onverwacht overleden na kortstondige ziekenhuisopname: “Ze heeft zonder meer haar stempel gedrukt op Izegem” *Edén Pastora, 83, Nicaraguan revolutionary and politician, 2006 presidential candidate, respiratory failure.Edén Pastora, Nicaraguan revolutionary, dead at 83 *Patrick Poivey, 72, French actor (Loulou, Mune: Guardian of the Moon), stroke.Patrick Poivey, voix française de Bruce Willis, est mort *Juan Floreal Recabarren, 93, Chilean historian and politician, Deputy (1969–1973) and Mayor of Antofagasta (1964–1967, 1990–1992), cardiac arrest.A los 93 años falleció el historiador y ex Alcalde de Antofagasta Floreal Recabarren *John G. Richardson, 62, American politician and lawyer, member (1998–2006) and Speaker of the Maine House of Representatives (2004–2006), heart attack.Former Maine House speaker John Richardson dies at age 62 *Charles Webb, 81, American novelist (The Graduate, The Marriage of a Young Stockbroker, Home School).Charles Webb, novelist who found fame, if not fortune, with his novel The Graduate – obituary ===17=== *Marlene Ahrens, 86, Chilean athlete, Olympic silver medalist (1956), heart failure.Falleció Marlene Ahrens, histórica figura del deporte chileno y única medallista olímpica *Tariq Aziz, 84, Pakistani actor, television show host (Bazm E Tariq Aziz) and politician, MP (1997–1999).Legendary actor and TV host Tariq Aziz has died *Gordon H. Bower, 87, American cognitive psychologist, pulmonary fibrosis.Eminent Stanford psychology professor Gordon Bower dies *Lewis John Carlino, 88, American screenwriter (I Never Promised You a Rose Garden) and director (The Great Santini), blood cancer.Lewis John Carlino, Writer and Director of 'The Great Santini,' Dies at 88 *William C. Dement, 91, American psychiatrist and sleep researcher, heart disease.William Dement, giant in sleep medicine, dies at 91 *Terry Dicks, 83, British politician, MP (1983–1997).Remembrance of departed colleagues *Victor Feldbrill, 96, Canadian conductor (Winnipeg Symphony Orchestra, Toronto Symphony Orchestra) and violinist.Victor Feldbrill RIP *Astrid Gjertsen, 91, Danish-born Norwegian politician and convicted fraudster, MP (1973–1989).Tidligere statsråd Astrid Gjertsen er død *Bill Groman, 83, American football player (Houston Oilers, Denver Broncos, Buffalo Bills).Former Oilers receiver Bill Groman dies *György Kárpáti, 84, Hungarian water polo player, Olympic champion (1952, 1956, 1964).Gyász: elhunyt a háromszoros olimpiai bajnok Kárpáti György *Petr Král, 78, Czech poet.Ve věku 78 let zemřel básník Petr Král, psal česky i francouzsky *Reavis L. Mitchell Jr., 72, American historian and academic administrator (Fisk University).Nashville historian Dr. Reavis Mitchell dies *Fabrice Philipot, 54, French racing cyclist.Fabrice Philipot est mort *Jean Kennedy Smith, 92, American politician, Ambassador to Ireland (1993–1998), last surviving sister of President John F. Kennedy. *Willie Thorne, 66, English snooker player and sports commentator (BBC), sepsis and respiratory failure caused by leukaemia.Willie Thorne dead: Snooker legend passes away aged 66 after leukaemia battle *Vatanyar Yagyua, 81, Russian politician, Saint Petersburg MLA (1994–2011).Умер петербургский политик и ученый Ватаняр Ягья ===18=== *Tibor Benedek, 47, Hungarian water polo player, Olympic champion (2000, 2004, 2008), pancreatic cancer. *Claus Biederstaedt, 91, German actor (The Great Temptation, Don't Worry About Your Mother-in-Law, Before Sundown).Schauspieler Claus Biederstaedt gestorben *John Bredenkamp, 79, Zimbabwean rugby union player and businessman, kidney failure. *Arturo Chaires, 83, Mexican footballer (Guadalajara, national team).Chivas: Fallece Arturo Chaires, miembro del Campeonísimo *Vic Gilliam, 66, American politician, member of the Oregon House of Representatives (2007–2017), problems caused by ALS.Former Oregon lawmaker Vic Gilliam, known for humor and bipartisanship, dies at 66 *Mikhail Ignatyev, 58, Russian politician, Head of the Chuvash Republic (2010–2020), COVID-19.Экс-глава Чувашии Михаил Игнатьев умер от коронавируса *Nicolas Joel, 67, French opera director, General Manager of Paris Opera (2009–2014), problems caused by a stroke.Disparition de Nicolas Joel *Sergei Khrushchev, 84, Russian-American engineer, son of General Secretary Nikita Khrushchev, suicide by firearm.Ex-Soviet leader Nikita Khrushchev’s son dies in US *Kossi Koudagba, 24, Togolese footballer (Espoir Tsevie, ASC Kara, national team).Les Eperviers du Togo en deuil : l’attaquant Koudagba Kossi est mort *Dame Vera Lynn, 103, British singer- songwriter (\"We'll Meet Again\", \"The White Cliffs of Dover\") and actress (Rhythm Serenade).Vera Lynn, singer and 'forces' sweetheart', dies aged 103 *Ada Rapoport-Albert, 74, Israeli-British historian.Tributes paid to Orthodox educator and expert on Chasidism, who dies aged 75 *Sachy, 48, Indian screenwriter (Makeup Man) and movie director (Anarkali, Ayyappanum Koshiyum), cardiac arrest.Malayalam director Sachy dies in Thrissur *Jules Sedney, 97, Surinamese economist and politician, Prime Minister (1969–1973) and Governor of the Central Bank of Suriname (1980–1983).Oud-premier Jules Sedney overleden *Antonio Veciana, 91, Cuban CIA spy (Alpha 66).CIA-trained former Cuban spy Antonio Veciana dies in Miami ===19=== *Cho Hae-il, 79, South Korean writer.‘겨울여자’ 작가 조해일 별세 *Mario Corso, 78, Italian football player (Inter, national team) and manager (Mantova).E' morto Mario Corso *Sir Ian Holm, 88, English actor (Alien, Chariots of Fire, The Lord of The Rings), Tony (1967) and BAFTA winner (1981), problems caused by Parkinson's disease.Ian Holm, star of Lord of the Rings, Alien and Chariots of Fire, dies aged 88 *David Perlman, 101, American science journalist (San Francisco Chronicle), cancer.David Perlman, award-winning Chronicle science writer, dies at age 101 *Carlos Ruiz Zafón, 55, Spanish novelist (The Prince of Mist, The Shadow of the Wind, The Prisoner of Heaven), colon cancer.Carlos Ruiz Zafón fallece en Los Ángeles a los 55 años *Vidyaben Shah, 97, Indian social worker and human rights activist.Social worker Vidyaben Shah passes away *Pat Stark, 90, American football player (Syracuse Orange) and coach (Rochester Yellowjackets).Former Syracuse QB and University of Rochester football coach Pat Stark dies *Noël Vandernotte, 96, French rower, Olympic bronze medalist (1936).JO – Noël Vandernotte, plus jeune médaillé olympique français, est décédé ===20=== *Ema Derossi-Bjelajac, 94, Croatian politician, President of the Presidency of SR Croatia (1985–1986).Umrla Ema Derossi Bjelajac, Istranka i prva predsjednica Hrvatske *Svein Arne Hansen, 74, Norwegian businessman and sports official, President of the European Athletic Association (since 2015), problems caused by a stroke.Svein Arne Hansen er død *Jim Kiick, 73, American football player (Miami Dolphins, Denver Broncos), Super Bowl champion (1972, 1973), Alzheimer's disease.Miami Dolphins great Jim Kiick dies at 73 *Philip Latham, 91, British actor (The Troubleshooters, Dracula: Prince of Darkness, Ring of Spies). *Pedro Lima, 49, Portuguese actor (Ilha dos Amores, Second Life) and Olympic swimmer (1988, 1992), suspected suicide.Pedro Lima was an Olympic swimmer for Angola. The actor and athlete left a letter before he died *Kamal Lohani, 85, Bangladeshi journalist, Director General of the Shilpakala Academy (2009–2011), COVID-19.Kamal Lohani succumbs to Covid-19 *Dumitru Munteanu, 87, Romanian footballer (Petrolul Ploiești, Steaua București, national team).A murit Dumitru Munteanu, cel mai vârstnic supraviețuitor din generația de aur de la Petrolul Ploiești ===21=== *György Bálint, 100, Hungarian horticulturist and politician, MP (1994–1998), heart failure and COVID-19.Meghalt Bálint gazda *Pascal Clément, 75, French politician, Deputy (1978–1993, 1995–2005, 2007–2012) and Minister of Justice (2005–2007), lung infection.L'ancien ministre de la Justice Pascal Clément est mort *Jürgen Holtz, 87, German actor (Rosa Luxemburg, Made in Israel, Goodbye, Lenin!), problems caused by cancer.Berliner Schauspieler Jürgen Holtz gestorben *Talib Jauhari, 80, Pakistani Islamic scholar, problems caused by heart disease.Allama Talib Jauhari, Pakistan’s renowned Shia scholar, passes away *David Hugh Mellor, 81, British philosopher, President of the Aristotelian Society (1992–1993).David Hugh Mellor (1938-2020) *Mile Nedelkoski, 84, Macedonian writer and poet.Почина македонският писател и драматург Миле Неделковски *Bernardino Piñera, 104, Chilean Roman Catholic prelate, Bishop of Temuco (1960–1977) and Archbishop of La Serena (1983–1990), pneumonia caused by COVID-19.Fallece Monseñor Bernardino Piñera Carvallo *Ahmed Radhi, 56, Iraqi football player (Al-Zawraa, national team) and manager (Al-Shorta), COVID-19.Iraqi football great Ahmed Radhi dies after contracting coronavirus *Ken Snow, 50, American footballer (Chicago Power, St. Louis Steamers, national team), COVID-19.Goodbye, Ken: Snow, former Indiana standout, 2-time Hermann Trophy winner, passes away *Zeev Sternhell, 85, Polish-born Israeli historian, political scientist and editor (Haaretz), problems caused by surgery.Zeev Sternhell, Leading Voice of Israeli Left and Renowned Political Scientist, Dies at 85 *Bobby Storey, 64, Irish politician and militant (IRA), problems caused by lung surgery.Bobby Storey: Senior republican dies following illness *Frank Tømmervåg, 69, Norwegian footballer (Lillestrøm).Frank Tømmervåg er død *Bobana Veličković, 30, Serbian Olympic sport shooter (2012, 2016), problems caused by childbirth.Velika tuga! u 31. godini preminula Bobana Momčilović Veličković, reprezentativka Srbije u streljaštvu! *Dennis Young, 90, New Zealand rugby union player (Canterbury, national team), cancer.From tap dancing to All Blacks, Dennis Young was one of a kind ===22=== *Vernon Alden, 97, American scholar, President of Ohio University (1962–1969).Vernon Roger Alden *Witold Baran, 80, Polish Olympic middle- distance runner (1964).Wielu Polaków pogrążyło się w żałobie. Związek przekazał najgorsze wieści, nie żyje Witold Baran *Pappukutty Bhagavathar, 107, Indian actor (Sthreehridayam, Sree Guruvayoorappan, Kattukurangu) and playback singer, heart failure.Veteran Kerala singer and actor Pappukutty Bhagavathar dies at 107 *Steve Bing, 55, American entertainment executive (Shangri-La Entertainment), screenwriter and movie producer (Kangaroo Jack, Rules Don't Apply), suicide by jumping.Steve Bing Dies: Film Financier & Philanthropist Jumped From Century City Building, Authorities Say *Carles Bosch, 75, Spanish journalist (Interviú) and movie director (Balseros).Murió Carlos Bosch, figura del fotoperiodismo argentino Murió Carlos Bosch, figura del fotoperiodismo argentino *Dick Buerkle, 72, American Olympic runner (1976, 1980), problems caused by multiple system atrophy.Aquinas grad and two- time U.S. Olympian Dick Buerkle dies at age 72 *Nouri Dhiab, 76, Iraqi footballer (national team).وفاة نجم الكرة العراقية السابق نوري ذياب *Jesus Dosado, 80, Filipino Roman Catholic prelate, Archbishop of Ozamiz (1981–2016).Former Ozamiz archbishop Jesus Dosado; 80 *Angela Madsen, 60, American athlete, Paralympic bronze medalist (2012), drowned.Paralympic Medalist Angela Madsen Dies On Solo Rowing Trip Across Pacific Ocean *Carlos Luis Morales, 55, Ecuadorian footballer (Independiente, Barcelona, national team) and politician, Provincial Prefect of Guayas (since 2019), cardiopulmonary arrest.Falleció Carlos Morales, leyenda del fútbol ecuatoriano *Harry Penk, 85, English footballer (Wigan Athletic, Plymouth Argyle, Southampton).Wigan Athletic old boy passes away aged 85 *Pierino Prati, 73, Italian footballer (Milan, Roma, national team), cancer.È morto Pierino Prati: bomber del Milan mondiale e della Roma *Joel Schumacher, 80, American movie director (The Lost Boys, Falling Down, Batman Forever), cancer.Joel Schumacher Dies: Director Of Two Batman Pics, ‘St. Elmo’s Fire’ & Others Was 80 *Thomas Welder, 80, American Benedictine nun and educator, President of the University of Mary (1978–2009), kidney cancer.Sister Thomas Welder passes away ===23=== *Nikos Alefantos, 81, Greek footballer (Atromitos Piraeus, Panegialios) and manager (Olympiacos), heart attack.Legendary Greek footballer passes away aged 81 *Vehbi Akdağ, 71, Turkish freestyle wrestler, Olympic silver medalist (1972).Vehbi Akdağ *Nikolai Fadeyechev, 87, Russian ballet dancer and educator, People's Artist of the USSR (1976), heart failure. *Michael Falzon, 48, Australian musical actor and theatre producer, cancer.Australian musical theatre star Michael Falzon dies aged 48 *Li Zhensheng, 79, Chinese photojournalist, cerebral hemorrhage.Li Zhensheng, photographer of China's Cultural Revolution, dies *Francisco Javier Prado Aránguiz, 91, Chilean Roman Catholic prelate, Bishop of Rancagua (1993–2004) and Iquique (1984–1988), melanoma.Fallece ex obispo de la Diócesis de Iquique Monseñor Javier Prado Aránguiz *Liam Treadwell, 34, English National Hunt jockey.Liam Treadwell dead: Grand National winning jockey passes away aged 34 *Luis R. Varela, 82, Cuban-born American Puerto Rican sportswriter (Associated Press), problems caused by intestinal surgery.Luis Varela, former AP sports correspondent, dies at 82 *César Bosco Vivas Robelo, 78, Nicaraguan Roman Catholic prelate, Bishop of León (1991–2019), respiratory failure.Fallece monseñor Bosco Vivas, obispo emérito de León ===24=== *Gösta Ågren, 83, Finnish poet, Finlandia Prize winner (1988).Gösta Ågren är död *Alfredo Biondi, 91, Italian politician, MP (1968–1972, 1979–2008), Minister of Environment (1983–1984) and Justice (1994–1995).E’ morto Alfredo Biondi, decano dei liberali italiani *Harry Britt, 82, American political activist and politician, member (1979–1993) and President (1989–1990) of San Francisco Board of Supervisors.Breaking: Gay former SF supervisor Harry Britt dies *Étienne Cerexhe, 89, Belgian politician, Senator (1985–1987) and member of the Chamber of Representatives (1988–1991).Le baron Etienne Cerexhe est décédé à l'âge de 89 ans *Lester Crystal, 85, American news executive (PBS NewsHour, NBC Nightly News), President of NBC News (1977–1979), brain cancer.Les Crystal, Who Led NBC News And PBS’s ‘NewsHour,’ Dies At 85 *Yuriy Dyachuk-Stavytskyi, 73, Ukrainian football player (Skala Stryi) and manager (Spartak Ivano-Frankivsk, Karpaty Lviv).Cумуємо... Не стало Юрія Дячука-Ставицького *Marc Fumaroli, 88, French historian and essayist, member of the Académie française (since 1995), car crash.È morto Marc Fumaroli, maestro di retorica *Michael Hawley, 58, American educator, pianist and artist, Van Cliburn International Piano Competition winner (2002), colon cancer.Michael Hawley, former professor of media arts and sciences, dies at 58 *Eddie Kasko, 88, American baseball player (Cincinnati Reds, Houston Astros) and manager (Boston Red Sox).Eddie Kasko, former Red Sox player, manager and executive, dies at 88 *Nilamber Dev Sharma, 88, Indian writer and literary scholar.Prof Nilamber Dev Sharma passes away *Nigel Weiss, 83, South African astronomer and mathematician, President of the Royal Astronomical Society (2000–2002). ===25=== *Abiola Ajimobi, 70, Nigerian politician, Senator (2004–2007) and Governor of Oyo State (2011–2019), COVID-19.Ajimobi: Former Oyo state governor dies at 70 after battling COVID-19 *Suzana Amaral, 88, Brazilian movie director and screenwriter (Hour of the Star, A Hidden Life).Suzana Amaral, diretora de 'A Hora da Estrela', morre em São Paulo *Patrice Gélard, 81, French politician, Senator (1995–2014).L’ancien sénateur de la Seine-Maritime Patrice Gélard est décédé à l’âge de 81 ans *Lester Grinspoon, 92, American psychiatrist.Marijuana Legalization Legend Dr. Lester Grinspoon Passes Away *John Kennedy Sr., 91, Australian Hall of Fame football player (Hawthorn) and coach (North Melbourne).Vale John Kennedy snr: Hawthorn's 'greatest figure' passes away *Juan Ostoic, 89, Chilean Olympic basketball player (1952, 1956), heart failure.Fallece Juan Ostoic, Jota O, mítico basquetbolista chileno y maestro de los puzzles de La Tercera *Papaléo Paes, 67, Brazilian politician and physician, Mayor of Macapá (1993–1996), Senator (2003–2011) and Vice Governor of Amapá (2015–2018), COVID-19.Papaléo Paes, ex-vice-governador e ex-senador do Amapá, morre aos 67 anos *Ionuț Popa, 67, Romanian football player and manager (UTA Arad, Bihor Oradea, Politehnica Iași).Mărturisirea lui Marius Șumudică în momentul în care a aflat că Ionuț Popa a murit *Joe Sinnott, 93, American Hall of Fame comic book artist (The Avengers, Thor, Fantastic Four).Marvel Comics Artist Joe Sinnott Dies at Age 93 *Hans Sleutelaar, 84, Dutch poet and translator.Rotterdamse dichter Hans Sleutelaar overleden *Peter E. Toschek, 87, German physicist.Der Fachbereich Physik trauert um Prof. Dr. Peter E. Toschek *Maya Ulanovskaya, 87, American-born Russian- Israeli political dissident, writer and translator.Умерла боровшаяся против Сталина диссидентка Майя Улановская *Art Miller Jr., 73, American politician, member of the Michigan Senate (1977–2002), lung cancer.Former longtime Democratic state Sen. Art Miller dies *Ivan Utrobin, 86, Soviet cross-country skier, Olympic bronze medalist (1964).Ivan Utrobin ===26=== *Abdoulatifou Aly, 60, Malagasy-born French politician, Deputy (2007–2012).L'ancien député de Mayotte Abdoulatifou Aly est décédé *Kelly Asbury, 60, American movie director (Spirit: Stallion of the Cimarron, Shrek 2, Gnomeo & Juliet) and animator, abdominal cancer.RIP, Kelly Asbury, Director Of ‘Shrek 2’ and ‘Spirit: Stallion of the Cimarron’ *Pierre-Antoine-Jean Bach, 87, French-born Laotian Roman Catholic prelate, Vicar Apostolic of Savannakhet (1971–1975).Bishop Pierre-Antoine-Jean Bach *Hermes Binner, 77, Argentine politician, Mayor of Rosario (1995–2003) and Governor of Santa Fe (2007–2011), 2011 presidential candidate, pneumonia.Murió Hermes Binner *Thomas Edwin Blanton Jr., 82, American terrorist and convicted murderer (16th Street Baptist Church bombing).Thomas Blanton, 16th Street Baptist Church bomber, dies in prison *Stuart Cornfeld, 67, American movie producer (Zoolander, Dodgeball: A True Underdog Story, Tropic Thunder), cancer.Stuart Cornfeld, 'Zoolander' and 'Tropic Thunder' Producer, Dies at 67 *James Dunn, 80, British theologian. *Arnie Ginsburg, 93, American disc jockey (WMEX).Boston radio legend Arnie ‘Woo Woo’ Ginsburg dead at 93 *Milton Glaser, 91, American graphic designer and illustrator, creator of the I ❤ NY slogan and co-founder of New York magazine, stroke and renal failure.Milton Glaser, designer of iconic ‘I ♥ NY’ logo, dies at age 91 *Bernhard van Haersma Buma, 88, Dutch politician and writer, Mayor of Workum (1962–1970) and Sneek (1970–1993), heart attack.Oud-burgemeester Bernhard van Haersma Buma (88) overleden *Munawar Hasan, 78, Pakistani politician, Emir of Jamaat-e-Islami Pakistan (2009–2014).Former JI ameer Syed Munawar Hassan passes away *Huey (rapper), 32, American rapper (\"Pop, Lock, & Drop It\"), gunshot wounds.\"Pop, Lock, and Drop It\" Rapper Huey Killed In Double Shooting *Madeleine Juneau, 74, Canadian museologist, member of the Congregation of Notre Dame of Montreal.Sœur Madeleine Juneau est décédée *Diana Maddock, Baroness Maddock, 75, British politician, MP (1993–1997), Lord Temporal (since 1997) and President of the Liberal Democrats (1999–2000).Baroness Diana Maddock dead: Liberal Democrat peer dies aged 75, party confirms *Yusuf Memon, Indian gangster, involved in 1993 Bombay bombings, heart attack.1993 serial blasts convict Yusuf Memon dies at Nashik Jail *Rosemarie Müller-Streisand, 96, German church historian and theologian.Müller-Streisand gestorben *William Negri, 84, Italian footballer (Mantova, Bologna, national team).Bologna in lutto, è morto William Negri: il portiere dello scudetto del 1964 *Tony Pidgley, 72, British property developer and financier (Berkeley Group).Berkeley Group chairman Tony Pidgley dies *Taryn Power, 66, American actress (The Count of Monte Cristo, Sinbad and the Eye of the Tiger, Eating), leukemia.Morta Taryn Power, l’addio di Romina: «Non potevo avere una sorella migliore» *Ramon Revilla Sr., 93, Filipino actor (Iyo ang Tondo Kanya ang Cavite, Arrest: Pat. Rizal Alih – Zamboanga Massacre, Exodus: Tales from the Enchanted Kingdom) and politician, Senator (1992–2004), heart failure.Filipino film star and former senator Ramon Revilla Sr. dies at 93 *Julianus Kemo Sunarko, 78, Indonesian Roman Catholic prelate, Bishop of Purwokerto (2000–2016).Selamat Jalan Uskup Emeritus Purwokerto: Mgr. Julianus Kemo Sunarko SJ ===27=== *Belaid Abdessalam, 91, Algerian politician, Prime Minister (1992–1993).Décès de l'ancien chef du gouvernement Belaïd Abdesselam *Pete Carr, 70, American guitarist (LeBlanc and Carr, Muscle Shoals Rhythm Section) and record producer.Legendary Muscle Shoals guitarist Pete Carr dead at 70 *Freddy Cole, 88, American jazz singer and pianist, problems caused by heart disease.Pianist Freddy Cole has died at 88 *Dumitru Comănescu, 111, Romanian supercentenarian, oldest living man (since 2020).Dumitru Comănescu, declarat cel mai vârstnic bărbat al Planetei, a murit, la 111 ani *Linda Cristal, 89, Argentine-American actress (The Perfect Furlough, The High Chaparral, Mr. Majestyk), Golden Globe winner (1959, 1969). *Antonio Cuenco, 84, Filipino politician, member of the House of Representatives (1965–1969, 1987–1998, 2001–2010) and member of the Cebu City Council (since 2019), COVID-19. *Julian Curry, 82, English actor (Rumpole of the Bailey, Sky Captain and the World of Tomorrow, Escape to Victory).Tribute to Shakespeare in Italy Co-Founder Actor Julian Curry *Adrian Devine, 68, American baseball player (Atlanta Braves, Texas Rangers), brain and lung cancer.Former Atlanta Braves reliever Adrian Devine dies at 68 *Tom Finn, 71, American pop jazz singer- songwriter, disc jockey and guitarist (The Left Banke).The Left Banke’s Tom Finn is 2nd Member to Die in 2020 *Giuseppe Matarrese, 86, Italian Roman Catholic prelate, Bishop of Frascati (1989–2009).E' morto il Vescovo emerito Mons. Giuseppe Matarrese *Ilija Petković, 74, Serbian football player (OFK Beograd, Yugoslavia national team) and manager (national team), problems caused by an ulcer and COVID-19.Preminuo Ilija Petković *Nicola Quarta, 92, Italian politician, President of Apulia (1978–1983) and Deputy (1978–1983).Addio a Ninì Quarta, già presidente della Regione e parlamentare della Dc: aveva 93 anni *Mats Rådberg, 72, Swedish country singer and guitarist (Chips).Artisten Mats Rådberg är död *Mihai Romilă, 69, Romanian footballer (Politehnica Iași, Dunărea Galați, national team).O nouă lovitură dură pentru fotbalul ieşean: s-a stins Romilă II *Sander Schnitger, 61, Dutch Air Force general, Commander of the Royal Netherlands Air Force (2012–2016).Voormalig Luchtmacht commandant Sander Schnitger overleden *David Stronach, 89, Scottish archaeologist.Scottish archaeologist David Stronach, famed for intensive Iranian studies, dies at 89 ===28=== *Rudolfo Anaya, 82, American writer (Bless Me, Ultima). *Kim Bridgford, 60, American poet and educator, cancer.Kim Bridgford *Joe Bugel, 80, American football coach (Phoenix Cardinals, Oakland Raiders, Washington Redskins).Joe Bugel Passes Away at 80 *Marián Čišovský, 40, Slovak footballer (Inter Bratislava, Viktoria Plzeň, national team), problems caused by ALS.Ex-Slovakia defender Marian Cisovsky dies at 40 *Klaus Francke, 83, German politician, member of the Bundestag (1976–1998, 2001–2002).Klaus Francke, Vorsitzender des Fördervereins Mahnmal St. Nikolai, im Alter von 83 Jahren verstorben *John Kneebone, 84, New Zealand farming leader, President of Federated Farmers (since 1974).John Thomas (CMG) Kneebone *Louis Mahoney, 81, Gambian-born British actor (Omen III: The Final Conflict, Doctor Who, Captain Phillips) and activist (Equity).Louis Mahoney: Trailblazing actor and activist dies at 81 *Félix de Almeida Mendonça, 92, Brazilian politician, Mayor of Itabuna (1963–1966) and Deputy (1983–1987, 1991–2011), COVID-19.Ex-deputado federal Félix Mendonça morre aos 92 anos, em Salvador *Dame Ingrid Roscoe, 76, English writer, Lord Lieutenant of West Yorkshire (2004–2018).Tributes to long-serving former Lord- Lieutenant of West Yorkshire, Dame Ingrid Roscoe *Shen Jilan, 90, Chinese politician, delegate to the National People's Congress (since 1954) and Director of the All-China Women's Federation (1973–1983), stomach cancer.China's longest-serving lawmaker Shen Jilan passes away at 91 *Mimi Soltysik, 45, American socialist activist and politician, 2016 Socialist Party USA presidential nominee, liver cancer.An Interview With Mimi Soltysik, 1974-2020 *Yu Lan, 99, Chinese actress (A Revolutionary Family). ===29=== *Bode Akindele, 87, Nigerian businessman.Parakoyi Of Ibadanland, Bode Akindele, Dies At 87 *Efraín Barquero, 89, Chilean poet, problems caused by COPD.Fallece el poeta Efraín Barquero a los 89 años *James Paul Churchill, 96, American politician and lawyer, Judge of the U.S. District Court for Eastern Michigan (since 1974). *Gernot Endemann, 77, German actor (Sesamstraße, Shout at the Devil, Der Schatz im Niemandsland).Schauspieler Gernot Endemann ist tot *Jan Krajenbrink, 78, Dutch politician, member of the House of Representatives (1981–1994) and Mayor of Woudenberg (1994–2002).Oud- CDA-Tweede Kamerlid Jan Krajenbrink overleden *Johnny Mandel, 94, American composer (\"Suicide is Painless\", \"Emily\", \"The Shadow of Your Smile\") and conductor, Grammy (1966) and Oscar winner (1965).Johnny Mandel, Composer Who Wrote ‘MASH’ Theme Song, Dies at 94 *Ernesto Marcel, 72, Panamanian boxer, WBA featherweight champion (1972, 1973, 1974).Fallece el boxeador Ernesto “Ñato” Marcel *Benny Mardones, 73, American rock soul singer-songwriter (\"Into the Night\"), problems caused by Parkinson's disease.Benny Mardones, 'Into the Night' Singer-Songwriter, Dead at 73 *Svend Aage Rask, 84, Danish footballer (B 1909, national team).En af de største fynske fodboldspillere er død (death announced on this date) *Carl Reiner, 98, American actor (The Dick Van Dyke Show, Ocean's Eleven, The Jerk), movie director and writer, Grammy winner (1999), nine-time Emmy winner, problems caused by a fall.Carl Reiner, Comedy Legend and ‘Dick Van Dyke Show’ Creator, Dies at 98 *Albert Sulon, 82, Belgian footballer (Club Liège, national team).L'ancien Diable Rouge Albert Sulon est décédé ===30=== *Joe Arenas, 94, American football player (San Francisco 49ers).Omaha University's first NFL player Joe Arenas dies at age 94 *Ivo Banac, 73, Croatian-American historian and politician, member of the Croatian Academy of Sciences and Arts (since 1990), President of the Liberal Party (2003–2004) and MP (2003–2008).Croatie : Disparition de l’historien et homme politique Ivo Banac *Tim Brooks, 72, American professional wrestler (NWA), cancer.Killer Tim Brooks Dies *Ludwig Finscher, 90, German musicologist (Die Musik in Geschichte und Gegenwart).Zum Tod des Musikwissenschaftlers Ludwig Finscher *Dan Hicks, 68, American actor (Evil Dead II, Darkman, Intruder), cancer.‘Evil Dead II’ and ‘Intruder’ Star Danny Hicks Has Passed Away *Aleksandr Kabanov, 72, Russian water polo player, Olympic champion (1972, 1980).Ушел из жизни Великий игрок, тренер Александр Сергеевич Кабанов *Val Peter, 85, American Roman Catholic priest, Executive Director of Boys Town (1985–2005).Longtime Boys Town priest Father Val Peter has died ==Months== * January * February * March * April * May * June * July * August * September * October * November * December ==Related pages== * List of deaths due to COVID-19 * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *06 Deaths",
 "title": "Deaths in June 2020"
}