{
 "id": "755489",
 "text": "This is a list of people who have served as Governor of Tennessee. ==Southwest Territory== The Territory South of the River Ohio, commonly called the Southwest Territory, was formed in 1790 from lands ceded by North Carolina to the United States government. The territory was admitted to the Union as the State of Tennessee in 1796. ; Parties # Picture Governor Term of Office Party State of Birth Occupation Notes 1 William Blount September 20, 1790 - March 30, 1796 Democratic-Republican NC Land speculator Appointed governor by President George Washington ==State of Tennessee== ; Parties #Numbering of the Governors was deduced from the fact that the document at www.tn.gov/sos/bluebook/11-12/2_ExecutiveBranch.pdf identifies Bill Haslam as Tennessee's 49th Governor. Governors who served multiple non-consecutive terms have their numbers repeated in italics in subsequent terms. Picture Governor Term of Office Party State of Birth Occupation Lt. Governor Notes 2 John Sevier March 30, 1796 - September 23, 1801 Democratic-Republican VA Soldier, farmer None 3 Archibald Roane September 23, 1801 - September 23, 1803 Democratic-Republican PA Lawyer 4 John Sevier September 23, 1803 - September 20, 1809 Democratic-Republican VA Soldier, farmer 5 Willie Blount September 20, 1809 - September 27, 1815 Democratic-Republican NC Lawyer, planter 6 Joseph McMinn September 27, 1815 - October 1, 1821 Democratic-Republican PA Merchant 7 William Carroll October 1, 1821 - October 1, 1827 Democratic-Republican PA Merchant, soldier 8 Sam Houston October 1, 1827 - April 16, 1829 Democratic-Republican VA Lawyer 9 William Hall April 16, 1829 - October 1, 1829 Democratic NC Planter, soldier 10 William Carroll October 1, 1829 - October 12, 1835 Democratic PA Merchant, soldier 11 Newton Cannon October 12, 1835 - October 14, 1839 Whig NC Planter 12 James K. Polk October 14, 1839 - October 15, 1841 Democratic NC Lawyer, politician 13 James C. Jones October 15, 1841 - October 14, 1845 Whig TN Lawyer 14 Aaron V. Brown October 14, 1845 - October 17, 1847 Democratic VA Lawyer 15 Neill S. Brown October 17, 1847 - October 16, 1849 Whig TN Lawyer 16 William Trousdale October 16, 1849 - October 16, 1851 Democratic NC Lawyer 17 William B. Campbell October 16, 1851 - October 17, 1853 Whig TN Lawyer 18 Andrew Johnson October 17, 1853 - November 3, 1857 Democratic NC Tailor, lawyer, politician 19 Isham G. Harris November 3, 1857 - March 12, 1862 Democratic TN Lawyer, politician Harris continued issuing edicts as governor throughout the Civil War. Confederate Tennesseans elected Robert L. Caruthers as Harris's successor in 1863, but Caruthers never took office. 20 Andrew Johnson March 12, 1862 - March 4, 1865 Unionist/Military NC Lawyer, politician — Edward H. East March 4, 1865 - April 5, 1865 Republican TN Lawyer East was Tennessee Secretary of State from 1862–1865, appointed by Andrew Johnson, the military governor of the state under Union occupation during the Civil War. After Johnson was inaugurated as Vice President of the United States on March 4, 1865, East became the Acting Governor of Tennessee until William G. Brownlow, the \"elected\" governor of Tennessee, was inaugurated on April 5, 1865. The official Tennessee Blue Book does not include East in its list of former governors. 21 William G. Brownlow April 5, 1865 - February 25, 1869 Republican VA Editor, preacher 22 DeWitt Clinton Senter February 25, 1869 - October 10, 1871 Republican TN Lawyer 23 John C. Brown October 10, 1871 - January 18, 1875 Democratic TN Lawyer 24 James D. Porter January 18, 1875 - February 16, 1879 Democratic TN Lawyer, educator 25 Albert S. Marks February 16, 1879 - January 17, 1881 Democratic KY Lawyer, judge 26 Alvin Hawkins January 17, 1881 - January 15, 1883 Republican KY Lawyer, judge 27 William B. Bate January 15, 1883 - January 17, 1887 Democratic TN Lawyer, politician 28 Robert Love Taylor January 17, 1887 - January 19, 1891 Democratic TN Lawyer, politician 29 John P. Buchanan January 19, 1891 - January 16, 1893 Democratic TN Farmer 30 Peter Turney January 16, 1893 - January 21, 1897 Democratic TN Lawyer, judge 31 Robert Love Taylor January 21, 1897 - January 16, 1899 Democratic TN Lawyer, politician 32 Benton McMillin January 16, 1899 - January 19, 1903 Democratic KY Lawyer, diplomat 33 James B. Frazier January 19, 1903 - March 21, 1905 Democratic TN Lawyer, politician 34 John I. Cox March 21, 1905 - January 17, 1907 Democratic TN Lawyer 35 Malcolm R. Patterson January 17, 1907 - January 26, 1911 Democratic AL Lawyer, judge 36 Ben W. Hooper January 26, 1911 - January 17, 1915 Republican TN Lawyer 37 Thomas C. Rye January 17, 1915 - January 15, 1919 Democratic TN Lawyer, judge 38 Albert H. Roberts January 15, 1919 - January 15, 1921 Democratic TN Lawyer, judge 39 Alfred A. Taylor January 15, 1921 - January 16, 1923 Republican TN Lawyer 40 Austin Peay January 16, 1923 - October 3, 1927 Democratic KY Lawyer Peay was the only Governor of Tennessee to die in office, and was succeeded by Lieutenant Governor Henry Horton. 41 Henry Hollis Horton October 3, 1927 - January 17, 1933 Democratic AL Lawyer, farmer 42 Hill McAlister January 17, 1933 - January 15, 1937 Democratic TN Lawyer 43 Gordon Browning January 15, 1937 - January 16, 1939 Democratic TN Lawyer, judge 44 Prentice Cooper January 16, 1939 - January 16, 1945 Democratic TN Lawyer 45 Jim Nance McCord January 16, 1945 - January 16, 1949 Democratic TN Editor 46 Gordon Browning January 16, 1949 - January 15, 1953 Democratic TN Lawyer, judge Walter M. Haynes 47 Frank G. Clement January 15, 1953 - January 19, 1959 Democratic TN Lawyer Jared Maddux 48 Buford Ellington January 19, 1959 - January 15, 1963 Democratic MS Farmer William D. Baird 49 Frank G. Clement January 15, 1963 - January 16, 1967 Democratic TN Lawyer James L. Bomar, Jr. Jared Maddux 50 Buford Ellington January 16, 1967 - January 16, 1971 Democratic MS Farmer Frank Gorrell 51 Winfield Dunn January 16, 1971 - January 18, 1975 Republican MS Dentist John S. Wilder 52 Ray Blanton January 18, 1975 - January 17, 1979 Democratic TN Farmer, businessman 53 Lamar Alexander January 20, 1979 - January 17, 1987 Republican TN Lawyer, politician 54 Ned McWherter January 17, 1987 - January 21, 1995 Democratic TN Businessman 55 Don Sundquist January 21, 1995 - January 18, 2003 Republican IL Businessman 56 Phil Bredesen January 18, 2003 - January 15, 2011 Democratic NJ Businessman Ron Ramsey 57 Bill Haslam January 15, 2011 - January 19, 2019 Republican TN Businessman Randy McNally 58 Bill Lee January 19, 2019 - present Republican TN Businessman ==References== *",
 "title": "List of governors of Tennessee"
}