{
 "id": "75543",
 "text": "Lose My Breath Cover Singel Destiny's Child from the album Destiny Fulfilled Released October 17, 2004 Genre R&B;, dance-pop Length 3:33 (radio) 4:01 (album) Label Columbia Records Writer Beyoncé Knowles, Kelly Rowland, Michelle Williams, Rodney Jerkins, LaShawn Daniels, Fred Jerkins III, Sean Garrett, Shawn Carter Producer Beyoncé Knowles, Darkchild Destiny's Child singles chronology Nasty Girl (2002r.) Lose My Breath Soldier (2004r.) Destiny Fulfilled track listing Lose My Breath (1) Soldier (2) #1's track listing Jumpin' Jumpin' (6) Lose My Breath (7) Say My Name (8) \"Lose My Breath\" is an R&B;/dance-pop song written by Beyoncé Knowles, Kelly Rowland, Michelle Williams, Rodney Jerkins, LaShawn Daniels, Fred Jerkins III, Sean Garrett, and Shawn \"Jay-Z\" Corey Carter for Destiny's Child's fifth and last studio album, Destiny Fulfilled (2004). It was produced by Knowles and Jerkins and released as the album's lead single in autumn 2004. The single was released with \"Why You Actin'\" as the b-side. The song reached number one in Belgium, China, India, Israel, Ireland, and Switzerland and entered the top ten on the majority of the charts it appeared on, making it one of Destiny's Child most successful single releases. The song was also nominated for a Grammy Award for Best R&B; Vocal Performance by a Duo Or Group. ==Charts== {|class=\"wikitable\" Chart (2004) Peak position Argentinian Singles Charts 4 Australian ARIA Charts 3 Austrian Singles Charts 8 Belgium Official Chart 1 Brazil Hot 100 Charts 8 Canadian Singles Chart 16 Chilean Singles Charts 3 Chinese Singles Charts 1 Danish Singles Charts 4 Dutch Singles Chart 4 Finnish Singles Charts 3 French Singles Charts 8 German Singles Charts 3 Greece Singles Charts 6 Indian Singles Charts 1 Israel Singles Charts 1 Irish Singles Charts 1 == Credits and personnel == * Lead vocals: Beyoncé Knowles, Kelly Rowland, Michelle Williams * Vocal production - Beyoncé Knwoles, Sean Garrett, Kelly Rowland * Recorded by Jeff Villanueva, Jim Caruna at Sony Music Studios, NYC * Audio mixing - Tony Maserati * Mastered by Tom Coyne * Introduction by Michigan Marching Band Drumline (http://mmb.music.umich.edu/sections/drumline/sounds/Cadence_Series_2k2.mp3 ) == Formats and tracklistings == These are the formats and track listings of major single releases of \"Lose My Breath\". * Maxi CD single # \"Lose My Breath\" (Album Version) # \"Lose My Breath\" (Maurice's Nu Soul Mix) # \"Lose My Breath\" (Paul Johnson's Club Mix) # \"Why You Actin'\" * US CD single # \"Lose My Breath\" (Album Version) # \"Game Over\" == Official versions == * \"Lose Me Breath\" (Radio Mix) * \"Lose Me Breath\" (Radio Mix 2) * \"Lose My Breath\" (Instrumental) * \"Lose My Breath\" (Acapella) * \"Lose My Breath\" (Extended Mix) * \"Lose Me Breath\" (Remix) (feat Khia & Chingy) * \"Lose Me Breath\" (Remix) (feat Wise) * \"Lose My Breath\" (Inhale...Breath Radio Remix) * \"Lose My Breath\" (Exhale...Breath Club Remix) * \"Lose My Breath\" (Burn The House Down Mix) * \"Lose My Breath\" (Jones & Moss Main Radio Mix) * \"Lose My Breath\" (Jones & Cabrera Vibelicious Bring Da House Edit) * \"Lose My Breath\" (UK DJ 12\" Demo) * \"Lose Me Breath\" (Hex Hector Mixshow Edit) * \"Lose Me Breath\" (Mac Quayle Dream Club Mix) * \"Lose My Breath\" (Maurice's Nu Soul Remix) * \"Lose My Breath\" (Paul Johnson Club Mix) * \"Lose My Breath\" (Peter Rauhofer Breathless Mix) * \"Lose My Breath\" (Peter Rauhofer Breathless Dub) * \"Lose My Breath\" (MGM Mix) * \"Lose My Breath\" (Seamus Haji Remix) * \"Lose My Breath\" (Joe Smooth Strings Of Life Mix) * \"Lose My Breath\" (Junior Vasquez Remix) * \"Lose My Breath\" (Riley York vs Chris Cox Drum Revenge Mix) ==References== Category:Destiny's Child songs Category:2004 songs",
 "title": "Lose My Breath"
}