{
 "id": "755501",
 "text": "The Governor of Wisconsin is the head of the executive branch of Wisconsin's state government Wisconsin Constitution article V, ยง 1 and the commander-in- chief of the state's army and air forces.Wisconsin Constitution article V, ยง 4 ==List== ; Parties # Governor Took office Left office Party Lt. GovernorVacancies in the office of the lieutenant governor are only listed if they lasted for the entire term. For a full list of vacancies, see List of lieutenant governors of Wisconsin. Term(s) The fractional terms of some governors are not to be understood absolutely literally; rather, they are meant to show single terms during which multiple governors served, due to resignations, deaths and the like. 1 Nelson Dewey June 7, 1848 January 5, 1852 Democratic John E. Holmes 2 Samuel W. Beall 2 Leonard J. Farwell January 5, 1852 January 2, 1854 Whig Timothy Burns Died in office. 1 3 William A. Barstow January 2, 1854 March 21, 1856 Democratic James T. Lewis Arthur MacArthur Sr. 4 Arthur MacArthur Sr. March 21, 1856 March 25, 1856 Democratic vacant vacant 5 Coles Bashford March 25, 1856 January 4, 1858 Republican Arthur MacArthur Sr. 6 Alexander W. Randall January 4, 1858 January 6, 1862 Republican Erasmus D. Campbell 2 Butler G. Noble 7 Louis P. Harvey January 6, 1862 April 19, 1862 Republican Edward Salomon 8 Edward Salomon April 19, 1862 January 4, 1864 Republican vacant vacant As lieutenant governor, succeeded to the governorship, and served the rest of the unexpired term. 9 James T. Lewis January 4, 1864 January 1, 1866 Republican Wyman Spooner 1 10 Lucius Fairchild January 1, 1866 January 1, 1872 Republican Wyman Spooner 3 Thaddeus C. Pound 11 Cadwallader C. Washburn January 1, 1872 January 5, 1874 Republican Milton H. Pettit 1 12 William Robert Taylor January 5, 1874 January 3, 1876 Democratic Charles D. Parker 1 13 Harrison Ludington January 3, 1876 January 7, 1878 Republican Charles D. Parker 1 14 William E. Smith January 7, 1878 January 2, 1882 Republican James M. Bingham 2 15 Jeremiah McLain Rusk January 2, 1882 January 7, 1889 Republican Sam S. Fifield 3 During Rusk's first term, the Wisconsin Constitution was amended to say that all elections of state and county officers would henceforth take place in even-numbered years. By the provisions of the amendment, the terms of all officials who would have left office in 1884, including Rusk, were extended by one year. George W. Ryland 16 William D. Hoard January 7, 1889 January 5, 1891 Republican George W. Ryland 1 17 George W. Peck January 5, 1891 January 7, 1895 Democratic Charles Jonas 2 18 William H. Upham January 7, 1895 January 4, 1897 Republican Emil Baensch 1 19 Edward Scofield January 4, 1897 January 7, 1901 Republican Emil Baensch 2 Jesse Stone 20 Robert M. La Follette, Sr. January 7, 1901 January 1, 1906 Republican Jesse Stone Resigned to take an elected seat in the United States Senate. James O. Davidson 21 James O. Davidson January 1, 1906 January 2, 1911 Republican vacant William D. Connor John Strange 22 Francis E. McGovern January 2, 1911 January 4, 1915 Republican Thomas Morris 2 23 Emanuel L. Philipp January 4, 1915 January 3, 1921 Republican Edward F. Dithmar 3 24 John J. Blaine January 3, 1921 January 3, 1927 Republican George F. Comings 3 Henry A. Huber 25 Fred R. Zimmerman January 3, 1927 January 7, 1929 Republican Henry A. Huber 1 26 Walter J. Kohler Sr. January 7, 1929 January 5, 1931 Republican Henry A. Huber 1 27 Philip La Follette January 5, 1931 January 2, 1933 Republican Henry A. Huber 1 28 Albert G. Schmedeman January 2, 1933 January 7, 1935 Democratic Thomas J. O'Malley 1 29 Philip La Follette January 7, 1935 January 2, 1939 Wisconsin Progressive Thomas J. O'Malley 2 Henry A. Gunderson Resigned to take an appointment to the state tax commission. Herman L. Ekern 30 Julius P. Heil January 2, 1939 January 4, 1943 Republican Walter S. Goodland 2 -- Orland S. Loomis did not take office Wisconsin Progressive Walter S. Goodland -- Loomis was elected in the 1942 election, but died before taking office. Per a ruling of the Wisconsin Supreme Court Goodland, who had been re-elected lieutenant governor in the same election, served as governor for the entire term. 31 Walter S. Goodland January 4, 1943 March 12, 1947 Republican vacant vacant Oscar Rennebohm 32 Oscar Rennebohm March 12, 1947 January 1, 1951 Republican vacant vacant George M. Smith 33 Walter J. Kohler Jr. January 1, 1951 January 7, 1957 Republican George M. Smith 3 Warren P. Knowles 34 Vernon W. Thomson January 7, 1957 January 5, 1959 Republican Warren P. Knowles 1 35 Gaylord Nelson January 5, 1959 January 7, 1963 Democratic Philleo Nash 2 Warren P. Knowles 36 John W. Reynolds Jr. January 7, 1963 January 4, 1965 Democratic Jack B. Olson 1 37 Warren P. Knowles January 4, 1965 January 4, 1971 Republican Patrick J. Lucey 3 Jack B. Olson 38 Patrick J. Lucey January 4, 1971 July 6, 1977 Democratic Martin J. Schreiber As per a 1967 amendment to the Wisconsin Constitution, Lucey's first term was the first gubernatorial term to last 4 years Resigned to become Ambassador to Mexico 39 Martin J. Schreiber July 6, 1977 January 3, 1979 Democratic vacant vacant 40 Lee S. Dreyfus January 3, 1979 January 3, 1983 Republican Russell A. Olson 1 41 Anthony S. Earl January 3, 1983 January 5, 1987 Democratic James T. Flynn 1 42 Tommy Thompson January 5, 1987 February 1, 2001 Republican Scott McCallum Resigned to become United States Secretary of Health and Human Services 43 Scott McCallum February 1, 2001 January 6, 2003 Republican Margaret A. Farrow As lieutenant governor, served as governor for remainder of unexpired term. 44 Jim Doyle January 6, 2003 January 3, 2011 Democratic Barbara Lawton 2 45 Scott Walker January 3, 2011 January 7, 2019 Republican Rebecca Kleefisch 2 46 Tony Evers January 7, 2019 Incumbent Democratic Mandela Barnes 1 Evers' first term expires in January 2023. ==Notes== ==References== *",
 "title": "List of governors of Wisconsin"
}