{
 "id": "755574",
 "text": "COVID-19 testing can help find the SARS-CoV-2 virus. There are two types of test; one can find the virus (i.e. Polymerase chain reaction, also called PCR) and the other that can find antibodies produced in response to infection. An accurate mortality rate of the disease and the level of herd immunity in the population can be found from the results of these tests. However, it is still not known how long immunity will last, and how effective it will be. Due to limited testing, as of March 2020, no countries had reliable data of the virus. ==Test methods== File:Infektionsschutzzentrum im Rautenstrauch-Joest- Museum, Köln-6313 (cropped).jpg|Demonstration of a nose swab (nasopharyngeal swab) for COVID‑19 testing File:Infektionsschutzzentrum im Rautenstrauch- Joest-Museum, Köln-6306 (cropped).jpg|Demonstration of a throat swab for COVID‑19 testing File:Cycler offen.JPG|A PCR machine ==Detection Timing== # Viral burden (the amount of virus) measured in the respiratory tract declines after the start of illness. referenced * CDC unpublished data * * * * # At this time, replication-competent virus has not been successfully cultured more than nine days after the illness. referenced * CDC unpublished data * * # As isolating replication-competent virus lowers, anti-SARS-CoV-2 IgM and IgG can be found in an increasing number of persons recovering from infection. referenced # Attempts to grow the virus from upper respiratory specimens have been largely unsuccessful # Following recovery from the illness, many patients no longer have detectable viral RNA in upper respiratory. referenced * CDC unpublished data * # No clear link has been seen between length of illness and length of recovery. referenced * CDC unpublished data * # Infectious virus has not been grown from urine or feces; referenced * CDC unpublished data * * these possible sources have a very small risk of spreading infection. ==WHO methods== Diagnostic tests accepted by the WHO for procurement Date listed Product name Manufacturer 3 April 2020 Cobas SARS- CoV-2 qualitative assay for use on the cobas 6800/8800 Systems Roche Molecular Systems 7 April 2020 Coronavirus (COVID-19) genesig rtPCR assay Primerdesign 9 April 2020 Abbott Realtime SARS-CoV-2 Abbott Molecular 24 April 2020 PerkinElmer SARS-CoV-2 Real-time RT-PCR Assay SYM-BIO LiveScience As of 7 April 2020, the WHO had accepted two diagnostic tests under the Emergency Use Listing procedure (EUL) for use during the COVID‑19 pandemic. Both in vitro diagnostics, the tests are genesig Real-Time PCR Coronavirus (COVID‑19) created by Primerdesign, and cobas SARS-CoV-2 Qualitative assay for use on the cobas® 6800/8800 Systems by Roche Molecular Systems. Approval means that these tests can also be given away by the United Nations. ==Accuracy== In March 2020 ChinaHeartbreak in the Streets of Wuhan reported problems with accuracy in their test kits. In the United States, the test kits developed by the CDC had \"flaws\". 80% of test kits the Czech Republic purchased from China gave wrong results. ==Inventions== A group of scientists from Hokkaido University developed an antibody test that could detect avian flu antibodies in only 20 minutes. They said their test could be changed to detect SARS-CoV-2. == Related pages == * Acute respiratory distress syndrome (ARDS) * Cystic Fibrosis (CF) * Alveolus (lung component) * HIV Drug Resistance Database ==References== Category:COVID-19 pandemic",
 "title": "COVID-19 testing"
}