{
 "id": "755914",
 "text": "Malayala Manorama is a daily newspaper in Malayalam published from Kottayam, Kerala, India by the Malayala Manorama Company Limited.International Federation of Audit Bureaux of Circulations and ABC India (National Newspapers Total Circulation-2018) Download Audit Bureau of Circulations (ABC) (January- June 2013) According to World Association of Newspapers, as of 2016, it was the fourteenth most circulated newspaper in the world.Sangeeta Tanwar. IRS 2010 (Q1) afaqs! Dailies in Kerala lose readers after gaining in the last round == Chief Editors == * Kandathil Varghese Mappillai (1890 - 1904) * K. C. Mammen Mappillai (1904 - 1938, 1947 - 1954) * K. M. Cherian (1954 - 1973) * K. M. Mathew (1973 - 2010) * Mammen Mathew (2010–present) ==Printing centres== * Kottayam, Kozhikode, Thiruvananthapuram, Kochi, Thrissur, Kannur, Kollam, Palakkad, Malappuram, Pathanamthitta, Alappuzha, Mangalore, Bangalore, Chennai, Mumbai, Delhi, Dubai, Manama and Doha ==Subsidiaries== Name Frequency Language Type Arogyam Monthly Malayalam Health Magazine Balarama Weekly Malayalam Children's Magazine Balarama Amar Chitra Katha Fortnightly Malayalam Comics Balarama Digest Weekly Malayalam Children's Magazine Bhashaposhini Monthly Malayalam Literary Review Magazine Kalikkudukka Weekly Malayalam Children's Magazine Karshakasree Monthly Malayalam Agriculture and Gardening Magazine FastTrack Monthly Malayalam Automobile Magazine Magic Pot Weekly English Children's Magazine The Man Monthly English Men's Lifestyle Magazine Manorama Weekly Weekly Malayalam General Interest Magazine Sampadhyam Monthly Malayalam Personal Finance and Investment Magazine Smart Life Monthly English Lifestyle and Health Magazine Tell Me Why Monthly English Children's Magazine Thozhil Veedhi Weekly Malayalam Career Guidance Magazine Livingetc Monthly English Interior Design Magazine Manorama Traveller Monthly Malayalam Travel Magazine Vanitha (Hindi) Fortnightly Hindi Women's Magazine Vanitha Fortnightly Malayalam Women's Magazine Vanitha Pachakam Monthly Malayalam Food Magazine Veedu Monthly Malayalam Architecture and Interior Design Magazine National Geographic Kids India Monthly English Children's Magazine Watch Time India Monthly English Luxury Watches and Trends Magazine The Week Weekly English News Magazine Manorama Max OTT Platform Malayalam News, Shows, and Movies Manorama News Television Channel Malayalam News and Current Affairs Mazhavil Manorama Television Channel Malayalam Entertainment Radio Mango 91.9 Radio Station Malayalam Music and Entertainment Onmanorama News Portal English News and General Interest ManoramaOnline News Portal Malayalam News and General Interest ==References== Category:Indian news websites Category:Newspapers published in India",
 "title": "Malayala Manorama"
}