{
 "id": "756078",
 "text": "Messenger RNA vaccines or mRNA vaccines is a type of vaccine that protects the body from certain viruses. Like all vaccines, mRNA vaccines increase the body's immunity so the patient is less likely to catch an infectious disease. ==How mRNA vaccines work== Almost all cells make and use their own mRNA. They use it to make proteins. Each mRNA is like a blueprint or recipe for one kind of protein. Most vaccines work by taking something from a harmful germ and putting it inside the patient's body without any parts of the germ that cause harm. Then the patient's own cells learn to identify the germ using its other parts. Then, if a living germ ever attacks the body, the patient's cells fight it off without having to learn what it is first. Some vaccines do this by putting a dead, weak germ inside the patient's body. Other vaccines do this by putting lots of proteins that the germ makes inside the body but not any germs themselves. mRNA vaccines work by putting mRNA inside the body instead of protein. Then the body uses the mRNA to make protein itself. mRNA vaccines can be injected into the skin or muscle with a needle. Some mRNA vaccines can be inhaled into the patient's nose. Anti-cancer mRNA vaccines can be injected into the tumor -- these vaccines are made to have the body make its own cells attack and kill cancer cells. ==Safety== Scientists think mRNA vaccines are safer than other vaccines because it is easy to make the mRNA that makes only specific proteins of a germ, while other types of vaccines may have harmful parts of the germ that can cause a bad effect on the body. This way, the mRNA does not make whole germs inside the body. Some proteins can be harmful to the body, but mRNA itself is not. ==Invention== The first mRNA vaccine was used in mice around 1990 but it was a long time before large numbers of scientists started to work making mRNA vaccines. The first mRNA vaccines used on people were made to work against cancer in the late 1990s. Doctors found out which proteins only tumor cells make and used mRNA for those proteins as a vaccine so the patient's own immune systems would kill some of the tumor cells. ==References== Category:Virology Category:Immunization",
 "title": "RNA vaccine"
}