{
 "id": "756562",
 "text": "The Prime Minister of Myanmar is the head of the government of Myanmar and the chief executive authority of the national government. The prime minister is also the commander in chief of the Armed Forces. The office ended on 30 March 2011, according to the current Constitution of Myanmar (adopted in 2008). It said that the president is both the head of state and head of government. however, the military coup of 2021 put the Chairman of the State Administration Council into the highest position. He is the de facto head of government, and the president is now the nominal head of state. The office was created again on 1 August 2021 with Min Aung Hlaing forming a caretaker government. ==Prime ministers / de facto heads of government of Burma/Myanmar (1948–present)== (Dates in italics indicate de facto continuation of office) Portrait Name Term of office Political party Took office Left office Time in office ===Union of Burma (1948–1974)=== U Nu 4 January 1948 12 June 1956 Anti-Fascist People's Freedom League Ba Swe 12 June 1956 1 March 1957 Anti-Fascist People's Freedom League U Nu 1 March 1957 29 October 1958 Anti-Fascist People's Freedom League Ne Win 29 October 1958 4 April 1960 Military U Nu 4 April 1960 2 March 1962 Union Party Ne Win 2 March 1962 4 March 1974 Military / Burma Socialist Programme Party ===Socialist Republic of the Union of Burma (1974–1988)=== Sein Win 4 March 1974 29 March 1977 Burma Socialist Programme Party Maung Maung Kha 29 March 1977 26 July 1988 Burma Socialist Programme Party Tun Tin 26 July 1988 18 September 1988 Burma Socialist Programme Party ===Union of Burma/Myanmar (1988–2011)=== Saw Maung 21 September 1988 23 April 1992 Military Than Shwe 23 April 1992 25 August 2003 Military Khin Nyunt 25 August 2003 18 October 2004 Military Soe Win 19 October 2004 12 October 2007 Military Thein Sein 12 October 2007 30 March 2011 Military * * * Union Solidarity and Development Party 11 ===Republic of the Union of Myanmar (2011–present)=== Aung San Suu Kyi 6 April 2016 1 February 2021 National League for Democracy Min Aung Hlaing 1 February 2021 * * * 1 August 2021 1 August 2021 * * * Incumbent Military ==Notes== ==References==",
 "title": "Prime Minister of Myanmar"
}