{
 "id": "756915",
 "text": "Jericho Brown (born Nelson Demery III; born April 14, 1976) is an American poet. In 2020, he was awarded a Pulitzer Prize for Poetry.2020 Pulitzer Prize Winners Announced - Full List : NPREmory Professor Jericho Brown Wins Pulitzer Prize for Poetry ==Life== Brown was raised in Shreveport, Louisiana. He graduated from Dillard University in 1995. He later went to graduate school. He got a Master of Fine Arts from the University of New Orleans and a Ph.D from the University of Houston. Brown was a teaching fellow in the English department at the University of Houston from 2002 to 2007, a visiting professor at San Diego State University's MFA program in spring 2009, and an assistant professor of English at the University of San Diego. He has also taught at numerous conferences and workshops, including the Iowa Summer Writing Festival at the University of Iowa. Now he is an associate professor of English and director of the Creative Writing Program at Emory University in Atlanta, Georgia. His poems have appeared in many magazines. Some of the magazines where his poetry has been published are The Iowa Review, jubilat, The Nation, New England Review, The New Republic, Oxford American, The New Yorker, Enkare Review and The Best American Poetry. He serves as an Assistant Editor at Callaloo. His first book, Please won the American Book Award. His book of poetry, The New Testament, (Copper Canyon Press, 2014) won the 2015 Anisfield-Wolf Book Award. The Pulitzer Prizes' home-page calls The Tradition \"A collection of masterful lyrics that combine delicacy with historical urgency in their loving evocation of bodies vulnerable to hostility and violence.\" https://www.pulitzer.org/prize-winners-by-category/224 ==Style== The poet has invented a new poetry form. He calls it \"duplex.\" In a duplex poem, first there is a couplet. Then the second line is repeated with a new line. This is \"repeated and a new line is added, and then repeated until there are seven couplets of nine to eleven syllables each. ... The first line is [repeated as] the fourteenth line.\" Gutting The Sonnet: A Conversation With Jericho Brown - The Rumpus.net ==Quotations== “I’m more than a conqueror, bigger / Than bravery. I don’t march. I’m the one who leaps.” \"A poem is a gesture toward home.\" ==Awards== * 2020 Pulitzer Prize * 2016 Guggenheim Fellowship * 2015 Anisfield-Wolf Book Award * 2015 Thomas-Gunn Award The Thom Gunn Award for Gay Poetry | The Publishing Triangle * 2011 National Endowment for the Arts Fellowship for Poetry * 2009 American Book Award for Please * 2009 Whiting Award * 2009–2010 fellowship at the Radcliffe Institute for Advanced Study at Harvard University * Kraków Poetry Seminar in Poland, travel fellowships * Cave Canem Fellowship * Bread Loaf Writer's Conference two scholarships ==Works== ; Books * * * ; Poems * , Oxford American, October 2014 * \"Elegy\", Rumpus, May 2009 * , AGNI, March 2007 * \"To Be Seen\", The Missouri Review == Related pages == *List of poets from North America ==References== ==Other websites== * * 'Love in Contemporary American Gay Male Poetry in the Works of Richard Siken, Eduardo C Corral and Jericho Brown' Simeon Kronenberg, Cordite Poetry Review (2015). * \"Profile at The Whiting Foundation\" * \"Danger by Desire: A Conversation between Jericho Brown & James Allen Hall\", Boxcar Poetry Review * \"Naming Each Place\" * Until the Fulcrum Tips: A Conversation with Rita Dove and Jericho Brown, The Best American Poetry * \"Jericho Brown Presents The Phantastique 5\", The Best American Poetry * https://www.atlantamagazine.com/news-culture-articles/jericho-brown-reflects-on-winning-the-pulitzer-prize-and-the-black-poets-who-came-before-him/ Category:1976 births Category:African-American writers Category:American poets Category:Gay men Category:Living people Category:LGBT African-Americans Category:LGBT people from Louisiana Category:LGBT poets Category:Pulitzer Prize winners Category:Writers from Shreveport, Louisiana Category:Emory University faculty",
 "title": "Jericho Brown"
}