{
 "id": "757242",
 "text": "Douglas Allen Collins (born August 16, 1966) is an American Republican lawyer and politician who has been the 12th and current United States Secretary of Veterans Affairs since 2025. He was the United States Representative from Georgia's 9th congressional district from 2013 to 2021. Before, he was a member of the Georgia House of Representatives from 2007 to 2013. Collins was also a chaplain in the U.S. Air Force Reserve with the rank of colonel. In 2020, he announced his candidacy for the United States Senate, running against incumbent Republican Senator Kelly Loeffler. He came in last place, losing to both Loeffler and to Democrat Raphael Warnock. After his Senate campaign loss, he left politics and became a legal counsel for Donald Trump during his post- presidency. In November 2024, President-elect Trump nominated Collins to serve as his United States Secretary of Veterans Affairs. ==Early life== Collins was born in Gainesville, Georgia. He studied at North Georgia College & State University. He later studied at New Orleans Baptist Theological Seminary. Collins also earned his Juris Doctor from Atlanta's John Marshall Law School in 2007. In the late 1980s, Collins served two years in the United States Navy as a navy chaplain. After the September 11 attacks, Collins joined the United States Air Force Reserve Command, where he was a chaplain (lieutenant colonel). He also served for five months in 2008 during the Iraq War. From 1994 to 2005, Collins was a senior pastor at Chicopee Baptist Church. He also worked as a lawyer. ==Georgia House of Representatives== Collins served three terms in the Georgia House of Representatives, representing Georgia's 27th district from 2007 to 2013. No one ran against him for reelection in 2008 and 2010. In 2011, Collins sponsored a plan proposed by Georgia governor Nathan Deal to reform Georgia's HOPE Scholarship program. In 2012, he supported fixing Georgia's constitution to create a statewide commission expanding charter schools. During his time in the state legislator, he was in favor of the death penalty, against physician-assisted suicide and abortion. He was also against laws that were meant to help fight against climate change. ==U.S. House of Representatives== In 2012, Collins ran for Congress in the 9th congressional district. He finished first in the primary with 42 percent of the total. He later won the run-off primary with 55 percent of the vote. In the general election, Collins beat Democrat Jody Cooley 76 percent to 24 percent. No one ran against him in 2016 for re-election and in 2018 he beat Democratic Josh McCall. Collins called himself a \"[strong] Trump ally.\" He strongly defended President Donald Trump during his impeachment inquiry over the Trump-Ukraine scandal. In December 2020, Collins was one of 126 Republican members of the House of Representatives who signed in support of Texas v. Pennsylvania, a lawsuit filed at the United States Supreme Court challenging the results of the 2020 presidential election, in which former Vice President Joe Biden beat Trump. Collins was against Affordable Care Act, also known as Obamacare. He called it an \"experiment [that] has continued to fail America\". Collins said the passage of the Tax Cuts and Jobs Act of 2017 would not cause anyone losing health coverage. ==2020 U.S. Senate election== In January 2020, Collins announced his candidacy for the United States Senate. He ran in the special election held in November 2020 to finish the final two years of the term of retiring senator Johnny Isakson. He ran against incumbent senator Kelly Loeffler. President Donald Trump had supported Collins as a replacement for Isakson. Several senior Republican senators, such as Mitch McConnell, supported Loeffler over Collins. Collins finished third in the primary, losing to Loeffler and Democratic pastor Raphael Warnock, who would go on to beat Loeffler in the general election. When Collins and Donald Trump lost their races in Georgia, they both made claims about fraud in the Georgia elections. Georgia's Republican secretary of state Brad Raffensperger called Collins a \"liar\" for his statements. ==U.S. Secretary of Veterans Affairs== ===Nomination=== On November 24, 2024, President-elect Donald Trump announced his plans to nominate Collins to serve as the next United States Secretary of Veterans Affairs during his second administration. He appeared before the Senate Committee on Veterans' Affairs on January 21, 2025. The committee advanced his nomination in a 18-1 vote on January 23. On February 4, the Senate confirmed him by a 77-23 vote. ===Tenure=== On February 5, 2025, Collins was sworn into office by associate justice Clarence Thomas as the 12th secretary of veterans affairs. On February 6, a total of 26 Democratic Senators signed an open letter sent to Collins asking the VA secretary to stop providing the Department of Government Efficiency (DOGE) with access to confidential Veteran records.https://www.blumenthal.senate.gov/newsroom/press/release/blumenthal- senate-democrats-demand-va-secretary-collins-step-up-and-defend-veterans- private-information-from-elon-musk ==Personal life== Collins married Lisa Jordan, in 1988. She is a retired fifth grade teacher. The couple have three children. Collins is a practicing Southern Baptist. ==References== ==Other websites== * Congressman Doug Collins official U.S. House site * Doug Collins for Congress * * * Category:1966 births Category:Living people Category:United States representatives from Georgia Category:State legislators of the United States Category:Republican Party (United States) politicians Category:Military people from Georgia (U.S. state) Category:Lawyers from Georgia (U.S. state) Category:American colonels Category:United States Secretaries of Veterans Affairs",
 "title": "Doug Collins (politician)"
}