{
 "id": "757348",
 "text": "Dark Souls is an action RPG made by Hidetaka Miyazaki and FromSoftware. It is the sequel to Demon's Souls. The game is very similar to its prequel, but there were also many changes made. * In Dark Souls, the player's health bar does not become smaller whenever the player dies like in Demon's Souls. There are also no enemies that can lower the player's stat level. * In Demon's Souls, the player must find health items throughout the game world, but they can carry as many of those items as they like. However, in Dark Souls, the player can only carry a limited amount of Estus Flasks at a time (the game's main health items), but they will be refilled whenever the player rests at Bonfires. Also, \"Humanities\", which are items that completely refill the player's health, are hard to find. * In Dark Souls, the game world is more open than in Demon's Souls. Some of the areas that seem far away can later become connected to each other after the player finds shortcuts and keys. However, in Demon's Souls, while certain areas can be played out of order, many of the areas must be explored in a stricter order. *Dark Souls has important locations called Bonfires. If the player rests at a Bonfire, the player will refill their health bar and Estus Flasks, but most enemies will also come back to life. Also, when a player dies, they come back to the last bonfire they visited. *The player has \"Humanity\" and \"Hollow\" forms. If the player dies in their \"Humanity\" form, they will go into a \"Hollow\" form, a zombie-like version of the player. If the player becomes \"Hollow\", the player cannot get let other players join their own game, join other players' games, or attack other players. However, they also cannot be attacked by other players. To get back their \"Humanity\" form, player must spend a \"Humanity\" point at Bonfires if they want to use any of the features listed above. Dark Souls became successful and FromSoftware made two sequels and three spiritual successors, Bloodborne, Sekiro, and Elden Ring. The game became so popular that other video game companies made high difficulty action RPG's similar to Dark Souls. Category:2011 video games Category:Dark Souls Category:Bandai Namco games Category:Existentialist video games Category:Multiplayer and single-player video games Category:Nintendo Switch games Category:PlayStation 3 games Category:PlayStation 4 games Category:Soulslike video games Category:Video games about death Category:Video games developed in Japan Category:Windows games Category:Xbox 360 games Category:Xbox One games",
 "title": "Dark Souls"
}