{
 "id": "757680",
 "text": "This is a chronological list of every government formed by the prime ministers of Northern Cyprus. A new number is allocated to each new Prime Minister. ==List of prime ministers of Northern Cyprus (1975–present)== ===Prime ministers of the Turkish Federated State of Cyprus (1975–1983)=== This list gives all prime ministers after the founding of the Turkish Federated State of Cyprus, which was intended as an autonomous part of Cyprus, but was rejected by the government of the Republic of Cyprus. Name Portrait Term of office Term of office Political party 1 Rauf Denktaş 13 February 1975 3 July 1976 National Unity Party 2 Nejat Konuk 3 July 1976 21 April 1978 National Unity Party 3 Osman Örek 21 April 1978 12 December 1978 National Unity Party 4 Mustafa Çağatay 12 December 1978 15 November 1983 National Unity Party ===Prime ministers of the Turkish Republic of Northern Cyprus (1983–present)=== This list gives all prime ministers after Northern Cyprus' unilateral declaration of independence in 1983, which followed after the refusal of the government of the Republic of Cyprus to recognize the Turkish Federated State of Cyprus. Name Portrait Term of office Term of office Political party 1 Mustafa Çağatay 15 November 1983 13 December 1983 National Unity Party 2 Nejat Konuk 13 December 1983 19 July 1985 National Unity Party 3 Derviş Eroğlu 19 July 1985 1 January 1994 National Unity Party 4 Hakkı Atun 1 January 1994 16 August 1996 Democratic Party Derviş Eroğlu 16 August 1996 13 January 2004 National Unity Party 5 Mehmet Ali Talat 13 January 2004 23 April 2005 Republican Turkish Party — Serdar Denktaş 23 April 2005 26 April 2005 Democratic Party 6 Ferdi Sabit Soyer 26 April 2005 5 May 2009 Republican Turkish Party Derviş Eroğlu 5 May 2009 23 April 2010 National Unity Party — Hüseyin Özgürgün 23 April 2010 17 May 2010 National Unity Party 7 İrsen Küçük 17 May 2010 13 June 2013 National Unity Party 8 Sibel Siber 13 June 2013 2 September 2013 Republican Turkish Party 9 Özkan Yorgancıoğlu 2 September 2013 16 July 2015 Republican Turkish Party 10 Ömer Kalyoncu 16 July 2015 16 April 2016 Republican Turkish Party 11 Hüseyin Özgürgün 16 April 2016 2 February 2018 National Unity Party 12 Tufan Erhürman 2 February 2018 22 May 2019 Republican Turkish Party 13 Ersin Tatar 22 May 2019 23 October 2020 National Unity Party 14 Ersan Saner 9 December 2020 5 November 2021 National Unity Party 15 Faiz Sucuoğlu 5 November 2021 12 May 2022 National Unity Party 16 Ünal Üstel 12 May 2022 Incumbent National Unity Party",
 "title": "List of prime ministers of Northern Cyprus"
}