{
 "id": "757728",
 "text": "The Father of the Nation is an honorific title given to a person considered the driving force behind the establishment of his country, state, or nation. (plural ), also seen as , was a Roman honorific meaning the \"Father of the Fatherland\". It was given by the Senate to heroes, and later on emperors. In monarchies, the monarch was often considered the \"father/mother of the nation\" or as a patriarch to guide his family. This concept is callef the Divine Right in some monarchies. In others it is part of constitutional law. In Spain the monarch is considered the personification and embodiment, the symbol of the unity and permanence of the nation. The title \"Father of the Nation\" may be politically contested, e.g. in 1972 the Constitution of Bangladesh declared Sheikh Mujibur Rahman to be \"father of the nation\". The BNP government removed this in 2004, to the protests of the opposition Awami League, led by Rahman's daughter Sheikh Hasina. ==List== The following Gentlemen are still often called the \"Father\" of their respective nations. Name Nation Title (native) Title (translation) Notes Heydar Alirza oglu Aliyev millətin atası Father of the Nation Also known as Heydarism A Presenter of the \"National leader of the Azeri nation\". Sheikh Mujibur Rahman Jatira Pita () Jatira Janak () or Bongobondhu () (Bengali: — \"Friend of Bengal\") Father of the Nation Independance Leader, Assassinated Prime Minister, and father of the former Prime Minister of Bangladesh deposed after 16 years of autocratic regime for killing students. Sir John Alexander Macdonald N/A Founding father of the Nation The Dominant figure of Canadian Confederation, he had a political career that spanned almost half a century. Macdonald was the leading figure in the subsequent discussions and conferences, which resulted in the British North America Act, 1867 and the establishment of Canada as a nation on 1 July 1867. Mahatma Mohandas Karamchand Gandhi In most Indian languages: ISAT:Rāśhțrapitā Devanagari:राष्ट्रपिता Father of the Nation/Great Soul of India This title was not an official title and has no records in the National Archives of India. Indian constitution (Art. 18) prohibits the State from conferring any titles. Origin of this title is traced back to a radio address (on Singapore radio) on 6 July 1944 by Subhash Chandra Bose where Bose addressed Gandhi as \"The Father of the Nation\". James Busby United Tribes of New Zealand; - Busby proposed that New Zealand should have a national flag. Treaty of Waitangi Father of the Nation, He acted as New Zealand's first jurist and the \"Originator of Law in Aotearoa\". Mr. Muhammad Ali Jinnah Quaid-i-Azam, (Urdu: — \"Great Leader\") () & Baba-i-Quam, (Urdu: — \"Father of Pakistan\") () & Ban-i-Pakistan, (Urdu: — \"Founder of Pakistan\") () Father of the Nation/Great Leader of the Muslims of India Statesman and the founder of Pakistan, leading member of the Muslim League and First for Governor-General of Pakistan in 1947. Stanley Wolpert summarises the profound effect that Jinnah had on the world: Nelson Mandela Tata wethu Father of the Nation First President of post-apartheid South Africa, A member of the (ANC) political party, he served president of the ANC's (1991-1997). Albert Frederick Arthur George Windsor King James the Unifier King George VI Sealed Emperor of India, Father of the Nation, Late Father of War Time King George VI was First Native King of the Commonwealth and House of Windsor. Maternal Grandfather of the current Monarchy Respectively. King James VI decided to side-step the whole issue by unilaterally assuming the title of King of Great Britain by a Proclamation concerning the Kings Majesties Stile on the 20th of October in 1604 announcing that he did \"assume to Our selfe by the cleerenesse of our Right, The Name and Stile of KING OF GREAT BRITTAINE, FRANCE AND IRELAND, DEFENDER OF THE FAITH, &c.;\" . George Washington Revolutionary American Chief of the United States & One of the Founding Fathers of the United States of America. Father of his countryRupert Cornwell, \"George Washington: The father of the nation\" (January 17, 2009). George Washington is particularly highlighted out of \"The Founding Father of American Patriot\" as being the \"Father of his country\" for his role as the commander-in-chief of the Continental Army during the American Revolutionary War, his resignation of command at the end of the war, the presidency of the Constitutional Convention and for Presidency of George Washington (and George Washington's Farewell Address) as the first President of the United States. == Related pages == * Mother of the Nation == References == Category:Nationalism",
 "title": "Father of the Nation"
}