{
 "id": "7579",
 "text": "Keanu Charles Reeves (born September 2, 1964) is a Canadian actor. He is known for his roles in movies like the Bill and Ted series, The Matrix series, Speed, and John Wick. He also played John Constantine in the 2005 movie Constantine. At age 9, he started his acting career by appearing onstage, and at age 14, he appeared in Canadian television series and commercials. He also appeared in short movies and stage work in early 1980s. Keanu acted his first significant role in River's Edge (1987), and the next year (1988), he appeared in some movies such as Dangerous Liaisons and Permanent Record. In 1989, he appeared in the successful comedy Bill & Ted's Excellent Adventure, which was one of the Bill and Ted series. In 2008 he played the alien in The Day the Earth Stood Still. In 2014, he began playing John Wick in three movies: John Wick, John Wick: Chapter 2 and John Wick: Chapter 3 – Parabellum. In 2022, he voiced Batman / Bruce Wayne in the animated movie DC League of Super-Pets. ==Early life== Reeves was born in Beirut, Lebanon. He is the son of Patricia Bond (née Taylor), an English-born costume designer/performer, and Samuel Nowlin Reeves, Jr. His father, who is a Hawaiian-born American, has English, Native Hawaiian, Chinese, Irish, and Portuguese ancestry. Reeves has said: \"My grandmother is Chinese and Hawaiian, so I was around Chinese art, furniture and cuisine when I was growing up\". He is named after his uncle, and his first name is a Hawaiian word that means 'cool breeze over the mountains'. ==Filmography== Title Year Role(s) Director(s) Notes One Step Away 1985 Short film Youngblood 1986 Heaver Flying 1986 Tommy River's Edge 1986 Matt 1988 Permanent Record 1988 1988 Dangerous Liaisons 1988 Bill & Ted's Excellent Adventure 1989 Parenthood 1989 I Love You to Death 1990 Tune in Tomorrow 1990 Point Break 1991 Bill & Ted's Bogus Journey 1991 My Own Private Idaho 1991 Bram Stoker's Dracula 1992 Much Ado About Nothing 1993 Even Cowgirls Get the Blues 1993 Freaked 1993 Ortiz the Dog Boy and Uncredited cameo Little Buddha 1993 Speed 1994 Johnny Mnemonic 1995 1995 Chain Reaction 1996 Feeling Minnesota 1996 1997 Harry 1997 1999 Me and Will 1999 Himself and Uncredited cameo 2000 2000 2000 Sweet November 2001 Hardball 2001 2003 Thomas Anderson / Neo 2003 Thomas Anderson / Neo Voice 2003 Thomas Anderson / Neo Something's Gotta Give 2003 Constantine 2005 Thumbsucker 2005 Ellie Parker 2005 Himself Cameo 2006 2006 2006 Narrator Documentary Street Kings 2008 2008 Klaatu 2009 Henry's Crime 2010 Side by Side 2012 Himself Also producer; documentary Generation Um... 2012 John Man of Tai Chi 2013 47 Ronin 2013 Kai John Wick 2014 John Wick and (uncredited) Knock Knock 2015 Also executive producer Deep Web 2015 Narrator Documentary Mifune: The Last Samurai 2015 Narrator Documentary Exposed 2016 Also producer Keanu 2016 Keanu Voice cameo 2016 Hank 2016 2016 To the Bone 2017 John Wick: Chapter 2 2017 2017 Bob Cameo SPF-18 2017 Himself Cameo Siberia 2018 Also producer Destination Wedding 2018 Frank Replicas 2018 Also producer John Wick: Chapter 3 – Parabellum 2019 Always Be My Maybe 2019 Himself Toy Story 4 2019 Duke Caboom Voice Already Gone 2019 — Executive producer Between Two Ferns: The Movie 2019 Himself Cameo Bill & Ted Face the Music 2020 Filming The Matrix Resurrections 2021 Thomas Anderson / Neo Lana Wachowski ==References== ==Other websites== * * * Category:1964 births Category:Living people Category:Actors from Toronto Category:Canadian movie actors Category:Canadian television actors Category:Native Hawaiians",
 "title": "Keanu Reeves"
}