{
 "id": "758040",
 "text": "The Katyn massacre refers to a series of mass murder of Poles committed by the Soviet Union during World War II. The Soviet secret police NKVD killed around 22,000 Polish prisoners of war in a forest near Katyn, about 20 km (12 miles) from Smolensk. * * * * * * * ==Perpetrators== In the 1980s, Michail Gorbachev said that Beria and Vsevolod Merkulov, head of the NKGB, were responsible. He said that the Katyn massacre was one of Stalin's atrocities. Beria was accused of treason and executed in 1953, so was Merkulov who was close to Beria. Beria and Merkulov were never tried for what they did at Katyn. ==Victims== Many of the prisoners killed were mainly captured Polish soldiers, police, doctors, teachers, scientists, engineers and journalists. The Katyn massacre happened in April and May 1940. Stalin ordered it on Beria's advice. In April 1990, the Soviet regime admitted that it was responsible. In 1990, Mikhail Gorbachev officially apologised. The Katyn massacre is one in a series of similar massacres where up to 100,000 people were killed. Between 400 and 450 prisoners survived. People used their stories to change Soviet history books after the apology. ==Genocide question== Over the past decades, it has been debated whether the Katyn massacre could be seen as a genocide. Many Polish scholars, including historian Adam Basak,See Adam Basak, Katyń: Problem odpowiedziałności karnej sprawców w świetle Norymbergi, in 21 Studia na Faszyzmem i Zbrodniami Hitlerowskimi 325, 325–60 (Karol Jonca ed., 1998). * * * * jurist Cezary Mik,See Cezary Mik, Lech Aleksander Kaczyński (18.6.1949-10.4.2010), 1/2 Kwartalnik Prawa Publicznego 5, 10 (2010) (describing the life as well as public and academic work of the late Lech Kaczyński, President of Poland, who, while heading a Polish delegation for the celebrations of the seventieth anniversary of the Katyn Massacre, died along with the ninety-five people accompanying him on April 10, 2010 in a plane crash in Smolensk). Karolina Kosińska,Karolina Kosińska, Zbrodnia ludobójstwa w prawie międzynarodowym 34 (2009). and prosecutor Małgorzata Kuźniar- Plota,See Małgorzata Kuźniar-Plota, Kwalifikacja prawna Zbrodni Katyńskiej—Wybrane zagadnienia, in Zbrodnia Katyńska: W kRęgu Prawdy i Kłamstwa 46 (Sławomir Kalbarczyk ed., 2010). who investigated the massacre, believed that the Katyn massacre qualified as a genocide. Historian Adam Basak noted: Jurist Cezary Mik called the massacre \"genocidal murder of the Polish elite in Katyn and other places\", while Karolina Kosińska said: More importantly, prosecutor Małgorzata Kuźniar-Plota, who investigated the massacre, ruled that: ==Denial== Since the fall of communism, individuals on the political left have occasionally denied the Katyn massacre. ===Examples=== ====Poland==== In December 2019, members of the Democratic Left Alliance (SLD) downplayed the Katyn massacre by saying that \"the Soviets liberated Poland\" from German occupation\". The party was a successor to the communist party that ruled Poland between 1947 and 1989. The said members were criticized for \"falsifying Polish history\" and \"promoting a [communist] totalitarian system\". British historian Norman Davies also commented that the Red Army soldiers did not know what freedom was but fought for their leaders to \"bring all conquered countries under Bolshevik dictatorship\". ====Czechia==== In December 2024, the Czech Constitutional Court (ÚS) rejected an appeal from Josef Skála, a former Communist Party deputy leader, who had previously been convicted for denying that the Soviets committed the Katyn massacre. The Court stated in its ruling, ==Related pages== * Ruscism * Holodomor * Volhynia massacre * NKVD prisoner massacres * Soviet persecution of Poles during World War II ==References== Category:Racism Category:Communism Category:History of Poland Category:Soviet crimes against humanity Category:Massacres in Europe during World War II",
 "title": "Katyn massacre"
}