{
 "id": "7583",
 "text": "Mikhail Sergeyevich Gorbachev (sometimes spelled Gorbachov) (2 March 1931 – 30 August 2022) was a Soviet politician and leader from 1985 to 1991 during the end of the Cold War from 1989 to 1991. He was the General Secretary of the Communist Party of the Soviet Union (1985-91), Chairman of the Supreme Soviet of the Soviet Union (head of state) . Gorbachev is known for forming a friendship with President of the United States Ronald Reagan and is often associated with the fall of the Soviet Union. ==Early life and career== Gorbachev was born in Privolnoye, Stavropol Krai, Russian SFSR, Soviet Union. He grew up in a Kolkhoz collective farm. He did well in school and went to Moscow State University. Gorbachev joined the Communist Party in the 1950s and steadily rose through the ranks. ==Leader of the Soviet Union== Following the Death of his predecessor Konstantin Chernenko in March 1985, Gorbachev was elected as General Secretary. Gorbachev's attempts at reform and partnership with Ronald Reagan led to the end of the Cold War. His main intent was to improve the economy of the USSR. To do this, he set in motion two major reforms: * Perestroika: restructuring of the economy * Glasnost: gave more freedom to the people, and allowed them to express their opinions more freely. Indirectly, this may have helped cause the end of the power of the Communist Party of the Soviet Union (CPSU), and the break-up of the Soviet Union into smaller countries. However, it should be noted that the need to modernise the economy, and to conduct government less ruthlessly than Stalin, was agreed by the previous two leaders. They, Andropov and Chernenko, were elderly and died before real changes could be put in place. In 1990, Gorbachev created the office of President of the Soviet Union. It was to be based on the systems in France and the United States. The office merged office of General Secretary and head of state. The President was to be elected by the Soviet People but its only holder was Gorbachev who wasn't elected. Gorbachev saw the office mainly as a position for himself to remain influential in Soviet politics. His main goal was to keep the Soviet Union together, controlled by Moscow. After the August coup in 1991, Gorbachev resigned as leader of the Communist Party and held onto the Soviet presidency. When Union republics began to turn away from the Soviet system, Gorbachev's power was dramatically reduced. By late 1991 he had almost no influence outside of Moscow. When Russia, Ukraine and Belarus became independent, Gorbachev was basically a President of a country that only existed on paper. He resigned on December 25, 1991. ==Personal life== Gorbachev studied law at Lomonosov Moscow State University. He met his future wife, Raisa Gorbachova, there. Gorbachova studied sociology. After retiring from politics in 1991, Gorbachev started The Gorbachev Foundation, which is currently headed by his daughter Irina. In 2004, he traveled to the United States to represent Russia at Ronald Reagan's funeral. ===Death=== Gorbachev died at a hospital in Moscow on 30 August 2022, at the age of 91. He died after a long illness, however at the time of his death he had diabetes and kidney problems. His funeral was held on 3 September, however President Vladimir Putin did not give him a state funeral. ==Awards== Gorbachev was awarded the Nobel Peace Prize in 1990.NobelPrize.org, \"Mikhail Gorbachev\"; retrieved 2012-9-19. He won a Grammy Award in 2004 with Bill Clinton and Sophia Loren for Best Spoken Word Album for Children for their recording of Sergei Prokofiev's Peter and the Wolf. == In the arts == A Russian play about Gorbachev titled Gorbachev was made in 2020. The play focuses on Gorbachev and the relationship with his wife Raisa. == Legacy == Gorbachev's legacy is a complex mix. He is credited with reforms like perestroika and glasnost, but his leadership also saw the end of the Soviet Union. Thus, Gorbachev's legacy is a subject of intense debate among historians. Some see him as a reformer, while others blame him for the USSR's collapse. == Related pages == * List of Nobel Prize winners by country * \"Tear down this wall!\" ==References== ==Other websites== * Gorby80 Gorbachev 80th Birthday Gala Celebration at the Royal Albert Hall London * The Gorbachev Foundation * * Green Cross International * Column and op-ed archives at Journalisted * Column and op-ed archives at Project Syndicate * Column and op-ed archives at The Guardian Category:1931 births Category:2022 deaths Category:Grammy Award winners Category:Order of Merit of the Federal Republic of Germany Category:Recipients of the Order of Lenin Category:Russian communist politicians Category:Russian lawyers Category:Russian Nobel Prize winners Category:Heads of government of the Soviet Union Category:Time People of the Year Category:Moscow State University alumni Category:People from Stavropol Krai Category:General Secretaries of the Communist Party of the Soviet Union",
 "title": "Mikhail Gorbachev"
}