{
 "id": "758783",
 "text": "Camp Jupiter is the Roman camp for demigods portrayed in the book series The Heroes of Olympus by Rick Riordan. The camp is located in the Oakland Hills near San Francisco, California. You can get there by going through the Caldecott Tunnel. ==Cause== Camp Jupiter's purpose is to train and protect Roman demigods or descendants of all ages. The camp also helps demigods have \"normal\" lives. There is also a college-- New Rome University-- at Camp Jupiter, so unlike Camp Half-Blood, demigods at Camp Jupiter can stay past high school. This is the school that Percy Jackson and Annabeth Chase decide to go to. ==History== Romulus and Remus as you may know, made Rome Their culture became more disciplined and militaristic, which the gods adapted producing demigods different from those conceived by the Greek aspects. A rivalry developed between the Greek and Romans, which subsequently lead to many conflicts.. After the fall of Rome the 12th legion made Camp Jupiter. These wars mirrored the mortal conflicts. Because of the tremendous death toll, the gods decided to completely separate their children to avoid further bloodshed by weaving the Mist so that the two rival groups forgot each other and would ensure that it would remain so ever since. Until the book: The Son of Neptune. == Internal Structure == Camp Jupiter is a part of the Fulminata, or the 12th legion. This legion consists of five cohorts. Camp Jupiter's government is made to follow the Roman Republic style, or the S.P.Q.R. The camp typically has two co-praetors, a group of senators, ten centurions (two for each cohort), the Augur, and the Pontifex Maximus. The current co-praetors are Hazel Levesque and Frank Zhang. In the past, they have included Reyna Ramírez-Arellano, Jason Grace, and Percy Jackson. Octavian tried to be praetor but failed. No senators are mentioned by name, but eligibility includes past praetors, centurions, the Augur, Pontifex Maximus, godly ambassadors, and camp veterans. The current known centurions are Michael Kahale (First Cohort), Ida and Larry (Second Cohort), Hank (Third Cohort), Leila (Fourth Cohort), and Lavinia Asimov and Frank Zhang (Fifth Cohort). Previous centurions include Octavian (First Cohort), Claudia's father (Fourth Cohort), and Gwendolyn and Dakota (Fith Cohort). The past Augur is Octavian. There is no current Pontifex Maximus, but Octavian self-appointed himself the role before his death. Non- governmental members fall into two categories: Legionnaire and Probatio. Probatio is the probationary period before becoming a Legionnaire that all new recruits must go through. Once they complete it, they become a fully fledged member, called a Legionnaire. Camp Jupiter has many buildings, but the most notable are The Senate House, The Praetor's Office, The Training Grounds, The Baths of Neptune, The Temple of Jupiter, New Rome University (located in New Rome), and Pluto's Shrine. New Rome is the city within Camp Jupiter for adults who have done their legion work or wish to attend New Rome University. New Rome is a safe place for adult demigods and demigods wishing to start a family. New Rome is protected by Terminus. ==The Son Of Neptune== This is the first book that has Camp Jupiter as a setting. In this book Percy Jackson had his memory wiped by Hera/Juno to confirm that the campers don't know that he is Greek and Percy doesn't attack. Percy gets to camp Jupiter and goes on a quest to free Thanatos the god of Death so monsters can die. ==Related pages== * Camp Half-Blood * Percy Jackson & The Olympians * The Heroes of Olympus * The Trials of Apollo Category:Fictional locations Category:The Heroes of Olympus",
 "title": "Camp Jupiter"
}