{
 "id": "75873",
 "text": "The Agnatha is a superclass of fish. It is paraphyletic. This means it is a convenient catch-all term, which does not follow the rules of cladistics. For example, most extinct agnathans belong to the stem group (ancestral group) of gnathostomes.Zhao Wen-Jin & Zhu Min 2007. Diversification and faunal shift of Siluro-Devonian vertebrates of China. Geological Journal 42, 351–369. Sansom, Robert S. 2009. Phylogeny, classification & character polarity of the Osteostraci (Vertebrata). Journal of Systematic Palaeontology 7: 95–115. But according to the rules, one sister group should not contain ancestors of another sister group. The living Agnatha (lampreys and hagfish) are known as cyclostomes. Recent molecular data from rRNA,Mallatt J. & Sullivan J. 1998. 28S and 18S ribosomal DNA sequences support the monophyly of lampreys and hagfishes. Molecular Biology and Evolution 15 (12): 1706–1718. and from mtDNA,DeLarbre, Christiane et al 2002. Complete mitochondrial DNA of the hagfish, Eptatretus burgeri: the comparative analysis of mitochondrial DNA sequences strongly supports the cyclostome monophyly. Molecular phylogenetics and evolution. 22, 2, 184–192. show that these living agnathans are monophyletic. There are about 100 species. Hagfish are vertebrates but do not have vertebrae. It is believed that they lost their vertebrae during their lifestyle adaptations. The lifestyle of the lamprey (an ectoparasite on other fish) and hagfish (a scavenger) means that they are not typical of the fossil groups, which were free-swimming and often armoured. == Classification == * Agnatha: the jawless fish. Cambrian to present day.Janvier, Philippe 2010. MicroRNAs revive old views about jawless vertebrate divergence and evolution. Proceedings of the National Academy of Sciences (USA) 107:19137-19138. ** †Pteraspids: the head-shields ** Anaspids: gills opened as holes. Silurian to end-Devonian. *** †Cephalaspids: early jawless fish *** Cyclostomes: Lampreys and Hagfish ** †Osteostraci: bony-armoured jawless fish. == Characteristics == === Anatomy === Agnathans do not have jaws, and have a cartilaginous skeleton. There is a notochord in both larvae and adults. They do not have paired fins. They have seven or more paired gill pouches. Agnatha have no identifiable stomach and are cold-blooded. The heart is simple, with two chambers. === Physiology === There is a light-sensitive pineal eye. Fertilization and development of young are both outside the body, and there is no parental care. == Fossil agnathans == The oldest fossil agnathans are found in Cambrian deposits.BBC News Science & Technology 1999 Many Ordovician, Silurian, and Devonian agnathans were armoured with heavy bony-spiky plates. The first armoured agnathans were the Ostracoderms (\"shell-skinned\").Not to be confused with the Osteichthyes (\"bony fish\"), who were ancestors of the bony fish. By the upper Silurian the agnathans had reached the high point of their evolution. They declined in the Devonian and never recovered. == References ==",
 "title": "Agnatha"
}