{
 "id": "758951",
 "text": "A dark-sky preserve (DSP) is protected area without light pollution created by humans. These areas are used to help promote astronomy. Different countries have different programs for making areas dark-sky preserves. The International Dark-Sky Association (IDA) uses the word reserve instead of park, or preserve with their dark-sky preserves. This is so that people don't confuse International Dark Sky Reserves (IDSR) and International Dark Sky Parks (IDSP). In Canada, there is a very strict way to make areas dark-sky preserves. This was based on the work by the Royal Astronomical Society of Canada. The program is based on the amount of light in an area and how much skyglow there is from cities and towns that are close to it. Canada's program is the only one in the world that makes areas dark-sky preserves. Outside Canada, when areas are called dark-sky preserves, they are not official, and might not be a real dark or protected preserve. ==List of dark-sky preserves, reserves, and parks== Country Name Location Area (in ha) Bortle scale Status Notes Australia The Jump-Up, Australian Age of Dinosaurs Winton, Queensland 1,400 1–2 Sanctuary Designated on 27 April 2019 Australia Warrumbungle National Park New South Wales 23,312 Dark Sky Park Designated on 4 July 2016 Canada Beaver Hills Alberta 29,300 4.5 Designated on 3 September 2006 Canada Jasper National Park Alberta 1,122,800 1–2 Designated on 11 March 2011 Canada Wood Buffalo National Park Alberta/NWT 4,480,700 1–2 UNESCO World Heritage Site Designated on 28 June 2013 Canada Cattle Point Oak Bay, British Columbia 5 Urban Star Park Designated 29 March 2013 Canada McDonald Park British Columbia 5 2–3 Designated in 2003 Canada Fundy National Park New Brunswick 20,700 2 Designated on 31 October 2011 Canada Irving Nature Park Urban Star Park Saint John, New Brunswick 243 ? Urban Star Park Designated on 1 July 2011; First RASC-designated Urban Star Park Canada Kouchibouguac National Park New Brunswick 23,920 2 Designated on 6 June 2009 Canada Mount Carleton Provincial Park New Brunswick 17,427 2 Designated on 18 July 2009 Canada Kejimkujik National Park Nova Scotia 40,400 2 Designated on 7 August 2010 Canada Bluewater Outdoor Education Centre Ontario 129 2 Designated on 3 November 2012 by the Royal Astronomical Society of Canada Canada Bruce Peninsula Fathom Five National Marine Park Ontario 16,700 2–3 Designated on 29 March 2009 Canada Gordon's Park Ontario 43.7 2–3 Designated on 15 August 2009; designation is only for the Park though Manitoulin Island (276,611 ha) follows dark-sky practices Canada Lake Superior Provincial Park Ontario 155,600 1-2 Designated in July 2018 Canada Killarney Provincial Park Ontario 64,500 1-2 Designated in May 2018 Canada North Frontenac Township Ontario 116,000 1–2 Designated on 28 June 2013 Canada Point Pelee National Park Ontario 2,000 3–4 Designated in 2006 Canada Torrance Barrens Ontario 1906 3 Designated in 1999; first Canadian dark sky preserve Canada Mont Mégantic Observatory Quebec 527,500 2–3 Reserve Designated Sept. 2007; first IDA International Dark-Sky Reserve Canada Cypress Hills Saskatchewan/Alberta 39,600 2 Designated on 28 September 2004 Canada Grasslands National Park Saskatchewan 92,100 1 Designated on 2 October 2009 Czech Republic, Slovakia Beskydy Dark-Sky Park Moravian-Silesian Region, Czech Republic Čadca District, Slovakia 30,800 3–4 Designated on 4 March 2013; The second world's bilateral dark-sky park Czech Republic Manětín Dark-Sky Park Plzeň Region 34,600 3–5 Designated on 15 September 2014 Germany Westhavelland Nature Park Brandenburg Designated an IDA International Dark Sky Reserve on 12 February 2014 France Pic du Midi de Bigorre Hautes-Pyrénées 311,200 2–4 Reserve Designated an IDA International Dark Sky Reserve in December 2013; First IDA International Dark Sky Reserve in France (still now) and in Europe. Hungary Hortobágy Starry Sky Park 10,000 ? Designated on 31 January 2011; IDA's third international dark-sky park (Silver tier) Hungary Zselic National Landscape Protection Area 9,042 3–4 Designated on 16 November 2009 Ireland Kerry International Dark-Sky Reserve Iveragh Peninsula, County Kerry 70,000 1–3 Reserve Designated an IDA International Dark Sky Reserve on 27 January 2014 Israel Ramon Crater (Makhtesh Ramon) 113.2 2–3 Dark Sky Park Designated 14 September 2017 Korea Yeongyang Firefly Eco Park North Gyeongsang Province, Yeongyang County, Subimyeon 390 Designated on 1 November 2015 Namibia NamibRand Nature Reserve Reserve Designated ??? Netherlands Boschplaat Terschelling, Friesland 2,400 ? Dark Sky Park Designated on 7 October 2016 Netherlands Lauwersmeer Groningen / Friesland 5,000 ? Dark Sky Park Designated on 26 June 2015 New Zealand Aoraki / Mount Cook National Park Tekapo 430,000 2 Reserve Designated on 9 June 2012 Poland Bieszczady Starry-Sky Park Subcarpathia 113,846.5 2–3 Designated on 8 March 2013 Poland, Czech Republic Izera Dark-Sky Park Lower Silesia, Poland Liberec Region, Czech Republic 7,500 3–4 Designated on 4 November 2009; the first European dark-sky park and the first world's bilateral dark-sky park Slovakia, Poland, Ukraine East Carpathian Dark-Sky Tripark Poloniny Dark-Sky Park (Slovakia); Bieszczady Starry-Sky Park (Poland); Transcarpathian Dark-Sky Park (Ukraine) 208,667 2–3 Designated on 9 September 2016; first world's trilateral dark-sky park Slovakia Poloniny Dark-Sky Park Poloniny National Park 48,519 2–3 Designated on 3 December 2010 Slovakia Veľká Fatra Dark-Sky Park Veľká Fatra National Park (part of) 325 3–4 Designated on 12 June 2015 Ukraine Transcarpathian Dark-Sky Park Uzhansky National Nature Park 46,302 2 Designated on 10 June 2016 United Kingdom Exmoor National Park Devon & Somerset, England Reserve Designated 10 October 2011 United Kingdom Galloway Forest Park Dumfries and Galloway, Scotland 75,000 3 Designated on 16 November 2009 United Kingdom Sark British Crown Dependency of Guernsey 545 3 Designated on 31 January 2011; IDA's first international dark-sky island (Silver tier) United Kingdom Isle of Coll Inner Hebrides, Scotland Designated on 9 December 2013 United Kingdom Northumberland National Park Northumberland, England 103,000 Dark Sky Park Designated on 9 December 2013 United Kingdom Brecon Beacons Wales Reserve Designated 19 February 2013 United Kingdom Mata ki te Rangi (Eyes To the Sky) British Overseas Territory of Pitcairn Islands 4325 1 Sanctuary Designated 18 March 2019 United States Grand Canyon-Parashant National Monument Arizona 4,242 km2 Dark Sky Park Designated 2014 United States Death Valley National Park California 13,743 km2 Dark Sky Park Designated 2013 United States Joshua Tree National Park California 3,199.59 km2 Dark Sky Park Designated 26 July 2017Sahagun, Louis (29 July 2017). Dark Sky designation puts Joshua Tree National Park in a new light. Retrieved 30 July 2017. United States Black Canyon of the Gunnison National Park Colorado 124.4 km2 Dark Sky Park Designated 2015 United States Hovenweep National Monument Colorado, Utah 3.1 km2 Dark Sky Park Designated 2014 United States Big Cypress National Preserve Florida 2,916 km2 Dark Sky Park Designated 2017 United States Kissimmee Prairie Preserve State Park Florida ?? km2 Dark Sky Park Designated 2016 United States Stephen C. Foster State Park Georgia 32 Dark Sky Park Designated November 2016 United States Central Idaho Dark Sky Reserve Idaho Dark Sky Reserve Designated December 2017 United States Potawatomi Wildlife Park Indiana 116 4.5 Designated in 2003 United States Lake Hudson State Recreation Area Michigan 890 3 Dark Sky Preserve Designated in 1993 United States Negwegon State Park Michigan 1,513 Dark Sky Preserve Designated in 2016 United States Port Crescent State Park Michigan 2.4 km2 Dark Sky Preserve Designated in 2012 United States Rockport State Recreation Area Michigan 17.15 km2 Dark Sky Preserve Designated in 2016 United States Thompson's Harbor State Park Michigan 20.68 km2 Dark Sky Preserve Designated in 2016 United States Wilderness State Park Michigan 4,254 Dark Sky Preserve Designated in 2012 United States The Headlands Michigan 220 3–5 Dark Sky Park Designated in 2011 United States Chaco Culture National Historical Park New Mexico 13759 km2 2–3 Dark Sky Park Designated on 28 August 2013 United States Clayton Lake New Mexico 69 Designated 29 June 2010International Dark Sky Association Recognizes state parks in New Mexico and Washington for night sky preservation efforts , International Dark-Sky Association news release, 29 June 2010 United States Observatory Park Ohio 418.5 ? Designated on 20 August 2011 United States Cherry Springs State Park Pennsylvania 20 2 Dark Sky Park Designated as a State DSP in 2000 by the Pennsylvania Department of Conservation and Natural Resources (DCNR) and as the second International DSP by the IDA on 11 June 2007. United States Big Bend National Park Texas 324,219 ac Dark Sky Park Designated 11 February 2012Big Bend National Park designated as an International Dark Sky Park, Earth Sky, 11 February 2012 United States Copper Breaks State Park Texas 770 Dark Sky Park Designated 6 August 2014\"Stars Shine Bright in Dark Sky Parks \". Texas Highways, 6 August 2014. United States Dripping Springs Texas Dark-sky Community Designated 11 February 2014\"Dripping Springs Named The First International Dark Sky Community In Texas\". Texas Hill Country Trail newsletter, March 2014. United States Enchanted Rock Texas 665 Dark Sky Park Designated 6 August 2014 United States UBarU Camp & Retreat Center Texas 57.5 2–3 Dark Sky Park Designated in 2015; only DSP in the USA on private land; open to the public United States Canyonlands National Park Utah 1365 km2 Dark Sky Park Designated 2015 United States Capitol Reef National Park Utah 980 km2 Dark Sky Park Designated 2015 United States Natural Bridges National Monument Utah 3090 2 Dark Sky Park Designated in 2007; first international dark-sky park United States Goldendale Observatory Washington 2 Designated 29 June 2010 United States Newport State Park Wisconsin 960 Designated in 2017Lee Bergquist. \"Newport State Park designated as Wisconsin's first 'dark sky' park/\". Milwaukee Journal Sentinel, 7 June 2017.International Dark Sky Association. Newport State Park (U.S.) . ==References== Category:Astronomy Category:Protected areas",
 "title": "Dark-sky preserve"
}