{
 "id": "759162",
 "text": "The COVID-19 pandemic first appeared in Greece on 26 February 2020. , there have been 2,760 confirmed cases and 155 deaths. ==Cases== The first COVID-19 case, a 38-year-old woman from Thessaloniki who had recently visited Νorthern Italy, was confirmed. Later cases in late February and early March related to people who had traveled to Italy, Israel and Egypt. The first death from COVID-19 in Greece was a 66-year-old man, who died on 12 March. * February 2020: 7 confirmed cases. * March 2020: 1307 new cases, taking the total number to 1314 cases, including 49 deaths. * April 2020: 1284 new cases and 91 deaths, taking the total number to 2591 cases, including 140 deaths. * May 2020: 326 new cases and 35 deaths, taking the total number to 2917 cases, including 175 deaths. * June 2020: 492 new cases and 17 deaths, taking the total number to 3409 cases, including 192 deaths. * July 2020: 1068 new cases and 14 deaths, taking the total number to 4477 cases, including 206 deaths. * August 2020: 5840 new cases and 60 deaths, taking the total number to 10,317 cases, including 266 deaths. * September 2020: 8158 new cases and 125 deaths, taking the total number to 18,475 cases, including 391 deaths. * October 2020: 20,777 new cases and 235 deaths, taking the total number to 39,252 cases, including 626 deaths. * November 2020: 66,019 new cases and 1780 deaths, taking the total number to 105,271 cases, including 2406 deaths. * December 2020: 33,579 new cases and 2432 deaths, taking the total number to 138,850 cases, including 4838 deaths. * January 2021: 18,107 new cases and 958 deaths, taking the total number to 156,957 cases, including 5796 deaths. * February 2021: 34,143 new cases and 708 deaths, taking the total number to 191,100 cases, including 6504 deaths. * March 2021: 72,589 new cases and 1589 deaths, taking the total number to 263,689, including 8093 deaths. * April 2021: 81,344 new cases and 2288 deaths, taking the total number to 345,033, including 10,381 deaths. * May 2021: 57,273 new cases and 1714 deaths, taking the total number to 402,306, including 12,095 deaths. * June 2021: 20,150 new cases and 611 deaths, taking the total number to 422,456, including 12,706 deaths. * July 2021: 70,848 new cases and 259 deaths, taking the total number of confirmed cases to 493,304, including 12,965 deaths. * August 2021: 94,960 new cases and 726 deaths, taking the total number of confirmed cases to 587,964, including 13,691 deaths. * September 2021: 67,803 new cases and 1,137 deaths, taking the total number of confirmed cases to 655,767, including 14,828 deaths. * October 2021: 86,403 new cases and 1,110 deaths, taking the total number of confirmed cases to 742,170, including 15,938 deaths. ==Response== Following the first three cases in Greece, on 27 February all carnival events in the country were cancelled. Later, the closure of schools and the suspension of cultural events in the affected areas (particularly Ilia, Achaea and Zakynthos) were announced. On 10 March, with 89 confirmed cases and no deaths in the country, the government decided to close down all schools for good and on 13 March, to close down all cafes, bars, museums, shopping centres, sports facilities and restaurants in the country. On 16 March, all retail shops were also closed, two villages in Kozani were quarantined, and all services in all churches were suspended. On 18 and 19 March, the government announced a series of measures of more than 10 billion euros to support the economy, businesses and employees. On 4 April these restrictions were extended until 27 April and on 23 April they were extended until 4 May. The measures put in place in Greece were among the most strictest in Europe and were praised internationally for having slowed the spread of the disease and having kept the number of deaths among the lowest in Europe. Starting from 4 May, Greece began easing restrictions after a 42-day lockdown, with the gradual lifting of restrictions on movement and the restarting of business activity. ==References== Category:2020s in Greece Greece",
 "title": "COVID-19 pandemic in Greece"
}