{
 "id": "759103",
 "text": "The COVID-19 pandemic spread to the United States in January 2020. The first confirmed case of local transmission was recorded in January in Chicago and the first known deaths happened in February. By the end of March, cases had happened in all 50 U.S. states, the District of Columbia, and all U.S. territories except American Samoa. As of , cases of COVID-19 have been reported, and people have died of COVID-19. ==Deaths== As of May 13, 2020, the U.S. had the most confirmed active cases and deaths in the world, and its death rate was 206 per million people, the tenth-highest rate globally. ==Trump response== The Trump administration made a public health emergency on January 31, and on February 2nd he began to end the entry of most foreign nationals who had recently travelled to China. People have said that the country's response to the pandemic was slow regarding testing and medical response. ==Warnings== On February 25, the Centers for Disease Control and Prevention warned the American public for the first time to prepare for a local outbreak. ==National emergency== A national emergency was declared on March 13. In early March, the Food and Drug Administration began allowing public health agencies and private companies to create and carry out tests. The Trump administration waited until mid-March to start purchasing large amounts of medical equipment. On March 16, the White House announced that they were against any gatherings of more than ten people. Since March 19, 2020, the U.S. Department of State has said all U.S. citizens to avoid all international travel. ==State and local responses== State and local responses to the outbreak have included cancellation of large gatherings, stay-at-home orders, and the closing of schools and other educational institutions. Large numbers of outbreaks in the U.S. were seen in black American populations. Many numbers of infections and deaths have happened in nursing homes, long-term care facilities, prisons, and other detention centers, meatpacking plants, churches, and larger cities such as New York City, Chicago, Los Angeles, and Seattle. ==Prisons== In July 2020, scientists from Johns Hopkins University told people that deaths from COVID-19 in United States prisons were much higher than the average for the whole country. There were about 3251 sick prisoners and 39 deaths out of every 100,000 prisoners. The national average was about 587 sick United States residents and 29 deaths for every 100,000 United States residents. ==References== United States",
 "title": "COVID-19 pandemic in the United States"
}