{
 "id": "759122",
 "text": "The ongoing COVID-19 pandemic spread to the United Kingdom in late January 2020. As of , cases of COVID-19 have been reported, and people have died of COVID-19. ==Numbers== More than 90% of those dying had underlying illnesses or were over 60 years old. The infection rate was higher in care homes than in the community. There were large regional difference in the outbreak's severity. The outbreak in London had the highest total number and the most infections. England and Wales were the UK countries with the highest recorded death rate per head, and Northern Ireland had the lowest. ==Government response before the pandemic== The Department of Health and Social Care created a public health campaign to help slow the virus's spread, and began posting daily updates in early February. In February, the Heath Secretary, Matt Hancock, proposed the Health Protection (Coronavirus) Regulations 2020. Hospitals set up drive-through screening (testing for the disease). The Chief Medical Officer for England, Chris Whitty, created a four-stage strategy to tackle the outbreak: contain, delay, research and mitigate (help, lessen). ==Cases== First cases in the United Kingdom were on on 28 February, and by 1March there were cases in England, Wales, Scotland and Northern Ireland. ==Government response during the pandemic== The government created the Coronavirus Action Plan, and said the outbreak a \"level 4 incident\". On 11 March, the outbreak was declared a pandemic. Four days later—following the outbreak in Italy, the government said everyone should avoid all \"non- essential\" travel and contact with others, avoid crowds, and work from home if possible. Those with symptoms, and their household, were asked to self- isolate. Pregnant women, the over 70s, and those with certain illnesses were asked to self-isolate for longer. Panic buying was reported. ==Lockdowns== On 20 March 2020, the four governments shut all schools, restaurants, pubs, indoor entertainment venues and leisure centres, with some exceptions. On 23 March, the UK government made a lockdown on the whole population, banning all \"non-essential\" travel and contact with people outside one's home and shutting almost all businesses, venues, facilities, amenities and places of worship. People were told to keep apart in public. Police were given the power to enforce the lockdown, and the Coronavirus Act 2020 gave the government emergency powers not used since the Second World War.\"What is in the Coronavirus Bill? Key areas of the new legislation\". The Telegraph, 25 March 2020.\"Britain Placed Under a Virtual Lockdown by Boris Johnson\". The New York Times, 23 March 2020. More lockdowns took place in October, November and December 2020. Different places had different rules.GOV.uk https://www.gov.uk/government/speeches/prime-ministers-statement-on- coronavirus-covid-19-31-october-2020 A national lockdown in England began on 5 January 2021. ==Effects== It is said that the lockdown will severely damage the UK economy,\"Chancellor Sunak warns of 'tough times' for UK economy\". BBC News, 14 April 2020. lead to millions of job losses,\"Coronavirus: More than 6.5 million jobs to be lost in UK lockdown, study predicts\". The Independent, 19 April 2020. worsen mental health and suicide rates,\"Coronavirus: 'Profound' mental health impact prompts calls for urgent research\". BBC News, 16 April 2020. and cause \"collateral\" deaths due to isolation, delays and falling living standards.\"Coronavirus: How to understand the death toll\". BBC News, 16 April 2020. Researchers suggest the lockdown could be lifted by shielding only the most vulnerable and using contact tracing.\"Coronavirus: 'Segment and shield' way to lift UK lockdown now\". BBC News, 5 May 2020. Some schools stayed open to teach the children of essential workers, at-risk children, and children with special education needs. However, adults who work for disabled students' rights told Parliament that British educators had unfairly sent special education students home without good reasons. == Covid vaccine administration == Starting with the most at risk, the UK vaccinations is going in this order: ==Notes== ==References== Category:2020s in the United Kingdom United Kingdom Category:National Health Service Category:Health in the United Kingdom",
 "title": "COVID-19 pandemic in the United Kingdom"
}