{
 "id": "759166",
 "text": "The ongoing COVID-19 pandemic reached Ireland on 29 February 2020, and within three weeks had spread to all counties. ==Response== On 12 March 2020, the government shut all schools, colleges, childcare facilities and cultural institutions. St Patrick's Day festivals and events were cancelled. Taoiseach, Leo Varadkar addressed the nation that night. On 24 March, almost all businesses, venues, facilities and amenities were shut; but gatherings of up to four were allowed. Three days later, the government banned all \"non- essential\" travel. People were made to keep apart in public. ==Lockdown effect== The lockdown has caused a recession and a rise in unemployment,\"Coronavirus pushes unemployment in Ireland to ‘unprecedented’ level\". Financial Times, 21 April 2020. Quote: Mr Donohoe told reporters on Tuesday, “The necessary restrictions to limit the transmission of the Covid-19 virus have resulted in a severe recession and unprecedented levels of unemployment.”\" with a longer lockdown forecast to cause greater damage.\"Coronavirus Ireland: Country set for deep recession as economy to shrink by 10pc and mass unemployment grows\". Irish Independent, 21 April 2020. By mid-April 2020, the National Public Health Emergency Team (NPHET) reported that the growth rate of the pandemic had been \"as low as it needs to be\", that the curve had flattened and that there would be no peak coming. ==Cases== By 25 June 2021, the Department of Health had confirmed 270,477 cases and 4,989 deaths; a rate of 54,184 cases per million and 999 deaths per million population.Coronavirus cases: Reported Cases and Deaths by Country. Worldometer. More than 90% of those that have died were aged over 65,\"Over-65s account for 90% of coronavirus deaths recorded in Ireland\". The Irish Times, 13 April 2020. and most also had underlying illnesses or lived in care homes.\"Nursing homes account for 50 per cent of coronavirus deaths in Ireland\". The Irish Times, 30 April 2020. ==References== Category:2020s in the Republic of Ireland Republic of Ireland",
 "title": "COVID-19 pandemic in the Republic of Ireland"
}