{
 "id": "759163",
 "text": "The COVID-19 pandemic was confirmed to have reached Thailand on 13 January 2020, when the first case outside China was announced. ==Cases== The first reported local transmission was confirmed on 31 January. The number of cases remained low throughout February, with forty confirmed by the end of the month. Cases had a sharp increase in mid-March. Confirmed cases rose to over a hundred per day over the following week, and public areas and businesses were ordered to close in Bangkok and several other provinces. ==Response== Prime Minister Prayut Chan-o-cha declared a state of emergency, beginning on 26 March. A curfew has been announced, beginning on 3 April 2020. The Thai government's response to the outbreak was based on surveillance and tracing. Temperature and symptom screening for coronavirus testing was added at international airports, as well as at hospitals for patients with travel or contact history. Ads were introduced focused on self-monitoring for at-risk groups, practicing hygiene (especially hand washing), and avoiding crowds (or wearing masks if not possible). While residents returning from high-risk countries were encouraged to self-quarantine, travel restrictions were not announced until 5 March, when four countries were designated as \"disease- infected zones\". ==Criticism== The government was criticized for its slow response to the crisis. In early February, in response to concerns over hoarding and price increase of face masks, the government issued price controls. The move failed to prevent shortages among hospitals, and became a scandal. Criticism was also for the slow response to end foreign travel. == Background == On 12 January, the World Health Organization (WHO) confirmed that a novel coronavirus was the cause of a respiratory illness in a cluster of people in Wuhan City, Hubei Province, China, who had initially come to the attention of the WHO on 31 December 2019. Unlike SARS of 2003, the case fatality ratio for COVID-19 has been much lower, but the transmission has been significantly greater, with a significant total death toll. ==References== Category:2020s in Thailand Thailand",
 "title": "COVID-19 pandemic in Thailand"
}