{
 "id": "759112",
 "text": "The COVID-19 pandemic started with a large number of unknown, possible pneumonia cases in the city of Wuhan, the capital of Hubei province, China. A Wuhan hospital told the local center for disease control and prevention (CDC) and health commissions on 27 December 2019. ==The beginning== On 31 December, the Wuhan CDC told the media that there was a large number of unknown pneumonia cases related to Huanan Seafood Market. The possible disease outbreak soon became known nationwide including that of the National Health Commission (NHC) in Beijing who sent experts to Wuhan on the following day. Chinese authorities notified the World Health Organisation on this same day. On 8 January, a new coronavirus was identified as the cause of the pneumonia. ==Government response== Public and media criticized Chinese officials for a slow response to fight the outbreak when it first started. By 29 January, the virus spread to all provinces of mainland China. All provinces of mainland China began a large public health emergency. The World Health Organization declared the outbreak a \"Public Health Emergency of International Concern\" on 31 January, saying that there are reasons that it could spread to other countries, such as those without robust healthcare systems. By 8 February, over 724 died from the coronavirus and 34,878 were confirmed to have been infected. In Hubei alone, there were 24,953 cases of infections and 699 related deaths. The Chinese government may have censored talks about the outbreak since the beginning of its spread. On 25 January, Chinese Communist Party General Secretary Xi Jinping warned about a \"grave situation\" in China. The Chinese New Year celebrations were cancelled. Passengers across the country have been checked for their temperatures. By 29 January, all Hubei cities were quarantined. Curfew laws were added in Huanggang, Wenzhou, and other mainland cities. ==Shortages== In February 2020, the region also saw a huge shortage of face masks and other protective gear even though China called themselves the world's largest makers of these masks. Other countries donated medical supplies to help China deal with the epidemic. ==Lowering numbers== On 25 February, the number of newly confirmed cases outside mainland China passed those from within for the first time. By 6 March the reported number of new cases had dropped to well fewer than 100 nationally per day, down from thousands per day. == Origin == Many human coronaviruses have their origin in bats.Wertheim JO, Chu DK, Peiris JS, Kosakovsky Pond SL, Poon LL 2013. A case for the ancient origin of coronaviruses. Journal of Virology. 87 (12): 7039–45. doi:10.1128/JVI.03273-12. PMC 3676139. PMID 23596293 The human coronavirus NL63 shared a common ancestor with a bat coronavirus (ARCoV.2) between 1190 and 1449 AD. The human coronavirus 229E shared a common ancestor with a bat coronavirus (GhanaGrp1 Bt CoV) between 1686 and 1800 AD. More recently, alpaca coronavirus and human coronavirus 229E diverged sometime before 1960. MERS-CoV emerged in humans from bats through the intermediate host of camels. MERS-CoV, although related to several bat coronavirus species, appears to have diverged from these several centuries ago. The most closely related bat coronavirus and SARS-CoV diverged in 1986. The ancestors of SARS- CoV first infected leaf-nose bats; later, they spread to horseshoe bats, then to Asian palm civets, and finally to humans. === Racism === Racism among Asians such as Chinese people grew during the pandemic such as criticisms of their markets, lifestyles and food choices. Some rumors say that China made the virus in a lab. == Related pages == * pneumonia and COPD (chronic obstructive pulmonary disorder) * avian flu (influenza) * COVID-19 * steroid * MERS ==Notes== ==References== China",
 "title": "COVID-19 pandemic in mainland China"
}