{
 "id": "759534",
 "text": "James Montgomery (December 22, 1814 - December 6, 1871) was a Jayhawker during Bleeding Kansas. He was also a controversial Union colonel during the American Civil War. Montgomery was a strong supporter of abolitionist ideas and individual liberty, and he used extreme actions against pro-slavery people. ==Early life and Bleeding Kansas== James Montgomery was born on December 22, 1814 in Austinburg, Ashtabula County, Ohio; his parents were James and Mary Baldwin Montgomery.Clan Montgomery Society International Genealogical Database He moved to Kentucky in 1837 with his parents, and he taught school there. He married, but his first wife died shortly after the wedding, so he married again to Clarinda Evans. They moved to Pike County, Missouri in 1852, and then to Jackson County, and finally to Bates County while waiting for Kansas to be open to settlement. In 1854 Montgomery bought land near present-day Mound City, Kansas. There, he became a leader of local Free-state men and was a strong abolitionist.Cutler, William G., History of the State of Kansas, A. T. Andreas, 1883, \"The Era of Peace\", Part 43Castel, Albert, Civil War Kansas: Reaping the Whirlwind, University Press of Kansas, 1997, page 42 In 1857 he organized and led a \"Self-Protective Company\", using it to move pro-slavery people out of the area. Fights with other pro-slavery people led territorial governor James W. Denver to send U.S. Army soldiers in to restore order. Montgomery sometimes worked with the abolitionist John Brown and thought about doing a raid to rescue Brown after his capture in Virginia, but snow in Pennsylvania upset his plan. ==Civil War== On July 24, 1861, Montgomery was hired as a colonel of the 3rd Kansas Infantry of U.S. Senator James H. Lane's Kansas brigade, with Montgomery as second-in-command of the brigade. ==Later life== After the war, Montgomery went back to his farm in Linn County, Kansas, where he died on December 6, 1871. ==References== ==Other websites== * * Civil War St. Louis website, article about Jayhawking by Castel * Col. James Montgomery from Cutler's History of the State of Kansas * Clan Montgomery Society International Genealogical Database * James Montgomery at the Battle of Olustee Category:1814 births Category:1871 deaths Category:American abolitionists",
 "title": "James Montgomery (colonel)"
}