{
 "id": "759707",
 "text": "The World Snooker Championship is the leading snooker event both in terms of prestige and prize money. The first event was held in 1927 and was won by Joe Davis. Davis won the first 15 championships before retiring from the event, after his 1946 win. In the 1950s snooker went into a period of decline and the championship was not held after 1952, although an unofficial championship was held until 1957. In 1964 the championship was revived on a \"challenge basis\" and in 1969 the championship became a knock-out event again. Since 1977 it has been played at the Crucible Theatre in Sheffield, England. The tournament is currently played over 17 days and ends on the first Monday in May. Since 1969 (the modern era), Ronnie O'Sullivan and Stephen Hendry have won the event most (seven times). Kyren Wilson is the most recent winner. He beat Jak Jones in the 2024 final. == Winners == === Top performers of the modern era === The 'modern' era is considered to start in 1969, when the championship returned to a knock-out tournament from a challenge format. In the modern game, the best record is that of Stephen Hendry, who won seven times in the 1990s. Steve Davis won six times in the 1980s, as did Ray Reardon in the 1970s. Name Nationality Winner or better 147s Appearances Winrate 7 2 12 3 27 25.9% 6 2 11 0 30 20.0% 6 1 10 0 19 31.6% 5 1 11 27 18.5% 4 4 10 0 25 16.0% 3 1 6 1 21 14.2% 3 1 6 0 18 16.7% 3 1 5 0 15 20.0% 2 2 7 0 19 10.5% 1 2 6 1 19 5.3% 1 2 4 0 24 4.2% 1 2 4 0 17 5.8% 1 2 3 0 19 5.3% 1 2 3 0 20 5.0% 1 1 5 0 21 4.8% 1 1 4 0 10 10.0% 1 1 3 0 19 5.3% 1 1 3 0 23 4.3% 1 1 2 0 8 12.5% 1 0 3 0 15 6.6% 1 0 1 0 13 7.6% 0 6 10 1 25 0% 0 2 8 0 21 0% 0 2 6 0 16 0% 0 2 3 1 17 0% 0 1 5 0 14 0% 0 1 3 0 13 0% 0 1 2 0 15 0% 0 1 2 0 13 0% 0 1 2 0 7 0% 0 1 2 0 11 0% 0 1 1 0 12 0% 0 1 1 0 17 0% 0 1 1 0 4 0% * Active players are shown in bold. * Only players who reached the final are included. * == References == ==Other websites == * Category:World Snooker Championship Category:Snooker tournaments",
 "title": "World Snooker Championship"
}