{
 "id": "759932",
 "text": "The Eurovision Song Contest 2021 was the 65th edition of the Eurovision Song Contest that took place in the Netherlands's second largest city Rotterdam, after Duncan Laurence won for his country in Tel Aviv, Israel. The Eurovision Song Contest 2020 was cancelled due to the COVID-19 pandemic and was replaced with a live TV show called Eurovision: Europe Shine a Light. It was later announced that Rotterdam will host the 2021 edition. The contest took place from 18 to 22 May 2021 with two semi-finals and one final. The Netherlands hosted the contest for the fifth time. The EBU confirmed that 39 countries will participate in 2021. Like the previous year, Hungary and Montenegro did not take part. Armenia also did not take part, while Belarus was disqualified after their intended entry violated the contest's rules. Due to the ongoing pandemic, the EBU presented several scenarios (A, B, C and D) in which the competition could take place. == Venue == The contest happened in Rotterdam Ahoy in Rotterdam and was organized by the Dutch broadcasters NPO, NOS and AVROTROS. == Hosts == There were four presenters hosting the contest in Rotterdam: Chantal Janzen, Jan Smit, Edsilia Rombley and Nikkie de Jager. == Slogan == The slogan of the Eurovision Song Contest 2021 was Open Up. It was already planned for the 2020 contest and later confirmed that it would be used again. == Rule changes == For the 2021 edition, it was announced by the EBU that pre-recorded backing vocals will be allowed for the live shows. In previous years these had to be performed live. == Entries == Because the contest was cancelled last year, many countries decided to send their representative from last year again. However, the EBU announced that completely new songs have to be submitted for 2021. == Participating countries == ===Semi-final 1=== The first semi-final took place on 18 May 2021 at 21:00 (CEST). Sixteen countries participated in the first semi-final. Those countries plus , and the voted in this semi-final. was originally allocated to participate in the first half of the semi-final, but was disqualified from the contest after submitting an entry in violation of the rules. The highlighted countries qualified for the final. Draw Country Artist Song Language(s) Place Points 01 The Roop \"Discoteque\" English 4 203 02 Ana Soklič \"Amen\" English 13 44 03 Manizha \"Russian Woman\" Russian, English 3 225 04 Tusse \"Voices\" English 7 142 05 Montaigne \"Technicolour\" English 14 28 06 Vasil \"Here I Stand\" English 15 23 07 Lesley Roy \"Maps\" English 16 20 08 Elena Tsagrinou \"\" English 6 170 09 Tix \"Fallen Angel\" English 10 115 10 Albina \"Tick-Tock\" English, Croatian 11 110 11 Hooverphonic \"The Wrong Place\" English 9 117 12 Eden Alene \"Set Me Free\" English 5 192 13 Roxen \"Amnesia\" English 12 85 14 Efendi \"Mata Hari\" English 8 138 15 Go_A \"Shum\" () Ukrainian 2 267 16 Destiny \"\" English 1 325 ===Semi-final 2=== The second semi-final took place on 20 May 2021 at 21:00 (CEST). Seventeen countries participated in the second semi-final. Those countries plus , and the voted in this semi-final. was originally allocated to participate in the second half of the semi-final, but withdrew from the contest due to social and political crises in the aftermath of the 2020 Nagorno-Karabakh war. The highlighted countries qualified for the final. Draw Country Artist Song Language(s) Place Points 01 Senhit \"\" English 9 118 02 Uku Suviste \"The Lucky One\" English 13 58 03 Benny Cristo \"Omaga\" English 15 23 04 Stefania \"Last Dance\" English 6 184 05 Vincent Bueno \"Amen\" English 12 66 06 Rafał \"The Ride\" English 14 35 07 Natalia Gordienko \"Sugar\" English 7 179 08 Daði og Gagnamagnið \"10 Years\" English 2 288 09 Hurricane \"\" Serbian 8 124 10 Tornike Kipiani \"You\" English 16 16 11 Anxhela Peristeri \"Karma\" Albanian 10 112 12 The Black Mamba \"Love Is on My Side\" English 4 239 13 Victoria \"Growing Up Is Getting Old\" English 3 250 14 Blind Channel \"Dark Side\" English 5 234 15 Samanta Tīna \"The Moon Is Rising\" English 17 14 16 Gjon's Tears \"Tout l'Univers\" French 1 291 17 Fyr & Flamme \"\" Danish 11 89 === Final === The final took place on 22 May 2021 at 21:00 (CEST). Twenty-six countries participated in the final, with all thirty-nine participating countries eligible to vote. Draw Country Artist Song Language(s) Place Points 01 Elena Tsagrinou \"\" English 16 94 02 Anxhela Peristeri \"Karma\" Albanian 21 57 03 Eden Alene \"Set Me Free\" English 17 93 04 Hooverphonic \"The Wrong Place\" English 19 74 05 Manizha \"Russian Woman\" Russian, English 9 204 06 Destiny \"\" English 7 255 07 The Black Mamba \"Love Is on My Side\" English 12 153 08 Hurricane \"\" Serbian 15 102 09 James Newman \"Embers\" English 26 0 10 Stefania \"Last Dance\" English 10 170 11 Gjon's Tears \"Tout l'Univers\" French 3 432 12 Daði og Gagnamagnið \"10 Years\" English 4 378 13 Blas Cantó \"\" Spanish 24 6 14 Natalia Gordienko \"Sugar\" English 13 115 15 Jendrik \"I Don't Feel Hate\" English 25 3 16 Blind Channel \"Dark Side\" English 6 301 17 Victoria \"Growing Up Is Getting Old\" English 11 170 18 The Roop \"Discoteque\" English 8 220 19 Go_A \"Shum\" () Ukrainian 5 364 20 Barbara Pravi \"\" French 2 499 21 Efendi \"Mata Hari\" English 20 65 22 Tix \"Fallen Angel\" English 18 75 23 Jeangu Macrooy \"Birth of a New Age\" English, Sranan Tongo 23 11 24 Måneskin \"\" Italian 1 524 25 Tusse \"Voices\" English 14 109 26 Senhit \"\" English 22 50 === No return to the contest === These countries confirmed that they will not take part in 2021: * * * * * * * * * * ==References== ==Other websites== * Category:2021 in music Category:2021 in Europe Category:2021 in the Netherlands 2021 Category:May 2021 events Category:Rotterdam",
 "title": "Eurovision Song Contest 2021"
}