{
 "id": "76039",
 "text": "Taylor Alison Swift (born December 13, 1989) is an American singer-songwriter, record producer and actress. She is known for narrative songs about her personal life, as well as songs she wrote about other famous people, including Rebekah Harkness in the song “The Last Great American Dynasty”. She has sold more than 52 million albums, including 37 million in the US. She is one of the world's best-selling music artists. She is the highest-earning female musician of the 2010s and 2020s. Taylor Swift has won 14 Grammy Awards, an Emmy Award, and 118 Guinness World Records. She is the most-awarded act and woman at the American Music Awards (29 wins) and Billboard Music Awards (23 wins). She has had eleven number-one songs on the Billboard Hot 100. In October 2023, she became a billionaire. She won Apple Music Artist of the Year in 2020 and 2023. ==Early life== Taylor Alison Swift was born on December 13, 1989, at Reading Hospital in West Reading, Pennsylvania, the daughter of Scott Swift and Andrea Gardner. She is named after singer-songwriter James Taylor.She has a younger brother, actor Austin Swift. Swift was raised in Wyomissing, Pennsylvania on a Christmas tree farm. She became interested in musical theater when she was nine. Later, she became interested in country music. On weekends, she performed music at local events. She moved to Hendersonville, Tennessee, near Nashville, when she was 14. Her family moved there to help Swift's career in country music. In Nashville, she went to Hendersonville High School for two years. After that, she went to Aaron Academy, because Aaron Academy made it easier for her to tour while in school. She graduated high school one year early. Additionally, at the age of 10, Swift won a poetry writing competition. ==Career== ===2006 - 2007: debut album=== She released her first single, \"Tim McGraw\", in 2006 at the age of 16. That same year she released her first album, Taylor Swift. The album reached number 5 on the Billboard albums chart, and sold one million copies by November 2007. She won Country Music Television's (CMT) \"Breakthrough Video of the Year\" award in 2007 for \"Tim McGraw\". She was also nominated by the Academy of Country Music for \"Top New Female Vocalist\". ===2008 - 2010: Fearless and Speak Now=== Swift’s second studio album, Fearless, was released in 2008. On September 10, 2009 it reached Platinum, selling 1 million copies. On October 25, 2010 she released her third album, Speak Now. ===2012 - 2014: Red=== The lead single from Swift's fourth album, Red, \"We Are Never Ever Getting Back Together\", became her first number-one song on the US Billboard Hot 100. The single \"I Knew You Were Trouble\" reached number two on the chart. It was also her first chart-topper on Billboard's Mainstream Top 40/Pop Songs chart. In 2012 Swift voiced the character Audrey in the movie The Lorax. ===2014 - 2016: 1989=== Swift performed \"Shake It Off\", the lead single from her fifth album, 1989, at the 2014 MTV VMAs. 1989 was released on October 27, 2014. \"Shake It Off\", along with the singles \"Blank Space\", and \"Bad Blood\", all reached number one on the Billboard Hot 100. These singles, along with \"Style\" and \"Wildest Dreams\", have also topped the Mainstream Top 40/Pop Songs chart. 1989 was based off of Taylors birthday year, 1989. In 2016 she featured on the single, \"I Don't Wanna Live Forever\" with English singer Zayn Malik (former member of One Direction). It was released as a single for the soundtrack of the film Fifty Shades Darker (2017). It reached number two on the Hot 100 in the US and Canada. ===2017 - 2019: reputation=== On June 8, 2017, Swift restored her music on streaming sites such as Spotify and Apple Music after previously removing it from being streamed. On August 25, 2017, Swift released the single \"Look What You Made Me Do\", which topped the Billboard Hot 100 and broke YouTube's streaming record after getting 43 million views within 24 hours. It also became her first UK chart-topper. Swift announced that her sixth studio album, Reputation, would be released on November 10, 2017. The album included singles such as \"...Ready for It?\" and \"End Game\" featuring American rapper Future and English singer Ed Sheeran. During this era, she met backstage with global superstar Oliver Kang ===2019 - 2020: Lover=== On April 26, 2019, Swift released the single \"Me!\" featuring Brendon Urie as the lead single from her seventh studio album, Lover. On June 14, 2019, Swift released Lover’s second single \"You Need to Calm Down\". Both of these songs reached number two on the US Hot 100. On August 16, Swift released \"Lover\" as the third single from Lover. She released a duet version of Lover with Canadian recording artist Shawn Mendes. === 2020 - 2021: folklore and evermore === In August 2020, Swift revealed that she was releasing a surprise album called folklore, after it was announced her Loverfest stadium tour was canceled due to the coronavirus pandemic. Its lead single, \"cardigan\", entered at number one on the US Hot 100, becoming her sixth US number-one single. folklore became her seventh US number-one album. She became the first artist to enter at number one on both the Hot 100 singles chart and Billboard 200 album chart in the same week. On December 11, 2020, Swift released her ninth studio album, evermore. It is meant to be a \"sister\" album to folklore. === 2021 - 2022: Fearless (Taylor's Version), Red (Taylor's Version) and Midnights === Due to Swift not being able to own her own masters, she has begun re-recording all of her old albums. She released the first song from the re-recording of Fearless (Taylor's Version), \"Love Story\" on February 12, 2021. On November 12, 2021 she released Red (Taylor's Version). Swift's 10th studio album Midnights came out on October 21, 2022. === 2023 - 2024: The Eras Tour, Speak Now (Taylor's Version) and 1989 (Taylor's Version) === In March 2023 Swift started her Eras Tour. The tour covers all her albums. The US part of the tour sold the most tickets in one day ever. Many people said that the company handling the ticket sales, Ticketmaster, did not do well. The Eras Tour earned the most money of any tour in history. It earned over $1 billion. During this time, she also released Speak Now (Taylor's Version) and 1989 (Taylor's Version). === 2024–present: The Tortured Poets Department === On February 4, 2024, Swift won Album of the Year at the 66th Grammy Awards. She was the first artist to win in this category four times. She announced a new album, The Tortured Poets Department, due for release on April 19. == Discography & Filmography == === Studio albums === Year Album COU COU 2006 Taylor Swift 5 1 14 1 81 33 38 2008 Fearless 1 1 1 1 5 2 1 2010 Speak Now 1 1 1 6 1 1 2012 Red 1 1 1 1 1 1 2014 1989 1 - 1 1 1 1 2017 Reputation 1 - 1 1 1 1 2019 Lover 1 - 1 1 1 1 2020 Folklore 1 - Evermore 1 2021 Fearless (Taylor's Version) 1 Red (Taylor's Version) 1 2022 Midnights 1 2023 Speak Now (Taylor's Version) 1 1989 (Taylor's Version) 1 2024 The Tortured Poets Department === Singles === Year Song COU Album 2006 \"Tim McGraw\" 40 6 - - - Taylor Swift 2007 \"Teardrops on My Guitar\" 13 2 63 - - - \"Our Song\" 16 1 54 - - - 2008 \"Picture to Burn\" 28 3 85 - - - \"Should've Said No\" 33 1 67 - - 18 \"Love Story\" 4 1 4 2 1 - Fearless \"White Horse\" 13 2 43 60 41 - 2009 \"You Belong With Me\" 2 1 30 5 - \"Fifteen\" 23 7 63 - 48 - 2010 \"Fearless\" 9 10 - - - \"Today Was a Fairytale\" 2 1 57 3 29 Valentine's Day OST \"Mine\" 3 2 7 30 9 16 Speak Now \"Back to December\" 6 3 7 - 26 24 2011 \"Mean\" 11 2 10 - 45 - \"The Story of Us\" 41 - 70 - - - \"Sparks Fly\" 17 1 28 - - - \"Ours\" 13 1 71 - - - 2012 \"We Are Never Ever Getting Back Together\" 1 1 1 4 3 1 Red \"Begin Again\" 7 10 4 30 20 11 \"I Knew You Were Trouble\" 2 - 2 2 3 3 \"Everything Has Changed\" (featuring Ed Sheeran) 7 2013 \"22\" 20 9 21 23 2014 \"Shake It Off\" 1 - 1 2 1 1 1989 \"Blank Space\" 1 - 1 4 1 2 2015 \"Style\" 6 - 6 21 8 11 \"Bad Blood\" 1 - 1 4 1 1 \"Wildest Dreams\" 5 - 4 40 3 8 2016 \"Out of the Woods\" 18 - - 19 6 \"New Romantics\" 46 - - 35 - \"I Don't Wanna Live Forever\" 2 - 2 5 3 4 Fifty Shades Darker OST 2017 \"Look What You Made Me Do\" 1 1 1 1 1 Reputation \"...Ready for It?\" 4 7 7 3 9 \"End Game\" (featuring Ed Sheeran and Future) 18 288 49 \"New Year's Day\" 2018 \"Gorgeous\" 13 9 15 9 19 \"Delicate\" 12 20 28 33 \"Getaway Car\" 2019 \"Me!\" (featuring Brendon Urie of Panic! At the Disco) 2 2 3 2 3 Lover \"You Need to Calm Down\" 2 4 5 3 5 \"Lover\" 10 7 14 3 3 2020 \"Cardigan\" 1 Folklore \"Exile\" \"Betty\" \"Willow\" Evermore 2021 \"Champagne Problems\" 1 1 1 1 1 1 ==Music videos== * \"Tim McGraw\" (July 22, 2006) ==Live performances== * \"Big Star\" (featuring Kenny Chesney) (September 17, 2011) * \"The Middle\" (featuring Jim Adkins) (October 22, 2011) * \"Every Mile a Memory\" (featuring Dierks Bentley) (September 21, 2015) == Concert tours == === Headlining === * Fearless Tour (2009 - 2010) * Speak Now World Tour (2011 - 2012) * The Red Tour (2013 - 2014) * The 1989 World Tour (2015) * Reputation Stadium Tour (2018) * The Eras Tour (2023 - 2024) === Cancelled tours === * Lover Fest (2020) == Awards == * Grammy Awards **2010 (52nd Award Ceremony) *** Album of the Year, Fearless ***Best Country Album, Fearless *** Best Female Country Vocal Performance, \"White Horse\" *** Best Country Song, \"White Horse\" ** 2012 (54th Award Ceremony) *** Best Country Solo Performance, \"Mean\" *** Best Country Song, \"Mean\" ** 2013 (55th Award Ceremony) *** Best Song Written for Visual Media, \"Safe & Sound\" (from The Hunger Games) ** 2016 (58th Award Ceremony) *** Album of the Year, 1989 ***Best Pop Vocal Album, 1989 *** Best Music Video, \"Bad Blood\" ** 2021 (63rd Award Ceremony) *** Album of the Year, folklore ** 2024 (66th Award Ceremony) *** Album of the Year, Midnights *** Best Pop Vocal Album, Midnights * CMT Music Awards ** 2007, Breakthrough Video of the Year: Tim McGraw * Academy of Country Music Awards ** 2008, Best New Female Vocalist == Nominations == * Country Music Association Award ** 2007, Horizon Award * American Music Awards ** 2007, Favorite Female Artist, Country Music * Academy of Country Music Awards ** 2007, Top New Female Vocalist * Grammy Awards **2008 (50th Award Ceremony) ***Best New Artist ** 2010 (52th Award Ceremony) *** Record of the Year, \"You Belong with Me\" *** Song of the Year, \"You Belong with Me\" *** Best Female Pop Vocal Performance, \"You Belong with Me\" ***Best Pop Collaboration with Vocals, \"Breathe\", featuring Colbie Caillat **2012 (54th Award Ceremony) ***Best Country Album, Speak Now **2013 (55th Award Ceremony) ***Record of the Year, \"We Are Never Ever Getting Back Together\" ***Best Country Duo/Group Performance, \"Safe and Sound\", featuring The Civil Wars **2014 (56th Award Ceremony) *** Album of the Year, Red ***Best Country Album, Red ***Best Country Song, \"Begin Again\" ***Best Country Duo/Group Performance, \"Highway Don't Care\" (with Tim McGraw, featuring Keith Urban) **2015 (57th Award Ceremony) *** Record of the Year, \"Shake It Off\" *** Song of the Year, \"Shake It Off\" ***Best Pop Solo Performance, \"Shake It Off\" **2016 (58th Award Ceremony) *** Record of the Year, '\"Blank Space\" *** Song of the Year, \"Blank Space\" *** Best Pop Solo Performance, \"Blank Space\" ***Best Pop Duo/Group Performance, \"Bad Blood\", featuring Kendrick Lamar ** 2018 (60th Award Ceremony) *** Best Country Song, \"Better Man\" *** Best Song Written for Visual Media, \"I Don't Wanna Live Forever\" (from Fifty Shades Darker) ** 2019 (61st Award Ceremony) *** Best Pop Vocal Album, Reputation ** 2020 (62nd Award Ceremony) *** Song of the Year, \"Lover\" ***Best Pop Vocal Album, Lover *** Best Pop Solo Performance, \"You Need to Calm Down\" ** 2024 (66th Award Ceremony) *** Best Pop Duo/Group Performance, \"Karma\" (featuring Ice Spice) *** Song of the Year, \"Anti-Hero\" *** Record of the Year, \"Anti- Hero\" *** Best Pop Solo Performance, \"Anti-Hero\" ==References== ==Other websites== * Taylor Swift official website Category:1989 births Category:American country singers Category:American feminists Category:American pop singers Category:American singer-songwriters Category:Singers from Pennsylvania Category:American movie actors Category:American television actors Category:Living people Category:Synth-pop singers Category:Time People of the Year Category:Award winning singers Category:Big Machine Records artists Category:RCA Records artists Category:People with anorexia",
 "title": "Taylor Swift"
}