{
 "id": "7604",
 "text": "is a Japanese company that makes video games and video game consoles. At first, it began by creating playing cards and other toys and games. Their main office is in Kyoto, Japan. They also have offices in other continents. Nintendo made many of the most popular and best-selling consoles of all time, like the Game Boy, Nintendo DS, Wii and Nintendo Switch. Altogether, Nintendo has sold over 700 million consoles (2018) and over 5 billion games (2022). == History == Nintendo was formed on September 23, 1889. Originally, they were a company that made playing cards. Then it went on to making toys. In the 1960s, they started doing other things, such as owning hotels. They began making video games only in the 1970s. In 1980, they came out with a hand-held game device called Game and Watch. Nintendo's first video game console was the Color TV Game. The Famicom, Nintendo's second console, was first only released in Japan. It was later released in some other areas, such as North America and Europe. When they released it in there, its name was changed to the Nintendo Entertainment System, or NES for short. They also released some popular stand- alone video games, with names like the arcade game Donkey Kong, and NES games Super Mario Bros., Duck Hunt, and The Legend of Zelda. Later, the company made hand-held game consoles such as the Game Boy, the DS, and the 3DS, while continuing to make more home consoles such as the Nintendo 64, GameCube, Wii, Wii U, and Switch. Nintendo later sold newer consoles, and a changing point happened with the Nintendo 64, or N64, which made the first Nintendo 3D games. One of its biggest games is Super Mario 64. == List of Nintendo video game consoles == * Nintendo Entertainment System (1985, NES) – known as the Famicom in Japan [or the \"Family Computer\"] * Game Boy (1989) * Super Nintendo Entertainment System (1990, SNES) – known as the Super Famicom in Japan [or the \"Super Family Computer\"] * Virtual Boy (1995) *Nintendo 64 (1996, N64) *Game Boy Color (1998, GBC) * Game Boy Advance (2001, GBA) *Nintendo GameCube (2001, GCN) *Game Boy Advance SP (2002) *Nintendo DS (2004, NDS) *Game Boy Micro (2005) *Nintendo DS Lite (2006) * Wii (2006) * Nintendo DSi (2008) * Nintendo DSi XL (2009) * Nintendo 3DS (2011, N3DS) * Nintendo 3DS XL (2012) *Wii U (2012) *Nintendo 2DS (2013) * New Nintendo 3DS (2014) * New Nintendo 3DS XL (2014) *Nintendo Switch (2017) * New Nintendo 2DS XL (2017) *Nintendo Switch Lite (2019) *Nintendo Switch OLED model (2021) == List of Nintendo products == ==Related pages== Other video game companies: * Sony * Sega * Microsoft ==References== Notes == Other websites == * Nintendo's American website (note: needs Adobe Flash) * Nintendo's Japanese website * Nintendo's European website Category:1889 establishments in Asia Category:1880s establishments in Japan",
 "title": "Nintendo"
}