{
 "id": "760587",
 "text": "Bill & Ted's Bogus Journey is a 1991 American science fiction comedy movie. It is the second movie in the Bill & Ted franchise, and a sequel to Bill & Ted's Excellent Adventure (1989). Keanu Reeves, Alex Winter, Hal Lando and George Carlin return to their roles from the first movie. It also stars William Sadler as Death. It received mixed reviews. A sequel, Bill & Ted Face the Music is scheduled to be released in August 2020. ==Cast== * Keanu Reeves as Ted \"Theodore\" Logan / Evil Ted ** Brendan Ryan as young Ted * Alex Winter as William S. \"Bill\" Preston / Granny S. Preston / Evil Bill ** William Throne as young Bill * William Sadler as Death **Sadler also plays an English Father (uncredited) * Joss Ackland as Chuck De Nomolos * George Carlin as Rufus * Chelcie Ross as Col. Oats * Pam Grier as Ms. Wardroe * Annette Azcuy as Elizabeth * Sarah Trigger as Joanna * Hal Landon Jr. as Captain Logan, Ted's father * J. Patrick McNamara as Mr. Ian Preston, Bill's father * Amy Stock- Poynton as Missy, formerly Bill's stepmother now Ted's * Ed Gale and Arturo Gil as Station * Tom Allard as Big Station * Michael \"Shrimp\" Chambers as Good Robot Bill * Bruno \"Taco\" Falcon as Good Robot Ted * Taj Mahal as Gatekeeper * Frank Welker as the voices of Satan, The Easter Bunny and Station (uncredited) * Tony Cox as Station (uncredited) Progressive rock/metal band Primus appear as themselves during Battle of the Bands, performing \"Tommy the Cat\". Musician Jim Martin, at the time the lead guitarist of Faith No More, also appears as himself, introduced by Rufus as \"Sir James Martin, head of the Faith No More Spiritual and Theological Center.\" Candace and Lauren Mead portray \"Little Bill\" Logan and \"Little Ted\" Preston; with the characters revealed in Bill & Ted Face the Music to be girls, whose full names are shown to be Billie Logan and Thea Preston. Sadler had been drawn to the role of Death as at the time, he had been cast as a serious villain in numerous films, but had wanted to return to doing comedy as he had done earlier in the Broadway production of Biloxi Blues. Having enjoyed Bill & Ted's Excellent Adventure, he thought the idea of Death as a villain in a comedic film would be a good role for him, auditioning via tape using an accent from Czechoslovakian actor Jan Tříska with whom he had co-performed in an earlier stage production. When he was called in to audition in person, they had asked him to come in aged makeup; Sadler contacted Scott Eddo, the makeup supervisor for Die Hard 2 to make him look authentically old, which Sadler believed helped get him the role, along with the humor he injected into the audition. Sadler said that in the film, nearly everything Death does was written into the script, outside of the same accent that he used from his audition forward. The name \"Station\" was the result of a leftover editing typo, according to the movie's writers Chris Matheson and Ed Solomon. They had cut a scene from the script, labeled \"INT. POLICE STATION\" but had left the \"STATION\" part dangling, and as they were drunk at the time, found that saying \"Station\" in a \"[tiny] Martian voice\" was hilarious, and the name stuck. ==References== Category:1991 science fiction movies Category:1991 comedy movies Category:American science fiction movies Category:American comedy movies Category:American independent movies Category:Movies directed by Pete Hewitt Category:Movies set in the 27th century Category:Movies about extraterrestrial life Category:Movies about the afterlife Category:Time travel movies",
 "title": "Bill & Ted's Bogus Journey"
}