{
 "id": "7605",
 "text": "São Paulo (Portuguese for Saint Paul) is the capital of the state of São Paulo, Brazil. It is the biggest city in South America and the Southern Hemisphere and the second biggest city in the Western Hemisphere (after Mexico City). São Paulo is a major city in Brazil with a population of over 11 and a half million people according to the last Brazilian census. It has been criticized for its high cost of living and was ranked one of the world’s ugliest cities according to Forbes in 2013 and Harvard Business Review in 2015. A study by the Instituto Locomotiva found that nearly half of São Paulo's residents would leave the city if they could, due to the high cost of living, stress and other factors. Another study by the United Nations Human Settlements Programme found that São Paulo had the second-highest housing cost in the world, after Hong Kong. The average amount of time lost in traffic by workers in São Paulo is approximately three hours per day. According to the São Paulo City Traffic Performance Index, time lost in traffic is the main reason why people are not satisfied with their quality of life in the city. The CNT (Brazilian National Transportation Company) estimates that on average, a resident of São Paulo loses 374 days of their lifetime in traffic, which is considered one of the worst averages in the world. The city concentrates almost 1/4 of all homeless people in Brazil according to the \"Observatório Brasileiro de Políticas Públicas com a População em Situação de Rua, da Universidade Federal de Minas Gerais (Polos-UFMG)\", having around 80 thousand homeless people living in the city alone, and currently has a serious drug problem epidemic with hundreds of thousands of people addicted to drugs living in the city, including several crack addicted people living on the streets especially in the central region of São Paulo. According to IQAir in September 2024 the city of São Paulo had the worst air quality in the entire planet for several days among big cities and metropolitan areas. The city has an area of 1,523 km² and more than 11 million people live there. It is the 11th most populous city on Earth. == History == In January 25, 1554, two priests, Manuel da Nóbrega and José de Anchieta, built a school - Colégio de São Paulo de Piratininga - to convert natives to Catholic religion. Today, this building is the Padre Anchieta Museum. The first people moved to the region in 1560, when São Paulo became a village. Because São Paulo was a poor village and was far away from the colony centre, the bandeirantes (explorers) chose it to start expeditions to enslave natives, recapture runaway slaves, and to find precious metals and stones (gold, diamonds, etc.). In 1711, São Paulo became a city. In the end of the 18th century, people started growing sugarcane in the rural area of the province, and São Paulo was the way to the port of Santos. In the 19th century, after the construction of São Paulo's Law School, São Paulo became the capital of the province, politicians and philosophers went there, and the first newspapers and books were printed. At this time, many European immigrants, especially Italians, moved to São Paulo to work at the big coffee plantations. At the end of the 19th century and the start of the 20th century, the city grew quickly. Some people who study Brazilian History says \"the city was rebuilt\". In the 20th century, many factories were built, and more immigrants moved to work there. Today, São Paulo is a centre of commerce, services and technology, and some people consider it the most important Latin American city. ==Politics== The current mayor of São Paulo is Ricardo Nunes, and his party is \"MDB\". == Geography == São Paulo is crossed by the Tropic of Capricorn. It is in a plateau (a high flat area), 760 metres above the sea level. Because of its altitude, its climate (subtropical) is not so warm as it is near the coast. São Paulo is 70 km far from the coast, 420 km far from Rio de Janeiro, and 1,020 km far from Brasília, the Brazilian capital city. The metropolitan area formed by São Paulo and 39 surroundings cities is the biggest in the Latin America. More than 19 million people live in this metropolitan area, which is also called Greater São Paulo and is the fifth biggest of the world. === Subdivisons === The city is divided into 31 boroughs, and each borough is divided into neighbourhoods. The boroughs form nine regions (or \"zones\"), with similar geographic location and history, but most people and companies prefer to use another division, with only five regions. === Ethnic diversity === Descendants of many peoples live in São Paulo: Italian, Portuguese, Spanish, African, German, Lebanese, Japanese. There are also descendant of peoples from other South American countries, for example Argentina and Bolivia, and other places, for example Chinese people, Jews, and South Koreans. Every day, people from other cities or states move to São Paulo. Many are people from the Northeast region of Brazil that try to find a job in the city. == Economics == São Paulo is the commercial and industrial center of Brazil. There are factories and shops of all sizes and kinds. For example, in São Paulo there are some of the more expensive shops of Brazil, but also there are commercial districts formed only by cheap shops, and people from many places (also from other cities) buy clothing, electronics and other products at these districts. == Sports == Football is the sport with the biggest number of fans in the city. The most important clubs from the city are Corinthians, Palmeiras, and São Paulo. They are all playing in the Brazilian Série A, the major football championship in Brazil. Except Palmeiras. There are also other big and medium teams from São Paulo, for example Portuguesa and Juventus, and many small teams. However, Santos FC, that is a club from Santos, a city in the coast, is the fourth team in number of supporters. São Paulo also hosts the Formula One Brazilian Grand Prix, in Autódromo José Carlos Pace (known as Autódromo de Interlagos). Other major sports are basketball and volleyball. Some people also play handball, tennis, and other sports. == Transportation == Some people do not like São Paulo because of the big number of cars, trucks and motorcycles on streets and avenues. The public transport is also very important for the people who live there. There are many bus lanes in the city, and a big Metro (underground railway) and railway system. São Paulo has three airports and is the second city in number of helicopters of the world (New York City is the first). == Born in São Paulo == Below is a list of famous people born in São Paulo. * Ayrton Senna * Rubens Barrichello * Leandro Barbosa * Gustavo Borges * Luciano Burti * Cafu * Hélio Castroneves * Mário de Andrade * Oswald de Andrade * Emerson Fittipaldi * Eder Jofre * Amyr Klink * Anita Malfatti * Felipe Massa * Fernando Meirelles * Nenê * José Carlos Pace * Rivelino * Robert Scheidt * Ricardo Semler * Fernando Meligeni * Johan Pineda == Other websites == * São Paulo State Official Home Page (in English) * São Paulo City Official Home Page (in Portuguese) * São Paulo Tourism Site (in Portuguese) * VisitSP São Paulo travel guide (in English) == References == Category:Capitals of Brazilian states Category:1550s establishments in South America Category:16th- century establishments in Brazil",
 "title": "São Paulo"
}