{
 "id": "76052",
 "text": "The Messerschmitt Bf 109 was a fighter aircraft usually called the Me 109. It was a German World War II aircraft. Made by Messerschmitt, it first flew in 1935, and was used by the Luftwaffe during the Spanish Civil War and throughout World War II. It was one of the first modern fighters of the time. It had an all-metal construction, a closed cockpit, and retractable landing gear. It was powered by a liquid-cooled, inverted-V12 aero engine.Green, William. 1980. Messerschmitt Bf 109: the Augsburg eagle: a documentary history. London: Macdonald and Jane's Publishing Group. The Messerschmitt Bf-109, was a powerful single-propeller aircraft, used by the Germans as support aircraft. The Bf-109 was a worthy competitor as Germany’s greatest aircraft, though the Fw-190 proved more significant for some enemy engagements. The camouflaged aircraft fought in the heat of the 1940 Battle of Britain, going head to head with the English Spitfires. There were many variations designed for special purposes. Overall, the Me 109 was the most produced fighter aircraft in history, with a total of 33,984 airframes produced from 1936 up to April 1945.Nowarra, Heinz. 1993. Die Deutsche Luftrustung 1933–1945, Band 3: Flugzeugtypen Henschel-Messerschmitt. Koblenz, Germany: Bernard & Graefe. The design of the plane caused some problems on the ground, and with take-off and landing. At least 10% of all Bf 109s were lost in takeoff and landing accidents, 1,500 of which occurred between 1939 and 1941.Boyne, Walter J. 1994. Clash of wings. New York: Simon & Schuster, p30. A new fixed tailwheel helped correct the problem. Bf 109 was used by Luftwaffe together with FW 190. The Messerschmitt had two machine guns and one cannon while FW 190 had two machine guns and four cannons. Bf 109 was much lighter than FW 190, by 1500 kg. Despite that Bf 109 was almost as fast as FW 190 (Fw 190 A-8 was only 16kph faster than Bf 109 G-6) and climbed at 17 m/s, 2 m/s faster than FW 190. ==Related pages== *P-51 Mustang *Fw 190 *Hawker Hurricane *Supermarine Spitfire == References == Category:World War II German aircraft",
 "title": "Messerschmitt Bf 109"
}