{
 "id": "760890",
 "text": "Matthew Louis Gaetz II (; born May 7, 1982) is an American lawyer and politician. He was the U.S. representative for from 2017 to 2024. He is a member of the Republican Party. He is known as a strict Trump supporter. He has been seen as a strong supporter of far-right politics as well as an ally of president-reelect Donald Trump.Following are the sources detailing Gaetz's far-right politics: * * * * * * In 2020, Gaetz was accused of sex trafficking and having sexual relationships with minors. In October 2023, Gaetz filed a motion to vacate which led to the removal of Kevin McCarthy as Speaker of the U.S. House of Representatives. In November 2024, President-elect Donald Trump announced he would nominate Gaetz to serve as United States attorney general. Gaetz resigned from the U.S. House of Representatives shortly after his nomination. However after controversy regarding sexual abuse and sex trafficking accusations, Gaetz withdrew his nomination on November 21, 2024. ==Early life== Matthew Louis Gaetz II was born on May 7, 1982, in Hollywood, Florida, to Victoria ( Quertermous) and Don Gaetz, a politician. He was raised near Fort Walton Beach. He graduated from Florida State University in 2003 and from the William & Mary Law School in 2007. He became a lawyer in 2008. Gaetz worked at the law firm Keefe, Anchors & Gordon (now AnchorsGordon) in Fort Walton Beach. In October 2021, the Florida bar banned Gaetz from practicing law because of unpaid fees. He was allowed to become a lawyer again after the $265 fee was paid. ==Florida House of Representatives== In March 2010, Gaetz ran in the special election in the 4th district for the Florida Senate. He won with 43 percent of the vote. In the special general election, Gaetz beat Democratic nominee Jan Fernald with 66 percent of the vote. He ran for re- election and won in 2010 (for a full term), then in 2012 and 2014. Gaetz supported the death penalty during his time in the state senate. Gaetz was one of two members to vote against a Florida bill making revenge porn illegal in 2015. In 2015, Gaetz supported the presidential campaign of former Governor Jeb Bush. ==U.S. House of Representatives== In 2013, Gaetz announced that, in 2016, he would run for the 1st district Florida State Senate seat held by his father, Don Gaetz. In March 2016, Gaetz decided to run for the U.S. House instead. In August 2016, Gaetz won the Republican primary with 35.7 percent. In the November general election, Gaetz beat Democratic nominee Steven Specht with 69 percent of the vote. He was re-elected in 2018, 2020, 2022 and 2024. In January 2018, Gaetz invited alt-right Holocaust denier Charles C. Johnson to Donald Trump's State of the Union address. Gaetz has gone to political rallies in 2018 and 2019 at which members of the Proud Boys were present. On January 10, 2021, House Republican leader Kevin McCarthy argued with Gaetz on a phone call that he was unnecessarily \"putting people in jeopardy\" during the January 6 United States Capitol attack. In June 2021, Gaetz was one of 21 House Republicans to vote against a resolution to give the Congressional Gold Medal to police officers who defended the U.S. Capitol on January 6. Gaetz, a critic of Kevin McCarthy, voted against him for Speaker of the U.S. House, instead nominating former President Donald Trump.In House Speaker Fight, Trump Struggles to Play Kingmaker, New York Times, Maggie Haberman and Michael C. Bender, January 5, 2023. Retrieved January 7, 2023.Gaetz says he's talked to Trump about making him House speaker, MSNBC, Steve Benin, December 8, 2021. Retrieved January 7, 2023.Another day, similar result: Adjournment with no speaker, Roll Call, Aidan Quigley, Lindsey McPherson, Niels Lesniewski, Mark Satter, and Jessie Hellmann, January 5, 2023. Retrieved January 7, 2023. He made it harder for McCarthy to become speaker, however changed his vote on January 7, 2023.McCarthy wins speaker election, finally, Roll Call, Laurie MacPherson, Laura Weiss, and Caitlin Reilly, January 7, 2023. Retrieved January 7, 2023. However, in October 2023, Gaetz successfully filed a resolution to remove McCarthy from his role as speaker. In April 2024, McCarthy said that Gaetz wanted to remove him as speaker to protecting himself against allegations of having had sex with a 17 year old minor. Gaetz resigned from the U.S. House of Representatives on November 13, 2024 after he was nominated as United States Attorney General. ==Failed U.S. Attorney General nomination== In November 2024, President-elect Donald Trump announced he would nominate Gaetz to serve as United States attorney general during his second administration. His nomination surprised many Republicans and some did not like it. After his nomination, there was controversy about Gaetz paying minors for sex along with accusations of sex trafficking. Gaetz withdrew his nomination on November 21, 2024. ==Personal life== In December 2020, Gaetz announced his engagement to his girlfriend, Ginger Luckey. They married in August 2021. Gaetz is a Baptist. ==Legal issues== In 2020, Gaetz was accused of sex trafficking and having sexual relationships with minors. After an investigation, the United States Department of Justice (DOJ) decided not to charge him, although Gaetz remained under investigation of the House Ethics Committee up until his resignation. In March 2021, Gaetz was being investigated for having a sexual relationship with a 17-year-old girl in 2019, and that investigators were examining whether he had violated federal sex trafficking laws by allegedly paying her to travel with him. A few weeks later, Axios reported that Gaetz was \"seriously considering not seeking re- election and possibly leaving Congress early for a job at Newsmax\". Former White House aide Cassidy Hutchinson wrote in her memoir that Gaetz harassed her many times. She wrote that during a trip to Camp David in 2020 he interrupted her meeting with Kevin McCarthy, repeatedly asking her to \"escort\" him to his room. Gaetz has said that this is not true. ==References== ==Other websites== * Congressman Matt Gaetz official U.S. House website * Campaign website * * Category:1982 births Category:Living people Category:United States representatives from Florida Category:Members of the Florida Legislature Category:Republican Party (United States) politicians Category:American political activists Category:Lawyers from Florida",
 "title": "Matt Gaetz"
}