{
 "id": "761029",
 "text": "Per aspera ad astra (or the alternative Ad astra per aspera) is a Latin phrase that means \"through suffering to the stars\". The phrase is one of the many Latin phrases that use the expression ad astra, meaning \"to the stars\". ==Uses== Various organizations and groups use this expression and its variants. ===Governmental entities=== * Duchy of Mecklenburg-Schwerin * State of Kansas * Municipality of Cheribon, Netherlands East Indies * City of Gouda, The Netherlands * Honored Scientist of ArmeniaHonored Scientist of Armenia ===Military and government=== * Department of Civil Aviation, ThailandDepartment of Civil Aviation Emblems * Military Technical Academy in Bucharest, Romania * National Defence Academy of Latvia * South African Air Force * Spanish Air Force * Hon. Julie Payette, 29th Governor General of Canada * Royal Life Guards (Denmark) ===Literature=== * In Kenta Shinohara's Astra Lost in Space, it is inscribed on a plaque on the bridge of the ship that the crew subsequently decided to name the Astra. *In Kurt Vonnegut's The Sirens of Titan, it was quoted as both the motto of Martian Imperial Commandos, a unit within the larger Martian Army, in addition to being the motto of Kansas, U.S.A., Earth, Solar System, Milky Way. *In Harper Lee's \"To Kill a Mockingbird\", it was quoted as the motto of Maycombe, during the school play. *In Pierce Brown's \"Red Rising\" and \"Morning Star.\" *in Caledonian Road written by Andrew O’Hagan * The title of American astrophysicist Harlow Shapley's autobiography Through Rugged Ways to the Stars (1969). ===Music=== * The subtitle of Moritz Moszkowski's set of fifteen Études de Virtuosité for piano, op. 72 (published 1903). * The subtitle of Charles Villiers Stanford's Piano Trio No. 3, Op. 158 (1918). * The title of the fourth album by ambient music duo Stars of the Lid (1998). * The subtitle of Sergei Bortkiewicz's 3rd piano concerto (1927). * The title of a song by Spiritual Beggars from their album Ad Astra (2000). * The title of a song by Haggard (band) from their album \"Eppur Si Muove\" (2004). * Acceptance has an instrumental track on their Phantoms album titled \"Ad Astra Per Aspera\" (2005). * The title of the first album by the band Aeon Sable (2010). * The title of the second album (2011) by Abandon Kansas. * Per Aspera Ad Aspera, the name of a best-of album by the band ASP (2014). * The title of a march by Ernst Urbach op. 4 (1906). * The title of an album of marches by the Royal Norwegian Air Force Band. * The title of a composition by Hasaan Ibn Ali from his second Atlantic recording, never released, the master tapes of which were destroyed in the Atlantic warehouse fire of 1978. * The subtitle of an instrumental song by the symphonic metal band Nightwish (2020). * The title of the 7th and final song from album \"Spilia\" by Iratus (2024). * The title of a track on the 2024 album “Ad Astra” by the Italian singing trio Il Volo. * Part of the lyrics from the song \"Daffodils\" from the album \"Nadir\" by German black metal band Groza (2024). * Lyrics from the song titled “HARD” by South Korean group SHINee (2024). ===Educational and research institutions=== ====Australia==== *Queenwood School for Girls, Mosman NSW *Woodville High School, Adelaide, South Australia *Albury High School, Albury, New South Wales *Girton Grammar School, Bendigo, Victoria ====Austria==== *Universität Klagenfurt ====Botswana==== * St. Joseph's College, Kgale ====Ecuador==== *Instituto Nacional Mejía,Quito, Ecuador ====Estonia==== *Keila-Joa Boarding School, Türisalu *Jakob Westholm Secondary School, Tallinn ====Honduras==== *Escuela Nacional de Música, Tegucigalpa *Instituto Salesiano San Miguel, Tegucigalpa ====India==== *Clarence High School, Bangalore, Karnataka, India - Motto of Redwood House (Ad Astra) *St. Augustine's High School, kalimpong, District:Darjeeling, India * Maulana Azad Medical College (MAMC), New Delhi, India *The Frank Anthony Public School,Kolkata,India * The Frank Anthony Public School, Delhi, India - Motto of Ranger House *St Joseph's High School, Dharwad, Karnataka, India *Antonio D'souza High School, Mumbai, India *Technology Research and Incubation Centre, Dimapur, Nagaland ====Jamaica==== *Immaculate Conception High School, St. Andrew *Mount Alvernia High School, Montego Bay ====Japan==== * St. Francis Church, Tokyo, West-Hachioji, Gnosis Essene (HP) ====Macau SAR, China==== *Postgraduate Association of University of Macau, Macau, China ====Maldives==== *MNDF Fire and Rescue Services Training School, K.Viligili ====New Zealand==== *Rotorua Boys' High School, Rotorua ====Nigeria==== *Ilupeju College, Ilupeju, Lagos *Lagos Secondary Commercial Academy, LASCA *Kalabari National College, Buguma, Rivers State *Oriwu Model College, Igbogbo, Ikorodu ====Norway==== *Stavanger Cathedral School, Stavanger *Sortland videregående skole, Nordland *Lillehammer videregående skole *NTNU ====Pakistan==== *St Patrick's High School, Karachi *St. Patrick's College, Karachi ====Paraguay==== *Universidad Autónoma de Asunción ====Philippines==== *Far Eastern University - Nicanor Reyes Medical Foundation, Quezon City *St. John Paul II College of Davao, Davao City *Rosevale School, Cagayan de Oro City *Juan R. Liwag Memorial High School, Gapan City *Cagayan State University, Tuguegarao City ====Romania==== *Mihai Eminescu High School, Suceava *Colegiul National \"Andrei Saguna\" Brasov *Colegiul National \"Doamna Stanca\" Fagaras *Alexandru Papiu Ilarian High School, Targu-Mures *Andrei Mureşanu High School, Bistrița *, Csíkszereda (Liceul Teoretic \"Márton Áron\", Miercurea-Ciuc) *Ovidius High School, Constanta *Military Technical Academy, Bucharest ====Saint Vincent and the Grenadines==== *Saint Vincent Grammar School, Kingstown ====Slovakia==== *Faculty of Informatics and Information Technologies of Slovak University of Technology in Bratislava *Slovak Organisation for Space Activities ====Slovenia==== *Prva gimnazija Maribor, Maribor *Gimnazija Jesenice, Jesenice *Gimnazija Škofja Loka, Škofja Loka ====South Africa==== *Pietersburg Hoërskool *Tembisa Secondary School *Ribane-Laka Secondary School *Chistlehurst Academics and Arts School Worcester Primary School RSA ====Sri Lanka==== *St. Paul's Girls' School, Milagiriya, Colombo District, Western Province ====Sweden==== *Västmanland Air Force Wing ====Ukraine==== *Space Museum dedicated to Korolyov in Zhytomyr *Dnipropetrovsk Oblast *Bucha Ukrainian gymnasium ====United Kingdom==== *The Royal School, Haslemere, Surrey *Colfe's School, Greenwich, London *Mayfield Grammar School, Gravesend, Kent *Dr. Challoner's Grammar School, Amersham, Buckinghamshire *British Lawn Mower Racing Association ====United States==== *California State University East Bay, Hayward, California *Campbell University, Buies Creek, North CarolinaCampbell University: General Information *Cornelia Strong College, University of North Carolina at Greensboro, North Carolina *Coventry High School, Coventry, Rhode Island *East Hampton High School, East Hampton, Connecticut *Greenhill School, Dallas, TexasGreenhill School: Statement of Philosophy *Irvington Union Free School District, Irvington, New York *Saint Joseph Academy, Brownsville, Texas *Lake View High School, Chicago, Illinois *Lyndon Institute, Lyndon Center, Vermont *Macopin Middle School, West Milford, New Jersey *Miami Central High School, Miami, Florida *Midwood High School, Brooklyn, New York *Mirman School, Los Angeles, California *Morristown-Beard School, Morristown, New Jersey *Mount Saint Michael Academy, Bronx, New York *Satellite High School, Satellite Beach, Florida *Seven Lakes High School, Katy, Texas *Stevens Institute of Technology, Hoboken, New Jersey *Trinity Preparatory School, Winter Park, Florida *Townsend Harris High School, Queens, New York *University High School, Fresno, California *University of Tennessee Space Institute, Tullahoma, Tennessee *Oak Harbor Academy Private School, Lemoore, California ===Fraternities and sororities=== *Beta Sigma Psi National Lutheran Fraternity *Sigma Gamma Phi – Arethusa Sorority *Korp! Amicitia – Estonian student sorority. *Freemasons-Knight's Templar, 32nd Degree *K.Ö.St.V. Almgau Salzburg - Austrian Catholic Student Association *K.a.V. Danubia Wien-Korneuburg im ÖCV - Austrian Catholic Student Association ===Popular culture=== * The name of Star Trek: Strange New Worlds Season 2, Episode 2. * The Starfleet motto before the founding of the United Federation of Planets in Star Trek. * Appears on the hull of the ship 'Searcher' in the second season of Buck Rogers. * Garrison Keillor routinely references the phrase as the only Latin phrase he cared to remember on A Prairie Home Companion. * Per Aspera Ad Astra is a Soviet Russian science fiction film by Richard Viktorov, written by Kir Bulychov. *Rip Torn says this phrase to David Bowie in the film The Man Who Fell to Earth. *Tomo Milicevic of the band 30 Seconds to Mars has a tattoo on his right forearm reading 'per aspera et astra', with the band's logo in the background in red. *Aspera! Per aspera! Per ardua! Ad astra! is the refrain of the song \"Aspera\" by Erin McKeown on the album We Will Become Like Birds. *American singer, rapper, dancer, actress, and songwriter Kiely Williams has \"Per aspera ad astra\" tattooed on her right forearm. *Title of a play depicting the history of the fictional Maycomb County in To Kill a Mockingbird, in which the translation is given as from the mud to the stars. *Title of a song by Haggard, from the album Eppur Si Muove. *The name of an album by Abandon Kansas. *It is one of many hidden messages in the 2009 video game The Conduit. *Motto of the Martian Imperial Commandos in Kurt Vonnegut novel, The Sirens of Titan. *Title of a song by Seattle-based band Acceptance. *Title of a song by Goasia, appearing on the album From Other Spaces (Suntrip Records, 2007) *Appears on right side shoulder patch in Star Trek Enterprise, on the \"newer\" uniform style shown on the series finale. In Star Trek The Next Generation it is shown to be the motto of Starfleet. *The official motto of Solforce in the videogame Sword of the Stars. *Title of a song by the band Spiritual Beggars from their album Ad Astra. *Title of a song by the band Die Apokalyptischen Reiter from their album Samurai. *The final mission (Chapter 15) in the Mafia II video game *In a tattoo piece in The Raven *The phrase has been spoofed slightly by the band Ghost in the song \"Per Aspera Ad Inferi\" from their album Infestissumam literally meaning \"Through hardships to hell\".\"A Nameless Ghoul From Ghost B.C. Speaks About 'Infestissumam', the Devil + More\". Loudwire. Retrieved 2013-08-04. *Title of a background music from the Pokémon Omega Ruby and Alpha Sapphire video games which plays during a voyage into space. * In the 2015 film The Martian, at the end of the film astronaut Mark Watney is giving his first lecture to the Astronaut Candidate Program and the phrase appears embedded in the central floor area of the lecture hall around a logo *Title of character leveling achievements in Mistwalker's mobile game Terra Battle *Found in the Gravity Falls Journal #3, penned on the title page. Appears on the journal both in the show and on the real-life replica. *The title of a Pee Wee Gaskins album (2010) * The title character in Ottessa Moshfegh's novel Eileen accepts and smokes a Pall Mall and refers to the motto on the package translated as \"Through the thorns to the stars.\" * On the ship the students find in Astra Lost in Space, there is a plaque with this saying on it. * The motto of the Golds in Pierce Brown's Red Rising Series. * Ad Astra is a 2019 American science fiction film by James Gray. * Ad Astra Per Aspera is the title of one of the SCP Foundation's canons. * Appears in the Russian reunification superevent when the Russian Republic under Andrey Sakharov and the Modernists reunite Russia in the mod The New Order: Last Days of Europe for the video game Hearts of Iron IV ===Others=== *As part of the official team crest of Arendal Football *A plaque honoring the astronauts of Apollo 1 at the launch site where they perished. *A tribute exhibit to the Apollo 1 Astronauts \"Ad Astra Per Aspera - A Rough Road Leads to the Stars\" opened on January 27, 2017, the 50th anniversary of the loss of the crew, at the Kennedy Space Center Visitor Complex. *Inscribed on the crest of Pall Mall cigarettes packages *The theme of \"POR CC XXI\" by Kolese Kanisius Jakarta *Part of a custom paint job in World Of Tanks *Tradewinds Swiss *Space Development Network *Part three of the book Jepp who Defied the Stars by Katherine Marsh has the phrase as its title. *Appears in Morse code on the track titled \"Sounds of Earth\" on the Voyager Golden Record that has copies aboard the Voyager 1 & 2 spacecraft that are currently in interstellar space. *The Wagner-Jauregg family arms. *Motto used by Ser Jacopo pipe maker ==References== Category:Latin phrases",
 "title": "Per aspera ad astra"
}