{
 "id": "761148",
 "text": "The following are lists of Columbia Pictures films: ==List of movies== === 1930s === * Tol'able David (1930) * Arizona (1931) * Platinum Blonde (1931) * Broadway Bill (1933) * Lady for a Day (1933) * Twentieth Century (1934) * It Happened One Night (1934) * One Night of Love (1934) * Mr. Deeds Goes to Town (1936) * The Awful Truth (1937) * Lost Horizon (1937) * You Can't Take It with You (1938) * Only Angels Have Wings (1939) * Mr. Smith Goes to Washington (1939) === 1940s === * His Girl Friday (1940) * Penny Serenade (1941) * Here Comes Mr. Jordan (1941) * You Were Never Lovelier (1941) * You'll Never Get Rich (1942) * My Sister Eileen (1942) * The More the Merrier (1943) * Batman (1943) * Cover Girl (1944) * Gilda (1946) * I Didn't Do It (1946) * The Jolson Story (1946, and sequel in 1949) * The Fuller Brush Man (1948) * Superman (1948) * All the King's Men (1949) *Batman and Robin (1949) === 1950s === * Born Yesterday (1950) * Harriet Craig (1950) * In a Lonely Place (1950) * Atom Man Vs. Superman (1950) * The Marrying Kind (1952) * From Here to Eternity (1953) * The 5,000 Fingers of Dr. T (1953) * The Wild One (1953) * The Caine Mutiny (1954) * On the Waterfront (1954) * Queen Bee (1955) * Picnic (1955) * Autumn Leaves (1956) * The Bridge on the River Kwai (1957) * Pal Joey (1957) * Bell, Book and Candle (1958) * Porgy and Bess (1958, distribution only) * Suddenly, Last Summer (1959) * Gidget (1959) === 1960s === * The Guns of Navarone (1961) * Lawrence of Arabia (1962) * Bye Bye Birdie (1963) * Jason and the Argonauts (1963) * Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964) * Hey There It's Yogi Bear (1964) (distribution only) * Lord Jim (1965) * Three On A Couch (1966) * Born Free (1966) * The Trouble with Angels (1966) * Georgy Girl (1966) * The Man Called Flintstone (1966) (distribution only) * Casino Royale (1967) * In Cold Blood (1967) * To Sir, with Love (1967) * Guess Who's Coming to Dinner (1967) * Oliver! (1968) * Funny Girl (1968) * Bob & Carol & Ted & Alice (1969) * Cactus Flower (1969) * Easy Rider (1969) === 1970s === * I Never Sang for My Father (1970) * Cromwell (1970) * Dad's Army (1971) * The Last Picture Show (1971) * 1776 (1972) * Young Winston (1972) * The Way We Were (1973) * The Lords of Flatbush (1974) * Confessions Of A Window Cleaner (1974) * Monty Python and the Holy Grail (1975) (as Columbia Pictures Home Entertainment) * Shampoo (1975) * Tommy (1975) (first movie with the 1976 \"Sunburst\" logo) * Murder by Death (1976) * Taxi Driver (1976) (last movie with the 1936-1975 logo) * The Front (1976) * Fun with Dick and Jane (1977) * Close Encounters of the Third Kind (1977, re- released in 1980) * The Deep (1977) * Eyes of Laura Mars (1978) * Midnight Express (1978) * Thank God It's Friday (1978) * The Buddy Holly Story (1978) * The China Syndrome (1979) * Hardcore (1979) * Kramer vs. Kramer (1979) === 1980s === * The Missing Link (1980) * The Blue Lagoon (1980) * Stir Crazy (1980) (last movie with the 1976 \"Sunburst\" logo) * Used Cars (1980) * Modern Romance (1981) * Das Boot (1981) (distribution only; with Triumph Films) * Death Wish II (1981) * Stripes (1981) (1981-1993 logo appears with the current logo jingle) * Neighbors (1981) * Absence of Malice (1981) * Annie (1982, plus a TriStar Television sequel in 1995 and a TV remake in 1999) (co-production with Rastar) * Richard Pryor: Live on the Sunset Strip (1982) (co-production with Rastar) * Tempest (1982) * The Toy (1982) * Tootsie (1982) * Gandhi (1982) (distribution) * The Big Chill (1983) * Blue Thunder (1983) * Christine (1983) * Sleepaway Camp (1983) * Ghostbusters (1984) (and sequel in 1989) * Body Double (1984) * The Karate Kid (1984) * Moscow on the Hudson (1984) * Starman (1984) * St. Elmo's Fire (1985) * Fright Night (1985, and TriStar Pictures sequel in 1988) * Stand By Me (1986) * The Karate Kid Part II (1986) * Ishtar (1987) * Roxanne (1987) * The Last Emperor (1987) (distribution) * The Beast (1988) * The Big Blue (Le Grand Bleu) (1988) * Sleepaway Camp 2: Unhappy Campers (1988) * School Daze (1988) * Casualties of War (1989) * The Adventures of Milo and Otis (1989) * Sleepaway Camp 3: Teenage Wasteland (1989) * She's Out of Control (1989) * The Karate Kid Part III (1989) === 1990s === * Awakenings (1990) * Misery (1990) * House Party (1990) * The Prince of Tides (1991) * House Party 2 (1991) * Return to the Blue Lagoon (1991) * Boyz n the Hood (1991) * City Slickers (1991) (co-production with Castle Rock Entertainment) (and sequel in 1994) * Bram Stoker's Dracula (1992) * A League of Their Own (1992) * El Mariachi (1992) (distribution) * Girlz N The Hood (1992) * A Few Good Men (1992) * Groundhog Day (1993) * Lost in Yonkers (1993) (last movie with the 1981-1993 logo) * Last Action Hero (1993) (first movie with the 1993-2006 logo) * The Age of Innocence (1993) * The Next Karate Kid (1994) * The Shawshank Redemption (1994) (co-production with Castle Rock Entertainment) * House Party 3 (1994) * Desperado (1995) * Bad Boys (1995) * The Cable Guy (1996) * The People vs. Larry Flynt (1996) * The Fifth Element (1997, US distribution only) (co-production with Gaumont) * Anaconda (1997) * Air Force One (1997) * Men in Black (1997) (co-production with Amblin Entertainment) * Spiceworld (1997) * Still Crazy (1998) * Ride (1998) * Stepmom (1998) (with TriStar Pictures and co-production with 1492 Pictures) * Big Daddy (1999) * Bicentennial Man (1999) (co-production with Touchstone Pictures) * Blue Streak (1999) * Elmo in Grouchland (1999) * Slam Dunk (1999) (co-production with Jersey Films) * Stuart Little (1999) === 2000s === Release date Title Notes January 21, 2000 The End of the Affair Nominee of the Golden Globe Award for Best Motion Picture - Drama February 18, 2000 Hanging Up co- production with Laurence Mark Productions Not One Less International distributor; co-production with Guangxi Film and Beijing New Picture March 3, 2000 What Planet Are You From? co-production with Brillstein-Grey Entertainment March 17, 2000 Erin Brockovich Nominee for the Academy Award for Best Picture; nominee of the Golden Globe Award for Best Motion Picture – Drama; co-production with Universal Pictures and Jersey Films March 24, 2000 Whatever It Takes co-production with Phoenix Pictures April 14, 2000 28 Days co-production with Tall Trees Productions American Psycho International distributor; co-production with Edward R. Pressman Productions and Muse Productions May 5, 2000 I Dreamed of Africa co-production with Jaffe Films May 12, 2000 Center Stage co-production with Laurence Mark Productions June 2, 2000 Running Free co-production with Moonlighting Films and Reperage June 30, 2000 The Patriot co-production with Mutual Film Company and Centropolis Entertainment July 21, 2000 Loser August 4, 2000 Hollow Man co-production with Douglas Wick Productions August 23, 2000 Snatch International distributor; released by Screen Gems in the USA on January 19, 2001 September 8, 2000 Anatomy English-dubbed version September 15, 2000 Circus September 22, 2000 Almost Famous co-production with DreamWorks Pictures and Vinyl Films, international distributor September 22, 2000 Urban Legends: Final Cut co- production with Phoenix Pictures and Original Film November 3, 2000 Charlie's Angels Based on the 1976-1981 television series of the same name; co- production with Tall Trees Productions and Flower Films November 17, 2000 The 6th Day co-production with Phoenix Pictures December 8, 2000 Vertical Limit Crouching Tiger, Hidden Dragon International distributor; released by Sony Pictures Classics in the USA; co-production with Good Machine International and China Film Group Corporation December 22, 2000 Finding Forrester co- production with Laurence Mark Productions December 25, 2000 All the Pretty Horses distribution only; produced by Miramax Films An Everlasting Piece co- production with DreamWorks Pictures, Bayahibe Films and Baltimore Spring/Creek Pictures, international distributor 2001 Samsara January 26, 2001 The Wedding Planner co-production with Intermedia Films and Tapestry Films February 9, 2001 Saving Silverman co-production with Village Roadshow Pictures, NPV Entertainment and Original Film March 30, 2001 The Tailor of Panama co- production with Irish DreamTime Productions Tomcats released as Revolution Studios April 11, 2001 Joe Dirt co-production with Happy Madison Productions and Out of the Blue Entertainment May 4, 2001 Time and Tide International distributor; co-production with Film Workshop Co. Ltd. May 11, 2001 A Knight's Tale co-production with Escape Artists June 1, 2001 The Animal released as Revolution Studios; co-production with Happy Madison Productions and Out of the Blue Entertainment June 8, 2001 Evolution co-production with DreamWorks Pictures and The Montecito Picture Company, international distributor June 29, 2001 Baby Boy July 11, 2001 Final Fantasy: The Spirits Within co-production with Square Pictures July 20, 2001 America's Sweethearts released as Revolution Studios; co-production with Roth Films September 14, 2001 The Glass House co-production with Original Film September 21, 2001 Glitter International distributor, co-production with 20th Century Fox and Laurence Mark Productions October 19, 2001 Riding in Cars with Boys co-production with Gracie Films October 26, 2001 Thirteen Ghosts co-production with Warner Bros. Pictures and Dark Castle Entertainment; Remake of 1960 film November 2, 2001 The One released as Revolution Studios December 14, 2001 Not Another Teen Movie co-production with Original Film December 25, 2001 Ali USA distributor, co-production with Overbrook Entertainment and Peters Entertainment December 28, 2001 Black Hawk Down released as Revolution Studios; co-production with Jerry Bruckheimer Films and Scott Free Productions January 14, 2002 Taboo February 8, 2002 Rollerball International distributor; Metro-Goldwyn-Mayer handled North American distribution rights, co-production with Atlas Entertainment and Toho-Towa March 29, 2002 Panic Room co-production with Hofflund/Polone Productions and Indelible Pictures April 12, 2002 The Sweetest Thing co-production with Konrad Pictures May 3, 2002 Spider-Man co-production with Marvel Entertainment and Laura Ziskin Productions May 10, 2002 The New Guy released as Revolution Studios May 24, 2002 Enough co-production with Irwin Winkler Productions New Alcatraz co-production with UFO International and Cell Block Productions June 28, 2002 Mr. Deeds Remake of the 1936 film Mr. Deeds Goes to Town; co-production with New Line Cinema, Happy Madison Productions and Out of the Blue Entertainment July 3, 2002 Men in Black II co- production with Amblin Entertainment and MacDonald/Parkes Productions July 19, 2002 Stuart Little 2 co-production with Red Wagon Entertainment What to Do in Case of Fire? U.S. distributor; Germany film August 2, 2002 The Master of Disguise released as Revolution Studios; co-production with Happy Madison Productions August 9, 2002 XXX released as Revolution Studios; co-production with Original Film and One Race Films August 30, 2002 FeardotCom International distributor; co-production with Franchise Pictures, MDP Worldwide, ApolloMedia, Fear Com Productions and Carousel Film Company September 13, 2002 Stealing Harvard released as Revolution Studios; co-production with Imagine Entertainment September 20, 2002 Trapped co-production with Propaganda Films, Senator Entertainment, Mandolin Entertainment and The Canton Company October 25, 2002 Double Vision U.S. and International distributor; co-production with Nan Fang Film Production November 1, 2002 Punch-Drunk Love released as Revolution Studios; co-production with New Line Cinema I Spy co-production with Tall Trees Productions, Eddie Murphy Productions and C2 Pictures November 27, 2002 Eight Crazy Nights co-production with Happy Madison Productions December 6, 2002 Adaptation co-production with Intermedia Films December 13, 2002 Maid in Manhattan released as Revolution Studios January 17, 2003 National Security January 24, 2003 Darkness Falls released as Revolution Studios; co-production with Distant Corners February 6, 2003 Anatomy 2 March 7, 2003 Tears of the Sun released as Revolution Studios; co-production with Cheyenne Enterprises March 28, 2003 Basic co-production with Intermedia Films and Phoenix Pictures April 11, 2003 Anger Management released as Revolution Studios; co-production with Happy Madison Productions and Out of the Blue Entertainment April 25, 2003 Identity co-production with Konrad Pictures May 9, 2003 Daddy Day Care released as Revolution Studios; co-production with Davis Entertainment and Eddie Murphy Productions June 13, 2003 Hollywood Homicide released as Revolution Studios; co-production with Casey-Weiner Productions June 27, 2003 Charlie's Angels: Full Throttle co-production with Tall Trees Productions, Flower Films and Wonderland Sound and Vision July 2, 2003 Terminator 3: Rise of the Machines International distributor; co- production with Intermedia Films, and C2 Pictures July 18, 2003 Bad Boys II co-production with Don Simpson/Jerry Bruckheimer Films August 1, 2003 Gigli released as Revolution Studios; co-production with City Light Films and Casey Silver Productions August 8, 2003 S.W.A.T. co-production with Original Film and Camelot Pictures September 12, 2003 Once Upon a Time in Mexico distribution only; co-production with Dimension Films and Troublemaker Studios So Close US and International distributor; co-production with Eastern Film Production and Sony Pictures Classics September 26, 2003 The Rundown co- production with Universal Pictures, WWE Films and Strike Entertainment October 7, 2003 Seeing Double co-production with 19 Entertainment and S Club Studios October 10, 2003 Drawn Together co-production with Paramount Pictures, Comedy Central Films and Double-Hemm Productions October 24, 2003 Radio released as Revolution Studios November 21, 2003 Gothika co-production with Warner Bros. Pictures and Dark Castle Entertainment November 26, 2003 The Missing released as Revolution Studios; co-production with Imagine Entertainment Bad Santa distribution only; co-production with Dimension Films December 12, 2003 Something's Gotta Give co-production with Warner Bros. Pictures and Waverly Films December 19, 2003 Mona Lisa Smile released as Revolution Studios; co- production with Red OM Films December 25, 2003 Big Fish co-production with The Zanuck Company Peter Pan co-production with Universal Pictures, Revolution Studios, Red Wagon Entertainment, and Allied Stars Productions, international distributor February 13, 2004 50 First Dates co-production with Happy Madison Productions and Flower Films March 12, 2004 Secret Window co-production with Pariah Films April 2, 2004 Hellboy released as Revolution Studios; co- production with Lawrence Gordon Productions and Dark Horse Entertainment April 16, 2004 The Punisher International distributor; co-production with Marvel Entertainment, Valhalla Motion Pictures and Artisan Entertainment April 23, 2004 13 Going on 30 released as Revolution Studios; co-production with Silvercup Studios April 30, 2004 Envy International distribution only, co- production with DreamWorks Pictures, Castle Rock Entertainment and Baltimore/Spring Creek Pictures May 22, 2004 Boa vs. Python co-production with UFO International and Cell Block Productions June 23, 2004 White Chicks released as Revolution Studios; co-production with Wayans Bros. Entertainment June 30, 2004 Spider-Man 2 co-production with Marvel Entertainment and Laura Ziskin Productions August 6, 2004 Little Black Book released as Revolution Studios August 27, 2004 Anacondas: The Hunt for the Blood Orchid released as Screen Gems; co-production with Middle Fork Productions Suspect Zero International distributor; co-production with Intermedia Films, Lakeshore Entertainment and Cruise/Wagner Productions September 24, 2004 The Forgotten released as Revolution Studios October 22, 2004 The Grudge U.S. distributor, co-production with Ghost House Pictures November 24, 2004 Christmas with the Kranks released as Revolution Studios; co-production with 1492 Pictures, Roth Films and Boxing Cat Films December 3, 2004 Closer co-production with Scott Rudin Productions December 17, 2004 Spanglish co-production with Gracie Films January 21, 2005 Are We There Yet? released as Revolution Studios; co- production with Cube Vision and Robert Simonds Productions February 11, 2005 Hitch co-production with Overbrook Entertainment February 25, 2005 Man of the House released as Revolution Studios March 25, 2005 Guess Who Remake of the 1967 film Guess Who's Coming to Dinner; U.S. distributor, co-production with Regency Enterprises, Tall Trees Productions, 3 Arts Entertainment and Katalyst Media April 22, 2005 Kung Fu Hustle International distributor; released by Sony Pictures Classics in the USA April 29, 2005 XXX: State of the Union released as Revolution Studios; co-production with Original Film May 27, 2005 The Longest Yard co-production with Paramount Pictures, Happy Madison Productions, MTV Films and Callahan FilmWorks; international distributor June 3, 2005 Lords of Dogtown co-production with TriStar Pictures and Senator Entertainment June 10, 2005 The Adventures of Sharkboy and Lavagirl distribution only; co-production with Dimension Films and Troublemaker Studios June 24, 2005 Bewitched Based on the 1964-1972 television series of the same name; co-production with Red Wagon Entertainment July 29, 2005 Stealth co- production with Original Film and Phoenix Pictures August 12, 2005 Deuce Bigalow: European Gigolo co-production with Happy Madison Productions and Out of the Blue Entertainment September 30, 2005 Into the Blue co-production with Metro-Goldwyn-Mayer Pictures and Mandalay Pictures October 14, 2005 The Fog released as Revolution Studios October 28, 2005 The Legend of Zorro co- production with Spyglass Entertainment, Amblin Entertainment and K/O Paper Products November 11, 2005 Zathura: A Space Adventure co-production with Radar Pictures November 23, 2005 Rent released as Revolution Studios; co-production with 1492 Pictures Yours, Mine & Ours International distribution only; co- production with Paramount Pictures, Metro-Goldwyn-Mayer Pictures, Nickelodeon Movies and Robert Simonds Productions; remake of the 1968 film December 21, 2005 Fun with Dick and Jane Remake of the 1977 film; co-production with Imagine Entertainment and JC 23 Entertainment December 23, 2005 Memoirs of a Geisha USA distribution only, co-production with DreamWorks Pictures, Spyglass Entertainment, Amblin Entertainment and Red Wagon Entertainment December 25, 2005 The Producers International distribution only; co-production with Universal Pictures and Brooksfilms February 10, 2006 The Pink Panther co- production with Metro-Goldwyn-Mayer Pictures, United Artists and Robert Simonds Productions February 17, 2006 Freedomland released as Revolution Studios; co-production with Scott Rudin Productions and Roth Films April 7, 2006 The Benchwarmers released as Revolution Studios; co-production with Happy Madison Productions April 28, 2006 RV co-production with Intermedia Films, Relativity Media, Red Wagon Entertainment and IMF Productions April 30, 2006 Over the Hedge co-production with DreamWorks Animation May 19, 2006 The Da Vinci Code co-production with Imagine Entertainment and Skylark Productions June 23, 2006 Click co-production with Revolution Studios, Happy Madison Productions, Original Film and Out of the Blue Entertainment July 14, 2006 Little Man released as Revolution Studios; co-production with Wayans Bros. Entertainment July 21, 2006 Monster House co-production with ImageMovers, Relativity Media and Amblin Entertainment August 4, 2006 Talladega Nights: The Ballad of Ricky Bobby co-production with Apatow Productions, Mosaic Media Group and Relativity Media August 11, 2006 Zoom released as Revolution Studios; co-production with Team Todd Films and Boxing Cat Films September 15, 2006 Gridiron Gang co-production with Relativity Media and Original Film September 22, 2006 All the King's Men Remake of 1949 film; co-production with Phoenix Pictures and Relativity Media September 29, 2006 Open Season co- production with Sony Pictures Animation October 13, 2006 The Grudge 2 U.S. distributor, co-production with Ghost House Pictures October 20, 2006 Marie Antoinette distribution only; co-production with American Zoetrope November 3 2006 Flushed Away co-production with DreamWorks Animation Aardman Animations November 10, 2006 Stranger than Fiction co-production with Mandate Pictures November 17, 2006 Casino Royale co-production with Metro- Goldwyn-Mayer, Eon Productions, Danjaq and United Artists with the support of the Government of the Commonwealth of the Bahamas December 8, 2006 The Holiday co-production with Universal Pictures, Relativity Media and Waverly Films December 15, 2006 The Pursuit of Happyness co-production with Relativity Media, Escape Artists and Overbrook Entertainment December 20, 2006 Rocky Balboa US distribution only, co-production with Metro-Goldwyn-Mayer, Revolution Studios, United Artists and Chartoff/Winkler Productions January 26, 2007 Catch and Release co-production with Relativity Media and Tall Trees Productions February 2, 2007 The Messengers released as Screen Gems; co- production with Ghost House Pictures February 16, 2007 Ghost Rider co- production with Relativity Media, Crystal Sky Pictures and Marvel Entertainment March 23, 2007 Reign Over Me co-production with Relativity Media, Madison 23 and Sunlight Productions April 4, 2007 Are We Done Yet? released as Revolution Studios; co-production with RKO Pictures, Cube Vision April 13, 2007 Perfect Stranger released as Revolution Studios May 4, 2007 Spider-Man 3 co-production with Marvel Entertainment and Laura Ziskin Productions June 8, 2007 Surf's Up co-production with Sony Pictures Animation August 17, 2007 Superbad co-production with Apatow Productions October 12, 2007 Across the Universe released as Revolution Studios; co-production with Team Todd Films We Own the Night co-production with 2929 Productions October 19, 2007 30 Days of Night co-production with Dark Horse Entertainment and Ghost House Pictures November 2, 2007 Bee Movie co-production with DreamWorks Animation November 9, 2007 Saawariya co-production with SLB Films December 21, 2007 Walk Hard: The Dewey Cox Story co-production with Relativity Media and Apatow Productions December 25, 2007 The Water Horse: Legend of the Deep released as Revolution Studios; co-production with Walden Media, Beacon Pictures and Ecosse Pictures January 30, 2008 CJ7 International distributor, released by Sony Pictures Classics in the USA February 22, 2008 Vantage Point co-production with Di Bonaventura Pictures, Relativity Media and Original Film February 29, 2008 The Other Boleyn Girl co-production with Focus Features, Relativity Media, Scott Rudin Productions, Ruby Films and BBC Films; U.S. distributor; released by Universal Pictures in foreign countries March 28, 2008 21 co-production with Relativity Media May 2, 2008 Made of Honor co- production with Relativity Media and Original Film June 6, 2008 You Don't Mess with the Zohan co-production with Happy Madison Productions and Relativity Media June 6, 2008 Kung Fu Panda co-production with DreamWorks Animation July 2, 2008 Hancock co-production with Overbrook Entertainment, Weed Road Pictures, Forward Pass, Blue Light and Relativity Media July 25, 2008 Step Brothers co-production with Apatow Productions, Relativity Media, Mosaic Media Group and Gary Sanchez Productions Once Upon a Time in Rio Brazil film; co- production with Globo Filmes August 6, 2008 Pineapple Express co-production with Relativity Media and Apatow Productions August 22, 2008 The House Bunny co-production with Happy Madison Productions, Relativity Media and Alta Loma Entertainment October 3, 2008 Nick and Norah's Infinite Playlist co-production with Mandate Pictures October 10, 2008 Hello Indian film November 7, 2008 Madagascar: Escape 2 Africa co-production with DreamWorks Animation November 14, 2008 Quantum of Solace International distribution only, co-production with Metro-Goldwyn-Mayer, Danjaq, United Artists, and Eon Productions December 5, 2008 Meerabai Not Out Indian film; distribution only; co-production with Pritish Nandy Communications December 19, 2008 Seven Pounds co-production with Overbrook Entertainment, Relativity Media and Escape Artists January 16, 2009 Paul Blart: Mall Cop co-production with Happy Madison Productions and Relativity Media January 22, 2009 The Best Movie 2 Russian film; co-production with Monumental Pictures and Comedy Club Production February 6, 2009 The Pink Panther 2 International distribution only, co-production with Metro-Goldwyn- Mayer and Robert Simonds Productions February 13, 2009 The International co- production with Relativity Media and Atlas Entertainment March 20, 2009 Straight Indian film; co-production with Idream Productions March 27, 2009 Monsters vs. Aliens co-production with DreamWorks Animation May 15, 2009 Angels & Demons co-production with Imagine Entertainment and Skylark Productions May 21, 2009 Terminator Salvation International distribution only, produced by The Halcyon Company and Wonderland Sound and Vision June 12, 2009 The Taking of Pelham 1 2 3 co-production with Metro-Goldwyn-Mayer, Relativity Media, Escape Artists and Scott Free Productions June 19, 2009 Year One co- production with Apatow Productions July 24, 2009 The Ugly Truth co-production with Lakeshore Entertainment and Relativity Media July 31, 2009 Funny People international distribution only; co-production with Universal Pictures, Relativity Media, Madison 23 and Apatow Productions August 7, 2009 Julie & Julia co-production with Laurence Mark Productions, Scott Rudin Productions and Tiger Aspect Pictures Teree Sang Indian film September 18, 2009 Cloudy with a Chance of Meatballs co-production with Sony Pictures Animation October 2, 2009 Zombieland co-production with Relativity Media and Pariah Films October 9, 2009 The Damned United UK film; co-production with BBC Films, Left Bank Pictures and Screen Yorkshire October 28, 2009 Michael Jackson's This Is It co-production with The Michael Jackson Company, LLC and AEG Live November 13, 2009 2012 co-production with Centropolis Entertainment December 3, 2009 Jump Hong Kong Film; co-production with Columbia Pictures Film Productions Asia Limited, The Star Overseas Ltd. and China Film Group Corporation December 18, 2009 Did You Hear About the Morgans? co-production with Relativity Media, Castle Rock Entertainment and Banter Films === 2010s === Release date Title Notes March 5, 2010 Thanks Maa March 19, 2010 The Bounty Hunter Co-production with Original Film and Relativity Media June 11, 2010 The Karate Kid Co- production with Overbrook Entertainment and JW Productions June 25, 2010 Grown Ups Co-production with Happy Madison Productions July 23, 2010 Salt Co- production with Relativity Media August 6, 2010 The Other Guys Co-production with Gary Sanchez Productions and Mosaic Media Group August 13, 2010 Eat Pray Love Co-production with Plan B Entertainment September 3, 2010 We Are Family Co-production with UTV Motion Pictures and Dharma Productions September 24, 2010 The Virginity Hit Co-production with Gary Sanchez Productions October 1, 2010 The Social Network Nominee for the Academy Award for Best Picture; winner of the Golden Globe Award for Best Motion Picture – Drama; co-production with Relativity Media and Scott Rudin Productions November 5, 2010 Megamind Co- production with DreamWorks Animation December 10, 2010 The Tourist Nominee for the Golden Globe Award for Best Motion Picture - Musical or Comedy; distribution out of the UK, France and Germany, co-production with StudioCanal, GK Films and Spyglass Entertainment December 17, 2010 How Do You Know Co-production with Gracie Films January 14, 2011 The Green Hornet Co- production with Original Film January 25, 2011 Open Season 3 co-production with Sony Pictures Animation February 11, 2011 Just Go with It Co-production with Happy Madison Productions March 11, 2011 Battle: Los Angeles Co- production with Original Film and Relativity Media May 27, 2011 Kung Fu Panda 2 Co-production with DreamWorks Animation June 17, 2011 Bad Teacher Co- production with Mosaic Media Group and Radar Pictures July 8, 2011 Zookeeper Co-production with Metro-Goldwyn-Mayer, Happy Madison Productions and Broken Road Productions July 29, 2011 The Smurfs Co-production with Sony Pictures Animation and The Kerner Entertainment Company August 12, 2011 30 Minutes or Less Co-production with Media Rights Capital and Red Hour Productions September 9, 2011 Bucky Larson: Born to Be a Star Co-production with Happy Madison Productions September 16, 2011 Restless International distribution; co-production with Imagine Entertainment and Sony Pictures Classics September 23, 2011 Moneyball Nominee for the Academy Award for Best Picture; nominee of the Golden Globe Award for Best Motion Picture – Drama; co-production with Scott Rudin Productions and Michael de Luca Productions October 7, 2011 The Ides of March Nominee of the Golden Globe Award for Best Motion Picture – Drama; US distribution only, co-production with Cross Creek Pictures, Smoke House Pictures, Exclusive Media and Appian Way Productions. October 28, 2011 Anonymous Co-production with Relativity Media and Centropolis Entertainment November 11, 2011 Jack and Jill Co-production with Happy Madison Productions and Broken Road Productions November 11, 2011 Puss in Boots Co-production with DreamWorks Animation November 23, 2011 Arthur Christmas Co-production with Sony Pictures Animation and Aardman Animations December 20, 2011 The Girl with the Dragon Tattoo Co-production with Metro-Goldwyn-Mayer, Scott Rudin Productions and Yellow Bird December 21, 2011 The Adventures of Tintin International distribution only; produced by Paramount Pictures, Nickelodeon Movies, Amblin Entertainment, WingNut Films, the Kennedy/Marshall Company and Hemisphere Media Capital February 17, 2012 Ghost Rider: Spirit of Vengeance US distribution only; produced by Hyde Park Entertainment, Imagenation Abu Dhabi, Crystal Sky Pictures and Marvel Entertainment March 16, 2012 21 Jump Street Co-production with Metro-Goldwyn-Mayer, Relativity Media, Original Film and Cannell Studios April 27, 2012 The Pirates! Band of Misfits A.K.A. The Pirates! In an Adventure with Scientists; co-production with Sony Pictures Animation and Aardman Animations May 25, 2012 Men in Black 3 Co-production with Amblin Entertainment, Hemisphere Media Capital, P+M Imagenation and Wardour Street Pictures June 8, 2012 Madagascar 3: Europe's Most Wanted Co- production with DreamWorks Animation June 15, 2012 That's My Boy Co-production with Happy Madison Productions and Relativity Media July 3, 2012 The Amazing Spider-Man Co-production with Marvel Entertainment and Laura Ziskin August 3, 2012 Total Recall Remake of the 1990 film; co-production with Relativity Media, Original Film and Prime Focus August 8, 2012 Hope Springs co-production with Metro-Goldwyn-Mayer, Escape Artists, Mandate Pictures and Alliance Films August 24, 2012 Premium Rush Co-production with Pariah September 28, 2012 Hotel Transylvania Co-production with Sony Pictures Animation October 12, 2012 Here Comes the Boom Co-production with Happy Madison Productions, Broken Road Productions and Hey Eddie November 2, 2012 Rise of the Guardians co-production with DreamWorks Animation November 9, 2012 Skyfall Distribution only, co- production with Metro-Goldwyn-Mayer, United Artists, Pinewood Studios and Eon Productions December 19, 2012 Zero Dark Thirty Nominee for the Academy Award for Best Picture; nominee of the Golden Globe Award for Best Motion Picture – Drama; US distribution only; produced by Annapurna Pictures and First Light Productions; Universal Pictures handled European and South Africa distribution rights December 25, 2012 Django Unchained Nominee for the Academy Award for Best Picture; nominee of the Golden Globe Award for Best Motion Picture – Drama; international distribution only; produced by the Weinstein Company and A Band Apart May 31, 2013 After Earth Co-production with Overbrook Entertainment and Blinding Edge Pictures June 12, 2013 This Is the End Co- production with Mandate Pictures and Point Grey Pictures June 28, 2013 White House Down Co-production with Centropolis Entertainment, Mythology Entertainment and Iron Horse Entertainment July 12, 2013 Grown Ups 2 Co- production with Happy Madison Productions July 31, 2013 The Smurfs 2 Distribution only; produced by Sony Pictures Animation, The Kerner Entertainment Company and Hemisphere Media Capital September 27, 2013 Cloudy with a Chance of Meatballs 2 Co-production with Sony Pictures Animation October 11, 2013 Captain Phillips Nominee for the Academy Award for Best Picture; nominee of the Golden Globe Award for Best Motion Picture – Drama; distribution only; produced by Scott Rudin Productions, Michael de Luca Productions and Trigger Street Productions December 20, 2013 American Hustle Nominee for the Academy Award for Best Picture; winner of the Golden Globe Award for Best Motion Picture – Musical or Comedy; distribution only; produced by Annapurna Pictures and Atlas Entertainment February 7, 2014 The Monuments Men USA distribution only; produced by Fox 2000 Pictures, Studio Babelsberg, Smokehouse Pictures and Obelisk Productions February 12, 2014 RoboCop Distribution only; produced by Metro-Goldwyn-Mayer and Strike Entertainment February 28, 2014 Stalingrad Russian film; co-production with Art Pictures Studio and Non-Stop Production May 2, 2014 The Amazing Spider-Man 2 Co- production with Marvel Entertainment, K/O Paper Products, Ingenious Media and Arad Productions; first film to include the Sony Pictures opening logo June 13, 2014 22 Jump Street Co-production with Metro-Goldwyn-Mayer, Original Film, Ingenious Film Partners, Cannell Studios and LStar Capital June 27, 2014 Transformers: Age of Extinction Philippine theatrical distribution only; co- production with Paramount Pictures, di Bonaventura Pictures and Hasbro Studios July 18, 2014 Sex Tape Co-production with Escape Artists, LStar Capital and Media Rights Capital August 8, 2014 Teenage Mutant Ninja Turtles Phlippine theatrical distribution only; co-production with Paramount Pictures, Nickelodeon Movies, Platinum Dunes, Gama Entertainment, Mednick Productions and Heavy Metal Productions September 26, 2014 The Equalizer Co-production with Escape Artists, Village Roadshow Pictures, Mace Neufeld Productions, LStar Capital and ZHIV Productions October 17, 2014 Fury Co-production with QED International, LStar Capital, Le Grisbi Productions and Crave Films October 24, 2014 Ouija Philippine theatrical distribution only; co-production Universal Pictures, Platinum Dunes, Hasbro Studios, and Blumhouse Productions December 19, 2014 Annie Co-production with Overbrook Entertainment, LStar Capital and Village Roadshow Pictures December 25, 2014 The Interview Co- production with Point Grey Pictures and LStar Capital January 30, 2015 Project Almanac Philippine theatrical distribution only; co-production with Paramount Pictures, Insurge Pictures, MTV Films and Platinum Dunes February 6, 2015 The SpongeBob Movie: Sponge Out of Water Philippine theatrical distribution only; co-production with Paramount Pictures, Paramount Animation, Nickelodeon Movies and United Plankton Pictures March 6, 2015 Chappie Co-production with Media Rights Capital and LStar Capital April 3, 2015 Furious 7 Philippine theatrical distribution only; co-production with Universal Pictures, Original Film, One Race Films, Media Rights Capital, and China Film April 17, 2015 Paul Blart: Mall Cop 2 Distribution only; produced by Happy Madison Productions, Hey Eddie and Broken Road Unfriended Philippine theatrical distribution only; co- production with Universal Pictures, Bazelevs Company and Blumhouse Productions May 15, 2015 Pitch Perfect 2 Philippine theatrical distribution only; co- production with Universal Pictures and Gold Circle Films May 22, 2015 Tomorrowland Philippine theatrical distribution only; co-production with Walt Disney Pictures and A113 Productions May 29, 2015 Aloha USA/Canada distribution only; produced by 20th Century Fox, Regency Enterprises, LStar Capital, Vinyl Films, RatPac Entertainment and Scott Rudin Productions June 26, 2015 Ted 2 Philippine theatrical distribution only; co-production with Universal Pictures, Media Rights Capital, Fuzzy Door Productions, Bluegrass Films, and Smart Entertainment July 10, 2015 Minions Philippine theatrical distribution only; co-production with Universal Pictures and Illumination Entertainment July 24, 2015 Pixels Co-production with LStar Capital, Happy Madison Productions, 1492 Pictures and China Film Group September 25, 2015 Hotel Transylvania 2 Co-production with Sony Pictures Animation and LStar Capital October 16, 2015 Goosebumps Distribution only; Produced by LStar Capital, Village Roadshow Pictures, Sony Pictures Animation, Original Film, and Scholastic Entertainment October 23, 2015 Paranormal Activity: The Ghost Dimension Philippine theatrical distribution only; co-production with Paramount Pictures and Blumhouse Productions Jem and the Holograms Philippine theatrical distribution only; co-production with Universal Pictures, Hasbro Studios, Allspark Pictures, Blumhouse Productions, and SB Projects October 30, 2015 Freaks of Nature Co-production with LStar Capital November 6, 2015 Spectre Distribution only, co-production with Eon Productions, B24, Danjaq, and Metro-Goldwyn-Mayer November 20, 2015 The Night Before Co-production with Point Grey Pictures, Good Universe and LStar Capital December 25, 2015 Concussion Co-production with Village Roadshow Pictures, The Shuman Company, The Cantillon Company, and Scott Free Productions January 22, 2016 The 5th Wave Co-production with GK Films, Material Pictures, and Weimaraner Republic Pictures February 19, 2016 Risen Co-production with Affirm Films, LD Entertainment and Patrick Aiello Productions March 11, 2016 The Brothers Grimsby Co-production with Village Roadshow Pictures, Working Title Films, Big Talk Productions and Four By Two Films 10 Cloverfield Lane Philippine theatrical distribution only; co-production with Paramount Pictures and Bad Robot Productions March 16, 2016 Miracles from Heaven Co-production with Affirm Films and Roth Films May 20, 2016 The Angry Birds Movie Co-production with Rovio Animation June 3, 2016 Teenage Mutant Ninja Turtles: Out of the Shadows Philippine theatrical distribution only; co-production with Paramount Pictures, Nickelodeon Movies, Platinum Dunes, Alibaba Pictures and China Movie Media Group June 17, 2016 Central Intelligence Philippine theatrical distribution only; co-production with Warner Bros., Universal Pictures, New Line Cinema, RatPac Entertainment, Bluegrass Films and Perfect World Pictures June 24, 2016 The Shallows Co-production with Weimaraner Republic Pictures July 15, 2016 Ghostbusters Co-production with The Montecito Picture Company August 12, 2016 Sausage Party Co-production with Point Grey Pictures and Annapurna Pictures September 23, 2016 The Magnificent Seven Co-production with Metro-Goldwyn-Mayer, Village Roadshow Pictures, LStar Capital, Escape Artists and Fuqua Films September 29, 2016 The Duelist Russian film; co-production with Non-Stop Production October 14, 2016 Anna: Kisan Baburao Hazare Co- production with Sony Pictures Entertainment Films India October 21, 2016 Ouija: Origin of Evil Philippine theatrical distribution only; co-production with Universal Pictures, Allspark Pictures, Blumhouse Productions, Hasbro Studios, and Platinum Dunes October 28, 2016 Inferno Co-production with Imagine Entertainment December 9, 2016 Office Christmas Party Philippine theatrical distribution only; co-production with Paramount Pictures, DreamWorks Pictures, Reliance Entertainment, Bluegrass Films and Entertainment 360 December 21, 2016 Passengers Co-production with Village Roadshow Pictures, Original Film, Start Motion Pictures, and LStar Capital January 13, 2017 Monster Trucks Philippine theatrical distribution only; co-production with Paramount Pictures, Paramount Animation, Nickelodeon Movies and Disruption Entertainment January 20, 2017 XXX: Return of Xander Cage Philippine theatrical distribution only; co-production with Paramount Pictures, One Race Films, Revolution Studios and Roth Kirschenbaum Films January 26, 2017 Attraction Russian film; co-production with Art Pictures Studio and Cinema Foundation February 3, 2017 Rings Philippine theatrical distribution only; co- production with Paramount Pictures and Parkes + MacDonald Imagination March 24, 2017 Life co-production with Skydance Media and Mockingbird Pictures April 7, 2017 Smurfs: The Lost Village Co-production with Sony Pictures Animation and The Kerner Entertainment Company June 16, 2017 Rough Night Co-production with Paulilu Productions, Matt Tolmach Productions, and 3 Arts Entertainment June 21, 2017 Transformers: The Last Knight Philippine theatrical distribution only; co-production with Paramount Pictures, Hasbro Studios and di Bonaventura Pictures June 30, 2017 Despicable Me 3 Philippine theatrical distribution only; co-production with Universal Pictures and Illumination July 7, 2017 Spider-Man: Homecoming Co-production with Marvel Studios, Pascal Pictures, Wanda Media Group, and LStar Capital July 28, 2017 The Emoji Movie Co- production with Sony Pictures Animation August 4, 2017 The Dark Tower Co- production with Weed Road Pictures, Media Rights Capital and Imagine Entertainment September 8, 2017 Poster Boys Co-production with Sony Pictures Networks Productions, Sunny Sounds Pvt. Ltd. and Affluence Movie Pvt. Ltd. September 29, 2017 Flatliners Co-production with Cross Creek Pictures, Further Films, and Laurence Mark Productions October 6, 2017 Blade Runner 2049 International distribution only; co-production with Alcon Entertainment, Thunderbird Entertainment, and Scott Free Productions; North American distribution handled by Warner Bros. Pictures October 20, 2017 Only the Brave Co-production with Black Label Media, Di Bonaventura Pictures, and Conde Nast Entertainment; Summit Entertainment Distributed and Held International rights. November 17, 2017 Roman J. Israel, Esq. Co-production with Cross Creek Pictures and Macro The Star Distribution only; produced by Sony Pictures Animation, Walden Media, Affirm Films, The Jim Henson Company, and Franklin Entertainment December 20, 2017 Jumanji: Welcome to the Jungle Co-production with Radar Pictures, Matt Tomalch Productions and Seven Bucks Productions December 22, 2017 Pitch Perfect 3 Philippine theatrical distribution only; co- production with Universal Pictures, Gold Circle Films and Brownstone February 9, 2018 Peter Rabbit Co-production with Sony Pictures Animation, Olive Bridge Entertainment, Animal Logic, 2.0 Entertainment, Screen Australia, and Screen NSW Pad Man Co-production with KriArj Entertainment, Zee Music Company, Cape Of Good Films, and Hope Productions February 14, 2018 Ice Russian film; co- production with Art Pictures Studio, Russia-1, Cinema Foundation and STS April 13, 2018 Truth or Dare Philippine theatrical distribution only; co-production with Universal Pictures and Blumhouse Productions May 4, 2018 102 Not Out Distribution only; Co-production with SPE Films India, Treetop Entertainment and Benchmark Pictures May 25, 2018 A Rough Draft Russian film; Co-production with Cinema Fund and New People Film Company June 15, 2018 Superfly Co- production with Silver Pictures June 29, 2018 Sicario: Day of the Soldado USA/Canada distribution only; co-production with Black Label Media and Thunder Road Films July 13, 2018 Hotel Transylvania 3: Summer Vacation Distribution only; produced by Sony Pictures Animation and MRC Soorma Co-production with Sony Pictures Networks Productions and C.S. Films July 20, 2018 The Equalizer 2 Co-production with Escape Artists, Zhiv Productions, Mace Neufeld Productions, and Picture Farm August 17, 2018 Alpha Co-production with Studio 8 and The Picture Company September 14, 2018 White Boy Rick Co-production with Studio 8, Protozoa Pictures, LBI Entertainment and Le Grisbi Productions October 5, 2018 Venom Co-production with Tencent Pictures, Marvel Entertainment, Arad Productions, Matt Tolmach Productions, and Pascal Pictures October 11, 2018 The Perfect Ones Russian film; Co-production with Sinetrain and Mars Media Entertainment October 12, 2018 Goosebumps 2: Haunted Halloween Co-production with Sony Pictures Animation, Original Film, Scholastic Productions, and Silvertongue Films November 6, 2018 The Front Runner Co- production with Stage 6 Films, Bron Studios, Right of Way Films and Creative Wealth Media November 9, 2018 The Girl in the Spider's Web Co-production with Metro-Goldwyn-Mayer, Regency Enterprises, Studio Babelsberg, Scott Rudin Productions, Yellow Bird Entertainment, Pascal Pictures, and The Cantillon Company December 14, 2018 Spider-Man: Into the Spider-Verse Winner of the Academy Award for Best Animated Feature; co-production with Sony Pictures Animation, Marvel Entertainment, Arad Productions, Lord Miller Productions, and Pascal Pictures December 25, 2018 Holmes & Watson co-production with Gary Sanchez Productions and Mosaic Media Group January 4, 2019 Escape Room Co- production with Original Film January 11, 2019 A Dog's Way Home Co-production with Pariah January 18, 2019 Bombairiya Co-production with Zee Studios, Krio Films FZ and Beautiful Bay Entertainment February 1, 2019 Miss Bala Co- production with Misher Films and Canana Films February 7, 2019 9 (9:Nine) Co- production with SPE Films India (Sony Pictures India) and Prithviraj Productions February 14, 2019 Loud Connection Russian film; Co-production with Mars Media Entertainment and Strela Film Studio April 5, 2019 Oru Kadhai Sollatuma Co-production with Sony Pictures International Releasing, Prasad Prabhakar Productions and Palmstone Multimedia June 14, 2019 Men in Black: International Co-production with Amblin Entertainment, Parkes+MacDonald Productions, Image Nation Abu Dhabi, and Tencent Pictures July 2, 2019 Spider- Man: Far From Home Co-production with Marvel Studios and Pascal Pictures July 26, 2019 Once Upon a Time in Hollywood Nominee for the Academy Award for Best Picture; winner of the Golden Globe Award for Best Motion Picture – Musical or Comedy; co-production with Heyday Films August 14, 2019 The Angry Birds Movie 2 Distribution only; produced by Sony Pictures Animation and Rovio Animation October 18, 2019 Zombieland: Double Tap Co-production with Pariah November 15, 2019 Charlie's Angels Co-production with Brownstone Productions and 2.0 Entertainment December 13, 2019 Jumanji: The Next Level Co-production with Radar Pictures, Matt Tomalch Productions and Seven Bucks Productions December 25, 2019 Little Women Nominee for the Academy Award for Best Picture; co- production with Regency Enterprises and Pascal Pictures December 27, 2019 Tabaluga Animated Germany film distribution and released as Ice Princess Lily, Co-production with Awesometown Entertainment, Tempest Film and Trixter === 2020s === Release date Title Production companies January 17, 2020 Bad Boys for Life co-production with Don Simpson/Jerry Bruckheimer Films, Overbrook Entertainment and 2.0 Entertainment February 14, 2020 Fantasy Island co- production with Blumhouse Productions March 13, 2020 Bloodshot co-production with Original Film, Cross Creek Pictures, Bona Film Group, One Race Films, Annabell Pictures, The Hideaway Entertainment and Valiant Entertainment October 28, 2020 The Craft: Legacy co-production with Blumhouse Productions and Red Wagon Entertainment November 27, 2020 Life in a Year ‡ distribution only; produced by Overbrook Entertainment; distributed by Amazon Studios April 30, 2021 The Mitchells vs. the Machines ‡ Chinese distribution only; co- production with Sony Pictures Animation, One Cool Films and Lord Miller Productions, distributed worldwide by Netflix June 11, 2021 Peter Rabbit 2: The Runaway co-production with Animal Logic, MRC, 2.0 Entertainment, and Olive Bridge Entertainment Wish Dragon ‡ Chinese distribution only; co-production with Sony Pictures Animation, Base FX, Beijing Sparkle Roll Media Corporation, Flagship Entertainment Group, Boss Collaboration and Tencent Pictures, distributed worldwide by Netflix June 18, 2021 Fatherhood ‡ Chinese distribution only; co-production with HartBeat Productions, Bron Creative, Free Association, Temple Hill Entertainment and Higher Ground Productions; distributed worldwide by Netflix July 16, 2021 Escape Room: Tournament of Champions co-production with Original Film August 6, 2021 Vivo ‡ Chinese distribution only; co-production with Sony Pictures Animation; distributed worldwide by Netflix September 3, 2021 Cinderella ‡ Chinese distribution only; produced by Fulwell 73; distributed worldwide by Amazon Studios October 1, 2021 Venom: Let There Be Carnage co-production with Marvel Entertainment, Arad Productions, Matt Tolmach Productions and Pascal Pictures November 19, 2021 Ghostbusters: Afterlife co-production with Bron Creative, Ghost Corps, The Montecito Picture Company and Right of Way Films December 17, 2021 Spider-Man: No Way Home co-production with Marvel Studios and Pascal Pictures December 25, 2021 A Journal for Jordan co-production with Outlier Society, Escape Artists, Bron Studios, Mundy Lane Entertainment and Creative Wealth Media January 14, 2022 Hotel Transylvania: Transformania ‡ Chinese distribution only; co- production with Sony Pictures Animation and MRC; distributed worldwide by Amazon Studios February 18, 2022 Uncharted co-production with PlayStation Productions, Atlas Entertainment and Arad Productions April 1, 2022 Morbius co-production with Marvel Entertainment, Arad Productions and Matt Tolmach Productions April 13, 2022 Father Stu co-production with Municipal Pictures and CJ Entertainment June 24, 2022 The Man from Toronto ‡ Chinese distribution only; produced by Bron Creative, Escape Artists, and HartBeat Productions; distributed worldwide by Netflix July 15, 2022 Where the Crawdads Sing co- production with HarperCollins Publishers, Hello Sunshine and 3000 Pictures August 5, 2022 Bullet Train co-production with 87North Productions October 7, 2022 Lyle, Lyle, Crocodile co-production with Eagle Pictures and TSG Entertainment II November 23, 2022 Devotion US theatrical distribution only; produced by Stage 6 Films, STXfilms and Black Label Media December 29, 2022 A Man Called Otto co-production with Stage 6 Films, SF Studios, Artistic Films, Playtone, 2DUX² and STXfilms March 10, 2023 65 co-production with Bron Creative, Raimi Productions and Beck/Woods June 2, 2023 Spider-Man: Across the Spider-Verse co-production with Sony Pictures Animation, Marvel Entertainment, Arad Productions, Lord Miller Productions and Pascal Pictures June 23, 2023 No Hard Feelings co-production with Excellent Cadaver, Odenkirk Provissiero Entertainment and Saks Picture Company August 25, 2023 Gran Turismo co- production with PlayStation Productions and 2.0 Entertainment September 1, 2023 The Equalizer 3 co-production with Escape Artists and Eagle Pictures September 15, 2023 Dumb Money US distribution only; co-production with Stage 6 Films, Black Bear Pictures and Ryder Picture Company November 22, 2023 Napoleon co-production with Apple Studios and Scott Free Productions December 22, 2023 Anyone but You co-production with Roth/Kirschenbuam Films, SK Global, Fifty-Fifty Films and Olive Bridge Entertainment February 14, 2024 Madame Web co-production with Marvel Entertainment and Di Bonaventura Pictures March 22, 2024 Ghostbusters: Frozen Empire co-production with Ghost Corps and Right Of Way Films May 24, 2024 The Garfield Movie co-production with Alcon Entertainment, Prime Focus, DNEG Animation, One Cool Group Limited and Wayfarer Studios June 7, 2024 Bad Boys: Ride or Die co-production with 2.0 Entertainment, Don Simpson/Jerry Bruckheimer Films and Westbrook Studios July 12, 2024 Fly Me to the Moon theatrical distribution only; produced by Apple Studios and These Pictures August 2, 2024 Harold and the Purple Crayon co- production with TSG Entertainment and Davis Entertainment August 9, 2024 It Ends with Us co-production with Wayfarer Studios and Saks Picture Company August 30, 2024 Afraid co-production with Blumhouse Productions and Depth of Field September 27, 2024 Saturday Night co-production with Reitman/Kenan Productions October 25, 2024 Venom: The Last Dance co-production with Marvel Entertainment, Arad Productions, Matt Tolmach Productions and Pascal Pictures December 13, 2024 Kraven the Hunter co-production with Marvel Entertainment, TSG Entertainment II, Arad Productions, and Matt Tolmach Productions December 25, 2024 Green Bones distribution only in the Philippines; produced by GMA Pictures, GMA Public Affairs and Brightburn Entertainment ==Upcoming== Release date Title Notes Production status February 14, 2025 Paddington in Peru co- distribution with Stage 6 Films outside the United Kingdom, France, Germany, the Benelux, Poland, Australia, New Zealand, Russia, China and Japan only; produced by StudioCanal, Kinoshita Group and Marmalade Pictures Completed May 30, 2025 Karate Kid: Legends co-production with Sunswept Entertainment and Westbrook Studios Post-production June 20, 2025 28 Years Later co-production with DNA Films, TSG Entertainment and Decibel FilmsUS Copyright Office Document No. V15022D529 / 2024-02-21 July 18, 2025 Untitled I Know What You Did Last Summer sequel co-production with Original Film Filming August 1, 2025 Beneath the Storm co-production with Hyperobject Industries February 13, 2026 Goat co-production with Sony Pictures Animation, Unanimous Media and Modern Magic In production March 20, 2026 Street Fighter co-production with Legendary Pictures and Capcom Pre-production July 24, 2026 Untitled Spider-Man: No Way Home sequel co-production with Marvel Studios and Pascal Pictures December 11, 2026 Untitled Jumanji: The Next Level sequel co-production with Matt Tolmach Productions, Seven Bucks Productions and The Detective Agency In development ===Undated films=== Release date Title Notes Production status 2025 K-Pop: Demon Hunters ‡ co-production with Sony Pictures Animation; distributed by Netflix In production 2027 Untitled The Beatles biopics co-production with Neal Street Productions Pre-production TBA 28 Years Later Part II: The Bone Temple co-production with DNA Films, BFI and Decibel Films Filming My Ex- Friend's Wedding co-production with Stage 6 Films, Circle of Confusion, K&L; Productions and Sister Production suspended due to 2023 Hollywood labor disputes; Pre-production Spider-Man: Beyond the Spider-Verse co-production with Sony Pictures Animation, Marvel Studios Animation, Pascal Pictures, Lord Miller Productions and Arad Productions In production Stepdude co-production with Matt Tolmach Productions Pre-production Untitled Ghostbusters: Frozen Empire sequel co-production with Ghost Corps The Legend of Zelda co-production with Nintendo, Oddball Entertainment and Arad Productions Uncharted: Part 2 co-production with Atlas Entertainment, Arad Productions, and PlayStation Productions === In development === Title Notes Anaconda co-production with Fully Formed Entertainment Barbarella co-production with Fifty-Fifty Films Christine co-production with Blumhouse Productions Cola Wars co-production with Amblin Entertainment Days Gone co-production with Vendetta Productions and PlayStation Productions El Muerto co-production with Marvel Entertainment Ghost of Tsushima co-production with PlayStation Productions, 87North Entertainment and Sucker Punch Productions Idle Hands co-production with Team Todd Omega co-production with Mandalay Pictures One-Punch Man co-production with Arad Productions The Husband's Secret co-production with Depth of Field Tao co-production with Sony Pictures Animation The Winner co-production with Pascal Pictures Untitled Daniel Casey film co-production with Plan B Entertainment Untitled Fred Astaire biopic co-production with Pascal Pictures Untitled Ghostbusters spin-off film co-production with Sony Pictures Animation and Ghost CorpsSony is also developing an animated Ghostbusters film, but that will come out after this new live-action project, and a different team will be involved in creating it. La Bamba co-production with Mucho Mas Media Untitled live-action Miles Morales film co-production with Marvel Studios and Pascal Pictures Untitled Matt Braly film co-production with Sony Pictures Animation Untitled Olivia Wilde film project co-production with Marvel Entertainment Ridley Jones: The Movie co-production with Brown Bag Films == References == Columbia * Category:American movies by studio",
 "title": "List of Columbia Pictures movies"
}