{
 "id": "761197",
 "text": "A Talking Cat!?! is a 2013 independent children's film directed by David DeCoteau. The film was released by Phase 4 Films direct to DVD on February 18, 2013. Eric Roberts is featured as the voice of the talking cat. ==Synopsis== Two families with one parent are brought together by Duffy (Eric Roberts), a cat who can talk. Phil Barber, (Johnny Whitaker), a wealthy man, recently sold his computer company to spend more time with his son Chris (Justin Cone), a model, who does not care about this decision. At the same time, Susan (Kristine DeBell) is finding it hard to make enough money as a caterer with her two children Tina (Janis Peebles) and Trent (Daniel Dannas). Duffy then enters the families' lives, talking to them to give them advice, but can only talk to each person once. ==Cast== * Johnny Whitaker as Phil Barber * Kristine DeBell as Susan * Justin Cone as Chris Barber * Janis Peebles as Tina * Alison Sieke as Frannie * Daniel Dannas as Trent * Eric Roberts as Duffy (voice) ==Production== The film is one of several direct-to-video family films directed by David DeCoteau using the false name Mary Crawford. It was shot in three days in the same mansion as his 1313 series. Eric Roberts' dialogue was recorded in 15 minutes. ==Reception== The film is mostly hated. Film.com hated Duffy. The A.V. Club gave a mostly negative review for the film, but said \"for lovers of utter, unredeemable trash, it is highly recommended.\" CraveOnline also gave a negative review, but said the film should be for \"Bad Movie Night\". In an interview, DeCoteau, talking about the film, said \"people have called me who I haven't seen since high school who said, 'David, after 100 movies you've finally made a movie we like.'\" He added, \"I watched it again, because I hadn't seen it since we made it, and it is so ridiculous and hilarious and over-the-top.\" == References == ==Other websites== * * Category:2013 comedy movies Category:Movies about cats Category:American family comedy movies",
 "title": "A Talking Cat!?!"
}