{
 "id": "76137",
 "text": "Toki Pona is a constructed language. Sonja Lang, a Canadian translator and linguist, made this language. The words mean \"good language\" or \"simple language\". It could also translate to \"simple speak\". It is a very simple language. Toki Pona uses simple ideas that all cultures know. However, Lang did not make Toki Pona as an international auxiliary language (a language to help people speaking different languages). She made it to test ideas about minimalism (taking out things that are not needed) and pidgins. She also used Taoist ideas. ==Sounds== Toki Pona only has nine consonants (/p, t, k, m, n, l, j, w, s/) and five vowels (/a, e, i, o, u/). Toki Pona does not allow having any consonants at the end of a syllable except for /n/. Lang made it this way so that speakers of most languages could speak Toki Pona without having to learn any new sounds. ==Grammar== Toki Pona is an analytic language which means that it has no inflections and a strict SVO (subject-verb-object) word order. Lang made it this way to reduce the number of possible words. Adjectives follow the words they modify like Spanish does. Toki Pona has several grammatical particles like li that makes a word into a verb. Toki Pona only has four prepositions: lon (similar to English in, on, and at), tawa (similar to English to and for), tan (similar to English from and because), and kepeken (similar to English using). Toki Pona has no tenses, but time can be expressed using prepositions and context phrases. ==Words== Toki Pona only has about 137 words. Words can be used together to talk about other ideas. For example, means \"person\", and means \"good\". So, can mean \"friend\", a person who is good. This is why there does not need to be one word for \"friend\". The small number of words can talk about many ideas in this way. Also, some words might mean a few different things when put together. means \"room\", and means \"move\". However, has many meanings, such as \"airport\", \"gym\", and \"car\". What someone means when they speak Toki Pona depends on the context. For example, if someone wants to exercise, will probably mean \"gym\". There are a few words that show the structure of the sentence. They do not mean anything by themselves. For example, the word shows that the next word is a verb (a word that tells about an action or a state). ==Writing systems== Toki Pona can be written in the Latin alphabet. English also uses this alphabet. In Toki Pona, some of the letters make different sounds than they do in English. Each letter in Toki Pona always makes the same sound. Sonja Lang made her own writing system for Toki Pona. It is called . In English, this means \"good writing\" or \"simple writing\". This system uses pictograms (small drawings based off of how things look). They help show what words mean, not how they sound. People who write in can put two pictograms together by putting the second one either on top of, or inside, the first one. Many Toki Pona speakers write with this system. Some Toki Pona speakers make other ways to write this language. These include sitelen jelo and sitelen Emosi, two writing systems optimized for texting that use emojis, and sitelen sitelen, a writing system that uses mayan-inspired glyphs stacked up on each other. == Example of text == Lord's Prayer (translated by Pije/Jopi): mama pi mi mute o, sina lon sewi kon. nimi sina li sewi. ma sina o kama. jan o pali e wile sina lon sewi kon en lon ma. o pana e moku pi tenpo suno ni tawa mi mute. o weka e pali ike mi. sama la mi weka e pali ike pi jan ante. o lawa ala e mi tawa ike. o lawa e mi tan ike. tenpo ali la sina jo e ma e wawa e pona. Amen. ==References== ==Other websites== *Toki Pona official website *Toki pona lessons * Category:Constructed languages",
 "title": "Toki Pona"
}