{
 "id": "761488",
 "text": "Robert Alfred Morley, called Bob (Kyneton, 20 December 1984) is an Australian actor known especially for his roles in the soap operas Home and Away and Neighbours and in the TV series The 100 , where he plays the part of Bellamy Blake. == Biography == Bob Morley is the son of a Filipino mother and son of an Irish father who died when Bob was a child. Bob has two sisters and a brother, but he is the youngest of the family. The actor lived his childhood on a farm in Victoria, and by the age of eleven he became passionate about acting. Morley studied creative arts at La Trobe University. He got his first role in 2006 in the TV series Home and Away playing the character of Drew Curtis. Morley appeared in the second series of the Australian singing competition It Takes Two in May 2007. On June 12, 2007, he was eliminated after six weeks of the show, although he received the highest score that night. Morley plays Home and Away as Tony Moretti in the 2008 action movie and series The Strip. The series was cancelled due to low ratings and was not confirmed for a second series. He continued to appear in Scorched's Nine Network in 2008. Morley was named \"Bachelor of the Year\" in Cleo magazine. In 2009, he played the role of Lorca in Palindrome for a Dead Poet. The following year, Morley appeared in the fourth season of Sea Patrol in the 5th episode entitled \"Paradise Lost\". In 2011, he starred in the Australian thriller Road Train directed by Dean Francis. The film was released in North America as Road Kill. In June 2011, it was announced that Morley had joined the cast of Neighbours as Aidan Foster. Morley took a ten-week break to appear in Blinder, a film about the rules of Australian football. Bob returned to the set in early June 2012. In 2014 he became part of the protagonists of the US television series The 100 broadcast by The CW. == Private life == Bob is married to the actress Eliza Taylor who married on May 5 2019. She is his colleague in the tv series The 100 , where she plays the role of Clarke Griffin, who is the protagonist. The two met on the set, and few knew about their relationship. Most fans found that they were together only when they announced they were getting married. Considering that many viewers of The 100 have always hoped for a possible relationship between the two characters, the news of the wedding has excited fans. == Bob Morley in The 100 == As already mentioned, thanks to the role of Bellamy Blake in the TV series The 100, Bob Morley has conquered the audience, receiving a lot of acclaim. The character of Bellamy initially is not one of the hundred prisoners sent to Earth to see if it's still possible to live there. He is the brother of Octavia, who is part of the group of the hundred, and who he tries to protect several times. == Filmography == === Cinema === * Road Train, directed by Dean Francis (2010) * Blinder, directed by Richard Gray (2013) * The White City, directed by Tanner King Barklow and Gil Kofman (2014) === Televison === * Home and Away – soap opera (2006-2008) * BancoPaz (Scorched), directed by Tony Tilse - TV film (2008) * The Strip - TV series, 13 episodes (2008) * Sea Patrol - TV series, episode 4x05 (2010) * Neighbours – soap opera (2010-2013) * The 100 - TV series, 84 episodes (2014-in-progress) Bellamy Blake * Winners & Losers - TV series, episodes 5x07 and 5x09 (2016) == Awards and nominations == ===Logie Awards=== * 2007 - Nominated as the most popular new male talent for Home and Away ===Teen Choice Awards=== * 2015 - Nomination for best actor in a fantasy/sci-fi television series for The 100 * 2016 - Nomination for best TV deal with Eliza Taylor for The 100 * 2017 - Nomination for best actor in a fantasy/sci-fi TV series for The 100 * 2018 - Nomination for best actor in a fantasy/sci-fi TV series for The 100 * 2019 - Nomination for best actor in a fantasy/sci-fi TV series for The 100 Category:1984 births Category:American television actors Category:Australian movie actors Category:Australian television actors Category:Living people Category:People from Victoria (Australia)",
 "title": "Bob Morley"
}