{
 "id": "761582",
 "text": "Hilaire Mbakop (born February 28, 1973 in Bangangté, Cameroon) is a literary scholar and writer. He publishes his works in German and French. His literary work based on his intercultural experiences (e.g. Mambé's Homeland (German: Mambés Heimat) and Black African Aliens (French: Les étrangers noirs africains), on the other hand he practices social criticism and attacks political grievances (e.g. The Destroyed Village (German: Das zerstörte Dorf) and The Hexagon and its accomplices (German: Das Hexagon und seine Mittäter)). == Life == After graduating from high school in Bangangté, he began studying German language and literature and history at the University of Yaoundé I in 1992 and at the same time completed his teacher training at the Higher Teachers' Training College affiliated with Yaoundé I. Mbakop's first trip abroad took place in 1996: At the age of 23 he received a scholarship from the DAAD (German Academic Exchange Service) to prepare his master's thesis at the Johann Wolfgang Goethe University in Frankfurt / Main. In 1999 it was published under the title On the Problems of Freedom and Individuality: A Study of Goethe's \"Götz von Berlichingen” and “Egmont”. Four years later Mbakop obtained his doctorate from the same university with a dissertation on the pamphlets of Heinrich Mann and André Gide. Influenced by these authors and the values of Christianity – attendance of the Catholic primary school, PhD scholarship from the Catholic Academic Exchange Service (KAAD) –, he has written some literary works that denounce injustice: Mambé's Homeland (novel, 2007) scourges the gap between poor and poor Rich in Cameroon, Death of a Disabled (novel, 2010) the lack of understanding of an anonymous society for the needs of the disabled, Les étrangers noirs africains (Roman, 2011) the discrimination against Black Africans in Germany. The Social Drama The Destroyed Village (2010) is a lawsuit against the people of Bali-Nyonga who removed the neighboring village Bawock from the map in 2007. In the historical drama The Hexagon and its Accomplices I (2011), France and its Cameroonian henchmen sit on the dock because of the massacre of the Bassas in the second half of the 50s, and in The Hexagon and its Accomplices II (September 2014) they are accused for the genocide against the Bamilékés between 1959 and 1971. In 2010 Mbakop published The Wood Fire Fairy Tales that he had collected three years earlier. In the foreword, he says that he had \"written down these oral stories that were in danger of disappearing, so that they are accessible to everyone,\" and adds, \"At the same time, the written form guarantees that this cultural heritage is saved for posterity.” These fairy tales are a facet of the Medúmbà culture, the richness of which he depicts in his autobiography My Childhood and Youth, that was equally published in 2010. His most recent work is the collection of poems The Faces of Life (October 2014). Mbakop's socio- political commitment expressed itself not only in his books, but also in his journalistic writings and numerous interviews with the media. == Works == *Mambé's Homeland (novel, 2007) *Wood Fire Fairy Tales (2010)https://www.rediroma-verlag.de/buecher/978-3-86870-261-3; https://nachbarschaftafrika.blogspot.com/2013/01/mbakop-holzfeuermarchen.html *The Destroyed Village (social drama, 2010) *My Childhood and Youth (autobiography, 2010The chronicle of a Cameroonian youth, between nostalgia for childhood dreams and changes in a society over the years. By the testimony of daily life, that of the fields, of school, but also the transition to adulthood we 5. we learn about a whole culture with growing complexity. *Death of a Disabled (novel, 2010) *Black African Strangers (novel, 2011) *The Hexagon and its Accomplices I (historical drama, 2011) *The Hexagon and its Accomplices II (2014) *The Faces of Life (poetry, 2014). == References == Category:1973 births Category:Living people Category:African novelists Category:African writers",
 "title": "Hilaire Mbakop"
}