{
 "id": "761571",
 "text": "Zack Snyder's Justice League, also known as \"Snyder Cut\", is the director's cut of the 2017 American superhero movie, Justice League. It is a version of Justice League, the fifth movie of the DC Extended Universe (DCEU) and based on the DC Comics superhero team of the same name, as director Zack Snyder had wanted it before he left the production and Joss Whedon took over his duties. It won the Academy Award for Best Cheer Moment in 2022. ==Differences between the two movies== Like the theatrical release, Zack Snyder's Justice League is about the Justice League, made up of Batman, Superman, Wonder Woman, The Flash, Aquaman, and Cyborg as they try to save the world from the threat of Steppenwolf and Darkseid. However, there are many big differences between the theatrical release and this version of the film, including more backstory on Cyborg (who becomes a much bigger part of the movie), Flash, Aquaman, Steppenwolf, and Darkseid. The \"Snyder Cut\" takes itself more seriously than the theatrical cut, featuring more action and character development and fewer \"corny\" jokes, in addition to showing characters who were originally left out like Iris West, Ryan Choi, Martian Manhunter and The Joker. It also gets rid of any scenes that Joss Whedon had filmed, only relying on what Zack Snyder had filmed before leaving the project, in addition to one more scene filmed in 2020. The movie is divided into six parts with an epilogue due to its 4-hour length. ==Plot== Thousands of years ago, Darkseid and his parademon armies try to conquer the Earth, but they are defeated by a combined army of humans, Amazons, Atlanteans, Olympic Gods Zeus, Ares and Artemis, and a Green Lantern. In the present day when Superman is killed fighting Doomsday, his dying scream reawakens the Mother Boxes, devices that were used to try and destroy the Earth but left behind by Darkseid, alerting Steppenwolf, who is Darkseid's exiled lieutenant. Aiming to get the boxes to turn Earth into a copy of Apokolips, his home planet, Steppenwolf invades Themyscira first to take the Mother Box guarded by the Amazons, who send a warning to Diana Prince, leading her to find out the history of the Mother Boxes and the first battle on Earth. Diana informs Bruce Wayne, and as the two are trying to form a team of superheroes in Superman's absence, they realize they need to act fast with Steppenwolf trying to recapture the Mother Boxes. Though Bruce had failed to recruit Arthur Curry, he finds Barry Allen and gets him to join, but Diana is unable to convince Victor Stone to join until Victor's father Silas is kidnapped by the parademons and brought to Steppenwolf. Meanwhile, Arthur is convinced to help the Atlanteans guard their Mother Box. He manages to save Mera when Steppenwolf attacks the outpost but is unable to prevent the alien from taking the second box. Victor arrives in time to help Bruce, Diana, and Barry rescue several S.T.A.R. Labs scientists, including Silas, from an underwater building where Steppenwolf is questioning them about the final Mother Box's location. Though they fight Steppenwolf off, the building is flooded and they are only saved when Arthur arrives and stops the water from reaching them. Steppenwolf, having failed to get the third box, receives a vision of the Anti-Life Equation that Darkseid wants so he can rule over all universes, realizing it is on Earth. He tells Darkseid and DeSaad, and Darkseid promises to redeem him if he can find the third box and transform Earth with the boxes. Meanwhile, Victor retrieves the Mother Box, which he had hidden, and tells the rest of the team that the device was used by Silas to save his life and rebuild him as a cyborg after a horrific car crash that also killed his mother. After this, the team realizes that the Box can be used to return Superman to life and they all agree to try and bring him back, though they realize the box will alert Steppenwolf either way. They dig up Clark Kent's body before sneaking it to the Kryptonian ship under watch by S.T.A.R. Labs, placing it in the waters of the ship's Genesis Chamber. Clark is resurrected when Barry charges the box with his speed, but having lost his memories, he attacks the team when Victor targets him in self-defense. Lois Lane arrives and calms Clark down before he can kill Bruce, and they go back to Smallville so he can regain his memories. The box is located by Steppenwolf, but before he can take it, Silas charges it with laser heat, allowing himself to die in the process, so that Victor can track the box. As the team, without Superman, locates the Mother Box in Russia back at the Batcave, Victor decides to separate the \"Unity\" of the boxes himself, recruiting Barry to help give him a charge to get in. The five heroes arrive as Steppenwolf tries to unite the boxes, with Superman later joining to help them beat up Steppenwolf, but they are not able to stop the Unity in time. As the Unity creates a big explosion, Barry manages to run faster than the speed of light to reverse time and undo this, giving Victor the spark needed to get in and separate the boxes with Superman's help. The team then kills Steppenwolf and throws his body back to Apokolips at Darkseid's feet through a portal. Darkseid vows revenge and aims to come to Earth himself to get the Anti-Life equation. After the battle, Bruce, Diana and Alfred Pennyworth decide to rebuild Wayne Manor as the team's headquarters. Barry gets a job in Central City's police department, Victor listens to a message left behind by Silas, Arthur goes to see his father, and Clark goes back to being a reporter and Superman. Lex Luthor escapes prison and tells Deathstroke the secret identity of Batman. After another bad dream of a world where Superman is controlled by Darkseid, Bruce wakes up and is greeted by Martian Manhunter, who had been on Earth this whole time pretending to be General Swanwick. He thanks Bruce for forming the team and defeating Steppenwolf before promising to be in touch to help plan for Darkseid's return. ==Cast== *Ben Affleck as Bruce Wayne / Batman *Henry Cavill as Kal-El / Clark Kent / Superman *Amy Adams as Lois Lane *Gal Gadot as Diana Prince / Wonder Woman *Ray Fisher as Victor Stone / Cyborg *Jason Momoa as Arthur Curry / Aquaman *Ezra Miller as Barry Allen / The Flash *Willem Dafoe as Nuidis Vulko *Jeremy Irons as Alfred Pennyworth *J. K. Simmons as Commissioner Gordon *Diane Lane as Martha Kent *Joe Morton as Silas Stone *Jesse Eisenberg as Lex Luthor *Harry Lennix as Gen. Calvin Swanwick / Martian Manhunter *Amber Heard as Mera *Ciarán Hinds as Steppenwolf *Kiersey Clemons as Iris West *Joe Manganiello as Deathstroke *Connie Nielsen as Hippolyta *Lisa Loven Kongsli as Menalippe *Billy Crudup as Dr. Henry Allen *Zheng Kai as Ryan Choi *Ray Porter as Darkseid *Peter Guiness as DeSaad *Jared Leto as the Joker *Carla Gugino as Kelex (voice) *Michael McElhatton as Terrorist bank robber *Robin Wright as Antiope *David Thewlis as Ares ==Background== In May 2017, Snyder stepped down during post-production following the suicide of his daughter, and Whedon took over, finishing the movie as an uncredited director. Whedon took over reshoots and other changes that added a brighter tone and more humor, and cut the runtime down to 120 minutes. The theatrical Justice League was a commercial failure and received mixed reviews, leading Warner Bros. to rethink the future of the DCEU. When it was revealed that the movie had a troubled production and its state before Snyder stepped down, many fans wanted to see Snyder's version of the movie. Fans and members of the cast and crew petitioned for the release of this, which they nicknamed the \"Snyder Cut\". At the time, Warner Bros. had no plans to release an alternate cut, and movie industry figures regarded the release as unlikely. However, Warner Bros. changed its mind in February 2020. In May, Snyder announced that the original four-hour cut would be completed and released as Zack Snyder's Justice League by the streaming service HBO Max. The Snyder Cut will cost $20–30 million to complete the visual effects, score, and editing with an additional $40-50 million for reshoots. ==Release== Zack Snyder's Justice League was released in March 18, 2021 on HBO Max. and the Philippines released in March 20, 2021 in HBO Go. With a runtime of 242 minutes, it is the longest superhero movie ever made. ==Notes== ==References== Category:2021 movies Category:2020s superhero movies Category:Alternate versions of movies Category:Warner Bros. movies Category:Batman movies Category:English-language movies Category:Movies directed by Zack Snyder Category:Superman movies Category:Wonder Woman movies Category:Justice League Category:DC Extended Universe movies Category:Screenplays by Chris Terrio Category:Superhero crossover movies Category:Apocalyptic movies Category:Post- apocalyptic movies Category:American superhero movies Category:Movies about resurrection Category:HBO Max",
 "title": "Zack Snyder's Justice League"
}