{
 "id": "761679",
 "text": "Sadhu Sundar Singh (Punjabi: ) (Gurmukhi); (Shahmukhi) was born on 3rd September 1889. He was an Indian born Christian missionary. He is believed to have died in the foothills of the Himalayas in 1929. ==Early life== Sundar Singh (born 1889 – disappeared 1929) was a Christian missionary and religious figure from India. He was born into a Sikh family in Punjab, India. During his childhood, Singh attended a Christian school, where he was exposed to Christian teachings. He was also influenced by Hindu and Sikh religious traditions through interactions with holy men. At the age of 14, Singh experienced a personal crisis following the death of his mother, leading him to rebel against religion. Contemplating suicide, he reportedly prayed for divine intervention, after which he claimed to have had a vision of Jesus Christ. This experience profoundly transformed him, and he decided to embrace Christianity. Despite opposition from his family, Singh was baptized into the Christian faith at the age of 16. He subsequently dedicated his life to missionary work, traveling extensively to share his faith and spiritual teachings. ==Missionary travels== Taking the title Sadhu, Sundar began to travel within India and Kashmir. He also went to Afghanistan and Tibet. He believed that western influences had corrupted Christian belief and practice. He studied at an Anglican college for a short time. He left because the priest tried to get him to dress like a European and adopt other British customs. His travels are believed to have resulted in many conversions. He kept no records so exact information is not available. It is also reported that he performed miracles through the power of Jesus. Later Sundar Singh traveled in many countries including Europe and North America. Discouraged by the materialism of those countries, he returned to India to continue his work. While on a final trip to Tibet, he is assumed to have died, but details are unknown. == References == Category:1888 births Category:1929 deaths Category:Christian mystics Category:Converts to Christianity Category:Indian Christians Category:Punjabi people Category:Year of death unknown",
 "title": "Sadhu Sundar Singh"
}