{
 "id": "761686",
 "text": "Joseph-Achille Mbembe, known as Achille Mbembe (; born 1957), is a Cameroonian philosopher, political theorist, and public intellectual.Achille Mbembe to deliver a second “Thinking Africa” Public Lecture , Rhodes University, 5 July 2012 == Biography == Mbembe was born near Otélé in Cameroon in 1957. He obtained his Ph.D. in history at the University of Sorbonne in Paris, France, in 1989. He has held appointments at Columbia University in New York, Brookings Institution in Washington, D.C., University of Pennsylvania, University of California, Berkeley, Yale University, Duke University and Council for the Development of Social Science Research in Africa (CODESRIA) in Dakar, Senegal.Achille Mbembe, WISER Staff Profile He was assistant professor of history at Columbia University, New York, from 1988–1991, a senior research fellow at the Brookings Institution in Washington, D.C., from 1991 to 1992, associate professor of history at the University of Pennsylvania from 1992 to 1996, executive director of the Council for the Development of Social Science Research in Africa (Codesria) in Dakar, Senegal, from 1996 to 2000. Achille was also a visiting professor at the University of California, Berkeley, in 2001, and a visiting professor at Yale University in 2003. He was a research professor in history and politics at Harvard University's W. E. B. Du Bois Research Institute. He has written extensively in African history and politics, including La naissance du maquis dans le Sud-Cameroun (Paris: Karthala, 1996). On the Postcolony was published in Paris in 2000 in French and the English translation was published by the University of California Press, Berkeley, in 2001. In 2015, Wits University Press published a new, African edition. He has an A1 rating from the National Research Foundation. On March 14, 2024, Achille Mbembe was awarded the 2024 Holberg Prize for arts and letters, humanities, law and theology. The handover ceremony takes place on June 6, 2024 at the University of Bergen, Norway. == Current appointments == Mbembe is currently a member of the staff at the Wits Institute for Social and Economic Research (WISER) at the University of the Witwatersrand in Johannesburg, South Africa, and also has an annual visiting appointment at the Franklin Humanities Institute at Duke University. He is a contributing editor to the scholarly journal Public Culture.\"Achille Mbembe\" (faculty page). Division of Philosophy, Art, and Critical Thought, European Graduate School. egs.edu. Retrieved 2018-07-11. == Work == His main research topics are African history, Postcolonial Studies and politics and social science. Mbembe’s most important works are: Les jeunes et l’ordre politique en Afrique noire (1985); La naissance du maquis dans le Sud-Cameroun (1920–1960); Histoire des usages de la raison en colonie (1996); De la postcolonie. Essai sur l’imagination politique dans l’Afrique contemporaine (On the Postcolony) (2000); Sortir de la grande nuit: Essai sur l'Afrique décolonisée (2003); Critique de la raison nègre (2013). Mbembe interprets Africa not as a defined, isolated place but as a strange relation between itself and the rest of the world which plays out simultaneously on political, psychic, semiotic, and sexual levels. He argues that the colonial powers dictated how some people may live and how some must die. He uses the examples of Palestine and South Africa to show how the power of sovereignty now serves the creation of zones of death where death becomes the ultimate exercise of domination and the primary form of resistance. Achille Mbembe denounces the lack of democracy in Africa, and calls for the end of the CFA franc, and of French military bases in Africa, he highlights the loss of French influence in Africa. == Awards == * 2015 Geschwister- Scholl-Preis for his work Critique de la raison nègre * 2018 Gerda Henkel Prize == Private life == Achille Mbembe is married to Sarah Nuttall, who is Professor of Literary and Cultural Studies and Director of the Wits Institute for Social and Economic Research at the University of the Witwatersrand, Johannesburg. They have written several texts together and have two children. == Books == * 1985 Les Jeunes et l'ordre politique en Afrique noire, Éditions L'Harmattan, Paris 1985 * 1996 La naissance du maquis dans le Sud-Cameroun, 1920–1960: histoire des usages de la raison en colonie. * 2000 De La Postcolonie, essai sur l'imagination politique dans l'Afrique contemporaine. (English edition On the Postcolony, 2001. Second revised French edition, 2005.) * 2000 Du Gouvernement prive indirect. (English edition On Private Indirect Government (State of the Literature), 2002.) * 2010 Sortir de la grande nuit – Essai sur l'Afrique décoloniséeSandeep Bakshi. Book Review: Achille Mbembe: Sortir de la Grande Nuit: Essai sur l'Afrique Décolonisée. We Must Get Out of the Great Night: Essay on Decolonized Africa. International Feminist Journal of Politics. Special Issue: Murderous Inclusions. Vol. 15, no. 4. * 2013 Critique de la raison nègre. (English edition Critique of Black Reason). 2017. Duke University Press. Translated by Laurent Dubois. * 2016 Politiques de l'inimitié * 2020 Brutalisme Editions de la Découverte. ==Related pages== *List of scientists from Africa == References == == Other websites == * Staff Profile at WISER, WITS University Category:1957 births Category:Cameroonian writers Category:Philosophers Category:Political scientists Category:Living people Category:Academics",
 "title": "Achille Mbembe"
}