{
 "id": "761611",
 "text": "United 93 is a 2006 biographical drama-thriller movie written, co-produced and directed by Paul Greengrass. It is about the events aboard United Airlines Flight 93,Barra, Allen. \"Historical Film: It's Time to See a Movie We Couldn't Bear to Go To\". American Heritage, November/December 2006. which was hijacked during the September 11 attacks. The movie was made with the help of many of the passengers' families,Heath, Iver (January 1, 2006). \"Four Years On, a Cabin's-Eye View of 9/11\". The New York Times. though not all agreed to participate.Brooks, Xan (June 7, 2006). \"United 93 'surrender monkey' defends role in film\". The Guardian. ==Plot== On the morning of September 11, 2001, four al-Qaeda terrorists Ziad Jarrah, Saeed al-Ghamdi, Ahmed al-Nami and Ahmed al-Haznawi pray in a Newark, New Jersey hotel, and after Jarrah makes a final phone call to his girlfriend, board United Airlines Flight 93, piloted by Captain Jason Dahl and First Officer LeRoy Homer Jr., at Newark International Airport. Among the passengers are Tom Burnett, Todd Beamer, Jeremy Glick, Richard Guadagno, Louis J. Nacke II, Lauren Grandcolas and Mark Bingham who is the last passenger to board, barely making the flight. Air traffic controllers determine that American Airlines Flight 11 has been hijacked and is heading toward New York City. Flight 93 takes off after a slight delay. Flight 11 crashes into the North Tower of the World Trade Center, and United Airlines Flight 175 is also hijacked and heads toward New York City. Air traffic controllers learn that American Airlines Flight 77 has also been hijacked and watch as Flight 175 crashes into the South Tower . As the passengers are served breakfast on Flight 93, Jarrah hesitates to give the sign to start the hijacking. Via an ACARS message, Dahl and Homer are notified of the WTC attacks and to beware cockpit intrusion. Nami demands to start the hijack and Jarrah nervously insists not yet. An impatient Haznawi prepares an artificial bomb in the lavatory and Ghamdi grabs flight attendant Deborah Welsh at knifepoint. Passenger Mark Rothenberg is mortally wounded by Haznawi who shows the \"bomb\", causing mass panic among the passengers. Haznawi and Nami force the first-class passengers to the back of the plane while Ghamdi kills Homer and Dahl after he sends out a mayday call, then kills Welsh. Jarrah takes control of the plane and flies to Washington, D.C., to crash it into the United States Capitol. Grandcolas (an emergency medical technician) tries to help the dying Rothenberg but Nami berates her. The hijackers jubilantly react to the WTC attack.Saeed al-Ghamdi: God willing, we are going to get there.[as the panting Ghamdi sluices blood off his hands with a bottle of spring water, Jarrah puts a picture of the Capitol on the yoke] While flight attendants Sandra Bradshaw and CeeCee Lyles unsuccessfully attempt to revive Rothenberg, Bradshaw sees the hijackers moving the bodies of the pilots and Welsh and the passengers overhear this. After Flight 77 crashes into The Pentagon, FAA National Operations Manager Ben Sliney shuts down all United States air space and ground all flights. Passengers on Flight 93 learn from family members via airphone of the attacks. Realising their plane is going to be used as a weapon, Burnett, Bingham, Beamer, Glick, Guadagno and Nacke organize an assault against the hijackers to retake the plane, with assistance from flight staff, arming themselves with weapons, learning passenger Donald Greene is a licensed pilot and passenger Andrew Garcia is a former air traffic controller. Seeing the group gather, Haznawi and Nami anxiously realise they can't keep the passengers under control for long and Jarrah and Ghamdi become agitated, as they are twenty minutes away from their target and realise the passengers will thwart their plans. Passenger Christian Adams, attempting to counsel appeasement, is restrained by some of the passengers, while other passengers pray and make final calls to loved ones. After Beamer urges the passengers to take action, Glick leads the group against a stunned Haznawi.Ahmed al-Haznawi: [waving the dummy detonator in a frantic effort as the passengers charge him] No! No! No! No! Haznawi is tackled and repeatedly beaten by Glick and Nacke. While Nami, Ghamdi and Jarrah panic and Ghamdi’s plead for assistance is refused by Jarrah, Bingham crushes Haznawi’s skull with a fire extinguisher, killing him and Nacke declares the bomb a fake.Saeed Al Ghamdi: They're beating Haznawi! Let me go and help him! / Ziad Jarrah: No! Hold onto something, I’m gonna lower the aircraft! Grandcolas, passengers William Cashman, Patrick Driscoll and Alan Beaven join the assault, while Jarrah violently rocks the plane to throw the passengers off balance. Despite Nami's efforts to keep the group at bay with the use of a serving cart, Mace and a fire extinguisher, Jarrah’s violent flying causes him to lose balance and the passengers push the cart back into him and a scared Nami is subdued and after gouging out his eyes, Glick snaps Nami's neck, killing him. As Bradshaw, Lyles, Grandcolas, Cashman, Driscoll, and Beaven try to help Greene and Garcia though first-class, the male, able-bodied passengers batter the cockpit door with the cart and Jarrah and Ghamdi become terrified and disheartened as they have failed in their mission, and despite Ghamdi's efforts to hold against the door with the use of a fire axe, the passengers breach the cockpit just as Jarrah puts the plane into a steep dive, and wrestle with the two remaining hijackers for control. Ghamdi tries to protect Jarrah but the passengers overpower him, as Burnett begins choking out Jarrah.Ziad Jarrah: Let go! Give it to me! / Saeed Al Ghamdi: No! I can't pull! I can't! The aircraft inverts and crashes into a Shanksville field, killing everyone aboard. ==Production== The roles of one of the flight attendants, the two pilots, and many other airline personnel were filled by actual airline employees. During production, the actors playing the crew and the passengers of the flight were put in separate hotels from the actors portraying the hijackers, even eating their meals separately, ostensibly to create an air of antagonism in the film between the two groups. The set itself was built so that it moved the way the actual flight did. During the filming, many of the actors actually got hurt, and the blood visible on their faces during the revolting scene is authentic and not fake. During the scene where Nami is killed by the passengers in the revolt, he is shown crying. Finishing the very first take, Jamie Harding (who played Nami) was overwhelmed that he was sobbing. In this scene, the sobbing Nami makes as Glick holds him around the head and throat and twists, breaking his neck, is authentic and not acted. Adams saying that the memory of her husband's death was still too raw. Sunday Times critic Cosmo Landesman mused, \"Surely one of the passengers didn't phone home to point out that there was a cowardly German on board who wanted to give in?\"\"A terrifying flight back in time\" June 4, 2006 The Times Critic John Harris suggested in a Guardian blog, \"there will surely be all kinds of cries about old European surrender monkeys, the United States' contrasting backbone etc.\"Skating on thin air May 25, 2006, http://commentisfree.guardian.co.uk accessed June 11, 2006 ==Release== United 93 premiered on April 26, 2006, at the Tribeca Film Festival in New York City.(March 29, 2006). \"September 11 plane drama to open NY film festival\". Reuters article. Several family members of the passengers aboard the flight attended the premiere to show their support. The movie opened in North America on April 28, 2006, to strong positive reviews.(April 10, 20??). \"A Dark Day Revisited\". Newsweek. The total money made from United 93 was $31.4 million in the United States, and $76.3 million worldwide. The movie also received two Academy Award nominations, including Best Director for Greengrass. ==References== Category:2006 drama movies Category:2006 thriller movies Category:2000s drama thriller movies Category:2000s biographical movies Category:American biographical movies Category:American drama thriller movies Category:British biographical movies Category:British drama thriller movies Category:French biographical movies Category:French drama movies Category:French thriller movies Category:Movies based on the September 11 attacks Category:Movies directed by Paul Greengrass Category:Movies set in Virginia Category:Movies set in Boston Category:Movies set in New Jersey Category:Movies set in Pennsylvania Category:Movies set in the 2000s",
 "title": "United 93 (movie)"
}