{
 "id": "761761",
 "text": "Good Morning Britain (often abbreviated to GMB) is a British breakfast programme. It is live every weekday usually on British television network ITV1 from 6:00 am to 9:00 am (formerly 8:30am). The show launched on 28 April 2014 after Daybreak was permanently postponed. The current main anchors are Susanna Reid with Charlotte Hawkins, Ranvir Singh and Sean Fletcher as newsreaders. Piers Morgan presented the show from May 2015 to March 2021 due to a heated argument with the weather presenter Alex Beresford on his critics to Meghan Markle. Ofcom confirmed his actions in front of on-air team members and his critics was very disruptive. Kate Garraway was also an anchor and a newsreader from 2014 to 2022 on seperate days, The show aired until 10:00am, hosted by Lorraine Kelly after Lorraine was temporarily postponed due to the Coronavirus pandemic. On Monday 13 July 2020, the Lorraine programme returned, meaning Good Morning Britain went back to its original air time of 6:00am to 9:00am. On 10 September and 11 September 2022, Good Morning Britain aired a special episode about the death and life of Her Sovereign Majesty Queen Elizabeth II. ==On-air team== Person Title Susanna Reid Monday-Wednesday Presenter / Monday-Thursday Presenter Ben Shephard Thursday-Friday Presenter Charlotte Hawkins Friday Newsreader / Standby Presenter Ed Balls Standby Presenter Richard Madeley Monday-Wednesday Presenter Adil Ray Standby Presenter Sean Fletcher Standby pesenter / Standby Newsreader Ranvir Singh Political Editor for Good Morning Britain and Lorraine / Standby Presenter / Standby Newsreader Martin Lewis Tuesday Money-Saving Expert for ITV Robert Rinder Standby presenter Chris Ship Royal Editor for ITV Paul Brand Editor of the United Kingdom of Great Britain and Northern Ireland for ITV Richard Gaisford Chief Correspondent for ITV / Standby Newsreader Jonathan Swain Correspondent for Good Morning Britain and Lorraine Juliet Dunlop Glasgow Correspondent for Good Morning Britain and Lorraine Katy Rickitt Correspondent for Good Morning Britain and Lorraine / Standby Newsreader Noel Philips North America Correspondent for Good Morning Britain and Lorraine Nick Dixon Correspondent for Good Morning Britain and Lorraine Pip Tomson Correspondent for Good Morning Britain and Lorraine Louisa James Political Correspondent for Good Morning Britain and Lorraine Nita Ranjan Correspondent Kevin Maguire Political Reviewer Andrew Pierce Political Reviewer Martel Maxwell Political Reviewer Katie Nicholl Political Reviewer Dr. Hilary Jones Health Editor for Good Morning Britain and Lorraine Laura Tobin Weather Presenter Alex Beresford Standby Weather Presenter for ITV Des Coleman Standby Weather Presenter Andi Peters Competitions Presenter for ITV Richard Arnold Entertainment Editor Vick Hope Entertainment Correspondent ==Former on-air team== Former on-air team Alastair Campbell Adil Ray Richard Bacon Piers Morgan Richard Madeley John Stapleton Jeremy Kyle Category:British television",
 "title": "Good Morning Britain"
}