{
 "id": "761845",
 "text": "Matrix analysis is a subfield of linear algebra. It focuses on analytical properties of matrices. In this subject, vector norms and matrix norms are introduced. The goal of this area is deepen understanding to matrix eigenvalues and system of linear equations. This leads to discussions in numerical linear algebra.Horn, R. A., & Johnson, C. R. (2012). Matrix analysis. Cambridge University Press.Bellman, R. (1997). Introduction to matrix analysis. SIAM.Meyer, C. D. (2000). Matrix analysis and applied linear algebra. SIAM.Bhatia, R. (2013). Matrix analysis. Springer Science & Business Media.Applied Linear Algebra and Matrix Analysis, Thomas S. Shores, Undergraduate Texts in Mathematics (2018). Springer International Publishing. ==Main Topics== The following topics are studied in the context of matrix analysis: * Discussing matrices by tools from functional analysis * Inequalities related to matrix norms or matrix eigenvaluesKittaneh, F. (1992). A note on the arithmetic-geometric-mean inequality for matrices. :en:Linear Algebra and its Applications, 171, 1-8.Bhatia, R., & Kittaneh, F. (2000). Notes on matrix arithmetic–geometric mean inequalities. Linear Algebra and Its Applications, 308(1-3), 203-211.Bhatia, R., & Davis, C. (1993). More matrix forms of the arithmetic-geometric mean inequality. SIAM Journal on Matrix Analysis and Applications, 14(1), 132-136.Cardoso, J. R., & Ralha, R. (2016). Matrix arithmetic-geometric mean and the computation of the logarithm. SIAM Journal on Matrix Analysis and Applications, 37(2), 719-743. * Behavior of matrix eigenvalues ==Significance== Functional analysis usually discusses mathematical operators in infinite dimension Hilbert spaces.Conway, J. B. (2019). A course in functional analysis (Vol. 96). Springer. But difficulty remains even discussion is limited to matrices (which is a finite dimension mathematical operator). This is because difficulty comes not only from infinite dimension but also non-commutativity.Simon, B. (2015). Operator theory. American Mathematical Society.Alpay, D., Cipriani, F., Colombo, F., Guido, D., Sabadini, I., & Sauvageot, J. L. (2016). Noncommutative analysis, operator theory and applications. Springer International Publishing.Yoshino, Takashi (1993). Introduction to Operator Theory. Chapman and Hall/CRC. ISBN 978-0582237438. And matrices are good examples of non-commutative mathematical operators (In other words, you cannot change the order of matrix multiplication). Matrix analysis is trying to overcome problems caused by non- commutativity. ==Achievements== The following results are known as remarkable achievements in this area: * Matrix Young inequalitiesAndo, T. (1995). Matrix young inequalities. In Operator theory in function spaces and Banach lattices (pp. 33-38). Birkhäuser Basel. * Lidskii theoremLewis, A. S. (2000). Lidskii's theorem via nonsmooth analysis. SIAM Journal on Matrix Analysis and Applications, 21(2), 379-381. * Hansen-Pedersen methodF. Hansen, G.K. Pedersen, Jensen’s inequality for operators and Loewner’s theorem, Math. Ann. 258 (1982) 229–241.F. Hansen, G.K. Pedersen, Jensen’s operator inequality, Bull. London Math. Soc. 35 (2003) 553–564. ==Journals== The following journals include articles about matrix analysis: * SIAM Journal on Matrix Analysis and Applications (Published by the Society for Industrial and Applied Mathematics) * Linear Algebra and its Applications * Linear and Multilinear Algebra * The Electronic Journal of Linear Algebra (Published by the International Linear Algebra Society) ==References== ==Further Reading== * * Category:Fields of mathematics category:Linear algebra",
 "title": "Matrix analysis"
}