{
 "id": "762007",
 "text": "SM Aslam Talukder (14 April 1960– 17 February 2008), known by his stage name Manna, was a remarkably most successfully Bangladeshi movie actor and producer. In his 24 years career he has acted in more than three hundred movies.He is called the latest Mahanayak(great hero) & Megastar of the Dhaliwood golden generation. Dhaliwood Superstar Manna's position after the hero Raj-Razzak who has held the top position of popularity in Dhaliwood movies for a long time. He earned numerous accolades in his long career, including 1 National Film Awards, 3 Meril Prothom Alo Awards, 5 Bachsas Awards. He earned a Bangladesh National Film Award for Best Actor for his role in the movie Bir Soinik (2003). ==Early life== Manna was born on 14 April 1960 at Elenga in Tangail District. He acted in over 300 movies. His acting career started in 1984 after he was discovered through a talent search program by the National Film Development Corporation of Bangladesh. ==Career== Manna was the General Secretary of the Bangladesh Film Actors Association. As the general secretary, he was active in the ongoing movement against vulgarity in the Dhallywood film industry. One of the first movies that brought him to attention was Danga (1992). Other commercially successful movies are Traash, Shanto kano mastan and & Amma Jaan. Montajur Rahman Akbar's Shanto Keno Mastan and Ke Amar Baba were released in 1998 and 1999. In 1999, the movie Ammajan directed by Kazi Hayat released. The movie established Manna into a permanent position in Bangla movie history as it was one of the most successful commercial movies of Bengali movie history. On average, Manna acted in 10 movies each year. Among movies released last year, he played lead roles in commercially successful movies including Saajghor, Khomotar Garom, Moner Shathey Juddho, Machine-man, Ulta Palta 69 and Shotru Shotru Khela. Manna received several prestigious awards including a National Film Award for Best Actor in 2005. As an action hero, Manna acted in collaboration with action director Kazi Hayat's 20 movies and Montazur Rahman Akbar's 22 movies. ==Death== Manna died on 17 February 2008 following a heart attack at United Hospital Limited. ==Filmography== ; As actor {| class=\"wikitable sortable\" |- ! Year ! Title ! Director !class=unsortable| Co-stars !class=unsortable| Notes !class=unsortable| Ref. |- 1985 Tauba Azharul Islam 1985 Pagli Kazi Hayat 1985 Shimul Parul Delwar Jahan Jhontu Faruk, Sunetra, Bulbul Ahmed, Falguni Ahmed 1986 Nishpap Alamgir Champa Special appearance 1988 Baap Beta 420 Kobita 1988 Amar Jaan Aftab Khan Tulu Champa 1988 Bhai Azharul Islam Khan Champa 1989 Cobra E R Khan Farjana Bobi, Anju Ghosh 1989 Badshah Bhai Ilias Kanchan 1990 Choto Bou Jainuddin Ahmed Rani 1990 Amma 1990 Goriber Bondhu Delwar Jahan Jhontu Alamgir 1990 Palki Delwar Jahan Jhontu Nipa Monalisa Dukhini Maa Delwar Jahan Jhontu Shunetra Obujh Shontan Kamal Ahmed Aruna Biswas/Rani 1991 Kashem Malar Prem Mostafa Anwar Champa 1991 Danga Kazi Hayat Rajib, Suchorita 1992 Traash Kazi Hayat Rajeeb 1992 Gorom Hawa Bulbul Ahmed Champa, Amit Hasan, Aruna Biswas 1993 Chadabaz Kazi Hayat 1993 Prem Dewana Montazur Rahman Akbar Champa 1994 Disco Dancer Montazur Rahman Akbar Champa 1994 Sipahi Kazi Hayat Kobita 1994 Desh Premik Kazi Hayat Champa 1994 Disco Baidani Jillur Rahman Jashim 1995 Babar Adesh Montazur Rahman Akbar Champa 1995 Shesh Khela Noor Hossain Bolai Champa 1996 Khol Nayok Montazur Rahman Akbar Champa, Sangeeta 1996 Bashira Montazur Rahman Akbar Rani 1997 Deshdrohi Kazi Hayat Rajib 1997 Shakkat Saiful Azam Kashem Champa, Shabnaz 1997 Loot Toraz - The Plunder Kazi Hayat Moushumi, Diti 1997 Gunda - Police Shawkat Jamil Ilias Kanchan, Diti, Manna, Sondha 1998 Teji Kazi Hayat Eka 1998 Shanto Keno Mastan Montazur Rahman Akbar Shahnaz 1999 Ke Amar Baba Montazur Rahman Akbar Popy, Rajeeb, Humayun Faridi 1999 Dhar Kazi Hayat Eka 1999 Ammajan Kazi Hayat Shabnam, Moushumi 1999 Dushmon Dunia Shafiqul Islam Mousumi 1999 Gono Dushmon Dipjol Popy, Shakib Khan, Munmun 2000 Jhor Kazi Hayat Mousumi 2000 Koshto Kazi Hayat Moushumi 2000 Bortoman Kazi Hayat Mousumi 2000 Gunda Number One Montazur Rahman Akbar Shahnaz 2000 Kukkhato Khuni Montazur Rahman Akbar Mousumi 2001 Abbajan Kazi Hayat Rajeeb, Sathi 2001 Sultan FI Manik Purnima 2001 Panja Kazi Hayat Mousumi 2001 Rongbaz Badshah Montazur Rahman Akbar Keya 2001 Tandob Lila Kazi Hayat Mousumi 2002 Abar Ekti Juddho Badal Khondokar Mousumi 2002 Bhoyanok Songghorso Montazur Rahman Akbar Mousumi 2002 Mastaner Upor Mastan Montazur Rahman Akbar Purnima 2002 Dhakaiya Mastan Montazur Rahman Akbar Mousumi 2002 Major Shaheb Montazur Rahman Akbar Mousumi 2002 Arman Montazur Rahman Akbar Purnima 2002 Aghat Palta Aghat Montazur Rahman Akbar Mousumi 2002 Bhaia F I Manik Shabnur, Rachana Banerjee 2002 Khoto Bikkhoto Monowar Khokon Purnima 2002 Bheza Biral Shahidul Islam Khokon Moushumi, Shimla 2003 Bir Soinik Delwar Jahan Jhontu Mousumi, Rosy Afsari, Humayun Faridi National Film Award as Best Actor 2003 Dui Bodhu Ek Shami F I Manik Moushumi, Shabnur 2003 Kothin Shimar Montazur Rahman Akbar Popy 2003 Minister Kazi Hayat Mousumi 2003 Big Boss Montazur Rahman Akbar Mousumi 2003 Top Shomrat Montazur Rahman Akbar Antara Biswas 2003 Villain Ispahani Arif Jahan Purnima 2004 Manna Bhai F I Manik Popy 2004 Bhai Er Shotru Bhai Montazur Rahman Akbar Shabnur 2004 Ami Jail Theke Bolchi Malek Afsary Moushumi 2005 Somajke Bodle Dao Kazi Hayat Shabnur 2005 City Terror M A Rahim Popy 2005 Gaddari Shafi Iqbal Purnima 2005 Shontrashi Munna Ispahani Arif Jahan Moushumi 2005 Swami Chintai Sohanur Rahman Sohan Moushumi, Rituparna Sengupta 2005 Ziddi Driver Uttam Akash Popy 2006 Kabuliwala (movie) Kazi Hayat Dighi, Subrata 2006 Mayer Morjada Dilip Biswas Moushumi, 2006 Jiboner Golpo Gazi Mazharul Anwar Moushumi, Shabnur 2006 Banglar Hero Ahmed Nasir Nodi 2006 Ulta Palta 69 Malek Afsary Purnima 2007 Moner Sathe Juddho Ahmed Nasir Purnima 2007 Dhoka Shahin Sumon Purnima 2007 Babar Kosom Badiul Alam Khokon Nipun Akter 2007 Ei Je Duniya Gazi Mazharul Anwar Moushumi, Shabnur 2007 Jomdut Nodi 2007 Rickshawalar Prem Rokibul Alam Rokib Nipun Akter 2007 Mayer Bodla Nodi 2007 Shanto Keno Oshanto Ahmed Ali Mandal, Md. Salah Uddin Shahanaz 2007 Shotru Shotru Khela Mohammad Jainal Abedin Moushumi 2007 Musa Bhai M B Manik Nodi 2007 Khomotar Gorom P A Kajal Purnima 2007 Saajghor Shah Alam Kiron Moushumi, Nipun Akter 2007 Machine Man Shafi Iqbal Moushumi, Apu biswas 2008 Obujh Shishu Shafiqul Islam Bhairabi Moushumi, Dighi, Resi Released on 22 February 2008 2008 Shreshto Shontan Rokibul Alam Rokib Popy Released on 29 February 2008 2008 Kothin Purush Shahadat Hossain Liton Manna, Shabnur Released on 29 February 2008? 2008 Bhalobashar Dushmon Wakil Ahmed Shabnur 2008 Babar Jonno Juddho Montazur Rahman Akbar Nipun Akter 2008 Pita Matar Amanat FI Manik Purnima, Apu Biswas 2008 Boroloker Jamai P A Kajal Nipun Akter 2008 Power Monowar Khokon Nipun Akter 2008 Maa Babar Shopno Reza Latif Apu Biswas Released on 14 March 2008 2008 Aslam Bhai Ispahani Arif Jahan Jona 2008 Dui Diner Duniya B R Chowdhury Jona 2009 Jagat Shongshar Raihan Mujib Popy 2009 Jibon Niye Juddho Niranjan Biswas Shabnur 2009 Hridoy Theke Pawa Mohammad Hossain Jemi Moushumi, Champa 2010 Mughal-E-Azam Mizanur Rahman Dipu Shabnur 2010 Doriya Parer Doulati Abdullah Al Mamun Popy 2011 Nosto Jibon Rokibul Alam Rokib Nodi 2015 Lila Monthon Jahid Hossain Moushumi, Popy Based on Bangladesh Liberation War ; As producer * Loot Toraz * Lal Badshah * Abbajan * Swami Strir Juddho * Dui Bodhu Ek Swami * Ami Jail Theke Bolchi * Moner Sathe Juddho * Pita Matar Amanot == Rewards and honors == ; National Film Award He was nominated for several National Film Awards but won one. Years Film Category Results Sources 1992 Kosto Best Actor 1999 Ammajan Best Actor 2003 Bir Soinik Best Actor 2004 Uttarer Khep Best Actor 2006 Kabuliwala Best Actor ; Meril Prothom Alo Award He was nominated for the Merill-Prothom-alo Award a total of eight times, winning three times. Years Film Category Results Sources 1999 Ammajan Best Actor 2000 Kosto Best Actor 2001 Abbajan Best Actor 2002 Shami Striri joddo Best Actor 2003 doi bodu ek shami Best Actor 2005 Ami jeil theke bolsi Best Actor 2006 Mayer Morjada Best Actor 2006 MachineMan Best Actor ; Bachsas Awards He has been nominated for several Bacchus Awards, four times for Best Actor and one posthumously for his contribution to the film industry. Years Film Category Results Sources 1999 Ammajan Best Actor 2001 Abbajan Best Actor 2004 Uttarer Khep Best Actor 2006 Moner sathe joddo Best Actor 2006 Special contribution to the film Special award === Other awards and honors === ; Asian Journalist Human Rights and Cultural Foundation * 'Winner' : AJHRCF Performance Award 2018 (posthumous) === Building naming === The video editing, color grading and dubbing studio has been renamed \"Manna Digital Complex\" in the digital system within the Bangladesh Film Development Corporation for his outstanding contribution to the Bangladesh film industry. ==References== Category:1964 births Category:2008 deaths Category:Bangladeshi movie actors Category:People from Tangail District",
 "title": "Manna (actor)"
}