{
 "id": "762143",
 "text": "\"La Bayamesa\" or \"El Himno de Bayamo\" (\"The Bayamo Song\") is a Cuban pre- revolutionary song which has been the national anthem of Cuba since 1902. First performed in 1868 during the Battle of Bayamo, author and freedom fighter Perucho Figueredo who battled in Bayamo, wrote the lyrics to this song and composed the music before being executed by the Spaniards. In 1898, Cuban conductor Antonio Rodriguez-Ferrer was the anthem's musical introductory note conductor.http://www.nacion.cult.cu/en/sobrehimno.htm About the hymn. Symbols of the Cuban Nation. ==Lyrics== ===Spanish original=== Only the first verse (in bold) is officially part of the anthem. Spanish original (official) IPA transcription (Cuban version) ¡Al combate, corred, bayameses, Que la patria os contempla orgullosa; No temáis una muerte gloriosa, Que morir por la patria es vivir. En cadenas vivir es vivir En afrenta y oprobio sumidos. Del clarín escuchad el sonido: ¡A las armas, valientes, corred!https://www.loc.gov/resource/afc1939013.afc1939013_tt0021/?st=text La Bayamese (Himno Nacional Cubano) [transcript]. Library of Congress. Retrieved 21 May 2020. No temáis los feroces íberos, Son cobardes cual todo tirano. No resisten al bravo cubano; Para siempre su imperio cayó. ¡Cuba libre! Ya España murió, Su poder y su orgullo ¿do es ido? ¡Del clarín escuchad el sonido: ¡¡A las armas!!, valientes, corred! Contemplad nuestras huestes triunfantes, Contempladlos a ellos caídos. Por cobardes huyeron vencidos; ¡Por valientes, sabemos triunfar! ¡Cuba libre! Podemos gritar Del cañón al terrible estampido. ¡Del clarín escuchad el sonido: ¡¡A las armas!!, valientes, corred!94\\. La Bayamesa Himno patriótico Cubano. Músicas en tiempos de guerra.: Cancionero (1503-1939). Cortès, Francesc and Esteve, Josep-Joaquim. 2013. [al komˈbate ǀ koˈjre ǀ baʝaˈmese ǀ] [ke la ˈpatja o kontemˈpla olɣuˈʝosa ǀ] [no teˈmaj ˈuna ˈmwete gloˈjosa ǀ] [ke moˈɾil pol la ˈpatja e biˈβil ‖] [eŋ kaˈena biˈβil e biˈβil] [eŋ afˈɾenta i opˈɾobjo suˈmi.o ‖] [del klaˈɾiŋ ekuˈʃa el soˈni.o ‖] [a la ˈama ǀ baˈljente ǀ koˈjre ‖]''' [no teˈmaj lo feˈɾose ˈiβeɾo ǀ] [soŋ koˈβaðe kwal to.o tiˈɾano ‖] [no jreˈsiteŋ al ˈbɾaβo kuˈβano ‖] [ˈpaɾa sjempɾe su imˈpejo kaˈjo ‖] [ˈkuβa ˈliβɾe ‖ ʝa eˈpaɲa muˈjo ǀ] [su poˈel i su olˈɣuʝo do e i.o ‖] [del klaˈɾiŋ ekuˈʃa el soˈni.o ‖] [a la ˈama ǀ baˈljente ǀ koˈjre ‖] [kontemˈpla ˈnweta ˈwete tjuɱˈfante ǀ] [kontemˈplaðlo a ˈeʝo kaˈi.o ‖] [pol koˈβaðe uʝeˈɾoŋ benˈsi.o ‖] [pol baˈljente ǀ saˈβemo tjuɱˈfal ‖] [ˈkuβa ˈliβɾe ‖ poˈemo gɾiˈtal] [del kaˈɲoŋ al teˈjrible etamˈpi.o ‖] [del klaˈɾiŋ ekuˈʃa el soˈni.o ‖] [a la ˈama ǀ baˈljente ǀ koˈjre ‖] ===English translation=== To arms, quickly, ye Bayamesans! As the homeland looks proudly to you; don't fear a glorious death, for to die for the homeland is to live. To live in shackles is to live mired in shame and disgrace, now hear the sound of the bugle; Quickly, ye brave, to arms!''' Fear not the vicious Iberians. They're cowards as is every tyrant. They cannot oppose spirited Cubans. Their empire has forever fallen. Free Cuba! Spain has already died, their power and pride, where did it go? Hear the sound of the bugle. Run, brave ones, to battle! Behold our triumphant troops Behold they that have fallen. As cowards they flee defeated: We triumphed because of our bravery. Free Cuba! we can shout from the cannon's terrible boom. Hear the sound of the bugle, Run, brave ones, to battle!https://www.ars-regendi.com/state/208605 Kuba. Ars Regendi. ==References== Category:1860s songs Category:Cuba Category:North American anthems",
 "title": "La Bayamesa"
}