{
 "id": "762209",
 "text": "George Perry Floyd Jr. (October 14, 1973 - May 25, 2020) was an African American man who was murdered by a white police officer, Derek Chauvin, who knelt on Floyd's neck for almost 8 minutes. Many people were angry about his death, which led to many protests in order to stop violence and racism against black people. == Early life and education == Floyd was born in Fayetteville, North Carolina to George Perry Floyd and Larcenia \"Cissy\" Jones. He had four brothers and sisters. When he was 2, he and his brothers and sisters moved with their mother to Houston, Texas. They lived in public housing in the Third Ward, which is one of Houston's poorest neighborhoods. He was called Perry, which was his middle name. He played basketball and American football throughout high school and college. Floyd went to South Florida Community College for two years on a football scholarship. He then transferred to Texas A&M; University–Kingsville in 1995 before dropping out. Some people called Floyd a \"gentle giant.\" He was tall and weighed . == Later life == Floyd returned to Houston in 1995 and became an automotive customizer and played club basketball. He performed as a rapper from 1994 to 1997 using his stage name Big Floyd in the hip hop group Screwed Up Click. He was on several mixtapes released by DJ Screw, the founder.< Floyd had many jobs. He got into trouble with the law several times. From 1997 to 2005, he went to prison 8 times. Some of the things he went to jail for were drug possession, theft and home invasion. After he left jail, Floyd tried to turn his life around. He mentored other young men as part of a church group so they would not make do the same bad things he did. He also helped his mother out after she had a stroke. In 2014, Floyd moved to Minneapolis to find work. There, he was a bouncer, truck driver, and security guard. In 2020, he lost his job as a security guard because the bar where he worked at shut down due to the COVID-19 pandemic. In April, he got COVID-19 but got better. Floyd had 5 children and 2 grandchildren. His youngest daughter, Gianna, lives in Houston with his former partner. A GoFundMe campaign to help pay for Floyd's funeral costs and benefit his family made the site's record for the most individual donations. == Death == On May 25, 2020, a 44 year old white police officer named Derek Chauvin killed Floyd in Minneapolis by putting him in a chokehold during an arrest on suspicion of forgery when an employee from Cup Foods informed the Minneapolis Police Department that he had used a fake $20 bill to buy cigarettes and that he was believed to be awfully drunk and not in control of himself. Chauvin kneeled on Floyd's neck, which meant that he could not breathe. Witnesses said that Floyd was reported to plead “I can’t breathe” multiple times to the officers. Floyd could not move because he was handcuffed and lying face down. Two other officers named Thomas Lane and James Alexander Keung were on Floyd's back and legs and another officer named Tou Thao stopped others from helping Floyd.For the last three of those minutes, Floyd did not move and had no pulse but officers did not try to revive him. Chauvin kept his knee on Floyd's neck as paramedics attempted to treat him.According to The New York Times, Chauvin had restrained Floyd for eight minutes and forty six seconds. The second autopsy report done by the county said that Floyd's death was a homicide caused by cardiac arrest caused by him being restrained. This autopsy was done after people complained about the first one, which did not say homicide was the cause of his death. His family had an autopsy done by another doctor, which said that Floyd died of asphyxia. However, it was done without samples from his body. Some people nearby filmed the officers hurting Floyd and then put the videos on the Internet. Because of this, people started to protest. Protests began in Minneapolis the day after Floyd died. More protests would be held in all 50 US states and in 400 cities all around the world. == Burial == On June 4, 2020, a memorial service for Floyd took place in Minneapolis with Al Sharpton delivering the eulogy. Services were planned in North Carolina with a public viewing and private service on June 6 and in Houston on June 8 and 9. Floyd is buried next to his mother in Pearland, Texas. == Legacy == A legacy is an impact that someone leaves behind when they die. George Floyd left behind a big legacy because he died due to police violence. In the United States, the police have a history of racism and not treating minority groups right. After Floyd died, there were big efforts to stop racism everywhere in the country, not just against Black people. This led to many murals and places honoring his legacy. === Protests === Many people were sad and angry about George Floyd's death. They think it is proof that racism is still a big problem in the United States. Some people came out to the streets to protests. Many protests were peaceful. Others were violent. === Schools === Some universities created scholarships in George Floyd's name. The CEO of Netflix and his wife made a $120 million donation to several historically black colleges and universities. These schools were created by and for African Americans as they were usually not allowed to attend colleges in the past. === Law === A bill proposed by US Representative Sheila Jackson Lee (a Democrat from Texas), the George Floyd Law Enforcement Trust and Integrity Act, was made to reduce police brutality and establish national policing standards. === 8'46\" === The length of time that Chauvin was believed to have had his knee on Floyd's neck, eight minutes forty-six seconds, was used as a \"moment of silence\" to honor Floyd. === Art === Many artists around the world created murals to honor George Floyd. === Media === George Floyd's death was the cover story for The Economist. It wrote that his legacy was \"the rich promise of social change.\" === Hip Hop === Houston rappers have posted tributes to Floyd and called for justice in what they see as an act of police brutality against an African-American man. “R.I.P. Big Floyd He took his life in broad day may God bring his family justice,” original Screwed Up Click member Lil’ Keke wrote on Instagram. His post asked followers to call Minneapolis District Attorney Michael Freeman and demand charges be pressed against the four officers fired after detaining Floyd for an alleged forgery in progress, one of whom pushed his knee against Floyd’s neck, according to a bystander video. “Say His Name #GeorgeFloyd Rest Easy… The Fight For Us Begins Now,” rapper Trae The Truth, another member of Screwed Up Click, wrote alongside a photo of Floyd. “4 Officers Fired Aint Enough!!!” he added on a subsequent post. Minneapolis residents protested Floyd’s death and the lack of charges for the officers on May 26, and were met with more police force. == Notes == == References == Category:1973 births Category:2020 deaths Category:American burglars Category:Rappers from North Carolina Category:American robbers Category:American thieves Category:Criminals from Texas Category:Deaths from asphyxiation Category:Murdered African-American people Category:American people convicted of drug offenses Category:People from North Carolina Category:Singers from Houston Category:Singers from North Carolina Category:American manslaughter victims",
 "title": "George Floyd"
}