{
 "id": "762453",
 "text": "\"Meda Dau Doka\" (), also known as \"God Bless Fiji\" in English, is the national anthem of Fiji. It was adopted in 1970 when the country got its independence from the United Kingdom. Earlier, in 1911, American gospel writer Charles Austin Miles composed the music for the Christian hymn Dwelling in Beulah Land – the same melody that is being used for this song today. The lyrics (words) were written by Michael Francis Alexander Prescott.http://www.national- anthems.org/anthems/country/FIJI FIJI. National-anthems.org The Fijian version and the English version are not translations of each other, and the English version is used much more commonly. In 2008, it was suggested that this anthem should be sung in Fijian, English and Fiji Hindi – the country's official languages – all in one piece.https://web.archive.org/web/20120322005020/http://www.fijitimes.com/story.aspx?id=97186 Charter proposes common name. Fiji Times. 7 August 2008. Archived 22 March 2012. ==Lyrics== ===Fijian version=== Fijian lyrics (official) IPA transcription Fijian to English translation http://www.nationalanthems.info/fj.htm Fiji. NationalAnthems.info. [meⁿda ⁿdɔu̯ ⁿdoka ka βinakata na βanua] [e ra sa ⁿdɔu̯ tʃiko kina na saβasaβa] [raɰa tu na ŋɔu̯na ni sɔu̯tu na βei̯lomani] [me sa ᵐbi̯u na i toβo taɰa jaŋa] [me ᵐbula ŋa ko βitʃi] [ka me toro ŋa ki li̯u] [me ra turaŋa βinaka ko ira na i li̯uli̯u] [me ra li̯utaki na tamata] [e na βei̯ka βinaka] [me otʃi kina na i toβo ða] [me ⁿda ⁿdɔu̯ ⁿdoka ka βinakata na βanua] [e ra sa ⁿdɔu̯ tʃiko kina na saβasaβa] [rawa tu na ŋɔu̯na ni sɔu̯tu na βei̯lomani] [me sa ᵐbi̯u na i toβo taɰa jaŋa] [ᵐbale ŋa βei̯ kemuni na ðɔu̯raβou̯ e βitʃi] [ni jaβala me saβasaβa na βanua] [ni kakua ni βosota na ⁿdukaⁿdukali] [ka me da sa ᵑɡɛi̯ ᵐbi̯uta βakaⁿdua] Let us show our pride and honour our nation Where righteous people reside Where prosperity and fellowship may persevere Abandon deeds that are immoral Let Fiji live on And progress onwards May our leaders be honourable men Let them lead our people To great things And bring an end to all things immoral Let us show pride and honour our nation Where righteous people reside Where prosperity and fellowship may persevere Abandon deeds that are immoral The burden of change lie on your shoulders youth of Fiji Be the strength to cleanse our nation Be wary and not harbour malice For we must abandon such sentiments forever ===English version=== :This version is much more popular. :Blessing grant oh God of nations on the isles of Fiji :As we stand united under noble banner blue :And we honour and defend the cause of freedom ever :Onward march together :God bless Fiji :Chorus: ::For Fiji, ever Fiji, let our voices ring with pride ::For Fiji, ever Fiji, her name hails far and wide, ::A land of freedom, hope and glory, to endure what ever befalls ::May God bless Fiji ::Forever more! :Blessing grant, oh God of nations, on the isles of Fiji :Shores of golden sand and sunshine, happiness and song :Stand united, we of Fiji, fame and glory ever :Onward march together :God bless Fiji. ===Fiji Hindi version=== :He jagdishwar, kripa karo tum Fiji desh pe apne :Ahle watan hum teri sharan mein, teri dhwaja ke neehe :Ajaadi ki raksha aur samman sada hum karege :Sab milke badhte rahege :Sarwamangal Fiji ::Yeh Fiji, hamara Fiji ::Hum sab mil gaate rahe ::Yeh Fiji Hamara Fiji ::Yeh naara lagate rahe ::Dharti hai apni, azaadi, asha aur garva ki ::Kripa rahe prabhu ki, Fiji par sarwadahttp://www.20ccem.gov.fj/index.php/national-anthem National Anthem. 20th Conference of Commonwealth Education Ministers, 20ccem.gov.fj. Retrieved 24 May 2020. ==References== Category:Fiji Category:Oceanian anthems",
 "title": "God Bless Fiji"
}