{
 "id": "762676",
 "text": "\"I Am a Tuvan\", known in the Tuvan language as Men – Tıva Men (\"Мен – Тыва Мен\"), is the regional anthem of the Republic of Tuva, a federal subject of Russia located in south Siberia. It was composed by Olonbayar Gantomir with words by Bayantsagaan Oohiy. It was adopted officially by the Great Khural of Tuva on 11 August 2011 replacing the previous anthem Tooruktuğ Dolgay Tañdım. ==Lyrics== ===Tuvan original=== Cyrillic script Latin script IPA transcription I Art–arttıñ ovaazınga Dacın salıp çalbargan Tañdı, Sayan ıdıınga Ağın örgeen Tıva men. Kocumaa: Men – Tıva men, Möñge harlığ dağnıñ oğlu men. Men – Tıva men, Möñgün suğluğ çurttuñ tölü men. II Öğbelerim çurtunda Ölçey tarıp icengen, Ötküt höömey ırınga Öörüp talaan Tıva men. Kocumaa III Aymak çonnar bülezi Akı–duñma nayıraldığ, Depşilgece çütküldüğ Demniğ çurttuğ Tıva men. Kocumaa I [a̠ɾt a̠ɾt.tɯ̃ŋ o̞.ʋa̠.zɯ̃ŋ.ga̠] [ta̠.ʒɯ̃n sa̠.ɫɯp t͡ʃa̠ɫ.b̥a̠ɾ.gã̠n] [tʰã̠ŋ.d̥ɯ sa̠.jã̠n ɯ.d̥ɯ̃ːŋ.ga̠] [a̠.ɣɯ̃n ø̞ɾ.ɡ̟ẽ̞ːn tʰɯ.ʋa̠ mẽ̞n ǁ] [ko̞.ʒu.ma̠ː] [mẽ̞n ǀ tʰɯ.ʋa̠ mẽ̞n ǀ] [mø̞̃ŋ̟.ɡ̟e̞ xa̠ɾ.ɫɯx ta̠ɣ.nɯ̃ŋ o̞ɣ.ɫu mẽ̞n ǁ] [mẽ̞n ǀ tʰɯ.ʋa̠ mẽ̞n ǀ] [mø̞̃ŋ̟.ɡ̟ỹn suɣ.ɫux t͡ʃuɾt.tũŋ tʰø̞.ly mẽ̞n ǁ] II [ø̞ɣ.b̥e̞.le̞.ɾĩm t͡ʃuɾ.tũn.d̥a̠] [ø̞l.d͡ʒe̞j tʰa̠.ɾɯp i.ʒẽ̞ŋ.ɡ̟ẽ̞n ǀ] [ø̞t.k̟yt x̟ø̞̃ː.me̞j ɯ.ɾɯ̃ŋ.ga̠] [ø̞ː.ɾyp tʰa̠.ɫã̠ːn tʰɯ.ʋa̠ mẽ̞n ǁ] [ko̞.ʒu.ma̠ː] III [a̠j.ma̠k t͡ʃõ̞n.na̠ɾ py.le̞.zi] [a̠.kɯ tũm.ma̠ na̠.jɯ.ɾa̠ɫ.d̥ɯɣ ǀ] [te̞p.ʃil.ɡ̟e̞.ʒe̞ t͡ʃyt.k̟yl.d̥yɣ] [tẽ̞m.nix̟ t͡ʃuɾt.tux tʰɯ.ʋa̠ mẽ̞n ǁ] [ko̞.ʒu.ma̠ː] ===Poetic translations=== As Tuva is part the Russian Federation, Russian is an official language of the republic. Russian English Одолев перевал священный, Поднялся я, тувинец, Обрел из жизни кочевой лучшую долю я, тувинец. Припев: Я – тувинец, Сын гор с вечными снегами, Я – тувинка, Дочь страны серебряных рек. Мелодией хоомей и хомуса Разбудил эхом скалы я, тувинец, В колыбели младенца качая, Успокоил его плач я, тувинец. Припев С новогодним праздником Шагаа Весну встречаю я, тувинец, В летнюю ночь на играх шептался И нашел судьбу свою я, тувинец. Припевhttp://www.centerasia.ru/issue/2003/33/1708-pesnya-men-tiva-men.-nayti- vsetuvinskoe.html МЕН – ТЫВА МЕН. ГОСУДАРСТВЕННЫЙ ГИМН РЕСПУБЛИКИ ТЫВА. Центр Азии. In thine ovaa pass most holy, A stone I set, to Lord I pray'd. Of Tangdy, Sayan most holy, The white milk I, a Tuvan strew'd. Chorus: I am a Tuvan, The son of eternal, snow-capped peaks. I am a Tuvan, The daughter of the nation's silver creeks. In the land of my forebears, A knot brought together bliss. The sound of khoomei divine, Blessed be my Tuvan line. Chorus Of folks, families we are, As brothers, friends together we thrive. For progress as a whole we strive, A country united of Tuvans we are! ChorusI Am a Tuvan. Lingodude, LyricsTranslate, 2021. ==References== ==Other websites== * Vocal version . Category:National symbols of Russia Category:Russian anthems Category:Russian music Category:Tuva",
 "title": "I Am a Tuvan"
}