{
 "id": "762686",
 "text": "The male reproductive system is made up of a number of sex organs. It works in the process of human reproduction. Some organs are outside the body, some are in the pelvis. The main male sex organs are the penis and the testicles, which produce sperm. During sexual intercourse the penis delivers the sperm into a woman's vagina. The sperm can fertilize the egg cell in the woman's womb. The fertilized egg may develop into a fetus, which is often later born as a baby. The matched system in women is the female reproductive system. ==Sex organs== ===Penis=== The penis is an organ that is used for urination and sexual intercourse. The urethra is a passage that runs underside of the penis. The urine and the semen are released through the urethra. When the male becomes sexually aroused, the penis becomes hard and bigger and ready for sexual intercourse. This erection occurs because the erectile tissue of the penis is filled with blood. ===Scrotum=== The scrotum is a pouch-like structure that hangs behind the penis. It holds and protects the testicles. The function of the scrotum is to keep the testicles less warm than the rest of the body. ===Testicles=== Testicles are small ball-like organs. An adult testicle size is about 4 to 5 cm long. The testicles produce sperm cells from teenage years to old age. The sperm cells are produced in the seminiferous tubules, which are the main part of the testicles. After the sperms are produced, they are stored temporarily in the epididymis. The epididymis is covering the top of the testicle. Testicles are also called the gonads and they are very important in sexual works. Leydig cells in the testicles produce testosterone. Testosterone cause puberty in boys and maintain the male characteristics for adult. If the testicles are removed, male characteristics are decreased. These characteristics include the beard, breaking of voice (deep voice) heavy bones (masculinity), and a constricted pelvis. ===Seminal vesicle=== The seminal vesicles are a pair of tube-like glands or small sac-like gland found behind the bladder. The seminal vesicle produces fluid that aids in keeping sperm alive after they are finally released and stores sperms until they are ejaculated. ===Prostate gland=== The prostate gland is located under the bladder. It produces a thick fluid which aids the protection and transportation of the sperms which are now referred to as the semen. == Infertility in Men - Male Reproductive Disorders == Most causes of infertility in men are a result of male reproductive system disorders. An abnormal penis may not be able to deliver the semen properly. In hypospadias or epispadias where the opening of the penis is in an abnormal position, male infertility is a possibility. === Other factors in male infertility === Varicocele: This is a condition characterized by enlargement, elongation and coiling of the blood vessels around the scrotum. Most times, it appears as bag of warmth in the scrotum. It is seen in 10% of normal males and 40% of males with infertility. Drugs: Impotence in men has been found as side effects of some drugs like nitrofurantoin, antihypertensive drugs particularly the sympatholytic ones, cimetidine, cancer drugs etc. Irradiation like X-ray, GSM etc. triggers release of free radicals and can directly halt the process of sperm formation. This is the reason behind covering the scrotum (Testes) during X-ray. Autoimmune Antibodies: It has been found that some people have antibodies (defense chemicals) against their own sperm cells. By this interaction, the antibodies destroy the sperm cells leading to Azoospermia, oligospermia or normospermia depending on the degree of damage. This condition can be treated if diagnosed. Liver disease: The liver is a vital organ which ensures that the male hormone (testosterone) dominates in action above female hormone, oestrogen. This it does by breaking down the oestrogen continually. However in a case of liver disease which may impair liver functions, the level of female hormone, oestrogen, increases leading to male characteristics, loss of pubic hair and impotence. == Other websites== Category:Biological reproduction",
 "title": "Male reproductive system"
}