{
 "id": "762704",
 "text": "Wolfram Mathematica (usually called Mathematica) is a modern technical computing system made by Wolfram Research.Cheung, C. K., Keough, G. E., Gross, R. H., & Landraitis, C. (2005). Getting started with Mathematica. Wiley.Mangano, S. (2010). Mathematica Cookbook: Building Blocks for Science, Engineering, Finance, Music, and More. \" O'Reilly Media, Inc.\".Gass, R. (1997). Mathematica for scientists and engineers: using Mathematica to do science. Prentice Hall PTR.Shaw, W. T., & Tigg, J. (1993). Applied Mathematica: getting started, getting it done. Addison-Wesley Longman Publishing Co., Inc.. ==Features== Today, Wolfram Mathematica is used for the following purposes: * Computer scienceMaeder, R. E. (2000). Computer Science with MATHEMATICA®: Theory and Practice for Science, Mathematics, and Engineering. Cambridge University Press. * Data scienceWeisstein E. (2014) Computable Data, Mathematics, and Digital Libraries in Mathematica and Wolfram|Alpha. In: Watt S.M., Davenport J.H., Sexton A.P., Sojka P., Urban J. (eds) Intelligent Computer Mathematics. CICM 2014. Lecture Notes in Computer Science, vol 8543. Springer, Cham * Deep learningKerhart, M., & Drchal, J. Mathematica binding for Caffe Deep Learning Framework. * GeometryAbbena, E., Salamon, S., & Gray, A. (2017). Modern differential geometry of curves and surfaces with Mathematica. CRC Press. * Interval arithmeticPopova, E. D., & Ullrich, C. (1996). Directed interval arithmetic in Mathematica: implementation and applications (pp. 1-56). TR 96-3, U. Basel. * Machine learningAwange, J., Paláncz, B., & Völgyesi, L. (2020). Hybrid Imaging and Visualization (Employing Machine Learning with Mathematica - Python). Springer, Cham. * Numerical analysisCotta, R. M., Leonardo, S. D. B., & Mikhailov, M. D. (2001). Applied Numerical Analysis with Mathematica. Editora E-papers. ** Numerical linear algebraDavis, H. T., & Thomson, K. T. (2000). Linear Algebra and Linear Operators in Engineering: With Applications in Mathematica®. Elsevier. ** Numerical methods for ordinary differential equationsBaumann, G. (2013). Symmetry analysis of differential equations with Mathematica®. Springer Science & Business Media.Abell, M. L., & Braselton, J. P. (2016). Differential equations with Mathematica. Academic Press.Gray, A., Mezzino, M., & Pinsky, M. A. (1997). Introduction to ordinary differential equations with Mathematica: an integrated multimedia approach. Springer.Ross, C. C. (2013). Differential equations: an introduction with Mathematica®. Springer Science & Business Media. ** Numerical methods for partial differential equationsKythe, P. K., Schäferkotter, M. R., & Puri, P. (2018). Partial differential equations and Mathematica. CRC Press.Ganzha, V. G. E., & Vorozhtsov, E. V. (1996). Numerical solutions for partial differential equations: problem solving using Mathematica (Vol. 7). CRC Press. * Neural networkFreeman, J. A. (1993). Simulating neural networks with Mathematica. Addison-Wesley Longman Publishing Co., Inc..Suhartono, S. (2012). Integration of Artificial Neural Networks into Genetic L-System Programming Based Plant Modeling Environment with Mathematica. * OptimizationBhatti, M. A. (2012). Practical Optimization Methods: With Mathematica® Applications. Springer Science & Business Media. This system is made with the Wolfram Language (programming language named after Stephen Wolfram). ==Version history== Since 1988, Wolfram Research has released the following versions of Wolfram Mathematica: * 1.0 – June 23, 1988Supercomputer Pictures Solve the Once Insoluble, John Markoff, October 30, 1988. * 1.1 – October 31, 1988 * 1.2 – August 1, 1989Mathematica 1.2 adds new graphics options: upgrade also promises concurrent operations by Elinor Craig, MacWeek, July 25, 1989. * 2.0 – January 15, 1991Mathematica + 283 functions = Mathematica 2.0 by Raines Cohen, MacWeek, January 15, 1991. * 2.1 – June 15, 1992 * 2.2 – June 1, 1993New version of Mathematica, Mechanical Engineering, June 1, 1993. * 3.0 – September 3, 1996 * 4.0 – May 19, 1999Mathematica 4.0 by Charles Seiters, Macworld, October 1, 1999. * 4.1 – November 2, 2000 * 4.2 – November 1, 2002 * 5.0 – June 12, 2003Mathematica 5.0 Adds Up: Exactly 15 years after Mathematica's initial release, Wolfram Research has released Mathematica , PC Magazine, September 3, 2003. * 5.1 – October 25, 2004Mathematica 5.1's Web Services Add Up; Mathematica 5.1 delivers improvements over Version 5.0 that are vastly out of proportion for a .1 upgrade. by Peter Coffee, eWeek, December 6, 2004. * 5.2 – June 20, 2005Mathematica hits 64-bit, MacWorld UK, July 13, 2005. * 6.0 – May 1, 2007Today, Mathematica is reinvented – Blog by Stephen WolframMathematica 6: Felix Grant finds that version 6 of Wolfram Research's symbolic mathematical software really does live up to its expectations. Scientific Computing, 2007. * 7.0 – November 18, 2008Mathematica 7.0 Released Today! – Blog by Stephen Wolfram * 8.0 – November 15, 2010 * 9.0 – November 28, 2012 * 10.0 – July 9, 2014 * 10.1 – March 30, 2015 * 10.2 – July 14, 2015 * 10.3 – October 15, 2015 * 10.4 – March 2, 2016 * 11.0.0 – August 8, 2016 * 11.0.1 – September 28, 2016 * 11.1 – March 16, 2017 * 11.1.1 – April 25, 2017 * 11.2 – September 14, 2017 * 11.3 – March 8, 2018 * 12.0 – April 16, 2019 * 12.1 - March 18, 2020 ==References== ==Other websites== * *Mathematica Documentation Center *Wolfram Open Cloud limited free access to Mathematica via a web browser *Image identification website powered by Mathematica *Wolfram Demonstrations Project Mathematica based demonstrations *A little bit of Mathematica history documenting the growth of code base and number of functions over time *Wolfram Screencast & Video Gallery: Hands-on Start to Mathematica Category:Mathematics Category:Technology Category:Computer science Category:Software Category:Microsoft Windows software Category:Linux software",
 "title": "Wolfram Mathematica"
}