{
 "id": "763121",
 "text": "This is a list of the live-action reimaginings saga produced by Walt Disney Pictures of its animated films. This list does not include remakes of live- action/animation hybrid films (such as Mary Poppins or Pete's Dragon), animated movies or live-action movies that were produced by another studio and later reimagined into live-action films by Disney (such as The Wizard of Oz and The Nutcracker and the Four Realms), live-action films another studio made based on the same story as a Disney feature that were later acquired (such as Fox’s Ever After or Pathé‘s The Wind in the Willows/Mr. Toad’s Wild Ride), the direct to video release The Jungle Book: Mowgli’s Story, or based on animated television shows (such as Kim Possible). ==Films== ===Released=== Film Original animated film Release date Director(s) Screenwriter(s) Producer(s) Format Rudyard Kipling's The Jungle Book The Jungle Book (1967) December 25, 1994 Stephen Sommers Stephen Sommers, Ronald Yanover and Mark Geldman Edward S. Feldman and Raju Patel Theatrical 101 Dalmatians One Hundred and One Dalmatians (1961) November 27, 1996 Stephen Herek John Hughes John Hughes and Ricardo Mestres 102 Dalmatians One Hundred and One Dalmatians (1961) November 22, 2000 Kevin Lima Kristen Buckley, Brian Regan, Bob Tzudiker and Noni White Edward S. Feldman Alice in Wonderland Alice in Wonderland (1951) March 5, 2010 Tim Burton Linda Woolverton Richard D. Zanuck, Joe Roth, Suzanne Todd and Jennifer Todd Maleficent Sleeping Beauty (1959) May 30, 2014 Robert Stromberg Joe Roth Cinderella Cinderella (1950) March 13, 2015 Kenneth Branagh Chris Weitz Simon Kinberg, Allison Shearmur and David Barron Claude Brodesser-Akner, \"Disney Negotiating With Kenneth Branagh to Direct Cinderella\", Vulture.com, January 31, 2013. The Jungle Book The Jungle Book (1967) April 15, 2016 Jon Favreau Justin Marks Jon Favreau and Brigham Taylor Alice Through the Looking Glass Alice in Wonderland (1951) May 27, 2016 James Bobin Linda Woolverton Joe Roth, Suzanne Todd, Jennifer Todd and Tim Burton Beauty and the Beast Beauty and the Beast (1991) March 17, 2017 Bill Condon Stephen Chbosky and Evan Spiliotopoulos David Hoberman and Todd Lieberman Christopher Robin Winnie the Pooh films August 3, 2018 Marc Forster Alex Ross Perry, Tom McCarthy, Allison Schroeder, Greg Brooker and Mark Steven Johnson Brigham Taylor and Kristin Burr Dumbo Dumbo (1941) March 29, 2019 Tim Burton Ehren Kruger Justin Springer, Ehren Kruger, Derek Frey and Katterli Frauenfelder Aladdin Aladdin (1992) May 24, 2019 Guy Ritchie John August and Guy Ritchie Dan Lin and Jonathan Elrich The Lion King The Lion King (1994) July 19, 2019 Jon Favreau Jeff Nathanson Jon Favreau, Karen Gilchrist and Jeffrey Silver Maleficent: Mistress of Evil Sleeping Beauty (1959) October 18, 2019 Joachim Rønning Linda Woolverton, Noah Harpster and Micah Fitzerman-Blue Joe Roth, Angelina Jolie and Duncan Henderson Lady and the Tramp Lady and the Tramp (1955) November 12, 2019 Charlie Bean Andrew Bujalski and Kari Granlund Brigham Taylor Disney+ ===Upcoming=== Film Original animated film Release date Director(s) Screenwriter(rs) Producer(s) Format Status Mulan Mulan (1998) July 24, 2020 Niki Caro Elizabeth Martin, Lauren Hynek, Rick Jaffa and Amanda Silver Chris Bender, Tendo Nagenda, Jason T. Reed and Jake Weiner Theatrical Completed Cruella One Hundred and One Dalmatians (1961) May 28, 2021 Craig Gillespie Aline Brosh McKenna, Jez Butterworth, Dana Fox, Kelly Marcel, Tony McNamara and Steve Zissis Kristin Burr, Andrew Gunn and Marc Platt Post-production Peter Pan & Wendy Peter Pan (1953) TBA David Lowery David Lowery and Toby Halbrooks Joe Roth and Jim Whitaker Pre-production Disney’s Live-Action ‘Peter Pan’ Re-Titled ‘Peter Pan & Wendy’ Production Begins This SpringDisney’s Live-Action ‘Peter Pan’ Movie Finds Its Wendy and Peter (EXCLUSIVE) The Little Mermaid The Little Mermaid (1989) Rob Marshall Jane Goldman and David Magee Rob Marshall, John DeLuca, Lin-Manuel Miranda and Marc Platt Untitled The Jungle Book sequel The Jungle Book (1967) Jon Favreau Justin Marks Jon Favreau and Brigham Taylor Snow White and the Seven Dwarfs Snow White and the Seven Dwarfs (1937) Marc Webb Erin Cressida Wilson Marc Platt Pinocchio Pinocchio (1940) Robert Zemeckis Chris Weitz and Robert Zemeckis Chris Weitz and Andrew Milano In development The Sword in the Stone The Sword in the Stone (1963) Juan Carlos Fresnadillo Bryan Cogman Brigham Taylor Disney+ Robin Hood Robin Hood (1973) Carlos López Estrada Kari Granlund Justin Springer Untitled Aladdin spin-off Aladdin (1992) TBA Jordan Dunn and Michael Kvamme Dan Lin and Jonathan Eirich Lilo & Stitch Lilo & Stitch (2002) Mike Van Waes Untitled Aladdin sequel Aladdin (1992) John Gatins and Andrea Berloff Theatrical The Hunchback of Notre Dame The Hunchback of Notre Dame (1996) David Henry Hwang David Hoberman, Todd Lieberman and Josh Gad Rose Red Snow White and the Seven Dwarfs (1937) Justin Merz, Evan Daugherty and Kristin Gore Tripp Vinson Bambi Bambi (1942) Geneva Robertson-Dworet and Lindsey Beer Chris Weitz, Paul Weitz and Andrew Miano Hercules Hercules (1997) David Callaham Anthony and Joe Russo, Jeffery Silver and Karen Gilchrist == Possible projects == A live-action film about Tinker Bell with Victoria Strouse writing the script and Reese Witherspoon playing Tinker Bell, is in the works. It was also reported that a live-action spin-off of Prince Charming titled Charming is in development with Stephen Chbosky writing and directing. A prequel of Aladdin titled Genies, written by Damian Shannon and Mark Swift and produced by Tripp Vinson, was announced in 2015. ==Reception== ===Box office performance=== Film U.S. release date Box office gross All-time ranking Budget U.S. and Canada Other territories Worldwide U.S. and Canada Worldwide The Jungle Book December 25, 1994 $43,229,904 1,950 $30 million 101 Dalmatians November 27, 1996 $136,189,294 $184,500,000 $320,689,294 428 422 $75 million 102 Dalmatians November 22, 2000 $66,957,026 $116,654,745 $183,611,771 1,186 $85 million Alice in Wonderland March 5, 2010 $334,191,110 $691,276,000 $1,025,467,110 62 40 $200 million Maleficent May 30, 2014 $241,410,378 $517,129,407 $758,539,785 138 93 $180 million Cinderella March 13, 2015 $201,151,353 $342,363,000 $543,514,353 201 179 $95 million The Jungle Book April 15, 2016 $364,001,123 $602,549,477 $966,550,600 48 43 $175 million Alice Through the Looking Glass May 27, 2016 $77,041,381 $222,415,643 $299,457,024 1,011 470 $170 million Beauty and the Beast March 17, 2017 $504,014,165 $759,506,961 $1,263,521,126 14 16 $160 million Christopher Robin August 3, 2018 $99,215,042 $98,529,335 $197,744,377 746 $75 million Dumbo March 29, 2019 $114,766,307 $238,518,314 $353,284,621 592 371 $170 million Aladdin May 24, 2019 $355,559,216 $695,134,737 $1,050,693,953 51 34 $183 million The Lion King July 19, 2019 $543,638,043 $1,113,305,351 $1,656,943,394 11 7 $260 million Maleficent: Mistress of Evil October 18, 2019 $113,842,524 $377,800,485 $491,730,089 605 220 $185 million Total $ $ $ $ ==Reception== ===Box office performance=== Film U.S. release date Box office gross All-time ranking Budget U.S. and Canada Other territories Worldwide U.S. and Canada Worldwide The Jungle Book December 25, 1994 $43,229,904 1,950 $30 million 101 Dalmatians November 27, 1996 $136,189,294 $184,500,000 $320,689,294 428 422 $75 million 102 Dalmatians November 22, 2000 $66,957,026 $116,654,745 $183,611,771 1,186 $85 million Alice in Wonderland March 5, 2010 $334,191,110 $691,276,000 $1,025,467,110 62 40 $200 million Maleficent May 30, 2014 $241,410,378 $517,129,407 $758,539,785 138 93 $180 million Cinderella March 13, 2015 $201,151,353 $342,363,000 $543,514,353 201 179 $95 million The Jungle Book April 15, 2016 $364,001,123 $602,549,477 $966,550,600 48 43 $175 million Alice Through the Looking Glass May 27, 2016 $77,041,381 $222,415,643 $299,457,024 1,011 470 $170 million Beauty and the Beast March 17, 2017 $504,014,165 $759,506,961 $1,263,521,126 14 16 $160 million Christopher Robin August 3, 2018 $99,215,042 $98,529,335 $197,744,377 746 $75 million Dumbo March 29, 2019 $114,766,307 $238,518,314 $353,284,621 592 371 $170 million Aladdin May 24, 2019 $355,559,216 $695,134,737 $1,050,693,953 51 34 $183 million The Lion King July 19, 2019 $543,638,043 $1,113,305,351 $1,656,943,394 11 7 $260 million Maleficent: Mistress of Evil October 18, 2019 $113,842,524 $377,800,485 $491,730,089 605 220 $185 million Total $ $ $ $ ===Critical and public response=== Film Rotten Tomatoes Metacritic CinemaScore The Jungle Book (1994) 79% 63 A– 101 Dalmatians 42% 49 A 102 Dalmatians 31% 35 B+ Alice in Wonderland 51% 53 A– Maleficent 54% 56 A Cinderella 84% 67 A The Jungle Book (2016) 94% 77 A Alice Through the Looking Glass 29% 34 A– Beauty and the Beast 71% 65 A Christopher Robin 73% 60 A Dumbo 47% 51 A– Aladdin 57% 53 A The Lion King 53% 55 A Maleficent: Mistress of Evil 40% 43 A Lady and the Tramp 67% 48 ==Notes== == References == Category:Disney- related lists",
 "title": "List of Disney live-action remakes of animated movies"
}