{
 "id": "763269",
 "text": "Robert Louis Behnken (; born July 28, 1970) is a NASA astronaut, engineer, and former Chief of the Astronaut Office. Behnken was selected as an astronaut by NASA in 2000 and is a veteran of two space shuttle flights. A native of Missouri, Behnken flew STS-123 in March 2008 and STS-130 in February 2010, logging more than 708 hours in space, and more than 37 hours during six spacewalks. Behnken most recently served as Joint Operations Commander on the first crewed flight of the SpaceX Crew Dragon, the Demo-2 mission, which landed August 2, 2020. He also served as Flight Engineer on the International Space Station for Expedition 63. == Personal Life == Behnken was born in St. Ann, Missouri on July 28, 1970. After graduating from Pattonville High School in Maryland Heights, Missouri, he attended Washington University in St. Louis where he majored in mechanical engineering and physics and was a member of the Air Force Reserve Officers' Training Corps. He then went to California Institute of Technology (Caltech) in Pasadena, California for graduate school, where he earned master's and doctorate degrees in mechanical engineering. After graduate school, Behnken was commissioned for active duty with the Air Force and was based at Eglin Air Force Base in Florida where he worked as a developmental engineer and technical manager for new weapons systems. Next, Behnken went to the Air Force Test Pilot School at Edwards Air Force Base. He was assigned to the F-22 Combined Test Force and served as the lead flight test engineer for the fourth F-22, a stealth tactical fighter aircraft that flies at speeds of up to 1,500 mph (2,414 kilometers per hour). Behnken has flown more than 1,500 flight hours and piloted more than 25 different types of aircraft. He is married to fellow astronaut K. Megan McArthur. Together, they have one child. == NASA Career == Colonel Behnken was selected by NASA in July 2000, and following the completion of astronaut candidate training was assigned to support launch and landing activities at the Kennedy Space Center, Florida. Since then, within the Astronaut Office, he served in the Exploration branch, as Chief of the Space Station Operations Branch, and between July 2012 and July 2015 as NASA’s Chief Astronaut. As Chief Astronaut, he was responsible for flight assignments, mission preparation, and on-orbit support of international space station crews as well as organizing astronaut office support for future launch vehicles. Colonel Behnken trained as an international space station crew member following the loss of Columbia and as a mission specialist for STS-400 the launch-on-need rescue flight for the last Hubble servicing mission. He flew STS-123 in March 2008 and STS-130 in February 2010, logging more than 708 hours in space, and performing more than 37 hours in six spacewalks. Colonel Behnken is currently assigned to the cadre of astronauts that will train and fly the initial test flights of the Boeing CST-100 or Space X Dragon commercially built spacecraft. STS-123 Endeavour (March 11 to March 26, 2008) was a night launch/landing and the 25th International Space Station assembly mission. Endeavour’s crew delivered the first component of the Japan Aerospace Exploration Agency (JAXA) Kibo Laboratory and the final element of the station’s Mobile Servicing System, the Canadian-built Special Purpose Dexterous Manipulator, known as Dextre. Colonel Behnken served a flight deck Mission Specialist for ascent and entry, performed three spacewalks, and operated both the station robotic arm and the Dextre robot. The mission was accomplished in 250 orbits of the Earth, traveling 6,577,857 statute miles in 15 days, 18 hours, 10 minutes and 54 seconds. STS-130 Endeavour (February 8 to February 21, 2010) was a night launch/landing and the 32nd International Space Station assembly mission. Endeavour’s crew delivered and outfitted Node 3 (the station’s habitation module) and the Cupola (the station’s seven window Earth facing observation portal). Colonel Behnken served as a Mission Specialist, operated the space station robotic arm, served as the spacewalking lead and performed three spacewalks. The mission was accomplished in 217 orbits of the Earth, traveling 5,738,991 statute miles in 13 days, 18 hours, 6 minutes and 24 seconds. Behnken served as Joint Operations Commander on the first crewed flight of the SpaceX Crew Dragon, the Demo-2 mission, launching May 20 and landing in Pensacola, Florida on August 2, 2020. He also served as Flight Engineer on the International Space Station for Expedition 63. Behnken contributed to more than 110 hours of time to supporting the orbiting laboratory’s investigations. He participated in a number of scientific experiments, spacewalks and public engagement events during his 62 days aboard station. Behnken helped work on numerous sample switch outs for the Electrolysis Measurement (EM) experiment, as well as contributing images to the Crew Earth Observations (CEO) study. While on board, Behnken conducted four spacewalks and is now tied for most spacewalks by an American astronaut with Michael Lopez-Alegria, Peggy Whitson, and Chris Cassidy, each of whom has completed 10 spacewalks. == Awards/Honors == Outstanding Mechanical Engineering Senior, Washington University (1992); National Science Foundation Graduate Research Fellow (1993 to 1996); United States Air Force Meritorious Service, Defense Meritorious Service and Defense Superior Service Medals; NASA Space Flight Medal (2008, 2010); NASA Exceptional Service Medal (2011), Washington University Young Alumni Achievement Award (2009); Distinguished Alumni Award (2013). ==References== Category:1970 births Category:Living people Category:American astronauts Category:Engineers from Missouri Category:Scientists from St. Louis, Missouri",
 "title": "Bob Behnken"
}