{
 "id": "76389",
 "text": "The Carpathian Mountains(Romanian: Munţii Carpaţi; Polish, Czech, and Slovak: Karpaty; Ukrainian: Карпати (Karpaty); German: Karpaten; Serbian: Karpati / Карпати; Hungarian: Kárpátok) are the eastern wing of the great Central Mountain System of Central Europe, curving 1500 km (~900 miles) along the borders of Romania, the Czech Republic, Slovakia, Poland, Ukraine, Austria, Serbia, and northern Hungary. == Geography == The Carpathians begin on the Danube near Bratislava. They surround Transcarpathia and Transylvania in a large semicircle, sweeping towards the south-west, and end on the Danube near Orşova, in Romania. The total length of the Carpathians is over 1,500 km, and the mountain chain's width varies between 12 and 500 km. The Carpathians are separated from the Alps by the Danube. == Divisions == === Horizontal division === * Outer Carpathians, containing the Outer Western Carpathians and Outer Eastern Carpathians, usually including the corresponding Outer Carpathian Depressions * Inner Carpathians, containing the Inner Western Carpathians, Inner Eastern Carpathians, and all the remaining Carpathians A major part of the western and northeastern Outer Carpathians in Poland, Ukraine and Slovakia is traditionally called Beskids. === Vertical and general division === What follows is a practical outline of the Carpathian subdivisions (clockwise from the west, numbers refer to the map): * Western Carpathians: ** 1 Outer Western Carpathians: *** Austrian - South-Moravian Carpathians *** Central Moravian Carpathians *** Slovak-Moravian Carpathians *** West-Beskidian Piedmont *** Western Beskids *** Central Beskids *** Eastern Beskids *** Podhale-Magura Area ** 2 Inner Western Carpathians: *** Slovenské rudohorie (Slovak Ore Mountains) *** Fatra-Tatra Area *** Slovenské stredohorie *** Lučensko-košická zníženina *** Mátra-Slanec Area/Northern Medium Mountains * South Eastern Carpathians (= Eastern Carpathians in a wider sense): ** Eastern Carpathians: *** 3 Outer Eastern Carpathians: *** 4 Inner Eastern Carpathians: ** 5 Southern Carpathians (also known as Transylvanian Alps): *** Făgăraş Mountains group *** [arâng Mountains group *** Retezat-Godeanu Mountains group ** 6 Romanian Western Carpathians: *** Apuseni Mountains *** Poiana Ruscă Mountains (sometimes considered part of the Southern Carpathians) *** Banat Mountains (sometimes considered part of the Southern Carpathians) ** 7 Transylvanian Plateau (sometimes not considered part of the Carpathians at all): *** Transylvanian Plateau *** Mureş-Turda Depression *** Făgăraş Depression *** Sibiu Depression ** 8 Serbian Carpathians (sometimes considered part of the Southern Carpathians, or not considered part of the Carpathians at all) * Outer Carpathian Depressions (they surround the Carpathians and are normally considered part of the corresponding adjacent above main groups) == Notes == *",
 "title": "Carpathian Mountains"
}