{
 "id": "763918",
 "text": "Kaitlin Howarth (born 4 June 2000) is a New Zealand water polo player. She competed for the New Zealand women's national water polo team in the 2019 World Aquatics Championships. She played for Rangitoto College, Murrays Bay Intermediate, North Harbour Water Polo Club, Fresno State University, and Wasserfreunde Spandau 04. == Early life == Born on the North Shore of Auckland, New Zealand and played water polo for the first time aged 11, in the under-12 division for Murrays Bay Intermediate. Kaitlin represents North Harbour Water Polo Club in the New Zealand National competition. She joined the senior women's team in 2017, who have won 9 national titles since 2003, most recently in 2024. == International career == === 2017 World Aquatics Junior Championships === Kaitlin represented New Zealand at the 2017 World Aquatics Junior Championships in Volos, Greece. The team came 11th after they beat the Serbian Junior team (11-4) in the final playoffs. === 2018 World Aquatics Youth Championships === She was part of the New Zealand team at the 2018 World Aquatics Championships, held in Belgrade, Serbia. New Zealand placed 9th at this tournament, after beating Canada (9-5) in the playoffs. === 2019 World League Intercontinental Cup === In Perth, Australia, the New Zealand women's team, including Kaitlin, came 7th after beating South Africa in the playoffs (11-8). === 2019 World Aquatics Championships === Kaitlin also played in the New Zealand team at the 2019 World Aquatics Championships. In Gwangju, South Korea, the New Zealand team came 12th after they lost to China in the playoffs (14-12). === 2022 World League Super Final === Kaitlin played for the New Zealand women's team in the World League Super Final in Tenerife, Spain. They came 8th, losing to Canada (13-6). === 2023 World Aquatics Division II World Cup and Super Finals === The New Zealand women's team, including Kaitlin, travelled to Berlin to compete in the Division II World Cup. The team placed 1st in Pool Group B, qualifying for the subsequent World Aquatics Super Finals. The Super Finals were held in Long Beach, Calif., USA. The New Zealand team placed 8th, losing to Israel, the other qualifier from the Division II World Cup (12-11). === 2023 World Aquatics Championships === Kaitlin formed part of the New Zealand team that travelled to Fukuoka, Japan to play in the World Aquatics Championships. They placed 11th, beating South Africa (25-6), === 2024 World Aquatics Championships === Kaitlin travelled to Doha, Qatar with the New Zealand women's team in 2024. They placed 9th after beating China (16-15), and narrowly missing out an Olympic qualification spot. == Fresno State University == Kaitlin joined the Fresno State University women's waterpolo team in 2019. She studied kinesiology - exercise science between 2019 - 2023, and completed a certificate in educational technology in 2024. She specialised in the centre back position for the team. === Freshman year (2019) === As a freshman, she played in all 15 games for the Bulldogs that season. She scored 11 goals and made 7 assists throughout the season. The season was cut short due to the COVID-19 pandemic. === Redshirt freshman year (2020) === The following year, Kaitlin appeared in all 19 games for the Bulldogs. She scored 23 goals and made 8 assists for a total of 31 points. Defensively, she swiped 5 steals and made 3 field blocks. This year, the Bulldogs won the Golden Coast Conference for the first time and Kaitlin was named to the GCC All-Freshman First Team. === Sophomore year (2021) === Kaitlin played 8 games for the Bulldogs this season before suffering an injury that ruled her out of game time for the rest of the season. She continued to train alongside the team and the Bulldogs won the GCC for the second year in a row. === Junior year (2022) === After bouncing back from an injury in her sophomore year, Kaitlin resumed her key role in the Fresno roster, appearing in all 27 games that the Bulldogs played this season. She scored 22 goals and had a streak of 7 games where she scored at least one goal in all of them. To this total she added 12 assists and had 26 steals, showcasing her defensive brilliance. She was selected to the GCC All-Academic Team, as she helped the Bulldogs to win their third straight GCC title. === Senior year (2023) === Kaitlin split her time between Fresno State and competing for the New Zealand national women's team this year. In her time with the Bulldogs, she played in 23 games, scoring 18 goals, including three goals in the GCC Championship final against Loyola Marymont University. This game went to overtime, eventually won by Fresno State (13-12) after Kaitlin scored the game-winning goal. She was again selected to the GCC All-Academic team and the CSC Academic All-District team. == References == ==Other websites == * new-zealand-into- top-twelve * Hall-of-Fame sporty.co.nz Category:2002 births Category:Living people Category:New Zealand water polo players",
 "title": "Kaitlin Howarth"
}