{
 "id": "763987",
 "text": "Scoob! is a 2020 American computer-animated comedy Halloween mystery movie produced by Warner Animation Group. It is based on the Scooby-Doo franchise. The movie is directed by Tony Cervone. It stars the voices of Frank Welker, Will Forte, Gina Rodriguez, Zac Efron, and Amanda Seyfried as the Mystery Gang with Mark Wahlberg, Jason Isaacs, Kiersey Clemons, Ken Jeong and Tracy Morgan as other Hanna-Barbera animated characters. The movie is about the Mystery Gang and Blue Falcon trying to stop Dick Dastardly from opening the Underworld and releasing Cerberus. Scoob! was released digitally via video on demand on May 15, 2020. It was initially set to play in theaters, but the theatrical release was canceled in response to the COVID-19 pandemic. It recieved mixed reviews from critics. In June 2021, Cervone said that a follow-up to the movie was in development. On December 22, 2021, HBO Max released a sizzle reel featuring a first look at a Christmas sequel movie, titled Scoob! Holiday Haunt, which was set to be released on the service in December 2022. The movie takes place after the events of the first movie, with Welker and the adult actors from the previous movie reprising their roles while Cervone returned to write the movie with Paul Dini as well to produce the project. The movie was co-directed by Bill Haller and Michael Kurinsky and had a production budget of $40 million. On August 2, 2022, Warner Bros. Discovery (WBD) canceled its release, citing cost-cutting measures and a refocus on theatrical movies rather than creating projects for streaming. Tony Cervone would go on to say on the same day that the project was \"practically finished\". Later that month, it was reported that the movie would still be finished, even though Warner Bros. Discovery had no plans to release it. The movie was finally finished on November 4, 2022. ==Voice cast== * Will Forte as Shaggy Rogers * Mark Wahlberg as Blue Falcon * Jason Isaacs as Dick Dastardly * Gina Rodriguez as Velma Dinkley * Zac Efron as Fred Jones * Amanda Seyfried as Daphne Blake * Kiersey Clemons as Dee Dee Skyes * Ken Jeong as Dynomutt * Tracy Morgan as Captain Caveman * Frank Welker as Scooby-Doo == Heroes == This is an important list about the heroes who appear in the movie. * Shaggy Rogers * Scooby-Doo * Fred Jones * Daphne Blake * Velma Dinkley * Brian Crown/Blue Falcon * Dynomutt * Dee Dee Skyes * Captain Caveman * Dusty == Villains == This is an important list about the villains who appear in the movie. * Dick Dastardly * Muttley * Mr. Rigby * Cerberus * Rotten Robots (reformed) == Unmasked Villains == This is a list about the villains who were unmasked in the movie. * Simon Cowell * Officer Jaffe * Ghost Category:2020 comedy movies Category:2020 computer- animated movies Category:2020s mystery movies Category:American computer- animated movies Category:American mystery movies Category:American comedy movies Category:Halloween movies Category:Reboot animated movies Category:Scooby-Doo movies Category:Warner Animation Group movies Category:Warner Bros. Animation movies Category:Warner Bros. movies",
 "title": "Scoob!"
}