{
 "id": "763928",
 "text": "Cadbury is a British chocolate company. Since 2010 it has been owned by Mondelez International (originally Kraft Foods). John Cadbury was a Quaker who sold tea, coffee and drinking chocolate. He opened a grocers shop in 1824. Cadbury developed the business with his brother Benjamin, followed by his sons Richard and George. It quickly became the biggest chocolate maker in the world. George developed the Bournville estate, a model village designed to give the company's workers improved living conditions. Dairy Milk chocolate, introduced by George Jr in 1905, used more milk in the recipe than rival products. By 1914, it was the company's best-selling product. Successive members of the Cadbury family have invented new chocolate products. Cadbury, Rowntree's and Fry's were the big three British confectionery manufacturers in the 19th and 20th centuries.Richardson, Tim (2002). \"Sweets: A History of Temptation\". p. 255. Bantam Press. Cadbury was granted its first royal warrant from Queen Victoria in 1854. It held a royal warrant from Elizabeth II from 1955 to 2022. Cadbury merged with J. S. Fry & Sons in 1919. They merged with Schweppes in 1969. It was known as Cadbury Schweppes until 2008, when the American beverage business was split as Dr Pepper Snapple Group. The rights ownership of the Schweppes brand had already been different in various countries since 2006. In 1992, Sir Adrian Cadbury, chairman of the company for 24 years, produced the Cadbury Report, a code of best practice which served as a basis for reform of corporate governance around the world. Cadbury was in the FTSE 100 on the London Stock Exchange from when it started in 1984 until the company was bought by Kraft Foods Inc. in 2010. ==References== == Other websites == * Cadbury official website Category:1820s establishments in England Category:1824 establishments in the United Kingdom Category:Food companies of the United Kingdom Category:London Borough of Hillingdon",
 "title": "Cadbury"
}