{
 "id": "76418",
 "text": "Leslie Townes Hope http://news.bbc.co.uk/1/hi/world/americas/95813.stm Hope's knighthood was honorary, so he was not entitled to style himself \"Sir\". (May 29, 1903 – July 27, 2003), better known as Bob Hope, was a British-American comedian, vaudevillian, actor, singer, and dancer. He was the only person who received five honorary Oscars. == Early life == Bob Hope was born on May 29, 1903, in London, England to a Welsh mother and English father. In 1908, the Hopes migrated to Cleveland, Ohio. In 1920, at age 17, Hope became a U.S. citizen. == Career == Before he was an actor, Hope became a professional boxer. In this time he was called \"Packey East\". Years later, he was popular because of some musicals he played in. He was also part of some television and radio shows. At the same time, Bob Hope became a comedian. Hope visited the United States armed forces between 1941 and 1991 during the conflicts in that time period. These shows made Hope a household name and well liked by most Americans. Hope also entertained eleven U.S. Presidents. In 1934, Bob Hope married Dolores DeFina (May 27, 1909 - September 19, 2011). The couple adopted four children: Eleanora, Anthony, Linda, and Kelly. == Awards == Bob Hope was honoured with more than 1500 awards. Among them are five special Oscars in 1941, 1945, 1953, 1960, and 1966. Between 1940 and 1978 he hosted the Academy Awards record seventeen times. And in 1998 he was appointed an honorary Knight Commander of the Most Excellent Order of the British Empire (KBE) by Queen Elizabeth II. Upon accepting the appointment, Hope quipped, \"I'm speechless. 70 years of ad lib material and I'm speechless.\" == Death == Bob Hope died of pneumonia on July 27, 2003, 2 months after his 100th birthday. He was buried 3 days later, reburied on July 22, 2005 in custom made grave in California.Seeing Stars == References == == Other websites == *An obituary on BBC * Category:Academy Award Honorary Award winners Category:Actors from Cleveland Category:Actors from London Category:American centenarians Category:20th-century American comedians Category:20th-century American actors Category:American movie actors Category:American television actors Category:Comedians from London Category:Comedians from Cleveland Category:Deaths from pneumonia Category:Infectious disease deaths in the United States Category:Kennedy Center honorees Category:Centenarians Category:Naturalized citizens of the United States Category:Congressional Gold Medal recipients Category:Screen Actors Guild Award winners Category:1903 births Category:2003 deaths Category:Honorary Knights Commander of the Order of the British Empire",
 "title": "Bob Hope"
}