{
 "id": "76417",
 "text": "The Bodhi Tree was a large and very old sacred fig tree (Ficus religiosa), which grew at the Mahabodhi Temple at Bodh Gaya. Siddhartha Gautama, the spiritual teacher and founder of Buddhism, later known as Gautama Buddha, achieved Bodhi (spiritual enlightenment) while sitting under this tree. The Bodhi tree is easily recognised because of its heart-shaped leaves. The word \"Bodhi tree\" is also applied to some existing trees, particularly the Sacred Fig growing at the Mahabodhi Temple, which is probably a direct descendant of the original tree. This tree is a frequent place for pilgrims to visit, being the most important of the four holy sites for Buddhists. ==Historical events== The Bodhi tree at the Mahabodhi Temple is called the Sri MahaBodhi. According to Buddhism, after his Enlightenment, Buddha spent a whole week in front of the tree, standing with unblinking eyes, gazing at it with gratitude. A shrine was later built where he had stood. The spot was used as a shrine even in the lifetime of Buddha, the only shrine that could be so used. King Asoka held a festival every year in its honor in the month of Kattika. His queen, Tissarakkhā, was jealous of the Tree, and three years after she became queen (i.e., in the nineteenth year of Asoka's reign), she caused the tree to be killed by means of mandu thorns. The tree, however, grew again, and a great monastery was attached to the Bodhimanda called the Bodhimanda Vihara. Among those present at the foundation of the Mahā Thūpa are mentioned thirty thousand monks from the Bodhimanda Vihara, led by Cittagutta. ===To Anuradhapura, Sri Lanka=== Some part of the Bodhi Tree was sent to Sri Lanka by Ashoka. It was planted in 288 BC, making it the oldest verified specimen of any plant. In this year (the twelfth year of King Asoka's reign) the right branch of the Bodhi tree was brought by Sanghamittā to Anurādhapura and placed by Devānāmpiyatissa in the Mahāmeghavana. Buddha, on his death bed, had resolved \"Mahavamsa\" From Gayā, the branch was taken to Pātaliputta, then to Tāmalittī, where it was placed in a ship and taken to Jambukola, across the sea; finally it arrived at Anuradhapura, staying on the way at Tivakka. ===The trees of other Buddhas=== According to the Ceylon Chronicles (e.g., Mhv.xv), branches from the Bodhi trees of all the Buddhas born during this kalpa were planted in Ceylon on the spot where the sacred Bodhi tree stands today in Anurādhapura. The branch of Kakusandha's tree was brought by a nun called Rucānandā, Konagamana's by Kantakānandā (or Kanakadattā), and Kassapa's by Sudhammā. === Mahabodhi trees of other Buddhas === Following is a list of the various Mahabodhi trees. Buddha (Pāli name) Bodhirukka (tree of enlightenment; Pāli name) binomial name 1 Taṇhaṅkara rukkaththana 2 Medhaṅkara kaela 3 Saraṇaṅkara pulila 4 Dīpaṃkara pipphali Ficus obtusifolia 5 Koṇḍañña salakalyanīka Oroxylum indicum 6 Maṅgala nāga Mesua ferrea 7 Sumana nāga Mesua ferrea 8 Revata nāga Mesua ferrea 9 Sobhita nāga Mesua ferrea 10 Anomadassi ajjuna Terminalia arjuna 11 Paduma mahāsona Oroxylum indicum 12 Nārada mahāsona Oroxylum indicum 13 Padumuttara salala Pinus roxburghii 14 Sumedha mahanīpa Neolamarckia cadamba 15 Sujāta mahavelu Bambusa bambos 16 Piyadassi kakudha Crateva religiosa 17 Atthadassi campaka Magnolia champaca 18 Dhammadassī bimbijala Pavetta indica 19 Siddhattha kanikara Pterospermum acerifolium 20 Tissa asana Terminalia elliptica 21 Phussa amakala Phyllanthus emblica 22 Vipassī pāṭalī Stereospermum chelonoides 23 Sikhī puṇḍarīka Mangifera indica 24 Vessabhū sāla Shorea robusta 25 Kakusandha sirīsa Albizia lebbeck 26 Koṇāgamana uḍumbara Ficus racemosa 27 Kassapa nigrodha Ficus benghalensis 28 Gautama Buddha (present Buddha) assattha Ficus religiosa 29 Metteyya (future Buddha) nāga Mesua ferrea ==English Senior Secondary Course.com == *The Bodhi-Tree Meditation *History of Bodhi-Tree == References == Category:Trees Category:Buddhism Category:Moraceae Category:National symbols of Nepal",
 "title": "Bodhi Tree"
}