{
 "id": "764339",
 "text": "Azerbaijan Technical University (AzTU; ) is a public university, specialized in engineering, located in Baku, Azerbaijan. It was founded in 1950 by the government of the Azerbaijan Soviet Socialist Republic. The university has 9 faculties and 54 departments, around 1,100 faculty members, including 70 professors and around 6,500 students. ==History== On November 14, 1920, the Soviet government decided that the previous technical school \"Baku Polytechnicum\" would be closed and replaced by the \"Baku Polytechnic Institute\". The new school focused on training engineers in such sectors as agriculture, civil engineering, electromechanics, economics, and petroleum. In 1923, the school changed its name to the \"Azerbaijan Polytechnic Institute\". In March 1929 the Communist Party of Azerbaijan decided that the school would be divided into three independent schools covering agriculture, economy, and petroleum. However, the growing demands of engineers in other areas outside of petroleum led to the expansion of the school curriculum, and the school again changed its name in 1934, this time to the \"Azerbaijan Industrial Institute (AzSI)\", since it was combined with civil engineering. The Second World War put a lot of pressure on the Soviet Union, and schools like AzPI tried to remain open. In 1950, the government established a separate \"Azerbaijan Polytechnic Institute (AzPI)\" and transferred non-petrochemical curricula to a new school so that AzSI could focus on the petroleum industry. (AzSI continued to eventually become the \"Azerbaijan State Oil Academy\".) In 1970, the branch of AzPI was established in Ganja. In 1993, two years after the dissolution of the Soviet Union and independence of Azerbaijan, AzPI changed its status and became the Azerbaijan Technical University. == Faculties == * Electrical engineering and Power engineering * Transport * Technological machines * Special equipment and technologies * Radio engineering and communication * Metallurgy * Machine building * Engineering business and management == Related pages == * List of universities in Baku * Baku Polytechnicum == References == == Other websites == *Official website Category:Technical colleges and universities in Azerbaijan Category:Buildings and structures in Baku Category:20th-century establishments in Azerbaijan Category:1950 establishments in Asia Category:1950 establishments in Europe",
 "title": "Azerbaijan Technical University"
}