{
 "id": "764394",
 "text": "Bertrand Stern is a German author and philosopher. He lives in Siegburg, North Rhine-Westphalia. He wants the legalization of alternative forms of education other than attending a school (homeschooling and unschooling for example) for Germany because he thinks that schools are not suitable for everyone and that it is not okay to force people to go to places where they do not want to be. == Life == Stern was born in Montbéliard, France on November 11, 1948. His father is Arno Stern, and his mother is Claire Stern. He grew up in many countries in Europe. This is the reason why he can speak German, French, English, and Spanish. He has two siblings and a son. He was a lecturer at the University of Kassel from 2011 to 2012. He initiated the film CaRabA #LebenohneSchule. It was released on May 9, 2019 in Germany, Austria and Switzerland. The film shows unschooled people. The producent of the film is Joshua Conens. == Literature == * Bildungsfreiheit statt Bildungspflicht. In: Jahrbuch Kinder-Recht und Jugendpolitik. Wiss. Verlag Wilde, Fürth 1992, . * Schule? Nein danke! Für ein Recht auf freie Bildung! In: Kristian Kunert (Hrsg.): Schule im Kreuzfeuer. Auftrag – Aufgaben – Probleme. Ringvorlesung zu Grundfragen der Schulpädagogik an der Universität Tübingen. Schneider Verlag Hohengehren, Baltmannsweiler 1993, . * (als Hrsg.): Kinderrechte zwischen Resignation und Vision. 2., erw. und überarb. Auflage. Verlag Klemm & Oelschläger, Ulm 1995, . * Weile statt Eile! Unterwegs zu einer Kultur der Muße? Klemm+Oelschläger, Ulm 1996, . * Schluß mit Schule! das Menschenrecht, sich frei zu bilden. tologo, Leipzig 2006, . * Sehr verehrte Frau Bundesministerin für das deutsche Schulwesen...: Nachdenkliches über die Bildungsrepublik. tologo, Leipzig 2008, . * Schule – Ein tragischer Unfall? In: Ulrich Klemm (Hrsg.): Bildung ohne Zwang. Texte zur Geschichte der anarchistischen Pädagogik. Edition AV, Lich 2010, . * (mit Ulrich Klemm): Vom Glück des Nichtstuns: Muße statt Pädagogik. tologo, Leipzig 2011, . * (mit Franziska Klinkigt): Versuche zur Verteidigung der Freiheit. Diskussionen zur „Bildungsrepublik“. Klemm + Oelschläger, Ulm/Münster 2013, . * Frei sich bilden – Entschulende Perspektiven. tologo, Leipzig 2015, . * Saat der Freiheit. Impulse für aufblühende Bildungslandschaften. Klein Jasedow 2016, . * Zum Ausbruch aus der Beschulungsideologie: Gute Gründe, auch juristisch den Schulverweigerern unser prospektives Vertrauen zu schenken. In: Matthias Kern (Hrsg.): Selbstbestimmte und selbstorganisierte Bildung versus Schulpflicht. tologo, Leipzig 2016, . * Gabriel – Vom Entdecken eines glücklich befreiten Lebens. Klemm & Oelschläger, Ulm, 2018, . == References == == Other websites == * Official website (German) *Bertrand Stern on YouTube Category:1948 births Category:German philosophers Category:Writers from North Rhine-Westphalia Category:Living people",
 "title": "Bertrand Stern"
}