{
 "id": "76430",
 "text": "Dawn Roma French (born 11 October 1957) is a British comedian and actress. French studied acting at the London Central School of Speech and Drama, and met Jennifer Saunders there in 1977. French and Saunders became famous when they appeared on a comedy series called The Comic Strip. They wrote the famous comedy series French & Saunders which was first on BBC TV in 1987. She has been nominated for seven BAFTA Awards and also won a Fellowship BAFTA along with Saunders. French is also well known for appearing as Geraldine Granger in British sitcom The Vicar of Dibley. In her career in movie, French played \"The Fat Lady\" picture in the movie Harry Potter and the Prisoner of Azkaban and voiced the beaver in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. French is known for her larger figure. She tries to promote the idea that \"big\" can be beautiful. As a result, she has her own line of clothes, Sixteen47. The name is from the statistic that 47% of British females are at least a size 16. The clothes are made to look good on larger women. ==Credits== ===Television=== *The Comic Strip (1982) *Five Go Mad in Dorset (1982) *Five Go Mad on Mescaline (1983) *The Young Ones (1982–1984) *Girls On Top (1985–1986) *Happy Families (1985) *Kate Bush – Experiment IV (Video)(1986) *French and Saunders (1987–2007) *Murder Most Horrid (1991–1999) *Absolutely Fabulous (1992) *The Legends of Treasure Island (1993–1995) *The Vicar of Dibley (1994–2007) Geraldine Granger *Sex & Chocolate (1997) *Let Them Eat Cake (1999) *Ted and Alice (2002) *Wild West (2002–2004) *Marple: Sleeping Murder (2005) *Jam and Jerusalem (2006, 2008, 2009) *Dawn French's Girls Who Do Comedy (2006) *Little Britain Abroad (2006) *Marple (2006) *High Table (2007) *The Meaning of Life (2007) *Dawn French's Boys Who Do Comedy (2007) *Lark Rise to Candleford (2008 & 2011) *Psychoville (2009–2011) *The Paul O'Grady Show (2009) [Guest Host] *Alan Carr: Chatty Man (2009) *Roger & Val Have Just Got In (2010 – present) *Paul O'Grady Live (2010) ===Theatre=== *Me and Mamie O'Rourke *When I Was a Girl I Used to Scream and Shout *All Souls' Night, Lyric Theatre *Swan Lake (1996) *Then Again (1997) *Side By Side (1997) *A Midsummer Night's Dream (2001) *My Brilliant Divorce (2003) *Smaller (2005) *La fille du régiment (2007) *Still Alive (2008–2009) the last comedy sketch show done by French and Saunders ===Movies=== *Eat the Rich (1987) *The Adventures of Pinocchio (1996) *David Copperfield (1999) *Maybe Baby (2000) *Harry Potter and the Prisoner of Azkaban (2004) The Fat Lady *The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005) Mrs Beaver (Voice) *Love and Other Disasters (2006) *Coraline (2009) Miss Miriam Forcible/Other Forcible (Voice) *Animals United (2010) Angie (Voice) ==Awards and recognition== French and Saunders won the Golden Rose of Montreux award in 2002 and in 2003. She was listed in The Observer as one of the 50 funniest acts in British comedy. In a 2006 poll French was named as the most admired female celebrity amongst women in Britain.David Beckham, Dawn French named top idols\" Digital Spy. Retrieved 8 September 2007. ===BAFTA Awards=== *1989 – Nominated – BAFTA TV Award for Best Light Entertainment Performance in French and Saunders *1991 – Nominated – BAFTA TV Award for Best Light Entertainment Performance in French and Saunders *1998 – Nominated – BAFTA TV Award for Best Comedy Performance in The Vicar of Dibley *2000 – Nominated – BAFTA TV Award for Best Comedy Performance in The Vicar of Dibley *2001 – Nominated – BAFTA TV Award for Best Comedy Performance in The Vicar of Dibley *2007 – Nominated – BAFTA TV Award for Best Comedy Performance in The Vicar of Dibley *2009 – Won – BAFTA Fellowship – awarded with Jennifer SaundersBritish Academy of Film and Television Arts Fellowship presented on Sunday 26 April 2009. *2011 – Nominated – BAFTA Best Female Performance In A Comedy Role in Roger and Val Have Just Got In ===British Comedy Awards=== *1997 – Won – British Comedy Award for Best TV Comedy Actress in The Vicar of Dibley *1998 – Nominated – British Comedy Award for Best TV Comedy Actress in The Vicar of Dibley *2011 - Nominated - British Comedy Awards for Best TV Comedy Actress in Psychoville ===National Television Awards=== *1998 – Nominated – National Television Award for Most Popular Comedy Performer in The Vicar of Dibley *2000 – Nominated – National Television Award for Most Popular Comedy Performer in The Vicar of Dibley *2002 – Nominated – National Television Award for Most Popular Comedy Performance in Ted and Alice *2003 – Nominated – National Television Award for Most Popular Comedy Performance in Wild West ===Other=== *1991 – Won – Writers' Guild of Great Britain Award for TV- Light Entertainment in French and Saunders *2001 – Along with Jennifer Saunders, declined an OBE. *2002 – Won – Rose d'Or Light Entertainment Festival Award shared with Jennifer Saunders ==References== ==Other websites== * * * Biography at the Museum of Broadcast Communications * French and Saunders Category:English comedians Category:English movie actors Category:English stage actors Category:English television actors Category:1957 births Category:Living people",
 "title": "Dawn French"
}