{
 "id": "764376",
 "text": "Andy Bialk (born November 16, 1971) is an American animator, storyboard artist and character designer. He is best known for his work as a lead character designer on the Cartoon Network series Dexter's Laboratory and The Powerpuff Girls. He was also known for portraying a high school student in the music video for Nirvana's \"Smells Like Teen Spirit\". ==Filmography== ===Television=== Year Title Notes 1995-1996 The Cartoon Cartoon Show layout artist 1995 The Twisted Tales of Felix the Cat layout artist 1996-2003 Dexter's Laboratory character designer/background designer/model designer/layout artist 1997 Nightmare Ned background layout 1998-2004 The Powerpuff Girls model/character designer 2001 Samurai Jack property designer 2004-2007 Foster's Home for Imaginary Friends character designer 2005 Star Wars: Clone Wars character layout The X's additional character designer 2005-2006 Super Robot Monkey Team Hyper Force Go! lead character designer Johnny Test character designer 2010 The Penguins of Madagascar character designer The Ricky Gervais Show character designer Sym-Bionic Titan character designer 2010-2011 Scooby-Doo! Mystery Incorporated background painter 2012-2013 DreamWorks Dragons character designer 2013 The Awesomes original character design 2014-2015 Mickey Mouse character designer 2015-2016 Shimmer and Shine art director/original character design ===Movies=== Year Title Notes 2002 The Powerpuff Girls Movie character designer 2003 The Cat in the Hat storyboard artist (2D animation title sequence) 2005 Robots storyboard artist 2006 Flushed Away storyboard artist 2008 Horton Hears a Who character designer (2D animation sequence) Kung Fu Panda character designer (2D animation sequence) Madagascar: Escape 2 Africa character designer 2010 How to Train Your Dragon character designer Shrek Forever After character designer Megamind character designer 2012 Madagascar 3: Europe's Most Wanted character designer (uncredited) 2013 Free Birds character designer (uncredited) 2014 The Lego Movie concept artist and designer The Book of Life character designer 2015 The SpongeBob Movie: Sponge Out of Water character designer Hell and Back lead character designer 2017 The Emoji Movie visual development artist 2018 The Grinch character designer Spider-Man: Into the Spider-Verse visual development artist ===Books=== Year Title Notes 1996 20th Century illustrator ==Other websites== * Category:Living people Category:American animators Category:1971 births Category:People from San Diego",
 "title": "Andy Bialk"
}