{
 "id": "764410",
 "text": "The Régence (, Regency) refers to a time between 1715 and 1723, when King Louis XV was a minor and France was governed by Philippe d'Orléans, a nephew of Louis XIV o France, as Regent of the Kingdom. In French the period is also called le Régence de Philippe'Orléans. Contemporary European rulers included Philip V of Spain, John V of Portugal, George I of Great Britain, Charles VI, Holy Roman Emperor (faither o Empress Maria Theresa) and Victor Amadeus II of Sardinia, the maternal grandfather of King Louis XV. ==Chronology== ===1714=== *29 July 1714: the Duke o Maine an the Coont o Toulouse, Louis XIV's illegitimate sons (bi Madame de Montespan), are made Princes o the Bluid. ===1715=== *1 September 1715: Louis XIV dies, his will entrusts the government of France to a regency council, with Philippe d'Orléans, Duke o Orléans aa honorary president and the Duke of Maine as the real power, until the young Louis o Fraunce, Duke o Anjou reaches his majority (1723) *2 September 1715: the Duke of Orléans allies himself with the Parlement de Paris, who cancelled Louis XIV's will. As a Prince of the Bluid, Philippe o Orléans haed been a member o the Parlement. *9 September: Body o Louis XIV taken to Saunt Denis; Louis XV sets off for Vincennes with the Regent, Madame de Ventadour, Villeroy, Toulouse and Maine; Philip V of Spain hears of his grandfaither's daith; *12 September: Philippe d'Orléans recognised Regent bi order of the Parlement; *15 September: Parlement claims the Droit de remontrance, the right to revoke a law made bi a Keeng who haed died, further supporting the Regent's claim tae power. *1 October 1715: Polysynody was held in Paris; it was composed of the highest nobility o the country. *30 December: Removal o Louis XV from the Château de Vincennes to the Tuileries Palace; *Louis XV put under the care o François de Neufville, Duke o Villeroy; Guillaume Delisle an the Cardinal de Fleury are put in charge of Louis' education. ===1716=== *14 Mairch: Creation o the Chambre Ardente; an extraordinary court of justice in France, mainly held for the trials o heretics; *2 Mey: Philippe d'Orléans allows John Law tae found the Banque générale; *27 Jin: Birth o Mademoiselle de Chartres at the Palais Royal; she wis the last child o the Regent; *9/10 October: Alliance with Great Britain; ===1717=== *Triple Alliance (1717); a treaty between the Dutch Republic, France an Great Britain, against Spain, attempting tae maintain the agreement o the 1713 Treaty of Utrecht; *31 Mairch: The Regent's second surviving daughter Louise Adélaïde takes the veil an becomes a nun under the name o Sœur Sainte Bathilde. *21 Mey: Arrival o Peter I of Russia in Paris; he visits the Keeng, Versailles, the Regent, his daughter Marie Louise Élisabeth d'Orléans; he stays in Paris; he does not see the Duchess of Orléans despite her pleas; Peter stays at the Grand Trianon; *6 June 1717: Purchase of the Regent Diamond; later part of the French Crown Jewels; *Julie: the Duke o Maine and the Count of Toulouse are stripped of their rank o Princes of the Blood by the Parlement *September: Foundation of the Compagnie d'Occident et du Mississippi; ===1718=== *Mairch: Arrival o the Duke o Lorraine and his consort, Élisabeth Charlotte d'Orléans (sister o the Regent); *31 March: Infanta Mariana Victoria of Spain born in Madrid; later betrothed to Louis XV; *11 April: Daith o the Dowager Duchess of Vendôme; *7 Mey: Daith o Mary of Modena at the Château de Saint-Germain-en-Laye; she wis Queen consort o the exiled James II of England; *2 August: Quadruple Alliance with Austrick, Fraunce, the Dutch Republic and Great Britain – aimed at revising (principally at Spain's expense) the treaties which ended the War of the Spanish Succession; *24 September: end of the Polysynody an the reestablishment of ministers; *4 December: Banque générale becomes the Banque Royale; *December Exposure of the Cellamare Conspiracy headed by the Duke of Maine and his wife Louise Bénédicte de Bourbon, which aimed at placing Philip V of Spain as regent o Fraunce with the help of the Spaingie Ambassador, the \"Príncipe de Cellamare\"; the Duke an Duchess are exiled from court and return in 1720 to the Sceaux; ===1719=== *9 Januar: Declaration of War with Spain; *15 Aprile: Death of Madame de Maintenon at Saint-Cyr-l'École; *Mey foundation of the East India Company by John Law; *21 Julie: Death of Marie Louise Élisabeth d'Orléans; favourite daughter of the Regent who participated in the hectic nightlife o his court, even during several pregnancies with different men. ===1720=== *5 January: John Law made Controller General of Finances; *11 February: Marriage of Charlotte Aglaé d'Orléans to Francesco d'Este, Hereditary Prince of Modena at the Tuileries Palace; *March : Great Plague of Marseille; *21 March: Death of Marie Anne de Bourbon, wife of the Duke o Bourbon; *26 March: Execution of the leaders of the Pontcallec Conspiracy against the Regency. ===1721=== *Publication of the Persian Letters by Montesquieu; negotiations between the Regent and Peter I of Roushie begin regarding the proposed marriage o the Regents only legitimate son to a daughter of the Emperor, namely either the Grand Duchess Anna Petrovna o Russia or the future Elizabeth of Russia; plans fail an Louis d'Orléans marries in 1724; *6 January: Arrest of Louis Dominique Bourguignon; *27 March: Alliance of Spain and France; *May : Visit of Mehmet Effendi; Turkish Ambassador; *18 July: Death of Antoine Watteau; *17 September: Death of the Marguerite Louise d'Orléans, Grand Duchess of Tuscany; cousin of the Regent; *29 December : Birth of the future Madame de Pompadour; *Marie Anne de Bourbon is put in charge o the Infanta's education in France; ===1722=== *The Dowager Duchess of Bourbon starts the construction of the Palais Bourbon in Paris tae a design by the Italian architect Lorenzo Giardini, approved by Jules Hardouin Mansart; * 20 Januar: Marriage of Louise Élisabeth d'Orléans to the future Louis I of Spain; *10 Mairch: Arrival of Infanta Mariana Victoria of Spain in Paris; daughter of Philip V of Spain and Elisabeth Farnese; *15 Juin: Louis XV and the court return to Versailles; the Regent takes the old apartments of his dead cousin, the late Louis, Dauphin of Fraunce (1661–1711); *22 August: Guillaume Dubois made the Prime Minister o the Regent; *25 October: Coronation of Louis XV at the Cathedral of Notre Dame, Reims; *8 December: Death of Elisabeth Charlotte of the Palatinate (Madame), mother of the Regent; ===1723=== *Louis XV orders plans for the future Salon d'Hercule to begin; *2 Februar: Secret marriage of the Count o Toulouse and Marie Victoire de Noailles (already widowed daughter in law of Madame de Montespan) in Paris; their marriage was only announced after the death of the Regent; *16 February: Majority of Louis XV; *23 February: Daith of Anne of Bavarie, Dowager Princess of Condé; *10 August: Death of Dubois; Role later took on by Louis Henri, Duke of Bourbon, Prince of Condé; *2 December: death of the Regent at the Palace of Versailles; ==References== Category:French nobility Category:House of Bourbon Category:House of Orléans",
 "title": "Régence"
}