{
 "id": "76441",
 "text": "Port-au-Prince (Pòtoprens in Kreyòl) is the capital city of Haiti. Haiti is also divided into ten Départements; Port-au-Prince is the capital of the Ouest Département. Port-au-Prince is Haiti's largest city. According to the country's 2015 census, over 2.6 million people lived there. == History == Port-au-Prince was built in 1749. At that time, Haiti was a French colony called Saint-Domingue. Before 1770, Cap-Français (now Cap-Haïtien) was the capital of Saint-Domingue. In 1770, Port-au-Prince replaced Cap-Français as the capital of Saint-Domingue. In 1804, the people of Haiti won the Haitian Revolution, and Haiti became an independent country. Port-au-Prince became the capital of this new country. During the French and Haitian Revolutions, it was called Port-Républicain, before Jean-Jacques Dessalines renamed it Port-au- Prince. Shortly after it won its independence, Haiti's new leaders divided the country between a kingdom in the north and a republic in the south. Port-au- Prince remained the capital of the republic. == Port-au-Prince today == Port- au-Prince is the cultural centre of Haiti. The State University of Haiti (L'Université d'État d'Haïti, or UEH, in French); the Université Quisqueya; and the Université Caraïbe are all located in the city. Port-au-Prince is the nation's largest centre of economy and finance. It has the most important port in the country, where coffee and sugar are exported. Port-au-Prince has soap, textile, and cement factories, and others to process foods. There is also an international airport about north of the city. It is named Aéroport International Toussaint L'ouverture after national hero Toussaint L'ouverture. The city was very badly damaged and more than 100,000 people died in the 2010 Haiti earthquake, which is one of the deadliest earthquakes in history. Due to extreme poverty, the city has still not recovered from the earthquake, and many ruins still remain. ==References== Category:1749 establishments Category:Port-au-Prince Category:Establishments in the French colonial empire Category:1740s establishments in North America",
 "title": "Port-au-Prince"
}