{
 "id": "764520",
 "text": "Raoul Singh Juneja (born February 1, 1980) is a Canadian music producer and columnist based in Toronto, Ontario, Canada. Raoul is better known as a media expert on urban and South Asian music. He is credited as the executive producer of A 2Pac Tribute: Dare 2 Struggle, a tribute album dedicated to the late hip hop icon, Tupac Shakur. ==Career== He studied media at University of Western Ontario where he began DeeJaying and appearing as a TV host. In 2001, Juneja started his professional career writing articles for Canada's WORD Magazine. Raoul has worked as a columnist for The Globe and Mail. In 2005, Juneja founded Hip-Hop Literacy campaign. The campaign was supported by several celebrities. ==Music career== Raoul has conducted and produced the award-winning national Canadian music Show V-Mix on Omni Television, which ran for 173 episodes over 4 seasons. Juneja has co-produced several albums, \"Music To Inspire: Act To Change\" as well as \"Music To Inspire: Artists UNited Against Human Trafficking\" and The Black Prince: Music Inspired By The Motion Picture. Juneja has worked as the researcher for CBC's first South Asian CBC Radio, which was launched in 2014. He served on the Toronto Independent Music Awards as a jury for JUNO Awards. He is a members of Artists United Against Human Trafficking, a UNODC's initiative against the crime of trafficking in persons. In 2016, Juneja joined an anti-bullying tour of Canadian schools, Conquer The Fear, as their keynote speaker. ==Selected discography== *A 2Pac Tribute: Dare 2 Struggle, 2006 *Music To Inspire: Act To Change, 2016 *Music To Inspire: Artists United Against Human Trafficking, 2017 *The Black Prince (Music Inspired by the Motion Picture), 2017 ==Accolades== *Anokhi Magazine's Excellence in Music Media Award, 2014 *Diversity Magazine's Transformation in Entertainment Award in 2014 ==References== ==Other websites== * * Category:1980 births Category:Record producers Category:Musicians from Toronto Category:Living people",
 "title": "Raoul Juneja"
}