{
 "id": "765217",
 "text": "The Triangle Shirtwaist Factory fire was a fire that happened on March 25, 1911. The fire happened in the Triangle Shirtwaist Factory. This factory was on the higher floors of the Asch Building in Manhattan, New York City. The fire stopped after 20 minutes. 146 workers died. The company's owners, Max Blanck and Isaac Harris, survived the fire by going to the building's roof when the fire started. They were indicted on charges of first and second- degree manslaughter in mid-April. Their trial began on December 4, 1911.Stein p. 158 Max Steuer was the lawyer for the defendants. He asked one of the survivors, Kate Alterman, to repeat her testimony many times. She repeated it without changing what she said. Steuer told the jury that Alterman and other witnesses had been told what to say by their lawyer. The prosecution said that Blanck and Harris knew the factory doors were locked during the fire. Detectives found that the locks were locked while people were working.von Drehle, p. 220 The defense said that the prosecution failed to prove that the owners knew that. The jury acquitted the two men of first- and second-degree manslaughter. They were found liable of wrongful death during a civil suit in 1913. In this suit, plaintiffs were given $75 per person that died in the fire. An insurance company paid Blanck and Harris about $60,000 more than the reported losses. This was about $400 per dead person. In 1913, Blanck was once again arrested for locking the door in his factory while people were working. He was fined $20. This was the smallest amount of money the fine could be.Hoenig, John M. , History Magazine, April/May 2005. Because of the lax labor laws at the time, this tragedy led to the rise of factory workers safety protections and the formation of workers Unions such as the International Ladies Garment Union. * Max Steuer died on August 21, 1940 in Jackson, New Hampshire. * Max Blanck also called Norman Max Blanc died July 10, 1942 in Califrnia. * Isaac Harris died 1954 in CaliforniaWhat happened to the Triangle Factory owners.. File:A newspaper photograph of an internal staircase in the Asch Building after the Triangle fire (5279144863).jpg|Asch building's internal staircase File:Interior of the Triangle Waist Company shop in the Asch Building 9th floor after the Triangle Fire (5279327601).jpg|The building's 9th floor File:Interior view of the tenth-floor work area in the Asch Building after the Triangle fire (5279682800).jpg|The building's 10th floor File:TriangleFire 25March1911 BodiesOnSidewalk.jpg|62 people jumped or fell from windows File:Bodiesonthestreet-TriangleFactoryFire-1911.jpg|Bodies on the street File:Police officers and fire fighters check for signs of life and collect personal items from victims of the Triangle fire. (5279681736).jpg|Policemen search for signs of life and collect personnel items from victiums File:TriangleFiremenSearching.jpg|Firemen search for bodies File:Negative print showing the street in front of the Asch Building, where the Triangle Waist Company fire burned (5279683220).jpg|Bodies on the street File:Triangle Shirtwaist coffins.jpg|Bodies of the victims being placed in coffins on the sidewalk File:The Triangle Waist Company fire escape, weakened by the heat of the fire, leads from upper floors of the Asch Building (5279681954).jpg|The twisted fire escape File:Newspaper photographs of the Asch Building's exterior after the Triangle fire (5279749194).jpg|Exterior of the Building File:Newspaper photgraphs in the New York Evening Journal show the burned Asch Building interior and exterior, March 27, 1911 (5279144149).jpg|Exterior and Interior of the Building File:Max Blanck and Isaac Harris, owners of the Triangle Waist Company (5279933972).jpg|Max Blanck and Isaac Harris File:The spectre of Death, in the form of a large skeleton, rises with the smoke and flames of the burning Asch Building during the Triangle fire, as people jump and fall to their death. (5279751556).jpg File:Cartoon \"Inspector of Buildings\" refers to the Triangle fire and depicts a skeleton dressed as a building inspector (5279761922).jpg ==References== Category:1911 in the United States Category:20th century in New York City Category:Building and structure fires in the United States Category:History of Manhattan",
 "title": "Triangle Shirtwaist Factory fire"
}