{
 "id": "765266",
 "text": "The Netherlands Institute for Art History, also known as RKD, is a large institution in The Hague in The Netherlands. It is devoted to the study of art history and has a very large library. The initials RKD stand for \"Rijksbureau voor Kunsthistorische Documentatie\", the older Dutch name of the institute. The Netherlands Institute for Art History opened in 1932. Three men made the biggest contribution to the Institute's collection. The first man was Cornelis Hofstede de Groot (1863–1930). He was a collector, art historian and museum curator. In his will, he left the RKD his large collection of documents. These included about 100,000 photos of Dutch paintings and drawings from the 17th century. The second man was Frits Lugt (1884-1970). He was also a collector and art historian. He gave the institute over 100,000 reproductions of paintings, 22,000 auction catalogues and thousands of books. The third man was E.A. van Beresteyn (1876-1948), an archivist and historian. He gave the institute a lot of material on Dutch portrait painting.RKD. \"History\". Retrieved 8 June 2020 The institute has a very large library of 450,000 books and around 3,000 magazines. Much of their material is digitized—very high quality pictures of book and magazine pages which are available on the internet. Many paintings and drawings are also digitized and available on the internet. The institute's website has many pages about artists with information on their life and work. Each artist has their own RKD number. The website also has a thesaurus of words used to describe art and architecture.Janson, Marlies and Opitz, Helmut (2011). World Guide to Special Libraries, Vol. 1, p. 103. Walter de Gruyter. Van der Starre, Jan (1997). \"Automation at the RKD: An Overview\". Electronic Imaging and the Visual Arts, Vol. 7, Part 2. pp. 67–80 ==References== ==Other websites== * Category:Libraries in Europe Category:The Hague Category:Buildings and structures in the Netherlands",
 "title": "Netherlands Institute for Art History"
}