{
 "id": "765767",
 "text": "Raymond \"Ray\" Kurzweil (born February 12, 1948 in Queens, New York City) is an American author, entrepreneur, inventor, and futurist. Kurzweil wrote seven books (five of them were national bestsellers) about topics like health, artificial intelligence (AI), transhumanism, immortality, the technological singularity, and futurism. He speaks to people and gives speeches at conferences like DEMO, SXSW, and TED. He also maintains the news website KurzweilAI.net. It has more than three million readers per year. He has a sibling, a son (Ethan Kurzweil), and a daughter (Amy Kurzweil). Kurzweil works at Google since 2012. He is a \"director of engineering\". == Notable predictions == Kurzweil made 147 predictions about the future since the 1990s. He has a prediction accuracy rate of 86%. === Past === Predictions from 1990: A computer will defeat a world chess champion by 1998. This prediction was wrong because it already happened in 1997. Personal Computers (PCs) will can answer queries by accessing information wirelessly via the Internet by 2010. That became true. Exoskeletal limbs will let the disabled walk by the early 2000s. That became true. Predictions from 1999: People will can talk to their computer to give them commands by 2009. That became true. Computer displays will be built into eyeglasses for augmented reality by 2009. That became true. Predictions from 2005: Virtual solutions will be able to do real-time language translation into text that will appear as subtitles to a user wearing the glasses in the 2010s. That became true. === Future === *In the 2020s: Nanobots will fight most diseases. Human eating can be replaced by nanosystems. There will be self-driving cars. Humans will not be allowed to drive on highways anymore. *By 2027: Accurate computer simulations of all parts of the human brain will exist. *By 2029: AI will pass a valid Turing test and will achieve human levels of intelligence. Computers will have emotional intelligence. Computers will have human level intelligence. *In the early 2030: There will be a basic income in the developed world. *In the 2030s: Humans can connect their neocortex to a cloud. Some technology will be invented that can go inside a brain and help the memory. Virtual reality (VR) will feel 100% real. *In the late 2030s: Humans can upload their mind. There will be a worldwide basic income. *In the 2040s: Non-biological intelligence will be a billion times higher than biological intelligence. *By 2045: The technological singularity will start. Humans will can multiply their intelligence a billion times by linking wirelessly from our neocortex to a synthetic neocortex in a cloud. Computers will be about one billion times more intelligent than all human brains on earth together. Humans will can live forever. *By 2072: Picotechnology will be possible. *By 2099: Machines will get equal legal status with humans. Humans will meet other beings mostly in virtual environments. There will be very few organic humans. Femtoengineering might be possible. *In a few centuries: Computer intelligence will be higher than human intelligence in all areas. *Thousands of years from now: \"Intelligently (emotional) beings consider the fate of all the Universe.\"The Age of Spiritual Machines == Books == === Non-fiction === * The Age of Intelligent Machines (1990) * The 10% Solution for a Healthy Life (1993) * The Age of Spiritual Machines (1999) * Fantastic Voyage: Live Long Enough to Live Forever (2004 - co-authored by Terry Grossman) * The Singularity Is Near (2005) * Transcend: Nine Steps to Living Well Forever (2009) * How to Create a Mind (2012) === Fiction === * Danielle: Chronicles of a Superheroine (2019) == References == == Other websites == * Official website * * Official Danielle Superheroine website * http://www.kurzweiltech.com/ * https://transcend.me/ === Videos (selection) === * * *, a feature-length documentary based on Ray Kurzweils book \"The Singularity is Near: When Humans Transcend Biology\". Starring Pauley Perrette from CBS Network. * * Category:1948 births Category:Living people Category:Writers from Queens Category:Businesspeople from New York City Category:American inventors Category:Futurists Category:Massachusetts Institute of Technology alumni",
 "title": "Ray Kurzweil"
}