{
 "id": "766057",
 "text": "The New Batman Adventures (often shortened as TNBA) is an American superhero animated television series based on the DC Comics superhero Batman. It is a continuation of the 1990s Batman: The Animated Series. It was produced by Warner Bros. Animation and aired on Kids' WB from September 13, 1997 to January 16, 1999. ==About== Stories in this show give more focus to Batman's supporting cast, which include fellow crimefighters Robin, Nightwing and Batgirl, among others. The show also features guest stars such as Supergirl, Etrigan the Demon and The Creeper; characters who would later appear with Batman in Justice League and Justice League Unlimited. The 2001 video game Batman: Vengeance and its follow-up Batman: Rise of Sin Tzu are based on this series. The show had a huge change in focus from the original series, with episodes focusing less on Batman and more on the many characters that live in Gotham City. ==Cast== === Heroes === Actor Role Kevin Conroy Bruce Wayne / Batman Mathew Valencia Tim Drake / Robin Tara Strong Barbara Gordon / Batgirl Loren Lester Dick Grayson / Nightwing Efrem Zimbalist Jr. Alfred Pennyworth Bob Hastings Commissioner James Gordon Robert Costanzo Detective Harvey Bullock === Supporting heroes === Actor Role Jeff Bennett Jack Ryder / The Creeper Liane Schirmer Renee Montoya Mel Winkler Lucius Fox Lloyd Bochner Mayor Hamilton Hill Marilu Henner Veronica Vreeland Suzanne Stone Joan Leland Billy Zane Jason Blood / Etrigan the Demon Nicholle Tom Kara Kent / Supergirl === Main villains === Actor Role Mark Hamill The Joker Richard Moll Harvey Dent / Two-Face Arleen Sorkin Dr. Harleen Quinzel / Harley Quinn Adrienne Barbeau Selina Kyle / Catwoman Paul Williams Oswald Chesterfield Cobblepot / The Penguin John Glover Edward Nygma / The Riddler Michael Ansara Dr. Victor Fries / Mr. Freeze Jeffrey Combs Dr. Jonathan Crane / The Scarecrow Diane Pershing Dr. Pamela Isley / Poison Ivy Brooks Gardner Waylon Jones / Killer Croc Roddy McDowall Dr. Jervis Tetch / The Mad Hatter Ron Perlman Matt Hagen / Clayface George Dzundza Arnold Wesker / The Ventriloquist Henry Silva Bane === Minor villains === Actor Role Peter Breck Farmer Brown Charity James Roxanne Sutton / Roxy Rocket Laraine Newman Mary Dahl / Baby Doll Lori Petty Leslie Willis / Livewire Mark Rolston Garfield Lynns / Firefly Stephen Wolfe Smith Klarion the Witch Boy Sela Ward Page Monroe / Calendar Girl ==References== Category:1997 American television series debuts Category:1999 American television series endings Category:1990s American animated television series Category:Batman Category:DC Animated Universe Category:Superhero television shows",
 "title": "The New Batman Adventures"
}