{
 "id": "766048",
 "text": "This is a list of Heads of state of Syria since 1920. ==Mamluk Sultanate== ==Ottoman Syria== ==Military administrators== ===OETA South chief administrators=== The area was divided into four districts: Jerusalem, Jaffa, Majdal and Beersheba, each under a military governor. Both of the first two British administrators, Generals Money and Watson, were removed by London for not favouring the Zionists over the Arabs; when the OETA administration ended, Liberal party politician (and former British Home Secretary) Herbert Samuel was installed as the first civilian administrator. Samuel recorded his acceptance of the role, and the end of military administration, in an often- quoted document: \"Received from Major-General Sir Louis J. Bols K.C.B.—One Palestine, complete.\" ===OETA East administrators=== OETA East was a joint Arab-British military administration. The Arab and British armies entered Damascus on 1 October 1918, and on 3 October 1918 Ali Rida al-Rikabi was appointed Military Governor of OETA East. Prince Faisal son of King Hussain of Mecca entered Damascus as on 4 October and appointed Rikabi Chief of the Council of Directors (i.e. prime minister) of Syria. The boundary definition of OETA East left uncertainties to the south and east, leading to competing claims from the Kingdom of Hejaz and Occupied Iraq respectively – see Occupation of Ma'an and Occupation of Zor for further details. * Rida al- Rikabi (3 October 1918 – 26 November 1919) ===OETA North (West) administrators=== * Marie Antoine Philpin de Piépape (7 Oct 1918 - 19 Nov 1918) * Jules Camille Hamelin (19 Nov 1918 - 21 Nov 1919) * François Georges Barb (21 Nov 1919 - 1 Sep 1920) ===OETA North (Cilicia) administrators=== * Édouard Brémond Portrait Name Term of office Term of office Term of office Portrait Name Took office Left office Time in office 1 Major general Arthur Wigram Money June 1918 June 1919 2 Major general Harry Davis Watson June 1919 December 1919 3 Lieutenant general Louis Bols January 1920 July 1920 ==List of high commissioners of France in the Levant== * Syria or French Syria (1920–1946) (French Mandate of Syria) Portrait Name Term of office Term of office Term of office Notes Portrait Name Took office Left office Time in office Notes Henri Gouraud 9 October 1919 23 November 1922 Robert de Caix 23 November 1922 19 April 1923 Acting Maxime Weygand 19 April 1923 29 November 1924 Maurice Sarrail 29 November 1924 23 December 1925 Henry de Jouvenel 23 December 1925 23 June 1926 Henri Ponsot August 1926 13 July 1933 Damien de Martel 16 July 1933 January 1939 Gabriel Puaux January 1939 November 1940 Jean Chiappe 24 November 1940 27 November 1940 Died on flight to take office. Henri Dentz 6 December 1940 14 July 1941 Dentz was repatriated to Metropolitan France following the Armistice of Saint Jean d'Acre. ==List of general delegates of Free France in the Levant== Portrait Name Term of office Term of office Term of office Notes Portrait Name Took office Left office Time in office Notes Georges Catroux 24 June 1941 7 June 1943 Catroux was also Chief of Free French Forces in Levant states. Jean Helleu 7 June 1943 23 November 1943 Yves Chataigneau 23 November 1943 23 January 1944 Paul Beynet 23 January 1944 1 September 1946 ==High Commissioners== * 26 Nov 1919 – 23 Nov 1922: Henri Gouraud * 23 Nov 1922 – 17 Apr 1923: (acting) * 19 Apr 1923 – 29 Nov 1924: Maxime Weygand * 29 Nov 1924 – 23 Dec 1925: Maurice Sarrail * 23 Dec 1925 – 23 Jun 1926: Henry de Jouvenel * Aug 1926 – 16 Jul 1933: Auguste Henri Ponsot * 16 Jul 1933 – Jan 1939: Damien de Martel * Jan 1939 – Nov 1940: Gabriel Puaux * 24 Nov 1940 – 27 Nov 1940: Jean Chiappe (died on flight to take office) * 6 Dec 1940 – 16 Jun 1941: Henri Dentz * 24 Jun 1941 – 7 Jun 1943: Georges Catroux * 7 Jun 1943 – 23 Nov 1943: * 23 Nov 1943 – 23 Jan 1944: Yves Chataigneau * 23 Jan 1944 – 1 Sep 1946: Étienne Paul-Émile-Marie Beynet == Governors Jabal Druze State == *Amir Salim Pasha al-Atrash (1 May 1921 – 15 September 1923) *Trenga (provisional) (September 1923 – 6 March 1924) *Gabriel Marie Victor Carbillet (6 March 1924 – 14 October 1925), provisional to 1 October 1924 *Sultan Pasha al-Atrash (18 July 1925 – 1 June 1927), chief of state; in dissidence *Charles Andréa (15 October 1925 – 1927) *Marie Joseph Léon Augustin Henry (1927) *Abel Jean Ernest Clément-Grancourt (1927–1932) *Claude-Gabriel-Renaud Massiet (3 February 1932 – 28 January 1934) *Justin- Antoine Devicq (1934–1935) *Pierre-Joseph-François Tarrit (1935 – 2 December 1936) ===Hatay State=== Hatay State (; ; ), also known informally as the Republic of Hatay (), was a transitional political entity that existed from 7 September 1938 to 29 June 1939, being located in the territory of the Sanjak of Alexandretta of the French Mandate of Syria. The state was transformed de facto into the Hatay Province of Turkey on 7 July 1939, de jure joining the country on 23 July 1939. ==Alawite State== The Alawite State was run by a succession of French governors from 1920 to 1936: *2 September 1920 – 1921: Colonel Marie Joseph Émile Niéger (b. 1874; d. 1951) *1921–1922: Gaston Henri Gustave Billotte (b. 1875; d. 1940) *1922–1925: Léon Henri Charles Cayla (b. 1881; d. 1965) *1925 – 5 December 1936: Ernest Marie Hubert Schoeffler (b. 1877; d. 1952) The Sunni landowners, primarily living in the province's cities, were supporters of Syrian unity; however, the French were supported by the rural Alawite communities to whom they catered. In 1930 the Alawite State was renamed as the Government of Latakia, the only concession by the French to Arab nationalists until 1936. ==List== Name Picture Took office Left office Heads of Government Muhammad Said al-Jazairi 17 September 1918 30 September 1918 Ali Rida Pasha al-Rikabi 30 September 1918 5 October 1918 Emir Faisal 5 October 1918 8 March 1920 Kingdom of Arabic Syria (1920) King Faisal I of Syria King 8 March 1920 24 July 1920 Name Picture Took office Left office Political Party State of Syria (Part of the French Mandate of Syria and Lebanon) (1922–1930) Ali Rida Pasha al-Rikabi 8 March 1920 3 May 1920 Hashim al-Atassi 3 May 1920 28 July 1920 Subhi Bay Barakat al-Khalidi صبحي بك بركات الخالدي 28 June 1922 21 December 1925 Independent François Pierre-Alype (acting) 9 February 1926 28 April 1926 Independent Ahmad Nami أحمد نامي 28 April 1926 15 February 1928 Independent Taj al-Din al-Hasani تاج الدين الحسني (acting) 15 February 1928 14 May 1930 Independent Syrian Republic (Part of the French Mandate of Syria and Lebanon) (1930–1936) Taj al-Din al-Hasani تاج الدين الحسني (acting) 14 May 1930 19 November 1931 Independent Léon Solomiac (acting) 19 November 1931 11 June 1932 Independent Muhammad Ali al-Abid محمد علي العابد 11 June 1932 27 September 1936 Independent Syrian Republic (Franco-Syrian Treaty of Independence signed but not ratified) (1936–1946) Muhammad Ali al-Abid محمد علي العابد 27 September 1936 21 December 1936 Independent Hashim al- Atassi هاسم الأتاسي (1st time) 21 December 1936 7 July 1939 National Bloc Bahij al-Khatib بيج الخطيب 10 July 1939 4 April 1941 Independent Khalid al-Azm خالد العظم (acting) 4 April 1941 16 September 1941 Independent Taj al-Din al-Hasani تاج الدين الحسني 16 September 1941 17 January 1943 (died in office) Independent Jamil al-Ulshi جميل الألشي (acting) 17 January 1943 25 March 1943 Independent Ata al-Ayyubi عطا الأيوبي 25 March 1943 17 August 1943 Independent Shukri al-Quwatli شكري القوتلي (1st time) 17 August 1943 17 April 1946 National Bloc Syrian Republic (1946–1958) Shukri al-Quwatli شكري القوتلي (1st time) 17 April 1946 30 March 1949 (deposed) National Bloc / National Party Husni al-Za'im حسني الزعيم 30 March 1949 14 August 1949 (deposed and executed) Military / Syrian Social Nationalist Party Sami al-Hinnawi سامي الحناوي (acting) 14 August 1949 15 August 1949 Military Hashim al-Atassi هاشم الأتاسي (2nd time) 15 August 1949 2 December 1951 National Party Adib Shishakli أديب الشيشكلي (acting) 2 December 1951 3 December 1951 Military / Syrian Social Nationalist Party Fawzi Selu فوزي السلو 3 December 1951 11 July 1953 Military Adib Shishakli أديب الشيشكلي 11 July 1953 25 February 1954 (deposed) Military / Arab Liberation Movement Maamun al-Kuzbari مأمون الكزبري (acting) 26 February 1954 28 February 1954 Independent Hashim al-Atassi هاشم الأتاسي (3rd time) 28 February 1954 6 September 1955 National Party Shukri al-Quwatli شكري القوتلي (2nd time) 6 September 1955 22 February 1958 National Party United Arab Republic (1958–1961) Gamal Abdel Nasser جمال عبد الناصر 22 February 1958 29 September 1961 National Union Syrian Arab Republic (1961–Present) Maamun al-Kuzbari مأمون الكزبري (acting) 29 September 1961 20 November 1961 Independent Izzat an-Nuss عزت النص (acting) 20 November 1961 14 December 1961 Military Nazim al-Kudsi ناظم القدسي 14 December 1961 8 March 1963 (deposed) People's Party Luai al-Atassi لؤي الأتاسي 9 March 1963 27 July 1963 Military / Ba'ath Party (Syria Region) Amin al-Hafiz أمين الحافظ 27 July 1963 23 February 1966 (deposed) Military / Ba'ath Party (Syria Region) Nureddin al-Atassi نور الدين الأتاسي 25 February 1966 18 November 1970 (deposed) Military / Syrian Ba'ath Party (Syria Region) Ahmad al-Khatib أحمد الخطيب (acting) 18 November 1970 22 February 1971 Syrian Ba'ath Party (Syria Region) Hafez al-Assad حافظ الأسد 22 February 1971 10 June 2000 (died in office) Military / Syrian Ba'ath Party (Syria Region) (National Progressive Front) Abdul Halim Khaddam عبد الحليم خدام (acting) 10 June 2000 17 July 2000 Syrian Ba'ath Party (Syria Region) (National Progressive Front) Bashar al-Assad بشار الأسد 17 July 2000 8 December 2024 Syrian Ba'ath Party (Syria Region) (National Progressive Front) Abu Mohammad al-Julani 8 December 2024 Incumbent Tahrir al-Sham ==List of officeholders== ===Second Syrian Republic (1950–1958)=== No. Portrait Name Term of office Political party President(s) Took office Left office Time in office 1 Maamun al-Kuzbari 25 February 1952 28 February 1954 Arab Liberation Movement Fawzi Selu Adib Shishakli ===United Arab Republic (1958–1961)=== No. Portrait Name Term of office Political party President(s) Took office Left office Time in office 2 Sabri al-Asali 7 March 1958 7 October 1958 National Party Gamal Abdel Nasser Akram al-Hawrani 7 March 1958 19 September 1960 Ba'ath Party Abdel Latif Boghdadi 7 March 1958 29 September 1961 National Union Abdel Hakim Amer 7 March 1958 29 September 1961 National Union 3 Nur al-Din Kahala 20 September 1960 29 September 1961 National Union 4 Abdel Hamid al-Sarraj 16 August 1961 29 September 1961 National Union Kamal el-Din Hussein 16 August 1961 29 September 1961 National Union Zakaria Mohieddin 16 August 1961 29 September 1961 National Union Hussein el-Shafei 16 August 1961 29 September 1961 National Union ===Syrian Arab Republic (1961–2024)=== No. Portrait Name Term of office Political party President(s) Took office Left office Time in office 5 Muhammad Umran 8 March 1963 15 December 1964 Ba'ath Party Lu'ay al-Atassi Amin al-Hafiz 6 Nureddin al-Atassi 15 December 1964 28 December 1965 Ba'ath Party 7 Shibli al-Aysami 28 December 1965 23 February 1966 Ba'ath Party 8 Mahmoud al-Ayyubi 22 February 1971 7 August 1976 Syrian Ba'ath Party Hafez al-Assad 9 Rifaat al-Assad 11 March 1984 8 February 1998 Syrian Ba'ath Party Abdul Halim Khaddam 11 March 1984 6 June 2005 Syrian Ba'ath Party Hafez al-Assad Bashar al-Assad Zuhair Masharqa 11 March 1984 21 February 2006 Syrian Ba'ath Party 10 Farouk al-Sharaa 21 February 2006 19 July 2014 Syrian Ba'ath Party Bashar al-Assad 11 Najah al-Attar 23 March 2006 8 December 2024 Syrian Ba'ath Party 12 Faisal Mekdad 23 September 2024 8 December 2024 Syrian Ba'ath Party ==General Secretary of the National Command of the Ba'ath Party (1963-2024)== The General Secretary of the National Command of the Ba'ath Party was the most powerful ocupation in Syria from 9 March 1963 to 18 November 1970 # Name Picture Took office Left office Political Party 1 Michel Aflaq ميشيل عفلق 9 March 1963 April 1965 Ba'ath Party (Syria Region) 2 Munif al-Razzaz منيف الرزاز April 1965 25 February 1966 Ba'ath Party (Syria Region) 3 Nureddin al-Atassi نور الدين الأتاسي (de jure) 25 February 1966 18 November 1970 Military / Syrian Ba'ath Party (Syria Region) 3 Salah Jadid صلاح جديد (de facto) 25 February 1966 18 November 1970 Military / Syrian Ba'ath Party (Syria Region) 4 Hafez al-Assad حافظ الأسد 18 November 1970 10 June 2000 (died in office) Syrian Ba'ath Party (Syria Region) (National Progressive Front) 5 Hafez al-Assad حافظ الأسد (de jure) 10 June 2000 8 December 2024 Syrian Ba'ath Party (Syria Region) (National Progressive Front) 5 Abdullah al-Ahmar عبدالله الأحمر (de facto) 10 June 2000 8 December 2024 Syrian Ba'ath Party (Syria Region) (National Progressive Front) ==Secretary of the Syrian Regional Command of the Ba'ath Party (1963-2024)== The Secretary of the Syrian Regional Command of the Ba'ath Party is the most powerful ocupation in Syria since 18 November 1970 # Name Picture Took office Left office Political Party 1 Hammud al-Shufi حمود آل الشوفي 9 March 1963 1964 Military / Ba'ath Party (Syria Region) 2 Amin al-Hafiz أمين الحافظ 1964 27 May 1964 Military / Ba'ath Party (Syria Region) 3 Shibli al-Aisami 27 May 1964 1965 Military / Ba'ath Party (Syria Region) (2) Amin al-Hafiz أمين الحافظ 1965 25 February 1966 Military / Ba'ath Party (Syria Region) 4 Nureddin al-Atassi نور الدين الأتاسي 25 February 1966 18 November 1970 (deposed) Military / Syrian Ba'ath Party (Syria Region) 5 Hafez al-Assad حافظ الأسد 18 November 1970 10 June 2000 (died in office) Military / Syrian Ba'ath Party (Syria Region) (National Progressive Front) 6 Bashar al-Assad بشار الأسد 10 June 2000 8 December 2024 Syrian Ba'ath Party (Syria Region) (National Progressive Front) ==See also== *List of Vice Presidents of Syria *List of Prime Ministers of Syria *List of Presidents of Parliament of Syria *List of foreign ministers of Syria *President of Syria *Vice President of Syria *Prime Minister of Syria ** *Speaker of the People's Assembly of Syria ==References== ===Citations=== ===Bibliography=== Syria, List of Presidents of Presidents * Syria Presidents",
 "title": "List of heads of state of Syria"
}