{
 "id": "766045",
 "text": "The Super NES Classic Edition (also known as SNES Mini) is a dedicated home video game console. It was released in 2017 by Nintendo. It is the successor to the NES Classic Edition and emulates the Super Nintendo Entertainment System (SNES). The console comes with two controllers. The cables of the controllers are 1.5 meters (5 ft) long. ==Hardware== The console features 720p HDMI display output and controllers that are similar to the original SNES controller. The console also includes an emulation engine developed by Nintendo European Research and Development. === New features and differences compared to the NES Mini === * It is possible to rewind the gameplay by up to 1 minute. * There are 11 border arts. * The console comes with two controllers. * The controllers have longer cables (1.4 m vs 0.7 m). == Games == 21 games are pre-installed on the SNES Mini. It is the first time that Star Fox 2 is officially playable. The games vary between regions. Officially, there is no possibility to add games, But it is possible to hack the console to get more games. === List of games === Games NA/PAL Japan Contra III: The Alien Wars Donkey Kong Country EarthBound F-Zero Final Fantasy VI Fire Emblem: Mystery of the Emblem Kirby Super Star Kirby's Dream Course The Legend of the Mystical Ninja The Legend of Zelda: A Link to the Past Mega Man X Panel de Pon Secret of Mana Star Fox Star Fox 2 Street Fighter II Turbo: Hyper Fighting Super Castlevania IV Super Ghouls 'n Ghosts Super Mario Kart Super Mario RPG Super Mario World Super Metroid Super Punch-Out!! Super Soccer Super Street Fighter II: The New Challengers Yoshi's Island == Reception == Eurogamer praised the games, the support of 60 Hz and the fact that there are two controllers with longer cables in contrast to the NES Classic Mini. Eurogamer also said that the emulation of the SNES Classic Mini is better than that of the Virtual Console. === Sales === The SNES Mini sold 368,913 copies in the first four days in Japan. In October 2017, it had sold more than 2 million units worldwide. By its fiscal year 2017 report, ending March 31, 2018, the SNES Classic sold more than 5 million times. The NES and SNES Classic editions sold more than 10 million units by September 30, 2018. == Gallery == File:Nintendo Classic Mini Super Nintendo Entertainment System - Front.jpg|Front side File:Nintendo Classic Mini Super Nintendo Entertainment System - LS.jpg|Left side File:Nintendo Classic Mini Super Nintendo Entertainment System - Back.jpg|Back side File:Nintendo Classic Mini Super Nintendo Entertainment System - RS.jpg|Right side File:Nintendo Classic Mini Super Nintendo Entertainment System - Open.jpg|Opened front side File:Nintendo Classic Mini Super Nintendo Entertainment System - U.jpg|Bottom side File:Nintendo Classic Mini Super Nintendo Entertainment System - CF.jpg|Front side of the controller File:Nintendo Classic Mini Super Nintendo Entertainment System - CB.jpg|Back side of the controller == Future == Nintendo said that there are no plans for a Nintendo 64 Classic Mini. Doug Bowser, President of Nintendo of America, said that \"Our focus right now is absolutely on our dedicated platforms such as Nintendo Switch Lite and our flagship Nintendo Switch.\" Reggie Fils-Aimé said \"For us, these were limited time opportunities that were a way for us as a business to bridge from the conclusion of Wii U as a hardware system to the launch of Nintendo Switch. That was the very strategic reason we launched the NES Classic system.\" == Notes == == References == == Other websites == * Official website Category:Nintendo video game consoles",
 "title": "Super NES Classic Edition"
}