{
 "id": "766378",
 "text": "Alisher Burkhanovich Usmanov (; ; born 9 September 1953) is an Uzbek-Russian billionaire. As reported by Forbes in 2020, Alisher Usmanov has a net worth of $11.68 billion. Usmanov built his wealth through metal and mining operations, and investments, and is one of the shareholders of Metalloinvest. He owns the Kommersant publishing house. He is also a co‑owner of Russia's second-largest mobile telephone operator, MegaFon, Akkerman Cement and Udokan Copper. He has been President of the International Fencing Federation (FIE) since 2008. In 2022, he temporarily suspended his functions. Alisher Usmanov grew up in a Muslim family in Choust, eastern Uzbekistan. He is the son of Burhon Usmanov, who worked as a prosecutor of the city of Tashkent. He graduated from the Moscow State Institute of International Relations. In the 1980s, he was convicted of corruption and spent 6 years in prison. The Supreme Court of Uzbekistan found his sentence false and illegal and overturned this conviction in 2000. Alisher Usmanov was rehabilitated. Usmanov made his fortune in the metal industry. From 1994 to 1998, Usmanov headed Interfin, an investment and finance company. At that time, he began investing in shares of metallurgical companies. In 2006, all metallurgical assets were grouped together in a holding company under the name Metalloinvest. He has owned large stakes in technology companies (including Facebook and Apple). He also owned a stake in Arsenal Football Club. In 2012, USM Holding was created. The main assets of Alisher Usmanov and his partners (Metalloinvest, Megafon, Udokan Copper, Akkerman Cement) became part of the holding company. Usmanov's share in the holding company is 49%. At the same time, the billionaire announced his intention to retire from business and devote himself to charitable activities. In 2021, the Sunday Times named Usmanov the most generous philanthropist. In the 20-year history of the Sunday Times' giving list, he has donated more than £4.2 billion to charity personally and through his companies. On Feb. 28, 2022, in reaction to the Russian invasion of Ukraine, the European Union blacklisted Usmanov and imposed an EU-wide travel ban on him and freezed all his assets. On March 3, the United States imposed similar sanctions on him, with some exceptions for his companies. As a result of the sanctions against him, on March 1, 2022, he temporarily suspended his functions as president of FIE. Usmanov denies all allegations. He filed an appeal in the European Court of Justice in an attempt to lift the sanctions. ==References== Category:1953 births Category:Living people Category:Russian businesspeople Category:Billionaires Category:Uzbekistani people",
 "title": "Alisher Usmanov"
}