{
 "id": "76644",
 "text": "The capybara or Greater capybara (Hydrochoerus hydrochaeris) is a semi-aquatic rodent native to South America. It weighs about a hundred pounds, and is about tall at the shoulder. The capybara is the world's largest rodent. Capybaras are closely related to guinea pigs and to chinchillas. When they are full- grown, they weigh about 55 kg, or 100 pounds. The capybara's stocky body is about long, and its shoulder is about high off the ground. Females are usually bigger and heavier than males. The top recorded weights are for a wild female from Brazil and for a wild male from Uruguay. Capybaras have brown or reddish- brown fur. When they are old their fur is thin, their skin can get sunburned easily. Their eyes and ears and nostrils are high on their heads, so they can easily be kept above water when the capybara is swimming. It is a giant cavy rodent living in South America. == Lifestyle == Capybaras live in grassy wetlands or close to rivers in many parts of South America. They are land animals who eat grass as their main source of nutrition. They spend the hottest hours of the day in the water. They are good swimmers and divers. Webs between their toes help them swim. They can only hold their breath underwater for about five minutes at a time. Sometimes they hide in water for much longer, with only their noses sticking out to breathe. Many predators like to eat them. They are a favorite food for jaguars, eagles, anaconda snakes, and many other animals. Capybaras eat plants, mostly grass. Their babies are usually born in litters of four at one time. They can start to eat grass once they are about a week old, but they will also keep nursing from their mothers and even from other grown females until they are about four months old. They live in large groups, usually 10-30 capybaras together. Some groups even have 100 capybaras. They talk to each other using many sounds: clicks, grunts, whistles, and barks. == Conservation and contact with humans == Capybaras are not endangered. Their population is stable, not increasing or decreasing very much. They can live in towns or zoos. Humans can touch them, but it is not common, as it can cause disease. Sometimes humans eat capybaras. They are hunted for meat, and sometimes they are raised on farms. Also, their tough skin is sometimes used to make high quality leather, especially for gloves. Capybaras are sometimes kept as pets. They can be kept as pets in the United States, but due to their classification as exotic animals, it is illegal to own them as pets in some states as well as Washington D.C. [see notes below]. They are also very liked in Japan, and are kept as pets there too. == Notes == == References == Category:Rodents Category:Mammals of South America",
 "title": "Capybara"
}