{
 "id": "766830",
 "text": "Garúa is a Spanish word meaning drizzle or mist. Most often, garúa is used to refer to the moist cold fog that occurs on the coasts of Peru, southern Ecuador, and northern Chile, during the winter months. Garúa is called Camanchaca in Chile. These coastal regions in Peru, Ecuador and Chile have a desert climate. There's almost no rain during the year. Garúa brings mild temperatures and high humidity. It also provides moisture from fog and mist to a nearly-rainless region. The places where there's often fog also have more vegetation. They are called fog oases, or lomas. Fog and drizzle are common on the coast, and near lakes. In the case of garùa, its impact on the climate is unique. == How it forms == The Humboldt Current runs along the coast. It brings cold waters. It is responsible for both the desert-like climate and the garùa. The area covers the coasts of Peru and Chile from latitudes 5° to 30° South, a north-south distance of roughly . The Humboldt Current brings mild temperatures and high humidity to a very arid region. The cold waters create an inversion: the air near the ocean surface is cooler than the air above, contrary to most climatic situations. The trade winds blow the cool air and fog eastward over coastal areas, where the fog transforms into drizzle and mist, the garúa.Beresford-Jones, David et al (2015), \"Re-evaluating the resource potential of lomas fog oasis environments for Preceramic hunter- gatherers under past-ENSO modeson the south coast of Peru,\" Quaternary Science Reviews, Vol. 129, p. 198 Garúa is a dense fog that does not produce rain. The water droplets in the fog measure between 1 and 40 microns across, too fine to form rain. == Impact on climate == The impact of the Humboldt Current and the garúa it produces is substantial. Lima, Peru is near sea level. The city is located at 12° south latitude. It is in the tropics and would in most climatic situations have average temperatures of or higher in every month of the year. By contrast, Lima has monthly average temperatures that range from (January through March) in the warmest months and in the coolest months of July through September, the months in which the garúa is most frequent. The impact on sunshine is even more important. Only 34 percent of daylight hours in Lima have sunshine every year. On average, July and August receive less than one hour a day of sunshine. Lima receives only 1,230 hours of sunshine per year. By contrast, London, notoriously cloudy and foggy, gets 1,573 hours of sunshine annually and New York City receives 2,535 hours of sunshine annually. The climate of Lima is typical of the coasts of Peru and northern Chile. Nineteenth-century American author, Herman Melville called Lima “the strangest, saddest city thou cans’t see.\", because of the garùa clouds and mist in winter. Twenty-first century Lima, on the oher hand, has a flourishing tourist trade and has been described as having a \"hidden loveliness.\" The desert coast on the 1700 mile north south stretch is very dry: On average, it gets less than of precipitation per year. Some areas may go without rain for many years. Only the moisture condensed from the garùa clouds -- plus occasional El Niño events -- enables islands of vegetation to be present in the lomas dotted up and down the Peruvian and Chilean coasts. Except for the lomas and river valleys draining the higher and more humid Andes the coastal desert has almost no vegetation. The garúa extends only a few kilometers inland. It dissipates over land especially where it coalesces against mountain slopes at elevations of to , the altitudes at which the vegetated lomas are found. == Fog collection == In the area, water is scarce, and scientis have found a way to collect water from from the moisture-laden garúa. In Chile, in 1985, scientists devised a fog collection system: They used nets to capture the water droplets in the fog. These nets are made of a special material, polyolefin. That way, it is possible to produce running water for villages in these otherwise desert areas. The Camanchacas Project installed 50 large fog- collecting nets on a mountain ridge, which captured some 2% of the water in the fog. In 2005, another installation of panels of produced per square meter per day. In Peru there is an effort to preserve the fragile ecosystem of the garúa-watered lomas. Conservation groups have installed fog-catching nets in the Atiquipa District to capture water and help the 80 families who live within the area to expand agriculture, primarily of olives. == References == == Related pages == * Fog * Geography of Peru Category:Precipitation Category:Geography of Chile Category:Geography of Peru Category:Pages with unreviewed translations",
 "title": "Garúa"
}