{
 "id": "76688",
 "text": "The House of Windsor is the current Royal House of the United Kingdom of Great Britain and Northern Ireland and each of the other Commonwealth realms. It replaces the now-extinct British Branch of the House of Saxe-Coburg and Gotha. ==Descendants of Victoria== Queen Victoria married Prince Albert, a son of Duke Ernst I of Saxe-Coburg and Gotha. Therefore her descendants are members of the ducal family of Saxe-Coburg and Gotha. Victoria's eldest son, Edward VII and his son George V reigned as members of this house. But during World War I there was a lot of hatred of anything German. A lot of this feeling was stirred up by newspapers. People with German names were beaten up, and shops with German names had their windows broken. Even the Royal Family were accused of supporting Germany. On 17 July 1917 George V ordered the Royal Family to give up their German titles, and change German-sounding titles and house names for English-sounding versions. Prince Louis of Battenberg became Lord Louis Mountbatten. The Duke of Teck became the Marquis of Milford Haven and the name of the royal house, and the royal surname was changed to Windsor, after the town of Windsor and Windsor Castle. When he heard about the change of name, German Emperor William II joked that he wanted to see Shakespeare's play The Merry Wives of Saxe-Coburg-Gotha. ==Descendants of Queen Elizabeth II== In April 1952, Queen Elizabeth II said that her descendants will keep the name and House of Windsor. On 8 February 1960, the Queen decided instead to keep the House and Family of Windsor, however for non-royal male line descendants, the surname \"Mountbatten-Windsor\" was created. Mountbatten is the surname adopted by Prince Philip before his marriage, an anglicization of his mother's family name of Battenberg. ==List of monarchs in the House of Windsor== #King George V of the United Kingdom (died 1936) #King Edward VIII of the United Kingdom abdicated (died 1972) #King George VI of the United Kingdom (died 1952) #Queen Elizabeth II of the United Kingdom (died 2022) #King Charles III of the United Kingdom (2022-) The next in line for the throne is Prince William; if so he may be known as King William V of the United Kingdom. ==Related pages== * British Royal Family * Windsor, Berkshire ==Further reading== *Longford, Elizabeth Harman (Countess of Longford). The Royal House of Windsor. Revised ed. Crown, 1984. *Roberts, Andrew. The House of Windsor. University of California Press, 2000. ==Other websites== * Royal Family Name from royal.gov.uk * House of Windsor from royal.gov.uk * Royal Family of Great Britain including the Houses of Hanover, Saxe-Coburg and Gotha and Windsor.",
 "title": "House of Windsor"
}