{
 "id": "767011",
 "text": "Eleanor Stackhouse Atkinson (1863 – November 4, 1942) was an American author, journalist and teacher. == Early years == She was born Eleanor Stackhouse in Rensselaer, Indiana. She then married the author called Francis Blake Atkinson. The couple had children called Dorothy Blake (b. 1892) and Frances Eleanor (b. 1899). == Career == She taught in schools in both Indianapolis and Chicago. She wrote for the Chicago Tribune under the name Nora Marks from 1888 to 1890. She then became publisher of the Little Chronicle Publishing Company. The Little Chronicle Publishing Company published some of her own work, other educational books and the Little Chronicle. The Little Chronicle was an newspaper for young children with pictures. She wrote both story books and fact books. The story books were mostly love stories and the fact books were mostly educational books. Eleanor Atkinson is best known for her 1912 story book called Greyfriars Bobby. This popular book told the well known story of the dog called Greyfriars Bobby. It is set in Edinburgh, in Scotland. New versions of the story copy some the story that Eleanor Atkinson wrote. Many details of the book, such as the details of the dog's master are wrong. It was thought that Eleanor Atkinson didn't visit Edinburgh. It seems like she used the basic story and added parts from her own imagination. The story is very detailed, but the descriptions of the geography are sometimes wrong. Eleanor Atkinson tried to get names correct, and to get across the atmosphere of the city. Unusually for someone with who had not been to the country or had no family from Scotland, her knowledge of the local accent was good. So Eleanor Stackhouse may have been told the story by Scottish immigrants to the Midwest, USA. : \"I wullna gang to the infairmary. It's juist for puir toon bodies that are aye ailin' an' deein'.\" Fright and resentment lent the silent old man an astonishing eloquence for the moment. \"Ye wadna gang to the infairmary yer ainsel', an' tak' charity.\" The book is often considered a classic, especially for children. It has been reprinted several times. The book was the basis for the films called Challenge to Lassie (MGM, 1949)Challenge to Lassie (1949): IMDB.com website. Retrieved on January 23, 2008. and Greyfriars Bobby (Disney, 1961),.Greyfriars Bobby: The True Story of a Dog (1961): IMDB.com website. Retrieved on January 23, 2008. These films were made after her death. Both films starred Donald Crisp. == Personal life == Blake's daughter, Eleanor Blake, wrote a detective story called Death Down East (1942). Eleanor Blake's son, who is Eleanor Atkinson's grandson, was the movie and television actor Wally Cox. == Selected works == * Mamzelle Fifine : A Romance of the Girlhood of the Empress Josephine on the Island of Martinique (1903) * Boyhood of Lincoln (1908) (also published as Lincoln's Love Story) * Story of Chicago and National Development, 1534-1910. (1910) * New Student's Reference Work for Teachers, Students and Families (1911) * Greyfriar's Bobby (1912) * Loyal Love (1912) * Johnny Appleseed: The Romance of the Sower (1915) * Pictured Knowledge; Visual Instruction Practically Applied for the Home and School (1916) * Hearts Undaunted : A Romance of Four Frontiers (1917) * \"Poilu,\" a Dog of Roubaix. (1918) == References == ==Other websites== * * * Eleanor Atkinson: a tribute site by Inez Visser Category:1863 births Category:1942 deaths Category:American children's writers Category:Writers from Indiana",
 "title": "Eleanor Stackhouse Atkinson"
}