{
 "id": "76725",
 "text": "The Eulipotyphla is an order of mammals.Hutterer, Rainer; Wilson, Don E and Reeder, DeeAnn M. (eds) 2005. Mammal species of the World. 3rd ed, Baltimore: Johns Hopkins University Press, 2 vols, pp. 212–311. It was formed from those insectivorous mammals which are monophyletic, a single clade. The old order Insectivora is now abandoned because it was polyphyletic. The new order Eulipotyphla has been shown to be monophyletic. The term insectivorous (insect eating) can still be used to describe lifestyle. It explains the food habits of this and some other groups of mammals, They are more closely related to Carnivora (cats, dogs, bears), Pholidota (pangolins), Chiroptera (bats), and Perissodactyla (equids). As part of the superorder Laurasiatheria. ==Lifestyles== Although moles and shrews are not all strictly insectivorous, insects and other small animal life make up the main food of most members of the group. Some kinds, the otter shrews of Africa and the star-nosed mole of North America, for example, feed also upon fish. The Townsend mole of the Pacific Northwest often is a nuisance to bulb growers because of its fondness for the bulbs of many kinds of plants. Moles, as a group, are subterranean in habit. They spend most of their lives in the darkness of underground tunnels which they dig for themselves. The eyes of all moles are very small, in some species actually not opening to the outside, and of little value to them: vestigial organs. On the other hand, their senses of touch and smell are highly developed. ==Classification== * ORDER Eulipotyphla (old 'Insectivora') ** Family Erinaceidae *** Subfamily Erinaceinae: hedgehogs *** Subfamily Hylomyinae: moonrats and gymnures ** Family Soricidae (true shrews) *** Subfamily Crocidurinae: white-toothed shrews *** Subfamily Soricinae: red- toothed shrews *** Subfamily Myosoricinae: African white-toothed shrews ** Family Talpidae *** Subfamily Desmaninae: desmans *** Subfamily Talpinae: moles *** Subfamily Uropsilinae: shrew moles ** Family Solenodontidae: solenodons ** Family Nesophontidae: extinct West Indian shrews ==Discards== The following groups are now placed in other orders: :* Order Afrosoricida :** Suborder Chrysochloridea :*** Family Chrysochloridae (golden moles) :** Suborder Tenrecomorpha :*** Family Tenrecidae (tenrecs) :* Order Macroscelidea :** Family Macroscelididae (elephant shrews) :* Order Scandentia :** Family Tupaiidae (treeshrews) :* Order Dermoptera :** Family Cynocephalidae (colugos) ==References== Notes",
 "title": "Eulipotyphla"
}