{
 "id": "767375",
 "text": "Some scientists sorted human beings into three groups. These groups were called races: The Caucasian race living in Europe, North Africa and West Asia, the Mongoloid race living in East Asia, Australia, and the Americas, and the Negroid race living in Africa south of the Sahara. Other scientists spoke of four or five races. These ideas were popular from the late 18th century to the middle of the 20th century. These are now called historical definitions of race or historical race concepts. Today, scientists agree that there is only one human race. Modern genetic research has shown that the idea of three (or four, or five) races was wrong.Templeton A. 2016. Evolution and notions of human race. In Losos J. & Lenski R. (eds) How evolution shapes our lives: essays on biology and society (pp. 346-361). Princeton; Oxford: Princeton University Press. . That this view reflects the consensus among American anthropologists is stated in: == 19th century == Johann Friedrich Blumenbach's classification, first proposed in 1779,The anthropological treatises of Johann Friedrich Blumenbach. Google Books The anthropological treatises of Johann Friedrich Blumenbach was widely used in the 19th century, with many variations. * Ethiopian/black race. * Caucasian race/white race * Mongolian/yellow race * American/red race * Malayan/brown race == Middle of the 20th century == The mid-twentieth century racial classification by American anthropologist Carleton S. Coon, also used five races but divided some of them differently: * Negroid (Black) race * Australoid (Australian Aborigine and Papuan) race * Capoid (Bushmen/Hottentots) race * Mongoloid (Oriental/Amerindian) race * Caucasoid (White) race == Racism == There was much prejudice based upon this way of thinking and speaking. It argued that in the races that make up the human race, there are deep, biologically determined differences. Someone who partakes in racism is called racist. These are the attitudes that in turn supported the horrors of African slavery, Apartheid, the Jim Crow laws, Nazism, and other crimes against humanity. == Problems with defining races == As described above, people tried to define \"races\", but they had many problems. In 1797, Johann Friedrrich Blumenbach wrote in his manual Handbuch der Naturgeschichte that he was unable to differentiate between different kinds of black people, such as Abessynians and Moors. Charles Darwin similarly wrote that he was unable to find significant differences between races.\"It may be doubted whether any character can be named which is distinctive of a race and is constant... they graduate into each other, and.. it is hardly possible to discover clear distinctive characters between them... As it is improbable that the numerous and unimportant points of resemblance between the several races of man in bodily structure and mental faculties (I do not here refer to similar customs) should all have been independently acquired, they must have been inherited from progenitors who had these same characters.\", Charles Darwin, The Descent of Man p. 225 onwards There are also other problems: Scientists say that the concept of a \"race\" is not useful or necessary for research. They cannot agree on the definition of what a given race is, and they do not even agree on the number of races. After discussing various criteria used in biology to define subspecies or races, Alan R. Templeton concludes in 2016: \"[T]he answer to the question whether races exist in humans is clear and unambiguous: no.\" == References == Category:Anthropology Category:Humans Category:Historical races Category:Ethnic groups",
 "title": "Historical race concepts"
}