{
 "id": "767397",
 "text": "This is a list of the county territorial divisions in the Canadian province of New Brunswick. !n 1966 the New Brunswick Equal Opportunity program brought about the end of the counties. Since they no longer serve an administrative role, they are historical. In law, the fifteen county regions and their divisions continued. The Territorial Divisions Act of New Brunswick is the legislation that describes the county regions and their towns. Today they are used as census units, and for registration of real-estate. Because the county area is in use by Statistics Canada as a census division, we know their populations. Also, former county seats (known in the province as shire towns) are included in the list. A lot of New Brunswickers know which county they are in, and there are road signs that continue to mark some boundaries. Maps continue to depict the county regions. In the English period of Canadian history, New Brunswick territory was part of Nova Scotia, when it was included in Cumberland and Sunbury Counties. Counties were at the top of a three-layer government system which saw appointments of officials and members of governors assembly. After the split of the provinces in 1784 following the Revolutionary War and Loyalist emigration, the original eight counties were created. Saint John and County was the first city to receive a Royal Charter in the colonial Maritime Provinces. County Name Population, 2021 Population, 2016 Population, % change Shire town (County seat) Land area (km2) Population density (per km2) Formation Albert County 30,749 29,158 5.5 Hopewell Cape 1806.23 17.0 Formed in 1845 from part of Westmorland County and a small part of Saint John County. Carleton County 26,360 26,178 0.7 Woodstock 3309.06 8.0 Formed in 1831 from part of York County. Charlotte County 26,015 25,428 2.3 St. Andrews 3418.24 7.6 One of the original 8 counties. Gloucester County 78,256 78,444 -0.2 Bathurst 4734.30 16.5 Formed in 1826 from part of Northumberland County. Kent County 32,169 30,475 5.6 Richibucto 4550.38 7.1 Formed in 1826 from part of Northumberland County. Kings County 71,184 68,941 3.3 Hampton 3482.35 20.4 One of the original 8 counties. Madawaska County 32,603 32,741 -0.4 Edmundston 3454.97 9.4 Formed in 1873 from part of Victoria County. Northumberland County 45,005 44,952 0.1 Newcastle, now part of Miramichi 12843.39 3.5 One of the original 8 counties. Queens County 10,998 10,472 5.0 Gagetown 3681.05 3.0 One of the original 8 counties. Restigouche County 30,700 30,955 -0.8 Dalhousie 8566.82 3.6 Formed in 1837 from part of Gloucester County. Saint John County 76,558 74,020 3.4 Saint John 1461.05 52.4 One of the original 8 counties. Sunbury County 27,864 27,644 0.8 Burton 2692.97 10.3 One of the original 8 counties. Victoria County 18,312 18,617 -1.6 Andover, now part of Perth- Andover 5492.85 3.3 Formed in 1844 from part of Carleton County. Westmorland County 163,576 149,623 9.3 Dorchester 3659.74 44.7 One of the original 8 counties. York County 105,261 99,453 5.8 Fredericton 8095.10 13.0 One of the original 8 counties. ==References== ==Other websites== * New Brunswick Parishes * New Brunswick Communities Past and Present: County Listing New Brunswick",
 "title": "List of counties of New Brunswick"
}