{
 "id": "767448",
 "text": "Admiral of the Fleet Louis Francis Albert Victor Nicholas Mountbatten, 1st Earl Mountbatten of Burma, (born Prince Louis of Battenberg; 25 June 1900 - 27 August 1979), known informally as Lord Mountbatten, was a British statesman and naval officer, an uncle of Prince Philip, Duke of Edinburgh, and second cousin once removed to Elizabeth II. ==Early life== Mountbatten, then named Prince Louis of Battenberg, was born on 25 June 1900 in the Home Park, Windsor, Berkshire. He was the youngest child and the second son of Prince Louis of Battenberg and his wife Princess Victoria of Hesse and by Rhine. Mountbatten's maternal grandparents were Louis IV, Grand Duke of Hesse, and Princess Alice of the United Kingdom, who was a daughter of Queen Victoria and Prince Albert of Saxe-Coburg and Gotha. His paternal grandparents were Prince Alexander of Hesse and by Rhine and Julia, Princess of Battenberg. Mountbatten's oldest siblings were Princess Alice of Battenberg (mother of Prince Philip, Duke of Edinburgh), Princess Louise of Battenberg (later Queen Louise of Sweden), and Prince George of Battenberg (later George Mountbatten, 2nd Marquess of Milford Haven). Mountbatten was educated at home for the first 10 years of his life; he was then sent to Lockers Park School in Hertfordshire. and on to the Royal Naval College, Osborne, in May 1913.. ==Military career== He was involved in World War 1 in the Navy from 1914-1918 fighting against the German Empire led by Kaiser Wilhelm II . He was also fighting against the Empire of Japan (Japanese Empire) led by Emperor Hirohito and Nazi Germany (Third Reich ) led by Adolf Hitler and the Italian Empire led by Mussolini during World War 2 from 1939-1945 in the Royal Navy. He served in the Navy from 1913-1965 from the prelude of World War 1 in 1913 to the Post World War 2 Era during the Cold War in 1965. ==Civil service== In February 1947, Mountbatten was made Viceroy and Governor-General of India. He was in charge during the Partition of India into India and Pakistan. He then served as the first Governor-General of the Union of India until June 1948 and played an important role in talking to the princely states to accede to India. In 1952, Mountbatten was made commander-in-chief of the British Mediterranean Fleet and NATO Commander Allied Forces Mediterranean. From 1955 to 1959, he was First Sea Lord, a position that had been held by his father, Prince Louis of Battenberg, some forty years earlier. He was the chief of the Defence Staff until 1965, making him the longest-serving professional head of the British Armed Forces to date. During this period Mountbatten also served as chairman of the NATO Military Committee for a year. In a 1987 book, Spycatcher, it was said that in May 1968 Mountbatten went to a private meeting with press baron Cecil King and the government's Chief Scientific Adviser, Solly Zuckerman. The book said that \"up to thirty\" MI5 officers had joined a secret campaign work against the Labour government of Harold Wilson. In the meeting, it was said that many people wanted Mountbatten to become the leader of a government and lead a coup d'état. It was also said that the Queen had to talk Mountbatten out of plotting against Wilson. Several historians also said that Mountbatten wanted to use a private military and members of the MI5 to remove Wilson from power. ==Personal life== Mountbatten was married on 18 July 1922 to Edwina Cynthia Annette Ashley, daughter of Wilfred William Ashley. Lord and Lady Mountbatten had two daughters: Patricia Knatchbull, and Lady Pamela Hicks. After Edwina died in 1960, Mountbatten was involved in relationships with young women. He had a long-running affair with American actress Shirley MacLaine, whom he met in the 1960s. ==Assassination== On 27 August 1979, Mountbatten was assassinated by a bomb planted aboard his fishing boat in Mullaghmore, County Sligo, Ireland, by members of the Provisional Irish Republican Army. The boat was destroyed by the force of the blast and Mountbatten's legs were almost blown off. Mountbatten, then aged 79, was pulled alive from the water by nearby fishermen, but died from his injuries before being brought to shore.. Mountbatten received a ceremonial funeral at Westminster Abbey and was buried in Romsey Abbey in Hampshire. ==References== ==Other websites== * Mountbatten at unit-histories.com * Combined operations information * Information on the sinking of the German submarine U-35 * Mountbatten assassination information * mountbattenofburma.com - Tribute & Memorial web-site to Louis, 1st Earl Mountbatten of Burma * The Mountbatten School * Mountbatten Internship Programme Category:1900 births Category:1979 deaths Category:British admirals Category:Assassinated English politicians Category:Irish Republican Army Category:People from Berkshire Category:People murdered in Europe Category:Members of the House of Lords Category:Governors- general of India Category:United Kingdom Earls Category:Lord-lieutenants",
 "title": "Lord Mountbatten"
}