{
 "id": "76748",
 "text": "The Duchy of Saxe-Weimar-Eisenach () was created in 1809 when the Ernestine duchies of Saxe-Weimar and Saxe-Eisenach were formally joined into one state. The two duchies had shared the same ruler since 1741, which is when the Saxe- Eisenach line had died out. It became a Grand Duchy in 1815. In 1877, the Grand Duchy of Saxe-Weimar-Eisenach officially became the Grand Duchy of Saxony (), but this name was not often used. The Grand Duchy was abolished in 1918 with the other German monarchies, and the state joined others to form the new state of Thuringia in the Weimar Republic. The Grand Dukes full title was Grand Duke of Saxe-Weimar-Eisenach, Landgrave in Thuringia, Margrave of Meißen, Princely Count of Henneberg, Lord of Blankenhayn, Neustadt and Tautenburg. == Rulers of Saxe-Weimar-Eisenach == === Dukes of Saxe-Weimar- Eisenach, 1809 – 1815 === * Carl August, 1809 – 15; Duke of Saxe-Weimar and of Saxe-Eisenach from 1758 === Grand Dukes of Saxe-Weimar-Eisenach, 1815 – 1918 === * Carl August, 1815 – 28 * Carl Friedrich, 1828 – 53 * Carl Alexander, 1853 – 1901 * Wilhelm Ernst, 1901 – 18 === Heads of the House of Saxe-Weimar- Eisenach, 1918 – present === * Grand Duke Wilhelm Ernst, 1918 – 23 * Hereditary Grand Duke Carl August, 1923 – 88 * Prince Michael, 1988 – presentCarl August was born as the heir apparent to the Grand Duchy, so he was always known as Hereditary Grand Duke Carl August. Prince Michael was born after the Grand Duchy was abolished, and is called Prince Michael as he has never reigned as Grand Duke. ==Related pages== * Ernestine duchies == References == == Other websites == * Category:1809 establishments Category:1918 disestablishments in Germany Category:House of Wettin Category:States of the Confederation of the Rhine Category:States of the German Confederation Category:States of the German Empire Category:States of the Holy Roman Empire Category:States of the North German Confederation Category:States of the Weimar Republic Category:Thuringia Category:Weimar Category:1800s establishments in Germany",
 "title": "Saxe-Weimar-Eisenach"
}