{
 "id": "767517",
 "text": "The M60, also called the Manchester Ring Motorway or the Manchester Outer Ring Road, is a motorway. It is a ring road around Manchester, England, as well as other towns nearby. The M60 is about long. The M60 was created in 2000 by using old parts of the M62, M66, and all of the M63. ==Junctions== M60 motorway junctions mile km Anti-clockwise exits (B Carriageway) Junction Clockwise exits (A Carriageway) 0.0 0.0 Stockport (West & Centre) A5145 J1 Stockport (West) A5145 1.5 2.4 Cheadle A560 J2 No access (on-slip only) Cheadle, Wilmslow A34 J3 Cheadle, Wilmslow A34 No access (on-slip only) J4 Chester, Warrington, Manchester , Birmingham (M6) M56 4.5 7.3 Chester, Manchester , Birmingham (M6) A5103 (M56) J5 Manchester (C), Didsbury A5103 6.0 9.7 Sale A6144 J6 Sale A6144 6.8 10.9 Manchester (C), Stretford, Altrincham A56 J7 Altrincham, Manchester (C), Stretford A56 7.5 12.0 End of variable speed limit J8 Carrington A6144 7.5 12.0 Carrington A6144 J8 Start of variable speed limit 9.3 15.0 Trafford Park, Trafford Centre A5081 J9 Urmston B5158, Trafford Park A5081 10.3 16.5 Trafford Park, Urmston B5214 J10 Trafford Park B5214 11.4 18.4 Eccles, Irlam A57 J11 Irlam, Eccles A57 12.2 19.7 Manchester (C), Salford M602 (M6), Liverpool M62 J12 Liverpool, Warrington M62 Manchester (C), Salford M602 13.0 21.0 Swinton A572, Worsley A575 J13 Worsley, Leigh A575, Swinton A572 14.1 22.7 St. Helens, Leigh A580 J14 No access (on- slip only) (M6 North), Preston, Wigan, Bolton M61 J15 Preston, Wigan, Bolton M61 16.3 26.2 Salford, Kearsley A666 J16 No access (on-slip only) 18.5 29.7 Manchester City Centre, Prestwich, Whitefield A56 J17 Whitefield, Prestwich A56 19.8 31.8 Start of variable speed limit J18 TOTSO Burnley, Bury M66 Leeds, Huddersfield M62 19.8 31.8 Leeds M62 Bury, Burnley, Blackburn M66 J18 TOTSO End of variable speed limit 21.0 33.8 Middleton A576 J19 Manchester City Centre, Middleton A576 22.6 36.4 No access (on-slip only) J20 Middleton, Blackley A664 24.7 39.8 Rochdale, (A627(M)), Chadderton (A663) J21 Manchester City Centre, Chadderton (A663) 26.3 42.3 Manchester City Centre, Oldham A62 J22 Oldham A62 28.6 46.0 Ashton-under-Lyne A6140 J23 Ashton-under-Lyne A635 30.6 49.3 Manchester City Centre, Denton A57, Hyde, Sheffield (M67) J24 Denton A57, Hyde, Sheffield (M67) Manchester City Centre A57 Bredbury A560 J25 Bredbury A560 No access J26 Stockport (E&C;) A560 Stockport (East) A560 J27 No access (on-slip only) 36.1 58.1 Motorway continues to J1 ==References== Category:Motorways in England Category:Buildings and structures in Greater Manchester",
 "title": "M60 motorway"
}