{
 "id": "767617",
 "text": "Clicker Heroes is a free-to-play video game. Playsaurus made it. It is an idle game. Clicker Heroes is a spinoff of the Playsaurus game Cloudstone. Clicker Heroes was released in 2014 for web browsers. It was also released for phones in 2015. In 2017, it was released for the Xbox One and PlayStation 4 gaming consoles. == Gameplay == Players play Clicker Heroes by clicking on creatures (known as “monsters”) to kill them. Monsters give gold when the player kills them. Players can use gold to buy heroes. These automatically kill monsters. Clicker Heroes works without the need for the player to do anything. == Release == Clicker Heroes was released on the gaming website Kongregate in August 2014. It was also released on Armor Games in September 2014. Clicker Heroes was released onto the Steam platform in May 2015 for Microsoft Windows and OS X. On August 20, 2015, it was also released for iOS and Android. == Reception == Critics quite liked Clicker Heroes. Nathan Grayson of Kotaku called it “[a] perfect office space distraction”. Christian Donlan, a writer for Eurogamer, said that the game was his “office secret” and that it was very addictive. Sammy Barker of Push Square gave Clicker Heroes a score of 5/10. Because Clicker Heroes was well-liked on Steam, there are now many other idle games on that platform. == Second game == Playsaurus made a second Clicker Heroes game called Clicker Heroes 2. Unlike the first Clicker Heroes, Clicker Heroes 2 is not free-to-play. == Legal issues == Clicker Heroes was removed for a short time from the Apple App Store in May 2019. This was because a Chinese company made a clone of Clicker Heroes. They then asked Apple to take the original version of the game off the app store. == Related pages == *Cloudstone == References == == Other websites == * Category:2014 video games Category:Android (operating system) games Category:Flash games Category:Free- to-play video games Category:Incremental games Category:IOS games Category:MacOS games Category:PlayStation 4 games Category:Single-player video games Category:Video games developed in the United States Category:Windows games Category:Xbox One games",
 "title": "Clicker Heroes"
}