{
 "id": "767656",
 "text": "Andrew Ryan is a fictional character and an important villain from the video game BioShock. He is the creator of Rapture, the city where BioShock takes place. He is based on the real-life author Ayn Rand. Like Ayn Rand, Andrew Ryan is an atheist and an objectivist. Objectivism is the belief that everything people do should only be done if it helps their own self-interest. Andrew Ryan hates people whom he calls \"parasites\", or people who take away the money or the goods that other people worked hard to make. == Biography == Andrew Ryan was born as Andrei Rayanovskiy in the Russian Empire. He was a boy when the Russian Revolution happened. After the revolution, the Bolsheviks took away his family business and killed his family. This made him hate communism because he believed that it was a government and economic system made by \"parasites\". A few years after the revolution, he fled to America. He really liked capitalism because it was an economic system where people could keep the money and goods they worked for. However, during the Great Depression, President Franklin D. Roosevelt made a lot of government programs to help poor people. Andrew Ryan hated this because he did not like that people would be forced to give away money and goods to poor people who did not work for it. During the New Deal, Andrew Ryan felt that there was no good place on Earth where people could keep all the money and goods they worked hard for. Since he could not find such a place, he decided to make such a place himself. In 1946, he began building the underwater city of Rapture. In 1951, the city was completed. Andrew Ryan looked for smart and talented people who did not like the governments or religions on the surface and allowed them to live in Rapture. People came to Rapture because Andrew Ryan made it to be a place where people could do or become anything they wanted if they worked hard for it. At first, Rapture developed very quickly because there were many smart scientists who could do any research they wanted. However, after a few years the wealth gap between rich and poor became very wide. This allowed Frank Fontaine to help the poor so that he could begin to control Rapture. Afraid that Fontaine was become too powerful, Ryan took away many rights the people of Rapture had before and became a dictator. By doing this, Andrew Ryan betrayed the same values he built Rapture on. Later, there was a civil war between the rich people (who supported Ryan) and the poor (who supported Fontaine). After the war, Rapture became too dangerous to live in. As a result, most people who could do so left Rapture and returned to the surface world. Before the civil war, Andrew Ryan had sex with a prostitute named Jasmine Jolene and she became pregnant with a son. Since she needed money, she sold the embryo of her son to Fontaine. Fontaine hired scientists Yi Suchong and Brigid Tenenbaum to experiment on the child, Jack, so that he could learn and grow into a fully-capable adult in less than four years. They also programmed him to obey certain commands without him knowing it. Specifically, he would obey any command he hears if he also hears the phrase \"would you kindly\". Suchong and Tenenbaum also gave him false memories so that he would never learn of his true purpose, to kill Andrew Ryan. In 1960, while Jack was sitting on a plane flying over the Atlantic Ocean, he reads a letter that he thought was written by his parents. Actually, they were instructions for him to steal the plane and crash it just outside Rapture. He obeyed the instructions because the phrase \"would you kindly\" was written on it. Not knowing what happened, Jack though the plane crashed. After the plane crashed, Jack would swim to a nearby lighthouse. This lighthouse happened to be the entrance for Rapture. After Jack arrives in Rapture, Fontaine, pretending to be an Irishman named Atlas, tells Jack he can help him if Jack helps Atlas rescue his wife and son (which he does not really have). After Ryan blows up the submarine that Atlas said his wife and son were on, he tells Jack to get revenge on Ryan by killing him. At first Ryan thought that Jack was a CIA or KGB agent sent to destroy Rapture. However, right when Jack was outside Ryan's office, Ryan realizes that Jack is his son and he chooses not to hurt or attack Jack. When Jack waits outside Ryan's office, Ryan tells Jack that he was being controlled by Atlas his whole life so Jack could kill Ryan. Ryan gives Jack his golf club and commands Jack to kill him. Jack could not refuse to kill Ryan because Ryan said the phrase, \"would you kindly.\" Ryan did this to show that he was a man and Jack was a slave, because \"a man chooses, a slave obeys\". == References == Category:Fictional characters introduced in 2007 Category:Video game characters",
 "title": "Andrew Ryan (BioShock)"
}