{
 "id": "767789",
 "text": "Helltaker is a freeware indie puzzle-adventure game with dating sim elements that was designed by Polish developer vanripper (real name Łukasz Piskorz), released on May 11, 2020 for Windows, macOS, Linux and SteamOS. It is described as \"[a] short game about sharply dressed demon girls.\" == Plot == One day, The Helltaker has a dream about making a harem of demon girls. When he wakes up, even though he knows Hell is a dangerous place, he decides to go to Hell, wanting to make a harem of demon girls in the real world. == Gameplay == The player plays a series of puzzle stages, in which the player pushes stones and skeleton soldiers around a two-dimensional top-down grid, like in Sokoban, while having a limited amount of turns, avoiding spike traps and collecting key items. After reaching the goal, the player reaches the demon girl of that stage, who will ask the player a question. The correct answer is based on her personality. If the player guesses the answer correctly, the demon girl becomes part of the player's demon harem. If the player guesses the answer incorrectly, a bad ending, such as death, will happen, taking the player back to the start of the stage. The final boss level, which features the demon Judgement, the High Prosecutor, includes phased bullet hell-like mechanics with chains across the screen. == Development == Łukasz Piskorz, who is known on Twitter as \"vanripper\", developed the whole game by himself over about one year, and was the game's artistic director. According to him, Helltaker is like the Leisure Suit Larry video game series because the main characters of both games have similar features. The game can be played for free, and an art book and the recipe for the pancakes that appear in the game are sold separately. Although the video game is only officially available in English, Piskorz has supported the translations made by the community, explaining how to make them and making one in Polish himself. == Characters == ;The Helltaker :A man who goes down to hell, wanting to make a harem of demon girls. He wears sunglasses and has a muscular body. When talks with the demon girls go wrong, he is killed by them. He is skilled in making pancakes. ;Beelzebub, the Great Fly :A demon girl who is the first character encountered in the game. She can either appear as an insect, or a demon girl with fly-like features and tendencies, such as wearing fly-themed trinkets, bracelets and jewelry, and using a handkerchief similarly to how a fly cleans itself. ;Pandemonica, the Tired Demon :A demon girl who is a customer service representative in Hell. She wears glasses and likes coffee. Even though she is the Tired Demon, she has a sadistic side that can be brought out for reasons such as The Helltaker making her bad coffee. ;Modeus, the Lustful Demon :A demon girl who is addicted to sex. She is sometimes naive towards concepts such as romance. ;Cerberus, the Triple Demon :A demon girl with three bodies at once, all of which are controlled by one soul living within her. She has canine-like ears and teeth, and is one of the more excitable demons. However, she has a dark side, in which she still has an innocent appearance. ;Malina, the Sour Demon :A demon girl who is the sister of Zdrada. She is a \"salty nostalgia gamer\" with a love for turn-based strategy games. Her sister, Zdrada, makes fun of this, saying Malina gets sexually excited by them. She is named after the Slavic word for raspberry,Helltaker: Artbook + Pancake Recipe concept art with notes p.7 and loves to drink alcohol, which she drinks when she is stressed. ;Zdrada, the Bitch Demon :A demon girl who is Malina's sister. She is a heavy smoker. Her name is the Slavic word for betrayal, which, in Polish, can also mean treason and adultery. ;Azazel, the Curious Angel :An angel who goes to Hell to collect information on demons. She is shown to often be writing notes. ;Justice, the Awesome Demon :A demon girl who is blind and wears sunglasses. She is laid-back and was the High Prosecutor of Hell before Judgement. ;Lucifer, the CEO of Hell :A demon girl who acts as the queen of hell, and takes the title of \"CEO of Hell\". She likes pancakes. ;Judgement, the High Prosecutor :A demon girl who is the High Prosecutor of Hell. She ignores pleas from other demons to spare The Helltaker, even when Lucifer tells her to stand down. Despite this, she is the nicest demon in the game, because she only acts in a sadistic way to fit in with her role as High Prosecutor of Hell. == Soundtrack == == Reception == As of 7 June 2020, the game has 21,143 reviews on Steam, with an overall rating of \"Overwhelmingly Positive\". == References == Category:Adventure games Category:Indie video games Category:macOS games Category:Puzzle video games Category:Video games set in hell Category:Windows games",
 "title": "Helltaker"
}