{
 "id": "767711",
 "text": "The 2020 China–India skirmishes are part of an ongoing military standoffs between China and India. Since 5 May 2020, Chinese and Indian troops have reportedly engaged in aggressive actions, face-offs, and other kinds of intense military action at locations along the Sino-Indian border. Hand-to-hand combat on 16 June 2020 resulted in the death of 20 Indian soldiers (including an officer), Indian media sources have so far claimed that at least 43 Chinese soldiers were either dead or injured (including the death of an officer)Commanding Officer of Chinese Unit among those killed in face-off with Indian troops in Galwan Valley while US intelligence sources reportedly believe that 35 Chinese soldiers are dead, including a senior officer.https://www.usnews.com/news/world-report/articles/2020-06-16/dozens-killed-as-india-china-face-off-in-first-deadly-clash-in-decadesLadakh face-off | Govt sources cite U.S. intelligence to claim China suffered 35 casualties - The HinduIndia-China Galwan valley clash: 35 Chinese soldiers died, report cites US intelligence - The Financial ExpressGalwan clash: China suffered 35 casualties, say sources quoting US intel | Business Standard News Incidents have taken place near the Pangong Lake in Ladakh and the Nathu La pass in Sikkim. In addition, face-offs are ongoing at locations in eastern Ladakh, along the Line of Actual Control (LAC) which was the result of the 1962 Sino-Indian War. According to some reports, China captured 60 km2. of Indian-patrolled territory between May and June 2020. However, China has denied capturing any territory and both countries agreed to disengage by June 2020.India, China agree on \"complete disengagement\" of troops from eastern Ladakh in timely manner - The Economic Times Between this clash, the Indian government hasn't admitted publicly to Indian citizens that Chinese PLA troops have trangressed their territory. On 6 August 2020 one such document was published in Ministry of Defense website of India claiming that the current clash is expected to be prolonged. This document was taken down by the official website. According to S Jaishankar, the External Affairs Minister of India, the ongoing military standoff is a result of Beijing not following the existing agreements. ==References== Category:May 2020 events Category:June 2020 events Category:2020 in China Category:2020 in India Category:Conflicts in 2020",
 "title": "2020 China–India skirmishes"
}