{
 "id": "76781",
 "text": "Nicole Prascovia Elikolani Scherzinger (née Valiente; born June 29, 1978) is an American singer-songwriter, television personality, and philanthrophist. She was the lead singer of the girl group The Pussycat Dolls. Scherzinger is also known for being a judge on TV talent shows such as The X Factor and The Masked Singer. == Early life == Her father is of Filipino ancestry. Her mother is of Hawaiian and Ukrainian ancestry. Her Catholic parents separated when she was a baby. At age six, she moved to Louisville, Kentucky. She took her German American stepfather's surname when he adopted her. == Career == Scherzinger was one of the group members in Edens Crush after winning a spot from the reality show Popstars. Scherzinger was later a member of the Pussycat Dolls. On November 16, 2007, she released her first solo album, Killer Love. She was a judge on The Sing-Off in 2009 and 2010. She was a judge on The X Factor in the United States in 2011. She was also a judge on The X Factor in the United Kingdom from 2012 to 2017. Scherzinger is also a panellist on The Masked Singer USA. will.i.am is the executive producer of her second album. == Personal life == Since 2006, Scherzinger has had an on-off relationship with Lewis Hamilton.Nicole Scherzinger and Lewis Hamilton step out together She has had bulimia nervosa.I didn't get help for my bulimia == Discography == === Solo singles === Year Title Chart positions Album U.S. UK CAN AUS GER IRE AUT SWI SWE 2007 \"Whatever U Like\" (featuring T.I.) 104 — 57 — — — — — — Her Name Is Nicole [shelved] \"Baby Love\" (featuring will.i.am) 108 14 — 58 5 15 21 14 51 \"Supervillain\" (feat. Mad Scientist) — — — — — — — — — \"Puakenikeni\" (featuring Brick & Lace) — — — — — — — — — === As featured performer === Year Title Main artist Chart positions Album U.S. UK CAN AUS GER IRE AUT SWI SWE 2006 \"Lie About Us\" Avant — 76 — — — — — — — Director \"You Are My Miracle\" Vittorio — — — — — — — — — Vittorio \"Come to Me\" Diddy 9 4 — 11 6 3 8 3 44 Press Play 2007 \"Scream\" Timbaland (also featuring Keri Hilson) 122 12 41 20 9 10 18 45 8 Shock Value 2009 \"Jai Ho! (You Are My Destiny)\" A.R.Rahman & Pussycat Dolls 15 3 4 1 29 1 18 7 40 Doll Domination \"Hotel Room Service\" (Official Remix) Pitbull 8 9 7 15 22 6 22 11 14 Rebelution === Album appearances === Year Song Artist Album 2001 \"I Saw You\" F.O.B. Love's a Woman's Game \"I'm Getting There\" 2003 \"I'll Be Your Love\" (English Version) Violet UK Exposition of Global Harmony 2004 \"Breakfast in Bed\" Various Artists 50 First Dates Official Soundtrack, appeared on one track as 'Nicole Kea' 2005 \"If U Can't Dance (Slide)\" Will Smith Lost & Found \"Supa Hypnotic\" Shaggy Clothes Drop \"Don't Ask Her That\" 2007 \"Scream\" Timbaland Shock Value (album) \"Papi Lover\" Daddy Yankee El Cartel: The Big Boss \"Fire\" 50 Cent Curtis 2009 \"Until U Love U\" Pussycat Dolls Doll Domination Deluxe Edition 2010 TBA Slash Slash & Friends == References == Category:1978 births Category:Living people Category:American adoptees Category:The Pussycat Dolls members Category:Writers from Louisville, Kentucky Category:Writers from Hawaii Category:Musicians from Hawaii Category:Musicians from Louisville, Kentucky Category:American pianists Category:People from Honolulu Category:Singers from Hawaii Category:Singers from Louisville, Kentucky Category:Television personalities from Kentucky Category:Interscope Records artists Category:Synth-pop singers Category:American electropop singers",
 "title": "Nicole Scherzinger"
}