{
 "id": "768071",
 "text": "Xie Yimin (謝依旻) (born 16 November 1989) is a Taiwanese female professional Go player at Nihon Ki-in, Japan. She has obtained more than 25 female titles in her career. She is also qualified for the Honorary female board master (名誉女流棋聖), honorary female grand master (名誉女流名人), and the honorary female Honinbo (名誉女流本因坊). ==AchievementsXie Yimin at Sensei's LibraryGoBaseXie Yimin at Go Ratings== The following tables are the summary of her achievements in career. *The name indicated in this table is her opponent at the final of each tournament. Red means she defended/obtained her title. Blue means she was the finalist. *Green means that she was the 1st place of female players in the prize money ranking. Female board master (女流棋聖) Female grand master (女流名人) Female Tachiaoi Cup (女流立葵杯) Senou Cup (扇興杯) Female Honinbo (女流本因坊) Other tournaments Prizes (棋道賞) Prize money ranking Notes Held in January to February Held in March Held in June to July Held in July Held in October to November 2004 2005 Promoted to 2 dan due to the prize money ranking 2006 Female Champion Female MVP Finalist at the U20 tournament 2007 Kumiko Yashiro 3-0 Female MVP 14th 2008 Keiko Kato 2-0 Ayumi Suzuki 3-1 Daiwa Securities Cup Female MVP 10th (She became the first female player to be ranked higher than 10th) Promoted to 4 dan due to the prize money ranking 2009 Kaori Chinen 2-1 Kikuyo Aoki 3-1 Female MVP 9th 2010 Yukari Umezawa 2-0 Chiaki Mukai 2-0 Chiaki Mukai 3-0 Female MVP 8th Obtained three female titles in the same year (女流三冠) Attended to the Asian Games from team Taiwan 2011 Yukari Umezawa 2-0 Chiaki Mukai 2-1 Chiaki Mukai 3-1 Pair Go Tournament MVP (She became the first female player to receive the general MVP) Female MVP 6th (She became the first female player to gain more than 20 million yen in a year) Obtained three female titles in the same year (女流三冠) 2012 Kikuyo Aoki 1-2 Chiaki Mukai 2-0 Aya Okuda 3-0 Pair Go Tournament Female MVP 7th Promoted to 6 dan due to the prize money ranking 2013 Kikuyo Aoki 2-0 Aya Okuda 2-0 Chiaki Mukai 2-3 Pair Go Tournament 6th 2014 Kikuyo Aoki 2-0 Keiko Kato 2-1 9th 2015 Kazuko Konishi 2-0 Ayumi Suzuki 2-0 王景怡 0-1 Rina Fujisawa 3-2 Female MVP 5th Obtained three female titles in the same year (女流三冠) 2016 Yukari Yoshihara 2-0 Kikuyo Aoki 2-1 Kikuyo Aoki 1-0 Chiaki Mukai 〇 Rina Fujisawa 1-3 Female MVP Obtained five female titles in the same year (女流五冠) She became the fastest female player to obtain 300 wins in career 2017 Eiko Nyu 2-1 Rina Fujisawa 0-2 Rina Fujisawa 1-2 Rina Fujisawa ● Rina Fujisawa 3-2 2018 Asami Ueno 0-2 Rina Fujisawa 1-2 Rina Fujisawa 1-3 2019 Rina Fujisawa 1-2 Rina Fujisawa ● Name of title Season Obtained year Finalist Obtained Consecutive victory Honorary title Female Honinbo (女流本因坊) Held in October to November 2007-12,15,17 11 times 8 (Japan record） 6 (Japan record） Honorary female Honinbo (名誉女流本因坊) Female grand master (女流名人) Held in March 2008-16 10 times 9 (Japan record） 9 (Japan record） Honorary female grand master(名誉女流名人) Female board master (女流棋聖) Held in January to Febuary 2010-11,13-17 9 times 7 (Japan record) 5 (Japan record) Honorary female board master (名誉女流棋聖) Senou Cup (扇興杯) Held in July 2016 3 times 1 female Tachiaoi Cup (女流立葵杯) Held in June to July 2016 4 times 1 The total number of her obtained titles is a female player record in Japan ==References== ==Other websites== * Official profile * * Category:1989 births Category:Living people Category:Asian Go players Category:Sportswomen Category:Taiwanese sportspeople",
 "title": "Xie Yimin"
}