{
 "id": "76800",
 "text": "Augustine of Hippo (; ; 13 November 354 – 28 August 430), also known as Saint Augustine, was a Christian philosopher and theologian. ==Early life== Augustine was born in the year 354. His mother is believed to have been of Berber origin. After growing up, he began to learn and write a lot about Christianity, and became a bishop in Hippo Regius, which was in modern-day Annaba, Algeria. He was highly influenced by archbishop Ambrose. Later in life, Augustine moved to Italy, and over the next years his religious ideology grew stronger, and he became a teacher. ==Works== Books: * On Christian Doctrine, wrt397-426 * Confessions, 397-398 * The City of God, begun ca. 413, finished 426 * On the Trinity, 400-416 * Enchiridion * Retractions: At the end of his life (ca. 426-428) Augustine revisited his previous works in chronological order and suggested what he would have said differently in a work titled the \"Retractions\", giving the reader a rare picture of the development of a writer and his final thoughts. * The Literal Meaning of Genesis * On Free Choice of the Will Letters: * On the Catechising of the Uninstructed * On Faith and the Creed * Concerning Faith of Things Not Seen * On the Profit of Believing and Judgement. * On the Creed: A Sermon to Catechumens * On Continence * On the Good of Marriage * On Holy Virginity * On the Good of Widowhood * On Lying * To Consentius: Against Lying * On the Work of Monks * On Patience * On Care to be Had For the Dead * On the Morals of the Catholic Church * On the Morals of the Manichaeans * On Two Souls, Against the Manichaeans * Acts or Disputation Against Fortunatus the Manichaean * Against the Epistle of Manichaeus Called Fundamental * Reply to Faustus the Manichaean * Concerning the Nature of Good, Against the Manichaeans * On Baptism, Against the Donatists * Answer to Letters of Petilian, Bishop of Cirta * The Correction of the Donatists * Merits and Remission of Sin, and Infant Baptism * On the Spirit and the Letter * On Nature and Grace * On Man's Perfection in Righteousness * On the Proceedings of Pelagius * On the Grace of Christ, and on Original Sin * On Marriage and Concupiscence * On the Soul and its Origin * Against Two Letters of the Pelagians * On Grace and Free Will * On Rebuke and Grace * The Predestination of the Saints/Gift of Perseverance * Our Lord's Sermon on the Mount * The Harmony of the Gospels * Sermons on Selected Lessons of the New Testament * Tractates on the Gospel of John * Homilies on the First Epistle of John * Soliloquies * The Enarrations, or Expositions, on the Psalms * On the Immortality of the Soul ==Related pages== * Augustinianism * Free will * Original sin * Pelagianism * Filioque clause * Truth ==References== * The Story of Thought, DK Publishing, Bryan Magee, London, 1998, : aka The Story of Philosophy, Dorling Kindersley Publishing, 2001, ::(subtitled on cover: The Essential Guide to the History of Western Philosophy) :: g Saint Augustine, pages 30, 144; City of God 51, 52, 53 and The Confessions 50, 51, 52 :: - additional in the Dictionary of the History of Ideas for Saint Augustine and Neo-Platonism == Bibliography == * Brown, Peter. Augustine of Hippo. Berkeley: University of California Press, 1967. * Gareth B. Matthews. Augustine. Blackwell, 2005. * O'Donnell, James J. Augustine: A New Biography. New York: HarperCollins, 2005. * Ruickbie, Leo. Witchcraft Out of the Shadows. London: Robert Hale, 2004. , pp. 57–8. * Tanquerey, Adolphe. The Spiritual Life: A Treatise on Ascetical and Mystical Theology. Reprinted Ed. (original 1930). Rockford, IL: Tan Books, 2000. , p. 37\\. * von Heyking, John. Augustine and Politics as Longing in the World. Columbia: University of Missouri Press, 2001. * Orbis Augustinianus sive conventuum O. Erem. S. A. chorographica et topographica descriptio Augustino Lubin, Paris, 1659, 1671, 1672. * * * René Pottier. Saint Augustin le Berbère. Fernand Lanore, 2006. * * Preview from Google == Other websites == * General: ** University of Pennsylvania, Augustine of Hippo - Texts, translations, introductions, commentaries (Webarchive), 2006-10-22 ** EarlyChurch.org.uk Extensive bibliography and on- line articles. ** Life of St. Augustine of Hippo, from the Catholic Encyclopedia ** Augstine of Hippo , at Centropian * Texts by Augustine: ** ** In Latin, at The Latin Library: books and letters by Augustine ** At \"Christian Classics Ethereal Library\" Translations of several works by Augustine, incl. introductions ** Sant'Agostino - Vita, Scritti, Pensiero, Santità, Attualità Full Latin and Italian text resource ** At \"IntraText Digital Library\": Works by Augustine in several languages, with concordance and frequency list ** St. Augustine's Multilingual Opera Omnia * Texts on Augustine: ** Augustine and 'other Catholics' ** Stanford Encyclopedia of Philosophy entry ** \"Augustine's Concept of Freedom: The Dynamic of Sin and Grace\" from Grace Incarnate (1989) ** Augustine's Heavenly City and the Western Mind Pgs 22-24 * On Music ** Augustine on Hymns * On Original Sin ask Dan Santos ** Augustine and Pelagius ** Augustine and Thomas Aquinas on Original Sin ** Original sin: a disputation ** The Cambridge Companion to Augustine; 3 Augustine on evil and original sin * Links to the Augustinian Order ** Augustine's writings * Audio books ** City of God, Confessions, Enchiridion, Doctrine * Augustine and Orthodoxy ** Blessed Augustine of Hippo: His Place in the Orthodox Church ** St Augustine the Bishop of Hippo Orthodox icon and synaxarion Category:354 births Category:430 deaths Category:Christian mystics Category:Christian saints Category:Doctors of the Church Category:Converts to Christianity Category:Ancient Roman philosophers Category:Berber people Category:Early Christian theologians",
 "title": "Augustine of Hippo"
}