{
 "id": "768015",
 "text": "The President of Mongolia (, Mongol Ulsyn Yerönkhiilögch) is the Executive Head of state of Mongolia.Montsame News Agency. Mongolia. 2006, , p. 42 The current incumbent is Ukhnaagiin Khürelsükh. The Constitution of Mongolia adopted in 1992 states that the President of Mongolia is the \"head of state and embodiment of the unity of the Mongolian people\".Constitution of Mongolia Mongolia declared its independence from the Qing dynasty in 1911, under the Bogd Khan (the 8th Jebtsundamba Khutuktu). From 1911 to 1924, the head of state of Mongolia was nominally the Bogd Khan. During 1924 to 1992, during the Mongolian People's Republic, the official title of the head of state underwent several changes, including Chairman of the State Great Khural, Chairman of the Presidium of the State Little Khural, Chairman of the Presidium of the State Great Khural, and finally, Chairman of the Presidium of the People's Great Khural. ==List of presidents == № Portrait Name Reign start Reign end Religious title 1 Bogd Khan 29 December 1911 20 May 1924 The 8th Jebtsundamba Khutuktu — Balingiin Tserendorj 20 May 1924 28 November 1924 Mongolian People's Revolutionary Party 2 Navaandorjiin Jadambaa 28 November 1924 29 November 1924 Mongolian People's Revolutionary Party 3 Peljidiin Genden 29 November 1924 15 November 1927 Mongolian People's Revolutionary Party 4 Jamtsangiin Damdinsüren 16 November 1927 23 January 1929 Mongolian People's Revolutionary Party 5 Khorloogiin Choibalsan 24 January 1929 27 April 1930 Mongolian People's Revolutionary Party 6 Losolyn Laagan 27 April 1930 2 July 1932 Mongolian People's Revolutionary Party 7 Anandyn Amar 2 July 1932 22 March 1936 Mongolian People's Revolutionary Party 8 Dansranbilegiin Dogsom 22 March 1936 9 July 1939 Mongolian People's Revolutionary Party — Dashiin damba 9 July 1939 9 July 1939 Mongolian People's Revolutionary Party — Khas-Ochiryn Luvsandorj 9 July 1939 9 July 1939 Mongolian People's Revolutionary Party — Banzarjavyn Baasanjav 9 July 1939 9 July 1939 Mongolian People's Revolutionary Party — Khorloogiin Choibalsan 9 July 1939 6 July 1940 Mongolian People's Revolutionary Party — Yumjaagiin Tsedenbal 6 July 1940 6 July 1940 Mongolian People's Revolutionary Party 9 Gonchigiin Bumtsend 6 July 1940 5 January 1946 Mongolian People's Revolutionary Party Outer Mongolia was de jure part of the Republic of China until 5 January 1946, when the ROC officially recognized its de facto independence (following the referendum held on 20 October 1945). The head of state of Mongolia is legal from that time. Gonchigiin Bumtsend 5 January 1946 6 July 1951 Mongolian People's Revolutionary Party Gonchigiin Bumtsend 6 July 1951 23 September 1953 Mongolian People's Revolutionary Party — Sükhbaataryn Yanjmaa 23 September 1953 7 July 1954 Mongolian People's Revolutionary Party 10 Jamsrangiin Sambuu 7 July 1954 7 July 1960 Mongolian People's Revolutionary Party Jamsrangiin Sambuu 7 July 1960 21 May 1972 Mongolian People's Revolutionary Party — Tsagaanlamyn Dügersüren 21 May 1972 29 June 1972 Mongolian People's Revolutionary Party — Sonomyn Luvsan 29 June 1972 11 June 1974 Mongolian People's Revolutionary Party 11 Yumjaagiin Tsedenbal 11 June 1974 23 August 1984 Mongolian People's Revolutionary Party — Nyamyn Jagvaral 23 August 1984 12 December 1984 Mongolian People's Revolutionary Party 12 Jambyn Batmönkh 12 December 1984 21 March 1990 Mongolian People's Revolutionary Party 13 Punsalmaagiin Ochirbat 21 March 1990 3 September 1990 Mongolian People's Revolutionary Party Punsalmaagiin Ochirbat 3 September 1990 12 February 1992 Mongolian People's Revolutionary Party ===Mongolia (1992–present)=== Presidents Punsalmaagiin Ochirbat 12 February 1992 20 June 1997 Mongolian People's Revolutionary Party Mongolian Social Democratic Party — Radnaasümbereliin Gonchigdorj September 1990 29 July 1992 — Natsagiin Bagabandi July 1992 July 1996 14 Natsagiin Bagabandi 20 June 1997 24 June 2005 Mongolian People's Revolutionary Party — Radnaasümbereliin Gonchigdorj July 1996 July 2000 — July 2000 September 2001 — October 2001 August 2004 — Nambaryn Enkhbayar August 2004 June 2005 15 Nambaryn Enkhbayar 24 June 2005 18 June 2009 Mongolian People's Revolutionary Party 7 Tsendiin Nyamdorj July 2005 June 2007 8 Danzangiin Lundeejantsan June 2007 August 2008 16 Tsakhiagiin Elbegdorj 18 June 2009 10 July 2017 Democratic Party — Damdiny Demberel September 2008 July 2012 — Zandaakhüügiin Enkhbold August 2012 June 2016 17 Khaltmaagiin Battulga 10 July 2017 25 June 2021 Democratic Party — Miyeegombyn Enkhbold July 2016 February 2019 — Gombojavyn Zandanshatar February 2019 July 2024 18 Ukhnaagiin Khürelsükh 25 June 2021 — Mongolian People's Party — Amarbayasgalan Dashzegve July 2024 Incumbent ==References==",
 "title": "President of Mongolia"
}