{
 "id": "7682",
 "text": "Nickelodeon (often shortened to Nick) is a worldwide cable television network. Airing Mondays-Saturdays from 7 a.m.-8 p.m. and Sundays from 7 a.m.-7 p.m. Nickelodeon is the Top Basic Cable Network of 2014 It is the first TV channel made for children. The network was established in 1977 as C-3. It was launched in 1979. In the same year, it was renamed Nickelodeon. Pinwheel was the first show to air on Nickelodeon. During the late mornings and afternoons, Nickelodeon shows Nick Jr. This is a group of learning programs and series for younger children. They are shown while the older children are in school. At night, the network shows Nick at Nite. Nick at Nite is a group of reruns of older series that parents watched when they were younger. == Programming == Programming seen on Nickelodeon includes animated series (such as SpongeBob SquarePants, The Loud House, The Casagrandes, The Patrick Star Show, Kamp Koral: SpongeBob's Under Years, The Smurfs, Rugrats and Big Nate), live- action, scripted series (such as Danger Force, Tyler Perry's Young Dylan and All That), and original made-for-TV movies, while the network's daytime schedule is dedicated to shows targeting preschoolers (such as Bubble Guppies, PAW Patrol and Blue's Clues & You!). ===Nicktoons=== Nicktoons is the branding for Nickelodeon's original animated television series. Until 1991, the animated series that aired on Nickelodeon were largely imported from foreign countries, with some original animated specials that were also featured on the channel up to that point. In 1991, Nickelodeon created it's first 3 animated shows. These include Doug, Rugrats and The Ren and Stimpy Show. Though the Nicktoons branding has seldom been used by the network itself since the 2002 launch of the channel of the same name, original animated series continue to make up a substantial portion of Nickelodeon's lineup. Roughly 6 to 7 hours of these programs are seen on the weekday schedule and around nine hours on weekends, including a dedicated weekend morning animation block. == Sister channels == ===Nick at Nite=== Nick at Nite is a programming block for adults and older youth audiences.The block was founded in 1985. This block is similar to Adult Swim, the nighttime programming block for Cartoon Network. ===Nick Jr.=== Nick Jr. is a children's programming block for children aged 2-6. It was founded in 1988 as a programming block. A channel called Nick Jr. was launched in 2009. In the same year, the original Nick Jr. logo was discontinued on the block, following the decline of Noggin. ===NickSpongebob === NickSpongebob (Formerly Nicktoons) is a programming block founded in 1991, the same day Doug, Rugrats and The Ren and Stimpy Show started. The programming block was repeated every Saturday and Sunday. A channel called Nicktoons was launched in 2002. The channel is for ages 7-14. It was rebranded as NickSpongebob in 2025 and now Shows SpongeBob Squarepants 24/7. ===TeenNick=== TeenNick is a programming block for teens ages 13-19. It was founded in 2001. This block is for teenage audiences. The channel launched in 2009. It had shows such as Drake & Josh, iCarly, Danger Force, Tyler Perry's Young Dylan and All That and original made-for-TV movies. ===NickMusic=== NickMusic is a channel that launched in 2002 as MTV Hits. It was changed later on. ===NickRewind=== NickRewind was a block on TeenNick from 2019-2022 and Nick at Nite from 2023-present on weekdays, that launched in 2011. It showed re-runs of old Nickelodeon shows. == Notes == == Related pages == *List of programs broadcast by Nickelodeon *List of movies by Nickelodeon *Nicktoons *Nick.com *The Club (Nickelodeon) *MTV *Nick Jr. Channel *NickRewind Jr. (United States) == References == == Other websites == * Official site (United States) * Official site (United Kingdom) Category:American television networks Category:Viacom Category:1977 establishments in the United States",
 "title": "Nickelodeon"
}