{
 "id": "76823",
 "text": "A primary source is an original document or other material that has not been changed in any way. It is a reliable first-hand account usually written at or near the time the event(s) occurred. Usually it was produced by someone with direct personal knowledge of the events that are described. It is used as an original source of information about the topic.In library and information sciences, primary sources are generally regarded as those sources closest to the origin of the information or idea under study. (\"Primary, secondary and tertiary sources\" and \"Library Guides: Primary, secondary and tertiary sources\" Primary sources are distinguished from secondary sources. Secondary sources are documents based on primary sources.Jerome Clauser, An Introduction to Intelligence Research and Analysis (Lanham, MD: Scarecrow Press, 2008), p. 69 Thus, a memoir of a participant in an event is a primary source, whilst a history of that event based on several memoirs is a secondary source. Different kinds of work have slightly different definitions of a primary source. In journalism, for example, a primary source can also be a person. == Related pages == *Historiography *Secondary source *Tertiary source == References == == Bibliography == * Jules R. Benjamin. A Student's Guide to History (2003) * Kathleen W. Craver. Using Internet Primary Sources to Teach Critical Thinking Skills in History (1999) * Thomas Cripps, \"Historical Truth: An Interview with Ken Burns\", American Historical Review 100 (1995), 741–64. online at JSTOR * Michael Drake and Ruth Finnegan (Eds), Sources and Methods for Family and Community Historians: A Handbook, (Cambridge University Press in conjunction with the Open University, 1997) * Wood Gray, Historian's handbook, a key to the study and writing of history (Houghton Mifflin, 1964). * Martha C. Howell and Walter Prevenier. From Reliable Sources: An Introduction to Historical Methods (2001) * Library of Congress, \" Analysis of Primary Sources\" online 2007 * Richard A. Marius and Melvin E. Page. A Short Guide to Writing About History (5th Edition) (2004) * Barbara W. Sommer and Mary Kay Quinlan, The Oral History Manual (2002) ==Other websites== :- to primary sources repositories *A listing of over 5000 websites describing holdings of manuscripts, archives, rare books, historical photographs, and other primary sources * Find primary sources in the collections of major research libraries using ArchiveGrid :- to all sources repositories *Wikisource – The Free Library – is the Wikimedia project that collects, edits, and catalogs all source texts. :- to essays and descriptions of primary, secondary and other sources *Ithaca College Library - Primary and secondary sources *\"How to distinguish between primary and secondary sources\" from the University of California, Santa Cruz Library *\"Primary, Secondary, and Tertiary sources\" from James Cook University Library * Joan of Arc: Primary Sources Series—Example of a publication focusing on primary source documents. * Finding primary sources from the University of California, Berkeley library * \"Primary versus secondary sources\" from the Bowling Green State University library * Finding primary sources in world history * Category:Science",
 "title": "Primary source"
}