{
 "id": "768454",
 "text": "\"Amhrán na bhFiann\" (, meaning \"The Soldier's Song\") is the national anthem of Ireland, adopted in 1926. There is both an Irish version and an English version of the song; the English lyrics were written by Peadar Ó Cearnaigh in 1907, and the Irish lyrics were written by Liam Ó Rinn in 1923. It was composed by Peadar Ó Cearnaigh and Patrick Heeney in 1907. ==Lyrics== Only the chorus is officially part of the national anthem.National Anthem. Department of the Taoiseach \"Youth Zone\" web page. Retrieved 19 January 2013.National Anthem (sheet music). Department of Foreign Affairs. Archived from the original (JPEG) on 16 December 2009. Retrieved 30 March 2009. Words of the song in Irish Pronunciation of these words using the IPA Words of the song in English Seo dhíbh, a chairde, duan Ógláigh Caithréimeach bríomhar ceolmhar Ár dtinte cnámh go buacach táid 'S an spéir go mín réaltógach Is fonnmhar faobhrach sinn chun gleo 'S go tiúnmhar glé roimh thíocht don ló Fé chiúnas chaomh na hoíche ar seol Seo libh, canaídh Amhrán na bhFiann. Curfá: Sinne Fianna Fáil, atá faoi gheall ag Éirinn, Buíon dár slua thar toinn do ráinig chugainn, Faoi mhóid bheith saor Seantír ár sinsear feasta, Ní fhágfar faoin tíorán ná faoin tráill. Anocht a théam sa bhearna bhaoil, Le gean ar Ghaeil, chun báis nó saoil, Le gunna-scréach faoi lámhach na bpiléar, Seo libh canaig' amhrán na bhFiann. Cois bánta réidhe, ar ardaibh sléibhe Ba bhuadhach ár sinsir romhainn Ag lámhach go tréan fén sárbhrat séin 'Tá thuas sa ghaoth go seolta Ba dhúchas riamh dár gcine cháidh Gan iompáil siar ó imirt áir 'S ag siúl mar iad i gcoinne námhad Seo libh, canaídh Amhrán na bhFiann Curfá A bhuíon nach fann d'fhuil Ghaeil is Gall Sin breacadh lae na saoirse Tá sceimhle 's scanradh i gcroíthe námhad Roimh ranna laochra ár dtíre Ár dtinte is tréith gan spréach anois Sin luisne ghlé sa spéir anoir 'S an bíobha i raon na bpiléar agaibh Seo libh, canaídh Amhrán na bhFiann Curfá Misc. - Irish Lyrics. Shamrock.ra. [ʃɔ ʝiːvʲ ə xɑːɾˠ.dʲə dˠuənˠ oːg.lˠɑːɣ] [kɑːh.ɾʲeː.mʲɑːx bʲɾʲiː.w̃əɾˠ coːlˠ.w̃əɾˠ] [ɑːɾˠ dʲinʲ.tʲə knˠɑːw̃ gə bˠuə.kɑːx tˠɑːdʲ] [ʔsˠ ənˠ ʃpʲeːɾʲ gə mʲiːnʲ ɾʲeːlˠ.tˠoː.gəx] [iʃ fˠɔnˠ.w̃ɑːɾˠ fˠiːw.ɾˠəx ʃinʲ xʊnˠ ɟlʲoː] [ʔsˠ gə tʲuːnˠ.w̃əɾˠ ɟlʲeː ɾˠɪṽʲ hiːxtˠ dˠɔnˠ lˠoː] [fʲeː çuː.nˠəsˠ xiːw̃ nˠə hiː.çə əɾˠ ʃoːlˠ] [ʃɔ lʲɪvʲ kɑ.nˠɪɟ əu.ɾˠaːnˠ nˠə vʲi(ə)nˠ] [kʊɾˠ.fˠɑː] [ʃɪ.nʲə fʲi(ə).nˠə fˠɑːlʲ] [ə.tˠɑː fˠiː jalˠ ɛɟ eː.ɾʲənʲ] [bˠiːnˠ dˠɑːɾˠ sˠl̪ˠu(ə)] [haɾˠ tˠiːnʲ dˠɔ ɾˠɑː.nʲɪɟ xuː(.gə)nʲ] [fˠiː vˠoːdʲ vʲɛ sˠeːɾˠ] [ʃanˠ.tʲiːɾʲ ɑːɾˠ ʃiːnʲ.ʃəɾˠ fʲasˠ.tˠə] [nʲiː ɑːk.(f)ˠəɾˠ fˠiːnʲ tʲiː.ɾˠɑːnˠ nˠɑː fˠiːnʲ tˠɾˠɑːlʲ] [ə.nˠɔxtˠ ə heːmˠ sˠə vʲɑːɾˠ.nˠə vˠiːlʲ] [lʲɛ ɟanˠ ɛɾʲ ɣeːlʲ xʊnˠ bˠɑːʃ nˠoː sˠeːlʲ] [lʲɛ ɡʊ.nˠə ʃcɾʲeːx fˠiː lˠɑː.wəx nˠə bʲi.lʲeːɾˠ] [ʃɔ lʲɪvʲ kɑ.nˠɪɟ əu.ɾˠaːnˠ nˠə vʲi(ə)nˠ] [kɔʃ bˠɑːnˠ.tˠə ɾʲeː.ʝə əɾˠ əɾˠ.dˠɑːw ʃlʲeː.vʲə] [bˠə wuə.ɣɑːx ɑːɾˠ ʃinʲ.ʃiɾʲ ɾʲʊ.w̃ɑːnʲ] [əg lˠɑː.w̃əx gə t͡rʲeːnˠ fʲeːnʲ sˠɑːɾˠ.wɾˠətˠ ʃeːnʲ] [ʔtˠɑː huəsˠ sˠə ɣiːh gə ʃoːlˠ.tˠə] [bˠə ɣuː.xəsˠ ɾʲiəw̃ dˠɑːɾˠ ɟi.nʲə xɑːʝ] [gənˠ ʊmˠ.pˠɑːlʲ ʃiəɾˠ oː i.mʲiɾʲtʲ ɑːɾʲ] [ʔsˠ əg ʃuːlˠ məɾˠ jədˠ i giː.nʲə nˠɑː.w̃ədˠ] [ʃɔ lʲɪvʲ kɑ.nˠɪɟ əu.ɾˠaːnˠ nˠə vʲi(ə)nˠ] [kʊɾˠ.fˠɑː] [ə wiːnˠ nˠəx fˠənˠ d̩ˠʔᵝiːlʲ ɣeːlʲ iʃ gəlˠ] [ʃinʲ bʲɾʲɑː.kəɣ lˠeː nˠə sˠiːɾʲ.ʃə] [tˠɑː ʃcɪṽʲ.lʲə ʔsˠ sˠkɑnˠ.ɾˠɑɣ i gɾˠiː.hə nɑː.w̃ədˠ] [ɾˠɪṽʲ ɾˠə.nˠə lˠiːx.ɾˠə ɑːɾˠ dʲiː.ɾʲə] [ɑːɾˠ dʲinʲ.tʲə iʃ t͡rʲeːh gənˠ ʃpʲɾʲeːx ə.nˠɔʃ] [ʃinʲ lˠɪʃ.nʲə ʝlʲeː sˠə ʃpʲeːɾʲ ənˠɔʃ] [ʔsˠ ənˠ bʲiː.wə i ɾˠiːnˠ nˠə bʲi.lʲeːrˠ ə.gɑːvʲ] [ʃɔ lʲɪvʲ kɑ.nˠɪɟ əu.ɾˠaːnˠ nˠə vʲi(ə)nˠ] [kʊɾˠ.fˠɑː] We'll sing a song, a soldier's song With cheering, rousing chorus As round our blazing fires we throng The starry heavens o'er us Impatient for the coming fight And as we wait the morning's light Here in the silence of the night We'll chant a soldier's song Chorus: Soldiers are we, whose lives are pledged to Ireland, Some have come from a land beyond the wave, Sworn to be free, no more our ancient sireland, Shall shelter the despot or the slave. Tonight we man the \"bearna bhaoil\", In Erin's cause, come woe or weal, 'Mid cannons' roar and rifles' peal, We'll chant a soldier's song. In valley green, or towering crag Our fathers fought before us And conquered 'neath the same old flag That's proudly floating o'er us We're children of a fighting race That never yet has known disgrace And as we march, the foe to face We'll chant a soldier's song Chorus Sons of the Gael! Men of the Pale! The long-watched day is breaking The serried ranks of Innisfail Shall set the tyrant quaking Our camp fires now are burning low See in the east a silv'ry glow Out yonder waits the Saxon foe So chant a soldier's song Chorus ==References== Category:1907 works Category:European anthems Category:National symbols of the Republic of Ireland Category:Songs in Irish",
 "title": "Amhrán na bhFiann"
}