{
 "id": "768595",
 "text": "Yukari Yoshihara (吉原由香里Her former name is Yukari Umezawa (梅沢由香里)) is a Japanese professional Go player at Nihon Ki-in since 1996.Sensei's Library's page on Yukari UmezawaYukari Yoshihara Official Profile Her mentor is Masao Kato. ==Records== Year Notes 1985 8th place in the All Japan Women Amateur Championship.In Japan, there are many female professional players who have experienced/participated this tournament. 1993 3rd place at the All Japan University Go Tournament. 1994 Victory at the All Japan Amateur Honinbo (本因坊) Tokyo Tournament (First female player to obtain this status). She also won at the International Amateur Pair Go Championship. 1995 3rd place in the All Japan Women Amateur Championship. In the same year, she obtained professional status. 1996 Graduated from Keio University. 1996, 1998, 2001-2004, 2015 and 2019 Personality at NHK Go programs at the NHK Educational TV. 2002 Finalist at the Women's Champion Title (女流最強位) 2004 Obtained 200 career wins. She was also awarded from the Television Go Program Manufacturing Assembly (テレビ囲碁番組制作者会賞)This award was granted because she helped a TV animation about Go. 2004 and 2007 Received the Journalist Club Award 2005 Served as the director of the International Go Federation 2007-2009 Obtained the Women's Board Master (女流棋聖). At the title match in 2008, she defeated Chiaki Mukai. 2010 Victory at the Professional Pair Go Championship & Finalist at the Women's Honinbo (女流本因坊) challenger determination tournament.Only the winner of this tournament can challenge against the defending champion (title holder). She also worked for a Go class at Keio University. 2011 Finalist at the Women's Board Master title.Her final opponent in this match was Xie Yimin. In the next season (held in December 2011), she was the finalist of the Women's Board Master challenger determination tournament 2016 Finalist at the Women's Board Master title. ==Japanese books== *『あなたも夢中!レディース囲碁—なによりやさしくだれにでもわかる囲碁入門書の決定版 生活実用シリーズ』 (The best Go introduction book for everyone), published from NHK, 1999 (authored with Mayu Hosaka and Izumi Kobayashi). *『梅沢由香里流すぐに打てる9路盤』(Start Go with a 9\\times9 board soon, Yukari Umezawa style), NHK Go Series, 2000. *『1から始める梅沢由香里の碁』(Yukari Umezawa's Go from first step), published from NHK, 2004. ==Game software== She also authored some Go-related game software. * 梅沢由香里の対局囲碁 (PlayStation version in 1998, Windows version in 2001.) * Yukari Umezawa Go Seminar, made for Xbox, 2002. * :ja:梅沢由香里のやさしい囲碁, made for Nintendo DS and PlayStation Portable, 2008. ==Notes== ==Other websites== * Yukari Umezawa's home page * A webpage archive about Umezawa at Nihon Ki-in's website * A Nipponia article about Umezawa * Yukari Umezawa manga at Media Arts Database * Yukari Yoshihara manga at Media Arts Database * Yukai Umezawa anime at Media Arts Database * Category:1973 births Category:Go players from Tokyo Category:Living people Category:Sportswomen Category:Keio University alumni",
 "title": "Yukari Yoshihara"
}