{
 "id": "768674",
 "text": "The Categoría Primera A is a Colombian professional league for football clubs. It is the highest division in the Colombian football league system. The league was founded in 1948. == Format == The league has 20 teams. The teams play through the Apertura and Finalización tournaments each year. Both tournaments are conducted according to an identical three-stage format. The first stage is in round-robin format, with each team playing the other teams once for a total of 19 matches. The top eight teams then advance to a knockout round consisting of two groups, each team playing six times in a round-robin format. The two leaders of each group go to the final, which is played in a home and away leg system. The winner of the final is the champion. At the end of the Finalizacion tournament, a supercup is played between the winner of the Apertura tournament and the Finalizacion tournament. The winner of the supercup would be the grand champion. == Teams == Team City Stadium Capacity Alianza Petrolera Barrancabermeja Daniel Villa Zapata 10,400 América de Cali Cali Pascual Guerrero 33,130 Atlético Bucaramanga Bucaramanga Alfonso López 28,000 Atlético Nacional Medellín Atanasio Girardot 40,043 Boyacá Chicó Tunja La Independencia 20,630 Cúcuta Deportivo Cúcuta General Santander 42,901 Deportes Tolima Ibagué Manuel Murillo Toro 28,100 Deportivo Cali Palmira Deportivo Cali 44,000 Deportivo Pasto Pasto Departamental Libertad 20,665 Deportivo Pereira Pereira Hernán Ramírez Villegas 30,297 Envigado Envigado Polideportivo Sur 11,000 Independiente Medellín Medellín Atanasio Girardot 40,043 Jaguares Montería Jaraguay 12,000 Junior Barranquilla Metropolitano Roberto Meléndez 49,692 La Equidad Bogotá Metropolitano de Techo 8,000 Millonarios Bogotá El Campín 36,343 Once Caldas Manizales Palogrande 28,678 Patriotas Tunja La Independencia 20,630 Rionegro Águilas Rionegro Alberto Grisales 14,000 Santa Fe Bogotá El Campín 36,343 Category:Football in Colombia",
 "title": "Categoría Primera A"
}