{
 "id": "768792",
 "text": "The national anthem of Thailand (, ) is a national song representing Thailand—then known as Siam—created in 1932. Composed in the same year by Phra Chenduriyang, it originally had no lyrics (words). Later that year, words by Khun Wichitmatra were adopted; two years later, the lyrics were changed by Chan Khamvilai. Then in 1939, when the country's name was changed from \"Siam\" to \"Thailand\", the lyrics written by Luang Saranupraphan were made official after winning a competition, and this has since remained the national anthem today. Thailand also has a royal anthem called \"Sansoen Phra Barami\" (สรรเสริญพระบารมี).http://www.nationalanthems.info/th%5E.htm Thailand (national anthem). nationalanthems.info. 2013. Kendall, David. ==Lyrics== ===Current official lyrics=== Thai original Romanization Pronunciation Translation ประเทศไทยรวมเลือดเนื้อชาติเชื้อไทย เป็นประชารัฐ ไผทของไทยทุกส่วน อยู่ดำรงคงไว้ได้ทั้งมวล ด้วยไทยล้วนหมาย รักสามัคคี ไทยนี้รักสงบ แต่ถึงรบไม่ขลาด เอกราชจะไม่ให้ใครข่มขี่ สละเลือดทุกหยาดเป็นชาติพลี เถลิงประเทศชาติไทยทวี มีชัย ชโยThailand (national anthem). nationalanthems.info. Kendall, David (2013).A Story of Two Songs – The Interesting History of the Thai National Anthem. TheThailandLife.com (by Peter).เนื้อเพลง เพลงชาติไทย - พระเจนดุริยางค์. Meemodel – Thailand cute variety. Pràthē̂t thai ruam lư̂at nứa chā̂t chứa thai Pen pràchā rát, phàthai khǫ̌ng thai thúk sùan Yù damrong khǫ̌ng wái dā̂i tháng muan Dư̂ai thai lúan mā̌i, rák sǎmákkhī Thai nī rák sàngòp, tę̀ thư̌ng róp mâi khlā̀t Ḕkkàrā̂t cà mâi hâi khrai khòm khī̂ Sàlà lư̂at thúk yā̀t pen chā̂t phálī Thàlơ̄̌ng pràthē̂t chā̂t thai tháwī, mī chai, cháyō! [prà.tʰêːt̚ tʰaj ruə̯m lɯ̂ə̯t̚ nɯ́ə̯ tɕʰâːt̚ tɕʰɯ́ə̯ tʰaj] [pem prà.tɕʰaː rát̚ ǀ pʰà tʰaj kʰɔ̌ŋ tʰaj tʰúk̚ sùə̯n] [jùː dam.roŋ kʰɔ̌ŋ wáj dâːj tʰám muə̯n] [dûə̯j tʰaj lúə̯m mǎːj ǀ rák̚ sǎ.mák̚.kʰiː] [tʰaj níː rák̚ sà.ŋòp̚ ǀ tɛ̀ː tʰɯ̌ŋ róp̚ mâj kʰlàːt̚] [ʔèːk̚.kà.râːt̚ tɕàʔ mâj hâj kʰraj kʰòm kʰîː] [sà.làʔ lɯ̂ə̯t̚ tʰúk̚ jàːt̚ pen tɕʰâːt̚ pʰá.liː] [tʰà.lɤːm prà.tʰêːt̚ tɕʰâːt̚ tʰaj tʰá.wiː ǀ miː tɕʰaj ǀ tɕʰá.joː] The flesh and blood of every Thai united, This land of Thailand – sacred to every Thai! Their sway since days of yore persisted, Love and unity – heart of every Thai! Though we Thais love peace, dauntlessly we fight, Our freedom won't be taken away. We'll sacrifice ourselves with every might, Long live Thailand's glory and victory – hooray! ===Pre–1939 version=== Thai original Romanization Translation เหล่าเราทั้งหลายขอน้อมกายถวายชีวิต รักษาสิทธิ์อิสสระณแดนสยาม ที่พ่อแม่สู้ยอมม้วยด้วยพยายาม ปราบเสี้ยนหนามให้พินาศสืบชาติมา แม้ถึงภัยไทยด้อยจนย่อยยับ ยังกู้กลับคงคืนได้ชื่นหน้า ควรแก่นามงามสุดอยุธยา นั้นมิใช่ว่าจะขัดสนหมดคนดี เหล่าเราทั้งหลายเลือดและเนื้อเชื้อชาติไทย มิให้ใครเข้าเหยียบย่ำขยำขยี้ ประคับประคองป้องสิทธิ์อิสสระเสรี เมื่อภัยมีช่วยกันจนวันตาย จะสิ้นชีพไว้ชื่อให้ลือลั่น ว่าไทยมั่นรักชาติไม่ขาดสาย มีไมตรีดียิ่งทั้งหญิงทั้งชาย สยามมิวายผู้มุ่งหมายเชิดชัยไชโย Lào rao tháng lā̌i khǭ̌ nǭ́m kāi thàwǎi chīwít Râksā̌ sìt ìtsàrà ná dę̄n sàyā̌m Thī̂ phǭ̂ mę̄̂ sū̂ yǭm múai dûai pháyāyām Prā̀p sîan nā̌m hâi phínā̂t sư̄̀p chā̂t mā Mę̄́ thư̌ng phai thai dǭ̂i con yǭ̂i yáp Yang kū̂ klàp khong khưn dâi cư̄̂n nā̂ Khuan kę̄̀ nām gām sùt àyúttháyā Nán mí chái wā̂ cà khàt sǒn mòt khon dī Lào rao tháng lā̌i lư̂at lę́ nứa chứa chā̂t thai Mí hâi khrai khâo yìap yâm khàyǎm khàyī̌ Pràkháp pràkhǭng pǭ̂ng sìt ìtsàrà sē̂rī Mư̂a phai mī chûai kan con wan tāi Cà sîn chī̂p wái chư̄̂ hâi lư̄ lân Wā̂ thai mǎn rák chā̂t mâi khàt sā̌i Mī maitrī dī yîng tháng yîng tháng chāi Sàyā̌m mí wāi phū̂ mûng mā̌i chơ̄̂t chai chaiyō Let us all sacrifice our lives To maintain the rights to freedom the land of Siam That the ancestors tried to fight until their death Eliminate the enemies of Thailand to perish Even though the Thai disaster is inferior But still able to restore the independence back It is an honor to the beautiful Ayutthaya That is not an end to good people. All of us, we are of Thai blood Doesn't allow anyone to oppress us Protect rights and freedom When disaster helped each other until the day of death If we die, the name will be spread That Thailand is firmly in love with the nation Have great friendship for both men and women The glory of Siam will never be lost, hurrah! ===Original lyrics=== Thai original Romanization Translation แผ่นดินสยามนามประเทืองว่าเมืองทอง ไทยเข้าครองตั้งประเทศเขตต์แดนสง่า สืบเผ่าไทยดึกดำบรรพ์โบราณลงมา รวมรักษาสามัคคีทวีไทย บางสมัยศัตรูจู่โจมตี ไทยพลีชีพร่วมรวมรุกไล่ เข้าลุยเลือดหมายมุ่งผดุงผะไท สยามสมัยบุราณรอดตลอดมา อันดินสยามคือว่าเนื้อของเชื้อไทย น้ำรินไหลคือว่าเลือดของเชื้อข้า เอกราษฎร์คือเจดีย์ที่เราบูชา เราจะสามัคคีร่วมมีใจ รักษาชาติประเทศเอกราชจงดี ใครย่ำยีเราจะไม่ละให้ เอาเลือดล้างให้สิ้นแผ่นดินของไทย สถาปนาสยามให้เทอดไทยไชโย Phę̄̀ndin sàyā̌m nām pràthưang wā̂ mưang thǭng Thai khâo khrǭng tâng pràthē̂t khḕt dę̄n sàngā̀ Sư̄̀p phào thai dừkdamban bōrān long mā Ruam ráksā̌ sā̌mákkī táwī thai Bāng sàmǎi sattrū cū̀ cōmtī Thai phlī chī̂p rûam ruam rúk lâi Kâo lui lư̂at mā̌i mûng phàdung phàtai Sàyā̌m sàmǎi bùrān rǭ̂t tàlǭ̀t mā An din sàyām khư̄ wā̂ nứa khǭ̌ng chứa thai Nā́m rin lǎi khư̄ wā̂ lư̂at khǭ̌ng chứa khā̂ Ḕkkàrā̂t khư̄ cēdī thī̂ rao būchā Rao cà sā̌mákkī rûam mī chai Ráksā̌ chā̂t pràthē̂t ḕkkàrā̂t cong dī Khrai yâmyī rao cà mâi lá hâi Ao lư̂at lā́ng hâi sîn phę̄̀ndin khǭ̌ng thai Sàthā̌pànā sàyā̌m hâi thơ̄̂t thai cháiyō The Siamese land is renowned as the land of gold. The Thais have conquered this beautiful land. The Thai people have served it ever since the Ancient times. United, we have defended it In some eras, our foes have attacked us. But the Thais sacrificed their lives to save their motherland. With blood, we fought for our sovereignty And hitherto we have kept Siam alive. This Siamese land is the bulwark of the Thai race Our blood runs through this nation's veins. Independence is like a pagoda we honor We will rise and stand as one. To protect our motherland and sovereignty so dear. There will be no mercy for those who dishonor it. We shall massacre them until their last. To glorify our great Siamese land, hurrah! ==Trivia== *Endorsed by law, people are expected to stand up to show their respect whenever the national anthem is played in public.https://theculturetrip.com/asia/thailand/articles/thailands-national- anthems-what-you-should-know/?amp=1 Thailand's National Anthems: What You Should Know. Culture Trip. Hulme, Kyle. 1 March 2018. ==References== Category:1932 songs Category:Asian anthems Category:National symbols of Thailand",
 "title": "Thai National Anthem"
}