{
 "id": "768704",
 "text": "The A4, also called the Autoroute de l'Est (Autoroute of the East) in French, is an autoroute (motorway) in France. It is the third-longest autoroute in France. It is long. The A10 is the longest (), the A89 is the second-longest (). The A4 connects Paris with Strasbourg. It is part of the E25 and E50 European routes. The A4 goes past Disneyland Paris, linking it with the city of Paris. The autoroute also goes through the cities of Reims and Metz. The end of the autoroute in Strasbourg joins onto the A35 autoroute towards Mulhouse and Switzerland. ==Exits and junctions== Exit/Junction Destination Boulevard Périphérique 2 (westbound only) Charenton 3 Maisons Alfort, St Maurice 4 , Joinville-le-Pont Bordeaux, Nantes, Lyon 5 , Nogent-sur-Marne A1, Lille, Bobigny 6 (Eastbound only) Champingy-sur-Marne 8 Marne-la-Vallée Porte de Paris 9 (Westbound only) Noisy le Grand - Centre 10 Marne-la-Vallée Cite D'escartes Lyon, Bordeaux, Nantes 10.1 Marne-la-Vallée Val Maubué, Lille, Charles de Gaulle 12 Marne-la-Vallée Val de Bussy 12.1 (Eastbound only) Marne- la-Vallée Val d'Europe 13 Marne-la-Vallée Val de Lagny Provins 14 Marne-la- Vallée Val d'Europe Parcs DISNEY 15 (Westbound only) Coutevroult 16 Crécy-la- Chapelle Meaux 18 St. Jean-les-Deus-Jumeaux 19 Montreuil-aux-Lions 20 Château- Thierry 21 Dormans 22 Reims Centre -Tinqueux (North) Calais, Brussels, Lille 23 Epernay, Reims Sud Charleroi, Reims Est (South) Troyes Lyon 27 La Veuve 28 St. Etienne-au-Temple 29 Sainte-Menehould 29.1 Clermont-en-Argonne 30 Voie Sacrée 31 Verdun 32 Fresnes-en-Woëvre 33 Jarny 34a (Eastbound only) Batilly 34/34b Ste. Marie 35 Marange-Silvange 36 Sémécourt , Croix de Hauconcourt 37 Argancy , Bifurcation de Mey , Bifurcation de Lauvallières 38 Boulay 39 Saint- Avold 40 , Freyming-Merlebach 41 Farébersviller 41.1 (Eastbound only) Puttelange 42 Sarreguemines 43 Sarre-Union 44 Phalsbourg () 45 Saverne 46 Hochfelden 47 , Brumath-nord 48 Brumath-sud 49 Reichstett 49.1 Hoenheim 50 Bischheim 51 Strasbourg-centre ==References== A04",
 "title": "A4 autoroute"
}