{
 "id": "768774",
 "text": "Don McNeill (1934 – June 27, 2015) was a Canadian journalist. He was a foreign correspondent for the Canadian Broadcasting Corporation and CBS News. == Life and career == He was born in 1934. He was from St. John's, Newfoundland and Labrador. He studied at Memorial University of Newfoundland, the Technical University of Nova Scotia, and Oxford University. At Oxford, he played basketball for an unofficial team he started. While in the United Kingdom, he worked for the Daily Mail. After returning home to Canada, McNeill began working for the Canadian Broadcasting Corporation. He was the CBC's correspondent in Washington, D.C. and worked for Newsmagazine. He reported on the Vietnam War, the Watergate scandal, and the Iranian Revolution for the CBC. McNeil later moved to the United States, where he worked for CBS News until 1987. He was the CBS News correspondent at Moscow. He later worked for Christian Science Monitor Television. He got a Rhodes Scholarship in 1958. He got a Nieman Fellowship in 1981. In 1984, he won the George Polk Award for Network Television Reporting for his \"unusual glimpses of Soviet life\". He was nominated for the 1988 News & Documentary Emmy Award for \"Outstanding Interview/Interviewers - For Programs\" as a producer and correspondent of The Christian Science Monitor Reports. He won the 1990 News and Documentary Emmy Award for \"Outstanding Informational, Cultural or Historical Programming (segments)\" as a correspondent of a World Monitor segment on the Soviet Union. He was a journalism teacher at Boston University. His wife Sandra Allik produced her husband's Emmy-winning report. She once said that his husband's award was \"a bigger deal than an Emmy\". He died on June 27, 2015 in Boston, aged 80. == References == Category:1934 births Category:2015 deaths Category:People from Newfoundland and Labrador Category:Canadian journalists Category:Canadian basketball players Category:Alumni of the University of Oxford Category:Harvard University alumni Category:George Polk Award winners Category:Emmy Award winners",
 "title": "Don McNeill"
}