{
 "id": "768801",
 "text": "Krishna Janmashtami, also known simply as Janmashtami or Gokulashtami, is an annual Hindu festival that celebrates the birth of Krishna, the eighth avatar of Vishnu. It is observed according to the Hindu calendar. It is on the eighth day of the Krishna Pakshain Shraavana or Bhadrapad (depending on whether the calendar chooses the new moon or full moon day as the last day of the month), which overlaps with August/September. == Significance of Janmashtami == Janmashtami holds deep spiritual and philosophical significance. It teaches devotees important life lessons such as the pursuit of righteousness, the significance of selfless service, and the ultimate victory of good over evil. Lord Krishna's teachings in the Bhagavad Gita emphasize the importance of performing one's duty without attachment to the results, which resonates with people from all walks of life. Krishna Janmashtami Also called Krishnashtami, SaatamAatham, Gokulashtami, Yadukulashtami, Srikrishna Jayanti', Sree Jayanti Observed by Hindus Type Religious (1–2 days), cultural Celebrations Dahi Handi (next day), kite-flying, fair, traditional sweet dishes etc. Observances Dance, puja, night vigil, fasting 2019 date Friday–Saturday, 23–24 August 2020 date Wednesday–Thursday, 12–13 August 2021 date Monday–Tuesday 30–31 August 2022 date Thursday–Friday 18–19 August 2023 date Wednesday–Thursday, 6–7 September It is an important festival particularly to the Vaishnavism tradition of Hinduism. Dances of the life of Krishna according to the Bhagavata Purana (such as Rasa Lila or Krishna Lila), devotional singing at midnight when Krishna was born, fasting (upavasa), a night vigil (ratri jagaran), and a festival (mahotsava) on the following day are a part of the Janmashtami celebrations. It is celebrated throughout India. Krishna Janmashtami is followed by the festival Nandotsav, which celebrates the occasion when Nanda Maharaj, father of Krishna, distributed gifts to the villagers of Vrindavan in honor of the birth. == References == Category:Hindu festivals",
 "title": "Krishna Janmashtami"
}