{
 "id": "76893",
 "text": "The raccoon (Procyon lotor, common raccoon,) is a mammal. Raccoons are curious, clever, and solitary. They are originally from North America. They have spread through Central America, and live in various habitats. They have escaped in some parts of Eurasia (see map), and now live there as well. Raccoons are in the family Caniformia, and are related to the mustelids. The raccoon has short legs, a pointed nose, small ears, grayish-brown fur, and a bushy tail. The raccoon's most distinctive features are its multi-purpose front paws, its facial 'mask', and its striped tail. Moreover, raccoons are noted for their intelligence. Studies show they are able to remember the solution to tasks for up to three years.Hohmann, Ulf; Bartussek, Ingo & Böer, Bernhard 2001. Der Waschbär. Reutlingen, Germany: Oertel+Spörer, pp. 71–72. Raccoons are usually nocturnal. Their food is about 40% invertebrates, 33% plant foods, and 27% vertebrates. Raccoons are omnivores.MacClintock, Dorcas 1981. A natural history of raccoons. Caldwell, New Jersey: The Blackburn Press. They feed on mice, squirrels, rabbits, birds, fish, frogs, turtles, lizards, snakes, eggs, insects, worms, fruit, and nuts. Their predators are red foxes, wolves, coyotes, bears, eagles, hawks, owls, cougars, and lynxes. Most raccoons live in the wild. Being around humans does not bother them. They often nest in empty buildings, garages, sheds, and even the attics of houses. Raccoons do not hibernate in the winter. Those that live further north where it is colder, grow thick coats to keep them warm and spend long periods sleeping. Raccoons that live in captivity can survive up to 20 years. In the wild, they usually live only 1–3 years. Two other species of raccoon, the crab-eating raccoon (P. cancrivorus) and the Cozumel Island raccoon (P. pygmaeus), are extremely similar to the common raccoon. The crab-eating raccoon is quite widespread in eastern South America. After a gestation period (pregnancy) of about 65 days, two to five young are born in spring. Newborn raccoons are called \"kits\". *A raccoon climbed a building in Minnesota.Daredevil raccoon's Minnesota skyscraper climb. BBC News == Footnotes == ==Other websites== Category:Procyonids Category:Mammals of North America Category:Omnivores",
 "title": "Raccoon"
}