{
 "id": "769146",
 "text": "This is a list of the men's national association football (soccer) teams in the world. There are more nations with football teams than for any other sport. Teams represent 191 of the 193 UN member states, as well as several dependent territories, sub-national entities, and states who are not members of the United Nations. This list divides teams into two main groups: * Teams which are either members of FIFA (International Federation of Association Football) the world's football governing body (211 teams), or have membership in a FIFA-affiliated continental confederation without being members of FIFA (12 teams). * Teams who are not members of FIFA or any continental federation, but which represent sovereign states. This group includes United Nations members and observer states, as well as states who are not members of the UN (11 teams). This list excludes other teams that generally play Non-FIFA football. Excluded teams include those who represent ethnic groups, sub- national entities, separatist movements, and micro-nations. == Members of FIFA affiliated confederations == This section lists the current 211 men's national football teams affiliated to FIFA, through their national football associations, and the 12 men's national football teams who have membership in one of FIFA's affiliated continental confederations, but are not members of FIFA. These are displayed in the main list in italics. FIFA members are eligible to enter the FIFA World Cup and matches between them are recognized as official international matches. Based on their match results over the previous four-year period, the FIFA World Rankings, published monthly by FIFA, compare how good the national teams are on a point-based system. Some national teams who are members of a confederation but not FIFA members compete in confederation-level and subregional tournaments. However, These teams are not allowed to participate in the World Cup. The six confederations are: * Asia – Asian Football Confederation (AFC) * Africa – Confederation of African Football (CAF) * North, Central America and the Caribbean – Confederation of North, Central American and Caribbean Association Football (CONCACAF) * South America – Confederación Sudamericana de Fútbol (CONMEBOL) * Oceania – Oceania Football Confederation (OFC) * Europe – Union of European Football Associations (UEFA) FIFA runs the World Cup as a tournament for national teams to find the world champion. Each confederation also runs its own championship to find the best team from among its members: * AFC – AFC Asian Cup * CAF – Africa Cup of Nations * CONCACAF – CONCACAF Gold Cup * CONMEBOL – Copa América * OFC – OFC Nations Cup * UEFA – UEFA European Championship Although it is not a confederation, the Union of Arab Football Associations (UAFA) coordinates football activities between Arabic-speaking countries. All 22 national governing bodies that form UAFA are also members of both FIFA and either the AFC or CAF. National teams from UAFA member countries are noted in the list below. The Confederation of Independent Football Associations (ConIFA) is an organization for teams representing unrecognised states, subnational regions, and stateless minorities, as well as teams from recognised states that have not managed to gain entry into FIFA. While none of its current members are also members of FIFA, a few hold associate membership in one of the confederations affiliated with it. These teams are also noted in the list below. === AFC (Asia) === The AFC is subdivided into five sub-federations: * West Asian Football Federation (WAFF) – represents nations at the western extremity of the continent, except Iran and Israel. * East Asian Football Federation (EAFF) – represents nations in East Asia, plus Guam and Northern Mariana Islands. * Central Asian Football Association (CAFA) – represents nations in Central Asia, except Kazakhstan, plus Iran and Afghanistan. * South Asian Football Federation (SAFF) – represents nations in South Asia, except Afghanistan. * ASEAN Football Federation (AFF) – represents nations in Southeast Asia, plus Australia. * * 1 * 2 * * * * * 3 * 4 * * * * * 5 * 2 * * 2 * 6 * 7 * 2 * 8 * * 2 * * * * * * * 9,10 * 2 * * 2,11 * * 2 * 2 * * * 2 * * * * * 2 * * * 2 === CAF (Africa) === CAF is divided into five regional federations: * Council for East and Central Africa Football Associations (CECAFA) – represents nations generally regarded as forming the regions of East Africa and some nations of Central Africa. * Council of Southern Africa Football Associations (COSAFA) – represents nations generally regarded as forming Southern Africa, as well as island states off the coast of Southern Africa. * West African Football Union (WAFU/UFOA) – represents nations in West Africa. * Central African Football Federation – represents some of the nations that form Central Africa. * 1 * * * * * * * * * * 1 * * 2 * * 1 * 1 * * * * * * * * * * * * * 1 * * * * 1 * * 1 * * * * * 3 * * * * * * 1 * * * 1 * * * 1 * * * 3,4 * === CONCACAF (North America, Central America, and the Caribbean) === The CONCACAF federation is divided into three regional federations that have responsibility for part of the region's geographical area: * Caribbean Football Union (CFU) – represents all nations in the Caribbean, plus Bermuda and three nations in South America. * North American Football Union (NAFU) – represents the teams of Canada, Mexico and the USA. * Union Centroamericana de Fútbol (UNCAF) – represents the seven nations of Central America. * * * * * * * * 1 * * * * * * * * * * 1 * * 1 * * * * * * 1 * * * * * * * * 1 * * 1 * * * * * === CONMEBOL (South America) === * * * * * * * * * * === OFC (Oceania) === * * * * 1,2 * * 3 * 1 * * * * * * 1,2 * === UEFA (Europe) === * * * * * * * * * * * * * * * * * * * * * * * * * 1 * * 2 * * * * * * * * * * * * * * * * * * * * * * * * * * * * == National teams not affiliated to FIFA confederations == The national football teams included in this section are not members of FIFA, or of any of its affiliated continental confederations. These teams are not eligible to enter the FIFA World Cup or any continental confederation championships. FIFA's statutes do not allow member teams to compete against these sides without FIFA's prior permission. Several national associations for teams included in this section are members of ConIFA; these are indicated in the lists below. This section lists: * 5 teams representing sovereign states who are members or observers of the United Nations. * 7 teams representing states which are not members of the United Nations. === Unaffiliated United Nations states === There are seven United Nations member and observer states which are not members of FIFA or any of its affiliated continental confederations. Five of them, however, have fielded national association-organised teams in unofficial friendly matches, regional tournaments (such as the Pacific Games or Micronesian Games), or in global tournaments that are not regulated by FIFA. These teams are listed below. * 1 * 2 * 3 * 4 * 1: Senior national football teams representing the United Kingdom have only played unofficial friendly matches (usually under the name \"Great Britain\", though there have also been \"Rest of the United Kingdom\" representative teams). Otherwise, the UK is represented in FIFA and UEFA organized football by the teams of its constituent countries: England, Northern Ireland, Scotland, and Wales (these teams are listed in the UEFA subsection above). Teams representing the entire kingdom have also competed in the Summer Olympics, such as the Great Britain Olympic football team. 2: Official name used by the Pacific Games Council for Micronesia.http://websites.sportstg.com/get_file.cgi?id=36026860 3: National governing body is a member of ConIFA. 4: Listed as associate member of the OFC in 2002 and again in 2006. It is unclear whether Palau is still associated with the confederation. Two other UN member states (the Marshall Islands and Nauru) have never fielded a national association-organised football team, though there are reports that amateur football teams claiming to represent the Nauru national soccer team have participated in local friendly matches on at least two occasions. ===Others=== ====Membership criteria of FIFA and affiliated confederations==== Historically, the majority of FIFA and confederation members have been sovereign states with wide diplomatic recognition. Exceptions to this rule include the British Home Nations (due to their small role in the development of football), the Republic of China (which does not enjoy wide recognition but is still accepted as a representative of the Taiwan area), and certain dependent territories, autonomous areas, and protectorates, which have been allowed to hold membership in FIFA and/or one of its affiliated confederations based on their political autonomy, separate status, and/or distance from their parent state. At present, FIFA members include 23 subnational and dependent territories, as well as two states with limited international recognition. The FIFA-affiliated football teams that belong to non-UN members are: ; 3 sovereign states with limited international recognition * * * ; 1 associated state of New Zealand * ; 4 constituent countries of the United Kingdom * * * * ; 7 British Overseas Territories * * * * * * * ; 2 constituent countries of the Kingdom of the Netherlands * * ; 1 constituent country of the Kingdom of Denmark * ; 4 unincorporated territories of the United States * * * * ; 2 overseas territories of France * * ; 2 special administrative regions of China * * Ten other overseas, dependent, and autonomous territories with close ties to a sovereign state do not have membership in FIFA, but are members of one of its affiliated confederations. == Former national football teams == These national teams no longer exist due to the dissolution of the nation or territory that they represented. Only national teams that were once members of FIFA are listed below. Preceding team Successor team(s) (inherited position/results) Other successor team(s) Notes Represented Czechoslovakia until its dissolution into the Czech Republic and Slovakia in 1993. Competed as Representation of Czechs and Slovaks for the remainder of their 1994 World Cup qualifying games. Represented the Saarland Protectorate from 1950 to 1956 before its union with the Federal Republic of Germany. (officially Germany ) Represented West Germany between 1950 and 1990, before reunification with East Germany. Was considered a continuation of the team that had represented the German state prior to 1942. (officially Germany ) Represented East Germany between 1952 and 1990, before reunification with West Germany. Represented Ireland from 1882. From 1922, when the Irish Free State (later Republic of Ireland) left the United Kingdom, until 1953, it continued to pick players from across the Island of Ireland, before becoming restricted to players only from Northern Ireland under pressure from FIFA. Represented the Federation of Malaya from 1953 until its union with Sarawak, North Borneo and Singapore to form Malaysia in 1963. Singapore, which gained independence in 1965, retained its preexisting national team. Represented Tanganyika until its union with Zanzibar as Tanzania in 1964. Zanzibar is an associate member of CAF and so is not a member of FIFA. Represented the British Mandate for Palestine from 1934 until the formation of the State of Israel in 1948. A team representing the Palestinian territories was formed in 1953 and was admitted into FIFA in 1998. (officially Vietnam) Represented South Vietnam from 1949 until 1975. North and South Vietnam maintained separate football teams from 1954 to 1975. The current Vietnam national football team is considered a successor of the South Vietnam team as North Vietnam was not a FIFA member. (officially Yemen ) Represented North Yemen from 1965 until its union with South Yemen in 1990. (officially Yemen ) Represented South Yemen from 1965 until its union with North Yemen in 1990. Represented the United Arab Republic from 1958 to 1961 until the secession of Syria. Was considered a continuation of the previous Egypt national football team, which became its successor team. The team continued to be known as the United Arab Republic until 1970. Represented the Soviet Union from 1940 until its dissolution in 1991. This was considered a continuation of the team that had previously represented the Russian Empire. Teams representing Estonia, Latvia and Lithuania had all been active independently prior to their incorporation into the Soviet Union in 1940. Represented the Commonwealth of Independent States and Georgia from January 1992 until the end of the Euro 1992 tournament, in order to take the Soviet Union's place in that competition. Federal Republic of Yugoslavia Represented Yugoslavia between 1920 and 1992, before the dissolution of the Socialist Federal Republic of Yugoslavia into Bosnia-Herzegovina, Croatia, Federal Republic of Yugoslavia, North Macedonia and Slovenia (later renamed Serbia and Montenegro) Represented the Federal Republic of Yugoslavia, known as Serbia and Montenegro after 2003, from 1992 until its dissolution into Serbia and Montenegro in 2006. Kosovo declared independence from Serbia in 2008, and its national team was accepted into UEFA and FIFA in 2016. Aruba became a separate nation in 1986 and was recognized by FIFA in 1988. The former team represented the Netherlands Antilles until the dissolution of the country in 2010. Formerly known as \"Curaçao\", this name was restored in March 2011 when the new constituent country of Curaçao took the Netherlands Antilles' place in FIFA and CONCACAF. The teams representing Bonaire and Sint Maarten are full members of CONCACAF, but not of FIFA. ===New names=== In addition to the above, other nations have been renamed: * → in 1960 → in 1963 → in 1971 → in 1997 * British Gambia → in 1965 * → in 1966 * → in 1989 * → in 1970 → in 1975 → in 1979 * → in 1972 * → in 1958 until 2010 * → in 1993 * → in 1975 * → in 1945 * → in 2003 * → in 2019 * French Somaliland → in 1977 * → in 1960 * → in 1957 * → in 1936 → in 1954 * → in 1983 * Kingdom of Serbs, Croats, and Slovenes → Yugoslavia in 1929 * Madagascar → in 1958 → in 1975 * Middle Congo → in 1960 → in 1992 * → in 1980 * → in 1964 * → in 1966 * Portuguese Guinea → in 1975 * → in 1923 * → in 1964 → in 1980 * Surinam → in 1954 * → in 2018 * → in 1971 * → in 1984 * → in 1996 ;Notes ==Related pages== * List of FIFA country codes * List of women's national association football teams ==Notes== ==References== == Sources == * Category:FIFA Category:Football- related lists",
 "title": "List of men's national association football teams"
}