{
 "id": "76967",
 "text": "The Lord's Prayer is the best known prayer in the Christian religion. It is also known as the Our Father (the first two words of the prayer) and Pater noster (which is Latin for “Our Father”). It was not until the Protestant Reformation that it was called the Lord's Prayer. The prayer is spoken in two places in the New Testament of the Bible (Matthew 6:9-13 and Luke 11:1-4). Jesus' disciples asked him how they should pray. Jesus gave an example of how to pray to Father God. The Bible has been translated into English several times. Therefore, there are slightly different versions that are used. The traditional and one of the best-known versions is the translation from the Book of Common Prayer (1662): : :Our Father, which art in heaven, :hallowed be thy name; :thy kingdom come; :thy will be done, :in earth as it is in heaven. :Give us this day our daily bread. :And forgive us our trespasses, :as we forgive them that trespass against us. :And lead us not into temptation, :but deliver us from evil. :(For thine is the kingdom, :the power, and the glory, :For ever and ever.) :Amen. : :_In Simple English:_ :Our Heavenly Father, may your name be glorified. :May your kingdom come; may your will be done on earth as it is in heaven. :Give us our daily bread today. :And forgive us our offenses, as we forgive those who offend us. :And don't allow us to fall into temptation, but save us from evil. :Because the kingdom, power and glory are yours for ever and ever. :Amen. :[There are many similar interpretations that could be used here; some Christians are quite particular about the exact vocabulary they use, and some are not.] == Latin version == The Latin version has been very important in Church history. It is given below: :Pater noster, qui es in caelis, :sanctificetur nomen tuum. :Adveniat regnum tuum. :Fiat voluntas tua, :sicut in caelo, et in terra. :Panem nostrum quotidianum da nobis hodie, :et dimitte nobis debita nostra, :sicut et nos dimittimus debitoribus nostris. :Et ne nos inducas in tentationem, :sed libera nos a malo. :Amen. == Greek version == The best known version of the text is found in Matthew. Its Greek language original is given below: :Πάτερ ἡμῶν ὁ ἐν τοῖς οὐρανοῖς· :ἁγιασθήτω τὸ ὄνομά σου· :ἐλθέτω ἡ βασιλεία σου· :γεννηθήτω τὸ θέλημά σου, :ὡς ἐν οὐρανῷ καὶ ἐπὶ τῆς γῆς· :τὸν ἄρτον ἡμῶν τὸν ἐπιούσιον δὸς ἡμῖν σήμερον· :καὶ ἄφες ἡμῖν τὰ ὀφειλήματα ἡμῶν, :ὡς καὶ ἡμεῖς ἀφίεμεν τοῖς ὀφειλέταις ἡμῶν· :καὶ μὴ εἰσενέγκῃς ἡμᾶς εἰς πειρασμόν, :ἀλλὰ ῥῦσαι ἡμᾶς ἀπὸ τοῦ πονηροῦ. :(ὅτι σοῦ ἐστιν ἡ βασιλεία καὶ ἡ δύναμις καὶ ἡ δόξα εἰς τοὺς αἰῶνας·) :{ἀμήν. == Music == Many composers have written musical settings of the prayer. Some of them are: Luigi Cherubini, Martin Luther, Die Toten Hosen, Charles Gounod, Leoš Janáček, Franz Liszt, Giacomo Meyerbeer, Otto Nicolai, Bernardino Rizzi, Igor Stravinsky, Pyotr Ilyich Tchaikovsky, Leonard Bernstein (in Mass), Giuseppe Verdi and Leonardo Schiavo. == Other websites == === Text === * The Lord's Prayer in 1,437 languages and dialects * The Lord's Prayer in great number of languages and dialects with audio and video * The Lord's Prayer in Hebrew (with audio) * Matthew 6:9-13 in the English Standard Version Bible, set to music === Commentary === * The Lord's Prayer: Lord, Teach Us to Pray - Explored and Applied through text and audio readings * The Lord's Prayer by Thomas Watson * Praying the Lord's Prayer - Ways to Learn at Ligonier.org * Catechism of the Catholic Church * Catholic Encyclopedia * Jewish Encyclopedia * Some comments by Church Fathers on parts of the Lord's Prayer * Max Heindel: Rosicrucian view * Jehovah's Witnesses view * An overview of spurious “Aramaic translations” of the Lord's Prayer ==References== Category:Christian prayers",
 "title": "Lord's Prayer"
}