{
 "id": "76971",
 "text": "A space station is a artificial satellite in space that people can live at. All past and current space stations have been in low Earth orbit. Space stations can dock with other spacecraft. This allows transferring cargo and people. At present the International Space Station is the only space station in orbit. The first space station was Salyut 1. Prior stations were the seven Salyut stations, Skylab, Mir and the two Tiangong stations. The Chinese Space Station is planned for the future. Space stations are used to learn about how being in space for a long time affects the human body. They also are a place for science experiments and research. Space stations have been designed for more than one crew. Each crew member may stay aboard the station for weeks or months, and then is replaced by others. Some have spent more than one year at a time on a space station. This includes Vladimir Titov, Musa Manarov, Sergei Avdeyev and Valeriy Polyakov aboard Mir. == List of successful stations == The below list is of stations that made it to orbit and had at least one crew visit them. There have also been a few stations that have failed or were for testing. Those are not included on this list. Name Country Launched Burned up in atmosphere Days in orbit Days with people on board Crew and visitors (total) Visiting crewed spacecraft Visiting uncrewed spacecraft Mass kg Salyut 1 Soviet Union 19 April 1971 11 October 1971 23 3 2 - 18,500 Skylab United States 14 May 1973 11 July 1979 171 9 3 0 18,500 Salyut 3 Soviet Union 25 June 1974 24 January 1975 15 2 2 - 18,500 Salyut 4 Soviet Union 26 December 1974 3 February 1977 92 4 2 1 18,500 Salyut 5 Soviet Union 22 June 1976 8 August 1977 67 4 3 - 19,000 Salyut 6 Soviet Union 29 September 1977 29 July 1982 683 33 18 15 19,824 Salyut 7 Soviet Union 19 April 1982 7 February 1991 816 26 11 15 18,900 Mir Soviet Union, Russia 19 February 1986 23 March 2001 4594 125 39 68 129,700 International Space Station United States, Russia, Members of the ESA, Canada, Japan 20 November 1998 Still in orbit 240Subject to increase while station is in orbit. 103As of 28 April 2021. Subject to increase while station is in orbit. 136 925,335 Tiangong-1 China 29 September 2011 2 April 2018 26 6 2 1 8,506 Tiangong-2 China 15 September 2016 19 July 2019 26 2 1 1 8,506 ==Research and development of parts for space stations== In 2024, international media showed a film clip of a NASA test of putting too much pressure inside a LIFE (Large Integrated Flexible Environment) habitat, a room designed for a future space station. === Notes === == References ==",
 "title": "Space station"
}