{
 "id": "770169",
 "text": "The 1936 United States presidential election was the 38th United States presidential election. It was held on Tuesday, November 3, 1936. The candidates were Democrat Franklin D. Roosevelt, and his running mate John Nance Garner, and Republican Alf Landon of Kansas and his running mate, Frank Knox. == The results == Roosevelt, the incumbent president, was very popular. Many people liked his New Deal system. He won 46 states, 523 electoral votes and 27,476,000 votes. Landon, on the other hand, did not do well at all. He did not even win his home state of Kansas. He only won two states (Vermont and Maine), 8 electoral votes, and 16,679,000 votes. === Close states === New Hampshire, which is next to both Maine and Vermont, came within 2% of voting for Landon. That is, less than 2% more people voted for Roosevelt than Landon. Landon's home state, Kansas, came within 7.72% of supporting him. Other close states were Massachusetts (which came within 9.46% of supporting Landon) and Delaware (which came within 9.77% of supporting Landon). == The Republican primaries == Three men ran for the Republican nomination for president in 1936. They were: # William Borah, a senator from Idaho # Frank Knox, a publisher from Illinois # Alf Landon, the governor of Kansas Ultimately, Landon easily won. He chose Knox as his running mate. == Fun facts == * This was the last presidential election till 1964 in which North Dakota, South Dakota, Kansas, Indiana and Nebraska supported the Democratic candidate. * This was the only presidential election where Indiana voted Democrat for the second time in a row. * This was the only presidential election where South Dakota voted Democrat for the second time in a row. * The state of Vermont came the closest to voting Democrat than any presidential election before. * This is the last time for 80 years Orange County, California, would vote for the Democrat in a presidential election. * No US presidential candidate from the Democratic or Republican party received as few electoral votes as Alf Landon in 1936. == Sources == Category:United States presidential elections Category:1936 in North America Category:1930s in the United States",
 "title": "1936 United States presidential election"
}