{
 "id": "770300",
 "text": "Paternalism is an idea from political science: The idea is to limit autonomy of a person or group of people. It is also done against their will. People claim that this is done to protect them. Paternalism can also imply that the behavior is against or regardless of the will of a person, or also that the behavior expresses an attitude of superiority.Shiffrin, Seana. 2000. \"Paternalism, Unconscionability Doctrine, and Accommodation\". Philosophy and Public Affairs 29(3): 205–250. Paternalism, paternalistic and paternalist have all been used as a pejorative for example in the context of societal and/or political realms and references. People such as John Stuart Mill think paternalism can be appropriate towards children. He wrote: Paternalism towards adults is sometimes thought of as treating them as if they were children.Feinberg, Joel. 1986. Harm to Self. Oxford: Oxford University Press. p. 4 Mill shaped the idea of paternalism, in the 19th century. He took the concept from political science. He uses the pater familias of Ancient Rome: This term described the man who was head of the family, and responsible for it. In most cases, it was the oldest free man in the household. Mill says that paternalistic actions can only be justified in the case that they reduce the harm done to other people than the person acting, and that there are no other means that are equally effective. John Stuart Mill gave an example: There is a person who wants to cross a bridge, but the bridge is damaged. The person crossing the bridge is a foreigner, who does not speak the language, so there is no way to tell him, that the bridge is damaged. Mill says that it would be permissible to stop the person from crossing the bridge. This is done to find out if the person knows that the bridge is damaged. If he knows, and still wants to use the bridge, for example to jump off the bridge and commit suicide, then the person should not be stopped, according to Mill. This view is called soft paternalism. Another view is that there are circumstances, where he should be prevented from using the bridge, for example to commit suicide. This view is called hard paternalism. A welfare state can also be paternalistic. In that context people talk about negative paternalism and positive paternalism. In negative paternalism the idea is to protect the person against immediate damage or harm. Positive paternalism is about maximizing his welfare, for example protecting people form becoming poor when they are old. Starting from the 19th century, \"paternalism\" was also used in the context of what is known as the social question: Large employers offered benefits, such as funded housing or work restaurants where they workers could eat meals at reduced prices. Companies such as the Ford Motor Company also checked their employees' bank accounts, and if they went to church regulary. People such as Robert Owen founded whole settlements for their workers: One such example is New Harmony, Indiana. Another example is that of plantation owners in the southern United States, from the 17th to the 19th century: These people owned slaves, and there were man paternalistic rules what their slaves could and could not do.Ira Berlin: Generations of Captivity: A History of African-American Slaves, Cambridge, London: The Belknap Press of Harvard University Press, 2003, ISBN 0-674-01061-2, S. 63.Dominik Nagl: No Part of the Mother Country, but Distinct Dominions – Rechtstransfer, Staatsbildung und Governance in England, Massachusetts und South Carolina, 1630–1769, Berlin: Lit, ISBN 978-3-643-11817-2, 2013, S. 680–683. A modern example of paternalism is the olbigation to use a seat belt when travelling in a car. Many countries have this rule. There was a count case, R v Brown, in Great Britain in 1993. It is also known as Operation Spanner or the Spanner case: Five people who were active in the BDSM scene were convicted for hurting each other. As of the 21st century, this ruling is controversial. People who engage in BDSM practices get pleasure from either hurting and humiliating others, or form being hurt and humiliated. They therefore consent to such practices. The case was appealed at the European Court of Justice, in Laskey, Jaggard and Brown v United Kingdom, but the court upheld the ruling. Other examples of paternalistic rules are the obligation to vaccinate children against certain dfiseases, or the obligation to attend school. == Related pages == * Nanny state == References == Category:Liberalism",
 "title": "Paternalism"
}