{
 "id": "770462",
 "text": "The A10, also called l’Aquitaine, is the longest autoroute (motorway) in France. It is about long. The autoroute goes from Paris to Bordeaux. It goes past Orleans and Tours. It first opened in 1960. It is part of the European routes E5, E50, E60, and E606. ==Exits and junctions== Junction number Destinations Notes A 6a north - Villejuif; Paris; Arcueil (E 5 north; E 15 north; E 50 east) northbound exit and southbound entrance A 6b north - Lille; Metz; Nancy; Rungis; Aéroport Orly; Créteil northbound exit (Rue de Kuhlman) and southbound entrance Massy; Longjumeau; Antony-Z.A. (N 20 north) no northbound exit; N 20 joins southbound N 20 south - Étampes; Orléans; La Ville-du-Bois; Linas; Montlhéry; Longjumeau no southbound entrance; N 20 leaves southbound A126 to A 6 south - Évry; Lyon; Chilly-Mazarin N188 - Palaiseau; Antony; Massy; Villebon-sur-Yvette N444 - Versailles; Igny; Bièvres; Cité scientifique southbound exit and northbound entrance Gare de Massy-Palaiseau northbound exit and southbound entrance N 188 - Orsay; Bures southbound exit and northbound entrance Chartres; Les Ulis; Orsay; Z.A. de Courtabœuf southbound exit and northbound entrance N118 - Les Ulis; Rouen; Versailles; Boulogne-Billancourt; Paris-Porte de Saint-Cloud; Z.A. de Courtabœuf northbound exit and southbound entrance N 104 - Lyon; Metz; Nancy; Évry; Orléans via N 20; Linas; Montlhéry; Arpajon Dourdan; Limours; Saint- Arnoult-en-Yvelines A11 west - Ablis; Chartres; Le Mans; Rennes (E 50 west) southbound exit and northbound entrance; E 50 joins northbound and leaves southbound Étampes; Rambouillet; Allainville (N 191) Chartres; Janville; Châteaudun (N 254) Artenay (N154) E60 east - Orléans-Nord; Montargis; Fontainebleau; Saran; Centre Routier; Fleury-les-Aubrais (A 701 east) E60 joins southbound and leaves northbound A71 south - Orléans-Centre; Orléans- la Source; Vierzon; Bourges; Limoges; Clermont-Ferrand (E9 south) Meung-sur- Loire; Beaugency Mer; Chambord; Beaugency (N 152) Blois; Vendôme; La Chaussée- Saint-Victor (N 252) Angers; Château-Renault; Amboise A 28 north - Rouen; Le Mans Tours-Nord; Chartres; Le Mans; Angers; Laval; Aéroport Saint-Symphorien; Z.I. Tours-Nord (N 10; E 60 west) E60 joins northbound and leaves southbound Montlouis; Blois via Route nationale; Le Mans; Laval; Tours-Nord; Vouvray; Tours Val de Loire Airport (N 521) Tours-Centre; Montlouis; Saint-Pierre-des- Corps; Amboise Vierzon; Tours-Sud; Saint-Avertin (N 76; E 604) southbound exit and northbound entrance Châteauroux; Montbazon; Chambray; Loches (N 10; N 143) southbound exit and northbound entrance Tours-Sud; Saint-Avertin; Chambray- Centre (N 10) northbound exit and southbound entrance Saumur; Chambray-Sud; Joué-lès-Tours; Montbazon; Chinon (N 585) Monts; Sorigny; Montbazon; Z.A. Isoparc Chinon; Sainte-Maure-de-Touraine; Loches Châtellerault-Centre; Châtellerault-Nord; La Roche-Posay Châtellerault-Sud; Châtellerault-Centre; Naintré (N 10) Futuroscope; Jaunay-Clan; Chasseneuil-du-Poitou Limoges; Poitiers-Centre; Parthenay; Saumur; Angers; Poitiers-Nord (N 147; E 62) Angoulême; Poitiers-Sud; Poitiers-Centre; Vivonne; Lusignan (N 10) Saint- Maixent-l'École; Lusignan (N 11) A83 north - Angers; Nantes; La Roche-sur- Yon; Niort-Centre; Saint-Maixent-l'École Limoges; Angoulême; Melle; Niort-Est; Niort-Centre; Marais Poitevin Rochefort; La Rochelle; Surgères; Niort-Sud; Marais Poitevin (N 150; N 248; E 601) Cognac; Surgères; Aulnay; Saint- Jean-d'Angély A837 north - La Rochelle; Rochefort (E 602 north) northbound exit and southbound entrance E603 - Angoulême; Ile d'Oléron; Royan; Saintes (N 137) Jonzac; Cognac; Pons Montendre; Royan; Jonzac; Mirambeau Blaye; Montendre; Saint-Ciers-sur-Gironde Libourne; Saint-André-de-Cubzac; Bourg; Coutras; Saint-Antoine; Z.A. la Garosse (N 10) Angoulême; Barbezieux (N 10 north; E 606 north) northbound exit and southbound entrance Royan via Route nationale; Saintes via RN; Blaye (N 137; E 606) northbound exit and southbound entrance Libourne; Saint-André-de-Cubzac; Bourg northbound exit and southbound entrance Ambès; Z.I. Bassens; Zone portuaire Ambarès; Saint-Loubès (N 10 north) Ambarès; Sainte-Eulalie; Carbon-Blanc Carbon-Blanc; Bassens southbound exit only Lormont southbound exit and northbound entrance N 230 - Toulouse; Bayonne; Bassin d'Arcachon; Bordeaux; Périgueux southbound exit and northbound entrance A630 - Mérignac (E 5 south) southbound exit and northbound entrance ==References== Category:Autoroutes in France",
 "title": "A10 autoroute"
}