{
 "id": "77064",
 "text": "Fluid mechanics is the study of how fluids move and the forces on them.Munson, B. R., Okiishi, T. H., Huebsch, W. W., & Rothmayer, A. P. (2013). Fluid mechanics (p. 147). Singapore: Wiley.Fay, J. A. (1994). Introduction to fluid mechanics. MIT press.Elger, D. F., Roberson, J. A., Williams, B. C., & Crowe, C. T. (2016). Engineering fluid mechanics (Vol. 7). Hoboken (NJ): Wiley.Vennard, J. K. (2011). Elementary fluid mechanics. Read Books Ltd. (Fluids include liquids and gases.) Fluid mechanics can be divided into fluid statics, the study of fluids at rest, and fluid dynamics,Batchelor, C. K., & Batchelor, G. K. (2000). An introduction to fluid dynamics. Cambridge University Press. the study of fluids in motion. It is a branch of continuum mechanics, a subject which models matter without using the information that it is made out of atoms.Spencer, A. J. M. (2004). Continuum mechanics. Courier Corporation.Lai, W. M., Rubin, D. H., Krempl, E., & Rubin, D. (2009). Introduction to continuum mechanics. Butterworth-Heinemann.Gurtin, M. E. (1982). An introduction to continuum mechanics. Academic Press.Mase, G. T., Smelser, R. E., & Rossmann, J. S. (2020). Continuum mechanics for engineers. CRC Press.Liu, I. S. (2013). Continuum mechanics. Springer Science & Business Media. The study of fluid mechanics goes back at least to the days of ancient Greece, when Archimedes made a beginning on fluid statics. However, fluid mechanics, especially fluid dynamics, is an active field of research with many unsolved or partly solved problems. Fluid mechanics can be mathematically complex. Sometimes it can best be solved by numerical analysis, typically using computers. A modern discipline, called Computational Fluid Dynamics (CFD), is devoted to this approach to solving fluid mechanics problems.Anderson, J. D., & Wendt, J. (1995). Computational fluid dynamics (Vol. 206). New York: McGraw-Hill.Chung, T. J. (2010). Computational fluid dynamics. Cambridge University Press.Blazek, J. (2015). Computational fluid dynamics: principles and applications. Butterworth-Heinemann.Wesseling, P. (2009). Principles of computational fluid dynamics (Vol. 29). Springer Science & Business Media.Anderson, D., Tannehill, J. C., & Pletcher, R. H. (2016). Computational fluid mechanics and heat transfer. Taylor & Francis. == Relationship to continuum mechanics == Fluid mechanics is a subdiscipline of continuum mechanics, as illustrated in the following table. Continuum mechanics: the study of the physics of continuous materials. Solid mechanics:Dym, C. L., & Shames, I. H. (1973). Solid mechanics (p. 190). New York: McGraw-Hill.Fung, Y. C., Tong, P., & Chen, X. (2017). Classical and computational solid mechanics (Vol. 2). World Scientific Publishing Company. the study of the physics of continuous materials with a defined rest shape. Elasticity:Barber, J. R. (1992). Elasticity (pp. 121-163). Dordrecht: Kluwer Academic Publishers.Green, A. E., & Zerna, W. (1992). Theoretical elasticity. Courier Corporation.Sokolnikoff, I. S., & Specht, R. D. (1956). Mathematical theory of elasticity (Vol. 83). New York: McGraw-Hill.Marsden, J. E., & Hughes, T. J. (1994). Mathematical foundations of elasticity. Courier Corporation. which describes materials that return to their rest shape after an applied stress. Elasticity:Barber, J. R. (1992). Elasticity (pp. 121-163). Dordrecht: Kluwer Academic Publishers.Green, A. E., & Zerna, W. (1992). Theoretical elasticity. Courier Corporation.Sokolnikoff, I. S., & Specht, R. D. (1956). Mathematical theory of elasticity (Vol. 83). New York: McGraw- Hill.Marsden, J. E., & Hughes, T. J. (1994). Mathematical foundations of elasticity. Courier Corporation. which describes materials that return to their rest shape after an applied stress. Continuum mechanics: the study of the physics of continuous materials. Solid mechanics:Dym, C. L., & Shames, I. H. (1973). Solid mechanics (p. 190). New York: McGraw-Hill.Fung, Y. C., Tong, P., & Chen, X. (2017). Classical and computational solid mechanics (Vol. 2). World Scientific Publishing Company. the study of the physics of continuous materials with a defined rest shape. Plasticity:Lubliner, J. (2008). Plasticity theory. Courier Corporation.Chen, W. F., & Han, D. J. (2007). Plasticity for structural engineers. J. Ross Publishing. which describes materials that permanently deform after a large enough applied stress. Rheology:Tanner, R. I. (2000). Engineering rheology (Vol. 52). OUP Oxford.Barnes, H. A., Hutton, J. F., & Walters, K. (1989). An introduction to rheology (Vol. 3). Elsevier. the study of materials with both solid and fluid characteristics Continuum mechanics: the study of the physics of continuous materials. Fluid mechanics: the study of the physics of continuous materials which take the shape of their container. Non-Newtonian fluids Rheology:Tanner, R. I. (2000). Engineering rheology (Vol. 52). OUP Oxford.Barnes, H. A., Hutton, J. F., & Walters, K. (1989). An introduction to rheology (Vol. 3). Elsevier. the study of materials with both solid and fluid characteristics Continuum mechanics: the study of the physics of continuous materials. Fluid mechanics: the study of the physics of continuous materials which take the shape of their container. Newtonian fluids Newtonian fluids ==Related pages== * Applied mechanics *Hydraulics ==References== == Further reading == * White, Frank M. (2003). Fluid Mechanics. McGraw-Hill. * Cramer, Mark. \"The Gallery of Fluid Mechanics\" == Other websites == * CFDWiki—the Computational Fluid Dynamics reference wiki.",
 "title": "Fluid mechanics"
}