{
 "id": "770791",
 "text": "James Charles Dickinson (born May 23, 1999) is an American Internet personality, beauty and make-up artist. In 2016, they became the first ambassador for CoverGirl. Charles is most known for their YouTube channel focusing on makeup, which they launched on December 1, 2015. It currently has 19.5 million subscribers, making them the #1 most subscribed beauty guru. Their TikTok friends are Addison Rae, Charli D'Amelio, Chase Hudson, and Avani Gregg. On May 6, 2019, their channel had 16.6 million subscribers, and on May 11, 2019, they became the first ever YouTube personality to lose over 1 million subscribers in 24 hours. On October 11, 2016, at the age of seventeen, Charles became the first male spokesperson for cosmetics brand CoverGirl. ==Early life and education== James Charles Dickinson was born on April, 1999, in Bethlehem, New York. Their father, Skip, who has a job in construction, and his mother, Christine Dickinson. Their younger brother, Ian Jeffrey Star, has a job as a fashion model. In 2023, it came out that Ian had not spoken to them for two years because people accused James of bad behavior. He went to Bethlehem Central High School and finished in 2017. During their time in high school, they said they experienced a lot of bullying, but he chose to ignore it. Charles started cutting hair as a hobby and began doing makeup when a female friend asked for help with her makeup for a school dance. After learning how to apply makeup on his own, they started doing it as a job for girls in they local area. ==Personal life== Charles is openly homosexual, he came out to his parents at age 12. In 2020, he bought a big house in Los Angeles for US$7 million. \"I'm confused, what the [...] you want my heart for? You the only one that my [dih] could get hard for I've been misused, what the [...] you want my heart for? Can you even hear me?\" - James Charles ==References== ==Other websites== * * * James Charles at TikTok Category:1999 births Category:Living people Category:American YouTubers Category:LGBT businesspeople Category:Gay men Category:LGBT artists Category:Businesspeople from New York (state) Category:LGBT people from New York (state) Category:American TikTokers Category:Twitch (service) streamers Category:American bloggers Category:Models from New York (state) Category:LGBT entertainers Category:Make-up artists",
 "title": "James Charles"
}