{
 "id": "771328",
 "text": "Medicare is a national health insurance program in the United States. It began in 1965 under the Social Security Administration (SSA) by Lyndon B. Johnson and now administered by the Centers for Medicare and Medicaid Services (CMS). It gives health care insurance for Americans aged 65 and older, people with End-Stage Renal Disease and also for some younger people with disability. Medicare consists of three parts: Medicare Part A (Hospital Insurance): Covers inpatient hospital care, skilled nursing facility care, hospice, and some home health care. Medicare Part B (Medical Insurance): Covers doctor office visits and services, outpatient care, medical supplies, and preventative care and services. Medicare Part D (prescription drug coverage): Covers the cost of prescription drugs, flu shots, and vaccines. == Medicare Advantage == Medicare Advantage is part of the Medicare program offered to older people and disabled adults who qualify. Also referred to as Part C plans, Medicare Advantage (MA) plans are provided by private insurance companies instead of the federal government. They include the same Part A hospital and Part B medical coverage that Original Medicare provides but not hospice care. Most MA plans also include Part D prescription drug coverage. Anyone who joins an MA plan still has Medicare. The average monthly premium for a Medicare Advantage plan in 2021 is expected to drop 11% to about $21 from an average of $23.63 in 2020. Private companies receive a fixed amount each month for Medicare Advantage plan care. In turn, these companies can charge out-of-pocket costs to policyholders and are able to establish their own rules for service such as the need for referrals or provider networks for both non-urgent care and emergency services. Regional preferred provider organizations (PPOs) were established to provide rural beneficiaries greater access to Medicare Advantage plans and cover entire statewide or multi-state regions. Regional PPOs accounted for 5% of all Medicare Advantage enrollees in 2020. About 24 million people, or 36% of those receiving Medicare benefits, were enrolled in a Medicare Advantage plan in 2020. That number is expected to climb to more than 26 million in 2021. == Medicare for Alcoholism == Medicare Parts A and B include coverage for addiction treatment, including alcohol rehab. According to Medicare Interactive, a website that provides information on Medicare plans, Medicare Part A can help pay for hospitalization for substance abuse treatment, while Part B can help cover treatment for partial hospitalization or outpatient addiction treatment services. In addition, Medicare Part D provides coverage for medications used in treating alcohol addiction, such as naltrexone, as long as these drugs are considered medically necessary for the policyholder. ==Related pages== *Social Security *Medicaid ==References== Category:Federal government of the United States Category:Healthcare in the United States",
 "title": "Medicare (United States)"
}