{
 "id": "771393",
 "text": "The AS also referred to as \"Val\" is a special assault rifle designed (created) by the Soviets. It has a built-in suppresor. The development began in the first half of the late 1980s in the Central Research Institute of Precision Engineering, in the city of Klimovsk part of the Moscow region. The lead designer of the rifle is Pyotr Serdyukov. TsNIITochMash (Central Institute for Precision Machine Building) developed it in 1987. Since 1987, the Soviet Army and the KGB used it in their arsenal. Russian Spetsnaz special forces and some divisions of the Russian Army also use it. The AS is expensive and there are not many available. It is not used often according to many Russian Spetsnaz operators. It is used during special operations by either sabotage or reconnaissance units deployed behind enemy lines. The AS and VSS are very effective. Some Russian army and special forces units, and Moscow’s intelligence and security forces still use it. Forces used the rifles during the last years of the Soviet occupation of Afghanistan. They were also important in the Chechen wars and the conflict in Georgia. Most recently, Russia used the weapon during military operations in Crimea and Syria. == Design == The AS has an effective range of about 300 m. It uses heavy subsonic 9×39mm SP-6 (high-performance armor-piercing) ammunition (which weigh down the bullet). It also uses the SP-5 ball cartridge used by the VSS Vintorez suppressed sniper rifle. It can also use the same 10- or 20-round magazines of the VSS and the 30-round magazine of the SR-3M. Controls are similar to all AK-type rifles. It has a charging handle on the right side, a tangent rear sight, a magazine release button behind the magazine well, and a safety lever above the trigger guard. The fire selector is located within the trigger guard, behind the trigger. The rifle has two modes of fire: semi-automatic and fully automatic fire. It has a cyclic rate of fire of 900 rounds per minute (RPM). According to its users, the AS is reliable, accurate, and well liked. The rifle has an AK-type side mount for various optical sights. For example, it has the 4x PSO-1 scope and night sights such as the 1PN51 calibrated for use with the 9×39mm cartridge. The standard open sights are graduated up to 400 m in 25 m increments. The AS shares 70% of its components with its sister- gun, the VSS Vintorez. The differences are a skeletonized steel stock which folds to the left for storage and transportation (the gun can operate with stock folded, but it cannot have a scope while the stock is folded). The reliability of the rifle is said to be equivalent to the AKM. This includes functioning in difficult conditions such as dust, dirt, sand, rain, and at a temperature range from -50 °C to +50 °C. == References == Category:Assault rifles Category:Soviet Union",
 "title": "AS Val"
}