{
 "id": "771753",
 "text": "The Blank Slate: The Modern Denial of Human Nature is a popular 2002 book by the psychologist Steven Pinker. The author makes a case against tabula rasa (the idea that people are born with no mental content). The book was voted for the 2003 Aventis Prizes. It was a finalist for the Pulitzer Prize. == Summary == Pinker says that modern science has challenged three linked ideas that make up the main view of human nature in intelligent life: * the blank slate (the mind starts with no outside knowledge)—empiricism * the noble savage (people are born good and corrupted by society)—romanticism * the ghost in the machine (each of us has a soul that makes choices free from biology) Much of the book is looking at fears of the social and political consequences of his view of human nature: * \"the fear of inequality\" * \"the fear of imperfectibility\" * \"the fear of determinism (all events are determined beforehand)\" * \"the fear of nihilism (the belief that life is meaningless)\" Pinker says that the blank slate view of human nature would actually be more of a threat if it were true. He says that political equality does not require similarity, but policies that treat people as individuals with rights. Moral progress doesn't need the human mind to be naturally free of selfish actions, only morals to counteract them are needed. Responsibility doesn't need behavior to be uncaused, only that it answers to praise and blame. Grounding ideals in claims about a blank slate opens them to the possibility of being overturned by future discoveries. A blank slate is not in-sequence with opposition to many social evils since a blank slate could be conditioned to enjoy slavery. Evolutionary and genetic inequality statements do not have to support right-wing policies. If everyone is equal regarding abilities it can be argued that it is only necessary to give everyone equal opportunity. If some people have less ability, then redistribution policies should favor those with less ability. Economics is built upon an assumption of an actor, while evolutionary psychology suggests that people have many different goals and behaviors that do not fit the actor theory. \"A rising tide lifts all boats\" is often used as an argument that inequality need not be reduced as long as there is growth. Evolutionary psychology suggests that low status itself, apart from material considerations, is highly stressful towards the brain and may cause dangerous behaviors, which suggests that inequalities should be reduced. Evolutionary explanations may also help the left create policies with greater public support, suggesting that people's sense of fairness (caused by mechanisms such as reciprocal altruism) rather than greed is a primary cause of opposition to welfare. == Other websites == *Pinker's Website on The Blank Slate Category:2002 books Category:Psychology",
 "title": "The Blank Slate"
}