{
 "id": "771716",
 "text": "The Samsung Galaxy Note 20 and Galaxy Note 20 Ultra are a line of Android phablets designed, developed, produced and marketed by Samsung Electronics for its Samsung Galaxy Note series. It was announced on 5 August 2020 with the Samsung Galaxy Fold 2, Galaxy Watch 3, Galaxy Buds Live, and Samsung Galaxy Tab S7. This was during Samsung's Unpacked Event with shipment starting on 21 August 2020. It was the last model in the Galaxy Note series. Samsung started to make its Note series into its S series \"Ultra\" models, starting with the Galaxy S22 Ultra. Due to the COVID-19 pandemic, the release of the phablets was streamed online via Samsung's online platforms and channels. At the event, Samsung said that they would have support for 5G network and that their pens would have 4x better reaction speed than the other generations. The Note 20s does not feature a \"+\" model. == Specifications == === Hardware === The Note 20 series come with a 120 Hz refresh rate display that uses energy efficient technology called “LTPO”. Like the S20 Ultra, the Note 20 series might not have a curved display and will feature a totally flat display. A 6.42 inch display (2345×1084) is also rumored for the Note 20 whereas a 6.87 display (3096×1444) is rumored for the Note 20 Plus and Ultra with a 20:9 aspect ratio for all phones. The Note 20 series is rumored to be equipped with faster 45W charging capabilities and a higher-capacity non-user-replaceable batteries. Up to 128 GBs of storage is rumored for the Note 20 whereas 256/512GBs of storage is for the Note 20 Plus and Ultra. It is expected that a Snapdragon 865/Exynos 992 octa-core processor will power all three phablets and either 8GBs or 12GBs of RAM will hold memory for each. More progressive biometrics and faster RAM storage are also some rumored specifications for the phablets. All three phablets are rumored to come with 5G standard connectivity. Bluetooth certification listing might also be a first for the three phablets. === Cameras === The Note 20 series is rumored to become equipped with a more improved camera system than that of the Samsung Galaxy S20 Ultra . == Related pages == * Samsung Galaxy Note 10 * Samsung Galaxy S20 == References == == Other websites == * GALAXY FOLD 2, GALAXY NOTE 20 LAUNCH CONFIRMED 04-30-2020 Category:Mobile phones with multiple rear cameras Category:Mobile phones with 4K video recording Category:Mobile phones introduced in 2020 Category:Mobile phones with 8K video recording",
 "title": "Samsung Galaxy Note 20"
}