{
 "id": "771850",
 "text": "Burmese amber, or Burmite or Kachin amber, is amber from the Hukawng Valley in northern Myanmar. It is important for its fossils from the earliest part of the Upper Cretaceous, in the Cenomanian age, 99 million years ago. The amber has been commercially exploited since the first century AD. Research on the deposit may fund internal conflict in Myanmar. The amber has flora and fauna especially arthropods such as insects and arachnids. There are also also birds, lizards, snakes, frogs and fragments of dinosaur remains. The fossils arachnids in the amber include: *44 families of spiders. *20 families of mites. *5 families of Opiliones (mites, harvestmen, daddy longlegs) *12 families of pseudoscorpions *7 families of scorpions *5 families of ticks *1 genus of short-tailed whipscorpion (Schizomida) *1 genus of Palpigradi *1 genus of Amblypygi *1 genus of camel spider *2 genera of whip scprpions *3 genera of hooded tickspiders 15 families of myriapods are in the amber 8 families of Entognatha are known 29 orders of insects are known, including: *50+ families of Hymenoptera *47 families of flies (Diptera) *89 families of beetles (Coleoptera) *21 families of Neuroptera (such as lacewings, antlions, etc) *65 families of Hemiptera (true bugs) *20 families of Dictyoptera And 16 more smaller families. Other groups of invertebrates include: *Nematodes *Nematomorpha *Molluscs There are some vertebrates: *A well preserved theropod dinosaur tail, with preserved feathers. *Fossils of enantiornithine birds including juveniles and partial wings and preserved feet, including a diagnostic taxon, Elektorornis. *A complete skull of the bizarre avialan or lizard Oculudentavis is known. *Electrorana is a well preserved frog known from the amber. *Other notable specimens include an embryonic snake. *Several species of lizard were described from the deposit including a gecko with preserved toe pads (Cretaceogekko). *One of the specimens was initially described to be a chamelonid, actually turned out to be an albanerpetonid amphibian. == References == Category:Lagerstätten Category:Myanmar Category:Cretaceous",
 "title": "Burmese amber"
}