{
 "id": "772082",
 "text": "Vanessa Guillen was an American soldier. On April 22, 2020, she went missing from an army base called Fort Hood, which is in the state of Texas. She was later found dead not far from Fort Hood. Her family believes that her disappearance is a result of crime because of previous instances where she said that she was being sexually harassed. They also believe that the US Army is not doing a good job in solving her case. On July 3, 2020, the main suspect in the case, another soldier named Aaron David Robinson, killed himself. Another suspect, Cecily Anne Aguilar, is in jail as of July 6, 2020. == Background == * Vanessa Guillen was born and raised in Houston. She was Mexican-American. She joined the US Army in 2018. Vanessa told her mother that she did not feel safe at Fort Hood. She said that a sergeant was making her feel uncomfortable and unsafe. According to her, some of the things that soldier did were stalking her and watching her take a shower. Her mother promised to tell on the soldier who was making her feel unsafe, but Vanessa wanted to protect her from being hurt. She said she would solve the problem by herself. * Aaron David Robinson was another soldier at Fort Hood. Guillen said she would report Robinson for adultery, which is a crime in the army. * Cecily Anne Aguilar was Robinson's girlfriend. Fort Hood has a big problem with soldiers disappearing. Also, there is a big problem with sexual harassment in the armed forces of the United States. == Timeline == === April === * April 22: Vanessa Guillen goes missing. She was last seen in a parking lot in Fort Hood. She was reported as present that day. Guillen is killed with a hammer. The suspects, according to law enforcement, cut up and buried Guillen near the Leon River 30 miles (48 km) from Fort Hood. * April 23: The Criminal Investigations Command (CID) of the US Army was notified that then PFC Guillén was reported missing. * April 24: CID issues a missing soldier letter for Guillen Fort Hood Military Police issue a Be on the Lookout (BOLO) advisory to surrounding law enforcement agencies. Military personnel along with civilian and military police began a search. * April 26: Aguilar and Robinson are believed to return according to cellphone data. They continue with the process of breaking down Guillen's body. * April 28: CID interviews SPC Robinson for the first time. * April 30: United States Secretary of the Army, Ryan D. McCarthy, makes the following statement in a press briefing: > Good afternoon, everyone. I'd like to start out this morning by talking > about a missing soldier, Private First Class Vanessa Guillen, in hopes of > increasing the public's awareness and assistance in finding her. Private > First Class Guillen went missing on 22 April from Ford Hood, Texas. In > concert with local law enforcement efforts, the Army will continue > aggressively searching for her. Our hearts go out to her family, and we will > not stop looking for her until we find her. === May === * May 18: Two witnesses are interviewed. They said they saw SPC Robinson struggling with a \"tough box\" outside of the armory * May 19: Robinson consents to a UFED extraction on his cell phone. This process involves going through the phone's memory in order to look for clues. === June === * June 19: Aguilar is interviewed for the first time * June 21: Cell phone data from Robinson and Aguilar leads law enforcement officials to a site near the Leon River. Law enforcement officials fail to find a body * June 30: At about 1pm, contractors working on a fence near the Leon River discover human body parts and tell law enforcement. CID and partner agencies discover human body parts. At about 8:30PM, Aguilar was interviewed again and told law enforcement officials that SPC Robinson told her about killing a female soldiers on Fort Hood. Aguilar makes a controlled call to Robinson. Robinson reported says \"baby they found pieces\" and texts Aguilar multiple news articles about the event. Robinson escapes confinement and kills himself when approached by police. === July === * July 2: FBI formally submits a criminal complaint for Aguilar. Fort Hood and CID discuss Guillen investigation. * July 5: Remains are confirmed to be Vanessa Guillen. == Investigation == Vanessa's family is not happy with the investigation. They say that the US Army has not been investigating Vanessa's disappearance seriously. Natalie Khawam, who is the lawyer representing the Guillen family, criticized the Army for not doing more to ensure Vanessa's safety. == Reactions == Many Americans are sad and angry because of Vanessa's disappearance. They are also concerned about the amount of sexual harassment occurring in army ranks. Many past soldiers have used the hashtag #IAmVanessaGuillen to tell their stories about being harassed and assaulted. There have been many protests demanding that Vanessa be found and brought back to her family. In addition, many celebrities and politicians are talking about Vanessa's case and how to reduce sexual harassment in the armed forces. The League of United Latin American Citizens (LULAC), which represents the interests of Hispanic Americans, told Latina women to not join the US military so that they can avoid the same fate as Vanessa Guillen. They said that the military does not do a good job of protecting women, especially women of color. == References == Category:2020 murders in the United States Category:April 2020 events Category:2020 in Texas Category:Violence against women Category:Deaths by person in the United States",
 "title": "Murder of Vanessa Guillen"
}