{
 "id": "772276",
 "text": "Nikolai Girshevich Kapustin (Russian: Никола́й Ги́ршевич Капу́стин; November 22, 1937 - July 2, 2020) was a Ukrainian composer and pianist. He was born in Horlivka, Ukrainian SSR. His works are 20 piano sonatas, six piano concerti, other instrumental concert, sets of piano variations, and concert studies. Kapustin died on July 2, 2020 in Moscow at the age of 82. ==Life== At the age of seven, he learned piano with Professor Avreliana Hryhorovycha Rubbakha (1895—1975), a student of Felix Blumenfeld, who also taught Symona Barera and Volodymyra Horovytsya. Rubbakha was the first serious teacher for Kapustin, and together they worked hard for 11 years. While he was learning, Kapustin fully went through the path of becoming a pianist of the classical type, playing works by Bach, Clementi, Scarletti, Liszt, Beethoven, and passing various scales, arpeggios, etc. on technical tests. When he was 18 years old he went into the Moscow Conservatory on piano in the class of Holʹdenveyzera Oleksandra Borysovycha. Kapustin remembered that the relationship with such a famous person affected him and his development as a pianist. Borysovycha was 82 years old at the time, and he could not to provide adequate technical teaching to his student. During the work, the teacher remembered the past a lot, sharing interesting facts and his thoughts on composers. Borysovycha was touched at how full of motion the music of Mykoly Hirshovycha was, what he could do with the piano, deeply respected and loved his student. For some time, Kapustin dreamed of becoming a super good pianist and performing classic pieces, but not on big stages, but in a more cozy place or recording in studios. But at about the age of 20, the pianist started to like in jazz. In 1957, the Orchestra of the Central House of Artists and Kapustin played at the VI International Festival of Youth and Students, which was in Moscow. At that time, the festival had 34,000 people in it who stood for 131 countries. The festival was the biggest ever. And it was here, on the world stage, that Kapustin had his work played for the first time, the Concertino for piano and orchestra (which he wrote in the same year). It was then that the composer found his style in the natural mix of classical structure mixed with jazz improvisations (making up things you play), harmonies, rhythms, chords, etc. Not only did he learn at the big school, Kapustin played with a small jazz band in high types of restaurants for people who were not Ukrainians. One of these light concerts was recorded and later on the radio \"Voice of America\" began to play it again. In 1961 Kapustin left the Moscow Conservatory. Between the years 1961–1972, he worked together with Oleha Lundstrema's orchestra. During his work with the orchestra, it turned out that Kapustin was very good pianist who practiced a lot and a very great composer, writing a number of new works. In 1972–1977, he was pianist of the Blue Screen Orchestra. He also played in the State Symphony Orchestra of Cinematography of Ukraine. The end of the 70's was Kapustin's change from playing to writing different types and lots of music. He wrote many works of many different forms for orchestra and piano alone. His works were published with the help of Stivena Osborna and Mykola Petrov. Kapustin's piano pieces were added in the set of works and recorded by Mark-Andre Amlen, Mykola Petrov and others. And so was why Kapustin's music all around the world. The composer himself has again and again recorded very good playing his own works. On December 11, 2007, a concert for the composer's work was held in Moscow. Kapustin was there. March 8, 2009 in the Chamber Hall of the Moscow Conservatory was a concert of his works, which he also went to, who answered many questions from fans of his work. ==References== ==Other websites== * Nikolai Kapustin, Internet edition compiled by Onno van Rijen (archived) * Official Home of Nikolai Kapustin: nikolai-kapustin.info. * MusT, publishers of Nikolai Kapustin's music * Nikolai Kapustin's orchestral works from 60's and 70's, compiled by Anton Kapustin Category:1937 births Category:2020 deaths Category:Russian composers Category:Russian pianists",
 "title": "Nikolai Kapustin"
}