{
 "id": "772264",
 "text": "James Paul Freund (September 16, 1946 – August 9, 1976) and Pamela Mae Buckley (December 16, 1951 – August 9, 1976), formerly called the Sumter County Does and Jock Doe and Jane Doe were two people who died by homicide - a man and a woman. They were killed on a small dirt road in a rural part of Sumter County, South Carolina on August 9, 1976. They were named as Pamela Buckley and James Freund on January 21, 2021, at a press conference. They were both shot three times in the same way. Twice in the chest, and once in the back. They were shot with a .357 caliber revolver. The male victim, James, was aged 29. It was guessed he was between 18 and 30 before his name was known. One dentist said he thought he could have been older than 27. His skin was an olive white colour and he had brown eyes and brown hair down to his shoulders. He was over tall and weighed around . He had a lot of work done to his teeth that was probably done outside the United States. He also had many scars on his back and shoulders, meaning he might have played contact sport. He was wearing faded Levi jeans and a red T-shirt. The shirt had the words \"Coors — America's Light Beer\" on the front and \"Camel Challenger GT Sebring '75\" on the back. It also had a Snoopy design. The shirt came from the Sebring Races being held at the time in Sebring, Florida, meaning he may have been there. He was wearing no underwear and had a pack of matches in his pocket from a \"Grant's Truck Stop\". This truck stop is thought to be in the Midwestern United States. He also had a ring on with the letters \"JPF\" written on the inside. This could refer to his initials James Paul Freund. The female victim, Pamela Buckley, was thought to be younger than the male one, aged between 18 and 25 years old before her name was known. It was later found out that Buckley was 24 years old. She had reddish-brown hair down to her shoulders and blue or gray eyes. She had two moles on the left of her face. She had no scars and had never been pregnant. She also had not shaved her legs. She was wearing a white muslin blouse over a pink halter top. She also wore blue denim cut-off shorts. She had purple and pink Stride-Rite brand wedge-heeled sandals. Like the male victim, she was wearing no underwear. Pictures, drawings and photographs of the pair were spread all around the U.S.. DNA testing found that they were not related to each other in 2007. in 2014, Police paused the investigation until it was known who the pair were. They were buried in graves marked \"Male Unknown\" and \"Female Unknown\" at the Bethel United Methodist Church Cemetery in Oswego, South Carolina on August 14, 1977. This was around a year after they had died. ==References== Category:Unsolved murders in the United States Category:Murder in the 1970s Category:1976 deaths Category:1950s births Category:1940s births Category:20th century in South Carolina",
 "title": "Murder of Pamela Buckley and James Freund"
}