{
 "id": "772707",
 "text": "Ceylon Petroleum Corporation (CEYPETCO) is the national oil and gas company of Sri Lanka. It was set up as a state enterprise by Act. No. 28 of 1961 in parliament and further amendments carried out subsequently. It is Sri Lanka largest petroleum suppler and largest company. == History == ===1960s=== * 1962 The Corporation commenced business in competition with other Oil Companies who operating in the country at that time. * 1964 The Ceylon Petroleum Corporation took over the entire business of import, sale and distribution of petroleum products with the country. The Kolonnawa Oil Installation, regional bulk depots and retail outlets with operated under three different oil companies prior to nationalisation was subject to several transformations and improvements of their facilities to perform its operations as one entity. Since then, new bulk depots/ retail outlets were constructed and storage capacity of Kolonnawa Installation & regional depots were increased. A Fire & Safety Division was set up with the introduction of a new fire hydrant systems and the internal road network was improved to facilitate operational and maintenance activities. The gantry filling facility was improved to suit replenishment of large capacity bowers introduced in mid 90's. * 1968 To ensure regular supplies and conserve foreign exchange, the Corporation build a 38,000 BPD Refinery at a cost Rs. 175 million. * 1969 The refinery commenced production. The refining capacity was subsequently increased to 50,000 BPD by increasing the crude distiller capacity in 1979. Another important project that was completed in same year was the installation of Lubrication Oil Blending Plant at the Kolonnawa Installation. The Corporation entered in to the Agrochemical business in competition with the private sector, with a view to market agrochemical at competitive prices. ===1970s=== * 1971 The Bunkering operation at the Ports and Aviation Re- fuelling activities were integrated in to the Corporation by further amendments to the CPC Act. * 1978 The Corporation build a factory to manufacture Nylon 6 yarn to textile, tires & finishing industries at a cost of Rs. 603 million. ===Since 1980s=== * 1987 In order to reduce freight on crude oil and to meet the development plan of the Colombo port, a Single Point Buoy Mooring (SPBM) facility was installed 9.2 km off shore Colombo port. The project was commissioned in 1987 together with an intermediate crude oil storage tank farm at Orugodawtte at a total cost of Rs. 1.764 billion. * 1992 The Corporation took further steps to modernise the Refinery and increase its efficiency by the revamping the crude distiller unit in 1992 at a cost of Rs. 250 million. == References == == Other websites == * Category:1960s establishments in Ceylon Category:1962 establishments in Asia Category:Companies of Sri Lanka Category:Petrol companies",
 "title": "Ceylon Petroleum Corporation"
}