{
 "id": "77283",
 "text": "The Lion King is an musical coming of age drama animated movie made by Disney in 1994. It was the most successful animated movie of the 1990s. The movie is about a young lion prince who learns about his role as king and in the circle of life. It is dedicated to Frank Wells. Wells was the president of The Walt Disney Company. He died in a helicopter accident shortly before the movie was released into theaters. The movie was the first full-length Disney movie with no human characters since Bambi. Most of the voice acting was done by well- known actors. This includes Matthew Broderick, Nathan Lane, James Earl Jones, Jeremy Irons, Whoopi Goldberg, Cheech Marin, Rowan Atkinson, Jonathan Taylor Thomas and Frank Welker. The Lion King is a musical. The music for the songs was written by Elton John. The lyrics were written by Tim Rice. Computer animation was used a lot to make the movie. The people who wrote The Lion King got a lot of ideas from Hamlet. ==Plot== In the Pride Lands of Tanzania, a pride of lions rule over a large swath of African savanna which they oversee as their \"kingdom\" with Mufasa (James Earl Jones), a wise and benevolent lion, watching over it and the other animals as \"king\" alongside with Sarabi (Madge Sinclair), his mate and the leader of the lioness hunting party who serves as the queen of the Pride Lands. As the sun rises over the Pride Lands, a large crowd of animals gather at the foot of Pride Rock to commemorate the birth of Simba, Mufasa and Sarabi's newborn cub (whose name is Swahili for \"lion\"). Rafiki (Robert Guillaume), an wise and old mandrill with an unnaturally long tail like a baboon who lives in a baobab tree and serves as the kingdom's shaman and advisor by presenting the newborn lion cubs of the king and queen to the onlooking animals and performing his shamanistic services for the lions, travels to Pride Rock to perform Simba's presentation ceremony with an anointment and introduces him to the crowd by standing towards the edge and raising the cub high above their heads while Mufasa and Sarabi observe from behind them and the celebrating animals rejoice (\"Circle of Life\"). Scar (voiced by Jeremy Irons and singing voiced by Jim Cummings), Mufasa's scheming younger brother and rival, covets the throne that he was originally first-in- line to take until he was suddenly replaced by the new prince whom he is jealous of as it means that he's no longer first-in-line because Simba will be destined to inherit the throne and become the next king instead of him when Mufasa dies. Mufasa shows Simba (voiced by Jonathan Taylor Thomas and singing voiced by Evan Saucedo and Jason Weaver) the Prides Lands and forbids him from exploring beyond its borders. He explains to Simba about the responsibilities of kingship for protecting and maintaining the delicate balance of the ecosystem while mediating problems between its creatures and the \"circle of life\" which connects all living creatures and things, teaching him what a king is supposed to be and advising him to prepare for the day when he'll succeed him (\"The Morning Report\"). Scar plots to eliminate Simba and take the throne for himself in order to improve his own chances of becoming king. He manipulates Simba into exploring an elephant graveyard beyond the Pride Lands by claiming that only brave lions go there. Simba and his best friend Nala find the Elephant Graveyard. They are chased by the three hyenas (their names are Shenzi, Banzai and Ed). Mufasa saves Simba and Nala and takes them both home. Mufasa talks to Simba alone. He explains to Simba that being brave is not about looking for danger. Scar is angry with the hyenas because they did not kill Simba. It is shown that the hyenas are working for Scar. They plan to kill Simba and Mufasa so that Scar can become king and the hyenas can help him rule over the animals. The next day, Scar takes Simba into a gorge. Scar has actually planned a wildebeest stampede. Simba is trapped in the gorge as the wildebeest run towards him. Scar tells Mufasa that Simba is in trouble. Mufasa rescues Simba but is left hanging on a cliff. Scar then throws Mufasa into the stampede and Mufasa dies. Scar blames Simba for the death of Mufasa and Simba runs away. Scar becomes king and tells everyone that Simba and Mufasa are dead. Simba runs to a desert and collapses. He is rescued by Timon the meerkat and Pumbaa the warthog. Timon and Pumbaa live in the jungle. Timon and Pumbaa look after Simba until Simba is an adult lion. One day a female lion comes to the jungle and tries to kill and eat Pumbaa. Simba fights the lioness. Simba finds out that the other lion is his friend Nala. They are very happy to see each other and they fall in love. Nala wants Simba to go home and fight Scar because Scar is a bad king. Simba does not want go home because he thinks that he killed Mufasa. Rafiki comes to the jungle and takes Simba to a field. In the sky above the field, Mufasa's ghost appears and tells Simba that he must go home because Simba is the true king. After this Simba goes home. Nala, Timon and Pumbaa follow him. When they get there, they see that the land is dry and the animals have gone because the hyenas have destroyed the food chain (Scar let them). Nala gathers all of the lions and they fight Scar's hyenas. Simba attacks Scar. Scar does not want to die and so he lies to Simba that the hyenas are to blame for everything. This angers the hyenas and they attack and eat Scar alive. Rain starts to pour and the circle of life is restored. == Adaptations == The movie was also made into an award-winning stage musical. The stage show first opened on November 13, 1997 in New York City. It has been a big success. A version opened later in London, England. It is one of the United Kingdom's biggest and most popular shows. Many other shows of The Lion King have been shown across the world. This movie has a sequel called The Lion King II: Simba's Pride. In 2019, a computer animated remake was released. == Characters == * Simba - Mufasa's son, Scar's nephew, Nala's eventual husband and the future king. * Nala - Simba's eventual wife and the future queen. * Timon and Pumbaa - A meerkat and warthog duo who adopt Simba as a cub. * Mufasa - The king of the Pride Lands, Simba's father and Scar's older brother. * Scar - Simba's archenemy and uncle and Mufasa's younger brother and rival. * Shenzi, Banzai and Ed - Three hyenas who are Scar's henchmen. * Rafiki - A mandrill shaman. * Zazu - A hornbill who serves as an majordomo to Mufasa and later Simba. * Sarabi - Simba's mother, Mufasa's wife, Scar's sister-in-law and Nala's mother-in-law * Sarafina - Simba's mother-in-law and the sister-in- law of Mufasa, Sarabi and Scar == Voices == * Matthew Broderick as Simba, son of Mufasa and Sarabi, who grows up to become King of the Pride Lands. Rock singer Joseph Williams voiced adult Simba's singing voice. ** Jonathan Taylor Thomas voiced young Simba, while Jason Weaver voiced the cub's singing voice and Evan Saucedo voiced the cub's singing voice in \"The Morning Report\", a newly animated song sequence added to the 2003 DVD Special Edition of The Lion King. * Jeremy Irons as Scar, Mufasa's younger brother who seizes the throne. Jim Cummings partly voiced Scar's singing voice for the song \"Be Prepared.\" * James Earl Jones as Mufasa, Simba's father and the King of the Pride Lands. * Moira Kelly as Nala, Simba's best friend who later becomes his mate and Queen of the Pride Lands. Sally Dworsky voiced adult Nala's singing voice. ** Niketa Calame provided the voice of young Nala while Laura Williams voiced her singing voice. * Nathan Lane as Timon, an insouciant, fast-talking, wisecracking and self-absorbed yet loyal and trustworthy bipedal meerkat who becomes one of Simba's best friends. * Ernie Sabella as Pumbaa, an kindhearted and courageous yet occasionally childlike naïve warthog and Timon's best friend who suffers from uncontrollable flatulence and also becomes one of Simba's best friends. * Robert Guillaume as Rafiki, an wise and old mandrill who serves as the Pride Lands' shaman by presenting the newborn cubs of the king and queen to the animals. * Rowan Atkinson as Zazu, a hornbill who serves as the king's majordomo. Jeff Bennett voiced Zazu's singing voice in \"The Morning Report\", a newly animated song sequence added to the 2003 DVD Special Edition of The Lion King. * Madge Sinclair as Sarabi, Mufasa's mate, Simba's mother and the leader of the lioness hunting party who serves as the Queen of the Pride Lands. * Whoopi Goldberg as Shenzi, the sassy and short-tempered female leader of the three leaders of a clan of spotted hyenas who align with Scar as his allies and serve as his minions who participate in his plot. * Cheech Marin as Banzai, an aggressive and hot-headed hyena who is prone to complaining and acting on impulse. * Jim Cummings as Ed, a dimwitted hyena who doesn't talk, but only communicates through laughter. * Zoe Leader as Sarafina, Nala's mother who is briefly shown talking to Sarabi, Simba's mother. == International Versions == === Danish Dubbing år: 1994 === * Simba (Barn) – Andreas Hviid * Simba (Voksne) – Peter Jorde * Nala (Barn) – Amalie Ihle Alstrup * Nala (Voksne) – Pernille Højgaard * Mufasa – Aage Haugland * Sarabi – Kirsten Olesen * Scar – Stig Hoffmeyer * Rafiki – Peter Belli * Zazu – Peter Zhelder * Timon – Henrik Koefoed * Pumba – Lars Thiesgaard * Shenzi – Lone Kellermann * Banzai – Donald Andersen * Ed/Ib – ? * Sarafina – Ann Hjort * Muldvarp – Kjeld Nørgaard === Choirs === * Nicoline Møller * Lise Nees * Trine Dansgaard * Pia Scharling * Johnny Jørgensen * Brian Grønbæk Jensen * Søren Launbjerg == Box office performance == When the movie was released, it was the most successful movie worldwide. It was behind Forrest Gump as most successful in the United States that year. The movie was the most successful animated feature movie of all time until Finding Nemo. , the movie has earned with over 1 billion dollars worldwide. After inflation, it’s the third most successful animated movie that anyone has made yet. Source Gross (USD) % Total All Time Rank Domestic $328,541,776 ($312,855,561 initially) 41.9% 16 Foreign $455,300,000 58.1% N/A Worldwide $783,841,776 100.0% 19 Domestic Opening Weekend $40,888,194 13.1% 99 Domestic Adjusted (2007) $508,185,200 N/A 24 == Awards and nominations == The Lion King received many award nominations. These include the Academy Award for Best Original Score (by Hans Zimmer) and the Golden Globe award for Best Motion Picture – Musical or Comedy. It won both. The song \"Can You Feel the Love Tonight\" by Elton John and Tim Rice won the Academy Award for Best Original Song, the Golden Globe for Best Original Song, the BMI Film Music Award, and the Grammy Award for Best Vocal Performance Male. Other awards include: * Academy Awards ** Best Original Score (Won) ** Best Original Song for \"Can You Feel the Love Tonight\" (Won) ** Best Original Song for \"Circle of Life\" (Nominated) ** Best Original Song for \"Hakuna Matata\" (Nominated) * Golden Globe Awards ** Best Motion Picture - Musical or Comedy (Won) ** Best Original Score (Won) ** Best Original Song for \"Can You Feel the Love Tonight\" (Won) ** Best Original Song for \"Circle of Life\" (Nominated) * Annie Awards ** Best Animated Feature (Won) ** Best Achievement for Voice Acting to Jeremy Irons for voicing Scar (Won) ** Best Individual Achievement for Story Contribution in the Field of Animation (Won) ** Best Individual Achievement for Artistic Excellence in the Field of Animation (Nominated, lost to The Nightmare Before Christmas.) * Saturn Awards ** Best Fantasy Film (Nominated, lost to Forrest Gump.) ** Best Performance by a Younger Actor to Jonathan Taylor Thomas for voicing young Simba (Nominated, lost to Kirsten Dunst for Interview with the Vampire: The Vampire Chronicles.) ** Best DVD Classic Film Release in 2004 (Nominated, lost to The Adventures of Robin Hood.) * British Academy Film Awards ** Award for Best Sound (Nominated, lost to Speed.) ** Anthony Asquith Award for Film Music (Nominated, lost to Backbeat.) * BMI Film & TV Awards ** BMI Film Music Award for \"Can You Feel the Love Tonight\" (Won) ** Most Performed Song from a Film \"Can You Feel the Love Tonight\" (Won) * Grammy Award ** Best Vocal Performance Male to Elton John for \"Can You Feel the Love Tonight\" (Won) ** Song of the Year for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia.) ** Best Song Written for a Motion Picture, Television or Other Visual Media for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia.) ** Best Song Written for a Motion Picture, Television or Other Visual Media for \"Circle of Life\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia.) ** Best Instrumental Composition Written for a Motion Picture or for Television (Nominated, lost to Schindler's List.) * MTV Movie Awards ** Best Villain for Jeremy Irons (Nominated, lost to Dennis Hopper for Speed.) ** Best Song From A Movie for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Big Empty\" from The Crow.) * Kids' Choice Awards ** Favorite Movie (Won) == Sequels and spin-offs == The Lion King was so successful that Disney created a sequel called The Lion King II: Simba's Pride and a television series called The Lion King's Timon and Pumbaa. A spinoff and parallel film, The Lion King 1½, was released on February 10, 2004. A preschool series called The Lion Guard was released on Disney Junior. A live action of the film was released on 19 July 2019. == Re- releases == The Lion King was re-released in IMAX in 2003, 3D in 2011, for Disney's 100th anniversary in 2023 and for the movie's 30th anniversary in 2024. == Controversies == === \"SEX\" === In one scene of the movie, it looks as if animators had accidentally written the word \"sex\" into some of the frames of animation, but that was a word that was vulgar and indicates sexual promiscuity. However, they wanted to show the letters \"SFX\" (meaning \"special effects\"). Because of that, in The Lion King DVD the word has been taken out. Now, the word now reads correctly as \"SFX\". === Kimba the White Lion === Kimba the White Lion is an animated television program from the 1960s. It was made in Japan by Osamu Tezuka. Some characters and parts of the story in The Lion King are similar to Kimba the White Lion but Disney has said that it was not done on purpose. === \"The Lion Sleeps Tonight\" === In one scene with Timon and Pumbaa, they both sing \"The Lion Sleeps Tonight\". This has caused problems between Disney and the family of South African Solomon Linda, who composed the song (originally titled \"Mbube\") in 1939. In July 2004, the family went to court, seeking $1.6 million in royalties from Disney. In February 2006, Linda's family reached a legal settlement with Abilene Music, who held the worldwide rights and had let Disney us the song. === Hidden racism === Upon its release, some critics complained that the hyenas in the movie were negative (bad) racial stereotypes of African-American people and Hispanic people. === Hamas' propaganda === In August 2007, the Hamas terrorist group made an animated propaganda movie that made fun of the style of The Lion King. The programme was shown on their television station, Al-Aqsa TV. Hamas was shown as a lion that chased and killed rats that looked like members of the secular Fatah group in Gaza. The programme was shown for a short time but was taken off the air for changes. == Songs == * \"Circle of Life\" * \"The Morning Report\" * \"I Just Can't Wait to Be King\" * \"Be Prepared\" * \"Hakuna Matata\" * \"Can You Feel the Love Tonight?\" * \"The Bait Song\" (Timon & Pumbaa's Hula) == Notes == == References == == Other websites == * * (Dead link) * Official Disney page Category:1994 animated movies Category:American epic movies Category:American family movies Category:1990s American musical movies Category:1990s English-language movies Category:Golden Globe Award winning movies Category:Movies about pigs Category:Movies about lions Category:Movies about coups d'état Category:Movies about dictators Category:Movies about father–son relationships Category:Movies based on plays by William Shakespeare Category:Movies composed by Hans Zimmer Category:Movies directed by Rob Minkoff Category:Movies set in Africa Category:Movies that won the Best Original Song Academy Award Category:Movies about royalty Category:The Lion King Category:3D re-releases Category:United States National Film Registry movies Category:1990s family movies Category:1990s epic movies",
 "title": "The Lion King"
}