{
 "id": "772955",
 "text": "Timothy J. Keller (September 23, 1950 – May 19, 2023) was an American pastor, theologian, and Christian apologist. He was the Chairman and co-Founder of Redeemer City to City. He was also the founding pastor of Redeemer Presbyterian Church in New York City. He was the author of The New York Times bestselling books The Prodigal God: Recovering the Heart of the Christian Faith (2008), Prayer: Experiencing Awe and Intimacy with God (2014), and The Reason for God: Belief in an Age of Skepticism (2008).Discussed by Keller at: • Tim Keller: \"The Reason for God\" | Talks at Google, including Q&A; afterwards. Uploaded on Mar 18, 2008. • Anthony Sacramone (2008). \"An Interview with Timothy Keller,\" First Things, Feb. 25. Uploaded on July 11, 2017. The prequel for the latter is Making Sense of GOD: An Invitation to the Skeptical (2016).Keller, Timothy (2016). Making Sense of GOD: An Invitation to the Skeptical, Contents, including \"Preface: The Faith of the Secular,\" ch. 1, \"Isn’t Religion Going Away?\", and \"Epilogue: Only in God.\" ebk. . • McCormick, David. (2016). Description, Publishers Weekly, Sept. • JW [Wetherbee, James] (2016). \"Keller, Timothy. Making Sense of God: An Invitation to the Skeptical\" (reviews), Library Journal, October 1. • Keller, Timothy (2016). \"Tim Keller: Making Sense of God: An Invitation to the Skeptical\" (followed by Q&A;), Talks at Google, Oct. 19. • Reynolds, Matt (2016). \"Christianity Today's 2017 Book Awards\" (with comments on the book by Gregory Koukl), Christianity Today. December 14. • Smethurst, Matt (2016). \"Why Tim Keller Wrote a Prequel to 'The Reason for God'\" (with a comment by Keller at the end), The Gospel Coalition, September 20. • Smethurst, Matt (2016). \"20 Quotes from Tim Keller’s New Prequel to 'The Reason for God',\" The Gospel Coalition, September 19. • Spencer, Andrew (2016). \"Making Sense of God: A Review,\" Ethics and Culture blog, Oct. 4. • Larkin, Andrew. \"Making Sense of God: A Review,\" bethinking.org, UCCF:The Christian Unions (2016). • Spencer, Andrew J. (2016) \"Making Sense of God: A Review,\" Ethics and Culture blog, Oct. • Larkin, Andrew (2016). \"Making Sense of God: A Review,\" bethinking.org, UCCF:The Christian Unions. • Showalter, Brandon (2016). \"Tim Keller Makes Sense of God for Skeptics, Argues Secularism Is Declining\" (interview), The Christian Post (Sept. 20. Retrieved 2-16-2017. • Hewitt, Hugh (2017). \"Pastor Tim Keller and Making Sense of God, The Hugh Hewitt Show. September 20. Retrieved 2-16-2017. • Anderson, Matthew Lee (2016). Mere Fidelity: with Tim Keller, on ‘Making Sense of God’ podcast interview of Timothy Keller, December 13. Retrieved 2016-12-19. • Knopp, Richard A. (2017). \"Helping the Skeptical See God,\" Christian Standard, February 16. • West, Steve (2017). \"Making Sense of GOD: An Invitation to the Skeptical, by Timothy Keller\" (summary), Books at a Glance, February 16. Viking ebk. Keller married Kathy Kristy in 1975; they had three children. Keller suffered from thyroid cancer in 2002. In June 2020, Keller revealed that he had been diagnosed with pancreatic cancer. On May 18, 2023, Keller's son Michael announced that Keller would receive hospice care at home after a hospitalization. He died the following day in New York City, at the age of 72. ==References== Category:1950 births Category:2023 deaths Category:Deaths from pancreatic cancer Category:American theologians Category:American Christians Category:Writers from Pennsylvania Category:Writers from New York City Category:People from Allentown, Pennsylvania",
 "title": "Timothy J. Keller"
}