{
 "id": "773017",
 "text": "Sean Patrick Duffy (born October 3, 1971) is an American politician, prosecutor, former sports commentator, and personality. Duffy has been the 20th United States Secretary of Transportation since 2025. He was the U.S. Representative for . He is a member of the Republican Party. Duffy was a cast member on The Real World: Boston, 1998's Road Rules: All Stars, and 2002's Real World/Road Rules Challenge: Battle of the Seasons, before going on to serve as district attorney of Ashland County, Wisconsin. He was a CNN and Fox News political commentator. Duffy resigned from Congress on September 23, 2019. In November 2024, President-elect Donald Trump named Duffy as his nominee for secretary of transportation in his second presidency. ==Early life== Duffy was born on October 3, 1971, in Hayward, Wisconsin.\"Rep. Sean Patrick Duffy\". LegiStorm. Retrieved March 6, 2014.\"Wisconsin: Sean Patrick Duffy\" . The Washington Times. Retrieved March 5, 2014.\"Sean Duffy's Biography\" . Project Vote Smart. Retrieved November 3, 2010. He studied at St. Mary's University and at William Mitchell College of Law. Duffy, a Republican, was made Ashland County District Attorney in 2002. He was reelected in 2002, 2004,\"Wisconsin State Elections Board Results of Fall General Election – 11/02/2004\" , December 1, 2004. Retrieved January 2, 2011. 2006\"Wisconsin State Elections Board Results of Fall General Election – 11/07/2006\" , December 5, 2006. Retrieved January 2, 2011. and 2008. ==Television career== In 1997, Duffy appeared on The Real World: Boston, the sixth season of the MTV reality television show, and on Road Rules: All Stars in 1998, where he met his future wife Rachel Campos. Duffy later appeared on Real World/Road Rules Challenge: Battle of the Seasons, which aired in 2002.\"The Real World Awards Bash (Extended Version)\". MTV. Retrieved April 5, 2011. Duffy was also a ESPN commentator. In December 2022 Duffy and Dagen McDowell were named co-hosts of The Bottom Line, a show on Fox Business. ==U.S. House of Representatives== In July 2009, Duffy announced his campaign for Congress in Wisconsin's seventh congressional district. In June 2010, Duffy announced his resignation as Ashland County District Attorney. He won the race on November 2, 2010.\"Wisconsin's Duffy says he's ready to get to work\" . Chicago Tribune/Associated Press. November 3, 2010. He was re-elected from 2012, 2014, 2016 and 2018. In 2011, Duffy voted to end Davis–Bacon Act.\"Republican Representative Sean Duffy of Wisconsin\". That's My Congress. Retrieved March 5, 2014.\"Sean Duffy on Jobs\", ontheissues.org. Retrieved March 5, 2014.Bivins, Larry (December 24, 2011). \"Duffy ends 2011 with bill he promised at start\" . The Marshfield News-Herald. Duffy was on the Select Investigative Panel on Planned Parenthood. Duffy supported President Donald Trump's 2017 executive order to add a temporary ban on entry to the U.S. to citizens of seven Muslim- majority countries. Duffy resigned his seat on September 23, 2019, to take care for a newborn daughter with health issues. ==U.S. Secretary of Transportation== On November 18, 2024, President-elect Donald Trump said he would nominate Duffy to be his secretary of transportation for his second presidency. During his hearing on January 15, 2025, he said that if confirmed, his first trip as transportation secretary would be to the Appalachian mountain regions of Tennessee and North Carolina, where flooding from Hurricane Helene damaged major interstate highways and bridges. The Senate Committee on Commerce, Science and Transportation approved his nomination in a 28-0 vote on January 22. The United States Senate confirmed his nomination in a 77-22 vote on January 28. Duffy was sworn in by United States Supreme Court Justice Clarence Thomas a few hours later.Sean Duffy Sworn In as Secretary of U.S. Department of Transportation and Takes Immediate Action to Make Cars More Affordable In his first act in office on January 29, Duffy made his department end and replace all existing corporate average fuel economy standards and ended the electric vehicle mandate. On his first official day in office, Duffy responded to the 2025 Potomac River mid-air collision and opened an investigation into the cause of the crash. ==Personal life== In 1999, Duffy married Rachel Campos-Duffy.Campos-Duffy, Rachel. \"I'm Expecting My 5th: What To Make Of The Trend In Bigger Families\". Parent Dish, December 19, 2007. They have nine children. Duffy is a Roman Catholic. They live in Weston, Wisconsin. ==References== ==Other websites== * Congressman Sean Duffy official U.S. House website * Sean Duffy for Congress * * Category:1971 births Category:Living people Category:United States representatives from Wisconsin Category:American sports commentators Category:Lawyers from Wisconsin Category:Businesspeople from Wisconsin Category:District attorneys Category:Television personalities from Wisconsin Category:Republican Party (United States) politicians Category:CNN people Category:Fox News people",
 "title": "Sean Duffy"
}