{
 "id": "773040",
 "text": "Scilab is an open source MATLAB-like programming language for numerical analysis.Mora, Á., Galán, J. L., Aguilera, G., Fernández, Á., Mérida, E., & Rodríguez, P. (2010). Scilab and Maxima Environment: Towards Free Software in Numerical Analysis. International Journal for Technology in Mathematics Education, 17(2).Bunks, C., Chancelier, J. P., Delebecque, F., Goursat, M., Nikoukhah, R., & Steer, S. (2012). Engineering and scientific computing with Scilab. Springer Science & Business Media. It is used in many countries including non-English regions. == Syntax == Scilab syntax is largely based on the MATLAB language. The simplest way to use Scilab codes is to type it in at the prompt, `--> `, in the graphical command window. Hello World! in Scilab: disp('Hello World'); == Toolboxes == Scilab has many toolboxes for different tasks, such as * Scilab Image Processing Toolbox (SIP) and its variants (such as SIVP). This is used for image processing.Fabbri, R., Bruno, O. M., & Costa, L. D. F. (2012). Scilab and SIP for image processing. arXiv preprint arXiv:1203.4009.Thanki, R. M., & Kothari, A. M. (2019). Digital image processing using SCILAB. Springer International Publishing. * Scilab Wavelet Toolbox: Used for wavelets * Scilab Java and .NET Module * Scilab Remote Access Module More are available on ATOMS Portal or the Scilab forge. ==Differences between GNU Octave== GNU Octave is also a MATLAB-like language. But it was made by different technical viewpoints. ==Usage== The original purpose of Scilab was numerical analysis (such as numerical methods for ordinary differential equationsWouwer, A. V., Saucez, P., & Vilas, C. (2014). Simulation of Ode/Pde Models with MATLAB®, OCTAVE and SCILAB: Scientific and Engineering Applications. Springer.). Today, it is also used in scientific educationSharma, N., & Gobbert, M. K. (2010). A comparative evaluation of Matlab, Octave, FreeMat, and Scilab for research and teaching. UMBC Faculty Collection.Campos, D., Dias, N., Dias, A., & Ferreira, H. (2010). INTRODUCING NUMERICAL ANALYSIS TOOLS IN ENGINEERING. A SCILAB USER CASE IN ELECTRONICS COURSE. Proceedings of ICERI, 5178-5184.Kouroussis, G., Fekih, L. B., Conti, C., & Verlinden, O. (2012, July). EasyMod: A MatLab/SciLab toolbox for teaching modal analysis. In Proceedings of the international congress on sound and vibration, Vilnius (pp. 9-12).Liao, W., Dong, N., & Fan, T. (2009, September). Application of Scilab in teaching of engineering numerical computations. In 2009 IEEE International Workshop on Open-source Software for Scientific Computation (OSSC) (pp. 88-90). IEEE. and optimization.Baudin, M., Couvert, V., & Steer, S. (2010). Optimization in scilab. Scilab Consortium, INRIA Paris-Rocquencourt.Baudin, M., & Steer, S. (2009, September). Optimization with scilab, present and future. In 2009 IEEE International Workshop on Open-source Software for Scientific Computation (OSSC) (pp. 99-106). IEEE. ==Notes== ==Other websites== Category:Free software Category:Computer science Category:Computing Category:Microsoft Windows software Category:Linux software",
 "title": "Scilab"
}