{
 "id": "773046",
 "text": "GitHub is an online software development assistance and version control service.Dabbish, L., Stuart, C., Tsay, J., & Herbsleb, J. (2012, February). Social coding in GitHub: transparency and collaboration in an open software repository. In Proceedings of the ACM 2012 conference on computer supported cooperative work (pp. 1277-1286).Pipinellis, A. (2018). GitHub Essentials: Unleash the power of collaborative development workflows using GitHub. Packt Publishing Ltd.Mergel, I. (2015). Open collaboration in the public sector: The case of social coding on GitHub. Government Information Quarterly, 32(4), 464-472.Beer, B. (2018). Introducing GitHub: A non-technical guide. \" O'Reilly Media, Inc.\".Dawson, C., & Straub, B. (2016). Building Tools with GitHub: Customize Your Workflow. \" O'Reilly Media, Inc.\". This platform uses Git.Blischak, J. D., Davenport, E. R., & Wilson, G. (2016). A quick introduction to version control with Git and GitHub. PLoS computational biology, 12(1), e1004668. It is operated by GitHub, Inc. based in the United States. In January 2020, GitHub reported that they have more than 40 million users and more than 100 million repositories (including at least 28 million public repositories). Therefore, it is recognized as the largest host of source code in the world. ==Organizational users== Currently, there are many individual GitHub users. On the other hand, there are also organizational users such as educational institutionsGriffin, T., & Seals, S. (2013). Github in the classroom: Not just for group projects. Journal of Computing Sciences in Colleges, 28(4), 74-74.Fiksel, J., Jager, L. R., Hardin, J. S., & Taub, M. A. (2019). Using GitHub Classroom To Teach Statistics. Journal of Statistics Education, 27(2), 110-119.Angulo, M. A., & Aktunc, O. (2019). Using GitHub as a teaching tool for programming courses. In ASEE Gulf-Southwest Section Annual Meeting 2018 Papers. American Society for Engineering Education. and companies. The following companies are using GitHub to distribute open source projects: * Facebook * Google Research (research facility of Google) * IBM * Microsoft * TeX Users Group (A community for LaTeX users) * Wolfram Research (developer of Wolfram Mathematica) ==Desktop version== GitHub was made for users who want to save their programs on their web browsers. But there is also a desktop version known as GitHub Desktop.Van Strien, D. (2016). An Introduction to Version Control Using GitHub Desktop. The Programming Historian. ==GitHub Pages== All GitHub users can create websites with the github.io domain. This service is known as GitHub Pages.Owen, D. (2017). Using GitHub pages for a computer science course website: conference tutorial. Journal of Computing Sciences in Colleges, 32(3), 36-36. The development history of the HTML code will be recorded with Git. ==Similar services== Today, there are several GitHub like services for developers. Some of them use Git but have different interface with unique web-design. One of the most famous GitHub rival is GitLab.Van Baarsen, J. (2014). GitLab Cookbook. Packt Publishing Ltd.O'grady, A. (2018). GitLab Quick Start Guide: Migrate to GitLab for all your repository management solutions. Packt Publishing Ltd. This is also based on Git. Users can export their programs on GitHub to GitLab. ==References== category:Web software category:Free software Category:Websites established in the 2000s category:2008 establishments in the United States category:Multinational technology companies Category:American websites",
 "title": "GitHub"
}