{
 "id": "773189",
 "text": "The Burmese alphabet is an alphabet that is used to write some languages, including the Burmese language. It is also used to write down the religious languages of Sanskrit and Pali. It is very different from the ABCs. It is known for having a lot of round letters that look like circles. Some people in Burma use the Burmese alphabet to write their own languages, but add extra letters to represent the sounds unique to their own languages. Burmese is written from left to right. == History == Monks would write on palm leaves. They had to make the letters round because straight lines would split the leaf and ruin it. Eventually, these round letters became the Burmese alphabet as we know it today. == Letters == The Burmese alphabet has 33 basic consonants. Extra marks are added to indicate vowels and tones. === Consonants === There are 33 consonants in the Burmese alphabet. When they are alone, they have an \"ah\" sound, although people use the \"uh\" sound when another syllable follows it. The Burmese alphabet is not organized the same way as the ABCs. Instead, consonants are organized by the parts of the mouth they are made in. For example, the first row of consonants are all sounds that are made when the tongue is against the back of the mouth. Some letters are written different in different cases to avoid confusion with other letters. For example, ဝ + ာ is written as ဝါ (wah) to avoid confusion with တ (t). There are letters that are used in words from Pali. They are: ဃ (gh), ဈ (jh), ဋ (ṭ), ဌ (ṭh), ဍ (ḍ), ဎ (ḍh), ဏ (ṇ), ဓ (dh), and ဠ (ḷ). Two letters, ၐ (ś) and ၑ (ṣ), are only used in words that are from Sanskrit. They are pronounced the same as သ. To make more consonants, special marks are written around or below consonants. These marks are: ျ, ြ, ွ, and ှ. They change the consonant sound. For example, ရ makes a y sound (like you) but ရ + ှ makes ရှ which makes a sh sound (like shoe). There are rules about which consonants can be changed this way. === Vowels === Every letter has a \"ah\" sound when it's alone. For example, က is pronounced as \"kah.\" When a lone letter is followed by another syllable, it is pronounced with a \"uh\" sound. Special marks are written around the letters to show other vowels. === Tones === Burmese is a tonal language. That means that the meaning of a word can change by how fast or slow someone let air out of their throats. In written Burmese, tones are indicated by special marks. These marks are း (high tone) and ့ (creaky tone, but can only be used when an ending consonants is written down too). === Syllable rhymes === Burmese words cannot end in a consonant sound. For example, \"cat\" would not be a word in Burmese because it has a \"t\" sound at the end. However, words are written with consonants to indicate special vowel sounds that are allowed at the end of Burmese words. These consonants have a special mark on them (်) called asat. When these consonants are combined with the vowels that are already written, they are called syllable rhymes. Some of these special consonants indicate that the word needs to end with a puff of air, like in \"uh-oh\" between the uh and the oh. They are: က်, စ်, တ်, ပ်. Other special sounds indicate that the vowels is nasal. Nasal vowels are not found in English, but are found in other languages like French and Portuguese. They are: င်, ည် ဉ်, န်, မ်. == Stacking consonants == In Burmese writing, consonants can be written on top of each other. There are very specific rules on which consonants can be stacked on top of which. ၁ is 1 ၂ is 2 ၃ is 3 ၄ is 4 ၅ is 5 ၆ is 6 ၇ is 7 ၈ is 8 ၉ is 9 ၁၀ is 10 ==References== Category:Burmese language Category:Alphabets",
 "title": "Burmese alphabet"
}