{
 "id": "773221",
 "text": "Jonathan Drew Groff (born March 26, 1985) is an American actor and singer born in Lancaster, Pennsylvania. He is known for playing King George III in the original Broadway production of Hamilton, Holden Ford in Netflix's Mindhunter, Kristoff in Frozen and Frozen II, and Jesse St. James in Glee. He has been nominated for two Tony Awards for Spring Awakening and Hamilton. He won a Grammy award as part of the cast recording album for Hamilton and won a Satellite Award in 2017 for Mindhunter. He is openly gay. == Filmography == === Film === Year Title Role Notes 2009 Taking Woodstock Michael Lang 2010 Twelve Thirty Jeff 2010 The Conspirator Louis Weichmann 2013 C.O.G. David 2013 Frozen Kristoff (voice) 2014 Russian Broadway Shut Down Nikolai the Athlete Short film 2014 Sophie Ben Short film 2014 American Sniper Young Vet Mads 2015 Frozen Fever Kristoff (voice) Short film 2017 Olaf's Frozen Adventure Short film 2019 Frozen II 2020 Hamilton King George III Filmed recording of 2016 Broadway musical 2021 The Matrix 4 Filming === Television === Year Title Role Notes 2007 One Life to Live Henry Mackler 11 episodes 2008 Pretty/Handsome Patrick Fitzpayne Pilot 2010–15 Glee Jesse St. James Recurring role; 15 episodes 2012 The Good Wife Jimmy Fellner Episode: \"Live from Damascus\" 2012 Boss Ian Todd Main cast; 10 episodes 2014–15 Looking Patrick Murray Lead role; 18 episodes 2014 The Normal Heart Craig Donner Television film 2016 Looking: The Movie Patrick Murray Television film 2016 LEGO Frozen Northern Lights Kristoff (voice) Television special 2017–2019 Mindhunter Holden Ford Lead role 2018 The Simpsons Actor Playing Bart (voice) Episode: \"Bart's Not Dead\" === Internet === Year Title Role Notes 2008 The Battery's Down Himself Web series • Episode: \"The Big Apple\" 2009 Web series • Episode: \"The Party's Over\" 2015 One True Pairing (Season 1) Dennis Web series • Episode: \"What's 'Your' Nickname\" 2016 One True Pairing (Season 2) Web series • 4 episodes 2017 36 Questions Jase Podcast Musical • Released through Two-Up podcast channel === Video games === Year Title Voice role 2019 Kingdom Hearts III Kristoff === Stage === Year Title Role Notes 2002 Honk! Ugly 2004 Bat Boy: The Musical Bat Boy 2005 Fame Nick Piazza North Shore Music Theatre In My Life Understudy • Swing Music Box Theatre • Broadway • Broadway debut 2006 Spring Awakening Melchior Gabor Atlantic Theater Company • Off-Broadway 2006–08 Eugene O'Neill Theatre • Broadway 2007 Hair Claude Hooper Bukowski Delacorte Theater 2008 Prayer for My Enemy Billy Noone Playwrights Horizons • Off-Broadway 2009 Gray Korankyi • Walter Rieman • Off-Broadway Dionysus Delacorte Theater 2010–11 Deathtrap Clifford Anderson Noël Coward Theatre • West End London, UK 2011 Danny Larsen MCC Theater • Off-Broadway 2012 Red Ken Mark Taper Forum 2013 L.A. Theatre Works Frederic Delacorte Theater 2015 How to Succeed in Business Without Really Trying J. Pierrepont Finch Royal Festival Hall • West End London, UK Hamilton King George III • Off-Broadway Gordon Michael Schwinn New York City Center • Lincoln Center 2015–16 Hamilton King George III Richard Rodgers Theatre • Broadway 2017 Hair Claude Hooper Bukowski Jazz at Lincoln Center • Lincoln Center Sondheim on Sondheim Performer Hollywood Bowl 2018 Bobby Darin 92nd Street Y • Off-Broadway 2019–20 Little Shop of Horrors Seymour Krelborn Westside Theatre • Off-Broadway == Discography == ; Cast recordings * 2006: Spring Awakening (Original Broadway Cast Recording) * 2010: Glee: The Music, The Power of Madonna * 2010: Glee: The Music, Volume 3 Showstoppers * 2010: Glee: The Music, Journey to Regionals * 2011: Glee: The Music, Volume 6 * 2013: Frozen (Original Motion Picture Soundtrack) * 2015: Hamilton (Original Broadway Cast Recording) * 2016: A New Brain (2015 New York Cast Recording) * 2017: 36 Questions: Songs from Act 1 – EP * 2017: 36 Questions: Songs from Act 2 – EP * 2017: 36 Questions: Songs from Act 3 – EP * 2017: Olaf's Frozen Adventure * 2019: Frozen II (Original Motion Picture Soundtrack) * 2019: Little Shop of Horrors (The New Off-Broadway Cast Album) ; Other recordings * 2007: \"Now\" from Dreaming Wide Awake: The Music of Scott Alan * 2015: \"Prayer\" from A View of the River: 7 Songs by Will Van Dyke & Jeff Talbott * 2015: \"Making Today a Perfect Day\" from Frozen Fever * 2019: \"I'll Be Home for Christmas\" by Lea Michele ; Audiobooks * 2008: Broadway Nights by Seth Rudetsky * 2013: Red by John Logan * 2015: Frozen Fever by VAVarious – Frozen Fever * 2019: The Killer Across the Table by John E. Douglas, Mark Olshaker ; Featured singles Year Title Peak chart positions Album USPeak positions for featured singles in the United States: * \"Hello\": * \"Like a Virgin\", \"Like a Prayer\", and \"Total Eclipse of the Heart\": * \"Run Joey Run\": * \"Another One Bites the Dust\": * \"Rolling in the Deep\": (N/A) AUSPeak positions for featured singles in Australia: * \"Hello\": * \"Like a Virgin\": * \"Like a Prayer\" and \"Total Eclipse of the Heart\": * \"Run Joey Run\": CANPeak positions for featured singles in Canada\" * \"Highway to Hell\": * \"Like a Virgin\", \"Like a Prayer\", and \"Total Eclipse of the Heart\": * \"Run Joey Run\": * \"Another One Bites the Dust\": IRE UK 2010 \"Highway to Hell\" — — 88 — 89 Glee: The Music, The Complete Season One \"Run Joey Run\" 61 64 45 12 27 \"Another One Bites the Dust\" 79 — 53 41 101 \"Bohemian Rhapsody\" — — — — — \"Hello\" 35 79 37 31 35 Glee: The Music, Volume 3 Showstoppers \"Total Eclipse of the Heart\" 16 28 17 3 9 \"Like a Virgin\" 87 99 83 47 58 Glee: The Music, The Power of Madonna \"Like a Prayer\" 27 28 27 2 16 2011 \"Rolling in the Deep\" 29 — — — 49 Glee: The Music, Volume 6 2015 \"You'll Be Back\" — — — — — Hamilton \"—\" denotes a recording that did not chart or was not released in the region Footnotes == References == Category:Satellite Award winners Category:1985 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American stage actors Category:LGBT actors Category:LGBT singers Category:Gay men Category:Actors from Pennsylvania Category:Singers from Pennsylvania Category:Tony Award winning actors",
 "title": "Jonathan Groff"
}