{
 "id": "773229",
 "text": "People's Bank is a state-owned commercial bank in Sri Lanka. Established on 1 July 1961, it has its head-offices at Sir Chittampalam A. Gardiner Street in Colombo. The bank offer both retail and corporate banking services, with a network of 739 local branches, service centers and has an asset base of LKR 1.873 trillion (2019) with over 14 million customers. People's Bank received a high national long-Term Rating of AA+ by Fitch Rating. == History == === 1960s === * 1961 People's Bank was inaugurated on 1st July 1961. The first branch was opened at Duke Street, Colombo. During the year, eight more branches were opened in Polonnaruwa, Hingurakgoda, Hambantota, Anuradhapura, Puttalam, Matale and Kandy in addition to the Foreign branch in Colombo. The Total number of employees stood at 169. * 1962 The Head Office was relocated to Ratnam's Building in Union Place, Colombo 02 and 17 more branches were opened. * 1963 The Bank commenced its pawning services. * 1964 The Co-operative Rural Banking Scheme was inaugurated. * 1965 Some departments of the Bank were relocated to the Government Clerical Service Union (GCSU) building Sir Chittampalam A. Gardiner Mawatha, Colombo 02. The total number of branches increased to 48, including new branches in Horana, Kekirawa, Padaviya, Mannar, Embilipitiya, Kahatagasdigilliya, Ragala and Talawakelle. * 1967 The Bank commenced a new Agriculture Credit Scheme becoming the pioneer lender to the small farm sector. === 1970s === * 1970 The \"Athamaru\" loan scheme was introduced to finance economic activities of the informal sector. The Investment Saving Scheme, a credit linked saving scheme was launched to attract regular savers. * 1971 The Bank's 100th branch was opened at Marandagahamula. * 1973 A comprehensive rural credit scheme was launched to provide both production and consumption credit facilities. The Bank initiated the \"Ganu-Denu\" practice, identifying itself with the traditions of the Sinhala & Tamil New Year and encouraging customers to transact with the Bank at the auspicious time. * 1975 An aggressive branch expansion programmed brought our total branch count to 158. * 1977 200th branch opened at Kollupitiya. The Head Office was relocated to building in Fort. The total number of employees reached 5,000. The first fisheries bank was opened at Koralawella. === 1980s === * 1981 Branch network increased to 290. The Extended Minors' Saving Scheme was lunched. * 1982 The 300th branch of the Bank opened at Ingiriya. The total number of employees reached 10,000. * 1984 The People's Merchant Bank, a subsidiary of the Bank, was established. Slave Island branch was merged with the International Division and the Fort Foreign Branch. * 1986 The process computerization began at Head Office and selected city branches and a Black Light System was introduced. Customer turnaround time was thereby significantly reduced. * 1987 Headquarters Branch became the Bank's first full-automated branch. A special loan scheme for rural electrification was implemented in collaboration with the CEB. * 1989 The Bank participated in a loan scheme sponsored by the Ministry of Labor to provide for housing against EPF balances. A scheme was launched in association with the Sri Lankan Foreign Employment Bureau to provide loans for job seekers abroad. The Bank participated in a loan scheme launched by REPIA to provide credit to those affected by civil unrest in 1983. A Janasaviya associated loan scheme was introduced during the year. The Bank also commenced issuing Negotiable Saving Certificates during the year. === 1990s === * 1990 An Endowment Saving Deposit Scheme was introduced. The People's Visa Card was introduced in association with Visa International and 24 branches were fully- computerized. * 1991 The first ATM was installed at Headquarters Branch. * 1992 The Bank supported the Government's 200 Garment Factory Programmed. \"People's Automated Banking System\" (PABS) a banking application developed in- house, commenced live operation. * 1993 330th branch were operating throughout the country and 35 main branches were fully automated. \"Vanitha Vasana\", a saving scheme for women was introduced. * 1994 Eight new ATMs were installed and 160 branches were computerized under the automation programmed. * 1995 \"Gurusetha\", a new deposit mobilization and loan scheme catering to Government teachers was launched with the co-operation of the Ministry of Education. * 1996 \"Suwa Sevana\", a credit package for Government sector health personnel was launched. \"Sisu Udaba\", a new deposit scheme for schoolchildren was introduced. The Bank participated in two ADB-funded credit scheme-the Tea Small Holding Development Project. The Bank's fully owned subsidiaries, People's Leasing Co. Ltd. and People's Travels (Pvt) Ltd., commenced operations. Zonal offices were opened to strengthen decentralised administration and to facilitate better customer service. * 1997 The \"Surathura\" Loan Scheme was launched to assist self-employment projects. The Bank extended its credit facilities to small and medium scale enterprise and industries under the NDB-funded Small and Medium Enterprise Assistance Project (SMEAP) * 1998 The total number of ATMs increased to 36, serving over 125,000 PET cardholders, One hundred and seventy-five branches were fully-automated and the number of pawing centres increased to 188. A special credit cum deposit scheme know as \"Videshika\" was introduced in collaboration with the Sri Lanka Foreign Employment Bureau to assist migrant workers. * 1999 The Bank lunched \"Isuru Udaba\", a deposit scheme that encourages parents and guardians to save for the benefit of their young charges. === 2000s === * 2000 The \"Jana Jaya\", saving cum loan scheme was launched. The newly introduced \"Jaya Sri\" draw offered attractive prizes for depositors. The ATM network expanded to 74 machines throughout the country. The Central ATM Switch was introduced to connect the PABS branches and the ATMs. * 2001 The Bank's Corporate Management team was strengthened by the recruitment of certain heads of divisions for the private banking sector. Restructuring of the Bank was initiated through the launched of a Strategic Plan. The total number of ATM machines grew to 90. * 2002 The number of PABS automated branches increased to 218 and 119 branches were connected to the Central ATM Switch. A treasure automation package was implemented. * 2003 The Young Executive Saver's (YES) Account was launched. The Bank signed up with Silver Lake System SDV BUD Malaysia to install a state-of-the-art core banking package and trade services solutions which will initially be operational in 60 selected branches including Head Office. * 2004 The second phase of the restructuring plan for 2004-2008 launched and approved by the Government of Sri Lanka was based on the recapitalization support of ADB. The Bank obtained the first ever public rating of BBB+ form Fitch Rating. The core banking project was implemented successfully. * 2005 This year followed immediately receipt of LKR 2 billion. as the first tranche of Government of Sri Lanka in keeping with the agreement signed between the Government, ADB and People's Bank. The core banking project was further extended across the branch network. The Bank was also a major intermediary in bringing Government-granted financial assistance for rebuilding, after the December 2004 tsunami. * 2006 The Bank obtained and A- rating form Fitch Rating. indicating progress from its earlier rating level. People's Bank was awarded the POP Award for 2006 in the banking and financial services sector by the Sri Lanka Institute of Marketing. The second tranche of capital of LKR 1 billion was received the Government of Sri Lanka. * 2007 The rating level of A- form Fitch Ratings was maintained during the year. The Government of Sri Lanka injected the third capital tranche of LKR 1.5 billion into People's Bank. People's Bank won the People's Award for the Banking and Financial Services Brand of the Year for the second consecutive year. The Bank surpassed the LKR 300 billion mark in total deposits during the year 2007. * 2008 The Government of Sri Lanka released the fourth capital tranche of LKR 1.5 billion The Bank reached the Capital Adequacy Level of 10.5% by the end of year. Further, the Bank's first Debenture issue of LKR 2.5 billion was made in year. A notable advancement in the Bank's remittance service with the introduction of \"People's e-remittance\", a web-based remittance product supported by later technology to remit money from overseas within minutes. Two new foreign currency deposits products were launched, viz., \"Doo Daru Ethera Isura\" a foreign currency deposit product for children and \"Special Foreign Investment Deposit Account\" [SFIDA]. * 2009 The Bank issued its second Debenture for LKR 2.5 billion during the year. 214 branches and 236 service centers were connected online. The Bank strategically placed over 300 ATMs island-wide. Total deposits reached LKR 400 billion. The highest recorded profit before tax of LKR 6.1 billion was achieved. Received a SAFA (South Asian Federation of Accountants) Award for the 2008 Annual Report for the first time in the Bank's history. === 2010s === * 2010 Branch network and service centres expanded to 679. ATMs increased to 330. People's International Visa Debit Card was launched in July 2010. The Bank obtained AA- from Fitch RAting. and AAA form Ram Ratings. Total deposits surpassed LKR 462 billion during the year 2010. The highest recorded profit before tax of LKR 8.7 billion was achieved. The People's Bank Annual Report won two Gold Awards at the ARC Awards held in New York. The Bank received the SAFA (South Asian Federation of Accountants) Award, for the 1st Place in the Public Sector Category, for the 2009 Annual Report. * 2011 The Bank celebrated the Golden Jubilee on 1st July 2011. Total branch network reached 714 whilst ATM locations increased to 382 covering almost all parts of the island. The Bank obtained an upgraded rating of AA form Fitch Ratings. The Bank's total assets, total deposits and total loans and receivables surpassed LKR 663 billion, LKR 539 billion and LKR 478 billion respectively. The highest recorded profit before tax of LKR 15.3 billion and a profit after tax of LKR 10.2 billion were achieved. People's bank won the SLIM-Nielsen Peoples's Award for the Most Popular Bank in the Sri Lankan Banking and Financial Services Sector, the SLIM-Nielsen People's Award-Service Brand of the Year, and also won the Bronze for the Service Category at the SLIM Brand Excellence Awards 2011. * 2012 The total branch network reached 728, whilst ATM location increased to 420 covering almost all parts of the island. The Bank obtained an upgraded rating of AA+ for Fitch Ratings. The Bank's 2011 Annual Report won one Grand Award and three Gold Award in the National Category at the 2012 International ARC Award. * 2013 23 SME centers were established across the island. Surpassed one million cards milestone during the year with access to over 30 million Visa accredited merchants globally. Corporate customers were provided with an on line real time payment facility for PET, ETF and Customers Duty Payments. People's Bank become the first bank to be connected to the National Common ATM Switch. ATM locations increased to 460 with the branch network expanding to 735. LKR 5 billion worth Debentures issued during the year at the Bank's fourth Debenture issue. * 2014 The Bank's asset base crossed one trillion rupees, as the second largest bank in the industry (after BOC). Bank garnered the triple accolades of \"Bank of the Year 2014\" at the European Global Banking and Finance Award-Sri Lanka 2014 and \"Most Sustainable Bank Sri Lanka\" at the World Finance Banking Awards 2014. * 2015 The Bank commenced an ambitious digitization initiative with the objective of enhancing its customer value proposition, generating operational efficiencies and strengthening risk management capabilities. Accordingly, the Bank upgraded its ATM network platform to increase security and reliability to customers. Investments were also made in upgrading the Core Banking System, data warehousing the Core Banking System, data warehousing capabilities and POS infrastructure. The Bank launched a Green Banking Concept in demonstrating its sustainability commitments. Successfully rolled out to the Bank's Strategic Plan for 2016-2020, which is expected to further fortify the Bank's market position and deliver long-term value to its stakeholders. * 2016 The Group achieved the rupees one trillion milestones in both deposits and advance during the year, the only financial services group to achieve two trillion rupee feats in single year. The Bank was awarded the \"Best Banking Group in Sri Lanka\" and the \"Most Sustainable Bank in Sri Lanka\" by World Finance Banking Awards for the third consecutive year. It was also adjudged the 387th largest Banking in Asia. In line with its digitization drive, the Bank launched self-banking centers computerizing cash deposit machines (CDM), ATMs and kiosks in seven locations in Colombo, effectively catering to customers' increasing demand for convenient financial solutions and seamless banking. The Bank launched a new logo to reflect the Bank's evolution in keeping pace with new global trends and catering to the fast changing aspirations of customers. * 2017 The consolidated contribution towards national economic development via taxation, special levies and dividends over the last ten years surpassed the LKR 150 bullion mark. Additionally, the Bank received a new capital infusion pf LKR 5 billion for the first time in the past eight years. The Bank witnessed many firsts in the Digital and information Technology sphere, with the opening of Sri Lanka's first fully-digitalis-ed branch in Colombo and receiving the prestigious ISO/IEC 27001:2013 quality certification for Information Security Management first any State Bank in the nation. the 400th Largest Bank in Asia as per the Asian Banker Magazine and included in the World's Top 1000 Banks by the Banker Magazine (UK). Locally, People's Bank was crowned \"Country's Best Bank in 2017\" at the National Business Excellence Award and was recognized as the second most valuable Sri Lankan brand by the global brand consecutive year, the Bank was conferred the exclusive \"People's Service Brand of the Year\" and \"People's Banking Service Provider of the Year\" Award at the SLIM-Nielsen People's Award in 2017. * 2018 LKR 10.9 billion syndicated loan facility extended to Hayleys for the acquisition of Singer Sri Lanka which it the single largest transaction of a listed company in Sri Lanka in recent time. Six alternative digital channel were launched during 2018 for the benefit and ease of customers namely People's Wave mobile banking application, People's Web/Internet banking, People's Wyn-internet banking and mobile app. for corporate clients, RLOS-Retail Loan Origination System and CLOS-Corporate Loan Origination System. Among the many finance apps in the country, People's Wave has become the most downloaded fiance app in Sri Lanka. For the 12th consecutive year, the bank was awarded the \"People's Banking Service Provider of the Year\". The Bank also secured the top spot as \"The Banking of the Year for Excellence in Customer Convenience\" at the LankaPay Technnovation Awards 2018. Further, People's Bank won the \"Excellence in Local Market Reach\" Award at the National Business Excellence Awards. On the global level, the Bank was once again raked among the Top 1000 Banks in the World by the Banker Magazine, UK and, adjudged \"The Best Bank in Sri Lanka\" at the European Global Banking and Finance Awards 2018. Further, as a testament to our relentless commitment to excellence in digitization, People's Bank clinched the \"Best Branch Digitization Initiative Program Award\" in Asia Pacific Region at the Asian Banker Business Achievement Awards 2018 for Financial Technology Innovation. * 2019 The People's Bank (Amendment) Bill was passed in Parliament in September 2019, enabling the Bank to issue debentures with relative ease to augment its regulatory capital. Post amendment, the Bank successfully raised LKR 10 billion in Base III, Tier II compliant Debentures. The roll out of self banking units (SBU's) was accelerated during the past two years to reach 239 at end 2019 a feat achieved in just three years. The success of the Bank in digital platform, is demonstrated through the numerous awards received internationally which include the Best Digital Bank 2019 by both the Asian Banker Magazine and Asian Money and being the recipient of the Best Mobile Banking Application by the Asian Banking Magazine for 2019. At the Asian Banker Financial Technology Innovation Awards 2018, People's Bank was awarded the Best Digitization Initiative Programmed. The Bank was recognized as the Best Retail Bank in Sri Lanka and the Most Improved Retail Bank in Asian Pacific, Middle East and Africa by the Asian Banker Magazine during 2019. The Asian Development Bank in Sri Lanka, for its Trade Finance operations. == Related pages == * Central bank == References == Category:1960s establishments in Ceylon Category:1961 establishments in Asia Category:Banks of Asia Category:Companies of Sri Lanka",
 "title": "People's Bank (Sri Lanka)"
}