{
 "id": "773236",
 "text": "Wolfram Research is an US-based technology company. It was named after their founder. They are known for creating many computational products that supports scientific researchers. ==Notable products== ===Wolfram language=== This is a programming language made by Wolfram Research.León, J. G. S. (2017). Mathematica beyond mathematics: The Wolfram language in the real world. CRC Press.Mias, G. (2018). Mathematica for Bioinformatics: A Wolfram Language Approach to Omics. Springer.Mias, G. (2018). A Wolfram Language Primer for Bioinformaticians. In Mathematica for Bioinformatics (pp. 7-65). Springer, Cham. Most Wolfram products are based on this language. ===Wolfram Mathematica=== This is a modern technical computing system made by Wolfram Research.Cheung, C. K., Keough, G. E., Gross, R. H., & Landraitis, C. (2005). Getting started with Mathematica. Wiley.Mangano, S. (2010). Mathematica Cookbook: Building Blocks for Science, Engineering, Finance, Music, and More. \" O'Reilly Media, Inc.\".Gass, R. (1997). Mathematica for scientists and engineers: using Mathematica to do science. Prentice Hall PTR.Shaw, W. T., & Tigg, J. (1993). Applied Mathematica: getting started, getting it done. Addison-Wesley Longman Publishing Co., Inc.. It is used in many scientific areas including numerical analysisCotta, R. M., Leonardo, S. D. B., & Mikhailov, M. D. (2001). Applied Numerical Analysis with Mathematica. Editora E-papers. and their subfields.Davis, H. T., & Thomson, K. T. (2000). Linear Algebra and Linear Operators in Engineering: With Applications in Mathematica®. Elsevier. Anyone who are interested in Wolfram Mathematica demos can check the Wolfram Demonstrations Project.Carducci, O. M. (2009). The Wolfram demonstrations project. MAA Focus, 28(1), 8-9.Maclachlan, F., Bolte, W. J., & Chandler, S. (2009). Interactive Economic Models from the Wolfram Demonstrations Project. The Journal of Economic Education, 40(1), 108-108.Gorgol, I. (2015). Wolfram demonstrations project platform as a support in teaching. Advances in Science and Technology Research Journal, 9(26). ===Wolfram Alpha=== This service is available on web browsers.Hoy, M. B. (2010). Wolfram| Alpha: a brief introduction. Medical reference services quarterly, 29(1), 67-74.Weisstein, E. (2014). Computable data, Mathematics, and digital libraries in Mathematica and Wolfram| Alpha. In Intelligent Computer Mathematics (pp. 26-29). Springer, Cham.David, C., Lange, C., & Rabe, F. (2010). Interactive Documents as Interfaces to Computer Algebra Systems: JOBAD and Wolfram| Alpha. CALCULEMUS (Emerging Trends), 13-30. Users can use some features of Wolfram Mathematica on the Internet. Wolfram Alpha can also answer to some questions by searching answers on their own databases. It is also used in scientific education.Dimiceli, V. E., Lang, A. S., & Locke, L. (2010). Teaching calculus with Wolfram| Alpha. International Journal of Mathematical Education in Science and Technology, 41(8), 1061-1071.Necesal, P., & Pospıšil, J. (2012). Experience with teaching mathematics for engineers with the aid of Wolfram Alpha. In Proceedings of the World Congress on Engineering and Computer Science (Vol. 1, pp. 271-274).Delgado, F. (2013, June). Meaningful Learning of Math and Sciences Using Wolfram Alpha Widgets. In EdMedia+ Innovate Learning (pp. 1794-1799). Association for the Advancement of Computing in Education (AACE). ===Wolfram SystemModeler=== This is a technical platform for systems engineering.Lynch, S. (2017). An Introduction to Wolfram SystemModeler. In Dynamical Systems with Applications Using Mathematica® (pp. 509-522). Birkhäuser, Cham.Rozhdestvensky, K., Ryzhov, V., Fedorova, T., Safronov, K., Tryaskin, N., Sulaiman, S. A., ... & Hassan, S. (2020). Computer Modeling and Simulation of Dynamic Systems Using Wolfram SystemModeler. Springer Singapore. This is also based on Wolfram technology. ===Computable Document Format=== This is an electronic document format. It is designed to allow interactive contents in documents.Russell, D. A. (2013, June). Creating interactive acoustics animations using Mathematica's Computable Document Format. In Proceedings of Meetings on Acoustics ICA2013 (Vol. 19, No. 1, p. 025006). Acoustical Society of America. ===ScienceWorld=== This is an online scientific encyclopedia managed by Wolfram Research. ===Wolfram Technology Conference=== This is an annual conference about the latest technologies from Wolfram Research.Campbell, J. F., Prasad, N., Flood, M., & Harrison, F. (2010, October). Experiments in Mathematica with spread spectrum SONAR. In Wolfram Technology Conference.Vílchez, E. (2016, October). VilCretas package: educational resource through the use of Mathematica software in the field of discrete mathematics. In Wolfram Technology Conference 2016. ==References== ==Other websites== * * * Hoovers Fact Sheet on Wolfram Research, Inc. * Michael Trott: The Science and Art of Mathematica by Tim McIntyre, Science, Apple.com, 2007. * The Mathematics Behind NUMB3RS, Wolfram's site on NUMB3RS mathematics. * Supercomputer Pictures Solve the Once Insoluble, John Markoff, The New York Times, October 30, 1988 * Meet an Inventor Whose Product Makes Complex Calculus Simple by Gautam Naik, The Wall Street Journal, September 25, 1996 * Stephen Wolfram's Simple Science by Michael Arndt, Business Week, May 17, 2002. * Wolfram releases 'revolutionary' Mathematica 6: Mathematica 6 developer promises a 'revolution in computing' by Jonny Evans, MacWorld, May 2, 2007. Category:American software companies Category:Companies based in Illinois category:Multinational technology companies category:Computing category:Computer science Category:1987 establishments in the United States",
 "title": "Wolfram Research"
}