{
 "id": "773202",
 "text": "The wind farm of Jabal Al-Zait is a power plant which produces electricity by wind energy. The wind farm is located in Jabal al-Zeit after Ras Gharib in the Red Sea Governorate. The plant area is 100 square kilometres, with 300 wind turbines. The construction project of the plant started in 2015. The cost of the Jabal Al-Zayt farm reached about 12 billion Egyptian pounds. The farm was established with the objectives of increasing the amount of clean energy in the Egyptian national network and reducing the consumption of fossil fuels. The European Union has provided a 30 million Euro grant to the project which costs a total of 340 million Euros. Several European donors, including the German Development Bank, have also contributed to this ambitious project on the shores of the Red Sea, with the aim of generating clean energy. In total, the Gabal El-Zayt project generates 580 MW, each turbine producing 2000 kilos of electricity, compared to 850 kilos per turbine at Zaafarana. Each turbine is cleaned every two years and undergoes maintenance every six months. ==The capabilities of the plant== * The station consists of three administrative buildings, including the station's control rooms building, which have been created and designed in line with international standards. * Inside the turbine columns of the farm there are electric lifts for periodic maintenance, the turbine rotation speed can reaches 16 rpm, and the wind speed in the station area reaches 12-33 m / s. * The production rate at Jabal al-Zeit plant reached a standard number, which is 52% of the total capacity of the station. * The station contains a system for monitoring Bird migration through the radar, where the turbines are stopped when they pass and then restart later. This system is created in order to maintain the safety of the birds, which may reach 300 thousand birds. ==References== Category:Wind farms Category:Buildings and structures in Egypt",
 "title": "Jabal al-Zeit wind farm"
}