{
 "id": "773252",
 "text": "Lili Pauline Reinhart (born September 13, 1996), commonly known as Lili Reinhart, is an American actress. She is known for played Betty Cooper in The CW teen drama series Riverdale and Annabelle in the comedy-drama movie Hustlers (2019). ==Early life== Lili Reinhart was born in Cleveland, Ohio. She grew up in the nearby town of Bay Village. She is of German and French descent, and has stated her surname is German. ==Personal life== Reinhart is a bisexual Christian. She practices Transcendental Meditation and is training to be a reiki healer. Reinhart was diagnosed with depression at 14 years old. She has also opened up about her experiences with anxiety and body dysmorphia. She came out as bisexual in June 2020. She was diagnosed with alopecia in January 2024. In January 2025, she revealed that she had interstitial cystitis, a chronic bladder condition from which she suffered a lot, calling the year prior to her diagnosis the \"hardest year of my life\". ==Filmography== ===Film=== Year Title Role Notes 2011 Lilith Lilith Wilson 2012 Not Waving But Drowning Amy 2013 The Kings of Summer Vicki Gibsonburg Kathy Colaner Forever's End Lily White 2016 Miss Stevens Margot Jensen The Good Neighbor Ashley 2018 Galveston Tiffany 2019 Hustlers Annabelle Charlie's Angels Angel Recruit Cameo 2020 Chemical Hearts Grace Town Also executive producer 2022 Jennifer Lopez: Halftime Herself Documentary film; interview clip Look Both Ways Natalie Also executive producer 2025 American Sweatshop Daisy Moriarty Also executive producer TBA Forbidden Fruits Filming ===Television=== Year Title Role Notes 2010 Scientastic! Leah Episode: \"Sticks and Stones\" 2011 Law & Order: Special Victims Unit Courtney Lane Episode: \"Lost Traveller\" 2014 Surviving Jack Heather Blumeyer 6 episodes 2015 Cocked Marguerite Paxson Television film 2017–2023 Riverdale Elizabeth \"Betty\" Cooper Main role 2020 One World: Together at Home Herself Television special The Simpsons Bella-Ella (voice) Episode: \"The Hateful Eight-Year-Olds\" 2025 Hal & Harper Harper Main role; also executive producer ===Podcast=== Year Title Role Notes 2022 On Purpose with Jay Shetty Herself Episode: \"Lili Reinhart ON: Living With Anxiety & Giving Yourself Permission to Feel All of Your Emotions\" ==Discography== List of Lili Reinhart soundtrack appearances Title Year Album \"Jigsaw\" 2013 Forever's End \"In\" 2018 Riverdale: Special Episode – Carrie the Musical (Original Television Soundtrack) \"Do Me a Favor\" \"The World According to Chris\" \"You Shine\" \"A Night We'll Never Forget\" \"Mad World\" Riverdale: Season 2 (Original Television Soundtrack) \"Beautiful\" 2019 Riverdale: Special Episode – Heathers the Musical (Original Television Soundtrack) \"Candy Store\" \"Big Fun\" \"Seventeen\" \"Seventeen (Reprise)\" \"Dream Warriors\" Riverdale: Season 3 (Original Television Soundtrack) \"Wicked Little Town\" 2020 Riverdale: Special Episode – Hedwig and the Angry Inch the Musical (Original Television Soundtrack) \"Random Number Generation\" \"Wig in a Box\" \"Exquisite Corpse\" \"The Origin of Love\" \"Wicked Little Town (Reprise)\" \"Midnight Radio\" \"Just Another Day\" 2021 Riverdale: Special Episode – Next to Normal the Musical (Original Television Soundtrack) \"I Miss the Mountains\" \"Everything Else\" \"It's Gonna Be Good\" \"She's Not Here\" \"I Am the One\" \"I've Been\" \"Make Up Your Mind / Catch Me I'm Falling\" \"A Promise\" \"Maybe (Next to Normal)\" \"Light\" \"Walking in Space\" Riverdale: Season 5 (Original Television Soundtrack) \"Nothin' But a Good Time\" \"You Are What You Wear\" 2022 Riverdale: Special Episode: American Psycho the Musical (Original Television Soundtrack) - EP \"A Girl Before\" \"The End of the World\" Riverdale: Season 6 (Original Television Soundtrack) ==Awards and nominations== Year Award Category Nominated work Result 2017 Teen Choice Awards Choice Breakout TV Star Riverdale Choice TV Ship Riverdale 2018 Saturn Awards Best Performance by a Younger Actor in a Television Series Riverdale Teen Choice Awards Choice Drama TV Actress Riverdale Choice Liplock Riverdale Choice TV Ship Riverdale Variety + H&M; Conscious Award Conscious Award — 2019 People's Choice Awards Drama TV Star of 2019 Riverdale Female TV Star of 2019 Riverdale Teen Choice Awards Choice Drama TV Actress Riverdale Choice Ship Riverdale 2020 People's Choice Awards Female TV Star of 2020 Riverdale 2021 Critics' Choice Super Awards Best Actress in a Superhero Series Riverdale ==Publications== *Swimming Lessons: Poems (September 29, 2020) *September Love (November 3, 2020) (co-written with Lang Leav) ==References== Category:Actors Category:1996 births Category:LGBT actors Category:LGBT people Category:Living people Category:LGBT Christians Category:American actors Category:American people Category:Bisexual people Category:Actors from Cleveland Category:American child actors Category:American movie actors Category:LGBT people from Ohio Category:American television actors",
 "title": "Lili Reinhart"
}