{
 "id": "773502",
 "text": "The Lieutenant Governor is a constitutional officer of the Commonwealth of Pennsylvania. The lieutenant governor is elected for a four-year term in the same year as the governor. Each party picks a candidate for lieutenant governor independently of the gubernatorial primary. The winners of the party primaries are then teamed together as a single ticket for the fall general election. The lieutenant governor is in charge of the Senate and is first in the line of succession to the governor; in the event the governor dies, resigns, or otherwise leaves office, the lieutenant governor becomes governor. ==List== ;Parties # Name Term Governor(s) served under Party 1 John Latta 1875–1879 John F. Hartranft Democrat 2 Charles Warren Stone 1879–1883 Henry M. Hoyt Republican 3 Chauncey Forward Black 1883–1887 Robert E. Pattison Democratic 4 William T. Davies 1887–1891 James A. Beaver Republican 5 Louis Arthur Watres 1891–1895 Robert E. Pattison Republican 6 Walter Lyon 1895–1899 Daniel H. Hastings Republican 7 John P. S. Gobin 1899–1903 William A. Stone Republican 8 William M. Brown 1903–1907 Samuel W. Pennypacker Republican 9 Robert S. Murphy 1907–1911 Edwin Sydney Stuart Republican 10 John M. Reynolds 1911–1915 John K. Tener Republican 11 Frank B. McClain 1915–1919 Martin Grove Brumbaugh Republican 12 Edward E. Beidleman 1919–1923 William Cameron Sproul Republican 13 David J. Davis 1923–1927 Gifford Pinchot Republican 14 Arthur H. James 1927–1931 John Stuchell Fisher Republican 15 Edward C. Shannon 1931–1935 Gifford Pinchot Republican 16 Thomas Kennedy 1935–1939 George Howard Earle III Democratic 17 Samuel S. Lewis 1939–1943 Arthur James Republican 18 John Cromwell Bell Jr. 1943–1947 Edward Martin Republican 19 Daniel B. Strickler 1947–1951 James H. Duff Republican 20 Lloyd H. Wood 1951–1955 John S. Fine Republican 21 Roy E. Furman 1955–1959 George M. Leader Democratic 22 John Morgan Davis 1959–1963 David L. Lawrence Democratic 23 Raymond P. Shafer 1963–1967 William Scranton Republican 24 Raymond J. Broderick 1967–1971 Raymond P. Shafer Republican 25 Ernest P. Kline 1971–1979 Milton Shapp Democratic 26 William Scranton III 1979–1987 Dick Thornburgh Republican 27 Mark Singel 1987–1995 Robert P. Casey Democratic 28 Mark S. Schweiker 1995–2001 Tom Ridge Republican 29 Robert C. Jubelirer 2001–2003 Mark S. Schweiker Republican 30 Catherine Baker Knoll 2003–2008 Ed Rendell Democratic 31 Joseph B. Scarnati III 2008–2011 Ed Rendell Republican 32 Jim Cawley 2011–2015 Tom Corbett Republican 33 Mike Stack 2015–2019 Tom Wolf Democratic 34 John Fetterman 2019–2023 Tom Wolf Democratic 35 Austin Davis since 2023 Josh Shapiro Democratic ==References==",
 "title": "Lieutenant Governor of Pennsylvania"
}