{
 "id": "774072",
 "text": "John Bishop (born 30 November 1966) is an English comedian, presenter, actor, and former footballer. Bishop played for Hyde FC and Southport FC. His was first on television with The Panel in 2008. He later appeared in the E4 teen drama Skins (seasons 3 and 4) and in the Ken Loach movie Route Irish. He also does stand-up comedy. In 2004, he won the best North West stand-up comedian award.\"North West Comedy Awards – the winners!\", BBC Manchester. He was also nominated for a Edinburgh Comedy Award that same year. He is from Liverpool and is well known for speaking with a strong Liverpool accent. ==Filmography== ;Television Year Title Role Notes 2007–2008 The Panel Panellist 6 episodes 2008 Celebrity Juice Guest panellist Series 1, Episode 7 2009, 2010 Live at the Apollo Guest performer 2 episodes 2009, 2010 Michael McIntyre's Comedy Roadshow Guest performer Series 1, Episode 2 & Series 2, Episode 3 2009–2010 Skins Rob Fitch Series 3–4 (3 episodes) 2010–2011 John Bishop's Britain Presenter 2 series on BBC One 2010–2011 A League of Their Own Regular (appeared as a guest panelist in Series 11) 4 series 2010 Have I Got News for You Guest presenter Series 39, Episode 9 & Series 40, Episode 3 2010 Mock the Week Guest panellist Series 8, Episode 2 2010 Would I Lie to You? Guest panellist Series 4, Episode 8 2011 Top Gear Guest Series 16, Episode 3 2011 Little Crackers Bobby Series 2, Episode 7: \"John Bishop's Little Cracker\" 2012 Who Do You Think You Are? Himself Series 9, Episode 10 2012 Accused Peter Cartwright Two episodes (Stephen's Story and Tina's Story) 2012 Panto! Lewis Loud With Sheridan Smith 2013 John Bishop's Only Joking Presenter 2013–2015 John Bishop's Christmas Show Presenter One-off specials for BBC One 2013 Royal Variety Performance Presenter 2014 John Bishop's Australia Presenter Mini- series 2014 A Night in With Olly Murs Himself One-off special 2015 Backchat Guest Series 2, Episode 5 2015 The John Bishop Show Presenter 1 series 2015 TFI Friday Guest Series 7, Episode 6 2015 John Bishop's Gorilla Adventure Presenter One-off show 2015 Top Gear from A-Z Narrator One-off specials 2016— John Bishop: In Conversation With... Presenter Also executive producer 2016 Jamie & Jimmy's Friday Night Feast Guest Series 4, Episode 1 2017 The Nightly Show Guest presenter 5 episodes 2017 Fearless Steve Livesey ITV drama, 4 episodes 2019 John Bishop's Ireland Presenter Mini-series 2019 ;Movie Year Title Role Notes 2011 (UK) Route Irish Frankie 2014 One Rogue Reporter Himself 2017 Funny Cow Colin Pile ==References== Category:1966 births Category:Living people Category:English comedians Category:English television presenters Category:Actors from Liverpool",
 "title": "John Bishop"
}