{
 "id": "774002",
 "text": "AlphaGo is a computer program that plays the board game Go.Wang, F. Y., Zhang, J. J., Zheng, X., Wang, X., Yuan, Y., Dai, X., ... & Yang, L. (2016). Where does AlphaGo go: From church-turing thesis to AlphaGo thesis and beyond. IEEE/CAA Journal of Automatica Sinica, 3(2), 113-120.Chen, J. X. (2016). The evolution of computing: AlphaGo. Computing in Science & Engineering, 18(4), 4-7. It was made by DeepMind Technologies (Google affiliate).Chang, H. S., Fu, M. C., Hu, J., & Marcus, S. I. (2016). Google Deep Mind's AlphaGo. OR/MS Today, 43(5), 24-29. This program became famous due to the victories against professional players.Chao, X., Kou, G., Li, T., & Peng, Y. (2018). Jie Ke versus AlphaGo: A ranking approach using decision making method for large- scale data with incomplete information. European Journal of Operational Research, 265(1), 239-247.Borowiec, S. (2016). AlphaGo seals 4-1 victory over Go grandmaster Lee Sedol. The Guardian. Many new technologies were used to create AlphaGo, including deep learning,Granter, S. R., Beck, A. H., & Papke Jr, D. J. (2017). AlphaGo, deep learning, and the future of the human microscopist. Archives of pathology & laboratory medicine, 141(5), 619-621. optimization,Chen, Y., Huang, A., Wang, Z., Antonoglou, I., Schrittwieser, J., Silver, D., & de Freitas, N. (2018). Bayesian optimization in alphago. arXiv preprint arXiv:1812.06855. and the Monte Carlo algorithm.Fu, M. C. (2016, December). AlphaGo and Monte Carlo tree search: the simulation optimization perspective. In 2016 Winter Simulation Conference (WSC) (pp. 659-670). IEEE. ==Powered versions== After the release of AlphaGo, DeepMind Technologies has made powered versions such as the AlphaGo ZeroHolcomb, S. D., Porter, W. K., Ault, S. V., Mao, G., & Wang, J. (2018, March). Overview on deepmind and its AlphaGo Zero AI. In Proceedings of the 2018 international conference on big data and education (pp. 67-71)Lapan, M. (2018). Deep Reinforcement Learning Hands-On: Apply modern RL methods, with deep Q-networks, value iteration, policy gradients, TRPO, AlphaGo Zero and more. Packt Publishing Ltd. and the AlphaZero.Marcus, G. (2018). Innateness, alphazero, and artificial intelligence. arXiv preprint arXiv:1801.05667.Tian, Y., Ma, J., Gong, Q., Sengupta, S., Chen, Z., Pinkerton, J., & Zitnick, C. L. (2019). Elf opengo: An analysis and open reimplementation of alphazero. arXiv preprint arXiv:1902.04522.Bratko, I. (2018). AlphaZero–what’s missing?. Informatica, 42(1).Dalgaard, M., Motzoi, F., Sorensen, J. J., & Sherson, J. (2020). Global optimization of quantum dynamics with AlphaZero deep exploration. npj Quantum Information, 6(1)Xu, L. (2018, December). Deep bidirectional intelligence: AlphaZero, deep IA-search, deep IA-infer, and TPC causal learning. In Applied Informatics (Vol. 5, No. 1, p. 5). Springer Berlin Heidelberg. AlphaZero is a self-taught program.The New Yorker, How the Artificial-Intelligence Program AlphaZero Mastered Its Games, By James Somers, December 28, 2018. This means that it became powerful without human guidance. ==Details== The following table is the summary of AlphaGo achievements (including its variants). Strength of AlphaGo and its variants Versions Hardware Elo rating Date Results AlphaGo versus Fan Hui 176 GPUs,distributed 3,144 Silver, David; Schrittwieser, Julian; Simonyan, Karen; Antonoglou, Ioannis; Huang, Aja; Guez, Arthur; Hubert, Thomas; Baker, Lucas; Lai, Matthew; Bolton, Adrian; Chen, Yutian; Lillicrap, Timothy; Fan, Hui; Sifre, Laurent; Driessche, George van den; Graepel, Thore; Hassabis, Demis (19 October 2017). \"Mastering the game of Go without human knowledge\". Nature. 550 (7676): 354–359. Oct 2015 5:0 against Fan Hui (professional player) AlphaGo versus Lee Sedol 48 Tensor processing units (TPUs), distributed 3,739 Mar 2016 4:1 against Lee Sedol (former Korean & world champion) AlphaGo Master 4 TPUs, single machine 4,858 May 2017 60:0 against professional players AlphaGo Zero (40 block) 4 TPUs, single machine 5,185 Oct 2017 100:0 against AlphaGo version that defeated Lee Sedol 89:11 against AlphaGo Master AlphaZero (20 block) 4 TPUs, single machine 5,018 Dec 2017 60:40 against AlphaGo Zero (20 block) ==Rivals== After the appearance of AlphaGo, several research groups have created computer Go programs with similar technical viewpoints. ===Darkforest=== This was made by Facebook. The source codes are available on GitHub. ===DeepZenGo=== This was made in Japan.Lee, C. S., Wang, M. H., Ko, L. W., Kubota, N., Lin, L. A., Kitaoka, S., ... & Su, S. F. (2018) Human and smart machine co-learning: brain-computer interaction at the 2017 IEEE International Conference on Systems, Man, and Cybernetics. IEEE Systems, Man, and Cybernetics Magazine, 4(2), 6-13.Wu, T. R., Wu, I. C., Chen, G. W., Wei, T. H., Wu, H. C., Lai, T. Y., & Lan, L. C. (2018). Multi-labeled value networks for computer Go. IEEE Transactions on Games, 10(4), 378-389. Nihon Ki-in was also involved in its research and development. == Related pages == *Demis Hassabis ==References== ==Other websites== * * AlphaGo wiki at Sensei's Library, including links to AlphaGo games * AlphaGo page, with archive and games * Estimated 2017 rating of Alpha Go Category:Software Category:Artificial intelligence Category:Google Category:Go (game)",
 "title": "AlphaGo"
}