{
 "id": "774083",
 "text": "Manchester United Women Football Club is a professional football club. It is located in the Salford suburb of Broughton, Greater Manchester, England. It is about 1.5 miles from Manchester city centre. It plays in the Women's Super League (WSL). This is the highest level of English women's football. United were promoted from the Championship at the end of the 2018–19 season. They train at Leigh Sports Village. However, the team will move to The Cliff when redevelopment work is done. ==History== ===1970s–2001: Unofficial team=== A team called Manchester United Supporters Club Ladies started playing in the late 1970s. It was unofficially known as the club's first women's team. They helped start the North West Women's Regional Football League in 1989. The team played better and better in the 90s at different levels of the FA Women's National League, until 2001. ===2001–2005: Partnership and disbandment=== In 2001, the team started an official partnership with Manchester United. However, the club finished mid-table in the third division for a few years. The team stopped playing four years later, in 2005. This was soon after Malcolm Glazer's bought the club. He did not believe the women's team was going to make him any money. A media spokesman for Manchester United also said that the club wanted to focus on its women's academy instead of its senior team. ===2018–present: Current team=== In March 2018, Manchester United announced they wanted to start a new women's football team. Manchester United Women Football Club started again on 28 May 2018. This was after the team asked to join the new 2018–19 FA Women's Championship. This was thirteen years after the club stopped playing in 2005. The club's academy had continued through the Manchester United Foundation. For example, Izzy Christiansen and Katie Zelem went through United's Centre of Excellence academy. Casey Stoney was the club's first head coach. She became coach on 8 June. They announced the first 21-player team about a month later. The team's first game back was on 19 August 2018. They won 1–0 in an away game against Liverpool in the FA Women's League Cup. Lizzie Arnot scored their first competitive goal in thirteen years. Three weeks later, they played their first Championship match. They won 12–0 against Aston Villa. On 17 April 2019, United won promotion to the FA Women's Super League after a 5–0 win against the same team. They won the FA Women's Championship title three days later. This was after a 7–0 win at home to Crystal Palace. In May 2019, Manchester United were named FA Women's Championship Club of the Year at the 2019 FA Women’s Football Awards. The 2019–20 season was the team's first FA WSL campaign. The season's first game was a Manchester derby. It was at the City of Manchester stadium. Manchester City won the match 1–0 in front of a league record attendance of 31,213. United's first division campaign ended early because of the COVID-19 pandemic. The team ended in fourth place on a points per game basis. They won their last game 3–2 against Everton on 23 February 2020. Leah Galton scored twice and Ella Toone scoring once for Manchester United. This was the first game at Everton's new Walton Hall Park stadium. In the FA Cup, Manchester United lost 3–2 to Manchester City in the fourth round. This was the first time they had lost in the first knockout round of a competition. However, they got to the semi-finals in the League Cup for the second time. They lost 1–0 to Chelsea. Chelsea also won in the final. ==Ground== When the club joined in the 2018–19 FA Women's Championship, they announced they would be located in Broughton, Salford at The Cliff training ground, when it was ready. Until then, United will play their games at Leigh Sports Village. Moss Lane is the venue when the Sports Village is not available. The club also sometimes play at Ewen Fields. United played an FA Cup fifth round match there against London Bees in February 2019. ==Players== ===Current squad=== ===Club captains=== Dates Captain 2018–2019 Alex Greenwood 2019–present Katie Zelem ==Reserves and academy== Manchester United had a girls academy up to under 16's level even when the senior team did not play between 2005 and 2018. This was because of FA rules. The club's partner charity is The Manchester United Foundation. Its work includes coaching girls at all ages across Greater Manchester. Before the 2019–20 season, Manchester United started a full-time U21 team. It played in the FA WSL Academy League for the first time. Charlotte Healy is the manager. The club's development team had played the WSL Academy Cup final against Arsenal the season before. They lost 5-0. ===Academy graduates=== The academy players below have also played in the senior team. Bold means the player is still at the club. * Ella Toone * Emily Ramsey * Fran Bentley * Katie Zelem * Kirsty Hanson * Rebecca May * Millie Turner * Naomi Hartley ==Coaching staff== ===First-team=== Position Staff Manager Casey Stoney Assistant manager Glen Harris Goalkeeping coach Ian Willcock Performance coach Elle Turner Strength & Conditioning Coach Tommy Munday Lead physiotherapist Kitty Forrest Physiotherapist Eva Gibson ===Academy=== Position Staff Under-21s manager Charlotte Healy ===Managerial statistics=== Information correct as of 23 February 2020. Only competitive matches are counted. List of Manchester United W.F.C. managers Image Name Nationality From To Honours Notes Present 1 FA Women's Championship title ==Honours== * FA Women's Championship ** Winners: 2018–19 ==Seasons== ===Key=== * QF = Quarter-finals * SF = Semi- finals Champions Runners-up Promoted Relegated ===Season summary=== Results of league and cup competitions by season Season Division FA Cup League Cup Name Goals League Top goalscorer 2018–19 20 18 1 1 98 7 55 18 2019–20 14 7 2 5 24 12 23 9 ==Records== ==Notes== ==References== ==Other websites== * *MU Women's News – Manchester United Official Website *MU Women's Videos – Manchester United Official Website Category:2010s establishments in England Category:2018 establishments in the United Kingdom Category:Women's football clubs in England Category:Football clubs in Greater Manchester",
 "title": "Manchester United W.F.C."
}