{
 "id": "77414",
 "text": "The Dominican city of San Francisco de Bánica, or simply Bánica, is a municipality of the Elías Piña province, on the border with Haiti and near the River Artibonite. ==Origin of name== The name Bánica comes from the Taíno name of the region, Banique (\"land of ebony trees\"). ==Population== The municipality had, in 2010, a total population of 2,112: 1,043 men and 1,069 women. The urban population was of the total population. ==History== The town was founded in 1504 by Diego Velázquez, who later went to conquest the island of Cuba, on the left side of the Artibonite river. It was an important town in those years but later it lost its importance. In the 18th century, the Spanish government moved the city to its present place, away from the river, and brought families from the Canary Islands to live there. When the Haitian independence, most of the people moved to other places. When the Haitians occupied the eastern part of the island (the present Dominican Republic), they founded again the town as part of the Artibonite department. After the Dominican Independence in 1844, the town was made a municipality of the Azua province. But again the town was abandoned by its inhabitants. After the \"Restoration War\" (1863 - 1865), some families from other towns near the Haitian border came to live in Bánica. Bánica was made a municipality of the San Juan province in 1938 and then, in 1942, of the new province of Elías Piña. ==Geography== Bánica is at to the west of Santo Domingo and to the northeast of Comendador. The limits of the municipality are the municipality of Pedro Santana to the north, the San Juan province to the east, the municipality of Comendador to the south and Haiti to the west. The average daily temperature in the city is 25.4 °C. ==Administrative division== The municipality of Bánica has two municipal districts; these are: Municipal districts of Bánica Code Municipal district Population (2010) Area (km2) Density 070202 Sabana Cruz 2,154 68.2 070203 Sabana Higüero 2,267 130.7 ==Economy== The main economic activity of the municipality is farming. Commerce with Haiti is also an important economic activity in the city. ==Places of interest== # Iglesia de San Francisco de Asís (Saint Francis of Assisi Church). It is a very interesting colonial Catholic church. It is not known when it was built but in 1740 the Bishop Domingo Pantaleón Álvarez Abréu wrote that in Bánica \"there is a new church\". # Reloj de sol (Sundial). In one of his faces there is a date, \"1795\", that could be the date when it was built. There were only two sundials in the old Spanish colony: one in Santo Domingo and another in Bánica. # Cerro de San Francisco (Saint Francis Hill). It is a rocky hill at from the city. Here there is a cave visited by many people to pray to Saint Francis; they get wet with water that falls from the top of the cave and they put limestone dust in their faces so when they get back to town they are identified by their white faces. The hill is protected by law because here there is the only wild population of Pereskia marcanoi, a cactus with leaves and beautiful small purple flowers; its common name is Rosa de Bánica (\"Bánica Rose\"). == References == Category:Settlements in the Dominican Republic Category:1504 establishments in the Spanish Empire",
 "title": "Bánica"
}