{
 "id": "774272",
 "text": "Chanie \"Charlie\" Wenjack (January 19, 1954 – October 23, 1966) was an Ojibwe boy who was famous for running away from a residential school. He died while trying to walk 600 km back home. After Wenjack's death, the Canadian government started to investigate residential schools. == Life == Chanie Wenjack was born at Ogoki Post on the Marten Falls Reserve. When Wenjack was 9, he and his two sisters were sent to the Cecilia Jeffrey Indian Residential School in Kenora, Ontario. He was known for being funny and for being the first one to understand jokes. On October 16, 1966, Wenjack ran away from the school with two friends, Ralph and Jackie MacDonald. They stayed with the MacDonalds' uncle, Charley Kelley, at Redditt, which is 31 km from Kenora. Wenjack decided to go back to Ogoki Post by following railroad tracks. == Death == Wenjack walked for 36 hours. He was wearing a windbreaker. The temperature was −6 °C. Bruises on Wenjack's body showed that he fell several times. A CN railway engineer found Wenjack's body on October 23 at 11:20AM and called the Ontario Provincial Police. The coroner determined the cause of death to be hunger and exposure. Wenjack was buried at the reserve on October 27, 1966. == Investigation == The Canadian government started an investigation into Wenjack's death. It concluded the investigation, saying that: == Legacy == Chanie Wenjack is a symbol of how students at these schools stood up to the abuses and suffering they experienced there. A lecture at Trent University was named after Wenjack after Indigenous students asked for a building to be named in his honor. == Pop culture == * In 2016, a video was made about Wenjack's life. His sister Pearl was featured in it. * The Canadian artist Gord Downie released an album with songs about Wenjack. * A story on Wenjack's live call the secret path about hs story. == References == Category:1954 births Category:1966 deaths Category:Native American people",
 "title": "Chanie Wenjack"
}