{
 "id": "774368",
 "text": "arXiv (pronounced \"archive\"—the X represents the Greek letter chi [χ]) is an open-access repository of scientific pre-prints.Pre-prints are scientific articles before being approved by peer review. Pre-prints which has been approved by peer-review are academic journals. All documents are stored as PDF. ==Importance== Generally, all scientific journals have peer-review procedures. This process sometimes take several years. The time lag made by this process will easily cause delay to the scientific community. arXiv was made to avoid this delay. ==Usage at Wikipedia etc.== Wikipedia and some journals accept citations by arXiv. Some academic search engines (such as Google Scholar) can help users to find arXiv pre-prints. ==Scientific areas== arXiv includes pre-prints from various scientific fields such as: * Computer science ** Artificial intelligence ** Machine learning * Mathematics ** Algebraic geometry ** Numerical analysis **Statistics * Physics ==Similar websites== Today, there are several arXiv-like websites in other areas. * bioRxiv: This is the biology version of arXivAbdill, R. J., & Blekhman, R. (2019). Meta-Research: Tracking the popularity and outcomes of all bioRxiv preprints. Elife, 8, e45133.Loew, L. M. (2016). Peer review and bioRxiv. Biophysical journal, 111(3), E01. *ChemRxiv: This is the chemistry version of arXivKidd, R., Koch, W., Milne, J., Sens, I., Tegen, S., Wilson, E., ... & Brennan, M. (2018). ChemRxiv: Year One and Beyond. ChemRxiv (2018). * EarthArXiv: Earth science & planetary science version of arXivJackson, C. (2018). EarthArXiv-A preprint server for the Earth and Planetary Sciences. EGUGA, 1429. * medRxiv: Medicine version of arXiv. It includes many pre-prints about COVID-19. * SocArXiv: Social science version of arXivCohen, P. (2016). Developing SocArXiv: a new open archive of the social sciences to challenge the outdated journal system. Impact of Social Sciences Blog. ==Further reading== * * * * * ==References and notes== == Other websites == * * - Unofficial bot * arXiv Vanity - converts the arXiv LaTeX sources to HTML. * ar5iv - an arXiv Lab converting the LaTeX sources to HTML. Category:1991 establishments in the United States Category:American science websites Category:Archives",
 "title": "ArXiv"
}