{
 "id": "774395",
 "text": "Michel Bernard Barnier (born 9 January 1951) is a conservative French politician who was the Prime Minister of France from September 2024 to December 2024. He was the European Commission's Head of Task Force for Relations with the United Kingdom (UK Task Force/UKTF) from 2019 to 2021. He was Chief Negotiator - Task Force for the Preparation and Conduct of the Negotiations with the United Kingdom from October 2016 to November 2019. ==Personal life== Michel Jean Barnier was born at La Tronche in the French Alps, into a Gaullist family in 1951. He graduated from the École Supérieure de Commerce de Paris (ESCP) in 1972. During his studies at the ESCP, he was a classmate of Jean-Pierre Raffarin, future prime minister.. ==Politcal career== In France, he was minister of foreign affairs from 2004 to 2005, minister of state for European affairs from 1995 to 1997 and minister of the environment and way of life from 1993 to 1995. Barnier unsuccessfully ran for President of France in the 2022 election. ==Prime Minister== On 5 September 2024, Barnier was appointed as Prime Minister by President Emmanuel Macron. At aged 73, he is the oldest person to become prime minister in the French Fifth Republic. His appointment was very controversial since he was seen as a conservative choice for a divided National Assembly. ===Removal=== On 2 December 2024, Barnier resorted to using Article 49.3 of the French Constitution to push through the 2025 budget without a vote. The left-wing New Popular Front had already declared its plans to file a motion of no confidence against the government. Marine Le Pen announced later that day her plan to file her own party's motion against the government. On 4 December, a majority of deputies voted to end Barnier's government, which became the first to lose a motion of no-confidence since Georges Pompidou's in 1962. ==References== ==Other websites== * Michel Barnier – Head of EU Commission Taskforce for Brexit * Personal Website at the European Commission (2010–2014) Category:1951 births Category:Living people Category:Brexit Category:European Commissioners Category:Government ministers of France Category:Recipients of the Order of the Legion of Honour Category:MEPs for France Category:People from Isère Category:Politicians from Auvergne-Rhône-Alpes Category:Prime ministers of France Category:Current national leaders",
 "title": "Michel Barnier"
}