{
 "id": "774692",
 "text": "Virginia Louise Giuffre (née Roberts; August 9, 1983 – April 25, 2025) was an American-Australian advocate of justice for victims of sex trafficking. She was one of the known victims of a sex trafficking operation by convicted sex offender Jeffrey Epstein. In 2015, she founded the nonprofit organization Victims Refuse Silence. == Early life == Virginia Giuffre was born Virginia Louise Roberts in on August 9, 1983 in Sacramento, California. When she was four years old, her family relocated to Loxahatchee in Palm Beach County, Florida. She reportedly came from a \"troubled home\". Giuffre told the Miami Herald that she went from being in \"an abusive situation, to being a runaway, to living in foster homes.\" She lived on the streets at age 13 before getting abused by a 65-year-old sex trafficker, Ron Eppinger, in Miami. Giuffre lived with Eppinger for approximately 6 months. He was raided by the FBI and later said guilty to charges of alien smuggling for prostitution, interstate travel for prostitution, and money laundering. ==Lawsuits and trials== *In May 2009 the courts got a civil lawsuit from Giuffre - against Jeffrey Epstein; The case was settled for $500,000 (); This sum became known to the general public in January 2022. *In September 2015, the courts got a civil lawsuit from Giuffre - against Ghislaine Maxwell; The case was settled under seal in June 2017 with Maxwell reportedly paying Giuffre \"millions\". *In 2021, the lower courts of the federal court system of the United States got a lawsuit - Virginia Giuffre v. Prince Andrew. The civil lawsuit (see civil law), says that Andrew had sex in 2001 with Virginia Giuffre when she was 17 years old; Prince Andrew \"has strongly denied any wrongdoing\", media said.https://www.bbc.com/news/uk-59987935. Retrieved 13 January 2022 The lawsuit is going on (as of 2022's first quarter). == Health issues and death == On March 31, 2025, in an Instagram post, Giuffre said that her car crashed with a bus traveling at , resulting in her going into renal failure. Giuffre said she had been given four days to live. Almost a month later on April 25, Giuffre died by suicide at her home in Neergabby, Western Australia. At the time of her death, she was divorcing her husband Robert Giuffre and demanding custody of her three children. == References == Category:2025 deaths Category:1983 births Category:American human rights activists Category:People from Sacramento, California Category:Suicides in Australia Category:Naturalised citizens of Australia Category:Australian human rights activists Category:People from Western Australia",
 "title": "Virginia Giuffre"
}