{
 "id": "77506",
 "text": "Les Six (pronounced \"Le sees\") is French for \"The Six\". Les Six were a group of six French composers who were friends around the year 1920. They were young at the time, and they shared a lot of ideas about music. The composer Erik Satie called them \"Les Nouveaux Jeunes\", but then a man called Henri Collet called them \"Les Six\" in an article he was writing, and that name was always used for them after that. In their music they tried to be different from Richard Wagner and other composers of Romantic music, and different from Debussy and Ravel who had been writing Impressionistic music. They also wanted to write in a simple way instead of using complicated rhythms such as those of Stravinsky or twelve tone music like Arnold Schoenberg. Many of their pieces were quite short. They liked strong, masculine music, especially jazz. The six composers did not stay together for very long as they soon developed their own personal styles in their compositions. == Members == * Georges Auric (1899–1983) wrote lots of rhythmic music which had lots of energy. He wrote music for movies. * Louis Durey (1888–1979) did not want to follow fashion. He used traditional ways of composing and wrote in his own, personal way. * Arthur Honegger (1892–1955) liked chamber music and the symphony. His popular piece Pacific 231 describes a train journey on the Canadian Pacific Railway. * Darius Milhaud (1892–1974) was a very talented composer who wrote in several different styles. Some of his music uses bitonality and polytonality (writing in two or more keys at the same time. His love of jazz can be heard in popular pieces like Le Boeuf sur le Toit which he called a cinema-symphony. * Francis Poulenc (1899–1963) was the most famous of the six composers. He continued to write in a style which was similar to the music of the 1920s. Many of his pieces are often performed today, e.g. Gloria, his ballet Les Biches, some of his chamber music and many songs. * Germaine Tailleferre (1892–1983) was the only female in the group. She liked to use dance rhythms. She was the only member of Les Six to earn diplomas from the Paris Conservatory. She loved children and animals and wrote many works about them. She also wrote operas, concertos, and many works for the piano. == After 1920 == It was really only in 1920 that all six composers were together. They had all been inspired by Jean Cocteau and Eric Satie. By 1921 Louis Durey had already left the group. Les Six continued to be associated with the style of French music from around the 1920s. They still remained friends, and used to visit a bar known as \"La Gaya\" which became Le Boeuf sur le Toit (The Ox on the Roof): the title of Milhaud's ballet. The group published an album of piano pieces together called \"Album des Six\". Five of the members worked together on the music for Cocteau's work Les Mariés de la Tour Eiffel The name \"The Six\" was a reference to the group of Russian composers who had been known as \"The Five\". Category:20th-century French composers",
 "title": "Les Six"
}