{
 "id": "775245",
 "text": "Rethel () is a commune in the Ardennes department in northern France. It is a sub-prefecture and third-most important city and economic center in the department. It is situated on the river Aisne, near the northern border of Champagne and 37 km from Reims. Its inhabitants are called Rethélois. == History of Rethel == According to legend, the city was founded by Julius Caesar, who established a camp on the site of the city during his campaigns. The parents of St. Arnulf of Metz were said to have given all they owned in villa Reistete (in the city of Rethel) to St. Remigius, bishop of Reims, so that their prayers for a child would be answered. The city belonged to the Abbey of Saint-Remi and was administered by its advocati. One of them, Manasses I, became the first Count of Rethel. In 1481 the county, with Rethel as its seat, became the Peerage of France; it became a duchy in 1581 and in 1663 it became the Duchy of Mazarin. During the Franco-Spanish War it was captured by Spanish forces under Louis de Bourbon, Prince of Condé on October 30, 1652 after a four-year siege, but was retaken by the French in July 1653. In 1814 Spanish prisoners of war from the Napoleonic Wars introduced typhus to the city. Jean-Baptiste Reberotte-Labesse cared for the soldiers who were ill. Cholera epidemics occurred in 1832 and 1849, while typhoid fever ravaged the city in 1839, with an average of thirty deaths a day. During World War II Rethel was the site of heavy combat from May to June 1940 during the Battle of France. French troops under Jean de Lattre de Tassigny repelled German assaults on the town for a month before it fell. == Population (historical and present) == == Famous people born here == Rethel was the birthplace of: * Jacques Boucher de Crèvecœur de Perthes (1788–1868), geologist and antiquary * Louis Christophe François Hachette (1800–1864), publisher. * Maurice Maillot (1906–1968), movie and theater actor. == References == Category:Communes in Ardennes Category:Subprefectures in France",
 "title": "Rethel"
}