{
 "id": "775400",
 "text": "The International Shooting Sport Federation (ISSF) is the governing body of the Olympic Shooting events in rifle, pistol and shotgun (clay target) disciplines, and of several non-Olympic Shooting sport events. ISSF's activities include regulation of the sport, Olympic qualifications and organization of international competitions such as the ISSF World Cup Series, the ISSF World Cup Finals, the ISSF Separate World Championship in Shotgun events and the ISSF World Championship in all events. Founded in 1907 as the International Shooting Union (), and then changing its name in 1998, the ISSF affiliates nowadays over 150 National Shooting Federations from Africa, Americas, Asia, Europe and Oceania. The ISSF Presidency is held by Mr. Vladimir Lisin, a Russian steel tycoon since the 30th of November 2018. Mr. Lisin was also President of the European Shooting Confederation until October 2021. The ISSF headquarters is in Munich, Germany. == Competitions and records == The ISSF recognizes the following competitions as ISSF Championships: * The Olympic Games every four years (Olympic events only) * The ISSF World Shooting Championships every four years, plus every other year for shotgun events * The ISSF World Cup four times a year plus a final (Olympic events only) * The ISSF Junior World Cup four times a year plus a final (Olympic events only) * Regional championships, such as the European Championships or the Pan-American Games, with regularity that is decided on the regional level These are the only competitions that have direct supervision from ISSF committees, and the only competitions where world records can be set. This leads to many national records in fact being higher than the world records. == Events == Number Events First Last 1 ISSF World Shooting Championships 1897 2018 (52nd) 2 ISSF World Cup 1986 2020 (35th) 3 ISSF Junior World Cup 2016 2019 (4th) 4 World University Shooting Championships 2003 2018 (7th) 5 World Military Shooting Championships 1957 2017 (50th) ==Related pages== * List of shooting sports organizations * ISSF World Shooting Championships == References == ==Other websites== * Official site * ISSF News - Official news service * ShootingWiki.org * 10.9 Generator Category:Sports governing bodies in Europe Category:Shooting sports organizations Category:Organisations based in Germany",
 "title": "International Shooting Sport Federation"
}