{
 "id": "775887",
 "text": "Odd Squad is an educational TV series. It started on TVOKids and PBS Kids on November 26, 2014. The series involves child characters using mathematics to go through each episode's plot. The series was made by Tim McKeon and Adam Peltzman and is produced by Fred Rogers Productions and Sinking Ship Entertainment in association with TVOKids. The series features child actors (whose characters are the employees of the \"Odd Squad\") who use indirect reasoning and basic math to solve and look into strange happenings in their town. == Educational value == The main topic being taught in Odd Squad is mathematics for children ages 5 to 8. Children are government agents who use math to solve an odd problem. Topics taught include: * Problem solving * Teamwork * Perseverance * Humor * Numbers and number sense * Geometry and spatial sense * Measurement * Data * Algebraic thinking Certain episodes may also teach a variety of other subjects. These include computer programming and coding, basic science, and geography. The series is well-known for teaching topics such as these in a manner children enjoy. == Seasons == === Seasons 1-2 === Two agents, Olive and Otto, are members of the Odd Squad Precinct 13579. The episode begins with the agents helping somebody with an odd problem. The agents then go back to headquarters by traveling through tubes. After being in headquarters the agents are called up to Oprah (Miss O)'s office. Olive and Otto are then told to fix an odd problem. Usually, the problem is caused by a villain. Another Odd Squad agent or a citizen may also be the cause of a problem. Olive and Otto may get help from the Mathroom when they cannot solve a problem by themselves. Agents Olympia and Otis were the new protagonists of season 2. The Mathroom was no longer used. Instead, the agents used watch tablets to solve math problems. The episode style mostly stayed the same. Many Odd Squad hour-long episodes and a movie were made during this season. === Season 3: Mobile Unit === Season 3 of Odd Squad was the first season not set in Precinct 13579. Instead, it focused on a Mobile Unit that flew around the world in a flying van to solve oddness. The season also taught more STEM (science, technology, engineering, and math) and geography, mostly simple science and \"math in the science.\" 33 total episodes in this season are split into two parts. ==== Season 3A ==== This season premiered with the hour-long special, \"Odd Beginnings.\" In the first 20 episodes, four agents, Opal, Orla, Omar, and Oswald, are called by the Big O and are told about an odd case and are sent to solve it. In most episodes, the agents split up into two groups of two to solve a case. Watch tablets were still used. Villains weren't usually the cause of the problems, however, an evil child character named \"The Shadow\" planned to team up with a group of villains to take over the Odd Squad Mobile Unit. ==== Season 3B ==== There are 13 episodes in Season 3B. In the twentieth episode of Season 3, Opal left the Mobile Unit to join her sister because she was no longer evil. In the next episode, \"Odd Off the Press,\" the Big O went to space to help the Odd Squad Space Unit and left the show after seven years. She sent the Little O to help the Mobile Unit. Opal was replaced by Agent Osmerelda, who was in many episodes as a normal child character. She did not join Odd Squad before this episode because she had too many other activities to do. === Season 4: UK === On October 4, 2023, Fred Rogers Productions announced that a fourth season of Odd Squad would premiere in 2024. It will be named \"Odd Squad UK.\" It was only filmed in the United Kingdom in Manchester, England. CBBC is also making Season 4 along with PBS Kids, TVOkids, and SRC. It will feature British characters. It will have 12 episodes. == Other productions and specials == === OddTube === OddTube is a series of short videos on PBS Kids. One agent talks about the setting of Odd Squad by interviewing agents and answering questions. There would be a sponsor which taught basic math, such as skip counting and geometry. There are two seasons. Season 1 aired in 2016 and 2017 during the second season of Odd Squad with Agent Olympia as the presenter. In 2020, during Season 3A of Odd Squad, Agent Orla was the presenter. === Odd Squad: Book of Games and Gadget Testers === Odd Squad: Book of Games and Gadget Testers are two series of short videos on PBS Kids with the Odd Squad Mobile Unit as main characters during season 3B of the show. Both series started and ended in 2022. The presenters of Book of Games were Agents Oswald and Osmerelda. The presenters of Gadget Testers were Agents Omar and Orla. === Odd Squad: The Movie === Odd Squad: The Movie is a 2016 Odd Squad television movie. The movie has agents from both seasons 1 and 2 and aired during Season 2. The movie is about Odd Squad getting shut down because of a team of adults called the Weird Team. The Weird Team is a group of adults who hide odd problems instead of fixing them. === Odd Squad: World Turned Odd === Odd Squad: World Turned Odd is a 2018 Odd Squad television movie that aired during Odd Squad Season 2. The movie is about Agents Olympia, Otis, and Oona. They go back in time to 1983 to visit Agent Oprah becoming Miss O but undo every Odd Squad case ever fixed. === Odds and Ends === Odds and Ends is the Season 2 finale of Odd Squad. The final two episodes, \"Who is Agent Otis?\" and \"Odds and Ends,\" can be put together to become one movie. It aired in 2019. === Odd Squad: Odd Beginnings === Odd Squad: Odd Beginnings the the newest Odd Squad television movie. It aired in 2020. The movie is about how the Odd Squad Mobile Unit started but it is not the season 3 premiere. === The Odd Squadcast === The Odd Squadcast is a seven-episode podcast series that released episodes during late 2020. The Big O (Millie Davis) was the main presenter. ==Cast== ===Main=== * Dalila Bela as Agent Olive (season 1) Olive is a short 12-year-old investigation agent who works at Precinct 13579. She is known for her seriousness at almost all times, except when she is solving a sports-related case. Her partner is Agent Otto. In the episode \"O is Not for Over,\" she is promoted to a management agent and runs her own precinct with her partner. * Filip Geljo as Agent Otto (season 1) Otto is a tall 10-year-old investigation agent who works at Precinct 13579. He is a fun-loving agent and loves music by his favorite band, Soundcheck. His partner is Agent Olive. In the episode \"O is Not for Over,\" he is promoted to a management agent and runs his own precinct with his partner. * Millie Davis as Oprah/Big O (seasons 1–3) Oprah plays the role of Ms. O in the first two seasons of the series and the Big O in the third season of the series. She is one of the only original cast members to stay in all three seasons of Odd Squad. She is another serious character who often yells at agents. Her age is unknown. It is assumed that she is thousands of years old. Millie Davis was 7 years old when the first season of the series began. She was 14 years old when she left the series and 15 when the third season ended. * Sean Michael Kyer as Agent Oscar (seasons 1–2) Oscar is the president of the Odd Squad scientists. He was 11 years in in the first season and 12 in the second season. He worked in Precinct 13579 running the science and gadgets department until the episode \"Oscar Strikes Back.\" He was the first Odd Squad scientist and created the department. * Anna Cathcart as Agent Olympia (season 2) Olympia is an energetic 11-year-old investigation agent who works at Precinct 13579. She is the main character in the second season of the series. She is also the host of the first season of OddTube. Her partner is Agent Otis. She is often very cheerful and silly. She loves pandas and working at Odd Squad. * Isaac Kragten as Agent Otis (season 2) Otis is an investigation agent who works at Precinct 13579. His partner is Agent Olympia. He is very talented and serious. His attitude is similar to Olive's. In \"Who is Agent Otis?\" he reveals he was raised by villain ducks. He is afraid of them because he is worried it is his duck family returning to get him. He is one of the only agents who wasn't trained at the Odd Squad academy. Instead, he was personally trained by Ms. O. * Valentina Herrera as Agent Opal (season 3) Opal is a mostly serious 10-year-old agent. She was the leader of the Odd Squad Mobile Unit (also called OSMU) during the first part of the third season of Odd Squad. Before joining the Mobile Unit, she used to work in the Arctic Precinct. She is proud to be a member of Odd Squad. Her partners were agents Omar, Orla, and Oswald. She leaves the Mobile Unit in \"End of the Road\" to fight oddness with her sister. * Jayce Alexander as Agent Omar (season 3) Omar is a chipper agent in the Odd Squad Mobile Unit. He loves to travel and collect souvenirs from his solved cases. He used to work with Opal as a partner before joining OSMU and during her time working at OSMU. His partners are Orla, Oswald, and Osmerelda. * Gavin Maclver-Wright as Agent Oswald (season 3) * Alyssa Hidalgo as Agent Orla (season 3) * Glee Dango as Agent Osmerelda (season 3) * Shazdeh Kapadia as Orpita/Little O (season 3) * Asha Soetan as Agent Orli (season 4) * Alexander Shaw as Agent Ozzie (season 4) * Samir Simon Keegan as Agent Onom (season 4) * Shelly Lagodinsky as Captain O (season 4) Character Actor Appearances Season 1 Season 2 Season 3 Specials 3A 3B Agent Olive Dalila Bela colspan=\"2\" Agent Otto Filip Geljo colspan=\"2\" Big O Millie Davis colspan=\"5\" Agent Oscar Sean Michael Kyer colspan=\"2\" Agent Olympia Anna Cathcart Agent Otis Isaac Kragten Agent Oona Olivia Presti Agent Opal Valentina Herrera colspan=\"2\" Agent Omar Jayce Alexander colspan=\"2\" colspan=\"2\" Agent Oswald Gavin Maclver-Wright colspan=\"2\" colspan=\"2\" Agent Orla Alyssa Hidalgo colspan=\"2\" colspan=\"2\" Agent Osmeralda Glee Dango colspan=\"2\" Little O Shazdeh Kapadia colspan=\"2\" ===Recurring=== ====Odd Squad Employees==== * Peyton Kennedy as Dr. O (seasons 1–2) * Jaeden J. Noel as Agent Obfusco (season 1) * Elijah Sandiford as Agent Ocean (season 2) * Julia Lalonde as Agent Octavia (season 1) * Madeleine Barbeau as Oksana (seasons 1–2) * Eshaan Buadwal as Agent Olaf (seasons 1–2) * Michela Luci as Agent Orchid (seasons 1–3) * Brendan Heard as Agent Oren (seasons 1–2) * Christian Distefano as Agent Owen (seasons 1–2) * Nashton Avila and Nathan Avila as Agent Orson (seasons 1–3) * Arista Arhin as Agent Ozlyn (season 2) * Sasha Steiner as Agent Olly (season 2) * Leonidas Castrounis as Agent Xavier (season 2) * Sheena Darnley as Agent Xena (season 2) * Alexander Joseph as Agent Orwell (season 4) * Halle Brady as Agent Opie (season 4) * Zach Bent as Agent Osgood (season 4) ====Villains==== * Jaiden Cannatelli as Agent Ohlm (seasons 1–2) * Martin Roach as Fladam (seasons 1–2) * David Tompa as Noisemaker (seasons 1–2) * Joshua Kilimnik as Odd Todd (seasons 1–2) * Stacey McGunnigle as the Puppetmaster (season 1) * Lauren Landauer as the Shapeshifter (seasons 1–2) * Danielle Benton as Tiny Dancer (seasons 1–2) * Farid Yazdani as Freeze Ray Ray (season 2) ====Others==== * Ashley Botting as Delivery Debbie (seasons 1–2) * Ava Preston as Polly Graph (season 1) ==Broadcast== In the US, the show premiered on PBS Kids on November 26, 2014 and on TVOKids and their sister channel ICI Radio-Canada Tele. On June 22, 2015, the show was about to air on CITV, but instead it aired on CBBC for some reason. Odd Squad was filmed throughout Toronto, Ontario. Season 3 was filmed in Cambridge, Ontario instead of Toronto, Ontario. A fourth season of Odd Squad UK will be released on CBBC in late 2024. Instead of Sinking Ship Entertainment, it will be associated with BBC Kids and Family Disturbion. ==References== ==Other websites== * * PBS Kids Home Page * Odd Squad on TVO Kids * Organisation Super Insolite on Ici Radio-Canada Télé * Critique de la série ODD SQUAD on TJ Kingdom Category:2014 American television series debuts Category:2014 Canadian television series debuts Category:PBS Kids shows Category:2010s American children's television series Category:2010s Canadian children's television series Category:2020s American children's television series Category:2020s Canadian children's television series Category:2020s British children's television series Category:CBBC shows",
 "title": "Odd Squad"
}