{
 "id": "77591",
 "text": "The Ruhr Area () is an urban area in North Rhine-Westphalia, Germany. Many of the cities in the Ruhrgebiet used to have a lot of heavy industry. The Ruhr Area is bordered by the rivers Ruhr River to the south, Rhine River to the west, and Lippe to the north. Southwest it borders the Bergisches Land. The area has about 5.3 million inhabitants, and is part of the larger Rhine-Ruhr metropolitan area of more than 12 million people. The Ruhr Area consists of the cities of Duisburg, Oberhausen, Bottrop, Mülheim an der Ruhr, Essen, Gelsenkirchen, Bochum, Herne, Hamm, Hagen and Dortmund and the rural districts of Wesel, Recklinghausen, Unna and Ennepe-Ruhr ==Culture== The city of Essen in the Ruhr area was selected as European Capital of Culture for 2010 by the Council of the European Union. ==Sources== ==References== * *Bishop, Patrick. Bomber Boys Fighting Back 1940–1945 * French Directorate for Economic Affairs, Memorandum on the separation of the German industrial regions , 8 September 1945. *Gareau, Frederick H. \"Morgenthau's Plan for Industrial Disarmament in Germany\", Western Political Quarterly, Vol. 14, No. 2 (Jun., 1961), pp. 517–53 in JSTOR *Yoder, Amos. \"The Ruhr Authority and the German Problem\", Review of Politics, Vol. 17, No. 3 (Jul., 1955), pp. 345–358 in JSTOR ==Further reading== * Kift, Roy, The Complete Ruhrgebiet: The English language guide (2018) () Klartext Verlag, Essen * Berndt, Christian. Corporate Germany Between Globalization and Regional Place Dependence: Business Restructuring in the Ruhr Area (2001) * Crew, David. Town in the Ruhr: A Social History of Bochum, 1860–1914 (1979) () * Fischer, Conan. The Ruhr Crisis, 1923–1924 (2003) * Gillingham, John. \"Ruhr Coal Miners and Hitler's War\", Journal of Social History Vol. 15, No. 4 (Summer, 1982), pp. 637–653 in JSTOR * Chauncy D. Harris, \"The Ruhr Coal-mining District\", Geographical Review, 36 (1946), 194–221. * Gillingham, John. Industry and Politics in the Third Reich: Ruhr Coal, Hitler, and Europe (1985) () * Pounds, Norman J. G. The Ruhr: A Study in Historical and Economic Geography (1952) online * Pierenkemper, Toni. \"Entrepreneurs in Heavy Industry: Upper Silesia and the Westphalian Ruhr Region, 1852 to 1913\", Business History Review Vol. 53, No. 1 (Spring, 1979), pp. 65–78 in JSTOR * Royal Jae Schmidt. Versailles and the Ruhr: Seedbed of World War II (1968) * Spencer, Elaine Glovka. \"Employer Response to Unionism: Ruhr Coal Industrialists before 1914\" Journal of Modern History Vol. 48, No. 3 (Sep., 1976), pp. 397–412 in JSTOR * Spencer, Elaine Glovka. Management and Labor in Imperial Germany: Ruhr Industrialists as Employers, 1896–1914. Rutgers University Press. (1984) online * Todd, Edmund N. \"Industry, State, and Electrical Technology in the Ruhr Circa 1900\", Osiris 2nd Series, Vol. 5, (1989), pp. 242–259 in JSTOR == Other websites == * Capital of Culture 2010 Official Site * ruhr.2010 Capital of Culture Blog * Ruhrgebietsbilder: Photos about the Ruhr Category:Geography of North Rhine-Westphalia Category:Regions of Germany",
 "title": "Ruhr Area"
}