{
 "id": "776063",
 "text": "is a Japanese professional shogi player ranked 6-dan. She won 40 women's titles in her career. She also has several lifetime titles. ==Records== The following tables are the summary of her achievements.Kana Satomi official profileKana Satomi at ShogiHub *Names in this table are her opponents. Pink means that Satomi has defended or obtained title. Deep pink means that she obtained a lifetime title. o : Satomi's win x : Satomi's lose *Shogi Awards - WMVP : Women player MVP (最優秀女流棋士賞), WPA : Women player award (女流棋士賞), SANG : Special award for notable games (名局賞特別賞), AWNG : Award for women's notable games (女流名局賞) Year Titles Other titles Shogi Awards Notes Year 女王(Queen) April-May Other titles Shogi Awards Notes 女流王位 (Women Monarch) April-June 清麗 (Seirei) August-September 女流王将(Women King) October 倉敷藤花 (Kurashiki Toka Cup) November 女流王座 (Women Throne) October-December 女流名人 (Women Grand Master) January-February 2004 － Season 15 － Season 26 Season 12 － Season 31 Obtained professional status 2005 － － － 2006 － － － WPA 2007 － － － 2008 1st season － Ichiyo Shimizu oo － WPA 2009 － Marika Nakamura oo － Ichiyo Shimizu ooo WMVP Obtained 2 women titles in the same year (女流二冠) 2010 － Ichiyo Shimizu xoo Shinobu Iwane xoo － Ichiyo Shimizu ooo WMVP Youngest player to obtain 3 women titles in the same year (女流三冠) 2011 － Sachio Ishibashi oo Ichiyo Shimizu oo 1st season Ichiyo Shimizu xooo WMVP 2012 Tomomi Kai ooo － Marika Nakamura xoo Rieko Yauchi oo Hatsumi Ueda oxoxo WMVP SANG Youngest player to obtain 4 women titles in the same year (女流四冠) Obtained lifetime title for Kurashiki Toka Cup 2013 Hatsumi Ueda ooo Tomomi Kai oxoxx － Manao Kagawa xox Tomomi Kai oxx Momoko Kato xooo Marika Nakamura ooo WMVP First player to obtain 5 women titles in the same year (女流五冠) Obtained lifetime title for Women Grand Master 2014 Momoko Kato xoxx － Disqualified Ichiyo Shimizu ooo April-December:Sabbatical 2015 Tomomi Kai ooo － Manao Kagawa oo Tomomi Kai oo Ichiyo Shimizu xooxo WMVP Consecutive victory record at women title matches（21 wins） 2016 Shinobu Iwane ooo － Manao Kagawa oo Yuki Muroya xoo Momoko Kato ooo Hatsumi Ueda xxooo WMVP SANG Obtained lifetime title 2017 Sae Ito oxoxo － Sae Ito oo Sae Ito oo Momoko Kato xxooo Sae Ito ooo WMVP 2018 Ai Watabe xoxx － Momoko Kato oo Yuki Taniguchi oo Ichiyo Shimizu ooo Sae Ito ooxo WMVP AWNG 2019 Tomoka Nishiyama xxox Ai Watabe oxoo (1st season) Tomomi Kai ooo Tomoka Nishiyama xox Sae Ito oxo Tomoka Nishiyama xoxx Yuki Taniguchi ooo WMVP AWNG Obtained lifetime title for the Women's Monarch First player to obtain 6 women titles in the same year (女流六冠) Consecutive victory record at the Women Grand Master title. 2020 Momoko Kato ooo Hatsumi Ueda 年度 女王 (Queen) April-May 女流王位 (Women Monarch) April-June 清麗 (Seirei) August-September 女流王将 (Women King) October 倉敷藤花 (Kurashiki Toka Cup) November 女流王座 (Women Throne) October-December 女流名人 (Women Grand Master) 1-2月January-February Other titles Shogi Awards Notes Total 3 times as finalist Obtained once 8 times as finalist Obtained 6 times 2 times as finalist Obtained once 9 times as finalist Obtained 7 times 11 times as finalist Obtained 10 times 5 times as finalist Obtained 4 times 11 times as finalist Obtained 11 times Total 49 appearances to the final match. Obtained 40 titles（Only few players have achieved this record） Title Obtained years Finalist Victory Consecutive victories Lifetime title Seirei (清麗) August- September 2019 (1st season) 1 1 Queen (女王) April-May 2013 (6th Season) 3 times 1 － Women Throne (女流王座) October-December 2013 (3rd season), '16-'18 5 times 4 times (Japan record) 3 (Japan record) Women Grand Master (女流名人) January-February 2009（Season 36）-'19 11 times 11 times (Japan record) 11 (Japan record) Obtained Women Monarch (女流王位) April-June 2012 (Season 23), '15-'17 , '19-'20 8 times 6 times 3 Obtained Women King (女流王将) October 2010 (Season 32)-'12, '15-'18 9 times 7 times 4 Obtained Kurashiki Toka Cup (倉敷藤花) November 2008 (Season 16)-'12, '15-'19 11 times 10 times (Japan record) 5 Obtained 49 appearances to the final match. Obtained 40 titles（Only few players have achieved this record） ==Public awards== She has received several awards from the local government. * 2007, March: Shimane Prefecture Cultural Activity Award (島根県文化活動特別奨励賞) * 2020, March: Shimane Prefecture Meritorious Person Award女流棋士里見さんに県民栄誉賞 島根県、初の六冠達成 (島根県民栄誉賞) ==References== ==Other websites== *Satomi wins Kurashiki Touka tournament *Satomi defends Ouza title category:1992 births category:Living people Category:Shogi players category:Sportswomen Category:Sportspeople from Shimane Prefecture",
 "title": "Kana Satomi"
}