{
 "id": "776188",
 "text": "Jung Ho-seok (; born February 18, 1994), better known by his stage name J-hope, is a South Korean rapper, dancer and singer-songwriter. In 2013, J-Hope made his debut as a member of the South Korean band BTS, managed under Big Hit Entertainment. J-Hope released his first solo mixtape, Hope World, March 1, 2018. A lot of people liked the album. His debut at number 63 (and subsequent peak at number 38) made him the highest charting solo Korean artist on the Billboard 200 at the time of the mixtape's release. In September 27, 2019, he released his song \"Chicken Noodle Soup\" featuring Becky G. J-Hope released his first studio album, Jack In The Box, July 15, 2022, and the most biggest album on iTunes. == Life and career == === 1994–2012: Early life === === 2013–present: BTS === === 2018–present: Solo activities and first mixtape === J-Hope makes music on the side while performing with the rest of BTS. == Name == His stage name, \"J-Hope (제이홉)\" (transliteration: Jeihop), comes from his desire to represent hope for fans, as well as to be \"the hope of BTS\". It is also a reference to the Greek myth of Pandora's box, as after the box was opened and all the evils inside were released to the world, the only thing left at the bottom was hope. == Personal life == J-Hope currently lives in Seoul with the other members of BTS. === Charity === On February 18, 2019, J-Hope donated 100 million Korean won (US$89,000) to Child Fund Korea, in support of those attending his high school alma mater in Gwangju. He had previously donated 150 million won (about US$133,000) to the same organization in December 2018, but requested the donation be private at the time. == Songs == === Mixtapes=== Title Album details Peak chart positions Sales AUS CAN FRA JPN NLD NOR NZ SWE US US World Hope World * Released: March 1, 2018 (Worldwide) March 2, 2018 (South Korea) * Label: Big Hit * Format: Digital download, streaming 13 35 160 13 34 14 23 30 38 1 * US: 21,000 == References == Category:1994 births Category:BTS members Category:Hybe Corporation artists Category:K-pop singers Category:Living people Category:South Korean record producers Category:South Korean rappers Category:South Korean singer- songwriters",
 "title": "J-Hope"
}