{
 "id": "77612",
 "text": "The Lebanese Civil War (April 1975 – October 1990) was a conflict that was significantly worsened by Lebanon's changing demographics. Fighting was between the Islamic movements Sunnis and Shias, as well as Christians and Muslims. Involvement from external actors, such as Syria, Israel, and the Palestine Liberation Organization (PLO), worsened and made the existing conflict more complicated, with the additional impact of the Palestinian- Israeli tensions slowly intertwining with the Lebanese Civil War. This was triggered by about 300,000 Palestinian individuals living in refugee camps at the Lebanese border. After a short break in the fighting in 1976 due to Arab League mediation and Syrian intervention, fighting continued in South Lebanon, first occupied by the PLO and after that by Israel. Violent events increased from the end of the 1960s and the first half of 1970s. Several armed movements were created, with different political views. The Lebanese National Movement, led by Kamal Jumblatt, wanted to end the religious class society system. Sunni and Shi'i struggled for more representation and supported the Palestinian refugees. Many Palestinians joined the struggles. == Timeline == The civil war started on the 13th of April, 1975, after one of these attacks, committed by the Phalanges,https://www.cia.gov/readingroom/docs/CIA- RDP06T00412R000200240001-2.pdf a Maronite faction, against a Palestinian bus.https://apps.dtic.mil/sti/pdfs/ADB040213.pdf This event was known as the Sidon bus massacre. Fights spread on that day. The government was unable to control the militias and violence spread extremely quickly. The war lasted over 15 years and members of both Christian and Muslim militias repeatedly switched their loyalty among groups. The civil war is characterized as an intrasectarian war, rather than a religious one. During the first two years of war, several massacres were committed: the massacre of Tel al-Za'atar (1976) by the Syrian and Lebanese Phalanges forces against Palestinians and the massacre of Damour (1976) by the Palestine Liberation Organization against Christians. Civilian fighting lasted for a year until other countries joined in the fight. In 1976, Syria joined the conflict, and so the Lebanese civil war started to impact all the Middle-east region. Israel joined the conflict in 1976, because of the assassination attempt against the Israeli ambassador, Shlomo Argov. The Israeli army invaded the south of Lebanon and reached Sidon. According to the claims of the invaders and the leaders representing them, the intention of the invasion was to safeguard Israeli citizens and to generally diminish the threat of international terrorism. This would mean a siege of West Sidon and destruction of the PLO as well as the surrounding area. At this time, Syrian forces also began occupying areas of Lebanon. On May 17, 1977, a US-backed agreement was reached for making peace between Lebanon and Israel. The agreement failed when Syria refused to withdraw its forces. == Casualties and consequences == About 120,000 people were killed during the war and almost one million people moved out of Lebanon. Daniel Byman and Kenneth Michael Pollack. \"Things Fall Apart: Containing the Spillover from an Iraqi Civil War.\" p. 139 The Lebanese Civil War had terrible results for the Lebanese people, society and economy as well as the Middle East in general.Chamie, Joseph. (1976). The lebanese civil war: an investigation into the causes. World Affairs, 139(3), 171-188. (p.171) == References == Category:1982 in Asia Category:Wars involving Syria Category:1970s in Israel Category:20th century in Syria",
 "title": "Lebanese Civil War"
}