{
 "id": "776438",
 "text": "Ichiyo Shimizu (清水市代, Shimizu Ichiyo, born January 9, 1969) is a Japanese women's professional shogi player ranked 7-dan.She is the first female player to obtain this rank She became the first women's professional to be promoted to the rank of women's 6-dan and obtain 40 women titles.Official JSA Profile She is also the second women's professional to win 600 official games. ==JSA director== In May 2017, Shimizu became the first women to be elected as an executive director to the Japan Shogi Association's (JSA) board of directors. She was re-elected to a second two-year term in June 2019. ==Honors== Shimizu has received several awards in recognition of her accomplishments in shogi and contributions to the Japanese society. * 1996, June: Minister of Education Award * 1997, February: Tokyo Resident Culture Honor Award (Awarded by the Governor of Tokyo in recognition of cultural achievements) * 2000, November: Higashimurayama,City in western Tokyo Tokyo Resident Honor Award * 2008, August: Kurashiki Shogi Culture Honor Award * 2009: 25 Years Service Award (Awarded by the JSA in recognition of being an active professional for twenty- five years) ==Title match records== The following tables are the summary of her achievements. *Names in this table are her opponents. Pink means that she has defended or obtained title. Deep pink means that she obtained a lifetime title. o: win x: lose s: game suspended *Shogi Awards - WMVP : Women player MVP (最優秀女流棋士賞), WPA : Women player award (女流棋士賞), SP: Special Award, WPPMG: Women Player who Played More Games than others Year Titles Other Titles Shogi Award Notes 女王 (Queen) 女流王将 (Women King) 女流王位 (Women Monarch) 清麗 (Seirei) 女流王座 (Women Throne) 倉敷藤花 (Kurashiki Toka Cup) 女流名人 (Women Grand Master) 1985 － (Season 8) － － － － (Season 12) Professional player debut 1986 － － － － － 1987 － － － － － Hiroe Nakai ooo LOTLadies Open Tournament ★WPA 1988 － － － － － Hiroe Nakai xooxx 1989 － － － － － Hiroe Nakai ooo 1990 － (Season 1) － － － Naoko Hayashiba xxox 1991 － Naoko Hayashiba oxo － － － LOT ★WPA 1992 － ↓ － － － Hiroe Nakai xxx LOT 1993 － Naoko Hayashiba oo Hiroe Nakai oxoo － － LOT ★WPA 1994 － Haruko Saida xx Hiroe Nakai ooo － － Naoko Hayashiba oo Hiroe Nakai ooo ★WPA 1995 － Rieko Yauchi ooo － － Haruko Saida oxo Hiroe Nakai ooo ★WPA Promoted to 5 dan Year 女王 (Queen) 女流王将 (Women King) 女流王位 (Women Monarch) 清麗 (Seirei) 女流王座 (Women Throne) 倉敷藤花 (Kurashiki Toka Cup) 女流名人 (Women Grand Master) Other Titles Shogi Award Notes 1996 － (Season 18) Hiroe Nakai oxxoo Dominated 4 titles Sachio Ishibashi ooxo Maintained 4 titles － － Sayuri Kimura oo Maintained 4 titles Hiroe Nakai xoxoo Maintained 4 titles ★WPA SP Dominated 4 titles Obtained lifetime title 1997 － Haruko Saida oxoxx Rieko Yauchi oxxox － － Hiroe Nakai oxo Hiroe Nakai ooo LOT Kajima Cup ★WPA 1998 － Haruko Saida ooo Rieko Yauchi xooo Dominated 4 titles － － Ryoko Chiba oxo Maintained 4 titles Ryoko Chiba ooxo Maintained 4 titles ★WPA Dominated 4 titles Obtained 2 lifetime titles in this year 1999 － Sachio Ishibashi ooxxx Ryoko Chiba ooxo － － Rieko Yauchi oo Hiroe Nakai xxx Kajima Cup 2000 － Sachio Ishibashi oxoo Ryoko Chiba ooo － － Rieko Yauchi oo LOT ★WMVP 4th lifetime title Promoted to 6-dan (1st female player to obtain this rank) 2001 － Rieko Yauchi xooo Hiroe Nakai xxooo － － Hiroe Nakai xox WPA 2002 － Hiroe Nakai xxx Sachio Ishibashi ooo － 2003 － Hiroe Nakai xooo － － Hiroe Nakai oxoo LOT ★WMVP 2004 － Rieko Yauchi ooo － － Hiroe Nakai oxo Ryoko Chiba oxoo Kajima Cup ★WMVP 2005 － Hiroe Nakai oxoo － － Rieko Yauchi oo Rieko Yauchi xxx 2006 － Sachio Ishibashi ooxo － － Haruko Saida xox 2007 － Ryoko Chiba xooo Sachio Ishibashi xoxox － － Haruko Saida xoo ★WMVP 2008 (Season 1) Rieko Yauchi ooxo Sachio Ishibashi xxoox － － Kana Satomi xx Rieko Yauchi xooxo ★WMVP 2009 Hatsumi Ueda oo Sachio Ishibashi xooxo － － Kana Satomi xxx WPA 2010 Kana Satomi oxx Tomomi Kai xxox － － Kana Satomi xxx WPPMG (30 Games) 2011 Tomomi Kai xxoox － (Season 1) Momoko Kato xoxox Kana Satomi xx Kana Satomi oxxx Daiwa Securities Cup WPA WPPMG (55 games) Annual winning record (40wins) 2012 － 2013 － 2014 Manao Kagawa oxx Tomomi Kai soxxx － Kana Satomi xxx WPPMG (37 Games) 2015 － Kana Satomi oxxox 2016 － 2017 － 2018 － Kana Satomi xxx Oldest finalist (challenger to the defending champion) in women titles 2019 (Season 1) Year 女王 (Queen) 女流王将 (Women King) 女流王位 (Women Monarch) 清麗 (Seirei) 女流王座 (Women Throne) 倉敷藤花 (Kurashiki Toka Cup) 女流名人 (Women Grand Master) Other Titles Shogi Award Notes Total － 15 times as finalist Obtained 9 times 20 times as finalist Obtained 14 times － 2 times as finalist 14 times as finalist Obtained 10 times 20 times as finalist Obtained 10 times 11 times 71 times as finalist, obtained title for 43 times (Japan record) Title Years Number of times overall 女流名人 (Women Grand Master) 1987, 1989, 199498, 200304, 2008 10 女流王将 (Women King) 1991, 1993, 1996, 1998, 200001, 200709 9 女流王位 (Women Monarch) 199396, 19982006, 2009 14 (Japan record) Kurashiki Tōka Cup 19942000, 200405, 2007 10 (Japan record) ==References and notes== category:1969 births Category:Shogi players category:Sportswomen Category:Sportspeople from Tokyo category:Living people",
 "title": "Ichiyo Shimizu"
}