{
 "id": "77640",
 "text": "Pangaeameaning entire Earth in Ancient Greek was the global supercontinent which formed in the Palaeozoic era. The process started about 450 million years ago (mya) and was complete by 210 mya. So, apart from some volcanic islands (not proven, but very likely), all the land areas were collected together in one big supercontinent. Pangaea was the latest of a series of global supercontinents. They formed at various times since plate tectonics began on Earth. Panthalassa was the name of the huge global ocean which surrounded Pangaea. == Formation == The collisions between continental plates formed the greatest mountain ranges in the history of the Phanerozoic eon.Cocks L.R.M. & Torsvik T.H. 2006. European geography in a global context from the Vendian to the end of the Palaeozoic in: Gee D.G. & Stephenson R.A. (eds) European lithosphere dynamics, Geological Society of London Memoirs 32, pp. 83–95. The mountain building included the Caledonian orogeny, the Alleghenian orogeny and the Variscan orogeny. The low mountains of Scotland, Scandinavia and eastern North America are the ground-down remains of these vast events.Stanley, Steven 1998. Earth system history. pp355–359 == Break-up == There were three major phases in the break-up of Pangaea. The first signs of rifting came in the Triassic before Pangaea was completely formed.Van Andel T.J. 1994. New views on an old planet: a history of global change. 2nd ed, Cambridge University Press, p138/9. Pangaea broke up about 180/200 million years ago, in the early middle Jurassic. It broke into supercontinents Laurasia and Gondwana before each of these broke into the present continents. One rift resulted in a new ocean, the North Atlantic Ocean.Zeeya Merali, Brian J. Skinner Visualizing Earth Science. Wiley. The second major phase in the break-up of Pangaea began in the Lower Cretaceous (150–140 mya), when Gondwana separated into continents (Africa, South America, India, Antarctica, and Australia). The third major and final phase of the break-up of Pangaea occurred in the early Cenozoic (Paleocene to Oligocene). Laurasia split when North America (Laurentia) broke free from Eurasia, opening the Norwegian Sea about 60–55 mya. The Atlantic and Indian Oceans continued to expand, closing the Tethys Ocean. The break-up of Pangaea continues today in the Great Rift Valley in East Africa and Arabia. == Other sources == *Matte P. 2001. The Variscan collage and orogeny (480-290 mya) and the tectonic definition of the Armorica microplate: a review. Terra Nova 13, 122-128. *Stampfli G.M; Raumer J.F. von & Borel G.D. 2002. Paleozoic evolution of pre-Variscan terranes: from Gondwana to the Variscan collision. Geological Society of America Special Paper 364, pp. 263–280. *Torsvik T.H. et al 1996. Continental break-up and collision in the Neoproterozoic and Palaeozoic - a tale of Baltica and Laurentia. Earth-Science Reviews 40, pp. 229–258. *Ziegler P.A. 1990. Geological atlas of western and central Europe. 2nd ed, Shell Internationale Petroleum Maatschappij B.V. == References == Category:Supercontinents",
 "title": "Pangaea"
}