{
 "id": "7765",
 "text": "Jehovah's Witnesses is a religious group with more than eight million members around the world. They believe that God (who they call Jehovah) will end crime, violence, sickness and death by destroying all badness in the world. They say God's kingdom will restore God's original purpose for the earth: to bring about peace for all humans who live by the Bible's standards. Some of their beliefs are very different than most other Christian churches'. This is especially true with beliefs about who God is, and what his plans are for humans and the earth. Jehovah's Witnesses believe that only 144,000 people will go to heaven, and that all the other people who obey God will live forever in paradise on earth. They do not believe that God is a Trinity. They believe Jesus died on a single pole rather than a cross. They do not use images or symbols such as the cross. They teach that when people die, they remain in the grave until God resurrects them when God's kingdom rules over earth. Jehovah's Witnesses are best known for preaching from door-to-door and in other public places, and offering their magazines, The Watchtower and Awake! They are also well known for refusing to join armies and refusing blood transfusions. == History == In 1870 a preacher and clothing store owner, Charles Taze Russell, heard an Adventist preacher speak. The preacher said the Bible contained clues that showed God was about to set up a kingdom over earth. He said the kingdom, which is mentioned in the New Testament of the Bible, would be based in heaven. It would completely change the way of life for everyone in the world, he claimed. Russell studied that preacher's teachings and looked through the Bible, and he ended up with some new beliefs. Russell started a Bible study group in Pennsylvania in 1876, which became known as the Bible Students. They started a religious magazine called The Watchtower. After Russell died, Joseph Franklin Rutherford took over. The Bible Students who stayed with him took the name Jehovah's Witnesses in 1931. === Beginnings === Based on various Bible verses and events from history, Russell decided that God would soon call a group of \"saints\" to heaven to be kings there. He thought there would be a total of 144,000 kings in heaven: the saints God called there, and other faithful Christians who had since died. Churches at the time taught that humans were still waiting for Jesus to return to earth in his Second Coming. However, Russell believed that Jesus had returned in 1874.\"A sketch of the development of present truth\", Zion's Watch Tower, July 15, 1906. He thought that God would start Armageddon in 1914. First all law and order on earth would break down. Then people and governments would fight with each other. He believed that God would then end sickness and death and allow obedient Christians to live forever in perfect health. Russell believed it was very important for all Christians to learn these \"truths,\" including Christians who were attending churches. He believed these \"truths\" had been hidden in the Bible for thousands of years. Russell started a publishing company called the Watch Tower Bible and Tract Society of Pennsylvania.Historical Dictionary of Jehovah's Witnesses by George D. Chryssides, Scarecrow Press, 2008, page xxxiv, \"Russell wanted to consolidate the movement he had started. ...In 1880, Bible House, a four-story building in Allegheny, was completed, with printing facilities and meeting accommodation, and it became the organization's headquarters. The next stage of institutionalization was legal incorporation. In 1884, Russell formed the Zion's Watch Tower Tract Society, which was incorporated in Pennsylvania... Russell was concerned that his supporters should feel part of a unified movement.\"Religion in the Twentieth Century by Vergilius Ture Anselm Ferm, Philosophical Library, 1948, page 383, \"As the [unincorporated Watch Tower] Society expanded, it became necessary to incorporate it and build a more definite organization. In 1884, a charter was granted recognizing the Society as a religious, non-profit corporation.\" He wrote several books, set up Bible study classes for people to study his teachings, and started a magazine, Zion's Watch Tower and Herald of Christ's Presence, which taught that Christ was already present. === A new president === By the time Russell died in 1916, he had written 50,000 pages, and almost 20 million copies of his books had been printed and distributed around the world. Joseph Franklin Rutherford, one of his followers, took Russell's position as president of the Watch Tower Society. Rutherford also wrote many books, and he made some changes to Russell's teachings. He required all of the congregations (study groups) around the world to agree to these teachings, and to obey the rules set by the Watch Tower Society in New York. He told members that: * They should not celebrate holidays, including birthdays * They should not sing at religious meetings * They should preach from door to door about God's kingdom * They should sell Watch Tower Society publications so more people would hear the message Many members did not agree with Rutherford's strict changes, and some started their own groups. In 1931 Rutherford called his group \"Jehovah's Witnesses\". By the time Rutherford died in 1942, the religion had a worldwide membership of 115,000. === Punishment and discrimination === Some of the new teachings resulted in suffering for many Jehovah's Witnesses. Thousands were sent to prison, beaten or killed in countries during World War II because they refused to fight. In Germany, many were sent to concentration camps because they would not support the Nazi Party. Later, in the United States, many of their children were expelled from schools because they refused to salute the flag. Some countries still have laws against members practicing the religion. By 1977 the religion had more than two million members around the world. === Armageddon expected in 1975 === From 1966, Jehovah's Witnesses suggested that God could bring Armageddon in 1975, and that the kingdom would be set up very soon after.See \"Witnessing the End\" in the July 18, 1969 Time magazine. In the article it states,\"Witnesses cautiously avoid a flat prediction linked to that year.\" Available online at: . Retrieved March 20,2017. Some Witnesses sold their businesses and homes, gave up their jobs, delayed medical operations and decided against starting families because they expected Armageddon to arrive. After Armageddon did not arrive as expected, many members left. Still, many others joined, and the group kept growing. == Beliefs == === One God === Like Jews, Muslims, and other Christians, Jehovah's Witnesses believe there is an all-powerful, all-knowing God who created everything. They also have some beliefs that are different from most Christians. For example: * They call God Jehovah (a translation of the Hebrew letters \"YHWH\") and think it is important to use that name * They do not believe in the Trinity * They believe Jesus is God's son, the first angel, and that he is also called Michael the Archangel * They say the holy spirit is God's power rather than a person * They believe God used humans to write the Bible, which is completely true and is the best guide for how people should live === Adam and Eve === Jehovah's Witnesses believe that God made Adam and Eve, the first humans, and put them in a garden called Eden. They believe that when Adam and Eve sinned, they no longer had God's approval, so they began to get sick and die. They were not perfect anymore and could not have perfect children. They believe that Jehovah later sent Jesus to die on a pole (not a cross, as most Christians believe) to forgive people's sins. === Heaven and Armageddon === Jehovah's Witnesses believe that only 144,000 people will go to heaven to be kings and priests with Jesus. (The number 144,000 is in Revelation chapters 7 and 14. ) They say God will start a worldwide war called Armageddon. In this war, people who do not obey or worship God will be killed. However, the people he approves of will survive and be given the chance to live forever. Then God will begin to turn earth into a paradise without crime, sickness, pain, aging, wars or death. They say God will also bring back billions of people who died in the past so they can learn about God and possibly live in paradise as well. Jehovah's Witnesses believe theirs is the only religion that really obeys God's instructions. They think that God does not approve of any other religions. These other religions, they believe, are led by Satan (the Devil), who makes people think they are worshiping the right way when they are not. They believe that that only Jehovah's Witnesses will be saved at Armageddon - though God will make the final choice.\"Remaining Organized for Survival Into the Millennium\", The Watchtower, September 1, 1989, page 19, \"Only Jehovah's Witnesses, those of the anointed remnant and the 'great crowd,'as a united organization under the protection of the Supreme Organizer, have any Scriptural hope of surviving the impending end of this doomed system dominated by Satan the Devil.\"You Can Live Forever in Paradise on Earth,, Watch Tower Bible & Tract Society, 1989, pg 255, \"Do not conclude that there are different roads, or ways, that you can follow to gain life in God's new system. There is only one … there will be only one organization — God's visible organization — that will survive the fast-approaching 'great tribulation.' It is simply not true that all religions lead to the same goal. You must be part of Jehovah's organization, doing God's will, in order to receive his blessing of everlasting life.\"\"Our Readers Ask: Do Jehovah's Witnesses Believe That They Are the Only Ones Who Will Be Saved?\", The Watchtower, November 1, 2008, page 28, \"Jehovah's Witnesses hope to be saved. However, they also believe that it is not their job to judge who will be saved. Ultimately, God is the Judge. He decides.\" == What they do == === Door-to-door work === Jehovah's Witnesses are best known for their door-to-door preaching. They believe Jesus ordered them inMatthew 28:19 to \"go make disciples of all the nations\", warning people that the day of God's judgement, or Armageddon, will happen soon. Also, in Matthew 24:14, the Bible says: > And this gospel of the kingdom will be preached in the whole world as a > testimony to all nations, and then the end will come. Jehovah's Witnesses believe they are following this command by preaching to others. Public preaching is an important part of the religion. All Witnesses are told to spend as much time as they can in public preaching work, usually offering The Watchtower and other Watch Tower Society publications. Since the Internet, Jehovah's Witnesses also preach online. Members are told to give a monthly written report on how much time they have spent publicly preaching. === Meetings === Jehovah's Witnesses meet to worship in buildings called Kingdom Halls. Unlike many other churches, these halls do not have altars, statues, or symbols such as the cross. Each congregation has two meetings each week, which are open to the public: * The midweek Christian Life and Ministry meeting * The weekend Public Talk and Watchtower study Members who cannot attend can listen to the meeting over the phone or by video streaming where available. They also attend one large convention and two smaller assemblies each year (some of them at rented sports arenas), where hundreds or thousands of members gather. At their meetings, they consider what the Watch Tower Society says about the Bible and how to apply its teachings in life. At some meetings, people in the audience are invited to answer questions and make comments. The religion has elders who \"take the lead\" and ministerial servants who have various duties. They do not dress differently to other members and they are not paid. Most elders support themselves with their own jobs outside the religion. === Rules === Members of the religion are expected to live up to high moral standards based on how they understand the Bible. They are told they should always be honest and obey the laws where they live (unless the law says not to follow their religion). Many things are against the rules for Jehovah's Witnesses, including: *Sex before marriage (fornication) * Adultery * Having an abortion * Polygamy, polyandry, or polyamorous relationships * Homosexual relationships * Pornography * Smoking tobacco or taking illegal drugs (they can drink alcohol in moderation, but cannot get drunk) * Voting in elections or taking sides in politics * Saluting flags or singing national anthems * Joining the military or fighting in wars * Carrying weapons or becoming policemen who carry firearms * Training in martial arts or self- defence * Celebrating birthdays, Christmas, Easter, or other common political, historical or religious holidays * Having a blood transfusion Vaccines and most medical treatments or surgeries are allowed as a personal decision. Jehovah's Witnesses are told to marry only other baptized Jehovah's Witnesses. They believe God does not approve of divorce unless the husband or wife cheated. They can legally separate from a partner who hurt their family or refused to support them, but they would not be allowed to marry someone else while they are still legally married. They believe that when a spouse dies, the living widow or widower is allowed to remarry if they want to. Jehovah's Witnesses are not meant to make close friends with non-Witnesses because it could make it more difficult to follow their religion. === Membership === Jehovah's Witnesses are strict about who can be a member. They only count people as members if they are baptized (or getting ready to be baptized) and they preach each month. Like other Christian groups, they believe baptism represents devotion to God and a promise to live by his teachings. Unlike some Christian groups, Witnesses are not baptized as babies. There is no set age required for baptism, but they believe baptism should be a choice made by someone who is willing and understands what it means. However, it is common for young children and teenagers to be baptized. ==== Disfellowshipping ==== If the elders think a baptized Witness has broken the rules of the religion, they will speak to the person and other people who know about it. That investigation is called a \"judicial committee\". If the elders decide the person is guilty and does not show that they are sorry, he or she might be \"disfellowshipped\". This means the person is no longer a member of the group. When that happens, other Jehovah's Witnesses are told not to talk to or interact with that person (except in some situations such as living or working together) unless the disfellowshipped person repents and is \"reinstated\" (allowed back in). While disfellowshipped, the person is expected to attend their religious services if they want to return to the religion, but none of the other members will speak to them. ==== Disassociating ==== Members may also resign from the religion, which is called \"disassociating\". This can happen by writing a letter, or if the elders decide the person has taken an action that is not allowed, such as having a blood transfusion. People who \"disassociate\" are treated the same as a person who is \"disfellowshipped\". The organization describes this as a loving arrangement which helps the punished individual to reconcile with them. They organization also states that Jehovah's Witnesses want the best for all sorts of people.Alan Rogerson, Millions Now Living Will Never Die, Constable, 1969, page 50. The style of leadership of the group has also been described by some authors as autocratic and totalitarian, because members have to be completely submissive to the organization. == Related pages == * Religion * New religious movement * Armageddon * The Bible ==References== == Other websites == === Official === * Official Website * JW Broadcasting Jehovah's Witnesses' brochures about the name Jehovah * Does God Have a Name? * Does God Have a Name? (video) * The Divine Name in the Hebrew Scriptures Category:1930s establishments in the United States Category:Religious organizations established in the 20th century",
 "title": "Jehovah's Witnesses"
}