{
 "id": "776669",
 "text": "The National University of Singapore (NUS) is a national research university in Singapore. It is known as one of the best universities in Asia. == Incident == === Chen Chun Hua academic fraud === Chen Chun Hua, a visiting professors of NUS was reportedly investigated by NUS Business School after she was accused of academic fraud. Upon then, the university removed her profile on it's official website. Chen, who is reportedly from Peking University, allegedly has a degree from a fake university in Europe and pretended to be a “military adviser” for Huawei. Her education qualification begin to gain attention after Huawei issued a public statement refuting her ties to the firm and its founder Ren Zhengfei. Chen's professional biography on Newhuadu Business School’s website listed her qualified with doctorate of business administration from the \"European University of Ireland\" in 2001. Singapore news media, TODAY, reported that it couldn't find the official website of \"European University of Ireland\" and the British magazine, Times Higher Education, reported that the education ministry in Ireland had previously investigated the “European University of Ireland”. ==Notable organizations== * Lee Kuan Yew School of Public PolicyKelly, D. A., Rajan, R. S., & Goh, G. H. (2006). Managing globalization: lessons from China and India: inaugural conference of the Lee Kuan Yew School of Public Policy. World Scientific.Mahbubani, K. (2013). Lee Kuan Yew School of Public Policy: Building a Global Policy School in Asia. World Scientific. \\- Named after Lee Kuan Yew * Liberal arts - Yale NUS CollegeLiu, P., & Lye, C. (2016). Liberal arts for Asians: A commentary on Yale-NUS. Interventions, 18(4), 573-587.Chen, H., Long, W., & Yun, J. (2019, April). An Analysis of Talent Cultivation Model in Yale-NUS College. In 3rd International Conference on Culture, Education and Economic Development of Modern Society (ICCESE 2019). Atlantis Press. (Operated with Yale University) * Music - Yong Siew Toh Conservatory of MusicMarshman, A. (2012). Performer's Voices Across Centuries and Cultures: Selected Proceedings of the 2009 Performer's Voice International Symposium, Yong Siew Toh Conservatory of Music, National University of Singapore, 29 Oct-2 Nov 2009. World Scientific. ===Scientific areas=== NUS High SchoolTAN, K. E. G., SEOW, C. L. J., TAN, B. K., & TOH, T. L. (2014). Mathematical Problem Solving in NUS High School. In Making Mathematics More Practical: Implementation in the Schools (pp. 49-59). is a scientific high school affiliated to the NUS. The university also include schools for computing,Wong, L. (2006). Computational Biology in NUS School of Computing. Asia-Pacific Biotech News, 10(24), 1483-1486. dentistry, engineering, medicineWong, M. L., Koh, D., Phua, K. H., & Lee, H. P. (2005). Teaching community, occupational and family medicine at the National University of Singapore: past, present and future. Ann Acad Med Singapore, 34(5), 102C-107C. and many other areas. List of scientific research institutes in NUS Name Description Cancer Science Institute of Singapore Since 15 October 2008, Cancer Science Institute (CSI) of Singapore is dedicated to investigating cancer. Centre for Advanced 2D Materials Established in 2014, the Centre for Advanced 2D Materials is dedicated to the study of two-dimensional (2D) materials such as graphene. Centre of Healthcare Innovation and Medical Engineering The Centre for Innovation in Healthcare (CIH) aims to develop and implement new models of health care. Centre for Quantum Technologies Since December 2007, the Centre for Quantum Technologies conducts research on quantum mechanics. Centre For Remote Imaging, Sensing And Processing (CRISP) This institute was established with funding from the Agency for Science, Technology & Research (A*STAR) of Singapore. CRISP aims research in optical and microwave remote sensing technology and applications. Energy Studies Institute The Energy Studies Institute conducts research on energy policies. Institute for Mathematical Sciences This institute was established on 1 July 2000 with startup funding from the Ministry of Education and NUS. It fosters various mathematical research. Interactive And Digital Media Institute The Institute explores commercially creative interactive media research. Life Sciences Institute The Life Sciences Institute (LSI) conducts research on biological approaches in human health and diseases. Mechanobiology Institute (MBI) MBI's scientific research is focused on the dynamical and mechanical aspects of biological functions. Singapore Nuclear Research And Safety Initiative The Singapore Nuclear Research and Safety Initiative (SNRSI) was made to concentrate expertise and knowledge in nuclear technology and safety. Singapore Synchrotron Light Source (SSLS)Moser, H. O., Chew, E. P., Kempson, V. C., Kong, J. R., Li, Z. W., Nyunt, T., ... & Yang, P. (2003). Singapore Synchrotron Light Source–Status, first results, program. Nuclear Instruments and Methods in Physics Research Section B: Beam Interactions with Materials and Atoms, 199, 536-540.Yu, X. J., Diao, C. Z., Venkatesan, T., Breese, M. B. H., & Rusydi, A. (2018). A soft x-ray-ultraviolet (SUV) beamline and diffractometer for resonant elastic scattering and ultraviolet-vacuum ultraviolet reflectance at the Singapore synchrotron light source. Review of Scientific Instruments, 89(11), 113113.Yang, P., & Moser, H. O. (2008). High resolution reflectometry at Singapore synchrotron light source. Advances in Synchrotron Radiation, 1(01), 105-113. SSLS conducts research involving the use of synchrotron radiation. This includes micro/nanofabrication. Solar Energy Research Institute Of Singapore (SERIS) Since 2008, SERIS conducts research and development on solar energy technologies. Temasek LaboratoriesWin, S. K. H., Goh, T. H., Low, J. E., Shaiful, D. S. B., Win, L. T. S., Soh, G. S., & Foong, S. (2018, May). Direction Controlled Descent of Samara Autorotating Wings (SAW) with N-Wings* Research supported by the SUTD- MIT International Design Centre (IDC) and by the Temasek Laboratories Defence Innovation Research Programme (DIRP) IGDSP15020141. In 2018 IEEE International Conference on Robotics and Automation (ICRA) (pp. 6553-6559). IEEE.Wang, C. F., Nie, X. C., Yuan, N., Gan, Y. B., Tay, B. H., & Tai, Y. K. (2008, May). Temasek laboratories efficient full-wave EMC (TLEFEMC V 1.0) code for analysis of antennas mounted on large and complex platform: Introduction, validation, and application. In 2008 Asia-Pacific Symposium on Electromagnetic Compatibility and 19th International Zurich Symposium on Electromagnetic Compatibility (pp. 367-370). IEEE. This laboratory was launched on 6 September 2000. They conduct research in selected areas of science and technology critical to Singapore's requirements. Their interests include aeronautics, electromagnetism and information security. Tropical Marine Science Institute (TMSI)Taylor, E. A. (2017). Tropical Marine Science Institute. In 50 Years Of Science In Singapore (pp. 423-433).JG, W., Nogami, T., & Karim, M. R. (2002, December). “Tropical Marine Science Institute,\" Department of Civil Engineering. In Advances In Meshfree And X-fem Methods (Vol 2)-With Cd-rom, Proceedings Of The 1st Asian Workshop On Meshfree Methods (p. 115). World Scientific. TMSI undertakes research and development in tropical marine science as well as environmental science. ====Health care==== * Duke-NUS Medical SchoolWilliams, R. S., Casey, P. J., Kamei, R. K., Buckley, E. G., Soo, K. C., Merson, M. H., ... & Dzau, V. J. (2008). A global partnership in medical education between Duke University and the National University of Singapore. Academic Medicine, 83(2), 122-127.Chow, P. K. H., Soh, C. R., Tay, S. M., & Cook, S. (2009). An integrated approach to learning anatomy, physiology and micro-anatomy: A clinician-based system at Duke-NUS Graduate Medical School Singapore.Takada, K., Suzuki, T., Akita, K., Nara, N., & Tanaka, Y. (2011). Team–Based Learning at the Duke–NUS Graduate Medical School Singapore. Medical Education, 42(3), 153-157.De Silva, D. A., Allen, J. C., Krishnaswamy, G., Vogel, S., & Cook, S. (2013). Patient oriented research: the Duke-NUS medical student experience. Medical Science Educator, 23(1), 141-147. \\- Medical school operated with Duke University * Yong Loo Lin School of MedicineWee, L. E., Yeo, W. X., Tay, C. M., Lee, J. J., & Koh, G. C. (2010). The pedagogical value of a student-run community-based experiential learning project: the Yong Loo Lin School of Medicine Public Health Screening. Annals Academy of Medicine Singapore, 39(9), 686.Sayampanathan, A. A., Tan, Y. T. W., Fong, J. M. N., Koh, Y. Q., Ng, C. L., Mohan, N., ... & Tambyah, P. A. (2017). An update on finances and financial support for medical students in Yong loo Lin school of medicine. Singapore medical journal, 58(4), 206. * Public health - Saw Swee Hock School of Public Health ==Campus== File:NUS SoC COM1.jpg|NUS School of Computing File:National University of Singapore, Faculty of Engineering, panorama, Nov 06.jpg|Faculty of Engineering File:MD6 Plaza, NUS Yong Loo Lin School of Medicine, February 2020.jpg|Yong Loo Lin School of Medicine File:YST Conservatory, National University of Singapore, February 2020.jpg|Yong Siew Toh Conservatory of Music In addition, NUS also has several academic librariesLeong, N. K. (2005). How are we doing?–Measuring performance at the National University of Singapore Libraries. In International Conference on Libraries: Towards a Knowledge Society, March 14-16, 2005, University Sains Malaysia (USM), Penang, Malaysia. and an University TownFarnaz Rajabi, M. E. H. R., Samavedham, L. A. K. S. H. M. I. N. A. R. A. Y. A. N. A. N., & Yong, T. T. An Exploratory “Baseline” Development Study on the Impact of the NUS University Town Residential College Experience on Students’ Holistic Development. (or UTown). ==Alumni== File:GohChokTong- WashingtonDC-20010614.jpg|Alumnus Goh Chok Tong, Singapore's second Prime Minister File:Tony Tan Keng Yam cropp.jpg|Alumnus Tony Tan Keng Yam, Singapore's seventh President File:President of Singapore SR Nathan.jpg|Alumnus S. R. Nathan, Singapore's sixth and longest-serving President File:Mahathir Mohamad addressing the United Nations General Assembly (September 25 2003).jpg|Alumnus Mahathir Mohamad, 4th and 7th Prime Minister of Malaysia == Related pages == * Nanyang Technological University == References == == Other websites == * National University of Singapore official site Category:1980s establishments in Singapore Category:1980 establishments in Asia Category:Colleges and universities in Asia Category:Organizations based in Singapore",
 "title": "National University of Singapore"
}