{
 "id": "776769",
 "text": "is a Japanese media franchise made by Toei Animation. It is about young girls who become magical girls to fight villains. It started in 2004. It is aired by TV Asahi and Asahi Broadcasting Corporation. ==Anime== Each series focuses on a different group of girls who transform into legendary warriors called the \"Pretty Cure\". With the help of creatures known as fairies, the Pretty Cure use their magical powers and strength to fight against enemies. As the series goes on and stronger enemies appear, the Cures gain new magical items, new abilities, and sometimes new friends to help them in their fight against evil. ===Television series=== Currently, the Pretty Cure franchise has had nineteen television series: #Futari wa Pretty Cure (2004-2005) #Futari wa Pretty Cure Max Heart! (2005-2006) #Futari wa Pretty Cure Splash Star (2006-2007) #Yes! PreCure 5 (2007-2008) #Yes! PreCure 5 GoGo! (2008-2009) #Fresh Pretty Cure! (2009-2010) #HeartCatch PreCure! (2010-2011) #Suite PreCure (2011-2012) #Smile PreCure! (2012-2013) #DokiDoki! PreCure (2013-2014) #HappinessCharge PreCure! (2014-2015) #Go! Princess PreCure (2015-2016) #Witchy PreCure! (2016-2017) #Kirakira Pretty Cure a la Mode (2017-2018) #Hugtto! PreCure (2018-2019) #Star Twinkle PreCure (2019-2020) #Healin' Good Pretty Cure (2020-2021) #Tropical- Rouge! Pretty Cure (2021-2022) #Delicious Party Pretty Cure (2022-2023) #Reach For The Sky! Pretty Cure (2023-2024) ===Movies=== The franchise has had many movies: *Futari wa Pretty Cure Max Heart the Movie (2005) *Futari wa Pretty Cure Max Heart the Movie 2: Friends of the Snow-Laden Sky (2005) *Futari wa Pretty Cure Splash Star: Tick-Tock Crisis Hanging by a Thin Thread! (2006) *Yes! PreCure 5 the Movie: Great Miraculous Adventure in the Mirror Kingdom! (2007) *Yes! Precure 5 GoGo! the Movie: Happy Birthday in the Sweets Kingdom (2008) *Fresh Pretty Cure! the Movie: The Toy Kingdom has Lots of Secrets!? (2009) *HeartCatch PreCure The Movie: Fashion Show in the Flower Capital... Really?! (2010) *Suite Precure♪ The Movie: Take it back! The Miraculous Melody that Connects Hearts (2011) *Smile PreCure! The Movie: Big Mismatch in a Picture Book! (2012) *DokiDoki! Precure the Movie: Mana's Getting Married!!? The Dress of Hope Tied to the Future (2013) *HappinessCharge PreCure! the Movie: The Ballerina of the Land of Dolls (2014) *Go! Princess Pretty Cure the Movie: Go! Go!! Gorgeous Triple Feature!!! (2015) *Witchy Pretty Cure! The Movie: Wonderous! Cure Mofurun! (2016) *Kirakira Pretty Cure a la Mode the Movie: Crisply! Memorable Mille-feuille in Paris (2017) *Hugtto! PreCure Futari wa Pretty Cure: All Stars Memories (2018) *Star☆Twinkle Precure the Movie: These Feelings Within The Song of Stars (2019) *Healin' Good Pretty Cure the Movie: GoGo! Big Transformation! The Town of Dreams (2021) *Tropical- Rouge! Pretty Cure the Movie: The Snow Princess and the Miraculous Ring! (2021) ===Crossover movies=== The franchise has had many crossover movies: *Pretty Cure All Stars DX: Everyone's Friends☆The Collection of Miracles! (2009) *Pretty Cure All Stars DX2: Light of Hope☆Protect The Rainbow Jewel! (2010) *Pretty Cure All Stars DX3: Deliver the Future! The Rainbow~Colored Flower That Connects the World! (2011) *Pretty Cure All Stars New Stage: Friends of the Future (2012) *Pretty Cure All Stars New Stage 2: Friends of the Heart (2013) *Pretty Cure All Stars New Stage 3: Eternal Friends (2014) *Pretty Cure All Stars: Carnival of Spring♪ (2015) *Pretty Cure All Stars: Singing with Everyone♪ Miraculous Magic! (2016) *Pretty Cure Dream Stars! (2017) *Pretty Cure Super Stars! (2018) *Pretty Cure Miracle Universe (2019) *Pretty Cure Miracle Leap (2020) ===International=== An English-language dub of Futari wa Pretty Cure aired on YTV in Canada and Pop Girl in the United Kingdom. Saban Brands made English-language dubs of Smile PreCure! and DokiDoki PreCure for Netflix. ==Video games== The franchise has had many console games: * (2005, Game Boy Advance) * (2005, Nintendo DS) * (2006, Nintendo DS) * (2007, Nintendo DS) * (2008, Nintendo DS) * (2009, Nintendo DS) * (2010, Nintendo DS) * (2010, Nintendo DS) * (2011, Nintendo DS) * (2012, Nintendo 3DS) * (2013, Wii) * (2013, Nintendo 3DS) * (2014, Nintendo 3DS) * (2015, Nintendo 3DS) * (2017, iOS, Android) * (2018, Nintendo Switch) The franchise has had many Data Carddass arcade games: * (2007) * (2008) * (2009) * (2010) * * (2015) * (2016) ==Manga== The franchise has a manga illustrated by Futago Kamikita. It is published in Nakayoshi, a shōjo magazine from Kodansha. ==Other media== A live-action series, Koe Girl!, aired in 2018. It was made for the franchise's fifteenth anniversary. It is about girls who want to be voice actresses. An internet radio spin-off of Yes! PreCure 5 GoGo!, Club Coco & Nuts, aired on Animate TV. It was hosted by Takeshi Kusao and Miyu Irino. A radio program, was made for the franchise's tenth anniversary. It was hosted by Hitomi Yoshida. ==References== Category:2004 establishments in Japan Category:Anime Category:Japan-exclusive video games",
 "title": "Pretty Cure"
}