{
 "id": "776964",
 "text": "\"22 Short Films About Springfield\" is the 21st episode of the 7th season of The Simpsons. It was first shown on television on April 14, 1996. The episode is divided into 22 parts. Each part is a different story that shows how life is for the people in Springfield. The name of the episode is based on the movie Thirty Two Short Films About Glenn Gould. The episode's story is based on the ending of a season 4 episode named \"The Front\". Many parts of the episode reference the film Pulp Fiction. A scene from the episode became an internet meme after two decades of when the episode was first shown on television. == Story == # Bart and Milhouse spit on top of cars on a highway. # Apu closes the Kwik-E-Mart (a convenience store) for 5 minutes and goes to a party. Hans Moleman is trapped in the store. # Bart puts gum in Lisa's hair. Marge tries to take the gum out by putting peanut butter and mayonnaise on Lisa's hair. # Lisa's hair brings a swarm of bees. # Mr. Smithers gets stung by a bee while riding a bike with Mr. Burns and suffers an allergy. # A doctor (Dr. Nick) is told not to do quackery. # However, Dr. Nick saves Grampa by using a light socket. # Moe gets robbed by a repeat offender named Snake after Moe is given $2,000. # Principal Skinner brings Superintendent Chalmers over for lunch. He burns his roast and must carry on with the lunch. # Homer accidentally puts Maggie in a newspaper vending box. # Chief Wiggum and his friends compare Krusty Burger and McDonald's. # Bumblebee Man's house gets destroyed and his wife leaves him. # Chief Wiggum gets ran over by a car driven by Snake. He takes Wiggum to a store and puts him at gunpoint. # Reverend Lovejoy tells his dog to use Ned Flanders' lawn as a toilet. # Many characters tell Marge different ways on how to get the gum out of Lisa's hair. # Cletus finds some shoes on a telephone line and tells his wife about it. # Milhouse tries to go to the bathroom at Comic Book Guy's store. # Milhouse and his father go to the store that Wiggum is trapped in to use the bathroom. Milhouse knocks out the store owner with a flail and saves his father, Snake, and Wiggum. # A barber cuts the gum out of Lisa's hair and gets a different hairstyle. # Nelson laughs at a tall guy in a small car who makes Nelson pull down his pants and walk across the street. # Bart and Milhouse put condiments on Nelson and decide that life is interesting. # Professor Frink tries to tell his story but closing credits show instead. == Reception == Bill Oakley calls \"22 Short Films About Springfield\" his favorite episode. In 2019, Oakley said that the episode is one of the best episodes to watch on Disney+. TV Guide put it in its list of the top 12 Simpsons episodes. Consequence of Sound put the episode on number 5 of its list of top 30 Simpsons episodes. The Guardian named the episode as one of the 5 greatest episodes of The Simpsons. IGN called \"A Fish Called Selma\" the best episode of the seventh season but said \"22 Short Films About Springfield\" was \"good competition\". === Steamed Hams === A segment of the episode called \"Skinner & The Superintendent\" became an internet meme. Principal Skinner calls hamburgers \"steamed hams\" and says the name came from Albany, New York. In 2016, the segment was put on many Facebook pages and remixes of the segment on YouTube were also created. About 1,000 people asked the supermarket chain Woolworths about \"steamed hams\". Woolworths said that \"in Australia, we call them Hamburgers. 'Steamed Hams' is an Albany, New York expression. Fans of The Simpsons, this is for you\". During an interview for the movie Jurassic World: Fallen Kingdom, a GameSpot reporter made Jeff Goldblum read the dialogue of Principal Skinner. Bill Oakley, the original writer of the segment, did not like the reading and said \"[I'm] not a fan of fairly big companies like GameSpot having famous actors perform scripts I wrote, verbatim, without giving me any sort of credit whatsoever.\" == References == == Other websites == * * * Category:The Simpsons (season 7) episodes Category:1996 television episodes Category:Internet memes Category:Television episodes written by David X. Cohen",
 "title": "22 Short Films About Springfield"
}