{
 "id": "77729",
 "text": "Brussels-Capital Region is one of the three regions of Belgium. Its official name in the three official languages of Belgium: * * * It has a population of 1,222,637 The figure at the beginning differs from the table's total because the first figure had been adapted at a later date; the difference amounts 5,567 people. (1 January 2022) on an area of 162 km².Population, StatbelArea, Statbel == Language == Brussels-Capital Region is officially bilingual: Dutch and French, but most people speak French.German is no official language of Brussels-Capital Region. In earlier times, they spoke Brabantian, which is a Dutch dialect. == History == The area of Brussels-Capital Region belonged to the Duchy of Brabant until 1795. After the French occupation it became part of the newly formed province of South Brabant during the United Kingdom of the Netherlands from 1815 until 1831. After the Belgian separation in 1831, it became part of the newly formed province of Brabant. On 1 January 1995, Brabant province was divided into the provinces of Flemish Brabant (Dutch- speaking) and Walloon Brabant (French-speaking), and into the bilingual Brussels region. == Municipalities == Brussels-Capital Region has 19 municipalities: # French name Dutch name Population 2022 Statistieken van bevolking - Bevolkingscijfers op 1 januari 2022 (.pdf), Rijksregister Postal code 1 Anderlecht Anderlecht 121,394 1070 2 Auderghem Oudergem 34,937 1160 3 Berchem-Sainte-Agathe Sint-Agatha-Berchem 25,288 1082 4 Bruxelles ¹ Brussel ¹ 187,686 1000, 1020, 1120, 1130, 1040, 1050 5 Etterbeek Etterbeek 48,223 1040 6 Evere Evere 43,481 1140 7 Forest Vorst 56,271 1190 8 Ganshoren Ganshoren 25,202 1083 9 Ixelles Elsene 86,917 1050 10 Jette Jette 52,604 1090 11 Koekelberg Koekelberg 21,997 1081 12 Molenbeek-Saint-Jean Sint-Jans-Molenbeek 97,102 1080 13 Saint-Gilles Sint- Gillis 48,498 1060 14 Saint-Josse-ten-Noode Sint-Joost-ten-Node 26,809 1210 15 Schaerbeek Schaarbeek 130,270 1030 16 Uccle Ukkel 84,647 1180 17 Watermael- Boitsfort Watermaal-Bosvoorde 25,190 1170 18 Woluwe-Saint-Lambert Sint- Lambrechts-Woluwe 58,448 1200 19 Woluwe-Saint-Pierre Sint-Pieters-Woluwe 42,106 1150 Total 1,217,070 ¹ Capital, English name Brussels. == Related pages == There are two other regions: * Flanders (or Flemish Region) for the Dutch-speaking part of Belgium * Wallonia (or Walloon Region) for the French- speaking part of Belgium == References == == Other websites == *Official website *The Brussels-Capital Region, belgium.be",
 "title": "Brussels-Capital Region"
}