{
 "id": "777249",
 "text": "\"Bart on the Road\" is the 20th episode of the 7th season of The Simpsons. It was first shown on television on March 31, 1996. In the episode, Bart gets a fake driver's license and takes his friends to Knoxville, Tennessee. However, Bart's car gets destroyed and Homer must use a courier to get Bart and his friends back to Springfield. The episode makes references to the movie Naked Lunch, singer Andy Williams, and the Look magazine. == Story == Principal Skinner closes the Springfield Elementary School and tells his students to go to work with your parents. Bart wants to stay at home with Marge, but he is told that housecleaning is not a real job. Instead, Bart goes to Patty and Selma's job at the DMV (department of motor vehicles). Lisa goes to Homer's job at the Springfield Nuclear Power Plant. Bart makes a fake driver's license at the DMV and rents a car with Nelson, Milhouse, and Martin. Bart and his friends tell their parents that they are going to Canada for a grammar competition. They instead use the rented car for a road trip to the 1982 World's Fair at Knoxville, Tennessee. However, the world fair happened 14 years ago and only a wig shop is still there. They all buy wigs and Martin uses the last money they have on a doll of Al Gore. Nelson knocks down the Sunsphere, which destroys their car. They are left being stuck in Knoxville. Lisa uses her time during spring break at the power plant. Bart places a collect call on Lisa to help him and his friends return home without having Homer and Marge know. Bart becomes a courier but does not get enough money to go home. Principal Skinner sees Bart in Hong Kong while being a courier. Lisa makes Homer promise that he will not get angry about Bart, so she tells Homer where Bart is. Homer orders a new console for the power plant from Oak Ridge so Bart can get home. He gets it shipped near Knoxville, where Bart is still a courier. Nelson, Milhouse, and Martin hide in a crate. Marge does not know about any of this and gets confused when she gets phone calls on what Bart has done. == Reception == John Thorpe of Central Michigan Life called it the 8th best episode of The Simpsons. Jennifer Malkowski of DVD Verdict gave the episode a grade of B+ and thought that the best part of the episode was Patty and Selma telling Bart about their job, saying \"Somedays we don't let the line move at all. We call those weekdays.\" Robert Canning of IGN calls the episode \"outstanding\" and says that \"it's the way everything comes together that really makes it memorable.\"Canning, Robert (July 22, 2009). The Simpsons Flashback: \"Bart On the Road\" Review. IGN. Retrieved May 30, 2010. Colin Jacobson of DVD Movie Guide said that he loved the children at their parents' jobs and said \"when they head out of town, the fun continues.\" == References == == Other websites == * * * Category:The Simpsons (season 7) episodes Category:1996 television episodes",
 "title": "Bart on the Road"
}