{
 "id": "777323",
 "text": "The Unistʼotʼen Camp (pronounced OO-nis-TAH-den) is a camp built on the territory of the Unist'otʼen clan of the Wetʼsuwetʼen Nation. It is in northern British Columbia, Canada. It is located at the point where several planned energy pipelines will pass, as a means to block the crossing of Wetʼsuwetʼen territory by pipeline-related industries. It is at the point where several planned energy pipelines will pass. The camp is by road from Vancouver, BC and about from the town of Smithers, BC. The Wetʼsuwetʼen have built a checkpoint some east of the camp on the Morice River Forest Services Road. At this point, visitors must have permission to enter the territory. They have banned construction workers and equipment from coming in. In 2019, the Coastal GasLink Pipeline went to court to enforce the permission granted by the Wetʼsuwetʼen and other First Nations band councils to build in the area. A court decision in 2020 gave an injunction against the Unisʼtotʼen clan and its supporters. In February 2020, the Royal Canadian Mounted Police (RCMP) took down the blockades and checkpoints. After the RCMP's actions, there have been protests across Canada supporting the Wetʼsuwetʼen. == History == The Wet’suwet’en are divided into five clans. Each clan is led by a hereditary chief. Hereditary means that he or she got the position from a parent who was also a hereditary chief. These chiefs were part of a precolonial government system and are responsible for taking care of the land. The Wet’suwet’en also have an elected council, which was created after the arrival of Europeans in Canada. These councils were created through the Indian Act and are a way for the Wet’suwet’en to meet with the Canadian government. There is a lot of confusion on whether the chiefs or the council represent the Wet’suwet’en people. The council approved for a pipeline to be built on Wet'suwet'en territory. However, the hereditary chiefs did not agree. The chiefs set up the camp in 2010. The area of the camp is where the pipelines are supposed to cross Talbits Kwah (Gosnell Creek). At the camp, there is a pit house, a garden, several greenhouses, a healing center, and a bunkhouse. In 2015, the Unistʼotʼen released a declaration which included this statement: > \"The Unistʼotʼen settlement camp is not a protest or a demonstration. Our > clan is occupying and using our traditional territory as it has for > centuries. Our free, prior, and informed consent protocol is in place at the > entrance of our territory as an expression of our jurisdiction and our > inherent right to both give and refuse consent and entry into our > territory.\" This quote meant that the clan can refuse to let people in because they have authority over the land as the traditional caretakers. Healing and learning activities take place at the camp. A healing center was built in 2015. The healing center welcomes people to reconnect with the land, learn cultural practices, and recover from health issues such as substance abuse using traditional Indigenous methods. According to the traditional beliefs of the Wetʼsuwetʼen people, healing can come from being connected to the land and that the impacts of colonialism, including living away from traditional territories, are harmful. A youth camp provides opportunities for young people to learn and practice their culture. == Unist'otʼen checkpoint conflict == The Wetʼsuwetʼen set up a checkpoint on the Morice River Forest Services Road several kilometers from the camp, controlling access to the area. The area was blocked to the pipeline project. In 2018, TC Energy was granted an injunction to remove the checkpoint so they can have complete access to the pipeline project construction. In January 2019, the RCMP entered the territory to enforce the court injunction and allow workers from the Coastal GasLink pipeline project access to the area. The RCMP arrested 14 people on January 8 at the checkpoint. The pipeline workers completed their pre-construction work. Afterwards, the blockades were rebuilt. People who support of the blockade consider the action taken at the Unisʼtotʼen checkpoint and the lack of consultation with hereditary chiefs to be violations of the United Nations' Declaration on the Rights of Indigenous Peoples (UNDRIP). Many Indigenous peoples have written and discussed the ways this action will impact the Canadian government's efforts to put in practice the recommendations of the Truth and Reconciliation Commission Report, with many famous Indigenous peoples such as broadcaster Jesse Wente, speaking at rallies and protests. In December 2019, the injunction was put in place again. More discussions ended without the pipeline proponents convincing the hereditary chiefs and their supporters to withdraw. The RCMP returned to the area in 2020 and arrests began again as the RCMP cleared the Morice Forest Service Road. Supporters of the blockade remained along the road, including the camp. The arrests sparked protests in BC and across Canada in support of the Wet'suwet'en. Statements showing supporting the Unistʼotʼen Camp have been issued by organizations and institutions such as: OCAD University, the British Columbia Teachers' Federation, Ryerson University School of Social Work. == References == Category:Indigenous rights activists Category:Settlements in British Columbia Category:2010s protests",
 "title": "Unistʼotʼen Camp"
}