{
 "id": "777514",
 "text": "Sound City Studios is a recording studio in Los Angeles, California. It first opened in 1969 in the Van Nuys neighborhood. Before this, it was a factory for the British musical instrument maker Vox. The studio became well known for having a unique sound, especially when drums are played in there. Because of this, many famous recording artists have recorded there. These include Johnny Cash, Nirvana, Fleetwood Mac, Metallica, and many others. Over one hundred albums recorded at Sound City were given gold and platinum certifications. ==List of albums== Year Artist Album Producer 1970 Spirit Twelve Dreams of Dr. Sardonicus David Briggs 1970 Neil Young After The Gold Rush Neil Young David Briggs Kendall Pacios 1972 Dr. John Dr. John's Gumbo Jerry Wexler 1973 Buckingham Nicks Buckingham Nicks Keith Olsen 1974 Evel Knievel Evel Knievel Ron Kramer 1974 Elton John Caribou Gus Dudgeon 1974 Bachman–Turner Overdrive Not Fragile Randy Bachman 1974 Bill Cosby At Last Bill Cosby Really Sings Stu Gardner 1975 Fleetwood Mac Fleetwood Mac Keith Olsen 1975 War Why Can't We Be Friends? Jerry Goldstein 1975 Nils Lofgren Nils Lofgren David Briggs 1976 Rick Springfield Wait for Night Mark K. Smith 1977 Grateful Dead Terrapin Station Keith Olsen 1977 REO Speedwagon You Can Tune a Piano, but You Can't Tuna Fish John Boylan Gary Richrath Kevin Cronin Paul Grupp 1978 Cheap Trick Heaven Tonight Tom Werman 1978 Walter Egan Not Shy Lindsey Buckingham Richard Dashut 1978 Foreigner Double Vision Keith Olsen 1979 Tom Petty and the Heartbreakers Damn the Torpedoes Jimmy Iovine 1980 Pat Benatar Crimes of Passion Keith Olsen 1981 Rick Springfield Working Class Dog Keith Olsen Bill Drescher 1981 Tom Petty and the Heartbreakers Hard Promises Tom Petty Jimmy Iovine 1981 Santana Zebop! Keith Olsen 1982 Pat Benatar Precious Time Keith Olsen 1982 Hawks 30 Seconds Over Otho John Ryan Hawks 1982 REO Speedwagon Good Trouble Kevin Beamish 1982 Fear The Record Gary Lobow 1982 Barry Manilow Here Comes the Night Bill Drescher 1982 Rick Springfield Living in Oz Bill Drescher 1983 Dio Holy Diver Ronnie James Dio 1983 Sharon O'Neill Foreign Affairs John Boylan 1984 Ratt Out of the Cellar Beau Hill 1984 Rick Springfield Hard to Hold Bill Drescher 1984 Lionheart Hot Tonight Kevin Beamish 1984 The Winans Tomorrow Scott V. Smith 1984 Saxon Crusader Kevin Beamish 1985 Tom Petty and the Heartbreakers Southern Accents Tom Petty Jimmy Iovine 1985 Loudness Thunder in the East Max Norman 1986 Guns N' Roses Appetite for Destruction (Sound City Sessions) Mike Clink, Manny Charlton 1988 Fleetwood Mac Greatest Hits 1989 Keel Larger Than Live Ron Keel 1991 Nirvana Nevermind Butch Vig 1992 Kyuss Blues for the Red Sun Kyuss Chris Goss 1992 Masters of Reality Sunrise on the Sufferbus Chris Goss Ginger Baker 1992 Rage Against the Machine Rage Against the Machine Garth Richardson 1992 Green Jellÿ Cereal Killer Sylvia Massy 1993 Kyuss Welcome to Sky Valley Kyuss Chris Goss 1993 Tool Undertow Sylvia Massy C.J. Buscaglia 1993 Rancid Rancid Brett Gurewitz 1993 Tom Petty Greatest Hits 1994 Tom Petty Wildflowers Rick Rubin 1994 The Black Crowes Amorica Jack Joseph Puig 1994 Slayer Divine Intervention Rick Rubin Toby Wright Slayer 1995 Dashboard Prophets Burning Out The Inside Garth Richardson 1995 Red Hot Chili Peppers One Hot Minute Rick Rubin 1995 Kerbdog On The Turn Garth Richardson 1995 Kyuss ...And the Circus Leaves Town Chris Goss 1996 Tom Petty and the Heartbreakers Songs and Music from \"She's the One\" Tom Petty 1996 Carl Perkins Go Cat Go! Various artists Eddie Kramer 1996 Johnny Cash Unchained Rick Rubin 1996 Weezer Pinkerton Weezer David Fridmann 1996 Tonic Lemon Parade Jack Joseph Puig 1997 Bruce Dickinson Accident of Birth Roy Z 1997 Fu Manchu The Action Is Go Jay Noel Yuenger 1998 Various artists Godzilla: The Album Foo Fighters 1998 Frank Black and the Catholics Frank Black and the Catholics Frank Black 1998 Bruce Dickinson The Chemical Wedding Roy Z 1998 Superdrag Head Trip in Every Key Jerry Finn Superdrag 1998 System of a Down System of a Down Rick Rubin System of a Down 1999 Frank Black and the Catholics Pistolero Nick Vincent 1999 Jimmy Eat World Clarity Mark Trombino 2000 A Perfect Circle Mer de Noms Billy Howerdel 2000 Queens of the Stone Age Rated R Chris Goss 2001 Black Rebel Motorcycle Club B.R.M.C. Black Rebel Motorcycle Club 2001 Frank Black and the Catholics Dog in the Sand Nick Vincent 2001 Slipknot Iowa Ross Robinson 2001 Treble Charger Wide Awake Bored Matt Hyde 2001 Fu Manchu California Crossing Matt Hyde 2001 Vanilla Ice Bi-Polar Vanilla Ice 2003 Matchbook Romance West For Wishing Brett Gurewitz 2003 Hotwire The Routine Matt Hyde 2003 Kings of Leon Youth & Young Manhood Ethan Johns 2003 Poison the Well You Come Before You Pelle Henricsson 2003 Rancid Indestructible Brett Gurewitz 2004 Bad Religion The Empire Strikes First Brett Gurewitz 2004 Seo Taiji 7th Issue Seo Taiji 2005 Queens of the Stone Age Lullabies to Paralyze Joe Barresi 2005 Wolfmother Wolfmother Dave Sardy 2005 Nine Inch Nails With Teeth Trent Reznor 2005 Madrugada The Deep End George Drakoulias 2005 Ry Cooder Chávez Ravine Ry Cooder 2007 Mavis Staples We'll Never Turn Back Ry Cooder 2008 Cold War Kids Loyalty to Loyalty Kevin Augunas Cold War Kids 2008 Metallica Death Magnetic Rick Rubin 2008 Nine Inch Nails The Slip Trent Reznor 2008 Elvis Costello and the Imposters Momofuku Elvis Costello Jason Lader 2009 BigBang Edendale Greg Richling Kid Rock Born Free Rick Rubin The Higher It's Only Natural Mike Green Wolfmother Cosmic Egg Alan Moulder 2010 Josh Groban Illuminations Rick Rubin Death Cab for Cutie Codes and Keys Chris Walla Death Cab for Cutie Triggerfinger All This Dancin' Around Greg Gordon Year Long Disaster Black Magic; All Mysteries Revealed Nick Raskulinecz 2011 Mastodon The Hunter Mike Elizondo Everclear Return to Santa Monica Nathaniel Kunkel Art Alexakis Arctic Monkeys Suck It and See James Ford Haloes Living Like Kings In Confined Spaces Greg Richling Noah and the Whale Last Night on Earth Noah and the Whale The Lonely Forest Arrows Chris Walla Monstro Flora Between the Stars Greg Richling 2018 Fall Out Boy Mania Death Cab for Cutie Thank You for Today Rich Costey Boygenius Boygenius N/A The Crystal Method The Trip Home Tiny E 2019 Andrew Bird My Finest Work Yet Paul Butler Big Thief Two Hands Andrew Sarlo Perfume Genius Set My Heart On Fire Immediately Blake Mills 2020 Phoebe Bridgers Punisher Tony Berg and Ethan Gruska ==References== Category:American record producers Category:Buildings and structures in Los Angeles",
 "title": "Sound City Studios"
}