{
 "id": "777648",
 "text": "Stephanie Murphy (born Đặng Thị Ngọc Dung; September 16, 1978) is a Vietnamese-born American politician. She represented Florida's 7th congressional district from 2017 to 2023. Murphy is the first Vietnamese- American woman to serve in Congress. She is the second overall, after Joseph Cao. She is a Democrat and used to be an Independent. ==Political career== Murphy announced her candidacy for the United States House of Representatives for Florida's 7th congressional district in the 2016 elections. She ran against then-incumbent Republican John Mica. She was supported by President Barack Obama, Vice President Joe Biden, and former congresswoman Gabby Giffords. Murphy won the election, beating Mica with 51% of the vote. After Democrats won the House majority in 2018, Murphy became a member of the United States House Committee on Ways and Means. On December 18, 2019, Murphy voted for both articles of impeachment against Trump. On January 7, 2021, Murphy wanted President Donald Trump to be removed from office under the 25th Amendment to the United States Constitution. She voted in favor of Trump's second impeachment on January 13, 2021. In March 2019, Murphy supported Beto O'Rourke's presidential candidacy in the 2020 Democratic party presidential primaries. After O'Rourke dropped out of the race, Murphy supported Michael Bloomberg in January 2020 and became his campaign's national co-chair. After Bloomberg dropped out in March 2020, Murphy supported Joe Biden's presidential campaign. On December 20, 2021, Murphy announced that she will not run for reelection in 2022. ==Personal life== Murphy was born Đặng Thị Ngọc Dung in Ho Chi Minh City, Vietnam. Her family fled Communist-controlled Vietnam in 1979 when she was six months old. Their boat ran out of fuel and they were rescued by the United States Navy at sea. She was raised in Virginia and Winter Park, Florida. Murphy and her husband, Sean, have two children. Murphy is a Protestant. == References == ==Other website== * Congresswoman Stephanie Murphy official U.S. House website * Campaign website * Category:1978 births Category:American Protestants Category:Democratic Party (United States) politicians Category:United States representatives from Florida Category:Living people Category:People from Winter Park, Florida Category:Politicians from Virginia Category:Naturalized citizens of the United States",
 "title": "Stephanie Murphy"
}