{
 "id": "777990",
 "text": "Le Chaudron infernal is a French silent trick movie made in 1903. It was directed by Georges Méliès. In Britain it was released as The Infernal Cauldron and in the United States as The Infernal Caldron and the Phantasmal Vapors. It was released by Méliès's Star Film Company and is numbered 499–500 in its catalogues. == Plot == In a Renaissance chamber decorated with devilish faces and a warped coat of arms, a gleeful Satan throws three human victims into a cauldron, which spews out flames. The victims rise from the cauldron as nebulous ghosts, and then turn into fireballs. The fireballs multiply and pursue Satan around the chamber. Finally Satan himself leaps into the infernal cauldron, which gives off a final burst of flame. == Versions == The movies Meliès did before 1903 were often pirated by American producers. This is especially true for his popular movie A Trip to the Moon. To fight against this product piracy, Méliès opened an American branch of his Star Film Company. He began producing two negatives of each movie he made: one for home markets, and one for foreign release. To produce the two separate negatives, Méliès built a special camera that used two lenses and two reels of film. In the 2000s, researchers at the French film company Lobster Films noticed that Méliès's two-lens system was a fully functional, stereo film camera. 3D versions of Meliè' movies could e made by combining the domestic and foreign prints of the film. Serge Bromberg, the founder of Lobster Films, presented 3D versions of The Infernal Cauldron and another 1903 Méliès film, The Oracle of Delphi, at a January 2010 presentation at the Cinémathèque Française. According to the film critic Kristin Thompson, \"the effect of 3D was delightful … the films as synchronized by Lobster looked exactly as if Méliès had designed them for 3D.\" Bromberg screened both films again—as well as the 1906 Méliès film The Mysterious Retort, similarly prepared for 3D—at a September 2011 presentation at the Academy of Motion Picture Arts and Sciences. == References == == Other websites == * Category:1903 movies Category:French horror movies Category:French silent movies",
 "title": "Le Chaudron infernal"
}