{
 "id": "778039",
 "text": "The 2020 Atlantic hurricane season was the most active Atlantic hurricane season ever recorded, breaking the record of 2005. The season had a record- breaking 12 storms that hit the U.S., with many making landfall in Louisiana. The season had had thirty-one tropical or subtropical cyclones, thirty named storms, fourteen hurricanes, and seven major hurricanes. It had over twenty tropical storms that broke formation date records. The season happened during the COVID-19 pandemic, making it harder to evacuate and give help to people who needed it. __TOC__ ==Season summary== ImageSize = width:800 height:230 PlotArea = top:10 bottom:80 right:20 left:20 Legend = columns:3 left:30 top:58 columnwidth:270 AlignBars = early DateFormat = dd/mm/yyyy Period = from:01/05/2020 till:30/11/2020 TimeAxis = orientation:horizontal ScaleMinor = grid:black unit:month increment:1 start:01/05/2020 Colors = id:canvas value:gray(0.88) id:GP value:red id:TD value:rgb(0.38,0.73,1) legend:Tropical_Depression_≤_39_mph_(≤62_km/h) id:TS value:rgb(0,0.98,0.96) legend:Tropical_Storm_=_39–73_mph_(63–118_km/h) id:C1 value:rgb(1,1,0.80) legend:Category_1_=_74–95_mph_(119–153_km/h) id:C2 value:rgb(1,0.91,0.46) legend:Category_2_=_96–110_mph_(154–177_km/h) id:C3 value:rgb(1,0.76,0.25) legend:Category_3_=_111–129_mph_(178–208_km/h) id:C4 value:rgb(1,0.56,0.13) legend:Category_4_=_130–156_mph_(209–251_km/h) id:C5 value:rgb(1,0.38,0.38) legend:Category_5_≥_157_mph_(≥252_km/h) Backgroundcolors = canvas:canvas BarData = barset:Hurricane bar:Month PlotData= barset:Hurricane width:10 align:left fontsize:S shift:(4,-4) anchor:till from:16/05/2020 till:19/05/2020 color:TS text:\"Arthur (TS)\" from:27/05/2020 till:28/05/2020 color:TS text:\"Bertha (TS)\" from:01/06/2020 till:10/06/2020 color:TS text:\"Cristobal (TS)\" from:22/06/2020 till:24/06/2020 color:TS text:\"Dolly (TS)\" from:04/07/2020 till:06/07/2020 color:TS text:\"Edouard (TS)\" from:09/07/2020 till:11/07/2020 color:TS text:\"Fay (TS)\" from:21/07/2020 till:25/07/2020 color:TS text:\"Gonzalo (TS)\" from:23/07/2020 till:27/07/2020 color:C1 text:\"Hanna (C1)\" from:30/07/2020 till:05/08/2020 color:C1 text:\"Isaias (C1)\" from:31/07/2020 till:02/08/2020 color:TD text:\"Ten (TD)\" barset:break from:11/08/2020 till:16/08/2020 color:TS text:\"Josephine (TS)\" from:14/08/2020 till:16/08/2020 color:TS text:\"Kyle (TS)\" from:20/08/2020 till:29/08/2020 color:C4 text:\"Laura (C4)\" from:20/08/2020 till:25/08/2020 color:C1 text:\"Marco (C1)\" from:31/08/2020 till:05/09/2020 color:TS text:\"Omar (TS)\" from:01/09/2020 till:04/09/2020 color:C1 text:\"Nana (C1)\" from:07/09/2020 till:23/09/2020 color:C2 text:\"Paulette (C2)\" from:07/09/2020 till:14/09/2020 color:TS text:\"Rene (TS)\" from:11/09/2020 till:17/09/2020 color:C2 text:\"Sally (C2)\" from:12/09/2020 till:23/09/2020 color:C4 text:\"Teddy (C4)\" barset:break from:14/09/2020 till:17/09/2020 color:TS text:\"Vicky (TS)\" from:17/09/2020 till:23/09/2020 color:TS text:\"Beta (TS)\" from:18/09/2020 till:21/09/2020 color:TS text:\"Wilfred (TS)\" from:18/09/2020 till:19/09/2020 color:TS text:\"Alpha (SS)\" from:02/10/2020 till:06/10/2020 color:C1 text:\"Gamma (C1)\" from:04/10/2020 till:10/10/2020 color:C4 text:\"Delta (C4)\" from:19/10/2020 till:26/10/2020 color:C3 text:\"Epsilon (C3)\" from:24/10/2020 till:28/10/2020 color:C3 text:\"Zeta (C3)\" from:31/10/2020 till:12/11/2020 color:C4 text:\"Eta (C4)\" from:09/11/2020 till:13/11/2020 color:TS text:\"Theta (TS)\" from:13/11/2020 till:16/11/2020 color:C4 text:\"Iota (C4)\" barset:Hurricane width:10 align:left fontsize:S shift:(4,-4) anchor:till barset:break bar:Month width:5 align:center fontsize:S shift:(0,-20) anchor:middle color:canvas from:01/05/2020 till:31/05/2020 text:May from:01/06/2020 till:30/06/2020 text:June from:01/07/2020 till:31/07/2020 text:July from:01/08/2020 till:31/08/2020 text:August from:01/09/2020 till:30/09/2020 text:September from:01/10/2020 till:31/10/2020 text:October from:01/11/2020 till:30/10/2020 text: November TextData = pos:(570,30) text:\"(From the\" pos:(618,30) text:\"Saffir–Simpson scale)\" The season had 30 named storms and one that wasn't named because it wasn't strong enough. ==Storms== ===Tropical Storm Arthur=== Tropical Storm Arthur was an early storm. It formed on May 16 from a stormy area near Cuba, and caused damage in Florida, North Carolina, and South Carolina, as well as The Bahamas and Bermuda. Even though the storm was kind of strong, it only lasted three days. ===Tropical Storm Bertha=== Tropical Storm Bertha was an early storm as well. While it only lasted one day, it caused some damage in The Bahamas and Southern United States. It also led to the Crew Dragon Demo-2 flight being delayed. ===Tropical Storm Cristobal=== Tropical Storm Cristobal was the earliest third named storm on record. The storm had formed from clouds left-over by Tropical Storm Amanda. The storm formed in the Bay of Campeche, devastated Mexico, and stalled, before hitting Louisiana. The storm then traveled up to Wisconsin, as a weaker tropical depression, before becoming post-tropical. ===Tropical Storm Dolly=== Tropical Storm Dolly was a short-lived storm. It formed on June 22 as a subtropical system, becoming tropical on June 23, as it reached tropical storm status, and dissipated on June 24. ===Tropical Storm Edouard=== Tropical Storm Edouard formed in an unusual time of the year, in July. It formed on July 4, and reached tropical storm status on July 6. After reaching tropical storm status, it became the earliest fifth named storm until Hurricane Elsa formed on July 1, 2021. ===Tropical Storm Fay=== Earliest sixth named storm. Tropical Storm Fay formed off the coast of the Carolinas and then struck New Jersey as a tropical storm, weakening inland. ===Tropical Storm Gonzalo=== Earliest seventh named storm. Nearly made a landfall in Guyana. ===Hurricane Hanna=== In July 23, Hanna formed in the Gulf of Mexico, from a tropical wave. On July 24, it reached tropical storm status, becoming the earliest named eighth storm. The storm rapidly strengthened, becoming a hurricane on July 25. It then before hitting Texas later that day. The damage was bad, as a pandemic was growing at that time. ===Hurricane Isaias=== Isaias was a bad storm. It hit the Bahamas, before moving up the east coast of the United States, making landfall in North Carolina. Before the storm formed, it was broad and disorganized, but upon being named on July 30, Isaias became the earliest ninth named storm ever recorded. It then moved up into the Dominican Republic, and then into the Bahamas. It then traveled off the coast of the United States, and hit North Carolina. Isaias caused over $4.2 billion worth of damage. ===Tropical Depression Ten=== Tropical depression Ten formed on July 31, but failed to strengthen due to harsh conditions. The storm moved slowly, and dissipated on August 2. Some tropical storm force winds were found in the center of the system by the National Hurricane Center, but they said it was bloated. ===Tropical Storm Josephine=== Earliest tenth named storm. ===Tropical Storm Kyle=== Earliest eleventh named storm, breaking the record of Hurricane Katrina. ===Hurricane Laura=== On August 20, a tropical wave organized into a tropical depression. The next day, the depression, which was originally disorganized, strengthened into Tropical Storm Laura. Upon reaching tropical storm status, it became the earliest twelfth tropical storm in the Atlantic. The system then passed over the Leeward Islands, passing south of Puerto Rico. The system made landfall on the Dominican Republic, but the system had not lost any strength, despite the mountainous terrain. The system then made landfall in Cuba twice, before becoming a hurricane over the Gulf of Mexico on August 24. The storm underwent rapid intensification, becoming a category 2 hurricane on August 25. Laura became a major hurricane (Category 3) 9 hours later. The storm then became a Category 4 six hours later. Its highest winds were 150 mph. The storm hit Louisiana around that time. After going over Louisiana, the system quickly weakened, and lost its life over Kentucky. In Louisiana, buildings were damaged very badly by the storm. The highest winds were reported at 95 miles per hour in Lake Charles, along with a gust of 137 miles per hour also in Lake Charles. Damage was the worst in Lake Charles, where almost every house had a tarp on it to keep out rain after their roofs had been destroyed. Luckily, even though a push of water was supposed to be more than 15 feet in places, at last minute, it moved to the west, pushing all the water into places with fewer people. ===Hurricane Marco=== Earliest thirteenth named storm. ===Tropical Storm Omar=== Earliest fifteenth named storm. Very unusual track. ===Hurricane Nana=== Earliest fourteenth named storm. Formed after Omar, but strengthened into a tropical storm before Omar. ===Hurricane Paulette=== Earliest sixteenth named storm. It then made a very rare landfall in Bermuda, and then dissipated. After it dissipated, it became a tropical storm again. Because of this, people called it a \"zombie storm,\" because it came back after dissipating. ===Tropical Storm Rene=== Earliest seventeenth named storm. ===Hurricane Sally=== Earliest eighteenth named storm. Sally hit Alabama as a Category 2 with a peak intensity of 110 mph. ===Hurricane Teddy=== Earliest nineteenth named storm. This storm formed and eventually became a category 4, before weakening and hitting Newfoundland with winds 65 mph. === Tropical Storm Vicky === Earliest twentieth named storm. ===Tropical Storm Beta=== Earliest twenty-third named storm. ===Tropical Storm Wilfred=== Earliest twenty-first named storm. ===Subtropical Storm Alpha=== Earliest twenty-second named storm. Made an extremely rare landfall in mainland Europe. Made 2020 only the second season to use the Greek Alphabet. ===Hurricane Gamma=== Earliest twenty-fourth named storm. ===Hurricane Delta=== Earliest twenty-fifth named storm. Made landfall in Louisiana as a Category 2, causing catastrophic damage. ===Hurricane Epsilon=== Earliest twenty-sixth named storm. Fourth major hurricane of the season. ===Hurricane Zeta=== Earliest twenty-seventh named storm. Caused damage in the Southeast United States. Brought snow to New England. ===Hurricane Eta=== Earliest twenty-eight named storm. Became a powerful Category 4 hurricane. Struck Central America, Cuba, and Florida. ===Tropical Storm Theta=== On November 10, Subtropical Storm Theta formed, making the 2020 Atlantic hurricane season the busiest Atlantic hurricane season on record. The next day, the storm transitioned into a tropical storm, as it peaked with winds of 70 mph (110 km/h). The storm then weakened, but restrengthened to reach 65 mph (105 km/h), before weakening, and eventually dissipating on July 15. ===Hurricane Iota=== Hurricane Iota was a deadly and damaging storm that hit Central America on November 17. Forming in the Caribbean Sea, the storm strengthened a lot rapidly, becoming one of the latest Category 4 storms to form, reaching Category 4 status on November 16. ==Season effects== This is a table of all the storms that have formed in the 2020 Atlantic hurricane season. It includes their duration, names, landfall(s), denoted in parentheses, damages, and death totals. Deaths in parentheses are additional and indirect (an example of an indirect death would be a traffic accident), but were still related to that storm. Damage and deaths include totals while the storm was extratropical, a tropical wave, or a low, and all the damage figures are in USD. Potential tropical cyclones are not included in this table. ==Related pages== * Tropical cyclone * Atlantic hurricane ==References== Category:2020 Atlantic hurricane season Category:2020 disasters",
 "title": "2020 Atlantic hurricane season"
}