{
 "id": "77801",
 "text": "Scrambled eggs is a dish made from beaten whites and yolks of eggs (usually chicken). The dish often contains other ingredients. Cream, butter, milk, water or oil (used in China) will dilute the egg proteins to create a softer texture.McGee, 91 ==Sample recipe== The eggs and a large piece of butter are put into a saucepan over a low heat. The egg whites and egg yolks are then \"scrambled\" or mixed together. The mixture should be mixed together all the time they are being cooked. When cooked a little créme frâiche is added. This is because the eggs will be hot enough to carry on cooking themselves. Adding a cool liquid will stop the eggs from overcooking. Some salt and pepper or other seasoning can be added to taste as well. In the home the eggs can be mixed together first and then poured into a pan. The créme frâiche does not need to be added if the eggs will be eaten almost immediately. Properly made, the eggs should be moist and creamy consistency. If any liquid is coming from the eggs, it means the eggs have been overcooked or that the add the vegetables were undercooked.McBride, 887-888 ==Other methods of preparation== Using a double boiler or bain-marie means that the heat is constant, and does not to be adjusted to make sure the eggs do not brown or burn.Escoffier, 157McBride 888 The baine marie method is slower than cooking directly in a pan over a heat but makes it easier to cook the eggs perfectly. The eggs must be taken out of the bain marie when cooked, otherwise they will carry on cooking and spoil. Scrambled eggs may also be made in a microwave oven by put the ingredients in a glass bowl and cooking for 30 seconds then whisking, then cooking and whisking again until the desired consistency is achieved. ==Variations of Scrambled Egg Dishes== Many things can be added to scrambled eggs. Often the end result can have a different name, for example: *scrambled eggs à l'arlésienne (Scrambled eggs as made in the town of Arles, France)- add the diced, cooked pulp of courgettes (zucchini), a little garlic, and tomato fondue. Put the cooked eggand vegetable mixture into the hollowed, cooked courgettes shells, on an oiled gratin dish sprinkled with Parmesan cheese and brown the oven.Robuchon, 451 *scrambled eggs à l'américaine scrambled eggs in the American way - Add cubes of smoked bacon fried in butter to eggs.Robuchon, 17 *scrambled eggs Rossini named after the composer Rossini- Cook some scrambled eggs. Sauté some thin slices of foie gras in butter. Cook some sliced truffle in butter. Plate the scrambled eggs on a serving dish, garnish with foie gras and truffles, then coat with a very reduced Madeira demi-glace sauce.Robuchon, 998 ==Related pages== *List of egg dishes ==Notes== ==References== *Escoffier, Georges Auguste. Escoffier: The Complete Guide to the Art of Modern Cookery. Translated by H. L. Cracknell and R.J. Kaufmann. New York: John Wiley and Sons, 2002. *McGee, Harold. On Food and Cooking: The Science and Lore of the Kitchen. New York: Scribner, 2004. *Robuchon, Joël, Members of the Gastronomic Committee. Larousse Gastronomique. New York: Clarkson Potter/Publishers, 2001. ==Other websites== *An article on cooking scrambled eggs *Scrambled eggs recipe Category:Egg dishes Category:Breakfast foods",
 "title": "Scrambled eggs"
}