{
 "id": "778112",
 "text": "Caitlin Marie Lotz (born December 30, 1986), commonly known as Caity Lotz is an American actress, dancer, singer and director. She is best known for her role as Sara Lance in The CW series: Arrow, Legends of Tomorrow, The Flash, and Supergirl. ==Roles== ===Movies=== Year Title Role 2006 Bring It On: All or Nothing Pacific Vista Cheerleader 2012 Annie Barlow 2012 Cold & Ugly Tanya Pavelovna 2013 Ava/The Machine 2013 Battle of the Year Stacy 2013 Out of the Blue Dominique 2013 Live at the Foxes Den Susan Hudson 2014 Annie Barlow 2015 Missed Call Kirsten 2015 400 Days Dr. Emily McTier 2017 Small Town Crime Heidi 2018 Year One Tess ===Television=== Year Title Role Notes 2004–2005 Dance 360 Herself Contestant 2010 Law & Order: LA Amy Reynolds Episode: \"Harbor City\" 2010–15 Mad Men Stephanie Horton Recurring role, 5 episodes 2011 Death Valley Officer Kirsten Landry Main role 2012 NTSF:SD:SUV:: Mary Episode: \"Lights, Camera, Assassination\" 2013–2020 Arrow Sara Lance / The Canary / White Canary Recurring role (seasons 2–4); special guest star (seasons 5–8) 2014 Stalker Melissa Barnes Episode: \"Love Is a Battlefield\" 2016 Robot Chicken Voice role Episode: \"Fridge Smell\" 2016–present Legends of Tomorrow Sara Lance / White Canary Main role (season 1) Lead role (seasons 2-present) 82 episodes Director (1 episode) Nominated Teen Choice Award for Choice Action TV Actress (2017) 2016–2017, 2019 The Flash Sara Lance / White Canary Special guest star, 3 episodes 2017, 2019 Supergirl Sara Lance / White Canary Special guest star, 2 episodes 2019 Batwoman Sara Lance / White Canary Episode: \"Crisis on Infinite Earths, Part 2\" ==Awards == Year Award Category Nominated work Result Ref. 2013 British Independent Film Awards Most Promising Newcomer The Machine 2013 Toronto After Dark Film Festival Best Actress The Machine 2017 Teen Choice Awards Teen Choice Award for Choice TV Actress Action Legends of Tomorrow 2018 Teen Choice Awards Teen Choice Award for Choice TV Actress Action Legends of Tomorrow ==References== ==Other websites== * * Category:1986 births Category:American movie actors Category:American television actors Category:Living people Category:Models from San Diego Category:Actors from San Diego",
 "title": "Caity Lotz"
}