{
 "id": "778390",
 "text": "\"Bart's Friend Falls in Love\" is the 22nd episode of the 3rd season of The Simpsons. It was first shown on television on May 7, 1992. In the episode, Bart's friend Milhouse gets a girlfriend named Samantha Stankey. Bart gets jealous and tells Samantha's father about the relationship. Samantha's father sends her to a different school that only allows girls. While this happens, Homer tries to lose weight using a subliminal stimuli cassette tape. However, Homer is given a tape about using better vocabulary instead. The beginning of the episode is a parody of the movie Raiders of the Lost Ark. The end of the episode is a parody of the movie Casablanca. == Story == Milhouse shows Bart his new toy, a Magic 8-Ball. Bart asks the Magic 8-Ball if he and Milhouse will still be friends at the end of the day. The Magic 8-Ball says that they will not. A girl from Phoenix, Arizona named Samantha Stankey becomes a new student at the Springfield Elementary School. Milhouse falls in love with Samantha. When school is over, Milhouse brings Samantha to Bart's treehouse and kiss each other. Milhouse does not spend time with Bart anymore. This makes Bart feel jealous and left out. Bart tells Samantha's father about her relationship. Samantha's father gets angry at her and puts her in a catholic school that is for girls. Bart starts to feel guilty when he sees that Milhouse is very sad, so he tells Milhouse that he told Samantha's father about the relationship. Milhouse gets very angry and fights Bart. When they calm down, they go to the school that Samantha has been put in. Samantha loves the new school, but she still loves Milhouse. She kisses Milhouse, knowing that she will get punished for doing so. While this happens, Lisa thinks that Homer is too obese. Marge orders a cassette tape that will subliminally get Homer to lose weight. However, they are given a tape on how to have better vocabulary. Homer has been using more complex words, but he is also getting more weight. When Homer finds out that the tape is only making him more obese, he throws the tape away and no longer uses complex words. == Reception == Colin Jacobson of DVD Movie Guide said that the episode is a \"keeper\". He says that the episode \"gets into pre-teen emotions but never becomes sappy.\" He also says that the other story with Homer \"provides terrific laughs as well.\" Nate Meyers of Digitally Obsessed thought it was tough to see Milhouse in a relationship, but said \"Still, the love triangle makes for some interesting drama\". Bill Gibron of DVD Verdict thought that the main story was \"drawn out\" but liked the story with Homer. Nathan Ditum of Total Film and Colin Kennedy of Empire said that the episode's parody of Raiders of the Lost Ark is the best movie parody of the show. == References == == Other websites == * * * Category:The Simpsons (season 3) episodes Category:1992 television episodes",
 "title": "Bart's Friend Falls in Love"
}