{
 "id": "778389",
 "text": "Gustaf Caspar Orm Skarsgård (born 12 November 1980) is a Swedish actor. He is best known outside Scandinavia for his role as Floki in the History Channel series Vikings as well as for his roles in the movies Evil (2003), The Way Back (2010), Kon-Tiki (2012) and Oppenheimer (2023). He also played Karl Strand in the second season of the HBO series Westworld. == Early life == Gustaf Skarsgård was born in Stockholm, Sweden, to Swedish actor Stellan Skarsgård and his first wife, My, a physician. He has five siblings: Alexander, Sam, Bill, Eija and Valter, and two half-brothers Ossian and Kolbjörn from his father's second wife, Megan Everett. Alexander, Bill, and Valter are also actors. His godfather is Swedish actor Peter Stormare. == Career == In 1989, as a nine-year-old, Gustaf Skarsgård acted in the Swedish Film Codename Coq Rouge. After attending Teaterhögskolan in Stockholm from 1999 to 2003, Gustaf Skarsgård joined the Royal Dramatic Theatre. He played in several of Shakespeare’s, Chekhov's and Söderberg’s works both on the Royal Dramatic Theatre and on Stockholm City Theatre. In 2003 he performed in Evil and 2008 in Patrik 1,5. For both roles he was nominated for the Guldbagge Awards as Best Supporting Actor and as Best Leading Actor. Finally, he received the prize as Best Leading Actor for his role in Förortsungar. In 2012, Skarsgård joined the History Channel's series Vikings in the role of Floki, the shipbuilder. == Personal life == Gustaf Skarsgård was in a long term relationship with actress Hanna Alström from 1999 to 2005. == Awards and distinctions == Skarsgård won a Guldbagge Awards for Kidz In da Hood. He won the European Film Academy’s Shooting Stars Award in 2007. == Notes == == References == == Other websites == * * Category:1980 births Category:Swedish movie actors Category:Swedish television actors Category:Swedish stage actors Category:Swedish voice actors Category:Actors from Stockholm Category:Living people",
 "title": "Gustaf Skarsgård"
}