{
 "id": "778466",
 "text": "All Japan Student Go Federation (全日本学生囲碁連盟) is a Japanese student Go organization for holding university Go championships. They have branches in each regions (Kanto,Kanto Student Go Association Kansai, Kyushu,Kyushu Student Go Association TohokuTohoku Student Go Association etc.). ==Differences with other organizations== In Japan, most Go tournaments are held by Nihon Ki-in or Kansai Ki-in. All Japan Student Go Federation and their branches are made for student games. They are not under direct control but have close relation with them. ==Tournaments== They are holding various tournaments with corporate sponsors.Pandanet (online Go gaming company)Go & Shogi TV Channel ===World Students Go Oza Championship=== This is a game to give the student world champion trophy since 2003.World Students Go Oza Championship at Sensei's LibraryWorld Students Go Oza Championship records by the American Go AssociationOza (王座) means King or Throne in Japanese. Players from each region (including Taiwan, Europe, Oceania etc.) will compete. The expected games in 2020 have been cancelled due to the COVID-19 outbreak. ===All Japan University Go Championship=== This is a team competition by each university. Teams that have cleared regional preliminaries can attend. Each team can send only 5 members and substitutes. The sponsor is Yomiuri Newspaper (as same as Yomiuri Giants). ===All Japan Female Student Honinbo=== This is the only one game that limits participants by gender. The sponsor is Mainichi Newspaper. Some winners have eventually obtained professional status, or became top amateur players. Season Year Winner 32 1997 Tomomi Hoshino (Waseda) 33 1998 Fu Hong Mei (Dokkyo)Fu Hong Mei at Nihon Ki-in 34-35 1999-2000 Mizuyo Kamasaki (Hiroshima) 37 and 40 2002 and 2005 Miki Aragaki (Waseda)Miki Aragaki at Sensei's Library 38 2003 Marie Unegawa (Waseda) 39 2004 Kozue Takakura (Chuo) 41 2006 Risa Sasago (Waseda) 42 2006 Wang Jing Yi (Hosei)Wang Jing Yi at Nihon Ki-in 43 2007 Yin Shanchun (尹善渶, Keio) 44-46 2008-2010 Reiko Sekine (Taisho)Nihon Ki-in News in 2010 47 2011 Noriko Horimoto (Ritsumeikan) 48 2012 Go Risa (Ritsumeikan) 49 2013 Yuka Kimoto (Hoso) 50-51 2014-2015 Karin Tsukada (Ritsumeikan) 52-54 2016-2018 Akiko Fujiwara (Waseda)Waseda Weekly interview in 2018Tournament report article in 2018 by Asahi ShinbunAkiko Fujiwara at Sensei's Library 55 2019 Moeka Tsuji (Keio) ===All Japan Student Go Best 10=== This is the only one game that allows the attendance of high school and graduate students. It is held since 1964. The sponsor is Asahi Shinbun. ==References== ==Other websites== * Official Website * Official Blog * American Collegiate Go Association , similar organization in the United States. category:1957 establishments in Asia category:1950s establishments in Japan Category:Go organizations Category:Sports organizations of Japan",
 "title": "All Japan Student Go Federation"
}