{
 "id": "778664",
 "text": "Sky Sport News (until August 4th 2020: Sky Sport News HD) is Germany and Austria's only 24-hour sports news channel, owned by Sky Sport Deutschland. The channel's format shows rolling news bulletins, updated every 15 minutes. It broadcasts live from 9am to midnight. There are three teams of presenters on air daily. SSNHD launched on 1 December 2011, at midday. The first on-air presenters were Kate Abdo and Thomas Fleischmann. In 2016 Sky Deutschland announced that the channel would a become free-to-air channel and would be streamed in Germany. The first free-to-air broadcast was a match between Mainz and Bayern. The channel now has more content. Alongside rolling news, it also broadcasts highlights, documentaries and magazine shows, all relating to sport. It is only allowed to broadcast 12 minutes of ads every hour. In 2017, Sky reduced the channel's broadcast hours by three hours to fifteen hours. On 12 March 2017 Sky Sport News HD started streaming. On 5 August 2020 the station changed its name to Sky Sport News. DWDL.de: Karl Valks über das neue Sky Sport News - \"Es war dringend an der Zeit für einen Refresh\"Digitalfernsehen.de: Sky Sport News mit neuem Studio und Design == Presenters == News bulletins are always anchored by one man and one woman. === Men === * Thomas Fleischmann * Andreas Poll * Noah Pudelko * Bjorn Schwernin * Gregor Teicher * Martin Winkler * Johannes Zenglein === Women === * Silke Beickert * Anna Noe * Viola Weiss * Slyvia Walker * Claudia von Brauchitsch * Karolin Kandler == Live news prgrammes == * 1/2011-12/2016: Nightline (1-7am), Guten Morgen Fans (7-9am), Nonstop (9am-Noon & 2-6pm), Mittagsreport (Noon-2pm), 360° (6-8pm), Prime Time (8-11pm) and 360° @ Night (11pm-1am). * 12/2016-6/2017: Nachtreport (1-7am), Vormittagreport (7-11am), Mittagreport (11am-2pm), Nachmittagreport (2-5pm), Abendreport (5-9pm) and Spätreport (9pm-1am) * From 6/2017: Nachtreport (12-6am), Frühreport (6-9am), Vormittagreport (9-11am), Mittagreport (11am-2pm), Nachmittagreport (2-5pm), Abendreport (5-9pm) and Spätreport (9pm-12am). * Special magazines: Inside Report (weekdays 6:30-7pm) and 08000 - du bist dr@uf! (Saturday 5-7:30pm). ==References== Category:Television channels in Germany Category:2011 establishments in Europe Category:Austrian culture",
 "title": "Sky Sport News"
}