{
 "id": "778847",
 "text": "Cassegrain telescopes are reflector telescopes that use two curved mirrors to make an image. The big primary mirror gathers and concentrates light. The small secondary mirror then reflects the light through the back of the mirror. The secondary mirror is also curved so that it the light path is longer than the tube. A \"true Cassegrain\" uses a primary mirror with a parabola-shaped curve, and a secondary mirror with a hyperbola-shaped curve. This is hard to make. Sphere-shaped curves are easier to make, but the image would be blurry. Catadioptric (lens and mirror) telescopes fix this by putting a special lens in front of the telescope. Cassegrains are useful both as amateur telescopes which normal people can buy, and for scientists for serious astronomy work. == Types of Cassegrain telescopes == Lots of telescopes which are similar to cassegrains have been invented. Here are a few. * Schmidt-Cassegrain (SCT): The primary mirror has a spherical curve. This is corrected by a thin corrector lens in front. * Maksutov-Cassegrain (Mak): The primary and secondary mirrors both have spherical curves. This time a special \"meniscus\" type lens is used to correct it. Sometimes the secondary mirror is just a shiny spot on the meniscus lens. This is cheaper to make than an SCT because all of the lenses and mirrors have spherical curves. * Ritchey-Chrétien (RCT): Both mirrors have hyperbola-shaped curves. This makes the stars sharp points even at the edge of the view. Most big telescopes made by scientists are RCTs, including the Hubble Space Telescope. * Dall-Kirkham (DK): The primary mirror is a parabola-shaped curve. The secondary is a spherical-shaped curve. It's easier to make than an RCT, but the stars at the edge are blurry. Lenses can be put at the back of the telescope to fix the blurry stars. That would be a Corrected Dall-Kirkham (CDK) * Schiefspeigler (Chief): The mirrors are tilted so that the secondary mirror is not in front of the primary mirror. There's also no hole in the back of the primary. This gives brighter images, but there's also distortion from tilting the mirrors. Category:Telescopes",
 "title": "Cassegrain telescope"
}