{
 "id": "778953",
 "text": "Leonard Deadwyler (February 19, 1941 – May 7, 1966) was an African-American man who was shot and killed by LAPD officer Jerold M. Bova after allegedly speeding and running red lights while driving his wife, who was in labor, to the hospital. His wife later sued Los Angeles for wrongful death, and was represented by Johnnie Cochran, but lost the case. However, Deadwyler's death inspired the building of Martin Luther King, Jr. Community Hospital in South Central. == Life == Deadwyler was born on February 19, 1941 in Gainesville, Georgia. He was the oldest of three children. He met his wife Barbara (nee, Buffington) in Kindergarten and they married in 1960. Shortly after, they moved to Kansas then Chattanooga, Tennessee and finally, Los Angeles. The Deadwylers had two children together. At the time of his death, Barbara Deadwyler was pregnant with their youngest son, Michael. == Shooting == Barbara Deadwyler, Leonard's wife was 8 months pregnant and began experiencing what she believed to be labor pains. Deadwyler tied a white handkerchief to the car's antenna, to signify an emergency, a common sign in Georgia, where the couple had moved from a year earlier. While driving, Deadwyler ran through several red lights while speeding, causing a police chase that began at 108th St. and Avalon Blvd., which he mistook as a police escort. Bova eventually pulled the car over at 60th St. and Avalon, where he approached Deadwyler with his gun drawn and leaned into the car. Bova testified that the car lurched forward, causing his gun to go off and shoot Deadwyler at point blank range. Deadwyler's wife stated that no such movement had taken place and that Bova \"shot him for no reason.\" == Investigation and inquest == During testimony, the State proffered that Deadwyler had a .35 blood-alcohol level and was drunk. His widow refuted this, as he had not been drinking and an alcohol level that high would make it very difficult for an individual to function and drive safely at a high speed. Bova testified that the car had lurched forward while the defense argued that it would be near impossible as the car had been parked behind another vehicle. On May 31st, 1966 a coroner's jury ruled Deadwyler's death an accidental homicide, with one juror calling it an \"excusable homicide.\" The jury, who deliberated for two hours and thirty-five minutes consisted of eight men and one female. Only one member of the jury was black. At the time, it was the longest inquest over the death of a single individual in the Los Angeles County Coroner's office lasting eight days with testimony from 49 witnesses and 87 exhibits and the first televised inquest in California. ==References== Category:1941 births Category:1966 deaths Category:People shot and killed by law enforcement officers in the United States",
 "title": "Shooting of Leonard Deadwyler"
}