{
 "id": "77930",
 "text": "Publius (or Gaius) Cornelius Tacitus (ca. 56 – ca. 117) was a senator and a historian of the Roman Empire. The surviving parts of his two major works—the Annals and the Histories—report about the reigns of the Roman Emperors Tiberius, Claudius, Nero, Galba, Otho, Vitellius, and Vespasian. == Works == Experts believe Tacitus wrote these five works that have survived. The dates are approximate: * (98) De vita Iulii Agricolae (The Life of Julius Agricola) * (98) De origine et situ Germanorum (The Germania) * (102) Dialogus de oratoribus (Dialogue on Oratory) * (105) Historiae (Histories) * (117) Ab excessu divi Augusti (Annals) == References == * Haynes, Holly. The History of Make-Believe: Tacitus on imperial Rome (Berkeley, Calif.; London: University of California Press, 2003) * Syme, Ronald. Tacitus, Volumes 1 and 2. (Oxford: Oxford University Press, 1958) (reprinted in 1985 by the same publisher, with the ) is the definitive study of his life and works. * Syme, Ronald. Ten Studies in Tacitus. (Oxford: Oxford University Press, 1970) * Talbert, R.J.A. \"Tacitus and the Senatus Consultum de Cn. Pisone patre\". The American Journal of Philology, Vol. 120, No. 1 (1999), pp. 89–97. * Woodman, Anthony John. Tacitus Reviewed (Oxford: Oxford University Press, 1998) == Other websites == * Bibliography on Tacitus (from Rutgers University Classics Department) * Texts by Tacitus: ** ** Works by Tacitus at the Internet Archive ** At Perseus Project: Works by Tacitus in English and/or Latin ** At \"The Online Books Page\": Online e-texts of Tacitus' works ** At \"Romansonline\" (Latin text can be displayed side by side to translation): Works by Tacitus ** At \"The Internet Sacred Text Archive\": Parallel English and Latin text of the complete works of Tacitus ** Works by Tacitus: text, concordances and frequency list ** About Tacitus' Agrippina on QueenDido.org Category:110s deaths Category:Ancient Roman historians Category:50s births",
 "title": "Tacitus"
}