{
 "id": "779400",
 "text": "Studley Royal Park (including the Ruins of Fountains Abbey) is a UNESCO- designated World Heritage Site in North Yorkshire, England. It has an area of 323 hectares (800 acres) and features an 18th-century landscaped garden, some of the largest Cistercian ruins in Europe, a Jacobean mansion, and a Victorian church designed by William Burges. == History == === Fountains Abbey and Hall === Fountains Abbey was founded in 1132 by Benedictine monks who left St Mary's Abbey, York to follow the Cistercian order. After the end of the monasteries in 1539 by Henry VIII, the Abbey buildings and over 500 acres (200 ha) of land were sold by the Crown to a merchant named Sir Richard Gresham. The property was passed down through several generations of Sir Gresham's family. Between 1598 and 1604, it was sold to Stephen Proctor, who built Fountains Hall. The hall is a Jacobean mansion, built partly with stone from the Abbey ruins. Fountains Abbey mill is the only 12th-century Cistercian cornmill left in the UK and the oldest 'intact' building on the estate. === Studley estate === From 1452 onwards, Studley Royal was inhabited by the Mallory family, most notably by MPs John Mallory and William Mallory. John Aislabie inherited the Studley estate from his elder brother in 1693. In 1966 the estate was bought by West Riding County Council and was taken over by the National Trust in 1983. === Studley Royal House === Studley Royal House (or Hall) is in the north-west corner of the park. Originally a medieval manor house, it has a main block with forward projecting wings. It burned down in 1716 and was rebuilt by John Aislabie. The building was destroyed by fire in 1946. A large stable block, built between 1728 and 1732, survived and is now a private house ( 54° 7'30.55\"N 1°34'34.82\"W ). === Recent history === In 1966, the estate was purchased by West Riding County Council and was acquired by the National Trust in 1983. The Abbey precinct is managed by English Heritage on behalf of the National Trust. In 1986 the entire Park was designated a World Heritage Site by UNESCO. It is considered “a masterpiece of human creative genius, and an outstanding example of a type of building or architectural or technological ensemble or landscape which illustrates significant stages in human history”. Since 1994 the estate has been within the Nidderdale Area of Outstanding Natural Beauty. == References == == Other websites == * Category:Parks in the United Kingdom Category:World Heritage Sites in the United Kingdom Category:North Yorkshire",
 "title": "Studley Royal Park"
}