{
 "id": "779406",
 "text": "Waltheof, Earl of Northumbria (died 31 May 1076) was the last Anglo-Saxon earl. He was the only English aristocrat to be executed during the reign of William I. == Early life == Waltheof was the second son of Siward, Earl of Northumbria. His mother was Aelfflaed, daughter of Ealdred, Earl of Bernicia, son of Uhtred, Earl of Northumbria. In 1054, Waltheof became the heir of his father's throne as his elder brother Osbearn was killed in battle. Siward died in 1055, and Waltheof being far too young to succeed as Earl of Northumbria, King Edward appointed Tostig Godwinson to the earldom. == First revolt == When Sweyn II invaded Northern England in 1069, Waltheof and Edgar Aetheling joined the Danes and took part in the attack on York. He would again make a fresh submission to William after the departure of the invaders in 1070. He was restored to his earldom and went on to marry William's niece, Judith of Lens. In 1072, he was appointed Earl of Northampton. Waltheof had many enemies in the north. Amongst them were members of a family who had killed Waltheof's maternal great-grandfather, Uchtred the Bold, and his grandfather Ealdred. This was part of a long-running blood feud. In 1074, Waltheof moved against the family by sending his retainers to ambush them and succeeded in killing the two eldest of four brothers in the family. == Second revolt and death == In 1075 Waltheof joined the Revolt of the Earls against William I. His motives for taking part in the revolt are unclear, as is the depth of his involvement. However he repented, confessing his guilt first to Archbishop Lanfranc and then in person to William I, who was at the time in Normandy. He returned to England with William but was arrested, brought twice before the king's court and sentenced to death. == Cult of martyrdom == In 1092, after a fire in the chapter house, the abbot had Waltheof's body moved to a prominent place in the abbey church. When the coffin was opened, it is reported that the corpse was found to be intact with the severed head re-joined to the trunk.Webb, Diana Pilgrimage in Medieval England Hambledon and London 2000 pp32-3 This was regarded as a miracle, and the abbey began to publicise it. As a result, pilgrims began to visit Waltheof's tomb. He was celebrated on 31 August. Due to the beliefs in the miracle, Waltheof became the subject of popular media. His heroic yet often inaccurate accounts were preserved in the Vita et Passio Waldevi comitis,'Vita et Passio Waldevi Comitis' (with the Miracula), in F. Michel (ed.), Chroniques Anglo-Normandes, Vol. II (Éduard Frère, Rouen 1836), pp. 99-142 (Internet Archive). a Middle English Waltheof saga, and the Anglo- Norman Waldef.A.J. Holden (ed.), Le Roman de Waldef, Bibliotheca Bodmeriana, Textes, 5 (Coligny-Genève, Fondation Martin Bodmer 1984). == Personal life == In 1070 Waltheof married Judith de Lens, daughter of Lambert II, Count of Lens and Adelaide of Normandy, Countess of Aumale. They had three children, the eldest of whom, Maud, brought the earldom of Huntingdon to her second husband, David I of Scotland, and another, Adelise (Alice of Nothumbria) married the Anglo-Norman noble Raoul III of Tosny. One of Waltheof's grandsons was Waltheof (died 1159), abbot of Melrose. == In popular culture == * Waltheof was portrayed by actor Marcus Gilbert in the TV drama Blood Royal: William the Conqueror (1990). * Waltheof is the subject of Juliet Dymoke's 1970 historical novel Of the Ring of Earls * Waltheof is a major character in Elizabeth Chadwick's 2002 historical novel The Winter Mantle * Waltheof is a character in Parke Godwin's 1991 historical novel Sherwood == References == == Notes == * * Chronicle of Britain * * == Other websites == Category:1050 births Category:1076 deaths Category:Earls and countesses Category:People from Northumbria",
 "title": "Waltheof, Earl of Northumbria"
}