{
 "id": "779469",
 "text": "Fountains Abbey is one of the largest and best preserved ruined Cistercian monasteries in England. It is sits approximately south-west of Ripon in North Yorkshire. It was founded in 1132 and operated for 407 years. It one of the wealthiest monasteries in England until it was dissolved in 1539, under the order of Henry VIII. It is a Grade I listed building owned by the National Trust. It is part of the designated Studley Royal Park including the Ruins of Fountains Abbey. It is one of the recognised World Heritage Site by UNESCO. == Foundation == After a riot in 1132 at the Benedictine abbey of St Mary's in York, 13 monks were expelled. Among them was Saint Robert of Newminster. They were taken under the protection of Thurstan, Archbishop of York. He provided them with land in the valley of the River Skell, which is a tributary of the Ure. The enclosed valley had all the natural features needed for the creation of a monastery. It provided shelter from the weather as well as stone and timber for building. It also had a good supply of running water. After a harsh winter in 1133, the monks applied to join the Cistercian order. At that time, it was a fast-growing reform movement. By the beginning of the 13th century, it had over 500 houses. In 1135, Fountains became the second Cistercian house in northern England, just after Rievaulx. The Fountains monks were under Clairvaux Abbey, in Burgundy. It was under the rule of St Bernard. Under the guidance of Geoffrey of Ainai, a monk sent in from Clairvaux, the group learned how to celebrate the seven Canonical Hours. According to Cistercian usage, they were shown how to construct wooden buildings in accordance with Cistercian architecture.Brian Patrick McGuire (ed.), A Companion to Bernard of Clairvaux, Brill, Leiden, 2011, p. 198. == Architecture == The abbey precinct covers and is surrounded by an wall. The wall was built in the 13th century. Some parts of it are visible to the south and west of the abbey. The precinct can be divided into different groups of buildings. The central group is the abbey church, the cloister, and the buildings round the cloister. This was where the monks lived, prayed, ate, slept, and worked. The inner court has other buildings for the daily life of the abbey. These are buildings such as the infirmary, the abbot's house, and guest houses for visitors. The infirmary was a place where monks could stay when they were ill. The outer court had buildings for farming and industry, such as the watermill and the wool house. Over the years Fountains Abbey became very rich, mostly by selling wool. The original abbey church was built of wood and \"was probably\" two stories high. It was, however, quickly replaced with stone. The church was damaged in the attack on the abbey in 1146 and was rebuilt as a larger church on the same site. Building work was completed c.1170. This second church was completed around 1170. It was long , made up of 11 bays. The infirmary (marked \"Abbots House\" on the plan) had one of the largest halls in England in the middle ages , It had its own chapel and kitchens. Parts of it are on top of tunnels where the River Skell flows. == Becoming a World Heritage Site == The archaeological excavation of the site began under the supervision of John Richard Walbran. In 1846, he published a paper On the Necessity of clearing out the Conventual Church of Fountains. In 1966, the Abbey was placed in the guardianship of the Department of the Environment and the estate. It was purchased by the West Riding County Council, which later transferred its ownership to the North Yorkshire County Council in 1974. The National Trust bought the Fountains Abbey and Studley Royal estate from North Yorkshire County Council in 1983. In 1986 the parkland in where the abbey stands was designated a World Heritage Site by UNESCO. It was recognised for fulfilling the criteria of \"being a masterpiece of human creative genius\". It was described \"as an outstanding example of a type of building or architectural or technological ensemble or landscape which illustrates significant stages in human history\". Fountains Abbey is owned by the National Trust and maintained by English Heritage. The trust owns Studley Royal Park, Fountains Hall, St Mary's Church, which was designed by William Burges and built around 1873. All of them are significant features of the World Heritage Site. In January 2010, Fountains Abbey and Studley Royal became two of the first National Trust properties to be included in Google Street View, using the Google Trike. == Film location == Fountains Abbey was used as a film location by Orchestral Manoeuvres in the Dark for their single \"Maid of Orleans (The Waltz Joan of Arc)\" during the cold winter of December 1981. In 1980, Hollywood filmed its final scenes to the film Omen III: The Final Conflict. Other productions set on location of the abbey include: Life at the Top, The Secret Garden, The History Boys. Television series such as Flambards, A History of Britain, Terry Jones' Medieval Lives, Cathedral, Antiques Roadshow. Several game shows such as Treasure Hunt The BBC Television series Gunpowder (2017) also used Fountains Abbey as a location. == Literature == Fountains Abbey was featured twice in Fisher's Drawing Room Scrap Books. It includes poetical illustrations by Letitia Elizabeth Landon. == Gallery == File:Fountains Abbey Exterior.jpg|Exterior File:Fountains Abbey Corridor.jpg|Corridor File:Fountains Abbey view02 2005-08-27.jpg|Viewed from the west File:Fountains Abbey.jpg|Exterior of Fountains Abbey from the north- west facing the south-east File:StudleyAbbey2.JPG|Exterior of Fountains Abbey, with focus on tower File:Stone Mason marks as seen in the Chapter House of Fountains Abbey.jpg|Stonemason marks in the Chapter House File:Monks' cellarium, Fountains Abbey.jpg|The monks' cellarium (where food was stored) File:Cloister portal at Founain Abbey.JPG|Cloister portal at Fountains Abbey File:Fountain Abbey grounds from the Infirmary.JPG|Fountain Abbey grounds from the Infirmary File:Cellarium.JPG|Vaulted cellarium used as food storage File:East end of the Abbey church.JPG|Remains of the east end of the Abbey church == Related pages == * Stonemasonry * Studley Royal Park == References == == Other websites == * * Fountains Abbey & Studley Royal Water Garden information at the National Trust * UNESCO World Heritage List: Studley Royal Park including the Ruins of Fountains Abbey Category:Monasteries Category:World Heritage Sites in the United Kingdom Category:12th-century buildings and structures Category:Buildings and structures in North Yorkshire",
 "title": "Fountains Abbey"
}