{
 "id": "779529",
 "text": "Princess Ingrid Alexandra of Norway (born 21 January 2004) is the elder child of Crown Prince Haakon and Crown Princess Mette-Marit. She is second in line to succeed her grandfather King Harald V. She is a member of the House of Glücksburg; and she is expected to become the country's second female monarch, after the 15th-century Queen Margaret. ==Birth and baptism== Princess Ingrid Alexandra was born on 21 January 2004 at 9:13 am in The National Hospital, part of the Oslo University Hospital in Oslo. She is the first child and only daughter of Crown Prince Haakon, heir apparent to the throne, and the second granddaughter of King Harald V and Queen Sonja. Her mother, Crown Princess Mette-Marit, has a son named Marius Borg Høiby, born in 1997 from a previous relationship. Ingrid Alexandra was baptised by Bishop Gunnar Stålsett in the chapel of the Royal Palace on 17 April 2004. Her godparents were her grandfather the King, her aunt Princess Märtha Louise, the Crown Prince of Denmark, the Crown Princess of Sweden, the then Prince of Asturias, and her maternal grandmother, Marit Tjessem. On 31 August 2019, Ingrid Alexandra was confirmed in the Palace Chapel in Oslo.Princess confirmed The Royal House of Norway, 31 August 2019Princess Ingrid Alexandra's confirmation: The Princess' speech of thanks The Royal House of Norway, 31 August 2019 ==Education == Ingrid Alexandra started her first day of school on 19 August 2010 at Jansløkka elementary school, a local state school attended by her half- brother. School officials hoped to make the school a place where the princess could make friends and enjoy some relief from public scrutiny. On 17 June 2014, the Norwegian Royal Family announced that from the start of the 2014–2015 school year, Princess Ingrid Alexandra would move to the private English-language Oslo International School, reportedly because her parents wanted her to be fluent in English. Princess Ingrid Alexandra was transferred to Oslo's Uranienborg School to complete her lower secondary education. In the fall of 2020, she is scheduled to start at Elvebakken Upper Secondary School in Oslo. == Titles == * 21 January 2004-present: Her Royal Highness Princess Ingrid Alexandra of Norway, Her Royal Highness The Princess == Honors == === National Honors === * Norway: Grand Cross of the Royal Norwegian Order of St. Olav (21 January 2022) * Norway: Recipient of the Royal Family Order of King Harald V (21 January 2022) * Norway: Recipient of the Royal House Centennial Medal (25 November 2005) * Norway: Recipient of King Harald V’s Jubilee Medal (1991-2016) (17 January 2016) === Foreign Honors === * Denmark: Knight of the Order of the Elephant (21 January 2022) == References == Category:2004 births Category:Living people Category:House of Glücksburg (Norway) Category:Norwegian princesses Ingrid Category:Norwegian surfers Category:People from Oslo",
 "title": "Princess Ingrid Alexandra of Norway"
}