{
 "id": "779736",
 "text": "The A16, also called L'Européenne (The European) in French, is an autoroute (motorway) in France. It goes between Paris and the border with Belgium near Ghyvelde. It goes through Amiens, Calais and Dunkirk. It is part of the European route E40. The autoroute is about long in total. ==Exits and junctions== Junction number & name Northbound exits Southbound exits 8 RN1, RN104, RD909, RD78 Montsoult, RN1, RN104, Attainville, Moisselles, RD301, RD9, RD 64E, Presles Northbound Exit only 10 RN1, RN184, Presles RN1, RN184 RD 922, RN1, L'Île-Adam, Mours, Beaumont-sur-Oise RD 922, RN1, L'Île-Adam, Mours, Beaumont-sur-Oise RD 924, Persan, Chambly RD105, Méru RD105, Méru Beauveais sud RN1, Beauvais RN1, Beauvais 15 Beauvais RN31, Beauvais RN31, Beauvais 16 RD930, Breteuil, Hardivillers-en-Vexin RD930, Breteuil, Hardivillers-en-Vexin 17 A29 A29 RN29, Amiens, Salouël RN29, Amiens, Salouël 28.1 A29 A29 Amiens Amiens RN1, Amiens RN1, Amiens RN1, Ville-le-Marclet RN1, Ville-le-Marclet Abbeville est RD925, Abbeville RD925, Abbeville 23 Abbeville nord A28 A28 Côte Picarde RN1, RD32 Forest-Montiers, Nouvion RN1, RD32 Forest-Montiers, Nouvion RD303 Berck-Plage RD303 Berck-Plage RN39, Le Touquet, Étaples RN39, Le Touquet, Étaples RD308, Neufchâtel-Hardelot RD308, Neufchâtel-Hardelot Boulogne sud RN1, Boulogne-sur-Mer, Hesdin-l'Abbé, Isques RN1, Boulogne-sur- Mer, Hesdin-l'Abbé, Isques Boulogne ports RN1, Boulogne-sur-Mer, Outreau, Le Portel RN1, Boulogne-sur-Mer, Outreau, Le Portel RD341, Boulogne-sur-Mer, Saint-Martin-Boulogne Boulogne est RN42, Boulogne-sur-Mer RN42, Boulogne-sur- Mer Boulogne nord Boulogne-sur-Mer Boulogne-sur-Mer RD940, Wimereux, Wimille RD940, Wimereux, Wimille Wacquinghen 35 RD241, Marquise RD191, Marquise RD191, Marquise 37 Saint-Inglevert Saint-Inglevert RD243, Bonningues-lès- Calais RD243, Bonningues-lès-Calais RD215, Peuplingues, Fréthun RD215, Peuplingues, Fréthun Coquelles, Sangatte Coquelles, Sangatte Tunnel Channel Tunnel Channel Tunnel Calais centre RD305, Calais RD305, Calais Calais st- pierre Calais Calais Entrance only RN43, Calais RN43, Calais 47 A26 A26 RD247, Marck RD247, Marck Marck Marck RD219, Nouvelle-Eglise RD219, Nouvelle- Eglise RD218, Saint-Folquin, Gravelines RD218, Saint-Folquin RD11, Saint- Georges-sur-l'Aa RD11, Bourbourg Gravelines RN316, Loon-Plage Dunkirk Port/Car Ferry RD300, Bourbourg St. Omer, Port/Car Ferry RD131, Grande-Synthe, Dunkirk- Ouest RD131, Spycker No northbound exit Polyclinique de Grande-Synthe Grande- Synthe Centre Grande-Synthe Centre RD625, RN225 Lille, Grande-Synthe RD625, RN225 Lille RD2020V Petite-Synthe, Saint-Pol-Sur-Mer RD2020V, Petite-Synthe, Sainte-Pol-Sur-Mer No northbound exit RD202, Dunkirk Centre RD916, Dunkirk Centre, Cappelle-La-Grande RD916, Dunkirk Centre, Cappelle-La-Grande Dunkirk, Coudekerque-Branche Dunkirk Coudekerque-Branche RD635, Dunkirk-Est RD635, Dunkirk-Est RD4, Leffrinckoucke, Teteghem RD4, Leffrinckoucke, Teteghem No northbound exit RD79, Leffrinckoucke, Uxem RD947/947a, Bray-Dunes , Ghyvelde, Les Moeres RD947/947a, Bray-Dunes, Les Moeres ==References== Category:Autoroutes in France",
 "title": "A16 autoroute"
}