{
 "id": "779785",
 "text": "The Old Town () is oldest part of Edinburgh. It preserved much of its medieval street plan and buildings. Together with New Town, it forms a UNESCO World Heritage Site. == Royal Mile == The main street in the Old Town is called the \"Royal Mile\". It runs on a downwards path from Edinburgh Castle to Holyrood Palace and the ruined Holyrood Abbey. The streets are not officially called The Royal Mile in terms of legal addresses. The actual street names (running west to east) are Castlehill, Lawnmarket, High Street, Canongate and Abbey Strand. Notable buildings in the Old Town include St. Giles' Cathedral, the General Assembly Hall of the Church of Scotland, the National Museum of Scotland, the Old College of the University of Edinburgh and the Scottish Parliament Building. The area is known to have underground vaults and hidden passages that are relics of old phases of construction. == Sections == In addition to the Royal Mile, the Old Town may be divided into various areas from west to east: * West Port, the old route to the west * Grassmarket, the area to the south-west * Edinburgh Castle * The Cowgate, the lower southern section of the town * Canongate, the whole eastern district * Holyrood, it includes Holyrood Palace and Holyrood Abbey * Croft-An-Righ, a group of buildings north-east of Holyrood == Major events == In 1824, a major fire known as Great Fire of Edinburgh, destroyed most of the buildings on the south side of the High Street. During the Edinburgh International Festival, the High Street and Hunter Square become gathering points. Performers in the Fringe advertise their shows, often through street performances. On 7 December 2002, the Cowgate fire destroyed a small but dense group of old buildings on the Cowgate and South Bridge. It destroyed the famous comedy club, The Gilded Balloon. Other areas affected were the Informatics Department of the University of Edinburgh. The vast artificial intelligence library was also damaged. The site was redeveloped 2013-2014. There now stands a single new building which largely used as a hotel. == References == == Other websites == * Kincaid map showing the Old Town in 1784 * UNESCO World Heritage Site Inscription * Edinburgh Old Town Association Category:World Heritage Sites in the United Kingdom Category:Edinburgh",
 "title": "Old Town, Edinburgh"
}