{
 "id": "779726",
 "text": "This is an article about the history of Female Go players. ==Social background== Female Go players are viewed to be a minority. This is due to these reasons: * There are many male players but only few female players. ** In Japan, there are only three female 8-dan players.Kazuko Konishi, Kazuko Sugiuchi and Mika Yoshida And there are no female 9-dan. In addition, there are no female winners at games without gender rules. Asami Ueno was the first female player who managed to be a finalist.Asami Ueno profile at Nihon Ki-in ** In China, there was no female 9-dan before Rui Naiwei. ** Most players and winners at World championships are male. * Not all female players are fairly paid. Joanne Missingham is known for her protests to this issue. * At most Go organizations, directors are only male.At Nihon Ki-in, there were no female directors before Chizu Kobayashi, Sachiko Hara and Tomoko Ogawa. These are caused by many reasons. One factor is they retire earlier due to marriage, pregnancy and maternity. ===Comparison with female shogi players=== In Japan, Go players are always compared with shogi players. This is because newspapers like Asahi Shinbun treat them equal. But there is a big difference among female players. Female Go players usually belong to the same organization with others. But this does not happen for shogi. Female shogi players belong to the Ladies Professional Shogi Association (LPSA).LPSA website The others belong to the Japan Shogi Association (JSA).JSA website Some LPSA players like Kana Satomi have tried to enter JSA. But currently, no one has entered. ==Promotion of female players== ===Europe=== In Europe, there were no notable female players before Svetlana Shikshina and Diana Koszegi. In order to increase female players, the European Go Federation is holding the European Womens Go Championship (EWGC) since 1996 and the European Pair Go Championship (EPGC) since 1997.European Tournament Results by EGF ===Japan=== Kansai Ki-in has eased the age rules to female players. At Nihon Ki-in, there is a special exam for female players. Most female professionals (except Xie Yimin and Keiko Kato etc.) have got their pro status by this way.Nihon Ki-in player recruitment In 2019, Nihon Ki-in has started a female player test system to give more support to them.Nihon Ki-in announcement Nihon Ki-in is also sponsoring female amateur games. ====Female Student Honinbo==== This is a tournament operated with the All Japan Student Go Federation. Some winners have got pro status, or became top amateur players. Only players who cleared regional games can attend. ====All Japan Female Amateur Go Championship==== The All Japan Female Amateur Go Championship is the highest match for female amateur Go players. Some winners have became a pro. The next table shows the notable winners. Year Winner 1965 Tomoko OgawaTomoko Ogawa profile at Nihon Ki-in 1970-1971 and 1975 Kazuko Kanai 1977-1978, 1980, 1985 and 1987 Yoshiko Kamekura 1981-1984 Yasuko Yoshie 1990-1991 and 1993-1995 Akiko Sato 1997 Narumi OhsawaNarumi Osawa profile at Nihon Ki-in 2000-2001 Mieko NakajimaMieko Nakajima profile at Nihon Ki-in 2002 and 2013 Maya Ohsawa (Narumi Ohsawa's sister. The Ohsawa sisters became the first sisters to win at here) 2003 Kaori Mukai (Chiaki Mukai's sister, now known as Kaori MimuraKaori Mimura profile at Nihon Ki-in) 2004 Miori Shimosaka 2005 and 2007 Akane Ishii (currently known as Akane Tatsumi) 2014-2015 Akiko FujiwaraWaseda Weekly interview in 2018Tournament report article in 2018 by Asahi ShinbunAkiko Fujiwara at Sensei's Library 2016 Reina Oshima 2017 Saeka Iwata Kaori Chinen, Yukari Yoshihara and Rina Fujisawa also joined this game. ==Notes== category:Go players * category:Gender",
 "title": "Female Go players"
}