{
 "id": "779837",
 "text": "Euronews is a European television news channel. It is headquartered in Brussels, Belgium. The channel broadcasts in 17 languages. 97.6% of the channel is controlled by Alpac Capital, a company which belongs to the son of an advisor to Hungarian leader Viktor Orbán. The other 2.4% belongs to three state media companies: ADMIC of United Arab Emirates, SNRT of Morocco, and PBS of Malta. == History == CNN helped make 24-hour TV news important after the Gulf War. The European Broadcasting Union answered this with the creation of their own news channel. Euronews started broadcasting on 1 January 1993, from Lyon, France, in five languages (English, French, German, Spanish and Italian). The channel was special in the news market because it had no presenters or studios, just videos showing the news. The channel's most important segment is \"No Comment\", which shows videos with no voice-over. Later, the channel started broadcasting in Portuguese in 1999, in Russian in 2001, in Arabic in 2008, in Turkish and in Persian in 2010, in Ukrainian in 2011, in Greek in 2012, and in Hungarian in 2013. In February 2015, Media Globe Networks, a company which belonged to Egyptian billionaire Naguib Sawiris, bought a 53% share of Euronews SA in a deal with the company. In January 2016, the channel started a sister network called Africanews, which is for the African news market, with a pan-African view. Euronews got a new logo on 17 May 2016. === NBC steps in === In November 2016, NBCUniversal said they wanted to buy a share in the Euronews network. They also said they would share news reports with the channel. The deal was agreed upon in February 2017, and NBC now had a 25% share. In May 2017, Euronews went from having one TV channel with 13 audio tracks, to 10 separate TV channels and 12 websites. This is part of a \"glocal\" idea. Now, every language edition can make their own offerings of local and global news. The Arabic and Persian services stopped TV broadcasting, and they are now only on social media and the Euronews website. The Ukrainian service was closed too, because it did not have enough money. In 2018, the English Euronews channel started its first news shows with live presenters. Then, other Euronews language editions did the same and started their own presented evening news shows too. === After NBC === In April 2020, NBC left the channel and gave its share to Media Globe Networks. MGN now owned 88% of Euronews. In 2022, a holding company based in Lisbon named Alpac Capital bought MGN's share in Euronews. The company is controlled by the son of an advisor to Hungarian leader Viktor Orbán. Allegedly, the Hungarian government gave €45 million for the deal, which cost €150 million. == Troubles == Euronews was banned (stopped to be broadcast) in Belarus by its government's decision on 12 April 2021. == Related pages == * State media == References == == Other websites == * Euronews website Category:1993 establishments in Europe Category:Television channels in Europe Category:Censorship in Belarus",
 "title": "Euronews"
}