{
 "id": "780096",
 "text": "Inaccessible Island is an extinct volcano. It was last active six million years ago. Together with Gough Island, Inaccessible Island is a protected wildlife reserve, both make up the UNESCO World Heritage Site of Gough and Inaccessible Islands. Inaccessible Island is home to the endemic Inaccessible Island rail, the world's smallest extant flightless bird. Inaccessible Island is part of the archipelago of Tristan da Cunha. It is part of the overseas territory of the United Kingdom known as Saint Helena, Ascension and Tristan da Cunha. Tristan da Cunha itself is accessible only by sea via a seven-day sail from Cape Town, South Africa, by landing during the 60 days of the year that the harbor allows for access to the island. == Geography == The island is approximately to the southwest of the main island of the Tristan da Cunha archipelago. Mostly bare and inhospitable, the island has one small landing site named Port David on the northwesternmost point. The island is in area. It is between South Atlantic Ocean south-west of Tristan da Cunha. Inaccessible Island is bordering with sheer sea cliffs, but one can landed on it through a few boulder beaches. Generations of sailors were wary of the difficult landings and inhospitable terrain. Inaccessible Island does not have any permanent inhabitants since 1873. == In popular culture == * Edgar Allan Poe's The Narrative of Arthur Gordon Pym of Nantucket alluded to Nightingale Island, Inaccessible Island, and Tristan da Cunha. * In Patrick O'Brian's The Thirteen Gun Salute (1989), pp. 120–29, Captain Aubrey's ship Diane, in a dead calm, is carried toward Inaccessible Island by the inshore current. One of the sailors recounts the wreck of a whaling ship that he witnessed when it was lost with all hands in similar conditions. Only a fortunate breeze saves Aubrey's ship. The episode is depicted in the cover painting of the book showing the towering cliffs plunging directly into the sea. * \"Sea Lion\", the pseudonym of \"a serving naval officer\" (Geoffrey Martin Bennett), wrote The Phantom Fleet (1946), a novel that was predicated on the supposition that Inaccessible Island contained a natural harbour, the entrance to which was concealed from the sea. The antagonists were assembling a fleet of obsolescent warships in this harbour, with the intention of striking a coup de main leading to world domination, a scheme foiled by the derring-do of a naval officer and the guns of the Royal Navy. * Eric Newby passed within sight of Inaccessible Island on his 1938/1939 voyage from Ireland to Australia aboard Moshulu. It was chronicled in his books The Last Grain Race and Learning the Ropes. Inaccessible Island was the only land the crew saw on the voyage, until reaching Australia, and was therefore a cause for some excitement. * Daniel Suarez's 2014 novel Influx refers to this island as the location of the underground prison 'Hibernity'. == References == == Other websites == * Inaccessible Island: Tristan da Cunha website Category:Uninhabited islands Category:Volcanoes Category:Islands of the United Kingdom Category:Tristan da Cunha Category:World Heritage Sites in the United Kingdom",
 "title": "Inaccessible Island"
}