{
 "id": "780103",
 "text": "The Small Maracanazo was an historical football match, played in 1971 between the Champion teams of Venezuela and Brazil in Rio de Janeiro. ==History== In 1971, the Deportivo Italia, Venezuela's Champion of the 1971 season (and the team of the Italians of Venezuela), defeated the Fluminense FC, Champion of Brazil, 1:0 (with a goal done by central defender Tenorio) at the Maracana stadium.Newspaper article showing some players of the team that made the Small Maracanazo in 1971 with goal of Tenorio The Caracas daily 'El Universal' wrote that: ... the night of 3 March 1971 will never be forgotten by the fans of Fluminense, who followed on radio and television the match against Deportivo Italia. More than 26,000 people went to the Maracana. The modest Venezuelan team, thrashed in their own field in the previous match, did what no none could do for over a year, not even the powerful Brazilian teams: defeat the Fluminense in their Maracana. That fateful night, Deportivo Italia achieved the victory more enjoyable in the Venezuelan national football history, winning in the largest stadium in the world the Champion of Brazil.. The Deportivo Italia – under the direct supervision of Mino D'Ambrosio (who ruled the team with his brother Pompeo D'Ambrosio)– that night went to the match with Vito Fasano (who for his performance was recruited in Brazil, Vito is Italian) as goalkeeper. At the defence there were Carlos \"Chiquichagua\" Marín, Tenorio, Vincente Arrud and Freddy Elie, while as midfielders Delman \"Pito\" Useche, Negri and Rui. In the attack played Alcyr (who was replaced by Bahia), Beto and Militello. In the magazine \"Incontri\" of Caracas, Bruno D'Ambrosio (grandson of Mino who attended the match) wrote that in the final half hour the goalkeeper Vito Fassano did miracles: three hits to the poles helped him, but while two knocked externally the door defended by Fassano, the third would have been goal if the goalkeeper had not deflected it with his fingers stretching in an incredible way. Fassano made the best game of his life, according to sport journalists. When the Deportivo Italia went back to Venezuela, the players were welcomed by the Italian supporters of the team with one week of celebrations: the victory it is still considered the best achievement -in the football world history- by a Venezuela team. Furthermore, the victory was the most famous achievement of the D'ambrosio brothers (Mino and Pompeo) rule of the team in the sixties and seventies of the XX century. ==Match data== The match was played in the worldwide famous Maracanã Stadium of Rio de Janeiro. Over 50000 supporters of the Fluminense saw (in the stadium and outside) their team defeated 1 - 0 by the modest team from Caracas. All the sport-media in Latinoamerica were shocked, because the Fluminense was trained by Lobo Zagalo who had just won the World football Cup in 1970. One of the owners of the Fluminense died of heart attack during the final minutes of the match. ==Notes== ==Related pages== * Deportivo Italia (1948-2010) * Fluminense F.C. Category:Sport in Venezuela",
 "title": "Small Maracanazo"
}