{
 "id": "780150",
 "text": "Gough Island (), historically known as Gonçalo Álvares, is a rugged volcanic island in the South Atlantic Ocean. It is a dependency of Tristan da Cunha. It is part of the British overseas territory of Saint Helena, Ascension and Tristan da Cunha. It is part of the UNESCO World Heritage Site of Gough and Inaccessible Islands. It is about south-east of the Tristan da Cunha archipelago (which includes Nightingale Island and Inaccessible Island), , north-east from South Georgia Island, west from Cape Town. It is over from the nearest point of South America. Nobody lives on Gough Island except for the workers of a weather station, which is usually six people. The South African National Antarctic Programme has maintained the island with British permission since 1956. It is one of the most remote places with a people always being there. == Name == The island was first named Ilha de Gonçalo Álvares on Portuguese maps. It was named Gough Island after the British mariner Captain Charles Gough of the Richmond, who first saw the island in 1732. Confusion of the unusual Portuguese saint name Gonçalo with Spanish Diego led to the wrong name Diego Alvarez Island in English-language sources from the 1800s to 1930s.Report on the geological collections made during the voyage of the ... British Museum (Natural History), Walter Campbell Smith, British Museum (Natural History) – 1930 \"DIEGO ALVAREZ OR GOUGH ISLAND. By W. Campbell Smith. Gough Island, as it seems to be more usually called, lies about 200 miles south of the Tristan da Cunha group in latitude 40° S., longitude 10° W.1 It is about 8 miles long by 3 ...\"Plants of Gough Island: (Diego Alvarez) Erling Christophersen – 1934The Antarctic dictionary: a complete guide to Antarctic English – Page 150 Bernadette Hince – 2000 -\"I went for adventure. to have fun, Gough Island Gough Island was named I. de Goncalo Alvarez on early maps. after its discoverer. Portuguese navigator Goncalo Alvarez. The name was later corrupted to I. Diego Alvarez. and there was confusion about the locality. It was renamed after Captain Charles Gough of the British barque Richmond. who sighted the island in 1713.\" However, the most likely explanation is that it was simply a misreading of 'Is de Go Alvarez', the name by which the island is represented on some of the early charts, the 'de Go' mutating into 'Diego'.Raymond John Howgego, Historical Encyclopedia of Atlantic Vigias, London, 2015 == History == The details of the discovery of Gough Island are unclear, but the most likely occasion is July 1505 by the Portuguese explorer Gonçalo Álvares. Maps during the next three centuries named the island after him. On some later maps, this was erroneously given as Diego Alvarez. According to some historians, the British merchant Anthony de la Roché was the first to land on the island in the austral autumn of 1675.Capt. Francisco de Seixas y Lovera, Descripcion geographica, y derrotero de la region austral Magallanica. Que se dirige al Rey nuestro señor, gran monarca de España, y sus dominios en Europa, Emperador del Nuevo Mundo Americano, y Rey de los reynos de la Filipinas y Malucas, Madrid, Antonio de Zafra, 1690. (Relevant fragment)J.-F.G. de la Pérouse, F.A.M. de la Rúa. A Voyage Round the World, Performed in the Years 1785, 1786, 1787, and 1788, by the Boussole and Astrolabe: Under the Command of J.-F.G. de la Pérouse, Volume 1. London: Lackington, Allen, and Company, 1807. pp.71-81. Charles Gough rediscovered the island on 3 March 1732. He thought it was a new find.Gough's log is preserved in the East India Collection at the British Library. The entry for 3 March 1732 is printed in Gabriel Wright (pub.), \"A New Nautical Directory for the East-India and China Navigation\", 7th edn, London, 1804, p. 394. It had been named Gonçalo Álvares since 1505 after the captain of Vasco da Gama's flagship on his epic voyage to the east. It was under this name that it was marked with reasonable accuracy on the charts of the South Atlantic during the following 230 or so years. Then, in 1732, Captain Gough of the British ship Richmond reported the discovery of a new island. He placed it 400 miles to the east of Gonçalo Álvares. Fifty years later, cartographers realised that the two islands were the same. Despite the priority of the Portuguese discovery, and the greater accuracy of the position given by them, \"Gough's Island\" was the name adopted.Heaney, J.B., Holdgate, M.W. (1957). The Gough Island Scientific Survey. The Geographical Journal, Vol. 123, No. 1, pp. 20–31 In the early 19th century, sealers briefly inhabited the island. The earliest known example is a sealing gang from the U.S. ship Rambler (Captain Joseph Bowditch) which remained on the island in the 1804–1805 season.R.K. Headland (Ed.) Historical Antarctic Sealing Industry, Scott Polar Research Institute (University of Cambridge), 2018, p.176. The sealing era lasted from 1804 to 1910 during which 34 sealing vessels are known to have visited the island, one of which was lost offshore.Headland, p.167. The Scottish National Antarctic Expedition on the Scotia made the first visit to the island by a scientific party on 21 April 1904, when William Speirs Bruce and others collected specimens. The Shackleton–Rowett Expedition also stopped at the island in 1922. Gough Island was formally claimed in 1938 for Britain, during a visit by HMS Milford of the Royal Navy. In 1995, the island was inscribed as a UNESCO World Heritage Site. In 2004, the site was extended to include Inaccessible Island and renamed Gough and Inaccessible Islands. Gough Island is the only place outside South America from which the solar eclipse of September 12, 2034, will be visible; the centre of the path of totality crosses over the island. == Geography and geology == Gough Island is roughly rectangular with a length of and a width of . It has an area of and rises to heights of over above sea level. Topographic features include the highest peak, Edinburgh Peak, Hags Tooth, Mount Rowett, Sea Elephant Bay, Quest Bay, and Hawkins Bay. It includes small satellite islands and rocks such as Southwest Island, Saddle Island (South), Tristiana Rock, Isolda Rock (West), Round Island, Cone Island, Lot's Wife, Church Rock (North), Penguin Island (Northeast), and The Admirals (East). === Climate === According to the Köppen system, Gough Island features an oceanic climate (Cfb). Gough Island's temperatures are between and during the day year-round, due to its isolated position far out in the Atlantic Ocean. The Atlantic is much cooler in the southern hemisphere than the northern, but frosts are still very rare. As a result, summers are not very hot. It features a similar climate to the Fiordland area of New Zealand, the west coast of Scotland, or the Alaskan Panhandle. Precipitation is high during the entire year, and sunshine hours are few. Snow falls in the interior, but is rare at sea level. == Weather station == A weather station has been running on Gough Island since 1956. It is operated as part of the network of the South African Weather Service. Because cold fronts approach South Africa from the south-west, the Gough station is particularly important in forecasting winter weather. Initially it was housed in the station at The Glen, but moved in 1963 to the South lowlands of the island, more precisely . The new location improved the validity and reliability of the data acquired for use in modeling. === Human presence === Each year a new overwintering team arrives by ship from Cape Town (beginning in 2012, the S. A. Agulhas II) to staff the weather station and perform scientific research. The team for a particular year may be termed as \"Gough\" and an expedition number: for example, the 1956 team were \"Gough 01\", and the team for 2013 were \"Gough 58\". Each new team directly replaces the departing one, thereby maintaining a continual human presence on the island.\"South Africa National Antarctic Programme - Gough Island Teams\" , Retrieved 12 February 2014Chris Bell, \"Chris Bell's Blog from Gough 58\", Retrieved 12 February 2014 A team normally consists of: * A senior meteorologist * Two junior meteorologists * A radio technician * A medic * A diesel mechanic * A number of biologists (depending on ongoing research projects) The team is supplied with enough food to last the whole year. People and cargo are landed either by helicopter, from a helideck-equipped supply ship, or by a fixed crane atop a cliff near the station (a place aptly called \"Crane Point\"). In 2014 a member of the research team choked to death on the island and his body was taken back to South Africa. == Maps == File:Gough Island map.svg|Relief map File:Orthographic projection over Gough Island.png|Orthographic projection File:Gough Island Landsat.jpg|Satellite map == References == == Other websites == * www.goughisland.com - The Gough Island Restoration Project website * Gough Island Gallery * Gough and Inaccessible Islands - UNESCO wildlife reserve publication * Photographs of Gough Island - Flickr publication by Chantal van Staden. Category:Islands of the United Kingdom Category:World Heritage Sites in the United Kingdom Category:Tristan da Cunha",
 "title": "Gough Island"
}