{
 "id": "78043",
 "text": "A coelacanth is a type of fish in the Sarcopterygii, the lobe-finned fishes.Coelacanth is pronounced 'seela-canth' They are a sister group to those fish which evolved into tetrapods.The sister group which included the ancestors of the tetrapods is called the Rhipidistia. Their fossil record goes back 400 million years, before any land vertebrates had evolved.Johanson, Zerina, John A. Long, John A. Talent, Philippe Janvier, and James W. Warren. 2006. Oldest Coelacanth, from the early Devonian of Australia. Biology Letters 2.3 443–46 There are at least two species of coelacanths living in the Indian Ocean. Scientists thought they had been extinct for 80 million years until one was caught off the east African coast in 1938. However, fisherman in the Comoros islands had been catching it for a very long time and called it gombesa. == Characteristics == The coelacanths are the closest link between fish and the first amphibians which made the transition from sea to land in the Devonian period (408–362 million years ago). Whereas the fishapods lived near the shore in muddy water, the coelacanths lived in open water. The modern species are predators that live in the deep ocean. === Latimeria === Latimeria is the only living genus of the otherwise fossil coelacanth fish. It is probably the best-known Lazarus taxon. That such a creature could have been unrecorded for so long is rare, but perhaps the cold depths of the West Indian ocean (in which the Coelacanth lives), and the few predators it has, may have helped the species survive. Its disgusting taste means that fishermen did not deliberately try to catch it, that is, before scientists started offering rewards. The population living off Tanzania is threatened by Japanese trawlers, but the fish is not edible. They are simply caught in trawls by accident. More than 20 have died this way, and their total numbers cannot be large.\"Dinosaur fish pushed to the brink by deep-sea trawlers\" The Observer\"Does Tanga need a new harbour at Mwambani Bay?\" Tanzania Natural Resource Forum\"Population of prehistoric deep-ocean coelacanth may go the way of the dinosaurs\" mongabay.com ==== Scientific study ==== Latimeria was first found by scientists in 1938 by Marjorie Courtenay Latimer, the curator of a small museum in the South African port town of East London. She was visiting a fisherman who would let her search through his boat's catch for interesting specimens. Another one was found off the Comoros islands in 1952. The largest specimen was about 1.8 metres (~6 ft). == References == Category:Lobe-finned fish Category:Living fossils",
 "title": "Coelacanth"
}