{
 "id": "78168",
 "text": "The Tatar language is a Turkic language that is spoken by the Tatar people, and is the official language of the Republic of Tatarstan in Russia. ==Alphabets== Like many other Turkic languages, different alphabets are used to write the Tatar language. ===Cyrillic=== In Russia, the Tatar alphabet is Cyrillic by a federal government law passed in 2002. It has 39 letters, of which 33 are the same as in Russian. The other 6 (and their positions in the alphabet) are: *Ә (after А) *Җ (after Ж) *Ң (after Н) *Ө (after О) *Ү (after У) *Һ (after Х ) ===Latin=== In 2001, the government of the Republic of Tatarstan created a Latin alphabet for the Tatar language called Zamanälif. But the next year, the federal government did not allow it to be made official. The Zamanälif alphabet has these 35 letters: A, Ä, B, C, Ç, D, E, F, G, Ğ, H, I, İ, Í, J, K, L, M, N, Ñ, O, Ö, P, Q, R, S, Ş, T, U, Ü, V, W, X, Y, Z ====Yañalif==== There was another Latin alphabet for Tatar called Jaьjalif, Yangalif or Yañalif (Tatar: jaьja əlifba/yaña älifba → jaьjalif/yañalif, Cyrillic: Яңалиф, \"new alphabet\") which is the first Latin alphabet used during the latinisation in the Soviet Union in the 1930s for the Turkic languages. It replaced the Yaña imlâ Arabic script-based alphabet in 1928, and was replaced by the Cyrillic alphabet in 1938–1940. After their own independence in 1991, several former Soviet states in Central Asia switched back to Latin script, with some differences to Jaьjalif. Yañalif jaьja əlifba Script type Alphabet Creator Many, mostly during the Latinisation in the Soviet Union Time period 1924-1940 Languages Turkic languages Related scripts Parent systems Egyptian hieroglyphs * Proto-Sinaitic alphabet ** Phoenician alphabet *** Greek alphabet **** Old Italic scripts ***** Latin alphabetaugmented by Cyrillic script ****** Yañalif Sister systems Unified Northern Alphabet There are 33 letters in Jaьjalif, nine of which are vowels. The apostrophe (') is used for the glottal stop (həmzə or hämzä) and is sometimes thought of as a letter for the purposes of alphabetic sorting. Other characters may also be used in spelling foreign names. The lowercase form of the letter B is ʙ (small caps B), to prevent confusion with Ь ь (I with bowl). Letter No. 33, similar to Zhuang Ƅ, is not currently available as a Latin letter in Unicode, but it looks exactly like Cyrillic soft sign (Ь). Capital Ə (schwa) also looks like Russian/Cyrillic Э in some fonts. There is also a digraph in Jaьjalif (Ьj ьj). ===Arabic=== There have been two Arabic alphabets used to write Tatar: İske imlâ and Yaña imlâ. İske imlâ is the older of the two and was used until 1920, when it was changed to become Yaña imlâ and remained in use until it was replaced by the Latin Yañalif alphabet. However, Tatars in China still use İske imlâ. Since 2012, it is possible for people and organizations to write to the Tatarstan government in either the Latin or Arabic scripts, but the government has to answer in Cyrillic. ==References== Category:Turkic languages Category:Languages of Russia",
 "title": "Tatar language"
}