{
 "id": "78177",
 "text": "Giordano Bruno (January 1548 – 17 February 1600) was an Italian friar of the Dominican Order. He was also a philosopher and mathematician. He is best known for believing in the infinity of the universe. His cosmological theories went beyond the Copernican model. Bruno thought the Sun was just one of an infinite number of independently moving heavenly bodies. He is the first man to have thought the stars we see at night are identical in nature to the Sun. For publishing beliefs contrary to Roman Catholic dogma about transubstantiation, trinity and other matters, he was burnt at the stake as a heretic by the Inquisition of the Roman Catholic Church. Bruno also wrote extensive works on the art of memory, a loosely organized group of mnemonic techniques and principles.Yates, Frances A. 1966. The art of memory. == The charges == The Catholic Church made the following accusations against Bruno:Firpo, Luigi 1993. Il processo di Giordano Bruno. * Holding opinions contrary to the Catholic Faith and speaking against it and its ministers. * Holding wrong opinions about the Trinity, about Christ's divinity and Incarnation. * Holding wrong opinions about Christ. * Holding wrong opinions about Transubstantiation and Mass. * Claiming the existence of a plurality of worlds and their eternity. * Believing in the transmigration of the human soul into brutes. * Dealing in magics and divination. * Denying the Virginity of Mary. Bruno did accept and promote Copernicus' idea that the Earth revolves round the Sun. Many believe this was one of main reasons for his downfall; others think his theological beliefs were more critical.Yates, Frances A. 1964. Giordano Bruno and the hermetic tradition. Chicago. In 1584 he published two dialogues which argued for his idea on astronomy.De la Causa, Principio, et Uno (1584) Full Italian text, Giordano Bruno.info: Download ; De l'infinito Universo et Mondi (1584) Full Italian text, Giordano Bruno.info: Download ; Eight years later he was arrested, and his trial took another eight years. His accusers demanded complete recantation of all his 'erroneous' beliefs. He refused, and went to his death. Later the Inquisition used his example to terrify Galileo into withdrawing his works from publication. == Related pages == * Galileo Galilei * Heliocentrism * Nicolaus Copernicus == References == Category:1548 births Category:1600 deaths Category:16th-century philosophers Category:Italian astronomers Category:Italian mathematicians Category:Italian philosophers Category:Italian Roman Catholics Category:People executed by burning Category:16th-century Italian writers",
 "title": "Giordano Bruno"
}