{
 "id": "78172",
 "text": "The House Medici (pronounced med-ee-chee) or Medici family was a very important family in Florence, Italy from the year 1300 to about 1600. They were the richest family in Europe for many years. Many leaders of Florence during the Renaissance were Medicis. The Medicis were important because they ran many banks, including the most important bank in Europe. They were so powerful they became like a royal family. 4 popes of the Catholic Church were from the Medici. Their names were Pope Leo X (the 10th), Pope Clement VII(the 7th), Pope Pius IV (the 4th), and Pope Leo XI (the 11th) 2 Queens of France were from the medici- Catherine de’ Medici and Marie de’ Medici.The heir to the Tuscan throne was traditionally known as the Grand Prince. The family ruled the state with the title of Grand Duke of Tuscany. ==Popes== * Pope Leo X (1513-1521), born Giovanni de' Medici\"Pope Leo X\", Catholic Encyclopedia; retrieved 2011-11-3. * Pope Clement VII (1523-1534), born Giulio di Giuliano de' Medici\"Pope Clement VII\", Catholic Encyclopedia; retrieved 2011-11-3. * Pope Pius IV (1559-1565), born Giovanni Angelo Medici\"Pope Pius IV\", Catholic Encyclopedia; retrieved 2011-11-3. * Pope Leo XI (1605), born Alessandro Ottaviano de' Medici\"Pope Leo XI\", Catholic Encyclopedia; retrieved 2011-11-3. == Florence and the Medici == Giovanni Bicep de' Medici, (1360-1429), was the first important member of the family. He invested his money very wisely and became rich. He and his son, Cosmo de' Medici, (1389-1464), began the Medici Banking Company, which did so well that they soon had branches of the bank in large cities all over Europe, including London and Paris. Giovanni Bicep and Cosmo were the richest men in Europe, and their family was politically the most powerful in Florence. Florence already had an industry, the cloth industry. Florentine merchants (traders) traded with Lombard traders from the north of Italy. They bought English wool and Chinese silk to be woven into the most magnificent cloth in Europe at the riverside factories of Florence. Florence was perfectly sited for making cloth. A lot of water is needed to make cloth. Other towns nearby are high on the tops of hills, but Florence is in a wide valley, with the broad Arno River flowing through it. There was a harbor on the coast near Pisa. The Pisans were not very friendly towards Florence, so Florence took them over. Then the rich traders of Florence could have their own ships and did not have to worry about the Lombard traders who brought their goods across Europe and over the mountains on the backs of donkeys. Cosimo de' Medici was a patriot and a patron. He was a \"patriot\" because he acted like a father to his city. He became part of the town council. They were a group of men called the \"signorina\" (the seniors or elders). Cosimo made laws that adjusted the taxes. Some of the rich people did not like this at all and left the city, making Cosimo more powerful. He took good care of industry, of trade and of farming, because Florence needed all these things. He particularly needed the loyalty of all the farms and villages, because a city in a valley is easy for an army to attack. Cosimo built public buildings and when he had a palace built for himself, he had long stone seats built along the walls for the poor and the elderly to sit on. He was a patron because he supported the church, and lots of writers, artists, architects and students. He founded a \"Platonic Academy\" where students could study the works of Ancient Greek writers and talk about politics, religion and new ideas. The head of the Academy was a philosopher called Marsillio Ficino. Cosimo encouraged architects to design buildings in the style of Ancient Rome. He collected a huge library of books and gave them to the monastery of San Lorenzo to be used by students. When he wanted some quiet time, he went to friary, (which is like a monastery), Sant Marco's, where he encouraged one of the \"brothers\", Fra Angelico, to paint beautiful sacred pictures. After the death of Cosimo, his grandson Lorenzo de' Medici became even more famous. He was called Lorenzo il Magnifico (the Magnificent). It was during the time of Lorenzo that some of the most famous artists in world history were alive in Florence, and worked for the Medici:- Botticelli, Michelangelo and Leonardo da Vinci. ==Related pages== * Florence * Renaissance * List of popes from the Medici family ==References== Category:Papal families Category:Grand Duchy of Tuscany",
 "title": "House of Medici"
}