{
 "id": "78213",
 "text": "The Massachusetts Bay Colony was a 17th-century British settlement founded by Puritans on the East Coast of North America. Later called New England, the colony included the states of Massachusetts, Maine, New Hampshire, Rhode Island, and Connecticut.William Dummer Northend, A Civil, Religious and Social History of the Massachusetts Colony and its Settlements from the Landing at Cape Ann in 1649 to the Death of Governor Winthrop in 1649 (Boston: Estes and Lauriat Pub.) The Massachusetts Bay Company, founded in 1628, brought around 20,000 people to the colony. It was one of two companies which brought settlers in the New World. The other, called the Dorchester Company, was a failure. At first the colonists had a friendly relationship with local Native American tribes. These included the Massachusett, Wampanoag, Nipmuc, Narragansett, and Pequot Mohegan tribes, among others. However, as more Europeans moved to the New World, conflicts over land borders arose. Along with differences in culture and customs, these conflicts led to the Pequot War (1636–1638) and then to King Philip's War (1675–1676). Some Native Americans moved to other places after these wars. Others remained peacefully in the Massachusetts Bay Colony. The colony did well economically trading with England and the West Indies. Initially the colony did well economically and made money trading with England and the West Indies. In 1692, Sir William Phips arrived and combined the Massachusetts Bay and Plymouth Colonies. The colonists helped run the government and decide how to spend its money. == Earlier times== From the earliest times, many Native American tribes lived in what is now New England. They farmed and hunted within their own land borders and usually did not cross each other's land.Hart, p. 1:129 Early in the 1600s, Samuel de Champlain and John Smith mapped New England and the location of various tribes.Hart, pp. 1:127–128 Living in the New World was very hard work for the first settlers. Many became ill and died though the cold winter. There was not enough food, and many people in the group decided to return to England after a year.Thayer, pp. 13–216 For awhile there was no more talk of settling people in the New World,Vaughan, p. 14 although English ships did still come to the New England area to fish and trade with Native Americans.Vaughan, p. 15 ===Plymouth Colony=== In November 1620, a group of Europeans started the Plymouth Colony.Hart, pp. 1:67–70 After nearby settlements failed, some of the group joined the Plymouth Colony or lived near it; others returned to England.Adams and Nash, pp. 15–34 The people of Plymouth faced many problems during the colony's first years, and they could not pay back their investors. In 1627 the companies left the colonists to take care of themselves.Stratton, p. 27 In 1622 two of the colony's leaders, Edward Winslow and William Bradford, published a booklet about the Mayflower and the colony they created. It was called Mourt's Relation (full title: A Relation or Journal of the Beginning and Proceedings of the English Plantation Settled at Plimoth in New England). Though the two men express differing opinions, the booklet's purpose was to encourage people to come and settle in the New World.Heath, pp. xiii–xvLabaree, p. 26Adams and Nash, pp. 29–34 == References == == References and further reading == * * * * * * * * * * * * * (five volume history of Massachusetts until the early 20th century) * * * * * * * * * * * * * * * * * * * * * Category:17th century in Massachusetts Category:British North America",
 "title": "Massachusetts Bay Colony"
}