{
 "id": "78214",
 "text": "About a Girl is a Canadian comedy television series, which was first shown on October 5, 2007 on The N in the United States, and Global in Canada. It is the first scripted comedy for The N. On February 25, 2008, actor Sandy Robson announced that the show was getting cancelled. The show ended with 13 episodes in one season. == Plot == The series centers around Amy, a young college student who moves in an apartment off campus with four guys, when she finds out her dorm room is a uninhabitable sty. Her new roommates are wild, unpredictable, and...kind of hot. == Characters == * Amy - A major overachiever, Amy thought college would be just a walk in the park, but when she's forced to move in with four guys, instead of the mess they called a dorm, things get a little complicated for her. * Jason - The hottie that Amy has a thing for. He's the loveable-commiment phobe. If he does not like how a relationship is going, he tries to \"fizzle\" things out. He's hot, he's super hot, and did we mention...he hot? * Dude - Flaky and easy-going. What more can a dude ask for? Dude has many words to live by. He's full of advice for his roommates, even though they might not know what he's talking about. He's afraid of pelicans, because of their \"big flapping beaks\", and he does not like chiuahuas, because \"they shake\". * McRitchie - Ever stereotypical, McRitchie is a manly stud. He's adventurous and does not think about the consequences of his actions. * Benny - As the youngest, smartest, and neatest roommate, Benny kind of ignores the pigsty he lives in. He figures his little crush on Amy will never work out. * Erin - As Amy's best friend, Erin is always there to give Amy the other point of view...usually the boy crazy, sorority-member point of view. == Cast == * Chiara Zanni - Amy * Jesse Hutch - Jason * Sandy Robson - Dude * Braden Williams - McRitchie * Marshall Porter - Benny * Kristie Mardsen - Erin == Episodes == === Season 1 === # Airdate 1 About a Pilot October 5, 2007 2 About the Rules October 12, 2007 3 About a Job October 19, 2007 4 About a Flood October 26, 2007 5 About a Break-Up November 2, 2007 6 About a Visit November 9, 2007 7 About a Dream November 16, 2007 8 About a Prank January 19, 2008 9 About an F Word January 26, 2008 10 About an All-Nighter February 9, 2008 11 About a Boot February 16, 2008 12 About a Tent February 22, 2008 13 About a Homecoming February 29, 2008 == Other websites == * * Category:2007 Canadian television series debuts Category:2008 Canadian television series endings Category:2000s sitcoms Category:2000s teen television series Category:English-language television programs",
 "title": "About a Girl (TV series)"
}