{
 "id": "78279",
 "text": "Poverty in India is an issue that has been important in India however the population of those in poverty has started to decrease. The Government of India says that the poverty line for rural areas is ₹ 816 per month and ₹ 1000 per month in urban areas. This means that many people do not have enough money. India's proposed but not yet adopted official poverty line is ₹972 (US$14) a month in rural areas or ₹1,407 (US$21) a month in cities. In India, the average calorie requirement of an average man is 2400 calories per day in Rural area and 2100 calories per day in Urban area. In 2012, the latest report by the Planning Commission of India (Tendulkar Committee) reported that 26% of all people in India fall below the international poverty line of US$1.25 per day. Over the last decade, poverty has been witnessed a consistent decline with the levels dropping from 37.2% in 2004-05 to 29.8% in 2009-10. The number of poor people is now estimated at 250 million. == Analysis == In 1947 the average income in India was similar to South Korea. South Korea became a developed country by the 2000s, but India did not. For the first 40 years, India followed the Soviet-style economic planning, nationalization programs and government ownership of industry. Its economic growth averaged about 3.5%, while Asian economies such as South Korea grew on average more than twice that rate annually.Swaminathan S. Anklesaria Aiyar Socialism kills - the human cost of delayed economic reform in India, Cato Institute (21 October 2009)Ray S.C. 2002. Did India's economic reforms improve efficiency and productivity? Indian Economic Review, 37, 1, pp. 23-57. Adjusted for population growth in India, its income per head grew at 1.49% annually, while incomes of South Koreans - rich and poor - rose rapidly. India's Soviet-style economy included the \"Licence Raj\": the elaborate licences, regulations and red tape needed to set up and run a business in India between 1947 and 1990.Overstreet 1958. Soviet and communist policy in India. Journal of Politics, 20(1), pp. 187-202.Street hawking promise jobs in future, The Times of India, 25 November 2001 |date=29 March 2008 The License Raj was a result of India's decision to have a planned economy, where all aspects of the economy are controlled by the state. Licences were only given to a select few. Corruption flourished under this system.Kumar 2003. Corruption and human rights: promoting transparency in governance and the fundamental right to corruption-free service in India. Columbia Journal of Asian Law, 17, 31The India Report , Astaire Research Under this system, the country created few jobs and little wealth. Widespread poverty remained.Thakur 1993. Restoring India's economic health. Third World Quarterly, 14(1), 137-157 == References == Category:Economy of India Category:Poverty",
 "title": "Poverty in India"
}