{
 "id": "78297",
 "text": "A goitre or goiter (Latin: struma), also called a bronchocele, is a swelling in the neck (just below Adam's apple or larynx). It happens when the thyroid gland gets larger (usually because the body is not getting enough iodine). Goitre and associated deaf-muteism was widespread in Switzerland until the 1920s, when iodised salt was introduced. == Classification == Goitres are classified in different ways (put into different categories): * A diffuse goitre is a goitre that has spread through all of the thyroid. A diffuse goitre can be a \"simple goitre\" or a \"multi nodular goitre.\" * Toxic goiter is a goitre with hyperthyroidism. These most commonly caused by Graves disease, but they can also be caused by inflammation or a multinodular goitre. * Any other type of goitre is called a non-toxic goitre. These may be caused by lithium, some kinds of autoimmune diseases, or other problems. People with non-toxic goiters have low thyroid levels (hypothyroidism) or normal thyroid levels. == Causes == Some of the causes of goitre include: * Thyroid cancer * Iodine deficiency (not having enough iodine in the body) * Hashimoto's thyroiditis * Graves-Basedow disease * Congenital hypothyroidism (hypothyroidism that babies have when they are born, caused by errors in the way the body makes thyroid hormone) * Thyroiditis (inflammation of the thyroid gland) * Side effects of certain medications New research says that some people may be more vulnerable to goitre (more likely to have goiters) because they inherited that vulnerability (it was passed down to them from their parents). == Famous goitre sufferers == * Within two years of each other, President George H. W. Bush and his wife Barbara Bush both were diagnosed with Graves disease and larger-than-normal thyroid glands. President Bush's disease caused hyperthyroidism and cardiac dysrhythmia (irregular heart rate).The Health and Medical History of President George Bush DoctorZebra.com. 8 August 2004. Retrieved 8 October 2006. == Related pages == * David Marine conducted substantial research on the treatment of goitre with iodine. * Endemic goitre * Struma ovarii—a kind of teratoma * Thyroid hormone receptor == References == == Other websites == * * * National Health Services, UK * Network for Sustained Elimination of Iodine Deficiency * Network for Sustained Elimination of Iodine Deficiency - alternate site at Emory University's School of Public Health Category:Endocrine diseases Category:Diseases",
 "title": "Goitre"
}