{
 "id": "78303",
 "text": "A stroke is an illness in which part of the brain loses its blood supply. This can happen if an artery that feeds blood to the brain gets clogged, or if it tears and leaks. A stroke is when there is a lack of blood flow to the brain. There are two types of strokes. One is when there is a blood clot blocking the artery. The other type of stroke is when a blood vessel bursts and there is blood moving around freely in the brain.Stroke; Overview. N.p.: GALE Cengage Learning, n.d. Health and Wellness Resource Center. Web. 22 Feb. 2016. A stroke is the rapid loss of brain function(s) due to disturbance in the blood supply to the brain. This can happen because of ischemia (lack of blood flow) caused by blockage (thrombosis, arterial embolism), or a haemorrhage (leakage of blood). As a result, the affected area of the brain cannot work properly. Symptoms might include: hemiplegia (an inability to move one or more limbs on one side of the body), aphasia (inability to understand or use language), or an inability to see one side of the visual field. A stroke is a medical emergency. It can cause permanent damage. If it is not quickly treated, it may lead to death. It is the third most common cause of death and the most common cause of disability for adults in the United States and Europe. Strokes happen on both the left and right side of the brain. When a stroke happens on the left side of someone’s brain, it affects the right side of the body. It can also cause problems with the patient’s speech and language. If a stroke affects the right side of the brain, it affects the left side of the body. It also changes patient’s spatial (relating to space) perceptions. Getting a stroke on the right side of the brain can also cause people to not acknowledge their illness. Patients behave impulsively and neglect the side of their body.Blaser, Larry. \"Stroke.\" The Gale Encyclopedia of Science. Ed. K. Lee Lerner and Brenda Wilmoth Lerner. 5th ed. Farmington Hills, MI: Gale, 2014. Student Resources in Context. Web. 22 Feb. 2016. Factors that increase the risk of a stroke include old age, high blood pressure, a previous stroke, diabetes, high cholesterol, smoking, atrial fibrillation, migraine with aura, and thrombophilia (a tendency to thrombosis). Of those factors, the most easy to fix are high blood pressure and smoking. == How are strokes identified? == === Pre-hospital === The Cincinnati Prehospital Stroke Scale was designed to help \"pre-hospital\" medical professionals (like EMTs) identify a possible stroke before the patient gets to the hospital. It tests three basic signs. If any of these signs are not normal, the patient may be having a stroke and should be transported to a hospital as soon as possible. #Facial droop: Have the person smile or show his or her teeth. #* Normal: Both sides of face move equally #* Abnormal: One side of face does not move as well as the other (or at all); part of the face looks like it is drooping #Arm drift: Have the person close his or her eyes and hold his or her arms straight out for about 10 seconds. #* Normal: Both arms move equally or not at all #* Abnormal: One arm does not move, or one arm drifts down compared with the other side #Speech: Have the person say, \"You can't teach an old dog new tricks,\" or some other simple, familiar saying. #* Normal: Patient uses correct words with no slurring #* Abnormal: Patient's speech is slurred, patient uses incorrect words, or is unable to speak About 72% of patients who cannot do one of these three tasks normally are having an ischemic stroke. More than 85% of patients who cannot do all three tasks are having an acute stroke. === \"Spot a stroke\" === The 'spot a stroke' campaign, created by the American Heart Association and the American Stroke Association, teaches everyday people how to recognize a stroke. It teaches the basic tests from the Cincinnati Stroke Scale, using the acronym FAST: * F: Face - Facial Droop. Is one side of the face drooping or numb? Ask the person to smile. Is the person's smile uneven? * A: Arm - Arm Weakness. Is one arm weak or numb? Ask the person to raise both arms. Does one arm drift downward? * S: Speech - Speech Difficulty. Is speech slurred? Is the person unable to speak or hard to understand? Ask the person to repeat a simple sentence, like \"The sky is blue.\" Is the sentence repeated correctly? * T: Time - Time to Call emergency services. If someone shows any of these symptoms, even if the symptoms go away. The emergency telephone number is 911 in the United States, and 112 in most of Europe, and on most mobile phone networks. Calls to emergency services are usually free of charge. === In the hospital === Once the patient is in the hospital, doctors can find out for sure whether they are having a stroke by looking at their brain with special scanning machines, like an MRI or a CT scanner. ==Prevention== Strokes can kill. To prevent a stroke, doctors advise people to: *Control blood pressure *Stop smoking *Exercise at least once a week *Stay at a healthy weight *Do not drink too much *Get regular checkups ==Statistics== *795,000 people in the United States get a stroke each year *One out of four people who have a stroke die (137,000 deaths from stroke per year) *Currently, 3 million people in the US have disabilities from strokes *In US, strokes cost $57.9 billion per year (damage and loss of work) *⅔ of stroke happen in people 65 and up *Strokes affect men more than women *Women more likely to die from stroke than men *Strokes are more common in African Americans *Strokes are more likely to be fatal in African Americans *Stroke rates in older adults are declining but rates in younger people are rising (scientists think that it’s related to obesity) *Physical therapy can help patients *Some people are in a wheelchair after getting a stroke *10% of survivors suffer no long term disabilities *10% of survivors suffer from so many disabilities that they have to stay in 24 hour care == References == ==More reading== * * ==Other websites== * The basis for this article was the National Institute of Neurological Disorders and Stroke public domain resource at this page * Registry of the Canadian Stroke Network * American Stroke Association * National Stroke Association * The Stroke Association UK",
 "title": "Stroke"
}