{
 "id": "78311",
 "text": ":For other uses, see Wheel of Fortune. The Wheel of Fortune, or Rota Fortunae, is a concept in medieval and ancient philosophy and means the unpredictable nature of Fate. The wheel belongs to the goddess Fortuna, who spins it at random, changing the positions of those on the wheel - some suffer great misfortune, others gain windfalls. ==Origins== The concept developed in antiquity; it was used by Cicero. The Wheel originally belonged to the Roman goddess Fortuna, whose name seems to derive from Vortumna, \"she who revolves the year\". Fortuna eventually became Christianized: the Roman philosopher Boethius (d. 524) was a major source for the medieval view of the Wheel, writing about it in hisConsolatio Philosophiae. ===Carmina Burana=== The Wheel of Fortune motif appears significantly in the Carmina Burana (or Burana Codex), over one thousand poems and songs — often profane in content — written by students and clergy in the early 13th century. Excerpts from two of the collection's better known poems, \"Fortuna Imperatrix Mundi (Fortune, Empress of the World)\" and \"Fortune Plango Vulnera (I Bemoan the Wounds of Fortune),\" read:The concept developed in antiquity; it was used by Cicero. The Wheel originally belonged to the Roman goddess Fortuna, whose name seems to derive from Vortumna, \"she who revolves the year\". Fortuna eventually became Christianized: the Roman philosopher Boethius (d. 524) was a major source for the medieval view of the Wheel, writing about it in hisConsolatio Philosophiae.vv : Sors immanis : et inanis, : rota tu volubilis, : status malus, : vana salus : semper dissolubilis, : obumbrata : et velata : michi quoque niteris; : nunc per ludum : dorsum nudum : fero tui sceleris. : . . . . . . . . . . : Fortune rota volvitur; : descendo minoratus; : alter in altum tollitur; : nimis exaltatus : rex sedet in vertice : caveat ruinam! : nam sub axe legimus : Hecubam reginam. : Fate - monstrous : and empty, : you whirling wheel, : you are malevolent, : well-being is vain : and always fades to nothing, : shadowed : and veiled : you plague me too; : now through the game : I bring my bare back : to your villainy. : . . . . . . . . . : The wheel of Fortune turns; : I go down, demeaned; : another is raised up; : far too high up : sits the king at the summit - : let him fear ruin! : for under the axis is written : Queen Hecuba. ==Later usage== Fortuna and her Wheel have remained an enduring image throughout history. William Shakespeare in Hamlet wrote of the \"slings and arrows of outrageous fortune\" and, of fortune personified, to \"break all the spokes and fellies from her wheel.\" And in Henry V, Act 3 Scene VI, are the lines: Selections from the Carmina Burana, including the two poems quoted above, were set to new music by twentieth-century classical composer Carl Orff, whose bombastic and well-known \"O Fortuna\" is based on the poem Fortuna Imperatrix Mundi. Fortuna does occasionally turn up in modern literature. She is often associated with gamblers, and dice could also be said to have replaced the Wheel as the primary metaphor for uncertain fortune. ==References== *Boethius, The Consolation of Philosophy , trans. W.V. Cooper (London: J.M. Dent, 1902) *Geoffrey Chaucer, The Canterbury Tales: The Monk's Tale *Thomas Malory, Le Morte d'Arthur, Chapter XVII' *William Shakespeare, Henry V, Act 3 Scene VI *Fortuna was also used by a character in the novel \"Confederacy of Dunces\";the main character, Ignatus J. Reilly, makes many references to \"Fortuna's wheel\" and also Boethius's works. Category:Mythology Category:Middle Ages",
 "title": "Rota Fortunae"
}