{
 "id": "783159",
 "text": "Yangdong Folk Village is a village in South Korea's North Gyeongsang Province. It is inside the city of Gyeongju, which used to be the capital of Korea. It has buildings and other things that were built in the Joseon Dynasty or that have been rebuilt in the same style. It is a UNESCO World Heritage Site. Yangdong was built in the 1400s by two important clans, Yeogang Lee and Wolseong Son. Many of the people who live in Yangdong now are from these families. Many members of these families who do not live in Yangdong come back a few times a year for special occasions. Yangdong Folk Village is a World Heritage Site as part of a pair with Hahoe Folk Village. Both places were built during the Joseon Dynasty and many of the buildings are still intact. Some of the buildings have been rebuilt with modern materials, though. Like Hahoe, Yangdong's layout shows influences from the Confucian way of thinking and the importance of the clan system in Korea at the time. There are timber houses with tiled roofs for high-ranking people and mud houses with thatched roofs that were originally for low-ranking people. The village is on the sides of hills. The buildings were built in specific places so their rooftops would match and complement the hillsides around them. The buildings belonging to nobler or richer people are higher up on the hills. One home once had 99 rooms. There are two Confucian schools, Oksanseowon and Donggangseowon, near Yangdong Folk Village. There are about 149 houses in Yangdong Folk Village and people still live in them. Yangdong Folk Village has modern, paved roads, some modern bridges, and a railway. Before it was declared a World Heritage Site around 2010, few people visited Yangdong. After it was declared a World Heritage Site, many more came. People worried about whether the extra visitors would damage the site. Tourists, including schoolchildren on field trips, often visit Yangdong. Famous people from Yangdong include the Joseon era philosopher Lee Eon-jeok (1491-1553), nicknamed \"Hoejae.\" Hojae is called one of the \"Five Great Sages of the East.\" ==References== Category:Villages in Asia Category:Buildings and structures in South Korea Category:World Heritage Sites in South Korea",
 "title": "Yangdong Folk Village"
}