{
 "id": "783242",
 "text": "Wanrong (; 13 November 1906 – 20 June 1946) was born on 13 November 1906 and died on 20 June 1946. She was married to Puyi, the last emperor of China. She came from a Manchu family. People sometimes call her the Xuantong Empress. She became empress in 1922, when she married Puyi. In 1924, they had to leave the palace. Later, Wanrong became the empress of Manchukuo, a place controlled by Japan. She was empress there from 1934 to 1945. After she died, people called her Empress Xiaokemin. In 1945, the Soviet Union came to Manchuria. Chinese soldiers caught Wanrong. They moved her to different places. Finally, they put her in a prison camp in Yanji, Jilin. Wanrong died in prison in June 1946. Her body was never found. On 23 October 2006, Wanrong's brother, Runqi, had a special ceremony for her in the Western Qing tombs. == Other names == Her Chinese name was Muhong (慕鴻) and her art name was Zhilian. She also chose a Western name, Elizabeth, because she liked Queen Elizabeth I of England. == Family Background and Early Life == Wanrong was born on 13 November 1906 into the Gobulo clan. Her family belonged to the Plain White Banner of the Eight Banners, and they had Daur ancestry. ancestry. Her father, Rongyuan, worked for the Qing dynasty until 1911. After Wanrong became empress in 1922, her father worked in the Imperial Household Department until they had to leave. Wanrong's mother, Aisin-Gioro Hengxin, died when Wanrong was two years old. She was raised by her stepmother, Aisin-Gioro Hengxiang. Wanrong had a brother named Runliang and a half-brother named Runqi. They lived in Beijing's Dongcheng District, near Di'anmen, in a place called Mao Er hutong. Wanrong's father believed in giving both boys and girls the same education. So, Wanrong attended an American school in Tianjin, just like her brothers. Gunther, John, Inside Asia. p. 146 == Marriage to Puyi == In 1912, the Qing dynasty ended, and China became a republic. Puyi was the last Emperor. He had a big wedding in the Forbidden City when he was 16 years old. Puyi looked at pictures of girls to choose a bride. He picked Wenxiu, but some people didn't agree. They suggested Wanrong instead. She was about the same age and had a similar background. Puyi decided to marry both Wanrong and Wenxiu, as was the tradition. After choosing Wanrong, she moved back to Beijing to prepare for the wedding. Palace workers taught Wanrong how to act with the Emperor. She wasn't happy about marrying someone she didn't know, but she agreed in the end. Their wedding had three parts. One was when Wanrong got gifts from Puyi at her home. On the wedding day, Wanrong walked over fire, a saddle, and an apple, as was the tradition. During the wedding, Puyi sat on his throne while people bowed to him. Wanrong wore a veil. Puyi said he didn't think much about marriage until he saw Wanrong's face under the veil. After the ceremony, they went to the Palace of Earthly Tranquility for the night. They didn't have their wedding night together. After they married, Wanrong lived in the Palace of Gathering Elegance, and Puyi lived in the Hall of Mental Cultivation. ==Life in the Forbidden City== Empress Wanrong of China had many servants who helped her with everything. She had her own kitchen and a tailor who made new dresses for her almost every day. When she took baths, her old maids helped her undress and clean. Afterward, she liked to sit by the basin and look at herself. Her personal servant, Sun Yaoting, said sometimes she was in a bad mood, but usually, she was kind to her servants and shared her food with them when she ate alone. Wanrong liked reading, listening to jazz music, eating Western food, playing the piano, writing in English, and taking photos. Her brother, Runqi, said she was traditional but also liked some Western things because she grew up in Tianjin's French part. She even taught Puyi how to eat with a fork and knife. Wanrong wrote poems, composed music, painted, and wrote letters in English. Although she was Empress and higher in rank than Puyi's other wife, Wenxiu, Wanrong saw Wenxiu as a rival. She once wrote a letter and a poem teasing Wenxiu, who lived nearby in the Palace of Eternal Spring. Wanrong's marriage with Puyi was unhappy, but she enjoyed studying. Her English tutor, Isabel Ingram, started teaching her in 1922. Another tutor, Hu Siyuan, said Wanrong was smart and eager to learn. Sometimes, Wanrong, Puyi, and Wenxiu left the Forbidden City to visit family or see sights. They even went to the Summer Palace in 1924. One time, they had tea with Puyi's English teacher, Reginald Johnston. Time magazine said Wanrong, who was called Elizabeth sometimes, spoke English with Johnston. Pujie, Puyi's brother, said tutors came to teach them every day in two-person palanquins. Even though she was 18 or 19 years old, Wanrong liked to play games with her maids and eunuchs. She didn't have many visitors besides her servants, so she was often lonely. Wanrong's servant, Sun Yaoting, said Puyi rarely slept with her in the Palace of Gathered Elegance. Wanrong kept the door curtain open at night, but if Puyi did come, she closed the door, and her maid went away. Puyi would be in a bad mood afterward. Reginald Johnston tried to make Puyi and Wanrong get along better, but it didn't work well. Sun remembered Puyi once brought a German bike for Wanrong to learn how to ride. They had fun, and everyone laughed when Sun tried and fell off. Another time, Wanrong stood up on a swing while Puyi's servants pushed it, making them all laugh. Sometimes, Wanrong sent servants to give money to poor people outside the Forbidden City. Wanrong started smoking cigarettes and then opium because of headaches and stomachaches. Later, people thought she might have had a mental problem like her father. ==Life in Tianjin== In October 1924, a warlord named Feng Yuxiang took control of Beijing. He made Puyi and his family leave the Forbidden City on 5 November. Wanrong's teacher, Ingram, saw soldiers when she arrived. She said, \"That day was the end of my beautiful China...\" After leaving Beijing, Puyi, Wanrong, and Wenxiu stayed at Puyi's father's house in Beijing, called the Prince Chun Mansion. Later, Puyi secretly went to the Japanese Legation in Beijing. They moved to the Japanese area in Tianjin on 24 February 1925. Wanrong and Wenxiu followed on 27 February. Later, they lived in the Zhang Garden in Tianjin and then moved in 1929 to the Quiet Garden Villa (Jing Garden) in the Japanese area of Tianjin.Rogaski, R: Hygienic Modernity, page 262. University of California Press, 2004 In Tianjin, they lived quietly. Wanrong liked going out and doing many things. But she started using opium, and soon she couldn't stop. She had some problems with her temper, but she didn't try to fix it. Many people used opium at that time. In Tianjin, Wanrong liked to do many things. She liked the theater, dancing, skating, horse- riding, and shopping. She liked shopping a lot. She used shopping to try to make Puyi like her more than Wenxiu. Puyi often took her to the Xinming Theater to see operas. Wanrong's friend Shuh Yun remembered playing mahjong with her at the Zhang Garden and going sightseeing. Puyi liked Wanrong more than Wenxiu. This made Wenxiu unhappy, and she left Puyi in 1931. When the big Yellow River floods happened in 1931, Wanrong gave away one of her pearl necklaces to help the people affected. ===Tianjin Diary Entries=== Wanrong wrote in her diary in Tianjin. She wrote about Wenxiu, her sicknesses, and how Puyi didn't care about her. On 2 May 1931, she wrote: On 25 June 1931, she wrote: In an entry without a date, she wrote: In her diary on 30 April 1931, Wanrong said she was sick three times in her seven years in Tianjin. She still had problems like \"panasthenia\" (neurasthenia) and irregular periods. Even though Puyi talked about illness and opium effects on pregnancy, she kept smoking opium. On 1 October 1931, she wrote that Wenxiu wanting a divorce was like treason to Puyi, \"It was the lunar 20 August. The Emperor talked about the treasonous act with me. I asked: 'is what was said in the press true?' The Emperor said: 'it's nothing but rumors.'\" On the same day, she wrote more about what she told Puyi: \"...I said: If you live alone I would know that. If you always find some excuse for going out alone, I would know that you have allowed her to live alone. If you go to see her, I would also know about it.\" Puyi wrote in his book that he started to feel \"great resentment\" for Wanrong after she made Wenxiu leave. They almost never talked to each other. == As Empress of Manchukuo == In late 1931, Yoshiko Kawashima took Wanrong from Tianjin to Dalian and then Port Arthur. Puyi wanted to restore the Qing dynasty. Initially unsure, Wanrong was convinced by Yoshiko Kawashima and moved secretly to Manchukuo. Despite attempts to escape, Wanrong was closely watched by the Japanese in Xinjing (Changchun). In March 1934, she became Empress of Manchukuo. She made few public appearances, seen sometimes with Prince Chichibu of Japan. Known for her skills in music and drawing, Wanrong struggled with her role and grew resentful towards the Japanese. Her marriage to Puyi worsened, marked by her opium addiction and secret relationships. Wanrong faced isolation and declining health until her death in 1946. == Secret affairs and mental health decline == Puyi and Wanrong's relationship worsened despite formalities like Wanrong paying tribute to him. Puyi would occasionally visit her at night but leave before midnight, causing Wanrong anger. Loneliness in Manchukuo led Wanrong to start smoking tobacco mixed with opium for relaxation, later using pure opium. She spent heavily on opium and fashion magazines. During Puyi's absences, Wanrong had secret relationships with Puyi's aides Li Tiyu and Qi Jizhong. Puyi sent Qi to a military school in Japan after discovering their affair. Li Tiyu, once caught wearing lipstick, claimed it was to please the \"Lord of Ten Thousand Years,\" leading to amusement but later conflict. Puyi's attempts to divorce Wanrong were blocked by the Kwantung Army. His plan to leave for Lushun was also thwarted by the Japanese, causing Wanrong distress. Wanrong gave birth to an illegitimate daughter, later killed by the Japanese in 1935. Wanrong either did not know or was misled about her daughter's fate. Confined to her quarters, Wanrong's health deteriorated due to heavy smoking and opium addiction, leading to neglect and isolation. ==Imprisonment and death== In August 1945, during the evacuation of Manchukuo amid the Soviet invasion of Manchuria, Puyi tried to evade Soviet capture. He, Wanrong, and their group traveled from Xinjing to (also known as Talizou) by train. Puyi then left alone for Tonghua and flew to Mukden. Wanrong stayed in Dalizi with Li Yuqin and others (). In January 1946, Communist guerillas captured Wanrong and her sister-in-law Hiro in Linjiang, Jilin. Soviet soldiers arrived in Dalizi looking to liberate Northeast China. They briefly met Li Yuqin and Wanrong before leaving them unharmed. Later, Wanrong and her group moved to Linjiang county. They faced hardships like frozen water and settled in a local hotel. Once, Li Yuqin visited Wanrong, who weakly gestured for her to sit. Wanrong made soft noises, causing Li Yuqin immense grief as Wanrong's eyes showed panic. They were eventually taken to Changchun by Chinese Communists led by He Changgong. Li Yuqin, Puyi's concubine, returned to her family later, but Wanrong had no home, her father in jail and her brother gone. She wandered with the army. Allegedly, Li Yuqin offered Wanrong a place, but her unsympathetic mother reported them, leading to their arrest. When the army left Changchun, they took Wanrong with them. In Jilin prison, Saga Hiro described Wanrong's suffering from opium withdrawal, rolling on the floor in agony. Wanrong, once empress, was displayed like a zoo animal, attracting spectators. She hallucinated, demanding opium and servants who weren't there, even commanding guards who laughed. Hated for her association with Puyi, few sympathized; a guard remarked, \"this one won't last.\" Due to the Chinese Civil War, Wanrong and Saga were moved to a prison in Yanji. Saga remembered Wanrong's final days, finding her fallen from her bunk in filth, too weak to eat. On 10 June, Wanrong, Saga Hiro, and their group were moved to Mudanjiang and Jiamusi. Too weak to stand, Wanrong was left behind by guards. She died aged 39 on 20 June 1946 in Yanji, Jilin province, from malnutrition and opium withdrawal, her burial place unknown. Three years later, Puyi learned from Saga Hiro's letter to Pujie of Wanrong's death, showing no emotion. In his memoir, Puyi reflected on Wanrong's tragic fate, wondering if divorce could have saved her. ==Cenotaph== On 23 October 2006, Wanrong's younger brother, Runqi, conducted a ritual burial for his sister at the Western Qing tombs. A photo owned by Runqi was buried there. A hand mirror belonging to Wanrong, also owned by Runqi, was chosen in hopes of placing it in a museum.末代皇后婉容衣冠冢入葬清西陵 ==Song== Wanrong composed a song titled \"Paper Kite\": Blue sky, a distant journey, the Himalayas seem short from where I stand I see the bustling world, standing on clouds, how can I truly be free? Sometimes playing strings and singing, wishing the spring breeze never stops blowing Relying on a single thread, with the wind god's help, soaring upwards Let not the rain master come to welcome, bamboo as the body and paper as clothes Occasionally meeting spring friends, saying you are 'high', and I am 'low' ==Ancestry== Wanrong and Puyi were descendants of Qianlong Emperor, this family tree shows the relationships between them and their siblings before they married. Legend: * – Emperors of Qing dynasty * – Prince Ding of the First Rank * – Prince Chun of the First Rank ==Awards and honours== * Grand Order of the Orchid Blossom (Manchukuo, 19 April 1934) * Order of the Precious Crown (Japan, 6 June 1934) ==Siblings== Wanrong had two brothers. Her older brother, Runliang (潤良; 1904–1925), married Puyi's eldest sister, Yunying (韞媖; 1909–1925), not to be confused with Jin Yunying. They did not have children. Wanrong's younger brother, Runqi (潤麒; 1912–2007), married Puyi's third sister, Yunying (韞穎; 1913–1992). They had two sons and one daughter. ==Portrayal in media== Wanrong was portrayed by Joan Chen in Bernardo Bertolucci's 1987 film The Last Emperor. In 2005, at the age of 93, Wanrong's brother, Runqi, expressed anger over the media and drama crews' portrayal of his sister. He sued, stating, \"As long as I live, I will not allow irresponsible fabrications and even personal insults about Wanrong's life story! Insulting!\" As late as the 2000s, Runqi recalled Wanrong's sorrowful expression when she was designated as Empress, which remained vivid in his memory. ==Related pages== *Wanrong Wikimedia photos ==References== Category:Emperors and Empresses of China Category:1906 births Category:1946 deaths",
 "title": "Wanrong"
}