{
 "id": "783440",
 "text": "Poor Liz (original Russian: Бедная Liz) is a Russian made-for-television movie. It was made in 2013 and first shown on television on January 2, 2014. It is a romantic comedy. ==Story== Joe Sokoloff is a sergeant in the Canadian police. He takes a vacation to his ancestral homeland, Russia. On his way, he his robbed while sleeping on a train. He discovers this just as the train makes a short stop in a small town. He sees a young woman chasing after a who had not paid for pastries he had bought from her. Joe dashes off the train to help. He then is taken to the police station with the man and the woman. The local police officer wants a report. Now Joe has missed his train. The woman takes him in while he waits for the Canadian embassy to fix things for him. Despite many comedic cultural mistakes, the woman, Liza, grows to like him. He falls in love with her. Liza has a daughter who is mute because of having been kidnapped earlier. Joe is kind to the daughter, Olya. She gradually opens up to him. She eventually regains her speech. The first step is when she sees a horse and tries to say the word. After several times when she got mad at Joe, Liza finally understands that she loves him. But Joe disappeared for three days after her last outburst. Olya tells Liza that Joe will return. Then he does return. He explains to Liza that he had to get things straightened out with the embassy. He says he also had bought a horse and buggy. Olya is very happy. The three ride through town in the buggy. ==Cast== ===Crew=== Writers:Leonora Pashenko and Elena Zueva Director: Alexsey Lisovets Producers: Vladislav Ryashin Executive producer: Vadim Zhuk and Larisa Zhuravskaya Music: Vladimir Kripak and Maksim Velichko Cinematography: Vasiliy Borodin ===Actors=== * Mariya Mashkova (as Liza) * Anton Pampushnyy (as Joe) * Niyole Seryozhnikova (as Olya) ==References== ==Other websites== * The movie online with English subtitles: https://www.youtube.com/watch?v=8IZc_0Q20BY Category:Russian movies Category:Television movies",
 "title": "Poor Liz"
}