{
 "id": "783655",
 "text": "Shinichi Oishi is a Japanese mathematician at Waseda University. He is also the director of Japan Society for Industrial and Applied Mathematics and Japan Society for Simulation Technology. ==Research== Oishi has done many studies in numerical analysis and their branches: * Validated numericsHoffman, N., Ichihara, K., Kashiwagi, M., Masai, H., Oishi, S., & Takayasu, A. (2016). Verified computations for hyperbolic 3-manifolds. Experimental Mathematics, 25(1), 66-78.He also supported the development of INTLAB (made by MATLAB and GNU Octave). * Numerical linear algebraOishi, S., & Rump, S. M. (2002). Fast verification of solutions of matrix equations. Numerische Mathematik, 90(4), 755-773.Morikura, Y., Ozaki, K., & Oishi, S. (2013). Verification methods for linear systems using ufp estimation with rounding-to-nearest. Nonlinear Theory and Its Applications, IEICE, 4(1), 12-22.Ozaki, K., Ogita, T., Oishi, S., & Rump, S. M. (2012). Error-free transformations of matrix multiplication by using fast routines of matrix multiplication and its applications. Numerical Algorithms, 59(1), 95-118. * OptimizationOishi, S., & Tanabe, K. (2009). Numerical Inclusion of Optimum Point for Linear Programming. JSIAM Letters, 1, 5-8. * Numerical integrationYamanaka, N., Okayama, T., Oishi, S., & Ogita, T. (2010). A fast verified automatic integration algorithm using double exponential formula. Nonlinear Theory and Its Applications, IEICE, 1(1), 119-132.Yamanaka N., Okayama T., Oishi S. (2016) Verified Error Bounds for the Real Gamma Function Using Double Exponential Formula over Semi-infinite Interval. In: Kotsireas I., Rump S., Yap C. (eds) Mathematical Aspects of Computer and Information Sciences. MACIS 2015. Lecture Notes in Computer Science, vol 9582. Springer, Cham. * Numerical methods for partial differential equationsLiu, X., & Oishi, S. (2013). Verified eigenvalue evaluation for the Laplacian over polygonal domains of arbitrary shape. en:SIAM Journal on Numerical Analysis, 51(3), 1634-1654. ==Career== Year Notes Since 1980 Teacher at Waseda University 1990 Received the Azusa Ono Memorial Award (:ja:小野梓記念賞)Waseda University Go Club also received this award. 1993, 1995 and 1997 Best Paper Award from the IEICE (The Institute of Electronics, Information and Communication Engineers) Since 2011 Visiting professor at the Pierre and Marie Curie University,Named after Marie Curie France 2012 Received the Medal with Purple Ribbon by the government 2019 - 2023 ICIAM 2023 director 2020 :en:Person of Cultural Merit ==References== category:1953 births category:Japanese mathematicians category:Living people Category:Waseda University faculty Category:Waseda University alumni",
 "title": "Shinichi Oishi"
}