{
 "id": "783747",
 "text": "Katherine Grace McNamara (born November 22, 1995 in Kansas, Missouri) is an American actress. She commonly known as Katherine McNamara. She is famous for her role, Clary Fray, in the fantasy television series Shadowhunters. She also played the character Mia Smoak in Arrow. == Roles == === Movie === Year Title Role Notes 2008 Matchmaker Mary Mary Carver 2009 Sam Steele and the Junior Detective Agency Emma Marsh 2011 Sam Steele and the Crystal Chalice Emma Marsh 2011 New Year's Eve Lily Bowman 2013 Contest Sarah O'Malley 2014 Tom Sawyer & Huckleberry Finn Becky Thatcher 2015 A Sort of Homecoming Rosa 2015 Monsterville: Cabinet of Souls Lilith 2015 Maze Runner: The Scorch Trials Sonya 2016 Little Savages Tiffany 2016 Natural Selection Paige Thomas 2016 Is That a Gun in Your Pocket? Sandy Keely 2018 Maze Runner: The Death Cure Sonya 2019 Assimilate Hannah 2021 Trust Amy Originally titled Push 2021 Finding You Taylor Risdale Originally titled There You'll Find Me 2021 Untitled Horror Movie Chrissy Direct-to-video movie; also executive producer 2022 Sugar Chloe Belle Streaming movie; also known as Danger Below Deck 2023 Fool's Paradise Terry Formerly known as El Tonto The Adventures of Bunny Bravo Cat Completed === Television === Year Title Role Notes 2011 Law & Order: Special Victims Unit Jasmine Episode: \"Flight\" 2011 30 Rock Meagan Episode: \"TGS Hates Women\" 2011 Drop Dead Diva Ann Logan Episode: \"Ah, Men\" 2012–2013 Kickin' It Claire 3 episodes 2012 Glee Bunhead #1 Episode: \"Makeover\" 2012 Girl vs. Monster Myra Santelli Television movie 2012 Sketchy Iris Episode: \"This Is 14\" 2012 Madison High Cherri O'Keefe Pilot 2013 Touch Evie Woods Episode: \"Reunions\" 2013 Jessie Bryn Breitbart 2 episodes 2013 The Haunting Hour: The Series Jodanna Episode: \"Worry Dolls\" 2013 The Thundermans Tara Campbell Episode: \"Dinner Party\" 2013 The Surgeon General Lily Sherman Pilot 2014–2016 Transformers: Rescue Bots Priscilla Pynch 6 episodes 2014 CSI: Crime Scene Investigation Angela Ward / Tangerine Episode: \"Long Road Home\" 2014 Workaholics Haley Episode: \"Beer Heist\" 2014 Unforgettable Young Carrie Wells Episode: \"Reunion\" 2014 Happyland Harper Munroe Main role 2014 A Wife's Nightmare Jackie Television movie 2015 The Fosters Ekaterina 3 episodes 2016–2019 Shadowhunters Clary Fray Main role 2016 The Grinder Ginger Episode: \"From the Ashes\" 2016 Indiscretion Lizzy Simon Television movie 2018–2020 Arrow Mia Smoak Recurring role (season 7); main role (season 8) 2018 Happy Together Sarah Episode: \"Home Insecurity\" 2019 Spirit Riding Free: Spirit of Christmas Sally Jessup Voice role 2019 Supergirl Mia Smoak Episode: \"Crisis on Infinite Earths Part 1\" 2019 Batwoman Mia Smoak Episode: \"Crisis on Infinite Earths Part 2\" 2019, 2021 The Flash Mia Smoak Episodes: \"Crisis on Infinite Earths Part 3\", \"Armageddon, Part 5\" 2020 Kappa Kappa Die Charise Television special 2021 The Stand Julie Lawry Miniseries; recurring role 2022 Love, Classified Taylor Bloom Television movie (Hallmark Channel) 2022–2023 Walker: Independence Abby Walker Main role == References == == Other websites == * * Katherine McNamara on Facebook * Katherine McNamara on Twitter * Katherine McNamara on Instagram Category:1995 births Category:American child actors Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Kansas City, Missouri Category:Living people",
 "title": "Katherine McNamara"
}