{
 "id": "78389",
 "text": "The Gaelic Athletic Association (GAA) (Irish: Cumann Lúthchleas Gael) is an organisation which is mostly focused on promoting Gaelic Games - traditional Irish sports, such as hurling, camogie, Gaelic football, handball, and rounders. The organisation also promotes Irish music and dance, and the Irish language. It is the largest and most popular organisation in Ireland with some 800,000 members out of the island's population of almost 6 million. Gaelic football and Hurling are the main and most popular activities promoted by the organisation. Gaelic football is a contact sport that combines the skills of soccer, basketball, and some of the skills of volleyball in a high-scoring game in which players punch or kick the ball over the crossbar for one point, or kick the ball into a net on the bottom for three points. The game also has similarities with Australian Rules Football (see below). Hurling is a stick- and-ball game that combines many of the skills of field hockey, lacrosse, and baseball but pre-dates all three. Players can catch the ball and use a hurley (Irish: camán) to hit a ball (sliotar) between the goalposts using the same scoring system as in Gaelic football and on the same size of field. It is not to be confused with the Scottish game of shinty. ==Bibliography== * The GAA: A History by Marcus de Burca, Gill & MacMillan, 1984 & 2000, * Illustrated History of the GAA, by Eoghan Corry, Gill & MacMillan, 2005, * The GAA Book of Lists, by Eoghan Corry, Hodder Headline, 2005, * The Gaelic Athletic Association And Irish Nationalist Politics 1884-1924 by W F Mandle (Gill & MacMillan and Christopher Helm 1987). 240pp * Michael Cusack and The GAA by Marcus De Burca, Anvil, 1989, 192pp, * Micheal Ciosog by Liam P O Cathnia, Clochomhar Tta, 1982. * Croke Of Cashel by Mark Tierney, Gill And MacMillan, 1976. * Maurice Davin (1842-1927) First President Of The GAA by Seamus O'Riain, Geography Publications, 1994, * Croke Park by Tim Carey, Collins Press, 2004, * God and the Referee: Unforgettable GAA Quotations, by Eoghan Corry, Hodder Headline, 2005, * History of Hurling, by Seamus King, Gill & MacMillan, 2005, * Sceal Na hIomana by Liam P O Cathnia, Clochomhar Tta, 1980. * Caman, 2000 Years Of Irish Hurling by Art O Maolfabhail, 1973. * Gaelic football, by Jack Mahon, Gill & MacMillan, 2002 & 2006, * Bairi Cos In Eirinn by Liam P O Cathnia, Clochomhar Tta, 1984. * Legends of the Ash, by Brendan Fullam, Wolfhound Press, 1998, ==References== == Other websites == *GAA official website *Rules and Regulations Part 1 *Rules and Regulations Part 2 *An Fear Rua: The GAA Unplugged! - analysis, discussion forums, satire and humour on GAA topics. *Hogan Stand *National GAA Results and Fixtures on Aertel *Local GAA Results and Fixtures on Aertel *GAA World by The Irish News *Index of GAA club sites *Squareball - The First GAA Fashion Brand *GAA News Results and Fixtures from Sports.ie *GAA Results *Hurling Blog - News, analysis, stats and opinion on hurling *Michael Cusack Visitor Centre Category:Sport in Ireland",
 "title": "Gaelic Athletic Association"
}