{
 "id": "783829",
 "text": "Chetopa is a city in Labette County, Kansas, United States. In 2020, 929 people lived there. Chetopa was named after Chief Chetopah, an Osage Indian chief. Later, the community name was shortened.Kansas Place-Names, John Rydjord, University of Oklahoma Press, 1972, p. 435 ==History== The community started as an Osage village. It was named after its Chief Chetopah, whose name in the Osage language signifies \"four lodges\".Reminiscences of a trader in the Osage Country, James Edwin Finney written down by Joseph B. Thoburn In 1847 a trading post to exchange goods with the Osage Nation was built here by Larkin McGhee. By the time McGhee came, there were three other Euro-American families and two families with a Euro-American husband and a Cherokee wife at Chetopa. There were also many Osage there.transcription from the History of Labette County by Nelson Case Chetopa was the where a September 18, 1861 battle between the 6th Kansas Cavalry under the direction of James G. Blunt and pro- slavery raiders led by John Allan Mathews happened. Mathews's wife was an Osage and was culturally identified with the Osages.Kansas Memory entry on Mathews The first post office in Chetopa was built in April 1867. In 1880, Postmaster J.M. Cavaness removed the ending “h” in the original spelling to become Chetopa. ==Geography== Chetopa is at (37.037437, -95.092249). The United States Census Bureau says that the city has a total area of . Of that, is land and is water. ===Climate=== Chetopa has hot, humid summers and generally mild to cool winters. The Köppen Climate Classification system says that Chetopa has a humid subtropical climate. It is shortened to \"Cfa\" on climate maps.Climate Summary for Chetopa, Kansas ==People== ===2020 census=== The 2020 census says there were 929 people, 430 households, and 233 families living in Chetopa. Of the households, 70.0% owned their home and 30.0% rented their home. The median age was 49.9 years. Of the people, 86.9% were White, 4.2% were Native American, 1.4% were Black, 1.1% were Asian, 0.1% were Pacific Islanders, 0.1% were from some other race, and 6.2% were two or more races. Hispanic or Latino of any race were 0.8% of the people. ===2010 census=== The 2010 census says that there were 1,125 people, 493 households, and 292 families living in Chetopa. ===2000 census=== The 2000 census says that there were 1,281 people, 560 households, and 341 families living in Chetopa. ==Related pages== *Great Flood of 1951 ==References== ==Other websites== ;City * City of Chetopa * Chetopa - Directory of Public Officials ;Schools * USD 505, local school district ;Maps * Chetopa City Map , KDOT Category:Cities in Labette County, Kansas Category:1857 establishments in Kansas Territory",
 "title": "Chetopa, Kansas"
}