{
 "id": "784000",
 "text": "Hurricane Fay was a 2014 hurricane in the Atlantic Ocean. It was the first hurricane to make landfall on Bermuda since Emily in 1987. The sixth named storm and fifth hurricane of the 2014 Atlantic hurricane season, Fay formed several hundred miles northeast of the Lesser Antilles on October 10. Initially a large subtropical cyclone, the storm gradually turned into a tropical cyclone on October 11 as it turned north. Despite being disrupted by wind shear for most of its duration, Fay steadily intensified. Turning east, Fay briefly achieved Category 1 hurricane status on October. Fay made landfall on Bermuda early on October 12 as a hurricane. Wind shear finally caused Fay to weaken to a tropical storm later that day. Fay weakened into an open trough early on October 13\\. A few tropical cyclone warnings and watches were issued due to Fay on Bermuda. Despite its low strength, Fay caused much damage on Bermuda. Wind gusts over 100 mph (155 km/h) blocked roads with downed trees and poles. The winds also left a majority of the island's electric customers without power. The terminal building at L.F. Wade International Airport was flooded due to damage to its roof. Along the coast, the storm destroyed numerous boats and unmoored many others. Immediately after the hurricane, 200 Bermuda Regiment soldiers were called for cleanup and to help in damage repairs. These occurred at the same time as preparations for the stronger Hurricane Gonzalo, which struck the island less than six days later and increased the damage. Fay and Gonzalo were the first pair of hurricanes to make landfall in Bermuda in the same season. ==Notes== == Related pages == * Hurricane Fabian (2003) * Hurricane Gonzalo (2014) * Hurricane Joaquin (2015) * Hurricane Nicole (2016) ==References== ==Other websites== ** \"Hurricane Fay's Force as viewed from Bermuda's north shore. *Hurricane Fay advisory archive from the National Hurricane Center *Videos from The Royal Gazette, hosted on YouTube: **\"Tropical Storm Fay\" **\"TS Fay St Georges\" **\"TS Fay Clean Up – Bermuda\" *Photo gallery of storm damage from Bernews.com, hosted on Imgur Fay Fay Fay Fay",
 "title": "Hurricane Fay"
}