{
 "id": "784151",
 "text": "Ranoidea is a genus of frogs in the subfamily Pelodryadinae. They live in Australia, New Guinea, the Maluku Islands, and the Louisiade Archipelago. Scientists still disagree with each other about whether Ranoidea should be its own genus or not and which frogs should be in it. Many of the frogs in Ranoidea used to be in Litoria, Dryopsophus, or Hyla. In 2016, one team of scientists wrote a paper saying Litoria should be divided up into other genuses. Many other amphibian scientists read it and agreed, but some did not. One reason for this was that not all of the frogs in Litoria had been studied on the DNA level.Simmons, M.P. 2012. Misleading results of likelihood‐based phylogenetic analyses in the presence of missing data. Cladistics 28(2): 208-222. DOI: 10.1111/j.1096-0031.2011.00375.x)Dunn, K.A., McEachran, J.D., & Honeycutt, R.L. 2003. Molecular phylogenetics of myliobatiform fishes (Chondrichthyes: Myliobatiformes), with comments on the effects of missing data on parsimony and likelihood. Molecular Phylogenetics and Evolution 27(2): 259-270. DOI: 10.1016/S1055-7903(02)00442-6Kearney, M. 2002. Fragmentary taxa, missing data, and ambiguity: mistaken assumptions and conclusions. Systematic biology 51(2): 369-381. DOI:10.1080/10635150252899824Xi, Z., Liu, L., & Davis, C.C. 2016. The impact of missing data on species tree estimation. Molecular Biology and Evolution 33(3): 838-860. DOI: 10.1093/molbev/msv266McDonald, K.R., Rowley, J.J., Richards, S.J., & Frankham, G.J. (2016). A new species of treefrog (Litoria) from Cape York Peninsula, Australia. Zootaxa 4171(1): 153-169. DOI: 10.11646/zootaxa.4171.1.6 ==Description and ecology== All frogs in Ranoidea have side-to-side pupils that open up-and-down and no coloring in their eyelid membrane. Many species have tadpoles that swim in mountain streams and have very large mouths on the undersides of their bodies. ==Species== The following species are or were recognized in the genus Ranoidea: Scientists also think the Papua big-eyed tree frog (Van Kampen, 1909) might be in Ranoidea but they want to collect more data about where the frog lives first. ==References== Category:Pelodryadidae Category:Frogs of Oceania Category:Taxonomy",
 "title": "Ranoidea (genus)"
}