{
 "id": "784475",
 "text": "Branko Kostić (Serbian Cyrillic: Бранко Костић, 28 August 1939 – 20 August 2020) was a Yugoslav politician, businessman, university professor. == Biography == He graduated from the Faculty of Economics in 1962, received his master's degree in 1977, doctorate in 1980; all at the Faculty of Economics in Belgrade. He held numerous responsible political functions during the Socialist Federal Republic of Yugoslavia (SFRY): \\- Chairman of the Central Committee of the Youth Federation of Montenegro (1963-1968) \\- Deputy Prime Minister of Montenegro (1986-1989) \\- President of the Presidency of Montenegro (1989-1991) \\- Delegate to the SFRY Assembly and Chairman of the Delegation of Montenegro to the Council of Republics and Provinces (1991) \\- Vice-President of the Presidency of the SFRY and later acting President of the Presidency of the SFRY (from mid-May 1991 to the middle of June 1992, when this post was abolished). As President of the Presidency of Montenegro, he was chairman of the Committee for the transfer of the remains of king Nikola I Petrovic-Njegos and members of the royal family from San Remo, Italy to Cetinje, Montenegro.\"Who's who in Montenegro\", Budva, 2004; Historical Lexicon of Montenegro In the 1970s, he built industrial career and his name is associated with the most successful years of growth and development of what was then the largest company in Montenegro. He was an advisor and then a commercial (1969-1974) and general manager of the Aluminum Combine in Titograd (1974-1978). After leaving the Aluminum Combine, he continued his career at the University of Montenegro. He was a scientific advisor at the Institute for Technical Research, one of the founders of the Faculty of Civil Engineering and a full professor of economics at all technical faculties, until retiring in 2003. A full overview of published works was given in his bio-bibliography in the Memorial of the Faculty of Civil Engineering (Memorial, 2000).ed.Vujovic, Arsenije (2000). Memorial of the Faculty of Civil Engineering. Podgorica: University of Montenegro, Faculty of Civil engineering in Podgorica. pp. 53–56. He spoke Russian and French, and used English. He was the bearer of the Order of Work with a Golden Wreath and of the Memorial for his contribution to the preservation of Yugoslav statehood and the affirmation of ethnic and self-determined Yugoslavs.Elster, Robert J (2004). The international Who’s Who. London: Europa Publications, Taylor & Francis Group. == Published books == \\- \"Aluminium and Technical Progress\", Institute za technical istraživanja – Tehnički fakulteti, Titograd, 1981. \\- \"1991 - Not to be forgotten\", Filip Višnjić, Beograd and Obodsko slovo, Rijeka Crnajevića, 1996 Kostić, Branko (1996). 1991: da se ne zaboravi. Beograd; Rijeka Crnojevića: Filip Višnjić ; Obodsko slovo. ISBN 978-86-7363-173-8. OCLC 36571014 \\- \"Records\", Vaša Knjiga, Beograd and Pegaz, Bijelo Polje, 2005Kostić, Branko (2005). Zapisi. Bijelo Polje: Vaša knjiga. ISBN 978-86-7792-007-4. OCLC 213383856 \\- \"The truth about the breaking up of Yugoslavia - My testimony in the Hague\", Pegaz, Bijelo Polje, 2010Kostić, Branko; International Tribunal for the Prosecution of Persons Responsible for Serious Violations of International Humanitarian Law Committed in the Territory of the Former Yugoslavia since 1991 (2010). Istina o razbijanju Jugoslavije: moje svjedočenje u Hagu. Podgorica: Pegaz. ISBN 978-86-7792-244-3. OCLC 671492067 \\- \"Fishing of Ceklin\", Pegaz, Bijelo Polje, 2011Maribor, IZUM-Institut informacijskih znanosti. \"Цеклински риболови : на Скадарском језеру у Црној Гори :: COBISS+\". plus.cg.cobiss.net. Retrieved 2021-08-10 \\- \"Kostići: Fraternity in Ceklin, Old Montenegro; genealogy (from about 1490 to 2013)\", Pegaz, Bijelo Polje, 2014Kostić, Branko (2014). Kostići: bratstvo u Ceklinu, Stara Crna Gora ; rodoslov (od oko 1490. do 2013). Podgorica: Pegaz. ISBN 978-86-7792-354-9. OCLC 934637671 \\- \"I didn't step down the oath: interviews, speeches, statements, Books 1 & 2\", Pegaz, Bijelo Polje, 2015Kostić, Branko (2015). Nijesam pogazio zakletvu: intervjui, govori, izjave Tom 1 Tom 1. ISBN 978-86-7792-375-4. OCLC 1099735390 == References == Category:1939 births Category:2020 deaths Category:Presidents of Yugoslavia",
 "title": "Branko Kostić"
}