{
 "id": "784492",
 "text": "The candy desk has been a tradition of the United States Senate since 1968, where a United States senator sits at a specific desk near a busy entrance keeps a drawer full of candy for members of the body. The current occupant of the candy desk is Pennsylvania Senator Pat Toomey. ==People who sat at the Candy Desk== Dates Senator State Candy brands Ref. 1968 – January 3, 1971 George Murphy California – January 21, 1971 – January 3, 1977 Paul Fannin Arizona Hard candies Congressional Directory 92nd Congress First Session. United States Government Printing Office. 1971. Retrieved January 15, 2011 January 4, 1977 – January 15, 1979 Harrison Schmitt New Mexico Hard candies January 5, 1981 – January 3, 1983 Roger Jepsen Iowa Hard candies 1981 Official Congressional Directory. United States Government Printing Office. 1981. Retrieved January 15, 2011 January 3, 1983 – January 3, 1985 Steve Symms Idaho \"Fine assortment of sweets\" from \"candy and chocolate associations.\" 1983–1984 Official Congressional Directory. United States Government Printing Office. 1983. Retrieved January 15, 2011 January 3, 1985 – January 3, 1987 Slade Gorton Washington \"'Ample quantities' of candies made in his home state\" 1985–1986 Official Congressional Directory. United States Government Printing Office. 1985. Retrieved January 15, 2011 January 3, 1987 – January 3, 1989 John McCain Arizona – 1987–1988 Official Congressional Directory. United States Government Printing Office. 1987. Retrieved January 15, 2011 January 3, 1989 – January 5, 1993 Slade Gorton Washington – 1989–1990 Official Congressional Directory. United States Government Printing Office. 1989. Retrieved January 15, 2011 January 5, 1993 – January 3, 1995 Jim Jeffords Vermont – 1993–1994 Official Congressional Directory. United States Government Printing Office. 1993. Retrieved January 15, 2011 January 4, 1995 – January 7, 1997 Bob Bennett Utah – 1997–1998 Official Congressional Directory. United States Government Printing Office. 1997. Retrieved January 15, 2011 January 7, 1997 – January 3, 2007 Rick Santorum Pennsylvania The Hershey Company and Just Born products January 3, 2007 – June 4, 2007 Craig Thomas Wyoming Small local Wyoming confectionery businesses and chocolatiers June 25, 2007 – January 3, 2009 George Voinovich Ohio Spangler Dum Dum Pops, Mars, Incorporated products, and Harry London Senate Chamber Map: 110th Congress . United States Senate. Retrieved January 15, 2011 January 3, 2009 – September 9, 2009 Mel Martinez Florida – September 10, 2009 – January 3, 2011 George LeMieux Florida \"Mini Hershey bars and Werther's Originals\" February 14, 2011 – January 7, 2015 Mark Kirk Illinois Wrigley's Gum, Garrett's Popcorn, Tootsie Rolls and Jelly Belly January 7, 2015 – Pat Toomey Pennsylvania Just Born Quality Confections, Josh Early Candies, Mars products (3 Musketeers), Hershey products ==References== Category:United States Senate",
 "title": "Candy Desk"
}