{
 "id": "78518",
 "text": "Ye (born Kanye Omari West; June 8, 1977) is an American rapper, singer and record producer from Chicago, Illinois. He rose to fame in the mid 2000s. His first three albums, The College Dropout, Late Registration, and Graduation received many awards, critical acclaim,http://www.metacritic.com/kanye_west and commercial success. In 2008, he released his fourth album, 808s & Heartbreak. In 2010, he released his fifth album, titled My Beautiful Dark Twisted Fantasy. In 2013, he released his sixth album, Yeezus. Yeezus obtained great reviews from many music critics. In 2016, he released his seventh album, The Life of Pablo. In 2018, he released his eighth album, Ye. West explored Christian and gospel music on his 2019 album Jesus Is King. His tenth album Donda was released in 2021. West's discography also includes four full-length collaborative albums Watch the Throne (2011) (with Jay-Z), Kids See Ghosts (2018) (with Kid Cudi), Vultures 1 (2024) (with Ty Dolla Sign), and Vultures 2 (2024) (with Ty Dolla Sign). ==Early life== Kanye Omari West was born at Grady Memorial Hospital; in Atlanta, Georgia. He was from a middle-class African- American family. He moved with his mother to Chicago, Illinois when he was three years old. During the same time, his mother and father divorced. He started writing poetry at the age of five. Kanye moved with his mother to Nanjing, China when he was 10. In 1997 West started taking painting classes at Chicago's American Academy of Art. After a short time he changed to Chicago State University to major in English. When he was 20 he left college to focus on music. == Career == West started his music career as a producer creating beats for local Chicago artists. He was well known in these beats to take samples of old and popular soul songs, speed them up, raise the pitch and put these samples in his beats to enhance the sound. This is called Chipmunk Soul. In the late 1990s, West became a member of the amateur rap group called Go- Getters with GLC, Timmy G, and Really Doe. In 1999 they released their only album, World Record Holders. In 2003 West released his first mixtape, Get Well Soon.... In Get Well Soon.... He rapped on an instrumental from Twista's single \"Slow Jamz\". In 2004. West's first album The College Dropout was released by Roc-A-Fella. It entered the Billboard 200 at number two. Five singles were released from the album. That year West started a record label called GOOD Music. John Legend is signed to the label. West was nominated for three American Music Awards. In 2005 West's second album Late Registration was released. Five singles were released from the album. The second single \"Gold Digger\" was nominated for Record of the Year at the 2006 Grammy Awards. West was also nominated for Best New Artists. Other rappers on the album included Jay-Z, Ludacris, and Mos Def. In 2005 West released his first fashion line. West's third album Graduation was released in 2007. The album was nominated for eight Grammy Awards. Five singles were released from the album. The album's first single \"Stronger\" won a Grammy Award for Best Rap Solo Performance. In 2008, West's fourth studio album 808s & Heartbreak was released. The album was sung instead of rapped by West. It sold 450,145 copies in its first week. West acted in the 2008 movie The Love Guru. My Beautiful Dark Twisted Fantasy was released on Roc-A-Fella Records in 2010. Music critics gave it great reviews. Pitchfork gave the album a score of 10/10. Pitchfork rarely gives a 10/10 rating, so this was a big achievement. Rolling Stone gave it five out of five stars. Four singles were released from the album. In 2011 West released an album with Jay-Z called Watch the Throne. In 2011 \"All of the Lights\" was released as the fourth single from My Beautiful Dark Twisted Fantasy. Rihanna sang in it. On May 23, 2012 a short movie made by West called Cruel Summer was shown for the first time at the 2012 Cannes Film Festival. The movie was given good reviews. The movie's name came from an album West released called Cruel Summer on his record label GOOD Music. On June 18, 2013 West's sixth studio album Yeezus was released. The album got very good reviews from music critics. In November 2013 West gave a lecture at Harvard University. On November 15, 2013 Busta Rhymes' single \"Thank You\" was released. West rapped on it with Lil Wayne and Q-Tip. On November 24, 2013, West said in an interview that he is making his seventh album. \"New Slaves\" was nominated for Best Rap Song at the 2014 Grammy Awards. On June 27, 2015, West headlined Glastonbury Festival 2015 to much controversy. On February 14, 2016, West released The Life of Pablo on Tidal, Jay-Z's online music service. On April 1, 2016, West released The Life Of Pablo on other music services, including Spotify, Apple Music, and Google Play. On June 1, 2018, West released Ye, an album about his mental health struggles. In 2018 West released a collaborative album with Kid Cudi called Kids See Ghosts. On October 25, 2019, West released Jesus is King, a religious hip-hop album. It became the first to top the Billboard 200, Top R&B;/Hip-Hop Albums, Top Rap Albums, Top Christian Albums and Top Gospel Albums charts at the same time. West released a single called \"Wash Us in the Blood\" on June 30, 2020, featuring rapper and singer Travis Scott. \"Wash Us in the Blood\" is the first single from West's tenth studio album Donda. On August 29, 2021, after a long roll out, West released Donda. In 2022, West released Donda 2 only on a music listening device he created known as the Stem Player. It was however, later released onto spotify under the artist profile \"DONDA\" in 2025. ==Personal life== West married Kim Kardashian in 2014. They have a daughter, North \"Nori\" West, who was born on June 15, 2013. They also have a son, Saint West, who was born on December 5, 2015. Their third child, daughter Chicago West, was born on January 15, 2018. They had their fourth child on May 9, 2019, a son named Psalm West. In January 2021, CNN reported that the couple were discussing divorce. On February 19, 2021, the couple officially filed for divorce. The divorce became official in 2022. In January 2023, it was reported that West had informally married Australian architectural designer Bianca Censori in a private ceremony in Beverly Hills, California. The ceremony had no legal standing; the couple did not file for a marriage license. West said Censori is his muse. ==2020 presidential campaign== In August 2015 during MTV Video Music Award, West announced his candidacy for President of the United States in the 2020 election. In September 2015, West announced that he intends to run for President of the United States in 2020. He later implied on Twitter that he intends to run for President in 2024 due to Donald Trump's win in the 2016 election. On December 13, 2016, West met with President-elect Trump to discuss (according to West) \"bullying, supporting teachers, modernizing curriculums, and violence in Chicago.\" On July 4, 2020, West announced on Twitter that he would be running in the 2020 presidential election, although it's unclear if he has filed official paperwork to appear on ballots. Ultimately, he did not become President of the United States of America. ==Discography== ===Studio albums=== Kanye West has released 10 studio albums: Year Album 2004 The College Dropout 2005 Late Registration 2007 Graduation 2008 808s & Heartbreak 2010 My Beautiful Dark Twisted Fantasy 2013 Yeezus 2016 The Life of Pablo 2018 Ye 2019 Jesus Is King 2021 Donda 2025 Donda 2 ===Collaborative albums=== Year Album 2011 Watch the Throne 2018 Kids See Ghosts 2024 Vultures 1 (with Ty Dolla Sign as ¥$) 2024 Vultures 2 (with Ty Dolla Sign as ¥$) ==Controversies== On October 9, 2022, West said on Twitter that he would be “going death con 3 On JEWISH PEOPLE\", seemingly a misspelling of DEFCON 3. This suggested he was anti-semitic. He also said he supported Adolf Hitler and denied the existence of the Holocaust. This continued with his new song Heil Hitler, as it generated further criticism and bans, especially in countries such as Germany. == Related pages == *List of poets from the United States ==Notes== == References == == Other websites == * KanyeWest.com * Kanye Talk * Kanye West at Rocafella Records * Kanye West's iTunes Celebrity Playlist * * Allmusic.com artist page * * Kanye West Tabs at Homemusician.net * Tiny Mix Tapes on Kanye * Kanye's new album, Graduation, at Power 105.1 - NYC * 30 Days Fasting Category:1977 births Category:21st-century American rappers Category:21st- century American singer-songwriters Category:African-American movie directors Category:African-American rappers Category:American billionaires Category:American Christians Category:American fashion designers Category:American activists Category:American hip hop singers Category:American record producers Category:American R&B; singers Category:Antisemitism Category:Brit Award winners Category:Businesspeople from Atlanta Category:Businesspeople from Chicago Category:Christian music singers Category:Converts to Christianity Category:American Grammy Award winners Category:Kardashian family Category:Living people Category:Movie directors from Illinois Category:Obscenity controversies Category:Participants in American reality television series Category:People with bipolar disorder Category:Philanthropists from Illinois Category:Rappers from Atlanta Category:Restaurateurs Category:Singer-songwriters from Chicago Category:Singers from Illinois",
 "title": "Kanye West"
}