{
 "id": "785334",
 "text": "Hurricane Laura was a deadly and destructive tropical cyclone. Hurricane Laura, the 1856 Last Island hurricane and Hurricane Ida are the strongest hurricanes to make landfall in Louisiana in terms of maximum sustained winds, and the strongest to affect Louisiana since Hurricane Camille brought category 5 winds to the rural southeast portion of the state. The twelfth named storm, fourth hurricane, and first major storm of the record-breaking 2020 Atlantic hurricane season, Laura formed from a tropical wave that moved off the coast of West Africa on August 16, and formed into a tropical depression by August 20. On August 21, Laura strengthened into a tropical storm, becoming the earliest twelfth named storm, and breaking 1995's Hurricane Luis's record by eight days. Laura first moved over the Lesser Antilles and brushing Puerto Rico as a tropical storm. It made landfall in the resort city of Punta Cana, Dominican Republic, killing four people in the Dominican Republic and 31 in Haiti. The storm then moved over the entire island of Cuba, forcing the evacuation of more than 260,000 people. Then, the outer rainbands of Laura moved over parts of the Florida Keys and Southern Florida. It then moved over the warm Gulf of Mexico, strengthening slowly at first, before undergoing rapid intensification by August 26\\. Later that day, Laura became a major hurricane, and soon reached a peak intensity of , making it a Category 4 hurricane. Then, just a couple of hours after reaching peak intensity, at 6:00 UCT on August 27, Laura made landfall in Cameron, Louisiana just below peak intensity with 150 mph (240 km/h) and a pressure of 939 mbar, at the same wind speed of the 1856 Last Island hurricane. It was the 10th strongest tropical cyclone to ever hit the United States in terms of wind speed, killed 42 people in the U.S, and caused $19 billion in damage on the Gulf Coast of the United States and inland areas. After landfall, Laura weakened, falling to tropical storm status later in the day, and tropical depression status over Arkansas the next day. On August 29, Laura weakened to a remnant low over Kentucky, before being absorbed by an extratropical cyclone over the East Coast. Overall, Laura caused $19.1 billion in damage and killed 81 people. Areas that were badly affected by Laura, mostly southeastern Texas and southwestern Louisiana, were badly affected by more flooding and strong winds during Hurricane Delta around six weeks later. ==References== Category:2020 disasters in the United States Category:August 2020 events Category:2020 disasters Category:Hurricanes in Haiti Category:Hurricanes in Louisiana Category:Hurricanes in Texas Category:Hurricanes in the Dominican Republic Category:2020 Atlantic hurricane season Category:Category 4 Atlantic hurricanes Category:Retired tropical cyclone names",
 "title": "Hurricane Laura"
}