{
 "id": "785344",
 "text": "Sarah Emma Edmonds (December 1841 – September 5, 1898), was a Canadian woman who claimed to have served as a man as a nurse and spy with the Union Army during the American Civil War. In 1992, she was enlisted into the Michigan Women's Hall of Fame. In 1864, Boston publisher DeWolfe, Fiske, & Co. published her account of her military experiences as The Female Spy of the Union Army. Born in 1841 in New Brunswick, at that point a British settlement, Edmonds grew up with her sisters on their family's homestead close to Magaguadavic Lake, not a long way from the State of Maine. Edmonds fled home at age fifteen to get away from a planned marriage and the maltreatment of her dad, who needed a child rather than a girl. Supported by her mother, who herself married young, Edmonds got away from the marriage and pretended to be a man to travel more easily. A male mask let Edmonds eat, travel, and work freely. Edmonds worked selling Bibles door to door. for a Bible book retailer and distributer in Hartford, Connecticut. Her enthusiasm was started by a book she read in her childhood by Maturin Murray Ballou called Fanny Campbell, the Female Pirate Captain, telling the story of Fanny Campbell on a privateer transport during the American Revolution while dressed as a man. Fanny stayed dressed as a man so as to seek after different experiences, to which Edmonds credits her longing to dress in drag. During the Civil War, on May 25, 1861, she enrolled in Company F of the second Michigan Infantry, otherwise called the Flint Union Grays. Later she masked herself as a man named \"Franklin Flint Thompson,\" named after Flint, Michigan. She felt that it was her obligation to serve her nation. She from the start filled in as a male field nurse in campaigns under General McClellan, including the First and Second Battle of Bull Run, Antietam, the Peninsula Campaign, Vicksburg, Fredericksburg, and others. She had an opportunity during the war when a Union spy in Richmond, Virginia was found and shot, and a companion, James Vesey, was executed in a snare. She exploited the open spot and the chance to vindicate her companion's demise. She applied for, and won, the situation as Franklin Thompson. There is no proof in her military records that she actually served as a spy, but there is plenty about it in her book. Making a trip into hostile area to assemble data required many disguises.. One camouflage required Edmonds to utilize silver nitrate to color her skin dark, wear a dark hairpiece, and stroll into the Confederacy masked as an individual of color by the name of Cuff. Some other time she entered as an Irish vendor lady by the name of Bridget O'Shea, guaranteeing that she was offering apples and cleanser to the officers. Once more, she was \"working for the Confederates\" as a dark laundress when a bundle of authentic papers dropped out of an official's coat. At the point when Thompson came back to the Union with the papers, the commanders were enchanted. Some other time, she filled in as an investigator in Kentucky as Charles Mayberry, revealing a Confederacy operator. Edmonds' profession as Frank Thompson came to an end when she traveled to Berry's Brigade so as to convey mail to Union powers. While trying to take an easy route, she was tossed into a ditch by her donkey and injured. In 1863, she contracted malaria. She thought if she went to a military emergency clinic she would be found out. She went to a private medical clinic, expecting to come back to military life once she had recovered. Then she saw banners posting Frank Thompson as a deserter. She chose to fill in as a female nurse at a Washington, D.C. clinic for injured troopers run by the United States Christian Commission. In 1882, Edmonds began the process of clearing the charge of desertion from Thompson's record in order to receive a pension. She got a pension of $12 a month. ==References== Category:1841 births Category:1898 deaths Category:Canadian military people Category:Military personnel of the American Civil War Category:Spies Category:People from New Brunswick",
 "title": "Sarah Emma Edmonds"
}