{
 "id": "785487",
 "text": "Darragh Ennis (born 1980) is an Irish entomologist, neuroscientist, quizzer, and television personality. He is one of the six Chasers on the ITV game show The Chase. He is nicknamed The Menace and alternatively The Dublin Dynamo. He was a contestant on the show in 2017. In April 2020, Ennis became the first ever contestant in the UK to become a new Chaser. His Chaser debut aired on 19 November 2020. == Early life and science career == Ennis grew up in Dublin, Ireland and studied at Maynooth University, graduating with a BSc in biology in 2002, and a PhD in ecology in 2008. After completing his doctorate, he worked as a biomedical scientist at ICON plc for a year before undertaking postdoctoral research at Concordia University in Montreal, Canada from 2010 until 2012. Since 2013, he has worked as a lab manager and research technician at the University of Oxford, where he specialises in researching the brains of insects. == Television == In 2017, Ennis was a member of a winning team on The Chase. He earned £9,000 in his Cash Builder round and defeated chaser Paul Sinha to take that money into the Final Chase. The other three contestants also advanced, but each of them took negative low offers from Sinha so that the final prize total was £6,300. Outraged viewers set up a GoFundMe campaign to compensate Ennis for his share of the money lost through his teammates' decisions. Ennis requested for all money to be donated to charity. In April 2020, Ennis was announced as the sixth chaser on The Chase, alongside Mark Labbett, Shaun Wallace, Anne Hegerty, Paul Sinha and Jenny Ryan. His Chaser- debut episode was aired on 19 November 2020. His debut brought in 4.9 million viewers, making it the most watched episode of The Chase ever. == Personal life == Ennis is married to his \"university sweetheart\", and they live together in Oxford with their two children. Ennis supports Dublin GAA and Liverpool FC. Ennis can speak German and Irish. == References == == Other websites == * Ennis on Instagram Category:1980 births Category:Living people Category:Irish television personalities Category:Irish scientists Category:Entomologists Category:Neuroscientists",
 "title": "Darragh Ennis"
}