{
 "id": "78553",
 "text": "is a modern Japanese martial art and Olympic sport.Fell's guide to Judo for protection and self-defense – 1 Jan. 1965, by Vince Kelly (Author), ASIN: B0007DNFV6, Publisher: F. Fell (1 Jan. 1965), Language: English, 122 pages.Nussbaum, Louis-Frédéric. (2005). \"Judo\" in Japan Encyclopedia, p. 435. It was developed in 1882 by Jigorō Kanō.Nussbaum, \"Kanō Jigorō \" at p. 477. Judo is the most internationally competed form of jacket wrestling in the world today. Judo is very scientific in its training methods and fighting techniques.Ohlenkamp, Neil. \"Forms of Judo (Kata),\" JudoInfo.com. Retrieved 2012-2-27. ==History== Judo grew out of an older martial art, Jujutsu or Jū- jutsu.Nussbaum, \"Jū-jutsu\" at p. 435. Jujutsu was an ancient and deadly martial art which used chokes, throws, joint locks, and strikes. Kanō created judo by using techniques which were common in jujutsu. He eliminated techniques that he thought were dangerous in training, so that students could train with resistance. Some basic throws are Tai-otoshi and De-ashi-barai (these are in Japanese). There are two types: groundwork and feet work. Ground work is when both players are on the ground. Usually the attacker would be on top and the uke (defender) would be on the bottom. In feet work both players would move along the mat in a variety of moves. Every once in a while a player will throw their opponent on the floor. In competitions the players will go full on for each other. Once someone has thrown their opponent down, they need to hold them down for 20 seconds or the point will not count. The person who has the most points at the end wins a gold, silver or bronze. ==Use of Judo in competitions== Judo has been included in the 1964 Summer Olympics in Tokyo for men and female judokas started competing in the 1992 Summer Olympics as well as the Commonwealth Games from 1990 initially as optional sport but from 2022, it is now a core sport. ==Rules for female judokas== Al female judokas must tie their hair either into a pony tail, neat hair bun or a messy hair bun. All female judokas also wear either blue or white judogis with a plain white T-shirt and also a black belt. All female judokas can play judo barefoot. ==Related pages== * Sports in Japan * Boxing * Fencing * Sport * Wrestling ==References== ==Other websites== Category:Sport in Japan",
 "title": "Judo"
}