{
 "id": "785591",
 "text": "Winifred Mitchinson (born 24 June 1962) is a New Zealand-born model, actress, singer, and stylist of Māori heritage. She is of the Te Aupōuri iwi and was born in Te Kao, Northland. Mitchinson gained recognition in the 1980s as a Playboy Playmate, appearing on the cover of the Australian edition under the pseudonym Desiree Brown.Australian Playboy, June 1988, cover feature. Archived issue and personal records. She has since worked internationally across fashion, music, and theatre, including roles as a fashion editor and stylist. == Early life == Mitchinson was born at home on Te Ahu Road in Te Kao, near the northern entrance to Ninety Mile Beach. She was delivered by her grandmother, Ani Mete Keepa Hora, and is a descendant of the Te Aupōuri iwi. Her grandfather, Rikihana Etana, was a founding member of the Māori Trust Board. She spent her childhood immersed in Māori culture and later moved to Australia. In New Zealand, she signed with Nova Modelling Agency in Auckland and Acting Agency Robert Bruce Ugly Agency ==Modelling career== Mitchinson began her modelling career in Australia, where she was first signed to Ursula Hufnaghl's modelling agency. She was later represented by Cameron's Modelling Agency and appeared in numerous editorial and advertising campaigns in many magazines such as Vogue Dolly and Stilletto. She also worked with Askew Models in London and Japan and was offered the opportunity to join Ford Models in the United States in which she was advised to work the circuit in Europe first due to her Exotic looks. ==Magazine and styling work== Mitchinson worked as a Fashion Editor and Stylist for Ciao magazine in Sydney♧ Cairns and Oyster Magazine 1st AD to Jonathan Morris. She contributed both editorial direction and fashion styling to the publication. ==Playboy cover== In 1988, Mitchinson appeared on the cover of the Australian edition of Playboy Magazine under the name Desiree Brown. She appeared on 4 Playboy Covers and was also the August Centrefold in 1987. Her exotic looks were noted by international agencies, and her appearance in the magazine marked a significant moment in her modelling career as the Playboy Playmate of the Year. ==Acting training== In 1984, she studied at the Australian Elizabethan Theatre Trust in Sydney alongside Joan Winchester. She later attended the Sydney Acting School under the guidance of Gillian Owen. Mitchinson pursued these studies initially to overcome personal shyness as she entered the public spotlight. ==Music== Mitchinson was featured in the music video for Lindy Lane's single, where she performed on keyboards and vocals. The video showcases her involvement in music performance as well as visual media. As well as many other music video's. ==Other appearances== She also made a cameo role on the New Zealand television series Shortland Street. == Personal life == Winifred Mitchinson met her future husband, Scott Mitchinson, at the World Premiere of Crocodile Dundee II in Sydney 1988, where he was working as First Assistant Film Editor. The film was directed by John Cornell. The two later married and continued their careers across film, fashion, and music. Scott Mitchinson previously collaborated in NYC 1984 with director Leon Gast on the Academy Award-winning documentary When We Were Kings, which chronicled the 1974 Rumble in the Jungle The World Heavyweight Title fight between Muhammad Ali and George Foreman, and the accompanying Zaire 74 music festival featuring artists such as B.B. King and James Brown Scott is known for his work as a Sound Editor on the Feature Film Dingo, a film directed by Rolf de Heer and starring legendary jazz musician Miles Davis in a rare acting role. They married in 1990 and have one child, Alexander Mitchinson, known professionally as MC Medicinal, a spoken word poet, rapper, and actor. In the 1980s and 1990s she briefly used the pseudonym Winifred Anrose and Desiree Brown but continues to be known by her married name Winifred Mitchinson and her artist name Bunny Owlwyn. == Legacy == Mitchinson is remembered not only for her modelling and media work but also for her cultural pride, often returning to her whenua (homeland) in Te Kao. ==References==",
 "title": "Winifred Mitchinson"
}