{
 "id": "785516",
 "text": "The COVID-19 pandemic in Namibia is part of the worldwide pandemic of coronavirus disease 2019 () caused by severe acute respiratory syndrome coronavirus 2 (). ==Early cases== The Minister of Health and Social Services, Dr. Kalumbi Shangula, announced on 14 March 2020 that the virus had reached Namibia. A Romanian couple constituted the two first cases and recovered after 79 days after their initial diagnosis. On 17 March 2020, President Hage Geingob declared a state of emergency which caused the closure of all borders, suspension of gatherings and economic related resolutions. No infections were reported from 6 April 2020 to 20 May 2020, however there was a notable increase in cases after this period - possibly due to local transmission. ==Timeline== * March 2020: 11 confirmed cases, nine of which still active at the end of the month. No COVID-19 deaths were recorded. * April 2020: 5 new cases bringing the total number to 16. Half of them were active at the end of the month. No COVID-19 deaths were recorded. * May 2020: 8 new cases bringing the total number to 24. Ten of them were active at the end of the month. No COVID-19 deaths were recorded. * June 2020: 181 new cases bringing the total number to 205, of which 181 were active at the end of the month. No COVID-19 deaths were recorded. * July 2020: 1,924 new cases bringing the total number to 2,129, of which 1,953 were active at the end of the month. Ten COVID-19 deaths were recorded. * August 2020: 5,421 new cases bringing the total number to 7,550, of which 4,148 were active at the end of the month. 65 new COVID-19 deaths were recorded. * September 2020: 3,590 new cases bringing the total number to 11,140, of which 2,130 were active at the end of the month. 46 new COVID-19 deaths were recorded. * October 2020: 1,848 new cases bringing the total number to 12,988, of which 1,766 were active at the end of the month. Twelve new COVID-19 deaths were recorded. * November 2020: 1,357 new cases bringing the total number to 14,345, of which 694 were active at the end of the month. 18 new COVID-19 deaths were recorded. * December 2020: 9,596 new cases raising the total number to 23,941 of which 3,660 were active at the end of the month. 54 new COVID-19 deaths were recorded. * January 2021: 10,003 new cases raising the total number to 33,944 of which 1,214 were active at the end of the month. 147 new COVID-19 deaths were recorded. * February 2021: 4,901 new cases taking the total number to 38,845 of which 2,160 were active at the end of the month. 72 new COVID-19 deaths were recorded. * March 2021: 5,294 new cases taking the total number to 44,139 of which 1,768 were active at the end of the month. 99 new COVID-19 deaths were recorded. * April 2021: 4,515 new cases taking the total number to 48,654 of which 1,688 were active at the end of the month. 119 new COVID-19 deaths were recorded. * May 2021: 6,895 new cases taking the total number to 55,549 of which 4,044 were active at the end of the month. 187 new COVID-19 deaths were recorded. * June 2021: 34,368 new cases taking the total number to 89,917 of which 21,066 were active at the end of the month. 691 new COVID-19 deaths were recorded. * July 2021: 29,368 new cases taking the total number to 119,285 of which 20,628 were active at the end of the month. 1,523 new COVID-19 deaths were recorded. * August 2021: 5,761 new cases taking the total number to 125,046 of which 2,319 were active at the end of the month. 332 new COVID-19 deaths were recorded. * September 2021: 2,543 new cases taking the total number to 127,589 of which 1,112 were active at the end of the month. 136 new COVID-19 deaths were recorded. * October 2021: 1,349 new cases taking the total number to 128,938 of which 746 were active at the end of the month. 43 new COVID-19 deaths were recorded. * November 2021: 305 new cases taking the total number to 129,243 of which 163 were active at the end of the month. 19 new COVID-19 deaths were recorded.Update by Dr. Kalumbi Shangula, Minister of Health and Social Services on COVID-19 in Namibia, 30 November 2021. * December 2021: 18,731 new cases raising the total number to 147,974 of which 13,301 were active at the end of the month. 60 new COVID-19 deaths were recorded.Update by Dr. Kalumbi Shangula, Minister of Health and Social Services on COVID-19 in Namibia, 1 January 2022. * January 2022: 7,925 new cases raising the total number to 155,899 of which 6,156 were active at the end of the month. 334 new COVID-19 deaths were recorded. * February 2022: 1,311 new cases bringing the total number to 157,210 of which 509 were active at the end of the month. 40 new COVID-19 deaths were recorded. * March 2022: 436 new cases bringing the total number to 157,646 of which 558 were active at the end of the month. Twelve new COVID-19 deaths were recorded. * April 2022: 1,165 new cases bringing the total number to 158,811 of which 1,124 were active at the end of the month. Six new COVID-19 deaths were recorded. * May 2022: 6,986 new cases bringing the total number to 165,797 of which 2,997 were active at the end of the month. 13 new COVID-19 deaths were recorded. * June 2022: 3,406 new cases raising the total number to 169,203 of which 393 were active at the end of the month. 26 new COVID-19 deaths were recorded.Update by Dr. Kalumbi Shangula, Minister of Health and Social Services on COVID-19 in Namibia, 1 July 2022. * July 2022: 50 new cases raising the total number to 169,253 of which 375 were active at the end of the month. Eight new COVID-19 deaths were recorded. * October 2022: 726 new cases bringing the total number to 169,929. 15 new COVID-19 deaths were reported. * December 2022: 366 new cases bringing the total number to 170,295. Two new COVID-19 deaths were recorded. * 2023: 1944 new cases bringing the total number to 172,239. 22 new COVID-19 deaths were recorded. ==Cases total== As of August 2020, Namibia was within the top 20 number of countries with the most COVID-19 cases reported in Africa. A total of 166 health care workers tested positive for the virus, increasing the pressure on the health system given that a shortage of health care workers existed even before the pandemic. ==Quarantine== On 31 July, the Health Minister announced a small end in quarantine protocols that would account for faster recovery rates. Patients with a positive COVID-19 result will automatically be regarded as recovered 10 days after their infection, given that they do not display symptoms anymore. ==Vaccination campaign== Vaccinations started on 19 March 2021, initially with 100,000 doses of the Sinopharm vaccine donated by China and 24,000 doses of the AstraZeneca vaccine purchased through COVAX. ==References== Category:21st century in Namibia Namibia",
 "title": "COVID-19 pandemic in Namibia"
}