{
 "id": "785603",
 "text": "Helmuth Schmidt was an American con-man, swindler, and suspected serial killer. From 1913 to 1917 he was suspected in the swindling of at least three women and was connected in deaths of at least two other women[1 missing 1 dead]. After his death, following the search of his properties, he was connected to the disappearences of three more women, with additional located jewelry and watches indicating other possible victims in New York and Missouri. == Known or suspected victims == *His wife Anita Darsch (Immigrated Nov 5,1913 as \"Minna Gülzow\" ) . She \"disappeared\" from their Home at Lakewood Township, New Jersey in November 1914.Anita Schmidt Find a grave Helmuth claimed that she had returned to Berlin. *Servant Margaret \"Greta\" Darsch (Immigrated Nov 5, 1913 as \"Greta Braun\"), with whom he had a love affair, also vanished in December 1914 Anita Schmidt Find a grave.; Schmidt explained to his daughter that she had married and travelled to Denmark. *His wife Adele Ulrich from New York, whom he meet through a matrimonial advertisement, buying a house using her money. He later abandoned Ulrich and left Lakewood in 1914, after collecting $1,500 by fraudulently selling his home. * Mrs. John Switt of New York - claimed that Schmidt had married her under the name John Switt in 1914. * Mrs. Emil Brown of New York - a stenographer for the Hupfel Brewing Company, married Schmidt in 1915 at Lakewood; he later claimed she deserted him and took money (another victium[?]). * Irma Pallatinus - housekeeper; accompanied him from Lakewood to Detroit in 1915, disappeared soon after. After his death her strangled body was found buried under his garage in Lakewood. After the inquest on her death, Schmidt's daughter remarked that Schmidt told her that Irma disappeared after taking $700 of his money.Besbee Daily Review May 15,1918 p.2After the discovery of Pallatinus' remains, Schmidt's widow Adele Ulrich noted that Schmidt had allowed her to take a small peek into the cellar, where she later alleged the authorities would most likely find the bodies of Anita Schmidt and Greta Darsch. * Mrs. Helmuth Schmidt of Chicago - she married him in 1916, after which he robbed her of $2,000 and then deserted her; when she was later shown a picture of him, she identified Schmidt as her husband. *Servant Augusta Steinbach, who, after corresponding for a few months set out to marry the mysterious man, bringing with her around $500 and some jewelry. In February 1917,\"Murder Plant Is Uncovered\". The Daily Gate City and Constitution-Democrat. 23 April 1918. she told her long-time friend and fellow servant Agnes Domanie about her intentions to marry the man in Detroit, departing to the city in March. A few days after she left, she wrote to Ms. Domanie, describing enthusiastically her husband-to-be, as well as asking her friend to send three trunks of clothes stored in a nearby warehouse. Domanie complied with the request, but three months later, her package was returned by the company, with them explaining that they couldn't locate the woman.\"Man Who Led Girl To Death Ends Life in Michigan Prison\". New-York Tribune. 24 April 1918. Following this, Ms. Domanie wrote to the authorities in Detroit. Three months after her request, she was visited by Sheriff O. H. P. Green who spoke with her, but failed to locate Steinbach. He soon committed suicide, burning all papers related to the case. Despite this, Ms. Domanie continued to insist on the police listening to her. Eventually, Glen Gillespie, the District Attorney of Oakland County, came to visit her. After carefully examining the case, he located the elusive man from the ads: Helmuth Schmidt. == Arrest and suicide == Upon his arrest, Helmuth confessed that he had burned Steinbach's body, but alleged that she had killed herself with poison following his refusal to instantly marry her and a subsequent quarrel on March 11.\"Lured Girl To Death; Burned Body; Suicides\". The Washington Herald. 24 April 1918. Fearing that his wife and daughter would return soon from the cinema, Schmidt dragged the body to the cellar, lifted it through a window and then buried it under his porch. Three months after the incident, he claimed that he dug up the body, cut it up with a cleaver and then burned the pieces in the furnace. She was his last known victim. He committed suicide in his jail cell in 1918.Helmuth Schmidt Find a grave ==References== Category:1918 deaths Category:American serial killers Category:American murderers",
 "title": "Helmuth Schmidt"
}