{
 "id": "785671",
 "text": "The University of Wrocław is a public university in Wrocław, Poland. It was started in 1702 by Leopold I (Holy Roman Emperor), and has nearly 25,000 students. == History == The first attempt to found a university in Wroclaw was in 1505. The initiator was Vladislav II. Due to wars, lack of money, the university was not opened. In 1702, the Society of Jesus founded a university called Leopoldina. It had the only faculty of philosophy and сatholic theology. In 1811, as a result of a reform, the universities in Breslau and Frankfurt an der Oder were merged. The university was called Silesian Friedrich Wilhelm University. Here students studied at 5 faculties — Catholic theology, Protestant theology, law, philosophy and medicine. The University of Breslau became the first German university to have both Catholic and Protestant faculties. After the end of World War II, the German university in the city was closed and then transformed into a Polish state university, which was officially opened on June 9, 1946. In 1952 — 1989 the university was named after the President of Poland Bolesław Bierut. In 2001, there were celebrations in Wroclaw dedicated to the 300th anniversary of the foundation of the University. == General information == The University of Wroclaw is a higher education institution in the Republic of Poland. There are 10 departments that provide 44 areas of study, classes are mostly Polish, with only some in English. The University of Wrocław provides Bachelor, Master, and Doctoral level programmes. Teaching at the university is conducted at the following faculties: * Philological * History and pedagogy * Law, administration and economics * Physicists and Astronomy * Biotechnology * Biology * Geography, geology and environment * Social Sciences * Chemistry * Mathematics and Computer Science. ==References== ==Other websites== *The Wrocław University Category:1700s establishments in Europe Category:1702 establishments Wroclaw",
 "title": "University of Wrocław"
}