{
 "id": "78575",
 "text": "Soil science deals with soil as a natural resource on the surface of the earth. It includes soil formation, classification and mapping.That means that general physical, chemical, biological, and fertility properties of soils are fixed in a map and that they are looked at in relation to the use and management of soils. But many more sciences deal with knowledge of soils and the advancement of the soil sciences: engineering, agronomists, chemistry, geology, geography, biology, microbiology, sylviculture, public health, archaeology, and regional planning. \"Soil\" refers to anything between the top of the dirt and the top of the underlying rock (called \"bedrock\"). Soil is often broken into layers. The top layer is high in organic matter (roting plants and such). Then there is a layer of layer of soil where rain water has removed some metals (called \"leaching\"). Those metals get collected in another, lower layer. Finally, there is a layer made up mostly of broken bits of bedrock. A soil can have all of these layers, or only a few. Soils are important because most groundwater, which is used in everything from city water supplies to farming, is found in soil, not bedrock. ==Fields of application in soil science== * Soil survey * Soil management * Standard methods of analysis * Soil fertility / Nutrient management * Ecosystem studies * Climate change * Watershed and wetland studies * Pedotransfer function == References == == Related disciplines == * Agricultural sciences ** Irrigation management * Anthropology ** archaeological stratigraphy * Environmental science ** Landscape ecology * Geography ** Physical geography * Geology * Hydrology ** Hydrogeology * Waste management * Wetland science ==Other websites== * Certified Professional Soil Scientist * Registered Professional Soil Scientist (PDF) *SoilScience.info *SoilScience.info's Daily Dirt - Soil Science in Mainstream Media and Popular Press *SoilScience.info's Job Listings Category:Earth sciences Category:Soil",
 "title": "Soil science"
}