{
 "id": "785810",
 "text": "In August 2020, in the aftermath of the Jacob Blake shooting, protests in Kenosha, Wisconsin, United States and elsewhere occurred as part of the larger Black Lives Matter movement and reactions to other high-profile police killings of unarmed Black people in 2020. ==Protests== After police shot Jacob Blake, many people protested in Kenosha. It was not wholly a peaceful protest. Some people broke into shops and stole the things inside. Some shops were burned down. Armed civilian counter-protesters also came, some of them from other states. They said they wanted to protect businesses. ==Responses== On August 24, Wisconsin Governor Tony Evers activated the Wisconsin National Guard to protect fire fighters and critical infrastructure in Kenosha. On August 25, one of the civilian volunteers shot three people, two of whom were later pronounced dead. The shooter was a 17 year old named Kyle Rittenhouse. Rittenhouse later walked towards police vehicles with his hands up and still armed with a semi-automatic rifle, but the police vehicles drove past him. Both the men he killed, Anthon Huber, 26, and Joseph Rosenbaum, 36, were white. Many conservatives thought Rittenhouse did not deserve to go to prison, and an online fund for his $2 million bail was filled. ==Trial== Kyle Rittenhouse's trial is scheduled to start on November 1. He is charged with homicide: first-degree reckless homicide, first-degree intentional homicide and attempted first-degree intentional homicide. He is also charged with carrying a weapon even though he was under 18 years old, which is illegal in that state. The largest punishment he could get is life in prison. ==References== Category:2020 crimes in the United States Category:2020 fires Category:2020s riots Category:2020 in Wisconsin Category:Arson Category:August 2020 events Category:2020s fires in the United States Category:Looting Category:Riots in the United States Category:September 2020 events",
 "title": "Kenosha unrest"
}