{
 "id": "785974",
 "text": "Prezi is a cloud presentation software developed in 2009. The service uses a zoomable user interface that allows you to operate data in 2.5 D and Parallax. Prezi is used by 50 million users and 80% of Fortune Global 500 companies. The project was created in Budapest, and the very name prezi translated from Hungarian — abbreviated form of the word \"presentation\". == History == The Prezi project (or Prezi.com) was created with the help of Kitchen Budapest and Magyar Telekom. Immediately after its launch, the company entered the international market. During the first year, the company had virtually no funding. After 18 months in April 2009, Prezi launched in Budapest, and 5 months later opened an office in San Francisco. The founders of the company won a prize in the European competition of startups The Europas in the nomination \"Best founder and co-founder of a startup\". Among investors — Sunstone Capital, TED Conferences, and Accel Partners. A Prezi iPhone app was launched in late 2012. In March 2014, Prezi pledged $100M in free licenses to Title 1 schools as part of the Obama administration's ConnectED program Prezi for Android was launched in 2015, and in June 2016. == Products == Prezi is developed on Adobe Flash, Adobe AIR and Django, but since 2014 it is also possible to work on JavaScript. The product has become extremely popular in education systems and among universities. It is used, in particular, by The Guardian and the TED conference. === Platforms === The company runs on the Freemium model, so free users should publish their presentations publicly on the Prezi website. There is a paid service that avoids this. Prezi Viewer is a program designed for the iPad that allows you to view presentations created on the Prezi Desktop. Up to 10 users can participate in Prezi Collaborate at the same time. === Nutshell === The entertainment application Nutshell for iPhone allows you to glue photos into a comics with moving elements. Nutshell creates a small square clip based on three images, which can then be posted to Instagram or Twitter. == References == == Other websites == * How to create a world-famous startup in a small country - a lesson from Prezi * * Peter Arvai (co-founder of Prezi) \\- “We raised $15.5 million, but did not use a penny of this money \" Category:Diagrams Category:Software companies Category:Organizations based in Hungary",
 "title": "Prezi"
}