{
 "id": "785986",
 "text": "is an anime television series. MAPPA, Avex Pictures and Cygames produced the anime. It aired in Japan between October 4 and December 20, 2018. It aired on AT-X, Tokyo MX, Sun TV, BS11, Saga TV, and TVQ. Munehisa Sakai is the director. Shigeru Murakoshi is the writer. MAPPA is the animator. ==Plot== In 2008, high school student Sakura Minamoto plans to become an idol. However, a truck kills her on the morning she goes to submit her application. Ten years later, Sakura is one of seven \"legendary\" girls from many parts of Japanese history who return as zombies in an idol group known as . They are brought back to life by a man who plans to revive Saga Prefecture. ==Characters== ===Franchouchou=== ; : ; : ; : ; : ; : ; : ; : ===Supporting characters=== ; : ; : ; : ==Production== Cygames announced the anime on July 5, 2018. On August 31, 2018, voice actor Mamoru Miyano announced the anime's cast members. Crunchyroll streamed the Japanese version with English subtitles. Funimation simulcasted an English version of the anime. A second season, titled Zombie Land Saga Revenge, was announced on July 27, 2019. ==Music== The opening theme song is . The ending theme song is . Both songs are sung by Franchouchou (Kaede Hondo, Asami Tano, Risa Taneda, Maki Kawase, Rika Kinugawa, and Minami Tanaka). ==Reception== The opening theme song, Adabana Necromancy, charted at #13 in the Oricon Singles Chart on December 10, 2018. It charted at #1 in the Billboard Japan Download Songs chart on the same day. One of the anime's characters, Lily Hoshikawa, is transgender. Anime News Network named the revelation of Lily's gender identity as \"the [eighth] episode's biggest talking point\". The Daily Dot named Lily as \"trans Twitter’s latest role model\". Zombie Land Saga won the 2019 Tokyo Anime Awards Festival award for Animation of the Year. ==Other media== A manga adaptation by Megumu Soramichi began on Cygames' Cycomi website on October 8, 2018. A stage adaptation, titled Zombie Land Saga Stage de Do-n!, was scheduled for March 11 to 14, 2020. However, it was delayed to September 5 and 6 due to the COVID-19 pandemic. A special featuring Franchouchou and Dempagumi.inc, , aired on September 1, 2020. A visual fan book, , was released on September 3, 2020. It has a collaboration song between the two idol groups, . ==Notes== ==References== ==Other websites== * * Category:Comedy anime and manga Category:Horror television series Category:LGBT comedy television series Category:Saga Prefecture",
 "title": "Zombie Land Saga"
}