{
 "id": "78599",
 "text": "Rocks are a naturally occurring solid. Rocks are made of collections of mineral fruits that are held together in a firm, solid mass. They are made of minerals (which are crystalline), or other mineral-like substances. The Earth's outer solid layer, the lithosphere, is made of rock. That means the Earth's crust is made of rock. The different minerals in the rocks make different kinds of rock. Rock is often covered by soil or water. It is beneath the oceans, lakes, and rivers of the earth, and under the polar icecaps. Petrology is the scientific study of rocks. == Rock classification == Rocks are classified by their minerals and chemical make-up. The processes that formed them are also noted. Rocks may be igneous, sedimentary and metamorphic. Rock types may change in a so-called 'rock cycle'. === Igneous rocks === :For the main article, see Igneous rock Igneous rocks are formed when molten magma cools, either above or below the surface. They are divided into two main categories: plutonic rock and volcanic rock. Plutonic or intrusive rocks are made when magma cools and crystallizes slowly within the Earth's crust (example granite). Volcanic or extrusive rocks result from magma reaching the surface either as lava or ejecta (examples pumice and basalt).Blatt, Harvey and Tracy, Robert J. 1996, Petrology. 2nd ed, Freeman. There are over 700 hundred types of igneous rocks, and they are usually the hardest and heaviest of all rocks. === Sedimentary rock === :For the main article, see Sedimentary rock Sedimentary rocks are the most common rocks on Earth. They form at or near the Earth's surface. Sedimentary rock is formed in layers which were laid down one by one on top of another. Some of the layers are thin, some are thick. Layers are made by deposition of sediment, organic matter, and chemical precipitates. Of the rocks exposed on the Earth's surface, 66 percent of it are sedimentary rocks. Deposition is followed by squeezing of sediment under its own weight, and cementation. This process is called 'consolidation': it turns the sediment into a more or less hard substance. The approximate amounts of different kinds of sedimentary rock are: #Shale (including mudstone, and siltstone): 60% #Sandstones 20%. #Carbonate rocks (limestone and dolomite): 15%. #All others: 5%.\"Sediment and sedimentary rocks.\" Sedimentary rocks . Only sedimentary rocks have fossils. === Metamorphic rock === :For the main article, see Metamorphic rock Metamorphic rocks are formed by rocks coming under great pressure and high temperatures without melting. These temperatures and pressures are found under mountains and volcanoes, especially when continental plates move together. These conditions change the make-up of the original minerals. == Impact on human life == Rocks have had an impact on human life. They have been used by humans for over two million years. The mining of rocks for their metals has been important in human advancement. Rocks are mined for building materials of all kinds. ==Related pages== * Geology * Quarrying *Bedrock == References ==",
 "title": "Rock (geology)"
}