{
 "id": "786123",
 "text": "Greg Berg (born November 26, 1960) is a voice actor. ==Films== ===Anime=== Year Title Role Notes 1998 Flint the Time Detective Pteri 2 episodes; English dub 2002 The Cat Returns Additional Voices English dub ===Film=== Year Title Role Notes 1984 Revenge of the Nerds Larry Fine Robot Uncredited 1988 Pound Puppies and the Legend of Big Paw Beamer (voice) Direct-to-video 1988 Normality Monster Voices (voice) 1990 Box-Office Bunny Audience (voice) Short Film 1995 Toy Story Local Announcer (voice) 2002 Highway Alligator Boy 2003 Rockfish Mutant Animal (voice) Short Film 2004 Gopher Broke Gopher (voice) Short Film 2005 Here Comes Peter Cottontail: The Movie Montresor (voice) Direct-to-video 2005 Chicken Little Additional Voices (voice) 2006 The Wild Vulture (voice) 2009 Gnomes & Trolls: The Secret Chamber Sneaky (voice) English Dub 2009 Ojai Bums Alan Short Film 2011 Transformers: Dark of the Moon Igor (voice) 2011 The Muppets Stage Manager (voice) Uncredited 2015 Concussion Sportscaster Uncredited 2016 Trolls (Additional voice) 2018 Gnomes & Trolls: The Forest Trail Sneaky (voice) English Dub ===Television=== Year Title Role Notes 1982 The Book of Lists Alexander Haig / Gerald Ford Episode: \"Pilot\" 1982 Robotman & Friends Robotman (voice) 1983 CHiPs Messenger in Gorilla Suit Episode: \"Hot Date\"; uncredited 1984 The Love Boat Additional Voices Episode: \"Vicki and the Fugitive/Lady in the Window/Stolen Years/Dutch Treat: Part 1\" 1984 Knots Landing Billy 2 episodes 1984 Partners in Crime Voice Episode: \"Fantasyland\" 1984–1991 Muppet Babies Fozzie / Scooter (voice) 107 episodes 1985 Dallas (voice) Episode: \"Dead Ends\" 1985 Jim Henson's Little Muppet Monsters Fozzie Bear / Dr. Julius Strangepork (voice) Episode: \"In the Beginning\" 1986 Silver Spoons Cabbie Episode: \"The Way We Weren't\" 1986 Who's the Boss? Robot (voice) Episode: \"The Christmas Card\"; uncredited 1987 Married... with Children Commercial Actor (voice) Episode: \"But I Didn't Shoot the Deputy\" 1989–1991 Teenage Mutant Ninja Turtles Donatello / Bebop / Sluggo (voice) 8 episodes 1989–1994 Garfield and Friends Judge (voice) 8 episodes 1990 The Simpsons Rory (voice) Episode: \"Bart vs. Thanksgiving\" 1990 Moe's World Bird Sounds (voice) TV movie 1990–1991 Night Court Young Bob Hope / Additional Voices (voice) 2 episodes; uncredited 1991 Yo Yogi! Huckleberry Hound / Moe Wendell / Joe Wendell (voice) 10 episodes 1992 Bob Additional Voices (voice) Episode: \"Terminate Her\"; uncredited 1992 Sibs (voice) Episode: \"The Eleanor Roosevelt Story\"; uncredited 1994 Count DeClues' Mystery Castle Talking Statue TV movie 1994 Sliders Gilligan on TV (voice) Episode: \"The King Is Back\"; uncredited 1998 The Rat Pack Eddie Cantor / Newscaster (voice) TV movie; uncredited 1999 Sorority Dean Tinker 2006 Avatar: The Last Airbender Pong (voice) Episode: \"City of Walls and Secrets\" 2006 American Dad! (voice) Episode: \"The Best Christmas Story Never Told\" 2012 The Untold History of the United States President Jimmy Carter / Gen. Curtis LeMay (voice) 2 episodes === Video games === Year Title Role Notes 1994 Cyberia Voices 1995 Normality Fatty 1996 Shattered Steel Voices 2001 Monsters, Inc. Fungus 2002 Monsters, Inc. Scream Arena Fungus 2004 EverQuest II 18 characters 2006 Desperate Housewives: The Game Dr. Arthur Henrikson 2009 Tom Clancy's H.A.W.X 2009 inFamous Male Pedestrian 2011 Shadows of the Damned Demons 2012 Hitman: Absolution Chris / Chicago Cops / Blackwater Guards 2013 Lightning Returns: Final Fantasy XIII Additional Voices ===Radio=== * Rick Dees Morning Show L.A. and (Worldwide) Weekly Top 40 - John Revolting, others (20 year Category:American voice actors Category:Living people",
 "title": "Greg Berg"
}