{
 "id": "78623",
 "text": "The larynx (plural larynges), also known as the voice box, is an organ in the neck of humans and animals. It helps to protect the wind pipe by stopping it from inhaling food. It also helps with breathing and making sounds. The larynx houses the vocal cords. == Function == The larynx makes the voice. Both pitch and loudness are controlled here. It has a small slit through which air passes and makes the vocal cords vibrate. The vibrating vocal cords make the air vibrate. This sound changes as it travels through the vocal tract. It becomes a different sound based on the position of the tongue, lips, mouth, and pharynx. When swallowing, the backward motion of the tongue forces part of the larynx called the epiglottis to cover up the opening to the larynx, also called the laryngeal opening. This is to stop the food swallowed from entering the lungs. The larynx is also pulled upwards to help with this process. If the larynx is irritated by something that is swallowed, a strong cough reflex is used to protect the lungs. == Disorders of the larynx== There are several things that can cause a larynx to not function properly.Laitman, J.T. and Reidenberg, J.S. (1993) Specializations of the human upper respiratory and upper digestive tract as seen through comparative and developmental anatomy. Dysphagia 8:318-325.1993 Some symptoms are hoarseness, loss of voice, pain in the throat or ears, and breathing difficulties. Larynx transplant is not done very often. The world's first successful operation took place in 1998 at the Cleveland Clinic, and the second took place in October 2010 at the University of California Medical Center in Sacramento. * Acute laryngitis is the sudden inflammation and swelling of the larynx. It is caused by the common cold or by excessive shouting. It is not serious. Chronic laryngitis is caused by smoking, dust, frequent yelling, or prolonged exposure to polluted air. It is much more serious than acute laryngitis. * Presbylarynx is age-related hardening of the soft tissues of the larynx. It results in weak voice and restricted vocal range. Bowing of the front portion of the vocal cords is found on laryngoscopy (an examination of the larynx). * Polyps and nodules are small bumps on the vocal cords. They can be caused by prolonged exposure to cigarette smoke and vocal misuse. * Two related types of cancer of the larynx, namely squamous cell carcinoma and verrucous carcinoma, are strongly associated with repeated exposure to cigarette smoke and alcohol. * Laryngeal spasm. * Laryngopharyngeal reflux is a condition in which acid from the stomach irritates and burns the larynx. Similar damage can occur with gastroesophageal reflux disease (GERD).Laitman, J.T. and Reidenberg, J.S. (1997) The human aerodigestive tract and gastroesophageal reflux: An evolutionary perspective. Am. J. Med. 103 (Suppl 5A): 3-11Lipan, M, Reidenberg, J.S and Laitman, J.T. (2006) The anatomy of reflux: A growing health problem affecting structures of the head and neck. Anat Rec., Part B: New Anatomist: 289B:261-270 * Laryngomalacia is a very common condition of infancy. The soft, immature cartilage of the upper larynx collapses inward during inhalation, causing the airway to be (partly) blocked. * Laryngeal perichondritis, the inflammation of the perichondrium (a connective tissue around the cartilage) of laryngeal cartilages, causing the airway to be (partly) blocked. == Related pages == * Pharynx == References == *Speech and Hearing Science: Anatomy and Physiology 3rd edition. Willard R. Zemlin. 1988. Prentice-Hall, Inc. Englewood Cliffs, New Jersey. Category:Anatomy of the respiratory system",
 "title": "Larynx"
}