{
 "id": "786373",
 "text": "The least weasel (Mustela nivalis) is the world's smallest mammalian carnivore. It is the smallest member of the genus Mustela, the smallest member of the family Mustelidae and the order Carnivora. It is also called the little weasel or common weasel. The weasel is native to Eurasia, North America and North Africa. It has been introduced to New Zealand, Malta, Crete, Bermuda, Madeira Island, the Azores, the Canary Islands, São Tomé, the Falkland Islands, Argentina and Chile. It is a least concern species. ==Description== The least weasel has a thin, long and very flexible body. It has a small, long, head. The legs and tail are short. The feet have sharp, dark-coloured claws and a lot of hairs on the bottom. Its eyes are small when compared to their head size. Its eyes are dark colored. The legs and tail are relatively short. The tail makes up less than half the body length. Males have an average length of long. Females have an average length of long. Males weigh . Females weigh . == Territorial and social behaviour == Male least weasels have territories that include many female territories. The number of least weasels in each territory depends on the amount of food and reproductive success. The male least weasel has a bigger territory during spring or when there is less food. It uses faeces and urine to mark its territory. The least weasel does not dig its own den, but stays in the burrows that other animals have left, like a mole or rat. ==Breeding== The least weasel mates from April to July. The gestation period is 34 to 37 days. In the Northern Hemisphere, the least weasel usually give birth to 6 kits. Kit is the name for baby weasels. The least weasel is able to reproduce by the age of three to four months. The female takes care of its kits without help from the male. The kits weigh . Newborn kits are born pink, naked, blind and deaf. They will have a white coat of downy fur at the age of four days. The first teeth come out at the age of two to three weeks. They start to eat solid food at that time. The eyes and ears open at the age of at three to four weeks. By eight weeks they learn how to kill the animals that they eat. The young ones leave the family after nine to twelve weeks. Least weasels can live for seven or eight years. ==Feeding== The least weasel mostly eats rodents, for example mice, hamsters, and gerbils. It usually does not attack adult hamsters and rats. Frogs, fish, small birds and bird eggs are almost never eaten. It can attack adult pikas and gerbils. Least weasels sometimes kill prey larger than themselves, such as capercaillie, hazel grouse and hares. In England, the least weasel likes to eat the field vole. Even though it is small, the least weasel is a great hunter. It is able to kill a rabbit five to 10 times its own weight. Even though they are commonly eaten, the rabbits are usually young ones. Rabbits become a very important source of food during the spring, when there are few small rodents. ==Predators== Red foxes, sables, steppe and forest polecats, stoats, eagle owls and buzzards are predators of the least weasel. Owls are very good at catching least weasels. Some of the owls that hunt least weasels include barn owls, barred owls, and great horned owls. Other birds of prey that eat the least weasel include broad-winged buzzards and rough-legged buzzards. Some types of snake may eat the least weasel. They include the black rat snake and the copperhead. == Disease and parasites == Ectoparasites also target weasels. Common ones are different species of lice, mites and fleas. Very often, weasels get the parasites from the nests or burrows of their prey. Certain species of nematode also infect weasels. ==Distribution== The least weasel lives in Europe, North Africa, Asia and parts of northern North America. It mostly lives in places where there are no stoats. It has become extinct from New York City. It has been introduced in New Zealand, Malta, Crete, the Azore Islands and São Tomé off West Africa. It is found throughout Europe (but not Ireland). It is also found on many islands, including the Azores, Great Britain, and all major Mediterranean islands. It also lives in Honshū and Hokkaidō Islands in Japan and on Kunashir, Iturup, and Sakhalin Islands in Russia. The least weasel can be found in fields, open woodland, bushy or rocky places, parks and gardens. It can be found at altitudes of up to about . ==Conservation status== The least weasel is listed as a least concern species by the International Union for Conservation of Nature. It has a very large range and a large total population. It is common in Eurasia but less abundant in North America. It is thought to be rare in the southeastern United States. ==References== Category:IUCN Red List least concern species Category:Mustelids Category:Mammals of Asia Category:Mammals of Europe Category:Mammals of North America",
 "title": "Least weasel"
}