{
 "id": "786596",
 "text": "Special functions are some mathematical functions used in mathematical analysis or physics.Andrews, G. E., Askey, R., & Roy, R. (1999). Special functions (Vol. 71). Cambridge University Press.Silverman, R. A. (1972). Special functions and their applications. Courier Corporation.Nikiforov, A. F., & Uvarov, V. B. (1988). Special functions of mathematical physics (Vol. 205). Basel: Birkhäuser. Most of them appear in higher education. Some experts are studying numerical methods for them.Gil, A., Segura, J., & Temme, N. M. (2007). Numerical methods for special functions. Society for Industrial and Applied Mathematics. ==Definition== In mathematics, most functions are defined as a solution of a differential equation. For example, the exponential function \\exp(x) is the solution of the ordinary differential equation y^\\prime=y. Due to this relation, some mathematicians are studying the connection between ODEs and special functions.Iwasaki, K., Kimura, H., Shimemura, S., & Yoshida, M. (2013). From Gauss to Painlevé: a modern theory of special functions (Vol. 16). Springer Science & Business Media. ==Examples== * Gamma function, it is studied since EulerDavis, P. J. (1959). Leonhard euler's integral: A historical profile of the gamma function. The American Mathematical Monthly, 66(10), 849-869.Artin, E. (2015). The gamma function. Courier Dover Publications. * Orthogonal polynomials, these are polynomials with special properties.Gautschi, W. (2004). Orthogonal polynomials. Oxford: Oxford University Press.Cohl, H. S., & Ismail, M. E. (Eds.). (2020). Lectures on Orthogonal Polynomials and Special Functions (Vol. 464). Cambridge University Press.Ismail, M., Ismail, M. E., & van Assche, W. (2005). Classical and quantum orthogonal polynomials in one variable (Vol. 13). Cambridge University Press. * Matrix functions, these are studied in linear algebra and matrix analysis.Higham, N. J. (2008). Functions of matrices: theory and computation. Society for Industrial and Applied Mathematics. For more examples, find textbooks named \"special functions\". ==References== ==Other websites== *National Institute of Standards and Technology, United States Department of Commerce. NIST Digital Library of Mathematical Functions. Archived from the original on December 13, 2018. * * Special functions at EqWorld: The World of Mathematical Equations * Special functions and polynomials by Gerard 't Hooft and Stefan Nobbenhuis (April 8, 2013) * Numerical Methods for Special Functions, by A. Gil, J. Segura, N.M. Temme (2007). * R. Jagannathan, (P,Q)-Special Functions * Specialfunctionswiki, a wiki about special functions category:Functions and mappings",
 "title": "Special functions"
}