{
 "id": "786838",
 "text": "is a Japanese politician who has been the Prime Minister of Japan since 2024. Ishiba was elected President of the Liberal Democratic Party in 2024. He is seen as a moderate.\"Fukuda Cabinet launched / Changes minimized to reduce impact on Diet business\" , The Yomiuri Shimbun, 26 September 2007. Ishiba was Director General of the Japan Defense Agency under Prime Minister Junichiro Koizumi from 2002 to 2004. He was Minister of Defense under Yasuo Fukuda from 2007 to 2008 and Minister of Agriculture, Forestry and Fisheries under Tarō Asō from 2008 to 2009. The LDP lost government in 2009, entering Opposition. In August 2020, he announced his candidacy for the Liberal Democratic leadership election to replace Prime Minister Shinzo Abe. He lost the election on 14 September to Yoshihide Suga, coming in third place. In July 2024, Ishiba announced his third candidacy for the Liberal Democratic leadership election to replace Prime Minister Fumio Kishida. He won the election on 27 September 2024, defeating Economic Security Minister Sanae Takaichi. Ishiba has been seen as a controversial figure in the Liberal Democratic Party because of his criticisms of his party, as well as his liberal stances on social issues. He supported a motion of no-confidence against Prime Minister Kiichi Miyazawa in 1993 and was a critic of Shinzo Abe, despite serving in the governments of both prime ministers. ==Early life== Ishiba was born on 4 February 1957 in Chiyoda Ward, Tokyo. His father Jirō Ishiba, was a government official. His mother was a teacher. Ishiba grew up and went to school in Tottori Prefecture. After graduating from Tottori University Junior High School, he moved away to attend Keio Senior High School, going on to study law at Keio University in Tokyo. After graduating in 1979, he began working at Mitsui Bank. Former Prime Minister Kakuei Tanaka, inspired Ishiba to become a politician. ==Political career== Ishiba left the bank in 1983 and began working in Kakuei Tanaka's faction of the Liberal Democratic Party. In July 1986, Ishiba ran as an LDP candidate in the Tottori at-large district and was elected to the House of Representative. At the age of 29, he was the youngest member of the House at the time. Ishiba is part of the ultranationalist and far-right organization, Nippon Kaigi. In his early years in the National Diet, Ishiba became interested in defense policy because of the Gulf War in 1990 and a 1992 visit to North Korea. Ishiba was appointed as the Minister of Defense in the cabinet of Prime Minister Yasuo Fukuda on 26 September 2007, serving in that post until 1 August 2008. Following Fukuda's resignation, Ishiba ran as a candidate for the LDP presidency. In the leadership election, held on 22 September 2008, Tarō Asō won with 351 of the 527 votes; Ishiba placed fifth and last with 25 votes. In Aso's Cabinet, appointed on 24 September 2008, Ishiba was named as Minister of Agriculture, Forestry and Fisheries. ===Abe government=== In 2012, while the LDP was still in opposition, Ishiba ran again for the presidency of the LDP and lost to Shinzō Abe. He accepted the position of secretary general on 27 September 2012. Abe re-appointed him to the position after the December 2012 election in which the LDP returned to government. Ishiba left cabinet in April 2016 after not accepting a nomination to be the Minister of Agriculture. Ishiba ran against Abe in the 2018 LDP presidential election, but lost. In 2020, after Shinzo Abe's resignation, Ishiba ran for the leadership of the Liberal Democratic Party, losing to Yoshihide Suga, placing third overall. Ishiba decided not to run in the 2021 Liberal Democratic Party leadership election, instead supporting Taro Kono. ==Prime Minister of Japan== In July 2024, Ishiba announced his third candidacy for the Liberal Democratic leadership election to replace Prime Minister Fumio Kishida. He won the election on 27 September 2024, defeating Economic Security Minister Sanae Takaichi. After his election, the Japanese stock market experienced a sudden drop in response to Ishiba's economic policies, which was named \"Ishiba Shock\". His victory was seen as an upset. On 30 September, day before taking office, Ishiba called for snap parliamentary elections to be held on 27 October 2024. Ishiba was sworn in as the Prime Minister of Japan on 1 October 2024. On 9 October, Ishiba dissolved the House of Representatives and called for a general election on 27 October. On election day, LDP saw its most serious defeat since the 2009 election, with 67 seats lost and therefore its majority in the Diet. On the next day, Ishiba expressed his plans to stay as Prime Minister despite the election results. On 11 November, Ishiba was reelected as prime minister of a minority government during a session of the Diet, after winning a total of 221 votes from both the first and second rounds, defeating Yoshihiko Noda of the Constitutional Democratic Party of Japan, who secured only 160 votes. Ishiba has been criticized for several gaffes while in office. In October 2024, it was reported that government officials had edited an official photograph of Ishiba's cabinet to hide signs of Ishiba looking messy. In November 2024, he appeared to have slept during a session of the Diet. At the APEC Peru 2024 summit, he was again criticized for greeting other world leaders while seated and watching a dance at the summit's welcoming ceremony with his arms crossed. In another incident, he was seen publicly eating onigiri and munching on it without closing his mouth. ==Personal life== Ishiba married Yoshiko Nakamura in 1983. They have two daughters. He is a Protestant Christian. Ishiba is known as a \"otaku\" for military, vehicles, trains and Japanese idol. ==References== ==Other websites== * * 石破茂-アゴラ * 石破茂（いしばしげる）ブログ * * * * Category:1957 births Category:Living people Category:Prime ministers of Japan Category:Current national leaders Category:Politicians from Tokyo Category:People from Tottori Prefecture Category:Businesspeople from Tokyo Category:Liberal Democratic Party (Japan) politicians Category:Defense ministers of Japan Category:Ministers of agriculture, forestry and fisheries of Japan",
 "title": "Shigeru Ishiba"
}