{
 "id": "786846",
 "text": "The long-tailed weasel (Mustela frenata), is a type of mustelid. It is also called the bridled weasel or big stoat. It lives in southern Canada throughout all the United States and Mexico, through all of Central America and northern South America. ==Description== Males are 330 and 420 mm (12–16 in) long. Females are 280–350 mm (11–13 in) long. In males, the tail is 132–294 mm (5–11 in) long. In females, the tail is 112 to 245 mm (4–9 in) long. Long-tailed weasels weighs between 3 and 9 ounces (85-267 g) with males being about twice as large as the females. The summer fur is brown, with whitish underparts and tinged with yellowish or buffy brown. The tail has a black tip. In northern areas, the winter fur becomes white, sometimes with yellow tints, but the tail still have its black tip. The long-tailed weasel moults two times each year, once in autumn (October to mid-November) and once in spring (March–April). The bottom of the long-tailed weasel's feet has no fur in summer. Unlike skunks, which spray their musk, the long-tailed weasel drags and rubs its body over surfaces, to mark their territory and, when scared, to scare predators away. ==Distribution and Habitat== The long-tailed weasel lives in most of North America, south to Central America to northern South America. Long-tailed weasels have the largest distribution of any mustelid in the Western Hemisphere. Long-tailed weasels are found in temperate and tropical habitats in North and Central America. These habitats range from crop fields to small places with lots of trees to suburban areas. They are not found in deserts or thick forests. Their burrows and nests are in hollow logs, rock piles, and under barns. Sometimes instead of making a new nest, long-tailed weasels take the burrow of the animal they have killed. ==Behavior== Long-tailed weasels live by themselves except during the mating season. Long-tailed weasels do not like other long-tailed weasels to enter their home range. Long-tailed weasels are fast and agile. They are good climbers and swimmers. Long-tailed weasels hunt their prey by smell or sound. While long-tailed weasels can be active during the day, they are more active at night. These weasels are also known to be noisy animals, but this usually means that they are disturbed. ==Feeding== The long-tailed weasel is a carnivore. It may attack animals far larger than itself. It hunts small animals, such as mice. It also hunts large animals, such as rabbits. Long-tailed weasels help to control populations of rodents and rabbits. The long-tailed weasel likes its prey to be fresh or alive. It only eats the carrion stored in its burrows. Its mainly hunts animals such as mice, rats, squirrels, chipmunks, shrews, moles and rabbits. Sometimes, it may eat small birds, bird eggs, reptiles, amphibians, fish, earthworms and some insects. The long-tailed weasel has also been seen eating bats. It sometimes kill animals in big numbers, usually in spring when the kits are being fed, and again in autumn. Some of the surplus kills may be stored, but are usually left uneaten. When stealing eggs, the long-tailed weasel removes each egg from its nest one at a time. It carries them in its mouth to a safe place. It bites off the top and licks out the fluids in the egg. If they have babies in the burrow they may hold it in their mouth all the way back to them. ==Predators== They may be hunted by larger animals, such as large owls, coyotes, or large snakes, such as eastern massasauga rattlesnakes. ==Reproduction== The long- tailed weasel mates in July–August. The gestation period lasts 10 months. Long-tailed weasels give birth to 5–8 kits, which are born in April–May. The kits are born partially naked and blind. At birth, they weigh 3 grams. Long- tailed weasels grow fast. By the age of three weeks, the kits have lots of fur. They can crawl outside the nest and eat meat. At five weeks of age, the kit's eyes open, and the young become active. At this stage, the kits are weaned. The kits are fully grown by autumn. They leave the family at this time. The females are able to breed at 3–4 months of age. Males become sexually mature at 15–18 months. ==Economic importance== The fur of long- tailed weasels were available in the fur trade but were not a popular commodity. Long-tailed weasels are good at catching rats and mice, so farmers do not mind having weasels around their farms because they kill these pests. Long-tailed weasels are known to take poultry from poultry farms. ==References== Category:Mammals of North America Category:Mammals of South America Category:Mustelids",
 "title": "Long-tailed weasel"
}