{
 "id": "787062",
 "text": "A list of movies produced in Azerbaijan SSR ordered by year of release in the 1920s: Films:1918-1990 see also List of Soviet films ==1923-== Title Director Cast Genre Notes 1923 IX Beynəlxalq Gənclər Gününün Bərpa edilməsi Azərbaycanda Çəyirtgə ilə Mübarizə Azərbaycanda İpəkçilik Sənayesi Azərbaycanda Suvarmanın və Pambıqçılığın Bərpa edilməsi Dağıstanda \"Oktyabr İnqilabı\" Kanalı Hərbi Dənizçilərin Həyatı M. İ. Kalininin Bakıya Səfəri Sovet Azərbaycanının III İldönümü Suraxanı Neft Mədənlərində Yanğın 1924 Azərbaycana Səyahət Abbas Mirza Sharifzadeh (Sənədli Film) Bakıda Tramvay Yolunun Salınması və Yolun Açılışı Bayquş Culfa-Bakı Yolu Fəhlə Məişəti Xalq Torpaq Komissarlığı Xəzər Gəmiçiliyi Mədənçi-Neftçi İstirahətdə və Müalicədə Qız Qalası Trotskinin Bakıya Səfəri 1925 1 May 1925-ci İl 1925-ci İldə Bakı Neftçilərinin İstirahəti Almaniya Fəhlə Nümayəndə Heyətinin Bakıya Səfəri Atəşpərəstlər Məbədi Azərbaycan Balığı Azərbaycan Həmkarlar İttifaqı Şurasının V İldönümü Azərbaycan Mədən Fəhlələri Həmkarlar İttifaqının IX Qurultayı Bakı SSRİ-nin İncisidir Bakıda M. V. Frunze Tərəfindən Qırmızı Ordu Hissələrinin Yoxlanılması Bibiheybətdə Qaz Fontanı Yanğını Bismillah Abbas Mirza Sharifzadeh Dördüncü Bakı Yarmarkası Əvəz-Əvəzə Funtikovun Mühakiməsi İngiltərə Parlamenti Nümayəndə Heyəti Bakıda Nəriman Nərimanovun Dəfni Rəhbərlərin Bakıya Səfəri Sergey Yeseninin Bakıya Səfəri Suraxanıda Qaz Fontanı Şaxsey-Vaxsey 1926 Azərbaycanda Kənd Təsərrüfatı Belçika Fəhlə Nümayəndə Heyəti Bakıda Birinci Türkoloji Qurultay Həyat Uğrunda Mübarizə Müxtəlif Sahillərdə 1927 Azərbaycan Sovetlərinin V Qurultayı Balıqçılar B. S. Troyanovskinin Qastrolları Mədənçilər İttifaqının 20 İlliyi Oktyabrın On İlliyi 1928 Azərbaycanda Kinopavilyonun Açılışı Bakı Soveti Balıqçılıq Sənayesi Bizim Əsas Yolumuz Əleyhqazla Müdafiə Gilan Qızı İpəkçilik Küləklər Şəhəri Qırmızı Ordunun Onilliyi Maksim Qorki Bakıda Pambıqçılıq Tütünçülük Üç Dəniz Ölkəsinin Spartakiadası Üzümçülük və Şərabçılıq 1929 Sevil Hacı Qara Abbas Mirza Sharifzadeh Xiffət Kommunist Əməyi Qalib Gəlir Mürsəlli Daşqını Neft Fontanı Vulkan Üzərində Ev Yaz Səpini ==Other websites== * Azerbaijani film at the Internet Movie Database * Azerbaycan Kinosu Category:Lists of movies 1920 Category:Azerbaijan-related lists Category:Cinema of Azerbaijan",
 "title": "List of Azerbaijani movies of the 1920s"
}