{
 "id": "787300",
 "text": "Neshat Jahandari is an Iranian pilot. She is the first female captain of a McDonnell Douglas MD-80 based in Tehran, Iran. She is the second Iranian woman to qualify as a commercial airline pilot. She has flown 3000 thousand hours and is the youngest and only MD80 female captain of the Iranian airline. After qualifying as an airline captain, the company's video went viral. Another fame wave came when she made history being the Captain of the first all-female-crew operating a flight from Tehran to the northeastern city of Mashhad. The departing flight from the capital Tehran to Mashhad in northeast Iran was done with 160 passengers on Monday, and the return flight carried 171 passengers. Captain Jahandari posted about the news on her Instagram page, describing it as a “historic event” in Iran’s aviation industry. == Life story == Pilot Neshat Jahandari became Iran's first female certified captain in July 2019. Awarded four stripes, she is qualified to take full control of an aircraft, either on her own or supported by a copilot. In an industry still largely closed to women in the Islamic Republic, this is a significant achievement. She began to work with Zagros Airlines in the field of flight safety and the review of Flight Data Monitoring. About three and a half years later, the company needed a pilot; she passed the test and was accepted with merit. At the age of 17, she began her pilot training classes, and at the same time studied at the University. She received her degree in Aviation Flight Engineering Technology. Due to her interest in this field, after receiving her license, she received all the flight-related documents for the airliners, such as the Commercial Pilot License and the Instrument Rating. Finally, her dream came true and she became a pilot. Although, there is no that says that women cannot be pilots, it has never been easy for this to happen. “When I entered the pilot school, many were surprised and said this is a male profession and is not suitable for me,” she says. “This strange behavior could be a hindrance to me, but I believed in it and I was doing my job. I believe that everyone who does his/her best in every field, will certainly enjoy its result. In today’s world, as we have male professional chefs, we also have successful female mechanics engineers. Success has nothing to do with gender. Of course, it’s natural to be surprised to see a female pilot,” she noted. == References == Category:1989 births Category:Living people Category:Iranian people Category:Aviators",
 "title": "Neshat Jahandari"
}