{
 "id": "787317",
 "text": "The Tuol Sleng Genocide Museum, also known as Tuol Sleng, is a museum about the Cambodian genocide in Phnom Penh, the capital of Cambodia. ==Overview== The museum is in a former secondary school. The Khmer Rouge used the school as Security Prison 21 (S-21) from 1976 to 1979. About 20,000 were imprisoned there during those years. It was one of the estimated 150 torture and execution centers (known as \"Killing Fields\") created by the Khmer Rouge.Locard, Henri, State Violence in Democratic Kampuchea (1975-1979) and Retribution (1979-2004) , European Review of History, Vol. 12, No. 1, March 2005, pp.121–143. ==History== ===Background=== Tuol Sleng was originally a school called the Tuol Svay Prey High School. In March to April 1976, the Khmer Rouge, the ruling group in Cambodia, turned the school into a prison and interrogation center for people who were suspected of being against the government. They renamed it to Security Prison 21 (S-21). ===Atrocities=== People would be arrested if it was suspected that they were against the government of Pol Pot. Prisoners were forced to confess to be members of the CIA or KGB, even if they were not. Torture methods such as waterboarding, cutting, suffocation, drowning, pouring out fingernails and pouring alcohol on the wounds were used, electrocuting genitals, and forcing prisoners to eat human feces or urine. Some prisoners were used for medical experiments to help train surgeons. At least 100 prisoners were intentionally bled to death. The chief of the prison, Kang Kek Iew (also known as \"Duch\"), admitted that \"live prisoners were used for surgical study and training. Draining blood was also done.\" Most prisoners stayed at Tuol Sleng for two to three months before being executed. Kang Kek Iew ordered many executions. On a list containing the names eight teenage prisoners and nine child prisoners, he wrote the order \"Smash them to pieces.\" Many prisoners would be stabbed in the neck or clubbed to death. ===Survivors=== The total amount of prisoners who were kept at Tuol Sleng is unknown, but it is usually estimated at around 20,000. The amount of survivors is also unknown. There are twelve confirmed survivors, including seven adults and five children (one child would die shortly after liberation). These survivors say they were kept alive because they had talents and skills that the guards thought were important to keep. Some survivors, such as Chum Mey and Vann Nath, wrote and documented their experiences at Tuol Sleng. ===Discovery=== In 1979, Vietnam invaded Cambodia and liberated Tuol Sleng. A Vietnamese photographer named Hồ Văn Tây followed the smell of rotting corpses to Tuol Sleng and took many pictures. He was the first to document Tuol Sleng to the world outside Cambodia. Sometime between 1979 and 1980, Tuol Slong opened as a museum showcasing the actions committed by the prison guards. ===Court trial=== In 1997, the Extraordinary Chambers in the Courts of Cambodia was founded to hold trials for the culprits of the Cambodian genocide. On July 31, 2007, the chief of Tuol Sleng, Kang Kek Iew, was charged with war crimes and crimes against humanity. In February 2008, was taken to Tuol Sleng and collapsed in tears after saying, \"I ask for your forgiveness – I know that you cannot forgive me, but I ask you to leave me the hope that you might.\" He was first sentenced to 35 years but his sentence was extended to life in prison in 2012. He died in 2020. ==Footnotes== ==References== Category:Museums in Asia Category:Cambodian genocide Category:Concentration camps Category:Organisations based in Cambodia",
 "title": "Tuol Sleng Genocide Museum"
}