{
 "id": "787407",
 "text": "Seres Produções is an Angolan/Portugal based record label established in the early 2000s by DJ Satelite specialising in African House music == Biography == Seres Produções started in 2000 due to a curiosity between DJ Satelite and his brother DJ Vamburgue, who saw their older sister's group producing songs for the Grupo Sindicato Album. At that time, DJ Satelite and Vamburgue started producing Kuduro and invited friends to record on their beats. They were joined by one of their great friends Absinto aka Gelmiro Pireza, who today takes on another position on the label and does all the design work at the production company. In 2002, they began to gain some notoriety in their neighborhood, Bairro Marçal, one of the peripheral areas of Luanda, due to the work they began to have with many artists in the area. Between 2004 and 2005 they recorded songs and produced some of the Hits that marked a new era for Kuduro and generations. Among them the hit \"Comboio\" by Lambas, the instrumental produced by DJ Marcelo \"Esqueleto\", \"Se Desfio\" produced by DJ Satelite and other great themes like Dança Killa \"and\" Na Palma da Mão \", which were part of the first album dos Lamba entitled \"Staff of Ku-Duro\", which in 2006 sold 10,000 copies of physical CDs, this being, at the time, the first album in Angola to reach the mark of 10,000 copies sold in six hours. After the success previously made, in 2006 DJ Satelite, Bruno M and DJ Vamburgue, produced the album \"Batida Única\", which was the affirmation of the new generation of Kuduro and where they completely changed the metrics of Kuduro. Bruno M with his way of singing and creating, DJ Satelite and DJ Vamburgue meticulous in their choices about how the album could be, the three ended up doing a job with a lot of energy and success. After experiencing many adventures in Kuduro, in 2008 DJ Satelite decided to leave the room for the world, and embarked on other waves looking for a focus for his career and new steps for his production company Seres Produções. That's how he decided to upgrade Kuduro to Afro House, and launched his first work of its kind in 2012. With the growth of the label and the arrival of new artists to the house, there was a need to start publicizing all these arrivals to the world, and it was in 2014 that he started his journey through the digital world, more specifically the digital distribution through the various sales platforms. and streaming around the world. Its presence in the world of Afro House, became a growing success, as it had already happened in the world of Kuduro, and with that it could not be different its structure that had always been strong and aligned. Then, in 2016, new members of the team appeared that helped to cement and disseminate the new footprints of Seres Produçōes for this new world of African Electronic Music. Among them is DANYKAS DJ, who started by structuring small sections first, but quickly caught up with Seres' development and today is the label's manager, Dj and producer Rosario of the Mbambu Records group, which has been one of the elements that launches works assiduously with Seres Producoes, DJs and producers Over12, Inami, Afro Pupo, Wilson Kentura, Drunky Daniels, Dj Lesh SA, K.O.D and Bun Xapa who have also been impartial in the whole growth of this family. Given the exposure that Seres Produções has been having over these years, the highlight gained in the various annual label charts around the world and the great demand on the part of artists to launch their work in it, Seres created two more SRPDS and DADSA MUSIC, which appear like this, to give continuity and even more opportunities to many talented artists who deserve their highlight. == Accredited Releases == In 2016, The label compiled an Album titled \"Muloje\", which got attention in Angola and featured on The Okayafrica Magazine and Portugal based magazine, BANTUMEN. In 2018, Seres Produções released an EP from Oscar P and FNX Omar, the song held the top ten Afro House charts for several months on both Traxsource and Beatport, ending of the year of 2018 with on position 27 on the Traxsource Afro House of 2018 and position 177 on the all House music sub-genre chart. The song was then featured on the House Nation IBIZA 2018 Album by Milk & Sugar. == Events == Seres Produções holds an annual event called Room System. The first Room System event, was held in Angola at the Elinga Bar on the 4th of July 2015, then later on, the event took place in Lisbon the same year on the 11th of December, securing residency in Lisbon, Room System began to invite more attention and artists such as, Hyenah, DANYKAS DJ, Boddhi Satva, DJ Johnny, Mbambu. == Sub-labels == – SRPDS – DADSA MUSIC == References == Category:Record labels",
 "title": "Seres Produções"
}