{
 "id": "787540",
 "text": "The European mink (Mustela lutreola), is a semiaquatic type of mustelid. It is also called the Russian mink and Eurasian mink. It is native to Europe. ==Description== The European mink has a very long body with short limbs. The European mink has a large, wide head with short ears. The mink's tail is short. Males are 373–430 mm (14.7–16.9 in) long. Females are 352–400 mm (13.9–15.7 in) long. The tail is 153–190 mm (6.0–7.5 in) in males. It is 150–180 mm (5.9–7.1 in) in females. It weighs 550–800 grams (1.21–1.76 lb). It is a fast and agile animal. It is great at swimming. It is able to run along stream beds. It can stay underwater for one to two minutes. The winter fur, is very thick and dense. The fur is not long. The summer fur is a little bit shorter, hairier and less dense than the winter fur. In dark coloured European minks, the fur is dark brown or almost blackish-brown. Lighter European minks are reddish brown. ==Distribution and Habitat== European minks are found in Northeast Spain and France and throughout Europe to the Irtysh and Ob Rivers. The European mink lives in densely shaded banks of fresh water creeks, rivers, and lakes. The European minks may make their own burrows. They may live in the burrow of a water vole. They may live in cracks among root of trees. ==Feeding== The European mink eats different animals that lives in aquatic and riparian habitats. Voles are the most important source of food for the European mink. It also eats crustaceans, frogs and water insects. Fish are an important food source in floodlands. When there is a lot of food, it stores its food. ==Reproduction== The mating season happens from February to March. The gestation period is 35–72 days. The kits are given birth to in April and May. They give birth to three to seven kits. At birth, kits weigh about 6.5 grams (0.23 oz), and grow fast. They are born blind; the eyes open after 30–31 days. The kits suck milk for 2.0 to 2.5 months, even though the kits eat solid food after 20–25 days. They follow their mother to hunt by the age of 56–70 days. They leave the family at the age 70–84 days. ==Conservation status== European mink populations have been decreasing because of ecological and commercial reasons. They are now listed as critically endangered by the IUCN. The main reason is capturing them for their fur. Another reason for the decline is water pollution and hydroelectric dams. Efforts to bring European minks to the Kuril Islands and Tajikistan have begun. ==References== Category:Mustelids Category:Mammals of Europe",
 "title": "European mink"
}