{
 "id": "787775",
 "text": "The 2020 Liberal Democratic Party of Japan leadership election was held on 14 September 2020 to elect the next president of the Liberal Democratic Party of Japan. This happened three days before the National Diet held a session to elect the new Prime Minister. Chief Cabinet Secretary Yoshihide Suga easily won the election. As the Liberal Democratic Party currently controls a majority in the National Diet as a member of the governing coalition, Suga is also expected to succeed Abe as Japan's prime minister. ==Background== It was supposed to be held in September 2021, however incumbent party president and the longest-serving Prime Minister of Japan, Shinzo Abe, suddenly resigned on 28 August 2020, because of health reasons. The winner of the race will fill in for the remainder of Abe's term as president. As the Liberal Democratic Party currently controls a majority in the National Diet, the winner of the race will also replace Abe as Japan's prime minister. ==Candidates== ===Declared=== *Shigeru Ishiba, runner-up in the 2012 and 2018 leadership elections; member of the House of Representatives for Tottori 1st district; former Minister for Overcoming Population Decline and Vitalizing Local Economy (2014–2016) and Defense Minister (2007–2008). *Fumio Kishida, current chair of the LDP Policy Research Council, member of the House of Representatives for Hiroshima 1st district; former Minister of Foreign Affairs (2012–2017), former acting Defense Minister (2017). * Yoshihide Suga, Chief Cabinet Secretary, member of the House of Representatives for Kanagawa 2nd district; former Minister for Internal Affairs and Communications (2006–2007). File:Gates meets Ishiba 8 November 2007 cropped for Ishiba.jpg| File:Fumio Kishida Minister.jpg| File:Yoshihide Suga cropped 3 Joint Press Announcement of the Okinawa Consolidation Plan.jpg| ==Polling== Polling firm/link Date of polling Sample size Fumio Kishida Shinjiro Koizumi Tarō Kōno Shigeru Ishiba Hakubun Shimomura Yoshihide Suga Undecided/NOTA Notes Mainichi Shimbun/SSRC 9 September 2020 Unknown - - - 36% - 44% 20% Asahi Shimbun 2-3 September 2020 1,130 5% - - 25% - 38% 32% Nikkei/TV Tokyo 29-30 August 2020 Unknown 6% 14% 15% 28% - 11% 26% Kyodo News 28-30 August 2020 1,050 7.5% 10.1% 13.6% 34.3% - 14.3% 20.2% ==Results== Results Candidate Diet members Prefectural representatives Total points Votes cast % Votes cast % Total votes % Yoshihide Suga 288 73.1% 89 63.1% 377 70.5% Fumio Kishida 79 20.1% 10 7.1% 89 16.6% Shigeru Ishiba 26 6.6% 42 29.8% 68 12.7% Total 394 100% 141 100% 535 100% ==References== Liberal Democratic Party Liberal Democratic Party Liberal Democratic Party Liberal Democratic Party Category:Liberal Democratic Party (Japan)",
 "title": "2020 Liberal Democratic Party (Japan) presidential election"
}