{
 "id": "787712",
 "text": "Thompson is a Croatian ethno band, founded by Marko Perković aka \"Thompson\", often thought of as the same as the band itself. \"Thompson\" is Perković's stage name. He is the songwriter and lead vocalist. The members of the band, aside from him, are Tomislav Mandarić, Ivan Ivanković, Duje Ivić, and Ivica Bilić Ike. The band name originates from the Thompson submachine gun, a nickname given to Perković while he fought in the Croatian War of Independence. Although mostly formed in Čavoglave, Thompson is currently based in Zagreb. Thompson came to be popular during the Croatian war in 1991, with the release of the first single \"Bojna Čavoglave\", which is about the Croatian participation in the Yugoslav Wars and was included in the compilation album Rock za Hrvatsku. This song, with slightly different lyrics, named \"Branitelji Sarajeva\", was sung by the BiH Army during the Siege of Sarajevo (Sarajevo zaboravit neće nikada). During the 1990s Thompson became popular in Croatia with the release of the first album Moli mala in 1992. They later became popular again with the hit \"Prijatelji\" in 1998. In 2002, Thompson started their first major tour to promote the album E, moj narode. This tour continued on and off until 2005, and included concerts at the Sydney Entertainment Centre and Melbourne's Vodafone Arena. In May 2005, the album was declared a Diamond Record with more than 60,000 copies sold. Touring continued in 2006 with Bilo jednom u Hrvatskoj, again performing internationally with concerts in Germany, Sweden, Australia, Canada, and the United States. Thompson features annually at the Homeland Victory celebrations in their hometown of Čavoglave. These performances are attended by as many as 60,000 to 100,000 viewers, and feature Croatian singers like Mate Bulić, Dražen Zečić, Ivan Mikulić, and Baruni. The band has became controversial for its alleged praise of the World War Two Nazi-affiliated Ustaše regime in their songs and concerts. ==References== ==Other websites== * Official website * \"Rocking The Boat\", Washington Post, 5 November 2007 *Voinovich urges cancellation of concert in Cleveland, Ohio by Croatian rock star Thompson *Coverage of Thompson, thestar.com *\"A Croatian rock star flirts with the Nazi past\", International Herald Tribune, 1 July 2007 Category:20th-century establishments in Croatia Category:1991 establishments in Europe Category:Rock bands Category:Musical groups established in 1991 Category:Organizations based in Croatia",
 "title": "Thompson (band)"
}