{
 "id": "787771",
 "text": "is a Japanese politician. In September 2020, he was elected Prime Minister of Japan and became President of the Liberal Democratic Party replacing Shinzo Abe. He resigned in September 2021 after negative approval ratings because of his government's handling of the COVID-19 pandemic in Japan and the 2020 Summer Olympics. He was replaced by former Foreign Minister Fumio Kishida. In September 2024, Suga became the Vice President of the Liberal Democratic Party. ==Early life== Suga was born to a family of strawberry farmers in Ogachi (now Yuzawa), a rural area in Akita Prefecture. He moved to Tokyo and earned a Bachelor of Laws from Hosei University in 1973. He worked in a cardboard factory in Tokyo to pay his tuition. ==Political career== He was the Chief Cabinet Secretary from December 2012 to September 2020 during the Shinzo Abe cabinet. He represented the Kanagawa 2nd district in the House of Representatives, first elected in 1996. He was Minister of Internal Affairs and Communications in the cabinet of Shinzo Abe from September 2006 to August 2007. He is a member of the Liberal Democratic Party. ===Prime Minister=== In August 2020, Suga announced his candidacy for the Liberal Democratic leadership election to replace Prime Minister Shinzo Abe who resigned. Suga easily won the election. He became the Prime Minister of Japan on 16 September 2020. When Suga began his time in office he was popular, but his approval ratings quickly fell because the public did not like his leadership during the COVID-19 pandemic and management of the delayed 2020 Summer Olympics. By the end of Suga's premiership he was recording some of the lowest approval ratings in Japanese history. He was not doing well in polling numbers of the 2021 LDP leadership election and upcoming 2021 general election. Suga announced on 3 September 2021 that he would not seek reelection as President of the LDP, ending his term as Prime Minister after just one year. He left office on 4 October and was replaced by Fumio Kishida. ==Personal life== Suga is married and has three sons. His wife, Mariko, is the sister of one of his former co- workers in the office of Hikosaburo Okonogi. ==References== ==Other websites== * * * Prime Minister of Japan and His Cabinet Official website Category:1948 births Category:Living people Category:Prime ministers of Japan Category:Politicians from Kanagawa Prefecture Category:People from Akita Prefecture Category:Liberal Democratic Party (Japan) politicians Category:Chief Cabinet Secretaries of Japan Category:Internal Affairs and Communications ministers of Japan",
 "title": "Yoshihide Suga"
}