{
 "id": "788084",
 "text": "Fabiana Pierre-Louis is an associate justice of the New Jersey Supreme Court. She is the first Black woman on New Jersey's highest court. She is also the youngest person to be on the court. Before joining the court, Pierre Louis worked as attorney-in-charge of the U.S. Attorney's Trenton and Camden branches and as a partner at the law firm of Montgomery McCracken. ==Early life and education == Pierre-Louis' family lived in Brooklyn before moving to Irvington, New Jersey. She is the daughter of Haitian American immigrants and speaks Haitian Creole fluently. Pierre-Louis graduated from Union Catholic Regional High School in 1998.Staff. \"Union Catholic Graduate Fabiana Pierre- Louis Nominated To Become First Black Woman To Serve on NJ Supreme Court\" , TAP into Elizabeth, June 5, 2020. Accessed June 5, 2020. \"Fabiana Pierre- Louis, a member of Union Catholic’s Class of 1998, made history on Friday when N.J. Governor Phil Murphy said he will nominate her to become New Jersey’s first black woman to serve on the New Jersey Supreme Court.\" She earned a bachelor's degree from Rutgers University and a juris doctor from Rutgers Law School. == Career == Pierre-Louis worked as a law clerk for New Jersey Supreme Court Justice John E. Wallace Jr.. Pierre-Louis worked for almost ten years as an Assistant United States Attorney in the office of United States Attorney for the District of New Jersey. She was also the attorney-in-charge of the U.S. Attorney's Trenton and Camden branches. After that, she became a partner at the law firm of Montgomery McCracken. On June 5, 2020, New Jersey Governor Phil Murphy said he wanted to name Pierre-Louis to the New Jersey Supreme Court. She would replace Walter F. Timpone, who was almost at the state's retirement age for judges. On August 24, 2020, the New Jersey Senate's Judiciary Committee voted 11-0 to send her nomination to the full Senate, and on August 27, 2020, the Senate voted 39-0 to confirm her to the Court. Pierre- Louis swore her oath of office on September 1, 2020. She is the first Black woman on the court. She is also the youngest judge ever on the court. == Personal life == Pierre-Louis and her husband, Robert Reeves, have two sons. As of 2020, the family lives in Mount Laurel. == References == Category:1980s births Category:Living people Category:American judges Category:Lawyers from New Jersey Category:Politicians from New Jersey Category:Democratic Party (United States) politicians",
 "title": "Fabiana Pierre-Louis"
}