{
 "id": "788193",
 "text": "The 2020 Tuscan Grand Prix (officially known as the Formula 1 Pirelli Gran Premio della Toscana Ferrari 1000 2020) was a Formula One motor race held on 13 September 2020 at the Autodromo Internazionale del Mugello in Scarperia e San Piero, Tuscany, Italy. The race was the ninth round of the 2020 Formula One World Championship and the first race of the season with spectators. The race was won by Lewis Hamilton of the Mercedes team, with teammate Valtteri Bottas in second; Mercedes scored their third 1–2 finish of the season. Alexander Albon of Red Bull Racing-Honda scored his first podium in Formula One with a third-place finish, becoming the first Thai driver to do so. The race was the first since the 2016 Brazilian Grand Prix to have two red flags. Due to the two stoppages, the race had three standing starts. == Background == The race was held as an event celebrating Ferrari's 1000th race in the Formula One World Championship and the safety car used a red livery, instead of its usual silver colour, to mark the occasion. The Mugello Circuit hosted a World Championship Formula One race for the first time. The Ferrari SF1000 sported a special livery: instead of the traditional rosso corsa, the car was painted dark burgundy. Both Sebastian Vettel and Charles Leclerc wore special racing overalls, and both had special helmet designs. === Impact of the COVID-19 pandemic === The championship was heavily affected by the COVID-19 pandemic. Most of the originally scheduled Grands Prix were cancelled or postponed, prompting the Fédération Internationale de l'Automobile to draft a new calendar. While the previous eight events were held behind closed doors, organizers announced that up to 2,880 spectators would be allowed for the Tuscan Grand Prix. === Entrants === Ten teams (each representing a different constructor) each entered two drivers. The drivers and teams were the same as those on the season entry list with no additional stand-in drivers for either the race or practice. === Tyres === Sole Formula One tyre manufacturer Pirelli brought the C1, C2, and C3 compound tyres for teams to use in the race, the three hardest compounds available. == Qualifying == === Qualifying classification === Driver Constructor Q1 Q2 Q3 1 44 Lewis Hamilton Mercedes 1:15.778 1:15.309 1:15.144 1 2 77 Valtteri Bottas Mercedes 1:15.749 1:15.322 1:15.203 2 3 33 Max Verstappen Red Bull Racing-Honda 1:16.335 1:15.471 1:15.509 3 4 23 Alexander Albon Red Bull Racing-Honda 1:16.527 1:15.914 1:15.954 4 5 16 Charles Leclerc Ferrari 1:16.698 1:16.324 1:16.270 5 6 11 Sergio Pérez 1:16.596 1:16.489 1:16.311 7 7 18 Lance Stroll 1:16.701 1:16.271 1:16.356 6 8 3 Daniel Ricciardo Renault 1:16.981 1:16.243 1:16.543 8 9 55 Carlos Sainz Jr. McLaren-Renault 1:16.993 1:16.522 1:17.870 9 10 31 Esteban Ocon Renault 1:16.825 1:16.297 No time 10 11 4 Lando Norris McLaren-Renault 1:16.895 1:16.640 N/A 11 12 26 Daniil Kvyat AlphaTauri-Honda 1:16.928 1:16.854 N/A 12 13 7 Kimi Räikkönen Alfa Romeo Racing-Ferrari 1:17.059 1:16.854 N/A 13 14 5 Sebastian Vettel Ferrari 1:17.072 1:16.858 N/A 14 15 8 Romain Grosjean Haas-Ferrari 1:17.069 1:17.254 N/A 15 16 10 Pierre Gasly AlphaTauri-Honda 1:17.125 N/A N/A 16 17 99 Alfa Romeo Racing-Ferrari 1:17.220 N/A N/A 17 18 63 George Russell Williams-Mercedes 1:17.232 N/A N/A 18 19 6 Nicholas Latifi Williams-Mercedes 1:17.320 N/A N/A 19 20 20 Kevin Magnussen Haas-Ferrari 1:17.348 N/A N/A 20 107% time: 1:21.051 Source: * – Sergio Pérez received a one-place grid penalty for causing a collision with Kimi Räikkönen during the second practice session. * – Daniil Kvyat and Kimi Räikkönen set identical times in Q2; Kvyat was classified ahead as he set his lap time before Räikkönen. == Race == The race was marked by several incidents. On the first lap at turn 2, Max Verstappen, Pierre Gasly, Kimi Räikkönen, and Romain Grosjean collided, resulting in Gasly and Verstappen retiring from the race and Räikkönen having to change his front wing. Verstappen's car was beached in the gravel trap. A separate incident at the same corner involved Carlos Sainz Jr. and Lance Stroll, as Sainz spun round and damaged Sebastian Vettel's front wing. These incidents together brought out the safety car. On lap 6 the safety car pulled in, but an accordion effect led the midfield drivers to accelerate up to racing speed before the leaders did and were forced to brake, triggering a collision involving Sainz, Kevin Magnussen, Antonio Giovinazzi, and Nicholas Latifi. Grosjean blamed the leader, Valtteri Bottas, for causing the accordion effect, and stated \"this is the worst thing I've seen ever.\" All four drivers retired from the race and the red flag was brought out. During the red flag period, Esteban Ocon retired due to a brake failure; George Russell had earlier reported Ocon's brakes being on fire. The second red flag came on lap 45, after Stroll suffered a tyre failure at lap 43 turn 9, and went into the barrier. His Racing Point RP20 caught on fire, making it harder for the marshalls to clear the track. Lewis Hamilton won the race, his 90th career win. Valtteri Bottas came in second and Alex Albon finished third; his first career podium. By finishing in ninth place, Kimi Räikkönen scored his first points of the season. A poor restart after the second red flag meant George Russell slipped from ninth to 12th and last. He eventually finished 11th leaving him out of the points. Twelve drivers were warned by the FIA for their part in the accident at the restart on lap 6. Writing for the BBC, former GP2 Series champion Jolyon Palmer praised the circuit, saying that it \"defied all the [Hermann] Tilke design theories and yet provided a great spectacle in the traditional sense.\" === Race classification === Driver Constructor Time/Retired Points 1 44 Lewis Hamilton Mercedes 59 2:19:35.060 1 26 2 77 Valtteri Bottas Mercedes 59 +4.880 2 18 3 23 Alexander Albon Red Bull Racing- Honda 59 +8.064 4 15 4 3 Daniel Ricciardo Renault 59 +10.417 8 12 5 11 Sergio Pérez 59 +15.650 7 10 6 4 Lando Norris McLaren-Renault 59 +18.883 11 8 7 26 Daniil Kvyat AlphaTauri-Honda 59 +21.756 12 6 8 16 Charles Leclerc Ferrari 59 +28.345 5 4 9 7 Kimi Räikkönen Alfa Romeo Racing-Ferrari 59 +29.770 13 2 10 5 Sebastian Vettel Ferrari 59 +29.983 14 1 11 63 George Russell Williams- Mercedes 59 +32.404 18 12 8 Romain Grosjean Haas-Ferrari 59 +42.036 15 Ret 18 Lance Stroll Racing Point-BWT Mercedes 42 Accident 6 Ret 31 Esteban Ocon Renault 7 Brakes 10 Ret 6 Nicholas Latifi Williams-Mercedes 6 Collision damage 19 Ret 20 Kevin Magnussen Haas-Ferrari 5 Collision 20 Ret 99 Alfa Romeo Racing-Ferrari 5 Collision 17 Ret 55 Carlos Sainz Jr. McLaren-Renault 5 Collision 9 Ret 33 Max Verstappen Red Bull Racing-Honda 0 Collision 3 Ret 10 Pierre Gasly AlphaTauri-Honda 0 Collision 16 Fastest lap: Lewis Hamilton (Mercedes) – 1:18.833 (lap 58) Source: ; Notes * – Includes one point for fastest lap. * – Kimi Räikkönen finished eighth on the track, but received a five-second time penalty for crossing the pit entry line. == Championship standings after the race == ;Drivers' Championship standings Driver Points 1 Lewis Hamilton 190 2 Valtteri Bottas 135 3 Max Verstappen 110 1 4 Lando Norris 65 1 5 Alexander Albon 63 Source: Source: Source: Source: ;Constructors' Championship standings Constructor Points 1 Mercedes 325 2 Red Bull Racing- Honda 173 3 McLaren-Renault 106 4 Racing Point-BWT Mercedes 92 5 Renault 83 Source: Source: Source: Source: * Note: Only the top five positions are included for both sets of standings. == Related pages == * 2020 Mugello Formula 2 round * 2020 Mugello Formula 3 round == Notes == == References == Category:Formula One Grands Prix",
 "title": "Tuscan Grand Prix"
}