{
 "id": "788215",
 "text": "Sarah Baartman (born around 1789, died 29th December 1815) was a Khoikoi woman from South Africa, who came to great fame in Europe. Her name is also spelled Bartman or Bartmann. She showed signs of Steatopygia; which means she had a lot of fat in her buttocks. Around 1810, she was brought to Europe. She was one of at least twoAnother \"Hottentot Venus\" featured at a fête given in 1829 for the Duchess of Berry :Poster Khoikoi women, who were shown at freak shows. In English she became known as Hottentot Venus. At the time, people believed there were different races of humans. Hottentot was the term used to refer to the Khoikoi people, as a race. Today, many consider it to be racist. From about 1810, Baartman performed for upper-class people in London. She danced, sang and played an instrument, called Ramkie.Lyndel V. Prott: The Return of Saartjie Baartman to South Africa. In: Lyndel V. Prott (Ed.): Witnesses to History. A Compendium of Documents and Writings on the Return of Cultural Objects. UNESCO Publishing, Paris 2009, S. 288 The Ramkie is a kind of lute with 3 or 4 chords that was popular in South Africa at the time. The African Institution, led by Zachary Macaulay offered to bring Sarah Baaerman back to South Africa, but she declined. It is unknown if she was put under pressure, or if she declined because in South Africa her people were persecuted (much like a modern-day genocide). She may also have liked the performances. There was a court hearing, done in Dutch; there she said that she wasn't forced to do anything. She also said that she had been promised half the earnings from her show. The court hearing had drawn too much attention, and she could no longer perform in London. Hendrick Caezar, her manager at the time, moved to the English countryside, with his \"freak.\" Reverend Joshua Brooks baptized her on December 1, 1811, in a church in Manchester. In 1814. she came to Paris with another manager. There, mostly scientists were interested. She was presented to the audience, mostly of doctors and scientists, in the Jardin des Plantes, in Paris. Professional portraits were done. She died, presumably of pneumonia, on December 29, 1815. Georges Cuvier prepared her corpse: The skeleton, the brain, and her genitals were preserved. A gypsum plaster model was made of her body. All of these are preserved in what is the Musée de l'Homme in Paris, today. Stephen Jay Gould and Élisabeth de Fontenay pointed out that these exhibitions were sexist, and focused on their own people (\"ethnocenric\"), in 1982. President Nelson Mandela asked that the remains of Sarah Baartman be given back to South Africa. At first, French academics refused. It was only in 2002, that her remains were given back. There was a large funeral in Hankey at the River Gamtoos in the area of Baviaanskloof, on 9. August 2002. Thabo Mbeki, who was the president of South Africa at the time, gave the funeral speech. The district Cacadu, where her grave is was renamed to Sarah Baartman, in her honor, in 2015. ==More images == File:Baartman.jpg|Carricature of Baartman, done in the 19th century, author unknown == Other websites == ; History * Documents regarding the court hearing of S.B, of 1810; National Archive, Black Presence, Asian and Black History in Britain 1500-1850 * Suggestion of the law regulating the restitution of the remains of S. B. to South Africa, including the poem by Diana Ferrus; presented to the French Senate by Senator M. Nicolas ABOUT, 4. December 2001 * Dossier regarding French Law n° 2002-323 of March 6, 2002 regulating the repatriation of the remains of S.B.to South Africa, including links to session notes * South African Government Information: Sarah Bartmann Dressing Ceremony, 4 AUGUST 2002 * South African Government Information: Sarah Bartmann Interment Ceremony, 9 August 2002, Hankey, Eastern Cape ; Other links * Gamtos Tourism Information; S.B's grave, without enclosure. * Gender and Womens's Studies for Africa's Transformation, Yvette Abrahams, Colonialism, disjuncture and dysfunction: Sarah Bartmann's resistance, and approach from gender research * Mara Verna: „Hottentot Venus“, interactive audio presentation, including links, bibliography,talks, interviews and speeches * Lucille Davie: Sarah Baartman, at rest at last == References == Category:1780s births Category:1815 deaths Category:South African people Category:Anthropology",
 "title": "Sarah Baartman"
}