{
 "id": "788355",
 "text": "Serbian Americans (), also known as American Serbs (), are United States citizens whose ancestors are Serbs. As of 2013, there were about 190,000 American citizens who said that they had Serb ancestry. However, the number may be much higher, as there were also 290,000 people who said that they were Yugoslavs living in the United States. The group includes Serbian Americans living in the United States for one or many generations, people who are citizens of both Serbia and the United States, or any other people who say that they are both Serbian and American. ==History== One of the first Serb immigrants to the United States was the settler George Fisher, who came to Philadelphia in 1815, moved to Mexico, fought in the Texan Revolution, and became a judge in California. Another important early Serb in America was Basil Rosevic, who started a shipping company, the Trans-Oceanic Ship Lines, around the year 1800.Dorich, William. \"Who Are the Serbs?\" World Affairs Council of Orange County. California, Irvine. 1995. Speech. In the early 1800s, many Serb sailors and fishermen from Montenegro and Herzegovina came to New Orleans looking for work. In 1841, Serbs founded the Greek Orthodox parish with Greek immigrants in New Orleans.Durniak, Gregory, Constance Tarasar, and John H. Erickson. Orthodox America: 1794-1976: Development of the Orthodox Church in America. New York: Orthodox Church in America. Department of History and Archives, 1975. Print. Serbian Americans fought in the American Civil War, mostly on the side of the Confederacy, as most Serbs living in America were in Louisiana and Mississippi. A few Confederate military units were started by Serbs in Louisiana, such as the Cognevich Company (named for Stjepan Konjevic, who immigrated to Louisiana in the 1830s), and the First and Second Slavonian Rifles. At least 400 Serbs fought in these three units during the Civil War.Vujnovich, Milos M. Yugoslavs in Louisiana. Gretna: Pelican, 1974. Print. Several other known Serbs who fought in the Civil War came from Alabama and Florida, specifically from Pensacola. Some Serbian Americans went back to Serbia to fight in the First Balkan War. During World War I, as many as 15,000 Serbian Americans went back to the Balkans to fight. Serbs in the United States who did not fight in the war raised knowledge, campaigned for the creation of Yugoslavia, sent aid to the Balkans through the Red Cross, formed a Serbian Relief Committee, and urged important Americans to support the Serbian cause. After World War II many Serbs immigrated to the United States from Yugoslavia after Josip Broz Tito took control of the country. Since then, many Serbian American organizations have been formed in the United States. A number of Serbian American engineers worked on the Apollo program. ===Alaska=== Serbs have lived in Alaska since the first Serbs came to America in the 19th century. Many Serbs came in the Klondike Gold Rush in the late 1890s to earn money, just like they had done in the California Gold Rush. The places where most Serbs settled in Alaska were Juneau, Douglas, Fairbanks, and Sitka. Many Serbs also settled in the Canadian Yukon during the gold rush as well, such as the legendary gold miner Black Mike Vojnić. In 1893, Serbian miners in Alaska built the Orthodox Church in Juneau with the native Orthodox Tlingit people, who had been converted to Orthodoxy by the Russians decades before. \"The History of the St Nicholas Church.\" St. Nicholas Russian Orthodox Church - Home. Orthodox Church in America, n.d. Web. 10 June 2017.Archer, Laurel. Northern British Columbia Canoe Trips. Surrey, B.C.: Rocky Mountain, 2010. Print. During the First World War, many Serbian Americans went back to Serbia to fight, and thousands of them came from Alaska. In recent years, it has become common for Serbian workers to come to Alaska every year to work for a few months in canneries, where food and living space is given to them. These workers stay in Alaska on temporary work visas, and speak English.\"Man from Belgrade Earned Serbian Annual Salary in Alaska in 55 Days.\" Telegraf.rs. N.p., 5 Jan. 2017. Web. 12 June 2017. ==Population== ===Demographics=== In the past, number of Serbs who immigrated to the United States was difficult to find as Serb immigrants were often recorded by their country of origin, so as Turks, Croats, Slovenes, Montenegrins, Dalmatians, Bosnians, Herzegovinians and Austro-Hungarians. In the 1910 census, there were 16,676 Serbs from Austria-Hungary, 4,321 from Serbia, and 3,724 from Montenegro. 187,738 citizens of the United States said that they Serb ethnicity in 2010. The 2012 American Community Survey estimated that there were 199,080 Americans with Serb ancestry. It is likely that some of the American citizens who said that they had Yugoslavian ethnicity (328,547 in 2010; 310,682 in 2012 estimation) are also ethnic Serbs. Places in the United States where many Serbs have settled include Chicago, New York City, Indianapolis, Milwaukee, Pittsburgh, Phoenix, and Jackson, California. ===Serbian-born population=== Serbian-born population in the US since 2010: Year Number 2010 30,715 2011 30,758 2012 35,765 2013 36,160 2014 33,628 2015 36,969 2016 37,654 2017 38,203 ==References== ==Other websites== * USA SERBS/Serbian-American network * Famous Serbian Americans * Serbian National Defense Council of America * Serb National Federation * Serbs for Serbs * Serb Life eMagazine * About the notable Alaskan Serb Dapcevich family Category:Ethnic groups in the United States",
 "title": "Serbian Americans"
}