{
 "id": "788419",
 "text": "In mathematics, a function maps an input value to an output value. In the case of a matrix function, the input and the output values are matrices. One example of a matrix function occurs with the Algebraic Riccati equation, which is used to solve certain optimal control problems. Matrix functions are special functions made by matrices.Higham, Nicholas J. (2008). Functions of matrices theory and computation. Philadelphia: Society for Industrial and Applied Mathematics. ==Definitions== Most functions like \\exp(x) are defined as a solution of a differential equation.Andrews, G. E., Askey, R., & Roy, R. (1999). Special functions (Vol. 71). Cambridge University Press. But matrix functions will use a different way. Suppose z is a complex number and A is a square matrix. If you have a polynomial: :f(z):=c_0+c_1z+\\cdots+c_mz^m, then it is reasonable to define :f(A):=c_0I+c_1A+\\cdots+c_mA^m. Let's use this idea. When you have :f(z):=\\sum_{k=0}^\\infty c_kz^k, then you can introduce :f(A):=\\sum_{k=0}^\\infty c_kA^k. For example, the matrix version of the exponential function and the trigonometric functions are defined as follows: :\\exp A:=\\sum_{k=0}^\\infty\\frac{1}{k!}A^k, :\\sin A:=\\sum_{k=0}^\\infty\\frac{(-1)^k}{(2k+1)!}A^{2k+1},\\quad \\cos A:=\\sum_{k=0}^\\infty\\frac{(-1)^k}{(2k)!}A^{2k}. ==Importance== Matrix functions are used at numerical methods for ordinary differential equationsHochbruck, M., & Ostermann, A. (2010). Exponential integrators. Acta Numerica, 19, 209-286.Al-Mohy, A. H., & Higham, N. J. (2011). Computing the action of the matrix exponential, with an application to exponential integrators. SIAM journal on scientific computing, 33(2), 488-511.Del Buono, N., & Lopez, L. (2003, June). A survey on methods for computing matrix exponentials in numerical schemes for ODEs. In International Conference on Computational Science (pp. 111-120). Springer, Berlin, Heidelberg. and statistics.James, A. T. (1975). Special functions of matrix and single argument in statistics. In Theory and Application of Special Functions (pp. 497-520). Academic Press. This is why numerical analysts are studying how to compute them. For example, the following functions are studied: * Matrix exponentialMoler, C., & Van Loan, C. (1978). Nineteen dubious ways to compute the exponential of a matrix. SIAM review, 20(4), 801-836.Moler, C., & Van Loan, C. (2003). Nineteen dubious ways to compute the exponential of a matrix, twenty-five years later. SIAM review, 45(1), 3-49.Higham, N. J. (2005). The scaling and squaring method for the matrix exponential revisited. SIAM Journal on Matrix Analysis and Applications, 26(4), 1179-1193.Sidje, R. B. (1998). Expokit: A software package for computing matrix exponentials. ACM Transactions on Mathematical Software (TOMS), 24(1), 130-156.Yuka Hashimoto,Takashi Nodera, Double-shift-invert Arnoldi method for computing the matrix exponential, Japan J. Indust. Appl. Math, pp727-738, 2018. * Root of a matrixBini, D. A., Higham, N. J., & Meini, B. (2005). Algorithms for the matrix pth root. Numerical Algorithms, 39(4), 349-378. * Matrix cosine and sineHargreaves, G. I., & Higham, N. J. (2005). Efficient algorithms for the matrix cosine and sine. Numerical Algorithms, 40(4), 383-400. * Logarithm of a matrixHale, N., Higham, N. J., & Trefethen, L. N. (2008). Computing A^\\alpha,\\log(A), and related matrix functions by contour integrals. SIAM Journal on Numerical Analysis, 46(5), 2505-2523. * Validated numerics for the functions aboveMiyajima, S. (2019). Verified computation of the matrix exponential. Advances in Computational Mathematics, 45(1), 137-152.Miyajima, S. (2019). Verified computation for the matrix principal logarithm. Linear Algebra and its Applications, 569, 38-61.Miyajima, S. (2018). Fast verified computation for the matrix principal pth root. Journal of Computational and Applied Mathematics, 330, 276-288. * Matrix version of the gamma functionJoao R. Cardoso, Amir Sadeghi, Computation of matrix gamma function, BIT Numerical Mathematics, (2019) ==Related pages== * Matrix analysis * Linear algebra ** Numerical linear algebra ==References== ==Further reading== * A Survey of the Matrix Exponential Formulae with Some Applications (2016), Baoying Zheng, Lin Zhang, Minhyung Cho, and Junde Wu. J. Math. Study Vol. 49, No. 4, pp. 393-428. * Higham, N. J. (2006). Functions of matrices. Manchester Institute for Mathematical Sciences, School of Mathematics, The University of Manchester. category:Functions and mappings category:Linear algebra",
 "title": "Matrix function"
}