{
 "id": "78867",
 "text": "{{Infobox settlement | name = Graubünden | native_name = | official_name = Canton of Graubünden Canton of the Grisons | settlement_type = Canton | image_flag = Flag of Canton of Graubünden.svg | image_shield = CHE Graubünden COA.svg | shield_size = 80x80px | shield_link = | image_map = | map_alt = Map of Switzerland, location of the Grisons highlighted | map_caption = Location in Switzerland | coordinates = | seat_type = Capital | seat = Chur | parts_type = Subdivisions | parts_style = para | p1 = 108 municipalities | p2 = 11 districts | leader_title = Executive | leader_name = Executive Council (5) | leader_title1 = Legislative | leader_name1 = Grand Council (120) | area_footnotes = | area_total_km2 = | population_footnotes = | population_total = | population_as_of = | population_density_km2 = auto | iso_code = CH-GR | blank_name_sec1 = Highest point | blank_info_sec1 = : | blank1_name_sec1 = Lowest point | blank1_info_sec1 = : border to Ticino at | blank_name_sec2 = Joined | blank_info_sec2 = 1803 | blank1_name_sec2 = Languages | blank1_info_sec2 = German, Romansh, Italian | website = }} The Grisons or Graubünden,Names include: * , Swiss Standard German: , German Standard German: ; * Romansh: ** ** ** ** ** ** ; * ; * . more formally the canton of the Grisons or the canton of Graubünden, is the biggest and is farthest to the east of the cantons of Switzerland. The name means \"Gray Union\" in German and the canton lies entirely in the Alps. In Switzerland it hosts the biggest number of tourists each year. ==Geography== The area of the canton is 7,105 km². Only one third of this land is used for farming. Forests cover 20% of the total area. The canton has many mountains that make up the highlands of the Rhine and Inn river valleys. Many of its scenic areas are part of the Swiss National Park or the Ela Nature Park. There are many important peaks in the Grison Alps, including the Tödi at 3,614 meters and the highest peak Piz Bernina at 4,049 meters. Many of the mountain ranges feature huge glaciers, such as at the Adula, the Albula, the Silvretta, the Bernina, the Bregaglia and the Rätikon ranges. The mountain ranges in the central area contain many of the deepest vallies in Switzerland. The canton borders Liechtenstein to the north, Austria to the north and the east, Italy to the south, and the cantons of St. Gallen to the northwest; Glarus and the canton of Uri to the west, and Ticino to the southwest. The capital city is Chur. Davos and St. Moritz are world-famous resorts and can be found in this area. ==History== Most of the lands of the canton were once part of a Roman province called Raetia that was established in 15 BC. The area later was part of the lands of the diocese at Chur. In 1367 the League of God's House was founded against the power of the Bishop of Chur. This was followed by the making of the Grey League, sometimes called Oberbund, in 1395 in the Upper Rhine valley. The name Grey League is derived from the homespun grey clothes worn by the people. The name of this league later gave its name to the canton of Graubünden. The first step towards the naming of the canton into Graubünden was when the league of the Ten Jurisdictions allied with the League of God's House in 1450. In 1471, the two leagues aligned with the Grey League. This meant that the leagues allied with the Swiss Confederation. The Habsburgs were defeated at Calven Gorge and Dornach, helping the Swiss confederation and the allied leagues of the canton of Grisons to be recognized. The last traces of the bishop of Chur's jurisdiction were abolished in 1526. The Musso war of the 1520 drove the Three Leagues closer to the Swiss Confederacy. The lands of the canton of Graubünden were part of the Helvetic Republic, but the \"perpetual ally\" of Switzerland became a canton in 1803. The constitution of the canton dates from 1892. The arms of the three original leagues are now all part of the coat of arms of the canton. Private cars were only allowed in the canton of Graubünden after several votings in 1926. ==Culture== The Graubünden are known for a dried-beef delicacy called Bündnerfleisch and for a nut and honey pie known as Bündner Nusstorte. Another specialty, made mostly in the western part of Grison, is Capuns, a filling meal of pasta and a little bit of meat, rolled into Chard leaves, eventually baked like a gratin with cheese. ==Economy== Agriculture and tourism make up most of the canton's economy. Agriculture combines forests and mountain pasturage in summer, mostly beef but also sheep and goats. Tourism is all around the canton, mainly around the towns of Davos/Arosa, Flims and St. Moritz/Pontresina, which are important in both winter and summer. There are many other resorts people visiting the country can go to in the canton. There is wine production around the capital Chur. Chur is also the center of industry. In the southern valleys of Mesolcina/Misox and Poschiavo there is corn (maize) and chestnut farming. ==Demographics== The languages spoken in Graubünden are German in the northwest, Romansh in the Engadin and around Disentis/Mustér), and Standard Italian in the valleys Mesolcina/Misox, Calanca, Val Bregaglia, and Poschiavo. The main religions are Protestantism and Catholicism. Both are well-represented in the canton, with Roman Catholics forming a slight majority. ==Districts== Graubünden is divided into 11 districts: * Albula * Bernina * Hinterrhein * Imboden * Inn * Landquart * Maloja * Moesa * Plessur * Davos * Surselva ==Municipalities== There are 209 municipalities in Graubünden (as of April 2004): * Almens * Alvaneu * Alvaschein * Andeer * Andiast * Ardez * Arosa * Arvigo * Ausserferrera * Avers * Bergün/Bravuogn * Bever * Bivio * Bonaduz * Bondo * Braggio * Breil/Brigels * Brienz/Brinzauls * Brusio * Buseno * Calfreisen * Cama * Castaneda * Castasegna * Castiel * Casti-Wergenstein * Castrisch * Cauco * Cazis * Celerina/Schlarigna * Chur * Churwalden * Clugin * Conters im Prättigau * Cumbel * Cunter * Davos * Degen * Disentis/Mustér * Domat/Ems * Donat * Duvin * Falera * Fanas * Feldis/Veulden * Felsberg * Fideris * Filisur * Fläsch * Flerden * Flims * Flond * Ftan * Fuldera * Furna * Fürstenau * Grono * Grüsch * Guarda * Haldenstein * Hinterrhein * Igis * Ilanz * Innerferrera * Jenaz * Jenins * Klosters-Serneus * Küblis * La Punt-Chamues-ch * Laax * Ladir * Langwies * Lantsch/Lenz * Lavin * Leggia * Lohn * Lostallo * Lü * Lüen * Lumbrein * Luven * Luzein * Madulain * Maienfeld * Maladers * Malans * Malix * Marmorera * Masein * Mastrils * Mathon * Medel (Lucmagn) * Mesocco * Molinis * Mon * Morissen * Mulegns * Müstair * Mutten * Nufenen * Obersaxen * Pagig * Parpan * Paspels * Peist * Pignia * Pigniu * Pitasch * Pontresina * Portein * Poschiavo * Praden * Pratval * Präz * Ramosch * Rhäzüns * Riein * Riom-Parsonz * Rodels * Rongellen * Rossa * Rothenbrunnen * Roveredo * Rueun * Ruschein * Saas * Safien * Sagogn * Salouf * Samedan * Samnaun * San Vittore * Santa Maria in Calanca * Santa Maria Val Müstair * Sarn * Savognin * Says * S-chanf * Scharans * Scheid * Schiers * Schlans * Schluein * Schmitten * Schnaus * Scuol * Seewis im Prättigau * Selma * Sent * Sevgein * Siat * Sils im Domleschg * Sils im Engadin/Segl * Silvaplana * Soazza * Soglio * Splügen * St. Antönien * St. Martin * St. Moritz * St. Peter * Stampa * Stierva * Sufers * Sumvitg * Sur * Suraua * Surava * Surcuolm * Susch * Tamins * Tarasp * Tartar * Tenna * Thusis * Tiefencastel * Tinizong-Rona * Trans * Trimmis * Trin * Trun * Tschappina * Tschiertschen * Tschierv * Tschlin * Tujetsch * Tumegl/Tomils * Untervaz * Urmein * Valchava * Valendas * Vals * Valzeina * Vaz/Obervaz * Vella * Verdabbio * Versam * Vicosoprano * Vignogn * Vrin * Waltensburg/Vuorz * Wiesen * Zernez * Zillis-Reischen * Zizers * Zuoz ==Notes== ==References== ==Other websites== * Official Page * Official Statistics * Official Tourism Board for Switzerland Holidays in Graubünden",
 "title": "Graubünden"
}