{
 "id": "78874",
 "text": "{{Infobox settlement | name = Jura | official_name = Republic and Canton of Jura | settlement_type = Canton | image_flag = Flag of Canton of Jura.svg | image_shield = Wappen Jura matt.svg | shield_size = 80x80px | shield_link = | anthem = La Nouvelle Rauracienne | image_map = | map_alt = Map of Switzerland, location of Jura highlighted | map_caption = Location in Switzerland | coordinates = | seat_type = Capital | seat = Delémont | parts_type = Subdivisions | parts_style = para | p1 = 64 municipalities | p2 = 3 districts | leader_title = Executive | leader_name = Gouvernement (5) | leader_title1 = Legislative | leader_name1 = Parlement (60) | area_footnotes = | area_total_km2 = | population_footnotes = | population_total = | population_as_of = | population_density_km2 = auto | iso_code = CH-JU | blank_name_sec1 = Highest point | blank_info_sec1 = : Mont Raimeux | blank1_name_sec1 = Lowest point | blank1_info_sec1 = : Allaine at Boncourt | blank_name_sec2 = Joined | blank_info_sec2 = 1979 | blank1_name_sec2 = Languages | blank1_info_sec2 = French | website = }} The canton of Jura is one of the Cantons of Switzerland. It is the newest of the 26 Swiss cantons and is in the northwestern part of Switzerland. It was created in 1979 from some of the French-speaking parts of the Canton of Bern. The capital is Delémont. It borders the cantons of Basel-Landschaft, Solothurn, Bern and Neuchâtel and the French department of Jura. == Geography == It includes parts of the Jura mountains in the south and the Jura plateau in the north. The Jura plateau is hilly and almost entirely limestone. To the north and the west of Jura is France. The canton of Solothurn and Basel-Landschaft are east of Jura, while the canton of Bern is south of Jura. The River Doubs and the river Birs drain the lands. == History == The king of Burgundy donated much of the land that today makes up Canton Jura to the Bishop of Basel in 999. The area was a sovereign state within the Holy Roman Empire for more than 800 years. After the Treaty of Westphalia in 1648 the Jura had close ties with the Swiss Confederation. In the Congress of Vienna the Jura was given to the Canton Bern. This act caused dissension. The Jura was French-speaking and Roman Catholic, whereas the canton of Bern was mostly German-speaking and Protestant. The people of the Jura region called for independence. After a long struggle, a constitution was accepted in 1977. In 1978 the split was made official when the Swiss people voted in favour of it, and in 1979 the Jura joined the Swiss Confederation as a full member. However, the southern part of the Jura region, which is also predominantly French-speaking but has a Protestant majority, opted not to join the newly formed canton, and instead remained part of Bern. This area is now known as Bernese Jura. The word Jura, therefore, may refer either to Canton Jura, or to the combined territory of Canton Jura and Bernese Jura. On creation, the canton adopted the title Republic and Canton of the Jura. Other cantons in Switzerland using the title \"Republic and Canton\" are Ticino, Canton Geneva, and Canton Neuchâtel. In each case the title asserts the autonomy of the canton and its nominal sovereignty within the Swiss Confederation. == Economy == Agriculture is important in Canton Jura. Cattle breeding is significant and there is also horse breeding. The main industries are watches, clothing and tobacco. There are a growing number of small and middle-sized businesses. == People == The people are almost all French-speaking. The majority is Roman Catholic. == Districts == Jura is divided into 3 districts: * Delémont - capital: Delémont * Porrentruy - capital: Porrentruy * Franches-Montagnes - capital: Saignelégier == Municipalities == This is a list of the canton's 83 municipalities by district. === Porrentruy === * Alle * Asuel * Beurnevésin * Boncourt * Bonfol * Bressaucourt * Buix * Bure * Charmoille * Chevenez * Coeuve * Cornol * Courchavon * Courgenay * Courtedoux * Courtemaîche * Damphreux * Damvant * Fahy * Fontenais * Fregiécourt * Grandfontaine * Lugnez * Miécourt * Montenol * Montignez * Montmelon * Ocourt * Pleujouse * Porrentruy * Réclère * Roche-d'Or * Rocourt * Saint-Ursanne * Seleute * Vendlincourt === Delémont === * Bassecourt * Boécourt * Bourrignon * Châtillon * Corban * Courchapoix * Courfaivre * Courrendlin * Courroux * Courtételle * Delémont * Develier * Ederswiler * Glovelier * Mervelier * Mettembert * Montsevelier * Movelier * Pleigne * Rebeuvelier * Rossemaison * Saulcy * Soulce * Soyhières * Undervelier * Vellerat * Vermes * Vicques === Franches-Montagnes === * Le Bémont * Les Bois * Les Breuleux * La Chaux-des-Breuleux * Les Enfers * Epauvillers * Epiquerez * Les Genevez * Goumois * Lajoux * Montfaucon * Montfavergier * Muriaux * Le Noirmont * Le Peuchapatte * Les Pommerats * Saignelégier * Saint-Brais * Soubey ==Related pages== * French language == Further reading == * Ganguillet, Gilbert: Le conflit jurassien. Un cas de mobilisation ethno-régionale en Suisse, Zürich 1986. * Harder, Hans-Joachim: Der Kanton Jura. Ursachen und Schritte zur Lösung eines Schweizer Minderheitenproblems, Frankfurt am Main 1978. * Hauser, Claude: Aux origines intellectuelles de la Question jurassienne. Culture et politique entre la France et la Suisse romande (1910-1950), Diss. Fribourg 1997. * Henecka, Hans Peter: Die jurassischen Separatisten. Eine Studie zur Soziologie des ethnischen Konflikts und der sozialen Bewegung, Meisenheim am Glan 1972. * Jenkins, John R.G.: Jura Separatism in Switzerland, Oxford 1986. * Ruch, Christian: Struktur und Strukturwandel des jurassischen Separatismus zwischen 1974 und 1994, Bern 2001. * Schwander, Marcel: Jura. Konfliktstoff für Jahrzehnte, Zürich/Köln 1977. * Steppacher, Burkard: Die Jurafrage in der Schweiz, München 1985. == References == == Other websites == * Republic and Canton of Jura official site * Jura Tourism * Official Statistics",
 "title": "Canton of Jura"
}