{
 "id": "788895",
 "text": "The Yangtze giant soft-shell turtle, Hoan Kiem turtle or Red River giant soft- shell turtle (Rafetus swinhoei) is a turtle that lives in Asia. Very few of these turtles are alive today: Human beings know about only four. It is one of the most endangered animals in the world. What was the last known female Yangtze giant soft-shell turtle died in a Suzhou zoo in China in 2019. Another female was found in Vietnam in October 2020. Scientists tested her DNA and then put her back in the lake. This leaves four turtles alive: One male turtle living in Suzhou Shangfangshan Forest Zoo, the female turtle in Dong Mo Lake in Vietnam, perhaps another one in Dong Mo Lake, and another one in Xuan Khanh Lake in Vietnam. Scientists don't know whether the Xuan Khanh lake turtle is male or female. Scientist Tim McCormack thinks the two lake turtles became trapped when people built dams on their rivers. Scientists say there might be more in other lakes and rivers. Some scientists have gone on boats to look for them. ==Description== This turtle is very big with a pointy noise that it can use to breathe while keeping most of its body hidden underwater. Scientists do not know much about the way it acts in the wild because there are so few left. It is the largest turtle that lives in fresh water instead of sea water. It has a long, flat body. It can weigh 150 to 220 kilograms (330 to 485 pounds). The female can lay 30 or 40 eggs at a time, more than once each year. ==Natural range== The Yangtze giant soft-shell turtle used to live in the Red River in China and in many parts of Vietnam in the flood plain from the Yangtze River. It became endangered because humans built roads, buildings and dams where the turtle likes to live and because of pollution. It also became endangered because people would catch the turtle to eat it and its eggs and to sell turtles as pets. Illegal hunters also catch the turtle to sell its body parts as ingredients for traditional Chinese medicine. ==Mythology and legends== In Vietnamese culture, the Yangtze giant soft-shell turtle stands for Kim Qui, the Great Turtle God. In the story, the Dragon King gave a special sword called Heaven's Will to a Vietnamese hero. The hero was Emperor Lê Lợi. Emperor Lê Lợi used Heaven's Will to free Vietnam from the Chinese. Then Emperor Lê Lợi had to give Heaven's Will back to the Dragon King. He gave it to Kim Qui to give to him. ==Conservation efforts== In 2007, scientists found a female Yangtze giant soft-shell turtle in a zoo in Changsha. The turtle had been there for more than fifty years, before Yangtze giant soft- shell turtles became rare. The people in the zoo knew she was a large, female turtle but not that she had become one of the rarest on Earth. The deputy director of the zoo was attending a conference about tigers and went to the speech about turtles for fun. He saw they were talking about the same kind of turtle as the one in his zoo. The people in Changsha knew they had a large turtle in their zoo, but they didn't know it was a Yangtze giant soft-shell turtle. A circus performer had sold her to the zoo in the 1950s. They gave her raw meat to eat. The raw meat kept her body healthy, but it was not good for eggs. She laid eggs every year, but they never hatched. This was because no male turtle had fertilized them. It was also because she needed to eat foods with more calcium. Raw meat did not have enough. When people heard the Changsha turtle was a female Yangtze giant soft-shell turtle, they did not bring her to Suzhou right away. Both cities wanted the other turtle brought to them. They did not want to send their turtle to another city. Turtles are important symbols of living a long time in China, so the people of Changsha did not want to give her away. After a long time, the two zoos agreed. The female would come to Changsha and that they would share the baby turtles. In 2008, people moved the female turtle from the Changsha Zoo to Suzhou Shangfangshan Forest Zoo. The first year, the female turtle laid many eggs, and about half of them were fertilized. None hatched. Some of the eggs had very thin shells. The zookeepers saw there was not enough calcium in the food the turtle was eating. They fed her different foods with more calcium. Then they saw that visitors to the zoo were throwing food and garbage into the turtle's lake. They did this even though there were big signs saying not to. The other problem was that the male turtle's penis was not good. Years earlier, he had fought with another turtle. His penis was damaged, so he could not have sex very well. Starting in 2015, the zookeepers collected the male turtle's male reproductive liquid and placed it inside the female using medical tools. Again, the female turtle laid eggs, but none hatched. The scientists tried something different every year. In 2019, the female turtle died because she did not wake up from the medicine the zookeepers gave her to make her sleep during the medical process. The zookeepers cut out and froze tissue from her female reproductive organs. ==References== Category:Turtles of Asia",
 "title": "Yangtze giant soft-shell turtle"
}