{
 "id": "78896",
 "text": "Billboard charts are charts published by Billboard magazine. They have information about the popularity of music songs, bands and singers. The Billboard Hot 100 and Billboard 200 are the most important charts. They show the popularity of songs and albums for each week respectively. ==Songs== ===All-genre=== title of the chart Chart type number of sales Billboard Hot 100 sales + airplay 100 * Ranks the top 100 songs currently playing on radio stations. Bubbling Under Hot 100 Singles sales + airplay 25 * Ranks the top 25 songs below #100 that have not yet appeared on the Hot 100. * It is a 25-position table just below the Hot 100. This means that it ranks the 25 songs that are above the 100th position from the Hot 100. * A song cannot appear on the Bubbling Under chart if it has been on the Hot 100. Heatseekers Songs sales + airplay 25 * Ranks songs from new artists/bands that have never reached the top 50 of the Hot 100. * If a song reaches the top 50, it and any of the artist's/band's other singles cannot chart on the Heatseekers. Hot 100 Airplay airplay (audience) 75 * Measures radio airplay on 1,233 radio stations. Hot Singles Sales physical sales 50 * Measures sales of CD singles * It is not a recurrent chart. Hot Digital Songs digital sales 75 * Ranks top- selling digital song sales Hot Digital Tracks digital sales 75 * Ranks digital song sales with different versions of songs listed (remix, radio edits, alternative versions) * No recurrent chart ===R&B;/Hip-Hop=== Chart Title Description Hot R&B;/Hip-Hop Songs The Hot R&B;/Hip-Hop Songs lists the most popular song from Urban AC and R&B;/Hip-Hop stations and record sales from Urban stores. Hot R&B;/Hip-Hop Airplay The Hot R&B;/Hip-Hop Airplay measures airplay on R&B;/Hip-Hop stations. Mainstream R&B;/Hip-Hop The Mainstream R&B;/Hip-Hop ranks songs by counting airplay base on radio plays (spins) from 76 R&B;/Hip-Hop Stations. Hot Adult R&B; Airplay The Hot Adult R&B; Airplay measures airplay from 65 Urban AC radio stations. Hot R&B;/Hip-Hop Singles Sales The Hot R&B;/Hip-Hop Singles Sales is the sales version of the Hot R&B;/Hip-Hop Songs. Bubbling Under R&B;/Hip-Hop Singles The Bubbling Under R&B;/Hip-Hop Singles ranks the top 25 singles that are above the 100 number. Rhythmic Top 40 Measures airplay spins on 72 rhythmic stations. Rhythmic is a music radio format that includes of a mix of dance, upbeat rhythmic pop, hip hop and R&B; hits. These stations also contribute to Dance/Mix Show Airplay. Hot Rap Songs The Hot Rap Songs ranks the top 25 Hip-Hop/Rap songs. Hot R&B;/Hip-Hop Recurrents The Hot R&B;/Hip-Hop Songs ranks songs that have fallen below #50 on the Hot R&B;/Hip-Hop Songs and have been on that chart for over 20 weeks. Hot R&B;/Hip-Hop Recurrent Airplay The Hot R&B;/Hip-Hop Recurrent Airplay ranks the songs that have fallen below #25 on the Hot R&B;/Hip-Hop Airplay and have been on that chart for over 20 weeks. ===Adult/Pop=== Chart Title Chart type Number of positions Description Top 40 Mainstream airplay (spins) 40 * Measures airplay (spins) on 141 Contemporary hit radio stations. These stations also contribute to the Dance/Mix Show Airplay panel Adult Top 40 airplay (spins) 40 * Measures airplay spins on 90 Hot adult contemporary stations. Adult Contemporary airplay (spins) 30 * Measures airplay spins on 85 adult contemporary stations ===Country=== Chart Title Chart type Number of positions Description Hot Country Songs airplay (audience) 60 * Measures airplay (spins) on 126 country music stations. ===Rock=== Chart Title Chart type Number of positions Description Rock Songs airplay (audience) 50 * Measures airplay (spins) on 180 radio stations. Only mainstream rock, alternative, active rock, heritage rock, and Triple A stations are measured. Hot Mainstream Rock Tracks airplay (spins) 40 * Measures airplay spins on mainstream rock radio stations, a category that includes stations that play primarily rock music but are not modern rock (i.e., alternative). Alternative Songs airplay (spins) 40 * Measures airplay spins on alternative or \"modern rock\" stations Active Rock airplay (spins) 40 * Measures airplay spins on 57 active rock radio stations, which plays current rock artists with a mix of classic rock songs Heritage Rock airplay (spins) 30 * Measures airplay spins on 22 heritage rock radio stations Triple A airplay (spins) 30 * Measures airplay spins on Adult album alternative (also known as \"Triple A\") radio, most of which are alternative rock songs that are towards an older audience ===Dance=== Chart Title Chart type Number of positions Hot Dance Club Songs reports from DJs 50 Dance/Mix Show Airplay Continuous airplay (Spins from exclusive reporters) Mix show airplay (Spins from Mainstream and Rhythmic stations) 25 Hot Dance Singles Sales 10 Hot Dance/Electronic Digital Songs 50 ===Latin=== Billboard Chart Title Hot Latin Songs Latin Pop Airplay Latin Regional Mexican Airplay Latin Tropical Airplay Latin Rhythm Airplay ===Christian=== Chart Title Chart type Number of positions Christian Songs airplay (audience) 50 Hot Christian AC Songs airplay (spins) 30 Hot Gospel Songs airplay (spins) 30 ===Jazz=== Chart Title Chart type Number of positions Description Smooth Jazz Songs airplay (spins) 30 * Measures airplay spins on 14 smooth jazz stations ===Ringtones=== Chart Title Chart type Number of positions Hot Ringtones ringtone sale 40 Hot RingMasters ringtone sale 40 Hot Videoclips 25 ===Canadian charts=== Chart Title Chart type Number of positions Description Canadian Hot 100 airplay + sales 100 Emerging Canadian Artist airplay + sales 30 Hot Digital Song digital sales 75 Hot 100 Airplay airplay (audience) 75 All-format Airplay airplay (spins) 50 CHR/Top 40 Airplay airplay (spins) 50 AC Airplay airplay (spins) 50 * Measures radio airplay spins on 28 AC radio stations Hot AC Airplay airplay (spins) 50 * Measures radio airplay spins on 24 Hot AC radio stations Country Airplay airplay (spins) 50 * Measures radio airplay spins on 31 country radio stations. Rock Airplay airplay (spins) 50 * Measures radio airplay spins on 29 rock radio stations ===International charts=== Billboard Chart Title Description Brasil Hot 100 Airplay The Brazil Hot 100 Airplay ranks the most listened singles and tracks in Brazil. Euro Digital Songs The chart ranks the best selling digital singles and tracks in Europe. European Hot 100 Singles The Eurochart Hot 100 Singles ranks the best selling singles in Europe by counting sales from various countries in Europe. Global Dance Tracks Global Dance Tracks is a weekly international survey of the songs that are most popular in dance clubs globally. It is made by Billboard exclusively from playlists submitted by nightclub disc jockeys who must apply and meet certain criteria to become Billboard-reporting DJs. Japan Hot 100 The Japan Hot 100 ranks the best selling singles and tracks in Japan. Korea K-Pop Hot 100 The Korea K-Pop Hot 100 ranks the best selling singles and tracks in South Korea. Luxembourg Digital Songs The chart ranks the best selling digital singles and tracks in Luxembourg. ===Discontinued charts=== Chart Title Discontinued date Description Country Singles Sales 2005 Pop 100 June 13, 2009 * Ranked songs by combining airplay focused on pop radio and sales * The chart's importance is replaced by the Top 40 Mainstream chart Pop 100 Airplay June 13, 2009 ==Albums== Chart Title Number of positions Description Billboard 200 200 * Includes both new and catalog albums. Top Current Albums 200 * The same chart as Billboard 200, with catalog titles removed Top Pop Catalog Albums 50 * An album becomes a catalog title when it is more than 18 months old and has fallen below position 100 on the Billboard 200. Top Internet Albums 40 Tastemakers Top Digital Albums 50 Heatseekers Albums 50 * Ranks albums from new artists/bands that have never attained the top 100 of Billboard 200. * If an album reaches the top 100, it and any of the artist's/band's subsequent singles cannot be on the chart. Heatseekers Albums (East North Central) Heatseekers Albums (Middle Atlantic) Heatseekers Albums (Mountain) Heatseekers Albums (Northeast) Heatseekers Albums (Pacific) Heatseekers Albums (South Atlantic) Heatseekers Albums (South Central) Heatseekers Albums (West North Central) Top Independent Albums 50 * Ranks top 50 albums released through independent record labels. Top Rock Albums 25 Top Alternative Albums Top Hard Rock Albums 20 Top Folk Albums 15 Top R&B;/Hip-Hop Albums 100 Top R&B;/Hip-Hop Catalog Albums 100 Top Rap Albums 30 Top Country Albums 75 Top Country Catalog Albums 75 Top Bluegrass Albums 15 Top Latin Albums 30 Regional Mexican Albums Latin Pop Albums 30 Tropical Albums Latin Rhythm Albums Top Classical Albums * Traditional Classical albums Top Classical Crossover Albums Classical Albums * Available only on billboard.com Top Classical Budget Albums Top Classical Midline Albums Top Christian Albums 50 Top Gospel Albums 40 Top Christian & Gospel Albums Top Jazz Albums * Traditional Jazz albums Top Contemporary Jazz Jazz Albums 35 * Available only on billboard.com Top Dance/Electronic Albums 25 Top Blues Albums Top Cast Albums * Measuring sales of cast recordings Top Comedy Albums Top Compilation Albums 20 Top Holiday Albums 50 * see Best-selling Christmas/holiday albums in the United States Top Kid Audio 15 Top New Age Albums Top Reggae Albums Top Soundtracks 30 Top World Albums * Ranks biggest- selling world music albums, including catalog titles ==References==",
 "title": "Billboard charts"
}