{
 "id": "789137",
 "text": "The languages of South Asia include a few major language families: * Indo- Iranian languages, a branch of the Indo-European language family, which can be further divided into three groups: ** Indo-Aryan languages, the most widespread. ** Iranic languages, in Pakistan and Afghanistan. ** Nuristani languages, in a small area of Afghanistan and Pakistan. * Dravidian languages, in South India and Sri Lanka. * Tibeto-Burman languages, a branch of the Sino- Tibetan language family, along the northern and eastern edges. * Austroasiatic languages, in small areas of India. * There are also some people who speak Kra-Dai languages, and some language isolates such as Burushaski, which are not known to be related to any other languages. South Asia includes India, Pakistan, Bangladesh, Sri Lanka, Nepal, Bhutan, the Maldives, and sometimes Afghanistan. __TOC__ == Indo-Aryan languages == Most Indo-Aryan languages grew from Sanskrit, an ancient language. It is hard to decide to define what is a language, and what is just a dialect (language variant). For example, Hindi and Urdu are similar when spoken, but Hindi is written in the Devanagari script and Urdu is written in the Persian-Arabic script. Hindi uses more words from Sanskrit, while Urdu uses more words from Persian and Arabic. Language Number of people who speak this language Places where people speak this language Hindi 615,500,000 North India (Bihar, Chhattisgarh, Delhi, Haryana, Jharkhand, Madhya Pradesh, Rajasthan, Uttar Pradesh, Uttarakhand) Bengali 265,000,000 Bangladesh, West Bengal, Tripura Urdu 170,200,000 Pakistan, parts of India (Uttar Pradesh, Delhi, Kashmir, Madhya Pradesh) Marathi 95,300,000 Maharashtra Panjabi 154,500,000 United Panjab (Pak Panjab,Ind Panjab, Haryana, Himachal,Chandigarh, Delhi and Hazara divison of present day Kyber Paktunistan Gujarati 60,600,000 Gujarat Bhojpuri 52,400,000 western Bihar, eastern Uttar Pradesh, Nepal Odia 38,000,000 Odisha Maithili 34,000,000 eastern Bihar, eastern Jharkhand, Nepal Sindhi 32,600,000 Sindh, Balochistan, northern Gujarat Nepali 24,500,000 Nepal, Sikkim, Bhutan Magahi 20,700,000 southern Bihar, eastern Jharkhand, northern West Bengal Sinhala 17,300,000 Sri Lanka Chhattisgarhi 16,300,000 Chhattisgarh Assamese 15,300,000 Assam Chittagonian 13,000,000 eastern Bangladesh Deccan 12,800,000 northern Karnataka Sadri 12,100,000 Jharkhand, eastern Chhattisgarh, northern Odisha, southern Bihar Sylheti 11,800,000 eastern Bangladesh, southern Assam == Iranic languages == Only some of the Iranic languages are from South Asia. Others are from West Asia or Central Asia. This table shows the total number of people who speak each language. Language Number of people who speak this language Places where people speak this language Pashto 40,000,000 Afghanistan, Khyber Pakhtunkhwa Dari Persian 20,500,000 Afghanistan Balochi 10,000,000 Balochistan == Nuristani languages == About 130,000 people speak the five Nuristani languages. == Dravidian languages == Language Number of people who speak this language Places where people speak this language Telugu 93,000,000 Andhra Pradesh, Telangana Tamil 81,000,000 Tamil Nadu, Sri Lanka Kannada 56,400,000 Karnataka Malayalam 37,800,000 Kerala Brahui 3,300,000 central Balochistan Gondi 3,000,000 Madhya Pradesh, Odisha, Andhra Pradesh, Maharashtra Kurukh 2,300,000 Jharkhand, Madhya Pradesh, Chhattisgarh, Odisha, West Bengal, northern Bangladesh Tulu 1,900,000 western Karnataka, northern Kerala Beary 1,700,000 western Karnataka, northern Kerala == Tibeto-Burman languages == A number of Tibeto-Burman languages are spoken in Nepal, Bhutan, Northeast India, Bangladesh, North India, and North Pakistan. == Austroasiatic languages == Most Austroasiatic languages are spoken in Southeast Asia, rather than South Asia. The Austronesian languages spoken in South Asia are part of the Munda and Khasic branches. == Kra-Dai languages == Most Kra-Dai languages are spoken in East Asia and Southeast Asia. About 10,000 people speak these languages in South Asia, in Assam and the surrounding area. == Language isolates == A language isolate is a language that is not known to be related to any other languages. There are several native languages to the Andaman Islands. Originally they were grouped into Great Andamanese, Ongan, Jangil, and Sentinelese. Today, people have stopped speaking some of these languages, making them extinct. The Burushaski language is spoken by about 100,000 people in North Pakistan. The Kusunda language is spoken by less than 100 people in Nepal. The Nihali language is spoken by 2,000 or so people in Madhya Pradesh and Maharashtra. All of these are considered language isolates. == Related pages == * Languages of India == References == Category:South Asia Category:Languages of Asia",
 "title": "Languages of South Asia"
}