{
 "id": "78999",
 "text": "A Coaxial cable is a special electrical cable. It is used to transmit signals. The cable is specially insulated. This makes it quite stiff. Today, coaxial cables are used for things like Cable TV. Coaxial cables can also be used for computer networks, but this became rare in the 21st century, as twisted pair cables can be used more easily. Such cables are usually made of a conducting wire. Then there is some insulation, then there is another layer of conducting material. Finally there is the (insulating) mantle. Such cables are used as a high-frequency transmission line to carry a high-frequency or broadband signal. Because the electromagnetic field carrying the signal exists (ideally) only in the space between the inner and outer conductors, it cannot interfere with or suffer interference from external electromagnetic fields. There are different types of coaxial cables, which satisfy different standards. == Timeline == *1880 — Coaxial cable patented in England by Oliver Heaviside, patent no. 1,407.Google Book Search - Oliver Heaviside By Paul J. Nahin *1884 — Siemens & Halske patent coaxial cable in Germany (Patent No. 28,978, 27 March 1884). *1894 — Oliver Lodge demonstrates waveguide transmission at the Royal Institution. *1929 — First modern coaxial cable patented by Lloyd Espenschied and Herman Affel of AT&T;'s Bell Telephone Laboratories. *1936 — First closed circuit transmission of TV pictures on coaxial cable, from the 1936 Summer Olympics in Berlin to Leipzig.earlytelevision.org - Early Electronic Television - The 1936 Berlin Olympics *1936 — World's first underwater coaxial cable installed between Apollo Bay, near Melbourne, Australia, and Stanley, Tasmania. The 300 km cable can carry one 8.5-kHz broadcast channel and seven telephone channels.The worldwide history of telecommunications By Anton A. Huurdeman - Copper-Line Transmission *1936 — AT&T; installs experimental coaxial telephone and television cable between New York and Philadelphia, with automatic booster stations every ten miles. Completed in December, it can transmit 240 telephone calls simultaneously.\"Coaxial Debut ,\" Time, Dec. 14, 1936.Boing Boing - Gallery: An illustrated history of the transoceanic cable *1936 — Coaxial cable laid by the General Post Office (now BT) between London and Birmingham, providing 40 telephone channels.Google books - Broadcast engineer's reference book By Edwin Paul J. TozerRadio-electronics.com - Coaxial feeder or RF coax cable *1941 — First commercial use in USA by AT&T, between Minneapolis, Minnesota and Stevens Point, Wisconsin. L1 system with capacity of one TV channel or 480 telephone circuits. *1956 — First transatlantic coaxial cable laid, TAT-1.Atlantic-cable.com - 1956 TAT-1 Silver Commemorative DishGoogle books - The worldwide history of telecommunications By Anton A. Huurdeman == References == == Other websites == * Coaxial Cable Specifications * What does \"RG-6\" mean? * Coaxial Cable FAQ Wire Guide * Coaxial Cable Selection Guide * Is There an Ideal Impedance? — Wired for Sound: Steve Lampen Category:Signalling",
 "title": "Coaxial cable"
}