{
 "id": "78990",
 "text": "Morris Gleitzman (born 9 January 1953 in England) is one of Australia's most successful children's writers. Morris Gleitzman began writing as a screenwriter and enjoyed success writing for the Norman Gunston Show on Australian television. He has also written for the Governor-General of Australia and Rolf Harris. == Career == Morris Gleitzman has had much success with his children's stories. They have been published in 14 countries around the world including the United States, United Kingdom, France and Australia. Some of his most successful books include Misery Guts, Worry Warts, Blabber Mouth, Belly Flop and Puppy Fat. He was born in England, on 9 January 1953. He had dropped out of school by the age of 16 to live \"the hippie dream\" and by the time he had moved to Australia was writing many short stories that would later become a reality and turn his small life into a big meaningful life. His most successful book is Two Weeks With the Queen. ==Bibliography== ===Books=== Year Title Imprint ISBN Notes 1987 The Other Facts of Life Penguin Books First novel, adapted from screenplay. 1989 Two Weeks with the Queen Pan Books 1990 Second childhood McPhee Gribble/Penguin 1991 Misery Guts Pan Australia 1992 Worry Warts Piper Australia Sequel to Misery Guts. 1993 Blabber Mouth Adapted into a play of the same name by Mary Morris in 1996. 1994 Sticky Beak Sequel to Blabber Mouth. 1995 Puppy Fat Piper Sequel to Misery Guts and Worry Warts. 1996 Belly Flop Pan Books 1997 Water Wings Pan Macmillan Australia Loose sequel to Belly Flop. 1998 Bumface Puffin Books Wicked! Co-written with Paul Jennings. 1999 Gift of the Gab Sequel to Blabber Mouth and Sticky Beak. 2000 Toad Rage Self Helpless: 57 Pieces of Crucial Advice for People Who Need a Bit More Time to Get It Right Penguin 2001 Adults Only Deadly Puffin Books Co- written with Paul Jennings. Toad Heaven Sequel to Toad Rage. 2002 Boy Overboard 2003 Teacher's Pet Penguin Books Toad Away Puffin Books Sequel to Toad Rage and Toad Heaven. 2004 Worm Story Penguin Books Girl Underground Puffin Books Sequel to Boy Overboard. 2005 Once \"...Gleitzman delivers a sharp sense of what it must have been like to be a child during the Holocaust, forced to grow up far too quickly.\" 2006 Aristotle's Nostril Penguin Books Doubting Thomas Puffin Books 2007 Give Peas a Chance Collection of short stories. Features characters from Misery Guts, Blabber Mouth, Second Childhood, Belly Flop, Adults Only, Teacher's Pet, Worm Story and Aristotle's Nostril. 2008 Toad Surprise Sequel to Toad Rage, Toad Heaven and Toad Away. Then Penguin Sequel to Once. 2009 Grace Viking 2010 Now Sequel to Once and Then \"Readers of the first two books will recognize a great deal, and those who have not should read them to gain a fuller picture of the years before and those in which we live.\" Tickled Onions and Other Funny Stories Puffin Books Collection of short stories. Contains some stories from Give Peas a Chance. 2011 Too Small to Fail Pizza Cake: And Other Funny Stories Collection of short stories. Contains some stories from Tickled Onions. 2012 After Penguin Books Sequel to Once, Then and Now. 2013 Extra Time 2014 Loyal Creatures 2015 Soon Viking Sequel to Once, Then, Now and After. 2016 Toad Delight Penguin Random House Sequel to Toad Rage, Toad Heaven, Toad Away and Toad Surprise. Snot Chocolate Collection of short stories. 2017 Maybe Sequel to Once, Then, Now, After and Soon 2018 Funny Stories: and Other Funny Stories Puffin Books Collection of short stories. Contains all stories from Give Peas A Chance, Pizza Cake and Snot Chocolate, plus one new story. Help Around the House 2021 Always Viking Sequel to Once, Then, Now, After, Soon and Maybe. ==Awards== *1993 **BILBY Award (Blabber Mouth)Morris Gleitzman, AustLit **CROW Award (Blabber Mouth) *1994 **CROW Award (Sticky Beak) *1997 **COOL Award (Belly Flop) *1998 **BILBY Award (Bumface) **COOL Award (Bumface) **KOALA Award (Bumface) **YABBA Award (Bumface) * 2001 **YABBA Award: Older Readers (Toad Rage) *2008 **ANTO Cole Award (Toad Rage) *2013 **COOL Award (Pizza Cake) *2016 **Children's Book Council of Australia Book of the Year: Younger Readers (Soon)Book of the Year – Winners 2016 , Children's Book Council of Australia == References == == Other websites == * Official website Category:1953 births Category:Living people Category:Australian children's writers Category:Australian television writers Category:Writers from Lincolnshire",
 "title": "Morris Gleitzman"
}