{
 "id": "790173",
 "text": "The eastern racer (Coluber constrictor) is a type of nonvenomous snake in the family Colubridae. It only lives in North America and Central America. == Description == Eastern racers usually grow up to 50 to 152 cm (20 to 60 in) in length. They usually weigh around 556 g (1.226 lb). Its color can range from black, bluish, gray, to olive brown. == Distribution and Habitat == It is found throughout the United States, east of the Rocky Mountains. It is also found north into Canada and south into Mexico, Guatemala, and Belize. It is usually found near water, but it can also be found in bushes, trash piles, roadsides, and swamps. It spends most of its time on the ground. But, it is a good climber. It may be found in shrubs and trees where there are bird nests. Most of the eastern racers like open, grassland habitats where their eyesight and speed can be used. They are usually not far from a place to hide. == Feeding == They mainly eat small rodents, frogs, toads, lizards, and other snakes. Some subspecies are known to climb trees to eat eggs and young birds. Young eastern racers usually insects with soft bodies, such as crickets and moths. They overcome moving prey by wrapping into one or two coils pressing its prey to hold it so that it can swallow it alive. == Behaviour == The eastern racers are fast, very active, diurnal snakes. Eastern racers are curious snakes. They have very good vision. They are sometimes seen raising their heads above the grass where they are crawling to see what is around them. They usually run away from a predator. They are hard to hold and will poop, and release a bad smelling liquid from their cloacae. == Reproduction == It mates in the spring from April until early June. The female lays three to 30 eggs in a hidden nest, such as a hollow log, an abandoned rodent burrow, or under a rock. The young ones hatch in the early fall. They reach maturity when they are around 2 years old. ==References== Category:Colubrids Category:Snakes of North America",
 "title": "Eastern racer"
}