{
 "id": "790209",
 "text": "Ignatius Sancho was an African born around 1729 on a slave ship. Towards the end of his extraordinary life, he became a British citizen and was eligible to vote in the parliamentary election of 1774, and then again in 1780. The details of his early life are not certain. He was born on a slave ship crossing the Atlantic. The ship went to the Spanish colonies in Central America. His parents did not survive long, and he became orphaned. His owner took him to London, and he eventually came to live with John Montague, 2nd Duke of Montagu and Mary, Duchess of Montagu. Sancho worked as her butler until her death in 1751. While living at Montague House in Blackheath, he educated himself. He enjoyed music, poetry, reading, and writing. During the 1760s Sancho married a West Indian woman, Anne Osborne. He became a devoted husband and father. They had seven children. Around the time their third child was born, Sancho became a valet to George Montagu, 1st Duke of Montagu (of the second creation), the son-in-law of his earlier patron. He remained there until 1773. In 1768 Thomas Gainsborough painted a portrait of Sancho at the same time as the Duchess of Montagu sat for her portrait by the artist.King, Reyahn 1997. Ignatius Sancho: an African Man of Letters. London, UK: National Portrait Gallery. ISBN 9781855141926 In 1774, with Montague's help, he became a shopkeeper in Mayfair. He sold tobacco, sugar and tea, all of which were connected with the slave trade. As a male householder living in Mayfair, he was eligible to vote. He also wrote letters in newspapers, under his own name and under the pseudonym \"Africanus\". He supported the monarchy and British forces in the American Revolutionary War.Letters of the Late Ignatius Sancho, An African. In Two Volumes. To Which Are Prefixed, Memoirs of His Life. London: Printed by J. Nichols, 1782. Sancho had many well-known visitors at his shop, including statesman and abolitionist Charles James Fox PC (1749–1806). Fox steered a resolution through Parliament pledging it to abolish the slave trade. A Foreign Slave Trade Bill in Spring 1806 prohibited British subjects from contributing to the trading of slaves with the colonies of Britain's wartime enemies. This cut out two-thirds of the slave trade passing through British ports. == References == Category:1729 births Category:1780 deaths Category:Black British musicians Category:British abolitionists Category:British composers Category:Writers from London Category:Slaves",
 "title": "Ignatius Sancho"
}