{
 "id": "790280",
 "text": "\"Jihadism\" (also \"jihadist movement\", \"jihadi movement\" and variants) is a 21st-century neologism found in Western languages to describe Islamist militant movements seen by the military to be \"rooted in Islam\" and a threat to the West.Compare: The term \"jihadism\" has been used since the 1990s. It was first used by Indian and Pakistani media, as well as French scholars, who used the more precise term \"Salafi jihadism (or jihadist Salafism) \". French political scientist and orientalist Gilles Kepel identified a special Salafist form of jihadism in the 1990s. Western journalists adopted it in the aftermath of the September 11 attacks of 2001. A distinction is made between Salafi jihadism and Deobandi jihadism. Salafi jihadist organizations include: Salafia Jihadia, Al-Qaeda, ISIS, Salafi Group for Preaching and Jihad, Boko Haram, Al-Shabab, Hizbut Tahrir, Salafi Army of Abu Bakr, Salafi Army of Jaish al-Umma, Caucasus Emirate, Dawa FFM, Die Wahre Religion, Moroccan Fighting Group and others. Although the Taliban are Deobandi and not Salafi, they have worked closely with Salafi Osama bin Laden and various Salafi jihadist leaders. Gilles Kepel, Jihad: The Trail of Political Islam (Harvard: Harvard University Press, 2002) pp.219-222 == Terminology == The concept of jihad ('to strive'/'to strive') is fundamental in Islam and has many applications: the greater jihad (inner jihad) means the internal struggle against evil within oneself, while the lesser jihad (outer jihad) is divided into the jihad of the pen/tongue (debate or admonition) and the jihad of the sword. Modern Muslim scholars generally equate military jihad with defensive warfare. Most modern Muslim opinion holds that internal jihad takes precedence over external jihad in the Islamic tradition, while many Western authors hold the opposite view. To justify their terrorist acts, jihadists resort to fatwas developed by jihadist-Salafist legal authorities whose legal works are distributed via the Internet. == History == Some observers have noted a change in the rules of jihadism - from the original \"classical\" doctrine to the Salafi jihadism of the 21st century. According to histrorian Sadrat Qadri, over the last couple of centuries, gradual changes in Islamic legal doctrine (developed by Salafis who condemned any innovation (bid'ah) in religion) have \"normalized\" what was once \"unthinkable\". === Salafism and Salafi jihadism(1990 - present) === Some of the early Islamic scholars and theologians who have had a profound influence on terrorism and the ideology of modern jihadism include the medieval Salafi thinkers Ibn Taymiyyah and Muhammad ibn Abd al-Wahhab, along with modern Salafi ideologists Muhammad Rashid Rida, Sayyid Qutb, and Abul Ala Mawdudi. The term \"jihadism\" (formerly \"Salafi jihadism\" ) emerged in the 2000s to describe contemporary jihadist movements whose development can be traced in retrospect to the development of Salafism, coupled with the emergence of al-Qaeda. == Salafi jihadism == Salafism is a movement in Sunni Islam that unites Muslim religious figures who, at different periods, have called for a focus on the way of life of the righteous ancestors (salaf salihin ), qualifying as “ bid’ah ” all the latest innovations in the indicated areas, starting with methods of symbolic- allegorical interpretation of the Koran and ending with all sorts of innovations brought to the Muslim world by its contacts with the West. Salafis include, for example, Ibn Taymiyyah, Muhammad ibn Abd al-Wahhab and the ideologists of the Muslim Brotherhood association. According to the German Federal Agency for Civic Education, almost all terrorists are \"Salafis\", but not all Salafis are terrorists. The call for the establishment of a religious state in the form of a caliphate means that Salafis reject the rule of law and the sovereignty of people's power. British writer Shiraz Maher, author of Salafi Jihadism: The History of an Idea, traces the origins of this particular movement to Ibn Taymiyyah and the 18th-century theologian Muhammad ibn Abd al-Wahhab. In Western literature, the terms “ fundamentalism ”, and “ Wahhabism ” are used to characterize the Salafi ideology. They are also called \"Muslim Puritans\". === Ideologists of Salafi jihadism === The ideologists of Salafi jihadism were Arab veterans of the Afghan jihad: Abu Qatada al-Filistini, the Syrian Abu Musab, Abu Hamza al-Masri, and others. Kepel, Jihad, 2002, p.220 «Jihadist- Salafism» is introduced by Gilles Kepel, Jihad: The Trail of Political Islam (Harvard: Harvard University Press, 2002), p. 220 Mohammed Yusuf, founder of the Nigerian Salafi group Boko Haram; Omar Bakri Muhammad, Abu Bakr al- Baghdadi, leader of ISIS and others are also adherents of Salafism . ==== Osama bin Laden ==== The most famous leader of the Salafi jihadists was Osama bin Laden. Saudi dissident preachers Salman al-Awda and Safar al-Hawali were highly respected at the school. Al-Qaeda leader Ayman al-Zawahiri praised Sayyid Qutb, stating that Qutb's call became the ideological inspiration for the modern Salafi-jihadist movement. A step towards the beginning of global “ Salafi jihadism ” was the announcement on August 8, 1996 by Osama bin Laden of “War against the Americans who have occupied the land of the Two Holy Mosques ”. Other leading figures in the Salafi-jihadist movement include Anwar al- Awlaki, the former leader of al-Qaeda in the Arabian Peninsula (AQAP) ; Abu Bakar Bashir, the leader of the banned Indonesian militant group ( Jemaah Islamiyah ); Nasir al-Fahd, a Saudi Arabian Salafi-jihadist scholar who opposes the Saudi state and has reportedly pledged allegiance to ISIS . Some Salafi theologians have condemned the doctrines of Salafi jihadism as bid'ah (\"innovation\") and \"heresy\". ==== Abu Hamza al-Masri ==== Abu Hamza al-Masri is a radical Salafi jihadist al-Saleh Huda (2018). After Saudi Crown Prince’s pledge to eliminate Brotherhood, Zawahri defends them // Al Arabiya Englsh and terrorist . In 1979 he left for Great Britain . In 1987 he performed the Hajj, during which he met the founder of the Afghan Mujahideen movement, Abdullah Azzam . In 2012, the European Court of Human Rights in Strasbourg allowed the extradition of al-Masri and four other people accused of terrorism to the United States. Лондон скоро выдаст США исламиста Абу Хамзу // Би-би-си, 24 сентября 2012 Abu Hamza al-Masri was extradited to the United States on October 5, 2012. During the trial on 7 May 2014, it emerged that Abu Hamza al Masri worked for the British counterintelligence agency MI5. In January 2015, it became known that Abu Hamza was sentenced to life imprisonment. ==== Al-Baghdadi ==== Abu Bakr al-Baghdadi is a Salafi jihadist and leader of the Salafi group ISIS ==== Other Salafi ideologists ==== Other leading figures in the Salafi-jihadist movement include Anwar al-Awlaki, the former leader of al- Qaeda in the Arabian Peninsula (AQAP); Abu Bakar Bashir, the leader of the banned Indonesian militant group ( Jemaah Islamiyah ); Nasir al-Fahd, a Saudi Arabian Salafi-jihadist scholar who opposes the Saudi state and has reportedly pledged allegiance to ISIS . === Increase in the number of Salafi terrorist attacks === According to Bruce Livesey, by 2005 Salafi terrorists were spreading their influence in Europe, having attempted more than 30 terrorist attacks in EU countries from September 2001 to early 2005. === Salafi Jihadist Organizations === \" Salafi\" jihadist groups include al-Qaeda, the now-defunct Algerian Armed Islamic Group (GIA) and the Egyptian group al- Gama'a al-Islamiya. During the Algerian Civil War of 1992–98, the GIA was one of two main Salafist armed groups (the other being the Army of Islamic Salvation, or AIS) fighting the Algerian army and security forces. The remnants of the GIA continued their activities as the \"Salafi Group for Preaching and Combat\", which since 2015 has called itself \"Al-Qaeda in the Islamic Maghreb\". ==== Salafia Jihadia ==== Salafia Jihadia is a Salafi terrorist organization that was active in Morocco and Spain . Had links to al- Qaeda and the Moroccan Islamic Fighting Group . The Salafi terrorist group became widely known after the 2003 Casablanca attacks, when 12 suicide bombers killed 33 people and wounded 100. ==== Al Qaeda ==== Perhaps the most famous and effective Salafi jihadist group was al-Qaeda. Al-Qaeda evolved from Maktab al-Khidamat (MAK), or the \"Office of Services,\" a Muslim organization founded in 1984 to raise and distribute funds and recruit foreign mujahideen for the war against the Soviet Union in Afghanistan. It was founded in Peshawar, Pakistan, by Osama bin Laden and Abdullah Yousuf Azzam . When it became apparent that jihad had forced the Soviet military to abandon its mission in Afghanistan, some mujahideen called for expanding their operations to include fighting terrorists in other parts of the world, and on August 11, 1988, al-Qaeda was formed by bin Laden. Members were required to take a vow ( bayat ) to follow their leaders. Al-Qaeda emphasized jihad against the \"distant enemy,\" by which it meant the United States. In 1996, it declared a jihad to expel foreign forces and interests from territories it considered Islamic. The largest terrorist operation is considered to be the September 11 attacks against the United States. ==== Boko Haram ==== Boko Haram in Nigeria is a Salafi jihadist group that has killed tens of thousands of people and forced 2.3 million people to flee their homes. According to Mohammed M. Hafez, \"as of 2006, the two main groups in the Salafi jihadist camp\" in Iraq were the Mujahideen Shura Council and the Ansar al-Sunna group. There are also a number of small jihadist Salafi groups operating in Azerbaijan. The Two Faces of Salafism in Azerbaijan . Terrorism Focus Volume: 4 Issue: 40, December 7, 2007, by: Anar Valiyev == Deobandi jihadism == Deobandi jihadism is a militant interpretation of Islam that draws on the teachings of the Deobandi movement that originated in the Indian subcontinent in the 19th century. The Deobandi movement has experienced 3 waves of jihadism. The first wave involved the establishment of an Islamic precinct centred at Thana Bhawan by elders of the movement during the Indian Rebellion of 1857, prior to the founding of Darul Uloom Deoband . Imdadullah Muhajir Makki was the Amir al- Mu'minin of this territory. However, after the British defeated the Deoband forces at the Battle of Shamli, the territory fell. After the establishment of Darul Uloom Deoband, Mahmud Hasan Deobandi led the initiation of the second wave. He mobilized armed resistance against the British through various initiatives, including the formation of the Samratut Tarbiat. When the British discovered his \" Silk Letter Movement \", they arrested him and held him captive in Malta . After his release, he and his students became active in politics and took an active part in the democratic process. In late 1979, the Pakistan-Afghan border became the focus of the third wave of the Deobandi jihadist movement, fueled by the Soviet-Afghan War . Under the patronage of President Zia-ul-Haq (who was himself a Deobandi ), its expansion took place through various Deobandi madrassas such as Darul Uloom Haqqania and Jamia Uloom-ul-Islamia. Trained militants from the Pakistan-Afghan border participated in the Afghan jihad and later formed various Deobandi terrorist organizations, including the Taliban . The most successful example of Deobandi jihadism is the Taliban movement, which established Sharia law in Afghanistan. The head of Jamiat Ulema-e-Islam, Sami-ul-Haq, is called the \"father of the Taliban\". === Deobandi and terrorism === Mahmud Hasan Deobandi, the first student of Darul Uloom Deoband, later became its headmaster and actively incited armed rebellion through his students. Having been appointed as a teacher at Darul Uloom Deoband, he founded Samratut Tarbiat in 1878. In Pakistan, the majority of the population follows the Deobandi sect, as a result of which most of the madrassas have joined this sect. The Deobandi terrorist organization \" Taliban \" was formed in Afghanistan in the mid-1990s. The founder of the Taliban movement was Mullah Omar, a former mujahideen who lost an eye during the war with the Soviet Union. In 1994, he gathered a group of students and religious scholars, many of whom had been educated in Deobandi madrassas located in Khyber Pakhtunkhwa and Balochistan, and founded the Taliban as a militant Deobandi movement. == See also == * Salafism ** Salafi Jihadism ** Wahhabism * Hindu terrorism == References == Category:Islamic organizations Category:Islamism Category:Terrorism Category:Islamic terrorism",
 "title": "Jihadism"
}