{
 "id": "790460",
 "text": "Giannina Braschi (San Juan, Puerto Rico, 5 February 1953) is a Puerto Rican poet, novelist, and scholar. Her best-known books are Empire of Dreams, Yo-Yo Boing!, and United States of Banana. == Life == Giannina Braschi was a model, singer, and tennis champion in her childhood. Her family imported cars to Puerto Rico. She studied literature and philosophy in Madrid, Rome, London, Paris, and New York. She has a Ph.D. in Hispanic Literature. She taught at Rutgers University. Her life's work is the subject of the book \"Poets, Philosophers, Lovers: On the Writings of Giannina Braschi\". She is also an activist. She advocates for the independence of Puerto Rico from the United States. She lives in New York City. == Works == Giannina Braschi writes in Spanish, Spanglish, and English. She writes about love, creativity, immigration, and liberty. She is \"one of the most revolutionary\" writers in Latin America today.\" The word \"revolutionary\" means to her style is very creative. She also writes about revolution. She wrote the poetry epic Empire of Dreams (1988) about New York City. Her poetry is humorours. She wrote the first Spanglish novel Yo-Yo Boing! (1998). Spanglish is a mix of the English and Spanish languages. She wrote the novel United States of Banana (2011) about terrorism and the collapse of the United States. The novel opens with the fall of the World Trade Center in 2001, and ends with the liberation of Puerto Rico. Her books have been turned into art books, photography, painting, and sculpture. There is a comic book of United States of Banana (2017) by the Swedish cartoonist Joakim Lindengren. The same book was turned into a play. == Awards == She has won awards from National Endowment for the Arts, New York Foundation for the Arts, Ford Foundation, Danforth, and Reed Foundations, Puerto Rican Institute of Culture, and PEN American Center, among others. == Related pages == * Puerto Rican literature *Puerto Rican poetry *Julia de Burgos *Victor Hernández Cruz *Caribbean poetry == References == Category:American novelists Category:American playwrights Category:American essayists Category:Puerto Rican poets Category:Puerto Rican educators",
 "title": "Giannina Braschi"
}