{
 "id": "790446",
 "text": "Puerto Rico has a vibrant literature. Puerto Rican poetry, novels, essays, and theater plays are mostly written in Spanish. However, Puerto Rican authors sometimes write in a mixture of Spanish and English and in English. The most important authors are René Marqués, Julia de Burgos, Rosario Ferrer, Luis Rafael Sanchez, Giannina Braschi, Lin-Manuel Miranda, and Esmeralda Santiago., and Lin-Manuel Miranda. == Puerto Rican women writers == Puerto Rican women novelists have been successful internationally. They have won many prizes. Their books have been translated into many languages. They write satires, humorous novels, poems, and political essays The island's storytellers include Rosario Ferrer (Eccentric Neighborhoods), Giannina Braschi (United States of Banana), Ana Lydia Vega (Pollito Chicken), Mayra Santos (Sirena Selena), and Esmeralda Santiago (When I Was Puerto Rican). The major female poets are Julia de Burgos (who wrote lyrical poems such as \"Yo fui mi ruta\") and Giannina Braschi (author the poetry epic \"Empire of Dreams\"). == Nuyorican Literature == In the 20th century, many Puerto Ricans moved to New York City for a better life. They are called \"Nuyorican.\" Nuyorican is a person of Puerto Rican birth or descent who lives in New York. === Novels === The most famous Puerto Rican novels are Down These Mean Streets by Piri Thomas and Yo-Yo Boing! by Giannina Braschi. Both books talk of New York City life for immigrants. Their books discuss the harsh side of the American Dream. Both novels also use a mixture of Spanish and English called Spanglish. === Poetry === The Nuyorican movement is a tradition of poets, writers, artists, and musicians who create works about Puerto Rican life in New York City. The male poets include Miguel Algarin, Tato Laviera, Pedro Pietri (Masses are Asses), and Miguel Pinero (Outlaw). The main Nuyorican women poets are Sandra Maria Esteves and Giannina Braschi (Empire of Dreams). === Theater === The most famous Puerto Rican playwright is Lin Manuel Miranda, author of the Broadway musical Hamilton. Miranda's successful musical won many awards, including Drama Desk Award and Pulitzer Prize for Drama. The play is about the American revolution in 1776. One actress Rosie Perez wrote an autobiography called \"Handbook for an Unpredictable Life: How I Survived Sister Renata and My Crazy Mother, and Still Came Out Smiling...\" (2014). Famous Puerto Rican plays are Short Eyes by Miguel Pinero and The Oxcart by René Marqués. Latino theater companies that produce Puerto Rican plays include Pregones, Puerto Rican Traveling Theater, and Aguijon Theater. == Puerto Rican authors == Born in Puerto Rico, USA * Giannina Braschi (Empire of Dreams) * Julia de Burgos (\"Río Grande de Loíza\") * Victor Hernández Cruz (Snaps) * Tato Laviera (La Carreta Made a U Turn) * Judith Ortiz Cofer (Reaching for the Mainland) * Luis Palés Matos (Tuntún de pasa y grifería) * Pedro Pietri (Puerto Rican Obituary) * Miguel Piñero (Lower East Side Poem) * Mayra Santos-Febres (Anamu y manigua) Born stateside * Jack Agüeros (Sonnets from the Puerto Rican ) * Martín Espada (Imagine the Angels of Bread) * Sandra Maria Esteves (Yerba Buena) * Lin-Manuel Miranda (creator of Broadway musical Hamilton) * Piri Thomas (Down These Mean Streets) * William Carlos Williams (epic poet, author of Paterson) == Related pages == * Puerto Rico * American literature * Latina poetry *Spanglish == References == Category:Puerto Rico Category:American literature",
 "title": "Puerto Rican literature"
}