{
 "id": "790562",
 "text": "King Kong Escapes is a 1967 Japanese-American science-fiction fantasy action spy kaiju film. It was produced by Toho and Rankin/Bass Productions and distribution by Universal Pictures in 1968. It is the fourthKing Kong movie and second Japanese King Kong movie. this film was special effects by Eiji Tsuburaya. about an giant ape named Kong an Mondo Islander tries to hunt the terrorist leader Dr. Who creating a giant robot called Mechani-Kong or Robot Kong in English-dub, an 20-meter ape robot. == Plot == in, 1966. an arctic headquarters inside an giant robotic gorilla created by Who himself an a copy- alike of King Kong, Mechani-Kong digging by an mysterious object known as Element X an crystaline radiation. then in Mondo Island a group of United Nations submarine groups, then Susan caught by an Gorosaurus who tries to eat her, Kong awakes to fights Gorosaurus to death. Dr. Who arrives Mondo Island to hunt Kong to use as a prisoner, those helicopters launched an gassed bomb to unconscious the ape and carried by an larger ship. Kong watches an Mechani- Kong as a real aside, then hypnotized Kong to dig an Element X, and escaped. Kong goes on a rampage to Tokyo, an JSDF tanks surrounded the ape, an Mechani- Kong upsets catches Susan kidnapped, running the robot follows to the Tokyo Tower. Kong holds Mechani-Kong's leg and dropping Susan and hold her onto the place, Mechani-Kong steps an tower and electrocutes the giant robot ape, Mechani-Kong fell off the tower and crashes to metal pieces. Kong attacked Who inside the giant ship, wrecked and destroyed in the entire sea, Kong victoriously wins and leaving swimmingly Kong went, Japan to Mondo Island instead. ==Cast== * Rhodes Reason as Carl Nelson * Linda Miller as Susan Watson * Akira Takarada as Jiro * Haruo Nakajima as King Kong * Hideyo Amamoto as Dr. Satoshi Who * Mie Hama as Madame X/Madame Aran X * Yu Sekida as Mechani-Kong/Gorosaurus * Yoshifumi Tajima - Chief * Shoichi Hirose, Toru Ibuki, Nadao Kirino, Susumu Kurobe, Sachio Sakai, Kazuo Suzuki and Yoshifumi Tajima - Dr. Who's Henchmens * Andrew Hughes - United Nations journalist * Ryūji Kita - Police inspector * Osman Yusuf - Submariner * Yasuhisa Tsutsumi - General * Masaaki Tachibana - Self-Defense Force soldier * Ikio Sawamura - Mondo Islander * Nadao Kirino - Dr. Who's assistant * Seishiro Kuno, Haruya Sakamoto, Masaaki Tachibana - JSDF soldiers * Kamayuki Tsubono - Security headquarters guard * Ryu Kuze - Killer in American version of those voices include, Paul Frees, Julie Bennett, Hal Smith, Pat Woodell. == Release == The film was released in Japan in July 22, 1967 by Toho and United States in June 19, 1968 by Universal Pictures and Rankin/Bass Productions. == References == * Category:American monster movies Category:Monster movies Category:1967 movies Category:Giant gorilla movies Category:Multilingual movies Category:Movies about dinosaurs Category:Movies set in the 1960s Category:Movies set in Japan Category:King Kong Category:Japanese movies Category:Movies directed by Ishirō Honda Category:Universal Pictures movies",
 "title": "King Kong Escapes"
}