{
 "id": "790700",
 "text": "Melinda Plowman (born May 13, 1941), also called Melinda Ann Casey and Melinda Casey, is an American actress and associate director. She started acting aged 6 and was in many movies and television series in the 1960s. Her first lead role was in the 1966 horror movie Billy the Kid Versus Dracula. She joined the Directors Guild of America in the 1970s and was an associate director in the 1990s. ==Filmography (as an actress)== Movie Year Title Role Notes 1949 Little Women Girl Uncredited 1949 Holiday Affair Girl 1949 Ma and Pa Kettle Susie Kettle 1950 Three Came Home English girl 1950 My Blue Heaven Pringle girl 1950 Again Pioneers Rebecca Ashby As Malinda Plowman 1951 Home Town Story Katie Washburn 1951 Chicago Calling Nancy Cannon 1952 Monkey Business Little girl 1952 Carrie Little girl 1953 Pack Train Judy 1956 Wiretapper 1957 The Green- Eyed Blonde Betsy Abel As Linda Plowman 1966 Billy the Kid Versus Dracula Betty Bentley 1976 Street Girls Adelle As Linda Reynolds 1982 Wrong Is Right W.T.N. news staffer As Melinda Ann Casey Sources: Sources: Sources: Sources: TV Year Title Role Episode 1950 Big Town Kathy 1950 The Gene Autry Show Betsy Simmons 1950 The Cisco Kid Carol Cartright 1952 The Adventures of Ozzie and Harriet Girl, Linda, Melinda, Sean's girl, Sue Bailey 5 episodes 1952 Ford Television Theatre Little girl 1952 Cavalcade of America Vi as a teenager 1953 The Danny Thomas Show Mary Lou 1953 General Electric Theater Charlotte Dunn 1954 Rocky Jones, Space Ranger Jonica 1954 Annie Oakley Jill Turner, Penny 2 episodes 1955 The Adventures of Champion Sally Custer Episode: \"Salted Ground\" 1955 The Adventures of Champion Lorna Episode: \"Canyon of Wanted Men\" 1955 Science Fiction Theatre Alice 1956 The Mickey Mouse Club Peggy 1956 Diamond Mystery Theater Susan Davis Episode: \"The Man Across the Street\" 1958 The Donna Reed Show Babs Episode: \"Parting of the Ways\" 1958 Wanted: Dead or Alive Patience Fairweather 1959 The June Allyson Show Nancy 1 episode 1959 Bonanza Heather Lowell 1 episode 1959 The Many Loves of Dobie Gillis Central High Girl 1960 My Three Sons Julie 1960 National Velvet Sally Grimes 1961 The Americans Molly 1 episode 1961 Bachelor Father Agnes 1 episode 1962 Wagon Train Penelope Episode: \"Path of the Serpent\" 1962 Perry Mason Maureen Thomas Episode: \"The Case of the Polka-Dot Pony\" 1962 Going My Way Jane Everett 1963 The Fugitive Ellen Tolan Episode: \"See Hollywood and Die\" 1963 The Virginian Episode: \"A Time Remembered\" 1963 My Favorite Martian Sally 1963 Petticoat Junction Mary Jane Burris 1964 The Outer Limits Viva Hayden Episode: \"Don't Open Till Doomsday\" 1964 Gomer Pyle, U.S.M.C. Girl Marine 1965 Please Don't Eat the Daisies Terry, Secretary 2 episodes 1966 The Felony Squad Mylene Bruce, Suellen Taubs 2 episodes 1966 Bonanza Episode: \"Four Sisters from Boston\" 1967 Judd, for the Defense Girl 1969–1971 Hot Wheels (TV series) Janet Martin Voice 1969–1971 Skyhawks Cynthia Hughes Voice Sources: Sources: Sources: Sources: ==References== ==Other websites== * * Category:1941 births Category:Living people Category:Actors from Texas Category:Movie directors from Texas Category:American child actors",
 "title": "Melinda Plowman"
}