{
 "id": "790876",
 "text": "Jitsi is a group of free and open-source voice (VoIP), videoconferencing and instant messaging for many platforms, like the web platform, Windows, Linux, macOS, iOS and Android. The Jitsi project started with Jitsi Desktop (previously known as SIP Communicator). With the growth of WebRTC, the Jitsi team decided to focus on Jitsi Videobridge for doing web-based video calling for multiple people. Later the team added Jitsi Meet, a full video conferencing application that includes web, Android, and iOS clients. Jitsi also operates meet.jit.si, a version of Jitsi Meet hosted by Jitsi for free to be used by the community. Other projects are: Jigasi, lib-jitsi-meet, Jidesha, and Jitsi. Jitsi is supportefd by various institutions such as the NLnet Foundation, the University of Strasbourg and the Region of Alsace and it has participated multiple times on Google Summer of Code program. == History == Work on Jitsi (then SIP Communicator) started in 2003as a student project by Emil Ivov at the University of Strasbourg. It was released as an example video phone in the JAIN-SIP stack and later became an independent project. In 2009, Emil Ivov founded the BlueJimp company which has employed some of Jitsi's main contributors in order to offer professional support and development services related to the project. In 2011, after successfully adding support for audio and video communication over XMPP's Jingle extensions, the project was renamed to Jitsi since it was no longer \"a SIP only Communicator\". This name originates from the Bulgarian \"жици\" (wires). Jitsi introduced the Videobridge in 2013 to support video calling with multiple people using a new Selective Forwarding Unit (SFU) architecture. Later that year initial support was added to the JitsiVideobridge allowing WebRTC calling from the browser. To demonstrate how JitsiVideobridge could be used as a production service, BlueJimp offered a free use of its hosted system at meet.jit.si. On November 4, 2014, \"Jitsi + Ostel\" scored 6 out of 7 points on the Electronic Frontier Foundation's secure messaging scorecard. They lost a point because there has not been a recent independent code check by people outside jitsi . On February 1, 2015, Hristo Terezov, Ingo Bauersachs and the rest of the team released version 2.6 from their stand at the Free and Open Source Software Developers' European Meeting 2015 event in Brussels. This release includes security fixes, removes support of the deprecated MSN protocol, along with SSLv3 in XMPP. Among other improvements, the OS X version has aa Java 8 runtime inside, enables echo cancelling by default, and uses the CoreAudio subsystem. The Linux build fixes font issues with the GTK+ native LookAndFeel, and fixes someissues about microphone volume level on call starting when using the PulseAudio sound system. A full list of changes is available on the project web site. Atlassian bought BlueJimp on April 5, 2015. After that, the new Jitsi team under Atlassian stopped important new development work on the Jitsi Desktop project and expanded its efforts on projects related to the Jitsi Videobridge and Jitsi Meet. Regular contributions from the open source community have maintained the Jitsi Desktop project. Jitsi is fully funded by 8x8. == Primary projects of Jitsi == The Jitsi open source repository on GitHub currently contains 103 repositories. The major projects include: ; Jitsi Meet : Video conferencing server designed for quick installation on Debian/Ubuntu servers. ; Jitsi Videobridge : WebRTC Selective Forwarding Unit engine for powering multi-party conferences. ; Jigasi : Server-side application that links allows regular SIP clients to join Jitsi Meet conferences hosted by Jitsi Videobridge. ; lib-jitsi-meet : Low-level JavaScript API for providing a customized UI for Jitsi Meet. ; Jidesha : Chrome extension for Jitsi Meet. ; Jitsi : Audio, video, and chat communicator that supports protocols such as SIP, XMPP/Jabber, AIM/ICQ, and IRC. === Jitsi Meet === Jitsi Meet is an open source JavaScript WebRTC application and can be used for videoconferencing. One can share presentations and with just a link can invite new members for videoconference. It can be used by downloading the app or directly in a browser and is compatible with any recent browser. Every user can use Jitsi.org servers or can download and install the server software on a Linux-based machine. Key features of Jitsi Meet * Encrypted communication (secure communication): As of April 2020, 1-1 calls use the P2P mode, which is end-to-end encrypted via DTLS-SRTP between the two participants. Group calls also use DTLS-SRTP encryption, but deppend on the Jitsi Videobridge (JVB) as video router, where packets are decrypted temporarily. The Jitsi team says that \"they are never stored to any persistent storage and only live in memory while being routed to other participants in the meeting\", and that this measure is necessary due to current limitations of the underlying WebRTC technology. * No need of new client software installation. == References== == Other websites == * Category:Free software Category:Instant messaging software Category:Video chat",
 "title": "Jitsi"
}