{
 "id": "791016",
 "text": "There are many natural caves in Azerbaijan. Most of these caves are karstic caves and the rest are volcanic caves (lava tubes). These caves were also the first shelters and dwellings of Stone Age hominids and humans. Azykh Cave, one of the most famous caves of Azerbaijan, is known as the settlement of Stone Age hominids. It was determined that the cave was the settlement of the Acheulean and the Mousterian cultures. During the period of the Mousterian culture, Neanderthals lived in Azykh Cave.Лазуков Г. И., Гвоздовер М. Д., Рогинский Я. Я., «Природа и древний человек» Издательство «Мысль», 1981 стр 71-72 == List of caves in Azerbaijan == The list does not include all caves. Name Name in Azerbaijani Location Allar Cave Allar mağarası Yardymli District Ashabi-Kahf Cave Əshabi-Kəhf Babek District Buzeyir Cave Büzeyir mağarası Lerik District Zar Cave Zar mağarası Kalbajar District Kilit Cave Kilit mağarası Ordubad District Tağlar Cave Tağlar mağarası Khojavend District Shish Kuzey Cave Şiş Quzey Tovuz District Shusha Cave Şuşa mağarası Shusha District == List of cave complexes in Azerbaijan == The list does not include all cave complexes (group of caves connected to each other). Name Name in Azerbaijani Location Azykh Cave Azıx mağarası Khojavend District Damjili Cave Damcılı mağarası Qazakh District Dash Salahli Cave Daş Salahlı mağarası Qazakh District Hadikaib Cave Hadiqaib mağarası Sharur District Ugan Cave Uğan mağarası Oghuz District Mereze CaveQHT Şuranın dəstəyi ilə Azərbaycanın geoloji təbiət abidələrini tanıdır: Nərimankənd karst mağaraları QHT Tribunası Mərəzə mağarası Gobustan District == Gallery == File:Azokh Cave3.jpg|Entrance of Azykh Cave File:Azokh.jpg|A bat in Azykh Cave File:Azokh Cave.jpg|Archaeological site in Azykh Cave in 2009 File:Ashab ul Kahf Cave in Azerbaijan.JPG|Ashabi-Kahf Cave File:Mərəzə mağaraları.jpg|Mereze Cave File:Mərəzə mağarasının içərisi.jpg|Interior of Mereze Cave File:Qaradağ rayonu, su mağaraları.jpg|Karstic cave in Qaradag District File:Qaradağ rayonu, Ümid qəsəbəsi yuxarısında su mağarası.jpg|Karstic cave formation in Qaradag District File:Qazanfar caves.jpg|Cave in Gobustan District == Related pages == * Geography of Azerbaijan * Cave * Stone Age == References == Azerbaijan Category:Landforms of Azerbaijan Category:Archaeological sites in Azerbaijan Category:Tourism in Azerbaijan",
 "title": "Caves of Azerbaijan"
}