{
 "id": "791199",
 "text": "King Kong Lives also known as King Kong 2 in other countries, is a 1986 American action-adventure fantasy monster movie directed by John Guillermin, and starring Brian Kerwin and Linda Hamilton. It was released in December 19, 1986. It is the sixth King Kong movie, as well as the sequel of the 1976 movie. == Plot == After being shot down from the World Trade Center, Kong is revealed to be still alive and is kept in a coma for about 10 years at the Atlantic Institute, under the care of surgeon Dr. Amy Franklin. In order to save Kong's life, Dr. Franklin must perform a heart transplant and give Kong a computer-monitored artificial heart. However, he has lost so much blood that a blood transfusion is badly needed, but Franklin says there is no species of ape or other animal whose blood type matches Kong's. Hank \"Mitch\" Mitchell, adventurer and Franklin's eventual lover, who travels to Borneo (as he theorizes that Borneo and the island from the first movie were once part of the same landmass) and captures a giant female ape who is named \"Lady Kong\". Mitchell brings her to the institute to use her blood for King Kong's surgery. The transfusion and the heart transplant are a success, but Kong escapes along with Lady Kong. Archie Nevitt, an insane army lieutenant colonel, is called in with his men to hunt down and kill the two apes. Lady Kong is captured alive by Nevitt's troops and imprisoned; Kong falls from a cliff and is presumed dead. However, as Franklin and Mitchell soon discover, Kong's artificial heart is beginning to fail, forcing them to attempt a jailbreak. They discover that Lady Kong is pregnant with Kong's offspring. The jailbreak is successful thanks to Kong, who has survived the fall and breaks his mate out. After being followed, attacked, and shot by the military, Kong kills Lt. Col Nevitt and dies slowly near a military base on a farm where Lady Kong gives birth to an infant son. Kong reaches out to touch his son just before dying. Having returned to Borneo, Lady Kong lives peacefully with her son in the jungle. ==Cast== * Brian Kerwin - Hank Mitchell * Linda Hamilton - Amy Franklin * Peter Elliott - King Kong * George Antoni/Dee Dee Rescher - Lady Kong * Benjamin Kechley/Billy West - Baby Kong * John Ashton - Colonel Archie Nevitt * Peter Michael Goetz - Dr. Ingersoll * Frank Maraden - Dr. Hughes * Jimmy Ray Weeks - Major Peete * Andrew Hughes - United Nations journalist * Michael Forest - Vance * Leon Rippy, Wallace Merck, Dean Whitworth, Herschel Sparber - Hunters ==Critical response== King Kong Lives was criticized by movie critics and the reviews were very negative. Rotten Tomatoes reported that none of the movie critics gave the movie a positive review, which has an average rating of only 2.20 out of 10. On Metacritic, the movie has an average score of 32 out of 100 based on 9 reviews by movie critics, meaning \"generally unfavorable reviews\". ==Box office== Across the world, King Kong Lives was a commercial success at the box office, with a total revenue of $48.9 million, which was much more than the movie budget of $18 million. It was a box office bomb in the United States and Canada, grossing $4,711,220 during its theatrical run. But the movie's success elsewhere, covered the losses in North America. == References == == Other websites == * Category:American monster movies Category:1986 movies Category:Giant gorilla movies Category:Jungle movies Category:Movies set in the 1980s Category:Movies set on islands Category:Movies set in Asia Category:King Kong Category:Movies directed by John Guillermin Category:American independent movies Category:1980s monster movies",
 "title": "King Kong Lives"
}