{
 "id": "791177",
 "text": "Emperor Go-Daigo or Go-daigo Tennō (1288-1339) was the emperor of Japan from 1318 to 1339. He was the 96th emperor of Japan. When he lived, the shoguns had a lot of power in Japan. Emperor Go-Diago tried to take power from them so he could rule Japan. When Go-Daigo lived, Japan had two governments. There was one government set up by the emperors of Japan, who lived in Kyoto. There was another government run by the shoguns, the bakufu. The law said the emperors were rulers, but the bakufu had more power than they did. Neither the emperor's government nor the shogun's government was powerful enough to rule very well. ==Early life== Go-Daigo was born with the name Takaharu on November 26, 1288. He was born on Mount Yoshino, near the town of Yoshino in Nara. ==Emperor== Go-Daigo became emperor in 1318 when he was 30 years old. This was not usual for the time. Usually, small boys were made emperor. When they became adult men, they went to religious communities for men, where they would set up a government and rule even though they stayed in the monastery. A new boy from the imperial family was put on the throne. This system, with a boy on the throne in public and a \"former\" emperor ruling from a monastery, was called cloistered rule or insei. Go-Daigo wanted to rule Japan himself. The bakufu government was weak because they had not been able to reward their warriors. When the Mongols invaded, the bakufu brought an army and kept them from invading. But the usual way to reward warriors was to give them the defeated enemy's lands and treasure. Because the Mongols were invaders, they had no lands for the shoguns to give to their warriors. This made the warriors unhappy with the shoguns. Go-Daigo began to quietly raise an army to defeat the bakufu and take control of Japan, but he was found out. The shogun caught him and imprisoned him on the Oki Islands. Go-Daigo's supporters fought for him while he was on the Oki Islands. One of the shogun's generals, Ashikaga Takauji changed sides. Go-Daigo's side won, and Go-Daigo ruled. His rule is called the Kemmu Restoration. Go-Daigo did not reward Ashikaga Takauji with a high rank, only the rank of counsellor. He did not reward many of his other supporters either. In 1335, Takauji declared himself shogun and rebelled. Takauji and his army captured Kyoto and set up one of Go-Daigo's relatives as an emperor there. Go-Daigo ran away from Kyoto and set up a court Yoshino, south of Nara. Go-Daigo's court only ruled the land nearby. So for many years, there were two men who said they were emperor of Japan. ==Legacy== After Go- Daigo's time as ruler, the line of emperor was split in two, one northern and one southern. They were made one line again in 1392. ==References== Category:1288 births Category:1339 deaths Category:Emperors of Japan",
 "title": "Emperor Go-Daigo"
}