{
 "id": "791298",
 "text": "Right-wing populism is a political ideology that uses populist rhetoric and themes to promote right-wing politics. According to the definition of Dutch political scientist Cas Mudde, populism is a political ideology that divides society into two antagonistic entities: the people and the elites. From the right-wing perspective, political elites and the State are intrinsically corrupt and bureaucratic, therefore there is a rhetoric that appeals to individuals who identify with \"anti-State\" policies and the view that individuals with different political views are adversaries (commonly associating the later with globalism or the far-left).Akkerman, Agnes (2003) \"Populism and Democracy: Challenge or Pathology?\" Acta Politica n.38, pp.147–159 Much like left-wing populism, right-wing populism employs sentiments against elitism, opposition to the Establishment, and a discourse that seeks the sympathy of \"ordinary people\". However, right-wing populists generally focus on cultural issues, often claiming to defend traditional values and national identity against progressivism and multiculturalism while left-wing populists more often employ economic arguments and attack neoliberalism and the role of large corporations in society. Faced with contemporary dilemmas such as climate change and the struggle against pandemics, many right-wing populists remain anti-environmentalism and against measures such as lockdowns and mandatory vaccination.Gruber, Mirjam; Isetti, Giulia; Ghirardello, Linda; Walder, Maximilian (5 July 2023). «Populism in Times of a Pandemic: A Cross-Country Critical Discourse Analysis of Right-Wing and Left-Wing Populist Parties in Europe». Populism (2): 147–171. Retrieved 9 April 2024 Crime is also a recurring issue among them, with their defense of law and order usually being punitivist. Notable right-wing populists include Jair Bolsonaro, Tucker Carlson, Marine Le Pen, Conor McGregor, Javier Milei, Viktor Orbán, Vladimir Putin, Andrew Tate, and Donald Trump. In the United States, right-wing populism has become notable since the Tea Party movement formed during the Great Recession. It was adopted by Donald Trump to win the 2016 United States presidential election, and is currently being used to win the 2024 United States presidential election. == References == Category:Political movements",
 "title": "Right-wing populism"
}