{
 "id": "791378",
 "text": "Adèle Exarchopoulos (born November 22, 1993) is a French actress. She is most well-known for playing Adèle in the drama movie Blue is the Warmest Colour (2013). She won the Palme d'Or award for this performance. She was the youngest person to win this award. For her acting in Blue is the Warmest Colour, she also won the César Award for the Most Promising Actress, the Los Angeles Film Critic Award for Best Actress and Trophée Chopard Award for Female Revelation of the Year. Exarchopoulos acted in the movies Turk's Head (2010), The Round Up (also 2010) and I Used to be Darker (2013). Exarchopoulos was born in Paris, France. ==Filmography== Year Title Role Notes 2006 R.I.S, police scientifique Sarah TV series 2007 Boxes Lilli 2008 Les Enfants de Timpelbach Marianne 2010 The Round Up Anna Traube Turk's Head Nina 2011 Chez Gino Maria Roma Carré blanc Marie (young) 2012 Des morceaux de moi Erell 2013 I Used to Be Darker Camille Making a Scene The Woman Short Blue is the Warmest Colour Adèle 2014 Insecure Jenny Voyage vers la mère Marie Louise 2015 Les Anarchistes Judith Lorillard Apnée The Woman Short 2016 Down by Love Anna Amari The Last Face Ellen Orphan Sandra 2017 Racer and the Jailbird Bibi Delhany 2018 The White Crow Claire Saint 2019 Sibyl Margot Revenir Mona 2020 Mandibules Bac Nord ==Awards and nominations== Award Year Category Work Result Ref. Central Ohio Film Critics Association Best Actress Blue Is the Warmest Colour Breakthrough Film Artist César Awards Most Promising Actress Chicago Film Critics Association Best Actress Most Promising Performer Critics' Choice Movie Awards Best Young Actor/Actress Detroit Film Critics Society Best Actress Dorian Awards Film Performance of the Year - Actress Rising Star of the Year Dublin Film Critics' Circle Best Actress Best Newcomer Globes de Cristal Awards Best Actress Gold Derby Film Awards Best Lead Actress Best Breakthrough Performer Indiana Film Journalists Association Best Actress IndieWire Critics Poll Best Lead Performance International Cinephile Society Best Actress International Online Film Critics' Poll Internet Film Critics Society Los Angeles Film Critics Association Best Actress London Film Critics Circle Actress of the Year Lumières Awards Most Promising Actress National Board of Review Breakthrough Performance - Actress National Society of Film Critics Best Actress New York Film Critics Circle Best Actress New York Film Critics Online Best Breakthrough Performance North Carolina Film Critics Association Best Actress Online Film Critics Society Best Actress Online Film and Television Association Best Actress Best Youth Performance Best Breakthrough Performance: Female San Diego Film Critics Society Best Actress San Francisco Film Critics Circle Best Actress Satellite Awards Best Actress in a Motion Picture Seattle Film Critics Awards Best Actress Utah Film Critics Association Village Voice Film Poll Best Actress Washington D.C. Area Film Critics Association Best Youth Performance ==References== Category:1993 births Category:Living people Category:French movie actors Category:French television actors Category:Award winning actors Category:Actors from Paris",
 "title": "Adèle Exarchopoulos"
}