{
 "id": "79140",
 "text": "The Medal of Honor is the highest award given to members of the United States Military. It is given to people who show a lot of bravery in wartime. Because of this, many people who get the Medal of Honor die earning it. It was first given in 1863 during the American Civil War. The Medal of Honor has been given to 3,458 different people,Congressional Medal of Honor Society (CMOHS), \"Archive Statistics\"; retrieved 2012-12-24. including * Dakota L. Meyer, who is the youngest and most recent living recipientMedal of Honor News, \"Veterans Day parade NYC 2011: Youngest Medal of Honor recipient meets oldest living recipient,\" November 11, 2011; retrieved 2012-12-24. * Jacob Parrott, who was the first man to be awarded the medal in 1863CMOH, \"Frequently Asked Questions\"; retrieved 2012-12-24. * Mary Walker, who was the first and only woman awarded the medal. * Leslie H. Sabo Jr., who is the most recent person to receive the medal in 2012. According to Medal of Honor recipient Retired Army Maj. Gen. Patrick Brady who flew more than 2,500 combat missions over Vietnam and helped rescue more than 5,000 wounded, \"it is harder to wear it than to earn it\".Smith, John. \"It's Harder To Wear The Medal Of Honor Than To Earn It,\" Spartanburg Herald-Journal (South Carolina). October 29, 1972; Brady, Patrick. \"Harder to wear Medal of Honor than to earn it\" at MySanAntonio.com, November 17, 2010; retrieved 2012-12-31.Patrick Brady ==Gallery== ; Army File:cmoh army.jpg|US Army Medal of Honor, 1903-present File:ArmyMOH.jpg|US Army Medal of Honor, 1862-1895, 1896-1903 ; Navy File:Moh right.gif|US Navy Medal of Honor, 1942-present File:NavyMOH.jpg|US Navy Medal of Honor, 1862-1912, 1913-1942 ; Air Force File:Airforce moh.jpg|US Air Force Medal of Honor, ==References== ==Other websites== * Congressional Medal of Honor Society website *Medal of Honor at the United States Army Center of Military History Category:Military honors Category:Orders, decorations, and medals of the United States Category:1863 establishments in the United States",
 "title": "Medal of Honor"
}