{
 "id": "791823",
 "text": "The Rogers Commission Report was created by a Presidential Commission charged with investigating the Space Shuttle Challenger disaster during its 10th mission, STS-51-L. ==Outcome== The report, released and submitted to President Ronald Reagan on 9 June 1986, both determined the cause of the disaster that took place 73 seconds after liftoff, and urged NASA to improve and install new safety features on the shuttles and in its organizational handling of future missions. == Commission members == *William P. Rogers, chairman and former United States Secretary of State (under Richard Nixon) and United States Attorney General (under Dwight Eisenhower) *Neil Armstrong (Vice Chairman), retired astronaut and first human to walk on the Moon (Apollo 11) *David Campion Acheson, diplomat and son of former Secretary of State Dean Acheson *Eugene E. Covert, aeronautics expert and former Chief Scientist of the U.S. Air Force *Richard P. Feynman, theoretical physicist and winner of the 1965 Nobel Prize in Physics *Robert B. Hotz, Editor, Aviation Week And Space Technology *Donald J. Kutyna, Air Force general with experience in ICBMs and Shuttle management *Sally K. Ride, American engineer, astrophysicist and first female American astronaut in space, flew on Challenger as part of missions STS-7 and STS-41-G *Robert W. Rummel, Trans World Airlines executive and aviation consultant to NASA *Joe Sutter, engineer for Boeing and part of the team that developed the Boeing 747 aircraft *Arthur B. C. Walker, Jr, solar physicist and Stanford University professor *Albert D. Wheelon, physicist and developer of Central Intelligence Agency's aerial surveillance program *Charles E. Yeager, retired Air Force general and the first person to break the sound barrier in level flight *Alton G. Keel Jr., executive director of the commission ==Other websites== * Report of the Presidential Commission on the Space Shuttle Challenger Accident – the Rogers Commission report on the accident (NASA.gov parsed HTML version) * Report of the Presidential Commission on the Space Shuttle Challenger Accident – pdf version (9.85Mb), compiled by Thomas ('thomasafb') - Volume I only * Hearing on the Space Shuttle Accident and the Rogers Commission Report. 219 pages (14.2 MB) U.S. Senate Committee on Commerce, Science and Transportation, Subcommittee on Science, Technology and Space. Date: 99th Congress, 2nd Session, February 18, June 10 and 17, 1986. See also GPO Challenger index page. * – Report of the Presidential Commission on the Space Shuttle Challenger Accident, Appendix F – Personal Observations on Reliability of Shuttle by R. P. Feynman Category:1986 in the United States",
 "title": "Rogers Commission Report"
}