{
 "id": "79238",
 "text": "Proxima Centauri is a red dwarf star that is likely a part of the Alpha Centauri star system and is the closest star to the Sun at a distance of . It is in the constellation of Centaurus. Proxima Centauri was found to share the same proper motion as Alpha Centauri in 1915 by Robert Innes while he was Director of the Union Observatory in Johannesburg, South Africa. In 1951, Harlow Shapley said that Proxima Centauri was a flare star. Recorded photographs showed that the star became measurably brighter about 8% of the time, making it the most active flare star then found. == Characteristics == Red dwarfs are usually far too faint to be seen with the naked eye, that means without a telescope. Proxima Centauri has an apparent magnitude of 11 while its absolute magnitude is a very dim 15.5. Even from Alpha Centauri A or B, Proxima would only be seen as a 5th magnitude star. Proxima Centauri has been the closest star to the Sun for about the last 32,000 years. Barnard's Star will make its closest approach to the Sun around AD 11,700, when it approaches to within about 3.8 light-years. However, at that time, it will not be the nearest star, since Proxima Centauri will then have moved even closer to the Sun. Six stars will come closer to Earth in the next 45,000 years.Same source: The close approach of stars in the Solar neighborhood. Matthews R.A.J. 1994. Quarterly Journal of the Royal Astronomical Society, 35, #1, p1. ==Planetary system== In 2016, an exoplanet was found by the European Southern Observatory around Proxima Centauri, Proxima Centauri b (or Proxima b). It was found in the habitable zone, and was thought to be Earth-like, with an ESI of 0.87.http://phl.upr.edu/press-releases/proxb | A Potentially Habitable World in Our Nearest Star | Aug 17, 2016 While being Earth-like, it may not be habitable on the surface, since Proxima Centauri gives off strong solar flares and high solar winds, which could strip away parts of the atmosphere of the planet, making it less habitable.https://www.space.com/39829-nearest-exoplanet-proxima-b-superflare.html | Superflare Blasts Proxima b, the Nearest Exoplanet, Dimming Hopes of Life | By Mike Wall | February 28, 2018 In October of 2016, scientists at France's CNRS research institute said that the planet may have oceans on its surface, and a thin atmosphere. If this idea is true or not is not known.\"Planet in star system nearest our Sun 'may have oceans'\", Phys.org, Retrieved 6 October 2016 Another planet, Proxima Centauri c, much farther out than b, was discovered in 2019. It is seven times heavier (more massive) than Earth. It is too cold to be habitable. Because it showed up brighter than expected when photos of it were taken, it may have a ring system five times wider than that of Jupiter. == Related pages == * Alpha Centauri * Barnard's Star * List of nearest stars == References == == Other websites == * Photograph of Proxima Centauri * O Sistema Alpha Centauri (portuguese) Category:Red dwarfs",
 "title": "Proxima Centauri"
}