{
 "id": "792609",
 "text": "Onyx is an American hip hop group. They are from Queens, a borough of New York City. The group was founded in 1988 by Fredro Starr, Suavé (also known as Sonny Seeza) and the late Big DS. The group is named after the onyx stone. They are best known for their song \"Slam\". The song is off their studio album Bacdafucup. The album was released on March 30, 1993. ==Awards and nominations== In 1994, for the album Bacdafucup, Onyx was nominated for \"Favorite New Rap/Hip-Hop Artist\" at the American Music Awards. They won \"Best Rap Album\" at the Soul Train Music Awards. Onyx was also nominated five times at The Source Hip Hop Music Awards ceremony in 1994. Year Award Nominated work Category Result 1994 American Music Awards of 1994 Bacdafucup Rap/Hip-Hop New Artist 1994 1994 Soul Train Music Awards Bacdafucup Best Rap Album 1994 The Source Hip Hop Music Awards Onyx New group of the year 1994 The Source Hip Hop Music Awards Onyx New artist of the year 1994 The Source Hip Hop Music Awards Onyx Live performer of the year 1994 The Source Hip Hop Music Awards \"Slam\" Single of the year 1994 The Source Hip Hop Music Awards Bacdafucup Album of the year At the end of 1993, the US magazines Billboard and Cashbox placed Onyx on several of their final annual charts. In 1996, CMJ New Music Monthly placed the album All We Got Iz Us in their list The 25 Best Hip-Hop Albums of 1995. In 2014, #WakeDaFucUp was named as one of the best hip-hop albums of 2014 by XXL.The 25 Best Hip-Hop Albums Of 2014 (So Far) . XXLMag.com (2014-06-30). Retrieved on 2014-06-30. In 2020, SnowMads was chosen as \"The Best Rap Album of 2019: Readers' Choice\" by the Russian website Rap.Ru. Year Work Publication Country Accolade Rank 1993 Onyx Billboard United States Hot Rap Artists 1 1993 Onyx Billboard United States Top Billboard 200 Album Artists 64 1993 Onyx Billboard United States Top R&B; Album Artists 20 1993 Onyx Billboard United States Hot 100 Singles Artists 45 1993 Onyx Cashbox United States Top New Groups 4 1996 All We Got Iz Us CMJ New Music Monthly United States The 25 Best Hip-Hop Albums of 1995 17 2014 #WakeDaFucUp XXL United States The 25 Best Hip-Hop Albums of 2014 – 2020 SnowMads Rap.Ru Russia The Best Rap Album of 2019: Readers' Choice 1 ==References== Category:1980s establishments in New York (state) Category:1988 establishments in the United States Category:American rap music groups Category:Musical groups from New York City Category:Musicians from Queens Category:Musical groups established in 1988",
 "title": "Onyx (hip hop group)"
}