{
 "id": "7928",
 "text": "Leonardo Wilhelm DiCaprio (; ; born November 11, 1974) is an American celebrity, actor, movie director, producer and writer. He starred in almost every popular movie, including What's Eating Gilbert Grape, Romeo + Juliet, Titanic, The Man in the Iron Mask, The Beach, Catch Me if You Can, Gangs of New York, The Aviator, The Revenant and Once Upon a Time in Hollywood. His first movie was Critters 3. In 2016, DiCaprio won his first Academy Award for Best Actor for his portrayal of Hugh Glass in The Revenant.Oscars 2016: Leonardo DiCaprio and Brie Larson win as Spotlight shocks ==Personal life== DiCaprio was born in Los Angeles. His father, George, is of Italian and German descent, and his mother, Irmelin, is of German and Russian descent. ==Legacy== Leonardo's name short form Leo was used in Thalapathy Vijay's Leo film official trailer and the film is set to release in North America theatres on 18 October 2023. ==Filmography (selection)== Year Title Role Notes 1991 Critters 3 Josh 1992 Poison Ivy Guy 1993 This Boy's Life Tobias \"Toby\" Wolff What's Eating Gilbert Grape Arnie Grape First Academy Award Nomination 1995 The Quick and The Dead Fee Herod \"The Kid\" The Basketball Diaries Jim Carroll Total Eclipse Arthur Rimbaud 1996 Romeo + Juliet Romeo Montague Marvin's Room Hank 1997 Titanic Jack Dawson This movie won 11 Academy Awards 1998 The Man in the Iron Mask King Louis XIV/Philippe Celebrity Brandon Darrow 2000 The Beach Richard 2001 Don's Plum Derek 2002 Catch Me If You Can Frank William Abagnale Jr. Gangs of New York Amsterdam Vallon 2004 The Aviator Howard Hughes Nominated for Best Actor at 2005 Academy Awards; won a Golden Globe. 2006 The Departed William \"Billy\" Costigan Jr. Nominated for Best Actor at 2007 Golden Globe Blood Diamond Danny Archer Nominated for Best Actor at 2007 Academy Awards and Golden Globe 2007 The 11th Hour Narrator 2008 Body of Lies Roger Ferris Revolutionary Road Frank Wheeler 2010 Shutter Island Edward \"Teddy\" Daniels Hubble Narrator Inception Dominick \"Dom\" Cobb 2011 J. Edgar J. Edgar Hoover 2012 Django Unchained Calvin J. Candie 2013 The Great Gatsby Jay Gatsby The Wolf of Wall Street Jordan Belfort Nominated for Best Actor at 2014 Academy Awards and won Best Actor at Golden Globes 2015 The Revenant Hugh Glass Won Best Actor at 2016 Academy Awards 2019 Once Upon a Time in Hollywood Rick Dalton Nominated for Best Performance by Actor in a Leading Role at 2020 Academy Awards 2023 Killers of the Flower Moon Ernest Burkhart Nominated for Best Actor at 2024 Golden Globes ==Awards and nominations (selection)== ===Academy Award=== * Nominated: Best Supporting Actor, What's Eating Gilbert Grape (1994) * Nominated: Best Actor, The Aviator (2005) * Nominated: Best Actor, Blood Diamond (2007) * Nominated: Best Actor, The Wolf of Wall Street (2014) * WON: Best Actor, The Revenant (2016) * Nominated: Best Actor, Once Upon a Time in Hollywood (2020) ===BAFTA Award=== * Nominated: Best Actor, The Aviator (2005) * Nominated: Best Actor, The Departed (2007) * Nominated: Best Actor, The Wolf of Wall Street (2014) * Won: Best Actor, The Revenant (2016) * Nominated: Best Actor, Don't Look Up (2022) ===Golden Globe Award=== * Nominated: Best Supporting Actor - Motion Picture, What's Eating Gilbert Grape (1994) * Nominated: Best Actor - Motion Picture Drama, Titanic (1998) * Nominated: Best Actor - Motion Picture Drama, Catch Me If You Can (2003) * Won: Best Actor - Motion Picture Drama, The Aviator (2005) * Nominated: Best Actor - Motion Picture Drama, The Departed (2007) * Nominated: Best Actor - Motion Picture Drama, Blood Diamond (2007) * Nominated: Best Performance by an Actor in a Motion Picture – Drama, Revolutionary Road (2008) * Nominated: Best Performance by an Actor in a Motion Picture – Drama, J. Edgar (2011) * Nominated: Best Performance by an Actor in a Supporting Role in a Motion Picture, Django Unchained (2012) * Won: Best Actor in a Motion Picture Musical or Comedy, The Wolf of Wall Street (2014) * Won: Best Actor in a Motion Picture Drama, The Revenant (2016) * Nominated: Best Performance by an Actor in a Motion Picture – Comedy, Don't Look Up (2022) Year Group Award Won Movies/Television series 1991 Young Artist Awards Best Young Actor in a Daytime Series No Santa Barbara 1992 Best Young Actor Co-starring in a Television Series No Growing Pains 1993 Los Angeles Film Critics Association Awards New Generation Award Yes National Board of Review Best Supporting Actor Yes What's Eating Gilbert Grape 1994 Golden Globe Awards Best Performance by an Actor in a Supporting Role in a Motion Picture No Academy Awards Best Actor in a Supporting Role No Chicago Film Critics Association Awards Most Promising Actor Yes 1997 Screen Actors Guild Awards Best Performance by a Cast in a Motion Picture No Marvin's Room Chlotrudis Awards Best Supporting Actor Yes MTV Movie Awards Best On-Screen Duo (with Claire Danes) No Romeo + Juliet Best Male Performance No Best Kiss (with Claire Danes) No Blockbuster Entertainment Awards Favorite Actor Yes Berlin International Film Festival Best Actor Yes 1998 Screen Actors Guild Awards Best Performance by a Cast in a Motion Picture No Titanic Satellite Awards Best Performance by a Leading Actor in a Motion Picture - Drama No Golden Globes Best Performance by an Actor in a Motion Picture - Drama No MTV Movie Awards Best On-Screen Duo (with Kate Winslet) No Best Kiss (with Kate Winslet) No Best Male Performance Yes Blockbuster Entertainment Awards Favorite Actor - Drama Yes 1999 Teen Choice Awards Choice Hissy Fit No Celebrity Razzie Awards Worst Screen Couple Yes The Man in the Iron Mask 2001 Worst Actor No The Beach 2003 MTV Movie Awards Best Kiss (with Cameron Diaz) No Gangs of New York Best Male Performance No Catch Me If You Can Golden Globes Best Performance by an Actor in a Motion Picture - Drama No Visual Effects Society Awards Best Performance by an Actor in a Motion Picture - Drama No Teen Choice Awards Choice Movie Liar Yes 2004 Hollywood Movies Festival Actor of the Year Yes 2005 Visual Effects Society Awards Outstanding Performance by an Actor or Actress in a Visual Effects Film No The Aviator Teen Choice Awards Choice Movie Actor: Drama No Broadcast Film Critics Association Awards Best Actor No Online Film Critics Society Awards Best Actor No Golden Globes Best Performance by an Actor in a Motion Picture - Drama Yes Screen Actors Guild Award Best Performance by a Male Actor in a Leading Role No Best Performance by a Cast in a Motion Picture No BAFTA Awards Best Performance by an Actor in a Leading Role No Academy Awards Best Performance by an Actor in a Leading Role No MTV Movie Awards Best Male Performance Yes 2007 Broadcast Film Critics Association Awards Best Actor No Blood Diamond No The Departed Golden Globes Best Performance by an Actor in a Motion Picture - Drama No Blood Diamond No The Departed Screen Actors Guild Awards Best Performance by a Male Actor in a Leading Role No Blood Diamond Best Performance by a Male Actor in a Supporting Role No The Departed Best Performance by a Cast in a Motion Picture No BAFTA Awards Best Performance by an Actor in a Leading Role No Academy Awards Best Performance by an Actor in a Leading Role No Blood Diamond |- ! colspan=\"3\" style=\"background-color: #DAA520;\" | National Board of Review Award |- |- ! colspan=\"3\" style=\"background-color: #DAA520;\" | Golden Globe Award |- == References == ==Other websites== * Leonardo DiCaprio Official Website * Leonardo DiCaprio Official Eco-site * Leonardo DiCaprio Official MySpace * Official DiCaprio Environmental Eleventh Hour film site * * * * leonardo dicaprio biography Category:1974 births Category:Living people Category:Actors from Los Angeles Category:American movie actors Category:American movie directors Category:American movie producers Category:American television actors Category:American voice actors Category:Movie producers from California Category:Movie directors from California Category:Satellite Award winners Category:Screen Actors Guild Award winners Category:Best Actor Academy Award winners Category:Golden Globe Award winning actors",
 "title": "Leonardo DiCaprio"
}