{
 "id": "793047",
 "text": "Roberto Venturoni (22 October 1945 – 18 September 2011) was an Italian painter, engraver and sculptor. ==Bibliography== * Catalog. I paesaggi di Roberto Venturoni: percezione e comunicativa di una efficace interpretazione, by Carlo Savini, 1987.I paesaggi di Roberto Venturoni: percezione e comunicativa di una efficace interpretazione, by Carlo Savini, 1987. * Monograph, Roberto Venturoni: i paesaggi dell'io; by Dario Micacchi, 1990.Biblioteca di archeologia e storia dell'arte – BiASA, Monograph, Roberto Venturoni: i paesaggi dell'io; by Dario Micacchi, 1990. * Monograph, L'incisione: Roberto Venturoni, by Roberta Perfetti, 1994.L'incisione: Roberto Venturoni, by Roberta Perfetti, 1994 * Monograph, Venturoni: terrecotte, 1999, Edizioni Four For Art, Roma, .Biblioteca di archeologia e storia dell'arte – BiASA, Monograph, Venturoni: terrecotte, Edizioni Four For Art, Roma, 1999. * Monograph, Venturoni: opere astratte 2006.Catalog, Venturoni: opere astratte 2006. * Catalog of Italian sculptors, by Paolo Levi, Editore Giorgio Mondadori, 2006, pp.341. * Catalog, Venturoni: Blu cosmici: Castel Sant'Angelo, 8–10 dicembre 2007.Catalog, Venturoni: Blu cosmici: Castel Sant'Angelo, 8–10 dicembre 2007. * Catalog of Italian sculptors, by Paolo Levi, Editore Giorgio Mondadori, 2008, pp.357. * Catalog, Percorsi d'arte in Italia, by Giorgio Di Genova, , Editore Rubettino, 2016, pp.249. ==Paintings in museums== * Museum of Modern and Contemporary Art in Anticoli Corrado: \"Natura morta con teiera e altri oggetti\", and \"Paesaggio Anticolano\"Website of the Museum of Modern Art in Anticoli Corrado: detail Artists present at Museum between the 19th and 21st centuries Venturoni Roberto, Natura morta con teiera e altri oggetti, Olio su tela, pp.38 . Retrieved 14 July 2021 * Museo Civico delle Cappuccine, Bagnacavallo, Italy,Museo Civico delle Cappuccine by Bagnacavallo, Roberto Venturoni (1945–2011) six artistic prints. ==Related pages== * List of Italian painters ==References== ==Other websites== * Category:1945 births Category:2011 deaths Category:Italian painters Category:Italian sculptors Category:Engravers Category:People from Rome",
 "title": "Roberto Venturoni"
}