{
 "id": "793246",
 "text": "\"Plevne Marşı\" (en. The Plevne March), also \"Osman Paşa Marşı\", is an Ottoman Turkish song written by Mehmet Ali Bey to commemorate Osman Nuri Pasha (or Bey), an Ottoman field marshal who led Ottoman troops in the Siege of Plevna. Dikran Çuhacıyan wrote it.Büyük Larousse Sözlük ve Ansiklopedisi (1986), v. 18, c. 9433, Gelişim Yayınları.Osmanlı Marşları: The Ottoman Military Music in 78 rpm Records, Muammer Karabey Koleksiyonu Book & CD, Kalan.Üngör, Etem (1966). Türk marşları. Türk Kültürünü Araştırma Enstitüsü. p. 176.And, Metin (1976). Osmanlı Tiyatrosu. Ankara Üniversitesi, Dil ve Tarih-Coğrafya Fakültesi. p. s. 83. ==Full lyrics== Ottoman Turkish lyrics Turkish lyrics Figurative English translation طونا نهرى آقمام دييور، اطرافمى يیقمام دييور، شانى بيوك عثمان پاشا، پلونه‌دن چیقمام دييور. دشمن طونایی آتلادی، قره‌قوللرى يوقلادی، عثمان پاشانك قولنده، بش بيك طوپ بردن پاتلادی… طونا نهرى آقار گيدر، اطرافنی يیقار گيدر، شانى بيوك عثمان پاشا، دشمنلرى قیرار گيدر… قليجمى اوردم طاشه، طاش يارلدى باشدن باشه، نامى بيوك عثمان پاشا، عسكرکله بيکلر ياشا. Tuna Nehri akmam diyor, Etrafımı yıkmam diyor, Şanı büyük Osman Paşa, Plevne'den çıkmam diyor. Düşman Tuna'yı atladı, Karakolları yokladı, Osman Paşa'nın kolunda, Beş bin top birden patladı. Tuna Nehri akar gider, Etrafını yıkar gider, Şanı büyük Osman Paşa, Düşmanları kırar gider. Kılıcımı vurdum taşa, Taş yarıldı baştan başa, Namı büyük Osman Paşa, Askerinle binler yaşa.A RESEARH ON FOLK-SONGS OF OSMAN PASHA (PDF). Önal, MN. turkoloji.cu.edu.tr.Plevne Marşı - TSK Armoni Mızıkası - Marş Sözleri - Dinle - İndir pembebere.com. I shan’t flow, the Danube saith; I shan’t its surroundings raze, it saith. Osman Paşa, man of most glorious, I shan’t ditch Plevna, he saith. The foe the Danube cross’d And army frontiers pester’d. By commands of Osman Paşa, Five-thousand cannons roar’d. The Danube floweth, ’Round it washeth. The great Osman Paşa The enemies crusheth. My sword I hit, The stone was split, O Great Osman Paşa, With Thy soldiers exult. ==References== Category:1910s in the Ottoman Empire Category:Turkey Category:1910s songs",
 "title": "Plevna March"
}