{
 "id": "793647",
 "text": "In September and October 2020, multiple people at the White House tested positive for SARS-CoV-2, the virus that causes COVID-19. ==Background== On September16, it was reported that at least one unnamed staffer had tested positive. On October 1, President Donald Trump, his wife Melania Trump, press advisor Hope Hicks, presidential campaign manager Bill Stepien, and former White House counselor Kellyanne Conway tested positive for the coronavirus. Claudia Conway, the daughter of Kellyanne Conway, announced on Oct 4 that she had tested positive as well. On October5, White House Press Secretary Kayleigh McEnany announced she had also tested positive. Trump tested positive days after the first presidential debate against Joe Biden in Cleveland, Ohio. Around eleven people tested positive who worked at the debates in Cleveland. Some of Trump's personal aides who prepared him for the debates also tested positive. Many of the cases were rooted to be at the announcement of Amy Coney Barrett's nomination to the United States Supreme Court on September 26 and at a Trump campaign fundraiser event in Bedminster, New Jersey on October 1. That same day, it was revealed that Senators Thom Tillis and Mike Lee both tested positive, as well as University of Notre Dame president John I. Jenkins. Three members of the White House press corps, including Michael D. Shear, also tested positive. On October 2, Trump was hospitalized at Walter Reed National Military Medical Center. Also on October 2, many individuals connected to the White House were diagnosed with COVID-19. ==Trump response== On October 4, Trump left the hospital in order to ride past a gathering of supporters at the medical center, waving from the back seat of an SUV, before returning to the hospital. This was seen as a political stunt and many criticized Trump for possible putting other people at risk for getting infected. Many Secret Service agents were upset at Trump as he could have infected them with one agent saying: \"He's not even pretending to care now\".Martin Kaste, Secret Service Agents Frustrated With Trump's Unnecessary Coronavirus Risks, NPR (October 6, 2020). ==Reaction== The incident has been compared to the non- fatal shooting of Ronald Reagan in 1981, which saw similar concerns over continuity of government amid incapacitation of the president. Stock markets briefly fell more than 1.5 percent after Trump announced his diagnosis, but they cut their losses after Pelosi said she anticipated an economic relief deal. The S&P; 500 Index ended the day down almost 1 percent. Twitter announced that any posts wishing for Trump's death would be removed for violating the platform's terms of service. Congresswomen Rashida Tlaib, Alexandria Ocasio-Cortez, Ilhan Omar, and Ayanna Pressley criticized Twitter for not taking threats against them seriously, pointing to longstanding posts calling for their deaths that had not been removed. Facebook and TikTok announced similar policies. ==Tested negative== Vice President Mike Pence and his wife Karen, Presidential candidate Joe Biden, Biden's running mate Kamala Harris, Biden's wife Jill Biden, Attorney General William Barr, and Trump Supreme Court nominee Amy Coney Barrett all tested negative in the day following public revelation of the outbreak. Many of Trump's family members, including Ivanka Trump, Barron Trump, Jared Kushner, Eric Trump, and Donald Trump Jr. also received a negative result. ==Cases== Timeline of event attendance by people who have tested positive for COVID-19 Patient Position Was event attended by the patient? Was event attended by the patient? Was event attended by the patient? Was event attended by the patient? Was event attended by the patient? Current status Date the diagnosis was first reported publicly Patient Position Barrett nomination Sep 26 Gold Star Day Sep 27 Ohio debate Sep 29 Duluth rally Sep 30 Bedminster fundraiser Oct 1 Current status Date the diagnosis was first reported publicly Multiple unidentified staffers White House staffers Unknown Unknown Unknown Unknown Unknown data-sort-value=\"3: Positive\" Head of White House Security Office Diagnosed before Barrett nomination event, hospitalized in September Diagnosed before Barrett nomination event, hospitalized in September Diagnosed before Barrett nomination event, hospitalized in September Diagnosed before Barrett nomination event, hospitalized in September Diagnosed before Barrett nomination event, hospitalized in September data-sort-value=\"1: Hospitalized\" Senior Counselor to the President data-sort-value=\"2: Positive, symptomatic\" (R) 45th President of the United States data-sort-value=\"1: Hospitalized\" (R) United States Senator from Utah data-sort-value=\"2: Positive, symptomatic\" (R) United States Senator from North Carolina data-sort-value=\"2: Positive, symptomatic\" First Lady of the United States data-sort-value=\"2: Positive, symptomatic\" Former Counselor to the President data-sort-value=\"2: Positive, symptomatic\" Chair of the Republican National Committee Attended D.C. fundraiser with Trump on Sep 25 Attended D.C. fundraiser with Trump on Sep 25 Attended D.C. fundraiser with Trump on Sep 25 Attended D.C. fundraiser with Trump on Sep 25 Attended D.C. fundraiser with Trump on Sep 25 data-sort- value=\"2: Positive, symptomatic\" & wife White House correspondent for The New York Times Michael Shear was at the White House on Sep 26 only for a required COVID-19 test in advance of traveling with Trump and Kayleigh McEnany to the Pennsylvania rally later that day Michael Shear was at the White House on Sep 26 only for a required COVID-19 test in advance of traveling with Trump and Kayleigh McEnany to the Pennsylvania rally later that day Michael Shear was at the White House on Sep 26 only for a required COVID-19 test in advance of traveling with Trump and Kayleigh McEnany to the Pennsylvania rally later that day Michael Shear was at the White House on Sep 26 only for a required COVID-19 test in advance of traveling with Trump and Kayleigh McEnany to the Pennsylvania rally later that day Michael Shear was at the White House on Sep 26 only for a required COVID-19 test in advance of traveling with Trump and Kayleigh McEnany to the Pennsylvania rally later that day data-sort-value=\"2: Positive, symptomatic\" Trump campaign manager Traveled to Cleveland debate aboard Air Force One with President, First Lady, Hope Hicks, and Steven Miller Traveled to Cleveland debate aboard Air Force One with President, First Lady, Hope Hicks, and Steven Miller Traveled to Cleveland debate aboard Air Force One with President, First Lady, Hope Hicks, and Steven Miller Traveled to Cleveland debate aboard Air Force One with President, First Lady, Hope Hicks, and Steven Miller Traveled to Cleveland debate aboard Air Force One with President, First Lady, Hope Hicks, and Steven Miller data-sort-value=\"2: Positive, symptomatic\" White House press room photojournalist data-sort- value=\"2: Positive, symptomatic\" One unidentified journalist White House press room journalist Unknown Unknown Unknown Unknown data-sort-value=\"3: Positive\" 11 unidentified persons Debate preparation staff or media data- sort-value=\"3: Positive\" Body man to Donald Trump data-sort-value=\"4: Cancelled\" data-sort-value=\"3: Positive\" (R) Former Governor of New Jersey Exposed to Trump at Amy Coney Barrett meeting on Sep 26, at debate prep meetings and a press conference on Sep 27 Exposed to Trump at Amy Coney Barrett meeting on Sep 26, at debate prep meetings and a press conference on Sep 27 Exposed to Trump at Amy Coney Barrett meeting on Sep 26, at debate prep meetings and a press conference on Sep 27 Exposed to Trump at Amy Coney Barrett meeting on Sep 26, at debate prep meetings and a press conference on Sep 27 data-sort-value=\"1: Hospitalized\" President of the University of Notre Dame data-sort-value=\"2: Positive, symptomatic\" (R) United States Senator from Wisconsin Exposed to unnamed individual on Sep 14 Exposed to unnamed individual on Sep 14 Exposed to unnamed individual on Sep 14 Exposed to unnamed individual on Sep 14 Exposed to unnamed individual on Sep 14 data- sort-value=\"4: Positive, Asymptomatic\" Daughter of Kellyanne Conway Exposed to mother Exposed to mother Exposed to mother Exposed to mother Exposed to mother data-sort-value=\"2: Positive, symptomatic\" White House press secretary data-sort-value=\"4: Cancelled\" data-sort-value=\"5: Positive\" Senior pastor of Harvest Christian Fellowship data-sort-value=\"2: Positive, symptomatic\" Principal assistant press secretary data-sort-value=\"5: Positive\" Assistant press secretary data-sort-value=\"5: Positive\" Two unidentified staffers White House residence staff Regularly exposed to First Family Regularly exposed to First Family Regularly exposed to First Family Regularly exposed to First Family Regularly exposed to First Family data-sort-value=\"5: Positive\" U.S. Coast Guard aide to the president data-sort-value=\"5: Positive\" One unidentified military personnel President's valet Regularly exposed to Trump Regularly exposed to Trump Regularly exposed to Trump Regularly exposed to Trump Regularly exposed to Trump data-sort-value=\"5: Positive\" Vice commandant of the Coast Guard data-sort-value=\"2: Positive, symptomatic\" Assistant White House Press Secretary data-sort-value=\"5: Positive\" Senior Advisor to the President data-sort-value=\"5: Positive\" (D) United States Representative from CA-24 Reportedly exposed to Sen. Mike Lee Reportedly exposed to Sen. Mike Lee Reportedly exposed to Sen. Mike Lee Reportedly exposed to Sen. Mike Lee Reportedly exposed to Sen. Mike Lee data-sort- value=\"2: Positive, symptomatic\" Oct 6 Gen. Marine Corps’ assistant commandant Exposed to Gen. Milley Exposed to Gen. Milley Exposed to Gen. Milley Exposed to Gen. Milley Exposed to Gen. Milley data-sort-value=\"2: Positive, symptomatic\" Oct 7 US Representative from IL-12 Exposed to Mike Lee Exposed to Mike Lee Exposed to Mike Lee Exposed to Mike Lee Exposed to Mike Lee data- sort-value=\"2: Positive, symptomatic\" Oct 9 ==References== Category:September 2020 events Category:October 2020 events Category:Donald Trump Category:COVID-19 pandemic Category:2020 in the United States",
 "title": "White House COVID-19 outbreak"
}