{
 "id": "79360",
 "text": "The Labor Day Hurricane of 1935 was the strongest tropical cyclone during the 1935 Atlantic hurricane season. The second tropical cyclone, second hurricane, and second intense hurricane of the season was the most intense Atlantic hurricane that affected the United States, and it remains the first of three Category 5 hurricanes that struck the country. After forming as a weak tropical storm east of the Bahamas on August 29, it slowly proceeded westward, became a hurricane on September 1, and underwent rapid intensification prior to striking the upper Florida Keys on September 2. After landfall at its peak intensity, it continued northwest along the Florida west coast, and it weakened prior to landfall near Cedar Key on September 4. The large and strong hurricane caused severe damage in the upper Florida Keys, and a storm surge about 18 to 20 feet affected the region. The hurricane's strong winds destroyed most of the buildings in the Islamorada area, and many World War I veteran workers were killed by the storm surge. Portions of the Key West Extension of the Florida East Coast Railroad were severely damaged or destroyed. The hurricane also caused additional damage in northwest Florida, Georgia, and the Carolinas. In total, more than 400 people were killed. ==Other websites== * Atlantic Oceanographic and Meteorological Laboratory ** Excerpts from the Labor Day 1935 Hurricane Monthly Weather Review Article * Images of historic Florida Hurricanes (State Archives of Florida) * Florida Keys History Museum ** Key West Memorial ** Hurricanes history * Major Daniel C. Main killed in Hurricane * Monroe County listings at National Register of Historic Places * Florida Keys Memorial at Florida's Office of Cultural and Historical Programs *List of 56 victims Category:1935 in the United States Category:Category 5 Atlantic hurricanes Category:Hurricanes in the United States Category:20th century in the Bahamas Category:20th century in Florida Category:20th century in Georgia (U.S. state) Category:20th century in South Carolina Category:1930s in North Carolina Category:20th century in Virginia",
 "title": "1935 Labor Day hurricane"
}