{
 "id": "794346",
 "text": "Patricia Leavy (born June 13, 1975) is an American sociologist, novelist, public intellectual, and arts advocate. She has published more than fifty fiction and non-fiction books. Leavy promotes an arts-based research paradigm which combines the arts and sciences. She is the co-founder and former co- editor-in-chief of Art/Research International: A Transdisciplinary Journal. == Early life and education == Leavy earned a Ph.D. in sociology from Boston College. == Career == She was an associate professor of sociology, founding director of gender studies, and chairperson of sociology and criminology at Stonehill College from 2002 to 2012. She has also taught at Boston College, Northeastern University, and Curry College. Leavy left academia in 2012 to be an independent scholar, public intellectual, and novelist. She developed ‘social fiction’ which has influenced the careers of many scholars around the world. === Author and novelist === Leavy has written more than fifty books, including both fiction and non-fiction books. She is the creator and former editor for numerous book series, including Art Plus (Brill/Sense), A Little Bit About (Brill/Sense), Personal/Public Scholarship (Brill/Sense), Teaching Writing (Brill/Sense), Teaching Race & Ethnicity (Brill/Sense), Teaching Gender (Brill/Sense), Social Fictions (Brill/Sense), and Research to the Point and Understanding Qualitative Research (Oxford University Press). She is the editor for the Qualitative Methods How-To Guides (Guilford Press). List of Selected Works Year Published Title Publisher Genre 2011 Low-Fat Love Sense Publishers Fiction 2013 American Circumstance Sense Publishers Fiction 2015 Low-Fat Love, Expanded Anniversary Edition Sense Publishers Fiction 2016 Blue Sense Publishers Fiction 2016 American Circumstance: Anniversary Edition Sense Publishers Fiction 2016 Low-Fat Love Stories Sense Publishers Fiction 2019 Spark Guilford Press Fiction 2020 Film Brill/Sense Fiction 2020 Candy Floss Collection Brill/Sense Fiction 2021 Low-Fat Love: 10th Anniversary Edition Paper Stars Press Fiction 2023 Film Blue Paper Stars Press Fiction 2023 Hollyland She Writes Press Fiction 2023 The Location Shoot She Writes Press Fiction 2024 After the Red Carpet She Writes Press Fiction 2025 Shooting Stars Above (Book 1 in The Celestial Bodies Romances) She Writes Press Fiction 2003 Approaches to Qualitative Research: A Reader on Theory and Practice Oxford University Press Non-fiction 2005 The Practice of Qualitative Research SAGE Publications, Inc Non-fiction 2006 Feminist Research Practice: A Primer SAGE Publications, Inc Non-fiction 2006 Emergent Methods in Social Research SAGE Publications, Inc Non-fiction 2007 Iconic Events: Media, Politics, and Power in Retelling History Lexington Books Non-fiction 2008 Handbook of Emergent Methods Guilford Press Non-fiction 2009 Method Meets Art: Arts Based Research Practice Guilford Press Non-fiction 2009 Hybrid Identities: Theoretical and Empirical Examinations Brill Publishers Non-fiction 2010 The Practice of Qualitative Research (Second Edition) SAGE Publications, Inc. Non-fiction 2011 Essentials of Transdisciplinary Research: Using Problem Centered Methodologies Routledge Non-fiction 2014 The Oxford Handbook of Qualitative Research Oxford University Press Non-fiction 2014 Gender and Pop Culture: A Text Reader Sense Publishers Non-fiction 2015 Method Meets Art: Arts Based Research Practice (Second Edition) Guilford Press Non-fiction 2017 Research Design: Quantitative, Qualitative, Mixed Methods, Arts-Based, and Community-Based Participatory Research Approaches Guilford Press Non-fiction 2018 Contemporary Feminist Research: From Theory to Practice Guilford Press Non-fiction 2019 Handbook of Arts-Based Research Guilford Press Non-fiction 2019 The Oxford Handbook of Methods for Public Scholarship Oxford University Press Non-fiction 2020 The Oxford Handbook of Qualitative Research (Second Edition) Oxford University Press Non-fiction 2020 Method Meets Art: Arts-based Research Practice (Third Edition) Guilford Press Non-fiction 2022 Re/Invention: Methods of Social Fiction Guilford Press Non-fiction 2023 Research Design: Quantitative, Qualitative, Mixed Methods, Arts-Based, and Community-Based Participatory Research Approaches Second Edition Guilford Press Non-fiction 2025 Handbook of Arts-Based Research Second Edition Guilford Press Non-fiction === Public speaking === She was a keynote speaker at the Interdisciplinary Social Sciences Conference in Barcelona, Spain, in 2012.[1][18]The next year, she was invited as a keynote speaker by the New Directions in the Humanities conference and the Arts in Society conference in Budapest, Hungary. In 2015, she gave a keynote address in Florida at the Qualitative Report conference and was invited again for the same conference in 2020. In 2017, she appeared at the “NYU Forum on Ethnodrama” at New York University as a part of the keynote conversation. Also in 2017, she gave a keynote address at The World Chinese Art Education Symposium in Ningbo, China. In 2018, Leavy was a keynote speaker at the “Arts as an Agent for Social Change conference at McGill University in Montreal and also delivered the keynote address at the “Arts-Based Research Symposium” at SUNY-New Paltz. To date, she has delivered dozens of keynotes at conferences around the world. === Awards and recognition === Leavy was named as the “2010 New England Sociologist of the Year” by the New England Sociological Association. She is the recipient of the 2014 Special Achievement Award by the American Creativity Association, the Egon Guba Memorial Keynote Lecture Award by the American Educational Research Association Qualitative SIG, and a 2015 Special Career Award by the International Congress of Qualitative Inquiry. She has received the National Art Education Association 2018 Distinguished Service Outside the Profession Award. She was invited as a fellow in 2015 to the Salzburg Global Seminar Session “The Neuroscience of Art: What are the Sources of Creativity and Innovation?. In 2017, Leavy’s book, Research Design: Quantitative, Qualitative, Mixed Methods, Arts-Based, and Community-Based Participatory Research Approaches was the third-place winner of the American Journal of Nursing Book of the Year Awards in the category nursing research. Leavy’s Privilege Through the Looking-Glass (Sense Publishers) won the USA Best Book Award for Nonfiction Anthologies in 2018. In the same year, Leavy’s Handbook of Arts-Based Research (Guilford Press) won the USA Best Book Award for Education/Academic. In 2018, the “Patricia Leavy Award for Art and Social Justice” was established by SUNY New Paltz. In the same year, she was honored by the National Women’s Hall of Fame, and her book Method Meets Art: Arts-Based Research Practice (Second Edition), received the American Educational Research Association Division D Measurement and Research Methodology Significant Contributions Award. In 2019, Spark received the Living Now Book Award for Adventure Fiction, and it also received the American Fiction Award for Inspirational Fiction. In 2020 Leavy’s book Film received the American Fiction Award for Inspirational Fiction. The same year Leavy’s book Candy Floss Collection (3 novels) received the American Fiction Award for Anthologies. In 2022, Leavy received the Outstanding Achievement in Arts and Learning Award from The American Educational Research Association. In 2024, the London Arts-Based Research Centre established \"The Patricia Leavy Award for Arts-Based Research.\" Leavy is an honorary board member for the LABRC. Leavy's books have received over 100 book awards including American Fiction Awards, Best Book Awards, International Book Awards, Firebird Book Awards, Independent Press Awards, National Indie Excellence Awards, Literary Titan Awards, Living Now Book Awards, Bookfest Awards, and NYC Big Book Awards. == References == Category:1975 births Category:Living people Category:American sociologists Category:American novelists",
 "title": "Patricia Leavy"
}