{
 "id": "794391",
 "text": "The DFL-Supercup or German Super Cup is a one-off football match in Germany between the winners of the Bundesliga and the DFB-Pokal. The DFL-Supercup is run by the Deutsche Fußball Liga (DFL). ==Matches== Below is a list of the Super Cup winners. Since 2010, if one team wins the domestic double, then league runners-up are invited as the second team. Year Bundesliga champions Result DFB-Pokal winners Venue DFB-Supercup 1987 Bayern Munich 2–1 Hamburger SV Waldstadion, Frankfurt 1988 Werder Bremen 2–0 Eintracht Frankfurt Waldstadion, Frankfurt 1989 Bayern Munich 3–4 Borussia Dortmund Fritz-Walter- Stadion, Kaiserslautern 1990 Bayern Munich 4–1 1. FC Kaiserslautern Wildparkstadion, Karlsruhe 1991 1. FC Kaiserslautern 3-1 Werder Bremen Niedersachsenstadion, Hanover 1992 VfB Stuttgart 3–1 Hannover 96 (II) Niedersachsenstadion, Hanover 1993 Werder Bremen 2–2 Bayer Leverkusen Ulrich- Haberland-Stadion, Leverkusen 1994 Bayern Munich 1–3 Werder Bremen Olympiastadion, Munich 1995 Borussia Dortmund 1–0 Borussia Mönchengladbach Rheinstadion, Düsseldorf 1996 Borussia Dortmund 1–1 1. FC Kaiserslautern (II) Carl-Benz-Stadion, Mannheim DFL-Supercup 2010 Bayern Munich 2–0'' Schalke 04 Impuls Arena, Augsburg 2011 Borussia Dortmund 0–0 Schalke 04 Veltins-Arena, Gelsenkirchen 2012 Borussia Dortmund 1–2 Bayern Munich Allianz Arena, Munich 2013 Bayern Munich 2–4 Borussia Dortmund Signal Iduna Park, Dortmund 2014 Bayern Munich 0–2 Borussia Dortmund Signal Iduna Park, Dortmund 2015 Bayern Munich 1–1 VfL Wolfsburg Volkswagen Arena, Wolfsburg 2016 Bayern Munich 2–0 Borussia Dortmund Signal Iduna Park, Dortmund 2017 Bayern Munich 2–2 Borussia Dortmund Signal Iduna Park, Dortmund 2018 Bayern Munich 5–0 Eintracht Frankfurt Commerzbank-Arena, Frankfurt 2019 Bayern Munich 0–2 Borussia Dortmund Signal Iduna Park, Dortmund 2020 Bayern Munich 3–2 Borussia Dortmund Allianz Arena, Munich ==Performances== ===Performance by team=== Team Winners Runners-up Years as Winners Years as Runner-Up Bayern Munich 8 6 1987, 1990, 2010, 2012, 2016, 2017, 2018, 2020 1989, 1994, 2013, 2014, 2015, 2019 Borussia Dortmund 6 5 1989, 1995, 1996, 2013, 2014, 2019 2011, 2012, 2016, 2017, 2020 Werder Bremen 3 1 1988, 1993, 1994 1991 1\\. FC Kaiserslautern 1 2 1991 1990, 1996 Schalke 04 1 1 2011 2010 VfB Stuttgart 1 — 1992 — VfL Wolfsburg 1 — 2015 — Eintracht Frankfurt — 2 — 1988, 2018 Hamburger SV — 1 — 1987 Hannover 96 — 1 — 1992 Bayer Leverkusen — 1 — 1993 Borussia Mönchengladbach — 1 — 1995 ==Unofficial matches== There have been a few times where the German champions met the cup winners, without the match being officially recognized. Year German Champions Result Cup Winners Venue Match name 1941 Schalke 04 2–4 Dresdner SC DSC-Stadion, Dresden Herausforderungskampf 1977 Borussia Mönchengladbach 3–2 Hamburger SV Volksparkstadion, Hamburg Deutscher Supercup 1983 Hamburger SV 1–1 Bayern Munich Olympiastadion, Munich 2008 Bayern Munich 1–2 Borussia Dortmund Signal Iduna Park, Dortmund T-Home Supercup 2009 VfL Wolfsburg 1–2 Werder Bremen Volkswagen Arena, Wolfsburg Volkswagen SuperCup ==Notes== ==References== ==Other websites== * Category:DFL-Supercup Category:Football competitions in Europe Category:Football in Germany",
 "title": "DFL-Supercup"
}