{
 "id": "794477",
 "text": "BMO Field is an outdoor stadium located at Exhibition Place in Toronto, Ontario, Canada. It is the home stadium of MLS team Toronto FC and the CFL team Toronto Argonauts. It was built on the site of the former Exhibition Stadium. The stadium was first opened in 2007. BMO Field hosted matches during the 2007 FIFA U-20 World Cup and 2014 FIFA U-20 Women's World Cup. The stadium has also hosted rugby union matches. ==Construction== BMO Field is the fifth stadium to be built at its exact location at Exhibition Place. The most recent was Exhibition Stadium, which was demolished in 1999. On May 11, 2006, Major League Soccer announced that Toronto FC would join the league as its 13th (and first Canada-based) team in 2007, with BMO Field being its own stadium. ===Recent developments=== In August 2017, Toronto FC II, which normally hosted their games at the Ontario Soccer Centre, announced that it would move its home games to BMO Field and Lamport Stadium, starting with the 2018 season. The team moved their home games to BMO Training Ground for the 2019 season, after they dropped to the USL League One. It will host matches during the 2026 FIFA World Cup. ==History== ===Soccer=== Toronto FC played their first game at BMO Field on April 28, 2007. The grand opening celebration took place on May 12, 2007. The 2008 MLS All-Star Game was held at BMO Field on July 24, 2008 versus Premier League team West Ham United. BMO Field has hosted several MLS Cup matches, and was the first stadium outside of the United States to host the event in 2010, when the Colorado Rapids won 2-1 against FC Dallas. The first MLS home playoff game held at BMO Field saw Toronto FC defeat the Philadelphia Union 3–1 on October 26, 2016. BMO Field hosted the MLS Cup again in 2016, as Toronto FC won the MLS Eastern Championship and hosted the Seattle Sounders in the final. Seattle won the match 5–4 on penalties, after a goalless draw after extra time. On December 9, 2017, BMO Field hosted its second consecutive MLS Cup in 2017. The match was a rematch between Toronto FC and the Seattle Sounders, who played each other in the 2016 MLS Cup. Toronto FC won 2–0, and became the first MLS team to complete a domestic treble, and was the first Canadian team to win the MLS Cup. ====2007 FIFA U-20 World Cup==== BMO Field hosted the 2007 FIFA U-20 World Cup, the first major tournament held at the stadium. The stadium saw the Canadian Under-20 squad once. The stadium also saw six knockout stage games including the Final; which was won by Argentina. Due to FIFA sponsorship regulations, the venue was referred to as the \"National Soccer Stadium\" during the event. Date Team #1 Result Team #2 Round Attendance July 1, 2007 0–3 Group A 20,195 July 2, 2007 2–0 Group C 19,526 July 2, 2007 0–3 Group C 19,526 July 5, 2007 0–1 Group C 19,526 July 5, 2007 2–1 Group C 19,526 July 8, 2007 0–0 Group A 19,526 July 11, 2007 2–1 (AET) Round of 16 19,526 July 12, 2007 3–1 Round of 16 19,526 July 14, 2007 2–1 Quarterfinal 19,526 July 19, 2007 0–3 Semifinal 19,526 July 22, 2007 1–0 3rd Place Match 19,526 July 22, 2007 1–2 Final 19,526 ====2014 FIFA U-20 Women's World Cup==== BMO Field hosted the 2014 FIFA U-20 Women's World Cup. Canada played in Toronto for the first two match days, with Korea DPR, Finland, and Ghana in their group. National Soccer Stadium also hosted a quarterfinal match on August 16. Date Team #1 Result Team #2 Round Attendance August 5, 2014 0–1 Group A 20,195 August 5, 2014 1–2 Group A 20,195 August 8, 2014 3–2 Group A 20,195 August 8, 2014 0–3 Group A 20,195 August 13, 2014 2–1 Group C 20,195 August 13, 2014 0–3 Group D 20,195 August 16, 2014 1–1 (3–1 on penalties) Quarterfinal 20,195 ====2015 CONCACAF Gold Cup==== Date Team #1 Result Team #2 Round Attendance July 14, 2015 1–0 Group B 16,674 July 14, 2015 0–0 Group B 16,674 ===Canadian football=== The Argonauts moved to the renovated BMO Field, starting with the 2016 season. On October 1, 2015, BMO Field was awarded the rights to host the 104th Grey Cup, which was played on November 27, 2016. On June 11, 2016, the Argonauts played their first game at the stadium, a preseason (exhibition) game against the Hamilton Tiger-Cats. The Argos won that game 25–16. On June 23, the Argos played their first regular season game at BMO Field, where they lost 42–20 to the Hamilton Tiger- Cats. ===Hockey=== On January 1, 2017, BMO Field hosted an NHL outdoor game, the NHL Centennial Classic, in honour of the Toronto Maple Leafs' and the NHL's centennial seasons. The Leafs hosted the Detroit Red Wings, in a rematch of the 2014 NHL Winter Classic, which was held three years before. The venue was referred to as \"Exhibition Stadium\" for its duration, as Scotiabank (a direct competitor to BMO), was title sponsor of the event. Date Away team Result Home team Spectators December 31, 2016 Detroit Red Wings Alumni 4–3 Toronto Maple Leafs Alumni – January 1, 2017 Detroit Red Wings 4–5 (OT) Toronto Maple Leafs 40,148 ===Concerts=== As of 6 October 2020, the only music concert at BMO Field was performed by the progressive rock group Genesis on September 7, 2007. ===Milestones=== The first goal at BMO Field was scored by Eddie Johnson for the Kansas City Wizards in a 1–0 Major League Soccer win over home side Toronto FC in the stadium opener on April 28, 2007. The first Toronto FC goal at the stadium was Danny Dichio's first-half strike against Chicago Fire on May 12, 2007 (also his club's first MLS goal). The first goal at BMO Field scored by a Canadian came at the official opening on May 11, 2007, in a U-20 friendly between Canada and Argentina. David Edgar scored a penalty in a 2–1 defeat for Canada, just four minutes after Gómez had scored the first international goal at the stadium. Costa Rica's Víctor Núñez scored the first senior international goal in a 1–1 friendly draw with hosts Canada on September 12, 2007, shortly before Dwayne De Rosario scored Canada's first senior goal at the stadium. The first Toronto FC goal scored by a Canadian at BMO Field was in a June 25, 2007 friendly against Aston Villa of the English Premier League. Andrea Lombardo scored an equalizer at BMO Field's south end to make it 2–2 before Aston Villa ran out 4–2 winners. The first league goal at BMO Field scored by a Canadian came when Miguel Cañizalez scored for Toronto FC in the second minute of their 2–1 defeat to the Columbus Crew on September 22, 2007, snapping an 824-minute MLS goalless streak. The first Toronto FC MLS playoff goal was scored at BMO Field in the 15th minute by Sebastian Giovinco on October 26, 2016 in front of 21,759. In the same game, the first Toronto FC playoff goal scored by a Canadian was by Jonathan Osorio in the 48th minute; the final score was 3–1 over the Philadelphia Union. In Canadian football, the first CFL points scored at BMO Field was a Toronto Argonauts completed touchdown pass caught by Vidal Hazelton, thrown by Logan Kilgore, in a June 11, 2016 exhibition Argos win; final score 25–16. The first CFL regular season points scored at the stadium was a conceded safety touch of 2 points by Canadian Argos kicker/punter Lirim Hajrullahu in a 20–42 loss on June 23. The first regular season points scored by the Argos at BMO Field was a successful field goal kicked by Hajrullahu in the same game. On July 25, the Argonauts won their first regular season game at their new home, defeating the Montreal Alouettes 30–17. ==Attendance records== The largest attendance for any event at the stadium was on January 1, 2017, when the Toronto Maple Leafs hosted the Detroit Red Wings in the NHL Centennial Classic in front of 40,148 people. The largest attendance for a Major League Soccer game was on December 10, 2016, when Toronto FC hosted the Seattle Sounders FC in the 2016 MLS Cup Final in front of 36,045. The largest attendance for a Canadian Football League game was the 104th Grey Cup played before 33,421 on November 27, 2016. ===MLS=== Season Season average Highest gate Lowest gate 2007 20,130 20,522 19,123 2008 20,120 20,461 19,657 2009 20,344 20,902 19,843 2010 20,453 22,108 18,394 2011 20,267 22,453 16,313 2012 18,681 20,071 14,623 2013 17,639 21,700 12,627 2014 22,086 22,591 18,269 2015 23,451 30,226 16,382 2016 26,787 36,045 20,011 2017 27,394 30,584 15,175 2018 26,628 30,799 14,823 2019 25,048 28,989 22,651 ===CFL=== Season Season average Highest gate Lowest gate 2016 16,380 33,4211 12,373 2017 15,015 24,929 11,219 2018 14,211 18,104 10,844 2019 12,789 16,734 9,819 Notes: 1 104th Grey Cup game between the Ottawa Redblacks and Calgary Stampeders. ===Rugby=== The largest crowd for rugby at BMO Field and in Canada occurred when the Canada national rugby union team hosted the New Zealand Māori All Blacks before 22,566 people on November 3, 2013. The Maori All Blacks won the match 40–15. ==Related pages== *List of Canadian Football League stadiums *List of Major League Soccer stadiums *List of soccer stadiums in Canada *Venues of the 2015 Pan American and Parapan American Games ==References== ==Notes== ==Other websites== *BMOField.com *Argonauts BMO Field Site *BMO Field Construction Photos *Video Tour of BMO Field *Cathal Kelly. \"FC or TFC ... the fans will decide\". Toronto Star, April 5, 2007. Category:2007 establishments in Canada Category:Soccer stadiums in Canada Category:Sport in Toronto Category:Buildings and structures in Toronto",
 "title": "BMO Field"
}