{
 "id": "794457",
 "text": "Loona () is a South Korean girl group formed by Blockberry Creative. The group was first shown to the public through a project which began in October 2016. Each of the twelve members were revealed one after another by releasing a single over the next eighteen months. The members formed three sub-units: Loona 1/3, Loona Odd Eye Circle and Loona yyxy. They started as a full group with the extended play, [+ +] (2018), supported by the lead single \"favOriTe\" and the title track \"Hi High.\" ==Name== Loona's English name came from the Hangul letters ㅇㄷㅇㅅㄴ, each an initial consonant in the syllabic blocks that make (Idarui Sonyeo). When changed to ㄴㅇㅇㄷㅅ, it looks like LOONA in the Latin alphabet. ==History== ===2016–2018: Project and Mix Nine=== On October 2, 2016, Blockberry Creative announced through Naver that they would be forming their first girl group through an 18-month long project. Between October 2016 and January 2017, four members (HeeJin, HyunJin, HaSeul, and YeoJin) joined the group. Each member released a single album usually with a solo track and another track performed with other members, under the group's Korean name Idarui Sonyeo.* * * * * In March 2017, the group's first sub-unit, Loona 1/3, was introduced. It was made up of previous members HeeJin, HyunJin, HaSeul and a new member, ViVi. Loona 1/3 released the extended play Love & Live with a single of the same name on March 13, 2017, with a television promotion on SBS's Inkigayo, On April 27, they released a repackaged version of the extended play, titled Love & Evil, with the single \"Sonatine\". Love & Live and its reissued version reached number 10 and 24 respectively on South Korea's Gaon Album Chart. Between April 2017 and July 2017, members ViVi, Kim Lip, JinSoul, and Choerry released their single albums, continuing the same Girl of the Month pattern.* * * * In September 2017, three members, HeeJin, HyunJin and HaSeul, auditioned for JTBC's reality show Mix Nine. HeeJin and HyunJin passed the audition stage making it onto the show. HyunJin was placed Top 18 and HeeJin placed fourth in the finale. The group's second sub-unit, Loona Odd Eye Circle, consisting of JinSoul, Kim Lip and Choerry, released the extended play Mix & Match and its single \"Girl Front\" on September 21, 2017. They began promotions on Mnet's M Countdown. The English version of their song \"Loonatic\" was released on October 23. On October 31, they released a repackaged version of the extended play, titled Max & Match, with three new songs including the single \"Sweet Crazy Love\". Mix & Match and the repackaged version peaked at number 16 and 7 respectively on the Gaon Album Chart. Between November 2017 and January 2018, they released the solo single albums for new members Yves, Chuu, and Go Won. This continued the monthly pattern along with the digital single \"The Carol 2.0\" sung by Yves, Vivi, and Choerry.* * * * In March 2018, they released the solo single album for final member, Hyeju. On May 30, 2018, the group's third sub-unit, Loona yyxy, made their debut with the extended play Beauty & the Beat. The single \"love4eva\" featuring Canadian musician Grimes was released the same day with a music video. The extended play reached number 4 on the Gaon Album Chart. On July 3rd 2018, Penny had solo called ¨friday the 13th¨ ft Hyeju. Unfortunately it is considered lost media. On August 7, 2018, Loona released a digital single titled \"favOriTe\", the group's first song to feature all twelve members. There was a music video focusing on the group's dancing. Penny didn´t make the cut to the group. All of the albums with Penny included is now deleted, or stored in Jaden jeong´s basement. === 2018–present: Debut with [+ +], [X X], [#], and [12:00] === On August 15, Blockberry published the official tracklist for [+ +] (read as plus plus) as their debut extended play as a full group. The extended play included \"Favorite\" and was released on August 20, 2018 alongside the title track, \"Hi High\". It started at number 2 on South Korea's Gaon Album Chart. It was the second best-selling debut album by a girl group in 2018. [+ +] was repackaged as [X X] (read as multiple multiple) on February 19, 2019, with six more tracks, including a new single, \"Butterfly\". On August 17, 2019, Loona made their first appearance in the United States, performing at KCON 2019 in Los Angeles. On December 13, 2019, Loona released a single called \"365\" as an appreciation song for their fans. On January 7, 2020, Blockberry Creative announced that leader HaSeul would not take part in promotions of the next album due to mental health problems. She was said to be diagnosed with “intermittent anxiety symptoms” and would be taking time to take care of her health. On February 5, 2020, Loona released their second EP titled [#] (read as hash), along with the title track \"So What\". Although HaSeul did not help with the title track, her vocals are featured on three of the songs on the album, including \"365\". The EP debuted at number 2 on the Gaon Album Chart, and has become the group's best selling album to date. On March 12, 2020, Loona took their first music show trophy with \"So What\" on Mnet's M Countdown. On September 17, Loona was set to be releasing their third EP titled [12:00] (read as midnight) on October 19. Blockberry Creative said that Haseul will not be a part of the comeback, out of her own decision to take care of the recovery of her health. ==Members== Adapted from their Naver profile: * HeeJin (희진) *HyunJin (현진) *HaSeul (하슬) – leader *YeoJin (여진) *ViVi (비비) *Kim Lip (김립) * JinSoul (진솔) *Choerry (최리) *Yves (이브) * Chuu (츄) * Go Won (고원) * Hyeju (올리비아 혜) ===Timeline=== ===Sub-units=== * Loona 1/3 (이달의 소녀 1/3) – HaSeul (leader of sub-unit), ViVi, HeeJin, HyunJin * Loona Odd Eye Circle (이달의 소녀 오드아이써클) – Kim Lip (leader of sub-unit), JinSoul, Choerry * Loona yyxy (이달의 소녀 yyxy, youth youth by young) – Yves (leader of sub-unit), Chuu, Go Won, Hyeju ==Discography== ;Extended plays * [+ +] (2018) * [#] (2020) * [12:00] (2020) * [&] (2021) * Flip That (2022) ==Tours== ===Headlining=== * Loonabirth – Debut Concert (++) in Seoul (August 19, 2018) * Loonaverse – Comeback Concert (XX) in Seoul (February 16–17, 2019) * 2022 LOONA 1st World Tour [LOONATHEWORLD] (2022) ==Awards and nominations== Award ceremony Year Category Nominee(s) Result Asia Artist Awards 2018 Most Popular Artists (Singer) – Top 50 Loona 2019 Popularity Award (Girl group) Focus Award (Singer) BreakTudo Awards 2019 K-pop Female Group Golden Disc Awards 2019 Rookie Artist Award Popularity Award Genie Music Awards 2018 The Top Artist The Female New Artist Genie Music Popularity Award 2019 The Top Artist The Female New Artist Genie Music Popularity Award Global Popularity Award Korea First Brand Awards 2019 Most Anticipated Female Rookie Idol Melon Music Awards 2018 Best New Artist (Female) Mnet Asian Music Awards 2018 Best New Female Artist Artist of the Year MTN Ad Festival Awards 2019 Commercial Star Rookie MTV Europe Music Awards 2018 Best Korean Act Seoul Music Awards 2019 New Artist Award Popularity Award Hallyu Special Award Soribada Best K-Music Awards 2019 Performance Award ==References== ==Other websites== * * https://www.youtube.com/@SongPenny_Loona Category:2016 establishments in South Korea Category:K-pop music groups Category:Musical groups established in 2016 Category:South Korean girl groups",
 "title": "Loona"
}