{
 "id": "794695",
 "text": "Epaminondas George Aristotle Alexander Stassinopoulos (17 January 1921 - 16 May 2022) was a German-born Greek astrophysicist. He was the head of the Radiation Physics Office and Emeritus Astrophysicist at the National Aeronautics and Space Administration (NASA)'s Goddard Space Flight Center in Greenbelt, Maryland. He was the author of many papers and articles in the field of space radiation. Stassinopoulos was born in Bonn, Germany. He turned 100 in January 2021. Stassinopoulos died on 16 May 2022 in Culver City, California at the age of 101.Epaminondas George Stassinopoulos ==Works== * Stassinopoulos, E. , Stauffer, C. , & Brucker, G. (1998). Miniature high-let radiation spectrometer for space and avionics applications. Nuclear Inst. and Methods in Physics Research, a, 416(2), 531-535. * Barth, J. , Dyer, C. , & Stassinopoulos, E. (2003). Space, atmospheric, and terrestrial radiation environments. IEEE Transactions on Nuclear Science, 50(3), 466-482. * Stassinopoulos, E. , Brucker, G. , Adolphsen, J. , & Barth, J. (1996). Radiation-induced anomalies in satellites. Journal of Spacecraft and Rockets, 33(6), 877-882. * Xapsos, M. , Huston, S. , Barth, J. , & Stassinopoulos, E. (2002). Probabilistic model for low-altitude trapped-proton fluxes. IEEE Transactions on Nuclear Science, 49(6), 2776-2781. * Xapsos, M. , Stauffer, C. , Gee, G. , Barth, J. , Stassinopoulos, E. , et al. (2004). Model for solar proton risk assessment. IEEE Transactions on Nuclear Science, 51(6), 3394-3398. * Stassinopoulos, E. , Brucker, G. , Nakamura, D. , Stauffer, C. , Gee, G. , et al. (1996). Solar flare proton evaluation at geostationary orbits for engineering applications. IEEE Transactions on Nuclear Science, 43(2), 369-382. * Stassinopoulos, E. G. et al. The Liulin-3m Radiometer for Measuring Particle Doses in Space and on Aircraft NASA TM-2002-21003, February 2002. NTRS 20020045323 * Stassinopoulos, E. G. Measurements et. al. Measurements of Radiation Exposure on Commercial Aircraft with the Liulin-3m Instrument NTRS 1999109154, p. 82, 1998. * Stassinopoulos, E. G. \"The Earth's Trapped and Transient Space Radiation Environment\" in Terrestrial Space Radiation and Its Biological Effects, NATO ASI Series A: Life Sciences. v.154 Plenum Press, 1987. Edited by Percival D. McCormack, Charles E. Swenberg and Horst Bücker ==References== Category:1921 births Category:2022 deaths Category:Greek scientists Category:German astronomers Category:German physicists Category:Scientists from Bonn Category:German centenarians",
 "title": "Epaminondas Stassinopoulos"
}