{
 "id": "794648",
 "text": "The New York State Assembly is the lower house of the New York State Legislature, the New York State Senate being the upper house. There are 150 seats in the Assembly. Assembly members serve two-year terms with no term limits. The Assembly meets at the State Capitol in Albany. It is currently controlled by the Democratic Party. ==Leadership== Position Name Party District Speaker Carl Heastie Democratic 83 Majority Leader Crystal Peoples- Stokes Democratic 141 Minority Leader William Barclay Republican 120 ==Composition== The Assembly has been controlled by the Democratic Party since 1975. As of October 2020, the Democrats hold 101 of the Assembly's 150 seats. Affiliation Party (Shading indicates Majority Conference) Party (Shading indicates Majority Conference) Party (Shading indicates Majority Conference) Party (Shading indicates Majority Conference) Party (Shading indicates Majority Conference) Total Affiliation Total Affiliation Democratic Democratic Ind. Republican Con Total Vacant End 2015–16 session 104 104 1 41 1 147 3 Start 2017–18 session 106 106 1 43 0 150 0 End 2017-2018 session 102 1Asm. Erik Bohen (a registered Democrat who won an April 24, 2018 special election on the Republican Party line) was not a member of any caucus during his Assembly tenure. 1 42 0 146 4 Start 2019-20 session 105 105 1 44 0 150 0 January 2020 104 104 1 43 0 148 2 February 2020 103 103 1 43 0 147 3 June 2020 101 101 1 43 0 145 5 Latest voting share ==Members of the New York State Assembly== District Member Party First elected Counties 1 Fred Thiele Ind 1995+ Suffolk 2 Anthony Palumbo Rep 2013+ Suffolk 3 Joe DeStefano Rep 2018 Suffolk 4 Steve Englebright Dem 1992+ Suffolk 5 Douglas M. Smith Rep 2018+ Suffolk 6 Philip Ramos Dem 2002 Suffolk 7 Andrew Garbarino Rep 2012 Suffolk 8 Michael J. Fitzpatrick Rep 2002 Suffolk 9 Mike LiPetri Rep 2018 Nassau, Suffolk 10 Steve Stern Dem 2018+ Suffolk 11 Kimberly Jean-Pierre Dem 2014 Suffolk 12 Keith Brown Rep 2020+ Suffolk 13 Charles D. Lavine Dem 2004 Nassau 14 David McDonough Rep 2002+ Nassau 15 Michael Montesano Rep 2010+ Nassau 16 Anthony D'Urso Dem 2016 Nassau 17 John Mikulin Rep 2018+ Nassau 18 Taylor Darling Dem 2018 Nassau 19 Ed Ra Rep 2010 Nassau 20 Melissa Miller Rep 2016 Nassau 21 Judy Griffin Dem 2018 Nassau 22 Michaelle C. Solages Dem 2012 Nassau 23 Stacey Pheffer Amato Dem 2016 Queens 24 David Weprin Dem 2010+ Queens 25 Nily Rozic Dem 2012 Queens 26 Edward Braunstein Dem 2010 Queens 27 Daniel Rosenthal Dem 2017+ Queens 28 Andrew Hevesi Dem 2005+ Queens 29 Alicia Hyndman Dem 2015+ Queens 30 Brian Barnwell Dem 2016 Queens 31 Khaleel Anderson Dem 2020 Queens 32 Vivian E. Cook Dem 1990 Queens 33 Clyde Vanel Dem 2016+ Queens 34 Michael DenDekker Dem 2008 Queens 35 Jeffrion L. Aubry Dem 1992+ Queens 36 Aravella Simotas Dem 2010 Queens 37 Catherine Nolan Dem 1984 Queens 38 Michael G. Miller Dem 2009+ Queens 39 Catalina Cruz Dem 2018 Queens 40 Ron Kim Dem 2012 Queens 41 Helene Weinstein Dem 1980 Kings 42 Rodneyse Bichotte Dem 2014 Kings 43 Diana Richardson DemThough Richardson was elected on the Working Families Party line, she is a registered Democrat. 2015+ Kings 44 Robert Carroll Dem 2016 Kings 45 Steven Cymbrowitz Dem 2000 Kings 46 Mathylde Frontus Dem 2018 Kings 47 William Colton Dem 1996 Kings 48 Simcha Eichenstein Dem 2018 Kings 49 Peter J. Abbate Jr. Dem 1986 Kings 50 Joseph R. Lentol Dem 1972 Kings 51 Félix W. Ortiz Dem 1994 Kings 52 Jo Anne Simon Dem 2014 Kings 53 Maritza Davila Dem 2013+ Kings 54 Erik Martin Dilan Dem 2014 Kings 55 Latrice Walker Dem 2014 Kings 56 Tremaine Wright Dem 2016 Kings 57 Walter T. Mosley Dem 2012 Kings 58 N. Nick Perry Dem 1992 Kings 59 Jaime Williams Dem 2016+ Kings 60 Charles Barron Dem 2014 Kings 61 Charles Fall Dem 2018 Richmond 62 Michael Reilly Rep 2018 Richmond 63 Michael Cusick Dem 2002 Richmond 64 Nicole Malliotakis Rep 2010 Kings, Richmond 65 Yuh-Line Niou Dem 2016 New York 66 Deborah J. Glick Dem 1990 New York 67 Linda Rosenthal Dem 2006+ New York 68 Robert J. Rodriguez Dem 2010 New York 69 Daniel J. O'Donnell Dem 2002 New York 70 Inez Dickens Dem 2016 New York 71 Al Taylor Dem 2017+ New York 72 Carmen De La Rosa Dem 2016 New York 73 Dan Quart Dem 2011+ New York 74 Harvey Epstein Dem 2018+ New York 75 Richard N. Gottfried Dem 1970 New York 76 Rebecca Seawright Dem 2014 New York 77 Latoya Joyner Dem 2014 Bronx 78 Jose Rivera Dem 2000 Bronx 79 Michael Blake Dem 2014 Bronx 80 Nathalia Fernandez Dem 2018+ Bronx 81 Jeffrey Dinowitz Dem 1994+ Bronx 82 Michael Benedetto Dem 2004 Bronx 83 Carl Heastie Dem 2000 Bronx 84 Carmen E. Arroyo Dem 1994+ Bronx 85 Kenny Burgos Dem 2020 Bronx 86 Victor M. Pichardo Dem 2013+ Bronx 87 Karines Reyes Dem 2018 Bronx 88 Amy Paulin Dem 2000 Westchester 89 J. Gary Pretlow Dem 1992 Westchester 90 Nader Sayegh Dem 2018 Westchester 91 Steven Otis Dem 2012 Westchester 92 Thomas J. Abinanti Dem 2010 Westchester 93 David Buchwald Dem 2012 Westchester 94 Kevin Byrne Rep 2016 Westchester, Putnam 95 Sandy Galef Dem 1992 Westchester, Putnam 96 Kenneth Zebrowski Jr. Dem 2007+ Rockland 97 Ellen Jaffee Dem 2006 Rockland 98 Karl A. Brabenec Rep 2014 Orange, Rockland 99 Colin Schmitt Rep 2018 Orange, Rockland 100 Aileen Gunther Dem 2003+ Orange, Sullivan 101 Brian Miller Rep 2016 Delaware, Herkimer, Oneida, Orange, Otsego, Sullivan, Ulster 102 Christopher Tague Rep 2018+ Albany, Columbia, Delaware, Greene, Otsego, Schoharie, Ulster 103 Kevin A. Cahill Dem 1998 Dutchess, Ulster 104 Jonathan Jacobson Dem 2018+ Dutchess, Orange, Ulster 105 Kieran Lalor Rep 2012 Dutchess 106 Didi Barrett Dem 2012+ Columbia, Dutchess 107 Jacob Ashby Rep 2018+ Columbia, Rensselaer, Washington 108 John T. McDonald III Dem 2012 Albany, Rensselaer, Saratoga 109 Patricia Fahy Dem 2012 Albany 110 Phillip Steck Dem 2012 Albany, Schenectady 111 Angelo Santabarbara Dem 2012 Albany, Montgomery, Schenectady 112 Mary Beth Walsh Rep 2016 Saratoga, Schenectady 113 Carrie Woerner Dem 2014 Saratoga, Washington 114 Dan Stec Rep 2012 Essex, Saratoga, Warren, Washington 115 Billy Jones Dem 2016 Clinton, Franklin, St. Lawrence 116 Mark Walczyk Rep 2018 Jefferson, St. Lawrence 117 Ken Blankenbush Rep 2010 Jefferson, Lewis, Oneida, St. Lawrence 118 Robert Smullen Rep 2018 Fulton, Hamilton, Herkimer, Oneida, St. Lawrence 119 Marianne Buttenschon Dem 2018 Herkimer, Oneida 120 William A. Barclay Rep 2002 Jefferson, Onondaga, Oswego 121 John Salka Rep 2018 Madison, Oneida, Otsego 122 Clifford W. Crouch Rep 1995+ Broome, Chenango, Delaware, Otsego 123 Donna Lupardo Dem 2004 Broome 124 Christopher S. Friend Rep 2010 Broome, Chemung, Tioga 125 Barbara Lifton Dem 2002 Cortland, Tompkins 126 Gary Finch Rep 1999+ Cayuga, Chenango, Cortland, Onondaga 127 Albert A. Stirpe Jr. Dem 2012 Onondaga 128 Pamela Hunter Dem 2015+ Onondaga 129 William Magnarelli Dem 1998 Onondaga 130 Brian Manktelow Rep 2018 Cayuga, Oswego, Wayne 131 Brian Kolb Rep 2000+ Ontario, Seneca 132 Phil Palmesano Rep 2010 Chemung, Schuyler, Seneca, Steuben, Yates 133 Marjorie Byrnes Rep 2018 Livingston, Monroe, Steuben 134 Peter Lawrence Rep 2014 Monroe 135 Mark C. Johns Rep 2010 Monroe 136 Sarah Clark Dem 2020 Monroe 137 Demond Meeks Dem 2020 Monroe 138 Harry Bronson Dem 2010 Monroe 139 Stephen Hawley Rep 2006+ Genesee, Monroe, Orleans 140 Robin Schimminger Dem 1976 Erie, Niagara 141 Crystal Peoples-Stokes Dem 2002 Erie 142 Patrick B. Burke Dem 2018 Erie 143 Monica P. Wallace Dem 2016 Erie 144 Michael Norris Rep 2016 Erie, Niagara, Orleans 145 Angelo Morinello Rep 2016 Erie, Niagara 146 Karen McMahon Dem 2018 Erie, Niagara 147 David DiPietro Rep 2012 Erie, Wyoming 148 Joseph Giglio Rep 2005+ Allegany, Cattaraugus, Steuben 149 Sean Ryan Dem 2011 Erie 150 Andy Goodell Rep 2010 Chautauqua *+Elected in a special election ==Notes== ==References== Category:Government of New York (state) Category:State lower houses in the United States",
 "title": "New York State Assembly"
}