{
 "id": "795134",
 "text": "The territory of Luxembourg has been ruled successively by counts, dukes and grand dukes. It was part of the medieval Kingdom of Germany, and later the Holy Roman Empire until it became a sovereign state in 1815. ==Counts of Luxembourg== ===House of Ardenne–Luxembourg=== Image Name Date of birth Date of death Reign Relationship with predecessor Siegfried 922 28 October 998 963 – 28 October 998 Henry I 964 27 February 1026 28 October 998 – 27 February 1026 his son Henry II 1007 16 October 1047 27 February 1026 – 16 October 1047 his nephew Giselbert 1007 14 August 1059 16 October 1047 – 14 August 1059 his brother Conrad I 1040 8 August 1086 14 August 1059 – 8 August 1086 his son Henry III 1070 1096 8 August 1086 – 1096 William I 1081 1131 1096 – 1131 his brother Conrad II 1106 1136 1131 – 1136 his son Ermesinde I 1080 1143 1136 – 1136 his aunt ===House of Luxembourg–Namur=== Image Name Date of birth Date of death Reign Relationship with predecessor Henry IV the Blind 1112 14 August 1196 1136 – 14 August 1196 her son ===House of Hohenstaufen=== Image Name Date of birth Date of death Reign Relationship with predecessor Otto June/July 1170 13 January 1200 1196 – 1197 his third-cousin once removed ===House of Luxembourg–Namur=== Image Name Date of birth Date of death Reign Relationship with predecessor Ermesinde II July 1186 12 February 1247 1197 – 12 February 1247 Henry IV's only daughter and Otto's fourth cousin Theobald I 1158 13 February 1214 1197 – 13 February 1214 her first husband and co-ruler Waleran 1180 2 July 1226 May 1214 – 2 July 1226 her second husband and co-ruler ===House of Luxembourg–Limburg=== Image Name Date of birth Date of death Reign Relationship with predecessor Henry V the Blond 1216 24 December 1281 12 February 1247 – 24 December 1281 their son Henry VI the Condemned 1240 5 June 1288 24 December 1281 – 5 June 1288 his son Henry VII 1275/1270 24 August 1313 5 June 1288 – 24 August 1313 John the Blind 10 August 1296 26 August 1346 24 August 1313 – 26 August 1346 Charles IV 14 May 1316 29 November 1378 26 August 1346 – 1353 Wenceslaus I 25 February 1337 7 December 1383 1353 – 13 March 1354 his brother ==Dukes of Luxembourg== In 1354, the county was elevated to a duchy. ===House of Luxembourg-Limburg=== Image Name Date of birth Date of death Reign Relationship with predecessor Wenceslaus I 25 February 1337 7 December 1383 13 March 1354 – 7 December 1383 himself as count Wenceslas II the Lazy 26 February 1361 16 August 1419 7 December 1383 – 1388 his nephew Jobst December 1351 18 January 1411 1388 – 18 January 1411 his cousin Elisabeth I November 1390 2 August 1451 18 January 1411 – 1443 his heiress & first cousin once removed Anthony August 1384 25 October 1415 18 January 1411 – 25 October 1415 her first husband and co-ruler John II the Pitiless 1374 6 January 1425 10 March 1418 – 6 January 1425 her second husband and co-ruler As Elisabeth had no surviving children, she sold Luxembourg to Philip III, Duke of Burgundy in 1441, but only to succeed upon her death. Philip captured the city of Luxembourg in 1443, but did not assume the ducal title because of conflicting claims by Anne of Austria, the closest Luxembourg relative. ====Claimants==== Image Name Date of birth Date of death Reign Relationship with predecessor Elisabeth I November 1390 2 August 1451 1443 to 2 August 1451 Ladislaus the Posthumous 22 February 1440 23 November 1457 2 August 1451 to 23 November 1457 Her first cousin once removed Anne 12 April 1432 13 November 1462 23 November 1457 to 13 November 1462 His sister William the Brave 30 April 1425 17 September 1482 Her husband and co-pretender Elisabeth II 1436 30 August 1505 13 November 1462 to 1467 Her sister Casimir Jagiellon 30 November 1427 7 June 1492 Her husband and co-pretender George of Poděbrady 23 April 1420 22 March 1471 1458 to 1471 Claimed title as king of Bohemia ===House of Valois-Burgundy=== In 1467, when Elisabeth II of Austria, last rival claimant to the title, renounced her rights, Philip III's son, Charles, Duke of Burgundy, assumed the title of duke of Luxembourg, making it a subsidiary title of the Duke of Burgundy. Image Name Date of birth Date of death Reign Relationship with predecessor Philip I \"the Good\" 31 July 1396 15 June 1467 1443 to 15 June 1467 Elisabeth I's second cousin once removed and \"usurper\" Charles II \"the Bold\" 10 November 1433 5 January 1477 15 June 1467 to 5 January 1477 His son Mary I \"the Rich\" 13 February 1457 27 March 1482 5 January 1477 to 27 March 1482 His daughter Maximilian I \"the Last Knight\" 22 March 1459 12 January 1519 Her husband and co-ruler ===House of Habsburg=== In 1482, Luxembourg passed to the House of Habsburg. After the abdication of Emperor Charles V, the duchy of Luxembourg fell to the Spanish line of the House of Habsburg. Image Name Date of birth Date of death Reign Relationship with predecessor Philip II \"the Handsome\" 22 July 1478 25 September 1506 27 March 1482 to 25 September 1506 Their son Charles III \"the Golden\" 24 February 1500 21 September 1558 25 September 1506 to 16 January 1556 His son Philip III \"the Prudent\" 21 May 1527 13 September 1598 16 January 1556 to 6 May 1598 Isabella Clara Eugenia 12 August 1566 1 December 1633 6 May 1598 to 13 July 1621 His daughter Albert 15 November 1559 13 July 1621 His son-in-law Philip IV \"the Great\" 8 April 1605 17 September 1665 13 July 1621 to 17 September 1665 Their nephew Charles IV \"the Bewitched\" 6 November 1661 1 November 1700 17 September 1665 to 1 November 1700 His son During the War of Spanish Succession, 1701–1714, the duchy was disputed between Philip of Anjou, grandson of Louis XIV of France, of the House of Bourbon; and Charles of Austria, son of Leopold I, Holy Roman Emperor, of the House of Habsburg. In 1712, Luxembourg and Namur were ceded to Maximilian II Emanuel, Elector of Bavaria by his French allies, but at the end of the war in 1713 with the Treaty of Utrecht Maximilian Emanuel was restored as Elector of Bavaria. In 1713, the duchy fell to the Austrian branch of the House of Habsburg. ===House of Bourbon=== Image Name Date of birth Date of death Reign Relationship with predecessor Philip V Philippe de France 19 December 1683 9 July 1746 1 November 1700 – 1712 his grandnephew ===House of Wittelsbach=== Image Name Date of birth Date of death Reign Relationship with predecessor Maximilian II Maximilian Emanuel Ludwig Maria Joseph Kajetan Anton Nikolaus Franz Ignaz Felix 11 July 1662 26 February 1726 1712 – 11 April 1713 his uncle ===House of Habsburg=== Image Name Date of birth Date of death Reign Relationship with predecessor Charles V Karl Franz Joseph Wenceslau Balthasar Johann Anton Ignatius 1 October 1685 20 October 1740 11 April 1713 – 20 October 1740 his second cousin Maria II Theresa Maria Theresa Walburga Amalia Christina 13 May 1717 29 November 1780 20 October 1740 – 29 November 1780 his daughter Joseph Joseph Benedikt August Johannes Anton Michael Adam 13 March 1741 20 February 1790 29 November 1780 to 20 February 1790 her son Leopold Peter Leopold Joseph Anton Joachim Pius Gotthard 5 May 1747 1 March 1792 20 February 1790 to 1 March 1792 His brother Francis II Francis Joseph Charles 12 February 1768 2 March 1835 1 March 1792 to 1794 His son Luxembourg was occupied by French revolutionaries between 1794 and 1813. At the Vienna Congress, it was elevated to a grand duchy and given in personal union to William I of the Netherlands. ==List of Dukes== ===House of Orange-Nassau=== Image Name Date of birth Date of death Reign Relationship with predecessor Willem I Willem Frederik (Prince William VI of Orange) 24 August 1772 12 December 1843 15 March 1815 to 7 October 1840 Francis' third cousin and Anne's direct descendant Willem II Willem Frederik George Lodewijk 6 December 1792 17 March 1849 7 October 1840 to 17 March 1849 His son Willem III Willem Alexander Paul Frederik Lodewijk 17 February 1817 23 November 1890 17 March 1849 to 23 November 1890 ===House of Nassau-Weilburg=== Name Portrait Birth Marriages Death Right of Succession Adolphe 23 November 1890 – 17 November 1905 24 July 1817 Wiesbaden (Prussia) (1) Grand Duchess Elizabeth Mikhailovna of Russia 31 January 1844 [1 child (stillborn)] (2) Princess Adelheid-Marie of Anhalt-Dessau 23 April 1851 [5 children] 17 November 1905 Colmar-Berg William III's 17th cousin once removed through male line Guillaume IV 17 November 1905 – 25 February 1912 22 April 1852 Wiesbaden (Prussia) Infanta Marie Anne of Portugal [6 children] 25 February 1912 Colmar-Berg his son Marie-Adélaïde 25 February 1912 – 14 January 1919 (abdicated) 14 June 1894 Colmar-Berg Unmarried [childless] 24 January 1924 Lenggries (Germany) his daughter Charlotte 14 January 1919 – 12 November 1964 (abdicated) 23 January 1896 Colmar-Berg Prince Felix of Bourbon-Parma 6 November 1919 [6 children] 9 July 1985 Fischbach her sister Jean 12 November 1964 – 7 October 2000 (abdicated) 5 January 1921 Colmar-Berg Princess Joséphine Charlotte of Belgium 9 April 1953 [5 children] 23 April 2019 Luxembourg City her son Henri 7 October 2000 – present 16 April 1955 Betzdorf María Teresa Mestre y Batista 4 February/14 February 1981 [5 children] living his son ==Timeline of Grand Dukes of Luxembourg since 1815== ImageSize = width:800 height:auto barincrement:12 PlotArea = top:10 bottom:50 right:130 left:20 AlignBars = late DateFormat = dd/mm/yyyy Period = from:15/03/1815 till:01/01/2020 TimeAxis = orientation:horizontal ScaleMajor = unit:year increment:10 start:1820 Colors = id:orange value:rgb(1,0.75,0.5) legend:Orange-Nassau id:nassau value:rgb(0.8,0.8,0.9999) legend:Nassau- Weilburg Legend = columns:2 left:50 top:24 columnwidth:150 BarData = barset:PM PlotData= width:5 align:left fontsize:S shift:(5,-4) anchor:till barset:PM from: 15/03/1815 till: 07/10/1840 color:orange text:\"Guillaume I\" fontsize:10 from: 07/10/1840 till: 17/03/1849 color:orange text:\"Guillaume II\" fontsize:10 from: 17/03/1849 till: 23/11/1890 color:orange text:\"Guillame III\" fontsize:10 from: 23/11/1890 till: 17/11/1905 color:nassau text:\"Adolphe\" fontsize:10 from: 17/11/1905 till: 25/02/1912 color:nassau text:\"Guillaume IV\" fontsize:10 from: 25/02/1912 till: 14/01/1919 color:nassau text:\"Marie-Adélaïde\" fontsize:10 from: 14/01/1919 till: 12/11/1964 color:nassau text:\"Charlotte\" fontsize:10 from: 12/11/1964 till: 07/10/2000 color:nassau text:\"Jean\" fontsize:10 from: 07/10/2000 till: end color:nassau text:\"Henri\" fontsize:10 ==References== ==Other websites== *History of titles of the counts and dukes of Luxembourg based on contemporary documents (before 1467) *History of titles of the dukes of Luxembourg based on contemporary documents (1467-1795) *History of titles of the grand dukes of Luxembourg based on contemporary documents (since 1814) monarch",
 "title": "List of monarchs of Luxembourg"
}