{
 "id": "795103",
 "text": "Hyla is a genus of tree frogs in the family Hylidae. Over the years, scientists have changed their minds about which frog species should be in Hyla and which should be in Litoria, Ranoidea or other genera. At one time, Hyla had more than 300 species from Europe, Asia, Africa, and across the Americas. Now, Hyla has only 17 extant (living) species. They are from Europe, northern Africa and Asia., 2005: Systematic Review of the Frog Family Hylidae, with Special Reference to Hylinae: Phylogenetic Analysis and Taxonomic Revision. Bulletin of the American Museum of Natural History, Num. 294, pp.1-240. (http://digitallibrary.amnh.org/dspace/bitstream/2246/462/1/B294.pdf ) The earliest known fossil from a Hyla frog is †Hyla swanstoni from the Eocene. The fossil was found in Saskatchewan, Canada, but it is not clear whether we would consider swanstoni a Hyla frog today. Josephus Nicolaus Laurenti made the genus in 1768. He named it after Hylas from Greek mythology. Hylas was a friend of Hercules. Even though the mythological person Hylas was male, the name Hyla is given the feminine grammatical gender. Some people say this word comes from the Greek word (, \"forest\" or \"wood\"), but it does not. It gives the 'wood' etymology. == Living species == Binomial name Common name H. annectans Jerdon's tree frog H. arborea European tree frog H. carthaginiensis Carthaginian tree frog H. chinensis Common Chinese tree frog H. felixarabica Arabian tree frog H. hallowellii Hallowell's tree frog H. intermedia Italian tree frog H. meridionalis Mediterranean tree frog H. molleri Moller's tree frog H. orientalis Oriental tree frog H. perrini Perrin's tree frog H. sanchiangensis San Chiang tree frog H. sarda Sardinian tree frog H. savignyi Middle East tree frog H. simplex Annam tree frog H. tsinlingensis Shensi tree frog H. zhaopingensis Zhaoping tree frog == Mating systems == === Female choice based on male calling === In most Hyla frogs, the male frogs sing, and then the female frogs choose which male to mate with based on their songs. But females from different species like different things about male frogs' voices. Female H. versicolor, for example, choose males whose calls last longer. Female H. arborea choose males who show up to sing in the same place for many nights. === Male-male contests === In some Hyla frogs, the male frogs fight and compete. Male H. versicolor frogs show up where the females like to go. This behavior, called lekking, is common in many species of Hyla. In order to sing clearly, the males need to be a certain distance apart from each other. When one male gets too close to another male's singing place, the two males may fight or do something else that is like fighting. Male H. versicolor sometimes show off to each other before they fight, so they can see whether they are likely to win first. === Indirect selection === Indirect selection is when one partner chooses a mate based on just one thing that is related to how fit and healthy the mate is all together. H. arborea is a frog that is awake at night, and the females listen to the males sing and then choose one, so the frogs must be able to hear well. These frogs can also see well in low light. This ability to see may be related to how females choose males. Scientists say female H. arborea choose males with more brightly colored vocal sacs. They think colorful vocal sacs may show that the frog has enough carotenoids in the food it eats. This may mean the male frog is better at finding food than other frogs, and he might pass on some of this skill to his offspring. == References == == Other websites == * . 2007. Amphibian Species of the World: an Online Reference. Version 5.1 (10 October 2007). Hyla. Electronic Database accessible at https://web.archive.org/web/20071024033938/http://research.amnh.org/herpetology/amphibia/index.php. American Museum of Natural History, New York, USA. (Accessed: Apr 21, 2008). * [web application]. 2008. Berkeley, California: Hyla. AmphibiaWeb, available at http://amphibiaweb.org/. (Accessed: Apr 21, 2008). * taxon Hyla at http://www.eol.org. Category:Frogs of Asia",
 "title": "Hyla"
}