{
 "id": "795628",
 "text": "EuroTrip is a 2004 American comedy movie directed by Jeff Schaffer. == Plot == At the Class of 2004 Ohio High School graduation party, Scotty Thomas was dumped by Fiona, who started dating a rock singer. He made the song Scotty Doesn't Know, which is about his sexual acts towards Fiona while Scotty doesn't know about it. Scott has been exchanging emails with a German woman named Mieke. Scott believes that Mieke is a male name but his younger brother explained that Mieke is a common name for German women. Scott regrets not knowing that Mieke is a woman and plans to go to Europe with his pals Cooper Harris and twins Jenny and Jamie. The group travels from London to Bratislava. While drunk on Absinthe, Jenny and Jamie kiss, to Scott and Cooper's disgust. == Cast == *Scott Mechlowicz as Scotty Thomas *Jacob Pitts as Cooper Harris *Michelle Trachtenberg as Jenny *Travis Wester as Jamie *Matt Damon as Donny *Jeffrey Tambor as Mr. Thomas *Vinnie Jones as Mad Maynard *Fred Armisen as Creepy Italian Guy *J.P. Manoux as Robot Mime *Lucy Lawless as Madame Vandersexxx *Steve Hytner as Absinthe Fairy *Kristin Kreuk as Fiona == Production == The movie's script was titled \"Ugly Americans\" but DreamWorks Pictures wanted the title to be similar to their 2000 movie Road Trip. Todd Phillips was apparently unhappy that EuroTrip got promoted as from the same producers of his movies Road Trip and Old School. Shooting was done at Prague of the Czech Republic. == Reception == The movie had mixed reviews but didn't do much at the box office. == References == == Other websites == * Category:2004 movies Category:2004 comedy movies Category:2000s sex comedy movies Category:2000s teen comedy movies Category:American sex comedy movies Category:American teen comedy movies Category:Bratislava Category:DreamWorks Pictures movies Category:Incest in movies Category:Movies about drugs Category:Movies about twins Category:Movies set in 2004 Category:Movies set in Italy Category:Movies set in London Category:Movies set in Ohio Category:Movies set in Paris Category:Multilingual movies Category:NC-17 rated movies Category:Teen sex comedy movies Category:Movies set in Rome",
 "title": "EuroTrip"
}