{
 "id": "795678",
 "text": "Samurai Jack is an American animated science fiction series created by Genndy Tartakovsky for the Cartoon Network. ==Plot summary== In Ancient Japan, an evil demon named Aku unleashed his evil. A young samurai prince with a magic katana stepped forward to fight him. Aku used his evil powers to send the prince a millennia into the future. When the samurai prince arrives in the future, he discovers that Aku has taken over the entire universe. It is the samurai's mission to get back to the past and stop Aku from taking over the universe. ==Setting== The show is mainly set in \"the future\" or \"Aku's future\", where the entire planet has been taken over by Aku. The scenery ranges from a massive metropolis with flying vehicles to settings from different historical time periods. There are also different elements of technology in the future. There is a character from a Scottish clan, there are robots, a wizard and 20th century gangsters. == Characters == === Main === * Samurai Jack (voiced by Phil LaMarr) is the nickname of the unnamed main character. He is a mysterious samurai prince and the son of the Emperor. When Aku takes over the ancient kingdom, the samurai goes to kill him. However, Aku uses his magic to send the samurai thousands of years into the future, where Aku has taken over the entire universe. Dubbed \"Jack\" by some locals he meets, the samurai spends the entire series trying to get back to the past. * Aku (voiced by Mako Iwamatsu and Greg Baldwin) is a demon who was created from pure evil. He begins his conquest of the world in Ancient Japan and sends Samurai Jack into the future, where Aku has now taken over the universe. Aku has numerous underlings whom he sends to kill Jack, as he knows the samurai is the only person who can reverse his evil deeds. === The Past === * The Emperor (voiced by Sab Shimono) is the monarch of an Ancient Japanese kingdom and the father of Samurai Jack. The Emperor managed to defeat Aku for some time, but could not prevent his return. * The Empress (voiced by Lauren Tom) is the wife of the Emperor and mother of Samurai Jack. === The Future === * The Scotsman (voiced by John DiMaggio) is a Scottish warrior who Samurai Jack encounters multiple times throughout the series. He is very outspoken and has an army of daughters. The Scotsman is killed by Aku in the final series. * Ashi (voiced by Tara Strong) is one of the Daughters of Aku. She was born and raised in a cult that worshipped Aku. However, she eventually has a change of heart and befriends Samurai Jack. Due to being the daughter of Aku, she inherits Aku's powers and manages to finally send Jack back to the past in the final episode. * Scaramouche (voiced by Tom Kenny) is a robot mercenary who works for Aku. He is killed by Aku for failing multiple times. * The High Priestess (voiced by Grey DeLisle) is a masked warrior who is the leader of the Cult of Aku. She gives birth to seven Daughters of Aku, who she sends to kill Samurai Jack. The High Priestess meets her fate at the hands of one of her own daughters, Ashi. * Demongo (voiced by Kevin Michael Richardson) is another demon who is spawned from Aku's Pit of Hate. Demongo captures the souls of warriors and creates his own army with them to fight Samurai Jack. * The Guardian (voiced by Kevin Michael Richardson) is a large alien brute who guards a time portal. Only those who defeat him can pass into the portal. It is implied that the Guardian is killed by Aku. * Three Blind Archers are a group of archers who were corrupted by the soul of a wishing well. They turned into three mindless monster-like archers until Jack saved them. * Rothchild (voiced by Rob Paulsen) is a talking dog scientists who is one of the first people that Jack encounters. Rothchild is the leader of a colony of talking dogs. ==References== Category:2001 American television series debuts Category:2017 American television series endings Category:2000s science fiction television series Category:2010s animated television series Category:2010s science fiction television series Category:Adult animated television series Category:Adult Swim Category:2000s American animated television series Category:American science fiction television series Category:American time travel television series Category:Cartoon Network series Category:Samurai Jack Category:Television series created by Genndy Tartakovsky Category:Television series set in the future Category:English-language television programs",
 "title": "Samurai Jack"
}