{
 "id": "795985",
 "text": "Adelaide of Saxe-Meiningen (13 August 1792 – 2 December 1849) was the wife of King William IV of the United Kingdom. She was the daughter of George I, Duke of Saxe-Meiningen, and Luise Eleonore of Hohenlohe-Langenburg. ==Life== Adelaide was born on 13 August 1792 at Meiningen, Thuringia, Germany. She was the first child of George I, Duke of Saxe-Meiningen and Luise Eleonore. At her baptism, she had twenty-one godparents, including: * her mother * Maria Theresa of Naples and Sicily, the Holy Roman Empress * Maria Carolina of Austria, the Queen of Naples and Sicily * Maria Theresa of Austria, the Crown Princess of Saxony * Princess Charlotte of Saxe-Meiningen, the Duchess of Saxe-Gotha-Altenburg * Princess Sophie Antoinette of Brunswick-Wolfenbüttel, Duchess of Saxe-Coburg * Landgravine Louise of Hesse-Darmstadt (1757–1830), Duchess of Saxe-Weimar * Karl Ludwig, Prince of Hohenlohe-Langenburg * Adolph, Landgrave of Hesse-Philippsthal-BarchfeldSandars, p.17 On 11 July 1818, Adelaide married Prince William, Duke of Clarence. It was a double wedding with William's younger brother, Prince Edward Augustus, Duke of Kent and Strathearn, and Princess Victoria of Saxe-Coburg-Saalfeld. When they married, William was second in line to become king. He became first in line when his brother, Prince Frederick, Duke of York and Albany, died in 1827. William and Adelaide became King and Queen of the United Kingdom when William's older brother, king George IV died in 1830. William and Adelaide were King and Queen until William died in 1837. Adelaide died on 2 December 1849, aged 57. ==Things named after Adelaide== The following are some of the things named after Adelaide: ===Settlements=== *Adelaide, Eastern Cape *Adelaide, the capital city of South AustraliaRodney Cockburn, South Australia What's in a Name? Adelaide: Axiom Publishing. 3rd Edition. Reprinted 2002 Pg 3. *Queen Adelaide, Cambridgeshire *Adelheidsdorf, a municipality in Lower Saxony, Germany ===Other things=== *Adelaide Hospital in Dublin *Adelaide River, in the Northern Territory of Australia *Fort Adelaide, in Port Louis, Mauritius *Queen Adelaide Archipelago in Chile *Adelaide Island, in Antarctica *525 Adelaide, an asteroid ==Children== Name Birth Death Notes Princess Charlotte of Clarence 27 March 1819 Died a few hours after being baptised, in Hanover.Weir, pp. 303–304. Stillborn child 5 September 1819 Born dead at CalaisZiegler, p. 126 or Dunkirk. Princess Elizabeth of Clarence 10 December 1820 4 March 1821 Born and died at St James's Palace. Stillborn twin boys 8 April 1822 Born dead at Bushy Park.Ziegler, pp. 126–127. ==Ancestry== ==References== ==Sources== * Sandars, Mary F. (Frances): The life and times of Queen Adelaide. London, 1915. . * * Ziegler, Philip (1971). King William IV. London: Collins. . == Other websites == * Biography * * Queen Adelaide Society (City of Adelaide, South Australia) |- |- Category:1792 births Category:1849 deaths Category:Kings and Queens consort of the United Kingdom Category:House of Hanover Category:19th-century British people",
 "title": "Adelaide of Saxe-Meiningen"
}