{
 "id": "7963",
 "text": "Monaco is one of favorite country! Monaco, officially the Principality of Monaco (French: Principauté de Monaco), is the second smallest country in the world after the Vatican City. Monaco is a city-state, meaning that the entire country is just one city Monaco is located south-east of France, on the Mediterranean Sea in Western Europe. Monaco's official language is French while the language of the Monégasque is also a national language. Monaco's population is around 38,000 but under 10,000 of its citizens are Monégasque nationals. The currency is the Euro (EUR), though Monaco is not part of the European Union (EU). Monaco is considered a tax haven and one of the wealthiest countries in the world because many rich people live there. Monaco is famous for the Monte Carlo Casino and the Monte Carlo Opera, is located in the northeastern part of the country. Monaco is also famous for two car races – the Monte Carlo Rally and the Monaco Grand Prix. ==History== ===Middle Ages=== Monaco began as a city named Monoikos and was under the control of the Holy Roman Empire, which later gave it to the Republic of Genoa. In 1297, Francesco Grimaldi and his army captured the fortress on the Rock of Monaco, but they were evicted by the Geonoese army. However, the Grimaldi family continued to fight for Monaco over the next century. Rainier I was the first Grimaldi ruler of Monaco. The Republic of Genoa eventually lost Monaco while fighting the Crown of Aragon. In 1419, the Grimaldi family purchased Monaco from Aragon. ===Early modern period=== In 1642, Honoré II, gave himself the title \"Prince of Monaco\". Until then, the rulers of Monaco were called the \"Lords of Monaco\". In 1793, Monaco was invaded by France. ===Modern period=== In 1814, the principality became independent again. However, a year later, the Congress of Vienna designated Monaco as a protectorate of the Kingdom of Sardinia. In 1860, Monaco became a French protectorate once again. At the time, the towns of Menton and Roquebrune-Cap-Martin were part of Monaco. However, the citizens of these towns wanted to be part of France. Charles III gave the towns to France in exchange for Monaco's full independence. A treaty was signed in 1861 which said that France would protect Monaco in case of a war. ===20th century=== In the early 1900s, Monaco became very popular among wealthy people because of the Monte Carlo casino. In 1910, there was a revolution in Monaco because the people wanted a democracy. Because of this, the powers of the Prince of Monaco were reduced. During World War II, Monaco was occupied by Italy. ===21st century=== Prince Rainier III famously married American actress Grace Kelly, who died in a car crash. In 2005, Albert II became the new Prince of Monaco. ==Geography== Monaco is entirely an urban area, meaning that it is all one city. There is only one natural resource in Monaco, which is fishing. The climate is a Mediterranean climate. There are land reclamation projects ongoing. ===Size=== Its surface area is 2.02 square kilometres, of which approximately 0.4 were recovered from the sea since 1980. ==Politics== Monaco is a constitutional monarchy, meaning that the head of state is a monarch with little to no say in the way the country is governed. Monaco is a principality, which is a type of monarchy where the monarch holds the title of Sovereign Prince. ===Constitution=== The constitution of Monaco designates three councils to run the country. The three councils are: * The National Council, which is the legislature. It consists of 24 elected members, who may be members of political parties. The National Council meets twice a year to discuss bills put forward by the Prince's government. The council is presided over by a president. * The Council of Government, which is the executive branch. The Government consists of 6 members, one of which is the Minister of State, who is appointed by the Sovereign Prince. * The Communal Council is the city council. It consists of 15 elected members, one of which is the mayor. The Communal Council is in charge of the social and cultural aspects of the country. In addition, Monaco is divided into ten administrative wards. ==Defense== Monaco has no military and is protected by France. However, it does have a police force of around 515 members. ==Economy== Tourism is the main industry. Tourism is extremely popular during the Monaco Grand Prix. People in Monaco pay no income tax. Many rich people live in Monaco and it is known for being very wealthy. Another large industry is gambling due to the Monte Carlo Casino. ==Culture== Monaco's culture is heavily influenced by its surrounding countries such as France and Italy. The main religion is Catholicism. The cuisine is influenced by that of northern Italy and southern France. ===Entertainment=== In terms of music, Monaco has an opera house, a symphony orchestra and a classical ballet company. Monaco has participated regularly in the Eurovision Song Contest, winning in 1971. There are three museums in Monaco. The Principality of Monaco hosts major international events such as : * International Circus Festival of Monte-Carlo * Mondial du Théâtre * Monte-Carlo Television Festival Monaco also has an annual bread festival on 17 September every year. Furthermore, Monaco has been hosting races as part of the Formula One World Championship since the beginning of the series, and will host it for the foreseeable future. For now, it's contract with the Fédération Internation de l'Automobile to host Formula 1 races has been extended to 2031. ==Education== ===Public=== Monaco has ten state-operated schools, including: seven nursery and primary schools; one secondary school; one lycée that provides general and technological training and one lycée that provides vocational and hotel training. ===Private=== There are also two grant-aided denominational private schools. There is one university located in Monaco, namely the International University of Monaco (IUM). ==Related pages== * Vatican * Andorra * Microstate * San Marino * Romance languages ==References== Category:Current monarchies Category:Italian-speaking countries Category:French-speaking countries",
 "title": "Monaco"
}