{
 "id": "796534",
 "text": "Tom & Jerry (marketed as Tom and Jerry: The Movie) is a 2021 American live- action/animated slapstick comedy adventure movie based on Will the eponymous cartoon trouble-making two-some of the same name made by William Hanna & Joseph Barbera in 1940. It was directed by Tim Story and produced by Warner Bros. Pictures, Turner Entertainment Co. and Warner Animation Group. The movie was released on February 26, 2021 in theaters and HBO Max. On Tubi, it was released on the January 1, 2021. It is the 15th movie of the Tom and Jerry series, WB's 2nd 2021 live-action/animated hybrid after Space Jam: A New Legacy (2021) as well as the 3rd to set up the fictional duo in the contemporary real-world after Anchors Aweigh (1945) 1953's Dangerous When Wet but this time as protagonists rathere than cameo characters. It is also a reboot of the series. The movie tells tells the story of Tom & Jerry's antics getting involved with a New York hotel when Jerry moves and settles into it weeks before the \"wedding of the century\" of Preeta (Pallavi Sharda) and her fiance Ben (Colin Jost). It stars in voice cast actors Chloe Grace Moretz, Michael Pina, Rob Delaney, Pallavi Sharda, Colin Jost, Jordan Bolger ,Ken Jeong, Patsy Ferran, Nicky Jam, Bobby Cannavale and Utkarsh Ambudkar with Kaiji Tang & Andre Sogluizzo's voices for the titular duo. This forces the hotel's new event planner Kayla (Chloe Grace Moretz) to hire Tom to exterminate Jerry before the ceremony. This gets them involved with Terence (Micheal Pena's) plan to use their long-lasting feud so he can ruin everything. with Kayla's chances, the wedding and hotel itself at their mercy this tests them to the limit & forces them to do the unthinkable-they must put their differences aside to save-the-day! The movie has many of the actions and features of the original Tom and Jerry cartoons. These include classic cartoon violence or cliches such as Jerry hitting Tom in the eye, Tom always trying to beat Jerry but failing, the 2's non-stop antagonization the classic Rube- Goldberg mousetrap Tom makes to get Jerry out, Tom's housecat nature to catch Jerry for a certain goal for someone, thing or himself, first film-viewed from the 1993 animated movie, Tom hitting Spike on the head so hard he gets a bump on his head and the fight tornado sequences, with Tom's usual scream and Jerry's nervous heartbeat with characters like Butch and Toots seen since the golden era of animation in 1940s old shorts. There are several musical scenes with rap songs and tunes such as Can I Kick It? (A Tribe Called Quest). On July 1 2021, a sequel set after the of the movie, Tom & Jerry in New York, was released with a Chinese-anime chibi short film series titled just \"Tom & Jerry\" in 2023, where both take their chaos to modern-day Singapore, and newer series of a direct-to-video films from 2024-2028, also upcoming untitled reboot series by YouTube and a untitled series features Droopy. ==Cast== === Live-action cast === *Chloë Grace Moretz as Kayla Forester *Michael Peña as Terence Mendoza *Colin Jost as Ben *Rob Delaney as Mr. Henry Dubros *Pallavi Sharda as Preeta Mehta *Jordan Bolger as Cameron *Patsy Ferran as Joy *Ken Jeong as Chef Jackie *Paolo Bonolis as a wedding guest *Ozuna as Assistant hotel staff === Voice and animated cast === *Tom, an animated blue/gray bicolor cat **He does not have a speaking role, but T-Pain provides his singing voice, with archived vocals from William Hanna, and additional vocals by Kaiji Tang. *Jerry, an animated brown house mouse **He does not have a speaking role, but his vocals are archived from Hanna, with additional vocals by André Sogliuzzo. *Bobby Cannavale as Spike, Ben's gray American bulldog *Nicky Jam as Butch, a black cat who leads an alley cat gang: **Joey Wells as Lightning **Harry Ratchford as Topsy **Na'im Lynn as Meathead **Spank Horton as Ash *Lil Rel Howery as Tom's shoulder angel and shoulder devil *Utkarsh Ambudkar as Real Estate Rat *Tim Story as Pigeon Announcer *Jeff Bergman as Droopy (uncredited) Other Tom and Jerry characters who appear in non-speaking roles include Toots, Preeta's shy beige cat and love interest for Tom, Goldie, the Royal Gate Hotel's goldfish, and Clyde, a large cat in Butch's gang. == References == == Other websites == * * Category:English-language movies Category:2021 animated movies Category:2021 comedy movies Category:Movies based on TV series Category:Movies directed by Tim Story Category:Reboot movies Category:Warner Animation Group movies Category:Warner Bros. Animation movies Category:Warner Bros. movies Category:Tom and Jerry movies",
 "title": "Tom and Jerry (2021 movie)"
}