{
 "id": "796941",
 "text": "This is a list of administrators and governors of Oyo State, Nigeria. Oyo State was formed on 1976-02-03 when Western State splits into Ogun, Ondo, and Oyo states. Name Title Took office Left office Party Notes Col. David Jemibewon Governor March 1976 July 1978 Military Col. Paul Tarfa Governor July 1978 October 1979 Military Chief Bola Ige Executive Governor 1 October 1979 1 October 1983 Unity Party of Nigeria (UPN) Dr. Victor Omololu Olunloyo Executive Governor 1 October 1983 31 December 1983 National Party of Nigeria (NPN) Lt. Col. Oladayo Popoola Governor 4 January 1984 September 1985 Military Col. Adetunji Idowu Olurin Governor September 1985 July 1988 Military Col. Sasaenia Oresanya Governor 27 July 1988 August 1990 Military Col. Abdulkareem Adisa Governor 3 September 1990 January 1992 Military Chief Kolapo Olawuyi Ishola Executive Governor 2 January 1992 17 November 1993 Social Democratic Party (SDP) Navy Capt. Adetoye Oyetola Sode Administrator 9 December 1993 14 September 1994 Military Col. Chinyere Ike Nwosu Administrator 14 Sep 1994 22 Aug 1996 Military Col. Ahmed Usman Administrator 22 August 1996 August 1998 Military Comm. Pol. Amen Edore Oyakhire Administrator 16 August 1998 28 May 1999 Military Dr. Lam Adesina Governor 29 May 1999 28 May 2003 Alliance for Democracy (AD) Rashidi Adewolu Ladoja Governor 29 May 2003 28 May 2007 People's Democratic Party (PDP) Impeached in January 2006, reinstated in December 2006 Christopher Alao-Akala Governor (de facto) 12 January 2006 7 December 2006 People's Democratic Party (PDP) Appointed when Rasheed Ladoja was impeached, until the impeachment was overturned. Christopher Alao-Akala Governor 29 May 2007 29 May 2011 People's Democratic Party (PDP) Abiola Ajimobi Governor 29 May 2011 29 May 2019 Action Congress of Nigeria (ACN) Seyi Makinde Governor 29 May 2019 Incumbent People's Democratic Party (PDP) == Related pages == * Nigeria Category:Nigerian politicians Category:Lists of African politicians governor Oyo State Category:Oyo State",
 "title": "List of governors of Oyo State"
}