{
 "id": "79701",
 "text": "A levee, or levée, is a raised bank of a river. The levee or dyke is a protection against floods. Henry Petroski 2006. Levees and other raised ground. American Scientist 94 (1): 7–11. There are two types of levee: riverdykes and seadykes. The seadyke was invented in Holland in 1277. Rotterdam is largely below sea level, but is protected by its dykes. It is quite clear now that other coastal cities are going to need protection from the sea. The first dykes were built in ancient Mesopotamia. The levees they used were earth walls and gave protection against the meltwater. 3000 years ago levees were used in ancient Egypt for irrigation systems. 'Levée' comes from the French verb lever, \"to raise\". Other names are 'floodbank' or 'stopbank'. It is a natural or artificial wall, usually earthen, and often parallels the course of a river. The term \"levee\" came into English use in New Orleans around 1672. The word 'dyke' or 'dike' comes from the Dutch word dijk. The general term for devices such as dykes is \"flood control\". Another useful term is \"embankment\", which is used to build up banks of a river The lower River Thames was a broad, shallow waterway winding through malarious marshlands. It has been transformed into a deep, narrow tidal canal. Floods from the North Sea are held back at the Thames Barrier. == A downside of levees == Artificial levees may lead to an elevation of the natural river bed over time. Alluvial rivers with intense accumulations of sediment may do this. The river bed may get higher than the adjacent ground surface behind the levees. This is so in the Yellow River in China, and the Mississippi in the United States. == Earthworks == There are many earthworks. Some are not related to rivers or water. * Car Dyke, a Roman boundary ditch in Eastern England * Devil's Dyke, one of several ancient embankments or ditches * Foss Dyke, a Roman canal in England linking the River Trent to the River Witham at Lincoln * Offa's Dyke, historic earthwork dividing Mercia from Wales * Wansdyke (earthwork), dividing Wessex from the lands south west of it * Wat's Dyke, An earthwork running through the northern Welsh Marches from Basingwerk Abbey to Maesbury === Geological features === A separate page deals with Dyke (geology) * The Great Dyke, a mineral-rich feature that runs through Zimbabwe * Mount Desire Dyke, an igneous intrusion in South Australia == Draining and reclaiming land == There is a long history of land being reclaimed from the sea (for example in Holland), and marshlands being drained to make them good farming land (southern England).Dunning R.W. 2004. History of the County of Somerset, volume 8: The Poldens and the Levels (Victoria County History). Oxford: Oxford University Press. ISBN 1-904356-33-8 In many places water is held back by sluices. Sluice is a word for a channel controlled at its head by a movable gate. The gate is called a sluice gate. == Dredging: the alternative approach == Dredging is lowering the base of a river. It is another approach to the problem of rising water levels. Of course, it can and is used together with levees as a standard method. We all know that rivers drop sediment as they flow, and all main rivers are regularly dredged. Dredging has the disadvantage of disturbing the life at the bottom of rivers, but it will certainly be used more in future. == Other websites == * Levees.Org (activist group in New Orleans to Hold the Corps Accountable) == References == Category:Landforms Category:Flood control",
 "title": "Levee"
}