{
 "id": "797171",
 "text": "Lactic acid fermentation is how glucose or other monosaccharide sugars are converted into lactic acid and energy. There may also be other by-products of this fermentation. It also works with other sugars, such as sucrose or lactose. Lactic acid bacteria use fermentation to get energy. Fungi, plants and animals will also use this it, if there is a lack of oxygen. As an example, it occurs in muscle cells. With humans, it occurs if there's too little oxygen in the blood, known as Hypoxemia. There are different types of lactic acid fermentation: * Fermentation where the main product is lactic acid. This is known as homolactic fermentation. * Fermentation which results in by-products; besides lactic acid, this will be ethanol and carbon dioxide, in the case of hexose sugars, and acetic acid in the case of pentose sugars. This is called heterolactic fermentation. * Bacteria of the genus Bifidobacterium will create lactic acid and acetic acid. == As a preservative == Lactic acid fermentation is a way to preserve food, and make it last longer. It has been in use at least since the Paleolithic era. Fermentation will reduce the activity of the bacteria that make food go bad; it will also kill some of them. Examples are fermented milk products, such as yoghurt, sauerkraut, kimchi, and tsukemono. == History == During the 19th century, several of the fundamental concepts of organic chemistry were discovered. Joseph Louis Gay-Lussac was interested in fermentation processes. One of his students was Justus von Liebig. Both independently described the chemical structure of the lactic acid molecule. Both were chemists, they were only interested in the chemical properties, and how to optimize it using chemical catalyzers. The French chemist Louis Pasteur was the first to describe lactic acid as a product of a microbial fermentation, in 1857. At the time he worked at the University of Lille. A local brewery asked him about some problems they had with fermentation. By chance he discovered that in this brewery, two fermentation processes were taking place: One was the lactic acid fermentation he had expected, the other was an alcoholic fermentation. Both were started by microorganisms. In the 19th century, several chemists discovered some fundamental concepts of the domain of organic chemistry. One of them was the French chemist Joseph Louis Gay-Lussac, who was especially interested in fermentation processes. He also passed this fascination to one of his best students, Justus von Liebig. With a difference of some years, each of them described the chemical structure of the lactic acid molecule as we know it today. Both Gay-Lussac and von Liebig had a purely chemical understanding of the fermentation process: in their view, the process can be optimized with chemical catalyzers; neither of them was interested in seeing it with a microscope. In 1857, the French chemist Louis Pasteur first described lactic acid as the product of a microbial fermentation. During this time, he worked at the university of Lille, where a local distillery asked him for advice concerning some fermentation problems. Per chance and with the badly equipped laboratory he had at that time, he discovered that in this distillery, two fermentations were taking place, a lactic acid one and an alcoholic one, both induced by microorganisms. He then continued the research on these discoveries in Paris, where he also published his theories which contradicted the purely chemical version represented by Liebig and his followers. Even though Pasteur described some concepts that are still accepted today, Liebig refused to accept them. But even Pasteur himself wrote that he was \"driven\" to a completely new understanding of this chemical phenomenon. Even if Pasteur didn't find every detail of this process, he still discovered the main mechanism of how the microbial lactic acid fermentation works. He was the first to describe fermentation as a \"form of life without air.\" People had been using microbial lactic acid fermentation to produce food long before Pasteur had described it. Archeological finds show that the fermentation of milk has a long history. Its first uses may have been part of the Neolithic Revolution. Milk contains lactic acid bacteria. Given the right temperature, the fermentation process will happen spontaneously. These first farmers likely had another problem: When people become adults most lose the ability to digest fresh milk. These farmers had an interest to make milk digestible by adults. Lactic acid bacteria contain the enzymes needed to digest lactose. During lactic acid fermentation, the number of lactic acid bacteria increase. So even if fermentation only happens for a short time, the product will contain enough enzymes, which allows the milk to be digested by adults. Even safer was a longer fermentation, which was practiced for cheesemaking. This process was also discovered a very long time ago, which is proven by recipes for cheese production on Cuneiform scripts, the first written documents that exist, and a bit later in Babylonian and Egyptian texts. What is interesting is the theory of the competitive advantage of fermented milk products. The idea of this theory is that the women of these first settled farmer clans could shorten the time between two children thanks to the additional lactose uptake from milk consumption. This factor may have given them an important advantage to out- compete the hunter-gatherer societies. Since they consumed more milk products, these societies developed lactase pesistence: The milk-digesting enzyme lactase was present in their body during the whole lifetime: They could also drink unfermented milk as adults. Even today there are regional differences: Estimates are that about 65% of the world polulation still lacks this enzyme. The first societies came from regions in eastern Turkey to central Europe; the gene is more common there, as well as in the United States, which was settled from Europe. In Asian countries, lactose intolerance is much more present. Milk products and their fermentation have had an important influence on some cultures’ development. This is the case in Mongolia, where people often practice a pastoral form of agriculture. The milk that they produce and consume in these cultures is mainly mare milk and has a long tradition. But not every part or product of the fresh milk has the same meaning. The fattier part on the top, the \"deež\", is seen as the most valuable part and is therefore often used to honor guests. Very important with often a traditional meaning as well are fermentation products of mare milk, like for example the slightly-alcoholic yogurt kumis. Consumption of these peaks during cultural festivities such as the Mongolian lunar new year (in spring). The time of this celebration is called the \"white month\", which indicates that milk products (called \"white food\" together with starchy vegetables, in comparison to meat products, called \"black food\") are a central part of this tradition. The purpose of these festivities is to \"close\" the past year – clean the house or the yurt, honor the animals for having provided their food, and prepare everything for the coming summer season – to be ready to \"open\" the new year. Consuming white food in this festive context is a way to connect to the past and to a national identity, which is the great Mongolian empire personified by Genghis Khan. During the time of this empire, the fermented mare milk was the drink to honor and thank warriors and leading persons, it was not meant for everybody. Although it eventually became a drink for normal people, it has kept its honorable meaning. Like many other traditions, this one feels the influence of globalization. Other products, like industrial yogurt, coming mainly from China and western countries, have tended to replace it more and more, mainly in urban areas. However, in rural and poorer regions it is still of great importance. == Major species of lactose fermenting bacteria == Some major bacterial strains identified as being able to ferment lactose are in the genera Escherichia, Citrobacter, Enterobacter and Klebsiella . All four of these groups fall underneath the family of Enterobacteriaceae. These four species are able to be separated from each other by using biochemical testing. To distinguish between the species, simple biological tests are readily available. Apart from whole sequence genomics, common tests include H2S production, motility and citrate use, indol, methyl red and Voges-Proskauer tests. == Applications == Lactic acid fermentation is used in many areas of the world to produce foods that cannot be produced through other methods. The most commercially important genus of lactic acid-fermenting bacteria is Lactobacillus, though other bacteria and even yeast are sometimes used. Two of the most common applications of lactic acid fermentation are in the production of yogurt and sauerkraut. === Sauerkraut === Lactic acid fermentation is used in the production of sauerkraut. The main type of bacteria used in the production of sauerkraut is of the genus Leuconostoc. As in yogurt, when the acidity rises due to lactic acid-fermenting organisms, many other pathogenic microorganisms are killed. The bacteria produce lactic acid, as well as simple alcohols and other hydrocarbons. These may then combine to form esters, contributing to the unique flavor of sauerkraut. === Sour beer === Lactic acid is a component in the production of sour beers, including Lambics and Berliner Weisses. === Yogurt === The main method of producing yogurt is through the lactic acid fermentation of milk with harmless bacteria. Most often, the bacteria used are Lactobacillus bulgaricus and Streptococcus thermophilus, and United States as well as European law requires all yogurts to contain these two cultures (though others may be added as probiotic cultures). These bacteria produce lactic acid in the milk culture, decreasing its pH and causing it to congeal. The bacteria also produce compounds that give yogurt its distinctive flavor. An additional effect of the lowered pH is the incompatibility of the acidic environment with many other types of harmful bacteria. For a probiotic yogurt, additional types of bacteria such as Lactobacillus acidophilus are also added to the culture. == Notes and references == Category:Pages with unreviewed translations Category:Fermentation",
 "title": "Lactic acid fermentation"
}