{
 "id": "797160",
 "text": "The Palau de les Belles Arts was a multipurpose building in Barcelona . Demolished in 1942, it was built on the occasion of the universal exhibition of 1888, in the space where the municipal courts are currently in front of the Parc de la Ciutadella, on the corner of Passeig de Lluís Companys and Passeig de Pujades . == Architecture == Work of August Font i Carreras, it was destined to artistic exhibitions, concerts and cultural events. The building had a rectangular floor plan and was 91 x 50 meters. The iron structure allowed to cover a great assembly hall. It had exposed side towers, with domes at the corners. On the second floor, there were different rooms, around the large one, with zenithal light, which allowed events and exhibitions to take place. The building basically consisted of a large hall, the Queen Regent's Hall, with an area of 2,000 square meters, intended for public events. == Use as a room of exhibitions == This building was the first headquarters of the Municipal Museum of Fine Arts of Barcelona, between 1891 and 1915, where the different municipal and later provincial art collections met, a collection that years later became part of the Museum. National Art of Catalonia . During the Universal Exhibition, an exhibition of works of art from municipal collections and other collections from all over Spain was exhibited. Afterwards, exhibitions of fine arts and artistic industries took place ( General Exhibition of Fine Arts of Barcelona ). The periodic holding of these shows necessitated the temporary relocation of funds to other places. In 1917 the Exposition d'Art Français was organized in solidarity with French artists. In 1921 the works belonging to the Municipal Museums of Arts of Barcelona were incorporated. == References == == Bibliography == * FUENTES MILÀ, Sergio; El Palau de Belles Arts de Barcelona: gènesi, vida i mort (1887-1942); Tesi de Màster en Estudis Avançats en Història de l'Art, dirigida pel Dr.Joan Molet i Petit; Universitat de Barcelona, Departament Història de l'Art: 2010 * FUENTES MILÀ, Sergio; El Palacio de Bellas Artes de Barcelona: el Eclecticismo suntuoso como sede de colecciones (comunicació de Seminari). Al Seminari de la Real Academia de Bellas Artes de San Fernando, Madrid \"Desamortizaciones, colecciones, exposiciones y comercio de arte en los siglos XIX y XX\" (10 i 11 de juny de 2011) * CIERVO, Joaquín; Historial del Palacio de Bellas Artes; Impr.Viuda de R.Tobella, Barcelona: 1943 == Other websites == * Primera Exposición General de Bellas Artes de Barcelona (1891) en el Archivo del Museo Nacional de Arte de Cataluña * Primera Exposición Nacional de Industrias Artísticas e Internacional de Reproducciones de Barcelona (1892) en el Archivo del Museo Nacional de Arte de Cataluña *Segunda Exposición General de Bellas Artes de Barcelona (1894) en el Archivo del Museo Nacional de Arte de Cataluña *Tercera Exposición de Bellas Artes e Industrias Artísticas de Barcelona (1896) en el Archivo del Museo Nacional de Arte de Cataluña *Exposición de Arte Antiguo de Barcelona (1902) en el Archivo del Museo Nacional de Arte de Cataluña *Exposición de Retratos y Dibujos Antiguos y Modernos de Barcelona (1910) en el Archivo del Museo Nacional de Arte de Cataluña Category:Buildings and structures in Barcelona",
 "title": "Palau de les Belles Arts"
}