{
 "id": "797222",
 "text": "Todd McFarlane's Spawn, also known as Spawn: The Animated Series, is an American noir adult animated television series which aired on HBO from 1997 through 1999. It has also been released on DVD as a movie series. The show is based on the Spawn character from Image Comics, and won an Emmy in 1999 for Outstanding Animation Program (longer than one hour). ==Voice cast== * Keith David – Al Simmons / Spawn * Richard Dysart – Cogliostro * Dominique Jennings – Wanda Blake * John Rafter Lee – Jason Wynn * Michael Nicolosi – Clown (human form) * James Hanes – Violator (demoniac form), Overt-Kill * Jennifer Jason Leigh – Lilly * Victor Love – Terry Fitzgerald (episodes 1–12), Bobby (episodes 1–12) * Michael Beach – Terry Fitzgerald (episodes 15–17), Bobby (episodes 15–17), and additional voices * Kath Soucie – Cyan Fitzgerald and additional voices * James Keane – Tony Twist, Sam Burke * Michael McShane – Maximilian \"Twitch\" Williams, Gareb * Denise Poirier – Merrick, Bounty Hunter, Angela * Ronny Cox – Billy Kincaid, Senator Scott McMillan * Victor Brandt – Chief Banks * Ming-Na Wen – Jade (Lisa Wu) * Ruben Santiago-Hudson – Jess Chapel * Robert Forster – Major Forseberg * James Hong – Gen Soon/Zhang Lao * Debbi Morgan – Granny Blake ===Legacy=== Todd McFarlane's Spawn was ranked 5th on IGN's list of \"The Greatest Comic Book Cartoons of All Time\", and 23rd on IGN's list of \"Top 25 Primetime Animated Series of All Time\". Series producer Eric Radomski reflected in an interview that \"Spawn TAS was a personal success for me. Very rarely do artists get the opportunity to have as much uncensored creative freedom as I did at HBO on Spawn.\" ==Music== The score and opening theme was made by Shirley Walker, who also composed music for Batman: The Animated Series. While Batman: The Animated Series featured traditional orchestra music, the producers of Todd McFarlane's Spawn requested that Walker give the series a more organic and subtle electronic soundtrack, with only minimal usage of orchestral sounds. ==Home video== On July 24, 2007, HBO Video released a 4-disc 10th-anniversary signature collector's edition on DVD with all 18 episodes and multiple bonus features. ==Related pages== * Spawn (character) * Spawn (movie) ==References== ==Other websites== * * * Todd McFarlane's Spawn at Toon Zone Category:1997 American television series debuts Category:1999 American television series endings Category:Spawn (comics) Category:English-language television programs",
 "title": "Todd McFarlane's Spawn"
}