{
 "id": "797360",
 "text": "Batman vs. Teenage Mutant Ninja Turtles is a 2019 animated crossover superhero movie, directed by Jake Castorena, written by Marly Halpern-Graser, and produced by Warner Bros. Animation, DC Entertainment, and Nickelodeon. The movie is an adaptation of the six-issue inter-company crossover comic book miniseries Batman/Teenage Mutant Ninja Turtles by James Tynion IV and Freddie Williams II. The story focuses on Batman, Robin and Batgirl teaming up with the Teenage Mutant Ninja Turtles, in order to save Gotham City from chaos at the hands of both Shredder and Ra's al Ghul with their sect: the Foot Clan and the League of Assassins. The movie itself features the voices of Troy Baker, Darren Criss, Eric Bauza, Cas Anvar and Andrew Kishino. The movie is the first collaboration between Warner Bros. and Nickelodeon, and was devised for the direct-to-video market. It was released on both Blu-ray and Digital HD on June 4, 2019. It was well-liked, and grossed over $3.8 million from sales. ==Voice cast== * Troy Baker as Batman and Joker * Eric Bauza as Leonardo * Darren Criss as Raphael * Baron Vaughn as Donatello * Kyle Mooney as Michelangelo * Ben Giroux as Damian Wayne / Robin * Rachel Bloom as Barbara Gordon / Batgirl * Brian George as Alfred Pennyworth * Jim Meskimen as Commissioner Gordon and Dr. Jonathan Crane / Scarecrow * Andrew Kishino as Oroku Saki / Shredder * Cas Anvar as Ra's al Ghul * Keith Ferguson as Dr. Baxter Stockman and Harvey Dent / Two-Face * Tom Kenny as Oswald Cobblepot / Penguin * Tara Strong as Dr. Harleen Quinzel / Harley Quinn, Dr. Pamela Isley / Poison Ivy and Pizza Delivery Girl * John DiMaggio as Dr. Victor Fries / Mr. Freeze * Carlos Alazraqui as Bane ==Production== ===Development=== Warner Bros. Animation was considering adaptations of Batman/Teenage Mutant Ninja Turtles and Wonder Woman as possible direct-to-video movies. The animated adaptation of the miniseries was officially announced in February 2019 to be in production and was released later in the spring. ===Casting=== The initial announcement revealed Troy Baker would reprise his roles as both Batman from Batman: The Telltale Series video game and various Lego video games and movies, and the Joker from Batman: Arkham Origins, Batman: Assault on Arkham, and the Batman Unlimited series, making Baker the first actor to portray both characters in the same property. The movie also features Darren Criss and Eric Bauza reprising their roles as Raphael and Leonardo, while Kyle Mooney and Baron Vaughn voice Michelangelo and Donatello, respectively. Rachel Bloom voices Batgirl and Cas Anvar voices Ra's al Ghul. In addition, Tom Kenny, John DiMaggio, Carlos Alazraqui and Tara Strong reprise their roles as the Penguin, Mr. Freeze, Bane, Harley Quinn and Poison Ivy from various DC properties. Other key cast members of the movie were revealed a month later, which consists of Ben Giroux as Robin, Andrew Kishino as the Shredder, Keith Ferguson as both Baxter Stockman and Two-Face, Brian George reprising his role as Alfred Pennyworth from Batman: The Killing Joke, and Jim Meskimen as both Commissioner James Gordon and the Scarecrow. ==Release== The first trailer was released on March 12, 2019. The movie had its world premiere at WonderCon Anaheim 2019 on March 31. The movie was later released to Digital on May 14 on 4K Ultra HD Combo Pack and Blu-ray Combo Pack on June 4, 2019. ==Critical reception== Batman vs. Teenage Mutant Ninja Turtles was well-liked. Based on 13 reviews collected on Rotten Tomatoes, the movie has an approval rating of 100% with an average rating of a 7.47/10. The movie earned $3,898,811 from domestic home video sales.\"Batman vs. Teenage Mutant Ninja Turtles\" (https://www.the-numbers.com/movie/Batman-Vs-Teenage-Mutant-Ninja- Turtles-(2019)#tab=summary). The Numbers. Accessed September 28, 2019. ==References== ==Other websites== *DC page Category:Animated Batman movies Category:Animated Teenage Mutant Ninja Turtles movies Category:English- language movies Category:Superhero crossover movies Category:2019 movies",
 "title": "Batman vs. Teenage Mutant Ninja Turtles"
}