{
 "id": "797431",
 "text": "The murder of Samuel Paty was a terrorist attack that took place on 16 October 2020 in Conflans-Sainte-Honorine, near Paris. Paty was a French secondary school teacher, and he was killed and then beheaded by an Islamist terrorist, Abdoullakh Abouyedovich Anzorov. Anzorov killed Paty after a \"hate campaign\" on social media. A student at the school where Paty taught lied about Paty's teaching, and the student's father started the hate campaign. Paty showed his students Charlie Hebdo's 2012 cartoons showing Muhammad in a class on freedom of speech. A girl who was not in the class lied about what the teacher taught, and her father made a complaint to the police. He also started the internet \"hate campaign\" against Paty that caused Anzorov to kill Paty. The murder happened during the trial of other terrorists who were part of the Charlie Hebdo shooting in 2015. The killers in the 2015 shooting were against Charlie Hebdo's 2012 cartoons showing Muhammad. After Paty showed these cartoons in a class about freedom of speech, an Islamist imam wrote a fatwa (an opinion on Muslim law) against Paty which called for his punishment. Anzorov killed Paty and put a picture of his head on Twitter. Many of Paty's students saw the picture. Anzorov said that he had \"executed\" Paty and addressed his words and the picture of Paty's head to Emmanuel Macron, the president of the French Republic. The police shot Anzorov dead a few minutes after the murder. President Macron said that the event was \"a typical Islamist terrorist attack\", and that \"our compatriot was killed for teaching children freedom of speech\". == Events before the murder == On 6 October, Samuel Paty was teaching a lesson on dilemmas. The lesson was about the magazine Charlie Hebdo's cartoons of Muhammad and the 2015 Charlie Hebdo shooting. (In January 2015, Islamist terrorists attacked the office of the magazine and killed 12 people.) Paty showed the class of 13- and 14-year-olds the cartoons but said that Muslim students, who might be shocked, could close their eyes or leave the room if they wanted. A 13-year-old girl at Paty's school was often truant and failed to go to her lessons. Because of her absences, the school suspended the girl. She did not want her father, Brahim Chnina, to know about her bad behaviour. On 8 October the girl lied to her father that Paty had ordered Muslim students in his lesson on 6 October to leave the room. She said the teacher then showed the other students \"a photograph of the Prophet naked\". She said that Paty sent her home for two days because she disagreed with him. The girl was not in the lesson. Brahim Chnina, the girl's father, was 48 years old and was born in Morocco. When his daughter told him her story, Chnina made an angry video which he put on Facebook. In the video, he demanded that the school fire Paty from his job. Chnina made another angry video in which he accused Paty of \"discrimination\". Chnina made complaints to the school and to the police. He said Paty was \"diffusing a pornographic image\". Chnina said that Paty had ordered Muslim students to lift their hands and then leave the room while Paty showed the class the image. Chnina also said there was Islamophobia at the school. He said that other parents should help him force the school to fire Paty. He sent these videos to the organization Collective Against Islamophobia in France () and to his local mosque. Chnina said the same things on radio as well. ==References== Category:2020 crimes in Europe Category:2020 in France Category:2020s murders in Europe Category:Yvelines Category:Islamic terrorist incidents in France Category:Murder in 2020 Category:Murder in France Category:October 2020 events Category:Terrorist incidents in 2020",
 "title": "Murder of Samuel Paty"
}