{
 "id": "797557",
 "text": "Mangalya Dosham, Mangalya Dhosham or Mangalya Sandhosham, is an Indian Tamil language television show. It is a horror and thriller drama. It aired on Colors TamilThe series starred Lakshmipriya, Arun Padmanabhan and Ravi Tej. It is a supernatural story based on the movie Arundhati. This series had more than 100 episodes. Then Colors Tamil and the series team decided change the name of the show from Mangalya Dosham to Mangalya Sandhosham' ==Plot== A Zamindar family lives in Manikkapuram. A commoner named Raghuvaran was in love with Zamindar's daughter Nayanthara. But when Raghuvaran proposed this idea to the courtiers, they threw him out. Nayanthara married someone else. On her wedding day, the groom tied the sacred thread on Nayanthara, but that night, Raghuvaran killed the groom. Raghuvaran was caught and executed by hanging. Before he died, Raghuvaran promised that in every lifetime he would follow Nayanthara to get her marry him. After many years, Nayanthara was reincarnated and reborn as Nithya who is born with Mangalya Dosha from her previous birth. She is a Bharathanatyam dancer. Tarun is a doctor who falls in love with Nithya at first sight. Raghuvaran comes as a ghost who haunts Nithya in many ways. Tarun and Nithya's agree to get married, but Deepika doesn't want Nithya to marry Tarun, so she tries to separate them. The rest of the story shows Nithya and Tarun trying to live together even though the of Raghuvaran does not want them to. ==Cast== * Lakshmipriya in a dual role as ** Nithya - a Bharathanatyam dancer and Tarun's love interest and became wife (Present) ** Nayanthara - Zamindar's daughter and Raghuvaran love interest (Past) * Ravi Tej as Raghuvaran ** A Ghost and he comes to haunts Nithya (Present) ** A commoner and he killed by Nayanthara (Past) * Arun Padmanabhan as Tarun ** Nithya's husband and he get possessed by the ghost Raghuvaran === Recurring === * Keerthi Vijay as Deepika * KS Suchitra / Smrithi / Usha as Sulochana * Sai Gopi / Rajesh as Aarumugam, Tarun's father * Sumi Sreekumar as Mridhula * Raveena Daha as Baakiya * V. Dasarathy as Kodi * Neelakandan as Prathap * Egavalli as Shubha * Varun Udhay as Aravind == References == ==Other websites== * Colors Tamil Official Facebook in Tamil * Colors Tamil Official Youtube Channel Category:Tamil-language television series Category:2020 Tamil- language television series debuts",
 "title": "Mangalya Dosham"
}