{
 "id": "797707",
 "text": "The Vice President of the Plurinational State of Bolivia () or Vice President of Bolivia (), is the second highest political position in Bolivia. The Vice President replaces the President in his absence, death or in the event of removal from office. == List of vice presidents of Bolivia == === Single vice presidency (1828–1880) === Portrait Name Term of office Term of office President Notes R. Portrait Name Start End President Notes R. José Ramón de Loayza Pacheco (1751–1839) 18 December 1828 1 January 1829 José Ramón de Loayza Pacheco (1751–1839) 18 December 1828 1 January 1829 Pedro Blanco Soto colspan=5 José Miguel de Velasco José Miguel de Velasco (1795–1859) 24 May 1829 23 July 1835 Andrés de Santa Cruz Mariano Enrique Calvo (1782–1842) 23 July 1835 17 February 1839 Andrés de Santa Cruz colspan=5 José Miguel de Velasco The Constitution of 1839 eliminates the Vice President position. rowspan=3 colspan=5 José Miguel de Velasco rowspan=2 colspan=5 Hilarión Daza The Constitution of 1878 reincorporates the Vice President position. Narciso Campero === Double vice presidency (1880–1921) === Title rowspan=2 width=\"2.5%\" Portrait Name Term of office Term of office Party Party Elected President Notes R. Title Start Portrait Name End Party Party Elected President Notes R. colspan=9 Narciso Campero The Constitution of 1880 incorporates the Double Vice Presidency. 1st Vice President Narciso Campero Aniceto Arce 31 May 1880 11 March 1881 Conservative — Appointed by the National Convention as Vice President for 4 years. Sentenced to banishment by Narciso Campero. 1st Vice President Narciso Campero colspan=7 — 2nd Vice President Narciso Campero Belisario Salinas Belzu (1833–1893) 31 May 1880 4 September 1884 Conservative — Appointed by the National Convention as Vice President for 4 years. 1st Vice President Mariano Baptista 4 September 1884 15 August 1888 Democratic 1884 Gregorio Pacheco 2nd Vice President Jorge Oblitas (1831–1900) 4 September 1884 15 August 1888 Democratic 1884 Gregorio Pacheco 1st Vice President José Manuel del Carpio 15 August 1888 4 August 1892 Conservative 1888 Aniceto Arce 1st Vice President colspan=7 1888 Aniceto Arce 2nd Vice President Serapio Reyes Ortiz (1822–1900) 15 August 1888 11 August 1892 Conservative 1888 Aniceto Arce 1st Vice President Severo Fernández 11 August 1892 19 August 1896 Conservative 1892 Mariano Baptista 2nd Vice President – Juan Federico Zuazo (1825–1892) colspan=2 Conservative 1892 Mariano Baptista 1st Vice President Rafael Peña de Flores 19 August 1896 12 April 1899 Conservative 1896 Severo Fernández Ousted from office by the Federal Revolution of 1899. 2nd Vice President Jenaro Sanjinés Calderón (1843–1913) 19 August 1896 12 April 1899 Conservative 1896 Severo Fernández Ousted from office by the Federal Revolution of 1899. colspan=9 1st Vice President Lucio Pérez Velasco 25 October 1899 24 January 1903 Liberal — José Manuel Pando Appointed by the National Convention as Vice President for 4 years. Sentenced to banishment by José Manuel Pando. 1st Vice President colspan=7 — José Manuel Pando 2nd Vice President Aníbal Capriles Cabrera (1854–1924) 25 October 1899 14 August 1904 Liberal — José Manuel Pando Appointed by the National Convention as Vice President for 4 years. 1st Vice President Eliodoro Villazón 14 August 1904 12 August 1909 Liberal 1904 Ismael Montes 2nd Vice President Valentín Abecia Ayllón (1846–1910) 14 August 1904 12 August 1909 Liberal 1904 Ismael Montes 1st Vice President Macario Pinilla Vargas 12 August 1909 14 August 1913 Liberal 1909 Eliodoro Villazón 2nd Vice President Juan Misael Saracho (1857–1915) 12 August 1909 14 August 1913 Liberal 1909 Eliodoro Villazón 1st Vice President Juan Misael Saracho 14 August 1913 1 October 1915 Liberal 1913 Ismael Montes Died in office. 1st Vice President colspan=7 1913 Ismael Montes 2nd Vice President José Carrasco Torrico (1863–1921) 14 August 1913 15 August 1917 Liberal 1913 Ismael Montes 1st Vice President Ismael Vázquez Virreira 15 August 1917 12 July 1920 Liberal 1917 José Gutiérrez Guerra Ousted from office by a coup d'état. 2nd Vice President José Santos Quinteros (1865–1951) 15 August 1917 12 July 1920 Liberal 1917 José Gutiérrez Guerra Ousted from office by a coup d'état. colspan=9 === Single vice presidency (1921–present) === Portrait Name Term of office Term of office Party Party Elected President Notes R. Portrait Name Start End Party Party Elected President Notes R. colspan=7 rowspan=3 The Convention of 1921 abolished the double Vice Presidency. Bautista Saavedra Felipe Segundo Guzmán Abdón Saavedra (1872–1942) 10 January 1926 28 May 1930 Socialist Republican Dec.1925 Hernando Siles Reyes colspan=7 rowspan=2 Council of Ministers Carlos Galindo José Luis Tejada Sorzano 5 March 1931 27 November 1934 Genuine Republican 1931 Daniel Salamanca Urey Assumed the presidency after the resignation of Daniel Salamanca Urey. colspan=7 rowspan=3 Tejada Sorzano David Toro Germán Busch Germán Busch Enrique Baldivieso (1902–1957) 28 May 1938 24 April 1939 — — Appointed by the National Assembly as Vice President. Ousted from office by a self-coup of Germán Busch. Germán Busch colspan=7 rowspan=2 Carlos Quintanilla Carlos Quintanilla colspan=7 rowspan=3 Carlos Quintanilla amends the Constitution removing the position of Vice President. Enrique Peñaranda Gualberto Villarroel Gualberto Villarroel Julián Montellano (1900–1989) 6 November 1945 21 July 1946 — — Appointed by the National Assembly as Vice President. Ousted from office by a coup d'état. colspan=7 rowspan=2 Néstor Guillén Tomás Monje Mamerto Urriolagoitía 10 March 1947 17 October 1949 Republican Socialist Unity 1947 Enrique Hertzog Assumed the presidency after the resignation of Enrique Hertzog. colspan=7 rowspan=3 Mamerto Urriolagoitía Hugo Ballivián Hernán Siles Zuazo Hernán Siles Zuazo 15 April 1952 6 August 1956 Revolutionary Nationalist Movement — Víctor Paz Estenssoro Ñuflo Chávez Ortiz (1923–1996) 6 August 1956 24 June 1957 Revolutionary Nationalist Movement 1956 Hernán Siles Zuazo Resigned. colspan=7 Hernán Siles Zuazo Juan Lechín Oquendo (1914–2001) 6 August 1960 6 August 1964 Revolutionary Nationalist Movement 1960 Víctor Paz Estenssoro René Barrientos 6 August 1964 4 November 1964 Revolutionary Nationalist Movement 1964 Víctor Paz Estenssoro Ousted Víctor Paz Estenssoro in a coup d'état. colspan=7 rowspan=2 René Barrientos Alfredo Ovando Candía Luis Adolfo Siles Salinas 6 August 1966 27 April 1969 Social Democratic 1966 René Barrientos Assumed the presidency after the death of René Barrientos. colspan=7 Jaime Paz Zamora 10 October 1982 14 December 1984 Democratic and Popular Union 1980 Hernán Siles Zuazo Resigned to run for presidency. colspan=7 Hernán Siles Zuazo Julio Garrett Ayllón (1925–2018) 6 August 1985 6 August 1989 Revolutionary Nationalist Movement 1985 Víctor Paz Estenssoro Luis Ossio (1930–2016) 6 August 1989 6 August 1993 Revolutionary Left Movement 1989 Jaime Paz Zamora Víctor Hugo Cárdenas (1951–) 6 August 1993 6 August 1997 Revolutionary Nationalist Movement 1993 Gonzalo Sánchez de Lozada Jorge Quiroga 6 August 1997 7 August 2001 Nationalist Democratic Action 1997 Hugo Banzer Assumed the presidency after the resignation of Hugo Banzer. colspan=7 Jorge Quiroga Carlos Mesa 6 August 2002 17 October 2003 — 2002 Gonzalo Sánchez de Lozada Assumed the presidency after the resignation of Gonzalo Sánchez de Lozada. colspan=7 rowspan=2 Carlos Mesa Eduardo Rodríguez Álvaro García Linera (1962–) 22 January 2006 22 January 2010 Movement for Socialism 2005 Evo Morales Álvaro García Linera (1962–) 22 January 2010 22 January 2015 Movement for Socialism 2009 Evo Morales Álvaro García Linera (1962–) 22 January 2015 10 November 2019 Movement for Socialism 2014 Evo Morales colspan=7 Jeanine Áñez David Choquehuanca 8 November 2020 Incumbent Movement for Socialism 2020 Luis Arce ==References== Bolvia",
 "title": "Vice President of Bolivia"
}