{
 "id": "797763",
 "text": "Mersal () is a 2017 Indian Tamil-language action thriller movie directed and co-written by Atlee. It was produced by Thenandal Studio Limited. The movie stars Vijay with S. J. Surya, Kajal, Samantha, and Nithya Menen. Vijay is playing a triple role in this movie for the first time. ==Synopsis== The story revolves around two brothers in which one is a magician who avenges his father's death and medical crimes. Another is a reputed doctor who takes a small amount of money from his patients. ==Cast== * Vijay in a triple role as Vetrimaaran / Vetri / Dr. Maaran * Kajal Aggarwal as Dr. Anu Pallavi, Vetri's love interest * Nithya Menen as Aishwarya \"Aishu\" Vetrimaaran, Vetrimaaran's wife * Samantha as Tara, a media reporter * Vadivelu as Vadivu * S. J. Surya as Daniel Arockiyaraj, the antagonist * Sathyaraj as DC Rathnavel \"Randy\" * Kovai Sarala as Sarala * Hareesh Peradi as Arjun Zachariah, Anu Pallavi's dean head * Sathyan as Maniya, Rathnavel's assistant * Shivani Murali as Paapu, Anu Pallavi's friend * Rajendran as Health Minister * Yogi Babu as Nolan * Kaali Venkat as Poongodi's father * Devadarshini as a nurse * Surekha Vani as a nurse == Release == Mersal was released worldwide on 18 October 2017, which coincides with the Diwali festival. Before its release, the movie faced problems regarding title issues, and censorship because, the film refused to approve NoC from the Animal Welfare Board of India for the use of few animals without permission. As a result, Central Board of Film Certification refused approval for censorship. On 16 October 2017, the film received a U/A certificate from CBFC, with few cuts after receiving NoC from AWBI. == Reception == Mersal received positive reviews from critics. The Times of India gave the film 3.5 out of 5 stars and said \"With Mersal, we have got this year's most engaging mass masala movie. When you have a mass hero in full form like Vijay is in the film, how can things go wrong?\". The Indian Express also gave 3.5 out of 5 stars and said \"Atlee has not just exploited Vijay's stardom to deliver a flamboyant crowd-pleaser (which he did in Theri already) but has fleshed out an interesting script that plays up the best onscreen traits of the actor\". == Soundtrack == A. R. Rahman composed the soundtrack album and background score of Mersal, teaming up with Vijay for the third time, after his films Udhaya(2004), and Azhagiya Tamizh Magan (2007), and his first collaboration with Atlee. The lyrics for the film were written by Vivek, who also teams up with Rahman for the first time. No. Title Singer(s) Length 1\\. \"Aalaporaan Thamizhan\" Kailash Kher, D. Sathyaprakash, Deepak Blue, Pooja Vaidyanath 5:48 2\\. \"Neethanae\" Shreya Ghoshal, A. R. Rahman 4:29 3\\. \"Maacho\" Sid Sriram, Shweta Mohan 4:35 4\\. \"Mersal Arasan\" G.V. Prakash Kumar, Naresh Iyer, Sharanya Srinivas, T. G. Vishwaprasad 4:16 == References == == Other websites == * Category:Tamil-language movies Category:2010s Indian movies Category:Movies set in Paris Category:2017 action movies Category:2017 thriller movies Category:Pregnancy movies Category:Movies about revenge",
 "title": "Mersal (movie)"
}