{
 "id": "797727",
 "text": "The COVID-19 pandemic started in the city of Wuhan, China in December 2019. It has led to increased acts of prejudice, xenophobia, discrimination, racism and violence against people of Southeast Asian, Hispanic, East Asian, Native American, biracial and black people all over the world. With the spread of the pandemic and in formation of hotspots, like those in Asia, Europe and the Americas, discrimination against people from these hotspots was reported. ==Africa== ===Egypt=== According to the Embassy of Japan in Cairo, store clerks were hesitating to serve Japanese customers. \"Corona\" became a new slur by which to abuse Japanese people on the street. On 10 March 2020, an Uber driver was arrested when a viral video forcibly removing a Chinese passenger in Cairo's Maadi district. The passenger was thought to have the coronavirus. The incident caused an uproar among Egyptians when the video was uploaded. Some Egyptians visited the Chinese man in his hotel room. ===Ethiopia=== Violence toward foreign people was reported during the pandemic. Some local people attacked foreign people. The attackers published a number of photos of them under social media and linked them to the Covid-19. ===Kenya=== A video reportedly recorded in Kibera, Kenya showed an angry crowd threatening a man and woman of East Asian descent about the coronavirus. A man in the crowd shouted at the couple, \"You are corona!\" In the crowd, a motorcycle rider raised his hand and threatened slapping the Asian man. The couple looked angry. They began swearing toward the crowd before the video ended. ==Asia== ===China=== There have been instances of Wuhan natives in other provinces being turned away from hotels. Their ID numbers, home addresses and telephone numbers were deliberately leaked online. They also dealt with harassing phone calls from strangers. Many hotels or guesthouses declined people who had addresses in Wuhan. A number of hotels refused to check-in a Wuhan tour guide. She returned to Hangzhou from Singapore. One of the hotels called police to give her a health check. They then asked the police to quarantine her. ===Hong Kong=== Over 100 restaurants in Hong Kong turned away customers from mainland China. One restaurant demanded that a customer produce a Hong Kong identity card to prove they weren't from the mainland. ===South Korea=== Over 760,000 South Korean citizens signed a petition wanting the government to ban foreign tourists from entering this country. No Chinese signs have been popping up. Some businesses banned all foreigners. ==Europe== ===Belgium=== There were reports of Asian people of increased racism in Belgium due to the pandemic. ===France=== Non-Western restaurants, including Chinese, Thai, Japanese and Cambodian reported not as many customers coming. The scale of the decline ranged from 30% to 50%. South Korean mass media reported an increased animosity toward South Korean nationals. Asians in Paris reported harassment and racism. ==North America== ===Canada=== Racism, violence and discrimination were committed against mixed race, biracial, Southeast Asian and East Asian people in Canada. ===United States=== In the United States, 58% of Asian Americans and 45% of African Americans believed that racist views toward them had been committed since the pandemic. That's according to a Pew Research study. ==References== Category:2020 Category:COVID-19 pandemic",
 "title": "List of incidents of xenophobia and racism related to the COVID-19 pandemic"
}