{
 "id": "797834",
 "text": "Danger Mouse is a children’s animated television series. It is remake of an original series from the 20th century. ==Characters== *Narrator (voiced by Dave Lamb) *Danger Mouse (voiced by Alexander Armstrong) *Penfold (voiced by Kevin Eldon) *Colonel K (voiced by Stephen Fry) *Greenback (voiced by Ed Gaughan) *Stiletto (voiced by Dave Lamb) *Squawkencluck (voiced by Shauna MacDonald) ==Episodes== ===Season 1 (2015-2016)=== No. Title Date Prod. Code Summary 1 Danger Mouse Begins Again September 28, 2015 101 Danger Mouse and Penfold get fired after damaging London. 2a Danger At C Level September 29, 2015 102a Danger Mouse's holiday is ruined when sea monsters attack a cruise. 2b Greenfinger September 30, 2015 102b A Welsh plant comes to life and grows around London 3a Planet of the Toilets October 1, 2015 103a Penfold drops a chip in a Japanese toilet, causing it to come to life. 3b Pink Dawn October 2, 2015 103b Dawn gets mutated into a powerful princess known as Pink Dawn. 4a Big Head Awakens October 5, 2015 104a Squawkencluck creates a new security system that goes haywire. 4b The Worldwide Spider October 6, 2015 104b Penfold finds a giant web that wakes up a giant spider that wants to eat Earth. One problem: Danger Mouse is afraid. 5a The Other Day The Earth Stood Still October 7, 2015 105a Traffic lights appear all over the world. 5b Welcome To Danger World October 8, 2015 105b Quark invades Earth and makes Danger Mouse a superstar. 6a Jeopardy Mouse October 9, 2015 106a The world is mixed up. 6b Return of Danger K October 12, 2015 106b Danger Mouse and Penfold lose their manners and Colonel K must help. 7a The Unusual Suspects October 14, 2015 107b Somebody is out to steal Formula X and Colonel K thinks their is a mole 7b The Inventor Preventor February 15, 2016 110a Isambard King Kong Brunel goes back in time to stop the inventions from existing. 8a Danger Fan October 15, 2015 108a Ian wins a contest to be with Danger Mouse, but he’s stalling his missions. 8b Big Penfold October 13, 2015 107a Penfold gets enormous. 9a Quark Games October 16, 2015 108b Danger Mouse, Penfold, and Jeopardy Mouse is kidnapped and forced to fight each other. 9b Never Say Clever Again February 16, 2016 110b Penfold eats a celery that makes him smart, but he gets stupid later. 10 The Snowman Cometh December 16, 2015 109 The Snowman kidnaps Santa and cancels Christmas. 11a Sinister Mouse February 17, 2016 111a Danger Mouse gets framed for stolen items, and Penfold must figure out who framed him. 11b Theres No Place Like Greenback February 18, 2016 111b Greenback suffers amnesia. 12a Happy Boom Day February 22, 2016 112b Robot presents, killer cards, and exploding presents ruin Professor Squawekenclucks birthday. 12b Frankensquawks Monster February 23, 2016 113a Professor Squawkenclucks mother visits. 13a From Duck To Dawn February 19, 2016 112a Duckula turns people to vegetables 13b Big Head Awakens February 24, 2016 113b Squawkencluck reboots Big Head that will scan brainwaves and lock em up. But it goes too far. ===Season 2 (2016)=== No. overall No. in season Title Date Prod. Code Summary 14a 1a Megahurtz Attacks February 25, 2016 201a Danger Mouse cheats Penfold so he can win against a hologram. But it gets angry. 14b 1b The Hamster Effect February 26, 2016 201b Isambard King Kong Brunel goes back in time to stop Danger Mouse from becoming a secret agent, but unintentionally stops DM and Penfold from meeting. 15a 2a The Good, the Baaaad, and the Ugly June 3, 2016 202a Danger Mouse and Penfold try to find Danger Sheep, but Danger Mouse gets caught in a villain competition along the way. 15b 2b Attack of the Clowns June 27, 2016 202b When Danger Mouse makes fun of aliens, they invade Earth. 16a 3a Cheesemageddon June 28, 2016 203a Danger Mouse accidentally handcuffs himself with Greenback. 16b 3b Queen of Weevils June 29, 2016 203b Danger Mouse accidentally unleashes the Queen of Weevils. 17a 4a Wicked Leaks July 1, 2016 204b Penfold jeopardizes a mission to stop Greenback from stealing a diamond by revealing Danger Mouse’s secrets. 17b 4b Hail Hydrant June 30, 2016 204a Colonel K sends Danger Mouse to America to learn from Jeopardy Mouse. 18a 5a Tomorrow Never Comes July 4, 2016 205a The Princess erases the weekdays. 18b 5b Send in the Clones July 6, 2016 206a A phony Danger Mouse and Penfold does the real ones work. 19a 6a Half the World is Enough July 5, 2016 205b Squawkencluck loses her job. Category:2010s animated television series Category:2018 Canadian television series debuts Category:2019 Canadian television series endings",
 "title": "Danger Mouse (2015)"
}