{
 "id": "797944",
 "text": "Abella Danger (born November 19, 1995) is an American pornographic actress and model. Abella Danger made her pornography debut in July 2014 for Bang Bros. She has appeared in mainstream news media other than adult news media. This includes the websites Elite Daily and International Business Times. In 2018, Fortune said she was one of the most popular and in-demand performers in the pornographic business. == Early life == She was born in Miami, Florida. == Awards == Year Event Award Film 2016 AVN Award Best New Starlet rowspan=5 2016 XBIZ Award Best New Starlet 2016 XRCO Award Best New Starlet 2016 AVN Award Hottest Newcomer 2016 NightMoves Award Best Female Performer (Editor's Choice) 2017 AVN Award Best Star Showcase Abella 2017 AVN Award Best Double Penetration Sex Scene (with Markus Dupree and Mick Blue) Abella 2017 AVN Award Best Virtual Reality Sex Scene (with Joanna Angel and Manuel Ferrara) Angel 'n Danger 2017 NightMoves Award Best Butt (Editor's Choice) 2017 NightMoves Award Best All Girl Release (Fan's Choice) Riley & Abella 2018 XBIZ Award Best Sex Scene – Gonzo Release (with Markus Dupree) Fucking Flexible 2 2018 XBIZ Award Best Sex Scene – Comedy Release (with Joanna Angel and Isiah Maxwell) Jews Love Black Cock 2018 XRCO Award Orgasmic Analist rowspan=3 2018 NightMoves Award Best Butt (Editor's Choice) 2018 Pornhub Award Top Squirting Performer 2019 AVN Award Best Group Sex Scene (with Angela White, Kira Noir, Mia Malkova, Tori Black, Ana Foxxx, Jessa Rhodes, Vicki Chase, Mick Blue, Alex Jones, Bambino, Ricky Johnson, and Ryan Driller) After Dark 2019 AVN Award Most Epic Ass rowspan=7 2019 XRCO Award Awesome Analist 2019 NightMoves Award Best Butt (Fan's Choice) 2019 Pornhub Award Most Popular Female Pornstar by Women 2019 Pornhub Award Best Instagram 2019 Pornhub Award Hottest Ass 2020 AVN Award Most Epic Ass 2020 XBIZ Award Best Sex Scene – Erotic-Themed (with Small Hands) Her and Him 2020 XRCO Award Awesome Analist rowspan=15 2020 Pornhub Award Top Squirting Performer 2020 Pornhub Award Hottest Ass 2021 AVN Award Most Epic Ass 2021 Fleshbot Award Best Asshttps://avn.com/news/technology/2021-fleshbot-awards-winners- announced-172467 2022 AVN Award Most Epic Ass 2022 Pornhub Award Top Anal Performer 2022 Pornhub Award Hottest Ass 2023 AVN Award Most Amazing Ass 2023 Pornhub Award Most Popular Female Performer 2023 Pornhub Award Hottest Ass 2024 AVN Award Most Amazing Ass 2024 Urban X Award Hall of Fame 2024 Pornhub Award Hottest Ass 2025 AVN Award Most Amazing Ass ==References == == Other websites == * * * Category:1995 births Category:Living people Category:American pornographic actors Category:Models from Florida Category:Actors from Miami Category:LGBT entertainers Category:AVN Award winners",
 "title": "Abella Danger"
}