{
 "id": "798317",
 "text": "Zee Tamil Kudumbam Viruthugal is an Award ceremony show which held by the network Zee Tamil. It honour the cast and crew of Tamil soap operas and other shows which air on Zee Tamil. This is the second time of the Tamil television industry where awards are given for performances in television serials and shows. ==Nominations== Jurors select five nominees in each award category from among the shows that air on Zee Tamil. The nominees are interviewed on Zee Tamil and viewers are invited to cast their votes via text message or at the Zee Tamil Awards website. == Zee Tamil Kudumbam Viruthugal 2019 == Best Comedian Diwakar Best Comedian Azhagappan Best Female Comedian Akshaya Favourite Pair On-Screen Karthik Raj and Shabana & Puviarasu and Ashwini Most Popular Marumagal Ashwini Best Hero Vishnu Vijay Best Heroine Ayesha Most Promising Actor Male Akshay Kamal Most Promising Actor Female Shivani Best Villi Chaitra Reddy Most Popular Appa Rajashekar Most Popular Amma Uve Sri Favourite Heroine Shabana Favourite Hero Karthik Raj Most Popular Maamiyar Lakshmi Favourite Serial Sembaruthi Best Serial Sathya == Zee Tamil Kudumbam Viruthugal 2020 == Best Actor Jai Akash Best Actress Mounika & Chaitra Reddy Best Comedian Indiran Most Popular Marumagal Reshma Most Popualr Maamiyaar Yuvasree Most Promising Actor (Male) Nandha Master Most Promising Actor (Female) Asha Gowda Most Popular Appa Sairam Most Popular Amma Soniya Bose Venkat Best Supporting Actor (Male) Bharath Non-Fiction Special Award GENES Best Serial Neethane Yenthan Ponvasntham Best Pair on -screen Puviarasu & Ashwini Favorite Hero Karthik Raj Favorite Heroine Shabana Shahjahan Favorite Pair On-Screen Karthik Raj & Shabana Favorite Villain Lakshmi Favorite Anchor Priya Raman Favorite Serial Sathya Lifetime Achievement Award Nalini ==References== ==Other websites== * Zee Tamizh Official website Category:Zee Tamil Programming Category:Entertainment awards",
 "title": "Zee Tamil Kudumbam Viruthugal"
}