{
 "id": "798478",
 "text": "Euphoria is an American teen drama television series created by Sam Levinson. It is based on the Israeli miniseries of the same name created by Ron Leshem and Daphna Levi. Euphoria tells about a group of high school students about their experiences of sex, drugs, friendship, love, identity, and trauma. The series stars Zendaya. It was premiered on HBO on June 16, 2019. In July 2019, the series was continued for a second season. == Premise == Euphoria follows teenagers in the fictional town of East Highland, California, who seek hope while balancing the strains of love, loss, and addiction. Topics such as child abuse, drug abuse, toxic relationships, toxic positivity, hookup culture, mental illness, codependency, infidelity, relapsing, repressed homosexuality, sobriety, human trafficking, domestic violence, rape, toxic masculinity, drug dealing, dating violence, and grief are explored. ==Cast and characters== * Zendaya as Ruby Rue Bennett, a teenage drug addict who is fresh out of rehab and struggling to find her place in the world. She serves as the show's narrator. * Maude Apatow as Alexandra Lexi Howard, Rue's childhood best friend and Cassie's younger sister. * Angus Cloud as Fezco Fez O'Neill, a local drug dealer with a close relationship to Rue. * Eric Dane as Cal Jacobs, Nate's strict, demanding father with a dangerous double life. * Alexa Demie as Madeleine Maddy Perez, a popular student and Nate's on-and-off girlfriend. * Jacob Elordi as Nathaniel Nate Jacobs, a high school athlete, and Maddy's on- and-off abusive boyfriend, whose anger issues mask his sexual insecurities. * Barbie Ferreira as Katherine Kat Hernandez, (seasons 1–2), a girl fighting for body positivity while exploring her sexuality. * Nika King as Leslie Bennett, Rue and Gia's mother. * Storm Reid as Georgia Gia Bennett, Rue's younger sister. * Hunter Schafer as Jules Vaughn, a transgender girl who enters a turbulent relationship with Rue after moving to East Highland. * Algee Smith as Christopher Chris McKay (season 1; guest season 2), a young football player and Cassie's ex-boyfriend who has difficulties adjusting to college. * Sydney Sweeney as Cassandra Cassie Howard, Lexi's older sister and McKay's ex- girlfriend with an infamous sexual history that continues to haunt her. * Colman Domingo as Ali Muhammed (b. Martin) (\"Trouble Don't Last Always\"; recurring seasons 1–2), a man in recovery from drug addiction who often speaks at Rue's Narcotics Anonymous meetings and eventually becomes her sponsor. * Javon \"Wanna\" Walton as Ashtray O'Neill (season 2; recurring season 1), Fez's unofficially adopted \"little brother\" and a drug dealer. * Austin Abrams as Ethan Daley (season 2; recurring season 1), Kat's love interest. * Dominic Fike as Elliot (season 2–present), a new \"friend\" of Rue's, who comes between her and Jules. == References == == Other websites == * * * Category:Bipolar disorder in fiction Category:HBO television series Category:Sexual abuse Category:Works about drugs Category:2010s American drama television series Category:LGBT drama television series Category:English-language television programs",
 "title": "Euphoria (American TV series)"
}