{
 "id": "79899",
 "text": "David Émile Durkheim (April 15, 1858 – November 15, 1917) was a French sociologist. He made important contributions to sociology and anthropology. He is considered as one of the founding fathers of sociology. He believed that the study of sociology should be scientific in nature. ==Life & work== === Personal life === Durkheim was born into an Orthodox Jewish family in the eastern French province of Lorraine. (At the time, this area was disputed territory between France and Germany.) Durkheim married Louise Dreyfus in 1887, with whom he had two children. Durkheim died of a stroke in Paris on November 15, 1917, at the age of 59, two years after the death of his son during World War I. === Education === He studied at École Normale Supérieure, where his class was considered to have produced some of the most prolific French intellectuals of his time. It was around this time that Durkheim began to develop an interest in studying societies from a scientific perspective. Since he was unable to study social sciences in France, he travelled to Germany in order to continue his sociological pursuits. === Teaching === Following the publication of several articles based on his studies in Germany, Durkheim was appointed to teach the first social science course at the University of Bordeaux in 1887. Throughout the next two decades, he would go on to publish a number of influential works in the field of sociology. Eventually, in 1906, Durkheim was given the position of professor and chair of education and sociology at the University of Paris. === Academic journal === In 1898, Durkheim established L'Année Sociologique, a peer-reviewed academic journal. Many notable sociologists were early contributors to the journal, including Marcel Mauss, Henri Hubert, and Célestin Bouglé. == Influences == === Auguste Comte === Durkheim drew significant inspiration from the work of Auguste Comte, a French philosopher and mathematician considered to be one of the earliest contributors to sociological thought. Comte’s theory of positivism asserted that the sciences could be classified in order of complexity, with sociology being both the most recent and most complicated. Comte believed that the philosophy and history of a science were inseparable, and one must understand both in order to fully know a science. Durkheim latched on to Comte’s idea that the scientific method could be applied to social sciences with an emphasis on assessing the facts. This can be seen in his approach to studying society, in which he places great emphasis on what he deems “social facts” and attempts to explain sociological phenomena through a more scientific lens. === Religion === Scholars have argued over whether, or how much, Durkheim’s Jewish heritage influenced his sociological theories. Despite eventually leading a secular life himself, he still grew up experiencing the antisemitism of the French. Though not focused on Judaism specifically, much of Durkheim's later work explored the role of religion in keeping people unified and societies functioning. ==Notable Works & Theories== Durkheim believed that society is built upon shared rules and values. These rules are upheld by institutions like schools, families, and governments, which help to keep society functioning smoothly. They are not just about practical things like education or law enforcement; they also help to shape our morals and beliefs. === Society and the Individual === Durkheim often discussed how the individual and society are intertwined. According to Durkheim, society and the individual are two halves of an inseparable whole. This differed from the ideas of previous scholars like Herbert Spencer. (Spencer thought that society is based on self-interest and contractual relationships). Durkheim argued that societies run smoothly because individuals feel a sense of social belonging and moral obligation to keep society functioning. When people feel more solidarity as members of their society, the society is stronger as a whole. These social bonds can be strengthened through shared beliefs or morals, such as those tied to tradition or religion. Individuals often adapt these concepts to suit their own personal interpretations and livelihoods while still adhering to the same unifying belief system. === The Profane and the Sacred === Durkheim often thought in dualities, particularly in regard to the profane and the sacred. He viewed the soul as sacred while the body was called profane. Society can similarly be split between these two categories. The sacred can consist of religion and other more prestigious ideas. Meanwhile, the profane consists of secular parts of society, like labor. This dichotomy is present in several of Durkheim's theories. === Social Facts === Social facts are phenomena presented across societies which place an external constraint upon the individuals within said societies. These include laws, customs, morals, and other demographics and institutions. Individuals within a society tend to operate in obligation to these coercive factors, either for the good of the society as a whole or to protect their own sense of belonging within the society. === Mechanical vs. Organic Solidarity === Durkheim suggested that the feelings of unity and solidarity fostered by society took on two distinct forms: mechanical and organic. Mechanical solidarity is when common values or ideals unite individuals within a society. Mechanical solidarity emphasizes similarities and shared beliefs between individuals. Meanwhile, organic solidarity highlights their differences. In organic solidarity, the unique roles that individuals play within a society work in tandem with one another and allow them to function as a collective whole. Both of these modes of solidarity ultimately result in social integration. ===Suicide=== Durkheim is famous for his work on suicide. In this case study, he analyzed the causes of suicide from the perspective of society. His theory has two core principles: # That the way people are connected to each other in a group can affect how likely they are to commit suicide; and # That suicide is related to how much a person feels like they belong to their community (social integration) and how much they follow the rules and beliefs of their society (moral integration). Durkheim was not interested on the individual aspect of suicide, instead, he viewed suicide as a result of a \"collective breakdown of society\". Moreover, he viewed it as a symptom of the larger issues in society. Durkheim argued that the rise in suicide rates was directly related to society’s departure from traditional or religious values as it moved toward more modern structures. The lack of a common mindset or obligations toward others led to a decline in an individual’s sense of belonging within a society. == Key Publications == * The Division of Labour in Society (1893) * The Rules of Sociological Method (1895) * Suicide (1897) * The Elementary Forms of Religious Life (1912) == Impact == Durkheim is considered one of the founders of the modern understanding of social science and thus has had considerable influence within the field. He is responsible for introducing social sciences to the French school curriculum. Many of his students went on to adapt his ideas into their own sociological theories. Durkheim’s nephew, sociologist and anthropologist Marcel Mauss, was one of his students who drew influence from his work. The two collaborated on Primitive Classifications in 1903, an essay published in L'Année Sociologique which responded to categorizations presented by idealist Immanuel Kant. Durkheim and Mauss argued that categories of human thought are strongly influenced by the societies from which they originate rather than by individuals. The sociological theories proposed by Durkheim received their fair share of criticism. His ideas clashed with those of Karl Marx, who placed heavy emphasis on the role of inequalities between classes as a source of societal conflict. Other critics have accused Durkheim of oversimplifying human behavior and failing to acknowledge the complexity of social and religious experiences within different societies. == References == Category:1858 births Category:1917 deaths Category:19th-century French philosophers Category:20th-century French philosophers Category:Agnostics Category:French anthropologists Category:French atheists Category:French socialists Category:French sociologists Category:Jewish atheists Category:Jewish French academics Category:Jewish philosophers Category:People from Épinal Category:Writers from Grand Est",
 "title": "Émile Durkheim"
}