{
 "id": "798971",
 "text": "The 1999–2000 UEFA Cup season was the 29th edition of the UEFA Cup. The final was played at Parken Stadium in Copenhagen. It was won by Galatasaray, who beat in the final. The defending champions were they were eliminated by Werder Bremen in the fourth round. It was the first season of the new UEFA Cup format. Domestic cup winners would qualify for the UEFA Cup, after the UEFA Cup Winners' Cup was disbanded. This change also added an additional knockout round. This was the first year when the UEFA Cup winners qualified for the UEFA Super Cup. ==Association team allocation== A total of 142 teams from 49 UEFA associations participated in the 1999–2000 UEFA Cup. Associations are allocated places according to their 1999–2000 UEFA league coefficient. Below is the qualification scheme for the 2000–01 UEFA Cup: *Associations 1–6 each enter three teams *Associations 7–8 each enter four teams *Associations 9–15 each enter two teams *Associations 16–21 each enter three teams *Associations 22–50 each enter two teams, with the exception of Bosnia who no enter teams, Liechtenstein and Andorra who enter one team each *3 winners of the Intertoto Cup *16 teams eliminated from the 1999–2000 UEFA Champions League third qualifying round are transferred to the UEFA Cup *8 teams eliminated from the 1999–2000 UEFA Champions League first group stage are transferred to the UEFA Cup ===Association ranking=== {| class=\"wikitable\" Rank Association Coeff. Teams Notes 1 Italy 59.640 3 +1(UCL) +1(IT) 2 Germany 49.932 +2(UCL) 3 Spain 48.580 +1(UCL) 4 France 41.433 +1(UCL) +1(IT) 5 Netherlands 35.916 6 England 35.566 +1(UCL) +1(IT) 7 Portugal 31.266 4 8 Greece 28.750 +2(UCL) 9 Czech Republic 28.166 2 +1(UCL) 10 Norway 27.449 +1(FP) 11 Austria 27.250 +2(UCL) 12 Russia 26.866 +1(UCL) 13 Croatia 26.166 14 Turkey 25.650 +1(UCL) 15 Denmark 24.200 +2(UCL) 16 Switzerland 22.250 3 +1(UCL) 17 Ukraine 22.082 18 Poland 22.000 +1(UCL) ;Notes *(UCL): Additional teams transferred from the UEFA Champions League *(IT): Additional teams from Intertoto Cup ===Teams=== The labels in the parentheses show how each team qualified for the place of its starting round: * TH: Title holders * CW: Cup winners * CR: Cup runners-up * LC: League Cup winners * Nth: League position * PO: End-of-season European competition play- off winners * FP: Fair play * IT: Intertoto Cup winners * CL: Relegated from the Champions League ** GS: Third-placed teams from the group stage ** Q3: Losers from the third qualifying round Third round Bayer Leverkusen Arsenal Sturm Graz Galatasaray Borussia Dortmund Olympiacos Spartak Moscow Rangers First round Roma Leeds United Osijek Rapid Wien Udinese Tottenham Hotspur Fenerbahçe AaB Bologna Newcastle United Akademisk Boldklub Brøndby Werder Bremen Beira-Mar Lausanne Servette Kaiserslautern Benfica Karpaty Lviv Widzew Łódź Wolfsburg Sporting CP Amica Wronki MTK Hungária Celta de Vigo Vitória Setúbal Debrecen Anorthosis Deportivo La Coruña Panathinaikos Lierse Hapoel Haifa Atlético Madrid PAOK Dukla Banská Bystrica Skonto Nantes Ionikos ParmaTH Partizan Monaco Aris Mallorca Zimbru Chişinău Lens Slavia Prague Lyon Juventus Ajax Stabæk AEK Athens Montpellier Vitesse LASK Linz Teplice West Ham United Roda Zenit Saint Petersburg Qualifying round Sigma Olomouc Steaua București VPS Linfield Viking Dinamo București FK Rīga Birkirkara Grazer AK Helsingborg Liepājas Metalurgs Sliema Wanderers Lokomotiv Moscow Göteborg CSKA Sofia Inter Cardiff Hajduk Split Torpedo Kutaisi Levski Sofia Cwmbrân Town Ankaragücü Locomotive Tbilisi Vardar Bray Wanderers Lyngby APOEL Sileks Cork City Grasshopper Omonia Kareda Šiauliai KÍ Klaksvík Zürich Celtic FBK Kaunas B36 Tórshavn Shakhtar Donetsk St Johnstone Red Star Belgrade Vllaznia Kryvbas Kryvyi Rih Hapoel Tel Aviv Vojvodina Bylis Legia Warsaw Maccabi Tel Aviv Sheriff Tiraspol F91 Dudelange Lech Poznań Gorica Constructorul Chişinău Mondercange Ferencváros Olimpija Ljubljana Vaduz Neftchi Baku Újpest Belshina Bobruisk Levadia Maardu Shamkir Club Brugge BATE Borisov Lantana Tallinn Principat Anderlecht KR Reykjavík Shirak Bodø/Glimt Inter Bratislava Leiftur Yerevan Kilmarnock Spartak Trnava HJK Helsinki Portadown Viljandi Tulevik ;Notes == Qualifying round == |} == First round == |} == Second round == |} == Third round == |} == Fourth round == |} == Quarter-finals == |} ===First leg=== \\---- \\---- \\---- ===Second leg=== Leeds United won 4–2 on aggregate. \\---- Galatasaray won 6–2 on aggregate. \\---- Arsenal won 6–2 on aggregate. \\---- Lens won 2–1 on aggregate. == Semi-finals == |} ===First leg=== \\---- ===Second leg=== Arsenal won 3–1 on aggregate. \\---- Galatasaray won 4–2 on aggregate. == Final == ==Top goalscorers== Rank Name Team Goals Minutes played 1 Darko Kovačević Juventus 10 720' 2 Marco Di Vaio Parma 7 460' Jimmy Floyd Hasselbaink Atlético Madrid 574' Thierry Henry Arsenal 592' Pascal Nouma Lens 875' 6 Benni McCarthy Celta Vigo 6 796' Hakan Şükür Galatasaray 833' ==References== == Other websites == *1999–2000 All matches UEFA Cup – season at UEFA website *Official Site *Results at RSSSF.com * All scorers 1999–2000 UEFA Cup according to (excluding preliminary round) according to protocols UEFA + all scorers preliminary round *1999/2000 UEFA Cup – results and line- ups (archive) Category:UEFA Category:1999–2000 in European football",
 "title": "1999–2000 UEFA Cup"
}