{
 "id": "799058",
 "text": "Roald Dahl's The Witches (also known as The Witches) is a 2020 dark fantasy comedy movie directed by Robert Zemeckis and written by Zemeckis, Kenya Barris, and Guillermo del Toro. It is based on the 1983 novel of the same name by Roald Dahl and is the second feature-length adaptation of the novel, following the 1990 movie of the same name. The movie stars Anne Hathaway, Octavia Spencer and Stanley Tucci, and is narrated by Chris Rock. The Witches was made available on HBO Max in the United States on October 22, 2020. It received mixed reviews from critics. == Plot == A boy named Charlie moves in with his grandmother, Agatha, after the death of his parents. While at the shop, he encounters a strange lady. Agatha tells him that the lady is a witch. Agatha tells Charlie that witches hate children and that they disguise themselves as normal women. They go to a hotel to get away from the witch. Agatha gives Charlie a pet mouse named Daisy. He hides in the hotel ballroom so he can train her in secret. However, a group of women enter so Charlie hides under the stage. It is revealed that the women are witches and they are having their annual meeting. The Grand High Witch introduces her new potion which transforms children into mice. She demonstrates it on a boy named Bruno Jenkins. The witches also find Charlie and turn him into a mouse. Charlie and Bruno are rescued by Daisy, who is revealed to have also been a child-turned- mouse. The mice escape back to Agatha. Charlie steals the potion from the Grand High Witch's hotel room and puts it in the witches' soup at dinner. All of the witches become mice. Agatha and the three mice fight the Grand High Witch in her hotel room and catapult the potion into her mouth. She becomes a mouse. A few years later, Charlie and Agatha are teaching children how to avoid witches. == Cast == * Jahzir Bruno as Charlie Hansen * Octavia Spencer as Agatha Hansen (the grandmother) * Anne Hathaway as the Grand High Witch * Codie-Lei Eastick as Bruno Jenkins * Stanley Tucci as Mr Stringer (hotel manager) * Kristin Chenoweth as Daisy * Charles Edwards as Mr Jenkins * Morgana Robinson as Mrs Jenkins * Josette Simon as Zelda (a witch) ==References== Category:2020 comedy movies Category:2020 fantasy movies Category:Movies based on books Category:American fantasy movies Category:American comedy movies Category:Movies about witchcraft Category:Movies about mice Category:Warner Bros. movies Category:Movies directed by Robert Zemeckis Category:Movies composed by Alan Silvestri Category:HBO Max",
 "title": "The Witches (2020 movie)"
}