{
 "id": "799096",
 "text": "The egg fruit is a fruit that people eat. Grown-up egg fruit trees are about 8 m tall and their fruits are about 7-12 cm long when good for picking. ==Overview== Egg fruits have different shapes. Some have a straight point at the end and curved at the tip. When ready to eat, the egg fruit skin looks yellowish-orange and may have brown marks. Each friit has 1-4 hard black seeds. Egg fruit smell musky when good for eating. In temperate places, egg fruits come out in fall. In tropical places, they come out in summer. ==Terminology== The egg fruit is also known as the canistel and scientist name its plant Pouteria campechiana. It is in the Sapotaceae Family and closely related to the Sapota. Egg fruits are sometimes called yellow sapotes. As raw food, its flesh feels and smells like the yolk of hard-boiled eggs, and tastes like roasted sweet potato. ==Nutrition== Egg fruits are rich in vitamin A, B, and C, and carries some iron and calcium. ==Applications== Egg fruit is often eaten raw as a simple snack with a sprinkle of salt and lemon juice. It is also used in sweet baking applications as a pumpkin-like ingredient. The pureed flesh may be added into custards, ice creams, bread, pancakes, smoothies, milkshakes or made into jams and marmalades. The egg fruit is a central ingredient in recipes for vegan cheesecake, eggnog, deviled eggs, and even cheese. Complimentary flavors include allspice, cinnamon, ginger, thyme, turmeric, orange, maple syrup, pecans, walnuts, almond, coconut, and vanilla. ==Geography== The Egg fruit is native to southern North America and northern Central America, including the countries of Mexico, El Salvador, Belize, and Guatemala. It has since been naturalized throughout the world in tropical and subtropical climates. The trees thrive with moderate precipitation, but can also do well in regions of prolonged dry seasons. This fruit was also known for its smelly seeds. ==References== Category:Fruits Category:Sapotaceae",
 "title": "Egg fruit"
}