{
 "id": "799185",
 "text": "The ultimate fate of our universe may be the heat death of the universe or the big rip. Before that happens, it is possible to predict that the following will happen. Some types of science can say what could happen far into the future. It is worth noting that our local group of galaxies are bound by gravitation, and its changes and aging can be discussed separate from the rest of the universe. Astrophysics can say how planets and stars form, affect each other, and die; particle physics can say how atoms and other matter act over time; evolutionary biology can allow us to see how living things change over time; and plate tectonics can say how continents move over time. By observing the past and present, astrophysicists, particle physicists, evolutionary biologists and geologists can make guesses about what might happen in the future. The second law of thermodynamics is important to predictions about the future of Earth, of the Solar System, and the future of the expanding universe. The second law of thermodynamics says that entropy is always happening. That means that the universe is slowly running out of the kind of energy that can do work. For example, stars will eventually run out of hydrogen fuel and burn out. ==Key== Astronomy and astrophysics Geology and planetary science Biology Particle physics Mathematics Technology and culture ==Earth, the Solar System and the universe== Erosion is when wind, water or other things make a rock or mountain shrink by breaking of tiny pieces of it off over time. Years from now Event 10,000 If the Wilkes Subglacial Basin \"ice plug\" fails in the next few centuries in a way that makes the East Antarctic Ice Sheet fall, it will take up to this long for the sheet to melt completely. Sea levels would rise 3 to 4 meters. 10,000This represents the time by which the event will most probably have happened. It may occur randomly at any time from the present. The red supergiant star Antares will have exploded in a supernova by this time. 13,000 By this point, halfway through the precessional cycle, Earth's axial tilt will be reversed, causing summer and winter to occur on opposite sides of Earth's orbit. This means that winters will be colder and summers will be hotter in the northern hemisphere. This is because the northern hemisphere will be facing towards the Sun when Earth is closest to the Sun and away from the Sun when Earth is furthest away from the Sun. 15,000 According to the Sahara pump theory, the precession of Earth's poles will move the North African Monsoon far enough north to convert the Sahara back to a tropical climate, as it had 5,000–10,000 years ago. 17,000 Best-guess recurrence rate for a \"civilization-threatening\" supervolcanic eruption large enough to throw up 1,000 gigatons of pyroclastic material. 25,000 The northern Martian polar ice cap could recede as Mars becomes warmer during its c. 50,000-year perihelion precession aspect of its Milankovitch cycle. 36,000 The small red dwarf Ross 248 will travel within 3.024 light-years of Earth. It will become the closest star to the Sun. It will recede after about 8,000 years. Then Alpha Centauri and then Gliese 445 will be the nearest stars again (see timeline). 50,000 According to Berger and Loutre (2002), the current interglacial period will end, sending the Earth back into an ice age, even with global warming. According to more recent studies, however (2016), the effects of anthropogenic global warming may delay this otherwise expected glacial period by another 50,000 years. Niagara Falls will have worn away the rock underneath it all the way to Lake Erie, so it will not be a waterfall. The many glacial lakes of the Canadian Shield will have been erased by post- glacial rebound and erosion. 50,000 The length of the day used for astronomical timekeeping reaches about 86,401 SI seconds because lunar tides will have made the Earth's rotation slow down. 100,000 Many of the constellations will look very different as the stars move. 100,000 The hypergiant star VY Canis Majoris will likely have exploded in a supernova. 100,000 Native North American earthworms, such as Megascolecidae, will have spread north through the United States Upper Midwest to the Canada–US border, recovering from the Laurentide Ice Sheet glaciation (38°N to 49°N), assuming a migration rate of 10 meters per year. (Humans have already introduced non- native invasive earthworms of North America.) > 100,000 As one of the long- term effects of global warming, 10% of anthropogenic carbon dioxide will still remain in a stabilized atmosphere. 250,000 Lōʻihi, the youngest volcano in the Hawaiian–Emperor seamount chain, will rise above the surface of the ocean and become a new volcanic island. c. 300,000 At some point in the next few hundred thousand years, the Wolf–Rayet star WR 104 may explode in a supernova. There is a small chance WR 104 is spinning fast enough to produce a gamma-ray burst, and an even smaller chance that the burst could harm life on Earth. 500,000 Earth will likely have been hit by an asteroid of roughly 1 km in diameter, assuming that people cannot stop it. 500,000 The rugged terrain of Badlands National Park in South Dakota will have eroded away completely. 1 million Meteor Crater, a large impact crater in Arizona considered the \"freshest\" of its kind, will have eroded away. 1 million Longest estimated time until the red supergiant star Betelgeuse explodes in a supernova. For at least a few months, the supernova is expected be visible on Earth in daylight after the light reaches Earth. 1 million Desdemona and Cressida, moons of Uranus, will likely have collided. 1.28 ± 0.05 million The star Gliese 710 will pass as close as 0.0676 parsecs— to the Sun before moving away. Its gravity will change things in the Oort cloud, a ring of icy rocks orbiting at the edge of the Solar System. That will make it seem more likely that a comet will hit something in the inner Solar System. 2 million Estimated time for the coral reef ecosystems to return to normal after human-caused ocean acidification; the recovery of marine ecosystems after the acidification event that occurred about 65 million years ago took about this long. 2 million+ The Grand Canyon will erode further, deepening slightly, but principally widening into a broad valley surrounding the Colorado River. 2.7 million Average orbital half-life of current centaur planets. These planets are unstable due to gravity from outer planets. See predictions for notable centaurs. 10 million The East African Rift valley will become much bwider and be flooded by the Red Sea, causing a new ocean basin to divide the continent of Africa and the African Plate into the Nubian Plate and the Somali Plate. 10 million Estimated time for full recovery of biodiversity after a potential Holocene extinction, if it were as large as the five previous major extinction events. Even without a mass extinction, by this time most current species will have disappeared through the background extinction rate, with many clades gradually evolving into new forms. 10 million – 1 billion Cupid and Belinda, moons of Uranus, will likely have collided. 25 million According to Christopher R. Scotese, the movement of the San Andreas Fault will cause the Gulf of California to flood into the Central Valley. This will form a new inland sea on the West Coast of North America. 50 million Maximum estimated time before the moon Phobos crashes into Mars. 50 million According to Christopher R. Scotese, the movement of the San Andreas Fault will move Los Angeles, California and San Francisco, California so that they will have to be one city if people still live there by then. The Californian coast will begin to be subducted into the Aleutian Trench. Africa will crash into Eurasia and close the Mediterranean Basin. This will create a mountain range similar to the Himalayas. The peaks of the Appalachian Mountains will erode away if the weathering takes place at 5.7 Bubnoff units. The mountains will change in other ways too. The valleys will deepen twice as fast. 50–60 million The Canadian Rockies will erode away to a plain, assuming a rate of 60 Bubnoff units. The Southern Rockies in the United States are eroding at a somewhat slower rate. 50–400 million Estimated time for the Earth to naturally replenish its fossil fuel reserves. 80 million The Big Island will sink beneath the surface of the ocean. However, there will still be other Hawaiian islands by then. 100 million By this time, it is likely to have an asteroid about as big as the one that killed some of the dinosaurs 66 million years ago that will likely hit the Earth, if people cannot stop it. 100 million According to the Pangaea Proxima Model created by Christopher R. Scotese, the plate tectonics of the Atlantic Ocean will change, and the Americas will begin to move toward Africa. 100 million The rings of Saturn will change or disappear. 110 million The Sun will be 1% brighter than it is today. 180 million A day on Earth will be one hour longer than it is today because the planet is slowly starting to slow down. 230 million This is as far ahead as people can predict the orbits of the planets due to Lyapunov time. 240 million The Solar System will travel one whole orbit around the Galactic Center. 250 million Due to plate tectonics, the coast of California is likely to have hit Alaska by this time. 250–350 million All the continents on Earth are likely fuse into a supercontinent by this time. Scientists have predicted the Amasia, Novopangaea, and Pangaea Ultima. This will likely result in a glacial period, lowering sea levels and increasing oxygen levels, further lowering global temperatures.Calkin and Young in 1996 on pages 9–75 >250 million Rapid biological evolution may occur if this supercontinent forms, causing lower temperatures and higher oxygen levels.Thompson and Perry in 1997 on pages 127–28 Increased competition between species due to the formation of a supercontinent, increased volcanic activity and less hospitable conditions due to global warming from a brighter Sun could result in a mass extinction event from which plant and animal life may not fully recover. 300 million Due to a shift in the equatorial Hadley cells to roughly 40° north and south, the amount of arid land will increase by 25%. 300–600 million Estimated time for Venus's mantle temperature to reach its maximum. Then, over a period of about 100 million years, major subduction occurs and the crust is recycled. 350 million According to the extroversion model first developed by Paul F. Hoffman, the plate tectonics of the Pacific Ocean will change: its subduction will stop.Nield in 2007 on pages 20–21Hoffman in 1992 on pages 323–27 400–500 million The supercontinent (Pangaea Ultima, Novopangaea, or Amasia) will likely separate into other continents again. This will likely result in higher global temperatures, similar to the Cretaceous period. 500 million Estimated time until a gamma-ray burst, or massive, hyperenergetic supernova, occurs within 6,500 light-years of Earth; close enough for its rays to affect Earth's ozone layer and potentially trigger a mass extinction. This assumes that an explosion like this one caused the Ordovician–Silurian extinction event. However, the supernova would have to be in exactly the right place and angle to have any negative effect. 600 million Tidal acceleration moves the Moon far enough from Earth that it can no longer cause a total solar eclipse. 500–600 million The Sun's increasing luminosity begins to disrupt the carbonate–silicate cycle; higher luminosity increases weathering of surface rocks, which traps carbon dioxide in the ground as carbonate. As water evaporates from the Earth's surface, rocks harden, causing plate tectonics to slow down and eventually stop once the oceans evaporate completely. With less volcanism to recycle carbon into the Earth's atmosphere, carbon dioxide levels begin to fall. By this time, carbon dioxide levels will fall to the point at which photosynthesis is no longer possible. All plants that utilize photosynthesis (≈99 percent of present-day species) will die. The extinction of plant life is likely to be a long-term decline rather than a sharp drop. It is likely that plant groups will die one by one well before the critical carbon dioxide level is reached. The first plants to disappear will be herbaceous plants, followed by deciduous forests, evergreen broad-leaf forests and finally evergreen conifers. 500–800 million As the Earth begins to quickly heat up and carbon dioxide levels fall, plants and animals could survive longer by evolving other strategies such as requiring less carbon dioxide for photosynthesis, becoming carnivorous, adapting to desiccation, or associating with fungi. These adaptations are likely to appear near the beginning of the moist greenhouse. The death of most plant life will result in less oxygen in the atmosphere, allowing for more DNA-damaging ultraviolet radiation to reach the surface. The rising temperatures will increase chemical reactions in the atmosphere, which will mean there will be even less oxygen. Flying animals would be much better off because of their ability to travel large distances looking for cooler temperatures.Ward & Brownlee in 2003 on pages 117-28 Many animals may be driven to the poles or possibly underground. These creatures would become active during the polar night and aestivate during the polar day due to the intense heat and radiation. Much of the land would become a barren desert, and plants and animals would primarily be found in the oceans. 800–900 million Carbon dioxide levels fall to the point at which photosynthesis is no longer possible. Without plant life to recycle oxygen in the atmosphere, free oxygen and the ozone layer will disappear from the atmosphere allowing for intense levels of deadly UV light to reach the surface. In the book The Life and Death of Planet Earth, authors Peter D. Ward and Donald Brownlee state that some animal life may be able to survive in the oceans. Eventually, however, all multicellular life will die out. At most, animal life could survive about 100 million years after plant life dies out, with the last animals being animals that do not depend on living plants such as termites or those near hydrothermal vents such as worms of the genus Riftia. The only life left on the Earth after this will be single-celled organisms. 1 billionUnits are short scale 27% of the ocean's mass will have been subducted into the mantle. If this were to continue uninterrupted, it would reach an equilibrium where 65% of present-day surface water would be subducted. 1.1 billion The Sun will be 10% brighter than it is today, causing the Earth's surface temperatures to reach an average of around . The atmosphere will become a \"moist greenhouse,\" which will make the oceans evaporate. This would cause plate tectonics to stop completely, if not already stopped before this time. Pockets of water may still be present at the poles, allowing a place for very simple life to live. 1.2 billion High estimate until all plant life dies out, assuming some form of photosynthesis is possible despite extremely low carbon dioxide levels. If this is possible, rising temperatures will make any animal life unsustainable from this point on. 1.3 billion Eukaryotic life dies out on Earth due to carbon dioxide starvation. Only prokaryotes, such as bacteria, are still there. 1.5–1.6 billion The Sun's rising luminosity causes its circumstellar habitable zone to move outwards; as carbon dioxide rises in Mars's atmosphere, its surface temperature rises to levels akin to Earth during the ice age. 1.6 billion Lower estimate until all prokaryotic life on Earth will go extinct. 2 billion High estimate until the Earth's oceans evaporate if the atmospheric pressure were to decrease via the nitrogen cycle. 2.3 billion The Earth's outer core freezes if the inner core continues to grow at its current rate of per year. Without its liquid outer core, the Earth's magnetic field shuts down, and charged particles emanating from the Sun gradually deplete the atmosphere. 2.55 billion The Sun will have become the hottest it can be: 5,820 K. From then on, it will become cooler even though it will become brighter. 2.8 billion Earth's surface temperature will reach around , even at the poles. 2.8 billion All life, which by then will be only single-celled living things in microenvironments such as high-altitude lakes or caves, will go extinct. c. 3 billion There is a roughly 1-in-100,000 chance that the Earth might be ejected into interstellar space by a stellar encounter before this point and a 1-in-3-million chance that it will then be captured by another star. Were this to happen, life, assuming it survived the interstellar journey, could potentially continue for far longer. 3 billion Median point at which the Moon's increasing distance from the Earth means it can no longer keep Earth's axial tilt from changing too fast. Then, the Earth's true polar wander becomes chaotic and extreme, leading to dramatic shifts in the planet's climate due to the changing axial tilt. 3.3 billion There is a roughly 2% chance that Jupiter's gravity may make Mercury's orbit so eccentric as to collide with Venus, sending the inner Solar System into chaos. Possible scenarios include Mercury colliding with the Sun, being ejected from the Solar System, or colliding with either Venus or the Earth. 3.5–4.5 billion All water currently present in oceans (if not lost earlier) will disappear into the air. This will make the greenhouse effect much worse, and the Sun's will be 35-40% brighter than it is today, which will also make much it worse. This will make the Earth's —hot enough to melt some surface rock. Many people say that the Earth's in this part of the future will be like Venus is today, but the temperature will really be around two times hotter than the temperature on Venus today. Earth will have a partially melted surface, but the surface of Venus right now is probably mostly solid. At this part of the future, Venus will also be much hotter than it is now. Venus is closer to the Sun than Earth. 3.6 billion Neptune's moon Triton will fall through the planet's Roche limit, so it may break apart and become a ring system so that Neptune has rings like Saturn's. 4 billion Median point by which the Andromeda Galaxy will have collided with the Milky Way. Then they would be one galaxy named \"Milkomeda.\" There is also a small chance of the Solar System being ejected. The planets of the Solar System will almost certainly not be disturbed by these events. 4.5 billion Mars will reach the same solar flux as the Earth did when it first formed, 4.5 billion years ago from today. 5.4 billion The Sun will run out of hydrogen to turn into helium. Therefore, the Sun will finish the main sequence of its life as a star. It will also begin to evolve into a red giant. 6.5 billion Mars will reach the same solar radiation flux as Earth has today. Then, all the things that happened to Earth, described above, will also happen to Mars. 7.5 billion Earth and Mars may become tidally locked with the expanding subgiant Sun. That means the same side of Earth will face away from the Sun and the same side will face away from the Sun, so there is no more day or night. 7.59 billion The Earth and Moon will probably be fall into the Sun just before the Sun reaches the tip of its red giant phase and its maximum radius of 256 times the size it has today.This has been a tricky question for quite a while; see the 2001 paper by Rybicki, K. R. and Denis, C. However, according to the latest calculations, this happens with a very high degree of certainty. Before they fall into the Sun, the Moon might form spirals below Earth's Roche limit so that it breaks into a ring of debris, most of which will fall to the Earth's surface. During this era, Saturn's moon Titan may reach surface temperatures necessary to support life. 7.9 billion The Sun will reach the tip of the red-giant branch of the Hertzsprung–Russell diagram, meaning it will be the biggest and fattest it will ever be in its whole life, 256 times the present-day value. In the process, Mercury, Venus, very likely Earth and possibly Mars will be destroyed. 8 billion The Sun will become a carbon–oxygen white dwarf with about 54.05% its present mass.Based upon the weighted least-squares best fit on p. 16 of Kalirai et al. with the initial mass equal to a solar mass. At this point, if the Earth somehow survives, it will become much colder very quickly because the white dwarf Sun will give off much less energy than the yellow dwarf Sun does today. 22 billion 50 billion If the Earth and Moon are not engulfed by the Sun, by this time they will become tidally locked, with each showing only one face to the other so that there is no more day or night. The tidal action of the white dwarf Sun will extract angular momentum from the system, causing the lunar orbit to decay and the Earth to spin faster and faster. 65 billion The Moon may end up colliding with the Earth, assuming the Earth and Moon are not engulfed by the red giant Sun. 100–150 billion The Universe's expansion causes all galaxies beyond the former Milky Way's Local Group to disappear beyond the cosmic light horizon, so that anyone then living on or near Earth will not be able to tell they are there. 150 billion The cosmic microwave background will cool down from its current temperature of c. 2.7 K to 0.3 K, rendering it undetectable with current technology. 325 billion Estimated time by which the expansion of the universe isolates all gravitationally bound structures within their own cosmological horizon. At this point, the universe will have expanded by more than 100 million times, and even individual exiled stars will be alone. 450 billion Median point by which the c. 47 galaxies of the Local Group will come together into a single large galaxy. 800 billion Expected time when the net light emission from the combined Milkomeda galaxy will begins to decline as its red dwarf stars pass go through their blue dwarf stage of peak luminosity. 1012 (1 trillion) Low estimate for the time until star formation ends in galaxies as galaxies run out of gas clouds that become stars. The Universe's expansion, assuming a constant dark energy density, multiplies the wavelength of the cosmic microwave background by 1029, exceeding the scale of the cosmic light horizon and erasing any sign that the Big Bang happened. However, it may still be possible to tell how much the universe is expanding by studying hypervelocity stars. 1011–1012 (100 billion – 1 trillion) Estimated time until the Universe ends via the Big Crunch, assuming a \"closed\" model. Depending on how long the expansion phase is, the events in the contraction phase will happen in the reverse order. Galaxy superclusters would first merge, followed by galaxy clusters and then later galaxies. Eventually, stars will be so close together that they will begin to collide with each other. As the Universe continues to contract, the cosmic microwave background temperature will rise above the surface temperature of certain stars, which means that these stars will no longer be able to give off heat, slowly cooking themselves until they explode. It will begin with low-mass red dwarf stars once the CMB reaches around 500,000 years before the end, followed by K-type, G-type, F-type, A-type, B-type and finally O-type stars around 100,000 years before the Big Crunch. Minutes before the Big Crunch, the temperature will be so great that atomic nuclei will disband and the particles will be sucked up by already tightening black holes. Finally, all the black holes in the Universe will merge into one black hole containing all the matter in the universe, which would then devour the Universe, including itself. After this, it is possible that a new Big Bang would happen and create a new universe. The observed actions of dark energy and the shape of the Universe do not support this scenario. It is thought that the Universe is flat and because of dark energy, the expansion of the universe will accelerate; however, the properties of dark energy are still not known, and thus it is possible that dark energy could reverse sometime in the future. 1.05×1012 (1.05 trillion) Estimated time by which the Universe will have expanded by a factor of more than 1026, reducing the average particle density to less than one particle per cosmological horizon volume. Beyond this point, particles of unbound intergalactic matter will all be separate from each other, and collisions between them will no longer affect the future evolution of the Universe. 2×1012 (2 trillion) Estimated time by which all objects beyond our Local Group are redshifted by a factor of more than 1053. Even the highest energy gamma rays are stretched so that their wavelength is greater than the physical diameter of the horizon. 4×1012 (4 trillion) Estimated time until the red dwarf star Proxima Centauri, the closest star to the Sun at a distance of 4.25 light-years, leaves the main sequence and becomes a white dwarf. 1013 (10 trillion) Estimated time when the universe will be the easiest for life as we know it to live in, on average, unless habitability around low-mass stars is suppressed. 1.2×1013 (12 trillion) Estimated time until the red dwarf VB 10 runs out of hydrogen in its core and becomes a white dwarf. As of 2016, VB 10 was the least massive main sequence star. It had an estimated mass of 0.075 . 3×1013 (30 trillion) Estimated time for stars (including the Sun) to undergo a close encounter with another star in local stellar neighborhoods. Whenever two stars (or stellar remnants) pass close to each other, their planets' orbits can be change, so the planets can be shot out of the star's solar system. On average, the closer a planet's orbit to its parent star, the harder it is for it to be thrown out in this way. 1014 (100 trillion) High estimate for the time by which normal star formation ends in galaxies. This marks the transition from the Stelliferous Era to the Degenerate Era. There will be no more free hydrogen to make any new stars. So all stars that are already there will slowly run out of fuel and die one by one. By this time, the universe will also have expanded by a factor of approximately 102554. 1.1–1.2×1014 (110–120 trillion) Time by which all stars in the universe will have run out of fuel (the longest-lived stars, low-mass red dwarfs, have lifespans of roughly 10–20 trillion years). After this point, objects that are as big as stars today will be mostly stellar remnants (white dwarfs, neutron stars, black holes) and brown dwarfs. Collisions between brown dwarfs will create a few new red dwarfs: on average, about 100 stars will still be shining in what was once the Milky Way. Collisions between stellar remnants will create occasional supernovae. 1015 (1 quadrillion) Estimated time until stellar close encounters cause all planets in star systems to be thrown away into space. By this point, the Sun will have cooled to 5 K. 1019 to 1020 (10–100 quintillion) Estimated time until 90–99% of brown dwarfs and stellar remnants (including the Sun) are ejected from galaxies. When two objects pass close enough to each other, they exchange orbital energy, with lower-mass objects tending to gain energy. Through repeated encounters, the lower-mass objects can gain enough energy to be thrown away from their galaxy. This process will eventually cause the Milky Way to lose most of its brown dwarfs and stellar remnants. 1020 (100 quintillion) Estimated time until the Earth crashes into with the black dwarf Sun because its orbit will decay from emission of gravitational radiation. This will only happen if the Earth is not thrown out from its orbit by a stellar encounter or engulfed by the Sun during its red giant phase. 1030 Estimated time until those stars that are not ejected from galaxies (1–10%) fall into their galaxies' central supermassive black holes. By this point, with binary stars having fallen into each other, and planets into their stars, via emission of gravitational radiation, only solitary objects (stellar remnants, brown dwarfs, ejected planetary-mass objects, black holes) will remain in the universe. 2×1036 Estimated time for all nucleons in the observable universe to decay. This will only happen if the hypothesized proton half-life takes its smallest possible value (8.2×1033 years).Around 264 half-lives. Tyson et al. employ the computation with a different value for half-life. 3×1043 Estimated time for all nucleons in the observable universe to decay, if the hypothesized proton half-life takes the largest possible value, 1041 years, assuming that the Big Bang was inflationary and that the same process that made baryons predominate over anti-baryons in the early Universe makes protons decay. By this time, if protons do decay, the Black Hole Era, in which black holes are the only things left in space, begins. 1065 If protons do not decay, this is the estimated time for rigid objects, such as rocks floating in space and planets, will rearrange their atoms and molecules via quantum tunneling. On this timescale, any body of matter will act as if it were liquid and becomes a smooth sphere. 2×1066 Estimated time until a black hole of 1 solar mass decays into subatomic particles due to Hawking radiation. 6×1099 Estimated time until the supermassive black hole of TON 618 disappears due to emission of Hawking radiation. As of 2018, TON 618 was the largest known black hole. It had a mass of 66 billion solar masses, assuming zero angular momentum (that it does not rotate). 1.7×10106 Estimated time until any supermassive black hole with a mass of 20 trillion solar masses decays by Hawking radiation. This will be the end of the Black Hole Era. After this, if protons do decay, the Universe will enter the Dark Era, in which all physical objects will have decayed in to subatomic particles, gradually becoming the heat death of the universe. 10139 2018 estimate of Standard Model lifetime before collapse of a false vacuum; 95% confidence interval is 1058 to 10241 years due in part to uncertainty about the top quark mass. 10200 Estimated latest time for all nucleons in the observable universe to decay, only if they do not already decay for one of the reasons named above, through higher-order baryon non-conservation processes, virtual black holes, sphalerons, or other causes, on time scales of 1046 to 10200 years. 101100-32000 Estimated time for black dwarfs larger than 1.2 times the mass of the Sun to become supernovae because of slow silicon-nickel- iron fusion. The decreasing electron fraction lowers their Chandrasekhar limit, assuming protons do not decay. 101500 Assuming protons do not decay, the estimated time until all baryonic matter in stellar-mass objects will have either fused together via muon-catalyzed fusion to form iron-56 or they will decay from a higher mass element into iron-56 to form an iron star. 10^{10^{26}}10^{10^{26}} is 1 followed by 1026 (100 septillion) zeroesAlthough listed in years for convenience, the numbers beyond this point are so vast that their digits would remain unchanged regardless of which conventional units they were listed in, be they nanoseconds or star lifespans. Latest possible estimated time until all iron stars collapse via quantum tunnelling into black holes, assuming no proton decay or virtual black holes. On this vast timescale, even the most stable iron stars will have been destroyed by quantum tunnelling. First, iron stars of sufficient mass (somewhere between 0.2 and the Chandrasekhar limit) will collapse into neutron stars. Next, neutron stars and any remaining iron stars heavier than the Chandrasekhar limit will collapse via tunnelling into black holes. Then, each black hole will dissolve into subatomic particles (a process lasting roughly 10100 years), and the universe will go into the Dark Era. 10^{10^{50}}10^{10^{50}}is 1 followed by 1050 (100 quindecillion) zeroes Estimated time for a Boltzmann brain to appear in the vacuum since there will be less spontaneous entropy. 10^{10^{76}} High estimate for the time until all iron stars collapse into black holes, assuming no proton decay or virtual black holes, which then (on these timescales) instantaneously evaporate into subatomic particles. This is the latest possible time the Black Hole Era (and subsequent Dark Era) could begin. Beyond this point, it is almost certain that the Universe will not have any baryonic matter and will be an almost pure vacuum (it might also have a false vacuum) until the heat death of the universe, assuming it does not happen before this. 10^{10^{120}} Highest estimate for the time it takes for the universe to reach its final energy state, even in the presence of a false vacuum. 10^{10^{10^{56}}} If it is possible, this is when quantum effects will cause a new Big Bang, which will make a new universe according to Sean M. Carroll and Jennifer Chen. Around this time, quantum tunnelling in any isolated patch of the now-empty universe could generate new inflationary events, resulting in new Big Bangs giving birth to new universes. Because the total number of ways in which all the subatomic particles in the observable universe could be combined is 10^{10^{115}}, a number which, when multiplied by 10^{10^{10^{56}}}, disappears into the rounding error. This is also the time it would take for quantum-tunnelled and quantum fluctuation-generated Big Bang to produce a new universe identical or very similar to our own. This would only happen if every new universe contained at least the same number of subatomic particles and obeyed laws of physics within the landscape predicted by string theory. ==Humanity== Years from now Event 10,000 This could be the longest technological civilization could last, according to Frank Drake's original formulation of the Drake equation. 10,000 If human beings choose spouses and other sex partners at random, then human genetic variation will no longer be related to what part of the planet people are from. The effective population size will equal the actual population size. 10,000 Humanity has a 95% probability of being extinct by this date, according to Brandon Carter's formulation of the controversial Doomsday argument, which argues that half of the humans who will ever have lived have probably already been born. 20,000 According to the glottochronology linguistic model of Morris Swadesh, future languages should retain just 1 out of 100 \"core vocabulary\" words on their Swadesh list compared to that of their current ancestor languages. 100,000+ Time required to make Mars into a place where people can live with an oxygen- rich breathable atmosphere, using only plants with solar efficiency comparable to those living on Earth. 1 million Estimated shortest time by which humanity could colonize our Milky Way galaxy and become capable of harnessing all the energy of the galaxy, assuming a velocity of 10% the speed of light. 2 million Vertebrate species separated for this long will generally undergo allopatric speciation. Evolutionary biologist James W. Valentine predicted that if humanity travels to different places in space and then those groups of people stop meeting each other, over this time, they will undergo evolutionary radiation and become different species with modern humans as their ancestor, with a \"diversity of form and adaptation that would astound us.\" This would be a natural process of isolated populations, so it would happen even if people invent genetic enhancement technology. 7.8 million Humanity has a 95% probability of being extinct by this date, according to J. Richard Gott's formulation of the controversial Doomsday argument. 100 million This is the longest technological civilization could last, according to Frank Drake's original formulation of the Drake equation. 1 billion Estimated time for an astroengineering project that could alter the Earth's orbit, so that the Earth's climate would stay the same even though the Sun will become brighter. People could do this by using asteroids with enough gravity to pull on the Earth. == Spacecraft and space exploration == As of 2020, five machines that travel through outer space are moving toward the edge of the solar system: Voyager 1, Voyager 2, Pioneer 10, Pioneer 11 and New Horizons. They will travel into interstellar space. So long as they do not crash into anything, these machines should persist indefinitely. Years from now Event 4000 The SNAP-10A nuclear satellite will return to the surface. It was launched in 1965 and its orbit is high off the surface of the planet., ...Launched in 1965 and carrying about 4.5 kilograms of uranium 235, Snap 10A is in a 1,000-year orbit.... 16,900 Voyager 1 will pass within 3.5 light-years of Proxima Centauri. 18,500 Pioneer 11 will pass within 3.4 light-years of Alpha Centauri. 20,300 Voyager 2 will pass within 2.9 light-years of Alpha Centauri. 25,000 The Arecibo message is a collection of radio data. It was transmitted on November 16, 1974. It will reach the distance of its destination, the globular cluster Messier 13. This is the only interstellar radio message sent so far away. There will be a 24-light-year shift in the cluster's position in the galaxy during the time it takes the message to reach it. However, because the cluster is 168 light-years in diameter, the message will still reach its destination. Any reply will take at least another 25,000 years to reach it, assuming faster-than-light communication is impossible. 33,800 Pioneer 10 will pass within 3.4 light-years of Ross 248. 34,400 Pioneer 10 will pass within 3.4 light-years of Alpha Centauri. 42,200 Voyager 2 will pass within 1.7 light-years of Ross 248. 44,100 Voyager 1 will pass within 1.8 light-years of Gliese 445. 46,600 Pioneer 11 will pass within 1.9 light-years of Gliese 445. 50,000 The KEO space time capsule, if it is launched, will reenter Earth's atmosphere. 90,300 Pioneer 10 will pass within 0.76 light-years of HIP 117795. 306,100 Voyager 1 will pass within 1 light-year of TYC 3135-52-1. 492,300 Voyager 1 will pass within 1.3 light-years of HD 28343. 800,000–8 million This is the earliest that the Pioneer 10 plaque will wear out: the etching on it will become invisible because of interstellar erosion. 1.2 million Pioneer 11 will come within 3 light-years of Delta Scuti. 1.3 million Pioneer 10 will come within 1.5 light-years of HD 52456. 2 million Pioneer 10 will pass near the bright star Aldebaran. 4 million Pioneer 11 will pass near one of the stars in the constellation Aquila. 8 million The orbits of the LAGEOS satellites will decay, and they will re-enter Earth's atmosphere. Any humans still alive at the time will see the messages left by the humans who launched LAGEOS. 1 billion By this time the two Voyager Golden Records will wear out until no one can read them any more. 1020 (100 quintillion) Estimated timescale for the Pioneer and Voyager spacecraft to collide with a star (or ruins of a star). ==Technological projects and time capsules== A time capsule is a box or other container that is buried or hidden on purpose and scheduled to be opened many years later. People place things inside the time capsule so people in the future will find them. For example, someone might place a game, tool, toy, journal, magazine or book inside a time capsule so people in the future would see how the people who buried the time capsule lived, played and worked and what they liked to read. Date or years from now Event 3015 CE In 2015, Jonathon Keats put a camera in the ASU Art Museum and set it to finish its exposure time in 3015. Keats was trying to make history's slowest photograph. 10,000 Planned lifespan of the Long Now Foundation's several ongoing projects, including a 10,000-year clock known as the Clock of the Long Now, the Rosetta Project, and the Long Bet Project. Estimated lifespan of the HD-Rosetta analog disc, an ion beam-etched writing medium on nickel plate, a technology developed at Los Alamos National Laboratory and later commercialized. (The Rosetta Project uses this technology, named after the Rosetta Stone). 10,000 Projected lifespan of Norway's Svalbard Global Seed Vault. The seed vault stores seeds from important plants so humans can bring them back if they become extinct in the rest of the world. 1 million Estimated lifespan of Memory of Mankind (MOM) self storage-style repository in Hallstatt salt mine in Austria, which stores information on inscribed tablets of stoneware. 1 million Planned lifespan of the Human Document Project being developed at the University of Twente in the Netherlands. 292 million Numeric overflow in system time for Java computer programs. 1 billion Estimated lifespan of \"Nanoshuttle memory device\" using an iron nanoparticle moved as a molecular switch through a carbon nanotube, a technology developed at the University of California at Berkeley. more than 13 billion Estimated lifespan of \"Superman memory crystal\" data storage using femtosecond laser-etched nanostructures in glass. 292 billion Numeric overflow in system time for 64-bit Unix systems. ==Human constructs== Years from now Event 50,000 This is about how long tetrafluoromethane lasts in the atmosphere. Tetrafluoromethane is the greenhouse gas that lasts the longest. 1 million Current glass objects in the environment will decompose. Outdoor statues made out of hard granite will have worn away by one meter. This assumes the statues are in moderate climates and rate of 1 Bubnoff unit (1 mm in 1,000 years, or ≈1 inch in 25,000 years). If human beings stop taking care of it, the Great Pyramid of Giza will wear away until it does not look like a pyramid any more. The footprints that Neil Armstrong and other Apollo astronauts left on the Moon will be erased by space weathering. (The Moon does not have wind and rain the way Earth does, so erosion takes longer.) 7.2 million If human beings stop taking care of it, Mount Rushmore will wear away until the faces of the presidents won't show any more. 100 million Future archaeologists should be able to identify an \"Urban Stratum\" of fossilized great coastal cities, mostly by looking at underground things, such as building foundations and utility tunnels., Review in Stanford Archaeolog ==Nuclear power== Years from now Event 10,000 The Waste Isolation Pilot Plant, which is where dangerous, radioactive waste from nuclear weapons waste is stored, is planned to be protected until this time. The people who built it wondered what would happen if civilization fell apart and people forgot not to enter the Waste Isolation Pilot Plant or thought the walls and doors meant there was treasure hidden there. It has a \"Permanent Marker\" system designed to warn visitors that the place is dangerous. It is marked in many languages (the six UN languages and Navajo) and in pictograms. The Human Interference Task Force developed theories that the United States government could use to communicate with people of the future for other nuclear problems. 24,000 The Chernobyl Exclusion Zone, the area of Ukraine and Belarus that people had to leave after Chernobyl nuclear power plant blew up in 1986, will return to normal levels of radiation. 30,000 If people keep using electricity as much as they did in 2009, then the amount of fission-based breeder reactor reserves will run out then. This assumes no new sources of fuel are found. 60,000 The amount of fuel for fission-based light-water reactors will run out if humans manage to collect all the uranium from seawater, assuming people use as much power as they did in 2009 every year. 211,000 Half-life of technetium-99, the most important long-lived fission product in nuclear waste from uranium. 250,000 This is the soonest possible time the spent plutonium in the New Mexico Waste Isolation Pilot Plant will stop being lethal to humans. 15.7 million Half-life of iodine-129, the most durable long-lived fission product in nuclear waste from uranium. 60 million If humans manage to collect all the lithium from seawater, this is when fuel for fusion power reactors will run out, assuming people use as much power as they did in 1995. 5 billion If people manage to collect all the uranium from seawater, this is when the fuel for fission-based breeder reactors will run out, assuming people use as much energy as they did in 1983. 150 billion If people manage to collect all the deuterium from seawater, this is when the fuel for fusion power reactors will run out, assuming people use as much energy as they did in 1995. ==Related pages== * Orders of magnitude (time) * Ultimate fate of the universe ==Notes== ==References== Category:Future",
 "title": "Timeline of the far future"
}