{
 "id": "799197",
 "text": "A high roll is a hairstyle that Western women wore in the late 1700s. The style took hours to make. Sometimes, a professional hairdresser would style the woman's hair. That meant the woman had to be rich enough to pay a hairdresser and to spend hours sitting in a chair not working. This made the high roll a status symbol. The hairstyle could be very tall and make a person's head seem twice as high. First, the woman's hair would be combed. Then the woman or her hairdresser would add pomatum to the hair so it could be shaped. The pomatum would have treated fat, oil and perfumes or spices in it. This would make the hair smell good, kill headlice, and help hold the hair in place. Women would add extra hair collected from cows, horses, or other people. Or they would collect from their own hairbrushes over time and reuse it. Women and hairdressers would use small pillows inside the hair to hold it up. Some women would make curls along the sides or neck with curlers. The hair was held in place with pins. The hair could be natural color or colored gray, brown or white with powder. Some women, for example, Queen Marie Antoinette of France, would wear feathers, jewelry, or sculptures of plants and animals in their high hair. Some women said that it would itch. ==History== The earliest high rolls started in the late 1760s and became taller over time. They started in France and moved to London and North America. ==Criticism== Many people did not like this hairstyle. English critics complained that English women copied it from France. American critics complained that women copied it from England --and this was in the 1770s, when America was at war with England. Other critics said the feathers in the hairstyles made women look like male soldiers with plumed helmets. American critics also complained that the hairstyle made white women look like African-American men. In the 1770s, African-American men wore their hair in a bunch over their foreheads. Rich men also worried about their wives and daughters spending time with male hairdressers. There are many political cartoons making fun of the high roll and other high hairstyles. ==In popular culture== In the television show Turn, women in New York and Philadelphia wear and talk about high rolls. ==References== Category:Hairstyles Category:European culture",
 "title": "High roll"
}