{
 "id": "799482",
 "text": "Options Clearing Corporation (also called \"OCC\") is a United States clearing house based in Chicago. Clearing houses are used to help traders, and they make sure each trade is correctly made, or \"cleared\". The OCC does this \"clearing\" with stocks, stock options, and many things that are very much like options (called equity derivatives). \"Clearing\" for stocks is very much like clearing a bank check. The OCC provides this service to at least 14 exchanges, where stocks, options, and contracts to buy or sell copper, gold, grain, oil, and other needed supplies. They also provide services for people and companies that need to borrow stocks. When someone borrows a stock, they have to pay OCC some money every day. This is the same as people who pay a bank for a loan of money. Like all clearing houses, the OCC makes sure that nobody cheats, and they check everything to be sure that it is working. The OCC has about $100 billion US dollars of money deposited by big banks and trading companies (or \"members\"). Each day, the big banks and trading companies use the OCC to trade billions of dollars worth of stocks and other equity derivatives. In 2015, they had 4.2 billion trades. That was the third highest in their history. In 2011, OCC was the largest clearing house in the USA. The Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) are the two parts of government that watch over OCC. Under the SEC, OCC helps with stocks and options, indexes for stocks, foreign currencies, and futures contracts. The OCC is called a \"registered Derivatives Clearing Organization (DCO)\" by the CFTC. The have helped pay for schools to teach investors about trading, and they help finance advisors and companies learn answers to very difficult problems. They also teach about risk. ==Leadership== OCC is run by a board of directors, and the board is mostly people who work at big banks and trading companies. They are a utility, like a power company is a utility, but for financial things. They are called a financial utility provider. They make money from the big banks and trading companies they work with. ==Members== Members include: *ABN AMRO *ATD *Bank of America *Bank of Montreal *Bank of New York Mellon *Barclays *BB&T; *BBVA *Bloomberg *BNP Paribas *Canadian Imperial Bank of Commerce *Cantor Fitzgerald *Charles Schwab *Citadel *Citigroup *Commerzbank *Credit Suisse *Daiwa *Deutsche Bank *Fidelity *Goldman Sachs *HSBC *ICAP *Industrial & Commercial Bank of China *ING *Intesa Sanpaolo *ITG *JP Morgan *Knight Capital *Mitsubishi UFJ Financial Group *Mizuho Financial Group *Morgan Stanley *NASDAQ OMX *National Bank of Canada *Natixis *Nomura *Royal Bank of Canada *Royal Bank of Scotland Group *Scotiabank *Société Générale *State Street *Timber Hill *Toronto-Dominion Bank *UBS *Vanguard *Virtu Financial *Wells Fargo ==References== Category:Companies based in Chicago Category:American financial companies",
 "title": "Options Clearing Corporation"
}