{
 "id": "799537",
 "text": "Peter Parker, also known as Spider-Man, is the main hero of the 2002-2007 Sam Raimi Spider-Man trilogy and based on the Marvel Comics character of the same name. He was played by Tobey Maguire in all three movies and tie-in video games. Two later, un-related versions of Spider-Man came after this one in two separate movie series, namely one version in Marc Webb's films, and another one in the Marvel Cinematic Universe. ==Fictional character biography== Peter Parker was raised by his Aunt May and Uncle Ben. He is very smart and a good student, but is picked on by his classmates. After a spider bites him during a field trip, Peter gains spider-like superhero abilities. He uses his powers selfishly at first, but after Uncle Ben is killed, Peter realizes that \"with great power comes great responsibility\" and starts using his powers to protect the people of New York City, becoming Spider-Man. Throughout the movie series, Spider-Man fights villains such as the Green Goblin, Doctor Octopus, Sandman, and Venom while also maintaining friendships with Harry Osborn and his long- time crush Mary-Jane Watson, who later falls in love with him. He also learns lessons on responsibility, sacrifice, and forgiveness. He is brought to the Marvel Cinematic Universe (MCU) where he helps Peter One and Peter Three fight the Green Goblin and the Sandman, as well as other villains from their respective universes. ==Reception== Tobey Maguire's portrayal has been well- liked, even by his successors Andrew Garfield and Tom Holland. His portrayal in Spider-Man 3, particularly where he has the black suit on has had mixed reviews. == Appearances == === Movie appearances === Year Movie Portrayed by 2002 Spider-Man Tobey Maguire 2004 Spider-Man 2 2007 Spider-Man 3 2021 Spider- Man: No Way Home Category:Fictional characters introduced in 2002 Category:Fictional orphans Category:Marvel Comics mutants Category:Spider-Man (2002 movie series) Category:Spider-Man movie characters Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Peter Parker (Sam Raimi movie series)"
}