{
 "id": "799764",
 "text": "Sky Cinema, formerly Sky Movies, is a group of British pay television movie television channels owned by Sky, a part of Comcast. It is broadcast on Sky satellite and Virgin Media cable. The on demand movies can be watched on these and also Now TV, BT TV and TalkTalk TV. The first Sky Cinema (then Sky Movies) channel started as one of the four Sky satellite channels on 5 February 1989. The first movie shown was Dirty Dancing. The channel became a paid channel for on 5 February 1990. Over time, many different channels with the \"Sky Movies\" name were started. From 2007, they were grouped by genre (such as \"Sky Movies Comedy\" or \"Sky Movies Action\"). Sky Movies changed its name to \"Sky Cinema\" in 2016. ==Current channels== Channels Temporary channel re-brands Sky Cinema Premiere N/A Sky Cinema Select Sky Cinema Adventure Sky Cinema Blockbusters Sky Cinema Classics Sky Cinema Cops & Robbers Sky Cinema DC Heroes Sky Cinema Feel Good Sky Cinema Harry Potter Sky Cinema Lord of the Rings Sky Cinema Musicals Sky Cinema Spooky Sky Cinema Star Wars Sky Cinema Superheroes Sky Cinema Tom Hanks Sky Cinema Transformers Sky Cinema Twilight Sky Cinema Westerns Sky Cinema Will Smith Sky Cinema Hits Sky Cinema DC Heroes Sky Cinema Fast & Furious Sky Cinema Matt Damon Sky Cinema Megahits Sky Cinema Pirates of the Caribbean Sky Cinema Pixar Sky Cinema Spooky Sky Cinema Greats Sky Cinema Back to the Future Sky Cinema Brits Sky Cinema Denzel Washington Sky Cinema Harry Potter Sky Cinema Lord of the Rings Sky Cinema Jurassic Sky Cinema M:I (Mission Impossible) Sky Cinema Musicals Sky Cinema Oscars Sky Cinema Pets Sky Cinema Pirates of the Caribbean Sky Cinema School's Out Sky Cinema Spies Sky Cinema Star Trek Sky Cinema Star Wars Sky Cinema Superheroes Sky Cinema Tom Cruise Sky Cinema Tom Hanks Sky Cinema Villains Sky Cinema Wizarding World Sky Cinema Animation - Sky Cinema Family Sky Cinema Animation Sky Cinema Fairy Tales Sky Cinema Harry Potter Sky Cinema Kids Books Sky Cinema Disney Sky Cinema Pixar Sky Cinema Action Sky Cinema Action Men Sky Cinema Heroes Sky Cinema Wonder Women Sky Cinema Comedy Sky Cinema Adam Sandler Sky Cinema April Fools Sky Cinema Thriller Sky Cinema Bourne Sky Cinema Heists Sky Cinema Spies Sky Cinema Drama Sky Cinema Christmas Sky Cinema Julia Roberts Sky Cinema True Stories Sky Cinema Valentine Sky Cinema Weddings Sky Cinema Women in Film Sky Cinema Sci-Fi & Horror Sky Cinema Aliens Sky Cinema Halloween Sky Cinema Monsters Sky Cinema Sky-Fi Sky Cinema Star Wars Sky often change the name of some channels at different times of the year. ==References== Category:British television channels",
 "title": "Sky Cinema"
}