{
 "id": "799770",
 "text": "Daocheng Yading Airport is an airport in Daocheng County in Garzê Tibetan Autonomous Prefecture. The prefecture is in Sichuan Province, China. The airport is in Sangdui Town. Sandui town is 50 km north of the county seat. Yading Nature Reserve is 130 km away from the airport. Daocheng Yading is above sea level. This makes it the highest civilian airport in the world. Construction started after plans for the airport were approved in April 2011. The construction cost 1.58 billion yuan (US$255 million). The airport officially opened on 16 September 2013. The first flight was Air China flight 4215 on an Airbus A319. The flight came from Chengdu. It carried 118 passengers. The opening of the airport reduces the time needed to travel from Daocheng and Chengdu to one hour. This journey used to take two days by bus. == Facilities == Daocheng Yading Airport has one runway that is long and wide. It has a terminal building. The airport terminal is shaped like a flying saucer. There are two aerobridges. It is designed to handle 280,000 passengers per year. Pilots landing and taking off a plane from the airport need to be a captain. They also need to have a license that allows them to land on a high elevation airport. They cannot be more than 55 years old. They also need have 1,200 hours flying experience. Out of this 1200, 100 must be on the type of aircraft they are currently flying. == Airlines and destinations == Daocheng Yading is served by airlines such as Air China, China Southern Airlines as well as Sichuan Airlines. There are several destinations these airlines fly to. Air China operates flights to Chengdu Shuangliu International Airport (Chengdu) and Guangzhou Baiyun International Airport (Guangzhou). China Southen operates flights to Chengdu and Guangzhou. Sichuan Airlines operates flights to Chengdu, Chongqing Jiangbei International Airport, Hangzhou Xiaoshan International Airport and Xi'an Xianyang International Airport. The table below lists the destinations and airlines: == References == == Other websites == * Photos of the airport on its opening day Category:2010s establishments in China Category:2013 establishments in Asia Category:Airports in Asia Category:Transport in China Category:Sichuan",
 "title": "Daocheng Yading Airport"
}