{
 "id": "799739",
 "text": "The Mediterranean diet is a way of eating. The Mediterranean diet is not only food. It is also the skills and traditions people use to make it, for example farming, fishing, and cooking. It is also the traditions and culture about food and meals. In the second half of the 20th century, people far from the Mediterranean Sea began to eat a Mediterranean diet to become healthier. In 2019, U.S. News and World Report named the Mediterranean diet \"Best Overall Diet.\" ==History== A scientist named Ancel Keys started studying the Mediterranean diet in the 1950s. He saw that people in poor Italian villages were healthier than people in New York. In 2013, the United Nations declared the Mediterranean diet intangible cultural heritage from Cyprus, Croatia, Spain, Greece, Italy, Morocco and Portugal. ==Foods== The diet is based on what peasants, people who worked on farms, in countries around the Mediterranean Sea would eat during the Middle Ages and later, for example, Italian farm workers. They ate a lot of olive oil, beans, and whichever fresh vegetables were growing at that time of year. Meat was expensive, so it was not the main part of the meal. The Mediterranean diet does have foods from North and South America, for example tomatoes. ==Health effects== Scientists saw that people who ate a Mediterranean diet had less anxiety and depression. People with type 1 diabetes who ate Mediterranean diet had healthier lives and were less likely to get Crohn's disease. ==Criticism== Professional diet scientists and experts say that the Mediterranean diet can be expensive. A tomato does not cost much money to someone who lives next to a tomato farm and is buying it when it is ripe. It costs more when it is put on an airplane and flown to the middle of a North American city and stored until winter. Other studies show that a Mediterranean diet is not much more expensive than a North American diet. Many people think they are eating a Mediterranean diet when they eat pizza, pasta or other foods that are not part of the Mediterranean diet. ==References== Category:Diets",
 "title": "Mediterranean diet"
}