{
 "id": "799746",
 "text": "Barfi! is a 2012 Indian Hindi-language romantic comedy film written and directed by Anurag Basu, edited by Akiv Ali and produced by Ronnie Screwwala and Siddharth Roy Kapur under the banner of UTV Motion Pictures. The film stars Ranbir Kapoor as the eponymous lead with Priyanka Chopra and Ileana D'Cruz, while Saurabh Shukla, Ashish Vidyarthi, Jisshu Sengupta, Roopa Ganguly and Haradhan Bandopadhyay star in pivotal roles. Set in 1970s Darjeeling and Kolkata, the film is about Barfi (Kapoor), a deaf-mute young man based in Darjeeling, and his relationships with two lovely girls, the beautiful Shruti (D'Cruz), and the autistic Jhilmil (Chopra). == Plot == Murphy Johnson (Ranbir Kapoor), also known as Barfi, is an optimistic, street-wise, charming young man born deaf and mute to a lower middle-class Nepali family in Darjeeling. His mother died while giving birth to him and his father, Jungbahadur, (Akash Khurana) raised him as a single parent while working as a chauffeur. Barfi is known to be a troublemaker - he cuts lampposts, plays practical jokes on innocent people, and is often pursued comically by Inspector Sudhanshu Dutta (Saurabh Shukla), a local police officer. Barfi meets Shruti Ghosh (Ileana D'Cruz), a gorgeous, educated young girl, who is new in Darjeeling. She is engaged to a rich man, Ranjeet Sengupta (Jisshu Sengupta), and is due to get married in three months. Barfi is smitten by her heavenly beauty and tries to woo her. Shruti also falls in love with Barfi, but her mother (Roopa Ganguly) dissuades her from pursuing him, pointing out that he could not take care of her with his disabilities and lack of money. Shruti unwillingly agrees to her mother's advice, gets married to Ranjeet, and leaves the town, breaking all contact with Barfi. Shortly after Shruti's departure, Jungbahadur loses his job as a chauffeur and suffers from kidney failure, compelling Barfi to somehow raise ₹7000 for his hospital treatment. After an unsuccessful attempt of robbing a local bank due to Inspector Dutta's intervention, Barfi contemplates the kidnapping of Jhilmil Chatterjee (Priyanka Chopra), his autistic childhood friend and wealthy heiress of her late grandfather's fortune, for a ransom. Upon arriving, Barfi finds out that she has already been kidnapped from her house and spots her in an unattended van. He sneaks in and drives Jhilmil away from the ransom delivery. Barfi proceeds to hide her in his apartment with the police in pursuit and delivers a ransom note pasted with words in newspaper cut-outs to Jhilmil's wealthy father, Durjoy Chatterjee (Ashish Vidyarthi). Although Barfi is able to collect the ransom from Jhilmil's father, he is aghast to discover that Jungbahadur has died just as he makes the hospital payment. Dejected, Barfi tries to leave Jhilmil at her caretaker's village, but she refuses to leave him and the two soon move to Kolkata, where Barfi assumes responsibility for Jhilmil and strives hard to take care of her. Six years later, Barfi and Shruti reunite by fate in a street-side utensil shop. Shruti is unhappy with her marriage with Ranjeet and tries to rekindle her friendship with Barfi, much to chagrin of the lovestruck Jhilmil, who then goes missing in the city. Shruti files a missing complaint for Jhilmil and Inspector Dutta, causing the Darjeeling police to resume their pursuit of Barfi and arrest him. During the process of interrogation, another ransom demand for Jhilmil is made and she is apparently killed in the process of exchange, though her dead body is never discovered. In order to conclude the case, the police decide to frame Barfi for Jhilmil's murder. Inspector Dutta, who grew fond of Barfi after pursuing him for his nuisances, asks Shruti to take him away, offering him a second chance in life. Shruti agrees and hopes that since now Jhilmil is gone, she can finally be with Barfi. However, Barfi is deeply affected by Jhilmil's loss and finds living with Shruti unfulfilling. Eventually, he stumbles upon Jhilmil's special-care home address on the scribbles that she had made in their house. Barfi takes Shruti to the location to search for her and the two learn that Jhilmil has been alive all along, and that both the kidnappings were fabricated by her father so that he could embezzle money from Jhilmil's trust fund. In the second attempt, the second time, Jhilmil's father and the special-care home owner, Daju (Haradhan Bandopadhyay), together faked her death, so that Jhilmil could return to her special-care home, away from her alcoholic mother (Preeti Mamgain). Barfi and Jhilmil have a happy reunion at the special-care home and the two are married, while Shruti spends the rest of her days alone, prosperous, having lost her chance to be with Barfi. Several years later, an elderly Barfi is shown to be seriously ill and on his deathbed at the hospital. Jhilmil lies with him on the hospital bed, while Shruti narrates how they both died peacefully, not wanting to leave each other behind in life or death. The film ends with the happy days of Barfi and Jhilmil in their old age at the special-care home and the credits roll. == Cast == * Ranbir Kapoor as Murphy Johnson (a.k.a. Barfi) * Priyanka Chopra as Jhilmil Chatterjee * Ileana D'Cruz as Shruti Ghosh Sengupta * Saurabh Shukla as Inspector Sudhanshu Dutta * Ashish Vidyarthi as Durjoy Chatterjee (Jhilmil's father) * Jisshu Sengupta as Ranjeet Sengupta (Shruti's fiancèe-turned-husband) * Roopa Ganguly as Mrs. Ghosh (Shruti's mother) * Uday Tikekar as Mr. Ghosh (Shruti's father) * Haradhan Bandopadhyay as Daju (Jhilmil's special-care home owner) * Arun Bali as Nanaji (Jhilmil's maternal grandfather) * Preeti Mamgain as Mrs. Chatterjee (Jhilmil's mother) * Akash Khurana as Jungbahadur Johnson (Barfi's father) * Kenneth Desai as Senior Inspector * Rajeev Mishra as Inspector Dutta's assistant * Bholaraj Sapkota as Bhola (Barfi's close friend) * Sujata Sehgal as Ms. D'Souza (founder member of Jhilmil's special-care home) * Nirmala Thappa as Malti Mausi (Jhilmil's caretaker) * Sumona Chakraborty as Shruti's friend ==Production== The movie was made on a budget of around . Barfi! was released worldwide on 14 September 2012. The movie was successful at the box office. The movie became one of the highest-earning Bollywood films of 2012 in India and abroad. The movie earned over worldwide. ==Awards== The movie was selected as the official entry of India for Best Foreign Language Film nomination for the 85th Academy Awards. Barfi won many awards and nominations at different award ceremonies all over India. At the 58th Filmfare Awards, the movie received thirteen nominations which includes Best Actress for Chopra, and Best Supporting Actress for D'Cruz. The movie won seven awards which includes Best Film, Best Actor for Kapoor, Best Female Debut for D'Cruz, and Best Music Director for Pritam. == Soundtrack == The music and background music of the movie is composed by Pritam Chakraborty. The lyrics were written by Swanand Kirkire, Ashish Pandit, Neelesh Misra and Sayeed Quadri. The soundtrack album contains six original songs which were released on 9 August 2012. The soundtrack was influenced by Brazilian music Bossa nova. Priyanka Chopra was supposed to sing a track for the movie, but her contract with Universal Music prevented her from taking the offer. The soundtrack album also includes a song titled \"Fatafati\" which was sung by Pritam Chakraborty, Arijit Singh and Nakash Aziz. It was not used in the film, but the song was released as a promotional single on YouTube on 10 September 2012. It was released with a video that contains some behind-the-scenes footage. The additional vocals were sung by Ranbir Kapoor. The song also has some Bengali lyrics which were written by Amitabh Bhattacharya. == References == == Other websites == * * * * Category:2010s Hindi-language movies Category:2012 romantic comedy movies Category:Movies about autism Category:Movies about deaf people Category:2010s Indian movies Category:2012 comedy-drama movies",
 "title": "Barfi!"
}