{
 "id": "799845",
 "text": "Large Scale structure of the Universe refers to the patterns of galaxies and matter on scales much larger than individual galaxies and groupings of galaxies. These correlated structures can be seen up to billion of light years in length and are created and shaped by gravity. On large scales, the Universe displays coherent structure with galaxies residing in groups and clusters on scale(s) of ~1-3 megaparsecs (Mpc), which lie at the intersections of long Galaxy filaments that are usually >10 Mpc in length. Vast regions of relatively empty space, known as voids, contain very few galaxies and span in the volume in between these structures. It is amplified to enormous proportion by gravitational forces, producing ever-growing concentrations of dark matter in which ordinary gases cool, condense and fragment to create galaxies. The Large Scale Structure incorporates the notion of all the content in the universe which includes Galaxies — most of them bound in Galaxy clusters and Superclusters, Dark matter and Dark energy. While precise figures are impossible to acquire, it is currently thought that Dark Energy makes up 68% of the universe, Dark Matter follows with 27%, Radiation (Neutrinos and Photons) consisting of 0.1-0.2% meanwhile matter (anything made up of Atoms) consists of 4.9%. Other revised studies suggest that Dark Energy makes up 70% of the universe, Dark Matter following suit with 25%, Free Hydrogen and Helium make up ~4%,Neutrinos constituting 0.3% and other chemical elements constituting 0.003%. The composition and contents of the universe have changed over time,have influenced the Cosmos' evolution and will decide the Ultimate fate of the universe. After the Big Bang and for the next 3 billion years, the universe was Radiation dominated as can be evidenced from the Cosmic Microwave Background (CMB). For the next 3—7.7 billion years, the universe was matter dominated and its expansion started to progressively slow down, however, since then, the universe became dominated by a poorly understood form on vacuum energy known as Dark Energy — a form of energy that has since then accelerated the universe's expansion. == Dark energy == The term dark energy can be used to refer to a subset of all causes of the observed accelerating expansion of the universe. In 1998, two Cosmology research teams, the High-Z Supernova Search Team and the Supernova Cosmology Project set out to measure the universe's rate of expansion which, according to Cosmological methods of the time, should have being slowing down as the immense gravitational pull generated by the Cosmic Web should have dominated over the expansion rate drawing the observable universe's contents back into a singularity as the Big Crunch predicted. Instead, via the measurement of very distant supernovae, Cosmologists deduced that the universe was expanding, and that the expansion rate was indeed uncontrollably accelerating, seemingly caused by an unknown spacetime phenomena now given the term dark energy. Dark Energy's nature is still unknown, even less well understood unlike the hypothetical dark matter. It is probably in the form of an exotic type of vacuum energy exerting negative pressure on the universe. Its density is also extremely low, ~6×10-10 J/m3 or ~7×10-30 g/cm3. Much less than the density of normal matter or dark matter. However, it is dominant because # It doesn't dilute away unlike normal and dark matter are projected too — It is constant (in terms of Density) # Its values add up over large cosmic scales and dominate over gravitational energy at such scales. Due to this inherent dominance, it is Dark Energy's behavior which will dictate the universe's far future. == Dark matter == Dark matter is the term given to an apparent hypothetical invisible mass that is currently thought to consist of 85% of the universe's mass. It is thought that every galaxy has dark matter worth the galaxy's mass many times over, primarily situated at the outer edges of galaxies. It is currently agreed that dark matter must be some kind of hypothetical particle unknown to the Standard Model. === Background to the discovery of dark matter === Dark Matter's existence was first postulated by Swiss astronomer Fritz Zwicky who hypothesized it's existence based on observations of the Coma Cluster. Applying the virial theorem, Zwicky noticed that there was an apparent contradiction based on the speed of the galaxies which indirectly led him to obtain evidence of dark matter which he called dunkle materie (literally dark matter). Zwicky estimated its mass based on the motions of galaxies near its edge and compared that to an estimate based on its brightness and number of galaxies. He estimated the cluster had about 400 times more mass than was visually observable. The gravitational effect of the visible galaxies was far too small for such fast orbits, thus there must have been mass hidden from view. Based on these conclusions, Zwicky inferred that some unseen matter provided the mass and associated gravitational attraction to hold the cluster together. Zwicky's estimates were off by more than an order of magnitude, mainly due to an obsolete value of the Hubble constant, the same calculation today shows a smaller fraction, using greater values for luminous mass. Nonetheless, Zwicky did correctly conclude from his calculation that the bulk of the matter in the Coma cluster was dark matter. Generally though, it is agreed by physicists that dark matter will not play any significant role in regards to the Far Future of the universe == 'Normal' Matter & Radiation == === Baryonic Matter === A baryon is a particle consisting of three quarks/antiquarks (In other words, a hadron). Therefore, baryonic matter can in very rather simple terms be referred to as anything consisting of particles consisting of three standard model based particles. By extension, this includes atoms, groups of atoms (molecules) and the various large scale structures they form such as humans, the Earth, stars etc. Baryonic matter in much simpler commutative terms is what can interact electromagnetically, gravitationally and via the weak force and the strong nuclear force. On the largest scales, normal matter contributes to the Cosmic Web. A spread collection of all the universe's contents in in its sheer volume into a series of protruding structures synonymous to webs. With the path constituent of galaxy filaments made up of Galactic walls which are then made up of superclusters, galaxy clusters, individual galaxy groups and on to individual collections of galaxies. === Radiation === Radiation can best and most accurately be termed as the movement of particles or energy through space. There's many forms of radiation from gravitational waves (sometimes simply termed as gravitational radiation) to electromagnetic radiation (light, also electromagnetic waves.) However, due to such a broad definition, the universe is full of radiation everywhere, from the billions of neutrinos passing through our bodies and Earth to the light that is being received by your eyes. == Related pages == * Inflation (cosmology) * Dark matter * Dark energy * Cosmological principle == References == Category:Universe Category:Cosmology",
 "title": "Large-scale structure of the Universe"
}