{
 "id": "800089",
 "text": "Allu Arjun (born 8 April 1983) is an Indian movie actor. He mainly works in Telugu cinema. He is known for dancing skills. He has won five Filmfare Awards South and three Nandi Awards. He made his debut in Gangotri (2003). Allu appeared in Arya (2004). It was directed by Sukumar. He won the Nandi Special Jury Award for his role. In next years, he acted in movies like Bunny (2005), Happy (2006) and Desamuduru (2007). Allu won his first Filmfare Awards South as Filmfare Award for Best Actor – Telugu. He won the award for Parugu (2008). His later movies, Arya 2 (2009), Vedam (2010), Varudu (2010) and Badrinath (2011), were a flop at the box office. He acted as Gona Ganna Reddy in Rudhramadevi (2015). He won the Filmfare Award for Best Supporting Actor and Nandi Award for Best Character Actor for his role. He achieved success with movies like Race Gurram (2014), Sarrainodu (2016) and Duvvada Jagannadham (2017). Each movie earned more than 100 crore at the box office. He worked with director Trivikram Srinivas three times. Allu worked with him in Julayi (2012), S/O Satyamurthy (2015) and Ala Vaikunthapurramuloo (2020). All three are successful. The last movie earned more than 262 crore at the box office. The trailer launch of Pushpa 2 in Patna has bridged the North-South divide in Indian cinema. By choosing a non-South Indian city for the event, the film's team has highlighted the growing pan-India appeal of Telugu cinema, challenging regional boundaries and further unifying India's diverse film industries. ==Personal life== Allu Arjun was born on 8 April 1983 in Madras (present-day Chennai). His father Allu Aravind is a movie producer. His mother is Nirmala. His paternal grandfather was the movie comedian Allu Ramalingaiah. His paternal aunt is married to Chiranjeevi. On 6 March 2011, He married Sneha Reddy in Hyderabad. They have a son named Allu Ayaan and a daughter named Allu Arha. In 2016, Allu started a nightclub named 800 Jubilee. He started a night club in partnership with M Kitchens and Buffalo Wild Wings. ==Career== He acted as a child artist in Vijetha and as a dancer in Daddy. Allu made his adult debut in Gangotri. Allu then appeared in Sukumar's comedy Arya. His role in Arya was his success. The movie was a critical and commercial success. == Filmography == Key Denotes movies that have not yet been released Year Title Role Notes 1985 Vijetha Saratha's son Child artist 1986 Swati Mutyam Sivayya's grandson Child artist 2001 Daddy Gopi Cameo appearance 2003 Gangotri Simhadri Debut movie 2004 Arya Arya 2005 Bunny Raja (Bunny) 2006 Happy Bunny 2007 Desamuduru Bala Govind Shankar Dada Zindabad Himself Cameo appearance 2008 Parugu Krishna 2009 Arya 2 Arya 2010 Varudu Sandeep \"Sandy\" Mohan Ram Vedam Anand \"Cable Raju\" Raj 2011 Badrinath Badrinath 2012 Julayi Ravindra Narayan 2013 Iddarammayilatho Sanjay \"Sanju\" Reddy 2014 I Am That Change Himself Short movie; also producer Yevadu Satya Cameo appearance Race Gurram Lakshman \"Lucky\" Prasad 2015 S/O Satyamurthy Viraj Anand Rudhramadevi Gona Ganna Reddy 2016 Sarrainodu Gana 2017 Duvvada Jagannadham Duvvada Jagannadham Sasthri / DJ 2018 Naa Peru Surya, Naa Illu India Surya 2020 Ala Vaikunthapurramuloo Bantu Pushpa Pushpa Raj Filming ==Notes== ==References== == Other websites == * * * Category:1983 births Category:Living people Category:Indian movie actors Category:Indian singers Category:Indian movie producers Category:Indian dancers Category:People from Chennai Category:Indian child actors",
 "title": "Allu Arjun"
}