{
 "id": "800049",
 "text": "Hurricane Eta was a Category 4 hurricane that caused major damage for parts of Central America in early November 2020\\. Eta came from a tropical wave in the eastern Caribbean Sea on October 31\\. The system organized very quickly as it moved west, and the cyclone peaked as a Category 4 hurricane on November 3\\. The storm started to quickly weaken as the system made landfall near Puerto Cabezas, Nicaragua, late that same day. Eta weakened to a tropical depression as it slowly moved across Central America before moving north into the Caribbean. Over the next five days, the system moved very oddly, moving through the Florida Keys, before moving into the southern Gulf of Mexico. Soon, the storm quickly moved across the Southeastern United States on November 12\\. It dissipated the next day. Hurricane and tropical storm watches and warnings happened along the coast of Honduras and Nicaragua as Eta approached. At least 178 deaths across Central America have been related to the storm. Eta brought heavy rainfall and gusty winds to the Cayman Islands and Cuba. Parts of Southern Florida had to be evacuated because of Eta and other floods. 11 deaths were related to the storm in the U.S. Nearly $8 billion in damages were reported across all affected areas by December 2020. Relief efforts for those hit by the storm were set up in several countries. About 2.5 million were affected by the storm, including 1.7 million in Honduras. Emergency Response Units were to help support affected people. People left homeless were moved to many shelters after the storm had passed. Donations worth millions of USD have been given to affected countries to help recoveries. ==Storm history== On October 28, the National Hurricane Center (NHC) started watching the Southwestern Caribbean. There was an area that could become a tropical cyclone. Over the next couple of days, the area became more organized, becoming a disturbance, and on October 31, satellite and microwave imagery said that a circulation had formed in the disturbance, and the NHC began issuing advisories on Tropical Depression Twenty-Nine. Early on November 1, the system intensified into Tropical Storm Eta, becoming the earliest tropical storm on record in an Atlantic hurricane season. Continuing west, Eta slowly organized throughout the day as cold convection began to form on top of its center. After remaining at tropical storm strength for 15 hours, Eta began to intensify very quickly, becoming a Category 4 hurricane, with lots of lightning being observed in its eyewall.; Eta begun to slow down and turn west-southwestward because of a ridge over the United States. According to the NHC, Eta maintained its peak winds as it reached its lowest pressure of 923 mbar on November 3, peaking in strength as a strong Category 4 hurricane. Despite good conditions, Eta began to weaken six hours after its peak because of an eyewall replacement cycle, which it completed as it made landfall later that day, south of Puerto Cabezas, Nicaragua, with winds of 140 mph (225 km/h) and a pressure of 940 mbar.; ; Land caused Eta to weaken very quickly as it moved slowly west.; Only a little over a day after Eta made landfall, Eta had weakened to a tropical depression. Eta began turning northeastward, eventually moving back over the Caribbean Sea on November 6 and speeding up. The next day, the system became a tropical storm again. Despite bad conditions, the storm continued to strengthen through the day and made landfall on the south central coast of Cuba on November 8 after slowly intensifying. Eta weakened after making landfall in Cuba, but quickly moved back over water in the Atlantic Ocean. Eta began to strengthen again as it turned toward Florida.; Battling bad conditions, the storm was able to maintain its intensity as it grew in size and approached South Florida. On November 9, Eta made landfall on the Florida Keys. It then passed just south of the southwestern coast of Florida as it turned west. Eta began moving southwestward under the influence of a strong ridge across the Gulf of Mexico, Florida, and near the US East Coast. This also brought it into an area of very dry air, causing the storm to weaken and its strong winds to shrink in size. However, even after the storm appeared to become more unorganized, Eta began to intensify again over the Gulf of Mexico. Eta than began to speed up north-northeast around the western edge of a subtropical ridge as its center reformed under the convection and an eye formed. Eta briefly became a hurricane just after noon on November 11. Shortly after its peak, dry air removed the convection, causing Eta to weaken back into a tropical storm at 18:00 UTC.; The system turned further east and made landfall near Cedar Key, Florida at 09:00 UTC on November 12. The storm weakened over land as it sped toward the north-northeast, eventually emerging over the waters of the Atlantic near the Florida–Georgia border at 18:00 UTC. Eta came out with winds of 40 mph (65 km/h) before restrengthening as it began its extratropical transition. The storm completed its transition on November 13. On the next day, Eta was absorbed into another frontal system to the north. ==Effects== Deaths and damage by territory Country/Territory Fatalities Missing Damage (2020 USD) Refs The Bahamas Unknown Belize Unknown Cayman Islands Unknown Colombia Cuba Unknown Costa Rica El Salvador Unknown Guatemala ≥ Honduras Mexico Unknown Nicaragua ≥ Panama United States ≥ Totals: ≥ ≥ Eta's intensity at the beginning of its lifetime followed by its odd path afterwards bought devastating impacts across Central America, the Greater Antilles, the Bahamas, and Florida with heavy rainfall, strong winds, and flash flooding causing most of the damage. ===South America=== ====Colombia==== Despite passing north of the archipelago of San Andrés, Providencia and Santa Catalina, Eta still brought some damage to the island. Wind speeds of cut down the trees and damaged houses, and Eta also caused severe flooding on the island. Damage across the archipelago reached COL$3 billion (US$777,000). Across the archipelago, two people were injured and 141 families were affected. A total of 6 homes were destroyed while another 64 homes and 24 businesses had damage. ===Central America=== ====Nicaragua==== As Eta neared landfall, its winds downed power lines and trees while causing flooding and damaging roofs in Puerto Cabezas.; At the Getsemani School, Eta's strong winds ripped 10 sheets of metal off the school's roof. No one was injured in the incident. The Wawa River that connects Puerto Cabezas to the rest of Nicaragua had too much water in its banks. Two people in the municipality of Bonanza died after they were buried in a landslide while working in a mine. Eta caused C$6.128 billion (US$178.4 million) of damage in Nicaragua. ====Honduras==== Hurricane Eta had devastating effects on Honduras, largely due to flooding. Flooding forced 559 residents to leave homes and two others had to be rescued. At least 457 homes were damaged by floodwaters, 41 communities were cut off by washed-out roads, and at least nine bridges were destroyed, including one in La Ceiba. In La Ceiba, floodwaters rushed through streets, and the flooding also washed away a structure at a local cemetery. A ferry was rocked by large waves while trying to reach the port of La Ceiba. Nobody was injured on the ferry. The Permanent Contingency Commission of Honduras said that 14 roads and 339 homes were destroyed.; ; In Olanchito, 12 people were trapped. A wall collapsed at a prison in El Progreso letting in waist-deep floodwaters, causing the evacuation of more than 600 inmates. At least 74 people were killed across Honduras as a result of Eta, mainly due to landslides and drownings. Total economic losses in Honduras are estimated to be over 125 billion lempiras (US$5 billion). ====Guatemala==== According to the country's president, Alejandro Giammattei, at least 60% of the eastern city of Puerto Barrios was flooded with another 48 hours of rain expected. About 100 homes were damaged by flooding and landslides. A bridge crossing the Río Grande de Zacapa in Jocotán was washed away. At least 53 people died across Guatemala, while an additional 96 missing. An estimated 343,000 people were directly affected by the storm. The village of Queja near San Cristobal Verapaz in the center of the country was very hard-hit, with a landslide burying 150 homes. Over 100 people were buried from the landslide, and rescuers began searching them on November 9. However, the searching was called off two days later. Infrastructural damage were amounted to be exceed Q3 billion (US$386 million). ====El Salvador==== Heavy rainfall affected much of El Salvador as Eta passed to the northeast. Rainfall got over a total of with a maximum of in the La Unión Department. A total of 107 communities had power outages. Across the nation, 1,991 people required evacuation because of floods and landslides. Even with a ban on fishing activities, one fisherman drowned off the coast of Playa El Espino in the Usulután Department. ====Costa Rica==== The outer bands of Hurricane Eta brought heavy rainfall to portions of Costa Rica. The heaviest rains were mostly along the nation's Pacific coast, especially in Guanacaste Province. Many reports of flooding and landslides happened nationwide, 12 rivers saw higher levels, making questions of more flooding, and 26 people had to evacuate in Corredores and Parrita. In southern Costa Rica, a landslide on a house killed two people, a Costa Rican woman and an American man. Damage while the storm was alive in the nation was almost ₡10 billion (US$16.5 million). ====Panama==== The National Civil Protection System in Panama, Sinaproc, said that 200 homes were damaged by rainfall, maybe because of Eta. The highway that connects the province of Chiriquí with Bocas del Toro collapsed near Hornito, blocking the passage of vehicles in both directions. Flooding in Panama's Chiriqui province, near the Costa Rica border killed 19 people. Farming-related damage loss was estimated at US$11 million. ====Belize==== Communities along the Macal and Mopan rivers in western Belize experienced bad flooding due to Hurricane Eta. Residents near the sea in San Ignacio had to be evacuated from their homes. ====Mexico==== At least 27 people died as heavy rains because of Eta caused streams and rivers to be full. Over 80,000 people were affected in the Mexican states of Chiapas and Tabasco by rains of Hurricane Eta and a cold front. In the Chiapas highlands, more than 2000 homes were destroyed. In San Cristóbal de las Casas, many neighborhoods were damaged by the flooding Amarillo and Fogótico rivers. An increase of a lot of water at the Peñitas Dam made evacuation plans. In Tabasco, more than 10 rivers overflowed their banks. ===Cayman Islands and Cuba=== Eta brushed by the Cayman Islands just as it intensified back into a tropical storm, producing major impacts across the islands with Grand Cayman being hit the hardest. Wave action off the coast caused minor flooding on the coasts. Downed trees and tree branches also resulted. Power outages became common across the islands with tropical-storm force winds causing damage to power lines. Eta bought heavy rainfall in areas already dealing with overflowing rivers. Coastal zones in Cuba were also flooded and about 25,000 people were forced to evacuate. ===United States=== ====Florida==== The outer bands of Eta brought tropical storm-force gusts to South Florida beginning on November 7\\. Florida Power & Light reported over 30,000 power outages in the Miami metropolitan area, including nearly 16,000 in Miami-Dade County. Overall, about 48,500 businesses and homes lost electricity throughout South Florida. Heavy rainfall also affected the region, with a peak total of in Miramar, while rain gauges in Davie, Hollywood, Pembroke Pines, and Sunrise measured more than of precipitation. Flooding occurred in Broward, northern Miami-Dade, and Monroe counties. In Brickell, recently installed storm water pumps to deal with tidal flooding and storms helped clear the flood water from the rain and high tide event. One of the state's largest COVID-19 testing sites, at Hard Rock Stadium in Miami Gardens, was flooded. On November 11, a sailboat became lodged partially underneath the Matlacha Bridge, causing the bridge to be temporarily closed, thus cutting off transportation to and from Pine Island. Around the same area two other boats sank due to dangerous surf caused by the storm and a dock at the Bridgewater Inn floated away. Flooding in Pinellas County caused 33 people to be rescued by the Pinellas County Sheriff Office from homes and roadways and in Gulfport, five sailboats became unanchored and ran aground or were pushed up against a seawall. Losses statewide were estimated at US$1 billion. Officially, Eta made two landfalls in Florida - it hit the central part of the Florida Keys late Sunday, November 7, and made landfall again at about 4 a.m. Thursday, November 10, near Cedar Key, about 130 miles north of Tampa. ==== The Carolinas and Virginia ==== Several weather patterns creates extremely heavy rainfall across Virginia and the Carolinas. At least eleven people were killed due to flooding in the Carolinas, while over 33 people were rescued in a flooded campground. In Charlotte, North Carolina, more than 140 people were rescued from a school when floodwaters reached the first-floor windows. In Raleigh, North Carolina, multiple car accidents occurred due to slick roads. All lanes of Interstate 95 near the city were closed due to flooding. Over of rain fell in some areas of North and South Carolina. ==Related pages== * Hurricane Edith (1971) – A Category 5 hurricane that caused lots of damage in Nicaragua * Hurricane Joan (1988) - A deadly storm that hit Nicaragua, before entering the Eastern Pacific * Hurricane Gordon (1994) – A late-season Category 1 hurricane that took a similar erratic track through Cuba and Florida * Hurricane Mitch - Became one, if not the worst natural disasters in Central America. * Hurricane Wilma (2005) – A Category 5 hurricane that also intensified quickly in the Southwestern Caribbean * Hurricane Felix (2007) – A deadly Category 5 hurricane that devastated Central America * Tropical Storm Fay (2008) – A near-hurricane strength storm that took a similar path through the Caribbean and Florida ==Sources== Category:2020 disasters Category:2020 in North America Category:Category 4 Atlantic hurricanes Category:November 2020 events Category:2020 Atlantic hurricane season Category:Retired tropical cyclone names",
 "title": "Hurricane Eta"
}