{
 "id": "800296",
 "text": "The Cat in the Hat is a 2003 American family comedy movie directed by Bo Welch and based on the Dr. Seuss book of the same name. == Cast == *Mike Myers as the Cat *Spencer Breslin as Conrad Walden *Dakota Fanning as Sally Walden *Alec Baldwin as Lawrence Quinn *Mary Steenburgen as Mrs. Kappel *Sean Hayes as Hank Humberfloob and the voice of the Fish *Kelly Preston as Joan Walden *Dan Castellaneta as the voices of Thing 1 and Thing 2 *Daran Norris as the voice of Astounding Products announcer *Jeff Bennett as the voice of The Cat's Phun-O-Meter *Clint Howard as Kate the Caterer *Frank Welker as the voice of Nevins *Stephen Hibbert as Jim McFinnigan *Norman Fessler as Mailman (uncredited) *Alex Zimmerman as Pedestrian (uncredited) == Reception == It is considered one of the worst movies based on a children's book due to Mike Myers' performance and the raunchy humor that isn't suitable for a kids movie. == Cancelled sequel == The movie was going to have a sequel based on The Cat in the Hat Comes Back with Myers and Welch returning but Audrey Geisel banned future live-action movies based on her husband's book made. == Development == DreamWorks Pictures acquired the film rights to the original Dr. Seuss book in December 1998. However, production did not officially start until after the 2000 Christmas/comedy movie How the Grinch Stole Christmas, by Universal Pictures and Imagine Entertainment, both of whom also joined to finance, distribute and produce the film with DreamWorks, and based on another Dr. Seuss book of the same name, became a commercial success. Brian Grazer, the producer of The Grinch, stated: \"Because we grew up with these books, and because they have such universal themes and the illustrations ignite such fantasy in your mind as a child—the aggregation of all those feelings—it leaves an indelible, positive memory. And so when I realized I had a chance to convert first The Grinch and then, The Cat in the Hat, into movies, I was willing to do anything to bring them to the screen.\" Grazer then contacted Bo Welch over the phone with the offer to direct the film, and he accepted. When production began, songs written by Randy Newman were dropped because they were deemed inferior; Newman's cousin, David, instead composed the score for the film. Although Welch and a publicist for Myers denied it, several people said Myers had considerable input into the film's direction by telling some of the cast (namely co-stars Baldwin and Preston) how to perform their scenes. == Casting == Tim Allen was originally considered for the role of the Cat. The script was initially based on a version of the original book's story conceived by Allen, who admitted that as a child he was afraid of Seuss' \"mischievous feline babysitter\"; \"My dream is to give it the edge that scared me,\" stated Allen. However, the studio did not commission a screenplay until late February 2001, when Alec Berg, David Mandel and Jeff Schaffer (best known for being writers on the television series Seinfeld) were hired by the studio to script the film (replacing the original draft of the film that was written a few years prior by Eric Roth), so the film would not be ready to shoot before the deadline. By this point, Allen was also committed to shooting Disney's The Santa Clause 2, which was also delayed because Allen wanted a script rewrite. Due to scheduling conflicts with that film, he dropped out of the role. As a result, in March 2002 the role of the Cat was given to Mike Myers, whom Grazer had an argument with regarding a proposed film adaptation of Myers' Saturday Night Live sketch Sprockets, which Myers cancelled in June 2000 after being dissatisfied with his own script for it. Myers stated in an interview that he was a long-time fan of the original Dr. Seuss book, and that it was the first book he ever read. In October 2002, Mike Myers, Dave Foley, Jay Kogen and Stephen Hibbert did an uncredited rewrites of the script. == Filming == Prior to filming, giant props for the film were stolen from the set; the local police found the props vandalized with graffiti in a shopping mall car park in Pomona, California. Despite this, no arrests had been made and filming was to start the next week. Principal photography took place mostly in California from October 7, 2002 to January 22, 2003. The neighborhood and the town center was filmed in a rural valley near Simi Valley, where 24 houses (each 26 feet square and 52 feet tall) were constructed. The downtown area outdoor shots were filmed along a Pomona street where a number of antique and gift shops are located. The community decided not to redecorate after filming ended, so the surreal paint scheme and some of the signage could still be seen today as it appears in the film. Because of so much smog in the area, the sky had to be digitally replaced with the cartoon-like sky and colors of the background had to be digitally fixed. According to co-star Amy Hill, Myers was very difficult to work with on set, refusing to talk to anyone on the production (other than director Welch) and completely isolating himself from the cast and crew during breaks in the filming. She also noted that the film ended up having long and pointless retakes of scenes because Myers overruled Welch on whether they were good enough or not. ==Music== The soundtrack was released on November 18, 2003. Originally, Marc Shaiman was going to compose the score for the film, but due to David Newman already being chosen for the film score, Instead he wrote the film's songs with Scott Wittman. The soundtrack also features a song by Smash Mouth (\"Getting Better\"), which makes it the second Mike Myers- starring film in a row to feature a song by Smash Mouth, which makes it the third Mike Myers-starring film in a row to feature a song by Smash Mouth after Shrek and Austin Powers in Goldmember. The trailer for the film uses a version of \"Hey! Pachuco!\" by the Royal Crown Revue. The soundtrack also includes two songs performed by Myers, who plays the Cat. Newman's score won a BMI Film Music Award. == Track listing == == CGI reboot == The movie is set to have an animated reboot by Warner Bros. == Internet popularity == Despite the reception, several internet memes based on the movie have become popular among fans who grew up with the movie. Category:2000s family movies Category:2003 comedy movies Category:American family movies Category:American comedy movies Category:DreamWorks Pictures movies Category:Internet memes Category:Movies about cats Category:Movies about fish Category:Movies based on books by Dr. Seuss Category:Universal Pictures movies",
 "title": "The Cat in the Hat (movie)"
}