{
 "id": "800284",
 "text": "Devil May Cry 2 is the second video game in the series of Devil May Cry. It was released on the PlayStation 2 on 2003. ==Gameplay== Dante can use a melee weapon or a firearm towards enemies. He can collect blue orbs and purple orbs to upgrade his health and Devil Trigger meters. The game introduces the Bloody Palace gameplay mode, where the player can attack countless waves of enemies and bosses. ==Development== Interestingly, the game started development even before the first game was finished. It was even made by an entirely different development team in Capcom from the first game. It is said that Capcom started work on Devil May Cry 2 without the first game's team even knowing about it. On top of all this, Capcom did not hire Hideki Kamiya (the first game's director), but hired a mystery director whose name was never shared outside of Capcom. Said director also had no experience directing before making Devil May Cry 2. Since Capcom was disappointed with the inexperienced team's progress, Capcom fired the game's first director and hired the game's new director, Hideaki Itsuno. Itsuno would be the director the last five to four months before the game's release. Although the game still had worse reviews than in the first game, many people would argue that Itsuno made the game much better than it could have been under the first director. For this reason, Itsuno would be hired again as the director of the game's sequel, Devil May Cry 3: Dante's Awakening. The game also had a lower difficulty as a response to complaints about the first game's difficulty. ==Reception== The game had much worse reviews than the first game. People complained about things such as the game being too easy, having poorly designed mechanics, and having worse graphics from the first game. Despite this, the high sales resulted in an acclaimed prequel called Devil May Cry 3: Dante's Awakening. Category:2003 video games Category:Devil May Cry Category:Capcom games Category:Action- adventure games Category:Dark fantasy video games Category:Hack and slash games Category:Nintendo Switch games Category:PlayStation 2 games Category:PlayStation 3 games Category:PlayStation 4 games Category:Single- player video games Category:Video game sequels Category:Video games based on mythology Category:Video games developed in Japan Category:Windows games Category:Xbox 360 games Category:Xbox One games",
 "title": "Devil May Cry 2"
}