{
 "id": "800368",
 "text": "Peter Benjamin Parker, also known as Spider-Man, is the main hero of the 2012-2014 Marc Webb The Amazing Spider-Man movie series and based on the Marvel Comics character of the same name. He was played by Andrew Garfield in both movies. This is a different version of the character than the one from Sam Raimi's movies and the one in the Marvel Cinematic Universe. ==Fictional character biography== Peter Parker was raised by his Aunt May and Uncle Ben. His parents worked as scientists before they were killed. In the movies, Peter finds out what his father, Richard, was working on, just as he is bitten by a spider that gives him his superhero abilities. The more he finds on his father's work, the more he realizes the consequences if it is used by the wrong people. He at first becomes Spider-Man to hunt down the man who kills his uncle, but later decides it’s most important to protect the people of New York City and prevent the wrong people from using his father's work. In this movie series, Peter is a very smart but mischievous person, but learns to be more responsible once he becomes Spider-Man. He is very handy with computers and technology, even making his own suit, and likes to ride his skateboard prior to becoming Spider-Man. His love interest is Gwen Stacy. He is brought to the Marvel Cinematic Universe (MCU) where he helps Peter One and Peter Two fight Electro and the Lizard, as well as other villains from their respective universes. ==Reception== Andrew Garfield's portrayal has been liked, particularly how accurate his performance is to the comics in regards to portraying Spider-Man as the superhero. However, his portrayal of Peter Parker in his regular life has been noted as different than usual, with some calling his interpretation \"too cool for Peter Parker\". == Appearances == === Movie appearances === Year Movie Portrayed by 2012 The Amazing Spider-Man Andrew Garfield 2014 The Amazing Spider-Man 2 2021 Spider-Man: No Way Home Category:Fictional characters introduced in 2012 Category:Fictional orphans Category:Marvel Comics mutants Category:Spider-Man movie characters Category:The Amazing Spider-Man (2012 movie series) Category:Marvel Cinematic Universe characters Category:Marvel Comics movie characters",
 "title": "Peter Parker (The Amazing Spider-Man movie series)"
}