{
 "id": "800535",
 "text": "A Birman cat is a domestic cat breed with long hair and deep blue eyes. It is known for its big brown spot near the face and has white on the rest of the body. Birman cats have been associated with many clubs and organizations. == Relationship == For fellow families or individuals, a birman cat is a perfect match ideal to being an affectionate, loving companion to stay by your side awaiting for their owner to play with them. They can adapt to any environment if their owners are willingly responsible enough to provide them a passionate and loving home. == Diet == Blueberries, bananas, eggs, salmon are good examples to feed your cat Birman, as they can be quite the picky eaters. It is advised to feed your Birman: dental grade cat biscuits, raw chicken bones, cooked fish and chicken. High quality of canned foods can be fed to the cat regularly but you might want to be careful because you need to consist healthy proteins and cooked foods to make sure your Birman's needs have been met. == Health == Feline hypertrophic cardiomyopathy is a common problem seen in cats, and is a threat to Birman cats too. The Birman breed also has problems with hypertrophic cardiomyopathy, a disease that causes heart failure and cardiac arrest. Their average lifespan is about 9-15 years. == History == Birman cats are said to have originated in Burma, and there was treated like a sacred cat. A story was made, \"Originally, the guardians of the Temple of LaoTsun were yellow-eyed white cats with long hair. The golden goddess of the temple, Tsun- Kyan-Kse, had deep blue eyes. The head priest, Mun-Ha, had as his companion a beautiful cat named Sinh. One day the temple was attacked and Mun-Ha was killed. At the moment of his death, Sinh placed his feet on his master. The cat’s white fur took on a golden cast; his eyes turned as blue as the eyes of the goddess, and his face, legs and tail became the color of earth. However, his paws, where they touched the priest, remained white as a symbol of purity. All the other temple cats became similarly colored. Seven days later, Sinh died, taking the soul of Mun-Ha to paradise.\" == References == Category:Cat breeds Category:Natural cat breeds",
 "title": "Birman"
}