{
 "id": "800507",
 "text": "Kirby's Dream Course is a golf-based video game. It was developed by HAL Laboratory and published by Nintendo in 1994. It was made for the Super Nintendo Entertainment System. Players bounce Kirby around a mini golf course to collect stars. People liked the game because it was weird and innovative. ==Gameplay== Kirby's Dream Course is a mini golf video game. The art is in an isometric perspective, similar to games like Marble Madness. Its plot involves Kirby's enemy, King Dedede, stealing all of the stars in the night sky. Kirby sets out to stop Dedede and return the stars to the sky. Players move Kirby (the second player moves a yellow Kirby look-alike named ) around a mini golf course by bouncing him towards a specific area of the playfield. Players must set the power, angle, and spin of the bounce to hit enemies in the levels. The player gets a star for each enemy they hit. When only one enemy is still alive, that enemy becomes a hole that the player must bounce Kirby into. The hole is worth two stars. In multiplayer, two players try to get the most stars. A player can hit one of the other player's stars to take it. Kirby/Keeby can hit certain enemies to get a Copy Ability, which can be used to clear courses more quickly or hurt the other player. These Copy Abilities include Kirby/Keeby turning into a tornado, a sparking ball that can break certain obstacles, and a UFO that allows Kirby/Keeby to float and move anywhere for a short time. The game has eight single-player courses. Each course has eight holes. When the player completes a course, they get a medal. Medals can be used to get extra features, including different versions of courses. The type of medal the player gets is based on how well they played the course, with gold being the best. ==Development== Kirby's Dream Course was made by HAL Laboratory and Nintendo EAD. It was published by Nintendo for the Super Nintendo Entertainment System (SNES). HAL originally made the game as a new game called Special Tee Shot in 1992. It had its own characters and art. The game was given previews from magazines and was displayed on the packaging for the SNES, but the company stopped making it because their Kirby series on the Game Boy was very successful. HAL later made Special Tee Shot into a Kirby game by replacing many of the new characters with characters from the Kirby series. Keeby, the yellow Kirby that the second player controls, uses Shigeru Miyamoto's idea for what color Kirby should be. Miyamoto's idea was replaced with pink when Kirby's Adventure was released. After an unnamed yellow Kirby appeared in Kirby 64: The Crystal Shards, a yellow color appeared a lot when more than one player played as Kirby in the Kirby and Super Smash Bros. series. This design was called \"Keeby Yellow\" in Kirby's Dream Buffet. Kirby's Dream Course was released in Japan on September 21, 1994, as Kirby Ball. It was released in North America on February 1, 1995. Special Tee Shot was later released in 1996 for the Satellaview. The Satellaview is a peripheral for the Super Famicom that used broadcasts from satellites to play games. Dream Course is one of thirty games included on the Super NES Classic Edition. In 1995, Nintendo and HAL started making a sequel named Kirby Ball 64/Kirby Bowl 64 for the Nintendo 64. A playable prototype of the game was shown at Nintendo's annual Shoshinkai event. Kirby Ball 64/Kirby Bowl 64 was made to use the system's analog stick to let the player move with more precision. It also had an extra mode where the player controlled Kirby on a snowboard. Kirby Ball 64 was not released, but some of the ideas from the game were later used in Kirby Air Ride. ==Reception== People liked Kirby's Dream Course for its weirdness and innovation. GamePro writer Scary Larry said that it was as fun to play as the other Kirby games. A writer for Next Generation and a reviewer from Electronic Gaming Monthly said that the mini golf gameplay system was very unique. Next Generation and Larry also said that Dream Course is very complex, which was not common for a golf video game at the time. People liked the game's colorful art for its funny design. Electronic Gaming Monthly said that the game's controls took time to get used to. Tom Guise of Computer and Video Games and Electronic Gaming Monthly said that the game's originality made it one of the best SNES games. Javier Abad, a reviewer for Nintendo Acción, said that Kirby fans would like the game's controls and graphics. People have also said good things about the game in reviews written years later. Staff from Nintendo Life compared its silliness to Electronic Arts' Zany Golf. They said that Dream Course had fun gameplay and a good difficulty level. They also said that its graphics looked good. IGNs Lucas M. Thomas believed Dream Courses unique concept made it impossible to compare it to other games. Thomas and GameSpots Frank Provo both liked how useful the power-ups were. USgamer writer Nadia Oxford liked its funny design and weird levels. She said that it was a break from the more action-oriented games on the console. IGN said that the game was the 38th best game on the SNES. ==Notes== ==References== Category:1994 video games Category:Kirby Category:HAL Laboratory games Category:Multiplayer and single-player video games Category:Sports video games Category:Super Nintendo Entertainment System games Category:Video game spin- offs Category:Video games developed in Japan Category:Virtual Console games Category:Virtual Console games for Wii U",
 "title": "Kirby's Dream Course"
}