{
 "id": "800599",
 "text": "David Madison Cawthorn (born August 1, 1995) is an American politician. He is a member of the Republican Party. Cawthorn was the U.S. Representative for North Carolina's 11th congressional district from 2021 to 2023. During his time in Congress, he was the youngest member of Congress since Jed Johnson Jr. He lost renomination in 2022. ==Early life== Cawthorn was born on August 1, 1995, in Asheville, North Carolina, to Priscilla and Roger Cawthorn. He was home-schooled in Hendersonville, North Carolina.Multiple sources: * * As a teenager, he worked at a Chick-fil-A restaurant. U.S. Representative Mark Meadows nominated Cawthorn to the United States Naval Academy in 2014, but his application was rejected. During the fall 2016 semester, Cawthorn went to Patrick Henry College, studying political science, but after having bad grades, he dropped out. At the time he dropped out of college, he was engaged, but his fiancée left him. From January 2015 to August 2016, Cawthorn worked as a staff assistant in Representative Mark Meadows's district office. ==Congressional career== In the March 2020 Republican primary for North Carolina's 11th congressional district, Cawthorn finished second behind Lynda Bennett, who was supported by both President Donald Trump and Cawthorn's former mentor, Mark Meadows, who had become White House Chief of Staff. But Bennett did not win the required 30% of the vote to avoid a runoff and Cawthorn won the June runoff in a landslide victory. His victory has been called an upset. His time in congress was very controversial. He was accused of insider trading, improper payments, a leaked nude video, and claimed that other congressmen invited him to orgies and to use cocaine. Before Trump supporters stormed the United States Capitol on January 6, Cawthorn said that the crowd \"had some fight.\" He voted not to certify the Electoral College results in Congress and called Republicans who voted to certify the results \"spineless cowards\". He supported the false conspiracy theories that the election was stolen from Donald Trump. After the riots, Cawthorn later criticized the Trump supporters and said, \"The party as a whole should have been much more wise about their choice of words.\" He later tried to blame the riots on Democrats. During the 2022 Russian invasion of Ukraine, Cawthorn called Ukrainian president Volodymyr Zelenskyy a \"thug\" and said \"the Ukrainian government is corrupt and incredibly evil\". Many Republicans criticized him and said he was spreading pro-Russian propaganda. On May 17, 2022, Cawthorn lost renomination to Chuck Edwards, a state senator by a 33.4% to 31.9% vote margin. ==Personal life== In 2014, at age 18, Cawthorn was seriously injured while returning from a spring-break trip to Florida. The car he was in crashed into a concrete barrier while Cawthorn's feet were on the dashboard. The accident left him paralyzed. Cawthorn married Cristina Bayardelle, an athlete, in 2020. In December 2021, Cawthorn announced they were getting divorced. Cawthorn said that he trained in wheelchair racing for the 2020 Summer Paralympics, but never competed at a qualifying level and was not involved in a team. In August 2020, during Cawthorn's campaign for Congress, many women accused him of sexual misconduct, and sexual assault. ==References== ==Other websites== * Congressman Madison Cawthorn official U.S. House website * Madison Cawthorn for Congress official campaign website * * * Category:1995 births Category:Living people Category:United States representatives from North Carolina Category:Republican Party (United States) politicians Category:People from Asheville, North Carolina Category:Businesspeople from North Carolina Category:American people with disabilities",
 "title": "Madison Cawthorn"
}