{
 "id": "801094",
 "text": "The Enron scandal was an accounting scandal of Enron Corporation, which was an American energy company. It caused the company to go bankrupt in 2001 after people found out about the scandal. The company Arthur Andersen also ended because of it, as they did not audit the company correctly. Arthur Andersen was one of the five largest audit companies in the world. Enron was often said to be the worst audit failure in history. Enron's shareholders filed a lawsuit of $40 billion after the stock price of the company went from US$90.75 to less than $1 in November 2001. This meant the shareholders lost almost all of their money. Dynegy tried to buy Enron for a low price, but this didn't work so Enron went bankrupt on December 2, 2001 under Chapter 11 of the United States Bankruptcy Code. This was the largest bankruptcy in U.S. history at $63.4 billion in assets. This was not passed until the WorldCom scandal in 2002. Many executives at Enron were arrested for many charges and some were later sent to prison. Arthur Andersen was found guilty of illegally destroying documents relevant to the SEC investigation. This voided its license to audit public companies and almost closed the firm. By the time the ruling was overturned at the U.S. Supreme Court, Arthur Andersen lost many of its customers and stopped operating. Enron employees and shareholders received limireturns in lawsuits, despite losing billions in pensions and stock prices. As a consequence of the scandal, new regulations and legislation were passed to expand the accuracy of financial reporting for public companies. The Sarbanes–Oxley Act increased penalties for destroying, altering, or making up records in federal investigations or for attempting to defraud shareholders. The act also increased the accountability of auditing firms to remain unbiased and independent of their clients. ==References== Category:2001 crimes Category:2001 in the United States Category:Economic history Category:Financial and banking scandals",
 "title": "Enron scandal"
}