{
 "id": "8013",
 "text": "Willard Carroll Smith II (born September 26, 1968) is an American actor, producer and rapper. He got his start as part of the rap duo DJ Jazzy Jeff and the Fresh Prince. He became an actor when he starred on the television show The Fresh Prince of Bel-Air as Will Smith, a teenager from Philadelphia sent to live with his rich relatives in Southern California. He has appeared in many movies including Independence Day, Men in Black, Ali, Wild Wild West, The Pursuit of Happyness, I Am Legend, and in Suicide Squad. In 2022, he won a Golden Globe Award, BAFTA Award, Screen Actors Guild Award and an Academy Award for his role as Richard Williams in the 2021 drama movie King Richard. He is the first rapper to win an acting Oscar. ==Personal life== Smith married actress Jada Pinkett in 1997. They have three children, including Jaden and Willow. At the 94th Academy Awards in March 2022, Smith slapped comedian Chris Rock after he made a joke about his wife, Jada's, bald head. Smith was criticized for his violent reaction and on April 1, 2022 Smith resigned his membership from the Academy of Motion Picture Arts and Sciences and said he would support any punishment by the academy. Smith has been banned from going to the Oscar ceremonies for 10 years.https://www.vg.no/rampelys/i/oWa4Jg/will- smith-utestenges-fra-oscar-seremoniene-de-neste-ti-aarene. VG.no ==Filmography== Title Year Role(s) Director(s) Notes Where the Day Takes You 1992 Manny Made in America 1993 Six Degrees of Separation 1993 Paul Bad Boys 1995 Independence Day 1996 Men in Black 1997 Enemy of the State 1998 Wild Wild West 1999 2000 Ali 2001 Showtime 2002 — Executive producer Men in Black II 2002 Bad Boys II 2003 Ride or Die 2003 — Executive producer Jersey Girl 2004 Himself Cameo I, Robot 2004 Executive producer 2004 — Executive producer Saving Face 2004 — Producer Shark Tale 2004 Oscar Bibo Bergeron Rob Letterman Voice role Hitch 2005 Producer ATL 2006 — Producer 2006 Producer Bee Movie 2007 Mooseblood the Mosquito Steve Hickner Voice role I Am Legend 2007 Hancock 2008 Producer 2008 — Executive producer 2008 — Producer Lakeview Terrace 2008 — Producer Seven Pounds 2008 Producer 2010 — Producer This Means War 2012 — McG Producer Men in Black 3 2012 After Earth 2013 Writer (story) producer Anchorman 2: The Legend Continues 2013 ESPN Reporter Cameo Winter's Tale 2014 Lucifer Cameo Annie 2014 — Producer Focus 2015 John Requa Concussion 2015 Suicide Squad 2016 Floyd Lawton / Deadshot Collateral Beauty 2016 Bright 2017 Student of the Year 2 2019 Himself Punit Malhotra Hindi film Cameo Aladdin 2019 Genie The Good Place 2019 / Junior Spies in Disguise 2019 Troy Quane Voice role; post-production Bad Boys for Life 2020 Bilall Fallah Post-production Key Denotes films that have not yet been released ==Discography== ;Studio albums * Big Willie Style (1997) * Willennium (1999) * Born to Reign (2002) * Lost and Found (2005) ==Notes== ==References== ==Other websites== * Category:1968 births Category:Living people Category:Actors from Philadelphia Category:African-American actors Category:American movie actors Category:American television actors Category:American television producers Category:American voice actors Category:BAFTA Award winning actors Category:Best Actor Academy Award winners Category:Golden Globe Award winning actors Category:Movie producers from Pennsylvania Category:Musicians from Philadelphia Category:Rappers from Pennsylvania Category:Screen Actors Guild Award winners Category:Singers from Philadelphia Category:Interscope Records artists Category:American hip hop musicians Category:American hip hop singers Category:American contemporary R&B; singers Category:American R&B; musicians Category:American R&B; singers Category:American dance musicians",
 "title": "Will Smith"
}