{
 "id": "80142",
 "text": "\"Soldier\" is an R&B;/hip hop song written by Beyoncé Knowles, Kelly Rowland, Michelle Williams, Rich Harrison, Sean Garrett, T.I., and Lil Wayne for Destiny's Child's fourth studio album, Destiny Fulfilled (2004). It was produced by Knowles and Harrison and released as the album's second single in fall 2004. The song reached number 3 in Australia and the United States. It became the group's tenth and final consecutive top 10 hit in the US. It peaked in the top 10 in New Zealand, the UK, Denmark, Ireland, Israel, Finland, Italy, Greece and Switzerland. The song also was nominated for a Grammy Award for Best Rap/Sung Collaboration category. It won the Soul Train Lady of Soul Award for Best R&B;/Soul Single by a Group, Band or Duo. == Credits and personnel == * Lead vocals - Beyoncé Knowles, Kelly Rowland, Michelle Williams * Vocal production - Beyoncé Knowles, Kelly Rowland * Recorded by Jim Caruna at Sony Music Studios, NYC * Additional vocals recorded by Tom Tapley, Fabian Marasciullo * Audio mixing - Dexter Simmons * Additional pro tools editing - Rommel Nino Villanueva * Mastered by Tom Coyn ==Official versions== * \"Soldier Part II\" (feat Rohff) * \"Soldier\" (Remix) (feat Stack Bundles, Lil' Wayne & T.I) * \"Soldier\" (DJ Noodles Remix) (feat. T.I. & Trazz) * \"Soldier\" (JS Nu Soul Remix) * \"Soldier\" (Kardinal Beats Remix) * \"Soldier\" (Maurice's Joshua Nu Anthem Remix) * \"Soldier\" (Maurice's Joshua Soul Remix) * \"Soldier\" (Maurice's Joshua Nu Beat Remix) * \"Soldier\" (Danny Howell & Dick Trevor's Kinkyfunk Remix) (feat. T.I.) * \"Soldier\" (Grizz Blackmarket Remix) (feat. T.I. & Lil' Wayne) * \"Soldier\" (MGM Antiloop Confusion Mix) * \"Soldier\" (Bizarre Remix) * \"Soldier\" (Remix) (feat. B.G.) * \"Soldier\" (Remix) (feat. Bizarre of D-12) * \"Soldier\" (Gogh's In House Mix) * \"Soldier\" (Soldja Boy Crank Mix) (performed by Beyoncé Live on her 2007 Tour) Category:2004 songs Category:Destiny's Child songs Category:Lil Wayne songs",
 "title": "Soldier (song)"
}