{
 "id": "801695",
 "text": "Quan Chi is a character from the Mortal Kombat franchise. ==Fictional character biography== Quan Chi is a nefarious free-roaming sorcerer and necromancer who is one of the Mortal Kombat series' main villains. He is first seen in MK Mythologies when he hires both Sub-Zero and his rival Scorpion to find a map leading to the amulet in hopes that they would meet in combat; indeed, Sub-Zero kills Scorpion in battle, after which Quan Chi eliminates Scorpion's Shirai Ryu clan and sends Sub-Zero to find the amulet, which is later revealed to be a fake while Quan Chi kept the real one for himself. After reviving Scorpion as an undead revenant, Quan Chi tells him that Sub- Zero was responsible for the deaths of his clan and family. He makes his playable debut in Mortal Kombat 4, in which he joins forces with disgraced Elder God Shinnok, who had been banished to the Netherealm by the thunder god Raiden after centuries of warring, in ruling the realm. He is the title character along with Shang Tsung in Mortal Kombat: Deadly Alliance (2002), in which he brokers a deal with Shang Tsung for his assistance in reviving the army of Onaga (the game's final boss) in exchange for souls that would preserve Shang Tsung's youth, then eliminate evil Outworld emperor Shao Kahn and the perennial Mortal Kombat champion Liu Kang. They kill Raiden's Earthrealm defenders, but the partnership dissolves when Shang Tsung attempts to steal Shinnok's amulet to take control of Onaga's army for himself. In his futile attempt to stop Onaga, Raiden sacrifices himself by triggering a violent explosion and seemingly killing the Deadly Alliance as well. In Mortal Kombat: Armageddon (2006), Quan Chi attempts to acquire the godlike power of the elemental Blaze. During the battle royal among the combatants on the Pyramid of Argus in the game's opening cinematic sequence, Quan Chi wounds Kenshi in battle before Shang Tsung (disguised as Ermac) throws him off the pyramid. In the game's training mode, Quan Chi suggests that he, Shang Tsung, Shao Kahn, and Onaga work together to defeat the forces of good, but is secretly serving as a double agent for Shinnok. After Raiden reset the timeline in Mortal Kombat (2009), Quan Chi is present at the Shaolin Tournament from the outset, with the resurrected Scorpion serving as his personal assassin. They join forces in the tournament to face the Shaolin monk Liu Kang, but both are defeated. During the second tournament in Shao Kahn's Outworld arena, Quan Chi and Shang Tsung join forces against Kung Lao but are defeated. In the retold events of Mortal Kombat 3 therein, Quan Chi revives the deceased Queen Sindel (as an undead minion) in order to enable Shao Kahn to invade Earthrealm, after having resurrected the dead elder Sub-Zero — killed by Scorpion in the first tournament — as the wraith Noob Saibot to assist him in his plans. He later constructs a Soulnado to take every soul on Earth, but his plans are thwarted by Nightwolf. After Sindel massacres the Earthrealm warriors assembled to stop Shao Kahn's takeover, Raiden seeks cooperation between Earth and the Netherealm by offering Quan Chi their souls as compensation, but Quan Chi has transformed them into his revenant slaves. However, he inadvertently causes Shao Kahn's downfall when he reveals the Elder Gods are obligated to stop the tyrant for failing to honor Mortal Kombat's rules. Raiden kills Shao Kahn and halts his invasion, but Quan Chi makes preparations for Shinnok's invasion, leading Netherrealm's forces in attacking the weakened Earthrealm and Outworld. In Mortal Kombat X (2015), Quan Chi uses the Earthrealm revenants to aid him in retrieving Shinnok's amulet over the course of two years. Though he succeeds in doing so with the aid of D'Vorah, he is decapitated by the resurrected Hanzo Hasashi (Scorpion) once he learns the sorcerer conspired with the Lin Kuei ninja Sektor to kill the Shirai Ryu. In Mortal Kombat 1, Quan Chi returns to live as part of the new era after Liu Kang replaced Kronika as titan of time and rewrited destiny. In Liu Kang's new timeline, Quan Chi led a meaningless life in the mines before being contacted by \"Damashi\", who helps him learn his sorcerer abilities. He begins working with Shang Tsung and General Shao to deceive Empress Sindel into turning against Earthrealm and preparing a coup to overthrow her. While creating Ermac, Quan Chi attempts to prepare a soul stealer to unleash on Earthrealm before he is stopped by Ashrah. One of the souls that escapes the contraptions attacks him, partially devouring his life force, resulting in his skin turning white. After discovering that Damashi is Titan Shang Tsung, who is intent on killing everyone in the timeline, Quan Chi and Shang Tsung assist Liu Kang in stopping him. During the final battle, Titan Shang Tsung summons a Titan Quan Chi to assist him, but both ultimately lose. Afterwards, Quan Chi is imprisoned in Outworld but is freed by Ermac. Left without allies, he returns to the Netherrealm and begins plotting to take the Hourglass for himself. ==Reception== The character was well-liked, but his Fatalities were mixed. Category:Fictional characters introduced in 1996 Category:Fictional mass murderers Category:Fictional murderers Category:Mortal Kombat characters Category:Video game antagonists Category:Video game bosses",
 "title": "Quan Chi"
}