{
 "id": "801639",
 "text": "Ali Fazal (pronounced ; born 15 October 1986) is an Indian actor and model. He made his acting debut with a small role in the English language movie The Other End of the Line (2008). He then acted in the American television miniseries Bollywood Hero (2009). Fazal made his Bollywood debut with a special appearance in 3 Idiots (2009). He then acted in Always Kabhi Kabhi (2011). His first success was in Fukrey (2013). He then acted in supporting roles in movies like Baat Ban Gayi (2013), Bobby Jasoos (2014) and Sonali Cable (2014). He played the main role in the horror movie Khamoshiyan (2015). He then acted in his first American movie Furious 7 (2015). He also played a role in Happy Bhag Jayegi with Diana Penty in 2016. Fazal acted in the British-American movie Victoria & Abdul. The movie portrays the relationship of Queen Victoria (Judi Dench) and her confidant, Indian servant Abdul Karim (Fazal). The movie premiered at the Venice Film Festival in 2017. The costumes worn by the main actors in the film have been added as part of the official display at Osborne House. In 2018, he played Guddu Pandit in Mirzapur. In 2020 he continued his role of Guddu Pandit in Mirzapur season 2. ==Early life== Fazal was born in Lucknow, Uttar Pradesh, India. Fazal's family is from Allahbad. His father worked in a firm in the Middle East. His parents separated when he was a child. From then on, he grew up in his maternal grandparents' home with his grandparents and his mother. The couple divorced when Fazal was 18. He studied at La Martiniere College in Lucknow and The Doon School in Dehradun. In 2004, he participated in school plays and engaged in debates. He was selected for the role of Trinculo, the jester in the play The Tempest by William Shakespeare. It was a memorable role for him. Fazal went to Mumbai and graduated in economics from St. Xavier's College. ==References== ==Other websites== * * Category:1986 births Category:Living people Category:Indian movie actors Category:Indian stage actors Category:Indian models Category:Actors from Lucknow",
 "title": "Ali Fazal"
}