{
 "id": "801758",
 "text": "Egoism is a philosophy about people serving their own needs or wants. Some kinds of egoism say that everything people do is , meaning it is done to serve their own desires. Other kinds of egoism instead say that people should do whatever they want or whatever benefits themselves. Egoism is often seen as the opposite of altruism, meaning the concern for others. \"Altruism\" is a word invented by a French thinker named Auguste Comte. He said that people should only serve each other and never be egoistic. But the German thinker Friedrich Nietzsche says that altruism is not the opposite of egoism.Nietzsche, Friedrich. KSA. 9:11[7] He says that even though people altruism is good, they do not treat each other well very much at all. Many egoists also defend against people getting judged just for doing what benefits themselves. But Nietzsche says that people should eventually leave both altruism and egoism behind. The American researcher James Scanlan says that when people do whatever benefits themselves it is only a fake kind of egoism. And that real egoism is when people do whatever they want. Both are often seen as dangerous beliefs. Some egoists such as Max Stirner, Nikolay Chernyshevsky, and Dmitry Pisarev, are also thought of as nihilists. And Aleister Crowley was a British egoist who made the phrase \"Do what thou will\" popular. == Theories == There are many different kinds of egoism: * Ethical egoism is the belief that it is for people to do whatever benefits themselves. * Default egoism is the belief that people try to benefit themselves. * Psychological egoism is the belief that people try to benefit themselves, even when they don't know it. * Rational egoism is the belief that it for people to do whatever benefits themselves. == Moral psychology == Some ideas of egoism can be studied in moral psychology. For example, Friedrich Nietzsche says that many people wrongly think that being \"good\" is related to not being egoistic. He says that this idea only appeared because priestly values took over from noble values . Nietzsche says that the idea that actions are egoistic or altruistic is pseudo-psychology. He says the truth is that \"there are no such things as egoistic and altruistic actions\". Morality tries to damage psychology with these false ideas, he says. He also says that this kind of morality always serves the needs and wants of some people over others. A British researcher named Alexander Moseley instead says that egoists don't believe psychology can understand people's motivations. == Related pages == * Individualism * Nihilism * Selfishness * Solipsism == References == Category:Ethics Category:Philosophical movements and positions Category:Philosophy of life",
 "title": "Egoism"
}