{
 "id": "801835",
 "text": "Tatiana Melnik (; 25 August 1985, Kyiv, Ukrainian SSR) is a Russian designer and model. She is owner of the “TiMe Deluxe” brand.В Сургуте после концерта Филиппу Киркорову подарили роскошную коронуВ Сургуте Филиппу Киркорову преподнесли корону, украшенную кристаллами SvarowskiРепортаж: Презентация коллекции Татьяны Мельник «Любовь или обман» == Biography == Tatiana Melnik was born in Kyiv, Ukraine. After birth, Tatiana moved to the Tyumen Oblast, Russia, together with her parents. ===Education=== She graduated from school with a mathematical background and advanced study of foreign languages. In 2003, Tatiana Melnik worked as a secretary, then as a financier at “RN- Yuganskneftegaz”. In 2007, she graduated from the Economics Department of Moscow State University. ===Early works=== In 2007, she opened a travel company “Safari Tour” in Nefteyugansk. In 2011, Tatiana Melnik opened the “Malibu” visa center. In 2016, she founded her own brand of handmade jewelry “TiMe Deluxe” and opened a boutique of branded clothing in Surgut. In 2016, the “TiMe Deluxe” premium beauty studio was opened. In 2017, Tatiana Melnik became the face of the Italian cosmetics brand “Oh! my Bella!”. She is a current member of the jury of the international competition for emerging designers “European Fashion Union”, held in Italy. According to some sources, Tatiana Melnik is the personal stylist of Philip Kirkorov. === Brand === In November 2016, Tatiana Melnik presented her own brand \"TiMe Deluxe\" in Surgut and the first collection of jewelry — “Time of luxury”. The presentation was conducted by actress Yekaterina Guseva and stylist Sergey Zverev.Сергей Зверев и Тимати приедут на презентацию бренда Time Deluxe In November 2017, the first capsule collection of clothing by Tatyana Melnik \"Princess to be Queen\" was shown. The “Angels” jewelry collection was presented under the eponymous composition angel performed by Black Star KAN.В Сургуте прошел модный бал от Time DeluxeВ Сургуте прошел модный бал In March 2018, the star calendar “TiMe Deluxe” and the new collection “Love or deception” premiered at the Philipp Kirkorov vocal gallery (Moscow).Сергей Зверев шокировал бомонд розовыми волосами и леопардовыми лосинамиСергей Зверев шокировал общество розовыми волосами и леопардовыми лосинамиАлександр Белов: Каждый образ из новой коллекции Татьяны Мельник запомнился своей индивидуальностью In July 2019, the collection “Summer of love” () was presented in Senigallia, Italy, as part of the 4th national Italian design competition “SENIGALLIA COLLEZIONI-MODA E FORMAZIONE”. In November 2019, the “Pink Vanilla” collection was presented. At the same time, the final of the author's project of Tatiana Melnik “Lady Fashion TiMe Deluxe” took place. The jury consisted of: Nadezhda Babkina, Oksana Fedorova, Natasha Koroleva, Elena Sanzharovskaya and Alexander Belov. In March 2020, Tatiana Melnik and the “TiMe Deluxe” brand participated in the organization of the show “Tarzan”, in collaboration with the Royal circus of Gia Eradze in Moscow. == Collections == * 2016 — “Time of luxury” * 2017 — “Princess to be queen” * 2017 — “Angels” * 2018 — “Love or…” * 2019 — “Pink Vanilla” * 2019 — “L’estate d’amore” == Awards == Year Award Category Result 2017 FashionTV Opening of the yearЦеремония телеканала Fashion TV Russia «Fashion New Year awards 2017»Светская хроника / Fashion New Year awards 2017 в Ritz CarltonЗнаменитости зажгли на предновогодней вечеринке 2017 FashionTV Designer of the yearFashion TV Russia Fashion Summer Awards 2017 2017 Moda Topical Fashion project of the year 2017 EFU 2017, Budapest Jewelry designer of the year in Europe 2018 Russkoye Radio Person of the year 2019 FashionTV The most beautiful fashion designer 2019 Moda e Formazione. Italy 2019 CAPRICE magazine 100 most beautiful people == References == == Other websites == * Official website of the “TiMe Deluxe” brand Category:Living people Category:1985 births Category:Russian designers Category:Moscow State University alumni Category:Tyumen Oblast",
 "title": "Tatiana Melnik"
}