{
 "id": "802039",
 "text": "Ashley Blazer Biden (born June 8, 1981) is an American social worker, activist, philanthropist, and fashion designer. She served as the executive director of the Delaware Center for Justice from 2014 to 2019. Biden also worked in the Delaware Department of Services for Children, Youth, and Their Families. == Early life and family == Ashley Blazer Biden was born on June 8, 1981, in Wilmington, Delaware to then U.S. Senator Joe Biden and Jill Biden. She is the half-sister of Beau Biden, Hunter Biden, and Naomi Biden, from her father's first marriage to Neilia Hunter Biden. Biden is a great-great- granddaughter of Edward Francis Blewitt. She is of English, French, and Irish descent on her father's side and English, Scottish, and Italian descent on her mother's side. Biden was raised Catholic and was baptized in Greenville, Delaware. During her childhood, her father served in the United States Senate from Delaware and her mother worked as an teacher. Biden attended Wilmington Friends School, a private school run by the Religious Society of Friends in Wilmington. She was on her school's lacrosse and field hockey teams. When she was in elementary school, she discovered cosmetics products on animals. She wrote a letter to the company asking them to change their policy on animal testing. == Education and career == Biden studied cultural anthropology at Tulane University. During her freshman year of college, she worked at Girls Incorporated as a camp counselor. She also worked as a intern at a summer program at Georgetown University, working with youth from Anacostia. After college, Biden worked as a waitress at a pizza shop in Wilmington for a few months before starting her career in social work. She moved to Kensington, Philadelphia and started a job as a clinical support specialist at the Northwestern Human Services Children's Reach Clinic, helping children and their families with getting resources and working directly with psychiatrists and therapists. She earned a master's of social work degree from the University of Pennsylvania School of Social Policy and Practice in 2010. She was one of twelve graduates who received the John Hope Franklin combating American Racism Award. === Social work and activism === Biden works as a social justice activist and social worker. She worked as a social worker in the Delaware Department of Services for Children, Youth, and Their Families for fifteen years. While working for the department, Biden created programs for youth focusing on juvenile justice, foster care, and mental health. In 2012, she joined the Delaware Center for Justice as an associate director, focusing on criminal justice reform in the state. She founded the YoungArt program that provides resources for students to create artwork while they are detained in detention facilities, and then sells the art in the community. Through the program, Biden also teaches the students business and financial literacy skills. === Fashion === In 2017, Biden launched the Livelihood Collection, a fashion clothing brand, at Spring Place in TriBeCa during New York Fashion Week. The launch event was attended by Biden's parents and celebrities including Olivia Palermo and Christian Siriano. The brand grouped with Gilt Groupe and Aubrey Plaza to raise $30,000 for the Delaware Community Foundation. Livelihood's logo was inspired by her half-brother Beau Biden, who died of brain cancer in 2015. Biden created the brand to help combat income inequality and racial inequality in the United States. She decided to design hoodies due to their connection to the Labor Movement to help towards social justice movements. The brand's website gives information about civic engagement and economic justice. In June 2020, Biden designed the uniforms for the staff at the Hamilton Hotel in Washington, D.C., as an offshoot of her Livelihood Collection == Personal life == In 2010, she began dating Howard Krein, a plastic surgeon after being introduced by her eldest brother, Beau. They got married at St. Joseph's on the Brandywine in 2012. == References == Category:1981 births Category:Living people Category:American philanthropists Category:American political activists Category:American fashion designers Category:Businesspeople from Wilmington, Delaware",
 "title": "Ashley Biden"
}