{
 "id": "802207",
 "text": "The International Art Society & Academy (International Art Society and Academy, Διεθνής Εταιρεία Τέχνης και Ακαδημία) is an art association founded in 2007 by a Greek classical guitarist and composer Yorgos Foudoulis. The Society is in Volos, Greece. Every year the society organizes international art competitions (Interartia, Ithagenia, World Award, World Book Award, Artist of the Year, World Poetry Competition \"Manolis Aligizakis\") dominantly in various fields of music, but also in poetry, plastic arts and other forms of artistic expression. Since its start the society awarded and collaborated famous and notable artists like Martha Argerich (the winner of the Japanese Premium Imperiale and 3 Grammy awards), Éric Pénicaud, Nobuyuki Tsujii, The Quartetto di Cremona, Peter Bence (Guinness World Record-breaking pianist with \"the fastest fingers on the planet\"), Fraguial Francisco Guilherme de Almeida Jesus, Alondra de la Parra (the current Music Director of the Queensland Symphony Orchestra), Marco Minnemann, Tolgahan Çoğulu, Sungha Jung, Silesian Guitar Octet and many others. Within the society also is active the International Art Academy which is an examination board based on UK and US models (an international nonprofit training, education, and certifying organization) only for arts. Many well known artists serves as members, mentors or (honorary) professors like Małgorzata Chodakowska (sculpture), Tolgahan Çoğulu, Marios Joannou Elia, Dario Cebić, Pero Šiša, Thelxis Theohari (Θέλξη Θεοχάρη, the author of a number of the public monuments in Greece), Melissa Studdard (an author, the winner of a Forward National Literature Award and Pinnacle Book Achievement Award), Dimitris P. Kraniotis, Candice James (the poet laureate of New Westminster, British Columbia), Robert Hagan (a painter and the host of the Discovery HD/Discovery television show Splash of Color), Miran Vaupotich and others. Yorgos Foudoulis is the president of the International Examination Center of the International Art Academy and the director of the Examination Center of Trinity College London. In addition to these competitions, the International Academy of Arts, with the support of the Directorate for Organizational and Academic Development of the Greek Ministry of Education, traditionally organizes the World Poetry Competition 'K.P.Kavafis'. The International Examination Center at the International Art Academy in Volos acts under the legal framework of Examinations Boards, but all the certificates and substantial (earned) academic degrees in arts are currently issued in an honorary form in order to align itself to the present legal limitations in Greece (despite the fact that IAA is not the university or college per se). According to the State Constitution of Greece, \"education at the university level must be provided exclusively by institutions which are fully self-governed Public law legal bodies\". In cooperation with the Foudoulis Conservatory, the World Guitar Festival Volos, World Guitar Orchestra Volos and World Guitar Center organize the World Composition Competition 'KITHARA' with an emphasis on guitar (solo guitar, musical ensembles, guitar ensembles, orchestras, etc.). == References == Category:Art",
 "title": "International Art Society & Academy"
}