{
 "id": "802360",
 "text": "Single wicket cricket is a form of cricket played between two individuals, who take turns to bat and bowl against each other.The one bowling is assisted by a team of fielders, who remain as fielders at the change of innings. The winner is the one who scores more runs. There was considerable interest in single wicket during the middle part of the 18th century when it enjoyed top-class status. Some matches involved teams of two to, perhaps, five players who would bat individually—in first-class cricket, there are always two batters in play. Almost never seen professionally today, single wicket is most often encountered in local cricket clubs, in which there are a number of knockout rounds leading to a final. The exact rules can vary according to local practice: for example, a player might be deducted runs for an out rather than ending his or her innings. An innings typically is limited to two or three overs. When single wicket was popular in the 18th century, however, there was no overs limitation, and a player's innings ended only on his dismissal. ==History== Single wicket has known periods of huge success when it was more popular than the eleven-a-side version of cricket. This was especially so among gamblers at the Artillery Ground during the middle years of the 18th century. Star performers at the time included Robert Colchin, Stephen Dingate, Tom Faulkner and Thomas Waymark. It was in a single-wicket match on 22–23 May 1775 that Surrey bowler Lumpy Stevens beat Hampshire batter John Small three times with the ball going through the two-stump wicket of the day. As a result of Stevens' protests, the patrons agreed that a third stump should be added. Despite this famous match, single wicket experienced a lull during the Hambledon Era, and in the early years of Marylebone Cricket Club (MCC), but its popularity soared again in the first half of the 19th century when leading players like Alfred Mynn and Nicholas Felix took part in some significant matches. From about 1800 to the 1820s, single wicket matches were popular but riddled with gambling-related match fixing. With the rise of the All-England Eleven and a growing interest in county cricket, single wicket lapsed again and has rarely been seen at the highest level since 1850, despite a brief revival in the 1960s.There is reference to the single-wicket competitions of the 1960s in this article, but it is inaccurate on the details. A single wicket competition called the Courage International Batsman of the Year was held at The Oval over two days in September 1979. The event was won by Clive Lloyd, who beat David Gower in the final. ==Laws== The laws of single wicket differed from contest to contest and it was possible to utilise the basic single wicket rules in games involving two to five players per side. In 1831, a set of laws was created that were meant to apply universally. These were as follows: # When there shall be less than five players on a side, bounds shall be placed, twenty-two yards each, in a line from the off and leg stump. # The ball must be hit before the bounds to entitle the striker to a run, which run cannot be obtained unless he touch the bowling stump or crease in a line with it with his bat, or some part of his person, or go beyond them, returning to the popping-crease as at double wicket, according to the 22nd Law. # When the striker shall hit the ball, one of his feet must be on the ground, and behind the popping-crease; otherwise the umpire shall call 'No Hit.' # When there shall be less than five players on a side, neither byes nor overthrows shall be allowed; nor shall the striker be caught out behind the wicket, nor stumped out. # The fieldsman must return the ball so that it shall cross the play between the wicket and the bowling stump, or between the bowling stump and the bounds. The striker may run till the ball shall be so returned. # After the striker shall have made one run, if he start again he must touch the bowling stump, and turn before the ball shall cross the play to entitle him to another. # The striker shall be entitled to three runs for a lost ball, and the same number for ball stopped with hat, with reference to the 29th and 34th Laws at double wicket. # When there shall be more than four players on a side, there shall be no bounds. All hits, byes, and overthrows shall then be allowed. # The bowler is subject to the same laws as at double wicket. # Not more than one minute shall be allowed between each ball. ==References== ==Bibliography== * More Than a Game by John Major * Scores & Biographies by Arthur Haygarth Category:Forms of cricket",
 "title": "Single wicket cricket"
}