{
 "id": "80257",
 "text": "Manchukuo was a puppet state of the Empire of Japan in China and Inner Mongolia from 1932 to 1945. It was first a republic, but in 1934. it became a constitutional monarchy. It had little international recognition and was under the de facto control of Japan. Japan also took Inner Mongolia in 1936 and renamed it Mengjiang in 1936. == Names == Manchukuo means Manchuria in Japanese 満州国 (Manchukoku). The Mongolians called it (Mongolian : Манеж-Го, Manjugo). The Soviets called it (Russian : Маньчжоу-Го, Man’chzhou-Go). The Chinese called it (Chinese : 满洲国, mǎnzhōuguó). The Koreans called it (Korean : 만주국, Manjugug). == History == Manchuria was the place of the Manchus, including the kings of the Qing dynasty. In 1931, Japan occupied Manchuria after the Mukden Incident. A pro-Japanese government was created one year later, and Puyi, the last Qing emperor, was the nominal regent and later emperor.Encyclopædia Britannica article on Manchukuo Manchukuo's government was removed in 1945 at the end of World War II. The Soviet Union invaded in August 1945 and formally transferred the territory to Chinese administration in the following year. Although the territories came under the jurisdiction of the Nationalist government, the brief Soviet occupation helped make the region a base for the Chinese Communist troops led by Mao Zedong. The People's Liberation Army got Japanese equipment and a strategic advantage against the National Revolutionary Army, led by Chiang Kai-shek.Borisov O. 1977. The Soviet Union and the Manchurian Revolutionary Base (1945-1949). Moscow, Progress Publishers. Manchus were a minority in Manchukuo, and the the largest ethnic group were Han Chinese. The number of Koreans increased in Manchukuo, and there were also Japanese, Mongols, White Army Russians, and other minorities. The southern part of the Liaodong Peninsula was ruled by Japan as the Kwantung Leased Territory. Manchukuo had a Japanese death camp, called Unit 731, where up to half a million died from medical experiments and other causes. That is similar to the Nazi concentration camp of Auschwitz, in German-occupied Poland. In August 1945 Stalin invaded Manchukuo, Mengjiang, and norhern Korea. America occupied southern Korea since the two large countries had divided Korea into two. The Soviet leader, Joseph Stalin, controlled Manchuria until 1946. The same year, Stalin began to help Mao win the Second Chinese Civil War (1946-1949). == References == Category:Former countries in Asia Category:20th century in Japan Category:20th century in China Category:1932 establishments in Asia Category:1945 disestablishments in Asia Category:20th century in Mongolia Category:Puppet states Category:Former dictatorships",
 "title": "Manchukuo"
}