{
 "id": "80259",
 "text": "Armenian genocide denial refers to the false belief that the Armenian genocide did not happen or was not as bad as it was. From 1915 until 1923, the Islamic Ottoman Empire tried to wipe out the Armenians. About 1,500,000 Armenians were killed. ==Denialist claims== Below is a summary of the common claims made by Armenian genocide deniers: Type Rhetoric Common * \"The genocide was a legitimate state action that could not be challenged on legal or moral grounds\" * \"Armenians were to be blamed for it, so there was no genocide\" * \"Armenians rebelled in the eastern Ottoman provinces. They worked for Russia, so fighting them was not a genocide\" * * * Other * \"Fewer than 300,000 Armenians died\" * \"Some Armenians were spared, like Armenian Catholics and Protestants, so there was no genocide\" * \"Many of the sources are made up. The survivors and Western diplomats lied\" * \"Armenians were the ones who committed a genocide against Turks\", as shown by the \"Iğdır Genocide Memorial and Museum\" * * * ==History== ===Origins of Armenian genocide denial in Turkey=== The Armenian genocide started in 1915, but since 1789, Turkey has denied many acts of violence towards the Armenian people. Fatma Gocek, who studies the Armenian genocide, believes that because Turkey has denied violence towards Armenians since 1789, Turkey was more likely to deny the Armenian genocide. Since the Armenian genocide happened, the main claim of denial used by the Ottoman Empire (later the Republic of Turkey) has remained the same.The Ottoman Empire believes that the genocide never happened, that Turkey is not responsible for the genocide and that “Genocide” is too strong word to use to describe what happened. The leaders of the Ottoman Empire thought they could not say the Armenian Genocide was real. This was because most of the countries the Ottoman Empire was allied with had mainly Christian people. Armenians were also Christian, and if the Ottoman Empire’s allies found out the Ottoman Empire used violence against other Christians, the allies would have been upset. Thus, the leaders of the Ottoman Empire attempted to frame the deportations as a response to a national security threat posed by the Armenians. During the time the genocide was happening, Enver Pasha, told the American ambassador Henry Morgenthau Sr. that the Armenians were separatists, traitors and violent towards Ottoman soldiers and that was why the Ottoman government had to displace them. This was untrue, Armenians were only violent after the genocide had started. After World War I, Talat Pasha followed Enver's strategy to deny the Armenian Genocide. The Armenians did not participate in violence against the government until after the genocide had started. The violence the Armenians participated in was for their self- defense. The Ottoman Empire tried to prove they were not responsible for the genocide by trying to place the blame on other groups. The Ottoman Empire blamed corrupt officials, Kurds, and criminals for the events of the genocide. Mustafa Kemal Ataturk was the founder of Turkey, and still holds a very important role in how Turkish people see themselves. Ataturk originally supported justice for people responsible for the genocide. He said the genocide was * “[A] Shameful [act]” ** and said * “What were the Allied powers waiting for before hanging these scoundrels” ** Ataturk meant that the Allied powers of World War 1 should have sentenced the people responsible for the genocide to death. In 1920 the Treaty of Sevres was signed. This would have resulted in a loss of land and loss of sovereignty (the ability for a country to govern itself independently) for Turkey. In 1921 Greece invaded Turkey. In two ways Turkey’s territory and sovereignty were threatened. Because of this, Ataturk changed his opinion on the Armenian Genocide so he could bring Turks together. Ataturk denied the Armenian Genocide to promote nationalism and unity against the two major threats (The Treaty of Sevres and the Greek invasion). Later, Turkey began a campaign claiming that people who survived the genocide were lying. Turkey also said that foreigners who said the Armenian Genocide happened were part of a group conspiring against Turkey (trying to cause harm to Turkey). Also, Turkey said any documents proving the Armenian Genocide happened were fake. ==Armenian genocide denial in modern Turkey== Today, denial of the Armenian Genocide is a large part of Turkish nationalism and how Turks define themselves. If a Turk agreed that the Armenian Genocide was real, this would go against how Turks see their country. This would cause problems with self and national-identity. Many in Turkey still do not believe the Armenian Genocide happened. This is because of five reasons. Firstly, there were laws which said that people who publicly said they believe the Armenian Genocide is real could go to jail. Secondly, people who believe in the Armenian Genocide are seen as traitors. This creates a lot of social pressure to continue denial. Thirdly, many Turkish people do not learn about Armenian history. Fourthly, many Turkish and Kurdish people gained property and wealth because of the genocide. When Armenian people were removed from their homes, their homes and belongings were divided between other people. Fifthly, Turkish people were affected by social amnesia (a group of people start to forget their past because other people remove evidence of the truth). ==Research== In 1990, psychologist Robert Jay Lifton got a letter from the Turkish Ambassador to the United States. In the letter, the Ambassador asked Lifton how he could have talked about the Armenian Genocide in one of his books (because the Ambassador believed the Genocide never happened). By mistake, the Ambassador also included a draft of a letter written by scholar Heath Lowry, which told him how to keep the Armenian Genocide from being talked about in books. Lowry was later named to a chair (an important position) at Princeton University. Princeton had been given a $750,000 grant from the Republic of Turkey. This led to many arguments about ethics in scholarship. Open University of Israel scholar Yair Auron has talked about the different ways the Turkish government has tried to make it seem like the Armenian Genocide never happened:Auron, Yair. The Banality of Denial, p. 47 Auron is saying that since the 1980s, the Turkish government has given money to some good universities to create \"institutes\" that should study Turkish history and culture more in details. However, these institutes helped to deny the Genocide and the events of it even more. University of California, Los Angeles scholar Leo Kuper, in a review on Ervin Staub's The Roots of Evil: The Origins of Genocide and Other Group Violence, wrote:\"Review (The Roots of Evil: The Origins of Genocide and Other Group Violence. by Ervin Staub)\", Leo Kuper // Contemporary Sociology, Vol. 19, No. 5. (Sep., 1990), p. 683 Kuper is saying that the Turkish government keeps saying the Genocide never happened. But in courts-martial after World War I, the Turkish government admitted that it organized, planned, and committed the genocide of Armenians. ==Issues== ===Laws in Turkey=== In the aftermath of the Armenian Genocide, the newly founded Republic of Turkey created an organization that investigated how many Armenians had died between 1915 and 1918. It was discovered that 800.000 people had died during this time, though many historians believe the death toll is much higher. The founder of modern Turkey, Mustafa Kemal Atatürk, admitted to the killing of Armenians more than once after the World War I, and many within his movement agreed accountability was needed. This changed in the following years, when it was discovered that many of Turkey's founders were involved in the genocide. Since these men were celebrated as heroes during the First World War, their crimes were not recognized by Turkey. Turkey continues to deny the murder of the Armenian people in the Ottoman Empire was a genocide. While there is no a specific law in Turkey today that forbids people from talking about the genocide, there have been many cases of Turkey using the law to stop education on the Armenian Genocide. Scholars of history have named several reasons why does Turkey still continues to deny the Armenian Genocide. For instance, many Turkish policymakers have expressed that admitting to the genocide would result in Armenia calling for reparations, or even demand back the territories they lost in World War I. ===International Laws=== Some countries, for example, Switzerland, have laws which punish thoese people who deny genocides or crimes against humanity. A Turkish politician Dogu Perinçek was found guilty by this Swiss law in March 2007 because he said that the Armenian genocide is “a great international lie.” He did not agree with the court`s decision, and he said that the decision went against his freedom of speech (the right to express ones opinion without legal intervention). He went against the court`s decision, and his law case went to the European Court of Human Rights. The court decided that Dogu Perinçek is not guilty and that this law is against the freedom of expression. ===Mass media=== In the June 6, 2005 edition of the TIME Europe magazine, the Ankara Chamber of Commerce paid for tourism advertisements. These advertisements included DVDs accusing Armenian people of killing Turkish people. TIME Europe later apologized for sharing the DVD and published a letter saying the DVDs were wrong. The February 12, 2007 edition of TIME Europe had a page that said that the Armenian genocide did really happen. It also included a DVD of a documentary by French director Laurence Jourdan about the genocide. In 2014, Armenian-American singer-songwriter Serj Tankian wrote a letter addressed to the \"People of Turkey\" in which he posed the question \"Must I fight propoganda and corruption internationally to regain justice?\" In it he talks about how the Denial of the Armenian Genocide has impacted him, and how he feels Turkey could do better moving forward. ===Armenian Genocide Remembrance Day=== The 24th of April is the Armenian Genocide Remembrance Day. In 2015, exactly 100 years after the genocide, lots of seminars, workshops, and events were organized in the capital city of Armenia, Yerevan. Presidents, politicians and important people from all around the world were invited, and the Turkish President Recip Tayyip Erdogan as well. Erdogan answered back with an invitation for a celebration of the battle of Gallipoli. For the first time, the celebration of this battle was on the same day as the Armenian Genocide Remembrance Day. This decision might have been a trick to turn international attention away from the Armenian Genocide. Armenian president at that time, Armen Sargystan, said in his answer to Erdogan`s invitation that “it is not our rule to be hosted by guests.” On this day, there were protests all around the world. For example, in Tehran, around 1,000 people protested in front of the Turkish embassy. Even in Istanbul around 100 people called for the recognition of the Armenian genocide. ==Countries that recognise the Armenian genocide== The following countries recognize the Armenian genocide: # Argentina # Austria # Belgium # Bolivia # Brazil # Canada # Chile # Cyprus # Czech Republic # Denmark # France # Germany # Greece # Italy # Latvia # Lebanon # Lithuania # Luxembourg # Mexico # Netherlands # Paraguay # Poland # Portugal # Russia # Slovakia # Sweden # Switzerland # Syria # Vatican City # Venezuela # United States # Uruguay ===United States=== ====Ronald Reagan==== On April 22 1981, US President Ronald Reagan talked about the Armenian Genocide in reference to a speech he made about the Holocaust, saying \"Like the genocide of the Armenians before it ... the lessons of the Holocaust must never be forgotten\". ====Joe Biden==== In 2021, US President Joe Biden said that the killing of the Armenians in the Ottoman Empire was a genocide. This was the first time when an American president formally and publicly recognised this event as a genocide. This decision made relationships between USA and Turkey more complicated but was important for Armenians living in the United States. ==Related pages== * Holocaust denial * Holodomor denial * Bosnian genocide denial * Rwandan genocide denial * Cambodian genocide denial ==Footnotes== ==References== Category:Racism Category:Disinformation Category:Genocide denial Category:Anti-Armenianism Category:Armenian Genocide Category:Conspiracy theories",
 "title": "Armenian genocide denial"
}