{
 "id": "802685",
 "text": "This is the list of the stations on digital television in the Philippines. The availability of channels to viewers depends on their location. The National Telecommunications Commission (NTC) has adopted the ISDB-Tb standard for Philippine television. ==Background== Updated as of . Most channels are still under test broadcast. All analog services are expected to be terminated by the end of 2025. *Data collected from sources and some wiki pages. *Channels received may vary with location or with the strength of the signal of the broadcaster. *Most of the channels are in the phase of test broadcast, resulting to some places that cannot receive other stations due to dead spots and low transmitting power among stations. *Some Channels are encrypted and can only be accessed through select set-top box or mobile dongle manufacturers. ==Metro Manila== ===National Capital Region (NCR)=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWGT-TV 14 473.143 MHz 4.01 People's Television Network PTV HD PTV 16:9 1080i HDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 7 a.m. - 1 a.m. Commercial broadcast (10 kW TPO; 25 kW ERP) 4.02 PTV SD 16:9 480i SDTV 4.03 PTV NEWS Radyo Pilipinas 1 6 a.m. - 8 p.m. 4.04 PTV SPORTS PTV Sports Network 8 a.m. – 6 p.m. 4.05 PTV 1SEG PTV 16:9 240p LDTV Weekdays: 5:30 a.m. - midnight Weekends: 7 a.m. - midnight 1seg DZBB-TV 15 479.143 MHz 7.01 GMA Network, Inc. GMA GMA Network 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (15 kW TPO; 100 kW ERP) 7.02 GTV GTV Monday to Sunday: 5:30 a.m. to midnight (the next day) 7.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. to midnight Weekends: 5:30 a.m. to midnight (the next day) 7.04 HEART OF ASIA Heart of Asia 6 a.m. to midnight 7.05 I HEART MOVIES I Heart Movies 7.06 Test broadcast 7.21 GMA 1Seg GMA Network 4:3 240p LDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) 1seg DZMV-TV 16 485.143 MHz 2.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) ALLTV HD All TV 16:9 1080p HDTV Monday to Sunday: 7:00 a.m. - midnight Test broadcast (10 kW TPO/25 kW ERP) DZTV-TV 17 491.143 MHz 13.01 Intercontinental Broadcasting Corporation IBC HD IBC 13 rowspan=\"3\" 16:9 1080i HDTV Weekdays: 5:30 a.m. - 11:00 p.m. Weekends: 7:00 a.m. - 10:00 p.m. Test broadcast (3 kW TPO/ 8 kW ERP) 13.02 Congress TV Congress TV 9:00 a.m. to 9:00 p.m. 13.03 DWAN HD DWAN 1206 TV 5:00 a.m. – midnight DWET-TV 18 497.143 MHz 5.01 TV5 Network Inc. TV5 TV5 Network 16:9 480i SDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Network 16:9 144p LDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg DZKB-TV 19 503.143 MHz 19.01 Radio Philippines Network RPN RPN 16:9 480i HDTV 5 a.m. – 1:30 a.m. (the next day) Test broadcast (5 kW TPO 10 kW ERP) 19.02 Nine Media Corporation, Radio Philippines Network and Cignal TV (Operated under blocktime agreement from TV5 Network Inc.) RPTV HD RPTV 16:9 1080i HDTV 6 a.m. - midnight 19.06 Radio Philippines Network RPN 1Seg RPN 16:9 240p LDTV 5 a.m. – 1:30 a.m. (the next day) 1seg DZOE-TV 20 509.143 MHz 20.21 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z 4:3 480i SDTV Monday - Friday: 4 a.m. - 12:45 a.m. (the next day) Saturday: 5 a.m. - 12:30 a.m. Sunday: 5 a.m. - 12:15 a.m. (the next day) Commercial broadcast (10 kW TPO; 30 kW ERP) 20.24 Light TV Light TV Monday - Sunday: 7 a.m. - 9 p.m. 20.31 A2Z OneSeg A2Z 4:3 240p LDTV Monday - Friday: 4 a.m. - 12:45 a.m. (the next day) Saturday: 5 a.m. - 12:30 a.m. Sunday: 5 a.m. - 12:15 a.m. (the next day) 1Seg DWCP-DTV 21 515.143 MHz 21.01 Southern Broadcasting Network and Solar Entertainment Corporation SolarFlix SolarFlix 4:3 480i SDTV 6 a.m. - midnight Fully migrated from analog to digital on Commercial broadcast (3 kW) 21.02 Solar Sports Solar Sports 21.03 DepEd ALS Solar Learning/DepEd TV ALS 21.04 Shop TV Shop TV DWIZ-DTV 23 527.143 MHz 23.01 Aliw Broadcasting Corporation ALIW 23 HD ALIW 23 16:9 1080i HDTV 4 a.m. - 10 p.m. Test broadcast / Configuration Testing (5 kW) 23.02 ALIW 23 SD 16:9 480i SDTV DZRH-TV 24 533.143 MHz 24.01 Manila Broadcasting Company DZRH TV DZRH News Television 16.9 720p HDTV 24 hours Test broadcast (1.5 kW) 24.31 DZRH TV 1seg 4:3 240p LDTV 1seg DZEC-DTV 28 557.143 MHz 28.01 Eagle Broadcasting Corporation NET 25 HD Net 25 16:9 1080i HDTV 24 hours Commercial broadcast (10 kW) 28.02 NET 25 SD 16:9 480i SDTV 28.03 INCTV HD 16:9 1080i HDTV 28.04 INCTV SD INC TV 16:9 480i SDTV 28.05 EBC RESERVED Net 25 16:9 1080i HDTV DZRJ-DTV 29 563.143 MHz 29.21 Rajah Broadcasting Network RJ DigiTV RJ DigiTV 16:9 480i SDTV 5 a.m. - 2 a.m. (the next day) Fully migrated from analog to digital (still on test broadcast) (2.5 kW) (poor signal transmission) 29.22 Timeless TV Timeless TV 24 Hours 29.23 Radyo Bandido TV Radyo Bandido 5 a.m. - midnight 29.24 Rock of Manila TV RJ Rock TV 5 a.m. - 2 a.m. (the next day) 29.25 TV Maria TV Maria 24 Hours DWKC-DTV 31 575.143 MHz 31.01 Broadcast Enterprises and Affiliated Media PRIME TV Prime TV 4:3 480i SDTV 4 a.m. - midnight (the next day) Fully migrated from analog to digital Commercial broadcast (5 kW TPO/25kW ERP) 31.02 BLAST SPORTS Blast Sports 16:9 480i HDTV 6 a.m. to midnight 31.03 Knowledge Channel Knowledge Channel 4:3 480i SDTV 6 a.m. - 11 p.m. 31.04 BLAST MOVIES Blast Movies 6 a.m. - midnight (the next day) 31.05 Bilyonaryo News Channel Bilyonaryo News Channel 5 a.m. – midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV Pilipinas HD / D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DZOZ-DTV 33 587.143 MHz 33.01 ZOE Broadcasting Network Light TV HD Light TV 16:9 480i SDTV Monday - Saturday: 8 a.m. - 8 p.m. Sunday: 7 a.m. - 8 p.m. Fully migrated from analog to digital (Still under test broadcast) (5 kW TPO; 25 kW ERP) 33.02 Light TV SD1 Light TV Promotional channel 33.31 Light TV 1seg Light TV 4:3 240p LDTV 1seg DWAO-TV 38 617.143 MHz 55.01 Progressive Broadcasting Corporation and Information Broadcast Unlimited UNTV UNTV 4:3 480i SDTV 24 hours Test broadcast (1 kW) (poor signal transmission) 55.02 STV STV / currently mirror feed from UNTV 16:9 1080i HDTV 55.03 TRUTH CHANNEL Truth Channel 55.04 UNTV Reserve 4:3 240p LDTV 55.31 UNTV 1SEG UNTV 1seg DWDE-TV 42 641.143 MHz 42.01 Brigada Mass Media Corporation BRIGADA TV-HD Brigada TV 16:9 1080i HDTV 4:00 a.m to 12:30 a.m. Test broadcast (1 kW) 42.02 BRIGADA TV-SD 105.1 Brigada News FM Mega Manila 16:9 480i SDTV DWVN-DTV 45 659.143 MHz 45.01 Gateway UHF Television Broadcasting and Global Satellite Technology Services Hope Phil Hope Channel Philippines 16:9 1080i HDTV 24 hours Fully migrated from analog to digital (Still under test broadcast) (3.5 kW) (poor signal transmission) 45.02 Hope Intl 16:9 480i SDTV 45.03 Hope Live 45.04 OMN SD One Media Network DZCE-TV 49 683.143 MHz 01.01 Christian Era Broadcasting Service International INC TV HD INC TV 16:9 1080i HDTV 4 a.m. – midnight Test broadcast (10kW) 01.02 INC TV HD1 01.03 INC TV SD 4:3 480i SDTV DWNB-DTV 51 695.143 MHz 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Network 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (Mirror feed from DTT-18) (5.5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Network 16:9 144p LDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg ==Luzon== ===Cordillera Administrative Region (CAR)=== ===Benguet=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DZHB-DTV 17 491.143 MHz (Metro Baguio and Northern Central Luzon) 13.01 Intercontinental Broadcasting Corporation IBC 13 IBC Baguio 16:9 1080i HDTV Weekdays: 5:30 a.m. – 11:00 p.m. Weekends: 7:00 a.m. – 10:00 p.m. Test broadcast (1 kW TPO/10 kW ERP) 13.02 Congress TV Congress TV 9:00 a.m. – 9:00 p.m. 13.03 DWAN HD DWAN 1206 TV 5:00 a.m. – midnight DZBS-DTV 19 503.143 MHz (Metro Baguio and Northern Central Luzon) 19.01 Radio Philippines Network RPN RPN Baguio 16:9 480i SDTV 5 a.m. – 1:30 a.m. (the next day) (Test broadcast 5 kW TPO/30 kW ERP) 19.02 Radio Philippines Network, Nine Media Corporation and Cignal TV RPTV RPTV 16:9 1080i HDTV 6 a.m – midnight 19.06 Radio Philippines Network RPN 1seg RPN Baguio Relay 16:9 240p LDTV 5 a.m. – 1:30 a.m. (the next day) 1seg DWHB-DTV 26 545.143 MHz (Metro Baguio and Northern Central Luzon) 26.01 Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Weekdays: 4 a.m. – midnight (the next day) Fully migrated from analog to digital Commercial broadcast (5 kW TPO/25kW ERP) 26.02 BLAST SPORTS Blast Sports 6 a.m. - midnight 26.03 Knowledge Channel Knowledge Channel 4:3 480i SDTV 6 a.m. to 11 p.m. 26.04 BEAM CINEMA Beam Cinema 6 a.m. – midnight (the next day) 26.05 Bilyonaryo News Channel Bilyonaryo News Channel Daily: 5 a.m. - midnight 26.06 LIFE TV Life TV 16:9 480i SDTV 26.07 D8TV D8TV 26.08 RESERVED Reserved 4:3 480i SDTV DWAY-DTV 30 569.143 kW (Metro Baguio and Northern Central Luzon) 2.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) ALL TV HD All TV 16:9 1080i HDTV Monday to Sunday: 7:00 a.m. – midnight (the next day) Test broadcast (10 kW TPO and 60 kW ERP) DWOZ-DTV 32 581.143 MHz (Metro Baguio and Northern Central Luzon) 32.01 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z 4:3 480i SDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:30 a.m. Sundays: 5 a.m. - 12:15 a.m. (the next day) Test broadcast (10 kW TPO/30 kW ERP) 32.02 Light TV Light TV Monday - Sunday: 7 a.m. – 9 p.m. 32.31 A2Z OneSeg A2Z 4:3 240p LDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:30 a.m. Sundays: 5 a.m. - 12:15 a.m. (the next day) 1Seg DZEA-DTV 38 617.143 MHz (Metro Baguio and Northern Central Luzon) 10.01 GMA Network Inc. GMA GMA Dagupan/Baguio 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (15 kW TPO/90 kW ERP) 10.02 GTV GTV 5:30 a.m. – midnight (the next day) 10.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 10.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight (the next day) 10.06 I HEART MOVIES I Heart Movies 10.11 rowspan=\"1\" rowspan=\"1\" rowspan=\"1\" Test broadcast 10.31 GMA 1Seg GMA Dagupan/Baguio Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg D-8-XM-DTV 42 641.143 MHz (Metro Baguio and Northern Central Luzon) 4.01 People's Television Network PTV Cordillera PTV Cordillera 16:9 1080i HDTV Weekdays: 5 a.m. - 1 a.m. Weekends: 6 a.m. - 1 a.m. Test broadcast (5 kW) 4.02 PTV SD1 PTV Manila 16:9 480i SDTV 4.03 PTV SD2 Radyo Pilipinas 1 5 a.m. – 8 p.m. 4.04 PTV SD3 PTV Sports 8 a.m. – 6 p.m. 4.05 PTV 1seg PTV 4:3 240p LDTV Weekdays: 5 a.m. - 1 a.m. (the next day) Weekends: 6 a.m. - 1 a.m. (the next day) 1seg DWFB-DTV 44 653.143 MHz (Metro Baguio and Northern Luzon) 44.01 Global Satellite Technology Services GNN North Luzon GNN North Luzon 16:9 480i SDTV (sometimes 720p HDTV) 5 a.m. - midnight Fully migrated from analog to digital / Test Broadcast (1.5 kW) 44.02 RNG TV Highland TV / RNG Luzon 44.03 Golf TV Golf Channel 44.04 Global Satellite Technology Services and Gateway UHF Television Broadcasting Hope Channel Philippines Hope Channel Philippines DWDM-DTV 46 665.143 MHz (Metro Baguio and Northern Luzon) 25.02 Eagle Broadcasting Corporation NET 25 Net 25 16:9 1080i HDTV 24 hours Test broadcast (1 kW) 25.03 INC TV INC TV 25.35 EAGLE FM Eagle FM DZET-TV 51 695.143 MHz (Metro Baguio and Northern Central Luzon) 5.01 TV5 Network Inc. TV5 TV5 Network 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Baguio Relay 4:3 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 a.m. (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Mountain Province=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DZVG-DTV 29 563.143 MHz (Cordillera and Cagayan Valley) 5.01 GMA Network Inc. GMA GMA Mountain Province 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 5.02 GTV GTV 5:30 a.m. to midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 5.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 5.06 I HEART MOVIES I Heart Movies 5.11 rowspan=\"1\" rowspan=\"1\" rowspan=\"1\" Test broadcast 5.31 GMA 1Seg GMA Mountain Province Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Region I (Ilocos Region)=== ===Ilocos Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWTE-DTV 18 497.143 MHz (Laoag and Ilocos Norte) 5.01 TV5 Network Inc. TV5 TV5 Network 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports Monday - Saturday 8:00 a.m. - midnight (the next day) / Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies Monday to Sunday: 6 a.m. – midnight 5.35 One Seg S1 TV5 Ilocos Norte Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg D-5-AS-DTV 24 533.143 MHz (Laoag and Ilocos Norte) 5.01 GMA Network, Inc. GMA GMA Ilocos Norte 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 5.02 GTV GTV 5:30 a.m. – midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 5.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight 5.06 I HEART MOVIES I Heart Movies 5.11 Test broadcast 5.21 GMA 1Seg GMA Ilocos Norte Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DWLJ-DTV 40 629.143 MHz (Laoag and Ilocos Norte) Rajah Broadcasting Network 29.21 RJ DigiTV RJ DigiTV Laoag 16:9 480i SDTV 5 a.m. – 2 a.m. (the next day) Fully migrated from analog to digital (Test broadcast 1 kW) 29.22 Timeless TV Timeless TV 24 Hours 29.23 Radyo Bandido TV Radyo Bandido 5 a.m. – midnight 29.24 Rock of Manila TV RJ Rock TV 5 a.m. – 2 a.m. (the next day) 29.25 TV Maria TV Maria 24 Hours D-11-ZV-DTV 42 641.143 MHz 4.01 People's Television Network PTV Ilocos Norte PTV Ilocos Norte 16:9 1080i HDTV Weekdays: 5 a.m. to 1 a.m. Weekends: 6 a.m. to 1 a.m. Commercial broadcast (1 kW) 4.02 PTV SD1 PTV Manila 16:9 480i SDTV 4.03 PTV SD2 Radyo Pilipinas 1 5 a.m. to 8 p.m. 4.04 PTV SD3 PTV Sports Network 8 a.m. to 6 p.m. 4.05 PTV 1SEG PTV 4:3 240p LDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – 1 a.m. (the next day) 1seg ===Ilocos Sur=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWBC-DTV 15 479.143 MHz (Metro Vigan and Northern Luzon) 48.01 GMA Network, Inc. GMA GMA Ilocos Sur 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (5 kW) 48.02 GTV GTV 5:30 a.m. – midnight (the next day) 48.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 48.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 48.05 I HEART MOVIES I Heart Movies 48.11 Test broadcast 48.31 GMA 1SEG GMA Ilocos Sur relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DWDI-DTV 18 497.143 MHz (Metro Vigan and Ilocos Sur) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Vigan 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Vigan Relay 4:3 144p LDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 am (the next day) Sunday: 5:00 a.m. – 1:30 a.m. (the next day) 1seg DWTP-DTV 45 659.143 MHz (Candon and Northern Luzon) 45.01 Tirad Pass Network CTV C.A.R LGU 16:9 480i SDTV 5 a.m. – midnight Test broadcast / Configuration testing (2.5 kW) 45.02 DZTP DZTP 16:9 720p HDTV 45.03 TPN TPN 16:9 480i SDTV 45.04 ELYU TV La Union LGU 45.05 CAB TV CAB TV ===Region II (Cagayan Valley)=== ===Batanes=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Cagayan=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWZE-DTV 18 497.143 MHz (Tuguegarao and Cagayan) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Tuguegarao 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Tuguegarao Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:30 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DWRJ-DTV 29 563.143 MHz (Tuguegarao and Cagayan) 29.21 Rajah Broadcasting Network RJ DigiTV RJ DigiTV Tuguegarao 16:9 480i SDTV 5 a.m. – 2 a.m. (the next day) Fully migrated from analog to digital (Test broadcast 1 kW) 29.22 Timeless TV Timeless TV 24 Hours 29.23 Radyo Bandido TV Radyo Bandido 5 a.m. – midnight 29.24 Rock of Manila TV RJ Rock TV 5 a.m. – 2 a.m. (the next day) 29.25 TV Maria TV Maria 24 Hours DWBB-DTV 33 587.143 MHz (Tuguegarao and Cagayan) 7.01 GMA Network, Inc. GMA GMA Tuguegarao 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (5 kW) 7.02 GTV GTV 5:30 a.m. to midnight (the next day) 7.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. to midnight Weekends: 5:30 a.m. to midnight (the next day) 7.04 HEART OF ASIA Heart of Asia 6 a.m. to midnight (the next day) 7.06 I HEART MOVIES I Heart Movies 7.11 Test broadcast 7.21 GMA 1SEG GMA Tuguegarao relay 4:3 240p LDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) 1seg ===Isabela=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWLE-DTV 15 479.143 MHz (Santiago, Isabela and Cagayan Valley) 7.01 GMA Network GMA GMA Isabela 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (5 kW) 7.02 GTV GTV Monday to Sunday: 5:30 a.m. – midnight (the next day) 7.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. to midnight Weekends: 5:30 a.m. to midnight 7.04 HEART OF ASIA Heart of Asia 6 a.m. to midnight (the next day) 7.06 I HEART MOVIES I Heart Movies 7.11 Test broadcast 7.31 GMA 1seg GMA Isabela Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DWDH-DTV 18 497.143 MHz (Santiago, Isabela and Cagayan Valley) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Isabela 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies''' One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Isabela Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Region III (Central Luzon)=== ===Pampanga=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWAP-DTV 34 593.143 MHz (Pampanga and Central Luzon) 34.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation ALL TV HD All TV 16:9 1080i HDTV Monday to Sunday: 7 a.m. – midnight Test broadcast (5 kW) DWRW-DTV 36 605.143 MHz (Pampanga and Central Luzon) 36.01 RadioWorld Broadcasting Corporation CLTV 36 Central Luzon Television 16:9 720p HDTV Monday to Sunday: 7 a.m. - 10:30 p.m. Fully migrated from analog to digital (2.5 kW) DWFU-DTV 44 653.143 MHz (Pampanga) 44.01 Infomax Television and Global Satellite Technology Services GNN DWFU-DTV 4:3 480i SDTV 5:00 a.m. to midnight Fully migrated from analog to digital Test Broadcast/Configuration Testing (500 watts) 44.02 GNN Central Luzon 44.03 Golf TV Golf Channel 44.04 Global Satellite Technology Services and Gateway UHF Broadcasting Hope Channel Phils Hope Channel Philippines ===Tarlac=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DZJA-DTV 18 497.143 MHz (Tarlac City and Central Luzon) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Network 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Tarlac Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DWAL-DTV 34 593.143 MHz (Tarlac City and Central Luzon) 2.01 Advanced Media Broadcasting System All TV HD All TV Tarlac Relay 16:9 1080p HDTV Monday to Sunday: 7 a.m. - midnight Test broadcast (5 kW) ===Zambales=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"5\" 18 497.143 MHz (Olongapo City, Bataan and Zambales) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Olongapo 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Olongapo Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DWNS-DTV 38 617.143 MHz (Olongapo City, Bataan and Zambales) 10.01 GMA Network Inc. GMA GMA Olongapo 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (5 kW) 10.02 GTV GTV 5:30 a.m. - midnight (the next day) 10.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 10.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 10.06 I HEART MOVIES I Heart Movies 10.11 Test broadcast 10.31 GMA 1Seg GMA Olongapo Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Region IV-A (Calabarzon)=== ===Batangas=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes D-12-ZB-DTV 32 581.143 MHz (Batangas and Calabarzon) 12.01 GMA Network Inc. GMA GMA Batangas 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 12.02 GTV GTV 5:30 a.m. - midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 12.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 12.06 I HEART MOVIES I Heart Movies 12.11 Test broadcast 12.31 GMA 1-Seg GMA Batangas Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DWAG-DTV 36 605.143 MHz (Batangas and CALABARZON) 36.01 Sphere Entertainment, Inc. and Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Monday to Sunday 4:00 a.m. – 10:30 p.m. Fully migrated from Analog to Digital (Commercial broadcast 5 kW TPO/25 kW ERP) 31.02 BLAST SPORTS Blast Sports 6 a.m. to midnight 16:9 480i SDTV 31.03 KNOWLEDGE CHANNEL Knowledge Channel 6 a.m. to 11 p.m. 4:3 480i SDTV 31.04 BEAM CINEMA Beam Cinema 6 a.m. to midnight 31.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. to midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DWAV-DTV 46 665.143 MHz (Batangas and Calabarzon) 2.01 Advanced Media Broadcasting System All TV HD All TV 16:9 1080p HDTV Monday to Sunday: 7 a.m. - midnight (the next day) Test broadcast / Configuration Testing (10 kW TPO/30 kW ERP) DWBD-DTV 51 695.143 MHz (Batangas and Calabarzon) 5.01 TV5 Network, inc. TV5 TV5 Batangas 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Batangas Relay 4:3 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Quezon Province=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"5\" 18 497.143 MHz (Lucena City and Quezon) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Lucena 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One PH 6 a.m – midnight (the next day) 5.35 One Seg S1 TV5 Lucena Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) / Saturday 5:00 a.m. - 1:30 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg rowspan=\"3\" 51 695.143 MHz (Lucena City and Quezon) 25.01 Eagle Broadcasting Corporation NET 25 Net 25 16:9 1080i HDTV 24 hours Test broadcast (1 kW) Interference with DWBD-TV TV5 Batangas DTT on UHF 51. 25.02 INC TV INC TV 25.03 Eagle FM Eagle FM ===Rizal=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Region IV-B (Mimaropa)=== ===Occidental Mindoro=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes D-13-ZR-DTV 15 479.143 MHz (Occidental Mindoro) 13.01 GMA Network GMA GMA Occidental Mindoro 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (5 kW) 13.02 GTV GTV 5:30 a.m. – midnight (the next day) 13.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 13.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight 13.06 I HEART MOVIES I Heart Movies 13.11 Test broadcast 13.31 GMA 1seg GMA Occidental Mindoro Relay 4:3 240p LDTV Weekdays: 5:30 a.m – 1 a.m. Weekends: 5 a.m. to 1 a.m. 1seg rowspan=\"5\" 18 497.143 MHz (San Jose, and Occidental Mindoro) 5.01 TV5 Network Inc. and Mediascape Inc. TV5 TV5 Network 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 San Jose Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Palawan=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYPU-DTV 15 479.143 MHz (Puerto Princesa and Palawan) 12.01 GMA Network GMA GMA Palawan 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (10 kW) 12.02 GTV GTV 5:30 a.m. – midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 12.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight 12.06 I HEART MOVIES I Heart Movies 12.11 Test broadcast 12.31 GMA 1seg GMA Palawan Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DWDD-DTV 18 497.143 MHz (Puerto Princesa and Palawan) 5.01 Nation Broadcasting Corporation and TV5 Network Inc. TV5 TV5 Puerto Princesa 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Puerto Princesa Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) / Saturday 6:00 a.m. - 1:45 am (the next day) / Sunday 5:30 a.m. - 1:30 a.m. (the next day) 1seg DWDW-DTV 38 617.143 MHz (Puerto Princesa and Palawan) 38.01 Bandera News Philippines (Fairwaves Broadcasting Network) Bandera News TV Bandera News TV 16:9 480i SDTV Daily 4:30 a.m. – midnight (the next day) Test broadcast (500 watts) ===Romblon=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"4\" 18 497.143 MHz (Tablas, Romblon) 5.01 TV5 Network Inc. and Cignal TV TV5 TV5 Romblon 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 Cignal TV and Radio Philippines Network RPTV RPTV 6 a.m. - midnight (the next day) 5.03 TV5 Network Inc. and Cignal TV One Sports One Sports Monday - Saturday 8:00 a.m. - midnight (the next day) / Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.35 One Seg S1 TV5 Romblon Relay 16:9 240p LDTV Monday, Tuesday, Friday 5:00 a.m. - 1:30 a.m. / Wednesday, Thursday 5:00 a.m. - 12:30 a.m. / Saturday 6:00 a.m. - 1:30 am (the next day) / Sunday 5:30 a.m. - 1:00 a.m. (the next day) 1seg ===Region V (Bicol Region)=== ===Albay=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWLB-TV 18 497.143 MHz (Legazpi City and Albay) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Legazpi 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Legazpi Relay 4:3 144p LDTV Monday – Friday: 5:00 a.m. - 1:30 a.m. (the next day) / Saturday: 5:00 a.m. - 1:45 am (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg DZPN-DTV 39 623.143 MHz (Legazpi City and Albay) 4.01 People's Television Network PTV Legazpi 16:9 1080i HDTV Weekdays: 5 a.m. – 1 a.m. (the next day) – Weekends: 6 a.m. – 1 a.m. (the next day) Commercial broadcast (1 kW) 4.02 PTV SD1 PTV Manila 16:9 480i SDTV 4.03 PTV SD2 Radyo Pilipinas 5 a.m. – 8 p.m. 4.04 PTV SD3 PTV Sports 8 a.m. – 6 p.m. 4.05 PTV 1SEG PTV 4:3 240p LDTV Weekdays: 5 a.m. – 1 a.m. (the next day) / Weekends: 6 a.m. – 1 a.m. (the next day) 1seg DWLA-DTV 41 635.143 MHz (Legazpi City and Albay) 12.01 GMA Network Inc. GMA GMA Legazpi 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 12.02 GTV GTV 5:30 a.m. – midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 12.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 12.06 I HEART MOVIES I Heart Movies 12.12 Test broadcast 12.35 GMA1SEG GMA Legazpi Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Camarines Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Camarines Sur=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWHC-DTV 32 571.143 MHz (Metro Naga and Camarines Sur) 32.01 Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Monday to Sunday: 4 a.m. – midnight Fully migrated from analog to digital Commercial broadcast (5 kW TPO/25kW ERP) 32.02 BLAST SPORTS Blast Sports 4:3 480i SDTV 6 a.m. - midnight 32.03 Knowledge Channel Knowledge Channel 4:3 480i SDTV 6 a.m. – 11 p.m. 32.04 BEAM BOX OFFICE Beam Cinema 6 a.m. to midnight 32.05 BILYONARYO NEWS CHANNEL RESERVED Daily: 5:30 a.m. - midnight 32.06 LIFE TV Life TV 16:9 480i SDTV 32.07 D8TV D8TV 32.08 RESERVED RESERVED 4:3 480i SDTV DWAI-TV 38 617.143 MHz (Metro Naga and Camarines Sur) 7.01 GMA Network Inc. GMA GMA Naga 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 7.02 GTV GTV 5:30 a.m. – midnight (the next day) 7.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends 5:30 a.m. – midnight (the next day) 7.04 HEART OF ASIA Heart of Asia 6:00 a.m. to midnight (the next day) 7.06 I HEART MOVIES I Heart Movies 7.11 Test broadcast 7.35 GMA1SEG GMA Naga Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DWMA-TV 46 665.143 MHz (Metro Naga) 8.01 People's Television Network PTV HD1 PTV Bicol 16:9 1080i HDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – 1 a.m. (the next day) Test broadcast (1.5 kW) 8.02 PTV SD1 PTV Manila 16:9 480i SDTV 8.03 PTV SD2 Radyo Pilipinas TV 5 a.m. – 8 p.m. 8.04 PTV SD3 PTV Sports 8 a.m. – 6 p.m. 8.05 PTV 1seg PTV 4:3 240p LDTV Weekdays: 5 a.m. – 1 a.m. (the next day) Weekends: 6 a.m. – 1 a.m. (the next day) 1seg rowspan=\"3\" 47 671.143 MHz (Metro Naga) 25.01 Eagle Broadcasting Corporation NET 25 Net 25 16:9 1080i HDTV 24 hours Test broadcast (1 kW) 25.02 INCTV INCTV 16:9 720p HDTV 25.03 EAGLE FM Eagle FM DWFA-DTV 48 677.143 MHz (Metro Naga) 48.01 Global Satellite Technology Services GNN Golden Nation Network Local Programs 4:3 480i SDTV 6 a.m. - midnight Test broadcast (1 kW) 48.02 DepEd TV - Telearalan DepEd TV Local Programs 48.03 LGU Naga rowspan=\"1\" rowspan=\"1\" 48.04 TV Maria TV Maria 24 hours Test Broadcast 48.05 Reserved Channel GNN Naga TV48 Golden Nation Network rowspan=\"1\" rowspan=\"1\" rowspan=\"6\" 50 689.143 MHz (Nabua, Camarines Sur) 19.01 PSUB and PCMC PSUBTv PSUB TV 4:3 480i SDTV 9 a.m. - 8 p.m. Test broadcast (1 kW) 19.02 PSUB COHS The TLC Channel 19.03 PSUB COBM College of Business Management 19.04 PSUB COEAS BigCAS Channel rowspan=\"3\" 19.05 PSUB Graduate School The Grad-Ed Channel 19.06 PSUB COE College of Engineering DWNA-DTV 51 695.143 MHz (Metro Naga and Camarines Sur) 5.01 Nation Broadcasting Corporation and TV5 Network Inc. TV5 TV5 Naga 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Naga Relay 4:3 240p LDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) / Saturday: 5:00 a.m. - 1:45 am (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Catanduanes=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"5\" 18 497.143 MHz (Virac, Catanduanes) 5.01 Mediascape Inc. and TV5 Network, Inc. TV5 TV5 Virac 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Virac Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DWAU-DTV 28 557.143 MHz (Virac and Catanduanes) 2.01 Advance Media Broadcasting System (operated under local blocktime agreement with ABS-CBN Corporation ALLTV HD ALLTV 16:9 1080i HDTV Monday to Sunday 7:00 a.m. – midnight Test broadcast (5 kW) D-13-ZC-DTV 38 617.143 MHz (Virac and Catanduanes) 13.01 GMA Network, Inc. GMA GMA Catanduanes 16:9 480i SDTV Weekdays: 5:30 a.m. to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) Commercial broadcast (10 kW) 13.02 GTV GTV Monday to Sunday: 5:30 a.m. to midnight (the next day) 13.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. to midnight Weekends: 5:30 a.m. to midnight (the next day) 13.04 HEART OF ASIA Heart of Asia] 6 a.m. to midnight (the next day) 13.06 I HEART MOVIES I Heart Movies '13.11 Test broadcast 13.21 GMA 1SEG GMA Catanduanes relay 4:3 240p LDTV Weekdays: 5:30 a.m to 1 a.m. Weekends: 5 a.m. to 1 a.m. (the next day) 1seg ===Masbate=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"4\" 18 497.143 MHz (Masbate and Bicol Region) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Masbate 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 Cignal TV and Radio Philippines Network RPTV RPTV 6 a.m. - midnight (the next day) 5.03 Mediascape Inc. and TV5 Network Inc. One Sports One Sports Monday - Saturday 8:00 a.m. - midnight (the next day) / Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.35 One Seg S1 TV5 Masbate Relay 16:9 240p LDTV Monday, Tuesday, Friday 5:00 a.m. - 1:00 a.m. / Wednesday, Thursday 5:00 a.m. - 12:30 a.m. / Saturday 6:00 a.m. - 1:30 am (the next day) / Sunday 5:30 a.m. - 1:00 a.m. (the next day) 1seg ===Sorsogon=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DWSS-TV 51 695.143 MHz (Sorsogon and Bicol Region) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Sorsogon 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 6:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:30 a.m. - 1:30 a.m. (the next day) Fully Mirgrated from analog to digital on Commercial broadcast (10 kW) 5.02 Cignal TV and Radio Philippines Network RPTV RPTV 6 a.m. - midnight (the next day) 5.03 Mediascape Inc. and TV5 Network Inc. One Sports One Sports Monday - Saturday 8:00 a.m. - midnight (the next day) / Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.35 One Seg S1 TV5 Sorsogon Relay 16:9 240p LDTV Monday, Tuesday, Friday 5:00 a.m. - 1:00 a.m. / Wednesday, Thursday 5:00 a.m. - 12:30 a.m. / Saturday 6:00 a.m. - 1:30 am (the next day) / Sunday 5:30 a.m. - 1:00 a.m. (the next day) 1seg ==Visayas== ===Region VI (Western Visayas)=== ===Aklan=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYCJ-DTV 18 497.143 MHz (Kalibo, Aklan and Western Visayas) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Kalibo 16:9 480i SDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) Test broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6:00 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies Monday to Sunday: 6 a.m. to midnight (the next day) 5.35 One Seg S1 TV5 Kalibo Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:00 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Capiz=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYAM-DTV 15 479.143 MHz (Roxas, Capiz and Western Visayas) 7.01 GMA Network, Inc. GMA GMA Roxas 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 5.02 GTV GTV 5:30 a.m. – midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 5.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight 5.06 I HEART MOVIES I Heart Movies 5.11 Test broadcast 5.21 GMA 1Seg GMA Roxas Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DYMD-DTV 18 497.143 MHz (Roxas, Capiz) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Roxas 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Test broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Roxas Relay 16:9 144p LDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Iloilo=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"1\" 16 485.143 MHz (Metro Iloilo and Western Visayas) 16.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) ALL TV HD All TV 16:9 1080p HDTV Monday to Sunday: 8:00 a.m. – midnight Test broadcast (10 kW) DYJB-TV 17 491.143 MHz (Metro Iloilo and Western Visayas) 13.02 Intercontinental Broadcasting Corporation IBC IBC 13 16:9 480i SDTV Weekdays: 5:00 a.m. - 11 p.m. Weekends: 7 a.m. - 10 p.m. Test broadcast (3 kW) DYMB-DTV 18 497.143 MHz (Metro Iloilo and Western Visayas) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Iloilo 16:9 480i SDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 5.03 One Sports One Sports 6:00 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies 6:00 a.m. – midnight (the next day) 5.31 One Seg S1 TV5 Iloilo Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:00 a.m. / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DYZA-DTV 20 509.143 MHz (Metro Iloilo and Western Visayas) 20.01 ZOE Broadcasting Network (operated under blocktime agreement by ABS-CBN Corporation) A2Z A2Z Iloilo 4:3 480i SDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) Commercial broadcast (5.5 kW) 20.02 Light TV Light TV Monday - Sunday: 7 a.m. - 9 p.m. 20.22 A2Z 1Seg A2Z Iloilo Relay 4:3 240p LDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) 1Seg DYDY-TV 23 527.143 MHz (Metro Iloilo and Western Visayas) 4.01 People's Television Network PTV Iloilo PTV Iloilo 16:9 1080i SDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – 1 a.m. (the next day) Test broadcast (1.5 kW) 4.02 PTV SD1 PTV Manila 16:9 480i SDTV 4.03 PTV SD2 Radyo Pilipinas 1 5 a.m. – 8 p.m. 4.04 PTV SD3 PTV Sports 8 a.m. – 6 p.m. 4.05 PTV 1seg PTV 4:3 240p LDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – 1 a.m. (the next day) 1seg DYRM-DTV 26 545.143 MHz (Metro Iloilo and Western Visayas) 26.01 Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Monday to Sunday: 4 a.m. - midnight Fully migrated from analog to digital on Commercial broadcast (5 kW) 26.02 BLAST SPORTS Blast Sports 6 a.m – midnight (the next day) 26.03 Knowledge Channel Knowledge Channel 4:3 480i SDTV 6 a.m. - 11 p.m. 26.04 BEAM CINEMA Beam Cinema 6 a.m. – midnight 26.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. - midnight 26.06 LIFE TV Life TV 16:9 480i SDTV 26.07 D8TV D8TV 26.08 RESERVED Reserved 4:3 480i SDTV DYXX-TV 29 563.143 MHz (Metro Iloilo and Western Visayas) 6.01 GMA Network Inc. GMA GMA Iloilo 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 6.02 GTV GTV 5:30 a.m. – midnight (the next day) 6.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 6.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 6.06 I HEART MOVIES I Heart Movies 6.11 Test broadcast 6.31 GMA 1SEG GMA Iloilo Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DYOK-TV 43 647.143 MHz (Metro Iloilo) 0.21 Manila Broadcasting Company DZRH NEWS TV DZRH News Television 16:9 480p SDTV 24 Hours Test broadcast (1.5 kW) 0.31 DZRH NEWS TV 1seg 4:3 240p LDTV 1seg ===Negros Occidental=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYGM-DTV 15 479.143 MHz (Murcia Negros Occidental and Western Visayas) 13.01 GMA Network Inc. GMA GMA Murcia 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 13.02 GTV GTV 5:30 a.m. – midnight (the next day) 13.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 13.04 HEART OF ASIA Heart of Asia 6:00 a.m. – midnight (the next day) 13.06 I HEART MOVIES I Heart Movies 13.11 Test broadcast 13.31 GMA1SEG GMA Murcia Relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg DYAG-DTV 16 485.143 MHz (Metro Bacolod and Negros Occidental) 2.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) All TV HD All TV Bacolod 16:9 1080p HDTV Monday to Sunday - 7 a.m. - midnight Test broadcast / Configuration Testing (10kW) DYTE-DTV 18 497.143 MHz (Metro Bacolod and Negros Occidental) 5.01 TV5 Network Inc. TV5 TV5 Bacolod 16:9 480i SDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports Monday - Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.05 One Seg S1 TV5 Bacolod Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DYKB-DTV 19 503.143 MHz (Metro Bacolod and Negros Occidental) 19.01 Radio Philippines Network RPN RPN Bacolod 16:9 480i SDTV 5 a.m. – 1:30 a.m. (the next day) Test broadcast (5 kW TPO/10 kW) 19.02 Radio Philippines Network, Nine Media Corporation and Cignal TV RPTV RPTV 16:9 1080i HDTV 6 a.m. – midnight 19.06 Radio Philippines Network RPN 1seg RPN Bacolod relay 16:9 240p LDTV 5 a.m. – 1:30 a.m. (the next day) 1seg DYEC-DTV 22 521.143 MHz (Metro Bacolod and Negros Occidental) 22.01 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z Bacolod 16:9 480i SDTV Weekdays: 4 a.m – 12:45 a.m. (the next day) Saturday: 5 a.m. – 12:45 a.m. Sunday: 5 a.m. – 12:30 a.m. (the next day) Commercial broadcast (5.5 kW) 22.02 Light TV Light TV Monday to Sunday: 7 a.m. – 9 p.m. 22.22 A2Z 1seg A2Z Bacolod relay Weekdays: 4 a.m. – 12:45 a.m. (the next day) Saturday: 6 a.m. – 12:45 a.m. Sunday: 6 a.m. – 12:30 a.m. (the next day) 1seg DYEZ-TV 39 623.143 MHz (Metro Bacolod) 39.01 Manila Broadcasting Company DZRH TV DZRH News Television 16:9 480p SDTV 24 Hours Test broadcast (1.5 kW) 39.31 DZRH TV 1seg 4:3 240p LDTV 1seg DWGM-TV 44 653.143 MHz (Metro Bacolod and Negros Occidental) 13.01 GMA Network Inc. GMA GMA Bacolod 4:3 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 13.02 GTV GTV 5:30 a.m. - midnight (the next day) 13.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 13.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 13.06 I HEART MOVIES I Heart Movies 13.11 Test broadcast 13.31 GMA1SEG GMA Bacolod Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg rowspan=\"5\" 51 695.143 MHz (Murcia, Negros Occidental and Western Visayas) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Murcia 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Test broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Murcia Relay 16:9 144p LDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg ===Region VII (Central Visayas)=== ===Bohol=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Cebu=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYAE-DTV 16 485.143 MHz (Metro Cebu and Central Visayas) 2.01 Advanced Media Broadcasting System (operating under blocktime agreement with ABS-CBN Corporation) All TV HD ALL TV Cebu 16:9 1080p HDTV Monday to Sunday: 7 a.m. - midnight Test broadcast / Configuration Testing (10 kW TPO/30 kW ERP) DYTV-TV 17 491.143 MHz (Metro Cebu and Central Visayas) 13.02 Intercontinental Broadcasting Corporation IBC IBC 13 16:9 480i SDTV Weekdays: 5:00 a.m. - 11 p.m. Weekends: 7 a.m. - 10 p.m. Test broadcast (3 kW) DYET-TV 18 497.143 MHz (Metro Cebu and Central Visayas) 5.01 TV5 Network Inc. TV5 TV5 Cebu 16:9 480i SDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports Monday – Sunday 6:00 a.m. - 1:00 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Cebu Relay 16:9 240p LDTV Monday – Friday 5:00 a.m. - 1:00 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DYNZ-DTV 20 509.143 MHz (Metro Cebu and Central Visayas) 20.01 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z Cebu 4:3 480i SDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) Commercial broadcast (5.5 kW) 20.02 Light TV Light TV Monday - Sunday: 7 a.m. - 9 p.m. 20.22 A2Z 1Seg A2Z Cebu Relay 4:3 240p LDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) 1Seg DYGA-DTV 25 539.143 MHz (Metro Cebu and Central Visayas) 25.01 Gateway UHF Television Broadcasting and Global Satellite Technology Services Hope Cebu Hope Channel Philippines 16:9 480p SDTV 6 a.m. – midnight Fully migrated from analog to digital / Test broadcast (1.5 kW) 25.02 Hope Philippines 25.03 Hope International 25.04 AWR DYSS-TV 26 545.143 MHz (Metro Cebu and Central Visayas) 7.01 GMA Network Inc. GMA GMA Cebu 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 7.02 GTV GTV 5:30 a.m. - midnight (the next day) 7.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight 7.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 7.06 I HEART MOVIES I Heart Movies 7.11 Test broadcast 7.31 GMA 1SEG GMA Cebu Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DYCT-TV 31 575.143 MHz (Metro Cebu and Central Visayas) 31.01 Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Monday to Sunday: 4 a.m. - midnight Fully migrated from analog to digital on Commercial broadcast (5 kW) 31.02 BLAST SPORTS Blast Sports 6 a.m. – midnight 31.03 KNOWLEDGE CHANNEL Knowledge Channel 4:3 480i SDTV 6 a.m. – 11 p.m. 31.04 BEAM CINEMA Beam Cinema 6 a.m. – midnight 31.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. – midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DYWF-DTV 36 605.143 MHz (Metro Cebu) 36.01 Brigada Mass Media Corporation BRIGADA TV-HD Brigada TV Cebu 16:9 1080i HDTV 4 a.m. – 12:30 a.m. Test broadcast (500 watts) 36.02 BRIGADA TV-SD 90.7 Brigada News FM Cebu 16:9 480i SDTV DYPT-TV 42 641.143 MHz (Metro Cebu) 04.01 People's Television Network PTV HD1 PTV Cebu 16:9 1080i HDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – midnight (the next day) Test broadcast (5 kW) 04.02 PTV SD1 PTV Manila 16:9 480i SDTV 04.03 PTV SD2 Radyo Pilipinas 1 5 a.m. – 8 p.m. 04.04 PTV SD3 PTV Sports 8 a.m. – 6 p.m. 04.05 PTV 1seg PTV 4:3 240p LDTV Weekdays: 5 a.m. – 1 a.m. Weekends: 6 a.m. – 1 a.m. (the next day) 1seg DYBU-DTV 43 647.143 MHz (Metro Cebu) 43.01 Manila Broadcasting Company DZRH TV DZRH News Television 16:9 480p SDTV 24 hours Test broadcast (1.5 kW) 43.31 DZRH TV 1seg 4:3 240p LDTV 1seg DYFX-DTV 49 683.143 MHz (Metro Cebu) 25.01 Eagle Broadcasting Corporation NET 25 Net 25 16:9 1080i HDTV 24 hours Fully migrated from analog to digital (Still under test broadcast) (1 kW) 25.02 INC TV INC TV 25.03 Eagle FM Eagle FM ===Negros Oriental=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"5\" 18 497.143 MHz (Dumaguete and Negros Oriental) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Dumaguete 16:9 480i SDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Test broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Dumaguete Relay 16:9 144p LDTV Monday - Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday: 5:00 a.m. - 1:45 a.m. (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) 1seg D-5-YB-DTV 22 521.143 MHz (Metro Dumaguete and Negros Oriental) 5.01 GMA Network GMA GMA Dumaguete 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (5 kW) 5.02 GTV GTV 5:30 a.m. – midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 5.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight 5.06 I HEART MOVIES I Heart Movies 5.11 Test broadcast 5.31 GMA1SEG GMA Dumaguete relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Region VIII (Eastern Visayas)=== ===Eastern Samar=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Leyte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DYDS-DTV 17 491.143 MHz (Tacloban City and Eastern Visayas) 13.01 Intercontinental Broadcasting Corporation IBC 13 IBC Leyte 16:9 1080i HDTV Weekdays: 5:30 a.m. – 11 p.m Weekends: 7 a.m. to 10 p.m. Test broadcast (1 kW TPO/10 kW ERP) 13.02 CONGRESS TV Congress TV 9 a.m. – 9 p.m. 13.03 DWAN HD DWAN 1206 TV 5 a.m. – midnight rowspan=\"5\" 21 515.143 MHz (Tacloban City and Eastern Visayas) 5.01 TV5 Network, Inc. and Mediascape, Inc. TV5 TV5 Tacloban 16:9 480i SDTV Monday – Friday: 5:00 a.m. – 1:00 a.m. (the next day) Saturday: 5:00 a.m. – 1:45 a.m. Sunday: 5:00 a.m. – 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 6 a.m. – 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Tacloban relay 4:3 144p LDTV Monday to Friday 5:00 a.m. – 1:00 a.m. (the next day) Saturday 5:00 a.m. – 1:45 a.m. Sunday 5:00 a.m. – 1:30 a.m. (, the next day) DYCL-DTV 34 593.143 MHz (Tacloban City and Eastern Visayas) 10.01 GMA Network Inc. GMA GMA Tacloban City 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 10.02 GTV GTV 5:30 a.m. - midnight (the next day) 10.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 10.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 10.06 I HEART MOVIES I Heart Movies 10.11 Test broadcast 10.31 GMA 1Seg GMA Tacloban City Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DYPR-TV 50 689.143 MHz (Tacloban City) 27.01 Philippine Collective Media Corporation PRTV TACLOBAN PRTV TACLOBAN 16:9 1080i HDTV Monday - Sunday: 6 a.m. - midnight Test broadcast/Configuration testing (2 kW) 27.02 TV5 TV5 Tacloban 16:9 480i SDTV Monday, Friday: 5:00 a.m. - 1:00 a.m. (the next day) / Tuesday, Wednesday, Thursday: 5:00 a.m. - 12:30 a.m. (the next day) / Saturday: 6:30 a.m. - 1:30 am (the next day) / Sunday: 5:30 a.m. - 1:00 a.m. (the next day) 27.03 A2Z A2Z Tacloban (ZOE TV) 16:9 720p HDTV Weekdays: 5 a.m. - 12:15 a.m. (the next day) Saturdays: 6 a.m. - 11:45 p.m. Sundays: 6 a.m. - 11:30 p.m. ===Western Samar=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ==Mindanao== ===Region IX (Zamboanga Peninsula)=== ===Zamboanga del Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes D-4-XT-DTV 46 665.143 MHz (Dipolog and Zamboanga del Norte) 4.01 GMA Network GMA GMA Dipolog 4:3 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 4.02 GTV GTV 5:30 a.m – midnight (the next day) 4.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – 1 a.m. (the next day) 4.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight (the next day) 4.06 I HEART MOVIES I Heart Movies 4.11 Test broadcast 4.31 GMA 1SEG GMA Dipolog relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Zamboanga del Sur=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Zamboanga Sibugay=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Zamboanga City=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXMZ-DTV 18 497.143 MHz (Zamboanga City and Zamboanga Peninsula) 5.01 Mediascape Inc. and TV5 Network Inc. TV5 TV5 Zamboanga 16:9 480i SDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) Test broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Zamboanga Relay 16:9 240p LDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:30 a.m. - 1:30 a.m. (the next day) 1seg DXBE-DTV 31 575.143 MHz (Zamboanga City and Zamboanga Peninsula) 31.01 Broadcast Enterprises and Affiliated Media PRTV PRIME PRTV Prime 16:9 480i SDTV Weekdays: 4 a.m. - midnight (the next day) Fully migrated from analog to digital on Commercial broadcast (5 kW) 31.02 BLAST SPORTS Blast Sports 6 a.m. to midnight 31.03 KNOWLEDGE CHANNEL Knowledge Channel 4:3 480i SDTV 6 a.m. to 11 p.m. 31.04 BLAST MOVIES Blast Movies 6 a.m. – midnight 31.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. – midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DXAX-DTV 40 629.143 MHz (Zamboanga City) 0.01 Westwind Broadcasting Corporation & eMedia Production Network eMedia Digital TV eMedia 4:3 480i SDTV 4:45 a.m. – 9:30 p.m. Fully migrated from analog to digital (1 kW) 0.02 ALLTV ALL TV Zamboanga Manila feed Manila feed DXLA-DTV 41 635.143 MHz (Zamboanga City and Zamboanga Peninsula) 9.01 GMA Network Inc. GMA GMA Zamboanga 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (10 kW) 9.02 GTV GTV 5:30 a.m. - midnight (the next day) 9.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – 1 a.m. Weekends: 5:30 a.m. – 1 a.m. (the next day) 9.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 9.06 I HEART MOVIES I Heart Movies 9.11 Test broadcast 9.31 GMA 1Seg GMA Zamboanga Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DXZJ-DTV 45 659.143 MHz (Zamboanga City and Zamboanga Peninsula) 29.21 Rajah Broadcasting Network RJ DigiTV RJ DigiTV Zamboanga 16:9 480i SDTV 5 a.m. – 2 a.m. (the next day) Fully migrated from analog to digital (Test broadcast 1 kW) 29.22 Timeless TV Timeless TV 24 Hours 29.23 Radyo Bandido TV Radyo Bandido 5 a.m. – midnight (the next day) 29.24 Rock of Manila TV RJ Rock TV 5 a.m. – 2 a.m. (the next day) 29.25 TV Maria TV Maria 24 Hours DXGB-DTV 51 695.143 MHz (Zamboanga City and Zamboanga Peninsula) 51.01 Golden Broadcasting Professionals Inc. GBPI HD Golden Broadcasting Professionals Inc./DXGB-TV 16:9 720p SDTV 5:00 a.m. – 11:30 p.m. Test Broadcast (5 kW) 51.02 TV5 TV5 Manila feed Test Broadcast (Mirror feed from DTT-18) 51.03 One PH One PH 51.04 One Sports One Sports 51.05 One Movies One Movies 51.31 GBPI TV11one seg Golden Broadcasting Professionals Inc./DXGB-TV 4:3 240p LDTV 5:00 a.m. – 11:30 p.m. 1seg ===Region X (Northern Mindanao)=== ===Bukidnon=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXWK-DTV 44 653.143 MHz (Bukidnon and Northern Mindanao) 12.01 GMA Network Inc. GMA GMA Bukidnon 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 12.02 GTV GTV 5:30 a.m. - midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – 1 a.m. Weekends: 5:30 a.m. – 1 a.m. (the next day) 12.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 12.06 I HEART MOVIES I Heart Movies 12.11 Test broadcast 12.31 GMA 1Seg GMA Bukidnon Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg ===Lanao del Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes rowspan=\"5\" 18 497.143 MHz (Iligan City and Lanao del Norte) 5.01 TV5 Network, Inc. TV5 TV5 Iligan 16:9 480i SDTV Monday to Friday: 5:00 a.m. – 1:00 a.m. (the next day) Saturday: 5:00 a.m. – 1:45 a.m. (the next day) Sunday: 5:00 a.m. – 1:30 a.m. (the next day) Commercial broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5:00 a.m. – 1:00 a.m. (the next day) 5.04 One Movies One Movies 6:00 a.m. to midnight (the next day) 5.31 One Seg S1 TV5 Iligan Relay 16:9 144p LDTV Monday to Friday: 5:00 a.m. – 1:30 a.m. (the next day) Saturday: 5:00 a.m. – 1:45 a.m. (the next day) Sunday: 5:00 a.m. – 1:30 a.m. (the next day) 1seg DXRV-DTV 33 587.143 MHz (Iligan City and Lanao del Norte) 11.01 GMA Network Inc. GMA GMA Iligan 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (5 kW) 11.02 GTV GTV 5:30 a.m. - midnight (the next day) 11.03 GMA NEWS CHANNEL GMA News Channel Weekdays 5 a.m. – 1 a.m. Weekends 5:30 a.m. – 1 a.m. (the next day) 11.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 11.06 I HEART MOVIES I Heart Movies 11.11 Test broadcast 11.31 GMA 1Seg GMA Iligan Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg ===Misamis Occidental=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXGM-DTV 15 479.143 MHz (Ozamiz and Misamis Occidental) 5.01 GMA Network, Inc. GMA GMA Ozamiz 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (5 kW) 5.02 GTV GTV 5:30 a.m. – midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 5.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight (the next day) 5.06 I HEART MOVIES I Heart Movies 5.11 Test broadcast 5.31 GMA 1SEG GMA Ozamiz relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Misamis Oriental=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXAL-DTV 16 485.143 MHz (Cagayan de Oro, Misamis Oriental and Northern Mindanao) 2.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) All TV HD All TV Cagayan de Oro 16:9 1080p HDTV Monday to Sunday: 7 a.m. - midnight Test broadcast / Configuration Testing (10kW) DXTE-DTV 18 497.143 MHz (Cagayan de Oro, Misamis Oriental and Northern Mindanao) 5.01 TV5 Network Inc. TV5 TV5 Cagayan de Oro 16:9 480i SDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Cagayan de Oro Relay 16:9 240p LDTV Monday to Friday: 5:00 a.m. - 1:30 a.m. (the next day) / Saturday 5:00 a.m. - 1:45 am (the next day) / Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DXEV-DTV 20 509.143 MHz (Cagayan De Oro, Misamis Oriental and Northern Mindanao) 20.01 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z Cagayan De Oro 4:3 480i SDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) Commercial broadcast (5.5 kW) 20.02 Light TV Light TV Monday - Sunday: 7 a.m. - 9 p.m. 20.22 A2Z 1Seg A2Z Cagayan De Oro Relay 4:3 240p LDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 a.m. Sundays: 6 a.m. - 12:30 a.m. (the next day) 1Seg DXRJ-DTV 31 575.143 MHz (Cagayan de Oro, Misamis Oriental and Northern Mindanao) 29.01 Rajah Broadcasting Network RJTV RJTV 16:9 480i SDTV 5 a.m. to 2 a.m. (the next day) Fully migrated from Analog to Digital (Test broadcast 5 kW) 29.02 Timeless TV Timeless TV 5 a.m. to midnight 29.03 Radyo Bandido TV Radyo Bandido 29.04 Rock of Manila TV Rock MNL 5 a.m. to 2 a.m. (the next day) 29.05 TV Maria TV Maria 24 Hours DXVM-DTV 33 587.143 MHz (Cagayan de Oro, Misamis Oriental and Northern Mindanao) 31.01 Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV 4 a.m. – midnight (the next day) Commercial broadcast (5 kW) 31.02 BLAST SPORTS Blast Sports 6 a.m. – midnight 31.03 KNOWLEDGE CHANNEL Knowledge Channel 4:3 480i SDTV 6 a.m. – 11 p.m. 31.04 BLAST MOVIES Blast Movies 6 a.m. – midnight (the next day) 31.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. – midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DXJC-DTV 47 671.143 MHz (Cagayan de Oro, Misamis Oriental and Northern Mindanao) 12.01 GMA Network Inc. GMA GMA Cagayan de Oro 16:9 480i SDTV Weekdays: 5:30 a.m - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 12.02 GTV GTV 5:30 a.m. - midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays 5 a.m. – 1 a.m. Weekends 5:30 a.m. – 1 a.m. (the next day) 12.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 12.06 I HEART MOVIES I Heart Movies 12.11 Test broadcast 12.31 GMA 1Seg GMA Cagayan de Oro Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DXJG-DTV 51 695.143 MHz (Cagayan de Oro and Misamis Oriental) 51.01 Westwind Broadcasting Corporation JAO DIGITAL TV Jao TV 4:3 480i SDTV Monday - Sunday 6 a.m. - midnight Test broadcast/Configuration Testing (Poor signal transmission) 51.02 NOA TV Acosta Reality Channel 51.03 DTV3 CH51 Videoke Test Feed ===Region XI (Davao Region)=== ===Davao Region=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXAK-DTV 16 485.143 MHz (Metro Davao and Davao Region) 2.01 Advanced Media Broadcasting System (operated under blocktime agreement with ABS-CBN Corporation) ALLTV HD ALLTV 16:9 480i HDTV Monday to Sunday: 7 a.m. to midnight Test broadcast (10 kW) DXET-DTV 18 497.143 MHz (Metro Davao and Davao Region) 5.01 TV5 Network Inc. TV5 TV5 Davao 16:9 480i SDTV Monday – Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 OnePH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 Davao Relay 16:9 240p LDTV Monday – Friday: 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:30 am (the next day) Sunday 5:00 a.m. - 1:00 a.m. (the next day) 1seg DXEX-DTV 20 509.143 MHz (Metro Davao and Davao Region) 20.01 ZOE Broadcasting Network (operated under blocktime agreement with ABS-CBN Corporation) A2Z A2Z Davao 4:3 480i SDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 5 a.m. - 12:45 p.m. Sundays: 5 a.m. - 12:30 a.m. (the next day) Commercial broadcast (5.5 kW) 20.02 Light TV Light TV Monday - Sunday: 7 a.m. - 9 p.m. 20.22 A2Z 1Seg A2Z Davao Relay 4:3 240p LDTV Weekdays: 4 a.m. - 12:45 a.m. (the next day) Saturdays: 6 a.m. - 12:45 a.m. Sundays: 6 a.m. - 12:30 a.m. (the next day) 1Seg DXRJ-DTV 28 557.143 MHz (Metro Davao and Davao Region) 29.21 Rajah Broadcasting Network RJ DigiTV RJ DigiTV Davao 16:9 480i SDTV 5 a.m. – 2 a.m. (the next day) Fully migrated from analog to digital (Test broadcast; 1 kW) 29.22 Timeless TV Timeless TV 24 Hours 29.23 Radyo Bandido TV Radyo Bandido 5 a.m. – midnight (the next day) 29.24 Rock of Manila TV RJ Rock TV 5 a.m. – midnight (the next day) 29.25 TV Maria TV Maria 24 Hours DXKC-DTV 31 575.143 MHz (Metro Davao and Davao Region) 31.01 Broadcast Enterprises and Affiliated Media PRTV PRIME PRTV 16:9 480i SDTV 4 a.m. – midnight (the next day) Fully migrated from analog to digital on Commercial broadcast (5 kW) 31.02 BLAST SPORTS Blast Sports 6 a.m. – midnight 31.03 Knowledge Channel Knowledge Channel 4:3 480i SDTV 6 a.m. - 11 p.m. 31.04 BLAST MOVIES Blast Movies 6 a.m. to midnight (the next day) 31.05 BILYONARYO NEWS CHANNEL TV Shop Philippines 5 a.m. – midnight 31.06 LIFE TV Life TV 16:9 480i SDTV 31.07 D8TV D8TV 31.08 RESERVED Reserved 4:3 480i SDTV DXMJ-DTV 37 611.143 MHz (Metro Davao and Davao Region) 5.01 GMA Network Inc. GMA GMA Davao 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (15 kW) 5.02 GTV GTV 5:30 a.m. - midnight (the next day) 5.03 GMA NEWS CHANNEL GMA News Channel Weekdays 5 a.m. – 1 a.m. Weekends 5:30 a.m. – 1 a.m. (the next day) 5.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 5.06 I HEART MOVIES I Heart Movies 5.11 Test broadcast 5.31 GMA 1Seg GMA Davao Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DXSQ-DTV 38 617.143 MHz (Digos City) 38.01 Sagay Broadcasting Corporation Kakampi TV Kakampi TV 4:3 480i SDTV 24 hours Test broadcast (500 watts Low power signal) DXNP-DTV 45 659.143 MHz (Metro Davao) 11.01 People's Television Network PTV SD1 PTV Davao 16:9 1080i HDTV Weekdays: 5 a.m. to 1 a.m. Weekends: 6 a.m. to 1 a.m. (the next day) Test broadcast (5 kW) 11.02 PTV SD1 PTV Manila 4:3 480i SDTV 11.03 PTV SD2 Radyo Pilipinas 1 5 a.m. to 8 p.m. 11.04 PTV SD3 PTV Sports Network 8 a.m. to 6 p.m. 11.05 PTV 1seg PTV 4:3 240p LDTV Weekdays: 5 a.m. to 1 a.m. Weekends: 6 a.m. to 1 a.m. (the next day) 1seg DXED-DTV 49 683.143 MHz (Metro Davao) 25.01 Eagle Broadcasting Corporation NET 25 Net 25 16:9 1080i HDTV 24 hours Test broadcast (1 kW) 25.02 INCTV INCTV 16:9 720p HDTV 25.03 EAGLE FM Eagle FM ===Region XII (Soccsksargen)=== ===Cotabato=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===South Cotabato=== Callsign UHF Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXER-DTV 18 497.143 MHz (General Santos City and Soccsksargen) 5.01 TV5 Network Inc. TV5 TV5 General Santos 16:9 480i SDTV Monday to Friday: 5:00 a.m. - 1:00 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday: 5:00 a.m. - 1:30 a.m. (the next day) Commercial broadcast (10 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. - 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.35 One Seg S1 TV5 General Santos Relay 16:9 240p LDTV Monday to Friday 5:00 a.m. - 1:30 a.m. (the next day) Saturday 5:00 a.m. - 1:45 am (the next day) Sunday 5:00 a.m. - 1:30 a.m. (the next day) 1seg DXBG-DTV 34 593.143 MHz (General Santos City and Soccsksargen) 8.01 GMA Network Inc. GMA GMA General Santos 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 8.02 GTV GTV 5:30 a.m. - midnight (the next day) 8.03 GMA NEWS CHANNEL GMA News Channel Weekdays 5 a.m. – 1 a.m. Weekends 5:30 a.m. – 1 a.m. (the next day) 8.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 8.06 I HEART MOVIES I Heart Movies 8.11 Test broadcast 8.31 GMA 1Seg GMA General Santos Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) 1seg DXYM-DTV 37 611.143 MHz (General Santos City) 37.01 Brigada Mass Media Corporation and Baycomms Broadcasting Corporation Brigada News TV Brigada TV 16:9 1080i HDTV 4:30 a.m. - midnight Test broadcast (500 watts) 37.31 Brigada News TV 1seg 4:3 240p LDTV 1seg DXAH- DTV 51 695.143 MHz (General Santos City and Soccsksargen) 51.01 Sphere Entertainment, Inc. and Broadcast Enterprises and Affiliated Media PRTV PRIME Prime TV 16:9 480i SDTV Weekdays: 4 a.m. – midnight (the next day) Fully migrated from Analog to Digital Commercial broadcast (5 kW) 51.02 BLAST SPORTS Blast Sports 6 a.m. – midnight (the next day) 51.03 KNOWLEDGE CHANNEL Knowledge Channel 4:3 480i SDTV 6 a.m. – 11 p.m. 51.04 BLAST MOVIES Blast Movies 6 a.m. – midnight (the next day) 51.05 BILYONARYO NEWS CHANNEL Bilyonaryo News Channel 5 a.m. – midnight 51.06 LIFE TV Life TV 16:9 480i SDTV 51.07 D8TV D8TV 51.08 RESERVED Reserved 4:3 480i SDTV ===Region XIII (Caraga Region)=== ===Agusan del Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXSB-DTV 15 479.143 MHz (Butuan City and Caraga) 26.01 GMA Network Inc. GMA GMA Butuan 16:9 480i SDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. - 1 a.m. (the next day) Commercial broadcast (10 kW) 26.02 GTV GTV 5:30 a.m. - midnight (the next day) 26.03 GMA NEWS CHANNEL GMA News Channel Weekdays 5 a.m. – 1 a.m. Weekends 5 a.m. – 1 a.m. (the next day) 26.04 HEART OF ASIA Heart of Asia 6:00 a.m. - midnight (the next day) 26.06 I HEART MOVIES I Heart Movies 26.11 Test broadcast 26.31 GMA 1Seg GMA Butuan Relay 4:3 240p LDTV Weekdays: 5:30 a.m. - 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg rowspan=\"5\" 18 497.143 MHz (Butuan City and Caraga) 5.01 TV5 Network, Inc. TV5 TV5 Butuan 16:9 480i SDTV Monday to Friday: 5:00 a.m. – 1:30 a.m. (the next day) Saturday: 5:00 a.m. – 1:45 a.m. (the next day) Sunday: 5:00 a.m. – 1:30 a.m. (the next day) Commercial broadcast (5 kW) 5.02 One PH One PH 24 Hours 5.03 One Sports One Sports 5 a.m. – 1 a.m. (the next day) 5.04 One Movies One Movies 6 a.m. – midnight (the next day) 5.31 One Seg S1 TV5 Butuan Relay 16:9 144p LDTV Monday to Friday: 5:00 a.m. – 1:30 a.m. (the next day) Saturday: 5:00 a.m. – 1:45 a.m. (the next day) Sunday: 5:00 a.m. – 1:30 a.m. (the next day) 1seg DXNS-DTV 27 551.143 MHz (Butuan City and Caraga) 7.01 Northern Mindanao Broadcasting System Bee TV Bee TV 16:9 480i SDTV Monday to Sunday: 7 a.m. – 11 p.m. (the next day) Test broadcast (500 watts) ===Agusan del Sur=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Surigao del Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===Surigao del Sur=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes ===BARMM (Bangsamoro Autonomous Region in Muslim Mindanao)=== ===Maguindanao del Norte=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes DXMC-DTV 42 641.143 MHz (Cotabato City, Maguindanao del Norte and Maguindanao del Sur) 12.01 GMA Network, Inc. GMA GMA Cotabato 16:9 480i SDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) Commercial broadcast (5 kW) 12.02 GTV GTV 5:30 a.m. – midnight (the next day) 12.03 GMA NEWS CHANNEL GMA News Channel Weekdays: 5 a.m. – midnight Weekends: 5:30 a.m. – midnight (the next day) 12.04 HEART OF ASIA Heart of Asia 6 a.m. – midnight (the next day) 12.06 I HEART MOVIES I Heart Movies 12.11 Test broadcast 12.31 GMA 1SEG GMA Cotabato relay 4:3 240p LDTV Weekdays: 5:30 a.m. – 1 a.m. Weekends: 5 a.m. – 1 a.m. (the next day) 1seg ===Sulu=== Callsign UHF Channel Frequency LCN Broadcaster Short Name Programming Picture Format Broadcasting Hours Notes == References == Category:Philippine television-related lists",
 "title": "List of digital television stations in the Philippines"
}