{
 "id": "802699",
 "text": "These are the TV and radio stations wholly owned and operated by the Intercontinental Broadcasting Corporation in the Philippines. ==IBC Stations Nationwide== ===Analog Broadcast Stations=== Branding Callsign Ch. # Power kW Station Type Location (Transmitter site) IBC Manila DZTV-TV 13 50 kW (500 kW ERP) Originating 125 St. Peter Street, Nuestra Senora de la Paz Subdivision, Brgy. Sta. Cruz, Antipolo City, Rizal Province under Metro Manila IBC Laoag DWCS-TV 13 5 kW Relay Pias Norte, Currimao, Ilocos Norte (Ilocos Region) IBC Baguio DZHB-TV 6 1 kW (2.5 kW ERP) Relay Mount Santo Tomas, Tuba, Benguet (Northern Luzon) IBC Iloilo DYJB-TV 12 5 kW (10 kW ERP) Relay Brgy. Alaguisoc, Jordan, Guimaras (Western Visayas) IBC Cebu DYTV-TV 13 12.5 kW (258 kW ERP) Relay Brgy. Kalunasan, Cebu City (Central Visayas) IBC Palo DYDS-TV 6 1 kW (2.5 kW ERP) Affiliate Brgy. Candahug, Palo, Leyte (Eastern Visayas) IBC Cagayan de Oro DXCC-TV 10 5 kW (285.44 kW ERP) Relay 3rd Floor, Solid Building, Don Apolinario Velez cor. Mabini, Cagayan de Oro (Northern Mindanao) IBC Davao DXTV-TV 13 7 kW Relay Shrine Hills, Matina, Davao City (Southern Mindanao) ===Digital Broadcast Stations=== IBC's upcoming expansion of its digital terrestrial television will be announced soon as possible in other key cities nationwide. Branding Callsign Ch. # Frequency Power (ERP) Location (transmitter site) IBC Manila DZTV-DTV 17 491.143 MHz 1 kW 125 St. Peter Street, Nuestra Senora de la Paz Subdivision, Brgy. Sta. Cruz, Antipolo City, Rizal under Mega Manila IBC Baguio DZHB-DTV Mount Santo Tomas, Tuba, Benguet (Northern Luzon) IBC Iloilo DYJB-DTV Brgy. Alaguisoc, Jordan, Guimaras (Western Visayas) IBC Cebu DYTV-DTV Brgy. Kalunasan, Cebu City (Central Visayas) IBC Palo DYDS-DTV Brgy. Candahug, Palo, Leyte (Eastern Visayas) Channel Video Aspect Short name Programming Note 13.01 1080i 16:9 IBC HD IBC Test Broadcast 13.02 1080i (960x1080i) CongressTV HD Congress TV 13.03 1080i DWAN HD DWAN 1206 ==IBC Radio Stations== ===AM stations=== Branding Callsign Frequency Power (kW) Location DWAN 1206 DWAN 1206 kHz 10 kW Metro Manila ===FM stations=== Branding Callsign Frequency Power (kW) Station Type Location Idol Radio DYMP 88.1 MHz 1 kW Affiliate (Presidential Broadcast Service) Palo, Leyte ==References== ==Related pages== * Intercontinental Broadcasting Corporation Intercontinental Broadcasting Corporation channels and stations",
 "title": "List of Intercontinental Broadcasting Corporation channels and stations"
}