{
 "id": "802618",
 "text": "Zach King is a internet personality, filmmaker, and social media influencer. ==Early Life and Education== Zach King was born on February 4, 1990, in Portland, Oregon. His parents, Rachel and David King, raised him in a Christian household with his two younger sisters. From a young age, King was fascinated by magic and the art of illusion. He was also drawn to filmmaking, often using his family's camcorder to make short videos with his friends. King attended Biola University, a private Christian university located in La Mirada, California. There, he studied cinema and media arts, and continued to develop his skills as a filmmaker and content creator. He graduated with a Bachelor of Arts degree in 2012. ==Career== After graduating from college, Zach King moved to Los Angeles to pursue a career in the entertainment industry. He began creating and posting videos on Vine, a now-defunct social media platform that allowed users to create and share short, looping videos. As his popularity on Vine grew, King expanded his presence to other social media platforms, including YouTube, Instagram, and TikTok. In addition to his work as a content creator, Zach King has also written and directed short films and commercials for brands such as Coca-Cola, Nike, and McDonald's. He has won several awards for his work, including the Streamy Award for Best Vine Creativity in 2014 and the Shorty Award for Best Vine Artist in 2015. ==Social media== Zach King has a strong following on multiple social media platforms, including YouTube, Instagram, and TikTok. As of 2021, he has over 28 million subscribers on YouTube, 24 million followers on TikTok, and 24 million followers on Instagram. King's YouTube channel features a variety of content, including magic tricks, visual effects tutorials, and behind-the-scenes looks at his creative process. He also collaborates with other creators on the platform and has created content for YouTube's annual \"Rewind\" series. ==Personal life== Zach King is married to Rachel Holm King, whom he met while attending Biola University. The couple has two children together, a son and a daughter. ==References== ==Other websites== * * * Category:1990 births Category:Living people Category:American TikTokers Category:American YouTubers Category:Actors from Portland, Oregon Category:Writers from Portland, Oregon",
 "title": "Zach King"
}