{
 "id": "802733",
 "text": "A katsa is a field officer of the Mossad, the national intelligence agency of Israel. A katsa collects information and runs agents. ==Operation== The word katsa is a Hebrew acronym for Ktsin Issuf, meaning \"Collections Officer.\" There are typically 30–40 katsas at a time, operating around the world. ==Training== In searching for candidates, the Mossad administers a variety of psychological and aptitude tests, as well as assessing their own current needs. If selected, a candidate must go through and pass the Mossad training academy, the Midrasha, located near the town of Herzliya. The Mossad academy is the official summer residence of the Israeli Prime Minister. There they are taught the tradecraft of intelligence gathering for approximately three years. The main priority of training is to teach katsas how to find, recruit, and cultivate agents, including how to clandestinely communicate with them. They also learn how to avoid being the subject of foreign counter-intelligence, by avoiding car and foot surveillance, by killing, and by preventing foreign agents from creating 'traps' at meetings. Once training is completed, trainees will spend an apprenticeship period working on varying projects before becoming full-fledged katsas. ==Known and possible katsas== *Eli Cohen: developed close relationships with the political and military hierarchy of Syria during the early 60s and was later executed. *Michael Harari: Led a group of Mossad officers who mistakenly killed an innocent waiter in the Lillehammer affair in 1973. **Mossad officers also involved in Lillehammer affair: **Dan Aerbel **Abraham Gehmer a.k.a. Leslie Orbaum **Zwi Steinberg **Michael Dorf **Marianne Gladnikoff **Sylvia Rafael a.k.a. Patricia Lesley Roxburgh **Angelus Askari a.k.a. Ghost *Yossi Cohen ==Related pages== *Sayanim *Bodel ==References== *Thomas, Gordon. Martin, Dillon. Robert Maxwell, Israel's Superspy: The Life and Murder of a Media Mogul. New York: Carroll & Graf Publishers, 2002. ==Other websites== *Official website of Mossad, used for recruiting personnel *English version Category:Mossad",
 "title": "Katsa (Mossad)"
}