{
 "id": "802710",
 "text": "This is a list of serving senior officers of the Royal Navy. It includes currently serving admirals, vice-admirals, rear-admirals, and commodores. ==Admirals== Name Photo Appointment Former branch Decorations Date of promotion Ref Sir Timothy Peter Fraser Vice-Chief of the Defence Staff Warfare KCB May 2019 Antony David Radakin First Sea Lord and Chief of the Naval Staff Warfare CB June 2019 ==Vice-Admirals== Name Photo Appointment Former branch Decorations Date of promotion Ref Benjamin John Key Chief of Joint Operations Warfare KCB, CBE 10 February 2016 Paul Martin Bennett Chief of Staff, Allied Command Transformation Warfare CB, OBE 16 July 2018 Jeremy Paul Kyd Fleet Commander Warfare CBE 5 March 2019 Nicholas William Hine Second Sea Lord and Deputy Chief of Naval Staff Warfare CB 26 April 2019 Christopher Reginald Summers Gardner Director-General (Ships), Defence Equipment and Support Logistics CBE 9 April 2019 Keith Edward Blount Commander, Allied Maritime Command Fleet Air Arm CB, OBE 20 May 2019 Richard Charles Thompson Director- General (Air), Defence Equipment and Support Air Member for Materiel, Air Force Board Fleet Air Arm CBE 1 September 2020 ==Rear-Admirals== Name Photo Appointment Former branch Decorations Date of promotion Ref John Matthew Leonard Kingwell to retire Warfare CBE 14 October 2013 Keith Andrew Beckett Director of Submarines Support, Submarine Delivery Agency Chief of Strategic Systems Executive, Submarine Delivery Agency Engineering 4 November 2014 Timothy Charles Hodgson Director of Submarine Capability Engineering CB, MBE 1 July 2016 Paul Methven to retire Engineering CB 5 January 2017 Paul Vincent Halton Director of Submarine Readiness, Submarine Delivery Agency Warfare OBE 24 October 2017 Guy A. Robinson Deputy Commander, Naval Striking and Support Forces NATO Warfare OBE 13 November 2017 Matthew Peter Briers Director, Carrier Strike Fleet Air Arm 2 January 2018 James David Morley Director of Capability, Strategic Command Warfare 9 April 2018 Malcolm J. Toy Director of Operations and Assurance, Defence Safety Authority Chief Operating Officer, Defence Safety Authority Director (Technical), Military Aviation Authority Engineering 3 July 2018 Andrew M. Kyte Assistant Chief of the Defence Staff (Logistics Operations) Logistics CB 19 November 2018 Hugh D. Beard Assistant Chief of the Defence Staff (Capability & Force Design) Warfare 26 November 2018 Martin John Connell Assistant Chief of the Naval Staff (Aviation, Amphibious Capability & Carriers) Rear Admiral, Fleet Air Arm Director of Force Generation Fleet Air Arm CBE 20 February 2019 Andrew Paul Burns Assistant Chief of the Naval Staff (Capability) Warfare OBE 25 February 2019 James G. Higham Director of Ship Support, Defence Equipment and Support Engineering OBE 26 February 2019 Paul Marshall Director of Ship Acquisition Engineering CBE 25 February 2019 James Norman Macleod Defence Services Secretary Assistant Chief of the Defence Staff (Personnel Capability) Engineering CB 27 March 2019 Philip John Hally Director of People and Training Naval Secretary Logistics MBE 20 May 2019 Andrew Betton Deputy Commander, NATO Joint Force Command Norfolk Warfare OBE 2 September 2019 Simon Phillip Asquith Commander Maritime Operations Warfare OBE 14 October 2019 Peter James Sparkes UK National Hydrographer Deputy Chief Executive, United Kingdom Hydrographic Office Warfare 28 October 2019 Michael Keith Utley Commander United Kingdom Strike Force Rear Admiral Surface Ships Warfare CB, OBE 16 December 2019 Rhett S. Hatcher Director of Data Acquisition, United Kingdom Hydrographic Office Fleet Air Arm 8 September 2020 ==Commodores== Name Photo Appointment Former branch Decorations Date of promotion Ref Graeme T. Little Assistant Chief of Staff (Engineering Support), Navy Command Engineering 17 July 2012 John R. MacDonald Head of Dreadnought Supply and Support, Submarine Delivery Agency Engineering 22 July 2013 Jonathan M. S. Fry Head of Capability and Cadets, Navy Command Engineering 21 January 2014 Michael P. Robinson Head of In- Service Submarines, Defence Equipment and Support Head of In-Service Submarines, Submarine Delivery Agency Engineering 1 July 2014 Darren N. Bone Executive Co-ordinator, International Military Staff Secretary, NATO Military Committee Warfare 4 January 2015 Inga Kennedy Head of the Royal Navy Medical Service Royal Navy Medical Service 9 February 2015 Steven Dainton Commander, British Forces Gibraltar Warfare 2 June 2015 Richard A. Murrison Naval Assistant to the Naval Secretary Logistics 3 August 2015 Peter Coulson Commander, Her Majesty's Naval Base Devonport Engineering 7 December 2015 Stephen J. Pearson to retire Warfare 15 February 2016 Paul G. J. Dailey Commodore, Submarine Delivery Agency Engineering 1 August 2016 Iain S. Lower Head of Strategic Engagement, Navy Command Warfare 1 August 2016 Thomas E. Manson Head of UK Military Flying Training Systems, Defence Equipment and Support Engineering OBE 8 August 2016 David G. Childs to retire Engineering 11 October 2016 Andrew M. Cree Assistant Chief of Staff (Training) Deputy Director of Future Training Engineering CBE 14 November 2016 Simon P. Huntington Deputy Director of People Delivery, Navy Command Warfare OBE 20 February 2017 Henry Duffy to retire Warfare OBE 30 April 2017 Stuart W. S. Millar Special Project Lead, Ministry of Defence Medical Branch 31 July 2017 Robert J. A. Bellfield to retire Warfare 25 August 2017 Martyn J. Williams Head of Naval Ships Support, Defence Equipment and Support Engineering CBE 5 December 2017 Craig Wood Commander, Coalition Task Force Sentinel Warfare CBE 12 December 2017 Andrew S. Jackson Head of Capability and Programmes, Defence Nuclear Organization Engineering 9 January 2018 David W. Matthews Commodore, Submarine Delivery Agency Engineering 1 April 2018 Robert J. Anstey Acting Flag Officer Scotland and Northern Ireland Warfare OBE 17 April 2018 Richard J. Winter Assistant Chief of Staff (Operations), Defence Digital Engineering 30 April 2018 Raymond A. Lovegrove Strategic Asset Management and Programming Team, Defence Infrastructure Organisation Engineering 30 April 2018 Timothy C. Woods Head of British Defence Staff, Eastern Europe Engineering 1 May 2018 Heber K. Ackland Assistant Commandant (Maritime), Joint Services Command and Staff College Logistics 8 May 2018 James M. B. Parkin Assistant Chief of Staff (Crisis and Deliberate Planning), Permanent Joint Headquarters Warfare CBE 22 May 2018 Robert Wood Commodore, Naval Legal Services Logistics OBE 29 May 2018 Donald J. M. Doull Commander, Her Majesty's Naval Base Clyde Engineering CBE 19 June 2018 James Le S. Perks Commander, Submarine Flotilla Warfare OBE 1 July 2018 Thomas J. Guy Deputy Director, Combined Joint Operations from the Sea Center of Excellence Warfare 1 July 2018 James V.B. Hayes Commodore, Submarine Delivery Agency Engineering 30 July 2018 Eleanor L. Ablett Military Leader for Defence People Transformation, Ministry of Defence Logistics MBE 28 August 2018 Timothy M. Henry Head of Strategic Planning, Supreme Headquarters Allied Powers Europe Warfare OBE 4 September 2018 Stephen M. R. Moorhouse Commander United Kingdom Carrier Strike Group Warfare OBE 11 September 2018 David I. Burns Warfare 26 September 2018 Paul C. R. Carroll Head of Type 31e Frigate Procurement, Defence Equipment and Support Engineering 16 October 2018 Rex J. Cox Head of Financial Military Capability Plans, Ministry of Defence Warfare 6 November 2018 Paul S. Beattie Head of Naval Staff, Ministry of Defence Warfare 12 November 2018 Nicholas B. J. Washer Warfare 3 December 2018 Michael B. Knott Assistant Chief of Staff (Maritime Capability), Navy Command Warfare CBE 15 January 2019 Fleur T. Marshall Head of Healthcare Plans, Defence Healthcare Medical 26 February 2019 Jeremy J. Bailey Commander, Her Majesty's Naval Base Portsmouth Engineering 26 March 2019 Stuart P. Henderson Navy Safety Director Engineering 28 January 2019 Andrew A. Jordan Deputy Director of Ships Warfare 25 February 2019 Stephen D. Roberts Programme Director, Type 26 Frigates, Navy Headquarters Engineering 20 March 2019 Dean A. Bassett Commander, UK Maritime Component Command Bahrain Warfare 14 June 2019 Robert C. Vitali Assistant Chief of Staff (Warfare), Navy Command Warfare 28 May 2019 Edwin L. Tritschler Head of Airworthiness, Defence Equipment and Support Engineering MBE 15 July 2019 Adrian P. Orchard Head of Operating Assurance, Military Aviation Authority Warfare OBE 22 July 2019 Mark E. Prince Director of Nuclear Propulsion, Submarine Delivery Agency Engineering 29 July 2019 Philip D. Nash UK Naval Attaché to the USA Warfare 26 August 2019 Peter N. Olive Chief of Staff, Standing Joint Force Headquarters Warfare 2019 Paul E. Dunn Head of Operations, Defence Nuclear Organisation Warfare OBE 12 August 2019 Nicholas J. Wheeler Deputy Director, Military Support Warfare 21 October 2019 Stuart H. Wright Head of People Strategy, Navy Command Logistics 21 October 2019 Philip G. Game Head of Portfolio Delivery, Defence Equipment and Support Deputy Director of Weapons, Defence Equipment and Support Engineering 4 November 2019 Nicholas J. Hibberd Assistant Chief of Staff (Maritime Warfare), Navy Command Warfare 17 December 2019 Ivan R. Finn Head of Helicopters 1, Defence Equipment and Support Engineering 9 December 2019 Edward G. Ahlgren Deputy Commander of Operations Warfare OBE 20 January 2020 Melanie S. Robinson Commander, Maritime Reserves Warfare 4 February 2020 Andrew M. Stacey Commander Fleet Operational Sea Training Warfare 10 March 2020 Christopher D. Goodsell Head of Warfare Development, Strategic Command Warfare 23 March 2020 Alison J. Hofman Head of Defence Medical Services Regulator Medical 28 May 2020 Anthony K. Rimington Principal Staff Officer to the Chief of the Defence Staff Warfare/Fleet Air Arm 3 June 2020 Charles A. Evans Head of Defence Support Capability, Strategic Command Logistics 11 May 2020 Robert G. Pedre Commander, Littoral Strike Group Warfare 22 May 2020 Niall R. Griffin Commanding Officer, Royal Naval Air Station Yeovilton Fleet Air Arm MBE 8 July 2020 Nicholas M. Walker Deputy Director of Naval Aviation Fleet Air Arm 17 July 2020 Robert A. Lauchlan Commodore, Submarine Delivery Agency Engineering 21 July 2020 Ian S. Groom Defence Maritime Regulator Engineering September 2020 Timothy Neild Commander, Surface Flotilla Warfare September 2020 James R. Dean Logistics Christopher B. Cook Head of Strategy and Planning, Defence Digital Engineering 2 November 2020 Jonathan D. Lett Commander, British Forces South Atlantic Islands Warfare November 2020 ==References== Category:Royal Navy officers",
 "title": "List of serving senior officers of the Royal Navy"
}