{
 "id": "80284",
 "text": "Michael Dale \"Mike\" Huckabee (born August 24, 1955) is an American politician and radio personality who has been the 29th United States Ambassador to Israel since 2025 under the second Donald Trump administration. He was the Governor of Arkansas from 1996 to 2007. He is a Republican. He is also a Southern Baptist minister. He unsuccessfully ran for President of the United States in 2008 and in 2016. ==Early life== Huckabee was born in Hope, Arkansas. His parents were Mae Elder and Dorsey Huckabee. Several of his ancestors were slave owners in Georgia and Arkansas. He studied at Ouachita Baptist University and at Southwestern Baptist Theological Seminary. ==Governor of Arkansas (1996-2007)== In 1996, incumbent Democratic governor Jim Guy Tucker was convicted of fraud. Within a few hours, Tucker reinstated his resignation after Huckabee threatened to initiate impeachment proceedings against Tucker. Huckabee was sworn in as Governor of Arkansas on July 15, 1996. In November 1998, Huckabee was elected to a full four-year term by defeating retired Colonel Gene McVay in the primary and Jonesboro attorney Bill Bristow in the general election, becoming the state's third elected Republican Governor since Reconstruction. In November 2002, Huckabee was reelected to his second four- year term by defeating State Treasurer Jimmie Lou Fisher, garnering 53 percent of the vote. His reelection came despite the defeat in the general election of fellow Republican U.S. Senator Tim Hutchinson. By the end of his term, Huckabee held the third-longest tenure of any Arkansas Governor. Only Democrats Orval Faubus, who served six consecutive two-year terms (1955–1967), and Bill Clinton, who served 11 years, 11 months (1979–1981; 1983–1992), had longer tenures. During his time as a governor Huckabee raised taxes 21 times for a net tax increase of $505 million. ==2008 presidential campaign== Huckabee announced his run for the White House on Meet the Press on January 28, 2007. He lost the Republican primaries to John McCain. ==2016 presidential campaign== On May 5, 2015, Huckabee announced that he would seek the 2016 Republican nomination for President of the United States. It was his second run for the U.S. presidency. Huckabee made the announcement in his hometown, Hope, Arkansas. He suspended his campaign on February 1, 2016. ==U.S. Ambassador to Israel== On November 12, 2024, it was announced that President- elect Donald Trump would be nominating Huckabee as United States Ambassador to Israel. Trump offered the ambassadorship to Huckabee before in 2016, however he declined to accept. On April 9, 2025, his nomination was approved by the United States Senate and he was sworn in later that day. He arrived in Israel on April 17, 2025.https://x.com/USAmbIsrael/status/1912732766606676399?t=Ro6UwPpt1pBEQhjLNA8IGA&s;=19 He presented his credentials to President Isaac Herzog on April 21, 2025.https://il.usembassy.gov/u-s-ambassador-mike-huckabee-presents-his- credentials-to-israeli-president-isaac-herzog/ ==Personal life== After 2008, he began hosting a news talk show on the Fox News television channel. The show, called Huckabee, ran until 2015 when Huckabee retired. He has also written several books, many of which have been best sellers. In his spare time, Huckabee plays guitar in a band. On his television show he has played guitar with a number of famous artists, including Willie Nelson, Def Leppard, and Ted Nugent. Huckabee married Janet Huckabee in 1974. They have four children - John, Mark, David, and Sarah. Sarah was the White House Press Secretary under the Donald Trump administration and is the Governor of Arkansas. ==References== ==Other websites== * Mike Huckabee official website * HuckPAC * Mike Huckabee Grassroots Forum ** C-SPAN Q&A; interview with Huckabee, February 13, 2005 * Campaign contributions at OpenSecrets.org * Profile in The Encyclopedia of Arkansas History & Culture Category:1955 births Category:Living people Category:2008 United States presidential candidates Category:2016 United States presidential candidates Category:American Baptist ministers Category:American Evangelicals Category:Creationists Category:Governors of Arkansas Category:People from Hope, Arkansas Category:Republican Party (United States) politicians Category:Zionists Category:Lieutenant Governors of Arkansas Category:Ambassadors of the United States to Israel",
 "title": "Mike Huckabee"
}