{
 "id": "802846",
 "text": "Bruce Wayne, also known as Batman, is a pivotal character in the DC Extended Universe (DCEU) and based on the DC Comics superhero of the same name. Portrayed by Ben Affleck, this iteration of Bruce Wayne first appeared in Batman v Superman: Dawn of Justice (2016). == Overview == In the DCEU, Bruce Wayne is depicted as a wealthy philanthropist and the owner of Wayne Enterprises. As a child, he witnessed the murder of his parents, Thomas and Martha Wayne, which deeply traumatized him and set him on the path to becoming Batman. His alter ego acts as Gotham City's vigilante, driven by a desire to combat the crime that took his parents' lives. Bruce is characterized by his fierce determination to protect his city, which often leads him to adopt a darker, more brooding demeanor compared to other heroes. His worldview is heavily influenced by his experiences, especially his views on Kryptonians, which lead to significant conflict with Superman. Throughout the DCEU, Bruce Wayne's character wrestles with themes of redemption, loss, and the weight of his responsibilities as both Bruce Wayne and Batman. This version of Batman has also lost his version of Robin, who was murdered by the Joker some time before the events of Batman v Superman, pushing him to kill people at times until feeling bad about it later. This portrayal, while less popular with some fans, allows for a more complex view of his character, exploring both his heroism and his internal struggles. Bruce Wayne's Batman utilizes various advanced technologies, with a highly adaptable bat-suit that enhances his physical abilities. He employs a range of gadgets, including the iconic Batmobile, aircraft, and drones, to assist in his crime-fighting endeavors. The DCEU's version of Bruce Wayne is marked by a gritty realism, reflecting the darker tones of the universe and providing a foundation for his relationships with other heroes and villains in the series, such as Superman, Wonder Woman, The Flash, and Lex Luthor. == Behind the scenes == Ben Affleck, who was cast as Bruce Wayne/Batman, portrayed other superheroes in film before, such as Daredevil in the 2003 Daredevil movie, and he also played the actor George Reeves, who used to play Superman in the 1950s, in the movie Hollywoodland. He was hesitant to play Batman, but after director Zack Snyder told him it was a different, darker take on the character, Affleck signed on. He gained several pounds of muscle for the role and even wore a wig to match Bruce Wayne's hairstyle in the comics. The role was too much for Affleck at times, which was made worse when he did not get along with Justice League replacement director Joss Whedon and had struggles in his personal life. As a result, Affleck quit playing Batman at one point and backed out of a solo Batman movie in the DCEU, which was eventually reworked into The Batman with Robert Pattinson playing another version of Batman in separate story. After some time had passed, and after Zack Snyder returned to finish his version of Justice League, Affleck decided to come back and help Snyder, also returning one last time in The Flash. == Batsuits == This version of Batman is seen wearing many different versions of his Batsuit. His main suit is made from a tough cloth, departing from the armored looks portrayed in the Michael Keaton/Val Kilmer/George Clooney movie series and the Christian Bale movie series. However, he still uses armored versions of his suit sometimes, such as very heavy armor when he fights Superman in Batman v Superman, and a lighter armor as seen in Justice League and Zack Snyder's Justice League. In scenes depicting an alternate \"Knightmare\" timeline, Batman has a western-inspired version of his main suit complete with goggles and a trench coat. == Reception == Despite being a darker, grittier version of Batman, and despite some people not liking his casting at first, Ben Affleck's portrayal was generally well- liked as Affleck \"looked and acted the part\" of how Batman was supposed to look in the comics. Some even nicknamed this version of the character \"Batfleck\". Others called his version the \"best version of Batman\". However, some people didn't like the fact he killed people in Batman v Superman. After the \"Snyder Cut\" was released, some fans wanted Affleck to return and make his solo DCEU Batman movie as originally planned. == Appearances == === Movie appearances === Year Movie Portrayed by 2016 Batman v Superman: Dawn of Justice Ben Affleck Suicide Squad 2017 Justice League 2021 Zack Snyder's Justice League 2023 The Flash ==Sources== Category:DC Extended Universe characters Category:DC Comics movie characters Category:Batman",
 "title": "Bruce Wayne (DC Extended Universe)"
}