{
 "id": "803282",
 "text": "Antinatalism, or anti-natalism, is a philosophical stance and social movement that gives a negative value to starting life. Antinatalists argue that humans (and sometimes other sentient beings) should stop making kids because it is morally bad. People who believe that making kids is morally good are called natalists. The term antinatalism was likely used for the first time by Belgian author Théophile de Giraud in his book L'art de guillotiner les procréateurs: Manifeste anti-nataliste. South African philosopher David Benatar has also published books in support of antinatalism. == Arguments == Negative utilitarianism is the idea that stopping pain is more important than making people happy. This makes it different from utilitarianism. Utilitarianism is the idea that people should do the most useful thing. The most useful thing in utilitarianism is making people happy. People who believe in negative utilitarianism idea say that making happiness is not needed. Since life has bad things, it is not worth starting. Some supporters of this idea argue that the worst pains in life do not make up for the best moments. This makes life not worth starting because it is too risky. There are also significant costs to the environment for every new child. Realism can support antinatalism. This is because supporters of the idea have evidence showing that most people have an optimism bias. This means that they see the world as better than it actually is. Religion can support antinatalism. This is because some religious sects (groups) believe creating life traps souls in a bad world. The Manichaeans, the Bogomils, and the Cathars are some of these groups that believe in the idea. Others include the Marcionites, and the Encratites. ==Related pages== *Abortion *Childfree *Emil Cioran *Misanthropy *Pessimism *Right to die *Ethics *Ecclesiastes (Chapter 4) ==References== Category:Biology Category:Ethics Category:Philosophical movements and positions",
 "title": "Antinatalism"
}