{
 "id": "803246",
 "text": "Animaniacs is an American animated children's television series that aired on January 29, 1993 until December 21, 1999. == Overview == Season Segments Episodes First episode Last episode 1 171 65 January 29, 1993 January 1, 1994 2 12 4 September 9, 1994 November 10, 1994 3 46 13 September 9, 1995 February 24, 1996 4 22 8 September 7, 1996 November 16, 1996 5 23 9 September 8, 1997 November 14, 1998 Wakko's Wish December 21, 1999 == Episodes == === Season 1 (1993-1994) === Prod. No. Title Written by Original airdate 1 \"De-Zanitized\" Paul Rugg January 29, 1993 \"The Monkey Song\" Tom Ruegger \"Nighty-Night Toon\" Nicholas Hollander 2 \"Yakko's World\" Randy Rogel January 30, 1993 \"Cookies For Einstein\" Paul Rugg \"Win Big\" Tom Ruegger, Peter Hastings 3 \"HMS Yakko\" Paul Rugg January 31, 1993 \"Slappy Goes Walnuts\" Sherri Stonner Yakko's Universe Randy Rogel 4 \"Hooked in a Ceiling\" Tom Ruegger, Gordon Bressack, Charles M. Howell IV February 1, 1993 \"Goodfeathers: The Beggining\" Deanna Oliver 5 \"Taming of the Screwy\" Peter Hastings, Earl Kress, Tom Ruegger February 2, 1993 6 \"Temporary Insanity\" Paul Rugg February 3, 1993 \"Operation: Lollipop\" Peter Hastings \"What Are We?\" Randy Rogel 7 \"Piano Rag\" Ncholas Holland February 4, 1993 \"When Rita Met Runt\" Sherri Stoner 8 \"The Big Candy Store\" Sherri Stoner, Paul Rugg February 5, 1993 \"Bumbie's Mom\" Sherri Stoner 9 \"Wally Llama\" Paul Rugg February 6, 1993 \"Where Rodents Dare\" Peter Hastings, Tom Ruegger 10 \"King Yakko\" Peter Hastings February 7, 1993 11 \"No Pain, No Painting\" Peter Hastings February 8, 1993 \"Les Miseranimals\" Deanna Oliver 12 \"Garage Sale of the Century\" Tom Ruegger and Paul Rugg February 9, 1993 \"West Side Pigeons\" Deanna Oliver 13 \"Hello Nice Warners\" Paul Rugg February 10, 1993 \"La Behemoth\" Nicolas Hollander \"Little Old Slappy from Pasadena\" Tom Milton 14 \"La La Law\" Paul Rugg February 11, 1993 \"Cat on a Hot Steel Beam\" Barry Caldwell 15 \"Space Probed\" John P. McCann February 12, 1993 \"Battle for the Planet\" Peter Hastings 16 \"Chalkboard Bungle\" Tom Ruegger and Paul Rugg February 13, 1993 \"Hurray for Slappy\" John P. McCann \"The Great Wakkorotti: The Master and His Music\" Tom Ruegger and Russell Brower 17 \"Roll Over, Beethoven\" Paul Rugg February 14, 1993 \"The Cat and the Fiddle\" Nicolas Hollander 18 \"Pavlov's Mice\" John P. McCann, Tom Ruegger and Sherri Stoner February 15, 1993 \"Chicken Boo-Ryshnikov\" Deanna Oliver \"Nothing But the Tooth\" Deanna Oliver and Paul Rugg 19 \"Meatballs or Consequences\" John P. McCann February 16, 1993 \"A Moving Experience\" Peter Hastings 20 \"Hearts of Twilight\" Deanna Oliver February 17, 1993 \"The Boids\" Deanna Oliver 21 \"The Flame\" Nicholas Hollander and Tom Ruegger February 18, 1993 \"Wakko's America\" Tom Ruegger, Paul Rugg, Gordon Bressack and Charles M. Howell IV \"Davy Omelette\" Randy Rogel and Tom Ruegger \"Four Score and Seven Migraines Ago\" Deanna Oliver 22 \"Guardin' the Garden\" Earl Kress, Tom Ruegger, Nicholas Hollander and Sherri Stoner February 19, 1993 \"Plane Pals\" Tom Ruegger and John P. McCann 23 \"Be Careful What You Eat\" Randy Rogel (lyrics) February 20, 1993 \"Up the Crazy River\" Nicolas Hollander \"Ta da Dump, Ta da Dump, Ta da Dump Dump Dump\" Tom Ruegger and Charles M. Howell IV 24 \"Opportunity Knox\" Tom Minton February 21, 1993 \"Wings Take Heart\" Nicolas Hollander 25 \"Hercule Yakko\" Peter Hastings February 22, 1993 \"Home on De-Nile\" Stephen Hibbert \"A Midsummer Night's Dream\" Deanna Oliver === Season 2 (1994) === Prod. No. Title Written by Original airdate 66 \"Take My Siblings Please\" Paul Rugg September 9, 1994 \"The Mindy 500\" John P. McCann \"Morning Malaise\" Nicolas Hollander 67 \"We're No Pigeons\" Deanna Oliver September 10, 1994 \"Whistle Stop Mindy\" Tom Minton \"Katie Ka-Boom: The Broken Date\" Nicolas Hollander 68 \"Miami Mama-Mia\" Deanna Oliver September 11, 1994 \"Pigeon on the Roof\" Deanna Oliver 69 \"I'm Mad\" Tom Ruegger and Randy Rogel September 12, 1994 \"Bad Mood Bobby\" Deanna Oliver \"Katie Ka-Boom: The Blemish\" Nicolas Hollander \"Fake\" Paul Rugg Animaniacs",
 "title": "List of Animaniacs episodes"
}