{
 "id": "803369",
 "text": "Stuart Little (also known as Stuart Little: The Animated Series) is an American animated television series, based on the Stuart Little book. The series stars David Kaufman as the voice of Stuart, replacing Michael J. Fox. Most of the cast from the films did not reprise their roles, except for Hugh Laurie as Mr. Little. ==Voice cast== * David Kaufman as Stuart Little * Kevin Schon / Quinton Flynn as Snowbell * Myles Jeffrey as George Little * Hugh Laurie as Frederick Little * Jennifer Hale as Eleanor Little / Martha Little * André Sogliuzzo as Monty * Matt Kaminsky as Rick Ruckus * Rachael Harris as Margalo * Pat Fraley as Falcon * Jeffrey Jones as Uncle Crenshaw Little * Marc John Jefferies as Will With the exceptions of Laurie, Jones, and Jefferies, none of the actors from the films reprised their roles. ==References== ==Episodes == # The meatloaf bandit: when meatloaf starts to go missing, Stewart goes on a mystery to find out who took the meatloaf. Turns out, it was only snowball really loved meatloaf. # The plane the mouse drove: Stewart wants to try out George’s brand new toy plane, but George says he can’t. Stewart decides to ride on his own, without realizing that he will get him in trouble. However, he goes on several damages while on the plane and he has to navigate safely or he’ll end up in trouble. # Squirrel: a squirrel keeps stealing and going into the backyard, and Stewart and Snowball recognize it’s a squirrel. They have to get the squirrel away from the backyard, creating many mishaps along the way. # Meet Dug: Dug is a Golden retriever that has been adopted and he has given a talking collar so he wouldn’t have to worry. Snowball hates dogs because one chased him last time, and Stewart is very jealous. Every time when Doug makes a mistake and his owners forgive him, they grow jealous. That is, until Stewart ends up, trapped on a paper airplane, and Doug must save him. # The tracking collar: Dug’s can help him track things, and he can smell too. When everyone underestimate his smell, he goes on a sniffing journey. Stewart and snowball also sniff too, with little help from George. # Cat trouble: snowball is captured by a cat gang who want him to take a birdhouse that a bird family is living in. Snowball has to do the deed by eating the bird family, or else they will never let him go. Stewart must save him, but can he save snowball or in time or witness his best friend be in cat jail? # once upon a Stewart: Stewart falls asleep and has a dream where he is on a majestic adventure, to save a beloved princess from a fire, breathing dragon, facing his own fears along the way. # Balloonatics: Stewart gets to buy his own balloons with George and they have fun playing keep it up. However, the balloons are in danger being popped when they go outside to play, and so they must keep them safe, even from nearby neighbor. # The cat bell: Stewart makes a decision to build the cats so that he can save a family of mice, but that does not turn out to be a very good idea. # Doggy dance: Dug has been making accidents on the floor, and now his owners have given him a potty so he can use it. However, Doug is afraid of the toilet, so Stewart and George are there to help him so they can teach him how to use the bathroom. # Meet Margolo: Marglo comes to visit again and Stuart and her are happy to see each other. However, when a nearby chef opened, he’s determined to use and cook, bird spray his own pleasure, even if it means taking the birds off the planet. Stewart will have to save his new friend from becoming bird food, with a little help from his new friends. # Castle adventure: Stewart tries out a new toy castle, but gets separated on the castle. While he’s in the castle, he goes on the adventure while snowball tries to track down the truck to save his brother. # Uhoh, Quicksand dough!: When Stewart accidentally gets messy when he accidentally stepped in some non-sinking quicksand, he gets the idea to make quicksand, though, so that he can prove that he can help a gloomy cooked knead the dough. However, he has trouble getting the quicksand, especially when you need a little help from friends. Season 2 14\\. Scaredy mouse: After Stuart cow when he sees a gorilla chase after humans in a movie, he is called scaredy mouse when he goes to school. He must face his fears of gorillas, in order to see the new movie gorilla to the rescue. 15\\. A new house for snowball: snowball believes he cannot find a new home because nobody needs him and decides to move away, but he gets into trouble and decides to make a new house into several problems with him getting splinters, being chased by humans, and lack the equipment needed for inside a house, especially being covered in paint that makes them look like a camel. 16\\. Catch that mouse!: Stewart ends up in a hole ball when he hits his head and believes that he is a criminal, and he gets into a chase, acting crazy whenever he goes, leading to a worldwide chase for him. 17\\. Mind over Mallard: Stewart wants to help learn to fly, but with the help from two platypuses, not so much. 18\\. Best friend stick together: Stewart and George end up getting their hands glued together when they use too much glue in order to fix their broken castle top, and now they have to get out of the sticky situation or they would end up being stuck together forever. 19\\. Flowers: on the Fourth of July, everyone is excited to watch the fireworks, and Doug is told that fireworks looks like flowers in the sky. However, he gets scared by the fireworks, causing him to run around nervous and causing chaos. He eventually passes out and has a dream-turned- nightmare, we’re still he wakes up to find out that he got a bump on his head and he put on headphones so that he can enjoy the rest of the show without panicking. 20\\. Scorpy show: a non-poisonous scorpion comes to see Stewart, who needs him help to find his family. Stewart and George must return it to his family, can they prove that not every scorpion is dangerous? 21\\. Mama Stairt: Stewart finds a baby duckling where he must get it back to his mother, who sings he’s his mama, and they get onto many adventures along the way. Category:American animated television series Category:English-language television programs",
 "title": "Stuart Little (TV series)"
}