{
 "id": "803453",
 "text": "Alejandro Nicholas Mayorkas (born November 24, 1959) is a Cuban-American lawyer and politician. Mayorkas was the 7th United States Secretary of Homeland Security from February 2, 2021 until January 20, 2025 during the Joe Biden cabinet. He was the Deputy Secretary of the United States Department of Homeland Security from December 23, 2013 to October 31, 2016. ==Early life== Alejandro Nicholas Mayorkas was born in Havana, Cuba, on November 24, 1959. When he was one year old, his parents fled with him and his sister to the United States in 1960 as refugees, following the Cuban Revolution. He lived in Miami, Florida, before his family moved to Los Angeles, California, where he was raised. Mayorkas graduated from the University of California, Berkeley in 1981 with a Bachelor of Arts degree with distinction. He received his Juris Doctor in 1985 from Loyola Law School, where he was an editor of the Loyola of Los Angeles Entertainment Law Review. ==Secretary of Homeland Security== ===Nomination=== On November 23, 2020, then President-elect Joe Biden announced that his plans to nominate Mayorkas to be the next United States Secretary of Homeland Security. In February 2021, Mayorkas was confirmed by the United States Senate on a 56-43 vote with many Republicans criticizing his nomination. Mayorkas is the first refugee and first person born in Latin America to lead the department. ===Tenure=== Early on in his tenure, arrests increased at the Mexico-United States border. In June 2021, the monthly number of arrested migrants reached a decade high of 188,800. On October 31, 2023, Mayorkas testified before the Senate Homeland Security Committee, saying that more than 600,000 people illegally made their way into the United States without being apprehended by border agents during the 2023 fiscal year. On February 13, 2024, Mayorkas was impeached, with a 214–213 vote, by the United States House of Representatives. This came after an earlier unsuccessful impeachment vote one week before. Mayorkas is only the second cabinet member to be impeached, the first being Secretary of War William Belknap in 1876. ==Personal life== Mayorkas and his wife Tanya have two daughters. ==References== ==Other websites== *Biography at the United States Department of Homeland Security *Biography at the United States Department of Homeland Security (2013–2017, archived) * * Category:1959 births Category:Living people Category:Cuban politicians Category:Lawyers from Los Angeles Category:Naturalized citizens of the United States Category:Politicians from Los Angeles Category:Democratic Party (United States) politicians Category:People from Havana Category:United States Secretaries of Homeland Security",
 "title": "Alejandro Mayorkas"
}