{
 "id": "803696",
 "text": "Singer 2017 is the first season of Chinese television series of the rebranded version of I Am a Singer season 5. Due to the banning of Korean-related brands and artists in China, the series went with a rebranding under a simplified title of Singer, but otherwise retained similar competition format from the past four seasons of I Am a Singer. It is aired on Hunan Television and produced by Hong Tao, and its music director is Hong Kong senior musician Kubert Leung. It will be recorded in the Hunan Broadcasting System Radio and Television Center, Changsha, Hunan on January 10, 2017 and aired from January 21 to April 22, 2017 on Hunan Television. Singer 2017 includes Greater China and other areas famous singers. First-round competitors have Tan Jing and Tia Ray from Mainland China, Hong Kong Canadian singers Sandy Lam and Teresa Carpio, Hins Cheung from Hong Kong, Taiwanese band Lion, Malaysian singer Michael Wong and Dimash from Kazakhstan. Returning singers have Jason Zhang from I Am a Singer Season 2, Terry Lin and Julia Peng from I Am a Singer Season 1 and Li Jian from I Am a Singer Season 3. Challengers have Zhao Lei, Diamond Zhang, Liang Bo from Mainland China and Hong Kong Americans singer Justin Lo. ==Results== First Safe Bottom Eliminated Return Performance Challenger Challenge Success Challenge Failure Breakout Success Breakout Failure Winner Runner-up Withdrew Singer Broadcast Date (2017) Jan 21 Jan 28 Feb 4 Feb 11 Feb 18 Feb 25 Mar 4 Mar 11 Mar 18 Mar 25 Apr 1 Apr 8 Apr 15 Apr 15 1st Round 2nd Round 3rd Round 4th Round 5th Round Breakout Semifinal Final Round Qualifying Knockout Challenge Knockout Challenge Knockout Qualifying Knockout Challenge Knockout Finals Overall 1 Sandy Lam 2 3 6 2 2 3 1 4 5 1 — 1 1 1 2 Dimash Kudaibergen 1 1 3 3 6 1 3 5 2 3 — 2 2 2 3 Lion 4 4 5 1 7 5 4 3 3 5 — 5 3 3 4 Li Jian — — — — — — 2 2 4 4 1 4 4 4 5 Terry Lin — — — — 4 4 5 1 1 7 3 3 5 5 6 Diamond Zhang — — — — — — 7 7 — — 5 6 6 6 7 Tia Ray 7 6 8 — — — — — — — 6 7 8 7 8 Jason Zhang — — 4 5 3 6 6 6 8 2 4 8 7 8 9 Teresa Carpio 3 5 7 4 — — — — — — 2 — — — 10 Julia Peng — — — — — — — — 7 6 6 — — — 11 Liang Bo — — — — — — — — 6 — 8 — — — 12 Michael Wong 6 7 — — — — — — — — 9 — — — 13 Justin Lo — — — — 4 7 — — — — 10 — — — 14 Zhao Lei — — 2 7 8 — — — — — — — — — 15 Tan Jing 5 2 1 6 1 2 4 — — — — — — — 16 Hins Cheung 7 — — — — — — — — — — — — — ==Details of competitions== ===1st round=== ====Qualifying==== *Taping Date: January 10, 2017 *Airdate: January 21, 2017 The order of performance for this episode was determined through audience voting for their anticipated songs; singers may discuss their re-arrangement of performance order, which was reflected in the table. As there were eight first-round singers, the first round featured elimination for the singer who receive the fewest votes. Tia Ray would have been eliminated for finishing last; however, Ray was later declared safe following Hins Cheung's sudden withdrawal; Cheung was later revealed to have participated in the political Umbrella Movement in Hong Kong after the episode was taped. Cheung's appearance (with the exclusion of a shot with him and Teresa Carpio) and performance were unaired and edited out of broadcast. Singer 2017 1st Qualifying Round January 21, 2017 Order Singer Music Partner Song Title Original Singer Lyrics Composer Arranger Ranking Singer Voting 1 Dimash Aray Aydarhan \"A Soul's Plea for Help\" Daniel Balavoine Luc Plamondon Michel Berger Kubert Leung 1 1 2 Tia Ray Aaron Sun \"That Girl, Ah Chu\" Frankie Liang Meng Ye Frankie Liang Zhao Zhao 7 3 (tie) 3 Michael Wong Young Yang \"First Time\" Michael Wong Zhang Tiancheng Michael Wong Kubert Leung 6 — 4 \"\" Hins Cheung 7 — 5 Teresa Carpio Jeffrey G \"Imagine\" John Lennon John Lennon John Lennon John Laudon 3 1 (tie) 6 Lion Shen Mengchen \"Lion\" Lion Lion Jam Hsiao Lee Q Wu 4 — 7 Tan Jing Wayne Zhang \"Goodbye Youth\" Wang Feng Wang Feng Wang Feng Rama Liu 5 — 8 Sandy Lam Shen Ling \"It Doesn't Matter Who I Am\" Sandy Lam Jonathan Lee Jonathan Lee Zheng Nan 2 3 (tie) : A. Hins Cheung withdrew from Singer 2017 prior to the episode's airing. Cheung was ranked 7th, but his performance was excluded from the tally. Footage of his performance was edited out from the episode re-runs and in video-sharing websites as well. ====Knockout==== *Taping Date: January 20, 2017 *Airdate: January 28, 2017 Singer 2017 1st Knockout Round January 28, 2017 Order Singer Music Partner Song Title Original Singer Lyricist Composer Arranger Ranking Singer Voting 1 Michael Wong Young Yang \"Those Days\" Eric Moo Eric Moo Eric Moo Zhao Zhao 7 — 2 Tan Jing Wayne Zhang \"Nine Girl\" Han Hong He Qiling Roc Chen Roc Chen Yian Tianwu 2 3 3 Tia Ray Aaron Sun \"Love on Top\" Beyoncé Beyoncé Beyoncé Terius Nash Shea Taylor Nick Pyo 6 2 4 Dimash Aray Aydarhan \"Opera 2\" Vitas Vitas Vladimir Borovsky Vitas Da Ridan 1 — 5 Teresa Carpio Jeffrey G \"Carmen\" Grace Chang Li Junqing Georges Bizet John Laudon 5 1 6 Lion Shen Mengchen \"You Are My Beloved Girl\" Wang Feng Wang Feng Wang Feng Lee Q Wu 4 — 7 Sandy Lam Shen Ling \"Rouge\" Penny Tai Penny Tai Penny Tai Zheng Nan 3 — : A. The RH Factor's \"Crazy Race\" is added in prelude : B. Joe Hisaishi work \"Castle in the Sky\" is added in interlude and ending ====Overall ranking==== Michael Wong was eliminated in the 1st round. Singer 2017 1st Round Overall Ranking Ranking Singer Match 1 Percentages of votes (ranking) Match 2 Percentages of votes (ranking) Total percentages of votes 1 Dimash 27.00% (1) 24.36% (1) 25.68% 2 Sandy Lam 22.60% (2) 13.43% (3) 18.01% 3 Tan Jing 10.44% (5) 23.88% (2) 17.16% 4 Teresa Carpio 16.05% (3) 10.79% (5) 13.42% 5 Lion 12.74% (4) 12.95% (4) 12.84% 6 Tia Ray 3.74% (7) 9.24% (6) 6.49% 7 Michael Wong 7.41% (6) 5.33% (7) 6.37% — (7) — — : A. Due to Cheung's withdrawal on the episode 1, while the votes cast for Cheung were void, his votes were equally distributed among remaining singers. ===2nd round=== ====Challenge==== *Taping Date: January 21, 2017 *Airdate: February 4, 2017 Jason Zhang as the first returning singer from I Am a Singer Season 2 and Zhao Lei as the first challenger joined the competition. Finally, Zhao Lei got No.2 challenge success and Tia Ray is eliminated. Singer 2017 2nd Challenge Round February 4, 2017 Order Singer Music Partner Song Title Original Singer Lyricist Composer Arranger Ranking Singer Voting 1 Sandy Lam Shen Ling \"Run\" Snow Patrol Snow Patrol Snow Patrol Johnny Yim 6 — 2 Tan Jing Wayne Zhang \"Desirous Water\" Chyi Yu Johnny Chen Johnny Chen Rama Liu 1 1 3 Lion Shen Mengchen \"Hundred Years of Solitude\" Faye Wong Albert Leung C.Y. Kong Adrian Chan Tsou Chiang 5 — 4 Tia Ray Aaron Sun \"Mona Lisa's Tear\" Terry Lin Zheng Huajuan Zheng Huajuan Kubert Leung 8 — 5 Michael Wong Young Yang \"Don't Cry On Other's Shoulder\" Chao Chuan Steve Chow Lo Hung Wu Zhao Zhao Return Performance Return Performance 6 Dimash Aray Aydarhan \"The Show Must Go On\" Queen Queen Queen Erlan Bekchurin 3 — 7 Teresa Carpio Jeffrey G \"Vincent\" Don McLean Don McLean Don McLean John Laudon 7 3 8 Jason Zhang Li Weijia \"Strange That I Love You\" Jason Zhang Qu Shicong Qu Shicong Qu Shicong Jason Zhang 4 — 9 Zhao Lei Mandy Jin \"Cheng Du\" Zhao Lei Zhao Lei Zhao Lei Zhao Lei Xi Zi Kiu Sen 2 2 ====Overall ranking==== Teresa Carpio was eliminated in the 2nd round. Singer 2017 2nd Round Overall Ranking Ranking Singer Match 1 Percentages of votes (ranking) Match 2 Percentages of votes (ranking) Total percentages of votes 1 Tan Jing 24.54% (1) 12.49% (6) 19.00% 2 Dimash 14.82% (3) 15.56% (3) 15.19% 3 Lion 10.90% (5) 18.17% (1) 14.53% 4 Sandy Lam 10.69% (6) 17.50% (2) 14.09% 5 Zhao Lei 16.75% (2) 9.27% (7) 13.01% 6 Jason Zhang 11.40% (4) 13.16% (5) 12.28% 7 Teresa Carpio 9.91% (7) 13.84% (4) 11.87% : A. Seven votes less than 4th : B. Three votes less than 5th : C. Eleven votes less than 6th ===4th round=== ====Qualifying==== *Taping Date: February 23, 2017 *Airdate: March 4, 2017 Li Jian as the third returning singer from I Am a Singer Season 3 and Diamond Zhang as the third challenger joined the competition. Finally, Diamond Zhang got No.8 challenge failure. Due to Tan Jing withdrew from the competition, Diamond Zhang is deemed as a substitute singer to join 4th round of competition and there is no challenge in this round. Singer 2017 4th Qualifying Round March 4, 2017 Order Singer Music Partner Song Title Original Singer Lyricist Composer Arranger Ranking Singer Voting 1 Dimash Aray Aydarhan \"Daididau\" Unknown Unknown Unknown Erlan Bekchurin Bakytbek Zeinelov 3 — 2 Justin Lo Xiao Hu \"Thinking Out Loud\" Ed Sheeran Ed Sheeran Amy Wadge Ed Sheeran Amy Wadge Nick Wong Return Performance Return Performance 3 Terry Lin Belinda Liang \"御龍銘千古\" Terry Lin He Xiaotong Gou Yin Zhang Keke Baby Chung 5 — 4 Lion Shen Mengchen \"I Can't Hear\" Fish Leong Ashin Ashin Kenn C Orion J. 4 2 5 Sandy Lam Shen Ling \"Blue Lotus\" Xu Wei Xu Wei Xu Wei Nick Pyo 1 1 6 \"\" 4 2 7 Jason Zhang Li Weijia \"I Want To Love You, Suddenly\" Valen Hsu Valen Hsu Valen Hsu Nick Pyo 6 — 8 Li Jian Li Rui \"A Foreigner\" Li Jian Li Jian Li Jian Liu Zhuo 2 — 9 Diamond Zhang Oscar Sun \"Time Has Tears\" Jacky Cheung Chan Siu Kei Balonz Su Zheng Nan 7 — ====Knockout==== *Taping Date: March 2, 2017 *Airdate: March 11, 2017 Singer 2017 4th Knockout Round March 11, 2017 Order Singer Music Partner Song Title Original Singer Lyricist Composer Arranger Ranking Singer Voting 1 Jason Zhang Li Weijia \"You Better Not Think About Me\" Hebe Tien Derek Shih Venk Liu Dajiang Nick Pyo 6 — 2 Li Jian Li Rui \"A Father's Poem\" Xu Fei Dong Yufang Xu Fei Liu Zhuo 2 — 3 Diamond Zhang Oscar Sun \"Red Rose\" Eason Chan Francis Lee Kubert Leung Zheng Nan 7 — 4 Sandy Lam Shen Ling \"Worship\" Fish Leong Chen Mo Percy Phang Zheng Nan 4 — 5 Lion Shen Mengchen \"Three Days Two Nights\" Jacky Cheung Hsu Chang Te Jimmy Ye Kenn C Christine Sham 3 1 6 Dimash Aray Aydarhan \"Daybreak\" Han Hong Han Hong Han Hong Erlan Bekchurin 5 — 7 Terry Lin Belinda Liang \"Rolling Up the Beaded Curtain\" Henry Huo Li Shu Luna Henry Huo Baby Chung 1 — 7 Terry Lin Belinda Liang \"Scarborough Fair\" Unknown Unknown Unknown Baby Chung 1 — ====Overall ranking==== Diamond Zhang was eliminated in the 4th round. Singer 2017 4th Round Overall Ranking Ranking Singer Match 1 Percentages of Votes (Ranking) Match 2 Percentages of Votes (Ranking) Total Percentages of Votes 1 Li Jian 18.88% (2) 19.98% (2) 19.43% 2 Terry Lin 13.11% (5) 22.47% (1) 17.79% 3 Sandy Lam 19.83% (1) 13.68% (4) 16.75% 4 Lion 13.90% (4) 16.36% (3) 15.13% 5 Dimash 17.30% (3) 9.79% (5) 13.55% 6 Jason Zhang 8.76% (6) 8.99% (6) 8.87% 7 Diamond Zhang 8.21% (7) 8.72% (7) 8.46% — (4) — — : A. Due to Tan Jing's withdrawal before the night of episode 6 broadcasting, while the votes cast for Tan Jing were void, her votes were equally distributed among remaining singers. ==Sources== ==Other websites== * * * 《歌手2017》Mango TV Official Channel Category:Chinese music Category:2017 in television",
 "title": "Singer 2017"
}