{
 "id": "803678",
 "text": "Daniel John Bongino (born December4, 1974) is an American political commentator, radio host, and former law enforcement officer serving as the 20th deputy director of the Federal Bureau of Investigation since 2025. He hosted The Dan Bongino Show on Rumble and previously hosted Unfiltered with Dan Bongino on Fox News until April 2023. Bongino began his career as a New York City Police Department (NYPD) officer from 1995 to 1999 before serving as a U.S. Secret Service agent from 1999 to 2011. He later unsuccessfully ran for Congress three times. On February 23, 2025, President Donald Trump announced that Bongino had been named the next deputy director of the FBI. On March 17, 2025, he was officially sworn into office. ==Career== He was a New York City Police Department (NYPD) officer and Secret Service agent before entering politics. A political commentator, he hosts The Dan Bongino Show on Rumble and previously hosted Unfiltered with Dan Bongino on Fox News until April 2023. ==Politics== He ran unsuccessfully for Congress as a Republican in 2012, 2014, and 2016. On February 23, 2025, President Donald Trump announced on Truth Social that Bongino had been named as the next deputy director of the Federal Bureau of Investigation (FBI). ==Health== In September 2020, a tumor was found in his neck. The following month, the tumor was removed and he was diagnosed with Hodgkin's lymphoma. In an interview in July 2021, Bongino announced that he had \"beaten\" cancer. ==References== Category:1974 births Category:Living people Category:Writers from Florida Category:Politicians from Florida Category:American police officers Category:American political writers Category:American autobiographers Category:Writers from New York City Category:American radio personalities Category:Politicians from New York City Category:American political commentators Category:Republican Party (United States) politicians Category:Politicians from Maryland Category:Writers from Maryland",
 "title": "Dan Bongino"
}