{
 "id": "803664",
 "text": "RRR (subtitled onscreen as Roudram Ranam Rudhiram) is a 2022 Indian Telugu- language epichistorical action drama film directed by S. S. Rajamouli, who co- wrote the script with V. Vijayendra Prasad. Produced by D. V. V. Danayya under DVV Entertainment, the film stars N. T. Rama Rao Jr. and Ram Charan as fictionalised versions of Indian revolutionaries Komaram Bheem and Alluri Sitarama Raju, respectively. It also features Ajay Devgn, Alia Bhatt, Shriya Saran, Samuthirakani, Ray Stevenson, Alison Doody and Olivia Morris in supporting roles. The film serves as a fictional tribute to the revolutionaries and their fight against oppression. Rajamouli conceptualised the film by reimagining the lives of Sitarama Raju and Bheem, envisioning their meeting in 1920 Delhi as two formidable forces uniting to battle British colonialtyranny. The film was officially announced in March 2018, and principal photography began in November 2018 in Hyderabad. The production faced delays due to the COVID-19 pandemic and concluded in August 2021. RRR was shot extensively across India, with additional sequences filmed in Ukraine and Bulgaria. The film's songs and background score were composed by M. M. Keeravani, with cinematography by K. K. Senthil Kumar and editing by A. Sreekar Prasad. Sabu Cyril served as the production designer, and V. Srinivas Mohan supervised the visual effects. Made on a budget of ₹550 crore, RRR was the most expensive Indian film at the time of its release. The film was released theatrically on 25 March 2022 and became the first Indian film to be released in Dolby Cinema format. It received universal critical acclaim for its direction, screenwriting, cast performances, cinematography, soundtrack, action sequences and VFX. With ₹223 crore worldwide on its first day, RRRrecorded the highest opening-day earned by an Indian film at the time. It emerged as the highest-grossing film in its home market of Andhra Pradeshand Telangana, grossing over ₹406 crore. The film grossed ₹1,253–1,387 crore worldwide, setting several box office records for an Indian film, becoming the fourth highest-grossing Indian film, the third highest-grossing Telugu film and the highest grossing Indian film of 2022 worldwide. RRR was considered one of the ten best films of the year by the National Board of Review, making it only the seventh non-English language film ever to make it to the list. The song \"Naatu Naatu\" won the Oscar for Best Original Song at the 95th Academy Awards, making it the first song from an Indian film, as well as the first from an Asian film, to win in this category. The win made RRR the first and only Indian feature film to win an Academy Award. The film became the third Indian film and first Telugu film to receive nominations at the Golden Globe Awards, including Best Foreign Language Film, and won Best Original Song for \"Naatu Naatu\", making it the first Indian (as well as the first Asian) nominee to win the award. RRRalso won the awards for Best Foreign Language Film and Best Song at the 28th Critics' Choice Awards. At the 69th National Film Awards, the film won six awards, including Best Popular Feature Film, Best Music Direction (Keeravani) and Best Male Playback Singer (Kaala Bhairava for \"Komuram Bheemudo\"). Karthick Krishna M S is the Co Director of RRR. His role involved overseeing various aspects of the film’s production alongside the primary director, S. S. Rajamouli. ==Plot== In 1920, British General Scott and his wife visit Adilabad district, and forcefully take away Malli, a Gond tribal girl to serve as their maidservant in Delhi. To rescue the girl, Komaram Bheem arrives in Delhi with his men. They capture a wild tiger in the forests to aid their mission. Nizam of Hyderabad warns Scott's office about the same. Alluri Sita Rama Raju is a police officer who proves his ability to serve the Empire. When Lady Buxton offers a promotion to the officer who catches the leader of the Gond tribe alive, Ram comes forward. He attends a meeting of the independent activists and proposes to assassinate Scott. As their goals seem to align, Bheem's aid Lachhu asks Ram to meet Bheem. However, Lachhu flees when he senses that Ram is a police. Lachhu tells Bheem about this who asks him to hide. Ram and Bheem accidentally meet and team up to save a boy. Bheem introduces himself as a Muslim named Akhtar while Ram hides his identity of an officer. They become best friends. Bheem comes across Scott's niece Jennifer when they are trying to sneak into the palace. Ram helps Bheem to get close to her. Jennifer invites Bheem to a party which the duo attend. Impressed by his dance, Jennifer invites Bheem to the palace. Bheem silently meets Malli, assuring her rescue. Ram captures Lachhu to ask whereabouts about their leader but in vain. Lachhu gets hold of a common krait and throws it onto Ram which bites him. Lacchu warns Ram that it can kill him within an hour without anti-venom, known only to Gond people. Ram finds his way to Bheem who saves him. Bheem confesses to Ram by telling him about their mission. Bheem and his men barge into the palace with a truck full of wild animals. Bheem unleashes them onto the British soldiers. However, Ram obstructs him as a police officer. Bheem pleads not to arrest him but Ram does not budge. Furious, Bheem fights off Ram, and goes on to climb the palace walls. Ram stops him while General Scott holds Malli at point blank. Bheem surrenders with no option left. Bheem is sentenced to death via a public execution. Scott offers mercy if he kneels but Bheem refuses despite heaving lashing by Ram. He sings a song which motivates the public to rebel. Bheem is taken away by the officers. Ram recalls that his father Venkat Ramaraju had rebelled and sacrificed his life against the British. Venkat takes a promise from Ram that he'd a deliver a weapon to every person who takes part in the rebellion. Venkat's friend Venkateswarulu informs Ram that his promise is going to be fulfilled since he is appointed as in charge of a shipment of arms. Ram, however, puts saving Bheem and the girl as his priority. He requests Scott to execute Bheem in the outskirts as a part of his plan. However, Scott recognizes the ploy, and injures him. Bheem frees himself and fights the guards off. Ram shoots a Britisher over Malli's head to save her. Misunderstanding this as an attack, Bheem beats up Ram and escapes with Malli. Bheem and his men hide in Hathras but the British officers arrive there. Sita recognizes that they are in danger and drives away the officers by lying that the place is infected with small pox. Sita reveals that she is Ram's love interest. She adds that Ram is sentenced to death as he went against the British to save his best friend. Bheem regrets his actions and promises Sita to rescue Ram. Bheem sneaks into the Barracks with the help of blue print given by Jennifer. He frees Ram from the prison, taking him on his shoulder as the latter is unable to walk. Together, they fight the guards and escape. Bheem treats Ram, however, the soldiers attack them in the woods. Ram takes bow and arrows from a shrine of Lord Rama and retaliates. Bheem joins him with a javelin. They fight off the soldiers and head towards the palace. They blast a motorcycle into a room full of TNT, and explode the building. Bheem retrieves guns and ammunition and delivers it to Ram. Lady Scott is killed in the chaos while Scott is killed by Ram and Bheem. They reunite with Sita, Jennifer and others. Upon Ram's insistence, Bheem requests to return the favour by educating him. Ram returns to his village and delivers the weapons as promised while Bheem returns to his hamlet, reuniting Malli with her mother. ==Cast== *N. T. Rama Rao Jr. as Komaram Bheem, a Gond tribal leader from Telangana who fought against the Nizam of Hyderabad for the liberation of Hyderabad State. *Charan as Alluri Sitarama Raju, an independence activist and a tribal leader from Andhra Pradesh. He was involved in the Indian independence movement and fought against the British Raj. *Varun Buddhadev as Young Alluri Sitarama Raju *Ajay Devgn as Venkata Rama Raju, Rama Raju's father *Alia Bhatt as Sita, Rama Raju's cousin and love interest *Spandan Chaturvedi as Young Sita *Shriya Saran as Sarojini, Rama Raju's mother *Samuthirakani as Venkateswarulu *Ray Stevenson as Scott Buxton *Alison Doody as Lady Buxton *Olivia Morris as Jennifer, Bheem's love interest *Chatrapathi Sekhar as Chandu, Bheem's companion *Makarand Deshpande as Bheem's companion *Rajeev Kanakala as Venkat Avadhani, special advisor to the Nizam *Rahul Ramakrishna as Lacchu *Edward Sonnenblick as Edward *Ponganesh as special appearance == Future == Before the film's release, Rajamouli said that he had no intentions of making a sequel for RRR nor turning it into a franchise. However, writer Vijayendra Prasad said that \"they started exploring the idea of sequel and hope to make it happen sometime later.\" Speaking with Variety, Rama Rao expressed his hope that the world of RRR would be continued as a franchise. During a screening event in Chicago, Rajamouli said that his father and screenwriter Vijayendra Prasad is working on the sequel's story. == References == == Other websites == * * Category:Telugu-language movies Category:Period action movies Category:Movies directed by S. S. Rajamouli Category:Epic movies Category:2020s Indian movies Category:2022 action movies Category:2022 drama movies Category:Movies set in India Category:Movies set in the 1920s Category:2022 movies",
 "title": "RRR (movie)"
}