{
 "id": "8037",
 "text": "Paula Julie Abdul (; born June 19, 1962) is an American singer and dancer. She had a string of hit songs and choreographed (planned) many dances for herself and others, including singer-songwriter Janet Jackson. Musically, she is known for her late-1980s number-one singles \"Straight Up\" and \"Cold Hearted\", along with the 1990s number-one hit \"Opposites Attract\". She won a Grammy Award for \"Best Music Video – Short Form\" for \"Opposites Attract\". She was a judge on the television show American Idol for its first eight seasons. She has a mezzo-soprano vocal range. Abdul is Jewish. ==Discography== ;Studio albums * Forever Your Girl (1988) * Spellbound (1991) * Head over Heels (1995) ==Tours and residencies== Headlining *Under My Spell Tour (1991–92) *Straight Up Paula! (2018–19) Co-headlining *Club MTV Live (1989) *Total Package Tour (2017) Residency *Paula Abdul: Forever Your Girl (2019–20) ==Filmography== ===Film=== Year Title Role Notes 1978 Junior High School Sherry 1983 Private School Cheerleader 1986 A Smoky Mountain Christmas Choreographer TV movie 1987 Can't Buy Me Love Dancer 1991 L.A. Story Roller Skater 1997 Touched By Evil Ellen Collier TV movie 1998 The Waiting Game Amy Fuentes TV movie 1999 Mr. Rock 'n' Roll: The Alan Freed Story Denise Walton TV movie 2002 The Master of Disguise Choreographer 2005 Robots Watch (voice) 2005 Romy and Michele: In the Beginning Herself TV movie 2009 Brüno Herself 2018 A Sister's Secret Detective Tupper TV movie 2020 Impractical Jokers: The Movie Herself 2022 Chip 'n Dale: Rescue Rangers Herself ===Television=== Year Title Role Notes 1988 Soul Train Herself Episode: \"New Edition/Paula Abdul\" 1988 Showtime at the Apollo Herself Episode: \"Episode #2.5\" & \"#2.12\" 1989 The Tracey Ullman Show Herself Episode: \"Episode #3.18\" 1990 Going Live! Herself Episode: \"Episode #3.30\" 1995 Fully Booked Herself Episode: \"Episode #1.8\" 1996 Muppets Tonight Herself Episode: \"Paula Abdul\" 1996 Cybill Herself Episode: \"Lowenstein's Lament\" 1996 The Single Guy Herself Episode: \"Affair\" 1998 Saturday Night Live Herself Episode: \"David Duchovny/Puff Daddy/Jimmy Page\" 1998 Spin City Herself Episode: \"It Happened One Night\" 1999 The Wayans Bros. Sasha Episode: \"Dream Girl\" 1999 All That Herself Episode: \"All That Live! (100th Episode)\" 1999 Chicken Soup for the Soul Herself Episode: \"The Window/Cookie Thief/Appointment/All Good Things\" 1999 Sabrina, the Teenage Witch Herself Episode: \"Aging, Not So Gracefully\" 2002 Mad TV Herself Episode: \"Episode #8.1\" 2002 Hollywood Squares Herself/Panelist Recurring Guest American Idol Herself/Judge Main Judge: Seasons 1–8, Guest Judge: Season 19, Guest: Seasons 9 & 12 & 15 & 21 2003 Ant & Dec's Saturday Night Takeaway Herself Episode: \"Episode #2.3\" 2003-06 E! True Hollywood Story Herself Recurring Guest 2004 Driven Herself Episode: \"Paula Abdul\" 2004 The Bernie Mac Show Herself Episode: \"That Old Mac Magic\" 2004 That's So Raven The Host Episode: \"The Road to Audition\" 2005 Your Total Health Herself Episode: \"Episode #2.2\" 2005 Fashion in Focus Herself Episode: \"Big Money Under the Tents\" 2005 Biography Herself Episode: \"Paula Abdul\" 2005 Dateline NBC Herself Episode: \"Episode #13.36\" 2005 All of Us Herself Episode: \"Hollywood Swinging\" 2005 Saturday Night Live Herself Episode: \"Johnny Knoxville/System of a Down\" 2005 The Contender Herself Episode: \"Series Finale\" 2005 I Love the '80s 3-D Herself Main Guest 2005 Less Than Perfect Kathleen Episode: \"Distractions\" 2005-07 Family Guy Herself (voice) Guest: Season 4, Recurring Cast: Season 6 2006 The X Factor Herself Recurring Guest: Season 3 2007 Hey Paula Herself Main Cast 2007 The Friday Night Project Herself/Guest Host Episode: \"Episode #5.6\" 2008 RAH! Paula Abdul's Cheerleading Bowl Herself/Host Main Host 2008 Hollywood Residential Herself Episode: \"The Hotness\" 2008 Hotel Babylon Herself Episode: \"Episode #3.1\" 2009 InFANity Herself Episode: \"American Idol\" 2009 Howie Do It Herself Episode: \"Episode #1.5\" 2009 E! Investigates Herself Episode: \"Stalkers\" 2009 VH1 Divas Herself/Host Main Host 2009–11 Drop Dead Diva Herself Recurring Cast: Seasons 1-3 2011 Live to Dance Herself/Judge Main Judge 2011 The X Factor Herself/Judge Main Judge: Season 1 2012 I Will Survive Herself Episode: \"Episode #1.14\" 2012 Dancing with the Stars Herself Episode: \"Semi-Final Results\" 2013-14 RuPaul's Drag Race Episode: \"Reunited\" & \"Drag Queens of Talk\" 2013-16 So You Think You Can Dance Herself/Judge Guest Judge: Season 10, Main Judge: Season 12–13 2014 So You Think You Can Dance Australia Herself/Judge Main Judge: Season 4 2014 Neighbours Herself Episode: \"Episode #1.6910\" 2015 Real Husbands of Hollywood Herself Episode: \"Suck My Trick\" 2015 Strictly Come Dancing Herself Episode: \"Week Four\" 2016 Herself Episode: \"How to Survive Insufficient Funds\" 2016 Lip Sync Battle Herself Episode: \"Channing Tatum vs. Jenna Dewan-Tatum\" 2016 Bookaboo Herself Episode: \"Bookaboo's Barkin' New Year's Eve\" 2017 Fresh Off the Boat Holly Episode: \"Do You Hear What I Hear?\" 2018 Impractical Jokers: After Party Herself Episode: \"Bull Shiatsu\" 2018 The X Factor Herself/Adviser Episode: \"Judges' Houses 1\" 2019 America's Got Talent Herself Episode: \"Live Results Finale\" 2020 Celebrity Ghost Stories Herself Episode: \"Paula Abdul\" 2020 Impractical Jokers: Dinner Party Herself Episode: \"The Backyard Cookout Episode\" 2020-21 The Masked Dancer Herself/Panelist Main Panelist 2021 For Real: The Story of Reality TV Herself Episode: \"Make It Work\" 2021 Secret Celebrity Renovation Herself Episode: \"Paula Abdul\" 2021 The Movies That Made Us Herself Episode: \"Coming to America\" 2021 Superstar Herself Episode: \"George Michael\" 2021 I Can See Your Voice Herself/Panelist 2021 The Greatest AtHome Videos Herself Episode: \"Let Paula Be the Judge\" 2022 Janet Jackson Herself Episode: \"Part 2 & 4\" 2022 Bling Empire Herself Episode: \"Adieu ma Chérie\" 2022 American Rescue Dog Show Herself/Judge Main Judge 2022 Made for Love Anydoors Recurring Cast: Season 2 2023 The Muppets Mayhem Herself Episode: \"Track 7: Eight Days a Week\" 2023 Luann & Sonja: Welcome to Crappie Lake Herself Episode: \"X-Mas in July\" & \"The Grand Finale\" ===As Choreographer=== Music Videos Year Artist Music Video 1984 The Jacksons \"Torture\" 1986 Janet Jackson \"What Have You Done for Me Lately\" \"Nasty\" \"When I Think of You\" \"Control\" ZZ Top \"Velcro Fly\" 1987 Debbie Gibson \"Shake Your Love\" 2014 Avon \"Check Yourself\" Tours Year Artist Tour 1984 The Jacksons \"Victory Tour\" 1988 George Michael \"The Faith Tour\" Movies Year Title Notes 1987 The Tracey Ullman Show Won an Emmy Award Dragnet Can't Buy Me Love The Running Man 1988 Action Jackson Coming To America Big 1989 She's Out of Control Dance to Win The Karate Kid Part III 1990 17th American Music Awards Won an Emmy for her own performance, \"(It's Just) The Way That You Love Me\" 62nd Academy Awards \"Under the Sea\" from 'The Little Mermaid' and \"Best Costume Design\" category 1991 The Doors Val Kilmer's choreographer 1996 Jerry Maguire 1999 American Beauty 2001 Black Knight Reefer Madness Off-Broadway 2003 Zoe's Dance Moves 2009 American Idol Season 8-Disco Week (Results Show) 2022 1660 Vine ==Awards and honors== Award Year Category Nominated work Result Ref. American Music Awards 1990 Favorite Pop/Rock Female Artist Herself Favorite Soul/R&B; Female Artist Favorite Dance Artist Favorite Pop/Rock Album Forever Your Girl 1991 Favorite Pop/Rock Female Artist Herself 1992 Favorite Pop/Rock Female Artist Herself Favorite Adult Contemporary Artist Favorite Adult Contemporary Album Spellbound Billboard Music Video Awards 1989 Best Female Video \"Straight Up\" https://worldradiohistory.com/Archive-All- Music/Billboard/80s/1989/BB-1989-12-02.pdf Best New Artists Video Best Editing Best Choreography \"Cold Hearted\" 1990 Best Female Video \"Opposites Attract\" https://worldradiohistory.com/Archive-All- Music/Billboard/90s/1990/BB-1990-10-13.pdf Best Director Brit Awards 1990 International Breakthrough Act Herself Choreographers Carnival 2013 Lifetime Achievement Herself Ellis Island Medal of Honor 2019 Herself GLAAD Gala 2019 Ariadne Getty Ally Herself Grammy Awards 1990 Best Female Pop Vocal Performance \"Straight Up\" 1991 Best Short Form Music Video \"Opposites Attract\" Hollywood Walk of Fame 1991 Herself Impact Awards 2022 Herself Industry Dance Awards 2014 Icon Herself Juno Awards 1990 International Album of the Year Forever Your Girl International Single of the Year \"Straight Up\" Los Angeles Music Awards 1992 Pop Album of the Year Spellbound MTV Video Music Awards 1987 Best Choreography in a Video \"Nasty\" (by Janet Jackson) \"When I Think of You\" (by Janet Jackson) 1989 Best Female Video \"Straight Up\" Best New Artist in a Video Best Dance Video Breakthrough Video Best Choreography in a Video Best Editing in a Video 1990 Best Female Video \"Opposites Attract\" Best Dance Video Breakthrough Video Best Direction in a Video Best Choreography in a Video Best Special Effects in a Video 1991 Best Female Video \"Rush Rush\" 1995 Best Dance Video \"My Love Is for Real\" Best Choreography in a Video Music Business Association 2017 Harry Chapin Memorial Humanitarian Herself National Eating Disorders Association 2005 Profiles in Living Herself Nevada Ballet Theatre 2007 Woman of the Year Herself Nevada Equality Awards 2019 Ally Leadership Herself NewNowNext Awards 2010 Always Next, Forever Now Icon Herself Nickelodeon Kids' Choice Awards 1990 Favorite Female Musician/Group Herself 1991 Hall of Fame Herself People's Choice Awards 1990 Favorite Female Musical Performer Herself 1991 Primetime Emmy Awards 1988 Outstanding Choreography The Tracey Ullman Show 1989 1990 The 17th Annual American Music Awards 2003 Outstanding Reality- Competition Program American Idol 2004 2005 2006 2007 Revel Dance Convention 2021 Revelation Icon Herself Shorty Awards 2020 Best Celebrity Herself Soul Train Music Awards 1990 Best Song of the Year \"Straight Up\" Teen Choice Awards 2003 Choice TV: Reality Babe Herself 2004 Choice Reality/Variety TV Star - Female Herself 2005 Choice TV Personality - Female Herself YMA Fashion Scholarship Fund AMY Awards 2006 Leadership Herself ==References== ==Other websites== * * * * * Category:1962 births Category:Living people Category:American dancers Category:American Idol Category:American pop musicians Category:Television personalities from Los Angeles Category:American choreographers Category:American Emmy Award winners Category:American Grammy Award winners Category:Mezzo-sopranos Category:Singers from Los Angeles Category:American contemporary R&B; singers Category:American R&B; singers Category:American pop singers Category:American new jack swing singers Category:American hip hop musicians Category:American dance musicians Category:American Jews",
 "title": "Paula Abdul"
}