{
 "id": "804052",
 "text": "Hanna, Marchioness of Guadiaro; (born Hanna Jazmin Jaff Bosdet; November 4, 1986) is a television personality, politician, philanthropist, speaker, author, executive producer and activist. She is recognized for being the first Mexican to join British aristocracy. She is married to Lord Francisco de Borja Queipo, 6th Marquess of Guadiaro and eldest son of the 12th Count of Toreno. ==Early life and education== Hanna is from Tijuana, but was born in San Diego. She is a member of the Jaff tribe, and is a paternal descendant of Mohamed Pasha Jaff and a maternal descendant of Carlos Henry Bosdet. Her mother was born in Mexico. After graduating high school in San Diego, Jaff completed a Bachelor of Arts degree in Psychology and Minors in Criminal Justice and Political Science from the National University. She later completed a Master's degree in International Relations at Harvard University in Cambridge, Massachusetts. Additionally, she intermittently attended La Sorbonne in Paris, King's College in London, and Columbia University in New York for extended programs both during and after completing her degrees. ==Philanthropy and activism== Jaff has been a speaker for three TEDx Talks events in Mexico, as well as a discussant at the Milken Institute and the United Nations. In 2013, she founded a nonprofit organization, Jaff Foundation for Education, to teach English to immigrants and refugees. The organization works to host charity events. It has launched non-discrimination campaigns to support immigrants and refugees. As of 2016, it has locations in all major states in Mexico and it has over 7,000 active volunteers that works for them, benefiting more than 120,000 people. To that end, Jaff has self-published four self-taught English books and created scholarships, which the foundation donates to students. In 2013, she organized the first ever Kurdish festival in Mexico which was the largest festival held outside of Kurdistan. In 2017, Jaff launched a clothing line under the brand name, We Are One Campaign to support the victims of war in the Middle East. In 2021, Jaff was named Kindness Ambassador for UNESCO MGEIP global campaign. In 2022, she was an executive producer of animated movie: “Águila y Jaguar: Los Guerreros Legendarios”. ==Political history== In 2013-2018, Jaff held a number of nationwide political roles at the Institutional Revolutionary Party in Mexico, such as Undersecretary of Immigrants, Undersecretary of Relations with the Civil Society, among others: * 2017 - 2018; Undersecretary of Relations with the Civil Society at the National Executive Committee of the Institutional Revolutionary Party. * 2015; Federal Congresswoman candidate, Ecologist Green Party of Mexico. * 2014 - 2015; National Secretary General of Expresión Juvenil Revolucionaria at the Institutional Revolutionary Party. * 2013 - 2015; Undersecretary of Immigrants at the National Executive Committee of the Institutional Revolutionary Party. * 2013 - 2014; General Secretary for Social Management of the Frente Juvenil Revolucionario. * 2013; Tourism Ambassador of the State of Morelos, Mexico. ==Awards== Jaff has received awards including \"Honorary Representative of the Garmiyan Kurdistan for Latin America\". Other awards include: * \"100 Most Powerful Women in Mexico 2022\" by Forbes. * \"Woman of Distinction 2020\" by the 78th Assembly District in San Diego. * \"100 Most Powerful Women in Mexico 2019\" by Forbes. * \"10 Most Powerful Women in Baja California\" by Infobaja newspaper. * \"30 under 30\" most successful Mexicans by Entrepreneur magazine. * \"200 Leaders of Tomorrow under 30\" by St. Gallen Symposium in Switzerland. ==Television== In August 2018, Netflix announced that Jaff would be one of the cast members of the television show Made in Mexico, which began airing on September 28, 2018. ==Personal life== Jaff has been proposed to six times, engaged thrice, married twice, and divorce once. Jaff married Harry Roper- Curzon in February 2020 and divorced two years later because of financial and domestic abuse committed by him. In September 2022, she married Spanish aristocrat The Most Excellent Lord Francisco de Borja Queipo de Llano, Grandee of Spain, Marquess of Guadiaro, Knight of the Royal Maestranza of Cavalry of Granada, and heir to the Count of Toreno and other minor titles. ==References== ==Other websites== * Official website Category:Living people Category:American human rights activists Category:1986 births Category:Harvard University alumni",
 "title": "Hanna Jaff"
}