{
 "id": "804066",
 "text": "The Romanian alphabet is a variant of the Latin alphabet used by the Romanian language. It is a modification of the classical Latin alphabet and consists of 31 letters. Dicționarul explicativ al limbii române, 1998, Z is the thirty first letter of the Romanian alphabet, dexonline.roAcademia Română, Institutul de Lingvistică „Iorgu Iordan – Al. Rosetti\", Dicționarul ortografic, ortoepic și morfologic al limbii române, Editura Univers Enciclopedic, București, 2005, pp. XXVII–XXVIII Five of the letters (Ă, Â, Î, Ș, and Ț) have been changed from their Latin originals for the phonetic requirements of the language: Letter Name A, a a Ă, ă ă Â, â î / î din a B, b be / bî C, c ce / cî D, d de / dî E, e e F, f ef / fe / fî G, g ge / ghe / gî H, h haș / ha / hî I, i i Letter Name Î, î î / î din i J, j je / jî K, k ca / capa L, l el / le / lî M, m em / me / mî N, n en / ne / nî O, o o P, p pe / pî Q, q chiu () R, r er / re / rî S, s es / se / sî Letter Name Ș, ș șe / șî T, t te / tî Ț, ț țe / țî U, u u V, v ve / vî W, w dublu ve / dublu vî X, x ics Y, y igrec / i grec Z, z ze / zet / zed / zî The letters Q (chiu), W (dublu v), and Y (igrec or i grec) were formally introduced in the Romanian alphabet in 1982, although they had been used earlier. They occur only in foreign words and their Romanian derivatives, such as quasar, watt, and yacht. The letter K, although relatively older, is also rarely used and appears only in proper names and international neologisms such as kilogram, broker, karate. Academia Română, Dicționarul explicativ al limbii române, Entry for K, Editura Univers Enciclopedic, 1998, dexonline.ro These four letters are still perceived as foreign, which explains their usage for stylistic purposes in words such as nomenklatură (normally nomenclatură, meaning \"nomenclature\", but sometimes spelled with k instead of c if referring to members of the Communist leadership in the Soviet Union and the Eastern Bloc countries, as Nomenklatura is used in English).Academia Română, Institutul de Lingvistică „Iorgu Iordan – Al. Rosetti\", Dicționarul ortografic, ortoepic și morfologic al limbii române, 2nd Edition, Univers Enciclopedic Publishing House, Bucharest, 2005, , p. XXIX In cases where the word is a direct borrowing having diacritical marks not present in the above alphabet, official spelling tends to favor their use (München, Angoulême etc., as opposed to the use of Istanbul over İstanbul). ==References== Category:Alphabets",
 "title": "Romanian alphabet"
}