{
 "id": "804193",
 "text": "The Australian Shepherd, sometimes referred to as the Aussie Shepherd, is a medium-sized breed of dog developed in the United States, despite its name. It is very similar in its appearance to the English Shepherd and Border Collie, and indeed, studies have shown they are very similar in relation. Like many herding dogs, they show considerable drive and energy, being best at jobs such as search and rescue dogs, disaster dogs, therapy dogs, guide dogs, etc. For these reasons, they have become the 17th most popular dog breed in the United States. == Physical trait information == === Size === The Australian Shepherd is usually a medium-sized breed. They can weigh from and stand from in height. The Australian Shepherd Club of America (ASCA) standard says the Australian shepherd must stand between at the shoulders, females being and males measuring ; however, quality is not to be sacrificed in favor of size. === Color === The known Aussie colors are solid black, solid red (liver), blue merle, and red/liver merle;\"Get to Know the Australian Shepherd\", 'The American Kennel Club', retrieved 19 May 2014 and these colors may also have copper (tan) points or white markings in various combinations on the face, chest, and legs. A black or red dog with copper and white trim is called 'tricolor' or 'tri', while a black or red dog with white trim but no copper is called 'bicolor' or 'bi'. White, rather than skin color, on or around the ears is an indicator of increased risk for deafness. Too much white on the face and ears can place an individual dog at greater risk for sunburn and subsequent skin cancer. The wide variety of colors comes from the color allele, which is either black (B) dominant or red (b), and the dominant merle allele (M). Together, these provide four coat-color aspects that can appear in any combination: * Black tri, with copper points, white markings, or both on the face, collar, legs, chest, and underbelly - solid black dogs are equally wanted as ones with copper or white. * Red (liver) with or without copper points or white markings on the face, collar, legs, chest, and underbelly - either white or copper points are required. Solid red dogs are equally wanted as ones with copper or white. * Blue merle (a patchwork of gray and black) with or without copper points or white markings on the face, collar, legs, chest, and underbelly - neither white nor copper points are required. Solid Merle dogs are equally desirable as ones with copper or white. * Red merle (a patchwork of cream and red/liver) with or without copper points or white markings on the face, collar, legs, chest, underbelly - neither white nor copper points are required. Solid Merle dogs are equally desirable as ones with copper or white. The merle allele, which produces a mingled or patchwork combination of dark and light areas, is the coat pattern most commonly associated with the breed. This merle (M) is dominant, so heterozygous dogs (Mm) show the pigmentation pattern; however, when two merles are bred, the statistical risk is that 25% of the offspring will end up with the two copies of the merle gene (homozygous). These dogs usually have a mostly white coat and blue irises and are often deaf, blind, or both. In this case, deafness and blindness are linked to having two copies of the Merle gene, which disrupts pigmentation and produces these health defects. The tri-colored (red, black, and white) Merles will have a 1/4 chance of being blind because of the genes when breeding two Merle colored dogs for the recessive fur color. All black and blue merle dogs have black noses, eye rims, and lips. All red and red merle dogs have liver or brown noses, eye rims, and lips. Also, variety is seen in the Aussie's eye color, and they are often heterochromatic. An early nickname for the breed was \"ghost-eye dog\". Aussie eyes may be any shade of brown or blue; they may have two different colored eyes, or even have bicolored or \"split eyes\" (for example, a half-brown, half-blue eye), which appear to be similar to the merle coloration. Merled eyes exist where one color is mixed in and swirled with another. Any combination of eye colors is fine in the breed standard, so long as the eyes are healthy. In general, however, black Aussies (self, bi-color, or tri-color) tend to have brown eyes. In contrast, red (self, bi-color, or tri-color) Aussies usually have amber eyes, though these Aussies may also carry the blue-eyed gene. The merle type in Australian Shepherds is similar to Mitf mouse mutants' coat color. === Tail === Although some Aussies are born with naturally bobbed or partially bobbed (stubby) tails, the majority are born with full, long tails. Breeders have historically docked the tails when the puppies are born. In the United States and Canada, the standard calls for a natural bob or docked tail not to exceed four inches as a defining characteristic. Any natural tail length is permitted when showing in Europe, where cutting off a part of their tail has been banned in most countries, including the United Kingdom. == References == Category:Dog breeds originating in the United States Category:FCI breeds",
 "title": "Australian Shepherd"
}