{
 "id": "804168",
 "text": "Cheng Pei-pei (Chinese: 鄭佩佩; 6 January 1946 - 17 July 2024) was a Chinese actress.https://www.scmp.com/news/hong-kong/society/article/3271071/cheng-pei- pei-chinese-martial-arts-star-decades-long-career-dies-78 Popularly known as \"Queen of Swords\" and \"Queen of Martial Arts Films\", Cheng starred in numerous successful wuxia and martial arts films, and is widely considered cinema's first female action hero.https://www.sixthtone.com/news/1015553https://focustaiwan.tw/culture/202407190018 During her six-decade career, Cheng starred in over 110 movies and 50 television series.https://focustaiwan.tw/culture/202411230011 For her portrayal of Jade Fox in Crouching Tiger, Hidden Dragon (2004), Cheng won a Hong Kong Film Award for Best Supporting Actress.https://www.scmp.com/news/hong-kong/society/article/3271071/cheng-pei- pei-chinese-martial-arts-star-decades-long-career-dies-78 ==Early life== Born in 1946 in Shanghai, China, Cheng moved to Hong Kong in 1962 at the age of 16. In 1963, she began training at Shaw Brothers Studio. ==Career== Cheng had her first movie role, starring as Liu Qiuzi in the 1964 Taiwanese drama movie Lovers' Rock. Cheng was best known for starring in the 1966 Hong Kong wuxia movie Come Drink with Me, directed by King Hu. It stars Cheng as Golden Swallow, a good swordswoman on a mission to rescue her brother. In 2000, she returned to international acting with her role as Jade Fox in Ang Lee's Crouching Tiger, Hidden Dragon. Cheng was the president of the King Hu Foundation before her death. ==Personal life== Cheng married Yuan Wen-tung in 1970. They had four children, including gymnast Eugenia Yuan. In 1987, Cheng and Yuan divorced. Cheng moved to Southern California in the 1970s to raise her children. She went to business school at the University of California, Irvine. During this time, she also taught Chinese dance. In 2019, Cheng was diagnosed with corticobasal degeneration. She died from the disease on 17 July 2024 in San Francisco, California at the age of 78. ==References== ==Other websites== * * * * Cheng Pei-pei entry at Lovehkfilm.com Category:1946 births Category:2024 deaths Category:Chinese movie actors Category:Chinese television actors Category:Chinese stage actors Category:Chinese voice actors Category:Actors from Shanghai Category:Deaths from neurodegenerative disease Category:Chinese educators Category:20th-century Chinese actors Category:21st- century Chinese actors",
 "title": "Cheng Pei-pei"
}