{
 "id": "804342",
 "text": "The elu system () is based on a set of linguistic proposals created with the purpose of preparing the Portuguese language with a neuter grammatical gender. The most prominent proposal is the personal neopronouns elu, delu, nelu, and daquelu, intended to be a proposal for how to refer to non-binary people (whose gender identity is not male or female) or whose gender is unknown, or irrelevant, as well as groups with different genders, without resorting to the \"generic masculine\". These proposals can be used by and for anyone, regardless of gender. The pronoun elu tries to present the least number of problems in its use when trying to function smoothly in oral speech, listening, writing and visual identification, creating similarity between ela (\"she\"), ele (\"he\"), and elu (functionally similar to singular they). Nouns in Portuguese all have grammatical gender, and this gender impacts some grammatical inflections. Grammatical gender is different from personal gender identity―rather, words referring to a generic individual with unknown gender identity still carries grammatical gender. For example, the word pessoa (\"person\") is grammatically feminine, but indicates no specific gender of the person referred to. The gender inflection appears explicitly when in the context of an inflectied adjective. With the feminine nouns such as cidade (\"city\"; plural cidades), the adjective meaning \"beautiful\" (currently written generically as belo in dictionaries) would become cidade bela, cidades belas (\"beautiful city/cities\"). Likewise, this works with a masculine noun such as carro (\"car\"; plural carros): carro belo, carros belos (\"beautiful car/cars\"). The Portuguese language as a rule determines that the plural of nouns, when covering individuals of the feminine and masculine gender, is made based on the generic masculine: a collective of vinte alunas (\"twenty female students\") and dez alunos (\"ten male students\"), is said as trinta alunos (\"thirty students\"). This form of plural formation is considered sexist by certain groups and individuals, resulting in proposals for a neutral gender to be adopted, such as \"thirty children\" (trinta menines). A similar known neopronoun in Portuguese is ile, also called sistema ile (\"ile system\"), was popularized in 2020. The systems happen to be same when applying neolanguage beyond pronouns, they use ⟨-e⟩ suffixes. == References == == Other websites == *Guide to “Gender Neutral Language” (PT-BR) *“X” e o “@” are not a solution: Elu System | Gender-Neutral Language *Non-binary or neutral language Category:Pronouns Category:Gender Category:Portuguese language",
 "title": "Elu (Portuguese pronoun)"
}