{
 "id": "804429",
 "text": "The Asia Pacific Democrat Union (APDU), is in international political centre- right, right group of political parties in the Asia Pacific Region. This union is tied and related to the International Democrat Union that is based in Munich ,Germany, the (APDU) Is labelled as a regional union on the International Democrat Union (IDU) Website. The Asia Pacific Democrat Union aims to provide a place in which political parties that have similar beliefs can exchange there views on matters of policy and interest so that ideas can be shared between party's so that centre-right ideals can be spread and be encouraged all over the world. This Union currently has 15 members, ranging from Bangladesh to El Salvador, the current chairperson is Ranil Wickramasinghe the former Sri Lankan Prime Minister Serving in this position since 2016. Tenzin Dargyalb Khangsar (Canada) From Tibet serves as vice chairman of the union making him the first person of Tibetan ancestry to represent the organisation. This lead to Controversy with China disagreeing with this Choice due to Tenzin Dargyalb Khangsar (Canada) previously denouncing China's claims on Tibet. BNP secretary general Mirza Fakhrul Islam Alamgir (India) has also been chosen as vice chairman and Hassan Latheef (Maldives). The Asia Pacific Democrat Union (APDU), does not have a separate website but you can email, and there party address currently is Sirikotha 400 Kotte Road, Pita Kotte Sri Jayawardenepura, Sri Lanka witch is also the headquarters of the United National Party (UNP). Current party members and affiliates include a range of party in government and opposition including the Liberal party of Australia, The Republican Party of the United States and even the Kuomintang in Republic of China (Taiwan). A full list of party members can be found Bellow. Country Party Abbr Color Legislative Seats Total as percentage Status Lower House Upper House Australia Liberal Party LPA Blue 61 / 151 29 / 76 36.7% In government Bangladesh Nationalist Party BNP Blue 7 / 350 Unicameral legislature only 2.00% In opposition Canada Conservative Party CPC PCC Blue 121 / 338 32 / 105 29.12% In opposition Republic of China (Taiwan) Kuomintang KMT Blue 35 / 113 Unicameral legislature only 30.97% In opposition Chile National Renewal RN Blue 19 / 120 8 / 38 17.09% In government El Salvador Nationalist Republican Alliance ARENA Blue, white and red 35 / 84 Unicameral legislature only 41.67% In opposition India Bharatiya Janata Party BJP Saffron 303 / 543 92 / 245 53.81% In government Indonesia National Awakening Party PKB Green 47 / 560 Nonpartisan chamber 8.40% In government South Korea People Power Party PPP Pink 103 / 300 Unicameral legislature only 34.33% In opposition Maldives Democratic Party MDP Yellow 65 / 87 Unicameral legislature only 74.71% In government Mongolia Democratic Party AN Sky blue 9 / 76 Unicameral legislature only 11.84% In opposition Nepal Rastriya Prajatantra Party RPP Blue 37 / 601 Unicameral legislature only 6.16% In opposition New Zealand National Party Nats Blue 35 / 120 Unicameral legislature only 26.80% In opposition Sri Lanka United National Party UNP Green 1 / 225 Unicameral legislature only 47.10% In opposition United States Republican Party R/GOP Red 199 / 435 53 / 100 47.10% In government == References == == Other websites == * APDU at the UDI site since deleted as seen from June 17, 2010 * Current IDU site * Story about Tenzin Dargyal Khangsar serving as vice chairman. * BNP gets Asia Pacific Democrat Union’s full membership * The US and Australian Alliance in the Asia Pacific, January 31, 2014 (Video) * Asia Pacific Democrat Union, Campaign Managers’ Meeting 2019 * Hassan Latheef elected as Vice Chairman of APDU * Asia Pacific Democrat Union Audio explanation for the Blind Category:International organizations Category:Conservatism",
 "title": "Asia Pacific Democrat Union"
}