{
 "id": "804588",
 "text": "Czech Americans (), known in the 19th and early 20th century as Bohemian Americans, are citizens of the United States who are of Czech descent. ==Population== ===The top 50 U.S. communities with the highest percentage of people claiming Czech ancestry=== The top 50 U.S. communities with the highest percentage of people claiming Czech ancestry are: #Conway, ND 55.2% American FactFinder, community facts-Conway City, North Dakota- Origins and languages- Census 2000 Selected Social Characteristics (Household and Family Type, Disability, Citizenship, Ancestry, Language, ...) http://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml #West, TX 40.9% #Oak Creek NE 38.2% #Wilber, NE 37.3% #Shiner, TX 32.1% #Montgomery, MN (township) 30.9% #Lonsdale, MN 30.5% #Wheatland, MN 29.9% #Tyndall, SD 29.5% #David City, NE 28.0% #Montgomery, MN (city) 26.3% #Franklin, WI 26.1% #Lanesburgh, MN 25.2% #Granger, TX 25.1% #Port Costa, CA 24.0% #Schulenburg, TX 23.7% #New Prague, MN and Erin, MN 23.5% #Wahoo, NE 22.7% #Carlton, WI 22.4% #Wallis, TX 22.0% #Hallettsville, TX 21.5% #Hale, MN 20.8% #Montpelier, WI 19.7% #Flatonia, TX 19.5% #West Kewaunee, WI 19.2% #Schuyler, NE and Webster, NE 19.0% #Gibson, WI 18.9% #Hillsboro, WI 18.4% #Kossuth, WI 18.2% #Lexington, MN 18.1% #Mishicot, WI 16.9% #Kewaunee, WI and North Bend, NE 16.7% #Franklin, WI 15.9% #Oak Grove, WI and Caldwell, TX 15.7% #Lake Mary, MN 15.4% #Solon, IA 15.2% #Mishicot, WI 15.0% #Helena, MN 14.9% #Marietta, NE 14.7% #Stickney, IL 14.5% #Ord, NE (township) and Weimar, TX 14.3% #Crete, NE 14.2% #Park River, ND 14.1% #Ord, NE (city) and La Grange, TX 14.0% #Wagner, SD 13.6% #Needville, TX 13.2% #Calmar, IA and Worcester, WI 13.0% #Webster, MN 12.9% #North Riverside, IL 12.4% #Belle Plaine, IA 12.3% #El Campo, TX 12.2% ===U.S. communities with the most residents born in the Czech Republic (former Czechoslovakia)=== The top U.S. communities with the most residents born in the Czech Republic (former Czechoslovakia) are: #Masaryktown, FL 3.1% #Mifflinville, PA 2.2% #Gulf Shores, AL 2.1% #North Riverside, IL and Sharon Springs, NY 2.0% #Lyons, IL 1.6% #Rose, WI, North Lynbrook, NY and Anna Maria, FL 1.5% #Oakbrook Terrace, IL and Danville, AR 1.4% #Bee Ridge, FL, Cameron, TX, Lenox, MA, Verdigre, NE, and Willowbrook, IL 1.2% #Lower Grand Lagoon, FL, Beachwood, OH, Allamuchy-Panther Valley, NJ, Mahopac, NY, Black Diamond, FL, and Glenview, KY 1.1% #Key West, FL, Woodstock, NY, Madison Park, NJ, Belleair Beach, FL, South Amboy, NJ, Colver, PA, Herricks, NY, Horine, MO, Shelburne, MA, and Gang Mills, NY 1.0% ===The states with the largest Czech American populations=== The states with the largest Czech American populations are: Texas 155,855 Illinois 123,708 Wisconsin 97,220 Minnesota 85,056 Nebraska 83,462 California 77,673 Ohio 70,009 Iowa 51,508 New York 44,942 Florida 42,890 Vermont 38,000 However, these figures are grossly understated when second and third generation descendants are included. ===The states with the top percentages of Czech Americans=== The states with the top percentages of Czech Americans are: Nebraska 5.5% South Dakota 2.3% North Dakota 2.2% Wisconsin 2.1% Iowa 2.1% Minnesota 2.1% Illinois 1.2% Montana 1.0% Wyoming 1.0% ==References== Category:Ethnic groups in the United States",
 "title": "Czech Americans"
}