{
 "id": "804758",
 "text": "The following is a list of deaths that should be noted in July 2021. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==July== ===1=== *Louis Andriessen, 82, Dutch composer (La Commedia, Writing to Vermeer, Rosa – A Horse Drama) and teacher, problems caused by dementia.Geen componist in Nederland was zo invloedrijk als Louis Andriessen (1939-2021) *Antonio Cantisani, 94, Italian Roman Catholic prelate, Bishop and Archbishop of Rossano-Cariati (1971–1980) and Catanzaro-Squillace (1980–2003).E' morto l'Arcivescovo emerito di Catanzaro-Squillace Mons. Antonio Cantisani *Josh Culbreath, 88, American hurdler, Olympic bronze medalist (1956).Josh Culbreath, Norristown native and Olympic medalist in the hurdles, dies at 88 *Yury Dokhoian, 56, Russian chess grandmaster, COVID-19.Умер тренер и секундант Гарри Каспарова *Evgenia Kirichenko, 90, Russian historian.Исследователь истории русской архитектуры Евгения Кириченко умерла в 90 лет *Boudewijn Paans, 77, Dutch writer and journalist.Redder van de VPRO *Philece Sampler, 67, American voice actress (Digimon Adventure, Miraculous: Tales of Ladybug & Cat Noir, The Legend of Korra), heart attack.Philece Sampler, Digimon and The Legend of Korra Star, Dies at 67 *Kartal Tibet, 83, Turkish actor (Tarkan Versus the Vikings) and movie director (Tosun Paşa, Şalvar Davası), kidney failure caused by COPD.Veteran Turkish actor Kartal Tibet dies aged 83 ===2=== *Eric Balemans, 59, Dutch politician, member of the House of Representatives (1998–2006).VVD-coryfee Eric Balemans (59) overleden: Wijk bij Duurstede verliest ‘ervaren rot in het vak’ *Juozas Baranauskas, 86, Lithuanian television broadcaster (LRT televizija) and politician, MP (1992–1996).Mirė pirmasis LRT Televizijos diktorius Juozas Baranauskas *Fereimi Cama, 66, Fijian Anglican prelate, Bishop of Polynesia (since 2019).Archbishop Fereimi Cama, Primate of Aotearoa, New Zealand and Polynesia, has died aged 66 *Ion Ciocanu, 81, Moldovan literary critic.Scriitorul Ion Ciocanu s-a stins din viață *Naïm Kattan, 92, Iraqi-born Canadian novelist, essayist and critic.L'écrivain francophile Naïm Kattan meurt à 92 ans *Elliot Lawrence, 96, American jazz pianist, multi-Emmy winner.Tony and Emmy Winner Elliot Lawrence Dies at 96 *Bill Ramsey, 90, German-American jazz singer and actor (Music in the Blood, The Adventures of Count Bobby, Old Shatterhand).Sänger Bill Ramsey mit 90 Jahren gestorben *Nikolai Slichenko, 86, Russian singer and actor (Hard Happiness, Wedding in Malinovka), problems caused by respiratory failure.Умер народный артист СССР и худрук театра \"Ромэн\" Николай Сличенко *Jolien Verschueren, 31, Belgian cyclo-cross racer (Pauwels Sauzen–Bingoal), brain cancer.Veldrijdster Jolien Verschueren (31) verliest de strijd tegen kanker ===3=== *Abelardo Alvarado Alcántara, 87, Mexican Roman Catholic prelate, Auxiliary Bishop of Mexico (1985–2008).Fallece obispo emérito, Abelardo Alvarado a los 87 años *Robert Correia, 82, American politician, member of the Massachusetts House of Representatives (1977–2008) and Mayor of Fall River (2008–2010).Former State Rep and Fall River Mayor Robert Correia passes away *Richard Domba Mady, 68, Congolose Roman Catholic prelate, Bishop of Doruma-Dungu (since 1994).Haut-Uele : l’évêque du diocèse de Dungu-Doruma décédé à Kinshasa *Nino Escalera, 91, Puerto Rican baseball player (Cincinnati Reds).Fallece Nino Escalera: El Caballero de la Inicial *He Kang, 98, Chinese politician, member of the CCP Central Committee (1982–1992) and Minister of Agriculture (1988–1990).99岁新中国天然橡胶事业奠基人、原农业部部长何康逝世 *Nikolay Konstantinov, 89, Russian mathematician.Умер российский математик и педагог Николай Константинов *John Siffy Mirin, 53, Indonesian politician, MP (since 2018), COVID-19.Anggota DPR John Siffy Mirin Meninggal Dunia Setelah Seminggu Berjuang Lawan Covid-19 *Ted Nash, 88, American rower, Olympic champion (1960).Ted A. Nash, A True Giant of Rowing, Has Passed *Enzo Polidori, 84, Italian politician, Mayor of Piombino (1976–1983) and Deputy (1983–1992).È morto l'ex sindaco di Piombono Enzo Polidori *Roberto Rodríguez, 85, Argentine Roman Catholic prelate, Bishop of Pertusa (1992–1998), Villa María (1998–2006) and La Rioja (2006–2013), COVID-19.Murió Roberto Rodríguez, obispo emérito de La Rioja *Joris Schouten, 94, Dutch politician, Senator (1980–1981; 1983–1991)Oud-boerenvoorman en voormalig senator Joris Schouten overleden *Anne Stallybrass, 82, English actress (The Six Wives of Henry VIII, Heartbeat, Diana: Her True Story).Anne Stallybrass obituary *Rachmawati Sukarnoputri, 70, Indonesian politician, member of the Presidential Advisory Council (2007–2009), COVID-19.Rachmawati Soekarnoputri Meninggal karena Covid-19 ===4=== *Burhan Abdurahman, 64, Indonesian politician, Mayor of Ternate (2010–2015, 2016–2021), COVID-19.Positif Covid-19, Mantan Wali Kota Ternate Meninggal Dunia *Francesco Bosi, 76, Italian politician, Senator (1996–2006) and Mayor of Rio Marina (2001–2011).E' morto Francesco Bosi, parlamentare ed ex sindaco all'Elba. Fu tra i fondatori dell'Udc *Sanford Clark, 85, American rockabilly singer (\"The Fool\", \"Houston\"), COVID-19. *Terry Donahue, 77, American Hall of Fame college football coach (UCLA Bruins) and executive (San Francisco 49ers), cancer.Terry Donahue, the winningest coach in UCLA football history, dies at 77 *Maidarjavyn Ganzorig, 72, Mongolian cosmonaut, Soyuz 39 reserve pilot.Хөдөлмөрийн баатар, сансрын нисгэгч М.Ганзориг таалал төгсчээ *Luminița Gheorghiu, 71, Romanian actress (The Death of Mr. Lazarescu, Child's Pose, Code Unknown).Actrița Luminița Gheorghiu a murit. Era cunoscută pentru roluri din \"Moromeţii\" sau \"Moartea domnului Lăzărescu\" *Dennis Gorski, 76, American politician, member of the New York State Assembly (1975–1987) and Erie County executive (1988–1999), problems caused by Parkinson's disease.Former Erie County Executive Dennis Gorski passes away at 76 *Harmoko, 82, Indonesian politician, Speaker of the People's Representative Council (1997–1999), progressive supranuclear palsy and COVID-19.Harmoko, Menteri Penerangan Era Soeharto Meninggal Dunia *Matīss Kivlenieks, 24, Latvian ice hockey goaltender (Columbus Blue Jackets, national team), injuries sustained from firework blast.CBJ statement on the passing of Matiss Kivlenieks *Rick Laird, 80, Irish jazz fusion bassist (Mahavishnu Orchestra, Brian Auger and the Trinity), lung cancer. *Richard Lewontin, 92, American evolutionary biologist.Richard Lewontin, biólogo evolutivo pioneiro e crítico do racismo científico, morre aos 92 anos *Dicky Moegle, 86, American football player (San Francisco 49ers, Pittsburgh Steelers, Dallas Cowboys).Former Rice football legend, NFL great Dicky Maegle passes away *Richard Rainey, 82, American politician, member of the California State Assembly (1992–1996) and State Senate (1996–2000), melanoma.Richard Rainey, former Contra Costa sheriff and California legislator, dies at 82 *Hans-Jürgen Ripp, 75, German footballer (Hamburger SV, Lüneburger SK).Der HSV trauert um Hans-Jürgen Ripp *Wolfgang Roth, 80, German politician and banker, member of the Bundestag (1976–1994).Zum Tod von Wolfgang Roth. Juso-Chef und Banker – Ein geachteter Sozialdemokrat *Jane Shalimar, 41, Indonesian actress and politician, MP (since 2014), COVID-19.Politikus Demokrat Jane Shalimar Meninggal Dunia *Adang Sudrajat, 58, Indonesian politician, MP (since 2014), COVID-19.Positif Corona, Anggota DPR F-PKS Adang Sudrajat Meninggal Dunia *Dale Whiteside, 90, American politician, member of the Missouri House of Representatives (1987–1997).Dale Curtis Whiteside ===5=== *Aggrey Awori, 82, Ugandan economist, politician and Olympic hurdler (1960, 1964), MP (2001–2006).Former Ugandan presidential candidate Aggrey Awori dies *Patrick Boré, 64, French politician, Mayor of La Ciotat (2001–2020) and Senator (since 2020), cancer.L'ancien maire de La Ciotat et sénateur Patrick Boré est décédé *Raffaella Carrà, 78, Italian singer (\"A far l'amore comincia tu\"), actress (Caesar the Conqueror, Von Ryan's Express) and television presenter, lung cancer.È morta Raffaella Carrà. Aveva 78 anni *Didi Contractor, 91, German- American architect.Didi Contractor, champion of low-waste buildings, is no more *Richard Donner, 91, American movie director (Superman, Lethal Weapon, The Goonies) and producer, cardiopulmonary failure caused by atherosclerosis.Richard Donner Dies: ‘Superman’, ‘Lethal Weapon’ And ‘The Goonies’ Director Was 91 *Roberto Hernández, 54, Cuban sprinter, Olympic silver medalist (1992), problems caused by heart disease.Atletismo cubano lamenta muerte de Roberto «Angola» Hernández *Rubén Israel, 65, Uruguayan football manager (Rentistas, Club Libertad, Barcelona de Ecuador).Murió Rubén Israel, extécnico de Santa Fe y Millonarios *Leo van de Ketterij, 70, Dutch guitarist (Shocking Blue).'Zeeuwse gitaarprins' Leo van de Ketterij overleden *Władysław Lisewski, 73, Polish politician and engineer, Mayor of Szczecin (1991–1994) and Voivode of Szczecin (1997–1998) and West Pomeranian Voivodship (1999–2001).Zmarł były prezydent Szczecina i wojewoda zachodniopomorski *Vladimir Menshov, 81, Russian movie director (Moscow Does Not Believe in Tears, Love and Pigeons) and actor (The General), COVID-19.Умер Владимир Меньшов *Alfredo Obberti, 75, Argentine footballer (Newell's Old Boys, Grêmio, national team).Murió el Mono Obberti, uno de los máximos ídolos de Newell's *Gillian Sheen, 92, British fencer, Olympic champion (1956).Gillian Sheen obituary *William Smith, 88, American actor (Rich Man, Poor Man, Any Which Way You Can, Conan the Barbarian).William Smith, Action Actor and Star of ‘Laredo’ and ‘Rich Man, Poor Man,’ Dies at 88 *Stan Swamy, 84, Indian Roman Catholic Jesuit priest and tribal rights activist, problems caused by COVID-19 and Parkinson's disease.Tribal activist Stan Swamy dies at 84 *Sergey Timofeyev, 71, Russian Olympic wrestler (1976).Умер советский борец вольного стиля из Татарстана Сергей Тимофеев ===6=== *Arthur Brooks, 85, American politician, member of the Ohio House of Representatives (1975–1978).Arthur VN Brooks *Tom Buford, 72, American politician, member of the Kentucky Senate (since 1991).Kentucky State Senator Tom Buford dies at 72 *Suzzanne Douglas, 64, American actress (The Parent 'Hood, How Stella Got Her Groove Back, Jason's Lyric), pancreatic cancer. *Djivan Gasparyan, 92, Armenian musician and composer.Legendary Armenian duduk player Jivan Gasparayn dies aged 92 *Miguel González Pérez, 94, Spanish footballer (Atlético Madrid, Real Zaragoza, national team) and coach.Fallece Miguel González, leyenda del Atlético de los años 50 *Sir Nicholas Goodison, 87, British businessman, Chairman of the London Stock Exchange (1976–1986). *Patrick John, 83, Dominican politician, Premier (1974–1978) and Prime Minister (1978–1979).Dominica’s first PM Patrick John passes away *Axel Kahn, 76, French geneticist, President of Paris Descartes University (2007–2011), cancer.Axel Kahn, médecin, généticien et essayiste est mort *Montgomery Meigs, 76, American general, problems caused by Parkinson’s disease and Lewy body dementia. *Leandro de Oliveira, 39, Brazilian track and field athlete.Medalha de ouro de atletismo nos Jogos Pan-Americanos de 2011 é encontrado morto em rodovia de São Paulo *William H. Pauley III, 68, American politician and lawyer, Judge for the U.S. District Court for the Southern District of New York (since 1998).Manhattan federal judge William Pauley dies at 68 *Jasti Eswara Prasad, 86, Indian politician and lawyer, Judge of the High Court of Andhra Pradesh (1990–1994) and the High Court of Karnataka (1994–1996), heart attack.Hyderabad: Justice Easwara Prasad passes away ===7=== *Robert Downey Sr., 85, American actor (To Live and Die in L.A.), movie director (Up the Academy, Putney Swope), and producer, problems caused by Parkinson's disease.Robert Downey Sr., actor and filmmaker dad of Robert Jr., dead at 85 *Keshav Dutt, 95, Indian field hockey player, Olympic champion (1948, 1952).Keshav Datt Passes Away: Mamata Banarjee Offers Condolences To Indian Hockey Legend's Family *Anatoliy Franchuk, 85, Ukrainian politician, Prime Minister of Crimea (1994–1996, 1997–1998).Умер бывший премьер-министр Крыма Анатолий Франчук *Bob F. Griffin, 85, American politician, member (1971–1996) and Speaker (1981–1996) of the Missouri House of Representatives.Bob Griffin, longest-serving Missouri House speaker, forced out by scandal, dies at 85 *Smaïn Ibrir, 89, Algerian footballer (Le Havre AC, national team).Membre de la glorieuse équipe du FLN : Smaïn Ibrir n'est plus *Ahmed Jibril, 82–83, Palestinian militant, founder and leader of the PFLP- GC.В Дамаске умер Ахмад Джабриль, один из основателей НФОП *Dilip Kumar, 98, Indian actor (Andaz, Daag, Qila), MP (2000–2006), prostate cancer.Dilip Kumar (1922-2021): Life and Times of the 'Tragedy King' *Pierre Laffitte, 96, French politician and scientist, founder of Sophia Antipolis, Senator (1985–2008).Pierre Laffitte, le fondateur de Sophia Antipolis, est mort *Cameron Mackenzie, 60, South African politician, MP (since 2014), COVID-19.DA MP Cameron MacKenzie dies of Covid-19 *Jovenel Moïse, 53, Haitian politician and businessman, President (since 2017), shot.Haitian president killed in attack at home *Elystan Morgan, Baron Elystan-Morgan, 88, Welsh politician, MP (1966–1974) and member of the House of Lords (1981–2020).Lord Elystan-Morgan, campaigner for Welsh devolution, dies *Carlos Reutemann, 79, Argentine Formula One racing driver and politician, Governor of Santa Fe Province (1999–2003) and Senator (since 2003), One Grand Prix winner, problems caused by a cerebral hemorrhage.Ex F1 racer Carlos Reutemann dies at age 79 *Michael Soles, 54, Canadian football player (Edmonton Eskimos, Montreal Alouettes), problems caused by ALS.CFL, ALS Mourn the Passing of Michael Soles *William Stevenson, 87, Canadian politician and lawyer, Judge of the Supreme Court of Canada (1990–1992).William Alexander Stevenson *Giovanni Tegano, 81, Italian mobster, Head of De Stefano 'ndrina.'Ndrangheta, morto il boss Giovanni Tegano *Giuseppe Tesauro, 78, Italian politician and lawyer, Advocate General of the European Court of Justice (1988–1998) and President of the Constitutional Court (2014).Addio Giuseppe Tesauro, tra i più importanti giuristi della scuola napoletana *Chick Vennera, 74, American actor (Thank God It's Friday, High Risk, Time Under Fire), cancer.Chick Vennera Dies: ‘Thank God It’s Friday’, ‘The Golden Girls’ Actor Was 74 *Herman Willemse, 87, Dutch long- distance swimmer.Passages: Honor Open Water Swimmer Herman Willemse Dies at 87 *Chris Youngblood, 55, American professional wrestler (WWC, FMW).Chris Youngblood of famed Romero clan dies ===8=== *Ricardo Costa, 81, Portuguese filmmaker and producer.Morreu o realizador e ensaísta Ricardo Costa, aos 81 anos (death announced on this date) *Walter Thomas McGovern, 99, American politician and lawyer, Judge (since 1971) and Chief Judge (1975–1987) of the U.S. District Court for Western Washington.Walter McGovern, federal judge in Seattle for half a century, dies at 99 *Adrian Metcalfe, 79, British athlete, Olympic silver medalist (1964).Olympic medallist and athletics commentator Adrian Metcalfe dies *Brian Osborne, 81, English actor (Upstairs, Downstairs, The Sandbaggers).Brian Osborne *Virbhadra Singh, 87, Indian politician, MP (1962–1977, 1980–1984, 2009–2014), Chief Minister of Himachal Pradesh (1983–1990, 1993–1998, 2003–2007, 2012–2017) and Minister of Steel (2009–2011), problems caused by COVID-19.Former Himachal Pradesh chief minister Virbhadra Singh passes away *Bryan Watson, 78, Canadian ice hockey player (Detroit Red Wings, Pittsburgh Penguins, Washington Capitals).Former NHL defenseman Bryan 'Bugsy' Watson dies at 78 ===9=== *Matthew Cao Xiangde, 93, Chinese Roman Catholic prelate, Unmandated Archbishop of Hangzhou (since 2000).讣告：天主教杭州教区玛窦·曹湘德主教，于2021年7月9日下午16时26分，因病逝世，安息主怀。享年93岁。 *Jonathan Coleman, 65, Australian radio and television presenter (Studio 10), prostate cancer.Jonathan Coleman: Australian radio and television personality dies age 65 *Þórunn Egilsdóttir, 56, Icelandic politician, MP (since 2013), breast cancer.Þórunn Egilsdóttir er látin *Betty Gilderdale, 97, British-born New Zealand children's writer.Little Yellow Digger author Betty Gilderdale dies, aged 97 *Pentti Isotalo, 94, Finnish Olympic ice hockey player (1952) and referee (1964).Jääkiekkoleijona Pentti Isotalo on kuollut (death announced on this date) *Vladimir Karasev, 83, Russian chess player.Ушел из жизни В.И.Карасев *Gian Franco Kasper, 77, Swiss sports executive, President of the International Ski Federation (1998–2021). *Ngaire Lane, 95, New Zealand Olympic swimmer (1948).New Zealand's oldest Olympian Ngaire Galloway has passed away *Frank Lui, 85, Niuean politician, Premier (1993–1999).Former Niue premier Frank Lui passes away *Geoff Makhubo, 53, South African politician, Mayor of Johannesburg (since 2019), problems caused by COVID-19.Joburg mayor Geoff Makhubo dies of Covid complications *Paul Mariner, 68, English footballer (Plymouth Argyle, Ipswich Town, national team) and manager, brain cancer. *George Rhoads, 95, American sculptor and painter (Archimedean Excogitation).George Rhoads *Jehan Sadat, 87, Egyptian human rights activist and socialite, First Lady (1970–1981), cancer.Jihan al-Sadat passes away after short struggle with illness *Andy Williams, 49, American drummer (Casting Crowns), motorcycle crash.Andy Williams, former Casting Crowns drummer, dies after motorcycle accident ===10=== *Esther Béjarano, 96, German singer and Holocaust survivor (Women's Orchestra of Auschwitz).Holocaust survivor, singer Esther Bejarano dies, aged 96 *Byron Berline, 77, American fiddler.Byron Berline, Famed Fiddle Player, Owner Of Guthrie's Double Stop Fiddle Shop Dies At 77 *Carmel Budiardjo, 96, British-Indonesian human rights activist, founder of Tapol, Right Livelihood Award winner (1995). *Jean-Michel Dubernard, 80, French surgeon and politician, Deputy (1986–2007), heart attack.Lyon : le professeur Jean-Michel Dubernard est décédé *Gwendolyn Faison, 96, American politician, Mayor of Camden (2000–2010).Gwendolyn Faison, Camden’s first woman mayor, remembered as a ‘trailblazer’ *Travis Fulton, 44, American mixed martial artist and heavyweight boxer, suicide by hanging.Travis Fulton, man with most MMA fights, dead after apparent suicide in jail cell *Jimmy Gabriel, 80, Scottish football player (Dundee, Everton, Southampton) and manager.Jimmy Gabriel dead: Former Everton league title winner passes away aged 80 *Tadeusz Lewandowski, 77, Polish politician and trade unionist, Deputy (1991–1993) and Senator (1997–2001, 2005–2007).Zmarł Tadeusz Lewandowski *Kathi Mahesh, 43–44, Indian movie critic and actor (Hrudaya Kaleyam, Nene Raju Nene Mantri, Kobbari Matta), injuries from a car crash.Film critic Kathi Mahesh passes away *Dave O'Neal, 84, American politician and businessman, Sheriff of St. Clair County (1971–1977) and Lieutenant Governor of Illinois (1977–1981).Former St. Clair County sheriff, Illinois lieutenant governor dies at age 84 *Joachim Sauter, 61–62, German media artist and designer. *Dick Tidrow, 74, American baseball player (Cleveland Indians, New York Yankees, Chicago Cubs), World Series champion (1977, 1978).Dick Tidrow, former pitcher, Giants executive, dies at 74 ===11=== *Philippe Aigrain, 71, French computer scientist.Mort de Philippe Aigrain, des logiciels libres aux biens communs *Filippo Cavazzuti, 79, Italian economist and politician, Senator (1983–1996).Addio a Filippo Cavazzuti, maestro di economia e di signorilità *George Ciamba, 55, Romanian politician, Ambassador to Greece (2005–2012).A murit George Ciamba, ambasador al României în Grecia și cel care a coordonat Afacerile Europene când România a deținut președinția Consiliului UE *Jordi Cussà, 60, Spanish writer.Muere el escritor Jordi Cussà a los 60 años *Charlie Gallagher, 80, Scottish-Irish footballer (Celtic, Dumbarton, Ireland national team).Celtic hero Charlie Gallagher passes away aged 80, club confirm *Jerzy Janeczek, 77, Polish actor (Sami swoi, The Hourglass Sanatorium, Nie ma mocnych).Nie żyje Jerzy Janeczek. Filmowy Witia Pawlak z \"Samych swoich\" miał 77 lat *Anastasios Nerantzis, 76, Greek lawyer and politician, member (1974–2014) and Speaker (2007–2009) of the Hellenic Parliament.Tassos Nerantzis, former MP and deputy minister of ND, died *Laurent Monsengwo Pasinya, 81, Congolese Roman Catholic cardinal, Archbishop of Kisangani (1988–2007) and Kinshasa (2007–2018).Congo: è morto il Cardinale Laurent Monsengwo Pasinya *Renée Simonot, 109, French stage actress (Les Misérables).La mère de Catherine Deneuve, Renée Dorléac, est morte à l'âge de 109 ans *Sound Sultan, 44, Nigerian rapper, lymphoma.Nigerian singer Sound Sultan dies at 44 *John T. Traynor, 94, American politician, member of the North Dakota Senate (1991–2006).Longtime Devils Lake attorney, state senator Jack Traynor dies ===12=== *Edwin Edwards, 93, American politician, member of the U.S. House of Representatives from Louisiana's 7th congressional district (1965–1972) and Governor (1972–1980, 1984–1988, 1992–1996), respiratory failure caused by pneumonia.Former La. Governor Edwin Edwards has died at 93 *Ernie Moss, 71, English footballer (Chesterfield, Mansfield Town, Lincoln City). *Seán McCarthy, 84, Irish politician, TD (1981–1989) and Minister of State at the Department of Enterprise, Trade and Employment (1987–1989).Sad news of the passing of Dr Sean McCarthy, former government Minister and long serving public representative *Ben Ngubane, 79, South African politician, Minister of Arts and Culture (1994–1996, 1999–2004) and Premier of KwaZulu-Natal (1997–1999), COVID-19.Former KZN premier and Eskom board chair Ben Ngubane succumbs to Covid-19 *Bob Nakata, 80, American politician, member of the Hawaii House of Representatives (1983–1987) and State Senate (1999–2003).Former Hawaii Lawmaker Bob Nakata Dies At 80 *Paul Orndorff, 71, American Hall of Fame professional wrestler (WWF, WCW, GCW), dementia caused by CTE.Paul Orndorff, WWE Hall of Famer Known as ‘Mr. Wonderful,’ Dies at 71 *Paulose II, 74, Indian Malankara Orthodox Syrian prelate, Catholicos of the East (since 2010), problems caused by COVID-19.Kerala: Orthodox church supreme head Baselios Marthoma Paulose II passes away *Jean Pradel, 87, French lawyer and academic.Faculté de droit de Poitiers : le professeur Jean Pradel est décédé *Charlie Robinson, 75, American actor (Night Court, Sugar Hill, The Black Gestapo), problems caused by salivary gland cancer.Charlie Robinson, ‘Night Court’ Star, Dies at 75 *Matti Saarinen, 74, Finnish politician, MP (1987–1991, 1995–2015), pancreatic cancer.Pitkäaikainen kansanedustaja Matti Saarinen on kuollut *Mahmoud Shakibi, 94, Iranian footballer (Shahin, national team), heart attack.Ex-Iran defender Mahmoud Shakibi dies *Wolfgang Weingart, 80, German graphic designer and typographer.Wolfgang Weingart ===13=== *Alberto Dualib, 101, Brazilian football executive, Chairman of Sport Club Corinthians Paulista (1993–2007).Morre Alberto Dualib, ex-presidente do Corinthians, aos 101 anos *Shirley Fry Irvin, 94, American Hall of Fame tennis player, Grand Slam champion.Tennis Hall of Famer Shirley Fry Irvin dies at 94 *Margaret Richardson, 78, American lawyer and politician, Commissioner of Internal Revenue (1993–1997), problems caused by lung cancer.Margaret Richardson, IRS commissioner during Clinton’s first term, dies at 78 *Yashpal Sharma, 66, Indian cricketer (Punjab, Haryana, national team), World Cup champion (1983), cardiac arrest.Yashpal Sharma, 1983 World Cup winning cricketer, passes away *Pedro Wosgrau Filho, 73, Brazilian politician, Mayor of Ponta Grossa (1989–1993, 2005–2013), COVID-19.Ex-prefeito de Ponta Grossa, Pedro Wosgrau Filho morre por complicações da Covid-19 ===14=== *Christian Boltanski, 76, French sculptor, photographer and painter (Monument to the Lycée Chases), cancer.L'artiste plasticien Christian Boltanski, hanté par la mémoire et la mort, vient de disparaître à l'âge de 76 ans *Yekutiel Gershoni, 78, Israeli historian and runner, Paralympic silver medalist (1980).נפטר ההיסטוריון יקותיאל גרשוני, שאיבד את ידיו ועיניו וזכה במדליות פראלימפיות *Dan Forestal, 38, American politician, member of the Indiana House of Representatives (2012–2020).Dan Forestal, former Indiana lawmaker, dies at 38 *Mamnoon Hussain, 80, Pakistani politician and businessman, Governor of Sindh (1999) and President (2013–2018), cancer.Former president Mamnoon Hussain passes away in Karachi *Jeff LaBar, 58, American rock guitarist (Cinderella).Cinderella Guitarist Jeff LaBar Dead At 58 *Julian L. Lapides, 89, American politician, member of the Maryland House of Delegates (1963–1967) and State Senate (1967–1994), cancer.Julian ‘Jack’ Lapides, former Maryland state senator from Baltimore, dies *Kurt Westergaard, 86, Danish cartoonist (Jyllands-Posten Muhammad cartoons controversy) and teacher.Kurt Westergaard, Danish cartoonist behind Muhammad cartoon, dies at 86 ===15=== *Robert Abirached, 90, Lebanese- born French writer and theatrologist.Hommage de Roselyne Bachelot-Narquin à Robert Abirached *Rosario Casado, 60, Spanish pharmacist and politician, Senator (2004–2008).Fallece Rosario Casado, exportavoz municipal del PP *Andy Fordham, 59, English darts player, world champion (2004).Former world champion Andy Fordham passes away *Dawn Foster, 33, British journalist (The Independent, Tribune, The Guardian) and broadcaster.Tributes paid to writer Dawn Foster, who has died aged 34 (death announced on this date) *Yves Goussebaire-Dupin, 90, French politician, Mayor of Dax (1977–1995) and Senator (1983–1992).Dax : Yves Goussebaire-Dupin est décédé *Judith Keating, 64, Canadian politician, Senator (since 2020).New Brunswick Sen. Judith Keating dies at 58 *Yoel Kahn, 91, Russian-born American Chabad rabbi.Rabbi Yoel Kahn, leading student of Lubavitcher Rebbe, passes away *Jerry Lewis, 86, American politician, member of the California State Assembly (1969–1978) and United States House of Representatives (1979–2013).Former Rep. Jerry Lewis, who served the High Desert and other communities for nearly 50 years, dies at 86 *Pyotr Mamonov, 70, Russian rock guitarist (Zvuki Mu), COVID-19.Умер Петр Мамонов *Mohamed Nafa, 82, Israeli politician, member of Knesset (1990–1992).رحيل القائد الشيوعي الوطني الأديب محمد نفاع *William F. Nolan, 93, American author (Logan's Run) and screenwriter (Trilogy of Terror, Burnt Offerings), problems caused by sepsis.William F. Nolan (1928-2021) *Jaroslav Paška, 67, Slovak politician, member of the National Council (1994–2002, 2006–2009, 2016–2020) and MEP (2009–2014).Zomrel bývalý minister školstva a europoslanec Jaroslav Paška *Gira Sarabhai, 98, Indian architect, co-founder of NID.Gira Sarabhai, co-founder of NID, passes away at 98 *Danish Siddiqui, 38, Indian photojournalist (Reuters), Pulitzer Prize winner (2018), shot.Indian photojournalist Danish Siddiqui killed in Afghanistan clashes *Sergio Silvagni, 83, Australian footballer (Carlton).Carlton great Sergio Silvagni dies aged 83 *Soegiharto, 66, Indonesian politician, Minister of State Owned Enterprises (2004–2007).Mantan Menteri BUMN Sugiharto Meninggal Dunia *Hugo F. Sonnenschein, 80, American economist (Sonnenschein–Mantel–Debreu theorem), President of the University of Chicago (1993–2000). *Peter R. de Vries, 64, Dutch investigative journalist and crime reporter (Peter R. de Vries: Crime Reporter), problems caused by gunshot wounds.‘Fearless’ Dutch reporter Peter R de Vries dies after shooting ===16=== *Biz Markie, 57, American rapper (\"Just a Friend\") and actor (Men in Black II, Yo Gabba Gabba!), problems caused by diabetes.Biz Markie, the ‘Clown Prince of Hip-Hop,’ Dead at 57 *Doug Bennett, 75, American politician, member of the Michigan House of Representatives (2005–2010), motorcycle crash.Former state Rep. Doug Bennett dies in motorcycle crash *Desmond Fennell, 92, Irish writer, philosopher, and linguist.Intellectual and commentator Desmond Fennell dies aged 92 *José María Gay de Liébana, 68, Spanish economist, lawyer and academic, cancer.Fallece el economista José María Gay de Liébana *Libero De Rienzo, 44, Italian actor (Miele, La macchinazione, I Can Quit Whenever I Want), heart attack.Morto Libero De Rienzo: stroncato da un infarto a 44 anni *Jean-Marie Lang, 78, French academic and physician.Le décès de Jean-Marie Lang, pionnier alsacien de la lutte contre le sida *Pablo Pérez Tremps, 64, Spanish politician, lawyer and academic, member of the Constitutional Court (2004–2013).Fallece Pablo Pérez Tremps, magistrado del Tribunal Constitucional entre 2004 y 2013 *Hamid Reza Sadr, 65, Iranian football and movie critic, cancer.حمیدرضا صدر درگذشت *Harry M. Rosenfeld, 91, German-born American newspaper editor (The Washington Post), problems caused by COVID-19.A battling editor to the end: Harry Rosenfeld, 91 *Surekha Sikri, 76, Indian actress (Kissa Kursi Ka, Tamas, Mammo), cardiac arrest caused by multiple strokes.Actor Surekha Sikri dies of cardiac arrest ===17=== *Pilar Bardem, 82, Spanish actress (Good Morning, Little Countess, Nobody Will Speak of Us When We're Dead, The Doubt) and activist, Goya Award winner (1996), lung disease.Muere la actriz Pilar Bardem a los 82 años *John \"Bam\" Carney, 51, American politician, member (since 2009) and Majority Leader of the Kentucky House of Representatives (since 2019).Former Kentucky House Majority Floor Leader John 'Bam' Carney dies at 51 *Dolores Claman, 94, Canadian composer (The Hockey Theme), problems caused by dementia.Hockey Night in Canada theme song composer Dolores Claman dead at 94 (death announced on this date) *George Curtis, 82, English footballer (Coventry City, Aston Villa) and manager.George Curtis: Former Coventry City captain and manager dies, aged 82 *Williams Martínez, 38, Uruguayan footballer (Defensor Sporting, Cerro, national team), suicide.El fútbol uruguayo de luto tras el suicidio del futbolista Williams Martínez *Robby Steinhardt, 71, American singer and violinist (Kansas).Kansas violinist Robby Steinhardt dies, aged 71 *Sir Graham Vick, 67, English opera director, COVID-19.Obituary: Leading Opera Director Graham Vick Dies at 67 ===18=== *Mumtaz Bhutto, 87, Pakistani politician, Governor (1971–1972) and Chief Minister of Sindh (1972–1973).Former CM Sindh Mumtaz Bhutto passes away *Tommy Engstrand, 81, Swedish sports journalist and television host, COPD.Tommy Engstrand död - blev 81 år gammal *Toby Goodman, 72, American politician, member of the Texas House of Representatives (1991–2007), heart attack.'Bigger than life.' Former state Rep. Toby Goodman of Arlington dies at 72 *Bernie Hansen, 76, American politician, member of the Chicago City Council (1983–2002).Former longtime lakefront Ald. Bernie Hansen dies at 76 *Michel Husson, 72, French statistician and economist.Michel Husson: an activist in the economy and an economist who inspired politics *Bruce Kirby, 92, Canadian Olympic sailor (1956, 1964, 1968) and yacht designer.Bruce Kirby, designer, three-times Olympian, and sailing journalist dies at 92yrs. *Tom O'Connor, 81, British comedian and game show host (Crosswits, The Zodiac Game, Name That Tune), problems caused by Parkinson's disease.Comedian Tom O'Connor dies aged 81 *Philip Sherry, 87, New Zealand newsreader and politician.Iconic newsreader Philip Sherry dies at 87, 'peacefully and surrounded by family' *Nenad Stekić, 70, Serbian Olympic long jumper (1976, 1980, 1984), European Athletics silver medalist (1974, 1978).Preminuo Nenad Stekić *Enn Tarto, 82, Estonian dissident and politician.Ушел из жизни борец за свободу Эстонии, бывший советский диссидент Энн Тарто ===19=== *Kurt Clemens, 95, German footballer (1. FC Saarbrücken, FC Nancy, Saarland national team).Saar-Nationalspieler Kurt Clemens ist tot *Layne Flack, 52, American poker player.Layne Flack, Six-Time WSOP Bracelet Winner, Dead at 52 *Arturo Armando Molina, 93, Salvadoran politician and military officer, President (1972–1977).Fallece expresidente salvadoreño Arturo Armando Molina, a los 93 años *Emilio Mario Osmeña, 82, Filipino politician, Governor of Cebu (1988–1992), COVID-19. *Abel Ramírez Águilar, 78, Mexican sculptor.Fallece el escultor Abel Ramírez a los 78 años *Raymond Savard, 94, Canadian politician, MP (1977–1984) and Mayor of Verdun, Quebec (1985–1993). *Mary Ward, 106, Australian actress (Prisoner).Veteran Aussie actress Mary Ward dies at 106 *Chuck E. Weiss, 76, American singer-songwriter, inspiration for \"Chuck E.'s in Love\", cancer.Rickie Lee Jones remembers Chuck E. Weiss: 'He was a Svengali to Tom Waits and everyone who knew him' ===20=== *Françoise Arnoul, 90, Algerian-born French actress (Forbidden Fruit, French Cancan, The Devil and the Ten Commandments), problems caused by Alzheimer's disease.Décès de Françoise Arnoul, la \"Nini\" de \"French Cancan\" de Renoir *Jerry Granelli, 80, American- born Canadian jazz drummer (A Charlie Brown Christmas). *Curt-Eric Holmquist, 73, Swedish Eurovision conductor.Kapellmästaren Curt-Eric Holmquist är död *Ron Howard, 67, American politician, member of the Kansas House of Representatives (since 2019). *André Petit, 99, French politician, Mayor of Eaubonne (1965–2001) and Deputy (1978–1981).Val-d'Oise. L'ancien maire d'Eaubonne, André Petit, décédé à l'aube de ses 100 ans ===21=== *Lieb Bester, 72, South African musician and actor (The Making of the Mahatma, Stander, Winnie Mandela), COVID-19.Veteran actor Lieb Bester (72) dies *Jean- Pierre Jaussaud, 84, French racing driver (Formula Three), 24 Hours of Le Mans champion (1978, 1980), heart attack. *Tommy Leishman, 83, Scottish footballer (Liverpool, Stranraer, St Mirren). *Stan McKenzie, 77, American basketball player (Baltimore Bullets, Portland Trail Blazers).Original Blazer Stan McKenzie Passes Away *Uttam Nepali, 84, Nepali visual artist and writer, heart failure.Veteran artist Uttam Nepali dies at 85 *Desmond O'Malley, 82, Irish politician, TD (1968–2002), Minister for Industry and Commerce (1977–1981, 1989–1992) and Leader of the Progressive Democrats (1985–1993).Ex-Progressive Democrat leader Des O'Malley has died *Juan Vital Sourrouille, 80, Argentine politician and economist, Minister of the Economy (1985–1989), colorectal cancer.Murió Juan Vital Sourrouille, el ex ministro de Economía impulsor del Plan Austral ===22=== *Boris Chochiev, 63, South Ossetian politician, Prime Minister (2008), COVID-19.Скончался государственный и политический деятель Южной Осетии Борис Чочиев *Jean-Yves Lafesse, 64, French actor (Baby Blood, La Classe américaine, Heartbreaker and comedian, problems caused by ALS.L'humoriste Jean-Yves Lafesse est mort *Greg Knapp, 58, American football coach (New York Jets, Atlanta Falcons), injuries from a bike accident.Jets assistant Greg Knapp has reportedly died as result of bike accident *Gary Leif, 64, American politician, member of the Oregon House of Representatives (since 2018), cancer.Oregon state representative Gary Leif dies in Roseburg *Dan Logue, 70, American politician, member of the California State Assembly (2008–2014).Former Assemblyman Dan Logue dies at 71 *Palo Pandolfo, 56, Argentine singer-songwriter and musician (Don Cornelio y la Zona).Murió el cantautor del rock argentino Palo Pandolfo, a los 56 años *Danny Riesterer, 82, Belgian actor (Recht op Recht, Familie, Zone Stad).‘Familie’-acteur Danny Riesterer overleden *Mike Smith, 83, English footballer (Corinthian Casuals) and manager (Wales national team, Egypt national team).Mike Smith: Former Wales and Hull City manager dies, aged 83 (death announced on this date) *Ana María Ventura, 98, Spanish actress (La colmena, The House of Bernarda Alba, Dear Nanny).Muere Ana María Ventura a los 98 años, actriz de películas como 'Nunca pasa nada' o 'La casa de Bernarda Alba' ===23=== *Fakir Alamgir, 71, Bangladeshi folk singer, COVID-19.Folk singer Fakir Alamgir no more *Alfred Biolek, 87, German entertainer and television producer (Monty Python's Fliegender Zirkus).Alfred Biolek gestorben *Dieter Brummer, 45, Australian actor (Home and Away, Neighbours, Underbelly: The Golden Mile).Dieter Brummer, who played Shane Parrish on Home and Away, has died age 45 *John Cornell, 80, Australian movie producer, writer (Crocodile Dundee, Crocodile Dundee II) and actor (The Paul Hogan Show), problems caused by Parkinson's disease.Comedian John Cornell dies aged 80 *F. C. Gundlach, 95, German photographer.F.C. Gundlach mit 95 Jahren gestorben *Michel Guyard, 85, French Roman Catholic prelate, Bishop of Le Havre (2003–2011).Normandie. Mgr Michel Guyard était l'évêque du Havre *David Lust, 53, American politician, member of the South Dakota House of Representatives (2007-2015, 2016-2019), heart attack.David Lust, past South Dakota lawmaker, dies of suspected heart attack *Toshihide Maskawa, 81, Japanese physicist (Cabibbo–Kobayashi–Maskawa matrix), Nobel Prize winner (2008), jaw cancer.ノーベル物理学賞受賞 益川敏英さん死去 81歳 *Nicola Tranfaglia, 82, Italian historian and politician, Deputy (2006–2008).Addio a Nicola Tranfaglia: lo storico e ricercatore morto a 83 anni *Steven Weinberg, 88, American theoretical physicist (Electroweak interaction), Nobel Prize winner (1979). *Tuomo Ylipulli, 56, Finnish ski jumper, Olympic champion (1988).Lapin Kansa: Olympiavoittaja Tuomo Ylipulli, 56, on kuollut ===24=== *Rodney Alcala, 77, American serial killer and rapist.Infamous ‘Dating Game Killer’ Rodney Alcala Dies Of Natural Causes *Alain Barrau, 74, French politician, Deputy (1986–1993, 1997–2002) and Mayor of Béziers (1989–1995), cerebrovascular disease.L'ancien maire de Béziers, Alain Barrau, est décédé à l'âge de 74 ans *Jahanara Begum, 79, Bangladeshi politician, MP (1991–1996) and Minister of Cultural Affairs (1991–1995), cardiac arrest.Ex-state minister prof Jahanara Begum passes away *Herbert Köfer, 100, German actor (Reserved for the Death, Naked Among Wolves, Hands Up or I'll Shoot).Schauspieler Herbert Köfer mit 100 Jahren gestorben *Jackie Mason, 93, American comedian and actor (The Simpsons, The Jerk, Caddyshack II), Tony (1987) and Emmy winner (1988, 1992).Jackie Mason Dies: Rabbi Who Later Rose To Fame As A Comedian, Actor & Author Was 93 *Virgílio Pereira, 80, Portuguese academic and politician, Mayor of Funchal (1974–1983, 1994), Deputy (1983–1986) and MEP (1986–1994).Morreu Virgílio Pereira *Marco Antonio Raupp, 83, Brazilian mathematician and politician, Minister of Science, Technology and Innovation (2012–2014), respiratory failure caused by brain cancer.Morre aos 83 anos ex- ministro da Ciência, Marco Antônio Raupp *Alfie Scopp, 101, English-born Canadian actor (Tales of the Wizard of Oz, Fiddler on the Roof, Rudolph the Red-Nosed Reindeer).Alfie Scopp *Johnny Young, 80–81, American politician, Ambassador to Sierra Leone (1989–1992), Togo (1994–1997), Bahrain (1997–2001) and Slovenia (2001–2004), pancreatic cancer.Umrl je Johnny Young, nekdanji ameriški veleposlanik v Sloveniji ===25=== *Otelo Saraiva de Carvalho, 84, Portuguese Army colonel and politician, Chief Strategist of the Carnation Revolution and Leader of the FP 25 de Abril, 1976 and 1980 presidential candidate, heart failure.Morreu o capitão de Abril Otelo Saraiva de Carvalho *Jean-François Istasse, 70, Belgian politician, Deputy (1995–2014, 2018–2019).Le verviétois Jean-François Istasse, ancien président du parlement de la Fédération Wallonie-Bruxelles, est décédé *Jing Wang, 71, Taiwanese media scientist, founder of NGO2.0, heart attack.Jing Wang, professor of Chinese media and cultural studies, dies at 71 *Bob Moses, 86, American civil rights activist (SNCC), co-founder of the Mississippi Freedom Democratic Party. *Eddy Posthuma de Boer, 90, Dutch photographer.Eddy Posthuma de Boer, 'fotograaf met liefde voor de mens', overleden *Rosine Vieyra Soglo, 87, Beninese politician, First Lady (1991–1996), member of the Pan-African Parliament (2004–2009) and MNA (since 2015).Bénin: l’ex-première dame, Rosine Soglo est décédée *Henri Vernes, 102, Belgian author (Bob Morane).Henri Vernes, créateur de Bob Morane, est mort ===26=== *Rick Aiello, 65, American actor (Twin Peaks: Fire Walk with Me, Do the Right Thing, The Sopranos), pancreatic cancer.Danny Aiello's Son Rick Aiello Dead at 65 *Albert Bandura, 95, Canadian-American psychologist, congestive heart failure.Albert Bandura, Leading Psychologist of Aggression, Dies at 95 *Július Binder, 89, Slovak engineer and politician, Deputy (1998–2002).Zemřel vodohospodář Július Binder, „otec“ vodního díla Gabčíkovo *Aaron L. Brody, 90, American food scientist, problems caused by Alzheimer's disease.Aaron Brody *Alfred Chupin, 104, French politician, Mayor of Brest (1947–1953) and Deputy (1951–1955).L'ancien maire de Brest Alfred Chupin s'est éteint *Brazo de Plata, 58, Mexican professional wrestler (WWE, Alvarado wrestling family).Murió Súper Porky, Brazo de Plata, leyenda de la Lucha Libre *Ally Dawson, 63, Scottish footballer (Rangers, Blackburn Rovers, Airdrieonians) and manager.Ally Dawson dead at 63 as Rangers legend and Scotland international passes away *Mike Enzi, 77, American politician, Mayor of Gillette (1975–1983) and U.S. Senator from Wyoming (1997–2021), injuries caused by a bike accident. *Kåre Gjønnes, 79, Norwegian politician, Minister of Agriculture (1997–2000) and Nordic Cooperation (2000).Kåre Gjønnes er død *Bernardo Guerra Serna, 90, Colombian politician, member (1982–1986) and President (1982–1983) of the Senate.Murió líder político antioqueño Bernardo Guerra Serna *Mike Howe, 55, American heavy metal singer (Metal Church, Heretic).Metal Church Singer Mike Howe Dead At 55 *Jayanthi, 76, Indian actress (Jenu Goodu, Miss Leelavathi, Edhir Neechal).Veteran actress Jayanthi no more; dies in her sleep *Joey Jordison, 46, American heavy metal punk musician (Slipknot, Murderdolls, Sinsaenum), problems caused by transverse myelitis.Joey Jordison, founding Slipknot drummer, dead at 46 *René Juárez Cisneros, 65, Mexican economist and politician, Governor of Guerrero (1999–2005), Deputy (since 2018) and President of PRI (2018), COVID-19.Muere René Juárez Cisneros, líder del PRI en la Cámara de Diputados por complicaciones de la covid-19 *Elad Peled, 93, Israeli Defense Forces general.אלוף אלעד פלד, מאחרוני מפקדי מלחמת העצמאות וששת הימים, מת בגיל 93 *Dídac Pestaña, 63, Spanish politician, Mayor of Gavà (1985–2005).Muere el histórico alcalde de Gavà Dídac Pestaña *Gogó Rojo, 78, Argentine vedette and actress (Cry Chicago, Hay que romper la rutina), cardiorespiratory arrest.A los 78 años, murió Gogó Rojo *Grethe Rostbøll, 80, Danish politician, Minister for Culture (1990–1993) and member of the Folketing (1995, 1996–1998).Forhenværende kulturminister Grethe Rostbøll er død *Ivan Toplak, 89, Serbian footballer (Red Star Belgrade) and manager (Oakland Clippers, Yugoslavia national football team).Umrl je Ivan Toplak, jugoslovanska in slovenska nogometna legenda ===27=== *Sergio Asti, 95, Italian designer and architect.Addio a Sergio Asti architetto visionario *Meriem Belmihoub, 86, Algerian independence fighter and lawyer.Meriem Belmihoub Zerdani nous a quittés *Orlando Drummond, 101, Brazilian actor (Escolinha do Professor Raimundo) and comedian.Morre o ator Orlando Drummond, o 'Seu Peru' da 'Escolinha do Professor Raimundo' *Saginaw Grant, 85, American Sac and Fox actor (The Lone Ranger, Community, Breaking Bad).American Indian Actor Saginaw Grant, 85, Passes Away *Mo Hayder, 59, British writer (Birdman, The Treatment, Pig Island), problems caused by motor neurone disease.'Extraordinary' crime writer Mo Hayder dies of motor neurone disease *Mike Hendrick, 72, English cricketer (Nottinghamshire, Derbyshire, national team).Mike Hendrick, Former Derbyshire and England Seamer Dies Aged 72 *Stefan Michnik, 91, Polish military judge and Communist security agent.Nie żyje Stefan Michnik, brat redaktora naczelnego „Gazety Wyborczej”. Miał 92 lata *Gianni Nazzaro, 72, Italian singer and actor (Ma che musica maestro, Scandalo in famiglia, Impotenti esistenziali), lung cancer.È morto Gianni Nazzaro, il cantante di 'Quanto è bella lei' *Orestes Ojeda, 65, Filipino actor (Zoom, Zoom, Superman!, Manila by Night, Rosa Mistica), pancreatic cancer.Orestes Ojeda passes away at 65 (death announced on this date) *Jean-François Stévenin, 77, French actor (The Dogs of War, Cold Moon, Sushi Sushi) and filmmaker.L’acteur et réalisateur Jean-François Stévenin est mort *Wen Shizhen, 81, Chinese politician, Governor of Liaoning (1994–1998) and member of the CPC Central Committee (1997–2007).辽宁省委原书记闻世震逝世 享年81岁 ===28=== *Oleg Baklanov, 89, Russian politician, Minister of General Machine Building (1983–1988).Умер экс-руководитель ракетно-космической отрасли СССР Олег Бакланов *Porfirio Armando Betancourt, 63, Honduran footballer (Strasbourg, Marathón, national team), COVID-19.World Cup player with Honduras dies in Spain 82 Porfirio Armando Betancourt, victim of Covid-19 – Diez *Roberto Calasso, 80, Italian writer and publisher (Adelphi Edizioni).Addio a Roberto Calasso, lo scrittore editore di Adelphi *István Csom, 81, Hungarian chess grandmaster.Meghalt az olimpiai bajnok magyar sakkozó *Satsuki Eda, 80, Japanese politician, member (1977–2019) and President of the House of Councillors (2007–2010) and Minister of Justice (2011), pneumonia.元参議院議長の江田五月氏がけさ死去 80歳 *Nancy Frankel, 92, American sculptor, murdered by suffocation.Kensington woman arrested on a charge of killing her 92-year-old roommate *Pete George, 92, American weightlifter and academic, Olympic champion (1952) and silver medalist (1948, 1956).Pete George *Dusty Hill, 72, American Hall of Fame musician (ZZ Top) and singer-songwriter (\"Tush\").ZZ Top bassist Dusty Hill dead at 72 *Dick Long, 97, Australian politician, Victorian MLC (1973–1992).Richard John Long *Bent Melchior, 92, Danish religious leader, Chief Rabbi of Denmark (1969–1996), heart attack.Bent Melchior er død *Barbara Połomska, 87, Polish actress (Shadow, Eroica, The Eighth Day of the Week).Barbara Połomska nie żyje. \"Polska Brigitte Bardot\" miała 87 lat *Ron Popeil, 86, American businessman (Ronco).Ron Popeil Infomercial King Dead at 86 *Clive Scott, 84, South African actor (My Way, Beat the Drum, Winnie Mandela).Tributes pour in for TV veteran and comedian Clive Scott who has died aged 84 *Ben Wagin, 91, German artist. *Johnny Ventura, 81, Dominican musician and politician, Mayor of Santo Domingo (1998–2002), heart attack.Muere de un infarto el merenguero dominicano Johnny Ventura, en SD ===29=== *Janet Banana, 83, Zimbabwean socialite, First Lady (1980–1987), kidney failure.Former First Lady, Janet Banana, Dies Aged 83 *Jaime Chamorro Cardenal, 86, Nicaraguan journalist (La Prensa) and guerrilla.Nicaragua: Jaime Chamorro Cardenal, presidente y director del diario La Prensa, muere a los 86 años *Robert Dove, 82, American political scientist and academic, Parliamentarian of the U.S. Senate (1981–1987, 1995–2001).Senator McConnell Pays Tribute to Former Senate Parliamentarian Bob Dove *Phillip King, 87, British sculptor.Phillip King, Influential British Sculptor, Has Died at 87 *Richard Lamm, 85, American politician, Governor of Colorado (1975–1987), 1996 presidential candidate, problems caused by a pulmonary embolism.Former Colorado Governor Richard ‘Dick’ Lamm Dies at 85 *John Landon, 71, American politician, member of the Iowa House of Representatives (since 2013).Iowa state Rep. John Landon dies at 71 *Carl Levin, 87, American politician, U.S. Senator from Michigan (1979–2015), lung cancer.Carl Levin, Michigan U.S. senator for 36 years, dead at 87 *Janice Mirikitani, 80, American poet and political activist.Janice Mirikitani, Glide co-founder, activist and S.F. poet laureate, dies suddenly *Geraldo Francisco dos Santos, 59, Brazilian footballer (Club América, Club Necaxa, Monterrey).Falleció 'Zizinho', padre de Jonathan y Giovani dos Santos *Armen Shekoyan, 68, Armenian novelist and poet.На 68-м году жизни скончался армянский писатель Армен Шекоян *Albert Vanhoye, 98, French Roman Catholic cardinal, Deacon of Santa Maria della Mercede e Sant'Adriano a Villa Albani (since 2006).Le cardinal français Albert Vanhoye est décédé ===30=== *Daniel Delgado, 73, Panamanian lawyer, military officer and politician, Minister of Government and Justice (2007–2008).Falleció Daniel Delgado Diamante *Hüseyin Avni Coş, 61–62, Turkish politician, Governor of Sakarya (2014–2017).Eski vali Hüseyin Avni Coş hayatını kaybetti *Shona Ferguson, 47, South African actor (Generations, Isidingo, Muvhango) and producer, COVID-19.Shona Ferguson, 47, has died *Italo Vassallo, 80, Ethiopian footballer (Cotton Factory Club, national team).È morto Italo Vassallo, col fratello portò l’Etiopia ai vertici del calcio *Thea White, 81, American actress (Courage the Cowardly Dog), infection caused by liver surgery. ===31=== *Herminio Aquino, 72, Filipino businessman and politician, member of the House of Representatives (1987–1998).Former lawmaker Herminio Aquino dies *Paco Cabanes Pastor, 67, Spanish Valencian pilota player, cancer.Fallece Paco Cabanes, El Genovés, el mejor pilotari valenciano de la historia *Chin Sian Thang, 83, Burmese politician, MP (1990–2010), COVID-19.ဝါရင့္ႏိုင္ငံေရးသမားႀကီး ဇိုမီးေခါင္းေဆာင္ပူက်င့္ရွန္းထန္ကြယ္လြန္ *Terry Cooper, 77, English footballer (Leeds United, national team) and manager (Bristol City).RIP Terry Cooper (death announced on this date) *Man Kaur, 105, Indian masters track and field athlete, heart attack caused by gallbladder cancer.इंटरनेशनल मास्टर एथलीट मान कौर की जिंदगी की दौड़ पूरी, चंडीगढ़ में 105 वर्ष की उम्र में निधन इंटरनेशनल मास्टर एथलीट मान कौर की फाइल फोटो। *Jerzy Matuszkiewicz, 93, Polish jazz musician and composer.Jerzy \"Duduś\" Matuszkiewicz nie żyje. Legendarny jazzman i kompozytor miał 93 lata ==Months== * January * February * March * April * May * June * July ==Related pages== * List of deaths due to COVID-19 * 2021 in association football deaths * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *07 Category:July 2021 events",
 "title": "Deaths in July 2021"
}