{
 "id": "804754",
 "text": "The following is a list of deaths that should be noted in March 2021. For earlier or later deaths, please see \"Months\". Names under each day are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no source is included, the death notice will be removed. If you add a death, you must include: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==March== ===1=== *Flex- Deon Blake, 58, American pornographic actor (Niggas' Revenge).Adult film star Flex Deon has passed away *Sir Alan Bowness, 93, British art historian, Director of the Tate Gallery (1980–1988).Former Tate director Sir Alan Bowness dies aged 93 *Hauk Buen, 87, Norwegian fiddler.Hauk Buen er død *Frederico Campos, 93, Brazilian politician, Mayor of Cuiabá (1966–1969, 1989–1992) and Governor of Mato Grosso (1979–1983), problems caused by COVID-19.Frederico Campos, ex-governador de MT, morre por complicações da covid-19 *Emmanuel Félémou, 60, Guinean Roman Catholic prelate, Bishop of Kankan (since 2007), COVID-19.Bishop Emmanuel Félémou *Ferdinand Ghesquière, 88, Belgian politician, member of the Chamber of Representatives (1985–1987, 1991–1999) and Senate (1987–1991).Oud-politicus Fernand Ghesquiere overleden op 88ste verjaardag *Michael Gudinski, 68, Australian music industry executive, co- founder of Mushroom Records, heart attack.Michael Gudinski: Australian music industry icon dies aged 68 *Bernard Guyot, 75, French Olympic racing cyclist (1964).L'ancien coureur Bernard Guyot est décédé *Vladimír Heger, 89, Czech basketball player (ATK Praha) and coach (Sparta Praha, Czechoslovakia national team).Voormalig bondscoach Vladimir Heger op 89-jarige leeftijd overleden *Vernon Jordan, 85, American businessman and civil rights activist.Vernon Jordan, civil rights leader and close ally of Bill Clinton, dies *Zlatko Kranjčar, 64, Croatian footballer (Dinamo Zagreb, Rapid Wien) and manager (national team).Ex-Iran U23 coach Zlatko Kranjcar passes away *Pietro Larizza, 85, Italian trade unionist and politician, Secretary General of Italian Labour Union (1992–2000) and Senator (2007–2008).Morto Pietro Larizza, leader della Uil dal 1992 al 2000 *Andrea Nannini, 76, Italian Olympic volleyball player (1976).È morto Andrea Nannini: volley italiano in lutto *Helena Pietraszkiewicz, 68, Polish politician and psychologist, Voivode of Łódź (2006–2007).Nie żyje Helena Pietraszkiewicz. Była przewodniczącą Rady Miasta Lublin i wojewodą łódzkim *Enrique San Francisco, 65, Spanish actor (Colegas, Navajeros, El pico) and comedian, sepsis caused by pneumonia.Enrique San Francisco muere a los 65 años víctima de una neumonía bilateral *Toko Shinoda, 107, Japanese artist.Renowned Japanese sumi ink artist Toko Shinoda dies at 107 *Ian St John, 82, Scottish Hall of Fame footballer (Motherwell, Liverpool, national team) and manager.Liverpool legend Ian St John has died aged 82 *Mikhail Studenetsky, 86, Russian basketball player, Olympic silver medalist (1956), COVID-19.Умер серебряный призер Олимпиады-1956 Михаил Студенецкий *Ngai Tupa, 84, Cook Islands politician, MP (2006–2010).'One of a kind' Mama Ngai Tupa *Anatoliy Zlenko, 82, Ukrainian politician, Minister of Foreign Affairs (1990–1994, 2000–2003) and Permanent Representative to the United Nations (1994–1997).Помер перший глава МЗС України Анатолій Зленко ===2=== *Czesław Baran, 83, Polish politician and agronomist, Deputy (1985–1989).Zmarł były poseł Czesław Baran *Chris Barber, 90, English jazz bandleader and trombonist (\"Petite Fleur\"), problems caused by dementia.Chris Barber (17 April 1930 - 2 March 2021) *George Bass, 88, American archaeologist, pioneer of underwater archaeology.Underwater archaeology pioneer George Bass dies at 88 *Àlex Casademunt, 39, Spanish pop singer (Operación Triunfo 2001), actor and television presenter (Los Lunnis), car crash.Muere Álex Casademunt, concursante de 'OT 1', a los 39 años *Nandkumar Singh Chauhan, 68, Indian politician, MP (1996–2009, since 2014), COVID-19.BJP MP Nand Kumar Singh Chauhan passes away *Werner Dörflinger, 80, German politician, MP (1980–1998).Zum Tod von Werner Dörflinger: Der ehemalige CDU- Bundestagsabgeordnete war stets eine starke Stimme in Tiengen und Bonn *Peter Grosser, 82, German footballer (1860 Munich, national team) and manager (SpVgg Unterhaching).Meister-Löwe Peter Grosser ist tot - Trauer beim TSV 1860 München *Louise McBee, 96, American politician, member of the Georgia House of Representatives (1993–2005).Former UGA administrator and Athens state rep Louise McBee dies at 96 *Stan Newens, 91, British politician, MP (1964–1970, 1974–1983) and MEP (1984–1999).Stan Newens obituary *Carlos Sánchez, 68, Argentine comedian and actor (Videomatch, Cantando por un sueño, Susana Giménez), cancer.Murió el humorista Carlos Sánchez *Bunny Wailer, 73, Jamaican reggae singer (Bob Marley and the Wailers) and songwriter (\"Electric Boogie\"), Grammy winner (1991, 1995, 1997), problems caused by a stroke.Bunny Wailer: Reggae legend who played with Bob Marley dies, aged 73 *Edward C. Waller III, 95, American Navy vice admiral.Edward Waller *Zhou Yulin, 98, Chinese mathematician, member of the Chinese Academy of Sciences (since 1991).送别！数学家周毓麟院士逝世 ===3=== *Medea Abrahamyan, 88, Armenian cellist.Կյանքից հեռացել է հանրահայտ թավջութակահար Մեդեա Աբրահամյանը *Tomas Altamirano Duque, 93, Panamanian politician, Vice President (1994–1999).Falleció el exvicepresidente Tomás Gabriel Altamirano Duque *Joe Altobelli, 88, American baseball player (Cleveland Indians, Minnesota Twins), manager (Baltimore Orioles, San Francisco Giants), and coach.Joe Altobelli dies: Rochester's 'Mr. Baseball' led Orioles to last title *Władysław Baka, 82, Polish economist, activist and politician, President of the National Bank of Poland (1981–1985, 1989–1991).Prof. Władysław Baka nie żyje. Bankowiec, ekonomista, b. prezes NBP *Sérgio Eduardo Castriani, 66, Brazilian Roman Catholic prelate, archbishop of Manaus (2012–2019), septicemia.Morre Arcebispo Emérito de Manaus Dom Sergio Castriani *Jim Crockett Jr., 76, American professional wrestling promoter (Jim Crockett Promotions), problems caused by multiple organ failure.Legendary Pro Wrestling Promoter Jim Crockett Jr. Dead at 76 *Sarah Everard, 33, English marketing executive, murdered.Sarah Everard’s body found in builder’s bag, court told *Kelly Flynn, 66, American politician, member of the Montana House of Representatives (2011–2019), lung and kidney cancer. *József Gurovits, 92, Hungarian sprint canoer, Olympic bronze medalist (1952).Meghalt Gurovits József olimpiai bronzérmes kajakozó *John Sackett, 76, American politician, member of the Alaska House of Representatives (1967–1971) and State Senate (1973–1987).Longtime Alaska lawmaker and Native leader John Sackett has died at age 76 *Pedro Jiménez Galán, 101, Spanish politician and historian, Deputy (1977–1979).Muere a los 101 años Pedro Jiménez Galán, político socialista afincado en Chiclana que formó parte de las Cortes Constituyentes *Jeroen van Merwijk, 65, Dutch comedian, painter and songwriter, colorectal cancer.Cabaretier Jeroen van Merwijk (65) overleden *Klara Marinova, 71, Bulgarian politician and journalist, member of the National Assembly (1990–1997).Почина Клара Маринова *Katharina Matz, 90, Czech-born German actress (The Man Who Sold Himself, Special Mission, The Wonderful Years).Trauer um Schauspielerin Katharina Matz *Nicola Pagett, 75, Egyptian- born British actress (The Viking Queen, Anne of the Thousand Days, There's a Girl in My Soup), brain cancer.Nicola Pagett obituary *Ruy Scarpino, 59, Brazilian football manager (Imperatriz, Ceará, Ituano), COVID-19.Morre Ruy Scarpino, técnico de títulos e acesso no futebol do Maranhão *Edward Sandoval, 74, American politician, member of the New Mexico House of Representatives (1983–2015).Longtime state Rep. Ed Sandoval remembered as ‘faithful public servant’ *Larry Wahl, 67, American sports broadcaster (Miami Hurricanes, New York Yankees) and communications executive (Orange Bowl), problems caused by multiple myeloma.South Florida loses media 'icon' as former Hurricanes, OB executive Larry Wahl dies ===4=== *Alan Cartwright, 75, English rock bassist (Procol Harum), stomach cancer.Procol Harum’s former bassist Alan Cartwright has died *Colby Chandler, 95, American businessman, CEO of Kodak (1983–1990).Former Kodak CEO and Chairman dies *Phil Chisnall, 78, English footballer (Manchester United, Liverpool, Southend United).Phil Chisnall dead: Former Liverpool and Man Utd star passes away aged 78 *Roger Coekelbergs, 100, Belgian academic and resistance fighter.Het is met grote droefheid dat we het overlijden van Roger Coekelbergs hebben vernomen *Osman Erbaş, 58, Turkish Army lieutenant general, helicopter crash.Şehit Korgeneral Osman Erbaş kimdir? Korgeneral Osman Erbaş aslen nereliydi, kaç yaşındaydı? İşte bilinmeyenleri... *Francis Van den Eynde, 74, Belgian politician, member of the Chamber of Representatives (1991–2000).Voormalig volksvertegenwoordiger Francis Van den Eynde overleden *István Fehér, 66, Hungarian Olympic wrestler (1980).István Fehér (death announced on this date) *Walter Gretzky, 82, Canadian ice hockey coach, father of Wayne Gretzky.Canada’s Hockey Dad Walter Gretzky passes away at 82 *Paulette Guinchard-Kunstler, 71, French politician, Deputy (1997–2001, 2002–2007), assisted suicide.Décès de Paulette Guinchard, ancienne députée du Doubs et secrétaire d'Etat aux personnes âgées *Zygmunt Hanusik, 76, Polish Olympic cyclist (1968).Kolarstwo. Zygmunt Hanusik nie żyje *Tony Hendra, 79, British comedian and actor (This Is Spinal Tap), problems caused by ALS.Tony Hendra Dies: ‘This Is Spinal Tap’ Actor Who Miscalculated Stonehenge Was 79 *Hossain Toufique Imam, 82, Bangladeshi political advisor, kidney disease.HT Imam no more *Hugh Newell Jacobsen, 91, American architect, problems caused by pneumonia.Hugh Newell Jacobsen, award-winning modernist architect, dies at 91 *Atanasije Jevtić, 83, Serbian-born Bosnian Orthodox hierarch, Bishop of Zahumlje and Herzegovina (1992–1999), problems caused by COVID-19.Bishop Atanasije Jevtić of Serbian Orthodox Church fell asleep in the Lord (upd) *Johannes Kert, 61, Estonian politician and military officer, commander of the Estonian Defence Forces (1996–2000).Suri endine kaitseväe juhataja Johannes Kert *Heinz Klevenow Jr., 80, German actor (Entlassen auf Bewährung, Chingachgook, die große Schlange).Publikumsliebling Heinz Klevenow ist verstorben *František Lízna, 79, Czech Jesuit priest, Charter 77 signer, recipient of the Order of Tomáš Garrigue Masaryk, COVID-19.Zemřel bývalý chartista a katolický kněz František Lízna. Staral se o chudé a vězně *Paul McMullen, 49, American Olympic middle-distance runner (1996), skiing accident. *Mark Pavelich, 63, American ice hockey player (New York Rangers, Minnesota North Stars, San Jose Sharks), Olympic champion (1980), problems caused by CTE.'Miracle' Hockey Star Mark Pavelich Found Dead in Treatment Facility *David Schindler, 80, American-Canadian limnologist.'Canada's leading ecologist': David Schindler dead at 80 *Chris Schultz, 61, Canadian football player (Toronto Argonauts, Dallas Cowboys) and sportscaster (TSN), heart attack.Chris Schultz passes away at 61 *Tengiz Sichinava, 48, Georgian football player (Dinamo Batumi, national team) and manager (Gagra). *Jimmy Spratt, 69, Northern Irish politician, MLA (2007–2015).Tributes as former DUP MLA Jimmy Spratt dies aged 69 ===5=== *David Bailie, 83, South African-born British actor (Doctor Who, Blake's 7, Pirates of the Caribbean movie series) and photographer.L’acteur David Bailie est mort à l’âge de 83 ans *Jerzy Boniecki, 87, Polish Olympic swimmer (1952).Łódź. Zmarł Jerzy Boniecki. Ostatnie pożegnanie w poniedziałek *Patrick Dupond, 61, French dancer (Opéra National).Franse sterdanser Patrick Dupond overleden *Don Gile, 85, American baseball player (Boston Red Sox). *Paul Foster, 89, American playwright, founder of the La MaMa Experimental Theatre Club.Paul Foster, Innovative Playwright And Founding Member Of La MaMa, Dies At 89 *Frank J. Kelley, 96, American politician and lawyer, Attorney General of Michigan (1961–1999). *Gerald Kogan, 87, American politician and lawyer, Judge of the Supreme Court of Florida (1987–1998). *Stig Malm, 79, Swedish trade unionist, Chairman of LO (1983–1993), COVID-19.Tidigare LO-ordförande Stig Malm är död – blev 79 år *Margarita Maslennikova, 92, Russian cross-country skier, world champion (1954).В Петербурге скончалась советская лыжница Маргарита Масленникова *Birgitta Rasmusson, 81, Swedish television personality and cookbook writer.”Hela Sverige bakar”-profilen Birgitta Rasmusson är död *Janet Sawbridge, 73–74, British ice dancer and figure skating coach, World Figure Skating bronze (1964, 1968) and silver medalist (1965).In memoriam – Janet Anne Sawbridge MBE 1947–2021 *Samuel J. Scott, 82, American engineer (Langley Research Center).Samuel J. Scott Jr. *José Carlos da Silva Júnior, 94, Brazilian businessman and politician, Vice-Governor of Paraíba (1983–1986) and Senator (1996–1999), COVID-19.Presidente do Grupo São Braz, José Carlos da Silva Júnior morre aos 94 *Michael Stanley, 72, American rock guitarist and singer-songwriter, lung cancer.Michael Stanley, Cleveland rock legend and noted local radio and TV personality, dead at 72 *Adelio Terraroli, 89, Italian politician, Deputy (1968–1979).Addio all’onorevole Terraroli Il suo Pci a difesa del pluralismo sociale *Carlo Tognoli, 82, Italian politician, Mayor of Milan (1976–1986), MEP (1984–1987) and Deputy (1987–1994), problems caused by COVID-19.Milano, è morto l'ex sindaco socialista Carlo Tognoli: aveva 82 anni *Anton Urban, 87, Slovak footballer (Slovan Bratislava, Wacker Innsbruck) and manager (Petržalka), Olympic silver medalist (1964).Zomrel Anton Urban, legenda Slovana Bratislava aj slovenského futbalu ===6=== *Bengt Åberg, 76, Swedish motocross racer.Vi har sorg! *Franco Acosta, 25, Uruguayan footballer (Fénix, Villarreal B, Plaza Colonia), drowning.Ex-Villarreal B player Franco Acosta passes away in Uruguay *Katja Behrens, 78, German writer and translator.Katja Behrens *Joaquin Bernas, 88, Filipino Jesuit priest, lawyer and academic, President of the Ateneo de Manila University (1984–1993).Father Joaquin Bernas, Constitutionalist, Passes Away *Chi Shangbin, 72, Chinese footballer (national team) and manager (Dalian Wanda, Dalian Aerbin), heart attack.媒体：大连足球名宿迟尚斌因病去世，享年72岁 *Jude Patrick Dougherty, 90, American philosopher.Dr. Jude Patrick Dougherty *Abdul Ghani Gilong, 88, Malaysian politician, MP (1969–1978), Minister of Transport (1970–1971) and Works (1972–1974, 1976–1978), COVID-19.Sabah veteran politician and former Federal Minister Ghani Gilong dies *Vilém Holáň, 82, Czech politician, Minister of Defense (1994–1996).Zemřel exministr obrany a místopředseda lidovců Vilém Holáň, bylo mu 82 let *Boris Komnenić, 63, Serbian actor (Days of Dreams, Loving Glances, Seven and a Half).Преминуо глумац Борис Комненић *Valentin Kurbatov, 81, Russian literary critic and writer.В Пскове скончался член Союза писателей России Валентин Курбатов *Allan J. McDonald, 83, American aerospace engineer (Space Shuttle Challenger) and writer, cerebral hemorrhage caused by a fall.Remembering Allan McDonald: He Refused To Approve Challenger Launch, Exposed Cover-Up *Lou Ottens, 94, Dutch engineer (Philips), inventor of the cassette tape.Lou Ottens, Philips-uitvinder cassettebandje, overleden: ‘We waren als kleine jongens die leuk aan het spelen waren’ *Carmel Quinn, 95, Irish-American actress (Arthur Godfrey's Talent Scouts) and singer (\"The Whistling Gypsy\").Irish singer and entertainer Carmel Quinn passes away in New Jersey *Nikki van der Zyl, 85, German voice-over artist (James Bond movie series), problems caused by a stroke.Nikki van der Zyl (1935–2021) *Egil A. Wyller, 95, Norwegian philosopher and historian.En av Norges mest betydelige filosofer er død. Egil A. Wyller var en kristen platoniker ===7=== *Mordechai Bar-On, 92, Israeli historian and politician, member of the Knesset (1984–1986).Mordechai Bar-On *Wiesław Bocheński, 77, Polish Olympic freestyle wrestler (1968).Zmarł Wiesław Bocheński *Thaddeus M. Buczko, 95, American politician and lawyer, member of the Massachusetts House of Representatives (1959–1964) and State Auditor (1964–1981).Thaddeus 'Ted' Buczko, retired judge, state auditor dies at 95 after a lifetime of service *Olivier Dassault, 69, French politician and businessman, Deputy (1988–1997, since 2002), helicopter crash.French MP and billionaire Dassault dies in helicopter crash *Ed van Dommelen, 86, Dutch politician, Mayor of Huijbergen (1977–1997).Oud-burgemeester van Huijbergen Ed van Dommelen (1934-2021) was ‘dag en nacht benaderbaar’ *Keith Greene, 83, British racing driver, cardiac arrest.Notice of Death - Keith Greene (1938 - 2021) *Georges Gruillot, 89, French politician, Senator (1988–2008).Décès de Georges Gruillot, ancien sénateur du Doubs et président du conseil général *Janis Hape, 62, American Olympic swimmer (1976), heart failure.Janis Hape *Sanja Ilić, 69, Serbian composer (\"Nova deca\") and folk rock keyboardist (San, Balkanika), Eurovision contestant (2018), COVID-19.Preminuo Sanja Ilić: Osnivač \"Balkanike\" izgubio bitku sa koronom *Jan Willem Kelder, 71, Dutch Navy admiral, Commander of the Navy (2005–2007).Schok om overlijden vice-admiraal b.d. Jan-Willem Kelder (71) *Mirko Pavinato, 86, Italian footballer (Bologna, Vicenza) and manager (San Marino), kidney failure caused by COVID-19.Bologna, morto l’ex capitano Pavinato: fatale il Covid-19 *Lars Göran Petrov, 49, Swedish heavy metal singer (Entombed, Entombed A.D., Firespawn) and drummer, bile duct cancer.Entombed A.D. frontman LG Petrov has died *Carl J. Shapiro, 108, American businessman and philanthropist, Director of VF Corporation (1971–1976).Carl Shapiro *Nikolay Smorchkov, 90, Russian actor (True Friends, The Cranes Are Flying, A Cruel Romance).Николай Сморчков *Frank Thorne, 90, American comic book writer (Red Sonja).Frank Thorne Dead: ‘Red Sonja’ Comic Book Artist Dies Along With Wife, Marilyn *Albert Vallvé, 75, Spanish lawyer and politician, Senator (1993–1996).Fallece Albert Vallvè *Jack Welborn, 88, American politician, member of the Michigan House of Representatives (1973–1974) and State Senate (1975–1982, 1985–1994), kidney failure.Former State Senator Jack Welborn Dead at 88 ===8=== *Josip Alebić, 74, Croatian Olympic sprinter (1972, 1976, 1980).Preminuo olimpijac Josip Alebić *Kuryana Azis, 69, Indonesian politician, Regent of Ogan Komering Ulu (since 2015), COVID-19.Innalilahi, Bupati OKU Kuryana Aziz Meninggal Dunia *Adrian Bărar, 61, Romanian guitarist and composer (Cargo), COVID-19.Nie żyje Adrian Barar. Miał 61 lat *Joey Benjamin, 60, St Kitts-born English cricketer (Warwickshire, Surrey, national team) and coach, heart attack.Joey Benjamin, former Surrey and England seamer, dies aged 60 *Hervé Cassan, 74, French politician and academic.Décès du professeur Hervé Cassan *Cepillín, 75, Mexican clown, television personality and actor, problems caused by spinal cancer.Muere Cepillín, el payaso cantante de los niños *Rheal Cormier, 53, Canadian baseball player (St. Louis Cardinals, Boston Red Sox, Philadelphia Phillies), pancreatic cancer.L'ancien lanceur des Expos Rhéal Cormier s'éteint à l'âge de 53 ans *Leon Gast, 85, American documentary filmmaker (When We Were Kings, The Grateful Dead Movie), Oscar winner (1997).Leon Gast, Oscar- Winning Documentarian Behind 'When We Were Kings,' Dies at 85 *Genésio Goulart, 66, Brazilian politician, Mayor of Tubarão (1997–2000) and Santa Catarina MLA (2003–2011), problems caused by ALS.Ex-prefeito de Tubarão, Genésio Goulart morre aos 66 anos *Norton Juster, 91, American writer (The Phantom Tollbooth, The Dot and the Line), academic and architect, problems caused by a stroke.The Phantom Tollbooth Author Norton Juster Has Died at the Age of 91 *James MacGaw, French rock guitarist (Magma), brain cancer.Magma pay tribute to former guitarist James Mac Gaw *Alan Marnoch, 75, Scottish-born Australian footballer (Sydney Hakoah, national team).Vale Alan Marnoch *Terrence F. McVerry, 77, American politician and lawyer, member of the Pennsylvania House of Representatives (1979–1990) and Judge of the U.S. District Court for the Western District of Pennsylvania (since 2002), problems caused by a fall.Obituary: Terrence F. ‘Terry’ McVerry, a former legislator and judge *Rasim Öztekin, 62, Turkish actor (Düğün Dernek, For Love and Honor, G.O.R.A.), heart attack.Prominent Turkish actor Rasim Öztekin dies at age 62 *Rafael Palmero Ramos, 84, Spanish Roman Catholic prelate, Bishop of Palencia (1996–2006) and Orihuela-Alicante (2006–2012), problems caused by lung cancer and COVID-19.Fallece Rafael Palmero Ramos, obispo emérito de Orihuela-Alicante *Trevor Peacock, 89, English actor (The Vicar of Dibley, Hamlet, Fred Claus), problems caused by dementia.Vicar Of Dibley actor Trevor Peacock has died *Norm Sherry, 89, American baseball player (Los Angeles Dodgers, New York Mets) and manager (California Angels).Fomer coach, player, manager Norm Sherry dies at 89 *Anshuman Singh, 85, Indian politician and lawyer, Governor of Gujarat (1998–1999) and Rajasthan (1999–2003), COVID-19.Ex-Rajasthan Governor Anshuman Singh dies due to COVID *Julien-François Zbinden, 103, Swiss composer and jazz pianist.Le compositeur romand Julien-François Zbinden est mort à 103 ans ===9=== *Agustín Balbuena, 75, Argentine footballer (Colón de Santa Fe, Independiente, national team).Murió el Mencho Balbuena *Franca De Stradis, 81, Italian actress (The Price of Death).La pagina di FRANCA DE STRADIS *Richard Driehaus, 78, American fund manager and philanthropist.Richard Driehaus, DePaul alum and business school namesake, dies at 78 *Hans-Christian Gabrielsen, 53, Norwegian trade unionist and politician, Leader of the Norwegian Confederation of Trade Unions (since 2017), heart failure.LO i sorg: LO-leder Hans-Christian Gabrielsen (53) er død *Rafet Husović, 56, Montenegrin politician, Deputy Prime Minister (2012–2020).Preminuo bivši potpredsednik crnogorske Vlade Rafet Husović *Jhon Jarrín, 59, Ecuadorian Olympic cyclist (1980), car crash.Lamentan en Ecuador la muerte del exciclista olímpico Jhon Jarrín *Walter LaFeber, 87, American historian.Walter LaFeber, Historian Who Dissected Diplomacy, Dies at 87 *James Levine, 77, American conductor (Metropolitan Opera) and pianist (Fantasia 2000), problems caused by Parkinson's disease.Former Met Opera conductor James Levine dead at 77 *Erling Lorentzen, 98, Norwegian-Brazilian shipowner and industrialist, founder of Aracruz Celulose.Erling Lorentzen, brother-in-law to King Harald of Norway, dies at the age of 98 *Roger Mudd, 93, American journalist and television news anchor (NBC Nightly News, Meet the Press), problems caused by kidney failure.Roger Mudd, longtime network TV newsman, dies at 93 *John Polkinghorne, 90, English theoretical physicist, theologian, and Anglican priest, President of Queens' College, Cambridge (1988–1996).College announcement: 10/03/2021 *Adhemar Santillo, 81, Brazilian politician, Deputy (1975–1986) and Mayor of Anápolis (1986–1989, 1997-2001), pulmonary embolism caused by COVID-19.Morre o ex-prefeito de Anápolis Adhemar Santillo *Cliff Simon, 58, South African actor (Stargate SG-1), kiteboarding accident.Stargate Actor Cliff Simon Has Passed Away At Age 58 *Steven Spurrier, 79, British businessman and writer.'Great man of wine' Steven Spurrier dies at home *Josy Stoffel, 92, Luxembourgian Olympic gymnast (1948, 1952, 1956, 1960, 1964).Ehemaliges Turnass Josy Stoffel gestorben *Tommy Troelsen, 80, Danish footballer (national team), Olympic silver medalist (1960) and sports commentator (DR).Tommy Troelsen er død *Isela Vega, 81, Mexican actress (Drum, Bring Me the Head of Alfredo Garcia, The House of Flowers), singer- songwriter and filmmaker, cancer.Murió Isela Vega, actriz mexicana de cine y televisión *Jiří Ventruba, 71, Czech neurosurgeon and politician, Deputy (since 2017), COVID-19.Czech MP Jiří Ventruba dies of Covid *Mark Whitecage, 83, American jazz reedist.Mark Whitecage (1937-2021) (death announced on this date) ===10=== *Hamed Bakayoko, 56, Ivorian politician, Prime Minister (since 2020), cancer.Décès d’Hamed Bakayoko, le Premier ministre ivoirien *Eugene Hughes, 86, American educator, President of Northern Arizona University (1979–1993) and Wichita State University (1993–1998).Eugene Hughes, University President in 2 States, Dies at 86 *Per Kleppe, 97, Norwegian politician, Minister of Trade and Shipping (1971–1972), Nordic Cooperation (1971–1972) and Finance (1973–1979).Tidligere finansminister Per Kleppe er død *Lyudmila Lyadova, 95, Russian composer and singer, People's Artist of the RSFSR (1984), problems caused by COVID-19.Умерла композитор Людмила Лядова *Henri-Thomas Lokondo, 65, Congolese politician, MP (since 2006), COVID-19.RDC: Décès du député Henri-Thomas Lokondo *Ali Mahdi Muhammad, 82, Somali businessman and politician, President (1991–1997), COVID-19. *Scott Pilarz, 61, American academic administrator, President of Marquette University (2011–2013) and the University of Scranton (2003–2011, since 2017), problems caused by ALS.University of Scranton’s Pilarz dies from ALS complications *Henryk Rozmiarek, 72, Polish handball player (Grunwald Poznań, national team), Olympic bronze medalist (1976).Zmarł Henryk Rozmiarek, medalista olimpijski w piłce ręcznej *Manuel Saturnino da Costa, 78, Bissau-Guinean politician, Prime Minister (1994–1997).Morreu ex-primeiro-ministro guineense Manuel Saturnino da Costa *Joe Tait, 83, American sportscaster (Cleveland Cavaliers, Cleveland Indians, Cleveland Rockers).Joe Tait, the voice of the Cleveland Cavaliers for two generations, dies at age 83 *Jan Vodňanský, 79, Czech writer and performer, Charter 77 signatory, COVID-19.Ve věku 79 let zemřel na covid spisovatel, písničkář a signatář Charty 77 Jan Vodňanský *David Wolfson, Baron Wolfson of Sunningdale, 85, British businessman and politician, problems caused by dementia.Lord Wolfson of Sunningdale ===11=== *Mauro Aparecido dos Santos, 66, Brazilian Roman Catholic prelate, Archbishop of Cascavel (since 2007), problems caused by COVID-19.Morre Arcebispo de Cascavel Dom Mauro Aparecido Santos *Mahmud Us Samad Chowdhury, 66, Bangladeshi politician, MP (since 2014), COVID-19.Sylhet 3 MP Mahmud Samad dies of Covid-19 *Carola B. Eisenberg, 103, Argentine-American psychiatrist.Carola Eisenberg Dies at 103; Helped Start Physicians for Human Rights *Lin Emery, 94, American visual artist. *Petar Fajfrić, 79, Serbian handball player (Crvena, Yugoslavia national team) and manager (Metaloplastika), Olympic champion (1972).Preminula legenda srpskog rukometa *Peter W. Hall, 72, American politician and lawyer, Judge of the U.S. Court of Appeals for the Second Circuit (since 2004).Announcement, United States Court of Appeals for the Second Circuit *Francis Hardy, 97, French politician, Deputy (1973–1981, 1986–1988) and Mayor of Cognac (1979–2001).Francis Hardy, maire historique de Cognac, est décédé ce matin *Curtis Lovejoy, 63, American swimmer, Paralympic champion (2000), blood cancer.Five-Time Paralympian Curtis Lovejoy passes away at 63 *Isidore Mankofsky, 89, American cinematographer (The Muppet Movie, Somewhere in Time, The Jazz Singer).In Memoriam: Isidore Mankofsky, ASC (1931-2021) *Donald McDonnell, 87, Australian Olympic boxer (1952).Don McDonnell *Luis Palau, 86, Argentine-born American evangelist, lung cancer. *Peter Patzak, 76, Austrian movie director (Kassbach – Ein Porträt, Wahnfried, Shanghai 1937) and screenwriter.„Kottan“-Regisseur Peter Patzak ist tot *Jack Sandner, 79, American business executive (Chicago Mercantile Exchange), stroke.Jack Sandner, longtime Chicago Mercantile Exchange chairman, dies at 79 after suffering a stroke *Norman J. Warren, 78, English movie director (Satan's Slave, Prey, Terror).RIP Norman J. Warren *Hirotaro Yamazaki, 79, Japanese politician, member of the House of Representatives (1993–1996) and Mayor of the Fukuoka Prefecture (1998–2006), intracerebral hemorrhage.山崎広太郎氏死去 元福岡市長：時事ドットコム ===12=== *Andrés Abt, 47, Uruguayan politician, Deputy (2020), COVID-19.Falleció Andrés Abt, alcalde del municipio CH, tras contraer coronavirus *Gérard Aygoui, 84, French footballer (Olympique de Marseille, national team).Gérard Aygoui s'en est allé *Fatima Aziz, 47, Afghani physician and politician, MP (since 2005), cancer.Fatima Aziz ‘member of parliament’ dies of cancer at 47 *Dara Čalenić, 86, Serbian actress (Priests Ćira and Spira, When I Am Dead and Gone, Beach Guard in Winter).Ministarka Gojković izjavila saučešće zbog smrti glumice: “Dara Čalenić ostaje značajna figura u istoriji naše kinematografije” *Gaynor Cawley, 79, American politician, member of the Pennsylvania House of Representatives (1981–2006), cancer.Former state Rep. Gaynor Cawley of Scranton dies of cancer at 79 *Chao Kuang Piu, 100, Hong Kong businessman and philanthropist, founder of Dragonair.Chao Kuang-piu, founder of Dragonair passes away at the age of 101 *Nicolae Dabija, 72, Moldovan writer, literary historian and politician, MP (1990–1994, 1998–2001), COVID-19.Nicolae Dabija, internat în Spitalul de Urgență, a murit astăzi, fiind infectat cu virusul COVID-19 *Ronald DeFeo Jr., 69, American mass murderer, inspiration for The Amityville Horror.‘Amityville Horror’ killer Ronald DeFeo Jr. dies in prison *Andrew Majda, 72, American mathematician.Andrew J Majda *Avenal McKinnon, 71–72, New Zealand art historian and writer, Director of the New Zealand Portrait Gallery (2005–2014).Prominent Christchurch art historian and writer Avenal McKinnon remembered for immense services to the arts *John Albert Nordberg, 94, American politician and lawyer, Judge of the U.S. District Court for the Northern District of Illinois (since 1982), problems caused by Alzheimer's disease.Judge John A. Nordberg *Tapan Kumar Sarkar, 72, Indian-American electrical engineer and academic.In Memoriam: Prof. Tapan Sarkar *Ivo Trumbić, 85, Croatian water polo player and coach (Netherlands national team), Olympic champion (1968).Preminuo Ivo Trumbić *Bob Walkup, 84, American politician, Mayor of Tucson (1999–2011), problems caused by idiopathic pulmonary fibrosis.Former Tucson Mayor Bob Walkup has died *Goodwill Zwelithini kaBhekuzulu, 72, South African royal, King of the Zulus (since 1968), problems caused by diabetes.King Goodwill Zwelithini passes away ===13=== *Giovanni Gastel, 65, Italian photographer, problems caused by COVID-19.Morto il fotografo Giovanni Gastel: era ricoverato per Covid in condizioni gravissime *Marvelous Marvin Hagler, 66, American Hall of Fame boxer, undisputed middleweight champion (1980–1987).BoxRec: Marvin Hagler *Obren Joksimović, 68, Serbian politician, Minister of Health (2001).Umro Obren Joksimović, hirurg i bivši ministar zdravlja *Roger Maes, 77, Belgian Olympic volleyball player (1968).Belgisch volleybalicoon Roger Maes (77) overleden *Kiyoko Ono, 85, Japanese gymnast and politician, Olympic bronze medalist (1964), member of the House of Councillors (1986–2007), COVID-19.東京五輪で銅の小野清子さん死去 体操女子、元参院議員 *Murray Walker, 97, British motorsport commentator (Channel 4, BBC Sport, ITV Sport), lymphoma.Formula 1 commentary icon Murray Walker dies aged 97 ===14=== *H. Douglas Barclay, 88, American politician, member of the New York State Senate (1965, 1966, 1967–1972, 1973–1982, 1983–1984) and Ambassador to El Salvador (2003–2006).H. Douglas Barclay *Ray Cullen, 80, Canadian ice hockey player (Minnesota North Stars, Vancouver Canucks, Detroit Red Wings).Ray Cullen dies but his jingle and hockey past remembered *Henry Darrow, 87, American actor (The High Chaparral, The Hitcher, Zorro).Henry Darrow, Actor on 'The High Chaparral,' Dies at 87 *Frankie de la Cruz, 37, Dominican baseball player (Detroit Tigers, San Diego Padres, Milwaukee Brewers), heart attack.Former Tigers pitcher who forged career around the globe dies at 37 *Lester Francel, 70, Colombian Olympic weightlifter (1972).Lester Francel *Helena Fuchsová, 55, Czech Olympic runner (1996, 2000), cancer.Smrt atletky Heleny Fuchsové (†55): Po dvouletém boji s nemocí zemřela ve spánku *Māris Grīnblats, 66, Latvian politician, Deputy (1991–2010) and Minister of Education (1995–1997).Former Education Minister Grīnblats passes away *S. P. Jananathan, 61, Indian movie director (Iyarkai, Peranmai, Laabam) and screenwriter, cardiac arrest.National Award-winning director SP Jananathan dies at 61 in Chennai *Laxman Pai, 95, Indian painter.Padma Bhushan artist Laxman Pai passes away *Robert A. Pascal, 86, Canadian-American football player (Montreal Alouettes, Duke Blue Devils, Baltimore Colts) and politician, member of the Maryland Senate (1971–1974).Former Anne Arundel County Executive Bob Pascal Dies At 86 *Paul Ri Moun-hi, 85, South Korean Roman Catholic prelate, Archbishop of Daegu (1986–2007).Archbishop Paul Ri Moun-hi *Thione Seck, 66, Senegalese singer and musician.Mort du chanteur Thione Seck, l’une des stars de la musique sénégalaise *Coot Veal, 88, American baseball player (Detroit Tigers, Washington Senators, Pittsburgh Pirates), problems caused by peripheral neuropathy.Inman \"Coot\" Veal ===15=== *Stephen Bechtel Jr., 95, American businessman and civil engineer, co-owner of the Bechtel Corporation.Stephen Bechtel Jr., former CEO of family construction firm and San Francisco philanthropist, dies at 95 *Chai Kim Sen, 56, Malaysian politician, Senator (2014–2020), cancer.Ex-senator Chai Kim Sen passes away *Dragoljub Đuričić, 68, Montenegrin pop rock drummer (YU Grupa, Leb i sol, Kerber), COVID-19.Бубњар Драгољуб Ђуричић преминуо од коронавируса *Daniel Eon, 81, French footballer (Nantes, national team).Daniel Eon, le gardien du FC Nantes double champion de France en 1965 et 1966, est décédé *Yaphet Kotto, 81, American actor (Live and Let Die, Alien, Homicide: Life on the Street).Yaphet Kotto, Bond Villain and ‘Alien’ Star, Dies at 81 *Gerard Alfons Kusz, 81, Polish Roman Catholic prelate, Auxiliary Bishop of Opole (1985–1992) and Gliwice (1992–2014).Bishop Gerard Alfons Kusz *Chemancheri Kunhiraman Nair, 104, Indian Kathakali actor.Kathakali maestro Guru Chemancheri passes away at 105 *Yasuo Ōtsuka, 89, Japanese animator (Panda and the Magic Serpent, Alakazam the Great, The Wonderful World of Puss 'n Boots).Acclaimed Animator Yasuo Otsuka Passes Away at 89 *Doug Parkinson, 74, Australian pop rock singer (\"Dear Prudence\", Fanny Adams, The Life Organisation).Renowned Australian singer Doug Parkinson has died *Michel Rabreau, 83, French politician, Deputy (1968–1978).Guérande : l'ancien maire Michel Rabreau est décédé *Paloma Rodríguez, 64, Spanish politician, Deputy (2012–2015).Pesar en el PSOE de Ferrol por el fallecimiento de Paloma Rodríguez *Dick Schenkeveld, 87, Dutch classicist and academic, Rector of Vrije Universiteit Amsterdam (1978).Overlijdensbericht D.M. Schenkeveld *Daniel Vachez, 74, French politician, Mayor of Noisiel (1980–2017) and Deputy (1997–2002).Noisiel : l’ancien maire Daniel Vachez est décédé *Ian Waddell, 78, Canadian politician, MP (1979–1993) and MLA (1996–2001).Condolences pour in following the death of former B.C. tourism minister Ian Waddell ===16=== *Moudud Ahmed, 80, Bangladeshi politician, MP (1979–1982, 1986–1996, 2001–2006), Prime Minister (1988–1989) and Vice President (1989–1990), kidney failure caused by pneumonia.BNP leader Moudud dies *Courtney Blackman, 88, Barbadian economist and politician, Governor of the Central Bank of Barbados (1972–1987).Courtney Blackman Obituary - Orlando, FL *Kevin Bradshaw, 63, Aussie Olympic racing cyclist (1980).Kevin Bradshaw *Berit Carlberg, 79, Swedish stage actress (Nine).Berit Carlberg död – blev 79 år gammal *Mauro Favilla, 87, Italian politician, Mayor of Lucca (1972–1984, 1988, 2006–2012) and Senator (1987–1996), COVID-19.Lucca, morto l'ex sindaco Mauro Favilla *Ombretta Fumagalli Carulli, 77, Italian politician, Deputy (1987–1996) and Senator (1996–2001).Morta Ombretta Fumagalli Carulli. Più volte al governo, fondò il Ccd con Casini *Aarón Gamal, 62, Mexican footballer (Deportivo Neza, Tigres, national team), heart disease.Fallece exfutbolista de Tigres a los 66 años *Henry Kolowrat Jr., 87, Czech-born American Olympic fencer (1960).Henry Kolowrat, Jr. *Monty Meth, 95, British journalist (Daily Mail).President of Enfield Over 50s Forum dies (death announced on this date) *Erhan Önal, 63, Turkish footballer (Bayern Munich, Galatasaray, national team).Former Galatasaray footballer Erhan Onal dies at 63 *Dwite Pedersen, 79, American politician, member of the Nebraska Legislature (1993–2008).Former longtime Nebraska Sen. Dwite Pedersen dies at 79 *David Dias Pimentel, 79, Portuguese Roman Catholic prelate, Bishop of São João da Boa Vista (2001–2016), COVID-19.Bispo emérito de São João da Boa Vista, Dom David Dias Pimentel, morre de Covid-19 aos 79 anos *Euclides Scalco, 88, Brazilian pharmacist and politician, Deputy (1979–1991) and co-founder of the PSDB, COVID-19.Morre Euclides Scalco, 88, fundador de MDB e PSDB e coordenador político de FHC *Sabine Schmitz, 51, German motor racer and television presenter (Top Gear), cancer.Sabine Schmitz dead: Top Gear star and German racing legend dies at 51 after cancer battle *Turi Simeti, 91, Italian painter, COVID-19.Covid, morto Turi Simeti, l'artista dell'ovale protagonista della avanguardia degli anni Sessanta *Laurent Zahui, 60, Ivorian footballer (national team), problems caused by hip surgery.Décès / Le footballeur Laurent Zahui n’est plus ===17=== *Ed Armbrister, 72, Bahamian baseball player (Cincinnati Reds), problems caused by diabetes.Machine member and Bahamas Sports Hall of Famer, dies at 72 *Gerhard Augustin, 79, German music producer (Beat-Club), problems caused by a stroke.Gerd Augustin ist tot *Xosé Ramón Barreiro, 84, Spanish historian, President of the Royal Galician Academy (2001–2009).Fallece el historiador Xosé Ramón Barreiro, expresidente de la Real Academia Galega *Helenês Cândido, 86, Brazilian politician and lawyer, Governor of Goiás (1998–1999), COVID-19.Ex-governador de Goiás Helenês Cândido morre com Covid-19 quando era transferido para UTI após três dias à espera de vaga *Ulisses dos Santos, 91, Brazilian Olympic hurdler (1956), COVID-19.Ex-atleta olímpico e jornalista, Ulisses Laurindo morre de Covid-19 em Macapá *Jacques Frantz, 73, French actor (Asterix and the Vikings, Heartbreaker, Cop au Vin).Mort à 73 ans de l'acteur Jacques Frantz, la voix fracaise de Robert De Niro et Mel Gibson *Dilipkumar Gandhi, 69, Indian politician, MP (1999–2004, 2009–2019), COVID-19.Former Union minister and BJP leader Dilip Gandhi dies of Covid-19 *Antón García Abril, 87, Spanish composer (Tombs of the Blind Dead, Pancho Villa, Return of the Blind Dead).Muere el compositor Antón García Abril, autor de más de 200 bandas sonoras y de la inolvidable música de 'El hombre y la tierra *Dick Hoyt, 80, American marathon and triathlon runner (Team Hoyt).Dick Hoyt, Endurance Sports Legend, Passes Away *John Magufuli, 61, Tanzanian politician, MP (1995–2015), Minister of Works, Transports and Communications (2000–2005, 2010–2015) and President (since 2015), heart failure.President John Magufuli of Tanzania Dies at 61 *Freddie Redd, 92, American pianist and composer (The Connection).Freddie Redd, Pianist and Composer Known For 'The Connection,' Has Died at 92 *Corey Steger, American metal guitarist (Underoath), car crash.R.I.P. Corey Steger, Founding Underoath Guitarist Dies in Car Accident *Ram Swaroop Sharma, 62, Indian politician, MP (since 2014), suicide.BJP MP Ramsaroop passes away at 62 *Gyula Szersén, 80, Hungarian actor (The Round-Up).Meghalt Szersén Gyula (death announced on this date) ===18=== *Michel Alberganti, 65, French radio producer and writer, (Les Echos, L'Usine nouvelle, Le Monde).Mort de Michel Alberganti, ancien journaliste au « Monde » *Zeev Aram, 89, Romanian-born British furniture designer.Zeev Aram obituary *Luis Bedoya Reyes, 102, Peruvian politician, Minister of Justice (1963), Mayor of Lima (1964–1969) and member of the Constituent Assembly (1978–1980), presidential candidate (1980, 1985, 1995).Luis Bedoya Reyes, fundador del PPC, falleció a los 102 años *David Braithwaite, 83, New Zealand politician, Mayor of Hamilton (2001–2004).Tributes flow for former Hamilton mayor David Braithwaite *Richard Gilliland, 71, American actor (Designing Women, Operation Petticoat, Airplane II: The Sequel).Richard Gilliland, 'Designing Women' Actor and Husband of Jean Smart, Dies at 71 *Herzem Gusmão Pereira, 72, Brazilian politician and journalist, Bahia MLA (2015–2016) and Mayor of Vitória da Conquista (since 2017), COVID-19.Prefeito de Vitória da Conquista, Herzem Gusmão, morre aos 72 anos por complicações da Covid-19 *Paul Jackson, 73, American jazz bassist (The Headhunters, Azteca, Santana).In Memoriam: Paul Jackson *Major Olímpio, 58, Brazilian politician, São Paulo MLA (2007–2015), Deputy (2015–2019) and Senator (since 2019), problems caused by COVID-19. *Picanyol, 73, Spanish comic illustrator (Ot el bruixot).Muere el dibujante Josep Lluís Martínez 'Picanyol' a los 73 años *Michael Stolleis, 79, German lawyer and historian, Director of the Max Planck Society (1991–2009).Michael Stolleis (1941-2021) *Skariah Thomas, 77, Indian politician, MP (1977–1984), problems caused by COVID-19.Kerala Congress leader Skariah Thomas dies ===19=== *Luis Armando Bambarén Gastelumendi, 93, Peruvian Roman Catholic prelate, Auxiliary Bishop of Lima (1968–1978), Bishop of Chimbote (1983–2003) and President of the Episcopal Conference of Peru (1999–2002), COVID-19.Monseñor Luis Bambarén falleció tras ser diagnosticado con coronavirus *Jordi Cornet, 56, Spanish politician, Barcelona City Council (1995–2010) and member of the Catalan Parliament (2010–2012), cancer.Muere Jordi Cornet, exdiputado del PP catalán y exdelegado de la Zona Franca *Ludwig Heimrath Sr., 86, Canadian racing driver, pancreatic cancer.Legendary Canadian racer Ludwig Heimrath dies *Bernard Hugo, 90, French politician, Mayor of Trappes (1966–1996) and Senator (1977–1986).Yvelines. Trappes : l'ancien maire Bernard Hugo est décédé *Ali Khavari, 98, Iranian politician, Leader of the Tudeh Party (1984–2004).Iranian communist Ali Khavari dies: Statement by the Tudeh Party of Iran *Leonard Kniffel, 73, American librarian and editor (American Libraries), pancreatic cancer. *Irmão Lázaro, 54, Brazilian gospel singer and politician, Deputy (2015–2019), COVID-19.Morre o vereador Irmão Lázaro, por complicações da Covid-19 *Glynn Lunney, 84, American aerospace engineer (Project Mercury, Project Gemini, Apollo program).NASA Remembers Legendary Flight Director Glynn Lunney *Barry Orton, 62, American professional wrestler.Barry Orton Passes Away At Age 62 *Elsa Peretti, 80, Italian jewelry designer, philanthropist and fashion model.Morta Elsa Peretti, la signora dei gioielli Tiffany *Budge Wilson, 93, Canadian writer (Before Green Gables, The Metaphor), problems caused by a fall.Budge Wilson, acclaimed Nova Scotia writer, dies at 93 ===20=== *Kermit Edward Bye, 84, American politician and lawyer, Judge of the U.S. Court of Appeals for the Eighth Circuit (2000–2016), problems caused by Alzheimer's disease. *José Baselga, 61, Spanish medical oncologist and researcher, problems caused by Creutzfeldt–Jakob disease.Muere el oncólogo José Baselga *Biagio Ciotto, 91, American politician, member of the Connecticut State Senate (1995–2007). *Taryn Fiebig, 49, Australian soprano.Vale Australian soprano Taryn Fiebig, who has died aged 49 *Else Hammerich, 84, Danish politician, MEP (1979–1989), cancer.Tidligere europaparlamentariker Else Hammerich er død *Milan Hurtala, 74, Slovak Olympic rower (1968), COVID-19.Podľahol COVID-19. Zomrel legendárny veslár Milan Hurtala *Rito Jiménez, 70, Venezuelan politician, Deputy (since 2020), COVID-19.Murió un diputado chavista por COVID-19: es el tercero desde el inicio de la pandemia *Bernal Jiménez Monge, 91, Costa Rican economist and politician, Minister of Economy and Finance (1964–1965), MP (1982–1986, 2002–2006) and President of the Legislative Assembly (1984–1985).Murió expresidente del PLN, Bernal Jiménez *C. A. Kurian, 88, Indian politician, Kerala MLA (1977–1982, 1996–2001).Veteran CPI leader C A Kurian, 88, passes away *Peter Lorimer, 74, Scottish footballer (Leeds United, York City, national team).Leeds record goalscorer Peter Lorimer dies, aged 74 *Richard Mendani, 53, Papua New Guinean politician, MP (since 2012), COVID-19.PNG Member of Parliament Dies of COVID-19 *Yevgeny Nesterenko, 83, Russian operatic singer, COVID-19.Ушел из жизни оперный певец Евгений Нестеренко *Dan Sartain, 39, American rock and roll musician.Tributes paid to Dan Sartain who has died aged 40 (death announced on this date) *Raúl G. Villaronga, 82, American politician, Mayor of Killeen, Texas (1992–1998).Former Killeen mayor — Vietnam War veteran Raul Villaronga — dies at age 82 *Dale E. Wolf, 96, American businessman and politician, Lieutenant Governor (1989–1992) and Governor of Delaware (1992–1993).Dale Wolf, Delaware's 20-day governor and diligent lieutenant governor, dies at 96 *Fred Wyant, 86, American football player (Washington Redskins, Toronto Argonauts) and official.Former WVU quarterback Fred Wyant dies at age 86 ===21=== *Nawal El Saadawi, 89, Egyptian feminist and writer (Woman at Point Zero, The Fall of the Imam).Pioneering Egyptian Feminist Nawal El Saadawi Dies Aged 89 *Marcel Van Goolen, 75, Belgian politician, Mayor of Rotselaar (1989–1991).Ereburgemeester Marcel Van Goolen (75) overleden *Sharon Matola, 66, American biologist and environmentalist, founder of the Belize Zoo, heart attack.Belize mourns immeasurable loss as world renowned conservationist and Belize Zoo Founder, Sharon Matola, passes away *Bob McKnight, 83, Canadian ice hockey player, Olympic silver medalist (1960).Bob McKnight *Honoré Ngbanda, 74, Congolese politician, Minister of Defense (1990–1997).RDC : mort de Honoré Ngbanda, ancien conseiller spécial de Mobutu *Muchtar Pakpahan, 67, Indonesian lawyer and labor activist.Kabar Duka, Tokoh Buruh Muchtar Pakpahan Meninggal Dunia *Suraj Bhanu Solanki, 60, Indian politician, MP (1989–1996), heart attack.Former Congress MP Suraj Solanki dies of cardiac arrest in Bhopal *Karin Strenz, 53, German politician, member of the Bundestag (since 2009), cardiac arrest.German MP dies in Irish hospital after falling ill on transatlantic flight *Adam Zagajewski, 75, Polish poet (Unseen Hand, Another Beauty).Zmarł wybitny poeta i eseista Adam Zagajewski ===22=== *Elgin Baylor, 86, American Hall of Fame basketball player (Minneapolis/Los Angeles Lakers), coach (New Orleans Jazz) and executive (Los Angeles Clippers).Lakers icon Baylor dead at 86 *Susana Canales, 87, Spanish actress (Black Sky, Such is Madrid, John Paul Jones).Muere la actriz Susana Canales, icono del cine de posguerra, a los 87 años *John Crichton-Stuart, 7th Marquess of Bute, 62, Scottish racecar driver (Formula One, 24 Hours of Le Mans) and peer.Ex-Formula 1 driver Marquess of Bute dies aged 62 (death announced on this date) *Guy Brice Parfait Kolélas, 61, Congolese politician, Deputy (since 2007) and Leader of MCDDI (since 2009), 2016 and 2021 presidential election, COVID-19.Congo-Brazzaville: Guy-Brice Parfait Kolelas dies from Covid on poll day *Tatyana Lolova, 87, Bulgarian actress (Man of La Mancha, Indian Summer, Opasen char).In Memoriam: We Have Lost Tatyana the Great, Remarkable Actress Died Aged 87 *Peng Shilu, 95, Chinese nuclear engineer (Type 091, Type 092).中国核潜艇首任总设计师彭士禄院士逝世 *Sagar Sarhadi, 87, Indian screenwriter (Kabhi Kabhie, Noorie, Silsila) and movie producer, heart disease.Veteran Writer- Director Sagar Sarhadi Dies. Jackie Shroff Pays A Tribute *Marie Šupíková, 88, Czech Lidice survivor and autobiographer.Přežila vyhlazení Lidic, vyzrála i na covid. Marie Šupíková zemřela v 88 letech *Kotugoda Dhammawasa Thera, 88, Sri Lankan Buddhist monk, Mahanayaka of Amarapura–Rāmañña Nikāya (since 2017).Sri Lanka- Amarapura Maha Nikaya Chief Prelate passed away *Frank Worthington, 72, English footballer (Huddersfield Town, Leicester City, national team).Former England striker Frank Worthington dies aged 72 after long illness ===23=== *Gurnam Singh Abulkhurana, 89, Indian politician, Punjab MLA (1992–1997).Congress leader Gurnam Singh Abulkhurana passes away *Basrief Arief, 74, Indonesian lawyer and politician, Attorney General (2010–2014).Jaksa Agung di Era SBY, Basrief Arief Meninggal Dunia *Ethel Gabriel, 99, American record producer (RCA Victor) and music executive, Grammy winner (1983).Ethel Gabriel *Tony Greaves, Baron Greaves, 78, British politician and peer, member of the House of Lords (since 2000).Pendle councillor and life peer Lord Tony Greaves has died aged 78 *Don Heffington, 70, American rock drummer (Lone Justice, Watkins Family Hour), leukemia.Versatile drummer Don Heffington dead at 70 *Hana Hegerová, 89, Slovak singer and actress (Frona, If a Thousand Clarinets, Nestyda), problems caused by a broken neck.Zemřela první dáma českého šansonu Hana Hegerová *Metod Pirih, 84, Slovenian Roman Catholic prelate, Bishop of Koper (1987–2012).Umrl je upokojeni koprski škof Metod Pirih *Julie Pomagalski, 40, French Olympic snowboarder (2002, 2006), world champion (1999), avalanche.Snowboard world champ Julie Pomagalski dies at 40 *George Segal, 87, American actor (Who's Afraid of Virginia Woolf?, A Touch of Class, The Goldbergs), musician and comedian, Golden Globe winner (1965, 1973), problems caused by heart surgery.George Segal Dies: Oscar-Nominated Actor & ‘The Goldbergs’ Star Was 87 *Granville Waiters, 60, American basketball player (Indiana Pacers, Houston Rockets, Chicago Bulls).Former Ohio State Basketball Player Granville Waiters Dies At Age 60 ===24=== *Uldis Bērziņš, 76, Latvian poet and translator.Poet, translator Uldis Bērziņš passes away *Aécio de Borba, 89, Brazilian politician and sports executive, Deputy (1983–1995, 1997–1998), cardiac arrest.Morre Aécio de Borba, ex-deputado e dirigente do Futsal *Enrique Chazarreta, 73, Argentine footballer (San Lorenzo, Avignon).Murió Enrique Chazarreta, figura de San Lorenzo en los '70 *Jesús Fernández Vaquero, 67, Spanish politician, member (1999–2019) and President (2015–2019) of the Cortes of Castilla–La Mancha and Senator (since 2019).Fallece Jesús Fernández Vaquero, expresidente de las Cortes y líder del PSOE de Castilla-La Mancha *Finian's Rainbow, 18, British racehorse.'A gentle giant' - Henderson remembers Finian's Rainbow after death aged 18 *Toshihiko Koga, 53, Japanese judoka, Olympic champion (1992).Japan's judo gold medallist Koga dies aged 53: NHK *Kentaro Kudo, 78, Japanese politician, member of the House of Representatives (1993–1996, 2000–2003) and House of Councillors (2004–2010), respiratory failure.工藤堅太郎氏が死去 元衆院議員 *Haroldo Lima, 81, Brazilian politician and anti-dictatorship activist, Deputy (1983–2003) and General Director of the ANP (2005–2011), COVID-19.Ex-deputado federal e dirigente do PCdoB, Haroldo Lima morre em decorrência da Covid-19 *Hamdan bin Rashid Al Maktoum, 75, Emirati politician and horse breeder (Shadwell Racing), Deputy Prime Minister (1971–1973).Sheikh Hamdan bin Rashid, Deputy Ruler of Dubai, passes away *Ezra T. Newman, 91, American physicist.Ezra Ted Newman *Bob Plager, 78, Canadian ice hockey player, coach, and executive (St. Louis Blues, New York Rangers), car crash. Bob Plager, former NHL bruiser, dead in car crash *Jessica Walter, 80, American actress (Arrested Development, Archer, Play Misty for Me), Emmy winner (1975).Jessica Walter Dies: Emmy-Winning ‘Arrested Development,’ ‘Archer’ Actress Was 80 ===25=== *Rais Abin, 94, Indonesian military officer and politician, Commander of UNEF II (1976–1979).Letjen Rais Abin, Tokoh di Balik Layar Perdamaian Camp David *Stan Albeck, 89, American basketball coach (San Antonio Spurs, New Jersey Nets, Bradley Braves). Former Spurs coach Stan Albeck dies at 89 *Bill Brock, 90, American politician, member of the U.S. House of Representatives from Tennessee's 3rd congressional district (1963–1971), U.S. Senator (1971–1977), U.S. Trade Representative (1981–1985) and U.S. Secretary of Labor (1985–1987), pneumonia.Bill Brock dies at 90: Chattanooga native was longtime national leader *Bobby Brown, 96, American baseball player (New York Yankees) and executive.Bobby Brown, Yankees great and Fort Worth doctor, dead at 96 *Beverly Cleary, 104, American children's writer (The Mouse and the Motorcycle, Ramona and Her Mother, Dear Mr. Henshaw), Newbery Medal winner (1984).Beverly Cleary, beloved and prolific author of children’s books, dies at 104 *Joe Cunningham, 89, American baseball player (St. Louis Cardinals, Chicago White Sox, Washington Senators).St. Louis Cardinals mourn loss of 'Smokey' Joe Cunningham *Manuel Dammert, 72, Peruvian sociologist and politician, member of the Congress (1985–1992, 2013–2019), COVID-19.Excongresista Manuel Dammert falleció a los 72 años víctima del COVID-19 *Syarwan Hamid, 77, Indonesian politician, Minister of Home Affairs (1998–1999).Mantan Menteri Dalam Negeri Syarwan Hamid Meninggal *Richard Marsina, 97, Slovak historian.Zomrel slovenský historik a archivár Richard Marsina *Larry McMurtry, 84, American novelist (Lonesome Dove), and screenwriter (The Last Picture Show, Brokeback Mountain), Oscar winner (2006).Larry McMurtry, Novelist And Screenwriter Of The West, Has Died At Age 84 *Roman Micał, 82, Polish Olympic hockey player (1960).Odszedł Roman Micał *muMs da Schemer, 53, American actor (Oz, She's Gotta Have It, Hightown) and poet.Craig “muMs” Grant Dies: Prolific Actor Played “Poet” On ‘Oz’, Recurred On ‘Hightown’ & ‘She’s Gotta Have It’ *WAG Pinto, 96, Indian military officer, Commandant of the National Defence College (1979–1980).‘Victor of Basantar’ Lt Gen Pinto passes away at 97 *Gail Phillips, 76, American politician, member of the Alaska House of Representatives (1991–2001) and Speaker of the State House (1995–1999).Former Alaska House Speaker Gail Phillips dies *Uta Ranke- Heinemann, 93, German theologian, academic, and writer.Uta Ranke-Heinemann ist tot *Nazar Suyunov, 84, Turkmen politician, Minister of Foreign Affairs (1979–1985).Суюнов Назар Тойлиевич *Randy Tate, 68, American baseball player (New York Mets).Randy Tate *Bertrand Tavernier, 79, French filmmaker (A Sunday in the Country, Coup de Torchon, Life and Nothing But) and actor.Bertrand Tavernier Dies: Legendary French Filmmaker Was 79 ===26=== *Rateb Al-Awadat, 50, Jordanian footballer (national team) and manager (Al-Faisaly, Al-Sheikh Hussein), cancer.الاردن: وفاة مدرب الفيصلي السابق راتب العوضات *Elaine Baxter, 88, American politician, Iowa Secretary of State (1987–1995).Former Iowa Secretary of State Elaine Baxter has died *Hossein Khodaparast, 82, Iranian footballer (national team) and Olympian (1964).تنها فوتبالیست تبریزی حاضر در المپیک درگذشت *Carole Lavallée, 67, Canadian politician, MP (2004–2011).L’ex-députée bloquiste Carole Lavallée est décédée *Lennart Larsson, 91, Swedish cross country skier, Olympic bronze medalist (1956).Svenske VM-guldmedaljören död *Haseena Moin, 79, Pakistani screenwriter (Tanhaiyaan, Dhoop Kinare, Shehzori), cancer.Haseena Moin passes away in Karachi *Paul Polansky, 79, American writer and Romani activist.Zemřel Paul Polansky, který upozornil na koncentrační tábor v Letech ===27=== *Želimir Altarac Čičak, 73, Bosnian rock singer and poet, COVID-19.Želimir Altarac Čičak preminuo od posljedica koronavirusa *Leon Hale, 99, American journalist.Beloved Houston Chronicle columnist Leon Hale dies *Petr Kellner, 56, Czech businessman, founder of PPF, helicopter crash.Czech billionaire Kellner killed in Alaska helicopter crash *Mary Jeanne Kreek, 84, American neurobiologist.Mary Jeanne Kreek, pioneer in studies of addiction, has died *Eugenio Mimica Barassi, 71, Chilean writer.Esta sábado murió en Santiago el escritor magallánico Eugenio Mimica Barassi *Odirlei Pessoni, 38, Brazilian Olympic bobsledder (2014, 2018), car crash.Morre em acidente de moto brasileiro que se preparava para terceira Olimpíada de Inverno *Mahbubur Rahman, 81, Bangladeshi politician, Minister of Religious Affairs (1984–1987) and Education (1986–1988).Former minister Mahbubur Rahman passes away *Antonio Sanchez, 71, Filipino politician and convicted murderer, Mayor of Calauan (1980–1986, 1988–1993), COVID-19.Convicted former Calauan, Laguna Mayor Antonio Sanchez passes away *Howard Schnellenberger, 87, American football coach (Miami Hurricanes, Louisville Cardinals, Florida Atlantic Owls), national championship winner (1983).Florida college football legend Howard Schnellenberger has died *Derek Ufton, 92, English cricketer (Kent) and footballer (Charlton Athletic, national team).Derek Ufton obituary *Sarah Whitmore, 89, British Olympic equestrian (1976).Olympisch amazone Sarah Whitmore (89) overleden ===28=== *Malcolm Cecil, 84, British jazz bassist and record producer.Malcolm Cecil, influential producer and Stevie Wonder collaborator, has died *Joseph Edward Duncan, 58, American serial killer, glioblastoma.'The sun is a little brighter today': Serial killer Joseph Duncan is dead *Marisa Ferretti Barth, 89, Italian-born Canadian politician, Senator (1997–2006).Addio a Marisa Ferretti Barth Senatrice canadese di Ascoli *Christof Heyns, 62, South African human rights lawyer.Feted human rights lawyer Prof Christof Heyns dies at 62 *Liu Kai-chi, 66, Hong Kong actor (Cageman, Infernal Affairs II, SPL: Sha Po Lang), stomach cancer.Veteran Hong Kong actor Liu Kai Chi dies of stomach cancer at 66 *Xabier Markiegi, 82, Spanish politician, member of the Basque Parliament (1981–1994).Muere Xabier Markiegi, exdirigente de Euskadiko Ezkerra y Ararteko *Didier Ratsiraka, 84, Malagasy politician, President (1975–1993, 1997–2002), cardiac arrest caused by an influenza.Madagascar's ex-president Didier Ratsiraka dies at 84 *Constantin Simirad, 79, Romanian politician, Mayor of Iași (1992–2003) and Ambassador to Cuba (2003–2006), COVID-19.Constantin Simirad, fostul primar al Iașiului, a murit de COVID *Bobby Schmautz, 76, Canadian ice hockey player (Boston Bruins, Vancouver Canucks, Chicago Blackhawks), pancreatic cancer.Schmautz dies at 76, scored OT goal for Bruins in 1978 Stanley Cup Final *Enrico Vaime, 85, Italian television and radio presenter, author and playwright.Morto Enrico Vaime, aveva 85 anni *Roger Baens, 87, was a Belgian cyclist. His cause of death is unknown. ===29=== *Saverio De Michele, 97, Italian businessman and politician, Mayor of Olbia (1956–1963).Addio all'ex sindaco di Olbia Saverio De Michele. \"Era un gentiluomo della politica\" *Bashkim Fino, 58, Albanian politician, Prime Minister (1997) and Deputy (since 1997), COVID-19.I infektuar me COVID, ndahet nga jeta në moshën 59-vjeçare deputeti Bashkim Fino *Bibian Mentel, 48, Dutch snowboarder, Paralympic champion (2014, 2018), cancer.Bibian Mentel (48), drievoudig paralympisch kampioene snowboarden, overleden *Sarah Onyango Obama, 99, Kenyan educator and philanthropist, step-grandmother of U.S. President Barack Obama, problems caused by diabetes.Mama Sarah Obama is dead *Park Kyung-ho, 91, South Korean football player (national team) and manager, Asian Games silver medalist (1958).'1회 아시안컵 우승 주역' 축구 원로 박경호 선생 별세 ===30=== *Nazar Albaryan, 77, Armenian Olympic wrestler (1968).First Armenian freestyle wrestler to compete in Olympics dies (death announced on this date) *Contardo Calligaris, 72, Italian-Brazilian psychoanalyst and writer, cancer.Contardo Calligaris, escritor e psicanalista, morre aos 72 anos em São Paulo *Gérard Filippelli, 78, French actor (Bons Baisers de Hong Kong, The Big Store), musician and composer (Les Charlots).Gérard Filipelli, membre de la célèbre bande Les Charlots, est décédé *G. Gordon Liddy, 90, American lawyer and FBI agent, convicted for the Watergate scandal, problems caused by Parkinson's disease.G. Gordon Liddy, Watergate mastermind, dead at 90 *Patrick O. O'Meara, 83, South African-born American educator and writer.IU vice president emeritus Patrick O'Meara dies at 83 ===31=== *Lee Collins, 32, English footballer (Port Vale Football Club, Northampton Town, Mansfield Town). *Kamal Ganzouri, 88, Egyptian economist and politician, Prime Minister (1996–1999, 2011–2012).Former Egyptian PM Kamal al-Ganzouri dies aged 88 *Ursula Happe, 94, German swimmer, Olympic champion (1956).Olympiasiegerin Ursula Happe mit 94 Jahren gestorben (death announced on this date) *Ivan Klajn, 84, Serbian linguist, philologist and language historian.Умер профессор Иван Клайн *Hsu Shui-teh, 89, Taiwanese politician, Mayor of Taipei (1985–1988), Minister of the Interior (1988–1991) and President of the Examination Yuan (1996–2002), pneumonia.前考試院長許水德辭世 享耆壽91歲 *Ken Reitz, 69, American baseball player (St. Louis Cardinals, San Francisco Giants, Pittsburgh Pirates).Former Giants third baseman, Bay Area native Ken Reitz dies at 69 *Izabella Sierakowska, 74, Polish politician, member of the Sejm (1989–2005, 2007–2011).Nie żyje Izabella Sierakowska *Fabriciano Sigampa, 84, Argentine Roman Catholic prelate, Archbishop of Reconquista (1985–1992), La Rioja (1993–2005) and Resistencia (2006–2013).Murió en La Rioja monseñor Fabriciano Sigampa *Arkady Ter- Tadevosyan, 81, Armenian Armed Forces major general.Legendary commander Arkady Ter-Tadevosyan dies aged 81 *Carlos Pedro Zilli, 66, Brazilian-born Bissau- Guinean Roman Catholic prelate, Bishop of Bafatá (since 2001), COVID-19.Morreu o bispo Carlos Zilli, líder da Igreja Católica no leste e sul da Guiné-Bissau *Stefano Zuccherini, 67, Italian politician, Senator (2006–2008).Perugia, è morto a 67 anni Stefano Zuccherini. Il ricordo appassionato di Bertinotti ==2021 deaths by month== * January 2021 * February 2021 * April 2021 * May 2021 ==Related pages== * List of deaths due to COVID-19 * 2021 in association football deaths * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *03 Category:March 2021 events",
 "title": "Deaths in March 2021"
}