{
 "id": "804760",
 "text": "The following is a list of deaths that should be noted in September 2021. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==September== ===1=== *Amanda Bayard, 39, American television producer (Last Week Tonight with John Oliver).‘Last Week Tonight With John Oliver’ Pays Tribute To Michael K. Williams & Producer Amanda Bayard *Jean-Denis Bredin, 92, French lawyer, founder of Bredin Prat and member of the Académie Française (since 1989).L’avocat et académicien Jean-Denis Bredin est mort *Anna Cataldi, 81, Italian journalist, movie producer (Out of Africa) and humanitarian.Addio Anna Cataldi, ambasciatrice di pace *Paul Chillan, 85, French footballer (Nîmes, Arlésien, national team).Décès du footballeur martiniquais Paul Chillan, ancien international tricolore *Daffney, 46, American professional wrestler (TNA, SHINE, WCW) and actress, suicide by gunshot.Ex-WCW Star Daffney Unger Dead at 43 After Suicidal Video, Desperate Search *Robbie Dale, 81, British radio presenter (Radio Caroline).Radio Caroline pirate Robbie Dale dies at the age of 81 *Carol Fran, 87, American soul blues singer-songwriter and pianist, problems caused by COVID-19.Acadianas gefühlvolle Musiklegende Carol Fran ist gestorben *Syed Ali Shah Geelani, 91, Indian Kashmiri separatist leader and politician, Jammu and Kashmir MLA (1972–1982, 1987–1990), pneumonia caused by kidney cancer.Kashmiri separatist leader Syed Ali Shah Geelani dies in Srinagar *Doug Green, 66, American politician, member of the Ohio House of Representatives (2013–2020), COVID-19.Former Ohio Republican Rep. Doug Green dies after contracting COVID-19 *José Gonçalves Heleno, 93, Brazilian Roman Catholic prelate, Coadjutor Bishop (1976–1977) and Bishop of Governador Valadares (1977–2001), problems caused by a stroke.Morre Dom José Heleno, bispo emérito de Governador Valadares *Norbert Klein, 65, Dutch politician, member of the House of Representatives (2012–2017).Oud-Kamerlid Norbert Klein (50Plus) overleden *Gregg Leakes, 66, American reality television personality (The Real Housewives of Atlanta, I Dream of NeNe: The Wedding), colon cancer.Gregg Leakes, ‘Real Housewives of Atlanta’ Star and NeNe Leakes’ Husband, Dies at 66 *Norberto Mario Oyarbide, 70, Argentine politician and lawyer, Federal Judge of the Supreme Court (1994–2016), problems caused by COVID-19.Former federal judge Norberto Oyarbide died *Juan Rodríguez Vega, 77, Chilean footballer (Unión Española, Atlético Español, national team).Comunicado: Lamentamos el fallecimiento de Juan Rodríguez Vega *Leopoldo Serantes, 59, Filipino boxer, Olympic bronze medalist (1988), problems caused by COPD.Olympic boxing bronze medalist Leopoldo Serantes passes away *Dan Swecker, 74, American politician, member of the Washington State Senate (1995–2013), pneumonia caused by COVID-19.Former State Lawmaker Dan Swecker Dies at 74 ===2=== *Derek Bailey, 48, American tribal leader, politician and convicted sex offender, Chairman of the Grand Traverse Band of Ottawa and Chippewa Indians (2008–2012), heart attack. *Michel Corboz, 87, Swiss conductor.Décès du chef d'orchestre Michel Corboz *Manuel Soares Costa, 88, Portuguese academic and politician, Minister of Agriculture (1983–1984).Presidente da República manifesta pesar pela morte do Professor Manuel Soares Costa *Alemayehu Eshete, 80, Ethiopian jazz singer (\"The Rough Guide to the Music of Ethiopia\", \"Éthiopiques\"), heart attack caused by heart disease.Alemayehu Eshete, \"Ethiopian Elvis Presley\", reportedly died *Aydin Ibrahimov, 82, Azerbaijani wrestler, Olympic bronze medalist (1964), COVID-19.Well-known sportsman Aydin Ibrahimov died of coronavirus *Gurbanmuhammet Kasymow, 67, Turkmen politician and lawyer, Minister of Internal Affairs (1993–1998), Defense (1998–1999) and Justice (1999–2001), problems caused by COVID-19.Источники: бывший министр, вице- премьер и посол Туркменистана скончался от COVID-19 *George Mawle, 51, American video game developer (God of War).Gameplay Engineer Behind God Of War's Leviathan Axe, George Mawle, Passes Away *Keith McCants, 53, American football player (Alabama Crimson Tide, Tampa Bay Buccaneers, Houston Oilers) and radio broadcaster, drug overdose.Keith McCants, former NFL and Alabama star, dead at 53 *Josephine Medina, 51, Filipino table tennis player, Paralympic bronze medalist (2016).2016 Rio Paralympics bronze medalist Josephine Medina dies *Ataullah Mengal, 92, Pakistani politician, Chief Minister of Balochistan (1972–1973), cardiac arrest caused by heart disease.Balochistan's first chief minister Sardar Attaullah Mengal passes away at 93 *Chandan Mitra, 65, Indian journalist (The Pioneer) and politician, MP (2003–2016).Chandan Mitra, Editor And Former Rajya Sabha MP, Dies *David Patten, 47, American football player (New York Giants, New England Patriots, Washington Redskins), Super Bowl champion (2002, 2004, 2005), motorcycle crash.Former Patriots wide receiver David Patten passes away *Sidharth Shukla, 40, Indian actor (Broken But Beautiful, Balika Vadhu, Dil Se Dil Tak) and reality show contestant, heart attack.Siddharth Shukla passes away *Hashibur Rahman Swapon, 67, Pakistani-born Bangladeshi politician, MP (1996–1998, since 2014), problems caused by COVID-19.Sirajganj 6 MP Hasibur Rahman Swapon passes away *Mikis Theodorakis, 96, Greek composer (\"Mauthausen Trilogy\", Zorba the Greek, Z), activist and politician, MP (1981–1993), cardiac arrest.Renowned composer Mikis Theodorakis dies *Frederick L. Van Sickle, 78, American politician and lawyer, member (since 1991) and Chief Judge of the U.S. District Court for the Eastern District of Washington (2000–2005).Longtime federal judge Fred Van Sickle dies at 78 *Joan Washington, 71, British dialect coach (The Life Aquatic with Steve Zissou, Crimson Peak, 101 Dalmatians), lung cancer.Richard E Grant says he is heartbroken at death of wife Joan Washington ===3=== *Muhammad Saeed al-Hakim, 85, Iraqi marja', heart attack.Shi'ite Grand Ayatollah al-Hakeem dies in Iraq *Ljubo Bešlić, 63, Bosnian politician, Mayor of Mostar (2004–2021).Tuga: Preminuo Ljubo Bešlić *Marian Collier, 90, American actress (Some Like It Hot).Marian Collier: Marilyn’s ‘Hot’ Bandmate Dies at 90 *Erik Cowie, 53, American zookeeper and reality television personality (Tiger King).Tiger King zookeeper and Netflix star Erik Cowie dies aged 53 (body discovered on this date) *Hassan Firouzabadi, 70, Iranian ophthalmologist and Basij general, Chief-of-Staff of the Iranian Armed Forces (1989–2016).Hassan Firouzabadi, former Iran’s armed forces chief of staff, dies *Sérgio Mamberti, 82, Brazilian actor (O Baiano Fantasma, The Lady from the Shanghai Cinema, Castelo Rá-Tim-Bum) and politician, multiple organ failure.Ator Sergio Mamberti morre aos 82 anos em SP *Enrique Molina, 77, Cuban actor (The Man from Maisinicu, Hello Hemingway, Video de Familia), COVID-19.Falleció Enrique Molina, actor cubano de cine y televisión *Ahamed Samsudeen, 32, Sri Lankan terrorist (Auckland Countdown stabbing), shot.Auckland terror attack: Ahamed Samsudeen, the man behind Isis-inspired stabbings *Henriette Valium, 62, Canadian comic book artist and painter.Décès du bédéiste underground Henriette Valium *Robert C. Wetenhall, 86, Canadian football executive, owner of Montreal Alouettes (1997–2018).Former Montreal Alouettes owner Bob Wetenhall dies ===4=== *Dell Furano, 70, American music industry executive and businessman, CEO of Live Nation Entertainment (2008–2012). *Rune Gerhardsen, 75, Norwegian politician and sports executive, Leader of the Workers' Youth League (1973–1975), Chairman of the NSA (1986–1990, 2001–2003, 2013–2017) and Mayor of Oslo (1992–1997).Rune Gerhardsen er død: – Stor sorg *Albert Giger, 74, Swiss cross country skier, Olympic bronze medalist (1972), cancer.Albert Giger, l'un des héros de Sapporo 1972, est décédé *Léonard Groguhet, 82, Ivorian actor (Ma Famille) and comedian.Côte d'Ivoire: Léonard Groguhet décède à 82 ans *Tunch Ilkin, 63, Turkish-born American football player (Pittsburgh Steelers, Green Bay Packers) and broadcaster, problems caused by ALS.Former Steelers broadcaster Tunch Ilkin dies *Jörg Schlaich, 86, German structural engineer (Olympiastadion, Mercedes-Benz Arena).Stuttgarter Bauingenieur Jörg Schlaich ist tot *Willard Scott, 87, American weatherman (Today) and creator of Ronald McDonald.Willard Scott, legendary TODAY weatherman, dies at 87 ===5=== *Susan Anway, 70, American pop singer (The Magnetic Fields).Mary Susan Anway *Eugene N. Borza, 86, American historian and academic, President of the Association of Ancient Historians (1984–1989).Eugene Borza *Ion Caramitru, 79, Romanian actor (Citizen X, Adam & Paul, Charlie Countryman), stage director and politician, Minister of Culture (1996–2000).A murit Ion Caramitru. Actorul era internat la Elias *Keshav Desiraju, 66, Indian public servant (Indian Administrative Service) and mental health activist (2017 Mental Healthcare Act), acute coronary syndrome.Remembering Keshav Desiraju: The bureaucrat who fought for the disabled *Sándor Egeresi, 57, Hungarian-Serbian politician, President of the Assembly of Vojvodina (2008–2012).Sándor Egeresi is dead *Marcel Garroust, 100, French politician, Mayor of Penne-d'Agenais (1971–1983) and Deputy (1976–1986, 1988–1993).https://www.sudouest.fr/lot-et-garonne/villeneuve-sur- lot/carnet-noir-marcel-garrouste-n-est-plus-5719912.php *Sarah Harding, 39, English pop singer (Girls Aloud), actress (Run for Your Wife, St Trinian's 2: The Legend of Fritton's Gold) and model, breast cancer.Sarah Harding, singer with Girls Aloud, dies aged 39 from breast cancer *Jan Hecker, 54, German lawyer, academic and politician, Judge of the Federal Administrative Court (2011–2015) and Ambassador to China (since 2021).Jan Hecker, German ambassador to China, dies just a few weeks into his posting *Robert P. Hollenbeck, 89, American politician, member of the New Jersey General Assembly (1974–1986).Bob Hollenbeck, former six-term assemblyman, dies at 89 *Matej Marin, 41, Slovenian racing cyclist.Matej Marin *Donncha Ó Dúlaing, 88, Irish broadcaster (RTÉ Radio).Veteran RTÉ broadcaster Donncha Ó Dúlaing dies aged 88 *Ivan Patzaichin, 71, Romanian sprint canoeist and canoe racing coach, Olympic champion (1968, 1972, 1980, 1984), lung cancer.Kaiac-canoe: Multimpul campion olimpic Ivan Patzaichin a decedat la vârsta de 71 de ani *Živko Radišić, 84, Bosnian politician, Mayor of Banja Luka (1977–1982) and Chairman of the Presidency (1998–1999, 2000–2001).Preminuo bivši gradonačelnik BL Živko Radišić *Rickie Lee Reynolds, 72, American rock guitarist (Black Oak Arkansas), problems caused by COVID-19.Rickie Lee Reynolds Dies: Guitarist For Black Oak Arkansas Was 72 *João Sayad, 75, Brazilian economist and academic, blood cancer.Morre aos 75 anos o economista João Sayad *Tony Selby, 83, English actor (Get Some In!, Doctor Who, Witchfinder General).Sitcom star Tony Selby dies aged 83 ===6=== *Jean-Pierre Adams, 73, Senegalese-born French footballer (Nîmes, Nice, national team), cerebral hypoxia caused by knee surgery.Jean-Pierre Adams est mort *Billy Apple, 86, New Zealand pop artist.Artist Billy Apple dies after short illness *Claude Azéma, 78, French Roman Catholic prelate, Bishop of Montpellier (2003–2018).Mort de Mgr Claude Azéma, évêque auxiliaire émérite de Montpellier *Adam Baumann, 73, Polish actor (Śmierć jak kromka chleba, Wojaczek, Destined for Blues).Adam Baumann nie żyje. W Katowicach zmarł wspaniały aktor Teatru Śląskiego. Grał w \"Skazanym na bluesa\" i \"Drachu\" *Jean-Paul Belmondo, 88, French actor (Breathless That Man from Rio, Itinerary of a Spoiled Child).Mort de Jean-Paul Belmondo, le Magnifique du cinéma français *Nino Castelnuovo, 84, Italian actor (Rocco and His Brothers, The Umbrellas of Cherbourg, The Five Man Army).Nino Castelnuovo è morto a Roma, aveva 84 anni: l'annuncio della famiglia *Yolanda Fernández de Cofiño, 86, Guatemalan businesswoman and philanthropist, creator of the Happy Meal.Fallece doña Yolanda de Cofiño, figura del emprendimiento y labor social en Guatemala *Enrique González Pedrero, 91, Mexican politician and writer, Senator (1970–1976), Governor of Tabasco (1982–1987) and Deputy (1997–2000).Muere Enrique González Pedrero, exgobernador de Tabasco, a los 91 años *Zanele kaMagwaza-Msibi, 59, South African politician, Leader of the National Freedom Party (since 2011) and MP (2014–2019), COVID-19. *Jan-Erik Kjellberg, 97, Swedish engineer and writer, last living Swedish volunteer soldier of the Continuation War.Den sista av soldaterna i det svenska frivilligkompaniet som deltog på Finlands sida i fortsättningskriget, korpral Jan Kjellberg (tidigare Högberg), är död. *Dick Parfitt, 90, American college basketball coach (Central Michigan Chippewas).'Great basketball mind': Dick Parfitt, who coached CMU to two NCAAs, dies at 90 *Todd Scully, 72, American Olympic racewalker (1976), car crash.Big Island man killed in Bedford County crash *Adlai Stevenson III, 90, American politician, member of the Illinois House of Representatives (1965–1967), State Treasurer (1967–1970) and U.S. Senator (1970–1981), problems caused by Lewy body dementia.Former senator Adlai Stevenson III dies at 90 *Anthony Ukpo, 74, Nigerian politician, Governor of Rivers State (1986–1988).Nigeria's Former Information Minister, General Anthony Ukpo, Dies At 74 *Iván Vitányi, 96, Hungarian philosopher and politician, MP (1990–2014).Meghalt Vitányi Iván *John Watkins, 98, South African cricketer (Natal, national team), COVID-19.John Watkins, former South African Test cricketer, passes away at 98 *Michael K. Williams, 54, American actor (The Wire, Boardwalk Empire, Assassin's Creed), suspected drug overdose.Michael K. Williams, Star Of ‘The Wire’ And ‘Lovecraft Country,’ Dies At Age 54 *Severian Yakymyshyn, 91, Canadian Ukrainian Greek Catholic hierarch, Bishop of New Westminster (1995–2007). *Donald Zec, 102, British journalist (Daily Mirror).Donald Zec 1919–2021 (death announced on this date) ===7=== *Peter Arnold, 94, New Zealand cricketer (Northamptonshire, Canterbury).Remembering Peter Arnold *Jahangir Butt, 78, Pakistani field hockey player, Olympic champion (1968).Former Hockey Olympian Jahangir Butt passes away at 78 *Sam Cunningham, 71, American football player (New England Patriots).Ex-USC, New England Patriots Star Fullback Sam “Bam” Cunningham Dies At 71 *Issei Kitagawa, 78, Japanese politician, member of the House of Councillors (2004–2016), prostate cancer.北川イッセイ元参院議員が死去 大阪選出 国土交通副大臣など *Martha Patricia Ramírez Lucero, 69, Mexican lawyer and politician, Deputy (2018-2021).Fallece Martha Patricia Ramírez Lucero, ex-diputada federal *Eiichi Yamamoto, 80, Japanese movie director (Belladonna of Sadness, Little Wansa) and screenwriter (Space Battleship Yamato).Belladonna of Sadness, Cleopatra Director Eiichi Yamamoto Passes Away *Ameer Zaman, 65, Pakistani politician, MP (2013–2018) and Minister of Postal Services (2017–2018), problems caused by diabetes.JUI-F leader Maulana Ameer Zaman passes away ===8=== *Sir Antony Acland, 91, British politician, Ambassador to the United States (1986–1991).Sir Antony Acland, Foreign Office Permanent Under-Secretary and Ambassador to the US who became a favourite of Mrs Thatcher – obituary *Abbas Ansarifard, 65, Iranian football executive, Chairman of Persepolis (1990–1993, 2001, 2009), COVID-19.عباس انصاری فرد درگذشت *Edward Barnes, 92, British television executive and producer, co-creator of Blue Peter.Blue Peter and Newsround co-creator Edward Barnes dies, aged 92 (death announced on this date) *Gérard Farison, 77, French footballer (Saint-Étienne, ÉFC Fréjus, national team) and manager.Gérard Farison, l'ancien joueur de l'AS Saint-Etienne, est décédé *Franco Graziosi, 92, Italian actor (The Terrorist, Duck, You Sucker!, We Have a Pope).Morto Franco Graziosi: la sua carriera da Strehler a Sorrentino *Amy Hawkins, 110, Welsh supercentenarian and TikTok personality, oldest person in Wales.Wales' oldest woman and TikTok star, Amy Winifred Hawkins, dies aged 110 *Betty Karnette, 89, American politician, member of the California State Assembly (1992–1994, 2004–2008) and State Senate (1996–2004).Betty Karnette, former state senator and assemblywoman who represented Long Beach, San Pedro, dies at 90 *Uno Loop, 91, Estonian pop jazz singer, guitarist and athlete, problems caused by Alzheimer's disease.Suri laulja Uno Loop *Dietmar Lorenz, 70, German judoka, Olympic champion (1980).Dietmar Lorenz Judoka *Aleksandr Melnik, 63, Russian movie director (Terra Nova, Territory), fall.Глава МЧС Зиничев погиб, спасая кинорежиссера Александра Мельника *Art Metrano, 84, American actor (Police Academy, They Shoot Horses, Don't They?, Joanie Loves Chachi) and comedian.Art Metrano, Stand-Up Comic and ‘Police Academy’ Actor, Dies at 84 *Jordi Rebellón, 64, Spanish actor (Hospital Central, Médico de familia, Sin identidad), stroke.El legado de Jordi Rebellón: todas las series y películas en las que actuó *Robert A. Rovner, 77, American politician, radio personality and lawyer, member of the Pennsylvania State Senate (1971–1974).Robert A. Rovner, former Pennsylvania state senator, longtime lawyer, and radio talk show host, dies at 77 *Ludovico Vico, 69, Italian politician, Deputy (2006–2013, 2015–2018).Addio all'ex deputato dem Ludovico Vico. Letta: \"Un giorno davvero triste\" *Luis Villafuerte, 86, Filipino politician, Minister of Trade (1979–1981), Governor of Camarines Sur (1986–1992, 1995–2004) and member of the House of Representatives (2004–2013).Ex-CamSur Rep. Luis Villafuerte Sr. passes away *Kyle Van De Water, 41, American lawyer and politician, suicide by gunshot.Veteran and former congressional candidate Kyle Van De Water dies at age 41 (body discovered on this date) *Yevgeny Zinichev, 55, Russian politician and general, Governor of Kaliningrad Oblast (2016) and Minister of Emergency Situations (since 2018), fall.Глава МЧС Зиничев погиб на учениях ===9=== *Marianne Battani, 77, American politician and lawyer, Judge of the U.S. District Court for the Eastern District of Michigan (since 2000), cancer.Retired federal judge Marianne Battani dies after long illness *Urbain Braems, 87, Belgian footballer (Club Brugge) and manager (Anderlecht, Trabzonspor). *Sir Timothy Colman, 91, British businessman, Lord Lieutenant of Norfolk (1978–2004).'Enormous contribution' - Norfolk's love for Sir Timothy Colman *Marian Duś, 83, Polish Roman Catholic prelate, Auxiliary Bishop of Warsaw (1986–2013).Zmarł bp Marian Duś *Caspar Einem, 73, Austrian businessman (Jetalliance) and politician, Minister of the Interior (1995–1997) and member of the National Council (2000–2007).Ehemaliger Innen- und Wissenschaftsminister Caspar Einem gestorben *Wiesław Gołas, 90, Polish actor (Dzięcioł, Czterdziestolatek, The Deluge).Nie żyje aktor Wiesław Gołas *Jean- Claude van Itallie, 85, Belgian-born American playwright (America Hurrah) and political activist, pneumonia.Jean Claude van Itallie *Gene Littles, 78, American basketball player (Carolina Cougars) and coach (Cleveland Cavaliers, Charlotte Hornets).Ex-Hornets coach, ABA player Gene Littles dies at 78 *Bruce McFee, 60, Scottish politician, MSP (2003–2007), problems caused by a stroke.Tributes flood in for former councillor and MSP Bruce McFee who has died aged 60 *Lucette Michaux-Chevry, 92, French politician, Deputy (1988–1993), Senator (1995–2011) and Mayor of Basse-Terre (1995–2001, 2008–2014).Lucette Michaux-Chevry, ancienne ministre de Jacques Chirac, est décédée *Leif Frode Onarheim, 87, Norwegian businessman (NHO) and politician, MP (2001–2005).Tidligere næringslivsleder og politiker Leif Frode Onarheim er død *Tarcísio Padilha, 93, Brazilian philosopher, member (since 1997) and Chairman of the Academia Brasileira de Letras (2000–2001), COVID-19.Morre Tarcísio Padilha, ex-presidente da Academia Brasileira de Letras, de Covid *Danilo Popivoda, 74, Slovenian footballer (Olimpija, Eintracht Braunschweig, Yugoslavia national team) and manager.Umrl Danilo Popivoda, legenda Olimpije in slovenskega nogometa *Helm Stierlin, 95, German psychiatrist.Helm Stierlin gestorben - Ein Nachruf von Fritz B. Simon *Jim Van Engelenhoven, 75, American politician, member of the Iowa House of Representatives (1999–2012).Former local state representative dies *Kurt Zwickl, 72, American politician, member of the Pennsylvania House of Representatives (1973–1984).Kurt Zwikl, former Pennsylvania state representative and fixture in Allentown for decades, dies at 72 years old ===10=== *Charles Konan Banny, 78, Ivorian politician, Prime Minister (2005–2007), COVID-19.Former I. Coast PM dies of coronavirus *Michael Chapman, 80, English folk singer-songwriter and guitarist (\"True North\").Folk guitar great Michael Chapman dead at 80 *Stephen H. Grimes, 97, American politician and lawyer, member (1987–1996) and Chief Justice of the Supreme Court of Florida (1994–1996). *Raymond E. Peet, 100, American vice admiral, Commander of the First Fleet (1970–1972).VADM Raymond Edward Peet *Jorge Sampaio, 81, Portuguese lawyer and politician, Leader of the Opposition (1988–1992), Mayor of Lisbon (1990–1995) and President (1996–2006), respiratory failure.Morreu Jorge Sampaio *Dalal bint Saud Al Saud, Saudi royal and philanthropist, cancer.وفاة الأميرة دلال بنت سعود *Jón Sigurðsson, 75, Icelandic politician and businessman, Governor of the Central Bank of Iceland (2003–2006) and Minister of Industry and Commerce (2006–2007), prostate cancer.Jón Sigurðsson, fyrrverandi Seðlabankastjóri, látinn *Gordon Spice, 81, British racing driver and car engineer (Spice Engineering), cancer. (death announced on this date) *Saadi Yacef, 93, Algerian NLF independence fighter, actor (The Battle of Algiers) and politician, Senator (since 2001).Yacef Saâdi est mort : un grand nom de le révolution s’éteint *Duygun Yarsuvat, 84, Turkish lawyer and football executive, Chairman of Galatasaray (2014–2015).Galatasaray'ın eski başkanlarından Duygun Yarsuvat hayatını kaybetti *André Zacharow, 82, Brazilian politician, economist, and lawyer, Deputy (2003–2015), COVID-19.Ex- deputado federal André Zacharow morre aos 82 anos em Curitiba ===11=== *Minna Aaltonen, 54, Finnish actress (London's Burning, Lexx) and television host (Gladiaattorit), problems caused by surgery.Gladiaattorit-juontaja Minna Aaltonen on kuollut *Abimael Guzmán, 86, Peruvian Maoist leader and convicted terrorist, founder of Shining Path.Abimael Gumzan, founder of Peruvian rebel group Shining Path, dies *Tommy Hazouri, 76, American politician, member of the Florida House of Representatives (1974–1986) and Mayor of Jacksonville (1987–1991), problems caused by lung transplant surgery.Fighter, mentor, friend: Tommy Hazouri dies at 76 *María Mendiola, 69, Spanish pop singer (Baccara).Maria Mendiola från gruppen Baccara har gått bort – 69 år gammal *Roger Sénié, 101, French politician, Mayor of La Bastide-de-Bousignac (1947–2014).Ariège : Roger Sénié, ancien plus vieux maire de France de La Bastide-de-Bousignac, est décédé à 101 ans *Simon Shnoll, 91, Russian biophysicist and science historian, member of the Russian Academy of Natural Sciences (since 1990).Умер известный ученый и популяризатор науки Симон Шноль *Phùng Quang Thanh, 72, Vietnamese Army general and politician, Chief of the General Staff (2001–2006), member of the Politburo (2006–2016) and Minister of Defence (2006–2016), lung cancer.Đại tướng Phùng Quang Thanh từ trần *Mick Tingelhoff, 81, American Hall of Fame football player (Minnesota Vikings), cancer.Vikings Mourn Passing of Mick Tingelhoff *Gloria Warren, 95, American actress (Dangerous Money, Cinderella Swings It, Bells of San Fernando), singer and pianist.Gloria Gold ===12=== *Fran Bennett, 84, American actress (Nightingales, Sunset Beach, Wes Craven's New Nightmare) and acting teacher.In Memoriam: Fran Bennett *Bernardino Cano Radil, 65, Paraguayan politician, Deputy (1989–1998) and Ambassador to Cuba (since 2015), COVID-19.Muere de COVID Bernardino Cano Radil, embajador paraguayo en Cuba *Carlo Chendi, 88, Italian cartoonist (Disney comics).Addio al fumettista Carlo Chendi *Andreas Herczog, 74, Hungarian-born Swiss politician, National Councillor (1979–1999), COVID-19.Zürcher Alt-Nationalrat Herczog (SP) stirbt trotz Impfung an Corona *Sondra James, 82, American sound designer (Sex and the City, Royal Pains) and actress (Joker), lung cancer.Sondra James Dies: ‘Joker’ And ‘Sick Of It’ Actor, Sound Department Veteran Was 82 *Djohari Kahar, 89, Indonesian politician, MP (1982–1992).Ketua DPRD Sumbar Era 80-an Djohari Kahar Meninggal Dunia *Michel Maïque, 73, French rugby league player (Lézignan, national team) and politician, Mayor of Lézignan-Corbières (2014–2020), pancreatitis.Lézignan-Corbières : Décès de Michel Maïque, le souvenir d'un élu de terrain *James Snyder Jr., 76, American lawyer, writer and politician, member of the North Carolina House of Representatives (1969–1973).N. Carolina Republican candidate Jim Snyder dead at 76 *John Shelby Spong, 90, American Episcopal prelate, Bishop of Newark (1979–2000), problems caused by a stroke.John Shelby Spong, liberal Episcopal bishop, dies at age 90 *Fabio Taborre, 36, Italian road racing cyclist.Pescara, morto l'ex ciclista professionista Fabio Taborre. Aveva 36 anni *Giannis Theonas, 80, Greek politician, MEP (1994–2001) and MP (since 2015).Πέθανε ο Γιάννης Θεωνάς *Gunnar Utterberg, 78, Swedish sprint canoer, Olympic champion (1964).Gunnar Utterberg *Antonio Verini, 85, Italian politician, member of the Regional Council of Abruzzo (2005–2008) and Deputy (2006).L'Aquila, addio ad Antonio Verini. Ex deputato e consigliere regionale ===13=== *Mike Boyle, 77, American politician and lawyer, Mayor of Omaha (1981–1987), pneumonia caused by lung cancer.Former Omaha Mayor, current County Commissioner Mike Boyle passes away *Ruly Carpenter, 81, American baseball executive, President of the Philadelphia Phillies (1972–1981).Ruly Carpenter, who owned the Phillies when they won the 1980 World Series, dies at 81 *Don Collier, 92, American actor (Bonanza, Gunsmoke, The High Chaparral), lung cancer.Don Collier, Actor on ‘The High Chaparral,’ ‘Outlaws’ and Many Other Westerns, Dies at 92 *Oscar Fernandes, 80, Indian politician, MP (1980–1996, since 1998) and Minister of Road Transport and Highways (2013–2014), thrombus caused by a fall.Oscar Fernandes, senior Congress leader, passes away in Mangaluru *Bob Faehn, 63, American politician, member of the South Dakota House of Representatives (2005–2011), cancer. *Olivier Giscard d'Estaing, 93, French politician, Mayor of Estaing (1965–1977) and Deputy (1968–1973), co-founder of INSEAD.Valéry Giscard d'Estaing : mort de son frère Olivier, la famille face à nouveau deuil *Parys Haralson, 37, American football player (Tennessee Volunteers, San Francisco 49ers, New Orleans Saints).Former San Francisco 49ers LB Parys Haralson, who also played for New Orleans Saints, dies at 37 *Antony Hewish, 97, British radio astronomer, Nobel Prize winner (1974).Professor Antony Hewish (1924 – 2021) *Borisav Jović, 92, Serbian politician, President of the Presidency of Yugoslavia (1990–1991) and Secretary General of the Non-Aligned Movement (1990–1991), COVID-19.Preminuo Borisav Jović *Andrey Makeyev, 69, Russian basketball player, Olympic bronze medalist (1976).Умер бронзовый призер Олимпиады по баскетболу Андрей Макеев *Ruben Reyes, 82, Filipino politician and lawyer, Associate Justice of the Supreme Court (2007–2009).SC mourns death of ex-justice Ruben Reyes *Fred Stanfield, 77, Canadian ice hockey player (Chicago Blackhawks, Boston Bruins, Minnesota North Stars), Stanley Cup champion (1970, 1972). *Amédée Turner, 92, British politician, MEP (1979–1994).'Hard-working, eccentric and very good company' – Suffolk's first MEP remembered *Colin Urquhart, 81, British neocharismatic preacher, cancer.Leading figure in UK charismatic movement Pastor Colin Urquhart dies after 55 years of ministry *Tom Vraalsen, 85, Norwegian politician, Minister of International Development (1989–1990), Ambassador to the United Kingdom (1994–1996) and United States (1996–2001).Vraalsen, Tom Eric (1936-2021) *George Wein, 95, American jazz pianist and promoter, founder of the Newport Jazz Festival, Newport Folk Festival, and New Orleans Jazz & Heritage Festival.George Wein, Jazz Festival Trailblazer, Is Dead at 95 ===14=== *Joseba Arregui Aramburu, 75, Spanish theologian, academic and politician, member of the Basque Parliament (1999–2001).Muere Joseba Arregi, el vasco que abandonó la fe nacionalista para defender la dignidad de las víctimas *David Yonggi Cho, 85, South Korean Christian minister and convicted embezzler, co- founder of Yoido Full Gospel Church, problems caused by a stroke.여의도순복음교회 설립 조용기 목사 별세…향년 86 *Viktor Kazantsev, 75, Russian Ground Forces general and politician, Envoy to the Southern Federal District (2000–2004).Экс-командующий группировкой войск на Северном Кавказе Виктор Казанцев умер в Краснодаре *Reuben Klamer, 99, American board game inventor (The Game of Life).Reuben Klamer, Creator of The Game of Life, Dies at 99 *Ladislav Lubina, 54, Czech ice hockey player (HC Pardubice, HC Dukla Jihlava, HC Oceláři Třinec), Olympic bronze medalist (1992), brain cancer.Zemřel Ladislav Lubina (†54), získal tituly s Pardubicemi i medaile z MS *Norm Macdonald, 61, Canadian comedian, actor and screenwriter (Saturday Night Live, The Norm Show, Dirty Work), leukemia.Norm Macdonald dies: influential comedian & former ‘SNL’ Weekend Update anchor was 61 *Ida Nudel, 90, Russian-Israeli economist and civil rights activist.Frühere Dissidentin Ida Nudel mit 90 Jahren gestorben *Yuriy Sedykh, 68, Russian track and field athlete, Olympic champion (1976, 1980) and silver medalist (198).Умер рекордсмен мира в метании молота Юрий Седых *Vicente Zarzo Pitarch, 83, Spanish horn player and writer.Death of leading Spanish horn, 83 ===15=== *Philippe Adrien, 81, French actor (Green Harvest) and playwright.La mort de Philippe Adrien, l’emblématique directeur du théâtre de la tempête *Fernando Mario Chávez Ruvalcaba, 88, Mexican Roman Catholic prelate, Bishop of Zacatecas (1999–2008), COVID-19.Fallece el obispo emérito Fernando Mario Chávez Ruvalcaba *Rob Duhamel, 66, Jersey politician, MP (1993–2014) and Minister of Planning and Environment Affairs (2011–2014).Former Environment Minister Rob Duhamel dies aged 66 (death announced on this date) *Penny Harrington, 79, American police officer, Chief of the Portland Police Bureau (1985–1986).Penny Harrington, first female police chief in a major U.S. city, dies in Morro Bay *Satoshi Hirayama, 91, Japanese-American baseball player (Hiroshima Carp).Former Fresno State two- sport dynamo Satoshi ‘Fibber’ Hirayama passes away at 91 *Justín Javorek, 85, Slovak footballer (Inter Bratislava, Czechoslovakia national team) and manager (Tatran Prešov).Chytal za Tatran Prešov či Inter. Zomrel bývalý brankár Justín Javorek *Žana Lelas, 51, Croatian basketball player, Olympic silver medalist (1988).Iz Splita stiže tužna vijest: Preminula Žana Lelas, jedna od najboljih hrvatskih košarkašica u povijesti *Marthe Mercadier, 92, French actress (Three Telegrams, The Night Is My Kingdom, Rendezvous in Grenada), problems caused by Alzheimer's disease.Marthe Mercadier, la reine du théâtre de boulevard, est morte *W. Tayloe Murphy Jr., 88, American politician, member of the Virginia House of Delegates (1982–2000) and State Secretary of Natural Resources (2002–2006).Virginia Environmental Leader W. Tayloe Murphy Passes Away *Gavan O'Herlihy, 70, Irish-born American actor (Never Say Never Again, Willow, Twin Peaks).Death of Irish Actor Gavan O'Herlihy *Bill Sudakis, 75, American baseball player (Los Angeles Dodgers, Texas Rangers, New York Yankees).Bill Sudakis Stats ===16=== *Adnan Abu Walid al-Sahrawi, 48, Moroccan Islamic militant, Leader of the Islamic State in the Greater Sahara (since 2015), shot.Macron says French forces killed Islamic State leader in Sahara (death announced on this date) *Lou Angotti, 83, Canadian ice hockey player (Chicago Blackhawks, New York Rangers, Philadelphia Flyers).Flyers’ first-ever captain Lou Angotti dies at 83 *Boet van Dulmen, 73, Dutch motorcycle road racer, car crash.Boet van Dulmen (73) died after traffic accident in Ammerzoden *Geoff Hill, 52, British news editor (ITV News), leukaemia.Former ITV News editor Geoff Hill dies aged 52 after four-year leukaemia battle *Dušan Ivković, 77, Serbian Hall of Fame basketball player and coach (Partizan, Olympiacos, Yugoslavia national team), herpes caused by pulmonary edema.Preminuo je Dušan Duda Ivković *Hlengiwe Mkhize, 69, South African politician, MP (since 2009), Minister of Home Affairs (2017) and Higher Education (2017–2018).Deputy Minister Hlengiwe Mkhize passes away *George Mraz, 77, Czech-born American jazz musician.Murió George Mraz, un contrabajista exquisito que tocó con los grandes artistas de la escena del jazz *Casimir Oyé-Mba, 79, Gabonese politician, Governor of the Bank of Central African States (1978–1990) and Prime Minister (1990–1994), COVID-19.Gabon : Décès de Casimir Oye Mba à Paris *Jane Powell, 92, American actress (A Date with Judy, Seven Brides for Seven Brothers, Royal Wedding), singer and dancer.Jane Powell Dies: Hollywood Golden Age Actress & ‘Royal Wedding’ Star Was 92 *John Ruggie, 76, American political scientist.In Memory of John G. Ruggie *Graciete Santana, 40, Brazilian Olympic long-distance runner (2016), melanoma.Maratonista Graciete Santana morre aos 40 anos *Sir Clive Sinclair, 81, English businessman and inventor, founder of Sinclair Radionics, Sinclair Research and Sinclair Vehicles, cancer.Home computing pioneer Sir Clive Sinclair dies aged 81 *Ruth C. Sullivan, 97, American autism activist, co-founder of the Autism Society of America.Autism pioneer Ruth Sullivan dies at 97 ===17=== *Abdelaziz Bouteflika, 84, Algerian politician, President of the United Nations General Assembly (1974–1975), Minister of Foreign Affairs (1963–1979) and President (1999–2019), cardiac arrest by a stroke.Algeria's former President Bouteflika dies at 84 *Roger Brown, 84, American Hall of Fame football player (Maryland State, Detroit Lions, Los Angeles Rams).NFL star and Portsmouth restaurateur Roger Brown dies at 84 *Avril Elgar, 89, English actress (Spring and Port Wine, The Medusa Touch, George and Mildred).Avril Elgar obituary *Carlos Gianelli, 73, Uruguayan lawyer and politician, Ambassador to the United States (2005–2012, 2015–2020), heart attack.Murió el exembajador uruguayo en Estados Unidos Carlos Gianelli *Kemal Kurspahić, 74, Bosnian journalist (Oslobođenje) and politician.Preminuo Kemal Kurspahić, urednik godine u svijetu 1993. *Alfred Miodowicz, 92, Polish trade unionist and politician, MP (1985–1989).Zmarł pierwszy przewodniczący OPZZ Alfred Miodowicz *Thanu Padmanabhan, 64, Indian theoretical physicist, heart attack.Theoretical physicist Thanu Padmanabhan passes away *Ronald Paris, 88, German painter and graphic artist.Brandenburger Maler Ronald Paris gestorben *Alfonso Sastre, 95, Spanish playwright, essayist, and critic.Fallece el dramaturgo Alfonso Sastre a los 95 años en Hondarribia *Minja Subota, 82, Serbian television host (RTS).Minja Subota died at the age of 82 *Wataru Takeshita, 75, Japanese politician, member of the House of Representatives (since 2000) and Minister of Reconstruction (2014–2015), esophageal cancer.竹下亘・元復興相が死去 自民派閥会長、元首相の実弟 *Michał Turkiewicz, 64, Polish politician and teacher, MP (2001–2005).Zmarł Michał Turkiewicz ===18=== *Julos Beaucarne, 85, Belgian singer-songwriter and actor (The Mystery of the Yellow Room).Décès du poète et chanteur Julos Beaucarne *Mario Camus, 86, Spanish movie director and screenwriter (La colmena, The Holy Innocents, The House of Bernarda Alba).Legendary Spanish Film director Mario Camus dies aged 86 *Jolidee Matongo, 46, South African politician, Mayor of Johannesburg (since 2021), car crash.New Joburg mayor Jolidee Matongo dies in a car accident *Neil McCarthy, 81, American college basketball coach (Weber State Wildcats, New Mexico State Aggies).Former NM State hoops coach Neil McCarthy passes away at 81 *Mick McGinty, American artist (Street Fighter II), cancer.Mick McGinty, Legendary Artist for ‘Street Fighter II,’ Has Died *Albert J. Raboteau, 78, American religion scholar, Dean of Princeton University Graduate School (1992–1993). *Gudmund Restad, 83, Norwegian politician, Mayor of Smøla (1980–1985), MP (1985–2001) and Minister of Finance (1997–2000).Tidligere finansminister Gudmund Restad er død *Chris Anker Sørensen, 37, Danish Olympic road racing cyclist (2008), hit by a car.Chris Anker Sørensen er død efter ulykke - TV 2 ===19=== *James Bilbray, 83, American politician, lawyer and businessman, member of the U.S. House of Representatives from Nevada's 1st congressional district (1987–1995) and Chairman of the Board of Governors of the USPS (2014–2016).Former US Rep. James Bilbray dies *Sylvano Bussotti, 89, Italian composer, poet and theatre director.Musica, addio al compositore Sylvano Bussotti: Firenze si preparava a festeggiare i 90 anni *John Carroll, 91, American lawyer and politician, member of the Hawaii House of Representatives (1971–1979) and State Senate (1979–1981).John Carroll, longtime Hawaii Republican leader, dies at 91 *John Challis, 79, English actor (Only Fools and Horses, The Green Green Grass, Benidorm) and comedian, pancreatic cancer.Only Fools and Horses actor John Challis dies *Cheung Yan-lung, 99, Hong Kong businessman and politician, member of the Heung Yee Kuk (1964–1966), Legislative Council (1981–1991) and Chairman of the Regional Council (1986–1991).Former Heung Yee Kuk chair Benton Cheung passes away at 103 *Stephen Critchlow, 54, British actor (Skins, Kenneth Williams: Fantabulosa!, Rocket Boy and Toro).RIP Stephen Critchlow (death announced on this date) *Steve Davisson, 63, American politician, member of the Indiana House of Representatives (since 2010), cancer.Indiana State Rep. Steve Davisson dies of cancer *Jimmy Greaves, 81, English Hall of Fame footballer (Chelsea, Tottenham Hotspur, national team), World champion (1966).Jimmy Greaves: Former England, Tottenham and Chelsea striker dies aged 81 *George Holliday, 61, American witness (Rodney King), COVID-19.George Holliday, The Man Who Filmed Rodney King Being Beaten By LAPD, Dead From Covid *Ole Nordhaug, 96, Norwegian Lutheran clergyman, Bishop of Møre (1983–1991).Tidligere Møre-biskop Ole Nordhaug er død *Dinky Soliman, 68, Filipino politician and activist, Secretary of Social Welfare and Development (2001–2005, 2010–2016), problems caused by kidney and heart failure.Former DSWD secretary Dinky Soliman dies, 68 *Marina Tucaković, 67, Serbian songwriter (\"Ovo je Balkan\", \"Nije ljubav stvar\", \"Ljubav je svuda\"), COVID-19.Преминула Марина Туцаковић ===20=== *Sherwood Boehlert, 84, American politician, member of the U.S. House of Representatives from New York (1983–2007), problems caused by dementia.Former Rep. Sherwood Boehlert, leading GOP voice on environment, dies at 84 *Cloyd Boyer, 94, American baseball player (St. Louis Cardinals).Cloyd Victor Boyer *Sarah Dash, 76, American soul funk singer-songwriter (Labelle) and actress (Sgt. Pepper's Lonely Hearts Club Band).Sarah Dash of Labelle dies at age 76 *Jan Jindra, 89, Czech rower, Olympic champion (1952) and bronze medalist (1960).Odešel třeboňský veslař, olympijský vítěz a dlouholetý předseda klubu Jan Jindra *Aloys Jousten, 83, Belgian Roman Catholic prelate, Bishop of Liège (2001–2013).Emeritus bisschop van Luik Aloys Jousten plots overleden *Claude Lombard, 76, Belgian pop singer (\"Quand tu reviendras\"), Eurovision contestant (1968).Mort de la chanteuse Claude Lombard, reine des génériques de séries animées des années 1980 *Billy Maxwell, 92, American golfer (PGA Tour, Champions Tour), U.S. Amateur winner (1951).Seven-time TOUR winner Billy Maxwell, a former Ryder Cup player, passes away *Helmut Oberlander, 97, Ukrainian-born Canadian Einsatzgruppen soldier and Nazi interpreter.Helmut Oberlander: Ex-Nazi death squad interpreter dies at 97 in Canada ===21=== *Aharon Abuhatzira, 82, Moroccan-born Israeli politician and convicted fraudster, MP (1977–1992), Minister of Religions (1977–1981) and Labor (1981–1982).Aharon Abuhatzira, former MK and Minister of Religious Affairs, dies *Enea Cerquetti, 83, Italian politician, Mayor of Cinisello Balsamo (1970–1979) and Cusano Milanino (1990–1994).Addio all'ex sindaco Enea Cerquetti, lutto cittadino fino al funerale *Angelo Codevilla, 78, Italian- American academic and writer.Angelo Codevilla, R.I.P. *Romano Fogli, 83, Italian footballer (Bologna, Milan, national team) and manager.Morto Romano Fogli, vinse uno scudetto col Bologna e la Coppa dei Campioni col Milan *Marcia Freedman, 83, American-Israeli activist and politician, MP (1974–1977).מרשה פרידמן, הח\"כית הראשונה שיצאה מהארון, מתה בגיל 83: \"פרצה דרך לנשים\" *Willie Garson, 57, American actor (Sex and the City, White Collar, John from Cincinnati), pancreatic cancer.Willie Garson Dies: ‘Sex And The City’ Star Was 57 *Al Harrington, 85, Samoan-American actor (Hawaii Five-O).Legendary Hawaii entertainer Al Harrington dies at age 85 *Richard H. Kirk, 65, English electronic musician (Cabaret Voltaire, Sweet Exorcist) and songwriter (\"Yashar\").Cabaret Voltaire’s Richard H. Kirk dead at 65 *La Prieta Linda, 88, Mexican singer and actress (Valente Quintero).Murió Queta Jiménez, 'La Prieta Linda', hermana de Flor Silvestre *John Brendan McCormack, 86, American Roman Catholic prelate, Bishop of Manchester, New Hampshire (1998–2011).Retired Bishop John McCormack has died *Jack Minore, 82, American politician, member of the Michigan House of Representatives (1999–2004).Former Flint councilman, state legislator Jack Minore dies at 82 *Peter Palmer, 90, American actor (Li'l Abner, Custer).Peter Palmer, Star of ‘Li’l Abner’ on Broadway and the Big Screen, Dies at 90 *Anthony Pilla, 88, American Roman Catholic prelate, Auxiliary Bishop (1979–1980) and Bishop (1980–2006) of Cleveland.Bishop Anthony Pilla, who led Diocese of Cleveland from 1981-2006, passes away at age 88 *Frank Pratt, 79, American politician, member of the Arizona House of Representatives (2009–2017, since 2021) and State Senate (2017–2021).Pratt – elder statesman of Legislature – dies *Carlos Ramos Núñez, 61, Peruvian politician, lawyer and academic, Justice of the Constitutional Court (since 2014), cardiac arrest.Falleció Carlos Ramos Núñez, magistrado del Tribunal Constitucional *Mohamed Hussein Tantawi, 85, Egyptian Army Field Marshal and politician, Minister of Defense (1991–2012) and Chairman of the Supreme Council of the Armed Forces (2011–2012).Former Egyptian defense minister Mohamed Hussein Tantawi dies at 85 ===22=== *Sir Silas Atopare, 70, Papua New Guinean politician, Governor-General (1997–2004).Former G-G Passes On *Pieter Beelaerts van Blokland, 88, Dutch politician, Mayor of Amstelveen (1971–1977) and Hengelo (1981–1985, 1999–2000) and Deputy (1981).Oud-minister Beelaerts van Blokland overleden *Abdelkader Bensalah, 79, Algerian politician, President of the APN (1997–2002) and Council of the Nation (2002–2019) and Head of State (2019), problems caused by cancer and COVID-19. *Robert Fyfe, 90, Scottish actor (Last of the Summer Wine, Around the World in 80 Days, Cloud Atlas).Robert Fyfe: Last of the Summer Wine actor dies at 90 (death announced on this date) *Orlando Martínez, 77, Cuban boxer, Olympic champion (1972).Fallece primer monarca olímpico del boxeo cubano *Roger Michell, 65, South African-born British movie director (Notting Hill, Venus, My Cousin Rachel).Roger Michell death: Notting Hill director dies aged 65 *Bob Moore, 88, American Hall of Fame session bassist (The Nashville A-Team) and orchestra leader.Nashville A-Team Musician Bob Moore Dies *Ulf Nilsson, 73, Swedish children's writer.Barnboksförfattaren Ulf Nilsson är död *Jay Sandrich, 89, American Hall of Fame television director (The Mary Tyler Moore Show, The Cosby Show, Soap), multi-time Emmy winner.Jay Sandrich Dies: Prolific Emmy-Winning Director Of ‘The Mary Tyler Moore Show’, ‘The Cosby Show’ & More Was 89 *Matthew Strachan, 50, English composer (Who Wants to Be a Millionaire?) and singer-songwriter (Next Door's Baby).Matthew Strachan, Who Wants To Be A Millionaire theme tune composer, dies ‘suddenly’ aged 50 *Jüri Tamm, 64, Estonian politician and hammer thrower, Olympic bronze medalist (1980, 1988) and MP (1993–2003).Suri endine vasaraheite maailmarekordimees ja kahekordne olümpiapronks Jüri Tamm *Melvin Van Peebles, 89, American movie director, actor and playwright (Sweet Sweetback's Baadasssss Song, Posse, Ain't Supposed to Die a Natural Death).Melvin Van Peebles Dies: Iconic Filmmaker, Actor, and Novelist Was 89 *André Vauchez, 82, French politician, Mayor of Tavaux (1977–2001) and Deputy (1997–2002).L'ancien député et maire de Tavaux André Vauchez est mort ===23=== *Kjell Askildsen, 91, Norwegian writer.Kjell Askildsen er død *Andrew Douglas, 89, American politician and lawyer, Justice of the Ohio Supreme Court (1985–2002), pulmonary fibrosis.Former Ohio Justice Andy Douglas dies at age 89 *John Elliott, 79, Australian businessman and politician, President of the Carlton Football Club (1983–2002) and Liberal Party (1987–1990), problems caused by a fall.Long-time Carlton president John Elliott dead aged 79 *Taito Phillip Field, 68, Samoan- born New Zealand politician, MP (1993–2008).Former Minister Taito Phillip Field has died - 1News understands *Axel Gehrke, 79, German politician, Deputy (since 2017).AfD-Abgeordneter Axel Gehrke gestorben *Edward Janiak, 69, Polish Roman Catholic prelate, Auxiliary Bishop of Wrocław (1996–2012) and Bishop of Kalisz (2012–2020), lung cancer.Nie żyje ks. Edward Janiak, były biskup diecezji kaliskiej *Natalie Meyer, 91, American politician, Secretary of State of Colorado (1983–1995).Natalie Meyer, Longest-Serving Colorado Secretary Of State, Passes Away *Roberto Roena, 81, Puerto Rican salsa percussionist, orchestra leader, and dancer.Murió Roberto Roena, leyenda de la Salsa dura y uno de los músicos más amados por Cali *Charles Grier Sellers, 98, American historian.Charles G. Sellers, Historian Who Upset the Postwar Consensus, Dies at 98 *Mervyn Taylor, 89, Irish politician, TD (1981–1997) and Minister for Labour (1993–1997).Pioneering former Labour minister Mervyn Taylor dies aged 89 *Jorge Liberato Urosa Savino, 79, Venezuelan Roman Catholic cardinal, Archbishop of Valencia (1990–2005) and Caracas (2005–2018), COVID-19.Fallece el cardenal venezolano Jorge Liberato Urosa Savino *Nino Vaccarella, 88, Italian racecar driver.Auto: è morto Ninni Vaccarella, vinse tre volte Targa Florio ===24=== *Pee Wee Ellis, 80, American saxophonist, composer and arranger.Alfred ‘Pee Wee’ Ellis, James Brown Bandleader And Prolific Songwriter, Dies Aged 80 *Eugeniusz Faber, 82, Polish footballer (Ruch Chorzów, Lens, national team).Zmarł Eugeniusz Faber *Freddie Fu, 70, Hong Kong-American orthopaedic surgeon, melanoma.Freddie Fu, pioneering orthopaedic surgeon, dies *Grey Ruthven, 2nd Earl of Gowrie, 81, British politician, businessman and arts administrator, Minister of State for the Arts (1983–1985) and Chancellor of the Duchy of Lancaster (1984–1985).Lord Gowrie obituary *Diana Natalicio, 82, American academic administrator, President of the University of Texas at El Paso (1988–2019).Longest-serving UTEP leader Diana Natalicio dies at 82 *Waka Nathan, 81, New Zealand rugby union player (Auckland, national team). *Raymundo Joseph Peña, 87, American Roman Catholic prelate, Bishop of El Paso (1980–1995) and Brownsville (1995–2009).Former El Paso Bishop Raymundo Peña dies at 87 *Paul Quilès, 79, French politician, Minister of Defence (1985–1986) and Interior (1992–1993) and Deputy (1993–2007), cancer.Paul Quilès, figure socialiste et ancien ministre de François Mitterrand, est mort *Takao Saito, 84, Japanese manga artist (Golgo 13), pancreatic cancer.Golgo 13 manga creator Takao Saito passes away at 84 *Jorge Velasco Mackenzie, 72, Ecuadorian writer, problems caused by a stroke.El escritor Jorge Velasco Mackenzie falleció en Guayaquil ===25=== *Len Ashurst, 82, English football player (Sunderland, Hartlepool United) and manager (Cardiff City).Sunderland legend Len Ashurst has died at the age of 82, the club has confirmed *Théoneste Bagosora, 80, Rwandan military officer and convicted war criminal.Genocide Convict Theoneste Bagosora Dead *Kamla Bhasin, 75, Indian feminist activist.Feminist icon Kamla Bhasin passes away *Swapan Kumar Chakravorty, 67, Indian academic, Chairman of CSSSC (since 2020), problems caused by COVID-19.Professor Swapan Chakravorty passes away *Franco Di Giuseppe, 79, Italian politician, Deputy (1992–1994), car crash.Franco Di Giuseppe muore a due mesi da un grave incidente stradale: fu deputato della Dc negli anni Novanta *Antonio Franco, 74, Spanish journalist (El Periódico de Catalunya, El País).Fallece el periodista Antonio Franco a los 74 años *Elmer Fung, 73, Taiwanese politician, member of the Legislative Yuan (1999–2002), cancer.前立委馮滬祥癌症病逝 享壽73歲 *Hassan Hassanzadeh Amoli, 92, Iranian Islamic scholar, lung disease.Allameh Hasanzadeh Amoli passes away at age of 93 *Patricio Manns, 84, Chilean singer-songwriter and composer (\"Arriba en la Cordillera\"), heart failure.A los 84 muere Patricio Manns, figura fundamental de la música popular chilena *Pierre Montastruc, 89, French politician, Deputy (1986–1988).Monsieur Pierre MONTASTRUC *Walter Scott Jr., 90, American civil engineer, CEO of Kiewit Corporation (1979–1998).Former Kiewit CEO Walter Scott, Jr. dead at 90 *Sergei Shuvalov, 70, Russian politician, Chairman of the Saratov Oblast Duma (2002–2005) and Senator (2005–2010).Ушел из жизни Сергей Шувалов *Mehdi Yaghoubi, 91, Iranian wrestler, Olympic silver medalist (1956), heart disease.Ex-Iran wrestler Yaghoubi passes away ===26=== *Siamak Atlassi, 85, Iranian actor (Ballad of Tara, A Man Without a Shadow), COVID-19.Veteran Iranian actor Siamak Atlasi passes away at 85 *Eliécer Cárdenas, 70, Ecuadorian novelist.Fallece Eliécer Cárdenas, el escritor cañarense que Cuenca adoptó *José Freire Falcão, 95, Brazilian Roman Catholic cardinal, Bishop of Limoeiro do Norte (1967–1971), Archbishop of Teresina (1971–1984) and Brasília (1984−2004), COVID-19.Cardeal dom José Freire Falcão morre após complicações da Covid-19 *Frances Farenthold, 94, American politician, member of the Texas House of Representatives (1969–1973), problems caused by Parkinson's disease.Frances ‘Sissy’ Farenthold, lodestar for Texas liberals, dies at 94 *Syarhey Herasimets, 55, Belarusian footballer (Dinamo Minsk, national team) and manager (Junior Sevan).Памёр знакаміты беларускі футбаліст Сяргей Герасімец *Alan Lancaster, 72, English rock bassist (Status Quo, The Party Boys), problems caused by multiple sclerosis.Status Quo bassist Alan Lancaster has died, aged 72 *Jean-Pierre Pénicaut, 84, French politician, Deputy (1980–1993).Saint-Paul-lès-Dax : l’ancien maire Jean-Pierre Pénicaut est décédé *Kirill Razlogov, 75, Russian movie critic and cultural researcher, President of the Russian Guild of Film Critics (since 2015).Умер кинокритик Кирилл Разлогов *Herzl Shafir, 92, Israeli Defense Forces general, Commissioner of the Israel Police (1980).הרצל שפיר, המפכ\"ל השביעי של ישראל, הלך לעולמו בגיל 92 ===27=== *Darrell Bath, British punk musician (The Vibrators).Muere Darrell Bath (UK Subs, Dogs D’amour) *Roger Hunt, 83, English Hall of Fame footballer (Liverpool, Bolton Wanderers, national team), World champion (1966).Roger Hunt: Former Liverpool and England striker dies aged 83 *Cecilia Lindqvist, 89, Swedish Sinologist and academic.Sinologen och författaren Cecilia Lindqvist är död – blev 89 år *Andrea Martin, 49, American R&B; singer-songwriter (\"I Love Me Some Him\", \"Before You Walk Out of My Life\", \"Don't Let Go\") and record producer. *James L. Mathewson, 83, American politician, member of the Missouri House of Representatives (1975–1981) and State Senate (1981–2005).Missouri State Senator Jim Mathewson dies ===28=== *Karan Armstrong, 79, American operatic soprano.Opern-Diva Karan Armstrong gestorben *Bala V. Balachandran, 84, Indian educator and activist, founder of the Great Lakes Institute of Management.Bala V Balachandran passes away at age 84 *Edward Helfrick, 93, American politican, member of the Pennsylvania House of Representatives (1977–1980), and State Senate (1981–2003).Edward William Helfrick *Eberhard Jüngel, 86, German theologian.Eberhard Jüngel gestorben *Tommy Kirk, 79, American actor (Old Yeller, The Shaggy Dog, The Misadventures of Merlin Jones). *Princess Lalla Malika of Morocco, 88, Moroccan royal.Morocco Mourns Death of Princess Lalla Malika *Bienvenido Lumbera, 89, Filipino poet, critic, and dramatist.National Artist Bienvenido Lumbera passes away at 89 *Phi Nhung, 49, Vietnamese- American singer and actress, COVID-19.Ca sĩ Phi Nhung qua đời vì Covid-19 *Barry Ryan, 72, British pop singer (\"Eloise\") and photographer.Barry Ryan dies at age 72 *Lonnie Smith, 79, American jazz musician, pulmonary fibrosis.Dr. Lonnie Smith, Hammond Organ Virtuoso, Dies at 79 *Moshe David Tendler, 95, American rabbi and biologist.A Bold Leader in Torah and Science ===29=== *Alexandre José Maria dos Santos, 97, Mozambican Roman Catholic cardinal, Archbishop of Maputo (1976–2003).Morreu Dom Alexandre, primeiro cardeal católico moçambicano *Hayko, 48, Armenian pop singer-songwriter (\"Anytime You Need\") and musician, Eurovision contestant (2007) COVID-19.Armenian singer, songwriter Hayko dies aged 48 *Bronius Kutavičius, 89, Lithuanian composer.Bronius Vaidutis Kutavičius *Olivier Libaux, 57, French record producer and musician (Les Objets, Nouvelle Vague).Mort d’Olivier Libaux, musicien pop et producteur branché sur la reprise *Mike Renzi, 80, American composer and music director (Sesame Street).Composer and Musical Director Mike Renzi Dies at 80 *Heiko Salzwedel, 64, German racing cyclist and manager.Rad-Trainerlegende Heiko Salzwedel verstorben *Sabam Sirait, 84, Indonesian politician, member of the People's Representative Council (1967–1971, 1973–1982, 1992–1997, 1999–2004, 2005–2009). *Ivan Tasovac, 55, Serbian pianist, manager and politician, Minister of Culture and Information (2013–2016).Преминуо Иван Тасовац *Michael Tylo, 73, American actor (The Young and the Restless, Zorro, Guiding Light).Soap Alum Michael Tylo Passes Away at 73 ===30=== *Lennart Åberg, 79, Swedish jazz musician and composer.Jazzmusikern Lennart Åberg är död *Luigi Conti, 80, Italian Roman Catholic prelate, Bishop of Macerata-Tolentino-Recanati-Cingoli-Treia (1996–2006) and Archbishop of Fermo (2006–2017).Luigi Conti, morto l'ex vescovo di Fermo. Il dolore dell'arcidiocesi *Carlisle Floyd, 95, American opera composer (Susannah).Obituary: American Opera Composer Carlisle Floyd Dies at 95 *Ravil Isyanov, 59, Russian-born American actor (GoldenEye, K-19: The Widowmaker, Transformers: Dark of the Moon).Горел звездой. На 60-м году жизни не стало нашего земляка, талантливого актера Равиля Исянова (death announced on this date) *Hassan Tarighat Monfared, 75, Iranian physician and politician, Minister of Health and Medical Education (2012–2013), fall.دکتر محمدحسن طریقت منفرد درگذشت *John Rigas, 96, American businessman and convicted fraudster, co-founder of the Adelphia Communications Corporation.Wellsville Legend John Rigas Dies at 96 *Koichi Sugiyama, 90, Japanese composer and orchestrator (Dragon Quest), problems caused by sepsis. ==Months== * January * February * March * April * May * June * July * August ==Related pages== * List of deaths due to COVID-19 * 2021 in association football deaths * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *09 Category:September 2021 events",
 "title": "Deaths in September 2021"
}