{
 "id": "804778",
 "text": "Demosthenes \"Demis\" HassabisΟι άγνωστοι και εκκεντρικοί Ελληνες κροίσοι του ΛονδίνουΗ Τεχνητή Νοημοσύνη στη μάχη με τον κορονοϊό (Covid-19) (born 27 July 1976) is a significant figure in artificial intelligence. He is a British researcher, neuroscientist, video game designer, entrepreneur, and five times winner of the Pentamind board games championship. Hassabis and John M. Jumper were awarded half of the 2024 Nobel Prize in Chemistry for their protein folding predictions. ==Career== Hassabis is the CEO and co-founder of DeepMind, a machine learning and AI research lab, founded in London in 2010 with Shane Legg and Mustafa Suleyman. Hassabis met Legg when both were postdocs at University College London's Gatsby Computational Neuroscience Unit, and he and Suleyman had been friends through family. Hassabis also recruited his university friend and Elixir partner David Silver. DeepMind's mission is to \"solve intelligence\" and then use intelligence \"to solve everything else\". More concretely, DeepMind aims to use powerful general- purpose learning algorithms to build an artificial general intelligence (AGI). The company was bought by Google for £400 million. They created AlphaGo, a program which defeated world champion Lee Sedol at the complex game of Go. Go had been considered a holy grail of AI, for its high number of possible board positions and resistance to existing programming techniques. However, AlphaGo beat European champion Fan Hui 5-0 in October 2015 before winning 4-1 against former world champion Lee Sedol in March 2016. More recently, DeepMind turned its artificial intelligence to protein-folding, one of the toughest problems in science. In December 2018, DeepMind's tool AlphaFold won the 13th Critical Assessment of Techniques for Protein Structure Prediction (CASP) by successfully predicting the most accurate structure for 25 out of 43 proteins. Although Hassabis is expert at many games, he does not program specific rules into Deep Mind. For Go and chess, the machine played many games with itself, learning from its results. In other words it taught itself how to play, given the basic rules of the game. ==Honors== * 2018: Elected a Fellow of the Royal Society (FRS) in May 2018. * 2024 Nobel Prize in Chemistry == References == Category:1976 births Category:British computer scientists Category:Fellows of the Royal Society Category:Living people Category:Alumni of University College London Category:British chess players Category:Commanders of the Order of the British Empire",
 "title": "Demis Hassabis"
}