{
 "id": "804763",
 "text": "The following is a list of deaths that should be noted in December 2021. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of death, must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==December== ===1=== *Jacqueline Avant, 81, American philanthropist, shot.L.A. man, 29, arrested in Jacqueline Avant’s killing in Beverly Hills *Rudolf Bernhardt, 96, German lawyer, President of the European Court of Human Rights (1998).Bundestag diskutierte Teil-Impfpficht / BVerfG zu 2G und Kanzlerwahl / Rohingya klagen gegen Facebook? *Ben Boo, 96, American politician, Mayor of Duluth (1967–1975) and member of the Minnesota House of Representatives (1984–1993).Ben Boo *Bertram Bowyer, 2nd Baron Denham, 94, British politician, member of the House of Lords (1949–2021) and Captain of the Honourable Corps of Gentlemen-at-Arms (1979–1991).Lord Denham, long- serving and effective Chief Whip in the Lords under Margaret Thatcher – obituary *John Cunningham, 83, Scottish Roman Catholic prelate, Bishop of Galloway (2004–2014). *Jean Demannez, 72, Belgian politician, Mayor of Saint- Josse-ten-Noode (1999–2012).Décès de Jean Demannez, figure du PS bruxellois *Abla Farhoud, 76, Canadian writer.\"La dramaturge et romancière Abla Farhoud n’est plus\" *Grand Jojo, 85, Belgian singer.Le Grand Jojo est décédé dans la nuit à l’âge de 85 ans *Anna-Liisa Hyvönen, 95, Finnish politician, MP (1972–1980).Entinen kansanedustaja Anna-Liisa Hyvönen on kuollut *Enrique Jackson, 75, Mexican politician, member (1997–2006) and President of the Senate (2000–2001, 2002–2004, 2005–2006) and Deputy (2015–2018), heart attack.Fallece el ex legislador priísta, Enrique Jackson *Alvin Lucier, 90, American composer (I Am Sitting in a Room, Music on a Long Thin Wire).Alvin Lucier, inquisitive and innovative composer, has died at 90 *Almerindo Marques, 81, Portuguese businessman, banker and politician, Deputy (1983–1985) and President of Rádio e Televisão de Portugal (2002–2008).Morreu Almerindo Marques, antigo presidente da RTP e da Estradas de Portugal *Keiko Nobumoto, 57, Japanese screenwriter (Cowboy Bebop, Wolf's Rain, Tokyo Godfathers), esophageal cancer. *Nikolai Paltsev, 72, Russian politician, Mayor of Stavropol (2008–2011).Ушёл из жизни бывший мэр Ставрополя Николай Пальцев *Rudolf Pohl, 97, German Roman Catholic prelate.Rudolf Pohl widmete der geistlichen Musik sein Leben *Alan Clive Roberts, 87, British materials scientist and engineer. *Razi Shirazi, 94, Iranian jurist and philosopher.آیت الله سید رضی شیرازی درگذشت *Petr Uhl, 80, Czech journalist, activist and politician, member of the Federal Assembly (1990–1992).Communist-era dissident Petr Uhl dies at 80 *Miroslav Zikmund, 102, Czech writer and explorer.Zemřel cestovatel Miroslav Zikmund, bylo mu 102 let ===2=== *Giuseppe Chiaretti, 88, Italian Roman Catholic prelate, Archbishop of Perugia–Città della Pieve (1995–2009).È morto l’arcivescovo Chiaretti, “maestro” di dialogo, cultura e carità *Richard Cole, 75, English music manager (Led Zeppelin).Former Led Zeppelin road manager Richard Cole has died *Jos Dupré, 93, Belgian politician, Mayor of Westerlo (1977–1982, 1989–1996).L’ancien ministre CVP Jos Dupré est décédé à l’âge de 93 ans *Aldo Giordano, 67, Italian Roman Catholic prelate, Apostolic Nuncio to Venezuela (2013–2021) and the European Union (since 2021), COVID-19.Mons. Aldo Giordano: morto a Lovanio il nunzio apostolico presso l’Ue. Era stato segretario Ccee e nunzio in Venezuela. Aveva ispirato Sir Europa *Gérard Grandval, 91, French architect.L'architecte qui avait créé les \"Choux\" de Créteil, Gérard Grandval, est mort *Darlene Hard, 85, American Hall of Fame tennis player.Darlene Hard, 3-time major tennis champion, dies at 85 *Hong Sung-woo, 81, South Korean politician, MP (1979–1988).'연예인 1호 국회의원' 홍성우씨, 혈액암 투병 끝 별세 *Joaquín Jiménez Hidalgo, 85, Spanish politician, Senator (1982–1986).Luto en Antequera por la muerte de Joaquín Jiménez, alcalde de la ciudad y presidente de la Diputación en la década de los 70 *Richard Lerner, 83, American chemist.Scripps Research mourns passing of pioneering scientist Richard Lerner *Bill McKenzie, Baron McKenzie of Luton, 75, British politician and life peer, member of the House of Lords (since 2004).Labour peer Lord Bill McKenzie dies, aged 74 *Poedjono Pranyoto, 85, Indonesian military officer and politician, Regent of Cilacap (1979–1987), Governor of Lampung (1988–1997) and Deputy Speaker of the MPR-R (1997–1999).Mantan Gubernur Lampung Poedjono Pranyoto Tutup Usia *Sir Antony Sher, 72, South African-born British actor (Stanley, Shakespeare in Love, The Wolfman), cancer.Antony Sher, celebrated actor on stage and screen, dies aged 72 *Lovro Šturm, 83, Slovenian lawyer and politician, President of the Constitutional Court (1997–1998) and Minister of Justice (2004–2008).Former minister Lovro Šturm has died *Lawrence Weiner, 79, American conceptual artist.Lawrence Weiner, Giant of Conceptual Art Who Had a Way with Words, Dies at 79 ===3=== *Güldal Akşit, 61, Turkish politician, Minister of Culture and Tourism (2002–2003), COVID-19.Son dakika! AK Partili Güldal Akşit vefat etti *Eileen Ash, 110, English cricketer (Middlesex, national team).Eileen Ash, 1911-2021 *Jean Briane, 91, French politician, Deputy (1971–2002).Député de l'Aveyron pendant trente ans, Jean Briane est décédé *Lamine Diack, 88, Senegalese businessman, sports administrator, and athlete, president of the IAAF (1999–2015).Convicted ex-head of world athletics Lamine Diack dies at 88 *Horst Eckel, 89, German footballer (1. FC Kaiserslautern, SV Röchling Völklingen, West Germany national team), world champion (1954).Horst Eckel, last of Germany's 1954 world champions, dies at 89 - DFB *Wout Holverda, 63, Dutch footballer (Sparta, Fortuna Sittard), COVID-19. *Claude Humphrey, 77, American Hall of Fame football player (Atlanta Falcons, Philadelphia Eagles).Gone Too Soon: Hall-of-Famer Claude Humphrey Passes Away at 77 *Saul Raiz, 91, Brazilian politician, Mayor of Curitiba (1975–1979).Saul Raiz, ex- prefeito de Curitiba, morre aos 91 anos *Edward Shames, 99, American Army colonel, last surviving officer of Easy Company.Edward David Shames *Charlotte Mailliard Shultz, 88, American socialite, problems caused by breast cancer.Charlotte Mailliard Shultz, Widow Of George Shultz, Dies At 88 ; ‘We Have Lost Our Grande Dame’ *Nina Urgant, 92, Russian actress (Tamer of Tigers, Belorussian Station, Bonus).Умерла актриса Нина Ургант *Alfonso Vallejo, 78, Spanish playwright and poet.Muere el dramaturgo Alfonso Vallejo *Momčilo Vukotić, 71, Serbian footballer (FK Partizan, FC Girondins de Bordeaux, Yugoslavia national team).Преминуо Момчило Моца Вукотић *Jōji Yanami, 90, Japanese voice actor (Dragon Ball, Time Bokan, One Piece).Dragon Ball Voice Actor And Narrator Joji Yanami Dies At 90 ===4=== *John Barton, 77, British businessman, Chairman of Next plc and EasyJet.John Barton, former chair of easyJet and Next, dies aged 77 *Hans Blohm, 94, German-Canadian photographer and author.Hans Ludwig Blohm *Sabbaruddin Chik, 79, Malaysian politician, MP (1982–1999) and Minister of Tourism, Arts and Culture (1987–1996), COVID-19.Former Culture, Arts and Tourism Minister Sabaruddin Chik dies *Martha De Laurentiis, 67, American movie producer (Breakdown, Hannibal, U-571), cancer.Martha De Laurentiis Dies: ‘Hannibal’ And ‘Red Dragon’ Producer Was 67 *Vinod Dua, 67, Indian journalist (Doordarshan, NDTV India), problems caused by COVID-19.Veteran journalist Vinod Dua passes away *Mahmoud Hammoud, 57, Lebanese football player (Nejmeh, national team) and manager (Shabab Sahel), COVID-19. *Stonewall Jackson, 89, American country singer (\"Waterloo\", \"B.J. the D.J.\", \"I Washed My Hands in Muddy Water\"), vascular dementia.Stonewall Jackson, Longtime Grand Ole Opry Member, Dies at 89 *Gertraud Jesserer, 77, Austrian actress (Eva, My Daughter and I, I Learned It from Father), house fire.Burgtheaterschauspielerin Gertraud Jesserer bei Wohnungsbrand gestorben *Paul Lannoye, 82, Belgian politician, MEP (1989–2004).Paul Lannoye, membre fondateur du mouvement écologiste en Belgique, est décédé à l’âge de 82 ans *Boris Misnik, 83, Russian politician, Deputy (1995–2000).Умер экс-депутат Госдумы Борис Мисник *Pierre Rabhi, 83, Algerian-born French environmentalist.Pierre Rabhi, figure de l’agroécologie, est mort *Konijeti Rosaiah, 88, Indian politician, Chief Minister of Andhra Pradesh (2009–2010), Governor of Tamil Nadu (2011–2016) and Karnataka (2014).Former Andhra Pradesh CM Konijeti Rosaiah dies at 88 ===5=== *Peter Cundall, 94, English-born Australian horticulturalist and television host (Gardening Australia).Peter Cundall, long-time Gardening Australia host, dies aged 94 *Jean-Paul Didierlaurent, 59, French writer, cancer.L'écrivain vosgien Jean-Paul Didierlaurent est mort *Bob Dole, 98, American politician, member of the U.S. House of Representatives (1961–1969) and U.S. Senator from Kansas (1969–1996), 1996 presidential candidate, lung cancer.Bob Dole, WWII hero and former Republican presidential candidate, dies at 98 *Aurelio Galfetti, 85, Swiss architect.È morto l'architetto Aurelio Galfetti *Christine Haidegger, 79, Austrian writer.Christine Haidegger ist gestorben *Stevan Jelovac, 32, Serbian basketball player (JuveCaserta, Brose Bamberg, CAI Zaragoza), problems caused by a cerebral hemorrhage.TUGA: Preminuo Stevan Jelovac, košarkaški reprezentativac Srbije *M. Sarada Menon, 98, Indian psychiatrist.India’s first woman psychiatrist, Sarada Menon, passes away at 98 *Buddy Merrill, 85, American steel guitarist (The Lawrence Welk Show).Buddy Merrill *John Miles, 72, British singer-songwriter and musician (\"Music\").Le chanteur britannique John Miles est décédé: il n’avait que 72 ans *Bunu Sheriff Musa, 74, Nigerian administrator and engineer.Ex-Minister, Bunu Sheriff Is Dead *Mark Rudinstein, 75, Russian movie producer, actor and television presenter, founder of Kinotavr.Умер создатель \"Кинотавра\" Марк Рудинштейн *Bill Staines, 74, American folk musician, prostate cancer. *Jacques Tits, 91, Belgian-born French mathematician (Tits alternative, Tits group, Tits metric).Décès de Jacques Tits *Renato Turano, 79, Italian politician, Senator (2006–2008, 2013–2018).Morto il senatore Turano, il ricordo di Casini, Greco e Oliverio. «Un grande calabrese» *Demetrio Volcic, 90, Italian journalist (La Repubblica, TG1) and politician, MEP (1999–2004).È morto Demetrio Volcic: raccontò agli italiani il mondo oltre la Cortina di ferro *Osamu Yatabe, 89, Japanese lawyer and politician, member of the House of Councillors (1974–1998).元参院議員の矢田部理氏死去 ===6=== *Hussein Suleiman Abu Saleh, 91, Sudanese politician, Minister of Foreign Affairs (1988–1989, 1993–1995). *André Aschieri, 84, French politician, Deputy (1997–2002).André Aschieri, ancien député-maire de Mouans Sartoux, est mort à 84 ans *Ebrahim Ismail Ebrahim, 84, South African politician and anti-apartheid activist.Struggle veteran Ebrahim Ebrahim dies *George Fleming, 83, American football player (Winnipeg Blue Bombers) and politician, member of the Washington House of Representatives (1969–1971) and Senate (1971–1991).Former Washington state legislator George Fleming dies at 83 *Glenn Foster, 31, American football player (New Orleans Saints).Former New Orleans Saints player Glenn Foster dies after being taken into police custody *Emma Gapchenko, 83, Russian archer, Olympic bronze medalist (1972).Emma Gapchenko *Martin Grüber, 84, German politician, Mayor of Offenburg (1975–1989).Alt-OB Martin Grüber verstorben *Fred Hiatt, 66, American journalist, editor, and columnist (The Washington Post), cardiac arrest.Fred Hiatt, Washington Post editorial page editor, dies at 66 *Thomas W. Horton, 101, New Zealand pilot (RNZAF, RAF).Thomas W. \"Tom\" Horton *Olha Ilkiv, 101, Ukrainian Insurgent Army liaison officer.Зв’язкова Шухевича Ольга Ільків померла на 102-му році життя *János Kóbor, 78, Hungarian singer (Omega), COVID-19.Meghalt Kóbor János *Medina Spirit, 3, American Thoroughbred racehorse, Kentucky Derby winner (2021), heart attack.Medina Spirit, horse at heart of Kentucky Derby controversy, dies while training *Eugenio Minasso, 62, Italian politician, Deputy (2008–2013), problems caused by COVID-19.E' morto Eugenio Minasso *Marvin Morgan, 38, English footballer (Plymouth Argyle, Aldershot Town, Shrewsbury Town).Marvin Morgan: Hartlepool FC pay tribute to ex-player dead at 38 *Aldo Rebecchi, 75, Italian politician, Deputy (1987–2001).Brescia piange Aldo Rebecchi, morto a 75 anni *Masayuki Uemura, 78, Japanese video game engineer (Nintendo). *Kåre Willoch, 93, Norwegian politician, MP (1958–1989), Minister of Trade (1963, 1965–1970) and Prime Minister (1981–1986).Kåre Willoch har gått bort, 93 år gammel ===7=== *Carol Jenkins Barnett, 65, American businesswoman (Publix), problems caused by Alzheimer's disease.Philanthropist, Publix heiress Carol Jenkins Barnett dies at 65 *Mustafa Ben Halim, 100, Libyan politician, Prime Minister (1954–1957) and Minister of Foreign Affairs (1954–1956).وفاة رئيس وزراء ليبيا الأسبق مصطفى بن حليم *Catherine Fournier, 66, French politician, Senator (since 2017).Catherine Fournier, sénatrice centriste du Pas-de-Calais, est décédée *Pavel Hůla, 69, Czech classical violinist (Kocian Quartet, Pražák Quartet) and music educator.Pavel Hůla (1952-2021) *Yury Karabasov, 82, Russian academic and politician, member of the State Duma (2007–2011).Ушел из жизни Юрий Сергеевич Карабасов *Philippe Stevens, 84, Belgian Roman Catholic prelate, Bishop of Maroua-Makolo (1994–2014).Nécrologie: Mgr Philippe Stevens, l’ancien évêque de Maroua – Mokolo est mort *Greg Tate, 64, American music critic (The Village Voice) and musician (Burnt Sugar), co-founder of the Black Rock Coalition.Greg Tate, influential critic, essayist, and chronicler of the Black avant-garde, dies ===8=== *Chris Achilleos, 74, Cypriot-born British illustrator.Chris Achilléos 1947-2021 *Ignacio Cabezón, 66–67, Spanish politician, Mayor of Neda (2007–2015).Pesar en Neda por el fallecimiento del exalcalde Ignacio Cabezón *Sylwester Chęciński, 91, Polish movie and television director (Katastrofa, Sami swoi, Kochaj albo rzuć).Nie żyje Sylwester Chęciński. Reżyser legendarnych \"Samych swoich\" miał 91 lat *Kristina Đukić, 21, Serbian YouTuber, suicide.Popular young streaming sensation Kristina ‘Kika’ Dukic found dead in her home in the Serbian capital of Belgrade *Gerry Foley, 89, American-Canadian ice hockey player (New York Rangers, Toronto Maple Leafs, Los Angeles Kings).Gerald James \"Gerry\" Foley *Mitsutoshi Furuya, 85, Japanese manga artist (Dame Oyaji, Bar Lemon Heart), cancer.Manga Creator Mitsutoshi Furuya Passes Away at 85 *Igor Gamula, 61, Ukrainian-Russian footballer (Zaria Voroshilovgrad, SKA Rostov-on-Don) and manager (Rostov).Не стало Игоря Гамулы *Barry Harris, 91, American jazz musician, problems caused by COVID-19.Barry Harris, beloved jazz pianist devoted to bebop, dies at 91 *Susana Higuchi, 71, Peruvian politician, First Lady (1990–1994) and Deputy (2000–2006), cancer.Susana Higuchi falleció este miércoles a los 71 años de edad *Lars Høgh, 62, Danish footballer (Odense Boldklub, national team) and coach, pancreatic cancer.Lars Høgh er død *Blackjack Lanza, 86, American Hall of Fame professional wrestler (WWWF, WWA, AWA).'World's Meanest Wrestler' Blackjack Lanza Dies *Richie Lewis, 55, American baseball player (Florida Marlins, Detroit Tigers, Oakland Athletics).Former Florida State All-American pitcher, Hall of Famer Richie Lewis dies *Alfredo Moreno, 41, Argentine footballer (Celaya, Ascenso MX, Shandong Luneng), stomach cancer.Liga MX legend Alfredo Moreno passes away *Bipin Rawat, 63, Indian military officer, Chairman of the Chiefs of Staff Committee (2019) and Chief of the Army Staff (2016–2019) and Defence Staff (since 2020), air crash.Defence Chief General Bipin Rawat, Wife Among 13 Killed in Chopper Crash *Robbie Shakespeare, 68, Jamaican bassist (Sly and Robbie, Black Uhuru) and record producer, problems caused by kidney surgery.Sly and Robbie’s Robbie Shakespeare has died, according to reports *Lakhbinder Singh Lidder, 52, Indian Army officer air crash.The Tony I knew: Remembering Brig LS Lidder who lost his life with CDS Bipin Rawat in Coonoor helicopter crash *Andrzej Zieliński, 85, Polish sprinter, Olympic silver medalist (1964).Nie żyje Andrzej Zieliński *Jacques Zimako, 69, French footballer (Bastia, Saint-Étienne, national team).On l'appelait Zimako ===9=== *Shamim Alam Khan, 84, Pakistani military officer, Chairman Joint Chiefs of Staff Committee (1991–1994), COVID-19.Ex-JCSC chairman Gen Shamim Alam passes away *Brian Aldridge, 81, New Zealand cricket umpire.Brian Aldridge death notice *Ryszard Brzuzy, 60, Polish trade unionist and politician, Deputy (1989–1991).\"Nie żyje wieloletni związkowiec z kopalni Bełchatów. Minuta ciszy w Sejmie *Robert Jervis, 81, American politologist.In memory of Robert Jervis, Honorary Graduate at Ca' Foscari in 2014 *Giosuè Ligios, 92, Italian politician, Senator (1972–1983) and MEP (1979–1989).Nuoro, addio all'ex senatore Giosuè Ligios: aveva 93 anni *Aleksandr Neumyvakin, 81, Russian politician, Deputy (1989–1991).Памяти президента Всероссийского общества слепых А. Я. Неумывакина *Otar Patsatsia, 92, Georgian politician, Prime Minister (1993–1995), COVID-19.ოთარ ფაცაცია *Carmen Salinas, 82, Mexican actress (María Mercedes, Abrázame muy fuerte, Under the Same Moon) and politician, Deputy (2015–2018), problems caused by a stroke.Carmen Salinas falleció a los 82 años de edad *Larry Sellers, 72, American actor (Dr. Quinn, Medicine Woman).Larry Sellers, Actor on ‘Dr. Quinn, Medicine Woman,’ Dies at 72 *Demaryius Thomas, 33, American football player (Denver Broncos, New York Jets, Houston Texans), Super Bowl champion (2016), problems caused by CTE.Former Denver Broncos WR Demaryius Thomas, 33, found dead in his home, police say *Al Unser, 82, American Hall of Fame racing driver, four-time Indianapolis 500 winner, IndyCar champion (1983, 1985), liver cancer.Al Unser, 1939-2021 *Lina Wertmüller, 93, Italian movie director (Seven Beauties, Love and Anarchy, Swept Away) and screenwriter.È morta Lina Wertmüller, grande protagonista del cinema italiano: aveva 93 anni *Cara Williams, 96, American actress (The Defiant Ones, Pete and Gladys, Boomerang).Cara Williams, Star of ‘The Defiant Ones’ and ‘Pete and Gladys,’ Dies at 96 *Maryse Wolinski, 78, French writer and journalist (Sud Ouest, Le Journal du Dimanche).La romancière et journaliste Maryse Wolinski est décédée à l'âge de 78 ans ===10 === *Jacques Auxiette, 81, French politician, President of the Regional Council of Pays de la Loire (2004–2015).L’ancien président des Pays de la Loire Jacques Auxiette est décédé *Romulo T. de la Cruz, 74, Filipino Roman Catholic prelate, Archbishop of Zamboanga (since 2014).Zamboanga’s Archbishop De la Cruz dies at 74 *Oded Muhammad Danial, 59, Indonesian politician, Mayor of Bandung (since 2018).Bandung Mayor Oded M Danial Passes Away *Les Emmerson, 77, Canadian rock singer (Five Man Electrical Band), problems caused by COVID-19.Ottawa rock and roll royalty, songwriter of 'Signs' Les Emmerson dead at 77 *Mensi, 65, English punk rock singer (Angelic Upstarts), COVID-19.Mensi (Angelic Upstarts) RIP *Constantin Năsturescu, 81, Romanian footballer (Rapid București, Progresul Brăila, national team).Constantin Bebe Năsturescu a murit la 81 de ani. A fost unul dintre cei mai importanți jucători din istoria Rapidului *Michael Nesmith, 78, American musician (The Monkees) and songwriter (\"Different Drum\", \"Joanne\"), Grammy winner (1982), heart failure.Michael Nesmith, Monkees singer-songwriter, dead at 78 *Ken Osinde, 59, Kenyan politician, Ambassador to Germany (2010–2014).Ruto's Chief of Staff Ken Osinde Dies *Jean-Claude Perrot, 93, French historian.La mort de l'historien Jean-Claude Perrot ===11=== *Janusz Bargieł, 63, Polish politician, Senator (2001–2005).Zmarł Janusz Bargieł *Jack Hedley, 92, British actor (For Your Eyes Only, The Longest Day, Colditz).Jack Hedley Dies: ‘For Your Eyes Only’ And ‘Lawrence Of Arabia’ Star Was 92 *Mel Lastman, 88, Canadian politician, Mayor of North York (1973–1997) and Toronto (1998–2003).Former Toronto Mayor Mel Lastman dies at 88 *Juan Carlos Oyarzún, 70, Argentine politician, Senator (1992–1998).Gran pesar en todo Tierra del Fuego por la muerte de Juan Carlos Oyarzun *Jalal Pishvaian, 91, Iranian actor.جلال پیشوائیان بازیگر پیشکسوت سینما درگذشت *Anne Rice, 80, American writer (The Vampire Chronicles), problems caused by a stroke.Author Anne Rice dies aged 80 *Francisco Rodríguez Pérez, 82, Mexican politician, member (1973–1976, 1982–1985) and President (1983) of the Chamber of Deputies.Muere don paco rodriguez pérez, ex diputado federal y ex presidente del pri *Galina Samsova, 84, Russian ballet dancer.Galina Samsova (1937–2021) R.I.P. *Manuel Santana, 83, Spanish Hall of Fame tennis player, Wimbledon champion (1966), three-time French Open champion, Olympic champion (1968).Falleció Manolo Santana, una gloria del tenis ===12=== *Eduardo Cavieres, 76, Chilean historian and academic.Universidad de Chile lamenta el sensible fallecimiento del profesor Eduardo Cavieres Figueroa *James P. Dugan, 92, American politician, member of the New Jersey Senate (1969–1977).James Dugan, former senator and Dem state chairman, dies at 92 *Margareta Ekström, 91, Swedish writer and translator.Författaren och översättaren Margareta Ekström är död *Vicente Fernández, 81, Mexican singer-songwriter (\"La Derrota\", \"Estos Celos\", \"El Último Beso\") and actor, multiple Grammy Award winner, problems caused by a fall.Muere el cantante Vicente Fernández a los 81 años *Bernie Fowler, 97, American politician, member of the Maryland Senate (1983–1994).Former Calvert Commissioner, Maryland Senator Bernie Fowler Sr. Passes Away At 97 *Roland Hemond, 92, American baseball executive (Chicago White Sox, Baltimore Orioles, Arizona Diamondbacks).Famed White Sox executive Roland Hemond dies at 92 *Maʻafu Tukuiʻaulahi, 65–66, Tongan noble and politician, MP (since 2008).Tongan noble dies in Auckland City Hospital *Sir Paulias Matane, 90, Papua New Guinean politician, Governor-General (2004–2010). *Daniel Nlandu Mayi, 68, Congolese Roman Catholic prelate, Auxiliary Bishop of Kinshasa (1999–2008) and Bishop of Matadi (2010–2021).Bishop Daniel Nlandu Mayi *Stanisław Nowak, 86, Polish Roman Catholic prelate, Archbishop of Częstochowa (1984–2011).Zmarł Ksiądz Arcybiskup Stanisław Nowak *Toddy O'Sullivan, 87, Irish politician, Lord Mayor of Cork (1980–1981) and TD (1981–1997).'Cork has lost a giant of politics and community': Toddy O'Sullivan dies aged 87 *Jimmy Rave, 39, American professional wrestler (NWA Wildside, TNA, ROH).Jimmy Rave Dead at 39 *Silvia Sayago, 66, Argentine politician, Deputy (since 2021), multiple organ failure.Murió la diputada santiagueña Silvia Sayago, que había asumido el martes *Yury Sharov, 82, Russian fencer, Olympic champion (1964).Ушел из жизни олимпийский чемпион Юрий Шаров ===13=== *Falco Accame, 96, Italian politician, Deputy (1976–1983).Addio a Falco Accame, aveva 96 anni *Kevin Billington, 87, British movie director (The Rise and Rise of Michael Rimmer, The Light at the Edge of the World, Interlude).British Film Producer Kevin Billington Passes Away *Blackberri, 76, American singer-songwriter and community activist.Singer-songwriter Blackberri dies *Verónica Forqué, 66, Spanish actress (Bajarse al moro, Kika, What Have I Done to Deserve This?), suicide.Hallan muerta en su casa a la actriz Verónica Forqué a los 66 años *Viktor Gnezdilov, 78, Russian politician, Mayor of Nakhodka (1987–2004).Умер бывший мэр Находки Виктор Гнездилов *Harbans Kapoor, 75, Indian politician, member (since 1989) and Speaker (2007–2012) of the Uttarakhand Legislative Assembly.8-time Uttarakhand MLA Harbans Kapoor passes away in Dehradun *Liam Kavanagh, 86, Irish politician, TD (1969–1997), MEP (1973–1981) and Minister for Labour (1981–1983).Former Labour minister Liam Kavanagh dies aged 86 *Charles R. Morris, 82, American writer (Los Angeles Times, The Wall Street Journal) and banker, problems caused by dementia. *Leszek Murzyn, 61, Polish politician, Deputy (2005–2007).Nie żyje były poseł LPR Leszek Murzyn. \"Nasz przyjaciel z Prawicy Rzeczypospolitej\" *Joe Simon, 85, American soul and R&B; singer (\"The Chokin' Kind\", \"Get Down, Get Down (Get on the Floor)\", \"Power of Love\").Joe Simon, Chart-Topping R&B; Singer, Dead at 85 *Sergei Solovyov, 77, Russian movie director (Wild Pigeon, Assa, Black Rose Is an Emblem of Sorrow, Red Rose Is an Emblem of Love), screenwriter and producer.Умер кинорежиссер Сергей Соловьев *Józef Tejchma, 94, Polish politician, Deputy Prime Minister (1972–1976).Nie żyje Józef Tejchma. Były minister kultury miał 94 lata ===14=== *Muamer Abdulrab, 39, Qatari footballer (Al-Sailiya, Al Kharaitiyat, national team).وفاة معمر عبد الرب اليزيدي لاعب منتخبنا الوطني لكرة القدم سابقا ونادي قطر *Giannalberto Bendazzi, 75, Italian animation historian, writer and academic.È morto Giannalberto Bendazzi, studioso di cinema d’animazione *Božidar Bojović, 83, Montenegrin physician, endocrinologist, and politician, MP (1990–2005).Преминуо велики хуманиста и истакнути интелектуалац др Божо Бојовић *Phil Chen, 80, Jamaican bassist (Manzarek–Krieger, Butts Band, Rod Stewart), cancer.Phil Chen, bassist who played on Rod Stewart’s hits, dies aged 80 *Ken Kragen, 85, American music manager and producer (\"We Are the World\").Ken Kragen Dies: Producer, Manager, Organizer Of “We Are The World” & “Hands Across America” Was 85 *Abraham Lunggana, 62, Indonesian businessman and politician, member of the Jakarta Regional People's Representative Council (2009–2018) and the DPR (2019–2021), heart attack.Haji Lulung Meninggal Dunia di RS Harapan Kita *Tadeusz Ross, 83, Polish politician, MP (2007–2011) and MEP (2013–2014).Nie żyje Tadeusz Ross - aktor, satyryk, radny Warszawy *Sonny Rhodes, 81, American blues singer and guitarist.Sonny Rhodes (1940-2021) *Abd Al-Baqi Abd Karim Al-Sadun, 74, Iraqi military officer and politician.إدخال احد قياديي النظام السابق المستشفى لاجراء عملية جراحية *Rosita Sokou, 98, Greek journalist and playwright, COVID-19.Esteemed journalist Rosita Sokou, 98, passes away *Sandra Meira Starling, 77, Brazilian politician, Deputy (1991–1999).Ex-deputada e fundadora do PT, Sandra Starling morre aos 77 anos em Belo Horizonte ===15=== *Nelly Commergnat, 78, French politician, Deputy (1981–1986).Nelly Commergnat, l'ancienne députée PS de la Creuse, s'est éteinte à 78 ans *Ernst Fivian, 90, Swiss gymnast, Olympic silver medalist (1952).Turn-Legende Ernst Fivian verstorben *Bridget Hanley, 80, American actress (Here Come the Brides, Harper Valley PTA), problems caused by Alzheimer's disease.Bridget Hanley dies; movie star lived in current Log Cabin Visitors Center *bell hooks, 69, American feminist writer (Ain't I a Woman?, Feminist Theory: From Margin to Center, All About Love: New Visions), kidney failure.bell hooks death: Celebrated author and feminist dies, aged 69 *Hub, 62, American bass guitarist (The Roots), multiple myeloma.Leonard Hubbard, former bass player with The Roots, dies *Kim Yong-ju, 101, North Korean politician, Head of the Organization and Guidance Department (1959–1974), Vice Premier (1974–1975) and Vice President (1993–1997).Brother of North Korea's founder Kim dies: state media (death announced on this date) *Hans Küppers, 82, German footballer (TSV 1860 Munich, 1. FC Nürnberg, national team).Der ETB trauert um Hennes Küppers *Günter Lach, 67, German politician, member of the Bundestag (2009–2017).Wolfsburg trauert um Günter Lach *Adam Łomnicki, 86, Polish evolutionary biologist.Profesor Adam Łomnicki *Marcel Meys, 112, French supercentenarian, nation's oldest male living person, COVID-19.Marcel Meys, le doyen des Français, est mort à l'âge de 112 ans (death announced on this date) *Fernando Ospina Hernández, 92, Colombian engineer and politician, Deputy (1982–1986).Murió Fernando Ospina *Rogério Samora, 63, Portuguese actor (Solidão, Uma Linda História de Amor, April Captains, Eccentricities of a Blonde-Haired Girl), problems caused by cardiac arrest.Morreu o ator Rogério Samora *Varun Singh, 39, Indian Air Force group captain, cardiac arrest caused by an air crash.Lone survivor of India chopper crash that killed top general dies *Marilee Stepan, 86, American swimmer, Olympic bronze medalist (1952).Marilee Stepan *Fayez Tarawneh, 72, Jordanian politician, Prime Minister (1998–1999, 2012). ===16=== *Valentino Bellucci, 46, Italian philosopher, sociologist, and writer.Malore fatale a 46 anni Addio al professor Bellucci *Pavle Dešpalj, 87, Croatian composer and conductor.Preminuo Pavle Dešpalj: Ravnao je i Londonskom kraljevskom filharmonijom *George Gekas, 91, American politician and lawyer, member of the United States House of Representatives from Pennsylvania's 17th congressional district (1983–2003).George W. Gekas, longtime central Pa. lawmaker and lawyer, dies at 91 *Lucía Hiriart, 99, Chilean socialite, First Lady (1974–1990), cardiopulmonary arrest caused by heart disease.Murió a los 99 años Lucía Hiriart, viuda del dictador Augusto Pinochet *Hiroshi Kuwashima, 89, Japanese politician, Mayor of Morioka (1995–2003).前盛岡市長桑島博氏死去 旭日小受章や県勢功労者【岩手】 *Taniela Moa, 36, Tongan rugby union player (Auckland, Section Paloise, national team).Rugby: Former Blues and Tonga halfback Taniela Moa dies aged 36 *Duma Nkosi, 64, South African politician, MP (1994–2001) and Mayor of Ekurhuleni (2001–2008).Former Ekurhuleni mayor Duma Nkosi dies *Trevor Pinch, 69, British sociologist, cancer.Pioneering professor Trevor Pinch dies at 69 *Edith Prague, 96, American politician, member of the Connecticut House of Representatives (1982–1990) and State Senate (1994–2012).Edith Prague, lawmaker and commissioner, dies at 96 *Bob Speller, 65, Canadian politician, MP (1988–2004) and Minister of Agriculture and Agri- Food (2003–2004).Bob Speller, former agriculture minister, dead at 65 *Ben Tollefson, 94, American politician, member of the North Dakota House of Representatives (1985–2000) and State Senate (2000–2008).Former Minot legislator dies Thursday *Terry Uttley, 70, British rock bass guitarist (Smokie).Smokies sista kvarvarande originalmedlem död *Wanda Young, 78, American pop singer (The Marvelettes) and dancer.Wanda Young, Of Iconic Motown Group The Marvelettes, Dies At 78 (death announced on this date) ===17=== *Doug Ericksen, 52, American politician, member of the Washington House of Representatives (1999–2011) and State Senate (since 2011), COVID-19.Washington state Sen. Doug Ericksen dies after battle with COVID *José Pablo Feinmann, 78, Argentine philosopher, writer (Últimos días de la víctima) and playwright (Eva Perón: The True Story, Ay Juancito), problems caused by a stroke.Murió José Pablo Feinmann, escritor y filósofo de lectura imprescindible *José Fernández Arteaga, 88, Mexican Roman Catholic prelate, Bishop of Apatzingán (1974–1980) and Colima (1980–1988) and Archbishop of Chihuahua (1991–2009).Fallece el arzobispo emérito de Chihuahua José Fernández Arteaga *Dah Sagbadjou Glele, Beninese religious leader.Après deux ans de règne, le roi Sagbadjou Glèlè du Dahomey est mort *Herb Guenther, 80, American politician, member of the Arizona House of Representatives (1987–1993) and State Senate (1999–2003).Former Yuma lawmaker Guenther dies *R. L. Jalappa, 96, Indian politician, Minister of Textiles (1996–1998) and MP (1996–2009).Jalappa Passes Away: ಕರ್ನಾಟಕದ ಹಿರಿಯ ರಾಜಕಾರಣಿ ನಿಧನ *John Morgan, 80, English drummer (The Wurzels), COVID-19.Wurzels drummer John Morgan dies after contracting covid during tour *Árpád Pusztai, 91, Hungarian-born British biochemist and nutritionist (Pusztai affair). *Yurii Reshetnyak, 92, Russian mathematician and academician.В Новосибирске скончался известный математик Юрий Решетняк *Dimitrios Stefanakos, 85, Greek footballer (Asteras Exarchion, Olympiacos, national team).Πέθανε ο «θρύλος» του Ολυμπιακού Μίμης Στεφανάκος ===18=== *Harry Azhar Azis, 65, Indonesian economist and politician, MP (2004–2014) and Chairman of the audit board (2014–2017).Anggota BPK Harry Azhar Azis Meninggal Dunia *Osagi Bascome, 23, Bermudian footballer (Darlington, national team), stabbed.Man stabbed to death believed to be former Darlington player *Manuel Garza González, 88, Mexican politician, member of the Chamber of Deputies (1991–1994, 2000–2003).Muere a los 88 años Manuel Garza, operador político del PRI *Bernd Grimmer, 71, German politician, member of the Landtag of Baden-Württemberg (since 2016), COVID-19.Corona: AfD-Abgeordneter Bernd Grimmer aus Pforzheim stirbt mit 71 Jahren *Sayaka Kanda, 35, Japanese actress (School Wars: Hero, Saraba Kamen Rider Den-O: Final Countdown) and singer, suicide by jumping.神田沙也加さん急死 札幌のホテル高層階から転落 *Kangol Kid, 55, American hip-hop songwriter (UTFO), colon cancer.U.T.F.O. Legend Kangol Kid has died just 10 months after cancer diagnosis *Hans Mark, 92, German-born American aerospace engineer and politician, U.S. Secretary of the Air Force (1979–1981), problems caused by dementia.Hans Mark, former secretary of Air Force and NASA deputy who fled Nazis, dies at 92 *Richard Rogers, Baron Rogers of Riverside, 88, Italian-born British architect (Centre Pompidou, Lloyd's building, Millennium Dome), Pritzker Prize winner (2008).Richard Rogers, Pritzker Prize-winning British architect, dies aged 88 *Eliezer Waldman, 84, Israeli Orthodox rabbi and politician, member of the Knesset (1984–1990).Rabbi Eliezer Waldman Ztz’l, President of Yeshivat Nir Kiryat Arba, Passed Away at 84 ===19=== *Boško Abramović, 70, Serbian chess grandmaster.Bosko Abramovic *Ron Anderson, 75, American vocal coach (Axl Rose, Chris Cornell, Ozzy Osbourne).Morre Ron Anderson, preparador vocal do The Weeknd *Drakeo the Ruler, 28, American rapper, stabbed.Drakeo the Ruler Dead from Stabbing During L.A. Festival *Antoine Faivre, 87, French literary scholar and occultist.Notre Frère Antoine Faivre est passé à l’Orient Éternel *Nicholas Georgiade, 88, American actor (It's a Mad, Mad, Mad, Mad World, Seven Against the Wall, The Untouchables).Nicholas Georgiade, ‘The Untouchables’ actor and Syracuse University alumnus, dies at 88 *Carie Graves, 68, American rower, Olympic champion (1984).Wisconsin hall-of-famer and Olympic rowing medalist Carie Graves dies at 68 *Robert H. Grubbs, 79, American chemist (Grubbs catalyst), Nobel Prize winner (2005), heart attack caused by lymphoma.Caltech Mourns the Loss of Nobel Laureate Robert H. Grubbs *Oleg Haslavsky, 73, Russian poet and translator.Умер поэт Олег Львович Хаславский *Sally Ann Howes, 91, English actress (Chitty Chitty Bang Bang, Brigadoon, The Admirable Crichton) and singer.Sally Ann Howes, Truly Scrumptious in ‘Chitty Chitty Bang Bang,’ Dies at 91 *Johnny Isakson, 76, American politician, member of the U.S. House of Representatives from Georgia's 6th congressional district (1999–2005) and U.S. Senate (2005–2019), problems caused by Parkinson's disease.Former Sen. Johnny Isakson dies at the age of 76 *Carlos Marín, 53, German-born Spanish singer (Il Divo), COVID-19.Il Divo singer Carlos Marin dies aged 53 *Russ Potts, 82, American politician, member of the Virginia Senate (1992–2008).Politician, philanthropist, businessman Russ Potts dies at age 82 *Frans Lebu Raya, 61, Indonesian politician, Governor of East Nusa Tenggara (2008–2018).Mantan Gubernur NTT Frans Lebu Raya Meninggal Dunia di Bali *Adam Rosen, 37, British Olympic luger.AJ Rosen *Ed van Thijn, 87, Dutch politician, member of the House of Representatives (1967–1983), Minister of the Interior (1981–1982, 1994) and Mayor of Amsterdam (1983–1994), problems caused by Parkinson's disease.Voormalig burgemeester van Amsterdam en PvdA-coryfee Ed van Thijn (87) overleden ===20=== *Luboš Andršt, 73, Czech guitarist (Framus Five, Energit, Jazz Q), composer and guitar teacher.Zemřel kytarista Luboš Andršt, bylo mu 73 let *Kimera Bartee, 49, American baseball player (Detroit Tigers) and coach (Pittsburgh Pirates, Philadelphia Phillies).Detroit Tigers first base coach Kimera Bartee dies at 49: 'His spirit will never be forgotten' *Norberto Boggio, 90, Argentine footballer (Banfield, Atlante, national team).Dolor en Carreras por la muerte de “Pocho” Boggio *Jorge Busti, 74, Argentine politician, Governor of Entre Ríos Province (1987–1991, 1995–1999, 2003–2007), Deputy (1999–2001) and Senator (2001–2003), problems caused by heart surgery.Murió el exgobernador de Entre Ríos Jorge Busti *Jiří Čadek, 86, Czech footballer (Dukla Prague, national team).Zemřela legenda Dukly Čadek *Pierre Cassignard, 56, French actor (The Conquest, A French Woman, Seventh Heaven).Le comédien Pierre Cassignard est mort *Giuseppe Galante, 84, Italian rower, Olympic silver medalist (1960, 1964).Lo sport comasco piange l'olimpionico Giuseppe Galante *Jean-Paul Laumond, 68, French robotician.Jean-Paul Laumond *Paul Mitchell, American singer (The Floaters).R.I.P. Paul Mitchell, co-founder of \"Float On\" group The Floaters *Willard H. Murray Jr., 90, American politician, member of the California State Assembly (1988–1996).Willard H. Murray, former assemblyman and lifelong public servant, dies at 91 *Reinier Paping, 90, Dutch speedskater, Elfstedentocht winner (1963).Schaatslegende Paping (90) overleden, winnaar zwaarste tocht der tochten ===21=== *Kurt Edler, 71, German politician, member of the Hamburg Parliament (1985–1986, 1993–1997).Grüner, Rebell, Extremismus-Experte – Kurt Edler überraschend gestorben (death announced on this date) *Sir Carlyle Glean, 89, Grenadian politician, Governor-General (2008–2013).Former Governor-General Sir Carlyle Glean has died *Ian Matos, 32, Brazilian Olympic diver (2016), lung infection.Ian Matos morre aos 32 anos após infecção pulmonar *George Sheltz, 75, American Roman Catholic prelate, Auxiliary Bishop of Galveston-Houston (2012–2021).Bishop George Arthur Sheltz ===22=== *Richard Conway, 79, English visual effects artist (The Adventures of Baron Munchausen, Brazil, Sunshine).Special Effects Supervisor Richard Conway Dies at 79 *Antonio Falconio, 83, Italian politician, Deputy (1979–1983), President of Abruzzo (1995–2000).Scomparsa Falconio, cordoglio del presidente Marsilio e dell'assessore Liris *Lester E. Fisher, 100, American zoologist, Director of Lincoln Park Zoo (1962–1992).Dr. Lester Fisher, former director of Lincoln Park Zoo, dead at 100 *Egill Skúli Ingibergsson, 95, Icelandic politician, Mayor of Reykjavík (1978–1982).Egill Skúli Ingi-bergs-son er fallinn frá *George Keiser, 75, American politician, member of the North Dakota House of Representatives (since 1992), problems caused by amyotrophic lateral sclerosis.Longtime Bismarck lawmaker dies after battle with ALS *Bob Keselowski, 70, American stock car racing driver (NASCAR), cancer.Bob Keselowski, ARCA champion and Truck Series pioneer, dies at 70 *Frédéric Manns, 79, French biblist.Décès du bibliste Frédéric Manns, figure française en Terre sainte *Poh Lip Meng, 52, Singaporean sport shooter.Singapore national shooter Poh Lip Meng dies aged 52 *Barbara Shaw, 79, American politician, member of the New Hampshire House of Representatives (since 2010), problems caused by surgery.Alderman Barbara Shaw, longtime educator and tenacious warrior for her city, has died *Franklin A. Thomas, 87, American community developer and philanthropist, President and CEO of the Ford Foundation (1979–1996). *P. T. Thomas, 71, Indian politician, MP (2009–2014), stomach cancer.Congress leader and Thrikkakara MLA PT Thomas, 71, passes away *Gilberto Valbuena Sánchez, 92, Mexican Roman Catholic prelate, Bishop of Colima (1989–2005).Fallece Gilberto Valbuena, religioso poblano quien fue obispo de Colima *Dmitry Zimin, 88, Russian radio scientist and businessman, founder of VimpelCom.Умер основатель «Билайна» и фонда «Династия» Дмитрий Зимин ===23=== *Ted Byfield, 93, Canadian journalist and publisher, founder of Alberta Report and BC Report.Ted Byfield, iconic Alberta conservative publisher, dies at 93 *Chris Dickerson, 82, American bodybuilder, Mr. Olympia winner (1982).1982 Mr. Olympia Chris Dickerson Reportedly Dies at Age 82 *Joan Didion, 87, American writer (Run, River, Slouching Towards Bethlehem, The Year of Magical Thinking), problems caused by Parkinson's disease.Joan Didion death: American writer who chronicled social unrest dies aged 87 *Roberto Gerlein Echeverría, 83, Colombian politician, Deputy (1968–1974), Senator (1976–2018) and Minister of Economic Development (1982–1983), problems caused by a urinary tract infection.Falleció en Barranquilla el exsenador Roberto Gerlein *Grace Mirabella, 91, American magazine editor, editor-in-chief of Vogue (1971–1988) and founder of Mirabella.Grace Mirabella, Former Editor-in- Chief of Vogue, Dies at 91 *Bartolomeo Pepe, 59, Italian politician, Senator (2013–2018), COVID-19.Covid, è morto l'ex senatore M5S Bartolomeo Pepe. Era un convinto No Vax *Omar Saavedra Santis, 77, Chilean writer.Falleció escritor Omar Saavedra Santis a los 77 años *Stanley M. Truhlsen, 101, American ophtalmologist.Stanley M. Truhlsen *Louie L. Wainwright, 98, American politician, respondent of Gideon v. Wainwright case, Secretary of the Florida Division of Corrections (1962–1987).Ex-Florida Department of Corrections Secretary Louie Wainwright dead at 98 ===24=== *Jozef Burian, 60, Slovak politician, member of the National Council (2002–2020).Šok na Štedrý deň! Zomrel exposlanec za Smer-SD Jozef Burian (†60): Dojemné slová politikov *J. D. Crowe, 84, American banjo player and bluegrass bandleader (New South).Bluegrass music legend and Lexington native J. D. Crowe dies *Raúl Madero, 82, Argentine footballer (Boca Juniors, Estudiantes, national team).Falleció Raúl Madero, campeón del mundo con Estudiantes *Birgit Vanderbeke, 65, German writer. *José Villegas, 87, Mexican footballer (Guadalajara, national team).Falleció José 'Jamaicón' Villegas, legendario exjugador de Chivas ===25=== *John Gleeson, 82, Australian rugby league player (Wynnum-Manly, Queensland, national team).Former Kangaroos five-eighth John Gleeson passes away *Ray Illingworth, 89, English cricketer (Yorkshire, Leicestershire, national team), esophageal cancer.Former England captain Ray Illingworth has died at the age of 89 *Brij Lal, 69, Fijian historian.Renowned Fijian academic dies in exile *Albert Likhanov, 86, Soviet-Russian screenwriter (Team 33) and politician, Deputy (1989–1991).Ушёл из жизни наш земляк Альберт Лиханов *Janice Long, 66, English disc jockey and radio broadcaster (Top of the Pops). *Thomas Lovejoy, 80, American ecologist.Tom Lovejoy, prominent conservation biologist, dies at 80 *Richard Marcinko, 81, American Navy commander, co-founder of the Navy SEALs. *Candy Palmater, 53, Canadian comedian, broadcaster (Definitely Not the Opera) and actress (Trailer Park Boys).Canadian comedian Candy Palmater dies at 53 *Jonathan Spence, 85, English-born American historian and sinologist, problems caused by Parkinson's disease.Jonathan D. Spence, popular China scholar, dead at age 85 *Wayne Thiebaud, 101, American painter.Wayne Thiebaud, Sacramento’s celebrated artist of the everyday, dies at 101 ===26=== *Gary B. Beikirch, 74, American soldier, Medal of Honor recipient.Congressional Medal of Honor Society Announces Passing of Gary B. Beikirch *Giacomo Capuzzi, 92, Italian Roman Catholic prelate, Bishop of Lodi (1989–2005).È morto monsignor Giacomo Capuzzi, vescovo di Lodi dal 1989 al 2005 *Karolos Papoulias, 92, Greek politician, Deputy (1977–2004), Minister of Foreign Affairs (1985–1989, 1993–1996) and President (2005–2015).Απεβίωσε ο Κάρολος Παπούλιας *Dorval Rodrigues, 86, Brazilian footballer (Santos, Paranaense, national team).Dorval, ídolo do Santos e bi mundial com o clube, morre aos 86 *Paul B. Kidd, 76, Australian radio broadcaster (2UE, 2GB) and writer, cancer and heart disease.Vale: Radio star Paul B Kidd passes away *Henri Losch, 90, Luxembourgish actor, screenwriter and linguist.Henri Losch dies aged 90 *Fred McLafferty, 98, American chemist (McLafferty rearrangement), member of the National Academy of Sciences (since 1982).Fred W. McLafferty *Phua Bah Lee, 89, Singaporean politician, MP (1968–1988).Obituary : Comrade Phua Bah Lee (1932 – 2021) – A man of principles and action, whose heart was with people and Party *Desmond Tutu, 90, South African Anglican cleric and civil rights activist, Bishop of Johannesburg (1985–1986) and Archbishop of Cape Town (1986–1996), Nobel Peace Prize winner (1984), prostate cancer.South Africa's Archbishop Desmond Tutu dies at 90 *Jean-Marc Vallée, 58, Canadian movie and television director (Dallas Buyers Club, The Young Victoria, Big Little Lies), screenwriter and editor, Emmy winner (2017), heart attack.Jean-Marc Vallée Has Died; Director Of ‘Dallas Buyers Club,’ ‘Big Little Lies’ & ‘Sharp Objects’ Was 58 *Sarah Weddington, 76, American lawyer (Roe v. Wade) and politician, member of the Texas House of Representatives (1973–1977) and White House Political Director (1979–1981).Sarah Weddington, Texan who argued Roe v. Wade before the Supreme Court, dies at 76 *E. O. Wilson, 92, American biologist (Sociobiology: The New Synthesis) and writer (On Human Nature, Consilience), Pulitzer Prize winner (1979, 1991).Modern-day Darwin, E.O. Wilson, dies at 92 ===27=== *April Ashley, 86, English model, actress (The Road to Hong Kong), and writer, one of the first people to have sex reassignment surgery.April Ashley, model and actress who became one of the first transwomen to undergo reassignment surgery – obituary *Andreas Behm, 59, German weightlifter, Olympic bronze medalist (1992), heart attack.Stralsunder Gewichtheber-Legende Andreas Behm ist tot *Keri Hulme, 74, New Zealand novelist (The Bone People) and poet, Booker Prize winner (1985), problems caused by dementia.Keri Hulme, titan of NZ literature and the country's first Booker Prize winner, has died *Peter Pike, 84, British politician, MP (1983–2005).Family announce death of former long serving and well known Burnley MP Peter Pike *Robert Preston, 92, American politician, member of the New Hampshire Senate (1964–1966, 1972–1990).Longtime NH State Sen. Robert Preston Dies at Age 92 *Andrew Vachss, 79, American crime fiction writer (Strega, Batman: The Ultimate Evil) and lawyer.The Zero *Chaim Walder, 52, Israeli rabbi and author, suicide.Haredi Author Chaim Walder Dies by Suicide After Dozens of Sexual Assault Allegations *Myrna Williams, 92, American politician, member of the Nevada Assembly (1985–1993) and Clark County commissioner (1995–2007). ===28=== *Grichka Bogdanoff, 72, French television presenter and accused scientific fraudster (Bogdanov affair), COVID-19.Grichka Bogdanoff, l’un des jumeaux stars des années 1980, est mort du Covid-19 *Caliadi, 56, Indonesian politician, Director General for Buddhist Community Guidance (2017–2021), kidney and heart failure.Eks Dirjen Bimas Buddha Kemenag Wafat *James Cayne, 87, American businessman, CEO of Bear Stearns, problems caused by a stroke.Jimmy Cayne, Who Led Bear Stearns Before It Imploded, Dies at 87 *Pavel Chrastina, 81, Czech bass singer- songwriter and guitarist (Olympic).V 81 letech zemřel spoluzakladatel skupiny Olympic Chrastina *Mikey Chung, 71, Jamaican reggae musician and arranger, myeloma.Musician Mikey Chung dies at 71 *Michael R. Clifford, 69, American Army lieutenant colonel and astronaut (STS-76), problems caused by Parkinson's disease.Rich Clifford, astronaut who secretly flew with Parkinson's, dies at 69 *Jeff Dickerson, 44, American sports journalist (ESPN), colon cancer.Jeff Dickerson, ESPN's Chicago Bears reporter, dies at age 44 *Ted Gardner, Australian music manager, co-founder of Lollapalooza.Beloved Aus Music Industry Veteran Ted Gardner Passes Away *Luis Guastavino, 89, Chilean politician, Deputy (1965–1973) and Intendant of the Valparaíso Region (2003–2006).Fallece ex intendente regional de Valparaíso, Luis Guastavino *John Madden, 85, American Hall of Fame football coach (Oakland Raiders) and sportscaster (NFL on CBS, NFL on Fox), Super Bowl champion (1977).John Madden passes away at 85 *Hugo Maradona, 52, Argentine footballer (Rayo Vallecano, Sagan Tosu, Hokkaido Consadole Sapporo), heart attack.Diego Maradona's brother, Hugo, dies aged 52 *Annie Chidzira Muluzi, Malawian socialite, First Lady (1994–1999).Former Malawi First Lady Anne Muluzi no more: Tributes pour in *Gerold Rechle, 57, German politician, Mayor of Laupheim (2017–2021).Gerold Rechle *Harry Reid, 82, American politician, Lieutenant Governor of Nevada (1971–1975), member of the U.S. House of Representatives from Nevada's 1st congressional district (1983–1987) and U.S. Senator (1987–2017), pancreatic cancer.Harry Reid, a longtime U.S. senator from Nevada and former Democratic leader, dies at 82 *Nikolay Shirshov, 47, Uzbekistani footballer (Pakhtakor Tashkent, Rostov, national team).Умер бывший футболист «Ростова» и сборной Узбекистана Ширшов *Tibi, 70, Portuguese footballer (Leixões, Porto, national team).Morreu Tibi, antigo guarda-redes do FC Porto e da seleção *Sabine Weiss, 97, Swiss-French photographer.La photographe franco-suisse Sabine Weiss, figure du courant humaniste, est morte *Stanislav Zavidonov, 87, Russian footballer (Zenit Leningrad) and manager (ASM Oran).28 декабря не стало Станислава Завидонова ===29=== *Antoine Bonifaci, 90, French footballer (Nice, Torino, national team).OGC Nice : Antoine Bonifaci, « légende » du club et ex-international, est mort *Sue Cline, 75, American politician, member of the West Virginia Senate (2016–2020).Former 9th District Senator Sue Cline Has Died (death announced on this date) *Ahmed Daham, 54, Iraqi footballer (Al- Naft, national team) and manager (Naft Maysan), heart attack.وفاة النجم الكروي السابق أحمد دحام *Mohammed Fareeduddin, 64, Indian politician, Telangana MLC (since 2016), cardiac arrest.టీఆర్ఎస్ నేత, మాజీ మంత్రి ఫరీదుద్దీన్ కన్నుమూత.. కేసీఆర్ సంతాపం *Christian Gyan, 43, Ghanaian-Dutch footballer (Feyenoord, Turun Palloseura, national team), pancreatic cancer.Feyenoord-cultheld Christian Gyan op 43-jarige leeftijd overleden *Pupetta Maresca, 86, Italian mobster and convicted murderer.E' morta Pupetta Maresca, lady camorra degli anni '80 *Alfonso Mejía, 87, Mexican actor (Los Olvidados, Vacations in Acapulco, The Boxer).Murió Alfonso Mejía, figura del cine de oro y «Pedro» en Los olvidados de Luis Buñuel *William Moncrief, 101, American petroleum businessman and philanthropist.Fort Worth philanthropist and legendary oilman William ‘Tex’ Moncrief dies at 101 *Nancy Worley, 70, American politician, Secretary of State of Alabama (2003–2007).Former Ala. secretary of state, Democratic leader Nancy Worley dies ===30=== *Lloyd van Dams, 49, Surinamese- Dutch kickboxer, heart disease.Voormalig kickbokser Lloyd van Dams (49) overleden *Sam Jones, 88, American Hall of Fame basketball player (Boston Celtics), ten-time NBA champion.Sam Jones, Hall of Famer who won 10 NBA titles with Boston Celtics, dies at 88 *Karel Loprais, 72, Czech rally raid driver, multi-Dakar Rally champion, COVID-19.Motoristický svět truchlí. Zemřel legendární závodník Karel Loprais *Lya Luft, 83, Brazilian writer. Escritora Lya Luft morre aos 83 anos em Porto Alegre *Wolfgang Müller, 90, German Olympic equestrian (1968, 1972).Reitmeister Wolfgang Müller Wochen nach seinem 90. Geburtstag gestorben *Denis O’Dell, 98, British film producer (The Magic Christian, The Offence, The Ritz).Beatles’ Movies Producer Denis O’Dell Dies at 98 *Renato Scarpa, 82, Italian actor (Il Postino: The Postman, Don't Look Now, The Icicle Thief), heart attack.Morto Renato Scarpa, addio a Robertino di 'Ricomincio da tre' ===31=== *Gaber Asfour, 77, Egyptian academic and politician, Minister of Culture (2011, 2014–2015).Egypt’s Former Culture Min. Gaber Asfour Passes Away at 77 *Fred Cone, 95, American football player (Green Bay Packers, Dallas Cowboys), problems caused by hip surgery.Clemson Legend Fred Cone Passes Away at 95 *Stephen Hartgen, 77, American politician and news editor (Times-News), member of the Idaho House of Representatives (2008–2018).Former Twin Falls legislator Stephen Hartgen passes away at 77 *Hteik Su Phaya Gyi, 98, Burmese royal. *Gábor Kállai, 62, Hungarian chess grandmaster.Meghalt Kállai Gábor nemzetközi sakknagymester *Luigi Negri, 80, Italian Roman Catholic prelate, theologian and academic, Bishop of San Marino- Montefeltro (2005–2012) and Archbishop of Ferrara-Comacchio (2012–2017).Monsignor Luigi Negri è morto oggi *Billy Turner, 81, American horse trainer (Seattle Slew), Triple Crown winner (1977), cancer.William H. ‘Billy’ Turner Jr. Passes; Trainer Of 1977 Triple Crown Winner Seattle Slew Was 81 *Betty White, 99, American actress (The Golden Girls, The Mary Tyler Moore Show, Hot in Cleveland), five-time Emmy winner, problems caused by a stroke.Golden Girls star Betty White dies aged 99 ==Months== * January * February * March * April * May * June * July * August * September * October * November ==Related pages== * List of deaths due to COVID-19 * 2021 in association football deaths * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *12 Category:December 2021 events",
 "title": "Deaths in December 2021"
}