{
 "id": "804755",
 "text": "The following is a list of deaths that should be noted in April 2021. For deaths that should be noted before the month that the world is in, please see \"Months\". Names under each date are noted in the order of the alphabet by last name or pseudonym. Deaths of non-humans are noted here also if it is worth noting. Each listing of a death must have a source. If no reference is included, the death notice will be removed. The following are the requirements of adding a name to the list in its order: name, age, where they came from, what the person is known for, cause of death (if known) and a source. ==April== ===1=== *Lee Aaker, 77, American actor (The Adventures of Rin Tin Tin, Hondo, Mister Scoutmaster), stroke.Lee Aaker Dies: ‘Adventures Of Rin Tin Tin’ Child Star Was 77 *Isamu Akasaki, 92, Japanese physicist, Nobel Prize winner (2014), pneumonia. *Antonio Delgado Palomo, 63, Spanish Paralympic track and field athlete, Olympic gold medalist (1976), throat cancer.Fallece Palomo, un deportista sevillano con mayúsculas *Bruce Dinwiddy, 75, British politician, Governor of the Cayman Islands (2002–2005). *Rayappu Joseph, 80, Sri Lankan Roman Catholic prelate, Bishop of Mannar (1992–2016).Sri Lanka- Outspoken Mannar Bishop Rayappu Joseph passed away *Patrick Juvet, 70, Swiss disco singer-songwriter (\"Je vais me marier, Marie\", \"I Love America\") and model, Eurovision contestant (1973).Patrick Juvet est mort: l'interprète de \"Où sont les femmes\" avait 70 ans *Henri Marescaux, 77, French Army general and deacon.Mort d'Henri Marescaux, l'engagement d'un général devenu diacre *Paul Marland, 81, British politician, MP (1979–1997).Paul Marland *Biff McGuire, 94, American actor (Alfred Hitchcock Presents, The Thomas Crown Affair, Serpico).Remembering Biff McGuire (death announced on this date) *Loránd Milassin, 73, Hungarian Olympic hurdler (1972).Elhunyt Milassin Lóránd *Wakio Mitsui, 78, Japanese politician, member of the House of Representatives (2000–2012) and Minister of Health (2012).民主党政権で厚生労働相 三井辨雄元衆院議員死去 ７８歳 *Angelo Perugini, 65, Brazilian politician, Mayor of Hortolândia (2005–2012, since 2017) and São Paulo MLA (2015–2016), COVID-19.Morre Angelo Perugini, prefeito de Hortolândia, vítima da Covid-19 *Hugo Portisch, 94, Austrian journalist and writer.„ORF-Welterklärer“ Hugo Portisch ist tot *Divo Zadi, 90, Italian Roman Catholic prelate, Bishop of Civita Castellana (1989–2007).E' morto Divo Zadi, vescovo emerito di Civita Castellana ===2=== *Marek Czekalski, 67, Polish politician and engineer, Mayor of Łódź (1994–1998).Zmarł były prezydent Łodzi Marek Czekalski *Morris \"B.B.\" Dickerson, 71, American funk bassist and singer (War).Morris 'B.B.' Dickerson, Founding Member of War, Dies at 71 *William Evans, American police officer (United States Capitol Police), vehicular homicide.Capitol Police officer killed, another injured after suspect rams car into police barrier outside building *Pete Giesen, 88, American businessman and politician, member of Virginia House of Delegates (1964–1996).Former valley Delegate A.R. “Pete” Giesen, Jr. passes away at age 88 *Robert Howarth, 93, British politician, MP (1964–1970), problems caused by dementia.Tributes to former MP and council leader who was last surviving ‘freeman’ of Bolton *Noah Ricardo Green, 25, American murderer (United States Capitol vehicle attack), shot.U.S. Capitol Police officer dies after attacker rammed car into checkpoint; suspect also dead *Arthur Kopit, 83, American playwright (Indians, Wings, Nine).Arthur Kopit Dies: Pulitizer-Nominated ‘Indians’, ‘Nine’ Playwright Was 83 *Mykhailo Kushnerenko, 82, Ukrainian politician, Deputy (1990–1994) and Governor of Kherson Oblast (1997–1998).У Херсоні пішов з життя видатний державний діяч Михайло Кушнеренко *Clara LaMore, 94, American Olympic swimmer (1948).Former Olympic swimmer from RI dies at age 94 *Benito Orgiana, 83, Italian politician, Deputy (1992–1994).Morto Benito Orgiana, ex deputato e tra i fondatori di Fortza Paris *Jean Luc Rosat, 67, Brazilian Olympic volleyball player (1976, 1980), problems caused by COVID-19. *Christian Tumi, 90, Cameroonian Roman Catholic Cardinal, Bishop of Yagoua (1979–1982), Archbishop of Garoua (1984–1991) and Douala (1991–2009).Décès de Christian Tumi, premier cardinal camerounais ===3=== *José Adauto Bezerra, 94, Brazilian politician, Ceará MLF (1959–1979), Governor of Ceará (1975–1978), and Deputy (1979–1983), COVID-19.Adauto Bezerra, ex-governador do Ceará, morre vítima da Covid-19 *Jill Corey, 85, American singer (\"Love Me to Pieces\", \"Let It Be Me\").Jill Corey *Pier Giacomo De Nicolò, 92, Italian Roman Catholic prelate, Apostolic Nuncio to Costa Rica (1984–1993).È Deceduto Mons. Pier Giacomo De Nicolò *Guram Dochanashvili, 82, Georgian writer (The First Garment).Acclaimed Georgian writer Guram Dochanashvili dies at 82 *Elidio Espinoza, 65, Peruvian politician, Mayor of Trujillo (2015–2018), COVID-19.Muere exalcalde de Trujillo, Elidio Espinoza, por COVID-19 *Gloria Henry, 98, American actress (Dennis the Menace, Miss Grant Takes Richmond, Rancho Notorious).Gloria Henry, Mom on 'Dennis the Menace,' Dies at 98 *Ho Lien Siew, 88, Singaporean Olympic basketball player (1956), lung infection.65年前曾出征奥运 前篮球国手何连秀去世 *James B. Holderman, 85, American academic and convicted fraudster, President of the University of South Carolina (1977–1990), cancer.Jim Holderman, controversial former USC president, dies at 85 *Martin Hyman, 87, British Olympic long-distance runner (1960).‘Martin Hyman didn’t care what level you were at – he just wanted to help’ *Luo Ying-shay, 69, Taiwanese politician, Minister of Justice (2013–2016) and Governor of Fujian Province (2013), breast cancer.前法務部長羅瑩雪辭世 享壽69歲 *Cyprian Kizito Lwanga, 68, Ugandan Roman Catholic prelate, Archbishop of Kampala (since 2006).Archbishop Kizito Lwanga Dies *Stan Stephens, 91, Canadian-born American politician, member (1969–1985) and President (1983–1985) of the Montana Senate and Governor of Montana (1989–1993). *Agnaldo Timóteo, 84, Brazilian singer and politician, Deputy (1986–1996), COVID-19.Agnaldo Timóteo morre no Rio de Covid aos 84 anos *Carla Zampatti, 78, Italian-Australian fashion designer, problems caused by a fall.Carla Zampatti, 78, dies in hospital one week after fall ===4=== *António Almeida Henriques, 59, Portuguese politician, Mayor of Viseu (since 2013), COVID-19.Morreu Almeida Henriques, vítima de Covid-19. Marcelo lembra \"um homem bom\" *Jens-Peter Bonde, 73, Danish politician, MEP (1979–2009).EU- modstanderen Jens-Peter Bonde er død *Thomas D. Brock, 94, American microbiologist, problems caused by a fall.Thomas Brock, Whose Discovery Paved the Way for PCR Tests, Dies at 94 *Jean Dupuy, 95, French-born American artist.L’artiste avant-gardiste Jean Dupuy est mort *Dame Cheryl Gillan, 68, British politician, MP (since 1992) and Wales Secretary of State (2010–2012), breast cancer.Tory MP Dame Cheryl Gillan dies after long illness *Aslamul Haque, 59, Bangladeshi politician, MP (since 2018), cardiac arrest.Lawmaker Aslamul Haque passes away *Sugako Hashida, 95, Japanese screenwriter (Oshin), lymphoma.高齡95歲「阿信」編劇橋田壽賀子逝世 *Paul Humphrey, 61, Canadian musician (Blue Peter), problems caused by multiple system atrophy. *Digvijaysinhji Jhala, 88, Indian politician, MP (1980–1989) and Gujarat MLA (1962–1972).Ex-Union Minister Digvijaysinh Zala passes away at 88 after brief illness *Zygmunt Malanowicz, 83, Polish actor (Knife in the Water, Hunting Flies, Cserepek).Zygmunt Malanowicz nie żyje. Aktor miał 83 lata *Frank Mdlalose, 89, South African politician, Premier of KwaZulu-Natal (1994–1997), COVID-19.KZN’s first premier Dr Frank Mdlalose passes on from Covid-19 *Robert Mundell, 88, Canadian economist, Nobel Prize winner (1999), problems caused by cholangiocarcinoma.The Zeus Of Economics Has Died *Keosaychay Sayasone, 62, Laotian socialite, First Lady (2006–2016), drowned. *Shashikala, 88, Indian actress (Sujata, Aarti, Anupama).Veteran actress Shashikala dies at 88 in Mumbai *Bhagwati Singh, 88, Indian politician, Uttar Pradesh MLA (1977–2003) and MP (2004–2009), heart attack.SP leader and socialist thinker Bhagwati Singh passes away *Roland Thöni, 71, Italian alpine ski racer, Olympic bronze medalist (1972).È morto Roland Thoeni, cugino di Gustav: è stato fra i grandi dello sci italiano con la Valanga Azzurra ===5=== *Robert de Almendra Freitas, 73, Brazilian physician and politician, Piauí MLA (1987–2003) and Mayor of José de Freitas (2005–2010), COVID-19.Ex-deputado Robert Freitas morre aos 73 anos vítima de Covid-19 no Piauí *P. Balachandran, 62, Indian actor (Gandhi, Hotel California, Operation Java) and screenwriter.Malayalam actor P Balachandran dies at 62 *Philip K. Chapman, 86, Australian-born American astronaut (NASA Astronaut Group 6).Philip Chapman, first Australian- born NASA astronaut, dies at 86 *Uri Gallin, 92, Israeli Olympic discus thrower (1952).Uri Gallin *Socratis Hasikos, 64, Cypriot politician, Minister of Defence (1999–2003, 2014) and Interior (2013–2017).Former interior minister Socrates Hasikos dies *Joye Hummel, 97, American comic book writer (Wonder Woman).Joye Murchison Kelly, R.I.P. *Jan-Olav Ingvaldsen, 67, Norwegian politician, MP (1985–1989).Jan-Olav Ingvaldsen er død\" *Frank Jacobs, 92, American comics writer (Mad).Longtime Mad Writer Frank Jacobs Passes Away At 92 *Krzysztof Krawczyk, 74, Polish baritone pop singer, guitarist and composer.Nie żyje Krzysztof Krawczyk. Legendarny piosenkarz miał 74 lata *Paulino Lukudu Loro, 80, South Sudanese Roman Catholic prelate, Bishop of El Obeid (1979–1983) and Archbishop of Juba (1983–2019).Archbishop Paulino Lukudu Loro *Bill Markham, 98, American politician, member of the Oregon House of Representatives (1969–1993).World War II veteran and popular legislator Bill Markham has died at 98 *Gene Mullin, 83, American politician, member of the California State Assembly (2002–2008). *Paul Ritter, 54, English actor (Friday Night Dinner, Chernobyl, Harry Potter and the Half-Blood Prince), brain cancer.Friday Night Dinner star Paul Ritter dies of brain tumour at 54 *Marshall Sahlins, 90, American anthropologist (Sahlins–Obeyesekere debate).https://twitter.com/alnthomas/status/1379564410365227010?s=20 ===6=== *Peter Ainsworth, 64, British politician, MP (1992–2010).Peter Ainsworth *Réginald Bernut, 84, French politician, Mayor of Le Mont-Dore (2001–2003) and Vice-President of the Congress of New Caledonia (2004–2007).Réginald Bernut, ancien maire du Mont-Dore, est mort à l'âge de 84 ans *Charles H. Coolidge, 99, American Army technical sergeant, Medal of Honor recipient, problems caused by multiple sclerosis. *Rodolfo da Ponte, 82, Paraguayan Olympic fencer (1968).El adiós al olímpico Rodolfo Da Ponte *Firmino Filho, 57, Brazilian economist, academic and politician, Mayor of Teresina (1997–2004, 2013–2020) and Piauí MLA (2011–2012).Ex-prefeito de Teresina, Firmino Filho morre aos 57 anos *Paul Greenberg, 84, American journalist (Arkansas Democrat-Gazette), Pulitzer Prize winner (1969). *Alcee Hastings, 84, American politician and lawyer, Judge of the U.S. District Court for Southern Florida (1979–1989) and member of the U.S. House of Representatives (since 1993), pancreatic cancer.Alcee Hastings dies at 84 after cancer battle *Grischa Huber, 76, German actress (Under the Pavement Lies the Strand, The Serpent's Egg, The Garden).Schauspielerin Grischa Huber ist tot *Michel Koeniguer, 49, French comic book artist, heart attack.Le dessinateur et scénariste Michel Koeniguer est mort *Hans Küng, 93, Swiss Catholic priest, theologian and writer (On Being a Christian, Islam: Past, Present and Future).Theologe Hans Küng ist tot *Julen Madariaga, 88, Spanish Basque nationalist militant and lawyer, co- founder of ETA.Muere Julen Madariaga, el fundador de ETA que se anticipó a su derrota y apoyó la escisión en Batasuna *Alfred Leonhard Maluma, 65, Tanzanian Roman Catholic prelate, Bishop of Njombe (since 2002).Askofu Alfred Maluma wa Jimbo Katoliki Njombe Amefariki Dunia! *Walter Olkewicz, 72, American actor (Grace Under Fire, Twin Peaks, The Client).Walter Olkewicz Dies: Character Actor In ‘Twin Peaks’ And ‘Grace Under Fire’ Was 72 *Jan Purwinski, 86, Latvian-born Ukrainian Roman Catholic prelate, Bishop of Kyiv- Zhytomyr (1991–2011).Помер єпископ РКЦ в Україні Ян Пурвінський *Paul Rabinow, 76, American anthropologist.Antropologi: addio a Paul Rabinow, studioso delle metamorfosi delle modernità *Bobby Schilling, 57, American politician, member of the U.S. House of Representatives from Illinois's 17th congressional district (2011–2013), cancer.Former Republican Illinois U.S. Rep. Bobby Schilling dies after bout of cancer *Louis Siminovitch, 100, Canadian molecular biologist.Dr. Lou Siminovitch (1920-2021) *Sonny Simmons, 87, American jazz saxophonist.Mort de Sonny Simmons : quand le jazz est las *Maj Britt Theorin, 88, Swedish politician, MP (1971–1995) and MEP (1995–2004).Maj Britt Theorin har gått ur tiden *Jack Veneno, 79, Dominican professional wrestler (WWC) and politician, cancer.Muere Jack Veneno, el Campeón de la Bolita del Mundo *Anna Wasilewska, 63, Polish politician, member of the Sejm (since 2015).Zmarła posłanka KO Anna Wasilewska *Gene Youngblood, 78, American media theorist and writer (Expanded Cinema), cardiac arrest.Gene Youngblood, Writer of Influential ‘Expanded Cinema’ Book, Has Died at 78 *Fatima Zakaria, 86, Indian journalist (The Times of India) and educator, cardiac arrest.Noted educationist, journalist Padmashri Fatma Zakaria passes away *Predrag Živković Tozovac, 85, Serbian folk musician and actor, COVID-19. ===7=== *Anne Beatts, 74, American humorist and television writer (National Lampoon, Saturday Night Live, Square Pegs).Original SNL Writer Anne Beatts Dies at 74 *Antonio Calpe, 81, Spanish footballer (Levante, Real Madrid) and manager.Fallece Antonio Calpe, exjugador del Real Madrid y del Levante *Jorge Coelho, 66, Portuguese politician, Deputy (1989–2006), heart attack.Jorge Coelho morreu de doença súbita na Figueira da Foz *Emmanuel Evans-Anfom, 101, Ghanaian physician and academic administrator, Vice Chancellor of KNUST (1967–1973) and Commissioner for Health and Education (1979).Ghana's oldest medical doctor dies at 101 *Victor Garber, 101, American businessman and politician, member of the Wyoming House of Representatives (1959–1965, 1979–1981).Victor Garber *James Hampton, 84, American actor (F Troop, Days of Our Lives, The Doris Day Show) and director, problems caused by Parkinson's disease.James Hampton Dies: Writer, Director, And Bugler Hannibal Dobbs On ‘F Troop’ Was 84 *Rudolf Kelterborn, 89, Swiss composer (Der Kirschgarten).Rudolf Kelterborn gestorben Nur aufhören konnte er nicht *Kai Nielsen, 94, American philosopher. *Paul Popovici, 72, Romanian football player (Bihor Oradea, UTA Arad, national team) and manager, heart attack.Fostul internațional Paul Popovici, sfert-finalist al Cupei UEFA, s-a stins din viață *Colette Privat, 95, French politician, Deputy (1967–1968, 1978–1981).Disparition de Colette Privat, ancienne députée PCF et maire de Maromme *Tommy Raudonikis, 70, Australian rugby league player (Western Suburbs, Newtown, national team), cancer.Rugby league legend Tommy Raudonikis dies aged 70 *Ralph Schuckett, 73, American rock keyboardist (Utopia, Todd Rundgren) and composer.Ralph Schuckett, Former Utopia Keyboardist, Dies at 73 *Jack Smith, 85, American baseball player (Los Angeles Dodgers, Milwaukee Braves), problems caused by Alzheimer's disease.Jack Smith *György Szomjas, 80, Hungarian movie director (Tight Quarters) and screenwriter.Elhunyt Szomjas György filmrendező *Éliane Thibaut-Comelade, 92, French journalist, writer and cook.Égérie de la cuisine catalane, Éliane Comelade nous a quittés *Howard Weitzman, 81, American lawyer (Justin Bieber, O.J. Simpson, John DeLorean), cancer.Howard Weitzman Dies: Heavyweight Lawyer Repped Michael Jackson, O.J. Simpson, CAA, Marlon Brando & More ===8=== *Phillip Adams, 32, American football player (Seattle Seahawks, Oakland Raiders, New York Jets) and mass murderer (Rock Hill shooting), suicide by gunshot.AP source: NFL player Phillip Adams killed 5, then himself *Iñaki Aldekoa, 81, Spanish politician, Navarrese MP (1979–1983) and Deputy (1986–1987), lymphoma.Muere a los 81 años Iñaki Aldekoa, histórico dirigente de la izquierda abertzale *Michel Berson, 75, French politician, Mayor of Crosne (1977–1998), Deputy (1981–1997) and Senator (2011–2017).Essonne: Michel Berson, figure politique du département, s’est éteint à l’âge de 75 ans *John da Silva, 86, New Zealand boxer and Olympic wrestler (1956).New Zealand great John da Silva dies *Jovan Divjak, 84, Bosnian Army general.Preminuo Jovan Divjak *Conn Findlay, 90, American sailor and rower, Olympic champion (1956, 1964).Conn Findlay, Who Won Medals At Four Olympics And Was USC’s Oldest Living Olympic Gold Medalist, Dies *Doug Holden, 90, English footballer (Bolton Wanderers, Preston North End, national team).Last survivor of 1953 FA Cup Final, ex-Bolton & Preston winger Doug Holden passes away at 90 *Ton van den Hurk, 88, Dutch footballer (FC Eindhoven, VVV-Venlo, RKSV Sittardia).Ton van den Hurk (88), maker van de eerste VVV-treffer in het betaald voetbal, overleden *Diána Igaly, 56, Hungarian sport shooter, Olympic champion (2004), COVID-19.Meghalt Igaly Diána olimpiai bajnok sportlövő *Antal Kiss, 85, Hungarian racewalker, Olympic silver medalist (1968).Gyász: elhunyt Kiss Antal olimpiai ezüstérmes gyalogló *Viktor Kurentsov, 80, Russian weightlifter, Olympic champion (1968).Скончался советский тяжелоатлет Виктор Куренцов *Roseli Machado, 52, Brazilian Olympic long-distance runner (1996), COVID-19.Roseli Machado, campeã da São Silvestre e atleta olímpica, morre de Covid aos 52 anos *Red Mack, 83, American football player (Pittsburgh Steelers, Green Bay Packers).'Red' Mack, special- teamer on Super Bowl I title team, dies at 83 *Mahyuddin N. S., 73, Indonesian politician, Governor of South Sumatra (2008) and member of the People's Representative Council (2009–2014).Mantan Gubernur Sumsel Mahyuddin Meninggal Dunia akibat Corona Halaman al *César Ramón Ortega Herrera, 82, Venezuelan Roman Catholic prelate, Bishop of Margarita (1983–1998) and Barcelona (1998–2014).Bishop César Ramón Ortega Herrera *Alan Pastrana, 76, American football player (Denver Broncos), problems caused by COVID-19.Annapolis loses a legend: Hall of Fame athlete Alan Pastrana dies at age 76 from complications of COVID *Richard Rush, 91, American movie director (The Stunt Man, Color of Night, Freebie and the Bean).Richard Rush, ‘The Stunt Man’ Director, Dies at 91 ===9=== *Shyama Charan Gupta, 76, Indian politician, MP (2004–2009, since 2014), COVID-19. *Ramsey Clark, 93, American lawyer (Saddam Hussein, Slobodan Milosevic) and politician, Deputy Attorney General (1965–1967) and Attorney General (1966–1969).Ramsey Clark, attorney general who became a critic of U.S. policies, dies at 93 *Gavriel Cohen, 92, Israeli historian and politician, member of the Knesset (1965–1969).Gavriel Cohen *DMX, 50, American rapper (\"Party Up (Up in Here)\", \"X Gon' Give It to Ya\") and actor (Cradle 2 the Grave), heart attack caused by a drug overdose.Rapper-actor DMX, known for gruff delivery, dead at 50 *Ekkehard Fasser, 68, Swiss bobsledder, Olympic champion (1988).Ekkehard Fasser ist gestorben *Sandra J. Feuerstein, 75, American politician and lawyer, Judge of the U.S. District Court for the Eastern New York (since 2003), car crash.Long Island Federal Judge Sandra Feuerstein Killed in Car Crash *Rudolf Furmanov, 82, Russian actor (The Circus Burned Down, and the Clowns Have Gone, I Want to Go to Prison) and stage director, People's Artist of Russia (2008).Умер основатель и худрук театра \"Русская антреприза\" Рудольф Фурманов *Ian Gibson, 82, British politician, MP (1997–2009).Former Norwich North MP and champion of city Dr Ian Gibson dies *Nikki Grahame, 38, English television personality (Big Brother, Princess Nikki, Big Brother Canada), problems caused by anorexia.Big Brother star Nikki Grahame dies aged 38 after anorexia battle *Eduardo Malaquina, 84, Uruguayan politician, Mayor of Salto (1985–1990, 1995–2005) and Senator (2011–2015).Falleció el colorado Eduardo Malaquina, quien fue tres veces intendente de Salto *Jack Minker, 93, American scientist.Jack Minker *June Newton, 97, Australian photographer and model.Fotografin June Newton im Alter von 97 Jahren gestorben *Prince Philip, Duke of Edinburgh, 99, Greek-born British royal, Consort of the British monarch (since 1952).Prince Philip has died aged 99, Buckingham Palace announces *Judith Reisman, 85, American conservative writer.Judith Reisman, figure de la lutte contre les pédocriminels, s’est éteinte à l’âge de 84 ans *Helímenas de Jesús Rojo Paredes, 94, Venezuelan Roman Catholic prelate, Bishop (1980–1995) and Archbishop (1995–2001) of Calabozo.Archbishop Helímenas de Jesús Rojo Paredes *Yasumasa Shigeno, 79, Japanese politician, member of the House of Representatives (2000–2003, 2005–2012), heart attack.元衆議院議員の重野安正氏が死去 ===10=== *Sabiamad Abdul Ahad, 65, Malaysian Olympic sports shooter (1984).Bekas penembak negara Sabiamad Abdul Ahad meninggal dunia *LaDonna Brave Bull Allard, 64, American Lakota historian and Native American rights activist (Dakota Access Pipeline protests), brain cancer.LaDonna Tamakawastewin Allard, Leader of Standing Rock’s Fight Against the Dakota Access Pipeline, Passes On *István Bérczi, 75, Hungarian Olympic gymnast (1972), problems caused by COVID-19.Meghalt Bérczi István tornász, a tévétorna egyik szereplője *Edward Cassidy, 96, Australian Roman Catholic Cardinal, Apostolic Pro-Nuncio to China (1970–1979) and Bangladesh (1973–1979) and President PCPCU (1989–2001).E' morto il Cardinale Cassidy, una vita tra diplomazia ed ecumenismo *Tulio Manuel Chirivella Varela, 88, Venezuelan Roman Catholic prelate, Bishop of Margarita (1974–1982) and Archbishop of Barquisimeto (1982–2007), COVID-19.Falleció el monseñor Tulio Chirivella por covid-19 *Félix del Blanco Prieto, 83, Spanish Roman Catholic prelate, Archbishop of Vannida (since 1991), Apostolic Nuncio to Equatorial Guinea (1996–2003) and Papal Almoner (2007–2012).Fallece Monseñor Félix del Blanco Prieto *Rossana Di Bello, 64, Italian politician, Mayor of Taranto (2000–2006), COVID-19.Covid, è morta l’ex sindaco di Taranto Covid, è morta l’ex sindaco di Taranto Rossana Di Bello *Fred Erdman, 87, Belgian lawyer and politician, Senator (1991–1999) and member of the Chamber of Representatives (1999–2003).Fred Erdman (87), ex- voorzitter van SP, is overleden *Shay Healy, 78, Irish songwriter (\"What's Another Year\") and television broadcaster (Nighthawks), problems caused by Parkinson's disease.Songwriter and broadcaster Shay Healy dies aged 78 *Garba Mohammed, 76, Nigerian politician, Governor of Sokoto State (1985–1987).Emir of Lere is dead *Imre Simkó, 82, Hungarian Olympic sport shooter (1960, 1964).Elhunyt Simkó Imre sportlövő olimpikon *Marcio Veloz Maggiolo, 84, Dominican writer, archaeologist and anthropologist.Murió el escritor dominicano Marcio Veloz Maggiolo *Lin Whitworth, 87, American politician, member of the Idaho Senate (1994–2000), problems dementia.Arthur Lin Whitworth ===11=== *Colin Baker, 86, Welsh footballer (Cardiff City, national team).Colin Baker: Cardiff City and Wales midfielder dies at 86 *Nelson Bornier, 71, Brazilian politician and lawyer, Deputy (1991–1996, 2003–2012) and Mayor of Nova Iguaçu (1997–2002, 2013–2016), COVID-19.Morre, vítima de Covid, ex-prefeito de Nova Iguaçu, Nelson Bornier *Todd J. Campbell, 64, American politician and lawyer, Judge (since 1995) and Chief Judge (2005–2012) of the U.S. District Court for Middle Tennessee, problems caused by multiple system atrophy.Former U.S. District Judge Todd Campbell, longtime Nashville legal mind and adviser to a vice president, dead at 64 *Massimo Cuttitta, 54, Italian rugby union player (national team) and manager, COVID-19.Rugby, è morto Massimo Cuttitta: 70 volte nazionale, stroncato dal Covid a 54 anni *Staņislavs Lugailo, 83, Latvian volleyball player, Olympic champion (1964).Сьогодні перестало битися серце Станіслава Люгайла *Zoran Simjanović, 74, Serbian composer and musician (Siluete, Elipse).Preminuo kompozitor Zoran Simjanović *Joseph Siravo, 64, American actor (Carlito's Way, The Sopranos, The People v. O. J. Simpson), prostate and colorectal cancer. *Mauro Viale, 73, Argentine journalist and television presenter, COVID-19.Murió el periodista Mauro Viale, que había sido internado por COVID ===12=== *Oldemiro Balói, 66, Mozambican politician, Minister of Foreign Affairs (2008–2017).Morreu Oldemiro Balói, antigo ministro dos Negócios Estrangeiros de Moçambique *Thomas E. Delahanty II, 75, American lawyer and politician, U.S. Attorney for the District of Maine (1980–1981, 2010–2017), pancreatic cancer.Thomas E. Delahanty II, Maine legal titan, dies at 75 *Peter Goy, 82, English footballer (Arsenal, Southend United, Watford).Former Blues goalkeeper Peter Goy has died aged 82 *André Maranne, 94, French-born British actor (The Square Peg, Night Train to Paris, Our Miss Fred).André Maranne obituary *Halyna Mosiychuk, Ukrainian composer.На Рівненщині померла відома діячка культури *Michel Noël, 76, Canadian writer.Mort de l’écrivain d’origine autochtone Michel Noël à 76 ans *Paull Shin, 85, American politician, member of the Washington House of Representatives (1993–1995) and Senate (1999–2014), problems caused by Alzheimer's disease.Former Sen. Paull Shin, longtime Edmonds resident, dies *Shirley Williams, 90, British politician and peer, MP (1964–1979, 1981–1983) and Secretary of Education (1976–1979), and co-founder of the SDP.Lady Shirley Williams, former Labour minister, dies aged 90 *Galen Weston, 80, Canadian food processing executive, Chairman of George Weston Limited (1975–2006).W. Galen Weston, 1940-2021 *Yang Xiong, 67, Chinese politician, Mayor of Shanghai (2012–2017), heart attack.消息：上海前市长杨雄逝世终年68岁 ===13=== *Maqbul Ahmed, 81, Bangladeshi politician, President Bangladesh Jamaat-e-Islami (2016–2019), COVID-19.Ex-Jamaat ameer Maqbul dies *Patricio Hacbang Alo, 81, Filipino Roman Catholic prelate, Bishop of Mati (1984–2014).Mati’s first bishop dies at 81 *Harold Bradley Jr., 91, American football player (Cleveland Browns, Philadelphia Eagles) and actor (Seven Rebel Gladiators).Addio ad Harold Bradley, fondatore del Folkstudio a Roma *Isi Leibler, 86, Belgian-born Australian-Israeli activist and columnist (The Jerusalem Post).Isi Leibler, key advocate for Jewish ‘refuseniks’, dies in Israel *Bobby Leonard, 88, American Hall of Fame basketball coach (Indiana Pacers) and player (Los Angeles Lakers, Washington Wizards).Bobby 'Slick' Leonard, Hoosiers and Pacers icon, dies at 88 *Simon Marandi, 73, Indian politician, MP (1989–1996).Former Minister and senior JMM leader Simon Marandi passes away *Jaime Mota de Farias, 95, Brazilian Roman Catholic prelate, Bishop of Alagoinhas (1986–2002), problems caused from Alzheimer's disease.Morre Dom Jaime Mota de Farias, bispo emérito de Alagoinhas (BA) *Jamal Al-Qabendi, 62, Kuwaiti footballer (Kazma Sporting Club, national team), problems caused by diabetes.الكرة الكويتية تودع جمال يعقوب *José Carlos Schiavinato, 66, Brazilian engineer and politician, Mayor of Toledo (2005–2013) and Deputy (since 2015), COVID-19.Deputado José Carlos Schiavinato morre aos 66 anos em decorrência da COVID-19 *Ruth Roberta de Souza, 52, Brazilian Olympic basketball player (1992), world champion (1994), COVID-19.Ruth de Souza, campeã mundial de basquete, morre de covid aos 52 anos *Peter Warner, 90, Australian sailor, winner of the Sydney to Hobart Yacht Race (1961, 1963, 1964), drowned.Celebrated sailor Peter Warner killed in yacht capsize on NSW coast ===14=== *Yıldırım Akbulut, 85, Turkish politician, Minister of the Interior (1984–1987), Speaker of the Grand National Assembly (1987–1989, 1999–2000) and Prime Minister (1989–1991).Former PM, prominent Turkish politician Akbulut passes away at age of 86 *Maamoon Sami Rasheed al- Alwani, 63, Iraqi politician, Governor of Anbar (2005–2009).وفاة محافظ الأنبار الأسبق في أحد مستشفيات تركيا *Trader Faulkner, 93, Australian-born British actor (A Killer Walks, The Murder Game, A High Wind in Jamaica).Trader Faulkner, actor and memoirist with a passion for flamenco and an infectious zest for life – obituary *Hank Huckaby, 79, American politician, member of the Georgia House of Representatives (2011).Hank Huckaby *Abdul Matin Khasru, 71, Bangladeshi politician, MP (1991–2001, since 2009) and Minister of Law and Justice (1997–2001), COVID-19.Former law minister Abdul Matin Khasru dies *Joaquín Larroya, 83, Spanish Olympic sprint canoer (1960).Fallece Joaquín Larroya, integrante del primer equipo olímpico español *Bernie Madoff, 82, American investment advisor, financier and convicted fraudster (Madoff investment scandal), hypertension caused by heart and kidney disease.Ponzi schemer Bernie Madoff dies in prison at 82 *Marcelo Angiolo Melani, 82, Italian-born Argentine Roman Catholic prelate, Bishop of Viedma (1995–2002) and Neuquén (2002–2011), COVID-19.Falleció en Perú Marcelo Melani, obispo emérito de Neuquén *Nicholas Springer, 35, American wheelchair rugby player, Paralympic champion (2008).Wheelchair Rugby Paralympian Nick Springer Passes Away at 35 *Lynn Thomas, 61, American football player (San Francisco 49ers, Oakland Invaders), Super Bowl champion (1982).Former San Francisco 49ers Player Has Died At 61 *Rusty Young, 75, American musician (Poco) and songwriter (\"Crazy Love\", \"Shoot for the Moon\"), heart attack.Rusty Young, Poco's Co-Founder and Longtime Frontman, Dies at 75 === 15 === *Moshe Ber Beck, 86, Hungarian-born American rabbi and anti-Zionist campaigner, leader of the Neturei Karta.Neturei Karta Leader Moshe Ber Beck Dies In Monsey *Patricio Castillo, 80, Mexican actor (National Mechanics, Letters from Marusia, Amores perros). *Roscoe Dixon, 71, American politician, member of the Tennessee House of Representatives (1984–1994) and Senate (1994–2005).Roscoe Dixon, influential Memphis lawmaker brought down by Tennessee Waltz, dies at 71 *Vartan Gregorian, 87, Iranian-born Armenian-American academic, President of Carnegie Corporation (since 1997).Vartan Gregorian, Savior of the New York Public Library, Dies at 87 *Nikolai Olovyannikov, 98, Russian military pilot, Hero of the Soviet Union (1944).Оловянников, Николай Ефимович *Joe T. San Agustin, 90, Guamanian politician, member (1977–1996) and Speaker (1989–1995) of the Senate.Longtime senator, former Speaker Joe T. San Agustin has died ===16=== *Hussain Ahmed, 89, Indian Olympic footballer (1956), COVID-19.Olympian Ahmed Hussain passes away *Edwin Apps, 89, English actor (The Bargee, The Messenger: The Story of Joan of Arc, Vatel).Marais: peintre et acteur de \"Chapeau melon et bottes de cuir\", Edwin Apps est décédé *Fred Arbanas, 82, American football player (Dallas Texans/Kansas City Chiefs).Former Chiefs TE Fred Arbanas dead at 82 *Heinze Bakker, 79, Dutch sports journalist (Nederlandse Omroep Stichting).Oud-Studio Sport-presentator Heinze Bakker (79) overleden *Umberto Battist, 81, French politician, Deputy (1981–1986, 1988–1993).Umberto Battist, l'humaniste politique qui portait la justice sociale en bandoulière, est décédé *Nader Dastneshan, 60, Iranian footballer (Nassaji Mazandaran) and manager (Payam Mashad, Rayka Babol), COVID-19.Iranian coach Dastneshan dies of COVID-19 *Henri Goetschy, 94, French politician, Senator (1977–1995).Henri Goetschy, ancien sénateur et président du Conseil général est décédé *Bob Hodges, 77, Canadian Olympic speed skater (1968, 1972) and biochemist.Bob Hodges *Helen McCrory, 52, English actress (Peaky Blinders, Harry Potter, The Queen), breast cancer.Helen McCrory, star of Peaky Blinders and Harry Potter, dies aged 52 *Andrew Peacock, 82, Australian politician, Minister for Foreign Affairs (1975–1980), Leader of the Opposition (1983–1985, 1989–1990) and MP (1966–1994).Andrew Peacock dies in the United States aged 82 *Johnny Peirson, 95, Canadian ice hockey player (Boston Bruins) and broadcaster.Former Bruins player and broadcaster Johnny Peirson passes away at 95 *Anthony Powell, 85, English costume designer (Death on the Nile, Tess, Indiana Jones and the Last Crusade), Oscar winner (1973, 1979, 1981).Anthony Powell, Three-Time Oscar-Winning Costume Designer, Dies at 85 *Eldar Quliyev, 80, Azerbaijani movie director (Babek), screenwriter and actor.Скончался режиссер Эльдар Гулиев *Éric Raoult, 65, French politician, Deputy (2002–2012) and Mayor of Le Raincy (1995–2014).L’ancien ministre Eric Raoult est mort *Felix Silla, 84, Italian-born American actor (The Addams Family, The Black Bird, Return of the Jedi) and stuntman, pancreatic cancer.Felix Silla Dies: ‘Cousin Itt’ On The ‘Addams Family’ TV Show Was 84 *Loyce W. Turner, 93, American politician, member of the Georgia State Senate (1975–1998).Loyce Turner === 17 === *Joan Badia, 69, Spanish politician and academic, Mayor of Callús (2015–2020).Mor Joan Badia i Pujol, exalcalde de Callús *Hisham Bastawisy, 69, Egyptian jurist and politician, 2012 presidential candidate.رحل عن عالمنا شخصية شهيرة رشح نفسة لرئاسة مصر *Black Rob, 51, American rapper (\"Whoa!\", \"Bad Boy for Life\"), kidney failure.Black Rob Dies: Rapper Formerly With Bad Boy Records Was 51 *Du Jinfang, 89, Chinese actress (The Red Detachment of Women), theatre director (China Theatre Association), vice chairman All-China Youth Federation.京剧名家杜近芳因病去世 享年89岁 *Hubert Faure, 106, French military personnel (Operation Overlord), Grand Croix of the Legion of Honour recipient.Macron condoleert familie van overleden WOII-held Hubert Faure (106) *Hester Ford, 115, American supercentenarian, oldest American person (since 2019).Hester Ford, Oldest Person in the US, Dies *Fereydoun Ghanbari, 43, Iranian weightlifter, problems caused by pancreatitis.Ex-Iran wrestler Fereydoon Ghanbari passes away *Paul Helminger, 80, Luxembourgian politician, Deputy (1984–1989, 1994–2012) and Mayor of Luxembourg City (1999−2011).Paul Helminger ist tot *Hsu Sheng-fa, 96, Taiwanese businessman and politician, member of the Legislative Yuan (1981–1990), founder of Prince Motors and chairman of KGI Bank (1992–2007).太子汽車創辦人許勝發病逝 享耆壽98歲 *Frank Judd, Baron Judd, 86, British politician, MP (1966–1979), Minister of State for Foreign Affairs (1977–1979), and member of the House of Lords (since 1991).‘Special’ former minister and Labour peer Frank Judd dies aged 86 *Sebastian Koto Khoarai, 91, Mosotho Roman Catholic cardinal, Bishop of Mohale's Hoek (1977–2014). *Osamu Kobayashi, 57, Japanese animator (Ani*Kuri15, Naruto, Grandia), kidney cancer.《火影忍者》动画导演小林治去世 终年57岁 *Kabori, 70, Bangladeshi actress (Titash Ekti Nadir Naam, Sareng Bou) and politician, MP (2008–2014), COVID-19. *Bill Mogk, 89, American baseball player (Michigan Wolverines).William Mogk *Manoj Kumar Mukherjee, 87, Indian politician and lawyer, Judge of the Supreme Court (1993–1999).Former Supreme Court Judge, Justice MK Mukherjee passes away *Josep Mussons, 95, Spanish sports and baking executive, Vice President of FC Barcelona (1979–2000), COVID-19.Muere por coronavirus el exvicepresidente del Barça Josep Mussons *Sándor Szabó, 70, Hungarian Olympic swimmer (1968, 1972).Sándor Szabó *Vivek, 59, Indian actor (Run, Saamy, Parthiban Kanavu) and comedian, cardiac arrest.Tamil Actor Vivek, 59, Passes Away in Chennai Following Cardiac Arrest *Harry W. Wellford, 96, American jurist, Judge of the U.S. District Court for the Western Tennessee (1970–1982) and U.S. Court of Appeals for the Sixth Circuit (since 1982).Harry Walker Wellford *Volodymyr Yavorivsky, 78, Ukrainian writer, journalist and politician, MP (1990–1998, 2002–2014), stroke.Умер писатель и общественный деятель Владимир Яворивский === 18 === *Bhumidhar Barman, 89, Indian politician, Chief Minister of Assam (1996).Ex- Assam CM Dr Bhumidhar Barman passes away *Douglas Bell, 94, Canadian politician, Commissioner of Yukon (1979–1986).Past Commissioner Doug Bell remembered *Luigi Covatta, 77, Italian politician and journalist (Mondoperaio), Deputy (1979–1983) and Senator (1983–1994).Morto Luigi Covatta, intellettuale socialista e riformista *Elizabeth Furse, 84, Kenya Colony-born American politician, member of the U.S. House of Representatives from Oregon's 1st congressional district (1993–1999), problems caused from a fall.Former Oregon Congresswoman Elizabeth Furse has died *Iain Gallaway, 98, New Zealand sports commentator and cricketer (Otago).Cricket and rugby commentator Iain Gallaway dies aged 98 *Mohammad Hejazi, 65, Iranian military officer (IRGC), heart disease.Deputy Chief of Iran's Quds Force Dies of 'Heart Condition,' Revolutionary Guards Say *Frank McCabe, 93, American basketball player, Olympic champion (1952).Frank Reilly McCabe *Alberth Papilaya, 53, Indonesian Olympic boxer (1992).Legenda Tinju Indonesia Albert Papilaya Meninggal Dunia *Zdeněk Růžička, 96, Czech gymnast, Olympic bronze medalist (1948).Sportovní nebe pro gymnastu Zdeňka Růžičku. Olympijskému medailistovi bylo 96 let *Anthony Russo, 74, American politician, Mayor of Hoboken (1993–2001).Anthony Russo, former Hoboken mayor, dies at 74 *Lucas Sirkar, 84, Indian Roman Catholic prelate, Bishop of Krishnagar (1984–2000) and Archbishop of Calcutta (2002–2012).Archbishop Lucas Sirkar *Tremaine Stewart, 33, Jamaican footballer (Aalesund, Waterhouse, national team). *Necdet Üruğ, 100, Turkish military officer, Commander of the First Army (1978–1981) and Land Forces (1983) and chief of the General Staff (1983–1987), problems caused by COVID-19.Necdet Üruğ 100 yaşında hayatını kaybetti === 19 === *Edward William Abel, 89, British chemist, President of the Royal Society of Chemistry (1996–1998). *Monica Bandini, 56, Italian racing cyclist, world champion (1988), heart attack.Malore improvviso: addio alla Bandini, iridata 1988. Il dolore del c.t. Cassani *Pedro Bastidas, 45, Venezuelan politician, Mayor of Girardot Municipality (since 2008), COVID-19.Fallece por COVID-19 alcalde de Maracay, Pedro Bastidas *Sumitra Bhave, 78, Indian movie director (Doghi, Devrai, Kaasav), lung infection.National Award-Winning Director Sumitra Bhave Passes Away At 78 *Shaler Halimon, 76, American basketball player (Philadelphia 76ers, Portland Trail Blazers, Dallas Chaparrals).USU Men's Basketball Hall of Famer Shaler Halimon Dies at Age 76 (death announced on this date) *Michel Kilo, 80, Syrian writer and human rights activist, COVID-19.Syrian opposition's Michel Kilo dies in exile *Willy van der Kuijlen, 74, Dutch footballer (PSV, MVV, national team), problems caused by Alzheimer's disease.Willy van der Kuijlen (74) overleden *Vera Lantratova, 73, Russian volleyball player, Olympic champion (1968).Умерла чемпионка Олимпийских игр по волейболу Вера Лантратова *Walter Mondale, 93, American politician, U.S. Senator from Minnesota (1964–1976), Vice President (1977–1981) and U.S. Ambassador to Japan (1993–1996), 1984 presidential candidate.Former Vice President Walter Mondale dies at 93 *Anto Raukas, 86, Estonian geologist and science organiser.Suri akadeemik Anto Raukas *Birgitte Reimer, 95, Danish actress (We Who Go the Kitchen Route, Summer Place Wanted, Vi er allesammen tossede).Tidligere skuespiller Birgitte Reimer er død *Viktor Shuvalov, 97, Russian ice hockey player and footballer (VVS Moscow), Olympic champion (1956), COVID-19.Ушел из жизни первый чемпион мира и олимпийский чемпион по хоккею Виктор Шувалов *Jim Steinman, 73, American musician, composer and lyricist (\"Total Eclipse of the Heart\", \"I'd Do Anything for Love (But I Won't Do That)\", \"It's All Coming Back to Me Now\").Meat Loaf Collaborator Jim Steinman Dies At 73 *G. Venkatasubbiah, 107, Indian lexicographer, kidney disease.Kannada lexicographer Prof. G. Venkatasubbaiah passes away at 107 ===20=== *Germaine Ahidjo, 89, Cameroonian socialite, first lady (1960–1982).Cameroun: Décès de l’ex-Première dame Mme Germaine Ahidjo *Rex Aubrey, 86, Australian Olympic swimmer (1952).Rex Aubrey *George Dancis, 88, Latvian-born Australian Olympic basketball player (1956). *Idriss Déby, 68, Chadian military officer and politician, President (since 1990), shot.Chad President Idriss Deby dies on front lines, says army spokesman *Monte Hellman, 91, American movie director (Two-Lane Blacktop, Beast from Haunted Cave, The Shooting), fall.Monte Hellman, ‘Two-Lane Blacktop’ Director, Dies at 91 *Willi Herren, 45, German actor (Der bewegte Mann, Tatort, Einstein) and singer.Willi Herren (†45) ist tot (death announced on this date) *Wiesława Mazurkiewicz, 95, Polish actress (Pharaoh, The Deluge, Woman in a Hat).Nie żyje gwiazda \"Stawki większej niż życie\"! Zmarła tydzień po pogrzebie córki *Les McKeown, 65, Scottish singer (Bay City Rollers).Former Bay City Rollers frontman Les McKeown dies aged 65 *John Sarna, 86, American politician, member of the Minnesota House of Representatives (1973–1996).John Sarna, a Minneapolis legislator who saved the Stone Arch Bridge, dies at 86 *Sven-Olof Olson, 94, Swedish Air Force officer.Minnesord över generallöjtnant Sven-Olof Olson *Tempest Storm, 93, American burlesque star and actress.Tempest Storm, legendary burlesque star, dies at 93 ===21=== *Albert Bauer, 92, American politician, member of the Washington House of Representatives (1971–1981) and State Senate (1981–2001), stroke.Albert \"Al\" Bauer Jr. *Marc Bécam, 89, French politician, Deputy (1967–1978), Senator (1980–1986) and Mayor of Quimper (1977–1989).Disparition de Marc Bécam, ancien maire de Quimper de 1977 à 1989 *Håkon Brusveen, 93, Norwegian cross-country skier, Olympic champion (1960).Skilegenden Håkon Brusveen er død *Mercedes Colás de Meroño, 95, Argentine human rights activist (Mothers of the Plaza de Mayo).Murió Mercedes Colás de Meroño, vicepresidenta de Madres de Plaza de Mayo *Marc Ferro, 96, French historian, COVID-19.Mort de l'historien Marc Ferro, spécialiste de l'histoire du XXe siècle, à 96 ans *Thomas Fritsch, 77, German actor (Three Men in the Snow, Uncle Tom's Cabin, Adorable Julia).Schauspieler Thomas Fritsch gestorben *Alfredo Graciani, 56, Argentine footballer (Boca Juniors, Racing Club, Deportivo Español), heart attack.Murió Alfredo Graciani, símbolo de Boca *Wahiduddin Khan, 96, Indian Islamic scholar (Tazkirul Quran) and peace activist, COVID-19.Islamic Scholar, Maulana Wahiduddin Khan passes away in Delhi *Joe Long, 88, American bassist (The Four Seasons), COVID-19.Joe Long, Four Seasons bassist and Elizabeth native, has died *Segismundo Martínez Álvarez, 78, Spanish-born Brazilian Roman Catholic prelate, Bishop of Corumbá (2004–2018), COVID-19.Bispo em Corumbá, Dom Martinez morre por covid aos 78 anos *Guilherme Melo, 68, Brazilian politician, Governor of Piauí (1994–1995), brain cancer.Ex-governador Guilherme Melo morre aos 68 anos em hospital de Teresina *Henri Mouton, 87, Belgian politician, Senator (1981–1985).Henri Mouton, ancien bourgmestre PS de Braives, est décédé à l’âge de 87 ans *Henrietta M. Smith, 98, American academic, librarian and storyteller. *Carl Spielvogel, 92, American businessman and politician, U.S. Ambassador to Slovakia (2000–2001).Carl Spielvogel, a longtime power in advertising, dies *Annie Steiner, 93, Algerian activist.Moudjahida Annie Steiner est décédée à l’âge de 93 ans *Edwin Tello, Ecuadorian politician, Governor of Napo Province (since 2020), COVID-19.Muere por covid-19 el gobernador de la provincia de Napo, Edwin Tello *Wojciech Ziemba, 79, Polish Roman Catholic prelate, Bishop of Ełk (1992–2000), Archbishop of Białystok (2000–2006) and Warmia (2006–2016).Zmarł abp Wojciech Ziemba ===22=== *Terrence Clarke, 19, American basketball player (Kentucky Wildcats), car crash.Sources: UK men’s basketball player Terrence Clarke dies in Los Angeles *Charles Fries, 92, American producer (The Amazing Spider-Man, The Martian Chronicles, Cat People).Chuck Fries, Prolific TV and Film Producer, Dies at 92 *Adrian Garrett, 78, American baseball player (Chicago Cubs, California Angels, Hiroshima Toyo Carp), pneumonia. *Edgar Godoy Samayoa, Guatemalan politician and brigadier general, Minister of the Interior (2020).Fallece el exministro de Gobernación, Edgar Godoy *Mirosław Handke, 75, Polish chemist and politician, Rector of AGH University of Science and Technology (1993–1997) and Minister of Educator (1997–2000).Nie żyje Mirosław Handke. Były minister edukacji zmarł w wieku 75 lat *Thelma Harper, 80, American politician, member of the Tennessee Senate (1989–2019). *Dennis Johnson, 81, Jamaican Olympic sprinter (1964), problems caused by COVID-19 *Luo Qingquan, 75, Chinese politician, Governor of Hubei (2003–2007) and member of the CCCPC (2002–2012).湖北省委原书记罗清泉逝世 *Sharon Pollock, 85, Canadian playwright, actor and director.2-time Governor-General Award-winning Calgary playwright Sharon Pollock dead at 85 *Shock G, 57, American rapper (Digital Underground) and songwriter (\"The Humpty Dance\", \"I Get Around\").Digital Underground’s Shock G Dead At 57 ===23=== *Lalit Behl, 71, Indian actor (Titli, Hotel Salvation, Judgementall Hai Kya), movie director and writer, problems caused by COVID-19.'Titli', 'Mukti Bhawan' actor Lalit Behl dies from COVID-19 complications *J. Jon Bruno, 74, American Episcopal prelate, Bishop of Los Angeles (2002–2017).California Episcopal Bishop suspended for trying to sell church's property dies at 74 *Abderrahmane Benkhalfa, 71, Algerian economist and politician, Minister of Finance (2015–2016), COVID-19.وزير المالية السابق عبد الرحمان بن خالفة في ذمة الله *Levy Fidelix, 69, Brazilian politician, President of the Labour Renewal Party (since 1994), problems caused by COVID-19.Levy Fidelix morre aos 69 anos, vítima da Covid-19 *Fredi, 78, Finnish actor, singer and television presenter.Matti ”Fredi” Siitonen on kuollut *Charlie Glotzbach, 82, American racing driver (NASCAR Winston Cup Series).Charlie Glotzbach, Southern Indiana NASCAR racer, dies at 83 *Bill Johnston, 96, American golfer and golf course designer.William C. \"Bill\" Johnston *Dan Kaminsky, 42, American computer security researcher.Computer security world in mourning over death of Dan Kaminsky, aged 42 *Mario Meoni, 56, Argentine politician, Buenos Aires Provincial Deputy (1999–2003), Mayor of Junín Partido (2003–2015) and Minister of Transport (since 2019), car crash.Murió el ministro de Transporte Mario Meoni en un accidente automovilístico *Milva, 81, Italian singer and actress (La bellezza di Ippolita, Appuntamento in Riviera, Via degli specchi).È morta Milva, la \"Rossa\" della canzone italiana *Detta O'Cathain, Baroness O'Cathain, 83, Irish-born British businesswoman (British Airways, Midland Bank, Tesco) and politician, member of the House of Lords (since 1991).‘Sorely missed’: Institute Patron Detta O’Cathain remembered ===24=== *Alber Elbaz, 59, Moroccan-born Israeli fashion designer (Lanvin), COVID-19.Israeli fashion designer Alber Elbaz passes away at 59 *Shunsuke Kikuchi, 89, Japanese composer (The Gate of Youth, Dragon Ball Z, UFO Robot Grendizer), pneumonia.‘Dragon Ball Z’ music composer Shunsuke Kikuchi dies *Christa Ludwig, 93, German mezzo-soprano.Opernlegende Christa Ludwig verstarb mit 93 Jahren *Sarolta Monspart, 76, Hungarian orienteering competitor, world champion (1972).Index – Sport – Monspart Sarolta, athlete of the nation, dies *Yves Rénier, 78, Swiss-born French actor (Commissaire Moulin, The Count of Monte Cristo, Frantic) and filmmaker.Le comédien Yves Rénier, interprète du Commissaire Moulin (TF1), est mort *Byron Seaman, 97, Canadian businessman, part owner of the Calgary Flames.Calgary Flames founding co-owner Byron 'B.J.' Seaman dead at 97 *Mohan Shantanagoudar, 62, Indian politician and lawyer, Judge of the Supreme Court (since 2017).Sitting SC Judge Justice Mohan M Shantanagoudar passes away *Trevor Arthur Smith, Baron Smith of Clifton, 83, British politician, member of the House of Lords (1997–2019), septicaemia.Tributes to Liberal peer who was ‘unashamed philosemite and admirer of Israel’ ===25=== *Hamid Jasemian, 84, Iranian footballer (Shahin, Persepolis), COVID-19.Persepolis legend Hamid Jasemian dies of COVID-19 *John Konrads, 78, Latvian-born Australian swimmer, Olympic champion (1960).Australian Olympic gold medallist John Konrads has passed away *Toshiro Kandagawa, 81, Japanese chef, COVID-19.料理研究家 神田川俊郎さん死去 テレビ番組に多数出演 *André de Witte, 76, Belgian-born Brazilian Roman Catholic prelate, Bishop of Ruy Barbosa (1994–2020), sepsis caused by an infectious cellulite.Morre aos 76 anos dom André de Witte, presidente da Comissão Pastoral da Terra ===26=== *Geno Hayes, 33, American football player (Tampa Bay Buccaneers, Jacksonville Jaguars, Chicago Bears), liver disease.Former Madison County, FSU star linebacker Geno Hayes passes away from liver disease *Vassos Lyssarides, 100, Cypriot politician, member (1960–2006) and President of the House of Representatives (1985–1991), founder of EDEK.Πέθανε ο Βάσος Λυσσαρίδης *Tamara Press, 83, Ukrainian athlete, Olympic champion (1960, 1964).Ушла из жизни олимпийская чемпионка Тамара Пресс *Ramu, 53, Indian movie producer (A. K. 47, Lockup Death, Kalasipalya), COVID-19.Ramu, Kannada film Producer and Malashree's Husband dies due to Covid-19 ===27=== *Gonzalo Aguirre Ramírez, 81, Uruguayan politician, Senator (1985–1990) and Vice President (1990–1995), problems caused by Parkinson's disease.Falleció Gonzalo Aguirre, exvicepresidente de la República e histórico dirigente nacionalista *Nicholas Cheong Jin-suk, 89, South Korean Roman Catholic cardinal, Bishop of Cheongju (1970–1998) and Archbishop of Seoul (1998–2012).Cardinal Nicholas Cheong Jin- suk dies *Dave Cull, 71, New Zealand politician, Mayor of Dunedin (2010–2019), pancreatic cancer.Former Dunedin mayor Dave Cull dies *Manoj Das, 86, Indian writer.Eminent Odia Writer Manoj Das No More *Jan Stefan Gałecki, 88, Polish Roman Catholic prelate, Auxiliary Bishop of Szczecin-Kamień (1974–2007).Bishop Jan Stefan Gałecki *Peter Gelson, 79, English footballer (Brentford, Hillingdon Borough, Hounslow).Peter Gelson 1941-2021 *Imre Horváth, 76, Hungarian politician, member of the National Assembly (2014–2018).Meghalt Újpest egykori országgyűlési képviselője *Aristóbulo Istúriz, 74, Venezuelan politician and academic, Vice President (2016–2017) and Minister of Education (since 2018), problems caused by heart surgery.Fallece Aristóbulo Istúriz *Kakhi Kavsadze, 85, Georgian actor (White Sun of the Desert, Melodies of Vera Quarter, The Wishing Tree), problems caused by COVID-19.Звезда \"Белого солнца пустыни\" Кахи Кавсадзе умер после коронавируса *George P. Kazen, 81, American politician and lawyer, Judge (1979–2018) and Chief Judge (1996–2003) of the U.S. District Court for Southern Texas.Former Federal Judge George P. Kazen passes away *Janna Rommel-Opstaele, 64, Belgian politician, Mayor of Middelkerke (2012–2019), brain cancer.Oud-burgemeester van Middelkerke Janna Rommel-Opstaele (64) overleden (death announced on this date) *Al Schmitt, 91, American recording engineer (RCA Records, Capitol Studios).Al Schmitt, 23x Grammy Award-Winning Producer-Engineer, Dies ===28=== *Michael Collins, 90, American astronaut (Apollo 11), Assistant Secretary of State for Public Affairs (1970–1971) and Director of the National Air and Space Museum (1971–1978), cancer.'Forgotten Astronaut' Michael Collins Dies *Eknath Gaikwad, 81, Indian politician, Maharashtra MLA (1985–1995, 1999–2004) and MP (2004–2014), COVID-19.COVID-19 in Maharashtra: Former MP Eknath Gaikwad passes away *José de la Paz Herrera, 80, Honduran footballer (Atlético Español) and manager (Marathón, national team), problems caused by diabetes.Fallece Chelato Uclés, seleccionador mundialista en España 82 *El Risitas, 65, Spanish comedian and actor (Torrente 3: El protector, Ratones coloraos), heart attack.Muere 'El Risitas' *Federico Salas, 70, Peruvian politician, Prime Minister (2000), COVID-19.Federico Salas-Guevara: Fallece ex primer ministro de Alberto Fujimori por COVID-19 *Anita Lane, 62, Australian singer- songwriter (Nick Cave and the Bad Seeds).Anita Lane, Founding Member of Nick Cave’s Bad Seeds, Dead at 61 (death announced on this date) *Clyde Leon, 37, Trinidadian footballer (Arima Fire, W Connection, national team).Ex-Trinidad and Tobago footballer Clyde Leon dies at 37 ===29=== *Mangashti Amirian, 85, Iranian Olympic weightlifter (1960).Ex-Iran weightlifter Amirian dies *Hans van Baalen, 60, Dutch politician, MP (1999–2009), MEP (2009–2019) and President of the ALDE Party (since 2015), cancer.VVD-prominent Hans van Baalen (60) overleden *Anne Buydens, 102, German-born American philanthropist.Anne Douglas, Widow of Kirk Douglas, Dies at 102 *Johnny Crawford, 75, American actor (The Rifleman, Village of the Giants, The Space Children) and singer, problems caused by Alzheimer's disease.Johnny Crawford, Young Star of 'The Rifleman,' Dies at 75 *Zhang Enhua, 48, Chinese footballer (Dalian Wanda, Grimsby Town, national team).曝足坛名宿张恩华因故逝世 昨天刚过48岁生日 *Prince Muhammad bin Talal, 80, Jordanian royal.وفاة الأمير محمد بن طلال *Frank McRae, 80, American actor (*batteries not included, Licence to Kill) and football player (Chicago Bears), heart attack.Frank McRae, Actor in ‘Licence to Kill’ and ‘Last Action Hero,’ Dies at 80 ===30=== *K. V. Anand, 56, Indian cinematographer (Thenmavin Kombath) and movie director (Kana Kandaen, Anegan), cardiac arrest.Director and cinematographer K.V. Anand no more *Aleksei Bespalikov, 73, Russian politician, Novosibirsk Oblast MLA (2005–2010) and Senator (2010–2014).Андрей Травников выразил соболезнования родным и близким Алексея Беспаликова в связи с его кончиной *Eli Broad, 87, American philanthropist, art collector, and museum co-founder (The Broad).Eli Broad Dies: Businessman, Philanthropist, Founder of L.A.’s Broad Museum Was 87 *Flemming Hansen, 81, Danish politician, Minister of Transport (2001–2007) and Nordic Cooperation (2002–2005).Tidligere minister Flemming Hansen er død *John Dee Holeman, 92, American Piedmont blues guitarist and singer- songwriter.John Dee Holeman, Durham’s Last Great Blues Elder, Dies at 92 *Libertad Leblanc, 83, Argentine actress (Harassed, La Endemoniada, Deliciosamente amoral).Muere la actriz argentina Libertad Leblanc, mito sexual de los sesenta *Ling How Doong, 85, Singaporean politician, MP (1991–1997) and Leader of the Opposition (1993–1996).Former SDP chairman Ling How Doong, who was Bukit Gombak MP, dies at age 85 *Anthony Payne, 84, English composer.Celebrated composer Anthony Payne dies *Azad Rahimov, 56, Azerbaijani politician, Minister of Youth and Sports (since 2006).Умер министр молодежи и спорта Азербайджана *Rohit Sardana, 41, Indian journalist, heart attack caused by COVID-19.Over 100 journalists have died of COVID-19 in India: Report *Pio Vittorio Vigo, 85, Italian Roman Catholic prelate, Archbishop of Acireale (2002–2011). ==Months== * January * February * March * May ==Related pages== * List of deaths due to COVID-19 * 2021 in association football deaths * Deaths in 2014 * Deaths in 2015 * Deaths in 2016 * Deaths in 2017 * Deaths in 2018 * Deaths in 2019 * Deaths in 2020 ==References== ==Other websites== *The Guardian, UK obituaries *The Telegraph obituaries *Obituaries, Chicago Tribune *Obituaries, Los Angeles Times *The New York Times, US obituaries *The Washington Post obituaries *The Sydney Morning Herald, Australian obituaries *04 Category:April 2021 events",
 "title": "Deaths in April 2021"
}