{
 "id": "804944",
 "text": "The Way It Is is the debut studio album by American R&B; singer Keyshia Cole; it was released on June 21, 2005, by A&M; Records. The album debuted at number 6 on the US Billboard 200 and it was supported by five singles, including \"Never\", \"I Changed My Mind\", \"(I Just Want It) To Be Over\", \"I Should Have Cheated\" and \"Love\". The album sold 89,000 units in its first week. The album was certified gold within 17 weeks, and then platinum, only eight weeks later. The album stayed on the charts for over a year, eventually selling over 1.6 million copies and it is Cole's second highest-selling album to date. ==Reception== ===Critical response=== Upon its release, The Way It is garnered generally favorable reviews from music critics. At Metacritic, which assigns a rated mean out of 100 from mainstream critics, the album received a score of 77. Andy Kellman of Allmusic rated the album four out of five stars. He felt that \"from the opener, the album seems to be set up like a linear narrative about a crumbling relationship, but it doesn't quite play out that way, with the scenes shuffled out of order. None of it's all that profound, but Cole sells it all extremely well. [Her] voice is sweet and ringing, like a wiser version of Lil' Mo who has had to weather a tremendous amount of drama. She could be around for a while.\" Janet Tzou, writing for Entertainment Weekly found that \"Cole certainly nails all the basics on The Way It Is: big-name guest talent and husky ballads lamenting those tricky matters of the heart. But Cole's native Oakland, California upbringing gives her vocals depth and her songs a genuine, lived-in feel.\" ==Track listing== ;Notes * signifies a vocal producer * signifies an additional producer ;Sampling credits * \"I Changed My Mind\" contains an sample from \"Get Out of My Life\", written by Allen Toussaint and performed by Solomon Burke. * \"Love, I Thought You Had My Back\" contains elements from \"Loves Jones\", written by Randolph Murph, Ralph Eskridge, and Clarence Johnson from Brighter Side of Darkness. * \"You've Changed\" contains elements from \"Sounds Like a Love Song\", performed by Bobby Glenn. * \"Never\" contains sampled portions from \"Never Too Much\", written and performed by Luther Vandross. ==Personnel== * Charlie Bisharat – violin * Jacqueline Brand – violin * Roberto Cani – violin * Nico Carmine Abondolo – bass * Mario de Leon – violin * Brian Dembow – viola * Joel Derouin – violin * Bruce Dukov – violin * Stephen Erdody – cello * Steve Erody – cello * Marlo Fisher – viola * Matt Funes – viola * Armen Garabedian – violin * Berj Garabedian – violin * Julie Gigante – violin * Endre Granat – violin * Alan Grunfield – violin * Clayton Haslop – violin * Dan Higgins – flute, horn * Josephina Vergara – violin * David F. Walther – viola * Jerry Hey – horn * Suzie Katayama – cello * Songa Lee – violin * Natalie Leggett – violin * Gayle Levant – harp * Phillipe Levy – violin * David Low – cello * Rene Mandel – violin * Darrin McCann – viola * Vicki Miskolczy – viola * Robin Olson – violin * Simon Oswell – viola * Sid Page – violin * Sara Parkins – violin * Joel Peskin – horn * Katia Popov – violin * Steve Rodriguez – bass guitar * Anatoly Rosinsky – violin * Sarah Thornblade – violin * Kenneth Yerks – violin * Raj Ertui – clarinet *Miri Ben-Ari – Israel violin ==Production== * Executive producers: Keyshia Cole, Ron Fair * Producer: Tal Herzberg, Loren Hill, Sean Garrett, Diesel, Daron Jones, Kerry \"Krucial\" Brothers, John Legend, Chink Santana, Rich Shelton, Kevin Veney, Kanye West * Vocal producer: Keyshia Cole, Ron Fair, Sean Garrett, Alicia Keys * Engineers: Shannon Braxton, Tal Herzberg, Jun Ishizeki, Anthony Kilhoffer, Ann Mincieli * Assistant engineers: J.D. Andrew, Jun Ishizeki * Mixing: Ron Fair, Dave Pensado * Mixing assistance: Ariel Chobaz * A&R;: Justin Siegel destiny * Design: Jason Clark, Michelle Thomas * Photography: Chapman Baehler * Co- Songwriter: Tim \"Timbaland\" Mosley ==Charts== ===Weekly charts=== Chart (2005) Peak position ===Year-end charts=== Chart (2005) Position US Billboard 200 61 US Top R&B;/Hip Hop Albums (Billboard) 10 ==Release history== Region Date Japan June 21, 2005 United States June 26, 2005 Canada United Kingdom July 3, 2005 Spain March 6, 2006 ==References== ==Other websites== *The Way It Is at Metacritic Category:2005 albums",
 "title": "The Way It Is (Keyshia Cole album)"
}