{
 "id": "805181",
 "text": "The Human Rights Party was a socialist political party in Michigan. It existed from the year 1970 to the mid-1970s around Ann Arbor. == Platform == === Communication === * More people can be in government through the use of cable television * Media is to be funded blindly by the government === Foreign Policy === * United States' wars are for the rich and companies * The United States should stop fighting the Vietnam War * Focus on community planning and growth === Education === * Schools are used to oppress groups, through sexism, racism, and class * Schools are used to spread propaganda of an free society * Students deserve privacy, dignity, due process, and other decisions * Schools should be controlled by students, parents, and teachers * Schools should be funded by a income tax. The tax should be the same throughout Michigan. If a person gets more money, more of the tax they pay === Childcare === * The government and employers should pay for childcare * Parents, staff, and children should run the childcare === The young === * Age should not be a factor of the rights a person has === The legal system === * All crimes which doesn't affect another person should be repealed * Jails contain more poor, black, and young people * Social inequality is the cause of crime * People convicted with non-violent crimes should be released without bail * The police should be controlled by the community * Prisons should be replaced by rehabilitation * All laws on having drugs should be repealed * Ann Arbor should have more relaxed laws then the state * Ann Arbor should fund treatment for addicts. Education of drugs should be in schools === Economics === * Wealth goes to a few people. The tax system doesn't stop this, but might help it * Labor unions must be protected * Workers must be given good working conditions === Taxation === * There must be progressive taxation === Sexism === * Sexual preference and activity should not be regulated if not interfering with another person * Human rights should be given to people of all sexual orientations and genders * Laws against prostitution and sexual orientation must be repealed * Marital status should not determine rights. * Immediate divorce should happen if both individual consent to it * Discrimination against single people in tax laws, housing, jobs and credit must end. * Laws about pornography should be repealed * Birth control should be accessible * Anti-abortion laws should be repealed. Abortions should be free === Racism === * Minority groups should have control over their future * The city should have more funding and power to find discrimination * Courses of minority culture should be offered in schools * Community control of the police to end police racism === Model cities === * Community control is more important then the model cities program == References == Category:Political parties in the United States",
 "title": "Human Rights Party (United States)"
}