{
 "id": "805218",
 "text": "Starship is a kind of rocket made by the American company SpaceX. The rocket is made out of stainless steel. The rocket is made of two stages: Super Heavy and Starship. Both of these stages can be used again. This is unusual for a rocket. The rocket is expected to lift of people and things to orbit. It is expected to travel to the Moon. It is expected to serve space tourists, and also help humans going to Mars. In 2023, Starship became the tallest and the most powerful rocket ever flown. == Test flights and other testing == Starship Mk1 (Mark 1) was built in 2019. The next vehicle, named Mk2, was built in Florida in 2020. Mk1 failed the cryogenic proof test. It did not fly. Mk2 was recycled. It did not fly. Mk3's name changed to SN1 (serial number 1). SN1 failed a cryogenic proof test in February 2020. In March of 2020, SN2's tank completed its only cryogenic proof test. SN3 failed a test (in 2020's second quarter). In April 2020, during the SN3 cryogenic proof test, a valve leaked liquid nitrogen inside its bottom tank. This causes the vehicle to lose pressure and crush itself. SN4 had a successful static fire tests, but in May of 2020, but exploded after the fifth engine test. SN5 completed a flight with one Raptor in 2020. The rocket went as high as . It was the first Starship spacecraft to complete a flight without problems. SN6 flew in the same month. ===High-altitude testing=== SN8 was the first complete Starship, In October and November 2020, SN8 survived four static fire tests. The first, second, and fourth tests were successful, but the third test failed. In the third test, SN8's Raptors destroyed the mount. The concrete layer melted, splashed, and hit a Raptor. On 9 December 2020, the FAA (Federal Aviation Administration) warned SN8 could explode if it was flown as planned. SpaceX ignored its warnings. and the first to fly. It went as high as but it hit the ground fast and exploded. SN9 flew high and exploded during landing, in 2021. SN10 exploded after landing, in March of 2021. The first Super Heavy booster was finished in March 2021, and named BN1 (booster number 1). SN11 exploded in March of 2021, but no one knows why.It might be because of a computer problem which caused one of the Raptor engines to explode. SpaceX did not finish SN12, SN13, SN14. Their improvements were added to SN15 instead. SN15 flew in May of 2021. In July of 2021, BN3 static fired for the only time. Around July 2021, SpaceX started using the word Ship instead of \"SN\" for Starship spacecrafts. Booster instead of \"BN\" is another name for the Super Heavy boosters. === April 2023 Test flight === After flying for 1 minute and 25 seconds, the booster and the spacecraft could not be steered. The flight continued up to altitude of 39 kilometers (24 mi), then began to tumble. The flight did not reach orbit. At 29 kilometres (18 mi), about four minutes after liftoff, the Autonomous flight safety system destroyed the booster and the Starship. A self-destruct device might have been used, but took 40 seconds to work.https://www.bangkokpost.com/world/2555860. Bangkok Post. Retrieved 2023-04-24 Three of the 33 engines on the booster were shut down before the rocket left the launchpad. The system didn’t think 3 of the engines would work very well. https://www.nytimes.com/2023/04/29/science/elon-musk-spacex- starship.html. Nytimes.com. Retrieved 2023-04-01 About 27 seconds into the flight, SpaceX lost communications with another engine. The flight passed max q. 1 minute 25 seconds into the launch, SpaceX lost thrust vector control and therefore the ability to steer the rocket. The flight went to an altitude of 39 kilometers (24 mi), then began to tumble. === November 2023 Test flight === The spaceship came to an altitude of 148 km (92 mi) and was able to separate the booster.https://edition.cnn.com/world/live-news/spacex-starship-launch- scn/index.html. Retrieved 2023-11-18 The spaceship was supposed to fly for 90 minutes, but at 8 minutes and 4 seconds of flight, the Autonomous flight safety system started the process of destroying the spaceship. By that time, SpaceX had lost communications with the spacecraft. The flight did not reach orbit. === \"Test flight 3\" (March 2024) === At 40 minutes and 46 seconds into the flight, the Raptor in-space relight demo was supposed to happen. That relight of Raptor did not happen because the spaceship seemed to roll too much. The spaceship came to an altitude of 145 miles. SpaceX lost contact with the spaceship during re- entry.https://www.bangkokpost.com/world/2758771/starship-destroyed-on-re- entry-after-successful-flight. Retrieved 2024-03-14https://www.space.com/spacex-starship-third-test-flight-launch. Retrieved 2024-03-14 The booster was not able to slow down enough to land safely and crashed into the Gulf of Mexico. One of the names of the flight, is Starship flight test 3. The test flight was on March 14, 2024. === \"Test flight 4\" (June 2024) === The spacecraft went to an altitude of more than 200 km (125 mi). It splashed down softly into the Indian Ocean as SpaceX wanted.https://www.nrk.no/urix/spacex-skal-skyte-opp-verdens-storste-rakett- starship-1.16913948. Retrieved 2024-06-06 The flight took 1 hour and 5 minutes. === \"Test flight 5\" (October 2024) === The stack (or spaceship on top of booster rocket) lifted-off on October 13, 2024. The spaceship reached altitude 212 km (132 mi). Later it did a controlled landing in the Indian Ocean. One of the names of the flight, is Starship flight test 5. === \"Test flight 6\" (November 2024) === There was a test flight on November 19. === \"Test flight 7\" (January 2025) === There was a test flight in January, 2025. The booster seperated correctly, and flew back to the launch pad. Instead of touching the ground, it stayed in the air, while two mechanical \"arms\" on the launch tower caught it. This process will make it easier to re-use the Starship in the future. Meanwhile, the Starship exploded after seperating, causing the Federal Aviation Administration to stop SpaceX from testing of the rocket to find out why it failed. === March 2025 test flight=== During this flight, the booster was caught by the launch tower again. However, the Starship itself exploded once again, causing another Federal Aviation Administration investigation. === May 2025 test flight === During this flight, the spaceship lifted off and moved away from the booster, as it was supposed to. Then, the ship's fluid-handling systems stopped working, and the ship lost control. The [cargo door] or \"payload door could not open fully\", when that part was tested.https://www.space.com/space-exploration/launches- spacecraft/spacex-launches-starship-flight-9-to-space-in-historic-reuse-of- giant-megarocket-video. Retrieved 2025-06-01 The spaceship started to tumble before it got (back) into the atmosphere. It did not come into the atmosphere in a controlled manner. The flight computers of the spaceship, started an an automated safing process, in order to safely [turn the spaceship into smaller parts, or] dispose of the vehicle after it was found to be unrecoverable. Six minutes after liftoff, the separated booster tried to land. However, only 12 of 13 engines worked as they should have. Later during that minute, there was a loss of telemetry .https://www.nettavisen.no/nyheter/spacex-mistet- kontrollen-med-rakett-under-proveoppskyting/s/5-95-2455466 One of the names of the flight, is Starship flight test 9. == Before launch == Before a launch, the booster rocket and the spaceship are filled with nitrogen gas to check for leaks. Then liquid nitrogen fills and drains from Starship and Super Heavy to check the tanks' strength. Liquid oxygen and liquid methane then fill the tanks of the booster rocket and the spaceship. Engine chill begins on the booster, at minus 19 minutes 40 seconds before liftoff. This is to protect the engine's turbopumps from thermal shock. With 3 seconds left in the countdown, all 33 Raptor engines begin starting up. The countdown ends, and 4 seconds later the rocket liftoff is supposed to happen. Starship will separate from the booster after about two minutes of flight. After that, the Starship spacecraft's engines will move the spacecraft into orbit. The booster goes back to Earth and SpaceX plans to have it land at the launch tower. When Starship lands, the spacecraft will glide using its flaps to control its flight. In the last several seconds of flight, the spacecraft is supposed to point its nose up and land softly. == Parts of the Starship == Starship has two parts: the Super Heavy booster and the Starship spacecraft. Both Super Heavy and Starship should be able to land and launch many times quickly. That is the reason why the Starship rocket is often called a fully-reusable rocket. As of November 2021, no other rockets except Falcon 9 and Falcon Heavy's booster can do this. Most of the rocket is made from SAE 304 stainless steel, the most common type. A Starship spacecraft lifts off from Earth on top of a booster. The spacecraft is supposed to carry of cargo to low Earth orbit. The Space Shuttle could only carry to the International Space Station. In this example, the International Space Station has an even lower orbit than Starship. The International Space Station orbits high at 51.64° inclination. Starship in this case orbits high at 98.9° inclination. === Super Heavy booster === Below the spacecraft is a tall Super Heavy booster rocket. This booster can hold about of propellant. Super Heavy and Starship's propellants are liquid methane and liquid oxygen. The booster is made from stainless steel rings. These rings are thick, tall, and diameter. At the bottom of the booster are 33 Raptor 2https://itc.ua/en/news/spacex-s-starship-raptor-rocket-engine- explodes-during-testing/. Retrieved 2024-05-27 rocket engines. They can make of thrust, twice more than the Saturn V. The thrust speeds up the rocket to . On top of the booster are four boxes containing fins in a grid pattern. These boxes are usually called grid fins, like those of the Falcon 9. Grid fins rotate to control and guide the booster while falling from the sky. When the booster lands, the booster fires its engines and lands at the tower. In 2021, it took 6 weeks to put together Booster 3.https://www.universetoday.com/151731/after-just-6-weeks-of-construction- super-heavy-is-built-and-ready-to-move/. Retrieved 2023-11-21 === Spacecraft === On top of the booster sits a tall Starship spacecraft. The spacecraft can hold about of propellant. Its propellant is the same as Super Heavy's, which are liquid methane and liquid oxygen. The Starship spacecraft is made from stainless steel rings, similar to Super Heavy. At the bottom of the spacecraft are six rocket engines. Three of them are regular Raptor engines and the three others are Raptor Vacuum engines. These regular Raptor engines work inside the atmosphere, while Raptor Vacuum engines work inside the vacuum. There are two kinds of propellant tanks inside Starship, the main tanks and the header tanks. The main tanks store propellant for almost all functions of the spacecraft. The header tanks instead are used for landing. There are four flaps that connect to Starship's body. Two large flaps are at the bottom of the spacecraft, and two small flaps are at the top of the spacecraft. They are made from stainless steel sheets and bend to a trapezoid shape. The flaps can control Starship's falling speed and direction. A black heat shield covers one side of the spacecraft. The heat shield is made from ceramic hexagon tiles and sheets of ceramic wool. They help to protect Starship from hot plasma made when the spacecraft enters Earth's atmosphere. Starship's heat shield could be durable and used many times. ==== Types of Starship spacecraft ==== Starship HLS (Starship Human Landing System): A test flight can happen as early as 2025. That flight will not have a crew. The spacecraft is designed to take propellant from other Starships to have more range. The spacecraft would not have a heat shield or body flaps. However, it will have solar panels and landing engines. Starship HLS can be fueled and connected to the Orion spacecraft. In 2021, NASA (a government agency) selected Starship HLS as the Moon lander for the Artemis program. NASA wants Starship HLS to do a landing on the Moon without humans first. Then Starship will send astronauts for the Artemis 3 mission. A Block 2 version of Starship, is supposed to be used from \"Test flight 7\". === Rocket engines === Both Super Heavy and Starship have SpaceX's Raptor rocket engines at the bottom. Each engine can make about of thrust. It has a full-flow staged combustion cycle design and burns liquid methane with liquid oxygen. Also at the bottom of the Starship spacecraft are the Raptor Vacuum engines. They are Raptor engines with larger nozzles. The Raptor Vacuum only works in space and is more efficient than the normal Raptor engine. The Raptor 2 engine is the next generation of the Raptor and Raptor Vacuum engines. They will be used in Super Heavy and Starship sometime in the future. This is how a full-flow staged combustion cycle engine works. First, liquid methane and oxygen flow into the engine's turbopumps. The turbopumps increase the liquids' pressure. Then, the methane and oxygen evaporate into hot gases in two preburners. One preburner gets more methane, and another gets more oxygen. The gas then turns the turbines and turbopumps by a shaft. These spinning turbines and turbopumps send more propellant to the engine. This hot and mixed gas is then burned in a combustion chamber. Finally, the engine nozzle directs the ignited gas to make thrust. Raptor engines will be made in a new factory at McGregor. Both the Raptor Vacuum and Raptor 2 are going to be made in another factory at Hawthorne. ==Possibilities for use (or potential uses)== Most Starships would carry satellites, cargo, and humans to orbit. They would have a large door that rotates along a hinge. Some Starships would carry propellant instead of cargo. These spacecraft can fuel another spacecraft in orbit. Via fueling, these spacecraft would have more range and can go further. SpaceX wants Starship to replace the Falcon 9, Falcon Heavy, and Dragon 2. Musk guessed a Starship launch should cost $2 million (United States dollars) and the mission's propellant cost should be about $900,000. Starship could carry 400 Starlink satellites into orbit. A Falcon 9 can carry only 60 Starlink satellites. In the past, the Starship spacecraft was planned to only bring cargo and astronauts to Mars, but now they plan to do several kinds of missions. Since Starships have a large cargo door, they might be able to catch space debris. === Moving cargo or people between points on Earth === In January 2022, SpaceX got a $102 million five-year contract to develop the Rocket Cargo program for the United States Space Force. \"Earth to Earth\" SpaceX flights are Point-to-point flights able to take someone anywhere on Earth in less than an hour. John Logsdon said point-to-point travel isn't likely because the people on board the craft would switch between weightlessness to 5 g of acceleration. === Spaceships going to other planets === SpaceX wants to start Mars colonization and terraforming. It would do so by sending humans to Mars. SpaceX thinks sending humans to Mars needs many steps. First, some Starships might carry many important things to Mars' surface. Inside them are fertilizer factories, propellant factories, and building materials. The propellant factory takes in carbon dioxide from Mars's air and hydrogen from the ice below. Then, the factory uses the Sabatier reaction. Hydrogen reacts with carbon dioxide with hydrogen to create methane and oxygen. Methane and oxygen are Starship's propellants. Filled up with the factory's methane and oxygen, Starship can return from Mars back to Earth. Building materials are used to make domes. They protect farmland from Mars's weather and atmosphere. Musk has guessed that a city with a million people on Mars is enough to keep itself running. It should be able to create everything that the people need. The city does not need shipments from Earth by then. He guessed that the city needs at least ten thousand Starships full of humans. Each Starship can carry 100 passengers on board. To give the colony enough equipment and food, a hundred thousand Starships carrying cargo might launch to Mars. This guess does not have population growth. Starships going to Mars also need fueling as well. That spacecraft might have forty rooms, a storage room, and a shelter. The shelter protects astronauts from the Sun's ionizing radiation. Musk's life goal is to ensure that humans are still around after a mass extinction on Earth. He also talked about Starships going to Enceladus, Europa, Pluto, and the Oort cloud. The Starship rocket on those missions could launch from Mars. == Launch and landing places == Starbase is in Texas and test flights are launched from there. The production of Super Heavy and Starship is mostly done there. The launch boats are named Phobos and Deimos. They were oil platforms owned by Valaris. Rockets might also launch from boats or LC-39A. Starbase is being used fo launches of prototypes. All Starship launch and landing places will have a tower. It has a large crane placed on top that can lift Super Heavy and Starship. That tower also has a pair of steel arms that rotate at a hinge similar to claws. The claws can catch Super Heavy as well. Some people living near Starbase blamed SpaceX for harming wildlife, building and testing things without permission, and making too much noise. However, many people come to visit and stay there. When asked, they said that watching and imagining Starships sending humans to Mars made them love the place. == Timeline == Note: The start dates are when rocket stages were first seen, and the end dates are when they are destroyed or not used anymore. A spaceship and its booster rocket came back to the surface of Earth, as late as 2025. == Early ideas == In 2005, Elon Musk talked about a launch vehicle named BFR, later known as the Falcon XX. The Falcon XX was never built. Unlike Starship, it could only fly up once. Falcon XX was going to use Merlin 2 engine, a larger version of the Merlin engine. The engines burn kerosene and liquid oxygen. In September 2016, at the 67th International Astronautical Congress, Elon Musk talked about the Interplanetary Transport System. It was going to be tall and wide. The booster was going to have 42 Raptors, and the spacecraft was going to have 9 Raptors. Both the booster and spacecraft are made from carbon composites, and could launch many times. The ITS can carry humans to Mars and other places inside the Solar System. When the spacecraft enters Mars's atmosphere, it cools by transpiration. At the next IAC in September 2017, Musk announced the Big Falcon Rocket. It is sometimes called Big Fucking Rocket. In that IAC, he talked about moving people around Earth quickly with a Big Falcon Rocket. He called it Earth to Earth. In November 2018, Musk tweeted about a new spacecraft design. It had three bottom flaps and two top flaps. Around that time, the present names of Starship parts were first used: * the booster stage was named Super Heavy * the spacecraft stage was named Starship * the whole rocket was named Starship system or Starship. In January 2019, Musk tweeted that Starship will be made from stainless steel instead of carbon composite. He explained that a stainless steel Starship is stronger than a carbon composite Starship. In March 2019, Musk tweeted again that Starships will have a heat shield made of tiles. The heat shield replaces transpiration cooling. On 27 August 2019, Starhopper, the first vehicle to use the Raptor, flew high. In October 2019, Starship's design had three Raptors and three Raptor Vacuum engines. There are only two bottom flaps in the new design. They are close to the heat shield’s edges. Since 2005, SpaceX has been working on ideas similar to Starship. Some early designs flew high in July 2019 and high in May 2021. ==Cancelled missions== In 2018, the dearMoon project was made by Japanese entrepreneur Yusaku Maezawa to take tourists around the moon. It was ended in 2024.https://e24.no/internasjonal-oekonomi/i/dRlV4z/japansk-milliardaer- avlyser-maaneferd?referer=https%3A%2F%2Fwww.aftenposten.no. Retrieved 2024-06-01 ==Gallery== File:Mk1 starship.jpg|alt=Photograph of a steel nose cone|Starship Mk1's nose cone near tents File:Starship sn5.jpg|alt=Photograph of a crane lifting a steel body|A crane lifting Starship SN5 File:Starship SN9 Open Rear Flap.jpg|alt=Photograph of a spacecraft with a pair of steel flaps on top and bottom|Starship SN9 File:Starship SN20 getting a tile inspection.jpg|alt=Photograph of a worker repairing a spacecraft's black heatshield|Starship SN20 tiles are being checked File:Tanksn7.1.jpg|alt=Photograph of a steel tank|Tank for Starship spacecraft. The tank was used for testing, instead of being built in a spacecraft. File:Raptor-test-9-25-2016.jpg|Raptor firing in McGregor, Texas on 25 September 2016 === Video Gallery === == Notes == == References == Category:Rockets Category:SpaceX",
 "title": "SpaceX Starship"
}