{
 "id": "805441",
 "text": "Jonathon Akande David Bellion (born December 26, 1990) is an American singer, rapper, songwriter, and record producer. He was born and raised in Lake Grove, New York. He is famous for his single \"All Time Low\". He has released four mixtapes and two studio albums. His first studio album, The Human Condition, was released on June 10, 2016. It debuted at number 5 on the Billboard 200. Bellion is currently signed to Visionary Music Group and Capitol Records. ==Early life== Bellion was born and raised in Lake Grove, New York. He comes from an Italian family from Naples. With a chance to play basketball in college, Bellion chose music instead. After high school, he enrolled in the music program at the private Five Towns College in Dix Hills, New York. At 19 years old, he dropped out of college and started writing professionally. He worked under songwriter and Warner Brothers A&R; executive Kara DioGuardi for a year. With Kara, he learned how to write songs for different artists. ==Career== ===2011–2014: Early career and various mixtapes=== Bellion's first mixtape, Scatter Thoughts Vol. 1, was released in early 2011 through his Facebook page. It reached over 11,00 downloads. Bellion writes and produces all of his own music. Bellion then signed with Visionary Music Group in 2012. In 2012, Bellion wrote the chorus to the song \"The Monster\" by Eminem featuring Rihanna. This song won a Grammy Award in the 2015 Grammy Awards for Best Rap/Sung Collaboration. Bellion released his second free project, Translations Through Speaker, on February 20,2013. He released his third project, The Separation, on December 10, 2013 and his fourth free project, The Definition, on September 23, 2014. He also announced his first national tour in October 2014. ===2015–2017: Touring and The Human Condition=== Bellion released several singles in early 2015, including \"Woodstock (Psychedelic Fiction)\", \"All Time Low\", and \"Woke the F*ck Up\" through Capitol Records. On March 31, 2015, Bellion announced his second national tour, The Definition Tour. The tour started on May 26 and ended on July 2. Bellion confirmed that his debut album The Human Condition was set to be released on June 10, 2016. He released three promotional singles from the album: \"Guillotine\" on April 13, 2016, \"80's Films\" on May 27, 2016, and \"Maybe IDK\" on June 2, 2016. The lead single from the album, \"All Time Low\" was released on May 13, 2016. It became his most successful single to that time, reaching number 16 on the Billboard Hot 100. It was certified double-platinum in the United States and Australia. In June 2017, Bellion was picked as Elvis Duran's Artist of the Month. He was featured on NBC's Today show hosted by Kathie Lee Gifford and Hoda Kotb. He performed \"All Time Low\" live. Bellion was the opening act for the rock duo Twenty One Pilots in 2017. ===2018: Glory Sound Prep=== On January 25, Bellion teased part of an upcoming song on an Instagram video. On April 16, he began talking about his next album with 4 captions captioned with \"GSP\". On October 9, Bellion posted a photo to his Twitter account from \"GSP Staff\", stating: \"Tomorrow, Headmaster Stormzy requests your presence for an orientation ceremony in the main atrium. Time: 3:00 pm EST.\" The day after, he announced the studio album Glory Sound Prep on his Twitter account. The album was set to be released on November 9, 2017. ==== Beautiful Mind Records ==== Bellion officially started his own record label in July 2019. It was called Beautiful Mind Records. The label signed the pop/soul band, Lawrence. Lawrence was the opener for most of the shows on the Glory Sound Prep Tour. He helped write and produce their first three singles: \"Casualty\", \"It's Not All About You\", and \"The Weather.\" ==Discography== *Scattered Thoughts Vol. 1 *Translations Through Speakers *The Separation *The Definition *The Human Condition *Glory Sound Prep ==References== ==Other websites== * * * * * * *https://www.elitedaily.com/entertainment/jon-bellion-interview/1530077 Elite Daily June 21, 2016 *https://www.forbes.com/sites/ogdenpayne/2016/08/15/how- visionary-music-group-became-an-independent-record-label-with-major- appeal/?sh=388184052a2d *http://www.mtv.com/news/1716476/eminem-rihanna-jon- bellion-the-monster-writer/ Category:1990 births Category:Living people Category:Singers from New York (state) Category:Rappers from New York (state) Category:American songwriters Category:American record producers",
 "title": "Jon Bellion"
}