{
 "id": "805448",
 "text": "Christine Tremarco (born 20 September 1977) is an English actress. She is best known for portraying the roles of Davina Shackleton in the BBC school-based drama series Waterloo Road (2007–2009), and Linda Andrews in the BBC medical drama series Casualty (2010–2013). In 2024, Tremarco began appearing as Rose Jackson in the ITV soap opera Emmerdale. Tremarco has also had starring roles on British dramas such as Bordertown (1995), Springhill (1996–1997), City Central (1998), Clocking Off (2000), Nice Guy Eddie (2001–2002), and The Responder (2021). ==Other works== Tremarco made her acting debut as Lily in the 1992 television film The Leaving of Liverpool, a 1950s-based drama about the forced migration of children to Australia. In 2017, Tremarco appeared in ITV's four-part drama series Little Boy Blue as Marie Thompson, the mother of one of the gang members involved in assisting the cover up of Rhys Jones' murder, in 2007. In 2019, she played Sinead Kovac in all ten episodes of the 5Star prison drama Clink. Tremarco's other television credits include minor roles in Heartbeat (1997), Coronation Street (1998), Liverpool 1 (1999), Coming Up (2003), and Silent Witness (2011). ==Filmography== Year Title Role Notes 1992 The Leaving of Liverpool Lily Television film 1994 Priest Lisa Unsworth Film 1995 Hearts and Minds Fifth Former Series 1: Episode 2 Bordertown Louise Pearson Main role; 10 episodes 1996–1997 Springhill Trish Freeman Regular role; 26 episodes 1997 Under the Skin Vron Film Face Sarah Heartbeat Cathy Thompson Episode: \"Leaving Home\" 1998 City Central Nikki Reed Main role; 7 episodes Coronation Street Lucy Johnson Episode: #1.4451 Trial & Retribution Cheryl Goodall 2 episodes 1999 Dockers Paula Walton Television film Liverpool 1 Michelle Episode: \"Pause for Thought\" Shockers Deborah Episode: \"The Dance\" Hold Back the Night Charleen Film 2000 Clocking Off Katherine Mackintosh Supporting role; 4 episodes 2001–2002 Nice Guy Eddie Ange McMullen Main role; 7 episodes 2001 Swallow Lorraine Landry Main role; 3 episodes 2002 Night Flight Pam Atwell Television film Anita and Me Sandy Film 2003 Real Men DS Paula Savage Television film Coming Up Rachel Episode: \"Loveless\" Casualty Sarah Jennings Episode: \"Against Protocol\" Gifted Sharon Harrison Television film On the Out Mirriam Television short 2004 I'm a Juvenile Delinquent – Jail Me! Various roles Television film 2004–2005 Fat Friends Clare Hannon Supporting role; 2 episodes 2004 Family Business Lisa Series 1: Episode 3 Pretending to be Judith Maria Television film 2005 Uncle Adolf Eva Braun The Rotters' Club Miriam Newman Miniseries; 2 episodes The Trouble with Men and Women Karen Film Faith Michelle Andrews Television film The Ghost Squad DC Jo Miller Episode: \"One of Us\" 2006 New Street Law Judy Richards Series 1: Episode 3 That Summer Day Music Teacher Film Dalziel and Pascoe Nerissa Baron Episodes: \"The Cave Woman: Parts 1 & 2\" 2007–2009 Waterloo Road Davina Shackleton Regular role; 44 episodes 2007 Five Days Leanne Wellings Episodes: \"Day One\" & \"Day Thirty Three\" New Tricks Christy Berlin Episode: \"Big Topped\" 2009 Moving On Ellie Morgan Episode: \"Drowning Not Waving\" Ingenious Samantha Television film 2010−2013 Casualty Linda Andrews Regular role; 73 episodes 2010 Outcast Housing Officer Film 2011 Silent Witness DI Sonia Hardwick Episodes: \"Lost: Parts 1 & 2\" Justice Marie Episode: \"This Town\" 2012 Good Cop Nurse Justine Miniseries; 4 episodes 2013 Talking to the Dead DC Eluned 'Elli' Jones Miniseries; 2 episodes 2014 Glue Nadya Miniseries; 4 episodes 2015 Safe House Becky 4 episodes Hector Kate Film 2016 ID2: Shadwell Army Alison 2017 Little Boy Blue Marie Thompson Main role; 4 episodes 2019 Clink Sinead Kovac Main role; 10 episodes 2020 Tin Star Billie McGrath Series 3: Episode 4 2021 The Pebble and the Boy Dawn Film 2022 The Responder Dr. Diane Gallagher Supporting role; 3 episodes The Window Teresa Burdett Main role; 8 episodes 2024–present Emmerdale Rose Jackson Regular role 2024 The Gathering Carianne Recurring role; 6 episodes Kidnapped: The Chloe Ayling Story Bea Miniseries; 2 episodes TBA Adolescence Manda Miller Post- production == References == ==Other websites== * Category:1977 births Category:Living people Category:English child actors Category:English television actors Category:English movie actors Category:Actors from Liverpool Category:Entertainers from Merseyside",
 "title": "Christine Tremarco"
}