{
 "id": "805524",
 "text": "Sherbaz Khan Mazari () (6 October 1930 – 5 December 2020) was a Pakistani politician and leader of the opposition in the National Assembly. == Early life and education == Mazari was born in Rojhan Mazari, Punjab Province, British India on 6 October 1930. His father, Mir Murad Bakhsh Khan, was the chief of the Mazari tribe in Dera Ghazi Khan. Orphaned early in life, Sherbaz and his siblings were placed under British guardianship. He studied at Aitchison College, Lahore and Royal Indian Military College, Dehradun. He also attended the University of Oxford. == Political career == Mazari began his political career by supporting Fatima Jinnah in the 1965 presidential election against Ayub Khan. He opposed the military rule of General Yahya Khan and its policies regarding East Pakistan. In 1970, Mazari contested the National Assembly elections as an independent candidate despite many politicians competing for PPP tickets. He attempted to resolve Balochistan’s political issues through dialogue in parliament, but when Bhutto opted for military action, Mazari joined the National Awami Party (NAP). After NAP was banned, he formed the National Democratic Party (NDP). Mazari served as Leader of the Opposition from 1975 to 1977 and was a signatory to Pakistan’s 1973 Constitution as head of the independent group in the National Assembly. He joined the Pakistan National Alliance campaign against Bhutto’s government in 1977. He later supported the Movement for the Restoration of Democracy (MRD) against Zia-ul-Haq’s regime in the 1980s. == Personal life and legacy == Mazari was known for his principled stance and was respected as a fair tribal leader who maintained peace and justice in his region. He authored his memoir, A Journey to Disillusionment, in 1999. Mazari refused an offer to become Prime Minister from General Zia in 1980 due to his commitment to democracy. He passed away on 5 December 2020 in Karachi and was buried in Rojhan, with thousands attending his funeral. == Books == * == See also == * Hyderabad tribunal == References == == Further reading == *",
 "title": "Sherbaz Khan Mazari"
}