{
 "id": "805708",
 "text": "This is a list of presidents of France. ==List of presidents== ===French First Republic (1792–1804)=== ===Directory=== The Directory was officially led by a president, as stipulated by Article 141 of the Constitution of the Year III. An entirely ceremonial post, the first president was Jean-François Rewbell, who was chosen by lot on 2 November 1795. The Directors conducted their elections privately, with the presidency rotating every three months. The last President was Louis-Jérôme Gohier. The leading figure of the Directory was Paul Barras, the only director to serve throughout the Directory. ;Political parties Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Directors of the Directory (1 November 1795 – 10 November 1799) Paul Barras 2 November 1795 - 9 November 1799 Louis-Marie de la Révellière 2 November 1795 - 18 June 1799 Jean-François Rewbell 2 November 1795 - 16 May 1799 Lazare Carnot 2 November 1795 - 4 September 1797 Étienne-François Letourneur 2 November 1795 - 20 May 1797 Paul Barras 2 November 1795 - 9 November 1799 Louis-Marie de la Révellière 2 November 1795 - 18 June 1799 Jean-François Rewbell 2 November 1795 - 16 May 1799 Lazare Carnot 2 November 1795 - 4 September 1797 François Barthélemy 20 May - 4 September 1797 Paul Barras 2 November 1795 - 9 November 1799 Louis-Marie de la Révellière 2 November 1795 - 18 June 1799 Jean-François Rewbell 2 November 1795 - 16 May 1799 Philippe Antoine Merlin 4 September 1797 - 18 June 1799 François de Neufchâteau 4 September 1797 - 15 May 1798 Paul Barras 2 November 1795 - 9 November 1799 Louis-Marie de la Révellière 2 November 1795 - 18 June 1799 Jean-François Rewbell 2 November 1795 - 16 May 1799 Philippe Antoine Merlin 4 September 1797 - 18 June 1799 Jean-Baptiste Treilhard 15 May 1798 - 17 June 1799 Paul Barras 2 November 1795 - 9 November 1799 Louis-Marie de la Révellière 2 November 1795 - 18 June 1799 Emmanuel Joseph Sieyès 16 May - 9 November 1799 Philippe Antoine Merlin 4 September 1797 - 18 June 1799 Jean-Baptiste Treilhard 15 May 1798 - 17 June 1799 Paul Barras 2 November 1795 - 9 November 1799 Roger Ducos 18 June - 9 November 1799 Emmanuel Joseph Sieyès 16 May - 9 November 1799 Jean-François Moulin 18 June - 10 November 1799 Louis-Jérôme Gohier 17 June - 10 November 1799 After the Coup of 18 Brumaire (9 November 1799), Barras, Ducos, and Sieyès resigned. Moulin and Gohier, refusing to resign, were arrested by General Moreau. ===French Second Republic (1848–1852)=== Nº Portrait Name (Birth–Death) Term of Office; Electoral mandates Term of Office; Electoral mandates Political Party Ref. 1 Louis-Napoléon Bonaparte (1808–1873) 20 December 1848 2 December 1852 Bonapartist 1 Louis-Napoléon Bonaparte (1808–1873) 1848 1848 Bonapartist 1 Louis-Napoléon Bonaparte (1808–1873) Nephew of Napoléon I. Elected first President of the French Republic, in the 1848 election against Louis-Eugène Cavaignac. He provoked the French coup of 1851, and proclaimed himself Emperor in 1852. Henri Georges Boulay de la Meurthe, the sole person to hold the office, was vice president. Nephew of Napoléon I. Elected first President of the French Republic, in the 1848 election against Louis-Eugène Cavaignac. He provoked the French coup of 1851, and proclaimed himself Emperor in 1852. Henri Georges Boulay de la Meurthe, the sole person to hold the office, was vice president. Nephew of Napoléon I. Elected first President of the French Republic, in the 1848 election against Louis-Eugène Cavaignac. He provoked the French coup of 1851, and proclaimed himself Emperor in 1852. Henri Georges Boulay de la Meurthe, the sole person to hold the office, was vice president. ===French Third Republic (1870–1940)=== ;Political parties Nº Portrait Name (Birth–Death) Term of Office Term of Office Political Party Ref. 2 Adolphe Thiers (1797–1877) 31 August 1871 24 May 1873 Moderate Monarchist (Orléanist) 2 Adolphe Thiers (1797–1877) Initially a moderate monarchist, named president following the adoption of the Rivet law. He became a Republican during his term, and resigned in the face of hostility from the Assemblée nationale, largely in favour of a return to monarchy. Initially a moderate monarchist, named president following the adoption of the Rivet law. He became a Republican during his term, and resigned in the face of hostility from the Assemblée nationale, largely in favour of a return to monarchy. Initially a moderate monarchist, named president following the adoption of the Rivet law. He became a Republican during his term, and resigned in the face of hostility from the Assemblée nationale, largely in favour of a return to monarchy. 3 Patrice de MacMahon (1808–1893) 24 May 1873 30 January 1879 Monarchist (Legitimist) 3 Patrice de MacMahon (1808–1893) A Marshal of France, he was the only monarchist (and only Duke) to serve as President of the Third Republic. He resigned shortly after the Republican victory in the January 1879 legislative elections, following a previous Republican victory in 1877, after his decision to dissolve the Chamber of Deputies. During his term, the French Constitutional Laws of 1875 that served as the Constitution of the Third Republic were passed, and he therefore became the first President under the constitutional settlement that would last until 1940. A Marshal of France, he was the only monarchist (and only Duke) to serve as President of the Third Republic. He resigned shortly after the Republican victory in the January 1879 legislative elections, following a previous Republican victory in 1877, after his decision to dissolve the Chamber of Deputies. During his term, the French Constitutional Laws of 1875 that served as the Constitution of the Third Republic were passed, and he therefore became the first President under the constitutional settlement that would last until 1940. A Marshal of France, he was the only monarchist (and only Duke) to serve as President of the Third Republic. He resigned shortly after the Republican victory in the January 1879 legislative elections, following a previous Republican victory in 1877, after his decision to dissolve the Chamber of Deputies. During his term, the French Constitutional Laws of 1875 that served as the Constitution of the Third Republic were passed, and he therefore became the first President under the constitutional settlement that would last until 1940. The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). The Government of Jules Armand Dufaure deputises during the interim (30 January 1879). 4 Jules Grévy (1807–1891) 30 January 1879 2 December 1887 Opportunist Republican 4 Jules Grévy (1807–1891) The first President to complete a full term, he was easily re- elected in December 1885. He was nonetheless forced to resign, following an honours scandal in which his son-in-law was implicated. The first President to complete a full term, he was easily re-elected in December 1885. He was nonetheless forced to resign, following an honours scandal in which his son- in-law was implicated. The first President to complete a full term, he was easily re-elected in December 1885. He was nonetheless forced to resign, following an honours scandal in which his son-in-law was implicated. The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). The Government of Maurice Rouvier deputises during the interim (2–3 December 1887). 5 Marie François Sadi Carnot (1837–1894) 3 December 1887 25 June 1894† Opportunist Republican 5 Marie François Sadi Carnot (1837–1894) His term was marked by boulangist unrest and the Panama scandals, and by diplomacy with Russia. †Assassinated (stabbed) by Sante Geronimo Caserio a few months before the end of his mandate, he is interred at the Panthéon, Paris. His term was marked by boulangist unrest and the Panama scandals, and by diplomacy with Russia. †Assassinated (stabbed) by Sante Geronimo Caserio a few months before the end of his mandate, he is interred at the Panthéon, Paris. His term was marked by boulangist unrest and the Panama scandals, and by diplomacy with Russia. †Assassinated (stabbed) by Sante Geronimo Caserio a few months before the end of his mandate, he is interred at the Panthéon, Paris. The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). The Government of Charles Dupuy deputises during the interim (25–27 June 1894). 6 Jean Casimir-Perier (1847–1907) 27 June 1894 16 January 1895 Opportunist Republican 6 Jean Casimir-Perier (1847–1907) Perier's was the shortest Presidential term: he resigned after six months and 20 days. Perier's was the shortest Presidential term: he resigned after six months and 20 days. Perier's was the shortest Presidential term: he resigned after six months and 20 days. The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). The Government of Charles Dupuy deputises during the interim (16–17 January 1895). 7 Félix Faure (1841–1899) 17 January 1895 16 February 1899† Opportunist Republican; Progressive Republican 7 Félix Faure (1841–1899) Pursued colonial expansion and ties with Russia. President during the Dreyfus Affair. †Four years into his term he died of apoplexy at the Élysée Palace, allegedly during fellatio. Pursued colonial expansion and ties with Russia. President during the Dreyfus Affair. †Four years into his term he died of apoplexy at the Élysée Palace, allegedly during fellatio. Pursued colonial expansion and ties with Russia. President during the Dreyfus Affair. †Four years into his term he died of apoplexy at the Élysée Palace, allegedly during fellatio. The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). The Government of Charles Dupuy deputises during the interim (16–18 February 1899). 8 Émile Loubet (1838–1929) 18 February 1899 18 February 1906 Democratic Republican Alliance 8 Émile Loubet (1838–1929) During his seven-year term, the 1905 French law on the Separation of the Churches and the State was adopted, and only four Presidents of the Council succeeded to the Hôtel Matignon. He did not seek re-election at the end of his term. During his seven-year term, the 1905 French law on the Separation of the Churches and the State was adopted, and only four Presidents of the Council succeeded to the Hôtel Matignon. He did not seek re-election at the end of his term. During his seven-year term, the 1905 French law on the Separation of the Churches and the State was adopted, and only four Presidents of the Council succeeded to the Hôtel Matignon. He did not seek re-election at the end of his term. 9 Armand Fallières (1841–1931) 18 February 1906 18 February 1913 Democratic Republican Alliance; then Democratic Republican Party 9 Armand Fallières (1841–1931) President during the Agadir Crisis, when French troops first occupied Morocco. He was a party to the Triple Entente, which he strengthened by diplomacy. Like his predecessor, he did not seek re-election. President during the Agadir Crisis, when French troops first occupied Morocco. He was a party to the Triple Entente, which he strengthened by diplomacy. Like his predecessor, he did not seek re-election. President during the Agadir Crisis, when French troops first occupied Morocco. He was a party to the Triple Entente, which he strengthened by diplomacy. Like his predecessor, he did not seek re-election. 10 Raymond Poincaré (1860–1934) 18 February 1913 18 February 1920 Democratic Republican Party; then Democratic Republican Alliance 10 Raymond Poincaré (1860–1934) President during World War I. He subsequently served as President of the Council 1922–1924 and 1926–1929. President during World War I. He subsequently served as President of the Council 1922–1924 and 1926–1929. President during World War I. He subsequently served as President of the Council 1922–1924 and 1926–1929. 11 Paul Deschanel (1855–1922) 18 February 1920 21 September 1920 Democratic Republican Alliance; then Democratic Republican and Social Party 11 Paul Deschanel (1855–1922) An intellectual elected to the Académie française, he overcame the popular Georges Clemenceau, to general surprise, in the January 1920 election. He resigned after eight months due to health problems. An intellectual elected to the Académie française, he overcame the popular Georges Clemenceau, to general surprise, in the January 1920 election. He resigned after eight months due to health problems. An intellectual elected to the Académie française, he overcame the popular Georges Clemenceau, to general surprise, in the January 1920 election. He resigned after eight months due to health problems. The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). The Government of Alexandre Millerand deputises during the interim (21–23 September 1920). 12 Alexandre Millerand (1859–1943) 23 September 1920 11 June 1924 Independent 12 Alexandre Millerand (1859–1943) An \"Independent Socialist\" increasingly drawn to the right wing, he resigned after four years following the victory of the Cartel des Gauches in the 1924 legislative elections. An \"Independent Socialist\" increasingly drawn to the right wing, he resigned after four years following the victory of the Cartel des Gauches in the 1924 legislative elections. An \"Independent Socialist\" increasingly drawn to the right wing, he resigned after four years following the victory of the Cartel des Gauches in the 1924 legislative elections. The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). The Government of Frédéric François-Marsal deputises during the interim (11–13 June 1924). 13 Gaston Doumergue (1863–1937) 13 June 1924 13 June 1931 Radical-Socialist and Radical Republican Party 13 Gaston Doumergue (1863–1937) The first Protestant President, he took a firm political stance against Germany and its resurgent nationalism. His seven-year term was marked by ministerial discontinuity. The first Protestant President, he took a firm political stance against Germany and its resurgent nationalism. His seven-year term was marked by ministerial discontinuity. The first Protestant President, he took a firm political stance against Germany and its resurgent nationalism. His seven-year term was marked by ministerial discontinuity. 14 Paul Doumer (1857–1932) 13 June 1931 7 May 1932† Independent 14 Paul Doumer (1857–1932) Elected in the second round of the 1931 election, having displaced the pacifist Aristide Briand. †Assassinated (shot) by the mentally unstable Paul Gorguloff. Elected in the second round of the 1931 election, having displaced the pacifist Aristide Briand. †Assassinated (shot) by the mentally unstable Paul Gorguloff. Elected in the second round of the 1931 election, having displaced the pacifist Aristide Briand. †Assassinated (shot) by the mentally unstable Paul Gorguloff. The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). The Government of André Tardieu deputises during the interim (7–10 May 1932). 15 Albert Lebrun (1871–1950) 10 May 1932 11 July 1940 (de facto) Democratic Alliance 15 Albert Lebrun (1871–1950) Re-elected in 1939, his second term was interrupted de facto by the rise to power of Marshal Philippe Pétain. Re-elected in 1939, his second term was interrupted de facto by the rise to power of Marshal Philippe Pétain. Re-elected in 1939, his second term was interrupted de facto by the rise to power of Marshal Philippe Pétain. ===French Fourth Republic (1946–1958)=== Political Party: Nº Portrait Name (Birth–Death) Term of Office; Electoral mandates Term of Office; Electoral mandates Political Party Ref. 16 Vincent Auriol (1884–1966) 16 January 1947 16 January 1954 French Section of the Workers' International 16 Vincent Auriol (1884–1966) 1947 1947 French Section of the Workers' International 16 Vincent Auriol (1884–1966) First President of the Fourth Republic; his term was marked by the First Indochina War. First President of the Fourth Republic; his term was marked by the First Indochina War. First President of the Fourth Republic; his term was marked by the First Indochina War. 17 René Coty (1882–1962) 16 January 1954 8 January 1959 National Centre of Independents and Peasants 17 René Coty (1882–1962) 1953 1953 National Centre of Independents and Peasants 17 René Coty (1882–1962) Presidency marked by the Algerian War; appealed to Charles de Gaulle to resolve the May 1958 crisis. Following the promulgation of the Fifth Republic, he resigned after five years as president, giving way to de Gaulle. Presidency marked by the Algerian War; appealed to Charles de Gaulle to resolve the May 1958 crisis. Following the promulgation of the Fifth Republic, he resigned after five years as president, giving way to de Gaulle. Presidency marked by the Algerian War; appealed to Charles de Gaulle to resolve the May 1958 crisis. Following the promulgation of the Fifth Republic, he resigned after five years as president, giving way to de Gaulle. ===French Fifth Republic (1958–present)=== Nº Portrait Name (Birth–Death) Term of Office; Electoral mandates Term of Office; Electoral mandates Political Party Ref. 18 Charles de Gaulle (1890–1970) 8 January 1959 28 April 1969 Union for the New Republic 18 Charles de Gaulle (1890–1970) 1958, 1965 1958, 1965 Union for the New Republic 18 Charles de Gaulle (1890–1970) Leader of the Free French Forces 1940–1944. President of the Provisional Government 1944–1946. Appointed President of the Council by René Coty in May 1958, to resolve the crisis of the Algerian War. He adopted a new Constitution, thus founding the Fifth Republic. Easily elected president in the 1958 election by electoral college, he took office the following month; having modified the Presidential election procedure in the 1962 referendum, he was re-elected by universal suffrage in the 1965 election. He signed the Elysée Treaty in 1963, building Franco-German cooperation later leading to the European Economic Community (EEC). In 1966, he withdrew France from NATO integrated military command, and expelled the American bases on French soil. Having refused to step down during the crisis of May 1968, resigned following the failure of the 1969 referendum on regionalisation. Leader of the Free French Forces 1940–1944. President of the Provisional Government 1944–1946. Appointed President of the Council by René Coty in May 1958, to resolve the crisis of the Algerian War. He adopted a new Constitution, thus founding the Fifth Republic. Easily elected president in the 1958 election by electoral college, he took office the following month; having modified the Presidential election procedure in the 1962 referendum, he was re-elected by universal suffrage in the 1965 election. He signed the Elysée Treaty in 1963, building Franco-German cooperation later leading to the European Economic Community (EEC). In 1966, he withdrew France from NATO integrated military command, and expelled the American bases on French soil. Having refused to step down during the crisis of May 1968, resigned following the failure of the 1969 referendum on regionalisation. Leader of the Free French Forces 1940–1944. President of the Provisional Government 1944–1946. Appointed President of the Council by René Coty in May 1958, to resolve the crisis of the Algerian War. He adopted a new Constitution, thus founding the Fifth Republic. Easily elected president in the 1958 election by electoral college, he took office the following month; having modified the Presidential election procedure in the 1962 referendum, he was re-elected by universal suffrage in the 1965 election. He signed the Elysée Treaty in 1963, building Franco-German cooperation later leading to the European Economic Community (EEC). In 1966, he withdrew France from NATO integrated military command, and expelled the American bases on French soil. Having refused to step down during the crisis of May 1968, resigned following the failure of the 1969 referendum on regionalisation. — Alain Poher Acting (1909–1996) 28 April 1969 20 June 1969 Democratic Centre — Alain Poher Acting (1909–1996) Interim President, as President of the Senate. Defeated by Georges Pompidou in the second round of the 1969 election. Interim President, as President of the Senate. Defeated by Georges Pompidou in the second round of the 1969 election. Interim President, as President of the Senate. Defeated by Georges Pompidou in the second round of the 1969 election. 19 Georges Pompidou (1911–1974) 20 June 1969 2 April 1974† Union of Democrats for the Republic 19 Georges Pompidou (1911–1974) 1969 1969 Union of Democrats for the Republic 19 Georges Pompidou (1911–1974) Prime Minister under Charles de Gaulle 1962–1968. Elected President in the 1969 election against the centrist Alain Poher. Favoured European integration. Supported economic modernisation and industrialisation. Faced the 1973 oil crisis. †Died in office of Waldenström's macroglobulinemia, two years before the end of his mandate. Prime Minister under Charles de Gaulle 1962–1968. Elected President in the 1969 election against the centrist Alain Poher. Favoured European integration. Supported economic modernisation and industrialisation. Faced the 1973 oil crisis. †Died in office of Waldenström's macroglobulinemia, two years before the end of his mandate. Prime Minister under Charles de Gaulle 1962–1968. Elected President in the 1969 election against the centrist Alain Poher. Favoured European integration. Supported economic modernisation and industrialisation. Faced the 1973 oil crisis. †Died in office of Waldenström's macroglobulinemia, two years before the end of his mandate. — Alain Poher Acting (1909–1996) 2 April 1974 27 May 1974 Democratic Centre — Alain Poher Acting (1909–1996) Interim President again, as President of the Senate. Did not stand against Valéry Giscard d'Estaing in the 1974 election. Interim President again, as President of the Senate. Did not stand against Valéry Giscard d'Estaing in the 1974 election. Interim President again, as President of the Senate. Did not stand against Valéry Giscard d'Estaing in the 1974 election. 20 Valéry Giscard d'Estaing (1926–2020) 27 May 1974 21 May 1981 Independent Republicans (until 1977) Republican Party (from 1977) 20 Valéry Giscard d'Estaing (1926–2020) 1974 1974 Independent Republicans (until 1977) Republican Party (from 1977) 20 Valéry Giscard d'Estaing (1926–2020) Founder of the RI and later the UDF in his efforts to unify the centre-right, he served in several Gaullist governments. Narrowly elected in the 1974 election, he instigated numerous reforms, including the lowering of the age of civil majority from 21 to 18, and the legalisation of abortion. He soon faced a global economic crisis and rising unemployment. Although the polls initially gave him a lead, he was defeated in the 1981 election by François Mitterrand, partly due to the disunion within the right wing. Founder of the RI and later the UDF in his efforts to unify the centre-right, he served in several Gaullist governments. Narrowly elected in the 1974 election, he instigated numerous reforms, including the lowering of the age of civil majority from 21 to 18, and the legalisation of abortion. He soon faced a global economic crisis and rising unemployment. Although the polls initially gave him a lead, he was defeated in the 1981 election by François Mitterrand, partly due to the disunion within the right wing. Founder of the RI and later the UDF in his efforts to unify the centre-right, he served in several Gaullist governments. Narrowly elected in the 1974 election, he instigated numerous reforms, including the lowering of the age of civil majority from 21 to 18, and the legalisation of abortion. He soon faced a global economic crisis and rising unemployment. Although the polls initially gave him a lead, he was defeated in the 1981 election by François Mitterrand, partly due to the disunion within the right wing. 21 François Mitterrand (1916–1996) 21 May 1981 17 May 1995 Socialist Party 21 François Mitterrand (1916–1996) 1981, 1988 1981, 1988 Socialist Party 21 François Mitterrand (1916–1996) Candidate of a united left-wing ticket in the 1965 election, he founded the Socialist Party in 1971. Having narrowly lost the 1974 election, he was finally elected in the 1981 election. He instigated several reforms (abolition of the death penalty, a fifth week of paid leave for employees). After the right-wing victory in the 1986 legislative elections, he named Jacques Chirac Prime Minister, thus beginning the first cohabitation. Re- elected in the 1988 election against Chirac, he was again forced to cohabit with Édouard Balladur following the 1993 legislative elections. He retired in 1995 after the conclusion of his second term. He was the first left-wing President of the Fifth Republic, and his presidential tenure was the longest of the Fifth Republic. Candidate of a united left-wing ticket in the 1965 election, he founded the Socialist Party in 1971. Having narrowly lost the 1974 election, he was finally elected in the 1981 election. He instigated several reforms (abolition of the death penalty, a fifth week of paid leave for employees). After the right-wing victory in the 1986 legislative elections, he named Jacques Chirac Prime Minister, thus beginning the first cohabitation. Re-elected in the 1988 election against Chirac, he was again forced to cohabit with Édouard Balladur following the 1993 legislative elections. He retired in 1995 after the conclusion of his second term. He was the first left-wing President of the Fifth Republic, and his presidential tenure was the longest of the Fifth Republic. Candidate of a united left-wing ticket in the 1965 election, he founded the Socialist Party in 1971. Having narrowly lost the 1974 election, he was finally elected in the 1981 election. He instigated several reforms (abolition of the death penalty, a fifth week of paid leave for employees). After the right-wing victory in the 1986 legislative elections, he named Jacques Chirac Prime Minister, thus beginning the first cohabitation. Re-elected in the 1988 election against Chirac, he was again forced to cohabit with Édouard Balladur following the 1993 legislative elections. He retired in 1995 after the conclusion of his second term. He was the first left-wing President of the Fifth Republic, and his presidential tenure was the longest of the Fifth Republic. 22 Jacques Chirac (1932–2019) 17 May 1995 16 May 2007 Rally for the Republic (until 2002) Union for a Popular Movement (from 2002) 22 Jacques Chirac (1932–2019) 1995, 2002 1995, 2002 Rally for the Republic (until 2002) Union for a Popular Movement (from 2002) 22 Jacques Chirac (1932–2019) Prime Minister 1974–1976; on resignation, founded the RPR. Eliminated in the first round of the 1981 election, he again served as Prime Minister 1986–1988. Beaten in the 1988 election, he was elected in the 1995 election. He engaged in social reforms to counter \"social fracture\". In 1997, he dissolved the Assemblée nationale; a left-wing victory in the 1997 legislative elections, forced him to name Lionel Jospin Prime Minister for a five-year cohabitation. Presidential terms reduced from seven to five years. In 2002, he was re-elected against the leader of the extreme right-wing Jean- Marie Le Pen. Sent troops to Afghanistan, but opposed the Iraq War. He did not run in 2007, he retired from political life. Prime Minister 1974–1976; on resignation, founded the RPR. Eliminated in the first round of the 1981 election, he again served as Prime Minister 1986–1988. Beaten in the 1988 election, he was elected in the 1995 election. He engaged in social reforms to counter \"social fracture\". In 1997, he dissolved the Assemblée nationale; a left-wing victory in the 1997 legislative elections, forced him to name Lionel Jospin Prime Minister for a five-year cohabitation. Presidential terms reduced from seven to five years. In 2002, he was re-elected against the leader of the extreme right-wing Jean-Marie Le Pen. Sent troops to Afghanistan, but opposed the Iraq War. He did not run in 2007, he retired from political life. Prime Minister 1974–1976; on resignation, founded the RPR. Eliminated in the first round of the 1981 election, he again served as Prime Minister 1986–1988. Beaten in the 1988 election, he was elected in the 1995 election. He engaged in social reforms to counter \"social fracture\". In 1997, he dissolved the Assemblée nationale; a left-wing victory in the 1997 legislative elections, forced him to name Lionel Jospin Prime Minister for a five-year cohabitation. Presidential terms reduced from seven to five years. In 2002, he was re- elected against the leader of the extreme right-wing Jean-Marie Le Pen. Sent troops to Afghanistan, but opposed the Iraq War. He did not run in 2007, he retired from political life. 23 Nicolas Sarkozy (born 1955) 16 May 2007 15 May 2012 Union for a Popular Movement 23 Nicolas Sarkozy (born 1955) 2007 2007 Union for a Popular Movement 23 Nicolas Sarkozy (born 1955) Served in numerous ministerial posts 1993–1995 and 2002–2007. Leader of the UMP since 2004. Elected in the 2007 election, defeating Ségolène Royal. Soon after taking office, he introduced the French fiscal package of 2007 and other laws to counter illegal immigration and recidivism. President of the Council of the EU in 2008, he defended the Treaty of Lisbon and mediated in the Russo-Georgian War; reintroduced France to NATO integrated military command; President of the G8 and the G20 in 2011. At national level, he had to deal with the financial crisis and its consequences. Following the 2008 constitutional reform, he became the first President since Louis-Napoléon Bonaparte to address the Versailles Congress on 22 June 2009. He introduced education and pension reforms. Sent troops to Libya (Opération Harmattan) in 2011. Narrowly defeated in the runoff of the 2012 election. Served in numerous ministerial posts 1993–1995 and 2002–2007. Leader of the UMP since 2004. Elected in the 2007 election, defeating Ségolène Royal. Soon after taking office, he introduced the French fiscal package of 2007 and other laws to counter illegal immigration and recidivism. President of the Council of the EU in 2008, he defended the Treaty of Lisbon and mediated in the Russo-Georgian War; reintroduced France to NATO integrated military command; President of the G8 and the G20 in 2011. At national level, he had to deal with the financial crisis and its consequences. Following the 2008 constitutional reform, he became the first President since Louis-Napoléon Bonaparte to address the Versailles Congress on 22 June 2009. He introduced education and pension reforms. Sent troops to Libya (Opération Harmattan) in 2011. Narrowly defeated in the runoff of the 2012 election. Served in numerous ministerial posts 1993–1995 and 2002–2007. Leader of the UMP since 2004. Elected in the 2007 election, defeating Ségolène Royal. Soon after taking office, he introduced the French fiscal package of 2007 and other laws to counter illegal immigration and recidivism. President of the Council of the EU in 2008, he defended the Treaty of Lisbon and mediated in the Russo-Georgian War; reintroduced France to NATO integrated military command; President of the G8 and the G20 in 2011. At national level, he had to deal with the financial crisis and its consequences. Following the 2008 constitutional reform, he became the first President since Louis-Napoléon Bonaparte to address the Versailles Congress on 22 June 2009. He introduced education and pension reforms. Sent troops to Libya (Opération Harmattan) in 2011. Narrowly defeated in the runoff of the 2012 election. 24 François Hollande (born 1954) 15 May 2012 14 May 2017 Socialist Party 24 François Hollande (born 1954) 2012 2012 Socialist Party 24 François Hollande (born 1954) Served as Deputy for Corrèze 1 1988–1993, 1997; and as First Secretary of the Socialist Party 1997–2008. He was Mayor of Tulle 2001–2008, and President of the Corrèze General Council 2008–2012. The second left-wing President of the Fifth Republic. Elected in the 2012 election, defeating Nicolas Sarkozy. Legalised same-sex marriage in 2013. The army intervened in Mali (Operation Serval), in the Central African Republic (Operation Sangaris), and against the Islamic State (Opération Chammal). Paris suffered terrorist attacks in January 2015 and November 2015. Hosted the 2015 UN Climate Change Conference. Did not seek re-election in the 2017 election, for which polls suggested his defeat in the first round. Served as Deputy for Corrèze 1 1988–1993, 1997; and as First Secretary of the Socialist Party 1997–2008. He was Mayor of Tulle 2001–2008, and President of the Corrèze General Council 2008–2012. The second left-wing President of the Fifth Republic. Elected in the 2012 election, defeating Nicolas Sarkozy. Legalised same-sex marriage in 2013. The army intervened in Mali (Operation Serval), in the Central African Republic (Operation Sangaris), and against the Islamic State (Opération Chammal). Paris suffered terrorist attacks in January 2015 and November 2015. Hosted the 2015 UN Climate Change Conference. Did not seek re-election in the 2017 election, for which polls suggested his defeat in the first round. Served as Deputy for Corrèze 1 1988–1993, 1997; and as First Secretary of the Socialist Party 1997–2008. He was Mayor of Tulle 2001–2008, and President of the Corrèze General Council 2008–2012. The second left-wing President of the Fifth Republic. Elected in the 2012 election, defeating Nicolas Sarkozy. Legalised same-sex marriage in 2013. The army intervened in Mali (Operation Serval), in the Central African Republic (Operation Sangaris), and against the Islamic State (Opération Chammal). Paris suffered terrorist attacks in January 2015 and November 2015. Hosted the 2015 UN Climate Change Conference. Did not seek re-election in the 2017 election, for which polls suggested his defeat in the first round. 25 Emmanuel Macron (born 1977) 14 May 2017 La République En Marche! 25 Emmanuel Macron (born 1977) 2017, 2022 2017, 2022 La République En Marche! 25 Emmanuel Macron (born 1977) Served as deputy secretary-general of the Élysée 2012–14, Minister of the Economy, Industry and Digital Affairs 2014–16. Elected in the 2017 election, defeating Marine Le Pen (FN). Youngest president in French History. First president to be re-elected in twenty years. Served as deputy secretary- general of the Élysée 2012–14, Minister of the Economy, Industry and Digital Affairs 2014–16. Elected in the 2017 election, defeating Marine Le Pen (FN). Youngest president in French History. First president to be re-elected in twenty years. Served as deputy secretary-general of the Élysée 2012–14, Minister of the Economy, Industry and Digital Affairs 2014–16. Elected in the 2017 election, defeating Marine Le Pen (FN). Youngest president in French History. First president to be re-elected in twenty years. ==References== *",
 "title": "List of presidents of France"
}