{
 "id": "80584",
 "text": ":The article about the original faith of the Celts is at Celtic polytheism Celtic Reconstructionist Paganism, which is sometimes just called by its initials, \"CR\", is a religion. People who belong to the religion call themselves \"Celtic Reconstructionists\" or \"Celtic Reconstructionist Pagans\". Sometimes they just call themseleves \"CRs\". The Celts were the people who lived long ago in many parts of Europe, but mainly in the countries of Ireland, Scotland, Wales, and Gaul (modern-day France). The Modern Celts are the people who live in those countries now, or whose ancestors lived there. Like the ancient Celts did before them, CRs are polytheistic and have many gods and goddesses. They believe in spirits and ancestors, too, and they often honour them with rituals and offerings. Offerings to the spirits might be food, or songs, or poetry. CRs often learn the languages spoken by the Celts, if they do not speak them already. These languages include the Irish language, Scottish Gaelic, the Welsh language and others. Celtic Reconstructionists are a type of Pagan Reconstructionist. Reconstructionists believe in practicing a religion that is from one culture. They are different from eclectic Pagans, who mix parts of different cultures together.McColman (2003) p.51: \"Such reconstructionists are attempting, through both spiritual and scholarly means, to create as purely Celtic a spirituality as possible.\" ==How it started== Celtic Reconstructionist Paganism (CR) started in the 1980s, when people interested in the Celts and in Paganism were looking for an authentic religion. By the 1990s there were lots of CRs. Some of them met each other at Pagan gatherings, and later more people met each other on the Internet.Bonewits (2006) p.131, \"The Celtic Reconstructionist (CR) movement among Pagans began in the 1980s, with discussions among amateur scholars in the pages of Pagan publications or on the computer bulletin boards of the pre- Internet days. In the early 1990s, the term began to be used for those interested in seriously researching and recreating authentic Celtic beliefs and practices for modern Pagans.\" The first person to write about being a \"Celtic Reconstructionist Pagan\" was Kym Lambert ní Dhoireann. She wrote this in the Spring, 1992 issue of Harvest Magazine.Lambert, Kym [K.L. ní Dhoireann] (1992) \"Celtic God/Goddess Names\", Harvest, Southboro, MA, Vol. 12, No. 4, Spring Equinox 1992, pp. 11-12. First use of \"Celtic Reconstructionist\" as tradition name.Lambert, Kym [K.L. ní Dhoireann] (1992) Book Reviews, Bio Blurbs, Harvest, Southboro, MA, Vol. 12, No. 5, Beltane 1992, pp. 6,8. Continued use of \"Celtic Reconstructionist\" and \"Celtic Reconstructionism\". Use of term continued in succeeding issues for full publication run of magazine. She says she got the idea for the name from Kathryn Price NicDhàna, who had also written about it.Theatana, Kathryn [K.P. NicDhàna] (1992) \"More on Names\", Harvest, Southboro, MA, Vol. 12, No. 3, Imbolc 1992, pp. 11-12. On need to reconstruct traditions of ancestral [Celtic] deities and avoid cultural appropriation. Margot Adler's 1979 book, Drawing Down the Moon has a chapter on \"Pagan Reconstructionists\", and Kathryn NicDhàna says this is probably where she got the idea, even though the book does not mention Celtic Reconstructionists, just other kinds.Adler, Margot (1979) Drawing Down the Moon: Witches, Druids, Goddess-Worshippers, and Other Pagans in America Today. Boston, Beacon Press . Chapter 9: Religions from the Past--The Pagan Reconstructionists. ==What Celtic Reconstructionists believe, and what they do== Celtic Reconstructionists base their religion on what we know of the Ancient Celtic people's religion, and also on Celtic folklore. They focus on a particular Celtic culture, such as the Gaelic Welsh or Gaulish. Many CRs are scholars, or mystics, though many believe it's important to be both. CRs read lots of books and do things like meditation, prayer, and rituals. CRs believe that honesty and honorable behaviour is important.Bonewits, Isaac (2006) Bonewits's Essential Guide to Druidism. New York, Kensington Publishing Group . p.132McColman, Carl (2003) Complete Idiot's Guide to Celtic Wisdom. Alpha Press . p.12: \"Some groups have gone even further, trying to use archaeology, religious history, comparative mythology, and even the study of non-Celtic Indo-European religions in an effort to create a well-researched and scholarly \"reconstruction\" of the ancient Celts.\"Erynn Rowan Laurie, Aedh Rua O'Morrighu, John Machate, Kathryn Price Theatana, Kym Lambert ní Dhoireann, Celtic Reconstructionist Paganism, in: Telesco, Patricia [editor] (2005) Which Witch is Which? Franklin Lakes, NJ, New Page Books / The Career Press , p. 85-9. Many CRs view each act of daily life as a form of ritual, and they accompany daily activities with traditional prayers, chants and songs from sources such as the Scottish Gaelic Carmina Gadelica or manuscript collections of ancient Irish or Welsh poetry. Community rituals are usually based on traditional community celebrations found in folkloric collections by authors such as Marian McNeill, Kevin Danaher or John Gregorson Campbell. These celebrations often involve bonfires, dances, songs, divination and children's games. More formal or mystical CR rituals are often based on traditional techniques of interacting with the Otherworld, such as the act of making offerings of food, drink and art to the spirits of the land, ancestral spirits, and the Celtic deities. CR ritual structures are based on the ancient Celtic idea of the \"Three Realms\" - Land, Sea and SkyMac Mathúna, Liam (1999) \"Irish Perceptions of the Cosmos\" Celtica vol. 23 (1999), pp.174-187 \\- with the fire of inspiration seen as a central, uniting force. Many CRs have altars and shrines to the spirits and deities they believe in. They may place these altars at outdoor, natural locations such as wells, streams, and special trees. Some CRs practice divination, such as the taking of omens from the shapes of clouds or the behaviour of birds and animals. ==Other names for Celtic Reconstructionists== While Celtic Reconstructionism was the earliest name in use, and is still used the most often, other names for a Celtic Reconstructionist approach have also come into use, with varying degrees of success.Bonewits (2006) p.137: \"There are, by the way, groups of people who call themselves \"Gaelic Traditionalists\" who have a great deal in common with the Celtic Recons. Some of these GTs started off as CRs, but consider themselves different for some reason or another (usually political). Others are Catholics looking to restore old (but Christian) Gaelic customs. ... The key with understanding these terms, or others such as Celtic Restorationism, Neo-Celtism, Senistrognata, Seandagnatha, Ildiachas/Iol-Diadhachas, etc. is to find out what each person using them intends them to mean.\" ===Pàganachd / Págánacht=== Some CR groups have looked to Celtic languages for a more culturally specific name for the tradition, or for their branch of the tradition. There are groups who now described their traditions as Pàganachd (\"Paganism, Heathenism\" in Scottish Gaelic) or the Irish version, Págánacht. Some Gaelic-oriented groups use the two terms somewhat interchangeably, or further modify these terms to describe the CR sub-tradition practiced by their particular group, such as Pàganachd Allaidh (“Wild Paganism”) or Pàganachd Bhandia (“Paganism of Goddesses”), both used by Gaelic Reconstructionist groups on the East Coast of the US. ===Senistrognata=== In the late 1990s, members of Imbas, a Celtic Reconstructionist group in Seattle, began promoting the name Senistrognata,Bonewits, Isaac (2006) Bonewits's Essential Guide to Druidism. New York, Kensington Publishing Group . p.137 which they say means \"the ancestral customs of the Celtic peoples\" in reconstructed Old Celtic. ===Other=== *The Irish word for “polytheism”, Ildiachas, is in use by at least one group on the West Coast of the US as Ildiachas Atógtha (“reconstructed polytheism”).NicDhàna et al. [August 2007] p.177 *Aurrad, which came into use among members of the Nemeton mailing list in the mid 1990s, means \"person of legal standing in the túath\"Kelly, Fergus (1988) A Guide to Early Irish Law. Dublin, Dublin Institute for Advanced Studies . p.304 in Old Irish.Kelly, Fergus (1988) A Guide to Early Irish Law. Dublin, Dublin Institute for Advanced Studies . p.323 \"petty kingdom, territory, tribe; the laity\" ==Related pages== *Celt *Celtic mythology *Celtic polytheism *Modern Celts *Polytheistic Reconstructionism ; Festivals *Imbolc *Beltane *Lughnasadh *Samhain ==References== ==More reading== ===Celtic Reconstructionism=== *Adler, Margot (1979) Drawing Down the Moon: Witches, Druids, Goddess- Worshippers, and Other Pagans in America Today *Bonewits, Isaac (2006) Bonewits's Essential Guide to Druidism. New York, Kensington Publishing Group Chapter 9: \"Celtic Reconstructionists and other Nondruidic Druids\" *Fairgrove, Rowan (1994) What we don't know about the ancient Celts. Originally printed in The Pomegranate, 2. Now available online *Kondratiev, Alexei (1998) The Apple Branch: A Path to Celtic Ritual. San Francisco, Collins. (1st edition), (2nd edition) [also reprinted without revision under the title Celtic Rituals] *Laurie, Erynn Rowan (1995) A Circle of Stones: Journeys and Meditations for Modern Celts. Chicago, Eschaton. *McColman, Carl (2003) The Complete Idiot's Guide to Celtic Wisdom. Alpha Press *NicDhàna, Kathryn Price; Erynn Rowan Laurie, C. Lee Vermeers, Kym Lambert ní Dhoireann, et al. (2007) The CR FAQ - An Introduction to Celtic Reconstructionist Paganism. River House Publishing. *Telesco, Patricia [editor] (2005) Which Witch is Which? Franklin Lakes, NJ, New Page Books / The Career Press , p. 85-9: \"Celtic Reconstructionist Paganism\" ===Celtic polytheism and folklore=== Celtic Reconstructionists rely on primary mythological texts, as well as surviving folklore, for the basis of their religious practices. No list can completely cover all the recommended works, but this is a small sample of sources used. ;General Celtic *Evans Wentz, W. Y. (1966, 1990) The Fairy-Faith in Celtic Countries. Gerrards Cross, Colin Smythe Humanities Press *MacCana, Proinsias (1970) Celtic Mythology. Middlesex, Hamlyn. *MacKillop, James (1998) A Dictionary of Celtic Mythology. Oxford, Oxford University Press. *Rees, Alwyn and Brinley (1961) Celtic Heritage: Ancient Tradition in Ireland and Wales. New York, Thames and Hudson. *Sjoestedt, Marie-Louise (1982) Gods and Heroes of the Celts. Translated by Myles Dillon, Berkeley, CA, Turtle Island Foundation. ;Gaelic (Irish and Scottish) *Campbell, John Gregorson (1900, 1902, 2005) The Gaelic Otherworld. Edited by Ronald Black. Edinburgh, Birlinn Ltd. *Carmichael, Alexander (1992) Carmina Gadelica: Hymns and Incantations (with illustrative notes on wards, rites, and customs dying and obsolete/ orally collected in the highlands and islands of Scotland by Alexander Carmichael). Hudson, NY, Lindisfarne. *Clark, Rosalind (1991) The Great Queens: Irish Goddesses from the Morrigan to Cathleen ni Houlihan. Savage, MD, Barnes and Noble Books. *Danaher, Kevin (1972) The Year in Ireland. Dublin, Mercier. *Dillon, Myles (1994) Early Irish Literature. Dublin, Four Courts Press. *Gray, Elizabeth A (1982) Cath Maige Tuired: The 2nd Battle of Mag Tuired. Dublin, Irish Texts Society *McNeill, F. Marian (1959). The Silver Bough, Vol. 1-4. Glasgow, William MacLellan *Nagy, Joseph Falaky (1985) The Wisdom of the Outlaw: The Boyhood Deeds of Finn in Gaelic Narrative Tradition. Berkely, University of California Press. *Patterson, Nerys Thomas (1994) Cattle Lords and Clansmen: The Social Structure of Early Ireland. Notre Dame, IN, University of Notre Dame Press (2nd edition) *Power, Patrick C. (1976) Sex and Marriage in Ancient Ireland. Dublin, Mercier *Smyth, Daragh (1988, 1996) A Guide to Irish Mythology. Dublin, Irish Academic Press ;Comparative European *Davidson, H.R. Ellis (1988) Myths and Symbols in Pagan Europe: Early Scandinavian and Celtic Religions. Syracuse, Syracuse University Press. *Epstein, Angelique Gulermovich (1998) War Goddess: The Morrígan and Her Germano-Celtic Counterparts. Los Angeles, University of California *Lincoln, Bruce (1991) Death, War, and Sacrifice: Studies in Ideology and Practice. Chicago, University of Chicago Press. ==Other websites== *The CR FAQ - An Introduction to Celtic Reconstructionist Paganism: Written by representatives of different CR groups - including some of the founders of the tradition - the FAQ is only the second document to present a consensus view that speaks for more than one group's vision. *Celtic Reconstructionist Paganism : The much-briefer consensus tradition statement from 2003. Contains unclear bits that were later cleared up in the FAQ, but a much quicker read than the FAQ. *What we mean by Celtic Reconstructionism : Statement from Imbas ;Organisations *Dùn Sgàthan (New Hampshire) *Gaol Naofa: Gaelic Polytheism Organisation (Florida) *IMBAS (Seattle, Washington) *New Tara : Diverse Celtic group which includes Reconstructionists (Toronto) *Macalla : Núcleo de Estudos e Pesquisas Celtas (Rio de Janeiro, Brazil) ;Online portals *CAORANN: Celts Against Oppression, Racism and Neo-Nazism *Pàganachd / Págánacht: Home of the CR FAQ and other CR resources. * Tres Mundos : Paganismo Reconstrucionista Celta (Portuguese) Category:Paganism",
 "title": "Celtic Reconstructionist Paganism"
}