{
 "id": "806448",
 "text": "The predator-prey equations is an ecological system. Two linked equations model the two species which depend on each other: One is the prey, which provides food for the other, the predator. Both prey and predator populations grow if conditions are right. Alfred J. Lotka found these equations in 1925.Lotka A.J. 1925. Elements of physical biology. Williams and Wilkins. Vito Volterra found them, independently, in 1926. For this reason, the equations are also called Lotka-Volterra equations.Leigh E.R. 1968. The ecological role of Volterra's equations, in Some Mathematical Problems in Biology. A modern discussion using Hudson's Bay Company data on lynx and hares in Canada from 1847 to 1903. The equations themselves are non-linear differential equations. == Pre-conditions == There are a number of pre-conditions # The prey population always finds food # The size of the predator population only depends on the size of the prey population # The rate of change of a population depends on its size # There are no changes in the environment which would favor one species. Genetic changes are not important # Predators have limitless appetite In this case the solution of the differential equations is deterministic and continuous. This means that the generations of both the predator and prey are overlapping all the time. ==Lotka-Volterra rules== The solutions to the equations lead to the Lotka-Volterra rules: # There are periodic changes in the populations of predator and prey. The changes in the population of predators follow that of the prey. # Looking at longer periods of time: the average number of predators, and prey is constant so long as the environment is stable. # If the number of predators is reduced, the number of prey animals increase. == A general predator-prey model == Consider two populations whose sizes at a reference time t are denoted by x(t), y(t), respectively. The functions x and y might might denote population numbers or concentration (number per area) or some other scaled measure of the population sizes, but are taken to be continuous functions. Changes in population size with time are describing by the time derivatives \\dot{x} \\equiv dx/dt and \\dot{y} \\equiv dy/dt, respectively. == Applications == In one of his books, Volterra provided statistics on the number of certain cartilagenous fish caught at some Italian ports in the Mediterranean. Volterra used the term \"sélaciens\", which refers to sharks. These often prey on other fish. In the table, Volterra provided numbers for 1905, and 1910 to 1923: 1905 1910 1911 1912 1913 1914 1915 1916 1917 1918 1919 1920 1921 1922 1923 Trieste – 5,7 8,8 9,5 15,7 14,6 7,6 16,2 15,4 – 19,9 15,8 13,3 10,7 10,2 FiumeFiume is called Rijeka today. From 1805 to 1945 it was part of Italy. At the end of World War II, about 80% of its inhabitants were Italians. – – – – - 11,9 21,4 22,1 21,2 36,4 27,3 16 15,9 14,8 10,7 Venice 21,8 – – – - – – - – – 30,9 25,3 25,9 26,8 26,6 He observed that between 1915 and 1920, more of these fish were caught. He expained this as follows: During the First World War, less fishing was done. For this reason, there were more prey animals, so the number of predators increased. After the war, fishing increased again, reducing the number of prey animals. This also led to a decrease in the number of predators, which can be seen in the table above. The use of the first Lotka- Volerra rule in economics is known as the pork cycle. == Extensions == The predator-prey equations have also been the foundation of other work. Volterra himself extended it to be able to model intraspecific competition. Intraspecific competition occurs when two aninimals of the same species compete for limited resources. Intraspecific competition is an important factor to regulate population density. It is also important to be able to adapt to a changing environment (and for evoution). Volterra did this by adding new terns to the equation. Most of Volerra's work is about extending the model to be able to handle more than two classes of animals interacting. ==Related pages== *Food chain *Carrying capacity == References == ==Further reading== * * * ==Other websites== * The most commonly cited example of these equations * Category:Differential equations Category:Predation",
 "title": "Predator-prey equations"
}