{
 "id": "806436",
 "text": "Kay Purcell (6 December 1963 – 23 December 2020) was an English actress. She was best known for portraying the roles of Cynthia Daggert in the ITV soap opera Emmerdale (2001–2002), Candice Smilie in the BBC school-based drama series Waterloo Road (2007–2009), and Gina Conway in the CBBC drama series Tracy Beaker Returns (2010–2012) and its spin-off series The Dumping Ground (2013). Then from 2015 to 2017, she appeared as Mrs. Rennison in the CBBC sitcom So Awkward (2015–2017). ==Personal life== In early 2017, Purcell was diagnosed with breast cancer. Purcell posted images, videos and blogs on social media to show her own experience of the disease. In early 2020, Purcell was diagnosed with terminal liver cancer and was given a life expectancy of two years. She died from the disease on 23 December 2020, aged 57. ==Filmography== Year Title Role Notes 1995 Cracker TV Reporter Episode: \"True Romance: Part 2\" 1996–1998 Emmerdale Carmel Morgan Recurring role; 9 episodes 1997 Coronation Street Rhona Summers 3 episodes 1998 Casualty WDC McCarthy Episode: \"Taking Sides\" 1999 City Central Jenny Episode: \"Paradise Lost\" My Parents Are Aliens Mrs. Williams Episode: \"The Home Team\" 2000 Casualty Diane Abley Episode: \"Fall Out\" Children's Ward Winsome Series 12: Episode 8 2001–2002 Emmerdale Cynthia Daggert Regular role; 188 episodes 2003 Holby City Heather Nixon Episode: \"Read My Lips\" 2004–2005 Bernard's Watch Ms. Savage Main role; 21 episodes 2004 Sex Lives of the Potato Men Gloria Film 2005 Messiah Prof Uhomi Episodes: \"The Harrowing: Parts 1–3\" Doctors Mrs. Jane Manners 2 episodes 2006 Ideal Alice Episode: \"The Delivery\" My Parents Are Aliens Mrs. Brookman 3 episodes 2007–2009 Waterloo Road Candice Smilie Main role; 24 episodes 2010–2012 Tracy Beaker Returns Gina Conway All 39 episodes 2011–2012 Tracy Beaker Survival Files Main role 2012 Hacker Time Herself Episode: \"Connor Byrne and Kay Purcell\" 2013 The Dumping Ground Gina Conway Main role; 13 episodes 2014–2016 Hacker Time Mrs. Breadbin 13 episodes 2015–2017 So Awkward Mrs. Rennison Main role; 25 episodes 2016 Sunny D Barbara Episode: \"D Is for Declarations\" 2020 When It Rains Sonia 5 episodes 2021 Doctors Mo Larkin Episode: \"Of Mice and Women\"; posthumous release ==References== ==Other websites== * Category:1963 births Category:2020 deaths Category:Deaths from liver cancer Category:English stage actors Category:English television actors Category:English movie actors Category:Soap opera actors Category:Actors from Lancashire",
 "title": "Kay Purcell"
}