{
 "id": "806708",
 "text": "The following are the football (soccer) events of the year 2002 around the world. ==Events== ;January *January 8: The Tampa Bay Mutiny and Miami Fusion withdraw from the MLS. They are both dissolved on the same day. *January 19: The opening match of the 2002 African Cup of Nations is played. Mali drew 1–1 against Liberia at the Stade du 26 Mars in Bamako, Mali. ;February *February 10: The 2002 African Cup of Nations final is played. Cameroon beat Senegal 3–2 on penalties to win their fourth African Cup of Nations. *February 13: Dick Advocaat replaces Louis van Gaal as the manager of the Netherlands. His first game as Netherlands manager was 1–1 draw against England. ;March *March 16: A 2001–02 Football League First Division match between Sheffield United and West Bromwich Albion is played. The match was won 3–0 by West Bromwich Albion after the match was abandoned in the 82nd minute, after Sheffield United went down to 6 men on the field. This match would be the only match in the history of English professional football history to be abandoned because of a shortage of players, and would later be known as the Battle of Bramall Lane. ;April *April 5: The 2001-02 Asian Club Championship Final was played. South Korean club Suwon Samsung Bluewings beat fellow South Korean club Anyang LG Cheetahs 4–2 on penalties. ;May *May 8: Dutch club Feyenoord beat German club Borussia Dortmund 3-2 in the 2002 UEFA Cup Final. The match was played at the Stadion Feijenoord, in Rotterdam, the Netherlands. *May 12: Scottish club Celtic won the 2001–02 Scottish Premier League with 103 points. This would be the highest points total a team has finished with in Scotland until the 2016–17 season, when Celtic finished with 106 points. *May 15: Spanish club Real Madrid beat German club Bayer Leverkusun in the 2002 UEFA Champions League final. The match was played at Hampden Park in Scotland. *May 28: The 53rd FIFA Congress is held. This is when the 2002 FIFA Presidential Election happened. Joseph \"Sepp\" Blatter beats Issa Hayatou in the election. *May 30: A.F.C. Wimbledon is founded in England. It is founded by Wimbledon F.C. fans who were annoyed that the club was allowed to move to Milton Keynes. *May 31: The opening match of the 2002 FIFA World Cup is played. In that game, Senegal beat 1998 World Cup winners France 1–0 at the Seoul World Cup Stadium in South Korea. ;June *June 17: 1954 FIFA World Cup winner Fritz Walter passes away. *June 21: Austrian champions Tirol Innsburck are declared bankrupt and lose their Austrian Bundesliga license. This comes shortly after winning their third Austrian Bundesliga title. *June 30: The 2002 FIFA World Cup Final is played. Brazil beats Germany 2–0 at the International Stadium of Yokohama, Japan. ;July *July 31: The 2nd leg of the 2002 Copa Libertadores Final is played. Paraguayan club Club Olimpia beat Brazilian club São Caetano 2–1 (2–2 on aggregate). Club Olympia would win 4–2 on penalties. ;August *August 27: The 2nd leg of the 2002 UEFA Intertoto Cup finals were played. ** German club Stuttgart beat French club Lille 2–0 (Stuttgart won 2–1 on aggregate). ** English club Fulham beat Italian club Bologna 3–1 (Fulham won 5–3 on aggregate). ** Spanish club Málaga drew 1–1 against fellow Spanish club Villarreal (Málaga won 2–1 on aggregate). *August 30: The 2002 UEFA Super Cup is played. UEFA Champions League winner Real Madrid beat UEFA Cup winner Feyenoord 3-1 at the Stade Louis II in Monaco. *August 31: Spanish club Real Madrid sign Brazilian footballer Ronaldo from Italian club Inter Milan for €45 million. *Date Unknown: Dutch coach Gerard van der Lem replaces Martin Koopman as the manager of Saudi Arabia. ;September *September 17: 1958 FIFA World Cup winner Edvaldo Alves de Santa Rosa passes away. He dies due to cancer. *September 18: The 2002 CONCACAF Champions' Cup Final was played. Mexican club Pachuca beat fellow Mexican club Monarcas Morelia 1–0 at the Estadio Azul in Mexico City. *September 22: 1950 FIFA World Cup winner Julio Pérez passes away. ;October *October 31: A match between AS Adema and SO l'Emyrne in Madagascar ended at 149–0. This is due to SO l'Emyrne scoring 149 own goals in protest. It was later discovered that the match was fixed. ;November *November 9: 1950 FIFA World Cup winner Eusebio Tejera passes away. *November 13: 1950 FIFA World Cup winner Juan Alberto Schiaffino passes away. ;December *December 3: European champions Real Madrid beat South American champions Club Olimpia 2–0 in the 2002 Intercontinental Cup. *December 17: The 2002 FIFA World Player of the Year gala is held. Brazilian footballer Ronaldo wins the Men's award, while American soccer player Mia Hamm wins the Woman's award. ;Date Unknown *The English Football Hall of Fame is opened. ==Tournament Winners== ===International=== Tournament Confederation Host Country(s) Winner Runner-Up Finals Stadium 2002 African Cup of Nations CAF (Africa) Stade du 26 Mars, Bamako 2002 FIFA World Cup FIFA Nissan Stadium, Yokohama ===Youth International=== Tournament Confederation Host Country(s) Winner Runner-Up Finals Stadium 2002 UEFA European Under-17 Championship UEFA (Europe) Farum Park, Farum 2002 UEFA European Under-19 Championship UEFA (Europe) Ullevaal Stadion, Oslo 2002 UEFA European Under-21 Championship UEFA (Europe) St. Jakob-Park, Basel ===Continental=== Confederation Tournament Previous Winner Winner Runner-Up Finals Stadium AFC (Asia) 2001–02 Asian Club Championship Suwon Samsung Bluewings (2000-01) Suwon Samsung Bluewings Anyang LG Cheetahs Azadi Stadium, Tehran CAF (Africa) 2002 CAF Champions League Al Ahly (2001) Zamalek SC Raja Casablanca 2-Legged Final CONCACAF (North America) 2002 CONCACAF Cup Los Angeles Galaxy (2000) Pachuca Monarcas Morelia Estadio Azul, Mexico City CONMEBOL (South America) 2002 Copa Libertadores Boca Juniors (2001) Club Olimpia A.D. São Caetano 2-Legged Final CONMEBOL (South America) 2002 Copa Sudamericana First Season San Lorenzo Atlético Nacional 2-Legged Final UEFA (Europe) 2001–02 UEFA Champions League Bayern Munich (2000-01) Real Madrid Bayer Leverkusen Hampden Park, Glasgow UEFA (Europe) 2001–02 UEFA Cup (2000-01) Feyenoord Borussia Dortmund De Kuip, Rotterdam UEFA (Europe) 2002 UEFA Super Cup (2001) Real Madrid Feyenoord Stade Louis II, Monaco UEFA (Europe) 2002 UEFA Intertoto Cup (2001) Troyes Málaga VfB Stuttgart Villarreal Bologna Lille 2-Legged Final ===National=== ====AFC==== Country League Winners Cup Winners Supercup Winners (NSL regular season) Olympic Sharks (NSL Finals) - - Qingdao Hademen Mohun Bagan - - \\- Júbilo Iwata Kyoto Purple Sanga Shimizu S-Pulse Al-Ittihad Al-Ittihad Al-Khor SC (Qatari Sheikh Jassim Cup) Qatar SC (Qatar Cup) Seongnam Ilhwa Chunma Suwon Samsung Bluewings Seongnam Ilhwa Chunma Al-Ain Al Ahli - ====CONCACAF==== Nation League Champion Cup Winner Runner-Up 2001–02 AFA Senior Male League Roaring Lions No Cup No Cup No Cup 2001–02 Antigua and Barbuda Premier Division Parham No Cup No Cup No Cup No League No League 2001–02 New Providence FA Cup JJ Johnson United Unknown 2002 Barbados Premier Division Notre Dame 2002 Barbados FA Cup Youth Milan Notre Dame 2001–02 Belize Premier Football League Kulture Yabra No Cup No Cup No Cup 2001–02 Bermudian Premier Division North Village Community Club 2002 Bermuda FA Cup North Village Community Club Dandy Town Hornets 2002 Tortola League Future Stars No Cup No Cup No Cup 2002 Virgin Gorda League Rangers No Cup No Cup No Cup 2002 Canadian Professional Soccer League Ottawa Wizards 2002 CPSL Canada Cup Ottawa Wizards Toronto Croatia 2002 Canadian Professional Soccer League Ottawa Wizards 2002 Voyageurs Cup Montreal Impact Toronto Lynx 2001–02 Cayman Islands Premier League George Town SC 2001–02 Cayman Islands FA Cup George Town SC Scholars International SC 2001–02 Primera División Alajuelense No Cup No Cup No Cup 2001–02 Campeonato Nacional de Fútbol de Cuba Pinar del Río No Cup No Cup No Cup 2002 Dominica Premier League Kubuli All Stars No Cup No Cup No Cup 2002 Clausura C.D. FAS No Cup No Cup No Cup 2002 Apertura C.D. FAS No Cup No Cup No Cup 2001–02 French Guiana Régional 1 AJ Saint-Georges 2001–02 Coupe de Guyane US Sinnamary Unknown 2002 GFA Premier Division Queens Park Rangers No Cup No Cup No Cup 2002 Clausura Municipal 2002 Copa de Guatemala CD Jalapa Cobán Imperial 2002 Apertura Comunicaciones 2002 Copa de Guatemala CD Jalapa Cobán Imperial 2001–02 Guadeloupe Division of Honour L'Étoile de Morne-à-l'Eau 2002 Coupe de Guadeloupe L'Étoile de Morne- à-l'Eau Solidarité-Scolaire No League No League 2001–02 Guyana Mayors Cup Thomas United Camptown FC 2002 Ligue Haïtienne Ouverture Roulado FC No Cup No Cup No Cup 2002 Ligue Haïtienne Clôture Racing CH No Cup No Cup No Cup 2001–02 Apertura Motagua No Cup No Cup No Cup 2001–02 Clausura Marathón No Cup No Cup No Cup 2001–02 Jamaica Premier League Arnett Gardens 2001–02 JNBS Federation Cup Harbour View Rivoli United 2001–02 Martinique Championnat National Club Franciscain 2002 Coupe de la Martinique Club Franciscain Rivière-Pilote 2002 Primera División de México Verano Club América No Cup No Cup No Cup 2002 Primera División de México Apertura Deportivo Toluca No Cup No Cup No Cup 2002 Aruban Division di Honor RCA 2002 Netherlands Antilles Championship CSD Barber Unknown 2001–02 Bonaire League SV Estrellas 2002 Netherlands Antilles Championship CSD Barber Unknown 2001–02 Sekshon Pagá CSD Barber 2002 Netherlands Antilles Championship CSD Barber Unknown 2002 Sint Maarten Senior League Victory Boys 2002 Netherlands Antilles Championship CSD Barber Unknown 2001−02 Liga Primera de Nicaragua Deportivo Jalapa No Cup No Cup No Cup 2002 Apertura Árabe Unido No Cup No Cup No Cup 2002 Clausura Plaza Amador No Cup No Cup No Cup 2001–02 SKNFA Super League Cayon Rockets 2001–02 Saint Kitts and Nevis National Cup Cayon Rockets Unknown 2002 Saint Lucia Gold Division VSADC 2002 Saint Lucia FA Cup VSADC Cimpex Orion 2001–02 Saint-Martin Senior League Orléans Attackers No Cup No Cup No Cup 2001–02 SVB Hoofdklasse Voorwaarts 2002 SVB Cup Transvaal Robinhood 2002 TT Pro League San Juan Jabloteh 2002 Trinidad and Tobago Cup W Connection Arima Fire 2002 Provo Premier League Beaches No Cup No Cup No Cup 2001–02 U.S. Virgin Islands Championship Haitian Stars No Cup No Cup No Cup 2002 Major League Soccer Los Angeles Galaxy (MLS Cup & Supporters' Shield) 2002 U.S. Open Cup Columbus Crew Los Angeles Galaxy ====UEFA==== Nation League Champion Cup Winner Runner-Up 2001–02 Albanian National Championship Dinamo Tirana 2001-02 Albanian Cup KF Tirana Dinamo Tirana 2001–02 Albanian National Championship Dinamo Tirana 2002 Albanian Supercup KF Tirana Dinamo Tirana 2001–02 Primera Divisió Encamp 2002 Copa Constitució Lusitanos Inter Club d'Escaldes 2002 Armenian Premier League Pyunik 2002 Armenian Cup Pyunik Zvartnots-AAL 2002 Armenian Premier League Pyunik 2002 Armenian Supercup Pyunik Mika 2001–02 Austrian Football Bundesliga Tirol InnsbruckFolded after winning the league 2001–02 Austrian Cup Grazer AK Sturm Graz 2001–02 Austrian Football Bundesliga Tirol InnsbruckFolded after winning the league 2002 Austrian Supercup Grazer AK Sturm Graz 2001-02 Azerbaijan Premier League Not finishedAzerbaijan 2001/02 The season was not finished because of a conflict between the clubs and the Association of Football Federations of Azerbaijan 2001-02 Azerbaijan Cup Neftçi Baku Shamkir 2002 Belarusian Premier League BATE Borisov 2001–02 Belarusian Cup Gomel BATE Borisov 2001–02 Belgian First Division Genk 2001–02 Belgian Cup Club Brugge Mouscron 2001–02 Belgian First Division Genk 2002 Belgian Super Cup Club Brugge Genk 2001–02 Premier League of Bosnia and Herzegovina Željezničar 2001-02 Bosnia and Herzegovina Cup FK Sarajevo Željezničar 2001–02 A Group Levski Sofia 2001-02 Bulgarian Cup Levski Sofia CSKA Sofia 2001–02 Croatian First Football League NK Zagreb 2001-02 Croatian Football Cup Dinamo Zagreb NK Varaždin 2001–02 Croatian First Football League NK Zagreb 2002 Croatian Football Super Cup Dinamo Zagreb NK Zagreb 2001-02 Cypriot First Division APOEL FC 2001–02 Cypriot Cup Anorthosis Famagusta Ethnikos Achna 2001-02 Cypriot First Division APOEL FC 2002 Cyprus FA Shield APOEL FC Anorthosis Famagusta 2001-02 Czech First League Slovan Liberec 2001-02 Czech Cup Slavia Prague Sparta Prague 2001–02 Danish Superliga Brøndby IF 2001-02 Danish Cup Odense BK Copenhagen 2001–02 Danish Superliga Brøndby IF 2002 Danish Supercup Brøndby IF Odense BK 2001–02 FA Premier League Arsenal 2001-02 FA Cup Arsenal Chelsea 2001–02 FA Premier League Arsenal 2001–02 Football League Cup Blackburn Rovers Tottenham Hotspur 2001–02 FA Premier League Arsenal 2002 FA Community Shield Arsenal Liverpool 2002 Meistriliiga Flora 2001-02 Estonian Cup Levadia Tallinn Levadia Maardu 2002 Meistriliiga Flora 2002 Estonian Supercup Flora Levadia II 2002 Veikkausliiga HJK Helsinki 2002 Finnish Cup FC Haka FC Lahti 2001–02 French Division 1 Olympique Lyonnais 2001–02 Coupe de France Lorient Bastia 2001–02 French Division 1 Olympique Lyonnais 2001–02 Coupe de la Ligue Girondins de Bordeaux Lorient 2001–02 French Division 1 Olympique Lyonnais 2002 Trophée des Champions Olympique Lyonnais Lorient 2001–02 Umaglesi Liga FC Torpedo Kutaisi 2001–02 Georgian Cup Locomotive Tbilisi Torpedo Kutaisi 2001-02 Bundesliga Borussia Dortmund 2001-02 DFB-Pokal Schalke 04 Bayer 04 Leverkusen 2001–02 Alpha Ethniki Olympiacos 2001–02 Greek Football Cup AEK Athens Olympiacos 2001–02 Nemzeti Bajnokság I Zalaegerszegi 2001–02 Magyar Kupa Újpest Szombathelyi Haladás 2001–02 Nemzeti Bajnokság I Zalaegerszegi 2002 Szuperkupa Újpest Zalaegerszegi 2002 Úrvalsdeild KR 2002 Icelandic Cup Fylkir Fram 2002 Úrvalsdeild KR 2002 Deildabikar FH Fylkir 2001–02 League of Ireland Premier Division Shelbourne 2001-02 FAI Cup Dundalk Bohemians 2001–02 League of Ireland Premier Division Shelbourne 2002 FAI Cup Derry City Shamrock Rovers 2001–02 League of Ireland Premier Division Shelbourne 2001-02 League of Ireland Cup Limerick Derry City 2001-02 Israeli Premier League Maccabi Haifa 2001-02 Israel State Cup Maccabi Tel Aviv Maccabi Haifa 2001-02 Israeli Premier League Maccabi Haifa 2001–02 Toto Cup Al Hapoel Tel Aviv FC Ashdod 2001-02 Israeli Premier League Maccabi Haifa 2001–02 Toto Cup Artzit Hapoel Ashkelon Hapoel Ironi Kiryat Shmona 2001-02 Serie A Juventus 2001–02 Coppa Italia Parma Juventus 2001-02 Serie A Juventus 2002 Supercoppa Italiana Juventus Parma 2002 Latvian Higher League Skonto 2002 Latvian Football Cup Skonto FHK Liepājas Metalurgs No League No League 2001–02 Liechtenstein Cup Vaduz USV Eschen/Mauren 2002 A Lyga FBK Kaunas 2001-02 Lithuanian Football Cup FBK Kaunas FK Sūduva 2002 A Lyga FBK Kaunas 2002 Lithuanian Supercup FBK Kaunas 2001–02 Luxembourg National Division F91 Dudelange 2001–02 Luxembourg Cup Avenir Beggen F91 Dudelange 2001–02 Macedonian First Football League Vardar 2001–02 Macedonian Football Cup Pobeda Cementarnica 55 2001–02 Maltese Premier League Hibernians 2001-02 Maltese FA Trophy Birkirkara Sliema Wanderers 2001–02 Maltese Premier League Hibernians 2002 Maltese Super Cup Birkirkara Hibernians 2001–02 Moldovan National Division Sheriff Tiraspol 2001-02 Moldovan Cup Sheriff Tiraspol Nistru Otaci 2001-02 Eredivisie Ajax 2001–02 KNVB Cup Ajax Utrecht 2001-02 Eredivisie Ajax 2002 Johan Cruyff Shield Ajax PSV Eindhoven 2001–02 Irish League Portadown 2001–02 Irish Cup Linfield Portadown 2001–02 Irish League Portadown 2001–02 Irish League Cup Linfield Glentoran 2002 Tippeligaen Rosenborg 2002 Norwegian Football Cup Vålerenga Odd Grenland 2001–02 Ekstraklasa Legia Warsaw 2001-02 Polish Cup Wisła Kraków Amica Wronki 2001–02 Primeira Liga Sporting CP 2001–02 Taça de Portugal Sporting CP Leixões 2001–02 Primeira Liga Sporting CP 2002 Supertaça Cândido de Oliveira Sporting CP Leixões 2001–02 Divizia A Dinamo București 2001-02 Cupa României Rapid București Dinamo București 2001–02 Divizia A Dinamo București 2002 Supercupa României Rapid București Dinamo București 2002 Russian Premier League Lokomotiv Moscow 2001-02 Russian Cup CSKA Moscow Zenit Saint Petersburg 2001–02 Campionato Sammarinese di Calcio FC Domagnano 2001-02 Coppa Titano FC Domagnano SP Cailungo 2001–02 Scottish Premier League Celtic 2001–02 Scottish Cup Rangers Celtic 2001–02 Scottish Premier League Celtic 2001–02 Scottish League Cup Rangers Ayr United 2001–02 Slovak Superliga Žilina 2001–02 Slovak Cup Koba Senec Matador Púchov 2001–02 Slovenian PrvaLiga Maribor 2001–02 Slovenian Football Cup Gorica Aluminij 2001–02 La Liga Valencia 2001-02 Copa del Rey Deportivo de La Coruña Real Madrid 2001–02 La Liga Valencia 2002 Supercopa de España Deportivo de La Coruña Valencia 2002 Allsvenskan Djurgårdens 2002 Svenska Cupen Djurgårdens AIK 2001–02 Nationalliga A FC Basel 2001-02 Swiss Cup FC Basel Grasshopper Club Zürich 2001–02 Süper Lig Galatasaray 2001-02 Turkish Cup Kocaelispor Beşiktaş 2001–02 First League of FR Yugoslavia Partizan 2001–02 FR Yugoslavia Cup Red Star Belgrade Sartid 2001–02 Vyshcha Liha Shakhtar Donetsk 2001-02 Ukrainian Cup Shakhtar Donetsk Dynamo Kyiv 2001–02 League of Wales Barry Town 2001-02 Welsh Cup Barry Town Bangor City 2001–02 League of Wales Barry Town 2001-02 Welsh League Cup Caersws Cwmbrân Town ====Notes==== ==Births & Deaths== ===Births=== Note: Players with clubs in bold are currently playing at that club. (As of February 9, 2025) ====January–June==== Date of Birth Player Nationality Played For Awards January 1 Simon Adingra Nordsjælland Brighton & Hove Albion Union SG 2023 Africa Cup of Nations winner January 3 Nico González Barcelona Valencia FC Porto Manchester City 2023–24 Taça de Portugal winner 2024 Supertaça Cândido de Oliveira winner Son of Spanish former footballer Fran Nephew of former Spanish footballer José Ramón January 7 Mohamed Daramy Copenhagen Ajax Stade de Reims 3-time Danish Superliga winner (2018–19, 2021–22, 2022–23) 2022–23 Danish Cup winner 2021–22 Eredivisie winner January 9 Piero Hincapié Independiente del Valle Talleres de Córdoba Bayer Leverkusen 2023–24 Bundesliga winner 2023–24 DFB-Pokal winner 2024 DFL-Supercup winner 2023–24 UEFA Europa League runner-up Member of the 2024 Copa América Team of the Tournament January 16 Bagas Kaffa Barito Putera Gold medalist at the 2023 Southeast Asian Games Twin brother of Indonesian footballer Bagus Kahfi January 18 Karim Adeyemi Red Bull Salzburg FC Liefering Borussia Dortmund 3-time Austrian Bundesliga winner (2019–20, 2020–21, 2021–22) 3-time Austrian Cup winner (2019–20, 2020–21, 2021–22) 2023–24 UEFA Champions League runner-up January 19 Reinier Flamengo Real Madrid Borussia Dortmund Girona Frosinone Granada 2019 Campeonato Brasileiro Série A winner 2020–21 DFB-Pokal winner 2019 Copa Libertadores winner 2019 FIFA Club World Cup runner-up 2020 Summer Olympics gold medalist January 23 Joško Gvardiol Dinamo Zagreb RB Leipzig Manchester City 2-time Croatian First Football League winner (2019–20, 2020–21) 2020–21 Croatian Football Cup winner 2019 Croatian Football Super Cup winner 2-time DFB-Pokal winner (2021–22, 2022–23) 2023–24 Premier League winner 2023–24 FA Cup runner-up 2024 FA Community Shield winner 2023 UEFA Super Cup winner 2023 FIFA Club World Cup winner Third place at the 2022 FIFA World Cup January 29 Andri Guðjohnsen Real Madrid Castilla IFK Norrköping Lyngby Gent 2022 Baltic Cup winner Son of former Icelandic footballer Eiður Guðjohnsen January 30 Marco Di Cesare Argentinos Juniors Racing Club 2024 Copa Sudamericana winner January 31 Giovanni Jong Ajax Telstar Fluminense Ballkani 2023 Campeonato Carioca winner 2023 Copa Libertadores winner February 1 Brian Brobbey Ajax RB Leipzig 2-time Eredivisie winner (2020–21, 2021–22) 2020–21 KNVB Cup winner February 3 Radu Drăgușin Juventus Genoa Tottenham Hotspur 2020–21 Coppa Italia winner 2020 Supercoppa Italiana winner February 25 Maghnes Akliouche AS Monaco Silver medalist at the 2024 Summer Olympics March 3 Makar Litskevich Shakhtyor Soligorsk FC Sputnik Rechitsa 2-time Belarusian Premier League winner (2020, 2021 March 10 Ian Maatsen Chelsea Burnley Borussia Dortmund Aston Villa 2023–24 UEFA Champions League runner-up Noni Madueke PSV Eindhoven Chelsea 2021–22 KNVB Cup winner 2021 Johan Cruyff Shield winner 2023–24 EFL Cup runner-up March 16 Nathanaël Mbuku Stade de Reims FC Augsburg Saint-Étienne Dinamo Zagreb April 16 Filip Jörgensen Villarreal Chelsea 2020–21 UEFA Europa League winner April 20 Georginio Rutter Stade Rennais TSG Hoffenheim Leeds United Brighton & Hove Albion April 27 Anthony Elanga Manchester United Nottingham Forest 2022–23 EFL Cup winner 2022–23 FA Cup runner-up 2020–21 UEFA Europa League runner-up Son of Cameroonian footballer Joseph Elanga May 6 Cole Palmer Manchester City Chelsea 2022–23 Premier League winner 2022–23 FA Cup winner 2023–24 EFL Cup runner-up 2022–23 UEFA Champions League winner 2023 UEFA Super Cup winner UEFA Euro 2024 runner-up May 13 Eugenio Pizzuto Pachuca Lille Braga B Tigres UANL 2020–21 Ligue 1 winner 2023 Campeón de Campeones winner May 14 Daniel Peñaloza Tigres Made his Categoría Primera A debut at the age of 14 May 16 Kenneth Taylor Ajax 2-time Eredivisie winner (2020–21, 2021–22) 2020–21 KNVB Cup winner Ryan Gravenberch Ajax Bayern Munich Liverpool 3-time Eredivisie winner (2018–19, 2020–21, 2021–22) 2-time KNVB Cup winner (2018–19, 2020–21) 2022–23 Bundesliga winner 2022 DFL-Supercup winner 2023–24 EFL Cup winner Brother of Dutch-Surinamese footballer Danzell Gravenberch May 19 Riccardo Calafiori AS Roma FC Basel Bologna Arsenal May 27 Jérémy Doku Anderlecht Stade Rennais Manchester City 2023–24 Premier League winner 2023–24 FA Cup runner-up 2024 FA Community Shield winner 2023 FIFA Club World Cup winner May 27 Gabri Veiga Celta Vigo Al-Ahli May 28 Gianluca Busio Sporting Kansas City Venezia 2021 CONCACAF Gold Cup winner June 3 Yan Couto Coritiba Manchester City Girona Braga Borussia Dortmund June 7 Tomáš Suslov FC Groningen Hellas Verona Tanguy Nianzou Paris Saint-Germain Bayern Munich Sevilla 2019–20 Ligue 1 winner 2019–20 Coupe de France winner 2019–20 Coupe de la Ligue winner 2-time Bundesliga winner (2020–21, 2021–22) 2-time DFL-Supercup winner (2021, 2022) 2019–20 UEFA Champions League runner-up 2022–23 UEFA Europa League winner June 10 Aaron Hickey Heart of Midlothian Bologna Brentford June 16 Ismaël Koné CF Montréal Watford Olympique Marseille Stade Rennais June 19 Efraín Álvarez LA Galaxy Club Tijuana Brother of American soccer player Carlos Alvarez Nuno Mendes Sporting CP Paris Saint-Germain 2020–21 Primeira Liga winner 2020–21 Taça da Liga winner 2021 Supertaça Cândido de Oliveira winner 3-time Ligue 1 winner (2021–22, 2022–23, 2023–24) 2023–24 Coupe de France winner 2022 Trophée des Champions winner June 20 Hugo Ekitike Stade de Reims Paris Saint-Germain Eintracht Frankfurt 2-time Ligue 1 winner (2022–23, 2023–24) June 27 Jarrad Branthwaite Everton Blackburn Rovers PSV Eindhoven 2022–23 KNVB Cup winner ====July–December==== Date of Birth Player Nationality Played For Awards July 4 Murillo Corinthians Nottingham Forest July 11 Amad Diallo Atalanta Manchester United Rangers Sunderland 2021–22 Scottish Cup winner 2023–24 FA Cup winner 2-time UEFA Europa League runner-up (2020–21, 2021–22) July 12 Nico Williams Athletic Bilbao 2023–24 Copa del Rey winner UEFA Euro 2024 winner Member of the UEFA Euro 2024 Team of the Tournament Brother of Spanish-Ghanian footballer Iñaki Williams July 17 Enzo Millot AS Monaco VfB Stuttgart 2024 Summer Olympics silver medalist July 19 Fábio Silva FC Porto Wolverhampton Wanderers Anderlecht PSV Eindhoven Rangers Las Palmas 2019–20 Primeira Liga winner 2019–20 Taça de Portugal winner 2022–23 KNVB Cup winner Son of former Portuguese footballer Jorge Silva July 25 Adam Hložek Sparta Prague Bayer Leverkusen TSG Hoffenheim 2019–20 Czech Cup winner 2023–24 Bundesliga winner 2023–24 DFB-Pokal winner July 26 Morgan Rogers West Bromwich Albion Manchester City Blackpool Middlesbrough Aston Villa August 18 Amar Dedić Red Bull Salzburg FC Liefering Wolfsberger AC Olympique Marseille 2022–23 Austrian Football Bundesliga winner August 18 Bart Verbruggen Anderlecht Brighton & Hove Albion August 30 Fábio Carvalho Fulham Liverpool RB Leipzig Brentford 2022 FA Community Shield winner 2023 DFL-Supercup winner September 1 Heorhiy Sudakov Shakhtar Donetsk 2-time Ukrainian Premier League winner (2022–23, 2023–24) September 1 Illya Zabarnyi Dynamo Kyiv Bournemouth 2020–21 Ukrainian Premier League winner 2020–21 Ukrainian Cup winner 2020 Ukrainian Super Cup winner September 2 Bradley Barcola Olympique Lyon Paris Saint-Germain 2023–24 Ligue 1 winner 2023–24 Coupe de France winner 2023 Trophée des Champions winner Brother of French-Togolese footballer Malcolm Barcola September 14 Pape Matar Sarr FC Metz Tottenham Hotspur 2021 Africa Cup of Nations winner October 4 Aster Vranckx Mechelen VfL Wolfsburg AC Milan October 10 James Trafford Manchester City Bolton Wanderers Burnley 2022–23 EFL Trophy winner 2023 UEFA European Under-21 Championship winner October 17 Maximilian Beier TSG Hoffenheim Hannover 96 Borussia Dortmund October 20 Yeremy Pino Villarreal 2020–21 UEFA Europa League winner 2022–23 UEFA Nations League winner October 23 Elkan Baggott Ipswich Town Gillingham Bristol Rovers Blackpool 2020 AFF Championship runner-up October 31 Ansu Fati Barcelona Brighton & Hove Albion 2022–23 La Liga winner 2020–21 Copa del Rey winner 2023 Supercopa de España winner 2022–23 UEFA Nations League winner November 10 Eduardo Camavinga Stade Rennais Real Madrid 2-time La Liga winner (2021–22, 2023–24) 2022–23 Copa del Rey winner 2-time Supercopa de España winner (2022, 2024) 2-time UEFA Champions League winner (2021–22, 2023–24) 2-time UEFA Super Cup winner (2022, 2024) 2022 FIFA Club World Cup winner 2022 FIFA World Cup runner-up November 12 Tino Livramento Southampton Newcastle United November 13 Giovanni Reyna Borussia Dortmund Nottingham Forest 2020–21 DFB-Pokal winner 3-time CONCACAF Nations League winner (2019–20, 2022–23, 2023–24) Son of former American soccer players Claudio and Danielle Reyna November 25 Pedri Las Palmas Barcelona 2022–23 La Liga winner 2020–21 Copa del Rey winner 2023 Supercopa de España winner 2020 Summer Olympics silver medalist UEFA Euro 2024 winner Member of the UEFA Euro 2020 Team of the Tournament 2021 Golden Boy winner November 28 Destiny Udogie Udinese Tottenham Hotspur November 29 Yunus Musah Valencia AC Milan 2021–22 Copa del Rey runner-up 3-time CONCACAF Nations League winner (2019–20, 2022–23, 2023–24) December 14 Francisco Conceição Porto Ajax Juventus 2021–22 Primeira Liga winner 2-time Taça de Portugal winner (2021–22, 2023–24) Son of former Portuguese footballer Sérgio Conceição Brother of Portuguese footballers Sérgio and Rodrigo Conceição December 17 Castello Lukeba Olympique Lyon RB Leipzig 2023 DFL-Supercup winner Silver medalist at the 2024 Summer Olympics ===Deaths=== Date of Death Player Nationality Played For Managed Awards January 2 Rui Campos (79) Bonsucesso Fluminense Bangu São Paulo Palmeiras 4-time Campeonato Paulista winner 1949 South American Championship winner 1950 FIFA World Cup runner-up January 15 Jean Dockx (60) Mechelen Racing White Anderlecht RWD Molenbeek Royal Antwerp Anderlecht 2-time Belgian First Division winner (1971–72, 1973–74) 4-time Belgian Cup winner 2-time European Cup Winners' Cup winner (1975–76, 1977–78) 1976 European Super Cup winner Third place at UEFA Euro 1972 January 19 Vavá (67) Sport Recife Vasco da Gama Atlético Madrid Palmeiras Club América Toros Neza San Diego Toros Portuguesa Córdoba Granada Al-Rayyan 1949 Campeonato Pernambucano winner 3-time Campeonato Carioca winner (1952, 1956, 1958) 1963 Campeonato Paulista winner 1965–66 Mexican Primera División winner 1958 Torneio Rio-São Paulo winner 2-time Copa del Generalísimo winner (1959–60, 1960–61) 1957 Tournoi de Paris winner 2-time FIFA World Cup winner (1958, 1962) 1962 FIFA World Cup top goalscorer February 8 Zizinho (80) Flamengo Bangu São Paulo Audax Italiano Bangu Vasco da Gama 3-time Campeonato Carioca winner (1942, 1943, 1944) 1957 Campeonato Paulista winner 1949 South American Championship winner 4-time South American Championship runner-up (1945, 1946, 1953, 1957) 1950 FIFA World Cup runner-up Gold medalist at the 1975 Pan American Games Joint all-time South American Championship/Copa América top scorer February 13 Ramón Grosso (58) Plus Ultra Atlético Madrid Real Madrid Real Madrid B 7-time La Liga winner 3-time Copa del Generalísimo winner (1969–70, 1973–74, 1974–75) 1965–66 European Cup winner February 14 Nándor Hidegkuti (79) Elektromos FC MTK Hungária MTK Hungária Fiorentina AC Mantova Győri ETO Stal Rzeszów Al Ahly Shabab Al Ahli 4-time Nemzeti Bajnokság I winner 4-time Magyar Kupa winner 5-time Egyptian Premier League winner 1977–78 Egypt Cup winner 1955 Mitropa Cup winner 1960–61 European Cup Winners' Cup winner Gold medalist at the 1952 Summer Olympics 1948–53 Central European International Cup winner 1954 FIFA World Cup runner-up February 16 Sir Walter Winterbottom (88) Manchester United 13-time British Home Championship winner Managed at the 1952 Summer Olympics Member of the English Football Hall of Fame February 19 Arne Selmosson (70) Jönköpings Södra Udinese Lazio AS Roma Skövde AIK 1958 Coppa Italia winner 1960–61 Inter-Cities Fairs Cup winner 1958 FIFA World Cup runner-up February 20 Branko Stanković (80) Slavija Sarajevo BSK Beograd Red Star Belgrade FK Vojvodina AEK Athens FC Porto PAOK Red Star Belgrade Fenerbahçe Beşiktaş 2-time Serbian League winner (1942–43, 1943-44) 7-time Yugoslav First League winner 3-time Yugoslav Cup winner (1948, 1949, 1950) 1970–71 Alpha Ethniki winner 2-time 1.Lig winner (1982–83, 1985–86) 1982–83 Turkish Cup winner Silver medalist at the 1948 and 1952 Summer Olympics March 4 Velibor Vasović (62) Partizan Red Star Belgrade Ajax Partizan Angers Paris Saint-Germain Zamalek Red Star Belgrade 6-time Yugoslav First League winner 3-time Eredivisie winner (1966–67, 1967–68, 1969–70) 3-time KNVB Cup winner (1966–67, 1969–70, 1970–71) 1970–71 European Cup winner March 15 Werner Unger (70) Vorwärts Leipzig BSG Motor Zwickau Vorwärts Berlin 5-time DDR-Oberliga winner Bronze medalist at the 1964 Summer Olympics April 3 Ernst Stojaspal (77) Austria Wien Strasbourg AS Monaco Metz 3-time Staatsliga A winner (1948–49, 1949–50, 1952–53) 2-time Austrian Cup winner (1946–47, 1947–48) Finished third at the 1954 FIFA World Cup 5-time Staatsliga A top goalscorer April 26 Tore Svensson (74) IF Elfsborg Malmö FF 3-time Allsvenskan winner (1949–50, 1950–51, 1952–53) 2-time Svenska Cupen winner (1951, 1953) 1958 FIFA World Cup runner-up Finished third at the 1950 FIFA World Cup Bronze medalist at the 1952 Summer Olympics April 29 Sune Andersson (81) Hagalunds IS AIK AS Roma Kalmar FF IFK Eskilstuna Kalmar FF IFK Eskilstuna 1949 Svenska Cupen winner Gold medalist at the 1948 Summer Olympics Finished 3rd at the 1950 FIFA World Cup May 13 Valeriy Lobanovskyi (63) Dynamo Kyiv Shakhtar Donetsk Dnipro Dnipropetrovsk Dynamo Kyiv 10-time Soviet Top League winner 7-time Soviet Cup winner 5-time Vyshcha Liha winner 3-time Ukrainian Cup winner (1997–98, 1998–99, 1999–2000) 2-time European Cup Winners' Cup winner (1974–75, 1985–86) UEFA Euro 1988 runner-up Bronze medalist at the 1976 Summer Olympics Awarded the FIFA Order of Merit June 17 Fritz Walter (81) Kaiserslautern TSG Diedenhofen TSG Saargemünd SV Alsenborn 2-time German champion (1950–51, 1952–53) 1954 FIFA World Cup winner UEFA German Golden Player Member of the German Sports Hall of Fame July 27 Anatoli Bashashkin (78) DO Tbilisi CDSA Moscow Spartak Moscow FC Pakhtakor Tashkent 5-time Soviet Top League winner 3-time Soviet Cup winner (1948, 1951, 1955) Gold medalist at the 1956 Summer Olympics August 16 John Charles (57) West Ham United 1964–65 European Cup Winners' Cup winner First black player to represent England at any level September 17 Edvaldo Alves de Santa Rosa (68) CSA Flamengo Portuguesa de Desportos Atlético Junior 2-time Campeonato Alagoano (1949, 1952) 4-time Campeonato Carioca winner 1958 FIFA World Cup winner September 18 Mauro Ramos (72) São Paulo Santos Toluca Deportivo Oro Coritiba São Paulo Jalisco 9-time Campeonato Paulista winner 5-time Campeonato Brasileiro Série A winner 1967–68 Mexican Primera División winner 2-time Copa Libertadores winner (1962, 1963) 2-time Intercontinental Cup winner (1962, 1963) 1949 South American Championship winner 2-time FIFA World Cup winner (1958, 1962 FIFA World Cup) September 22 Julio Pérez (76) Racing Montevideo River Plate Montevideo Nacional Internacional Sud América 4-time Uruguayan Primera División winner 1950 FIFA World Cup winner October 10 Erling Sørensen (81) Frem Strasbourg Modena Udinese Triestina Frem 2-time Danish champion (1940–41, 1943–44) Bronze medalist at the 1948 Summer Olympics October 14 Arturo Silvestri (81) Modena AC Milan Livorno Cagliari AC Milan Brescia Genoa 2-time Serie A winner (1950–51, 1954–55) 1966–67 Coppa Italia winner 1951 Latin Cup winner October 24 Hernán Gaviria (32) Atlético Nacional Deportivo Cali Shonan Bellmare Atlético Bucaramanga 3-time Categoría Primera A winner (1991, 1994, 1998) 1995 Copa Interamericana winner 1999 Copa Libertadores runner-up Finished 3rd at the 1993 and 1995 Copa Américas November 9 Eusebio Tejera (80) River Plate Montevideo Nacional Cúcuta Deportivo Defensor Sporting 4-time Uruguayan Primera División winner 1945 Copa Escobar-Gerona winner 1950 FIFA World Cup winner November 13 Juan Alberto Schiaffino (77) Peñarol AC Milan AS Roma Peñarol 3-time Uruguayan Primera División winner (1949, 1951, 1953) 3-time Serie A winner (1954–55, 1956–57, 1958–59) 1956 Latin Cup winner 1960–61 Inter-Cities Fairs Cup winner 1957–58 European Cup runner-up 1950 FIFA World Cup winner December 19 Arthur Rowley (76) West Bromwich Albion Fulham Leicester City Shrewsbury Town Shrewsbury Town Sheffield United Southend United 3-time Football League Second Division winner (1948–49, 1953–54, 1956–57) Member of the Football League 100 Legends Brother of former English international footballer Jack Rowley ==== January ==== * January 2: ** Rui Campos (79), footballer (Bonsucesso, Fluminense, Bangu, São Paulo, Palmeiras, Brazil). ** Charlie Mitten (80), footballer (Manchester United, Independiente Santa Fe, Fulham), player-manager (Mansfield Town), and manager (Newcastle United, Altrincham). Uncle of former English footballer Albert Scanlon. * January 4: ** Georg Ericson (82), footballer (IFK Norrköping) and manager (IFK Norrköping, Sweden). * January 5: ** Bryan Thurlow (65), footballer (Norwich City, Bristol City). * Janaury 14: ** Antonio Sbardella (76), referee (Serie A, FIFA). * January 15: ** Jean Dockx (60), footballer (Mechelen, Racing White, Anderlecht, Belgium) and manager (RWD Molenbeek, Royal Antwerp, Anderlecht). ** Miguel Flores (81), footballer (Club Universidad de Chile, Chile). ** Tomislav Kaloperović (69), footballer (BSK Beograd, Partizan, Padova, Union Saint-Gilloise, NAC, Yugoslavia) and manager (Olimpija Ljubljana, Galatasaray, Bursaspor, Partizan, Fenerbahçe, Radnički Pirot, Napredak Kruševac, Vojvodina, Apollon Smyrnis, AEL Limassol). * January 16: ** John Boulos (80), footballer (Brooklyn Hispano, New York Hakoah). * January 19: ** Jeff Astle (59), footballer (Notts County, West Bromwich Albion, Hellenic FC, Weymouth, England). ** Vavá (67), footballer (Sport Recife, Vasco da Gama, Atlético Madrid, Palmeiras, Club América, San Diego Toros, Portuguesa, Brazil) and manager (Córdoba, Granada, Al-Rayyan). * January 21: ** Zenon Snylyk (68), soccer player (Rochester Ukrainians, Ukrainian Lions, Montreal Ukrainians, New York Ukrainians, Newark Ukrainian Sitch, United States). Played at the 1956 Summer Olympics. * January 23: ** Domingo Drummond (44), footballer (Platense, Honduras). ** Vittorio Mero (27), footballer (Crevalcore, Ravenna, Brescia). ** Gerhard Prokop (62), footballer (Alemannia Aachen, Eupen) and manager (Alemannia Aachen, Westfalia Herne, Holstein Kiel, Apollon Smyrni, PAS Giannina, Aris Thessaloniki, Doxa Drama, Athinaikos, Ionikos, Apollon Kalamarias, Omonia, EN Paralimni). * January 24: ** Andrei Mercea (76), footballer (ITA Arad, CSCA București, UTA Arad, AMEF Arad, Romania). Played at the 1952 Summer Olympics. * January 29: ** Haim Haberfeld (70), trade union leader and chairman of the Israel Football Association (1980–1985, 1992–1993). * January 31: ** Ernest Butler (82), footballer (Portsmouth). ** Gerrie Stroker (85), footballer (Blauw-Wit Amsterdam, Ajax, SpVgg Potsdam, Netherlands) and manager (Koninklijke HFC, DWS Amsterdam, RKSV Volendam). ==== February ==== * February 3: ** Bill Harvey (81–82), footballer (Grimsby Town) and manager (Luton Town, Grimsby Town). * February 4: ** Bert Head (85), footballer (Torquay United, Bury) and manager (Swindon Town, Bury, Crystal Palace). * February 8: ** Duggie Reid (84), footballer (Stockport County, Portsmouth). ** Giannis Pathiakakis (48), footballer (Apollon Athens, PAOK, Panionios Ethnikos Piraeus) and manager (Ethnikos Piraeus, Apollon Athens, Athinaikos, Akratitos, AEK Athens). ** Zizinho (80), footballer (Flamengo, Bangu, São Paulo, Audax Italiano, Brazil) and manager (Bangu, Vasco da Gama, Brazil Olympics). * February 12: ** John Eriksen (44), footballer (Svendborg fB, Odense Boldklub, Roda JC, Mulhouse, Feyenoord, Servette, Luzern, Denmark). ** José Travassos (75), footballer (CUF, Sporting CP, Portugal). * February 13: ** George Bray (83), footballer (Burnley). ** Ramón Grosso (58), footballer (Plus Ultra, Atlético Madrid, Real Madrid, Spain) and manager (Real Madrid B, Real Madrid). * February 14: ** Domènec Balmanya (87), footballer (Girona, Barcelona, Sète, Gimnàstic, Catalan XI) and manager (Gimnàstic, Girona, Real Zaragoza, Real Oviedo, Barcelona, Sète, Valencia, Real Betis, Málaga, Atlético Madrid, Spain, Cádiz, Sant Andreu). ** Nándor Hidegkuti (79), footballer (Elektromos FC, MTK Hungária, Hungary) and manager (MTK Hungária, Fiorentina, AC Mantova, Győri ETO, Stal Rzeszów, Al Ahly, Shabab Al Ahli). Gold medalist at the 1952 Summer Olympics. * February 16: ** Sir Walter Winterbottom (88), footballer (Manchester United) and manager (England, Great Britain). Managed at the 1952 Summer Olympics. * February 19: ** Arne Selmosson (70), footballer (Jönköpings Södra, Udinese, Lazio, AS Roma, Skövde AIK, Sweden). * February 20: ** Dennis Kelleher (83), footballer (Barnet). Played at the 1948 Summer Olympics. ** Branko Stanković (80), footballer (Slavija Sarajevo, BSK Beograd, Red Star Belgrade, Yugoslavia) and manager (FK Vojvodina, AEK Athens, FC Porto, PAOK, Red Star Belgrade, Fenerbahçe, Beşiktaş). Silver medalist at the 1948 and 1952 Summer Olympics * February 22: ** Paddy Ambrose (73), footballer (Shamrock Rovers, Republic of Ireland, League of Ireland XI). * February 23: ** Franz Elbern (91), footballer (SV Beuel 06, Germany). Played at the 1936 Summer Olympics. * February 27: ** Georges Beaucourt (89), footballer (Olympique Lillois, Lens, France) and manager (RC Lens). ==== March ==== * March 2: ** Jason Mayélé (26), footballer (Châteauroux, Cagliari, ChievoVerona, DR Congo). * March 4: ** Velibor Vasović (62), footballer (Partizan, Red Star Belgrade, Ajax, Yugoslavia) and manager (Partizan, Angers, Paris Saint-Germain, Zamalek, Red Star Belgrade). * March 7: ** Daaf Drok (87), footballer (RFC Rotterdam, Sparta Rotterdam, Netherlands) and manager (SC Emma). * March 8: ** Ellert Sölvason (84), footballer (Valur, Iceland). * March 10: ** George Mungwa, manager (Zambia). * March 13: ** Ivano Blason (78), footballer (Triestina, Inter Milan, Hellas Verona, Padova, Italy). * March 15: ** Werner Unger (70), footballer (Vorwärts Leipzig, BSG Motor Zwickau, FC Vorwärts Berlin, East Germany). Bronze medalist at the 1964 Summer Olympics. ** Jairo Zulbarán (32), footballer (Unión Magdalena, Independiente Medellín, Millonarios, Deportivo Unicosta). * March 16: ** Ernst-August Künnecke (64), footballer (Hannover 96, VfV Hildesheim, Arminia Hannover) and manager (Patro Eisden, KRC Mechelen, KFC Winterslag, Lierse, Basel, KV Mechelen, Genk, SC Brühl). * March 17: ** Vasil Mitkov (58), footballer (Spartak Sofia, Levski Sofia, Bulgaria). * March 20: ** Aleksei Yeskov (55), footballer (Terek Grozny, SKA Rostov-on-Don, Torpedo Moscow, Soviet Union), assistant manager (SKA Rostov-on-Don), and manager (Terek Grozny, SKA Rostov-on-Don). * March 21: ** Nikos Pangalos (87), manager (PAOK, Doxa Drama, Panserraikos). * March 22: ** Jaroslav Cejp (77), footballer (Pardubice, Sparta Prague, Czechoslovakia). * March 25: ** Kenneth Wolstenholme (81), RAF pilot and football commentator. * March 26: ** Gerald Hylkema (56), footballer (Groningen, Atlante, San Antonio Thunder). ** Eugen Meier (71), footballer (FC Schaffhausen, BSC Young Boys, FC Bern, Switzerland). * March 30: ** Bjørn Spydevold (83), footballer (Fredrikstad FK, Norway). Played at the 1952 Summer Olympics. Father of former Norweigan international footballer Thor Spydevold. ** Alfie Stokes (69), footballer (Tottenham Hotspur, Fulham, Watford, St. George-Budapest ==== April ==== * April 2: ** Ike Clarke (87), footballer (West Bromwich Albion, Portsmouth), player-manager (Yeovil Town), and manager (Sittingbourne). ** Shigeo Sugimoto (75), footballer (Hankyu Railways, Japan). * April 3: ** Ernst Stojaspal (77), footballer (Austria Wien, Strasbourg, AS Monaco, Metz, Austria). * April 6: ** Oliver Eggimann (83), footballer (BSC Young Boys, Lausanne-Sport, Servette, La Chaux-de-Fonds, Switzerland). * April 8: ** Francisco Zamora (62), footballer (Deportivo Marquense, Municipal, Alianza, El Salvador) and manager (Platense, Vendaval, Alianza). * April 9: ** Roy Dwight (69), footballer (Fulham, Nottingham Forest, Coventry City, Millwall). Cousin of English singer, songwriter, and pianist Sir Elton John. * April 12: ** Gabriel Raksi (63), footballer (Industria Sârmei Câmpia Turzii, Steaua București, ASA Târgu Mureş, Progresul București, Romania). * April 16: ** Billy Ayre (49), footballer (Scarborough, Hartlepool United, Halifax Town, Mansfield Town) and manager (Mansfield Town, Halifax Town, Blackpool, Scarborough, Southport, Cardiff City). * April 18: ** Mitsos Dimitriou (54), footballer (Panathinaikos, Greece). * April 19: ** Jean-Pierre Destrumelle (61), footballer (Rouen, Olympique Marseille, Paris Saint-Germain, France amateurs) and manager (Valenciennes, Bastia, Olympique Lyon, Béziers, Gien, Orléans, Ajaccio). * April 23: ** Tibor Simon (36), footballer (Ferencváros, Hungary) and manager (FC Sopron). * April 26: ** Tore Svensson (74), footballer (IF Elfsborg, Malmö FF, Sweden). Bronze medalist at the 1952 Summer Olympics. * April 29: ** Sune Andersson (81), footballer (Hagalunds IS, AIK, AS Roma, Kalmar FF, IFK Eskilstuna, Sweden) and manager (Kalmar FF, IFK Eskilstuna). Gold medalist at the 1948 Summer Olympics. ** Stan Lynn (73), footballer (Accrington Stanley, Aston Villa, Birmingham City). ==== May ==== * May 13: ** Valeriy Lobanovskyi (63), footballer (Dynamo Kyiv, Shakhtar Donetsk, Soviet Union) and manager (Dnipro Dnipropetrovsk, Dynamo Kyiv, Soviet Union, United Arab Emirates, Kuwait, Ukraine). Bronze medalist at the 1976 Summer Olympics. * May 20: ** Renzo Barbera (82), businessman and chairman (Palermo). * May 21: ** Roy Paul (82), footballer (Swansea Town, Manchester City, Worcester City) and manager (Worcester City). * May 29: ** Stan Bentham (87), footballer (Wigan Athletic, Everton). * May 30: ** Sándor Mátrai (69), footballer (Ferencvaros, Hungary). ==== June ==== * June 17: ** Fritz Walter (81), footballer (Kaiserslautern, TSG Diedenhofen, TSG Saargemünd, Germany, West Germany) and manager (SV Alsenborn). Member of the German Sports Hall of Fame. ==== July ==== * July 7: ** Ray Wood (71), footballer (Manchester United, Huddersfield Town, Bradford City, Barnsley, England) and manager (Los Angeles Wolves, Cyprus, APOEL, Kenya). Survivor of the Munich air disaster. * July 20: ** Michalis Kritikopoulos (56), footballer (Panegialios, Ethnikos Piraeus, Olympiacos, Greece) and manager (Panegialios). * July 22: ** Giuseppe Corradi (70), footballer (Modena, Juventus, Genoa, Mantova, Italy) and manager (Pisa, Lecce, Spezia Calcio). Played at the 1952 Summer Olympics. * July 23: ** Hermann Lindemann (91), footballer (FSV Frankfurt, VfB Leipzig, Kickers Offenbach, Eintracht Frankfurt) and manager (Fram, FSV Frankfurt, Alemannia Aachen, Meidericher SV, Fortuna Düsseldorf, Eintracht Braunschweig, VfL Bochum, Eintracht Duisburg, Young Fellows Zurich, Waldhof Mannheim, Borussia Dortmund). * July 25: ** Hans Dorjee (60), footballer (DHC, Xerxes, Holland Sport), assistant manager (PSV Eindhoven, Netherlands), and manager (NAC Breda, Excelsior, Vitesse, Feyenoord, AA Gent, Netherlands U21). * July 27: ** Anatoli Bashashkin (78), footballer (DO Tbilisi, CDSA Moscow, Spartak Moscow, Soviet Union), assistant manager (Spartak Moscow), and manager (FC Pakhtakor Tashkent). Gold medalist at the 1956 Summer Olympics. ==== August ==== * August 4: ** Millard Lang (89), soccer player (Baltimore Canton, Chicago Sparta, Chicago Eagles, Baltimore Americans), manager (Baltimore Americans), and lacrosse player. Member of the National Soccer Hall of Fame and National Lacrosse Hall of Fame. * August 8: ** Reiner Geye (52), footballer (Fortuna Düsseldorf, 1. FC Kaiserslautern, West Germany). * August 16: ** John Charles (57), footballer (West Ham United, England U18). First black player to represent England at any level. ==== September ==== * September 17: ** Edvaldo Alves de Santa Rosa (68), footballer (CSA, Flamengo, Portuguesa de Desportos, Atlético Junior, Brazil). * September 18: ** Mauro Ramos (72), footballer (São Paulo, Santos, Toluca, Brazil) and manager (Deportivo Oro, Coritiba, São Paulo, Jalisco). * September 22: ** Julio Pérez (76), footballer (Racing Montevideo, River Plate Montevideo, Nacional, Internacional, Sud América, Uruguay). ==== October ==== * October 10: ** Erling Sørensen (81), footballer (Frem, Strasbourg, Modena, Udinese, Triestina, Denmark) and manager (Frem). Bronze medalist at the 1948 Summer Olympics. * October 11: ** Ron Gray (82), footballer (Sheffield United, Notts County, Watford), manager (Watford, Millwall, Lincoln City), and scout (Ipswich Town). * October 14: ** Arturo Silvestri (81), footballer (Fiorentina, Modena, AC Milan, Italy) and manager (Livorno, Cagliari, AC Milan, Brescia, Genoa). * October 24: ** Hernán Gaviria (32), footballer (Atlético Nacional, Deportivo Cali, Shonan Bellmare, Atlético Bucaramanga, Colombia). ==== November ==== * November 1: ** Léster Morgan (26), footballer (Guanacasteca, Herediano, Venados de Yucatán, Costa Rica). * November 6: ** Gianluca Signorini (42), footballer (Pisa, Livorno, Ternana, Cavese, Parma, AS Roma, Genoa) and manager (Pisa). * November 9: ** Eusebio Tejera (80), footballer (River Plate Montevideo, Nacional, Cúcuta Deportivo, Defensor Sporting, Uruguay). * November 12: ** Raoul Diagne (91), footballer (RC Paris, Toulouse, FC Annecy, France) and manager (Senegal) * November 13: ** Juan Alberto Schiaffino (77), footballer (Peñarol, AC Milan, AS Roma, Uruguay, Italy) and manager (Uruguay, Peñarol). * November 18: ** Pasquale Vivolo (74), footballer (Cremonese, Juventus, Lazio, Italy). Played at the 1952 Summer Olympics. * November 30: ** Alan Ashman (74), footballer (Sheffield United, Nottingham Forest, Carlisle United) and manager (Carlisle United, West Bromwich Albion, Olympiacos, Workington, Walsall). ==== December ==== * December 5: ** Geoff Coombes (83), soccer player. Member of the National Soccer Hall of Fame. * December 19: ** Arthur Rowley (76), footballer (West Bromwich Albion, Fulham, Leicester City), player-manager (Shrewsbury Town), manager (Shrewsbury Town, Sheffield United, Southend United), and cricketer. Brother of former English international footballer Jack Rowley. * December 21: ** Jeu van Bun (84), footballer (MVV, Netherlands). Played at the 1948 Summer Olympics. * December 28: ** Albert Stubbins (83), footballer (Newcastle United, Liverpool). * December 31: ** Billy Morris (84), footballer (Burnley, Wales) and manager (Wrexham). ==References==",
 "title": "2002 in association football"
}