{
 "id": "806975",
 "text": "William Ballard Hurd (born August 19, 1977) is an American politician. He was the U.S. representative for Texas's 23rd congressional district from 2015 to 2021. Before becoming a congressman, Hurd was a CIA agent. During his congressional career, he was known for his cybersecurity knowledge and from 2019 until 2021, he was the only African-American Republican in the House of Representatives. In June 2023, Hurd announced his candidacy for President of the United States in the 2024 election. Four months later, he dropped out of the race on October 9, 2023. ==Early life== Hurd was born in San Antonio, Texas. He is the son of Mary Alice Hurd and Robert Hurd. His father is black and his mother is white. Hurd studied at Texas A&M; University, where he was elected student body president. He majored in computer science and minored in international relations. == Intelligence career == Hurd worked for the Central Intelligence Agency (CIA) for nine years, from 2000 to 2009. He worked in Washington, D.C., but he was also an operations officer in Afghanistan, Pakistan, and India. One of his roles at the CIA was briefing members of Congress, which is why Hurd ran for Congress. ==Political career== Hurd ran for the United States House of Representatives in 2010, but he lost the election. He ran again in 2014, this time winning the election. Even though Republican presidential nominee Mitt Romney had won the district two years earlier, Hurd winning was seen as an upset. Hurd conducted a post-election swing through some parts of his district that had heavily supported Gallego. Hurd was the vice-chair of the Border and Maritime Subcommittee of the Homeland Security Committee. He was seen as a top expert on technological and cybersecurity-related issues while serving in Congress. In 2016, while running for re-election, Hurd became a strong-critic of then-Republican presidential nominee Donald Trump. He was re-elected by a little over 1% of the vote. In July 2018, his re-election campaign was seen as \"the most expensive congressional race in the Texas's history\". The race was the closest House race in Texas and one of the closest in the country. Hurd was declared the official winner on November 19 by a margin of 926 votes. Hurd decided not to run again in 2020. During his time in congress, Hurd was seen as a moderate and voted with Democrats on some issues. ===2024 presidential campaign=== On June 22, 2023, Hurd announced that he would be a candidate in the 2024 presidential election. He dropped out of the race on October 9, 2023, and endorsed Nikki Haley. ==Personal life== After leaving Congress, Hurd became a Winter 2021 Resident Fellow at the Institute of Politics of the University of Chicago. In May 2021, Hurd was appointed to the board of directors for OpenAI. Hurd married Lynlie Wallace, a former congressional chief of staff to another Texas congressman, on December 31, 2022. ==References== Category:1977 births Category:Living people Category:United States representatives from Texas Category:Republican Party (United States) politicians Category:African- American politicians Category:2024 United States presidential candidates Category:Politicians from San Antonio, Texas",
 "title": "Will Hurd"
}