{
 "id": "807059",
 "text": "Hylarana is a genus of true frogs. They are also called golden-backed frogs. They live in tropical Asia. Scientists used to put 84 to 96 valid species in Hylarana, but they looked at the frogs again. Today, scientists say four species are in Hylarana. ==What they look like== Hylarana frogs can be small or large. Male frogs are from their noses to the ends of their bodies, and females are . The nostrils are oval in shape and there is a piece of skin on top of them. The ear drum is not covered by skin. They have vomerine teeth and a parietal eye. The toes on their back feet are webbed, but the fingers on the front feet are not. ==Where they live== The frogs that scientists used to say were in Hylarana lived everywhere from Sri Lanka to the Western Ghat Mountains in India, through Nepal and southern China and Taiwan, south to Southeast Asia to the Philippines and Papua New Guinea, in Northern Australia, and tropical Africa. The four species of frogs that are still in Hylarana today live in southern and southeast Asia. ==Scientific groups== Hylarana is in the subfamily Raninae. They are true frogs, so they are in the family Ranidae. The name Hylarana comes from from the New Latin word hyle (\"wood\" or \"forest\") and rana (\"frog\"). Scientists used to think Hylarana was a subgenus of the genus Rana, but they changed their minds in 2005. In 2006, scientists took Hylarana and split it into more genera. They treat these as junior synonyms of Hylarana. In 2015, Oliver et al. looked closely at Hylarana again. They said that only four species are really Hylarana sensu stricto: The other frogs were moved to Abavorana, Amnirana, Chalcorana, Humerana, Hydrophylax, Indosylvirana, Papurana, Pulchrana, and Sylvirana. ===Species=== Scientists used to say this genus had 84 to 96 valid species of frogs in it. But they looked closely again. Now, scientists say only four frogs are truly Hylarana: Hylarana malayana was placed in Hylarana in 2021. *Hylarana erythraea (Schlegel, 1837) \\- common green frog, green paddy frog, leaf frog, or red- eared frog *Hylarana macrodactyla (Günther, 1858) \\- Guangdong frog, three- striped grass frog, or marbled slender frog *Hylarana malayana (Sheridan and Stuart, 2018) *Hylarana taipehensis (Van Denburgh, 1909) \\- two-striped grass frog *Hylarana tytleri Theobald, 1868 After these changes, scientists are not sure where a few Hylarana species should be placed: *\"Hylarana\" attigua (Inger, Orlov, and Darevsky, 1999) *\"Hylarana\" celebensis (Peters, 1872) *\"Hylarana\" chitwanensis (Das, 1998) *\"Hylarana\" garoensis (Boulenger, 1920) *\"Hylarana\" lateralis (Boulenger, 1887) *\"Hylarana\" latouchii (Boulenger, 1899) *\"Hylarana\" margariana Anderson, 1879 *\"Hylarana\" montivaga (Smith, 1921) *\"Hylarana\" persimilis (Van Kampen, 1923) ==Related pages== *Rana ==References== Category:Frogs of Asia",
 "title": "Hylarana"
}