{
 "id": "807475",
 "text": "Anatomical terms of location have been developed. They help describe the anatomy of animals (including humans). They describe standard positions on an animal. They use Latin and Greek words. ==Introduction== Standard terms let all biological and medical scientists, veterinarians, doctors and anatomists to communicate information about animal bodies and their organs. Much of this information has been standardised in internationally agreed vocabularies for humans (Gray's Anatomy) and animals For humans, and other animals which stand on two feet (bipeds), terms used are different from animals which stand on four (quadrupeds). Humans are described in the standard anatomical position, which is standing up with arms outstretched.Gray's Anatomy 2016, pxvi-xvii. So, what is on \"top\" of a human is the head, whereas the \"top\" of a dog may be its back, and the \"top\" of a flounder could refer to either its left or its right side. Unique terms are used to describe animals without a backbone (invertebrates), because of their wide variety of shapes and symmetry. == Main terms == ===Superior and inferior=== Superior means above; inferior means below. In humans it means the head and feet. In animals it means the back and the underneath. ===Anterior and posterior=== Anterior means the front; posterior means the back. ===Medial and lateral=== Medial means the midline; lateral means the sides. The terms \"left\" and \"right\" are sometimes used, or their Latin alternatives dexter (right) and sinister (left). ===Proximal and distal=== The terms proximal and distal are used to describe parts of a feature that are close to, or distant from, the main mass of the body. Thus the upper arm in humans is proximal and the hand is distal. \"Proximal and distal\" are frequently used when describing appendages, such as fins, tentacles, and limbs. This terminology is also employed in molecular biology and therefore referring to the atomic position of molecules in a given compound. ===Central and peripheral === Central and peripheral refer to the distance towards and away from the centre of something. Central describes something close to the centre. For example, the great vessels run centrally through the body; many smaller vessels branch from these. Peripheral describes something further away from the centre of something. For example, the arm is peripheral to the body. === Superficial and deep === Deep describes something further away from the surface of the organism. Superficial describes something near the outer surface of the organism. For example, in skin, the epidermis is superficial to the subcutis. ===Dorsal and ventral=== These two terms, used in anatomy and embryology, describe something at the back (dorsal) or front/belly (ventral) of an organism. The dorsal surface of an organism refers to the back, or upper side, of an organism. If talking about the skull, the dorsal side is the top. The ventral surface refers to the front, or lower side, of an organism. For example, in a fish, the pectoral fins are dorsal to the anal fin, but ventral to the dorsal fin. ===Cranial and caudal=== Specific terms exist to describe how close or far something is to the head or tail of an animal. To describe how close to the head of an animal something is, three distinct terms are used: * Rostral describes something toward the oral or nasal region, or in the case of the brain, toward the tip of the frontal lobe. * Cranial or cephalic describes how close something is to the head of an organism. * Caudal describes how close something is to the trailing end of an organism. For example, in horses, the eyes are caudal to the nose and rostral to the back of the head. These terms are generally preferred in veterinary medicine and not used as often in human medicine. In humans, \"cranial\" and \"cephalic\" are used to refer to the skull, with \"cranial\" being used more commonly. The term \"rostral\" is rarely used in human anatomy, apart from embryology, and refers more to the front of the face than the superior aspect of the organism. Similarly, the term \"caudal\" is used more in embryology and only occasionally used in human anatomy. This is because the brain is at the superior part of the head whereas the nose is in the anterior part. Thus, the \"rostrocaudal axis\" refers to a C shape (see image above). == References == Category:Human body features Category:Animal anatomy",
 "title": "Anatomical terms of location"
}