{
 "id": "80807",
 "text": "Fiberglass (also called fibreglass and glass fibre) is material made from extremely fine fibers of glass. Fibreglass is cheaper and more flexible than carbon fibre. It is stronger than many metals (when compared by weight), and can be moulded into complex shapes. The plastic matrix is usually a thermoset polymer – such as epoxy or polyester resin, or it may be a thermoplastic.Mayer, Rayner M. 1993. Design with reinforced plastics. Springer. It is used as a reinforcing material for many polymer products. The composite material, that is produced by this method is called \"fiberglass\" in popular usage. The proper names are fiber-reinforced polymer (FRP) or glass- reinforced plastic (GRP). Glassmakers throughout history have experimented with glass fibers, but mass manufacture of fiberglass was only made possible when finer tools for machines were produced. The first major use was in \"glass wool\" for insulation, starting in the 1930s. Glass fiber is formed when silica-based or other formulation glass is extruded into many fibers with small diameters that are suitable for textile processing. Glass is unlike other polymers because, even as a fiber, it has little crystalline structure (see amorphous solid). The properties of the structure of glass in its soft stage are very much like its properties when spun into fiber. == Uses == Fiberglass is used in sail planes, sport cars, and wind turbine blades. It is also used in buildings where a lightweight material is needed. It is used to protect RF antennas and electric circuits. == Safety == Bare fiberglass can cause skin irritation and cuts when handled without gloves. There have been concerns that fiberglass can be accidentally inhaled into the lungs, where it might cause cancer and other lung problems, similar to asbestos. Fiberglass has been called \"man-made asbestos\". Substitutes for fiberglass building insulation, such as cellulose and aerogel, have started to appear. ==Related pages== *Optical fiber == References == ==Other websites== *https://www.facebook.com/OEMfibreglass/ *OEM Fibreglass *Owens-Corning *Fiberglass and health *UC Davis PDF on Fiberglass Health Effects *FULLTECH Fiber Glass Corp. *SORG GmbH & Co KG *National Institute for Occupational Safety and Health - Fibrous Glass Page Category:Fibers Category:Glass Category:Insulation",
 "title": "Fiberglass"
}