{
 "id": "808144",
 "text": "In ethology, territory is the place or area that an animal or group of animals will fight other animals to keep. Sometimes they fight animals in their same species and sometimes they fight other animals. Animals that defend territories in this way are referred to as territorial. Davies, N.B. 1978. Territorial defense in the speckled wood butterfly (Pararge aegeria): The resident always wins. Animal Behaviour. 26: 138–147. Most animals are not territorial. Most of the time, a group of animals has an area that they use but do not necessarily defend or fight over. This is called their home range. The home ranges of different groups of animals often overlap, and in the overlap areas, the groups tend to avoid each other. An animal might want territory because it is a good place to find food, a good place to find mates, or a good place to raise young. For example, male frogs sometimes fight each other for good places to call to female frogs. These places could be near food or could be near good places where the females would want to lay eggs. Some animals are territorial all year. Other animals are only territorial sometimes. For example, male elephant seals fight each other for good stretches of beach where they can mate with females. Animals do not always fight to make other animals go away. Sometimes, they only tell the other animal that they can fight. The territorial animal might make a noise, dange, or wave its body parts around to show that it is big and strong and would win a fight. They do this to make the other animal give up and go away. Other times, animals put chemicals in the air or on things in their territory. Big cats scratch trees to get scent from their front feet on the bark. Dogs and cats put urine. Hyenas put chemicals from their anal glands on sticks and bushes. Many animals make sounds to advertise their territory. These are short-term signals given only when the animal is present. The sound can travel long distances and through various habitats. Examples include birds,Richison, Gary n.d. Ornithology: territoriality & coloniality. frogs and canids. == References == Category:Ethology",
 "title": "Territory (animal)"
}