{
 "id": "80822",
 "text": "Solids substances mostlySome substances have a negative expansion coefficient, and will expand when cooled (e.g. freezing water expand in response to heating and contract on cooling.The reason is that during heat transfer, the energy that is stored in the intermolecular bonds between atoms changes. When the stored energy increases, so does the length of the molecular bond. This response to temperature change is expressed as its coefficient of thermal expansion. The coefficient of thermal expansion is used: *in linear thermal expansion *in area thermal expansion *in volumetric thermal expansion These characteristics are closely related. The volumetric thermal expansion coefficient can be measured for all substances of condensed matter (liquids and solid state). The linear thermal expansion can only be measured in the solid state and is common in engineering applications. ==Thermal expansion coefficients for some common materials== The expansion and contraction of material must be considered when designing large structures, when using tape or chain to measure distances for land surveys, when designing molds for casting hot material, and in other engineering applications when large changes in dimension due to temperature are expected. The range for α is from 10-7 for hard solids to 10-3 for organic liquids. α varies with the temperature and some materials have a very high variation. Some values for common materials, given in parts per million per Celsius degree: (NOTE: This can also be in kelvins as the changes in temperature are a 1:1 ratio) coefficient of linear thermal expansion α coefficient of linear thermal expansion α material α in 10-6/K at 20 °C Mercury 60 BCB 42 Lead 29 Aluminum 23 Brass 19 Stainless steel 17.3 Copper 17 Gold 14 Nickel 13 Concrete 12 Iron or Steel 11.1 Carbon steel 10.8 Platinum 9 Glass 8.5 GaAs 5.8 Indium Phosphide 4.6 Tungsten 4.5 Glass, Pyrex 3.3 Silicon 3 Invar 1.2 Diamond 1 Quartz, fused 0.59 ==Applications== For applications using the thermal expansion property, see bi-metal and mercury thermometer Thermal expansion is also used in mechanical applications to fit parts over one another, e.g. a bushing can be fitted over a shaft by making its inner diameter slightly smaller than the diameter of the shaft, then heating it until it fits over the shaft, and allowing it to cool after it has been pushed over the shaft, thus achieving a 'shrink fit' There exist some alloys with a very small CTE, used in applications that demand very small changes in physical dimension over a range of temperatures. One of these is Invar 36, with a coefficient in the 0.6x10-6 range. These alloys are useful in aerospace applications where wide temperature swings may occur. ==Other websites== *MatWeb: Free database of engineering properties for over 64,000 materials *Clemson University Physics Lab: Linear Thermal Expansion *USA NIST Website - Temperature and Dimensional Measurement workshop *Hyperphysics: Thermal expansion ==References== Category:Heat Category:Physical quantity",
 "title": "Coefficient of thermal expansion"
}