{
 "id": "808301",
 "text": "The manosphere is a loose group of blogs and forums reportedly promoting misogyny, masculinity and antifeminism. * * * * * * ==Overview== Groups related to the manosphere include men's rights activists (MRA), Men Going Their Own Way (MGTOW), and pick-up artists (PUA). Support for these ideas is referred to as \"taking the red pill\", a metaphor derived from the 1999 film The Matrix. Those being considered part of the manosphere are often accused of \"violent sexism\" on the basis of having a \"sense of entitlement to sex\". However, some research found that their purported \"violent sexism\" was exaggerated by women over different reasons. Some women also made false accusations of rape over interpersonal conflict to take revenge on others, * * Goodyear-Smith, Felicity: \"Why and how false allegations of abuse occur: An overview,\" 2016, in R. Burnett (Ed.), Wrongful allegations of sexual and child abuse (pp. 99–117). Oxford University Press. https://doi.org/10.1093/acprof:oso/9780198723301.003.0008, posted by American Psychological Assn. (APA) on APA PsychNet, at , retrieved October 23, 2024 * * * though the rate of occurrence is low. ==Causes== Steve McCullough of the Canadian Museum for Human Rights claimed that these social factors correlated with the rise of the manosphere: * High rates of loneliness, depression and suicide among men * Drop in traditionally \"manly\" jobs from changes in global economy * Gains in gender equality that came with changes in traditional gender roles In McCullough's view, the manosphere \"blames them all on women\". McCullough also cited historian Michael Kimmel's theories to claim that manosphere's participants are motivated by \"aggrieved entitlement\",Michael Kimmel. Angry White Men: American Masculinity at the End of an Era. New York: Nation Books, 2013. where \"people with power and privilege see improvements in equality and inclusiveness as a loss of status and thus a personal attack on themselves\", referring to men \"still enjoying unequal power and privilege around the world\". However, he did not elaborate his claim in detail. ==Reception== Groups associated with the incel or MGTOW movement are often criticized by the leftists due to their disagreement with these groups' opposition to certain progressive values. However, many believe that those criticizing the incel or MGTOW movement ignore the cause and effect of their existence. Some critics see those criticism as \"alarmist, inaccurate, and misrepresenting\" the problem. Mass media have also been criticized for their coverage of these groups, some of which directly compare the problem to Islamic terrorism regardless of context. ===Media=== In January 2023, The Times claimed that half of the persons referred to the Prevent, a British counter-extremism programme, were incels in the year ending March 2021. However, critics pointed out that there was no evidence to support such a claim. ===Government=== ====United Kingdom==== The public data from the UK Home Office showed that only 22~25% of those referred to the Prevent were classified as having \"mixed, unstable or unclear ideology\" (MUU) – a category for anything other than right-wing or Islamist extremism. Among the small percentage of the referred, a small number of them were seen as potential terrorists, with some referrals dropped by specialists as they did not know the definition of incel. ===Academia=== Some scholars emphasized that most incels were lonely, depressed young men, many of whom were neurodivergent, of diverse ages, religions, ethnicities and sexual orientations. The social stigma is said to be refutable but repeatedly promoted by self-declared experts against the \"lonely, depressed young men\". The self-declared experts were also criticized for misusing dubious statistics (e.g. cherry-picking) to support their bias. ==References== Category:Men Category:Subculture Category:Internet memes Category:Works about sexuality",
 "title": "Manosphere"
}