{
 "id": "80854",
 "text": "A period in the periodic table is any horizontal row of elements. Each elements in the same period has one more proton than the one to its left. This means its atomic number is one number higher. The elements in the same period are very metallic on the left and nonmetallic on the right. The smaller atoms are on the left and the larger ones are on the right because the atoms have more protons and electrons. The first period has 2 elements, hydrogen and helium. The second period and third period each have 8 elements. The fourth period and fifth period each have 18 elements. The sixth period and seventh period each have 32 elements. F-block elements are counted in the sixth and seventh periods. Hence, each one has 32 elements in it. == Standard periodic table == Group → 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 Period ↓ 1 1 H 2 He 2 3 Li 4 Be 5 B 6 C 7 N 8 O 9 F 10 Ne 3 11 Na 12 Mg 13 Al 14 Si 15 P 16 S 17 Cl 18 Ar 4 19 K 20 Ca 21 Sc 22 Ti 23 V 24 Cr 25 Mn 26 Fe 27 Co 28 Ni 29 Cu 30 Zn 31 Ga 32 Ge 33 As 34 Se 35 Br 36 Kr 5 37 Rb 38 Sr 39 Y 40 Zr 41 Nb 42 Mo 43 Tc 44 Ru 45 Rh 46 Pd 47 Ag 48 Cd 49 In 50 Sn 51 Sb 52 Te 53 I 54 Xe 6 55 Cs 56 Ba * Lanthanides 72 Hf 73 Ta 74 W 75 Re 76 Os 77 Ir 78 Pt 79 Au 80 Hg 81 Tl 82 Pb 83 Bi 84 Po 85 At 86 Rn 7 87 Fr 88 Ra ** Actinides 104 Rf 105 Db 106 Sg 107 Bh 108 Hs 109 Mt 110 Ds 111 Rg 112 Cn 113 Nh 114 Fl 115 Mc 116 Lv 117 Ts 118 Og 8 119 Uue 120 Ubn *** Superactinides 158 Upo 159 Upe 160 Uhn 161 Uhu 162 Uhb 163 Uht 164 Uhq 165 Uhp 166 Uhh 167 Uhs 168 Uho 169 Uhe 170 Usn 171 Usu 172 Usb 9 173 Ust 174 Usq **** Eka-superactinides 212 Bub 213 But 214 Buq 215 Bup 216 Buh 217 Bus 10 227 Bbs 228 Bbo * Lanthanide Series 57 La 58 Ce 59 Pr 60 Nd 61 Pm 62 Sm 63 Eu 64 Gd 65 Tb 66 Dy 67 Ho 68 Er 69 Tm 70 Yb 71 Lu ** Actinide Series 89 Ac 90 Th 91 Pa 92 U 93 Np 94 Pu 95 Am 96 Cm 97 Bk 98 Cf 99 Es 100 Fm 101 Md 102 No 103 Lr *** Superactinide Series 143 Uqt 144 Uqq 145 Uqp 146 Uqh 147 Uqs 148 Uqo 149 Uqe 150 Upn 151 Upu 152 Upb 153 Upt 154 Upq 155 Upp 156 Uph 157 Ups *** Superactinide Series 121 Ubu 122 Ubb 123 Ubt 124 Ubq 125 Ubp 126 Ubh 127 Ubs 128 Ubo 129 Ube 130 Utn 131 Utu 132 Utb 133 Utt 134 Utq 135 Utp 136 Uth 137 Uts 138 Uto 139 Ute 140 Uqn 141 Uqu 142 Uqb ;Chemical Series of the Periodic Table * Alkali metals * Alkaline earths * Lanthanides * Actinides * Superactinides * Eka-superactinides * Transition metals * Poor metals * Metalloids/Semi metals/Half metals * Nonmetals * Halogens * Noble gases ;State at standard temperature and pressure. The color of the number (atomic number) above the element symbol shows the state of the element at normal conditions. * those in blue are gases * those in green are liquids * those in black are solid ;Radioactivity * Those with solid borders have stable isotopes (Primordial elements) * Those with dashed borders have only radioactive naturally occurring isotopes * Those with dotted borders do not occur naturally (Synthetic Elements) * those without borders are too radioactive to have been discovered yet. Category:Periodic table Category:Physics",
 "title": "Period (periodic table)"
}