{
 "id": "808628",
 "text": "The Dark Ages Radio Explorer (DARE) mission is a lunar orbiter concept which will be used to identify the coming redshift from first hydrogen atoms just as the first stars began to produce light. DARE will use the redshifted 21-cm transition line from neutral hydrogen (1420.00 MHz emissions) to view and spot the formation of the first glowing objects of the universe. Also, this is the period ending of the Dark Ages of the universe. The orbiter will explore the universe as it was from around 80 million years to 420 million years after the Big Bang. The mission will deliver data of the formation of the first stars, the beginning of black hole accretions, and the reionization of the universe. Computer models of galaxy formation will also be tested. Burns, Jack O., J. Lazio, J. Bowman, R. Bradley, C. Carilli, S. Furlanetto, G. Harker, A. Loeb, and J. Pritchard. \"The Dark Ages Radio Explorer (DARE).\" in the Bulletin of the American Astronomical Society, vol. 43, p. 10709. 2011. This mission might also add research on dark matter decay. The DARE program will also provide information for developing and deploying lunar surface telescopes that add to exoplanet exploration of nearby stars. It is expected to launch in either 2021 or 2022. == Background == The period after recombination occurred but before stars and galaxies was created is called the \"dark ages\". During this time, most of the matter in the universe is neutral hydrogen. This hydrogen has yet to be observed, but there are experiments underway to detect the hydrogen line produced during this era. The hydrogen line is produced when an electron in a neutral hydrogen atom is excited to a state where the electron and proton have aligned spins, or de-excited as the electron and proton spins go from being aligned to anti-aligned. The energy difference between these two hyperfine states is 5.9 \\times 10^{-6} electron volts, with a wavelength of 21 centimeters. When neutral hydrogen is in thermodynamic equilibrium with the photons in the cosmic microwave background (CMB), the neutral hydrogen and CMB are called to be \"coupled\", and the hydrogen line is not observable. It is only when the two temperatures are not same, or decoupled, that the hydrogen line can be observed. ==Theoretical motivation== The Big Bang produced a hot, dense, nearly homogeneous universe. As the universe expanded and cooled, particles, then nuclei, and finally atoms formed. At a redshift of about 1100, equal to about 400,000 years after the Big Bang, when the primordial plasma filling the universe cooled enough for protons and electrons to combine into neutral hydrogen atoms, the universe became optically thin by which photons from this early era no longer interacted with matter. We detect these photons today as the cosmic microwave background (CMB). The CMB shows that the universe was still smooth and uniform. After the protons and electrons combined to produce the first hydrogen atoms, the universe contained a nearly uniform, almost completely neutral, intergalactic medium (IGM) for which the most amount of matter component was hydrogen gas. With no glowing sources present, these are known as the Dark Ages. Theoretical models predict that, over the next few hundred million years, gravity slowly condensed the gas into denser and denser regions, in which the first stars eventually appeared, marking Cosmic Dawn. As more stars formed, and the first galaxies formed, they flooded the universe with ultraviolet photons capable of ionize hydrogen gas. A few hundred million years after Cosmic Dawn, the first stars produced enough ultraviolet photons to re-ionize essentially all the universe's hydrogen atoms. This is called the Reionization era which is the hallmark event of this early generation of galaxies. The beginning of structural complexity in the universe caused a remarkable transformation, but one that we have not yet looked into. By going even farther back than what the Hubble telescope can see, the truly first structures in the universe can be studied. Theoretical models suggest that present measurements are beginning to find the last part of Reionization, but the first stars and galaxies, in the Dark Ages and the Cosmic Dawn, currently lie above our understanding. DARE will make the first measurements of the birth of the first stars and black holes and will measure the properties of the invisible stellar objects. Such observations are important for placing current measurements in a proper context, and to understand how the first galaxies grew from earlier generations of structures. ==Mission== DARE's mission is to measure the shape of the redshifted 21-cm signal over a radio bandpass of 40–120 MHz, observing the redshift range 11–35, which correlate to 80–420 million years after the Big Bang. DARE orbits the Moon for 3 years and takes data above the lunar farside which is the only location in the inner Solar System proven to have no human-generated radio frequency problems. The science instrument is set to a RF quiet spacecraft bus and is made of a three-element radiometer, including electrically-short, tapered, biconical dipole antennas, a receiver, and a digital spectrometer. The smooth frequency response of the antennas and different measurements used for DARE are important in removing the intense cosmic foregrounds so that the weak cosmic 21-cm signal can be detected. ==Similar projects== Besides DARE, are other similar projects are proposed to also study this area such as the Precision Array for Probing the Epoch of Reionization (PAPER), Low Frequency Array (LOFAR), Murchison Widefield Array (MWA), Giant Metrewave Radio Telescope (GMRT), and the Large Aperture Experiment to Detect the Dark Ages (LEDA). ==Related pages== *Reionization *Wouthuysen–Field coupling ==References== * ==Further reading== * ==Other websites== * JPL Helps Shoot for the Moon, Stars, Planets and More Category:Big Bang Category:Cosmology Category:Proposed NASA space probes",
 "title": "Dark Ages Radio Explorer"
}