{
 "id": "808715",
 "text": "Élisabeth de Bourbon (August 1614 – 19 May 1664) was a granddaughter of King Henry IV of France. ==Biography== Élisabeth was born in Paris. Her father was César de Bourbon, Duke of Vendôme, legitimised son of King Henry IV of France and his official mistress Gabrielle d'Estrées. Her mother was Princess Françoise of Lorraine (1592–1669), daughter and heiress of Philippe Emmanuel, Duke of Mercœur, himself a rival of Henry IV. Her mother was the Duchess of Mercœur and Penthièvre in her own right and was the greatest heiress of her time. Styled as Mademoiselle de Vendôme prior to marriage, she was the second of three children; she had two brothers, the Frondeur François de Bourbon, Duke of Beaufort and Louis de Bourbon, Duke of Vendôme whose wife Laura Mancini was a niece of Cardinal Mazarin. They were the parents of Louis Joseph de Bourbon, a very successful military commander and a Marshal of France. On 11 July 1643 at the Louvre, Mademoiselle de Vendôme married Charles Amadeus of Savoy, Duke of Nemours. The young prince was a member of a cadet branch of the house of Savoy which had settled in France. The young prince was a direct descendant of Philip II, Duke of Savoy as was Élisabeth. They had two daughters who would marry the heirs to the thrones of Savoy and Portugal, and three sons who died shortly after birth. In 1652 the Duke of Nemours was killed by her brother François, Duke of Beaufort in a duel. Élisabeth herself died in Paris. She managed to secure the income of the lands of Nemours for her two daughters, but the titles were inherited by other members of the family. ==Issue== #Marie Jeanne of Savoy, Mademoiselle de Nemours (1644–1724) married Charles Emmanuel II, Duke of Savoy in 1665. #Stillborn daughter #Marie Françoise of Savoy, Mademoiselle d'Aumale (1646–1683) married Afonso VI of Portugal in 1666 and afterwards Afonso's brother Pedro II of Portugal. #Prince Joseph of Savoy (1649–1649) #Prince Francis of Savoy (1650–1650) #Prince Charles Amadeus of Savoy (1651–1651) ==Ancestry== ==Other websites== Category:1614 births Category:1664 deaths Category:People from Paris Elisabeth Category:Dukes and duchesses of France Category:Princes and Princesses of Savoy",
 "title": "Élisabeth of Bourbon"
}