{
 "id": "808820",
 "text": "The League of Legends World Championship (commonly abbreviated as Worlds) is an annual professional League of Legends world championship tournament. It is hosted by Riot Games. It comes at the end of each season. Teams compete for the champion title, the Summoner's Cup, and a multi-million-dollar championship prize. In 2018, the finals were watched by 99.6 million people, breaking 2017's finals' viewer record. The tournament has been praised for its ceremonial performances. It has received attention worldwide because of its dramatic and emotional nature. The League of Legends World Championships has been very successful and popular. It is one of the world's most prestigious and watched tournaments and the most watched video games in the world. Because of its success, esports became prominent and widely seen as a potential Olympics event. It is already included as a medal event in 2022 Asian Games. The tournament is held in different major countries and regions each year. South Korea's T1 is the most successful team in the tournament's history, having won three world championships. == Trophy == Riot Games, which owns League of Legends, commissioned the winner's trophy known as the Summoner's Cup. Riot specified that it should weigh , though the actual weight of the finished cup was reduced so it would not be too heavy to lift in victory. Thomas Lyte created the Season Two World Championship Cup in 2012. He made the winners' trophy for the 2014 games. == Overview == === Results === Year Final location Final 3rd–4th Champion Score Runner-up 2011 Jönköping Fnatic 2 1 against All authority Team SoloMid (3rd) Epik Gamer (4th) 2012 Los Angeles Taipei Assassins 3 1 Azubu Frost CLG Europe Moscow Five 2013 Los Angeles SK Telecom T1 3 0 Royal Club Fnatic NaJin Black Sword 2014 Seoul Samsung White 3 1 Star Horn Royal Club OMG Samsung Blue 2015 Berlin SK Telecom T1 3 1 KOO Tigers Fnatic Origen 2016 Los Angeles SK Telecom T1 3 2 Samsung Galaxy H2k-Gaming ROX Tigers 2017 Beijing Samsung Galaxy 3 0 SK Telecom T1 Royal Never Give Up Team WE 2018 Incheon Invictus Gaming 3 0 Fnatic Cloud9 G2 Esports 2019 Paris FunPlus Phoenix 3 0 G2 Esports Invictus Gaming SK Telecom T1 2020 Shanghai Damwon Gaming 3 1 Suning G2 Esports Top Esports 2021 TBA TBD – – TBD TBD TBD 2022 TBD TBD – – TBD TBD TBD === Regions which have reached the top four === (*): Region had two teams that finished in 3rd/4th place in this year. Region Titles Runner-up 3rd–4th South Korea (LCK) 6 (2013, 2014, 2015, 2016, 2017, 2020) 4 (2012, 2015, 2016, 2017) 4 (2013, 2014, 2016, 2019) China (LPL) 2 (2018, 2019) 3 (2013, 2014, 2020) 5 (2014, 2017*, 2019, 2020) Europe (LEC) 1 (2011) 3 (2011, 2018, 2019) 8 (2012*, 2013, 2015*, 2016, 2018, 2020) TW/HK/MO/SEA (PCS) 1 (2012) North America (LCS) 3 (2011*, 2018) === Teams which have reached the top four === Background shading indicates a team/organization has been disbanded, acquired or no longer participates in the regional league. Team Titles Runner-up 3rd–4th T1 3 (2013, 2015, 2016) 1 (2017) 1 (2019) Gen.G 2 (2014, 2017) 1 (2016) 1 (2014) Fnatic 1 (2011) 1 (2018) 2 (2013, 2015) Invictus Gaming 1 (2018) 1 (2019) J Team 1 (2012) FunPlus Phoenix 1 (2019) Damwon Gaming 1 (2020) Royal Never Give Up 2 (2013, 2014) 1 (2017) G2 Esports 1 (2019) 2 (2018, 2020) Hanwha Life Esports 1 (2015) 1 (2016) against All authority 1 (2011) CJ Entus 1 (2012) Suning 1 (2020) Epik Gamer 1 (2011) Team SoloMid 1 (2011) CLG Europe 1 (2012) Moscow Five 1 (2012) Fredit Brion 1 (2013) Oh My God 1 (2014) Astralis 1 (2015) H2k-Gaming 1 (2016) Team WE 1 (2017) Cloud9 1 (2018) Top Esports 1 (2020) ==Notes== == References == Category:Video game events Category:2011 establishments",
 "title": "League of Legends World Championship"
}