{
 "id": "808981",
 "text": "This is a list of people who died (were killed or died in unknown circumstances) as a result of the 2020 Belarusian protests, before, during, and after the 2020 presidential elections: * Alexander Taraikovsky was shot and killed on August 10, 2020 in Minsk. * Alexander Vikhor died on August 12, 2020 in Gomel. * Artsyom Parukou died on August 16, 2020 in Minsk. * Konstantin Shishmakov was found dead on August 18, 2020 in Grodno region. * was shot by a serviceman of the 5th Spetsnaz Brigade of the Armed Forces of Belarus, Captain Roman Gavrilov, on August 11, 2020, in Brest. He died in a hospital in Minsk on August 19, 2020. * Raman Bandarenka died in a hospital in Minsk on November 12, 2020. * died in prison on May 21, 2021. He was sentenced to serve five years in prison for taking part in protests. * Dmitry Stakhovsky did a suicide after an interrogation on May 25, 2021. He was a person in a criminal case on riots. He wrote some words before he died. He named the Investigative Committee as the culprit of his death. He was 18 years old. The authorities and the main persons of the Ministry of Internal Affairs never said that people died at the hands of police personnel. == Reaction == On September 17, 2020, European Parliament spoke on the situation in Belarus. It printed a decision, supported by a very big number of people in the parliament, calling for an \"independent and effective investigation\" into the deaths of Alexander Taraikovsky, Alexander Vikhor, Artsyom Parukou, Gennady Shutov and Konstantin Shishmakov related to the protests. On November 26, 2020, European Parliament spoke on the situation in Belarus. // in time Ukraine. 26 ноября 2020.Усиление санкций, отмена ЧМ по хоккею и «внутренний терроризм». Евродепутаты эмоционально обсудили ситуацию в Беларуси // TUT.BY, 26.11.2020 It printed a decision, supported by a very big number of people in the parliament, calling for a \"prompt, thorough, impartial and independent investigations into Raman Bandarenka’s death and the protest-related deaths of Alexander Taraikovsky, Alexander Vikhor, Artsyom Parukou, Gennady Shutov and Konstantin Shishmakov.\" == References == Category:2020s deaths *",
 "title": "List of deaths related to the 2020 Belarusian protests"
}