{
 "id": "808918",
 "text": "The 2019 UEFA Nations League Finals was the final tournament of the 2018–19 edition of the UEFA Nations League The tournament was held in Portugal from 5 to 9 June 2019, and was played by the four group winners of Nations League A. The tournament was made up of two semi-finals, a third place play-off, and final to determine the first ever champions of the UEFA Nations League. Portugal won the final 1–0 against the Netherlands to become the first champions of the UEFA Nations League. ==Qualified teams== The four group winners of League A qualified for the Nations League Finals. Group Winners Date of qualification UNL Rankings November 2018 FIFA Rankings April 2019 A1 3 16 A2 1 8 A3 (host) 2 7 A4 4 4 ==Venues== In their bid dossier, the Portuguese Football Federation proposed Estádio do Dragão in Porto and Estádio D. Afonso Henriques in Guimarães as the venues. Porto Guimarães Estádio do Dragão Estádio D. Afonso Henriques Capacity: 50,033 Capacity: 30,000 ==Bracket== All times are local, WEST (UTC+1). ==Semi- finals== ===Portugal vs Switzerland=== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Rui Patrício RB 20 Nélson Semedo CB 3 Pepe CB 4 Rúben Dias LB 5 Raphaël Guerreiro RM 16 Bruno Fernandes CM 14 William Carvalho CM 18 Rúben Neves LM 10 Bernardo Silva CF 23 João Félix CF 7 Cristiano Ronaldo (c) Substitutions: Substitutions: Substitutions: DF 6 José Fonte MF 17 Gonçalo Guedes MF 8 João Moutinho Manager: Manager: Manager: Fernando Santos Fernando Santos Fernando Santos Man of the Match: Cristiano Ronaldo (Portugal) Assistant referees: Mark Borsch (Germany) Stefan Lupp (Germany) Fourth official: Viktor Kassai (Hungary) Video assistant referee: Christian Dingert (Germany) Assistant video assistant referees: Tobias Stieler (Germany) ===Netherlands vs England=== {| style=\"font- size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Jasper Cillessen RB 22 Denzel Dumfries CB 3 Matthijs de Ligt CB 4 Virgil van Dijk (c) LB 17 Daley Blind CM 15 Marten de Roon CM 21 Frenkie de Jong CM 8 Georginio Wijnaldum RW 7 Steven Bergwijn CF 10 Memphis Depay LW 9 Ryan Babel Substitutions: Substitutions: Substitutions: FW 11 Quincy Promes MF 20 Donny van de Beek MF 6 Davy Pröpper MF 16 Kevin Strootman Manager: Manager: Manager: Ronald Koeman Ronald Koeman Ronald Koeman Man of the Match: Frenkie de Jong (Netherlands) Assistant referees: Nicolas Danos (France) Cyril Gringore (France) Fourth official: Anastasios Sidiropoulos (Greece) Video assistant referee: François Letexier (France) Assistant video assistant referees: Nicolas Rainville (France) ==Third place play-off== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Yann Sommer CB 22 Fabian Schär CB 5 Manuel Akanji CB 4 Nico Elvedi RM 2 Kevin Mbabu CM 10 Granit Xhaka (c) CM 8 Remo Freuler LM 13 Ricardo Rodríguez RW 23 Xherdan Shaqiri LW 20 Edimilson Fernandes CF 9 Haris Seferović Substitutions: Substitutions: Substitutions: MF 17 Denis Zakaria MF 14 Steven Zuber FW 19 Josip Drmić MF 7 Noah Okafor Manager: Manager: Manager: Vladimir Petković Vladimir Petković Vladimir Petković Man of the Match: Jordan Pickford (England) Assistant referees: Octavian Șovre (Romania) Sebastian Gheorghe (Romania) Fourth official: Anastasios Sidiropoulos (Greece) Video assistant referee: Michael Fabbri (Italy) Assistant video assistant referees: Marco Di Bello (Italy) ==Final== {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Rui Patrício RB 20 Nélson Semedo CB 4 Rúben Dias CB 6 José Fonte LB 5 Raphaël Guerreiro CM 13 Danilo Pereira CM 14 William Carvalho CM 16 Bruno Fernandes RF 7 Cristiano Ronaldo (c) CF 17 Gonçalo Guedes LF 10 Bernardo Silva Substitutions: Substitutions: Substitutions: MF 15 Rafa Silva MF 8 João Moutinho MF 18 Rúben Neves Manager: Manager: Manager: Fernando Santos Fernando Santos Fernando Santos Man of the Match: Rúben Dias (Portugal) Assistant referees: Roberto Alonso Fernández (Spain) Juan Yuste Jiménez (Spain) Fourth official: Antonio Mateu Lahoz (Spain) Reserve assistant referee: Raúl Cabañero Martínez (Spain) Video assistant referee: Alejandro Hernández Hernández (Spain) Assistant video assistant referee: Juan Martínez Munuera (Spain) |} Match rules *90 minutes. *30 minutes of extra time if necessary. *Penalty shoot-out if scores still level. *Maximum of twelve named substitutes. *Maximum of three substitutions, with a fourth allowed in extra time. ==Statistics== ===Goalscorers=== ===Assists=== ===Awards=== ;Team of the Tournament The Team of the Tournament was selected by UEFA's technical observers, and includes at least one player from each of the four participants. Goalkeeper Defenders Midfielders Forwards Jordan Pickford Daley Blind Virgil van Dijk Rúben Dias Nélson Semedo Frenkie de Jong Georginio Wijnaldum Bruno Fernandes Cristiano Ronaldo Bernardo Silva Xherdan Shaqiri UEFA also announced a team of the tournament based on the FedEx Performance Zone player rankings. FedEx Performance Zone Team of the Tournament Goalkeeper Defenders Midfielders Forwards Jordan Pickford Matthijs de Ligt Rúben Dias Raphaël Guerreiro Manuel Akanji Kevin Mbabu Frenkie de Jong Marten de Roon Bernardo Silva Memphis Depay Cristiano Ronaldo ;Player of the Tournament * Bernardo Silva ;Young Player of the Tournament * Frenkie de Jong ==References== ==Other websites== * *2019 UEFA Nations League Finals, UEFA.com *UEFA Technical Report Category:UEFA Category:Football competitions in Europe Category:2019 in association football Category:2010s in Portuguese sport Category:2019 in Europe Category:Football in Portugal",
 "title": "2019 UEFA Nations League Finals"
}