{
 "id": "808955",
 "text": "In geometry, a triangle center is a point that can be called the middle of a triangle. There are many ways of measuring the center of a triangle, and each has a different name. On an equilateral triangle, every triangle center is the same, but on other triangles, the centers are different. Triangle centers may be inside or outside the triangle. Ancient Greek mathematicians discovered four: the centroid, circumcenter, incenter, and orthocenter. Today, mathematicians have discovered over 40,000 triangle centers. They are listed in the Encyclopedia of Triangle Centers, which is run by Clark Kimberling at the University of Evansville. == Properties of a center == A triangle center is a function of the three vertices (corners) of the triangle. Each triangle center has two properties in common. 1) Homogeneity: If the triangle is transformed while keeping similarity, (such as by translation, reflection, rotation, or dilation) the center will move in the same way as the triangle moves. 2) Bisymmetry: It must not be important to the function which vertex (corner) comes first, second, or third. For example, a center of points A, B, and C must be the same as that center of points A, C, and B. == Some triangle centers == * Centroid - the point where the three medians intersect. A median is the line from a vertex to the midpoint (middle) of the opposite edge. *Circumcenter - the point where the perpendicular bisectors of the three edges intersect. A perpendicular bisector is a line which crosses the middle of the edge (bisects the edge), and is perpendicular to the edge. The circumcenter is also the center of the circle that passes through all three vertices. *Incenter - the point where the three angle bisectors intersect. An angle bisector is a line which cuts an angle into two equal parts. The incenter is also the center of a circle which touches all three edges. * Orthocenter - the point where the three altitudes intersect. An altitude is a line which passes through a vertex and is perpendicular to the opposite edge. *Nine-point center - the center of a circle, called the nine-point circle, which passes through nine points. Three of the points are the midpoints of the edges. Three of the points are the feet of the altitudes (the place where each altitude meets an edge). Three of the points are in the middle between the orthocenter and each vertex. *Fermat point - the point such that the sum of the distances to the vertices is as small as it can be. If a triangle is not equilateral, then the centroid, orthocenter, circumcenter, and nine-point center form a line called the Euler line, named after Leonhard Euler. == References == == Other websites == * Triangle Centers - Math is Fun * Euler Line - Brilliant Math and Science Wiki Category:Geometry",
 "title": "Triangle center"
}