{
 "id": "809084",
 "text": "Marcel Mauss (May 10, 1872 - February 10, 1950) was a French anthropologist and sociologist. With a strong background in sociology, he began using ethnography to look at how different cultures build relationships. He was also influenced by his uncle, another famous anthropologist, Émile Durkheim. Mauss is known for his work on gifts and exchange, magic, sacrifice, the body, and comparing cultures. Mauss’s most famous work is The Gift. The Gift is about the ways gifts and exchanges build relationships. Mauss is also known for influencing structural anthropologists such as Claude Lévi-Strauss. == Background and education == Marcel Mauss was born in Épinal, France in 1872. His parents were Gerson Mauss and Rosine (Durkheim) Mauss. He was raised in a non-observant Jewish family. In the early 1890s, Mauss went to the University of Bordeaux where he studied many subjects including religion and philosophy. Later he moved to Paris, France where he studied at the École Pratique des Hautes Études (an important French research school). In Paris, Mauss studied Sanskrit, Hebrew, history of religion, and other topics. Mauss eventually became a professor at École Pratique des Hautes Études. He taught about many different religions. During World War I, Mauss served in the French army as an interpreter. Mauss helped form the Institut d'ethnologie (Ethnology Institute) at the University of Paris in 1925 with Paul Rivet and Lucien Lévy-Bruhl. He also was the chair of the sociology department at the Université de Paris from 1931-1939. == Influences == === Tamati Ranapiri === Mauss’ theories about the role of gifts in Māori culture relied heavily on the information provided by Tamati Ranapiri. Ranapiri was a Māori scholar who exchanged letters with ethnographer Elsdon Best. Through these letters, Ranapiri explained how gifts were used to connect people in Māori society. According to Ranapiri, gifts created commitment without force. These commitments created by gifts made social relationships and bonds stronger. === Elsdon Best === Elsdon Best was an ethnographer who studied the Māori people of New Zealand. Mauss used Best’s letters and primary data to write his work about Māori gift giving. === Émile Durkheim === Émile Durkheim was Marcel Mauss’ uncle as well as a professional influence. Mauss was Durkheim's nephew, student, and collaborator. The two worked together on many projects. Durkheim and Mauss worked together to publish the book Primitive Classifications. This book was a response to Immanuel Kant’s categories of understanding. Durkheim and Mauss also worked together to publish articles in L’Année Sociologique. L’Année Sociologique was a sociology journal created by Durkheim. === Henri Hubert === Mauss referred to Hubert as his \"Siamese twin\" and they worked together on a couple works, such as Sacrifice: Its Nature and Functions (1899) and Outline of a General Theory of Magic (1904). In works that they are not co-authored, they cite each other. As Mauss said \"[e]verything I don't know, Mauss knows, and everything Mauss doesn't know, I know.\" Their major works and theories were products of their teamwork, and therefore both greatly influenced each other. == Major works and theories == === Primitive Classifications === Primitive Classifications, an essay by both Mauss and Durkheim, was published in Durkheim’s sociology journal, Année Sociologique in 1903. In 1963 the essay was translated into English by Rodney Needham. Then British and American anthropologists could read the essay. In Primitive Classifications, Durkheim and Mauss write about categories of human thought, including time and space. They said that those categories come from societies we live in, not the individual mind. Durkheim and Mauss used data from tribal societies, such as the Zuni and the Sioux, to make their point in this essay. This essay inspired the work of a number of contemporary or near-contemporary social scientists, including Rodney Needham, Mary Douglas, Steven Lukes, Claude Levi-Strauss, Basil Bernstein, and Barry Schwartz. === Techniques of the Body === Techniques of the Body was a lecture given by Mauss in 1934 at a Société de Psychologie meeting. It was then published in the Journal de psychologie normal et patholigique in 1935. In this essay, Mauss’ theories of techniques of the body focused on how various techniques such as running, walking, and birthing are similar and different across societies. He argued that each society develops their own habits and that there is a social concept of “habitus”. He defines habitus as the learned habits of people that are different across individuals but also can be different across societies, educations, and fashions. In his essay, Mauss states that techniques of the body do vary by age and sex. He believes that there is a division of techniques in younger and older people, as well as in males and females. === The Gift === The Gift was published in 1925. It was written partially in response to the Bolshevik Revolution. In this book, Mauss argued that every society has both markets and money of some kind as well as altruism. Mauss claims that gifts are a “total social fact” which have spiritual parts to them. The Gift also examines gift giving traditions of some indigenous peoples. Mauss writes about the Māori idea of “Hau.\" He also talks about Potlatch, which was first practiced by indigenous groups in North America. Mauss believed that gift giving can tell us a lot about social relationships. He also believed that gift giving was connected to power. Mauss claimed that there is no such thing as a free gift. He thought every gift was part of an ongoing system of giving and receiving. === Sacrifice and The Body === Mauss saw sacrifice as a system of exchange as well. In 1899, Mauss published Sacrifice: Its Nature and Functions with Henri Hubert. This book compares many religious practices with a focus on sacrifice and the body. Mauss and Hubert compared religions from many places and time periods. They describe sacrifice as a system which involves both actions that are aimed towards a holy person or object and actions that are aimed away from a holy person or object. Mauss and Hubert claimed that the body is the result of many different habits and qualities. They claimed that a person is made up of certain actions that are performed through specific behaviors. === Magic === Mauss teamed up with Hubert again in 1902 to publish A General Theory of Magic. In this book, Mauss and Hubert claimed that social events, rather than individual people, were magic. This is another cross-cultural comparison, like Mauss and Hubert's work on sacrifice. They claim that magic is a social experience. The book examines the relationships between magic and religion, science, and technology. Mauss and Hubert also trace the long-lasting impact of magic on our modern ideas, such as the idea of good and bad luck. === Manual of Ethnography === Manual of Ethnography is a collection of Mauss's lectures on how to successfully do ethnography. Ethnography is when sociologists and anthropologists try to understand a culture through observing and sometimes participating in that group. In his lectures, he shows that observers should not assume that a culture will have the same opinions and ways of doing things as their own culture. He also describes how ethnographers should observe, collect data, and how to understand the different social structures that make up a group. === Religion and society === Saints, Heroes, Myths, and Rites is a collection of essays written by Mauss, Hubert and Hertz. Like Durkheim, they believed that as people started practicing their own religions, people would find new ways to maintain a sense of community based on their shared morals. Myths are also part of religion. They are a result of any human society. Because they are found in every society, they are not imaginary. Myths are subconscious symbols that the individual uses to understand their experiences. The subconscious is also called the unconscious. It is the part of a person's mind that thinks and remembers things without the person knowing it. == Critiques == In 2017, Georgina Stewart published a criticism of The Gift, specifically on Mauss' understanding of Hau. Stewart claims that a misunderstanding of Māori beliefs about the cosmos and language differences caused Mauss to misunderstand the Māori concept of Hau. Alain Testart (1998) claimed that Mauss exaggerated the idea that all gifts need to be repaid. Testart said that there were some truly free gifts, such as giving money to a homeless person as you walk by them. James Laidlaw also points out an example of free gifts within Jainism, a religion where followers believe that they cause a war between microorganisms if they prepare their own food, so they rely on outside food donations. == Impacts == Mauss is credited for being a major inspiration for Claude Lévi-Strauss and Pierre Bourdieu. Claude Lévi-Strauss went on to develop the structuralist view of cultural anthropology. Mauss is also known for inspiring future work on exchange theory and economic anthropology. Mauss' cross-cultural comparisons were radical for his time, and he helped establish a foundation for the next generation of cultural anthropologists to use a similar comparative approach. Mauss' The Gift inspired French philosopher Georges Bataille in his ideas of excess energy and waste of this energy in societies. Mauss' influence has also appeared in French sociologist, Pierre Bourdieu's works. In them, Bourdieu highlight's Mauss' idea of habitus. Habitus describes habits and skills that we learn while being within our society. These are fixed habits within us and influence the way we perceive and react to the world around us. Someone with a similar upbringing might have similar habitus. == References == Category:1872 births Category:1950 deaths Category:French sociologists",
 "title": "Marcel Mauss"
}