{
 "id": "809017",
 "text": "\"Skinner's Sense of Snow\" is the 8th episode of the 12th season of The Simpsons. It was first shown on the Fox network on December 17, 2000. The episode is about Springfield Elementary School being stuck in a snowstorm. The episode's story came from an event in the episode writer's life. The episode takes place in winter. This made it harder for animators to make the animation of the episode. The episode makes references to Smilla's Sense of Snow, The Deer Hunter, and Kristi Yamaguchi.Pross, Max. (2009). Commentary for \"Skinner's Sense of Snow\", in The Simpsons: The Complete Twelfth Season [DVD]. 20th Century Fox. == Story == The Simpson family go to a circus show called Cirque de Purée (a parody of Cirque du Soleil). However, a blizzard makes the circus have to stop. All of the schools (except the one Bart and Lisa go to) close because of the blizzard. Only some of the students go to the school during the blizzard. Seymour Skinner and Groundskeeper Willie are the only people in the school's faculty that came. Skinner puts a DVD in a movie projector. When the DVD gets set on fire, the school day ends. However, the blizzard causes snow to pile in front of the doors. Nobody in the school is able to leave now. Skinner gives the students apples and relish to make sure they are not hungry. Nelson tries to get out of the school but Skinner will not let him. Skinner tries to get respect from the students in a way that is similar to the U.S. Army. Bart tries to make a tunnel in the snow so he can leave the school. Skinner breaks the tunnel but gets stuck inside of the snow. The students put Skinner in a big bag and take control of the school. Homer and Ned get in a car to drive to the school. Homer hits a fire hydrant with the car. The water from the fire hydrant freezes and makes them stuck inside. They start to get carbon monoxide poisoning from the large levels of carbon monoxide in the car. Skinner uses a hamster to get everyone out of the school. The hamster goes to Homer and Ned and breaks the car window. The car hits a salt silo that falls next to the school. The salt melts the snow, which makes the students now able to leave the school. Superintendent Chalmers finds the school in a bad condition and is angry at Skinner until Bart tells him about the blizzard. Homer starts to hallucinate from the carbon dioxide and sees Lisa as a camel. == Production == \"Skinner's Sense of Snow\" was written by Tim Long. Lance Kramer is the director of the episode. The episode's story came from Long. One time while he was a child, a blizzard hit Exeter, Ontario. He was sad when he learned that every school was closed except for the one he went to. Long was also stuck in the school with his teachers because of snow. He said that \"It was hellish, but then became a sweet thing\". He also said that many dads used snowmobiles to give them food while inside the school.Long, Tim. (2009). Commentary for \"Skinner's Sense of Snow\", in The Simpsons: The Complete Twelfth Season [DVD]. 20th Century Fox. Matt Selman, a writer for the show, got the idea for the Simpson family to go to Cirque du Purée.Selman, Matt. (2009). Commentary for \"Skinner's Sense of Snow\", in The Simpsons: The Complete Twelfth Season [DVD]. 20th Century Fox. This idea became the beginning of the episode's story. The episode's director, Lance Kramer, wanted the animators of the episode to watch a Cieque du Soleil show. The animators did not watch one.Kramer, Lance. (2009). Commentary for \"Skinner's Sense of Snow\", in The Simpsons: The Complete Twelfth Season [DVD]. 20th Century Fox. Mike Scully thought that the animators did a great job on animating the circus show.Scully, Mike. (2009). Commentary for \"Skinner's Sense of Snow\", in The Simpsons: The Complete Twelfth Season [DVD]. 20th Century Fox. The episode is set in the winter. This made it harder for animators to animate than it is for other episodes. Kramer said that \"It just adds another element\". He shows this by talking about episodes that are set in winter: * The clothes on people have to move around if it is windy. * The snow has to stay consistent. * If there are big snowflakes showing, and then small snowflakes when it is snowing faster, it will not work. The particles on the film were put in by a post-production team. Scully said that the post- production team \"never gets enough credit\". When Homer and Ned drive to the school, the song \"Feel Like Makin' Love\" by Bad Company plays. The song \"Rock and Roll All Nite\" by Kiss was going to play but the show's staff did not get the permission to play it. == Reception == Mac McEntire from DVD Verdict thought that the episode was \"outrageous\" and a \"standout\" (better than others). He said that the comedy about the \"cool kids versus dorky adults\" is the best part of the episode. Matt Haigh of Den of Geek said that the episode is \"gold\" (good in quality). Elizabeth Skipper from DVD Verdict says that episodes with Principal Skinner are a \"sure thing\" and that this episode was \"no exception\". Colin Jacobsson of DVD Movie Guide called the episode \"mediocre\". He thought that the episode's story was not as good as it could have been. == References == == Other websites == * * * Category:The Simpsons episodes Category:2000 television episodes Category:Christmas television episodes",
 "title": "Skinner's Sense of Snow"
}