{
 "id": "809376",
 "text": "The Christmas Oratorio () is a musical composition written by Johann Sebastian Bach. It tells the story of the birth of Jesus, based on the gospels of Matthew and Luke. == History == Before Bach wrote the Christmas Oratorio, he already wrote some cantatas for the Christmas season. The oratorio was written in 1734. It was written for the Christmas season of that year. It was first performed in the Thomaskirche and Nikolaikirche, Leipzig. == Music == The oratorio has 6 parts. Each part is performed for a certain day in the Christmas season. Some of the music is based from Bach's other works. == Parts == === Part I === Part I is written for Christmas Day (December 25). The words tell the story of the birth of Jesus. The instruments used in part I are 3 trumpets, timpani, 2 flutes, 2 oboes (each player also plays an oboe d'amore), 2 violins, viola, and the basso continuo. === Part II === Part II is written for the second day of Christmas (December 26). The words tell the story of the annunciation of the shepherds. The instruments used in part II are 2 flutes, 2 oboes d'amore, 2 oboes da caccia, 2 violins, viola, and the basso continuo. === Part III === Part III is written for the third day of Christmas (December 27). The words tell the story of the arrival of the shepherds. The instruments used in part III are the same as part I. === Part IV === Part IV is written for New Year's Day (January 1). The words tell the story of the circumcision of Jesus. The instruments used in part II are 2 horns, 2 oboes, 2 violins, viola, and the basso continuo. === Part V === Part V is written for the Sunday after New Year's Day. The words tell the story of the Magi's arrival in Jerusalem. The instruments used in part II are 2 oboes d'amore, 2 violins, viola, and the basso continuo. === Part VI === Part VI is written for the holiday of Epiphany. The words tell the story of the Magi visiting Jesus. The instruments used in part VI are the same as part I. == References == Category:Passions and oratorios by Johann Sebastian Bach Category:Christmas music",
 "title": "Christmas Oratorio"
}