{
 "id": "809531",
 "text": "Peter Benjamin Parker, known as Spider-Man, is a fictional character who appears in the Marvel Cinematic Universe movies Captain America: Civil War, Spider-Man: Homecoming, Avengers: Infinity War, Avengers: Endgame, Spider-Man: Far From Home, and Spider-Man: No Way Home. He is based on the Marvel Comics superhero of the same name and is played by Tom Holland. This is the third time Spider-Man has been played in the movies, following after Tobey Maguire's portrayal in Sam Raimi's movie series and Andrew Garfield's portrayal in Marc Webb's The Amazing Spider-Man movies. ==Fictional character biography== Peter Parker is a teenager in New York City who has had spider-like abilities for a while. He lives with his Aunt May and is best friends with Ned Leeds. One day, Tony Stark, the president of Stark Industries who also serves as Iron Man, comes to visit him and Aunt May. Mr. Stark recruits Peter, who he has figured out is Spider-Man, to fight alongside some other superheroes during a dispute with Captain America. Peter continues to work with Stark as an intern for the Avengers, gaining the technology needed to improve his suit and equipment, but after getting in trouble with Mr. Stark, must fight the criminal known as \"The Vulture\" alone, regaining Stark's respect. As Spider-Man, Peter goes on to fight alongside Iron Man, Captain America, and other members of the Avengers when Thanos threatens their universe. The first time around, Thanos kills half of the universe's inhabitants, which unfortunately includes Peter. However, Peter and everyone else who was killed is brought back to life after Stark and the remaining Avengers figure out how to undo \"the Snap\". The Avengers defeat and kill Thanos the second time around, but Mr. Stark and some of the other Avengers die in the effort and cannot be brought back to life this time. After Mr. Stark's death, Peter becomes very sad but vows to become stronger to honor him. He and Ned go on a class trip to London where he becomes close with another classmate, MJ, who becomes his girlfriend. Peter also encounters Quentin Beck, who initially seems like a good person and calls himself Mysterio, but is actually a scientist who used to work for Stark's company and was fired due to being crazy. After Peter is tricked into giving some technology to Mysterio, Ned and MJ give him clues on how to stop Mysterio. Peter has to rescue the two from Mysterio and defeats him, but Mysterio leaks Peter's identity as Spider-Man to the public and tricks \"newscaster\" J. Jonah Jameson into thinking that Peter/Spider-Man killed Mysterio and caused all the damage.Peter is later found not guilty, but his fame as Spider-Man negatively affects his life, as well as those of Ned, MJ, and Aunt May. He goes to Dr. Stephen Strange to try and make everyone forget he is Spider-Man, but due to trying to make some last-minute changes to have MJ, Ned, and Aunt May remember, the spell backfires and brings a few villains from other universes who know Peter is Spider-Man into this universe. Dr. Strange is mad and wants Peter, MJ, and Ned to find the villains, but after learning that the villains will most likely die fighting their versions of Spider-Man, Peter fights with Dr. Strange over this and wants to make the villains good again. He cures Doc Ock, but the Green Goblin, who has two personalities, has his bad personality come out and free the villains, also killing Aunt May. Peter's friends, as well as two other versions of himself from the other universes, \"Peter Two\" and \"Peter Three\", make him feel better and help him track down and cure all the bad guys. The only way everything can be fixed now is if Peter has everyone forget who he is, even his friends and family, but Peter says it's okay to Dr. Strange, saying goodbye to MJ and Ned but promising to find them. After the spell is fixed and sends everyone home, Peter goes on his own way as Spider-Man. ==Reception== Tom Holland's portrayal of a teenaged Spider-Man in the films has been mixed, as they praised his suit and performance while others criticizied for being annoying and childish. == Appearances == === Movie appearances === Year Movie Portrayed by 2016 Captain America: Civil War Tom Holland 2017 Spider-Man: Homecoming 2018 Avengers: Infinity War 2019 Avengers: Endgame Spider-Man: Far From Home 2021 Venom: Let There Be Carnage (post-credits cameo) Spider-Man: No Way Home === Television appearances === Year Television series Seasons Episodes Portrayed by 2021-2024 What If...? 3 26 Hudson Thames (voice) 2025 Your Friendly Neighborhood Spider-Man 1 TBA ==References== Category:Marvel Cinematic Universe characters Category:Fictional characters introduced in 2016 Category:Spider-Man movie characters",
 "title": "Peter Parker (Marvel Cinematic Universe)"
}