{
 "id": "80969",
 "text": "The Voyager program is a space exploration program of the United States' NASA agency. It consists of a pair of unmanned scientific probes, Voyager 1 and Voyager 2. They were launched in 1977 to take advantage of a favorable planetary alignment of the late 1970s. Although they were officially used to study just Jupiter and Saturn, the two probes were able to continue their mission into the outer solar system. They have since continued out and exited the solar system. These probes were built at JPL and were funded by NASA. Both missions have gathered large amounts of data about the gas giants of the solar system, of which little was known before. In addition, the spacecraft paths have been used to place limits on the existence of Planet X, a planet believed by some people to be farther from the Sun than Pluto. In 2013, NASA announced that Voyager 1 had left the solar system (Heliosphere) on 25 August 2012. It is the first man-made object to enter interstellar space. In 2018, NASA announced that Voyager 2 had reached the heliopause on 5 November of that year. Both of them are now in travelling in the interstellar space. Voyager spacecraft are the farthest spacecraft from Earth. On February 17, 1998, Voyager 1 passed the first spacecraft that completed the 1st mission to Jupiter, Pioneer 10 in the distance to the Sun at 70 AU (6.5 billion miles, 10.5 billion km) from it as the farthest spacecraft from the Sun. Voyager 2 overtook Pioneer 10 in the distance to the Sun at 133.92 AU (12.447 billion miles, 20.03 billion km) from it on July 18, 2023 as the 2nd farthest spacecraft from the Sun. ==References== ==Other websites== * NASA Voyager website - Main source of information. * Voyager Spacecraft Lifetime * Space Exploration - Robotic Missions * NASA Facts - Voyager Mission to the Outer Planets (PDF format) * Spacecraft Escaping the Solar System - current positions and diagrams * Voyager 1 and 2 atlas of six Saturnian satellites (PDF format) 1984 * Mission state Category:1970s in spaceflight",
 "title": "Voyager program"
}