{
 "id": "809690",
 "text": "The Spanish Socialist Workers' Party ( ; PSOE ) is a social-democratic political party in Spain. The PSOE has been in government for a longer time than any other political party in modern democratic Spain. The party was in charge of the Spanish government from 1982 to 1996 under Felipe González; from 2004 to 2011 under José Luis Rodríguez Zapatero; and currently since 2014 under Pedro Sánchez. The PSOE was founded in 1879, making it the oldest party currently active in Spain. When it was founded, it was a marxist party, however they stopped supporting Marxism in 1979. ==1880s to 1931== PSOE was founded in Madrid, and its main objective was the defense of worker's rights and the achievement of the ideals of marxist socialism, by gaining political power for the working class. From 1879 to 1910 PSOE was a little organisation, having only representation in 3 regions. At this time, anarchism was the dominant ideology in the spanish labour movement. In the 1910 Spanish general election, a seat was won by PSOE, and this gave the party more importance at national level. In 1917, PSOE and UGT (the trade union of the party) participated in the 1917 Spanish general strike and the party won more national attention. In 1920 a split from PSOE formed the Communist Party of Spain. In the 1923–1930 dictatorship, some members of PSOE collaborated with the military regime, while others did not. In the 1931 Spanish local elections PSOE endorsed republican positions. ==1931-1936== In 1931 the Second Spanish Republic was proclaimed following the 1931 Spanish local elections and the resignment of the spanish king Alfonso XIII. PSOE was the winner of the 1931 general election, the first free elections in Spain. The party had presence in the 1931-1933 goverment, and in the 1936-1939 goverment. In the 1936 Spanish general elections PSOE was in the \"Popular Front\" coalition (a coalition of the main left wing spanish parties). ==1939 to 1975== Following the Spanish Civil War, PSOE was prohibited and many memebers went to exile. PSOE was the second largest party in illegality during the Franco dictatorship. In 1974, Felipe González won the leadership of the party, and announced the party will stop supporting marxism, which was made offcial in 1979. The new ideology of the party was a Centre-left Social democracy. ==1975 to 1982== PSOE endorsed the 1978 Spanish constitution. In the 1978 elections, PSOE was the second largest party, while UCD was the 1st. ==1982 to 1996== In the 1982 general elections, Felipe González won by absolute majority (more than 50%). PSOE will win all the elections from 1982 to 1996. In this era, Spain started to modernise in both social aspects and in economic ones. In 1996 the PP won the presidency. ==2000 to 2010== In the year 2000 José Luis Rodríguez Zapatero won the leadership of the party, and the 2004 and 2008 Spanish general elections. Under Zapatero´s rule, the PSOE started embracing progressivism and some social liberal economic policies. This changes were called \"Nueva vía\" and were very simmilar to the german Neue mitte and to the english New Labour. ==2018 - nowdays== Mantaining a simmilar philosophy to Zapatero, Pedro Sánchez was chosen general secretary in 2014. In 2018, Pedro Sánchez (the opposition leader) was proclaimed president of spain, after Mariano Rajoy lost an impeachment. He won the two 2018 spanish elections, but lost the 2018 elections. However PSOE would join with all the opposition and regional parties to mantain the spanish presidency. ==References == Category:19th- century establishments in Spain Category:1879 establishments in Europe Category:Political parties in Spain",
 "title": "Spanish Socialist Workers' Party"
}