{
 "id": "809841",
 "text": "The 2021 Atlantic hurricane season was the third most active Atlantic hurricane season. It officially began on June 1, 2021, and ended on November 30, 2021. These dates, adopted by convention, historically describe the period in each year when most Atlantic tropical cyclones form. However, tropical cyclogenesis is possible at any time of the year, as demonstrated by the early formation of Subtropical Storm Ana on May 22, making 2021 the seventh consecutive year that a storm formed before the official start of the season. In June 3 named storms formed during the month making June 2021 the most active June since 1968 and also tied with 1886, 1909, and 1936. Starting this season, the National Hurricane Center (NHC) began to issue regular Tropical Weather Outlooks on May 15, two weeks earlier than it did in the past. This change was implemented in light of the fact that named systems had formed in the Atlantic Ocean prior to the official start of the season in each of the preceding six seasons. == Season Summary == ImageSize = width:800 height:250 PlotArea = top:10 bottom:80 right:20 left:20 Legend = columns:3 left:30 top:58 columnwidth:270 AlignBars = early DateFormat = dd/mm/yyyy Period = from:01/05/2021 till:01/12/2021 TimeAxis = orientation:horizontal ScaleMinor = grid:black unit:month increment:1 start:01/06/2021 Colors = id:canvas value:gray(0.88) id:GP value:red id:TD value:rgb(0.38,0.73,1) legend:Tropical_Depression_=≤38_mph_(0-62_km/h) id:TS value:rgb(0,0.98,0.96) legend:Tropical_Storm_=_39-73_mph_(63–117 km/h) id:C1 value:rgb(1,1,0.80) legend:Category_1_=_74–95_mph_(119–153_km/h) id:C2 value:rgb(1,0.91,0.46) legend:Category_2_=_96–110_mph_(154–177_km/h) id:C3 value:rgb(1,0.76,0.25) legend:Category_3_=_111–129_mph_(178–208-km/h) id:C4 value:rgb(1,0.56,0.13) legend:Category_4_=_130–156_mph_(209–251_km/h) id:C5 value:rgb(1,0.38,0.38) legend:Category_5_=_≥157_mph_(≥252_km/h) Backgroundcolors = canvas:canvas BarData = barset:Hurricane bar:Month PlotData= barset:Hurricane width:11 align:left fontsize:S shift:(4,-4) anchor:till from:22/05/2021 till:23/05/2021 color:TS text:\"Ana (TS)\" from:14/06/2021 till:16/06/2021 color:TS text:\"Bill (TS)\" from:19/06/2021 till:22/06/2021 color:TS text:\"Claudette (TS)\" from:28/06/2021 till:29/06/2021 color:TS text:\"Danny (TS)\" from:01/07/2021 till:09/07/2021 color:C1 text:\"Elsa (C1)\" from:11/08/2021 till:14/08/2021 color:TS barset:break barset:skip barset:skip barset:skip barset:skip barset:skip from:15/08/2021 till:18/08/2021 color:TS text:Fred (TS) from:13/08/2021 till:21/08/2021 color:C3 text:Grace (C3) from:16/08/2021 till:23/08/2021 color:C1 text:\"Henri (C1)\" from:26/08/2021 till:01/09/2021 color:C4 text:\"Ida (C4)\" from:28/08/2021 till:01/09/2021 color:TS text:\"Kate (TS)\" barset:break from:29/08/2021 till:30/08/2021 color:TS text:\"Julian (TS)\" from:31/08/2021 till:11/09/2021 color:C3 text:\"Larry (C3)\" from:08/09/2021 till:10/09/2021 color:TS text:\"Mindy (TS)\" from:12/09/2021 till:16/09/2021 color:C1 text:\"Nicholas (C1)\" from:17/09/2021 till:18/09/2021 color:TS text:\"Odette (TS)\" from:19/09/2021 till:23/09/2021 color:TS text:\"Peter (TS)\" from:19/09/2021 till:23/09/2021 color:TS text:\"Rose (TS)\" from:22/09/2021 till:02/10/2021 color:C4 text:\"Sam (C4)\" from:24/09/2021 till:25/09/2021 color:TS text:\"Teresa (SS)\" from:29/09/2021 till:02/10/2021 color:TS text:\"Victor (TS)\" barset:break from:31/10/2021 till:01/11/2021 color:TS text:\"Wanda (SS)\" bar:Month width:5 align:center fontsize:S shift:(0,-20) anchor:middle color:canvas from:01/05/2021 till:01/06/2021 text:May from:01/06/2021 till:01/07/2021 text:June from:01/07/2021 till:01/08/2021 text:July from:01/08/2021 till:01/09/2021 text:August from:01/09/2021 till:01/10/2021 text:September from:01/10/2021 till:01/11/2021 text:October from:01/11/2021 till:01/12/2021 text:November TextData = pos:(570,30) text:\"(From the\" pos:(617,30) text:\"Saffir-Simpson scale)\" == Systems == === Tropical Storm Ana === Tropical Storm Ana was the first tropical cyclone of the year. This storm threatened Bermuda, warranting a Tropical Storm Watch, but it did not affect that area. It moved northeast and dissipated on May 24. This storm formed before hurricane season officially begun, continuing the 7-year streak of pre-season systems. === Tropical Storm Bill === Tropical Storm Bill threatened the East Coast of the United States as it formed into Tropical Depression Two, but it did not affect that region and continued northeast into the Atlantic Ocean, south of Canada, and dissipated on June 16. === Tropical Storm Claudette === Tropical Storm Claudette formed just off the coast of Louisiana and made landfall in eastern Terrebonne Parish, and weakened to a tropical depression travelled across Mississippi, Alabama, Georgia, the Carolinas, and southern Virginia before moving into the Atlantic, reintensifying into a tropical storm on June 21 and turning post-tropical the next day. The storm later dissipated the next day. This storm killed 14 people in Alabama, 4 of which were direct. === Tropical Storm Danny === Tropical Storm Danny formed off the coast of South Carolina and made landfall in that state. This made Danny the first June storm to make landfall in South Carolina since Hurricane One in 1867. It dissipated inland the next day. === Hurricane Elsa === Tropical Storm Elsa formed on the early morning hours of July 1, 2021, and intensified into a tropical storm later that day. This made it the earliest fifth tropical cyclone to form in the Atlantic since reliable records begun in 1851. This is also the second earliest storm to form this far east in the Main Development Region, only behind the 1933 Trinidad hurricane. This storm rapidly moved towards the Lesser Antillies at 30 mph after it became a tropical storm. === Tropical Storm Fred === ===Hurricane Grace=== ===Hurricane Henri=== ===Hurricane Ida=== Hurricane Ida was a powerful Category 4 hurricane that affected Gulf Coast of the United States, Southeastern United States, and Northeastern United States in late August 2021 into early September 2021. Ida was the ninth named storm, and fourth hurricane of the 2021 Atlantic hurricane season, Ida originated from a tropical wave first monitored by the National Hurricane Center (NHC) on August 23, moving into the Caribbean Sea and developing into a tropical storm on August 26. On August 27, Ida became a Category 1 hurricane and initiated rapid intensification on the next day, becoming a Category 2 hurricane at 18:00 UTC on August 28. ===Tropical Storm Kate=== ===Tropical Storm Julian=== ===Hurricane Larry=== ===Tropical Storm Mindy=== ===Hurricane Nicholas=== ===Tropical Storm Odette=== ===Tropical Storm Peter=== ===Tropical Storm Rose=== ===Hurricane Sam=== ===Subtropical Storm Teresa=== ===Tropical Storm Victor=== ===Tropical Storm Wanda=== ==Storm names== These names will be used for named storms that form in the North Atlantic in 2021. Retired names, if any, will be announced by the World Meteorological Organization in the spring of 2022. The names not retired from this list will be used again in the 2027 season. This is the same list used in the 2015 season, with the exceptions of Elsa and Julian, which replaced Erika and Joaquin. The names Elsa, Julian, Rose, Sam, Teresa, Victor, and Wanda was used for the first time this year. * Ana * Bill * Claudette * Danny * Elsa * Fred * Grace * Henri * Ida * Julian * Kate * Larry * Mindy * Nicholas * Odette * Peter * Rose * Sam * Teresa * Victor * Wanda Retirement The name Ida was retired and was replaced by Imani. ==Season effects== This is a table of all of the storms that have formed in the 2021 Atlantic hurricane season. It includes their duration, names, landfall(s)–denoted by bold location names – damages, and death totals. Deaths in parentheses are additional and indirect (an example of an indirect death would be a traffic accident), but were still related to that storm. Damage and deaths include totals while the storm was extratropical, a wave, or a low, and all of the damage figures are in 2021 USD. ==References== Category:2021 Atlantic hurricane season Category:2021 disasters in North America",
 "title": "2021 Atlantic hurricane season"
}