{
 "id": "809886",
 "text": "Harry Potter and the Half-Blood Prince is a 2009 fantasy movie directed by David Yates. It is based on J. K. Rowling's 2005 novel of the same name. The movie, which is the sixth one in the Harry Potter movie series. It stars Daniel Radcliffe as Harry Potter, alongside Rupert Grint and Emma Watson as Harry's best friends Ron Weasley and Hermione Granger. With a budget of $250 million, it is one of the most expensive movies ever made. At the time, it was the most expensive movie in the Harry Potter movie series. == Plot == Lord Voldemort gives Draco Malfoy the task of killing Professor Dumbledore. Draco's mother, Narcissa makes a deal with Severus Snape that he must kill Dumbledore if Draco cannot. Meanwhile, Harry Potter and Dumbledore recruit Professor Slughorn to work as the new potions teacher at Hogwarts school. As the school year begins, Harry's friend Ron Weasley falls in love with Lavender Brown, making Hermione Granger upset. Harry finds a potions and spellbook written by a former Hogwarts student who called themselves the \"Half-Blood Prince\". A half-blood is a wizard who has one magical parent and one non-magical parent. Pure-bloods have two magical parents while muggle-borns have two non-magical parents. Voldemort wants rid of all wizards who are not pure-bloods. Dumbledore and Harry look into Professor Slughorn's memories and find out that Slughorn taught Voldemort when he was at school. Slughorn told Voldemort about Horcruxes, objects which an evil wizard can put his soul inside of so he can be immortality. Dumbledore realises that Voldemort has been using Horcruxes to survive after death. Two of them have already been destroyed. Harry and Dumbledore go on a mission to retrieve another Horcrux. They are successful and return to Hogwarts. Draco Malfoy uses a magical cabinet to let a group of Death Eaters into the school. Draco and the Death Eaters corner Dumbledore but Draco cannot kill him. Snape arrives and kills Dumbledore. Snape reveals to Harry that he is the Half-Blood Prince. Harry, Ron and Hermione agree to leave Hogwarts to search for the remaining Horcruxes. ==References== Category:2009 fantasy movies Harry Potter 6 Category:Warner Bros. movies Category:Movies based on books Harry Potter 6 Category:Movies composed by John Williams",
 "title": "Harry Potter and the Half-Blood Prince (movie)"
}