{
 "id": "81020",
 "text": "Charlotte Karin Lindström (born August 9, 1984 in Sollentuna, Sweden) is a former waitress, promotion model, convicted criminal and former prisoner. She was arrested on May 26, 2007, and had to spend three years in jail in Sydney, Australia. When she was arrested, people suspected she was trying to hire a hitman to kill two men who were about to testify against her boyfriend Steven Spaliviero in court. == Case == Lindström arrived in Sydney in 2003 working as a part-time model as well as a waitress in the exclusive nightclub Hemmesphere in Sydney. In Sydney Lindström met Steven Spaliviero and they soon started a relationship living in an apartment in Darling Harbour. Lindström later told the court that she soon realised that he was both a rich businessman and a drug dealer. In early 2007, investigators started to look into Spaliviero's business and soon found two witnesses who said they had information about the man's drug dealing business. At that time Spaliviero was already on bail from Melbourne in relation to another drug case. Spaliviero was arrested, refused bail and sent to Metropolitan Remand and Reception Centre (\"MRRC\") in Silverwater, New South Wales. == Murder plot == In MRRC Spaliviero allegedly met another inmate who offered him to get witnesses in Spaliviero's case killed. In relation to this Spaliviero phoned Lindström from MRRC telling her to meet a \"solicitor\" and give him money. Lindström started acting upon instructions from Spaliviero. When Lindström finally met who she thought was a hitman, but who in reality was an undercover policeman, she was arrested. The policeman on the case stated that Lindström wanted to have two men in the \"cemetery\" (i.e. dead). The price was agreed as AUD 100,000 for each contract.Lindstrom Melbournecrime.com Upon her arrest on May 26 Lindström was remanded in custody. Later an application for bail was made where Steven Spaliviero's mother, Dolores Spaliviero, offered to put up AUD 2,000,000 surety to get Lindström out from custody. In addition, Lindström's friend and employer, Justin Hemmes promising that if Lindström was set free on bail, he would let her continue her work at the Hemmesphere nightclub until trial. The application for bail was denied due to flight risk and Lindström was remanded in custody. On September 18, having had a deal made with the prosecutors, Lindström pled guilty to the charges. On December 21, she pled guilty again in another court in Sydney. Lindström appeared in a bullet-proof vest at her court hearings because of the alleged death threats against her life. Lindström was initially sentenced to four years in jail being eligible for early parole on May 25 2009. Even though Lindström was given a hefty discount from her sentence because she had agreed to testify against Steven Spaliviero and two other men, the Crown appealed against the sentence as \"manifestly inadequate\". The criminal court of appeals heard the appeal on July 4 2008. On 23 July 2008 her maximum sentence was increased from three years and 10 months to four years and nine months, making her eligible for parole in May, 2010.Lindstrom in court news.com.au Retrieved 11 April 2017 On August 11 2008 Lindström started testifying against Spaliviero in his court case, among others reading a love letter to the court which she had written to him in February 2007 some months before her own arrest. Despite Lindström's extensive testimonies Spaliviero and two other defendants were found not guilty for the murder plot. Lindström was released on parole from Long Bay jail in New South Wales on 25 May 2010 and deported the next day from Australia. Since her release from prison, Lindström has returned to her native home Sweden and is understood to have had ongoing threats against her life. According to the Australian media, on 15 August 2010, Charlotte Lindström agreed to return to Australia to testify in the trial of her former boyfriend's associate. Due to an unspecified severe illness, she has not been allowed to travel to Australia. The upcoming trial has been postponed. == Latest development == On 14 November 2010, Australian Channel 9 aired an exclusive interview of Charlotte Lindström named \"Charlotte's web\", in which she appeared with her face unobscured despite allegations that she is living under death threats.Model Lindstrom sixtyminutes.com Retrived 11 April 2017 On 6 September 2011, Channel 9 in Australia aired a documentary concentrating on Charlotte Lindström's murder plot. According to an article in the Sydney Morning Herald Charlotte Lindström \"no longer has feelings for\" Steven Spaliviero. After living under a strictly protected identity for over 10 years, Charlotte Lindström married Swedish businessman Jesper Löwenborg https://career.cupole.se/people/30273-jesper-lowenborg in 2017 and took his last name. The couple has two kids and lives openly in Stockholm. https://www.hitta.se/charlotte+l%C3%B6wenborg/stockholm/person/flptbxzfh Charlotte Löwenborg works as a senior project lead https://se.linkedin.com/in/charlotte-l%C3%B6wenborg-8a6385159?trk at Mad Minds AB – a Swedish event management company.https://www.madminds.se/ The company board consists of Charlotte's mother, Karin Lindström, and Charlotte's husband, Jesper.https://www.allabolag.se/foretag/mad-minds- ab/-/konsulter/2KHUR6WI5YF3I Charlotte is also an active blogger who frequently writes about food and parenting.https://foodjunkie.elle.se/about- me/vegan-lunch-och-underbara-barn/ In Sweden, Charlotte Löwenborg has never spoken publicly about the Australian murder plot i.e. 2007 Hitman Case. == References == Category:1985 births Category:Living people Category:Swedish models Category:Criminals",
 "title": "Charlotte Lindström"
}