{
 "id": "810317",
 "text": "The Texas Senate is the upper house of the Texas Legislature. It has 31 members who each represent one district. They serve for 4-year terms with no term limits. The house meets at the Texas State Capitol in Austin, Texas. The Republican Party currently controls the house.McGuinness, Dylan. Flores defeats Gallego in Senate District 19, San Antonio Express-News, September 19, 2018.Svitek, Patrick. Republican Pete Flores upsets Democrat Pete Gallego in race for Uresti seat, Texas Tribune, September 18, 2018. == Leaders == Position Name Party Residence District Lieutenant Governor/President of the Senate Dan Patrick Republican Houston President Pro Tempore Joan Huffman Republican Houston 17 ==Current composition== Affiliation Party (Shading indicates majority caucus) Party (Shading indicates majority caucus) Total Affiliation Total Affiliation Republican Democratic Total Vacant Begin 2013Democrat Mario Gallegos, Jr. (District 6) died October 16 and was reelected posthumously. 19 11 30 1 March 3, 2013Democrat Sylvia Garcia elected to succeed Gallegos 19 12 31 0 Begin 2015 20 11 31 0 Begin 2017 20 11 31 0 End 2018 21 10 31 0 Begin 2019 19 12 31 0 Latest voting share ===List of members=== District Senator Party Residence First elected Next election County(ies) represented 1 Bryan Hughes Republican Mineola 2016 2020 Bowie, Camp, Cass, Franklin, Gregg, Harrison, Lamar, Marion, Morris, Panola, Red River, Rusk, Smith, Titus, Wood, Upshur 2 Bob Hall Republican Edgewood 2014 2022 Dallas (part), Delta, Fannin, Hopkins, Hunt, Kaufman, Rains, Rockwall, Van Zandt 3 Robert Nichols Republican Jacksonville 2006 2022 Anderson, Angelina, Cherokee, Hardin, Henderson, Houston, Jasper, Liberty, Montgomery (part), Nacogdoches, Newton, Orange, Polk, Sabine, San Augustine, San Jacinto, Shelby, Trinity, Tyler 4 Brandon Creighton Republican The Woodlands 2014† 2020 Chambers, Galveston (part), Harris (part), Jefferson, Montgomery (part) 5 Charles Schwertner Republican Georgetown 2012 2022 Brazos, Freestone, Grimes, Leon, Limestone, Madison, Milam, Robertson, Walker, Williamson 6 Carol Alvarado Democratic Houston 2018† 2020 Harris (part) 7 Paul Bettencourt Republican Houston 2014 2022 Harris (part) 8 Angela Paxton Republican Plano 2018 2022 Collin (part), Dallas (part) 9 Kelly Hancock Republican Fort Worth 2012 2022 Dallas (part), Tarrant (part) 10 Beverly Powell Democratic Fort Worth 2018 2022 Tarrant (part) 11 Larry Taylor Republican Friendswood 2012 2020 Brazoria (part), Galveston (part), Harris (part) 12 Jane Nelson Republican Flower Mound 1992 2020 Denton (part), Tarrant (part) 13 Borris Miles Democratic Houston 2016 2020 Fort Bend (part), Harris (part) 14 Sarah Eckhardt Democratic Austin 2020† 2022 Bastrop, Travis (part) 15 John Whitmire Democratic Houston 1982 2022 Harris (part) 16 Nathan M. Johnson Democratic Dallas 2018 2022 Dallas (part) 17 Joan Huffman Republican Southside Place 2008† 2022 Brazoria (part), Fort Bend (part), Harris (part) 18 Lois Kolkhorst Republican Katy 2014 2020 Aransas, Austin, Burleson, Calhoun, Colorado, DeWitt, Fayette, Fort Bend (part), Goliad, Gonzales, Harris (part), Jackson, Lavaca, Lee, Matagorda, Nueces (part), Refugio, Victoria, Waller, Washington, Wharton 19 Pete Flores Republican Pleasanton 2018† 2020 Atascosa (part), Bexar (part), Brewster, Crockett, Dimmit, Edwards, Frio, Kinney, Maverick, Medina, Pecos, Real, Reeves, Terrell, Uvalde, Val Verde, Zavala 20 Juan Hinojosa Democratic McAllen 2002 2020 Brooks, Hidalgo (part), Jim Wells, Nueces (part) 21 Judith Zaffirini Democratic Laredo 1986 2020 Atascosa (part), Bee, Bexar (part), Caldwell, Duval, Guadalupe (part), Hays (part), Jim Hogg, Karnes, La Salle, Live Oak, McMullen, San Patricio, Starr, Travis (part), Webb, Wilson, Zapata 22 Brian Birdwell Republican Granbury 2010† 2020 Bosque, Ellis, Falls, Frio, Hill, Hood, Johnson, McLennan, Navarro, Somervell, Tarrant (part) 23 Royce West Democratic Dallas 1992 2022 Dallas (part) 24 Dawn Buckingham Republican Horseshoe Bay 2016 2020 Bandera, Bell, Blanco, Brown, Burnet, Callahan, Comanche, Coryell, Gillespie, Hamilton, Kerr, Lampasas, Llano, Mills, San Saba, Taylor (part), Travis(part) 25 Donna Campbell Republican New Braunfels 2012 2022 Bexar (part), Comal, Guadalupe (part) Hays (part), Kendall, Travis (part) 26 Jose Menendez Democratic San Antonio 2015† 2020 Bexar (part) 27 Eddie Lucio Jr. Democratic Brownsville 1990 2020 Cameron, Hidalgo (part), Kenedy, Kleberg, Willacy 28 Charles Perry Republican Lubbock 2014† 2020 Baylor, Borden, Childress, Coke, Coleman, Concho, Cottle, Crane, Crosby, Dawson, Dickens, Eastland, Fisher, Floyd, Foard, Garza, Hale, Hardeman, Haskell, Hockley, Irion, Jones, Kent, Kimble, King, Knox, Lamb, Lubbock, Lynn, Mason, McColluch, Menard, Mitchell, Motley, Nolan, Reagan, Runnels, Sleicher, Scurry, Shackelford, Stephens, Sterling, Stonewall, Sutton, Taylor (part), Terry, Throckmorton, Tom Green, Upton, Ward, Wilbarger 29 José R. Rodríguez Democratic El Paso 2010 2020 Culberson, El Paso, Hudspeth, Jeff Davis, Presidio 30 Pat Fallon Republican Prosper 2018 2022 Archer, Clay, Collin (part), Cooke, Denton (part), Erath, Grayson, Jack, Montague, Palo Pinto, Parker, Wichita, Wise, Young 31 Kel Seliger Republican Amarillo 2004† 2022 Andrews, Armstrong, Bailey, Briscoe, Carson, Castro, Cochran, Collingsworth, Dallam, Deaf Smith, Donley, Ector, Gaines, Glasscock, Gray, Hall, Hansford, Hartley, Hemphill, Howard, Hutchinson, Lipscomb, Loving, Martin, Midland, Moore, Ochiltree, Oldham, Parmer, Potter, Randall, Roberts, Sherman, Swisher, Wheeler, Winkler, Yoakum †Elected in a special election ==References== Category:Politics of Texas Category:State upper houses in the United States Category:Texas Legislature",
 "title": "Texas Senate"
}