{
 "id": "810585",
 "text": "Samuel Little (June 7, 1940 – December 30, 2020) was an American serial killer and serial rapist. He was convicted in 2012 of the murders of three women in California between 1987 and 1989 as well as in 2018 of the murder of a woman in Texas in 1994. Little was an African American who was born in Reynolds, Georgia. He was raised in Lorain, Ohio. He claimed to have killed as many as 93 women, and investigators had evidence that related him to 60 murders. The Federal Bureau of Investigation (FBI) said Little's killed at least 50 people, the largest number of proven cases for any serial killer in United States history. He allegedly murdered women across 19 states over a third of a century ending around 2005. Little was born in Reynolds, Georgia. Little died in prison in Los Angeles County, California on December 30, 2020 at the age of 80. ==Several Known or suspected victiums== Samuel Little claimed to have strangled more than 93 people between 1970 and 2005, though many of his victims' deaths were first ruled as accidental or overdoses. Many of Little's victims' bodies were never found, and the confessions he provided along with a sketch could not be matched to a known missing person. *Homestead, Florida December 31, 1970 Mary Jo Brosley White female, approximately 33. Little provided a sketch of this victim.WashingtonPost *Homestead, Florida 1970-1971 \"Scandinavia Girl\"; Little claimed victium was a nurse and provided a sketch. Possibly Karen O'Donoghue who disappeared from Springfield, Massachusetts July 2,1969. [Body not found] Tampa Bay Times Nov 19,2020 *Miami, Florida Black female, \"Linda\" approximately 22. Little provided a sketch of this victim *Miami, Florida Hispanic female, \"Donna\" 18- 22. remains found April 25, 1971 *Miami, Florida Unnamed black female 1971–72 Possibly affiliated with the Air Force. *Macon, Georgia \"Marianne/Mary Ann\"Approximately 20. This confession was matched to an existing Jane Doe case. *Prince George's County, Maryland Unnamed white female 1972 Approximately 20–25. His confession was matched to a known Jane Doe case. Possibly from Massachusetts. Little provided a sketch of this victim. *Kendall, Florida Unnamed white female 1973 Approximately 45. Possibly from Massachusetts. Both 1973 victims are described to possibly have the first name \"Sarah.\" *New Orleans, Louisiana Sarah Brown 1973 Age unknown. Worked at a local restaurant on Canal Street. *Agatha White Buffalo November 1973 Omaha, Nebraska Native American female, approximately 34. Originally from Rosebud Indian Reservation in South Dakota. Her cold case murder was linked to Little in November 2018.[61] *Unnamed black female 1974 Savannah, Georgia Approximately 22 or 23. Little provided a sketch of this victim *Leola Etta Bryant, 51, was murdered March 1974 in Charleston, South Carolina. In 1977 her remains were found in Goose Creek, South Carolina. Little drew a sketch of the victium calling her \"Leola.\" In October 2024 she was identifiedUnidentied awareness website *Unnamed black female 1974 Cincinnati, Ohio Age unknown. Dumped her body in Columbus, Ohio. Little provided a sketch of this victim. Authorities working on case. *\"Emily\" Mid 1970s Miami, Florida Black female, approximately 23 or 24. Possibly worked at the University of Miami. *Unnamed black female 1975 Knoxville, Tennessee Approximately 25. *Jo\" 1976–79 Granite City, Illinois Black female, approximately 26. May have picked her up in St. Louis, Missouri. Little provided a sketch of this victim. *Unnamed black female 1976–79 East St. Louis, Illinois Age unknown. Possibly picked up in St. Louis, Missouri. *Unnamed black female 1976–79 or 1993 Houston, Texas Age unknown. Little provided a sketch of this victim. *Yvonne Pless 1977 Macon, Georgia Approximately 20. This confession was matched to an existing Jane Doe case *Miami Florida July 1977 Dorothy Gibson. Victium was a 17 year old african-american runaway found dead outside a motel. Until Little's concession another man was convicted and spent over 35 years in prison.Tampa Bay Times Nov 19,2020 *Clara Birdlong 1977 Pascagoula, Mississippi Approximately 35 to 45. Possibly met in Gulfport but native to Pascagoula and worked at Ingalls shipyard. Confession matched an existing Jane Doe case. Little provided a sketch of this victim. Also known as the \"Jackson County Jane Doe\" or \"Escatawpa Jane Doe\", the name used by officers because of where the remains were found. Her remains were identified in 2021 by way of genetic genealogy techniques *Unnamed black female 1977 or 1978 Cleveland, Ohio Unknown age. Authorities are still working on the case. On June 2, 2019, she was identified as a black female and petite, somewhere between 20 and 35 years old. Little dumped her body down a grassy slope, near a fence in a wooded area just off Interstate 271 in Willoughby Hills, Ohio. The body was found in 1983,[44] on March 18 according to the National Missing and Unidentified Persons System (NamUs), and believes she was 17 to 24 years old *Unnamed black female 1977–78 Plant City, Florida Age unknown. Apparently met in Clearwater, Florida. Little provided a sketch of this victim. *Unnamed black female 1977 or 1982 Charleston, South Carolina Approximately 28. Little provided a sketch of this victim. *Annie Lee Stewart, 32, was murdered on October 11, 1981, in Cincinnati, Ohio. Little strangled her and disposed of her body in the woods behind some apartments off Queen Anne Place in Grove City. Little was convicted of her murder on August 23, 2019. *Patricia Parker 1980–81 Dade County, Georgia Approximately 25–30. This confession was matched to a known Jane Doe case. On October 8, 2020, Hamilton County (TN) Sheriff's Department positively identified Patricia Parker by a DNA match. *Unnamed black female 1980–84 Gulfport, Mississippi Approximately 22. *Unnamed black female 1981 Atlanta, Georgia Approximately 35–40. Little provided a sketch of this victim *Unnamed white female 1982 New Orleans, Louisiana Little provided a sketch of this victim. Confession matched to a Jane Doe: White female between 33 and 44 years old. Killed in 1982 *Unnamed black female Autumn 1982 New Orleans, Louisiana 30–40 years old, 5'8\"-5'9\" tall, weighing 160 pounds, with \"honey- colored\" brown skin and medium-length straight hair. He remembers that she was wearing a pretty dress with buttons on the front. Little said they met in a club where she was attending a birthday party with a group of friends and one of her two sisters. Little provided a sketch of this victim. *Melinda \"Mindy\" LaPree 1982 Pascagoula, Mississippi 22, originally from New Hampshire. *Mary Jo Peyton, 21, was murdered sometime in 1984 after she encountered Little at a bar in Cleveland, Ohio. Little claimed that he and Peyton left a bar together and that he then took her to an abandoned factory. He choked her there before throwing her body down a basement staircase. Two workers from a nearby company discovered her dead on July 3, 1984, a few weeks later. Little was convicted of the murder on August 23, 2019. *Unnamed white female 1983–84 Atlanta, Georgia Approximately 26 and may have been from Griffin, Georgia. Little provided a sketch of this victim. *Unnamed female 1984 Near Columbus, Ohio Age unknown. Authorities are still working on the case. Disposed of her body in Northern Kentucky. *Unnamed black female 1984 Atlanta, Georgia Approximately 23–25 and possibly a college student. Little provided a sketch of this victim. *Unnamed black female 1984 San Bernardino, California Approximately 18–23. *Unnamed black female 1984 Fort Myers, Florida Age unknown. *Unnamed black female 1984 Tampa, Florida Age unknown. Little provided a sketch of this victim *Frances Campbell 1984 Savannah, Georgia Approximately 23. Little is suspected of asking Campbell for a date at a bar near the intersection of Montgomery Street and Victory Drive in 1984. Campbell's body was discovered in 1985 on top of a pile of debris from the construction of Interstate 516. Savannah police matched Little's description of Campbell to a missing person's case. A Chatham County, Georgia Grand Jury indicted Little in December 2019 for Campbell's death *Unnamed black female 1987 Los Angeles, California Age unknown. *Unnamed black female 1987 Los Angeles, California Age unknown. *Unnamed black female 1987 Los Angeles, California Approximately 19. *\"Granny\" 1987 Los Angeles, California Black female. Approximately 50. *Unnamed black female 1987 Los Angeles, California Approximately 22 or 23. *Unnamed black female 1987 Los Angeles, California Approximately 26 or 27. Little provided a sketch of this victim. *Unnamed black female 1987 – early 90s Monroe, Louisiana Approximately 24. Little provided a sketch of this victim *Unnamed Hispanic female 1988 or 1996 Phoenix, Arizona Approximately in her 40s. May have been native to the area. Little provided a sketch of this victim. *Carol Linda Alford, 41, was murdered by Little in Los Angeles, California. Authorities discovered Little's first DNA match on her underwear and under her fingernails. On July 13, 1987, her body was discovered in a Los Angeles alley. From the waist down, she was nude. Her daughter recognized her body. She had been strangled to death, an autopsy indicated. She also experienced other wounds, such as a punch-related head injury from blunt force. Little was found guilty of the crime on September 25, 2014. *inda Bennett May 1988 Owenton, Kentucky Age unknown. Possibly picked up from Columbus, Ohio. Little provided a sketch of this victim. 25-year-old white female outside a strip club. He remembers her as being 5'6\" - 5'7\" tall and 130-170 pounds. Little describes her as having short blonde hair and blue eyes with a \"hippie\" appearance. Alleged to have a mother in Miami, Florida In December 2022 \"Jane Doe\" Identified as \"Linda Bennett\" age 38 *Audrey Nelson Everett, 35, was found in a dumpster behind a night club and restaurant in Los Angeles, California, on August 14, 1989. There was nothing found that could be used to identify her body, which was naked from the waist down. She had been repeatedly hit on the head before being forcefully strangled, according to an autopsy. Additionally, she had \"road burns\" that suggested she had been pulled on a hard surface, most likely before she died, as well as a smashed spinal bone, bruises on her belly that were also suggestive of punching, and injuries on her back. According to coroner Dr. Eugene Carpenter's testimony, the woman had serious injuries from strangulation and a stomach injury that showed \"a sign of considerable force.\" He continued, \"these signs of force are the greatest that I have seen in a 27-year practice in a county which has its share of strangulation cases.\" DNA under her fingernails linked Little to the crime, and he was convicted on September 25, 2014. *Guadalupe Apodaca, 46, was found on September 3, 1989, at an abandoned auto repair shop in Los Angeles, California, after a boy kicking a soccer ball against the building peered into the windows and saw her body. Authorities determined that Little kneeled on her chest and strangled her with his hands, causing her to have a seizure. She was nude from the waist down and had blood in her anal cavity as well. DNA linked Little to the crime, and he was convicted on September 25, 2014. *Zena Jones or Priscilla Baxter-Jones July 6, 1990 or 1997 West Memphis, Arkansas Approximately 28 or 29. May have been picked up in Memphis, Tennessee. Samuel Little confessed that he killed this woman and dumped her body in the Mississippi River. Little provided a sketch of this victim. Confession matched to a known Jane Doe case. The family of Zena Maria Jones recognized this sketch as their missing relative who was found on the river bank of the Arkansas River July 28, 1990. Of interest: a man named Anthony Jones stated the sketch resembled his mother, Priscilla Baxter-Jones, who was killed in 1997 *Zena Marie Jones, 30, was a woman found murdered in West Memphis, Arkansas on July 28, 1990, after going missing on July 6 from Memphis, Tennessee. On the Arkansas side of the Mississippi River, close to the shore, and about eight feet from the river's mile marker 722.2, a fisherman discovered the victim. Little admitted to killing her and provided a sketch in 2018. He claimed she was a prostitute who was between the ages of 28 and 29 and that he had picked her up at a Memphis, Tennessee, motel. As a Memphis Police car passed them, he choked her while they were in his car. He then dropped the victim into the river once he entered Arkansas and pulled up to a bridge. On August 23, 2019, he was found guilty of her homicide. She was identified in April 2022, after her family noticed a resemblance between the composite sketch drawn by Little and Jones. *Alice Denise Duvall June 11, 1991 Los Angeles, California Black female. Approximately 40–45 *Rose Evans, 32, was murdered in Cleveland, Ohio on or around August 24, 1991. Little encountered Evans while driving and offered her a ride. Then, in an abandoned area, he strangled her in his car before dumping her body in a lot and covering it with two tires. He was convicted of her murder on August 23, 2019. *Unnamed black female 1991–92 Los Angeles, California Approximately 20–22. May have been from San Francisco *Unnamed black female 1992 Los Angeles, California Age unknown. *Unnamed black female 1992–93 Los Angeles, California Age unknown. Little provided a sketch of this victim. *Unnamed Hispanic female 1992–93 Los Angeles, California Approximately 24 or 25. May have been from Phoenix. *Perry Flordia Ruby Dean Lane May 4, 1993. Age 19, Missing from a party; remains found 2000. Identiefied 2014Ruby Lane *Unnamed black female 1993 Las Vegas, Nevada Dark-skinned woman who was approximately 40 years old. She was about 5'5\" tall and 110–120 pounds. Little believed the woman had naturally short hair but wore a long-haired wig (as depicted in his drawing). He remembered the woman pointing out her son, a black male who was approximately 19–23 years old *Denise Christie Brothers, 32, was a mother of two who was found killed in Odessa, Texas on February 2, 1994. Brothers had been reported missing on January 1, 1994. According to District Attorney Bobby Bland, she had been strangled. Little pleaded guilty to killing her, receiving his fourth life sentence for it on December 13, 2018. *Unnamed black female April 21, 1994 North Little Rock, Arkansas Age unknown. (24 years old, 5'5\" - 5'7\" tall, and approximately 200 pounds. Name possibly \"Ruth\") *Jolanda Jones 1994 Pine Bluff, Arkansas Age 26. *Unnamed black female 1996 Los Angeles, California Approximately 23–25. *\"T-Money\" 1996 Los Angeles, California Black female. Approximately 23 or 24. *Unnamed white female 1996 Los Angeles, California Approximately 23–25. Little provided a sketch of this victim *Unnamed black female 1996 Los Angeles, California Approximately 25. *Ann\" 1997 Phoenix, Arizona White female, age unknown. Little provided a sketch of this victim. ==References== Category:1940 births Category:2020 deaths Category:African- American people Category:American burglars Category:American rapists Category:American serial killers Category:American thieves Category:Criminals from Ohio Category:People from Georgia (U.S. state) Category:People who died in prison custody in the United States",
 "title": "Samuel Little"
}