{
 "id": "810657",
 "text": "\"\" (; \"the Day of Wrath\") is a Latin chant first written by either Thomas of Celano of the Franciscans (1200–c.1265) or Latino Malabranca Orsini (d. 1294), lector at the Dominican studium at Santa Sabina, in Rome. It comes from at least the 13th century, but it could be much older. Some have said it was written by St. Gregory the Great (died 604), Bernard of Clairvaux (1090–1153), or Bonaventure (1221–1274). It is a poem in Medieval Latin with accentual stress and rhymed lines. The metre is trochaic. It is about the Last Judgment. It is known for being used at the Requiem (funeral mass). The first melody to these words is used a lot in musical literature. Many recent movies like The Shining and The Lion King have used it. ==Text== Sources: Stanza Original Approved adaptation Formal equivalence valign=top align=center Dies iræ, dies illa Solvet sæclum in favilla, Teste David cum Sibylla. Day of wrath and doom impending. David's word with Sibyl's blending, Heaven and earth in ashes ending. The day of wrath, that day will dissolve the world in ashes, David being witness along with the Sibyl. valign=top align=center Quantus tremor est futurus, Quando Judex est venturus, Cuncta stricte discussurus! Oh, what fear man's bosom rendeth, When from heaven the Judge descendeth, On whose sentence all dependeth. How great will be the quaking, when the Judge is about to come, strictly investigating all things. valign=top align=center Tuba mirum spargens sonum, Per sepulchra regionum, Coget omnes ante thronum. Wondrous sound the trumpet flingeth; Through earth's sepulchres it ringeth; All before the throne it bringeth. The trumpet, scattering a wondrous sound through the sepulchres of the regions, will summon all before the throne. valign=top align=center Mors stupebit et natura, Cum resurget creatura, Judicanti responsura. Death is struck, and nature quaking, All creation is awaking, To its Judge an answer making. Death and nature will marvel, when the creature will rise again, to respond to the Judge. valign=top align=center Liber scriptus proferetur, In quo totum continetur, Unde mundus judicetur. Lo, the book, exactly worded, Wherein all hath been recorded, Thence shall judgement be awarded. The written book will be brought forth, in which all is contained, from which the world shall be judged. valign=top align=center Judex ergo cum sedebit, Quidquid latet apparebit: Nil inultum remanebit. When the Judge his seat attaineth, And each hidden deed arraigneth, Nothing unavenged remaineth. When therefore the Judge will sit, whatever lies hidden will appear: nothing will remain unpunished. valign=top align=center Quid sum miser tunc dicturus? Quem patronum rogaturus, Cum vix justus sit securus? What shall I, frail man, be pleading? Who for me be interceding, When the just are mercy needing? What then shall I, poor wretch [that I am], say? Which patron shall I entreat, when [even] the just may [only] hardly be sure? valign=top align=center Rex tremendæ majestatis, Qui salvandos salvas gratis, Salva me, fons pietatis. King of Majesty tremendous, Who dost free salvation send us, Fount of pity, then befriend us! King of fearsome majesty, Who gladly saves those fit to be saved, save me, O fount of mercy. valign=top align=center Recordare, Jesu pie, Quod sum causa tuæ viæ: Ne me perdas illa die. Think, kind Jesu! – my salvation Caused Thy wondrous Incarnation; Leave me not to reprobation. Remember, merciful Jesus, that I am the cause of Thy journey: lest Thou lose me in that day. valign=top align=center Quærens me, sedisti lassus: Redemisti Crucem passus: Tantus labor non sit cassus. Faint and weary, Thou hast sought me, On the Cross of suffering bought me. Shall such grace be vainly brought me? Seeking me, Thou rested, tired: Thou redeemed [me], having suffered the Cross: let not such hardship be in vain. valign=top align=center Juste Judex ultionis, Donum fac remissionis, Ante diem rationis. Righteous Judge, for sin's pollution Grant Thy gift of absolution, Ere the day of retribution. Just Judge of vengeance, make a gift of remission before the day of reckoning. valign=top align=center Ingemisco, tamquam reus: Culpa rubet vultus meus: Supplicanti parce, Deus. Guilty, now I pour my moaning, All my shame with anguish owning; Spare, O God, Thy suppliant groaning! I sigh, like the guilty one: my face reddens in guilt: Spare the imploring one, O God. valign=top align=center Qui Mariam absolvisti, Et latronem exaudisti, Mihi quoque spem dedisti. Through the sinful woman shriven, Through the dying thief forgiven, Thou to me a hope hast given. Thou who absolved Mary, and heard the robber, gave hope to me also. valign=top align=center Preces meæ non sunt dignæ; Sed tu bonus fac benigne, Ne perenni cremer igne. Worthless are my prayers and sighing, Yet, good Lord, in grace complying, Rescue me from fires undying. My prayers are not worthy: but O Thou, [who art] good, graciously grant that I be not burned up by the everlasting fire. valign=top align=center Inter oves locum præsta. Et ab hædis me sequestra, Statuens in parte dextra. With Thy sheep a place provide me, From the goats afar divide me, To Thy right hand do Thou guide me. Grant me a place among the sheep, and take me out from among the goats, setting me on the right side. valign=top align=center Confutatis maledictis, Flammis acribus addictis, Voca me cum benedictis. When the wicked are confounded, Doomed to flames of woe unbounded, Call me with Thy saints surrounded. Once the cursed have been silenced, sentenced to acrid flames: Call me, with the blessed. valign=top align=center Oro supplex et acclinis, Cor contritum quasi cinis, Gere curam mei finis. Low I kneel, with heart's submission, See, like ashes, my contrition, Help me in my last condition. [Humbly] kneeling and bowed I pray, [my] heart crushed as ashes: take care of my end. valign=top align=center Lacrimosa dies illa, Qua resurget ex favilla, Judicandus homo reus. Huic ergo parce, Deus: Ah! that day of tears and mourning, From the dust of earth returning Man for judgement must prepare him, Spare, O God, in mercy spare him. Tearful [will be] that day, on which from the glowing embers will arise the guilty man who is to be judged. Then spare him, O God. valign=top align=center Pie Jesu Domine, Dona eis requiem. Amen. Lord, all-pitying, Jesus blest, Grant them Thine eternal rest. Amen. Merciful Lord Jesus, grant them rest. Amen. Original Approved adaptation Formal equivalence O tu, Deus majestatis, alme candor Trinitatis nos conjunge cum beatis. Amen. O God of majesty nourishing light of the Trinity join us with the blessed. Amen. O Thou, God of majesty, gracious splendour of the Trinity conjoin us with the blessed. Amen. ==References== Category:13th-century works Category:Catholicism Category:Christian hymns Category:Poems Category:Songs in Latin",
 "title": "Dies irae"
}