{
 "id": "810868",
 "text": "Emma's Theatre is a Canadian-American-British-Israeli computer-animated children's television series. It formerly aired on Kids' CBC in Canada, and Playhouse Disney in the United States between programs from July 10, 2007 to June 9, 2009. It was aired on BabyTV in the United Kingdom, Ireland, Australia, New Zealand, France, Spain, Portugal, Germany, Hong Kong, Switzerland, Singapore, Italy, Latin America, Netherlands, Poland, Russia, Turkey, India, United Arab Emirates, and Israel. The program aims to introduce babies and toddlers to different cultures and to expose them to different places and countries through short stories. The show is produced by PitchiPoy Animation Productions and distributed by Decode Entertainment, a DHX Media company. ==Plot== Each episode begins with multi color sparkles going through Emma's puppet theatre showing her puppets and toys, the logo for the series is formed, and Emma's magical door is created by the sparkles, Emma comes out of her magical door waving to the viewers, her toys and puppets come to life and wave to her, Emma runs to the center of her theatre, and quiets the viewers, Emma then greets the viewers and gives information about the story of the episode, she then puts a map setting of the country on the set of her puppets, along with a house related to the story, Emma then dresses her puppets and introduces the participants (characters in the US dub), Emma then says \"Let's begin!\", and it zooms to the set of the story, the puppets visit a specific country and the tale takes place. During the tale, Emma talks to the younger audiences while she shares and amuses the fun facts about all of the traditions of the country and the customs of a variety of far-away distant countries and cultures. The magical door includes a sky with both night and day, a colorful rainbow, a yellow sun, a white moon, two white clouds, and three green and brown trees. During the end of the story, Emma and her toys give a round of applause by clapping, Emma puts her country map away and it disappears. She then thanks the viewers and tells them that if they’re asking if the story was true or not, the answer is up to them. Her puppets wave goodbye, and so does Emma as she walks out of her magical door, which promptly disappears. ==Characters== * Emma (voiced by Tajja Isen in Canada And US, Teresa Gallagher in the UK, and Rona Bekerman and Sapir Darmon in Israel) is a little 5-year-old girl who loves to put on a variety of puppet shows with her four charming and cute little puppets. * Puppet #1 (voiced by Jordan Francis and Mitchell Eisner in Canada And US, Jan Hayden Rowles in the UK, and Einat Azulay in Israel) is a little male Afro-American puppet with tan skin, dark brown hair and a yellow t-shirt. * Puppet #2 (voiced by Sugar Lyn Beard in Canada And US, Maria Darling in the UK, and Tayla Barkay in Israel) is a little female blonde puppet with fair skin, yellow hair with two pigtails and a pink t-shirt. * Puppet #3 (voiced by Aaryn Doyle in Canada And US, Jo Wyatt in the UK, and Dikla Hadar and Dana Rishfi in Israel) is a little female Afro- American puppet with tan skin, dark brown hair and a red dress. * Puppet #4 (voiced by Connor Price in Canada And US, Preston Oliver and Keith Wickham in the UK, and Dan Kiesler in Israel) is a little male red-headed puppet with fair skin, spiky orange hair and a green t-shirt. == Episodes == Season 1 (2007) # French Baguettes # Italian Pizza # China # Spain # Portugal # Angola # Germany # Luxembourg # Switzerland # British Biscuits # Ireland # Canada # American Marshmallows # Australia # New Zealand # Monaco # Russia # Holland # Belgium # Greenland # Poland # Yemen # India # Egypt # Israel # Country Fair Season 2 (2008) # Mexico # Argentina # Madagascar # Brazil # Hawaii # Philippines # Hong Kong # Japan # South Korea # Greece # Morocco # Iceland # Hungarian Danube # Scotland # Persian Carpet # Monaco # Turkey # Kenya # South Africa # Colombia # El Salvador # Sweden # Norway # Iceland # Danish Crown # Christmas Eve Season 3 (2009) # Nicaragua # Honduras # Ecuador # United States # Venezuela # Chile # Guatemala # Uruguay # Paraguay # Peru # United Kingdom # Bolivia # Belize # Cuba # Costa Rica # Puerto Rico # Guinea International # Dominican Republic # Austria # Anguilla # United Arab Emirates # American Samoa # North Korea # Belgium # Bermuda # Cook Islands == Other websites == * Emma's Theatre on TV.com Category:2000s Canadian television series Category:2000s British television series Category:2007 British television series debuts Category:2009 British television series endings",
 "title": "Emma's Theatre"
}