{
 "id": "81086",
 "text": "Carlos Ray \"Chuck\" Norris (born March 10, 1940) is an American actor, martial artist and celebrity. He served in the United States Air Force. He became famous as a martial artist and started his own school, Chun Kuk Do. Norris was cast in several action movies, such as Way of the Dragon. He was The Cannon Group's star in the 1980s. He played Cordell Walker in the action television series Walker, Texas Ranger from 1993 to 2001. Norris is a political conservative. He has written books on Christianity. In 2007 and 2008, he campaigned for former Arkansas Governor Mike Huckabee, who was running for the Republican nomination for President in 2008. In the 2012 election he endorsed former Speaker of the House Newt Gingrich, and he supported Donald Trump in 2016. Norris also is a columnist for the conservative website WorldNetDaily. == Film == Year Title Role Notes 1968 The Wrecking Crew Man in the House of 7 Joys Uncredited extra 1972 The Way of the Dragon Colt 1973 The Student Teachers Karate Advisor Cameo 1974 Yellow Faced Tiger Chuck Slaughter / Himself 1977 Breaker! Breaker! John David \"J.D.\" Dawes Also fight choreographer 1978 Good Guys Wear Black Major John T. Booker Also martial arts choreographer 1979 A Force of One Matt Logan Also fight choreographer 1980 The Octagon Scott James Also fight choreographer 1981 An Eye for an Eye Detective Sean Kane 1982 Silent Rage Sheriff Daniel \"Dan\" Stevens 1982 Forced Vengeance Chief Joshua Harrin \"Josh\" Randall 1983 Lone Wolf McQuade Ranger Jim \"J.J.\" McQuade 1984 Missing in Action Colonel James Thomas Braddock 1985 Missing in Action 2: The Beginning Colonel James Thomas Braddock 1985 Code of Silence Sergeant Eddie Cusack 1985 Invasion U.S.A. Agent Matt Hunter Also writer 1986 The Delta Force Major Scott McCoy 1986 Firewalker Max Donigan 1988 Braddock: Missing in Action III Colonel James Thomas Braddock Also writer 1988 Hero and the Terror Detective Danny O'Brien 1990 Delta Force 2: The Colombian Connection Colonel Scott McCoy 1991 The Hitman Detective Cliff Garret / Danny Grogan 1992 Sidekicks Himself Limited release; also executive producer 1994 Hellbound Sergeant Frank Shatter 1995 Top Dog Lieutenant Jake Wilder 1996 Forest Warrior Jebediah McKenna Direct-to-video 2003 Bells of Innocence Matthew Limited release 2004 Dodgeball: A True Underdog Story Himself Cameo 2004 Birdie & Bogey Limited release; еxecutive producer only 2005 The Cutter Detective John Shepherd Direct-to-video; also executive producer 2012 The Expendables 2 Booker \"The Lone Wolf\" 2024 Agent Recon Captain Alastair Streaming release TBA Zombie Plane Himself In production == Television == Year Title Role Notes 1970 Room 222 Himself Episode: \"Dreams of Glory\" 1986 Karate Kommandos Himself 5 episodes; voice role 1993 Wind in the Wire Himself Television film; cameo 1993–2001 Walker, Texas Ranger Sergeant Ranger Cordell Walker / Hayes Cooper 196 episodes; also executive producer for 80 episodes and story for 6 episodes 1998 Logan's War: Bound by Honor Ranger Jake Fallon Television film; also story and executive producer 1999 Sons of Thunder Sergeant Ranger Cordell Walker 4 episodes; also executive producer for 6 episodes and creator for 1 episode 2000 Martial Law Sergeant Ranger Cordell Walker Episode: \"Honor Among Strangers\" 2000 The President's Man Agent Joshua McCord Television film; also executive producer 2002 The President's Man: A Line in the Sand Agent Joshua McCord Television film; also executive producer 2003 Yes, Dear Himself Episode: \"Jimmy and Chuck\" 2005 Walker, Texas Ranger: Trial by Fire Captain Ranger Cordell Walker Television film; also executive producer 2007 Inside World Combat League Television film; executive producer only 2015 The Goldbergs Himself Episode: \"Boy Barry\"; voice role 2019 Chuck Norris's Epic Guide to Military Vehicles Television special; executive producer only 2020 Hawaii Five-0 Sergeant Major Lee Phillips Episode: \"A 'ohe ia e loa'a aku, he ulua kapapa no ka moana\"; cameo 2020 TNA Impact! Himself Episode: \"Contenders Beware\" == Video game == Year Title Voice role Notes 2023 Crime Boss: Rockay City Himself == References == ==Related pages== * Chuck Norris facts == Other websites == * Official web site * * Official Chuck Kwon Do Website * Chuck Norris at WorldNetDaily Category:1940 births Category:Living people Category:Actors from Oklahoma Category:American martial artists Category:American movie actors Category:American political activists Category:American screenwriters Category:American television actors Category:American Christian writers Category:Sportspeople from Oklahoma Category:Creationists Category:American Evangelicals Category:Writers from Oklahoma Category:Republicans (United States) Category:Libertarians",
 "title": "Chuck Norris"
}