{
 "id": "8109",
 "text": "James Douglas Muir \"Jay\" Leno (; born April 28, 1950) is an American actor, comedian, producer, writer, television host and television presenter. ==Early life== Leno was born James Douglas Muir Leno in New Rochelle, New York on April 28, 1950. His mother Catherine (née Muir; 1911–1993) was a homemaker. She was born in Greenock, Scotland and came to the United States at the age of 11. Leno's father, Angelo (1910–1994), was an insurance salesman, who was born in New York, to immigrants from Flumeri, Italy. Leno grew up in Andover, Massachusetts and even though his high school guidance counselor recommended that he drop out of school, he later obtained a Bachelor's degree in speech therapy from Emerson College, where he started a comedy club in 1973. Leno's only sibling was his late older brother Patrick, who was a Vietnam veteran and a lawyer. ==Career== ===The Tonight Show=== Leno worked on late night television. He became host of The Tonight Show in 1992 when Johnny Carson retired. In 2007, during the writer's strike, Leno sided with the writers, even though he returned to his show after two months (without the writers besides himself) so that his staff would not be out of work. Despite leading the late-night ratings, he was forced out as host of the Tonight Show in 2009 to make way for Conan O'Brien. On March 1, 2010, became The Tonight Show host once again, because of poor ratings with both himself and Conan O'Brien. Leno hosted his last episode of the Tonight Show on February 6, 2014. ===The Jay Leno Show=== He was a star of a primetime comedy show, The Jay Leno Show, which ran from September 14, 2009 to February 9, 2010. ===Acting=== He guest- starred twice on the Nickelodeon TV series The Fairly OddParents as the Crimson Chin. His character's name uses the fact that Leno has a large and square chin. ==Personal life== Since 1980, Leno has been married to Mavis Leno; they have no children. Leno is dyslexic.Carter, Bill. \"Pushed From Late Night, Leno Is Set for Prime Time\" The New York Times, September 12, 2009. ==References== ==Other websites== * Official Tonight Show with Jay Leno web site * Jay Leno's Car Collection * Jay Leno's Columns at Octane magazine * The New York Times on Leno's affiliation with McPherson College * Live performance videos from the Tonight Show * Category:1950 births Category:Living people Category:Actors from New Rochelle, New York Category:Writers from New Rochelle, New York Category:American movie actors Category:American television talk show hosts Category:Comedians from New York (state) Category:American Emmy Award winners",
 "title": "Jay Leno"
}