{
 "id": "8110",
 "text": "Vancouver is a coastal city and major seaport on the mainland of southwestern British Columbia, Canada. The city has a population of over 630,000 and is the largest city in British Columbia. Metro Vancouver has a population of over 2 million people, which makes it the third-largest metropolitan area in Canada. Vancouver has a mix of people from different cultures, and 52% of its residents have a first language that is not English. == History == Native people began living in this area around 10,000-8,000 years ago. These people were part of three main groups: the Squamish, Musqueam, and Tsleil-Waututh. Vancouver was founded in 1886, and is named after the British naval captain George Vancouver, who explored the area around Vancouver and Vancouver Island in the 1790s. == Cityscape == The University of British Columbia is in Vancouver. Vancouver also has Stanley Park, which has beaches and totem poles. Nearby is Grouse Mountain, which has good skiing and has a 2.9 km (1.8 mi.) hiking trail which is known as the Grouse Grind. Grouse Mountain also has an animal sanctuary, including wolves and bears. The Lions Gate Bridge is also in Stanley Park. == Sports == Vancouver has two ice hockey teams: the Vancouver Canucks, who play for the National Hockey League, and the Vancouver Giants, who play for the Western Hockey League. The BC Lions of the Canadian Football League are based in Vancouver. The team has won six Grey Cups. In soccer, Vancouver is home to the Vancouver Whitecaps FC, who play in the Major League Soccer (MLS). The 2010 Winter Olympics were held in Vancouver, and it was the first time Canada won a gold medal in the Olympics on Canadian soil. == Geography == Vancouver is on a peninsula on the West Coast of Canada, less than a one-hour drive north of the Canada-U.S. border. Between Vancouver and the Pacific Ocean, to the west, is a large island called Vancouver Island. Until the city was named in 1885, \"Vancouver\" referred to Vancouver Island. Some people mistakenly think that the city is on Vancouver Island. On the south shore of Vancouver is the Fraser River, which flows west into the Strait of Georgia. The water along the north shore is called Burrard Inlet. The city has an area of 114 square kilometres (44 sq mi). The larger metropolitan area is 2,878 square kilometres (1,111 sq mi). As with most of British Columbia, Vancouver is in the Pacific Time Zone (UTC−8). === Climate === Vancouver has an oceanic climate (Cfb in the Köppen climate classification). The average precipitation per year is 1189 mm, mostly from October to April. High temperatures in the summer average 22 °C. The highest temperature ever recorded was 34.4 °C on July 30, 2009. On average, snow falls on only 11 days per year. Usually, the snow is wet and not very deep and melts in the rain. On averagem the temperature does not rise above freezing on only 4.5 days a year. ==Housing== Vancouver has had a housing affordability crisis for many years.Douglas Todd: Vancouver's housing crisis four decades in the making It was the second-least affordable housing market compared to 90 other metropolitan areas in different countries. The only place that was less affordable was Hong Kong.Why Ottawa’s attempts to help young Canadians afford housing simply won’t work The coiy has been criticized for saying that it provides many social housing units to residents. However social housing can refer to small apartments renting for $1,700 per month. There are people with household incomes of up to $120,000 living in social housing in Vancouver.Dan Fumano: 'Call it what it is' — Most Vancouver 'social housing' geared to $50,000+ incomes The government has been attempting to address the housing crisis situation by imposing a series of taxes such as the foreign-buyers tax and the Empty Homes Tax in 2016 and the speculation tax in 2018. Rents in Vancouver were very high and apartment vacancies very low in 2019.A desperate housing situation calls for desperate measures == Media == === Television === *CBC Radio *CKGO (730) *CKNO (Knowledge Network) *CIVT (CTV Television Network) === Newspapers === * The Vancouver Sun * The Globe and Mail * The Province * The National Post === Internet Media === * The Tyee * NowPublic * Daily Hive == Notable people == ==Notes== == References == == Other websites == *Official City of Vancouver website *Tourism Vancouver Category:Olympic cities Category:Settlements in Greater Vancouver",
 "title": "Vancouver"
}