{
 "id": "811138",
 "text": "Reagan is a 2024 biographical historical drama movie directed by Sean McNamara. It stars Dennis Quaid and David Henrie as United States President Ronald Reagan. The movie also stars Penelope Ann Miller, Kevin Dillon, Skip Schwink, Mena Suvari, Lesley-Anne Down and Jon Voight in supporting roles. The movie is based on the book The Crusader: Ronald Reagan and the Fall of Communism by Paul Kengor. ==Plot== The movie is about Ronald Reagan's life from his childhood to his years as President of the United States, told by a former KGB agent. ==Cast== *Dennis Quaid as Ronald Reagan **David Henrie as young Ronald Reagan *Penelope Ann Miller as Nancy Reagan *Kevin Dillon as Jack L. Warner *Skip Schwink as Jimmy Carter *Mena Suvari as Jane Wyman *Jon Voight as Viktor Novikov *Lesley-Anne Down as Margaret Thatcher *Cary-Hiroyuki Tagawa as Yasuhiro Nakasone *Robert Davi as Leonid Brezhnev *Scott Stapp as Frank Sinatra ==Music== The movie had some singers perform covers of well known music. Bob Dylan sung Cole Porter's \"Don't Fence Me In\" over the end credits. Gene Simmons covers the 1930s standard \"Stormy Weather\". Clint Black sings John Denver's \"Take Me Home, Country Roads.\" The original score was composed by John Coda. ==Release== The movie was released on August 30, 2024, after being delayed several times. The movie had negative reviews from critics, but more positive reviews from audiences. On Rotten Tomatoes, the movie received a 18% score from critics. However, the audience score is 98%, giving the movie the widest critic to audience score gap of any film on Rotten Tomatoes. The movie earned $7.7 million during its opening three day weekend, and $10.3 million over the four day Labor Day Weekend. Facebook temporarily stopped the movie from advertising on its platform, believing that the ads were trying influence the 2024 United States elections. ==References== ==Other websites== * Category:2024 drama movies Category:2020s biographical movies Category:Movies about Ronald Reagan Category:American biographical movies Category:2020s American drama movies",
 "title": "Reagan (2024 movie)"
}