{
 "id": "811209",
 "text": "The 1972 UEFA Cup Final was the final of the first edition of the UEFA Cup. It was played between English teams Tottenham Hotspur and Wolverhampton Wanderers. This was the first final in UEFA competition where 2 teams from the same country reached the final. ==Road to the final== Note: In all results below, the score of the finalist is given first (H: home; A: away). Wolverhampton Wanderers Round Tottenham Hotspur Opponent Round Agg. 1st leg 2nd leg Opponent Agg. 1st leg 2nd leg Académica 7–1 3–0 (H) 4–1 (A) First round Keflavík 15–1 6–1 (A) 9–0 (H) ADO Den Haag 7–1 3–1 (A) 4–0 (H) Second round Nantes 1–0 0–0 (A) 1–0 (H) Carl Zeiss Jena 4–0 1–0 (A) 3–0 (H) Third round Rapid București 5–0 3–0 (H) 2–0 (A) Juventus 3–2 1–1 (A) 2–1 (H) Quarter-finals UTA Arad 3–1 2–0 (A) 1–1 (H) Ferencváros 4–3 2–2 (A) 2–1 (H) Semi-finals A.C. Milan 3–2 2–1 (H) 1–1 (A) ==Match details== ===First leg=== {| style=\"font-size: 90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Phil Parkes DF 2 Bernard Shaw DF 3 Gerry Taylor MF 4 Danny Hegan DF 5 Frank Munro DF 6 John McAlle MF 7 Jim McCalliog (c) MF 8 Kenny Hibbitt FW 9 John Richards FW 10 Derek Dougan MF 11 Dave Wagstaffe Substitutes: Substitutes: Substitutes: DF 12 Derek Parkin GK 13 Rod Arnold FW 14 Hugh Curran MF 15 Steve Daley FW 16 Peter Eastoe Manager: Manager: Manager: Bill McGarry Bill McGarry Bill McGarry Bill McGarry ===Second leg=== {| style=\"font-size: 90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Pat Jennings DF 2 Joe Kinnear DF 3 Cyril Knowles MF 4 Alan Mullery (c) DF 5 Mike England DF 6 Phil Beal FW 7 Alan Gilzean MF 8 Steve Perryman FW 9 Martin Chivers MF 10 Martin Peters MF 11 Ralph Coates Substitutes: Substitutes: Substitutes: DF 12 Ray Evans GK 13 Barry Daines DF 14 Terry Naylor MF 15 John Pratt MF 16 Jimmy Pearce Manager: Manager: Manager: Bill Nicholson Bill Nicholson Bill Nicholson Bill Nicholson ==Related pages== *1971–72 UEFA Cup ==Other websites== *RSSSF Category:1972 in European football Category:20th century in London Category:1970s in the United Kingdom Category:UEFA Category:Sport in London",
 "title": "1972 UEFA Cup Final"
}