{
 "id": "811499",
 "text": "\"The Musk Who Fell to Earth\" is the 12th episode of the 26th season of The Simpsons. It was first shown on the Fox network on January 25, 2015. Elon Musk is a guest star in the episode. == Story == Elon Musk lands a Dragon 2 in the Simpson family's backyard. Elon tells the family that he is looking for ideas. Homer takes Elon to the power plant he works at. Elon thinks that Homer is able to give him many new ideas. Elon goes to Mr. Burns, the owner of the power plant. He talks to him about adding a machine to the power plant so it can be environmentally friendly. Burns goes through with the idea and tells their town about it. Elon makes many new machines around the town to save or make electrical energy, for example, a Hyperloop and self-driving cars. However, Burns learns that the town will lose $50 million every three months because of the machines. Burns must fire some of his employees at the power plant. Homer is sad because Musk's machines made his friends fired. On the next day, Burns tries to assassinate Elon. Elon stops a bullet from hitting him or hitting Homer. Homer thanks him but says to him that they should not be friends anymore. Elon agrees and starts to go in a rocket. He gives Lisa a birdhouse so that she does not have to be sad. Elon starts the rocket and goes back to outer space. == Production == \"The Musk Who Fell to Earth\" was written by Neil Campbell. Matthew Nastuk is the director of the episode. Elon Musk said that he was a fan of the show. He watched it many times while he was at the University of Pennsylvania. The episode was made after Elon had a meeting with James L. Brooks. Brooks said he wanted to see Elon in fiction. == Reception == 3.29 million people watched the episode when it was first shown on television. Dennis Perkins from The A.V. Club said that the episode is \"more like a love letter to Musk than a proper Simpsons episode.\" He sees the episode as if the writers learned that Elon is a fan of the show and agreed to make an episode about him. == References == == Other websites == * * Category:The Simpsons (season 26) episodes Category:2015 television episodes Category:Elon Musk",
 "title": "The Musk Who Fell to Earth"
}