{
 "id": "8114",
 "text": "Richard Samuel Attenborough, Baron Attenborough, (; 29 August 1923 – 24 August 2014) was an English movie producer, director and actor. == Early life and education == He was born in Cambridge, England. Attenborough left his home when he was 17 to attend the Royal Academy of Dramatic Arts in London. He earned his first West End theatre role, then went to national stardom in the play Brighton Rock. == Career == Attenborough later became a producer and director. He produced and directed the movie Gandhi. Attenborough said that the movie Gandhi was his dream project and waited years to make it. Gandhi won 5 British Academy Awards and 8 American Oscars. In 1983 he won the BAFTA Academy Fellowship Award, a lifetime achievement award. In his movie roles, he is mostly known for his roles in The Great Escape and in Jurassic Park. He was the older brother of naturalist David Attenborough. After years of poor health, Attenborough died in London of heart failure on 24 August 2014, five days before his 91st birthday.Actor, director Richard Attenborough dies at 90 ==His movies== Year Title Credited as Credited as Credited as Credited as Year Title Producer Director Actor Role 1942 In Which We Serve Young Stoker 1943 Schweik's New Adventures Railway worker 1944 The Hundred Pound Window Tommy Draper 1946 Journey Together David Wilton 1946 A Matter of Life and Death An English pilot 1946 School for Secrets Jack Arnold 1947 Brighton Rock Pinkie Brown 1947 The Man Within Francis Andrews 1947 Dancing with Crime Ted Peters 1948 London Belongs to Me Percy Boon 1948 The Guinea Pig Jack Read 1949 The Lost People Jan 1949 Boys in Brown Jackie Knowles 1950 Morning Departure Stoker Snipe 1951 The Magic Box Jack Carter 1951 Hell is Sold Out Pierre Bonnet 1952 Father's Doing Fine Dougall 1952 Eight O’Clock Walk Thomas \"Tom\" Leslie Manning 1952 Gift Horse Dripper Daniels 1955 The Ship That Died of Shame George Hoskins 1956 Private's Progress Pvt. Percival Henry Cox 1956 The Baby and the Battleship Knocker White 1957 The Scamp Stephen Leigh 1957 Brothers in Law Henry Marshall 1958 Dunkirk John Holden 1958 The Man Upstairs Peter Watson 1958 Sea of Sand Brody 1959 The League of Gentlemen Lexy 1959 I'm All Right Jack Sidney De Vere Cox 1959 Danger Within Capt. \"Bunter\" Phillips 1959 Jet Storm Ernest Tiller 1959 SOS Pacific Whitney Mullen 1960 The Angry Silence Tom Curtis 1961 Whistle Down the Wind 1962 Only Two Can Play Probert 1962 The L-Shaped Room 1962 Trial and Error Herbert Fowle 1963 The Great Escape Squadron Leader Roger Bartlett 1964 The Third Secret Alfred Price- Gorham 1964 Séance on a Wet Afternoon Billy Savage 1964 Guns at Batasi Regimental Sgt. Major Lauderdale 1965 The Flight of the Phoenix Lew Moran 1966 The Sand Pebbles Frenchy Burgoyne 1967 Doctor Dolittle Albert Blossom 1968 Only When I Larf Silas 1968 The Bliss of Mrs. Blossom Robert Blossom 1969 The Magic Christian Oxford coach 1969 Oh! What A Lovely War 1970 Loot Inspector Truscott 1970 The Last Grenade Gen. Charles Whiteley 1970 A Severed Head Palmer Anderson 1971 10 Rillington Place John Reginald Christie 1972 Cup Glory Narrator 1972 Young Winston 1974 And Then There Were None Judge Arthur Cannon 1975 Rosebud Edward Sloat 1975 Brannigan Cmdr. Sir Charles Swann 1975 Conduct Unbecoming Maj. Lionel E. Roach 1977 Shatranj Ke Khiladi General Outram 1977 A Bridge Too Far Lunatic wearing glasses 1978 Magic 1979 The Human Factor Col. John Daintry 1982 Gandhi 1985 A Chorus Line 1987 Cry Freedom 1992 Chaplin 1993 Jurassic Park John Hammond 1993 Shadowlands 1994 Miracle on 34th Street Kris Kringle 1996 Hamlet English Ambassador to Denmark 1996 In Love and War 1997 The Lost World: Jurassic Park John Hammond 1998 Elizabeth William Cecil 1999 Grey Owl 1999 Joseph and the Amazing Technicolor Dreamcoat Jacob 2002 Puckoon Narrator 2007 Closing the Ring == References == ==Other websites== * Category:Academy Award winning directors Category:Actors from Cambridgeshire Category:BAFTA Award winners Category:English movie actors Category:English movie directors Category:English movie producers Category:English stage actors Category:English television actors Category:People from Cambridge Category:1923 births Category:2014 deaths Category:Deaths from Parkinson's disease Category:Deaths from heart failure",
 "title": "Richard Attenborough"
}