{
 "id": "811691",
 "text": "The Pennsylvania State Senate is the upper house of the Pennsylvania General Assembly. It has 50 seats and is currently controlled by the Republican Party. Senators are elected for four year terms with no term limits.Article II, section 3, Pennsylvania Constitution. ==Senate leadership== President of the Senate: John Fetterman (D) President Pro Tem of the Senate: Jake Corman (R) Majority party (R) Leadership position Minority party (D) Kim Ward Floor Leader Jay Costa John Gordner Whip Anthony H. Williams Bob Mensch Caucus Chairman Wayne D. Fontana Ryan Aument Caucus Secretary Maria Collett Pat Browne Appropriations Committee Chairman Vincent Hughes Dave Argall Policy Committee Chairman Katie Muth TBD Caucus Administrator John Blake ==Composition== ===Historical sessions=== Affiliation Party (shading indicates majority caucus) Party (shading indicates majority caucus) Total Affiliation Total Affiliation Republican Democratic Total Vacant 1995–1996 session 29 21 50 0 1997–1998 session 30 20 50 0 1999–2000 session 30 20 50 0 2001–2002 session 30 20 50 0 2003–2004 session 29 21 50 0 2005–2006 session 30 20 50 0 2007–2008 session 29 21 50 0 2009–2010 session 30 20 50 0 2011–2012 session 30 20 50 0 2013–2014 session 27 23 50 0 2015–2016 session 30 20 50 0 2016–2017 session 31 19 50 0 2017–2018 session 34 16 50 0 2018–2019 session 28 22 50 0 2019–2020 session 29 21 50 0 ===Current session=== Affiliation Party (shading indicates majority caucus) Party (shading indicates majority caucus) Party (shading indicates majority caucus) Total Affiliation Total Affiliation Republican Ind Democratic Total Vacant End of previous legislature 28 1 21 50 0 Latest voting share ==Membership== The Senate is made up of 50 members who are elected by district. ===List of current members=== District Representative Party Residence Counties represented Term ends First elected 1 Nikil Saval Dem Philadelphia Philadelphia 2024 2020 2 Christine Tartaglione Dem Philadelphia Philadelphia 2022 1994 3 Sharif Street Dem Philadelphia Philadelphia 2024 2016 4 Arthur L. Haywood III Dem Philadelphia Montgomery, Philadelphia 2022 2014 5 John Sabatina Dem Philadelphia Philadelphia 2024 2015 6 Tommy Tomlinson Rep Bensalem Township Bucks 2022 1994 7 Vincent Hughes Dem Philadelphia Montgomery, Philadelphia 2024 1994 8 Anthony H. Williams Dem Philadelphia Delaware, Philadelphia 2022 1998 9 John Kane Dem Birmingham Chester, Delaware 2024 2020 10 Steve Santarsiero Dem Lower Makefield Township Bucks 2022 2018 11 Judy Schwank Dem Fleetwood Berks 2024 2011 12 Maria Collett Dem Lower Gwynedd Township Bucks, Montgomery 2022 2018 13 Scott Martin Rep West Lampeter Township Lancaster 2024 2016 14 John Yudichak Ind. Plymouth Township Carbon, Luzerne 2022 2010 15 John DiSanto Rep Susquehanna Township Dauphin, Perry 2024 2016 16 Pat Browne Rep Allentown Lehigh 2022 2005 17 Amanda Cappelletti Dem Delaware, Montgomery 2024 2020 18 Lisa Boscola Dem Bethlehem Township Lehigh, Northampton 2022 1998 19 Carolyn Comitta Dem West Chester Chester 2024 2020 20 Lisa Baker Rep Lehman Township Luzerne, Pike, Susquehanna, Wayne, Wyoming 2022 2006 21 Scott Hutchinson Rep Oil City Butler, Clarion, Forest, Venango, Warren 2024 2012 22 John Blake Dem Archbald Lackawanna, Luzerne, Monroe 2022 2010 23 Eugene Yaw Rep Loyalsock Township Bradford, Lycoming, Sullivan, Susquehanna, Union 2024 2008 24 Bob Mensch Rep Marlborough Township Berks, Bucks, Montgomery 2022 2009 25 Cris Dush Rep Cameron, Clearfield, Clinton, Elk, Jefferson, McKean, Potter, Tioga 2024 2020 26 Tim Kearney Dem Swarthmore Chester, Delaware 2022 2018 27 John Gordner Rep Berwick Columbia, Luzerne, Montour, Northumberland, Snyder 2024 2003 28 Kristin Phillips-Hill Rep York Township York 2022 2018 29 Dave Argall Rep Rush Township Berks, Schuylkill 2024 2009 30 Judy Ward Rep Hollidaysburg Blair, Cumberland, Franklin, Fulton, Huntingdon 2022 2018 31 Mike Regan Rep Carroll Township Cumberland, York 2024 2016 32 Patrick J. Stefano Rep Bullskin Township Fayette, Somerset, Westmoreland 2022 2014 33 Doug Mastriano Rep Greene Township Adams, Cumberland, Franklin, York 2024 2019Elected in special election on , to fill unexpired term. 34 Jake Corman Rep Benner Township Centre, Huntingdon, Juniata, Mifflin 2022 1998 35 Wayne Langerholc Rep Johnstown Bedford, Cambria, Clearfield 2024 2016 36 Ryan Aument Rep East Hempfield Township Lancaster 2022 2014 37 Devlin Robinson Rep Allegheny, Washington 2024 2020 38 Lindsey Williams Dem West View Allegheny 2022 2018 39 Kim Ward Rep Hempfield Township Westmoreland 2024 2008 40 Mario Scavello Rep Mount Pocono Monroe, Northampton 2022 2014 41 Joe Pittman Rep Indiana Armstrong, Butler, Indiana, Westmoreland 2024 2019Elected in special election on , to fill unexpired term. 42 Wayne D. Fontana Dem Pittsburgh Allegheny 2022 2005 43 Jay Costa Dem Forest Hills Allegheny 2024 1996 44 Katie Muth Dem Royersford Berks, Chester, Montgomery 2022 2018 45 Vacant 46 Camera Bartolotta Rep Monongahela Beaver, Greene, Washington 2022 2014 47 Elder Vogel Rep New Sewickley Township Beaver, Butler, Lawrence 2024 2008 48 Dave Arnold Rep South Lebanon Township Dauphin, Lebanon, York 2022 2020Elected in special election on , to fill unexpired term. 49 Dan Laughlin Rep Millcreek Township Erie 2024 2016 50 Michele Brooks Rep Jamestown Crawford, Erie, Mercer, Warren 2022 2014 ==Notes== ==References== Category:State upper houses in the United States Category:Government of Pennsylvania Category:Pennsylvania General Assembly",
 "title": "Pennsylvania State Senate"
}