{
 "id": "811663",
 "text": "\"Bart's New Friend\" is the 11th episode of the 26th season of The Simpsons. It was first shown on the Fox network on January 11, 2015. In the episode, Homer gets hypnotized and now thinks he is a child. == Story == Homer learns that there is a man at the power plant he works at that does everything that Homer is suppose to do. The man is now retiring and Homer will have to work harder. At his house, he works for a very long time. Marge gets worried that he is working too hard, so she takes the family to a circus. At the circus, the family goes to a hypnotist. The hypnotist makes Homer think that he is 10 years old. Chief Wiggum then tells everyone that the hypnotist is a criminal. At a hospital, Dr. Hibbert tells them that if Homer wants to think right again, they will have to go to the same hypnotist. Homer now lives in Bart's room. Homer tells Bart that he does not want a job or a family when he gets older. Homer becomes Bart's best friend. Marge starts knitting because she is sad that Homer thinks he is a child. However, Homer does many fun activities with Bart and Lisa. Homer and Bart then go to an amusement park. Chief Wiggum has found the hypnotist and brings him and Marge to the park. Marge asks the hypnotist to make Homer show more affection to her. The hypnotist makes Homer back to thinking like an adult again. Homer does not know what happened to him and believes that he was very drunk. At night, Homer tries to tell Bart about the events with him. Homer does not remember that Bart is the person he is talking about. Marge thanks the hypnotist after Homer shows her more affection in bed. == Production == \"Bart's New Friend\" was written by Judd Apatow. Bob Anderson is the director of the episode. Apatow wrote the episode in 1990, 25 years before it was shown on television. The episode first started as a spec script (a screenplay that was not asked for by the show). He wrote spec scripts for many other shows. He gave his script to the writers of The Simpsons, but they did not want it at the time. 25 years later, Al Jean (the executive producer) said to Apatow \"Hey, we'll make it now!\" After the end credits, a picture of Maggie Simpson holding a flag is shown. The flag says \"Je suis Charlie\". This picture was made to remember the people who died in the Charlie Hebdo shooting. == Reception == 4.28 million people watched the episode when it was first shown on television. Dennis Perkins from The A.V. Club said that the episode shows that there is \"no end\" for stories about the family's relationships. Jesse Schedeen from IGN said that the episode is a \"perfectly decent new chapter of the show\" but thought that the episode was not like the episodes from 1990 that Apatow had seen. Dan Castellaneta is the voice actor for Homer. He was nominated for an award at the 67th Primetime Emmy Awards for his voice acting of Homer in the episode. == References == == Other websites == * * Category:The Simpsons (season 26) episodes Category:2015 television episodes",
 "title": "Bart's New Friend"
}