{
 "id": "811688",
 "text": "The Little Prince () is a children's book by the French author Antoine de Saint-Exupéry. It was first published in the United States in English and French in 1943. It was published in France after Saint-Exupéry went missing in 1944. This book is a famous book from France. It is one of the world's best- selling books in history(with over 140 million copies sold) and has been translated into more than 300 languages. The story is about a young prince who visits some planets, including Earth, and thinks about important things in life like friendship and love. == Story == The narrator, who is a grown-up, talks about his childhood. When he was six years old, he read a book about wild animals in the jungle. Then he drew a picture of a snake eating an elephant. However, the grown-ups around him thought he drew a hat. The narrator grew up and became a pilot. One day, his airplane had broken down in the Sahara. He met a little boy called \"The Little Prince\" came from planet B612. He had a problem not understanding his rose, so he traveled to different planets to understand life more. When he arrived on Earth, the little prince met a pilot. The two shared the stories to each other, and they became friends. The Little Prince talked about his love for a rose on his home planet and also his journeys and people he had met. He had a lot of journeys, met a lot of people. Each person represented a different behavior and way of thinking, taught him that important things such as love and relationships cannot be seen with the eyes but must be felt with the heart. The character that helped The Little Prince understand life and love more clearly is Fox. Fox taught him about building relationships and trust, which can be friendship and love. Fox said, \"Building a relationship takes time and care. The time spent building the relationship makes it special. Once you build a relationship with something or someone, you must take care of it and once you build a strong connection, it can hurt.\" He understood that all roses are the same but later he learned, all roses are not the same, it depends on the way you see how special or unique it is. This helped him understand love better and know how special his rose is. At the end, the prince asked a snake to bite him. He said it would look like he was dead, but he would actually go back to his home planet. Then the narrator fixed his airplane and leaves the Sahara. The Little Prince to his love (rose) She's not a general rose; she's the only rose in the universe. Only the heart can see the truth, and it will always stay with me. Category:1943 books Category:French children's books",
 "title": "The Little Prince"
}