{
 "id": "811763",
 "text": "Brestskaya Gazeta () is a non-governmental newspaper from Brest, Belarus. Its first number came on November 18, 2002. The main language of the newspaper and its website is Russian, but some stories are written in Belarusian. Its latest number came on December 30, 2020. It has been writing about the 2020 Belarusian protests and 2020 Belarusian presidential election, so several journalists of the Brest newspaper have been tried and arrested for that. In October 2020, the newspaper joined a common statement by the Belarusian Association of Journalists and private media companies on the troubles of TUT.BY and limits on the use of private websites. The newspaper took a strong civil position against violence in writing about the Belarusian protests. The newspaper started buying and sending its copies to political prisoners. Brestskaya Gazeta printed their answers to its letters in prisons. In late November, it became known that the Brest Regional Printing House, where the newspaper had been printed for 18 years, had said no to printing it starting 2021 for no reason; the fax was signed by Vyacheslav Shakhlevich, chief of the printing house. The United Mass Media requested Shakhlevich, the Brest City and Regional Executive Committees, and the Ministry of Information to make possible to change the decision that created \"troubles for the well liked private regional publication.\" Chief of the Belarusian Association of Journalists Andrei Bastunets said that the troubles made to Brestskaya Gazeta support the government' pressure on the regional news media, as \"the fact that this is happening at the level of economic objects should make anyone foolish.\" To stay away from punishment for not made transportation, it was chosen in time to give up on Belposhta's (Belpost (), Belarusian postal service) subscription services for the first part of 2021. On January 19, 2021, it became known that Brestskaya Gazeta has stopped to be made for now. All printing houses in Belarus had made decisions not to print the newspaper. On July 8, 2021, the office and the houses of its main people were looked for.У рэдакцыі «Брестской газеты», Orsha.eu і баранавіцкага выданьня Intex- Press таксама прыйшлі сілавікі Two days later Brestskaya Gazeta said that all the technical devices (computers. smartphones and tools like that) of its people were taken away. A court in Brest added the newspaper’s website to the list of extremist materials in November 2021, and its Telegram channel in April 2022.Республиканский список экстремистских материалов In 2023, the KGB labeled Brestskaya Gazeta as an extremist group. Participation in an extremist group is a criminal offense under Belarusian law. ==References== Category:2002 establishments in Europe Category:Newspapers in Belarus Category:Websites established in 2002 Category:Censorship in Belarus Category:Brest, Belarus Category:Belarusian websites",
 "title": "Brestskaya Gazeta"
}