{
 "id": "811874",
 "text": "Qwant is a privacy-oriented search engine, originated and hosted in France, and is available in 13 languages. It has over 50 million total visits worldwide. == Search engine == Qwant users can create an account, which allowed them to post on boards using Qwant boards (discontinued). It also allows them to save their preferences. Qwant was first beta tested on 16 February 2013. The stable version was released on 4 July 2013, with an updated version being released on 17 April 2015. On 10 December 2014, child-friendly version of Qwant, called Qwant Junior was beta tested in cooperation with the French Ministry of Education. A stable version was later released. On 5 October 2015, Qwant Lite was released. Qwant Lite is a version of Qwant, specifically made for legacy web browsers. When the Brave web browser was released in 2017, it featured Qwant as one of the default search engines. In 2018, the French government declared that all government web searches are going to be made with Qwant. == Parent company == The self titled company, Qwant SAS was founded in February 2011 by Jean-Manuel Rozan, Éric Leandri and Patrick Constan. It has over 160 employees in Paris, Nice, Ajaccio and Épinal. It also has offices in Germany and Italy.\"Qwant press kit\" (2019). From 2011 to 2014, Qwant SAS acquired a total of €3.5 million. In 2016, the European Investment Bank invested €25 million in Qwant. == Privacy == Qwant offers protections based on the GDPR. Qwant's Privacy Policy says that \"as a principle, Qwant does not collect data about its users when they search\". It claims not to use any cookie nor any other tracking technology. == Reception == The New York Times compared Qwant to Quaero, another search engine made to rival Google. Quaero shut down in 2013. The service received public support from Emmanuel Macron, then Minister of the Economy and Finance and the future President of France. == References == Category:2013 establishments in France Category:French websites Category:Search engines",
 "title": "Qwant"
}