{
 "id": "8118",
 "text": "Robin McLaurin Williams (July 21, 1951 – August 11, 2014) was an American actor and stand-up comedian. He first became famous on the television show Mork and Mindy. He starred in many movies. On August 11, 2014, Williams was found dead in his home. His death was believed to have been a suicide by asphyxiation. ==Early life== Williams was born in Chicago, Illinois on July 21, 1951. His father Robert Fitzgerald Williams (September 10, 1906 – October 18, 1987) worked for Ford Motor Company. His mother Laura McLaurin (née Smith, September 24, 1922 – September 4, 2001) was a former model from New Orleans, Louisiana. His great-great-grandfather on his mother's side was Mississippi senator and governor Anselm J. McLaurin. Williams' ancestors were English, Welsh, Irish, Scottish, German, and French.The Official and Statistical Register of the State of Mississippi, 1908, Pg. 977; \"He [Anselm J. McLaurin] was married at Trenton, Miss., February 22, 1870, to Laura Elvira Victoria Rauch, daughter of John Rauch and wife, Epsilon Rauch, of Trenton, Miss. Mrs. McLaurin's paternal ancestors immigrated to America from Germany; maternal from England and Germany.\" When he was young, Williams lived in Bloomfield Hills, Michigan and in Marin County, California. He studied at Redwood High School and at Claremont McKenna College. He studied to become an actor at the Julliard School in New York City and at the College of Marin. ==Career== After his family moved to Marin County, Williams began his career doing stand-up comedy shows in the San Francisco Bay Area in the mid-1970s. His first performance took place at the Holy City Zoo, a comedy club in San Francisco, where he worked his way up from tending bar to getting on stage. Williams became famous for his role as Mork in the television series Mork & Mindy (1978–1982). His idol Jonathan Winters also appeared in the show. Williams went on to a successful career in both stand-up comedy and movie acting. He acted in the movies The World According to Garp, Good Morning, Vietnam, Dead Poets Society, Awakenings, The Fisher King, Good Will Hunting, Popeye, Hook, Aladdin, Mrs. Doubtfire, Jumanji, The Birdcage, Night at the Museum, and Happy Feet. Williams appeared in the music video for \"Don't Worry, Be Happy\" by Bobby McFerrin. In 2013, Williams starred as President Dwight D. Eisenhower in Lee Daniels' The Butler. Before his death, Williams starred in the short-lived comedy The Crazy Ones. It was cancelled shortly before his death. Once Williams got angry with Disney for using his voice as the Genie in Aladdin to sell merchandise for the movie. Disney tried to apologize to Williams. The Disney company bought a Picasso painting for him. ===Awards=== Williams was nominated for the Academy Award for Best Actor three times. He received the Academy Award for Best Supporting Actor for his performance in Good Will Hunting. He received two Emmy Awards, four Golden Globe Awards, two Screen Actors Guild Awards and five Grammy Awards. ==Personal life== Williams married Valerie Velardi in 1978. They divorced in 1988. In 1989, Williams married Marsha Garces. She divorced him in 2008. Williams married Susan Schneider in 2011. Their marriage lasted until Williams' death in 2014. Williams had a son with Velardi. He had a daughter and son with Garces. His son, Zak Williams, is an actor, businessman, and filmmaker. His daughter, Zelda Williams, is an actress. Williams lived in San Francisco and Paradise Cay in California. ===Health=== Williams was an alcoholic. He was also addicted to cocaine. He had strong depression in the final years of his life. On March 13, 2009, he had surgery to fix an aortic valve.Jones, Kenneth.\"Robin Williams' Spring Broadway Bow Postponed Due to Heart Surgery\", playbill.com, March 5, 2009 The surgery was successful. One month before his death, Williams went to rehab for his alcoholism. Williams' widow stated that he had been diagnosed with early stage Parkinson's disease before his death, but the actor was \"not yet ready to share publicly\" this information. In November 2014, it was revealed that Williams had Lewy body dementia. ==Death== On August 11, 2014 at about 11:45 am, Williams was found at his home by his personal assistant. About ten minutes later, a 911 call was made saying that Williams was not reacting or breathing. He was pronounced dead at 12:02 pm, shortly after emergency personnel arrived. The Marin County Sheriff's department said the cause of death was probably asphyxia by hanging. Williams was also found with cuts on his wrist. Williams was cremated. His ashes were scattered in the San Francisco Bay. On December 16, 2014, it was revealed that, as a result of his death, Williams was the fastest growing search term on Google in 2014.Robin Williams tops 2014 list of Google searches Retrieved 18 December 2014 ==Movies== Title Year Role Director(s) Notes Can I Do It... 'Til I Need Glasses? 1977 Lawyer / Man with Tooth Ache Popeye 1980 Popeye 1982 T.S. Garp 1983 Donald Quinelle Moscow on the Hudson 1984 Vladimir Ivanov Paul Mazursky 1986 Jack Dundee Club Paradise Jack Moniker Seize the Day Tommy Wilhelm Good Morning, Vietnam 1987 1988 King of the Moon Credited as Ray D. Tutto Portrait of a White Marriage Air Conditioning Salesman Uncredited cameo Dead Poets Society 1989 Cadillac Man 1990 Awakenings Shakes the Clown 1991 Mime Class Instructor Cameo Dead Again Hook Peter Banning / Peter Pan FernGully: The Last Rainforest 1992 Batty Koda (voice) The Timekeeper (voice) Circle-Vision 360° film Aladdin Genie and Peddler (voices) John Musker Toys Mrs. Doubtfire 1993 Daniel Hillard / Euphegenia Doubtfire Also producer Being Human 1994 Hector Nine Months 1995 Dr. Kosevich To Wong Foo, Thanks for Everything! Julie Newmar John Jacob Jingleheimer Schmidt Uncredited cameo Jumanji Alan Parrish 1996 Armand Goldman Jack Jack Powell Aladdin and the King of Thieves Genie (voice) Direct-to-video The Professor Uncredited Hamlet Osric Fathers' Day 1997 Dale Putley Deconstructing Harry Mel Flubber Professor Philip Brainard Good Will Hunting Sean Maguire What Dreams May Come 1998 Chris Nielsen Patch Adams Jakob the Liar 1999 Jakob Heym Also executive producer Bicentennial Man Andrew Martin Get Bruce Himself Documentary A.I. Artificial Intelligence 2001 Dr. Know (voice) Cameo One Hour Photo 2002 Seymour \"Sy\" Parrish Death to Smoochy \"Rainbow\" Randolph Smiley Insomnia Walter Finch The Rutles 2: Can't Buy Me Lunch Hans Hänkie Eric Idle TV movie 2004 Alan W. Hakman House of D Pappass Noel Charlie Boyd / The Priest Uncredited Robots 2005 Fender (voice) The Big White Paul Barnell The Aristocrats Himself Paul Provenza Documentary The Night Listener 2006 Gabriel Noone RV Bob Munro Everyone's Hero Napoleon Cross (voice) Daniel St. Pierre Colin Brady Uncredited Man of the Year Tom Dobbs Happy Feet Ramon and Lovelace (voices) Night at the Museum Theodore Roosevelt License to Wed 2007 Reverend Frank August Rush Maxwell \"Wizard\" Wallace World's Greatest Dad 2009 Lance Clayton Shrink Jack Holden Night at the Museum: Battle of the Smithsonian Theodore Roosevelt Old Dogs Dan Rayburn Happy Feet Two 2011 Ramon and Lovelace (voices) The Big Wedding 2013 Father Monighan The Butler Dwight D. Eisenhower The Face of Love Roger Boulevard 2014 Nolan Mack Henry Altmann A Merry Friggin' Christmas Mitch Posthumous release Night at the Museum: Secret of the Tomb Theodore \"Teddy\" Roosevelt & The Garuda Artifact Posthumous release Absolutely Anything 2015 Dennis the Dog (voice) Posthumous release ==Discography== *1979: Reality...What a Concept! *1983: Throbbing Python of Love *1986: A Night at the Met *1987: Good Morning Vietnam Soundtrack *1988: Pecos Bill; narrated a children's book, with music by Ry Cooder *2003: Live 2002; recorded from a tour on Broadway, 2002 *2010: Weapons of Self Destruction; filmed in Washington D.C. during Williams' national tour ==References== ==Other websites== * * * * * \"RWF\" The Robin Williams Fansite! * Robin Williams' Stand Up Comedy Acts a small video collection * Robin Williams Interview (License to Wed) * Robin Williams interview for License to Wed at TheCinemaSource.com Category:1944 births Category:2006 deaths Category:American movie actors Category:American television actors Category:American voice actors Category:Actors from Chicago Category:Actors from California Category:Actors who committed suicide Category:Comedians from Chicago Category:Comedians from California Category:American television writers Category:Movie producers from Chicago Category:Movie producers from California Category:Screenwriters from Chicago Category:Screenwriters from California Category:Television personalities from California Category:Television personalities from Chicago Category:Writers from California Category:Writers from Chicago Category:Best Supporting Actor Academy Award winners Category:Emmy Award winning actors Category:Golden Globe Award winning actors Category:American Grammy Award winners Category:Saturn Award winners Category:Screen Actors Guild Award winners Category:Comedians who committed suicide Category:Suicide in the 2010s Category:Suicides by asphyxiation Category:Suicides in California Category:Writers who committed suicide Category:People with Parkinson's disease Category:People with dyslexia",
 "title": "Robin Williams"
}