{
 "id": "812345",
 "text": "\"Lisa's Sax\" is the 3rd episode of the 9th season of The Simpsons. It was first shown on the Fox network on October 19, 1997. The episode is about how Lisa Simpson got a saxophone. == Story == Homer and Bart try to watch television. They can not hear it because they think Lisa's saxophone is too loud. Bart goes to her room and tries to take it from her. Bart accidentally throws it out of the window. The saxophone gets hit by a car. Lisa gets very sad and does not remember how she got a saxophone. Homer tells her by using a flashback on how she got it. In the flashback, Bart goes to his first day of school. He is sad because school is not going well for him. Homer and Marge go to the school's psychologist. While they are talking about Bart, the psychologist learns that Lisa is very smart. He tells them that they should care for Lisa's smart intelligence. They try to put Lisa in a private school, but it costs too much money. Their town then gets a very big heat wave. Homer tries to save some money to buy an air conditioner. Marge does not want Homer to buy one until they know how to help Lisa. At the school, Bart becomes friends with Milhouse Van Houten and other students because he is humorous. Homer learns that musical instruments are great for a smart child. He uses the money he saved to buy a saxophone for Lisa. After the flashback, Homer buys a new saxophone for Lisa. == Production == \"Lisa's Sax\" is the first episode to be written by Al Jean without someone else. Before this, he would write with Mike Reiss. Jean, Reiss, and David Stern made small changes to the screenplay. This is the 6th episode to be about flashbacks. The first episode that does this is \"The Way We Was\". In that episode, Homer graduates from high school in 1974. This made it not easy to write the time of \"Lisa's Sax\" because the episode is in 1990. Jean thought that the episode was short, so they made Lisa play her new saxophone at the end of the episode. Dominic Polcino is the director of the episode. He thought that the epsiode was easy to direct. At the start of the episode, Policno made a pastel drawing of Krusty the Clown. He said that it is the only drawing he has made for the show all done by him. This is the last episode that has Doris Grau as the voice actor for Lunchlady Doris. She died two years before the episode was first shown on television. Tress MacNeille became the new voice actor for Doris in 2006. == Reception == Warren Martyn and Adrian Wood (authors of I Can't Believe It's a Bigger and Better Updated Unofficial Simpsons Guide) said that it is \"a terrific episode\". They thought it was nice to see Bart younger. Robert Canning from IGN said that the episode is \"very funny\" and that it is \"loaded with Simpson heart.\" Stephen Becker from The Dallas Morning News thought that the 9th season has a \"special affinity for Lisa\". He thought this after seeing this episode, \"Das Bus\", and \"Lisa the Simpson\". The San Diego Union-Tribune said that this episode, \"All Singing, All Dancing\", and \"Trash of the Titans\" are memorable episodes of the show. == References == == Other websites == * * * Category:The Simpsons episodes Category:1997 television episodes",
 "title": "Lisa's Sax"
}