{
 "id": "812617",
 "text": "Windows Whistler is the codename for Windows XP operating system released in 2001. == Development history == === \"Neptune And Odyssey\" === In the late 1990s, initial development of what would become Windows XP was focused on two individual products; \"Odyssey\", which was reportedly intended to succeed the future Windows 2000, and \"Neptune\", which was reportedly a consumer-oriented operating system using the Windows NT architecture, succeeding the MS-DOS- based Windows 98. Based on the NT 5.0 kernel in Windows 2000, Neptune primarily focused on offering a simplified interface. A single build of Neptune, 5111, revealed early work on the activity center concept, with an updated user account interface and graphical login screen, common functions (such as recently used programs) being accessible from a customizable \"Starting Places\" page (which could be used as either a separate window, or a full-screen desktop replacement). It was later confirmed that Microsoft were planning a successor to Neptune known as Triton, although it was originally thought to be a service pack to Neptune. However, the project proved to be too ambitious. Microsoft discussed a plan to delay Neptune in favor of an interim OS known as \"Asteroid\", which would have been an update to Windows 2000 (Windows NT 5.0), and have a consumer-oriented version. At the WinHEC conference on April 7, 1999, Steve Ballmer announced an updated version of Windows 98 known as Windows Millennium, breaking a promise made by Microsoft CEO Bill Gates in 1998 that Windows 98 would be the final consumer-oriented version of Windows to use the MS-DOS architecture. === \"Whistler\" === In January 2000, shortly prior to the official release of Windows 2000, technology writer Paul Thurrott reported that Microsoft had shelved both Neptune and Odyssey in favour of a new product codenamed \"Whistler\". The goal of Whistler was to unify both the consumer and business-oriented Windows lines under a single platform. At WinHEC in April 2000, Microsoft officially announced and presented an early build of Whistler. In June 2000, Microsoft began the technical beta testing process. Whistler was expected to be made available in \"Personal\", \"Professional\", \"Server\", \"Advanced Server\", and \"Datacenter\" editions. At PDC on July 13, 2000, Microsoft announced that Whistler would be released during the second half of 2001, and also released the first preview build, 2250. The build notably introduced an early version of a new visual styles system along with an interim theme known as \"Professional\" (later renamed \"Watercolor\"), and a hidden, early version of a two-column Start menu design. Watercolor was never meant to be the final theme for Whistler; in fact, it has been stated that Microsoft used it as a decoy until they were ready to show Luna. Build 2257 featured the official introduction of the two-column Start menu, and the addition of an early version of Windows Firewall. == Related pages == * Windows XP * Windows 7 * Windows Vista * Windows ME * Windows Neptune * Windows Odyssey == Other websites == * https://microsoft.com/windowsxpupdate * https://microsoft.com/windowsxp Category:Microsoft operating systems",
 "title": "Windows Whistler"
}