{
 "id": "812927",
 "text": "Jordan Terrell Carter (born September 13, 1995), known professionally as Playboi Carti, is an American rapper, singer, songwriter and record producer from Atlanta, Georgia. His rapper name was Sir Cartier because of the luxury brand Cartier then a girl told his he is on some playboi \"stuf\" hence his name Playboi Carti. Carter was initially signed to local underground label Awful Records prior to signing with ASAP Mob's AWGE Label under Interscope Records. He started his own record label and rap collective Opium in 2019. After gaining a cult following early in his career, Sir Cartier became popular in 2017. Carter's first mixtape was released in April 2017. The mixtape included the Billboard Hot 100 charting singles \"Magnolia\" and \"wokeuplikethis* AKA Woke Up Like This\" (featuring Lil Uzi Vert). His first studio album, Die Lit (2018), peaked at number 3 on the US Billboard 200. Following a two-year break with little-to-no new music released, Carter's second album, Whole Lotta Red (2020), debuted at number one on the Billboard 200. It became his first chart- topping release. Then after another break spanning over 5 years, he dropped MUSIC (2025). MUSIC has been cited as a rushed, inconsistent, and sloppy project overall. MUSIC had been in development hell for the last five years leading up to its release, leading it to be pushed back multiple times. MUSIC was also called \"Narcissist\", before changing to \"I AM MUSIC\", and then finally \"MUSIC\" == Discography == * THC: The High Chronicles (2011) * Young Misfit (2012) * Red (2014) * death in tune (2015) * PLAYBOIFRE$H (with Chris Fresh) (2016) * In Abundance (2016) * Playboi Carti (2017) * Die Lit (2018) * WLR: Whole Lotta Red (2020) * 2024: All Red and Timeless (with the Weeknd) * I AM MUSIC (2025) === Singles === * 2011 : Cry * 2012 : Carolina Blue, $TEEZE, Blue Crystal$ * 2013 : $ ZOMB $, Outchea, and 10kk a Couple Thousand$ for the Hoe$ * 2014 : YUNGXANHOE, Heavy, Holyfield, Bag (Interlude), Talk, Lost, #PRAY #4 #ME, Smash, Smash pt. 2, and By Myself / No Help * 2015 : Chill Freestyle, Broke Boi, Mercedez, money counter, count it up, Fetti (featuring Da$h & Maxo Kream), Luh Da Feelin (featuring Slug Christ), Talk (ICYTWAT Remix) (featuring ICYTWAT), Robber (featuring Ethereal), Nobody, Don't Tell Nobody, Ohh, Terror Shit, Beef (featuring Ethereal), PlayboiFre$h Freestyle (featuring Chris Fresh), Sneak Dissin', Run It * 2016 : 3 Chains (featuring Rich the Kid), What (featuring UnoTheActivist), Ghost (featuring Key!), Sauce, Word to Yams, No Pressure (featuring Rich the Kid), Pump Fake (Freestyle), Make Some Blow, and Red Lean. * 2017 : Another Day (featuring Lamb$), Booted Up, Servin & Swervin (featuring HoodRich Pablo Juan), wokeuplikethis* (featuring Lil Uzi Vert), Lookin, Sleeping With My 9, Let It Go, Magnolia, New Choppa, We So Proud Of Him, Black n White, Crumbs (featuring DRAM), and FireArm (featuring Lil Uzi Vert) * 2018 : Molly, All Of Them (featuring Rich the Kid), Bankroll (featuring Lil Uzi Vert), In the Lobby (featuring Sosamann), Lean 4 Real (featuring Skepta), R.I.P., Love Hurts (featuring Travis Scott), Sunshine (featuring Demotus & $onoma), and On Top (featuring Rubi Rose) * 2019 : Kid Cudi / Pissy Pamper, Paid In Full (featuring SAFE), and Left Right (featuring Lil Uzi Vert) * 2020 : Dropped Out, I Took a Walk in the Woods, Now I'm Taller Than the Trees (featuring Lord VZA), @ Meh (Afraamix), Nasty (featuring A1Billionaire), and M3rtamorphosis * 2021 : Miss the Rage (featuring Trippie Redd) and Sky * 2022 : Narcissist and Our De$tiny (featuring ASAP Rocky & Evilgiane) * 2023 : Popular (featuring The Weekend & Madonna), and \"2024\" * 2024:\"Ketam!ne\", \"H00DBYA1R\", BACKR00MS (featuring Travis Scott, Sexisdeath, and Indiana420bitch), and ALL RED ==References== ==Other websites== * Playboi Carti on SoundCloud Category:1995 births Category:African-American rappers Category:Living people Category:African-American singers Category:Rappers from Atlanta Category:Singers from Atlanta Category:American rock musicians",
 "title": "Playboi Carti"
}