{
 "id": "813046",
 "text": "Donald Trump, the 45th President of the United States, was impeached for a second time by the United States House of Representatives on January 13, 2021. This made Trump the only president to be impeached twice. After the impeachment, a trial happened in the United States Senate. It happened after his presidency ended. The Senate voted that Trump was not guilty, with only 57 guilty votes. Over two thirds (67) votes were needed for Trump to be found guilty. ==Background== After the 2021 storming of the United States Capitol by Donald Trump's supporters on January 6, 2021, many government officials said that Trump had told them to do it. Because of this, Members of Congress from both the Democratic Party wanted to remove Trump from his office as President of the United States. Most Republicans still support the President. ==Twenty- fifth amendment== Firstly, they wanted Section 4 of the Twenty-fifth Amendment to the United States Constitution to be used by Vice President Mike Pence, which would remove office from Trump immediately. If he didn't do this, they said they would impeach him in the House of Representatives and convict him in the Senate instead. Section 3 of the Fourteenth Amendment was also talked about. ==Impeachment plans== As of January 8, Democrats planned to push for an impeachment resolution on January 11. By late January 9, it was said that Pence had not ruled out that he might use the 25th Amendment. On January 11, an Article of Impeachment saying that Trump caused the \"lawless action at the Capitol\" began in the United States House of Representatives. On January 13, the House voted to impeach Trump. ===House votes=== Voting results on House Resolution 24 (Impeaching Donald John Trump, President of the United States, for high crimes and misdemeanors) Party Article I (Incitement of insurrection) Yea Nay Present Not voting Democrats (222) Republicans (211) Total (433) 232 197 - 4 Result: Adopted ===Senate votes=== Verdict in Senate Party Article I (incitement of insurrection) Guilty Not guilty Democrats (48) Republicans (50) Independent (2) Total (100) 57 43 Result: Not guilty Result: Not guilty Result: Not guilty Result: Not guilty Result: Not guilty ==Related pages== * First impeachment of Donald Trump ==References== Category:January 2021 events Category:Presidency of Donald Trump Category:February 2021 events Category:2021 United States Capitol attack Donald Trump",
 "title": "Second impeachment of Donald Trump"
}