{
 "id": "813066",
 "text": "Amnon Rubinstein (, 5 September 1931 – 18 January 2024) was an Israeli legal scholar, politician, and columnist. He was a member of the Knesset between 1977 and 2002. He was born in Tel Aviv. After serving as a captain in the IDF, he studied economics, international relations, and law at the Hebrew University of Jerusalem and was called to the bar in 1963. He received a PhD in law from the London School of Economics in 1966. Between 1961 and 1975 he worked as a professor of law at Tel Aviv University, serving as faculty dean from 1968 until 1973. Rubinstein was a member and leader of the Shinui party. He was a member of the Shimon Peres and Yitzhak Rabin cabinets. Rubinstein was Minister of Communications from 1984 to 1987. He was Minister of Science, Technology and Space in 1992. From 1992 to 1993, he was Minister of National Infrastructures, Energy and Resources. From 1993 to 1996, he was Minister of Education, Culture and Sport. In 2006, Rubinstein won the Israel Prize, for law.Stroke keeps legendary goalkeeper from Israel Prize fete Haaretz, 4 May 2006 Rubinstein died on 18 January 2024 in Tel Aviv at the age of 92. ==Published works== *Israel and the Family of Nations: The Jewish Nation State and Human Rights, 2008 *The Constitutional Law of the State of Israel *Upholding morality *From Herzl to Rabin: The Changing Image of Zionism *Daat Yachid' *Jurisdiction and Illegality: A Study in Public Law *Absence of Government: How to Mend Israel's Broken System *Academic Flaws – Freedom and Responsibility in Israeli Higher Education *The Blanket *Route no. 5 *The Sea Above Us *The Black Sun : Kotarim International Publishing *\"The Curious Case of Jewish Democracy\", Azure: Ideas for the Jewish Nation 41 (Summer 2010) ==References== Category:1931 births Category:2024 deaths Category:Alumni of the London School of Economics Category:Columnists Category:Members of the Knesset Category:Government ministers of Israel Category:Hebrew University of Jerusalem alumni Category:Academics of Tel Aviv University Category:Israeli journalists Category:Lawyers from Tel Aviv Category:Jewish Israeli politicians Category:Jewish Israeli writers Category:Jurists Category:Meretz politicians Category:Politicians from Tel Aviv Category:Writers from Tel Aviv",
 "title": "Amnon Rubinstein"
}