{
 "id": "813076",
 "text": "Slash-and-burn is a farming technique that has been used for thousands of years. Usually at the start of the dry season, a plot of land is cleared of its vegetation. Very often, this is done manually, for example using machetes. This can take a long time, clearing a hectare can take up to 120 hours of work. If the land is to be used for crops that last more than two years, the roots need to be cleared as well. Usually this is not done for annual plants. The plants cleared are left to dry, often for weeks. When they are dry enough, they are burnt. The ash that is created makes the soil fertile. Weeds, and other pests have also been eliminated, so the field can be used for agriculture. After three to five years, the extra fertility is gone, and the farmer usually moves to another field (or again uses slash-and-burn). == Problems == While the technique is very simple, it also has problems: Often, fires created get out of control, and more land is burned than necessary. That way, a territory the size of Belgium burned down in a fire, created in 1989, in the state of Roraima in Brazil. In general, there are few large fires in the rainforest. the climate is very wet, and rivers block the fires. In southeast Asia, between May and October, many people have health problems because of the clouds of smoke. During that time, slash-and-burn operations happen in Indonesia. These fires are responsible for the clouds. Millions of people use slash-and-burn agriculture, often as a way of subsistence farming. For this reason, the practice cannot be outlawed. Some steps can be taken ot lessen the impact on the ecosystem: * Improving soils, for example with charcoal. see also terra preta. * Adding fast-growing tree species to the primary forest. These trees grow faster than the primary forest. * Instead of burning it, the biomass can be cut into small pieces, and left to rot. * Using the forest on multiple layers: In the lower layers, for example bananas, in the upper layers: coconuts; alternative: wheat, and citrus fruit or palm trees. == Images == Fires aqua sumatra 14oct04.jpg | Sumatra, Indonesia Slash and burn in DRC.jpg | Kimpese, Democratic Republic of the Congo Bolivia slash & burn lo (4386225275).jpg | Santa Cruz, Bolivia Slash and Burn Agriculture, Morondava, Madagascar.jpg | Morondava, Madagascar Slash And Burn, Isalo National Park.jpg | Isalo National Park, Madagascar An example of slash and burn agriculture practice Thailand.jpg | Chiang Mai, Thailand Jhum fire.jpg | Arunachal Pradesh, India ==Related pages== *Fire-stick farming Category:Agriculture",
 "title": "Slash-and-burn"
}