{
 "id": "813169",
 "text": "Watertown is a city in the U.S. state of New York and the county seat of Jefferson County. It is about south of the Thousand Islands. The Black River flows through the middle of the city. It is about five miles east of where it meets with Lake Ontario. The city of Watertown is surrounded by the town of Watertown to the north, east, and west. The Public Square is in the middle of the city of Watertown. Watertown is 13 miles southwest of a U.S Army base, Fort Drum. As of the 2020 census, 24,685 people lived in Watertown. Thompson Park is a park in the city. The Watertown City School District is the school district in the city. The area was surveyed for the first time by Benjamin Wright in 1796. Watertown had its first residents in 1798. The first people to live in Watertown chose Watertown because of the water power that the Black River gave. Watertown legally became a settlement on March 14, 1800. The city became the county seat of Jefferson County in 1805. Watertown was incorporated as a village in 1816, and became a city in 1869. In the 21st century, Watertown is a big part of upstate New York. Watertown has a lot of business with visitors from Canada, because the city is only away from the border of Canada. Watertown, South Dakota was named after the city. == History == === Name === Watertown was named because of the Black River, which flows through the city. It is not known who chose the name of Watertown, but most people think that the early settlers had an agreement. The name was chosen so that mills would be built. By 1850, Watertown and places next to Watertown had a lot of mills in them. === 1700s and 1800s === Alexander Macomb purchased the land of Jefferson, Lewis, St. Lawrence, and Oswego county in 1791. Alexander Macomb sent surveyors to sell the land to settlers who passed by. The area was surveyed for the first time by Benjamin Wright in 1796. After returning, Benjamin Wright said: The first people to live in Watertown, Hart Massey, Henry Coffeen, and Zachariah Butterfield, built cabins on the area that is now the public square in 1798 while migrating from New England after the Revolutionary War. When the settlers first surveyed Watertown, the land in the area was rocky and uncleared. The western end of the Public Square was about higher than the western end. The middle of the square had a depression that was said to be big enough for a big skating rink. The settlers chose to live in Watertown because of the water power that the Black River gave. The area of Watertown was taken from the nearby town of Mexico on March 14, 1800. On March 1, 1801, Hart Massey moved his wife and three children into the cabins. In 1805, settlers cleared out the center of the town to create the public square. Many buildings were built next to the public square in the 19th and 20th centuries, and the public square was made a historic district on the National Register of Historic Places on September 7, 1984. The city became the county seat of Jefferson County in March 1805 when part of Oneida County became Jefferson County. When Watertown became the county seat, it was one of the smallest places in the county. Watertown was incorporated as a village in 1816, and became a city in 1869. ==== The Great Fire ==== On May 13, 1849, a fire destroyed most of public square and three surrounding streets, and a lot of the square had to be rebuilt. The fire killed one person, and destroyed almost all of the businesses in the city. The fire destroyed three banks, a post office, three printing offices, two hotels, and thirty shops. It costed $250,000, about $7,529,000 today, to fix the damage. While rebuilding in 1853, the city made two parks in the middle of the square, with a fountain in the middle. === 20th century === Little Trees were invented in Watertown in 1951, and the headquarters of Little Trees is also in Watertown. In the 1960s through the 1990s, New York destroyed many historic buildings, like the Woodruff Hotel and the old courthouse. In the 1980s, unemployment in the area went up by 20%. In the 21st century, the city is an important part of a large area. In 2006, the city spent $7.4 million dollars to restore multiple buildings and also fixing roads and walkways. The city completed the project in 2008, but more fixes are planned. In early 2019, Watertown was said to be the \"Least Politically Prejudiced Place in America\" by Amanda Ripley. == Geography == Watertown is in upstate New York. The city of Watertown is about south of the Thousand Islands, northwest of Albany, and northwest of New York City. The area of Watertown was taken from the nearby town of Mexico on March 14, 1800. The town of Watertown is a lot bigger than the city. The town of Watertown is large, and the city is large. == People == The North Country has a lot of Amish people because there is a lot of cheap rural area. === 2000 Census === In 2000, there were 26,705 people living in the city of Watertown. 89.13% of the people were White, 4.95% of the people were Black or African American, 3.59% of the people were Hispanic or Latino, 0.54% of the people were Native American, 1.16% of the people were Asian, 0.11% of the people were Pacific Islander, 1.67% of the people were from other races, and 2.45% from two or more races. 11,036 households, and 6,500 families living in the city. The population density was . There were 12,450 housing units at an average density of . === 2010 Census === In 2010, there were 27,023 people living in the city. 86.25% of the people were White, 6.04% of the people were African American, 5.59% of the people were Hispanic or Latino, 0.58% of the people were Native American, 1.83% of the people were Asian, 0.18% of the people were Pacific Islander, 1.33% of the people were from other races, and 3.79% from two or more races. === 2020 Census === In 2020, there were 24,685 people living in the city of Watertown. There were 10,867 houses with 43.3% of the houses having people living in them. The population density was 2,996.0 people per square mile (4821.5/km2). 83.8% of the people were White, 8.5% were Black or African American, 1.0% were Native American, 1.5% were Asian, 7.8% were Hispanic or Latino, 0.1% were Pacific Islander, and 4.4% were two or more races. 8.7% of the people were under 5 years old. 23.6% of the people were under 18 years old; 53.8% of the people were between 18 and 64 years old. 13.9% were 65 or older. 50.2% of the people were men, and 49.8% of the people were women. 20.9% of the people had a Bachelor's degree or higher. == Economy == In 2020, the average price of a house was $133,400, and the average income for a household being $40,253. 21.6% of the people who lived in Watertown were in poverty. Much of Watertown's economy is from visitors from Canada, because it is only around away from the border of Canada. In the 1980s, unemployment in Watertown grew 20%, and property values started to drop very fast. When Fort Drum started, Watertown started to make consumer products instead of industrial products. === Factories === Factory Square is of abandoned factories above the black river that used hydropower. The factories were built in the 1880s and 1890s, which made the population and economy boom. In the year 1900, 3,760 people were hired to work in the factories. There was a district with a lot of saloons next to Factory Square. The district had a lot of fraud from factory workers going to the saloons after work. The Watertown Daily Times sometimes wrote about factory workers being scammed by \"tin-horn gamblers and short-card men\". == Government == The city's government was made after Watertown became a village in 1816. The fire department was also made. In 1852, the borders of the village grew. The police departments in the city are the Watertown Police Department and the Jefferson County Sheriff's Office. == Buildings and Transport == The tallest building in Watertown is the Dulles State Office Building. The city of Watertown and the town of Watertown both use Watertown International Airport. === Historic buildings === Some buildings on the National Register of Historic Places are the Paddock Mansion (added on December 11, 1979), the Watertown Masonic Temple (added on January 23, 1980), and the Emerson Place (added on April 18, 2003). There are 58 buildings inside the Public Square (added on September 7, 1984). ==References== === Citations === * * * * * * == Further reading == * == Other websites == * * * Category:County seats in New York (state) Category:Cities in New York (state)",
 "title": "Watertown, New York"
}