{
 "id": "813294",
 "text": "The 1988–90 North American drought was a weather problem that lasted two years. The drought began in 1988 in the Midwestern United States, High Plains and the Northeastern United States. A number of high pressure areas set themselves up over several parts of these areas, restricting thunderstorms from developing. During the spring of 1988, Milwaukee, Wisconsin had 55 days straight without any precipitation. In the summer, two record-setting heat waves developed, similar to 1934, 1936 and 1983–85. The constant heat waves led to as many as 17,000 deaths in the United States. During the summer of 1988, the drought led to a number of wildfires in western North America. That included the Yellowstone fires of 1988. At its peak, the drought covered 45% of the United States in 1988 alone. That's less area than the Dust Bowl, which covered 70% of the United States. But the Drought of 1988 caused $60 billion in damage. That not only is the most expensive drought in the history of the United States, it was the costliest natural disaster before Hurricane Katrina seventeen years later. The drought destroyed crops nationwide. Lawns went brown. A number of cities ordered water restrictions. More than four inches of helpful rain came to the Midwest through Hurricane Gilbert. The storm crossed Texas and Oklahoma as a tropical depression. It spread rain as far as the Great Lakes. Other locations, however, were at -6 or lower on the Palmer Drought Severity Index by early autumn 1988. Dry conditions continued into 1989 and 1990, affecting Iowa, Nebraska, Minnesota,Illinois, Colorado, Kansas and Missouri. The 1988–90 drought caused damage comparable to Hurricane Andrew in August 1992 and Hurricane Katrina in August 2005. ==References== Category:Droughts Category:1988 in the United States Category:1989 in the United States Category:1990 in the United States Category:1980s in Canada Category:1980s in weather Category:1990s in weather",
 "title": "1988–90 North American drought"
}