{
 "id": "813853",
 "text": "Yashwantrao Balwantrao Chavan (12 March 1913 – 25 November 1984) was an Indian politician. He served as the Deputy Prime Minister of India from 1979 to 1980. He was a strong Congress leader. He is also co-operative leader, social activist and writer. He was popularly known as Leader of Common People. ==Early life== Yashwantrao Chavan was born in a Maratha-KunbiJadhav, V., 2006. Elite politics and Maharashtra's Employment Guarantee Scheme. Economic and Political Weekly, pp.5157-5162.family on 12 March 1913 in the village of Devrashtre in Satara District (now in Sangli District) of Maharashtra, India. He had three siblings. Chavan lost his father in his early childhood and was brought up by his uncle and mother. Chavan was an active participant in the struggle for independence of India. As a schoolboy in Karad in 1930, he was fined for his participation in the Non-cooperation Movement led by Mahatma Gandhi. In 1932, he was sentenced to 18 months in prison for hoisting the Indian flag in Satara. ==Death and legacy== Yashwantrao Chavan died of a heart attack on 25 November 1984 in Delhi. He was aged 71 years. ===Legacy=== * Yashwantrao Chavan holds the record of being the only Maharashtrian leader. He held the 4 most important post in the Union government. They are Home, External Affairs, Defence and Finance. * When Yashwantrao was appointed Federal Defence minister following the China war in 1962, a popular saying arose in Maharashtra- \"हिमालयाच्या हाकेला धावला सह्याद्री\" (\"Himalayachya Hakela Dhavla Sahyadri\"), translated in English, Sahyadri (the mountain range that separates Konkan from the Deccan Plateau) came rushing on the call (for help) by the Himalaya. * During the 1960s and early 70s when Yashwantrao was at the peak of his power and influence, he was called Pratishivaji or New Shivaji. ===Yashwantrao Chavan Pratishtan (Foundation)=== *In 1985, soon after his death,Yashwantrao Chavan Pratishtan (Foundation) was established in Bombay. *In 2010, The Pratishtan instituted a corpus at the Institute for Defence Studies and Analyses (IDSA) for the conduct of an annual Y B Chavan Memorial lecture. Yashwantrao was the founding President of IDSA. The inaugural lecture in 2010 was delivered by Prof. Sunil Khilnani. Prof. Kanti Bajpai, and Ambassador Kanwal Sibal delivered the 2011 and 2012 lectures respectively ===Places named after Yashwantrao Chavan=== *In 1980, Ujjani Back water named Yashwant Sagar on Bhima River village Ujjani in Solapur district. *In 1984, an engineering college named Yeshwantrao Chavan College of Engineering was established in Nagpur. *In 1989, an open university named 'Yashwantrao Chavan Maharashtra Open University' was established at Nasik in Maharashtra. The expressway between Pune and Mumbai is named after him as are the auditoriums in the Kothrud suburb of Pune, at Nariman Point in Mumbai and the Town Hall in Karad. *Yashwantrao Chavan Memorial hospital in Sant Tukaram Nagar area of Pimpri is named after him. *Shivaji University, Kolhapur has established 'Yashwantrao Chavan School of Rural Development'. * In 2009, the Mumbai Pune Expressway, India's first Express-Way, was named Yashwantrao Chavan Mumbai-Pune Express-Way. ==References== |- |- |- |- |- |- |- Category:1913 births Category:1984 deaths Category:Politicians from Maharashtra Category:Indian Deputy Prime Ministers Category:People of British India",
 "title": "Yashwantrao Chavan"
}