{
 "id": "814090",
 "text": "Costco Wholesale Corporation (), which is Costco for short, is an American operator of discount stores known as warehouse clubs or wholesale clubs. Abundance of products are sold with deeply discounted prices to club members who need to pay annual membership fees. Costco is based in Issaquah, Washington and one of the largest retailers in the world. == History == Costco has a history of over 40 years. Date back to 1976, Sol Price, a pioneer in warehouse club retailing, opened the first Price Club which an airline hangar was remodeled in San Diego, California. In 1983 Jeffrey H. Brotman and James D. Sinegal opened the first Costco in Seattle, Washington. Ten years later, The Price Company and Costco merged into Price/Costco. They changed it into Costco Wholesale Corporation on October 30, 1999. Costco spread and was constructed in several countries, the United States, Canada, Mexico, Europe, the Far East, and Australia. == Warehouse == In warehouses, gas stations are in most, pharmacies, hearing aid centers, optometrists, eye and sunglass centers, photo processors, and tire garages. In some countries, there are liquor stores. There is a mechanism for Costco. When you enter the warehouse, employees check a membership card. Shopping carts that are used in warehouses are large in size and the paths inside stores are wide so that shopping carts pass easily. Conveyor belts are utilized at checkouts. They enable cashiers to check out mass products smoothly. They don't provide plastic bags, so their own bags or cardboards are needed. After that, employees check receipts to prevent shoplifting and mistakes at the cash before exiting the store. == Products == A variety of products are sold on Costco. For example, groceries, appliances, automotive supplies, sporting goods, jewelry, housewares, health and beauty aids, garments, furniture, office supplies. Products are usually available only in bulk quantities. In addition, there are seasonal products and high quality national and regional brands, and inventory is updated constantly. in addition, it sells Kirkland Signature products such as juice, cookies, coffee, housewares, luggage, garments, and detergent which are Costco's brand. Kirkland Signature products are associated with quality and value to maintain member's satisfaction and Costco's reputation. == Services == Online shopping is available in the US, Canada, UK, Mexico, Korea and Taiwan. Non Costco's members can use this service by means of creating an account. However, certain promotions and steeply discounted items are for just members. If you buy a product online and find that it becomes cheaper than you purchased within 30 days, you can request a Price Adjustment. If you buy a product at a store, you can adjust it in the store or on costco.com. The return policy is applied too. There is a food court indoor or outdoor depending on the stores. Each store has a different menu. Hot dogs with drinks, which is one of the most popular items, pizza, frozen yogurt, Pepsi beverages, baked items (such as the chicken bake), and sandwiches are common menu items. A seasonal menu with curry is sometimes sold. == International locations == There are 782 locations worldwide. * United States and Puerto Rico: 543 * Canada: 100 * Mexico: 39 * United Kingdom: 29 * Japan: 26 * South Korea: 16 * Taiwan: 13 * Australia: 11 * Spain: 2 * Iceland: 1 * France: 1 * China: 1 == References == == Other websites == * Category:1980s establishments in Washington (state) Category:1983 establishments in the United States Category:Supermarkets of the United States Category:Companies listed on NASDAQ Category:Companies based in Washington (state)",
 "title": "Costco"
}