{
 "id": "814070",
 "text": "SLAM DUNK is a manga from Japan. It is about basketball. It was written by Takehiko Inoue and serialized in Weekly Shōnen Jump from 1990 to 1996. This comic caused a big basketball boom in the 1990's. As of August 2018, the cumulative circulation of the domestic series has exceeded 120 million. It was made into 31 comic books and 101 animations. Its animations were broadcast on TV Asahi from 1993 to 1996. The comics have been printed in 17 countries. In 2020, Slam Dunk was voted the third most popular manga in Japan. ==Music== The opening and ending songs were also popular. Sekai ga owaru made wa… /WANDS Kimi ga suki da to sakebitai /BAAD Anata dake Mitsumeteru /Maki Oguro It ended up in comic books for a long time. But recently it was decided that SLAM DUNK would become a movie. === Story === There is a basketball club in a high school. The main character is Hanamichi Sakuragi. He likes girls and fights. He sees that the girls he liked in middle school all liked basketball players. He is angry and did not like basketball. But in high school he falls in love with Haruko Akagi, who says he should play basketball. Hanamichi joins a basketball club/ === Characters === The story takes place in Hanamichi's high school. There is a basketball club called Shohoku Basukebu. The captain is Takenori Akagi. His nickname is \"Gori\" because he looks like a gorilla. He is a third year student who loves basketball and is good at it and at his studies. Kaede Rukawa is a freshman student, like Hanamachi. He has been a famous person at basketball since he was in middle school. He had his own fan club \"Rukawa Sineitai.\" He has a cool personality. Mikinobu Kogure is a third grade student. He does not have special skills. Ryota Miyagi is a second year student. He is a small player but really fast. Ayako is Shohoku Basukebu's manager. She is a cheerful person and sometimes like a mother. Hisashi Mitsui is a third grade student. He was an MVP player in middle school. He is good at three point shooting. He had problems at first but became a good member. Anzai teacher is a coach of Shohoku basketball club. He was called \"white hair devil\" in his youth. He was famous for enthusiasm and his strict practice style. But now, he is called \"white hair Buddha\" because he is kind. ==References== Category:1990s manga",
 "title": "Slam Dunk (manga)"
}