{
 "id": "814064",
 "text": "is a Japanese football player. He plays for the Japan national team. ==Fame== He started with the training organization of the world famous football club FC Barcelona. At that time, he was called “Japanese Messi” and “Left handed Iniesta” because his play style is similar to Lionel Messi and Andrés Iniesta. His number one feature is ball control skill. Due to his great dribbling these nicknames are well-deserved. ==Career before becoming a professional== He began to play soccer at 3 years old. In August 2009, he saw an advertisement saying that Barcelona Camp would be held in Japan and you could play against Barcelona if you could become an MVP there. In April 2010, he participated in a tournament held in Belgium as a Barcelona school selection and was selected as a tournament MVP. After that, he joined the Kawasaki Frontale. In August 2011, he passed the trial match of FC Barcelona’s subordinate organization Cantera and went to Spain. He played soccer in Spain until 2015, but an accident happened and he returned to Japan. And then he joined FC Tokyo’s subordinate organization. In May 2017, he made his debut at a top team. He became the first J-League player born in the 21th century. == Career after becoming a professional == In November 2017, it was announced that he had signed a professional contract with FC Tokyo. He made his first team debut in the match on November 26, and became the third youngest player in J.League history. He transferred to Yokohama F. Marinos for a limited time in order to improve the quality of his performance. He had played there for 5 months. He returned to FC Tokyo in 2019 and played for half a year. Then in June 2019 he moved to Real Madrid's B team. He was promoted to the top team. In the Spanish newspaper Maruka, he was in the first place in the ranking. In August 2019, he transferred to Mallorca for a limited time. In August 2020, it was announced that he transferred to Villarreal for a limited time. And recently it was announced that he would leave Villarreal. ==National team== In May 2017, at the age of 15, Kubo was selected the Japan U-20 national team for 2017 U-20 World Cup. In October 2017, he also played for the Japan U-17 national team for 2017 U-17 World Cup. On June 9, 2019, he debuted for the Japan national team against El Salvador. He also participated 2019 Copa América. ==Career statistics== ===Club=== Nippon Sports Kikaku Publishing inc./日本スポーツ企画出版社, \"J1&J2;&J3;選手名鑑ハンディ版 2019 (NSK MOOK)\", 9 February 2019, Japan, (p. 50 out of 289)Nippon Sports Kikaku Publishing inc./日本スポーツ企画出版社, \"2017 J1&J2;&J3;選手名鑑 (NSK MOOK)\", 8 February 2017, Japan, (p. 82 out of 289) Appearances and goals by club, season and competition Club Season League National cup League cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals FC Tokyo U-23 2016 J3 League 3 0 — — — — — 3 0 2017 J3 League 21 2 — — — — — 21 2 2018 J3 League 10 3 — — — — — 10 3 Total 34 5 — — — — — — 34 5 FC Tokyo 2017 J1 League 2 0 0 0 2 0 — 4 0 2018 J1 League 4 0 0 0 6 1 — 10 1 2019 J1 League 13 4 0 0 3 1 — 16 5 Total 19 4 0 0 11 2 — — 30 6 Yokohama F. Marinos (loan) 2018 J1 League 5 1 1 0 0 0 — 6 1 Real Madrid 2019–20 La Liga 0 0 0 0 — — 0 0 Mallorca (loan) 2019–20 La Liga 35 4 1 0 — — 36 4 Villarreal (loan) 2020–21 La Liga 13 0 1 0 — 5 1 19 1 Getafe (loan) 2020–21 La Liga 18 1 0 0 — 0 0 18 1 Mallorca (loan) 2021–22 La Liga 28 1 3 1 — — 31 2 Real Sociedad 2022–23 La Liga 35 9 2 0 — 7 0 44 9 2023–24 La Liga 9 5 0 0 — 3 0 12 5 Total 42 14 2 0 — — 10 0 56 14 Career total 193 28 8 1 11 2 15 1 230 34 ===International=== Appearances and goals by national team and year National team Year Apps Goals Japan 2019 7 0 2020 4 0 2021 2 0 2022 9 1 2023 5 1 Total 27 2 :Scores and results list Japan's goal tally first, score column indicates score after each Kubo goal. List of international goals scored by Takefusa Kubo No. Date Venue Opponent Score Result Competition 1 10 June 2022 Noevir Stadium Kobe, Kobe, Japan 3–1 4–1 2022 Kirin Cup 2 15 June 2023 Toyota Stadium, Toyota, Japan 3–0 6–0 2023 Kirin Challenge Cup ==Honours== Individual *La Liga Player of the Month: September 2023 *UEFA La Liga Revelation Team of the Year: 2019–20 *Japan Pro-Footballers Association awards: Best XI (2022)Japan Pro-Footballers Association awards *Real Sociedad Player of the Season: 2022–23 ==References== ==Other websites== * Category:2001 births Category:Living people Category:Footballers from Kanagawa Prefecture Category:Japan international footballers Category:J1 League players Category:J3 League players Category:FC Tokyo players Category:FC Tokyo U-23 players Category:Yokohama F. Marinos players Category:Association football forwards Category:Association football midfielders Category:Kawasaki Frontale players Category:2022 FIFA World Cup players",
 "title": "Takefusa Kubo"
}