{
 "id": "814114",
 "text": "Amy Renee Heidemann Noonan (born April 29, 1986), known professionally as Qveen Herby, is an American rapper, singer and songwriter. She was a part of the pop music duo, Karmin. She has released ten EPs and one studio album. == Career == === 2010–2016: Rising as Karmin === Qveen Herby began her musical career as a member of pop duo Karmin, with her now-husband Nick Noonan. The pop duo was signed with Epic Records and released their debut extended play: Hello, on May 7, 2012. After the release of their debut EP, the pop duo released their full-length studio album called, Pulses, on March 24, 2014. After the conclusion of promotion for their debut album, the pop duo left Epic Records and began releasing music independently. The duo released their second studio album, Leo Rising, on September 9, 2016. === 2017–2020: Long Live the Qveen === In 2017, all of Karmin's social media was rebranded to Qveen Herby and a small preview stating, \"Karmin Is Dead, Long Live the Qveen.\" was posted. Qveen Herby formally announced her solo career as well as her debut extended play, EP 1. Although her husband, Nick, was still involved in the project as a producer. The meaning behind her name is by combining her nickname, Qveen, which was given to her in college, alongside with Herby, the mascot of the Nebraska Cornhuskers, she later realized that \"Herby\" means \"Warrior\". After the release of EP 1, Qveen Herby began releasing a series of extended plays, which in total consists of 9 EPs. Not only she released EPs, she also released and live EP, a single album, and a compilation in 2020. === 2021–present: A Woman & Mad Qveen === After ending her series of EPs, she released her lead single for debut album named, Juice, on April 16, 2021. After the lead single release, Qveen Herby announced the album title, named A Woman, and the release date on April 27, 2021. On May 21, 2021, A Woman was released, alongside with second single and a music video named, Naughty Girl. In October 2021, Qveen Herby announced a Halloween-themed EP named, Halloqveen. On October 15, 2021, Halloqveen was released and a haunted runway party was set to schedule on October 23. In March 2022, Qveen Herby announced on Instagram a new EP named, Mad Qveen, which is set to be released on April 1st, with a single called, Cruella. == Discography == === Studio albums === Year Album 2021 A Woman === Compilation albums === Year Album 2020 Qveen Essentials === Extended plays === Year Album 2017 EP 1 EP 2 2018 EP 3 EP 4 2019 EP 5 EP 6 EP 7 2020 EP 8 EP 9 2021 Halloqveen 2022 Mad Qveen ==References== Category:1986 births Category:Living people Category:American rappers Category:Singers from Nebraska Category:American pop rappers",
 "title": "Qveen Herby"
}