{
 "id": "814389",
 "text": "Shashi Tharoor (born 9 March 1956) is an Indian politician. He is also a writer and retired international diplomat. He has been Member of Parliament, Lok Sabha from Thiruvananthapuram, Kerala, since 2009. He used to be Under- Secretary General of the United Nations. He also tried to become Secretary- General in 2006, but lost to Ban Ki Moon. ==Early life and career== He was born in London, UK. He has raised in India. Tharoor graduated from St. Stephen's College, Delhi in 1975. He got a doctorate in 1978 in International Relations and Affairs from the Fletcher School of Law and Diplomacy, Tufts University. At the age of 22, he was the youngest person at the time to get this honour from the Fletcher School. From 1978 to 2007, Tharoor was a career official at the United Nations, rising to the rank of Under-Secretary General for Communications and Public Information in 2001. He announced his retirement after completing second in the 2006 selection for U.N. Secretary-General to Ban Ki-moon. In 2009, Tharoor began his political career by joining the Indian National Congress. He successfully represented the party from Thiruvananthapuram, Kerala by winning in the Lok Sabha elections. He became a member of parliament at 2009. During the Congress-led UPA Government rule (2004–2014), Tharoor served as Minister of State for External Affairs (2009–2010). He also served as Minister of Human Resource Development (2012–2014). ==References== ==Other websites== * Official website * Dr Shashi Tharoor Official bio-data at Lok Sabha, Parliament of India * Cabinet of Prime Minister Manmohan Singh Prime Ministers Office, Archieved * Shashi Tharoor at United Nations * * Shashi Tharoor collected news and commentary at The Times of India *\"Why in the PM Narenda Modi 'The Paradoxial Prime Minister'?\" Interview with ET Now * * * Category:1956 births Category:Living people Category:Politicians from Kerala Category:Indian National Congress politicians Category:Indian journalists Category:Members of the Lok Sabha Category:Indian diplomats",
 "title": "Shashi Tharoor"
}