{
 "id": "814655",
 "text": "The Premier League Golden Glove is an association football award. It is given to the goalkeeper who has kept the most clean sheets in a Premier League season. In association football, a clean sheet is given to a team's defence or goalkeeper if they prevent their opponents from scoring any goals during a match. For sponsorship reasons, it has been referred to as the Barclays Golden Glove since it was created for the 2004–05 season until the 2015–16 season. Since the 2017–18 season, it is known as the Cadbury Golden Glove. In 2005, the first Premier League Golden Glove was awarded to Petr Čech of Chelsea. Čech's 24 clean sheets in a single season remains the current record. Since 2005, Čech and Joe Hart have won the award the most amout of times, with 4 each. Pepe Reina was the first goalkeeper to win the award back-to-back, winning it in 3 consecutive seasons between 2005 and 2008. Joe Hart later repeated the achievement with Manchester City between 2010 and 2013. During the 2008–09 season, Edwin van der Sar surpassed Čech's previous record of 10 consecutive clean sheets by reaching 14. During his streak, Van der Sar went 1,311 minutes without conceding a goal. In the process, he broke both Čech's Premier League record (1,025 minutes), Steve Death's Football League record (1,103 minutes) and also the all-time league record in Britain (1,155 minutes) for most consecutive scoreless minutes. ==Winners== Key Player Name of the player and number of times they had won the award at that point (if more than one) Indicates multiple award winners in the same season Denotes the club were Premier League champions in the same season Premier League Golden Glove winners Season Player Nationality Club Clean sheets Ref(s) 2004–05 Chelsea 24 2005–06 Liverpool 20 2006–07 Liverpool 19 2007–08 Liverpool 18 2008–09 Manchester United 21 2009–10 Chelsea 17 2010–11 Manchester City 18 2011–12 Manchester City 17 2012–13 Manchester City 18 2013–14 Chelsea 16 2013–14 Arsenal 16 2014–15 Manchester City 14 2015–16 Arsenal 16 2016–17 Chelsea 16 2017–18 Manchester United 18 2018–19 Alisson Liverpool 21 2019–20 Ederson Manchester City 16 ==Awards won by nationality== Country Total 4 4 4 2 1 1 1 ==Awards won by club== Club Total Manchester City 5 Chelsea 4 Liverpool 4 Arsenal 2 Manchester United 2 ==References== Category:Premier League Category:Sports trophies and awards",
 "title": "Premier League Golden Glove"
}