{
 "id": "814726",
 "text": "The Nara Juvenile Prison is a prison which is in Nara, Japan. It was built in 1908 during the Meiji Period. It was used as a prison until 2017. It has been named an Important Cultural Property. It is being rebuilt as a hotel and scheduled to open in 2024. ==History== Architect Keijiro Yamashita designed the former Nara Prison. It was made as part of the Meiji government's plan to be modern. It opened in 1908. In 1910, 935 people were accommodated in this prison although the maximum capacity was 650 people. In 1922, Japan passed the Juvenile Law. The prison was renamed twice in 1922 and 1946. The former Nara prison was renamed \"the Nara Juvenile Prison\" in 1946. Prisoners were between 16 and 26 years old. The prison had education programs so the prisoners would be less likely to commit more crimes after being released from prison. This was the first place in Japan to have a sexual offense recidivism prevention program. There was also a lot of remedial guidance that appealed to individual personalities, such as violence avoidance education, social development education, and hope development courses. Prisoners were also given vocational training for jobs. The Wakakusa Barber Shop was one of these vocational programs. Trained inmates gave haircuts to staff and citizens. In 2017, it was designed as an important cultural asset. It stopped working as a prison in March 31. ==Building== The building has Romanesque architecture and was made of highly fireproof red brick. These bricks were made by prisoners. British stacking was used because it is easy to install and strong. A structure called a Haviland system, in which the prison buildings were spread out in a radial pattern around a watchtower, was used. This helped the guards see what was happening. ==Hotel== The Former Nara Prison stopped working a prison in March 2017 because the buildings were too old. Instead of being knocked down, the government decided to reopen it as a hotel in 2024. The hotel is to be called the Hoshino Resort, a major Japanese inn brand. The hotel was originally scheduled to open in 2021, but the COVID-19 pandemic meant it had to be done later. Hoshino Resort, MUJI, and Solare Hotels and Resorts all plan to work on making the former prison into a hotel. ==References== Category:Prisons in Asia Category:Buildings and structures in Japan Category:Nara Prefecture",
 "title": "Nara Juvenile Prison"
}