{
 "id": "814712",
 "text": "is a Japanese photographer and director. She is known for her brightly colored photographs of flowers, goldfish, and landscapes. ==Early life== Mika Ninagawa was born in 1972 in Tokyo. Her father, Yukio Ninagawa, was a film director, and an actor. He had won many awards and died in 2016 at the age of 80. Also her mother, Tomoko Mayama, is an actress and has appeared in many movies and dramas. ==Career== She graduated from the Faculty of Fine Arts Graphics Design Department at Tama Art University. After graduating from the university, she made her debut as a photographer. After that, at the age of 30, she received an offer of working as a film director from a producer in 2007. Also, she gave birth to her first child in 2007. She made an original brand in 2015. Her work is has bright colors. Many of her works portray humanity and human society very realistically. There are also some works with messages that encourage women. ==Movie director== The most famous movies she directed are Sakuran and Helter Skelter. Sakuran was her first work. It was released in 2007. It was based on a cartoon. She focused on realistically portraying the girl's love affair. It was also screened in Berlin and Hong Kong. Helter Skelter was her second movie released in 2012. It was also based on a cartoon. At that time, she won the Kaneto Shindo Silver Prize. In 2019, she released three more movies: Diner, No Longer Human and Followers. Followers was made for Netflix and distributed in about 190 countries. ==Photographer== She has fascinated many people with her colors that are not similar to others and ways of seeing things. She has held photo exhibitions many times. She held a large photo exhibition in Taipei in 2016, which was visited by a lot of people. In 2000, she won the Kimura Ihei Photo Award, which is famous as the \"Akutagawa Prize in the photography world.\" She publishes numerous photo books. In addition, sometimes shoots album covers and music videos of singers. ==References== Category:1972 births Category:Living people Category:Japanese movie directors Category:Japanese photographers Category:Feminists",
 "title": "Mika Ninagawa"
}