{
 "id": "814705",
 "text": "The red-shanked douc or red-shanked douc langur (Pygathrix nemaeus) is an Old World monkey. It is known for its colorful fur. The red-shanked douc lives in forests in Vietnam and Cambodia. ==Appearance== The adult red-shanked douc is about 61–76 cm tall, and its tail is about 56–76 cm long. It weighs about 8–11 kg. Red-shanked doucs have black hind legs that are red from knee to ankle. They have white hips, tails and forearms, and reddish yellow faces. They have red and black stripes over their eyes. Male red-shanked doucs have white scrotums, red penises and white patches on their bottoms. This makes it easy for humans to tell male and female red-shanked doucs apart. == Range == The red-shanked douc lives in Vietnam and Cambodia. They live as high as 2000 m (6600 feet) up in the mountains. They live in semi-deciduous forests and in primary and secondary rainforests. They live in the middle of to upper levels of the canopy. == Reproduction == Female red-shanked doucs are old enough to mate at 4 years. Male red-shanked doucs are old enough to mate at 4 or 5 years. Red-shanked doucs display before mating. They drop their jaws, wave their eyebrows, and shake their heads at each other. Scientists say the female red-shanked douc always makes the first move. She lies down on a branch and looks over her shoulder at the male. Sometimes he comes to mate with her and sometimes he does not. The red-shanked douc breeds from August to December, and gives birth to one offspring after a gestation period of 6 to 7 months. They are born with their eyes wide open and hang on to their mothers instinctively. Between 8 and 24 months of age, the color of the fur and face changes slowly. They have adult colors at 10 months. Sometimes, adult red- shanked doucs will feed and care for orphaned baby red-shanked doucs. == Diet == The red-shanked douc is awake during the day. It eats leaves that are high in fiber. They prefer to eat small, young and tender leaves. They moreover eat fruit like figs, buds, petioles, flowers, bamboo shoots and seeds. They eat 50 different plant species, however, no animal prey. They eat peacefully together and not quarrel over food. They are known to share food with others. == Behavior == Red-shanked doucs live in groups. They usually live in groups of 4 to 15 relatives. Each group has one or more male and about two females per male. The males tend to dominate over the females. Red-shanked doucs cannot grasp things with their tails. They use their tails for balance instead. They use arms and legs to move through the forest. They follow the same routes. The adult males lead the group, the females and very young doucs are in the middle, and young males go last. When the doucs sense a predator or other danger, they flee very quietly through the trees. They spend most of their time eating, digesting their bulky food, sleeping and grooming each other's fur. They communicate with facial expressions and sounds. The low-pitch grow indicates threat, and short and hash distress squeal. == Threats == As reported by the most recent assessment of IUCN Red List, the red-shanked douc is critically endangered. They are listed in CITES that prohibit international trade. There is no research of the population in Indochina. In Son Tra, Vietnam, the population is approximately 1300 individuals. The most common reason is that they are hunted for substance use and traditional medicine. Moreover local people hunt for food, pets or making glue. ==References== Category:Old World monkeys Category:Mammals of Asia",
 "title": "Red-shanked douc"
}