{
 "id": "814820",
 "text": "Kanglatongbi is a small town in the Imphal West district of the Indian state of Manipur. As of 2011, the total population is 7,152. The average high temperature in Kanglatongbi is 24.3°C (75.7°F) and an average low-temperature of 6.3°C (43.4°F), with January as the coldest month. == Overview == Nation India State Manipur District Imphal West Tehsil Lamshang Elevation 2598 ft (792m) Population (2011) 7152 Languages Spoken Nepali, Hindi, Meeteilon, Naga, and English PIN 795136 Automobile Registration MN-01 Village Pradhan Meena Bista Oopa-Pradhan Deepa Thapa Shantipur Ward Member Narayan Dulal AR Colony Ward Member Deepa Thapa Vijaynagar Ward Member Deepa Thapa HatiKhuwa Ward Member Rudra Oli Mandir Ward Member Sushila Chapagain Tispari Ward Member Shyamu == Battle of Kanglatongbi == It is also known as the “Normandy of the East”. In 1942, Burma (Myanmar) was seized by the Japanese Army after defeating the Commonwealth troops. They placed their forces in Burma, making it their base for the attack on Imphal and Assam to hold the Chinese air forces across the Himalayas. At Kanglatongbi, the unstable positions of the 221 AOD corps blocked the advance of Japanese troops. The situation of 221 AOD was risky and exposed to attacks from all directions. Its defense relied heavily on the courage and bravery of its soldiers. After the battle in Burma, the British armed force moved to Imphal as they found it most practical. The British improved the defenses at Imphal as the 23rd Indian Division positioned in Manipur is prepared and new air runways were developed. In late 1944, the Commonwealth armed forces received additional armies and air force units, effectively improving their military capabilities. Thus, the general hospital became essential in providing primary healthcare services to support the growing armed forces. In the spring of 1944, recognizing the importance of Imphal, Japanese forces launched an attack in Manipur. They bombed Imphal, cut a section of the Imphal-Dimapur road, and continued their attack on Imphal for several months. The Fourteenth Army of the Commonwealth Forces fiercely fought back, blocking the Japanese advance. The siege of Imphal finally ended on June 22, 1944, when British and Indian soldiers from Kohima and Imphal met at Milestone 109. The Japanese forces suffered heavy losses, with nearly 50,000 of their soldiers died in the rough terrain and situation of the area. During the Second World War in the capitals of Kohima and Imphal in India, it is estimated that 65,000 Japanese soldiers died. On the British side, around 17,000 soldiers were killed or injured, while the Allies suffered a total of 12,603 casualties. === Significance of the Battle of Kanglatongbi === In their failed attempt to defeat the Allied forces at Imphal and invade India, the Japanese forces were pushed back into Burma. Lt. Gen. Renya Mutaguchi dismissed many division commanders during the battle. As a result, both Lt. Gen. Renya Mutaguchi and Lt. Gen. Musaku Kawabe were removed from their command. It is considered one of the most decisive and harshest battles of World War II. As the Japanese soldiers retreated, they experienced many problems, including hunger, disease, and exhaustion, which caused a lot of deaths in their troops. This battle is a major turning point and led to further retreat of the Japanese forces. == Geography == Kanglatongbi is located at 24.9666° N, 93.8808° E in Eastern India, with a height of 2600 ft. above sea level. The climate is damp with dry, cool winter days and an average hot storm season. Temperatures in the summer average about 24 to 26°C to down 6.3°C (43.4°F) in the winter. The month of January is the coldest. The village receives about 1, 290 (51 in) of rain, with June as the most rainy month. It is surrounded by two rivers, the Kanglatongbi river to the east near Indira Gandhi National Tribal University, Makhan, and Sekmai river to the west of the village. It is surrounded by Imphal city in the north, through Imphal-Dimapur National Highway no. 2, and Kanglatongbi War Memorial in the south. == Government and politics == The village follows the civic administration of the city which is under Imphal Municipal Corporation, with its district headquarters in Lamphelpat, Imphal, and sub-division in Lamshang. The Gram Panchayat acts as the cabinet of the village. The Panchayat is chaired by the president and vice-president of the village, known as Pradhan and Oopa- Pradhan. The term of the elected delegates is five years. Every five years, a general election takes place in the village. Villagers over the age of 21 can participate to vote. Kanglatongbi is further subdivided into six wards and each ward is represented by respective members. The ward members are elected by the villagers. The village strictly promotes women's empowerment and reserves one-third of the seats for women candidates as well as scheduled castes and tribes. == Demographics == Before the 2011 General Census, the total population of the village is 7152 people. Among them, 52% are female, and 48% are male. The bulk of the population is from the general caste, 8% from the scheduled caste and scheduled tribes. The child population of Kanglatongbi village is 13% under the age of 6-10 years. There are about 1600 houses in the village of Kanglatongbi. === Population === The population of Kanglatongbi experienced an increase of 65.3% between 2001 and 2011. It is expected that the population will continue to grow at a high rate in the 2021 census of India. The female sex ratio as per the former census is 1083 females per 1000 males in the village. The sex ratio in the scheduled caste is 1375, higher than the scheduled tribe and the general caste at 1079 and 1115 respectively. On the other hand, the child-sex ratio has decreased by 21 girls per 1000 boys === Wards === Kanglatongbi village constitutes of six wards: * Shantipur * Assam Rifles (AR) Colony * Hatikhuwa * Tispari * Vijayanagar * Mandir Each ward is governed by its ward member, they work with the Pradhan and Oopa-Pradhan to maintain the village’s welfare, development, socio- economic enrichment, and cultural and safety arrangements. Apart from the Panchayat system, there is another kind of inner-village unit called the women society, a form of committee by the women residents of the village who act to prevent and fight any form of violence in society. There are youth unions, an alliance of young individuals that aims to treasure, preserve, and assist society by encouraging education, sports, and public safety. === Language, Community, and Religion === The majority of the people living in the Kanglatongbi area are the Indian Gorkhas (also Gurkhas) who speak in Nepali, Hindi, Manipuri, and other local dialects. One-third of the population speaks Nagamese, Kuki, Bhojpuri, and English. The main religions are Hinduism and Christianity. 50% of the population are Hindus and the other 40% are Christians whereas the 10% are other inherited religions inhabited by the people of mixed race. == Employment and infastructure == The primary source of income is agriculture. The majority of the villagers are farmers, small and medium business owners, and teachers. There has been rapid progress in many of the young generation and millennials to join the armed forces of India and that adds up to 1/4th of the population serving in the Indian Army and Para- military forces. Most of the women in the Kanglatongbi village are housewives, teachers, small retail shop owners, and only one percent of the women population are employed in the government sectors. With the recent declaration of the Mahatma Gandhi National Rural Employment Guarantee Act, 2005, an initiative by Raghuvansh Prasad Singh, Minister of Rural Development, most of the males and females in the society are taking a significant role in the improvement of the village toward infrastructure development. === Commerce === Currently, Kanglatongbi village has one major public market, the Kanglatongbi Bazaar Board, and the other is outside the jurisdiction of the Village, called Sekmai Bazaar, in Sekmai. The weekly market which rotates around the KPI area occurs in Bazar Board every Saturday where people have the options of buying fresh vegetables, second-hand clothes, meat, and other essential commodities. Kanglatongbi has one operating bank, Punjab National Bank, and one State Bank of India, ATM near Kanglatongbi, Mandir. Kanglatongbi has one post office as the main branch. The Postal code or PIN of Kanglatongbi is 795136 and the post office is located near the Kanglatongbi Mandir. == Temples and churches == There are many temples and few churches as the majority of the residents follow Hinduism. However, that has nothing to do with any form of prejudice, class, and other forms of anti-religion beliefs as Kanglatongbi villagers are well-known for peace, integrity, and unison. Every ward has its main temples, where major festivals like Durga Puja, Diwali, Makar Sankranti, and Krishna Janmashtami are celebrated. Wards in Kanglatongbi Ward Name Temple Shantipur Durga Mandir, Shantipur Vijayanagar Shree-Shree Vishnu Durga Shiva Panchayan. Tispari Durga Mandir, Tispari Mandir Shree-Shree Vishnu Durga Shiva Panchayan. AR Colony Durga Temple, Colony Hatikhuwa Hatikhuwa Mandir Churches in Kanglatongbi Seventh-Day Adventist Church Bazaar Board Hatikhuwa Gorkha Baptist Church Hatikhuwa Tangkhul Baptist Church Tispari Namdilong Baptist Church Namdilong Prakash Sunchuri Church Bazar Board == Tourist attractions == * Kanglatongbi River and Dam, also called by locals “Dang-Dunge Khola” is one of the main centers of attraction for many of the visitors in and out of Manipur. It is famous for its waterfalls, peaceful landscape surrounded by the beautiful Koubru mountains. It also has a lot of trees, clean water, and natural vegetation, with cool weather making it an excellent spot for a picnic, family gatherings, and an adventure. *Kanglatongbi War Memorial cemetery, built to venerate the Ordnance Personnel of 221 Advance Ordnance Depot who made their sacrifice in the line of duty during the Battle of Kanglatongbi between 6 to 7 April 1944. *B.C Restaurant, located in Mandir, nearby the S.B.I ATM serves delicious fast food items. It is a great place to dine. == Transport == The nearest airport is the Tulihal International Airport which is 30 kilometers and has direct flights to Guwahati, Kolkata, and New Delhi. Kanglatongbi is connected by the Main Highway, National Highway 2, also known as Imphal-Dimapur road. The major transport service from Kanglatongbi to Imphal is private and public buses, cars, and a mini-van service. For short distances, cars are commonly used. The only railway line that unites Manipur with other states of India is the Jiribam-Silchar railway which is due for construction. The extension of the railway line is expected to be completed by 2022. After the construction, the distance from Kanglatongbi to Imphal railway station will be estimated at 28 km. == Sports and entertainment == The village serves as a venue for many events, including many tournaments held at the Hindi High School Football ground, located near Vijayanagar. The same ground is also used for hosting other occasions such as music concerts, social gatherings, and meetings. It serves as a space for a range of events that bring the community together. The \"Khasi Tournament\" is the most significant local tournament held yearly in the region before the Durga Puja festival. It is organized by each village ward and typically involves six to ten teams divided into two sides. The players exclusively consist of locals representing their respective villages. Back then, the champions were rewarded with a \"khasi,\" which is a Nepali word for a male goat. This tradition was tied to the practice of sacrificing animals during the Durga Puja festival, observed by Hindus. However, with growing concerns for animal welfare and rights in India, the practice has been stopped by the village elders. The winning team receives trophies and cash prizes instead. Despite the change, the tournament has retained its original name \"Khasi,\" as it has gained popularity and the majority of villagers are content with referring to it as the \"Khasi Tournament.\" The other significant tournament is the All-Manipur Gorkha Football Tournament, held every year in the state of Manipur. This tournament only allows Gorkha players and is a competitive round-robin football tournament. Cricket is another game that is popular in Kanglatongbi. There are many local, inter-village tournaments going on every month. == Education == Kanglatongbi has a high literacy rate as compared to the entire state, of Manipur. This has been possible due to the villagers' awareness of the importance of education in the current world. Many well-known and impressive schools produce toppers, scholars, and excellent education enthusiasts. There are many high schools in the villages, most of them are private institutions, and only one government-funded high school called Hindi High School, located at Vijayanagar, that produced many graduates, serving in the Indian Army. There are many private high schools as well as higher secondary schools affiliated to the Council of Higher Secondary Education, (COHSEM) Manipur, and Central Board of Secondary Education, (CBSE) India. The well-known and top- performing schools are: * Roses English High School *The Froebel English School * Radiant Star Education Center * Olivia Higher Secondary School * Chil-Chil Asian Mission English School There is also a non-profit student organization called the All-Manipur Gorkha Students Union, moderated by the Gorkhas of Manipur to enhance, protect, and support students from any background in any social challenges and education. == Healthcare == The major hospital which serves the villagers in Kanglatongbi is the Regional Institute of Medical Sciences, (RIMS) Imphal which is 26 km away from the village. The other primary health care service is Sekmai Primary Health Care, Sekmai. It is 5 km away from the main village. There are also many privately run clinics in Kanglatongbi as well as local drugstores. == Famous people == * Ajay Chhetri, footballer, Bengaluru FC == References == ==Other websites== Category:Villages in India Category:Settlements in Manipur",
 "title": "Kanglatongbi"
}