{
 "id": "814844",
 "text": "Paul Andrew Schneider (born March 16, 1976) is an American actor. He is best known for playing Mark Brendanawicz on the first two seasons of the NBC television show Parks and Recreation. He also plays Dick Liddil in The Assassination of Jesse James by the Coward Robert Ford. ==Filmography== ===Film=== Year Title Role Notes 1997 Pleasant Grove Bedford Short film 1998 Physical Pinball Short film 2000 George Washington Rico Rice 2003 Security, Colorado Paul Filmed in the Dogme 95 style. 2003 All the Real Girls Paul Writer 2003 Crude Gabe 2004 50 Ways to Leave Your Lover Owen McCabe 2005 Elizabethtown Jesse Baylor 2005 The Family Stone Brad Stevenson 2006 Live Free or Die Jeff Lagrand 2007 The Assassination of Jesse James by the Coward Robert Ford Dick Liddil 2007 Lars and the Real Girl Gus 2008 Pretty Bird Beach Dog Jogger Writer, director 2009 Bright Star Charles Armitage Brown 2009 Away We Go Courtney Farlander 2011 Water for Elephants Charlie O'Brien 2011 The Beloved Henderson 2012 Flowers of War Terry 2012 The Babymakers Tommy Macklin 2013 Hello Carter Aaron 2014 Goodbye to All That Otto Wall 2014 Black Eyed Dog 2014 Straight Men/Same Bed Short film Writer, director, producer 2015 The Daughter Christian 2016 Café Society Steve 2016 Rules Don't Apply Richard Miskin 2020 The Sound of Philadelphia TBA American Murderer David Brown Post-production ===Television=== Year Title Role Notes 2003 Third Watch Thomas Warner Guest role; 3 episodes 2008 Drunk History Vol. 4 William Henry Harrison 1 episode 2009–2010 Parks and Recreation Mark Brendanawicz Main role (seasons 1–2); 30 episodes 2012 The Newsroom Brian Brenner Guest role; 2 episodes 2014 The Divide Clark Rylance Main role; 8 episodes 2016 The Tunnel Artem Baturin Guest role; 4 episodes 2016 Channel Zero: Candle Cove Mike Painter Main role; 6 episodes 2017 Chance Ryan Winter Main role (season 2); 4 episodes 2018 The Assassination of Gianni Versace: American Crime Story Paul Beck 2 episodes 2020 Tales from the Loop George 5 episodes 2020 NOS4A2 Jonathan \"The Hourglass\" Beckett 3 episodes ==Awards and nominations== Year Award Category Work Result 2003 Gotham Awards Breakthrough Actor All the Real Girls 2004 Chlotrudis Awards Best Original Screenplay (shared with David Gordon Green) All the Real Girls 2008 Sundance Film Festival Dramatic Pretty Bird 2009 Alliance of Women Film Journalists Best Supporting Actor Bright Star Hollywood Film Awards Indiewire Critics' Poll Best Supporting Performance Bright Star San Diego Film Critics Society Awards Dramatic Pretty Bird Village Voice Film Poll Best Supporting Actor Bright Star 2010 National Society of Film Critics Awards, USA Best Supporting Actor Bright Star 2012 RiverRun International Film Festival 2014 Tribeca Film Festival Best Actor in a Narrative Feature Goodbye to All That 2017 Fangoria Chainsaw Awards Best TV Actor Channel Zero: Candle Cove ==References== Category:1976 births Category:American movie actors Category:American television actors Category:Living people Category:Actors from North Carolina Category:People from Asheville, North Carolina",
 "title": "Paul Schneider (actor)"
}