{
 "id": "814877",
 "text": "An air fryer is a small convection oven. It is used in a similar manner as deep frying to fry food without using so much oil. Air fryers usually have a removable cooking basket, tray or mesh shelves where you place the food. Air frying differs from traditional baking as they use rapid air technology to transfer the heat from a heating element around the oven faster. This makes the cooking process quicker than normal convection ovens. Air fryers cook food that would normally be cooked in oil or roasted. The air fryer's cooking chamber radiates heat from a heating element near the food. A fan then moves the hot air around the food. The temperature in an air fryer varies depending on the model, but the heating chamber of a typical commercial air fryer can reach 250 degrees Celsius ( 482 degrees Fahrenheit). Air fryers have become a useful kitchen appliance. With them people can make many different foods. These includes crispy French fries and chicken wings. This is done with about 80 percent less oil than deep frying. == Types of air fryer == There are several types of air fryer on the market today for household use. === Paddle === In this type, a paddle machine moves throughout the heating chamber to move the air around more evenly. This is more convenient for the user because other types of air fryers require manual stirring throughout to ensure that all sides are fully cooked. === Cylindrical basket === A cylindrical basket is a small, single function air fryer that includes a drawer with a removable basket. A fan circulates from the top, and the food is cooked through holes in the basket. It can accommodate three quarts (2.8 liters) of food or less on average. Because of its compact size, it preheats faster than other types of air fryers. === Countertop convection oven === Countertop convection ovens come with an air frying feature that work the same way as basket type air fryers. They usually have multiple trays or racks, so multiple things can be cooked at the same time. It holds twenty-six quarts (23.7 liters) of food on average. They are more versatile than single function type because they have multiple features like baking, rotisserie, grilling, frying, broiling, and toasting. === Halogen === This type of air fryer cooks food with a halogen light from above. The heat is spread evenly throughout with a fan like other types of air fryers. This type usually looks like a large glass bowl with a hinged lid because the clear glass works as an easy and fast heat conductor. === Oilless turkey fryer === These are large, barrel shaped air fryers used to cook whole turkeys and other large amount of meat. They circulate air around the drum to cook the turkey evenly. == Invention == === William Maxson === In 1944, William Maxson partnered with the United States Navy to prepare frozen meals on passenger planes. His \"Sky Plate\" cooked up to six meals at the same time and weighed 35 pounds. His design used convection oven technology to circulate hot air around the food. He patented his design in 1949. === Fred Van Der Weij === Fred van der Weij, an inventor from the Netherlands, started developing the modern air fryer in 2005 building on William Maxson's invention.He took three years to develop a prototype, and his fryer, produced by Philips, was introduced in 2010 at the IFA Berlin (Internationale Funkausstellung), a major consumer electronics fair in Berlin. In 2008, Weij requested a patent on his invention which was granted in 2012. == References == Category:Cooking appliances Category:Home appliances",
 "title": "Air fryer"
}