{
 "id": "814824",
 "text": "This article is a discography for American singing group The Ronettes. The Ronettes started recording with Colpix Records in 1961 and recorded eleven songs for Colpix. In March 1963, the group moved to Phil Spector's Philles Records, where they were most successful. ==Albums== ===Studio albums=== Year Title Peak chart position US 1964 Presenting the Fabulous Ronettes featuring Veronica 96 ===Compilation albums=== Year Issued Album title Peak chart position US 1963 Today's Hits (Philles) - 1963 A Christmas Gift for You from Philles Records (Philles) 12 1965 The Ronettes featuring Veronica (Colpix Records) - 1975 The Ronettes Sing Their Greatest Hits (Phil Spector International) - 1976 Phil Spector's Wall of Sound: Rare Masters Vol. 1 (Phil Spector International) \\- 1976 Phil Spector's Wall of Sound: Rare Masters Vol. 2 (Phil Spector International) - 1981 The Ronettes Sing Their Greatest Hits Vol. 2 (Masters) - 1985 The Ronettes: The Colpix Years 1961–1962 (Murray Hill) - 1990 The Ronettes: The Early Years (Rhino) - 1992 The Best of the Ronettes (ABKCO) - 1997 The Ronettes: The Ultimate Collection (Marginal) - 2005 Silhouettes (Collectables) - 2010 Be My Baby: The Very Best of the Ronettes (Legacy) - 2017 Everything You Wanted to Know About The Ronettes ...But Were Afraid to Ask (For Collectors Only) - ==Released singles== Year Titles (A-side, B-side) Label & number Chart positions Album US Hot 100 Cashbox Top 100 UK Singles Chart 1961 \"I Want a Boy\" \"Sweet Sixteen\" Colpix 601 – – – The Ronettes (Featuring Veronica) 1962 \"I'm Gonna Quit While I'm Ahead\" \"I'm on the Wagon\" Colpix 646 – – – 1962 \"I'm Gonna Quit While I'm Ahead\" \"My Guiding Angel\" May 111 – – – 1962 \"Silhouettes\" \"You Bet I Would\" May 114 – – – 1962 \"Good Girls\" \"Memory\" May 138 – – – 1963 \"Be My Baby\" \"Tedesco & Pitman\" (Non-album track) Philles 116 2 1 4 ...Presenting The Fabulous Ronettes Featuring Veronica 1963 \"Baby, I Love You\" \"Miss Joan & Mr Sam\" (Non-album track) Philles 118 24 24 11 1964 \"(The Best Part of) Breakin' Up\" \"Big Red\" (Non-album track) Philles 120 39 48 43 1964 \"Do I Love You?\" \"Bebe & Susu\" (Non-album track) Philles 121 34 36 35 1964 \"Walking in the Rain\" \"How Does it Feel?\" Philles 123 23 20 – 1965 \"Born to Be Together\" \"Blues for Baby\" Philles 126 52 67 – Non-album tracks 1965 \"Is This What I Get for Loving You?\" \"Oh, I Love You\" Philles 128 75 92 – 1965 \"He Did It\" \"Recipe for Love\" Dimension 1046 – – – The Ronettes (Featuring Veronica) 1966 \"I Can Hear Music\" \"When I Saw You\" (from ...Presenting The Fabulous Ronettes) Philles 133 100 – – Non-album tracks 1969 \"You Came, You Saw, You Conquered!\" \"Oh, I Love You\" A&M; 1040 108 92 – 1973 \"Go Out and Get It\" \"Lover Lover\" Buddah 384 – – – 1974 \"I Wish I Never Saw the Sunshine\" \"I Wonder What He's Doing\" Buddah 408 – – – 1976 \"Paradise\" \"When I Saw You\" (from ...Presenting The Fabulous Ronettes) Warner/Spector 409 – – – 2018 \"Sleigh Ride\" – 13 – 33 A Christmas Gift for You from Philles Records ==References== Category:Discographies of American artists discography",
 "title": "The Ronettes discography"
}