{
 "id": "81523",
 "text": "== Events == === Europe === ==== War and politics ==== * February 18 – The Livonian Brothers of the Sword are defeated by Dovmont of Pskov in the Battle of Rakovor. * October 29 – Conradin, the last legitimate male heir of the Hohenstaufen dynasty of Kings of Germany and Holy Roman Emperors, is executed along with his companion Frederick I, Margrave of Baden by Charles I of Sicily, a political rival and ally to the hostile Roman Catholic church. * King Stephen V of Hungary launches a war against Bulgaria. * The county of Wernigerode become a vassal state of the margrave of Brandenburg. * The House of Bourbon first rises to prominence with the marriage of Robert, Count of Clermont to King Louis IX of France's daughter, Beatrice of Burgundy, heiress to the lordship of Bourbon. * New election procedures for the election of the doge are established in Venice in order to reduce the influence of powerful individual families. * Pope Clement IV dies; the following papal election fails to choose a new pope for almost three years, precipitating the later creation of stringent rules governing the electoral procedures. ==== Culture ==== * Nicola Pisano completes the famous octagonal Gothic-style pulpit at the Duomo di Siena. * The carnival in Venice is first recorded. * In France, the use of hops as the exclusive flavoring agent used in the manufacture of beer is made compulsory. * In Slovakia, Guta was founded (currently Kolárovo). === Asia === * May 18 – The Principality of Antioch, a crusader state, falls to the Mamluk Sultan Baibars in the Battle of Antioch; Baibars' destruction of the city of Antioch was so great as to permanently negate the city's importance. * The Battle of Xiangyang, a six-year battle between the Chinese Song Dynasty and the Mongol forces of Kublai Khan, begins in what is today Hubei. * An earthquake in Cilicia kills about 60,000 people. == Births == * Mahaut of Artois (died 1327) * Emperor Duanzong of China (died 1278) * Philip IV of France (died 1314) == Deaths == * October 29 – Conradin, Duke of Swabia (executed) (born 1252) * October 29 – Frederick I, Margrave of Baden (executed) (born 1249) * November 29 – Pope Clement IV * December 9 – Vaisvilkas, Prince of Black Ruthenia * Barral of Baux, Grand Justiciar of Sicily * Henry de Bracton, English jurist * Peter II of Savoy (born 1203)",
 "title": "1268"
}