{
 "id": "815280",
 "text": "Robert W. \"Bo\" Welch III is an American production designer, art director, film and television director and occasional actor. ==Filmography== ;As production designer Year Movie Other notes 1985 The Color Purple Nominated — Academy Award for Best Production Design 1986 Violets Are Blue 1987 The Lost Boys 1988 The Accidental Tourist Beetlejuice 1989 Ghostbusters II 1990 Edward Scissorhands BAFTA Award for Best Production Design Joe Versus the Volcano 1991 Grand Canyon 1992 Batman Returns Nominated — Awards Circuit Community Awards for Best Production Design 1994 Wolf 1995 A Little Princess Nominated — Academy Award for Best Production Design Nominated — Awards Circuit Community Award for Best Art Direction 1996 The Birdcage LAFCA Award for Best Production Design Nominated — Academy Award for Best Production Design Nominated — ADG Award for Excellence in Production Design Nominated — Awards Circuit Community Award for Best Art Direction 1997 Men in Black Nominated — Academy Award for Best Production Design Nominated — ADG Award for Excellence in Production Design 1998 Primary Colors 2000 What Planet Are You From? 2002 Men in Black II 2008 Space Chimps 2009 Land of the Lost 2011 Thor Nominated — Saturn Award for Best Production Design 2012 Men in Black 3 2017–2019 A Series of Unfortunate Events ;As art director Year Film Other notes 1983 The Star Chamber Heart of Steel 1984 Swing Shift Best Defense The Hoboken Chicken Emergency 1985 The Color Purple 1986 Violets Are Blue ;As director Year Film Other notes 1999 Secret Agent Man Series director 2001 The Tick 2 episodes 2003 The Cat in the Hat Nominated — Golden Raspberry Award for Worst Director 2017–2019 A Series of Unfortunate Events 5 episodes ;As actor Year Film Role Notes 2002 Men in Black II Astronaut Uncredited 2012 Men in Black 3 Pedestrian Uncredited 2014 Tiebraker Father ==Other websites== * Category:1951 births Category:Living people Category:BAFTA Award winners Category:Movie directors from Pennsylvania",
 "title": "Bo Welch"
}