{
 "id": "815240",
 "text": "Windows Phone 8 is the second generation of the Windows Phone. It was publicly released on October 29, 2012. It was similar to Windows 8. It is unsupported as of January 12, 2016. The phone could be updated to Windows Phone 8.1 for security patches. The first update was leaked on November 2, 2012. Microsoft released the final version, Update 3, on April 14, 2014, just six days after Windows XP's end of support. == Development history == On June 20, 2010, Microsoft revealed the new Windows Phone 8 (codenamed Apollo). It was the first for Windows Phone from Microsoft, and it was released in 2012, Windows Phone 8 was changed by Windows CE, after the first release for Windows Phone 7. Windows Phone 8 was based on Windows Phone 7, the successor is Windows Phone 8.1, released in 2014. There were two supported platforms in Windows Phone 8. Windows Phone 8 has supported platform for news was WVGA, except for the Windows Phone 7. === Update 1 === Update 1 for Windows Phone 8 was released on October 29, 2012. There had been Windows Store updates, the start screen had a green theme, white wallpaper, music and video. The update was leaked on the internet on November 2, 2012. === Update 2 === Update 2 for Windows Phone 8 was released on November 12, 2012. In the start menu, you could launch the Action Center. It was released on November 3, 2012. === Update 3 === Update 3 for Windows Phone 8 was released on April 14, 2014. The start screen had updated in the new OneNote. === End of support === On January 12, 2016. Microsoft reached the final update for Windows Phone 8. Microsoft had no more security update(s) for the Windows Phone 8. Microsoft announced a successor to Windows Phone 8 which was the Windows Phone 8.1. After the end of support for Windows Phone 8, users must to be upgrade to Windows Phone 8.1, which was supported until July 11, 2017. == Features not in Windows Phone 8 == Cortana did not exist in Windows Phone 8 and could only be used in Windows Phone 8.1. SkyDrive (now known as OneDrive) was removed, and was added to the Internet Explorer app. The Windows Phone 8 had no update settings, and file history didn't exist. == Related pages == * Windows 7 * Windows 8 * Windows 8.1 * Windows 10 * Windows Phone * Windows Phone 7 == Other websites == * https://www.windowsphone.com * https://microsoft.com/windows Category:Microsoft operating systems",
 "title": "Windows Phone 8"
}