{
 "id": "815385",
 "text": "\"He Loves to Fly and He D'ohs\" is the first episode of the 19th season of The Simpsons. It was first shown on the Fox network on September 23, 2007. It is the first episode to be shown after The Simpsons Movie was first shown in movie theaters. The episode is about Homer Simpson trying to get a job that will let him fly an airplane. The episode was written by Joel H. Cohen. Mark Kirkland is the director of the episode. Lionel Richie and Stephen Colbert are guest stars in the episode. == Story == Mr. Burns tries to take a penny in a fountain. He falls in and almost drowns. Homer sees Mr. Burns in the fountain and helps Burns get out of it. Mr. Burns thanks Homer and asks him if he wants to go to dinner. Homer says that he likes Chicago-style pizza. Burns takes Homer to his private airplane to go to Chicago. Homer gets very good services in the plane. Homer is very happy when he is in Chicago. However, he is sad when he has to go back to Springfield. He says that he will not feel as happy as he was in Mr. Burns's airplane. Marge gets Homer a life coach named Colby Kraus. Colby wants to help Homer get happy by flying airplanes. He watches what Homer does for a few days. He learns that Homer is happier when he is at a bowling alley. Colby tells Homer to always wear the shoes he wears for bowling. Homer gets better at doing things and gets offers for new jobs. Homer does an interview for a job that will let him fly. However, he does not get hired. Homer does not tell his family that he did not get the job. He goes to Krusty Burger so that his family thinks he is at his job. On the day after that, Bart sees Homer at Krusty Burger. Homer tells Bart about his interview and that he did not get the job. Bart makes Homer go to a pay phone to talk to Marge about it. Homer lies to her and tells her to go to an airport with him. Homer and Marge get on a plane so that Homer feels better when telling her the truth. However, the person flying it goes unconscious. Homer tries to fly the plane but does not know how. Marge makes the plane go up using the plane's yoke. She calls Colby with her cell phone and tries to get him to help. He talks to Homer and gives him motivation on getting the airplane down. The airplane comes down and gets on the runway. However, the plane keeps moving and falls in the ocean. Homer says to Marge that flying airplanes is not safe for him. He says that he will get his job back at the power plant with Mr. Burns. == Production == \"He Loves to Fly and He D'ohs\" was the first new episode to show on television after The Simpsons Movie was shown in theaters. The start of the episode shows what happened to Springfield after the movie. Some of the characters that were in the movie are seen in the episode. The Simpson family's house is still in construction. Homer's pig named Spider Pig (a parody of Spider-Man) is with the family. The episode was written by Joel H. Cohen. Mark Kirkland is the director of the episode. Stephen Colbert is the voice actor for Colby Kraus. He did not have to do an audition. He said he was happy to be part of the episode. He liked that Colby's name is similar to his and that Colby looks similar to him. Colbert said that he tried to make Colby sound similar to Tony Robbins. == Reception == About 9.7 million people saw the episode when it was first shown on television. Brian Tallerico from UGO thought that the episode was not as good as The Simpsons Movie. He said that the writers went back to their \"old clichés\" and that the same jokes were said too many times. He liked the start of the episode that shows the events after the movie. Robert Canning from IGN said that the episode is \"mediocre\". He thought that Colbert being in the episode was \"disappointing\". He liked some parts of the episode. For example, Homer being in Chicago, and Colby giving Homer motivation on the plane. Richard Keller from TV Squad liked the episode and thought Homer was a better character in this episode. Al Jean said that this is one of his favorite episodes. == References == == Other websites == * * Category:The Simpsons episodes Category:2007 television episodes",
 "title": "He Loves to Fly and He D'ohs"
}