{
 "id": "815781",
 "text": "The 2013-14 Atlantic winter storms in Europe was a time of winter storms that happened in Europe. == St. Jude storm and Windstorm Godehard == At the end of October, the St. Jude storm (also called Cyclone Christian), became one of the strongest storms in fall across southern England in the last 40 years. After the St. Jude storm, lots of storms went across western Europe. They brought winds and rain. A low air pressure area named Godehard was the strongest of these low air pressure areas. It caused some damage in Wales. Its winds left 10,000 homes without electricity in Wales. It happened on the first weekend of November 2013. On November 2, the M4 Motorway between Margam and Pyle was closed because of the weather and a roof canopy at the Princess of Wales Hospital Bridgend was damaged. The old Severn Bridge on the M48 motorway was closed. On the the Second Severn Crossing speed restrictions to slow cars down. The low air pressure also brought big waves to Aberystwyth which caused some damage to houses near the sea. == 2013 Nordic Windstorms == An area of high air pressure formed to the west of Britain and Ireland. It formed from late November to early December. It caused many storms to go north to Norway and Sweden. All the storms moved north of the United Kingdom. This meant that in November the country was fairly dry. In December there were long periods of calm weather in France. It was sunny and dry. The weather changed as storms brought strong rain and snowfall to the mountains towards the end of the month. Until December 14, France (and the United Kingdom and Ireland) were protected by a strong area of high air pressure that went from Africa to the British Isles. However, the Nordic nations were affected by lots of storms, including Windstorm Hilde (November 17), Windstorm Oskari (December 1), Windstorm Xaver (December 5–7), Windstorm Ivar (December 12) and Windstorms Zaki and Adam (December 14–15). The high air pressure over Britain, Ireland and the Atlantic moved east during the middle of December. It allowed areas of low air pressure to reach western Europe. During the middle of December the jet stream became unusually strong in the North Atlantic. The storms moved under this strong jet stream where they quickly became strong before reaching Western Europe. == Christmas and New Year Windstorms == === Windstorm Bernd (18–19 December) === Bernd Formed 17 December 2013 Dissipated 21 December 2013 Lowest pressure 947 hPa (28.0 inHg) The first storm of this period was named Bernd. The storm was also named Emily after Emily Brontë the author. She died on December 19 165 years ago. She also wrote the book Wuthering Heights. Met Éireann (Ireland) gave red warnings for wind at 9:00am on December 18 to many counties in Ireland including Donegal, Galway, Leitrim, Mayo and Sligo. The United Kingdom Met Office gave orange warnings for the Highlands, Western Isles, Strathclyde and Northern Ireland. === Windstorm Dirk (23–24 December) === Dirk Formed 21 December 2013 Dissipated 28 December 2013 Lowest air pressure 927 hPa (27.4 inHg) Dirk formed over North America, and caused some storms in Canada, before it moved into the Atlantic. The weather in North America after saw a steep temperature gradient. It made the jet stream in the North Atlantic stronger. The storm moved under this strong jet stream where it quickly became stronger before reaching Western Europe. Dirk created the lowest air pressure in Britain and Ireland since 1886 (127 years ago). The all-time low air pressure record for the British Isles was recorded in 1884 (129 years ago). === Windstorm Erich (December 26-27) === Erich Formed 25 December 2013 Dissipated 1 January 2014 Lowest air pressure 944 hPa (27.9 inHg) === Windstorms Felix & Gerhard === A stormy period between Christmas and New Year followed as Weather fronts related with the Windstorms Felix (December 30) and Gerhard (January 1, New Year's day) passed over the United Kingdom. It caused even more rainfall and storms to the area. Windstorm Felix was more remote from the European mainland. It brought strong winds in North- West France in the Brittany area. Storminess near Iceland brought winds up to 140 kilometers per hour (87 miles per hour) to that country. It brought heavy rainfall and more flooding to the United Kingdom. Over the holiday period, several New Year outdoor swimming events were cancelled. ==References== Category:2013 in weather Category:2014 in weather",
 "title": "2013-14 Atlantic winter storms in Europe"
}