{
 "id": "815895",
 "text": "Maryna Anatoliivna Poroshenko (born February 1, 1962 in Kyiv) is a Ukrainian political and public figure. She is a wife of the fifth President of Ukraine, Petro Poroshenko (2014-2019). Since 2020, she has been a member of the Kyiv City Council from the European Solidarity party, leading the party's list in Kyiv in the 2020 elections. She is a chairman of the Board of the Petro Poroshenko Charitable Foundation. In 2018-2019 she was a Chairman of the Ukrainian Cultural Foundation. She received a medical education, worked as a cardiologist, candidate of medical sciences. == Biography == She was born on February 1, 1962 in Kyiv. Her father was the Deputy Minister of Health of the Ukrainian SSR. In 1986 she graduated from the Kyiv Medical Institute. In 1991 she defended her dissertation. After graduating from the institute, she worked as a doctor in the cardiology department of the October Clinical Hospital in Kyiv. She was an assistant to the People's Deputy of the 4th convocation Viktor Korol on a voluntary basis. In 2005-2007 she studied and graduated with honors from the National Academy of Management of Culture and Arts with a degree in \"Fine and Decorative Arts\" and qualified as an \"art critic-expert\". After the 2014 parliamentary elections, Maryna Poroshenko became an assistant to Hryhoriy Zabolotny, a majority deputy from Vinnytsia, on a voluntary basis. From 2016 to 2020, she was a member of the Council for the Development of the National Cultural, Artistic and Museum Complex \"Art Arsenal\" in Kyiv. From January 19, 2018 to December 2019, she was a Chairman of the Ukrainian Cultural Foundation. On September 16, 2020, it became known that Maryna Poroshenko was nominated as the first number on the list of candidates for Kyiv City Council from the European Solidarity party. According to the results of the local elections in Kyiv, European Solidarity won 20.5% of the vote, and Maryna Poroshenko became a deputy of the Kyiv City Council. == References == Category:1962 births Category:Living people Category:First Ladies of Ukraine",
 "title": "Maryna Poroshenko"
}