{
 "id": "815919",
 "text": "Windows Phone 7 is the first release of the Windows Phone mobile client operating system, released on November 8, 2010, worldwide was released on October 21, 2010. It runs on Windows CE 6.0 kernel. They have similar to Windows 7 but received updates from Microsoft, the last being is Windows Phone 7.8, which was released on March 13, 2013. After few features backported for Windows Phone 8, such as a more customizable start screen. The succeeded is Windows Phone 8, released in 2012. == History == Microsoft officially unveiled the new operating system is Windows Phone 7 Series, at the Mobile World Congress in Barcelona on February 15, 2010, and revealed additional MIX 2010. The final SDK is have made available on September 16, 2010. In original names and wordy, the names is Windows Phone 7 shortened on April 2, 2010. On October 11, 2010. The CEO Steve Ballmer announced the 10 launch device for Windows Phone 7, made by HTC, Samsung, Dell, and LG, with the sale was beginning on October 21, 2010, for Europe and Australia, the Windows Phone 7 was released on November 8, 2010, for the United States. Upon the device were made on 60 carriers in 30 countries, another device will be launched in 2011. The released Windows Phone 7 Mango in CEO Steve Ballmer used beginning on November 11, 2010. More is ZTE Microsoft website, was beginning support for Windows Phone 7. Windows Phone has through Windows Phone Store in 35 countries and regions, Windows Mobile was extended support on July 15, 2011. Support additional language from Windows Phone Store brought features the Mango and Tango updates to the OS respectively. == Features == === Core === Windows Phone 7 is the only version for Windows Phone that features is the kernel for Windows CE 6.0 was based on Windows Embedded Compact 7 version for Windows Embedded CE, which also the Pocket PC system and Windows Mobile. === User interface === Windows Phone 7 features a user interface based on a designed system codename and commonly referred to as Metro. The home screen, called Start screen, is made up the Live Tiles for Windows Phone 7, Tiles are link features and functions, (such as contact and web). Users can add and remove tiles, dynamic, and updates in real-time, its example, the tiles for an email account would display the number message but live updates are weathers. Several key features for Windows Phone 7 are organized into hubs, which combine local and online via Windows Phone popular social such a Facebook, Windows Live, and Twitter. The pictures hub shows photo captures, multi-touch technology. == Removed features == While Windows Phone was hiding removed Adobe Flash, which ended on December 31, 2020, which based system is Google, and Windows Live. === Awards === Windows Phone 7 was presented with a total of three awards in 2011, extended support for Windows Phone 7 was ended on September 9, 2014. Awards for Windows Phone 7 has two awards on September 5, 2014, after the end of support four days later. Microsoft CEO Steve Ballmer and Chairman Microsoft Bill Gates have four awards for hardware Windows Phone 7 was released on August 15, 2014. On September 10, 2014, Microsoft choose the operating system Windows Phone has succeeded in Windows Phone 8, awards have ended in the four-day end of support for Windows Phone 7, Microsoft reaches the device for Windows Phone 7 can upgrade to Windows Phone 8, the Windows Live web, Google and Twitter end of support for Windows Phone 7 least on September 13, 2014. === Hardware === Windows Phone 7 device can launched to Samsung, HTC, Dell and LG, the Dell phone launch Windows Phone 7 buy sales from hardware, the none 32-bit ARM architectures, vine mobiles being tough, but fair.. All Windows Phone 7 device has no choice unlike Windows 7, must be were required to 256MB. Windows Phone 7 device mockup by 512MB of RAM, also for Mango and Tango update, the requirements were revised to allow for chipsets with slower processors, and for devices to have a minimum of 256 MB of RAM. Certain features of the operating system, and the ability to install certain resource-intensive apps. The 512MB of RAM is the device for Tango updates, live everything new for Live Tiles in the device. == Version history == === Windows Phone 7.5 === Windows Phone 7.5 is the version for Windows Phone 7 was released in 2011, at the Campaign Shop in the United States, the logo can similar to the red color button, Live Tiles app everything for version Mango, the first release Mango was leaked on January 2011, the support version has chosen from Microsoft official version as Tango. === Windows Phone 7.8 === Windows Phone 7.8 is the version for Windows Phone 7 that was released on March 13, 2013. From Microsoft, Windows Phone 7.8 was leaked update on March 15, 2013. In the stages, Microsoft launched three device support for Windows Phone 7 is Samsung, Dell, and HTC, reach supported was ended on September 9, 2014. Features since August 29, 2014. But it's 256MB of RAM in devices, have a choice in Microsoft, support mainstream has ended on September 8, 2013. == Features subsequently implemented in Windows Phone 8.0 and 8.1 == === Features subsequently implemented in Windows Phone 8 === * Removable SD cards * USB mass-storage * Bluetooth file transfers * Connecting to Wi-Fi (wireless) access points with both a hidden SSID and WPA protection * Sideloading for corporate apps * VoIP and IP Video calling integrated into the Phone app * Support for Office documents with security permissions * On-device encryption * Strong passwords * Full Exchange support * Native applications * Full background multitasking === Features subsequently implemented in Windows Phone 8.1 === * IPsec security (VPN) * System-wide file manager * The 'Weekly' view in the Calendar app * Universal search * UMTS/LTE Video calling == New features== Microsoft's hardware requirements stipulate that every device running Windows Phone 7 must have a dedicated Search button on the front of the device that performs different actions. Pressing the search button while an application is open allows users to search within applications that take advantage of this feature; for example, pressing Search in the People hub lets users search their contact list for specific people. This has been changed in Windows Phone 7.5 however – as the search button is reserved for Bing – so applications that previously used this feature (such as the Marketplace) now include soft search buttons. In other cases, pressing the Search button will allow the user to perform a search of websites, news, and map locations using the Bing application. Windows Phone also has a voice recognition function, powered by TellMe, which allows the user to perform a Bing search, call contacts, or launch applications simply by speaking. This can be activated by pressing and holding the phone's Start button. Bing is the default search engine on Windows Phone handsets due to its deep integration of functions into the OS (which also includes the utilization of its map service for location- based searches and queries). However, Microsoft has stated that other search engine applications can be used. Zune software is used to manage and sync content on Windows Phone 7 devices with PCs. Windows Phone 7 can wirelessly sync with the software. In addition to accessing Windows Phone devices, Zune software can also access the Zune Marketplace to purchase music, videos, and apps for Windows Phone and Zune products. While music and videos are both stored locally on the PC and the phone, apps are only stored on the phone even if purchased from the Zune software. Zune software is also used to deliver software updates to all Windows Phone 7 devices. The Zune software is unavailable for Mac OS X, but Microsoft has released Windows Phone Connector, which allows Windows Phone devices to sync with iTunes and iPhoto. This has since been succeeded by the Windows Phone App, which is designed for Windows Phone 8 but can sync with Windows Phone 7 devices as well. === Music Video === The \"Music + Videos hub\" allows the user to access music, videos, and podcasts stored on the device, and links directly to the \"Xbox Music Store\" to buy music, or rent with the Xbox Music Pass subscription service. When browsing the music by a particular artist, users can view artist biographies and photos, provided by Xbox Music. This hub integrates with many other apps that provide video and music services, including, but not limited to, iHeartRadio, YouTube, and Vevo. This hub also includes Smart DJ which compiles a playlist of songs stored on the phone similar to the song or artist selected. Purchased movies and other videos can be played through Xbox Video. The \"Pictures hub\" displays the user's Facebook and SkyDrive (now OneDrive) photo albums, as well as photos taken with the phone's built-in camera. Users can also upload photos to social networks, comment on other's photos, and tag photos on social networks. Multi-touch gestures permit zooming in and out of photos. === Office app === The \"Office hub\" organizes all Microsoft Office apps and documents. Microsoft Office Mobile provides interoperability between Windows Phone and the desktop version of Microsoft Office. Word Mobile, Excel Mobile, PowerPoint Mobile, OneNote Mobile, and SharePoint Workspace Mobile allow most Microsoft Office file formats to be viewed and edited directly on a Windows Phone device. Microsoft Office can also open files from SkyDrive and Office 365, as well as files stored locally on the phone. Office files on Windows Phone 7 are sorted by tiles: Word documents (blue tile), Excel spreadsheets (green tile), PowerPoint presentations (red tile), and OneNote documents (purple tile). === Media === Windows Phone 7 supports WAV, MP3, WMA, AMR, AAC/MP4/M4A/M4B, and 3GP/3G2 standards. The video file formats supported include WMV, AVI, MP4/M4V, 3GP/3G2, and MOV (QuickTime) standards. These supported audio and video formats would be dependent on the codecs contained inside them. It has also been previously reported that the DivX and Xvid codecs within AVI are also playable on the system. Unlike the previous Windows Mobile operating system, there are currently no third-party applications for handling other video formats. The image file formats that are supported include JPG/JPEG, PNG, GIF, TIF, and Bitmap (BMP). After the \"Mango\" update, Windows Phone 7 added the ability for users to have custom ringtones. Ringtone audio files must be under 1MB and less than 40 seconds long. Custom ringtones still cannot be used for text messages, IMs, or emails. === Contact Online === Contacts are organized via the \"People hub\", and can be manually entered into contacts or imported from Facebook, Windows Live Contacts, Twitter, LinkedIn, and Gmail. Contacts may be manually imported from Outlook using Windows Live Contacts or Gmail. A \"What's New\" section shows the news feed and a \"Pictures\" section show pictures from those social networks made by the contacts. A \"Me\" section shows the phone user's own social network status and wall, allow the user to update his status and check into Bing and Facebook Places. Contacts can be added to the home screen by pinning them to the start. The contact's \"Live Tile\" displays his social network status and profile picture on the home screen and the contact's hub displays his Facebook wall as well as all of the rest of his contact information and information from his other social networks. If a contact has information stored on multiple networks, users can link the two separate contact accounts, allowing the information to be viewed and accessed from a single card. As of Windows Phone 7.5, contacts can also be sorted into \"Groups\". Here, information from each of the contacts is combined into a single page which can be accessed directly from the Hub or pinned to the Start screen. === Interface === Windows Phone 7 features a user interface based on a design system codenamed and commonly referred to as Metro. The home screen, called \"Start screen\", is made up of \"Live Tiles\". Tiles are links to applications, features, functions, and individual items (such as contacts, web pages, applications, or media items). Users can add, rearrange, or remove tiles. Tiles are dynamic and update in real-time – for example, the tile for an email account would display the number of unread messages or a tile could display a live update of the weather. Several key features of Windows Phone 7 are organized into \"hubs\", which combine local and online content via Windows Phone's integration with popular social networks such as Facebook, Windows Live, and Twitter. For example, the Pictures hub shows photos captured with the device's camera and the user's Facebook photo albums, and the People hub shows contacts aggregated from multiple sources including Windows Live, Facebook, and Gmail. From the Hub, users can directly comment and 'like' on social network updates. The other built-in hubs are Xbox Music and Video, Xbox Live Games, Windows Phone Store, and Microsoft Office. Due to Facebook Connect service changes, Facebook support is disabled in all bundled apps effective June 8, 2015. Windows Phone uses multi-touch technology. The default Windows Phone user interface has a dark theme that prolongs battery life on OLED screens as fully black pixels do not emit light. The user may choose a light theme instead, and can also choose from several accent colors. User interface elements such as tiles are shown in the user's chosen accent color. Third- party applications can be automatically themed with these colors. == Reception == What Engadget and Gizmodo felt were notable omissions in a modern smartphone OS[citation needed] have largely been addressed in the Mango update.[citation needed] ZDNet praised the OS's virtual keyboard and noted the excellent touch precision as well as powerful auto-correct and revision software. The touch responsiveness of the OS has also been universally praised by all three sites with reviewers noting the smoothness of scrolling and gestures like pinch to zoom in web browsing. PCWorld ran an article called \"Windows Phone 7: Microsoft's Disaster\" citing what they call a \"lack of security, shockingly bad Office apps, an interface not backed up under the hood and abandonment of the full Microsoft customer base.\" The reception to the \"Metro\" UI (also called Modern-Style UI) and the overall interface of the OS has also been highly praised for its style, with ZDNet noting its originality and fresh clean look. Engadget and ZDNet applauded the integration of Facebook into the People Hub as well as other built-in capabilities, such as Windows Live, etc. == Sync == * Windows Phone does not support USB sync with Microsoft Outlook's Calendar, Contacts, Tasks, and Notes as opposed to older versions of Windows Mobile with Desktop ActiveSync. Syncing Contacts and Appointments is done via cloud-based services (Windows Live, Google, or Exchange Server), and no method to sync this information directly with a PC is provided. Third-party software, such as Akruto Sync, provides some of this functionality. A petition to Microsoft was filed to reinstate USB sync for Outlook. == Related pages == * Windows Phone * Windows Phone 8 * Windows 7 == Other websites == * https://microsoft.com/windowsphone7 * https://www.windowsphone.com Category:Microsoft operating systems Category:Smartphones",
 "title": "Windows Phone 7"
}