{
 "id": "815912",
 "text": "The Space Age is the time period in human history related to the space race, space exploration, and space technology. Most people say this started when Sputnik 1 was launched in 1957, and continues to today. This has influenced culture such as in movies, television, music, art, and architecture. ==Chronology== Date First ... Mission Person(s) Country June 20, 1944 Artificial object in outer space, i.e. beyond the Kármán line V-2 rocket, test flight\"Long-range\" in the context of the time. See NASA history article – N/A Germany October 24, 1946 Pictures from space (105 km) U.S.-launched V-2 rocket from White Sands Missile Range, New Mexico. – N/A United States February 20, 1947 Animals in space U.S.-launched V-2 rocket on 20 February 1947 from White Sands Missile Range, New Mexico. \\- fruit flies United States October 4, 1957 Artificial satellite Sputnik 1 – N/A Soviet Union November 3, 1957 Animal in orbit Sputnik 2 Laika the dog Soviet Union January 2, 1959 Lunar flyby, and first spacecraft to achieve a heliocentric orbit Luna 1https://nssdc.gsfc.nasa.gov/nmc/spacecraft/display.action?id=1959-012A - 27 February 2020 – N/A Soviet Union September 12, 1959 Impacted on the Lunar surface; thereby becoming the first human object to reach another celestial body Luna 2 – N/A Soviet Union October 7, 1959 Pictures of the far side of the Moon Luna 3 – N/A Soviet Union April 12, 1961 Human in space Vostok 1 Yuri Gagarin Soviet Union May 5, 1961 Manual orientation of crewed spacecraft and first human space mission that landed with pilot still in spacecraft, thus the first complete human spaceflight by FAI definitions Freedom 7 Alan Shepard United States December 14, 1962 Successful flyby of another planet (Venus closest approach 34,773 kilometers) Mariner 2 – N/A United States March 18, 1965 Spacewalk Voskhod 2 Alexei Leonov Soviet Union December 15, 1965 Space rendezvous Gemini 6A With Gemini IV, NASA changed to Roman numerals for Gemini mission designations. and Gemini 7 Schirra, Stafford, Borman, Lovell United States February 3, 1966 Soft landing on the Moon by a spacecraft Luna 9 – N/A Soviet Union March 1, 1966 First human-made object to impact another planet Venera 3 – N/A Soviet Union March 16, 1966 Orbital docking between two spacecraft Gemini 8 & Agena Target Vehicle Neil Armstrong, David Scott United States April 3, 1966 Artificial satellite of another celestial body (other than the Sun) Luna 10 – N/A Soviet Union October 18, 1967 First spacecraft to perform transmit data from the atmosphere of another planet Venera 4 – N/A Soviet Union December 21–27, 1968 First humans to enter the gravitational influence of another celestial body (the Moon) and orbit it Apollo 8 Borman, Lovell, Anders United States July 20, 1969 Humans land and walk on another celestial body (Moon) Apollo 11 Neil Armstrong, Buzz Aldrin United States December 15, 1970 First telemetry from the surface of another planet Venera 7 – N/A Soviet Union April 19, 1971 Operational space station Salyut 1 – N/A Soviet Union June 7, 1971 Resident crew Soyuz 11 () Georgy Dobrovolsky, Vladislav Volkov, Viktor Patsayev Soviet Union July 20, 1976 Pictures from the surface of Mars Viking 1Image – Viking 1 Approaches Mars – N/A United States April 12, 1981 Reusable orbital spaceship STS-1 Young, Crippen United States February 19, 1986 Long-duration space station Mir – N/A Soviet Union February 14, 1990 Photograph of the whole Solar SystemSee under \"Extended Mission\" Voyager 1 – N/A United States November 20, 1998 Current space station International Space Station – N/A Russia August 25, 2012 Artificial space probe in interstellar space Voyager 1 – N/A United States November 12, 2014 Artificial probe to make a planned and soft landing on a comet (67P/Churyumov–Gerasimenko) Rosetta – N/A European Space Agency July 14, 2015 Nation to have its space probes to explore all of the nine major planets recognized in 1981 New Horizons – N/A United States December 20, 2015 Vertical landing of an orbital rocket booster on a ground pad. Falcon 9 flight 20 – N/A United States April 8, 2016 Vertical landing of an orbital rocket booster on a floating platform at sea. SpaceX CRS-8 – N/A United States March 30, 2017 Relaunch and second landing of a used orbital rocket booster. SES-10 – N/A United States January 3, 2019 Soft landing on the lunar far side by a spacecraft. Chang'e 4 – N/A China May 30, 2020 First human orbital spaceflight launched by a private company. Crew Dragon Demo-2/Crew Demo-2/SpaceX Demo-2/Dragon Crew Demo-2 Bob Behnken, Doug Hurley United States ==References== Category:Outer space Category:Periods and ages in history",
 "title": "Space Age"
}