{
 "id": "816116",
 "text": "Khamnu (/kʰəm.nu/) is a woman in Meitei stories. She is in the epic poem Khamba Thoibi. She is the daughter of prime minister Khuman Puremba of Ancient Moirang. Biologically, she is a daughter of King Chingkhu Telheiba of Ancient Moirang. She is the older sister of Khuman Khamba. She is best known for raising her younger brother when he was a child. The two siblings became orphans during their infancy. She feared of being conspired by others. So, she fled with her younger brother from her hometown. They took asylum in the village of the Kabui chief in the hills. Khamnu and her younger brother Khamba were given fatherly care by General Thonglen and Nobleman Chaoba Nongthonba before and after their time living at the Kabui village in the hills. Khamnu worked very hard to raise her younger brother. So she is often compared to Kunti of the Mahabharata. == Early life == Khamnu's parents died. After this, life became very difficult for her and her brother Khuman Khamba. Khuman Khamba was still a baby. Khamnu went from place to place to get help to work in Moirang. She husked paddy for some people. The women who owned the paddy paid her by breastfeeding the infant Khamba. Like this, she worked and got help until she and her brother were both adults. To earn a living, Khamnu sold wood in a market of Moirang. One day, Princess Thoibi visited the marketplace. She noticed Khamnu, a strange new face. She asked Khamnu many things. She even gave Khamnu food and jewelry. Khamnu and Thoibi met once more. Thoibi asked Khamnu to come with her when she went fishing in Loktak lake. So Khamnu accompanied the princess in sporting on the lake. Once Princess Thoibi visited Khamnu's house. Meanwhile, Khamnu went out to the market to bring some fruits. At Khamnu's absence, Thoibi presented Khamba gifts. The two bound themselves by an oath before the God Khuman Pokpa. They drank the water in which the golden bracelet was dipped. They vowed to be lovers forever. After this oath, Thoibi addressed Khamnu as \"sister\". == Exposition of hidden identity == Khamnu's younger brother Khamba went out among other men. He joined the wrestling club. While wrestling, Khamba defeated Nongban. Nongban was the champion of all the wrestlers in the kingdom. At Nongban's defeat, Khamba's long hidden identity was known to everyone. He is the son of great warrior Khuman Purenba. At this, Minister Nongthonba remembered the marriage engagement between Feiroijamba, his firstborn son, and Khamnu. They went to Khamnu. Khamnu hid herself in the women's chamber. They cried tears and were very sad. At this, Khamnu came out. She received the gifts from them. From this time onwards, Khamnu and her brother Khamba were always supported by Minister Nongthonba, Minister Thonglen and Feiroijamba in every way of life. == Secret of the dangerous bull == Khamnu's younger brother Khuman Khamba was ordered to capture the Kao bull from the Khuman kingdom. At this, Khamnu revealed a secret of the Kao (bull) to Khamba so that Khamba could catch him. She said, > \"This great bull was once the Lord of your father's herd. Go to him, speak > your father's name in his ear, and show him this Rope of silk.\" On the day of the adventure, Khamba did everything as his sister had told him to do. This tamed the bull. == Marriage == Khamnu and Feiroijamba got married after the wedding of Khuman Khamba and Moirang Thoibi. Her marriage engagement was set by Nongtholba and late Purenba long time back. == Namesakes == === Market === Khamnu Keithel (literally, \"Khamnu market\") was constructed at INR 9 crore (1.2 million US Dollar) under the project of Planning and Development Authority (PDA) in Moirang. == References == == Other websites == * Khamnu_archive.org * Khamnu_e-pao.net Category:Legendary Meitei people",
 "title": "Khamnu"
}