{
 "id": "816279",
 "text": "Maruoka Castle (丸岡城, Maruoka-jō) is in Sakai, Fukui Prefecture. It is also called Kasumi-ga-jō (霞ヶ城). The castle tower was built between 1624 to 1644. It is one of the twelve existing castle towers in Japan (現存十二天守, genzon-jūni- tenshu), and also one of the national important cultural properties. == History == In 1576, Nobunaga Oda ordered Katsutoyo Shibata to build Maruoka Castle to get ready for the ikkō-ikki, a rebellion by believers of the Jōdo Shinshū sect of Buddhism in the 15th-16th centuries. In 1613, Narushige Honda became the first lord, castle owner, of the Maruoka Castle. After the Honda family, the Arima family were lords of Maruoka Castle from 1695 to 1869. Shigesumi Arima was lord from 1772 to 1830. He rebuilt the local domain economy. On 8 July 1948, an earthquake hit Fukui. The quake destroyed the castle tower of Maruoka Castle. But, in 1955 the castle tower was repaired by recycling more than 70% of the original materials of Maruoka Castle. == Structure == Maruoka Castle’s stone walls are about 6.2 meters high. The stone walls were built using nozura-zumi (野面積み), an architectural method to build stone walls with a good system of drains. This protects the building from damage by heavy rain. Maruoka Castle is also famous for its steep stairs. The stairs that go up from the first floor to the second floor are at an angle of 65 degrees. The stairs from the second floor to the third floor are at an angle of 67 degrees. == Events == === Cherry Blossom Festival === About 400 cherry trees were planted around Maruoka Castle, and this place was chosen as one of the Japan’s Top 100 Cherry Blossom Viewing Sites in 1990. There is a Cherry Blossom Festival there every year. === \"A Brief Message From the Heart \" Letter Contest (一筆啓上賞, ippitsukeijō-shō) === Shigetsugu Honda, whose son was the first lord of Maruoka Castle, sent a letter to his wife during a war at Shitaragahara in 1575. \"A brief message. Don't start a fire. Don't make Osen cry. Feed my horses.\" This letter is said to be famous for the shortest letter in Japan, and there is a stone monument engraved with this letter in Maruoka Castle. In 1993, this contest was started to let more people know that the shortest letter was in Maruoka Castle. == Facilities around Maruoka Castle == === Museum of History and Folklore === This museum was opened in March 2019. On the first floor, there are exhibits of Maruoka folklore, and on the second floor, there are exhibits of the history of Maruoka Castle. === Brief Message from the Heart Museum === This museum opened on 23 August 2015. In this museum, the winning works of the Contest of Brief Massages are exhibited. == Visitors == The total number of visitors to Maruoka Castle, both paid or free, was about 150,000 in the first year of Reiwa, and about 70,000 in the second year due to the spread of coronavirus. Most visitors are in their 60s or older or with their families, but recently, female visitors in their 20s to 40s are also increasing due to the castle boom. The museum is also used by elementary, junior high, and high school students for school trips and field trips. == Legend == In 1576, Katsutoyo Shibata tried to build Maruoka Castle, but it had collapsed many times. Therefore, he received a proposal to stabilize the castle by putting a human pillar in the castle tower. The person chosen as the human pillar was one-eyed Oshizu, who was a woman living a difficult life with two children. Oshizu offered Katsutoyo that one of her children would serve as a samurai in the future, and she decided to become the human pillar on that condition. Although the castle was completed, Oshizu’s children could not be a samurai because Katsutoyo was transferred elsewhere. Oshizu’s spirit resented this, so it rains a lot every April. People call this “Oshizu’s Tears”, and they built a grave of her to console her spirit. This story is fiction, but it is one of the most famous stories of Maruoka Castle. == Related pages == * Fukui Prefecture == References == Category:Castles in Japan Category:17th- century buildings and structures Category:Museums in Japan Category:Buildings and structures in Fukui Prefecture __FORCETOC__",
 "title": "Maruoka Castle"
}