{
 "id": "816365",
 "text": "The National Diet Building (国会議事堂, Kokkai-gijidō) is the building where both houses of the Japan's government, the Diet, meet. It is located at Nagatachō 1-chome 7–1, Chiyoda, Tokyo. Sessions of the House of Representatives take place in the left wing and sessions of the House of Councillors in the right wing. The Diet Building was completed in 1936 and is made of only Japanese materials, except for the stained glass, door locks, and pneumatic tube system. == History == Plans for a Diet building began in 1881. The planners hoped to finish it by 1890, when the Diet would meet for the first time. They realized they could not build a very impressive building in time, so they decided to make temporary buildings at first. The first Diet building was a Western-style building made of wood. It burned down in 1891. Another wooden building was made and finished in 1891. It burned down in 1925. A third building was made. The Diet used it until 1936, when the current Diet building was finished. === Current Diet building === In 1910, the Finance Ministry started a planning group to take control over the new Diet Building design from the Home Ministry. Prime Minister Katsura Tarō chaired the commission, which recommended that the new building should be made in the Italian Renaissance architectural style. Many other people did not like this idea. The ministry had a public design competition in 1918. 118 architect teams sent designs. The first prize winner, Watanabe Fukuzo, produced a design similar to Ende and Böckmann's. The Diet Building was built between 1920 and 1936 with a floor plan based on Fukuzo's entry. The roof and tower of the building might have been inspired by another entrant, third prize winner Takeuchi Shinshichi, and are believed to have been chosen because they mixed European and East Asian architecture. The actual source for the \"Pyramid\" roof remains unclear, but Japanese historian Jonathan Reynolds suggests it might have come from from Shinshichi. Historian of Africa studies Zoe Strother says Shinshichi's design resembles the Mausoleum at Halicarnassus, which was a model for some prominent Western designs in the early 1900s, such as John Russell Pope's 1911 award- winning House of the Temple in Washington, D.C. and the downtown Los Angeles City Hall, completed in 1928. == Further reading == National Diet Building at House of Councillors website ==References== Category:Buildings and structures in Tokyo Category:Buildings and structures completed in the 20th century Category:Government buildings",
 "title": "National Diet Building"
}