{
 "id": "816358",
 "text": "Habutae is a type of silk. There are different kinds of habutae silk such as plain or striped habutae. Habutae is traditionally used for kimono and undershirts. Recently, it is also used for general goods, works of art, and clothing. Habutae is smooth to touch, glossy, and soft. It has been said \"The quality of silk fabric begins with habutae and ends with it.\" Fukui is a suitable region to produce habutae as the dryness and wetness of the air are well-balanced throughout the whole year. == History == In 1871, Kimimasa Yuri, who was a lord of Fukui Domain (region), brought some silk goods from Europe to Fukui when he joined a study tour in Europe. He showed the goods to people who studied silks in Fukui and they started doing technical research on weaving habutae. In 1887, basic technology for weaving habutae silk was completed in Fukui city. The economic boom of the Russo-Japanese War of 1904-05 and World War I boosted progress and production of habutae in Fukui. In the early 1900s, production of habutae in Fukui earned 1.7 million dollars, up to 60% of the total exports of habutae in Japan. The demand for habutae made in Fukui has kept increasing in Japan, and it is still used in many kinds of daily goods such as clothing. == Weaving Process == Most of the process of making Fukui habutae silk is the same as the process of making habutae in other areas, but the weaving process of Fukui habutae silk is different from the weaving process of habutae in other areas. Also, the weaving process is the most important part of making Fukui habutae silk. Fukui habutae silk is made in a process called nureyoko(濡れ横). Nureyoko is a weaving method of weaving warps and wefts which is the two basic components of weaving thread into fabric after wetting wefts with water. Threads are made from raw silks that are imported from other countries such as China and Brazil. This process makes the cloth tight, elastic, and strong. It takes one day to weave 20 meters of habutae. == References == Fukui Newspaper, Publication Committee on the encyclopedia (1991). Habutae. (p. 745). Fukui: Kosuke, Yoshida. Category:Woven fabrics",
 "title": "Habutae"
}