{
 "id": "816460",
 "text": "\"Nongban Pombi Luwaopa\" () or \"Nungpan Ponpi Luwaopa\" () is a Meitei language literary narrative work (puya), about the legendary story of a prince of the Luwang dynasty who got back successfully the life of his wife Koubru Namoinu (Lainaotabi), from the hands of her former consort Thongalen, the God of death and the ruler of the underworld. It is the story of love, courage and perseverance. It is an old story of near tragic end. In the legend, there's a fight between the mortal and the god. It mentions about the dowry system (Awonpot) of the then ancient times. It is, in a sense, the reverse of the Chothe Thangwai Pakhangba. ==Story== It is a story of love fulfilled after a near tragic event and is, perhaps, unique of its kind. Nongban Pombi Luwaoba, the leading character of the same name was a Prince of the Luwang dynasty born of King Nungpan Pamingnapa and Queen Santhong Huimuleima. He soon grew into manhood and felt lovesick. He set out alone to cover the wide world in search of a love to quench the thirst of his heart and was welcomed by the King Koubru when he approached him for a rest. There he met the princess, Koubru Namoinu (Lainaotabi) and was instantly smitten with her beauty and had his heart lost to her. The princess, formerly the youngest wife of Thongalel, the God of death, who while accompanying her younger brother in law on a sojourn to earth got separated from him and was later adopted by the king as his daughter. Returning home hastily, the prince requested his parents to get the princess engaged to him. And this was carried out without delay with the offer of choice and the delicious fruit in prickles to the king and the queen. The couple accepted the proposal with a good grace and regarded it as an occasion ordained by Providence. The marriage having been performed with due solemnity, the young couple began to lead a happy and contented life. But this was desined not to last long, for the God did not take kindly to his own wife spending her days as an ordinary mortal in the company of another man. So, her fatal thread was cut short and her soul recalled. However, the distraught Prince did not not take his tragic fate lying down and taking the help of Nongta Chinkhanyang, a pheasant, sent a request to the Lord of the netherworld to give back the soul of his wife or take the challenge of a single combat. Thus, he kept guarding the mortal remains of Koubru Namoinu without the obsequies being performed. Thongalel first sent his younger brother armed with deadly weapons for the fight in which the prince settled his opponent's hash and kept him bound under the heavy weight of a slab. The Lord's second brother too met the same humiliation and at last, Thongalel himself appeared in all splendor in the field of honour. But the prince was prudent enough to realise that he was no match for powerful God, he fell prostrate before him and begged mercy and kindness to restore Koubru Namoinu to him so that the Luwang dynasty might have further progeny. Thongalel, being visibly moved, readily granted the prayer and left for the dark abode. Thus, the couple were united to live for another hundred years with conjugal bliss and Hongnem Luwang Punshiba, a son was born to them. ==Related pages== * Tharon ==References== Category:Puya",
 "title": "Nongban Pombi Luwaoba"
}