{
 "id": "816459",
 "text": "Lainaotabi () or Leinaotabi () is a goddess in ancient Meitei mythology and religion. She is the youngest wife of God Thongalel of the underworld kingdom (). Thongalel sent her to be the wife of Poireiton, her brother-in-law. Lainaotabi gave birth to a son with Poireiton.Medieval Indian Literature: An Anthology. Sahitya Akademi. 1997.Moirangthem Kirti (1988). Religion and Culture of Manipur. Manas Publications. ISBN 978-81-7049-021-0. Her legend says she made the first clay pot. She was worshipped by the people of Ashangbam clan. == Mythology == === Journey from Underworld to human world === Lainaotabi was the youngest queen of King Thongaren () of the underworld kingdom (). Queen Laikhurembi was the first wife of the King. Poireiton, Thongalel's younger brother, was about to leave on a journey to Tai Pang Pan. The king asked Laikhurembi to go with Poireiton as his wife because Poireiton's own wife had died. However, Laikhurembi did not want to go. Trees had already been planted to honor her as the King's wife. So, instead of Laikhurembi, Lainaotabi was sent to accompany her brother in law Poireiton as a wife. === Love with a mortal prince === Lainaotabi (Leinaotabi) went with Poireiton, her brother-in-law, on a journey to earth. Later, she became separated from him. She was adopted by King Koupalu as his daughter. Afterwards, she came to be known as Koubarol Namoinu () alias Koubru Namoinu (). She fell in love with prince Nongban Pombi Luwaoba of Luwang dynasty. She met the prince for the first time when he visited King Koupalu. She and prince Luwaoba married and led a happy life. God Thongalel did not want his own wife spending her days with another man. So, the thread of her life was cut short and her soul recalled. However, the Prince did not give up. He challenged God Thongalel to give back his wife's soul or to fight with him. He guarded the dead body of Koubru Namoinu without performing the funeral ceremony. Thongalel first sent his two younger brothers one by one for the fight. Prince Nongban Pombi Luwaoba defeated his two divine opponents. Finally, Thongalel himself appeared before him. But this time, the prince realised that he was no match for powerful God. So, he begged mercy and kindness to restore Koubru Namoinu's life so that the Luwang dynasty might have further generation. Thongalel felt pity on him. So, he granted the couple to live for another hundred years with marital pleasure. According to legends, Hongnem Luwang Punshiba was the son of Koubru Namoinu (Lainaotabi) and Nongban Pombi Luwaoba. == Pantheon and worship == The pantheon dedicated to goddess Lainaotabi (Leinaotabi) was mainly maintained by the Ashangbam clan of Meitei ethnicity in Ancient Kangleipak (Antique Manipur). It was recorded in the Loyumba Shinyen (1100 AD). == Related pages == * Nongban Pombi Luwaoba == References == Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of the underworld",
 "title": "Lainaotabi"
}