{
 "id": "816470",
 "text": "The iPhone 12 Pro and iPhone 12 Pro Max are 14th generation smartphones developed by Apple Inc. They were announced was on October 13, 2020. They were released on October 23, 2020, next to the iPhone 12 and 12 mini. The iPhone 12 Pro and 12 Pro Max have the same features as the iPhone 12 and iPhone 12 mini, it has extra cameras like the iPhone 11 Pro and 11 Pro Max and a LiDAR scanner for better photos and AR experiences. They have a magnetic back that allows for MagSafe wireless charging and accessory use, like a wallet. The iPhone 12 Pro costs $999 and the iPhone 12 Pro Max costs $1,099. It is the first iPhone to have a 5G. == Features == === Hardware === The iPhone 12 Pro and iPhone 12 Pro Max can use 5G and have storage of 128GB with options for 256GB and 512GB. Both models comes with 6GB of RAM. iPhone 12 Pro and iPhone 12 Pro Max have 12MP wide rear camera, 12MP ultrawide rear camera and 12MP telephoto rear camera. The iPhone 12 Pro and iPhone 12 Pro Max have 12MP wide front camera. The video recording in the rear camera includes 4K 24FPS, 30FPS, and 60FPS. 1080P 30FPS, 60FPS, 120FPS and 240FPS. The video recording in the front camera includes 4K 24FPS, 30FPS, 60FPS, 1080P, 30FPS, 60FPS, and 120FPS. The iPhone 12 Pro and iPhone 12 Pro Max have a lighting connector. The iPhone 12 Pro and iPhone 12 Pro Max have the Apple A14 bionic chipset which has a faster performance. The iPhone 12 Pro has a 6.1 inch display, Super Reinta XDR display, and an OLED display. The iPhone 12 Pro Max has a 6.7 inch display, super reinta XDR display, OLED display. iPhone 12 Pro has the battery capacity is 2815mAh, and a 12W chargers, and the iPhone 12 Pro Max has a battery capacity of 3687mAh. === Software === The iPhone 12 Pro and iPhone 12 Pro Max runs on iOS 14. It has several changes like an updated iMessage and Siri. It has features in iOS 15 like Focus mode, new widgets, changed settings app, and SharePlay. The iPhone 12 Pro and iPhone 12 Pro Max has features in iOS 16 like customized lock screen, changed mail icon and focus mode changes. == Design == The display has a ceramic shield, making it harder to break if dropped. These phone have flat edges, first seen with the iPhone 4 and made of stainless steel. The iPhone 12 Pro and 12 Pro Max comes in several colors such as silver, graphite, blue, and gold. Colors Name Silver Graphite Gold Blue == Related pages == *iPhone 12 == References == == Other websites == *Official website (archived) 12 Pro Category:Mobile phones with multiple rear cameras Category:Mobile phones with 4K video recording Category:Mobile phones introduced in 2020",
 "title": "IPhone 12 Pro"
}