{
 "id": "816455",
 "text": "Taoroinai ()() is a snake like dragon in Meitei mythology and religion. It lived in the land of the moon. According to the Shakok Lamlen, the Kangla was constructed over the navel of Taoroinai. == Mythology == === Taoroinai from the moon to the earth === According to the Sanggai Phammang, Taoroinai lived on the moon. He was ordered by God Atiya to carry on His image to the earth. He swallowed the image of the God in his mouth. He brought it down. He came down with the image. He lived inside the earth. The God's image was later born as a divine boy. === Taoroinai and the Heavenly egg === According to the Leithak Leikharol and the Krathok Lamlen, Taoroinai went to the Heaven pretending to be Tupu (officer in charge). He found the divine cloud egg (nonglum) of Atiya. He brought it down to earth. He gave the egg to a person with many husbands. Later, the egg became Pakhangba. According to the Meihourol Makok Latam, God Atiya wanted to create an earthly king from his own body. He asked goddess Leimarel Sidabi to call Taoroinai. Leimaren asked Taoroinai to bring the image of God Atiya in the shape of Nonglum (cloud egg). The Goddess Leimaren received the heavenly egg containing another God. After this, Leimaren was also called Yaibirok (). According to the Leimaren Naoyom, Taoroinai gave an embryonic egg to Leimarel Sidabi, a solar goddess (or a celestial goddess). Later, goddess Leimaren (alias Yaibirok) gave birth to Pakhangba. === Taoroinai and the solar sperm === According to the Pakhangba Nonggarol, Taoroinai brought a God from the centre of the Sun as a sperm inside his body after the completion of the creation of the universe. He gave it to goddess Leinung Yaipirok (alias Leimarel Sidabi). === Taoroinai and the Kangla === The Thon Talet Thonlanmei shows the seven layers of the Royal Palace in the Kangla. It shows the gradual evolution of the mankind. According to the illustration, the mankind ascended from the lowest form to the highest form. The forms are (1) fish, (2) snake, (3) tortoise, (4) boar, (5) cow, (6) elephant and (7) man and finally Taoroinai. Taoroinai is shown as the ultimate form of life. According to the Kangla Houba (alias the Kanglalon) written by Ashangbam Laiba in the 5th century, Meitei King Naophangba attempted to construct a new palace in the Kangla. The king's plan was rejected by 13 year old Maichou Ashangbam Laiba. During that time, blood gushed out of the holes of the erecting pillars. It was believed that the erecting pillars struck the body of God Taoroinai.History of Modern Manipur, 1826-1949 - Page 191 - Lal Dena · 1991 So, the King requested Ashangbam Laiba to rectify the pillar position. Laiba did as requested. Later, without any chaos, a seven storied palace building was able to be constructed in the Kangla. === Taoroinai's dance === According to the Anoirol, Lady Toibi Tanka Nubi (alias Tankha Chanu) danced with her father Taoroinai. She learned how to dance from Taoroinai step by step and movement by movement. They danced together. Other living beings also imitated their way of dancing. It was performed to celebrate happiness of the removal of the Lingkam Laikam curse. The curse was removed by the ancestors. Seven maidens namely Tankha, Phuitingwak, Khuyon, Phuitingloubi, Toura, Nongdang and Lengbi and nine gods learned how to dance from Dragon Father Taoroinai. The rhythmic and smooth dancing of the maidens surprised all the creatures of the world. All the creatures came out and started to dance. The movements of Lady Tankha Chanu resembled that of the snake. Her steps destroyed all the plants and the flowers on her way. It is believed that the place of her enactment of the dance is the Mahou Phaibok hill. Seeing the daughter-father dance, a male squirrel imitated their dance. Seeing him dancing, a female squirrel also danced. The son squirrel laughed at his mother squirrel. At this, the female squirrel was embarrassed. The dancing squirrels were later joined by other creatures. And so, the dance never ended. == Related pages == * Korouhanba - Sun God * Pakhangba - Celestial Dragon * Poubi Lai - Water Dragon * Nongshaba - Dragon Lion == References == == Other websites == * Internet Archive - Taoroinai Category:Meitei dragons Category:Gods and goddesses of the moon Category:Gods and goddesses of the sky",
 "title": "Taoroinai"
}