{
 "id": "816449",
 "text": "Korouhanba (, ) is the God of the Sun, the Sky and the Heaven in Meitei mythology and religion of Ancient Kangleipak (Antique Manipur). He is also known as Taohuireng and is one of the two sun brothers in the Numit Kappa epic legend. For having the ability to remove darkness, he is also called \"Ngantureng\". He is described as \"Songbu Chiraitangba\", a physician who is bald headed. == Etymology == The Meitei name \"Korouhanba\" (ko.rəu.hən.bə, ꯀꯣꯔꯧꯍꯟꯕ) is a term for the Sun. This term is generally used in verses or in poems. \"Korouhanba\" (ko.rəu.hən.bə, ꯀꯣꯔꯧꯍꯟꯕ) can be fragmented into \"Korou\" (ko.rəu, ꯀꯣꯔꯧ), \"Han\" (hən, ꯍꯟ) and \"Ba\" (bə, ꯕ). \"Korou\" (ko.rəu, ꯀꯣꯔꯧ) means the day. \"Han\" (hən, ꯍꯟ) means \"to be older\". \"Ba\" (bə, ꯕ) denotes noun form. == Description == According to the Meitei tradition, Sun God Korouhanba has strong connection with human body, human soul and origin of life. The human body is a \"Lang\" (lit. trap). Inside the trap, the \"Thawai Polpi\" (lit. soul bird) is kept. The soul bird leaves the former \"Lang\" and enters into another \"Lang\". The process is called \"Langon\" (lit. Changing of Lang). The \"Polpilang Puya\" text describes that the sun is the origin of life. It was told to Luwang Leikoiba by Mangang Laininghal according to the text. He (the Sun) represents the Supreme Being in the world of things (non living) and beings (living). He is Korouhanba. == Cults and pantheons == The Lai Haraoba festival is celebrated in honor of God Korouhanba every year. The most significant shrine dedicated to God Korouhanba is in Moidangpok town in Manipur. The cults and pantheons dedicated to God Korouhanba are mainly maintained by the Thokchom family of Meitei ethnicity. He has religious association with the Maring tribe. == Connection with other deities == God Korouhanba has connection with Mangang Luwang Khuman, the three divine teachers in many legends. == Namesakes == === Martial Arts Club === The Ibudhou Korouhanba Thang-Ta Moidangpok is a club of Thang Ta, a martial art form of the Meitei ethnicity. This martial arts association was a leading participant in the 31st State Thang Ta Championship in the year 2021. ==Related pages== # Pisatao # Taoroinai == References == == Bibliography == * A Critical Study Of The Religious Philosophy - by Singh, L. Bhagyachandra - 1991 == Other websites == Category:Kings in Meitei mythology Category:Meitei gods and goddesses Category:Gods and goddesses of the sky",
 "title": "Korouhanba"
}