{
 "id": "816457",
 "text": "Yumjao Leima () or Yumjao Lairembi () or Yumjao Lairemma () is the mother goddess of house, household, royalty, rule and power in Meitei mythology and religion. She is designated as the all time ruling Queen Mother. Legend says she assumes a human form in white clothes and blesses kings. She is one of the divine incarnations of Leimarel Sidabi.Folk Culture of Manipur - Page 200 - Moirangthem Kirti Singh · 1993 == Etymology == In Meitei language (Manipuri language), \"Yumjao\" () means \"large house\" or \"big house\".Dance-rituals of Manipur, India: An Introduction to \"Meitei ... - Page 50 - Louise Lightfoot · 1958 \"Yumjao\" () or \"Yimjao\" () may also refer to \"Royal House\". In Meitei language (Manipuri language), \"Leima\" means \"Queen\". In Meitei language (Manipuri language), \"Lairembi\" () means \"goddess\". The Meitei language (Manipuri language) word \"Lairemma\" () is also another term for \"goddess\". == History == Meitei King Naothingkhong (c. 7th century) of Ancient Kangleipak (Antique Manipur) built a temple dedicated to goddess Yumjao Lairembi (). == Mythology == Goddess Yumjao Leima appears in a human form in white clothes to come to bless her son, the King of the kingdom. Even during the death of a king, she came to the place in the form of a mortal being. She controls the life and the death of the kings. She is the chief of the household and the guidance of the kings. == Relationship with the Queen Mother == According to beliefs, Goddess Yumjao Leima is the divine representation of the Queen Mother (Royal Mother) of the kingdom. All the powerful queen mothers were integrated into goddess Yumjao Leima after their death. Goddess Yumjao Leima herself was the all-time ruling Queen Mother. The most powerful person in a kingdom was always the Queen Mother - representation of Goddess Yumjao Leima. In ancient Kangleipak, cut off heads of the enemies from the war were offered to the goddess. The Meitei kings ruled the kingdom in the name of their Queen Mothers. Battles and wars were conducted in the name of the Queen Mothers. One example is that of an event recorded in the Cheitharol Kumbaba: == Worship == Goddess Yumjao Leima is prayed for the longevity of life of the King. The final rites and rituals dedicated to Her are generally performed by the maibas. Goddess Yumjao Lairemma () is mainly worshipped by the Thaopicham family of Meitei ethnicity. According to Meitei culture, the \"Nongmai\" class is in the middle position of the society of the maibis (priestesses). They used to take care of the cult of goddess Yumjao Lairembi. Maibis Latin transliterations (Romanisation) Hierarchy Salai Latin transliterations (Romanisation) Deities to be worshipped Latin transliterations (Romanisation) ꯁꯪꯂꯦꯟ Shanglen Top position ꯃꯉꯥꯡ Mangang ꯄꯥꯈꯪꯕ Pakhangba ꯅꯣꯡꯃꯥꯢ Nongmai Middle position ꯂꯨꯋꯥꯡ Luwang ꯌꯨꯝꯖꯥꯎ ꯂꯩꯃ Yumjao Leima ꯐꯨꯔꯥ (ꯐꯨꯂꯥ) Phura (Phula) Lowest position ꯈꯨꯃꯟ Khuman ꯅꯣꯡꯁꯥꯕ Nongshaba == Temples == === Temple of Yumjao Lairembi, Kangla === The \"Temple of Yumjao Lairembi\" inside the Kangla is at the left side of the Temple of Pakhangba. Structurally, both the temples are of the same architectural styles. The southern wall of the temple is well decorated. The remaining three walls of the temple are of little decorations. A door with the lancite arch is in the southern wall of the temple. Two false doors surround the two sides of the one real door. All the doors (real and false) are framed with pilasters. The ground plan of the temple is in square shape. Its area covered is 2.43 square meters. === Ima Ibemma Yumjao Lairembi Shanglen === In October 2011, a temple named \"Ima Ibemma Yumjao Lairembi Shanglen\" was built in honor of goddess Yumjao Lairembi in Thangmeiband town in Imphal. === Others === * A temple dedicated to Yumjao Lairembi of Arambam region is in Imphal West district in Manipur. * \"Yumjao Lairembi Temple\" is in Meino Leirak, Sagolband, Imphal, Manipur. * \"Thaoroijam Yumjao Lairembi Temple\" is in Thaoroijam Mamang Leikai, Nambol, Manipur. == Namesakes == === Yumjao Lairembi Dramatic and Cultural Union === The \"Yumjao Lairembi Dramatic and Cultural Union\" is a nonprofit dramatic union. It was established in Khagempali Huidrom Leikai, Imphal in the year 2011. == Related pages == * Laikhurembi == References == == Bibliography == * Archaeology in Manipur - Page 149 - L. Kunjeswori Devi · 2003 * Proceedings of North East India History Association - North East India History Association. Session · 1988 * Recent Researches in Oriental Indological Studies: Including Meiteilogy - Page 188 - Moirangthem Kirti Singh · 1998 * The History of Manipur: An early period - Page 263 - Wahengbam Ibohal Singh · 1986 * == Other websites == * Category:Meitei gods and goddesses Category:Leima",
 "title": "Yumjao Leima"
}