{
 "id": "816806",
 "text": "Nataliya Resh (; 27 September 1980, Nezhin, Chernihiv Oblast, Ukrainian SSR) is a Russian lawyer, television presenter, entrepreneur and philanthropist. She is the founder of the Open Culture Foundation. == Early life == Nataliya Resh was born in Nezhin, Chernihiv Oblast, Ukraine. In 1999, she entered the 3rd year of the Financial University in Rostov-on-Don, specializing in “Financier”. In 2002—2005, she received her 2nd higher education in Moscow, at the Peoples' Friendship University of Russia (RUDN). She graduated with a red diploma in civil law. In 2007, Nataliya entered the Moscow State Art and Culture University, in “Faculty of General Arts Branding and Psychology”. She graduated with a red diploma, having received the specialization “Image-maker- Psychologist”. In 2008, Nataliya Resh completed an intensive course at the Institute for Continuing Education for Media Broadcasting in Moscow. She qualified as a “TV and radio host”. == Foundation == In 2014, the Open Culture Foundation was founded and registered in the United Kingdom by Nataliya Resh. The foundation's positioning is based on the idea of supporting and popularizing projects in the field of culture and art. Art also highlights the world's current issues, including environmental protection. Nataliya Resh takes an active position in helping the environment and promoting ecophilosophy in her projects and everyday tasks. The Open Culture Foundation participated in the preparation of a major exhibition of Young British Artists in the framework of cultural exchange between the United Kingdom and Russia, he was a Member of the Board of the Moscow Biennale of Contemporary Art, he was a Member of Council at the Institute of Contemporary Art, and provided general support for the draft International film festival for people with peculiarities of mental and motor vehicles. In September 2014, he participated in the Internatinal Film Festival on Disabilities, Cannes. In 2015—present, the foundation works with the Better World Forum. In September 2019, he held events at the climate change summit in New York. In September 2020, he was a partner at a charity event at the Venice Film Festival and Better World Forum. == References == == Other websites == * Category:Living people Category:1980 births Category:People from Chernihiv Oblast",
 "title": "Nataliya Resh"
}