{
 "id": "816852",
 "text": "is a type of Japanese paper that is made in Echizen, Fukui Prefecture, Japan. Echizen washi is the best in Japan in terms of quality, variety, and production volume. The most distinctive feature of Echizen Washi is the variety. It can be roughly divided into 8 types, and the large division can be divided into very fine types. Each Echizen Washi has various uses, including everyday paper such as sliding doors and shoji paper, wrapping paper, and postcards, as well as official paper. Among them, Echizen Hoshoshi (越前奉書紙) and Echizen Torinokogami (越前鳥子紙) are Echizen washi that designated important intangible cultural properties of Japan. ==History== === The Legend of Kawakami Gozen === There is a legend about the origin of Echizen Washi. :A beautiful goddess has appeared to the villagers who live in poverty because they are not suitable for farmland. The goddess said, \"This village is located between mountains and there are few fields, making it difficult to live in. However, there are plenty of rivers and mountains with clean water. If you work with papermaking, your life will be easier.\" When asked by a delighted villager for her name, she only replied \"I live upstream on the Okamoto River\" and went away. The villagers worshiped the goddess as \"Kawakami Gozen(literally \"the lady of the upper reaches\")\" and built a shrine. Otaki Shrine remains in Echizen City as the only shrine in Japan that enshrines the goddess of paper. ==== History of Echizen Washi ==== :Echizen washi has a history of about 1,500 years. In 4~5c, ancient (old) documents in Shōsō-in confirmed the existence of Echizen washi but it is said that Echizen washi had made before it. In the early days, Echizen washi was used as a sutra paper. In 1341, The paper was named “Echizen-hosho” and began to produced and used in large quantities as official documents for the higher classes. Echizen washi developed under the protection of the shogunate and lords. In 1661, the first Japanese biils, “hansatsu“, are published in Fukui Prefecture and made in Echizen washi production areas. In 1868 the first Japanese official bills \"Dajokansatsu\" were published and made in Echizen washi production area. (As a result of the government's review and comparison of bills issued by various clans throughout Japan, Echizen washi was considered to be the best quality in Japan.) :The Birthplace of Paper Money. :During the Edo period (1603-1868), the Fukui domain produced paper money that could be used for transactions within the domain, and was one of the first in Japan to use paper money. Later, in the Meiji era (1868-1912), paper from Goka, ‘Echizen washi’, was also used for banknotes issued by the government. Although today's yen banknotes are not printed on Goka paper, it is no exaggeration to say that the paper produced here is the direct ancestor of Japan's modern banknotes. : == How to make == === Materials === The raw materials for Echizen Washi are kozo, mitsumata, and ganpi. Hemp and wood pulp are also materials. Paper is squeezed using the fibers of these trees and glue extracted from plants such as Abelmoschus manihot called \"neri\". ==== How to make Echizen Washi ==== The traditional technique of making Echizen washi is still inherited. # Shave the bark of the raw material. # Soak the remaining materials in step 1 in water and then wash. This process softens the materials. # To further soften them, boil them in water with calcium carbonate such as lye, and then steam them. This prosses makes it easier to remove impurities from fibers. # Soak the fiber of step 3 in running water to wash away the lye that comes out when boiling and impurities. # Remove the remaining impurities by hands. # On a table, beat with a stick made of hard wood to loosen the fibers. # Fill with water in a tank that strains Japanese paper, add the beaten fiber and \"Neri (role of glue)\" and mix. Scoop the liquid into a mold and rock it to form a layer of paper. # The wet papers are placed on a board called \"紙床板(sisyo-ita)\" and squeezed to remove water. # Stick the paper of step8 on the board one by one and dry it. It used to be sun-dried, but now it is done in a drying room. The dried paper is checked one by one to make sure there are no scratches or stains, and it's done. ==Producing Area== The Goka area is Otaki-cho, Echizen City, a production center for Echizen Japanese paper, which is said to have started 1,500 years ago. It consists of Iwamoto-town, Oizu-town, Odaki-cho, Sadatomo-town, and Shinzaike-town. ==Facilities == Echizen Washi Village *Udatsu Craft Center In the Udatsu Museum and Workshop, visitors can see how artisans make Echizen washi by using traditional tools and technique. *Museum of Washi & Culture Exhibits explain the origin and history of Echizen washi, manufacturing process and examples of Echizen washi use. *Papyrus House Visitors can create their own original Japanese paper. ==References== 4\\. Paper & Culture Museum Exhibits ==Other Websites== *Echizen Kamisuki Uta (Echizen Paper Making Song) *https://www.kyogei.co.jp/shirabe/kyoudo/text23.html Category:Japanese paper",
 "title": "Echizen Washi"
}