{
 "id": "81688",
 "text": "The Carme group is a group of retrograde non-spherical moons of Jupiter that follow similar orbits to Carme and are thought to have a common origin. Their semi-major axes (distances from Jupiter) range between 22,900,000 and 24,100,000 km, their inclinations between 164.9° and 165.5°, and their orbital eccentricities between 0.23 and 0.27 (with one exception). The core members include (from biggest to smallest): Scott S. Sheppard, David C. Jewitt, Carolyn Porco Jupiter's outer satellites and Trojans, In: Jupiter. The planet, satellites and magnetosphere. Edited by Fran Bagenal, Timothy E. Dowling, William B. McKinnon. Cambridge planetary science, Vol. 1, Cambridge, UK: Cambridge University Press, , 2004, p. 263 - 280 Full text(pdf). David Nesvorný, Cristian Beaugé, and Luke Dones Collisional Origin of Families of Irregular Satellites, The Astronomical Journal, 127 (2004), pp. 1768–1783 Full text. * Carme (the biggest, which gives its name to the group) * Taygete * EukeladeListed by Nesvorny 2004 as a possible member, not listed by Sheppard 2004; the orbital elements confirmed by Jacobson 2004 * S/2003 J 5 * Chaldene * Isonoe * Kalyke (redder than the others) * Erinome * Aitne * Kale * Pasithee * S/2003 J 9 * S/2003 J 10 The International Astronomical Union (IAU) reserves names in -e for all retrograde moons, including this group's members. ==Origin== The Carme group may once have been a single body that was broken apart by an impact. Further support to the single body origin comes from the known colours: all the moons appear light red,Grav, Tommy; Holman, Matthew J.; Gladman, Brett J.; Aksnes, Kaare Photometric survey of the irregular satellites, Icarus, 166,(2003), pp. 33-45. Preprint and infrared spectra, similar to D-type asteroids. Tommy Grav and Matthew J. Holman Near-Infrared Photometry of the Irregular Satellites of Jupiter and Saturn,The Astrophysical Journal, 605, (2004), pp. L141–L144 Preprint ==References== Category:Jupiter's moons",
 "title": "Carme group"
}