{
 "id": "816988",
 "text": "Echizen Ono Castle is a Japanese castle that is in Ono City, Fukui Prefecture. Until the Meiji period, the administrative headquarters of the Ono Domain region was established. In 2017, it was included in \"Second series Top 100 Japanese Castle\". The castle which appears every conditions are met in the morning, is called \"castle in the sky (天空の城)\". In 1575, Nagachika Kanamori began to build a castle on Kameyama mountain, a small mountain in Ono County. It took several years to build the castle. After the Kazunori Aoki’s era, the Echizen Matsudaira family became a shogunal property, and the castle owner changed many times until the Doi family got it. The castle burned down in 1775 and was rebuilt in 1795 with the exception of the castle tower, but it was destroyed again after the Meiji Restoration. The castle tower today was built in the Shōwa period (1968). == Castle tower == Echizen Ono Castle had a large watchtower on the second and third floors with an observation tower in the main area and another smaller watchtower on the second floor. It also had multiple Kuruwa--districts limited by water, fence, or anything else. These districts were the secondary area of a castle (二ノ丸, Ninomaru) and the furthest outer area (三ノ丸, Sannomaru) at the beginning of the Kameyama mountain, connecting a canal and a river to protect the castle tower. Protecting the castle tower was important role for Echizen Ono castle. == Stone wall == Echizen Ono Castle has a stone wall (石垣, ishigaki) which is a wall or fence made by assembling stones, with a construction method called Nozura-zumi (野面積み), which is an old style stone wall piled up without processing natural stone. Nozura-zumi has a good drainage, which are resistant to weathering. This is nowadays a valuable historic site. == Lords of Echizen Ono Castle == In the history of Echizen Ono Castle, 19 different feudal lords have changed (大名, daimyo), until the time in which the castle was sold in 1872. In addition to Nagachika Kanamori, the castle owners of the Azuchi-Momoyama period included Kazunori Aoki, who is said to be related to Hideyoshi Toyotomi, and Hideo Oda, the grandson of Nobunaga Oda. * Nagachika Kanamori (金森 長近) * Hidekazu Hasegawa (長谷川 秀一) * Kazunori Aoki (青木 一矩) * Hidekatsu Oda (織田 秀雄) * Masaaki Tsutsiya (土屋 正明) * Tadatsugu tsuchiya (土屋 忠次) * Masakatsu Oguri (小栗 正勝) * Naomasa Matsudaira (松平 直政) * Naomoto Matsudaira (松平 直基) * Naoyoshi Matsudaira (松平 直良) * Naoaki Matsudaira (松平 直明) * Toshifusa Doi (土井 利房) * Toshimoto Doi (土井 利知) * Toshihiro Doi (土井 利寛) * Toshisada Doi (土井 利貞) * Toshinori Doi (土井 利義) * Toshikata Doi (土井 利器) * Toshitada Doi (土井 利忠) * Toshitsune Doi (土井 利恒) == References == == Books used == * 吉田純一『福井の城ー福井・丸岡・大野・小浜・鯖江城』フェニックス出版、(1994) * 吉田純一『福井の城あれこれ話』FUT福井城郭研究所、(2015) Category:Castles in Japan Category:16th-century buildings and structures Category:Buildings and structures in Fukui Prefecture",
 "title": "Echizen Ono Castle"
}