{
 "id": "817070",
 "text": "Kaja Kallas (born 18 June 1977) is an Estonian politician and lawyer. Kallas is the High Representative of the Union for Foreign Affairs and Security Policy and Vice-President of the European Commission since 1 December 2024. She was the Prime Minister of Estonia from 26 January 2021 to 23 July 2024. She is the first woman to be Prime Minister of Estonia. Kallas was the leader of the Reform Party from 2018 until 2024. She was a member of the Riigikogu from 2011 to 2014 and again from 2019 to 2021. Kallas was a Member of the European Parliament from 2014 to 2018. Before entering politics, Kallas was a lawyer that focused on European Union law. During her time in the European Parliament, Kallas became popular for her knowledge of technology and business policies. She worked on the Digital Single Market strategy and consumer protection policies. At the end of her term, she was called by Politico as one of the 40 most influential MEPs, and one of the most powerful women in Brussels. Kallas became prime minister in 2021 following Jüri Ratas' resignation after a corruption scandal, leading her to create a Reform-led coalition government with the Centre Party. Her father was former Prime Minister Siim Kallas. During her time as prime minister, Kallas became well known for her support of Ukraine during the Russian invasion of the country in 2022. Her support of Ukraine led the New Statesman to call her \"Europe's New Iron Lady\". Kallas helped delivered more military equipment to Ukraine in terms of GDP per capita than any other country in the world. A critic of Russia, she supports Ukraine's right to defend itself while asking other countries to help out. In July 2022, her second government was sworn-in, which was a three-party coalition by the Reform Party, Social Democratic Party, and Isamaa. In March 2023, Kallas led the Reform Party to victory in the 2023 parliamentary election, increasing the party's seat count in the Riigikogu by three seats. After the election result, Kallas created a coalition government with Estonia 200 and the Social Democratic Party. In June 2024, Kallas was nominated to become High Representative of the Union for Foreign Affairs and Security Policy. She resigned as prime minister on 15 July 2024 and left office a week later when a new government was sworn-in. She was confirmed as High Representative four months later in November. ==Early life== Kallas was born in Tallinn on 18 June 1977. Her father Siim Kallas is a former Prime Minister of Estonia. When her mother, Krisit, was six months old, she was deported from the Soviet Union during its occupation of the Baltic states in 1940.Even further from Russia: what is known about the new head of the Estonian government, Europeeska Pravda, 26 January 2021 Kallas graduated from the University of Tartu in 1999 with a bachelor's degree in law. She lived in France and Finland for a short while so that she could study European law. From 2007, she went to the Estonian Business School where she earned an Executive Master of Business Administration (EMBA) in 2010. ==Professional career== Kallas became a member of the Estonian Bar Association in 1999, and an attorney-at-law in 2002. She became a partner in law firm Luiga Mody Hääl Borenius and Tark & Co, and worked at the Estonian Business School. She is also a member of the European Antitrust Alliance. In 2011, she was no longer an active member of the Estonian Bar Association. Between 2003 and 2010, Kallas was a council member of some Estonian private and public limited companies: LHV-Seesam Varahaldus, Pakri Tuulepark, Viru-Nigula Tuulepark, Hiiumaa Offshore Tuulepark, Paldiski Tuulepark, Tooma Tuulepark, Roheline Ring Tuulepargid, Biofond and 4E Tehnoinvest. In 2008, Kallas was a board member of Nelja Energia. From 2009 to 2010, Kallas was a board member of the Estonian Wind Power Association. ==Political career== ===National politics=== In 2010, Kallas joined the Estonian Reform Party. In the 2011 parliamentary elections, she won a seat in the Riigikogu. She was a member of the 12th Parliament of Estonia and chaired the Economic Affairs Committee from 2011 to 2014. Returning to national politics, on 13 December 2017, the Reform Party leader Hanno Pevkur announced that he would no longer run for the party leadership in January 2018, and wanted Kallas to replace him. Kallas announced on 15 December 2017 that she would run in the leadership election. Kallas won the leadership election held on 14 April 2018 and became the first female leader of a major political party in Estonia. In the 2019 Estonian parliamentary election on 3 March, the Reform Party led by Kallas won about 29% of the vote, with the Estonian Centre Party taking 23%. The Centre Party were able to form a second cabinet in Jüri Ratas' government. On 14 November 2020, Kallas was re-elected as leader of the Reform Party at a Reform Party Assembly. ===European Parliament=== In 2014, Kallas was elected to the European Parliament, winning 21,498 votes. In the European Parliament, Kallas was on several committees that focused on businesses, energy and consumer protection. She was a vice-chair of the Delegation to the EU–Ukraine Parliamentary Cooperation Committee as well as a member of the Delegation to the Euronest Parliamentary Assembly and Delegation for relations with the United States. Kallas was a member of the European Parliament Intergroup on the Digital Agenda, and was also a vice-chair of the Youth Intergroup. Kallas worked on the Digital Single Market strategy, energy, and consumer policies, and relations with Ukraine. She defended the rights of small businesses, and defended digital companies. She is a supporter of the idea that regulations cannot slow down the creation of new technologies. Kallas was in charge of six reports: opinion on the ePrivacy Regulation, civil law rules on robotics, on the Annual report on EU Competition Policy, and on Delivering a New Deal for Energy Consumers, legislation on Custom infringements and sanctions, and the report on the Digital Single Market. During her time in Parliament, she was also nominated as a European Young Leader (EYL40). At the end of her term, she was called by Politico as one of the 40 most influential MEPs, and one of the most powerful women in Brussels for her understanding of technological issues. In November 2018, Kallas wrote her memoir MEP: 4 aastat Euroopa Parlamendis (MEP: Four Years in the European Parliament), in which she wrote about her life and work in Brussels from 2014 to 2018. ==Prime Minister of Estonia== On 25 January 2021, after the resignation of Jüri Ratas as prime minister after a corruption scandal, Kallas's first cabinet, a Reform-led coalition government with the Centre Party, was formed. She became the first female prime minister in Estonia's history. After her resignation on 14 July 2022, Kallas' second cabinet was sworn in on 18 July. The new government was a three-party coalition by the Reform Party, Social Democratic Party, and Isamaa. Her last government had lost its parliamentary majority after the Centre Party left the coalition. In March 2023, Kallas led the Reform Party to victory in the 2023 parliamentary election, increasing the party's seat count in the Riigikogu by three seats. After the election result, Kallas created a coalition government with Estonia 200 and the Social Democratic Party. Her third cabinet was sworn in on 17 April. ===Domestic policies=== In her time as prime minister, the 2021–2023 global energy crisis had an impact on the Estonian economy. Businesses were forced to temporarily shut down, while the public asked the government to help pay for the high electricity and heating prices. Kallas, at first, did not want the government to help out, saying that the government should search for better solutions instead of handing out government benefits. The energy crisis nearly ended the coalition government. Kallas said in a speech that the high cost of natural gas and the effects of the Russia-Ukraine crisis was causing the increase in energy prices. She said that the green energy measures Estonia created limited what the government could do to handle the crisis. In January 2022, Kallas announced a 245 million euro plan to lower the cost of energy from September 2021 to March 2022. The energy crisis had made her unpopular. In June 2023, the government passed a bill legalising same-sex marriage and same-sex adoption in Estonia. The bill will come into effect on 1 January 2024, making Estonia the first Baltic state and country formerly occupied by the Soviet Union to legalise same-sex marriage and adoption. ===Foreign policies=== During the 2021–2022 Russo-Ukrainian crisis, Kallas said that the Nord Stream 2 natural gas pipeline was \"a geopolitical project not an economic one\" and wanted the pipeline project to end. She also said that Europe's use of Russian natural gas was a large political problem. In January 2022, Kallas said that Estonia would give howitzers to Ukraine to help them defend themselves during a Russian invasion. The howitzers were made in Germany so Kallas needed to wait for their approval first. When Germany took awhile to respond, Estonia sent American-made Javelin anti-tank missiles instead in the first weeks of February 2022. After Russia's recognition of the Donetsk and Luhansk people's republics, Kallas wanted the European Union to sanction Russia. Kallas' leadership was praised during the Russia-Ukraine crisis. Her approval rating were high, making her Estonia's most popular politician. After the 2022 Russian invasion of Ukraine started on 24 February, Estonia along with other allies pushed for NATO to start Article 4. Kallas promised to support Ukraine with political and weaponry support. By April 2022, 0.8% of Estonia's GDP in military equipment had been given to Ukraine. Her support of Ukraine led the New Statesman to call her \"Europe's New Iron Lady\". She also strongly supported the idea of Ukraine being added to the European Union. In April 2022, she warned against \"peace at any price\" with Russia. As prime minister, Kallas delivered more military equipment to Ukraine in terms of GDP per capita than any other country in the world. In September 2022, she made it harder for Russian tourists to travel to Estonia. In February 2023, Kallas was mentioned as a possible candidate to replace NATO Secretary-General Jens Stoltenberg, however, outgoing Dutch Prime Minister Mark Rutte was picked instead in June 2024. She rejected any peace agreement that would give any part of Ukrainian territory to Russia. Kallas condemned Hamas' actions during the 2023 Israel–Hamas war and showed her support to Israel and its right to self-defence, however said that Israel \"must do so in a way that spares innocent lives and adheres to the norms of international law\". She said the problems in the Middle East were a distraction to the \"free world\" from supporting Ukraine. ===Stark Logistics and Metaprint scandal=== In August 2023, the media reported that Kallas's husband, Arvo Hallik, had a 24.9% share in the transportation company Stark Logistics, which had continued to work in Russia following the Russian invasion of Ukraine. This was controversial because Kallas wanted Estonian companies to stop working with Russia. The company had generated earned €1.5 million in revenue from its business in Russia since the beginning of the invasion. Kallas said that her husband did have a share in the company, but said they did nothing wrong. She said her husband was helping an Estonian client, later discovered to be Metaprint, to end its business deals in Russia. Stark Logistics supported Kallas's claim that the company's dealings in Russia were to help an Estonian client end their production in the country. It was later reported that Metaprint sold €17 million worth of goods to Russia between the start of the invasion in February 2022 and November 2022. President of Estonia Alar Karis said that he was worried that Estonia's credibility was ruined and that its allies would have a hard time trusting them. Two opinion polls showed that a majority of people believed that Kallas should resign due to the scandal. Kallas continued to refuse to resign in September 2023, calling the controversy a \"witch-hunt\" by political opponents. ===Russian arrest warrant=== On 13 February 2024, Russian officials said that Kallas had been put on the Russian interior ministry's register of people wanted on criminal charges. This is because Kallas removed Soviet World War II monuments in Estonia. Kallas is the first head of government known to be added to the register by Russian officials. Kallas ignored the warrant and called it a \"scare tactic\" by Russia. ===Resignation=== On 28 June 2024, Kallas was nominated to become High Representative of the Union for Foreign Affairs and Security Policy. The next day, the Reform Party picked Kristen Michal to be her replacement as prime minister. Kallas resigned as prime minister on 15 July 2024. A week later, on 23 July, Kallas's replacement Kristen Michal and his government was sworn-in. ==European Union High Representative for Foreign Affairs and Security Policy== In November 2024, Kallas was confirmed by the European Parliament to be the High Representative of the European Union for Foreign Affairs and Security Policy. In doing so, Kallas also became Vice- President of the European Commission under the commission of Ursula von der Leyen. During her nomination period, Kallas said that the People's Republic of China must pay a \"higher cost\" for its support of the Russian invasion of Ukraine. ===Tenure=== Kallas was sworn-in on 1 December 2024. Hours after being sworn-in, Kallas visited Ukrainian President Volodymyr Zelenskyy in Kyiv to talk about the Russian invasion. The trip was not supported by Slovak Prime Minister Robert Fico, who said that Kallas made statements that were not supported by EU members. That same day, Kallas also warned the Georgian government not to use violence to stop the ongoing protests against the leading party's decision to end talks about the country joining the EU. She said she might sanction the country should they use violence. In December 2024, she supported the fall of the Assad regime, saying that \"Syria shows that Russia is not invincible. We should not underestimate our own power.\" On 11 February 2025, Kallas criticized China's support for Russia's invasion of Ukraine, saying that \"Without China’s support, Russia would not be able to continue its military aggression with the same force. China is the largest provider of dual-use goods and sensitive items that sustain Russia’s military- industrial base and that are found on the battlefield in Ukraine.\" That same month, she criticized a call between U.S. President Donald Trump and Russian President Vladimir Putin. Kallas said said she did not believe that Trump's plans to negotiate a peace deal in the Russia-Ukraine war, believing it would only benefit Russia. After President Trump and his Vice President JD Vance, had a confrontation in the White House with the Ukrainian President Volodymyr Zelenskyy on 28 February 2025, Kallas said that the \"free world needs a new leader\". ==Personal life== Kallas was married to Roomet Leiger from 2002 to 2006. Until 2014, she lived together with former Estonian politician and businessman Taavi Veskimägi. Kallas and Veskimägi have one son. In 2018, she married Arvo Hallik, a banker and investor. Hallik has two children from a another relationship. Apart from her native Estonian, Kallas is fluent in English, Russian and French. ==Honours== * Grand Cross of the Order of the Star of Romania (2021) * Commander Grand Cross of the Royal Order of the Polar Star (Sweden, 2023) * Order of Prince Yaroslav the Wise, 2nd class (Ukraine, 2023) ==References== ==Other websites== * Category:1977 births Category:Living people Category:Politicians from Tallinn Category:Prime Ministers of Estonia Category:MEPs for Estonia Category:Estonian writers Category:European lawyers Category:High Representatives of the Union for Foreign Affairs and Security Policy",
 "title": "Kaja Kallas"
}