{
 "id": "817087",
 "text": "A for Andromeda is a media drama written by Fred Hoyle and John Elliott for BBC television. It was originally presented in these forms: *A for Andromeda: 1961 BBC tv series *The Andromeda Breakthrough: 1962 sequel for BBC *A come Andromeda: 1971 Italian film for television *A for Andromeda 2006 film for BBC Four: essentially a remake of the 1961 tv series.It got over half a million viewers. \"Weekly Viewing Summary: Multichannel Top 10 BBC4 – w/e 02/04/2006\". BARB. [\"Weekly Viewing Summary: Multichannel Top 10 BBC4 – w/e 02/04/2006\". BARB.] There are book versions of the three works in English. They are listed in the usual sources, for example . Although at first sight the authors seem to have suggested the signal is connected with the galaxy Andromeda, further thought suggests that \"from the direction of Andromeda\" could describe a source within our own galaxy. And so the authors avoid the implication that the message would have taken 2.5 million years in arriving, but could come from within our own galaxy. The message might come from as close as 420 light years away. == Plot line == The main plot line is that a radio astronomer gets a series of impulses from the direction of the Andromeda galaxy. He interprets the message as instructions to build an advanced computer. When this is done, the computer instructs them as to how they can build a living individual. This they do. In the original BBC version Julie Christie plays Andromeda. The lead scientist fears that her purpose is to enslave humanity. == Property rights in the series == The original BBC tv versions have been mostly destroyed, and Christie was not signed up for the sequels. When the sequel was written, Christie had become too expensive for the BBC to hire again. At that time the BBC did not perhaps understand the concept of \"property rights\", an important part of the modern world. Media creations are properties. Property is not to be thought of as just buildings: any creative act is potentially a property in the sense of copyright.Think of Jurassic Park in all its versions and sequels. == References == Category:BBC television dramas Category:Science fiction books Category:Movies set in the future",
 "title": "A for Andromeda"
}