{
 "id": "817620",
 "text": "Ancient Kangleipak was an ancient, lesser known civilisation, consisting of the modern day Kangleipak (Manipur), India, and other neighboring regions. The Kangla served as the foremost capital city of this realm from the 15th century BC upto the late 19th century AD. It has its earliest evidence of monarchy right from 15th century BC, during the reign of Emperor Tangja Leela Pakhangba (1445 BC-1405 BC). ==History== The imperial history of Ancient Kangleipak began with the reign of Tangja Leela Pakhangba in 1445 BC. The game of polo (Sagol Kangjei) was invented during the reign of King Kangba (1405 BC-1359BC), the successor of Tangja Leela Pakhangba. This remarkable achievement was recorded in many ancient Meitei scriptures including the Kangbalon and the Kangjeirol. ===Ancient rulers=== There is a genealogy of ten successive foremost rulers in ancient Kangleipak kingdom. Name of the rulers Period (in Christian year) Period (in Maliyapham year) Taang-jaa Lee-La Pakhangpa 1445 BC- 1405 BC - Ningthou Kangba 1405 BC- 1359 BC 00 MF- 39 MF Maliyapham Palcha 1359 BC- 1329 BC 39 MF- 69 MF Ningthou Kaksuba 1329 BC- 1297 BC 69 MF- 101 MF Ningthou Tonkonba 1297 BC- 1276 BC 101 MF- 122 MF Ningthou Pottingkoi 1276 BC- 1251 BC 122 MF- 147 MF Ningthou Laanbichaa 1251 BC- 1229 BC 147 MF- 169 MF Ningthou Sapaiba 1229 BC- 1209 BC 169 MF- 189 MF Ningthou Puthiba 1209 BC- 1199 BC 189 MF- 199 MF After the reigns of these ten kings, there is a great historical gap, from 1199 BC to 44 BC. Name of the rulers Period (in Christian year) Period (in Maliyapham year) Samlungphaa 44 BC- 34 BC 1354 MF- 1364 MF Poireiton 34 BC- 18 BC 1364 MF- 1380 MF Singtabung 18 BC- 08 BC 1380 MF- 1390 MF Paangminnaba 08 BC- 01 BC 1390 MF- 1397 MF Luwang Khunthiba 01 BC- 05 AD 1397 MF- 1403 MF Luwang Punshiba 05 AD- 33 AD 1403 MF- 1431 MF After this, the reign of Nongta Lailen Pakhangpa started from 33 AD, with the annexation of the Kangla by the Ningthouja dynasty. ==Geography== The territory of Kangleipak is mountainous and thereby, ancient Kangleipak consists of several smaller region each with its own dialect, cultural peculiarities, and identity. In fact, there were seven independent kingdoms ruled by the seven clan dynasties in Ancient Kangleipak. These seven principalities had their own capital cities. Capital cities Latin transliteration Respective kingdoms Latin transliteration Ruling dynasties Latin transliteration ꯏꯝꯐꯥꯜ ꯀꯪꯂꯥ Imphal Kangla ꯏꯝꯐꯥꯜ Imphal ꯅꯤꯡꯊꯧꯖꯥ (ꯃꯉꯥꯡ) Ningthouja (Mangang) ꯂꯨꯋꯥꯡꯁꯪꯕꯝ ꯀꯪꯂꯥ Luwangsangbam Kangla ꯂꯨꯋꯥꯡꯁꯪꯕꯝ Luwangsangbam ꯂꯨꯋꯥꯡ Luwang ꯅꯣꯡꯌꯥꯢ ꯂꯩꯀꯣꯢꯄꯨꯡ Nongyai Leikoipung ꯃꯌꯥꯡ ꯏꯝꯐꯥꯜ Mayang Imphal ꯈꯨꯃꯟ Khuman ꯀꯣꯡꯕ ꯃꯔꯨ ꯀꯪꯂꯥ Kongba Maru Kangla ꯀꯣꯡꯕ ꯃꯔꯨ Kongba Maru ꯑꯉꯣꯝ Angom ꯃꯣꯢꯔꯥꯡ ꯀꯪꯂꯥ Moirang Kangla ꯀꯦꯀꯦ ꯃꯣꯢꯔꯥꯡ Keke Moirang ꯃꯣꯢꯔꯥꯡ ꯁꯂꯥꯢ Moirang Salai ꯇꯥꯛꯅꯈꯥ ꯄꯨꯔꯨꯛ ꯁꯧꯄꯤ ꯀꯪꯂꯥ Taknakha Puruk Soupi Kangla ꯇꯥꯛꯅꯈꯥ ꯄꯨꯔꯨꯛ ꯁꯧꯄꯤ Taknakha Puruk Soupi ꯈꯥ ꯉꯥꯟꯄ Kha Nganpa ꯂꯩꯁꯪꯈꯣꯡ ꯀꯪꯂꯥ Leishangkhong Kangla ꯂꯩꯁꯪꯈꯣꯡ Leishangkhong ꯁꯂꯥꯢ ꯂꯩꯁꯥꯡꯊꯦꯝ Salai Leishangthem ==Language== The Ancient Meitei language (early form of the modern Meitei language) had a big collection of Meitei scriptures (Puya (Meitei texts)), of numerous topics, written in the archaic Meitei script. One of the oldest scriptures is the Wakoklon Heelel Thilen Salai Amailon Pukok Puya, written in 1398 BC (verified by the National Archives of India, New Delhi).http://paochelsalaitaret.net/puya/puyaproof.pdf ==Culture== ===Daily life=== Most people of ancient Kangleipak were farmers tied to their lands. Their dwellings were restricted to immediate family members. ===Architecture=== The ancient architectural designs of common houses were believed to be sustainable, eco friendly and affordable. It gives a cooling effect during hot summer and a warming effect during chilling winter. ===Religious beliefs=== The ancient religion of the indigenous ethnicities of the hills and the plains is the Sanamahism. The abstract concept of the space time entity is the ultimate God creator of the universe. Beliefs in the divine and in the afterlife were ingrained in ancient Kangleipak from its inception. The ancient rulers were based on the divine right of kings. ==Military== ===Lallup system=== Lal-lup system (literally, Lal means war; lup means club or association or organization) was a predominant system in ancient Kangleipak. According to the system, every men of indigenous ethnicity of above 16 years of age was a member. ==Gallery== File:Kangla_Fort_Complex,_Imphal_(10).jpeg File:Knagla_fort,_manipur,_India_2.jpg File:The_kangla.jpg File:Kangla_Fort_Complex,_Imphal_(221).jpeg File:Knagla_fort,_manipur,_India.jpg File:Knagla_fort,_manipur,_India_6.jpg File:Kangla_Fort_Complex,_Imphal_(36).jpeg File:Uttra sanglen.jpg File:Temple of God Pakhangba of Sanamahi religion inside the Kangla Fort, Imphal West, Manipur.jpg File:Knagla fort, manipur, India 5.jpg File:Pakhangba_Temple_at_Kangla_Fort.JPG File:Knagla fort, manipur, India 3.jpg File:Flag of Manipur hoisted on the Independence Day 1947.jpg File:Stone Erections of Willong Khullen.jpg File:Temple at Kangla.jpg File:Uttra Sanglen.JPG File:Pakhangba Temple, Kangla, Imphal West district, Manipur, India (2017).jpg File:Knagla_fort,_manipur,_India_4.jpg ==Related pages== * Ancient Meitei Science and Technology * King Tang of Shang of China * Puya Mei Thaba * Bihu Loukon * Stonehenge of Manipur ==References== ==Other websites== * * Discovery of Kangleipak * The Kingdom of Manipur * Thawan Thaba burial discovery A medieval findings lost amidst tragic ignorance By Phanjoubam Chingkheinganba Category:History of Manipur",
 "title": "Ancient Kangleipak"
}