{
 "id": "817640",
 "text": "An online encyclopedia, also called an internet encyclopedia, or a digital encyclopedia, is an encyclopedia accessible through the internet. Such as Wikipedia, which is an example of an encyclopedia, just online. == Digitization of old content == On 25 October 1993, Rick Gates created Interpedia to the PACS-L (Public-Access Computer Systems Forum) Listserv. That message included the following musings: : \"The more I thought about this, the more I realized that such a resource, containing general, encyclopedic knowledge for the layman, would be an important tool for some types of research, and for the Net.Citizenry in general. : \"Ahh.. but what about contributors... where will you find authors to write the short articles you need? Well, I'd first have to start out by finding some way of communicating with an extremely diverse set of people... everyone from linguists, to molecular biologists, from animal rights activists to zymurgists, and from geographers to gas chromotographers. Guess what? :-) The Net provides just such an arena! So I thought about it some more...and came to the conclusion that this is a good idea!\" In January 1995, Project Gutenberg started to publish the ASCII text of the Encyclopædia Britannica, 11th edition (1911), but disagreement about the method halted the work after the first volume.[citation needed] For trademark reasons this has been published as the Gutenberg Encyclopedia.[citation needed] Project Gutenberg later[when?] restarted work on digitising and proofreading this encyclopedia. Project Gutenberg has published volumes in alphabetic order. The most recent publication is Volume 17 Slice 8: Matter–Mecklenburg published on 7 April 2013.[needs update] The latest Britannica was digitized by its publishers, and sold first as a CD-ROM, and later as an online service. In 2001, ASCII text of all 28 volumes was published on Encyclopædia Britannica Eleventh Edition by source; a copyright claim was added to the materials included. The website no longer exists. Other digitization projects have made progress in other titles. One example is Easton's Bible Dictionary (1897) digitized by the Christian Classics Ethereal Library. A successful digitization of an encyclopedia was the Bartleby Project's online adaptation of the Columbia Encyclopedia, Sixth Edition, in early 2000 and is updated periodically. Other websites provide online encyclopedias, some of which are also available on Wikisource, but which may be more complete than those on Wikisource, or maybe different editions (see List of online encyclopedias). Category:Encyclopedia websites",
 "title": "Online encyclopedia"
}