{
 "id": "817896",
 "text": "Richard Lee McNair (born December 19, 1958) is an American criminal. He escaped from prison many times, but was taken back after he was spotted by a police officer in a very expensive van with homemade tinted windows. == 1987 arrest == In 1987, a month before his 30th birthday, McNair broke into and stole from a grain storage facility in Minot, North Dakota. He shot two men when stealing from another place that same year, and one of the men who McNair shot was killed. He was eventually arrested for the crimes, but when being questioned by police, he took lip balm out of his pocket and slipped his hands out of the cuffs the police had restrained him with during the arrest. He escaped the police station with the officers pursuing him from behind. McNair managed to hide inside a building when police officers came in to take him back to the police station. McNair jumped out of a window and crashed into a tree, but was injured when the branch he landed on snapped. After time in the hospital, McNair was housed at Ward County Jail in Minot, North Dakota. While serving time there, he broke through part of a wall in his cell, but police officers who worked there found out about it. After being moved to the North Dakota State Penitentiary, McNair and two other inmates escaped by crawling through the ventilation shaft. He went around the United States for ten months, but was arrested again and the officers marked him as a bad inmate, and moved him to the Oak Park Heights prison. == Moving to other prisons == McNair eventually joined a sit down plea that led to him being moved to Florence High Security Prison in Minneapolis. After serving time, he joined another plea that led to him being moved to a high security prison in Denver. After serving time in there, he was moved to a high security federal prison in Louisiana. There, his job was to fix damaged mail bags so they could be sent back to the post office. On April 5, 2006, McNair decided to create an escape pod and hide inside one of the mail bags in a pallet. The pallet was later shrink wrapped but McNair managed to use a tube that he could breathe through once he had secretly pushed through the packaging. When police took the mail bag outside, McNair escaped the prison. == Police experiences == Later that same day, he was running near train tracks when a police officer saw him. McNair told the officer that he did not escape prison, and that he was doing exercise in the area. McNair told the officer that he and his brother were staying at a hotel when he was actually escaping from prison. In 2007 after over a year, he was stopped by police in Canada when they had seen him driving a stolen car. While being questioned by an officer, McNair escaped from them again. During his time protecting himself from capture, McNair had been making fake identification cards, and used computer technology to create driver’s licenses and monitor what the press was saying about him. He also appeared on Canada’s 15 Most Wanted list multiple times. In November that same year, a police officer noticed a van that seemed to have homemade tinted windows. McNair had made the tints himself, but the officer was suspicious because the van looked like it was a lot of money. The officer took the plate number and called it in. The day after, another officer spotted the van. A chase started, and when McNair drove the van into a parking lot, he ran off, but was stopped by the officer. == Final prison sentence == McNair now resides in ADX Florence, a supermax prison where inmates are locked down twenty-three hours a day, and they leave their cells with correctional officers by their side, who make sure they cannot escape the prison. Category:American criminals Category:1958 births Category:Living people",
 "title": "Richard Lee McNair"
}