{
 "id": "818103",
 "text": "On 1 February 2021, there was a coup d'état in Myanmar. Important leaders including State Counsellor Aung San Suu Kyi and President Win Myint were detained as the military (Tatmadaw) took control of the government. == History == Myanmar (also known as Burma) has been under military rule before. General Ne Win led a coup in 1962. In 1988, many people protested against the military government because they were not happy with it. They wanted elections with many parties running so that normal people could change the government. The military killed many protestors.(3000-10000 as estimated). Aung San Suu Kyi is the daughter of General Aung San, who helped free Burma from British rule. After 1988, she became a pro-democracy activist. In 1990, her party, the National League for Democracy (NLD), won the elections in a landslide. However, the government refused to say that her party won. In 2015, Suu Kyi's party won the elections. However, she is not allowed to be president of the country because her family (her late husband Michael Aris and two sons) are British citizens. So she became State Counsellor, which is like a prime minister. In 2020, there was an election in Myanmar. The NLD won the election but Tatmadaw accused that there was an election fraud and made a coup at the early morning of February 1st of 2021. However, the proof that there was a fraud is not found, so far and people believes that Tatmadaw made the coup because the generals wants to restart the military dictatorship which ended about 10 years ago. After coup, people protests began in the whole country with many people because they wanted their elected government back but Tatmadaw disagree and killed many protesting people (around 1000 estimated), which led the People Defensive War, the national wide armed resistance against the military regime, == Events == Early in the morning of 1 February, Suu Kyi and other leaders in her party were taken away in a raid. Then the Internet and phone lines were cut off so that people could not talk to others inside or outside the countries. == Reactions == A lot of leaders in other countries around the world said that they were really worried about what was going on in Burma. ==References== Category:2021 in Asia Category:February 2021 events Category:Coups d'état 2021 coup Category:March 2021 events Category:April 2021 events",
 "title": "2021 Myanmar coup d'état"
}