{
 "id": "818328",
 "text": "Lesley J Saweard (born 1934) is an English retired actress and former schoolteacher. She is best known as the voice of Christine Barford in the BBC Radio 4 soap opera The Archers. == Early life == Lesley J Saweard was born in Grimsby, Humberside, England in 1934,England & Wales, Civil Registration Birth Index, 1916-2007: JUL 1934 7a 887 GRIMSBY – Lesley J Saweard as the younger of two children to William Montague Saweard (1889–1977)England & Wales, Civil Registration Birth Index, 1837-1915: OCT 1889 7a 645 CAISTOR – William Montague SaweardEngland & Wales, Civil Registration Death Index, 1916-2007: JUL 1977 (aged 87) 7 1694 LOUTH – William Montague Saweard and Hilda Louisa Saweard (née Kiddle;England & Wales, Civil Registration Marriage Index, 1916-2005: APR 1926 7a 1647 GRIMSBY – William M Saweard = Hilda L Kiddle 1897–1997).England & Wales, Civil Registration Death Index, 1916-2007: FEB 1997 (aged 99) 21C 199 LOUTH She has a elder sister, Barbara (born 1927).England & Wales, Civil Registration Birth Index, 1916-2007: JUL 1927 7a 990 GRIMSBY – Barbara Saweard Saweard trained in elocution and drama, but, having lived near a small market town, had never thought of becoming a professional actress. == Career == Saweard joined the cast of the BBC Home Service radio soap opera The Archers in 1953, as the voice of Christine Barford (born 21 December 1931), the sister of established character, Phil Archer. She had taken over the role from Pamela Mant. She left the serial in 1962 and the role of Christine was recast to Joyce Gibbs. She returned as Christine in 1968. She voiced Christine until her departure in 2019. Saweard worked as a provincial schoolteacher before being cast in The Archers. == Personal life == Saweard met Geoffrey Lewis, an actor, on the set of The Archers in 1954. The couple married in Kensington, London in January 1956.England & Wales, Civil Registration Marriage Index, 1916-2005: JAN 1956 5c 2986 KENSINGTON – Lesley J Saweard = George H E Lewis They had two children together; Simon (born 1962)England & Wales, Civil Registration Birth Index, 1916-2007: APR 1962 5c 1233 HAMMERSMITH – Simon Lewis and Sarah Jane (born 1967).England & Wales, Civil Registration Birth Index, 1916-2007: APR 1967 5b 906 HAMMERSMITH – Sarah Jane Lewis The couple remained married for 41 years until his death in 1997.England & Wales, Civil Registration Death Index, 1916-2007: JUL 1997 (aged 84) B55B 156 KENSINGTON AND CHELSEA – George Harrison E LewisEngland & Wales, Civil Registration Death Index, 1916-2007: JUL 1997 (aged 84) B55B 156 KENSINGTON AND CHELSEA – Geoffrey Lewis Saweard resides in Louth, Lincolnshire. == Filmography == === Radio === Year Title Role Notes Ref. 1953–1962, 1968–2019 The Archers Christine Barford === Television === Year Title Role Notes Ref. 1965 Sherlock Holmes Ellen Amberley Episode: \"The Retired Colourman\" 1981 Astronauts Mrs. Ackroyd Episode: \"We Are Not Alone\" == References == Category:1934 births Category:Living people Category:British movie actors Category:British television actors Category:British radio actors",
 "title": "Lesley Saweard"
}