{
 "id": "818593",
 "text": "North Sea Germanic, also known as Ingvaeonic , is a group of West Germanic languages that were first spoken in what is now northern Germany, the Netherlands, and Denmark. They were also spread to the British Isles in the Migration Period. The languages were Old Frisian, Old English and Old Saxon. They have become other languages since then and spread worldwide, especially the modern English language. The grouping was first proposed in Nordgermanen und Alemannen (1942) by German linguist and philologist Friedrich Maurer as an alternative to the strict tree diagrams, which had become popular following the work of 19th-century linguist August Schleicher and assumed the existence of a special Anglo-Frisian group. The other groupings are Istvaeonic, from the Istvaeones, which developed into Franconian, and Irminonic, from the Irminones, which developed into Upper German.Hans Frede Nielsen, Nordic-West Germanic relations, in: The Nordic Languages: An International Handbook of the History of the North Germanic Languages, volume 1 (series: Handbücher zur Sprach- und Kommunikationswissenschaft or short HSK 22.1), 2002, p. 558ff., here p. 558f. ==Old Ingvaeonic== Is the proto-language for ingvaeonic and your evolution from Proto-West Germanic. Nasal before a fricative became a ogonek in the anterior vowel, example: munþ → mųþ unþi → ųþi uns → ųs Is diffrent from others like Frank; and the dialects of he: Old High Franconian and Old Low Franconian. The Old Ingvaeonic change ō to œ: Frankō → Francó the pronunciation became diffrent, look at the pronounce of \"Ingƿó\": /iŋˈgwɔːː/ → /iŋˈgwɔː/ → /ˈiŋgwɒ/ ==Characteristics== *Palatalisation of velar consonants before front vowels; while the Anglo-Frisian languages further develop these palatal consonants into continuants like in church, Old Saxon did undergo palatalisation as evidenced by forms like kiennan \"know\" and kiesur \"emperor\" (contrast German kennen, Kaiser) as well as ieldan \"pay\", similar to English yield. *Only four unstressed vowels, those being /i~e/, /æ/, /ɑ/, and /o~u/, all of which are short, though only in Early Old English before the loss of unstressed /æ/ *Lack of i-mutation in s/z-stem plurals; compare Anglian OE \"lambs\" with OHG *The development of Class III weak verbs into a relic class consisting of four verbs (*sagjan \"to say\", *hugjan \"to think\", *habjan \"to have\", *libjan \"to live\") *The split of the Class II weak verb ending into : converted \"to make\" into *Development of a plural ending *-ōs in a-stem nouns. *Development of numerous new words, such as the replacement of *newun \"nine\" with *nigun and *minni \"less\" (adverb) with *laisi Changes originating in Ingvaeonic A, like Old Norse but unlike Gothic and Old High German, include: ==Sources== * Bremmer, Rolf H. (2009). An Introduction to Old Frisian. Amsterdam: John Benjamins B.V. . * Euler, Wolfram (2013). Das Westgermanische - von der Herausbildung im 3. bis zur Aufgliederung im 7. Jahrhundert - Analyse und Rekonstruktion (West Germanic: from its Emergence in the 3rd up until its Dissolution in the 7th Century CE: Analyses and Reconstruction). 244 p., in German with English summary, London/Berlin 2013, . * Maurer, Friedrich (1942) Nordgermanen und Alemannen: Studien zur germanischen und frühdeutschen Sprachgeschichte, Stammes- und Volkskunde, Strasbourg: Hüneburg. * Ringe, Donald R. and Taylor, Ann (2014). The Development of Old English - A Linguistic History of English, vol. II, 632p. . Oxford. * Sonderegger, Stefan (1979). Grundzüge deutscher Sprachgeschichte. Diachronie des Sprachsystems. Band I: Einführung – Genealogie – Konstanten. Berlin/New York: Walter de Gruyter. . * Voyles, Joseph B. (1992). Early Germanic Grammar: Pre-, Proto-, and Post-Germanic. San Diego: Academic Press. . ==References== Category:West Germanic languages",
 "title": "North Sea Germanic"
}