{
 "id": "818600",
 "text": "3 Idiots is a 2009 Indian Hindi-language coming-of-age comedy drama buddy film written, edited and directed by Rajkumar Hirani, co-written by Abhijat Joshi, produced by Vidhu Vinod Chopra under the production banner of Vinod Chopra Films. It was distributed by Reliance BIG Pictures. It was released in India on 25 December 2009. It is adapted loosely from Chetan Bhagat's 2004 novel Five Point Someone: What NOT to do at IIT! It is a cult film in the Hindi cinema. The film stars Aamir Khan, R. Madhavan and Sharman Joshi in the title roles. Kareena Kapoor, Boman Irani, Omi Vaidya, Mona Singh, Javed Jaffrey, Parikshit Sahni and Amardeep Jha also appear. There are two parallel dramas, one in the present and the other set ten years in the past. The story follows the friendship of three students at an Indian engineering college. It is a satire about the social pressures under the Indian education system. == Synopsis == Two friends embark on a quest for a lost buddy. On this journey, they encounter a long-forgotten bet, a wedding they must crash, and a funeral that goes, ridiculously out of control. Their inner journey is the story of their friend - the impressible free-thinker Rancho. He had touched and changed their lives. It is a story of their hostel days. It swings between Rancho's romance with the spirited Pia, and his clash with an oppressive mentor, Viru Sahastrabuddhe. And then one day, suddenly, Rancho vanished. Who was he? Where did he come from? Why did he leave? He was the friend who influenced and inspired them to think creatively and independently. The conformist world called them \"three idiots\". Where is the original idiot now? Finally, in misty mountains with unparalleled beauty, the friends find the key to the secret. == Cast == === Main === * Aamir Khan as Ranchhoddas Shyamaldas Chanchad (a.k.a. Rancho) / Phunsukh Wangdu; Pia's lover, Farhan and Raju's friend and Chatur's biggest college rival * R. Madhavan as Farhan Qureshi; Rancho, Raju and Pia's friend and Chatur's biggest college rival * Sharman Joshi as Raju Rastogi; Rancho, Farhan and Pia's friend and Chatur's biggest college rival * Kareena Kapoor as Pia Sahastrabuddhe; Rancho's lover, Farhan and Raju's friend, Virus' younger daughter and Mona's younger sister * Boman Irani as Dr. Viru Sahastrabuddhe (a.k.a. Virus); Pia and Mona's father and the director of the ICE * Omi Vaidya as Chatur Ramalingam (a.k.a. Silencer); Rancho, Farhan and Raju's biggest college rival === Supporting === * Mona Singh as Mona Sahastrabuddhe; Virus' older daughter and Pia's older sister * Javed Jaffrey as the real Ranchhoddas Shyamaldas Chanchad * Parikshit Sahni as Mr. Qureshi (nicknamed \"Hitler Qureshi\" by Rancho); Farhan's orthodox father * Amardeep Jha as Mrs. Rastogi (nicknamed \"Mother Teresa\" by Rancho); Raju's hardworking mother * Sanjay Lafont as Suhas Tandon; Pia's ostentatious and materialistic ex-boyfriend * Rahul Kumar as Manmohan (a.k.a. Millimeter); an errand boy at the ICE ** Dushyant Wagh as grown-up Manmohan (a.k.a. Centimeter); Rancho's personal assistant in Ladakh * Farida Dadi as Mrs. Qureshi; Farhan's loving mother * Mukund Bhatt as Mr. Rastogi; Raju's paralyzed father and a former postmaster * Chaitali Bose as Kamini Rastogi; Raju's unwed sister === Cameo Appearances === * Jayant Kripalani as Campus Interview Panel Head who conducts Raju's job interview * Arun Bali as Shyamaldas Chanchad; Ranchhoddas' late father * Rajeev Ravindranathan as Lead Ragging Senior at ICE * Rajendra Patwardhan as Govind; Virus' private barber at the ICE * Achyut Potdar as Machine class professor who is annoyed by Rancho's theory of an easygoing education system * Ali Fazal as Joy Lobo; a senior student at the ICE * Madhav Vaze as Mr. Lobo; Joy's widowed father * Akhil Mishra as Librarian Dubey who helps Chatur prepare his Teachers' Day speech * Atul Tiwari as Education Minister R. D. Tripathi who listens to Chatur's Teachers' Day speech in the auditorium * Supriya Shukla as Matron in hospital with Pia == Character Analysis == * Ranchhoddas Chanchad / Phunsukh Wangdu (portrayed by Aamir Khan): Ranchhoddas, also known as Rancho, is the protagonist of the movie and is a free-spirited, imaginative and innovative student who challenges the traditional education system. He is a source of inspiration for his friends and teaches them the importance of following their dreams. * Farhan Qureshi (portrayed by R. Madhavan): Farhan's true interest is wildlife photography, but due to parental pressure, he pursues engineering. He is initially intimidated by Rancho's unconventional approach to life. However, he learns to embrace his individuality and pursue his own passions. * Raju Rastogi (portrayed by Sharman Joshi): Raju is a shy and hardworking student who struggles with the pressure of performing well in school. He is a loyal friend to Rancho and Farhan. He learns to assert himself with their help. He loves the profession, but his fears prevent him from reaching his full ability. With Rancho's aid, he discovers his true self. * Pia Sahastrabuddhe (portrayed by Kareena Kapoor): Pia is a strong and independent character who stands up for what she believes in. She is Rancho's love interest and helps him, Farhan and Raju on many occasions. * Dr. Viru Sahastrabuddhe (portrayed by Boman Irani): Dr. Viru Sahastrabuddhe, also known as Virus, is the strict and oppressive dean of the ICE. He is portrayed as a symbol of the traditional Indian educational system and its flaws. He places more emphasis on grades and performance rather than creativity and critical thinking. Despite his strictness, he is respected by the students. He serves as an important part of the movie's message about the importance of finding one's passion and pursuing it. * Chatur Ramalingam (portrayed by Omi Vaidya): Chatur is an arrogant and competitive student who is determined to get ahead in life by any means necessary. He is Rancho's main antagonist. He is a symbol of the traditional education system. ==Production== The film joined genuine Indian developments made by Remya Jose, Mohammad Idris, Jahangir Painter and Sonam Wangchuk. The film was a critical and commercial success. It was the highest-grossing film in its opening weekend in India. It had the highest opening day collections for an Indian film up until that point. It held the record for the highest net collections in the first week for a Bollywood film. It was one of only a few Indian films which was successful in East Asia. This took its overall gross to ₹3.92 billion ($90 million). It was the highest-grossing Indian film ever at the time. ==Awards== The film won six Filmfare Awards including Best Film and three National Film Awards including Best Popular Film. Overseas, it won the Grand Prize at Japan's Videoyasan Awards while it was nominated for Best Outstanding Foreign Language Film at the Japan Academy Awards and Best Foreign Film at China's Beijing International Film Festival. In 2012, a Tamil remake of the film was released and it was called Nanban. In 2017 a Mexican remake of the film was released and it was called 3 Idiotas. ==Sequel== When asked about plans of a 3 Idiots sequel in an interview with Hindustan Times, screenwriter Abhijat Joshi replied, saying, \"Honestly, I don't know. We have an idea for the 3 Idiots sequel, a Munna Bhai part three, and also for a PK sequel; but the PK and Munna Bhai sequels interest me the most. So, I think the 3 Idiots sequel may happen in the future, but these two I really want to work on.\" In January 2016, director Rajkumar Hirani and actor Aamir Khan confirmed that they were considering a 3 Idiots sequel. Khan told reporters, \"\"Raju Hirani has given me a hint about 3 Idiots sequel and I am giving you all a hint. The film will happen if and whenever he will write the script.\" Hirani agreed, saying \"this is one film that I really want to do.\" In June 2018, Hirani was asked a question while promoting his upcoming film Sanju and he was quoted as saying, \"I definitely want to make a sequel to 3 Idiots, but it’s still in the initial stage and we will take a fair amount of time to develop the script\". The report also said that Hirani will begin shooting for the Munna Bhai sequel with Sanjay Dutt. Work on 3 Idiots will begin only after Hirani is done with Munna Bhai 3. == References == Category:2000s buddy movies Category:2009 comedy-drama movies Category:Education in India Category:2000s English- language movies Category:2000s Hindi-language movies Category:2000s Indian movies Category:Movies about death Category:Movies based on books Category:Movies set in universities and colleges Category:Nonlinear narrative movies Category:2000s satirical movies Category:Urdu-language movies",
 "title": "3 Idiots"
}