{
 "id": "818821",
 "text": "Samudragupta (Gupta script: Sa-mu-dra-gu-pta, r. c. (350-375 CE) was a ruler of the Gupta Empire of Ancient India. He was a son of the emperor Chandragupta I and the Licchavi princess Kumaradevi. He greatly expanded his dynasty's political power. The Allahabad Pillar inscription, written by his courtier Harishena. It mentioned his many military conquests. It suggests that he defeated several kings of northern India. Also, that he added their territories to his empire. He also marched along the south-eastern coast of India. He advanced to move as far as the Pallava kingdom. In addition, he subjugated several frontier kingdoms and tribal states. Samudragupta performed the Ashvamedha sacrifice to prove his imperial sovereignty. His gold coins and inscriptions suggest that he was a skilled poet and musician. His expansionist policy was continued by his son Chandragupta II.The primary source for the military campaigns of Samudragupta is the Allahabad Pillar Inscription, which was inscribed during his reign and provides a general overview of his military conquests. Other historical sources, such as the Puranas and the works of Chinese and Greek historians, also provide some information about Samudragupta's reign, but do not provide a comprehensive list of all his military campaigns. == Extent of the empire == Samudragupta's empire included a core territory in northern India. It was directly controlled by the emperor. Besides, it included some monarchical and tribal tributary states. Historian R. C. Majumdar states that Samudragupta directly controlled an area extending from the Ravi River (Punjab) in the west to the Brahmaputra River (Bengal and Assam) in the east, and from the Himalayan foothills in the north to the Vindhya hills in the south. The south-western boundary of his territory roughly followed a line drawn from present-day Karnal to Bhilsa. In the south, Samudragupta's empire included Eran in present-day Madhya Pradesh, evident from his inscription found there. The Allahabad Pillar inscription suggests that he reached up to Kanchipuram in the south. == Personality == Samudragupta's coins show him as a tall, strong man. The Allahabad Pillar inscription presents him as a Merciful ruler. It was stated that his \"mind was engaged in providing relief to the low, the poor, the helpless, and the afflicted\". It also stated that he revived many royal families which had lost their kingdoms, including the kings defeated by him. At the same time, it states that he maintained strict administration (\"Prachanda shasana\"). The inscription states that Samudragupta became famous among the learned people because of his poetical works. He earned the byname \"king of poets\". This suggests that he composed some poetical works. But none of these works now survive. The inscription also says that Samudragupta embarrassed the heavenly musician Tumburu and Narada by his lovely performances of music. Samudragupta's musical talents are also confirmed by his gold coins which depict him playing a veena. The inscription praises Samudragupta's wisdom and intelligence. It was stated that he was smarter than the instructor of the Lord of the Gods (that is, Brihaspati). ==References== === Bibliography === * * * * * * * * * * * ==Other websites== * Catalogue of Coins of Samudragupta Category:330s births Category:370s deaths Category:Gupta emperors Category:Gupta Empire",
 "title": "Samudragupta"
}