{
 "id": "818973",
 "text": "The upper mantle extends from the crust to a depth of about 410 kilometers (255 miles). The upper mantle is mostly solid, but its more malleableregions contribute to tectonic activity. Two parts of the upper mantle are often recognizedas distinct regions in Earth’s interior: the lithosphereand the asthenosphere. Lithosphere The lithosphere is the solid, outer part of Earth, extending to a depth of about 100 kilometers (62 miles). The lithosphere includes both the crust and the brittle upper portion of the mantle. The lithosphere is both the coolest and the most rigidof Earth’s layers. The most well-known feature associated with Earth’s lithosphere is tectonic activity. Tectonic activity describes the interaction of the huge slabsof lithosphere called tectonic plates. The lithosphere is divided into 15 major tectonic plates: the North American, Caribbean, South American, Scotia, Antarctic, Eurasian, Arabian, African, Indian, Philippine, Australian, Pacific, Juan de Fuca, Cocos, and Nazca. The division in the lithosphere between the crust and the mantle is called the Mohorovicic discontinuity, or simply the Moho. The Moho does not exist at a uniform depth, because not all regions of Earth are equally balanced in isostatic equilibrium. Isostasy describes the physical, chemical, and mechanical differences that allow the crust to “float” on the sometimes more malleable mantle. The Moho is found at about eight kilometers (five miles) beneath the ocean and about 32 kilometers (20 miles) beneath continents. Different types of rocks distinguish lithospheric crust and mantle. Lithospheric crust is characterizedby gneiss (continental crust) and gabbro (oceanic crust). Below the Moho, the mantle is characterized by peridotite, a rock mostly made up of the minerals olivine and pyroxene. Asthenosphere The asthenosphere is the denser, weaker layer beneath the lithospheric mantle. It lies between about 100 kilometers (62 miles) and 410 kilometers (255 miles) beneath Earth’s surface. The temperature and pressure of the asthenosphere are so high that rocks soften and partly melt, becoming semi-molten. The asthenosphere is much more ductile than either the lithosphere or lower mantle. Ductility measures a solid material’s ability to deform or stretch under stress. The asthenosphere is generally more viscous than the lithosphere, and the lithosphere-asthenosphere boundary (LAB) is the point where geologists and rheologists—scientists who study the flow of matter—mark the difference in ductility between the two layers of the upper mantle. The very slow motion of lithospheric plates “floating” on the asthenosphere is the cause of plate tectonics, a process associated with continental drift, earthquakes, the formation of mountains, and volcanoes. In fact, the lava that erupts from volcanic fissures is actually the asthenosphere itself, melted into magma. Of course, tectonic plates are not really floating, because the asthenosphere is not liquid. Tectonic plates are only unstable at their boundaries and hot spots. ==References== National Geographic Category:Structure of the Earth",
 "title": "Upper mantle"
}