{
 "id": "819195",
 "text": "The Chahi Taret Khuntakpa (), also known as the Seven Years Devastation, was a period in the history of Manipur, during which Manipur Kingdom was occupied by the Burmese, imposing chaos and anarchism to the realm, from 1819 CE to 1825 CE (3212 MF to 3218 MF). The Chahi Taret Khuntakpa was a catastrophic period in the history of Manipur, marked by widespread destruction, political instability, and the near-extermination of the Meitei population. It represents the final large-scale genocide of the Meitei people in the 19th century, leading to the significant dispersion of the population both within and outside the region. The devastation resulted from a combination of internal dynastic conflicts and external Burmese military interventions, which left deep scars on the region’s social and political fabric. The Burmese invaded Manipur multiple times, with the most significant invasion occurring in 1819 during the reign of King Marjit Singh, led by the Burmese general Mingimala Bandula. The Burmese occupied Manipur from 1819 to 1826, a period marked by widespread devastation and disorder, known as \"Chahi Taret Khuntakpa\" or the Seven Years of Devastation. During this time, King Marjit fled to Cachar, where Chourajit and Gambhir Singh also took refuge. On March 5, 1824, the first Anglo-Burmese War commenced. Gambhir Singh allied with British forces to expel the Burmese from Cachar. A military force initially comprising 500 men, later expanded to 2,000, was placed under Gambhir Singh’s command with Captain Grant overseeing operations. This force successfully drove the Burmese out of Manipur, establishing the Ningthee River as its eastern boundary. Following the conclusion of the war and the signing of the Yandabo Peace Treaty in February 1826, Gambhir Singh was officially recognized as the king of Manipur. == Background == The Burmese aggression in Manipur was a prolonged period of military invasions and political upheaval, spanning from the 15th to the 18th century. The decline of Manipur’s political stability began after the death of Meitei King Garibnawaz (Pamheiba), leading to a weakened state and internal conflicts. The political history of Manipur during this era is characterized by frequent Burmese invasions, internal disputes, and succession conflicts, marked by instances of treason, intrigue, and rebellion.Manipur, Past and Present: The Heritage and Ordeals of a Civilization. India: Mittal Publications, 1988. p. 16-19Tarapot, Phanjoubam. Bleeding Manipur. India: Har-Anand Publications, 2003. p. 111-126 Between 1758 and 1824, the Burmese army conducted multiple invasions of Manipur, resulting in widespread devastation over a period of 66 years. These invasions forced the Meitei population to flee due to political persecution, with many seeking refuge in neighboring regions such as Cachar, Tripura, East Bengal, and Assam. The first significant Burmese invasion occurred in 1755 under the leadership of Alaungpaya (also known as Alempara), the founder of the Burmese dynasty. Alaungpaya, a prominent military leader, launched an expedition to Manipur during the reign of Meitei King Moramba Gourashyam (1753–1759) to subdue the Meiteis. The Burmese forces employed firearms, which were unfamiliar to the Meitei troops and created widespread fear. The resulting panic led to the mass exodus of the Meitei population, leaving the Manipur plains largely deserted. This event is historically referred to as \"Khuntak Ahaanba\" or \"the first great devastation.\" Following this, Meitei King Gourashyam entered into a treaty with the Burmese, agreeing to send a young man and a woman from his family as hostages. However, two years after the treaty, Alaungpaya’s dissatisfaction with the Meiteis led to another invasion in 1758. He personally led his forces up to the Ningthee River, defeated the Meitei army at Pallel, and advanced into Imphal. The Burmese occupied Imphal for two weeks, during which they looted the kingdom and massacred thousands of Meitei captives. Upon their return, they took thousands of Meitei men and women, including skilled artisans such as silk workers and silversmiths. In 1762, Meitei King Bheigyachandra ascended the throne. During his reign, the Burmese king Hsibyushin (1763–1776) defeated the Meiteis again at Kakching in 1764. From 1764 to 1793, Meitei King Bheigyachandra experienced multiple changes in power, losing and regaining his throne at least three times. In 1782, he was overthrown and, along with his family and followers, sought political asylum in neighboring principalities. == Causes == The roots of this devastation lay in the intense power struggles among the surviving sons of King Bheigyachandra, who vied for control over the throne. This succession dispute fragmented the kingdom into hostile factions, each led by different royal family members. The prominent figures in this conflict were Sanahal, Labanya (also known as Robindrachandra), Modhuchandra, Tulsijit, Chourajit, Marjit, Daoji (Khongjai Ngamba), and Gambhir Singh—the eight sons of Bheigyachandra. Sanahal, the eldest son, predeceased his father, which further complicated the succession. In 1798, Bheigyachandra appointed Labanya as king before leaving for Nabadwip. However, in 1801, Daoji and Gambhir Singh conspired to have Labanya assassinated, leading to further instability. Following this, Modhuchandra seized power briefly but struggled to maintain control and eventually left for Nabadwip in 1803. After his defeat at the battle of Sangaithen, he fled to Cachar, where he formed an alliance with the local ruler, Krishna Chandra, through marriage. Ultimately, Modhuchandra was defeated and killed by his brother, Chourajit, at Bishnupur. == Burmese Intervention and the Fall of Manipur == Chourajit, who ruled from 1803 to 1812, faced continuous challenges in maintaining political stability, particularly in his strained relationship with his brother Marjit Singh. This rivalry eventually forced Chourajit to flee to Tumu, Burma, where he sought support from the Burmese king Bodawpaya. In 1817, Bodawpaya facilitated a reconciliation between Chourajit and Marjit Singh, but this arrangement was short-lived. During the winter of 1817, Bodawpaya sent a military force led by Marjit Singh, which defeated Chourajit’s forces at Kakching Khulen. Marjit Singh then ascended to the throne of Manipur as a vassal of Burma. However, his reign was marked by attempts to assert autonomy, particularly when he allowed his subjects to collect timber in the Kabo Valley without seeking permission from the Burmese authorities. This act of defiance angered the Burmese court, which led to renewed conflict. == Final Phase of Devastation == After Bodawpaya’s death in 1819, Bagyidaw became the new Burmese ruler. Shortly after his coronation, Bagyidaw ordered Marjit Singh to present himself at the Burmese court to pay homage. Marjit Singh’s refusal to comply with this demand prompted the Burmese to dispatch an army under the command of Mingimuha to capture him. After an unsuccessful confrontation, Marjit Singh fled to Cachar along with his royal attendants. With Marjit Singh’s departure, the Burmese forces completely overran Manipur. The subsequent occupation was marked by widespread violence, mass killings, forced displacements, and the systematic extermination of the Meitei population. The Burmese conducted ruthless military campaigns, destroying villages, looting resources, and causing immense suffering among the local population. == Herachandra's contributions to freedom struggle == After the overthrow of Marjit Singh by the Burmese, Herachandra, the son of Labanyachandra, initiated a guerrilla campaign against the Burmese forces with the support of a small group of followers. Herachandra’s resistance is remembered for its patriotism and bravery. The movement gained momentum as more Meiteis joined in opposition to the Burmese occupation and its associated abuses. According to the Royal Chronicle, the first significant engagement led by Herachandra resulted in a considerable victory for the Meiteis, who killed approximately 200 of the 500 Burmese troops on their way to Moirang to gather food in early 1820. Subsequent encounters between the two forces resulted in heavy casualties on both sides. In response to the growing resistance, the Burmese sent additional reinforcements to Manipur in November 1820 to strengthen their control. == Manipur Levy's contributions to freedom struggle == During a period of widespread unrest and destruction caused by the Burmese occupation, the then Meitei prince Gambhir Singh, who had established an agreement with the British government, mobilized a force of 500 men with the support of his followers. This force contributed to the British efforts in driving the Burmese out of Cachar. By 1825, the force had expanded to 2,000 members and was formally known as the Manipur Levy. It was placed under the command of Captain Grant, a British officer, and was provided with payment, accounting, and ammunition by the British government. == British assistance == During the Burmese occupation, General Bandula of the Burmese army overestimated the strength and capabilities of his forces. He assured the Burmese king that his army could easily conquer Bengal, convincing the king and his nobles of Burmese superiority over the British. This proved to be a significant miscalculation. The British had previously maintained a policy of non-interference on the eastern frontier, which allowed the Burmese to occupy Assam. Additionally, Governor Govindchandra’s request for British assistance in Cachar against the Meitei princes was not addressed. As a result, Govindchandra sought support from the Burmese, which was granted. In 1824, three Burmese army divisions from Jaintia, Assam, and Manipur converged on Cachar, with plans to invade the British district of Sylhet, causing alarm among British authorities. In response, Lord Amherst, the Governor-General of India, declared war on Burma on 5 March 1824. Prior to the battle of Jatrapur, the Burmese commander stated that their objective was to capture the three Manipuri princes—Chaurajit Singh, Marjit Singh, and Gambhir Singh. After the declaration of war, British forces inflicted heavy losses on the Burmese, with over 3,000 casualties in Cachar alone. The British launched simultaneous military operations against Burma, attacking by land in Assam and Arakan and by sea at Yangon. While British forces managed to maintain their positions in Assam and Arakan, they faced logistical challenges and geographical obstacles that limited their progress. Despite these difficulties, Burma was weakened by attacks on multiple fronts. As supplies became scarce, General Bandula returned to Burma from the Assam front, facing a critical situation. At this time, Gambhir Singh, accompanied by British officer Lieutenant R.B. Pemberton, advanced into Manipur. After overcoming numerous obstacles, they reached the Manipur valley on 10 June 1825. Gambhir Singh’s leadership was demonstrated in the battle of Tilain, supported by British forces. Determined to liberate Manipur, Gambhir Singh, with his Manipur Levy armed by the British, arrived from Sylhet on 17 May 1825, leading to a confrontation with the Burmese forces. Following their first encounter, the Burmese forces retreated to Andro, about 20 km east of Imphal. Gambhir Singh pursued them, but the Burmese withdrew again. After his campaign, Gambhir Singh returned to Sylhet, leaving 300 soldiers to defend Manipur. During his absence, Nara Singh served as the commander-in-chief. In Sylhet, Gambhir Singh received an additional 1,500 muskets from the British. After raising more troops, he returned to Manipur with Captain Grant and reinforcements. Upon his return, the Meitei forces, now well-armed and organized, forced around 400 Burmese soldiers in the Kabaw Valley to retreat. Key Burmese officials, including the chief of Samjok, a Burmese general, and 22 soldiers, were captured. The local Manipuri forces, though initially untrained in advanced weaponry, played a significant role in supporting the trained external forces in expelling the invaders. The Manipuri army defeated the Burmese at Tamu, captured the Samjok prince and others, and subsequently devastated the capital of Samjok. They planted their standard on the Chindwin River, marking the completion of the Kabaw Valley’s liberation. Gambhir Singh’s leadership established him as a significant figure in Manipur. On 1 February 1826, he arrived on the western bank of the Chindwin River to find the area deserted, as the inhabitants had fled, leaving behind cattle and allowing Meitei prisoners to escape. The death of General Bandula in April 1825 during the battle at Donabew, alongside British officer Archibald Campbell, deeply affected the Burmese emperor Bagyidaw. Recognizing the extent of Burmese defeats, Bagyidaw sought peace, although he initially rejected British terms. Despite some Burmese forces continuing to operate in Assam, Manipur, and northern Burma, the British and Meitei forces continued to advance. British forces, under Campbell, captured Yandaboo, just 45 miles from Ava, the Burmese capital. With defensive options diminishing, the war concluded with the signing of the Treaty of Yandaboo on 24 February 1826. The treaty established \"perpetual peace and friendship\" between the British and Burmese, with the king of Ava renouncing all claims to Assam, Cachar, Jaintia, and other small princely states. == Aftermath and Legacy == The impact of the Chahi Taret Khuntakpa was devastating. The population of Manipur was drastically reduced, with estimates suggesting that the adult male population fell to fewer than 3,000 individuals. The survivors, many of whom had fled to the hills or neighboring regions, continued to preserve the composite Manipuri identity, which includes both the Meitei of the plains and the various tribal communities of the hills. This period of devastation reshaped the demographic and political landscape of Manipur. The survivors, despite enduring immense trauma, contributed to the resilience and revival of Manipuri society in the subsequent years. The Chahi Taret Khuntakpa remains a defining event in the historical consciousness of the Manipuri people, symbolizing both the fragility and the endurance of their cultural identity. == Historical Perspective == Historian Pemberton remarked on the severity of the Burmese campaigns, stating that the devastating operations “swept away the country from one extremity to another with the apparent determination of extirpating a race when they found it impossible permanently to subdue.” The Chahi Taret Khuntakpa not only reshaped the demographic and political landscape of Manipur but also left an indelible mark on the historical consciousness of its people. The events of this period continue to be remembered as a somber chapter in Manipur’s history, reflecting the enduring impact of external aggression, internal conflicts, and the resilience of a people who, despite facing near- extinction, managed to preserve their cultural heritage and identity. == Related pages == * Meitei people in Myanmar ** Meitei clothing in Myanmar * Meitei people in Bangladesh ** Meitei clothing in Bangladesh ** Meitei monuments in Bangladesh * Meitei people in Assam * Meitei people in Tripura * Meitei people in Nagaland * Meitei people in Meghalaya * Burmese–Meitei relations * Meitei–Shan relations * Meitei martial arts * Meitei traditional weapons * Meitei traditional toys * Meitei traditional games == Bibliography == * http://anoubameerol.com/review-of-n-birachandras-seven-years-devastation/ == References == Category:19th century in India Category:History of Manipur Category:History of Myanmar Category:History of India",
 "title": "Chahi Taret Khuntakpa"
}