{
 "id": "81918",
 "text": "A variable focus lens (also called zoom lens) is a camera lens that can vary its focal length. In general, such lenses have a lower aperture than comparable fixfocus lenses. Depending on the manufacturer common zoom lenses (in the 30–100mm focal range, for film photography) usually have a varying aperture, from 4 to 5.6, perhaps 3.3 to 5.6. There are also some zoom lenses with a fixed maximal aperture (to take the example from before: of 2.6 or 2.8, maximum). In contrast, fix-focus lenses in that range have maximum apertures of 1.4 to 2. ==Digital zoom== Digital cameras sometimes have a function called digital zoom. This is a mathematical method which simply enlarges a part of the picture. The result is not as sharp as that of the optical zoom. When an optical zoom changes its focal length, this will also change the angle of view. Digital zooms simply make a small part of an image bigger, without changing the angle of view. Category:Camera lenses According to the reasoning expressed, a camera uses a convex lens to expand and enhance the image. Such lenses have a bulge in the middle and a taper at the edges. Allowing the rays of light to meet at a point called the focus. The majority of camera lenses are compound and have, for inset, a convex lens, a concave lens, and then a convex lens again. The primary element of a lens determines the magnification using moving it away or closer to an object. The following are some basic points that one should remember about camera lenses: Lens Aberration: One could easily guess that a simple maximum aperture convex lens could yield a warped image which is the reason for this aberration not being encouraged. This does not mean that the image will not be warped. It will be possible to make distorted images with the lens. Aperture: This signifies the actual opening or hole, which lets the light through the lens. Widening of the aperture correlates with smaller f-stop numbers. The narrowing of the aperture correlates with larger f-stop numbers. Depth of Field: This explains the extent of a photograph that remains sharp or in focus. Focusing on higher f-stop numbers produces a lot more of the image in focus. While lower f-stop number focusing produces images with a small depth of field Maximum Aperture: This refers to the widest opening of the lens if any; some are not that big. The bigger the maximum aperture of the lens, the more it favors low-light shooting.",
 "title": "Zoom lens"
}