{
 "id": "819216",
 "text": "The 2020–21 United States election protests were a series of protests across the United States after the 2020 United States presidential election between then-President Donald Trump and former vice president Joe Biden. The election was held on November 3, 2020. Biden won the election with 306 votes in the Electoral College to Donald Trump's 232. Before the election Donald Trump claimed without any evidence that there was election fraud. He refused to give up and him and his allies attempted to overturn the results of the election. Trump filed dozens of legal challenges to the results, which were rejected by at least 86 judges, some that Trump even hired. The courts found that his claims had no evidence to prove that there was fraud. Pro-Trump protesters, including groups such as the Proud Boys, took part in many protests in Washington, D.C., state capitals, and other locations across the nation to show that they did not agree with the election results and shout Trump's claims of election fraud.Nearly 2 dozen arrested in Trump protests in Washington, Associated Press (November 15, 2020).Antifa Snow, David Goldman & Lisa Marie Pane, 'This isn't over!' Trump supporters refuse to accept defeat, Associated Press (November 7, 2020). On January 6--the day when the U.S. Congress counts the electoral votes--Trump supporters got together for the \"Save America\" rally where people heard speeches from Trump and Rudy Giuliani. Before the speeches were over, a large mob of protesters marched on to Congress and stormed the building. Congress was in session at the time, certifying the Electoral College vote count. Several buildings in the U.S. Capitol complex were evacuated, and protesters broke past security to enter the U.S. Capitol building, including National Statuary Hall. After the storming of the U.S. Capitol, at least 36 House Democrats called for Trump's immediate impeachment and removal by Congress. Armed supporters of Trump have continued protesting after of the storming of the US Capitol. As of January 10, armed protests were being planned at the state capitals of most states. Thousands of soldiers were sent to protect the capital, and by the inauguration ceremony for Biden, up to 25,000 soldiers were sent to guard against anymore threats to security. Protests have continued in some U.S. cities after Biden became president. ==Protest== Protest in support of Donald Trump started on November 4. ===November 4=== *In Phoenix, Arizona, pro-Trump protesters joined together and demanded that the city's remaining votes be counted. ===November 5=== *In Atlanta, while poll workers inside State Farm Arena counted ballots, pro-Trump protesters gathered outside chanting \"Stop the cheat!\" ===November 7=== *In Lansing, more than 500 Trump supporters protested at the state Capitol over what they thought was a cheated presidential race that led to Biden's election as the president. ===November 14=== * In Washington, D.C., thousands of protesters went to support President Trump's election claims.. ===December 19=== *In Sacramento, police made several arrests near the California State Capitol as pro-Trump and anti-Trump protesters fought over the results of the presidential election. ===January 4=== * Proud Boys leader Enrique Tarrio was arrested and charged with destroying a Black Lives Matter sign at a historic black church in Washington, D.C. during the pro-Trump rally on December 12. ===January 5=== * On January 5, 2021, Washington D.C. mayor Muriel Bowser sent 340 of the District of Columbia National Guard due to an protest of pro-Trump supporters who planned to rally that evening. ===January 6=== On January 6, the protesters planned to march to the United States Capitol. A crowd of thousands of Trump supporters first listened to a speech by Trump. He told them again the election had been stolen and said, \"We will never give up. We will never concede. ... Our country has had enough. We're not going to take it anymore.\" He urged them to march on the Capitol and \"show strength\". Many people then marched on the Capitol, where they got past the police, broke windows, and stormed inside the Capitol building. They marched through Statuary Hall. Rioters took over the Speaker of the House Nancy Pelosi's office, flipping tables and ripping photos from walls; there was looting in the Capitol. Many police officers were injured in the violence at the Capitol.Pamela Brown and Noah Gray, Multiple officers injured in the mob violence, CNN (January 6, 2021). One died of his injuries, and another committed suicide over the following weekend. A woman was shot inside the Capitol and later died; no information has been told about the shooter. At least one improvised explosive device was found on Capitol, and another was close by at the headquarters of the Republican Party. ===January 9=== * In Frankfort, around 100 protesters with weapons joined together for a \"patriot rally\" outside the Kentucky State Capitol while both chambers of the General Assembly were in session. ===January 17=== The FBI reported that protests were being planned at all United States state capitols and in Washington, D.C., and that they are likely to take place from January 16 to 20. *In Lansing, protests at the Michigan Capitol had about 150 people and many Michigan National Guard people were on site to keep peace. Some protesters with AR-15 rifles joined other pro-Trump supporters at the Capitol. *In Austin, a crowd of about 100 protesters, many armed and supported gun rights, gathered outside the Texas Capitol. People thought it would be violent but it was not. There were no reports of any fights. ==References== Category:2020 United States presidential election Election protests Category:Donald Trump Category:Joe Biden Category:Riots in the United States",
 "title": "2020–21 United States election protests"
}