{
 "id": "81925",
 "text": "Vyankatesh Madgulkar (1927-2001) was one of the most popular and well-known Marathi writers of his time. He became well-known mainly for his realistic writings about village life in a part of southern Maharashtra called Maandesh. These writings about Maandesh are set in a period of 15 to 20 years before and after India's Independence. Vyankatesh Madgulkar was a man of many interests. He also read a lot of books on different subjects. He was lovingly called Tatya (“old man”, or “grand old man” in Marathi) by his admirers, friends and family members. == Childhood == He was born in Madgul, a village in Sangli district of Maharashtra. The Madgulkar family had probably come from the neighbouring state of Karnataka a few centuries back. They were one of the eight Brahmin families in Madgul, which had a population of over a thousand. The family owned some land. Vyankatesh Madgulkar's grandfather and the earlier generations had lived off the land. However, in his father’s time, the land could not feed the family. The family was large. Apart from Vyankatesh there were seven children, one of whom died early. His father took a job in the government of the Aundh princely state, which ruled over Madgul and the region around it known as Maandesh The job took him to various villages and small towns of Maandesh. For some time, the family moved with him. In this way, Vyankatesh got to see life in many parts of Maandesh. Although his mother was an old-fashioned woman who believed Brahmins should not mix with people of 'lower' castes, he freely mixed with children of other castes and communities. From them he learnt how to climb trees, how to identify birds, how to trap fish, how to hunt. Madgul had no electricity, bus service or shop. But it had a primary school. He studied there and later in a secondary school in a small town nearby. But he was not a good student. Some of his teachers told him he had no future. When he was a teenager, he left home and joined a group of people fighting for India’s freedom. For two years he was considered a criminal by the British government. == Working life == After India got Independence he returned home. His elder brother (“Anna”), Gajanan, had already left home and become a writer for Marathi films.`GaDiMa’ (Gajanan Digambar Madgulkar), as he was called, went on to become a famous poet, song and screenplay writer, and a well-known name in Maharashtra. GaDiMa’s success might have helped him to also think of becoming an artist. However, he had his own personality, different from that of his brother. As he said often, he had always had the feeling he was “different”. He first wanted to be a poet. He also loved sketching and painting. And though he did not complete school education, he developed an enormous love for reading. He learnt and read English books the hard way, with the help of a dictionary. He read books by the American novelist John Steinbeck, the famous British writer George Orwell and the Irish writer Liam O’ Flaherty, and several other Western writers. He first tried to become a painter. He went to the city of Kolhapur in western Maharashtra to learn painting. However, he lost interest in becoming a painter and turned to writing. He wrote his first short story when he was 19 years old. It won a literary prize. This encouraged him to become a writer. In 1948, when he was 21, he took up a job as a journalist. Two years later he moved to the capital of Maharashtra, Mumbai, to write scripts for Marathi films. In 1955 he took up a job in Pune, in the rural programming department of the government's All India Radio station . He worked here till he retired in 1985. All this time, he continued to write. He visited Australia and the island of Tasmania while he was in the service of All India Radio and wrote stories based upon his experiences there. Vyankatesh Madgulkar died in August 2001 at the age of 73. He died of complications from diabetes. == Writing == Vyankatesh Madgulkar wrote in many different ways. He wrote nearly 40 screenplays for films. He wrote several folk plays. He attempted a Marathi version of Fiddler on the Roof. He translated books, especially wild life books, from English to Marathi. He wrote essays on his travels, nature and interesting people he had read about, like Richard Burton, the British traveler. He is most fondly remembered for his short stories and novellas (long stories). He wrote 8 novellas and over 200 short stories. His first book, Maandeshi Manse (People of Maandesh), was published when he was only 22 years old. Maandeshi Manse is about different kinds of people he had met during his childhood in Maandesh. The descriptions of these people are realistic. He explained later that the descriptions were are not fully true. The people in Maandeshi Manse are creations of the author, based on real people he knew. He mixed the real world with his own imagination in the same way in all his Maandeshi stories. He also did not change his style of writing. That style is generally of a person telling a story to people sitting in front of him. Many of the stories told in this way are about poor people. Some stories are about things that had happened during his childhood. Some stories are about family members. Only a few stories have a plot. Most stories have one central character. But a few stories are about happenings rather than on people. We see all this in his book 'Karunashtak' which mainly revolves around his mother. == Bangarwadi == The most famous of Vyankatesh Madgulkar's writing is his novella called Bangarwadi (1954). It is about the experiences of a young schoolteacher in a village of shepherds in Maandesh. The story begins with the schoolteacher walking alone towards the village called Bangarwadi, in the night, across a landscape with few trees. When the teacher reaches Bangarwadi, he finds that the school is not working. Over the next months, the schoolteacher successfully runs the school. However, at the end of the story, lack of rainfall forces all the people of Bangarwadi to leave the village. The school again has no students. Within this story, Vyankatesh Madgulkar gives us an unforgettable and detailed picture of a way of living. One reviewer, Taya Zinkin reviewing the English translation of the book in The Economic Weekly in 1958 said, “(it) is perhaps the most important book written by an Indian about India to appear in English since Nehru’s Discovery of India.” Bangarwardi was translated in several languages. The great German scholar on India Gunther Sontheimer translated it in German. Bookstores in Pune and other Maharashtra cities still sell the original book in Marathi. It has been reprinted over 15 times. Bangarwardi was also make into a film by Amol Palekar. == Other writing == He wrote stories about Maandesh for around 20 years, from the mid-1940s to the mid-1960s. Later, he wrote about his family and then about nature. His last novella, Sattantar (1981), about a community of monkeys, won him the central government’s Sahitya Parishad award for best Marathi book published in that year. == Translations == Vyankatesh Madgulkar has been translated in several languages. Brief details of translation in English with year of publication are as below: * Bangarwadi was translated as The village had no walls by Ram Deshmukh. The book was published by Asia Publishing House, Mumbai, in 1958 and again by Popular Prakashan, Mumbai, in 1994. * Vavtal (Whirlwind) was translated as Winds of fire by Pramod Kale. The book was published by Hind Pocket Books, New Delhi, in 1974. The book is out of print. * An excerpt from The village had no walls was published in Treasury of Modern Asian Stories (Mentor Books, New York, 1961). * An excerpt from The village had no walls was published in Stories from South Asia (Oxford University Press, Oxford, 1988). * A story translated as School Inspection was published in The Rough and the Smooth (Asia Publishing House, Mumbai, 1966). * A translation of Mulanyacha Bakas (The Mulanas’ Bakas ) was published in Modern Indian Literature: An Anthology- Volume Two (Fiction) (Sahitya Akademi, New Delhi, 1993) The following are brief details of translation of his work in languages other than English with year of publication: * Bangarwadi was translated in German by the noted Indologist Gunther Sontheimer (1986) * Service Motar (Bus service) was translated in German (1969) * An excerpt from Bangarwadi was translated in Danish (1964) * Bangarwadi was translated in Hindi (1962?) * Around 20 stories including Bus Service and Shala (School) were translated in Hindi between 1958 and 1981 * Sattantar was translated in Kannada (1990) * Vavtal (Whirlwind) was translated in Russian (publication details not available) == References == * Yeshwant Shripad Raste, Vyankatesh Madgulkar Samagra Vadmay Soochi, Utkarsh Prakashan, Pune, 1996 * M. D. Hatkangalekar (ed.), Vyankatesh Madgulkar: Maandeshi Manus aani Kalavant, Shabdh Prakashan, Satara, 2000 * Vyankatesh Madgulkar, Karunashtak, Majestic Prakashan, Mumbai, 2003 ==Other websites== *Marathi Songs Of Ga Di Madgulkar - The Official Madgulkar Website *Gadima On Facebook - The Official Madgulkar Facebook Page Category:1927 births Category:2001 deaths Category:Indian writers",
 "title": "Vyankatesh Madgulkar"
}