{
 "id": "819305",
 "text": "Tobacco smoking or cigarette smoking is when a person breathes in and breathes out smoke from a cigarette, cigar, or pipe after igniting it using a lighter. Smoking is harmful to the lungs, and can cause many diseases such as cancer, pneumonia, and many other breathing problems. When a user smokes, the chemicals from inside the cigarette damage the body, including the smoke, making the person more likely to get certain diseases. In public areas such as arenas or police stations, smoking is usually not allowed. This is because the smoke from the cigarette goes into the air, and can be breathed in by other people. This is called second-hand smoke. Signs have to be placed in public areas to stop people from smoking while there. If a man was smoking while walking near a police station and he did not listen to the sign, he would have questions asked to him or be arrested by police. Smoking can cause heart attacks, if continued for years of using tobacco or any other powders used for smoking, including marijuana. Smoking marijuana can cause mental, as well as physical health problems, such as schizophrenia, depression, mood swings and many others. If a smoker continues smoking for years, or even decades, their health will worsen. Smoking can cause coughing, or inflammation (swelling) of the throat or lungs. The alveoli are air sacs via which breathing happens, but they will become badly damaged. Once breathed in, the tobacco smoke travels down the trachea and enters the lungs. When entering the body, the smoke would damage the cilia, which are millions of small hairs that push away mucus when it enters the body. If the lungs become even more damaged, smokers may not be able to breathe on their own, and they will be put on a device to help them breathe such as a ventilator. In some cases, smoking causes the lining of the lungs to become inflamed, making the smoker unable to breathe, which leads to death. This is the main problem caused by smoking. Also, chewing tobacco or snuff can cause mouth cancer or other mouth problems. ==Related pages== *Passive smoking *Smokeless tobacco Category:Smoking",
 "title": "Tobacco smoking"
}