{
 "id": "819576",
 "text": "{{Infobox NFL game | type = sb | name = LV | full_name = | image = | caption = | visitor = Kansas City Chiefs | visitor_abbr = KC | visitor_conf = AFC | visitor_coach = Andy Reid | visitor_record = | visitor_place = 1 | home = Tampa Bay Buccaneers | home_abbr = TB | home_conf = NFC | home_coach = Bruce Arians | home_record = | home_place = 5 | visitor_qtr1 = 3 | visitor_qtr2 = 3 | visitor_qtr3 = 3 | visitor_qtr4 = 0 | home_qtr1 = 7 | home_qtr2 = 14 | home_qtr3 = 10 | home_qtr4 = 0 | date = February 7, 2021 | stadium = Raymond James Stadium | city = Tampa, Florida | attendance = 24,835 | odds = Chiefs by 3 | MVP = Tom Brady, quarterback | anthem = Eric Church & Jazmine Sullivan | halftime = The Weeknd | coin_toss = Suzie Dorner, ICU nurse representing medical personnel during the COVID-19 pandemic in the United States | HOFers = | referee = Carl Cheffers | network = CBS ESPN Deportes (Spanish language) | announcers = Jim Nantz (play-by-play) Tony Romo (analyst) Tracy Wolfson, Evan Washburn and Jay Feely (sideline reporters) Gene Steratore (rules analyst) | rating = | share = | commercial = | radio = Westwood One | radioannouncers = Kevin Harlan (play-by-play) Kurt Warner (color commentator) Laura Okmin and Tony Boselli (sideline reporters) | last = LIV | next = LVI }} Super Bowl LV (meaning Super Bowl 55 in Roman numerals) was an American football game that happened on February 7, 2021 between the Kansas City Chiefs and the Tampa Bay Buccaneers. The Buccaneers won the game, meaning they won the National Football League for the 2020 season. The Chiefs had won the American Football Conference in the 2020 season, and the Buccaneers had won the National Football Conference in the 2020 season. The game happened at the Raymond James Stadium in Tampa, Florida. ==Starting lineups== Starting lineups for Super Bowl LV Kansas City Position Tampa Bay Offense Tyreek Hill Mike Evans Eric Fisher Donovan Smith Nick Allegretti Ali Marpet Austin Reiter Ryan Jensen Andrew Wylie Aaron Stinnie Mike Remmers Tristan Wirfs Travis Kelce Rob Gronkowski WR Chris Godwin Patrick Mahomes Tom Brady Clyde Edwards-Helaire Ronald Jones II WR Defense RDT RDE MIKE LB WILL LB LCB LB RCB LCB NB RCB FS SS ==Notes== ==References== Category:2021 in American sports Category:February 2021 events *055",
 "title": "Super Bowl LV"
}