{
 "id": "81966",
 "text": "| rotation = presumed synchronous | axial_tilt = 0 | albedo = | magnitude = 14.5 (V-band, opposition) | temp_name1 = solstice | mean_temp_1 = K | max_temp_1 = 85 K | min_temp_1 = ? | atmosphere = no | surface_pressure = zero | note = no }} Umbriel is a moon of Uranus found on October 24, 1851 by William Lassell. It was found at the same time as Ariel. == Name == The name \"Umbriel\" and the names of all four moons of Uranus then known were suggested by John Herschel in 1852 at the request of Lassell. Beobachtungen der Uranus-Satelliten Adsabs.harvard.edu Retrieved on 06-01-07 Lassell had earlier supported Herschel's 1847 naming scheme for the seven then-known moons of Saturn and had named his newly-found eighth moon Hyperion in accordance with Herschel's naming scheme in 1848. Umbriel is the 'dusky melancholy sprite' in Alexander Pope's The Rape of the Lock, and the name suggests the Latin umbra, shadow. The adjectival form of the name is Umbrielian. It is also designated Uranus II. == Physical characteristics == So far the only close-up images of Umbriel are from the Voyager 2 probe, which made observations of the moon during its Uranus flyby in January, 1986. During the flyby the southern hemisphere of the moon was pointed towards the Sun so only it was studied. Umbriel's surface is the darkest of the Uranian moons, and reflects only about half as much light as Ariel, Uranus' brightest moon. It has far more and bigger craters than do Ariel and Titania and is also the least geologically active. It is mostly made of water ice, with the balance made up of silicate rock, and other ices such as methane. Methane can break down and form reddish-black organic compounds such as tholins when bombarded by high-energy particles. Near-IR spectra of Ariel and Umbriel clearly show that water ice dominates the spectra of these objects. === Craters === Craters on Umbriel are named after many different demons from various mythologies. Crater Named after Alberich Alberich (Norse) Fin Fin (Danish) Gob Gob (Pagan) Kanaloa Kanaloa (Polynesian) Malingee Malingee (Australian Aboriginal mythology) Minepa Minepa (Makua people of Mozambique) Peri Peri (Persian) Setibos Setebos (Patagonian) Skynd Skynd (Danish) Vuver Vuver (Finnish) Wokolo Wokolo (Bambara people of West Africa) Wunda Wunda (Australian Aboriginal mythology) Zlyden Zlyden (Slavic) == Other websites == * Umbriel Profile by NASA's Solar System Exploration * William Lassell, Astronomical Journal 2 (1851) 70 * AN, 33 (1852) 257/258 * AN, 34 (1852) 325/326 * Uranus and moons as seen by the VLT in August 2007 == Notes == == References == Category:Uranus' moons",
 "title": "Umbriel (moon)"
}