{
 "id": "820131",
 "text": "The Arabian Peninsula has been home to Semitic people for thousands of years. These people include the Arabs, but not all Arabs live in Arabia. People from the Arabian Desert, known as Bedouins, herded animals as nomads. They were grouped into extended families and tribes. People from other parts of it lived in villages and towns. == Before the Muslim era == Around 3000 BC, people near the Persian Gulf were trading with Mesopotamia. Dilmun which is now Bahrain, was the center of trade. By 2000 BC, parts of South Arabian Peninsula were trading with Ancient Egypt. During the peaks of their empires, Assyria and Babylonia controlled North and West Arabian Peninsula. Sometime around 1000 BC, the kingdom of Saba' appeared in South Arabian Peninsula. There were also other kingdoms in South Arabian Peninsula, including Ma'in and Hadhramaut. In the 3rd and 2nd centuries BC, Parthia expanded into South and East Arabian Peninsula. Saba' and Parthia became richer because of trade between Egypt and India. In the 1st century BC, Saba' conquered Ma'in. Near Saba', around 115 BC, the kingdom of Himyar appeared. In North Arabian Peninsula, Nabat was a trading kingdom in the 5th century BC. In 106 AD, the Roman Empire took control of Nabat. Parthia lost some wars to Rome and then left East Arabian Peninsula. The Bedouins expanded their area into more parts. Some of them moved to the East and North. By the 4th century (300-400) AD, Himyar conquered all other kingdoms of South Arabian Peninsula. Christianity came to Arabian Peninsula, from Abyssinia and Syria. Some people in Himyar followed Judaism. A Jewish king of Himyar killed Christians. Abyssinia and Rome ruled by Justinian were both Christian countries. In 525 they attacked Himyar. In North and Central Arabian Peninsula, two kingdoms had appeared in the 3rd and 4th centuries AD: The Lakhmids and the Ghassanids. The Sassanid Empire from Persia supported the Lakhmids (and Himyar), and Rome supported the Ghassanids. These two empires were at war. In the 6th century the Bedouins fought each other in wars called the Jahiliyyah. == Muslim era == In 610, Muhammad, an Arab from Mecca, claimed that God was speaking to him. The people of Mecca, mostly from the Quraysh tribe, worshipped many gods. Muhammad said that there was only one God. Muhammad founded the religion of Islam, and his followers, called Muslims, conquered Arabian Peninsula by war. After Muhammad died in 632, men called caliphs ruled the Muslims in empires called caliphates. These include the Rashidun, Umayyad, and Abbasid caliphates. Some parts of Arabian Peninsula, including Oman, were not always part of the caliphates. Rulers from the 900s to the 1200s included the Fatimid Caliphate, Seljuk Empire, and Ayyubid dynasty. Islam was divided into two forms called Sunni and Shi'a, who fought wars against each other. Yemen and Oman were ruled by different people at times, including the Rasulid dynasty in Yemen. The Hashemite Sharifs of Mecca ruled the Hejaz (Western Arabian Peninsula) region starting in the 900s. The Mamluk Empire from Egypt had control over the Sharifs in the 1300s. In 1517, the Ottoman Empire from Turkey conquered the Mamluks. The Ottomans took control in the Hejaz, Yemen, and other parts of Arabian Peninsula. European countries wanted to control more of Arabian Peninsula, so they fought wars against the Ottomans. Europeans, mainly the Portuguese, won some cities on the coast in the 1500s and 1600s. Persians won control in Oman, and Oman also built its own empire. In the 1700s, a new form of Islam called Wahhabism spread to nomads. In the 1800s Wahhabis led by the House of al-Saud went to war against the Ottoman Empire. Britain helped the Wahhabis and gave them countries along the Persian Gulf. Britain also took part of Yemen into the British Empire. In World War I, the Allied Powers fought against the Ottomans. The Ottomans lost the war, so the Allied Powers broke up their empire into smaller countries. In 1932 Ibn Saud, from the House of al-Saud, founded the Kingdom of Saudi Arabia.Salibi, Kamal S. A History of Arabia. E-book, Delmar, N.Y.: Caravan Books, 1980, https://hdl.handle.net/2027/heb.00934 == Sources == ==Other websites== * Category:History of the Middle East",
 "title": "History of Arabia"
}