{
 "id": "820392",
 "text": "Loyalakpa (), also spelt as Loyarakpa (), is a God of youth, foothills and countryside in Meitei mythology and religion of Ancient Kangleipak (early Manipur). He is best known for wrestling with Khoriphaba during the Lai Haraoba festival. He is the husband of goddess Thoudu Nungthel Leima. He is the son of Marjing, but later was adopted by Koupalu and Kounu as their own son. He is one of the ten kingly gods (or ten divine kings) mentioned in the Numit Kappa, an ancient epic text of Meitei religion. == Names == He was originally called as Tolongkhomba, a name given by his parents. Tolongkhomba is also spelled as Tollongkhomba, Tolonkhomba, Tollonkhomba, Tolomkhomba and Tollomkhomba. He holds the responsibility for leading and overseeing the youths. So, he is also called Nahalakpa (or Naharakpa). Later, Koupalu, his foster father (also his father in law after marrying Nungthen Leima) assigned him the duty to protect countryside and foothills. Thus, he was called Loiyalakpa. Loiyalakpa is also spelled as Loyalakpa, Loiyarakpa, Loyarakpa. He holds the duty to guard the western direction of Ancient Kangleipak. So, he is also called Thongnang Ningthou. == Description == Among the deities, God Loyalakpa and God Khoriphaba possess the epithets of being the best wrestlers. The two powerful gods wrestled during the Lai Haraoba festival. == Mythology == When the divine polo match was played among the gods, Loyalakpa participated in the southern team. His team was led by God Thangjing while his opponent's team (northern team) was led by God Marjing. == Cults and shrines == The main deities assembled in the Lai Haraoba of the Phayeng are almost similar to those of the Sekmai. God Loyalakpa is one of these deities. God Loyalakpa and other deities including Panam Ningthou, Pureiromba and Koubru hold the special position of the Chakpa Haraoba (one of the 4 types of Lai Haraoba festival). == Namesakes == === Mountain peak === Loyalakpa is one of the four sacred mountain peaks of the Meitei people. The others are Koupalu, Kounu and Thangjing. These names of the peaks are named after the respective presiding gods. == Related pages == * Koupalu - north west protector * Marjing - north east protector * Thangjing - south west protector * Wangbren - south east protector == References == == Other websites == Category:Meitei gods and goddesses",
 "title": "Loyalakpa"
}