{
 "id": "820494",
 "text": "A Helloi () or a Heloi () is a female nature spirit in Meitei mythology, folklore and religion. Hellois look like beautiful young women. They often trick men to have sex with them. They are the most powerful among the female spirits. They can cause diseases. The hellois are often known for their charming beauty, ecological balance and male submission (seduction). Hellois are sometimes seen as evil spirits in the forms of beautiful maidens. Helloi Taret (lit. Seven Hellois) are the seven sisters. They stay in the thick bushes or dark and dense forests. They also live in other places of wilderness like rivers and meadows. == In Meitei mythology == Hellois are one of the most common female spirits believed in Meitei mythology and folklore. According to the Maibas (priests), hellois are the most powerful female spirits. They could spread diseases, especially sexually transmitted infections. Hellois attack men and cause disorder of mind. From men, women may get sick in their sexual organs. According to belief, the highest rate of such attacks occurs in March and April. It is the time of celebrating Yaoshang, a spring festival. At the same time, Thabal Chongba occasions are performed by both men and women. == In Meitei religion == Helloi Oknaba (lit. Encounter with Hellois in Meitei) is one of the most common events of meeting with supernatural beings in Meitei folk stories. Challenges to or conflicts with the hellois often make one's life unhappy. In such cases, one may get sick, mental imbalance and temporary madness. If such people are not properly treated by a maiba or a maibi, the symptoms may continue long. It may lead to permanent madness (mental impairment). One who meets a helloi often acts in abnormal and mentally challenged ways. For example, the victims may not be able to recognize his family members and friends. However, the victims could still communicate with the very helloi. The spirit may not easily leave the victim. She will demand something in return to leave the victim. Thus, Hellois seek their needs by bewitching people. The maibas perform rites and rituals to prevent attraction and attacks on men by the hellois. They feed the spirits with animal faeces and some specially prepared ritual foods. == Hellois and Hingchabis == Hellois and Hingchabis are the two most popular forms of female spirits in Meitei mythology and folklore. But these two mythical beings are not almost all similar. Hellois are wandering spirits. On the other hand, Hingchabis live inside some women. They exposed their supernatural powers into the bodies of the victims. They cause illness, mental sufferings, bad luck, and sometimes even death to the victims. == Gallery == Helloi Taret — Lamleima Taret — 7 Divine Ladies — 7 Celestial Princesses — 7 Daughters of Heavenly Father Salailen — Classical Meitei mythology & religion (Sanamahism alias Lainingthouism) of ancient Kangleipak civilization.jpg == Related pages == * Lai Khutsangbi * Lairembigee Eshei * Uchek Langmeidong == References == == Bibliography == * Heloi Heloi Mi Heloi by Pramodini, Khaidem == Other websites == * * * * Category:Meitei mythical creatures Category:Gods and goddesses of beauty Category:Gods and goddesses of love and lust",
 "title": "Helloi"
}