{
 "id": "820576",
 "text": "Queer Sport Split (short: QSS) is a charity organization from Split, Croatia. It has a focus on the sport, culture and leisure of the LGBTIQ+ community. It also works in education and research on the sports and LGBTIQ+ topics. It was registered in 2011 and is the longest running local LGBTIQ+ organization in the region. == Local activities and relevance == QSS does activities like: excursions and hiking, bocce, recreational swimming and socializing programs like 'Sport i pivo', 'PlesnjaQ' and 'Domaćinstvo' for LGBTIQ+ community. Screenings and presentations are organized to inform and inspire participants. QSS helps organizing Split Pride and running of LGBT Center Split. It does art in public space, with international artists like Maria Molteni who writes: \"Since 2011, Queer Sport Split has organized gatherings and interventions with “soft activism”: activism that intervenes in the public space of the city through crocheting and knitting. The first such intervention was during the planning of Split Pride in 2012, where knit flags pointed to the right of all citizens to public space, rights which the LGBTIQ population was denied by the local government. In 2014, Queer Sport Split held the Marathon On Needles, a public knit-in, to promote access to public space, guerrilla activism, and social participation.\" In last few years it does ballroom culture and vogue dance events in cooperation with CLUBTURE. == International activities and networks == In 2012 it co-organized an international conference Contesting/Contexting SPORT 2012, with EPAS (part of Council of Europe), EGLSF (European Gay and Lesbian Federation) and qSPORT - Zagreb. It contributes to large international exhibitions and publications. In 2018-2019 it was the leading Erasmus+ research project 'Beyond Binaries' with five other LGBTIQ+ sport organizations, in collaboration with institutions, networks and initiatives active in research and sport work. 'The project aims to create understanding for the highly limiting societal effects that the gender segregation unfolds, especially for and by examining the experiences of members of the LGBTQI+ community.' In 2019-2021 it was part of Rainbow Youth for Sporting Equity - a research and education project by LEAP Sports Scotland and European University Sport Association and project CEEyouSPORT led by EGLSF. It is part of regional network ERA and is their contact point for Croatia. == Bibliography == * CROATIA - Country report for use in Canadian refugee claims based on persecution on the basis of sexual orientation or gender identity, 2015 Publisher: University of Toronto, Faculty of Law: Sexual Orientation and Gender Identity Working Group. * INADEQUATE PROTECTION homophobic and transphobic hate crimes in Croatia, 2012 Publisher: Amnesty International. * O SUZBIJANJU HOMOFOBIJE I TRANSFOBIJE TE VRŠNJAČKOG NASILJA NAD LGBTIQ UČENICIMA/ICAMA, Priručnik za nastavnike/ice i stručne suradnike/ice, 2016 Publisher: Lori, ISBN 978-953-59135-1-1 ==Other websites== *Homepage of QSS *Contesting/Contexting SPORT 2012 *Beyond Binaries Erasmus+ research project *Administrative info of QSS == References == Category:LGBT Category:Split",
 "title": "QueerSportSplit"
}