{
 "id": "82052",
 "text": "The Marshall Plan (officially called the European Recovery Program [ERP]) was a plan of the United States for rebuilding the allied countries of Europe after World War II. One of the main reasons this was done was to stop communism and the USSR. The plan was named after Secretary of State George Marshall, but the plan was worked out by other people in the State Department. The plan ran for four years beginning in April 1948. During that period US$ 13 billion in economic and technical help were given to help the recovery of the European countries that had joined in the Organization for European Economic Co-operation.The $13 billion compares to the U.S. gross domestic product of $41 billion in 1949. By the time the plan ended, the economy of every member state had grown well past pre-war levels. In recent years some historians have said that another reason for the plan was to make the United States stronger, and to make the countries of western Europe need the United States. They also say that the United Nations (UN) Relief and Rehabilitation Administration, which helped millions of refugees from 1944 to 1947, it also helped the European postwar recovery. ==Alternatives to the Marshall Plan== ===Morgenthau plan=== U.S. Treasury Secretary Henry Morgenthau, Jr. said that if Europe needed money to rebuild what had been destroyed by the war, they should take it from Germany. This money was called war reparations. Morgenthau said it would also stop Germany from ever being rebuilt, and threatening to start another war. Taking money from Germany was done after World War I. It did not work. Instead of helping other countries it hurt them. This is because companies could not sell the coal and steel that they made because it was coming in free from Germany. ===Monnet plan=== Jean Monnet of France said that France should control the German coal areas of the Ruhr and Saar and use it to rebuild French industry. In 1946 the occupying powers agreed to put strict limits on how quickly Germany could reindustrialize. Limits were placed on how much coal and steel could be produced. === Level of industry agreement === This was the first German industrial plan. It was signed in early 1946 and said that German heavy industry was to be cut down to half% of its 1938 levels by the destroying 1,500 manufacturing plants.Henry C. Wallich, Mainsprings of the German Revival (1955), pg. 348. By the end of 1946 governments could see the problems of the plan, and the agreement was changed several times, the last time in 1949. But dismantling factories went on into 1950. Germany had been very important to the economy of Europe for a long time. This meant that a poor Germany was holding back European recovery, because other countries could not sell so many things to Germany. A poor Germany was also expensive for the occupying powers. They had to give Germany food and other things which it needed and could not grow or make for itself anymore. Because of this the Morgenthau and Monnet plans were rejected. The Marshall Plan ended in 1952. Ideas to extend it were stopped because of the cost of the Korean War and rearmament. U.S. Republicans hostile to the plan had also gained seats in the 1950 Congressional elections. ==Criticism== The Marshall Plan has been described as \"the most unselfish act in history.\" However, this may not be the case. The United States benefited from the plan because part of the agreement for giving the aid was that the country would have to open up their economies to US companies. \"Historical revisionist\" historians, such as Walter LaFeber, during the 1960s and 1970s said that the plan was American economic imperialism. That means, that it was an attempt to gain control over Western Europe just as the Soviets controlled Eastern Europe. Tyler Cowen, economist, has said that nations receiving the most aid from the Marshall Plan (Britain, Sweden, Greece) saw the least returns and grew the least between 1947 and 1955. Those nations who received little (e.g. Austria) grew the most. When he looked at West Germany's economy from 1945 to 1951, German analyst Werner Abelshauser decided that foreign aid was not needed to start the recovery or to keep it going. Cowen found that the economic recoveries of France, Italy, and Belgium, started before the Marshall Plan. Belgium relied heavily on free market economic policies after its liberation in 1944, and had the fastest recovery. It also did not have the severe housing and food shortages seen in the rest of continental Europe. ==Related pages== * Alliance for Progress failed Central and South American Marshall Plan. * GARIOA (Government and Relief in Occupied Areas) The precursor of the Marshall plan aid. * Morgenthau plan Post-surrender plan for Germany * The industrial plans for Germany ==References== * Arkes, Hadley. Bureaucracy, the Marshall Plan, and the National Interest. Princeton, N.J: Princeton University Press, 1972. * Agnew, John and J. Nicholas Entrikin, eds. The Marshall Plan Today: Model and Metaphor. Routledge. (2004) online version * John Bledsoe Bonds; Bipartisan Strategy: Selling the Marshall Plan Praeger, 2002 online version * Bothwell, Robert. The Big Chill: Canada and the Cold War. Canadian Institute for International Affairs/Institut Canadien des Affaires Internationales Contemporary Affairs Series, No. 1. Toronto: Irwin Publishing Ltd., 1998. * Crafts, Nicholas, and Gianni Toniolo, eds. Economic Growth in Europe Since 1945. Cambridge University Press, 1996. * Djelic, Marie-Laure A.; Exporting the American Model: The Post-War Transformation of European Business.Oxford University Press, 1998 online version * Chiarella Esposito; America's Feeble Weapon: Funding the Marshall Plan in France and Italy, 1948 – 1950, Greenwood Press, 1994 online version * Fossedal, Gregory A. Our Finest Hour: Will Clayton, the Marshall Plan, and the Triumph of Democracy. Stanford, CA: Hoover Institution Press, 1993. * Gaddis, John Lewis. We Now Know: Rethinking Cold War History. New York: Oxford University Press, 1997. * Grogin, Robert C. Natural Enemies: The United States and the Soviet Union in the Cold War, 1917 – 1991. Lanham, Md.: Lexington Books, 2001. * Hogan, Michael J. The Marshall Plan: America, Britain, and the Reconstruction of Western Europe, 1947 – 1952. Cambridge: Cambridge University Press, 1987. * Matthias Kipping and Ove Bjarnar; The Americanisation of European Business: The Marshall Plan and the Transfer of Us Management Models Routledge, 1998 online version * Mee, Charles L. The Marshall Plan: The Launching of the Pax Americana. New York: Simon and Schuster, 1984. * Milward, Alan S. The Reconstruction of Western Europe, 1945 – 51. London: Methuen, 1984. * Schain, Martin, ed. The Marshall Plan: Fifty Years After. New York: Palgrave, 2001. * Stueck, William Whitney, ed. The Korean War in World History. Lexington, Ky.: University Press of Kentucky, 2004. * Rhiannon Vickers; Manipulating Hegemony: State Power, Labour and the Marshall Plan in Britain Palgrave Publishers, 2000 online edition * Wallich, Henry Christopher. Mainsprings of the German Revival. New Haven: Yale University Press, 1955. * Wasser, Solidelle F. and Michael L. Dolfman; \"BLS and the Marshall Plan: The Forgotten Story: The Statistical Technical Assistance of BLS Increased Productive Efficiency and Labor Productivity in Western European Industry after World War II; Technological Literature Surveys and Plan-Organized Plant Visits Supplemented Instruction in Statistical Measurement,\" Monthly Labor Review, Vol. 128, 2005 * Wend, Henry Burke; Recovery and Restoration: U.S. Foreign Policy and the Politics of Reconstruction of West Germany's Shipbuilding Industry, 1945 – 1955. Praeger, 2001 online version ==Further reading== * John Gimbel \"The origins of the Marshall plan\" (Stanford University Press, 1976). (reviewed here) * Greg Behrman The Most Noble Adventure: The Marshall Plan and the Time When America Helped Save Europe (Free Press, 2007) ==Notes== ==Other websites== * The German Marshall Fund of the United States * Economist Tyler Cowen questions the conventional wisdom surrounding the Plan * Truman Presidential Library online collection of original Marshal Plan documents from the year 1946 onwards * The Marshal Plan documents collection at MCE * Marshall Plan from the National Archives * Excerpts from book by Allen W. Dulles * United States Secretary of State James F. Byrnes famous Stuttgart speech, September 6, 1946 The speech marked the turning point away from the Morgenthau Plan philosophy of economic dismantlement of Germany and towards a policy of economic reconstruction. * Marshall Plan Commemorative Section: Lessons of the Plan: Looking Forward to the Next Century * U.S. Economic Policy Towards defeated countries April, 1946. * \"Pas de Pagaille!\" , Time magazine July 28, 1947 * \"The Marshall Plan as Tragedy,\" comment on Michael Cox and Caroline Kennedy- Pipe, \"The Tragedy of American Diplomacy? Rethinking the Marshall Plan,\" both published in the Journal of Cold War Studies, vol. 7, no. 1 (Winter 2005) (text of comment on pdf ) (text of original article on pdf ) * Luis García Berlanga's critique of the Marshall Plan in a classic Spanish film: Welcome Mr. Marshall! * Marshall Plan Still Working, 60 Years Later Cincinnati Enquirer December 10, 2006 Category:Economic history Category:World War II",
 "title": "Marshall Plan"
}