{
 "id": "820674",
 "text": "The Far Eastern Championship Games (also known as the Far Eastern Championships, Far Eastern Games or Far East Games) was an Asian multi-sport event considered to be a precursor to the Asian Games. == History == In 1913, Elwood Brown, president of the Philippine Amateur Athletic Association and Manila Carnival Games, proposed the creation of the \"Far Eastern Olympic Games\" to China and Japan. It was at that time that Governor-General William Cameron Forbes was the president of the Philippine Amateur Athletic Federation from 1911-1913. Governor-General Forbes formed the Far Eastern Olympic Association. The first event was held on the Manila Carnival grounds (later the Rizal Memorial Sports Complex) in Malate, Manila, Philippines on February 4, 1913 and was known as the \"First Oriental Olympic Games\". Forbes was also the one who formally declare the games open.Bell, Daniel (2003). Encyclopedia of International Games. McFarland and Company, Inc. Publishers, Jefferson, North Carolina. . Six countries participated in the eight-day event: the host country then-named Philippine Islands, Republic of China, Empire of Japan, British East Indies (Malaysia), Kingdom of Thailand and British crown colony Hong Kong. In 1915, the name changed to Far Eastern Championship Games and the association to Far Eastern Athletic Association when the event was held at Hongkou Park in Shanghai, China. They were held there again in 1921. The games were held every two years except in 1929 when Japan decided to delay the project to 1930. The FEAA decided to change the time table to four years and the Philippine Islands hosted the tenth games in 1934. Dutch East Indies (Indonesia) joined in the 1934 FECG. The 1934 edition was held in a period of dispute between China and Japan, following the Japanese invasion of Manchuria in 1931. Inclusion of people from this region in the games caused controversy between the two member nations, which resulted in the break-up of the Far Eastern Athletic Association. In September 1937, Japan invaded China with the Marco Polo Bridge Incident and started the Second Sino-Japanese War (which later became part of World War II), thus the planned games in 1938 were cancelled. ==Editions== Year Dates Host city Host nation 1913 3–7 February Manila 1915 15–21 May Shanghai 1917 8–12 May Tokyo 1919 12–16 May Manila 1921 30 May–3 June Shanghai 1923 21–25 May Osaka 1925 17–22 May Manila 1927 28–31 August Shanghai 1930 24–27 May Tokyo 1934 16–20 May Manila 1938 Cancelled Osaka ==Sports== A total of nine different sports were contested over the lifetime of the competition. Eight of the sports featured on each programmes of the games, with the ninth sport – cycling – being held once only, in 1915. ==Participating nations== * (all editions) * (1934 only) * Federated Malay States (1913 only) * (1913 only) * (1930 only) * (all editions) * (all editions) * (1913 only) == Related pages == * Asian Games * East Asian Games * Southeast Asian Games * West Asian Games ==References== * * Far Eastern Championship Games and Asian Games Research Project * The Far Eastern Championship Games ==Other websites== * Far Eastern Championship Games in pictures * Japan, China and the Far Eastern Championship Games * Philippines Roster in Far Eastern Championship Games * A brief history of the Games (archived) * Stefan Hübner Research on games in Asia Category:20th-century establishments in the Philippines Category:1913 establishments in Asia * Category:Multi-sport events",
 "title": "Far Eastern Championship Games"
}