{
 "id": "82066",
 "text": "The Empire State Building is a skyscraper in Midtown Manhattan, New York City. It is tall and has 102 floors.\"Empire State Building\" The Skyscraper Center Council on Tall Buildings and Urban Habitat website Named after the popular nickname for New York, the Empire State, it is one of the most famous landmarks in the US. When the Empire State Building opened on May 1, 1931, it was the world's tallest building. ==History== Designed by the architects named Shreve, Lamb & Harmon Associates, it was built at a time when many people were trying to make the world's tallest building, but the Empire State Building won. The old Waldorf-Astoria Hotel was destroyed so that the Empire State Building could be built. The Empire State Building was completed in 410 days. It opened on May 1, 1931, when United States President Herbert Hoover pushed a button in Washington, D.C. to turn on the lights. The Empire State Building's design was based on the 21-story Reynolds Building in Winston-Salem, built in 1929. In the 1930s, the Empire State Building was called the \"Empty State Building\" because few people worked in the building.See: * * * The Empire State Building became the tallest building in New York City and the world until the first World Trade Center towers passed it in 1970. When these towers were brought down in the September 11, 2001 attacks, the Empire State Building was again the tallest building in New York. It stopped being New York's tallest building in 2012 when the new One World Trade Center was built. On Saturday, July 28, 1945, a plane crashed into the building due to heavy fog and started a fire. The building was only slightly damaged, but 14 people (3 in the plane) were killed. On January 24, 2000, an elevator cable snapped, causing one of the building's elevators to crash from the 44th floor, stopping on the 4th floor. Both passengers in the elevator were only slightly injured. == Building design == The Empire State Building is at 350 Fifth Avenue. The building has its own ZIP code, 10118. There is a big Art Deco lobby with shops at Fifth Avenue. People can also go to a lobby on 34th Street. The Empire State Building has 73 elevators. The 80th, 86th, and 102nd floors have places where people can look at the city from high above. There is a steel mast on the top of the Empire State Building. The builders wanted to have an airship station on the roof, but the station was not opened. Today, people cannot go to the mast.} The mast has radio transmitters. The Empire State Building also lights up at night. == Photos == File:Empire State Building Red and Green.JPG File:Empire State Building3 Dec.2005.jpg File:Empire states3.jpg File:Manhattan at Dusk by slonecker.jpg File:Empire State Building Feb 2006.jpg File:Mast Empire State Building.JPG File:Empire State Building 2005.jpg File:Empire State Building 55.jpg ==Related pages== * List of tallest buildings in the world * List of tallest buildings in New York City == References == == Books == * * * * * * == Other websites == * Official Website – Empire State Building * Emporis.com – Empire State Building * SkycraperPage.com – Empire State Building Category:1931 establishments in New York (state) Category:20th-century architecture Category:Art Deco buildings Category:Buildings and structures in Manhattan Category:New York City Designated Landmarks Category:Seven Wonders of the Modern World Category:Skyscrapers in New York City",
 "title": "Empire State Building"
}