{
 "id": "820615",
 "text": "Khuman Pokpa () or Khuman Apokpa () is the Apokpa (Ancestor God) of the Khuman clan. He is regarded as the founder of the Khuman dynasty. He is one of the three members of the Mangang Luwang Khuman in Meitei mythology and religion. He represents the time of the sunset and the night. == Name == The name \"Khuman Pokpa\" is made up of two words, \"Khuman\" and \"Pokpa\". In Meitei language (Manipuri language), \"Pokpa\" means \"to beget (be the father of) or to give birth to\". The word \"Apokpa\" comes from \"Pokpa\". Apokpas are the dead male members of a family for the last three generations. They can be the father, grandfather, or great grandfather of any living person. They looked after the family in the past. So, \"Khuman Pokpa\" or \"Khuman Apokpa\" means \"The one who gave birth to the Khumans\". == Description == Meitei people worship fire in the fireplace called Phunga Mei (lit. hearth fire) at home. In the fireplace, there are three stones kept. One stone is in the right west, another in the north east and another in the south east. This forms a triangle. These three stones represent the three great times of a day. The northeastern stone represents the Mangang. The southeastern stone represents the Luwang. The western stone represents the Khuman. Here, Khuman represents the time of the sunset and the night. The remaining Mangang and Luwang represent the sunrise and the noon respectively. The Meiteis addressed the hearth fire (phunga mei) as \"Meitreng Arabana Yoimayai Mahut Sinna Mei\". The English translation of this Meitei language (Manipuri language) passage is \"The burning fire in the hearth place substitutes the Sun\". Thus, the Sun is worshipped in the Meetei Phunga. == Cults and pantheons == Among many, one of the most important pantheons of God Khuman Pokpa is in Mayang Imphal. Mayang Imphal is the ancient capital of the Khuman kingdom. == Worship == In ancient times, God Khuman Pokpa was worshipped for good health and prosperity. According to the beliefs of the fishermen of the Karang Island, diseases with unexplainable causes are caused by gods and goddesses. According to their beliefs, the danger of natural calamities, epidemics, diseases and other miseries are all due to the getting angry of gods and goddesses. The reasons for their anger are usually because of not performing rites and rituals. == Festival == The religious festival of Lai Haraoba is celebrated in honor of God Khuman Pokpa in the Karang Islands. The celebration lasts for ten consecutive days during the month of September. In modern days, the celebration draws attention to a large number of tourists. == Related pages == * Khuman Kangleirol == References == == Bibliography == * An ethnographical survey of totemism (cont.) - Page 327 - Sir James George Frazer · 1910 * History of Manipur - Page 174 - Jyotirmoy Roy · 1973 * Khamba and Thoibi: The Unscaled Height of Love - Page 189 - N. Tombi Singh · 1976 * Manipur: Law, customs, hill-men, language and religion - Page 673 - Naorem Sanajaoba · 2003 * Out of Isolation: Exploring a Forgotten World, Uncovering a Culture in Conflict - Page 492 - Frans Welman · 2007 * Proceedings of North East India History Association - Page 115 - North East India History Association. Session · 1983 * The Meitheis - Page 99 - Thomas Callan Hodson · 1908 == Other websites == * INTERNET ARCHIVE, Khuman Pokpa Category:Meitei gods and goddesses",
 "title": "Khuman Pokpa"
}