{
 "id": "820672",
 "text": "The is the governing body responsible for the administration of football in Japan. It is responsible for the national team, as well as club competitions. ==History== The organisation was founded in 1921 as the , and became affiliated with FIFA in 1921. In 1945, the name of the organisation was changed to the ; its Japanese name was changed to the current title in 1975. This reflected common use of the word sakkā (サッカー), derived from \"soccer\", rather than the older Japanese word shūkyū (蹴球; literally \"kick-ball\"). The word sakkā gained popularity during the post-World War II occupation of Japan by the Allied powers. The association generally translates its name to \"Japan Football Association\" in English, though \"Japan Soccer Association\" is also used. ==Symbol== The symbol of the JFA is the Yatagarasu, a mythical three- legged raven that guided Emperor Jimmu to Mount Kumano. Yatagarasu is also the messenger of the supreme Shinto sun goddess Amaterasu. ==Presidents== The following is a list of presidents of Japan Football Association (JFA). The Honorary President is Her Imperial Highness Princess Takamado. Presidency President Took office Left office 1 Jikichi Imamura 1921 1933 2 Ryutaro Fukao 1935 1945 3 Ryutaro Takahashi 1947 1954 4 Yuzuru Nozu 1955 1976 5 Tomisaburo Hirai 1976 1987 6 Shizuo Fujita 1987 1992 7 Hideo Shimada 1992 1994 8 Ken Naganuma 1994 1998 9 Shunichiro Okano 1998 2002 10 Saburo Kawabuchi 2002 2008 11 Motoaki Inukai 2008 2010 12 Junji Ogura 2010 2012 13 Kuniya Daini 2012 2016 14 Kozo Tashima 2016 Present ==Sponsorship== Japan has one of the highest sponsorship incomes for a national squad. In 2010, their sponsorship income amounted to over 12.5 million pounds. Primary sponsors include Kirin, Adidas, Panasonic, Saison Card International, FamilyMart, Fujifilm, ANA, Bank of Yokohama, NTT Docomo and Nissan. ==References== ==Other websites== *Japan Football Association (JFA) – official website Category:1920s establishments in Japan Category:1921 establishments in Asia Category:Football governing bodies in Asia Category:Football in Japan Category:Sports organizations of Japan",
 "title": "Japan Football Association"
}