{
 "id": "820712",
 "text": "The , commonly known as the , is a women's association football league in Japan. The Nadeshiko League consists of three divisions that correspond to the top three levels of the Japanese women's football pyramid respectively: the Nadeshiko League Division 1, the Nadeshiko League Division 2, and the Nadeshiko . Teams are promoted and relegated among the three divisions, and between the Nadeshiko Challenge League and the fourth-level Japanese regional leagues, based on performance in the previous season. Since 2008, the Nadeshiko League has been sponsored by , a fast food company based in Fukuoka. == History == Japan Women's Football League began in 1989. From 1993 to 1999 it adopted an Apertura and Clausura system, similar to the J.League system of that era. From 2000 to 2003 the clubs were divided into East and West groups and then the top clubs of each would go into a championship group, with the bottom clubs in a relegation group. In 2004 the single-table format was brought back. Players from the 8 Japan Women's Football League teams would host an annual training camp to build skills and relationships between the L.League and women's international football clubs, including U.S.- and Australia-based teams. In 2004 the L.League was renamed to Nadeshiko League, with the nickname \"Nadeshiko Japan\". Nadeshiko is the name of the dianthus flower and was chosen from suggestions by fans, signifying an ideal of a dutiful Japanese woman.Alisa Freedman, Laura Miller, Christine R. Yano. . Stanford University Press, 2013.Gregory G. Reck, Bruce Allen Dick. McFarland, 2015. Starting in the 2004 season, the L.League had 2 divisions – Division 1, with 8 clubs, and Division 2, with 8 clubs in the 2006 season. Until 2009 the league operated in the same way as the old Japan Soccer League for men, the bottom club in the second division playing off against a regional league playoff winner. Starting with the 2010 season, the second division is divided into an east and west group of six teams each. The winners of each group are promoted. In 2015 this became Division 3, with the Nadeshiko League becoming two divisions of 10 teams each. After Japan's World Cup win in 2011 the L.League saw an upsurge in popularity. * * * * * On 3 June 2020, the Japan Football Association announced that the newly established WE League will become the top level for women's football in Japan when it begins play in 2021. The Nadeshiko League will then become the second to fourth levels of the Japanese women's football pyramid. ==Club== === 2020 season === The Nadeshiko League Divisions 1 and 2 consist of 10 teams each. The Nadeshiko Challenge League is divided into two groups (East and West) of six teams each. ==== Division 1 ==== Club Hometown(s) First Season in Top Flight Current Spell in Top Flight Nippon TV Tokyo Verdy Beleza Inagi, Tokyo 1989 1989– INAC Kobe Leonessa Kobe, Hyogo 2005 2005– Mynavi Vegalta Sendai Sendai, Miyagi 2013 2013– Albirex Niigata Niigata Prefecture 2007 2007– Cerezo Osaka Sakai Osaka 2018 2020– Ehime FC Matsuyama 2020 2020– JEF United Chiba Chiba, Chiba 2000 2009– Urawa Reds Saitama, Saitama 1999 1999– Nojima Stella Kanagawa Sagamihara Sagamihara, Kanagawa 2017 2017– Iga FC Kunoichi Mie Iga, Mie 1989 2019– ==== Division 2 ==== Clubs Hometown(s) Bunnys Kyoto SC Kyoto. (Kyoto) Chifure AS Elfen Saitama kawagoe, Saitama AS Harima Albion Himeji, (Hyogo) FC Jumonji Ventus Niza, Saitama, Orca Kamogawa FC Kamogawa Nippon Sport Science University Fields Yokohama Yokohama AC Nagano Parceiro Nagano Sfida Setagaya FC Musashino Yamato Sylphid Yokohama Nippatsu Yokohama FC Seagulls Yokohama ==== Challenge League ==== Clubs (East) Hometown(s) Tokiwagi Gakuen High School Sendai, Miyagi Norddea Hokkaido Sapporo, Hokkaido Tsukuba FC Tsukuba, Ibaraki Niigata University of Health and Welfare Niigata, Niigata JFA Academy Fukushima Susono, ShizuokaDue to the 2011 Tōhoku earthquake and tsunami, the team has relocated from Naraha, Fukushima to sport facilities in Shizuoka Prefecture. http://www.jfa.jp/youth_development/jfa_academy/fukushima/operation.html Clubs (West) Hometown(s) Speranza Osaka-Takatsuki Takatsuki, Osaka Kibi International University Charme Okayama Takahashi Takahashi, Okayama Okayama Yunogo Belle Mimasaka, Okayama Angeviolet Hiroshima Hiroshima NGU Nagoya FC Ladies Nagoya, Aichi === Previous clubs === The following clubs are not competing in the Nadeshiko League during the 2020 season, but have previously competed in the Nadeshiko League for at least one season. ==== Relegated to regional leagues ==== *Je Vrille Kagoshima: relegated to Kyushu League from 2014 *Shimizudaihachi Pleiades: relegated to Tokai League from 2015 *Kumamoto Renaissance FC: relegated to Kyushu League from 2016 ==== Defunct ==== *Fujita SC Mercury (affiliated with Shonan Bellmare) *Nikko Securities Dream Ladies *Nissan FC Ladies (affiliated with Yokohama F. Marinos) *OKI FC Winds *Shiroki FC Serena *Suzuyo Shimizu FC Lovely Ladies (affiliated with Shimizu S-Pulse) *Tasaki Perule FC *Tokyo Shidax LSC (formerly Shinko Seiko FC Clair) *Urawa Motobuto Ladies FC *TEPCO Mareeze (dissolved after Fukushima Daiichi nuclear disaster; many of the players moved to Vegalta Sendai Ladies) *Aguilas Kobe *Hoyo Sukarabu FC == Champions == === Division 1 === Year Club 1989 Shimizu FC Ladies 1990 Yomiuri SC Ladies Beleza 1991 Yomiuri SC Ladies Beleza 1992 Yomiuri Nippon SC Ladies Beleza 1993 Yomiuri Nippon SC Ladies Beleza 1994 Matsushita Electric LSC Bambina 1995 Prima Ham FC Kunoichi 1996 Nikko Securities Dream Ladies 1997 Nikko Securities Dream Ladies 1998 Nikko Securities Dream Ladies 1999 Prima Ham FC Kunoichi 2000 Nippon TV Beleza 2001 Nippon TV Beleza 2002 Nippon TV Beleza 2003 Tasaki Perule FC 2004 Saitama Reinas FC Year Club 2005 Nippon TV Beleza 2006 Nippon TV Beleza 2007 Nippon TV Beleza 2008 Nippon TV Beleza 2009 Urawa Reds Ladies 2010 Nippon TV Beleza 2011 INAC Kobe Leonessa 2012 INAC Kobe Leonessa 2013 INAC Kobe Leonessa 2014 Urawa Reds Ladies 2015 Nippon TV Beleza 2016 Nippon TV Beleza 2017 Nippon TV Beleza 2018 Nippon TV Beleza 2019 Nippon TV Beleza 2020 Urawa Reds Ladies ==== Wins by club ==== Clubs in bold are those competing in Division 1 as of the 2020 season. Clubs in italic no longer exist. Club Champions Year Nippon TV Tokyo Verdy BelezaYomiuri Beleza was renamed to Nippon TV Beleza in 1999 and to Tokyo Verdy Beleza in 2011, when the Yomiuri Group sold its stake. 17 1990, 1991, 1992, 1993, 2000, 2001, 2002, 2005, 2006, 2007, 2008, 2010, 2015, 2016, 2017, 2018, 2019 Urawa Reds LadiesSaitama Reinas were absorbed by Urawa Red Diamonds in 2005. 4 2004, 2009, 2014, 2020 Nikko Securities Dream Ladies 3 1996, 1997, 1998 INAC Kobe Leonessa 3 2011, 2012, 2013 Iga FC Kunoichi MiePrima Ham FC Kunoichi was renamed to Iga FC Kunoichi in 2000. 2 1995, 1999 Shimizu FC Ladies 1 1989 Matsushita Electric LSC BambinaMatsushita LSC Bambina was renamed to Speranza FC Takatsuki in 2000. Then, renamed to Speranza Osaka-Takatsuki in 2012. 1 1994 Tasaki Perule FC 1 2003 Notes === Division 2 === Year Club 2004 Okayama Yunogo Belle 2005 INAC Kobe Leonessa 2006 Albirex Niigata Ladies 2007 TEPCO Mareeze 2008 JEF United Chiba Ladies 2009 AS Elfen Sayama FC Year East West 2010 Tokiwagi Gakuen HS Speranza FC Takatsuki 2011 Tokiwagi Gakuen HS FC Takahashi Kibi International University Charme Year Club 2012 Vegalta Sendai Ladies 2013 Tokiwagi Gakuen HS 2014 Speranza FC Osaka-Takatsuki 2015 AC Nagano Parceiro Ladies 2016 Nojima Stella Kanagawa Sagamihara 2017 Nippon Sport Science University Fields Yokohama 2018 Iga FC Kunoichi === Challenge League === Year Club 2015 Tokiwagi Gakuen HS 2016 Orca Kamogawa FC 2017 Shizuoka Sangyo University Iwata Bonita == Division 1 awards == === Best Player === Year Player Club 2002 Tomoe Sakai Nippon TV Beleza 2003 Mio Otani Tasaki Perule FC 2004 Kozue Ando Saitama Reinas FC 2005 Shinobu Ohno Nippon TV Beleza 2006 Homare Sawa 2007 Shinobu Ohno 2008 Homare Sawa 2009 Kozue Ando Urawa Reds Ladies 2010 Shinobu Ohno Nippon TV Beleza 2011 Nahomi Kawasumi INAC Kobe Leonessa 2012 Megumi Takase 2013 Nahomi Kawasumi 2014 Michi Goto Urawa Reds Ladies 2015 Mizuho Sakaguchi Nippon TV Beleza 2016 2017 2018 Mina Tanaka === Top Goalscorers === Year Player Goals Club 2002 Mio Otani 5 Tasaki Perule FC 2003 33 2004 Kozue Ando 12 Saitama Reinas FC 2005 Mio Otani 25 Tasaki Perule FC 2006 Yuki Nagasato 18 Nippon TV Beleza 2007 Shinobu Ohno 23 2008 20 2009 Kozue Ando 18 Urawa Reds Ladies 2010 Shinobu Ohno 13 Nippon TV Beleza 2011 Nahomi Kawasumi 12 INAC Kobe Leonessa Shinobu Ohno 2012 Megumi Takase 20 2013 Goebel-Yanez 15 2014 Yuika Sugasawa 20 JEF United Chiba Ladies 2015 15 2016 Mina Tanaka 18 Nippon TV Beleza 2017 15 2018 15 === Best Young Player === Year Player Club 2002 Kozue Ando Saitama Reinas FC 2003 Yukari Kinga Nippon TV Beleza 2004 Natsuki Muraoka Iga FC Kunoichi 2005 Karina Maruyama TEPCO Mareeze 2006 Noriko Matsuda Urawa Reds Ladies 2007 Kyoko Yano 2008 Mana Iwabuchi Nippon TV Beleza 2009 Megumi Takase INAC Kobe Leonessa 2010 Nozomi Fujita Urawa Reds Ladies 2011 Chinatsu Kira 2012 Shiho Kohata 2013 Saki Ueno JEF United Chiba Ladies 2014 Ruka Norimatsu Urawa Reds Ladies 2015 Kiko Seike 2016 Hina Sugita INAC Kobe Leonessa 2017 Yui Fukuta 2018 Hinata Miyazawa Nippon TV Beleza == References == == Other websites == * Official website * NADESHIKO LEAGUE 1 at women.soccerway.com Category:1989 establishments in Japan Category:Football leagues in Japan",
 "title": "Nadeshiko League"
}