{
 "id": "820716",
 "text": ", or The Empress's Cup, is a Japanese women's football competition. As an elimination tournament, it can be considered the female counterpart to the men's Emperor's Cup. The name \"Empress's Cup\" has been used since the 2012 season as the Empress's Cup trophy was founded in that year. From 2004 to 2011 season (New Year's Day of 2005 to 2012), the final was played on New Year's Day at the National Stadium in Tokyo before the Emperor's Cup final, and was regarded as the traditional closing match of the season. Since 2012, the final has been played separately from the Emperor's Cup final. ==Past winners== Past winners are: Year Winner Result Runners-up 1979 FC Jinnan 2–1 Takatsuki FC Ladies 1980 Shimizudaihachi SC 2–0 FC Jinnan 1981 Shimizudaihachi SC 6–0 FC PAF 1982 Shimizudaihachi SC 6–0 FC Jinnan 1983 Shimizudaihachi SC 2–0 Takatsuki FC Ladies 1984 Shimizudaihachi SC 4–0 Takatsuki FC Ladies 1985 Shimizudaihachi SC 5–1 Takatsuki FC Ladies 1986 Shimizudaihachi SC 1–0 Yomiuri SC Ladies Beleza 1987 Yomiuri SC Ladies Beleza 2–0 Shimizudaihachi SC 1988 Yomiuri SC Ladies Beleza 2–0 Takatsuki FC Ladies 1989 Takatsuki FC Ladies 1–0 Shimizu FC Ladies 1990 Nikko Securities Dream Ladies 3–3 (4–1 pen) Suzuyo Shimizu FC Lovely Ladies 1991 Suzuyo Shimizu FC Lovely Ladies 0–0 (3–1 pen) Yomiuri SC Ladies Beleza 1992 Nikko Securities Dream Ladies 1–0 Yomiuri Nippon SC Ladies Beleza 1993 Yomiuri Nippon SC Ladies Beleza 2–0 Prima Ham FC Kunoichi 1994 Prima Ham FC Kunoichi 4–1 Nikko Securities Dream Ladies 1995 Fujita SC Mercury 3–2 Yomiuri-Seiyu Beleza 1996 Nikko Securities Dream Ladies 3–0 Yomiuri-Seiyu Beleza 1997 Yomiuri-Seiyu Beleza 1–0 Prima Ham FC Kunoichi 1998 Prima Ham FC Kunoichi 1–0 Nikko Securities Dream Ladies 1999 Tasaki Perule FC 0–0 (4–2 pen) Prima Ham FC Kunoichi 2000 Nippon TV Beleza 2–1 Tasaki Perule FC 2001 Iga FC Kunoichi 2–1 (aet) Tasaki Perule FC 2002 Tasaki Perule FC 1–0 Nippon TV Beleza 2003 Tasaki Perule FC 2–2 (5–3 pen) Nippon TV Beleza 2004 Nippon TV Beleza 3–1 Saitama Reinas FC 2005 Nippon TV Beleza 4–1 Tasaki Perule FC 2006 Tasaki Perule FC 2–0 Okayama Yunogo Belle 2007 Nippon TV Beleza 2–0 Tasaki Perule FC 2008 Nippon TV Beleza 4–1 INAC Leonessa 2009 Nippon TV Beleza 2–0 Urawa Reds Ladies 2010 INAC Kobe Leonessa 1–1 (3–2 pen) Urawa Reds Ladies 2011 INAC Kobe Leonessa 3–0 Albirex Niigata Ladies 2012 INAC Kobe Leonessa 1–0 JEF United Chiba Ladies 2013 INAC Kobe Leonessa 2–2 (4–3 pen) Albirex Niigata Ladies 2014 Nippon TV Beleza 1–0 Urawa Reds Ladies 2015 INAC Kobe Leonessa 1–0 Albirex Niigata Ladies 2016 INAC Kobe Leonessa 0–0 (5–4 pen) Albirex Niigata Ladies 2017 Nippon TV Beleza 3–0 Nojima Stella Kanagawa Sagamihara 2018 Nippon TV Beleza 2–2 (2-0 ET) INAC Kobe Leonessa 2019 Nippon TV Beleza 1–0 Urawa Reds Ladies ==References== ==Other websites== * Official website, JFA.jp Category:1970s establishments in Japan Category:1979 establishments in Asia Category:Football in Japan Category:Football competitions in Japan",
 "title": "Empress's Cup"
}