{
 "id": "820782",
 "text": "The Viasna Human Rights Centre () is a human rights organization from Minsk, Belarus. The organization does help political prisoners and their families. made it in 1996 as a result of the large-scale repression of demonstrations by the government of Alexander Lukashenko. Ales Bialiatski and other people from the Viasna Human Rights Centre have been tried and arrested for that. For example, on November, 26, 2012, the authorities locked up Bialatski and closed the Minsk house of organization. Amnesty International said that was an open violation of what Belarus needs to do in the human rights field. From September 2020 to January 2021, these Viasna activists were arrested: Marfa Rabkova, Leanid Sudalenka, Tatsiana Lasitsa, Andrei Chapiuk. They were named political prisoners and got the for 2020. In July 2021, the office of Viasna and the houses of its people were looked for. Almost all representatives of Viasna who were in Belarus at that time, including Ales Bialiatski, were arrested. It was done as a part of the pogrom of NGOs in Belarus. These people were arrested on the criminal charges of getting riots ready and tax evasion. They were named political prisoners like Rabkova, Sudalenka, Lasitsa, and Chapiuk. In the winter of 2021–2022, the Belarusian authorities recognized Viasna’s Internet pages as extremist materials, and in August 2023, Viasna was declared an extremist group. Taking part in the activities of an extremist group is a crime in Belarus. == Awards == * (Ales Bialatski and the Viasna Human Rights Centre) (2005) * Freedom Award of the Atlantic Council (2011) * (Marfa Rabkova, Leanid Sudalenka, Tatsiana Lasitsa, Andrei Chapiuk) (2020) * Prize named after Marion Dönhoff (2021) ==References== == Literature == * ==Other websites== *Belarusian Human Rights Centre “Viasna” (the official site) *Human Rights Center Viasna: 15 years of persecution Category:Human rights organizations in Europe Category:Organizations based in Belarus",
 "title": "Viasna Human Rights Centre"
}