{
 "id": "821229",
 "text": "The Nashya Shaikh or Nashya Sekh(Bengali: নইস্য শেখ) is a Muslim community found in northern parts of the state of West Bengal in India. They are culturally and linguistically similar to both Rangpuri people of northern Bangladesh and Goalpariya people of Assam. A small number of the community are also found in the neighboring state of Bihar, where they are known as the Bengali Shaikh. These people are more commonly known as Rajbongshi Muslims. The Nashya are considered to be an important indigenous group found in northern West Bengal.Marginal Muslim Communities in India edited by M.K.A Siddiqui pages 74-89 They are homogeneous with the Koch Rajbongshi people and are bi-linguistic speaking both Bengali language and Koch language with Koch Rajbongshi language being replaced by Bengali language among the newer generations. == Etymology == There are descendants from Koch-Rajbonshi, Mech, Rabha, Bodo and Indo-Aryan people who converted to Islam. They mainly speak the Goalpariya dialect . They are mainly settled in the districts of Dhuburi, Goalpara, South Salmara and Kokrajhar. These people were loose followers of Hinduism. But when a small section of these people converted to Islam, the act was frowned upon. The local Hindus started calling them \"nosto seikh\" meaning \"spoiled Shaikh\". But as more number of people got converted to Islam with time these people came in contact with mainstream Muslims, and the term \"nosto seikh\" slowly got islamicised into \"Nashya seikh\". == Origin == The Nashyas trace their origin to the indigenous communities of Koch Rajbongshi of northern West Bengal, though some of them are also from Mech community. There conversion to Islam is said to have taken over two to three centuries, and the Nashya still retain many cultural traits of their pre-Islamic past. Most people of the community are non-practicing Muslims though the newer generations are becoming increasing Islamic due to globalization. From historic evidence, it seems a segment of the indigenous population of north Bengal converted started to convert to Islam when the region fell under the control of Bakhtiyar Khilji. Some of the earliest converts were the chiefs Ali Mach and Kala Pahar. Tradition also ascribes the conversion of several lineages to Sufi saints such as Torsa Pir, Pagla Pir, Shah Fakir Sahib and Shah Gari Sahib. ==References== Category:West Bengal Category:Bihar Category:Indian Muslims",
 "title": "Nashya Shaikh"
}