{
 "id": "821214",
 "text": "Konthoujam Tampha Lairembi () or Chingphuron Konthousu () is a goddess in Meitei mythology and religion (Sanamahism) of Ancient Kangleipak (Antique Manipur). She began as a human being in the Haorok Konthou group (Konthoujam clan). She is the wife of the sky god Salailen (alias Soraren). Her only child is Khoriphaba. == Mythology == Konthoujamba and Konthoujambi were a couple with no child. They consulted maibas but the maibas could not help them have a child. They prayed to God Salailen, the King of Heaven, to help them. God Salailen heard their prayer and told the goddess Imoinu to help the couple. Goddess Imoinu implanted herself into the womb of Lady Konthoujambi. When Konthoujambi was pregnant with a 3 month old fetus, God Salailen instructed her that her child will be His wife in the future. Later, Konthoujambi gave birth to a baby girl. The couple named their daughter Chingphulon Konthousu (later known as Tampha). As Chingphulon Konthousu grew up, she was known for her beauty and gentleness. She used to go to woods, lakes and open meadows for fun. One day, while Tampha was out in an open field with her friends, a strong wind blew. Tampha was lifted up by a whirlwind towards the sky. Her friends could do nothing but watch. The wind took her to heaven, the abode of Salailen. He was waiting for her. Tampha was unhappy about being far away from her parents and friends. To please her, Salailen promised her that the people of her native place would attain immortality and be safe from all diseases. Still, her parents, family and friends cried for the loss of her. Salailen told them that Tampha was safe with him. He told them about the promises he kept to her. Many years had passed and Salailen and Tampha had a son. She and Salailen named their son Khoriphaba. Tampha's parents wanted to see her. So they planned to meet her. Men went on a hunting expedition with their hunting dogs across the Thangjing Hills. Unfortunately, they could not catch even one animal. The tired hunters rested under the shade of a tree. Meanwhile, one of their favorite hunting dogs wandered away. The dog saw a large python sitting in sun. It barked at the python. The python killed it. Later, the hunters found the dead dog and carried it home. They prepared a funeral for the dog. The smoke from the funeral rose up towards the sky. Up in Heaven, Tampha saw the smoke rising from her native place. She knew it was for a funeral. She worried about her people. Perhaps someone had died even though Salailen had promised to keep them safe from disease. She asked Salailen about his promises. Salailen told her that the funeral was only for a dog. She did not believe him and wanted to see her parents. Reluctantly, Salailen allowed her to meet people under some conditions. She should leave only after their son Khoriphaba had gone to sleep and should come back before he woke up. Also, she should not consume any earthly foods or drinks. Then, he placed a golden ladder (or golden stairs in another version) for her to climb down. She landed on the Thangjing Hill and then went to Konthoujam, her native land. She met her near and dear ones. Her mother offered Tampha delicious foods. Tampha did not accept her mother's offers. However, her mother caught hold of her and tried to force her to eat. Tampha told her mother of the conditions with which she was leaving heaven to meet them on earth. Then, her mother arranged a shade with seven layers of false ceiling, enclosed by seven layers of drapery. Her plan was to block the vision of Salailen from above. Inside the shades, she served out delicious food for Tampha. Poor Tampha was compelled to eat what her mother had so lovingly prepared for her. But the God Salailen saw it happen even through the drapes. As Tampha started eating, Salailen proclaimed from heaven that she could not come back to his abode. He spat a blob of spit on her hand (or on her food in another version). The golden ladder (or golden stairs in another version) was also lifted up. Poor Tampha was abandoned from heaven. Salailen also took back his promises of immortality and immunity to disease. Later, she lived in the outskirts of Konthoujam. Since then, she came to be known as Konthoujam Tampha Lairembi. == Related pages == * Konthoujam Lairembi gi Khubam == References == == Other websites == * * * * * * * * * Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of beauty Category:Gods and goddesses of fertility",
 "title": "Konthoujam Tampha Lairembi"
}