{
 "id": "821335",
 "text": "The 2017 FIFA U-20 World Cup was the twenty-first edition of the FIFA U-20 World Cup. The 2017 FIFA U-20 World Cup took place in South Korea. ==Host selection== Along with asking member associations whether it wished to host the Under 20, Under 17 or the Beach Soccer World Cup in 2017 (along with Women's Tournaments a year previous), a declaration of interest would need to have been sent by 15 May 2013. A total of 12 countries submitted a bid to host the tournament by the May 2013 deadline: * * * (later withdrew) * * * * * * (later withdrew) * * * The final decision on who would be hosts were made as part of FIFA's Executive Committee meetings in Brazil on 5 December 2013 with Korea Republic being awarded the hosting rights. ==Qualified teams== A total of 24 teams qualified for the final tournament. In addition to South Korea who qualified automatically as hosts, the other 23 teams qualified from six separate continental competitions. Starting from 2017, the Oceania Football Confederation received an additional slot (in total two), while UEFA will have five instead of six slots. Confederation Qualifying Tournament Qualifier(s) AFC (Asia) Host Nation AFC (Asia) 2016 AFC U-19 Championship CAF (Africa) 2017 Africa U-20 Cup of Nations CONCACAF (Central, North America and Caribbean) 2017 CONCACAF U-20 Championship CONMEBOL (South America) 2017 South American U-20 Championship OFC (Oceania) 2016 OFC U-20 Championship UEFA (Europe) 2016 UEFA European Under-19 Championship : 1. Teams that made their debut. ==Venues== Cheonan, Daejeon, Incheon, Seogwipo, Jeonju and Suwon were the six cities chosen to host the competition from a shortlist of nine, with Seoul, Pohang, and Ulsan not chosen. Cheonan Daejeon Incheon Cheonan Stadium (Cheonan Sports Complex) Daejeon World Cup Stadium Incheon Football Stadium (Incheon Stadium) Capacity: 25,814 Capacity: 39,654 Capacity: 19,649 Seogwipo Jeonju Suwon Jeju World Cup Stadium Jeonju World Cup Stadium Suwon World Cup Stadium Capacity: 29,346 Capacity: 41,785 Capacity: 42,655 ==Preparation== As part of preparations for the U-20 World Cup, the 2016 Suwon JS Cup, an international football friendly tournament, was held to prepare the host organizers. ==Organization== The following were key milestones in the organization of the tournament: *The match schedule was announced by FIFA on 23 November 2015. *Former South Korean internationals Ahn Jung-hwan and Park Ji-sung were appointed as the ambassadors of the tournament. *The official emblem, slogan (\"Trigger the Fever\") and look of the tournament were unveiled on 16 June 2016. *The official mascot, Chaormi, a young tiger, was unveiled on 25 August 2016. *Details of the volunteer programme, which was launched on 1 November 2016, was released on 18 October 2016. *The official posters were released on 27 October 2016. *Venue package tickets went on sale on 1 November 2016, while general ticket sales began on 2 January 2017. All-out ticket sales kicked off on 16 March 2017. *NCT Dream were appointed as Local Organising Committee ambassadors, and were also chosen to sing the official song of the tournament: \"Trigger the Fever\". ==Draw== The draw was held on 15 March 2017, 15:00 KST (UTC+9), at the Suwon Artrium in Suwon, South Korea. Two Argentine players who have won the FIFA U-20 World Cup, Diego Maradona and Pablo Aimar, participated in the draw. Minho Choi from the South Korean idol group SHINee also participated in the draw. The 24 teams were drawn into six groups of four teams, with hosts South Korea being allocated to position A1. The teams were seeded into their respective pots based on their results in the last five FIFA U-20 World Cups (more recent tournaments weighted more heavily), with bonus points awarded to confederation champions. Teams from the same confederation could not be drawn against each other for the group stage. Pot 1 Pot 2 Pot 3 Pot 4 ==Match officials== A total of 22 refereeing trios (a referee and two assistant referees), 5 support referees, and 21 video assistant referees were appointed for the tournament. This was the first FIFA underage tournament which uses the video assistant referee. Confederation Referee Assistant referees Support referee Video assistant referees AFC Abdulrahman Al-Jassim Taleb Al-Marri Saud Al-Maqaleh Ahmed Al-Kaf Muhammad Taqi Aljaafari Ryuji Sato Nawaf Shukralla AFC Abdulla Hassan Mohamed Mohamed Al-Hammadi Hasan Al-Mahri Ahmed Al-Kaf Muhammad Taqi Aljaafari Ryuji Sato Nawaf Shukralla AFC Kim Jong-hyeok Yoon Kwang-yeol Kim Young-ha Ahmed Al-Kaf Muhammad Taqi Aljaafari Ryuji Sato Nawaf Shukralla CAF Sidi Alioum Evarist Menkouande Elvis Guy Noupue Nguegoue Bamlak Tessema Weyesa Mehdi Abid Charef Malang Diedhiou Eric Otogo-Castane CAF Ghead Grisha Redouane Achik Waleed Ahmed Bamlak Tessema Weyesa Mehdi Abid Charef Malang Diedhiou Eric Otogo-Castane CAF Janny Sikazwe Jerson dos Santos Zakhele Siwela Bamlak Tessema Weyesa Mehdi Abid Charef Malang Diedhiou Eric Otogo-Castane CONCACAF Joel Aguilar Juan Zumba William Torres Yadel Martínez Roberto García Ricardo Montero John Pitti CONCACAF Walter López Gerson López Hermenerito Leal Yadel Martínez Roberto García Ricardo Montero John Pitti CONCACAF César Ramos Marvin Torrentera Miguel Hernández Yadel Martínez Roberto García Ricardo Montero John Pitti CONMEBOL Julio Bascuñán Carlos Astroza Christian Schiemann Mario Díaz de Vivar José Argote Wilton Sampaio Gery Vargas Mauro Vigliano CONMEBOL Andrés Cunha Nicolás Taran Mauricio Espinosa Mario Díaz de Vivar José Argote Wilton Sampaio Gery Vargas Mauro Vigliano CONMEBOL Diego Haro Jonny Bossio Raúl López Mario Díaz de Vivar José Argote Wilton Sampaio Gery Vargas Mauro Vigliano CONMEBOL Roddy Zambrano Christian Lescano Byron Romero Mario Díaz de Vivar José Argote Wilton Sampaio Gery Vargas Mauro Vigliano OFC Matt Conger Simon Lount Tevita Makasini — Nick Waldron OFC Norbert Hauata Philippe Revel Bertrand Brial — Nick Waldron UEFA Cüneyt Çakır Bahattin Duran Tarık Ongun Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Jonas Eriksson Mathias Klasenius Daniel Wärnmark Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Sergei Karasev Anton Averyanov Tikhon Kalugin Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Viktor Kassai György Ring Vencel Tóth Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Björn Kuipers Sander van Roekel Erwin Zeinstra Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Szymon Marciniak Paweł Sokolnicki Tomasz Listkiewicz Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer UEFA Antonio Mateu Lahoz Pau Cebrián Devis Roberto Díaz Pérez Ivan Kružliak William Collum Pavel Královec Danny Makkelie Svein Oddvar Moen Daniele Orsato Anastasios Sidiropoulos Felix Zwayer ==Squads== Each team had to name a preliminary squad of 35 players. From the preliminary squad, the team had to name a final squad of 21 players (three of whom must be goalkeepers) by the FIFA deadline. Players in the final squad could be replaced due to serious injury up to 24 hours prior to kickoff of the team's first match. The squads were announced by FIFA on 11 May 2017. ==Group stage== The top two teams of each group and the four best third-placed teams advanced to the round of 16. All times are local, KST (UTC+9). ===Tiebreakers=== The rankings of teams in each group were determined as follows (regulations Article 17.7): If two or more teams were equal on the basis of the above three criteria, their rankings were determined by: ===Group A=== \\---- \\---- ===Group B=== \\---- \\---- ===Group C=== \\---- \\---- ==Results== RSSSF ===Group stage=== ====Group A==== Team Pld W D L GF GA GD Pts align=left 3 2 1 0 5 1 +4 7 align=left 3 2 0 1 5 2 +3 6 align=left 3 1 0 2 6 5 +1 3 align=left 3 0 1 2 1 9 -8 1 ====Group B==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 10 0 +10 9 align=left 3 1 1 1 3 3 0 4 align=left 3 1 1 1 3 4 -1 4 align=left 3 0 0 3 4 13 -9 0 ====Group C==== Team Pld W D L GF GA GD Pts align=left 3 2 0 1 6 4 +2 6 align=left 3 1 1 1 4 4 0 4 align=left 3 1 1 1 2 2 0 4 align=left 3 1 0 2 4 6 -2 3 ====Group D==== Team Pld W D L GF GA GD Pts align=left 3 2 1 0 3 0 +3 7 align=left 3 1 1 1 4 3 +1 4 align=left 3 1 1 1 4 5 -1 4 align=left 3 0 1 2 1 4 -3 1 ====Group E==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 9 0 +9 9 align=left 3 1 1 1 3 3 0 4 align=left 3 1 0 2 3 6 -3 3 align=left 3 0 1 2 0 6 -6 1 ====Group F==== Team Pld W D L GF GA GD Pts align=left 3 1 2 0 5 4 +1 5 align=left 3 1 1 1 2 1 +1 4 align=left 3 1 1 1 3 4 -1 4 align=left 3 0 2 1 4 5 -1 2 ===Group D=== \\---- \\---- ===Group E=== \\---- \\---- ===Group F=== \\---- \\---- === Ranking of third-placed teams === The four best teams among those ranked third are determined as follows (regulations Article 17.8): == Knockout stage == In the knockout stage, if a match was level at the end of normal playing time, extra time was played (two periods of 15 minutes each) and followed, if necessary, by a penalty shoot-out to determine the winner. However, for the third place match, no extra time was played and the winner was determined by kicks from the penalty mark. In the round of 16, the four third-placed teams were matched with the winners of groups A, B, C, and D. The specific match-ups involving the third-placed teams depend on which four third-placed teams qualified for the round of 16: Third- placed teams qualify from groups 1A vs 1B vs 1C vs 1D vs A B C D 3C 3D 3A 3B A B C E 3C 3A 3B 3E A B C F 3C 3A 3B 3F A B D E 3D 3A 3B 3E A B D F 3D 3A 3B 3F A B E F 3E 3A 3B 3F A C D E 3C 3D 3A 3E A C D F 3C 3D 3A 3F A C E F 3C 3A 3F 3E A D E F 3D 3A 3F 3E B C D E 3C 3D 3B 3E B C D F 3C 3D 3B 3F B C E F 3E 3C 3B 3F B D E F 3E 3D 3B 3F C D E F 3C 3D 3F 3E ===Bracket=== === Round of 16 === \\---- \\---- \\---- \\---- \\---- \\---- \\---- === Quarter-finals === \\---- \\---- \\---- === Semi-finals === \\---- === Third place play-off === === Final === This was the first ever final for both England and Venezuela in the history of the tournament, in their 11th and 2nd appearances respectively. England's previous best result was in 1993 when they finished third, while Venezuela were eliminated in the round of 16 in 2009. This was England's first appearance and victory in the final of a global football tournament since their senior side's 1966 FIFA World Cup victory, ending 51 years of waiting for a global tournament trophy. == Awards == The following awards were given at the conclusion of the tournament. They were all sponsored by Adidas, except for the FIFA Fair Play Award and Goal of the Tournament. Golden Ball Silver Ball Bronze Ball Dominic Solanke Federico Valverde Yangel Herrera Golden Boot Silver Boot Bronze Boot Riccardo Orsolini (5 goals, 0 assists) Josh Sargent (4 goals, 1 assist) Jean-Kévin Augustin (4 goals, 0 assists) Golden Glove Freddie Woodman FIFA Fair Play Award Goal of the Tournament Sergio Córdova == Goalscorers == ; 5 goals * Riccardo Orsolini ; 4 goals * Dominic Solanke * Jean-Kévin Augustin * Josh Sargent * Sergio Córdova * Fashion Sakala ; 3 goals * Ademola Lookman * Reza Shekari * Ritsu Doan * Diogo Gonçalves * Bong Kalo ; 2 goals * Lautaro Martínez * Marcelo Torres * Bryan Cabezas * Dominic Calvert- Lewin * Allan Saint-Maximin * Jorge Álvarez * Giuseppe Panico * Lee Seung-woo * Paik Seung-ho * Ronaldo Cisneros * Myer Bevan * Xadas * Abdulrahman Al-Yami * Jeremy Ebobisse * Brooks Lennon * Nicolás De La Cruz * Adalberto Peñaranda * Samuel Sosa * Emmanuel Banda * Patson Daka * Enock Mwepu ; 1 goal * Marcos Senesi * Matías Zaracho * Jostin Daly * Randall Leal * Jimmy Marin * Jordy Caicedo * Hernan Lino * Adam Armstrong * Lewis Cook * Kieran Dowell * Amine Harit * Denis-Will Poha * Martin Terrier * Marcus Thuram * Jonas Arweiler * Kentu Malcolm Badu * Emmanuel Iyoha * Philipp Ochs * Fabian Reese * Suat Serdar * Sendel Cruz * Mehdi Mehdikhani * Federico Dimarco * Andrea Favilli * Luca Vido * Koki Ogawa * Lim Min-hyeok * Lee Sang-heon * Edson Álvarez * Kevin Magaña * Hunter Ashworth * Bruno Costa * Hélder Ferreira * Xande Silva * Abdulelah Alamri * Ousseynou Diagne * Ibrahima Niane * Luca de la Torre * Justen Glad * Lagos Kunga * Auston Trusty * Rodrigo Amaral * Santiago Bueno * Mathías Olivera * Nicolás Schiappacasse * Federico Valverde * Ronaldo Wilkins * Nahuel Ferraresi * Yangel Herrera * Wuilker Faríñez * Jan Carlos Hurtado * Ronaldo Peña * Williams Velásquez * Edward Chilufya * Shemmy Mayembe ; 1 own goal * Fikayo Tomori (playing against Guinea) * Nima Taheri (playing against Portugal) * Takehiro Tomiyasu (playing against South Africa) Source: FIFA == Final ranking == As per statistical convention in football, matches decided in extra time are counted as wins and losses, while matches decided by penalty shoot-outs are counted as draws. == Broadcasters rights == The following companies held the broadcasters rights: * : KBS, MBC, SBS * : TyC Sports, Cable Sport, Luján Cable Visión, La Matanza TV Cable, Santiago del Estero TV Cable * : SporTV, Manchete Sports, Rede Bandeirantes * : TSN, RDS * : Sony Six (Only match between South Korea and Guinea) * : RTV (4 matches in semifinals, third place match, and final) * : BS Fuji, Fuji TV One Two Next * : Astro * : Televisa / TDN, TV Azteca * : Sky Sport * : Tigo Sports, Movistar Sports, Caacupé Cable Visión, Itauguá TV Cable, Paraguari TV Cable * : Latina Televisión * : ABS-CBN * : Eurosport * South America: DirecTV * : ELTA TV (4 matches in semifinals, third place match, and final) * : Eurosport, BBC (final only) * : Fox Sports, Telemundo * : Tigo Sports, Movistar Sports, Canelones Cable Visión, Melo TV Cable, Paysandú TV Cable * : DirecTV, Meridiano Televisión, Venevisión * : VTV, FPT Group ==References== == Other websites == * FIFA U-20 World Cup Korea Republic 2017, FIFA.com * FIFA Technical Report Category:FIFA U-20 World Cup Category:2017 in association football Category:2017 in South Korea Category:Football in South Korea Category:May 2017 events Category:June 2017 events",
 "title": "2017 FIFA U-20 World Cup"
}