{
 "id": "821343",
 "text": "Pureiromba () or Puleilompa () is a God in Meitei mythology and religion. He is the giver of rain and good luck in farming. He is one of the major Umang Lai deities. He is the Ancestor God of the Angom clan of the Meitei ethnicity. == History == According to the Thalon text, Pureiromba () was one of the 5 gods of 5 different places of the Selloi Langmai Hill (Nongmaiching Hill). Before the Meitei King Ura Konthouba (c. 7th century CE) killed all the Selloi Langmai people, the cults of these five gods were put together into that of a single God with the name \"Langmai Ningthou\" (lit. King of the Langmais). The personal names became the other names or various forms of the God. With this, the tribal society of the Selloi Langmai people became one chiefdom. This chiefdom later became the Angom clan. == Description == The people who worship Pureiromba () think of him as their ancestor. However, no one knows if he was a real person from history or a god that acted like a human. But the ancient texts that show his adventures in the human world show him as a strong, powerful and able founding ancestor. He was initially associated with a Loi village of Andro, Manipur. But in later times, the people of Moirang worshipped him as one of their deified ancestors. == Festival == The religious festival of Lai Haraoba is celebrated in honor of God Pureiromba () in the months of Kalen (April-May). The Haraoba of Pureiromba belongs to the type of the Chakpa Haraoba. Chakpa Haraoba is one of the four types of Lai Haraoba. At Andro, Manipur, on the last day of the celebration of Pureiromba, a small mound of rice offerings is piled up by the maibis. Out of rice, the maibis construct a small landscape of mountain ranges, ravines, lakes, rivers, etc.Hamilton, Roy W.; Ammayao, Aurora (2003). The Art of Rice: Spirit and Sustenance in Asia. UCLA Fowler Museum of Cultural History. ISBN 978-0-930741-98-3. == Cults and pantheons == There are pantheons dedicated to God Pureiromba and his son Chinsongba in the village of Andro in Manipur. God Pureiromba is also regarded as the ancestor of the people of the Sharumbam clan of Meitei ethnicity. The cult of Pureiromba was looked after by the people of Mangsatabam clan of Meitei ethnicity. == Namesakes == === Pureiromba Youth Club === The Pureiromba Youth Club, Bamon Kampu, Imphal is a youths' club of Manipur. It reported to the Government of Manipur about the case of Thangjam Manorama. == Related pages == * Panam Ningthou == References == == Other websites == * INTERNET ARCHIVE, Pureiromba * E-PAO, Pureiromba * E-PAO, Pureilomba * Category:Meitei gods and goddesses Category:Gods and goddesses of agriculture Category:Gods and goddesses of fertility",
 "title": "Pureiromba"
}