{
 "id": "821436",
 "text": "Panam Ningthou () is a God in Meitei mythology and religion. He is the protector of crops, especially paddy from hailstorm and thunder. According to legends, He ignited fire for the first time by rubbing flints.Constantine, R. (1981). Manipur, Maid of the Mountains. Lancers. p. 43.Panchani, Chander Sheikhar (1987). Manipur, Religion, Culture, and Society. Konark Publishers. p. 73. ISBN 978-81-220-0047-4. He is one of the Umang Lai deities. == History == God Panam Ningthou has his major cult center in Andro village. The Andro village in Imphal East district of present day Manipur is an ancient village. People of this village worship fire that is kept burning from the time of Poireiton Khunthokpa (34 BC-18 BC). The fire is kept in the Chakpa Panam Ningthou Meihoupirol (lit. Panam Ningthou sacred burning fireplace). According to R. Constantine, the fire burning in Andro is the oldest man-made fire in India. It has been burning without break for centuries. == Description == According to Thomas Callan Hodson (T.C. Hodson), Panam Ningthou is a rain and weather God of the Meitei people of Manipur. He recorded his description in his monograph The Meitheis published in 1908. == Mythology == When it was one or two days before the Lai Haraoba festival of God Lainingthou Panam Ningthou begins, the God came to his temple in the form of a ball of light. He came flying from the east. He landed at a part of the Nongmaiching Hill. Sometimes, some people of Andro claimed to see that ball of light, even at other times of the year. God Lainingthou Panam Ningthou has a wife named Leimaren Sanarik Chaning Khombi. Some people believed that she might be of Burmese origin. So, the God went to Burma () to meet her from time to time. == Festival and worship == God Panam Ningthou is mainly worshipped by the people of Loi caste of Meitei ethnicity in Manipur. He has his major cult center in Andro village of Imphal East district of Manipur. Shakespeare noted that the Loi people regarded God Panam Ningthou as a special deity of the Meitei king. He further noted that the King himself provided sacrificial animals to the God. Buffalo was one among the sacrificial animals used to be sacrificed during the Lai Haraoba festival. Pigs were sacrificed when there was no Lai Haraoba festival. Whenever there was any suspicion of danger to the Meitei king, the King would send a pig and a cock to be sacrificed to God Panam Ningthou of Andro. The Chakpa Haraoba (one of the 4 types of Lai Haraoba festival) is annually celebrated in honor of God Panam Ningthou. The festive occasion falls in the Meitei lunar month of Lamta (March-April interface month). The festival starts from the first Sunday of the Lamta month. During the 9 day long festival, no outsiders of Andro are allowed to stay at the village. In modern times, notice is issued one month before the festival begins through mass media like television, newspaper and radio. The notice informs outsiders to leave the place as it is about to begin the festival. Natives of Andro may come to Andro before the festival starts. Once the festival begins, no one is allowed to either leave from or come to the village. People who have converted into another religion are not allowed to participate in the religious festival even if they are native of Andro. There are some Christian converts and Hindu converts in Andro. During the festival, people of Andro village wear black clothes as a custom. Besides Panam Ningthou, there are twelve other deities worshipped in Andro. During the Lai Haraoba festivals of these deities, outsiders of Andro can witness the event. The festivals in their honor are done separately from that of Panam Ningthou. But the festival of Pureiromba can be done together with that of Panam Ningthou. At this too, outsiders can witness the event but the place of worship is different from the exclusive one of Panam Ningthou. During the Haraoba of Panam Ningthou, there is no shortage of meat and wine. Boys and girls play important role in the festival. == Temple == The Temple of Panam Ningthou is in Andro, Manipur. It is also the Loishang (English: Office) to the representatives of the panas (English: State Divisions). Sacred items are kept inside the temple. One house each for two Panas was constructed near the Loishang. Two dormitories for boys and girls are also built. The sanctum of God Lainingthou Panam Ningthou and Goddess Leimaren Sanarik Chaning Khombi are located in the right side corner and the left side corner respectively as one enters the room. == Association with other gods == According to the Thalon text, Panam Ningthou was one of the 5 gods of 5 different places of the Selloi Langmai Hill. The cults of these five gods were integrated into that of a single God with the name \"Langmai Ningthou\" (lit. King of the Langmais). The personal names became the aliases or various forms of the God. With this, the tribal society of the Selloi Langmai people evolved into a chiefdom. This chiefdom later rose to the Angom clan. == Namesake == === Panam Ningthou Semba === There is a real servant class named Panam Ningthou Semba. It takes care of the articles (things) related to polo () for the Meitei royalty. There are seven grades of officers in this group. The grades are (1) Sellungba Ahal, (2) Sellungba Naha, (3) Pakhan-lakpa, (4) Naharakpa, (5) Yaphi Ahal, (6) Yaphi Naha and (7) Sennakhal. == Gallery == ANDRO INSCRIBED STONE.jpg|Meitei Stone inscription inside the Panam Ningthou Sacred Site about a royal decree A SACRED GROVE IN THE PANAM NINGTHOU SACRED SITE.jpg|A Sacred Grove in the Panam Ningthou Sacred Site Panam Ningthou Temple.jpg|A temple (rebuilt) inside the Panam Ningthou Sacred Site Two official buildings in the Panam Ningthou sacred site.jpg|Two official buildings (rebuilt) in the Panam Ningthou Sacred Site A MUSEUM IN PANAM NINGTHOU SACRED SITE.jpg|A Mini Museum in the Panam Ningthou Sacred Site == References == == Other websites == * INTERNET ARCHIVE, Panam Ningthou * E-PAO, Panam Ningthou * * * * Category:Kings in Meitei mythology Category:Meitei gods and goddesses Category:Gods and goddesses of agriculture",
 "title": "Panam Ningthou"
}