{
 "id": "821459",
 "text": "2017 FIFA U-17 World Cup was held in India from 6 to 28 October. ==Qualified teams== As host, India made their first ever appearance at the FIFA U-17 World Cup and their first appearance in the World Cup at any age level. As well as India, New Caledonia and Niger also made their first appearance in the FIFA U-17 World Cup. The previous U-17 World Cup title holders, Nigeria, failed to qualify for this edition. In failing to qualify, Nigeria became the first nation since Switzerland in 2009 to fail to qualify for the next edition of the FIFA U-17 World Cup after winning the previous edition. A total of 24 teams qualified for the final tournament. In addition to India, the other 23 teams qualified from six separate continental competitions. Starting from 2017, the Oceania Football Confederation (OFC) will receive an additional spot (in total two spots), while UEFA will have five instead of six spots. Confederation Qualifying Tournament Qualifier(s) AFC (Asia) Host Nation AFC (Asia) 2016 AFC U-16 Championship CAF (Africa) 2017 Africa U-17 Cup of Nations CONCACAF (Central, North America and Caribbean) 2017 CONCACAF U-17 Championship CONMEBOL (South America) 2017 South American Under-17 Championship OFC (Oceania) 2017 OFC U-17 Championship UEFA (Europe) 2017 UEFA European Under-17 Championship :1.Teams that will make their debut. ==Venues== After being awarded the hosting rights for the FIFA U-17 World Cup, eight locations were shortlisted: Bangalore, Guwahati, Kochi, Kolkata, Margao, Navi Mumbai, New Delhi and Pune. On 29 May 2015, Kochi, Mumbai, Kolkata, and Guwahati were provisionally selected as host locations and was informed two more would be provisionally approved from the list of Bengaluru, Chennai, Goa, New Delhi and Pune. On 27 October 2016, FIFA officially announced Guwahati, Kochi, Kolkata, Margao, Navi Mumbai and New Delhi as the official host cities for the FIFA U-17 World Cup. Kolkata Kochi New Delhi Salt Lake Stadium (Vivekananda Yuba Bharati Krirangan) Jawaharlal Nehru Stadium (Jawaharlal Nehru International Stadium) Jawaharlal Nehru Stadium Capacity: 66,600 Capacity: 41,700 Capacity: 58,000 Navi Mumbai Guwahati Margao DY Patil Stadium (Dr. DY Patil Stadium) Indira Gandhi Athletic Stadium Fatorda Stadium (Pandit Jawaharlal Nehru Stadium) Capacity: 41,000 Capacity: 23,800 Capacity: 16,200 ==Results== RSSSF ===Group stage=== ====Group A==== Team Pld W D L GF GA GD Pts align=left 3 2 0 1 5 1 +4 6 align=left 3 2 0 1 5 3 +2 6 align=left 3 2 0 1 5 3 +2 6 align=left 3 0 0 3 1 9 -8 0 ====Group B==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 10 5 +5 9 align=left 3 2 0 1 8 4 +4 6 align=left 3 0 1 2 4 8 -4 1 align=left 3 0 1 2 2 7 -5 1 ====Group C==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 10 1 +9 9 align=left 3 2 0 1 5 6 -1 6 align=left 3 0 1 2 4 8 -4 1 align=left 3 0 1 2 3 7 -4 1 ====Group D==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 6 1 +5 9 align=left 3 2 0 1 7 2 +5 6 align=left 3 1 0 2 1 6 -5 3 align=left 3 0 0 3 0 5 -5 0 ====Group E==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 14 3 +11 9 align=left 3 1 1 1 8 4 +4 4 align=left 3 1 0 2 7 11 -4 3 align=left 3 0 1 2 2 13 -11 1 ====Group F==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 11 2 +9 9 align=left 3 1 1 1 4 5 -1 4 align=left 3 0 2 1 3 4 -1 2 align=left 3 0 1 2 0 7 -7 1 ===Knockout stage=== {{Round16 |||0||4 |||3||0 |||0||5 |||0(5)||0(3) |||5||1 |||2||0 |||1||2 |||2||1 |||1||2 |||1||4 |||2||1 |||3||1 |||1||3 |||1||3 |||5||2 |||2||0 |widescore=yes}} ==References== Category:FIFA U-17 World Cup Category:2017 in association football Category:2010s in Indian sport Category:2017 in India Category:Football in India Category:October 2017 events",
 "title": "2017 FIFA U-17 World Cup"
}