{
 "id": "82146",
 "text": "Nanyang Technological University (NTU) is one of the two largest public universities in Singapore.The other one is the National University of Singapore. It is a fast-rising, research-intensive university with the biggest campus in Singapore and one of the world’s largest engineering colleges. Its 200-hectare Yunnan Garden campus was the Youth Olympic Village for the first Youth Olympics in 2010. ==Campuses== NTU’s main Yunnan Garden campus is in the western part of Singapore. It has world-class resources for teaching and research. It also has 25 halls of residence housing more than 13,500 undergraduates and graduate students, faculty housing consisting of six housing clusters located within the residential zone on campus (Nanyang Grove, Nanyang Heights, Nanyang Meadows, Nanyang Terrace, Nanyang View and Tan Lark Sye Walk), as well as Olympic-training-standard sporting facilities. Under NTU's Campus Master Plan, new learning, living, research, and recreational spaces have been created to foster multidisciplinary pursuits and a collegiate culture. Two large learning hubs, The Hive and The Arc, centrepieces of flipped classroom learning at NTU, and a lifestyle hub, the North Spine Plaza, are part of this transformed landscape. The newest academic complex on campus, Gaia, is the home of the Nanyang Business School and one of Asia’s largest wooden buildings. Yunnan Garden, a 9-hectare precinct for leisure, education and heritage, offers a sprawling open space of greenery and waterscapes with fitness facilities. Apart from its main campus, NTU also has a medical campus in Novena, Singapore’s healthcare district. ==Colleges, schools and institutes== NTU has 37,458 students across the Colleges of Engineering, Business, Science, Medicine, Computing and Data Science, Humanities, Arts and Social Sciences, the Graduate College, the Interdisciplinary Graduate School, the NTU Entrepreneurship Academy, the S Rajaratnam School of International Studies and the National Institute of Education. It also has many renowned researchers among its professors. In 2013, NTU accepted its first batch of medical undergraduates at the Lee Kong Chian School of Medicine, a collaboration with Imperial College London.Lee Foundation makes $150 million gift to NTU's new medical school News release, 4 January 2011Partridge, M. R. (2013). Redefining medicine, transforming healthcare: the Lee Kong Chian school of medicine. Ann Acad Med Singapore, 42, 165-167. College of Engineering * School of Chemistry, Chemical Engineering and Biotechnology (CCEB) * School of Civil and Environmental Engineering (CEE) * School of Electrical and Electronic Engineering (EEE) * School of Materials Science and Engineering (MSE) * School of Mechanical and Aerospace Engineering (MAE) College of Science * School of Biological Sciences (SBS) * School of Physical and Mathematical Sciences (SPMS) * Asian School of the Environment (ASE) College of Business * Nanyang Business School (NBS) College of Humanities, Arts, & Social Sciences * School of Art, Design and Media (ADM) * School of Humanities (SoH) * School of Social Sciences (SSS) * Wee Kim Wee School of Communication and Information (WKWSCI) College of Medicine * Lee Kong Chian School of Medicine (LKCMedicine) College of Computing and Data Science (CCDS) * College of Computing and Data Science (CCDS) Autonomous entities * National Institute of Education (NIE) * S Rajaratnam School of International Studies (RSIS) Institutes and centres NTU has more than 70 institutes and centres. Among them are: * Confucius Institute * Earth Observatory of Singapore (EOS) * Energy Research Institute @ NTU (ERI@N) * Institute of Advanced Studies (IAS) * Nanyang Environment and Water Research Institute (NEWRI) * NTU Entrepreneurship Academy (NTUpreneur) * Singapore Centre on Environmental Life Sciences Engineering (SCELSE) ==Partners== NTU has programmes with institutions from around the world. Key partners include Carnegie Mellon University, Columbia University, the Massachusetts Institute of Technology, Stanford University, University of California, Berkeley and the University of California, Los Angeles in the United States; leading Asian institutions such as Peking University, the Indian Institutes of Technology, Shanghai Jiao Tong University and Waseda University; and European institutions like University of Cambridge, ETH Zurich, Imperial College London, Karolinska Institutet and Technische Universität München. NTU is also a partner of choice for leading companies and government agencies. Its major industrial partners include Alibaba, Hewlett-Packard, Rolls Royce, Volvo, Delta Electronics and Singtel. ==Rankings== In the 21st QS World University Rankings 2025 published in June 2024, NTU was ranked 15th position in the world, up by 11 places from the previous year. In Times Higher Education World University Rankings 2025 published in September 2024, NTU’s overall rank had risen 2 places to 30th position in the world and 5th position in Asian order rank. In the 10th U.S. News Best Global Universities Rankings 2024-25 published in June 2024, NTU’s overall rank moved up 3 places to 27th position and maintained 3rd position within Asia.NTU's Facts & Figures - Our University Rankings NTU’s College of Engineering is one of the largest in the world, with its engineering research output ranked among the top twelve globally.NTU's College of Engineering In the 14th QS World University Rankings by subject published in April 2024, for broad subjects, NTU’s Engineering & Technology was ranked 15th position globally and 3rd in Asian order rank.NTU's Facts & Figures - Our University Rankings In the Financial Times Global MBA Ranking 2025 published in February 2025, NTU’s Nanyang Business School was ranked 22nd position, up by 10 places, top ranked in Singapore. In the QS full-time MBA ranking published in September 2024, Nanyang Business School’s MBA was ranked 36th position in the world and 3rd position in Asian order rank. In the QS’s Global Executive MBA (EMBA) ranking published in July 2024, Nanyang Business School EMBA was ranked 24th position and 2nd position in Asia-Pacific order rank. The S Rajaratnam School of International Studies, a graduate school of NTU, is ranked 4th in Asia and 19th in the world in the QS World University Rankings 2023. ==Alumni== Arts and media * Lim Jim Koon: Former Editor-in-Chief of Chinese Media, SPH Media * Joanne Peh: Actress, filmmaker and compere * Stefanie Sun: Singer and songwriter * Tan Swie Hian: Renowned local artist & sculptor; Cultural Medallion for Art 1987 * Pei Haozheng: Origami artist Science * Dr Hew Choy Sin: Leading authority on Orchid Physiology * Dr Liew Choong-Chin: Visionary for work on cardiovascular genetics * Dr Ong Beng Soon: Inventor and researcher in material science and technology ==References== == Other websites == * NTU website * University Leadership Category:1981 establishments in Singapore Category:Colleges and universities in Asia Category:Schools in Singapore",
 "title": "Nanyang Technological University"
}