{
 "id": "821533",
 "text": "The serial position effect is a psychological phenomenon. It say that people are more likely to remember the first and last items on a list. They are less likely to remember the middle items. The term was created in 1913 by Herman Ebbinghaus. He was a German psychologist who was interested in testing his ability to remember items on a list. This ability is called free-recall. Ebbinghaus performed free-recall experiments on himself. He used a list of 2000 syllables. THe experiments showed him that the where the it was on the list affected how well he could remember it. This information is shown in the \"serial position curve\". The serial position curve shows two things. The first thing it showed him was that the first 2-3 items on the list and up to the last 8 items in a list are always remembered better than items in the middle. This was true in any list with 20 or more items. It also showed him that the size of the list and the speed at which it was presented did not affect the outcome. == Free Recall == Free recall is a way of experimenting that is used in psychology. It is used to test memory. Free recall is the most common method of studying the serial position effect. to use free recall, a person is shown a list of items. These items are normally words. The person is then asked to say which items they can remember from the list in any order. One major problem with this method is that the tests are usually done in a controlled environment. This means the result may not be different from what happens in the real world. == Primacy effect == The primary effect is the term used to mean that people often remember the first thing they are told. Many psychologists think that this effect may be a result of rehearsal. When a person is trying to remember the items, that person will often repeat the items to themselves. As each item is added to the list, they repeat the entire list. This causes them to repeat the first it many time. This constant repeating helps them to better remember the items at the begining of the list,The slower the list is presented, the more time a person has to repeat the list. This causes a larger primacy effect. In the 1970s, psychologists began testing the effect of rehearsal on the primacy effect. In 1972, psychologist Phillip Marshal tested if removing rehearsal would have an affect on the primacy effect. He did this by having the people sort the words while he was giving them a list of 18 common nouns. The people in the test were not told that their memmory was being tested. Since they did not know this, they did not repeat the words as they heard them. The experiments showed Marshal that removing the repeating also removed most of the primacy effect. It showed that rehearsal was a main cause for the primacy effect. In 1971, Dewey Rundus created a what he called \"overt rehearsal\" The people were told to say their thoughts out loud, This tested test how and when participants rehearsed each item in a list. In 1977, Brodie and Murdock used overt rehearsal to give an alternate explanation for the primacy effect. They learned that even as people got towards the end of the list, they were still repeating the first terms. This caused the items to still be inthe person's short-term memory (STM) near the end of the list. This created what is called a recency effect. Brodie and Murdock said that rehearsal is a main cause of the primacy effect. They also believed that the primacy effect may be a type of recency effect. == Recency effect == The recency effect is the ability to remember items near the end of a list. Unlike the primacy effect, changes in speed and the size of the list do not affect the recency effect. Psychologists have learned that asking people to list the items in the ‘order they were presented’ causes less recency effect. In a 1966 study, Glanzer and Kunitz learned that increasing the time between when the list is presented and when recall is tested can affect the recency effect. With just an added 30 second delay, there was no longer a recency effect. In 1990, researchers tried to distract the people during the test. They would have the person do something that stopped short- term memory (rehearsal). For example, they would have the person countbackward from 3. The results showed that this also removed the recency effect. The recency effect is normally said to be caused by short-term memory. (STM) The STM of a person can store a small amount of information for a short time. The amount of information is normally two to four items. The last few items of a list being normally still in the STM of a person when the items are being recalled. This theory explains why the recency effect is generally larger than the primacy effect. It takes more effort to get the first items from long-term memory (LTM) than to get the items from STM. This is affected by the STM of the person being affected by a distraction. Newer research has shown that the recency effect can exist without STM. For instance, Bjork and Whitten showed that even when STM was distracted there can be a long-term recency effect. During their study, they had the people do something to affect their STM during the entire test. These test showed that there was still some recency effect . Some psychologists think that the recency effect is based on a theory of temporal context. Temporal context means \"the context of time\". Theories in this field are vague and still developing. The general idea is that context is connected to each item on the list. During recall, This contect will help the person remember the item. The later the item in the list, the more similar the context of the item is to context of the test. == Link to models of memory == Earlier research showed that the serial position effect was connected to single way that memory is stored such as LTM (primacy) and STM (recency). Research on people with brain damage that affected their LTM has showed a recency effect but not a primacy effect. This gives good evidence for this. On the other hand, the serial position effect is also supported by dual-store or multi-store models of memory. For instance, research on the serial position effect supports the multi-store model of memory by Atkinson and Shieffrin. Research about the long-term recency effect may show evidence for theories of the working memory model. == References == ==Other websites== *temporal context at scienedirect.com Category:Psychology",
 "title": "Serial-position effect"
}