{
 "id": "821536",
 "text": "2010 FIFA U-17 Women's World Cup was held in Trinidad and Tobago from 5 to 25 September. ==Qualified teams== *The qualifiers took place during late 2009 and early 2010. The places were allocated as follows to confederations: AFC (3), CAF (3), CONCACAF (2), CONMEBOL (3), OFC (1), UEFA (3), plus the host country. Confederation Qualifying Tournament Qualifier(s) AFC (Asia) 2009 AFC U-16 Women's Championship CAF (Africa) 2010 African U-17 Women's World Cup Qualifying Tournament CONCACAF (Central, North America and Caribbean) Host nation CONCACAF (Central, North America and Caribbean) 2010 CONCACAF Under-17 Women's Championship Canada Mexico CONMEBOL (South America) 2010 South American Under 17 Women Championship OFC (Oceania) 2010 OFC Women's Under 17 Qualifying Tournament New Zealand UEFA (Europe) 2010 UEFA Women's Under-17 Championship :1.Teams that made their debut. On 30 June 2010, President of Nigeria Goodluck Jonathan announced he would suspend the Nigeria Football Federation from FIFA competition for 2 years. This put the Flamingoes place at the competition in jeopardy. On 5 July 2010, the ban was lifted. ==Venues== During preparation four stadia were constructed in 2001. These four venues along with Hasely Crawford Stadium in Port of Spain, Trinidad are the venues for the women's competition. Port of Spain Arima/Malabar Couva Marabella Scarborough Hasely Crawford Stadium Larry Gomes Stadium Ato Boldon Stadium Manny Ramjohn Stadium Dwight Yorke Stadium Capacity: 27,000 Capacity: 10,000 Capacity: 10,000 Capacity: 10,000 Capacity: 7,500 ==Results== RSSSF ===Group stage=== ====Group A==== Team Pld W D L GF GA GD Pts 3 3 0 0 10 3 +7 9 3 2 0 1 6 3 +3 6 3 1 0 2 3 4 −1 3 3 0 0 3 1 10 −9 0 ====Group B==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 22 1 +21 9 align=left 3 2 0 1 7 5 +2 6 align=left 3 1 0 2 5 13 -8 3 align=left 3 0 0 3 2 17 -15 0 ====Group C==== Team Pld W D L GF GA GD Pts align=left 3 3 0 0 9 3 +6 9 align=left 3 2 0 1 13 4 +9 6 align=left 3 1 0 2 3 9 -6 3 align=left 3 0 0 3 2 11 -9 0 ====Group D==== Team Pld W D L GF GA GD Pts align=left 3 2 0 1 5 2 +3 6 align=left 3 2 0 1 4 2 +2 6 align=left 3 1 0 2 1 3 -2 3 align=left 3 1 0 2 1 4 -3 3 ===Knockout stage=== {{Round8-with third |16 September — Marabella||5||6 |17 September — Couva||2||1 |16 September — Marabella||0||1 |17 September — Arima||1||2 |21 September — Arima||2||1 |21 September — Couva||1||2 |25 September — Port of Spain||3 (5)||3 (4) |25 September — Port of Spain||1||0|''' |widescore=yes}} ==References== Category:FIFA U-17 Women's World Cup Category:2010 in association football Category:2010 in North America Category:Football in Trinidad and Tobago Category:September 2010 events Category:21st century in Trinidad and Tobago",
 "title": "2010 FIFA U-17 Women's World Cup"
}