{
 "id": "821583",
 "text": "Leimarel Sidabi () or Leimalel Sitapi () is a goddess in Meitei mythology and religion of Ancient Kangleipak (Antique Manipur). She is the highest female divinity in Meitei pantheon. She is the goddess of earth, nature and household. She is the mother of everyone in the universe. == Etymology == The Meitei word \"Leimarel\" (ꯂꯩꯃꯔꯦꯜ) or \"Leimaren\" (ꯂꯩꯃꯔꯦꯟ) is as \"queen\" or \"goddess\" in English. The word \"Leimarel\" (or \"Leimaren\") can be broken into pieces: \"Lei\" (ꯂꯩ), \"Ma\" (ꯃ) and \"-ren\" (-ꯔꯦꯟ) or \"-rel\" (-ꯔꯦꯜ). \"Lei\" means land or earth. \"Ma\" means mother. \"-ren\" (or \"-rel\") means excellent. Another Meitei word \"Sidabi\" can be broken into \"Si\" (ꯁꯤ), \"-da\" (ꯗ) and \"-bi\" (-ꯕꯤ). \"Si\" (\"See\") means \"to die\". \"-da\" denotes negative meaning. \"-bi\" (\"-bee\") denotes feminine gender. == Description == Leimarel is the eternal mother goddess. In ancient times, the ruling royal couples sat in the Laplen Ka (the central room). They faced the sacred spot of goddess Leimarel. It was believed that men and women originated from Leimarel's womb. A house symbolises the Mother in traditional Meitei cosmic beliefs. == Mythology == The supreme creator Atingkok (alias Salailel) asked his two sons, Sanamahi and Pakhangba to run in a race around the world. The winner would become the ruler of the world. Sanamahi was stronger than his younger brother, Pakhangba. He started his journey. Pakhangba wept to his mother, Leimarel Sidabi. She told him the secret behind the throne of the universe. The secret is that going around the throne of the Supreme Being is shorter than going around the universe. So, Pakhangba went around the Supreme Being, his father. Thus, he won the race and became the ruler of the universe. When Sanamahi returned home, he found his younger brother sitting on the throne. He got angry. He attacked Pakhangba. Pakhangba ran away. He hid himself among seven lairembis. The Supreme Being intervened the situation. He brought peace of Sanamahi. He made Sanamahi as the king of the household of the mankind. At the same time, goddess Leimarel Sidabi became another Imung Lai (household deity), besides Sanamahi. According to some legends, goddess Ima Leimaren (lit. Mother Leimarel) takes care of the market. She brings peace and harmony by doing so. This tradition is still maintained by womenfolk. The women are considered as the descendents of the \"Ima\". == Texts == Several ancient texts (PuYas) write things about the goddess Leimarel. Some include the Leimaren Naoyom, the Leimaren Langon, the Leimaren Mingkhei, the Leimaren Shekning Lasat, the Leimaren Ungoiron, besides others. == Worship == Leimarel Sidabi and her son Sanamahi are worshipped in the first room of every Meitei household. Goddess Leimarel doesn't want the Korou Anganba (sunlight) in the morning. So, houses of Loi castes are mainly made facing southwards. She lives in water also. So, she is worshipped in an Isaiphu (an earthen pitcher or terracotta pot containing water). There are no images kept to represent the two deities inside their abode. A senior woman or women of the house fills the earthen pot of the goddess with fresh water. She does this after taking a holy bath. Fresh flowers, fruits, vegetables and rice are offered. Prayers are also offered to protect the family members from every troubles. The maibas perform rites and rituals by chanting hymns dedicated to goddess Leimaren (ancestral mother goddess). It is generally done inside the house. Water, rice and flowers are mainly placed. == Festivals == Goddess Leimarel Sidabi and her son Sanamahi are mainly worshipped in many religious occasions. Some are Cheiraoba and Saroi-Khangba. Cheiraoba is the Meitei new year (Manipuri new year) festival. Saroi-Khangba is a religious event to please the evil spirits. == In Arts == The Leimarel Sheisak is one of the 9 singing styles (tunes) of Meitei tradition (Manipuri culture). It is sung during the festival of Lai Haraoba. == Namesakes == === In commerce === Ima Keithel () is the world's only women run market. It has 3 major complexes. Leimarel Sidabi Ima Keithel is the Complex Number 1 of the market. It is followed by Imoinu Ima Keithel (Complex Number 2) and Phouoibi Ima Keithel (Complex Number 3). This 500 year old market is in the center of Imphal, Manipur. === In geography === The Leimarel Hill is a hill in Manipur. Trekkers go here for panaromic viewing of 360 degree of Loktak Lake. == Related pages == * Incarnations of Leimarel Sidabi == References == == Bibliography == * Ariba Meiteigee Seitha by Gourachandra, Mayanglambam * Kangleikhol January 1988 by Kangjia, Ng * Leimarel Mingkhei by Bhogeshawr, Oinam * Yimpallon by Singh, Wakhemcha Tomba == Other websites == * Internet Archive, Leimarel * E-pao, Leimarel Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of fertility",
 "title": "Leimarel Sidabi"
}