{
 "id": "821684",
 "text": "The peak-end rule is a psychological term proposed by Barbara Fredrickson and Daniel Kahneman. It suggests the following: When evaluating an experience, people do not recall details in every moment they experienced. People mainly recall what happened and how they felt at the peak and the end of the event. The peak is the time when they had the strongest emotion. Our feelings at the peak and the end of the event decide what people generally feel about an experience. The feelings at the peak and the end take up similar weights, which means the memory of the experience is the average of the two. The peak- end rule is a form of duration neglect. When evaluating past experiences, people concentrate on the peak and the end while other parts of the experience are neglected. How long they have had the experience, is neglected. According to peak-end rule, humans use false memories to form preferences and make decisions. Thus, decisions are very unlikely to lead to the best outcome they want. By contrast, the standard economics rational choice theory suggests that humans can always choose something that serves them the best, producing the largest net pleasantness. The establishment of the theory is evidence against the rational choice theory. == First establishment and one scientific example == The peak–end rule was first established by Daniel Kahneman and others in 1993. In the experiment, participants were divided into two groups. They had to undergo an unpleasant experience. Everything else was the same, except for one group who had to go through an extra, less unpleasant experience at the end. Let us call this group Group B and previous group Group A. The researchers concluded that the most unpleasant, the peak, and the final intensity of unpleasantness, the end were used to evaluate the procedure. In this case, the end of Group B is less unpleasant. At the same time, the peak of both Group A and Group B were the same. Thus, the sum of the unpleasantness of the peak and the end was less for Group B. As a result, participants from Group B found the experience less unpleasant, although for both the duration of and the sum of unpleasantness, Group A < Group B. == Explanations == === Why only the peak and the end? === The peak-end rule is a type of representative heuristic. The peak and the end simplify and represent the whole experience. It reduces people's cognitive load and helps people make quick decisions.From an evolutionary point of view, emotion related memories help us survive, keep us safe. For example, fear related memories help us recognize and better deal with dangerous situations. === The peak is memorable === When memory sticks, it lasts longer and can be recalled easier. Memories associated with strong emotions stick. Experiments were done to prove strong emotion-related things are recalled more often. An experiment done by Columbia University found a biological explanation for this. === The end is memorable === Why our memory prefers what happened at the end can be explained by the recency effect. Recency effect suggests that we consider recent events to be more important. What happens at the end of an experience is more recent to us. Thus, we consider the things that happen at the end of an experience to be more important. The end is more memorable than other parts. == Application == === How to leave a good impression === Adding a positive peak can establish a good memory of an experience even though there may be unimportant unpleasant moments in between. This technique has been applied to many fields, for example, the business field. When customers are leaving, salesmen help the customer hold the door. This act leaves a good final and overall impression. Another example is in the educational field. To make receiving negative feedback more acceptable, ending with the most pleasant part of the feedback will help. === Become regulars === People's memories of an experience influence their decision making. Adding a good end encourages people to experience the event a second time. Some medical procedures are too painful for the patients to repeat. Adding something positive at the end creates a more positive impression of the experience. After doing so, there is a smaller probability the patient is unwilling to receive the treatment a second time. Then, patients can more effectively recover with a less total cost and shorter time. === A negative end === Inversely, a negative end ruins the memory of an experience even though everything before was perfect.If a person wants themselves or other people to do something less, adding a negative end to the experience helps. === Reflect on our own experiences === People's memories of their experiences are not what they experienced. So, relying on our memories to make decisions does not lead to the highest net pleasure. To experience the net largest amount of pleasure, people should spend as much time as possible on things that they are unwilling to stop doing. == Restrictions and criticisms == Studies found that other factors influence the peak-end rule. Firstly, the expectation. A high expectation is compared with the actual experience at the start. If a difference exists, the starting experience will be the most important factor in overall experience evaluation. The peak-end rule is more likely to be applicable to lower expectation situations. Secondly, one study finds that the effect of peak-end law is small on one day experiences. Moreover, some people are easily affected by the rule but others are not. Thirdly, according to Ariely and Carmon, how we feel at the moment of evaluation also affects the outcome. ==References== Category:Psychology",
 "title": "Peak-end rule"
}