{
 "id": "82168",
 "text": "Rupert Alexander Lloyd Grint (; born 24 August 1988) is an English actor. He is best known for his role as Ron Weasley, one of the three main characters in the Harry Potter series of movies. He was cast as Weasley at age eleven. Before that, Grint had acted only in school plays and his local theatre group. From 2001 to 2011, he starred in all eight Harry Potter movies. Grint started to work outside of the Harry Potter franchise in 2002. He had a main role in Thunderpants. In 2006, he was in Driving Lessons, a dramedy movie. He was also in Cherrybomb in 2010. Grint was in the comedy Wild Target with Bill Nighy and Emily Blunt. His first movie project after the Harry Potter series was in the 2012 anti-war movie Into the White. In 2013, his movie CBGB was released. That same year, he was cast in CBS's program Super Clyde. His first work on stage was in Mojo in October 2013. It was at the Harold Pinter Theatre in London. In 2014, he was the voice of the character of Josh in Postman Pat: The Movie. From 2017 to 2018, he executive-produced and starred in the programme Snatch, It was based on the movie of the same name. Since 2019, he has been in the Apple TV+ horror series Servant. Grint supports several charitable causes. Since 2011, he has been in a relationship with actress Georgia Groome. They have a daughter, Wednesday (born May 2020). ==Filmography== ===Movies=== Year Title Role Director(s) 2001 Harry Potter and the Philosopher's Stone Ron Weasley Chris Columbus 2002 Harry Potter and the Chamber of Secrets Ron Weasley Chris Columbus 2002 Thunderpants Alan A. Allen Peter Hewitt 2004 Harry Potter and the Prisoner of Azkaban Ron Weasley Alfonso Cuarón 2005 Harry Potter and the Goblet of Fire Ron Weasley Mike Newell 2006 Driving Lessons Ben Marshall Jeremy Brock 2007 Harry Potter and the Order of the Phoenix Ron Weasley David Yates 2009 Harry Potter and the Half-Blood Prince Ron Weasley David Yates 2010 Cherrybomb Malachy McKinney Glenn Leyburn & Lisa Barros D'Sa 2010 Wild Target Tony Jonathan Lynn 2010 Harry Potter and the Deathly Hallows – Part 1 Ron Weasley David Yates 2011 Harry Potter and the Deathly Hallows – Part 2 Ron Weasley David Yates 2012 Cross of Honour Gunner Robert Smith Petter Næss 2013 The Necessary Death of Charlie Countryman Karl Fredrik Bond 2013 CBGB Cheetah Chrome Randall Miller 2013 The Unbeatables Amadeo (voice) Juan José Campanella 2014 Postman Pat: The Movie Josh (voice) Mike Disa 2015 Moonwalkers Jonny Antoine Bardou-Jacquet ===Television=== Year Title Role Notes 2005 Happy Birthday Peter Pan Peter Pan (voice) TV documentary special 2010 Come Fly with Me Himself Episode 3 2012 American Dad! Liam (voice) Episode: \"Killer Vacation\" 2016 Tracey Ullman's Show Himself 1 episode 2017–2018 Sick Note Daniel Glass Main role 2017–2018 Snatch Charlie Cavendish Main role, also executive producer 2017 Urban Myths August \"Gustl\" Kubizek Episode: \"Adolf the Artist\" 2018 The ABC Murders Inspector Crome Miniseries 2019–2023 Servant Julian Pearce Main role 2022 Harry Potter 20th Anniversary: Return to Hogwarts Himself Reunion special 2022 Guillermo del Toro's Cabinet of Curiosities TBA Anthology series ===Video games=== Year Title Role Notes 2007 Harry Potter and the Order of the Phoenix Ron Weasley (voice) 2009 Harry Potter and the Half-Blood Prince Ron Weasley (voice) 2010 Harry Potter and the Deathly Hallows – Part I Ron Weasley (voice) 2011 Harry Potter and the Deathly Hallows – Part II Ron Weasley (voice) ===Stage=== Year Title Role Notes 2013 Mojo Sweets Stage production at the Harold Pinter Theatre, London 2014 It's Only a Play Frank Finger Stage production at the Gerald Schoenfeld Theatre, Broadway ===Music=== Year Title Format Notes 2011 \"Lego House\" Music Video Song by English singer-songwriter Ed Sheeran 2012 \"Over the Rainbow\" Song Into the White Soundtrack 2014 \"Struck by Lightning\" Song Postman Pat: The Movie Soundtrack 2021 \"The Sky Cries\" Music Video Song by Saleka ===Other roles=== Year Title Role Notes 2003 Baggy Trousers Molesworth Series, BBC Radio 4 2012 We Are Aliens Narrator The National Space Centre's Show ==Related pages== * Daniel Radcliffe * Emma Watson * Tom Felton ==References== ==Other websites== * Category:1988 births Category:Living people Category:Actors from Essex Category:British child actors Category:English movie actors Category:English television actors Category:English voice actors",
 "title": "Rupert Grint"
}