{
 "id": "821630",
 "text": "Nongthang Leima () is the goddess of seduction, thunder and lightning in Meitei mythology and religion.Moirangthem Kirti (1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0. She was created by Atingkok (or Salailen) to attract Haraba (Pakhangba). She mastered thunder and lightning in the chaos in the early world. She predicted the first rain. She limits the chaos and helps creation. == Etymology == The female first name \"Nongthang Leima\" (ꯅꯣꯡꯊꯥꯡ ꯂꯩꯃ) is made up of two Meitei language words, \"Nongthang\" (ꯅꯣꯡꯊꯥꯡ, /noŋ.tʰáŋ/) and \"Leima\" (ꯂꯩꯃ, /lə́i.ma/). In Meitei language (Manipuri language), \"Nongthang\" (ꯅꯣꯡꯊꯥꯡ, /noŋ.tʰáŋ/) means lightning. The word \"Nongthang\" (ꯅꯣꯡꯊꯥꯡ, /noŋ.tʰáŋ/) itself is also made up of two words, \"Nong\" (ꯅꯣꯡ, /noŋ/) and \"Thāng\" (ꯊꯥꯡ, /tʰáŋ/). \"Nong\" (ꯅꯣꯡ, /noŋ/) means rain and \"Thāng\" (ꯊꯥꯡ, /tʰáŋ/) means sword. In Meitei language (Manipuri language), \"Leima\" (ꯂꯩꯃ, /lə́i.ma/) means queen. The word \"Leima\" (ꯂꯩꯃ, /lə́i.ma/) itself is made up of two words \"Lei\" (ꯂꯩ, /lə́i/) and \"Ma\" (ꯃ, /ma/). \"Lei\" (ꯂꯩ, /lə́i/) means land and \"Ma\" (ꯃ, /ma/) means mother. == Description == Nongthang Leima is a pre-historical maibi. She is the first goddess maibi to compose a dance form. Later, her dance form was reposessed by other goddesses. == Mythology == === Birth === Sanamahi (Ashiba) was creating the earth. But he was frequently disturbed by his younger brother, Pakhangba (Haraba). Unable to do any work, Sanamahi complained about the matter to their father, Salailen (or Atingkok according to different versions of stories). Salailen produced a divine feminine being. He released her into the great space (void) of the universe (cosmos). In the vast emptiness of the great space (void), the divine feminine being became a beautiful and radiant goddess. She was named \"Nongthang Leima\", the Queen of Lightning. In another version of the story, Sidaba ordered Sidabi to produce \"Nongthang Leima\", the divine female being to lure the destroyer from the cosmic creation. === Seduction (Attraction) === Nongthang Leima, the Queen of Lightning, filled the empty space (void) with bright light. Seeing her, Pakhangba (Haraba) fell in love with her. He forgot about bothering his elder brother in the creation of the earth. Haraba came to her in the great space. During that time, Sanamahi (Ashiba) completed his creation of the earth.Narayan, Shovana (2005). Indian Classical Dance. Shubhi Publications. p. 85. ISBN 978-81-8290-023-3. === Family === When Ashiba (Sanamahi) saw Nongthang Leima, he wanted to marry her.E. Ishwarjit (2005). Manipur, a Tourist Paradise. B.R. Publishing Corporation. p. 82. ISBN 978-81-7646-506-9. Thus, they united. So, Nongthang Leima was the wife of both Sanamahi (Ashiba) and Pakhangba (Haraba). Nongthang Leima is also known as Langmai Sana Chingjaroibi (). With the union of Chingjaroibi and Sanamahi, a son named Laisang Khekwaiba was born. === Two divine forms === According to \"Politics, society, and cosmology in India's North East\" written by N. Vijaylakshmi, the goddess Nongthang Leima (Nongthang Lairembi) took two divine forms after the completion of the creation of the earth. One form is Panthoibi. This form lives in the home of gods. Another form is \"Apanthoibi\". This form lives among the living beings.Pani, Jiwan (2000). Celebration of Life: Indian Folk Dances. Publications Division, Ministry of Information & Broadcasting, Government of India. p. 129. ISBN 978-81-230-0790-8. Basis Panthoibi Apanthoibi Existence of representations or manifestations in the universe Existence of particular forms Existence of forms as animate as well as inanimate objects Representations in all virtues and beauty Supreme creator (mother) of all the seven salais (clans) == Music == Among the nine forms of musical rhythms (Seisaks) of Pena (musical instrument), Nongthang Leima Seisak is one. All these rhythms are categorised into three movements, slow rhythm, medium rhythm and fast rhythm. Nongthang Leima song belongs to the fast rhythm. == Festival == During the Lai Haraoba festival, devotees dance to please various deities. Among them, male dancers act after the styles of Haraba (alias Pakhangba) and female dancers act after the styles of goddess Nongthang Leima. Goddess Nongthang Leima represents the lightning. == Identification with other deities == Goddess Nongthang Leima is often identified as Leimarel Sidabi. The former is considered as an incarnation of the latter.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha-vachana\" Tradition. Indira Gandhi National Centre for the Arts. p. 250. ISBN 978-81-246-0182-2. == Related pages == * Incarnations of Nongthang Leima * Incarnations of Leimarel Sidabi == References == == Other websites == * E-PAO, Nongthang Leima * INTERNET ARCHIVE, Nongthang Leima Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of beauty Category:Gods and goddesses of fertility Category:Gods and goddesses of love and lust Category:Gods and goddesses of the sky Category:Gods and goddesses of thunder",
 "title": "Nongthang Leima"
}