{
 "id": "82178",
 "text": "The Federal Ministry of Intra-German Relations () was a federal ministry of the Federal Republic of Germany. It was responsible for all relations with the East German government. This was because the West German government said there should be only one Germany. This meant they could not use the Ministry of Foreign Affairs, because they could not admit that East Germany was a foreign country. The ministry was created in 1949 as the Federal Ministry of All- German Affairs (). This ministry was also in charge of matters about the German lands east of the Oder-Neisse-Line which had become a part of Poland. The ministry was renamed in 1969 when Willy Brandt signed a treaty with Poland which said that Poland's western border was along the Oder and Neisse Rivers. This was part of Willy Brandt's ideas of Ostpolitik. At that time Poland was under a communist government. They could not allow West Germany to sign a treaty about East Germany's borders, which is why the treaty says \"the western border of Poland\" and not \"the border between Germany and Poland\". The ministry was abolished in 1991, about one year after German Reunification, after helping with the change to one country. All \"intra-German affairs\" are now jobs of the Ministry of the Interior. The Minister of the Interior is now also Commissioner for the New Bundesländer to show that there is still some work to make all of the states equal. ==Ministers== Minister Term start Term end Party Jakob Kaiser 1949 1957 CDU Ernst Lemmer 1957 1962 CDU Rainer Barzel 1962 1963 CDU Erich Mende 1963 1966 FDP Johann Baptist Gradl 1966 CDU Herbert Wehner 1966 1969 SPD Egon Franke 1969 1982 SPD Rainer Barzel 1982 1983 CDU Heinrich Windelen 1983 1987 CDU Dorothee Wilms 1987 1991 CDU == Publications == * BMgF (Hrsg.): SBZ von A-Z, Deutscher Bundes-Verlag, Bonn, 1. bis 10. Aufl., 1953 bis 1966, ca. 500 Seiten. * BMgF (Hrsg.): Sowjetische Auffassungen zur Deutschlandfrage 1945 – 1954. Dargestellt nach amtlichen Dokumenten, Deutscher Bundes-Verlag, Bonn, 1954. * BMgF (Hrsg.): Wer ist wer in der SBZ? Ein biographisches Handbuch, Verlag für Internationalen Kulturaustausch, Berlin, 1958. * BMgF (Hrsg.): Die Situation der Jugend im kommunistischen Herrschaftssystem der SBZ Deutschlands in Bonner Berichte aus Mittel- und Ostdeutschland, Bonn – Berlin, 1960. * BMgF (Hrsg.): Die Bemühungen der Bundesrepublik um Wiederherstellung der Einheit Deutschlands durch gesamtdeutsche Wahlen. Dokumente und Akten. I. Teil, Oktober 1949 – Oktober 1953, Deutscher Bundes-Verlag, Bonn, 1958. Intra-German Relations *",
 "title": "Ministry for Intra-German Relations"
}