{
 "id": "821728",
 "text": "Leimarel Sidabi () is the highest ranked mother goddess in Meitei mythology and religion (Sanamahism). She is known for having many incarnations as divine ladies.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha-vachana\" Tradition. Incarnations of goddess Leimarel. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. Each of her incarnations are for the welfare of the mankind. For this reason, she is known as Langon Yambi Ima (, lit. The Divine Mother who incarnates herself in many divine forms). Among her incarnations, the personalities of Emoinu, Panthoibi and Phouoibi depict as well as influence the boldness, courage, independence, goodness and social honour of Meitei women. The connection of the highest female form with the basic needs of life shows the importance of women in Meitei society. == Incarnations == === Imoinu === Imoinu or Emoinu () is an incarnation of Leimarel Sidabi. Supreme God Sidaba () asked His wife, Leimarel Sidabi () to create another Leimarel. Leimarel Sidabi is the first woman. The second Leimarel will be the second woman. She is to take care of the mankind on the planet earth. Goddess Leimarel Sidabi created the second Leimarel. The appearances of the first and the second Leimarels were similar. The first Leimarel named the second one as Emoinu Ahongbi. === Ireima === Ireima (, Ereima) alias Irai Leima (, Erai Leima) is an incarnation of Leimarel Sidabi. She is the goddess of water. === Lān Leima === Lān Leima (, Laan Leima) or Lāl Leima (, Laal Leima) is an incarnation of Leimarel Sidabi. Leimalel becomes Lān Leima when she is in the battlefield. Lān Leima is the goddess of war. === Leinaotabi === Leinaotabi () is an incarnation of Leimarel Sidabi.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha-vachana\" Tradition. Leimarel and Leinaotabi. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. She was the youngest wife of God Thongalel. Later, she was married to Poireiton. === Lul Leima === Lul Leima () (also pronounced as Lal Leima) is an incarnation of Leimarel Sidabi. She is the goddess of wealth. === Ngaleima === Ngaleima () alias Ngareima () is an incarnation of Leimarel Sidabi. Leimalel becomes Ngaleima when she is in the fish yard. Ngaleima is the goddess of fish. === Nongthang Leima === Nongthang Leima () is an incarnation of Leimarel Sidabi.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha- vachana\" Tradition. Leimarel and Nongthang Leima. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. She is the goddess of charm, thunder and lightning.Singh, Moirangthem Kirti (1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0. === Panthoibi === Panthoibi () is an incarnation of Leimarel Sidabi.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha- vachana\" Tradition. Leimarel and Panthoibi. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. She is the goddess of civilization, fertility, love, warfare and wisdom.Parratt, Saroj Nalini (1997). The Pleasing of the Gods: Meitei Lai Haraoba. Vikas Publishing House. ISBN 978-81-259-0416-8. === Phouleima === Phouleima () alias Phouoibi () is an incarnation of Leimarel Sidabi.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha-vachana\" Tradition. Leimarel and Phouleima. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. Leimalel becomes Phouoibi when she is in the granaries or the barns. Phouoibi is the goddess of agricultural crops and harvest.Session, North East India History Association (1999). Proceedings of North East India History Association. The Association. === Shil Leima === Shil Leima () alias Shin Leima () is an incarnation of Leimarel Sidabi. Leimalel becomes Shil Leima when she is in factories. Shil Leima is the goddess of crafts. === Thoibi === Moirang Thoibi () is an incarnation of Leimarel Sidabi.Kaushal, Molly; Arts, Indira Gandhi National Centre for the (2001). Chanted Narratives: The Living \"katha-vachana\" Tradition. Leimarel and Thoibi. Indira Gandhi National Centre for the Arts. ISBN 978-81-246-0182-2. She is a princess of Ancient Moirang kingdom. She is also one of the important characters in the Moirang Shayon and the Moirang Kangleirol. === Thumleima === Thumleima () is an incarnation of Leimarel Sidabi. Leimalel becomes Thumleima when she is in the salt mines. Thumleima is the goddess of salt. === 7 Divine Ladies === Leimalel also incarnates herself as the seven divine ladies. The seven divine ladies are Heepokpi (), Yaipokpi (), Heeleima (), Yaileima (), Heekubi (), Yaikubi () and Yaisna (). === Goddesses of the 7 clans === The seven goddesses of the seven clans () are the incarnations of Leimarel Sidabi. Goddesses Latin transliterations (Romanization) Associated clans/dynasties Latin transliterations (Romanization) ꯂꯩꯀꯛꯕꯤꯌꯥꯔꯦꯜ Leikakbiyarel ꯅꯤꯡꯊꯧꯖꯥ Ningthouja ꯂꯥꯢꯕꯤ ꯑꯍꯨꯝꯅꯨ Laibi Ahumnoo ꯑꯉꯣꯝ Angom ꯊꯥꯡꯋꯣꯢꯕꯤ Thangwoibee ꯂꯨꯋꯥꯡ Luwang ꯃꯥꯟꯋꯣꯢꯕꯤ Manwoibi ꯈꯨꯃꯟ Khuman ꯆꯤꯠꯅꯨ ꯂꯩꯃ Chitnu Leima ꯃꯣꯢꯔꯥꯡ Moirang ꯊꯦꯔꯩ ꯂꯥꯡꯕꯝ ꯆꯅꯨ Therei Langbam Chanu ꯆꯦꯡꯂꯩ/ꯁꯂꯥꯡ-ꯂꯩꯁꯥꯡꯊꯦꯝ Chenglei/Salang- Leishangthem ꯂꯥꯢ ꯂꯩꯃꯔꯦꯟ Lai Leimaren ꯈꯥꯕ-ꯉꯥꯟꯕ Khaba-Nganba == Festivals and Worship == === Imoinu Iratpa === Imoinu Iratpa (Emoinu Eratpa) is celebrated in honor of goddess Imoinu (Emoinu) on the 12th of Meitei lunar month of Wakching (December-January interface month) every year. Fruits, vegetables and fish are offered to goddess Imoinu. === Panthoibi Iratpa === Panthoibi Iratpa (Panthoibi Eratpa) is celebrated in honor of goddess Panthoibi every year. === Phouoibi Irat Thouni === Phouoibi Irat Thouni or Phouoibi Iratpa or just Phouoibi worship is done during the Meitei lunar month of Wakching (December- January interface month). == Ima Keithel == Ima Keithel () is the world's only women run market. The Leimarel Sidabi Ima Keithel (Complex Number 1), the Imoinu Ima Keithel (Complex Number 2) and the Phouoibi Ima Keithel (Complex Number 3) are the three main building complexes of the Ima Keithel. This 500 years old market is in the center of Imphal, Manipur. The three building complexes are named in honor of the three goddesses, Leimarel Sidabi, Imoinu and Phouoibi. The later two are the incarnations of the first. == In popular culture == In popular culture, the incarnations of goddess Leimarel are shown in arts, books, movies, web series and many others. Here are a few: * Phou- oibi, the rice goddess is a 2009 ballad opera. It was performed by the Laihui Ensemble. It is based on the story of Phouoibi and her sister goddesses. * Phouoibi Shayon is a 2017 Meitei mythological movie. It is based on the story of Phouoibi and her sister goddesses. == References == == Bibliography == * Ariba Meiteigee Seitha by Gourachandra, Mayanglambam * Emoinu Ahongbi Tungnapham by Budhichandra, Yumnamcha * Holy Man by Dhiren Meitei,a.k * Kangleikhol January 1988 by Kangjia, Ng * Laiyingthou Lairemmasinggee Waree Seengbul by Neelabi, Sairem * Leeklam by Apunba Shintha Lup * Leimarel Mingkhei by Bhogeshawr, Oinam * Yimpallon by Singh, Wakhemcha Tomba Category:Meitei gods and goddesses",
 "title": "Incarnations of Leimarel Sidabi"
}