{
 "id": "82176",
 "text": "Louis IX (25 April 1214 – 25 August 1270) also called Saint Louis, was King of France from 1226 to his death. He established the Parlement of Paris. After his death he was canonised (declared a saint) in 1297 by Pope Boniface VIII. He became a patron saint of barbers, France, groomers, button makers, sculptors. == Sources == Jean de Joinville was a close friend of Louis and wrote a famous biography of the king from which comes most information about him. Two other important biographies were written by the king's confessor, Geoffrey of Beaulieu, and his chaplain, William of Chartres. Several other people wrote biographies about the king, but only those three had reliable information. == Early life == Louis was born at Poissy, near Paris. He was the son of Louis VIII of France and Blanche of Castile. Louis was eleven years old when his father died, on November 8, 1226. He was crowned king the same year in the cathedral at Reims. Because Louis was so young, his mother ruled France as regent while he was a child. His younger brother Charles I of Sicily (1227–1285) was made Count of Anjou. On May 27, 1234 Louis married Marguerite of Provence (1221 – December 21, 1295), whose sister Eleanor was the wife of Henry III of England. == Crusading == At the age of 15 in 1229, Louis brought an end to the Albigensian Crusade by signing an agreement with Count Raymond VII of Toulouse. He went on crusade twice, in his mid-thirties in 1248 and then again in his mid-fifties in 1270. In 1250, after initial success in his first crusade, Louis's army of 15,000 men was met by overwhelming resistance from the Egypt's army and people. Louis and his army were captured there by the Muslims. Later that year, they were released but had to give back the land that he had taken over.Goliber, Sue Helder. \"Louis IX.\" World Book Advanced. World Book, 2013. Web. 27 Feb. 2013. Louis then spent four years in the crusader Kingdoms of Acre, Caesarea and Jaffe. Both crusades were complete disasters; His kindness towards the poor was much celebrated. === Alliances === In 1252, Louis attempted an alliance with the Egyptians for the return of Jerusalem if the French assisted with the subduing of Damascus. In 1253, Louis tried to seek allies from the Ismailian Assassins and the Mongols.Runciman, pp. 279–280 == Religion == Louis was Catholic, and he built the Sainte Chapelle (\"Holy Chapel\") on Île de la Cité, in the centre of Paris. It is thought that the French monarchy was trying to establish the Kingdom of France as the \"new Jerusalem\". Louis IX tried to make France, which was seen as being a very religious place, a protector of the Catholic Church. It worked, and between the 12th and the 13th centuries, France and the Pope were very close. == Children == # Blanche (1240 – April 29, 1243) # Isabelle (March 2, 1241 – January 28, 1271), married Theobald V of Champagne # Louis (February 25, 1244 – January 1260) # Philippe III (May 1, 1245 – October 5, 1285) # Jean (born and died in 1248) # Jean Tristan (1250 – August 3, 1270), married Yolande of Burgundy # Pierre (1251–1284), Count of Perche and Alençon; Count of Blois and Chartres in right of his wife, Joanne of Châtillon # Blanche (1253–1323), married Ferdinand de la Cerda, Infante of Castille # Maria (1253-1281), Married Henry II, King Of Sodor # Marguerite (1254–1271), married John I, Duke of Brabant # Robert, Count of Clermont (1256 – February 7, 1317). He was the ancestor of King Henry IV of France. # Agnes of France (ca 1260 – December 19, 1327), married Robert II, Duke of Burgundy == Death == During his second crusade, Louis died at Tunis on August 25, 1270, and his son, Philip III, replaced him as king. He may have died either of bubonic plague or dysentery. His body was taken to the French royal necropolis at Saint-Denis, just north of Paris. His silver tomb effigy was destroyed in the 15th century. == Places named after Saint Louis == The cities of San Luis Potosí, Mexico; Saint Louis, Missouri; Saint-Louis du Sénégal, Senegal; Saint-Louis, Alsace; Lake Saint- Louis, in Quebec; and the Mission San Luis Rey de Francia, California, are named after him Many places in Brazil are called São Luís in Portuguese are named after Saint Louis. == References == == Other websites == * Etext full version of the Memoirs of the Lord of Joinville, a biography of Saint Louis written by one of his knights * Biography of Saint Louis on the Patron Saints Index Category:1214 births Category:1270 deaths Category:Christian saints Category:Kings of France",
 "title": "Louis IX of France"
}