{
 "id": "822147",
 "text": "Esther Ouwehand (born 10 June 1976) is a Dutch animal rights activist and politician of the Party for the Animals (Partij voor de Dieren - PvdD). == Politics == The Party of the Animals gained for the first time some (two) seats in the House of Representatives in the 2006 Dutch general election, which enabled Ouwehand and party leader Marianne Thieme to enter parliament. Since 30 November 2006, she has been a parliamentarian, with an interruption from November 2015 to October 2016 due to a burnout. Since 9 October 2019, she has been both parliamentary and party leader, as successor of Thieme (for a brief period she was already parliamentary leader, from October 2018 to January 2019). She leaded the PvdD into the 2021 Dutch general election in March 2021. == Background == Ouwehand studied policy, communication, and organisation at the Free University Amsterdam, but did not complete her studies. She started working as a marketeer for youth magazines at Sanoma Uitgevers. After the establishment of the Party for the Animals in 2002, she worked at the party office until 2006. Esther Ouwehand was born and grew up in the coastal town of Katwijk, a conservative Protestant environment, but considers herself nonreligious. She is married with no children, is a vegan and lives in the neighbouring city of Leiden. == Book == * 2021 - Dieren kunnen de pest krijgen. En dan? == References == * Biography on Parlement.com * Alles over Esther Ouwehand, voorvrouw van de Partij voor de Dieren, DeMediaGids.nl, 10 November 2020 == Other websites == * (English) Ouwehand on the Dutch House of Representatives website * Ouwehand on the Party for the Animals website * (English) Esther's blog, Party for the Animals Category:1976 births Category:Living people Category:Animal rights activists Category:Bloggers Category:Dutch activists Category:Leaders of political parties in the Netherlands Category:Members of the House of Representatives of the Netherlands Category:People from Katwijk Category:Politicians from South Holland Category:Vegetarians Category:Writers from South Holland",
 "title": "Esther Ouwehand"
}