{
 "id": "822139",
 "text": "The Nadeshiko League Cup (Japanese: なでしこリーグカップ) is a cup competition for women's football clubs in Japan. The competition began as the L.League Cup in 1996 and it was abolished after the 1999 edition. It reappeared on the occasion of the 2007 FIFA Women's World Cup, under the name Nadeshiko League Cup. ==Results== Season Winner Score Runners-up Semi-finals Semi-finals L.League Cup L.League Cup L.League Cup L.League Cup L.League Cup L.League Cup Yomiuri-Seiyu Beleza Prima Ham F.C. Kunoichi Suzuyo Shimizu F.C. Lovely Ladies Matsushita Denki Panasonic Bambina Prima Ham F.C. Kunoichi Yomiuri-Seiyu Beleza Matsushita Denki Panasonic Bambina Nikko Securities Dream Ladies Prima Ham F.C. Kunoichi Matsushita Denki Panasonic Bambina Yomiuri Beleza OKI F.C. Winds NTV Beleza Prima Ham F.C. Kunoichi OKI F.C. Winds Tasaki Perule F.C. Nadeshiko League Cup Nadeshiko League Cup Nadeshiko League Cup Nadeshiko League Cup Nadeshiko League Cup Nadeshiko League Cup NTV Beleza Urawa Red Diamonds Ladies INAC Leonessa TEPCO Mareeze NTV Beleza Urawa Red Diamonds Ladies INAC Kobe Leonessa TEPCO Mareeze NTV Beleza INAC Kobe Leonessa Iga F.C. Kunoichi Albirex Niigata Ladies INAC Kobe Leonessa Okayama Yunogo Belle NTV Beleza JEF United Ichihara Chiba Ladies rowspan=\"2\" NTV Beleza (Division 1) JEF United Chiba Ladies Urawa Red Diamonds Ladies Mynavi Vegalta Sendai Ladies AS Harima Albion (Division 2) Nippon Sport Science University Fields Yokohama Nojima Stella Kanagawa Sagamihara Cerezo Osaka Sakai Ladies rowspan=\"2\" JEF United Chiba Ladies (Division 1) Urawa Red Diamonds Ladies NTV Beleza INAC Kobe Leonessa Cerezo Osaka Sakai Ladies (Division 2) Nippon Sport Science University Fields Yokohama Sfida Setagaya FC Okayama Yunogo Belle rowspan=\"2\" NTV Beleza (Division 1) INAC Kobe Leonessa Urawa Red Diamonds Ladies Mynavi Vegalta Sendai Ladies Iga FC Kunoichi (Division 2) Sfida Setagaya FC Okayama Yunogo Belle Orca Kamogawa FC rowspan=\"2\" NTV Beleza (Division 1) INAC Kobe Leonessa Urawa Red Diamonds Ladies Nojima Stella Kanagawa Sagamihara Cerezo Osaka Sakai Ladies (Division 2) Chifure AS Elfen Saitama NHK Spring Yokohama FC Seagulls AS Harima Albion colspan=5 colspan=5 ==Other websites== Category:1996 establishments in Japan Category:1996 in association football Category:Football in Japan Category:Football competitions in Japan",
 "title": "Nadeshiko League Cup"
}