{
 "id": "822279",
 "text": "Mongba Hanba () or Mongpa Hanpa () is a forest god in Meitei mythology and religion. He is mainly worshipped in a sacred forest named Mongba Hanba Umang in the banks of the Imphal River in Manipur.Gupta, Dr Asha (2007). Biodiversity Conservation and Legal Aspects. Aavishkar Publishers, Distributors. p. 202. ISBN 978-81-7910-187-2. == History == On Saturday, the 16th day of the Meitei lunar month of \"Inga\" of 1651 Saka Year (1729 AD), a stone was brought from a marketplace in Langmaiching to Mongba Hanba's place. That stone was to make a statue of Hindu God Hanuman. Nine Umang Lais were brought and gathered at the Mongba Hanba's place. All these were buried in the place during the reign of King Garib Niwaj Pamheiba. So, the cult of God Mongba Hanba was replaced by that of Hindu god Hanuman during the reign of King Garib Niwaj Pamheiba. On 6th June 1979, an association was formed for saving Mongba Hanba Umang. It struggled for controlling the Laipham (English: Sacred place) for worshipping the traditional deity. There have been repeated attempts to revive the pantheon of the deity. However, there is still opposition from the religious body of the Mahabali Temple of Hindu God Hanuman. During May 2015, an organization named Mongba Hanba Umang Laipham Kanba Lup appealed not to stop them from constructing a place of worship for God Mongba Hanba. The organization claimed that it had not stopped devotees of God Mahabali (Hanuman) for the last 36 years. The organization expected the same thing from the Hindu bodies not to stop them from establishing a place of worship for God Mongba Hanba in the complex. == Worship == According to religious custom, Tampak Maiba was to worship God Mongba Hanba ().Session, North East India History Association (1982). Proceedings of the North East India History Association. The Association. p. 33. The atmosphere of blood sacrifice is said to be associated with the shrine of the deity. == References == == Other websites == * * Shimray, A. S. W. (2001). History of the Tangkhul Nagas. Akansha Publishing House. ISBN 978-81-87606-04-8. Category:Meitei gods and goddesses",
 "title": "Mongba Hanba"
}