{
 "id": "822697",
 "text": "Uchek Langmeidong () or Chekla Langmeidong () is a Meitei folktale of Ancient Kangleipak (Antique Manipur). It is the story of a girl named \"Hayainu\" (alias Nongdam Atombi) who turned herself into a Langmeidong (, hornbill bird) as she was unable to suffer with the ill treatments of her stepmother. == Etymology == In Meitei language (Manipuri language), \"Uchek\" (ꯎꯆꯦꯛ, /u.cek/) means \"bird\". Langmeiton (ꯂꯥꯡꯃꯩꯇꯣꯟ, /laŋ.məi.ton/)(or Langmeidong or Langmeitong) is the Meitei language word for any species of Buceros (Hornbill). Chekla (ꯆꯦꯛꯂꯥ, /cek.la/) is another Meitei language word for \"bird\". The term \"Chekla\" is not commonly used in everyday speech. == Story == Hayainu's mother had died when Hayainu was a young girl. Hayainu's father married again. So, Hayainu lived with her father, stepmother, and stepbrother (stepbrother is absent in some versions of the story). Her father loved her but her stepmother hated her. Hayainu’s father moved across the country to earn more money for his family. So, he left Hayainu under the care of his second wife (her stepmother). Just after her father had left her, her stepmother asked her to do all the household works. Hayainu had to collect herbs and had to catch fish daily. She had to sell them in the market. Hayainu served her stepmother faithfully but in return to her obedience, she was hated and would be beaten up by her cruel stepmother every day. Her stepmother’s ill treatment of her increased day by day. In some cases, her stepmother locked Hayainu up inside a room without giving any foods. One day, while Hayainu and her friends were washing their hairs with chenghi (traditional Meitei shampoo), her stepmother saw some cows grazing in their field. Her stepmother got angry thinking Hayainu got careless of the fields. So, Hayainu was badly beaten up. In another case, once Hayainu’s friends invited Hayainu to join a festival that was to be celebrated on the next day. At first, Hayainu was reluctant to join but later, she agreed. Her stepmother got to know about Hayainu's wish to celebrate the festival. On the early morning of the festival day, Hayainu’s stepmother had gone to her parental home with her son (Hayainu's stepbrother), taking away all the luxurious clothes and jewelry of Hayainu. When her stepmother and stepbrother had left the house, Hayainu later realised that trick. She had nothing to do but to weep. So, she did not go to the festival. With the increase of her stepmother’s cruelty, tears became Hayainu's companions in life. Once in Hayainu's dream, her real mother told her to go to the world of the Langmeidongs (Hornbills). In that dream, her mother suggested her to ask a flock of Langmeidongs coming near a lake every day to give her some of their feathers, collect and stitch them to her body and flew away. Hayainu woke up. She went to the spot and requested the birds for some of their feathers so that she could get a basketful of them. The birds fell pity on her and agreed. Once she got the feathers full of a basket, she wrapped some clothes around herself. Then, she sewed the feathers into the wrapped clothes. While she was doing that, her stepbrother saw her. Her stepbrother asked her not to leave him. She was explaining the reasons why she was doing so. Meanwhile, she completed her sewing. At that time, the same flock of hornbills were flying by. Hayainu called out to them requesting them to lift her up into the air. The birds picked her up and she flew away with them. Her stepbrother ran to his mother and narrated the whole story. Her stepmother was pleased with the news of Hayainu's departure. Some time passed, Hayainu’s father returned home. Seeing Hayainu absent, he asked his wife about his daughter. She did not reply but their son told him everything that had happened. Hayainu's father became angry and drove the stepmother out of the house. In another version of the story, Hayainu's father just beat his wife but did not drove her out of the house. Hayainu’s father was shocked by the news. He worried about his lovely daughter so much. So, he went out into the fields and called out to her to come back. Every day, he called her until one day he saw her coming with a flock of hornbills. Immediately, he took out a plate of rice and asked her to come and eat with him. Hayainu denied her father's offer telling him that she was then a part of the hornbill’s world (bird life) and she could not mingle up with the human beings again. Saying that, she flew away with her flock. == Edition == In 2010, the folktale of Uchek Langmeidong was produced in the form of a comic book, in Meitei (Manipuri) but in Latin script. It was authored by Subadani Ksh. In 2011, the folktale of Uchek Langmeidong was produced in the form of a comic book, with the name, Chekla Langmeitong. Interestingly, it came out to be the first comic book in Meetei script. == In popular culture == The folk story was reproduced into a play, \"Uchek Langmeidong (The Chorus of the Birds)\", by Ratan Thiyam, a legendary drama director of Manipur. With the production of the play, the Chorus Repertory received recognition from the critics, presented at the 1979 Shri Ram Centre National Drama Festival. In 2008, \"Uchek Langmeidong\", an animation feature film, was produced, based on the folktale. In 2016, the folk legend was once more recreated into its theatrical form, performed by the child actors. == Gallery == File:Hayainu collecting herbs.jpg File:Fishing in the lake.jpg File:Hayainu carrying the baskets of fishes and herbs.jpg File:Hayainu bathing with her friends.jpg File:Hayainu requesting to the hornbill birds.jpg File:Hayainu waiting for the feathers of the hornbill birds.jpg File:Hayainu receiving the feathers of the hornbill birds.jpg File:Hayainu collecting the feathers of the hornbill birds.jpg File:Hayainu as the Uchek Langmeidong ready to fly.jpg File:Hayainu as the Uchek Langmeidong.jpg == Related pages == * List of Meitei folktales * Bird women == References == == Other websites == * Category:Meitei folklore Category:Meitei literature",
 "title": "Uchek Langmeidong"
}