{
 "id": "822640",
 "text": "Pocket PC 2000 is a first released for Windows Mobile was support for HTC Vouge, LG and Vodafone can be released on April 19, 2000, it running on kernel Windows CE 3.0. Pocket PC 2002 can succesor for all operating system was another codenamed is Rapier founded on January 1999. ==Development history== In January 1999, Microsoft founded the codenamed Rapier for kernel type is Windows CE 3.0 running smillar for operating system Windows 95 and Windows 98, in February 1999, Microsoft starting history from beta version in codenamed Rapier, in March 11, 1999, Pocket PC 2000 build 200 is leaked on Internet officially, the news Pocket PC 2000 build 301 can be released on April 14, 1999, leaked on January 14, 2020 in BetaArchive. In May 15, 1999, Pocket PC 2000 build 302 can be released new version. In January 13, 2000, Microsoft ready launched Pocket PC 2000 RTM version, after ready released, Microsoft launch the Vodafone Mobile can running for Pocket PC 2000, at the Microsoft Build 2000 on 2000. In March 2000, Pocket PC 2000 Pre-RTM can be leaked on February 14, 2019 in BetaWiki website. Microsoft released Pocket PC 2000 until April 19, 2000, the officially features of the news Microsoft. Pocket PC 2000 can launched everything for features in Windows CE 3.0 on May 18, 2000, from the Security Update for Pocket PC 2000 can be released on June 11, 2000. ==Device and hardware== Pocket PC 2000 can launch for 11 device, is LG L674, and more, Pocket PC 2000 can launched on 245MB and 512MB, in 100MB can launch for Vodafone L67 in Windows CE 3.0, from the news features in Pocket PC 2000 can starting on January 2004, in LG L89, the old PC Computer using the sound ringtones in Pocket PC 2000. In May 2001, Microsoft launch the 9 device for Vodafone running Pocket PC 2000, is Vodafone L87, L89 and L98, In August 15, 2001, the Vodafone L87 is running for the Windows CE 3.0 officially. In 1999, Microsoft reach Vodafone L67 for sale beginning on USD in May 1999, after the codenamed is Rapier founded, launch for the beta version in Pocket PC 2000, in January 2000, the officially Vodafone L67 can be leaked support in Pocket PC 2000. ==Related pages== * Windows Mobile 2003 * Windows Mobile 6.5 Category:Microsoft operating systems",
 "title": "Pocket PC 2000"
}