{
 "id": "822936",
 "text": "Pelasgians (,singular: Pelasgós) was a name used by ancient Greek authors to describe the ancestors of Greek people. The name was also used to describe all the indigenous peoples of the Aegean Sea and their cultures. ==History== ===Herodotus=== The Pelasgians are mentioned many times in the Histories written by the Greek historian Herodotus. They are mentioned in the first volume of the Histories when Croesus wanted to learn who the strongest Greeks were to befriend them.Herodotus. Histories, 1.56. Herodotus called the Pelasgian language \"barbarian\" but thought of the Pelasgians to have been Greek. Herodotus also wrote about different places where Pelasgians, or Pelasgian-speakers, lived as neighbors of the Dorians and the Athenians.Herodotus. Histories, 1.57 (). Herodotus also wrote about the relationship between the Pelasgians and the (other) Greeks.Herodotus. Histories, 1.56–1.58 (). The relationship mirrored the \"rivalry within Greece itself between [...] Dorian Sparta and Ionian Athens.\" Herodotus wrote that the Hellenes split from the Pelasgians with the former outnumbering the latter.Herodotus. Histories, 1.58 (). In the second volume of the Histories, Herodotus wrote that the Pelasgians called their gods theoi before naming them because the gods put things in order (thentes).Herodotus. Histories, 2.51. The historian also wrote that the gods of the Pelasgians were the \"Cabeiri\" and that all of Greece, or Hellas, was first called \"Pelasgia\".Herodotus. Histories, 2.56. In the seventh volume of the Histories, Herodotus wrote that the Aeolians were known anciently as \"Pelasgians\".Herodotus. Histories, 7.95 (). In the eigth volume of the Histories, Herodotus wrote that the Pelasgians of Athens were once called \"Cranai\".Herodotus. Histories, 8.44. ===Dionysius of Halicarnassus=== The Greek historian Dionysius of Halicarnassus gave a summary of the Pelasgians in his work Roman Antiquities. He concluded based on the sources available to him that the Pelasgians were Greeks originally from the Peloponnese.Dionysius of Halicarnassus. Roman Antiquities, 1.17: \"Afterwards some of the Pelasgians who inhabited Thessaly, as it is now called, being obliged to leave their country, settled among the Aborigines and jointly with them made war upon the Sicels. It is possible that the Aborigines received them partly in the hope of gaining their assistance, but I believe it was chiefly on account of their kinship; for the Pelasgians, too, were a Greek nation originally from the Peloponnesus [...]\" ==Language== According to Sir Edward Bulwer-Lytton, the Pelasgians spoke Greek because the places where the \"Pelasgi\" traditionally lived, like Arcadia and Attica, only spoke Greek. Also, the few Pelasgian words and texts that exist betray a Greek language even though ancient Greeks called the Pelasgian language \"barbarian\".. According to Thomas Harrison, the Greek etymology of Pelasgian words in Herodotus like theoi (from Greek thentes) shows that the \"Pelasgians spoke a language at least 'akin to' Greek\". According to Pierre Henri Larcher, if this linguistic connection is true, then it proves that the Pelasgians and the Greeks were the same people. ==Outdated theories== In 1854, Johann Georg von Hahn, an Austrian diplomat and Albanian language scholar, suggested a connection between Early Albanian and Pelasgian. But this theory has been rejected by modern scholars.See . ==References== ===Citations=== ===Sources=== * * * * * * * * * * ==Further reading== * Category:Greek people",
 "title": "Pelasgians"
}