{
 "id": "823134",
 "text": "Pocket PC 2002 is a second released for Windows Mobile, was released for pubilc on October 4, 2001, there use by kernel type is Windows CE 2.10, based for Pocket PC 2000, Pocket PC 2002 was been the news codenamed is Merlin has succesor for Windows Mobile 2003. ==History== In October 2000, Microsoft replaced of Pocket PC 2000 to beta version for codenamed Merlin, has been the history of Pocket PC 2002 device in beta version, in January 14, 2001, Pocket PC 2002 build 2100 by Microsoft has reach taken on Microsoft Build 2001 and 2002, use for 3 device is Vodafone, LG and HTC Vouge. the news Pocket PC 2002 Pre-RTM can starting released on August 2001, notification news on April 15, 2001 at the Microsoft Build 2001 in Los Angeles, California. In United Kingdom, Pocket PC 2002 can be released on UK in November 2001, use for many people in work company, businessman work, enterprise and at home. Pocket PC 2002 can mistaken notification for Bill Gates on September 9, 2001. In first day ago, after released to officially for operating system Windows XP, Microsoft released Pocket PC 2002 on October 4, 2001. == Device == Pocket PC 2002 can be choice for LG device, launch sale beginning on October 29, 2001. Pocket PC 2002 LG device can use for beginning sale in Campagin Shop. In November 2001, Bill Gates reach launched 6 device for LG, HTC Vouge and Vodafone for Pocket PC 2002, the officially released in Windows XP Mobile. ==User interface== Pocket PC 2002 has been the news startup screen not loading bar, look like Windows XP are not iducle, after startup, Pocket PC 2002 can opens for the Today Screen, website browser for Wikipedia, not iducle for Google Chrome, Chromium, Firefox and Brave browser. Wikipedia mobile can be used for Google search and more, the shutdown screen use for left screen alongside with Pocket PC 2002 logo. ==Related pages== * Windows Mobile * Windows XP * Windows 7 * Windows Phone 7 Category:Operating systems",
 "title": "Pocket PC 2002"
}