{
 "id": "823226",
 "text": "is a former Japanese football player. She played for the Japan national team. ==Biography== Tezuka was born in Utsunomiya on November 6, 1970. She played for Yomiuri Nippon Beleza (later NTV Beleza). The club won Nadeshiko League for 3 years in a row (1990-1992). In 1991 season, she became top scorer with 29 goals and she was selected MVP awards. She was also selected Best Eleven for 4 years in a row (1989-1992). End of 1992 season, she retired. However, during 1996 season, she came back and played for NTV Beleza until 1999. On March 7, 1986, when Tezuka was 15 years old, she debuted for the Japan national team against Chinese Taipei. She played at 1986, 1989, 1991 AFC Championship and 1990 Asian Games. She was also a member of Japan for 1991 World Cup. This competition was her last game for Japan. She played 41 games and scored 19 goals for Japan until 1991. After retirement, Tezuka started coaching career in her local Tochigi Prefecture. In 2011, she became assistant coach for Japan U-20 and U-17 national team. In October, U-20 team won 2011 AFC U-19 Championship and in November, U-17 team won 2011 AFC U-16 Championship. She has been given the \"AFC Women's Coach Of The Year Award\". In 2013, she was appointed manager for Urawa Reds. However, in June, she resigned for health reasons. ==Statistics== Japan Football Association Japan national team Year Apps Goals 1986 10 1 1987 4 0 1988 3 1 1989 9 6 1990 4 6 1991 11 5 Total 41 19 ==References== ==Other websites== * Category:1970 births Category:Living people Category:Footballers from Tochigi Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Nippon TV Tokyo Verdy Beleza players Category:1991 FIFA Women's World Cup players Category:1986 AFC Women's Championship players Category:1989 AFC Women's Championship players Category:1991 AFC Women's Championship players Category:Footballers at the 1990 Asian Games Category:Asian Games medalists in football Category:Asian Games silver medalists for Japan Category:Medalists at the 1990 Asian Games",
 "title": "Takako Tezuka"
}