{
 "id": "8233",
 "text": "John Joseph Nicholson (born April 22, 1937) is an American retired actor, director, producer and writer. He started out as a writer and part-time actor. He became a star in 1969 when he had a small part in the movie Easy Rider. He has won three Oscars, for As Good as it Gets, One Flew Over the Cuckoo's Nest, and Terms of Endearment. He is one of the fans for Los Angeles Lakers. Nicholson is one of only two actors who have been nominated for an Academy Award for acting in every decade from the 1960s to 2000s; the other is Michael Caine. Nicholson received the Cecil B. DeMille Award in 1999. He has won seven Golden Globe Awards. He received a Kennedy Center Honor in 2001. Nicholson dropped out from the remake movie Toni Erdmann. == Early Life == Nicholson was born at Jersey Shore University Medical Center in Neptune City, New Jersey, He is son of showgirl June Frances Nicholson. ==Personal life== Nicholson has been linked to many actresses and models, including Michelle Phillips, Bebe Buell and Lara Flynn Boyle. He had a intimate relationship with Anjelica Huston from 1973 to 1989. The relationship ended when the media reported Rebecca Broussard was pregnant with their child. Nicholson and Broussard had two children together, Lorraine and Raymond. Nicholson's other children are Jennifer (born with Sandra Knight) and Honey Hollman (born with Winnie Hollman). Susan Anspach says that her son, Caleb Goddard, was fathered by Nicholson. He is not sure that he is the father.http://img.photobucket.com/albums/v120/BPorg/jack/magz/84rs6.jpg Nicholson describes himself as a \"lifelong Irish Democrat\", although he says he supports every President, and he is staunchly pro-life. He is Roman Catholic. In 2020, Nicholson endorsed Bernie Sanders's second presidential campaign for the 2020 nomination. ==Filmography== Year Title Role Director Notes 1958 The Cry Baby Killer Jimmy Wallace Jus Addiss 1960 Too Soon to Love Buddy Richard Rush 1960 The Wild Ride Johnny Varron Harvey Berman 1960 The Little Shop of Horrors Wilbur Force Roger Corman 1960 Studs Lonigan Weary Reilly Irving Lerner 1962 The Broken Land Will Brocious John A. Bushelman 1963 The Raven Rexford Bedlo Roger Corman 1963 The Terror Andre Duvalier Roger Corman 1963 Thunder Island Jack Leewood Writer 1964 Flight to Fury Jay Wickham Monte Hellman Also writer 1964 Back Door to Hell Burnett Monte Hellman 1964 Ensign Pulver Dolan Joshua Logan 1966 The Shooting Billy Spear Monte Hellman 1967 The St. Valentine's Day Massacre Gino, Hit Man Roger Corman Uncredited 1967 Hells Angels on Wheels Poet Richard Rush 1967 The Trip Roger Corman Writer 1968 Psych-Out Stoney Richard Rush 1968 Head Movie Director in Restaurant Bob Rafelson Uncredited cameo; Also producer and writer 1969 Easy Rider George Hanson Dennis Hopper 1970 On a Clear Day You Can See Forever Tad Pringle Vincente Minnelli 1970 The Rebel Rousers Bunny Martin B. Cohen 1970 Five Easy Pieces Robert Eroica Dupea Bob Rafelson 1971 Carnal Knowledge Jonathan Fuerst Mike Nichols 1971 A Safe Place Mitch Henry Jaglom 1971 Drive, He Said Himself Producer and writer 1972 The King of Marvin Gardens David Staebler Bob Rafelson 1973 The Last Detail Signalman 1st Class Billy L. \"Badass\" Buddusky Hal Ashby 1974 Chinatown J. J. \"Jake\" Gittes Roman Polanski 1975 The Passenger David Locke Michelangelo Antonioni 1975 The Fortune Oscar Sullivan Mike Nichols 1975 One Flew Over the Cuckoo's Nest Randle Patrick \"Mac\" McMurphy Miloš Forman 1975 Tommy The Specialist Ken Russell 1976 The Missouri Breaks Tom Logan Arthur Penn 1976 The Last Tycoon Brimmer Elia Kazan 1978 Goin' South Henry Lloyd Moon Himself 1980 The Shining Jack Torrance Stanley Kubrick 1981 The Postman Always Rings Twice Frank Chambers Bob Rafelson 1981 Reds Eugene O'Neill Warren Beatty 1982 The Border Charlie Smith Tony Richardson 1983 Terms of Endearment Garrett Breedlove James L. Brooks 1985 Prizzi's Honor Charley Partanna John Huston 1986 Heartburn Mark Forman Mike Nichols 1987 The Witches of Eastwick Daryl Van Horne George Miller 1987 Broadcast News Bill Rorich James L. Brooks Cameo 1987 Ironweed Francis Phelan Héctor Babenco 1989 Batman Jack Napier / The Joker Tim Burton 1990 The Two Jakes J. J. \"Jake\" Gittes Himself Also producer 1992 Man Trouble Eugene Earl Axline / Harry Bliss Bob Rafelson 1992 A Few Good Men Colonel Nathan R. Jessup Rob Reiner 1992 Hoffa James R. \"Jimmy\" Hoffa Danny DeVito 1994 Wolf Will Randall Mike Nichols 1995 The Crossing Guard Freddy Gale Sean Penn 1996 Blood and Wine Alex Gates Bob Rafelson 1996 The Evening Star Garrett Breedlove Robert Harling 1996 Mars Attacks! President James Dale / Art Land Tim Burton 1997 As Good as It Gets Melvin Udall James L. Brooks 2001 The Pledge Jerry Black Sean Penn 2002 About Schmidt Warren R. Schmidt Alexander Payne 2003 Anger Management Dr. Buddy Rydell Peter Segal 2003 Something's Gotta Give Harry Sanborn Nancy Meyers 2006 The Departed Francis \"Frank\" Costello Martin Scorsese 2007 The Bucket List Edward Cole Rob Reiner 2010 I'm Still Here Himself Casey Affleck 2010 How Do You Know Charles Madison James L. Brooks ==References== == Other websites == * * Jack Nicholson Online Category:1937 births Category:Living people Category:Actors from New Jersey Category:Actors who played the Joker Category:American movie actors Category:American television actors Category:Best Actor Academy Award winners Category:Best Supporting Actor Academy Award winners Category:Movie directors from New Jersey Category:Movie producers from New Jersey Category:Screen Actors Guild Award winners Category:Screenwriters from New Jersey",
 "title": "Jack Nicholson"
}