{
 "id": "823540",
 "text": "Nongpok Ningthou (Meitei: ꯅꯣꯡꯄꯣꯛ ꯅꯤꯡꯊꯧ) is a deity in Meitei mythology and religion of Ancient Kangleipak (Antique Manipur). He is the ruling guardian deity of the eastern direction. Legend says Nongpok Ningthou and Panthoibi got united in the Nongmaiching hills (Langmai hills). Later, they were worshipped as the civilization giving deities in Meitei religion. Nongpok Ningthou is one of the principal Umang Lais. He was originally known as \"Langmai Ningthou\" (lit. Lord of the Langmai people). == History == The Nongmaiching Hill (also known as Selloi Langmai Hills) was the ancestral territory of the Selloi Langmai people. This zone has the strongest worship of God Langmai Ningthou (Nongpok Ningthou). According to the Nongmaiching Chingkoipa (AKA Nongmaijing Chingoiba) text, the mountain in the east and beyond the rivers (Imphal R., Iril R. and Kongba R.) is the abode of God Keinou Chingsompa (another name of Nongpok Ningthou). According to the Thalon (Tharon) text, Selloi Langmai Hill had 5 divisions. Each division was occupied by different ethic groups. Each groups had different ancestral deities. These were later described as the 5 pillars of the Selloi Langmai country. Territories Latin transliteration (Romanization) Deities Latin transliteration (Romanization) ꯑꯟꯗ꯭ꯔꯣ Andro ꯑꯟꯗ꯭ꯔꯣ ꯀꯣꯟꯕ, ꯄꯅꯝ ꯅꯤꯡꯊꯧ Andro Konba, Panam Ningthou (lit.Chief of Panam) ꯀꯩꯅꯧ Keinou ꯇꯥꯔꯤꯌꯥ, ꯀꯩꯅꯧ ꯂꯥꯛꯄ Tariya, the Keinou Lakpa (lit. Chief of Keinou) ꯋꯥꯈꯥ Wakha ꯄꯨꯂꯩꯂꯣꯝꯄ (ꯄꯨꯔꯩꯔꯣꯝꯕ), ꯋꯥꯈꯥ ꯂꯥꯛꯄ Puleilompa (Pureiromba), the Wakha Lakpa (lit. Chief of Wakha) ꯆꯤꯡꯌꯥꯢ Chingyai ꯆꯤꯡꯁꯣꯝꯄ (ꯆꯤꯡꯁꯣꯝꯕ), ꯆꯤꯡꯌꯥꯢ ꯂꯥꯛꯄ Chingsomba, the Chingyai Lakpa (lit. Chief of Chingyai) ꯆꯤꯡꯁꯥꯡ Chingshang ꯄꯥꯜꯂꯨꯡ ꯅꯤꯡꯊꯧ, ꯆꯤꯡꯁꯥꯡ ꯂꯥꯛꯄ Pallung Ningthou, the Chingshang Lakpa (lit. Chief of Chingshang) Later, in the course of time, these 5 gods belonging to 5 different places of the Selloi Langmai Hill were integrated into a single God with the name \"Langmai Ningthou\". The personal names became the aliases or various forms of the God. With this, the tribal society of the Selloi Langmai people evolved into a chiefdom. This chiefdom later rose to the Angom dynasty. According to the Naothingkhong Phambal Kaba PuYa, the position of the Langmai Ningthou (lit. Langmai King) rose to the highest level of the Umang Lai God. He acquired a new title \"Nongpok Ningthou\". It took place after the uprooting of the Selloi Langmai people by the Meetei King Ura Konthouba in the 7th century AD. With the end of the ethnic conflict, the Selloi Langmai people merged into the Meitei ethnicity. Their deity \"Langmai Ningthou\" got renamed as \"Nongpok Ningthou\" (lit. Sovereign of the East). The name of the God was given by the Meiteis. The God originally belonged to the Selloi Langmai people. These group of people lived in the East of the Kangla, the capital of the Meitei kingdom. The Cheitharol Kumbaba mentioned the God for the first time during the reign of King Khagemba (1597 AD-1652 AD). == Mythology == God Nongpok Ningthou and Goddess Panthoibi are true lovers. They first met when the goddess was wandering in the open meadows, bathing and sporting in the cool waters of the running river. She was captivated by the handsome looks and towering personality of Nongpok Ningthou (alias Angoupa Kainou Chingsangsompa). They fell in love at first sight. He proposed her to elope with him. But the already married goddess didn't accept the instant proposal very soon because it was not even five days passed after her wedding. She insisted him to spend some time. The two lovers met secretly but regularly many times. Panthoibi's behavior causes her in-laws to have suspicion over her. Her mortal husband tried to win her heart with many tricks. But these were useless to the goddess. Nongpok Ningthou eloped with Goddess Panthoibi, his true lover, wearing the attires of the Tangkhuls. Nongpok Ningthou and Panthoibi, the two divine lovers, united on the Nongmaiching Hills. Their joyous union was celebrated with dances and music by the divine beings. These celebration gave birth to the Lai Haraoba festival. In another version of the story, Nongpok Ningthou met goddess Panthoibi for the first time when she was helping her father at jhum cultivation (Slash-and-burn). They fell in love at first sight without no conversation. But Panthoibi was married to another man against her will. She left her husband's house to search for her true beloved. Nongpok Ningthou also left his home for the same purpose. The lovers met at the Kangla. Kangla became the place of their divine union. So, it is considered to be an auspicious place of coronation of the Meitei kings. == Cults and shrines == Most of the surviving cults and shrines dedicated to God Langmai Ningthou (Nongpok Ningthou) are located in the Nongmaiching Hill (Selloi Langmai Hill) and its nearby areas. A few of the most prominent shrines include: (1) Nongpok at Yairipok, (2) Panam Ningthou at Andro, (3) Nongpok Ningthou at Khoirom, (4) Pureiromba at Lamlai, (5) Nongpok Ningthou at Engourok (Ingourok), (6) Pureiromba at Naharup, (7) Nongpok Ningthou at Takhel, (8) Pureiromba at Bamon Kampu, (9) Nongpok Ningthou at Charangpat Maning, (10) Waroi Ching Malang Lamhuiba at Waroi Ching, (11) Nongpok at Chandrakhong. These shrines are under the institution of the Umang Laism. However, there are many shrines of God Langmai Ningthou independent from the Umang Laism. Examples include Chingyai, Kharong, Isingchaibi, Nungpak Khul, Chingoi, etc. Due to the independence from the Umang Laism, these shrines were absorbed into Hinduism during the post-Charairongba era in Manipur. One notable instance is the shrine of Chingyai. The shrine of Chingyai was converted into the cult of Hindu God Shiva Mahadeva during the reign of King Chandrakirti (1850 AD-1886 AD). Khwairakpa Erel is the most famous sacred site dedicated to Nongpok Ningthou (alias Khwairakpa) in Assam. It is an island in the middle of the Barak River. == In art == === Dance === Panthoibi Jagoi is a duet dance form that is accompanied by a romantic song sung by a maibi and a penakhongba (pena player). It has reference to the love of Nongpok Ningthou for his consort Panthoibi. The Tangkhul Nurabi Loutaba is an enactment of the repartee between Tangkhul Pakhang (Nongpok Ningthou) and Nurabi (Panthoibi). The two players dress up in Tangkhul attires of farming in the field. This is performed on the last night of the Kanglei Haraoba (a form of Lai Haraoba). == Related pages == * Koubru - north west protector * Marjing - north east protector * Thangjing - south west protector * Wangbren - south east protector == References == == Bibliography == * A History of Manipuri Literature - Page 62 - Ch Manihar Singh · 1996 * Manipur, Maid of the Mountains - Page 159 - R. Constantine · 1981 * Noṃpok, Pānthoibī - Moirangthem Chandra Singh · 1965 * Religion and Culture of Manipur - Page 168 - Moirangthem Kirti Singh · 1988 * The Meitheis - Page 222 - Thomas Callan Hodson · 1908 == Other websites == * Nongpok Ningthou_English Wikisource * Nongpok Ningthou_archive.org * Nongpok Ningthou_e-pao.net Category:Kings in Meitei mythology Category:Meitei gods and goddesses Category:Gods and goddesses of fertility Category:Gods and goddesses of love and lust",
 "title": "Nongpok Ningthou"
}