{
 "id": "823563",
 "text": "Ehsan Ganji (Born 1 January 1971, Dehdasht) is an Iranian Cartoonist and Journalist. before working in the field of caricature, he had activities in the literature. Ganji has pursued caricature professionally since 2001. He has participated in many international cartoon festivals and exhibitions and has won various awards. He has collaborated with several newspapers including Shahrvand newspaper, Shargh newspaper, Etemad newspaper, Ebtekar newspaper, Maghreb newspaper and Khat Khati , Kayhan caricature and Humor and Caricature magazines as well as news websites. == Awards == * The first prize of the students' story writing festival of Iran, 1997 * The second prize of the Technical Students' Fiction Festival of Iran, 2000 * The second prize of the seventh Ehsan National Cartoon Festival on the subject of electricity consumption * The first prize of the National Technical Students Cartoon Festival, 2003 * Third Prize of the Polish International Festival of Women, 2006 * Selected at the China Long Hair Festival, 2005 * The first prize of the third national festival of visual arts in the field of art with the theme of citizenship culture * Selected the first marine cartoon festival in the country in 2005 * Australian Lindsay Awards Special Award for Food, 2005 * The third prize of Tabriz International Festival with the theme of kings, 2007 * The second prize of the National Festival of Young Artists Cartoons with the theme of the book * Selected for the 37th Brazilian Prasiccaba Cartoon Festival * Winner of the Special Prize of the 16th International Anti-War Cartoon Festival KRAGUJEVAC Serbia * The first prize of the national festival of the field of art with the theme of citizen * Special Award of Tehran International Festival on Urban Problems, 2010 * Special Award of the 10th Diogenes Tabura International Festival * The first prize of Boom Barakat National Cartoon Festival with the theme of citizenship culture, 2012 == References == Category:1971 births Category:Living people Category:Cartoonists Category:Iranian journalists",
 "title": "Ehsan Ganji"
}