{
 "id": "823576",
 "text": "is a Japanese football player. She played for the Japan national team. ==Biography== Arakawa was born in Nerima, Tokyo on October 30, 1979. In 1997, she joined Nadeshiko League club Yomiuri-Seiyu Beleza (later Nippon TV Beleza) from youth team. She was selected Best Eleven in 2003 and 2004. In the September 2008 WPS International Draft, she was drafted by FC Gold Pride in the top level US based Women's Professional Soccer league. In her first appearance for FC Gold Pride, Arakawa scored the club's first ever goal against Boston Breakers leading to a 2–1 victory. It would turn out to be her only goal of the season. Following the end of the 2009 WPS season, she was back to Nippon TV Beleza. In 2010, she moved to Urawa Reds Ladies. From 2013, she played for Chifure AS Elfen Saitama (2013-2014, 2016), Nippon TV Beleza (2015) and Nippon Sport Science University Fields Yokohama (2017). She is currently playing for Chifure AS Elfen Saitama from 2018. On 10 June 2000, Arakawa debuted for the Japan national team against Canada. She was a member of Japan for 2003, 2007 World Cup, 2004 and 2008 Summer Olympics. She played 72 games and scored 20 goals for Japan until 2011. ==Statistics== Japan Football Association Japan national team Year Apps Goals 2000 2 0 2001 0 0 2002 0 0 2003 13 5 2004 10 5 2005 0 0 2006 14 3 2007 15 4 2008 14 3 2009 1 0 2010 0 0 2011 3 0 Total 72 20 ==References== ==Other websites== * Category:1979 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Nippon TV Tokyo Verdy Beleza players Category:Urawa Red Diamonds Ladies players Category:Chifure AS Elfen Saitama players Category:Footballers at the 2004 Summer Olympics Category:Footballers at the 2008 Summer Olympics Category:2003 FIFA Women's World Cup players Category:2007 FIFA Women's World Cup players Category:2003 AFC Women's Championship players Category:2006 AFC Women's Asian Cup players Category:2008 AFC Women's Asian Cup players Category:Footballers at the 2006 Asian Games Category:Asian Games medalists in football Category:Asian Games silver medalists for Japan Category:Medalists at the 2006 Asian Games",
 "title": "Eriko Arakawa"
}