{
 "id": "823681",
 "text": "Wangpulen (also, Wangpuren or Wangbaren or Wangbren) is the god of water, rain, flood, disease and sickness in Meitei mythology and religion of Ancient Kangleipak (Antique Manipur). He is the ruler of the underwater world. He is the Lord of the rivers. The guardianship of the south eastern direction is alluded to Wangbren and the other directions to Koupalu (north west), Marjing (north east) and Thangjing (south west). He is one of the Umang Lais. He has a strong connection with the Anal tribe (Anan tribe) for marrying a lady of the Anal Khullen village. Among the cult centres dedicated to him, the one at Sugnu is the most significant in Meitei pantheon. == Description == In the Wakoklon Heelel Thilel Salai Amailon Pukok Puya, Wangbren is mentioned as \"Khana Chaopa Wangpulen\". According to the text, He is one of the 7 Laipungthous and one of the manifestations of the Supreme God, Ipung Loinapa Apakpa. == Mythology == Once God Wangbren went to the village of the Anal people, disguising Himself as a human. He fell in love with a beautiful girl, Shagnu. The maiden was also attracted to His good looks. The girl's affair with a stranger angered the community. The young men of the village challenged Wangbren to fight. There were competitions in race, stone throw and archery. If He failed, He would be killed. But He won all the challenges. As He won, He took Shangnu, the maiden away with Him to His divine abode. == Worship == Whenever one gets drowned, Wangbren is worshipped according to the traditional rites and rituals. They did so in a belief that there will be no further deaths in water. Whenever unusual flood water currents are seen, especially in rivers, He is worshipped by people to save them from drowning and other mishaps. If a drowned person's dead body is not found, then a portion of the trunk of palash tree (Butea monosperma) is cremated. It is done in a belief that Wangbren might have kept the corpse at a sacred place. Wangbren is worshipped by offering fruits, flowers and kabok. The rites and rituals are performed by the maibas. It is to ward off the diseases, illness or sickness caused by the water god. Examples include skin diseases, cold and cough, diarrhoea, etc. In the planning, # A denotes the spot of burial of gold models. # B denotes the position of the cloth on which clothes of Lai (Male Deity) and Lairemma (Female Deity) were laid. # C denotes the position of the rice pot. # D denotes the position of the 3 dried plantain leaves containing rice, betel nut, plantains, sugarcane, flowers and fruits. # E denotes the position of the plantain leaf on which cucumbers and other vegetables are offered to God Khana Chaoba Wangbren. # F denotes the position of the cloth on which a cloth is knotted to represent a man (a rag doll). # G denotes the position of Moirang Keirungba. # H denotes the position of Moirang Ningthou (lit. King of Moirang). # I denotes the position of the King. # J denotes the position of the Maiba. # K denotes the position of Suganu Hanjaba. # M and N denote the position of the attendants. # O denotes the position of a fowl kept. == Cults and Shrines == A sacred shrine dedicated to Wangbren still exists today in the Sugnu village. Annually, the non-Christian Anal villagers give offerings to their priest. The priest took and offer the articles to the God in Sugnu. Inside the Kangla, the State Government is to renovate and reconstruct the holy altars dedicated to God Wangbren and other deities. In 2010, a temple dedicated to God Wangbren was constructed at Wangoi, Manipur. The temple building construction costs ₹ 8 lacs INR ($10,000 USD). == Related pages == * Koupalu - north west protector * Marjing - north east protector * Thangjing - south west protector == References == == Other websites == * Wangbren_archive.org * Wangbren_e-pao.net Category:Kings in Meitei mythology Category:Meitei gods and goddesses Category:Gods and goddesses of water",
 "title": "Wangpulen"
}