{
 "id": "82364",
 "text": "is a Japanese rock band. They are a part of the visual kei movement.Shoxx Vol 106 June 2007 pg 40-45 The band formed in early 2002 and is currently signed to PS Company and King Records. == Members == * Ruki–vocals * Uruha–guitar * Aoi–guitar * Reita–bass * Kai–drums ;Former members * Yune–drums == Biography == In March of 2002, Ruki, Uruha, and Reita (all former band mates), and Aoi and Yune (also former band mates) formed a band under the name Gazette.Gazette's page at Grass Thread Retrieved Aug 19 2007 Originally signed to Matina, they released their first single, \"Wakaremichi\", and a video release in April. By September they had released two more singles and another video, headlining a show for the first time in October. In early 2003, Yune decided to leave the band, and he was replaced by Kai. Shortly after, they signed with the PS Company label, and in May released their first EP, Cockayne Soup. They started their first tour, with the band Hanamuke, and along with the tour, the bands collaborated on two songs. A second tour followed with the band Vidoll, and the bands were featured together on the November issue of Cure, a magazine focusing on Visual Kei bands.Cure Vol 2 Nov 2003 In early December they played a co-headlining show with Deadman. On December 28, they performed at Fool's Mate magazine's Beauti-fool's Fest which was later released on DVD. On January 16, 2004, they recorded a solo performance at the Shibuya-AX, which was released on DVD as Tokyo saihan ~Judgement Day~.Gazette's page at Grass Thread On March 30, 2004, they released their Madara mini-album, which reached #2 on the Oricon Indie Charts. Madara was followed in May by a companion DVD, which included six music videos and an in- the-studio documentary. The same month, Gazette was featured in Shoxx magazine's Expect Rush III, a catalogue of independent Visual Kei artists.Expect Rush III A second live DVD, Heisei Banka, was released in August. During September and October they toured with fellow PS Company bands Kra and BIS. Their debut album, Disorder, was released in October, and made it to the top 5 of the indies Oricon Daily Charts. The band spent the remainder of 2004 and 2005 touring extensively, releasing Gama (another mini album) in August. In 2005, the band released their first major label single, Cassis, in December.King Records Official Site Retrieved Aug 16 2007 Starting 2006 with a name change—from Japanese characters to a romanized script—they released Nil, their second full-length album, on February 8, 2006, and embarked on another Japanese tour, ending at the venue Nippon Budokan.Gazette at the Top JAME News Retrieved Aug 19 2007 That July, The Gazette performed at the Beethovenhalle in Bonn, Germany, their first show outside of Asia. The concerts were arranged in conjunction with the AnimagiC anime and manga convention.Gazette in Germany This Summer JAME News Retrieved on Aug 19 2007 Three more singles were released followed by another studio album, Stacked Rubbish on July 4, 2007. It reached #2 on the Oricon charts within a day from the release. The album debut was followed by a promotional tour from July through September. In October, The Gazette started their first European tour stopping England, Finland, France, and Germany. A new single called \"Guren\" was released on February 13, 2008. Reita died on April 15, 2024. == Discography == === Albums & EPs === Year Title Type Chart positions 2003 Cockayne Soup EP 2003 Akuyuukai EP 2003 Super Margarita EP 2003 Hankou Seimeibun EP 2004 Madara EP 2 2004 Disorder Studio album 3 2005 Gama EP 2006 Nil Studio album 3 2006 Dainihon Itangeishateki... Compilation album 2007 Stacked Rubbish Studio album 2 2009 DIM Studio album 2011 TOXIC Studio album === Singles === * \"Wakaremichi\" (別れ道) (April 30, 2002) * \"Kichiku Kyoushi (32sai Dokushin) no Nousatsu Kouza\" (鬼畜教師(32才独身)の悩殺講座) (August 30, 2002) * \"Gozen 0-ji no Trauma Radio\" (午前0時のとらうまラヂヲ) (November 1, 2002) * \"Zakurogata no Yuuutsu\" (July 28, 2004) * \"Zetsu\" (July 28, 2004) * \"Miseinen\" (July 28, 2004) * \"Reila\" (March 9, 2005) * \"Dainippon Itangeishateki...\" (November 23, 2005) * \"Cassis\" (December 6, 2005) * \"Regret\" (October 25, 2006) * \"Filth in the Beauty\" (November 1, 2006) * \"Hyena\" (February 7, 2007) * \"Guren\" (紅蓮) (February 13, 2008) === Live Distributions & other releases === * \"Yougenkyou\"(妖幻鏡moon) (25 December 2002, Eternal) * \"Kaleidoscope\" (1 May 2003, PS Company) * \"Hanamuke & Gazette live\"(男尻ツアーファイナル) (6 May 2003, PS Company) * \"Jyuyon sai no naifu\" / 14 sai no knife(十四歳のナイフ) (11 September 2004, PS Company) * \"Chigire\"(チギレ) (August 2005, PS Company) * \"Kare uta\"(枯詩) (20 October 2005, PS Company) == Videography == * -Matina- Final Prelude live (10 April 2003) (Omnibus) * Tokyo saihan ~Judgement Day~ (東京裁判 ～JUDGMENT DAY～) (28 April 2004, PS Company) * Madara (斑蠡～MADARA～) (26 May 2004, PS Company) * Heisei Banka (平成挽歌) (25 August 2004) * Hakkiyagyou (百鬼家行) (1 October 2004) live-only single * Peace & Smile Carnival Tour 2005 (～笑顔でファッキュー～) Live DVD (2006) (with Miyavi, Kagrra, Kra, Alice Nine) * Standing Tour 2005 Final Maximum Royal Disorder at 2005.4.17 Shibuya Kokaido Live (STANDING TOUR 2005 FINAL「M.R.D」at 2005.4.17 渋谷公会堂) (6 July 2005) * Film Bug I (7 June 2006, PS Company) * Standing Tour 2006 Nameless Liberty. Six Guns... -Tour Final- at Budokan (6 September 2006) * Tour 2006-2007 Decomposition Beauty—Final \"Meaningless Art That People Showed\" at Yokohama Arena (13 June 2007) == References == == Other websites == * The Gazette official website at PS Company * The Gazette official MySpace * The Gazette at King Records * The Gazette at CLJ Records Category:Japanese rock bands Category:Visual kei bands",
 "title": "The Gazette (band)"
}