{
 "id": "823861",
 "text": "St Petersburg University (SPbU, Saint Petersburg State University; Russian: СПбГУ, Санкт-Петербургский государственный университет) is a Russian university in Saint Petersburg. It is the oldest university in Russia. It is also one of the largest universities in the country. == Schools == Saint Petersburg State University has many schools. They include science, engineering and humanities. * Applied mathematics and Control processes. Unlike many universities, applied mathematics is not a part of mathematics. * Biology * Dentistry and Medical Technology * Economics * International Relations * Law * Liberal Arts and Sciences * Mathematics and Mechanics * Medicine * Oriental Studies * Arts * Philology * Physics. Some universities handle physics as part of \"Faculty of Science (and Engineering)\". * Political Science * Psychology * Journalism and Mass Communications == Alumni == Saint Petersburg State University has produced a number of famous people. Their names are known in many fields. ;Politicians * Vladimir Lenin: Founder of the Russian Revolution and the Soviet Union. * Vladimir Putin: President of Russia * Dmitry Medvedev: Former president of Russia * Dalia Grybauskaitė: First female president of Lithuania ;Scientists * Ivan Pavlov: Awarded the Nobel Prize in Physiology or Medicine in 1904 for research about the digestive system.Cambiaghi, M., & Sacchetti, B. (2015). Ivan Petrovich Pavlov (1849–1936). Journal of neurology, 262(6), 1599-1600. * Ilya Mechnikov: Awarded the Nobel Prize in Physiology or Medicine in 1908 for research about immunity.Zalkind, S. (2001). Ilya Mechnikov: his life and work. The Minerva Group, Inc.. * Leonid Kantorovich: Russian mathematician known for the Kantorovich theorem and his textbook.Kantorovich, L. V., & Akilov, G. P. (1959). Functional analysis in normalized spaces. Fizmatgis, Moskva. He is also a Nobel prize winner.Kutateladze, S. S. (2011). Mathematics and economics of Leonid Kantorovich. arXiv preprint arXiv:1101.0984. == Related pages == * Moscow State University == References == == Other websites == * Saint Petersburg State University homepage * History of The St. Petersburg University in virtual space Category:Colleges and universities in Russia Category:Buildings and structures in Saint Petersburg",
 "title": "Saint Petersburg State University"
}