{
 "id": "823844",
 "text": "Koupalu (also, Koubaru or Koubru) is a primordial deity in Meitei mythology and religion. He is the Guardian of the North West direction. Legend says he is the founder of civilization in Ancient Manipur, starting from the Mount Koubru, a peak where he abodes, in north-western Manipur. God Koubru resides in the Mount Koubru (Koubru Hill). The Mount Koubru (Koubru Hill) is the first place of settlement of the Meitei ethnicity, including the Lois of Andro, Khurkhul, Phayeng and Sekmai. == Origin == The traditional hymns supplement the theory of origin. > Awang Koubru Assupa > Leimalai Khunda Ahanba. > Nongthrei Ma-U Lingliba, > Irik Mapan Thariba, > Lainingthou! English translation of the above passage: > North Koubru all-inclusive (pervasive) > Leima Lai first habitation, > Heaven-flower all things seen established, > Blood drop (Blood cell) planters, > O! Lainingthou (King of Gods)! This is the hymn of invocation of God Koubru (Koupalu in PuYas). == Description == Lord Koubru is the Omniscient and the Omnipotent Guardian God. He lives on the top of Mount Koubru. God Koubru, the Heavenly Lord, is said to be the controller of the nine underground wells/tunnels. These are associated with the birth and death of the mankind. The 9 tunnels are sacred to the Meitei people. So, these are still worshipped by the Meiteis. == Worship == In the Lai Haraoba festival, a ritualistic folk song dedicated to God Koubru is sung like this: > Awang Koubru Assupa > Eeyen Khunda Ahanba English translation of the above passage: > Koubru of the North, You are the overlord > You are the first place of settlement. The Meiteis offer a beautiful puppy to God Koubru to free themselves from the sufferings. The Loi caste of the Meitei ethnicity worship God Koubru on every occasion, including birth, marriage and death. All the Loi villagers excluding Andro are the worshipers of God Koubru. == Related pages == * Marjing - north east protector * Thangjing - south west protector * Wangbren - south east protector == References == == Other websites == * Koubru_archive.org * Koubru_e-pao.net Category:Kings in Meitei mythology Category:Meitei gods and goddesses",
 "title": "Koupalu"
}