{
 "id": "82406",
 "text": "The 2001 Formula One season was the 52nd edition of the championship. The Driver's Champion (the guy who won for the year) was Michael Schumacher. He dominated (was the fastest) for the most of the season, and won with a record margin of 58 points. Ferrari won the Constructors' Championship (the fastest car). After four years out of the sport, Renault returned as an engine supplier. Michelin returned as a tyre supplier. This was the first time Bridgestone had competition since Goodyear left the sport at the end of the season. 2001 saw the first Formula One races for future champions Fernando Alonso and Kimi Räikkönen. It was the last year Jean Alesi and world champion Mika Häkkinen would race in Formula One. At the end of the 2001, the Prost team closed down due to lack of money. The French company Renault purchased the Benetton team. Benetton was renamed as the Renault F1 team. __TOC__ == Drivers and constructors == The following teams and drivers competed in the 2001 FIA Formula One World Championship. Team Constructor Chassis Engine Tyre No Driver Rounds Test driver(s) Scuderia Ferrari Marlboro Ferrari Ferrari F2001 Ferrari 050 3.0 L V10 1 Michael Schumacher All Luca Badoer Scuderia Ferrari Marlboro Ferrari Ferrari F2001 Ferrari 050 3.0 L V10 2 Rubens Barrichello All Luca Badoer West McLaren-Mercedes McLaren McLaren MP4-16 Mercedes FO110K 3.0 L V10 3 Mika Häkkinen All Alexander Wurz West McLaren- Mercedes McLaren McLaren MP4-16 Mercedes FO110K 3.0 L V10 4 David Coulthard All Alexander Wurz BMW-WilliamsF1 Team Williams Williams FW23 BMW P80 3.0 L V10 5 Ralf Schumacher All Marc Gené Jörg Müller BMW-WilliamsF1 Team Williams Williams FW23 BMW P80 3.0 L V10 6 Juan Pablo Montoya All Marc Gené Jörg Müller Mild Seven Benetton-Renault Benetton Benetton B201 Renault RS21 3.0 L V10 7 Giancarlo Fisichella All Mark Webber Oliver Gavin Mild Seven Benetton-Renault Benetton Benetton B201 Renault RS21 3.0 L V10 8 Jenson Button All Mark Webber Oliver Gavin Lucky Strike BAR-Honda BAR BAR 003 Honda RA001E 3.0 L V10 9 Olivier Panis All Anthony Davidson Darren Manning Patrick Lemarié Takuma Sato Lucky Strike BAR-Honda BAR BAR 003 Honda RA001E 3.0 L V10 10 Jacques Villeneuve All Anthony Davidson Darren Manning Patrick Lemarié Takuma Sato B&H; Jordan-Honda Jordan Jordan EJ11 Honda RA001E 3.0 L V10 11 Heinz-Harald Frentzen 1–7, 9-11 Ricardo Zonta B&H; Jordan-Honda Jordan Jordan EJ11 Honda RA001E 3.0 L V10 11 Ricardo Zonta 8, 12 Ricardo Zonta B&H; Jordan- Honda Jordan Jordan EJ11 Honda RA001E 3.0 L V10 11 Jarno Trulli 13-17 Ricardo Zonta B&H; Jordan-Honda Jordan Jordan EJ11 Honda RA001E 3.0 L V10 12 Jarno Trulli 1-12 Ricardo Zonta B&H; Jordan-Honda Jordan Jordan EJ11 Honda RA001E 3.0 L V10 12 Jean Alesi 13-17 Ricardo Zonta Orange Arrows-Asiatech Arrows Arrows A22 Asiatech 001 3.0 L V10 14 Jos Verstappen All Johnny Herbert Orange Arrows-Asiatech Arrows Arrows A22 Asiatech 001 3.0 L V10 15 Enrique Bernoldi All Johnny Herbert Red Bull Sauber-Petronas Sauber Sauber C20 Petronas 01A 3.0 L V10 16 Nick Heidfeld All Felipe Massa Red Bull Sauber-Petronas Sauber Sauber C20 Petronas 01A 3.0 L V10 17 Kimi Räikkönen All Felipe Massa Jaguar Racing Jaguar Racing Jaguar R2 Cosworth CR-3 3.0 L V10 18 Eddie Irvine All Tomas Scheckter Jaguar Racing Jaguar Racing Jaguar R2 Cosworth CR-3 3.0 L V10 19 Luciano Burti 1-4 Tomas Scheckter Jaguar Racing Jaguar Racing Jaguar R2 Cosworth CR-3 3.0 L V10 19 Pedro de la Rosa 5-17 Tomas Scheckter European Minardi F1 Minardi Minardi PS01 Minardi PS01B European 3.0 L V10 20 Tarso Marques 1-14 Alex Yoong European Minardi F1 Minardi Minardi PS01 Minardi PS01B European 3.0 L V10 20 Alex Yoong 15-17 Alex Yoong European Minardi F1 Minardi Minardi PS01 Minardi PS01B European 3.0 L V10 21 Fernando Alonso All Alex Yoong Prost-Acer Prost Prost AP04 Acer 3.0 L V10 22 Jean Alesi 1-12 Stephane Sarrazin Pedro de la Rosa Jonathan Cochet Prost-Acer Prost Prost AP04 Acer 3.0 L V10 22 Heinz-Harald Frentzen 13-17 Stephane Sarrazin Pedro de la Rosa Jonathan Cochet Prost-Acer Prost Prost AP04 Acer 3.0 L V10 23 Gaston Mazzacane 1-4 Stephane Sarrazin Pedro de la Rosa Jonathan Cochet Prost-Acer Prost Prost AP04 Acer 3.0 L V10 23 Luciano Burti 5-14 Stephane Sarrazin Pedro de la Rosa Jonathan Cochet Prost-Acer Prost Prost AP04 Acer 3.0 L V10 23 Tomáš Enge 15-17 Stephane Sarrazin Pedro de la Rosa Jonathan Cochet == Formula One 2001 race schedule == Rnd Race Date Location 1 Australian Grand Prix March 4 Melbourne 2 Malaysian Grand Prix March 18 Sepang 3 Brazilian Grand Prix April 1 Interlagos 4 San Marino Grand Prix April 15 Imola 5 Spanish Grand Prix April 29 Catalunya 6 Austrian Grand Prix May 13 A1-Ring 7 Monaco Grand Prix May 27 Monaco 8 Canadian Grand Prix June 10 Circuit Gilles Villeneuve 9 European Grand Prix June 24 Nürburgring 10 French Grand Prix July 1 Magny-Cours 11 British Grand Prix July 15 Silverstone 12 German Grand Prix July 29 Hockenheimring 13 Hungarian Grand Prix August 19 Hungaroring 14 Belgian Grand Prix September 2 Spa-Francorchamps 15 Italian Grand Prix September 16 Monza 16 United States Grand Prix September 30 Indianapolis 17 Japanese Grand Prix October 14 Suzuka == Results and standings == === Grands Prix === Rd. Grand Prix Pole Position Fastest Lap Winning Driver Constructor 1 Australian Grand Prix Michael Schumacher Michael Schumacher Michael Schumacher Ferrari 2 Malaysian Grand Prix Michael Schumacher Mika Häkkinen Michael Schumacher Ferrari 3 Brazilian Grand Prix Michael Schumacher Ralf Schumacher David Coulthard McLaren-Mercedes 4 San Marino Grand Prix David Coulthard Ralf Schumacher Ralf Schumacher Williams-BMW 5 Spanish Grand Prix Michael Schumacher Michael Schumacher Michael Schumacher Ferrari 6 Austrian Grand Prix Michael Schumacher David Coulthard David Coulthard McLaren-Mercedes 7 Monaco Grand Prix David Coulthard David Coulthard Michael Schumacher Ferrari 8 Canadian Grand Prix Michael Schumacher Ralf Schumacher Ralf Schumacher Williams-BMW 9 European Grand Prix Michael Schumacher Juan Pablo Montoya Michael Schumacher Ferrari 10 French Grand Prix Ralf Schumacher David Coulthard Michael Schumacher Ferrari 11 British Grand Prix Michael Schumacher Mika Häkkinen Mika Häkkinen McLaren-Mercedes 12 German Grand Prix Juan Pablo Montoya Juan Pablo Montoya Ralf Schumacher Williams-BMW 13 Hungarian Grand Prix Michael Schumacher Mika Häkkinen Michael Schumacher Ferrari 14 Belgian Grand Prix Juan Pablo Montoya Michael Schumacher Michael Schumacher Ferrari 15 Italian Grand Prix Juan Pablo Montoya Ralf Schumacher Juan Pablo Montoya Williams-BMW 16 United States Grand Prix Michael Schumacher Juan Pablo Montoya Mika Häkkinen McLaren-Mercedes 17 Japanese Grand Prix Michael Schumacher Ralf Schumacher Michael Schumacher Ferrari === Drivers === Pos Driver AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN Points 1 Michael Schumacher 1 1 2 Ret 1 2 1 2 1 1 2 Ret 1 1 4 2 1 123 2 David Coulthard 2 3 1 2 5 1 5 Ret 3 4 Ret Ret 3 2 Ret 3 3 65 3 Rubens Barrichello 3 2 Ret 3 Ret 3 2 Ret 5 3 3 2 2 5 2 15† 5 56 4 Ralf Schumacher Ret 5 Ret 1 Ret Ret Ret 1 4 2 Ret 1 4 7 3 Ret 6 49 5 Mika Häkkinen Ret 6 Ret 4 9† Ret Ret 3 6 DNS 1 Ret 5 4 Ret 1 4 37 6 Juan Pablo Montoya Ret Ret Ret Ret 2 Ret Ret Ret 2 Ret 4 Ret 8 Ret 1 Ret 2 31 7 Jacques Villeneuve Ret Ret 7 Ret 3 8 4 Ret 9 Ret 8 3 9 8 6 Ret 10 12 8 Nick Heidfeld 4 Ret 3 7 6 9 Ret Ret Ret 6 6 Ret 6 Ret 11 6 9 12 9 Jarno Trulli Ret 8 5 5 4 DSQ Ret 11† Ret 5 Ret Ret Ret Ret Ret 4 8 12 10 Kimi Räikkönen 6 Ret Ret Ret 8 4 10 4 10 7 5 Ret 7 Ret 7 Ret Ret 9 11 Giancarlo Fisichella 13 Ret 6 Ret 14 Ret Ret Ret 11 11 13 4 Ret 3 10 8 17† 8 12 Eddie Irvine 10 Ret Ret Ret Ret 7 3 Ret 7 Ret 9 Ret Ret Ret Ret 5 Ret 6 13 Heinz-Harald Frentzen 5 4 11† 6 Ret Ret Ret Ret 8 7 Ret 9 Ret 10 12 6 14 Olivier Panis 7 Ret 4 8 7 5 Ret Ret Ret 9 Ret 7 Ret 11 9 11 13 5 15 Jean Alesi 9 9 8 9 10 10 6 5 15† 12 11 6 10 6 8 7 Ret 5 16 Pedro de la Rosa Ret Ret Ret 6 8 14 12 Ret 11 Ret 5 12 Ret 3 17 Jenson Button 14† 11 10 12 15 Ret 7 Ret 13 16† 15 5 Ret Ret Ret 9 7 2 18 Jos Verstappen 11 7 Ret Ret 12 6 8 10† Ret 13 10 9 12 10 Ret Ret 14 1 19 Ricardo Zonta 7 Ret 0 20 Luciano Burti 8 10 Ret 11 11 11 Ret 8 12 10 Ret Ret Ret Ret 0 21 Enrique Bernoldi Ret Ret Ret 10 Ret Ret 9 Ret Ret Ret 14 8 Ret 12 Ret 13 15 0 22 Tarso Marques Ret 14 9 Ret 16 Ret Ret 9 Ret 15 DNQ Ret Ret 13 0 23 Fernando Alonso 12 13 Ret Ret 13 Ret Ret Ret 14 17† 16 10 Ret Ret 13 Ret 11 0 24 Tomáš Enge 12 14 Ret 0 25 Gastón Mazzacane Ret 12 Ret Ret 0 26 Alex Yoong Ret Ret 16 0 Pos Driver AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN Points Pole position in Bold. Fastest lap in Italics. Driver did not finish the Grand Prix. Driver was classified (ranked) because they finished over 90% of the race. === Constructors === Pos Constructor Car no. AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN Points 1 Ferrari 1 1 1 2 Ret 1 2 1 2 1 1 2 Ret 1 1 4 2 1 179 2 3 2 Ret 3 Ret 3 2 Ret 5 3 3 2 2 5 2 15 5 2 McLaren-Mercedes 3 Ret 6 Ret 4 9 Ret Ret 3 6 DNS 1 Ret 5 4 Ret 1 4 102 4 2 3 1 2 5 1 5 Ret 3 4 Ret Ret 3 2 Ret 3 3 3 Williams-BMW 5 Ret 5 Ret 1 Ret Ret Ret 1 4 2 Ret 1 4 7 3 Ret 6 80 6 Ret Ret Ret Ret 2 Ret Ret Ret 2 Ret 4 Ret 8 Ret 1 Ret 2 4 Sauber-Petronas 16 4 Ret 3 7 6 9 Ret Ret Ret 6 6 Ret 6 Ret 11 6 9 21 17 6 Ret Ret Ret 8 4 10 4 10 7 5 Ret 7 Ret 7 Ret Ret 5 Jordan-Honda 11 5 4 11 6 Ret Ret Ret 7 Ret 8 7 Ret 10 6 8 7 Ret 19 12 Ret 8 5 5 4 DSQ Ret 11 Ret 5 Ret Ret Ret Ret Ret 4 8 6 BAR-Honda 9 7 Ret 4 8 7 5 Ret Ret Ret 9 Ret 7 Ret 11 9 11 13 17 10 Ret Ret 7 Ret 3 8 4 Ret 9 Ret 8 3 9 8 6 Ret 10 7 Benetton-Renault 7 13 Ret 6 Ret 14 Ret Ret Ret 11 11 13 4 Ret 3 10 8 17 10 8 14 11 10 12 15 Ret 7 Ret 13 16 15 5 Ret Ret Ret 9 7 8 Jaguar- Cosworth 18 10 Ret Ret Ret Ret 7 3 Ret 7 Ret 9 Ret Ret Ret Ret 5 Ret 9 19 8 10 Ret 11 Ret Ret Ret 6 8 14 12 Ret 11 Ret 5 12 Ret 9 Prost-Acer 22 9 9 8 9 10 10 6 5 15 12 11 6 Ret 9 Ret 10 12 4 23 Ret 12 Ret Ret 11 11 Ret 8 12 10 Ret Ret Ret Ret 12 14 Ret 10 Arrows-Asiatech 14 11 7 Ret Ret 12 6 8 10 Ret 13 10 9 12 10 Ret Ret 14 1 15 Ret Ret Ret 10 Ret Ret 9 Ret Ret Ret 14 8 Ret 12 Ret 13 15 11 Minardi-European 20 Ret 14 9 Ret 16 Ret Ret 9 Ret 15 DNQ Ret Ret 13 Ret Ret 16 0 21 12 13 Ret Ret 13 Ret Ret Ret 14 17 16 10 Ret Ret 13 Ret 11 Pos Constructor Car no. AUS MAL BRA SMR ESP AUT MON CAN EUR FRA GBR GER HUN BEL ITA USA JPN Points Pole position in Bold. Fastest lap in Italics. Car did not finish the Grand Prix. Car was classified (ranked) because it finished over 90% of the race distance. Formula One Category:Formula One seasons",
 "title": "2001 Formula One World Championship"
}