{
 "id": "824065",
 "text": "is a Japanese football player. She plays for the Japan national team. ==Biography== Nakajima was born in Yasu on September 27, 1990. After graduating from Yasu High School, she joined INAC Kobe Leonessa in 2009. The club won Nadeshiko League championship for 3 years in a row (2011-2013). She was also selected Best Eleven in 2013 and 2017. Nakajima was included in Norio Sasaki's the Japan U-20 national team squad for the 2010 U-20 World Cup in Germany. She appeared in all three matches and scoring one goal in a 3–1 win against England, as Japan were eliminated in the group stage. Nakajima received her first cap for the senior team against United States on May 14, 2011. On July 10, 2013, she was called up to the 2013 East Asian Cup in South Korea. She scored her first goal on July 20 in a 2–0 win against China in the first East Asian Cup final round match. In 2014, she played at 2014 Asian Cup and 2014 Asian Games. Japan won the championship at Asian Cup and the 2nd place at Asian Games. In 2018, she played at 2018 Asian Cup and Japan won their second consecutive title. In 2019, she was selected Japan for 2019 World Cup. ==Statistics== List of match in 2011, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020 at Japan Football Association Japan national team Year Apps Goals 2011 2 0 2012 0 0 2013 7 1 2014 12 4 2015 3 1 2016 7 1 2017 15 2 2018 19 4 2019 13 1 2020 3 0 Total 81 14 ==References== ==Other websites== * *Japan Football Association Category:1990 births Category:Living people Category:Footballers from Shiga Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:INAC Kobe Leonessa players Category:2019 FIFA Women's World Cup players Category:2014 AFC Women's Asian Cup players Category:2018 AFC Women's Asian Cup players Category:Footballers at the 2014 Asian Games Category:Footballers at the 2018 Asian Games Category:AFC Women's Asian Cup-winning players Category:Asian Games medalists in football Category:Asian Games gold medalists for Japan Category:Asian Games silver medalists for Japan Category:Medalists at the 2014 Asian Games Category:Medalists at the 2018 Asian Games",
 "title": "Emi Nakajima"
}