{
 "id": "82409",
 "text": "The 1998 Formula One season was the 47th edition of the championship. The champion was Mika Häkkinen in a close battle. Mclaren won the constructor's championship. == Drivers and constructors == The following teams and drivers competed in the 1998 FIA Formula One World Championship. Entrant Constructor Chassis Engine Tyres No Driver Rounds Test driver(s) Winfield Williams Williams Williams FW20 Mecachrome GC37-01 3.0 L V10 1 Jacques Villeneuve All Juan Pablo Montoya Max Wilson Winfield Williams Williams Williams FW20 Mecachrome GC37-01 3.0 L V10 2 Heinz-Harald Frentzen All Juan Pablo Montoya Max Wilson Scuderia Ferrari Marlboro Ferrari Ferrari F300 Ferrari 047 3.0 L V10 3 Michael Schumacher All Luca Badoer Scuderia Ferrari Marlboro Ferrari Ferrari F300 Ferrari 047 3.0 L V10 4 Eddie Irvine All Luca Badoer Mild Seven Benetton Playlife Benetton Benetton B198 Playlife GC37-01 3.0 L V10 5 Giancarlo Fisichella All n/a Mild Seven Benetton Playlife Benetton Benetton B198 Playlife GC37-01 3.0 L V10 6 Alexander Wurz All n/a West Mclaren Mercedes McLaren McLaren MP4-13 Mercedes FO110G 3.0 L V10 7 David Coulthard All Ricardo Zonta Nick Heidfeld West Mclaren Mercedes McLaren McLaren MP4-13 Mercedes FO110G 3.0 L V10 8 Mika Häkkinen All Ricardo Zonta Nick Heidfeld Benson & Hedges Jordan Jordan Jordan 198 Mugen-Honda MF-301 HC 3.0 L V10 9 Damon Hill All Pedro De La Rosa Benson & Hedges Jordan Jordan Jordan 198 Mugen-Honda MF-301 HC 3.0 L V10 10 Ralf Schumacher All Pedro De La Rosa Gauloises Prost Peugeot Prost Prost AP01 Peugeot A16 3.0 L V10 11 Olivier Panis All Stephane Sarrazin Gauloises Prost Peugeot Prost Prost AP01 Peugeot A16 3.0 L V10 12 Jarno Trulli All Stephane Sarrazin Red Bull Sauber Petronas Sauber Sauber C17 Petronas SPE-01D 3.0 L V10 14 Jean Alesi All Jörg Müller Red Bull Sauber Petronas Sauber Sauber C17 Petronas SPE-01D 3.0 L V10 15 Johnny Herbert All Jörg Müller Danka Zepter Arrows Arrows Arrows A19 Arrows T2-F1 3.0 L V10 16 Pedro Diniz All Emmanuel Collard Stephen Watson Danka Zepter Arrows Arrows Arrows A19 Arrows T2-F1 3.0 L V10 17 Mika Salo All Emmanuel Collard Stephen Watson Stewart Ford Stewart Stewart SF02 Ford VJ Zetec-R 3.0 L V10 18 Rubens Barrichello All n/a Stewart Ford Stewart Stewart SF02 Ford VJ Zetec-R 3.0 L V10 19 Jan Magnussen 1-7 n/a Stewart Ford Stewart Stewart SF02 Ford VJ Zetec-R 3.0 L V10 19 Jos Verstappen 8-16 n/a Tyrrell Tyrrell Tyrrell 026 Ford JD Zetec-R 3.0 L V10 20 Ricardo Rosset All n/a Tyrrell Tyrrell Tyrrell 026 Ford JD Zetec-R 3.0 L V10 21 Toranosuke Takagi All n/a Fondmetal Minardi Team SpA Minardi Minardi M198 Ford JD Zetec-R 3.0 L V10 22 Shinji Nakano All Laurent Redon Fondmetal Minardi Team SpA Minardi Minardi M198 Ford JD Zetec-R 3.0 L V10 23 Esteban Tuero All Laurent Redon ==Season review== === Race results === Round Grand Prix Pole Position Fastest Lap Winning Driver Winning Constructor 1 Australian Grand Prix Mika Häkkinen Mika Häkkinen Mika Häkkinen McLaren-Mercedes 2 Brazilian Grand Prix Mika Häkkinen Mika Häkkinen Mika Häkkinen McLaren-Mercedes 3 Argentine Grand Prix David Coulthard Alexander Wurz Michael Schumacher Ferrari 4 San Marino Grand Prix David Coulthard Michael Schumacher David Coulthard McLaren-Mercedes 5 Spanish Grand Prix Mika Häkkinen Mika Häkkinen Mika Häkkinen McLaren-Mercedes 6 Monaco Grand Prix Mika Häkkinen Mika Häkkinen Mika Häkkinen McLaren-Mercedes 7 Canadian Grand Prix David Coulthard Michael Schumacher Michael Schumacher Ferrari 8 French Grand Prix Mika Häkkinen David Coulthard Michael Schumacher Ferrari 9 British Grand Prix Mika Häkkinen Michael Schumacher Michael Schumacher Ferrari 10 Austrian Grand Prix Giancarlo Fisichella David Coulthard Mika Häkkinen McLaren-Mercedes 11 German Grand Prix Mika Häkkinen David Coulthard Mika Häkkinen McLaren- Mercedes 12 Hungarian Grand Prix Mika Häkkinen Michael Schumacher Michael Schumacher Ferrari 13 Belgian Grand Prix Mika Häkkinen Michael Schumacher Damon Hill Jordan-Mugen-Honda 14 Italian Grand Prix Michael Schumacher Mika Häkkinen Michael Schumacher Ferrari 15 Luxembourg Grand Prix Michael Schumacher Mika Häkkinen Mika Häkkinen McLaren-Mercedes 16 Japanese Grand Prix Michael Schumacher Michael Schumacher Mika Häkkinen McLaren-Mercedes === Drivers standings === Pos Driver AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN Points 1 Mika Häkkinen 1 1 2 Ret 1 1 Ret 3 2 1 1 6 Ret 4 1 1 100 2 Michael Schumacher Ret 3 1 2 3 10 1 1 1 3 5 1 Ret 1 2 Ret 86 3 David Coulthard 2 2 6 1 2 Ret Ret 6 Ret 2 2 2 7 Ret 3 3 56 4 Eddie Irvine 4 8 3 3 Ret 3 3 2 3 4 8 Ret Ret 2 4 2 47 5 Jacques Villeneuve 5 7 Ret 4 6 5 10 4 7 6 3 3 Ret Ret 8 6 21 6 Damon Hill 8 DSQ 8 10† Ret 8 Ret Ret Ret 7 4 4 1 6 9 4 20 7 Heinz-Harald Frentzen 3 5 9 5 8 Ret Ret 15† Ret Ret 9 5 4 7 5 5 17 8 Alexander Wurz 7 4 4 Ret 4 Ret 4 5 4 9 11 16† Ret Ret 7 9 17 9 Giancarlo Fisichella Ret 6 7 Ret Ret 2 2 9 5 Ret 7 8 Ret 8 6 8 16 10 Ralf Schumacher Ret Ret Ret 7 11 Ret Ret 16 6 5 6 9 2 3 Ret Ret 14 11 Jean Alesi Ret 9 5 6 10 12† Ret 7 Ret Ret 10 7 3 5 10 7 9 12 Rubens Barrichello Ret Ret 10 Ret 5 Ret 5 10 Ret Ret Ret Ret DNS 10 11 Ret 4 13 Mika Salo Ret Ret Ret 9 Ret 4 Ret 13 Ret Ret 14 Ret DNS Ret 14 Ret 3 14 Pedro Diniz Ret Ret Ret Ret Ret 6 9 14 Ret Ret Ret 11 5 Ret Ret Ret 3 15 Johnny Herbert 6 11† Ret Ret 7 7 Ret 8 Ret 8 Ret 10 Ret Ret Ret 10 1 16 Jarno Trulli Ret Ret 11 Ret 9 Ret Ret Ret Ret 10 12 Ret 6 13 Ret 12† 1 17 Jan Magnussen Ret 10 Ret Ret 12 Ret 6 1 18 Shinji Nakano Ret Ret 13 Ret 14 9 7 17† 8 11 Ret 15 8 Ret 15 Ret 0 19 Esteban Tuero Ret Ret Ret 8 15 Ret Ret Ret Ret Ret 16 Ret Ret 11 NC Ret 0 20 Ricardo Rosset Ret Ret 14 Ret DNQ DNQ 8 Ret Ret 12 DNQ DNQ DNS 12 Ret DNQ 0 21 Toranosuke Takagi Ret Ret 12 Ret 13 11 Ret Ret 9 Ret 13 14 Ret 9 16 Ret 0 22 Olivier Panis 9 Ret 15† 11† 16† Ret Ret 11 Ret Ret 15 12 DNS Ret 12 11 0 23 Jos Verstappen 12 Ret Ret Ret 13 Ret Ret 13 Ret 0 Pos Driver AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN Points Pole position in Bold. Fastest lap in Italics. Driver did not finish the Grand Prix. Driver was classified (ranked) because they finished over 90% of the race. === Constructors standings === Pos Constructor Car no. AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN Points 1 McLaren-Mercedes 7 2 2 6 1 2 Ret Ret 6 Ret 2 2 2 7 Ret 3 3 156 8 1 1 2 Ret 1 1 Ret 3 2 1 1 6 Ret 4 1 1 2 Ferrari 3 Ret 3 1 2 3 10 1 1 1 3 5 1 Ret 1 2 Ret 133 4 4 8 3 3 Ret 3 3 2 3 4 8 Ret Ret 2 4 2 3 Williams-Mecachrome 1 5 7 Ret 4 6 5 10 4 7 6 3 3 Ret Ret 8 6 38 2 3 5 9 5 8 Ret Ret 15 Ret Ret 9 5 4 7 5 5 4 Jordan-Mugen-Honda 9 8 DSQ 8 10 Ret 8 Ret Ret Ret 7 4 4 1 6 9 4 34 10 Ret Ret Ret 7 11 Ret Ret 16 6 5 6 9 2 3 Ret Ret 5 Benetton-Playlife 5 Ret 6 7 Ret Ret 2 2 9 5 Ret 7 8 Ret 8 6 8 33 6 7 4 4 Ret 4 Ret 4 5 4 9 11 16 Ret Ret 7 9 6 Sauber-Petronas 14 Ret 9 5 6 10 12 Ret 7 Ret Ret 10 7 3 5 10 7 10 15 6 11 Ret Ret 7 7 Ret 8 Ret 8 Ret 10 Ret Ret Ret 10 7 Arrows 16 Ret Ret Ret Ret Ret 6 9 14 Ret Ret Ret 11 5 Ret Ret Ret 6 17 Ret Ret Ret 9 Ret 4 Ret 13 Ret Ret 14 Ret DNS Ret 14 Ret 8 Stewart-Ford 18 Ret Ret 10 Ret 5 Ret 5 10 Ret Ret Ret Ret DNS 10 11 Ret 5 19 Ret 10 Ret Ret 12 Ret 6 12 Ret Ret Ret 13 Ret Ret 13 Ret 9 Prost-Peugeot 11 9 Ret 15 11 16 Ret Ret 11 Ret Ret 15 12 DNS Ret 12 11 1 12 Ret Ret 11 Ret 9 Ret Ret Ret Ret 10 12 Ret 6 13 Ret 12 10 Minardi-Ford 22 Ret Ret 13 Ret 14 9 7 17 8 11 Ret 15 8 Ret 15 Ret 0 23 Ret Ret Ret 8 15 Ret Ret Ret Ret Ret 16 Ret Ret 11 NC Ret 11 Tyrrell-Ford 20 Ret Ret 14 Ret DNQ DNQ 8 Ret Ret 12 DNQ DNQ DNS 12 Ret DNQ 0 21 Ret Ret 12 Ret 13 11 Ret Ret 9 Ret 13 14 Ret 9 16 Ret Pos Constructor Car no. AUS BRA ARG SMR ESP MON CAN FRA GBR AUT GER HUN BEL ITA LUX JPN Points Pole position in Bold. Fastest lap in Italics. Car did not finish the Grand Prix. Driver was classified (ranked) because they finished over 90% of the race. Category:Formula One seasons Formula One World Championship",
 "title": "1998 Formula One World Championship"
}