{
 "id": "82416",
 "text": "The 1991 Formula One season was the 42nd edition of the championship. The champion was Ayrton Senna. McLaren won the constructors championship. == Drivers and constructors == Entrant Constructor Chassis Engine Tyre No Driver Rounds Honda Marlboro McLaren McLaren-Honda MP4/6 Honda RA121E 3.5 V12 1 Ayrton Senna All 2 Gerhard Berger All Braun Tyrrell Honda Tyrrell-Honda 020 Honda RA101E 3.5 V10 3 Satoru Nakajima All 4 Stefano Modena All Canon Williams Team Williams-Renault FW14 Renault RS3 3.5 V10 5 Nigel Mansell All 6 Riccardo Patrese All Motor Racing Developments Brabham-Yamaha BT59YBT60Y Yamaha OX99 3.5 V12 7 Martin Brundle All 8 Mark Blundell All Footwork Grand Prix International Footwork-Porsche A11CFA12 Porsche 3512 3.5 V12 9 Michele Alboreto 1–6 10 Alex Caffi 1–4 Stefan Johansson 5–6 Footwork-Ford FA12C 9 Michele Alboreto 7–16 10 Stefan Johansson 7–8 Alex Caffi 9–16 Team Lotus Lotus-Judd 102B Judd EV 3.5 V8 11 Mika Häkkinen All 12 Julian Bailey 1–4 Johnny Herbert Michael Bartels 9–10, 12, 14 Fondmetal Fondmetal-Ford FA1M-EFomet-1 Ford Cosworth DFR 3.5 V8 14 Olivier Grouillard 1–13 Gabriele Tarquini 14–16 Leyton House Racing Leyton House-Ilmor CG911 Ilmor 2175A 3.5 V10 15 Maurício Gugelmin All 16 Ivan Capelli 1–14 Karl Wendlinger 15–16 Automobiles Gonfaronnaises Sportives AGS-Ford JH25JH25BJH27 Ford Cosworth DFR 3.5 V8 17 Gabriele Tarquini 1–13 Olivier Grouillard 14 18 Stefan Johansson 1–2 Fabrizio Barbazza 3–14 Camel Benetton Ford Benetton-Ford B190BB191 Ford HBA4 3.5 V8 Ford HBA5 3.5 V8 19 Roberto Moreno 1–11 12–16 20 Nelson Piquet All Scuderia Italia Dallara-Judd F191 Judd GV 3.5 V10 21 Emanuele Pirro All 22 JJ Lehto All Minardi Team Minardi-Ferrari M191 Ferrari 037 3.5 V12 23 Pierluigi Martini All 24 Gianni Morbidelli 1–15 Roberto Moreno 16 Equipe Ligier Gitanes Ligier-Lamborghini JS35JS35B Lamborghini 3512 3.5 V12 25 Thierry Boutsen All 26 Érik Comas All Scuderia Ferrari Ferrari 642642/2643 Ferrari 037 3.5 V12 27 Alain Prost 1–15 Gianni Morbidelli 16 28 Jean Alesi All Larrousse F1 Lola-Ford LC91 Ford Cosworth DFR 3.5 V8 29 Éric Bernard 1–15 Bertrand Gachot 16 30 Aguri Suzuki All Coloni Racing Coloni-Ford C4 Ford Cosworth DFR 3.5 V8 31 Pedro Chaves 1–13 Naoki Hattori 15–16 Team 7Up Jordan Jordan-Ford 191 Ford HBA4 3.5 V8 32 Bertrand Gachot 1–10 Michael Schumacher 11 Roberto Moreno 12–13 Alessandro Zanardi 14–16 33 Andrea de Cesaris All Modena Team 291 Lamborghini 3512 3.5 V12 34 Nicola Larini All 35 Eric van de Poele All Category:Formula One seasons Category:1991 in sports",
 "title": "1991 Formula One World Championship"
}