{
 "id": "82418",
 "text": "The 1950 Formula One season was the first edition of the championship. The champion was Giussepe Farina in a close battle. == Grands Prix == Rnd Race Circuit Date Pole position Fastest lap Winning driver Constructor Tyre Report 1 British Grand Prix Silverstone 13 May Giuseppe Farina Giuseppe Farina Giuseppe Farina Alfa Romeo Report 2 Monaco Grand Prix Monaco 21 May Juan Manuel Fangio Juan Manuel Fangio Juan Manuel Fangio Alfa Romeo Report 3 Indianapolis 500 Indianapolis 30 May Walt Faulkner Johnnie Parsons Johnnie Parsons Kurtis Kraft-Offenhauser Report 4 Swiss Grand Prix Bremgarten 4 June Juan Manuel Fangio Giuseppe Farina Giuseppe Farina Alfa Romeo Report 5 Belgian Grand Prix Spa-Francorchamps 18 June Giuseppe Farina Giuseppe Farina Juan Manuel Fangio Alfa Romeo Report 6 French Grand Prix Reims-Gueux 2 July Juan Manuel Fangio Juan Manuel Fangio Juan Manuel Fangio Alfa Romeo Report 7 Italian Grand Prix Monza 3 September Juan Manuel Fangio Juan Manuel Fangio Giuseppe Farina Alfa Romeo Report : The Indianapolis 500 was AAA-sanctioned and not run to Formula One regulations. It also counted towards the 1950 AAA Championship Car season. ==Teams and drivers== The following teams and drivers competed in the 1950 FIA World Championship of Drivers. Entrant Constructor Chassis Engine Tyre Driver Rounds Alfa Romeo SpA Alfa Romeo 158 159 Alfa Romeo 158 1.5 L8s Juan Manuel Fangio 1–2, 4–7 Giuseppe Farina 1–2, 4–7 Luigi Fagioli 1–2, 4–7 Reg Parnell 1 Consalvo Sanesi 7 Piero Taruffi 7 Scuderia Ambrosiana Maserati 4CLT/48 Maserati 4CLT 1.5 L4s David Murray 1, 7 David Hampshire 1, 6 Reg Parnell 6 T.A.S.O. Mathieson ERA E ERA 1.5 L6s Leslie Johnson 1 Peter Walker ERA E ERA 1.5 L6s Peter Walker 1 Tony Rolt 1 Joe Fry Maserati 4CL Maserati 4CL 1.5 L4s Joe Fry 1 Brian Shawe-Taylor 1 Cuth Harrison ERA B ERA 1.5 L6s Cuth Harrison 1–2, 7 Bob Gerard ERA B A ERA 1.5 L6s Bob Gerard 1–2 Automobiles Talbot-Darracq Talbot-Lago T26C-DA T26C T26C-GS Talbot 23CV 4.5 L6 Yves Giraud-Cabantous 1, 4–6 Louis Rosier 1, 4–6 Philippe Étancelin 1, 5 Eugène Martin 1, 4 Raymond Sommer 6 Ecurie Belge Talbot-Lago T26C Talbot 23CV 4.5 L6 Johnny Claes 1–2, 4–7 Officine Alfieri Maserati Maserati 4CLT/48 Maserati 4CLT 1.5 L4s Louis Chiron 1–2, 4, 6–7 Franco Rol 2, 6–7 Enrico Platé Maserati 4CLT/48 Maserati 4CLT 1.5 L4s Toulo de Graffenried 1–2, 4, 7 Birabongse Bhanudej 1–2, 4, 7 Joe Kelly Alta GP Alta 1.5 L4s Joe Kelly 1 Geoffrey Crossley Alta GP Alta 1.5 L4s Geoffrey Crossley 1, 5 Scuderia Achille Varzi Maserati 4CLT/48 4CL Maserati 4CLT 1.5 L4s Maserati 4CL 1.5 L4s José Froilán González 2, 6 Alfredo Pián 2 Nello Pagani 4 Toni Branca 4 Horschell Racing Corporation Cooper-JAP T12 JAP 1.1 V2 Harry Schell 2 Equipe Gordini Simca-Gordini T15 Simca-Gordini 15C 1.5 L4s Robert Manzon 2, 6–7 Maurice Trintignant 2, 7 Philippe Étancelin Talbot-Lago T26C T26C-DA Talbot 23CV 4.5 L6 Philippe Étancelin 2, 4, 6–7 Eugène Chaboud 6 Ecurie Rosier Talbot-Lago T26C T26C-GS Talbot 23CV 4.5 L6 Louis Rosier 2, 7 Henri Louveau 7 Peter Whitehead Ferrari 125 Ferrari 125 F1 1.5 V12s Peter Whitehead 2, 6–7 Scuderia Ferrari Ferrari 125 166F2-50 275 375 Ferrari 125 F1 1.5 V12s Ferrari 166 F2 2.0 V12 Ferrari 275 F1 3.3 V12 Ferrari 375 F1 4.5 V12 Luigi Villoresi 2, 4–5 Alberto Ascari 2, 4–5, 7 Raymond Sommer 2, 4 Dorino Serafini 7 Scuderia Milano Maserati-Speluzzi 4CLT/50 Speluzzi 1.5 L4 Felice Bonetto 4, 6 Franco Comotti 7 Milano-Speluzzi 1 Felice Bonetto 7 Ecurie Bleue Talbot-Lago T26C Talbot 23CV 4.5 L6 Harry Schell 4 Pierre Levegh Talbot-Lago T26C Talbot 23CV 4.5 L6 Pierre Levegh 5–7 Raymond Sommer Talbot-Lago T26C Talbot 23CV 4.5 L6 Raymond Sommer 5, 7 Ecurie Lutetia Talbot-Lago T26C-DA Talbot 23CV 4.5 L6 Eugène Chaboud 5–6 Antonio Branca Maserati 4CL Maserati 4CL 1.5 L4s Toni Branca 5 Charles Pozzi Talbot-Lago T26C Talbot 23CV 4.5 L6 Charles Pozzi 6 Charles Pozzi Talbot-Lago T26C Talbot 23CV 4.5 L6 Louis Rosier 6 Clemente Biondetti Ferrari-Jaguar 166S Jaguar XK 3.4 L6 Clemente Biondetti 7 Paul Pietsch Maserati 4CLT/48 Maserati 4CLT 1.5 L4s Paul Pietsch 7 Guy Mairesse Talbot-Lago T26C Talbot 23CV 4.5 L6 Guy Mairesse 7 ==1950 Drivers Championship final standings== {| class=\"wikitable\" style=\"font-size: 85%; text-align:center;\" Pos. Driver GBR MON 500 SUI BEL FRA ITA Pts. 1 Giuseppe Farina 1 Ret 1 4 7 1 30 2 Juan Manuel Fangio Ret 1 Ret 1 1 Ret / Ret 27 3 Luigi Fagioli 2 Ret 2 2 2 (3) 24 (28) 4 Louis Rosier 5 Ret 3 3 6† 4 13 5 Alberto Ascari 2 Ret 5 DNS 2† 11 6 Johnnie Parsons 1 9 7 Bill Holland 2 6 8 Birabongse Bhanudej Ret 5 4 Ret 5 9 Peter Whitehead DNS 3 7 4 = Louis Chiron Ret 3 9 Ret Ret 4 = Reg Parnell 3 Ret 4 = Mauri Rose 3 4 13 Dorino Serafini 2† 3 = Yves Giraud-Cabantous 4 Ret Ret 8 3 = Raymond Sommer 4 Ret Ret Ret Ret 3 = Robert Manzon Ret 4 Ret 3 = Cecil Green 4 3 = Philippe Étancelin 8 Ret Ret Ret 5† 5 3 19 Felice Bonetto 5 Ret DNS 2 20 Eugène Chaboud Ret 5† 1 = Joie Chitwood 5† 1 = Tony Bettenhausen 5† 1 — Toulo de Graffenried Ret Ret 6 6 0 — Bob Gerard 6 6 0 — Luigi Villoresi Ret Ret 6 DNS 0 — Lee Wallard 6 0 — Charles Pozzi 6† 0 — Johnny Claes 11 7 10 8 Ret Ret 0 — Cuth Harrison 7 Ret Ret 0 — Pierre Levegh 7 Ret Ret 0 — Walt Faulkner 7 0 — Nello Pagani 7 0 — Harry Schell Ret 8 0 — George Connor 8 0 — Geoffrey Crossley Ret 9 0 — David Hampshire 9 Ret 0 — Paul Russo 9 0 — Toni Branca 11 10 0 — Pat Flaherty 10 0 — Brian Shawe-Taylor 10† 0 — Joe Fry 10† 0 — Myron Fohr 11 0 — Duane Carter 12 0 — Mack Hellings 13 0 — Jack McGrath 14 0 — Troy Ruttman 15 0 — Gene Hartley 16 0 — Jimmy Davies 17 0 — Johnny McDowell 18 0 — Walt Brown 19 0 — Spider Webb 20 0 — Jerry Hoyt 21 0 — Walt Ader 22 0 — Jackie Holmes 23 0 — Jim Rathmann 24 0 — Joe Kelly NC 0 — Franco Rol Ret Ret Ret 0 — Eugène Martin Ret Ret 0 — José Froilán González Ret Ret 0 — David Murray Ret Ret 0 — Maurice Trintignant Ret Ret 0 — Leslie Johnson Ret 0 — Peter Walker Ret† 0 — Tony Rolt Ret† 0 — Henry Banks Ret 0 — Bill Schindler Ret 0 — Fred Agabashian Ret 0 — Jimmy Jackson Ret 0 — Sam Hanks Ret 0 — Dick Rathmann Ret 0 — Duke Dinsmore Ret 0 — Bayliss Levrett Ret† 0 — Bill Cantrell Ret† 0 — Guy Mairesse Ret 0 — Paul Pietsch Ret 0 — Clemente Biondetti Ret 0 — Henri Louveau Ret 0 — Franco Comotti Ret 0 — Consalvo Sanesi Ret 0 — Piero Taruffi Ret† 0 — Alfredo Pián DNS 0 Pos. Driver GBR MON 500 SUI BEL FRA ITA Pts. * Italics indicate fastest lap (1 point awarded) * Bold indicates pole position * † Position shared between more drivers of the same car ==Non- Championship race results== Other Formula One races, which did not count towards the World Championship, also held in 1950. Race Name Circuit Date Winning driver Constructor Report XI Pau Grand Prix Pau April 10 Juan Manuel Fangio Maserati Report II Richmond Trophy Goodwood April 10 Reg Parnell Maserati Report V San Remo Grand Prix Sanremo April 16 Juan Manuel Fangio Alfa Romeo Report IV Grand Prix de Paris Paris April 30 Georges Grignard Talbot- Lago Report XII British Empire Trophy Douglas June 15 Bob Gerard ERA Report IV Gran Premio di Bari Bari July 9 Nino Farina Alfa Romeo Report IV J.C.C. Jersey Road Race Jersey July 13 Peter Whitehead Ferrari Report XII Circuit de l'Albigeois Albi July 16 Louis Rosier Talbot-Lago Report I Grote Prijs van Nederland Zandvoort July 23 Louis Rosier Talbot-Lago Report III Grand Prix des Nations Geneve July 30 Juan Manuel Fangio Alfa Romeo Report I Nottingham Trophy Gamston August 7 David Hampshire Maserati Report IV Ulster Trophy Dundrod August 12 Peter Whitehead Ferrari Report XIX Coppa Acerbo Pescara August 15 Juan Manuel Fangio Alfa Romeo Report I Sheffield Telegraph Trophy Gamston August 19 Cuth Harrison ERA Report II BRDC International Trophy Silverstone August 26 Nino Farina Alfa Romeo Report III Goodwood Trophy Goodwood September 30 Reg Parnell BRM Report X Gran Premio de Penya Rhin Pedralbes October 29 Alberto Ascari Ferrari Report Category:Formula One seasons Category:1950 in sports",
 "title": "1950 Formula One season"
}