{
 "id": "824259",
 "text": "Mahmoud Refaat (; born April 25, 1978) is an expert in international law, foreign policy advisor (president of European Institute for International Law and International Relations) and writer (a member of the British Association of Journalists – BAJ and the American National Writers Union – NWR in New York) and chairman of the International Gazette daily newspaper based in London, United Kingdom. He is a French-Belgian citizen of Egyptian origin residing between France, Belgium, and the United Kingdom. Mahmoud Refaat led the presidential campaign of former Egyptian army chief of staff Lieutenant General Sami Anan from abroad and played a role in covering all the international media news of the arrest of General Sami Anan, which he explained in several televised meetings that he did so for fear of assassination of Lieutenant General Sami Anan. He then played a role again by questioning international circles in the presidential elections won by Egyptian President Abdel Fattah el-Sisi in the second round in March 2018, and sparked an international outcry two months later, accusing the Egyptian regime of El-Sisi of trying to assassinate General Sami Anan after the sudden health collapse, that hit him in his prison in summer 2018. == Peace activities == Mahmoud Refaathttps://www.saudi24news.com/2020/03/an-international-lawyer-reveals-that-mohammed-bin-zayed-was-behind-the-arrest-of-the-saudi-princes-after-leaking-this-information.html and former Libyan Prime Minister Omar al-Hassi founded The International action group for peace in Libya and he took over the position of General Coordinator, which was launched from the Tunisian capital at a press conference on 12 May 2018 in the presence of a number of the European Parliament and received extensive media coverage. He also played a role in the Yemenihttps://yemen-now.net/news6266336.html affairs at the international level to urge the international community to ensure the delivery of food and medical aids to civilians, especially those trapped and victims of the Saudi-Emirati bombing and announced that President Abd Rabbu Mansour Hadi must be brought to the International Criminal Court. == The International Action Group for Peace in Libya == The International action group for peace in Libya was founded in May 2018 by the former prime minister of Libya, Mr Omar al-Hassi and Dr. Mahmoud Refaat with numerous international personalities from Europe and the international community. Mr Omar al-Hassi is the president and Mahmoud Refaat is the general coordinator of the International action group for peace in Libya. The International Peace Action Group in Libya was founded by Mr. Omar al-Hassi and Mahmoud Refaat through the Middle East and Mediterranean peace Research Institute(MEMPRI) with objectives of helping civilians to avoid results of the War in Libya and also to communicate with the International Community to find the exit of the Civil war led by Haftar and supported by Saudi Arabia and United Arab Emirates. == The Humanitarian Action Group for Yemen == In March 2019, Mahmoud Refaat created The Humanitarian Action Group for Yemenhttps://voice-yemen.net/new/205064 through the European Institute for International Law and International Relations intending to ensure food and medical equipment to civilians in Yemen who are surrounded by the coalition of Saudi Arabia and United Arab Emirates also to work close to the International Community to put an end to the war in Yemen and sue the actors of Yemeni war. The Humanitarian Action Group for Yemen has been urging the International Criminal Court and the International Community to follow war criminals in Yemen, in particular, after several reports from United Nations bodies describe Yemen as worst crises on the earth because of the illegitimate war led by Saudi Arabia and United Arab Emirates on Yemen. Earlier 2019, Mahmoud Refaat announced Mohammad bin Salman and Mohammed bin Zayed Al Nahyan must be trailed as war criminals for their rule of crises in Yemen which left thousands of civilians as victims of starvation, cholera epidemic apart civilians who were killed by the bombing of Saudi-Emirati coalition. == References == == Other websites == * The European Institute for International Law and International Relations – Official website of The European Institute for International Law and International Relations * Mahmoud Refaat | The Telegraph * Mahmoud Refaat | Vice News * Mahmoud Refaat | Middle East Monitor Category:Living people Category:Belgian politicians Category:French politicians Category:French lawyers Category:1987 births Category:People from Cairo",
 "title": "Mahmoud Refaat"
}