{
 "id": "824264",
 "text": "Natalia Liane den Haan (born 24 August 1967) is a Dutch independent politician. She was party leader of 50PLUS (50+) from October 2020 to May 2021, as successor of Henk Krol.50Plus kiest voor Liane den Haan als lijsttrekker, weer na interne onrust, Algemeen Dagblad, 3 October 2020 She studied nursing, worked at a hospital, studied in the evening business administration and was a catering and party service business operative.Alles over Liane den Haan: lijsttrekker van 50Plus, DeMediaGids.nl, 11 November 2020 Thereafter, she focused on leading jobs and has held various leading positions since then. De Haan was heading senior citizen organisation ANBO from 2005 to 2020. Besides, she was a member of the socio-economic council SER from 2009 to 2013 and from 2018 to 2019, a member of the board of civil servants personnel organisation ACOP from 2012 to 2018, and also director of LGBT organisation COC Nederland. Born in Woerden, she was councillor of this municipality in the province of Utrecht from 2006 to 2010, until 2007 for Democrats 66 (D66), and afterwards for the Labour Party (PvdA) in Progressief Woerden.She was called Liane Wubbels(-den Haan) in those days.Afscheid oude Raad en installatie nieuwe Raad, D66 Woerden She was a member of 50+ from August 2020 to May 2021 and leaded the party into the 2021 Dutch general election in March 2021. 50+ gained one seat, so she has been both parliamentary group leader and an MP since March 2021. Because of serious disagreements with the party executive committee, she left 50+ on 6 May 2021 and continues as an independent MP.Liane den Haan verlaat 50PLUS, en neemt haar Kamerzetel mee, Trouw, 6 May 2021 De Haan is divorced with three children and still lives in Woerden. == References == * Biography on Parlement.com == Other websites == * De Haan on the 50PLUS website Category:1967 births Category:Living people Category:Democrats 66 politicians Category:Dutch LGBT rights activists Category:Dutch councillors Category:Independent politicians in the Netherlands Category:Labour Party (Netherlands) politicians Category:Leaders of political parties in the Netherlands Category:Members of the House of Representatives of the Netherlands Category:Politicians from Utrecht (province)",
 "title": "Liane den Haan"
}