{
 "id": "82420",
 "text": "The 1952 Formula One season was the third of the championship. The champion was Alberto Ascari in a close battle. ==World Championship season review== Rnd Race Date Location Winning driver Constructor Tyres Report 1 Swiss Grand Prix May 18 Bremgarten Piero Taruffi Ferrari Report 2 Indianapolis 500 May 30 Indianapolis Troy Ruttman Kuzma-Offenhauser Report 3 Belgian Grand Prix June 22 Spa-Francorchamps Alberto Ascari Ferrari Report 4 French Grand Prix July 6 Rouen-Les-Essarts Alberto Ascari Ferrari Report 5 British Grand Prix July 19 Silverstone Alberto Ascari Ferrari Report 6 German Grand Prix August 3 Nürburgring Alberto Ascari Ferrari Report 7 Dutch Grand Prix August 17 Zandvoort Alberto Ascari Ferrari Report 8 Italian Grand Prix September 7 Monza Alberto Ascari Ferrari Report ==1952 Drivers Championship final standings== {| class=\"wikitable\" style=\"font-size: 85%\" Pos. Driver SUI 500 BEL FRA GBR GER NED ITA Pts. 1 Alberto Ascari Ret 1* 1* 1* 1* 1* 1** 36 (53.5) 2 Nino Farina Ret / Ret† 2 2 6 2 2 4 24 (27) 3 Piero Taruffi 1* Ret 3 2 4 7 22 4 Rudi Fischer 2 11† 13 3 Ret 10 5 Mike Hawthorn 4 Ret 3 4 Ret 10 6 Robert Manzon Ret 3 4 Ret Ret 5 14 9 7 Troy Ruttman 1 8 8 Luigi Villoresi 3 3 8 9 José Froilán González 2** 6.5 10 Jim Rathmann 2 6 11 Jean Behra 3 Ret 7 5 Ret Ret 6 12 Sam Hanks 3 4 13 Ken Wharton 4 Ret Ret 9 3 14 Dennis Poore 4 12 3 15 Duane Carter 4 3 16 Alan Brown 5 6 22 15 2 17 Maurice Trintignant 5 Ret Ret 6 Ret 2 18 Paul Frère 5 Ret Ret 2 19 Felice Bonetto Ret 5 2 20 Art Cross 5 2 21 Eric Thompson 5 2 22 Bill Vukovich 17* 1 23 Roger Laurent 12 6 0 24 Toulo de Graffenried 6 Ret† 19 DNQ 0 25 Peter Collins Ret Ret 6 Ret DNQ 0 26 Andre Simon Ret† 6 0 27 Jimmy Bryan 6 0 28 Peter Hirt 7 11† 0 29 Charles de Tornaco 7 Ret DNQ 0 30 Duncan Hamilton Ret 7 0 31 Jimmy Reece 7 0 32 Reg Parnell 7 0 33 Fritz Riess 7 0 34 Lance Macklin WD 11 9 15 8 DNQ 0 35 Eric Brandon 8 9 20 13 0 36 Chico Landi 9† 8 0 37 Johnny Claes 8 Ret 14 10 DNQ 0 38 Toni Ulmen Ret 8 0 39 George Connor 8 0 40 Philippe Etancelin 8 0 41 Roy Salvadori 8 0 42 Ken Downing 9 Ret 0 43 Cliff Griffith 9 0 44 Helmut Niedermayr 9 0 45 Jan Flinterman 9† 0 46 Prince Bira Ret 10 Ret 11 0 47 Louis Rosier Ret Ret Ret 10 0 48 Peter Whitehead Ret 10 DNQ 0 49 Johnnie Parsons 10 0 50 Yves Giraud Cabantous 10 0 51 Eitel Cantoni Ret Ret 11 0 52 Jack McGrath 11 0 53 Hans Klenk 11 0 54 Jim Rigsby 12 0 55 Franco Comotti 12 0 56 Graham Whitehead 12 0 57 Ernst Klodwig 12 0 58 Joe James 13 0 59 Bill Schindler 14 0 60 Robert O'Brien 14 0 61 Tony Gaze 15 Ret Ret DNQ 0 62 George Fonder 15 0 63 Kenneth McAlpine 16 Ret 0 64 Eddie Johnson 16 0 65 Harry Schell Ret Ret† 17 0 66 Gino Bianco 18 Ret Ret Ret 0 67 Chuck Stevenson 18 0 68 Henry Banks 19 0 69 Manny Ayulo 20 0 70 Johnny McDowell 21 0 71 Tony Crook 21 0 — Stirling Moss WD Ret Ret Ret Ret 0 — Piero Carini Ret Ret 0 — Bill Aston DNS Ret DNQ 0 — Hans Stuck Ret DNQ 0 — George Abecassis Ret 0 — Max de Terra Ret 0 — Spider Webb Ret 0 — Rodger Ward Ret 0 — Tony Bettenhausen Ret 0 — Duke Nalon Ret 0 — Fred Agabashian Ret 0 — Bob Sweikert Ret 0 — Gene Hartley Ret 0 — Bob Scott Ret 0 — Chet Miller Ret 0 — Bobby Ball Ret 0 — Andy Linden Ret 0 — Robin Montgomerie-Charrington Ret 0 — David Murray Ret 0 — Willi Heeks Ret 0 — Adolf Brudes Ret 0 — Marcel Balsa Ret 0 — Bernd Nacke Ret 0 — Rudolf Krause Ret 0 — Rudolf Schoeller Ret 0 — Paul Pietsch Ret 0 — Theo Helfrich Ret 0 — Josef Peters Ret 0 — Dries van der Lof Ret 0 — Franco Rol Ret 0 — Elie Bayol Ret 0 — Alberto Crespo DNQ 0 — Piero Dusio DNQ 0 Pos. Driver SUI 500 BEL FRA GBR GER NED ITA Pts. * * Fastest lap (1 point awarded) * ** Multiple drivers set equal fastest lap times, thus sharing the 1 point. * † Position shared between more drivers of the same car * Only the best 4 results counted towards the Championship. Numbers without parentheses are Championship points; numbers in parentheses are total points scored. ==Non-Championship race results== Formula One/Two Grand Prix races, which did not count towards the World Championship, also held in 1952. Race Name Circuit Date Winning driver Constructor Report XI Grande Prêmio Cidade do Rio de Janeiro Gávea January 20 José Froilán González Ferrari Report II Gran Premio di Siracusa Syracuse March 16 Alberto Ascari Ferrari Report VI Gran Premio del Valentino Valentino Park April 6 Luigi Villoresi Ferrari Report IV Richmond Trophy Goodwood April 14 José Froilán González Ferrari Report IV Lavant Cup Goodwood April 14 Mike Hawthorn Cooper- Bristol Report XIII Grand Prix de Pau Pau April 14 Alberto Ascari Ferrari Report I Ibsley Grand Prix Ringwood April 19 Mike Hawthorn Cooper-Bristol Report X Grand Prix de Marseille Marseille April 27 Alberto Ascari Ferrari Report IV BRDC International Trophy Silverstone May 10 Lance Macklin HWM-Alta Report XIV Eläintarhanajot Eläintarha May 11 Roger Laurent Talbot-Lago Report V Gran Premio di Napoli Posillipo May 11 Giuseppe Farina Ferrari Report XVI Internationales ADAC Eifelrennen Nürburgring May 25 Rudi Fischer Ferrari Report VI Grand Prix de Paris Montlhéry May 25 Piero Taruffi Ferrari Report XIV Grand Prix de l'Albigeois Albi June 1 Louis Rosier Ferrari Report XXII Grand Prix des Frontières Chimay June 1 Paul Frère HWM-Alta Report VI Ulster Trophy Dundrod June 7 Piero Taruffi Ferrari Report V Gran Premio dell'Autodromo di Monza Monza June 8 Giuseppe Farina Ferrari Report IV Circuit du Lac Aix-les-Bains June 8 Jean Behra Gordini Report I West Essex CC Race Boreham June 21 Reg Parnell Cooper-Bristol Report XX Grand Prix de la Marne Reims June 29 Jean Behra Gordini Report II Grand Prix de Sables d'Olonne Sables July 13 Luigi Villoresi Ferrari Report I Grand Prix de Caen Caen July 27 Maurice Trintignant Gordini Report II Daily Mail Trophy Boreham August 2 Luigi Villoresi Ferrari Report XVI Grand Prix de Comminges Comminges August 10 André Simon Ferrari Report I National Trophy Turnberry August 23 Mike Hawthorn Connaught Report XI Grand Prix de la Baule La Baule August 24 Alberto Ascari Ferrari Report III Gran Premio di Modena Modena September 14 Luigi Villoresi Ferrari Report IV Circuit de Cadours Cadours September 14 Louis Rosier Ferrari Report V Madgwick Cup Goodwood September 27 Ken Downing Connaught Report VIII Internationales Avusrennen AVUS September 28 Rudi Fischer Ferrari Report Joe Fry Memorial Trophy Castle Combe October 4 Roy Salvadori Ferrari Report I Newcastle Journal Trophy Charterhall October 11 Dennis Poore Connaught Report XII Grande Prémio da Cidade de Rio de Janeiro Gávea December 14 Henrique Casini Ferrari Report Category:Formula One seasons Category:Formula Two Category:1952 in sports",
 "title": "1952 Formula One season"
}