{
 "id": "824201",
 "text": "List of programs currently and formerly produced by ABC Signature, which previously used the name Touchstone Television and ABC Studios. == Former productions == === Touchstone Television (1985–2007) === Title Year Network Co-production company(s) Notes 8 Simple Rules for Dating My Teenage Daughter 2002–05 ABC Shady Acres Entertainment, Flody Co., (2002–2004; seasons 1–2) and Tracy Gamble Productions (2004; season 2) 10-8: Officers on Duty 2003–04 ABC Spelling Television and Badlands Entertainment Alias 2001–06 ABC Bad Robot Productions All-American Girl 1994–95 ABC Sandollar Television and Heartfelt Productions Bakersfield P.D. 1993–94 Fox Rock Island Productions The Beast 2001 ABC Imagine Television Blossom 1990–95 NBC Impact Zone Productions and Witt/Thomas Productions Bob Patterson 2001 ABC Angel Ark Productions and 20th Century Fox Television Boy Meets World 1993–2000 ABC Michael Jacobs Productions Bringing up Jack 1995 ABC Brotherly Love 1995–96 NBC/The WB Witt/Thomas Productions Touchstone Television (Season 1) Walt Disney Television (Season 2) Brutally Normal 2000 The WB The Shephard/Robin Company Buddies 1996 ABC Wind Dancer Production Group Carol & Company 1990 NBC Wind Dancer Productions and Kalola Productions Clerks: The Animated Series 2000 ABC Miramax Television, View Askew Productions and Woltz International Pictures Corporation Clone High 2002–03 MTV Doozer Productions, Lord Miller Productions, Nelvana and MTV Costello 1998 Fox Wind Dancer Production Group Cutters 1993 CBS Grant/Tribune Productions Daddio 2000 NBC Big Fan Dangerous Minds 1996–97 ABC Predawn Productions and Don Simpson/Jerry Bruckheimer Films Down and Out in Beverly Hills 1987 Fox Ellen 1994–98 ABC The Black/Marlens Company The Ellen Burstyn Show 1986 ABC Empire 2005 ABC miniseries Empty Nest 1988–95 NBC Witt/Thomas/Harris Productions The Fanelli Boys 1990–91 NBC KTMB Felicity 1998–02 The WB Imagine Television co-production The Geena Davis Show 2000–01 ABC Wass/Stein The George Wendt Show 1995 CBS The Cloudland Company Gideon's Crossing 2000–01 ABC Heel and Toe Films Go Fish 2001 NBC Wass/Stein The Golden Girls 1985–92 NBC Witt/Thomas/Harris Productions The Golden Palace 1992–93 CBS Witt/Thomas/Harris Productions Good & Evil 1991 ABC Witt/Thomas/Harris Productions The Good Life 1994 NBC Interbang, Inc. Hard Time on Planet Earth 1989 CBS Demos-Bard/Shanachie Productions Hardball 1994 Fox Interbang, Inc. Harry 1987 Fox Heartland 1989 CBS Impact Zone Productions and Witt/Thomas Productions Herman's Head 1991–94 Fox Witt/Thomas Productions Hiller and Diller 1997–98 ABC Imagine Television Home Improvement 1991–99 ABC Wind Dancer Productions Homeboys In Outer Space 1996–97 UPN Sweet Lorraine Productions Hope & Faith 2003–06 ABC Industry Entertainment Hull High 1990–91 NBC Gil Grant Productions If Not for You 1995 CBS Rock Island Productions Imagine That 2002 NBC Seth Kurland Productions and Columbia TriStar Television In Case of Emergency 2007 ABC Bushwhacker Productions and Howard J. Morris Productions In Justice 2006 ABC King Size Productions In the Game 2004 ABC unaired pilot Inconceivable 2005 NBC It's All Relative 2003–04 ABC Storyline Entertainment, Naturally Blond Productions and Paramount Network Television The Job 2001–02 ABC Apostle Productions, The Cloudland Company and DreamWorks Television Kevin Hill 2004–05 UPN Icon Productions Kingdom Hospital 2004 ABC Sony Pictures Television and Mark Carliner Productions The Knights of Prosperity 2007 ABC B&B; Productions and Worldwide Pants Incorporated Laurie Hill 1992 ABC The Black/Marlens Company Lenny 1990–91 CBS Impact Zone Productions and Witt/Thomas Productions Less than Perfect 2002–06 ABC Wass/Stein Productions Life as We Know It 2004–05 ABC Sachs/Judah Productions and Cabloom! Productions Life with Bonnie 2002–04 ABC Bob & Alice Productions Life's Work 1996–97 ABC Weest, Inc. Line of Fire 2003–04 ABC Battle Plan Productions and DreamWorks Television Little House on the Prairie 2005 ABC Lost at Home 2003 ABC Michael Jacobs Productions and NBC Studios Madigan Men 2000 ABC Chupack Productions and Artists Television Group Mama's Boy 1987–88 NBC Witt/Thomas/Harris Productions Maybe It's Me 2001–02 The WB SamJen Productions and Warner Bros. Television Maybe This Time 1995–96 ABC Michael Jacobs Productions MDs 2002 ABC Miracles 2003 ABC David Greenwalt Productions and Spyglass Entertainment Misery Loves Company 1995 Fox Michael Jacobs Productions Monk 2002–09 USA Mandeville Films and Universal Cable Productions final surviving series to carry the Touchstone Television logo Monty 1994 Fox Fair Dinkum Productions and Reserve Room Productions The Muppets' Wizard of Oz 2005 ABC The Jim Henson Company and Fox Television Studios My Wife and Kids 2001–05 ABC Wayans Bros. Entertainment and Impact Zone Productions Night Stalker 2005–06 ABC Big Light Productions Nowhere Man 1995–96 UPN Lawrence Hertzog Productions Nurses 1991–94 NBC Witt/Thomas/Harris Productions The Nutt House 1989 NBC Brooksfilms Television and Alan Spencer Productions The Oldest Rookie 1987–88 CBS Gil Grant Productions and Chapman Productions Once and Again 1999–02 ABC Bedford Falls Productions Pacific Station 1991–92 NBC The PJs 1999–2001 Fox/The WB Imagine Television, The Murphy Company, and Will Vinton Studios Playmakers 2003 ESPN Thanksgiving Day, Imagine Television and Orly Adelson Productions produced as/on behalf of ESPN Popular 1999–2001 The WB Ryan Murphy Productions, Roundtable Ink and The Shephard/Robin Company Pride & Joy 1995 NBC Regular Joe 2003 ABC Push, Nevada 2002 ABC Rodney 2004–06 ABC Romy and Michele: In the Beginning 2005 ABC Family The Secret Lives of Men 1998 ABC Witt/Thomas Productions The Sinbad Show 1993–94 Fox Michael Jacobs Productions, David & Goliath Productions and Gary Murphy-Larry Strawther Productions Singer & Sons 1990 NBC Michael Jacobs Productions Six Degrees 2006–07 ABC Nosebleed Productions Social Studies 1997 UPN Film Fatale Inc. and Sandollar Television Someone Like Me 1994 NBC Sandollar Television and Mohawk Productions Soul Man 1997–98 ABC Wind Dancer Production Group Sports Night 1998–2000 ABC Imagine Television Stat 1991 ABC Tetagram, Ltd. Style & Substance 1998 CBS The Cloudland Company Teen Angel 1997–1998 ABC Spooky Magic Productions Thanks 1999 CBS Mauretenia Productions That Was Then 2002 ABC Brookline Productions and Lemonade Stand Productions Threat Matrix 2003–04 ABC Industry Entertainment Tilt 2005 ESPN Three Moons Over Milford 2006 ABC Family Thunder Alley 1994–95 ABC Wind Dancer Production Group The Trouble with Normal 2000 ABC Garfield Grove Productions and Paramount Television Unhappily Ever After 1995–99 The WB Veritas: The Quest 2003 ABC Massett/Zinman Productions Walter & Emily 1991–92 NBC The Wayne Brady Show 2001–02 Syndication Brad Grey and Don Mischer Wednesday 9:30 (8:30 Central) 2002 ABC The Cloudland Company Where I Live 1993 ABC What About Brian 2006–07 ABC Bad Robot Productions and Sachs/Judah Productions (season 1) Wildside 1985 ABC Tom Greene Productions Inc. Wonderland 2000 ABC Woops! 1992 Fox Heartfelt Productions and Witt/Thomas Productions You Wish 1997–98 ABC Zoe, Duncan, Jack and Jane 1999–2000 The WB Michael Jacobs Productions == References == Category:Lists of television series by network",
 "title": "List of programs produced by ABC Signature"
}