{
 "id": "82422",
 "text": "The 1954 Formula One season was the 5th edition of the championship. The champion was Juan Manuel Fangio in a close battle. ==Season review== Rd Race Date Location Winning driver Constructor Report 1 Argentine Grand Prix January 17 Oscar Gálvez Juan Manuel Fangio Maserati Report 2 Indianapolis 500 May 31 Indianapolis Bill Vukovich Kurtis Kraft-Offenhauser Report 3 Belgian Grand Prix June 20 Spa-Francorchamps Juan Manuel Fangio Maserati Report 4 French Grand Prix July 4 Reims Juan Manuel Fangio Mercedes Report 5 British Grand Prix July 17 Silverstone José Froilán González Ferrari Report 6 German Grand Prix August 1 Nürburgring Juan Manuel Fangio Mercedes Report 7 Swiss Grand Prix August 22 Bremgarten Juan Manuel Fangio Mercedes Report 8 Italian Grand Prix September 5 Monza Juan Manuel Fangio Mercedes Report 9 Spanish Grand Prix October 24 Pedralbes Mike Hawthorn Ferrari Report ==1954 Drivers Championship final standings== {| class=\"wikitable\" style=\"font-size: 85%\" Pos. Driver ARG 500‡ BEL FRA GBR GER SUI ITA ESP Pts. 1 Juan Manuel Fangio 1 1* 1 4** 1 1* 1 3 42 (57.14) 2 José Froilán González 3* 4† Ret 1** 2† 2* 3† / Ret 25.14 (26.64) 3 Mike Hawthorn DSQ 4† Ret 2** 2† Ret 2 1 24.64 4 Maurice Trintignant 4 2 Ret 5 3 Ret 5 Ret 17 5 Karl Kling 2 7 4* Ret Ret 5 12 6 Bill Vukovich 1 8 7 Hans Herrmann Ret* Ret 3 4 Ret 8 8 Luigi Musso DNS Ret 2 6 9 Nino Farina 2 Ret 6 10 Jimmy Bryan 2 6 11 Roberto Mieres Ret Ret Ret 6 Ret 4 Ret 4 6 12 Jack McGrath 3* 5 13 Stirling Moss 3 Ret** Ret Ret 10 Ret 4.14 14 Onofre Marimon Ret Ret Ret 3** 4.14 15 Robert Manzon 3 Ret 9 Ret Ret 4 16 Sergio Mantovani 7 5 5 9 Ret 4 17 Prince Bira 7 6 4 Ret† Ret 9 3 18 Umberto Maglioli 9 7 3† 2 19 Andre Pilette 5 9 Ret 2 20 Luigi Villoresi 5 Ret† Ret Ret 2 21 Elie Bayol 5 2 22 Mike Nazaruk 5 2 23 Troy Ruttman 4† 1.5 24 Duane Carter 4† / 15† 1.5 25 Alberto Ascari 21 Ret** / Ret† Ret Ret* 1.14 26 Jean Behra DSQ Ret 6 Ret** 10 Ret Ret Ret 0.14 27 Harry Schell 6 Ret 12 7 Ret Ret 0 28 Ken Wharton Ret 8 6 8 0 29 Fred Wacker Ret 6 0 30 Fred Agabashian 6 0 31 Piero Taruffi 6 0 32 Paco Godia 6 0 33 Louis Rosier Ret Ret Ret 8 8 7 0 34 Peter Collins Ret 7 0 35 Don Freeland 7 0 36 Jacques Swaters Ret 8 Ret 0 37 Toulo de Graffenried 8 Ret† 0 38 Paul Russo 8 0 39 Larry Crockett 9 0 40 Cal Niday 10 0 41 Bob Gerard 10 0 42 Jorge Daponte Ret 11 0 43 Art Cross 11 0 44 Don Beauman 11 0 45 Chuck Stevenson 12 0 46 Manny Ayulo 13 0 47 Leslie Marr 13 0 48 Bob Sweikert 14 0 49 Leslie Thorne 14 0 50 Horace Gould 15 0 51 Jimmy Jackson 15† 0 52 Ernie McCoy 16 0 53 Jimmy Reece 17 0 54 Ed Elisian 18 0 55 Frank Armi 19 0 — Clemar Bucci Ret Ret Ret Ret 0 — Paul Frère Ret Ret Ret 0 — Roy Salvadori Ret Ret 0 — Jacques Pollet Ret Ret 0 — Roger Loyer Ret 0 — Sam Hanks Ret 0 — Pat O'Connor Ret 0 — Rodger Ward Ret 0 — Gene Hartley Ret 0 — Andy Linden Ret 0 — Johnny Thomson Ret 0 — Jerry Hoyt Ret 0 — Jimmy Daywalt Ret 0 — Tony Bettenhausen Ret 0 — Spider Webb Ret 0 — Bill Homeier Ret 0 — Johnnie Parsons Ret 0 — Len Duncan Ret 0 — Pat Flaherty Ret† 0 — Jim Rathmann Ret† 0 — Lance Macklin Ret 0 — Georges Berger Ret 0 — Bill Whitehouse Ret 0 — John Riseley-Prichard Ret 0 — Reg Parnell Ret 0 — Peter Whitehead Ret 0 — Eric Brandon Ret 0 — Hermann Lang Ret 0 — Theo Helfrich Ret 0 — Ron Flockhart Ret† 0 — Ottorino Volonterio Ret† 0 — Alan Brown DNS 0 Pos. Driver ARG 500‡ BEL FRA GBR GER SUI ITA ESP Pts. * * Fastest lap (1 point awarded) * ** Multiple drivers set equal fastest lap times, thus sharing the 1 point. * † Position shared between more drivers of the same car * ‡ Several cars were shared in this race. See the race page for details. * Only the best 5 results counted towards the Championship. Numbers without parentheses are Championship points; numbers in parentheses are total points scored. ==Non-Championship race results== Other Formula One races also held in 1954, which did not count towards the World Championship. Race Name Circuit Date Winning driver Constructor Report XIII Grande Prêmio Cidade do Rio de Janeiro Rio de Janeiro January 3 Toulo de Graffenried Maserati Report New Zealand Motor Cup Grand Prix Ardmore January 9 Stan Jones Maybach Report Gran Premio Ciudad de Buenos Aires Buenos Aires January 31 Maurice Trintignant Ferrari Report IV Gran Premio di Siracusa Syracuse April 11 Nino Farina Ferrari Report XV Grand Prix de Pau Pau April 19 Jean Behra Gordini Report VI Levant Cup Goodwood April 19 Reg Parnell Ferrari Report III Grand Prix de Bordeaux Bordeaux May 9 José Froilán González Ferrari Report IV BRDC International Trophy Silverstone May 15 José Froilán González Ferrari Report VII Gran Premio di Bari Bari May 22 José Froilán González Ferrari Report II Curtis Trophy Snetterton June 5 Roy Salvadori Maserati Report XIII Gran Premio di Roma Castelfusano June 6 Onofre Marimón Maserati Report XXIV Grand Prix des Frontières Chimay June 6 B Bira Maserati Report I Cornwall M.R.C. Formula 1 Race Davidstow June 7 John Riseley-Prichard Connaught-Francis Report I BARC Formula 1 Race Goodwood June 7 Reg Parnell Ferrari Report II Crystal Palace Trophy Crystal Palace June 19 Reg Parnell Ferrari Report IV Grand Prix de Rouen-les-Essarts Rouen July 11 Maurice Trintignant Ferrari Report III Grand Prix de Caen Caen July 25 Maurice Trintignant Ferrari Report I August Cup Crystal Palace August 2 Reg Parnell Ferrari Report II Cornwall M.R.C. Formula 1 Race Davidstow August 2 John Coombs Lotus-Francis Report I International Gold Cup Oulton Park August 7 Stirling Moss Maserati Report RedeX Trophy Snetterton August 14 Reg Parnell Ferrari Report XXIII Circuito di Pescara Pescara August 15 Luigi Musso Maserati Report III Joe Fry Memorial Trophy Castle Combe August 28 Horace Gould Cooper-Bristol Report V Circuit de Cadours Cadours September 12 Jean Behra Gordini Report I Grosser Preis von Berlin AVUS September 19 Karl Kling Mercedes-Benz Report VII Goodwood Trophy Goodwood September 25 Stirling Moss Maserati Report I Daily Telegraph Trophy Aintree October 2 Stirling Moss Maserati Report Category:Formula One seasons Category:1954 in sports",
 "title": "1954 Formula One season"
}