{
 "id": "82436",
 "text": "The 1968 Formula One season crowned as champion Graham Hill. ==Season review== Rnd Race Date Location Winning driver Constructor Report 1 South African Grand Prix January 1 Kyalami Jim Clark Lotus-Ford Report 2 Spanish Grand Prix May 12 Jarama Graham Hill Lotus-Ford Report 3 Monaco Grand Prix May 26 Monaco Graham Hill Lotus-Ford Report 4 Belgian Grand Prix June 9 Spa-Francorchamps Bruce McLaren McLaren-Ford Report 5 Dutch Grand Prix June 23 Zandvoort Jackie Stewart Matra-Ford Report 6 French Grand Prix July 7 Rouen-Les-Essarts Jacky Ickx Ferrari Report 7 British Grand Prix July 20 Brands Hatch Jo Siffert Lotus-Ford Report 8 German Grand Prix August 4 Nürburgring Jackie Stewart Matra-Ford Report 9 Italian Grand Prix September 8 Monza Denny Hulme McLaren- Ford Report 10 Canadian Grand Prix September 22 Mont-Tremblant Denny Hulme McLaren-Ford Report 11 United States Grand Prix October 6 Watkins Glen Jackie Stewart Matra-Ford Report 12 Mexican Grand Prix November 3 Hermanos Rodriguez Graham Hill Lotus-Ford Report ==1968 Drivers Championship final standings== {| class=\"wikitable\" style=\"font-size: 85%;\" Pos. Driver RSA ESP MON BEL NED FRA GBR GER ITA CAN USA MEX Pts. 1 Graham Hill 2 1 1 Ret 9 Ret Ret 2 Ret 4 2 1 48 2 Jackie Stewart Ret 4 1 3 6 1 Ret 6 1 7 36 3 Denny Hulme 5 2 5 Ret Ret 5 4 7 1 1 Ret Ret 33 4 Jacky Ickx Ret Ret 3 4 1 3 4 3 Ret 27 5 Bruce McLaren Ret Ret 1 Ret 8 7 13 Ret 2 6 2 22 6 Pedro Rodríguez Ret Ret Ret 2 3 NC Ret 6 Ret 3 Ret 4 18 7 Jo Siffert 7 Ret Ret 7 Ret 11 1 Ret Ret Ret 5 6 12 8 John Surtees 8 Ret Ret Ret Ret 2 5 Ret Ret Ret 3 Ret 12 9 Jean-Pierre Beltoise 6 5 Ret 8 2 9 Ret Ret 5 Ret Ret Ret 11 10 Chris Amon 4 Ret Ret 6 10 2 Ret Ret Ret Ret Ret 10 11 Jim Clark 1 9 12 Jochen Rindt 3 Ret Ret Ret Ret Ret Ret 3 Ret Ret Ret Ret 8 13 Richard Attwood 2 Ret 7 7 Ret 14 6 14 Johnny Servoz-Gavin Ret Ret 2 Ret Ret 6 15 Jackie Oliver Ret 5 NC Ret 11 Ret Ret DNS 3 6 16 Ludovico Scarfiotti Ret 4 4 6 17 Lucien Bianchi 3 6 Ret Ret NC Ret Ret 5 18 Vic Elford 4 Ret Ret Ret 5 Ret 8 5 19 Brian Redman Ret 3 Ret 4 20 Piers Courage Ret Ret Ret Ret 6 8 8 4 Ret Ret Ret 4 21 Dan Gurney Ret Ret Ret Ret 9 Ret Ret 4 Ret 3 22 Jo Bonnier Ret DNQ Ret 8 Ret 6 Ret Ret 5 3 23 Jack Brabham Ret DNS Ret Ret Ret Ret Ret 5 Ret Ret Ret 10 2 24 Silvio Moser DNQ 5 NC DNQ 2 25 Henri Pescarolo Ret DNS 9 0 26 John Love 9 0 27 Hubert Hahne 10 0 28 Kurt Ahrens Jr. 12 0 — Jackie Pretorius NC 0 — Derek Bell Ret Ret 0 — Mario Andretti DNS Ret 0 — Bobby Unser DNS Ret — Andrea de Adamich Ret 0 — Dave Charlton Ret 0 — Mike Spence Ret 0 — Basil van Rooyen Ret 0 — Sam Tingle Ret 0 — Robin Widdows Ret 0 — David Hobbs Ret 0 — Bill Brack Ret 0 — Moises Solana Ret 0 — Frank Gardner DNQ 0 Pos. Driver RSA ESP MON BEL NED FRA GBR GER ITA CAN USA MEX Pts. Category:Formula One seasons Category:1968 in sports",
 "title": "1968 Formula One season"
}