{
 "id": "824301",
 "text": "is a Japanese football player. They play for the Japan national team. Yokoyama goes by singular they pronouns. ==Biography== Yokoyama was born in Tama on August 13, 1993. After graduating from Jumonji High School, they joined Okayama Yunogo Belle in 2012. In 2014, they moved to Nadeshiko League Division 2 club AC Nagano Parceiro. They became top scorer in 2014 and 2015. The club was also promoted to Division 1 from 2016. In 2016 season, they were selected Best Eleven. In July 2017, they moved to German Bundesliga club Frankfurt.AC Nagano Parceiro In July 2018, they returned to AC Nagano Parceiro. In 2020, they moved to Washington Spirit. In 2010, Yokoyama was selected the Japan U-17 national team for 2010 U-17 World Cup. They played 6 games and scored 6 goals, and Japan won 2nd place. They received one of the ten 2010 FIFA Puskás Award nominations for their winning goal in the semifinals against North Korea, which made the headlines and was compared to Diego Maradona's second goal against England in the 1986 World Cup. In 2012 they were also a member of the Japan U-20 national team for 2012 U-20 World Cup which Japan won the 3rd place. In March 2015, they were selected the Japan national team for 2015 Algarve Cup. At this competition, on March 6, they debuted and scored a goal against Portugal. In 2018, they played at 2018 Asian Cup. They scored 4 goals include 2 goals at semifinal and a goal at final, and Japan won the championship. ==Statistics== List of match in 2015, 2016, 2017, 2018, 2019 at Japan Football Association Japan national team Year Apps Goals 2015 5 2 2016 8 3 2017 11 6 2018 11 5 2019 8 1 Total 43 17 ==References== ==Other websites== * *Japan Football Association Category:1993 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Okayama Yunogo Belle players Category:AC Nagano Parceiro Ladies players Category:2019 FIFA Women's World Cup players Category:2018 AFC Women's Asian Cup players Category:AFC Women's Asian Cup-winning players",
 "title": "Kumi Yokoyama"
}