{
 "id": "82454",
 "text": "The 1986 Formula One season was the 37th of the championship. The champion was Alain Prost, who had won the championship after a very tight title fight between Williams' Nigel Mansell. The 1986 season started on March 23, and ended on October 26 after sixteen races. This was the first year that turbocharged engines were required. Formula One had banned naturally aspirated (atmospheric) engines. Until the planned engine change in 2014, this was the only year where turbochargers were required. The ban on atmospheric engines was lifted in 1987. In 1989, all forced induction engines (turbochargers or supercharge) were banned. == Drivers and constructors == Entrant Constructor Chassis Engine Tyres No Driver Rounds Test driver(s) Marlboro McLaren International McLaren McLaren MP4/2C TAG TTE PO1 1.5 L V6t 1 Alain Prost All n/a 2 Keke Rosberg All n/a Data General Team Tyrrell Tyrrell Tyrrell 014 Tyrrell 015 Renault EF4B 1.5 L V6t 3 Martin Brundle All n/a 4 Philippe Streiff All n/a Canon Williams Honda Team Williams Williams FW11 Honda RA166E 1.5 L V6t 5 Nigel Mansell All n/a 6 Nelson Piquet All n/a Motor Racing Developments Brabham Brabham BT55 BMW M12/13/1 1.5 L L4t 7 Riccardo Patrese All Josele Garza 8 Elio de Angelis 1-4 Josele Garza Derek Warwick 6-16 Josele Garza John Player Special Team Lotus Lotus Lotus 98T Renault EF15B 1.5 L V6t 11 Johnny Dumfries All Derek Warwick 12 Ayrton Senna All Derek Warwick West Zakspeed Racing Zakspeed Zakspeed 861 Zakspeed 1500/4 1.5 L L4t 14 Jonathan Palmer All Luis Perez-Sala 29 Huub Rothengatter 3-16 Luis Perez-Sala Team Haas (USA) Ltd Lola Lola THL1 Lola THL2 Hart 415T 1.5 L L4t Ford Cosworth GBA 1.5 L V6t 15 Alan Jones All n/a 16 Patrick Tambay 1-6, 8-16 n/a Eddie Cheever 7 n/a Barclay Arrows BMW Arrows Arrows A8 Arrows A9 BMW M12/13 1.5 L L4t 17 Marc Surer 1-5 Jari Nurminen Christian Danner 7-16 Jari Nurminen 18 Thierry Boutsen All Jari Nurminen Benetton Formula Ltd Benetton Benetton B186 BMW M12/13 1.5 L L4t 19 Teo Fabi All Andy Wallace Giovanna Amati Paolo Barilla 20 Gerhard Berger All Andy Wallace Giovanna Amati Paolo Barilla Osella Squadra Corse Osella Osella FA1G Osella FA1F Osella FA1H Alfa Romeo 890T 1.5 L V8t 21 Piercarlo Ghinzani All n/a 22 Christian Danner 1-6 n/a Allen Berg 7-12, 14-16 n/a Alex Caffi 13 n/a Minardi Team SpA Minardi Minardi M185B Minardi M186 Motori Moderni Tipo 615-90 1.5 L V6t 23 Andrea de Cesaris All n/a 24 Alessandro Nannini All n/a Equipe Ligier Ligier Ligier JS27 Renault EF4B 1.5 L V6t 25 René Arnoux All n/a 26 Jacques Laffite 1-9 n/a Philippe Alliot 10-16 n/a Scuderia Ferrari SpA SEFAC Ferrari Ferrari F1/86 Ferrari 032 1.5 L V6t 27 Michele Alboreto All n/a 28 Stefan Johansson All n/a Team El Charro AGS AGS AGS JH21C Motori Moderni Tipo 615-90 1.5 L V6t 31 Ivan Capelli 13-14 n/a == Race schedule == Round Official Race Title Grand Prix Circuit City / Location Date 1 Grande Prêmio do Brasil Jacarepaguá Brazilian Grand Prix Jacarepaguá March 23 2 Gran Premio Tio Pepe de España Jerez Spanish Grand Prix Jerez April 13 3 Gran Premio di San Marino Imola San Marino Grand Prix Imola April 27 4 Grand Prix Automobile de Monaco Monaco Monaco Grand Prix Monte Carlo May 11 5 Belgian Grand Prix Spa-Francorchamps Belgian Grand Prix Spa- Francorchamps May 25 6 Grand Prix du Canada Circuit Gilles Villeneuve Canadian Grand Prix Montreal June 15 7 Detroit Grand Prix Detroit Detroit Grand Prix Detroit June 22 8 French Grand Prix Paul Ricard French Grand Prix Le Castellet July 6 9 Shell Oils British Grand Prix Brands Hatch British Grand Prix Kent July 13 10 Großer Preis von Deutschland Hockenheimring German Grand Prix Hockenheim July 27 11 Hungarian Grand Prix Hungaroring Hungarian Grand Prix Budapest August 10 12 Holiday Großer Preis von Osterreich Österreichring Austrian Grand Prix Spielberg August 17 13 Gran Premio d'Italia Monza Italian Grand Prix Monza September 7 14 Grande Prémio de Portugal Estoril Portuguese Grand Prix Estoril September 21 15 Gran Premio de Mexico Hermanos Rodríguez Mexican Grand Prix Mexico City October 12 16 Foster's Australian Grand Prix Adelaide Australian Grand Prix Adelaide October 26 == Results and standings == === Race results === Round Grand Prix Pole position Fastest lap Winning driver Winning constructor 1 Brazilian Grand Prix Ayrton Senna Nelson Piquet Nelson Piquet Williams-Honda 2 Spanish Grand Prix Ayrton Senna Nigel Mansell Ayrton Senna Lotus-Renault 3 San Marino Grand Prix Ayrton Senna Nelson Piquet Alain Prost McLaren-TAG 4 Monaco Grand Prix Alain Prost Alain Prost Alain Prost McLaren-TAG 5 Belgian Grand Prix Nelson Piquet Alain Prost Nigel Mansell Williams-Honda 6 Canadian Grand Prix Nigel Mansell Nelson Piquet Nigel Mansell Williams-Honda 7 Detroit Grand Prix Ayrton Senna Nelson Piquet Ayrton Senna Lotus-Renault 8 French Grand Prix Ayrton Senna Nigel Mansell Nigel Mansell Williams-Honda 9 British Grand Prix Nelson Piquet Nigel Mansell Nigel Mansell Williams-Honda 10 German Grand Prix Keke Rosberg Gerhard Berger Nelson Piquet Williams-Honda 11 Hungarian Grand Prix Ayrton Senna Nelson Piquet Nelson Piquet Williams-Honda 12 Austrian Grand Prix Teo Fabi Gerhard Berger Alain Prost McLaren-TAG 13 Italian Grand Prix Teo Fabi Teo Fabi Nelson Piquet Williams-Honda 14 Portuguese Grand Prix Ayrton Senna Nigel Mansell Nigel Mansell Williams-Honda 15 Mexican Grand Prix Ayrton Senna Nelson Piquet Gerhard Berger Benetton-BMW 16 Australian Grand Prix Nigel Mansell Nelson Piquet Alain Prost McLaren-TAG ==== Scoring system ==== == Drivers standings == Pos Driver BRA ESP SMR MON BEL CAN DET FRA GBR GER HUN AUT ITA POR MEX AUS Points 1 Alain Prost Ret 3 1 1 6 2 3 2 3 6 Ret 1 DSQ 2 2 1 72 (74) 2 Nigel Mansell Ret 2 Ret 4 1 1 5 1 1 3 3 Ret 2 1 5 Ret 70 (72) 3 Nelson Piquet 1 Ret 2 7 Ret 3 Ret 3 2 1 1 Ret 1 3 4 2 69 4 Ayrton Senna 2 1 Ret 3 2 5 1 Ret Ret 2 2 Ret Ret 4 3 Ret 55 5 Stefan Johansson Ret Ret 4 10 3 Ret Ret Ret Ret 11 4 3 3 6 12 3 23 6 Keke Rosberg Ret 4 5 2 Ret 4 Ret 4 Ret 5 Ret 9 4 Ret Ret Ret 22 7 Gerhard Berger 6 6 3 Ret 10 Ret Ret Ret Ret 10 Ret 7 5 Ret 1 Ret 17 8 Jacques Laffite 3 Ret Ret 6 5 7 2 6 Ret 14 9 Michele Alboreto Ret Ret 10 Ret 4 8 4 8 Ret Ret Ret 2 Ret 5 Ret Ret 14 10 René Arnoux 4 Ret Ret 5 Ret 6 Ret 5 4 4 Ret 10 Ret 7 15 7 14 11 Martin Brundle 5 Ret 8 Ret Ret 9 Ret 10 5 Ret 6 Ret 10 Ret 11 4 8 12 Alan Jones Ret Ret Ret Ret 11 10 Ret Ret Ret 9 Ret 4 6 Ret Ret Ret 4 13 Johnny Dumfries 9 Ret Ret DNQ Ret Ret 7 Ret 7 Ret 5 Ret Ret 9 Ret 6 3 14 Philippe Streiff 7 Ret Ret 11 12 11 9 Ret 6 Ret 8 Ret 9 Ret Ret 5 3 15 Patrick Tambay Ret 8 Ret Ret Ret Ret Ret Ret 8 7 5 Ret NC Ret NC 2 16 Teo Fabi 10 5 Ret Ret 7 Ret Ret Ret Ret Ret Ret Ret Ret 8 Ret 10 2 17 Riccardo Patrese Ret Ret 6 Ret 8 Ret 6 7 Ret Ret Ret Ret Ret Ret 13 Ret 2 18 Christian Danner Ret Ret Ret DNQ Ret Ret Ret 11 Ret Ret Ret 6 8 11 9 Ret 1 19 Philippe Alliot Ret 9 Ret Ret Ret 6 8 1 20 Thierry Boutsen Ret 7 7 8 Ret Ret Ret NC NC Ret Ret Ret 7 10 7 Ret 0 21 Derek Warwick Ret 10 9 8 7 Ret DNS Ret Ret Ret Ret 0 22 Jonathan Palmer Ret Ret Ret 12 13 Ret 8 Ret 9 Ret 10 Ret Ret 12 10 9 0 23 Huub Rothengatter Ret DNQ Ret 12 DNS Ret Ret Ret Ret 8 Ret Ret DNS Ret 0 24 Andrea de Cesaris Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret Ret Ret Ret 8 Ret 0 25 Elio de Angelis 8 Ret Ret Ret 0 26 Marc Surer Ret Ret 9 9 9 0 27 Piercarlo Ghinzani Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret 11 Ret Ret Ret Ret 0 28 Allen Berg Ret Ret Ret 12 Ret Ret 13 16 NC 0 29 Alessandro Nannini Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret Ret Ret NC 14 Ret 0 30 Alex Caffi NC 0 31 Ivan Capelli Ret Ret 0 32 Eddie Cheever Ret 0 Pos Driver BRA ESP SMR MON BEL CAN DET FRA GBR GER HUN AUT ITA POR MEX AUS Points * Pole position in Bold. * Fastest lap in Italics. * Drivers did not finish the Grand Prix, but were classified as they completed over 90% of the race distance. * Numbers without parentheses are Championship points. Numbers in parentheses are total points scored from the best 11 finishes. == Championship standings == Pos Constructor Car no. BRA ESP SMR MON BEL CAN DET FRA GBR GER HUN AUT ITA POR MEX AUS Pts 1 Williams-Honda 5 Ret 2 Ret 4 1 1 5 1 1 3 3 Ret 2 1 5 Ret 141 6 1 Ret 2 7 Ret 3 Ret 3 2 1 1 Ret 1 3 4 2 2 McLaren-TAG 1 Ret 3 1 1 6 2 3 2 3 6 Ret 1 DSQ 2 2 1 96 2 Ret 4 5 2 Ret 4 Ret 4 Ret 5 Ret 9 4 Ret Ret Ret 3 Lotus-Renault 11 9 Ret Ret DNQ Ret Ret 7 Ret 7 Ret 5 Ret Ret 9 Ret 6 58 12 2 1 Ret 3 2 5 1 Ret Ret 2 2 Ret Ret 4 3 Ret 4 Ferrari 27 Ret Ret 10 Ret 4 8 4 8 Ret Ret Ret 2 Ret 5 Ret Ret 37 28 Ret Ret 5 10 3 Ret Ret Ret Ret 11 4 3 3 6 12 3 5 Ligier- Renault 25 4 Ret Ret 5 Ret 6 Ret 5 4 4 Ret 10 Ret 7 15 7 29 26 3 Ret Ret 6 5 7 2 6 Ret Ret 9 Ret Ret Ret 6 8 6 Benetton-BMW 19 10 5 Ret Ret 7 Ret Ret Ret Ret Ret Ret Ret Ret 8 Ret 10 19 20 6 6 3 Ret 10 Ret Ret Ret Ret 10 Ret 7 5 Ret 1 Ret 7 Tyrrell-Renault 3 5 Ret 8 Ret Ret 9 Ret 10 5 Ret 6 Ret 10 Ret 11 4 11 4 7 Ret Ret 11 12 11 9 Ret 6 Ret 8 Ret 9 Ret Ret 5 8 Haas Lola-Ford 15 Ret Ret 11 10 Ret Ret Ret 9 Ret 4 6 Ret Ret Ret 6 16 Ret Ret Ret Ret Ret Ret 8 7 5 Ret NC Ret NC 9 Brabham-BMW 7 Ret Ret 6 Ret 8 Ret 6 7 Ret Ret Ret Ret Ret Ret 13 Ret 2 8 8 Ret Ret Ret Ret 10 9 8 7 Ret DNS Ret Ret Ret Ret 10 Arrows-BMW 17 Ret Ret 9 9 9 Ret 11 Ret Ret Ret 6 8 11 9 Ret 1 18 Ret 7 7 8 Ret Ret Ret NC NC Ret Ret Ret 7 10 7 Ret 11 Zakspeed 14 Ret Ret Ret 12 13 Ret 8 Ret 9 Ret 10 Ret Ret 12 10 9 0 29 Ret DNQ Ret 12 DNS Ret Ret Ret Ret 8 Ret Ret DNS Ret 12 Minardi-Motori Moderni 23 Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret Ret Ret Ret 8 Ret 0 24 Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret Ret Ret NC 14 Ret 13 Haas Lola-Hart 15 Ret Ret 0 16 Ret 8 Ret 14 Osella-Alfa Romeo 21 Ret Ret Ret DNQ Ret Ret Ret Ret Ret Ret Ret 11 Ret Ret Ret Ret 0 22 Ret Ret Ret DNQ Ret Ret Ret Ret Ret 12 Ret Ret NC 13 16 NC 15 AGS-Motori Moderni 31 Ret Ret 0 Pos Constructor Car no. BRA ESP SMR MON BEL CAN DET FRA GBR GER HUN AUT ITA POR MEX AUS Pts * Pole position in Bold. * Fastest lap in Italics. * Car did not finish the Grand Prix. Car was classified (ranked) because it finished over 90% of the race distance. == References == ==Other websites== * The official website of Formula One Category:Formula One seasons Category:1986 in sports",
 "title": "1986 Formula One World Championship"
}