{
 "id": "824589",
 "text": "is a Japanese football player. She plays for Liverpool and for the Japan national team. ==Biography== Nagano was born in Edogawa, Tokyo on March 9, 1999. In 2014, she joined Urawa Reds from their youth team. She played 23 matches until 2017. In 2018, she moved to South Korean club Incheon Hyundai Steel Red Angels. In 2019, she returned to Japan and joined division 2 club Chifure AS Elfen Saitama. In 2021, she moved to Mynavi Sendai.Mynavi Sendai In 2014, when Nagano was 15 years old, she was selected the Japan U-17 national team for 2014 U-17 World Cup. She played 5 matches and Japan won the champions. In 2016, she played at 2016 U-17 World Cup again. Japan won the 2nd place. She played all 6 matches and was selected Golden Ball award. In 2018, she was selected the Japan U-20 national team for 2018 U-20 World Cup. She played all 6 matches and scored a goal at the final. Japan won the champions. On November 11, 2018, Nagano debuted for the Japan national team against Norway. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National CupIncludes the Empress's Cup, Women's FA Cup League CupIncludes the Nadeshiko League Cup, FA Women's League Cup Total Division Apps Goals Apps Goals Apps Goals Apps Goals Urawa Reds 2014 Nadeshiko League 3 0 0 0 — — 3 0 2015 Nadeshiko League 14 0 1 0 — — 15 0 2016 Nadeshiko League 5 0 1 0 8 1 14 1 2017 Nadeshiko League 1 0 2 0 4 0 7 0 Total 23 0 4 0 12 1 39 1 Incheon Hyundai Steel Red Angels 2018 WK League 21 1 — — — — 21 1 Chifure AS Elfen Saitama 2019 Nadeshiko League Div. 2 16 1 4 0 8 0 28 1 2020 Nadeshiko League Div. 2 18 0 2 1 — 20 1 Total 34 1 6 1 8 0 48 2 MyNavi Sendai 2021–22 WE League 20 0 1 0 — 21 0 North Carolina Courage 2022 NWSL 11 2 — — 11 2 Liverpool 2022–23 Women's Super League 11 0 1 0 1 0 13 0 2023–24 Women's Super League 4 0 0 0 0 0 4 0 Total 15 0 1 0 1 0 17 0 Career total 124 4 12 1 21 1 157 6 ===International=== Appearances and goals by national team and year National Team Year Apps Goals Japan 2018 1 0 2021 2 0 2022 13 1 2023 13 0 Total 29 1 :Scores and results list Japan's goal tally first, score column indicates score after each Nagano goal. List of international goals scored by Fuka Nagano No. Date Venue Opponent Score Result Competition 1\\. 19 July 2022 Kashima Soccer Stadium, Kashima, Japan 2–1 2–1 2022 EAFF E-1 Football Championship ==Honours== ;Urawa Red Diamonds * Nadeshiko League: 2014 * Empress's Cup runner-up: 2014 * Nadeshiko League Cup runner-up: 2017 Incheon Hyundai Steel Red Angels * WK League: 2018 Japan U17 * AFC U-16 Women's Championship: 2013 * FIFA U-17 Women's World Cup: 2014 Japan U20 * AFC U-19 Women's Championship: 2017 * FIFA U-20 Women's World Cup: 2018 Japan * EAFF E-1 Football Championship: 2022 ===Individual=== * FIFA U-17 Women's World Cup Golden Ball: 2016 * Asian Young Footballer of the Year: 2016 ==References== ==Other websites== * * Japan Football Association Category:1999 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan women's international footballers Category:Nadeshiko League players Category:Urawa Red Diamonds Ladies players Category:Chifure AS Elfen Saitama players Category:Mynavi Sendai Ladies players Category:Association football midfielders Category:Japan international footballers Category:South Korean footballers Category:Urawa Red Diamonds players",
 "title": "Fuka Nagano"
}