{
 "id": "824659",
 "text": "The name Britain is very old. The name comes from the ancient Romans' name for the ancient Britons (). The English language word comes from . It can mean Great Britain, the British Isles, or the British state – the United Kingdom. The Romans started using this name after learning it from the ancient Greeks in the Hellenistic period. The Greeks gave the people of Britain the name in and used as the place name . The Greek name for the people of Britain was also written as , and as . This name may itself have come from one of the Brythonic languages of ancient Britain. The Greek name is like the word for Britain in the , which comes from the . There may be a connection between the Greeks' and Romans' name and the Celtic languages. However, it may be that the word comes from one of the languages of the Mediterranean Basin. It could mean \"tin\". Britain's greatest export in the distant past was tin. Words in ancient Egyptian languages have similarities with the Ancient Greek and Latin names. It is also possible that the word for \"tin\" in these languages itself came from the name of Britain or its people. Britannia was the common Latin name for the island of Great Britain starting in the 1st century BC. Britannia replaced the name Albion as the Romans' common name for the island. After the Romans overcame the ancient Britons in war in 43 AD, Britannia could mean just the southern two thirds of the island which was under Roman control. (Caledonia, north of the River Forth in modern Scotland, was only sometimes controlled by the Roman army.) The writings of the Roman cartographer Ptolemy used the name \"Great Britain\" for the island in the 2nd century AD. He used the name \"Megale Britannia\" or \"Great Britain\" () to show the difference between this larger island and Ireland. For Ireland, Ptolemy used the name \"Mikra Britannia\" or \"Little Britain\" (). The word was used in the Old English language to mean Great Britain. After the time of the Anglo-Saxons, the name Britain was most used in history writing. In the early 16th century however, the name became more common in English for political reasons. == Related pages == *Brittany ==References== Category:United Kingdom",
 "title": "Britain (place name)"
}