{
 "id": "825123",
 "text": "\"Large Marge\" is the 4th episode of The Simpsons 14th season. It was first broadcast on the Fox network on November 24, 2002. The episode is about Marge Simpson accidentally getting breast implants. About 17.4 million people watched the episode when it was first broadcast. The episode was put on a DVD of episodes about romance. The DVD also has the episodes \"Natural Born Kissers\", \"Three Gays of the Condo\", and \"The Way We Weren't\". == Story == Homer and Lisa try building houses for Habitat for Humanity. Two women there think that Homer is a bachelor. Marge drives by Homer and thinks that he is flirting with the two women. She thinks that getting a liposuction will make Homer like her more. However, she is accidentally given breast implants. A doctor says that she has to wait 48 hours to get them off. Bart and Milhouse watch Batman with Krusty the Clown as a villain. Krusty puts Batman and Robin on a carousel and makes it go dangerously fast. Bart wants to try it on Milhouse. He puts Milhouse on the carousel at their school. Otto Mann makes the carousel go very fast. The carousel starts to fly and makes the school's flag of the United States fall. Milhouse gets dizzy and vomits on the flag. Bart and Milhouse get in trouble and say that Krusty made them do it. Krusty gets in trouble and has to make his television show safer for children. Marge's breast implants makes it more difficult to work. She tries to hide them from her family, but they all see it later. They go to a restaurant and are given better quality food than other people. A person doing trade fairs sees Marge and gives her a job as a model. Marge likes being a model at first, but she starts getting sexually harassed. At an expo, Marge gets sexually harassed while trying to promote shoehorns. Krusty, Bart, and Milhouse go to the expo with an elephant. They make a plan that Krusty will save Milhouse from being hurt by the elephant. However, the elephant tries to eat Bart, Milhouse, and Homer. Chief Wiggum wants to shoot the elephant's mouth. Marge stop him from shooting by showing everyone her breasts. Krusty remembers and says the word used to stop the elephant. Krusty saves Bart and Milhouse and is popular again. Marge later gets her breast implants taken out. == Production == \"Large Marge\" was written by Ian Maxtone-Graham. Jim Reardon is the director of the episode. Adam West and Burt Ward are voice actors for the television show Batman. They are guest stars in the episode as the characters they voice act in the show. Baha Men made a parody of their song \"Who Let the Dogs Out?\" for the episode. == Reception == Jeff Otto from IGN said that the episode is good, but not as good as other episodes about romance. Colin Jacobson from DVD Movie Guide thought that the episode's story is high concept (art that can be easily made), but that it \"works pretty well\". He liked how Marge's breast implants make the episode humorous. He said the other story with Bart and Krusty makes both stories a \"fun manner\". Victor Valdivia from DVD Verdict thought that this episode and \"The Strong Arms of the Ma\" show that Marge as a character makes it not as good as other episodes of the show. == References == === Books === * == Other websites == * * Category:The Simpsons episodes Category:2002 television episodes",
 "title": "Large Marge"
}