{
 "id": "825831",
 "text": "Close Enough is an American adult animated sitcom created by J. G. Quintel for HBO Max. At first, the series was created for TBS in 2017, but was not shown. After the AT&T; purchase of Time Warner, the show was put on hold. It was released exclusively to the HBO Max streaming service on July 9, 2020 to April 7, 2022. The series has received positive reviews. On August 6, 2020, the series was renewed for a second season which premiered on February 25, 2021. On February 10, 2021, the series was renewed for a third season. ==Premise== The series revolves around a couple who are in their early thirties who have a five-year-old daughter and live with their divorced friends in a Los Angeles duplex. As they get into what seem like normal domestic crises that usually escalate in surreal, often science fiction-esque, ways. ==Cast and characters== ===Main=== * Joshua \"Josh\" Singleton (voiced by J. G. Quintel) – an aspiring video game developer who works for Plugger-Inners; a television installation company based on Geek Squad. His appearance and mannerisms are based on those of Quintel. * Emily Ramirez (voiced by Gabrielle Walsh) – Josh's wife, who works as an assistant for a food corporation called FoodCorp. She is based on Quintel's own wife, Cassia. * Candice Singleton-Ramirez (voiced by Jessica DiCicco) – Josh and Emily's six-year-old (as of \"Birthdaze\") daughter, who struggles with school work. * Alex Dorpenberger (voiced by Jason Mantzoukas) – Josh's best friend, who works as a community college professor. He is a conspiracy theorist. * Bridgette No Stress Yoshida (voiced by Kimiko Glenn) – Emily's best friend and Alex's ex-wife. She is a Japanese-American social media influencer, and a part-time comedy singer- songwriter in a band with Emily. Her middle name was revealed in an episode from the first season, which also revealed that it was the result of a legal name change that she authorized while she was under the influence of drugs. ===Recurring=== * Pearle Watson (voiced by Danielle Brooks) – A retired LAPD cop, and the landlord of the duplex. * Randall \"Randy\" Watson (voiced by James Adomian) – Pearle's adopted Caucasian son, and the duplex's property manager. He was adopted by Pearle after his biological parents, Wyatt and Deborah Trickle, were arrested for siphoning gas from multiple cars. * Mr. Timothy Brice Campbell (voiced by John Early) – Candice's hippie teacher at Chamomile Elementary. * Mr. Salt (voiced by Fred Stoller) – Emily's boss at FoodCorp. * Dr. Glandz (voiced by Cheri Oteri) – A physician who works at a hospital called Pretty Good Samaritan. * Dante (voiced by Eugene Cordero) – One of Josh's coworkers at Plugger-Inners who has a prosthetic lower arm. * Jojo (voiced by Mo Collins) – A biker woman who is the leader of the Cool Moms, and the mother of Candice's classmate, Mia. * Trish (voiced by Kate Higgins) – A member of the Cool Moms, and the mother of Candice's best friend and classmate, Maddie. ===Additional voices=== * William Salyers * Max Mittelman * Roger Craig Smith * Erica Lindbeck * Fred Tatasciore * Kevin Michael Richardson * Matthew Mercer * Grey Griffin * Ali Hillis * Eric Bauza * Kate Micucci * Vanessa Marshall * Marc Evan Jackson * Eden Riegel * Ashley Johnson * Courtenay Taylor * Chris Cox * Travis Willingham * Scott Whyte * Troy Baker * Lauren Lapkus ===Guest stars=== * \"Weird Al\" Yankovic as himself * David Hasselhoff as himself * Noel Fielding as Snailathan Gold * Dave Foley as Dr. Ferguson * George Lopez as Wurst Bros. leader * Matt Besser as Bush Guy * Rachel Dratch as Meredith Breedmore * Seth Morris as Robot guards * Jane Lynch as Barb * Suzy Nakamura as Ms. Yoshida * Chris Parnell as Ron * Jessica St. Clair as Joy * Rich Sommer as Keith Nash * Brent Weinbach as Lee * Steve Agee as Davey Wegman * Judy Greer as Nikki * Diamond White as Caitlin Olsman * Kate Berlant as River Lake * Paul F. Tompkins as The Amazing Sardini * Lea DeLaria as Prisoner * Horatio Sanz as Raoul * Lennon Parham as Toluca Lake * James Urbaniak as Commercial Bot * Whitmer Thomas as The Goosh * Jordan Black as Pterodactyl * Skyler Gisondo as Cameron * Rachel Bloom as Kira * Michaela Watkins as Brienne Bishop * Nicole Byer as Ophira * Heidi Gardner as Becca * Beck Bennett as Luc * David Koechner as Wyatt Trickle * Wendie Malick as Deborah Trickle * Keith David as \"World's Greatest Teacher\" mug * Ken Marino ==Release== The series was announced in May 2017, four months after Quintel's previous series, Regular Show, concluded, and was originally planned to air on TBS, but it was delayed several times, and TBS's plans for the animation block to premiere it fell through when production on The Cops was shut down due to Louis C.K.’s admitted sexual misconduct. On October 29, 2019, it was announced that the series would instead make its home on HBO Max. The second half of the third episode was premiered at the Annecy International Animated Film Festival on June 15, 2020. On September 14, 2020, the series was broadcast internationally through Netflix and Adult Swim. The second season premiered on February 25, 2021 on HBO Max. The second season is scheduled to release on Netflix internationally on May 26, 2021. ==Episodes== ===Season 1 (2020)=== The first season was originally set to run for ten episodes, but only 8 episodes were released when the series launched.http://www.thefutoncritic.com/showatch/close-enough/listings/ ==References== Category:2020 American television series debuts Category:2020s American animated television series Category:2020s American comedy television series Category:HBO Max",
 "title": "Close Enough"
}