{
 "id": "826051",
 "text": "František Šedivý (2 July 1927 – 23 February 2021) was a Czech writer and former political prisoner. He served as vice president of the Confederation of Political Prisoners. Milady Horáková Club Grand opening of the grammar school == Education == František Šedivý studied at the high school, from which he was expelled during the Heydrichiad in 1942 and in 1944 he worked in the Junkers factory. At that time, as a liaison, he actively participated in the anti-Nazi resistance. After the communist coup in February 1948, he became involved in the fight against the then regime by publishing and distributing leaflets, organizing illegal groups and helping to flee abroad. As a smuggler, he twice successfully transferred groups of refugees across the borders in Šumava. At university, he organized a group that was preparing for the soon- to-fall fall of the ruling regime. In early fifties of the 20th century , he managed to reveal an agent provocateur Golda . As a result, he was arrested in 1952 and at the age of 25 in the trial of Šedivý et al. (was identified as the leader of the group) sentenced to 14 years in prison for the crime of high treason and espionage. He was imprisoned on Mírov and spent many years in uranium mines in Jáchymov, at the central camp, the camp C , the camp L (the so-called Tower of Death) and in Pribram Bytiz and Vojna . He was released on parole in February 1964. After 1989, he became involved in the Confederation of Political Prisoners , where he held the position of First Vice-President. He was also the chairman of the Club dr. Milady Horáková and was also a member of the international PEN club and the author of several books. Oral history of Jáchymov \"muggles\". clovek.ff.cuni.cz [online]. [feeling. 2009-11-12]. Festival Mene Tekel 2009 == Honours == On the occasion of the national holiday of the Day of the Establishment of the Independent Czechoslovak State, he received the Order of Tomáš Garrigu Masaryk II from the hands of the President of the Republic Václav Klaus on 28 October 2009 . outstanding achievements for the development of democracy and human rights. On Saturday, 31 May 2008, he was granted honorary citizenship of the municipality of Zadní Třebaň. On May 7, 2010, he was granted honorary citizenship of the town of Řevnice. František Šedivý's Medallion Archived on 15 August 2017 on the Wayback Machine on the Memory of the Nation Who received the order from President Klaus on lidovky.cz Award of Honorary Citizenship of the Municipality of Zadní Třebaň. www.zadnitreban.cz [online]. [feeling. 2009-11-12]. == References == Category:1927 births Category:2021 deaths Category:Czech writers Category:Czech politicians",
 "title": "František Šedivý"
}