{
 "id": "826243",
 "text": "Sheldon Lee Cooper Ph.d, Sc.d is a fictional character in the American television sitcom The Big Bang Theory, played by Jim Parsons, and the Young Sheldon series, played by Iain Armitage. Sheldon is known for speaking with the blunt transparency that accompanies his neurotype. He is a perfect example of how misunderstood those in the autistic community truly are. He is unapologetically authentic and lives with the admirable ability of establishing and upholding his boundaries with a shameless rigidity. == Background in The Big Bang Theory == Sheldon says he went to College when he was 11. That he graduated when he was 14 and that he got his Phd when he was 16. Sheldon moved to California to prove String theory at Caltech. Sheldon let Leonard Hofstadter become his roommate since he didn’t have enough money to pay for it himself. Sheldon says that he was bullied a lot when he was a kid and that he got swirlies all the time, even in Church. Sheldon tells Leonard “it wasn’t my first pantsing, it won’t be the last”. Sheldon also says that when he was nine years old and in High school, people threw eggs at his head. Sheldon says that his brother and sister both bullied him with “wedgies, swirlies, pantsings, and the classic why are you hitting yourself.” He also says his neighbours bullied with chickens and that other kids hit him in the head with books. == Personality == Sheldon always wants everything done his way, he always tells everyone else that he’s smarter than they are and he has his friends all sign contracts to figure out how they can be friends. Sheldon also makes sure to have a schedule for everything and labels everything he owns. Sheldon also wants everything to be clean and organized. Sheldon loves Star Trek, Star Wars, Doctor Who, DC Comics and Marvel Comics but he hates Babylon 5. Sheldon has a list of people he hates called his enemies list. It’s said that Sheldon doesn’t understand when he’s being a jerk because “the part of his brain that should know is getting a wedgie from the rest of his brain.” Whenever people think Sheldon has a Mental illness, he says “I’m not crazy, my mother had me tested.” == Autism controversy == A lot of people in the real world think that Sheldon has Asperger syndrome but some people think he doesn’t. Bill Prady and Chuck Lore have said he doesn’t. Jim Parsons said that he didn’t think Sheldon was Autistic when he started playing him but after reading John Elder Robison’s book about having Asperger’s, Parsons thinks Sheldon is Autistic. When Dr. Neil deGrasse Tyson asked Dr. Mayim Bialik if Sheldon were Autistic she said “the show doesn’t pathologize its characters”. == Relationships == When Dr. Ramona Norwitzki meets Sheldon she falls in love with him. He works with her, that surprises everyone because they thought Sheldon was Asexual. When Norwitzki wants Sheldon to put her name on a paper he wrote, Sheldon tells her to go away. When Howard Wolowitz and Raj Koothrappali want to know if Online dating works, they decide to try to find a girlfriend for Sheldon. They find Amy Farrah Fowler. Sheldon and Amy are just friends until Amy starts dating Sheldon’s friend Stuart and Sheldon gets jealous. So Sheldon asks Amy to be his girlfriend. Amy breaks up with Sheldon after she thinks he’s more interested in The Flash than in her. Sheldon gets back together with Amy after realizing how much he loves her because of a Beach Boys song. As his Birthday present to her, Sheldon has sex with Amy for the first time. After Dr. Norwitzki comes back, Sheldon asks Amy to marry him and she says yes. They have Mark Hamill do the wedding ceremony for them. == Nobel Prize == In the last episode, Sheldon and Amy win the Nobel Prize in Physics for an idea called Super Asymmetry. Sheldon gives a speech thanking his friends for how supportive they are of him. == Young Sheldon == Sheldon’s the main character in Young Sheldon. He’s played by Iain Armitage. Some of the stories in Young Sheldon are very different from how Sheldon told them in The Big Bang Theory. == References == Category:1980 births Category:Fictional characters introduced in 2007 Category:Fictional twins Category:The Big Bang Theory characters Category:Narcissism in fiction",
 "title": "Sheldon Cooper"
}