{
 "id": "826396",
 "text": "New York's 2nd congressional district is a congressional district for the United States House of Representatives. Republican Andrew Garbarino has been the representative for the district since 2021. The congressional district is on Long Island, New York. ==Voting== Election results from presidential races Year Office Results 1992 President Bush 40–40% 1996 President Clinton 54–34% 2000 President Gore 57–39% 2004 President Kerry 53–45% 2008 President Obama 51–48% 2012 President Obama 52–47% 2016 President Trump 53–44% 2020 President Trump 51–47% == List of members representing the district == ===1789–1805: one seat=== Representative Party Years Cong ress Electoral history John Laurance Pro-Administration March 4, 1789 – March 3, 1793 Elected in 1789. Re-elected in 1790. Retired. John Watts Pro-Administration March 4, 1793 – March 3, 1795 Elected in 1793. Lost re-election. Edward Livingston Democratic- Republican March 4, 1795 – March 3, 1801 Elected in 1794. Re-elected in 1796. Re-elected in 1798. Samuel L. Mitchill Democratic- Republican March 4, 1801 – March 3, 1803 Elected in 1800. Redistricted to the . Joshua Sands Federalist March 4, 1803 – March 3, 1805 Elected in 1802. Retired. ===1805–1809: Two seats on general ticket with 3rd district === Cong ress Years Seat A Seat A Seat A Seat B Seat B Seat B Cong ress Years Representative Party Electoral history Representative Party Electoral history March 4, 1805 – March 3, 1809 Gurdon S. Mumford Democratic- Republican Daniel D. Tompkins was elected in 1804 but declined the seat when appointed to the New York Supreme Court. Elected to begin Tompkins's term. Re-elected in 1806. George Clinton Jr. Democratic- Republican Samuel L. Mitchill (previously of the 3rd district) was re-elected in 1804 but resigned November 22, 1804 when elected U.S. Senator. Elected to begin Mitchell's term. Re-elected in 1806. The districts were separated again, and a second seat was added to the 2nd district. The districts were separated in 1809. ===1809–1823: two seats=== From 1809 to 1823, two seats were apportioned to the second district, elected at-large on a general ticket. Cong ress Years Seat A Seat A Seat A Seat B Seat B Seat B Cong ress Years Representative Party Electoral history Representative Party Electoral history March 4, 1809 – 1810 Gurdon S. Mumford Democratic-Republican Re-elected in 1808. William Denning Democratic-Republican Elected in 1808. Never took his seat resigned. 1810 – December 4, 1810 Gurdon S. Mumford Democratic-Republican Re-elected in 1808. Vacant Vacant December 4, 1810 – March 3, 1811 Gurdon S. Mumford Democratic-Republican Re-elected in 1808. Samuel L. Mitchill Democratic-Republican Elected April 24–26, 1810 to finish Denning's term and seated December 4, 1810. Also elected the same day in 1810 to the next term. March 4, 1811 – March 3, 1813 William Paulding Jr. Democratic-Republican Elected in 1810. Samuel L. Mitchill Democratic-Republican Elected April 24–26, 1810 to finish Denning's term and seated December 4, 1810. Also elected the same day in 1810 to the next term. March 4, 1813 – August 2, 1813 Egbert Benson Federalist Elected in 1812. Resigned. Jotham Post Jr. Federalist Elected in 1812. August 2, 1813 – January 22, 1814 Vacant Vacant Jotham Post Jr. Federalist Elected in 1812. January 22, 1814 – March 3, 1815 William Irving Democratic-Republican Elected December 28–30, 1813 to finish Benson's term and was seated January 22, 1814. Re-elected in 1814. Re-elected in 1816. Jotham Post Jr. Federalist Elected in 1812. March 4, 1815 – March 3, 1817 William Irving Democratic-Republican Elected December 28–30, 1813 to finish Benson's term and was seated January 22, 1814. Re-elected in 1814. Re-elected in 1816. Peter H. Wendover Democratic-Republican Elected in 1814. Re-elected in 1816. Re-elected in 1818. March 4, 1817 – March 3, 1819 William Irving Democratic-Republican Elected December 28–30, 1813 to finish Benson's term and was seated January 22, 1814. Re-elected in 1814. Re-elected in 1816. Peter H. Wendover Democratic-Republican Elected in 1814. Re-elected in 1816. Re-elected in 1818. March 4, 1819 – March 3, 1821 Henry Meigs Democratic-Republican Elected in 1818. Peter H. Wendover Democratic-Republican Elected in 1814. Re-elected in 1816. Re-elected in 1818. March 4, 1821 – December 3, 1821 Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. Elections were held in April 1821. It is unclear when results were announced or credentials issued. December 3, 1821 – March 3, 1823 Churchill C. Cambreleng Democratic-Republican Elected in 1821. Redistricted to the . John J. Morgan Democratic-Republican Elected in 1821. Redistricted to the . ===1823–present: one seat=== Member Party Years Cong ress Electoral history District location Jacob Tyson Democratic-Republican March 4, 1823 – March 3, 1825 Elected in 1822. 1823–1833 Parts of Kings county Joshua Sands Anti-Jacksonian March 4, 1825 – March 3, 1827 Elected in 1824. 1823–1833 Parts of Kings county John J. Wood Jacksonian March 4, 1827 – March 3, 1829 Elected in 1826. Retired. 1823–1833 Parts of Kings county Jacob Crocheron Jacksonian March 4, 1829 – March 3, 1831 Elected in 1828. 1823–1833 Parts of Kings county John T. Bergen Jacksonian March 4, 1831 – March 3, 1833 Elected in 1830. 1823–1833 Parts of Kings county Isaac B. Van Houten Jacksonian March 4, 1833 – March 3, 1835 Elected in 1832. 1833–1843 Parts of Kings county Samuel Barton Jacksonian March 4, 1835 – March 3, 1837 Elected in 1834. 1833–1843 Parts of Kings county Abraham Vanderveer Democratic March 4, 1837 – March 3, 1839 Elected in 1836. 1833–1843 Parts of Kings county James De la Montanya Democratic March 4, 1839 – March 3, 1841 Elected in 1838. 1833–1843 Parts of Kings county Joseph Egbert Democratic March 4, 1841 – March 3, 1843 Elected in 1840. 1833–1843 Parts of Kings county Henry C. Murphy Democratic March 4, 1843 – March 3, 1845 Elected in 1842. 1843–1853 Parts of Kings county Henry J. Seaman Know Nothing March 4, 1845 – March 3, 1847 Elected in 1844. 1843–1853 Parts of Kings county Henry C. Murphy Democratic March 4, 1847 – March 3, 1849 Elected in 1846. 1843–1853 Parts of Kings county David A. Bokee Whig March 4, 1849 – March 3, 1851 Elected in 1848. 1843–1853 Parts of Kings county Obadiah Bowne Whig March 4, 1851 – March 3, 1853 Elected in 1850. 1843–1853 Parts of Kings county Thomas W. Cumming Democratic March 4, 1853 – March 3, 1855 Elected in 1852. 1853–1863 Parts of Kings county James S.T. Stranahan Opposition March 4, 1855 – March 3, 1857 Elected in 1854. 1853–1863 Parts of Kings county George Taylor Democratic March 4, 1857 – March 3, 1859 Elected in 1856. 1853–1863 Parts of Kings county James Humphrey Republican March 4, 1859 – March 3, 1861 Elected in 1858. 1853–1863 Parts of Kings county Moses F. Odell Democratic March 4, 1861 – March 3, 1863 Elected in 1860. 1853–1863 Parts of Kings county Martin Kalbfleisch Democratic March 4, 1863 – March 3, 1865 Elected in 1862. 1863–1873 Parts of Kings county Teunis G. Bergen Democratic March 4, 1865 – March 3, 1867 Elected in 1864. 1863–1873 Parts of Kings county Demas Barnes Democratic March 4, 1867 – March 3, 1869 Elected in 1866. 1863–1873 Parts of Kings county John G. Schumaker Democratic March 4, 1869 – March 3, 1871 Elected in 1868. 1863–1873 Parts of Kings county Thomas Kinsella Democratic March 4, 1871 – March 3, 1873 Elected in 1870. 1863–1873 Parts of Kings county John G. Schumaker Democratic March 4, 1873 – March 3, 1877 Elected in 1872. Re-elected in 1874. 1873–1883 Parts of Kings county William D. Veeder Democratic March 4, 1877 – March 3, 1879 Elected in 1876. 1873–1883 Parts of Kings county Daniel O'Reilly Democratic March 4, 1879 – March 3, 1881 Elected in 1878. 1873–1883 Parts of Kings county William E. Robinson Democratic March 4, 1881 – March 3, 1885 Elected in 1880. Re-elected in 1882. 1873–1883 Parts of Kings county William E. Robinson Democratic March 4, 1881 – March 3, 1885 Elected in 1880. Re-elected in 1882. 1883–1885 Parts of Kings county Felix Campbell Democratic March 4, 1885 – March 3, 1891 Redistricted from the and re-elected in 1884. Re-elected in 1886. Re-elected in 1888. 1885–1893 Kings County (partial) David A. Boody Democratic March 4, 1891 – October 13, 1891 Elected in 1890. Resigned to become railroad commissioner of New York State. 1885–1893 Kings County (partial) Vacant Vacant October 13, 1891 – November 3, 1891 1885–1893 Kings County (partial) Alfred C. Chapin Democratic November 3, 1891 – November 16, 1892 Elected to finish Boody's term. Resigned. 1885–1893 Kings County (partial) Vacant Vacant November 16, 1892 – March 3, 1893 1885–1893 Kings County (partial) John M. Clancy Democratic March 4, 1893 – March 3, 1895 Redistricted from the and re-elected in 1892. 1893–1903 Kings County (partial) Denis M. Hurley Republican March 4, 1895 – February 26, 1899 Elected in 1894. Re-elected in 1896. Died. 1893–1903 Kings County (partial) Vacant Vacant February 26, 1899 – March 3, 1899 1893–1903 Kings County (partial) John J. Fitzgerald Democratic March 4, 1899 – March 3, 1903 Elected in 1898. Re-elected in 1900. Redistricted to the . 1893–1903 Kings County (partial) George H. Lindsay Democratic March 4, 1903 – March 3, 1913 Redistricted from the and re-elected in 1902. Re-elected in 1904. Re-elected in 1906. Re-elected in 1908. Re-elected in 1910. 1903–1913 Kings County (partial) Denis O'Leary Democratic March 4, 1913 – December 31, 1914 Elected in 1912. Resigned. 1913–1933 Parts of Queens county Vacant Vacant December 31, 1914 – March 3, 1915 1913–1933 Parts of Queens county C. Pope Caldwell Democratic March 4, 1915 – March 3, 1921 Elected in 1914. Re-elected in 1916. Re-elected in 1918. 1913–1933 Parts of Queens county John J. Kindred Democratic March 4, 1921 – March 3, 1929 Elected in 1920. Re-elected in 1922. Re-elected in 1924. Re-elected in 1926. 1913–1933 Parts of Queens county William F. Brunner Democratic March 4, 1929 – September 27, 1935 Elected in 1928. Re-elected in 1930. Re-elected in 1932. Re-elected in 1934. Resigned upon election as sheriff of Queens County. 1913–1933 Parts of Queens county William F. Brunner Democratic March 4, 1929 – September 27, 1935 Elected in 1928. Re-elected in 1930. Re-elected in 1932. Re-elected in 1934. Resigned upon election as sheriff of Queens County. 1933–1945 Parts of Queens county Vacant Vacant September 27, 1935 – November 5, 1935 1933–1945 Parts of Queens county William B. Barry Democratic November 5, 1935 – January 3, 1945 Elected to finish Brunner's term. Re-elected in 1936. Re-elected in 1938. Re-elected in 1940. Re-elected in 1942. Redistricted to the . 1933–1945 Parts of Queens county Leonard W. Hall Republican January 3, 1945 – December 31, 1952 Redistricted from the and re-elected in 1944. Re-elected in 1946. Re-elected in 1948. Re-elected in 1950. Resigned to become Chairman of the Republican National Committee. 1945–1953 Parts of Nassau county Vacant Vacant December 31, 1952 – January 3, 1953 1945–1953 Parts of Nassau county Steven Derounian Republican January 3, 1953 – January 3, 1963 Elected in 1952. Re-elected in 1954. Re-elected in 1956. Re-elected in 1958. Re-elected in 1960. Redistricted to the . 1953–1963 Parts of Nassau county James R. Grover Jr. Republican January 3, 1963 – January 3, 1975 Elected in 1962. Re-elected in 1964. Re-elected in 1966. Re-elected in 1968. Re-elected in 1970. Re-elected in 1972. Lost re-election. 1963–1973 Parts of Nassau, Suffolk counties James R. Grover Jr. Republican January 3, 1963 – January 3, 1975 Elected in 1962. Re-elected in 1964. Re-elected in 1966. Re-elected in 1968. Re-elected in 1970. Re-elected in 1972. Lost re-election. 1973–1983 Parts of Suffolk county Thomas J. Downey Democratic January 3, 1975 – January 3, 1993 Elected in 1974. Re-elected in 1976. Re-elected in 1978. Re-elected in 1980. Re-elected in 1982. Re-elected in 1984. Re-elected in 1986. Re-elected in 1988. Re-elected in 1990. Lost re-election. 1973–1983 Parts of Suffolk county Thomas J. Downey Democratic January 3, 1975 – January 3, 1993 Elected in 1974. Re-elected in 1976. Re-elected in 1978. Re-elected in 1980. Re-elected in 1982. Re-elected in 1984. Re-elected in 1986. Re-elected in 1988. Re-elected in 1990. Lost re-election. 1983–1993 Parts of Suffolk county Rick Lazio Republican January 3, 1993 – January 3, 2001 Elected in 1992. Re-elected in 1994. Re-elected in 1996. Re-elected in 1998. Retired to run for U.S. senator. 1993 – 2003 Parts of Suffolk county Steve Israel Democratic January 3, 2001 – January 3, 2013 Elected in 2000. Re-elected in 2002. Re-elected in 2004. Re-elected in 2006. Re-elected in 2008. Re-elected in 2010. Redistricted to the . 1993 – 2003 Parts of Suffolk county Steve Israel Democratic January 3, 2001 – January 3, 2013 Elected in 2000. Re-elected in 2002. Re-elected in 2004. Re-elected in 2006. Re-elected in 2008. Re-elected in 2010. Redistricted to the . 2003 – 2013 Parts of Nassau, Suffolk counties Peter T. King Republican January 3, 2013 – January 3, 2021 Redistricted from the and re-elected in 2012. Re-elected in 2014. Re-elected in 2016. Re-elected in 2018. Retired. 2013 – Present Parts of Nassau, Suffolk counties Andrew Garbarino Republican January 3, 2021 – Present Elected in 2020. 2013 – Present Parts of Nassau, Suffolk counties ==Recent election results== New York election law allows for fusion voting, where a candidate can run as a member of multiple parties. The pooled vote totals for candidates are listed first, and the split of the votes among the parties they ran as is listed beneath. See below for blank, void, and scattering notes.* Results 2000-2010 Year Democrat Democrat Votes Pct Republican Republican Votes Pct 3rd Party 3rd Party Party Votes Pct 2000 Steve Israel Steve Israel 90,438 48% Joan B. Johnson Joan B. Johnson 65,880 35% Robert Walsh Robert Walsh Right to Life 11,224 6% 2000 Democratic 90,438 Republican 65,880 Richard N. Thompson Richard N. Thompson Conservative 10,824 6% 2000 David A. Bishop David A. Bishop David A. Bishop 10,266 5% 2000 Independence Independence 7,595 2000 Green Green 1,404 2000 Working Families Working Families 1,267 2002 Steve Israel Steve Israel 85,451 58% Joseph P. Finley Joseph P. Finley 59,117 40% John Keenan John Keenan Green 1,558 1% 2002 Democratic 75,845 Republican 48,239 2002 Independence 7,632 Conservative 5,772 2002 Working Families 1,974 Right to Life 5,106 2004 Steve Israel Steve Israel 161,593 67% Richard Hoffmann Richard Hoffmann 80,950 33% 2004 Democratic 147,197 Republican 72,953 2004 Independence 9,508 Conservative 7,997 2004 Working Families 4,888 2006 Steve Israel Steve Israel 105,276 70% John W. Bugler John W. Bugler 44,212 30% 2006 Democratic 94,100 Republican 37,671 2006 Independence 7,443 Conservative 6,541 2006 Working Families 3,733 2008 Steve Israel Steve Israel 161,279 67% Frank J. Stalzer Frank J. Stalzer 79,641 33% 2008 Democratic 143,759 Republican 70,145 2008 Independence 11,900 Conservative 9,496 2008 Working Families 5,620 2010 Steve Israel Steve Israel 94,694 56% John Gomez John Gomez 72,115 43% Anthony Tolda Anthony Tolda CST 1,258 1% 2010 Democratic 84,211 Republican 53,747 2010 Independence 6,353 Conservative 13,525 2010 Working Families 4,130 2012 Vivianne Falcone Vivianne Falcone 92,060 41% Peter T. King Peter T. King 131,091 59% 2014 Patricia Maher Patricia Maher 40,009 28% Peter T. King Peter T. King 91,701 65% 2016 Du Wayne Gregory Du Wayne Gregory 110,938 38% Peter T. King Peter T. King 181,506 62% 2018 Liuba Grechen Shirley Liuba Grechen Shirley 106,996 45% Peter T. King Peter T. King 122,103 53% 2018 Democratic 102,977 Republican 107,495 2018 Women's Equality 1,371 Conservative 11,742 2018 Working Families 2,648 Independence 2,417 2020 Jackie Gordon Jackie Gordon 154,123 46% Andrew Garbarino Andrew Garbarino 177,353 53% Harry Burger Harry Burger Green 3,446 1% 2020 2020 2020 Blank, void, and write-in candidate (\"scattering\") notes: In 2000, there were 37,596 BVS votes; in 2002, 14,087; in 2004, 40,937; and in 2006, 14,101. Since 2008, results were separated out, and there were 54,163 blank votes; 10 void ballots; and 12 votes cast for write-in candidates. In 2010, 7,104 were blank votes; 93 were void ballots; and thirty were votes cast for write-in candidates. == References == 02",
 "title": "New York's 2nd congressional district"
}