{
 "id": "82649",
 "text": "This page lists the current heads of state and governments in the world. They are heads of state and heads of government. In some cases they are de facto leaders not occupying either of those positions or prime ministers who are not heads of government. 196 states (193 UN members + 2 UN observers ) are the basic list. Also there are leaders of 10 other national entities (quasi and unrecognized states, and of 7 in exile and/or alternative governments (only in exile governments that exercised power or succeeded governments that exercised power). For local rulers, for example rulers of dependencies and of the main administrative divisions, such as autonomous regions, insular or peninsular regions, successors of historical regions or regions with strong identity, regions in the news, etc.) see List of the main local rulers. ==Member and observer states of the United Nations== Colour key State Head of state Head of government |President – Bajram Begaj Prime Minister – Nadir Larbaoui Episcopal Co-Prince – Joan Enric Vives i Sicília French Co-Prince – Emmanuel Macron colspan=\"2\" King – Charles III colspan=\"2\" President – Vahagn Khachaturyan |King – Charles III President – Alexander Van der Bellen Prime Minister – Ali Asadov King – Charles III Prime Minister – Prince Salman bin Hamad Al Khalifa |President – Mohammed Shahabuddin President – Dame Sandra Mason colspan=\"2\" Prime Minister – Aleksandr Turchin King – Philippe King – Charles III colspan=\"2\" King – Jigme Khesar Namgyel Wangchuck colspan=\"2\" colspan=\"2\" Chairwoman of the Council of Ministers – Borjana Krišto Members: * Željka Cvijanović (Chairwoman) * Denis Bećirović * Željko Komšić colspan=\"2\" colspan=\"2\" colspan=\"2\" President – Rumen Radev colspan=\"2\" Prime Minister – Gervais Ndirakobuca colspan=\"2\" King – Norodom Sihamoni Prime Minister – Joseph Ngute King – Charles III President – José Maria Neves Prime Minister – Félix Moloua Prime Minister – Allamaye Halina colspan=\"2\" colspan=\"2\" President – Xi Jinping Premier – Li Qiang colspan=\"2\" colspan=\"2\" Prime Minister – Judith Suminwa Prime Minister – Anatole Collinet Makosso colspan=\"2\" President – Zoran Milanović colspan=\"2\" President – Miguel Díaz-Canel Prime Minister – Manuel Marrero Cruz colspan=\"2\" President – Petr Pavel King – Frederik X Prime Minister – Abdoulkader Kamil Mohamed President – Sylvanie Burton colspan=\"2\" colspan=\"2\" Prime Minister – Mostafa Madbouly colspan=\"2\" Prime Minister – Manuel Osa Nsue Nsua colspan=\"2\" President – Alar Karis Prime Minister – Russell Dlamini Ndlovukati – Ntfombi President – Taye Atske Selassie President – Ratu Naiqama Lalabalavu President – Alexander Stubb colspan=\"2\" colspan=\"2\" colspan=\"2\" President – Mikheil Kavelashvili President – Frank-Walter Steinmeier colspan=\"2\" President – Konstantinos Tasoulas King – Charles III colspan=\"2\" colspan=\"2\" Prime Minister – Bah Oury Prime Minister – Rui Duarte de Barros Prime Minister – Mark Phillips colspan=\"2\" President – Tamás Sulyok President – Halla Tómasdóttir President – Droupadi Murmu colspan=\"2\" President – Masoud Pezeshkian President – Abdul Latif Rashid President – Michael D. Higgins President – Isaac Herzog President – Sergio Mattarella Prime Minister – Robert Beugré Mambé King – Charles III Emperor – Naruhito Prime Minister – Jafar Hassan Prime Minister – Oljas Bektenov colspan=\"2\" colspan=\"2\" Prime Minister – Ahmad Al-Abdullah Al-Sabah Chairman of the Cabinet of Ministers – Adylbek Kasymaliev colspan=\"2\" President – Thongloun Sisoulith Prime Minister – Sonexay Siphandone President – Edgars Rinkēvičs President – Joseph Aoun King – Letsie III colspan=\"2\" \\- \\--> Prime Minister – Brigitte Haas President – Gitanas Nausėda Grand Duke – Henri Prime Minister – Christian Ntsay colspan=\"2\" King – Sultan Ibrahim Iskandar colspan=\"2\" President – Myriam Spiteri Debono colspan=\"2\" Prime Minister – Mokhtar Ould Djay President – Dharam Gokhool colspan=\"2\" colspan=\"2\" President – Ukhnaagiin Khürelsükh President – Jakov Milatović Prime Minister – Aziz Akhannouch Prime Minister – Maria Benvinda Levy colspan=\"2\" Prime Minister – Min Aung Hlaing Prime Minister – Elijah Ngurare colspan=\"2\" President – Ram Chandra Poudel King – Willem-Alexander King – Charles III colspan=\"2\" colspan=\"2\" Prime Minister – Ali Lamine Zeine {{small|Acting President – Kashim Shettima --> colspan=\"2\" President of the State Affairs Commission – Kim Jong Un Premier – Pak Thae-song President – Gordana Siljanovska-Davkova King – Harald V colspan=\"2\" President – Asif Ali Zardari colspan=\"2\" Prime Minister – Mohammad Mustafa colspan=\"2\" King – Charles III colspan=\"2\" Prime Minister – Eduardo Arana Ysa colspan=\"2\" President – Andrzej Duda |President – Marcelo Rebelo de Sousa Prime Minister – Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani Prime Minister – Mikhail Mishustin Prime Minister – Édouard Ngirente King – Charles III King – Charles III King – Charles III O le Ao o le Malo – Afioga Tuimalealiʻifano Vaʻaletoʻa Sualauvi II Captain Regent – Denise Bronzetti rowspan=\"2\" Captain Regent – Italo Righi Prime Minister – Ousmane Sonko colspan=\"2\" Chief Minister – David Moinina Sengeh President – Tharman Shanmugaratnam President – Peter Pellegrini President – Nataša Pirc Musar King – Charles III colspan=\"2\" Prime Minister – Lee Ju-ho colspan=\"2\" King – Felipe VI Prime Minister – Harini Amarasuriya colspan=\"2\" King – Carl XVI Gustaf colspan=\"2\" colspan=\"2\" Prime Minister – Kokhir Rasulzoda Prime Minister – Kassim Majaliwa King – Maha Vajiralongkorn President – José Ramos-Horta King – Tupou VI President – Christine Kangaloo Prime Minister – Sara Zaafarani colspan=\"2\" colspan=\"2\" colspan=\"2\" King – Charles III Prime Minister – Robinah Nabbanja Prime Minister – Denys Shmyhal Prime Minister – Sheikh Mohammed bin Rashid Al Maktoum King – Charles III colspan=\"2\" colspan=\"2\" Prime Minister – Abdulla Aripov President – Nikenike Vurobaravu (Holy See) President of the Governorate – Sister Raffaella Petrini colspan=\"2\" colspan=\"2\" President – Lương Cường Prime Minister – Phạm Minh Chính Prime Minister – Ahmad Awad bin Mubarak colspan=\"2\" colspan=\"2\" ==Other states== The following states are in free association with a UN member state. State Associated with Head of state Head of government King – Charles III King – Charles III The following states control at least part of their territory and are recognised by at least one UN member state. State Also claimed by Head of state Head of government Prime Minister – Vladimir Delba (Taiwan) Premier – Cho Jung-tai President – Vjosa Osmani Prime Minister – Ünal Üstel colspan=\"2\" President – Brahim Ghali Prime Minister – Bouchraya Hammoudi Bayoun Prime Minister – Konstantin Dzhussoyev The following states control their territory, but are not recognised by any UN member states. State Also claimed by Head of state Head of government colspan=\"2\" Prime Minister – Aleksander Rozenberg ==Other governments== This alternative government controls part of its territory and is recognised as legitimate by at least one UN member state. Government State Head of state Head of government Supreme Political Council colspan=\"2\" Prime Minister – Ahmed al-Rahawi These alternative governments control part of their territory, but are not recognized as legitimate by any UN member states. Government State Head of state Head of government Government of National Stability colspan=\"2\" Chairman of the Presidential Council – Mohamed al-Menfi National Unity Government Prime Minister – Mahn Winn Khaing Thann Hamas government in the Gaza Strip colspan=\"2\" Head of the Government Administrative Committee – Vacant Government of Peace and Unity Prime Minister – Vacant These alternative governments do not control their territory but are recognized as legitimate by at least one UN member state. Government State Head of state Head of government Coordination Council colspan=\"2\" Georgia (opposition) colspan=\"2\" ==Sui generis entities== Entity Head of entity Head of government President of the European Council – António Costa Sovereign Military Order of Malta Grand Chancellor – Riccardo Paternò di Montecupo ==Notes== ==References== Category:Heads of government * National rulers",
 "title": "List of current heads of state and government"
}