{
 "id": "826438",
 "text": "Vasyl Yaroslavovych Virastyuk (Ukrainian: Васи́ль Яросла́вович Вірастю́к; born April 22, 1974 in Ivano-Frankivsk) is a Ukrainian actor, strongman, Honored Master of Sports of Ukraine and holder of the titles \"Strongest Man of Ukraine\" (2000, 2001, 2002, 2003, 2005) and \"Strongest Man in the World\" ( 2004). Member of the national team of Ukraine, which won the title of \"Strongest Nation in the World\" in 2003 and 2004. == Biography == Vasyl Virastyuk was born on April 22, 1974 in Ivano-Frankivsk in the family of a truck driver. Brother Roman Virastyuk (April 21, 1968 - July 27, 2019), who became a bronze medalist of the European Championship in shot put in 1994. At the age of 10 he started doing athletics, pushing nuclei. At the age of 13, he got behind the wheel of a truck for the first time and immediately drove 25 kilometers. 1981 - went to the first grade of Ivano-Frankivsk secondary school № 4. 1989 - finished the 8th grade and entered the College of Physical Culture of his hometown. 1992 - after graduating from college he served in the military for 2 years. In 1994-2000 he worked as an athletics coach at the Ukraine Sports Association. Since 2000 he has lived in Lviv and worked as a security guard at Concern Galnaftogaz. From 1984 to 2000 he was involved in athletics - shot put. He was a member of the national team of Ukraine in athletics. In 1995 he fulfilled the standards of a master of sports. In 1998 he fulfilled the standards of a master of sports of international class. Since 2000 he has been involved in STRONGESTMAN power all-around. In 2002 he became the third in the competition for the title of \"Strongest in Central Europe\" and won the Grand Prix of the international tournament in Salzburg (Austria). He was sixth in the IFSA (International Federation of the World's Strongest Athletes) superseries. In 2003, he won third place at the Strongmen World Championships in Zambia. In 2004, he won the World's Strongest Man Championships in the Bahamas. But he took sixth place in the most prestigious competitions in power sports \"Arnold Classic\". In the same year, Vasyl took part in the TV show \"Fort Boyer\", where he was captain of the team of Heroes. In 2007 he won the competition in Seoul (South Korea) and won the IFSA World Extreme Power Champion title. In September of that year, the \"strongman\" remarried. His wife Inna is an employee of the German pharmaceutical company Bayer in Ukraine. On March 19, 2008, Vasyl had a second son, the baby was named Oleg. He starred in the films How Cossacks… (2009) and Ivan Sila (2013) On November 9, 2015, the State Border Guard Service of Ukraine announced that Vasyl Virastyuk had become a Border Guard Inspector (serving his term at Lviv Airport). As a result, it turned out that Vasyl became the hero of the TV project \"Western Border\", produced by the Lviv regional TV channel NTA. == Politics == On February 11, 2021, at the congress of the pro-government Servant of the People party, Virastyuk was nominated as a candidate for by- elections in the 87th constituency of Ivano-Frankivsk region, where Marusya Zvirobiy had previously been nominated as a candidate from the European Solidarity party. Category:1974 births Category:Living people Category:Ukrainian actors",
 "title": "Vasyl Virastyuk"
}