{
 "id": "826698",
 "text": "\"Belau rekid\" (; \"Our Palau\") is the national anthem of Palau. It was officially adopted in 1980. The music was written by Ymesei O. Ezekiel, to which the combined words of several authors were set. ==Lyrics== The lyrics are officially sung in Palauan, but has been translated into the two other official languages of Palau, English and Japanese. Palauan original IPA transcription English translation Japanese translation Belau loba klisiich er a kelulul, El dimla ngarngii ra rechuodelmei Meng mengel uoluu er a chimol beluu, El ngar cheungel a rirch lomke sang. Bo dole ketek a kerruul er a belluad, Lolab a blakelreng ma duchelreng. Belau a chotil a klengar re kid, Mebo dorurtabedul msa klisichel. Bod kai ue reke dchim lokiu a reng, E dongedmokel ra dimla koted. Lomcheliu a rengrdel ma klebkellel, Lokiu a budch ma beltikelreng. Dios mo mek ngel tengat ra be lumam, El dimla dikesam ra rechuodelmei, Beskemam a klisicham ma llemeltam, Lorrurt a klungiolam elmo ch'rechar. [bɛ.lau̯ lo.ba kli.siːʔ ɛɾ a ʁ̞ə.lu.lul] [ɛl di mla ɴaɾ(ə) ɴiː ɾa ɾə.ʔu̯o.ðəl mɛi̯] [məɴ mə.ɴə.lu̯o.lu ə.ɾa ʔi.mol bə.luː] [ɛl ɴaɾ(ə) ɛu̯.ɴɛl a ɾiɾ(ə)ʔ əl lo.mə.ʁ̞ə.saɴ] [bo.ðo lə.ʁ̞ɛ.təʁ̞ a ʁ̞ə.ɹuːl ɛ.ɾa bə(l).lu̯að] [lo.lab a blaʁ̞ əl ɹɛɴ ma ðuʔ əl ɹɛɴ] [bɛ.lau̯ a ʔo.til a klə.ɴaɹ ɹə gið] [mɛ bo.ðo ɹuɹt a bə.ðul m.sa kli.si.ʔɛl] [bo ðə.ʁ̞ai̯.u̯ə.ɾɛ.ʁ̞ə.ðə ʔim lo.giu̯ a ɾɛɴ] [ɛ ðo ɴəd.mokl ə.ɹa di mla ʁ̞o.tɛð] [lo.mə.ʔə.liu̯ a ɾə.ɴə.ðɛl ma kləb.kəl.lɛl] [lo.giu̯ a bu.ðə.ʔə ma bəl.dig əl ɹɛɴ] [di̯os mo məɢ.ɴəl.də.ɴat (ə)ɾa bɛ.lu.mam] [ɛl di mla ði.ʁ̞ə.sam(ə) ɾa ɾə.ʔu̯o.ðəl mɛi̯] [bəs.kə.mam a kli.si.ʔam ma lːə.məl.tam] [lo.ɹuɹt a klu.ɴi̯o.lam əl mo ʔə.ɾə.ʔaɹ] Palau is coming forth with strength and power, By her old ways abides still every hour. One country, safe, secure, one government Under the glowing, floating soft light stands. Let's build our economy's protecting fence With courage, faithfulness and diligence Our life is anchored in Palau, our land We with our might through life and death defend. In spirit let's join hands, united, one Care for our homeland from forefathers on Look after its concord, its glory keep Through peace and love and heart's devotion deep. God bless our country, our island home always Our sweet inheritance from ancient days Give us strength and power and all the rights To govern with to all eternity with might. 我らが強きパラオよ 英雄の古の伝統 一つの国 我らがパラオ 輝きは英雄の下に. さぁ我らの経済を守る仕切を立てよう 勇気、忠誠心、勤勉さと共に 我らの人生はここ、パラオに根付いている 我らは生と死を通じ、自分たちの力を持って守る. さぁ魂を持って、一つにまとまろう 先祖代々からの故郷を想い この調和を守り、その栄光を 平和、愛、深い真心の中にとどめよう. 神よ、我が国に恵みを、我らの故郷に常に 古代より受け継いできたもの 我らに強さ、力、そしてすべての権力を与えたまえ それらをもって永遠に世を治めるために. ==References== Category:Palau Category:Oceanian anthems",
 "title": "Our Palau"
}