{
 "id": "826640",
 "text": "Sergey Leonidovich Tihipko (, born 13 February 1960) is a Ukrainian politician and financier, PhD in Economics. He is former Vice Prime Minister and Minister of Social Policy of Ukraine. == Biography == Serhiy Tihipko was born on 13 February 1960 in Dragoneshty, Moldovan SSR. He started his education in the local school. Then he entered the Metallurgical Institute in Dnipropetrovsk, Ukraine and graduated in engineering-metallurgy in 1982. For 2 years later he served in the Armed Forces of the USSR (tank troops). From 1984 to 1986 he worked as a Secretary of the Komsomol Committee, Head of the Department and Deputy Director for Training and Production of the Dnipropetrovsk Mechanical and Metallurgical Technical School. He was a Secretary for Propaganda and Agitation of the Dnipropetrovsk Regional Committee of the LKSMU from 1987 to 1989. After 90's he started to work with finances and in 1991 became a Deputy Chairman of the Board of Dnipro Bank and a year later a Chairman of the Board of Privatbank (Dnipropetrovsk). But he left the FIG \"Privat\" in 2001. In 1994 he was close to Leonid Kuchma and was his freelance monetary policy adviser. From 1997 Tihipko became a Deputy Prime Minister for Economic Affairs in the office of Pavel Lazarenko. Then he became the 10th Minister of Economy of Ukraine and took that position till 2000. Tihipko became a Chairman of the National Bank in 2002, from 2005 to 2007 he was a Chairman of the Board of Financial and Industrial Group TAS and a Chairman of the Board of OJSC \"Swedbank\" from 2007. From 2009 he took a post of a Deputy Prime Minister in the government of Azarov (2010), Minister of Social Policy (2010), Deputy Chairman of the Party of Regions (2012) and he is a Chairman of the Strong Ukraine political party from 2014 till now. == Political activity == Tihipko started his active work as a Ukrainian politician in 2000 when he was elected a deputy of the Verkhovna Rada and became a member of the Verkhovna Rada Committee on Finance and Banking. He effectively cooperated with Ukrainian leaders. In 2003 he headed the election headquarters of Viktor Yanukovych, then in 2008 he became an Adviser to the Prime Minister of Ukraine Yulia Tymoshenko. In 2009 he headed the Strong Ukraine party and a year later created the \"Tigipko Bloc\". Tihipko prepared the Pension Reform in 2011 and the Law on decriminalization of economic crimes in 2021. Both were approved by the Verkhovna Rada of Ukraine. In 2014 he ran for the President of Ukraine and would like to lead the Party of Regions, but the trial wasn`t successful. This year he was also among the people's deputies who voted for \"dictatorial laws\". == Business == Tihipko is a businessman too. He is an owner of PE \"Cititrend- Step\" and PJSC Insurance Company \"Industrialna\". Also he owns a number of different enterprises. Since 2016, he owns 99% of the shares of Universal Bank, a branch of which is Monobank. By the rank of the magazine \"NV\" \"Top 100 richest Ukrainians\", published in October 2019, the fortune of Serhiy Tihipko is estimated at $ 407 million. He took the 17th place in the ranking. == Awards == He was rewarded as a Knight of the Order of the Legion of Honor. == Private life == He is married and has 4 children. Firstly, he married in 1981 with Natalia Tihipko. They had a daughter Anna in 1984. She studied in Oxford and currently works in one of the parent companies. But Serhiy Tihipko and Natalia Tihipko divorced in 2004. Now she manages the medical clinic TAS and the newspaper \"Economic News\", is related to the enterprises (LLC) \"Nafto-gas Service\"; \"First International Finance Corporation\"; \"VS Extra LTD\". He married for the second time in 2004 with Victoria Tihipko. She is an organizer of the IDCEE forum, since 2010 is included in the rating of \"100 most influential women of Ukraine\". They had 3 children in 2002, 2005 and 2008. Category:1960 births Category:Living people Category:Ukrainian politicians Category:Ukrainian businesspeople Category:People from Dnipropetrovsk Oblast Category:Moldovan people",
 "title": "Serhiy Tihipko"
}