{
 "id": "826923",
 "text": "Bidzina Kulumbegov (b. 30 January, 1980) is a Georgian pediatrician, allergist and TV presenter. ==Biography== 1999-2005 he studied at Tbilisi State Medical University. 2005-2008 he was a resident of Tbilisi State Medical University - a pediatrician. In 2008 he passed a 3-month internship in Austria. At the Linz Mothers and Children Clinic. In 2008-2009 he was a junior doctor at the Center for Allergy and Immunology. In 2009 he received a state certificate. Since 2010 he has been working at the Center for Allergy and Immunology (Pediatric Allergist). Since 2016, he is the co-host of the Imedi TV program \"Day Show\" From 2002 to 2005 he was a member of the University ( Tbilisi State Medical University ) iv. Member of the Tarkhnishvili Student Scientific Society, Chairman of the Pediatrics Section; Young member of the European Academy of Allergy and Clinical Immunology since 2005. In 2003 he participated in the European Medical Students Association and Iv. Tarkhnishvili TSMU Student Scientific LXVI Conference. Has received the Presidential Award for 1st place. In 2004, at the LXVII Conference of the same name, he again received the Presidential Award for 1st place. In 2004 he participated in the II European Asthma Congress in Tbilisi . In 2005 he became a scholarship holder of the President of Georgia. In 2005 participated in the Leiden International Student Medical Congress ( Netherlands; Speaker); 2009 - European Pediatric Allergy and Asthma Meeting (Venice, Italy). In 2011 he became a young member of the European Respiratory Society. In 2012 he participated in the European Academy of Allergology and Clinical imunologi Congress (Milan, Italy). From 2020, together with Gvantsa Daraselia, he is co-host of the program \"Pandemia\" on Rustavi 2. ==Scientific activity== # Researcher, Pierre-Fabre atopic dermatitis study, 2012 ; # Phase 3 Phase Study, Beringer Ingelheim, 2012 - 2013 ; # Research Coordinator, Pediatric Asthma Research, Glaxo, 2013. ==Publications== # B. Kulumbegov , \"Sensitization of fungal allergens in children with respiratory allergies\", 2009, European Congress of Pediatric Allergists, Venice; # N. Sanodze , N. Uber , e. Uber , b. Kulumbegov , Parameters of oxidative metabolism in patients with sepsis during anemia, 2006, Sak. Medical news; # B. Kulumbegov , Peculiarities of Correction of Anemia in Patients with Chronic Renal Failure, Leiden Student International Congress, 2005 . ==References== ==Other websites== * Biographical Dictionary of Georgia Category:Living people Category:1980 births",
 "title": "Bidzina Kulumbegov"
}