{
 "id": "827019",
 "text": "The Big Three television networks are the three biggest television networks in the United States that are still running. These networks are ABC, CBS, and NBC. The Big Three networks ruled over television in the United States until the 1990s.Douglas Blanks Hindman; Kenneth Wiegand (2008). \"The big three's prime-time decline: a technological and social context\" (PDF). Journal of Broadcasting & Electronic Media. Retrieved March 19, 2014 To this day, they are still considered major, long-lasting United States television networks. == Backgrounds == NBC and CBS were both founded as radio networks in the 1920s. Later on, NBC would have two radio networks for the United States. These networks were the Red Network and the Blue Network. They soon began television stations in the 1930s. In 1943, the U.S. government noticed how unfair it was for NBC to have two networks. They forced NBC to sell one of their networks. NBC chose to sell the Blue Network. Later on, the Blue Network became the ABC. The DuMont Television Network launched in 1944.H. Castleman; W. Podrazik (1982). Watching TV: Four Decades of American Television. New York: McGraw-Hill. p. 314. The three networks once controlled a few television stations. After a while, they affiliated with other stations to cover almost the entire United States by the late 1950s. Most of these stations are affiliated somehow with all three major networks and DuMont in markets where only one or two television stations operated in the early years of commercial television. It made some TV shows hard to handle. As more stations signed on, ABC, NBC, and CBS could carry enough programming on one station. DuMont did not have a radio network like ABC or CBS. During all this, the Mutual Broadcasting System had considered creating a TV network. They would have Metro-Goldwyn-Mayer make some of the programming. WOR-TV & WOIC were known as \"Mutual Television.\" This is the only evidence of the television network. Mutual then bought a stake in the Overmyer Network in 1967. That network never succeeded. == Network competition == === Early years === For most of television history, the Big Three controlled most of television.Schneider, Michael (2016-12-27). \"Most-Watched Television Networks: Ranking 2016's Winners and Losers | IndieWire\". www.indiewire.com. Retrieved 2017-08-11. DuMont stopped airing in 1955. From 1961 to the early 1990s, there were only three networks. Every hit series and every feature movie was aired by one of the Big Three networks. There were attempts to become the fourth network. But they never work out. The cost of starting a network, the difficulty of competing with the Big Three and broadcasting were common in the 1980s. The Big Three had just enough stations to defeat anyone who tried to be just like them. Those networks that could have had the chance to compete would shut down because of legal threats. === Fox === An attempt for a fourth television network for the Big Three would not happen again until Fox was founded in October 1986. Fox became a fourth network in 1994 after a law forcing cable providers to add local stations was approved. The rules allowed Fox to become recognized by most audiences and become the fourth network. Fox has beaten ABC and NBC in the ratings for its primetime programming. This made Fox become the second most-watched network behind CBS during the 2000s. From 2007 to 2008, Fox was the highest-rated of the big broadcast networks. Fox was even the first non-Big Three network to reach first place. From 2004 to 2012, Fox became known for its 18-49 demographic shows. Because of its success, it has been included with the Big Three. It was used with the term \"Big Four.\" Although Fox is known as the nation's fourth major network, it is not considered part of the Big Three. One reason being that Fox reduced its weekday programming. It does not have enough national morning and evening news programs. Fox does not feature any daytime programming, enough primetime, late-night talk shows, and Saturday morning children's programming. Fox had a block for children's programs in the 1990s called Fox Kids. However, it was sold to The Walt Disney Company in 2001 as part of Fox Family Channel. Outside of prime time, Fox affiliates either make their programming or run syndicated shows. Fox also allows affiliates the option to air the Xploration Station block on Saturday mornings in place of the optional Weekend Marketplace infomercials block. === Fifth and sixth networks === Other networks soon launched in an attempt to compete with the Big Three as well as Fox. However, these \"netlets\" were not as successful as Fox. The WB\"Time Warner TV Network to Cover 40% of Nation\". The Buffalo News. HighBeam Research. November 2, 1993. Archived from the original on June 10, 2014. Retrieved May 28, 2013. and UPN launched in 1995. Just like Fox, they both added nights of prime time programming a few years later. The WB was the only one that aired any on weekends. Both networks only aired prime time and children's programming. The children's programming was the only form of weekday daytime programming offered by either one. UPN discontinued its children's programming in 2003 after a deal with Disney. After that, UPN aired sports events such as the XFL, as well as WWF SmackDown!. Although The WB and UPN both had some popular series during their time, they struggled from poor viewership and financial losses. It led their parent companies (Time Warner and CBS Corporation) to shut them down in 2006. They soon joined together in a joint venture called The CW. It originally had a mix of programs from their past networks. But they soon made new shows after the launch. Fox launched MyNetworkTV at the same time as The CW, with a lineup of English language telenovelas.\"News Corp. Unveils My Network TV\". Broadcasting & Cable. February 22, 2006. Not retrieved, lost. Later on, it shifted towards unscripted programs and movies. But because of low ratings, it led News Corporation to convert the channel into a syndication service in 2009.Michael Malone (February 9, 2009). \"MyNetworkTV Shifts From Network to Programming Service\". Broadcasting & Cable. Not retrieved, lost. === PBS === Like Fox, the PBS is not considered part of the Big Three networks. PBS is a noncommercial service with a different distribution model compared to the major networks. Its stations own the network rather than the network owning some of its stations and affiliating with additional stations owned by other broadcasters. It keeps memberships with more than one educational station. === Market share === Today, the \"Big Three\" only control a small portion of the television market in the United States. It has suffered as a result of growing competition from other networks. Traditional networks such as Fox, The CW, and MyNetworkTV, Spanish language networks such as Univision and Telemundo, even national cable and satellite channels such as TNT, ESPN, and AMC, and web channels such as Netflix are sharing the space as well. == Related pages == * Cable television * Communication * High-definition television * Television * Television movie * Big Five * Major movie studios ==References== Category:Television networks Category:Television",
 "title": "Big Three television networks"
}