{
 "id": "827059",
 "text": "Shakespeare's editors were important in the making of producing printed books and the evolution of textual criticism. == Before the editors == The 17th- century folio collections of the plays of William Shakespeare did not have editors. At the time, it was agreed that the plays included in the First Folio (1623) were to be gathered together or \"compiled\" by John Heminges and Henry Condell. They were two long-time coworkers of Shakespeare in the King's Men. The play manuscripts may have been proofread and prepared for printing by Edward Knight. He is the \"book-keeper\" or prompter of the company. The task of proofreading and correcting the actual printed pages of the Folio was left to the compositors and printers in the print-shop. Not a lot is known about the making of the Second (1632), Third (1663–64), and Fourth Folios (1685). == The 18th century == In the 18th century, some people made the first coordinated efforts to fix the problems that the Folios presented. * Nicholas Rowe, 1709. Rowe was the first person to attempt an understandable form of the plays. The problem was that he relied on a copy of the Fourth Folio and made incorrect edits. He added stage directions to the plays. He made full lists of characters. He also wrote the first biographical sketch of Shakespeare. * Alexander Pope, 1725. Pope was the first to attempt organizing the scripts of the plays. But he created what was basically an equal copy of Rowe that added a little more. * Lewis Theobald, 1733. Theobald has been called \"the first Shakespeare scholar.\" He continued work on organizing the scripts and began studying Shakespeare's sources and the order of the plays' music. * Thomas Hanmer, 1744. Hanmer relied on Theobald's text and made random corrections. His edition was similarly copied in 1770. * William Warburton, 1747. Warburton continued Pope's work. In the introduction, Warburton wrote that his friend Pope \"was desirous I should give a new Edition of this Poet, as he thought it might contribute to put a stop to a prevailing folly of altering the Text of celebrated Authors without Talents or Judgment. And he was willing that his Edition should be melted down into mine, as it would, he said, afford him (so great is the modesty of an ingenuous temper) a fit opportunity of confessing his Mistakes.\" :It means Pope decided that Warburton should give a new Edition of Shakespeare's work. The phrase \"without Talents or Judgment\" refers to Theobold and Hanmer. However, Warburton did allow some edits by Theobold and Hanmer.Warburton, William (1747). The Works of Shakespeare. London: J. & P. Knapton; S. Birt; T. Longman & T. Shewell; and others. pp. title page, xix, & xiii. It means that all the corrections which these two Editors have made are written into the Text. These edits are carefully assigned to their relative authors. * Thomas Edwards, 1748. Edwards published Supplement to Warburton's Edition of Shakespeare, in later versions of The Canons of Criticism. Supplement to Warburton's Edition of Shakespeare is a satirical but spot-on look at Warburton's edits.See, for example: Edwards, Thomas (1765). The Canons of Criticism, and Glossary (7 ed.). London: C. Bathurst. Samuel Johnson said that soon after Canons of Criticism came out, Johnson was dining at Tonson the Bookseller's with his friends. Hayman agreed with Sir Joshua Reynolds about the book that the conversation turned into praise for Edwards's book. But when they went further and talked about Edward's relationship with Warburton, Johnson said, \"Nay, he has given him some smart hits to be sure; but there is no proportion between the two men; they must not be named together. A fly, Sir, may sting a stately horse and make him wince; but one is but an insect, and the other is a horse still.\"Boswell, James (1807). Malone, Edmond (ed.). The Life of Samuel Johnson. London: T. Cadell & W. Davies. p. 207, note 7. * Samuel Johnson, 1765. Johnson relied on Warburton's edits for his edition. His edits are interesting mostly because of its introduction. * Edward Capell, 1768. Horrified by the random edits of Hanmer and Warburton, Capell spent 30 years organizing the scripts. * George Steevens, 1773. Steevens used Johnson's text and added new material. Steevens changed the text and re-issued his edition in 1778. In 1780 Edmond Malone added 2 more volumes that had Shakespeare's works. Isaac Reed changed the Steevens edition again in 1785. Steevens himself made one final, 15-volume change in 1793. * Edmond Malone, 1790. Malone wrote the first overall edit of English Renaissance theatre. He relied on tools like the records of the Master of the Revels and Edward Alleyn's papers at Dulwich College. == The 19th century == The early 19th century saw the first Variorum editions of Shakespeare's works. These are editions that organized and combine the efforts of all the editors from the 18th century. The first edition edited by Isaac Reed released in 1803. The second edition released in 1813 changed a few things from the first. The third edition edited by James Boswell released in 1821.Not the famous Boswell, the biographer of Johnson, but rather his third son (1778–1822): Michael Dobson and Stanley Wells: The Oxford Companion to Shakespeare. OUP 2001. p. 52. These editions set the standards for professionally fixing works such as Shakespeare's works. The text was permanently setde Grazia 1991, p. 14. in the Cambridge edition. It was also set by the Globe edition (1864). It continued on by the New Cambridge edition in 1921. Now, all editions come mostly from this edition. The Cambridge Shakespeare (1863–66), moved away from a single editor following his own instincts and judgments. The first volume of the Cambridge Shakespeare was edited by William George Clark and John Glover. And the later eight volumes by Clark and William Aldis Wright. Clark and Wright also created the single-volume Globe Shakespeare (1864) using their Cambridge texts. Together, these editions became the standard for a while. == The 20th century == One edition in the twentieth century was the Oxford Shakespeare. It was edited by Stanley Wells and Gary Taylor. It looks to show the scripts as they were originally written.(2013) Shakespeare's editors (December 2020 Edition) Wikipedia == References == Category:William Shakespeare",
 "title": "Shakespeare's editors"
}