{
 "id": "827226",
 "text": "\"Lithuania, Our Homeland\" is the national anthem of Lithuania. The words of the song were written by a Lithuanian named Vincas Kudirka, and the melody of the song was similarly composed by him.Lietuvos valstybės himnas (Tautiška giesmė)Tautiškos giesmės likimasprijungus Lietuvą prie Sovietų Sąjungos (PDF). Marcinkevičius, Juozas. Šaltiniai.info. The lyrics of the song derived from a fifty-word poem written by Kudirka about the Baltic country of Lithuania in general. Lyrically, the national anthem can be viewed a condensed version of that poem. Shortly before his death in 1899, the anthem was performed for the first time. ==Lyrics== Words of the song in Lithuanian Pronunciation of these words using the IPA Words of the song in English Lietuva, Tėvyne mūsų, Tu didvyrių žeme, Iš praeities Tavo sūnūs Te stiprybę semia. Tegul Tavo vaikai eina Vien takais dorybės, Tegul dirba Tavo naudai Ir žmonių gėrybei. Tegul saulė Lietuvoj Tamsumas prašalina, Ir šviesa, ir tiesa Mūs žingsnius telydi. Tegul meilė Lietuvos Dega mūsų širdyse, Vardan tos, Lietuvos Vienybė težydi! [lʲɪæ.tˠʊ.vˠɐ ǀ tʲeː.vʲiː.nʲæ mˠuː.sˠuː ǀ] [tˠʊ dʲɪdʲ.vʲiː.rʲ(ɪ̯)uː ʒʲæ.mʲæ ǀ] [ɪʃˠ pˠrˠɐ.ɛɪ̯ˑ.tʲɪæsˠ tˠɐ.vˠoː sˠuː.nˠuːsˠ ǀ] [tʲæ sʲtʲɪ.pʲrʲiː.bʲæː sʲæ.mʲ(ɪ̯)ɐ ǁ] [tʲæː.gʊlˠ tˠɐ.vˠoː vˠɐɪ̯ˑ.kɐɪ̯ˑ ɛɪ̯ˑ.nˠɐ ǀ] [vʲɪænˠ tˠɐ.kɐɪ̯ˑzˠ‿dˠoː.rʲiː.bʲeːsˠ ǀ] [tʲæː.gʊlˠ dʲɪrˠ.bˠɐ tˠɐ.vˠoː nˠɐʊ̯.dˠɐɪ̯ˑ ǀ] [ɪrˠ ʒˠmˠoː.nʲ(ɪ̯)uː gʲeː.rʲiː.bʲɛɪ̯ˑ ǁ] [tʲæː.gʊlˠ sˠɐʊ̯.lʲeː lʲɪæ.tˠʊ.vˠoːj ǀ] [tˠɐmˠ.sˠʊ.mˠɐs pˠrˠɐ.ʃˠɐ.lʲɪ.nˠɐ ǀ] [ɪrˠ ʃʲvʲɪæ.sˠɐ ǀ ɪrˠ tʲɪæ.sˠɐ ǀ] [muːzʲ‿ʒʲɪŋʲgʲ.sʲnʲ(ɪ̯)ʊsˠ tʲæ.lʲiː.dʲɪ ǁ] [tʲæː.gʊlˠ mʲæɪ̯.lʲeː lʲɪæ.tˠʊ.vˠoːsˠ ǀ] [dʲæː.gɐ mˠuː.sˠuː ʃʲɪrʲ.dʲiː.sʲæ ǀ] [vˠɐrˠ.dˠɐnˠ tˠoːsˠ ǀ lʲɪæ.tˠʊ.vˠoːsˠ ǀ] [vʲɪæ.nʲiː.bʲeː tʲæ.ʒʲiː.dʲɪ ǁ] Lithuania, our dear homeland, Land of worthy heroes! May your sons draw strength From your past experiences. May your children always Choose the paths of virtue, May they work towards your good, And that of all people. May the sun of Lithuania Disperse darkness, And light, and truth, May guide our steps. May love of Lithuania Burn in our hearts, In the name of Lithuania, Unity may blossom!English Lyrics of Tautiška giesmė. Seimas of the Republic of Lithuania. Retrieved on the English Wikipedia 22 October 2007. ==References== Category:1890s songs Category:European anthems Category:National symbols of Lithuania",
 "title": "Tautiška giesmė"
}