{
 "id": "82737",
 "text": "Tagged Image File Format (also known as TIFF) is a container format for storing images, including photographs and line art. It is now under the control of Adobe. Originally created by the company AldusVersions 4 and 5 of the TIFF specification included the sentence \"This memorandum has been prepared jointly by Aldus and Microsoft in conjunction with leading scanner and printer manufacturers\"; there was a TIFF co-marketing and developer support effort with Microsoft during this time, though Microsoft was not a technical contributor to the specification. Version 6 (1992) of the TIFF specification dropped the Microsoft reference. TIFF Revision 5.0 TIFF Revision 6.0 for use with what was then called \"desktop publishing,\" TIFF is a popular format for color and black and white images. The TIFF format is widely supported by image-manipulation applications, by publishing and page layout applications, by scanning, faxing, word processing, optical character recognition and other applications. TIFF was chosen as the native format for raster graphics in the NeXTstep operating system; this TIFF support carried over into Mac OS X. Adobe Systems, which acquired Aldus, now holds the copyright to the TIFF specification. TIFF has not had a major update since 1992, though several Aldus/Adobe technical notes have been published with minor extensions to the format, and several specifications, including TIFF/EP, have been based on the TIFF 6.0 specification. == References == == Other websites == * Adobe TIFF Resources page : Adobe links to the specification and main TIFF resources * LibTIFF Home Page : Widely used library used for reading and writing TIFF files as well as TIFF file processing command line tools * TIFF File Format FAQ and TIFF Tag Reference : Everything you always wanted to know about the TIFF File Format but were afraid to ask * The BigTIFF File Format Proposal : Breaking the 4 gigabyte boundary * TIFF description at Digital Preservation (The Library of Congress) * TIFF Revision 4.0: Specification for revision 4.0, in HTML (warning: for historical purposes only, the TIFF 6.0 spec contains the full 4.0 revision) * TIFF Revision 5.0: Specification for revision 5.0, in HTML (warning: for historical purposes only, the TIFF 6.0 spec contains the full 5.0 revision) * TIFF Revision 6.0: Specification for revision 6.0, in PDF (warning: there is an outdated and flawed section (jpeg compression), corrected in supplements, and there are additions to this PDF too – for the full specification, see link to Adobe TIFF Resources) * TIFF Central More TIFF links and information. Category:Computer graphics Category:Adobe Inc.",
 "title": "Tagged Image File Format"
}