{
 "id": "827416",
 "text": "Johnny Castaway is a screensaver released in 1992 by Sierra On-Line/Dynamix. It was under the Screen Antics brand and was said to be \"the world's first story-telling screen saver\". A man, Johnny Castaway, is stuck on a very small island with one palm tree. He often fishes, builds sand castles, and jogs. Other things happen less often, such as a mermaid or Lilliputian pirates coming to the island, or a seagull flying down to steal his shorts while he is bathing. Much like the castaways of Gilligan's Island, he is sometimes almost rescued, but is still on the island because of accidents. Easter eggs happen on some holidays or events often celebrated in the United States, such as Halloween, Christmas and Independence Day, in which a related thing also appears. For example, the palm tree has a \"Happy New Year\" banner during the last week of the year, and a Jack-o'-lantern is in the sand on Halloween. The time on the computer can be changed to the time of the holiday or event to make it happen at the wrong time. Johnny Castaway came on a 3½-inch floppy disk and required a computer with, at minimum, a 386SX CPU and Windows 3.1. Now it is widely available on the internet, but because it requires 16-bit software components that do not work in modern versions of Windows, it only works on older versions of Microsoft Windows without workarounds, which exist on Windows 64-bit, Mac OS X and Linux. Shawn Bird designed the characters while he was at Dynamix. The program was developed by Jeff Tunnell Productions, the Jeff Tunnell in the name meaning the founder of Dynamix. Ken Williams said the screensaver was one of Dynamix's products that did not cost much money to create and make, and made them much more money, along with The Incredible Machine and Hoyle Card Games, which Sierra also published. ==Reviews== Computer Gaming World said Johnny Castaway was \"a great launch\" for Screen Antics and \"Fans of Johnny Hart-style comics and sight gag lovers everywhere should love it\". ==References== ==Other websites== * Johnny Castaway - Screensavers Planet * WineHQ entry - Screen Antics Johnny Castaway Screen Saver Category:Software",
 "title": "Johnny Castaway"
}