{
 "id": "827732",
 "text": "Bernard Johannes \"Joost\" Eerdmans (born 9 January 1971) is a Dutch politician and former civil servant. Eerdmans was born in Harderwijk and studied public administration at Erasmus University Rotterdam. He worked at the justice department and as an assistant to Rotterdam mayor Ivo Opstelten. As a junior civil servant he founded with other junior civil servants the youth organisation FUTURE in 1997. The purpose of FUTURE was to give civil servants more responsibility for what they are doing. Eerdmans got impressed by the performance of critic Pim Fortuyn. He joined the Pim Fortuyn List (LPF) and became an MP in 2002. After leaving the LPF because of the ongoing upheaval, he established with Marco Pastors the Eén NL party in 2006, but the party failed in the 2006 Dutch general election, so he lost his seat. Subsequently he worked as a columnist, as a manager at Deloitte consultancy, and as a radio and TV presenter. Keen on law and order, he also founded a civilian committee against injustice in 2009. Meanwhile, Eerdmans became active in local politics. From 2009 to 2014 he was an alderman of Capelle aan den IJssel on behalf of Livable Capelle. From 2014 to 2018 he was an alderman of the neighbouring city of Rotterdam on behalf of Livable Rotterdam. From 2018 to 2021 he was a municipal councillor and Livable Rotterdam group leader in this city.NRCNU.nl In the run-up for the 2021 Dutch general election he became a candidate for the Forum for Democracy (FVD) party but broke up after dubious comments of FvD leader Thierry Baudet. Afterwards he established with Annabel Nanninga the conservative liberal JA21 party, of which he is both party leader and list puller. JA21 gained three seats, so he has been parliamentary group leader and an MP since March 2021. Joost Eerdmans is married with two children and lives in Rotterdam. == References == * Biography at Parlement.com * Website of Joost Eerdmans == Other websites == * Biography at Dutch House of Representatives Category:1971 births Category:Living people Category:Aldermen of the Netherlands Category:Dutch civil servants Category:Dutch columnists Category:Dutch councillors Category:Dutch radio personalities Category:Dutch television presenters Category:Independent politicians in the Netherlands Category:Leaders of political parties in the Netherlands Category:Members of the House of Representatives of the Netherlands Category:People from Rotterdam Category:Pim Fortuyn List politicians Category:Politicians from Gelderland Category:Writers from Gelderland",
 "title": "Joost Eerdmans"
}