{
 "id": "827975",
 "text": "Thongak Lairembi (), also known as Langol Lairemma (), is a primordial goddess in Meitei mythology and religion. She is the divine female personification of the death. She guards the door of the entrance to the underworld, which is the land of the death, ruled by her consort, Thongalel. Legend says she gets departed from her husband when Thongalel was lost in the battle between the gods of the underworld and those of the upper world, in the hands of Salailen Sidaba. The winner asked the goddess, who is the wife of the loser, to be the gatekeeper of the entrance gate to the underworld, and for Thongalel, he gave him Khamnung Kikoi Louonbi, in return.L. Kunjeswori (2003). Archaeology in Manipur. Rajesh Publications. p. 147. ISBN 978-81-85891-18-7. == Etymology == The name \"Thongak Lairembi\" (/tʰóŋ.ŋak.pə. lai.rem.bi/) is made up of two Meitei language (Manipuri language) words, \"Thongak\" (ꯊꯣꯡꯉꯥꯛ, /tʰóŋ.ŋak./) and \"Lairembi\" (ꯂꯥꯢꯔꯦꯝꯕꯤ, /lai.rem.bi/). \"Thongak\" (adjectival form of noun word \"Thongngakpa\", /tʰóŋ.ŋak.pə/) means doorkeeper or gatekeeper in Meitei language (Manipuri language). \"Lairembi\" (ꯂꯥꯢꯔꯦꯝꯕꯤ, /lai.rem.bi/) means goddess or a female divinity in Meitei language (Manipuri language). == Festival == Every year, the Lai Haraoba festival is celebrated in honor of goddess Thongak Lairembi ().Singh, N. Tombi (1975). Manipur and the Mainstream. Chitrebirentombichand Khorjeirup. p. 76.N. Tombi (1972). Manipur: A Study. Available with Raj Stores. p. 31. == Gallery == Thong-Ngaak Leima (or Thong-Ngaak Lairembi) — Gatekeeper Goddess of the Entrance to the Underworld (Land of Death) — Classical Meitei mythology & traditional Meitei religion (Sanamahism AKA Lainingthouism) of Kangleipak civilization.jpg Thong- Ngaak Leima (or Thong-Ngaak Lairembi) — Doorkeeper Goddess of the Entrance to the Underworld (Land of Death) — Classical Meitei mythology & traditional Meitei religion (Sanamahism AKA Lainingthouism) of Kangleipak civilisation.jpg == Related pages == * Thongalel * Laikhurembi * Khamnung Kikoi Louonbi == References == == Other websites == * A Critical Study Of The Religious Philosophy * Maram Nagas, a Socio-cultural Study - Page 41 - Joseph Athickal · 1992 * Human Exploitation and Biodiversity Conservation - Page 109 - David L. Hawksworth, Alan T. Bull · 2008 * Frontline - Volume 11, Issues 16-20 - Page 32 - 1994 Category:Meitei gods and goddesses Category:Leima Category:Gods and goddesses of the underworld",
 "title": "Thongak Lairembi"
}