{
 "id": "828402",
 "text": "\"Poubi Lai\" also known as \"Paubi Loi\", was an ancient dragon python, who dwelled in the Loktak Lake of Manipur, in Meitei mythology and folklore. It is also refered to as \"Loch Ness Monster of Manipur\". == Mythology == In the Loktak lake, the spirit of Poubi Lai was awakened by the fishing activities of the fishermen of Moirang. Being angered, Poubi Lai destroyed many human habitats and killed many people. It decided to destroy the whole Moirang kingdom. He threatened the King of Ancient Moirang to offer him one Shangbai (basket) of rice and one human everyday. The circumstance was sorrowful for the people of Moirang. Every household had to provide the offer turn by turn. When it was the turn of a young man, the lad seeked help from Kabui Salang Maiba (or \"Kabui Tomba\"). The maiba was a shaman priest king of Kabui tribe in the Salangthel hill range of the Loktak lake. He promised to save the kingdom from the gigantic evil creature. He transformed a Tou plant (an aquatic plant) (or a Khok Waa bamboo plant in another version) into a powerful \"Long\" (a 9 pointed javelin). Later, the maiba slayed Poubi Lai with the deadly weapon. == In popular culture == In 2002, Karam Dineshwar, an artisan had a dream. In his dream, Poubi Lai asked him to craft its image. In the next day, he came across a big tree root at Leimatak. He completed making the 21 feet long wooden sculpture of Poubi Lai in the next 6 months. The artwork of Poubi Lai was first exhibited in the Manipur State Museum, Manipur in 2002. Next, it was exhibited in the National Museum, New Delhi and later in the Quai Branly Museum, Paris, France in 2010. It was also received by the Indian Museum, Kolkata, the largest in India. In 2015, the National Museum, New Delhi organized an exhibition of the wooden sculpture of Poubi Lai for 42 days. The carving belongs to the permanent collection of the Indira Gandhi Rashtriya Manav Sangrahlaya (IGRMS), Bhopal. The object was declared as an \"Object of National Importance\". It was registered under \"AA\" Category of the Museum Collections. During the exhibition at Bhopal, 25 artists of Centre for Youth and Cultural Activities from Imphal, performed a dance drama on the story of Poubi Lai. == References == == Other websites == * Poubi Lai- One Object Exhibition on Poubi Lai; the Story of a Giant Python at National Museum, New Delhi_indiaculture.nic.in * Poubi Lai- The Story of a Giant Python_indiaculture.nic.in Category:Meitei dragons Category:Gods and goddesses of water",
 "title": "Poubi Lai"
}