{
 "id": "828478",
 "text": "Yassine Ben Gamra ( ; born on January 30, 1985 in Tunis ) is a Tunisian actor, model, television presenter and producer. == Biography == Yassine Ben Gamra completed his secondary education at Lycée des Pères Blancs, where he obtained his technical baccalaureate in 2003. He then pursued higher education at the Higher Institute of Multimedia Arts of La Manouba. == Career == He began his career in 2005, playing the role of Selima's fiancé as a guest of honor of episodes 8, 9 and 24 in the television series Café Jalloul. In 2006, he took his first job as a television presenter on the Jetset show on Hannibal TV. He played the character of Elyes Abd El Hak in the series Destiny for five seasons, from 2008 to 2014, and the character of Badr Ben Saleh in Sons of Moufida, also for five seasons between 2015 and 2020. In 2012, he played the role of Bahan in Farouk Omar, a historical-dramatic television series by MBC 1. The series was based on the life of Umar, the second caliph of Islam. The same year, he played the role of Matthias in Mary of Nazareth. He also played the role of Gaio in the movie Sant Barbara. In 2018, he played Kheireddine Pasha on the soap opera Tej El Hadhra . The same year, he completed a training course in the United States to learn animation of a game show. In 2019, he appeared in Kingdoms of Fire from Peter Webber alongside Fethi Haddaoui and Souhir Ben Amara. In 2020, Ben Gamra hosted and produced the program L'Arena on El Hiwar El Tounsi. == Private Life == Yassine Ben Gamra is the youngest of three children, with two older sisters. He lost his father to pancreatic cancer at the age of seven. He married his longtime partner, a French-Tunisian architect, on January 7, 2017, in the presence of several notable personalities. == References == == Other websites == * * Category:Living people Category:1985 births Category:Tunisian producers Category:Tunisian television presenters Category:Tunisian movie actors Category:Actors from Tunis Category:Tunisian television personalities",
 "title": "Yassine Ben Gamra"
}