{
 "id": "828495",
 "text": "The 2020 UEFA Super Cup was the 45th edition of the UEFA Super Cup. The match featured Bayern Munich, the winners of the 2019–20 UEFA Champions League, and Sevilla, the winners of the 2019–20 UEFA Europa League. It was played at the Puskás Aréna in Budapest, Hungary on 24 September 2020. The match was originally scheduled to be played at the Estádio do Dragão in Porto, Portugal, on 12 August 2020; however, after the COVID-19 pandemic in Europe caused the schedule to change of the previous season's club finals. The UEFA Executive Committee chose to award the rescheduled Champions League final to Portugal, and postponed and relocated the Super Cup to Budapest. Bayern Munich won the match 2–1 after extra time to secure their second UEFA Super Cup title. == Teams == Team Qualification Previous participations (bold indicates winners) Bayern Munich Winners of the 2019–20 UEFA Champions League 4 (1975, 1976, 2001, 2013) Sevilla Winners of the 2019–20 UEFA Europa League 5 (2006, 2007, 2014, 2015, 2016) == Venue == The Estádio do Dragão was scheduled to stage its first ever UEFA Super Cup match. This was the first UEFA club competition final hosted at the Puskás Aréna and the second for Budapest and Hungary. === Host selection === An open bidding process was launched on 8 December 2017 by UEFA to select the venue of the UEFA Super Cup in 2020. Associations had until 12 January 2018 to express interest, and bid dossiers had to be submitted by 29 March 2018. Associations hosting matches at UEFA Euro 2020 were not allowed to bid for the 2020 UEFA Super Cup. The UEFA Executive Committee relocated the match to Puskás Aréna in Budapest at their meeting on 17 June 2020. == Pre- match == === Ticketing === Tickets were on sale for the general public until 9 September 2020. Moreover, 3,000 tickets were available for the supporters of each team. In total, 15,500 tickets were sold. Strict hygiene measures, including social distancing and wearing of face masks when social distancing could not be respected, were in place during the match. Ticket holders from overseas had to present proof of a negative SARS-CoV-2 PCR test performed within three days of entry, and had to leave the country within 72 hours after their entry. Despite Hungarian government insisting that the match would be safe to attend, there was opposition to the decision to have spectators. Hungarian politician Ildikó Borbély called the game an \"unacceptable experiment\", while Minister President of Bavaria Markus Söder urged Bayern fans not to travel, fearing that the match could turn into a \"hotbed for COVID-19 to spread\". Hungarian Medical Chamber advisor, epidemiologist András Csilek, stated that the Chamber also considered it wrong, saying that it \"carries unnecessary risk adding\" and \"shouldn't be allowed\". === Officials === On 15 September 2020, UEFA named English official Anthony Taylor as the referee for the match. Taylor had been a FIFA referee since 2013, and previously worked as one of the additional assistant referees in the 2014 UEFA Super Cup, 2015 UEFA Europa League Final, 2016 UEFA Champions League Final and UEFA Euro 2016 Final. He was joined by his fellow countrymen, with Gary Beswick and Adam Nunn as assistant referees, Stuart Attwell as the video assistant referee (VAR) and Paul Tierney as the assistant VAR. Israeli referee Orel Grinfeld served as the fourth official. == Match == === Summary === Sevilla were awarded a penalty after 13 minutes when Ivan Rakitić was blocked and bundled over in the penalty area by David Alaba. Lucas Ocampos scored the penalty shooting to the left corner to put Sevilla ahead. Leon Goretzka made it 1–1 in the 34th minute, with a side foot finish to the left corner of the net after a take down assist from Robert Lewandowski. The game went into extra time, with substitute Javi Martínez getting the winner for Bayern in the 104th minute with a powerful header to the top left corner of the net when the ball fell to him, after Sevilla goalkeeper Yassine Bounou had punched the ball back into play. === Details === The Champions League winners was designated as the \"home\" team for administrative purposes. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Manuel Neuer (c) RB 5 Benjamin Pavard CB 21 Lucas Hernandez CB 4 Niklas Süle LB 27 David Alaba CM 18 Leon Goretzka CM 6 Joshua Kimmich RW 10 Leroy Sané AM 25 Thomas Müller LW 7 Serge Gnabry CF 9 Robert Lewandowski Substitutes: GK 26 Sven Ulreich GK 35 Alexander Nübel DF 17 Jérôme Boateng DF 41 Chris Richards MF 8 Javi Martínez MF 11 Michaël Cuisance MF 19 Alphonso Davies MF 24 Corentin Tolisso MF 30 Adrian Fein MF 40 Malik Tillman MF 42 Jamal Musiala FW 14 Joshua Zirkzee Manager: Hansi Flick Man of the Match: Thomas Müller (Bayern Munich) Assistant referees: Gary Beswick (England) Adam Nunn (England) Fourth official: Orel Grinfeld (Israel) Video assistant referee: Stuart Attwell (England) Assistant video assistant referee: Paul Tierney (England) Match rules * 90 minutes * 30 minutes of extra time if necessary * Penalty shoot-out if scores still level * Twelve named substitutes * Maximum of three substitutions, with a fourth allowed in extra time === Statistics === First half Statistic Bayern Munich Sevilla Goals scored 1 1 Total shots 7 1 Shots on target 2 1 Saves 0 1 Ball possession 62% 38% Corner kicks 2 0 Fouls committed 5 7 Offsides 1 1 Yellow cards 1 1 Red cards 0 0 Second half Statistic Bayern Munich Sevilla Goals scored 0 0 Total shots 8 3 Shots on target 2 3 Saves 3 2 Ball possession 60% 40% Corner kicks 5 5 Fouls committed 7 6 Offsides 1 2 Yellow cards 1 2 Red cards 0 0 Extra time Statistic Bayern Munich Sevilla Goals scored 1 0 Total shots 10 2 Shots on target 3 1 Saves 1 2 Ball possession 59% 41% Corner kicks 3 1 Fouls committed 3 4 Offsides 1 0 Yellow cards 0 1 Red cards 0 0 Overall Statistic Bayern Munich Sevilla Goals scored 2 1 Total shots 25 6 Shots on target 7 5 Saves 4 5 Ball possession 60% 40% Corner kicks 10 6 Fouls committed 15 17 Offsides 3 3 Yellow cards 2 4 Red cards 0 0 == Related pages == * 2020 UEFA Champions League Final * 2020 UEFA Europa League Final * 2020 UEFA Women's Champions League Final * FC Bayern Munich in international football * Sevilla FC in European football == Notes == == References == == Other websites == * Category:UEFA Super Cup Category:2020 in European football Category:2019–20 in European football Category:2020s in Hungary Category:Football in Hungary Category:Sport in Budapest Category:September 2020 events",
 "title": "2020 UEFA Super Cup"
}