{
 "id": "82896",
 "text": "== Events == === Europe === ==== War and politics ==== * September 4 – The Sienese Ghibellines, supported by the forces of King Manfred of Sicily, defeats the Florentine Guelphs at Montaperti. * King Otakar II of Bohemia captures Styria from King Bela IV of Hungary in the Battle of Kressenbrunn. * The Baltic Samogitians and Curonians defeat the Teutonic knights in the Battle of Durbe. * The Duchy of Saxony is divided into Saxony-Lauenberg and Saxony- Wittenberg, marking the end of the first Saxon state. * War breaks out in the Valais (today in Switzerland) as the Bishopry of Sion defends against an invasion by the County of Savoy. ==== Culture ==== * October 24 – The spectacular Cathedral of Chartres is dedicated in the presence of King Louis IX of France; the cathedral is now a UNESCO World Heritage Site. * Construction on the Dunkeld Cathedral begins in Perthshire, Scotland. * Construction begins on the cathedral at Meißen. * Construction begins on the cathedral at Schwerin. * Jacobus de Voragine compiles his work, the Golden Legend, a late medieval best-seller. * Nicola Pisano sculpts the pulpit of the Pisa Baptistery. * German musical theorist Franco of Cologne publishes Ars Cantus Mensurabilis, in which he advances a new theory of musical notation in which the length of a musical note is denoted by the shape of that note, a system still used today. * The mosaic Christ between the Virgin and St Minias is made on the facade of Florence's Basilica di San Miniato al Monte. * The advent of the Age of the Holy Spirit predicted by Joachim of Fiore according to his interpretation of Revelations Ch 6. === Asia === * May 5 – Kublai Khan becomes ruler of the Mongol Empire. * May 21 – Kublai sends his envoy Hao Jing to negotiate with the Song Dynasty Chancellor Jia Sidao, after the small force left by Kublai south of the Yangzi River is destroyed by a Chinese army of the Southern Song Dynasty. Chancellor Jia Sidao ordered to imprison the entire embassy of Kublai. This slight would not be forgotten by Kublai, but he was unable to assault the Song due to the civil war with his rival brother Ariq Böke. * September 3 – The Mamluks defeat the Mongols at the Battle of Ain Jalut in Palestine, marking their first decisive defeat and the point of maximum expansion of the Mongol Empire. * The Sena Dynasty of Bengal falls. * The Chinese era Jingding begins and ends in the Southern Song Dynasty of China. * The Japanese Shōgen era ends, and the Bun'ō era begins. * The Hindu Silharya Dynasty, which ruled an area around Mumbai, ends. * The newly formed Sukhothai kingdom of Thailand adopts Theravada Buddhism. === Africa === * October 24 – Saif ad-Din Qutuz, Mamluk sultan of Egypt, is assassinated by Baibars, who seizes power for himself. == Births == * Henry de Cobham, 1st Baron Cobham (died 1339) * Matthew Csák, ruler of the Váh and the Tatras regions in present-day Slovakia (died 1321) * Meister Eckhart, German theologian, philosopher and mystic (died 1328) * Agnes of France, only daughter of Louis VII of France by his third wife Adèle of Champagne (died 1240) * Andronicus II Palaeologus, Byzantine Emperor (died 1332) * Enguerrand de Marigny, minister to King Philip IV of France * Guillaume de Nogaret, keeper of the seal to King Philip IV of France (year very uncertain) (died 1313) * Maximus Planudes, Byzantine grammarian and theologian (approximate date; died 1330) * Farsi, Persian mathematician and physicist (died 1320) == Deaths == * October 24 – Saif ad-Din Qutuz, Mamluk sultan of Egypt * Franciscus Accursius, Italian jurist (approximate date) * Matilda II of Bologne, sovereign Countess of Bologne * Aymer de Valence, Bishop of Winchester",
 "title": "1260"
}