{
 "id": "828968",
 "text": "\"Mlungu dalitsani Malaŵi\" (; \"O God bless our land of Malawi\") is the national anthem of Malawi. It was composed by Michael-Fredrick Paul Sauka, who also wrote the words. It was adopted in 1964 as a result of a competition. ==Lyrics== Chichewa original IPA transcription English translation Mlungu dalitsani Malaŵi, Mumsunge m'mtendere. Gonjetsani adani onse, Njala, nthenda, nsanje. Lunzitsani mitima yathu, Kuti tisaope. Mdalitse Mtsogoleri nafe, Ndi Mayi Malaŵi. Malaŵi ndziko lokongola, La chonde ndi ufulu, Nyanja ndi mphepo ya m'mapiri, Ndithudi tadala. Zigwa, mapiri, nthaka, dzinthu, N'mphatso zaulere. Nkhalango, madambo abwino. Ngwokoma Malaŵi. O Ufulu tigwirizane, Kukweza Malaŵi. Ndi chikondi, khama, kumvera, Timutumikire. Pa nkhondo nkana pa mtendere, Cholinga n'chimodzi. Mayi, bambo, tidzipereke, Pokweza Malaŵi. [mɽu.ᵑɡu ɗa.ɽi.t͡sa.ni ma.ɽa.βi] [mu.su.ᵑɡɛ‿m.tɛ.ⁿdɛ.ɽɛ] [gɔ.ⁿd͡ʒɛ.t͡sa.ni a.ɗa.ni ɔ.ⁿsɛ] [ⁿd͡ʒa.ɽa‿ⁿtʰɛ.ⁿda‿ⁿsa.ⁿd͡ʒɛ] [ɽu.ⁿzi.t͡sa.ni mi.ti.ma ja.tʰu] [ku.ti ti.sa.ɔ.pɛ] [mɗa.ɽi.t͡sɛ‿m.t͡sɔ.gɔ.ɽɛ.ɽi na.fɛ] [ⁿdi ma.ji ma.ɽa.βi] [ma.ɽa.βi‿ⁿd͡zi.kɔ ɽɔ.kɔ.ᵑɡɔ.ɽa] [ɽa t͡ʃɔ.ⁿdɛ‿ⁿdi u.fu.ɽu] [nʲa.ⁿd͡ʒa‿ⁿdi‿ᵐpʰɛ.pɔ ja‿m.ma.pi.ɽi] [ⁿdi.tʰu.ɗi ta.ɗa.ɽa] [zi.gʷa ma.pi.ɽi‿ⁿtʰa.ka d͡zi.ⁿtʰu] [nᵐpʰa.t͡sɔ za.u.ɽɛ.ɽɛ] [ᵑkʰa.ɽa.ᵑɡɔ ma.da.ᵐbɔ aɓʷi.nɔ] [ᵑgʷɔ.kɔ.ma ma.ɽa.βi] [ɔ u.fu.ɽu ti.gʷi.ɽi.za.nɛ] [ku.kʷɛ.za ma.ɽa.βi] [ⁿdi t͡ʃi.kɔ.ⁿdi kʰa.ma kum.vɛ.ɽa] [ti.mu.tu.mi.ki.ɽɛ] [pa‿ᵑkʰɔ.ⁿdɔ‿ᵑka.na pa‿m.tɛ.ⁿdɛ.ɽɛ] [t͡ʃɔ.ɽi.ᵑɡa‿n.t͡ʃi.mɔ.d͡zi] [ma.ji ba.ᵐbɔ ti.d͡zi.pɛ.ɽɛ.kɛ] [pɔ.kʷɛ.za ma.ɽa.βi] O God bless our land of Malawi, Keep it a land of peace. Put down each and every enemy, Hunger, disease, envy. Join together all our hearts as one, That we be free from fear. Bless our leader, each and every one, And Mother Malawi. Our own Malawi, this land so fair, Fertile and brave and free. With its lakes, refreshing mountain air, How greatly blest are we. Hills and valleys, soil so rich and rare Give us a bounty free. Wood and forest, plains so broad and fair, All - beauteous Malawi. Freedom ever, let us all unite To build up Malawi. With our love, our zeal and loyalty, Bringing our best to her. In time of war, or in time of peace, One purpose and one goal. Men and women serving selflessly In building Malawi. ==References== Category:1964 works Category:National symbols of Malawi Category:African anthems",
 "title": "Mlungu dalitsani Malaŵi"
}