{
 "id": "829009",
 "text": "Hessian (German: Hessisch) is a group of German dialects, characterized as a Central German dialect according to its share in the High German sound shift and spoken mainly in Hesse, but also in some areas in Franconia, Rhineland- Palatinate and North Rhine-Westphalia. Hessian, together with Palatine on the one hand and a mixed area between Hessian, Palatine, South Franconian (\"Badisch\") and East Franconian in the Rhine-Main-Neckar area on the other hand, forms the Rhine Franconian. Lorraine Franconian is also partially counted as part of Rhine Franconian. The absence of the transition from p > (p)f (Appel for \"apple\", German: Apfel) marks Rhine Franconian, together with Moselle Franconian and Ripuarian, as a West Central German dialect. \"Hessian\" in the sense of the traditional dialect is not to be confused with the modern New Hessian regiolect. == Geographical distribution and division == The distribution area of Hessian dialects occupies the state of Hesse except for the extreme north and northeast, part of Rhineland-Palatinate (Westerwald, Rhenish Hesse, Taunus), North Rhine-Westphalia (Wittgensteiner Land) and Bavaria (Bavarian Lower Main). One distinguishes * Südhessisch (Frankfurterisch as well as the dialects around Wiesbaden, Darmstadt and in the northern district of Groß-Gerau, Rheinhessisch around Mainz, Untermainländisch around Aschaffenburg) * Mittelhessisch (Rheingauer Platt, Taunus, along the Lahn (Hinterländer Platt), in the Vogelsberg, Wetterau to Spessart) * Wittgensteiner Platt (Wittgensteiner Land; transition between Central and North Hessian) * Nordhessisch (northern Hesse south of the Benrath line and excluding the Werra valley) * Osthessisch (around Fulda) == Linguistic description == === Phonology === Linguistic boundaries are the isoglosses ich (Hessian) / ik (Low German) as well as machen (Hessian) / maken (Low German) northward to Low Saxon and Westphalian, Pund (Hessian) / Fund (Thuringian) eastward to Thuringian, Pund (Hessian) / Pfund (East Franconian) as well as Appel (Hessian) / Apfel (East Franconian) eastward to East Franconian, was (Hessian) / wat (Ripuarian/Moselle Franconian) westward to Moselle Franconian and fest (Hessian) / fescht (Palatine) to the Rhine Franconian/Palatine/East Franconian mixed area southward. As can be seen from the bounding isoglosses, Hessian is subject to the High German sound shift with respect to t > s and k > ch/h, but unlike East Central German, it does not show the p > f transition. The border to the Low German language area is marked by a here spatially very narrowly limited isoglossic bundle - the Benrath line, which here, unlike west and east, is hardly fanned out. This language boundary (or maken-machen or ik-ich line) between Low German and Central German language varieties or Hessian belongs to the dialect continuum, but it is probably one of the most sharply formed transitional areas in the German language area. In contrast, the border to the south is characterized by particularly wide isoglosses and is correspondingly blurred. The transition to Palatine, to East Franconian and to Thuringian is fluent. Characteristic is the lack of distinction between voiced and unvoiced s or sch as well as in South and Central Hessian between ch on the one hand and sch on the other. All these sounds tend to be pronounced voiced, so that phonetically, for example, there is hardly any difference between Kirche and Kirsche or between weiße and weise. This leads also in High German partly to hypercorrection (Kirchbaum instead of Kirschbaum). === Lexic === Hessian is characterized by residual occurrences of particularly ancient words whose root words hardly occur in other dialects or languages, such as idrecken, itarucken for ruminate, densen, dinsen for \"to pull at something with all one's might\" and ehren (ähren) for ackern/plow. The Hessian vocabulary is documented by three multi-volume dictionaries, the \"Südhessisches Wörterbuch\" (completed, 6 volumes), the \"Hessen-Nassauisches Volkswörterbuch\" (in progress), and the \"Frankfurter Wörterbuch\" (completed, 6 volumes). From the 19th century come A. G. E. Vilmar's Idiotikon von Kurhessen (Marburg/Leipzig 1868) and Hermann von Pfister's Mundartliche und stammheitliche Nachträge zu A. F. C. Vilmar's Idiotikon von Hessen (Marburg 1886). === Grammar === South of the Main, the preterite (past tense) is absent and replaced by the perfect (present perfect);Friebertshäuser, Seite 91: Flexion des Verbs, Präteritumschwund north of the Main, on the other hand, preterite forms are common.Syntax hessischer Dialekte – Präteritum/Perfekt-Distribution In the south, standard German is \"ich kam\", i.e., ich bin kumme, whereas in the north, ich kåm. A second important, albeit Gemeindeutsch difference to standard German is the replacement of the genitive by prepositional and dative periphrases.Friebertshäuser, Seite 86: Flexion des Substantivs, Kasus Thus, instead of \"Georg's book\" it is \"des Buch vum Schorsch\" or \"em Schorsch soi Buch.\"Syntax hessischer Dialekte – Adnominale Possession Hessian syntax was studied in the 2010s at the Philipps University of Marburg as part of the project \"SyHD: Syntax of Hessian Dialects.\" ==Related pages== *Low German ==References== == Bibliography == * Magnus Breder Birkenes, Jürg Fleischer: Zentral-, Nord- und Osthessisch. In: Joachim Herrgen, Jürgen Erich Schmidt: Sprache und Raum. Ein internationales Handbuch der Sprachvariation. Band 4: Deutsch (= Handbücher zur Sprach- und Kommunikationswissenschaft. Band 30.4). De Gruyter Mouton, Berlin/Boston 2019, ISBN 978-3-11-018003-9, S. 435–478. * Martin Durrell, Winifred V. Davies: Hessian. In: Charles V. J. Russ (Hrsg.): The Dialects of Modern German. A Linguistic Survey. Routledge, London 1990, ISBN 0-415-00308-3, S. 210–240. * Hans Friebertshäuser: Das hessische Dialektbuch. Verlag C. H. Beck, München 1987, ISBN 3-406-32317-0. * Hans Friebertshäuser: Kleines hessisches Wörterbuch. Verlag C. H. Beck, München 1990, ISBN 3-406-34192-6. * Hans Friebertshäuser: Die Mundarten in Hessen. Regionalkultur im Umbruch des 20. Jahrhunderts. Husum, Husum 2004, ISBN 3-89876-089-8. * R[udolf] E. Keller: Darmstadt. In: German Dialects. Phonology & Morphology, with selected texts. Manchester University Press, Manchester 1961, S. 161–199. * Werner König: dtv-Atlas zur deutschen Sprache. Deutscher Taschenbuch Verlag, München 1978, ISBN 3-423-03025-9. Zahlreiche Neuauflagen. * Peter Wiesinger: Phonetisch-phonologische Untersuchungen zur Vokalentwicklung in den deutschen Dialekten. Band 1 und 2. Walter de Gruyter, Berlin 1970 (Studia Linguistica Germanica 2). * Hedwig Witte: Hessisch wie es nicht im Wörterbuch steht. Societäts-Verlag, Frankfurt 1971, ISBN 3-7973-0206-1. === Hessian Dictionaries === All information is in German. * Wolfgang Brückner: Frankfurter Wörterbuch. Aufgrund des von Johann Joseph Oppel und Hans Ludwig Rauh gesammelten Materials herausgegeben im Auftrag der Frankfurter Historischen Kommission in Verbindung mit dem Institut für Volkskunde/ Institut für Kulturanthropologie und Europäische Ethnologie der Johann Wolfgang Goethe-Universität Frankfurt am Main. Verlag Waldemar Kramer, Frankfurt am Main 1988, ISBN 3-7829-0360-9. * Hessen-Nassauisches Volkswörterbuch. Aus den von Ferdinand Wrede angelegten und verwalteten Sammlungen ausgewählt und bearbeitet von Luise Berthold, Hans Friebertshäuser, Heinrich J. Dingeldein und Alexander Werth. Marburg 1927ff. * Südhessisches Wörterbuch. Begründet von Friedrich Maurer. Nach den Vorarbeiten von Friedrich Maurer, Friedrich Stroh und Rudolf Mulch bearbeitet von Rudolf Mulch und Roland Mulch. 6 Bände. Marburg, später Darmstadt 1965–2010. [de/subjects/gsform/sn/shwb/ Online.] ==Other websites== *Hessian dialects * * Frankfurterisch. To the Frankfurt city dialect, Website of Carsten Keil * * * Syntax of Hessian dialects SyHD – a completed project of the Philipps- University Marburg under the direction of Jürg Fleischer, Alexandra N. Lenz and Helmut Weiß * (Southern-)Hessian in the dialect atlas of Deutsche Welle (MP3, 15 minutes) Category:Hesse Category:German dialects Category:Languages of Germany",
 "title": "Hessian dialects"
}