{
 "id": "829197",
 "text": "Stephen John Cotterill (born 20 July 1964) is a football manager and former professional football player from England. He is currently the manager of Forest Green Rovers in League Two. ==Personal life== Cotterill was born in Cheltenham, a spa town in Gloucestershire, South West England. When he was just 11 years old, his father died. In January 2021, Cotterill was in intensive care with COVID-19. He left hospital after 33 days on 16 February but was sent back to hospital on 1 March after suffering from COVID-pneumonia. ==Career== When he was a player, Cotterill had a nine-year career, playing for five different clubs. He began his senior career in 1986 with his local team Cheltenham Town. In 1987, he joined Burton Albion. In 1989, he joined Wimbledon and stayed there until 1993. During his time at Wimbledon, in 1992, he went on loan to Brighton & Hove Albion after he had an injury. In 1993, he joined AFC Bournemouth before retiring in 1996. After finishing his playing career, Cotterill became a manager. His manager career began when he was hired as manager of Sligo Rovers in Ireland. Since then, he has been the manager of Cheltenham Town, Stoke City, Burnley, Notts County, Portsmouth, Nottingham Forest, Bristol City, Birmingham City, Shrewsbury Town and Forest Green Rovers. ==Career statistics== ===As a player=== Appearances and goals by club, season and competition Club Season League FA Cup League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Wimbledon 1988–89 First Division 4 1 0 0 0 0 0 0 4 1 1989–90 First Division 2 1 0 0 1 0 2 0 5 1 1990–91 First Division 4 1 0 0 1 0 0 0 5 1 1991–92 First Division 0 0 0 0 0 0 0 0 0 0 1992–93 Premier League 7 3 3 1 0 0 0 0 10 4 Total 17 6 3 1 2 0 2 0 24 7 Brighton & Hove Albion (loan) 1992–93 Second Division 11 4 0 0 0 0 0 0 11 4 AFC Bournemouth 1993–94 Second Division 37 14 3 1 4 0 1 0 45 15 1994–95 Second Division 8 1 0 0 2 2 0 0 10 3 Total 45 15 3 1 6 2 1 0 55 18 Career total 73 25 6 2 8 2 3 0 90 29 :A. The \"Other\" column constitutes appearances and goals in the Full Members' Cup and the Football League Trophy. ===As a manager=== Managerial record by team and tenure Team From To Record Record Record Record Record Team From To Sligo Rovers 1 July 1995 28 September 1996 Cheltenham Town 1 February 1997 27 May 2002 Stoke City 27 May 2002 10 October 2002 Burnley 3 June 2004 8 November 2007 Notts County 23 February 2010 27 May 2010 Portsmouth 18 June 2010 14 October 2011 Nottingham Forest 14 October 2011 12 July 2012 Bristol City 3 December 2013 14 January 2016 Birmingham City 2 October 2017 3 March 2018 Shrewsbury Town 27 November 2020 6 June 2023 Forest Green Rovers 25 January 2024 present Total Total Total ==Honours== Manager Cheltenham Town *Football League Third Division play-offs: 2002 *Football Conference: 1998–99 *FA Trophy: 1997–98 Notts County *Football League Two: 2009–10 Bristol City *Football League One: 2014–15 *Football League Trophy: 2014–15 Individual *Championship Manager of the Month: October 2006 *League One Manager of the Month: September 2014, March 2015 December 2020 *Football League One Manager of the Year: 2014–15 *League Two Manager of the Month: March 2010, April 2010 *Football Conference Manager of the Year: 1997–98,1998–99 *Honorary Fellowship (University of Gloucestershire): 2000 *Manager Special Achievement of the Year Award: 2014–15 ==References== Category:1964 births Category:Living people Category:AFC Bournemouth players Category:Brighton & Hove Albion F.C. players Category:English footballers Category:English football managers Category:Sportspeople from Gloucestershire Category:Premier League players",
 "title": "Steve Cotterill"
}