{
 "id": "829230",
 "text": "Friday Night Funkin' is a rhythm game. It was made by a programmer named ninjamuffin99. It was first made available to play on the website Newgrounds. The game is about a character named Boyfriend who wants to be with his girlfriend named Girlfriend. He must go on rap battles with characters who do not want him to. The design of the game was made to look similar to Adobe Flash games from the 2000's. The source code is available in GitHub, mostly written in Haxe. The game had a successful kickstarter campaign in April 2021, reaching its goal of $60,000 in a few hours and raising more than two million dollars before the campaign ended. A scrapped character called Rolus is featured prominently throughout concept art, revealing he may have originally played a significant role in week 5, he is instead getting his own game called Rolus in the Outskirts. == Opponents == * Week 1 - Daddy Dearest * Week 2 - Skid and Pump (Sr Pelo) and Monster (Bassetfilms) * Week 3 - Pico (Newgrounds) * Week 4 - Mommy Mearest * Week 5 - Daddy Dearest, Mommy Mearest and Monster (Bassetfilms) * Week 6 - Senpai and Spirit * Week 7 - Tankman (Newgrounds) * Week-End 1 -Darnell (Newgrounds) == Gameplay == Friday Night Funkin' is a rhythm game where the player controls Boyfriend, a young male who is trying to date his girlfriend. However, he must defeat multiple bosses by rap battling in order to do so. Boyfriend goes through multiple \"weeks\", which contain three songs (or more) each. The player rap battles the opponents by pressing the WASD or arrow keys although other controls were made optional in more recent updates (up, left, down, right). The player can choose to play the story mode or free-play. Story mode allows the player to play the game in multiple weeks as understanding why or how he got in this place or plot. Free- play allows the player to play each song individually. The game also includes a tutorial that can teach boyfriend (the player) how to play. Friday Night Funkin', due to it being an open-source game, has an active modding community. Mods are fan-made weeks remade to have different bosses, backgrounds, assets, and such. The full game will have mod support using the Poly-mod framework. == References == == Other websites == * * Friday Night Funkin' on Itch.io * * Friday Night Funkin' (Newgrounds Demo) on Newgrounds * Friday Night Funkin' (Ludum Dare Prototype) on Itch.io * Funkin' Crew's Blog Category:2020 video games Category:Browser games Category:Indie video games Category:Linux games Category:MacOS games Category:Single-player video games Category:Windows games",
 "title": "Friday Night Funkin'"
}