{
 "id": "829295",
 "text": "GB News is an news television channel in the United Kingdom that is based on opinions. It started on 13 June 2021 on Freeview, Sky, YouView, Freesat and Virgin Media. It is owned by British hedge fund manager Sir Paul Marshall, and Legatum, which is headquartered in Dubai. Its CEO is Greek-born Australian Angelos Frangopoulos. Its first chairman was the British journalist Andrew Neil until 13 September 2021, who used to work for the BBC. Its current chairman is British-born investor Alan McCormick, a partner in Legatum. Before its launch, the Financial Times predicted it would be \"right-leaning\". The Guardian and City A.M. claimed it would be like the International television news channel Phoenix InfoNews Channel, CCTV-4, CGTN, BBC Parliament, Canal del Congreso, CPAC, C-SPAN, BBC News, CBC News Network and Fox News Channel. There was a pre-tax loss of £42.4 million in its 2022/23 accounts. In 2024 Paul Marshall had to invest £41 million. The number of people employed increased to 295 in May 2023, from 175 in May 2022. The group also pays high wages to several current and former Conservative politicians, including Sir Jacob Rees- Mogg. On 18 March 2024, Ofcom ruled that two episodes of Jacob Rees-Mogg's State Of The Nation, two episodes of Friday Morning With Esther And Phil and one episode of Saturday Morning With Esther And Phil, broadcast in May and June 2023 , had failed to comply with rules 5.1 and 5.3 of the Broadcasting Code which state that a politician cannot be a newsreader, interviewer or journalist unless, exceptionally, there is a editorial justification. In 2024 57% of Conservative Party members said they regularly watched GB News, compared with 60% who watched the BBC. It got its record audience of 184,000 for the People’s Forum that it ran with Rishi Sunak in February 2024. This was more than those who watched it on BBC News and Sky News combined. == On-air staff == *Colin Brazier *Michelle Dewberry *Inaya Folarin Iman *Liam Halligan *Tom Harwood *Rebecca Hutson *Darren McCaffrey *Andrew Neil *Alexandra Phillips *Dan Wootton ==References== Category:2021 establishments in Europe Category:2020s establishments in the United Kingdom Category:British television channels",
 "title": "GB News"
}