{
 "id": "829286",
 "text": "Harvey Claflin Mansfield Jr. (born March 21, 1932) is an American political philosopher. He is the William R. Kenan, Jr. Professor of Government at Harvard University. He received the National Humanities Medal in 2004. He is known for his conservative stance on political issues in his writings.See, e.g., Josh Harlan and Christopher Kagay, \"Harvey C. Mansfield, Jr.: The Question of Conservatism\", interview, Harvard Review of Philosophy 3 (1993), accessed June 2, 2007. [Restricted access?] Cf. cached HTML version, , accessed June 17, 2007. (18 pages.) ==Works== * Statesmanship and Party Government: A Study of Burke and Bolingbroke. Chicago: University of Chicago Press, 1965. * The Spirit of Liberalism. Cambridge: Harvard University Press, 1978. * Machiavelli's New Modes and Orders: A Study of the Discourses on Livy. Ithaca: Cornell University Press, 1979. Rpt. Chicago: University of Chicago Press, 2001. * Thomas Jefferson: Selected Writings. Ed. and introd. Wheeling, IL: H. Davidson, 1979. * Selected Letters of Edmund Burke. Ed. with introd. entitled \"Burke's Theory of Political Practice\". Chicago: University of Chicago Press, 1984. * The Prince, by Niccolò Machiavelli. Trans. and introd. 2nd (corr.) ed. 1985; Chicago: University of Chicago Press, 1998. (Inc. glossary.) * Florentine Histories, by Niccolò Machiavelli. Ed., trans. and introd. Princeton: Princeton University Press, 1988. (Co-trans. and co-ed., Laura F. Banfield.) * Taming the Prince: The Ambivalence of Modern Executive Power. New York: The Free Press, 1989. * America's Constitutional Soul. Baltimore: The Johns Hopkins University Press, 1991. * Machiavelli’s Virtue. Chicago: University of Chicago Press, 1996. * Discourses on Livy, by Niccolò Machiavelli. Trans. and introd. Chicago: University of Chicago Press, 1996. (Co-trans., Nathan Tarcov.) * Democracy in America, by Alexis de Tocqueville. Trans. and introd. Chicago: University of Chicago Press, 2000. (Co-trans., Delba Winthrop.) * A Student’s Guide to Political Philosophy. Wilmington, DE: ISI Books, 2001. * Manliness. New Haven: Yale University Press, 2006. * Tocqueville: A Very Short Introduction. New York and Oxford: Oxford University Press, 2010. ==References== ==Other websites== * HarveyMansfield.org . Website devoted to the work of Harvey Mansfield in a searchable format along with scholarly commentary, multimedia, biography, and other resources. * \"Democracy in America\". Colloquium on their translation of the book Democracy in America, by Alexis de Tocqueville, presented by Harvey Mansfield and Delba Winthrop. March 30, 2001. Ashbrook Center, Ashland University, Ashland, Ohio. * \"Dr. Harvey Mansfield, Author of Manliness\". Public lecture at the New Hampshire Institute of Politics, Saint Anselm College, Goffstown, New Hampshire. April 20, 2006. Accessed June 17, 2007. MP3 podcast. * Harvey Mansfield, William R. Kenan, Jr., Professor of Government . Faculty webpage. Department of Government, Harvard University. Category:1932 births Category:Living people Category:American philosophers Category:American political scientists Category:Writers from New Haven, Connecticut Category:Harvard University faculty",
 "title": "Harvey Mansfield"
}