{
 "id": "82932",
 "text": "Walker, Texas Ranger is an action/police television series. It was created by Leslie Greif and Paul Haggis. The series stars Chuck Norris as a member of the Texas Rangers. His co-stars include Sheree J. Wilson as D.A. Alex Cahill and Clarence Gilyard as Texas Ranger Jimmy Trivette. The series was televised on CBS in the spring of 1993. This first season consisted of three pilot episodes. Eight full seasons followed from September 25, 1993 to May 19, 2001. It was televised in over 100 countries. A made-for-television movie Trial By Fire has been televised. The series airs in reruns. The entire series has been released to DVD. The show is known for its conservative moral values. The wholesome main characters don't use drugs, and they participate in community service. Martial arts were the primary tool of law enforcement. Occasionally Walker and company used martial arts to reach out to the community. The series has since become one of the most popular action series in television history. It has gained a cult following for its camp appeal. == Story == The series is centered on a Dallas-Fort Worth–based member of the Texas Rangers named Cordell Walker. Walker was raised by his paternal uncle, a Native American named Ray Firewalker (Floyd Red Crow Westerman). Cordell prior to joining the Rangers served in the Marines' elite recon unit during the Vietnam War. Both Cordell and Uncle Ray share the values characteristic of Wild West sheriffs. His partner and best friend is James \"Jimmy\" Trivette (Clarence Gilyard), a former Dallas Cowboys player \"Go Long T\" who takes a more modern approach. Walker's young partner grew up in Baltimore and used football as his ticket to college education. He was dropped from the team after he tore up his shoulder in a major game, which led to his career in the Rangers (often making references to watching the \"Lone Ranger\" and how C.D. Parker mentored him as a Rookie Officer). Trivette also works inside the office using computers and cellular phones to collate information of the people who have been taken into custody. Walker also works closely (and shares a mutual attraction) with Alexandra \"Alex\" Cahill (Sheree J. Wilson), a Tarrant County Assistant District Attorney, who on occasion puts up a frown if Walker does not obtain results in time. He also gets advice on cases from C.D. Parker (Gailard Sartain (pilot season), Noble Willingham (seasons 1–7)), a veteran Ranger (later inducted into the Texas Rangers Hall of Fame) who worked with Walker until retiring to operate a small restaurant and bar called \"CD's Bar and Grill\", a restaurant widely known in the series for its chili. In Season 7 two rookie Texas Rangers, Sydney Cooke (Nia Peeples) and Francis Gage (Judson Mills), are assigned under Walker and Trivette's command. ==Cast and characters== Name Portrayed by Occupation Seasons Pilot 1 2 3 4 5 6 7 8 Cordell Walker Chuck Norris Texas Ranger Main James Trivette Clarence Gilyard Texas Ranger Main Alexandra Cahill Sheree J. Wilson Assistant District Attorney Main CD Parker Gailard Sartain former Texas Ranger, bar owner Main Noble Willingham Main Raymond Firewalker Floyd Westerman, Apesanahkwat Walker's uncle Main Guest Trent Malloy Jimmy Wlcek karate instructor, private detective Recurring Main Carlos Sandoval Marco Sanchez police detective Recurring Main Francis Gage Judson Mills Texas Ranger Main Sydney Cooke Nia Peeples Texas Ranger Main ===Main characters=== *Chuck Norris as Texas Ranger Sgt. Cordell Walker, a former Marine and a modern-day Ranger who believes in the Code of the Old West. He is a decorated Vietnam vet and a martial arts expert. He is the show's main protagonist. Appeared in all episodes. *Clarence Gilyard as Texas Ranger Sgt. James \"Jimmy\" Trivette, Walker's partner and best friend. Appeared in all but two episodes. *Sheree J. Wilson as Tarrant County Assistant D.A. Alexandra \"Alex\" Cahill, whom Walker dates for a few seasons and finally marries. Appeared in all but five episodes. *Noble Willingham (Gailard Sartain pilot) as retired Texas Ranger Captain C.D. Parker, Walker's buddy and ex-partner who owns a bar-restaurant in Fort Worth, Texas, and was the only one to address Walker by his first name Cordell regularly. Appeared in 155 episodes. *Nia Peeples as Texas Ranger Sydney \"Syd\" Cooke, a rookie Ranger who joins Walker in Seasons 7–8. Appeared in 47 episodes. *Judson Mills as Texas Ranger Francis Gage, another rookie Ranger who joins Walker in Seasons 7–8. Appeared in 46 episodes. *Floyd Westerman (Apesanahkwat, Season 2) as Walker's paternal uncle Ray Firewalker (also known as Uncle Ray), who raised Cordell after his parents – John and Elizabeth Firewalker – were murdered. Ray disappeared at the end of Season 2. Appeared in 14 episodes. ===Supporting characters=== *Marco Sanchez as Detective Carlos Sandoval, a detective for Dallas PD. Best friend of Trent Malloy. Often teamed up with Walker and Trivette in cases. Appeared in 16 episodes. *Jimmy Wlcek as Trent Malloy, son of a pastor and former martial arts student of Walker. Black belt in Karate and runs both his own Dojo and Protection Agency. Often teamed up with Walker and Trivette in cases. Appeared in 13 episodes. *Cynthia Dorn as M.E. Mary Williams, a medical examiner in most of the murder cases that occurred on the show. *Vanessa Paul as Josie Martin. Ran 'H.O.P.E.' center created by Alex after a near-death experience. One of Alex's bridesmaids at Alex and Walker's wedding. Did not play a major role in her appearances. *Frank Salsedo as White Eagle, the spiritual leader of the Cherokee reservation Walker grew up on. Debuted during Season 3. *Rod Taylor as Gordon Cahill, the once-estranged father of Alex. Also an Attorney. *Eloy Casados as Sheriff Sam Coyote, the sheriff of the Cherokee reservation and a very good friend of Walker. *James Drury as Texas Ranger Captain Tom Price. He only appeared during the pilot season. *Peter Onorati as Sergeant Vincent Rosetti, a New York Police Sergeant with a strong New York accent and a little arrogance. *Terry Kiser as Charlie Brooks, a clumsy and fast-talking informant for Walker and Trivette. *Robert Fuller as Ranger Wade Harper, a retired El Paso Texas Ranger who came on board to work for Walker and Trivette. *Julia Nickson as Dr. Susan Lee == References == ==Other websites== * * * Category:1990s television series Category:American drama television series Category:CBS network shows Category:English-language television programs",
 "title": "Walker, Texas Ranger"
}