{
 "id": "829426",
 "text": "Kounu (, ) is a goddess in Meitei mythology and religion of Ancient Kangleipak (Antique Manipur). She is a wife of God Koubru. She is the guardian of the northern direction. Kounu has two homes. Her main home is on Mount Kounu. Her other home is in Mount Koubru, which is where her husband Koubru lives. She is worshipped with Koubru as the deities of the Khullakpa (village chief). Kounu and Koubru ruled Ancient Manipur for a very long time after the reign of King Ningthou Puthiba. == Description == Kounu is one of the gods who change climates and weather. Her husband Koubru and her son Loyalakpa are also weather deities. Meitei people believe that if the annual rainfall is good, then it is caused by goddess Kounu. When goddess Kounu changes the climate, there will be hardly any flood. Crop yields are good in Kounu's activities. == Mythology == === Love and marriage proposal === Kounu met God Koubru for the first time when she was searching for cotton plants in the western slopes of Mount Koubru. The two fell in love at first sight. Kounu asked Koubru to bring her all kinds of fruit for the marriage proposal. She said she would not agree to marry him if he failed to do so. So, on a Saturday, God Koubru had a meeting with all the gods and goddesses of hills and plains. They all prepared for fruits of all sorts. They planned to proceed to the marriage proposal on the next day, Sunday. On the next day's before sunrise, goddesses brought the fruits to Kounu's place. Male gods also came with Koubru to the place. The gods found two fruits missing, heikru (Indian gooseberry) and Heining. Then, Kounu rejected the marriage proposal. At this, Koubru told her that she would have a daughter because she had gotten pregnant the last time they had met. Then the other male gods got angry because of Kounu's excessively reserved marriage proposal conditions while she was already conceived. They put a curse on Kounu's baby, saying she would be born on a stone slab on the baby's next incarnation. The goddesses were about to curse the baby to be turned into flower during birth, but they didn't as Kounu had been punished enough. Feeling embarrassed, Kounu also cursed that all the gifts to be turned into stones on the very sunrise. Soon, as the sun rose up, all the gifts turned into stones. === Birth of Leisna - Cursed baby's very birth === Kounu gave birth to a daughter named \"Leisna\" (Laisna, Leisana, Laisana). When her daughter grew up, she asked Kounu about her father, and Kounu told her. Leisna asked to go to her father's place to meet him. Kounu let her go. On her way, Leisna met Pakhangba. They became lovers. Later, they married. Since Leisna was a mortal, she died when her time of death came. === Adoption of Thoudu Nungthel Leima - Cursed baby's next incarnation === Goddess Kounu and God Koubru lived together. Once goddess Leimarel Sidabi decided to incarnate herself as the daughter of the two. So, Leimarel incarnated herself into a baby infant girl. On the very day, Kounu and Koubru were walking on a hilly region. God Koubru got very thirsty. He found Kounu's pitcher empty. Unable to bear his thirst, he went down the riverside to drink water. Surprisingly, he found a newly born girl lying on a stone slab of the river bed. Koubru shouted three times if there was anyone for the baby girl. No one responded. So, Koubru and Kounu brought the girl to their abode. The two adopted the girl as their own daughter. They gave her three names. The baby was named \"Ipok Leima\" (\"Eepok Leima\") because she was found in the stream. The baby was also named \"Thoudu Nungthel Leima\" because she was found lying on the stone slab. The baby was given her final name as \"Taipang Nganpi\" (\"Taibang Nganbi\") because she was beautiful as well as bright. === Kounu and Loyalakpa === Once Kounu was asked by her son Loyalakpa about the true origin of Thoudu Nungthel Leima. Loyalakpa was suspicious if Thoudu Nungthel Leima was really his real sister or not. Koubru had already warned Kounu not to reveal the secret of Thoudu Nungthel Leima to their son. So, at first, Kounu lied to him. But at Loyalakpa's grudge, she decided to tell him the truth. But since both Mother Kounu and Son Loyalakpa were at Koubru's abode, she dared not to speak anything about it. She feared Koubru might heard of it. With permission from Koubru, Kounu and her son Loyalakpa went to her abode. It was the safe place to reveal the truth. Kounu narrated Loyalakpa how she and Koubru found Thoudu Nungthel Leima lying on a stone slab in the river. She revealed that Thoudu Nungthel Leima was actually their adopted daughter and not real by birth. Later, Kounu's son Loyalakpa and Kounu's adopted daughter Thoudu Nungthel Leima married. == Cults and shrines == Goddess Kounu and her husband God Koubru are worshipped in many cults and shrines of Manipur. Some are located in Mayang Langjing, Awang Khunnou, Senjam, Chirang, Loitang Khunnou, Tingri, Koutruk, Awang Potsangbam, Sairem Khul, Kameng, Sarouthel, Lairel Sajik, Lairel Kaabi, Heibongpokpi, Nongchup Sanjenbam, Tauthong, Haorang Keithel, Haorang Saabal, Kwak Siphai, Narelkonjin, Thamnapokpi, Awang Sekmai, Leimram, Phumlou Keiroi, Phumlou Siphai, Potsangbam Thouriphi, Samushang, Keinou Thongthak, Khonghampat, Akham, Morok Ingkhol, Lambaal Khul, Phayeng, Haujongban, Awang Keingam, Khurkhul and Leikinthabi. According to Meitei culture, Goddess Kounu and God Koubru are the protectress and the protector of the said places. == References == == Other websites == Category:Meitei gods and goddesses Category:Leima",
 "title": "Kounu"
}