{
 "id": "829427",
 "text": "The King Baudouin Stadium (, ) is a sports stadium in the Heysel section of Brussels, Belgium. ==History== The original name of the stadium was the Jubilee Stadium (, ). This is because it was inaugurated days after Belgium's 100th anniversary, with an unofficial Belgium-Netherlands football match. In 1946 the stadium was renamed Heysel Stadium (French: Stade du Heysel, Dutch: Heizelstadion), after the area it was built in. The Heysel stadium hosted European Cup finals in 1958, 1966, 1974, and 1985, and UEFA Cup Winners' Cup finals in 1964, 1976 and 1980. The highest attendance at a European game was over 66,000 in 1958. ===May 1985 disaster=== Even though it was Belgium's national stadium, Heysel was not well maintained. The stadium's poor condition became apparent at the 1985 European Cup Final. For example, the outer wall had been made of cinder block, and fans who did not have tickets were seen kicking holes in it to get in. Additionally, the only escape route led upward, and there were only three gates on each short side–nowhere near enough for the 22,000 people standing on the terraces on either side. The stadium's inadequacies had been well known for some time. When Arsenal played there in the early 1980s, its supporters ridiculed it as a \"dump.\" Indeed, the presidents of the two 1985 European finalists, Juventus and Liverpool, had concluded that Heysel was in no condition to host a European Final, especially one featuring two of the largest and most powerful clubs in Europe at the time. They urged UEFA to move the match to another ground, to no avail. It later emerged that UEFA had only spent half an hour inspecting the stadium. The Heysel Stadium disaster resulted in the deaths of 39 Juventus fans, after they were attacked by Liverpool fans before the match. Despite this, the stadium continued to be used for Belgium international games between 1986 and 1990, with minimal improvements to the stadium made after the disaster. This was mainly because the government had drawn up plans to remodel the stadium into a 35,000-seat facility. In 1990, UEFA forced the issue by barring Belgium from hosting a European Final until at least 2000. It continued to host track and field events and it still hosts the Memorial Van Damme every year. ===Modernisations=== In 1995, the stadium was rebuilt at the cost of BEF 1,500 million (around €37/$50 million in 1995). The stadium was also renamed to the King Baudouin Stadium, after the former Belgian king. It was re-opened on August 23, 1995, as the home of the Belgium national football team. It is the largest stadium in Belgium, with a capacity of 50,093. The remodeled stadium hosted the 1996 European Cup Winners Cup final, as well as the opening game for Euro 2000. In March of 2019 the Belgian football association announced plans for a new redevelopment of the King Baudouin stadium. The stadium would be rebuilt to a reduced capacity of 40,000 spectators, and would be renamed to the Golden Generation Arena. ==UEFA Euro 2000 matches== Date Team 1 Result Team 2 Round 10 June 2000 2–1 Group B 14 June 2000 2–0 Group B 19 June 2000 2–0 Group B 24 June 2000 2–0 Quarter-finals 28 June 2000 2–1 (asdet) Semi-finals ==Related pages== * Heysel Stadium disaster ==References== ==Other websites== * Belgian FA official website – history * Belgian FA official website – history * King Baudouin Stadium - Information and Photo Category:20th-century establishments in Belgium Category:1930 establishments in Europe Category:Football stadiums in Europe Category:Buildings and structures in Brussels Category:Football in Belgium",
 "title": "King Baudouin Stadium"
}