{
 "id": "829404",
 "text": "The 2021 Atlanta spa shootings happened in suburbs around Atlanta, Georgia in the United States in 2021. A man shot and killed eight people at three spas on March 16, starting just before 5:00 p.m. A suspect, Robert Aaron Long, was caught south of the city that night. The United States Federal Bureau of Investigation and local police are investigating the crime. ==Victims== Long shot four people at Young's Asian Massage. Two of them died there and two others died later at a hospital. He shot three more people at Gold Spa. He shot another person at Aroma Therapy Massage. Of the eight people Long shot, seven were women and one was a man. Six of the eight people were Asian women; the other two were white. Four of the people were Koreans or Korean-Americans. Long shot a ninth person, a Hispanic man, but he did not die. Some of the victims have been identified publicly. ==Suspect== Robert Aaron Long was arrested by police about 150 miles south of Atlanta. Long was 21 years old at the time. He is white. He is from Woodstock, Georgia. People from the Atlanta Police Department say they have video evidence showing Long could be the shooter. The Atlanta Police also say Long confessed to the crime. ==Aftermath== Authorities charged Long with eight counts of murder. His church, Crabapple First Baptist Church, threw him out as well. If authorities believe that Long killed the people because he hates Asians, he could be charged with a hate crime, which means he would spend more time in prison. Georgia passed a hate crime bill in 2020 after the killing of Ahmaud Arbery. The United States has had many more crimes against Asians than usual since the COVID-19 pandemic began in 2019. After the spa shootings, many Asian Americans held up signs and posted on the Internet \"Stop Asian Hate.\" Long told the police that he did not shoot the people because he hates Asians. He said he had sex addiction. The police said he shot the people because he thought of the massage parlors as a place that tempted him to have sex. In an interview for the media, Captain Jay Baker from the Sheriff's Office said that Long had been having \"a really bad day\" and was \"at the end of his rope\" when he shot the people. Many people said this was a bad thing to say because it sounded like he was making excuses for the killer. Sheriff Frank Reynolds apologized: \"We regret any heartache Captain Baker's words may have caused.\" ==References== Category:2021 mass shootings in the United States 2021 spa shootings Category:Attacks on buildings and structures in the 2020s Category:Attacks on buildings and structures in the United States Category:March 2021 events Category:2021 in Georgia (U.S. state)",
 "title": "2021 Atlanta spa shootings"
}