{
 "id": "829626",
 "text": "is a Japanese football player. He played for the Japan national team. ==Biography== Nakamura was born in Kita, Tokyo on February 27, 1995. He joined J1 League club Kashiwa Reysol in 2013. However he could not play at all in the match. In 2015, he moved to J2 League club Avispa Fukuoka on loan. He played 20 matches and was promoted to J1 end of the 2015 season. In 2016, he returned to Kashiwa and became a regular goalkeeper. Although Kashiwa was relegated to J2 in end of the 2018 season, Kashiwa was returned to J1 in a year. In January 2021, he moved to Portuguese Primeira Liga club Portimonense. In June 2011, Nakamura was selected the Japan U-17 national team for 2011 U-17 World Cup and he played 4 matches. In August 2016, he was also selected the Japan U-23 national team for 2016 Summer Olympics and he played 2 matches. In November 2017, he was selected the Japan national team for 2017 E-1 Football Championship. At this tournament, he debuted against North Korea on December 9. He also participated 2018 World Cup, but he did not play in the match. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup League cup Continental Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Kashiwa Reysol 2013 J1 League 0 0 0 0 0 0 – 0 0 2014 0 0 0 0 0 0 – 0 0 2016 28 0 3 0 1 0 – 32 0 2017 34 0 4 0 0 0 – 38 0 2018 17 0 0 0 0 0 4 0 21 0 2019 J2 League 41 0 2 0 1 0 – 44 0 2020 J1 League 10 0 – 1 0 – 11 0 Total 130 0 9 0 3 0 4 0 146 0 Avispa Fukuoka (loan) 2015 J2 League 20 0 1 0 – – 21 0 Portimonense 2020–21 Primeira Liga 0 0 – – – 0 0 2021–22 2 0 1 0 0 0 – 3 0 2022–23 30 0 0 0 2 0 – 32 0 Total 32 0 1 0 2 0 4 0 35 0 Career total 182 0 11 0 5 0 4 0 202 0 ===International=== Appearances and goals by national team and year National team Year Apps Goals Japan 2017 2 0 2018 2 0 2019 2 0 2021 0 0 Total 6 0 ==Honours== Individual *J.League Best XI: 2017 ==References== ==Other websites== * Category:1995 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:J3 League players Category:Kashiwa Reysol players Category:J.League U-22 Selection players Category:Avispa Fukuoka players Category:2018 FIFA World Cup players Category:Footballers at the 2016 Summer Olympics",
 "title": "Kosuke Nakamura"
}