{
 "id": "829659",
 "text": "The sun parakeet (binomial name Aratinga solstitialis), also known in aviculture as the sun conure, is a medium-sized, vibrantly colored parrot native to northeastern South America. The adult males and females look similar, with black beaks, mostly yellow feathers, orange on their belly and face, and wings and tails with green and blue tips. Sun parakeets like to be with other birds and usually live in flocks. They eat fruits, flowers, berries, seeds, nuts, and insects. People usually keep conures as pets, and they can live up to 30 years. However, this species is in danger because their homes are being destroyed, and they are captured for their feathers or the pet trade. The International Union for Conservation of Nature now considers sun conures as endangered. == Distribution and habitat == Sun parakeets live in a small area of northeastern South America, including the north Brazilian state of Roraima, southern Guyana, the very south of Suriname, and southern French Guiana. Sometimes, sun conures can be seen along the coast of French Guiana. People are not sure where sun conures can be found in Venezuela, but people have recently seen them near Santa Elena de Uairén, a small Venezuelan city near the border of Brazil. They may be found in Amapá or far northern Pará, but this is not confirmed. == Taxonomy == Sun parakeets were first described by Carl Linnaeus in 1758. Originally, he placed it in the genus Psittacus, but it is now moved under Aratinga, which includes some similar parrots from the New World. Psittacus is now only for the grey parrot and the Timneh parrot. The name \"solstitialis\" comes from the Latin word for \"summer solstice,\" which relates to its bright, golden feathers. The sun parakeet is commonly called \"sun conure\" in aviculture. It is called \"sun parakeet\" by the American Ornithologists' Union and many bird lists and guides. Sun parakeets are the closest living relatives to the Carolina parakeet, which is now extinct. Its genes are studied to compare it with the Carolina parakeet's genome. Both species shared a common ancestor around 3 million years ago, which is around the time the Isthmus of Panama closed. This has helped species move more easily between North and South America. == Description == Sun parakeets weigh about 110 grams (4 ounces) and are about 30 centimeters (12 inches) long. Males and females look similar, but females may be lighter and thinner, having shorter tails, smaller rounder heads, and smaller beaks. Adult sun parakeets have bright yellow crowns (top of the head), back of the neck, back, small wing feathers, tips of the larger wing feathers, chest, and underwing feathers. The face and belly of the sun parakeet are orange with red around the ears. The wings are green at the base and dark blue on the tips. The tail is olive-green, with a blue tip. The flight feathers look dark gray if you look at them from underneath. The beak is black. The legs and the bare eye ring (a ring of skin around the eye that has no feathers) are grey, but the ring can turn white in captivity. Sun parakeets are easily confused with the jandaya parakeet and the sulphur-breasted parakeet because they look similar, but the jandaya parakeet has green wings while the sulphur-breasted parakeet has green spots on its back and less orange on its belly. Sun parakeets look a bit like the pale-billed golden parakeet. Younger sun parakeets are mostly green and look like young sulphur-breasted parakeets. As they grow up, they start to get their bright yellow, orange, and red colors on their back, belly, and head. ==References== Category:Parakeets Category:Birds of South America",
 "title": "Sun parakeet"
}