{
 "id": "829848",
 "text": "is a Japanese football player. He played for the Japan national team. ==Biography== Yamanaka was born in Kashiwa on April 20, 1993. He joined J1 League club Kashiwa Reysol from their youth team in 2012. Although he did not play many matches, Kashiwa won the champions in the 2012 Emperor's Cup and 2013 J.League Cup. In 2014, he moved to J2 League club JEF United Chiba on loan. In 2015, he returned to Kashiwa. In 2017, he moved to Yokohama F. Marinos. He became a regular player as left side back and Yokohama won the champions in the 2017 Emperor's Cup and 2018 J.League Cup. In 2019, he moved to Urawa Reds. On November 20, 2018, Yamanaka debuted and scored a goal for the Japan national team against Kyrgyzstan. He played 2 games and scored 1 goal for Japan until 2019. ==Statistics== ===Club statistics=== Club Season League Emperor's Cup J. League Cup AFC Other1 Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Kashiwa Reysol U-18 2011 0 0 1 0 - - - 1 0 Kashiwa Reysol 2012 J. League Division 1 1 0 2 0 0 0 0 0 0 0 3 0 2013 10 0 2 0 2 0 1 0 1 0 16 0 JEF United Chiba 2014 J. League Division 2 23 3 2 0 - - - 25 3 Kashiwa Reysol 2015 J1 League 11 0 1 0 2 0 5 0 – 19 0 2016 13 1 1 0 1 0 – – 15 1 Yokohama F. Marinos 2017 22 1 4 0 4 0 – – 30 1 2018 32 4 2 0 5 0 – – 39 4 Urawa Red Diamonds 2019 22 0 2 0 0 0 5 0 1 0 30 0 2020 31 2 – 1 0 – – 32 2 2021 24 0 3 0 7 0 – – 34 0 Cerezo Osaka 2022 23 0 2 0 10 0 – – 35 0 2023 0 0 0 0 0 0 – – 0 0 Career total 212 22 22 0 32 0 11 0 2 0 279 11 ===National team statistics=== National team Year Apps Goals Japan U18 2011 3 0 Japan U19 2012 4 0 Japan national team Year Apps Goals 2018 1 1 2019 1 0 Total 2 1 ===International appearances and goals=== International appearances and goals # Date Venue Opponent Result Goal Competition 2011 31 October Thai- Japanese Stadium, Bangkok, Thailand Guam U18 2012 AFC U-19 Championship qualification / Japan U18 5 November Thephasadin Stadium, Bangkok, Thailand Chinese Taipei U18 2012 AFC U-19 Championship qualification / Japan U18 7 November Thephasadin Stadium, Bangkok, Thailand Thailand U18 2012 AFC U-19 Championship qualification / Japan U18 2012 3 November Emirates Club Stadium, Ras al-Khaimah, UAE Iran U-19 2012 AFC U-19 Championship / Japan U19 5 November Emirates Club Stadium, Ras al-Khaimah, UAE Kuwait U-19 2012 AFC U-19 Championship / Japan U19 7 November Emirates Club Stadium, Ras al-Khaimah, UAE United Arab Emirates U-19 2012 AFC U-19 Championship / Japan U19 11 November Emirates Club Stadium, Ras al-Khaimah, UAE Iraq U-19 2012 AFC U-19 Championship / Japan U19 ==References== ==Other websites== * Category:1993 births Category:Living people Category:Footballers from Chiba Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:J3 League players Category:Kashiwa Reysol players Category:JEF United Chiba players Category:J.League U-22 Selection players Category:Yokohama F. Marinos players Category:Urawa Red Diamonds players",
 "title": "Ryosuke Yamanaka"
}