{
 "id": "829806",
 "text": "is a Japanese football player. He played for the Japan national team. His brother Yuto Misao in also a footballer. ==Biography== Misao was born in Musashino on April 16, 1996. He joined J2 League club Tokyo Verdy from their youth team in 2015. He played many matches as defensive midfielder. In 2016, he moved to J1 League club Kashima Antlers. Although he did not play many matches, Kashima won the J1 champions in 2016. He played many matches from 2017. In 2018, Kashima won the champions in AFC Champions League first Asian title in the club history. In October 2013, Misao was selected the Japan U-17 national team for 2013 U-17 World Cup. He played 2 matches. In November 2017, Misao was selected the Japan national team for 2017 E-1 Football Championship. At this tournament, he debuted against South Korea on December 16. He played 6 games for Japan until 2018. ==Career statistics== ===Club=== Nippon Sports Kikaku Publishing inc./日本スポーツ企画出版社, \"2017 J1&J2;&J3;選手名鑑 (NSK MOOK)\", 8 February 2017, Japan, (p. 10 out of 289)Nippon Sports Kikaku Publishing inc./日本スポーツ企画出版社, \"2016J1&J2;&J3;選手名鑑\", 10 February 2016, Japan, (p. 44 out of 289) Appearances and goals by club, season and competition Club Season League League League Cup Cup League Cup League Cup Continental Continental Other Other Total Total Club Season Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Tokyo Verdy 2015 J2 League 39 0 2 0 – – – 41 0 Kashima Antlers 2016 J1 League 4 0 3 0 3 0 – 1 0 11 0 2017 26 1 2 0 2 0 3 0 – 33 1 2018 26 0 3 1 0 0 11 0 – 40 1 2019 28 0 2 0 2 0 8 0 – 40 0 2020 30 1 0 0 2 0 1 0 – 33 1 2021 34 0 2 0 7 0 – – 43 0 2022 33 2 4 0 6 1 – – 43 3 Total 181 4 16 1 22 1 23 0 1 0 243 6 Santa Clara 2022–23 Primeira Liga 17 0 0 0 0 0 – – 17 0 Career total Career total Career total 237 4 18 1 22 1 23 0 1 0 301 6 ===International=== Japan national teamJapan National Football Team Database Japan national teamJapan National Football Team Database Japan national teamJapan National Football Team Database Year Apps Goals 2017 1 0 2018 5 0 Total 6 0 ==References== ==Other websites== * Category:1996 births Category:Living people Category:Footballers from Tokyo Prefecture Category:Japan international footballers Category:J1 League players Category:J2 League players Category:Tokyo Verdy players Category:Kashima Antlers players",
 "title": "Kento Misao"
}