{
 "id": "829882",
 "text": "The \"Disgrace of Gijón\" is the name given to the 1982 FIFA World Cup match between West Germany and Austria. It was played at the El Molinón stadium in Gijón, Spain, on June 25, 1982. The match was the last game of Group 2, with Algeria and Chile having played the day before. With the outcome of that match already decided, a win by 1 or 2 goals for West Germany would result in both West Germany and Austria qualifying ahead of Algeria, who had defeated West Germany in the first game. West Germany took the lead after 10 minutes, with the remaining 80 minutes being characterized by few serious scoring attempts on either side. Both teams were accused of match-fixing, although FIFA ruled that neither team broke any rules. As a result of this, and similar events at the previous World Cup in Argentina, FIFA changed the group system for future tournaments, so that the final two games in each group would be played at the same time. In German, the match is known as (lit. \"Non-aggression pact of Gijón\") or (lit. \"Disgrace of Gijón\"), while in Algeria it is called (, \"Scandal of Gijón\"); it is also called the (in reference to the annexation of Austria by Germany in 1938). ==Background== *Note: 2 points for a win, 1 for a draw, first tie-breaker is goal difference. Algeria began the tournament with a shock 2–1 win over West Germany on the opening day. This would be described as the \"greatest World Cup upset since North Korea beat Italy in 1966\", and as \"one of the biggest shocks in World Cup history\". Algeria became the first African team to defeat a European team at the FIFA World Cup. They then lost 2-0 to Austria, before beating Chile 3–2 in their final match. Algeria's win against Chile made them the first African team to win twice at a World Cup. As Algeria played their final match the day before West Germany played Austria, the two European teams knew what result they needed in order to both qualify for the next round. A West German win by one or two goals would see both West Germany and Austria qualify. A larger West German victory, by three goals or more, would see West Germany and Algeria qualify (this is because Algeria had scored more goals than Austria, which meant they would qualify even with the same goal difference), while a draw or an Austrian win would eliminate the West Germans. ==Match== ===Details=== {| style=\"font-size: 90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Harald Schumacher SW 15 Uli Stielike DF 20 Manfred Kaltz DF 4 Karlheinz Förster DF 2 Hans-Peter Briegel MF 6 Wolfgang Dremmler MF 3 Paul Breitner MF 14 Felix Magath MF 11 Karl-Heinz Rummenigge (c) FW 9 Horst Hrubesch FW 7 Pierre Littbarski Substitutes: Substitutes: Substitutes: DF 5 Bernd Förster FW 8 Klaus Fischer FW 13 Uwe Reinders MF 18 Lothar Matthäus GK 22 Eike Immel Manager: Manager: Manager: Manager: Jupp Derwall Assistant referees: Ebrahim Al Doy (Bahrain) Arnaldo Cézar Coelho (Brazil) ==Aftermath== Team 3 2 0 1 6 3 +3 4 3 2 0 1 3 1 +2 4 3 2 0 1 5 5 0 4 3 0 0 3 3 8 -5 0 West Germany and Austria ended up advancing from the group, at the expense of Algeria. Austria ended up losing to France in Group D, while West Germany lost the final to Italy. ==References== ==Other websites== * Video highlights of the game on BBC Sport (UK only) Category:1982 FIFA World Cup",
 "title": "Disgrace of Gijón"
}