{
 "id": "830096",
 "text": "Meitei deities or Manipuri deities refer to the gods and goddesses of Meitei mythology and religion. The major deities include Atingkok, Leimarel Sidabi, Sanamahi, Pakhangba, Imoinu and a few others.The Manipuri Lais Here is a list of the divinities, affiliated with Sanamahism, the Meitei religion. ==List== Names of the Deities Meitei transliteration Description Atingkok ꯑꯇꯤꯡꯀꯣꯛ The Universal God Father, the Creator of the entire world. Haoreima ꯍꯥꯎꯔꯩꯃ A female divinity, in the form of a tribal woman, carrying traditional elongated basket. Heinu Leima ꯍꯩꯅꯨ ꯂꯩꯃ The goddess of fruits and fruitful abundance. Imoinu ꯏꯃꯣꯢꯅꯨ A household goddess of hearth fire, wealth and prosperity.A Hymn for Goddess Emoinu Ireima ꯏꯔꯩꯃ The goddess and the Queen of the water realm. Khamlangba ꯈꯝꯂꯥꯡꯕ A great hunter, warrior and miner deity. Khamnung Kikoi Louonbi ꯈꯝꯅꯨꯡ ꯀꯤꯀꯣꯢ ꯂꯧꯑꯣꯟꯄꯤ Goddess who takes the souls of the death to the underworld. Khoriphaba ꯈꯣꯔꯤꯐꯥꯕ The only son of Atingkok and Konthoujam Tampha Lairembi. Khuman Apokpa ꯈꯨꯃꯟ ꯑꯄꯣꯛꯄ The God of Darkness, and the progenitor of the Khuman clan. Koiren Leima ꯀꯣꯢꯔꯦꯟ ꯂꯩꯃ The dual goddesses, who are both the consorts of Thangjing. Konthoujam Tampha Lairembi ꯀꯣꯟꯊꯧꯖꯝ ꯇꯝꯐꯥ ꯂꯥꯢꯔꯦꯝꯕꯤ The former Queen of Heaven and a consort of Atingkok, the Supreme God. Korouhanba ꯀꯣꯔꯧꯍꯟꯕ The God of the Sun and the master of the sky. Koubru ꯀꯧꯕ꯭ꯔꯨ The guardian of the North West direction and the presiding deity of the Mt. Koubru. Laikhurembi ꯂꯥꯢꯈꯨꯔꯦꯝꯕꯤ The chief Queen of Thongalel, the ruler of the underworld kingdom. Lainaotabi ꯂꯥꯢꯅꯥꯎꯇꯥꯕꯤ The youngest consort of Thongalel, and the goddess of sorcery, witchcraft and weaving. Leimarel Sidabi ꯂꯩꯃꯔꯦꯜ ꯁꯤꯗꯕꯤ The supreme mother earth goddess.The Manipuri Lais Loyalakpa ꯂꯣꯌꯥꯂꯥꯛꯄ The only son of Koubru and Kounu. Marjing ꯃꯥꯔꯖꯤꯡ The god of polo, horses, war and sports.The Manipuri Lais Mongba Hanba ꯃꯣꯡꯕ ꯍꯟꯕ A primordial Sylvan God. Ngaleima ꯉꯥꯂꯩꯃ The goddess of fish, and a sister of Ireima, Phouoibi and Thumleima. Nongpok Ningthou ꯅꯣꯡꯄꯣꯛ ꯅꯤꯡꯊꯧ The presiding god of the Nongmaiching Hill (Langmai Hill), in eastern Manipur, and the Guardian of the Eastern direction. Nongshaba, also known as Kanglasha ꯀꯪꯂꯥꯁꯥ (ꯅꯣꯡꯁꯥꯕ) A dragon lion god, son of Atingkok. Nongthang Leima ꯅꯣꯡꯊꯥꯡ ꯂꯩꯃ The goddess of seduction, associated with thunder and lightning. Pakhangpa ꯄꯥꯈꯪꯄ A primordial serpentine dragon and a son of Atingkok and Leimarel Sidabi.The Manipuri Lais Panam Ningthou ꯄꯅꯝ ꯅꯤꯡꯊꯧ The presiding god of \"Andro village\" in Manipur. Panthoibi ꯄꯥꯟꯊꯣꯢꯕꯤ The goddess of fertility, war and love. Phouoibi ꯐꯧꯑꯣꯢꯕꯤ The goddess of food, crops and agriculture. Pisatao ꯄꯤꯁꯥꯇꯥꯎ God of handicrafts. Poireiton ꯄꯣꯢꯔꯩꯇꯣꯟ The cultural hero, who brought fire from the underworld to the human world. Pureiromba ꯄꯨꯔꯩꯔꯣꯝꯕ An ancestral deity of the Angom clan. Sanamahi ꯁꯅꯥꯃꯍꯤ A household deity and the eldest son of Atingkok, the Supreme deity.The Manipuri Lais Thangjing ꯊꯥꯡꯖꯤꯡ The progenitor of the Moirang clan, the Guardian of the South West direction and the presiding deity of Ancient Moirang.The Manipuri Lais Thongak Lairembi ꯊꯣꯡꯉꯥꯛ ꯂꯥꯢꯂꯦꯝꯄꯤ Goddess who guards the entrance gate to the underworld. Thongalel ꯊꯣꯉꯥꯂꯦꯜ The god of the death and the ruler of the underworld. Thumleima ꯊꯨꯝꯂꯩꯃ The goddess of salt and salt brines. Wangbren ꯋꯥꯡꯕ꯭ꯔꯦꯟ The god of water, rain, flood, disease and sickness.The Manipuri Lais Yumjao Leima ꯌꯨꯝꯖꯥꯎ ꯂꯩꯃ The goddess of household and royalty. == Worship == According to the Loiyumpa Silyel Constitution,Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 7–11 1\\. Meireima is worshipped by the Heirom family. 2\\. Khanglangba is worshipped by the Irom family. 3\\. Shorarel (heaven) is worshipped by the Sorelsangbam family. 4\\. Lammabee is worshipped by the Sharang Leishangthem family. 5\\. Phouoibi (goddess for paddy) is worshipped by the Sharotkhaibam family. 6\\. Shanglang-mei (Kangla) is worshipped by the Potshangbam family. 7\\. Kutchu (Wayenshang) is worshipped by the Moirang Pukhrambam family. 8\\. Mawao Leima is worshipped by the Shoubam family. 9\\. Panthoibi (most adored Meetei goddess) is worshipped by the Heishnam family. 10\\. Pet-angnga is worshipped by the Khoisanam family. 11\\. Laikhurembee is worshipped by the Taibangjam family. 12\\. Huimureima is worshipped by the Konthoujam family. 13\\. Lainaotabi is worshipped by the Ashangbam family. 14\\. Nungthelleima is worshipped by the Chingkhwam family. 15\\. Shoubonleima is worshipped by the Arambam family. 16\\. Awangba (deity Lai-wangba) is worshipped by the Yenkhom Phisabam family. 17\\. Luwaang Ching is worshipped by the Luwangshangbam family. 18\\. Lainingthou is worshipped by the Sinam Laishangbam family. 19\\. Puthiba is worshipped by the Moirangthem Puthem family. 20\\. Pureiromba is worshipped by the Mangsatabam family. 21\\. Tenlongba is worshipped by the Langmaithem family. 22\\. Thongak is worshipped by the Ngarangyanpam family. 23\\. Chingkol-Ningthou is worshipped by the Nakalbam family. 24\\. Chingbal Leima is worshipped by the Khuraijam family. 25\\. Yaoreibi is worshipped by the Meiyengbam family. 26\\. Koubarel is worshipped by the Leishangthem family. 27\\. Numitleima is worshipped by the Ningthoujam family. 28\\. Koubru is worshipped by the Pukkalabam family. 29\\. Marjing is worshipped by the Chenglei-Laishangbam family. 30\\. Moirang Phaktom Ariba is worshipped by the Moirangthem family. 31\\. Hongnemyoi Khunjao is worshipped by the Kangpucham family. 32\\. Chinga is worshipped by the Chingkhalbam family. 33\\. Langjing is worshipped by the Longjam Pheiroijam family. 34\\. Langgol is worshipped by the Tekcham family. 35\\. Langmaicheeng (Nongmaijing) is worshipped by the Nongmaithem family. 36\\. Chinga Leima is worshipped by the Ningthoujam family. 37\\. Langching Hiyangthou Leima is worshipped by the Heithou and Khongtekcham families. 38\\. Yumjao Lairemma is worshipped by the Thaopicham family. == Related pages == * Phouoibi Shayon ==References== * Meitei",
 "title": "List of Meitei gods and goddesses"
}