{
 "id": "830122",
 "text": "Emma-Rose Taylor-Isherwood (born April 27, 1987Agence Claire Boivin Agency >> Emma Taylor-Isherwood . URL accessed on November 3, 2009.) is an American actress. She played the roles of Miffy in Miffy: Colors, Numbers and Shapes and Mona Parker in Mona the Vampire and Josie Trent in the science fiction program Strange Days at Blake Holsey High. ==Biography== Taylor-Isherwood was born in Toronto. She began her career at the age of nine, with a voice role in the animated special Teddy Bears Rescue, before lending her voice for Miffy: Colors, Numbers and Shapes and Mona the Vampire. She has appeared in movie including Tales from the Neverending Story, The Shipping News and Who Gets The House. ==Filmography== Film Film Film Film Year Film Role Notes 1991 Beauty and the Beast Additional voices 1992 Aladdin Additional voices 1994 The Lion King Lion Cubs (voice) 1995 Pocahontas Additional voices 1995 The Run of the Country Mona Parker (voice) 1995 Toy Story Kid (voice) 1996 The Hunchback of Notre Dame Additional voices 1997 Cats Don't Dance Additional voices 1997 Hercules Additional voices 1997 Pooh's Grand Adventure: The Search for Christopher Robin Additional voices Direct-to-video 1997 Anastasia Additional voices 1998 Mulan Little Girl #2 (voice) 1998 Pocahontas II: Journey to a New World Additional voices Direct-to-video 1998 Antz Additional voices 1998 A Bug's Life Dot's Son (voice) 1998 The Prince of Egypt Additional voices 1999 Who Gets the House? Heidi Reece as Emma Isherwood 1999 Doug's 1st Movie Additional voices 1999 Tarzan Ape Girl (voice) 1999 The Iron Giant Little Girl (voice) 1999 The Story of Us Mona Parker (voice) 1999 Seasons of Giving Additional voices Direct-to-video 1999 Toy Story 2 Emily (voice) 2000 Ultimate G's Young Laura 3D-IMAX 2000 Chicken Run Additional voices 2000 The Emperor's New Groove Additional voices 2001 Shrek Little Red Riding Hood (voice) 2001 Atlantis: The Lost Empire Atlantean Lightning Storm (voice) 2001 Monsters, Inc. Additional voices 2001 The Shipping News Young Agnis Hamm-age 12 2002 Lilo & Stitch Additional voices 2002 Treasure Planet Additional voices 2004 Shrek 2 Little Red Riding Hood (voice) 2004 The Incredibles Girlfriend (voice) Film Made for Television Year Title Role Notes 1997 Shadow of the Bear Guest appearance 1999 Revenge of the Land Hilda Hawke 1999 Mary Cassatt: An American Impressionist Elsie Foster Cassatt as Emma Isherwood 2006 A Dad for Christmas Megan Eubanks 2007 All the Good Ones Are Married Madison Gold Television Year Title Role Notes 1996 Teddy Bears Rescue Tara (voice) 1996 Miffy: Colors, Numbers and Shapes Miffy, Narrator and all characters (voice) 1999–2000 Are You Afraid of the Dark? Julie/Shelley Julie (in 2000)/Shelley (as Emma Isherwood in 1999) 1999–2003 Mona the Vampire Mona Parker (voice) Main Role, 65 episodes 1999–2001 The Kids from Room 402 Penny Grant (voice) Main Role, 30 episodes 2000 Upstairs, Downstairs Bears Polly Bumble (voice) 2002–2006 Strange Days at Blake Holsey High Josie Trent Main role, 42 episodes 2003–2009 The Secret World of Benjamin Bear Holly/Eliza (voice) 2004 Just Jamie Rita (voice) 2009-2013 Gawayn Elspeth (voice) 2010 The Mysteries of Alfred Hedgehog Camille (voice) 2015 Kuu Kuu Harajuku Angel (voice) Television Guest Appearances Television Guest Appearances Television Guest Appearances Television Guest Appearances Year Title Role Notes 2001 Tales from the Neverending Story Olano 3 episodes 2002 Galidor: Defenders of the Outer Dimension Rom 2007 The Morning Show with Mike and Juliet Herself 2009 Overruled! Kelly ==References== Category:1987 births Category:Living people Category:Canadian actors",
 "title": "Emma Taylor-Isherwood"
}