{
 "id": "83037",
 "text": "52 Europa is an asteroid. It has a diameter of 289 km, and was found on February 4, 1858 by H. Goldschmidt. It is named after Europa, one of Zeus's conquests in Greek mythology. Europa is the seventh biggest asteroid by volume and the sixth biggest by mass (after Ceres, Vesta, Pallas, Hygiea, and Interamnia) and contains somewhat less than 2% of the mass of the entire main belt. It is a very dark carbonaceous C-type, and the fourth-biggest of these. It orbits close to the Hygiea asteroid family, but is not a member. Spectroscopic studies have found evidence of olivines and pyroxenes on the surface. Lightcurve data for Europa has been very hard to interpret, so much so for a long time its period of rotation was in dispute (5 and a half, or 11 hours?) despite many observations[8]. It has now been determined that Europa is a prograde rotator, but the exact direction in which its pole points remains unclear. The most detailed analysis indicates that it points either towards about ecliptic coordinates (β, λ) = (70°, 55°) or (40°, 255°) with a 10° uncertainty [2]. This gives an axial tilt of about 14° or 54°, respectively. It has been found that the star CV Aquarii found in 1934, was actually an incorrect misidentification of 52 Europa . == References == # Supplemental IRAS Minor Planet Survey # T. Michałowski et al. Photometry and models of selected main belt asteroids I. 52 Europa, 115 Thyra, and 382 Dodona , Astronomy & Astrophysics, Vol. 416, p. 353 (2004). # G. Michalak Determination of asteroid masses II. (6) Hebe, (10) Hygiea, (15) Eunomia, (52) Europa, (88) Thisbe, (444) Gyptis, (511) Davida and (704) Interamnia , Astronomy & Astrophysics, Vol. 374, p. 703 (2001) # PDS lightcurve data # E. Dotto et al. ISO results on bright Main Belt asteroids: PHT – S observations , Astronomy & Astrophysics, Vol. 358, p. 1133 (2000). # S.R. Sawyer A High-Resolution CCD Spectroscopic Survey of Low-Albedo Main Belt Asteroids, PhD thesis, The University of Texas (1991). # P. Schmeer and M.L. Hazen CV Aquarii identified with (52) Europa , Journal of the American Association of Variable Star Observers, Vol. 28, p. 103 (2000). # V. Zappalà, M. di Martino and S. Cacciatori On the ambiguity of rotational periods of asteroids - The peculiar case of 52 Europa, Icarus, Vol. 56, p. 319 (1983). == Other websites == * * shape model deduced from lightcurve Category:Asteroids",
 "title": "52 Europa"
}