{
 "id": "830633",
 "text": "Rentberry, Inc. is an international long-term rental marketplace company based in San Francisco, California, United States. The company was founded in 2015 by Alex Lubinsky and Lily Ostapchuk. == History == In 2015, Oleksiy Lyubinsky and Lilia Ostapchuk founded Rentberry in San Francisco, United States. That same year, the prototype of the Rentberry product raised $845,000 from 12 international investors, including Carlyle Group, Synergo Private Equity, IFC, Pegasus Capital, Abris Capital and Ericsson. In 2017, the company began working with ListHub, Realtor.com and Walk Score to combine rental bulletin boards. In October 2017, Rentberry raised $4.5 million in venture financing. Zing Capital became a leading investor, joining Nelson Brothers Property Management, Hopewell Development, 808 Ventures, Beechwood Ventures, Jade Value. In 2018, Rentberry signed its first international partnership with OnTheMarket and entered the rental market in the UK. In June 2019, the platform became available in more than 50 countries, including Australia, Canada, Germany, Spain, Italy and more. == Functional == Rentberry offers a decentralized platform for landlords and tenants, based on a transparent process for submitting and reviewing rental applications, online payments, a risk assessment system for potential tenants and homeowners. Rent is paid through the website To do this, Rentberry works with HelloSign, offering tenants and landlords to sign sign legally binding documents digitally on the platforms. Rentberry also uses the DataUSA.io API service and database, providing tenants with information about the area where the tenant is looking for housing, including population, average age, poverty rate, average income, average property value, and more. On September 10, 2018, Rentberry launched mobile applications for tenants and landlords on both iOS and Android. == Critics == The American press gave mixed reviews and called Rentberry \"eBay for rent\", claiming that the platform could only lead to a rise in the rental market. Since the first launch, the controversial bidding tool (a tenant can set a preferred price for an apartment) has been discussed in Vanity Fair, The Wall Street Journal, The Independent, HuffingtonPost, CBS SF BayArea, SFGate, Inman, Curbed and other media. == Lawsuit == In March 2018, Seattle City Council imposed a one-year moratorium on platforms where you can bargain for rent, as in Rentberry. In March 2019, Rentberry lost the case in the US District Court. Reports say the Seattle City Council plans to extend the moratorium for another year. As of June 2019, Rentberry is agglomerating the lists (boards) of rental housing in Seattle, as the moratorium has not yet been extended. == References == Category:Companies based in San Francisco Category:2015 establishments in California",
 "title": "Rentberry"
}