{
 "id": "830627",
 "text": "Charlyne Amanda Yi (born January 4, 1986) is an American actress, comedian, musician and writer. She is known for her role as Dr. Chi Park on the Fox medical drama House, the voice of every Ruby on the Cartoon Network animated series Steven Universe (2013—2019), the voice of Chloe Park on We Bare Bears (2014—2019) and the voice of Alice on Summer Camp Island (2018—present). == Filmography == === Film === Year Title Role Notes 2007 Knocked Up Jodi First film 2008 Cloverfield Party Goer Semi-Pro Wheelchair Jody 2009 Paper Heart Charlyne Yi Nominated – Comedy Film Award for Best Actress All About Steve Young Protester 2010 Fast Donna Fast Two-minute video short 2012 This Is 40 Jodi 2014 The Last Time You Had Fun Betty 2016 Nerdland Becky Voice 2017 The Disaster Artist Safoya Literally, Right Before Aaron Claire The Lego Ninjago Movie Terri IT Nerd Voice 2018 Puppet Master: The Littlest Reich Nerissa Next Gen Mai Su Voice Nominated – Annie Award for Voice Acting in a Feature Production Second Act Ariana 2019 Always Be My Maybe Ginger Goldie Goldie Voice, short Steven Universe: The Movie Ruby Voice, television film Jexi Elaine 2020 Trolls World Tour Pennywhistle Voice We Bare Bears: The Movie Chloe Park Voice 2021 Happily Gretel The Mitchells vs. the Machines Abbey Posey Voice 2022 My Father's Dragon Magda Voice 2024 Untitled The Mitchells vs. the Machines spin-off film Abbey Posey Voice === Television === Year Title Role Notes 2006 Help Me Help You Charlyne Episode: \"The Sheriff\" 2007 30 Rock Grace Park Episode: \"The C Word\" Cold Case Dorky Girl Episode: \"Stand Up and Holler\" Powerloafing Executive Assistant 2008 Miss Guided Karey Episode: \"Pool Party\" 2011 Love Bites Sex Shop Manager Episodes: \"Unaired Pilot\" & \"Firsts\" 2011–2012 House Dr. Chi Park 21 episodes 2015 Looking Cashier Episode: \"Looking for a Plot\" 2015–2019 Steven Universe Ruby, various Rubies, Cluster Voice, 12 episodes We Bare Bears Chloe Park Voice, series regular (18 episodes) 2016 Love Cori 3 episodes Jane the Virgin Angela Episode: \"Chapter Thirty-Nine\" Future-Worm! Zoe Voice, episode: \"Bug vs. the Babysitter\" 2017 Twin Peaks Ruby Episode: \"Part 15\" Danger & Eggs Layla Voice, episode: \"Keep Off the Grass/Pennies\" Room 104 Gracie Episode: \"FOMO\" 2018 Lucifer Ray-Ray / Azrael 2 episodes DIY Eli Voice, TV short 2018–present Summer Camp Island Alice Fefferman Voice, series regular (22 episodes) 2019 Steven Universe Future Ruby, Eyeball Ruby, Ruby Bodyguards Voice, 5 episodes 2020 Good Girls Lucy 2 episodes 2021 Tig n' Seek Georgia Voice, episode: \"Must Love Bugs\" 2022 Amphibia The Guardian Voice, episode: \"The Hardest Thing\" 2022 Guillermo del Toro's Cabinet of Curiosities Charlotte Xie Episode: \"The Viewing\" TBA Time Bandits Judy Upcoming miniseries == Books == Year Title Type 2015 Oh the Moon Text/Image hybrid 2019 You Can't Kill Me Twice (So Please Treat Me Right) Poetry == Other == * Kate's Place - Paprika ==References== Category:1986 births Category:Living people Category:American movie actors Category:American television actors Category:American voice actors Category:American video game actors Category:American stage actors Category:Musicians from Los Angeles Category:Comedians from Los Angeles Category:Screenwriters from Los Angeles Category:Actors from Los Angeles Category:American television writers",
 "title": "Charlyne Yi"
}