{
 "id": "83066",
 "text": "WWE is an American professional wrestling promotion based in Stamford, Connecticut. WWE personnel consists of professional wrestlers, managers, play- by-play and color commentators, ring announcers, interviewers, referees, trainers, producers, road agents, creative writers, and various other positions. Executives and board members are also listed. WWE contracts typically range from developmental contracts to multi-year deals. WWE describes most personnel as independent contractors. Personnel on the main roster appear on specific brands such as Raw and SmackDown Live while they can also appear on WWE's primary weekly television programming such as Main Event, Superstars, Total Divas as well as pay-per-views, and at live events. Personnel from the NXT division appear on the television series of the same name, which airs online in the U.S. and on TV in select countries, and at live events. Personnel on the main roster may wrestle in NXT and vice versa. Personnel are organized below by their role in WWE. Their ring name is on the left and their real name is on the right. If someone is inactive for any reason, due to injury, suspension, not appearing in more than 30 days, or otherwise, that information is noted. WWE refers to its performers as superstars. ==Overview== As of 2021, WWE employs over 800 full-time employees. It also has many vendors and service providers working for it. WWE calls the people who wrestly for it \"independent contractors\". These people have contracts that range from short developmental to contracts that last many years. ===Brands=== Since the WWE's brand extension in 2016, performers work on one of two \"main roster\" brands – Raw and SmackDown. A third brand, NXT, was created to be a developmental brand for the main roster. New people would go there to train to work for the main brands. In 2019 it was made into the third main roster brand. In 2021, the brand was changed to \"NXT 2.0\". The brand returned to being the developmental division for Raw and SmackDown. Some developmental performers work on NXT's United Kingdom-based brand NXT UK. Main roster performers work on Monday Night Raw and Friday Night SmackDown. Developmental wrestlers work on NXT 2.0, NXT: Level Up and NXT UK,. At times, some main roster performers are seen on NXT. Personnel in WWE's developmental system usualy train at the Performance Center in Orlando, Florida. There is also a UK Performance Center in London, England. ===Championships=== Eaach brand has their own distinct championships. There are some titles which do not belong to either brand. Wrestlers from any brand can win these championships. They include the WWE 24/7 Championship and the WWE Women's Tag Team Championship. ==McMahon family== The McMahon family are the main owners of WWE. In addition to their job for the company, they also appear on-air as authority figures and wrestlers on all of the brands. Ring name Real name Notes Chairman of the Board of Directors Chief Executive Officer Majority owner Chief Brand Officer Member of the Board of Directors Executive Vice President, Global Talent Strategy & Development Member of the Board of Directors Executive Producer of NXT and NXT UK Hall of Famer ==Main roster== ===Raw=== ====Male wrestlers==== Ring name Real name Notes Inactive; shoulder surgery WWE Champion NXT Champion Hall of Famer United States Champion Inactive; completing his senior year at the University of Minnesota. Manager of Bobby Lashley ====Female wrestlers==== Ring name Real name Notes New WWE Signings. PWInsider.com (October 3, 2013). Retrieved on 2014-08-18. 24/7 Champion WWE Raw Women's Champion Manager of The Miz ===SmackDown=== ====Male wrestlers==== Ring name Real name Notes Inactive; broken neck SmackDown Tag Team Champion SmackDown Tag Team Champion King of the Ring Intercontinental Champion Universal Champion ====Female wrestlers==== Ring name Real name Notes SmackDown Women's Champion Also authority figure on Raw and SmackDown ====Other on-air personnel==== Ring name Real name Notes Manager of Roman Reigns ===Unassigned wrestlers=== The following list features wrestlers – promoted as free agents – who make limited or part-time appearances (such as Hall of Famers or legends), and thus aren't bound to any one brand, as well as newly-signed and undrafted personnel who are awaiting brand assignment. Ring name Real name Notes Inactive; torn ACL Inactive; maternity leave ===Authority figures=== The following serve as on- air authority figures (under the title \"WWE Official\") on both Raw and SmackDown. Ring name Real name Notes Director of Live Events Producer ==Developmental roster== ===NXT 2.0=== ====Male wrestlers==== Ring name Real name Notes North American Champion NXT Tag Team Champion NXT Tag Team Champion Inactive; knee surgery ====Female wrestlers==== thumb|175px|Gigi Dolin Ring name Real name Notes Inactive; maternity leave NXT Women's Tag Team Champion NXT Women's Tag Team Champion NXT Women's Champion Inactive; torn ACL ====Other on-air personnel==== Ring name Real name Notes Manager of Diamond Mine Manager of Von Wagner ===NXT UK=== Note: NXT UK—while a distinct brand—is also considered part of NXT, thus wrestlers may appear on both brands. ====Male wrestlers==== Ring name Real name Notes NXT United Kingdom Champion Unknown Unknown Heritage Cup Champion Unknown NXT UK Tag Team Champion Co-host of WWE The Run-In NXT UK Tag Team Champion ====Female wrestlers==== Ring name Real name Notes Amale Co-host of WWE The Run-In NXT UK Women's Champion ====Other on-air personnel==== Ring name Real name Notes General Manager of NXT UK Unknown Assistant to the General Manager of NXT UK Occasional wrestler ==Performance Center trainees== ===US=== ====Male wrestlers==== Ring name Real name Notes ====Female wrestlers==== Ring name Real name Notes ===UK=== ====Male wrestlers==== Ring name Real name Notes Unknown ==Referees== Ring name Real name Notes Senior referee Senior referee Senior referee ==Broadcast team== The following section pertains to announcers who cover WWE broadcasts. This group includes presenters, ringside commentators, ring announcers, backstage interviewers, pre-show hosts, and analysts. Ring name Real name Notes Ring announcer on NXT Play-by-play commentator on NXT UK Pre-show analyst for pay-per-views Hall of Famer Commentator on Raw, Main Event, and pay-per-views German- language commentator on pay-per-views French-language commentator on Raw, SmackDown, and pay-per-views Commentator on Raw and pay-per-views Co-host of Experience Co-host of The Bump Announcer Backstage interviewer Ring announcer on NXT UK Japanese-language color commentator on pay-per-views Japanese-language host of This Week in WWE Co-host of Raw Talk and Talking Smack Pre-show analyst for pay-per-views Hall of Famer Spanish-language color commentator on Raw, SmackDown, and pay- per-views Co-host of WWE en Español Co-host of WWE Saturday Night Play-by-play commentator on Raw and pay-per-views Backstage interviewer on SmackDown Pre-show host for pay-per-views Co-host of Talking Smack Co-host of The Bump Ring announcer on NXT: Level Up Backstage interviewer on Raw Play-by-play commentator on Main Event Co-host of WWE Sunday Dhamaal Spanish- language lead commentator on Raw, SmackDown, and pay-per-views Co-host of WWE en Español Co-host of The Bump Co-host of The Bump Backstage interviewer on NXT Backstage interviewer Vice President of Announcing Play-by-play commentator on SmackDown and pay-per-views Ring announcer on Raw Co-host of Wal3ooha French-language commentator on Raw, SmackDown, and pay- per-views Nathalie Mamo Nathalie Mamo Arabic-language host of WWE Now Co-host of Wal3ooha Commentator on NXT UK and NXT: Level Up Commentator, Occasional Wrestler Pre-show analyst for pay-per-views Host of Superstar Superfan Host of WWE Ahora Co-host of WWE The Run-In Host of Canvas 2 Canvas Co-host of WWE Now Co-host of The Bump Co-host of WWE Sunday Dhamaal Pre-show analyst for pay- per-views Ring announcer on SmackDown Backstage interviewer Host of Vintage and Bottom Line Co-host of Afterburn, Free for All, and This Week in WWE Narrator for Ride Along Play-by-play commentator on NXT: Level Up German- language commentator on pay-per-views Co-host of WWE Saturday Night Play-by- play commentator on NXT Narrator for List This! Commentator on NXT ==Ambassadors== Select former or retired WWE wrestlers not currently on the main roster (sometimes billed as \"WWE Legends\") and other celebrities and personalities have contracts to make periodic appearances—either on WWE TV or for promotional events—serving as \"ambassadors\" (public representatives/spokespeople) for the company. Ring name Real name Notes Hall of Famer Hall of Famer Martin Wright Hall of Famer Hall of Famer Hall of Famer Hall of Famer Hall of Famer Hall of Famer Hall of Famer Hall of Famer Hall of Famer-designate Global Ambassador Hall of Famer ==Creative team== Ring name Real name Notes Executive Director Christine Lubrano Christine Lubrano Senior Vice President, Creative Writing Operations Writer Writer for Raw Lead writer for SmackDown Lead writer NXT UK Lead writer for Raw Vice President, Creative Writing & Booking Hall of Famer Writer for SmackDown Vice President of Talent Development for NXT and NXT UK Hall of Famer ==Medical team== Name Real name Notes Medical Director Associate Medical Director Interim Program Administrator ImPACT Cardiologist Endocrinologist Orthopedic Sports Psychiatrist Senior Ringside Physician Ringside Physician Ringside Physician ==Producers== Ring name Real name Notes Hall of Famer Senior Producer Hall of Famer ==Performance Center staff== Note: as NXT and 205 Live are based at the Performance Center, PC coaches and trainers also work as producers for the brands. Ring name Real name Notes Head athletic trainer General Manager of the WWE Performance Center Trainer/Assistant Coach Trainer/Assistant Coach Trainer/Assistant Coach Performance Center Head Coach Vice President of Talent Development Trainer/Assistant Coach Trainer/Assistant Coach Assistant Head Coach Strength and conditioning coach Assistant strength and conditioning coach Athletic trainer Physical therapist Trainer/Assistant Coach ==Corporate staff== ===Board of Directors=== Name Notes Executive Vice President, Television Production President Chief Revenue Officer ===Executive officers=== Name Notes Senior Advisor of Business Strategy Minority owner Brad Blum Executive Vice President, Operations General Counsel and Executive Vice President, Intellectual Property Senior Vice President, General Counsel and Secretary Chief Technology Officer Chief Financial Officer Chief Administrative Officer Controller Chief Accounting Officer ===Senior management=== Name Notes Senior Vice President, Sales and Partnership Marketing Director, Content Media Distribution International Senior Manager, International Communications – London, England General Manager, Talent Senior Director of Broadcast Operations Executive, Treasury Function, Capital Markets and Corporate development projects. Senior Vice President, General Counsel and Secretary Senior Vice President, Live Events Coordinator, Community Relations Vice President and General Manager – India Vice President, Corporate Communications General Manager – Latin America Vice President, General Manager – Asia Pacific Senior Vice President & Head of Global Communications Head of Revenue Strategy and Development Vice President of Revenue Strategy and Development Senior Vice President and Head of Global Sales & Partnerships Executive Vice President, Development & Digital General Counsel and Corporate Secretary Senior Vice President, International Director, Live Event Production Management Vice President, Live Event Production Senior Vice President, Head of Investor Relations ==References== ==Related pages== * List of current champions in WWE ==Other websites== * WWE roster at WWE.com Category:WWE Category:Lists of professional wrestlers",
 "title": "List of WWE personnel"
}