{
 "id": "830685",
 "text": "\"It's the Great Pancake, Cleveland Brown\" is the 4th episode of The Cleveland Shows 2nd season. It was first broadcast on the Fox network on November 7, 2010. The episode was written by Aseem Batra. Ron Rubio is the director of the episode. About 6.70 million people watched the episode when it was first broadcast. == Story == Cleveland Junior wants to go trick-or-treating. Cleveland Brown says that he is too old to do so. The rest of the family goes trick-or-treating and makes Junior get candy from trick-or-treaters. Junior goes trick-or-treating anyway but other teenagers throw eggs at him. He feels foolish and Cleveland tries to make him act more mature. Junior goes to a party that his sister Roberta is going to, but he is still bullied at the party. Donna (Cleveland's wife) tells Cleveland to help Junior act like himself. Cleveland goes to the party and throws eggs with Junior at the people who were bullying him. Donna says to Rallo that he can only have one piece of candy a day. He eats too many and one of his teeth falls off. He tries to hide the tooth under a pillow. Donna finds it and tells him that the tooth fairy took it and give him a quarter. == Production == \"It's the Great Pancake, Cleveland Brown\" was written by Aseem Batra. Ron Rubio is the director of the episode. == Reception == About 6.70 million people watched the episode when it was first broadcast. Jason Hughs of TV Squad feels that the episode's story comes from Seth MacFarlane's parents saying that he is too old to go trick-or- treating. This happens to Cleveland Junior in the episode. Hughs loved the part with Cleveland helping Junior throw eggs at the bullies, then saying \"he was on his own\" after that. Emily VanDerWerff from The A.V. Club liked the story of Cleveland Junior being too old for trick-or-treating but not old enough for dressing up for Halloween. She thought the rest of the episode was boring. == References == == Other websites == * * Category:The Cleveland Show Category:2010 television episodes",
 "title": "It's the Great Pancake, Cleveland Brown"
}