{
 "id": "830897",
 "text": "The Ancient science and technology of the Meitei ethnicity describes scientific knowledge, practices, devices and technologies invented or used in Ancient Kangleipak (Antique Manipur). The Meitei ethnicity invented and used many simple machines. They also invented many advanced scientific methods in the field of medicine, astronomy. Most of the ancient knowledge are recorded in the manuscripts, which are popularly known as the Puya (Meitei texts). ==Astronomy== The Ancient Meitei astronomers had developed the knowledge of the planets, stars and other heavenly bodies. They believed in the nine planets, which includes the sun and the moon, and excludes the Earth and Pluto. ===Nine planet system=== Sl. No. Ancient Meitei Latin-Roman transliteration Modern Meitei Latin-Roman transliteration Literal meaning English translation 1 ꯅꯣꯡꯃꯥꯢꯆꯤꯡ ꯊꯄꯤ Nongmaiching Thapee ꯅꯣꯡꯃꯥꯢꯖꯤꯡ ꯊꯕꯤ Nongmaijing Thabee Sunday planet Sun 2 ꯅꯤꯡꯊꯧꯀꯥꯄ ꯊꯄꯤ Ningthoukaapa Thapee ꯅꯤꯡꯊꯧꯀꯥꯕ ꯊꯕꯤ Ningthoukaaba Thabee Monday planet Moon 3 ꯂꯩꯄꯥꯛꯄꯣꯛꯄ ꯊꯄꯤ Leipaakpokpa Thapee ꯂꯩꯕꯥꯛꯄꯣꯛꯄ ꯊꯕꯤ Leibaakpokpa Thabee Tuesday planet Mars 4 ꯌꯨꯝꯁꯥꯀꯩꯁꯥ ꯊꯄꯤ Yumsakeisa Thapee ꯌꯨꯝꯁꯀꯩꯁ ꯊꯕꯤ Yumsakeisa Thabee Wednesday planet Mercury 5 ꯁꯥꯀꯣꯜꯁꯦꯟ ꯊꯄꯤ Sakolsen Thapee ꯁꯒꯣꯜꯁꯦꯟ ꯊꯕꯤ Sagolsen Thabee Thursday planet Jupiter 6 ꯏꯂꯥꯢ ꯊꯄꯤ Eelai Thapee ꯏꯔꯥꯢ ꯊꯕꯤ Eerai Thabee Friday planet Venus 7 ꯊꯥꯡꯆ ꯊꯄꯤ Thaangcha Thapee ꯊꯥꯡꯖ ꯊꯕꯤ Thaangja Thabee Saturday planet Saturn 8 ꯁꯥꯀꯣꯛ ꯊꯄꯤ Shaakok Thapee ꯁꯥꯀꯣꯛ ꯊꯕꯤ Shaakok Thabee Head of Taoroinai dragon Uranus 9 ꯁꯥꯃꯩ ꯊꯄꯤ Shaamei Thapee ꯁꯥꯃꯩ ꯊꯕꯤ Shaamei Thabee Tail of Taoroinai dragon Neptune ==Medicine== ===Hidaklon=== The \"Hidaklon\" is an early work on the various medicinal herbs and their usage of curing the ailments. ===Leiron=== The \"Leiron\" is an old work on the different species of flowering plants (angiosperms). ==Technology== ===Metallurgy=== The development of metallurgy was well advanced in the Kakching region in Ancient Manipur. It used various techniques and methods to extract iron ores and convert them into usable forms. === Yangtoupa and Yangtoupi === Yangtoupa (Yangdouba) and Yangtoupi (Yangdoubi) are the god and the goddess of time in Meitei mythology, folklore and religion (Sanamahism) of Ancient Manipur (Antique Kangleipak). The earliest known record of the existence of the cult of the two time controlling deities dates back to the 2nd century AD during the reign of King Khuyoi Tompok (aka Khuiyoi Tompok). The wooden statues of the two deities are the first known sculptures ever created. The wooden idols of the two deities are the supporting devices to the ancient Meitei time measuring device. The two deities mounted on the frame, being separated by seven Kangkhils (seeds). Yangtoupa (Yangdouba), the god, is allowed to move towards Yangtoupi (Yangdoubi), the goddess, after each dip of the bowl. When the two deities meet each other, one day of the month is recorded according to the set mechanism. The two deities are offered foods and worshipped by the Tanyeishang Loishang (lit. Time Keeping Office) on the day of Cheiraoba (Meitei new year). In honor of the two deities, the Loishang (lit. office) celebrated the Cheiraoba. This is an important part of the Meitei tradition. == References == == Other websites == * https://www.imphaltimes.com/it- articles/item/13601-scientific-knowledge-as-reflected-in-the-manipuri- manuscript * https://filmfreeway.com/403965 * https://www.telegraphindia.com/north-east/translation-of-ancient-manipur- texts-begin/cid/1452394 * https://archive.org/details/in.ernet.dli.2015.465201 Category:History of science Category:History of Manipur Category:History of technology",
 "title": "Ancient Meitei science and technology"
}