{
 "id": "8310",
 "text": "John Fitzgerald Kennedy (May 29, 1917 – November 22, 1963) often known as JFK and Jack, was an American political person who was the 35th president of the United States from 1961 until 1963, when he was killed. Kennedy was the second youngest president in U.S. history, and also the youngest president in history to die while in office. Before becoming president, he was a U.S. senator from Massachusetts from 1953 to 1960. Before that, he was a U.S. representative for Massachusetts's 11th congressional district from 1947 until 1953. On November 22, 1963 Kennedy was assassinated in Dallas, Texas. ==Early life== Kennedy was born in Brookline, Massachusetts on May 29, 1917. He was the second of nine children of Joseph P. Kennedy (1888–1969). His father was a businessman and later US ambassador in the United Kingdom from 1938 until 1940. His mother was Rose Fitzgerald (1890–1995). Kennedy graduated from Harvard University with a Bachelor's Degree in International Relations. Before World War II began, he tried joining the U.S. Army, but was rejected because he had back problems; he instead joined the Navy. When his PT boat was sunk by a Japanese destroyer in 1943, he seriously injured his back. He still saved his surviving crew, and was later awarded a medal for his bravery. He was elected to the US Congress in 1946, and the US Senate in 1952. He married Jacqueline Bouvier on September 12, 1953. The couple had four children; a stillborn daughter (b. 1956), Caroline (b. 1957), John (1960–1999) and Patrick, who was born prematurely in August 1963 and lived only for two days. == Presidency == Kennedy was a member of the United States Democratic Party. He beat his Republican Party opponent, Richard Nixon, in the 1960 presidential election. Kennedy was the youngest president ever elected. He was also the first Roman Catholic President and the first president to win a Pulitzer Prize. Kennedy was a very good speaker and inspired a new generation of young Americans, and is the only president to have been awarded a Purple Heart. === Cuban Missile Crisis === In the beginning of his term, he approved the CIA's plan to invade Cuba. After the invasion turned out to be a failure, the Cuban Missile Crisis began. During the crisis, Cuba ordered a lot of nuclear missiles from the Soviet Union. It was the closest the world was to having a nuclear war. Kennedy ordered US Navy ships to surround Cuba. He ended the crisis peacefully by making an agreement with the Soviet Union. They agreed that the Soviet Union would stop selling nuclear weapons to Cuba. In return, the U.S. would take its missiles out of Turkey and promise to never invade Cuba again. === Other actions === Kennedy also created a plan called the New Frontier. This was a series of government programs, such as urban renewal, to help poor and working class people. He created the Peace Corps to help poor countries all over the world. He agreed to a large tax cut to help the economy. He also called for the Civil Rights Act of 1964, which would make discrimination and segregation illegal. Kennedy intended to reach a détente with Cuban Premier, Fidel Castro, and to withdraw all US military advisers from Vietnam.JFK's embrace of third world nationalists == Assassination == Kennedy was assassinated on November 22, 1963, in Dallas, Texas. He was being driven through the city in an open-top car, along with John Connally, the Governor of Texas. As the car drove into Dealey Plaza, shots were fired. Kennedy was shot once in the throat and once in the head. He was taken to Parkland Memorial Hospital away. At 1:00 p.m., Kennedy was pronounced dead. Lee Harvey Oswald, a former U.S. Marine, was the prime suspect in the murder, and he was arrested on the same day for the murder of a policeman called J. D. Tippit. Oswald denied shooting anyone and was killed two days later on November 24 by Jack Ruby. Kennedy had a state funeral on November 25, three days after his murder, near to the White House. He was buried in Arlington National Cemetery in Arlington, Virginia. == Legacy == After Kennedy died, Lyndon Johnson (his Vice President) took over and put many of Kennedy's ideas into law (see Great Society). Kennedy was a very popular president and still is today. He is considered one of the greatest presidents, ranking highly in public surveys and opinion polls. ==References== ==Other websites== * JFK Library and Museum * JFK Library and Museum Online Store * Category:1917 births Category:1963 deaths Category:Assassinated presidents of the United States Category:Burials at Arlington National Cemetery Category:Deaths by firearm in Texas Category:Kennedy family Category:People from Brookline, Massachusetts Category:People of the Vietnam War Category:Presidents of the United States Category:Pulitzer Prize winners Category:1960 United States presidential candidates Category:United States representatives from Massachusetts Category:United States senators from Massachusetts Category:Democratic Party (United States) politicians Category:20th-century presidents of the United States Category:National presidents assassinated in the 20th century",
 "title": "John F. Kennedy"
}