{
 "id": "831013",
 "text": "The Duchy of Bavaria-Munich (German: Bayern-München; also Upper Bavaria- Munich; German: Oberbayern-München) was a late medieval Bavarian partial duchy of the Wittelsbach dynasty. It was created by the division of the land in 1392 and existed until the reunification of Bavaria after the Landshut War of Succession (1504/05). The residence of the dukes was Munich. It is often shortened to the Duchy of Upper Bavaria after one of its predecessors, especially after the union of Bavaria-Ingolstadt with Bavaria-Landshut in 1447. == Territorial development == The four Bavarian partial duchies after the division of the land in 1392 (Bavaria-Munich green) In the division of the land of 1392/93, the former duchy of Upper Bavaria and the northern Gaulish possessions, which Duke Otto V had received from Emperor Charles IV in 1373 as compensation for the Mark of Brandenburg, were split into two parts of roughly equal budgetary value: the highly fragmented Bavaria-Ingolstadt and the territorially much more coherent Bavaria-Munich. The partial duchy of Bavaria- Munich essentially consisted of two areas separated by a narrow strip near Indersdorf, which belonged to Bavaria-Landshut. The northern part extended from Riedenburg an der Altmühl via Neustadt an der Donau and Vohburg to Mainburg and Pfaffenhofen an der Ilm. The larger southern part, located on the Isar River, was bounded on the west by the Lech River. It stretched from Dachau, Fürstenfeldbruck and Munich in the north to Starnberg, Wolfratshausen, Aibling and Tölz and on to Kochelsee and Walchensee in the south. In addition, Regenstauf and Stadtamhof north of the imperial city of Regensburg belonged to Bavaria-Munich. Nominally, Schwandorf, Burglengenfeld, Velburg and Hemau in the northern Gau were also part of the duchy, but they had already been pledged to the Palatine Wittelsbach dynasty around 1350. In the 1420s, the dukes of Bavaria-Munich were able to significantly expand their territory. After the Bavarian War (1420-1422), they received the area around Ebersberg and Markt Schwaben from Bavaria-Ingolstadt, and in the Prussburg arbitration award of 1429, they were granted about half of the Straubinger Ländchen. This meant that large parts of the Bavarian Forest around Fürth, Kötzting and Regen, as well as a wide strip south of the Danube with Kelheim and the royal seat of Straubing, fell to Bavaria-Munich. After the death of the last duke of Bavaria-Ingolstadt in 1447, Bavaria-Landshut took over the territory of his duchy, while Bavaria-Munich went largely empty-handed. In the Landshut War of Succession, which broke out after the extinction of the Landshut line in the male line in 1503, the Munich duke Albrecht IV was finally able to secure almost the entire territory of the united duchies of Bavaria-Landshut and Bavaria-Ingolstadt, but he had to cede the \"Land im Gebirg\" around Kufstein, Kitzbühel and Rattenberg as well as Mondsee to Austria and possessions in the northern Gau and on the Danube to the newly created duchy of Palatinate- Neuburg. The Duchy of Bavaria-Munich, enlarged by Albrecht IV, is again referred to simply as Bavaria. == References == * Category:14th-century establishments in Germany Category:1392 establishments Category:16th-century disestablishments in Germany Category:1505 Category:Former states in Germany Category:History of Munich",
 "title": "Bavaria-Munich"
}