{
 "id": "83107",
 "text": "== Events == * c. January – A giant volcano erupts. No one is sure where, but it may have been in a tropical location like El Chichón, Mexico or Quilotoa, Ecuador.Emile-Geay, J., Seager, R., Cane, M., Cook, E., Haug, G.H., [The volcanic eruption of 1258 A.D. and the subsequent ENSO event, Geophysical Research Letters, 321, XXXX, doi:10.1029/2006JAXYZW, Mar 2006. (available online, pdf file) Observed effects of the eruption include the following anecdotal accounts: dry fog in France; lunar eclipses in England; severe winter in Europe; a \"harsh\" spring in Northern Iceland; famine in England, Western Germany, France, and Northern Italy; and pestilence in London, parts of France, Austria, Iraq, Syria, and South-East Turkey.Stothers, R.B. (2000) Climatic and Demographic consequences of the Massive Volcanic Eruption of 1258. Climatic Change, 45, 361-374. * February 10 – Battle of Baghdad (1258) – Hulagu Khan's Mongol forces overrun Baghdad. The city was the center of Islamic culture and learning and capital of the Abbasid Caliphate. The Mongols burned the city to the ground, and killed many people. * Llywelyn the Last declares himself Prince of Wales. He is the last ruler of an independent Wales before its conquest by the English. * King Henry III of England is forced by seven powerful barons to accept the Provisions of Oxford, effectively ending the absolute monarchy in England by requiring the calling of a parliament. * The Chinese era Baoyou ends in the Northern Song Dynasty of China. * Civil unrest in northern Italy starts the medieval musical form of Geisslerlieder, songs of repentance sung by wandering bands of Flagellants. * Gissur Thorvaldsson is made Earl of Iceland by King Haakon IV of Norway. * Korea surrenders to Mongols. == Births == * Arghun, fourth Ilkhanate ruler of Iran (approximate date; died 1291) * Osman I, founder of the Ottoman Empire (died 1326) == Deaths == * February 20 – Al-Musta'sim, last Abbasid Caliph of Baghdad * August 18 – Theodore II Lascaris, emperor of Nicea (Byzantine Emperor in exile) * Hong Bok-won, Goryeo commander who later served the Mongol Empire * Meinhard I of Gorizia-Tyrol (born c. 1200) * Abu-l-Hassan ash- Shadhili, Moroccan spiritual leader (born 1175) * Clement of Dunblane,13th- century Dominican friar who was the first member of the Dominican Order in Britain to become a bishop == Notes ==",
 "title": "1258"
}