{
 "id": "83116",
 "text": "Jon Brion (born December 11, 1963) is an American rock and pop multi- instrumentalist, singer, songwriter, composer and record producer. He was born in Glen Ridge, New Jersey. His mother was a jazz singer, his father a band director at Yale, his brother is an arranger and sister a violinist. ==The Bats== Brion and Bill Murphy began writing together in New Haven, Connecticut. They recorded some demo tracks in makeshift apartment studios, and worked out their arrangements at Yale University Campus. They enlisted the talents of bassist Don \"Riff\" Fertman to form The Bats (unlike the New Zealand band of the same name). In 1982, the trio created a imaginative set of pop songs in a small studio in Connecticut. A single called \"Popgun\" followed by an LP entitled How Pop Can You Get? were released on the independent label Gustav. The album failed to chart, and the group was disbanded. ==Discography== ===Studio albums=== *How Pop Can You Get? (with The Bats, 1982) *Ro Sham Bo (with The Grays, 1994) *Meaningless (solo, 2001) ===Film scores=== * Hard Eight (with Michael Penn) (1996) * Magnolia (1999) * Punch-Drunk Love (2002) * Eternal Sunshine of the Spotless Mind (2003) * I ♥ Huckabees (2004) * The Break-Up (2006) ===As producer=== * Aimee Mann, Whatever, (1993) * Aimee Mann, I'm with Stupid, (1995) * Rufus Wainwright, Rufus Wainwright, (1998) * Eleni Mandell, Wishbone, (1998) * Robyn Hitchcock, Jewels for Sophia, (1998) * Robyn Hitchcock, A Star for Bram, (1999) * Fiona Apple, When the Pawn..., (1999) * The Crystal Method - \"Bad Stone\" (1997), \"Over the Line\" (2001), \"Realizer\" (2004) * Elliott Smith, From a Basement on a Hill, (unreleased version, recorded 2001) * Brad Mehldau, Largo, (2002) * Rhett Miller, The Instigator, (2002) * Evan Dando, Baby I'm Bored, (2003) * Fiona Apple, Extraordinary Machine, (unreleased version, recorded 2002-2003) * Kanye West, Late Registration (as co-executive producer and co-producer on several tracks), (2005) * Marjorie Fair, Self Help Serenade (as co-executive producer), (2005) * Kanye West, Graduation (as co-producer), (2007) * Spoon (band), \"The Underdog,\" Ga Ga Ga Ga Ga, (2007) ==Other websites== * Jon Brion Unofficial site * Jon Brion's Official Website Category:1963 births Category:Living people Category:Musicians from New Jersey Category:Singers from New Jersey",
 "title": "Jon Brion"
}