{
 "id": "831121",
 "text": "Belsat (; ) is a Polish television channel for people in Belarus. It is a branch of the broadcasting organization Telewizja Polska. Agnieszka Romaszewska-Guzy is the head of Belsat. Intellectual property of Belsat is made by mostly Belarusian journalists. Journalists also work for Belsat in Belarus. On April 26, 2007, Alexander Lukashenko said that the channel is bad. The government of Belarus has been making troubles for Belsat all the time and does not not give the channel an approval. Belsat's journalists have gotten many punishments for work. In March 2008, for example, many Belsat journalists were arrested and technical things were taken away. To 2017, they have spent a number of 125 days in detention and been fined $94,296 US, simply for doing their work. In 2017, the channel's Minsk house was searched and computers from there were taken away. The same year, Belsat TV got a veto by a Minsk court on using its trademark. Since then, Belsat's journalists have used other trademark that has letters from the channel's name – the Cyrillic “BLS” (БЛС) and “tv”. The most recent search of Belsat's Minsk house was done in 2019. It has been writing about the 2020 Belarusian protests and 2020 Belarusian presidential election, so many journalists of Belsat have been tried and arrested for that. In 2020 Belsat journalists were detained 162 times, while their things were taken away very often. 26 journalists were arrested, out of which six journalists were arrested two times, and one journalist was arrested three times, giving 34 arrests. They had been sentenced to a number of 392 days in prison. Seven of arrested journalists were beaten by the police. Seven journalist following detention were taken to hospitals. During the crackdown on the protests of August 9–12, Belsat's journalists were putting their lives on the line, and two of them were injured. Belsat's journalists got fines in $26 353,44 for their work in Belarus in 2020. In February 2021, Katsyaryna Andreeva and Darya Chultsova of Belsat were sentenced to two years in prison by a court in Minsk for informing on anti-government protests held around the house where Raman Bandarenka was beaten to death in November 2020. The site of Belsat can't be opened in Belarus since August 2020. Since May 2021, the government stops attempts to open the main website of Belsat mirror as well. In July 2021, Belsat's content was declared extremist, meaning distributing it can be punished by a 30-days jail. On November 3, 2021, the Ministry of Internal Affairs declared Belsat an extremist group. Creation of an extremist group or participation in it is a criminal offence in Belarus. In January 2023, Daria Losik, the wife of Ihar Losik, was sentenced to two years in prison for an interview with the channel under a criminal article on promoting extremist activity. In the fall of 2022, a criminal case for an interview with the channel was opened against Natalya Suslova, the mother of Belarusian volunteer Pavel “Volat” Suslov, who was killed in action in Ukraine. In autumn 2024, Belsat was banned in Russia. == References == Category:2000s establishments in Poland Category:2007 establishments in Europe Category:Censorship in Belarus Category:Television channels in Europe",
 "title": "Belsat"
}