{
 "id": "83139",
 "text": "== Events == * Middle Ages in Europe * Fifth Crusade (1217-1221) * Battle of Lihula in Estonia between Estonians and Swedes. * Mongols first invade Abbasid caliphate – Bukhara and Samarkand taken * End of the Kara-Khitan Khanate, destroyed by Genghis Khan's Mongolian cavalry * Dominican Order approved by Pope Honorius III * Frederick II crowned Holy Roman Emperor by Pope Honorius III * Conrad of Masovia drives out the heathen Prussians from a Masovian territory of Chelmno Land * Trial by ordeal abolished in England * The German Hohenstaufen dynasty which had ruled Sicily since 1194, adopts Palermo as its principal seat * Dordrecht receives city rights, making it the oldest city in the present-day Netherlands * Ljubljana receives its town rights * The Islamic lands of Central Asia are overrun by the armies of the Mongol invader Genghis Khan (ca. 1155-1227), who laid waste to many civilizations and created an empire that stretched from China to the Caspian Sea. However, he failed to destroy the strength of Islam in Central Asia. == Architecture == * Gothic architecture in Europe * Rebuilding of the Cathedral of Chartres, which had been destroyed by a fire in 1194, is completed * Rebuilding of the York Minster begins * Building of the Salisbury Cathedral begins == Births == * April 1 – Emperor Go-Saga of Japan (died 1272) * November 11 – Alphonse of Toulouse, son of Louis VIII of France (died 1271) * Thomas Ercildoun, Scottish minstrel (died 1297) * Alexander Nevsky, Grand Prince of Novgorod and Vladimir * Przemysł I of Poland (died 1257) * Yaroslav of Russia, Grand Duke of Vladimir * Walter de Burgh, 1st Earl of Ulster (died 1271) == Deaths == * February 17 – Theobald I, Duke of Lorraine * April 15 – Adolf of Altena, Archbishop of Cologne * Michael Choniates, Byzantine writer and ecclesiastic * Farid od-Din Mohammad ebn Ebrahim 'Attar, Persian mystical poet * Saxo Grammaticus, Danish historian (born 1150) * Henry de Bohun, 1st Earl of Hereford (born 1176) * Mestwin I of Pomerania * Queen Urraca of Portugal spouse of King Afonso II of Portugal (born 1186) == Office holders == * List of state leaders in 1220 * List of religious leaders in 1220",
 "title": "1220"
}