{
 "id": "831509",
 "text": "Live Action Toy Story is an American live-action adventure fan film. this a shot-to-shot fan remake of the original Toy Story in 1995, using expensive special-effects filming with stop-motion and puppetry with wires. released in premiered August 22, 2012 and YouTube exclusive in January 12, 2013 also re- release in November 22, 2015 on VOD. == Plot == set in 2005 A.D., While Woody at staff meeting around Andy's birthday through find the presents also Buzz Lightyear arrives. Buzz attempts to fly stunt and playing Buzz all day and night. arguing Woody and Buzz tells Sid was shown a Combat Carl strapping with the fireworks and explodes to pieces. then in 6am, then watches Woody talks to the Magic 8-ball yells at anguish and throws down the shelf, distracting Buzz to Woody holds an remote control's RC to pushed by a rolling globe went slipped Buzz out the window. then brawls Hamm, Potato Head to Woody throwed then retreated. in the middle of the night at gas station slept Woody saws Buzz to fight inside the van. leaving Woody and Buzz, then a tanker truck hitting them straight. Buzz tells Woody claiming he's a Space Ranger or a toy. surrounded by Pizza Planet to transported to the restaurant to find Andy, went Sid to the claw machine by bunch of aliens to sell or toynapped by himself. sometimes inside Sid's room by bunch of mutated pieced toys to cannibalized things awared was scared by Woody. Sid integration Woody tortured by a magnifying glass burned on his forehead to splashed by cereal bowl, to escape the stairs guarding by Scud attacked. Buzz saws an action-figure commercial of himself then walks miserablity away claiming not a flying toy to fell down again crashed his arm to the ground. Woody saws Buzz inside Hannah's room played as Mrs. Nesbitt. when Woody throws by an rope as a Christmas lights- like rope to tells Buzz, sometimes watching Buzz's arm ripped saw by the toys screaming. then a thunderstorm rain watching Sid delivery an rocket firework called 'The Big One' to strapped Buzz. Woody saying Buzz than claiming a Space Ranger pretending to a himself, then escaping the crate fell by Woody. tried to attempt to rescue Buzz by Sid, then the army of mutant toys to signal to morse code to locating the places. stalking the entire house while Sid tells Woody to commanded by his toys to attacked him, through stares Sid looks Woody saying 'We Toys Can't see Everything' also 'So Play Nice' screaming away by the toys. then chased by moving truck surrounded by Scud bites Woody's leg to fight the dog, Woody find by a cardboard boxes to RC to chasing Scud. then RC chased an truck to pulled by Slinky drops the ram then accidentally pulls RC, Woody and Buzz slides by a parking vehicles to left, then Slinky thrown everyone. mostly attempted to sunburn lighting the rocket then flies off the RC hitting by Potato Head, then stop the Big One by blowing out the sky, flying away to the van. then in December 25, 2005 when Christmas Day saved by Woody and Buzz signaling again by brought by Mrs. Potato Head to as a wife is own, later a puppy, zooming the characters. == Cast == ;Main voices and Live- action cast * Jim Hanks as Woody, a pull-string cowboy toy. He's Andy's favorite toy. * Tim Allen as Buzz Lightyear * Don Rickles as Mr. Potato Head * Blake Clark as Slinky Dog * Wallace Shawn as Rex * John Ratzenberger as Hamm * Annie Potts as Bo Peep * T.J. Bright as Andy * Victor Bright as Sid * Carla Pauley as Mrs. Davis/Charlene * R. Lee Ermey as Sarge, a green army man. * Delani Kent as Hannah * Jerome Ranft as Lenny/Al's Toy Barn announcer * Abby 'Abigail' Peters as Molly * Jonason Pauley as Pizza Planet delivery driver/Angus * Debi Derryberry and Nancy Cartwright as Squeeze Toy Aliens/Pizza Planet announcer * Bill Farmer as Pizza Planet announcer * Sabrina Bright as Sid's Mom * Jeff Pidgeon as Mr. Spell/Robot * Phil Proctor as bowling announcer/Pizza Planet guard * Penn Jillette as TV Announcer * Andrew Stanton as Buzz Lightyear commercial chorus === Cast-notes === * Non- speaking characters notable include Scud provided by all by Frank Welker, Barrel of Monkeys, Etch A Sketch, Snake, Clown, Babyface, RC, and Buster. other cast include Michael Perrotta Jr. as Gas Attendant, A.D. Ramirez as Sid's dad foot, also Rupert the Bulldog as Scud, Michael Perrotta as Bowler extra, Jeff Pauley as Eggman Movers employee, other cast include one of those Andy's birthday inviters such as, William Pauley, Heath Bright, Jaime Rodriguez, Zayden Rodriguez, Jason Alpers, Noah Smith and Nyelle Smith, Smith's foster kids extra. == Release Dates == Country Premiere February 16, 2013 January 12, 2013 November 12, 2013 July 12, 2013 January 16, 2014 February 12, 2013 December 10, 2015 August 4, 2015 December 12, 2015 March 12, 2014 September 12, 2013 November 16, 2013 December 5, 2013 March 10, 2013 August 10, 2013 June 10, 2013 ==Production== Jonason Pauley and Jess Perrotta planned to a Live-action fan-film recreated version of the original film, started in 2010, most locations during filming in 2010 to 2011 on Mesa, Arizona, Tempe Peter Piper Pizza as interiors of Pizza Planet scenes, Sinclair Gas as Dinoco gas station, as stand-in of the scenes. ==References== == websites == * Category:2013 comedy movies Category:2010s comedy movies Category:2010s buddy movies Category:2013 movies Category:American adventure movies Category:American buddy movies Category:American comedy movies Category:American family movies Category:Buddy comedy movies Category:English- language movies Category:Pixar movies Category:Toy Story Category:American movie remakes",
 "title": "Live Action Toy Story"
}