{
 "id": "831896",
 "text": "Ever Given is a large container ship. It is one of the largest container ships in the world. The ship can carry 20.124 TEU's. Imabari Shipbuilding also has a branch that leases ships. This branch owns the ship. The ship is operated by container transportation and shipping company Evergreen Marine. Ever Given is registered in Panama, and its technical management is the responsibility of the German ship management company Bernhard Schulte Shipmanagement (BSM). On 23 March 2021, while traveling from Tanjung Pelepas, Malaysia to Rotterdam, Netherlands, the ship became stuck in the Suez Canal and blocked it. == Description == Ever Given is one of 13 container ships built to the Imabari 20000 design developed by Imabari Shipbuilding. With a length of , it is one of the longest ships in service. Its hull has a beam of , a depth of , and a fully laden draft of . Ever Given has a gross tonnage of 220,940; net tonnage of 99,155; and deadweight tonnage of 199,629 tons. The ship's container capacity is . == Operational history == === 2019 Hamburg collision === On 9 February 2019, the ship struck and heavily damaged a 25-meter-long HADAG ferry boat at Blankenese, near the harbour of Hamburg. Two minutes after the collision, a traffic ban on the Elbe river was issued due to high winds. === 2021 Suez Canal grounding === At 07:40 Eastern European Time (UTC+02:00) on 23 March 2021, the ship was passing through the Suez Canal on its way to Rotterdam from Tanjung Pelepas when it became stuck (coordinates 30.01761, 32.58018 ) near the village of Manshiyet Rugola and blocked the canal. The ship ended up with its bow wedged in one bank of the canal and stern nearly touching the other. The ship had been running fifth in a northbound convoy, with fifteen vessels behind it when it ran aground. Traffic in both directions was blocked for at least five days, leading to a traffic jam of over two hundred vessels. On 24 March, Bernhard Schulte Shipmanagement (BSM), the technical manager of the ship, denied earlier reports that it had been partially refloated. In addition, trade experts are worried about a supply chain delay, and tension due to the indefinite delay to the trapped ships as well as other vessels that planned to cross the Suez canal. Eight tugboats worked to re-float the vessel in collaboration with a Komatsu excavator removing sand from the side of the canal where the bow of the vessel is wedged. After an overnight break, the salvage work resumed in the morning of 25 March. On 25 March, an unnamed Egyptian official was reported as saying that refloating the ship would take days if not weeks. Lt. Gen. Ossama Rabei, head of the SCA, announced, \"The Suez Canal will not spare any efforts to ensure the restoration of navigation and to serve the movement of global trade.\" BSM and SKK said that all 25 crew are safe and accounted for. All crew remains on board, and there had been \"no reports of injuries or pollution\". Egyptian meteorologists reported that high winds and a sandstorm had affected the area on the day of the grounding, with winds reaching as much as . Addressing a press conference on 27 March, Rabie, Chairman of the SCA, said that weather conditions were \"not the main reasons\" for the ship's grounding. He added that there may have been technical or human errors and that these would be shown in the investigation. == Related pages == * Suezmax == Notes == == References == Category:Ships",
 "title": "Ever Given"
}