{
 "id": "831874",
 "text": "On 23 March 2021, Ever Given, a container ship, got stuck on the shore of the Suez Canal in Egypt. The ship was 400 meters long. A sand storm and strong winds of up to made it hit the banks in the canal. Authorities said that this was not the main reason for the accident and that something probably went wrong with the ship or the crew made a mistake. The accident stopped any other vessels from passing through the canal. By 27 March, four days after the ship got stuck, over 300 ships were lined up to pass through the canal while they waited for the problem to be fixed. On March 29th, 2021, the ship was finally free to move again.https://www.bbc.com/news/world-middle- east-56559904#:~:text=The%20stern%20of%20a%20huge,from%20the%20shoreline%2C%20officials%20say . However, the event made a major impact on the global economy, because all cargo ships traveling across the Suez Canal were delayed. == Background == The Suez Canal is one of the world's most important trading routes. It was opened in 1869. By 2021 around fifty ships travel through the canal each day. This is about 12% of total global trade. When it was built, the canal was basically one way, with a part in the middle where ships could pass each other. Today, ships can pass each other in many parts of the canal. Where this is not possible, groups of ships must take turns. The canal is being expanded, but most parts are still single-lane. Ever Given was first put into the water on 9 May 2018, and started operating on 25 September 2018. The owner is Shoei Kisen Kaisha, a company of Japan's Imabari Shipbuilding. The operator is the Taiwan- based company Evergreen Marine and the vessel is managed by Bernhard Schulte Shipmanagement. The vessel is registered in Panama. The ship's owners have insurance cover for $3.1 billion. Evergreen's Protection and Indemnity (third party) liabilities insurance cover is provided by mutual UK P&I; Club. The ship is insured in the Japanese market. Insurance industry sources say the ship's owners could be facing insurance claims from the Suez Canal Authority (SCA) for loss of money and other ships who were stuck behind it. Container ships of this size are usually insured for hull and machinery damage of between $100 and $140 million. Bill Kavanagh, a National Maritime College of Ireland lecturer and former captain, has said that sailing through the Suez canal was very difficult, and risky. Wind can cause the container areas of vessels to act like a sail and affect the course of the ship. Also, once a heavy ship like the Ever Given starts to go off the path, it's hard to steer. The government of Egypt requires ships traveling through the canal to be boarded by an Egyptian \"Suez crew\", including one or more official maritime pilots from Egypt's SCA. These people command the ship, taking over from the regular crew. There were two Egyptian SCA pilots on board at the time of the accident. Ever Given was travelling from Tanjung Pelepas, Malaysia, to Rotterdam, Netherlands. It was fifth in a northbound convoy, with fifteen vessels behind it when it got stuck near the village of Manshiyet Rugola. On 23 March 2021, at 07:40 EGY (05:40 UTC), the Given was travelling through the Suez Canal when it was caught in a sandstorm. The strong winds, which reached , resulted in the \"loss of the ability to steer the ship,\" and caused the hull to change direction. The Ever Given then hit the bank at the mark (measured from Port Said on the Mediterranean Sea; from Suez Port on the Gulf of Suez). The ship turned sideways, and blocked the canal. The crew of the Ever Given, was accounted for, and no injuries were reported. At this point, the Suez Canal is a single waterway. Evert Lataire, head of maritime technology division at the University of Ghent, looked at the situation and found that the bank effect may have contributed to the grounding. This effect causes the stern of a ship to swing toward the near bank when operating in constricted waterway. Other forces were winds pushing the ship from the side. Since most of the focus of modern ship design is directed towards efficiency and stability at sea, the effects of hydrodynamics in shallow waters need to be studied further. Over 200 vessels at both ends of the canal were stopped by Ever Given, including five other container ships of similar size. These included 41 bulk carriers and 24 crude tankers. The vessels represented roughly 16.9 million tonnes of deadweight. Some docked at ports and anchorages in the area, but many remained in place. The ships in the area range from small cargo vessels to large ships, including the Russian Navy Altay-class oiler Kola, which had been involved in a minor collision with bulk carrier Ark Royal earlier that day. == Response == Officials planned to move two vessels from behind Ever Given to make room for the refloating operation. Fuel and ballast water were removed from the ship to help lighten it; heavy machinery, including an excavator, worked to dig the bow out. Eight tugboats are assisting in the attempt to pull it free. Peter Berdowski, Chief Executive of Royal Boskalis Westminster, stated that the operation \"can take days to weeks\". On 25 March, the Suez Canal Authority stopped navigation through the Suez Canal until the Given could be refloated. The same day, Egyptian President Abdel Fattah el-Sisi's advisor on seaports stated that he expected the canal to be cleared in \"48–72 hours, maximum\". The following day, the Suez Canal Authority said that its dredging operations were about 87% complete. On 26 March, the SCA accepted an offer made by a United States Navy assessment team of dredging experts to assist in efforts to remove the ship. On 27 March, the SCA said that 14 tugboats were trying to take advantage of that day's high tide and that more would arrive the following day if the latest attempt failed. Yukito Higaki, president of owners Shoei Kisen, reported that the ship did not appear to be damaged, saying \"The ship is not taking water. Once it refloats, it should be able to operate.\" By 5:00 PM GMT, according to Egypt Today, the ship had moved by 30 meters (100 feet) towards the north. Delays in shipping might persist after the Ever Given is freed, as vessels may face busy ports and additional delays before offloading. As of 27 March, more than 300 ships were delayed at both ends and in the middle of the canal, with many more still approaching or having altered their paths. Addressing a press conference, Osama Rabie, SCA Chairman, said that weather conditions were \"not the main reasons\" for the ship's grounding, adding, \"There may have been technical or human errors... All of these factors will become apparent in the investigation.\" On 28 March, the Egyptian President, Abdel Fattah el-Sisi, ordered preparations for lightening the ship's cargo. == Global economic impact == Experts warned that this incident would cause shipping delays for customers around the world. Lloyd's List estimated the value of the goods delayed each hour at US $400 million, and that every day it took to clear the obstruction would disrupt an additional US$9 billion worth of goods. Michael Lynch, president of Strategic Energy & Economic Research, said that a rise in oil prices was caused by people buying large amounts of oil while prices were low and then selling off oil at higher prices while oil was in shortage: \"people buying in after recent declines in oil prices, with the Suez closing the trigger factor\". James Williams, energy economist at WTRG Economics said that due to existing stocks \"a few days of slowdown in [oil] delivery is not critical to the market.\" After the Ever Green was freed on 29 March 2021, the oil prices dropped again. The event will only delay goods, which might only impact industries with existing shortages such as with semiconductors. To act against shortages of goods in the long term, future shipments can be ordered earlier than normal until the difference has been made up. However, a consultant at another firm noted that even a short-term disruption at the Suez Canal would have a domino effect for several months along the supply chain. Some freight forwarders noted that demand for alternative means of transportation was expected to rise within the next few weeks on Europe to Asia routes as a consequence of shippers trying to avoid the disruption and uncertainty caused by the blockage of the canal. The usual backup route for ships between Asia and Europe is to go around the African continent via the Cape of Good Hope. This route is long and takes 10 to 12 more days. As of March 26, some ships had already taken that route. Russia used this incident to promote its Arctic shipping routes as a shorter alternative to carrying goods around Africa. Several people have warned that the number of ships with valuable cargo in such a small area may attract pirates. Certain shipping companies already asked for United States fleet, based in Bahrain, to increase security. == References == == Other websites == * Live global map of marine traffic Category:Pages with unreviewed translations Category:2020s in Egypt Category:March 2021 events Category:Maritime disasters Category:2021 disasters in Africa",
 "title": "2021 Suez Canal incident"
}