{
 "id": "832055",
 "text": "The dragons play a significant role in the legendary accounts of Meitei folklore, Meitei literature, Meitei mythology and Meitei religion (Sanamahism) of Ancient Kangleipak (Ancient Manipur), Medieval Kangleipak (Medieval Manipur) and Modern Kangleipak (Modern Manipur).Moirangthem Kirti (1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0.North East India History Association. Session (1990). Proceedings of North East India History Association. The Association. == List == === Hiyang Hiren === The Hiyang Hiren, also spelt as Hiyang Hilen, is said to be a well furnished race boat. This is often built in the shape of a dragon. Many legends say that it possesses spiritual powers. === Nongshaba === Nongshaba, the dragon lion, is also known as Kanglasha, the dragon of the Kangla, the city of Ancient Manipur. He is a child of Atingkok, the Supreme Being. Unlike his siblings, he always remains in the form of the mythical beast rather than that of a God (human figure).Internationales Asien Forum: International quarterly for Asian studies. Weltform Verlag. 1989 === Pakhangba === Pakhangba is the youngest son of Leimarel Sidabi, the supreme mother earth goddess. He was given the throne of the universe to protect and rule the world by Atingkok, his father. He could change himself into both a serpentine dragon as well as a human. Several legends revolve around his identity as an ancient historical figure.Museum, Indian (1998). Bulletin - Indian Museum.Bahadur, Mutua; Santabai, Y. (1989). Tribal Art of Manipur. Mutua Museum.Mohd. Anis Md. Nor (2012). Dancing Mosaic: Issues on Dance Hybridity. Cultural Centre, University of Malaya. ISBN 978-967-03-8017-9. === Poubi Lai === Poubi Lai is the tyrant dragon serpent of the primitive Loktak lake. It is one of the popular figures in Meitei folklore and mythology. There are many stories about this huge dragon, who once gained its fame through its notorious nature.'Story of a Giant Poubi lai' show begins on Jan 7Manipur's Loch Ness monster and other folktales at Wari-Jalsa storytelling fest - The Week === Taoroinai === Taoroinai, also spelled as Taoloinai, is a mythical dragon serpent, who lives in the cosmic ocean. It is known for bringing down the divine celestial egg (nonglum) down to earth.Wahengbam Ibohal (1986). The History of Manipur: An early period. Manipur Commercial Company. == Gallery == File:Flag of Manipur hoisted on the Independence Day 1947.jpg File:Knagla fort, manipur, India.jpg File:Kangla Fort Complex, Imphal (10).jpeg File:The Saheed Minar.jpg File:Kangla3.jpg File:Flag of Manipur.svg File:Kangla Sha.JPG File:In manipur1.gif File:Kangla dragons imphal.JPG File:Sculptures of Kanglasha (Kangla Sha), installed on the top of a monumental pillar, dedicated to the Meitei martyrs of Kangleipak (Manipur), standing inside the historic Bir Tikendrajit Park, Imphal.jpg File:IBUDHOU PAKHANGBA LAISANG AT KAKCHING GARDEN.jpg == Related pages == * Symbols of Sanamahism * List of figures in Meitei mythology * Meitei folklore == References == Category:Meitei dragons",
 "title": "Meitei dragons"
}