{
 "id": "832079",
 "text": "Krak de Chevaliers () is a castle in Syria. The castle is on a hill and its position means that it can control the nearby valley and two Roman roads. The castle's builders were Crusaders. Between 1144 and 1271 the Knights Hospitaller used the castle. Because scholars have studied the castle and have restored the buildings, people say that Krak de Chevaliers is the best castle that the Crusaders built. The military design of the castle is complex and shows the last development of fortification by during existence of the Crusader states. It is one of the first \"concentric castles\" (castles with concentric layers of walls). Krak de Chevaliers was an important development in the design of castles, and many other castles' builders copied its design. No army in the Middle Ages ever took the castle by force. UNESCO has named the castle a World Heritage Site. == History == Krak de Chevaliers stands on a hill which is high. The hill is at the southern end of the Jabal Ansāriyya mountains, in a position looking over the Homs Gap. Nearby roads carry a trade routes between Antioch and Beirut. The hill has been a fortified place since the 13th century BCE. In 1031 CE, Kurds started to live there in a small castle. In 1110, the Crusaders attacked it took control of the castle. After the Crusaders set up the County of Tripoli, the Knights Hospitaller took control of the castle in 1142. The Knights Hospitaller were the builders of the castle whose ruins remain. The newer castle stands on top of the older 11th-century castle. The oldest buildings there now were built after 1142, when the Knights Hospitaller started to use the place. The first part of the castle to be complete was the centre. At the centre was a building whose shape was an approximation of a triangle. Here are the great hall and kitchens, the chapel, and the granaries, and around these is a thick, strong, masonry wall with towers. When Saladin saw it after his army's victory at the Battle of Hattin, he decided not to attack it. At the end of the 12th century, the Knights Hospitaller built another defensive wall around the central castle, whereby they closed in of the hill. This wall was also very thick and strong. There are towers at positions along the wall. The first towers to be complete were square in shape, but the later ones were semi-circular. There were two gates with barbicans, one behind the other and joined together by a stone passage with a stone vault. Another postern gate was in the north wall, in a strong position. The Crusaders built many other buildings and made many improvements to the fortifications during this time. The castle was the Hospitallers' headquarters. The Crusaders built the castle's great hall () around 1200. The knights lived together in the great hall. Most of the buildings were complete by around 1220. After 1170, the castle's chapel was given new frescos. The frescos' painters did the work in a painting style that is like Byzantine art. The Byzantines' influence in the Crusader states was greatest between 1143 and 1169. The builders at Krak de Chevaliers did new work on the great hall building in the style of Gothic architecture. Krak de Chevaliers was one of several concentric castles that the Knights Hospitaller and the Knights Templar built in the 13th century to stop Muslim armies attacking the Crusader states. The new design was necessary for the repulsion of armies that used new designs of catapults and trebuchets. Krak de Chevaliers had space for large rooms and cisterns with stone vaults. In these rooms and cisterns, the Crusaders could keep enough food and water to eat and drink for many years. The military design meant that the castle was nearly safe from attack. The stores of supplies meant that people in the castle would be safe from a siege. The design of Krak de Chevaliers is one of the best examples of a \"concentric castle\", along with the castles built by Edward I of England. The Mamluk leader Baibars attacked Krak de Chevaliers in 1271. His army attacked with trebuchets and catapults. Baibars's army got inside the first wall, but they could not take control of the centre of the castle. Baibars wrote a false letter, which he sent to the Crusaders in the castle. They believed the letter had come from an ally of theirs. The letter said that the Crusaders should surrender. They did surrender, and the Mamluk army of Baibars took control of the castle. After this the Mamluks worked on the castle's buildings. Their builders repaired the buildings and fortifications, and they built a large new tower. The new tower was complete in 1285. (Baibars destroyed many other castles that he took from the Crusaders, but not Krak de Chevaliers.) Unlike many Crusader castles, Krak de Chevaliers continued to be a military position and a centre of government in its area. The castle started to be a town of its own. The frescos in the chapel were whitewashed. == References == Category:Castles in Asia Category:Syria Category:12th-century buildings and structures",
 "title": "Krak de Chevaliers"
}