{
 "id": "832180",
 "text": "Racism in the United States traces negative attitudes and views on ethnicity and race. A number of Americans said in 2019 Donald Trump, then-President, had made racial relationships worse. African Americans, Asian Americans, Hispanics, Latinos and Native Americans in the United States have said that they are victims of racism and racial profiling while in college, at work or on streets. In 2020 and 2021, protests erupted across the United States. Puerto Rican, Central Americans and Mexicans went across the border, including unaccompanied children and minors. African American and Asian Americans were attacked. As of July 2016, European Americans are the largest number of people. Hispanics and Latino are the largest minority population. Many African Americans live either in the Southern United States, the Midwestern United States or Western United States. == Citizenship and immigration == The Naturalization Act of 1790 set the first uniform rules for the granting of United States citizenship by naturalization, which limited naturalization to \"free white person[s],” thus, excluding Native Americans, indentured servants, slaves, free Blacks and later, Asians from citizenship. Citizenship status determined one's eligibility for many legal and political rights, including suffrage rights at both the federal and state level, the right to hold certain government offices, the right to serve jury duty, and the right to serve in the United States Armed Forces. The second Militia Act of 1792 also provided for the conscription of every \"free able-bodied white male citizen\".second Militia Act of 1792 Tennessee's 1834 Constitution included a provision: \"the free white men of this State have a right to Keep and bear arms for their common defense.\" The Treaty of Dancing Rabbit Creek, made under the Indian Removal Act of 1830, allowed Choctaw Indians who chose to remain in Mississippi to gain recognition as U.S. citizens. They were the first non- European ethnic group to become entitled to U.S. citizenship. The Naturalization Act of 1870 extended naturalization to Black persons, but not to other non-white persons and revoked the citizenship of naturalized Chinese Americans. The law relied on coded language to exclude \"aliens ineligible for citizenship,” which primarily applied to Chinese and Japanese immigrants. Native Americans were granted citizenship in a piece-meal manner until the Indian Citizenship Act of 1924, which unilaterally bestowed blanket citizenship status on them, whether they belonged to a federally recognized Tribe or not. However, by that date, two-thirds of Native Americans had already become U.S. citizens through various means. The Act was not retroactive, so, citizenship was not extended to Native Americans who were born before the effective date of the 1924 Act, nor was it extended to Indigenous persons who were born outside the United States. Further changes to racial eligibility for citizenship by naturalization were made after 1940, when eligibility was extended to \"descendants of races indigenous to the Western Hemisphere,\" \"Filipino persons or persons of Filipino descent,\" \"Chinese persons or persons of Chinese descent,\" and \"persons of races indigenous to India.\" The Immigration and Nationality Act of 1952 now prohibits racial and gender discrimination in naturalization. During the period when only \"white\" people could be naturalized, many court decisions were required to define which ethnic groups were included in this term. These are known as the \"racial prerequisite cases,” and they also informed subsequent legislation. == Housing and land == A 2014 meta-analysis found extensive evidence of racial discrimination in the American housing market. Minority applicants for housing needed to make many more inquiries to view properties. Geographical steering of African Americans in US housing remains significant. A 2003 study found \"evidence that agents interpret an initial housing request as an indication of a customer's preferences, but also are more likely to withhold a house from all customers when it is in an integrated suburban neighborhood (redlining). Moreover, agents' marketing efforts increase with asking price for white, but not for black, customers; blacks are more likely than whites to see houses in suburban, integrated areas (steering); and the houses agents show are more likely to deviate from the initial request when the customer is black than when the customer is white. These three findings are consistent with the possibility that agents act upon the belief that some types of transactions are relatively unlikely for black customers (statistical discrimination).\" Historically, there was extensive and long-lasting racial discrimination against African Americans in the housing and mortgage markets in the United States, as well as discrimination against Black farmers whose numbers massively declined in post-WWII America due to anti-Black local and federal policies. According to a 2019 analysis by University of Pittsburgh economists, Blacks faced a two-fold penalty due to the racially segregated housing market: rental prices increased in blocks when they underwent racial transition whereas home values declined in neighborhoods that Blacks moved into. ==References== Category:Racism Category:Controversies in the United States",
 "title": "Racism in the United States"
}