{
 "id": "832320",
 "text": "Christopher Mason Savino (born October 2, 1971) is an American cartoonist, animator, director, writer, storyboard artist, comic book artist and producer. He is well-known as the creator of the animated series The Loud House. Savino has also worked on The Ren & Stimpy Show, Dexter's Laboratory, The Powerpuff Girls, Kick Buttowski: Suburban Daredevil, My Little Pony: Friendship Is Magic, and Mickey Mouse. ==Filmography== ===Television=== Year Title Director Producer Writer Animator Notes 1991–1996 The Ren & Stimpy Show layout artist 1991–1994 Garfield and Friends layout artist 1993–1996 Rocko's Modern Life storyboard clean-up/prop designer/character designer 1995 The Baby Huey Show layout artist/character prop designer (Season 2) 1995 Hate layout artist 1996 The Mouse and the Monster character designer 1996–1997 Hey Arnold! storyboard director/prop designer/character designer 1997–2001 The Angry Beavers character designer 5 episodes only 1997 Space Goofs storyboard artist Episode: \"Time for a Change\" Duckman storyboard artist 1997–2003 Dexter's Laboratory storyboard artist/animation director 1998 Cow and Chicken storyboard artist Episode: \"Cow Fly\" I Am Weasel storyboard artist Episodes: \"I.R. in Wrong Cartoon\" and \"Unsinkable I.R.\" 1998–2005 The Powerpuff Girls storyboard artist 2000 The Cartoon Cartoon Show creator/model designer/animation layout \"Foe Paws\" animation layout \"Jeffrey Cat: Claw and Odor\" 2002–2003 Samurai Jack 2002 Whatever Happened to... Robot Jones? Character and Prop models 2003 The Grim Adventures of Billy & Mandy writer/storyboard artist Episode: \"To Eris Human\" 2004–2007 Foster's Home for Imaginary Friends animation director 2005–2006 Johnny Test storyboard artist; season 1 2005–2008 My Life as a Teenage Robot 2007–2008 My Gym Partner's a Monkey storyboard artist/sheet timer 2008 Ni Hao, Kai-Lan storyboard artist 2010–2012 Kick Buttowski: Suburban Daredevil executive producer 2010–2011 My Little Pony: Friendship Is Magic writer Episodes: \"Boast Busters\" and \"Stare Master\" 2013 Mickey Mouse storyboard artist Episode: \"Bad Ear Day\" 2015 Get Blake! writer Episodes: \"Get Snatched\" and \"Get Western\" 2016–2018 The Loud House creator/executive producer/storyboard artist 2016 All In with Cam Newton Himself Episode: \"All In with Josh\" TBA Busted Bible Stories Yes Yes Yes Yes creator/executive producer/storyboard artist === Unproduced Screenplays === Adventures In Milk (2008) film - Chris Savino wanted to make a live-action hybrid cartoon movie involving a kid that was obsessed with sugared cereal and the cartoons from the cereal box have to save him. But the idea of the movie was scrapped based on change in direction at Cartoon Network. ===Film=== Year Title Director Producer Writer Animator Notes 1999 Dexter's Laboratory: Ego Trip storyboard artist 2001 The Flintstones: On the Rocks storyboard artist/art director ===Other works === Year Title Director Producer Writer Notes 2013-2015 Nutri Ventures: The Series Creative Consultant English version ===Internet=== Year Title Role Notes 2007 HI HUN, I'M HOME Creator/Writer/Artist comic strip 2015 The Complex Adventures of Eddie Puss Creator/Writer/Artist comic strip 2016 Cartoons VS Cancer Episode 9: \"The One with Chris Savino\" Podcast 2016–2017 Nickelodeon Animation Podcast Episodes (2 & 40): \"Chris Savino\", \"Inside the Loud House Writers' Room\" Podcast 2019 Coal: a Cautionary Christmas Tale Writer/Author Book 2019 Peter Power and His Amazing Super-Mega Giant Fighting Robot Save the Day! Writer/Author Book 2019 Bigfoot and Gray on the Run Creator/Writer/Artist comic book 2020 Writing Cartoons in 4 Acts or: How I Learned to Stop Worrying and Love the Midpoint Writer/Author Guide Book 2020-2021 For Brothers Creator/Writer/Artist comic strip 2024- The Meeces Creator/Writer/Artist comic strip ==References== Category:1971 births Category:Living people Category:American cartoonists Category:American television producers Category:American television directors Category:American television writers Category:American Christians Category:People from Royal Oak, Michigan Category:Screenwriters from Michigan",
 "title": "Chris Savino"
}