{
 "id": "832454",
 "text": "User experience design (UXD, UED, or XD) is the activity to support user behavior through usability, usefulness, and desirability by the interaction with a product. Experience design (XD) is the practice of designing products, processes, services, events, etc. with a focus on the quality of the user experience and relevant solutions. Its main purpose is to develop the experience of a product, service, or event by several dimensions: * Duration * Intensity * Breadth * Interaction (passive ↔ active ↔ interactive) * Triggers * Significance == Stages == === Research === Research is the first and most important element. It helps to understand the user, identify the application's purpose, and recognize target audience's needs, goals, and mental models. === Visual design === Visual design (graphic design, user interface design) shows the aesthetics or general look of any user interface. The purpose is to make a message to its audience using colors, images, and symbols. === Information architecture === Information architecture is the science of structuring and organizing the information in products and services to support usability and findability. It includes information about objects, metadata, page structure and navigation. === Interaction design === It is a kind of interaction between users and products. Nowadays interaction designers are involved in creating contextual interfaces. === Usability === It shows how the product can be used by some users with effectiveness and satisfaction in a specified context of use. === Accessibility === Accessibility of a system shows if it is easy and clear to use and understand it, often it refers to the ease of use for people with disabilities and is connected with usability. According to the Web Content Accessibility Guidelines (WCAG), all content must follow the four main principles of POUR: Perceivable, Operable, Understandable, and Robust. === Human–computer interaction === Human–computer interaction mostly refers to the design, evaluation, and implementation of interactive computing systems for people's use. It is a 3-in-1 process that combines research and getting ready to design, design and testing. === Related Design Concepts === User Experience Design is not a standalone concept - it entails its relation with other design concepts such as UI, CX & SD. User Interface (UI) Design covers the design aspects of an interface like the colours, buttons, typography, spacing, images, and more. They bring aesthetic value to a digital product and must be reflective of the brand. Imagine the HSBC logo in a handwriting font. Customer Experience (CX) Design is the sum of what a customer thinks, feels, sees, hears, and does regarding your brand. From the first touchpoint of scrolling on your brand’s ad on social media to being a loyal customer. Tailored CX Design will ensure that your brand is customer-oriented, elevating the experience. Duolingo is a great example. Service Design (SD) is the backstage of every product/service. The synergic collaboration between the brand, the employees and the customers focuses on the 3P’s of Services – People, Physical Evidence and Processes. SD arranges the policies, technology, systems and infrastructure to present the front stage to the audience, i.e., products, interfaces, and touchpoints. == References == Category:Design Category:Web design",
 "title": "User experience design"
}