{
 "id": "832502",
 "text": "The Game Wave Family Entertainment System, often known as Game Wave, is a DVD player and home video game console in one made by ZAPiT Games. It first came out in Canada in October 2005. It is part of the seventh generation of video game consoles. It came out in the United States, costing $99. It was so cheap to make because it was an low-cost DVD player with an Altera MAX II Complex Programmable Logic Device added. It first came with 4 Degrees: The Arc of Trivia, Vol. 1, then later came with Veggie Tales: Veg-Out! Family Tournament. == Console == The Game Wave came with RCA and S-Video cables, and 4 IR-based wireless controllers that look like DVD remotes and a case that holds up to 6 of them. The case and console can sit together on a shelf to form a complete wave shape. === Controllers === The Game Wave controller has 4 direction buttons and an OK button used to navigate menus and control how DVDs play. The controller has 4 buttons with letters of the alphabet near the top, \"A\", \"B\", \"C\", and \"D\", mostly designed to make choices in trivia games. A set of number buttons with Menu and Setup buttons are below the direction buttons. The controllers came in 6 colors: blue, yellow, green, red, purple, and orange. The blue, yellow, green, and red ones come with the console, and the purple and orange ones could be bought separately for $30. Each controller color's infrared flashes at different speeds, allowing the console to support up to 6 controllers at the same time. == Games == Because of the shape of the controller and the company wanted the Game Wave to only be a \"Family Entertainment System,\" none of the console's 13 games are action games. Most games are trivia and puzzle games. Most games are like TV shows and other video games. Title Released Genre Inspired by 4 Degrees: The Arc of Trivia, Bible Edition Trivia Trivial Pursuit 4 Degrees: The Arc of Trivia, Vol. 1 Trivia Trivial Pursuit 4 Degrees: The Arc of Trivia, Vol. 2 Trivia Trivial Pursuit Click! Word Wheel of Fortune Gemz Puzzle Bejeweled Letter Zap! Word Boggle Lock 5 Strategy Yahtzee Rewind Trivia N/A Rewind 2005 Trivia N/A Rewind 2006 Trivia N/A Sudoku Puzzle Sudoku Veggie Tales: Veg-Out! Family Tournament Minigame collection Mario Party Zap 21 Card Blackjack ==References== * Game Wave DVD system lets families play together * Game Wave: New Approach to DVD Games * Game Wave - Video Game Review ==Other websites== * * Technical History of the Game Wave * Feature titled \"SYSTEMS THAT COULDN'T EVEN RELEASE 15 GAMES BEFORE THEY BIT THE DUST\" by KELLEN PERRY at SVG.com Category:Video game consoles Category:DVD",
 "title": "Game Wave Family Entertainment System"
}