{
 "id": "832676",
 "text": "use both this parameter and |birth_date to display the person's date of birth, date of death, and age at death) --> | death_place = | death_cause = | body_discovered = | resting_place = | resting_place_coordinates = | burial_place = | burial_coordinates = | monuments = | nationality = | other_names = | siglum = | citizenship = Belarus | education = | alma_mater = | occupation = journalist, political prisoner | years_active = | era = | employer = Belsat | organization = | agent = | known_for = broadcasting from \"\" | notable_works = | style = | home_town = | net_worth = | height = | television = | title = | term = | predecessor = | successor = | party = | movement = | opponents = | boards = | criminal_charges = actions that attack public order | criminal_penalty = 2 years in prison | criminal_status = | spouse = Igar Ilyash (married 2016–present) | partner = | children = | parents = | mother = | father = | relatives = | family = | callsign = | awards = Journalist of the Year (2020) Award named after Dariusz Fikus (2021) \"Honor of Journalism\" (2021) Axel-Springer-Preis (2021) Courage in Journalism Award (2021) Preis für die Freiheit und Zukunft der Medien (2021) (2021) (2021) | website = | module = | module2 = | module3 = | module4 = | module5 = | module6 = | signature = | signature_size = | signature_alt = | footnotes = }} Katsyaryna Andreeva (Belarusian: Кацярына Андрэева; Russian: Катерина Андреева (); real name: Katsyaryna Andreevna Bakhvalava; Belarusian: Кацярына Андрэеўна Бахвалава) (born on November 2, 1993, in Minsk, Belarus) is a journalist from Belarus. She worked for the television channel Belsat TV. She showed the event at the place where Raman Bandarenka was beaten to death in 2020. She was arrested there on November 15, 2020, in Minsk. == Early life, education and career == She was born in Minsk. Her family had journalists before. She learned for about two and a half years in Minsk State Linguistic University, then she moved to Spain. She taught English there for two years. Then she came back home, got to work for the newspaper Nasha Niva as a journalist. In 2017, she moved to the TV channel Belsat. Katsyaryna Andreeva with Igar Ilyash wrote the book «Belarusian Donbas» in 2020. The book let people know how the Belarusian side takes part in the War in Donbas for the separatists side. The Belarusian government considered the book to be very bad. In 2021, via court decision, it made the book illegal in Belarus for extremism. Katsyaryna was first arrested in 2017 in Orsha. On September 12, 2020, she was arrested by special police for a live broadcast of a women's protest in Minsk and was locked up for three days. === Criminal procedure === Together with journalist Darya Chultsova, she became a person in a criminal case on organizing actions that attack public order. Both showed the event of a cruel attack of the police at the place where Raman Bandarenka was beaten to death and the people stood to support the dead one live. That took place at the \"\" (\"Ploscha Peramen\") in Minsk on November 15, 2020. She was not freed after the arrest there. Katsyaryna was moved to a prison in Zhodzina, where she was held until her court trial. On November 24, 2020, ten organizations (the Viasna Human Rights Centre, the Belarusian Association of Journalists, the Belarusian Helsinki Committee and others) made a joint statement. It said that she is a political prisoner. At a Minsk court meeting led by the judge Natalia Buguk on February 18, 2021, Andreeva und Chultsova were sentenced to serve two years in prison for pushing 2020 Belarusian protests. The state prosecutor was Alina Kasyanchyk, the detective was Ihar Kurylovich.COUNCIL IMPLEMENTING REGULATION (EU) 2021/997 - , 21.06.2021 On April 23, 2021, Minsk City Court said no to a request to call off or change the sentence. On July 13, 2022, Andreyeva was additionally sentenced to 8 years in prison on charges of state treason. == Reaction == On February 8, 2021, the US Embassy in Belarus made a statement. It asked to make Chultsova and Andreeva free. On February 4, 2021, support for the political prisoner was undertaken by Delara Burkhardt, a Member of the European Parliament. Following the sentencing, on February 18, 2021, President of Poland Andrzej Duda made a public call to make Chultsova and Andreeva free. On June 21, 2021, the Council of the European Union made a decision to put those responsible for the punishment of the journalists in the . Judge Natalia Buguk was put in the EU blacklist for frequent decisions against journalists and protesters in connection to politics. One example of such verdicts was named. It was the guilty verdict against Katsyaryna Bahvalava (Andreeva) and Darya Chultsova. Prosecutor number two Alina Kasyanchyk was put in the list for the prosecution of the journalists. She was held responsible for indictment of both journalists for \"making electronic motion pictures of quiet protests that were named 'conspiracy' and 'violation of public order'\" without cause. Detective Ihar Kurylovich was put in the list for the preparation of the criminal case against the journalists. He had made the criminal case ready in connection to politics. == Awards == * Together with Darya Chultsova and Katsyaryna Barysevich, on December 10, 2020, she was named Journalist of the Year (2020). * Together with Darya Chultsova on March 10, 2021, she got the Award named after Dariusz Fikus by the Press Club Polska (Polish organization of journalists). * Together with Darya Chultsova and Katsyaryna Barysevich, on April 9, 2021, she got the Ales Lipay (the person who made BelaPAN) Prize \"Honor of Journalism.\" * Together with Darya Chultsova on June 7, 2021, she got the Axel-Springer-Preis (a German award for young journalists). * Together with Darya Chultsova on June 10, 2021, she got the Courage in Journalism Award. * Together with Darya Chultsova on July 29, 2021, she was named the owner of the Preis für die Freiheit und Zukunft der Medien (a German award in the field of freedom of the press). * Together with Darya Chultsova, Katsyaryna Barysevich, and others, on August 12, 2021, she got the . * Together with Darya Chultsova on October 15, 2021, she got the as the \"European Journalist of 2021.\" == Thoughts == «[They are] strong in spirit, have no doubt in the right [of them], supported by friends, colleagues and the people that they do not know at all – such Katya and Dasha will be put in books,\" Aksana Kolb, editor-in-chief of Novy Chas, wrote two or three days before their sentencing. == Personal life == She got married with journalist Igar Ilyash in 2016. == Books == * «Belarusian Donbas» (together with Igar Ilyash) (2020) == References == == Other websites == * Katsyaryna Andreeva's page on the website of the Viasna Human Rights Centre Category:1993 births Category:Belarusian writers Category:Belarusian journalists Category:Living people Category:Political prisoners according to Viasna Human Rights Centre Category:Free Media Award winners",
 "title": "Katsyaryna Andreeva"
}