{
 "id": "832935",
 "text": "The culture of Meitei civilization evolved over thousands of years, beginning in Ancient Manipur, continuing most notably into Medieval Manipur, while influencing the neighboring states and kingdoms. ==Arts== ===Architecture=== The architectural works of the Meitei ethnicity is best known through its Meitei temples as well as ancient buildings including palaces, court halls, offices, entrance gates and so on. ==Literature== Meitei literature dates back right from the 15th century BC, during the era of Tangcha Lee La Pakhangpa (Tangja Leela Pakhangba) (1445 BC-1405 BC) in Ancient Manipur. The Puya (Meitei texts) account for most of the accounts for the literary works till Medieval Manipur. Some of the most prominent Puyas, written in Meitei language (Manipuri language), are given below in alphabetical order: * Chada Laihui * Chainarol * Chothe Thangwai Pakhangba * Hijan Hirao (Hichan Hilao) * Khongjomnubi Nongarol * Khuman Kangleirol * Khumanlon * Konthoujam Nongarol * Leishemlon * Leithak Leikharol * Moirang Ningthourol Lambuba * Ningthourol Lambuba * Nongban Pombi Luwaoba * Numit Kappa * Panthoibi Khongul * Phouoibi Waron * Poireiton Khunthok * Sakok Lamlen * Sanamahi Laihui * Tharon (Thalon) * Toreirol Lambuba * Tutenglon * Wakoklon Heelel Thilen Salai Amailon Pukok Puya ==Public holidays and festivals== Important days fall in different times of a year according to Meitei calendar. Some are as follows in alphabetical order: * Cheiraoba 1st of Sajibu month * Emoinu Eratpa 12th of Wakching month * Heikru Hidongba 11th of Langban month * Kwaak Taanba 10th of Mera month * Mera Chaorel Houba 1st of Mera month * Mera Hou Chongba 15th of Mera month * Ningol Chakouba 2nd of Hiyangei month * Panthoibi Iratpa * Sanamahi Ahong Khong Chingba * Yaoshang 15th of Lamtaa month, Full moon ==Religion== Sanamahism, the Meitei religion, has thousands of Meitei deities.The List of figures in Meitei mythology accounts for the characters in Meitei mythology, the receptacle of the Meitei religion. ===Lai Haraoba=== The \"Lai Haraoba\" festival is an ancient ritualistic music and dance festival, often performed in order to please the Umang Lais and the Lam Lais, whose pantheons are found scattered in the plains of Manipur still today. Jagoi, originally spelled as Chatkoi, is the traditional form of dancing, performed by the devotees to please the deities. Here is a list of the \"Chatkoi\"s (\"Jagoi\"s) : C * Chukpharon Jagoi K * Khamba Thoibi Jagoi L * Laiching Jagoi * Laihou Jagoi * Leima Jagoi * Leisem Jagoi M * Maibi Jagoi P * Panthoibi Jagoi T * Thougal Jagoi === Death ceremony === The Meitei people perform four types of death ceremony since time immemorial. These are: # Air ceremony (Disposal to the space) # Earth ceremony (Burial) # Fire ceremony (Burning) # Water ceremony (Disposal to the water bodies) ==Sports== Manipur, the Meitei kingdom, has risen to prominence in a number of sporting areas since ancient times till today. Polo, the equine sports played all over the world, is developed from Sagol Kangjei, the primitive form of the game. Ancient Manipur is the native birth place of the modern polo.https://www.sportstract.com/guinness-book-of- world-records-1991-says-polo-can-be-traced-to-origins-in-manipur- state-c-3100-b-c-when-it-was-played-as-sagol-kangjei/amp/ ==References==",
 "title": "Meitei culture"
}