{
 "id": "832926",
 "text": "Covfefe is a word presumably misspelled by then-President of the US Donald Trump in a viral internet meme. It was sent in a tweet 9.06 PM - 30 May 2017 that said \"Despite the constant negative press covfefe.\" It was widely suggested by the media that Donald Trump meant to write \"coverage.\" However, White House Press Secretary Sean Spicer said that it was not a misspelling, with him saying \"I think the president and a small group of people know exactly what he meant.\" ==Influence== The tweet would remain used in internet culture and by the media for much time afterwards. When writing for The Atlantic, journalist Adrienne LaFrance said that \"Covfefe remains the tweet that best illustrates Trump's most preternatural gift: He knows how to captivate people, how to command, and divert the attention of the masses.\" This media story suggested that Donald Trump was very good at getting attention and fascinate people. ===In language=== The Urban Dictionary would soon add a page on \"covfefe\", with the page saying that: \"It literally means covfefe.\" Dictionary.com would also say that \"covfefe\" was at the top of their list of 'unmatched queries' in October 2017 and would continue to have the largest amount of user searches for words without a page. ===In law=== U.S. Representative Mike Quigley started H.R.2884, \"The Communications Over Various Feeds Electronically for Engagement Act (COVFEFE Act)\" on June 12, 2017. The act suggested that national archives should need to store social media posts by the President of the United States. The bill went to the House Committee on Oversight and Government Reform on the same day but saw no further congressional action.H.R.2884 – COVFEFE Act of 2017, Actions Overview, Congress.gov. Accessed April 3, 2021. Despite this, Donald Trump's tweets and other posts were stored as said in the Presidential and Federal Records Act Amendments of 2014. ==References== Category:2017 Category:Internet memes Category:Donald Trump",
 "title": "Covfefe"
}