{
 "id": "833079",
 "text": "Donald Davidson was an American philosopher. He taught philosophy during several years at the American universities. ==Education== Davidson majored in English and comparative literature on William Shakespeare at Harvard University and switched it to philosophy. ==career== He taught Philosophy at the University of California, Berkeley and also held teaching appointments several other universities such as Stanford University, Rockefeller University, Princeton University, and the University of Chicago. ==Works== Here is the list of some of his works in philosophy: * \"Truth and Meaning,\" Synthese, 17, 1967. (Reprinted in Davidson, 2001b.) * \"Mental Events,\" in Experience and Theory, Foster and Swanson (eds.). London: Duckworth. 1970. (Reprinted in Davidson, 2001a). * \"Agency,\" in Agent, Action, and Reason, Binkley, Bronaugh, and Marras (eds.), Toronto: University of Toronto Press. 1971. (Reprinted in Davidson, 2001a.) * Essays on Actions and Events, 2nd ed. Oxford: Oxford University Press. 2001a. * Inquiries into Truth and Interpretation, 2nd ed. Oxford: Oxford University Press. 2001b. * Problems of Rationality, Oxford: Oxford University Press. 2004. * Truth, Language, and History: Philosophical Essays, Oxford: Oxford University Press. 2005. * Truth and Predication. Cambridge, Mass.: Harvard University Press, 2005. ==Notes== ==References== * Lepore, Ernest and Kirk Ludwig. Donald Davidson: Meaning, Truth, Language and Reality. Oxford: Oxford University Press. 2005. * Ludwig, Kirk (ed.). Donald Davidson. Cambridge: Cambridge University Press. 2003. * Mou, Bo (ed.). Davidson's Philosophy and Chinese Philosophy: Constructive Engagement. Leiden & Boston: Brill. 2006. * Kotatko, Petr, Peter Pagin and Gabriel Segal (eds.). Interpreting Davidson. Stanford: CSLI Publications. 2001. * Evnine, Simon. Donald Davidson. Stanford: Stanford University Press. 1991. ==Other websites== * \"Donald Davidson\" – by Jeff Malpas, Stanford Encyclopedia of Philosophy, 2005. * \"Donald Davidson (1917–2003)\" by Vladimir Kalugin, Internet Encyclopedia of Philosophy, 2006. * Donald Davidson on the academic senate website Category:1917 births Category:2003 deaths Category:American philosophers Category:Analytic philosophers Category:University of California, Berkeley faculty",
 "title": "Donald Davidson"
}