{
 "id": "833066",
 "text": "Sir Michael Anthony Eardley Dummett (1925–2011) was an English academic. He was \"among the most significant British philosophers of the last century and a leading campaigner for racial tolerance and equality\". Dummett was, until 1992, Wykeham Professor of Logic at the University of Oxford. He wrote on the history of analytic philosophy, and made original contributions in the philosophies of mathematics, logic, language and metaphysics. He was known for his work on truth and meaning. In mathematical logic, he developed an intermediate logic, already studied by Kurt Gödel: the Gödel–Dummett logic. ==Education== Dummett graduated in Politics, Philosophy and Economics from Oxford University. ==Career== Dummett was a Professor of Logic at Oxford. He taught philosophy at several other universities, such as Birmingham University, UC Berkeley, Stanford University, Princeton University, and Harvard University. He was elected a member of the Academia Europaea in 1990. ==Works== Here are some of his works in philosophy: **Thought and Reality (Oxford, 2006) **The Nature and Future of Philosophy (Columbia, 2010) **Voting Procedures (Oxford, 1984) **Principles of Electoral Reform (New York, 1997) ==Awards== He won the Rolf Schock prize in 1995.philosophy.su.se. He also won the Lauener Prize in Analytical Philosophy in 2010.Lauener Prize for an Outstanding Oeuvre in Analytical Philosophy ==Notes== ==References== *https://www.independent.co.uk/news/obituaries/professor-sir-michael-dummett- philosopher-and-anti-racism-campaigner-6293563.html *https://www.springer.com/gp/book/9780792328049 *R. E. Auxier and L. E. Hahn (eds.) The Philosophy of Michael Dummett, The Library of Living Philosophers, vol XXXI Open Court, Chicago, 2007 ==Other websites== * https://www.theguardian.com/world/2011/dec/28/sir-michael-dummett * https://www.telegraph.co.uk/news/obituaries/culture- obituaries/8981654/Professor-Sir-Michael-Dummett.html Category:1925 births Category:2011 deaths Category:British philosophers Category:Analytic philosophers Category:Members of Academia Europaea",
 "title": "Michael Dummett"
}