{
 "id": "833052",
 "text": "World religions is a category used in the study of religion for the largest and most widespread religious movements. Christianity, Islam, Judaism, Hinduism, and Buddhism are always included in the list; they are known as the \"Big Five\". Some scholars also include other religions, such as Sikhism, Zoroastrianism, or the Bahá'í Faith. The term world religions is used to compare them with other groups, such as indigenous religions and new religious movements. The term was first used in the 1960s. Scholars such as Ninian Smart first used it, because he wanted to get away from looking at religions form a focus of Christianity. Smart also wanted to take other religious traditions into account. The concept of \"world religion\" has also been criticized: Scholars such as Jonathan Z. Smith have said that it should be abandoned. They say, the concept is bad because it takes the Protestant view as the model of what is a religion. Protestantism is a movement that developed recently. According to the scholars, it takes an uncritical standpoint, and it dictates what religions should be called \"major\". Other people have argued that the concept is useful, as long as people are aware of its shortcomings. == Definition == The scholars of religion Christopher R. Cotter and David G. Robertson described the \"World Religions Paradigm\" as a way of thinking about religions which organizes them into a set of discrete traditions with a supposedly 'global' importance. It typically consists of the \"Big Five\" religions: Christianity, Judaism, Islam, Hinduism, and Buddhism. As noted by Cotter and Robertson, the \"Big Five\" religions are often listed in an order which places the largest three Abrahamic religions—Christianity, Judaism, and Islam—before the non-Abrahamic religions Hinduism and Buddhism. The category is sometimes also extended to include other religious groups, such as Sikhism, Zoroastrianism, and the Baháʼí Faith. Including Judaism in the Big Five is problematic: Because it influenced Christianity and Islam it is often included. It is also historically important. Looking at the number of its followers, however, it does not fit in the list: There are far fewer Jews than there are Christians, Muslims, Hindus, and Buddhists. It does also not fit the list, because the other groups want to spread their religion; Judaism doesn't. Many scholars have used the \"World Religions\" category alongside other \"catch- all\" categories such as \"new religious movements\" and \"indigenous religions\". The scholar of religion Steven J. Sutcliffe compared the relationship between the three categories to the English football league system, with the \"world\" religions forming a Premier League, the \"new\" religions forming a Championship, and \"indigenous\" religions a First Division. That groups that get placed in categories like \"indigenous religions\" get treated less seriously than the \"world religions\" by many scholars was noted by the scholar of religion Graham Harvey. Harway said that \"indigenous religions should receive similarly respectful treatment to that considered appropriate to the larger 'World Religions'.\" == References == ===Bibliography=== * * * * * * * * * * * == Other websites == * James Cox on \"The World Religions Paradigm\" at The Religious Studies Project * \"After the World Religions Paradigm...?\" at The Religious Studies Project Category:Religions",
 "title": "World religions"
}