{
 "id": "833067",
 "text": "Poly-Play is an East German arcade machine by VEB Polytechnik that came out in 1985. It is the only arcade machine from East Germany. It contains multiple games. One of them is a Pac-Man clone. About 2,000 machines were made. == Hardware == * CPU: U880 (Z80 clone) 2.457600 MHz CPU * Sound chip: Custom * Graphics: 512x256 pixels at 10 colours running at 50 Hz (coloured overlays can also be used) The machine's coin slot works by detecting pressure. It uses 50 Pfennig, but can be tricked by pressing a 1 Pfennig coin the correct way into the top of the slot. This was mostly allowed because the government owned the machines, which were mostly found in FDGB holiday homes, youth hostels and non-profit clubs. The machine could be played for free at many youth clubs until large crowds often came around them. A machine was shown in the Museum of Computing in Swindon, England in 2004 before being shown as part of the touring video game show Game On from 2005 in multiple museums, such as the Museum of Science and Industry in Chicago and the Science Museum in London. Two machines are at RetroGames e.V. in Germany,Poly Play VEB Polytechnik – 1986 - RetroGames e.V. (last access 2011-01-20) and another at the Computerspielemuseum Berlin. ==Games== Hirschjagd (Deer Hunt) is like Robotron: 2084. Translation from the game: The fleeing deer must be pursued and hunted, but only 10 shots are available. A shot that hits the deer is not deducted. Around every 15 seconds, a shot must be fired or it will be lost. Hase und Wolf (Hare and Wolf) is like Pac-Man. It plays faster and is based on the Russian cartoon series Nu, pogodi!, which was popular in East Germany. Translation from the game: The Hare must eat everything that it can get. It has to avoid the Wolf, who wants to eat it! Scoring: Pea 1 point, carrot 5 points, pear 7 and/or 10 points Abfahrtslauf (Downhill) is a simple sport game in which one must ski between the flags. The gates go from 6 metres wide and half the screen size (very easy) down to 0.2 metres (impossible). The game can play very fast. Schmetterlinge (Butterflies) features Pittiplatsch or Mole, which were popular characters in children's television series in East Germany. However, the game is more suitable for adults. The player must go around the flowers. Schießbude (Shooting Gallery) is like Carnival. Translation from the game: Shoot to score. A balloon gives you one point; a duck, two; and a flower, three. Ammunition can be reloaded by shooting into the left magazine. For each of the three rows there is, in the top right, a multiplier field to hit (coloured yellow, blue and pink). The longer one plays, the greater the number of ducks to emerge; ducks in the lowest row can steal one's ammunition if not dealt with quickly.22 Autorennen (Motor Race) is a racing game. The player's red car must win 2 out of 4 rounds. It is not very hard because of the good starting position and it is easier to pass the first curve than it is for the other racers. Merkspiel (Memory Game) is a memory game. The goal is to remember all pictures and reveal them under a time limit. Each picture also has its own sound, which plays if the wrong one is chosen. Wasserrohrbruch (Water Pipe Burst) is the last game. The player must stop a room from flooding. Translation from the game: In the room above, a water pipe bursts. By catching drops with the bucket, you can prevent the water level from rising. The bucket can be emptied out of the cellar windows (play button). If the bucket is full, one does not obtain any points. Scoring: Water level too high: -1 game; Caught drop: +5 points; Bucket emptied into the cellar: -x and Bucket emptied out of the window: +3x (where x = amount of drops caught); with good play: +1 game (max. 3). All games have been able to be played in MAME since 2000. The names of four more games are in the source code: Der Gärtner (The Gardener), Im Gewächshaus (In the Greenhouse), Hagelnde Wolken (Hailing Clouds, a Space Invaders clone) and Der Taucher (The Diver, a game where malicious fish attack a diver). As well as those four games, 'Im Irrgarten (In the Maze), Der Lindwurm (The Lindworm), Fly and AFU are on at least some machines. Another game, UFO, is the original version of Hagelnde Wolken, but was edited because the authorities did not like its fighting themes. == Further reading == * Mit Pittiplatsch auf Pixelfang In: Süddeutsche Zeitung, 1 October 2007 == Related pages == *BSS 01, the only video game console that was released in East Germany. *Polybius, a fictional arcade game with a similar name. == References == == Other websites == * Andy's Arcade page with many internal views of the surviving cabinets * RetroGames e.V. (in German) - German museum with two working Poly-Play machines * Poly Play at the Killer List of Videogames * BBC article about Poly Play * www.polyplay.de (in German, all about Poly-Play and the Poly-Play games can be played) * Poly Play at robotrontechnik.de (in German, with images of all 17 known games) Category:1985 video games Category:Arcade games Category:Single-player video games Category:Video games about food and drink",
 "title": "Poly-Play"
}