{
 "id": "833168",
 "text": "This article collects the national teams world champions FIFA. The two competitions that award said official\"Official (plural officials), from the Latin officiālis.1. The official word is also used to refer to what is recognized or derives from an authority. cfr. 2. Approved by the government or someone in power. cfr. It is synonymous with legal, legitimate, approved. cfr. title was the two Olympic Tournaments of 1924 and 1928 (organised by the IOC together FIFA) and the current FIFA World Cup (from 1930). == History == Uruguay in the international plane has attained two World Cup (the first edition of 1930 and the edition of 1950) and has won two Gold Medals in the Olympic Games (in 1924 and 1928), the two only editions recognised by FIFA like championships of the world (until 2021, when the recognition was placed sub iudice). The decision took in 1924. Although the FIFA does not promote the statistical unification of the tournaments, the legitimacy of the titles also was coming confirmed by the fact that the world-wide federation allowed to the National football team of Uruguay to show 4 stars in the T-shirt (also in the 2018 FIFA World Cup, unlike other teams that are used to plant the stars to evoke continental triumphs, as traditionally they do the African selections). According to the regulation of the FIFA, each star is equivalent to a world- wide conquered. Another confirmation was coming from of a book published by the FIFA and that contains a section that certifies, with vintage official documents, the position of Uruguay like four times \"World Champion of the FIFA\". In 2021, FIFA asked the Uruguayan federation to remove 2 stars from the game uniform. This was confirmed by the director of competitions and member of the Executive Council of the Uruguayan Football Association, Jorge Casales. Casales stated that the AUF will try to appeal the decision, showing that the two championships Olympics of 1924 and 1928, were recognized as world championships. The media wrote that the decision would be made by the FIFA Council as in the case of the Intercontinental Cup. In October, FIFA definitively recognized the world titles in question as official. == List by winners == Team Titles Years Brazil 5 (1958, 1962, 1970, 1994, 2002) Germany 4 (1954, 1974, 1990, 2014) Italia 4 (1934, 1938, 1982, 2006) Uruguay 4 (1924, 1928, 1930, 1950) Argentina 3 (1978, 1986, 2022) France 2 (1998, 2018) England 1 (1966) Spain 1 (2010) * Olympic tournament (official name in English) * Men's Olympic Football Tournament) * Officially recognized by FIFA as the world-wide title. ==Related pages== * List of world champion football clubs ==References== Category:FIFA Category:Football competitions",
 "title": "National teams world champions (football)"
}