{
 "id": "833184",
 "text": "Reptilian or Yonggary 2001 is a 1999/2001 South Korean-American action-horror comedy science fiction adventure monster film directed by Shim Hyung-rae. loosely based on the original character of the same name, in the 1967 film as a self-remake called Reptilian. featuring of the actors including, Harrison Young, Donna Philipson, Richard Livingston, Dan Cashman. this version was distributed by Columbia Tristar Home Video in 2001. ==Plot== In 2000, an giant skeleton fossil unknown creature dinosaur-type called Yongary, an alien resurrected the giant creature by a beam onto the sky and regenerated his body and alive, run through the dig site when Campbell, squashed by Yongary his feet escaped. Yongary smelling Hughes, Holly then surrounded by Apache helicopters to shoot the creature. then Yongary destroys the bridge, goes on a rampage attack Los Angeles. Air Force jets to aim Yongary out the streets. then the US Army to bombing the creature in a city, then teleported away. the Special Forces to gunfight at the creature, escaped. then the soldiers to aiming the diamond to force away by O'Neil hitting himself as a once-self. Immediately the jet fighters to resumed aiming again to the giant buildings, sometimes Yongary grabbing was saving these people. Then activating the Cykor monster launches an fireball down the city. Yongary to brawl Cykor with his body including tentacle-like roots to attack. Then Yongary spitting fireball aiming at Cykor's body to explodes. later day, Yongary tied by helicopters to transport was taken from an deserted island. ==Cast== * Harrison Young as Dr. Wendel Hughes * Donna Phillipson as Holly Davis * Richard B. Livingston as Dr. Campbell * Briant Wells as Parker * Brad Sergi as Bud Black * Wiley Picket as Lt. O'Neil * Dan Cashman as General George Murdock * Dennis Howard as General Jack Thomas * Matt Landers as General Howell * Bruce Cornwell as Stanley Mills * Johanna Parker as Sgt. Romiski * Alex Walters as Sgt. Michaels * Karl Calhoun as Sgt. Andrews * Derrick Costa as Sgt. Archie * Les Brandt as Sgt. Sanchez * Alan Grifka as Sgt. Smitty * Marvin Poole as Pvt. Lewis * Kurt Leitner as Pod Aliens and Yongary, Cykor vocalizations ==Home media== The 2001 version was released on DVD by Columbia Tristar Home Video on August 21, 2001 as Reptilian. then Blu-Ray to remastered the film until 2022. == Other websites == * Category:2000s adventure movies Category:2001 horror movies Category:1990s English-language movies Category:Movies about dinosaurs Category:American monster movies Category:South Korean movies Category:Movies set in Los Angeles Category:Movies directed by Hyung-rae Shim Category:1990s monster movies",
 "title": "Reptilian (1999 movie)"
}