{
 "id": "83323",
 "text": "Shri Neem Karoli Baba or Shri Neeb Karori Baba (नीब करोरी बाबा) (? - September 11, 1973, in Vrindavan, India), also known to followers as Maharaj-ji, was a Hindu guru and who loved the Hindu deity Hanuman. He is known in the West for having been the guru of a number of Americans who traveled to India in the 1960s and 1970s. These students were returned to the West and told other people about Neem Karoli Baba. The most well known of these students are the spiritual teachers Ram Dass and Bhagavan Das, and the musicians Krishna Das and Jai Uttal. ==Sadhu and guru== Not much is known about Neem Karoli Baba's birth and early years. According to one story, he was born Lakshmi Narayan Sharma (in Akbarpur, Faizabad currently Ambedkar Nagar district in the Indian state of Uttar Pradesh. After an arranged marriage at the age of 11, he left his home and traveled a lot in northern India as a holy man (sadhu). During this time he was known by many names including Lakshman Das, Handi Wallah Baba, and Tikonia Walla Baba. When he did spiritual practice at Vavania near Navlakhi Port in Gujarat, he was known as Tallaiya Baba. In Vrindavan, the local people called him Chamatkari Baba which means \"Miracle Baba\".Ram Dass (1995). Miracle of Love: Stories about Neem Karoli Baba. Hanuman Foundation. Many people thought him to be a saint. Neem Karoli was a master of bhakti yoga, and said that service to others (seva) is the best way to show love for God. In a book of stories put together by Ram Dass called Miracle of Love, a student named Anjani shares the following story: ==Notable Disciples== Among the most well known of Maharaj-ji's disciples were Ram Dass, the author of Be Here Now, teacher and performer Bhagavan Das, and the musicians Jai Uttal and Krishna Das. Other notable devotees include humanitarian Larry Brilliant and his wife Girija, as well as Dada Mukerjee (former professor at Allahabad University, Uttar Pradesh, India). After returning to the United States, Ram Dass and Larry Brilliant founded the Seva Foundation, a worldwide development organization which tries to end world poverty by following the teachings of Neem Karoli Baba. Seva is based in Berkeley, California, and Ram Dass served on the board until his death in 2019. ==References== ==Further reading== *Das, Bhagavan (1997). It's Here Now (Are You?) Broadway. *Dass, Ram (1971). Be Here Now. Three Rivers Press. *Dass, Ram (1979). Miracle of Love: Stories about Neem Karoli Baba. Hanuman Foundation. *Mukerjee, Dada (2001). By His Grace: A Devotee's Story. Hanuman Foundation. *Mukerjee, Dada (2001). The Near and the Dear: Stories of Neem Karoli Baba and His Devotees. Hanuman Foundation. *Pande, Ravi Prakash (2003). Divine Reality: Shri Baba Neeb Karori Ji Maharaj. Shri Kainchi Hanuman Mandir Ashram. * Sculpture - The sculpture of Neem Karoli Baba shown above was created by Natalia Rosenfeld, whose work can be seen at www.nataliasculpture.com ==Other websites== *Website on Neem Karoli Baba *Indian Website on Neem Karoli Baba *Janma Sthal of Maharaj-ji *Samadhi Sthal of Maharaj-ji *Temples and Ashrams related to Neem Karoli Baba *Neem Karoli Baba photos *Seva Foundation *Divine Reality by Ravi Prakash Pande, \"Rajida\" Category:Year of birth missing Category:1973 deaths Category:Hindu gurus Category:People from Uttar Pradesh",
 "title": "Neem Karoli Baba"
}