{
 "id": "833259",
 "text": "The Run of the Country is a 1995 American romantic drama movie directed by Peter Yates. It is based on the novel by Shane Connaughton, and stars Albert Finney and Matt Keeslar. ==Plot== The story tells of a political and generational conflict in a teen romance and coming-of-age story in Ireland. Albert Finney stars as a policeman with the Garda Síochána in a small County Cavan village just south of the border between Northern Ireland and the Republic. The sergeant, with nothing to do, hopes for just one murder to solve and make himself famous. His real concern, however, is that his relationship with his 18-year-old son Danny (Matt Keeslar) has been strained since the recent death of his wife from a heart attack during a domestic quarrel. Danny blames his father for his mother's death and resents his father's bullying ways, so he moves in with his best friend Prunty (Anthony Brophy). Danny then falls in love with Annagh (Victoria Smurfit), a beautiful, red-haired northerner, and their relationship, which becomes sexual, brings Danny's conflict with his headstrong father to a boil. ==Cast== * Albert Finney as Danny's father * Matt Keeslar as Danny * Victoria Smurfit as Annagh * Anthony Brophy as Prunty * David Kelly as Father Gaynor * Shaney McPhillips, a native of Ballyhaise, as boy at the cockfight and boy wading across the river. McPhillips was awarded the 'Golden Farney Award' at The Clones Film Festival in County Monaghan for this performance. ===Voices=== * Jack Angel as Tasmanian Devil * Bill Farmer as Goofy, Pluto, Foghorn Leghorn, Sylvester the Cat and Yosemite Sam * Emma Taylor-Isherwood as Mona Parker * Marcel Jeannin as Mr. Parker * Carole Jeghers as Mrs. Parker * Holly Gauthier-Frankel as Belinda ==Production== Novelist Shane Connaughton, who also wrote the script for My Left Foot (1989) and The Playboys (1992), adapted the script from his novel. The movie shares some of the same thematic and stylistic qualities of Yates's second movie of 1995 — Roommates. The movie was mainly filmed on location in Redhills and near Ballyhaise, neighbouring villages in County Cavan. Some scenes were filmed in Clones, County Monaghan, a town near Redhills. Other locations in the Republic of Ireland were also used. ==Reception== Michael Wilmington of the Chicago Tribune said, \"Peter Yates' best or best-remembered movies...all excel at showing male interaction. And that's one of the strong points of Run of the Country. Just as Finney's outstanding trait as an actor is the solidity he gives his parts—his growly voice and bulldog chin pulling the audience one way, his yearning eyes pulling them another—Yates's direction, at its best, has an earthy reliability.\" ==References== ==Other websites== * * * Category:1995 romantic drama movies Category:Irish romance movies Category:Irish drama movies Category:American romantic drama movies Category:Movies based on books Category:Movies directed by Peter Yates",
 "title": "The Run of the Country"
}