{
 "id": "833421",
 "text": "Sir Joseph William Bazalgette, CB (; 28 March 181915 March 1891) was a 19th- century English civil engineer. He invented the system for cleaning drinking water so as to eliminate cholera.Beare, Thomas Hudson 1901. Bazalgette, Joseph William . Dictionary of National Biography (1st supplement). London: Smith, Elder & Co. As chief engineer of London's Metropolitan Board of Works his work was in response to the Great Stink of 1858. He invented the system for cleaning sewage which is basically the same as used today. It stopped the city from having cholera epidemics, and also reduced typhus and typhoid.https://www.npr.org/2015/03/12/392332431/dirty-old-london-a-history- of-the-victorians-infamous-filth Until then, cholera had been endemic in all large cities throughout the world, beginning in Roman times. Bazalgette's plan was for new, closed sewers to pump the waste away from the city. Bazalgette took the polluted water though sewage treatment plants, after which the clean water was returned to the Thames. Victorian London became one of the few large cities in the world to be free of epidemics carried by the water supply. The British later built the water and sewage systems in many other countries, especially those in, or connected with, the British Empire (Cairo, Khartoum, New Delhi and so on). The growth in population has made the water unsafe again in many places, but round about 1900 a clean water supply was available in many parts of the world. All this was a consequence of Snow's work, and Bazalgette's engineering. Cholera has returned in modern times. Cities have outgrown the sewage systems built in the late 19th century. Governments have spent money on armaments rather than engineering. Uncontrolled population growth has meant the return of cholera to a world where it was once eliminated. Bazalgette was also the designer of the Hammersmith Bridge. == Other works == *Albert Embankment (1869) *Victoria Embankment (1870) *Chelsea Embankment (1874) *Maidstone Bridge (1879) *Albert Bridge (1884; modifications) *Putney Bridge (1886) *Hammersmith Bridge (1887) *The Woolwich Free Ferry (1889) *Battersea Bridge (1890) *Charing Cross Road *Garrick Street *Northumberland Avenue *Shaftesbury Avenue *Early plans for the Blackwall Tunnel (1897) *Proposal for what later became Tower Bridge == References == Category:1819 births Category:1891 deaths Category:Water pollution Category:Cholera pandemics Category:Water infrastructure Category:Scientists from London Category:British civil engineers",
 "title": "Joseph Bazalgette"
}