{
 "id": "833505",
 "text": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), the virus that causes coronavirus disease 2019 (COVID-19), has had a lot of changes in its genome. This is known as a variant, and is a result of evolution. Some of them are important because of increased transmission and vaccines being less effective on them. For variants that are new, , the variants of interest reported by the World Health Organization are BA.2.86 and JN.1. The variants under monitoring are JN.1.7, KP.2, KP.3, KP.3.1.1, JN.1.18, and LB.1. This article discusses older, well-known variants of SARS-CoV-2 and mutations in these variants. == Overview == There are a lot of lineages of SARS-CoV-2. Lineages are variants that are genetically the same. *XEC, sampled since June 2024; It is on the list of Variants of interest (according to WHO, as of 2025's second quarter).https://www.who.int/en/activities/tracking-SARS- CoV-2-variants/. Retrieved 2025-05-25 *JN.1, sampled since July 2023; It is on the list of Variants of interest (according to WHO, as of 2024's second quarter).https://www.who.int/en/activities/tracking-SARS-CoV-2-variants/. Retrieved 2024-05-14https://www.bangkokpost.com/learning/easy/2792569/alarm- bells-ring-as-covid-situation-worsens?tbref=hp. Retrieved 2024-05-14 *BA.2.86, or Pirola, is a variant;https://fortune.com/well/2023/08/18/ba286-bax-highly- mutated-covid-omicron-strain-detected-united-states-pirola-pi-rho-world- health-organization/ . Fortune.com. Retrieved 2023-08-19 Samples (of the variant) are from as early as July 2023; It is on the list of Variants of interest (according to WHO, as of 2024's second quarter). The variant is a descendant of the parent lineage (or B.1.1.529) of the Omicron variant. It has been known to media since August 2023. Research has not shown (as of 2023's third quarter) if this variant can possibly be more dangerous than other variants that are in circulation (or spreading infection from some people to more people).https://www.cbsnews.com/news/new-covid-variant-ba286-who- monitoring/. Cbsnews.com 2023-08-18https://www.vg.no/nyheter/innenriks/i/EQ9l6G/ny-coronavariant- skaper-bekymring-vesentlig-forskjell. VG.no. Retrieved 2023-08-18 . It has \"dozens of genetic changes\". Related page: mutation. *EG.5, sometimes called Eris, sampled since February 2023, listed as Variants of interest (as of 2024's second quarter). The variant is a descendant of the parent lineage (or B.1.1.529) of the Omicron variant. *XBB.1.16, sampled since January 2023, listed as Variants of interest (as of 2024's second quarter). *XBB.1.5, sampled since October 2022, listed as Variants of interest (as of 2024's second quarter). *JN.1.7, sampled since September 2023; Listed as Variants under monitoring (as of 2024's second quarter). *KP.2, sampled since January 2024; Listed as Variants under monitoring (as of 2024's second quarter). *KP.3, sampled since February 2024; Listed as Variants under monitoring (as of 2024's second quarter). *JN.1.18, sampled since November 2023; Listed as Variants under monitoring (as of 2024's second quarter). === Out of circulation === *Lineage, B.1.1.529 (the parent lineage of the Omicron variant) seems to be out of circulation (according to WHO, in March 2023).https://www.who.int/news/item/16-03-2023-statement-on-the-update-of-who- s-working-definitions-and-tracking-system-for-sars-cov-2-variants-of-concern- and-variants-of-interest. Who.int. Retrieved 2023-08-20 Other variants that seem to be out of circulation: Identification WHO label PANGO lineage Nextstrain clade First outbreak Earliest sample Notable mutations More information B.1.617.2 21A By August 2022, no (known) circulation P.1 (B.1.1.28.1) 20J (V3) K417T, E484K, N501Y By March 2022, no (known) circulation B.1.351 20H (V2) K417N, E484K, N501Y By March 2022, no (known) circulation B.1.1.7 20I (V1) By March 2022, no (known) circulation == Nomenclature == SARS-CoV-2 corresponding nomenclaturesThis table is an adaptation and expansion of . PANGO lineages Cited in Notes to PANGO lineages Nextstrain clades, 2021 GISAID clades Notable variants 19B S contains \"reference sequence\" WIV04/2019 , , , L V 20A G Lineage B.1 in the PANGO Lineages nomenclature system , , , , GH 20C Includes Lineage B.1.429 / CAL.20C and Lineage B.1.525 20G Predominant in US generally, Jan '21 20H Includes B.1.351 aka 20H/501Y.V2 or 501.V2 lineage 20B GR Includes B.1.1.207 20D 20J Includes P.1 and P.2 20F 20I Includes lineage B.1.1.7 aka VOC-202012/01, VOC-20DEC-01 or 20I/501Y.V1 B.1.177 20E (EU1) GV Derived from 20A There are different systems for giving names to variants. == Criteria for importance == Viruses generally mutate over time, creating new variants. When a new variant grows in a population, it's labeled as an \"emerging variant\". Some of the potential consequences of emerging variants are the following: * Increased transmissibility * Increased mortality (death). * Ability to evade natural immunity (e.g., causing reinfections) * Ability to infect vaccinated people == Notable variants == === Alpha (lineage B.1.1.7) === This variant was first detected in October 2020 during the COVID-19 pandemic in the United Kingdom from a sample taken the month before in Kent. Lineage B.1.1.7, It's correlated with a big increase in COVID-19 infection in United Kingdom, partly because of the N501Y mutation. There is some evidence that this variant has 40%–80% increased transmissibility and an increase in deadliness. In December 2020, it became Variant of Concern 20DEC-01. Sometimes (in 2021) it has been called the \"UK variant\". ==== Variant of Concern 21FEB-02 ==== Variant of Concern 21FEB-02 (previously written as VOC-202102/02), described by Public Health England (PHE) as \"B.1.1.7 with E484K\" is the B.1.1.7 variant with an additional E484K mutation. As of 17 March 2021, there are 39 confirmed cases of VOC-21FEB-02 in the UK. On 4 March 2021, scientists reported B.1.1.7 with E484K mutations in the state of Oregon. It seems that this combination happened randomly in Oregon, instead of coming from the UK. === Beta (lineage B.1.351) === On 18 December 2020, the 501.V2 variant, also known as 501.V2, 20H/501Y.V2 (formerly 20C/501Y.V2), VOC-20DEC-02 (formerly VOC-202012/02), or lineage B.1.351, was first detected in South Africa and reported by the country's health department. Researchers and officials reported that the variant is more likely to make young people very sick. The South African health department also said that the variant may be driving the second wave of the COVID-19 epidemic in the country. Scientists said that the variant has many mutations that allow it to attach more easily to human cells because of the following three mutations in the receptor-binding domain (RBD) in the spike glycoprotein of the virus: N501Y, K417N, and E484K. === Gamma (lineage P.1) === Lineage P.1, termed Variant of Concern 21JAN-02 (formerly VOC-202101/02) by Public Health England and 20J/501Y.V3 by Nextstrain, was found in Tokyo on 6 January 2021 by the National Institute of Infectious Diseases (NIID). The new lineage was first identified in four people who arrived in Tokyo having travelled from the Brazilian Amazonas state on 2 January 2021. On 12 January 2021, the Brazil-UK CADDE Centre confirmed 13 local cases of the P.1 new lineage in the Amazon rain forest. This variant of SARS-CoV-2 has been named P.1 lineage (although it is a descendant of B.1.1.28, the name B.1.1.28.1 is not permitted and thus the resultant name is P.1), and has 17 unique amino acid changes, 10 of which in its spike protein, including the three concerning mutations: N501Y, E484K and K417T. A study of samples from Manaus between November 2020 and January 2021, showed the P.1 lineage to be 1.4–2.2 times more transmissible. The variant is also 10–80% more deadly. A vaccinated person has a higher risk of getting a mild P.1 infection while still being 100% protected against hospitalisation or death. Preliminary data from two studies indicate that the Oxford–AstraZeneca vaccine is effective against the P.1 variant, although the exact level of efficacy has not yet been released. Preliminary data from a study conducted by Instituto Butantan suggest that CoronaVac is effective against the P.1 variant as well, and the study will be expanded to obtain definitive data. === Epsilon (lineages B.1.429, B.1.427, CAL.20C) === Lineage B.1.429, also known as CAL.20C, has by five distinct mutations (I4205V and D1183Y in the ORF1ab-gene, and S13I, W152C, L452R in the spike proteins S-gene). B.1.429 might be more transmissible. The CDC has listed B.1.429 and the related B.1.427 as \"variants of concern,\" and says that they have a ~20% increase in transmissibility. B.1.429 was first discovered in July 2020 by researchers at the Cedars-Sinai Medical Center, California, in one of 1,230 virus samples collected in Los Angeles County since the start of the COVID-19 epidemic. It wasn't detected again until September when it reappeared among samples in California, but numbers remained very low until November. In November 2020, the CAL.20C variant accounted for 36 percent of samples collected at Cedars-Sinai Medical Center, and by January 2021, the CAL.20C variant was 50 percent of samples. === Eta (lineage B.1.525) === B.1.525, also called VUI-21FEB-03 (previously VUI-202102/03) by Public Health England (PHE) and formerly known as UK1188, doesn't have the same N501Y mutation found in B.1.1.7, 501.V2 and P.1, but has the same E484K-mutation as found in the P.1, P.2, and 501.V2 variants. B.1.525 is different from all other variants by having both the E484K-mutation and a new F888L mutation. As of March 5, it had been found in 23 countries, including the UK, Denmark, Finland, Norway, Netherlands, Belgium, France, Spain, Nigeria, Ghana, Jordan, Japan, Singapore, Australia, Canada, Germany, Italy, Slovenia, Austria, Malaysia, Switzerland, the Republic of Ireland and the US. ===Other notable variants=== Pango lineage GISAID clade Nextstrain clade Earliest samples Country of sampling AV.1 GR 2021-03 AT.1 GR 2021-01 R.1 GR 2021-01 B.1.466.2 GH 2020-11 B.1.1.519 GR 20B/S.732A 2020-11 Multiple countries C.36.3 GR 2021-01 Multiple countries B.1.214.2 G 2020-11 Multiple countries B.1.1.523 GR 2020-05 Multiple countries B.1.619 G 2020-05 Multiple countries B.1.620 G 20A/S.126A 2020-11 B.1.1.318 AZ.5 GR 2021-01 C.1.2 GR 2021-05 B.1.630 GH 2021-03 B.1.640 GH/490R 2021-09 XD 2022-01 * Lineage B.1.1.317 is not a variant of concern, but Queensland Health forced 2 people in hotel quarantine in Brisbane, Australia to go through an extra 5 days quarantine on top of the mandatory 14 days after it was confirmed they were infected with this variant. * Lineage B.1.1.318 was detected on 24 February 2021. 16 cases of it have been detected in the UK. *WIV04/2019, the most closely related to the original virus that began infecting humans. == Recombinant variants == The British government has reported recombinant variants of SARS-CoV-2. (Recombination happens when a virus combines parts from a related virus with the genetic sequence (of the first-mentioned virus) as it assembles (or gives) copies of itself.) These recombinant lineages have been given the Pango lineage identifiers XD, XE, and XF. XE is a recombinant lineage of Pango lineages BA.1 and BA.2. == Differential vaccine effectiveness == * RaTG13, the closest known relative to SARS-CoV-2 == Cross-species transmission == There is a risk that COVID-19 could transfer from humans to other animal populations and could combine with other animal viruses to create (more) variants that are dangerous to humans. Reverse zoonosis can possibly happen. === Cluster 5 === In early November 2020, Cluster 5, also referred to as ΔFVI-spike by the Danish State Serum Institute (SSI), was discovered in Northern Jutland, Denmark, and is believed to have been spread from minks to humans via mink farms. On 4 November 2020, it was announced that the mink population in Denmark would be culled to prevent the possible spread of this mutation and reduce the risk of new mutations happening. A lockdown and travel restrictions were introduced in seven municipalities of Northern Jutland to prevent the mutation from spreading, which could compromise national or international responses to the COVID-19 pandemic. By 5 November 2020, some 214 mink-related human cases had been detected. The World Health Organization (WHO) has stated that cluster 5 has a \"moderately decreased sensitivity to neutralizing antibodies\". SSI warned that the mutation could reduce the effect of COVID-19 vaccines under development, although it was unlikely to render them useless. Following the lockdown and mass-testing, SSI announced on 19 November 2020 that cluster 5 in all probability had become extinct. As of 1 February 2021, authors to a peer-reviewed paper, all of whom were from the SSI, assessed that cluster 5 was not in circulation in the human population. == Notes == == References == == Other websites == * * * Category:Disease- related lists SARS-CoV-2",
 "title": "Variants of SARS-CoV-2"
}