{
 "id": "834022",
 "text": "Ichgam is a village in the Indian administered union territory of Jammu and Kashmir. It is in the Budgam District. ==Demographics== , the population of Ichgam is 7,461 of which 3,820 are males while the remaining 3,641 are females as per the report released by Census of India. Population of children with age of 0-6 is 15.64% that's 1,167 of the total population of Ichgam. In Ichgam, the female sex ratio is of 953 against the erstwhile state average of 889. The child sex ratio in Ichgam village is around 1,065 compared to a previous state average of 862. Literacy rate of the Ichgam is 53.69% lower than the former state average of 67.16%. In Ichgam, male literacy is around 61.32% while female literacy rate is 45.32%. == Schools in Ichgam == ===Government Boys Higher Secondary School Ichgam=== Government Boys Higher Secondary School Ichgam is located at the main bus stand of Ichgam, behind the newly built complex. Managed by the Department of Education, the school was established in the year 1930. The medium of instructions in this school is English. Government Boys Higher Secondary School is housed in the two government owned buildings. The UDISE code of the school is 01040900603. The school is co- educational and consists of the classes from nine (9th) to twelve (12th). ===Imamia Public School Ichgam=== Imamia Public School (IPS) Ichgam is managed and run by Educational Trust Kashmir (ETK), the organization that runs many schools in the Kashmir valley named, Imamia Public Schools. The school was established in 1989 and is located at the Kalbal, the North western part of the village; behind the Primary Health Center Ichgam. It's UDISE code is 01040900606. At present, nearly 400 above students are studying in this school. Imamia Public School is housed in the Educational Trust Kashmir owned, big three floor building. The school is among the best schools of the village Ichgam and the in the near localities. === Others === * Government Girls High School Ichgam * Government Middle School Ichgam * Government School Wolina, Ichgam * Government School Baghat Mohalla, Ichgam * Government School Naru, Ichgam * IEI Ichgam * Hasnain Educational Institute, Ichgam ==Related pages== * Budgam ==Notes== ==References== Category:Villages in Jammu and Kashmir",
 "title": "Ichgam"
}