{
 "id": "834072",
 "text": "Karim Kharbouch (born November 9, 1984), better known by his stage name French Montana, is a Moroccan-born American rapper. He was born and raised in Morocco and emigrated to the United States with his family when he was 13. He is the founder of Coke Boys Records and its predecessor Cocaine City Records. Kharbouch released his first mixtape in 2007, called French Revolution Vol. 1. He had his first breakthrough with the single \"Choppa Choppa Down\" in 2010. He released his first studio album Excuse My French in May 2013. In July 2017, Montana released his second studio album Jungle Rules. The album peaked at number three on the Billboard 200. It included the single \"Unforgettable\" (featuring Swae Lee). The song became Montana's first song as a lead artist to reach the top 10 on the Billboard Hot 100. == Early life == Karim Kharbouch was born on November 9, 1984, in Casablanca, Morocco. Kharbouch has claimed that he has Moroccan, Ethiopian, and Somalian ancestry.https://id-times.com/news/what-is-french-montana-ethnicity/ He lived in Casablanca for the first 13 years of his life. His favorite hobbies growing up were soccer and rap, and he got into basketball in his later teenage years. In the mid-1990s, Kharbouch left Morocco with his parents and younger brother for New York City. They settled in the South Bronx. Kharbouch spoke only his native languages of Moroccan Darija and French when he first arrived, and learned English in the Bronx high schools of Lehman and Roosevelt. After struggling for two years, his father decided they would move back to Casablanca. His mother chose to stay back with their children because she believed there was a lack of opportunity back home in Morocco. His mother was pregnant with his youngest brother at the time. He was born in the United States shortly after his father left for Morocco. With three children and low money, his mother had to depend on welfare for financial support. == Personal life == Montana is fluent in his native Arabic and French as well as in English. Montana has lived in Pompton Plains, New Jersey. In 2016, he bought Selena Gomez's Calabasas, California home for $3.3 million. He is not a practicing Sunni Muslim because he is a rapper/singer]. Montana married Deen Kharbouch in 2007. The couple separated in 2012, and their divorce was finalized in 2014 for around $2 million. They have a son named Kruz. Montana started dating Khloé Kardashian in June 2014. They broke up in September 2014. In June 2018, Montana became a U.S. citizen. == Discography == === Albums === * Excuse My French (2013) * Jungle Rules (2017) * Montana (2019) == Awards and nominations == === BET Awards === |- |2013 |\"Pop That\" |Best Collaboration | === BET Hip Hop Awards === |- |rowspan=\"2\"|2013 |rowspan=\"2\"|\"Pop That\" |Best Club Banger | |- |Reese's Perfect Combo Award (Best Collabo, Duo or Group) | |- |rowspan=\"4\"|2016 |rowspan=\"3\"|\"All the Way Up\" (with Fat Joe & Remy Ma) |Best Hip Hop Video | |- |Best Collabo, Duo or Group | |- |People's Champ Award | |- |Wave Gods |Best Mixtape | |- === Billboard Music Awards === |- |2015 |\"Loyal\" |Top R&B; Song | === Grammy Awards === |- |2016 |\"All Day\" (as songwriter) |rowspan=\"2\"|Best Rap Song | |- |rowspan=\"2\"|2017 |rowspan=\"2\"|\"All the Way Up\" (with Fat Joe & Remy Ma) | |- |Best Rap Performance |rowspan=\"2\" style=\"text-align:center;\" == References == Category:1984 births Category:Living people Category:Naturalized citizens of the United States Category:People from Casablanca Category:People from the Bronx Category:Rappers from New York (state) Category:Moroccan entertainers",
 "title": "French Montana"
}