{
 "id": "83418",
 "text": "John Milton (9 December 1608 – 8 November 1674) was an English poet, religious thinker, and civil servant for the English Commonwealth Government. He is one of the most important figures in Western literature. He is most famous for his Christian epic poem Paradise Lost. His writing influenced both later poets and religious thinkers. == Life == John Milton was born on 9 December 1608, the son of John Milton (senior) and Sarah Jerry. His family lived in Bread Street, London. His father was a musician and composer. His main work was as a scrivener, a secretary who reads and writes letters for people who cannot read and write for themselves. Milton's father was well paid at this work, and was able to hire a private tutor to teach his clever eldest son. Milton's brother Christopher said he studied very long into each night. Milton then went to St. Paul's School where he studied Latin, Greek, and Hebrew. Milton then studied at Christ's College, Cambridge and graduated with a B.A. in 1629. On 3 July 1632, he received his Master of Arts degree. He returned home where he continued to study and write poetry for six years. He wrote a large number of poems. In 1638 he made a tour of the Continent, spending a lot of time in France and Italy, where he learned about other authors such as Dante, Tasso, and Ariosto. When he was 34, he married Mary Powell, who was 17. He defended freedom of speech and freedom of press. == Publications == In 1645, during the English Civil War, he published Poems of Mr. John Milton, in which there were his famous poems \"L'Allegro\" and \"Il'Penseroso\", which was mostly ignored. In 1649, during the trial of Charles I, Milton wrote Of the Tenure of Kings and Magistrates, arguing that kings can rule only when the people allow them to. He then became secretary to the Council of State and wrote in Latin Eikonoklastes in 1649. That was the last big writing project he did before he began to become blind. In 1652, he became completely blind and was very unhappy. However, in 1667, he published the famous Paradise Lost, one of the greatest English-language epics. Four years later, he wrote Paradise Regained, a story about how men became sinful and how Jesus Christ won the battle with the devil. The last work that was published while he was alive was Samson Agonistes. He died, probably because of gout, on 8 November 1674. == Other websites == * * Milton Reading Room – online, almost fully annotated, collection of all of Milton's poetry and selections of his prose * Milton 400th Anniversary – lots of Milton material and details of the Milton 400th Anniversary Celebrations, from Christ's College, Cambridge, where Milton studied * \"Milton and De Doctrina Christiana\" by Gordon Campbell et al., 1996 * \"The masque in Milton's Arcades and Comus\" by Gilbert McInnis * History of the John Milton Society for the Blind in Canada * How Milton Works by Stanley Fish * Milton's cottage * Paradise Lost by John Milton, Introduction and Notes by David Hawkes * A common-place book of John Milton, and a Latin essay and Latin verses presumed to be by Milton Cornell University Library Historical Monographs Collection. Category:1608 births Category:1674 deaths Category:Alumni of the University of Cambridge Category:Civil servants Category:English poets Category:English Protestants Category:Writers from London",
 "title": "John Milton"
}