{
 "id": "834168",
 "text": "Autoradio () (105.1 Minsk FM) was the first private radio station in Belarus. It worked from Minsk. The radio station used the frequency 105.1 MHz. It worked from August 7, 1992 to January 12, 2011. ==History== From the start of the 1990s to January 1, 1995, Autoradio was heard on the frequency 67.7 OIRT FM. Autoradio used OIRT FM (the International Radio and Television Organisation wave in the air). It was the only open range for people and organizations in Belarus at that time. In 1995, the radio station was cut. It took four years to get back on the air. In 2001, the second wave line was started on the FM frequency 105.1 MHz (Megahertz). Belarusian music was heard on the radio. Groups N.R.M., Krambambula, Lyapis Trubetskoy, Neuro Dubel, and the best songs from the Tuzin.fm website selection were heard the most. Famous people worked for the radio station, such as Oleg Khomenko, Dzmitryj Wajciuszkiewicz, and Masha Yar. In September 2009, the Ministry of Information of the Republic of Belarus penciled a punishment for Autoradio for broadcasting the EuroZoom show made together with European Radio for Belarus. === End of broadcasting === At 12:40 on January 12, 2011, the Autoradio's broadcasting document was taken away and the radio station saw its end.Закрытая «Аўтарадыё» // Nasha Niva The Republican Commission on Television and Radio Broadcasting led by Oleg Proleskovsky took the Autoradio's broadcasting document away after the station broadcast advertisements for candidates Andrei Sannikov and Uladzimir Nyaklyayew. Both were against Alexander Lukashenko in the 2010 presidential elections in Belarus. Journalist Paulyuk Bykouski said that the Autoradio's advertisements were in agreement with the Central Election Commission of Belarus (the organization that does elections). The court of the first level supported the position of Avtoradio. Its decision was changed later. As a result of the change, Dmitry Alexandrov, judge of the Economic Court of Belarus, who ruled to shut the radio station down, became a person whose EU accounts and moves to the European Union were iced. The government-run radio station Stalitsa () was given the frequency 105.1 MHz that was taken away from Autoradio. Stalitsa began using it on April 15, 2012. Yuri Bazan, the person who made Autoradio and was its main editor, died on September 24, 2016. == Thoughts == Music judge Dzmitry Padbiarezski called Autoradio one of his much loved Belarusian FM-stations. == In art == In 2011, the group N.R.M. recorded the song \"Autoradio\" () in support of the shut down radio station. == Related pages == * Radio 101.2 == References == Category:Radio stations in Belarus Category:Censorship in Belarus",
 "title": "Autoradio"
}