{
 "id": "83420",
 "text": "The Bundesregierung, sometimes called the Bundeskabinett or Federal Cabinet, is the government of the Federal Republic of Germany and it consists of the Chancellor and the Federal Ministers. The job of the cabinet is listed in the articles 62 to 69 of the constitution. This also has the oath of office that the minister must take. The Chancellor is responsible for the administrative work of the Federal Government, but the work is delegated to the Head of the Federal Chancellery. The Chancellor sets the general policy of the Federal Government, and what each ministry should do. The Federal Ministers are responsible for what happens in their own departments, and for making sure that the ministry keeps to the general ideas of the Chancellor. This is known as the departmental principle (). If two Federal Ministers disagree about what should be done or about who is to do it or how it is to be done, the Federal Government decides with a majority decision. The is called the cooperative principle (). The Federal Minister Law () says that a retired member of the Federal Government can have a retirement pension, if they have been a minister for at least two years. Time as a junior minister (US \"Undersecretary\"), who in Germany are called parliamentary permanent secretaries, is counted, and so is previous membership in a Land (state) government. Parliamentary permanent secretaries and state ministers are not members of the Federal Government, but do help them in their job. As a rule, the Federal Cabinet meets in the Federal Chancellery every Wednesday at 9:30 a.m. == Third Merkel Cabinet == Only members of CDU-CSU and SPD are in the Third Merkel Cabinet (2013-2018). Department Officeholder Party Federal Chancellor Angela Merkel CDU Foreign Office and Deputy Federal Chancellor Sigmar Gabriel SPD Economic Affairs and Energy Brigitte Zypries SPD Interior Thomas de Maizière CDU Justice and Consumer Protection Heiko Maas SPD Finance Wolfgang Schäuble CDU Labour and Social Affairs Andrea Nahles SPD Food and Agriculture Christian Schmidt CSU Defence Ursula von der Leyen CDU Family Affairs, Senior Citizens, Women and Youth Katarina Barley SPD Health Hermann Gröhe CDU Transport and Digital Infrastructure Alexander Dobrindt CSU Environment, Nature Conservation, Building and Nuclear Safety Barbara Hendricks SPD Education and Research Johanna Wanka CDU Economic Cooperation and Development Gerd Müller CSU Federal Minister for Special Tasks and Head of the Federal Chancellery Peter Altmaier CDU == Lawyers in the Federal Government == This table lists the number and percentage of members of the federal government who were lawyers. In Germany the time between elections is called a \"legislative period\". In the United Kingdom this would be called a Parliament or in the United States a Congress. Legislative period Fully qualified lawyers Number Percentage 1\\. (1949–1953) 6 of 14 42.9% 2\\. (1953–1957) 5 of 20 25.0% 3\\. (1957–1961) 7 of 18 38.9% 4\\. (1961–1965) 8 of 21 38.1% 7 of 22 31.8% 5\\. (1965–1969) 7 of 22 31.8% 6 of 20 30.0% 6\\. (1969–1972) 4 of 16 25.0% 7\\. (1972–1976) 8 of 18 44.4% 4 of 16 25.0% 8\\. (1976–1980) 4 of 16 25.0% 9\\. (1980–1983) 8 of 17 47.1% 8 of 17 47.1% 10\\. (1983–1987) 8 of 17 47.1% 11\\. (1987–1990) 9 of 19 47.4% 12\\. (1990–1994) 6 of 20 33.3% 13\\. (1994–1998) 9 of 18 50.0% 14\\. (1998–2002) 3 of 16 18.8% 15\\. (2002–2005) 6 of 14 42.9% 16\\. (2005–2009) 6 of 16 37.5% 17\\. (2009–2013) 7 of 16 43.8% 18\\. (2013-2018) 9 of 16 56,2% Category:Government of Germany *",
 "title": "Cabinet of Germany"
}