{
 "id": "834271",
 "text": "Prince Philip, Duke of Edinburgh, the husband of Queen Elizabeth II of the United Kingdom and the Commonwealth realms, and the longest-serving royal consort in British history, died at Windsor Castle at age 99 on the morning of 9 April 2021. The cause of death has not been released, though an official statement says he \"died peacefully\". ==Operation Forth Bridge== Named after the Forth Bridge in Edinburgh, the city of his dukedom, the national plan for publicly handling the Duke's death is called Operation Forth Bridge. The Duke could have a full state funeral, but had wished for minimal \"fuss\"; as such, there was no state funeral or lying in state. He had a military funeral conducted at St George's Chapel. Prince Harry, Duke of Sussex, who resides in the United States, had planned to return to the UK for the Duke's 100th birthday. Instead, he returned for the funeral, which happened eight days following the Duke's death. No laws were passed in the eight-day mourning period for the Duke. ==Impacts because of COVID-19== Changes were necessary against mass gatherings because of the COVID-19 pandemic; for example, there were no crowds or members of the public present at any time, with the number attending not more than thirty, in line with regulations. ==Burial== The Duke was not given a state funeral, which are usually reserved for monarchs. Instead, he had a royal ceremonial funeral. He did not want to lie in state, though the Duke did \"lie at rest\" in the private chapel at Windsor Castle prior to his service. He had a military funeral conducted at St George's Chapel and burial in the same place. This royal ceremonial funeral was the same level of honour as formerly given to Queen Elizabeth The Queen Mother and Diana, Princess of Wales. His funeral was broadcasted on television. ==References== Category:21st century in England Category:April 2021 events Category:State funerals Category:Windsor, Berkshire Category:2021 in the United Kingdom",
 "title": "Death and funeral of Prince Philip, Duke of Edinburgh"
}