{
 "id": "834455",
 "text": "Rossana Di Bello (28 August 1956 – 10 April 2021) was an Italian politician. She was mayor of Taranto from 2000 to 2006. == Biography == Di Bello was of socialist extraction. In 1993, she founded the first Apulian club of Forza Italia in Taranto of which she became president in the same year. In 1995, she was elected Regional Councilor, and later appointed Regional Councilor for Tourism and Cultural Heritage, a position she held until 1998, when she was assigned the Regional Councilorship for Industry, Commerce and Crafts. On 30 April 2000, Di Bello was elected mayor of Taranto with 57.5% of the votes in the ballot round. After Adriana Poli Bortone (mayor of Lecce in 1998), Rossana Di Bello is the second female mayor in Apulia, the first female mayor in the history of the city. She was reelected on 3 April 2005, obtaining 57.8% of the votes in the first round. On 18 February 2006, following the first degree sentence of one year and four months for abuse of office and false ideology in the investigation into the entrustment of the management of the city incinerator to the company Termomeccanica, she resigned from the office of mayor. She is then acquitted on appeal of all charges. The extraordinary commissioner Tommaso Blonda, appointed in her place, declared the financial distress of the Municipality of Taranto. On 18 October, the Ionian city recorded a liability of 357 million euros. On 21 November 2006, the deputy prosecutor of the Court of Taranto asked for the indictment of the former mayor Rossana Di Bello and of other 32 people including former administrators and officials of the capital, accused in various ways of false ideological in public deed in relation to the draft and the approval of municipal budgets in the years from 2001 to 2005. On 7 March 2007, Di Bello received another guarantee notice from the deputy public prosecutor Maurizio Carbone for abuse of office and fraud in the context of an investigation into the extension of municipal contracts. On 1 March 2011, she was acquitted by the court of Taranto for the crime of abuse of office and fraud on the procurement investigation that she was accused of due to lack of evidence. == Death == Di Bello, who was married and had a daughter, died of COVID-19 on 10 April 2021 at the age of 64 in Taranto during the COVID-19 pandemic in Italy.Covid, è morta l’ex sindaco di Taranto Covid, è morta l’ex sindaco di Taranto Rossana Di Bello == References == Category:1945 births Category:2021 deaths Category:Italian mayors Category:Deaths from the COVID-19 pandemic in Italy Category:Politicians from Apulia",
 "title": "Rossana Di Bello"
}