{
 "id": "835195",
 "text": "Ramūnas Karbauskis (Lithuanian: Ramūnas Karbauskis; born December 5, 1969) is a Lithuanian businessman, politician and philanthropist. == Biography == === Education and career start === Ramūnas Karbauskis was born on December 5, 1969 in the village of Naisiai, Šiauliai district. His father is Česlovas Karbauskis, who was member of the Verkhovna Rada of Lithuania, and his mother is Nijola Karbauskienė. In 1987, he graduated from high school and entered the agronomic faculty of the Lithuanian Agricultural Academy, which he graduated in 1992. He was interested in checkers and became a candidate for master of sports in international and Russian checkers. In 1987-1988, he was a member of the Lithuanian youth team in Russian checkers. In 1993, Karbauskis founded the company Agrokoncernas. In few years it became one of the largest agricultural groups in Lithuania, employing more than 800 people, and Karbauskis was one of the richest people in Lithuania. === Politics === Karbauskis was elected to the Seimas three times in the mid-1990s. Since 2009, Karbauskis has been the chairman of the Lithuanian Union of Populist Peasants. In the 2016 parliamentary elections, the party took first place and Karbauskis himself ran for parliament. === Charity === Karbauskis organized the Naisiai family festival (in honor of his native village). In 2013, Karbauskis co-founded the Švieskime Vaikus charity foundation (en: Let's raise children), together with Lithuanian singer and producer Andrius Mamontovas. Since 2006, Karbauskis has been the President of the Lithuanian Drafts Federation, and since 2009 he has been the Vice-President of the Lithuanian Jamaican Horse Association (a historical horse breed from Lithuania). === Family === Karbauskis has a wife, Lina, and two sons, Justinas and Mantas. His brother Mindaugas Karbauskis is the artistic director of the Vladimir Mayakovsky Moscow Academic Theater. ==References== Category:1969 births Category:Living people Category:Members of the Seimas Category:Lithuanian people Category:Business people",
 "title": "Ramūnas Karbauskis"
}