{
 "id": "835422",
 "text": "Nokia N93i was a version of the Nokia N93 that was considered \"better\". It was told and released on November 11, 2006 and then discontinued in 2012. It was also the first of Nokia Nseries. == History == Nokia N93 was a new version of N93i. It was told by Nokia Nseries on November 11, 2006 at \"The Verge\" in West Hollywood, California. On November 19, 2006, Google had said that the YouTube app had been added to the new Nokia N93i. Nokia N93i was shown at The Verge on November 22 and November 23 at Universal Orlando Resort in Orlando, Florida. In January 8, 2007, Nokia had announced the Nokia N93i has partnered the news version like Nokia N93, after release on July 11, 2006, The N93i was developed and the news version was released. On January 16 and January 17, 2007 it was launched for sales. Nokia N93i had been released on January 26, 2007 as it was being developed. People working at Nokia had been connecting to people and had reached the public on January 30 and February 1, 2007. == Reception == Nokia N93i has showing for performance Nokia N93i Is Here reach on July 7, 2007. Nokia N93i has public reach at St. Louis Hotel in Santa Monica, California. Nokia N93i had legacies for sales that had next expired on August 8, 2007. In September 2007, Nokia N93 had expired and was no longer for sale, and it stopped selling before September 30. Nokia N93i had stopped being available in February 8, 2012, Nokia N93i was also no longer available including Nokia N93, that the Nokia Corporation had stopped. It was based as discontinued, because it had expired its support lifecycles. == Functions and design == === Camera and connecting === The camera in Nokia N93i had released for its news version partner, with 24cm for 80cm, the Nokia N93i camera has small features in camera for connecting Tube of World, Nokia N93i had features for the public. == Other websites == * https://nokia.com/family/nokian93i Category:Nokia mobile phones Category:Mobile phones introduced in 2007",
 "title": "Nokia N93i"
}