{
 "id": "835588",
 "text": "Isabella Khair Hadid (born October 9, 1996) Website of Bella Hadid's mother, Yolanda Foster. is an American supermodel. She has appeared on 35 international Vogue covers. In 2022, the British Fashion Council named her Model of the Year, and in 2023, Time magazine included her in its list of the 100 most influential people in the world. Born in Washington, D.C., and raised in Santa Barbara, California, Hadid started modeling at 16. She signed with IMG Models in 2014 and debuted at New York Fashion Week that year. In 2016, she was voted Model of the Year by industry professionals of Models.com. The next year, she set a record for the most Vogue September covers in a single year, with five. Since 2018, she has been among the highest-paid models in the world, earning $19 million. She is of Palestinian and Dutch descent. Her sister is model Gigi Hadid. == Early life == Isabella Khair Hadid was born on October 9, 1996, in Washington, D.C.. Her father, Mohamed Hadid, is a Palestinian-American real estate developer, and her mother, Yolanda Hadid (née van den Herik), is a Dutch former model. Through her father, Hadid is descended from Zahir al-Umar, an 18th-century ruler in northern Palestine. Hadid has an older sister, Gigi Hadid, and a younger brother, Anwar Hadid, who are also models. She also has two older sisters, Marielle and Alana Hadid. She and her siblings were raised on a ranch in Santa Barbara, California, and later moved to Beverly Hills, California after ten years. == Career == === 2012-2014: Early work === Hadid began modeling at age sixteen with a commercial project for Flynn Skye. She later appeared in Lesa Amoore's \"The Swan Settings\" with actor Ben Barnes, and Holly Copeland's \"Smoking Hot\". She also modeled for Hanna Hayes' Fall/Winter 2013 collection and did campaign work for Chrome Hearts, a brand linked to her best friend Jesse Jo Stark. === 2014-2015: Rise to prominence === Hadid signed with IMG Models on August 21, 2014,* * * and made her New York Fashion Week debut in September, walking for Desigual. In December, she appeared on the cover of Jalouse and was featured in Love magazine's Advent Calendar. In February 2015, she walked in Tom Ford's Fall/Winter show and appeared in CR Fashion Book in two features: \"Body By Bella\" and \"Fantasy Campaigns.\" In May, she walked in amfAR’s 22nd Cinema Against AIDS Gala. That year, she modeled in campaigns for Botkier Bags, Victoria's Secret Pink, and Boghossian Jewelry. She walked for major designers and brands during fashion weeks in New York, London, Milan, and Paris, including Diane von Fürstenberg, Marc Jacobs, Topshop, Moschino, and Balmain. In December, she walked for Chanel's Métiers d’Art show in Rome. Hadid appeared on the November 2015 cover of Seventeen, starred in Topshop’s Holiday campaign, and featured again in Love’s Advent Calendar. She appeared in Balmain’s Fall 2015 campaign with her sister Gigi Hadid, and also in campaigns for Ralph Lauren and Samsung. She was featured in editorials for Vogue Australia, Harper's Bazaar, GQ, Elle, and others. She also appeared on several magazine covers, including V, Teen Vogue, Wonderland, and Evening Standard. === 2016-2017: Breakthrough === In January 2016, Hadid made her Chanel Couture debut at Paris Haute Couture Fashion Week and appeared in Marc Jacobs’ “My America” campaign. In February, she walked for Fenty x Puma at New York Fashion Week, and in March, walked exclusively for Givenchy, Chanel, and Miu Miu in Paris. She also modeled in Joe’s Jeans Spring campaign. In May, Hadid made her Australian runway debut, opening and closing the Misha Collection Resort 17 show at Mercedes-Benz Fashion Week. She also walked for amfAR’s 23rd Cinema Against AIDS Gala and Dior Cruise 2017 in London. On May 31, she became a Dior Makeup ambassador and starred in a Dior web series. She also did a makeup tutorial for Vogue's YouTube channel. In June, she walked in Givenchy’s Menswear Fall 2016 show in Paris. In July, she walked for Versace, Dior, Alexandre Vauthier (closing), and Fendi (also closing the show). For the Spring/Summer 2017 season, she opened for DKNY and walked for Michael Kors, Anna Sui, Ralph Lauren, and Marc Jacobs at New York Fashion Week. In London, she opened for Versus (Versace). In Milan, she opened for Alberta Ferretti and Fendi, walked for Max Mara, Moschino, Versace, Bottega Veneta, and closed for Philosophy di Lorenzo Serafini. She appeared in Topshop’s Denim campaign, Givenchy’s Fall/Winter campaign, and Calvin Klein’s campaign alongside Frank Ocean and Kate Moss. In August, she starred in J.W. Anderson’s Fall/Winter campaign and photographed the Stark family for W magazine. In October, she appeared in Misha Collection’s “Gold by Misha” campaign. In 2016, Hadid appeared on many magazine covers, including Seventeen Mexico, Elle, Glamour, Harper’s Bazaar, and Vogue in several countries. She made her first Vogue cover for Vogue Turkey in May and acted in a short film called Private. In August, she was on the cover of Vogue Me with rapper G-Dragon, and in September, she appeared on three more Vogue covers with model Taylor Hill. She also starred in Love magazine’s 2016 Advent Calendar. In January 2017, Hadid walked in Givenchy's Fall/Winter Menswear show in Paris. She also walked for Chanel and opened for A lexandre Vauthier. In February, she became an ambassador for Bulgari accessories and TAG Heuer. She appeared in the Tommy x Gigi show in Los Angeles and closed the H&M; Studio show in Paris. During New York Fashion Week, she opened for Prabal Gurung and Zadig & Voltaire, and walked for Alexander Wang, Carolina Herrera, Michael Kors, and others. In London, she opened the Versace Versus show. In Milan, she walked for Alberta Ferretti, Fendi, Moschino, and Versace. In Paris, she walked for Lanvin, Chanel, and Off-White, and opened for Alexandre Vauthier. At Cannes, she walked in Naomi Campbell's Fashion for Relief and amfAR's Gala. During Haute Couture week, she walked for Alexandre Vauthier, Miu Miu, Maison Margiela, and Fendi. Hadid appeared in Fendi and Moschino campaigns with her sister Gigi, and in a Zadig & Voltaire campaign with her brother Anwar. She also starred in solo campaigns for DKNY, TAG Heuer, Boghossian, Ochirly, Zayn x Versus, and Nike. She became the face of Dior's \"Pump N' Volume\" mascara, Bulgari's Goldea fragrance, and Max Mara accessories. Her first 2017 cover was a W Korea reprint. She later appeared on covers for Teen Vogue, Vogue China, Vogue Italia, Elle Russia, and Harper’s Bazaar China. She set a record with five Vogue September covers in one year (China, Spain, Brazil, Australia, and Arabia), and was also featured on CR Fashion Book, Porter, InStyle, and others. She appeared in editorials for Vogue Paris, Love, V, and Dazed. === 2018-present: Further recognition === In January 2018, Hadid appeared on the cover of Vogue Korea. In March, she and her sister Gigi were on the cover of British Vogue. She appeared on various international magazine covers throughout the year, including Vogue Japan (May), Cosmopolitan Germany, Harper's Bazaar and Vogue México (July), Allure and Pop (September), and Harper's Bazaar Arabia (October). During the Fall 2018 season, Hadid opened Off-White’s show at Paris Fashion Week. She also walked for several designers in Milan, including Tommy Hilfiger, Fendi, and Moschino, and in New York for Michael Kors, Ralph Lauren, and others. In 2019, Hadid walked for multiple designers across Paris, Milan, and New York Fashion Weeks, including Versace, Fendi, Oscar de la Renta, and Off-White. She also walked in the CR Runway 90th Anniversary show. She appeared on the covers of several editions of Vogue, including Russia, Greece, Japan, and España, and also Elle France. In 2020, she walked at New York, Paris, and Milan Fashion Weeks for brands like Tom Ford, Marc Jacobs, Thierry Mugler, Versace, and Moschino. She appeared on the covers of Vogue Hong Kong, Vogue Korea, Vogue Greece, Vogue Paris, Elle, Vogue Italia, and Vogue Japan. In 2021, Hadid walked for Givenchy and Mugler, and starred in campaigns for Boss x Russell Athletics. She appeared on the cover of Vogue España and walked for Versace and Jacquemus. In July, her Schiaparelli gown at the Cannes Film Festival received significant media attention. In 2022, she closed Coperni’s Spring 2023 show at Paris Fashion Week wearing a spray-painted dress created live on stage using Fabrican technology. Designer Thom Browne described her as a “once-in-a-generation talent.” Her impact on brand performance is referred to as the “Bella Effect,” with some brands reporting profit increases up to 90%. In 2024, Adidas removed parts of a controversial ad campaign featuring Hadid due to her Palestinian heritage and the campaign's connection to the 1972 Munich Olympics. Hadid apologized, saying she was unaware of the context, and Adidas also issued an apology. === Other ventures === On September 1, 2021, Hadid became the co- founder and partner of Kin Euphorics, a nonalcoholic drink brand. She runs the company with CEO and founder Jen Batchelor. == Filmography == === Television === Year Title Role Notes 2011–2016 The Real Housewives of Beverly Hills Herself 2016 Keeping Up with the Kardashians 2018 Making a Model with Yolanda Hadid 2022 Ramy Lena 2 episodes 2024 Holland's Next Top Model Herself 1 episode Yellowstone Sadie 1 episode === Short films === Year Film Title Production Role 2015 Bella Hadid's Guide to LA i-D Herself 2016 Private Tyler Ford Unnamed/Herself 2017 Going Home with Bella Hadid W Magazine Herself === Dior Beauty with Bella Hadid === Year Film Title Description 2016 \"The Backstage\" Behind the scenes of Dior Cruise F/W16 fashion show, with Peter Phillips. \"The Date\" Rouge Dior social media advertisement. \"The Party\" Hadid shows her guide for a night out. 2017 \"The Elevator\" Diorskin Forever Perfect Cushion social media advertisement. \"The Makeup Talk\" Dior S/S17 Colour Gradient collection tutorial, with Peter Phillips. \"The Call Time\" Backstage Pros social media advertisement. \"The Diner\" Dior Addict Lacquer lipstick social media advertisement. \"The Tattoo\" Dior Addict Lip Tattoo social media advertisement. === Music videos === Year Artist Title 2014 Jesse Jo Stark \"Down Your Drain\" \"Baby Love\" 2015 The Weeknd \"In the Night\" Belly ft. The Weeknd \"Might Not\" 2024 Mustafa \"Gaza is Calling\" ==Awards and nominations== Year Type Award Result 2015 Models.com Industry Awards Break Out Star: Women (Reader's Choice) 2016 Second Annual Fashion Los Angeles Awards Model of the Year GQ Men of the Year Awards Model of the Year British Fashion Awards International Model of the Year Models.com Industry Awards Model of the Year: Women (Industry's Choice) Model of the Year: Women (Reader's Choice) Social Media Star of the Year: Women (Reader's Choice) == Notes == ==References== Category:1996 births Category:Living people Category:American models Category:Entertainers from Washington, D.C. Category:American Muslims Category:Hadid family",
 "title": "Bella Hadid"
}