{
 "id": "83550",
 "text": "Geography of the Dominican Republic Continent Americas Region Caribbean Coordinates 18°52' N 70°29' W Area Ranked 127 48,671 km² Coastline 1,288 km Borders 388 km Highest point Pico Duarte 3,098 m Lowest point Lake Enriquillo -46 m Longest river Yaque del Norte Largest lake Lake Enriquillo The Dominican Republic (Spanish: República Dominicana) is a country in the Caribbean. It occupies the eastern five-eighths of Hispaniola; Haiti occupies the western three-eighths of the island. The land border between these two countries is 388 km long. The country has a total area of 48,671 km²; the part on the Hispaniola has an area of 48,215 km² and the small Dominican islands have an area of 159 km². The maximum length, east to west, is 390 km from Punta de Agua to Las Lajas, on the border with Haiti. The maximum width, north to south, is 265 km from Cape Isabela to Cape Beata. The limits of the country are Haiti to the west, the Atlantic Ocean to the north and the Caribbean Sea to the south. Puerto Rico is to the southeast separated by the Mona Channel, of about 130 km wide. The capital, Santo Domingo, is located on the south coast. ==Climate== The country has a tropical climate but modified by elevation and the trade winds (winds that come from the northeast, from the Atlantic Ocean), which blow from the Atlantic all year long. The average yearly temperature is 25 °C with small changes from one season to another; the average temperatures change from one region to another, from 21 °C in the centre of the Cordillera Central to as high as 28 °C on the coastal plains. Temperatures very few times get above 32 °C; temperatures get below 0 °C only in the highest mountains in winter. The average temperature in Santo Domingo in January is 25 °C and 30 °C in July. The rain season is from May to November. The average yearly rainfall is 1,346 mm, with extremes of 2,500 mm or more in the northeastern mountains and 500 mm in the southwestern valleys. The western valleys, along the Haitian border, remain relatively dry, with less than 760 mm of annual precipitation. The northwestern and southeastern extremes of the country are also very dry. From June to November (mainly from August to October), tropical storms and hurricanes are frequent and can do much damage in the country. == Islands == There are several smaller islands and cays that are part of the Dominican Republic. The largest islands are: #Saona, close to the southeastern coast of the Hispaniola, in the Caribbean Sea. It has an area of 117 km². Its Taíno name was Iai As shown in a map made by Andrés Morales in 1508 and published in 1516. In or Adamanay. Columbus named this island as Savona after the Italian city of the same name but the use during years has eliminated the letter v. #Beata, in the southern coast of the Hispaniola, in the Caribbean Sea. It has an area of 27 km². Nobody knows its Taíno name. Columbus named this island as Madama Beata. #Catalina, very close to the southeastern coast of the Hispaniola, in the Caribbean Sea. It has an area of 9.6 km². Its Taíno name was Iabanea but some writers, including poets, say that it was called Toeya or Toella. It was discovered by Columbus who named it as Santa Catalina. Some of the cays are Cayos Siete Hermanos (in English, \"Seven Brothers Cays\"), close to the northwestern coast, and the cays of Samaná Bay. == Mountains and Valleys == The Dominican Republic is a country with many mountains; the highest peaks of the Caribbean are found here. The chains of mountains show a direction northwest-southeast and they are separated by valleys with the same general direction. From north to south, the mountain ranges and valleys are: * Cordillera Septentrional (in English, \"Northern Range\"). It runs parallel to the north coast, with extensions to the northwest, the Tortuga Island north of Haiti, and to the southeast, the Samaná Peninsula (with its Sierra de Samaná). Its highest mountain is Diego de Ocampo, close to the city of Santiago, with 1,249 m. There are several small plains between this range and the Atlantic Ocean. Rivers are short and most of them flow to the north. * The Cibao Valley is the largest and most important valley of the country. This long valley goes from Northern Haiti, where is called Plaine du Nord, to Samaná Bay. It can be divided in two parts: the northwestern part is the Yaque del Norte Valley (or Línea Noroeste) and the eastern Yuna Valley (or Vega Real, English: Royal Valley). The Vega Real has the best soils of the country; the population density is high. * The Cordillera Central (in English, \"Central Range\") is also called Sierra del Cibao and in Haiti as the Massif du Nord (\"Northern Massif\"). With its high mountains, it divides the country in two halves. The highest mountains of the West Indies are in this range: Pico Duarte, 3,098 m, and others above 3,000 m. Near the center of the island, this range turns southward and is called Sierra de Ocoa, ending near the city of Azua de Compostela, on the Caribbean coast. Another branch, Cordillera Oriental (in English, \"Eastern Range\") or Sierra del Seibo is separated from the main chain by the region known as Los Haitises; it has a west-east direction and is located south of Samaná Bay. * The San Juan Valley and Plain of Azua are big valleys south of the Cordillera Central with altitude from 0 to 600 m. * The Sierra de Neiba; Mount Neiba is the highest mountain here with 2,279 m. An extension to the southeast of Sierra de Neiba is the Sierra Martín García (Loma Busú, 1,350 m). * The Hoya de Enriquillo or Neiba Valley is a remarkable valley, with a west-east direction, of low altitude (on average 50 m with some points below sea level) and with a great salt lake: the Enriquillo Lake. * The Sierra de Bahoruco, called Massif de la Selle in Haiti. This southern group of mountains have a geology very different to the rest of the island. * Llano Costero del Caribe (in English, \"Caribbean Coastal Plain\") is in the southeast of the island (and of the Dominican Republic). It is a large prairie east of Santo Domingo. == Rivers and Lakes == The 8 longest rivers of the Dominican Republic are: # Yaque del Norte is the longest river of the Dominican Republic, with 296 km. Its sources are in the Cordillera Central and flows through the Yaque del Norte Valley to the Atlantic Ocean. Its watershed has an area of 7,044 km². # Yuna. It is 209 km long. Its sources are in the Cordillera Central and flows to the east through the Vega Real and to Samaná Bay. Its watershed has an area of 5,498 km². # Yaque del Sur. It is 183 km long and its sources are in the Cordillera Central. It flows to the south into the Caribbean Sea. Its watershed has an area of 4,972 km². # Ozama. It is 148 km long. Its sources are in Sierra de Yamasá (a branch of the Cordillera Central). It flows into the Caribbean Sea. Its watershed has an area of 2,685 km². The city of Santo Domingo is on both sides of this river. # Camú. It is 137 km long. Its sources are in the Cordillera Central and flows into the Yuna River. Its watershed has 2,655 km². # Nizao. It is 133 km long. Its sources are in the Cordillera Central and flows to the south into the Caribbean Sea. Its watershed has an area of 974 km². # San Juan. It is 121 km long. Its sources are in the Cordillera Central and flows to the south through the San Juan Valley; it is the main tributary of the Yaque del Sur River. Its watershed has an area of 2,005 km². # Mao. It is 105 km long. Its sources are in the Cordillera Central and flows to the north into the Yaque del Norte River. Its watershed has an area of 864 km². The Artibonite River is the longest river of the island but only 68 km are in the Dominican Republic. The largest lake of the Hispaniola, and of the Caribbean, is the Lake Enriquillo. It is in the Hoya de Enriquillo with an area of 265 km². There are three small islands within the lake. It is around 40 meters below sea level and is a saline lake with a higher concentration of salt than the sea water. Others lakes are Rincón (fresh water, area of 28.2 km²), Oviedo (brackish water, area of 28 km²), Redonda, Limón. ==References==",
 "title": "Geography of the Dominican Republic"
}