{
 "id": "835627",
 "text": "The fauna of Australia is different from that of Asia. Some 83% of mammals, 89% of reptiles, 90% of fish and insects and 93% of amphibians that inhabit the continent are endemic to Australia.Williams J. et al 2001. Biodiversity, Australia State of the Environment Report 2001 (Theme Report) , CSIRO Publishing on behalf of the Department of the Environment and Heritage, Canberra. The fauna is quite different from that of New Zealand, but is similar to that of New Guinea. That comes about because New Zealand is a volcanic oceanic island with no historical connection with Australia. Its animals have not come from Australia. On the other hand, New Guinea is an island on the same continental plate as Australia, and on the same side of the Wallace line. This was discovered by Alfred Russel Wallace, and explained in a famous series of books.Wallace A.R. 1880. Island life. Macmillan, London.Wallace A.R. Geographical distribution of animals Macmillan, London.Wallace A.R. 1869. The Malay archipelago. Macmillan, London. These two huge islands were both part of the ancient continent of Gondwana, and were not (until modern times) inhabited by animals from Asia. As Gondwana broke up, its two main pieces had marsupial mammals. Eutherian mammals had not arrived from Eurasia. This high level of endemism is explained by the continent's long geographic isolation and its tectonic stability (few earthquakes, volcanoes and recent mountain formations). Australia has few placental mammals. Marsupials occupy many of the ecological niches which placental animals occupy elsewhere in the world. Marsupials are a group of mammals that raise their young in a pouch, including the macropods, possums and dasyuromorphs. Australia is home to two of the five known species of monotremes and has numerous venomous species, which include the platypus, spiders, scorpions, octopus, jellyfish, molluscs, stonefish, and stingrays. Uniquely, Australia has more venomous than non-venomous species of snakes. The settlement of Australia by Indigenous Australians was between 48,000 and 70,000 years ago.Flood, Josephine 2004. Archaeology of the Dreamtime, J.B. Publishing, Marleston, p283 Research in 2011 using DNA suggested an arrival around 50,000 years ago. Europeans came from 1788, and significantly affected the fauna. Hunting, the introduction of non-native species, and land-management practices involving the modification or destruction of habitats have led to many extinctions. Some historical examples include the paradise parrot, pig-footed bandicoot and the broad-faced potoroo. Unsustainable land use still threatens the survival of many species. To protect the survival of its fauna, Australia has passed wide-ranging federal and state legislation and established protected areas. == References ==",
 "title": "Fauna of Australia"
}