{
 "id": "835879",
 "text": "The Action Max is a home video game console. The games that run on it came on VHS tapes. It was made in 1987 by Worlds of Wonder. Its release was limited outside the United States. ==Gameplay== The Action Max requires a VCR because it cannot play VHS tapes. Light guns are used to simulate shooting the screen. The games are played by getting or losing points depending on how good the shots are, making it not possible to win or lose. The system lost popularity quickly because of this and the only games for it were light gun games of different themes that play the same way every time. The red sensor must be placed on the bottom right corner of the television screen. The games contain a black circle there that flashes white quickly when something can be shot. The targets flash at the same time. These are used to see if something has been hit. The targets that flash the exact same are enemies, adding points. The targets that flash wrong are friendly, losing points. All of this allows games to be stored on any format, not just VHS, as long as the video is made to work with the light gun. == Games == Five VHS tapes came out for the system: *.38 Ambush Alley, a police target range. *Blue Thunder, based on the 1983 movie. *Hydrosub: 2021, a futuristic underwater voyage. *The Rescue of Pops Ghostly, a comic haunted-house adventure. *Sonic Fury, aerial combat, came with the system. A planned sixth cassette, Fright Night (possibly based on the 1985 horror movie of the same name), did not come out because the Action Max was discontinued. ==Technical specifications== *CPU: HD401010 *Sound: internal speaker *2 character, 7 segment LED score display ==Related pages== *Control-Vision an unreleased video game console that uses VHS tapes *View-Master Interactive Vision, another video game console that uses VHS tapes ==References== == Other websites == * Action Max Calibration Screen * Action Max on OLD-COMPUTERS.COM * Action Max Emulator * Feature titled \"THE MOST BIZARRE CONSOLE FLOPS IN GAMING HISTORY\" by ADAM JAMES at SVG.com Category:Video game consoles",
 "title": "Action Max"
}