{
 "id": "83597",
 "text": "During World War II, the Nazis, led by Germany, started wars and committed terrible crimes against many countries and people. After the war ended in 1945, countries like the United States, Britain, the Soviet Union, and France decided to hold trials to punish the Nazi leaders who were responsible. These trials were called the Nuremberg Trials and took place in Nuremberg, Germany. The trials lasted from November 1945 to October 1946. They focused on 22 top Nazi leaders and six organizations. The judges said it was wrong to start wars and cause so much suffering. They also looked at the Holocaust, where the Nazis killed millions of Jewish people and others in horrible ways. The judges called it one of the worst crimes in history. The Nuremberg Trials weren’t just about punishment. They were also about showing the world what happened during the war and making sure people understood how serious these crimes were. Later, more trials were held to punish others who were involved in the crimes. These trials were important because they created new rules to prevent such crimes in the future. They also showed that even powerful leaders would face justice if they broke international laws. ==The main trial== The International Military Tribunal was opened on October 18, 1945, in the Supreme Court Building in Berlin. Judge Nikitchenko from the USSR presided over the first session. The prosecution brought criminal charges against 24 major war criminals and six criminal organizations: # The leadership of the Nazi Party # The Schutzstaffel, or SS (a Nazi paramilitary organization) # The Sicherheitsdienst, or SD (the intelligence agency for the SS and the Nazi Party) # The Gestapo (the Nazi secret police) # The Sturmabteilung, also called the SA, Storm Troopers, or Brownshirts (the Nazi Party's militia) # The High Command of the German armed forces (OKW) The indictments were for: # Working with other people to commit a crime against peace (legally called \"taking part in a conspiracy\") # War crimes # Crimes against humanity # Planning, initiating and waging wars of aggression and other crimes against peace The 24 accused were: \"I\" indicted \"G\" indicted and found guilty \"O\" Not Charged Name Count Count Count Count Sentence Notes 1 2 3 4 Martin Bormann I O G G Death Successor to Hess as Nazi Party Secretary. Sentenced to death while not being at the courtroom. His body was found in 1972. Karl Dönitz I G G O 10 years Leader of the Kriegsmarine (the Navy) from 1943. Started the U-boat campaign. Became President of Germany after Hitler's death. In evidence presented at the trial of Karl Dönitz on his orders to the U-boat fleet to breach the London Rules, Admiral Chester Nimitz stated that unrestricted submarine warfare was carried on in the Pacific Ocean by the United States from the first day that nation entered the war. Dönitz was found guilty of breaching the 1936 Second London Naval Treaty, but his sentence was not assessed on the ground of his breaches of the international law of submarine warfare.President of the Reich for 23 days after Adolf Hitler's suicide. Judgement : Doenitz the Avalon Project at the Yale Law School Hans Frank I O G G Death Reich Law Leader 1933–1945 and Governor-General of the General Government in occupied Poland 1939–1945. Expressed sorrow. Wilhelm Frick I G G G Death Hitler's Minister of the Interior (1933–1943) and Reich Protector of Bohemia-Moravia (1943–1945). One of the writers of the Nuremberg Laws. Hans Fritzsche I I I O Acquitted Popular radio commentator and head of the news division of the Nazi Propaganda Ministry. Tried in place of Joseph Goebbels. Walther Funk I G G G Life Imprisonment Hitler's Minister of Economics. Succeeded Schacht as head of the Reichsbank. Released from prison due to ill health on May 16, 1957. Reichsmarschall Hermann Göring G G G G Death Commander of the Luftwaffe (1935–1945), Chief of the 4-Year Plan (1936–1945), leader of several departments of the SS, and Prime Minister of Prussia. Committed suicide the night before his execution. Rudolf Hess G G I I Life Imprisonment Hitler's deputy, flew to Scotland in 1941 to try to make peace with Great Britain. After trial he was sent to Spandau Prison and died there in 1987. Generaloberst Alfred Jodl G G G G Death Wehrmacht. Keitel's deputy and Chief of the OKW's Operations Division (1938–1945). Later exonerated by a German court in 1953. Ernst Kaltenbrunner I O G G Death Highest surviving SS leader. Chief of RSHA 1943–45, the central Nazi intelligence office. Commanded many of the Einsatzgruppen and several concentration camps. Wilhelm Keitel G G G G Death Head of Oberkommando der Wehrmacht (OKW) 1938–1945. Gustav Krupp von Bohlen und Halbach I I I ---- Major Nazi industrialist. CEO of Krupp AG 1912–45. Medically unfit for trial. The prosecutors attempted to substitute his son Alfried (who ran Krupp for his father during most of the war) in the indictment, but the judges ruled it was too close to trial. Alfried was tried in a separate Nuremberg trial for his use of slave labor, thus escaping the worst notoriety and possibly death. Robert Ley I I I I ---- Head of DAF, The German Labour Front. Killed himself on October 25, 1945, before the trial began. Konstantin Freiherr von Neurath G G G G 15 years Minister of Foreign Affairs 1932–1938, succeeded by von Ribbentrop. Protector of Bohemia and Moravia 1939–43. Resigned in 1943 after a dispute with Hitler. Released from prison because of ill health on November 6, 1954. Franz von Papen I I O O Acquitted Chancellor of Germany in 1932 and Vice-Chancellor under Hitler in 1933–1934. Ambassador to Austria 1934–38 and ambassador to Turkey 1939–1944. Although acquitted at Nuremberg, von Papen was classed as a war criminal in 1947 by a German de-Nazification court, and sentenced to eight years' hard labour. He was acquitted following appeal after serving two years. Erich Raeder G G G O Life Imprisonment Commander-in-Chief of the Kriegsmarine from 1928 until his retirement in 1943, succeeded by Dönitz. Released because of ill health on September 26, 1955. Joachim von Ribbentrop G G G G Death Ambassador-Plenipotentiary 1935–1936. Ambassador to the United Kingdom 1936–1938. Minister of Foreign Affairs 1938–1945. Alfred Rosenberg G G G G Death Racial theory ideologist. Later, Minister of the Eastern Occupied Territories 1941–1945. Fritz Sauckel I I G G Death Gauleiter of Thuringia 1927–1945. Plenipotentiary of the Nazi slave labor program 1942–1945. Dr. Hjalmar Schacht I I O O Acquitted Prominent banker and economist. President of the Reichsbank 1923–1930 and 1933–1938 and Economics Minister 1934–1937. Admitted breaking the Treaty of Versailles. Baldur von Schirach (standing) I O O G 20 years Head of the Hitlerjugend (Hitler Youth) from 1933 to 1940, Gauleiter of Vienna 1940–1943. Expressed sorrow. Arthur Seyß-Inquart I G G G Death Helped the Anschluß (joining Germany and Austria). Was briefly the Austrian Chancellor 1938. Deputy to Frank in Poland 1939–1940. Later, Reich Commissioner of the occupied Netherlands 1940–1945. Expressed sorrow. Albert Speer I I G G 20 Years Hitler's favourite architect, personal friend, and Minister of Armaments from 1942. As Minister of Armaments, he used slave labour from the occupied territories in weapons production. Expressed sorrow. Julius Streicher I O O G Death Gauleiter of Franconia 1922–1945. Incited hatred and murder against the Jews through his weekly newspaper, Der Stürmer. \\---- \"I\" indicted \"G\" indicted and found guilty \"O\" Not Charged The death sentences were carried out on 16 October 1946 by hanging using the inefficient American \"standard\" drop method instead of the long drop. The executioner was John C. Woods. The French judges suggested the use of a firing squad for the convicted military officials, as is standard for military courts-martial. However, Biddle and the Soviet judges did not agree. They said that the military officers acted so badly that they did not deserve to be treated as soldiers. The prisoners sentenced to imprisonment were transferred to Spandau Prison in 1947. Nuremberg principles is a document created as a result of the trial. It defines what a war crime is. The medical experiments conducted by German doctors and prosecuted in the so-called Doctors' Trial led to the creation of the Nuremberg Code to control future trials involving human subjects. Four organisations were charged as being criminal. Only the SS was found guilty. These organisations were found not to be criminal: * Reichsregierung, (the Reich government or Cabinet) * Oberkommando and Generalstab der Wehrmacht, (the High Command and General Staff of the Armed Forces) * Sturmabteilung (the Stormtroopers or \"Brownshirts\") ==Related pages== * Benjamin B. Ferencz * Nuremburg Follow-up Trials ==References==",
 "title": "Nuremberg Trials"
}