{
 "id": "836019",
 "text": "Kangleipak (present day Manipur) has one of the oldest, richest and deepest histories in the world. Culturally, Manipur has a very long and rich heritage. This list does not include the historical sites of Medieval Kangleipak (Medieval Manipur). Here is a list of the ancient sites found in the present day Indian state of Manipur: ==List== === Bihu Loukon === The Bihu Loukon () or the Chenglei Leipak () is an ancient star shaped mud fortress built in a prehistoric era. Archeological survey proved that it is much older than those structures in the Kangla. With the collective teamwork of the historians and the archeologists, the site is opined to be the place of dominion of the Chenglei dynasty (Chenglei Leipāk).Bihu Loukon @ Starforts.com === Imphal Polo Ground === The Imphal Polo Ground, originally known as the Mapal Kangjeibung (), is the oldest Polo Ground in the world. It has its earliest recorded history of existence right from 15th century BC (3500 years old). It is located in the hearts of Imphal, the present day metropolis of Manipur.Exploring The World's Oldest Polo Ground - Sportz TalkManipur: The place where polo was born? - Hindustan TimesExploring the World's Oldest Polo Ground - WorldAtlas === Kangla === Kangla () literally means the \"dry land\" or the \"antique land\" in the Ancient Meitei language. It is the centre of administration of the rulers of many dynasties, among which the Ningthouja dynasty appeared to be the most powerful in the History of Manipur. It has its earliest recorded history of existence from the 15th century BC.Kangla The ancient Capital of Manipur === Keke Moilang === The Keke Moilang () or the Kege Moirang () was a civilization and a southern province in Ancient Manipur. It was the kingdom dominated by the Moirang dynasty (starts from 52 BC) for more than 2000 consecutive years. It flourished in the shores of the Loktak lake.History of Moirang Moirang and Ebuthou Thangjing Part 5 === Khuman Leipaak === The Khuman Leipaak () was a historical place predominantly occupied by the Khuman dynasty as the region of their administration in Ancient Manipur. Its capital city was the Mayang Imphal, an ancient city in the left banks of the Imphal River. === Konthoujam Lairembi sacred site === The Konthoujam Lairembi gi Khubam () is a 3000 years old sacred site dedicated to goddess Konthoujam Lairembi of the ancient Meitei religion. It is characterized by the presence of the thick banyan groves, a temple structure, an ancient stone inscription and a pair of concrete Hiyang Hiren structures.Three millennia mythology still resonates at Konthoujam Lairembi By Phanjoubam Chingkheinganba === Manung Kangjeibung === The Manung Kangjeibung () is an ancient pologround located inside the Kangla. It is one of the three significant ancient playgrounds for the Sagol Kangjei, a primitive form of the modern polo in Ancient Manipur. === Willong Khullen === The Willong Khullen (), popularly known as the \"Stonehenge of Manipur\", is an early prehistoric megalithic site, found in the northern Manipur. Currently, less information is obtained for there is little archeological survey conducted at the site.Megalith structures of Willong remain withered : 04th dec12 ~ E-Pao! Headlines === Temple of Pakhangpa === The Temple of Pakhangpa () is an ancient temple built in the heart of the Kangla. The holy building is dedicated to Pakhangpa, a deity in the Meitei paganism. Recently, in 2010, the temple was re-built and consecrated in a completely modified architectural form due to severe damages in the former structure.Pakhangba temple consecrated amidst religious rituals : 20th feb10 ~ E-Pao! Headlines === Temple of Sanamahi === The Sanamahi Temple () is one of the oldest known sacred buildings in Manipur. It houses the staue of Lainingthou Sanamahi, the presiding household deity in Meitei paganism. === Temple of Thangching === The Temple of Thangching () is an ancient temple dedicated to Thangching, the presiding deity of Ancient Moirang and the progenitor of the Moirang dynasty, located in the hearts of present-day Moirang. It is mentioned in various epic sagas including the Khamba Thoibi. ==References== Category:Meitei culture Category:Archaeological sites in India",
 "title": "Ancient sites in Kangleipak"
}