{
 "id": "836167",
 "text": "A list of films produced in France in 1998. Title Director Cast Genre Notes Alice et Martin André Téchiné Juliette Binoche, Mathieu Amalric, Carmen Maura Drama Une chance sur deux Patrice Leconte Jean-Paul Belmondo, Alain Delon, Vanessa Paradis Action comedy Le Dîner de Cons Francis Veber Jacques Villeret Comedy Won 3 César & 2 Lumiere Awards, +4 nom. The Dreamlife of Angels Erick Zonca Élodie Bouchez, Natacha Régnier Drama Nomin. for Golden Palm, +14 wins, +9 nom. L'ennui Cédric Kahn Charles Berling, Sophie Guillemin Drama For Sale Laetitia Masson Sandrine Kiberlain Screened at the 1998 Cannes Film Festival L'inconnu de Strasbourg Valeria Sarmiento Ornella Muti, Charles Berling Thriller I Stand Alone Gaspar Noé Philippe Nahon Thriller drama 5 wins & 5 nominations Killer Darezhan Omirbayev Talgat Assetov Crime drama Kirikou and the Sorceress Michel Ocelot Doudou Gueye Thiaw, Maimouna N'Diaye, Awa Sène Sarr Animation 11 wins & 1 nomination Lautrec Roger Planchon Régis Royer, Elsa Zylberstein, Anémone, Claude Rich Biographical 3 wins & 3 nominations Louise (Take 2) Siegfried Élodie Bouchez Drama Screened at the 1998 Cannes Film Festival Madame Bovary Claude Chabrol Isabelle Huppert Entered into the 17th Moscow International Film Festival The Perfect Guy Olivier Ducastel, Jacques Martineau Virginie Ledoyen, Mathieu Demy Musical Entered into the 48th Berlin International Film Festival Place Vendôme Nicole Garcia Catherine Deneuve Crime drama 1 win & 13 nominations Riches, belles, etc. Bunny Schpoliansky Lola Naymark, Claudia Cardinale, Marisa Berenson Comedy The School of Flesh Benoît Jacquot Isabelle Huppert Entered into the 1998 Cannes Film Festival Sitcom François Ozon Dark Comedy 3 wins & 3 nominations Sombre Philippe Grandrieux Marc Barbé, Elina Löwensohn Drama 1 win & 1 nomination Taxi Gérard Pirès Samy Naceri Action comedy 3 wins & 5 nominations Tell Me I'm Dreaming Claude Mouriéras Screened at the 1998 Cannes Film Festival Those Who Love Me Can Take the Train Patrice Chéreau Pascal Greggory Drama Entered into the 1998 Cannes Film Festival Too Much (Little) Love Jacques Doillon Lou Doillon Comedy Entered into the 48th Berlin International Film Festival Train of Life Radu Mihăileanu Lionel Abelanski, Rufus Romance / War 9 wins & 4 nominations Les Visiteurs II Jean-Marie Poiré Jean Reno, Christian Clavier Fantasy / Comedy Category:1998 movies 1998 French",
 "title": "List of French movies of 1998"
}