{
 "id": "836142",
 "text": "Nation is a book by Terry Pratchett. It was published in 2008. Harper Collins published it. Unlike most of Terry Pratchett's books, it is set in a world that is like the real world and not a fantasy world. Pratchett wrote Nation for children to read. ==Setting== The world of Nation has an England and a France in it. It also has a \"Pelagic Ocean\", which is not really the Pacific Ocean. The story is set in the 1860s. ==Plot== Most of the story happens on an island in the \"Southern Pelagic Ocean\" after a giant wave kills almost all of the people who lived there. The people who lived on the island, and their culture, are \"the Nation\". The main character, a teenager named Mau, was on a canoe trip when the wave came, so he did not die. He comes back home to the island to find everyone gone. The other main character, an English girl called Daphne, was shipwrecked on the island by the wave. Soon, other people from other islands show up. Mau, Daphne, and the new people rebuild the Nation together. Meanwhile, the King of England and most of his family have died in an epidemic. Daphne's father is the next person in line to be King of England. There is an English ship looking for Daphne and her father. Mau had been on a trip to the Boys' Island to become a man. In the Nation, boys go to the island for thirty days to live alone. When they come back, they are given a ceremony that makes them men. The ceremony has a feast, tattoos, and ritual circumcision. The boy is supposed to leave his \"boy's soul\" on the boy's island, sail home, and then get a \"man's soul\" after his feast. Because Mao is in between being a boy and a man, he thinks he has no soul. Mao often thinks that he is like a hermit crab that has left one shell but not found another one yet. Because of this, Mao and other people wonder if demons and other evil spirits will get into Mao's body. Mau believes he can hear the voices of \"the Grandfathers\", who are old men whose spirits watch over the Nation. They order him around telling him to rebuild the Nation's god-anchors (altars) and perform the rituals and chants that made up the culture. Many of the characters in the book ask whether God or the gods are real because they allowed a bad thing to happen: the wave that killed so many people. Mau often says he doesn't think the gods exist, but he can see the god of death, Locaha, who talks to him. On the island, Mau, Daphne, and the refugees rebuild the farm and buildings on the island, defeat raiders and mutineers, and discover an underground museum that Mau's ancestors built. Daphne believes that the island had once been much bigger during the Ice Age and that the Nation's ancestors could build telescopes, eyeglasses, metal tools and ships that could sail long distances. Daphne believes that many of the stories and songs that Mau has told her are really about planets and sailing around the world. Daphne's father comes to the Nation looking for Daphne. Then the ship from England comes to the island looking for Daphne's father, and they crown him king of England. Mau and the other people in the Nation decide that they do not want to become part of the British Empire. Instead, they ask to join the Royal Society, the group of British scientists founded by Isaac Newton. Mau says any scientist from any other nation may come to the Nation to look at the very old museum. These scientists will pay the people of the Nation by teaching them everything they know. In an epilogue, the last chapter of the book, it is the twenty-first century. The Nation is full of scientists but has kept its own culture. An old man tells two young children of the Nation about Mau and Daphne and how to use an old telescope. ==Critical response== James Hynes of the New York Times thought the book was good. He liked the characters, the story, and the way the book looked at the way powerful countries treat smaller countries and religion. He called it \"both a high- spirited yarn and a subtle examination of the risks and virtues of faith.\" Zack Handlen of The AV Club thought the book was mostly good but had a few problems. He liked the story and characters and Terry Pratchett's use of humanism, which is a way of thinking about society. Nation won many awards: * 2008, Los Angeles Times Book Prize for Young Adult Literature winner * 2008, Sidewise Award for Best Long-Form Alternate History nominee * 2009, American Library Association, Top Ten Best Books for Young Adults *2009, Boston Globe- Horn Book Award for Fiction and Poetry winner * 2009, Locus Award for Best Young Adult Book nominee * 2009, Michael L. Printz Award for Excellence in Young Adult Literature Honor Book * 2009, Mythopoeic Fantasy Award for Children's Literature nominee * 2009, Odyssey Award nominee * 2010, July 15, Brit Writer's Award Published Writer winner * 2010 Carnegie Medal nominee * Guardian Children's Fiction Prize nominee == References == Category:2008 books Category:British young adult novels Category:Books by Terry Pratchett",
 "title": "Nation (novel)"
}