{
 "id": "836187",
 "text": "Claudius (10 May 214–September 270 AD) was Roman emperor from 268 to 270. After 269, he was called \"Gothicus\" because of his military victories against the Goths. == Early life == Claudius () may have come from Illyricum in the Balkans, part of the Roman Empire. Latin historians (the authors of the Epitome de Caesaribus and the Historia Augusta) wrote that Claudius was the son of the emperor Gordian III, or was related to the emperor Probus. These claims are not true. The Historia Augusta says that Claudius was a military tribune () in the army of the emperor Decius. After that, the Historia Augusta says that Claudius was leader of a Roman legion () in the time of the emperor Valerian. Next, the Historia Augusta says that Claudius was governor of all Illyricum () when Gallienus was emperor. The Latin historian Aurelius Victor and the Greek historian Zonaras wrote that Claudius was a tribune () at Ticinum (Pavia, Italy) in 268. == Emperor == Claudius became emperor in September or October 268. Soon afterwards his armies overcame the Alemanni in a battle at Lake Garda on the Italian Peninsula. Claudius got the title because of this success over the Germanic peoples. For the first winter of his reign (268–269) he may have been in Rome. In 269, Claudius was Roman consul. He and his armies overcame the Goths in a battle at Naissus (Niš, Serbia). After this, Claudius got the name , because of his victory over the Goths. == Death == In September 270, Claudius Gothicus died of plague in Sirmium (Sremska Mitrovica, Serbia). He was deified (made into a god), with the name in . == Family == Claudius Gothicus had a brother, Quintillus. In the time of the later emperor Constantine the Great, the Historia Augusta says that Claudius Gothicus had another brother with the name Crispus and a sister with the name Constantina. The Historia Augusta also says that Claudius had a daughter with the name Claudia. This is not true. == References == Category:214 births Category:270 deaths Category:3rd-century Roman emperors",
 "title": "Claudius Gothicus"
}