{
 "id": "836255",
 "text": "\"Treehouse of Horror XXIX\" is the 4th episode of The Simpsons 30th season. It was first broadcast on the Fox network on October 21, 2018. It is the 29th episode of the Treehouse of Horror series. The episode has three stories: \"Intrusion of the Pod-y Switchers\", \"Multiplisa-ty\", and \"Geriatric Park\". == Story == Before the first story, Homer Simpson wins an eating contest against Cthulhu. The Simpson family is later seen eating parts of Cthulhu. In \"Intrusion of the Pod-y Switchers\", a parody of Steve Jobs talks about making new types of iPhones. It is later shown that the Steve Jobs parody is actually an alien. He puts spores on Earth that make people turn into plants. Everyone in the town of Springfield is made as plants that look like them. They are taken to a planet without technology. In \"Multiplisa-ty\", Lisa gets dissociative identity disorder. She puts Milhouse, Nelson, and Bart in a room similar to a prison cell. When they get out of the cell, Lisa kills Milhouse and Nelson. Lisa tells Bart why she is angry: Bart made her fail a spelling test by changing the answers she put for it. She later chooses not to kill Bart. In \"Geriatric Park\", Mr. Burns starts a retirement home. The elderly people in it have their DNA mixed with dinosaurs' DNA. The elderly have been shown to be more healthy and stronger. Homer makes the temperature hotter, which makes the elderly turn into dinosaurs. Mr. Burns and many of the visitors are killed by the dinosaurs. The Simpson family tries to get away from their grandparents, Grampa and Jacqueline. Lisa learns that they can stop the dinosaurs by being nice to them. The family later gets away from the dinosaurs without being hurt. == Reception == About 2.95 million people watched the episode when it was first broadcast. Tony Sokol from Den of Geek thought that the episode was not as good as other Treehouse of Horror episodes. He said that the episode had some of the scariest characters (for example, Cthulhu, the dinosaurs) but there was not enough humor in the episode. Dennis Perkins from The A.V. Club said that they might have to stop making Treehouse of Horror episodes because it stopped being good. Jess Scheden from IGN thoguht that the writers of the episode were not trying to get success from making parodies of horror. Scheden said that the Treehouse of Horror episodes could be better if they had a different style (for example, the episode being an hour instead of 30 minutes, only one story instead of three). == References == == Other websites == * Category:The Simpsons (season 30) episodes Category:Treehouse of Horror Category:2018 television episodes",
 "title": "Treehouse of Horror XXIX"
}