{
 "id": "836283",
 "text": "\"Treehouse of Horror XXVIII\" is the 4th episode of The Simpsons 29th season. It was first broadcast on the Fox network on October 22, 2017. It is the 28th episode of the Treehouse of Horror series. The episode has three stories: \"The Exor-Sis\", \"Coralisa\", and \"MMM... Homer\". == Story == Before the first story, the Simpson family and other characters are shown as foods in a bowl for trick-or-treaters. In \"The Exor-Sis\", Homer gets a statue of Pazuzu from The Exorcist. He puts the statue in Maggie's room, which gets Maggie possessed by a demon. The Simpson family are the hosts of a cocktail party. Maggie goes to the cocktail party and kills many people there. A priest comes to their house and does an exorcism on Maggie. The demon comes out of Maggie and tries to possess Bart, but does not want to because Bart has \"the darkest soul\". In \"Coralisa\", Snowball shows Lisa a tunnel that takes them to a parallel universe. The parallel universe has the Simpson family with buttons on their eyes. Lisa becomes scared and goes back to her real family when they want to put buttons on her eyes. However, she goes back to the parallel universe when Homer tries to kill a snake with her saxophone. After a few days, the real family can not find Lisa. Bart finds the tunnel and goes to the parallel universe. Marge and Homer go to the universe to try to get Bart. Homer kills the fake Bart and the fake Homer dies trying to save Bart. Fake Marge turns into a creature similar to a spider and tries to hurt the real Homer. Homer makes the family from the parallel universe go to the real universe to do housecleaning. In \"MMM... Homer\", Homer accidentally cuts his finger off while he is grilling. Homer cooks and eats the finger, thinking it tastes great. He cuts and cooks other parts of his body. Marge learns that Homer is eating himself and takes him to a counselor. However, Mario Batali wants to cook the rest of Homer for ingredients for a restaurant. Homer dies and tells Jesus in Heaven that they are both being eaten by people (this is a reference to the eucharist, where people eat bread (Jesus' body) and drink wine (His blood)). == Reception == About 3.66 milion people watched the episode when it was first broadcast. Dennis Perkins from The A.V. Club thought that many parts of the episode had good design, but some parts would not be remembered well. Jesse Schedeen from IGN said that Treehouse of Horror episodes are usually not \"more memorable\" than a normal episode. However, Schdeen thinks that this episode is better than most Treehouse of Horror episodes, saying all of the stories were strong. Tony Sokol from Den of Geek said that it was \"a very funny episode\" and used words about Halloween to say how it is good, but not one of the best. == References == == Other websites == * Category:The Simpsons episodes Category:Treehouse of Horror Category:2017 television episodes",
 "title": "Treehouse of Horror XXVIII"
}