{
 "id": "836289",
 "text": "The wind phone () is a telephone booth in the town of Ōtsuchi in Japan. People go to the wind phone to say things to their family members or friends who have died. It was built by Itaru Sasaki, a garden designer, in 2010, after his cousin died. In 2011, after the 2011 Tōhoku earthquake and tsunami killed over 15,000 people in the area, he opened the wind phone so everyone could use it. Over 30,000 people have gone there since then. People have built copies in different countries, and there are books and movies about it. ==Background== In 2010, Itaru Sasaki, a garden designer from Ōtsuchi, learned that his cousin had cancer and had three months to live. After his cousin died, Sasaki built an old telephone booth in his garden in December 2010, so that he could feel a connection to his cousin by \"talking\" to him on the phone. He said that the wind phone was not related to religion, but helped him deal with the loss. He also said that he wanted his thoughs to be \"carried on the wind\". The wind phone is a white telephone booth with glass windows. Inside, there is a black telephone on a metal shelf. The telephone is not connected to anything. Next to the telephone, there is a book so visitors can write notes about the people that they miss. ==Opening== In 2010, a tsunami killed over 15,000 people in the area, including over 1,200 people in the town where Sasaki lived. After the tsunami, he opened the wind phone so that everyone could call their friends and family who had died. Now, it has been visited by over 30,000 people. On January 7, 2017, strong winds ripped off the roof of the wind phone and broke the glass doors. People in the area quickly helped to fix it on January 10, and the wind phone was fixed by the next day. In April 2018, Sasaki said that the wood and metal parts of the booth were damaged, and that he wanted to build a new booth that would not be damaged as fast. People gave money to buy a new booth, and Sasaki built the new, stronger booth in August 2018. ==Copies== Many copies of the wind phone have been built around the world. In Oakland, California, artist Jordan Stern built a wind telephone in February 2017, to remember the 36 people who died in the 2016 Oakland warehouse fire, including his friend. Altrúchas, an art group in Dublin, Ireland, built a wind phone (fón gaoithe) on a mountain named Two Rock in August 2017. The wind phone was built from old supplies, and they were not actually allowed to build it. It was destroyed for unknown reasons less than two weeks after it was set up. Altrúchas later said that the destruction was \"a strong statement from people that didn't like the project\", but that they would not let it \"take away from the positivity of the project\". Tomohiko and Kazuko Kutsuna, a married couple in Aichi Prefecture in Japan, built a red copy of the wind phone in 2018. It was called the \"phone of the sea breeze\" (shiokaze no denwa), and it was built to remember of one of Kazuko's students, an 18-year-old woman who died by suicide in 2009. Ten local artists helped to build a temporary wind phone in January 2020 in Provincetown, Massachusetts. In October 2020, Susan Vetrone and Steve Reed built a wind phone in North Carolina. Vetrone started the project when her mother died and she learned about the Ōtsuchi wind phone, saying: \"I wanted it to mirror – almost exactly if it could – the Japanese phone booth that brought so many people comfort.\" In March 2021, a wind phone was built on Aspen Mountain in Colorado. According to the artist, who did not give their name because they were not allowed to build it in a United States national forest, the wind phone was built to help people deal with deaths from the COVID-19 pandemic. In September 2022, Le fil du vent Chelsea wind phone was opened to the public, in Chelsea, Quebec. This unique resource was inspired by the Japanese example and offers a private refuge for the longings of grief to be heard, honoured and carried away on the wind. ==In books and movies== ===Books=== Sasaki, who built the Ōtsuchi wind phone, wrote a book titled Kaze no Denwa – Daishinsai Kara Rokunen, Kaze no Denwa o Tooshite Mieru Koto (The Phone of the Wind: What I Have Seen via the Phone in the Six Years Since the Earthquake) in 2017. The book was published by Kazama Shobo. The 2020 book The Phone Box at the Edge of the World by Italian writer Laura Imai Messina tells the story of a woman who loses her family in the Tōhoku tsunami and goes to the wind phone, where she meets a man and his daughter who have also lost a family member in the tsunami. The book was based by Messina's visit to the Ōtsuchi wind phone in 2011. The Phone Booth in Mr. Hirota's Garden, a 2020 book by Canadian writer Heather Smith, is a fiction version of the wind phone's story. Smith said that she wanted to write the book after she heard a National Public Radio podcast about the wind phone. She emailed Sasaki while she wrote the book, and said that it \"was a thrill to receive his blessing.\" ===Movies=== The 2019 Austrian short movie The Wind Phone, written and directed by Kristin Gerweck, is about seven fictional strangers who visit the Japanese wind phone. Gerweck wrote the movie when she learned about the wind phone after her grandmother's death, saying that it was a \"beautiful story\". Voices in the Wind () is a 2020 Japanese drama movie about a fictional high school student whose family died in the Tōhoku tsunami and who goes back to her town to visit the wind phone years later. The movie director Nobuhiro Suwa, who went back to Japan to make the movie, stated: \"Going there eight years later, you can't see much of the damage, it has been rebuilt. But people's feelings have not been fixed.\" ==References== Category:Buildings and structures completed in the 21st century Category:Buildings and structures in Japan Category:Iwate Prefecture Category:Monuments and memorials",
 "title": "Wind phone"
}