{
 "id": "836331",
 "text": "The Prehistory of Kangleipak or the pre-literary history of Manipur is the period of human history between the first use of stone tools by early men and the time just preceding Ancient Kangleipak (Antique Manipur).Archaeological Evidences - Manipur Science and Technology Council (MASTEC)Emergence Of Manipur As A Nation State Pre historic Manipur Part 1Emergence Of Manipur As A Nation State Pre historic Manipur Part 2Emergence Of Manipur As A Nation State Pre historic Manipur Part 3Emergence Of Manipur As A Nation State Pre historic Manipur Part 4Emergence Of Manipur As A Nation State Pre historic Manipur Part 5 Comparing with other regions of the world, the development process of the archaeological work in Manipur is of recent times. The pioneering work in archeology was initiated by O. Kumar Singh. Before his presence, there was little information on the existence of the stone culture of Manipur.Digging up Manipur’s archaeological past : An interaction with Dr. O.K. Singh - The Sangai Express - Largest Circulated NewsPaper in Manipur O. Kumar Singh is of the view that \"Pre-Historic people used to settle in the hills during the Paleolithic and Mesolithic (Hoabinhian) culture while Neolithic people lived in both hills and valley. They came down to the valley at least by about 2000 BC.\" On the basis of the characters of the tool industry, the prehistory of Manipur is broadly classified into three periods. ==Paleolithic period== Paleolithic period is the most primitive stone culture era. The Paleolithic period varies from place to place. In Manipur's neighbouring country Burma (Myanmar), the lower Paleolithic culture started from 750000 to 275000 BP. The Homo erectus (early Anyathian culture) began to settle on the banks of the Ayeyawaddy river in Burma in 750000 BCE. However, in case of Manipur, Paleolithic period started from 20,000 to 10,000 BCE. The stone culture of Paleolithic period were discovered from the five archeological sites, Songbu, Khangkhui, Machi, Nongpok Keithel Manbi and Singtom. * Songbu cave - Discovered in 1983, the rock type was found to be of fine quartzite sandstone. Stone tools discovered here are of two types, core tools and flake tools. The quantity of the flake tools (77.7℅) is much higher than those of core tools (22.2℅). The period of the existence of the stone culture at Songbu cave is fixed at 20,000 BP, belonging to the middle Paleolithic period. At the time of exploration, the nine types of artifacts discovered are: (1) Flake - 1, (2) Knife - 1, (3) Blade Hake - 3, (4) Point - 1, (5) Borer scrapper - 1, (6) Hand axe - 1, (7) Spilt pebbles - 1. * Khangkhui cave - Located in Ukhrul district, the rock type found is of limestone Cretaceous origin. Discovered in 1969, there are four caves in the Khangkhui, two on the western slopes and two on the eastern slopes. Cave number 1 and 2 are on the western and number 3 and 4 on the eastern slopes. Numerous stalactites are found hanging on the roof of the cave. Exploratory work started in 1969-1972 but was abruptly stopped due to unfavorable circumstances. The tools discovered are of two types, limestone tools (96.4℅) and sandstone tools (2.2℅). Bone tools were significantly found in the cave no. 3, especially of Cervus, Sus and Bonvines. Though some suggest that the age of the earliest existence of the stone culture at the Khangkhui to be around 15,000 BC, T.C. Sharma opined it to be around 30,000 BCE, belonging to the Upper or Late Paleolithic period. * Nongpok Keithelmanbi - Discovered the stone culture in 1982-1984, the Nongpok Keithelmanbi is an archeological site of Paleolithic period and post Paleolithic period (Mesolithic period). The exploration site was classified into Locality-1 (Mesolithic), Locality-2 (Paleolithic) and Locality-3 (Paleolithic). The site is estimated to be of Upper or Late Paleolithic period. Most artifacts are made of Quartzitic sandstone pebbles and few of chert. * Singtom - Discovered in 1989 in Chandel district of Manipur, 16 stone tools relics are collected from the site. These are (1) hand axe, (2) work flat pebble with round edge, (3) flaked pebbles, (4) blade, (5) flake, (6) pebble striker, (7) split pebble, (8) waste flake. All these are made up of Quartzitic sandstone. * Machi - Discovered in 1974 in Chandel district and Tengnoupal district of Manipur, this archeological site dates back to the period of early Stone Age and Lower Paleolithic period. ==Mesolithic period== The Mesolithic period (Hoabinhian period or post Paleolithic period or pre Neolithic period) has two remarkable archeological sites in Manipur. These are the Nongpok Keithelmanbi and the Tharon cave. * Nongpok Keithelmanbi - The locality-1 out of the three localities (sections) of this site belongs to the Mesolithic period, while the others belong to the Paleolithic period. Most tools are made of the Quartzitic sandstone. Seventy nine artifacts of mesolithic period are discovered in this site. These are:- (1) Chisel edge pebble tools, (2) Round edge pebble tools, (3) Pebble pick, (4) Scrapper, (5) Blade, (6) Split pebble, (7) Pebble with batter marks, (8) Pebble with ground faces, (9) Flake and (10) Manu port. Approximate time dates back to 4460+-120 BP. * Tharon cave - First exploration took place in 1979 by the State Archeology Department Government of Manipur, and again retaken in 1989, five caves were discovered so far. 39 mesolithic artifacts were discovered. These are:- (1) Chopping tools, (2) Hand adze, (3) Hand axe, (4) Pointed tools, (5) Scrapper, (6) Edge ground knife, (7) Quern, (8) Grinder, (9) twenty five unclassified ground pebbles. ==Neolithic period== The Neolithic period is the last of the three Stone Age periods. It has 4 archeological sites in Manipur.(PDF) Dikshit, K.N. and Manjil Hazarika. 2012. ‘The Neolithic cultures of Northeast India and adjoining regions: A comparative study’, Journal of Indian Ocean Archaeology, 7: ... These are (1) Napachik, (2) Laimanai, (3) Phunan, (4) Nongpok Keithelmanbi. * Napachik - Excavation discovered 116 artifacts of Neolithic period from the site in Wangoo village.Stratigraphy of Napachik excavation 1985 (after Singh 1997: 68) | Download Scientific DiagramPottery from excavation at Napachik, Manipur (after Singh 1993) | Download Scientific DiagramTripod ware legs from Napachik (after Singh 1997: 75) | Download Scientific Diagram * Laimanai - Excavation started in 1990 and discovered many more than 70 stone artifacts of Neolithic period.Corded Tripod wares from Laimanai (after Singh 1997: 77) | Download Scientific Diagram * Phunan - Discovered in October, 1967, though some artifacts of Neolithic period were discovered so far, there is no official excavation took place till now.Surface collection -Corded ware from Phunan hills, Manipur (after Singh... | Download Scientific Diagram& 10: Surface collection from Phunan hills, Manipur (after Singh 1993) | Download Scientific Diagram * Nongpok Keithelmanbi - Besides having the existence during the Paleolithic and Mesolithic periods, this site also houses stone artifacts of Neolithic period, including the corded wares and ill fired potteries.Pottery from excavation at Nongpok Keithelmanbi, Manipur (after Singh... | Download Scientific Diagram == Gallery == File:ARCHAEOLOGICAL SITES IN MANIPUR — TABLE 1.jpg File:ARCHAEOLOGICAL SITES IN MANIPUR — TABLE 2.jpg File:ARCHAEOLOGICAL SITES IN MANIPUR — TABLE 3.jpg File:ARCHAEOLOGICAL SITES IN MANIPUR — TABLE 4.jpg File:ARCHAEOLOGICAL SITES IN MANIPUR — TABLE 5.jpg == Bibliography == * ==Other websites== * * * PREHISTORIC ARCHAELOGY. Course Name: PREHISTORY. Paper No. & Title: B.A. / B.Sc. Honours 5 TH Semester (Theory) Topic No. & Title: - PDF Free Download * Cord-impressed Pottery in Neolithic-Chalcolithic Context of Eastern - [PDF Document] * youtube * (PDF) Dikshit, K.N. and Manjil Hazarika. 2012. ‘The Neolithic cultures of Northeast India and adjoining regions: A comparative study’, Journal of Indian Ocean Archaeology, 7: 98-148. * Manipur South The Earliest Archaeological Site * Digging up Manipur archaeological past interaction with OK Singh Part 1 By Wahengbam Pathou * Digging up Manipur archaeological past interaction with OK Singh Part 2 By Wahengbam Pathou * Cultural Heritage Complex 1 * Cultural Heritage Complex 2 * Cultural Heritage Complex 3 * Cultural Heritage Complex 4 * Cultural Heritage Complex 5 * Cultural Heritage Complex 6 * Cultural Heritage Complex 7 * Cultural Heritage Complex 8 ==References== Category:History of Manipur Category:Archaeological sites in India",
 "title": "Prehistory of Kangleipak"
}