{
 "id": "836491",
 "text": "The history of the Jews in Namibia spans a little over 150 years. Non-existent in Namibia before the 19th century, Jews played an important if minor role in the history of Namibia since that point in time, despite the fact that their population was always small. The most famous Namibian Jew was \"businessman, philanthropist and Jewish communal leader\" Harold Pupkewitz (1915-2012). ==History (19th century-1965)== In the mid-19th century, Jewish businessmen from Cape Town named the De Pass brothers became the first Jews in what is now Namibia when they established a trading post on the Nawaqualand Coast. The De Pass brothers began the Pomona Copper Company in Pomona, Namibia in 1861. After Namibia became a German colony in the late 19th century, more Jews came to Namibia for business, et cetera. However, under German rule, only about 100 Jews lived in Namibia, most of whom lived in Swakopmund. After the German defeat in World War I, the newly created League of Nations gave South Africa a mandate over Namibia. The Jewish population of Namibia (which had close relations with the Jews in South Africa) began increasing after this point, and there were 400 to 500 Jews living in Namibia (mostly in Windhoek) in 1965 (however, Jews were still less than one percent of the total White population in Namibia during this time). ==History (1965–present)== Because the League of Nations mandate for Namibia was cancelled by the United Nations and the fact that Namibia became independent, the Jewish population in Namibia dramatically declined since 1965, with only 60 to 100 Jews living in Namibia today. In spite of this very low number of Jews, Windhoek \"has a Hebrew congregation dating from 1917, a synagogue built in 1925, a Talmud Torah, a communal hall, an active Zionist movement supported by generous contributions, and the only Jewish minister in the territory.\" Other than at Windhoek, the only other place in Namibia today where Jews live in is Keetmanshoop, where about twelve Jewish families currently live. ==Related pages== * History of the Jews in Southern Africa * History of the Jews in South Africa * Religion in Namibia ==References== ==Other websites== * Community in Namibia - World Jewish Congress * Namibia -Jewish Virtual Library Jews Namibia",
 "title": "History of the Jews in Namibia"
}