{
 "id": "836401",
 "text": "Probus (19 August 232 – September 282) was Roman emperor from 276 to 282. == Early life == Probus () was born in Sirmium (Sremska Mitrovica, Serbia) in the Balkans, part of the Roman Empire. The Calendar of Philocalus (a Latin calendar), the Chronicon Paschale (a Greek chronicle), and the work of the Greek historian John Malalas all say that Probus was born on 19 August 232. The Historia Augusta (a Latin history) says that Probus's father's name was Maximus. However, another Latin history, the Epitome de Caesaribus, says that Probus's father's name was Dalmatius. The Epitome de Caesaribus also says this Dalmatius was part of the family of the emperor Claudius Gothicus. Neither the Historia Augusta nor the Epitome de Caesaribus are correct, and this information in both histories is fiction. The Historia Augusta also says that Probus had the name Valerius, which is not true. Probus was a soldier in the Roman army. The Historia Augusta says that Probus was in the army in the time of Valerian, and that Probus worked in the area of the Danube. Historia Augusta also says that Probus was in the army that fought against the emperors' enemies in Roman Africa and the Palmyrene Empire. (This information is probably not correct.) In the time of the emperor Marcus Claudius Tacitus, Probus was probably a governor of the East (). == Emperor == In summer 276, probably in July, Probus became emperor. At the time, he was in the eastern empire. (The Historia Augusta says that Probus became emperor in January that year, but this is not correct.) Probus was Roman consul for the first time in 277. The writing of the Justinianic Code may mean that Probus was in Sirmium on 5 May 277. From 277 to 278, Probus fought a war against the Germanic peoples. In 277, Probus got the name because of his successes against the Goths. Probus was Roman consul for the second time in 278 and consul for the third time in 279. In 279, Probus fought wars against the Isaurians in Asia Minor and against the Blemmyes in Roman Egypt. From October 279, Probus had the names , , (or ) because of his successes against the Goths, against other Germanic peoples, and against the Sasanian Empire (the Persians). Between 280 and 281, there was a civil war in Roman Europe. Bonosus and Proculus made themselves emperors. The Historia Augusta says that this was at Colonia Agrippina (Cologne), but this may not be correct. Not long after this, Probus's armies overcame the armies of Proculus and Bonosus at Colonia Agrippina. Bonosus may have killed himself and Probus may have executed Proculus. Probus was Roman consul for the fourth time in 281. In around 281, there was a rebellion in Roman Britain. The rebellion was stopped for Probus by Victorinus. The Latin histories of Jerome say that around 281, there was another rebellion in Antioch. There, Saturninus made himself emperor. The Greek historian Zosimus wrote that Saturninus was the governor of Roman Syria. Jerome wrote that soldiers in Saturninus's army murdered him at Apamea in Roman Syria. Around the end of 281, Probus held a triumph in Rome. Probus was Roman consul for the fifth time in 282. == Death == Soldiers of the Roman army murdered Probus at Sirmium in autumn 282, probably in August or September. The Historia Augusta says that he was buried in a mausoleum in Sirmium. There may have been a damnatio memoriae on Probus, and the Romans removed his name from some inscriptions. Later however, possibly in the time of the emperor Diocletian, the Romans deified Probus (making him into a god). He got a new name in . == Family == The Historia Augusta says that Probus had a sister with the name Claudia. This may be fiction. == References == Category:232 births Category:282 deaths Category:3rd-century Roman emperors",
 "title": "Probus (emperor)"
}