{
 "id": "837041",
 "text": "Student of the Year is a 2012 Indian Hindi-language coming-of-age romantic comedy-drama movie directed by Karan Johar, based on a story by Johar and a script by Rensil D'Silva and Niranjan Iyengar, and produced by Hiroo Yash Johar under the banner of Dharma Productions and Gauri Khan under Red Chillies Entertainment. The movie stars Sidharth Malhotra, Alia Bhatt and Varun Dhawan in the lead roles, and Rishi Kapoor, Sana Saeed, Ronit Roy, Sahil Anand, Ram Kapoor and Farida Jalal are all playing major supporting roles, with Boman Irani, Kajol, Farah Khan and Vaibhavi Merchant in guest appearances. This movie marks the debuts of Sidharth Malhotra, Alia Bhatt and Varun Dhawan. Notably, this is also the first of several collaborations of Bhatt and Dhawan. The film's plot is this - The friendship of Abhi (Sidharth Malhotra) and Rohan (Varun Dhawan) is shaken when Abhi falls for their mutual friend, Shanaya (Alia Bhatt). Student of the Year was released on 19 October 2012 in over 1400 locations across India. The movie received positive reviews and was successful at the box office as well as one of the highest-grossing Bollywood movies of 2012.Boxofficeindia.com . Boxofficeindia.com. An unrelated sequel, Student of the Year 2, was released on 10 May 2019, starring Tiger Shroff alongside debutantes Tara Sutaria and Ananya Panday. Bhatt made a special appearance in the music video of a song in the end credits. The sequel didn't do as well as this movie but it was still successful at the box office. ==Cast== * Sidharth Malhotra as Abhimanyu \"Abhi\" Singh * Alia Bhatt as Shanaya Singhania * Varun Dhawan as Rohan \"Ro\" Nanda * Rishi Kapoor as Dean Yogendra Vashishth * Sana Saeed as Tanya Israni * Sahil Anand as Jeet Khurana * Manasi Rachh as Shruti Pathak * Kayoze Irani as Kaizad \"Sudo\" Sodabottleopenerwala * Manjot Singh as Dimpy * Ronit Roy as Coach Karan Shah * Ram Kapoor as Ashok Nanda * Gautami Kapoor as Gayatri Nanda * Farida Jalal as Mrs. Singh * Akshay Anand as Mr. Singh * Manini Mishra as Geeta Singh * Prachi Shah as Mrs. Shah * Nandini Sen as Mrs. Singhania * Boman Irani as Harkishan Sanon * Sushma Seth as Mrs. Vashishth (special appearance) * Farah Khan as a judge in \"The Disco Song\" (special appearance) * Vaibhavi Merchant as a judge in \"The Disco Song\" (special appearance) * Kajol in \"The Disco Song\" (special appearance) ==References==",
 "title": "Student of the Year"
}