{
 "id": "837034",
 "text": "Nippon musekinin jidai (ニッポン無責任時代, Irresponsible Era of Japan) is a 1962 Japanese comedy film directed by Kengo Furusawa. It became one of the most popular comedy films in Japan with the box office earning around ¥350 million ($3,343,567.50 in US dollar). The Crazy Cats comic jazz band and their featured singer Hitoshi Ueki did not invent the local genre of the \"salaryman\" comedy but they were its face in the 1960s. This film established Ueki's comic persona as a salaryman who would goof off at work and yet somehow always come out ahead, every so often bursting into one of his well-known Japanese folk- inflected songs while dancing something like the twist. The first in a series of \"Irresponsible\" films whose comic songs formed the soundtrack of Japan's high economic growth. == Overview == This movie was shot in color and cinemascope (TohoScope). The musical themes are \"Irresponsible Ichidai Otoko\" and \"Hello, Until Then\". This was the first memorable movie of the Crazy Movie series. The Crazy Cats, which became popular on \"Shabontama Holiday\" (Nippon TV) at that time, especially Hitoshi Ueki's big hit appearance on \"Sudara Bushi\". The series involved three main actresses (Sonomi Nakajima, Noriko Shigeyama, Reiko Dan), but it became unexpectedly popular, and 30 more were produced up to \"Nippon ichi no shokku otoko\" (directed by Takashi Tsuboshima) in 1971. In this play, Yasuo Tanami, who was an employee of the Toho Literature Club at the time, was originally involved in planning the President's Series, wrote the draft of the \"Irresponsible Employee\" as the antithesis of a loyal member of the company. They sold it as a project for a movie starring Frankie Sakai, but the idea was scrapped due to poorly script writing, and when he left it as it was, producer Eizaburō Adachi asked Tanami to make a movie named after the success of Crazy Cats' music hit \"Sudara Bushi\", and he began to write the screenplay. When it was released, it was agreed, and it was a scenario where Crazy Cats members were assigned to act in the film. == Plot == The average Kuchihaccho and Tehaccho (Taira Hitoshi) heard the story of Pacific sake riding in the bar \"Madrid\". Hitoshi's first job, when he mentioned the name of a senior in his hometown to the president of Pacific Sake and worked in the general affairs department, was to acquire the president of Toyama Shoji, a major shareholder. Success with a single check. Shimbashi geisha Manmaru is also cholera with his great ability, and promotion to chief of staff is a completely easy business. However, as Mika Tenka often said, Hitoshi was immediately fired when he learned that the kidnapper, Yuto Kuroda, had acquired Toyama's property. Kuroda's brain is Ryosuke Oshima, president of Sankai Foods, but his daughter Yoko ran away with her boyfriend Takasaku Ujiie. By the way, Hitoshi met Kuroda at the new president's inauguration party, but he returned with the outside director due to the skill of the show and the banquet. It is an unfortunate story for employees on the Taihei side that the traditional Pacific sake will become a subsidiary of Sankai Foods. On the other hand, Kyoko, a geisha, and Aiko, a liquor secretary from the Pacific, ran to Tonton's boarding house and began to guess love. Hitoshi is fluttering with Aiko's fierce kiss. Around this time, Kuroda, who visited the Oshima Residence, cut the story of his daughter Yoko's marriage and discovered that he had a favorite partner, Takasaku Ujiie. Hitoshi's next job is to buy hops from Hokkai Bussan, a Pacific liquor business. Hitoshi captured the president of the North Sea, Ishikari, who could not eat even if it was boiled or baked, with a pink film and a naked tatami in the room. However, Hitoshi, who simply doesn't wake up when he falls, discovers that Oshima and Kuroda are injured by Yoko's marriage and urges Ujiie's president to return to work, using Yoko's whereabouts as a seed. Who knows that Hitoshi, who appeared in a black tie at the Ujiie and Oshima families' wedding ceremony that day, is the new president of Hokkai Bussan! == Cast == * Hitoshi Ueki as Hitoshi Taira (Average salary man & main character) * Hajime Hana as Yusaku Ujiie (President of Pacific Sake) * Kei Tani as General Manager of General Affairs Department Yata (Director of \"Pacific Sake\") * Sonomi Nakajima as Kyoko Asada (Madam of the \"Madrid\" Bar) * Noriko Shigeyama as Aiko Sano (\"Ohira Western Liquor\" President's Secretary) * Reiko Dan as Manmaru (Geisha) * Yôko Fujiyama as Yoko Oshima (daughter of Ryosuke) * Tôru Minegishi (credited Kenji Mine) as Takasaku Ujiie (son of Yusaku) * Takashi Inagaki as Uemura (Yoko's matchmaking partner) * Jun Tazaki as Yūjin Kuroda (President of \"Kuroda Bussan\" → New president of \"Ohira Yoshu\") * Tôru Yuri as Kumagoro Ishikari (President of \"Hokkaido Bussan\") * Tatsuo Matsumura as President Toyama (main shareholder of \"Pacific Sake\") * Gen Shimizu as Ryosuke Oshima (president of \"Sankai Foods\") * Asami Kuji as Tokiko Ujiie (Yusaku's wife) * Chieko Nakakita as Sakiko (housewife in a pension) * Hiroshi Inuzuka as Otsuka (\"Ohira Western Liquor\" employee) * Êtarô Ishibashi as Sakura (〃) * Senri Sakurai as Aoki (〃) * Shin Yasuda as Yasui (〃) * Kenzô Tabu as Detective in plain clothes * Akira Hitomi as Kenkichi (pension master) * Hiroyo Miyata as Traffic police officer * Daisuke Inoue as Haruki (bartender) * Shiro Tsuchiya as Uemura's father * Yasuzo Okawa as Driver of President Ujiie * Yaeko Izumo as Apartment neighbor * Hiromi Mineoka as Hana (maid of the Ujiie family) * Yuki Shimizu as Ohira Western liquor employee * Terumi Oka as Employees chasing volleyball * Sumie Miyagawa as Corner of a Café Hall * Yutaka Oka as Funeral receptionist * Yasuo Araki as Incense thief * Yoshie Kihira as restaurant lady Nakai * Chie Sugiura as Oshima family maid * Wakako Tanabe as Madrid hostess * Kazuko Ejima as Restaurant costumers * Kazuko Tani as Madrid waitress * Hiromi Terazawa, and Kiyoko Hara as Two geishas * Saburō Kadowaki as Ohira Western Liquor Employee * Eisaburo Komatsu as Man at the station * Kiyoshi Kodama as a Taxi driver (non-credited) * Yoshio Ouchi, Akinori Kuchina, and Yoshio Yasumoto as Takasaku's bandmates ※ Uncredited * Jun Kuroki as Public bath guest * Akira Kitchoji as Attendees at the funeral of former minister Ichiro Matsuyama * Miki Yashiro, Bin Furuya, Ryoji Shimizu, Yukio Kawamata, Fumiko Takano, Hideo Shibuya, and Yōichirō Kitagawa as a Employees of Pacific Sake's general affairs department * Shizuko Azuma as The waitress at the banquet == Staff == * Producers: Eizaburō Adachi, Shin Watanabe (entertainment producer) * Executive Producer: Shin Morita * Screenwriters: Hiroshi Matsuki (screenplay), Yasuo Tanami (screenplay) * Director: Kengo Furusawa * Cinematographer: Takao Saitô * Music Composer: Yoshiyuki Kozu, Hiroaki Hagiwara (music arrangement), Yukio Aoshima (songwriter) * Production Designer: Kazuo Ogawa * Second Unit Director or Assistant Director: Yoshimitsu Banno (second assistant director), Masanobu Deme (third assistant director, Ken Sano (chief assistant director) * Sound Department: Akira Saitô (sound recordist), Hisashi Shimonaga (sound effects editor) * Stunt Coordinator: Ryû Kuze * Photographer: Masao Soeda == Theme songs / Insert songs == * All the lyrics are written by Yukio Aoshima and composed by Hiroaki Hagiwara. *Skinny Manbushi An original movie song is played when Hitoshi goes to the Ujiie family at night. Later sung in \"Sudara Gaiden\". In the trailer, it was \"Skinny Manbushi\", but in the OP credit, it was written as \"Skinny Patience Bushi\". *Don't Clause Hitoshi, who went to the Ujiie family, robs Takasaku of his guitar and sings. *Sudara Section Use number 2. After returning to the boarding house, Hitoshi throws out the betting ticket while climbing the stairs and sings while cleaning his suit. *Fifty Thousand Verses Hitoshi, who saw a pair of Takasaku and Yoko at the bar, muttered, \"Well, when I was a student,\" and first sang one phrase with a cappella, followed by a shout of \"Ah, that!\" With BGM, and was a guest at the same bar. Sing with Otsuka, Sakura, Aoki and Yasui. All lyrics are movie originals. * Hello, Until Then Hitoshi sings at the inaugural meeting of President Kuroda, and Otsuka, Sakura, Aoki, and Yasui act as back dancers. He used No. 1 and No. 3, but the lyrics have changed in the latter half of both. At first glance, it seems to be a stage, but in fact, it is a production peculiar to the Furusawa movie, that is, at the inaugural meeting. In the trailer, it is \"High Until Then\", but in the opening credit is written as \"High Until Then\". *Irresponsible First Generation Man The theme song of this work. It was played twice in total, and the second time, Hitoshi sang instead of congratulations at the wedding ceremony of Takasaku and Yoko, and Otsuka, Sakura, Aoki, and Yasui danced. == Location == * Sarugaku Bridge *In front of Ebisu station * Ebisu Station South * Daiwa Securities Co.Ltd. HQ (Used for the \"Pacific Sake\" building. A familiar place in the \"Shacho Series\") * Yokohama Prince Hotel (used for Takasaku and Yoshiko's wedding ceremony) * Hibiya Park * Aoyama Funeral Hall * Benkei Horibata * Sukiyabashi Intersection == Simultaneous screening == \"Kigeki ekimae onsen\" (Comedy Station Square Hot Spring) * Screenplay: Kihan Nagase / Director: Seiji Hisamatsu / Starring: Hisaya Morishige / Distributor: Tokyo Eiga Co., Ltd. The fourth installment of the \"Ekimae Series\". Since then, Industrial Spy Free for All (directed by Takashi Tsuboshima), \"Mahjong Madness\" will be coupled eight times in total with the Crazy Movie and \"Ekimae Series\".",
 "title": "Nippon musekinin jidai"
}