{
 "id": "837007",
 "text": "Chowkur is one the remotest Tibetan settlements surrounded by number of Indian Villages. It is in Taluk of Periyapatna of Mysuru District, Karnataka state in Southern India. Chowkur is small village specifically for the Tibetan refugees, who have escaped Tibet from Chinese Oppression in 1959. The area of the settlement is 5 km2 (4 sq. mi), which was allotted for first Tibetan refugees who migrated from North India. The pin code of Chowkur is 571107 of Periyapatna post. Chowkur has two camps with 80 houses ==History== Chowkur was formed in 1975, when many Tibetan refugees moved from northern part of India. Around 500 Tibetan refugees were relocated to Chowkur from Northern part of India such as Sikkim, Arunachal Pradesh, and Assam. Chowkur has two Tibetan settlements known as Rabtenling and Phuntsokling, which is also known as camp one and two. The settlement is named after a nearby place called Anna Chowkur. Government of Karnataka has provided housing facilities and field for cultivation to Tibetans with the help of other NGOs for the survival. During the early years, many of them survived with collecting woods from the nearby forest for cooking and slowly developed by owning gases. The history of Tibetan refugees settled in Chowkur itself is the history of its people as many does not know much about this remote settlement, not even other Tibetans. The history of Chowkur is recollection of memories of first-generation Tibetan refugee and official records. ==Population== The total population (2011) estimated is 700 number. Due to large number of Tibetan moving to west, the number of populations has been lessening. During the initial years, the population was less but, there was more birth rates in 80s and population increased. Today, the population can be estimated to 500 in decreasing number. The population record in Chowkur is collected by both Karnataka Government and CTA. The above estimated population record is referred in CTA population census. The population in other Tibetan settlement is more in number than Chowkur as the size of population has always been less. ==Language== The Official Language spoken in the neighboring area is Kannada, but the native Tibetan language is spoken by the residents. Due to social integration with other Indians, most of the Tibetan living in Chowkur are also fluent in Kannada as well. The younger generation speak Tibetan and Kannada in the region. Kannada is mostly used to communicate with Indians. ==Religion== The religion followed by Tibetan is Tibetan Buddhism. There is no single person from other religion live in this small remote settlement. Tibetan Buddhism was followed by first-generation Tibetans and was ascribed to their children and grandchildren. Chowkur has its own small area for prayers and to conduct religious activities. Most of the prayers are done in their respective homes as everyone reserves on room in their home as prayer room. ==Administration== Chowkur does not have any official office in its function. It is officially under Periyapatna Taluk but, the functioning office is in Bylakuppe under Central Tibetan Administration. Chowkur is registered officially under Indian Government but, the welfare of the people is looked by the branch of CTA office. Thus, Chowkur is associated with both Indian and Tibetan administration for its functioning. Both the functioning offices looks after the welfare of Chowkur. The electricity and water were provided by the Taluk Office and other needs were look after by CTA (Office in Bylakuppe). Thus, the school and nursery were looked after by the CTA. ==Accessibility== In the past, Tibetans used to go to the nearest market or bus stand by walk but, today the facilities have been improved. One can reach from Periyapatna bus stand. From Periyapatna, one must go by auto as Chowkur does not have bus facilities. It is 5 kms away from the nearest town, which is also a taluk of Chowkur. It takes 2 hours to reach Chowkur from Mysuru district. The nearest bus stand is Periyapatna, and nearest railway station is Mysuru Railway station. Chowkur does not have any Government transportation facilities and people use self-owned vehicle to travel to other places. On the west of Chowkur, there is another small village known as Panchavalli and one can reach Chowkur via Gonnikoppa. There is no direct bus or other public transportation to reach Chowkur from other towns or cities. So, the accessibility to Chowkur may seems little confusing to first visitors. ==Facilities== 1\\. Nursery and School: Chowkur has small School and nursery for its children. The school opened in 1984 and nursery in 1982 with 10 students. The facilities were not good during the initial days and students were taught under the trees. The construction of school was done in 1986. The construction of school was funded by Government of India. The School and nursery were especially for Tibetan refugees to get modern education. So far, total of 3000 have graduated from the school and nursery. The school has classes from 1to 4 with one office and three classrooms. Thereafter, the student move to town for further studies from class fifth. Today, the nursery remains open but, the school was closed due to a smaller number of joiners in admission. But , in the past, the school has provided educational facilities to many Tibetan refugees so they can get further education. 2\\. Community hall The community hall was provided for both the camps to perform certain activities such as meeting, functions, occasions, and other social gatherings related to the camp. Since both the camps share common social and culture background with similar social status, all the activities and social gatherings are done together in one community hall. The hall gives access to general meetings or official meetings done by Indian Government and CTA. Thus, the community hall provides facilities to the residents to conduct religious and cultural celebrations such as celebrating His Holiness Dalai Lama birthday, Tibetan New Year, and other important occasions. therefore, community hall facility plays an important role in livelihood of Tibetan refugees to preserve their culture and religion. ==Climate and Cultivation== The average climate of Chowkur is Tropical Wet and Dry, which is favorable for its residents. Tibetans were used to the cold weather as the place is surrounded by forest. There are trees surrounded by the place which gives cooling weather throughout the year except for summer. The climate remains suitable from July to February but, the summer from March to June becomes too hot for the residents. During monsoon season, people cultivate Maize and Ginger depending on natural rain or irrigation. Though nearby Indian village grows Tobacco Tibetans chose to grow maize and sell it to CTA Government. The cultivation facilities such as loan, tractor and others are provided by CTA of Bylakuppe branch. On an average, few people do cultivation and rest of them are dependent on other source of income. The irrigation facilities are also provided by the CTA office. ==Source of Income== Even though Tibetans do cultivation in Chowkur but, the main source of Income of the residents are Sweater business. It is common to know that majority of Tibetans in India do Sweater business for their living. Tibetan refugees do sweater business in different parts of India for six months, during the month of August to February. The business is carried out legally, following the rules and regulation of the nation[1]. Tibetans in Chowkur also consider sweater business as main source of Income for their livelihood. The members leave from the settlement in the month of August till February to earn for their family. The readymade sweaters are bought from Ludhiana, Punjab and are sold in different parts of India such as Kurnool, Nagpur, Tata Nagar, Ahmedabad etc. Chowkur is a quiet place to live and surrounded by nature’s beauty with small pound. Chowkurians travel to other towns to buy groceries or other shopping as the settlement does not have any shop to purchase things. At the back the east side of Chowkur, there is forest area which covers other Indian villages too. Category:Geography of Tibet",
 "title": "Chowkur"
}