{
 "id": "837182",
 "text": "Ētarō Ishibashi (, Ishibashi Êtarô, September 30, 1927 - June 22, 1994) was a pianist for Hajime Hana & The Crazy Cats, actor, and cooking expert. == Career == Born in Minato City, Tokyo in 1927, Ishibashi was the son of music composer Randô Fukuda and grandson of Meiji era painter Shigeru Aoki. He grew up in Oimachi area until he was three years old. His mother Chiyo was the fifth of eight siblings to the wealthy Ishibashi family. When Etaro was three years old, his father had an affair with actress Hiroko Kawasaki at a place where he went to write a film score. Rando married Kawasaki after separating from Etaro's mother. For this reason, Etaro returned to the home of his grandparents with his mother and took Ishibashi's surname. The Ishibashi Family at the time was holding up a sign from the Nito store, which runs a transportation business with 400 to 500 workers at Shiodome Station (which is the government-owned railway), and it said, \"I think the economy was good.\" After attending the Bunkai Jinjo Elementary School in Kyobashi, Ishibashi was transferred to the Hyosung Elementary School in 1939. While at Hyosung High School, he meet Senri Sakurai, who was a senior, and Hiroshi Inuzuka, a third- year student. In 1944, due to the intensification of Allied air raid attacks in Japan, he moved to the Jōshinji Temple in Setagaya with his mother and his maternal grandfather. In 1945, Ishibashi entered the School of Oriental Music (now Tokyo College of Music). After studying classical piano at the piano department, he switched to the vocal music department (Tetsuko Kuroyanagi was in the third quarter at this time). Around that time, Ishibashi left his mother and visited his father in Yugawara. Soon after, his mother filed a lawsuit in the Odawara court against her husband on behalf of the city, and the government had begun to considered Rando as criminal to the state. Ishibashi graduated from the School of Oriental Music in 1949. At that time, it was difficult to earn a living in the world of classical music, so he lived playing in a club in Shinbashi and teaching piano to the neighborhood children. In 1947, Ishibashi appeared as a member of the choir in Miho Nagato Opera Company's first performance, \"Madame Butterfly.\" A pianist of the band \"Honey Jokers\" dedicated to the expeditionary force club collapsed due to acute pneumonia. He participated in the audition to fill the vacancy and made his debut as a jazz man. Until then, Ishibashi began to like classical music and hated jazz, but the mighty meals of the expeditionary force club caught up with him and he turned to jazz lovers. Under the stage name George Ishibashi, he was a member of the military entertainment band stationed during the Korean War to perform in front of US and South Korean soldiers. There was a time when people recommended that Ishibashi travel to the United States to practice jazz, but at the time, he didn't have enough money.. Around this time, he suffered from chest problems and performed while battling the disease. Eventually, he formed his own band \"The Five\". After working on \"Hitoshi Ueki and the New Sounds Trio\", Ishibashi joined \"Hajime Hana and The Crazy Cats\" as a pianist in March 1956. At first, Ishibashi thought he should play, but from day one a basin was thrown at him and he had a female onnagata, so he often thought about committing suicide. In June 1960, he temporarily left his artistic endeavors due to surgery to reshape his six ribs due to tuberculosis, but returned in August 1961 and played piano with Senri Sakurai, who joined the members as his understudy. On December 31, 1970, he left Crazy Cats due to heart disease. During an interview with the Asahi Shimbun news article, he said \"If I quit smoking and went back to work in entertainment, they would tell me that I would not be satisfied with something.\" Ishibashi didn't like how he was retired from the entertainment world. In that same year, Ishibashi has been active as a culinary researcher and since 1967, he has run a \"Sangyo- dong\" sake and side dish shop in Sakuragaoka, Shibuya, Tokyo (he took over the shop originally run by his father, Rando). In 1988, all the Crazy Cats members appeared in the movie \"Company Story\", which was produced a long time ago. While the other six people included a lot of co-star scenes, it showed a memory scene of a colleague who had already died, a few seconds and only two cuts, and was a retired person. Although it can be mistakenly described as the appearance of a bank movie, he looks like an older person and wears the same company emblem as the main character around his neck. In 1994, Ishibashi died at the Showa University Hospital in Shinagawa, Tokyo due to heart failure caused by stomach cancer. He was 66 years old. Known as a drinker, he has even placed a bet and drank a bottle of sake. Also, \"Sangyo-dong\" was run by a widow, but it will be closed once at the end of October 2018 due to the redevelopment of the surrounding area. It was reopened near the old store in May 2019. == Films == * All films on IMDb Category:1927 births Category:1994 deaths Category:Japanese composers",
 "title": "Ētarō Ishibashi"
}