{
 "id": "837128",
 "text": "Varun Dhawan is an Indian actor who works in Hindi movies. Varun began his work in film industry in 2010 with the movie My Name Is Khan. He debuted his career as a lead role with Student of the Year with Sidharth Malhotra and Alia Bhatt. He became famous with lots of other movies such as the romantic comedies Main Tera Hero (2014), Humpty Sharma Ki Dulhania (2014), and Badrinath Ki Dulhania (2017). Later, Varun appears many commercially successful movies as a leading actor and some of which highest-grossing releases came such as ABCD 2 (2015) and Street Dancer 3D (2020). He was also given credit for Judwaa 2 (2018), and Sui Dhaaga (2018). However, the success of the eleven movies he had was followed by flops of his later movies Kalank (2019), Street Dancer 3D (2020), Coolie No. 1 (2020) and Jug Jugg Jeeyo (2022). == List of movies/films == ===Refers to=== Movies that have not yet been released ===As an Actor=== Year Movie Role(s) 2010 My Name Is Khan — Throwback photos of Varun Dhawan and Sidharth Malhotra from the sets of ‘My Name Is Khan’ as ADs are pure gold! 2012 Student of the Year Rohan \"Ro\" Nanda 8 Years Of Varun Dhawan: Rohan Nanda From 'Student Of The Year' To Raghu From 'Badlapur', Memorable Characters Of The Actor 2014 Main Tera Hero Sreenath \"Seenu\" Prasad 8 Years Of Varun Dhawan: Rohan Nanda From 'Student Of The Year' To Raghu From 'Badlapur', Memorable Characters Of The Actor Humpty Sharma Ki Dulhania Rakesh \"Humpty\" Kumar Sharma Alia Bhatt marks 7 years of ‘Humpty Sharma Ki Dulhania’ with special memories 2015 Badlapur Raghav \"Raghu\" Purohit Varun Dhawan: No One Thought I Could Pull Off a Badlapur ABCD 2 Suresh \"Suru\" Mukund ABCD 2 Plot Summary Dilwale Veer Randhir Bakshi Dilwale Spoiler From Varun Dhawan: Romance, Action, Drama With a Twist 2015 Dishoom Junaid \"J\" Ansari Dishoom, Like 24, Has Been Shot in Real Time. Clock's Ticking For Real 2017 Badrinath Ki Dulhania Badrinath \"Badri\" Bansal Badrinath Ki Dulhania Box Office Collection Day 14: Alia Bhatt, Varun Dhawan's Film 'Hits A Century' Judwaa 2 Raja Kashi Patekar & Prem Malhotra Today's Big Release: Varun Dhawan's Judwaa 2 2018 October Danish \"Dan\" Walia What Varun Dhawan Says About October Being Snubbed In Awards Season Nawabzaade Himself Nawabzaade: Varun Dhawan, Shraddha Kapoor Are Back Together With High Rated Gabru Redux Sui Dhaaga Mauji Sharma Sui Dhaaga: Varun Dhawan Is A Bonafide Tailor. Here's Proof 2019 Kalank Zafar Chaudhary Varun Dhawan On Kalank Failure: 'It Was A Bad Film, It Let Down People' 2020 Street Dancer 3D Sahej Singh Narula Street Dancer 3D First Look: Varun Dhawan Is Set For The Battle And How Coolie No. 1 Raju Coolie / Kunwar Raj Pratap Singh Coolie No 1 Trailer: Varun Dhawan, Sara Ali Khan's Comedy Of Errors Is High On Energy 2021 Antim: The Final Truth Himself 'Antim: The Final Truth' box-office day 6: The Mahesh Manjrekar directorial starring Salman Khan collects Rs 2.15 crore on Wednesday 2022 Jug Jugg Jeeyo Kuku Jug Jugg Jeeyo: Kiara Advani And Varun Dhawan's Film Gets A Release Date Bhediya Bhaskar Varun Dhawan And Kriti Sanon's Bhediya Is \"Not A Werewolf Film\": Screenwriter Niren Bhatt 2023 Bawaal Ajay Dixit Varun Dhawan and Janhvi Kapoor to shoot for ‘Bawaal’ in Paris Rocky Aur Rani Kii Prem Kahaani Cameo appearance in song \"Heart Throb\" 2024 Munjya Varun Dhawan and Janhvi Kapoor to shoot for ‘Bawaal’ in Paris == References == Category:1987 births Category:Living people Category:Indian movie actors Category:Actors from Mumbai",
 "title": "Varun Dhawan"
}