{
 "id": "837173",
 "text": "Senri Sakurai (桜井センリ, Sakurai Senri, March 20, 1926 - November 10, 2012) is a Japanese musician, comedian and actor. His real name was Chisato Sakurai (桜井 千里, Sakurai Chisato). == Career == Although he was born on March 20, 1930 in the official profile, Sakurai was actually born in 1926. This is said to be in balance with other members of Crazy Cats (Shin Yasuda was born in 1932). As a result, Yasuda is younger than Êtarô Ishibashi and Hiroshi Inuzuka, who are third-year students from the old high school. Born in London, England where his father was assigned as his previous name, Henry Sakurai, he grew up there until he was three years old. Senri is a Kikokushijo or overseas children. His father is the representative secretary of the Japanese Association company. It is said that after returning to Japan, his name was changed to Senri, but there is also a document that the real name was originally Chisato Sakurai. He entered the Nishisugamo Third Normal Primary School and attended the Ueno Children's Music Academy attached to the Tokyo School of Music from the fourth grade to learn classical piano. After attending the Gyosei Junior and Senior High School, Sakurai entered the Faculty of Political Economy at the Waseda University. When Sakurai was in his sophomore year of college, a group called the \"Sun Valley Swing Band\" asked him to be a pinch hitter, and after that, he officially joined and started working as a jazz pianist. After leaving college, he moved into various bands. In 1952, Toshiko Akiyoshi went to the United States and participated in the Gay Stars, where the pianist was absent, and Sakurai take over the group for her. After that, he formed a trio with Yasumitsu Suzuki and Akira Fukuhara, but at the invitation of Frankie Sakai, he joined the jazz band \"Frankie Sakai and City Slickers\". At this time, he met Kei Tani, who was a member at the time, as well as Hitoshi Ueki. After leaving the City Slickers a year later, he joined Toriro Miki's Joke Studio and taught singing and composition. His stage name at that time was Hinaro Miki (三木雛郎, Miki Hinaro). Tonpei Hidari and Eileen Fagen are the song's disciples at the time. He joined the jazz band \"Hajime Hana and Crazy Cats\" in 1960 as pianist. He will take over Êtarô Ishibashi's place, who was being treated for tuberculosis. After returning to Ishibashi, Hitoshi Ueki and the others opined that they should leave, but Hajime Hana, the leader, persuaded the other members to officially join the group, saying, \"Because I became friends.\" In 1971, when Ishibashi left, Crazy Cats took the anomalous form of two pianists and began to perform controls that made use of the \"continuous bullets\" style (after that, Ishibashi often guest-starred on crazy The Bullet Series is standard). Ishibashi is said to be bold and Sakurai is said to be delicate. On the variety show Shabontama Holiday, the action with the great Hiroshi Inuzuka is famous. He has a history of songwriting activities and composed funky three singles like \"Nakanaka Not Found\", Mieko Hirota's single \"Looking at Tomorrow\" (both songs are written by Yukio Aoshima) under the real name Chisato Sakurai. He is also active as an actor and has appeared in many movies and television shows such as \"The Lovable Tramp\" (Shochiku) and \"Kureji ogon sakusen\" (Toho). Sakurai often played in Yoji Yamada's \"It's Tough Being a Man.\" He also active as a supporting actor on stage. The character \"Auntie Senri\" who appeared in the Dainihon Jochugiku Company commercial is also famous. The word \"Ruchonki\" Sakurai said in this commercial became a buzzword at the time. During his life, Sakurai had a deep knowledge of classical music and opera, and often wrote manuscripts for trade magazines. He also said that he had a daily routine to go to the piano for an hour to remember the feeling of playing. In 2006, he appeared in the movie \"Notebook of Life\" (directed by Makoto Itakura) as an employee of a consignment station at the Kotsunagi Station of Iwate Galaxy Railway Line. On April 27, 2007, he served as chairman of the funeral ceremony along with Tani and Inuzuka at the \"Farewell Party\" for Ueki. Kei Tani's funeral was held on November 11, 2010 is the last public venue. Sakurai was found dead at his home in Shinjuku-ku, Tokyo on November 11, 2012 by his landlord. As of the 12th, it is reported as a \"lonely death\" due to illness. He was 86 years old during the time of his death. After that, Sakurai lived with his mother, but since her death in 1984, he has been living alone for some time. Although the direct cause of death is unknown, as a chronic illness, he developed angina in 1996 and was hospitalized. Sakurai left the stage where he was supposed to appear. He was recently found at his home and was seen shopping in an electric wheelchair. == Films == * All films on IMDb Category:20th-century births Category:2012 deaths Category:Japanese musicians Category:Japanese comedians Category:Japanese actors",
 "title": "Senri Sakurai"
}