{
 "id": "837202",
 "text": "Siempre Viva Norte, also known as Northern Siempre Viva is a barangay in the municipality of Mallig, in the province of Isabela, Cagayan Valley (Region II), Philippines. According to the 2015 Census, there were 1,972 people living there. This accounted for 6.47 percent of Mallig's overall population. == History == After liberation in the second world war, people from different areas such as Pangasinan, Ilocos, Nueva Ecija, Indonesia, and many more people from different regions came to this place and lived in lands that do not yet have land titles because there are not enough citizens, and this area is not yet a barangay. The municipality of Mallig just let it go. The elders who preceded this area, they were Pedro Ignacio, Alejo Orzame, Elias Seguancia, Alejandro Balmores, Gonzalo Mabuti, the former mayors were Eduardo Siababa, Cornelio Corpuz, Geminiano Soria, Alipo Castro, Gregorio Barbo, Eugenio Solanzo, Leoncio Pico, Cerilo Ladiero, Alipio Senica, Alejandro Gabatino, Genaro Seguancia, Carlos Catacutan, Juan Calderon, Ramon Domingo, Bernabe Cabanting and many more. It took a few years before the elders had a meeting in this area to make it a Barrio or Barangay, and they did it successfully. Gemeniano Soria was the first one they recommended to be the Teniente del Baryo or Barangay Captain. They named this barangay \"Siempre Viva\" from the Spanish language \"Always Alive\" after they won the \"Salip\" in the town of Mallig in Rigodon, a dance and many more contests that they won. Many children find it challenging to study because there is no school and no proper physical school. Once granted, Mayor Eduardo Siababa met the elders to go to the mountain to get materials for the \"Eskuelahan\" or School. A few years passed, and they also finished school, but a powerful storm destroyed it. It was so bad that the children could not use it to study there. In 1948, some researchers and surveyors came to make Siempre Viva a town or city, but it did not proceed because it was far from the National Highway. From 1950 - 1953, many were afraid to live in Siempre Viva because of the brutality of the Kalingas. All the people living in Siempre Viva sleep under their houses when the night comes. Mayor Eduardo R. Siababa decided to approach the \"Panglakayen\" (Leader) of the Kalingas to have an organization that would maintain peace and cooperation between the Ilocanos and Kalingas. The organization was well established and was called \"Boddong\". Several decades passed, and the residents believed it would be better to divide the 60 hectares of land into two independent barangay to receive more projects and funds from the Government. In 1984, the two barrios were separated, and in the South, Siempre Viva Sur was located, while in the North, Siempre Viva Norte was located. == Education == Siempre Viva Norte is home to one of the oldest elementary school in Mallig, Siempre Viva Norte Elementary School established in 1949. The following educational institutions are also located within the village: * Siempre Viva Norte Child Development Center * Siempre Viva Elementary School == Demographics == === Population by age group === The age group with the highest population in Siempre Viva Norte, according to the 2015 Census, is 20 to 24, with 194 individuals. The age group with the smallest population is 80 and over, with just 5 people. When all age groups are combined, those aged 14 and under account for 28.14 percent of the young dependent population, which includes infants/babies, children, and young adolescents/teenagers (555). Those aged 15 to 64, or approximately the economically productive population and actual or potential members of the labor force, account for 67.39 percent of the total population (1,329). Finally, the old dependent population, which includes senior citizens aged 65 and up, accounts for 4.46 percent (88) of the total. According to the calculated Age Dependency Ratios, there are 42 youth dependents for every 100 working-age people in Siempre Viva Norte; 7 aged/senior citizens for every 100 working-age people in Siempre Viva Norte; and 48 dependents (young and old- age) for every 100 working-age people in Siempre Viva Norte. The median age of 26 means that half of the people in Siempre Viva Norte are under the age of 26 and the other half are over the age of 26. Age group ▾ Population (2015) Age group percentage Under 1 34 1.72% 1 to 4 155 7.86% 5 to 9 187 9.48% 10 to 14 179 9.08% 15 to 19 186 9.43% 20 to 24 194 9.84% 25 to 29 173 8.77% 30 to 34 145 7.35% 35 to 39 149 7.56% 40 to 44 123 6.24% 45 to 49 128 6.49% 50 to 54 96 4.87% 55 to 59 85 4.31% 60 to 64 50 2.54% 65 to 69 37 1.88% 70 to 74 32 1.62% 75 to 79 14 0.71% 80 and over 5 0.25% Total 1,972 100.00% * Youth Dependency Ratio: 41.76 * Old Age Dependency Ratio: 6.62 * Total Dependency Ratio: 48.38 * Median Age: 26.47 == Historical population == The population of Siempre Viva Norte increased by 761 people from 1,211 in 1990 to 1,972 in 2015. The most recent census estimates from 2015 show a 1.93 percent rise, or an increase of 188 individuals, over the previous population of 1,784 in 2010. Census date Population Growth rate 1990 May 1 1,211 – 1995 Sep 1 1,072 -2.26% 2000 May 1 2,018 14.53% 2007 Aug 1 1,808 -1.50% 2010 May 1 1,784 -0.49% 2015 Aug 1 1,972 1.93% == Geography == Siempre Viva Norte is located on the island of Luzon at approximately 17.2033, 121.6316. At these coordinates, the elevation is measured to be 68.9 meters or 226.0 feet above mean sea level. === Climate === Siempre Viva Norte, Mallig has a tropical climate. Most months in Siempre Viva Norte experience substantial rainfall, with a brief dry season. Köppen and Geiger classify this position as Am. The temperature is on average. The annual rainfall average is . == Adjacent barangays == Siempre Viva Norte shares a common border with the following barangay(s): * San Juan, Quezon, Isabela * Siempre Viva Sur, Mallig, Isabela * San Pedro (Barucbuc Sur), Mallig, Isabela * Trinidad, Mallig, Isabela == References == Category:Barangays Category:Isabela (province)",
 "title": "Siempre Viva Norte"
}