{
 "id": "837286",
 "text": "Takashi Tsuboshima (坪島孝, Tsuboshima Takashi, April 13, 1928 - August 12, 2007) was a Japanese film director. He is known for directing his 1974 film, Lupin III: Strange Psychokinetic Strategy, which was based on Monkey Punch's original manga and the first live action movie based on the character, Arsene Lupin III. == Career == Tsuboshima graduated from the Waseda University Faculty of Commerce in 1952. While attending the university, he watched all kinds of movies, both Japanese and Western, and aspired to become a film director. He joined Toho when he graduated from university in 1956. However, at that time, Toho had stopped officially hiring assistant directors due to the Toho Dispute and so he was assigned as a talent agent (a person in charge of paying dividends to actors). After three years of being a talent agent, he became an assistant director in 1955 and studied under Kajiro Yamamoto, Yasuki Chiba, Jun Fukuda and others. In 1963, Tsuboshima became director after directing his first feature film, Bet on Life at the Moment, which starring Yosuke Natsuki and Yuriko Hoshi. He also directed Crazy Cats films such as Kureji sakusen: Kudabare! Musekinin, which was Toho's dollar box program at that time. Tsuboshima would work under Kengo Furusawa in many movies. In crazy comedy movies, he directed many works that were a bit different from Furusawa, with a lot of wits and fine gags. Starring space alien entrepreneur Kei Tani in Kureji da yo: kisôtengai (1966), Crazy Cats member dancing in the streets of Las Vegas in Kureji ogon sakusen (1967) and other latter projects during his time as a director. His representative works included the absurd comedy Kiki kaikai ore wa dareda?! (1969), which was warming up the project. During his career, Tsuboshima created the so-called program pictures in succession, but in addition to crazy movies, the comedy-touch action work International Secret Police: Keg of Gunpowder (1964) starring Tatsuya Mihashi and the suspense drama \"Ai no Kizuna\" (1969) based on Seicho Matsumoto's original novel. He has left a fine work such as. Around 1968, he established Jack Production (ジャック・プロダクション, Jakku purodakushon) with Yasuo Tanami, Ei Ogawa, Tsugunobu Kotani and others. In addition to the subsequent films, he directed TV dramas, commercials, and weekly events. He died of lung adenocarcinoma on August 12, 2007 at the age of 79. == Films == * All films on IMDb Category:1928 births Category:2007 deaths Category:People from Hiroshima",
 "title": "Takashi Tsuboshima"
}