{
 "id": "837250",
 "text": "Village Singers (Vu~irejji shingāzu) was a popular Japanese group sound band formed in 1966 until 1971. They had multiple hit songs and appeared on television and in movies. == History == The predecessor of Village Singers was \"Folk Trekkers\" (Fōku torekkāzu), a country music folk group formed by Hisashi Komatsu. The group was once disbanded, but a new group was formed by Hisashi Komatsu, Takao Nanri, and Osamu Mori. In June 1966, Yutaka Hayashi and Masahiro Koseki were added and the band name was started as \"Village Singers\". The group is named after the folk mecca \"Greenwich Village\" in the United States. It was rare at the time to add a 12-string guitar to the band formation. Its record debut was in October 1966 on \"Dark Sandy Beach\". This song was a light folk-rock style song, but it didn't make a big hit. The following year, in 1967, they released the second single, \"In Search of You,\" but the slump continued. The members were reorganized in an attempt to revive, with new band members Tetsuo Koike, Kazuomi Sasai, and Michio Shimizu. In August 1967, the third single \"Barairono Kumo\" with new members sold over 600,000 copies and was in the limelight. The fifth single \"The Girl with Flaxen Hair\" released in February of the following year became a big hit ranked 7th on the Oricon chart. \"Lemon in the Rainbow / Ring of Memories\" released in April of the same year was a double-sided hit, achieving a feat of being ranked both 17th on the Oricon chart and 12th. In August, they released hit songs one after another, \"Until The Stars Fell\" and \"Falling Leaves And Kissing\" in November, but in 1969 it became sluggish and \"Love In The Rain\" released in February. Then, Oricon 42nd place, \"When I Fell In Love While Crying\" released in March barely entered Oricon 75th place, but the songs released after that did not lead to a hit at all outside the Oricon area, and it was released in January 1971. At the end of \"Forever From Here\", they disbanded in June 1971. In 2002, Hitomi Shimatani made a big hit by covering \"The Girl with Flaxen Hair\" as a commercial song for Kao's \"Essential Damage Care\". With this as an opportunity, the members at that time gathered and reunited and are still active to this day. == Members == === Yutaka Hayashi === Yutaka Hayashi ( February 24, 1947 ) is the drummer and an actor. He was born in Nagano and attended the Jōsai Univ. Jōsai Junior & Senior High School. He worked to Theater de Poche, Office BIN as a talent agent. ==== Career ==== Hayashi was born in Matsumoto, Nagano Prefecture, where the family was evacuated during the Allied bombing raid on Japan. After that, he grew up at his home in Tokyo. After graduating from high school, Hayashi joined the formation of the Group Sounds band, \"Village Singers\" as a drummer. He released a number of hit songs . After the group was disbanded in 1971, Hayashi became an actor for different companies. He played every role, from young people who were refracted by society to villains. He married Etsuko Nami in 1969. They divorced in 1972. He retired in 1983. After retiring, he became a businessman and succeeded in developing oldies live house \"Kento's\" and The Beatles copy band live house \"Cavern Club\" \"Abbey Road\" in Tokyo, Osaka and Fukuoka. Around 2001. Hayashi resumed his activities as a member of the Village Singers during the 2002 reunion. === Tetsuo Koike=== Tetsuo Koike ( Koike Tetsuo, November 30, 1947 - ) is the keyboard player and pianist. He grew up in Tokyo. ==== Career ==== After the dissolution of Village Singers, Koike worked as a solo musician. After that, he established a commercial music production company and worked as a producer. Koike would later reunite with the band in 2002. === Kazuomi Sasai === Kazuomi Sasai ( November 12, 1944 ) is the bass player. He grew up in Tokyo. ==== Career ==== After the dissolution of the band, Sasai worked as a solo musician, and after that, he discovered \"Megumi Asaoka\" and \"Hiromi Iwasaki\" as record director. He would reunite with the band in 2002 and runs a music video production company. === Hisashi Komatsu === Hisashi Komatsu ( February 10, 1945 -) is leader of the band as a lead guitarist. He grew up in Tokyo. ==== Career ==== After working for the country music group \"Folk Trekkers\" he formed the group \"Village Singers.\" In 1973, after the dissolution of the band, Komatsu formed \"Shigeki Torizuka & Hotcake\" with former The Wild Ones member Shigeki Torizuka. After that, he became a music director for Yasuko Naitō, the TUBE, and the ZARD. In 2002, he reunited with members of \"Village Singers\" and is still active. On June 5, 2010, a new band \"Hisashi Komatsu & His Farmers\" was formed. === Michio Shimizu=== Michio Shimizu ( August 17, 1945 {age 75} -) is singer and rhythm guitarist. He grew up in Tokyo. ==== Career ==== After the dissolution of Village Singers, Shimizu became a solo singer. In 1975, he became a record director. Shimizu participated in the \"Tigers Memorial Club Band\" formed in 1988. He would latter reunite with the band in 2002 == Old members == * Masahiro Koseki (keyboard) * Takao Nanri (12-string guitar, banjo) * Osamu Mori (bass) * Eiji Tsunoda (bass) == Major hit songs == * Barairono Kumo (バラ色の雲, Baraironokumo) (August 1967) * Because I Like It (好きだから, Sukidakara) (November 1967) * A Maiden With Flaxen Hair (亜麻色の髪の乙女, Amairono kamino otome) (February 1968) * Lemon In The Rainbow (虹の中のレモン, Niji no naka no remon) (April 1968) * Ring of Memories (想い出の指輪, Omoide no yubiwa) (April 1968) == Filmography == ===Television=== * March 7, 1967 - \"Young 720\" *Semi-regular appearance; (broadcast: TBS TV) * April 1967 - \"Let's Sing With Youth!\" *Guest appearance; (broadcast: Fuji TV) * October 1968 - \"Bakusho Young Pops\" *Guest appearance; (broadcast: Nippon Television) * October 1968 - \"Let's Go! Young Sounds\" *Guest appearance; (broadcast: Fuji TV) ===Movies=== * February 1967 - \"Ginza Lights\" (Starring Masako Izumi and Ken Yamauchi, directed by Noboru Kaji); (Distributed by: Nikkatsu) * August 1967 - \"The Spiders: Wild Scheme A-Go Go\" (Starring The Spiders, directed by Buichi Saito); (Distributed by: Nikkatsu) * October 1967 - \"Tokyo Night\" (Starring Masako Izumi and Ken Yamauchi, directed by Noboru Kaji); (Distributed by: Nikkatsu) * December 1967 - \"Happiness For You\" (Starring Yoko Naito and Kazuo Funaki, directed by Seiji Maruyama); (Distributed by: Toho) * January 1968 - \"The Spiders: Go Forward!\" (Starring The Spiders, directed by Kō Nakahira); (Distributed by: Nikkatsu) * April 1968 - \"Ring of Memories\" (Co-starring Nana Ozaki, The Spiders & The Darts, directed by Kōichi Saitō); (Distributed by: Shochiku) * July 1968 - \"Lemon In The Rainbow\" (Co-starring Nana Ozaki, directed by Kōichi Saitō); (Distributed by: Shochiku) * September 1968 - \"Small Snack\" (Starring Nana Ozaki and Purple Shadows, directed by Kōichi Saitō); (Distributed by: Shochiku) * March 1969 - \"Fallen Leaves And Kiss\" (Co-starring Nana Ozaki, Hiroshi Fujioka, The Ox as guest appearance, directed by Kōichi Saitō); (Distributed by: Shochiku) Category:Musical groups from Tokyo",
 "title": "Village Singers"
}