{
 "id": "837388",
 "text": "The opioid crisis or opioid pandemic is the problems with opioid drugs. Too many people became addicted to opioids. The crisis started in the United States in the 1990s. Since then, about 450,000 people have died from opioids in the United States. Most of the people who died took opioids as regular drugs and became addicted. Only a small number of people used the drugs illegally. According to the United States Centers for Disease Control, the opioid crisis costs $78.5 billion a year in the United States alone. Opioids are moderately strong, to strong painkillers. Despite the high risks, associated with addiction and overdose, they are relatively easy to get. Opioids can have sedative properties. They are useful for treating acute pain; but they are not as effective when treating chronic pain. When looking at chronic pain, the risks often outweigh the benefits. In 1996, the company Purdue Pharma wanted to sell a number of drugs containing opioids. They told doctors that patients would probably not become addicted, so the doctors prescribed opioids to many patients, even if they did not really need them. Many of those patients became addicted. In 2007, Purdue Pharma was fined $635 million. The judge said this was because Purdue Pharma did not warn customers about the side effects enough. Since then, there have been other similar lawsuits. In 2017, more than 47,000 Americans died as a result of an opioid overdose, including prescription opioids, heroin, and illicitly manufactured fentanyl, a powerful synthetic opioid. That same year, an estimated 1.7 million people in the United States suffered from substance use disorders related to prescription opioid pain relievers, and 652,000 suffered from a heroin use disorder. 21 to 29 percent of patients given opioids use them wrong in some way. 4 to 6 percent switch from prescription opioids to the illegal drug heroin. == Women are affected more often == The opioid crisis affects women and men differently, For instance, women are more likely than men to become addicted. Women are also more likely to suffer chronic pain than men are. There are many situations in which women are to receive pain medicine. In cases of domestic abuse and rape, women are prescribed pain medicine more than men. Along with that, during pregnancy women may use prescription opioids to help with pregnancy pain, especially with post-pregnancy pain. The number of women that have died from opioid pain relievers has increased five times from what it was in 1999 in 2010. To help stop the spread of opioid abuse in women, it is advised that women are educated on the drugs that they are taking and the possible risk of addiction. Additionally, alternatives should always be used when possible in order to prevent addiction. ==References== Category:Opioids",
 "title": "Opioid crisis"
}