{
 "id": "837465",
 "text": "Ox (オックス, Okkusu) is a Japanese GS band formed in 1968 to 1971. They were well known with their albums and songs, but they changed members throughout the late 1960s and early 70s. == History == The band was created in November 1967, led by Toshio Fukui and Yuji Iwata, who were former members of The Kings (ザ・キングス), another GS band. Members were Toshio Fukui and Yuji Iwata, as well members from other music shops such as Shiro Okada and Norio Sugiyama at the McCoys, Ai Akamatsu at Hataris, and Atsushi Kuriyama at Sanders. On December 1, the group will take the first stage at \"Number Ichiban\" in Osaka. Hideto Noguchi, who was enrolled in the backbone at the time of formation, officially joined the group on December 28. In January 1968, Norio Sugiyama and Atsushi Kuriyama left the group to pursuit their job career, but they still played an active role in the Kansai performance of the Swedish instrumental band \"The Spotnicks\" who had came to Japan in January. The Ox's \"Goodbye Performance\", which was decided to move to Tokyo on March 17, was so popular in Kansai that it was held at a club in Umeda, Osaka. After moving to Tokyo, they were camp at the 2DK apartment in Shibuya. Before their debut, the group performed at a jazz cafe in Tokyo. With the performance of them falling off the stage and fainting because they were o enthusiastic during the show, it quickly became popular, especially fan girls. In May 1968, they made their record debut with \"Girlfriend\" (6th on the Oricon chart). The group became poplar as Hideto Noguchi's sweet singing voice (who had joined the band in January) and Ai Akamatsu's fairy tale atmosphere attracted many girls and their popularity soared. Later, they released their many hit songs such as \"Dancing Seventeen\" (28th on the Oricon chart), \"Tears of Swan\" (7th on the Oricon chart) and \"I'm On Fire\" (18th on the Oricon chart) were skipped one after another, becoming a super popular group alongside The Tigers and The Tempters. The use as a concert venue was often refused by theaters and local governments due to protests by the PTA and the Jijoren, as well as by the media and the educational community. (Ai Akamatsu later revealed that his fainting was just acting. Ai Akamatsu then suddenly disappeared on May 5, 1969, and after appeared a month latter, he left the band after getting a call from a music distributor. To find a new replacement, Hideto and Toshio meet Yûsuke Natsu (later became a TV and film actor) and he joined the band who was planning to participate in the formation of another GS band, Olive, on May 10, but the GS gere was already sluggish around this time, and the popularity of Ox was beginning to fade. On May 31, 1971, when the GS boom came to an end, they perforce their last concert the at Ikebukuro's jazz cafe \"ACB\" and was finally disbanded in mid-1971. == Members == * Toshio Fukui - band leader, bass (born January 29, 1947 - ); Real name: same; (Nickname: Toshio) * Hideto Noguchi - vocal (born November 27, 1950 - ); Real name: Masayuki Nouchi; Stage name: Hideto Maki; (Nickname: Hideto) * Ai Akamatsu - keyboard, vocal (born February 14, 1951 - ); Real name: Yoshinobu Akamatsu; Disappeared in May 1969 and appeared a month later to tell the group that he want to leave the band to took over his family business and is now a company owner. (Nickname: Ai-chan) * Yuji Iwata - drums (born April 15, 1946 in - ); Real name: same (Nickname: Yuji) * Shiro Okada - guitar (born June 9, 1949 in - ); Real name: same (Nickname: Shiro) * Yusuke Taura - keyboard (born October 30, 1950 - died January 27, 2010); Joining as Akamatsu's replacement, he started his solo singer debut and acting activities under the stage name of Yusuke Natsu in 1970, and after the dissolution, he completely turned into an actor for Toho and Toei companies. Real name: Hisayuki Taura (Nickname: Yuki) == Former members == * Norio Sugiyama (guitar) * Jun Kuriyama (vocals) == Major hit songs == * Girlfriend (ガールフレンド, Gāru furendo) / Hana no Yubiwa (花の指環, Hana no yubi wa); (1968.5.5); 6th on the Oricon chart. * Dancing Seventeen (ダンシング・セブンティーン, Danshingu sebuntīn) / Please Have My Heart (僕のハートをどうぞ, Boku no hāto o dōzo); (1968.9.5); Oricon 28th. * Tears of Swan (スワンの涙, Swan no namida) / Ox Cry (オックス・クライ, Okkusu kurai); (1968.12.10); 7th on the Oricon chart. * I'm On Fire (僕は燃えてる, Boku wa moe teru) / Ox At Dawn (夜明けのオックス, Yoake no okkusu); (1969.3.25); Oricon 18th. * Rosario Forever (ロザリオは永遠に, Rozario wa eien ni) / Midsummer Flamenco (真夏のフラメンコ, Manatsu no furamenko); (1969.6.25); Oricon 32nd. *Against God (神にそむいて, Kami ni somuite) / Light of Dawn (夜明けの光, Yoake no hikari); (1969.10.10); Oricon 41st. *Forgive Me (許してくれ, Yurushite kure) / Just A Little Love (ジャスト・ア・リトル・ラブ, Jasuto a ritoru rabu); (1970.2.5); Oricon 64th. *I'll Give You (僕をあげます, Boku o agemasu) / Flower Time (花の時間, Hana no jikan) ; (1970.5.5); Oricon 91st. *Nothing Can Be Done (もうどうにもならない, Mō dōnimo naranai) / Don't Turn Around (ふりむきもしないで, Furimuki mo shinaide) ; (1970.12.5); Oricon 100th place out of range. == Appearance == Televisions: * July 12, 1968 - \"Young 720\" *Semi-regular appearance (broadcast: TBS TV) * October 1968 - \"LOL Young Pops\" *Guest appearance (broadcast: Nippon TV) * October 1968 - \"Let's Go! Young Sounds\" *Guest appearance (broadcast: Fuji TV) * January - March 1969 - \"Din Don Dunn\" *Regular appearance and starring Akiko Wada (broadcast: Nippon TV) Movies: *July 20, 1968 - \"An Angel's Temptation\" (Starring Jun Mayuzumi & directed by Kogi Tanaka) (Distributed by: Shochiku) * March 29, 1969 - \"Fallen Leaves And Kiss\" (Starring Village Singers, Nana Ozaki, and Hiroshi Fujioka, directed by Kōichi Saitō) (Distributed by: Shochiku) * May 2, 1970 - \"Alleycat Rock: Female Boss\" (Starring Meiko Kaji, Akiko Wada & The Mops, directed by Yasuharu Hasebe) (Distributed by: Nikkatsu) Category:Musical groups from Tokyo Category:1967 establishments in Asia Category:1971 disestablishments",
 "title": "Ox (GS band)"
}