{
 "id": "837424",
 "text": "The Enneagram of Personality is a typing system of nine connected types of personalities. Today, Enneagram theories are mostly from Oscar Ichazo from the 1950s and Claudio Naranjo from the 1970s. Older history of ideas associated with the Enneagram of Personality are not agreed on. The Enneagram of Personality is popular in business management and spirituality development using books and DVDs. In business it is used to find out into how employees can work together. In spirituality it is shown as a path to self-improvement and enlightenment. Both say it can aid in self-awareness and self- understanding. == The Nine Types == Type Characteristic role Basic fear Basic desire Temptation Vice Virtue Stress Security 1 Perfectionist Corruptness, imbalance, being bad Goodness, integrity, balance Hypocrisy, hypercriticism Anger Serenity 4 7 2 Helper Being unloved To feel love Deny own needs, manipulation Pride Humility 8 4 3 Performer Worthlessness To feel valuable Pushing self to always be \"the best\" Deceit Truthfulness, Authenticity 9 6 4 Individualist Having no identity or significance To be uniquely themselves To overuse imagination in search of self Envy Equanimity (Emotional Balance) 2 1 5 Researcher Helplessness, incapability, incompetence Mastery, understanding Replacing direct experience with concepts Avarice Non-Attachment 7 8 6 Skeptic Being without support or guidance To have support and guidance Indecision, doubt, seeking reassurance Fear Courage 3 9 7 Enthusiast Being unfulfilled, trapped, deprived To be satisfied and content Thinking fulfillment is somewhere else Gluttony Sobriety 1 5 8 Protector Being controlled, harmed, violated Self-protection Thinking they are completely self-sufficient Lust (Forcefulness) Innocence 5 2 9 Peacemaker Loss, fragmentation, separation Wholeness, peace of mind Avoiding conflicts, avoiding self-assertion Sloth (Disengagement) Action 6 3 == Criticism == The Enneagram mixes ideas usually accepted in the theory of personality but it has been sent away and called pseudoscience by some personality assessment experts. The Enneagram is criticised for having no basis in scientific fact. ==References== Category:Personality",
 "title": "Enneagram of Personality"
}