{
 "id": "837590",
 "text": "The Carnabeats (ザ・カーナビーツ, Za kānabītsu) is a Group Sound band formed in 1967. Their hit single was a Japanese version of \"I Love You\" (a song cover from The Zombies), debut on June 1, 1967. The group would later dissolved on September 1969. == History == In January 1967, 16 year old high school student Ai Takano left the Freelancers (フリーランサーズ, Furīransāzu), a vocal group he had belonged to, and immediately invited former Swing West rhythm guitarist Jiro Kitamura and his fellow member of Freelancers Hiroshi Koshikawa to form a new band. Koshikawa was in Nagoya. Keikichi Usui, who has been an ally since the jazz cafe \"Grand Canyon\" era, and Tadao Oka, who was also a member of the Sounds West in Nagoya, were welcomed and they were patronizing the restaurant in Kamata, Ota-ku. With the full backing of former bandman Masahiro Miike, who is the owner of \"80\", he started his career under the name of Robin Hood (ロビンフッド, Robin fuddo). Eventually, the group passed the audition held at JVC, the publisher of Philips Records. The original single \"I Love You\" (released in 1965) by the British band The Zombies played at this time was successfully arranged by them, and producer Kazushi Honjo immediately translated the English-American pop songs. They asked Kenji Sazanami, a songwriter and lyricist, to translate it into Japanese, and their first debut single \"Sukisa Sukisa Sukisa\" (好きさ好きさ好きさ, I Love You I Love I Love You) became a popular hit. At the time of their first music debut, they changed their name to The Carnabeats by Rumiko Hoshika, the editor-in-chief of Music Life, and the agency will be Robin's Plan, which would later be launched for them. In June 1967, The Carnabeats made another album with The Jaguars, who belongs to the same recording company as an idol of the catchphrase, The Carnabeat's Sound Age. In their first debut single \"Sukisa Sukisa Sukisa\" Takano, who sings very passionately, sticks out his drumsticks and screams \"All of you\", which captivates female fans and immediately the song became a massive success. With the popularity of other electric bands such as The Spiders, The Tigers, The Blue Comets, and The Jaguars, who had already debuted their albums, the song blockbuster was one of the catalysts for the GS boom. Takano's singing voice grabbed the hearts of the fans and the group had release another hit single \"Let's Love Jenny\", released in September 1967. In addition, Usui, who was in charge of Japanese translation from the recommendation of Rumiko Hoshika, sings energeticly in \"You Are Crazy About You\" on side B. The groups's third single released in October is \"Okay!\", which is a cover song of Dave Dee, Dozy, Beaky, Mick & Tich, and Paul Anka's hit song \"Crazy Love\" on the B side. By using the fuzz audio, it is finished in an arrangement like The Carnabeats did so. The band produced many rock-like sound with Kitamura and all the members feeling close to Western rock'n roll music. They showed a different look with a another song, \"Don't Cry\", released in February 1968. This album is a ballad by the combination of two songwriters Jun Hashimoto and Koichi Sugiyama, and it is a song that mixes the sadly singing Takano and the chorus members. Ten days later, they released \"Cutie Morning Moon,\" which was recorded with British musician Gary Walker, a drummer of The Walker Brothers (UK), who was as popular as The Beatles in Japan. This song was written by Scott Walker, and the performance and chorus were recorded from the night of January 9, when the recording was made, to the dawn. The song title was decided to change from \"The Shadow Of The Moon That Remains Faintly In The Sky\" to \"Cutie Morning Moon\", and the composition was composed by producer Honjo, the composer of \"Let's love Jenny\". It was also put in charge under the name of Rinji Motoo. Their sixth single \"Love In Search\", released in May was the first solo for Usui on side A, and was written by Kōhan Kawauchi, who is known as the original creator of \"Moonlight Mask\", and this song was written by The Spiders. They brought it to Victor Records, but it went to The Carnabeats, which belongs to the same music distributor, Philips Records. This year, the band participated in the Nikkei Western Carnival in as guest performances, appeared in multiple movies and tv shows, released the LP \"The Carnabeats First Album\", acted as an image character for Fujiya and Pepsi Cola commercials, and their tour from June in Tokyo and Osaka. Their strong performance such as holding a one-man show continued, and their single \"Um Um Um\" was released in August. However, the GS boom peaked in 1968 and began to died down with upcoming rhythm and blues, hard and soft rock, funk, and disco during the early 1970s. The next single \"My Baby\" was released in October, and even with Takano's singing reminiscent of the early singles, it did not become a hit. On March 1969, the Beatles' \"Ob-La-Di, Ob-La-Da\", which is famous for its marmalade rhythm, was released with the translation of Kenji Sazanami for the first time. However, in April, vocalist Usui left the group, and Paul Okada, who was in another GS, joined them. The song they released was \"Teltel Heaven\". In contrast to the A-side, which is a cover song, the B-side, with the Latin song \"Midnight Lovers\" composed by Takashi Miki, tried to revive with a sound that was ahead of the trend, but the decline of the GS boom could not be stopped anymore, and the same year. Kitamura and Oka left the group in September, and Kyoichi Saiga and Rie joined, but they eventually disbanded. After the band ended, Ai Takano joined The Golden Cups as a drummer in January 1970. == Members == * Ai Takano (vocals, drums), (January 12, 1951 - April 1, 2006), Nickname: Mocchi (もっちん, Motchin), Chongcho (チョンチョ, Choncho). * Keikichi Usui (vocal, moderator, tambourine, maracas), (January 2, 1946 -), Born in Kokurakita Ward, Withdrew from the band in April 1969, He made his solo debut in the early 1970s under the names of Kei Aoyama and Masami Aoyama, Nickname: Ponta (ポンタ, Ponta). * Hiroshi Koshikawa (guitar, leader), (April 22, 1946 -), Nickname: Hiro-chan (ヒロちゃん, Hirochan), Frog (カエル, Kaeru). * Tadao Oka (bass), (April 1, 1948 -), Born in Fukushima Prefecture, Nickname: Dende (デンデ, Dende), Goldfish (金魚, Kingyo), Real name: Tadao Takahashi, His older brother Norio Oka worked at the Jukebox, Although he left the band one month before the dissolution, Oka participated in the dissolution concert for one day only, His son is Yūta Takahashi, an actor from the JUNON Super Boy Contest. * Jiro Kitamura (guitar), (February 18, 1946 -), Nickname: Jiro (ジロー, Jirō), Golden Bat (黄金バット, kogane batto), Left the band one month before the dissolution, but participates in the dissolution concert for one day only, After the dissolution, he formed the new rock band \"Life\". * Paul Okada (vocal), (August 13, 1947 -), Real name: Kazuhiko Nagaoka, Joined in April 1969 as a successor to Usui who left the band, After the dissolution, he made his solo debut in November 1970. Debuted as \"Pysis\" in March 1975, and released \"Don't Come With Your Lover\" written and composed by Yumi Arai in April 1976. * Kyoichi Saiga (bass), (January 2, 1949 -), Joined as a successor to Oka in September 1969, just before the dissolution. * Rie (keyboard) (1950 -), Joined in September 1969, just before the dissolution. == Discography == Singles * I Love You, I Love You, I Love You, (好きさ好きさ好きさ, Sukisa sukisa sukisa) / I Was Kaiser Bill's Batman (口笛天国, Kuchibue tengoku);（1967.06.01） * Let's Fall In Love Jenny (恋をしようよジェニー, Koiwoshiyōyo jenī) / I'm Crazy About You (お前に夢中さ, Omae ni muchū- sa); (1967.09.20) * Okay! (オーケイ!, Ōkei!) / (クレイジー・ラブ, Kureijī rabu);（1967.10.25） * Don't Cry (泣かずにいてね, Nakazu ni ite ne) / Chu! Chu! Chu! (チュッ！チュッ！チュッ！, chu~tsu! Chu~tsu! Chu~tsu!);（1968.02.15） * Morning Sunrise Of Love (恋の朝焼け, Koi no asayake) / Hello Gary (ハロー・ゲイリー, Harō geirī); (1968.02.25) * Looking For Love (愛を探して, Ai o sagashite) / Go Go Stop (ゴー・ゴー・ストップ, Gō gō sutoppu); (1968.05.25) * Umm Umm Um (ウム・ウム・ウム, Umu umu umu) / Monnie Monnie (モニー・モニー, Monī monī); (1968.08.05) * My Baby (マイ・ベイビー, Mai beibī) / Love Memories Box (恋の想い出箱, Koi no omoide-bako); (1968.10.25) * Ob-La-Di Ob Lada (オブラディ・オブラダ, Oburadi oburada) / Because It's A Request (お願いだから, Onegaidakara); (1969.03.10) * Teltel Heaven (テルテル天国, Teruteru tengoku) / Midnight Lovers (真夜中の恋人たち, Mayonaka no koibito-tachi); (1969.06.25) == Appearances == Televisions: *April 1967; (Fuji TV); \"Let's Sing With Youth!\"; * Guest appearance *July 1967; (TBS TV); \"Young 720\"; * Semi-regular appearance *October 1967; NET TV (currently TV Asahi); \"Uneven Montage Battle\"; * Regular appearance *September 1968; (TV TOKYO Corporation); \"R&B; Heaven\"; * Guest appearance *October 1968; (Nippon TV); \"Bakusho Young Pops\"; * Guest appearance *October 1968; (Fuji TV); \"Let's Go! Young Sounds\"; * Guest appearance Movies *February 1, 1968 - (Distributed by: Nikkatsu Nikkatsu) - The Puppy-love Singers - starring Hidekazu Nagai and directed by Kenjiro Morinaga *March 1, 1968 - (Distributed by: Shochiku Shochiku)- Man in the Storm - starring Nana Ozaki (actress) Nana Ozaki and directed by Kazuo Hase *July 27, 1968 - (Distributed by: Daiei) - Pregnancy - starring Tamotsu Hayakawa, Masako Mizuki, The Rangers (performance) and directed by Tarô Yuge *September 15, 1968 - (Distributed by: Shochiku) - First Love Declaration - starring Kaoru Yumi, Etsuko Nami, Le Girls (performence) and directed by Meijirō Umetsu (also wrote the screenplay) Category:Musical groups established in 1967",
 "title": "The Carnabeats"
}