{
 "id": "837714",
 "text": "Salyut 1 was the first ever space station sent into space. It was launched into orbit in April 1971 by the Soviet Union and stayed in space until October 1971. During its time in space, it was visited by two spacecraft with crews. The purpose of Salyut 1 was to learn and test how a space station worked. A second goal was to find out how being in space a long time affected the human body. It had a number of problems, but a lot was learned from it that helped with future stations. The station was at first part of the Almaz program, to make a secret military station in space. On 16 February 1970 it was decided to make it civilian instead. The Soviet space program gave the name DOS to the program. That is an abbreviation of the Russian \"Dolgovremennaya Orbitalnaya Stanziya\" which in English means \"Long Term Orbital Station\". The first station was called DOS-1 by the people working on the space program. To the public, it was going to be called Zarya, but was changed to Salyut before launch. Salyut is the Russian word for salute and was given to honor Yuri Gagarin. The station was shaped like a cylinder and had four areas. One was a docking module to allow a spacecraft to connect. The second was the main module where people could live. The third was the auxiliary module that had the equipment to run the station. The fourth had the engines to move the station. Besides these, the station had four solar panels. It was launched on 19 April 1971 on a Proton K rocket. Two days later, the first crew was also launched on a Soyuz rocket. They were supposed to stay for 30 days at the station. This did not happen as there was a problem in docking (connecting) their spacecraft to the station. After trying for 5.5 hours, they had to return to Earth. A second crew (Soyuz 11) was sent on 6 June 1971 and was able to enter. At first the mission went well, but due to problems on the station they could only stay 23 days of the planned 30. Their stay was the longest any people had spent in space at that time. While at the station, they did experiments to help scientists understand life in space. The crew of Soyuz 11 died during re-entry of the atmosphere when their air escaped. No other spacecraft visited the station. Salyut 1 was de-orbited (removed from space) on 11 October 1971. The engines were used to lower the orbit, so it would burn up in the atmosphere. The design of Soyuz 1 proved to be a good one. Later long-term stations such as Salyut 7 and Salyut 8 were based on it. And parts of Mir and the Zvezda module of the International Space Station were also based on this design. Soyuz 1 was followed by the Salyut 2 station, which failed. ==References== Category:Space stations Category:Spacecraft launched in the 1970s",
 "title": "Salyut 1"
}