{
 "id": "837702",
 "text": "Kabhi Khushi Kabhie Gham... (), also known as simply K3G, is a 2001 Indian Hindi-language melodrama film written and directed by Karan Johar and produced by Yash Johar. The film stars Amitabh Bachchan, Jaya Bachchan, Shah Rukh Khan, Kajol, Hrithik Roshan and Kareena Kapoor, with special appearance by Rani Mukerji. The film was eventually released in India, the United Kingdom and North America on 14 December 2001. The film received positive reviews and was a commercial success at the box office. This film was the highest grossing Indian film ever until Kabhi Alvida Naa Kehna, which was also directed by Karan Johar, got released. ==Sypnopsis ganey== Rahul (Shah Rukh Khan), the adoptive son of business magnate Yash Raichand (Amitabh Bachchan), feels eternal gratitude to his father for rescuing him from a life of poverty. Yet, when Yash forbids his love of poor Anjali (Kajol), Rahul marries her and moves to London with new wife and sister-in-law, Pooja (Kareena Kapoor), breaking the heart of his mother (Jaya Bachchan). Ten years later, Rahul's younger brother (Hrithik Roshan) comes to London intent on brokering peace between father and son. == Cast == * Amitabh Bachchan as Yashvardhan \"Yash\" Raichand * Jaya Bachchan as Nandini Raichand * Shah Rukh Khan as Rahul Raichand ** Aryan Khan as Young Rahul Raichand * Kajol as Anjali Sharma Raichand * Hrithik Roshan as Rohan Raichand ** Kavish Majumdar as Young Rohan Raichand (Laddoo) * Kareena Kapoor as Pooja \"Poo\" Sharma Raichand ** Malvika Raaj as Young Pooja Sharma * Rani Mukerji as Naina Kapoor * Farida Jalal as Sayeeda / Daijan \"DJ\" * Jibraan Khan as Krish Raichand * Simone Singh as Rukhsaar * Alok Nath as Om Sharma (Bauji) * Jugal Hansraj as Rohan's friend (special appearance) * Achala Sachdev and Sushma Seth as Yash and Nandini's mothers respectively * Johnny Lever as Haldiram * Himani Shivpuri as Haldiram's wife * Amar Talwar as Mr. Kapoor * Ramona Sunavala, Jeroo Writer, Vikas Sethi as Poo's friends Sonya, Tanya and Robbie, respectively * Ashutosh Singh as Ashfaque Miyaan * Shilpa Mehta, Shashikala and Parzan Dastur as Ashfaque Miyaan's mother, grandmother and nephew, respectively. * Punit Malhotra as a cricket bowler * Jesse Lever as Haldiram's son == Box office == Made on a budget of $1 million, Kabhi Khushi Kabhie Gham... emerged as a major critical and commercial success, both domestically and internationally, with a lifetime gross of () at the worldwide box office becoming the highest grossing Indian film ever worldwide at the time of its release. Outside India, the film was the highest-grossing Indian film ever, until its record was broken by Johar's next directorial venture, Kabhi Alvida Naa Kehna (2006). Kabhi Khushi Kabhie Gham... won several awards at popular award ceremonies the following year, including five Filmfare Awards. == References == Category:2000s Indian movies",
 "title": "Kabhi Khushi Kabhie Gham"
}