{
 "id": "83780",
 "text": "ENIAC (which meant \"Electronic Numerical Integrator And Computer\") was a computer built between 1943 and 1946. It was designed by two people called John Mauchly and J. Presper Eckert. The machine was built out of nearly 17,500 vacuum tubes, 7,200 diodes and many miles of wire. It took up of space, which is the size of a large room. == Background == The history of computers is complex, and many machines have been identified as the \"first computer\". ENIAC's claim is based on the fact that it was more programmable than previous ones. Because the computer was built out of vacuum tubes, it often broke. This meant that someone had to find the failed tube (which was not an easy job), take the bad tube out and put a working tube in. Making programs for the computer was difficult. Making the computer ready for one single program could take many days or even weeks. This was because the programming had to be done by pulling wires from one place to another. This was not hard for small programs, but if a large program was wanted, it was very hard work. Programming by pulling wires was used until 1948, when a special type of memory was added (called Read Only Memory (ROM), because the computer could read it but not write it). After that, programming was done by using switches, which only took hours instead of days. == History == The ENIAC was first designed to print firing tables for U.S. Army artillery, but the war ended before the machine was completed. Instead, its first real job (not test) was to calculate how neutrons would go through various materials. This was needed in making a hydrogen bomb. ENIAC took 70 hours to work out pi to 2000 decimal places. A modern PC with a CPU of the size of 2x2 cm is much faster than ENIAC, which used up a whole room of space. For an example, a modern PC can work out a million (1,000,000) decimal places of pi in about ten seconds. ENIAC was shut down forever on October 2, 1955. Now, only about 10 panels of the 40 exist. Although the original is shut down, programs written for the ENIAC can still be run on a modern computer using an emulator. ==Sources== Category:Historical computers",
 "title": "ENIAC"
}