{
 "id": "837970",
 "text": "In Sanamahism (Meitei religion), Atingkok, the Supreme God is known with 1000 names as mentioned in multiple Meitei scriptures. Unlike other faiths, in Meitei paganism, the Supreme God, himself, is the Creator of the Universe as well as the King of the Heaven. He is also the God of the Sky. He is the one who controls weather, rain, thunder and lightning. Classical Meitei Transliteration (including different spellings) English Translations ꯀꯨꯂꯨ (ꯀꯨꯔꯨ) Kulu (Kuru) \"The Round Hemisphere\" or \"The Endless Sky\" or \"The Eternal one\" ꯁꯂꯥꯢꯂꯦꯟ/ꯁꯂꯥꯏꯂꯦꯟ (ꯁꯂꯥꯢꯂꯦꯜ/ꯁꯂꯥꯏꯂꯦꯜ, ꯁꯂꯥꯢꯔꯦꯟ/ꯁꯂꯥꯏꯔꯦꯟ, ꯁꯂꯥꯢꯔꯦꯜ/ꯁꯂꯥꯏꯔꯦꯜ) Salailen (Salailel, Salairen or Salairel) \"The Supreme Breeder\" ꯁꯤꯇꯄ ꯃꯄꯨ (ꯁꯤꯗꯕ ꯃꯄꯨ) Sitapa Mapu (Sidaba Mapu) \"Immortal Master\" or \"Eternal God\" or \"Immortal God\" ꯁꯣꯔꯥꯔꯦꯟ/ꯁꯣꯔꯥꯔꯦꯜ Soraren/Sorarel \"King of the Gods\" ꯂꯥꯢ ꯅꯤꯡꯊꯧ (ꯂꯥꯏ ꯅꯤꯡꯊꯧ) Lai Ningthou \"King of the Gods\" ꯂꯥꯢ ꯑꯋꯥꯡꯄ/ꯂꯥꯏ ꯑꯋꯥꯡꯕ Lai Awangpa/Lai Awangba \"High God\" ꯅꯣꯡ ꯅꯤꯡꯊꯧ Nong Ningthou \"King of the Sky\" or \"King of the Rains\" ꯆꯤꯉꯨ ꯅꯤꯡꯊꯧ Chingu Ningthou/Chi-ngoo Ningthou \"King of the Gods\" ꯆꯤꯉꯨ ꯅꯤꯡꯊꯧ ꯄꯥꯟꯆꯨꯝꯄ (ꯆꯤꯉꯨ ꯅꯤꯡꯊꯧ ꯄꯥꯟꯖꯨꯝꯕ) Chingu Ningthou/Chi-ngoo Ningthou Paanchumpa (Paanjumba) \"Divine King with flawless aim\" ꯇꯥꯏꯄꯪ ꯃꯄꯨ/ꯇꯥꯢꯄꯪ ꯃꯄꯨ (ꯇꯥꯏꯕꯪ ꯃꯄꯨ/ꯇꯥꯢꯕꯪ ꯃꯄꯨ) Taipang Mapu (Taibang Mapu) \"Master of the Universe\" ꯇꯦꯡꯄꯥꯟꯄ ꯃꯄꯨ (ꯇꯦꯡꯕꯥꯟꯕ ꯃꯄꯨ) Tengpanpa Mapu (Tengbanba Mapu) \"Master of the Universe\" ꯈꯥꯛꯄ ꯅꯤꯡꯊꯧ Khaakpa Ningthou/Khakpa Ningthou \"King of Thunder and Lightning\" ꯈꯣꯌꯨꯝ ꯅꯤꯡꯊꯧ Khoyum Ningthou \"King of the Gods\" ꯌꯥꯢꯄꯤꯂꯦꯜ/ꯌꯥꯏꯄꯤꯂꯦꯜ (ꯌꯥꯢꯄꯤꯂꯦꯟ/ꯌꯥꯏꯄꯤꯂꯦꯟ, ꯌꯥꯢꯄꯤꯔꯦꯜ/ꯌꯥꯏꯄꯤꯔꯦꯜ, ꯌꯥꯢꯄꯤꯔꯦꯟ/ꯌꯥꯏꯄꯤꯔꯦꯟ) Yaipilel (Yaipilen, Yaipirel, Yaipiren) \"The Supreme Soul\" ꯌꯥꯢꯕꯤꯂꯦꯜ/ꯌꯥꯏꯕꯤꯂꯦꯜ (ꯌꯥꯢꯕꯤꯂꯦꯟ/ꯌꯥꯏꯕꯤꯂꯦꯟ, ꯌꯥꯢꯕꯤꯔꯦꯜ/ꯌꯥꯏꯕꯤꯔꯦꯜ, ꯌꯥꯢꯕꯤꯔꯦꯟ/ꯌꯥꯏꯕꯤꯔꯦꯟ) Yaibilel (Yaibilen, Yaibirel, Yaibiren) \"The Supreme Soul\" ꯏꯄꯨꯂꯣꯢ/ꯏꯄꯨꯂꯣꯏ (ꯏꯄꯨꯔꯣꯢ/ꯏꯄꯨꯔꯣꯏ) Eepuloi (Eepuroi) \"Supreme Grandfather\" ꯑꯆꯤꯄ/ꯑꯆꯤꯕ Achipa/Achiba ꯑꯇꯤꯛꯉꯥ Atik-ngaa ꯑꯇꯤꯡꯀꯣꯛ Atingkok \"The Void\" or \"An empty space\" ꯑꯇꯤꯌꯥ Atiya \"The Sky\" ꯑꯋꯥꯡꯄ/ꯑꯋꯥꯡꯕ Awangpa/Awangba \"High\" ꯑꯋꯥꯡ ꯄꯥꯈꯪ ꯌꯣꯏꯂꯦꯜꯄ (ꯌꯣꯏꯔꯦꯜꯄ) Awang Pakhang Yoilelpa (Yoirelpa) \"Eastern Handsome Man\" or \"Highland Handsome Man\" ==References== Category:Meitei religion",
 "title": "Names of the Supreme God in Meitei religion"
}