{
 "id": "837973",
 "text": "Kaikondrahalli Lake is in Kaikondrahalli on Sarjapur Road, south east Bangalore and is spread over 48 acres of land. It is one of the traditional tank system in Bangalore which was created over hundreds of years ago and connected through a web of canals to different lakes. This was also used to provide water to the agricultural lands around the area. The region around the lake has encountered an expansion in land estate in the previous decade. Around the year 2000, the lake was filled up with fresh water and surrounded by various flora and fauna. By 2003, the lake had started to dry up as various channels to the lake was blocked due to construction and dumping of garbage. By 2007, the lake bed was a slushy bed of sewage and waste. This lake was later restored and is an example of urban commons revived by the local community with the help of the municipal corporation, BBMP (Bruhat Bengaluru Mahanagara Palike). ==Restoration== In 2008, Priya Ramasubban, a documentary film maker and a local resident of Kaikondrahalli saw a report in the newspaper about a BBMP initiated rejuvenation program for the lake. Realising the then state of the Kaikondrahalli lake, she and other residents formed a small core group who invited other members with technical expertise to join them in the planning of rejuvenating Kaikondrahalli lake. The Detailed Project Report (DPR) had already been prepared and the budget had been sanctioned. The original DPR was looked into and redesigned to focus more on ecology than just the aesthetics of the lake park. Local residents contributed funds and collected hundreds of saplings of native species for plantation in the lake premises. Along with the local community, the then chief engineer of the lakes division of BBMP, Mr. BV Sathish coordinated with the local residents in the restoration of the lake. Some of the changes made from the original DPR were to retain as much area under water as possible as the area around the lake is dependent on ground water. Using inputs from a local architect, access to the lake was provided to lake visitors as well as to the children of the school adjacent to the lake, which originally had to be fenced off from the lake. Washrooms were constructed and it could be used by the lake visitors and the school children. To prevent the main lake from getting polluted, the DPR was redesigned to build a separate enclosure at the corner of the lake for the immersion of idols during Ganesh Chaturthi and other religious festivals. The infrastructure was completed and water started flowing in after four years from its commencement of restoration. The small core group residents formed themselves into a non-profit trust called MAPSAS (Mahadevapura Parisara Samrakshane Mattu Abhivrudhi Samiti). The lake has been restored and maintained jointly by MAPSAS, BBMP and the local community. On February 4th, 2012, Nobel Laureate, Elinor Ostrom, American political economist, visited the Kaikondrahalli lake to look at its restoration work by the local community. A plaque regarding the same has been installed next to a jackfruit tree planted by Elinor Ostrom. ==MAPSAS== The group of residents responsible for the rejuvenation of the Kaikondrahalli lake formed a non-profit trust called MAPSAS (Mahadevapura Parisara Samrakshane Mattu Abhivrudhi Samiti) in 2011. The trust was formed to rejuvenate and maintain the chain of lakes such as Parappana Agrahara lake, Kudlu Dodda kere, Kudlu Chikka kere, Haralur lake, Kasavanahalli lake, Kaikondrahalli lake and Saul kere from the Parappana Agrahara series and Dodda Ambalipura, Chikka Ambalipura, Ibblur and Bellandur form another chain nearby. MAPSAS and the BBMP are jointly responsible for maintenance of these lakes. While the BBMP takes care of the initial big investments on infrastructure, MAPSAS takes care of the other aspects of daily maintenance. ==Kere Habba== Kere Habba (Lake festival) is an annual celebration of the lake at the Kaikondrahalli lake. It features organic and eco-friendly santhe, live music performances, storytelling sessions, workshops, activities and a conference. This is a one-day sunrise to sunset event which focuses on two objectives – to show the significance of lakes and as a fundraiser for the maintenance of the lake. On 16th February, 2020, MAPSAS along with BBMP conducted its 6th edition of this festival which took place from 6am to 6pm, with events such as the bird walk, kere run, photography workshop, puppet show, storytelling, Yakshagana, etc. ==Fundraiser== As the resources reduced for the monthly maintenance of the lake, in 2017 four residents from around the lake, Pushpa Krishna, Rinaz Mohammad, Padma Srinivas and her husband Srinivas Sampath, took part in the 42 km Standard Chartered Mumbai Marathon (SCMM) and individually started a fundraiser on Milaap for the upkeep of the lake. Altogether they raised up to nearly 3.3 lakhs for the maintenance of the Kaikondrahalli lake. Other than this, every year, Kere Habba is celebrated which is also a fundraiser collected through various stalls and activities conducted from sunrise to sunset on one particular day. ==Flora and Fauna== In 2014, a survey was conducted to identify the various Flora and Fauna species at the Kaikondrahalli lake. According to the survey, around 43 species of birds, 26 species of reptiles and 3000 plants comprising at least 33 varieties have been identified. Many migratory birds also visit this biodiversity lake from October to March. This in turn gathers many photography enthusiasts and bird watchers to the lake. ==Facilities== The park has various facilities such as walking/jogging pathway, washroom, play areas, parks, cycling tracks, butterfly garden and an amphitheatre. People can also bring their pets with them to the park from 5am – 11am and 3pm to 7pm. ==Post restoration== In the recent years, the lake has been suffering from algal growth and stench due to the sewage entering the lake from a close by private property. To resolve this issue MAPSAS had taken an initiative to pour Effective Microorganism (EM) solution into the lake. Few days after that, MAPSAS and volunteers from around the area gathered to make bokashi balls (Japanese technique that clears off sludge) to dump in the lake. It was made using the bokashi powder (containing sawdust and husk), mixed with cow dung, red mud sludge from the lake, jaggery and effective microorganism (EM) solution. This mixture was then rolled into balls and left to activate, after which it was dumped in the lake. During every summer, since 2018, the lake water has had algal bloom and the stench. Pouring of EM solution and dropping Bokashi balls into the lake has only become a temporary solution. MAPSAS also took initiative in seeking the BBMP Lakes team’s help in initiating an underground drainage system to diverge sewage water from the lake, as a long-term relief. The BBMP has thus decided to spend Rs.3 crore for constructing diversion drain at Kaikondrahalli lake. ==Films== In 2013, as an initiative by the Stockholm Resilience Centre, Swedish University, a documentary film, 'Kaikondarahalli lake – The Uncommon Story of an Urban Commons', was released. Harini Nagendra, an ecologist and a community member of the Kaikondrahalli lake was approached by Nobel Laureate Elinor Ostrom to do a research project on the conservation of the Kaikondrahalli lake by the local community. The film was has two versions- a three minute clipping to screen during seminars and conferences and a longer version which was uploaded to the biodiversity page of the university website. ==References== Category:Lakes of India Category:Bangalore",
 "title": "Kaikondrahalli Lake"
}