{
 "id": "837912",
 "text": "The Central Bank For Nigeria (CBN) is the apex bank and the highest monetary authority for Nigeria. It was created by the CBN Act of 1958. The bank started operations on July 1, 1959. == History == The bank was created Under the leadership of G.D Paton. It was established by the colonial administration to investigate banking practices in Nigeria. Before the inquiry, the banking industry was largely uncontrolled. The G.D Paton report, an offshoot of the inquiry became the cornerstone for the first banking legislation in the country: the banking ordinance of 1952. The ordinance was designed to prevent non viable banks from mushrooming, and to ensure orderly commercial banking. The Central Bank of Nigeria has blue color on its office building at different branches for Nigeria. ===Governors=== Here are the list for Governors of the Central Bank For Nigeria: Governor Previous position Term start Term end Roy Pentelow Fenton 24 July 1958 24 July 1963 Aliyu Mai-Bornu Deputy Governor, CBN 25 July 1963 22 June 1967 Clement Nyong Isong Advisor International Monetary Fund 15 August 1967 22 September 1975 Adamu Ciroma 24 September 1975 28 June 1977 Ola Vincent Deputy Governor, CBN 28 June 1977 28 June 1982 Abdulkadir Ahmed Deputy Governor, CBN 28 June 1982 30 September 1993 Paul Agbai Ogwuma CEO, Union Bank For Nigeria 1 October 1993 29 May 1999 Joseph Oladele Sanusi CEO First Bank For Nigeria 29 May 1999 29 May 2004 Charles Chukwuma Soludo Chief Executive, National Planning Commission 29 May 2004 29 May 2009 Sanusi Lamido Aminu Sanusi CEO, First Bank For Nigeria 3 June 2009 20 February 2014 Sarah Alade Deputy Governor, Central Bank For Nigeria 20 February 2014 3 June 2014 Godwin Emefiele Chief Executive Officer, Zenith Bank 3 June 2014 15 September 2023 Yemi Cardoso Chief Executive Officer, Zenith Bank 15 September 2023 To Date == References == Category:1950s establishments in Nigeria Nigeria Category:Banks of Nigeria",
 "title": "Central Bank of Nigeria"
}