{
 "id": "837942",
 "text": "Defence Colony is a residential locality within the larger neighbourhood of Indiranagar in Bangalore, Karnataka, India. It is bordered by three of Indiranagar's main roads 100 feet road, 80 feet Road and Chinmaya Mission Hospital (CMH) road. The locality is a mixture of apartments and independent houses. Originally a settlement for defence veterans, today it is one of the most expensive localities in Bangalore. == History == Defence Colony was originally a settlement of defence veterans started in the 1970s. The government allotted land to high ranking retired defence officers here. It was a sparse collection of Large Bungalows. At the time Indiranagar was a suburb, far outside Bangalore city. The Information Technology boom in the 1990s led to the rapid development of the neighbourhood, transforming Indiranagar into an upscale area. With increasing commercialisation of the surrounding areas, demand to live in this neighbourhood grew. As a result, property prices in Defence Colony rose over the years. Many of the owners sold their property to builders who put up apartments or developed it into apartments themselves. Today Defence Colony is largely made up of apartments. == Transport == Defence Colony is located only a few minutes away from the Indiranagar Metro Station. Auto Rickshaws are easily available on the main roads bordering the colony. There are also three bus stops nearby. One of 100 ft road at 6th main, and two on CMH road at Indiranagar police station and Chinmaya Mission Hospital. == Community == === Residents Welfare Association === Defence Colony has a very active Residents Welfare Association. The Defence Colony Residents Association or DECORA is a voluntary association that looks after the interests of the residents of the colony. The association acts as a method for collective action by the residents. While the original function was to guard against illegal encroachment, the association also looks after civic amenities, residents welfare, security and communicates with local authorities to solve issues faced by residents. They have enforced zoning norms by shutting down 15 commercial establishments in the locality and protected two neighbourhood parks from encroachment. === Crime === the incidents of street crime has been increasing over the years especially during the night. Defence Colony and surrounding areas suffers from a high rate of street crime with incidences of chain snatching, harassment and robbery reported regularly. === Recreation === 100 feet road (that borders Defence Colony) is full of restaurants, pubs and high end retail shops. Within the Colony there are three parks, a children's park, a walking park and a senior citizens park, as well as a large open field. The children's park has playground equipment and lots of space for children to play. Opposite it is the walking park, which has a paved walking path surrounded by lots of trees, grass and other plants. The senior citizens park is a smaller version of the walking park exclusively for senior citizens. == References == Category:Bangalore",
 "title": "Defence Colony Bangalore"
}