{
 "id": "838039",
 "text": "\"Brother, Can You Spare Two Dimes?\" is the 24th episode of The Simpsons 3rd season. It is the last episode of the season (the season finale). It was first broadcast on the Fox network on August 27, 1992. In the episode, Mr. Burns gives Homer Simpson $2,000. Homer loans the money to his homeless half-brother Herb Powell. The episode was written by John Swartzwelder. Rich Moore is the director of the episode. Danny DeVito guest stars as Herb and Joe Frazier guest stars as himself. Herb was in the episode \"Oh Brother, Where Art Thou?\" where Homer makes him bankrupt. Many fans thought that episode had a sad ending. Producers of The Simpsons made the episode \"Brother, Can You Spare Two Dimes?\" because of that. == Story == Mr. Burns learns that Homer Simpson is sterile because of his power plant's radiation. He gives Homer a fake award, $2,000, and makes him sign a wavier that does not let him sue Mr. Burns. Homer wants to buy a vibrating chair with the $2,000. His half-brother Herb Powell asks Homer to loan him the money. Herb was a car manufacturer before Homer made him bankrupt and homeless in the episode \"Oh Brother, Where Art Thou?\". Homer goes him the money. Herb sees a baby cry and makes a machine that lets people know what babies say. Herb's machine makes him rich and successful again. Herb gives Homer the money back and gives the Simpson family gifts. Herb forgives Homer for making him bankrupt and buys him the vibrating chair Homer wanted. == Production == \"Brother, Can You Spare Two Dimes?\" was written by John Swartzwelder. Rich Moore is the director of the episode. The episode was broadcast later in the 3rd season because the Fox network wanted producers to make another episode to be broadcast in the summer. Writers, animators, and producers had to work longer to make the episode. The idea of the vibrating chair came from one of the writers. They bought a vibrating chair to relax after working long hours of making the episode. The reason another episode with Herb was made was that fans were sad that Herb became bankrupt in \"Oh Brother, Where Art Thou?\". This episode was made to show Herb getting rich again. One of the producers wanted Herb to say \"I have an idea!\" at the end of the \"Oh Brother, Where Art Thou?\". They instead made it into the story of this episode. Producers liked Danny DeVito as a guest star in the first episode with Herb and got him back for this episode. However, Hank Azaria said that DeVito was not as happy to guest star again. He said \"The second time, Danny DeVito was like 'Yeah, yeah, yeah, let's get it over with.' He did a great job, but he didn't enjoy the process.\" The writers of the episode had many ideas of what Herb would make to get rich again. The script of the episode had too many pages, so some parts of the episode were taken out. One of the parts that were taken out was Herb trying to get on a train to the Simpsons' town Springfield. Writers later put this idea in the season 8 episode \"Burns, Baby Burns\". There was going to be a joke about the Soviet Union breaking up. This was not put in the episode because the Soviet Union broke up after the episode was done being written (and it was not broadcast yet). Joe Frazier guest stars as himself in the episode. He was in Burns' ceremony for Homer's fake award. Al Jean said that it was hard for Frazier to say the word \"excellence\" right. George Meyer said that Frazier said it right after 20 tries. The episode was going to show Barney Gumble beating Frazier in boxing. Frazier was a world heavyweight championship before. Frazier's son did not want that part of the episode to be shown. He said that Frazier was a world champion, \"and a world champion does not get knocked out. My dad has only been knocked down twice, and that was by George Foreman.\" Producers wanted Foreman to be in the episode, but they could not get him in. == Reception == The episode got a Nielsen rating of 10.7. This means that the episode was seen in about 9.76 houses. It got the second best ratings of the week on the Fox network (the first being the 44th Primetime Emmy Awards). Warren Martyn and Adrian Wood (authors of I Can't Believe It's a Bigger and Better Updated Unofficial Simpsons Guide) liked the episode. Parts of the episode they liked the most were Homer in the vibrating chair and Maggie using Herb's machine for babies. David Eklid from The Guardian said that this episode, \"Lisa's Pony\", and \"Stark Raving Dad\" make the 3rd season \"pretty much the best season of any television show, ever.\" Nathan Ditum from Total Film thought that the episode referencing the movie 2001: A Space Odyssey was one of the best movie references of The Simpsons. Nate Meyers from Digitally Obsessed talked good about Herb being in another episode. Meyers said that Herb is \"a perfect sibling\" for Homer and said the episode has \"plenty of laughs\". Bill Gibron from DVD Verdict liked the jokes about the vibrating chair and thought that producers did a good job of putting Herb in another episode. Colin Jacobson from DVD Movie Guide thought that DeVito being the voice of Herb \"helps make the show more successful\" and said \"they really need to being him back one of these days.\" Tom Adair from The Scotsman called it a classic episode. Bill Gibron thought that DeVito was a good choice for Herb. He said that he is the opposite of how Dan Castellaneta does the voice of Homer. Nathan Ditum put DeVito on his list of the 20 best guest stars of The Simpsons. == References == == Other websites == * * Category:The Simpsons (season 3) episodes Category:1992 television episodes",
 "title": "Brother, Can You Spare Two Dimes?"
}