{
 "id": "838032",
 "text": "The 2024 presidential campaign of Joe Biden was announced by Joe Biden, the 46th president of the United States. He announced his reelection campaign for the 2024 presidential election on April 25, 2023. Biden won enough delegates for the nomination for the Democratic primaries to be reelected as president and was the presumptive nominee. On July 21, 2024, Biden ended his reelection campaign. He endorsed Vice President Kamala Harris for the presidential nomination. == Background == After Biden won the 2020 United States presidential election, he became the first presidential candidate to defeat an incumbent president since the 1992 presidential election. Biden also became the oldest president ever elected in the United States. During late 2021, as Biden was suffering from low approval ratings and nationwide polls urged Biden not to run for reelection due to his unpopularity and his age. In November 2022, Donald Trump, who Biden had defeated in the 2020 election, announced his candidacy for a non-consecutive term. ===Debate performance and crisis=== The first presidential debate was held on June 27, 2024, between Biden and Republican nominee Donald Trump. Biden's performance was criticized by many, with commentators saying he lost his train of thought and did not give good answers. Many newspaper columnists said that Trump won the debate. Polling showed that a majority of the public believed Trump won. After the debate had people questioning his health, Biden faced calls to drop out from the race, including from fellow Democrats donors and newspapers of several major news outlets. Biden said that he would remain a candidate. ==Suspension== On July 21, 2024, Biden ended his reelection campaign and endorsed Harris's campaign, 29 days before the beginning of the 2024 Democratic National Convention. As of July 22, 2024, Harris had secured enough delegates to become the presumptive Democratic nominee. This is the first time an eligible incumbent has withdrawn from reelection since Lyndon B. Johnson in 1968. ==References== Biden, Joe Category:Joe Biden",
 "title": "Joe Biden 2024 presidential campaign"
}