{
 "id": "838188",
 "text": "São Jacinto, also known as San Jacinto or Sao Jacinto, is an island at the tidal mouth of the Zuari River in the Indian state of Goa. It is one of the few islands of Goa where human settlement exists, which is located on the west coast of the Indian peninsula. The island is closest to the estuary's southern banks and is connected to the mainland via a bridge with a motor-able road named \"Silver Gate.\" The island is home to an abandoned lighthouse that is passionately protected by the locals. Close to the lighthouse, on top of the São Jacinto hill, stands a rebuilt St. Dominicks Peter & Paul's Chapel which was first built in the late 50s. A church in the name of St. Hyacinth, the patron saint of the island, overlooks the waters of the river towards the east. On the last Sunday of September, the villagers hold a feast in honour of the church. The local residents of São Jacinto, who are a fishing community, have been living there since the Portuguese times in beautiful little houses located in the South-West of the island consisting of both native Goan and typically Portuguese Goan architecture. Earlier, there used to be a causeway that would connect São Jacinto to the mainland. ==Biodiversity== The island is home to a number of species and is considered a biodiversity hotspot, where species like the window-pane oysters, plate corals, clams, and crabs are found. The islanders, being protective, have taken the responsibility for ensuring a balance between species conservation and fishing for a livelihood. Having disallowed commercial use of the island and obstructing the advances of industrialization, San Jacinto remains a well-conserved treasure trove of nature and natural beauty. ==Coastal Zone Management Controversy== A report on the Coastal Zone Management Plan was released in 2021 and displayed at the Chicalim village Panchayat. The report failed to show any of the approximately 200 houses on the island, also stating that it hosts a chapel that dates back to 1771 and thus should be cleared off. The people of São Jacinto were upset with the draft and took measures to reach out to relevant persons to protest the ignorance of the management. Before releasing the document, the political leadership had even assured the inhabitants that all houses on the island will be included in the draft before having it scrutinized it for final publication. The draft further listed the island under the Port Limits of Mormugao Port Trust. The reason behind this move is feared by the locals as it could allow the islanders to be at the mercy of the MPT which may transfer the serene land to industrial lobby groups and displace the people of São Jacinto in its stead. The villagers have refused to accept the injustice meted out to them, strongly resolving to protect their homeland at all costs. ==References== Category:Islands of India Category:Goa",
 "title": "São Jacinto"
}