{
 "id": "838218",
 "text": "Moti Daman Fort is in the Union territory Daman and Diu, i.e. Daman. It is 112 sq.km. in size. Daman has a little more than 243,000 people. The union territories of Daman and Diu and Dadra and Nagar Haveli have been combined into one unit. There are two forts in Daman, Moti Daman Fort and Nani Daman Fort. The Fort formally built originally by the Mughals and later Strenghtened by the Portuguese,the Myth of the Material used by the Mughals to build the fort Stones sand and Jaggry has we say in india it does make sense since Jaggry when it is a solid state has elements of glue properties so its possible that it could well be Jaggry, Moti Daman fort was built by the Portuguese. They began in 1559. The Fort of Moti Daman has an area of 30,000 sq metres and still has cannons on its walls. The original colour of the wall cannot be seen because moss has grown on it. The old buildings are still intact and people use them as government offices now. People can visit the fort. There is a lighthouse inside the fort. It has a view of the Moti Daman, Nani Daman and the beach. A house where the Portuguese poet Bokage lived is near the entrance of the fort. Inside the fort, there are three main churches, Church of Bom Jesus, the Chapel of Our Lady of the Rosary and the Church of Our Lady of Remedies. Church of Bom Jesus is the most famous of them all. ==Cathedral of Bom Jesus== The Church of Bom Jesus is an example of Portuguese architecture. It was established in the year 1559 and was consecrated in 1603. The Shrine, the wooden altars and the intricately carved gateways give off the vibe of the olden days. The southern entrance has the statues of six saints and the whole monument shouts of traditional Roman architecture. Both tourists and religious visitors come to see it. ==Nani Daman Fort== Nani Daman Fort is a small fort with high stone walls. It has two gateways with two huge human figures that face towards the Daman Ganga River. The Fort is a smaller version of Moti Daman Fort with an area of 12,250 sq. metres. The church of Our Lady of the Sea is one of the main buildings in it. ==References== Category:Forts in India Category:1559",
 "title": "Moti Daman Fort"
}