{
 "id": "838217",
 "text": "Budigere is a town in East Bengaluru, Karnataka, India. It is in Hoskote Taluk, Devanahalli block, Bengaluru Rural district. It is just off Old Madras Road. ==Location== Budigere is at the border of the Bengaluru Rural District. The post office of Budigere is Budigere B.O. The pin code is 56129. The police station is Hoskote Police Station. Budigere is 25.9 km from Bengaluru city. It is 8.8 km from Kempegowda International Airport. The nearest railway station is Whitefield Railway Station, which is 5km away. The closest bus depot is Hoskote bus depot. Budigere Cross is a neighborhood in Budigere. It is also connected to the Chennai-Bengaluru Corridor, KR Puram, Whitefield, Hoodi and Hoskote. There are several lakes in Budigere. One is the Bommenahalli Lake. The lake is mostly dried up. Its coordinates are 13째4'40\"N 77째44'41\"E. Manchapanhalli Lake is 4.3km away. Hoskote Lake is 6.1km away. Its coordinates are 13째4'28\"N 77째46'6\"E. The lake is famous for its bird sightings. Birds such as pelicans, kingfishers, strokes and yellow-billed blabbers can be spotted here. It is popular among bird watchers. The Lok Sabha constituency is the Chikkaballapur parliamentary constituency. The member of parliament is B.N Bache Gowda. Nimbekaipura (English: Lemon Town) is a village in Budigere Cross, Budigere. It is close to Mandur. It is believed that about 200-300 years ago, a lemon tree used to grow here. This tree was the only one closest to the neighborhood. As the village expanded, it was named Nimbekaipura after the tree. The tree was uprooted about 30 years ago due to a major storm. Due to the loss of the tree, surrounding villages do not travel to Nimbekaipura frequently. Today, several real estate properties have come up in the village. ==Nearby Areas== There are several temples in the area. Some of them are Sai Baba temple, Sri Sankashtahara Ganapati Devalaya and Sree Darmaraya Swamy Temple. Jamia Masjid, Madina Masjid and Makka Masjid are a few of the mosques in Budigere. https://www.justdial.com/Bangalore/Mosques-in- Budigere/nct-10328437 The schools in Budigere include Vibgyor High School, Sterling English School and New Baldwin International School. The colleges nearby are Surya Nursing College, Eat Point College of Engineering and Technology and Srinivasa College of Pharmacy. Mission Hospital, Sakra Hospital, Global Eye Foundation, East Point Hospital And College Of Medical Sciences are few of the hospitals in the area. There are no local parks in the area. Orion Uptown Mall has opened up in the neighborhood. Several builders such as Brigade, Prestige, Salarpuria have built gated communities here. ==Projects in the area== A railway project has been announced, which will provide connectivity to the Kempegowda International Airport (KIA), via Budigere Cross. Bus priority lanes will be set up on the KR Puram - Budigere Cross. A community organization called Budigere Raising is present. It consists of residents from the neighboring gated communities. They organize events such as cardiac health camp, free eye camp, blood donation drive, and free covid testing.https://m.facebook.com/pg/BudigerexRising/posts/?ref=page_internal&mt;_nav=0 ==References== Category:Towns in Karnataka",
 "title": "Budigere"
}