{
 "id": "838327",
 "text": "Fight the New Drug is an anti-pornography non-profit organization based in the United States. It was founded in 2009 and calls itself as \"a non-religious and non-legislative organization.\" Fight the New Drug says that pornography is like a drug, and argues that it is a public health issue. ==Activities== The group spreads its messages with presentations and videos. It focuses on people from ages 18 to 24. In a 2015 campaign, Fight the New Drug posted 100 billboards in the San Francisco Bay Area which said \"Porn Kills Love\". In addition, the group promotes its campaign using social media presence and by selling products, such as T-shirts and marketing kits. In 2016, the group is allowed to give its material to students in some public school districts in the United States. In 2018, the group released a three-part documentary film entitled Brain, Heart, World. ==Reception== ===Terry Crews=== Terry Crews, a former football player and actor, has endorsed Fight the New Drug. He also did an interview with Consider Before Consuming, a podcast by Fight the New Drug. In his book Manhood (2014), he wrote about how he was first addicted to porn at the age of 12 years old. It went on even when he grew up, eventually deeply affecting his marriage to his wife, Rebecca. ===Marisol Nichols=== Actress Marisol Nichols has publicly supported Fight the New Drug on social media. He also went on an episode of Fight the New Drug's Consider Before Consuming podcast, where she talks about her work on fighting human trafficking.Consider Before Consuming. ===Lamar Odom=== In August 2019, former NBA star Lamar Odom said he had given up pornography as part of building a healthier lifestyle for himself and for his future work in basketball. Lamar Odom went on an episode of Fight the New Drug's podcast, Consider Before Consuming. He has been seen several times wearing Fight the New Drug's signature \"Porn Kills Love\" T-shirt. ===Kansas City Royals=== In March 2018, the Kansas City Royals became the first Major League Baseball (MLB) team to take a stand against pornography. The Royals held an anti-pornography seminar for players during their spring training put on by Fight the New Drug. Dayton Moore, the Kansas City Royals General Manager, has talked about pornography before, saying, \"We talk about pornography, and the effects of what that does to the minds of players and the distractions, and how that leads to abuse of—domestic abuse—to abuse of women.\" ===Red Table Talk=== In May 2019, Garrett Jonsson, a Fight the New Drug presenter, was interviewed in Jada Pinkett Smith's show Red Table Talk in an episode called \"Does Porn Ruin Relationships?\" ===Elizabeth Smart=== In an interview with Fight the New Drug, Elizabeth Smart talks about how pornography had played a role in her kidnapping. Smart said of her kidnapper to Fight the New Drug, \"I can't say that he would not have gone out and kidnapped me had he not looked at pornography. All I know is that pornography made my living hell ... worse.\" Smart was also in a video made by Fight the New Drug, and continues to talk about the dangers of pornography. ===Chaz Smith=== YouTuber Chaz Smith has been a supporter of Fight the New Drug. Smith's May 2018 YouTube video, \"What Was He Looking At?\", shares statistics related to porn viewing and how it affects people. Chaz Smith also went with Fight the New Drug to Guatemala, where they did an anti-pornography presentation for locals.Chaz Smith. Consider before Consuming. August 6, 2019. ==Related pages== *NoFap ==References== ==Other websites== *Fight the New Drug (official website) Category:Anti-pornography activists Category:Non-profit organizations of the United States",
 "title": "Fight the New Drug"
}