{
 "id": "838332",
 "text": "Foster's Home for Imaginary Friends is a video game developed and published by Crave Entertainment and released for the Game Boy Advance line of handhelds on October 17, 2006. The game is based on the animated series with the same name. == Gameplay == The player controls Mac or Bloo. Both characters can throw paper balls, and you barely have to do that. Mostly you spend time collecting items to complete objectives. There are also three boss battles with Terrence, who mostly fires his slingshot and is accompinied by another enemy in the second and third battles. Mac and Bloo both have different abilities. Mac can slingshot paper balls (but only after the first fight with Terrence), double- jump to reach higher platforms, and duck to avoid flying objects. Bloo can roll his body into a ball to get into narrow spaces. Both of them have the abilities to slide down banisters, launch paper balls, talk to non-playable characters, and hide from enemies. Talking can give you an advantage. For example, every time the player would need to get up to a higher place that Mac can't double-jump to, if Wilt is around, talking to him will get him to lift the player up. Sometimes, you have to make it past enemies. Bendy is the most common enemy. He throws things down from above. Hitting him with a paper ball will make him cry and stop doing things for a short amount of time. Getting hit by an enemy will deplete the player's health, which is a row of three candies. Every time you get hit, you lose a candy, but you could collect more to replenish them. Dying will cause you to come from the door you last entered. The game has three minigames which can be unlocked by collecting Game-Hive tickets. When the player enters a door they might switch characters. The player is not in control of who they are using. Every time he or she enters a door, there is a chance of characters switching. In the final battle with Terrence and Duchess, the player can change between Mac and Bloo at any time. == Other websites == * Foster's Home for Imaginary Friends at IGN.com Category:Game Boy Advance games Category:2006 video games Category:Game Boy Advance-only games",
 "title": "Foster's Home for Imaginary Friends (video game)"
}