{
 "id": "838486",
 "text": "The Great Soviet Encyclopedia is one of the largest Russian-language encyclopedias,The 3rd edition contains more than 95,000 articles, and nearly 35,000 illustrations and maps. Compare with over 120,000 articles in the Russian Brockhaus and Efron Encyclopedic Dictionary (1890–1907) and with 100,000 in the 15th edition of Britannica submitted in the Soviet Union from 1926 to 1990. After 2002, the encyclopedia's information was partially added into the later Great Russian Encyclopedia in an updated and changed form. The GSE said to be \"the first Marxist–Leninist general-purpose encyclopedia\". == Origins == The idea of the Great Soviet Encyclopedia came in 1923 on the idea of Otto Schmidt, a member of the Academy of Sciences of the Soviet Union (today, the Russian Academy of Sciences). In early 1924 Schmidt worked with a group which had Mikhail Pokrovsky, (rector of the Institute of Red Professors), Nikolai Meshcheryakov (Former head of the Glavit, the State Administration of Publishing Affairs), Valery Bryusov (poet), Veniamin Kagan (mathematician) and Konstantin Kuzminsky to draw up a proposal which was chosen in April 1924. Also involved was Anatoly Lunacharsky. == Contributors == Contributors to the GSE are in this list. * Kliment Voroshilov == Translations == === English === The third version was translated and submitted into English in 31 books between 1974 and 1983 by Macmillan Publishers. Each book was translated separately, making use of the index found at the front of each book to locate specific items; knowledge of Russian can be helpful to find the right book the first time. Not all versions were translated into English; these are indicated in the index. Articles from the English version are made available online by TheFreeDictionary.com.TheFreeDictionary.com, Our Main Sources, Retrieved 17 August 2013. === Greek === The third version was translated into Greek and submitted in 34 books between 1977 and 1983 from Akadimos publishing company (owned by Giannis Giannikos), which has also translated various Soviet encyclopedias and literature. All articles that were related to Greece or Greek history, culture and society were expanded and hundreds of new ones were written especially for the Greek version. The encyclopedia contains, for example, both the Russian entry on Greece as well as a much larger one prepared by Greek contributors. Each article written especially in the Greek version is marked with the note \"Greek version supplement\" (or \"Συμπλήρωμα ελληνικής έκδοσης\" as written in the Greek translation). Finally, a supplementary book covering the 1980s was submitted in 1989. It contains translated and original Greek articles which, sometimes, do not exist in the 34-book set. The articles of the Greek version are being gradually made digital now; the digital books can be found on \"vivlio2ebook\" blog, which is dedicated on digital various books in Greek language. == Great Russian Encyclopedia == Publication of the Great Soviet Encyclopedia was suspended in 1990 and halted in 1991, but in 2002 it was reinstituted by decree of Vladimir Putin. In 2003 and 2004 a team of editors overhauled the old encyclopedia by updating facts, removing most examples of overt political bias, and changing its name to the Great Russian Encyclopedia. Many outdated articles are being entirely rewritten. In 2004 the first book of the newly overhauled Great Russian Encyclopedia was submitted. The complete version of 35 books was released by 2017. Publication of the Great Russian Encyclopedia is overseen by the Russian Academy of Sciences, and funded by the Government of the Russian Federation. The encyclopedia is now found in libraries and schools throughout the CIS. Additionally, the 1980s versions remain in widespread use, particularly as references in scientific and mathematical research. == Related pages == * Damnatio memoriae * Encyclopædia Britannica == References == === Sources === * Great Soviet encyclopedia, ed. A. M. Prokhorov (New York: Macmillan, London: Collier Macmillan, 1974–1983) 31 books, three books of indexes. Translation of third Russian version of Bol'shaya sovetskaya entsiklopediya * Kister, Kenneth. Kister's Best Encyclopedias. 2nd ed. (1994) == Other websites == * Great Soviet Encyclopedia online * TheFreeDictionary.com's encyclopedia section displays results from the English version of the Great Soviet Encyclopedia. * Beginning of the Great Soviet Encyclopedia issue Category:Encyclopedias",
 "title": "Great Soviet Encyclopedia"
}