{
 "id": "838415",
 "text": "Balmuri Falls is a small water body that runs through Srirangapatna, Karnataka. The cascading water is a man-made waterfall over a dam. The Cauvery River flows through, with lush greenery and tall coconut trees surrounding it. ==Location== The falls act as a tourist attraction but also continues to run along areas such as It is a car ride away from the city of Mysore and a mid- point for those traveling from Bangalore to enjoy its scenic views. Balmuri Falls is around 16.5 kilometres away from the Mysore and 138 kilometres away from Bangalore. Not only can one experience these falls but they can also visit Edmuri Falls, that flows a few kilometres away. ==History== Its name is derived from the local language, Kannada and is named so due to the direction that river flows in. ‘Bala’ in the state’s language means, ‘Right’ while ‘Muri’ is ‘Turn.’ As the river flows slightly in a right direction, the dam thus, got its name. The dam was constructed in attempts to hold water of the Cauvery River. It was mainly built to help and control irrigation of the fields surrounding the river. Once it fills up, river water falls down a length of 6 to 7 feet from over the dam wall. The length of the dam approximately 1.6 km and drops off into the flow of mini waterfall due to a descent of 6 feet. ==Activities== The waterfall is open throughout the year for tourists but, it is most enjoyable from March to August. The summer time is apt to go for a dip or swim the Balmuri’s waters. The water levels are also relatively low during these months, making it safe to take a walk or play in it. Winter months can be pleasant to visit as well. Visitors can choose this spot as a destination for picnics and leisurely strolls. There are also facilities for seasonal boat rides at the water cascade, when water levels are high enough. Along with this there are food stalls from which visitors can buy fresh food from. ===Ranganathittu Bird Sanctuary=== There are many other tourist attractions that can be visited near and around the vicinity, including this vast sanctuary. Being the largest of its kind in the state, it holds ground to many exotic, migrant and native birds. Is located 10 kilometres away from the falls and stretches across 40 acres of land. ===Brindavan Gardens=== These gardens are known to be Mysore city’s greatest attraction. The vicinity also has the Krishna Raja Sagara Dam (KRS) built on the Cauvery river. Brindavan Gardens stretches over 60 acres and is located 8 kilometres away from Balmuri Falls. ===Daria Daulat Bagh=== This tourist attraction is also near Balamuri Falls and is known to be the summer palace of Tipu Sultan, a king from the Kingdom of Mysore. The palace is filled with history that visitors can experience, first hand. It stands 14 kilometres away from Balmuri Falls. ==News== Though the falls have become a great tourist attraction, 48 deaths have been reported since 2008. Many of the youth from different districts in Karnataka have visited, some drowning to death. The depth of the water during the Monsoon season has been difficult to measure, causing many to drown. This has been caused due to numerous whirlpools that have acted as “death traps.” Authorities have reported many of the fatalities to be men under the influence of alcohol found at nearby shops. At certain periods of time, authorities have had to close down access to the falls due to opening of the Krishnaraja Sagar Dam (KRS). This dam holds most of the water flowing through the river Cauvery which surpasses dangerous levels that tourists can handle. ==Related pages== * Brindavan Gardens * Ranganathittu Bird Sanctuary * Daria Daulat Bagh * Mysore Palace * Srirangapatna ==References== Category:Waterfalls Category:Karnataka",
 "title": "Balmuri Falls"
}