{
 "id": "838442",
 "text": "The South Indian state of Karnataka experienced heavy floods on 18 August 2020 continuing till late October due to heavy rainfall. This was added trouble to the existing problem of pandemic caused by the virus, COVID19. Even before flood hit the areas, the Karnataka State Natural Disaster Monitoring Centre predicted floods in the month of June itself, basing the observation on destruction caused in 2019 floods of the state. The flood fury was seen in 23 districts of the state, out of which the Malenadu region and all the districts of Coastal Karnataka were declared in flood zones. The districts like Belagavi, Kalburgi, Raichur and Bagalkot in northern part of the state received rainfall almost touching the highest of 21cms, which in normal conditions is as low as, below 10cms. The Malenadu regions like Bhagamandala, Aiyamageri received 647mm of rainfall on an average in the year 2020. == Causes == Apart from increased downpour in the state, many different reasons have been reported regionally. The capital of the state, Bengaluru is known to have more rainfall on an average, but in the last decade flood instances have cropped up time and again, it is attributed to amplified urbanisation causing stress on the natural resources, encroachment of flood plains, loss of vegetation and biodiversity, improper city planning leading to reckless constructions of sites and buildings. Along with these reasons, change in the river course of movement, deforestation and land modifications to accommodate tourists have been the reasons for recurring floods and landslides in Malenadu region of the state. In northern Karnataka, heavy discharge of water from the Dams in Maharashtra and Karnataka, also aggravated the situation. Release of water from Ujjani Dam built on the river Bhima in Maharashtra rooted for flooding of 400 villages in Vijaypura, Kalburgi and Yadgir district. The Ghataprabha, Malaprabha, Tungabhadra, Almatti and Narayanapura, reservoirs were filled to the brim affecting Yadgir, Raichur, Ballari, Bidar, Vijayapura, Bagalkot, Belagavi, Dakshina Kannada, Udupi, Uttara Kannada, Gadag, Koppal, Haveri and Dharwad districts in north Karnataka. === Humanitarian response === The Karnataka Civil Administration called for a humanitarian response towards the destruction caused due to the floods. Twenty flood relief and ten Engineering Task force from Madras Engineering Group, Maratha Light Infantry Centre and Bison Division from Hyderabad were also employed to provide assistance in Yadgir, Gadag districts. More than two thousand crore rupees from State Relief Natural Disaster Fund was demanded for rebuilding houses, reestablishment of the lost livestock and creation of jobs. There was also a demand for extension of work days under the Mahatma Gandhi National Rural Employment Generation Scheme by the state government in the light of fractured employment system due to the spread of COVID19 and loss of agrarian activities in floods. == References == Category:2020 disasters in Asia Category:Floods in India Category:2020s disasters in India Category:2020 floods",
 "title": "2020 Karnataka Floods"
}