{
 "id": "838421",
 "text": "Before 1883, the U.S. state of New Hampshire used to have a 3rd congressional district. The last representative is Republican Ossian Ray. ==List of representatives== Member Party Years Cong ress Electoral history District made on March 4, 1847 District made on March 4, 1847 District made on March 4, 1847 District made on March 4, 1847 District made on March 4, 1847 James Wilson II Whig March 4, 1847 – September 9, 1850 Elected in 1847. Re-elected in 1849. Resigned. Vacant Vacant September 9, 1850 – October 8, 1850 George W. Morrison Democratic October 8, 1850 – March 3, 1851 Elected to finish Wilson's term. Lost re-election. Jared Perkins Whig March 4, 1851 – March 3, 1853 Elected in 1851. Lost re-election. Harry Hibbard Democratic March 3, 1853 – March 3, 1855 Redistricted from the and re-elected in 1853. Retired. Aaron H. Cragin American March 4, 1855 – March 3, 1857 Elected in 1855. Re-elected in 1857. Retired. Aaron H. Cragin Republican March 4, 1857 – March 3, 1859 Elected in 1855. Re-elected in 1857. Retired. Thomas M. Edwards Republican March 4, 1859 – March 3, 1863 Elected in 1859. Re-elected in 1861. Retired. James W. Patterson Republican March 4, 1863 – March 3, 1867 Elected in 1863. Re-elected in 1865. Retired to run for U.S. senator. Jacob Benton Republican March 4, 1867 – March 3, 1871 Elected in 1867. Re-elected in 1869. Retired. Hosea Washington Parker Democratic March 4, 1871 – March 3, 1875 Elected in 1871. Re-elected in 1873. Lost re-election. Henry W. Blair Republican March 4, 1875 – March 3, 1879 Elected in 1875. Re-elected in 1877. Retired to run for U.S. senator. Evarts Worcester Farr Republican March 4, 1879 – November 30, 1880 Elected in 1878. Re-elected in 1880 but died before the next term began. Vacant Vacant November 30, 1880 – January 8, 1881 Ossian Ray Republican January 8, 1881 – March 3, 1883 Elected December 28, 1880 to finish Farr's term and seated January 8, 1881. Also elected December 28, 1880 to the next term. Changed to the . District removed on January 8, 1881 District removed on January 8, 1881 District removed on January 8, 1881 District removed on January 8, 1881 District removed on January 8, 1881 == References == 03",
 "title": "New Hampshire's 3rd congressional district"
}