{
 "id": "838535",
 "text": "The Inquiry was a study group that U.S. President Woodrow Wilson created to help him decide what the post-World War I peace should look like. The Inquiry made various suggestions about this topic, some of which were adopted and some of which weren't adopted. Some members of the Inquiry ended up creating the Council on Foreign Relations (which is independent from the U.S. government) later on. ==The Inquiry's suggestions== The Inquiry said that the German Empire should give Alsace-Lorraine back to France, that France should get the parts of the Saarland that it controlled before 1815, that the Rhineland should be demilitarized, that Belgium stop being neutral, that Belgium should get some territory in the Maastricht and Malmedy regions, that Luxembourg should either be annexed to Belgium or have its independence brought back, and that there should be a vote in northern Schleswig to decide whether it will stay with the German Empire or rejoin Denmark. The Inquiry also said that if Russia could become a real democratic federation, then the Baltic states (other than Lithuania) and Ukraine should reunite with Russia since this would be in the best economic interests of everyone. The Inquiry also said that if the Bolsheviks will keep control of Russia, then the independence of both the Baltic states and Ukraine would have to be recognized on the condition that there would be a vote in these territories on a future reunion with Russia once Russia will stop being ruled by Bolsheviks. The Inquiry's proposed borders for Latvia, Estonia, and Ukraine were very similar to the borders that these countries had after 1991 in real life, with the Inquiry even saying that Ukraine should get Crimea. The Inquiry also said that Finland should be given its independence, that the Aland Islands should be given to Sweden, that an independent Poland be created along with a Polish Corridor so that it could have secure access to the Baltic Sea, that Poland and Lithuania should reunite, and that the door should be kept open for Poland to get both eastern Galicia and the Belarusian-majority territories to its north. The Inquiry said that Wilsonian Armenia should get independence and also that both Georgia (country) and Azerbaijan should get provisional independence, with the Inquiry having a favorable view of the idea of a future union between Armenia, Georgia, and Azerbaijan. The Inquiry said that Czechoslovakia should be created in roughly the same borders that it was created in real life, with a combined Czech and Slovak majority but also with sizable German, Hungarian, and Ukrainian (Ruthenian) ethnic minorities. Similarly, the Inquiry's advice for Romanian expansion (into Transylvania, Bukovina, the eastern Banat, et cetera) and the creation of Yugoslavia were also followed. The Inquiry also said that Italy should get a northern border slightly to the south of the Brenner Pass in order to reduce the number of Germans who would end up under Italian rule without weakening Italy's security; this advice was not followed since Italy got the Brenner Pass border. The Inquiry also said that Italy should annex Istria but not Fiume due to the latter's importance for Yugoslavia but in spite of this, Italy ultimately ended up annexing both of these territories. The Inquiry said that both German Austria and Hungary should acquire and keep their independence and that Austria should not reunify with Germany-at least not yet. Also, the Inquiry said that Hungary should keep the Burgenland until it actually becomes clear that its people actually want to join German Austria. The Inquiry gave no advice for Albania due to the complexity of the situation there. However, it did say that Constantinople should be made into an international state, that an independent Turkish state to be created in Anatolia under a League of Nations mandate, that independent Mesopotamian and Greater Syrian states should be created under League of Nations mandates, and that the option of an Arab confederation that includes both Mesopotamia and Syria should be kept option for the future. The Inquiry said that an independent Palestinian state under a British mandate should be created in Palestine that would also be a Jewish national homeland where Jews would be free to settle and would have their rights and freedoms respected. The Inquiry kept open the door to Palestine eventually getting a Jewish- majority population as a result of mass Jewish immigration into there. Finally, the Inquiry said that the King of Hejaz should not be given help to impose his rule on unwilling Arab tribes. ==References== Category:1917 establishments Category:Political organizations based in the United States",
 "title": "The Inquiry"
}