{
 "id": "838585",
 "text": "Zheng Xiaoqiong (Chinese: 郑小琼') is a Chinese poet. She was born in Nanchong, Sichuan on June 18, 1980. == Early life == Zheng studied at a nursing school. Then she worked in a hospital. In 2001, she quit that work because she was not happy with the working conditions. She moved to Dongguan. In that city, she began working in factories as an assembly-line worker. == Life as a poet == Zheng began writing poetry about the conditions of factory workers. Some time around 2005, she began to become famous. In 2007, she won the Liqun Literature Award, which made her more famous. Zheng has published many books of her poetry. She has received many awards for literature. Her poetry has been translated into other languages. === Poetry === \"Characterized by stark oppositions, personifications, and broken phrases, her work is razor-sharp in its observations. Iron is perhaps the element most strongly associated with Zheng Xiaoqiong's poetry. . . . Her poems reveal how pervasive industrialization ensures that humans become part of the machine: nameless, a number on an assembly line, without rights. == Awards == The first literary award Zheng won was the Liqun Literature Award from Peoples’ Literature in 2007. \"The impact was strong – not simply because few had heard of her, but because she lives and works as a migrant worker and writes poetry so startlingly beautiful, vulnerable, and powerful, that nearly each poem stops one’s breath mid-line.\" She has also won the Zhuang Chongwen Prize, a youth literature award. ==References== == Further reading == * Zhang, Qinghua. \"Who Touches the Iron of the Age: On Zheng Xiaoqiong's Poetry,\" Chinese Literature Today. 1.2 (Summer 2010): 31–35. * New Cathay: Contemporary Chinese Poetry, edited by Ming Di (Tupelo Press, co-published by Poetry Foundation, USA, 2013) * Zhou Xiaojing, 2014, \"A musical note of our era: ZHENG XIAOQIONG’S POETRY,\" https://www.poetryinternational.org/pi/cou_article/24310/A-MUSICAL-NOTE-OF- OUR-ERA-ZHENG-XIAOQIONGS-POETRY/en/tile * Zhou Xiaojing, 2016, \"Zheng Xiaoqiong's Poems on the Global Connection to Urbanization and the Plight of Migrant Workers in China,\" Studies in Global Asias Vol. 2, No. 1, Asian Urbanisms and Urbanization (Spring 2016), pp. 84-96. https://doi.org/10.5749/vergstudglobasia.2.1.0084 == Selected publications by the poet == * \"Shame: A Poem from China\" https://www.worldliteraturetoday.org/blog/poetry/shame-poem-china-zheng- xiaoqiong * Female Migrant Workers. Guangzhou: Flower City Publishing House, 2012. * Pedestrian Overpass. Taiwan, Taibei: Tanshang Publications, Inc., 2009. * . Poems Scattered on the Machine. Beijing: China Society Publishing House, 2009. Category:Chinese poets Category:1980 births Category:21st-century Chinese poets",
 "title": "Zheng Xiaoqiong"
}