{
 "id": "838511",
 "text": "Yemalur Main Road begins at Borewell Crossing at HAL Old Airport Road in Bangalore, Karnataka, India. It runs behind the HAL Airport and meets with Wind Tunnel Road that connects to Murugesh Palya further West on Old Airport Road. Yemalur Main Road falls under the Marathahalli Ward and C.V. Raman Nagar assembly constituency. The MLA (Member of the Legislative Assembly) of the constituency is S. Raghu. It falls under the Bangalore Central parliamentary constituency. The MP (member of Parliament) of the constituency is P.C. Mohan. == Limits == Yemalur Main Road begins on Old Airport Road from the Borewell Crossing. The road follows the length of the rear wall of the HAL Flight Testing Centre (HAL Airport) up until a narrow, kuccha pathway through Kempapura, which eventually opens out into Wind Tunnel Road. Its coordinates are from 12.955214, 77.689368 to 12.946359, 77.670829. The pincode of Yemalur Main Road is Bangalore 560037. It lies in the Bangalore South taluk, and Bangalore East postal division. A wide turning on Yemalur Main Road leads to the Bellandur Lake, defining the limits of Yemalur Village between the Bellandur lake and HAL airport. == Neighbourhood == The neighbourhood of Yemalur Main Road is a mixture of various economic classes of people. Where there are several high-rise apartments and villaments, there are also single- room apartments lining the road. The following is a list of apartments (along with villaments) on Yemalur Main Road (in the order that they appear starting at Borewell Crossing to the end of the road which meets at Wind Tunnel Road). # Sobha Palladian # Divyasree 77 Place and East #Epsilon Residential Villas # Balaji Residency # HPR Nests #Nanjappa Complex # Matrushree Village Homes # Sri Dhakshayani Apartments # LN Residency # Sri Sai Home Apartments # Adi Bhairava Apartment # BNM Residency #Ashama Building #Lakshmi Mahadev Nivasa #Prestige Kew Gardens #Rohan Jharoka II Apartments #Panwar House Apartments #PV Enclave # Paranjape Windfields # Lakshmi Bhargav Heights ===Offices in the area=== There is an important tech park at Yemalur Main Road called Divyasree Technopolis. This technopolis houses the offices of CGI Inc, Fujitsu, Thomson Reuters, Aditya Birla Group, Deloitte and Landmark Group. ==Notable places== There are several small temples that one may visit in the Yemalur area. These include Ranganatha Temple, Ganesha Temple, Basavanna Temple, Mulakantamma Temple and Shani Temple. Another notable place close to Yemalur Main Road is Yemalur Bridge. It was constructed at the boundary of Yemalur Village to connect it to Bellandur Lake Road after there were complaints that the lake flooded into homes in Yemalur after heavy rainfall. This bridge paves the way between Bellandur and the offices at tech parks at Yemalur Main Road. == Schools == The schools in the Yemalur Main Road area are mostly primary schools, except for Neev Academy (which has classes up to high school). Neev Academy is located 550 metres away from Yemalur Bridge. The primary schools in this area are as follows. * Klay Preschool and Daycare * Bloomdale Preschool and Daycare * Eurokids Preschool * Kiddi International Academy * Government Primary School * Kidzee Yemalur * Oi Play School * SmartKidz Pre School == Links and Nearby Areas == Yemalur Main Road has links to several locations in india. === Marathahalli === Marathahalli lies to the East of Yemalur Main Road. 500 metres into the road, there is a kuccha road or walkway to go to Marathahalli market. You cannot drive through this path, only walk or cycle. === Yemalur Village === Yemalur Main Road gets its name from being the road that takes you from HAL Old Airport Road to Yemalur Village. ===Wind Tunnel Road=== The NAL Wind Tunnel Road begins where Yemalur Main Road ends. It provides a link between Yemalur and Bellandur to Murugesh Palya, Old Airport Road. === Bellandur Lake Road === A wide turning on Yemalur Main Road will take you straight to Bellandur Lake Road. This lake is commonly known as Snowfall Lake. This is because the pollution in the lake creates a stinky, white foam. This foam has even caught fire a few times. === Bellandur === The Bellandur Lake Road starting in Yemalur is the way towards Bellandur. This will take you the Bellandur Main Road, which eventually leads out to the Outer Ring Road. === HAL Flight Testing Centre === The HAL Flight Testing Centre or HAL Airport runs adjacent to the Yemalur Main Road. Residents of this road are prone to hearing the loud noise created by the aircrafts while they take off and land. The noise has increased as of December 2020 because the Flight Testing Centre was made an airport for chartered aircrafts. === Kempapura === Kempapura is the area between the end of Yemalur Main Road and the beginning of Wind Tunnel Road. ===Ambedkar Nagar=== Ambedkar Nagar falls directly after Kempapura towards the direction of the East. ==Prominent problems== One of the main problems in homes and workplaces in and around Yemalur Main Road include the stench which comes from Bellandur Lake. The foam is another issue which causes major grievance to the residents in the area. This is accompanied with the flooding of several homes in Yemalur Village and neighbouring areas by Bellandur Lake. This often used to happen after heavy rains. Another problem that residents of Yemalur Main Road and Yemalur Village have is the road problem. The narrow connecting street between Yemalur Main Road and Wind Tunnel Road is a 300 metre stretch which is terrible quality and has potholes all over it. This road is the official property of HAL Bengaluru, so the fixing of potholes is the responsibility of HAL. Due to lack of funds, this road has not been repaired. ==Upcoming Projects== Hatha Coco Nest is an upcoming apartment building in the Yemalur Main Road area. Possession of flats in this apartment will begin in June 2021. Other recent constructions in the area include Sai Smaran Sai Garden, Prestige Kew Gardens, Rohan Jharoka II Apartments, R.S. Green View Apartments and Sai Johith Homes. == References == Category:Bangalore",
 "title": "Yemalur Main Road"
}