{
 "id": "838589",
 "text": "Jawahar Nagar is a residential colony located in the Kowdiar locality in the city of Thiruvananthapuram, Kerala, India. It is a prime housing locality in the city boasting various dignitaries and cinema actors as its residents. It also houses bureaucrats from UAE, which holds a permanent residence in the colony. The center of the colony holds a single storied commercial building featuring small local business. Recently, various upscale cafes have also made their debut in the area increasing the face value of the posh colony. == History == Jawahar Nagar, established in November 14, 1964 is the first planned residential colony in the state of Kerala. The colony was developed under the leadership of then Chief Town Planner, Thomas Paulose, who is still a resident of the colony. Before it was named Jawahar Nagar, the area was refereed to as Maracheenivila. Maracheeni translates to Tapioca in Malayalam. This was in reference to large tapioca farms that were cultivated on the land. In the late 1800s, during the reign of Ayilyam Thirunal Rama Varma, king of the princely state of Travancore, tapioca was imported into the country from Brazil to fight a famine that hit the state. This process in turn made Jawahar Nagar the first area where tapioca was locally cultivated in India. A research center was also established within the locality. This center was later transformed into the Jawahar Nagar Lower Primary School during the redesigning stages. The entire colony was modeled after the British Housing Scheme with playgrounds, wide roads and a welfare association. The colony also houses Saraswathy Nilayam, the first multi-storied apartment building to be constructed in the city, and overall second in the state. == Transportation == Public transportation do not ply along through the locality with the exception of auto-rickshaws and taxis. Nevertheless, the colony is situated right beside Kowdiar Main Road next to the Kowdiar Palace. The juxtaposition of the colony makes it convenient for its residents to get in and out of the bustling city life. == Community == === Schools === Jawahar Nagar Lower Primary School and Nursery is the oldest school in the locality. In recent years, multiple daycare centers have commenced operations, namely L'ecole Chempaka Daycare and Nursery. They have also started L'ecole Chempaka International Primary School for classes from LKG to 5th grade. === Residents Association === The Jawahar Nagar Resident Association is in charge of all activities concerning the locality. It conducts Annual General Body meetings to decide on various matters concerning the colony. It is also in charge of maintaining the K.P.K Menon Memorial Playground and the badminton court nearby which has been allotted to the sole use of the residents of the locality. The initiative undertaken by the association has made Jawahar Nagar in getting voted the cleanest colony in Thiruvananthapuram on multiple occasions === Notable Residents === Jawahar Nagar has been the choice of residence for multiple eminent personalities. Some of them are EMS Namboothiripad, K. Karunakaran, actor Mohanlal, Thikkurisi Sukumaran Nair, V.K. Krishna Menon, etc. The Raj Bhavan, where the Governor of Kerala resides, is situated adjacent to the colony with two entrances to the house located within the locality. The colony also hosts dignitaries from the UAE, which holds two houses within the locality. The members working at the UAE Consulate reside here. == References == Category:Settlements in Kerala",
 "title": "Jawahar Nagar"
}