{
 "id": "838758",
 "text": "Max Emilian Verstappen (born 30 September 1997) is a Dutch and Belgian racing driver. He first started driving in Formula One in 2015 for Toro Rosso. He then moved to the Red Bull Racing team in 2016. He was born in Belgium but drives for the Netherlands. His father is Dutchman Jos Verstappen, who also was an F1 racing driver. His mother is Belgian Sophie Kumpen, who was a kart driver winner. Kumpen raced against Christian Horner, who is the head of the Red Bull team. Verstappen won four F1 world championships from 2021 to 2024. == Formula One career == ===Scuderia Toro Rosso (2014–2016)=== During the first practice session at the 2014 Japanese Grand Prix, Verstappen replaced Jean-Éric Vergne as part of his preparation for a full-time seat at Toro Rosso in the season. Aged 17 years and three days, Verstappen was the youngest person in history to participate in a Formula One race weekend. In August 2014, Verstappen joined the Red Bull Junior Team after testing a Formula Renault 3.5 car. He also considered an offer from Mercedes to join their driver development programme. Verstappen became the youngest driver to start a World Championship race through joining Toro Rosso's race drivers' lineup with Carlos Sainz Jr. as his teammate, in his Grand Prix debut as a full-time driver at the 2015 Australian Grand Prix at the age of — breaking Jaime Alguersuari's existing record by almost two years. However, at the subsequent race in Malaysia, Verstappen qualified sixth and finished the race in seventh place, scoring his first Formula One points aged , breaking the record of the then-youngest driver to score World Championship points. At the 2015 Monaco Grand Prix, Verstappen was involved in a high-speed collision with Romain Grosjean, after clipping the back of Grosjean's Lotus on the approach to the tight first corner, Sainte Devote, and crashed into the barriers at high speed. Verstappen was given a five-place grid penalty for causing the accident, and was branded \"dangerous\" by Williams driver Felipe Massa. Verstappen continued to regularly finish in the points as well as achieving his best finish of the 2015 season in Hungary by finishing fourth, and equalled this result at the United States Grand Prix. At the end of the season, Verstappen received three awards at the FIA Prize Giving Ceremony, for \"Rookie of the Year\", \"Personality of the Year\" and \"Action of the Year\", for his overtake on Felipe Nasr on the outside of the Blanchimont corner at the Belgian Grand Prix. Verstappen began the 2016 season at Toro Rosso, again alongside Sainz. Verstappen qualified fifth for the opening race of the season in Australia, but during the race made several radio calls to his team due to frustration at being behind Sainz on track before Verstappen's Toro Rosso came into contact with his teammate's car whilst attempting to pass him with three laps to go, and he eventually finished tenth. Verstappen enjoyed a more successful weekend at the following race in Bahrain, finishing sixth to score Toro Rosso's first-ever points at the Sakhir circuit. ===Red Bull (2016–)=== On 5 May 2016, following celebrating victory at the 2016 Catalan Grand Prix in Toro Rosso, Red Bull Racing announced that Verstappen would be replacing Daniil Kvyat from the Spanish Grand Prix onwards, with Kvyat returning to Toro Rosso. According to Red Bull Team Principal Christian Horner, \"Max has proven to be an outstanding young talent. His performance at Toro Rosso has been impressive so far and we are pleased to give him the opportunity to drive for Red Bull Racing. After qualifying fourth for the Spanish Grand Prix, Verstappen rose to second behind teammate Daniel Ricciardo on the opening lap after Mercedes teammates Lewis Hamilton and Nico Rosberg crashed out of the race. Verstappen took the race lead as he was placed on a two-stop rather than the same three-stop strategy as Ricciardo, and he held off Ferrari's Kimi Räikkönen in the later stages of the race to take his first Formula One victory. During the Belgian Grand Prix, Verstappen collided with Räikkönen at the first corner, pushed Vettel, Räikkönen and Pérez wide at Les Combes, and aggressively blocked Räikkönen on the Kemmel straight. Verstappen was criticised for his driving, with Räikkönen saying that he \"was going to cause a huge accident sooner or later.\" Christian Horner noted that the driving was \"on the edge\", and that Verstappen will \"look at it and learn for future races.\" In September, F1 director Charlie Whiting called in Verstappen for a discussion, and later gave him a 'gentle warning' due to his aggressive driving. However, in October, drivers' concerns about Verstappen's defensive tactics led the FIA to disallow moving under braking. At the 2016 Brazilian Grand Prix, Verstappen qualified fourth. In a rain affected race, he almost hit the barrier after he slid on the main straight due to a loss of traction, causing oversteer. After an additional tyre change from intermediates back to rain tyres, he ran in 16th place with just 15 laps remaining. Verstappen then made several overtakes in quick succession during the closing laps to eventually finish on the podium in third place. He received considerable praise for his performance: rival team Mercedes' team principal, Toto Wolff, labelled it \"The Verstappen Show\", and described Verstappen's drive as \"physics..being redefined\". However, Verstappen came under criticism from four-time world champion Sebastian Vettel, who stated that Verstappen had pushed him off the track at the Junção corner late in the race. The race stewards did not share Vettel's view and decided that no reprimand was warranted. During the first 14 races of the 2017 season, Verstappen suffered seven retirements, four due to mechanical issues, and three due to first lap collisions in Spain, Austria and Singapore. Of the races he finished, however, he claimed a third place in China, and in the another five races he finished fourth or fifth. From the Malaysian Grand Prix onward, Verstappen enjoyed a surge of success. He won his second Formula One race at the 2017 Malaysian Grand Prix, a day after his 20th birthday, passing then three-time champion Lewis Hamilton for the lead in the early stages of the race.He finished second in the following race in Japan. He then finished third at the United StatesGrand Prix, but was classified fourth after his final lap overtake on Kimi Räikkönen was deemed illegal. He won his third Formula One race at the Mexican Grand Prix, after passing Sebastian Vettel on the opening lap. ==== 2018 season ==== In the first six races of the season, Verstappen had been involved in at least one incident in each race. In Australia, he qualified fourth but fell behind Kevin Magnussen at the start. In his attempts to retake the position he ran wide multiple times and damaged his car, with a spin causing him to fall further down the order. He recovered to eventually finish the race in sixth place. At the next race in Bahrain, he crashed during qualifying and started in 15th place.He had a productive first lap after which he found himself in the points while challenging Lewis Hamilton. He attempted an overtake on the reigning World Champion at the start of lap two, but collided with the Mercedes driver and suffered a puncture that ultimately led to suspension damage, forcing him out of the race. At the next race in China, Verstappen qualified fifth and had moved up to third at the end of the first lap. Both Red Bull drivers pitted for fresh tyres during a safety car which left them with a tyre advantage over the front-runners ahead. In an overtake attempt on Sebastian Vettel for third place, Verstappen collided with the championship leader, causing him to fall to eighth and receive a 10-second penalty. He recovered to fourth place, with his penalty causing him to be classified fifth. Teammate Ricciardo went on to win the race. In Azerbaijan, Verstappen was embroiled in a race-long battle with Ricciardo for fourth place. After numerous position changes between the two teammates during the race, Ricciardo ran into the back of Verstappen during an overtake attempt from which the Dutchman aggressively defended, causing the retirement of both cars. Both drivers were blamed by the team and reprimanded by the stewards. Verstappen bounced back in Spain with his first podium of the season by finishing third behind the Mercedes drivers, holding off Sebastian Vettel. However, the race was also not without incident as he had run into the back of Lance Stroll during the virtual safety car period, causing minor front wing damage. In Monaco, Verstappen made another error and crashed near the end of the third free practice session in an incident which closely resembled a crash he had at the same spot two years earlier. His team could not repair his car in time for qualifying and Verstappen had to start the race from the back of the grid. Verstappen did not compete and did not set a lap time in qualifying, therefore teammate Ricciardo pressed home Red Bull's advantage at the track by taking pole position and the race win. Verstappen managed to salvage 2 points by finishing ninth place, overtaking 6 cars on track. Team principal Christian Horner commented on Verstappen's start of the season, saying he \"needed to stop making these mistakes\" and that he could \"learn from his teammate\", while Helmut Marko, head of driver development at Red Bull, said that Verstappen was \"too impatient\". Verstappen now lay in sixth place in the championship with 35 points, only three points ahead of Fernando Alonso in the McLaren, and 37 points behind his teammate in third, who had taken two wins in the first six races. In Canada, Verstappen topped all three practice sessions and qualified third, two-tenths off Sebastian Vettel in pole position. He eventually finished third and set the fastest lap of the race. The following race in France brought him second place. In Austria—Red Bull's home track, he started fourth on the grid, passed Kimi Räikkönen before taking advantage of retirement from Valtteri Bottas and a botched pit-stop strategy by Lewis Hamilton, who later had to retire from fourth place, to claim the fourth race victory of his career. In Britain, Verstappen was plagued by issues, finishing the first practice session early due to a gearbox problem and crashing in the second practice session before retiring from the race due to a brake problem. He would then finish fourth in Germany after strategy errors let a recovering Hamilton get past him as he went on to win the race. Verstappen ended the first half of the season with a retirement in Hungary and was narrowly behind his teammate in the championship due to his own recent resurgence and Ricciardo's unreliability. Verstappen enjoyed a very strong second half of the season, achieving podium finishes in Belgium, Singapore, Japan and the United States, the latter of which he achieved second place having started from 18th on the grid due to a suspension failure in qualifying. Following the qualifying session at the Mexican Grand Prix, Verstappen revealed that a mechanical problem with his Red Bull under braking cost him any chance of becoming the youngest-ever Formula One pole-sitter. As a result, Ricciardo beat Verstappen to pole position by just 0.026 seconds. Verstappen had a better start than Ricciardo and took the lead of the race into the first corner, overtaking the fast-starting Mercedes of Lewis Hamilton. Verstappen earned his fifth career win in Mexico. He was poised to win the 2018 Brazilian Grand Prix, having overtaken Räikkönen, Vettel, Bottas, and Hamilton. However, he collided with Force India driver Esteban Ocon who was trying to unlap himself on faster tyres. Ocon received a 10-second stop-and-go penalty for the incident. After the collision with Ocon, Verstappen finished in second place behind Hamilton. During an argument with Ocon after the race, Verstappen pushed the Force India driver, for which he was given two days of \"public service\" as a penalty by the FIA. He then finished his season with another podium as he finished third in Abu Dhabi. Verstappen ended the season in fourth place in the championship with 249 points, claiming two wins, eleven podium finishes, and two fastest laps. ==== 2019 season ==== In 2019 Red Bull switched from Renault to Honda power units. After Ricciardo moved to the Renault team for 2019, Verstappen was joined at Red Bull by Pierre Gasly. Verstappen qualified in fourth and finished third in Australia, the first podium finish for a Honda-powered driver since the 2008 British Grand Prix. Verstappen was on course for a second third-place finish in Bahrain before a late safety car prevented him from overtaking Charles Leclerc's ailing Ferrari, keeping him in fourth place. Two more fourth-place finishes followed in China and Azerbaijan, and a podium in Spain in third place. In Monaco, Verstappen qualified in third place. He was released into the path of Valtteri Bottas during the drivers' pit stops, gaining second place but receiving a 5-second penalty as a result. Verstappen crossed the line in second place but was demoted to fourth by the penalty. In Canada, Verstappen's final lap in the second qualifying session was hampered by a red flag brought out by Kevin Magnussen's crash. This caused Verstappen to qualify 11th and start the race in ninth place. He later recovered to finish fifth. In France he started and finished in fourth place. In Austria, Verstappen started third but suffered a poor start, dropping down to eighth. After a charge towards the front, he made his way up to second before controversially passing Leclerc for the lead of the race with three laps to go. This marked the first Honda-powered race victory since the 2006 Hungarian Grand Prix. In Britain, Verstappen, running in third place, was hit from behind during an overtake attempt by Sebastian Vettel and spun into the gravel. Verstappen was able to continue and crossed the line in fifth place. The wet and chaotic German Grand Prix began similarly to the race in Austria for Verstappen, as a poor start caused him to fall behind. However, he would inherit the lead midway through the race after a crash by race leader Hamilton. Verstappen would go on to extend his lead after the track began to dry, claiming his second victory of the season. In Hungary, he claimed the first pole position of his career and led most of the race before being passed in the closing laps by Hamilton, who had made another stop for fresh tyres in a gamble to catch the leader. Verstappen on the podium after winning the 2019 Brazilian Grand Prix Before the Belgian Grand Prix, Verstappen received a new teammate in Alexander Albon after Pierre Gasly was demoted back to Toro Rosso. In the race, Verstappen had a poor start and collided with Kimi Räikkönen at the first corner, resulting in suspension damage and causing Verstappen's first retirement of the season. In Italy, he did not set a time during qualifying after his car lost power in Q1, but he was already required to start from the back of the grid due to an engine component penalty. After damaging his front wing on the first lap, he recovered to finish the race in eighth place. third and fourth-place finishes followed in Singapore and Russia respectively. After suffering damage in a first-lap collision with Charles Leclerc in Japan, Verstappen suffered his second retirement of the season. In Mexico, he qualified in first place after setting the fastest lap-time of the session, before being handed a grid penalty for ignoring yellow flags after a crash by Valtteri Bottas.Verstappen suffered a puncture early in the race after making contact with Bottas, falling to the back of the field before eventually recovering to sixth place. A third-place finish in the United States followed, before Verstappen took the second pole position of his career with a 1:07.508 pole lap time in Brazil. In a chaotic race, he passed Lewis Hamilton for the lead on two occasions before going on to claim his third victory of the season. Verstappen ended the season with a second-place finish in Abu Dhabi. Verstappen finished the 2019 season in third place in the championship with 278 points. He claimed three race victories, nine podium finishes, two pole positions, and three fastest laps. ==== 2020 season: Third in the Championship ==== In 2020, Verstappen signed a contract extension to race for Red Bull until the end of 2023. Verstappen continued to race for Red Bull in 2020, alongside Albon. At the 2020 Austrian Grand Prix, he started second, but retired early in the race after a flywheel- related problem caused an electronic issue within the power unit. Honda introduced countermeasures in response to the retirement. At the 2020 Hungarian Grand Prix, he crashed in wet conditions during the formation lap while he was on his way to the starting grid, but he was able to drive the car back to the grid where his mechanics fixed the suspension of the car in the short time that was left before the start of the race. After the repairs, Verstappen progressed from seventh place on the grid to second place by the end of the race. Verstappen won the 70th Anniversary Grand Prix at Silverstone, having started from fourth. Verstappen clinched second place at the Spanish Grand Prix, after qualifying in third. At the 2020 Belgian Grand Prix, he scored a podium in third place, following his third place on the starting grid. He suffered from two consecutive DNFs at the Italian and Tuscan Grands Prix after which he lost second place in the Championship. At the Russian Grand Prix, Verstappen finished the race in second, his seventh podium finish of 2020. At the Eifel Grand Prix, Verstappen finished in second after qualifying in third. He also managed to get the fastest lap of the race. At the Portuguese Grand Prix, Verstappen qualified third, however a poor first lap meant that he dropped back down the order to fifth place. He recovered to third and took his 40th podium in Formula 1. At the Emilia Romagna Grand Prix, Verstappen looked set to claim second due to Valtteri Bottas' ailing Mercedes slowing down, but a sudden puncture denied him any chance of a podium finish; Verstappen spun, resulting in his fourth retirement of the 2020 season. During Free Practice for the Portuguese Grand Prix, Verstappen was criticised for comments he made on the team radio after a collision with Lance Stroll, where he used the words \"retard\" and \"mongol\" in response to the clash. Verstappen admitted following the session that the word choices he used were \"not correct.\" The Mongolian government and the Mongol identity asked Verstappen to apologise for the comments; the Mongolian government also urged the FIA to take action on the comments he made. Verstappen finished the 2020 season in third place in the championship with 214 points. He claimed two race victories, eleven podium finishes, one pole position, and three fastest laps. ====2021 season: World Champion==== At the Bahrain Grand Prix, Verstappen topped all the practice sessions and subsequently took a career fourth pole position. This was the first time he achieved back-to-back pole positions. He fought Lewis Hamilton for the race victory, and on lap 53 Verstappen overtook Hamilton, but went off track whilst doing so, resulting in him being instructed by race control to let Hamilton back into the lead and ultimately finishing second behind Hamilton.p At the next race, the Emilia Romagna Grand Prix, Verstappen qualified third with teammate Sergio Pérez second, marking the first time he was out-qualified by a teammate since the 2019 Italian Grand Prix. At the race start, Verstappen was able to pass both Pérez and pole- sitter Lewis Hamilton to take the lead. He remained in the lead after the first round of pit stops as well as the restart, following the race being suspended on lap 33. Rival Hamilton finished second, reducing his championship lead over Verstappen to one point. In the following Portuguese Grand Prix, Verstappen finished second after a long battle with Lewis Hamilton. At the Spanish Grand Prix, the battle between Verstappen and Hamilton continued, with Hamilton employing a faster two-stop strategy versus Verstappen's one-stop race. This provided Hamilton the advantage of faster tyres, allowing him to overtake Verstappen with several laps remaining in the race. Hamilton took the victory, with Verstappen taking second and the fastest lap, increasing Hamilton's championship lead to 14 points. At the next race in Monaco, Verstappen qualified second behind Charles Leclerc, but Leclerc suffered a driveshaft failure on the way to the grid and was unable to start the race. Verstappen controlled the race from the front on the way to victory. Hamilton (who qualified seventh) finished seventh, though claiming an extra championship point by setting the fastest race lap. The result enabled Verstappen to take the lead in the Drivers' Championship for the first time in his career, by a margin of four points over Hamilton. At the Azerbaijan Grand Prix, Verstappen qualified third behind Leclerc and Hamilton. Verstappen and Hamilton passed Leclerc in the opening laps before Verstappen took the lead by way of a faster pitstop. Verstappen would comfortably hold the lead until lap 46 when he suffered a tyre failure causing him to crash at high-speed and retire. A mistake by Hamilton on the restart dropped him to last place, meaning Verstappen maintained his championship lead. Verstappen took pole for the French Grand Prix. Verstappen's mistake on the first lap allowed Hamilton to take the lead which Verstappen retook during the pit stop phase. Verstappen pitted for a second time from the lead and set after the Mercedes duo, overtaking Hamilton for the lead on lap 52 of 53. He also took the fastest lap point, extending his championship lead to twelve points. Verstappen clinched pole position again at the Styrian Grand Prix and led the race from start to finish, to give him his fourth win of the season and further extend his lead to 18 points. Verstappen took pole position at the Austrian Grand Prix, led every lap from start to finish, set the fastest lap, and won the race for his first career grand slam, being the youngest to do so. With the win, Verstappen also became the first driver to win three races in three consecutive weekends, starting at the French Grand Prix on 20 June, then the Styrian Grand Prix on 27 June and ending with the Austrian Grand Prix on 4 July. At the next race; the British Grand Prix, Verstappen was involved in a high-speed collision at the Copse corner with Hamilton on the first lap. This resulted in a 51 g impact with the barrier. He was taken to the Silverstone circuit's medical centre after the crash and was then taken to Coventry hospital for precautionary checks and further assessment, before eventually being discharged at 22:00 local time on Sunday night. Hamilton would go on to win the race, reducing Verstappen's lead in the championship to eight points. At the next race, the Hungarian Grand Prix, Verstappen's car suffered damage in a multi-car collision on lap 1, where Mercedes driver Valtteri Bottas was deemed at fault. He ended the race in tenth which was promoted to ninth after Sebastian Vettel was disqualified. The outcome of the race allowed Hamilton to take the lead of the championship. Following the summer break, Verstappen qualified on pole at the Belgian Grand Prix, ahead of Williams driver George Russell in second and Lewis Hamilton in third. The race was run for three laps, all behind the safety car, with the race official race results taken from the running order at the end of the first lap, with Hamilton and Verstappen both retaining their qualifying positions. As less than 75% of the race distance was completed, half points were awarded, resulting in Verstappen closing the gap to Hamilton to three points. At the Dutch Grand Prix Verstappen again qualified on pole, beating Hamilton by 0.038 seconds. During the race Verstappen was able to fend off attacks from both Mercedes drivers to take the win, taking the lead in the Drivers' Championship by three points. For the Italian Grand Prix, Verstappen was required to start at the back of the grid for exceeding his quota of power unit components. He made his way back up the field, and after taking an early pit stop for intermediate tyres late in the race, he finished second. At the Turkish Grand Prix, Verstappen qualified second with Bottas on pole. With the race being run in wet conditions and the drivers on intermediate tyres the whole race, Verstappen finished second behind Bottas, taking the lead in the Drivers' Championship by six points as Hamilton finished fifth. At the United States Grand Prix, Verstappen took pole position in qualifying, edging Hamilton by 0.209 seconds. Verstappen won the race and extended his lead in the Drivers' Championship to twelve points as Hamilton finished second with the fastest lap. At the 2021 Mexico City Grand Prix, Verstappen qualified third with a gap to pole-sitter Bottas of 0.350 seconds. Verstappen's main opponent Hamilton qualified second. At the race start, Verstappen took the lead from Bottas and Hamilton into turn 1 and won the race, and as a result extended his lead in the championship to 19 points. Verstappen and Hamilton were on equal points in the Drivers' Championship going into the final round, the Saudi Arabian Grand Prix, with Verstappen leading on countback. Verstappen overtook Hamilton on the final lap to win the race, and his first Formula One World Drivers' Championship. Verstappen, who had qualified on pole position by nearly four tenths of a second, had a slow start off the line at the start of the race and dropped to second place. Verstappen was trailing Hamilton by over ten seconds until a late safety car was called in due to a crash at turn 14 involving Williams driver Nicholas Latifi. The withdrawal of the safety car and the resumption of the race following the safety car period was met with controversy. Race director Michael Masi allowed only a certain number of lapped cars through, which after the race brought from the Mercedes team a protest and stated intention to appeal against the race result, arguing that all lapped cars should be allowed through, Red Bull counter argued that this was not specified by the wording of the regulations. The protest was rejected, although subsequent investigation by the FIA ruled that Masi had misinterpreted the rule and the wording of the rule was amended for the 2022 season to specify that \"all\" cars will unlap themselves (at the race director's discretion) rather than \"any\". Verstappen passed Hamilton at turn 5 of the final lap of the race to become the 34th Formula One World Drivers' Champion. ==== 2022 and beyond ==== In March 2022 Verstappen signed a five-year contract extension with Red Bull Racing for the 2023 to 2028 seasons. Verstappen suffered two fuel system related retirements in the first three races, finding himself 46 points behind championship leader Charles Leclerc. He responded by winning five of the next seven races, allowing him to take the championship lead and build a gap of 37 points over second place, by then held by his teammate Sergio Pérez. ==Complete Formula One results== (key) (Races in bold indicate pole position; races in italics indicates fastest lap) Year Entrant Chassis Engine 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 Points Scuderia Toro Rosso Toro Rosso STR9 Renault Energy F12014 1.6 V6 t AUS MAL BHR CHN ESP MON CAN AUT GBR GER HUN BEL ITA SIN JPN RUS USA BRA ABU – – Scuderia Toro Rosso Toro Rosso STR10 Renault Energy F12015 1.6 V6 t AUS MAL CHN BHR ESP MON CAN AUT GBR HUN BEL ITA SIN JPN RUS USA MEX BRA ABU 12th 49 Scuderia Toro Rosso Toro Rosso STR11 Ferrari 060 1.6 V6 t AUS BHR CHN RUS 5th 204 Red Bull Racing Red Bull RB12 TAG Heuer 1.6 V6 t ESP MON CAN EUR AUT GBR HUN GER BEL ITA SIN MAL JPN USA MEX BRA ABU 5th 204 Red Bull Racing Red Bull RB13 TAG Heuer 1.6 V6 t AUS CHN BHR RUS ESP MON CAN AZE AUT GBR HUN BEL ITA SIN MAL JPN USA MEX BRA ABU 6th 168 Aston Martin Red Bull Racing Red Bull Racing RB14 TAG Heuer 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN USA MEX BRA ABU 4th 249 Aston Martin Red Bull Racing Red Bull Racing RB15 Honda RA619H 1.6 V6 t AUS BHR CHN AZE ESP MON CAN FRA AUT GBR GER HUN BEL ITA SIN RUS JPN MEX USA BRA ABU 3rd 278 Aston Martin Red Bull Racing Red Bull Racing RB16 Honda RA620H 1.6 V6 t Red Bull Racing Honda Red Bull Racing RB16B Honda RA621H 1.6 V6 t Oracle Red Bull Racing Red Bull RB18 Red Bull RBPTH001 1.6 V6 t CAN 1 GBR 7 AUT 2 2 FRA 1 HUN 1 BEL 1 NED 1 ITA 1 SIN 7 JPA 1 USA 1 MXC 1 SAP 64 ABU 1 1st 454 Oracle Red Bull Racing Red Bull RB19 Honda RBPTH001 1.6 V6 t BHR 1 SAU 2 AUS 1 AZE 23 MIA 1 MON 1 ESP 1 CAN 1 AUT 11 GBR 1 HUN 1 BEL 11 NED 1 ITA 1 SIN 5 JPN 1 QAT 12 USA 11 MXC 1 LVG 1 SAP 11 ABU 1 1st 575 Oracle Red Bull Racing Red Bull RB20 Honda RBPTH002 1.6 V6 t BHR 1 SAU 1 AUS Ret JPN 1 CHN 11 MIA 2 1 JPN 1 MON 6 CAN 1 SPA 1 AUT 51 GBR 2 HUN 5 BEL 4 NED 2 ITA 6 AZE 5 SIN 2 USA 31 MEX 6 SAP 14 LVG 5 QAT 1 ABU 6 1st 437 Oracle Red Bull Racing Red Bull RB21 Honda RBPTH003 1.6 V6 t AUS 2 CHN 43 JPN 1 BHR 6 MIA 2 EMI 1 MON SPA CAN AUT GBR BEL HUN NED ITA AZE SIN SIN USA MEX SAP LVG QAT ABU 3rd* 124* † Did not finish, but was classified as he had completed more than 90% of the race distance. ‡ Half points awarded as less than 75% of race distance was completed. * Season still in progress. ==References== Category:1997 births Category:Living people Category:Dutch Formula One drivers Category:People from Hasselt",
 "title": "Max Verstappen"
}