{
 "id": "838857",
 "text": "The term \"Dances of Manipur\" covers the different aspects of the varying dance forms originated from the kingdom of Manipur. Many times the very term is often misunderstood and confused with the term Manipuri dance. In fact, Manipuri dance is a particular dance form while \"Dances of Manipur\" refer to any dance forms associated with Manipur. Jagoi, originally spelled as Chatkoi, is any traditional form of dancing in Manipuri culture, especially performed by the devotees to please the deities. Here is a list of the \"Chatkoi\"s (\"Jagoi\"s) : ==C== ===Chukpharon Jagoi=== The Chukpharon Jagoi (; ) is a traditional Jagoi (Chatkoi) performed by the Maibis to please the four Maikei Ngaakpa Lais (guardian deities of directions) in the Lai Haraoba festival. ==K== ===Khamba Thoibi Jagoi=== The Khamba Thoibi Jagoi (; ) is one of the most popular folk dance forms of the Indian subcontinent. It is a devotional dance believed to be first performed by Khuman Khamba and Moirang Thoibi in the premise of the historic Ebudhou Thangjing Temple in Ancient Moirang, a province in Ancient Manipur. ==L== ===Laiching Jagoi=== The Laiching Jagoi (; ) is a traditional Jagoi performed by the Maibis to summon the deities by holding a \"Langthrei leaf\" (Blumea balsamifera) in the Lai Haraoba festival. ===Laihou Jagoi=== The Laihou Jagoi (; ) is a traditional opening or inviting Jagoi (dance form) performed by the Maibis, by proceeding towards a pond or a river, in the Lai Haraoba festival. ===Leima Jagoi=== The Leima Jagoi (; ) is a traditional Jagoi, performed by the maidens. It is best known for its graceful gestures and glittering costumes. ===Leisem Jagoi=== The Leisem Jagoi (; ) is a traditional Meitei Jagoi performed by the Maibis in the Lai Haraoba festival. It depicts the creation of the earth in the Meitei mythology and religion. ==M== ===Maibi Jagoi=== The Maibi Jagoi (; ) is one of the most graceful folk dance forms of the Indian subcontinent. It is a dance performed by the Maibis in the Lai Haraoba festival. The dance form varies depending on the themes as well as regional variation. ==P== ===Panthoibi Jagoi=== The Panthoibi Jagoi (; ) is a divine traditional dance form, depicting the romance between Panthoibi and Nongpok Ningthou. ==R== ===Rasa Leela Dance=== The Manipuri Rasa Leela dance () is one of the eight classical dance forms of India and is originated from Manipur. Its theme is based on the devotion and romance between Krishna and Gopis, including Radha.https://www.britannica.com/art/manipurihttp://www.e-pao.net/epSubPageExtractor.asp?src=manipur.Arts_and_Culture.Ras_Lila_Manipuri_Classical_Dance ==T== ===Thougal Jagoi=== The Thougal Jagoi (; ), also known as the Jagoi Ashangbi (; ), is a traditional Meitei Jagoi, performed by both men and women, along with the Maibis to invoke the deities in the Lai Haraoba festival. ==Other website== * http://e-pao.net/epSubPageExtractor.asp?src=manipur.Arts_and_Culture.Article_Dances_Manipur ==References== Category:Meitei culture Category:Jagoi",
 "title": "Dances of Manipur"
}