{
 "id": "838864",
 "text": "B.O.C Road (Bombay Oil Company) is a locality in the Perumbavoor municipality of Ernakulam district of Kerala. == Area description and location == It is located between Harihara Iyer Road, Marikkar Road and Aimury Road. It is a residential area with private residences and business establishments. The neighbourhood has a resident welfare association called B.O.C Road Residents Association registered under the Ernakulam District Residents Associations’ Apex Council (EDRAAC). The Association is registered to the Perumbavoor municipality and assigns registration numbers for buildings in the locality. The official PIN Code is 683542. B.O.C Road is separated into three wards - Taluk Hospital, Asramam and Pooppany. * The Ward Councillor for :- *Taluk Hospital is Ms. Usha Divakaran - Ward Number 8 * Asramam - Mr. Mohan Baby - Ward Number 11 * Pooppany- Ms. Valsala Ravikumar \\- Ward Number 9 == Points of interest within proximity of B.O.C Road == === Hospitals === * Government Taluk Hospital , Perumbavoor === Educational institutions === * Government Boys Higher Secondary School * Asramam Higher Secondary School * Marthoma College for Women === Places of worship === * Sree Dharma Sastha Temple, Perumbavoor * Aalpara Devi Temple * St. Paul's Mar Thoma Church === Government buildings === * Mini Civil Station , Perumbavoor * KSEB Electrical Circle, Perumbavoor === Waterways === * Periyar Valley Canal === Banking === * State Bank of India Branch == Changing demographics == There has been an influx of migrants from other states into the town that has also changed the demographic makeup of the town , also causing migrants who are mostly daily wage labourers to move into B.O.C Road . The mostly homogenous demographic makeup is slowly diversifying , largely owing to Perumbavoor's industrial importance. == Future developmental projects surrounding the area == There are currently plans for a Perumbavoor-Rayamangalam road near KSRTC bus stand and passes by Iringole Kavu to reach Aluva-Munnar Road which later reaches MC Road near the Vallam bridge which would increase connectivity through B.O.C Road . Perumbavoor MLA Eldhose Kunnapilly spoke about the industrial significance of Perumbavoor's plywood and furniture industry and how this would increase connectivity to the eastern part of Ernakulam. == Photographs of B.O.C Road == ==References== Category:Kerala",
 "title": "B.O.C Road"
}