{
 "id": "838946",
 "text": "Baby Blue (; stylized in all caps) is a Filipino girl group and first sub-unit of idol group MNL48. They debuted with the lead single Sweet Talking Sugar in September 2020, which topped in Egg Music charts in Japan. Baby Blue is one of the first Filipino artists to make it to Japanese music charts. == Career == === 2020: formation === On September 1, MNL48 announced the formation of Baby Blue, the group's first-ever sub-unit, in partnership with Tower Records Japan, a major Japanese music retailer. Said sub-unit is formed by MNL48 members Jan Elaurza, Coleen Trinidad and Amy Isidto. Following the announcement, Baby Blue officially released its debut single titled \"Sweet Talking Sugar\", and was made available through EGGS, a Japanese digital music subscription service. The single, according to HHE, is an homage to the famous city pop genre, with a modern take via \"the R&B; and hip-hop genre\". An official music video, produced by Carlo Manatad of Plan C, was released on GYAO!, Yahoo Japan's free online streaming site on September 16 and on MNL48's official YouTube channel on the next day. === 2021–2022: \"Stuck On You\" === Baby Blue released teasers such as pre-saved posters and audio snippets for their third single in March 29, 2021. In April 21 of the same year Baby Blue released their third digital single \"Stuck On You\". This song is a straight love song with a pop beat and a light sound. The pre-order of the song started on April 7. In May 28, 2021, the group launched their official fans club site where live videos, blogs, and other info can only be seen there. Subsequently, on the same day, they also opened their official YouTube channel and showed content that can only be seen there, such as cover videos, songs and dance covers of Japanese songs. In December 15, 2021, the group released their first major single, \"Head Up\". The track release marks the fourth single released by the group and their first ballad. It is also the group's major debut in Japan. \"HEAD UP\" was released in advance on December 15 and will be re-released on February 19, 2022. On June 30, 2022, after her 4 years in the group, Baby Blue's leader Jan Elaurza announced her graduation from MNL48, she also announced departure from the unit. On the same day, it was announced on the official website of Baby Blue that Frances Pinlac of MNL48 Team L will be replacing Jan. ==Influences== Baby Blue was influenced by Japanese popular music genres, such as City pop and J-pop. They are also inspired by AKB48. ==Other ventures== On December 20, 2020, the group performed on ABS-CBN's \"Ikaw ang Liwanag at Ligaya: The ABS-CBN Christmas Special\" pre-show entitled \"KTnX ang Babait Ninyo: ABS-CBN Christmas Special Fundraising Show\" for the segment \"P-pop RISE\" with MNL48, BGYO, PHP and Bini, a benefit show for the survivors and evacuees in areas hit by typhoons such as Rolly and Ulysses. ==Members== Current members *Coleen Trinidad (MNL48 Team NIV) 2020–present *Amy Isidto (MNL48 Team L) 2020–present *Frances Pinlac (MNL48 Team L) 2022–present Past members *Jan Elaurza (Former MNL48 Team MII) 2020–2022 == Discography == === Singles === Title Details Sweet Talking Sugar *Released: September 1, 2020 *Format: Digital download, streaming *Label: Tower Records Japan Negastar *Released: November 25, 2020 *Format: Digital download, streaming *Label: Tower Records Japan Stuck on You *Released: April 21, 2021 *Format: Digital download, streaming *Label: Tower Records Japan Head Up *Released: December 15, 2021 *Format: Digital download, streaming *Label: Tower Records Japan === Peak Charts === Title Details Year Peak chart positions Philippines MYX Hit ChartPeak chart positions in the Philippines: * For \"Sweet Talking Sugar\": * For \"Negastar\": * For \"Head Up\": Pinoy MYX CountdownPeak chart positions in the Philippines: * For \"Sweet Talking Sugar\": * For \"Negastar\": * For \"Head Up\": MYX Daily Top 10Peak chart positions in the Philippines: * For \"Sweet Talking Sugar\": * For \"Negastar\": * For \"Head Up\": MYX Most Viewed iTunesPH Top 100 Albums Peak chart positions in the Philippines: * For \"Stuck on You\": \"Sweet Talking Sugar\" * Released: September 1, 2020 * Format: Digital download, streaming * Label: Tower Records Japan 2020 2 1 2 — — \"Negastar\" * Released: November 25, 2020 * Format: Digital download, streaming * Label: Tower Records Japan 7 4 7 — 23 \"Stuck on You\" * Released: April 21, 2021 * Format: Digital download, streaming * Label: Tower Records Japan 2021 — — — — 4 \"Head Up\" *Released: December 15, 2021 * Format: Digital download, streaming * Label: Tower Records Japan 2 2 1 — — ==Filmography== *iWant ASAP (2020) ==Concert== *KTnX ANG BABAIT NINYO: THE KTX FUNDRAISING CHRISTMAS SPECIAL — P-Pop Rise ==Related pages== *MNL48 *AKB48 ==References== ==Other websites== * * Category:2020 establishments in the Philippines Category:Filipino girl groups Category:Musical groups established in 2020 Category:Musical quartets Category:Musical trios Category:P-pop",
 "title": "Baby Blue (group)"
}