{
 "id": "838971",
 "text": "Nathaniel Walter Barnardiston (November 29, 1858 - August 18, 1919) was a British major general during World War I and commanded the South Wales Borderers, along with the 2nd Battalion and the 36th Sikhs during the Siege of Tsingtao in 1914. == Biography == Barnardiston (1858-1919) was born at The Ryes in Little Henny, Essex in 1858. He was the son of Colonel Nathaniel Barnardiston, veteran of the Crimean War, and his wife Lady Florence Barnardiston (née Legge). He had three brothers and five sisters. After a private education and attendance at Merton College, Oxford, he joined the 77th (East Middlesex) Regiment of Foot (The Duke of Cambridge’s Own) in 1878, serving as adjutant of the 2nd Battalion between 1882 and 1886. He was made captain in 1885 and three years later graduated from the Staff College. Barnardiston served as aide de camp to the governor of Bermuda between 1889 and 1892 and, on returning home, married Sarah Hall. Their daughter Joan was born five years later. Promoted to major, he then served as Deputy Assistant Adjutant General of the Eastern District (1894-97) before joining the Intelligence Division at the War Office (1898-1901); here he wrote guidebooks on both the Belgian and French armies. This posting was interrupted by active service with 2nd Battalion The Duke of Cambridge’s Own (Middlesex Regiment) during the Second Boer War (1899-1902). He then served as military attache to Brussels, The Hague and the Scandinavian Courts (1902-06), being promoted to lieutenant-colonel in 1904. Barnardiston was Assistant Commandant at the Royal Military College, Sandhurst from 1906 until 1910. Promoted to colonel, he then became assistant director of Military Training. He was made a major-general in 1914. Following his exploits in China, Barnardiston later commanded the 39th Division during 1915-16, before being made Chief of the British Military Mission to Portugal (1916-19). Major-General Barnardiston died on August 18, 1919 at Felixstowe Cottage Hospital. He was buried at St Mary’s church in Great Henny, Essex. == Awards == * Order of the Rising Sun 2nd Class * Order of Osmanieh * Order of the Dannebrog * Order of the Sword * Order of Leopold * Order of St. Olav Category:1858 births Category:1919 deaths Category:British military personnel of World War I",
 "title": "Nathaniel Walter Barnardiston"
}