{
 "id": "839032",
 "text": "The Eurovision Asia Song Contest is an upcoming singing contest. It is to be like the Eurovision Song Contest but it would be held in the Asia-Pacific part of the world. The idea was dropped for the Asian counter part of Eurovision, but recently things have been changed rapidly to bring back Eurovision to Asia again. The inaugural contest would be intended to be developed by the Australian broadcaster SBS and production partner Blink TV, in co-operation with the EBU. In the first contest would have had 10 countries (Australia, China, Japan, Kazakhstan, Maldives, New Zealand, Papua New Guinea, Solomon Islands, South Korea and Vanuatu). An announcement was published by Eurovision in 2017, regarding the contest on their official websites. Various speculations of a Eurovision Asia were in talks from 2014 and the official announcement was published in 2016 with an article in 2017. A promotional video featuring artwork was published. The official website was launched in 2017 and showcased the planned launch of the Asian spin on the Eurovision song contest. The website would continue to receive updates until 2019 when the website was frozen and no changes were made until 2023. On June 14th 2023 Blink TV revealed the revamp of the website and the text stating “more information coming soon.” The on October of the same year the website would be put into maintenance with the previous branding used again. No changes have been made ever since. by around 2021 the competition is cancelled. SBS decided to cancel this event. ==Related pages== *Eurovision Song Contest (2018/2019) *Junior Eurovision Song Contest *American Song Contest (American version of Eurovision) *AfriMusic Song Contest (African contest based in Eurovision) *Turkvision Song Contest (Turkish contest organised by TMB TV and created by TÜRKSOY for the Turkic countries and Turkic people) == References == ==Other websites== * Official website * Production website * Official Channel on YouTube * Promotional video of the contest Category:Music competitions",
 "title": "Eurovision Asia Song Contest"
}