{
 "id": "839022",
 "text": "Timothy Quill (9 May 1901 – 10 June 1960) was an Irish Labour Party politician, farmer and a figure in the history of the cooperative movement in Ireland. He was a founder of the City of Cork Co-operative Society (also serving as the society's secretary), and was the editor of The Cork Co-Operator publication. He was also manager and secretary of the Cork Co-operative Bakery Society. He was an organiser for the Labour Party in Cork, a regional trade union secretary and one of a number of early Labour Dáil members to promote Christian socialism. Quill also served as a local councillor initially with Cork County Council from 1925 but served on both the County Council and Cork Corporation during the 1930s and 1940s. He also held positions on the executives of large agricultural organisations in later years. == Biography == Timothy Quill was born to Daniel and Mary Quill in Clondrohid, Macroom, County Cork, on 9 May 1901. He had five brothers. Initially living in Macroom, he moved to Cork City with his wife and young family, and in 1936 was living near Victoria Cross. Before his time in the co-operative movement, he was involved in the insurance business. Quill was a regional trade union secretary for North-West Cork. Quill, along with TJ Murphy and Paddy Crowley MCC, have been credited with establishing \"labourers' clubs\" in County Cork during the 1920s and 1930s. The clubs would meet after Mass and some were supported by parish priests. The clubs began to go into decline in the 1940s as farm machinery became more commonplace. Quill was elected a councillor on Cork County Council in 1925. It has been said that he was recruited into the party by Labour politician and fellow Clondrohid native T. J. Murphy. Quill was 26 years old at the time of the general election on 9 June 1927 and was one of 44 Labour candidates. While campaigning, Quill described himself as a \"temperate man\". At a meeting in North Cork, Quill outlined what he believed the Labour Party stood for. Referring to the level of unemployment, he spoke about the \"right to work\" and the government's perceived failing of \"humbler people\" over the \"well-to-do class\". Quill was elected as a Labour Party TD for the Cork North constituency receiving 18% of first preference votes. Slogans, such as 'Be Labour This Time' and 'Away With Slums & Mud Cabins' were featured on his election posters. He was the youngest member of the 5th Dail. He spoke against the Public Safety Bill 1927 in August 1927. During a finance committee debate on old age pensions in July 1927, he decried what he described as the \"strict and harsh manner\" of some pensions officers. Quill lost his seat at the September 1927 general election, serving only three months as a TD. He received 4,123 first preference votes. T. D. Keating of the ITGWU said that it was regrettable that Quill was not re-elected. The number of Labour candidates almost halved (from 44 to 28). Speaking on the heavy defeat for Labour in the September 1927 election, T. J. Murphy regretted that the party had lost candidates, like Quill, who he described as \"young men of the ability and honesty of Mr. Quill, who had been defeated in North Cork by a mere handful of votes, after making a marvellous fight against a combination of influences\". Quill did not contest the 1932 general election, declining to stand at a convention in Millstreet, Cork. According to The Southern Star, it was thought Quill would be the chosen candidate, but, according to the newspaper's columnist, had \"to a certain extent, lost touch with the electors of this division and he declined to accept the honour\". According to the Cork Examiner Quill declined the nomination and asked \"that some other candidate […] be proposed\". In a letter published in The Southern Star in June 1933, Quill labelled criticisms levelled against him and the Labour movement as 'ignorant'. As of 1936, he was Chairman of the Cork County Executive of the Labour Party. Quill contested the 1937 general election as a sitting city councillor on the Cork Corporation, as one of 23 Labour candidates, receiving 14.9% of first preference votes, but was not elected. He ran again in the 1938 general election, this time as one of 30 Labour candidates, receiving 4,950 first preference votes (12.6%), but was once again not elected. This was to be his last general election campaign, however he would remain as an elected city councillor on Cork Corporation. According to A Biographical Dictionary of Cork, by Tim Cadogan and Jeremiah Falvey, Quill served as a councillor on Cork County Council for two periods. As a Transport member, he was nominated and won a seat in 1925, retaining his seat in 1928 and lost the seat in 1934, before winning a seat again in 1942 and serving until 1945. He was elected to both the Cork County Council and the Cork Corporation that year. Quill was at one time Chair of the South Cork Board of Public Assistance. Quill also served as a city councillor with Cork Corporation. The City Councillor's 1920–1945 roll book seems to record that T Quill was elected in 1936. In 1939, he is listed as a member of the Labour Party's Cork Centre Branch. There was a local election in the city almost every year from 1929 to 1936 to elect portions of the city council and others in 1942 and 1945. Quill was a member of the South Cork Board of Public Health. He is still listed as a councillor in this book in 1944–1945. Quill served as Deputy Lord Mayor of Cork and on the Committee of Management of the South Infirmary. In 1936, Quill said that “the Irish Labour Movement has its own road to travel and had no place for the cries of Fascism or Communism that plagued the world today.” During the 1940s, Quill became chair of the Liam Mellows Branch of the Labour Party. In this capacity he proved to be an enemy of Michael O'Riordan. The branch had been established by former members of the Curragh Camp's Communist Group. O'Riordan had retrospectively asserted that Quill was imposed as chair to ensure that Labour in Cork City could control the new branch. O'Riordan also stated that Quill had made an attack on what Quill \"called 'the Jew boys' of Cork\". It was during this time that the ITGWU had disaffiliated from the Labour Party and the National Labour Party was established on the basis that communists were infiltrating the party. A report in the Irish Press suggests that the Administrative Council \"had become aware that certain persons in Cork were engaging in activities which appear to be inconsistent with their membership of the Labour Party and accordingly they appointed a subcommittee to investigate the membership and administration of the Liam Mellows Branch\". O'Riordan's son, Manus, would later refer to Quill as an \"anti-Semitic red-baiting villain\" who was responsible for O'Riordan's expulsion. During the 1920s, Quill established the City of Cork Co-operative Society with Con Desmond. This included social enterprises such as Cooperative Tea, Cooperative Cream and Cooperative Bread. He was also a member of the Cork Co-operators' Guild. He was also the editor of The Cork Co-Operator, a monthly publication of the co-operative movement in Cork. In a letter to the editor, published on the cover of the June 1939 issue, Steve Denny (director of the London Co-operative Society) described The Cork Co-Operator as a \"bright little paper\". Quill frequently attended the Co-operative Congress in the UK throughout the 1930s and 1940s. Inspired by Robert Owen, he built cottages for the workers on his land. Quill regarded himself as a Christian Socialist. He resigned his position in the co-operative movement in 1954. These societies were defunct by the time of his death in 1960. In 2021, an article in The Southern Star described Quill as \"an icon in the Irish co-operative movement\". He married Mary McCarthy on 7 January 1930. In the 1940s, Quill lived at Ferney House in Blackrock, Cork, where he grew vegetables and kept livestock. His first trial of Holstein Friesian cattle took place here, and he owned what The Southern Star described as \"one of the largest and most successful herds in the country\". He was used as an example in an 1950s advertisement titled \"Friesian T.T Herd Makes History\", and served as the honorary secretary of the Irish Friesian Society. He served on the General Committee of the Munster Agricultural Society, wrote a farming column for The Cork Examiner and contributed to the The Evening Echo under the pen name Carrigeen.By the 1950s he had settled at a property near Blarney, left politics and was Chair of the Blarney National Farmer's Association. According to the Irish Independent, Quill was the Chair of the Federation of Cow Testing Associations. He was also on the Committee of the Irish Landrace Pig Society. He died on 10 June 1960, aged 59 and was buried in St. Finbarr's Cemetery. In an obituary published on 11 June 1960, the Evening Echo described him as an \"authorative writer on agricultural matters\". The Timothy Quill Perpetual Challenge Cup for the MAS (Munster Agricultural Society) Holstein Friesian Senior Cow Class at Cork Summer Show is named after him. == Sources == # \"Forthcoming Elections\". archive.irishnewsarchive.com. Cork Examiner. 11 May 1933. Retrieved 14 April 2020. # \"Death Of Well Known Livestock Breeder\". archive.irishnewsarchive.com. Evening Echo. 11 June 1960. Retrieved 29 April 2020. # \"Accident on Hill, Co. Cork Court Evidence\". archive.irishnewsarchive.com. Evening Echo. 21 June 1960. Retrieved 14 April 2020. Mr. T. Quill, Secretary of the Co-operative Society, gave evidence regarding the number of times the van had been in garage for attention # \"Why we need to revive the co-operative movement\". West Cork People. 20 January 2020. Retrieved 22 January 2020. # Cadogan, Tim; Falvey, Jeremiah (15 December 2006). A Biographical Dictionary of Cork. Four Courts Press. # \"Cork Circuit Court\". archive.irishnewsarchive.com. Cork Examiner. 7 February 1950. Retrieved 14 April 2020. Timothy Quill manager of defendant company described that in the manufacture of doughnuts the doughnuts were first cut in half singly and the cream and jam were inserted # \"National Archives: Census of Ireland 1911\". census.nationalarchives.ie. Retrieved 29 April 2019. # \"ANNUAL REPORT (ITUC) 1924\" (PDF). # \"ANNUAL REPORT Irish Labour Party and Trade Union Congress (1925)\" (PDF). # \"Views And Interviews\". The Cork Examiner. 15 November 1955. # \"The Nominations\". archive.irishnewsarchive.com. Evening Echo. 7 June 1938. Retrieved 14 April 2020. # \"Situations Vacant\". archive.irishnewsarchive.com. Cork Examiner. 28 August 1931. Retrieved 14 April 2020. # \"Recalling the many Working Men's Clubs of West Cork\". The Southern Star. Retrieved 14 March 2021. # Gallagher, Michael (1985). Political Parties in the Republic of Ireland. Manchester University Press. p. 77. ISBN 978-0-7190-1797-1. T.J Murphy Irish labour. # \"For Ladies Hosiery Try JAMES O'BRIEN 4 Bridge St., SKIBBEREEN\". archive.irishnewsarchive.com. Retrieved 13 April 2020. # \"NORTH CORK. MEETING IN MACRO.OM\". archive.irishnewsarchive.com. Retrieved 14 April 2020. # \"Timothy Quill\". Oireachtas Members Database. Retrieved 11 November 2008. # Gallagher, Michael (4 June 2019). Irish Elections 1948–77: Results and Analysis: Sources for the Study of Irish Politics 2. Routledge. ISBN 978-1-135-99772-4. # \"Names of the New Deputies\". archive.irishnewsarchive.com. Irish Independent. 15 June 1927. Retrieved 14 April 2020. # Labour Party (1927). Away with slums and mud cabins. Vote Labour, number one for Quill. The Kerryman. # Labour Party (1927). Be Labour this time : vote one for Quill. The Kerryman. # \"The Defeated Labour Candidate\". Evening Echo. 29 September 1927. # \"Macroom - The Youngest Deputy\". archive.irishnewsarchive.com. Southern Star. 2 July 1927. Retrieved 14 April 2020. # \"ORDUITHE AN LAE—ORDERS OF THE DAY. – PUBLIC SAFETY BILL, 1927—THIRD STAGE (RESUMED). – Dáil Éireann (5th Dáil) – Wednesday, 3 Aug 1927 – Houses of the Oireachtas\". Houses of the Oireachtas. 3 August 1927. Retrieved 2 June 2019. # \"IN COMMITTEE ON FINANCE. – VOTE 7—OLD AGE PENSIONS. – Dáil Éireann (5th Dáil)\". Houses of the Oireachtas. 5 July 1927. Retrieved 3 June 2019. # \"Mr. T. J Murphy T.D., in Bandon\". Evening Echo. 6 October 1927. # \"District Doings - Macroom\". archive.irishnewsarchive.com. Southern Star. 9 January 1932. Retrieved 13 April 2020. # \"Labour Convention at Mill Street\". archive.irishnewsarchive.com. Cork Examiner. 4 January 1932. Retrieved 13 April 2020. # \"PIN PRICKS FROM PIGMY POLITICIANS MACROOM LABOUR CONVENTION CONTROVERSY\". archive.irishnewsarchive.com. Retrieved 14 April 2020. # \"MEETING IN CORK\". archive.irishnewsarchive.com. Retrieved 14 April 2020. # \"Munster Candidates\". archive.irishnewsarchive.com. Cork Examiner. 15 June 1937. Retrieved 14 April 2020. # \"Timothy Quill\". ElectionsIreland.org. Retrieved 11 November 2008. # \"Labour To Fight Thirty Seats ? First List Of Candidates\". archive.irishnewsarchive.com. Retrieved 14 April 2020. # O'Day, Alan; Fleming, Neil (11 June 2014). Longman Handbook of Modern Irish History Since 1800. Routledge. ISBN 978-1-317-89711-8. # Report. Labour Party. 1940. # The Municipal Year Book and Public Services Directory. Municipal Publications Limited. 1945. # \"Councillors' Roll Book\". Cork Corporation Roll Book – via Cork City Archives. # (Ireland), Labour Party (1939). Report. # Labour Party (1942). Cork Corporation elections 1942 : Labour Party candidates /. Eagle Printing Works. # Labour Party (1942). Cork Corporation election, 1942 : Wednesday, 19th August, 9 a.m. to 9 p.m. /. Guy & Co. # \"««I TINORI I «CURES CORNS WITHOUT PAIN * fi SOLD EVERYWHERE £\". archive.irishnewsarchive.com. Retrieved 19 March 2021. # \"Page 31 – complete1930directory\". corkpastandpresent.ie. Retrieved 13 June 2019. # Quinlivan, Aodh (2006). Philip Monahan: A Man Apart : the Life and Times of Ireland's First Local Authority Manager. Institute of Public Administration. ISBN 978-1-904541-35-6. # \"Shared Article\". archive.irishnewsarchive.com. Retrieved 19 March 2021. # \"SOUTH INFIRMARY\". archive.irishnewsarchive.com. Retrieved 19 March 2021. # \"LABOUR FUNCTION\". archive.irishnewsarchive.com. Retrieved 19 March 2021. # \"Micheal O Riordain\". www.rjtechne.org. Retrieved 30 January 2021. # \"Gerard Murphy's The Year of Disappearances | The Irish War\". theirishwar.com. 25 March 2011. Retrieved 30 January 2021. # \"O'Riordan, Michael (Micheál; Mick) | Dictionary of Irish Biography\". www.dib.ie. Retrieved 19 March 2021. # \"The Irish Press\". 20 April 1944. # \"Cork Bread Prices\". archive.irishnewsarchive.com. Irish Press. 24 July 1935. Retrieved 14 April 2020. # \"Finding on Prices Commission\". archive.irishnewsarchive.com. Irish Independent. 24 July 1935. Retrieved 14 April 2020. Mr T Quill said his firm charged 10d for the 4lb loaf # \"Advertisements\". The Cork Co-Operator. June 1939. # \"Letters to the Editor\". The Cork Co-Operator. January 1940. # Cork Co-Operator, June 1939, Page 1, Letter from Director of England's biggest Co-operative Society # The Co-Operative Congress 1939 Edition. UK. 1939. pp. Delegates To Congress. # The Co-Operative Congress 1942 Edition. UK. 1942. pp. Delegates To Congress. # \"A Day with 'The Cork Co-Operator' Timothy Quill\". The Evening Echo. 1951. # \"Marriage - Quill-McCarthy\". archive.irishnewsarchive.com. Cork Examiner. 18 January 1930. Retrieved 29 April 2020. # \"Page 38-39 – Guys Cork Almanac 1945_OCR\". corkpastandpresent.ie. Retrieved 31 October 2019. # \"Blarney Field Day\". archive.irishnewsarchive.com. Southern Star. 22 October 1955. Retrieved 29 April 2020. # \"FRIESIAN T.T. HERD MAKES HISTORY\". archive.irishnewsarchive.com. Retrieved 29 April 2020. # \"Shared Article\". archive.irishnewsarchive.com. Retrieved 19 March 2021. # \"Obituary Timothy Quill\". Irish Farmers Journal. 18 June 1960 – via archive.irishnewsarchive.com. # Agriculture, Ireland Dept of (1959). Annual Report. # \"Cow Testing Group's Deputation\". archive.irishnewsarchive.com. Retrieved 18 March 2021. # Donnelly, Seán (2012). Elections 2011. Lulu.com. ISBN 978-0-9520197-8-7. # \"Cork Summer Show Schedule of Classes\" (PDF). Cork Summer Show. # \"Cork Show Schedule 2019\" (PDF). # \"Schedule of Classes 2019 (Cork Summer Show)\" (PDF). #”Irish Landrace Pig Society’s Officers”. Irish Examiner 5 February 1959. Category:1901 births Category:1960 deaths Category:Members of Dáil Éireann Category:Politicians from Cork (city) Category:Co-operative movement",
 "title": "Timothy Quill"
}