{
 "id": "839196",
 "text": "Fortune Street (known as Boom Street in Europe and Oceania) is an Nintendo Wii video game developed by Square Enix. It is a follow-up to the 2007 Nintendo DS game Itadaki Street DS and is the first Itadaki Street title that was released outside of Japan. This game was able to be played over Nintendo Wi-Fi Connection; however, the service was terminated on May 20, 2014, making this game no longer playable online. Also, mainly due to this game's Wi-Fi compatibilities, it is impossible to transfer the save data to an SD Card. == Gameplay == This game functions like a Monopoly style board game. It can be played with up to four players. If game data can't be saved or won't be saved, only offline multiplayer is available (though Out to Lunch can be used to mimic a single player game. Every player can be CPU players by doing this). When playing multiplayer offline, records aren't saved. Also, when playing multiplayer offline, players can decide if each player should have their own Wii Remote, or that players share one Wii Remote. When using the latter option, players will press one of the three buttons: , and during an Auction to make a bid, and are ordered based on where characters appear in the Auction window. At the start of a game, all players use number machines to determine the turn order, with the highest number going first (note that it is possible for two numbers on the number machines to be the same, if so then the tying players use the number machines again). The only exceptions are the tutorial, where the human player always goes first; and in Custom Rules, should the Order of play be set to As picked, where it makes P1 goes first, then P2, then P3, then P4. Four players (excluding the play system in Tutorial mode, where only three characters play) take turns by rolling dice to go around the board and buy shops. Some squares involve special attributes, such as Take-a-break squares (when a character lands there, all of their shops will close until the player's next turn) and Venture squares (like a Chance space in Monopoly). Players also have the ability to invest money in their own shops when they land on them (a maximum of 999 per turn). Scattered around the board are four suits (Spade, Heart, Diamond, and Club); if the player collects all of them and returns to the Bank (also the starting square) they get a promotion. When a player gets a promotion, they get a fixed amount for their salary, plus a shop bonus which is based off 10% the sum of all the player's shop value, as well as a promotional bonus (extra money given to the player that increases as they level up). The player's level also goes up when they get a promotion. The player wins by increasing their net worth to at least the target amount (usually determined by the game, if on Custom mode though, this can range between 6,000 and 999,000 in increments of 1,000) and returning to the bank first (in the Practice Boards, the target net worth for Easy Rules and Standard Rules are 5,000 G and 8,000 G respectively). Net worth is the total combined amount of ready cash and value in stocks and shops and can be increased by having other players land on their shops and buying multiple shops in an area or investing in stocks and owned shops to increase the stock price. If the player runs out of ready cash at any point, they must sell either stocks or a shop to try and get out of debt; any shops sold for cash are auctioned (the winning bid gets paid to the bank). Note that the bank only offers 75% of the shop price to a player if they are in debt. Also, if a player auctions a shop from \"Manage Shops\" or gets Venture Card #74, the highest bid is credited to the original owner. If the player's net worth goes below zero, then they go bankrupt; all their assets are sold off if any remain and they are automatically eliminated from the game. The player with the highest net worth automatically wins if the bankruptcy limit is met (although in a very rare case should two or more players have the same highest net worth, the player that goes later in the turn order wins). In Tour mode, the game ends once one player goes bankrupt, in Custom mode, this can be set to when two players go bankrupt or to have a last-man-standing rule. == Characters == Characters have expansive dialogue and interact with each other All 22 characters from Itadaki Street DS return, with the addition of four new characters for a grand total of 26. Players can also use and customize their Miis in the game. Miis are the only playable characters in single-player and online mode; in multiplayer offline, players can also choose between the Mario and Dragon Quest characters as well. Each computer character is ranked from S, A, B, C, D in terms of difficulty (S being the highest, and D being the lowest) which means each computer character has a predetermined difficulty. If the player beats either all the Easy Tour boards or all the Standard Tour boards, they will have the ability to switch the computers' difficulty from S rank to their normal rank. Other Mii Non-Playable Mario series 8-bit Buzzy Beetle 8-bit Goomba 8-bit Koopa 8-bit Piranha Plant Bob-omb Boo Bullet Bill Chain Chomp Dry Bones Lakitu Luma Noki Pianta Shy Guy Thwomp Toads Yoshis Dragon Quest series Goodybag Healslime Magmalice Malroth Metal slime Mottle slime She-slime Rockbomb == Other == Super Mario Bros.: The World 1-1 stage is based off the same level from this game. Additionally, the music of this board is an arrangement of the overworld theme of this game. Also, upon completing a Mario board, an arrangement of the Castle Clear music plays, followed by an arrangement of the ending theme. Super Mario Bros. 3: During an auction, an arrangement of the Toad's House/P Switch music plays. An arrangement of the Pipe Land map music also plays in the stock menu. Also, an arrangement of the \"3 Matching Cards\" fanfare plays whenever a line is made in Round The Blocks on a Mario board or when the Super Mario Tour is completed in Tour mode, as well as an arrangement of the \"World Clear\" fanfare playing when a line of lucky 7's is made in Round The Blocks on a Mario board. Super Mario World: An arrangement of the final boss theme plays when someone reaches the target amount in a Mario board. An arrangement of the bonus stage music is heard in the minigame Round the Blocks if it is played on a Mario board. Super Mario Kart: An arrangement of Mario Circuit's music is used for the Mario Circuit board. Super Mario Land 2: 6 Golden Coins: One of Wario's quotes on Starship Mario has him stating that the starship would be his if he turned the \"M\" upside down. This alludes to his taking over of Mario's castle in this game, which involved flipping the castle's \"M\" so that it appeared as a \"W\". Super Mario World 2: Yoshi's Island: An arrangement of the title screen music for this game plays as the music for the Yoshi's Island board. Also, an arrangement of the athletic theme is heard in the Venture square or when Dart of Gold is being played. Super Mario RPG: Legend of the Seven Stars: An arrangement of \"Hello, Happy Kingdom\" plays in the board Peach's Castle. Wario Land 3: Wario mentions Rudy when building a tent on the board. Luigi's Mansion: One of Luigi's quotes mentions the Poltergust 3000. Super Mario Sunshine: Delfino Plaza returns as a Mario series board. An arrangement of its original theme is the music of this board. Wario World: Wario mentions the Black Jewel in one of his quotes, who was the main antagonist of that game. Mario Kart: Double Dash!!: Peach's quote in the Mario Circuit map is \"I'm going to double-dash my way to victory! Good luck keeping up with me! Tee hee!\" This references the two driver mechanic featured in said game. Mario Party 6: Yoshi's artwork is heavily based on his artwork from this game, featuring him in an identical pose. Super Mario 64 DS: Bowser's artwork from this game is reused. Dance Dance Revolution: Mario Mix: Luigi's artwork from this game is reused. Mario Superstar Baseball: The Mario Stadium returns as one of the Mario series boards. New Super Mario Bros.: An arrangement of the Bowser's Castle theme can be heard at certain boards. Gaining a level with a Mario series character plays an arrangement of the \"Course Clear\" music. Also, Bowser Jr.'s artwork from this game is reused. Mario Party 8: Wario, Daisy, Toad, Waluigi, and Birdo's artwork from this game is reused. DK: Jungle Climber: Diddy Kong's artwork from this game is reused. Super Mario Galaxy: The Good Egg Galaxy returns as a Mario series board. Mario Party DS: If a player draws venture card #88, all other players swap positions. This is a reference to the Happening Space in Kamek's Library that will occasionally cause Kamek to cast \"Kamek Spell No. 88\", which has the same effect. Mario Kart Wii: The Mario Circuit board resembles the Mario Circuit from this game. New Super Mario Bros. Wii: Memory Block takes place in a Toad House from this game and features an arrangement of the Toad House music from this game. Super Mario Galaxy 2: Starship Mario returns as a Mario series board. An arrangement of \"Starship Mario, Launch!\" also plays on this board. Mario Sports Mix: The victory animations for some of the Mario series characters resemble the animations from this game, however their animations are slightly different and are not continuous; they revert to their standing animation when they finish their victory animation. == References == * http://www.vooks.net/story-20611-Boom-Street-explodes-in-Australian-on- January-5th.html == Other websites == * http://www.square-enix.co.jp/itastwii/ * https://www.nintendo.co.jp/wii/software/st7j/index.html * https://www.nintendo.com/games/detail/FyieiQulhl3W4HJwao5OoCyg-3SAOlD8 * https://www.nintendo.co.uk/Games/Wii/Boom-Street-280693.html * http://microsite.nintendo-europe.com/boomstreet/en_GB/ * http://gamesites.nintendo.com.au/boom-street/ Category:2011 video games Category:Nintendo video games Category:Party video games Category:Square Enix games Category:Video games developed in Japan Category:Wii games Category:Wii- only games",
 "title": "Fortune Street (video game)"
}