{
 "id": "839169",
 "text": "Diet in diabetes refers to eating patterns by those with diabetes mellitus. This helps by keeping healthy, which improves quality of life. People with all sorts of body types can get diabetes and having a diet specific to the diabetic person when it is needed can benefit them. For overweight or obese people who have diabetes or prediabetes, the most important aspect of a diet is the loss of the diabetic's body fat and controlling blood sugar levels. Losing weight will make it easier for the body to lower its blood sugar level, and can improve blood pressure and cholesterol, reducing the risk of further health problems. This can reverse prediabetes in some cases or let it not progress to diabetes. ==Lifestyle changes == Making lasting lifestyle changes has been shown to help prevent type 2 diabetes. This includes exercise and being less inactive. Improving blood sugar control and lowering insulin levels can help prevent diabetes and improve the quality of life of diabetics. Stopping smoking and drinking less alcohol can help. There is evidence that eating a low-calorie diet (800 to 1,200 calories a day) on a short-term basis (around 12 weeks) can lead to impactful weight loss and reduce blood sugar levels in people with type 2 diabetes. And some people have found that their type 2 diabetes can go into remission. A low-calorie diet is not safe and it is also not suitable for everyone with type 2 diabetes. So it is important to get medical advice before going on this type of diet == Diet == People with diabetes can eat almost anything they want in moderation. If you need to change your diet, it might be easier to make small changes every week. A diet with some carbohydrates is best. For people who use insulin (all type 1 and some type 2), eating a right amount of carbohydrate makes managing blood sugar easier. Diabetics should avoid or limit soft drinks and juices with lots of added sugar. People with diabetes should: * eat a wide range of foods – including fruit, vegetables and some starchy foods like pasta, potatoes and rice * keep sugar, fat and salt to a minimum * avoid missing meals if you take medicines that can cause hypoglycaemia/hypos The most recommended diet for diabetics by dietitians is one which is high in fiber, low in sugar, low in saturated fat and has no trans fat. The American Diabetes Association, however, recommends against eating more fiber than needed. That's because this may cause digestive problems, like diarrhea, flatulence and bloating. == Support for people with diabetes == Diabetes.co.uk forums – discussions about living with and managing diabetes == Related pages == * Physical exercise * Glucose and Glucose meter * Insulin * Type 1 diabetes * Type 2 diabetes ==References== Category:Diets Category:Diabetes mellitus",
 "title": "Diet in diabetes"
}