{
 "id": "839140",
 "text": "Totally Spies! Totally Party is a video game based on the French-Canadian- American anime-influenced animated television series Totally Spies!. == Plot == Sam, Alex and Clover decide to room together in their \"dream house.\" Life couldn't get cooler, until they've unwittingly made their home right above an Underground Secret Services Center. To prevent a catastrophic security leak, Jerry, the Center Chief has no choice but to take on them as special agents. == Gameplay == Unlike traditional party video games, the ten stages in this game are boss battle stages, each having a villain (the tenth chapter has 2) the spies previously fought in the series, the objective of which is to deplete that villain's life gauge by winning mini-games and laying traps on mini-game spaces. Each villain has a special skill specific to that stage as explained below. === Chapter 1: Felicity Fences (from \"Planet of the Hunks\") === Special Skill: None. This chapter acts as a tutorial. === Chapter 2: Danny Dave === Special Skill: Danny recovers 1 life point when he passes his starting space. === Chapter 3: Tim Scam (from \"The New Jerry\") === Special Skill: There is a chance that gadgets that are picked up are booby-trapped, causing damage to players. === Chapter 4: Max Exterminus (from \"Creepy Crawly Much\") === Special Skill: Once Max's life gauge is reduced to 1 life point, he can only be defeated by a level 4 spy trap. === Chapter 5: Myrna Beesbottom (from \"Evil Valentine's Much\") === Special Skill: Myrna lays level 2 boss traps. === Chapter 6: Marco Lumiere (from \"A Spy is Born\") === Special Skill: Marco lays invisible traps. === Chapter 7: Mandy Luxe (as she appeared in \"Totally Busted\") === Special Skill: Mandy can avoid spy traps, if she gets an exact roll. This skill can only be deactivated by the Hologram Projecting Mood Ring, but only on spy traps laid up to the point of that gadget's use. === Chapter 8: Terence Lewis (from \"Evil Promotion Much\") === Special Skill: Terence can turn a spy trap (particularly the ones with the highest damage level) into a boss trap when he passes his starting space. === Chapter 9: Pommy Pommovsky === Special Skill: Pommy can lay zone traps on mini-game spaces adjacent to the mini-game space she lands on. === Chapter 10: Shirley and Yin Yang (from \"Power Yoga Much\" and \"Feng Shui Is Like So Passe\") === Special Skill: Shirley takes damage as normal, but once she is defeated and swaps with Yin Yang, damage done to him after that is reduced by 1 (level 2 traps do the damage of level 1 traps, level 3 does level 2, and so on). == References == * http://6games.eu/games/10408-totally-spies-secret-files.html * http://6games.eu/games/totally-spies.html Category:PlayStation 2 games Category:Wii games Category:2007 video games Category:2008 video games",
 "title": "Totally Spies! Totally Party"
}