{
 "id": "839131",
 "text": "Space Debris on PlayStation is a three-dimensional action game released in 2000, in which we play as a pilot of a space fighter and participate in dangerous missions. == Gameplay == This third-person perspective space shooter casts the player as UED pilot James Bryant, the brash young adventurer who is humanity's last hope. Gameplay takes place across 10 levels with 6 different attack ships to pilot. The majority of the levels are linear with a few alternate paths. There are, however, numerous free-roaming levels which give the navigation controls over to the player. Five different power-ups enhance weapon capabilities while medals are awarded based on level performace. Space is no longer the final frontier. Suddenly Earth is only a short space-warp away from the most hostile aliens in the galaxy. The United Earth Defences are overwhelmed, but one pilot, James Bryant, remains trapped behind enemy lines, facing the might of an unknown alien fleet. With ten levels of combat, which develop in both linear and non-linear ways, the way ahead is edgily unpredictable. Motherships come out of nowhere, missiles bounce off their targets, and however much you pitch and roll your craft to escape, the pressure never lets up. The graphics are epic in scale, with planet-based combat sequences and massive enemy ships that threaten to crush your screen. This third-person perspective space shooter casts the player as UED pilot James Bryant, the brash young adventurer who is humanity's last hope. The majority of the levels are linear with a few alternate paths. There are, however, numerous free-roaming levels which give the navigation controls over to the player. Five different power-ups enhance weapon capabilities while medals are awarded based on level performace. Sweep up Space Debris and pop it in your PlayStation - much the best place to keep it. Gives the galaxy that nice tidy look. == Description == Features: Ten levels of intense combat Non- linear level design Incredible graphics and sound Space and planet based action. Manufacturer's description: Space Debris is the Playstation's answer to Nintendo's highly acclaimed and successful space adventure Starfox. Combining some of the most impressive 3-D graphics yet seen on the PlayStation format, experienced developer Rage Software have crafted an impressive, highly addictive and frenetic action shooter. Features: * Third or first person perspective * 3D Graphics * Cartoon Graphics * SCI-FI & Futuristic themes Category:PlayStation games Category:PlayStation-only games Category:2000 video games Category:Action video games",
 "title": "Space Debris (video game)"
}