{
 "id": "839143",
 "text": "Nekketsu Oyako (熱血親子) is a Beat 'em up video game developed and published by TechnoSoft released on December 3, 1994 for the Sony PlayStation. In Sega Saturn version It was developed by TechnoSoft published by Sega released on July 21, 1995 for the Sega Saturn. In PlayStation Network was released on September 27, 2017 with console. == Gameplay == Nekketsu Oyako (roughly translated as Thermal blooded parent and child) is a side scrolling beat 'em up like Final Fight that was one of the original launch titles for the PlayStation in Japan back in December 1994. It was later ported to the Sega Saturn several months later with a few minor changes. The game was basically a technical demo to show how the PlayStation could handle an arcade style 2D game filled with many on-screen sprites and some 3D sprite scaling. It was never released outside of Japan, and is considered to be on the rare side for both consoles, as the game was never reprinted. In the not to distant future, a conglomerate known as the Big Black Corporation is up to no good, and the Hibino family venture on a journey to the Big Black Tower to rescue Rando's wife, who has been kidnappned by Mr. Herograw (the head of the company, and the main villan). DIFFERENCES BETWEEN THE PLAYSTATION & SATURN VERSIONS: \\- The Sega Saturn version does not use translucent textures for see-through effects. Instead, you see a cross hatch pattern effect that looks somewhat grainy, but does the job. \\- In the PlayStation version, it is possible to gain more health than 100%. This appears to have been removed in the Saturn game, altering the difficulty to a degree. \\- The loading times are slightly longer on the Saturn, causing a 'Now Loading' screen between scenery. However, the difference in time is only a few seconds more. \\- The soundtrack on the Sega Saturn version is slightly remixed and sounds like it was remastered on a Midi synthesizer, and it can be played back by putting the disc in an Audio CD player. The original PlayStation version appears to be played through the PlayStation's internal audio mixer, and the music does not restart when the game is paused, as is the case on the Saturn. \\- Rando's burning montage on the Sega Saturn intro shows a different diffusion effect. \\- The 3D Technosoft logo screen appears to move slightly sluggish on the Saturn port. \\- The enemy VanDamme is bald on the Saturn version. \\- In the first act of Stage 2, the Saturn version has an added scrolling layer that obscures part of the playfield view. \\- The World Start screen shows a zoomed in view of the playfield on the Saturn, as opposed to a portrait of the playfield on a coloured chessboard. \\- As expected, The bonus item PlayStation console is replaced by a Sega Saturn in the Saturn port. == Description == Manufacturer's description: To help the mother of kidnapped scientists, and daughter Rio Ran Tong Sun Nonoiti Father belt scrolling fighting action to challenge the evil organization Team Gloucester Harare by three research assistants mother. Attack patterns provide a rich and brilliant and exciting technology dozen characters each. Experience the action and directing the entire screen with flashy graphics and brilliant. Features: * Third person perspective. * 2D graphics * Cartoon graphics * SCI-FI, Futuristic & Fantasy themes. Category:PlayStation games Category:Sega Saturn games Category:Japan-exclusive video games Category:1994 video games Category:1995 video games",
 "title": "Nekketsu Oyako"
}