{
 "id": "839274",
 "text": "Habesha peoples are a community and supra-ethnic identifier among Eritreans, Ethiopians, and their descendants in the diaspora. The term is used in different ways. == Usage == Habesha has historically been used to refer to peoples found in the highlands of Ethiopia and Eritrea between Asmara and Addis Ababa. They are largely Ethiosemitic language-speaking people (e.g. the modern-day Amhara, Tigrayan, Tigrinya peoples, among others). Sometimes Central Cushitic language-speaking peoples (e.g. the modern-day Agaw, Qemant, Bilen, Awi), are included. They have had constant contact with each other and share ethnic homelands within the Ethiopian Highlands and Eritrean Highlands geographic area. Habesha is also used to mean all Ethiopians and Eritreans, and their diaspora populations.Goitom, M. (2012). Becoming habesha: The journey of second-generation ethiopian and eritrean youth in canada (Order No. NR91110). This is largely by diaspora communities as well as among people in urban centers in the highlands of Ethiopia and Eritrea between Asmara and Addis Ababa (especially those with access to social media).Afeworki, and Niat. “Eritrean Nationalism and the Digital Diaspora: Expanding Diasporic Networks via Twitter.” EScholarship, University of California, 1 Feb. 2018 === Terminological History === Historically, the term \"Habesha\" represented the northern Ethiopian Highlands people. They were mostly Orthodox Tewahedo Christians. The Oromo and other ethnic groups, as well as Semitic-speaking Muslims, were considered the periphery. Its often refers to Semitic language- speaking peoples mainly found in the highlands of Ethiopia and Eritrea. The term is sometimes used to only refer to speakers of Tigrinya. Some people use the term to refer to all people of Eritrean or Ethiopian origin. Some Gurage societies, such as Orthodox Christian communities where Soddo is spoken, identify as Habesha and have a strong sense of Ethiopian national identity. They have ancient ties with the northern Habesha. Muslim ethnic groups in the Eritrean Highlands such as the Tigre have historically opposed the name Habesha; Muslim Tigrinya-speakers are usually referred to as Jeberti people. In some records Jebarti is described as a Muslim ethno-religious sub-group or alternative to Habesha. At the turn of the 20th century, elites of the Solomonic dynasty used the conversion of various ethnic groups to Orthodox Tewahedo Christianity and the imposition of the Amharic language to spread a common Habesha national identity. === Etymology === The modern term derives from Semitic languages: , first written in unvowelled script as ; ; .Uhlig, Siegbert, ed. Encyclopaedia Aethiopica: D-Ha. Wiesbaden: Harrassowitz Verlag, 2005. p. 948. The earliest known use of the term dates to the second or third century Sabaean inscription recounting the defeat of the nəgus (\"king\") GDRT of Aksum and ḤBŠT. The early Semitic term appears to refer to a group of peoples, rather than a specific ethnicity. Egyptian inscriptions refer to the people that they traded with in Punt as , \"the bearded ones.\" Francis Breyer believes the Egyptian demonym to be the source of the Semitic term. The first attestation of late Latin Abissensis is from the fifth century CE. Modern Western European languages, including English, appear to borrow this term from the post-classical form Abissini in the mid-sixteenth century. (English Abyssin is used from 1576, and Abissinia and Abyssinia from the 1620s.) ==References== Category:Ethnic groups in Ethiopia",
 "title": "Habesha peoples"
}