{
 "id": "83948",
 "text": "AnnaSophia Robb (born December 8, 1993) is an American actress and model. The films in which she starred include Because of Winn-Dixie (2005), Charlie and the Chocolate Factory (2005), Bridge to Terabithia (2007), Race to Witch Mountain (2009), Soul Surfer (2011), and The Way, Way Back (2013). She also played the lead role of Carrie Bradshaw on The CW's series The Carrie Diaries from 2013 to 2014. ==Early life== Robb was born in Denver, Colorado, the daughter of Janet, an interior designer, and David Robb, an architect. She was named after her maternal great-grandmother, Anna Sophie, and her paternal grandmother, Anna Marie. Robb is of Danish, English, Irish, Scottish, and Swedish descent. She grew up in a Christian home and was home-schooled. She started taking an interest in acting and began by performing in front of 500 individuals on her church stage. She competed in dance and gymnastics for four and a half years, but quit in order to focus on acting. In 2009, the Arapahoe Herald reported that she was attending Arapahoe High School in Centennial, Colorado. She graduated in 2012. ==Career== At age 9, she was scouted by an agent, and she and her mother drove down to Los Angeles. After several auditions, she was given the opportunity to appear in a commercial, advertising Bratz dolls that would be aired nationally. After appearing in a commercial for McDonald's, Robb had a small role in the episode, \"Number One Fan\" of the television series Drake & Josh. Her first major role was the title character in the television special, Samantha: An American Girl Holiday. She wore a long brown wig for the role. Robb's two big-screen appearances in 2005 were both adaptations of popular children's books. She starred as Opal in Because of Winn-Dixie and as the competitive and rude Violet Beauregarde in Tim Burton's remake of Charlie and the Chocolate Factory. The latter was a major box office success worldwide, and helped escalate Robb's popularity among pre-teen audiences. In 2005, Robb was the face of Trad Clothing, helping to design and model a fashion line for girls. In 2006, she had a guest role on the cartoon show, Danny Phantom as the voice of Danielle \"Dani\" Fenton. Robb played Leslie Burke in Bridge to Terabithia with Josh Hutcherson, which opened in U.S. theaters on February 16, 2007. She recorded a song for the soundtrack titled, \"Keep Your Mind Wide Open\", and the accompanying video received rotation on the Disney Channel. The song peaked at No. 90 on the Billboard Hot 100 during the week of March 1, 2007, giving Robb her first charting single. Robb was a fan of the book before being cast in the role, saying that it \"touched me in a way I hadn't been touched by a book before\". Robb went on to appear in The Reaping, Have Dreams, Will Travel, Jumper, and Spy School. Despite negative reviews of the film overall, Robb's performance in Sleepwalking garnered praise. Time film critic Richard Schickel said: \"There is a wonderful range to Robb's work...this is extraordinarily mature acting from someone this young and she wins our sympathy without once begging for it.\" In 2008, she recorded the voice of Mary Magdalene in The Word of Promise: Next Generation – New Testament: Dramatized Audio Bible. She also starred in Race to Witch Mountain (2009).Borys Kit (April 29, 2008). Hollywood Reporter Two 'Witch Mountain' vets return: Actors who played kids in original are back for the remake. Retrieved April 30, 2008. In 2010, she appeared in The Space Between. She then starred in Soul Surfer, playing Bethany Hamilton, who continued to surf after losing her arm in a shark attack. In May 2011, Robb was announced to star as Wendy in a new and dark take on the classic story about Peter Pan, tentatively titled, Pan, but later dropped out of the project.Zakia Udin (May 11, 2011). Aaron Eckhart, Sean Bean in 'Peter Pan' update. It was reported on February 3, 2012, that Robb had landed a role in Life at These Speeds. Later that month, Robb was cast as Carrie Bradshaw in The CW's Sex and the City prequel, The Carrie Diaries, and appeared in the summer comedy, The Way, Way Back. In October 2013, Robb started filming for Jekyll Island, starring alongside Frank Grillo, Ed Westwick, Dianna Agron, John Leguizamo, Minnie Driver, and Maggie Q. The film is directed by Aram Rappaport and produced by Hilary Shor, Atit Shah and Aaron Becker. Jekyll Island is set to release in 2017. Robb played the role of Alice Green in the PBS Civil War historical drama series Mercy Street from 2016 to 2017. ==Personal life== In 2014, Robb was enrolled at New York University. Robb was one of the demonstrators at the 2017 Women's March held on January 21, 2017 in Washington, D.C.. ==Filmography== ===Film=== Year Title Role Notes 2005 Because of Winn-Dixie India \"Opal\" Buloni 2005 Charlie and the Chocolate Factory Violet Beauregarde 2007 Bridge to Terabithia Leslie Burke 2007 Loren McConnell 2007 Have Dreams, Will Travel Cassie \"Cass\" Kennington 2008 Jumper Young Millie Harris 2008 Spy School Jackie Hoffman 2008 Sleepwalking Tara Reedy 2009 Race to Witch Mountain Sara 2010 Samantha \"Sam\" Jean McClain 2011 Soul Surfer Bethany Hamilton 2013 Susanna Thompson 2013 Khumba Tombi Voice 2014 Funny or Die's Little Mermaid Ariel Short film 2016 Jack of the Red Hearts Jacqueline \"Jack\" Ferguson 2017 The Crash Creason Clifton 2017 Freak Show Blah Blah Blah 2017 Down a Dark Hall Katherine \"Kit\" Gordy ===Television=== Year Title Role Notes 2004 Drake & Josh Liza Episode: \"Number One Fan\" 2004 Samantha: An American Girl Holiday Samantha Parkington Television film 2006 Danny Phantom Danielle \"Dani\" Fenton Voice Episode: \"Kindred Sprits\" 2013–2014 Carrie Bradshaw 26 episodes 2014 Robot Chicken Yasmin / Cleo Voice Episode: \"Catdog on a Stick\" 2016–2017 Mercy Street Alice Green 12 episodes ==Soundtrack appearance== Year Single Album Chart position US 2007 \"Keep Your Mind Wide Open\" Music from and Inspired by Bridge to Terabithia 90 ==Awards and nominations== On March 30, 2008, Robb won her first career award when she was named Leading Young Actress at the Young Artist Awards for her role in Bridge To Terabithia. The film itself won a Young Cast award. On April 24, 2009, she received the Horizon Award at the 14th Annual Palm Beach International Film Festival. She was awarded the Rising Star Award at the Denver Film Festival on November 12, 2009. Year Association Category Work Result 2004 Young Artist Awards Best Performance in a TV Movie, Miniseries or Special – Leading Young Actress Samantha: An American Girl Holiday 2006 Young Artist Awards Best Performance in a Feature Film (Comedy or Drama) – Leading Young Actress Because of Winn-Dixie 2007 Young Artist Awards Best Performance in a Feature Film – Leading Young Actress Bridge to Terabithia 2007 Young Artist Awards Best Performance in a Feature Film – Young Ensemble Cast Bridge to Terabithia 2007 Critics' Choice Movie Awards Best Young Actress Bridge to Terabithia 2009 Denver Film Festival Rising Star Award 2013 Teen Choice Awards Breakout Star The Carrie Diaries 2013 Young Hollywood Awards Superstar of Tomorrow ==References== ==Other websites== * * * Category:1993 births Category:American child actors Category:American child singers Category:American movie actors Category:American television actors Category:American voice actors Category:Living people Category:New York University alumni",
 "title": "AnnaSophia Robb"
}