{
 "id": "839559",
 "text": "Hans Horneff ( March 10, 1917 - April 30, 1995) was a German-born American movie actor who appearance in both Japanese and US movies. He spoke fluent German and English. Horneff was also a radio host for the CBS News Radio and voice actor for Hanna-Barbera Productions. == Career == He was born in Munich, Germany to Alfred Horneff (1883-1960), a photographer for the Bayerische Staatszeitung and Lina (1892-1963), an elementary school teacher. He had three siblings, Frank (1915-1988), Gabriele (1922-2001) and Louise (1924-2013). Horneff grew up and was educated in Munich, before they immigrated to New York, after he graduated from college in 1941. Interested in stage play, Horneff got a small part in an independently produced Grade-B Western, but his show business career then crumbled due to lack of budgets. In 1940, he became a stage performer until 1942. In 1944, Horneff moved to Century City, California and became an actor at Metro-Goldwyn-Mayer where he played as a Nazi officer in many World War II movies, US Cavalry trooper, gangster, US Army personnel, news reporter and NATO defense soldier. Thereafter, he became a character actor in both movies and television series throughout the 1950s and 1960s. He also did live commentary as a radio presenter in the CBS News Radio between 1948-1957. In 1958, he married Carla Addison (1923-2006), who was a makeup artist and had two children, Calvin (1960-) & Caroline (1962-). During the early 1960s, the family moved to Tokyo on a vacation when movie producers signed him up as a foreigner character for movie studios like Toho and Toei from 1961 to 1969. After returning to America in 1969, he worked at Hanna Barbera Production as a character voice actor. Horneff retired from acting in 1986. He died in 1995 from liver cancer in New York at the age of 76. == Other websites == * Category:1917 births Category:1995 deaths Category:American movie actors Category:People from Munich",
 "title": "Hans Horneff"
}