{
 "id": "83957",
 "text": "Joseph Conrad (3 December 1857 – 3 August 1924) (real name: Józef Teodor Konrad Korzeniowski) was a Polish writer. Conrad did not learn to speak English well until he was in his twenties and always had a Polish accent. Conrad's prose style is considered as one of the best of all English novelists. He also is seen as important for paving the way to modernist literature. His narrative style and anti-heroic characters have influenced many modern writers and inspired such films as Apocalypse Now (after Conrad's Heart of Darkness). Conrad lived in the time of the British Empire and worked in the Merchant Navy. == Novels and novellas == *1895 - Almayer's Folly *1896 - An Outcast of the Islands *1897 - The Nigger of the 'Narcissus' *1899 - Heart of Darkness *1900 - Lord Jim *1901 - The Inheritors (with Ford Madox Ford) *1902 - Typhoon (begun 1899) *1903 - Romance (with Ford Madox Ford) *1904 - Nostromo *1907 - The Secret Agent *1909 - The Secret Sharer (written December 1909; published in Harper's in 1910 and collected in Twixt Land and Sea 1912) *1911 - Under Western Eyes *1912 - Freya of the Seven Isles *1913 - Chance *1915 - Victory *1917 - The Shadow Line *1919 - The Arrow of Gold *1920 - The Rescue *1923 - The Nature of a Crime (with Ford Madox Ford) *1923 - The Rover *1925 - Suspense: a Napoleonic Novel (unfinished, published posthumously) == Short stories == * \"The Idiots\" (Conrad's first short story; written during his honeymoon, published in Savo 1896 and collected in Tales of Unrest, 1898). * \"The Black Mate\" (written, according to Conrad, in 1886; published 1908; posthumously collected in Tales of Hearsay, 1925). * \"The Lagoon\" (composed 1896; published in Cornhill Magazine 1897; collected in Tales of Unrest, 1898). * \"An Outpost of Progress\" (written 1896 and named in 1906 by Conrad himself, long after the publication of Lord Jim and Heart of Darkness, as his 'best story'; published in Cosmopolis 1897 and collected in Tales of Unrest 1898; often compared to Heart of Darkness, with which it has numerous thematic affinities). * \"The Return\" (written circa early 1897; never published in magazine form; collected in Tales of Unrest, 1898; Conrad, presaging the sentiments of most readers, once remarked, \"I hate it\"). * \"Karain: A Memory\" (written February–April 1897; published Nov. 1897 in Blackwood's and collected in Tales of Unrest, 1898). * \"Youth\" (written in 1898; collected in Youth, a Narrative and Two Other Stories, 1902) * \"Falk\" (novella/story, written in early 1901; collected only in Typhoon and Other Stories, 1903). * \"Amy Foster\" (composed in 1901; published the Illustrated London News, Dec. 1901 and collected in Typhoon and Other Stories, 1903). * \"To-morrow\" (written early 1902; serialized in Pall Mall Magazine, 1902 and collected in Typhoon and Other Stories, 1903). * \"The End of the Tether\" (written in 1902; collected in Youth, a Narrative and Two Other Stories, 1902) * \"Gaspar Ruiz\" (written after \"Nostromo\" in 1904–05; published in Strand Magazine in 1906 and collected in A Set of Six, 1908 UK/1915 US. This story was the only piece of Conrad's fiction ever adapted by the author for cinema, as Gaspar the Strong Man, 1920). * \"An Anarchist\" (written in late 1905; serialized in Harper's in 1906; collected in A Set of Six, 1908 UK/1915 US.) * \"The Informer\" (written before January 1906; published in December 1906 in Harper's and collected in A Set of Six, 1908 UK/1915 US.) * \"The Brute\" (written in early 1906; published in The Daily Chronicle in December 1906; collected in A Set of Six, 1908 UK/1915 US.) * \"The Duel\" (aka \"The Point of Honor\": serialized in the UK in Pall Mall Magazine in early 1908 and in the US periodical Forum later that year; collected in A Set of Six in 1908 and published by Garden City Publishing in 1924. Joseph Fouché makes a cameo appearance) * \"Il Conde\" (i.e., 'Conte' [count]: appeared in Cassell's [UK] 1908 and Hampton's [US] in 1909; collected in A Set of Six, 1908 UK/1915 US.) * \"Prince Roman\" (written 1910, published in 1911 in the Oxford and Cambridge Review; based upon the story of Prince Roman Sanguszko of Poland 1800–1881) * \"A Smile of Fortune\" (a long story, almost a novella, written in mid-1910; published in London Magazine in Feb. 1911; collected in Twixt Land and Sea 1912) * \"Freya of the Seven Isles\" (another near-novella, written late 1910–early 1911; published in Metropolitan Magazine and London Magazine in early 1912 and July 1912, respectively; collected in Twixt Land and Sea 1912) * \"The Partner\" (written in 1911; published in Within the Tides, 1915) * \"The Inn of the Two Witches\" (written in 1913; published in Within the Tides, 1915) * \"Because of the Dollars\" (written in 1914; published in Within the Tides, 1915) * \"The Planter of Malata\" (written in 1914; published in Within the Tides, 1915) * \"The Warrior's Soul\" (written late 1915–early 1916; published in Land and Water, in March 1917; collected in Tales of Hearsay, 1925) * \"The Tale\" (Conrad's only story about World War I; written 1916 and first published 1917 in Strand Magazine) == Memoirs and essays == * The Mirror of the Sea (collection of autobiographical essays first published in various magazines 1904-6 ), 1906 * A Personal Record (also published as Some Reminiscences), 1912 * Notes on Life and Letters, 1921 * Last Essays, 1926 == References == * Jeffrey Meyers, Joseph Conrad: a Biography, New York, Charles Scribner's Sons, 1991. * Zdzisław Najder, Conrad under Familial Eyes, Cambridge University Press, 1984, . * Zdzisław Najder, Joseph Conrad: a Chronicle, new edition, Camden House, 2007. * J.H. Stape, editor, The Cambridge Companion to Joseph Conrad, Cambridge University Press, 2006. * Tim Butcher: Blood River - A Journey To Africa's Broken Heart, 2007. . * T. Scovel, A Time to Speak: a Psycholinguistic Inquiry into the Critical Period for Human Speech, Cambridge, MA, Newbury House, 1988. == Other websites == * The Joseph Conrad Society (U.K) * biography at Joseph Conrad centre of Poland * Conrad First: a digital archive of every newspaper and magazine in which the work of Joseph Conrad appeared between 1896 and 1935 * * The Complete works are available from eBooks@Adelaide *Free audiobook of The Secret Agent from LibriVox *Free audiobook of Heart of Darkness from LibriVox *Free audiobook of Lord Jim from LibriVox * Penn State's Electronic Classics Series has 26 Works of Joseph Conrad available for free Joseph Conrad at Penn State's Electronic Classics * Joseph Conrad at kirjasto.sci.fi * Heart of Darkness text at American Literature *Chinua Achebe: The Lecture Heard Around The World *Collected Letters, vol. 6 (1917-1919) - PDF * Find-A-Grave profile for Joseph Conrad *Conrad's page at Literary Journal.com -a number of research articles on Conrad's work *Conrad's page at The Literary Network *About \"An Outpost of Progress\" Interpretations of and more background information on the short story. *About TS Eliot reading Heart of Darkness (French) *Free to read on a cell phone - Conrad works. *Online text of Heart of Darkness - Conrad's greatest work Category:1857 births Category:1924 deaths Category:Polish writers",
 "title": "Joseph Conrad"
}