{
 "id": "83968",
 "text": "The Booker Prize, known in the past as the Man Booker Prize and the Booker Prize for Fiction, is a literary prize awarded each year for the best original full-length novel, written in the English language, by a citizen of either the Commonwealth of Nations or the Republic of Ireland. To win the Booker Prize generally means to gain international success. ==Booker Prize winners== Year Author Country Title 1969 P. H. Newby UK Something to Answer For 1970 Bernice Rubens UK The Elected Member 1971 V. S. Naipaul Trinidad and Tobago/UK In a Free State 1972 John Berger UK G 1973 James Gordon Farrell UK The Siege of Krishnapur 1974 Nadine Gordimer Stanley Middleton South Africa/UK The Conservationist Holiday 1975 Ruth Prawer Jhabvala UK/Germany Heat and Dust 1976 David Storey UK Saville 1977 Paul Scott UK Staying On 1978 Iris Murdoch Ireland/UK The Sea, the Sea 1979 Penelope Fitzgerald UK Offshore 1980 William Golding UK Rites of Passage 1981 Salman Rushdie UK/India Midnight's Children 1982 Thomas Keneally Australia Schindler's Ark 1983 J M Coetzee South Africa/Australia Life & Times of Michael K 1984 Anita Brookner UK Hotel du Lac 1985 Keri Hulme New Zealand the bone people 1986 Kingsley Amis UK The Old Devils 1987 Penelope Lively UK Moon Tiger 1988 Peter Carey Australia Oscar and Lucinda 1989 Kazuo Ishiguro UK/Japan The Remains of the Day 1990 A S Byatt UK Possession: A Romance 1991 Ben Okri Nigeria The Famished Road 1992 Michael Ondaatje Sri Lanka/Canada The English Patient 1992 Barry Unsworth UK Sacred Hunger 1993 Roddy Doyle Ireland Paddy Clarke Ha Ha Ha 1994 James Kelman UK How Late It Was, How Late 1995 Pat Barker UK The Ghost Road 1996 Graham Swift UK Last Orders 1997 Arundhati Roy India The God of Small Things 1998 Ian McEwan UK Amsterdam 1999 J M Coetzee South Africa/Australia Disgrace 2000 Margaret Atwood Canada The Blind Assassin 2001 Peter Carey Australia True History of the Kelly Gang 2002 Yann Martel Canada Life of Pi 2003 DBC Pierre Australia/Mexico Vernon God Little 2004 Alan Hollinghurst UK The Line of Beauty 2005 John Banville Ireland The Sea 2006 Kiran Desai India The Inheritance of Loss 2007 Anne Enright Ireland The Gathering 2008 Aravind Adiga India The White Tiger 2009 Hilary Mantel UK Wolf Hall 2010 Howard Jacobson UK The Finkler Question 2011 Julian Barnes UK The Sense of an Ending 2012 Hilary Mantel UK Bring Up The Bodies 2013 Eleanor Catton New Zealand The Luminaries 2014 Richard Flanagan Australia The Narrow Road to the Deep North 2015 Marlon James Jamaica A Brief History of Seven Killings 2016 Paul Beatty USA The Sellout 2017 George Saunders USA Lincoln in the Bardo 2018 Anna Burns UK Milkman (novel) 2019 Margaret Atwood Canada The Testaments 2019 Bernardine Evaristo UK Girl, Woman, Other 2020 Douglas Stuart USA/UK Shuggie Bain 2021 Damon Galgut South Africa The Promise 2022 Shehan Karunatilaka Sri Lanka The Seven Moons of Maali Almeida 2023 Paul Lynch Ireland Prophet Song 2024 Samantha Harvey UK Orbital ==Other websites== *The official website of the Man Booker Prize *The most honoured Booker shortlisted books *A primer on the Man Booker Prize and critical review of literature. Category:Literary awards Category:Lists of books",
 "title": "Booker Prize"
}