{
 "id": "83974",
 "text": "The Ministry of the Interior of Germany is a ministry of the federal government. It is based in a brand new building in the Moabit area of Berlin- Mitte. The BMI has a second office in Bonn. It is not the same as the United States Department of the Interior. The ministry handles affairs about security and police, so it is more like the British Home Office. Each state also has a ministry of the interior. ==Responsibility== The Federal Ministry of the Interior is responsible for the security inside Germany, the protection of the constitution, the public service, the organisation of the public administration, the civil defence, information technology and sports. The BMI also buys motor vehicles for the federal government, and has its own motor vehicle registration office. ===Health and Safety Standards === The various State laws about health and safety do not apply to the Federal Government. Instead the BMI is the with health and safe authoirty for all federal bodies. It keeps the federal accident reigster. The European Union sometimes complains that this is wrong. It says that the Federal health and safety authority should be independent. == Agencies under the authority of the BMI == Bundesausgleichsamt (BAA) Federal Equalization of Burdens Office (helping small states which need to spend a lot of money for some jobs) Bundesamt für Migration und Flüchtlinge Federal Office of Migration and Refugees (BAMF) Bundesakademie für öffentliche Verwaltung Federal Academy for Public Administration (BAköV) Beschaffungsamt Procurement (buying)office (BeschA) Bundesbeauftragter für den Datenschutz und die Informationsfreiheit Federal Commissioner for Data Protection and Freedom of Information (BfD) Bundesamt für Verfassungsschutz Federal Office for the Protection of the Constitution (BfV) Bundespolizei Federal Police (BPol) (formerly: Bundesgrenzschutz Federal Border Guard (BGS)) Bundesinstitut für Bevölkerungsforschung Federal Institute for Population Research (BIB) Bundesinstitut für Sportwissenschaft Federal Institute for Sports Science BISp) Bundeskriminalamt Federal Criminal Police Office (BKA) Bundesamt für Kartographie und Geodäsie Federal Office of Cartography and Geodesy (BKG) Bundeszentrale für politische Bildung Federal Office for Civic Education (bpb) Bundesamt für Sicherheit in der Informationstechnik Federal Office of Information Technology Security (BSI) Bundesverwaltungsamt Federal Administration Office (BVA) Bundesamt für Bevölkerungsschutz und Katastrophenhilfe Federal Office of Civil Protection and Disaster Assistance (BBK) Schutzkommission beim Bundesminister des Innern Security Commission of the Federal Minister of the Interior Fachhochschule des Bundes für öffentliche Verwaltung Federal College for Public Administration (FH bund) Koordinierungs- und Beratungsstelle der Bundesregierung für Informationstechnik in der Bundesverwaltung Coordination and Advice Centre for Information Technology in the Federal Government (KBSt) Statistisches Bundesamt Federal Statistical Office (destatis) Technisches Hilfswerk Emergency relief organisation (THW) Unabhängige Kommission zur Überprüfung des Vermögens der Parteien und Massenorganisationen der DDR Independent Commission for Checking the Property of the Parties and Mass Organisations of the DDR (UKPV)| Vertreter des Bundesinteresses beim Bundesverwaltungsgericht Federal Interests Representative at the Federal Administrative Court (VBI) Beauftragter der Bundesregierung für Aussiedlerfragen und nationale Minderheiten Federal Ombudsman for Resettled Persons and National Minorities Bundesanstalt für den Digitalfunk der Behörden und Organisationen mit Sicherheitsaufgaben Federal Agency for Digital Radio of Security Authorities and Organizations(BDBOS.) == Federal Ministers of the Interior == German Home Secretaries German Home Secretaries German Home Secretaries German Home Secretaries German Home Secretaries German Home Secretaries No Name Life data Term start Term end Party 1 Gustav Heinemann 1899-1976 20 September 1949 11 October 1950 CDU 2 Robert Lehr 1883-1956 11 October 1950 20 October 1953 CDU 3 Gerhard Schröder 1910-1989 20 October 1953 13 November 1961 CDU 4 Hermann Höcherl 1912-1989 14 November 1961 25 October 1965 CSU 5 Paul Lücke 1914-1976 26 October 1965 2 April 1968 CDU 6 Ernst Benda 1925-2009 2 April 1968 21 October 1969 CDU 7 Hans-Dietrich Genscher 1927-2016 22 October 1969 16 May 1974 FDP 8 Werner Maihofer 1918-2009 16 May 1974 8 June 1978 FDP 9 Gerhart Baum 1932- 8 June 1978 17 September 1982 FDP 10 Jürgen Schmude 1936- 17 September 1982 1 October 1982 SPD 11 Friedrich Zimmermann 1925-2012 4 October 1982 21 April 1989 CSU 12 Wolfgang Schäuble 1942-2023 21 April 1989 26 November 1991 CDU 13 Rudolf Seiters 1937- 26 November 1991 7 July 1993 CDU 14 Manfred Kanther 1939- 7 July 1993 27 October 1998 CDU 15 Otto Schily 1932- 27 October 1998 22 November 2005 SPD 16 Wolfgang Schäuble 1942-2023 22 November 2005 27 October 2009 CDU 17 Thomas de Maizière 1954- 28 October 2009 3 March 2011 CDU 18 Hans-Peter Friedrich 1957- 3 March 2011 17 December 2013 CSU 19 Thomas de Maizière 1954- 17 December 2013 14 March 2018 CDU 20 Horst Seehofer 1949- 14 March 2018 8 December 2021 CSU 21 Nancy Faeser 1970- 8 December 2021 6 May 2025 SPD 22 Alexander Dobrindt 1970- 6 May 2025 Present CSU == Other websites == *Official web site of the Federal Ministry of the Interior *",
 "title": "Federal Ministry of the Interior (Germany)"
}