{
 "id": "839782",
 "text": "\"McStroke\" is the 8th episode of Family Guys 6th season. It was first broadcast on the Fox network on January 13, 2008. It was written by Wellesley Wild. Brian Iles is the director of the episode. The episode is about Peter Griffin having a stroke after eating too many hamburgers. == Story == Peter wants to get a mustache after reading a magazine about them. He gets one and thinks that he is a better person. He walks by a restaurant and sees it burning. A firefighter sees Peter's mustache and thinks he is also a firefighter. Peter goes in the restaurant and rescues the manager, but his mustache burns off. The manager gives him a big supply of burgers. Peter is sad that his mustache burned off, so he eats many burgers to feel better. He gets a stroke that paralyzes half of his body. He gets cured at a place for stem cell research. He ties to sue the restaurant, but he loses at a trial because he does not have any evidence. Peter and Brian go to the restaurant's headquarters. They take a tour of the place to try to find evidence. They find a slaughterhouse with a talking cow in it. The cow talks about how the restaurant has harmed many other cows. Peter and Brian help the cow leave the headquarters while security guards run after them. The cow makes a public speech that makes the restaurant look bad. Stewie makes a bet to Brian that he will be the most popular kid in a high school. He gets a teenage girlfriend and wins the bet. He tries to have sexual intercourse with his girlfriend, but she laughs at him for having a small penis. On the next day, Stewie gets bullied for his small penis. He gets his girlfriend arrested by telling people she is a pedophile. == Production == \"McStroke\" was written by Wellesley Wild and Brian Iles is the director of the episode. The episode was broadcast while Seth MacFarlane (creator of Family Guy) was in the 2007–08 Writers Guild of America strike. MacFarlane worked on writing and voice acting before the strike. He did not help work on the episode after that. Ralph Garman, Max Burkholder, Lisa Wilhoit, Alex Breckenridge, Denis Martel, Ricardo Montalban, and Phil LaMarr are guest stars in the episode. == Reception == The episode was watched by about 11.50 million viewers when it was first broadcast. Ashan Haque from IGN said that the episode was \"much more entertaining\" than a regular episode of Family Guy. Robert Pierson from The TV Critic thought that the jokes in the episode were \"pretty good\". Pierson said that the writing of the stories was bad, but not annoying. Brad Trechak from TV Squad said that the episode had \"really good ideas\", but thought that the writing was not good. Trechak thought that the Writers Guild of America strike made the quality of the episode worse. Genevieve Koski from The A.V. Club thought that the episode did not have much organization, but said there were some good jokes. The Parents Television Council called it the \"Worst TV Show of the Week\" because of the story with Stewie and his teenager girlfriend. Tom Eames from Digital Spy thought the episode \"made strokes funny\" and said it was \"A farce of an episode, but in a good way.\" == References == == Other websites == * Category:Family Guy episodes Category:2008 television episodes",
 "title": "McStroke"
}