{
 "id": "839819",
 "text": "There is a well established chronology of the reigns of rulers in Ancient Manipur (Ancient Kangleipak) before the reign of Emperor Nongda Lairen Pakhangba () of the Ningthouja dynasty, that is before 33 AD. According to ancient sources, Nongta Lailen Pakhangpa fought fierce battles against the Khaba-Nganba dynasty to win over the sacred city of Kangla in Ancient Manipur. ==First ten rulers== There is a genealogy of ten successive foremost rulers in ancient Manipur kingdom. Name of the rulers Period (in Christian year) Period (in Maliyapham year) Taang-jaa Lee-La Pakhangpa 1445 BC- 1405 BC - Ningthou Kangba 1405 BC- 1359 BC 00 MF- 39 MF Maliyapham Palcha 1359 BC- 1329 BC 39 MF- 69 MF Ningthou Kaksuba 1329 BC- 1297 BC 69 MF- 101 MF Ningthou Tonkonba 1297 BC- 1276 BC 101 MF- 122 MF Ningthou Pottingkoi 1276 BC- 1251 BC 122 MF- 147 MF Ningthou Laanbichaa 1251 BC- 1229 BC 147 MF- 169 MF Ningthou Sapaiba 1229 BC- 1209 BC 169 MF- 189 MF Ningthou Puthiba 1209 BC- 1199 BC 189 MF- 199 MF After the reigns of these ten kings, there is a great historical gap, from 1199 BC to 44 BC. ==Rulers after the great historical gap== Name of the rulers Period (in Christian year) Period (in Maliyapham year) Samlungphaa 44 BC- 34 BC 1354 MF- 1364 MF Poireiton 34 BC- 18 BC 1364 MF- 1380 MF Singtabung 18 BC- 08 BC 1380 MF- 1390 MF Paangminnaba 08 BC- 01 BC 1390 MF- 1397 MF Luwang Khunthiba 01 BC- 05 AD 1397 MF- 1403 MF Luwang Punshiba 05 AD- 33 AD 1403 MF- 1431 MF After this, the reign of Nongta Lailen Pakhangpa started from 33 AD, with the annexation of the Kangla by the Ningthouja dynasty. ==Achievements and Development== ===Invention of Polo=== The present day game polo was originally developed from the traditional Sagol Kangjei game, which was invented by King Ningthou Kangba (1405 BC- 1359 BC). ===Invention of calendar=== During the reign of Maliyapham Palcha (aka. Mariyafambalcha) (1359 BC- 1329 BC), the present day Meitei calendar was invented and developed in a systematic way for public usage. ===Civilizational upgradations=== During the reign of Poireiton, a semi-historical and semi-mythical ruler, there were much advancements in the civilization. * The invention of the knowledge of the systematic usage of fire and fireworks. * The presently known Chakhao paddy plant (aromatic black rice) was first cultivated in the plains of Manipur (Kangleipak) kingdom. ==References== Category:Kings of Ancient Manipur Category:History of Manipur",
 "title": "Rulers of ancient Manipur before Nongta Lailen Pakhangpa"
}