{
 "id": "839899",
 "text": "Events in the year 2019 in Angola. ==Current leaders== * President: João Lourenço * Vice President: Bornito de Sousa ==Events== ===January to June=== *23 January – The National Assembly agrees on new criminal rules, the country's first one since independence in 1975. Among the new rules passed, according to Human Rights Watch, was making same-sex activity no longer illegal and the outlawing of discrimination based on sexual orientation. *13 March – A place holding between 450 and 600 million containers of oil is discovered off the Angolan coast by the Italian company Eni. *22 March – The Angola national football team qualifies for the 2019 Africa Cup of Nations finals following a 1–0 win over Botswana in Francistown. *30 April – A UNICEF report reveals that drought in the first three months of the year has caused the number of Angolans in the southern Cunene Province needing humanitarian assistance to triple to more than 800,000. The report also states that about 2.3 million people in the country are now at danger of not having a stable amount of food, with severe hunger affecting 2,500 children under the age of five in six provinces. *8 May – President João Lourenço gets rid of Carlos Saturnino from his role as Chief Executive of the state oil company Sonangol after fuel shortages cause power cuts and long lines at petrol stations in the capital Luanda. ===July to December=== *2 July – The Angola national football team is removed after losing from the Africa Cup of Nations after a 1–0 defeat to Mali ends their chances of progressing beyond the group stage of the contest. *15 August – Former transport minister Augusto da Silva Tomas is found guilty by the Supreme Court of charges including theft of money, fraud, and abuse of power committed during his tenure in office from 2008 to 2017. He is sent to fourteen years in prison. *21 August – Presidents Paul Kagame of Rwanda and Yoweri Museveni of Uganda sign an agreement in Luanda to fix the bad relations between their respective nations after recent accusations of spying, murder, and harming trade. *8 September – The men's national basketball team stops going to the 2019 FIBA World Cup in China with one win and four losses from five games. *1 November – Aristofanes dos Santos, the provincial commander of the national police, announces that national firearms limiting campaigns over the past eleven years have resulted in the forced removal of more than 100,000 firearms, most of which were found to have connections to the Angolan Civil War. *5 December – The International Monetary Fund allows for a $247 million loan to Angola after believing the government's efforts to lower state spending and change the ways in which money was earned in the national economy beyond oil as good. *31 December – The belongings of Isabel dos Santos, the daughter of former President José Eduardo dos Santos, are frozen by the government after she is accused of failing to repay $1 billion in goverment funds. ==Deaths== *9 January – Filipe Abraão, basketball player (born 1979). *15 January – Jerónimo Neto, handball coach (born 1967). *15 April – Joaquim Alberto Silva, footballer (born 1974). *22 November – Eduardo Nascimento, singer (born 1943). ==References== Category:21st century in Angola Category:2019 in Africa",
 "title": "2019 in Angola"
}