{
 "id": "83985",
 "text": "An electronic component is a basic electronic element. Components can be connected together to make circuits. Components can be single items (resistor, transistor) or in more or less complex groups like integrated circuits (logic gate, resistor array). ==List of electronic components== ===Wire=== A thin metal conductor ===Cable=== A flexible conducting electrical or optical link. * cable connector: connector at either end of a cable. * cable matcher: an impedance matching device that allows non-standard cable to be used with a particular device. * cable plant = all the cables, connectors and patch panels within a building or office. * cabling = cable as a material. * co-axial cable = These cables are usually made of a conducting wire. Then there is some insulation, then there is another layer of conducting material. Finally there is the (insulating) mantle. Such cables are used as a high-frequency transmission line to carry a high-frequency or broadband signal. Because the electromagnetic field carrying the signal exists (ideally) only in the space between the inner and outer conductors, it cannot interfere with or suffer interference from external electromagnetic fields. * ribbon cable = A flat, thin cable containing many parallel wires. Because of their shape, ribbon cables are ideal for situations where there isnt much space. They're used in a computer to connect disk drives to the disk drive controllers. * type cable = a specification for cable defined by IBM. ===Connector=== A physical device with a number of metal contacts that allow devices to be easily linked together. * connector plug = a device at the end of a fibre-optic or copper cable that receives and contains something. ===Switch=== A mechanical or hard state device that can electrically connect or isolate two or more lines. === Other === * Resistor * Capacitor * Transistor * Integrated circuit * Diode * MOSFET * LED * Inductor * Vacuum tube * Light Bulb == Other websites == *http://www.webopedia.com/ *http://whatis.techtarget.com/whome/0,289825,sid9,00.html *http://www97.intel.com/discover/JourneyInside/TJI_Intro/default.aspx",
 "title": "Electronic component"
}