{
 "id": "83998",
 "text": "The Outer Hebrides, often called the Western Isles,Although officially known by the Gaelic name, Na h-Eileanan Siar, this name is not understood in English. make up an island chain off the west coast of Scotland. It is also a parliamentary constituency. The northern island is Lewis and Harris. South of Lewis and Harris is a series of islands, such as South Uist, Benbecula and North Uist. The Outer Herides includes a number of even smaller islands. The isles form part of the Hebrides, and are separated from the Scottish mainland and from the Inner Hebrides by the stormy waters of the Minch, the Little Minch and the Sea of the Hebrides. Formerly the dominant language of the Islands, Scottish Gaelic remains spoken even though it has now been largely supplanted by English in some parts. Sea transport is crucial and a variety of ferry services operate between the islands and to mainland Britain. == History == The Western Isles became part of the Suðreyjar kingdom of the Norse, who ruled for over 400 years until sovereignty was transferred to Scotland by the Treaty of Perth in 1266. Control of the islands was then held by clan chiefs. == Geology & geography == Most of the islands have a bedrock formed from ancient metamorphic rocks and the climate is mild and oceanic. The Gulf Stream runs nearby. The 15 inhabited islands have a total population of about 26,500 and there are more than 50 substantial uninhabited islands. ===Flora and fauna=== Much of the archipelago is a protected habitat including both the islands and the surrounding waters. There are 53 Sites of Special Scientific Interest (SSSI) of which the largest are Loch an Duin, North Uist at and North Harris, which is in extent.\"Western Isles transitional programme strategy\" Comhairle nan Eilean Siar. Retrieved 19 May 2010.Rotary Club (1995) p. 10 Loch Druidibeg on South Uist is a National Nature Reserve owned and managed by Scottish Natural Heritage. The reserve covers 1,677 hectares across the whole range of local habitats. \"Loch Druidibeg National Nature Reserve: where opposites meet\". (pdf) SNH. Retrieved 29 July 2007. == Other websites == Historical footnote: Many websites of the Outer Hebrides derive content from the Eolas Virtual Hebrides, website. This was once the largest rural website in the world. Eolas went bankrupt in 2000 and the Eolas TV company became MacTV. The web design team became Reefnet and the content has largely found a home on GlobalGuide.Org. Sites deriving partly from the original Virtual Hebrides *Hebrides.com Photographic website from ex-Eolas Sam Maynard *Global Guide Hebrides Content website from ex-Eolas Scott Hatton *www.visithebrides.com Western Isles Tourist Board site from Reefnet *Virtual Hebrides.com Content from the VH which went its own way and became Virtual Scotland. *hebrides.ca Home of the Quebec-Hebridean Scots who were cleared from Lewis to Quebec 1838-1920's Other Outer Hebrides websites * *Stornoway Port Authority *Comhairle nan Eilean Siar *2001 Census Results for the Outer Hebrides *Visitor's guide to Stornoway *Hebridean-Life.com - a Guide to Living in the Outer Hebrides == Notes == Category:Outer Hebrides Category:Archipelagos",
 "title": "Outer Hebrides"
}