{
 "id": "839902",
 "text": "The Flash is an American superhero movie based on the DC Comics character of the same name. It is produced by DC Films, The Disco Factory, and Double Dream, and set for distribution by Warner Bros. Pictures. It is set in the DC Extended Universe (DCEU). ==Background== The movie is directed by Andy Muschietti from a screenplay by Christina Hodson. It stars Ezra Miller as Barry Allen / The Flash alongside Ben Affleck, Michael Keaton, Sasha Calle, Kiersey Clemons, Maribel Verdú, and Ron Livingston. In The Flash, Allen travels back in time to prevent his mother's murder, which causes many problems. The movie is inspired by the comic book storyline Flashpoint, featuring multiple DC Comics characters including Affleck and Keaton as different versions of Batman. The Flash was released in the United States on June 23, 2023. == Cast == * Ezra Miller as Barry Allen / The Flash: A police forensic investigator from Central City and member of the Justice League who can move at superhuman speeds using the Speed Force. * Ben Affleck as Bruce Wayne / Batman: A wealthy socialite from Gotham City, leader of the Justice League, and owner of Wayne Enterprises who became the vigilante known as Batman following his parents' murder. * Michael Keaton as Bruce Wayne / Batman: An older version of Wayne from an alternative universe. Keaton reprises his role from Batman (1989) and Batman Returns (1992). * Sasha Calle as Supergirl: A powerful Kryptonian with similar powers, abilities, and costume to Superman. * Kiersey Clemons as Iris West: A journalist for the Picture News and love interest of Barry Allen. * Michael Shannon as General Zod: A Kryptonian general who possesses the same powers as Superman, and was previously killed by the latter. Shannon reprises his role from Man of Steel. * Antje Traue as Faora-Ul: General Zod's sub-commander, who was sent to the Phantom Zone years prior. Traue reprises her role from Man of Steel. * Maribel Verdú as Nora Allen: Barry's mother who was murdered in his youth. Her husband Henry was blamed for her death. * Ron Livingston as Henry Allen: Barry's father, who was wrongfully convicted for the murder of his wife. Livingston replaces Billy Crudup, who played the character in other DCEU movies. Additionally, Saoirse- Monica Jackson and Rudy Mancuso have been cast in undisclosed roles. Temuera Morrison, who plays Aquaman's father Thomas Curry will also appear in the movie. ==References== Category:2023 superhero movies Category:American superhero movies Category:DC Extended Universe movies Category:Warner Bros. movies Category:Movies composed by Benjamin Wallfisch",
 "title": "The Flash (movie)"
}