{
 "id": "839908",
 "text": "Don 2 (also known as Don: The King Is Back) is a 2011 Indian Hindi-language action thriller film written, co-produced and directed by Farhan Akhtar. It is the second installment in the Don series. Jointly produced by Excel Entertainment and Red Chillies Entertainment, the film stars Shah Rukh Khan, Priyanka Chopra, Lara Dutta, Om Puri, Boman Irani and Kunal Kapoor. This film is a sequel to the 2006 film Don. The film's music was composed by Shankar–Ehsaan–Loy, while Javed Akhtar wrote the lyrics. Jason West served as the film's cinematographer and Ritesh Soni was its editor. Don 2 was released on 23 December 2011. The film had a mixed to positive reception from critics, receiving praise for the cast's performance, cinematography, production design, and action sequences. However, its pace and music received criticism. With a box office gross of over , Don 2 was a big box office success. At the time of its release, the film was one of the highest-grossing Indian films of all time and is the highest-grossing Indian film of 2011. The film received a number of accolades across various ceremonies in India. The film received five nominations at the 57th Filmfare Awards, including Best Film, Best Director for Akhtar and Best Actor for Khan, winning Best Sound Design and Best Action. ==Plot== Five years after the events of Don, the European drug cartel bosses meet in the French Riviera on a yacht to discuss a new threat emerging from Asia: Don is jeopardizing their business by undercutting their prices and they decree that he must die. Living in Thailand for the last five years, Don goes to a remote settlement to pick up a shipment of cocaine. He gets cornered by his own allies who reveal to him that once he is killed, the cocaine from Asia will be open for sale in Europe and they will usurp all the profits. Don makes his way out by killing all his allies and destroying the entire settlement. Later, Don returns to Malaysia, surrendering to Roma, who has joined Interpol, and Inspector Malik. He is sentenced to death and sent to prison, where he meets old rival Vardhaan. Initially, Vardhaan tries to exact revenge on Don for having him imprisoned five years back, he patches up with Don when the latter offers him an opportunity to escape with him. Don and Vardhaan eventually break out by poisoning the other inmates. In Zurich, Don meets trusted companion Ayesha, and they retrieve a tape from a secret locker whose key was under Vardhaan's possession. It shows J.K. Diwan, vice-president of the Euro-printing DZB (Deutsche Zentral Bank) bribing Singhania to kill James Werden, the original choice for the President of the DZB so that Diwan's superior, Fabian Kohl would become the new president. Singhania was killed by Vardhaan five years earlier. Don blackmails Diwan into giving him the bank's blueprints so he can steal the printing plates. Diwan gives him fake blueprints and hires Abdul Jabbar, a deadly assassin. However, Don escapes, and with no other choice, Diwan gives him the original blueprints. Roma and Malik arrive in Berlin and unsuccessfully interrogate Diwan, after having found evidence of him being involved with Don in some illegal activity, while Don and his team execute a bank robbery. After stealing the printing plates, Don is betrayed by Vardhaan and Jabbar but escapes. Another team member, Sameer, calls the police on Don and he is arrested. Don blackmails Diwan into giving him German immunity in exchange for erasing the evidence of him being involved in the murder of James Warden. He then negotiates with the German police and Interpol over surrendering the plates and a disc containing details of the European underworld in exchange for the safety of the hostages and defusing the bombs in the bank. Don and Roma reach Vardhan after bloody combat with his thugs and find themselves in a standoff. Though ordered by Vardhaan and Jabbar - and even Don himself - Roma is unable to kill Don and is shot by Jabbar in response; she still has feelings for him, even though he killed her brother and his fiancée five years earlier, and also does not want to do it illegally. Don manages to subdue Vardhaan and kills Jabbar. He obtains his immunity papers and surrenders the plates and the disc, as per the bargain. Don brings Roma to an ambulance and they exchange glances before the doors close. When the police later investigates the evidence, they are shocked to discover Diwan and Kohl were behind Werden's murder. Don later detonates a bomb planted earlier in Diwan's car, killing Diwan and seemingly destroying the plates which he had taken. In a final scene, it is revealed Don still has the currency plates, the ones which the police believe was destroyed in the explosion were fake. Sameer was actually loyal to Don; informing the police was part of the plan. The disc Don turned over actually contains the names of the European drug cartel. Having been exposed, Kohl is shortly arrested too, and the DZB is forced to replace him. After they are arrested, Don becomes king of the European underworld and tells Ayesha and Sameer they have no idea how rich they will become. == Cast == * Shah Rukh Khan as Don * Priyanka Chopra as Roma Bhagat * Boman Irani as Vardhaan Makhija * Kunal Kapoor as Sameer \"Sam\" Ali * Ally Khan as J. K. Diwan * Nawwab Shah as Abdul Jabbar * Sahil Shroff as Arjun Shergill * Wolfgang Stegemann as Karl Cost (Jabbar's German assistant) * Om Puri as Inspector Vishal Malik * Lara Dutta as Ayesha Kapoor * Rike Schmid as Yana, Sameer's wife * Martin Goeres as Jabbar's Goon * Timo Honsa as Jabbar's Goon * Christian Maria Goebel as Fabian Kohl * Günter Barton as James Werden * Bianca Karsten as Sophie Kohl * Hans-Eckart Eckhardt as Dr. Schneider * Klaus Schindler as Commissioner Muller * Jason West as Jimmy Coogan * Ridzuan Hashim as Jaruwan * Adi Putra as Don's Malaysian lawyer * Hrithik Roshan as Don (disguised face; special appearance) * Rajesh Khattar as Cartel boss Singhania (archive footage) * Florian Lukas as Officer Jens Berkel * Nicolas Walier as SEK officer * Sten Jacobs as SEK officer ==Sequel== About a sequel, Shah Rukh Khan said: \"It would be great to revisit Don after some time. I’ve told Farhan that we could take 60 days out of our schedule and make a Don 3. But we need a script first, one that could take the last 10 minutes of Don 2 forward to another differently exciting thriller.\" Farhan Akhtar also expressed a desire to take the story forward and said he was fascinated by the character of Don. However, the filmmaker wanted to explore other genres without restriction and added that he was currently focusing on his acting career. In August 2014, it was reported that Farhan Akhtar planned to play a role in the film. In October 2015, Akhtar said that Don 3 will go on floors by late 2016. However, the film is at the scripting stage. It has also been reported that Katrina Kaif will replace Priyanka Chopra in the next installment. But the makers denied this, stating that the only constant in the third installment will be dependent on Don, the rest of the characters, and the script. ==References== Category:2010s Indian movies Category:2010s Hindi- language movies Category:2010s action thriller movies",
 "title": "Don 2"
}