{
 "id": "839900",
 "text": "Black Adam is a 2022 American superhero movie based on the DC Comics character of the same name. It is produced by DC Films, New Line Cinema, Seven Bucks Productions, and FlynnPictureCo., and set for distribution by Warner Bros. Pictures. It is directed by Jaume Collet-Serra and written by Adam Sztykiel and Rory Haines & Sohrab Noshirvani. The movie is a spin-off from Shazam! (2019) and the eleventh movie in the DC Extended Universe (DCEU). The movie stars Dwayne Johnson as Teth-Adam / Black Adam alongside Noah Centineo, Aldis Hodge, Sarah Shahi, Quintessa Swindell, and Pierce Brosnan. Black Adam released in the United States on October 21, 2022.'Black Adam' and 'League of Super-Pets' Release Dates Delayed By Several Months ==Plot== In 2600 BC, the tyrannical king of Kahndaq, Ahk-Ton, creates the Crown of Sabbac, which gives the wearer great power. After attempting to stage a revolt, a young slave boy is given the powers of Shazam by the Council of Wizards, transforming him into Kahndaq's heroic champion, who kills Ahk-Ton and ends his reign. In the present day, Kahndaq is oppressed by the Intergang. Archaeologist and resistance fighter Adrianna Tomaz tries to locate the Crown of Sabbac with the help of her brother Karim and their colleagues Samir and Ishmael. As Adrianna obtains the crown, Intergang ambushes them, and Samir is killed. Adrianna reads an incantation that awakens Teth-Adam, whom she believes to be Kahndaq's champion, from a slumber. Adam slaughters most of the Intergang troops. US government official Amanda Waller deems Adam a threat and contacts the Justice Society—Hawkman, Doctor Fate, Cyclone, and Atom Smasher—to take him into custody. The Justice Society arrives in time to stop Adam from causing further destruction to Kahndaq and Intergang's troops, before explaining to Adrianna that Adam was not a savior who was entombed, but a madman who was imprisoned. Ishmael reveals himself as the leader of Intergang in Kahndaq and chases Adrianna's teenage son Amon, who has stolen the crown. Adam, Adrianna, and the Justice Society intend to use the crown to trade for Amon. They reach Ishmael, who reveals that he is the last descendant of King Ahk-Ton and, wanting his rightful place on the throne, demands the crown, which Adrianna willingly gives to save Amon's life. Ishmael betrays his part of the deal and shoots at Amon, and Adam, trying to save Amon, loses control and destroys the hideout with his power, killing Ishmael and wounding Amon. Guilt-ridden, Adam flees to the ruins of Ahk-Ton's palace, where he reveals to Hawkman that the legends of Kahndaq's champion were told incorrectly; it was Adam's son Hurut who was granted the powers of Shazam and became Kahndaq's champion. Knowing that Hurut was invincible, Ahk-Ton's assassins were instructed to execute Hurut's family, including Adam and Hurut's mother. Hurut gave Adam his powers to save his life, and Ahk-Ton's assassins immediately killed the de-powered Hurut. An enraged Adam slaughtered all of the king's men and inadvertently destroyed Kahndaq's palace. He was subsequently deemed unworthy by the Council of Wizards and imprisoned within the Rock of Eternity. Feeling incapable of becoming a true hero, Adam surrenders. The Justice Society takes him to a secret Task Force X black site, where Fate has a premonition of Hawkman's impending death. As the Justice Society returns to the city, they realize Ishmael intentionally made Adam kill him while he was wearing the Crown of Sabbac, having shot at Amon so that he could be damned to Hell and reborn as the champion of the six demons of Sabbac, arising from the underworld to claim his throne and the power held within. Sabbac summons the Legions of Hell to terrorize Kahndaq, but Amon, Adrianna, and Karim rally the people to repel them. The Justice Society prepares to face Sabbac in Ahk-Ton's ruins, but Fate creates a magical force field that prevents Hawkman, Cyclone, and Smasher from entering. He reveals that Hawkman's death can be avoided with his own sacrifice. Fate fights Sabbac alone and uses an astral projection to release Adam after talking to him in his cryo sleep. Sabbac then kills Fate, causing the force field to disappear, and allowing the others to fight. Just as Sabbac is about to kill the Justice Society, Adam arrives and engages him. With aid from Hawkman using Fate's helmet, Adam kills Sabbac. The Justice Society departs on good terms with Adam, who accepts his new role as the protector of Kahndaq and adopts a new name, Black Adam. In a mid-credits scene, Waller communicates with Adam and warns him against leaving Kahndaq, before Superman arrives and suggests that they should talk. ==References== Category:American superhero movies Category:DC Extended Universe movies Category:Warner Bros. movies Category:Movies directed by Jaume Collet-Serra Category:2020s superhero movies",
 "title": "Black Adam (movie)"
}