{
 "id": "839903",
 "text": "Farhan Akhtar (born 9 January 1974) is an Indian actor, director, screenwriter, playback singer, producer, and television host who works in Hindi films. Born in Mumbai to screenwriters Javed Akhtar and Honey Irani, he grew up under the influence of the Hindi film industry. He began his career in Bollywood by working as an assistant director in Lamhe (1991) and Himalay Putra (1997). Akhtar directed his first film, Dil Chahta Hai (2001) and received critical acclaim for portraying modern youth in the film, which won the National Award for Best Hindi Film the next year. Following this success, he directed the cult war film Lakshya (2004) and had his Hollywood debut through the soundtrack of Bride and Prejudice (2004), for which he and sister Zoya Akhtar served as lyricists. Next came the commercial successful Don (2006), his third directorial venture, post which he directed a short film titled Positive (2007) to spread awareness on HIV-AIDS. Although he initially started his acting career with a delayed release in the Anand Surapur-directed drama The Fakir of Venice, Akhtar made his official screen debut with Rock On!! (2008) for which he won a second National Award for Best Feature Film in Hindi as producer, and indulged in further experimentation with Zoya's directorial debut Luck By Chance (2009) and the Vijay Lalwani-directed Karthik Calling Karthik (2010), before he wrote the dialogues and served as producer for the critical and commercial success Zindagi Na Milegi Dobara (2011) starring him in a leading role, which won him 4 Filmfare Awards, including Best Supporting Actor. The same year, after directing a sequel to Don titled Don 2 (2011), which remains his highest-grossing film till date, he achieved further success by portraying Milkha Singh in the 2013 film Bhaag Milkha Bhaag, earning him the Filmfare Award for Best Actor. Later, he received praise for starring in Zoya's ensemble comedy-drama Dil Dhadakne Do (2015) and Bejoy Nambiar's crime thriller Wazir (2016). ==References== Category:1974 births Category:Living people Category:Indian movie actors Category:Indian movie directors",
 "title": "Farhan Akhtar"
}