{
 "id": "840003",
 "text": "Tan Chuan-Jin (; born 10 January 1969) is a Singaporean politician. He served asSpeaker of the Parliament of Singapore from 11 September 2017 to 17 July 2023. == Education == Tan studied at the Anglo-Chinese School, Raffles Junior College, London School of Economics, King's College London and National University of Singapore's Lee Kuan Yew School of Public Policy. == Military career == Tan enlisted in the Singapore Armed Forces in 1987 and was commissioned as an officer in the Singapore Army before attaining the rank Brigadier-General. On 25 March 2011, Tan retired from the Singapore Armed Forces to enter politics. == Political career == Tan was announced as a People's Action Party (PAP) candidate joining the five-member PAP team contesting in Marine Parade GRC during the 2011 general election. Tan became a Member of Parliament representing the Kembangan–Chai Chee ward of Marine Parade GRC. On 1 August 2012, he was appointed Senior Minister of State at the Ministry of National Development and Acting Minister for Manpower. On 1 September 2013, Tan gave up his appointment at the Ministry of National Development and became Senior Minister of State at the Ministry of Manpower while continuing to serve as Acting Minister for Manpower. On 1 May 2014, he was promoted to full Minister. On 9 April 2015, Tan gave up his portfolio as Minister for Manpower and became Minister for Social and Family Development as part of a Cabinet reshuffle. During the 2015 general election, Tan joined a five-member PAP team contesting in Marine Parade GRC. After the election, Tan continued serving as Minister for Social and Family Development. On 11 September 2017, he resigned his Cabinet roles and became the 10th Speaker of Parliament. Tan still hold his parliamentary seat in Kembangan–Chai Chee after his five-member PAP team contesting in Marine Parade GRC won during the 2020 general election. After the election, he continued serving as Speaker of Parliament. On 11 July 2023, Tan made a public apology to Worker's Party's Member of Parliament, Jamus Lim after a clip of him using unparliamentary language during a parliamentary sitting on 17 April. Tan was heard saying \"fucking populist\" to Lim after he had given a speech. Lim accepted his apology. === Resignation === On 17 July 2023, both Tan resigned from Parliament and as member of the PAP due to \"propriety and personal conduct\". Prime Minister and PAP's Secretary-General Lee Hsien Loong said that Tan, who is married, had an extramarital affair. He had an extramarital affair with another Member of Parliament, Cheng Li Hui, since 2020. When Lee found out that the extramarital affair in February 2023, Tan had offered his resignation. Lee asked Tan to ensure his ward was taken care of. However, in July 2023, Lee found out Tan continued the affair. Therefore, Lee decided to remove Tan from the PAP immediately. == Personal life == Tan is married with two children. ==References== Category:1969 births Category:Living people Category:Singaporean politicians",
 "title": "Tan Chuan-Jin"
}