{
 "id": "840065",
 "text": "The European Institute for International Law and International Relations (EIIR) in French (L'Institut Européen pour le Droit International et les Relations Internationales) is a European Think Tank based in Brussels, Paris and Geneva, it's an independent policy institute and N.P. organisation based in Paris, France and Brussels, Belgium, represents a center dedicated to studies and research on international law, international relations, strategic topics and social life. The EIIR is a laboratory for strategic studies to combine both legal and strategic studies in the same frame. The institute provides a forum in Europe, annually hosting events, debates, and negotiations. == Overview == The European Institute for International Law and International Relations (EIIR) is an independent, international not-for-profit think tank dedicated to managing risk and building resilience to promote peace, security, and sustainable development. The European Institute for International Law and International Relations was founded in 2009 by Mahmoud Refaat in Paris and since 2013 in Brussels and Geneva as a think tank and policy institute. The Institute is administered by members of boards consisted of ex-politicians, ambassador and professors of political science, international law, international relations, economy, etc. The main focuses of the EIIR are international law, international relations, human rights, international security, international conflict and military balance == Scope of work == The European Institute for International Law and International Relations (EIIR) is dedicated to manage risk and building resilience to promote peace, security, and sustainable development. through a mix of policy research, strategic analysis, publishing, and convening. With staff from more than twenty countries and a broad range of academic fields, EIIR has offices facing European Union headquarters in Brussels and offices in Paris and Geneva. The European Institute for International Law and International Relations achieves physical activities in areas of conflict in different parts of the world to put an end to civil conflicts, war and to sue war criminals in front of international justice. In recent years the work of the institute has been focused on peace and developments in the Middle East and North Africa region, the development of an EU-Foreign and Security Policy, International Security, also – on a smaller range – on specific topics in Latin America and Africa. == Practice areas == * International relations * International law * Human rights * International security * International conflict * Military == Offices == * Brussels * Paris * Geneva == References == == Other websites == * Category:European organizations Category:2008 establishments in Europe",
 "title": "European Institute for International Law and International Relations"
}