{
 "id": "840034",
 "text": "François de Bourbon (or Francis of Bourbon), Duke of Châtellerault (1492 – 13 September 1515) was a French prince from the House of Bourbon-Montpensier, a cadet branch of the House of Bourbon (itself a cadet branch of the Capetian dynasty). He was the brother of Louis II, Count of Montpensier, Charles III, Duke of Bourbon (also known as The Constable of Bourbon), Louise de Bourbon, Duchess of Montpensier, and Renée of Bourbon (who became Duchess of Lorraine on 26 June 1515, less than three months before François's death). ==Life== François de Bourbon was the third and youngest son of Gilbert de Bourbon, the Count of Montpensier, and his noble Italian wife Clara Gonzaga, with both of François's parents dying before he even became a teenager. François fought loyally under the command of his elder brother Charles in Guyenne and Navarre and was rewarded for his services by Francis I of France with the Duchy of Châtellerault in February 1514. François de Bourbon was killed in action on 13 September 1515 at the Battle of Marignano (in what is now the northern Italian city of Melegnano, in Lombardy) against the Swiss during the Italian Wars. After François's death, the Duchy of Châtellerault passed onto François's elder brother Charles, who was already Duke of Bourbon. After Charles's death in 1527 during the Sack of Rome, French King Francis I's mother Louise of Savoy inherited the Duchy of Châtellerault, with it becoming a part of the French royal domain after Louise's death in 1531. Later on, the Duchy of Châtellerault was given to Charles II de Valois, Duke of Orléans, the third and youngest son of Francis I of France. François de Bourbon never married but was rumored to have had an illegitimate daughter named Isabelle de Bourbon (who allegedly married a Spaniard named Laurent Suarez, the Count of Corunna), but this was never actually proven. ==References== Category:1492 births Category:1515 deaths Category:House of Bourbon Category:Capetian dynasty Category:French royalty Category:French nobility Category:16th-century French people Category:French military people",
 "title": "Francis, Duke of Châtellerault"
}