{
 "id": "84018",
 "text": "In Switzerland each Canton is free to decide its own internal organisation. Because of this there many types and names for smaller administrative divisions in each canton. The term District is used for these smaller divisions. ==Amt, Amtsbezirk, District and Distretto== Most Cantons are divided into Bezirke (German for districts). Some are called Ämter (Lucerne), Amtsbezirke (Bern), district (in French) or distretto (Tessin and part of Graubünden). The Bezirke generally only deals with administration and court organization. The cantons Graubünden and Schwyz are their own legal entities. They have the power to control taxes as well. ==No district level in ten cantons== Ten of the 26 Cantons do not have a district level of government: Uri, Obwalden, Nidwalden, Appenzell Ausserrhoden, Glarus, Zug, Basel-City and Geneva. Schaffhausen stopped using Bezirke in the middle of 1999. Since the start of 2003 Canton of St. Gallen does not use the Bezirk level any more. ==List of Swiss districts by canton== Canton Canton Canton Districts Districts AG Aargau 11 Bezirke AR Appenzell Ausserrhoden AI Appenzell Innerrhoden BS Basel-City BL Basel-Country 5 Bezirke BE Berne 26 Amtsbezirke, Districts FR Fribourg 7 Districts, Bezirke GE Geneva GL Glarus GR Graubünden 11 Bezirke, districts, distretti JU Jura 3 districts LU Lucerne 5 Ämter NE Neuchâtel 6 districts NW Nidwalden OW Obwalden SH Schaffhausen SZ Schwyz 6 Bezirke SO Solothurn 10 Bezirke SG St. Gallen 8 Wahlkreise TG Thurgau 8 Bezirke TI Ticino 8 distretti UR Uri VS Valais 14 districts, Bezirke VD Vaud 19 districts ZG Zug ZH Zürich 12 Bezirke Total Total Total 159 159 ===Canton of Zürich=== The Canton of Zürich is divided into 12 districts (German: Bezirke). The city of Zürich is its own district. District Capital Affoltern Affoltern am Albis Andelfingen Andelfingen Bülach Bülach Dielsdorf Dielsdorf Dietikon Dietikon Hinwil Hinwil Horgen Horgen Meilen Meilen Pfäffikon Pfäffikon Uster Uster Winterthur Winterthur ===Canton of Bern=== There are 26 administrative districts in Berne District Capital Aarberg Aarberg Aarwangen Aarwangen Bern Bern Biel Biel Büren Büren an der Aare Burgdorf Burgdorf Courtelary Courtelary Erlach Erlach Fraubrunnen Fraubrunnen Frutigen Frutigen Interlaken Interlaken Konolfingen Konolfingen Laupen Laupen Moutier Moutier La Neuveville La Neuveville Nidau Nidau Niedersimmental Wimmis Oberhasli Meiringen Obersimmental Blankenburg Saanen Saanen Schwarzenburg Schwarzenburg Seftigen Belp Signau Langnau im Emmental Thun Thun Trachselwald Trachselwald Wangen Wangen an der Aare ===Canton of Lucerne=== The Canton of Lucerne is divided into 5 districts termed Ämter: District Capital Amt Lucerne Lucerne Amt Hochdorf Hochdorf Amt Sursee Sursee Amt Willisau Willisau Amt Entlebuch Schüpfheim ===Canton of Uri=== Canton of Uri is not divided into districts: the municipality is the next lowest unit of government. ===Canton of Schwyz=== The Canton of Schwyz is divided into six districts and 30 municipalities, although the districts Einsiedeln, Küssnacht and Gersau simply comprise the municipality of the same name. District Municipalities Schwyz Schwyz, Arth, Ingenbohl, Muotathal, Steinen, Sattel, Rothenthurm, Oberiberg, Unteriberg, Lauerz, Steinerberg, Morschach, Alpthal, Illgau, Riemenstalden Einsiedeln Einsiedeln Gersau Gersau Höfe Wollerau, Freienbach, Feusisberg Küssnacht Küssnacht am Rigi March Lachen, Altendorf, Galgenen, Vorderthal, Innerthal, Schübelbach, Tuggen, Wangen, Reichenburg ===Canton of Obwalden=== Obwalden is not divided into districts: the municipality is the next lowest unit of government. See: Obwalden. ===Canton of Nidwalden=== Nidwalden is not divided into districts. ===Canton of Glarus=== Canton of Glarus is not divided into districts: the municipality is the next lower unit of government. ===Canton of Zug=== Canton of Zug is not divided into districts. ===Canton of Fribourg=== The Canton of Fribourg is divided into 7 districts: District Capital Broye Estavayer-le-Lac Glâne Romont Gruyère Bulle Saane Fribourg See Murten Sense Tafers Veveyse Châtel-Saint- Denis ===Canton of Solothurn=== From 2005, Solothurn's ten districts are combined in pairs into five electoral districts, called Amtei. From 2005, districts are only used for statistics. District Electoral district Bucheggberg Amtei Wasseramt-Bucheggberg Dorneck Amtei Dorneck-Thierstein (unofficially Schwarzbubenland) Gäu Amtei Thal-Gäu Gösgen Amtei Olten-Gösgen (unofficially Niederamt) Lebern Amtei Solothurn-Lebern Olten Amtei Olten- Gösgen Solothurn Amtei Solothurn-Lebern Thal Amtei Thal-Gäu Thierstein Amtei Dorneck-Thierstein Wasseramt Amtei Wasseramt-Bucheggberg ===Canton of Basel- City=== Basel-City is not divided into districts. It is formed only of the city of Basel and two municipalities. ===Canton of Basel-Country=== There are 5 Bezirke in Basel-Landschaft: District pop Capital Pop Arlesheim 145 039 Arlesheim 8 944 Laufen 17 845 Laufen 5 039 Liestal 55 396 Liestal 12 817 Sissach 31 770 Sissach 5 569 Waldenburg 15 045 Waldenburg 1 280 ===Canton of Schaffhausen=== The Canton of Schaffhausen used to be divided into 6 districts (Bezirke) until July 1999. The municipality is now the next lower unit of government. ===Canton of Appenzell Ausserrhoden=== Canton Appenzell Ausserrhoden is not divided into districts. The municipality is the next lower unit of government. ===Canton of Appenzell Innerrhoden=== The 6 Bezirke (districts) are the local government level. They are part of the municipalities: District pop Appenzell 5 587 Gonten 1 398 Oberegg 1 831 Rüte 3 036 Schlatt-Haslen 1 160 Schwende 2 094 Feuerschaugemeinde is a special- purpose municipality for firefighting, energy and water for the town Appenzell. ===Canton of St. Gallen=== The canton used to be subdivided into 14 districts (Bezirke) until 2003 January 1, when it was reorganised into 8 constituencies (Wahlkreise). ===Canton of Graubünden=== Canton Graubünden is divided into 11 Districts. They tend to follow the natural boundaries of the landscape. The districts are further subdivided into 39 sub-districts (German: Kreise): District Sub-districts Albula Alvaschein, Belfort, Bergün and Surses Bernina Brusio and Poschiavo Hinterrhein Avers, Domleschg, Rheinwald, Schams and Thusis Imboden Trins and Rhäzüns Inn Ramosch, Sur Tasna, Suot Tasna and Val Müstair Landquart Maienfeld and Fünf Dörfer Maloja Bergell and Oberengadin Moesa Calanca, Misox and Roveredo Plessur Chur, Churwalden and Schanfigg Prättigau/Davos Davos, Jenaz, Klosters, Küblis, Luzein, Schiers and Seewis Surselva Disentis, Ilanz, Lumnezia/Lugnez, Ruis and Safien ===Canton of Aargau=== Aargau is divided into 11 districts. District Capital Aarau Aarau Baden Baden Bremgarten Bremgarten Brugg Brugg Kulm Unterkulm Laufenburg Laufenburg Lenzburg Lenzburg Muri Muri Rheinfelden Rheinfelden Zofingen Zofingen Zurzach Zurzach ===Canton of Thurgau=== The Canton of Thurgau is divided into eight districts. Each district is named after its capital. District Capital Steckborn Steckborn Frauenfeld Frauenfeld Kreuzlingen Kreuzlingen Weinfelden Weinfelden Bischofszell Bischofszell Diessenhofen Diessenhofen Münchwilen Münchwilen Arbon Arbon ===Canton of Ticino=== The Canton of Ticino is divided into 8 districts (called distretti): * Distretto di Mendrisio * Distretto di Lugano * Distretto di Locarno * Distretto di Vallemaggia * Distretto di Bellinzona * Distretto di Riviera * Distretto di Blenio * Distretto di Leventina ===Canton of Vaud=== Since 1803 the Canton of Vaud has been divided into 19 districts: District Capital Aigle Aigle Aubonne Aubonne Avenches Avenches Cossonay Cossonay Echallens Echallens Grandson Grandson Lausanne Lausanne Lavaux Cully Morges Morges Moudon Moudon Nyon Nyon Orbe Orbe Oron Oron Payerne Payerne Pays-d'Enhaut Château-d'Œx Rolle Rolle La Vallée Le Sentier (in Le Chenit) Vevey Vevey Yverdon Yverdon-les-Bains As of January 1, 2008, Vaud will be reorganized into the following districts: *Aigle *Broye-Vully (which will combine the districts of Avenches and Payerne, and part of the districts of Moudon and Oron) *Gros-de-Vaud (which will combine the district of Echallens, and part of the districts of Cossonay, Moudon, and Oron) *Jura-North Vaudois (which will combine the districts of Grandson, Orbe, and Yverdon) *Lausanne (part of the current district will be merged into West Lausannois) *Lavaux-Oron (which will combine the district of Lavaux and part of the district of Oron) * Morges (which will combine parts of the districts of Aubonne, Cossonay, Morges, and Rolle) * Nyon (part of Rolle district will merge into Nyon) *Riviera-Pays-d'Enhaut (which will combine the current districts of Pays-d'Enhaut and Vevey) *West Lausannois (which will be carved out of parts of the districts of Lausanne and Morges) ===Canton of Valais=== The Canton of Valais is divided into 14 districts and half-districts: * Brig * Conthey * Entremont * Goms * Hérens * Leuk * Martigny * Monthey * Raron * Saint-Maurice * Sierre * Sion * Visp See also: Valais Municipalities ===Canton of Neuchâtel=== The Canton of Neuchâtel is divided into 6 districts which belong to 4 geographic regions: District Capital District of Neuchâtel Neuchâtel District of Boudry Boudry District of Val-de-Ruz Cernier District of Val-de-Travers Môtiers District of La Chaux-de-Fonds La Chaux-de-Fonds District of Le Locle Le Locle ===Canton of Geneva=== The Canton of Geneva is not divided into districts. The municipality is the next level of government. ===Canton of Jura=== Canton Jura is divided into 3 districts: District Capital Delémont Delémont Porrentruy Porrentruy Franches-Montagnes Saignelégier *",
 "title": "Districts of Switzerland"
}