{
 "id": "840453",
 "text": "The Commission on Presidential Debates (CPD) is a nonprofit corporation created in 1987 under the joint sponsorship of the Democratic and Republican political parties in the United States. The CPD sponsors and produces debates for U.S. presidential and vice-presidential candidates with research and educational activities relating to the debates. It has run all of the presidential debates held since 1988, except for 2024. The commission's debates are sponsored by private funding and donations from foundations and corporations as well as fees from hosting institutions. In 2024, both incumbent Democratic presidential candidate Joe Biden and former Republican president Donald Trump criticized the CPD and instead sought new debates, even when Biden dropped out and Vice President Kamala Harris took his place, the CPD still could not find a debate. == 2024 debates == In early 2022, the Republican National Committee (RNC) said it planned to amend the Republican Party Bylaws to prohibit Republican presidential candidates from participating in debates sponsored by the CPD, removing traditional commission debates. The RNC unanimously passed the amendment to remove the CPD from office in April 2022 due to its \"biased\". In November 2023, the CPD released its debate plan for the 2024 U.S. presidential election, with three presidential debates from September 16, October 1, and October 9, 2024 and a vice presidential debate to be held on September 25, 2024. Despite this, both the Joe Biden and Donald Trump campaigns criticized the plan, concerned that the debates would be held too late in the campaign season. Both the Trump and Biden campaigns have tried to avoid CPD debates, choosing other venues (CNN and ABC) instead, breaking the traditional commission debates, overshadowing future CPD debates. In June 2024, CPD announced that it would be dropping its previously selected venues, adding that \"CPD is prepared to sponsor the 2024 debates if circumstances change.\" ==References== Category:1987 establishments in the United States Category:United States presidential elections",
 "title": "Commission on Presidential Debates"
}