{
 "id": "840465",
 "text": "Gustavo Francisco Petro Urrego (; born 19 April 1960) is a Colombian politician who is the President of Colombia since 2022. Petro was a Senator from 2018 until 2022. He was senator before from 2006 until 2010. He was mayor of Bogotá from 2012 until 2015. From 1991 until 1994 and again from 1998 until 2006, Petro was a member of the Colombia House of Representatives. At aged 17, Petro became a member of the guerrilla group 19th of April Movement and was part of the group when he was elected to the House of Representatives. He ran for the presidency of Colombia in the 2010 election, finishing fourth in the race. Petro ran again for president and came in second in the first round of the 2018 election with over 25% of the votes and lost in the run-off election on June 17 to Iván Duque. Petro ran again for president in the 2022 election. His campaign focused on climate change and reducing Greenhouse gas emissions that cause it by ending fossil fuel exploration in Colombia. In May 2022, he came in first place in the first round of voting and advanced to the June run- off against right-wing populist Rodolfo Hernández Suárez. In June 2022, he won the election by a 50% to 47% margin and became the country's first left-wing president in Colombia's history. ==Early life== Petro was born in Ciénaga de Oro, Córdoba. His parents were farmers. He was raised Roman Catholic, although he is not very religious. Petro studied at the Colegio de Hermanos de La Salle. He founded the student newspaper Carta al Pueblo (\"Letter to the People\"). At the age of 17 he became a member of the 19th of April Movement. During his time in 19 April Petro became a leader, and was elected ombudsman of Zipaquirá in 1981 and councilman from 1984 to 1986. In 1985, Petro was arrested by the army for the crime of illegal possession of arms. He was convicted and sentenced to 18 months in prison. Petro graduated with a degree in economics from the Universidad Externado de Colombia. He earned a master's degree in economics from the Universidad Javeriana.Mayor of the Month; City Mayors; Adriana Maciel, Alidad Vassigh; June 2012 He also studied at the University of Salamanca in Spain. ==Congressional career== In 2002, Petro was elected to the Chamber of Representatives representing Bogotá. During this period he was named \"Best Congressman\".Caracol Radio, El Congreso eligió a los mejores y peores de esta legislatura In 2006, Petro was elected to the Senate.es.Wikinews, Resultados elecciones legislativas de 2006, march 2006 When he was a senator, Petro was against the government of Álvaro Uribe. During his time in the senate, Petro and his family would get many death threats. In May 2007, some members of the Colombian Army were caught spying on Petro and his family.Investigan a dos militares por espionaje a familia de Petro. El Espectador. 7 May 2007 After not winning the 2018 presidential election, Petro returned to the Senate in July 2018. He left office in July 2022, a few weeks before his presidential inauguration. ==2010 presidential campaign== In 2008, Petro announced his candidacy for President of Colombia in the 2010 election. He wanted to fix the government system in Colombia and eventually won the Alternative Democratic Pole nomination in September 2009. In the presidential election held on 30 May 2010, Petro did better than polls had thought he would. He won a total of 1,331,267 votes, 9.1% of the total, finishing as the fourth candidate. ==Mayor of Bogotá== When he was mayor, he made it illegal to carry firearms, which lowered the murder rate in the city. During his time, pro-feminist and LGBT centers were created as well as abortion care places. In 2014, there was a recall vote to remove Petro from office, which many saw as politically motivated and he was removed from mayor and banned from politics for a short time during this year. Eventually he returned as mayor to finish his term after many legal challenges. ==2018 presidential campaign== In 2018, Gustavo Petro was again a presidential candidate, this time getting the second best result in voting counting in the first round on 27 May, and advanced to the second round. During this time, right-wing political enemies of Petro accused him of corruption. During this campaign, he showed support for universal health care, public banking, against fracking and mining in favor of clean energy, and land reform. He lost the election to Ivan Duque while Petro returned to the Senate. During this time, Petro received death threats from the paramilitary group Águilas Negras. ==2022 presidential campaign== In 2021, Petro announced his candidacy for the 2022 elections. In September 2021, Petro announced that he would retire from politics if he were to lose this election. During this campaign, he focused on climate change reform, clean energy and fixing the country's economic inequalities. He also promised to raise taxes on the richest 4,000 Colombians and would support having President Iván Duque be on trial for police brutality committed during the 2021 Colombian protests. When he won the Historic Pact primary, Petro picked Afro-Colombian human rights and environmental activist Francia Márquez, to be his running mate. Petro and his running mate Francia Márquez got many death threats from paramilitary groups while on the campaign trail. He had cancelled rallies in Colombiaʼs coffee region in early May 2022 after his security team found a plot by the La Cordillera gang. Many international politics signed a letter in support of Petro and criticized the rise of political violence in Colombia. Some of the people who signed were former Ecuadorian president Rafael Correa, American linguist and philosopher Noam Chomsky and member of the French National Assembly Jean-Luc Mélenchon. During the campaign, Petro was supported by former Uruguayan president José Mujica and former Spanish prime minister José Luis Rodríguez Zapatero. Petro won the most votes in the first round held on 29 May but did not win more than 50% of the vote to avoid a second round. He faced the former mayor of Bucaramanga and businessman, Rodolfo Hernández Suárez in the run-off on 19 June. In the second round, Petro and Márquez won the election by winning 50.44% of the popular vote against Hernández. ==Presidency== Petro was sworn in on 7 August 2022. Large protests began in Colombia on 26 September 2022 against reforms and the government of President Petro. Throughout 2023, Petro's disapproval rating rose, rising to 53% disapproving of his performance in March 2023. He has been criticized for his tackling of crime, his stalled reforms in the legislative branch, his disagreements with the Office of the Attorney General of Colombia, and scandal involving Chief of Staff Laura Sarabia. By June 2023, 33% of Colombians approved of Petro's performance, and 61% disapproved. ==Personal life== Petro was married three times. His first marriage to Katia Burgos ended in divorce and with one son. He was married to Mary Luz Herrán from 1992 until 2003, which also ended in divorce. They had two children. In 2003, he married Verónica Alcocer and they had two children together and he also adopted Alcocer's son from another marriage. ==References== ==Other websites== * Colombia Humana Official Website * Colombia Politics political biography, Gustavo Petro * Interview with Gustavo Petro * Petro's profile at CityMayors Category:1960 births Category:Living people Category:Environmentalists Category:Colombian economists Category:Mayors of Bogotá Category:Presidents of Colombia Category:Current national leaders",
 "title": "Gustavo Petro"
}