{
 "id": "840596",
 "text": "The AI Song Contest 2020 was the inaugural edition of the AI Song Contest, organised by the Dutch public broadcaster VPRO, in collaboration with NPO 3FM and NPO Innovation. It was held at 8:30 pm on May 12, 2020 and was held in the Netherlands, presented by Lieven Scheire. Thirteen teams from eight countries took part in the contest. The contest was won by the Australian team Uncanny Valley with the song \"Beautiful the World\". ==Format== Each participating team had to submit a \"Eurovision-like\" song of up to three minutes that had been composed using artificial intelligence (AI). Human input was allowed, but the more AI was used, the more points the entry would get from the jury. The entries were also evaluated by the public through online ratings. The winner was announced that evening. ===Venue=== The contest was online by cause of the COVID-19 pandemic in Europe and was broadcast via a live stream on YouTube and was presented the points from the online voting were announced by Dutch television presenter Emma Wortelboer. ==Competing entries== The contest count with thirteen teams from eight countries. As there were no pre-qualifying rounds, multiple teams from each country could enter the competition. The contest featured the following competing entries: Country Team Song Language Points Place Jury Public Total Uncanny Valley \"Beautiful the World\" English 10 9.8 19.8 1 Beatroots \"Violent Delights Have Violent Ends\" English 6 5.3 11.3 8 Polaris \"Princess\" English 4 8.1 12.1 7 Algomus & Friends \"I Keep Counting\" English 8 7.5 15.5 4 DataDada \"Je secoue le monde\" French 5 6 11 9 Dadabots x Portrait XO \"I'll Marry You, Punk Come\" English 12 7.4 19.4 2 Ligatur \"Offshore in Deep Water\" English 4 4 8 12 OVGneUrovision \"Traveller in Time\" Instrumental 5 4.6 9.6 11 Can AI Kick It \"Abbus\" English 10 7.8 17.8 3 COMPUTD / Shuman & Angel-Eye \"I Write a Song\" English 5 8.8 13.8 5 KTH/KMH+Doremir \"Come To Ge Ther\" English 4 6.9 10.9 10 New Piano \"Painful Words\" English 2 3.2 5.2 13 Brentry \"Hope Rose High\" English 8 5.7 13.7 6 ==References== ==Other websites== *Official website *VPRO page for the AI Song Contest *Oficial account on Twitter *AI Song Contest 2020 on YouTube Category:2020 in music Category:2020 in the Netherlands Category:Artificial intelligence",
 "title": "AI Song Contest 2020"
}