{
 "id": "840845",
 "text": "James Withycombe (March 21, 1843 – March 3, 1919) was a British-born American politician, a Republican, and the 15th Governor of Oregon. ==Early life== Born to Thomas and Mary Ann Withycombe in Devonshire, England, English tenant farmers in 1843. Withycome emigrated to the United States with his parents in 1871, settling on a farm near Hilsboro, Oregon. After turning 17, he spent four years working on his father's farm. In 1873, Withycomb purchased his own 100 acre parcel on the Horace Lindsay Land Claim, later expanding his holdings to 256 acres. Agriculture became Withycomb's passion, becoming a prosperous livestock breeder and establishing a reputation as a successful scientific farmer. ==Farmer and educator== His success led to his involvement in local farming organizations. He became a charter member of the Farmington Grange, and later became a leader in the state grange movement. From these platforms, Withycomb's efficient, innovative, and profitable farming methods became a model for farmers across the Pacific Northwest. His stature gained him an appointment as State Veterinarian in 1889, where he would diligently work to improve conditions of livestock health around the state. Although mostly self- educated, he was sought after by the Oregon Agricultural College at Corvallis (now Oregon State University) in 1898 to head up the college's experimental farming station. He received his Master's Degree in Agriculture 1891 from OAC. Using this position to advance Oregon agriculture, he would play a major part in introducing alfalfa and clover to Eastern Oregon, laying the groundwork for the region's future agricultural economy. Withycomb also became heavily involved in Oregon's agricultural industry, serving as president of the North Pacific Wool Growers and Northwest Sheep Breeders Associations. His tenureship on the board of the Oregon Academy of Sciences saw the dairy industry's profits rise from $2.5 million to $20 million. Such accomplishments built up respect for Withycombe statewide and gained the state Republican Party's attention. ==Governorship== Withycomb would enter politics in the 1906 primary, losing the Republican gubernatorial nomination. The 1910 election of controversial Democratic Governor Oswald West energized Oregon Republicans, who tapped Withycombe for the 1914 gubernatorial race. He handily defeated challenger Charles Smith; the first Republican Governor to assume office via election since T. T. Geer in 1903. As Governor, James Withycombe vigourously promoted agricultural development. A notable proposal from his administration was to ask the Legislative Assembly to subsidize flax production as a prison industry. The Withycombe Administration backed the \"Good Roads\" movement, creating the Oregon Highway Commission while in office. With the new commission in place, a large road-building program was initiated, establishing many of Oregon's modern state routes and highways. Upon the U.S. entry into the First World War, Governor Withycomb took a vocal and patriotic postion in support of the war effort. He encouraged volunteer military service, and promoted the state's war industries. While in office, he took a strong position against labor unions. He spoke out publicly against the Industrial Workers of the World, claiming that it terrorized labor and would cripple industry following several instances of I.W.W. threats to disrupt production in 1917. He organized veterans of the Spanish-American War into an Oregon State Defense force, and encouraged citizens in Eastern Oregon to form self- defence committees to defend the state against violent labor agitators. Withycomb used his powers as Governor to shipyard prevent a strike in Astoria, by calling out the National Guard. His 1918 reelection campaign capitalized on his wartime acts, portraying him as a wartime Governor actively protecting the state and aiding the defense of the United States. These efforts gained him a second term, of which he only served two months. James Withycombe died in office of a heart condition on March 3, 1919, succeeded by President of the Oregon State Senate Ben W. Olcott. ==Sources== * Oregon State Library * Klooster, Karl. Round the Roses II: More Past Portland Perspectives, pg. 118, 1992 ISBN 0-9619847-1-6 ==Other websites== * Oregon State Archives: Withycombe Administration -Photo and public speeches of Governor James Withycombe. Category:1843 births Category:1919 deaths Category:Governors of Oregon Category:Republican Party (United States) politicians Category:20th-century American politicians",
 "title": "James Withycombe"
}