{
 "id": "840847",
 "text": "Walter Marcus Pierce (May 30, 1861 - March 27, 1954) was an American politician, a Democrat, who served most notably as the 17th Governor of Oregon and a member of the United States House of Representatives from Oregon's 2nd Congressional District. ==Early life== Pierce was born to Charles M. and Charlotte L. (née Clapp) Pierce, Jacksonian Democrat farmers in Morris, Illinois on May 30, 1861. At the age of 17, he began teaching school despite only having a secondary education. The ideas of Manifest Destiny as espoused by Horace Greeley, influenced Pierce to move west in 1883. After arriving in Portland, Oregon in June of that year, he found no available work. After a time working the wheat fields of eastern Washington Territory, he earned enough money to finally settle in Milton, Oregon in Umatilla County. There, he returned to a career in education, and established a successful farm. As an educator, Pierce was drawn into local politics. He became well known for his pro-temperance views, as he regularly spoke out against saloons selling alcohol to his students. In 1887, he married one of his students, Clara R. Rudio, who would die during childbirth only three years later. He would marry Clara's sister, Laura in 1893. From 1886 until 1890, Pierce served as Superintendent of Umatilla County Public Schools. From 1890 until 1894, he served as Umatilla County Clerk, a prosperous time in which he earned enough money from land transactions to further his education. He then returned to Illinois with his family to attend Northwestern University, earning his Bachelors of Law degree in 1896. ==Early political career as a State Senator== After graduation, the Pierce family returned to Oregon, where Walter set up a successful law firm in Pendleton. Between 1896 and 1906, he would manage a power company, speculate in land, and become one of the state's most renowned Hereford Cattle breeders. He won election to and resumed the office of County Clerk, between 1899 and 1903. Pierce would successfully run for a seat in the Oregon State Senate in 1902. In his first term in the Senate, he unsuccessfully attempted to win passage of prohibition legislation, while successfully winning passage of a state subsidy of $6 per child for education. He was defeated at the polls for reelection, and retired from politics for a decade beginning in 1906. While out of politics, Pierce continued local and statewide activities. He took part in founding the Oregon Farmer's Union and the Public Power League, headed the State Taxpayers League, and took a seat on the board of Regents of Oregon Agricultural College from 1905 to 1927. He began advocating for using the Columbia River for hydroelectric electric power during this time. Pierce attempted a run for the Democratic nomination for a seat in the U.S. Senate in 1912, losing to Harry Lane in the general election. In 1916, his constituents elected him to once again serve in the State Senate. Pierce then unsuccessfully ran against incumbent Governor James Withycombe in 1918 as a progressive Democrat. In the next election, 1920, he lost his senate seat by only twenty-seven votes. ==Governorship== The loss of his State Senate seat did not stop Pierce from further pursuing the Governor's office. In 1922, he ran a successful campaign against Ben W. Olcott, with aid from the Ku Klux Klan. At the time, the Klan was growing in influence and power across the state, and had crafted an overtly anti-catholic and anti-sematic Cumpulsory School Bill. Governor Olcott was perceived as Catholic, and defiantly refused to work with the Klan in any way. Pierce had no such qualms, but was instructed by his advisors to not acknowledge any ties to the Klan. He lent his support to the school bil, and was swept into office with the largest margin of victory recorded in an Oregon Governor's race. As governor, Pierce had to battle with a Republican-dominated legislature. His administration was able to continue the road-building policies of the previous two administrations, but could not win passage of a state income tax or assessed value license fees for automobiles. He attempted to gain support from progressive Republicans on issues of prison reform, reforestation, and hydroelectric development, but divided the state Democratic Party by endorsing Robert M. La Follette for president in 1924. In March 1925, his second wife, Laura, succumbed to cancer. In the 1926 elections, Republican I. L. Patterson defeated Pierce. Upon leaving the Governor's office, Pierce returned to his ranch in Eastern Oregon to reflect upon his future political prospects. ==Member of the U.S. House of Representatives== Pierce decided that he wasn't through with politics, and unsuccessfully ran for the 2nd Congressional District seat in 1928. This same year, he married Cornelia Marvin, the first State Librarian of Oregon, his third and final wife. He declined to run for a second, inconsecutive term as governor in 1930. Pierce tried once more for Congress in 1932, a good year for progressive Democrats. He was elected amid exitement over the landslide Presidential election victory of Franklin Delano Roosevelt. Pierce would become a staunch supporter of FDR's New Deal, serving in Congress until his electoral defeat in 1943. One of the oldest politicians in Oregon history, Pierce retired from politics at age 81. He died near Salem, Oregon on March 17, 1954. ==Sources== * Oregon State Library * Klooster, Karl. Round the Roses II: More Past Portland Perspectives, pg. 122, 1992 ISBN 0-9619847-1-6 ==Other websites== * Oregon State Archives: Pierce Administration -Photo and some public speeches of Walter M. Pierce as Governor. * Walter M. Pierce's biography at the Biographical Directory of the United States Congress Category:1861 births Category:1954 deaths Category:Oregon state senators Category:Governors of Oregon Category:United States representatives from Oregon Category:Democratic Party (United States) politicians Category:20th-century American politicians",
 "title": "Walter M. Pierce"
}