{
 "id": "840807",
 "text": "Stephen Fowler Chadwick (December 25, 1825 - January 15, 1895), was an American Democrat politician who served as Governor of Oregon from 1877 to 1878. Governor Chadwick was the first person to obtain the governorship by way of the state's Line of Succession. ==Occupational background== Chadwick was a lawyer, admitted to the New York State Bar on May 30, 1850. He soon made his way to Oregon, setting up a law firm in the Douglas County settlement of Scottsburg in April 1851. Chadwick served as the town's first postmaster. ==Early Political Career== After moving from Scottsburg to Roseburg, Chadwick ran for the newly created position of Judge of Douglas County. Later he would go on to represent Douglas County at the Oregon 1857 State Constitiutional Convention. In the 1864 and 1868 Presidential elections, Chadwick served as an Democratic elector. Chadwick won the 1870 election to the position of Secretary of State, and was subsequently reelected in 1874. ==Governorship== In 1877, La Fayette Grover resigned the governorship after his election to the United States Senate by the State Legislature. Chadwick, as Secretary of State and second in the gubernatorial line of succession, was inaugurated to fill out the remaining year of Governor Grover's term. Although unconstitutional under Article V, Section 1 of the State Constitution, Chadwick also kept his position of Secretary of State. When signing official documents requiring the signatures of both the Secretary of State and Governor, he would sign first on the left side, then on the right. The most notable policy of his administration was Chadwick's stand on the Nez Perce Wars raging in the northeastern part of the state. Chadwick was unhappy with the stalemated situation, going so far as to inspect the front lines first-hand. He aided white settlers during the conflict, and argued for much harsher punishments for rebellious and uncooperative tribal leaders than the Army's policies. At the time of the 1878 elections, Governor Chadwick declined a second term and went back to practicing law. He died on February 15, 1895 in Salem, Oregon. ==Sources== * Oregon State Library * Klooster, Karl. Round the Roses II: More Past Portland Perspectives, pg. 107, 1992 ISBN 0-9619847-1-6 ==Other websites== * Oregon State Archives: Chadwick Administration -Photo, and link to Chadwick's 1878 Biennial message Category:Governors of Oregon Category:Democratic Party (United States) politicians Category:19th-century American politicians Category:1825 births Category:1895 deaths",
 "title": "Stephen F. Chadwick"
}