{
 "id": "840806",
 "text": "La Fayette Grover (b. November 29, 1823 – d. May 10, 1911) was a Democratic representative and senator from Oregon, USA. Grover was born in Bethel, Maine. He was educated at Bethel's Gould’s Academy and Brunswick's Bowdoin College. Studying law and passing the bar in Philadelphia in 1850, he moved to Oregon in 1851 and set up practice in Salem. The Oregon Territorial legislature elected him prosecuting attorney for Oregon second judicial district and auditor of public accounts for the Oregon Territory. From 1853 to 1855 he was elected to the territorial house of representatives. In 1854 he was appointed by the Department of the Interior to audit the claims out of the Rogue River Indian War. He then was appointed by the Secretary of War in 1856 to a board of commissioners to audit the Indian war expenses of Oregon and Washington. In 1857 he was a delegate to the Oregon constitution convention and upon admission of Oregon as a state was elected as a Democratic representative to the Thirty-fifth United States Congress serving from February 15, 1859, to March 3, 1859. He did not run for reelection in 1858, instead resuming his law practice and the manufacture of woolens. He was elected Governor of Oregon in 1871 and served until 1877 when he resigned, having been elected to the United States Senate. Grover served from March 4, 1877, to March 3, 1883 serving in the Forty-sixth United States Congress as the chairman of the Senate Committee on Manufactures. Not a candidate for reelection in 1883, instead he resumed the practice of law and retired from public life. Grover died in Portland, Oregon, on May 10, 1911 and was interned in Riverview Cemetery. ==Reference== *Bioguide entry Category:United States senators from Oregon Grover, La Fayette Category:United States representatives from Oregon Category:Democratic Party (United States) politicians Category:19th-century American politicians Category:1823 births Category:1911 deaths",
 "title": "La Fayette Grover"
}