{
 "id": "840849",
 "text": "Albin Walter Norblad, Sr., (March 18, 1881-April 17, 1960) was a prominent citizen of Astoria, Oregon and the Republican Governor of Oregon from 1929 to 1931. He was the father of Representative A. Walter Norblad (Albin Walter Norblad, Jr.), Member of the United States House of Representatives, from the 1st Congressional District of Oregon between 1946 and 1964. ==Family and early life== Norblad was born in Malmo, Sweden in 1881 to parents Peter and Bessie Youngsberg. The family's last name was changed by the Swedish Government to avoid confusion in military records. The family emigrated to the United States while Albin was very young, settling in Grand Rapids, Michigan. At age 12, Albin decided to support himself, mostly by means of odd jobs. He would later recount that the most notable jobs held during this time were newsboy, hot dog vendor, and clairinetist for the circuis. He managed to earn enough money to return to Grand Rapids, taking night classes at the Grand Rapids Business College. After earning enough credits there, Norblad was able enroll at the Chicago Law School, supporting himself as a reporter for the Chicago American newspaper's crime beat. Graduating in 1902, he quickly passed the bar exam and moved back to Michigan. ==Early political career== Once in Michigan, he set up a law firm, and was elected District Attorney for Delta County. While visiting Oregon on business in 1908, Norblad met with an old friend who invited him to live in Astoria. He accepted, and moved with his wife in 1909. He began practicing law, and became involved in the community. His first government office in Oregon was as Astoria's city attorney from 1910 to 1915. He would also become a member of the local school board, and President of the Astoria Chamber of Commerce. Outside of politics, Norblad was involved in many fraternal and civic organizations. With a prominent local political profile, Norblad went on to run for a seat in the Oregon State Senate, in 1918. Reelected in 1926, he attempted an abortive run for Oregon's At-large U.S. House seat in 1922. He was elected President of the Oregon State Senate in 1927, placing him as second in the state's then-official line of gubernatorial succession. ==Governorship== The death of sitting Governor Isaac Patterson on December 21, 1929 came as a shock to Oregonians. The governor had looked as he'd been recovering since contracting pneumonia late in his third term. Thus Senate President Albin Norblad was sworn promptly as governor. As soon as he was inaugurated, he declared his intent to run for the Republican gubernatorial nomination. Taking office during the Great Depression, Norblad's first attempts to improve conditions in the state were largely ineffective. Lacking a political identity statewide, and considered a Progressive by conserrvative elements in control of the state Republican party, Norblad was defeated in his primary bid in May 1930, coming in second-place. When the winner of the primary unexpectantly died a month later, Norblad took his name out of the running for the nomination, giving the Republican state central committee his blessing to choose a new candidate. Freed from having to contest an election, Norblad began focusing his attention on the economic situation in the state. He formed the state's first labor commission, later to become the modern Employment Department. In order to put men back to work, he authorized $2 million worth of road construction, and succeeded in employing 5,000 workers. The Oregon Coast Highway was begun under his leadership. Another $3 million was spent upgrading publicly-owned facilities around the state. The Governor also took a personal role in pardons and labor disputes. A Pardons Board was established, and Norblad even interviewed pardin-seeking inmates in- person. In matters involving the rest of the nation, Norblad accepted federal help in solving a long-simmering dispute between Eastern Oregon's cattle and sheep ranchers. The Governor indicated his support for the pending military draft legislation working its way through Congress. He also argued for the state's acquisition of federally-owned forest land. Defeated in his primary bid, Governor Norblad handed office to the victor of the 1931 gubernatorial election, independent candidate Julius L. Meier. ==Later life== Norblad went back to practicing law in Astoria, once again becoming closely involved in the community. He founded the Lower Columbia Association of Chambers of Commerce, and gained a $10,000 grant from the descendants of John Jacob Astor for use in the Astoria Centennial Celebration. Norblad continued his practice and civic activities in Astioria until his death on April 17, 1960. ==Sources== * Oregon State Library * ==Other websites== * Oregon State Archives: Norblad Administration -Photo, bio, records, and some public speeches of Governor A.W. Norblad. Category:Governors of Oregon Category:Republican Party (United States) politicians Category:20th-century American politicians Category:1881 births Category:1960 deaths",
 "title": "A. W. Norblad"
}