{
 "id": "840808",
 "text": "William Wallace Thayer (July 15, 1827 - October 15, 1899) was a Democratic politician active in U.S. states of Idaho and Oregon. Most notably, he was the sixth Governor of Oregon from 1878 to 1882 and Chief Justice of the Oregon Supreme Court from 1888 to 1889. ==Background== Thayer was born on a farm near Lima, New York on July 15, 1827. He received a public education before studying law in college. He was admitted to the New York State Bar in 1851. He then practiced law with his brother in Buffalo and later Tonawanda. A mining boom in Idaho Territory caught Thayer's attention in 1860, prompting him to move west. He arrived in Corvallis, Oregon in 1861, where he joined another brother, Andrew, at his law firm. In 1863, he would finally move to Idaho, setting up his own law firm in Lewiston. ==Political career in Idaho== In 1866, three years after moving to Lewiston, Thayer was elected District Attorney for the Third Judicial District of Idaho Territory. From 1866 until 1867, he moved to Boise to serve for a session of the Idaho Territory House of Representatives. He moved to Portland, Oregon shortly after leaving the legislature. ==Early political career in Oregon== Upon returning to Oregon, Thayer establuished a sucessful law firm in the city of East Portland. At this time, he became an active member of the Democratic Party. During the 1876 Hayes-Tilden Presidential Election dispute, Thayer was a member of the legal team which challened the certification of J. W. Watts, a Republican elector for Rutherford B. Hayes. Although sucessful, this challenge did not help Samuel Tilden prevail in the Electoral College. Still appreciative of his assistance in the Watts Case, the Oregon State Democratic Party nominmated Thayer for Governor in 1878. Thayer would win narrowly, by a margin of 59 votes. ==Governorship== Thayer's time in office is remembered as a fiscally conservative, anti-corruption administration, which sought to make the state bureaucracy more efficient. The State Board of Equalization, land law reforms, and the establishment of a State Mental Hospital were initiated under his leadership. He would completely eliminate the state's debt while in office. Governor Thayer was often spoke out about the state's finances. Highly critized by Thayer was how the State Legislature based its budget appropriations. He called for revenue projections to be based on actual revenues, not what was anticipated as the Legislature had often done in the past. He also refused to fund the completion of the State Capitol Building, stating that the building was too expensive and lavish for Oregon. His lasting legacy was reforming the Supreme Court of Oregon into its present incarnation by statute. Previously, Circuit Court judges served also as Justices of the Supreme Court. After the statue change, Supreme Court positions were made a seperate, directly-elected office. ==Chief Justice of the Oregon Supreme Court== Thayer declined to run for a second term in the 1882 gubernatorial election. Instead, he successfully ran a campaing for Justice of the Supreme Court in 1884. Justice Thayer remained on the bench until 1889, the last two years of that term serving as Chief Justice. Thayer died in Portland on October 15, 1899. ==Sources== * Oregon State Library * Klooster, Karl. Round the Roses II: More Past Portland Perspectives, pg. 107, 1992 ISBN 0-9619847-1-6 ==Other websites== * Oregon State Archives: Thayer Administration -Photo, and link to two of Thayer's Speeches. Category:1827 births Category:1899 deaths Category:Governors of Oregon Category:Democratic Party (United States) politicians Category:History of Idaho Category:19th- century American politicians",
 "title": "W. W. Thayer"
}