{
 "id": "840846",
 "text": "Ben W. Olcott (October 15, 1872 – March 3, 1952) was a Republican Governor of Oregon, USA. ==Early life== Olcott was born in Keithsburg, Illinois. He was educated at a Keithsburg elementary school and a business school in Dixon, later becoming a clerk in Chicago. In 1891, at age 19, he moved to Salem, Oregon, and became a roommate and good friend of Oswald West. West would become a major influence in the development of Olcott's political career. ==Adventurer and banker== For nearly 15 years, Olcott travelled throughout the Pacific Northwest, mostly in order to prospect for gold. Often this interrupted pursuits of other occupations, mostly in the field of banking. His trips would take him to Southern Oregon (1892-93 accompanied by Oswald West), back to Salem to become a bank teller (1893-1895), Northern Washington and British Columbia (1895-1897), and then back to Illinois for a career as a bank cashier. Olcott's sense of adventure prevailed again in 1904, leading him to Alaska. His journey ended notably when he drove a dog sled team to Nome, a trip of over 1,000 miles up the Yukon and Tanna Rivers in the height of winter. Settling in Fairbanks, Olcott found work as a gold dust teller, and later a bank branch manager. He managed to make a sizeable profit from gold prospecting, allowing him to move back to Oregon. ==Becomes a public figure== Olcott's good friend Oswald West had entered politics, heading the State Land Office. West offered Olcott a position in the Land Office, which he accepted in 1909. He became more interested in the political process, and was appointed by Governor Chamberlain to oversee the state's interest in a failed Portland bank, which held a large amount of state school funds. Although he was a Republican, and West was a Democrat, the two had a strong friendship which transcended politics. Olcott ran West's victorious 1910 gubernatorial campaign, and contributed $1,500 to his friend's effort. He married Lena Olcott (nee Hutton), Oswald West's sister-in law. In 1911, during Oswald West's Governorship, Secretary of State and former Governor Frank W. Benson, died of illness. Despite being from an opposing party, West appointed Olcott as Secretary of State to fill out the rest of Benson's term. Olcott would be elected in his own right to the office in 1912, and reelected in 1916. ==Governorship== On March 3, 1919, Governor James Withycombe died after serving only two months of his second term in office due to heart complications. Ben Olcott, as Secretary of State, assumed the Governorship under the state's gubernatorial line of sucession. Withycombe was so widely respected that Olcott refused to be sworn in until after the late Governor's funeral. Once in office, Governor Olcott continued Withycombe's road-building agenda. Today's policy of leaving a protected buffer of forested land around state highways was instituted under the Olcott Administration. Olcott Built upon Withycombe's defense and state safety policies. His administration managed to obtain U.S. Army air patrols for spotting forest fires. He proposed legislation banning the Japanese from holding land in Oregon. The growing power of the Ku Klux Klan in Oregon alarmed Governor Olcott, who did not hesitate to denounce the organization. He refused any Klan support for his 1922 gubernatorial campaign, jepordizing his nomination. Olcott narrowly won the Republican nomination, but lost the general election to the Klan- supported, Democratic Senate President Walter M. Pierce. ==Later life== After his electoral defeat, Olcott left Oregon to manage the Long Beach, California branch of the Bank of Italy. In 1924 he returned to Oregon to become a director of the Oregon Mutual Savings Bank in Portland. He died in Portland on July 21, 1952, and was buried in Salem. ==Sources== * Oregon State Library * Klooster, Karl. Round the Roses II: More Past Portland Perspectives, pg. 119, 1992 ISBN 0-9619847-1-6 ==Other websites== * Oregon State Archives: Olcott Administration -Photo and some public speeches of Governor Ben W. Olcott. Category:1872 births Category:1952 deaths Category:Governors of Oregon Category:Republican Party (United States) politicians Category:20th-century American politicians",
 "title": "Ben W. Olcott"
}