{
 "id": "840930",
 "text": "Hiroshi Mikitani (三木谷浩史, Mikitani Hiroshi) (was born March 11, 1965) is a Japanese business person and writer. He is the founder, chairman and CEO of Rakuten, Inc. He is also the president of Crimson Group, chairman of the football club Vissel Kobe, chairman of Tokyo Philharmonic Orchestra, and a board member of Lyft. == Early life == Mikitani was born in 1965 and grew up in Kobe, Hyōgo Prefecture, Japan. == Education == Mikitani earned a bachelor's degree in Commerce from Hitotsubashi University. == Career == Mikitani began his career at Industrial Bank of Japan with a break to attend Harvard Business School. He left to create his own consulting company, Crimson Group. Mikitani said that the destruction caused by the devastating 1995 Kobe earthquake made him realize he wanted to help revitalize Japan’s economy, so he quit banking and decided to start his own business. After an earthquake in Kobe caused enormous damage so that the area could no longer maintain the Vissel Kobe football club, Mikitani was asked to take over operations of the team. He purchased the team later that year through his company Crimson Group. Mikitani partnered with his friend FC Barcelona player Gerard Piqué to co-found Kosmos Holding. A company and investment group to invest in companies based in the sports, media, and entertainment industries. == Awards == Mikitani was awarded the Harvard Business School Alumni Achievement Award. He was also named to Prime Minister Shinzō Abe's Industrial Competitiveness Council. He was awarded the rank of Chevalier of the National Order of the Legion of Honour by the French government. He was also awarded the Order of Merit of the Grand Duchy of Luxembourghttps://web.archive.org/web/20171227051135/https://twitter.com/hmikitani_e/status/935003880437485568 and the 2017 Spain-Japan Business Contribution Award by the Spanish Chamber of Commerce. == Books == • Principles for Success (2007) • 92 Golden Rules of Success • Marketplace 3.0: Rewriting the Rules of Borderless Business (St. Martin's Press, 2013) • The Power to Compete: An Economist and an Entrepreneur on Revitalizing Japan in the Global Economy (with Ryoichi Mikitani, John Wiley & Sons, 2014) • Business-Do: The Way to Successful Leadership (John Wiley & Sons, 2018) ==References== Category:Japanese businesspeople Category:Living people Category:1965 births",
 "title": "Hiroshi Mikitani"
}