{
 "id": "841096",
 "text": "Julian Nagelsmann (born 23 July 1987) is a German professional football manager and former player who was formerly head coach of Bayern Munich. Known for his flexibility with formations, maintaining possession, and developing gegenpress, Nagelsmann is widely known as one of the best young managers in world football. ==Early life== Nagelsmann was born on 23 July 1987 in Landsberg am Lech, Bavaria. He played for FC Augsburg and 1860 Munich at youth level, and was the captain of Munich's U17 team. In the 2006–07 season, he was part of the second team but could not play a single match due to injuries. Nagelsmann returned to Augsburg for the 2007–08 season coached by Thomas Tuchel, but injured his knee and meniscus for the second time, damaging the cartilage. As a result, he decided to end his footballing career at the age of 20. He had already assisted his head coach Thomas Tuchel as a scout in the first half of 2008. He studied business administration in university for four semesters until he transferred to sports science. Then he focused on coaching, returning to his previous club 1860 Munich as an assistant to Alexander Schmidt for Munich's U17 team from 2008 to 2010. ==Coaching career== ===Early career=== Nagelsmann joined the 1899 Hoffenheim youth academy in 2010 and coached numerous youth teams in the following years. He was an assistant coach during Hoffenheim's 2012–13 season, and up until 11 February 2016, was coaching the club's U19 team. He coached Hoffenheim's U19 \"junior team\" to win the 2013–14 Under 19 Bundesliga title. During his time as assistant coach, goalkeeper Tim Wiese referred to Nagelsmann as \"Mini-Mourinho.\" ===1899 Hoffenheim=== Nagelsmann was appointed head coach of 1899 Hoffenheim on 27 October 2015. He was expected to begin his tenure at the start of the 2016–17 season. He was given a three-year contract. At the time of his appointment, Nagelsmann was 28, and the youngest coach in Bundesliga history. He was to be the successor for Huub Stevens, who had replaced Markus Gisdol the previous day. On 10 February 2016, Stevens resigned as head coach due to health problems, and Nagelsmann's term as head coach was introduced by the Hoffenheim board a day later. When Nagelsmann took over the club in February 2016, Hoffenheim were 17th in the table, 7 points from the safety of 15th spot and facing relegation. Under Nagelsmann they avoided relegation by winning 7 of their remaining 14 matches and finished a point above the relegation playoff spot. Their good form continued into the 2016–17 Bundesliga season, where they finished 4th in the table and qualified for the UEFA Champions League for the first time in their history. On 9 June 2017, Hoffenheim extended the contract of Nagelsmann until 2021. On 21 June 2018, Hoffenheim announced that Nagelsmann would be leaving the club at the end of the 2018–19 season. He oversaw his 100th league game as manager of Hoffenheim on 19 January 2019, in a 3–1 defeat to Bayern Munich. In doing so, he became the youngest ever Bundesliga manager to reach the 100–match mark. ===RB Leipzig=== On 21 June 2019, RB Leipzig announced that Nagelsmann would be their coach from the 2019–20 season and signed a four-year contract which would expire in 2023. Nagelsmann won his first Bundesliga match as RB Leipzig coach against FC Union Berlin 4–0, he also led Leipzig to a 1–1 draw against FC Bayern Munich. On match-day 10 Leipzig won against Mainz 8–0. Nagelsmann faced his former club Hoffenheim on match-day 14 and won 3–1 against them. On 10 March 2020, following Leipzig's 4–0 win against Tottenham Hotspur, Nagelsmann became the youngest coach in history to win a UEFA Champions League knockout tie. On 13 August 2020, RB Leipzig defeated Spanish side Atlético Madrid 2–1 in the quarter-finals, meaning Leipzig would progress to the Champions League semi- finals for the first time in their history. Nagelsmann became the youngest coach in history, therefore, to coach a side in the semi-finals. On 18 August 2020, RB Leipzig played against Paris Saint-Germain in the Champions League semi-finals, where Nagelsmann faced his former boss during his time at Augsburg, Thomas Tuchel. However, RB Leipzig lost 3–0 to Paris Saint-Germain. In the 2020–21 season, RB Leipzig finished second in the Bundesliga and lost the DFB-Pokal Final 4–1 against Borussia Dortmund. === Bayern Munich === On 27 April 2021, Bayern Munich appointed Nagelsmann as head coach on a five-year contract, effective from 1 July 2021, replacing Hansi Flick for a world record manager transfer fee of 25 million Euros. Nagelsmann's first match as Bayern coach was a 1–1 draw against Borussia Mönchengladbach in the Bundesliga. In Nagelsmann's first win as Bayern coach he won his first title as a coach in Bayern's 3-1 victory over Borussia Dortmund in the 2021 DFL-Supercup. On 24 August 2021, Nagelsmann led Bayern to a 12–0 victory against Bremer SV during the first round of the 2021–22 DFB-Pokal. The scoreline was their biggest win in 24 years, since their 16–1 victory against DJK Waldberg in the DFB Cup in August 1997. ==Managerial statistics== Managerial record by team and tenure Team From To Record 1899 Hoffenheim 11 February 2016 30 June 2019 RB Leipzig 1 July 2019 30 June 2021 Bayern Munich 1 July 2021 Present Total Total Total ==Honours== ===Manager=== RB Leipzig * DFB-Pokal runner-up: 2020–21 Bayern Munich * Bundesliga: 2021–22 * DFL-Supercup: 2021 Individual *VDV-Manager of the Season (Germany): 2016–17 *German Football Manager of the Year: 2017 *UEFA Men's Coach of the Year third place: 2019–20 ==References== ==Other websites== * Category:1987 births Category:Living people Category:German footballers Category:Association football defenders Category:German football managers Category:TSG 1899 Hoffenheim managers Category:RB Leipzig managers Category:Bundesliga managers Category:FC Bayern München managers",
 "title": "Julian Nagelsmann"
}