{
 "id": "841214",
 "text": "Daniel Robert Middleton (born 8 November 1991), better known online as DanTDM (formerly TheDiamondMinecart), is an English YouTuber, gamer, actor and author known for his video game commentaries. His online video channels have covered many video games including Minecraft, Roblox and Pokémon. == Personal life == In June 2013, when his channel got to 100,000 subscribers, he posted a video showing his face for the first time ever. Middleton married his girlfriend, Jemma, on 17 March 2013. They have a son, called Asher, who was born on 5 January 2020.They had another son, named Miles, who was born on 22 November 2022. On 6 September 2023, he posted on Twitter and Instagram of the death his dog, Ellie. Later posting a video on YouTube named \"goodbye ellie\". == Filmography == Film roles Year Title Role Notes 2018 Ralph Breaks the Internet Eboy Voice role; UK theatrical version DanTDM Presents The Contest Himself Interactive cinema event 2021 Free Guy Himself Television and web series roles Year Title Role Notes 2016 Skylanders Academy Cy Voice role; recurring 2017 DanTDM Creates A Big Scene Himself YouTube Original mini-series; 6 episodes Video game roles Year Title Role Notes 2016 Minecraft: Story Mode Himself Episode 6: \"A Portal to Mystery\" Other roles Year Title Role Notes 2016 DanTDM and Danni Tabor play Super Mario Maker 2! Himself TV commercial for Super Mario Maker 2 == Awards and nominations == * Guinness World Record for \"Most goals scored in a game of Rocket League for a team of 2\" (shared with Tom Cassell aka \"TheSyndicateProject\"). and \"Most goals scored in a game of Rocket League (team of three).\" * Guinness World Record for \"Most views for a dedicated Minecraft video channel\". * Nickelodeon Kids' Choice Awards in the category UK Favourite Tipster: 2015. and 2016. * Nickelodeon Kids' Choice Awards in the category UK Favourite Gamer 2020. == Books == * * ==References== ==Notes== == Other websites == * * * Official Twitter account Category:1991 births Category:Living people Category:British YouTubers Category:Twitch (service) streamers Category:Minecraft YouTubers",
 "title": "DanTDM"
}