{
 "id": "841538",
 "text": "Playing for Time is a made-for-television movie about the Holocaust. Arthur Miller wrote the movie. He based it on Fania Fénelon's true book about her life, called The Musicians of Auschwitz. The movie was on television on CBS in 1980. ==Story== At the Auschwitz death camp, the Nazis choose women who can sing and play instruments to make music for them. They become the Women's Orchestra of Auschwitz. The women see the things that happen in the camp and try to stay alive long enough for the war to end. ==Name== The title comes from the English expression \"playing for time\" which means to stall or delay something bad from happening and the word \"playing\" as in playing an instrument. The women in Playing for Time are playing music so that the Nazis won't kill them yet. ==Critical reception== Critics said the movie was \"the best script [Miller] has written in years.\" The movie won many Emmys, a Golden Globe and the Peabody Award. People did not like that directors chose Vanessa Redgrave to be Fania Fénelon. Redgrave did not like Israel and was pro- Palestine. Fénelon herself said that Redgrave was too tall and did not have a good sense of humor, which she said was one way she stayed alive in the camp. She wanted Liza Manelli instead of Redgrave. Other members of the women's orchestra said that not all of Fénelon's story was true: They said that Alma Rosé had not been as bad as Fénelon said. They said Fénelon's story made it look like she had saved their lives when really Rosé had saved their lives. Some of the women also said they did not like that very private moments in their lives were in a movie for everyone to see. ==Cast== *Vanessa Redgrave as Fania Fénelon *Jane Alexander as Alma Rosé *Marisa Berenson as Elzvieta *Christine Baranski as Olga *Shirley Knight Lagerführerin Maria Mandel *Vivica Lindfors as Frau Schmidt ==Adaptation== Arthur Miller also wrote a play Playing for Time, but it was after the movie, not before. ==Other websites== *Playing for Time on IMDB ==References== Category:Movies set in the 1940s Category:1980 movies Category:Movies based on books Category:American drama movies Category:Television movies Category:Holocaust movies Category:World War II movies Category:Movies directed by Daniel Mann",
 "title": "Playing for Time (movie)"
}