{
 "id": "841545",
 "text": "On 6 May 2021, a conflict began between Palestinian protesters and the Israeli police over a planned Supreme Court of Israel decision about the evictions of Palestinians in Sheikh Jarrah, a neighborhood of East Jerusalem. It lead Hamas to launch rockets onto Israeli cities. The clashes injured more than 300 people, mostly Palestinian civilians. ==Conflict== Protests began on 6 May in Sheikh Jarrah. On 8 May, crowds threw rocks at Israeli police and chanted \"Strike Tel Aviv\" and \"in blood, we will redeem al-Aqsa\". On 9 May, Israeli police stormed the al-Aqsa Mosque compound in response to stone-throwing Palestinian crowds. In response, on May 10, Hamas and the Islamic Jihad started firing rockets into Israel. Israel responded with airstrikes into Gaza. ==Victims== Since 10 May, 62 Palestinians were killed, including fourteen children, and 335 more were wounded. According to the Israel Defense Forces, at least fifteen of Palestinian casualties were Hamas members, and some were killed by Palestinian rockets. Israel reported that Palestinian rockets hit homes and a school, killing four Israeli civilians and an Indian citizen who lived in the country and injuring at least 70 Israeli civilians. ==Ceasefire== On 20 May 2021, Israel agreed a ceasefire agreement with Gaza militants after 250 deaths due to the conflict. The ceasefire came into effect the next day. ===Political instability=== The 2021 Palestinian legislative election for the Palestinian Legislative Council, originally scheduled for 22 May 2021, was indefinitely postponed on 29 April by President Mahmoud Abbas. Hamas, which was expected to do well in the elections, called the move a \"coup\", and some Palestinians believed Abbas had delayed the election to avoid political defeat for his party Fatah. Analysts say the postponement contributed towards the current crisis, and encouraged Hamas to resort to military confrontation rather than diplomatic tactics. Opinion pieces in NBC News, the Wall Street Journal and Foreign Policy argued that by taking responsibility for the rocket fire, Hamas had improved its standing among Palestinians wary of the delayed elections. ==References== Category:2021 in Israel Category:2021 riots Category:Attacks on buildings and structures in Asia Category:Attacks on buildings and structures in the 2020s Category:History of Palestine Category:Jerusalem Category:May 2021 events Category:Terrorist incidents in Asia in 2021",
 "title": "2021 Israel–Palestine crisis"
}