{
 "id": "841630",
 "text": "Mubeen Saudagar is an Indian stand-up comedian, actor and mimicry artist ==Early life and career== Mubeen Saudagar started his career on performing at various social and cultural events. and the sets of ae, he meet comedian and actor Johnny Lever. jhony Lever asked him to go for an audition. he then got selected and after performed in the shows Johnny Aala Re. Saudagar's comedy shows include Laughter Ke Phatke, Comedy Champions, Pehchan Kaun, Yeh Chanda Kanoon Hai, Comedy Circus, Comedy Classes and Comedy Nights Bachao. In 2017 he was dubbed for Sony Yay's series Sab jholmal hai, he was dubbed for Honey,Bunny,Zordaar,Popat and all male charecters in this Series ==Personal life== Mubeen Saudagar married Alsaba Saudagar at 2017. ==Filmography== ===Television=== ;Actor Year Title Role Notes Ref. 2006 Johnny Aala Re Standup Comedian Debut Television Show 2008 Comedy Champions Himself Main Role Hello Kaun? Pehchaan Kaun Constants Guest Appearance 2009 Yeh Chanda Kanoon Hai Navab Nagina Episodic Role 2012-2013 Comedy Circus ke Ajooba Stand Up Comedian Special Appearance 2013-2014 Comedy Circus Ke Mahabali Constants Team 2014 Comedy Classes Host Main Role 2015 Comedy Nights Bachao Comedy Dangal Jhalak Dikhla Jaa Special Performance Nach Baliye Fatichar Chacha Episodic Role 2017 Bittu Bak Bak 2017-2018 Entertainment Ki Raat Host Main Role Entertainment Ki Raat Season 2 2018 Comedy Circus Constants Special Appearances Dus Ka Dum Guest Appearance Bigg Boss Season 9, 10, 11 Special Appearance 2019-2021 Dr.Pran Lele Salman, Munna, Sunil, Mithun etc.(Various Voice Roles of Filmy heroes) Episodic Role 2019 Apna News Ayega 2020 Funhit Mein Jaari Uday Bhai/Babubali/Dr.Phalunke/Peon Special Appearances ;Voice- acting Year Title Role 2017-2018 Sab Jholmaal Hai Honey, Bunny, Zordaar, Popat and All Male Characters 2018-present Honey Bunny Ka Jholmaal 2020-present The Honey Bunny Show With Kapil Sharma Honey, Bunny, Zordaar, and Popat Oscar Ab Bus Kar Lallan, Babban, Jumman, Puttan, All Characters 2021-present Honey Fun A Tan Honey, Bunny, Zordaar, Popat and All Male Characters Bhalu Ye Bindaas Hai All Characters === Movies === ;Actor Release Year Movie Role 2010 Bhavnao Ko Samjho Inspector 2015 Dolly Ki Doli Ibrahim 2021 Radhe Fake Cop ;Voice Acting Release Year Movie Role 2017 Honey Bunny in Bank Robbery Honey, Bunny, Zordaar, Popat and All Male Characters Honey Bunny in Space Adventure 2018 Honey Bunny and plane Hijack Honey Bunny and Himalayan Car Rally Honey Bunny and Kung fu Challenge Honey Bunny as Super Team X Honey Bunny in Haunted House Honey Bunny in Crazy Crazy Chase Honey Bunny and Doggy's Day Out 2019 Honey Bunny The Secret Formula Honey Bunny as Super Team X Realoded Honey Bunny and Train Chase Honey Bunny Lost in Space Honey Bunny and The Pet Detactive Honey Bunny The Planet of Pig Aliens Honey Bunny Mission Dolphin Rescue Honey Bunny Gangs of Film city Honey Bunny and The Cricket Gang Honey Bunny in Crazy Family Adventure Honey Bunny in Egypt Adventure Honey Bunny in Police Petrol Honey Bunny in Ghost Palace Honey Bunny The Rock Stars 2020 Honey Bunny and the Super Race Car Honey Bunny in the Arabian Adventure Honey Bunny The Millionaires Honey Bunny in Space Football Honey Bunny in Rabbit Island Honey Bunny and the Masters of Disguise Super Team X End of the World Honey Bunny The Ghost Warriors Honey Bunny in Clownland Honey Bunny the Time Travellers Honey Bunny and the Mouse Trouble Honey Bunny and Magical Hat Honey Bunny Save The Panda Honey Bunny in the Interview Honey Bunny in the Treasure Hunt Honey Bunny in the Mystery of the Sylvian Castle Honey Bunny in the Jungle Adventures Honey Bunny In Dino Park Honey Bunny in The World Tour Challenge Honey Bunny The Real Superstars Honey Bunny and the Alien Spaceship ==Awards== Year Awards Category Result 2016 Bharat Icon Award Best Comedian rowspan=\"6\" 2017 Best Bar For Beer Dr.Babasaheb Ambedkar Novel Awards Best of Honor The Dancing Divas Best throbbing Performance 2018 Iconic Archivers Awards Best Comic Actor 2019 Indian Celebrity Awards Best Standup Comedian and Mimicry Artist ==References== ==Other websites== * Category:Indian comedians",
 "title": "Mubeen Saudagar"
}