{
 "id": "841762",
 "text": "Camp Lakebottom is a Canadian animated series produced by 9 Story Media Group that premiered on Teletoon in Canada on July 4, 2013 and on Disney XD in the United States on July 13, 2013. The series airs on Disney Channels worldwide (except Portugal, where it instead airs on Biggs and RTP2, and Southeast Asia), as well as ABC in Australia. By April 2014, Teletoon had renewed the show for a second season of another 26 episodes, which aired from 2015 to 2016. A third season began airing on July 3, 2017. The show aired its series finale on July 24, 2017. The series theme song was performed by Terry Tompkins and Scott McCord. ==Plot== Three 12-year-old kids, McGee, Gretchen and Squirt board are sent to the wrong summer camp bus and have all sorts of adventures in a camp called Camp Lakebottom, while trying to protect the camp from McGee's nemesis Jordan Buttsquat at Camp Sunny Smiles. ==Characters== * McGee (voiced by Scott McCord): Described as being a 12-year-old daredevil and mastermind, McGee is a thrill seeker whose curiosity often leads him to act before he thinks. He has an utter inability to recognize impending danger, combined with a habit of ignoring the counselors' warnings, and as a result constantly gets himself and his friends into trouble, but it is his eager mind which always gets them back out as well. This has led him to developing the catchphrase \"Should've thought that through.\" Out of all of the campers he is the most intrigued and tolerant of Camp Lakebottom, being fascinated by all of its potential sources of fun and adventure. He is a self-proclaimed master of pranks, as revealed in \"Pranks for Nothing\", but his pranks are actually quite lame. His nemesis is Buttsquat. * Gretchen (voiced by Melissa Altro): She is a girl who is described as being anything but \"sugary sweet\"; she is sardonic and indifferent about everything as well as a tomboy. Her lack of enthusiasm is made up with her sharp, critical tongue. With a black belt in karate, and an intolerance toward wrongdoing, Gretchen is not a girl to mess with. Her nemesis is Suzi. However underneath the tough exterior she has a huge heart, and secretly wishes she could be like any normal girl (though she would never ever reveal this). Her catchphrase is \"Ya think?!\" usually said to McGee when a plan has gone away and he points out the obvious. She is revealed to have a severe phobia of chipmunks in \"Cheeks of Dread\". Her dad calls her \"Gretchikins\" and her mom calls her \"Gretchywetchy\". Gretchen is nicknamed \"The Gretch\" and her parents have the surname Gritcherson. * Squirt (voiced by Darren Frost): McGee's best friend. A dimwitted simpleton in his own right, he is always cheerful, and a friend to all living things, even if they're trying to kill him. He has befriended just about every monster ever to set foot in Camp Lakebottom. While his omnibenevolence sometimes comes in handy in dealing with the monsters that constantly appear, his extreme lack of intelligence often makes him susceptible to control from several villains, the most prominent example being \"Mindsuckers From the Depths\" where an evil, giant leech attaches to his head and mind-controls him. In \"Late Afternoon of the Living Gitch\" it's revealed he has worn the same pair of underwear all his life. * Sawyer (voiced by Cliff Saunders): A lovable Zombie, with a multipurpose tool taking the place of his left hand, which is frequently a chainsaw. He is one of the camp's counselors, and the one who usually accompanies the kids on their adventures. As a zombie, his head and limbs constantly fall off, but can be reattached. He has distanced himself from the stereotype that zombies are mindless monsters who hunger for brains and has revealed that he has a heart (quite literally as he takes it out of his chest), he has vowed to look after the human campers, and often acts as a grandfatherly figure to them. He serves as the camp's handy man, and has constructed bizarre inventions over the course of the series, including a Frankenstein's Monster in \"Frankenfixer\". In \"Zombie Dearest\" Sawyer is revealed to have a zombie mother who acts like a stereotypical brain eating zombie, who Sawyer abandoned out of defiance to her habits. * Armand (voiced by Adrian Truss): A sasquatch with a passion for the performing arts, and dreams of becoming an actor. He is another one of the camp's counselors. While he is usually very kind, easygoing, and quite difficult to anger, the rare instances in which he has, have proven to be dangerous to everyone's safety. The episode \"Marshmallow Madness\" reveals that he has a severe addiction to marshmallows; he will be driven into an unstoppable, hunger-filled rage if he is ever close to the delicacies. * Rosebud (voiced by Jonathan Wilson): A short, bitter woman who resembles a serial killer with a German accent, who serves as the camp's cook and the final counselor. She takes pride in her cooking; however, her meals are not only inedible, but frequently threaten the lives of the campers. She is known to use whatever foul things she manages to find as ingredients in her meals. Squirt appears to be the only one who enjoys her cooking. She is the strictest counselor, and is least tolerant of McGee's antics, however underneath it all she means well. It was also revealed back in her younger days, Rosebud used to be an infamous monster hunter for S.M.A.C.K (Society of Monster Annihilation and Creature Kicking) but gave it up after her love for cooking when she met Sawyer and Armand when she was tasked for destroying all monsters in Lakebottom. * Jordan Buttsquat (voiced by Carter Hayden): Buttsquat is the spoiled-rich son of the owner of \"Camp Sunny Smiles\" (Lakebottom's rival camp) and McGee's nemesis. He serves as the main antagonist of the series, constantly going to Camp Lakebottom in attempt to wreck the rival camp, or to mock the Bottom Dwellers' poor living conditions by showing off some new, fancy, high-tech item available at his camp. However Buttsquat is severely lacking in the intellectual department and McGee is able to outsmart him every time, which will lead him to say the reoccurring catchphrase \"I will have revenge.\" McGee has saved Buttsquat's life on the many occasions his nemesis has been threatened by the various monsters, but he never displays gratitude afterwards. * Suzi (voiced by Bryn McAuley): McGee's older sister, who is a pageant queen, and became queen of \"Sunny Smiles\" on her first day. She is Gretchen's nemesis, who has held a grudge against her ever since she beat Gretchen in a beauty pageant contest. She has a crush on Buttsquat, and often accompanies him in his schemes to thwart Lakebottom. She always refers to McGee as \"Baby Bruv\", and while the two siblings sometimes bicker, they are usually shown to care for each other. Despite having less evil intent than Buttsquat, there are several occasions where she has posed as a far bigger threat and danger to everyone's safety, as she has a tendency to get entangled by one of the supernatural monsters or phenomena that have appeared. Examples of this include: \"Stage Fright\" where she uses stage bad luck and inadvertently summons an evil spirit which possesses her and nearly destroys Lake Bottom. Another example is \"28 Suzis Later\" where she is cloned by a mystical mud, causing the camp to be overrun by Suzi clones. * Slimey is a gigantic octopus like creature who lives in the lake, and the most frequent appearing reoccurring character in the series. While he terrified the campers on their first appearance by grabbing them and tossing them in the air, it's revealed he actually wants to play with them. He later becomes quite good friends with the campers, especially Squirt, and will often provide them with fun by tossing them into the air when they're swimming so that they can dive. He obeys any of the counselors, and will quite often aid the campers during their adventures involving the lake. Only his tentacles are shown, so it is unknown what his body looks like. ==Episodes== == References == ==Other websites== * * * Category:2017 Canadian television series endings Category:English-language television programs",
 "title": "Camp Lakebottom"
}