{
 "id": "841768",
 "text": "Whatever Happened to... Robot Jones? (simply known as Robot Jones or WHTRJ?) is an animated television series created by Greg Miller for Cartoon Network. == Premise == It follows Robot Jones, a teenage robot who attends the fictional suburban Polyneux Middle School in a retrofuturistic version of the 1980s. Episodes follow Robot Jones researching aspects of human life, including music, facial hair, and gym class. Jones is guided by his three friends, Socks, Mitch, and Cubey. Robot Jones is often smitten with his crush, Shannon Westerburg, a tall, young girl with orthodontic headgear and a prosthesis. In school, Robot Jones interacts with his teachers, Mr. McMcMc, Mr. Workout, and Mrs. Raincoat; the principal, Mr. Madman; and janitor Clancy Q. Sleepyjeans. His arch-rivals, Lenny and Denny Yogman, try to sabotage Jones's research by making school more difficult for him. == Characters == * Robot Jones (voiced by a text-to-speech program in season 1, Bobby Block in season 2 and season 1 reruns) * Timothy \"Socks\" Morton (voiced by Kyle Sullivan) * Mitch Davis (voiced by Gary LeRoi Gray) * Charles \"Cubey\" Cubinacle (voiced by Myles Jeffrey) * Shannon Westerburg (voiced by Grey DeLisle) * Lenny Yogman (voiced by Josh Peck) * Denny Yogman (voiced by Austin Stout) * Mom Unit (voiced by Grey DeLisle) * Dad Unit (voiced by a text-to- speech program) * Principal Madman (voiced by Jeff Bennett) * Mr. McMcMc (voiced by Rip Taylor) * Mr. Werkaut (voiced by Dee Bradley Baker) * Mrs. Raincoat (voiced by Grey DeLisle) * Clancy Q. Sleepyjeans (voiced by David Koechner) * Grampz Unit (voiced by a text-to-speech program) == Episodes == === Pilot (2000) === Title Directed by Written by Original release date \"Whatever Happened to Robot Jones?\" Greg Miller and Rob Renzetti Greg Miller June 14, 2000 Robot Jones is informed by his parents, Mom Unit and Dad Unit, that he has been put into a human public school that he must now attend. While in math class, he believes that the problems are too easy for him, which results in him getting sent to the principal's office for being condescending to the teacher. Later the same day as all of the school kids are eating lunch, Principal Madman trips on a wire which he later finds out is Robot's charger cable. After finding out it was Robot Jones, he gives him three months detention for tripping him, which angers Robot so much that he starts malfunctioning and firing lasers out of his eyes, setting the room on fire and scaring everyone away. Later, he rants about the humans in the hallway and almost gives up completely on them, until he develops a crush on a girl named Shannon because of her braces, which he designates as \"high metal content\". He then realizes that humans are not all that bad and that he needs to study them more. Note: This episode was later aired as the first segment along with \"Electric Boogaloo\" and \"The Groovesicle.\" === Season 1 (2002) === No. overall No. in season Title Directed by Written by Storyboard by Original release date Prod. code 1 1 \"P.U. to P.E.\" \\----\"Vacuum Friend\" Greg Miller Greg Miller Kevin Kaliher and Mike Stern July 17, 2002 102 \"P.U. to P.E.\": Robot Jones fears taking a shower in gym class because he thinks he will rust. \\----\"Vacuum Friend\": Robot Jones befriends a vacuum cleaner after thinking humans and robots cannot be friends. 2 2 \"Cube Wars\" \\----\"Sickness\" Greg Miller Greg Miller, Kevin Kaliher, and Mike Bell Kevin Kaliher and Mike Bell July 24, 2002 103 \"Cube Wars\": Everyone becomes obsessed with solving their Rubik's Revenge (called Wonder Cubes on the show), but Robot Jones' superior mind allows him to solve it almost instantly. The Yogmans sabotage Robot's cube, however, and he begins to malfunction. \\----\"Sickness\": The Yogmans prank Robot Jones by inserting a virus-filled floppy disk in Robot's disk drive, and he becomes very ill. 3 3 \"Parents\" \\----\"Embarrassment\" Greg Miller Greg Miller, Dave Smith, and Paul Tibbitt Dave Smith and Paul Tibbitt July 31, 2002 104 \"Parents\": Robot Jones must bring his parents to parent-teacher night at the middle school. When his parents embarrass him, Robot Jones attempts to manually override them to control their behavior, but fails. \\----\"Embarrassment\": Robot Jones wants to ask out Shannon to the Harvest Dance, but his nervousness causes his exhaust to malfunction whenever he gets near her. 4 4 \"Politics\" \\----\"Growth Spurts\" Greg Miller Greg Miller Kevin Kaliher and Mike Stern August 7, 2002 105 \"Politics\": Robot Jones runs for student council president. \\----\"Growth Spurts\": Robot Jones modifies himself to be tall enough to be on the basketball team. 5 5 \"Pilot\" \\----\"Electric Boogaloo\" \\----\"The Groovesicle\" Greg Miller and Rob Renzetti Greg Miller Greg Miller and Mike Stern August 14, 2002 101 \"Pilot\": Rerun of the pilot episode. \\----\"Electric Boogaloo\": Lenny and Denny Yogman try to trick Robot Jones into being his friend so they can steal his brain. \\----\"The Groovesicle\": Robot Jones and Socks watch an episode of \"The Groovesicle\", a music video TV series featuring a performance by a band called \"The Lavender Fudge Experience\". 6 6 \"Jealousy\" \\----\"Scantron Love\" Greg Miller Greg Miller, Clay Morrow and Walt Dohrn Clay Morrow and Walt Dohrn August 21, 2002 106 \"Jealousy\": Robot Jones feels jealousy towards an android named Finkman, who manages to make Shannon fall for him (as well as the rest of the school). \\----\"Scantron Love\": Robot befriends the school's Scantron machine in order to get the answers for his history tests, and soon passes out the answers to the rest of the students in class. === Season 2 (2003) === No. overall No. in season Title Animation direction by Written by Storyboard by Original release date Prod. code 7 1 \"Gender\" \\----\"Math Challenge\" Don Judge and Tom Yasumi Greg Miller, Kevin Kaliher, and Charlie Bean Kevin Kaliher and Charlie Bean October 1, 2003 201 \"Gender\": Robot Jones struggles to understand the differences between human boys and girls. \\----\"Math Challenge\": Mr. McMcMc challenges Robot Jones to a math competition to determine who is the smarter one of the two. Note: This is the first episode to use the voice actor Bobby Block to play Robot Jones. 8 2 \"Family Vacation\" \\----\"Hair\" Rich Collado and Dave Marshall Greg Miller, Clayton Morrow and Chuck Klein Clayton Morrow and Chuck Klein October 8, 2003 202 \"Family Vacation\": Socks goes on a spring break vacation together with Robot and his family, but Robot's parents have an unusual idea of what a vacation entails. Guest star: Randy Savage as the Biker. \\----\"Hair\": Seeing other boys in school with hair makes Robot want hair of his own to impress Shannon, but he must find a creative way to generate some on his metallic body. 9 3 \"Garage Band\" \\----\"Work\" Don Judge, Brian Sheesley, & Steve Socki Greg Miller, Brian Larsen, & Mike Stern Brian Larsen & Mike Stern October 15, 2003 204 \"Garage Band\": After witnessing girls at their school get excited for a garage band, Robot, Socks, Cubey, and Mitch decide to form a band of their own. But they focus more on being cool rather than actually practicing their instruments, which confuses Robot as to what being in band is about. \\----\"Work\": Robot Jones gets a job at JNZ to make extra money, but finds it increasingly difficult to stay awake juggling a job, school, and time at the arcade with friends. 10 4 \"The Yogmans Strike Back\" \\----\"Hookie 101\" Don Judge and Tom Yasumi Greg Miller, Charlie Bean, and Kevin Kaliher Charlie Bean and Kevin Kaliher October 22, 2003 206 \"The Yogmans Strike Back\": After another failed attempts to corner Robot, the Yogmans hypnotize Robot's friends and turn them into an amalgamation robot called the \"Yogstrosity\". \\----\"Hookie 101\": Robot, Socks, Cubey, and Mitch all play hookie. 11 5 \"House Party\" \\----\"School Newspaper\" Don Judge and Steve Socki Greg Miller, Clay Morrow and William Reiss Clay Morrow and William Reiss October 29, 2003 203 \"House Party\": Robot Jones throws a big party at his house while his parents are away, but worries about getting caught by Gramps Unit, who dislikes humans. \\----\"School Newspaper\": On Madman's order, Robot Jones gets a job for the school newspaper and ends up writing stories that embarrass the principal. 12 6 \"Safety Patrol\" \\----\"Popularity\" Rich Collado and Tom Yasumi Greg Miller, Mark O'Hare and Carl Greenblatt Mark O'Hare and Carl Greenblatt November 5, 2003 205 \"Safety Patrol\": When Robot Jones is put on the school's safety patrol, his programming for perfection causes him to go overboard with enforcing the rules. \\----\"Popularity\": Robot Jones sends a decoy version of himself to school so that he can attend a robotics expo, but the decoy ends up becoming popular with his classmates. 13 7 \"Summer Camp\" \\----\"Rules of Dating\" Brian Sheesley, Rich Collado and Steve Socki Greg Miller, Chris Reccardi & Paul Tibbitt Chris Reccardi and Paul Tibbitt November 12, 2003 207 \"Summer Camp\": Despite disliking the outdoors, Robot Jones tries to impress Shannon by showing off his nature skills at a summer camp. \\----\"Rules of Dating\": Robot attempts to impress Shannon, but his efforts are marred by restrictions enforced on him by the \"Laws of Robotics\". Category:2013 Canadian television series debuts Category:2016 Canadian television series endings Category:Canadian children's television series Category:English-language television programs Category:Science fiction television series Category:Nicktoons",
 "title": "Rocket Monkeys"
}