{
 "id": "84184",
 "text": "Benazir Bhutto (21 June 1953 – 27 December 2007) was a Pakistani politician who became the 11th and 13th prime minister of Pakistan. She served from 1988 to 1990 and then from 1993 to 1996. She made history as the first woman to lead a democratic government in a Muslim-majority country. She was Pakistan’s first female prime minister and till this date, the only female prime minister. Benazir Bhutto was a liberal and a secularist, and she played a significant role in the Pakistan People's Party (PPP) from the early 1980s until she was killed in 2007. == Life == Born in Karachi to a politically influential and wealthy family with Sindhi and Kurdish roots. Bhutto was the elder daughter of Zulfiqar Ali Bhutto and Nusrat Bhutto (née Ispahani). She studied at Harvard University and the University of Oxford. Her father, Zulfikar Bhutto, was a prominent leader of the PPP and served as prime minister. After her father's ousting and execution following a military coup in 1977, Benazir Bhutto, along with her mother Nusrat, took charge of the PPP and led the Movement for the Restoration of Democracy. She faced imprisonment under the military government of Muhammad Zia-ul-Haq and later chose self- exile in Britain in 1984. Bhutto was the first woman elected to lead a Muslim state. She was elected Prime Minister of Pakistan twice. She was sworn in for the first time in 1988 but removed from office 20 months later under orders of then-president Ghulam Ishaq Khan on a belief that she was corrupt. In 1993 Bhutto was re-elected but was again removed in 1996 on similar charges, this time by President Farooq Leghari. == Death == En route to a rally in Karachi on 18 October 2007, two explosions occurred shortly after Bhutto had landed and left Jinnah International Airport returning from her exile. She was not injured, but the explosions, later found to be a suicide-bomb attack that killed 139 people and injured at least 450. Two months after her assassination attempt, she was shot to death while getting into a vehicle to leave a political meeting for the Pakistan Peoples Party in Rawalpindi before detonating an explosive vest on December 27, 2007. She was 54 years old. The exploding kills 24 people and wounded 43 others. She is called Shaheed-e- Jamhuriat (Martyr of Democracy) by her fans. ==References== == Other websites == *The Official Website of Benazir Bhutto *Benazir Bhutto was Kurdish *Watch Benazir's videos and interviews *Benazir Bhutto becomes Prime Minister *Asif Zardari Profile *Bhutto cleared of corruption *Bhutto on Al-Qaeda *All About Benazir Bhutto *Musharraf blocks PPP rallies *Pakistan Peoples Party website *Pakistani opposition protests Bhutto case Category:Assassinated Pakistani politicians Category:People murdered in Pakistan Category:Prime ministers of Pakistan Category:1953 births Category:2007 deaths Category:Politicians from Karachi",
 "title": "Benazir Bhutto"
}