{
 "id": "841990",
 "text": "\"Blind Ambition\" is the 3rd episode of Family Guys 4th season. It was first broadcast on the Fox network on May 15, 2005. The episode was written by Steve Callaghan and Chuck Klein is the director of the episode. The episode is about Peter Griffin going blind after trying to get a world record. == Story == Mort Goldman gets popular for getting the highest possible score in bowling. Lois goes to the bowling alley and is shocked to see Glenn Quagmire watching her in a bathroom. Quagmire gets arrested but is freed by his neighbor Joe Swanson. Lois and other wives in her neighborhood want Quagmire taken away from the neighborhood. They later say they will let him stay if he stops harassing women. They help Quagmire control himself using operant conditioning (learning about the consequences of one's behaviors). They take Quagmire to a shopping mall. Quagmire sees cheerleaders in a fountain and starts to feel worried. He finds a room with video cameras of women in changing rooms. He sees a woman having a heart attack in one of the cameras. He runs to the woman and does CPR. Quagmire gets awarded for saving the woman from dying. Peter feels sad because his friends have had success, but he says he has not. He thinks he will be famous if he gets a world record for eating the most nickels. He tries to eat many nickels, but gets poisoned and goes blind. Peter gets a guide dog and goes to a bar. He ties the dog's leash to a homeless person thinking it is a parking meter. He goes to the bar and does not know it is burning. He saves the bartender from the fire and is called a hero by a news anchor. Peter gets new eyes from the homeless person he tied his guard dog to. == Production == Family Guy was first cancelled after its 3rd season. 5 scripts were made in 2001 for if Family Guy was brought back by the Fox network. \"Blind Ambition\" was made from one of the scripts. This is the second episode where Peter and Ernie the Giant Chicken get in a fight. This was supposed to be shown in the episode \"The Cleveland-Loretta Quagmire\". That episode was too long to show them fighting, so it was put in \"Blind Ambition\". Some parts of this episode were made but not broadcast. One of these was during Quagmire trying to control himself, where Brian Griffin uses a forklift to carry pornographic magazines away from Quagmire's house. Many people called David Goodman to say they did not like blind Peter seducing his son Chris thinking he is Lois. Chris Sheridan said that people were also not happy with Quagmire watching Lois in the bathroom. The Fox network can not use the words \"Jesus Christ\" if they are not talking about Jesus himself. One part of the episode shows God saying \"Jesus Christ!\" when he accidentally kills a person. Jesus was put in the episode with God so that the part of the episode can be broadcast. == Reception == The episode was seen by about 9.26 million people when it was first broadcast. Kevin Wong from PopMatters said that the episode was better than the 4th season's first two episodes. Mike Drucker from IGN thought that Peter and Ernie's fight was funny in the first episode they were in, but said it was not interesting this time. However, Drucker liked the reference to Star Wars at the end of the episode. == References == == Other websites == * Category:Family Guy (season 4) episodes Category:2005 television episodes",
 "title": "Blind Ambition"
}