{
 "id": "841962",
 "text": "Lisa Jayne Hammond (born 3 June 1978) is an English actress, known for her roles as Donna Yates in EastEnders and as Tina in Max and Paddy's Road to Nowhere. In 2005, she had a minor role in the BBC adaptation of Charles Dickens' Bleak House. In 2011, she appeared in the first series of Psychoville. She also appeared in 8 episodes of the British Crime Drama Vera, from 2015–2017. ==Career== She played the character Denny in Grange Hill between 1994–1996. Hammond did not star in any major roles again until 2004 when she played Tina in Max and Paddy's Road to Nowhere. However, she had minor appearances in television programmes such as Holby City, Where the Heart Is and Casualty, and in the film Quills. Hammond also played the major role of the herald in the Royal Shakespeare Company revival of Marat/Sade in 2011. In 2005, she played Harriet in the BBC TV mini series, Bleak House, whilst in 2009 and 2011 Hammond played Kerry in the first and second series of TV comedy Psychoville. In April 2015, Hammond appeared in detective television series, Vera, as Helen, a police intelligence officer. She left Vera in April 2017. In June 2015 Hammond appeared in BBC crime drama The Interceptor as a rental car salesperson. ===EastEnders=== On 19 March 2014, it was announced that the popular BBC long-running continuous drama EastEnders, had cast Hammond in the role of disabled market trader Donna Yates. The character of Donna was not originally going to be written into EastEnders as a disabled character, but Hammond impressed bosses at her audition, and was awarded the part. Donna is the second disabled regular in the soap, after Adam Best (David Proud) who left the show in 2010. Speaking of her casting, Hammond said: \"I'm really excited to join the cast of EastEnders. It's a great opportunity to be a part of such a big and popular show. Donna is a bit of a handful but they're always the most fun characters to play! It feels good to be bad!\" Donna's storylines have included: her fierce attitude, which often runs her into arguments; the introduction of her family; and a relationship with Fatboy (Ricky Norwood). Lisa decided to leave the soap in 2018 to pursue other roles. Her last appearance in EastEnders was on 20 July 2018, when Donna was seen leaving in the back of a black cab. ==Personal life== Hammond grew up with a restricted growth condition. She revealed in October 2015 that she has received abuse from strangers in the street because of her disability. She spoke about how her wheelchair use received backlash from the public. \"The main image of wheelchair users is that of paralysis. So when I get out of my chair to do a scene on my feet, people don't like it. If I'm feeling good and want to walk in that scene, I will. But if I can't or pain levels are bad then I'll use my chair. I've been shouted at. I've had people say, 'Oi, why are you in a chair when you were walking on EastEnders last night?'\" Hammond also revealed how she had received criticism like this before joining EastEnders and that she can struggle with this backlash. \"People always think I'm this feisty girl and I can hold my own but in those moments you just don't think of anything to say. It's shock and disbelief. I have to laugh it off.\" On 7 September 2017, she participated in the documentary series Who Do You Think You Are? and discovered that her maternal side originally came from Wales. ==References== ==Other websites== * Category:Living people Category:1978 births Category:English television actors",
 "title": "Lisa Hammond (actress)"
}