{
 "id": "842025",
 "text": "Luis Federico Salas-Guevara Schultz (4 September 1950 - 28 April 2021) was a Peruvian politician. He was the 49th Prime Minister of Peru in 2000, being the final prime minister of President Alberto Fujimori.Cormier, Bill (2000) \"Accusations fly in Peru after protests\", Daily News, July 29, 2000, p. 8A, retrieved 2011-06-27 He was Mayor of Huancavelica, and then Governor of Huancavelica Region from January 1, 2007, until December 31, 2010. Salas died on 28 April 2021 from COVID-19 at age 70. == Biography == Federico Salas was born in Lima on September 4, 1950. Son of Federico Salas Guevara Alarco and Edith Schultz Macchiavello. His childhood was spent in Huancavelica and later he traveled to Lima, doing his primary studies at the Inmaculado Corazón de María de Miraflores School and secondary studies at the Santa María Marianistas School. He married in the first nuptials with Lyriam Succar, with whom he had 4 children, and in the second nuptials with Rosario Serpa Masías with whom he had a daughter. After the death of his brother, he assumed the management of his assets until in 1973 his family's lands were exported by the agrarian reform. He returned to Lima to study administration at the Peruvian Institute of Business Administration (IPAE) and marketing at ESAN. In 1993 he created the Center for Research, Promotion and Development in support of Huancavelica. He ran for President of Peru in the 2000 elections under the Avancemos ticket but lost to President Alberto Fujimori. In an effort to reconcile with the opposition, President Alberto Fujimori, appointed Salas as Prime Minister. He served between 28 July to 21 November 2000 when Fujimori was ousted from power. He was Mayor of Huancavelica,Smith, William C. (2009) Latin American Democratic Transformations: Institutions, Actors, Processes, Wiley-Blackwell, , p. 346 and then Governor of Huancavelica Region from January 1, 2007, until December 31, 2010.World Statesmen - Regions of Peru. Retrieved 11 February 2012. Salas died on 28 April 2021 from COVID-19 at age 70.Falleció el ex primer ministro Federico Salas-Guevara ==References== Category:1950 births Category:2021 deaths Category:Prime ministers of Peru Category:Deaths from the COVID-19 pandemic in Peru Category:Huancavelica Region",
 "title": "Federico Salas"
}