{
 "id": "842085",
 "text": "The England national under-20 football team, also known as England Under-20s or England U20(s), are the under-20s of England. It is currently controlled by the FA. The team is coached by Lee Carsley. == Matches == === 2017–18 Under 20 Elite League === === 2018–19 Under 20 Elite League === ==Players== ===Current squad=== Players born between September 2000 and August 2001 are second-year graduates of the English academy system, players born between September 2000 and August 2001 are first-year graduates. Players born after 1 January 2002 remain eligible to play for England under-19s. The following players were named in the squad for a training camp in November 2020. Names in italics denote players who have been capped by England in a higher age group. ====Recent call-ups==== The following players have previously been called up to the England under-20 squad in the last 12 months and remain eligible. * Player withdrew from the squad before any games had been played. * Player withdrew from the squad due to a call-up to the under-21 team. == Tournament history == === FIFA U-20 World Cup === Year Round GP W D* L GS GA Squad 1977 Did not qualify 1979 Did not qualify 1981 Fourth place 6 2 2 2 9 7 Squad 1983 Did not qualify 1985 Group stage 3 0 1 2 2 5 Squad 1987 Did not qualify 1989 Did not qualify 1991 Group stage 3 0 2 1 3 4 Squad 1993 Third place 6 3 2 1 6 4 Squad 1995 Did not qualify 1997 Round of 16 4 3 0 1 9 3 Squad 1999 Group stage 3 0 0 3 0 4 Squad 2001 Did not qualify 2003 Group stage 3 0 1 2 0 2 Squad 2005 Did not qualify 2007 Did not qualify 2009 Group stage 3 0 1 2 1 6 Squad 2011 Round of 16 4 0 3 1 0 1 Squad 2013 Group stage 3 0 2 1 3 5 Squad 2015 Did not qualify 2017 Champions 7 6 1 0 12 3 Squad 2019 Did not qualify 2021 Qualified Total 11/22 45 14 15 16 45 44 == References == == Other websites == * Official FA England Under-20 website * FIFA U-20 World Cup website Category:Football in England Category:National sports teams of England Category:European national under-20 football teams",
 "title": "England national under-20 football team"
}