{
 "id": "842160",
 "text": "There is a body of water between the Japanese islands, Russia, North and South Korea. The countries affected have not been able to agree on a common name for this body of water. So far, most countries called it Sea of Japan. North and South Korea do not want this name, they suggested to call it East Sea, or East Sea of Korea. In 1992, both Koreas raised concerns about the name, at the Sixth United Nations Conference on the Standardization of Geographical Names. The Japanese government says that only the name \"Sea of Japan\" (日本海) should be used. South Korea supports the alternative name \"East Sea\" (Korean: 동해; Hanja: 東海). North Korea supports the name \"East Sea of Korea\" (Korean: 조선동해; Hanja: 朝鮮東海). Currently, most international maps and documents use either the name Sea of Japan (or a translation) by itself, or include both the name Sea of Japan and East Sea. Very often, the name East Sea is listed in parentheses or otherwise marked as an alternative. The International Hydrographic Organization is responsible for naming bodies of water around the world. In 2012, it decided it was still unable to change the 1953 version of its publication S-23 – Limits of Oceans and Seas, which includes only the single name \"Sea of Japan\", to include \"East Sea\" together with \"Sea of Japan\".\"IHO rejects Japan's proposal to rule out East Sea name\" , Yonhap News Agency, 26 April 2012. Retrieved 26 July 2013.\"IHO Puts Off East Sea Decision Until 2017\" , The Chosun Ilbo, 26 April 2012, Retrieved 26 July 2013. The countries have given different arguments, for their naming proposition, but each name has its problems: * All names can be found on different historical maps * The name \"East Sea\" has the problem that it would not be unique. There are several other bodies of water, which are also called East Sea. Examples are the Baltic Sea and the East China Sea, * The name Sea of Japan should be used, because the Japanese archipelago separates this sea from the Pacific Ocean. Also, Russia calls this body of water 'Japanese Sea' The International Hydrographic organisation made a resolution in 1974. In this resolution, it stated that in the case that the countries cannot agree on a common name for a body of water, all names should be accepted. However, Japan argues that the resolution only applies to the bays and straits which are shared by multiple countries, and in case of high seas such as the Sea of Japan, it is not applicable. Japan also cites the United Nations’ policy for using the Sea of Japan as an official name for their reasoning. == Maps == File:Matteo_Ricci_Far_East_1602_Larger.jpg|The Far East as depicted within the Kunyu Wanguo Quantu by Matteo Ricci in 1602. It calls the sea Sea of Japan. File:Delisle_-_Carte_d'Asie_(Compagnieland).jpg|A 1723 French map describing the sea as Mer de Corée (Sea of Korea). File:Chikyu_zenzu.JPG|A 1792 Japanese map \"Chikyu Zenzu\" drawn by Shiba Kōkan. The sea is described as \"Inland Sea of Japan\" (日本内海) and the Pacific Ocean is described as \"East Sea of Japan\" (日本東海). File:Mer_Orientale_1700.jpg|A 1700 French map describing the sea as Mer Orientale (Eastern Sea or Oriental Sea). File:South_Korea_map_- _en.png|left|South Korea refers to its surrounding waters as the East Sea, South Sea, and West Sea. File:East_Seas_in_East_Asia.png|The name \"East Sea\" is used to refer to several different seas in Eastern Eurasia. ==References== Category:Geography of South Korea Category:Geography of Japan Category:Seas of Russia Category:Geographical naming disputes",
 "title": "Sea of Japan naming dispute"
}