{
 "id": "842165",
 "text": "Jennifer Crystal Foley (born Jennifer Amie Crystal; January 26, 1973) is an American actress. She is best known for her roles as Christie Parker in Once and Again and Rachel Taub on House. == Personal life == Foley was born in Los Angeles, California, the daughter of Janice (née Goldfinger) and actor- comedian Billy Crystal. She has an older sister, producer Lindsay Crystal. In 1994, Foley graduated from Northwestern University. She married her college boyfriend, Michael Foley, in September 2000.Jennifer Crystal Foley: 'Mrs. Roger Maris' & more They have two daughters, born in 2003 and 2006. == Filmography == === Film === Year Title Role Notes 1994 City Slickers II: The Legend of Curly's Gold Jogger 1995 Girl in the Cadillac Holiday Inn Salesgirl 1995 Losing Isaiah Park Nanny 1995 The American President Maria 1995 Dracula: Dead and Loving It Nurse 1996 The Making of a Hollywood Madam Shanna Fleiss 1997 35 Miles from Normal Madeleine 1997 Fathers' Day Rose 1997 Don King: Only in America Hank's Secretary 2001 61* Pat Maris 2002 A Midsummer Night's Rave Lily 2003 They Would Love You in France 2007 Bee Movie Princess voice role 2009 Bride Wars Additional Voices 2012 Parental Guidance Cassandra 2015 The Hunger Games: Mockingjay – Part 2 ADR Cast 2017 Smurfs: The Lost Village Additional Voices 2018 Incredibles 2 2018 The Lie === Television === Year Title Role Notes 1989 Billy Crystal: Midnight Train to Moscow Helen Crystal Plays her father's mother at the end of the stand-up specialBilly Crystal, Still Foolin' 'em 1991 Sessions Jennifer Crystal Six-part mini-series 1993 Beverly Hills, 90210 Deborah 3 episodes 1995 ER Reba Episode: \"Home\" 1996 Space: Above and Beyond Nurse Larlee Episode: \"R & R\" 1997 Arli$$ Lisa Levine Episode: \"What Arliss Hath Joined Together\" 1997 NYPD Blue Marlene Blevins Episode: \"All's Well That Ends Well\" 1997 Jenny Female Customer Episode: \"A Girl's Gotta Live in the Real World\" 1997 Caroline in the City Kathy Episode: \"Caroline and the Used Car Salesman\" 1998 Cupid Kathy Episode: \"End of an Eros\" 1998 Beyond Belief: Fact or Fiction Penny Segment: \"Merry-Go-Round\" 2000–2001 Once and Again Christie Parker 17 episodes 2002 The Practice Kelly Goss Episode: \"M. Premie Unplugged\" 2002 Touched by an Angel Gail Episode: \"Hello, I Love You\" 2002 Providence Krista Episode: \"The Wedding Planner\" 2004 Century City Mrs. Lazak Episode: \"The Face was Familiar\" 2005 Inconceivable Mommy Shopper Episode: \"Face Your Demon Semen\" 2008–2012 House Rachel Taub 17 episodes 2009 Eureka Tabitha Episode: \"If You Build It...\" 2009 CSI: Crime Scene Investigation Jennifer Delaney Episode: \"Lover's Lane\" == References == == Other websites == * Category:1973 births Category:Living people Category:Actors from Los Angeles Category:American movie actors Category:American television actors",
 "title": "Jennifer Crystal Foley"
}