{
 "id": "842101",
 "text": "Chicken is the most common type of poultry around the world. It is prepared in a number of ways, including boiling, baking, frying, grilling. Prepared chicken became a staple food for fast food production in the second half of the 20th century CE. Chicken is more healthy than red meat. It has less cholesterol and saturated fat. Chicken meat was first eaten in Babylonia in 600 BCE. Chicken meat was one of the most commonly eaten meats available during the Middle Ages in Europe. In the United States in 1800s CE, chicken meat was more expensive than other meats. Chicken meat consumption in the United States increased during World War II, due to there not being enough beef and pork because it was fastly eaten by all people during the prolonged wars for survival then. In Europe, chicken meat was eaten more than that of beef and veal in 1996, because of the consumer awareness of the mad cow disease. Modern varieties of chicken, like the Cornish Cross and White Rock, are bred specifically for meat production. The most common breeds of chicken consumed in the United States are the White Rock and the Cornish Cross. Chickens raised mainly for food are called broilers. In the United States, broilers are usually butchered at a young age. == Edible parts of a chicken == ===main=== *Breast: These are white meat and are relatively dry. The breast has two segments which are sold together on bone-in breasts, but separated on boneless breasts: *# The \"breast\", when sold as boneless, and *# two \"tenderloin\", located on each side between the breast meat and the ribs. These are removed from boneless breasts and sold separately as tenderloins. *Leg: Comprises two segments: *# The \"drumstick\"; this is dark meat and is the lower part of the leg, *# the \"thigh\"; also dark meat, this is the upper part of the leg. *Wing: Often served as a light meal or bar food. Hot wings are a typical example. Comprises three segments: *# the front \"drumette\", shaped like a small drumstick, this is white meat, *# the middle \"flat\" segment, containing two bones, and *# the back \"tip\", often discarded. Chicken meat has two times as much polyunsaturated fat as most types of red meat when measured as weight percentage. ==Related pages== * List of chicken dishes ==References==",
 "title": "Chicken as food"
}