{
 "id": "842144",
 "text": "Perkele () is a swear word in Finnish that means evil spirit or a version of \"god damn\". It is popular, and is most likely the most known Finnish curse word in the world.How Finns Swear and What This Tells Us About Their CultureFinnish swearwords – a list of profanities you shouldn’t know ==Origins== The name is Indo-European. Perkwunos is the reconstructed name of the god of thunder. Other gods said to have the same origin include Perkūnas (Lithuania), Pērkons (Latvia), Percunis (Prussia), Piarun (Belarus), Peko or Pekolasõ (Estonia), Parjanya (India), Fairguneis (Gothic), and Perun or Piorun (Bosnia, Bulgaria, Croatia, the Czech Republic, Poland, Russia, Ukraine, Serbia, Slovakia and Slovenia). Some researchers think Perkele is an original name of the thunder god Ukko, the chief god of the Finnish pagan pantheon. There are related words in other Finnic languages. In Estonian, põrgu means hell and in Karelian, perkeleh means an evil spirit. ==Use== It has been used as a curse as a cry for the god for strength. It still is a common curse word in colloquial Finnish. Finnish people use the word to be more serious and powerful than less powerful curses. When the Research Institute for the Languages of Finland held a contest to nominate the \"most energizing\" word in the Finnish language, one of the suggestions was Perkele because \"it is the curse word that gave the most strength for the reconstruction of Finland after the wars.\" ==Introduction of Christianity== As Finland was Christianized, the old Finnish deities were said to be demons, so \"Devil\" was translated to \"Perkele\" for the Finnish translation of the Bible. Some later translations use paholainen (the evil one) instead. ==Uses in popular culture== * Many Finnish bands, such as Impaled Nazarene, Norther and Pepe Deluxe, use the word perkele to show Finnishness. A song by a Finnish metal band, Amorphis, titled \"Perkele (The God of Fire)\", is the sixth track on their album Eclipse. * There is a Swedish Oi! band called Perkele. They were formed in 1993 in Gothenburg and are currently signed to Oi! the Boat Records. * The webcomic Scandinavia and the World depicts Finland as having a bad state of mind, being violent and drunk and mostly saying nothing except he says \"perkele\" when things do not go his way. *In the 2019 video game Control, Ahti, a Finnish janitor who is also hinted to be an enormously powerful supernatural entity, says perkele when describing the weird events taking place in the Federal Bureau of Control. *The 2016 video game My Summer Car has a \"swear button\", allowing the player's character to say a handful of random exclamatory statements. One of them is perkele. Because the game takes place in 1990s Finland, many characters in the game's rural setting also say \"perkele\". Because of this, some of the game's English-speaking fans say perkele on forums talking about the game. ==References== Category:Profanity Category:Finnish language",
 "title": "Perkele"
}