{
 "id": "842389",
 "text": "Avneet Kaur (born 13 October 2001) is an Indian actress, dancer and model. She is known for portraying Princess Yasmine in Aladdin – Naam Toh Suna Hoga and Charumati in Chandra Nandini. ==Filmography== ===Television=== Year Title Role Ref. 2010 Dance India Dance Li'l Masters Contestant 2011 Dance Ke Superstars 2012 Jhalak Dikhhla Jaa 5 2011-2012 Meri Maa Jhilmil 2012 Tedhe Hain Par Tere Mere Hain Herself 2013 Savitri Young Damyanti Ek Mutthi Aasmaan Young Pakhi ZeeQ's Weekly Rap Herself 2014-2015 Hamari Sister Didi Khushi 2015 Twistwala Love Raina Mehra 2016 Crime Patrol Kajal 2017 Chandra Nandini Princess Charumati 2018-2020 Aladdin - Naam Toh Suna Hoga Sultana Yasmine 2019 Kitchen Champion Herself 2020 Kuch Smiles Ho Jayein... With Alia Yasmine ===Films=== Year Film Role Language Reference 2014 Mardaani Meera Hindi 2017 Qarib Qarib Singlle as a teenage girl at the clothing store 2018 Ekta as Young Ekta 2019 Mardaani 2 Meera 2023 Chidiakhana Mili Tiku Weds Sheru Tasleem \"Tiku\" Khan Luv Ki Arrange Marriage Ishiqa Completed ===Web Series=== Year Title Role Platform Notes 2018 Babbar Ka Tabbar Nikki Babbar Zee 5 2018 Babbar Ka Tabbar 2 Nikki Babbar Zee 5 2020 Bandish Bandits Appearance in song Chedkhaniyaan Amazon Prime ===Music Videos=== Year Title Co-star Singer Label Ref 2013 Labdiyaan Ayush Tandon Malaa Treon Times Music 2019 Tarse Ye Naina Rohan Mehra Anand Bajpai Zee Music Company Yaari Nikk Nikk Bang Music Pahadan Riyaz Aly Rajat Nagpal Desi Music Factory Mere Naina Karan Singh Arora, Mohit Chikkara Karan Singh Arora Hero Music Attachment Siddharth Nigam Ravneet Singh BonBros Records Teri Naar Nikk Nikk Bang Music Main Fir Nai Auna Nick Nannu Nick Nannu Lokdhun Taanashah Jagmeet Brar Jagmeet Brar Saga Music Kaali Meri Gaddi Mr. Faisu, Ramji Gulati Ramji Gulati United White Flag 2020 Daily Daily Riyaz Aly Neha Kakkar Desi Music Factory Luck Di Kasam Siddharth Nigam Ramji Gulati, Mack T-Series Saara Din Karan Singh Arora Karan Singh Arora, Avneet Kaur T-Series Chocolate Tony Kakkar and Riyaz Aly Tony Kakkar Desi Music Factory Badaami Rang Nikk Nikk Bang Music Ex Calling Rohanpreet Singh, Adil Khan Neha Kakkar, Rohanpreet Singh Desi Music Factory 2021 Faraar Akull Akull VYRL Originals Tera Hoon Na Arradhya Maan Nikhil D’Souza T-Series Tenu Ni Pata Guri Guri Geet MP3 Kinne Saalan Baad Rohan Mehra Goldie Sohel Desi Music Factory Dekhe Saare Khwaab Siddharth Gupta Ishaan Khan BLive Music == References == ==Other websites== Category:2001 births Category:Living people Category:Indian child actors Category:Indian actors Category:Indian dancers",
 "title": "Avneet Kaur"
}