{
 "id": "842319",
 "text": "The 2021 UEFA Champions League Final was the final match of the 2020–21 UEFA Champions League, the 66th season of Europe's premier club football tournament organised by UEFA, and the 29th season since it was renamed from the European Cup to the UEFA Champions League. It was played at the Estádio do Dragão in Porto, Portugal on 29 May 2021, between English clubs Manchester City, in their first European Cup final, and 2012 winners Chelsea. This was the third all-English final in the competition, after the 2008 and 2019 finals. The final was originally scheduled to be played at the Krestovsky Stadium in Saint Petersburg, Russia. However, due to the postponement and relocation of the 2020 final to Lisbon as a result of the COVID-19 pandemic in Europe, the final hosts were moved back a year, with the Atatürk Olympic Stadium in Istanbul, Turkey instead planning to host the 2021 final. On 7 May 2021, UEFA confirmed they would consider removing Istanbul as the host of the final due to the ongoing COVID-19 pandemic in Turkey. Two weeks before the final, UEFA announced that it would be relocated to Porto to allow a limited number of fans to attend the match. A capacity limit of 33% was agreed for the 50,000-seater Estádio do Dragão, resulting in an attendance of 14,110. Chelsea won the final 1–0 for their second UEFA Champions League title, with Kai Havertz scoring the only goal of the game late in the first half. As winners, they earned the right to play against the winners of the 2020–21 UEFA Europa League, Villarreal, in the 2021 UEFA Super Cup, and also qualified for the 2021 FIFA Club World Cup, both of which they won. ==Teams== In the following table, finals until 1992 were in the European Cup era, since 1993 were in the UEFA Champions League era. Team Previous final appearances (bold indicates winners) Manchester City None Chelsea 2 (2008, 2012) ==Venue== The match was the fourth European Cup/Champions League final to take place in Portugal, and the first to take place outside Lisbon, which previously hosted finals in 1967 at the Estádio Nacional and in 2014 and 2020 at the Estádio da Luz. This was the first time the European Cup/Champions League final took place in the same country in successive seasons. The Estádio do Dragão previously hosted matches at UEFA Euro 2004 and the 2019 UEFA Nations League Finals. Additionally, this final was the first since 2004 to be held in a stadium with capacity lower than 60,000. ===Initial host selection=== An open bidding process was launched on 22 September 2017 by UEFA to select the venues of the finals of the UEFA Champions League, UEFA Europa League, and UEFA Women's Champions League in 2020. Associations had until 31 October 2017 to express interest, and bid information must be submitted by 1 March 2018. Associations hosting matches at UEFA Euro 2020 were not allowed to bid for the 2020 UEFA Champions League final. UEFA announced on 3 November 2017 that two associations had expressed interest in hosting the 2020 UEFA Champions League final. Bidding associations for final Country Stadium City Capacity Notes Estádio da Luz Lisbon 65,647 Hosted the 2014 UEFA Champions League Final Atatürk Olympic Stadium Istanbul 76,092 Hosted the 2005 UEFA Champions League Final The Atatürk Olympic Stadium was selected by the UEFA Executive Committee during their meeting in Kyiv on 24 May 2018. On 17 June 2020, the UEFA Executive Committee announced that due to the postponement and relocation of the 2020 final to the Estádio da Luz, Istanbul would instead host the 2021 final. ===Relocation to Porto=== Due to the COVID-19 pandemic in Turkey, Premier League side Aston Villa offered to have Villa Park in Birmingham as the venue for the Champions League Final instead of Istanbul to hold 8,000 English fans, which could be affected by travel limitations. Villa Park has previously hosted the 1999 Cup Winners' Cup Final, the last final of that UEFA competition. It also hosted the 2012 FA Community Shield, also contested between Manchester City and Chelsea, due to Wembley Stadium – England's national stadium – hosting the Olympic football tournament finals in the previous days, being picked in part because of its equal distances between Manchester and London. On 7 May 2021, Secretary of State for Transport Grant Shapps advised against any fans traveling to Turkey for the game. In negotiations with the Department for Digital, Culture, Media and Sport, UEFA would only consider Wembley as a potential venue within the United Kingdom, and required guarantees that their officials, sponsors and journalists would be exempt from the UK COVID-19 travel restrictions. The British Government was unable to agree to this, and on 13 May 2021, UEFA announced the final was relocated to the Estádio do Dragão in Porto, Portugal, a country that was on the British \"green list\" for unrestricted travel during the pandemic. ==Background== Manchester City were playing in their first European Cup/UEFA Champions League final. They had previously played in one European final, the 1970 European Cup Winners' Cup Final, and won. They became the ninth English side to play in a European Cup/UEFA Champions League final. This was the third UEFA Champions League final for manager Pep Guardiola, and his first since the two wins with Barcelona in 2009 and 2011, both against Manchester United. City were seeking to become the first club to win its first European Cup/UEFA Champions League final since Borussia Dortmund in 1997, which seven clubs had failed to do in between. Chelsea were playing in their third European Cup/UEFA Champions League final, and the first since their win in 2012 away against Bayern Munich. In addition, they had previously played in the UEFA Cup Winners' Cup and UEFA Europa League finals twice each – winning all. In addition, Chelsea became the first club ever to see its men's and women's teams reach the Champions League final in the same season, having qualified for the 2021 UEFA Women's Champions League Final as well. Head coach Thomas Tuchel became the first manager to reach the European Cup/UEFA Champions League final in successive seasons with different clubs, having lost the 2020 final to Bayern Munich while coaching Paris Saint-Germain. This was the third all-English final in the history of the competition, after 2008 in Moscow between Chelsea and Manchester United and 2019 in Madrid between Liverpool and Tottenham Hotspur. This was also the third consecutive Champions League final to feature a first-time finalist, after Tottenham in 2019 and Paris Saint-Germain in 2020. This was the third meeting between the teams in Europe, having previously met in the semi-finals of the 1970–71 European Cup Winners' Cup, where Chelsea won both legs 1–0 en route to their first European trophy. It was also the second major cup final between them, after the 2019 EFL Cup Final, which City won on penalties following a goalless draw after extra time. The teams met twice during the season's Premier League, with each side winning away: City won the first match 3–1 at Stamford Bridge, while Chelsea won the second 2–1 at Etihad Stadium three weeks before the final. Three weeks before the second league encounter, Chelsea also beat City 1–0 in the FA Cup semi-finals, denying City the chance of winning an unrivaled quadruple. ==Road to the final== Note: In all results below, the score of the finalist is given first (H: home; A: away). Manchester City Round Chelsea Opponent Result Group stage Opponent Result Porto 3–1 (H) Matchday 1 Sevilla 0–0 (H) Marseille 3–0 (A) Matchday 2 Krasnodar 4–0 (A) Olympiacos 3–0 (H) Matchday 3 Rennes 3–0 (H) Olympiacos 1–0 (A) Matchday 4 Rennes 2–1 (A) Porto 0–0 (A) Matchday 5 Sevilla 4–0 (A) Marseille 3–0 (H) Matchday 6 Krasnodar 1–1 (H) Group C winners Final standings Group E winners Opponent Agg. 1st leg 2nd leg Knockout phase Opponent Agg. 1st leg 2nd leg Borussia Mönchengladbach 4–0 2–0 (A) 2–0 (H) Round of 16 Atlético Madrid 3–0 1–0 (A) 2–0 (H) Borussia Dortmund 4–2 2–1 (H) 2–1 (A) Quarter-finals Porto 2–1 2–0 (A) 0–1 (H) Paris Saint-Germain 4–1 2–1 (A) 2–0 (H) Semi-finals Real Madrid 3–1 1–1 (A) 2–0 (H) Notes ==Pre-match== ===Officials=== On 12 May 2021, UEFA named Spaniard Antonio Mateu Lahoz as the referee for the final. He was joined by six of his fellow countrymen, including assistant referees Pau Cebrián Devís and Roberto Díaz Pérez del Palomar. Carlos del Cerro Grande served as the fourth official, while Alejandro Hernández Hernández acted as the video assistant referee. Juan Martínez Munuera and Íñigo Prieto López de Cerain were appointed as assistant VAR officials, along with Polish referee Paweł Gil. ===Opening ceremony=== American DJ and electronic music producer Marshmello performed a virtual show for the opening ceremony before the match, along with Selena Gomez and Khalid. ===Details=== A \"home\" team was determined, for \"administrative purposes,\"Each of the two finalists is able to wear their first-choice colours. If, however, there is a clash of colours that necessitates a kit change from one club, then the club designated as \"the away side\" must use an alternative kit. In the actual 2021 final, both teams wore their first-choice colours. through a special draw held on 19 March 2021, after the quarter-final and semi-final draws. {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 31 Ederson RB 2 Kyle Walker CB 5 John Stones CB 3 Rúben Dias LB 11 Oleksandr Zinchenko CM 20 Bernardo Silva CM 8 İlkay Gündoğan CM 47 Phil Foden AM 17 Kevin De Bruyne (c) CF 26 Riyad Mahrez CF 7 Raheem Sterling Substitutes: Substitutes: Substitutes: GK 13 Zack Steffen GK 33 Scott Carson DF 6 Nathan Aké DF 14 Aymeric Laporte DF 22 Benjamin Mendy DF 27 João Cancelo DF 50 Eric García MF 16 Rodri MF 25 Fernandinho FW 9 Gabriel Jesus FW 10 Sergio Agüero FW 21 Ferran Torres Manager: Manager: Manager: Pep Guardiola Pep Guardiola Pep Guardiola Man of the Match: N'Golo Kanté (Chelsea) Assistant referees: Pau Cebrián Devís (Spain) Roberto Díaz Pérez del Palomar (Spain) Fourth official: Carlos del Cerro Grande (Spain) Video assistant referee: Alejandro Hernández Hernández (Spain) Assistant video assistant referees: Juan Martínez Munuera (Spain) Íñigo Prieto López de Cerain (Spain) Paweł Gil (Poland) Match rules *90 minutes *30 minutes of extra time if necessary *Penalty shoot-out if scores still level *Twelve named substitutes *Maximum of five substitutions, with a sixth allowed in extra time ===Statistics=== First half Statistic Manchester City Chelsea Goals scored 0 1 Total shots 3 5 Shots on target 1 2 Saves 1 1 Ball possession 53% 47% Corner kicks 1 1 Fouls committed 7 6 Offsides 1 2 Yellow cards 1 0 Red cards 0 0 Second half Statistic Manchester City Chelsea Goals scored 0 0 Total shots 4 3 Shots on target 0 0 Saves 0 0 Ball possession 64% 36% Corner kicks 2 0 Fouls committed 7 7 Offsides 0 1 Yellow cards 1 1 Red cards 0 0 Overall Statistic Manchester City Chelsea Goals scored 0 1 Total shots 7 8 Shots on target 1 2 Saves 1 1 Ball possession 58% 42% Corner kicks 3 1 Fouls committed 14 13 Offsides 1 3 Yellow cards 2 1 Red cards 0 0 ==Notes== ==References== ==Other websites== * Category:2020s in Portugal Category:2021 in Europe Category:2021 in association football Category:Football in Portugal Category:May 2021 events 2021",
 "title": "2021 UEFA Champions League final"
}