{
 "id": "842588",
 "text": "\"Break Up with Your Girlfriend, I'm Bored\" (written in all lowercase) is a song recorded by American singer Ariana Grande for her fifth studio album Thank U, Next (2019). The song was written by Grande , Savan Kotecha and Kandi Burruss alongside its producers Max Martin and Ilya Salmanzadeh, with Grande serving as a vocal producer. It contains an interpolation of the song \"It Makes Me Ill\" by American boy band NSYNC, written by Kandi Burruss, Kevin Briggs, thus both are also credited as songwriters. The song entered the Billboard Hot 100 at number two, while \"7 rings\" was at #1 and \"thank u, next\" was at #3; this made Grande the first solo artist to occupy the top three of the Hot 100 in the same week (and the first act overall since The Beatles). Grande has performed the song during her Coachella Festival set in April 2019 (with *NSYNC) and on her Sweetener World Tour. == Accolades == Year Organization Award Result Ref. 2020 iHeartRadio Music Awards Best Cover Song (Lana Del Rey) 2020 Hito Music Awards Best Western Song ==Track listing== * 7-inch vinyl – cassette # \"Break Up with Your Girlfriend, I'm Bored\" (explicit) – 3:10 # \"Break Up with Your Girlfriend, I'm Bored\" (edited) – 3:10 == Credits and personnel == Credits adapted from the album's liner notes. Recording * Recorded at MXM Studios (Los Angeles, California; Stockholm, Sweden) and Wolf Cousins Studios (Stockholm) * Mixed at MixStar Studios (Virginia Beach, Virginia) * Mastered at Sterling Sound (New York City, New York) Management * Published by Universal Music Corp./GrandAri Music (ASCAP), MXM — administered by Kobalt — (ASCAP), Wolf Cousins (STIM), Kandney Music/Air Control Music/EMI April Music and SheK 'Em Down Music/BMG * Contains a sample from \"It Makes Me Ill\", written by Kandi Burruss and Kevin Briggs, published by Kandney Music/Air Control Music/EMI April Music and SheK 'Em Down Music/BMG Personnel * Ariana Grande – vocals, songwriting, vocal producer * Max Martin – songwriting, producer, bass, drums, keyboards, programming * Ilya Salmanzadeh – songwriting, production, bass, drums, keyboards, programming * Savan Kotecha – songwriting * Kandi Burruss – songwriting * Kevin Briggs – songwriting * Sam Holland – engineer * Jeremy Lertola – assistant engineer * Cory Bice – assistant engineer * Serban Ghenea – mixing * John Hanes – mixing assistant * Randy Merrill – mastering ==Charts== ===Weekly charts=== Chart (2019) Peak position Argentina (Argentina Hot 100) 80 China Airplay/FL (Billboard) 50 Greece (IFPI) 1 Iceland (Tonlist) 1 Israel (Media Forest) 1 Latvia (LAIPA) 2 Lithuania (AGATA) 2 Lebanon (OLT20 Combined Chart) 1 Malaysia (RIM) 2 Romania (Airplay 100) 99 Singapore (RIAS) 2 US Rolling Stone Top 100 65 ===Monthly charts=== Chart (2019) Peak position Brazil Streaming (Pro-Música Brasil) 50 ===Year-end charts=== Chart (2019) Position Australia (ARIA) 44 Canada (Canadian Hot 100) 31 Denmark (Tracklisten) 83 Hungary (Single Top 40) 76 Hungary (Stream Top 40) 41 Ireland (IRMA) 30 Israel (Galgalatz) 24 Latvia (LAIPA) 63 New Zealand (Recorded Music NZ) 31 Portugal (AFP) 88 UK Singles (Official Charts Company) 33 US Billboard Hot 100 36 US Dance Club Songs (Billboard) 37 US Mainstream Top 40 (Billboard) 20 US Rhythmic (Billboard) 42 US Rolling Stone Top 100 29 ==Certifications== == Release history == Region Date Format Label Various February 8, 2019 Republic United States February 12, 2019 Contemporary hit radio May 31, 2019 == Related pages == * List of top 10 singles in 2019 (Australia) * List of number-one singles of 2019 (Ireland) * List of UK Singles Chart number ones of the 2010s * List of Billboard Hot 100 top-ten singles in 2019 ==References== Category:2019 songs Category:Ariana Grande songs Category:Trap songs Category:Pop songs Category:R&B; songs",
 "title": "Break Up with Your Girlfriend, I'm Bored"
}