{
 "id": "842667",
 "text": "Carleton Upham Carpenter, Jr. (July 10, 1926 - January 31, 2022) was an American actor, magician, songwriter, and novelist.International Motion Picture Almanac. New York: Quigley Publishing Co., 1986.David Ragan. 1992. Who's Who in Hollywood. The largest cast of international film personalities ever assembled. New York: Facts on File. Carpenter wrote material for Debbie Reynolds, Kaye Ballard, Marlene Dietrich and Hermione Gingold, and also scripts for films and television. Carpenter was a successful mystery novelist in the 1970s and 1980s. His books include Deadhead, Games Murderers Play, Cat Got Your Tongue?, Only Her Hairdresser Knew, Sleight of Deadly Hand, The Peabody Experience, and Stumped.\"Bennington's Carleton Carpenter: Actor, author and lion tamer\", timesargus.com; accessed January 31, 2016. Carpenter died in Warwick, New York on January 31, 2022, at the age of 95. ==Movies== Year Title Role 1949 Lost Boundaries Andy 1950 Father of the Bride Usher at wedding 1950 Three Little Words Dan Healy 1950 Summer Stock Artie 1950 Two Weeks With Love Billy Finlay 1951 Vengeance Valley Hewie 1951 The Whistle at Eaton Falls Eddie Talbot 1952 Fearless Fagan Pvt. Floyd Hilston 1952 Sky Full of Moon Harley 'Tumbleweeds' Williams 1953 Take the High Ground! Merton 'Tex' Tolliver 1959 Up Periscope Lt. Phil Carney 1970 Cauliflower Cupids Christopher 1971 Some of My Best Friends Are... Miss Untouchable 1981 The Prowler 1945 M.C 1983 The American Snitch Arthur ==References== ==Other websites== * Category:1926 births Category:2022 deaths Category:American movie actors Category:American television actors Category:American stage actors Category:American magicians Category:American dancers Category:American television writers Category:American songwriters Category:American screenwriters Category:American novelists Category:Writers from Vermont Category:Actors from Vermont Category:Bisexual people Category:LGBT dancers Category:LGBT actors Category:LGBT novelists Category:LGBT screenwriters Category:LGBT songwriters",
 "title": "Carleton Carpenter"
}