{
 "id": "842609",
 "text": "In South Africa some roads are designated as numbered routes to help with navigation. There is a nationwide numbering scheme consisting of national, provincial and regional routes, and within various urban areas there are schemes of metropolitan route numbering. ==Numbering== In the nationwide numbering scheme, routes are divided into a hierarchy of three categories: national routes, which are the most important routes connecting major cities; provincial routes, which connecting smaller cities and towns to the national route network; and regional routes, which connect smaller towns to the route network. Route numbers are allocated to these classes as follows: * National routes - N1 to N21 * Provincial routes - R21 to R99 * Regional parallel routes - R101 to R120 (A Regional parallel route will consist of road segments formerly part of the national route R1xy. Nxy that have been replaced by upgraded roads) * Regional routes in the former Cape Province: R300 to R499. * Regional routes in the former Transvaal Province: R500 to R599 * Regional routes in KwaZulu-Natal: R600 to R699 * Regional routes in the Free State: R700 to R799 These numbers are allocated by the Route Numbering and Road Traffic Signs Sub Committee within the Roads Co-ordinating Body, an organisation which contains representatives from road authorities in national, provincial and local government. In metropolitan numbering schemes the local authority can designate routes consisting of M followed by any number. The following metropolitan municipalities and their cities have metropolitan numbering schemes. * Buffalo City (East London) * City of Cape Town (Cape Town) * City of Johannesburg & Ekhuruleni (Johannesburg) including Krugersdorp which is in the West Rand * City of Tshwane (Pretoria) * Ethekwini (Durban) * Mangaung (Bloemfontein) * Nelson Mandela Bay (Port Elizabeth) * Pietermaritzburg-Hilton area (Pietermaritzburg) There are also a number of Ring Roads in South Africa found nationwide ==Lists of routes== *List of national routes in South Africa *List of provincial routes in South Africa *List of regional routes in South Africa **List of Regional Parallel Routes (South Africa) **List of Regional Routes in the former Cape Province (South Africa) **List of Regional Routes in the former Transvaal Province (South Africa) **List of Regional Routes in KwaZulu-Natal (South Africa) **List of Regional Routes in the Free State (South Africa) *List of Metropolitan Routes in South Africa **Metropolitan Routes in East London **Metropolitan Routes in Cape Town **Metropolitan Routes in Johannesburg **Metropolitan Routes in Pretoria **Metropolitan Routes in Durban **Metropolitan Routes in Bloemfontein **Metropolitan Routes in Port Elizabeth **Metropolitan Routes in Pietermaritzburg ==References== Category:Transport in South Africa",
 "title": "Numbered routes in South Africa"
}