{
 "id": "842648",
 "text": "In February 2021, the state of Texas had a major power crisis, because of three winter storms in the United States on February 10–11, 13–17, and 15–20. The crisis was caused by a massive electricity generation failure in the state of Texas; and caused shortages of water, food, and heat. ==Affected places== More than 4.5 million homes and businesses were left without power, some for several days. At least 151 people were killed. The total damage is estimated to be between $100 billion and $200 billion, making it as expensive as Hurricane Harvey and other major disasters. ==Causes== The Texas crisis's proximate causes were two unanticipated shocks induced from the sub-zero temperatures (‑2˚ F in Dallas): a failure of conventional (thermal) generating supply, mostly from lack of natural gas, and a surge in electricity demand. Inadequate winterization caused freezing of the gas supply and many plants' control instruments. In a system with a winter peak of 66 GW, about 30 GW of thermal plants were unavailable. In its worst-case extreme-winter analysis, ERCOT had expected a loss of 14 GW of thermal resources. The February storm caused more than double the anticipated thermal outages. Simultaneously, electric heaters created a powerful surge in demand. About 61% of Texans rely on electric heat, mostly low-efficiency resistance heat, in poorly insulated homes — a seemingly sensible choice in a warm climate with cheap electricity, where home heating is often unnecessary. The demand surge caused by the cold came to about 20 GW or one-third of the winter peak. ERCOT based its worst- case analysis on a 2011 winter storm, the most severe cold-weather event in Texas in twenty years. The 2021 storm was much worse than that of 2011. It created an unexpected and unsupportable demand surge. == Timeline of events == During the weekend of February 13-14, the temperature dropped more than what ERCOT estimated and as demand for electricity hit a record, the utility had to implement rolling power outages starting early morning Monday, February 15th. Temperatures in Texas averaged 30 degrees Fahrenheit lower than the normal during. On Tuesday, 16 GW of renewables went down, including generation from wind, and 30 GW was lost from thermal sources including coal, gas and nuclear. By Wednesday 46 GW of total electricity generation was offline with 28 GW of thermal and 18 GW of renewable. As the demand soared and regional power generators crashed, the frequency of the system also started to drop from the normal 60 Hz to 59.3 Hz. Had the system frequency’s fallen below 59 Hz, the state’s electrical system would have suffered from cascading blackouts which would have lasted for weeks or months and could have caused physical damage to equipment. This would have been much more difficult to recover so to protect the system, load was deliberately shed by the system operator. ==References== Category:February 2021 events Category:21st century in Houston Category:2021 in Texas",
 "title": "2021 Texas power crisis"
}