{
 "id": "842761",
 "text": "The \"Leva del Biberón\" (also known as the \"Quinta del Biberón \", baby bottle in Spanish) was the name given to the levies of 1938 and 1939 throughout the territory that republican Spain still controlled during the last years of the Spanish civil war. Mobilized by order of the President of the Second Spanish Republic, Manuel Azaña, at the end of April 1938. At that time, Franco's troops had attacked Lérida, Gandesa, Balaguer, Tremp and Camarasa and were taking control of the last points of republican resistance. In total, some 30,000 young people were called up, coming from all over the national territory on the Republican side: Murcia, Catalonia, Old Castilla and Valencia, among others. They were under the command of Lluís Companys, among whom would be counted future personalities such as Jesús Blasco. First, they had to cover auxiliary tasks, but on July 25, 1938, they were already participating in the Republican offensive of the Battle of the Ebro, the vast majority being minors, reaching, some as children, only 14 years old. It is believed that it received this name when Federica Montseny referred to all of them in this way: “Seventeen years old? but they still are sucking the baby bottle!».Esteve Molero Les quintes del biberó. El Prat de Llobregat: Rúbrica, 2000 They were in the bloody battles of Merengue and Baladredo, both at the Segre front during the so-called offensive of Catalonia. They also took part in the Battle of the Ebro Un pediatra surgido de la 'Quinta del biberón', Diario médico, 3 March of 2007 and some were assigned to the Alpine battalion, in the Lleida Pyrenees . After the war, very different fates ran. Some went into exile in France and ended up in the concentration camps of Argelès-Sur- Mer, Saint-Cyprien and Agda . Others, in the Francoist prisons and in the concentration camps of Vitoria and Miranda de Ebro and others went to battalions of workers distributed throughout Spain and did military service in Zaragoza, Barcelona and even in the Spanish Sahara. Another part of the young people was freed by the Franco regime in case of being captured since, as was normal throughout the conflict, most of the ideology of those called up was not reciprocal to the side that forced them to enlist under duress to a large extent. of the cases. In 1983, some 307 survivors and 412 relatives founded the «Agrupación de Supervivientes de la Leva del Biberón-41». == References == Category:1930s in Spain Category:1938",
 "title": "Leva del Biberón"
}