{
 "id": "842937",
 "text": "Humor about the September 11 attacks (9/11) was made later after the attacks happened. Scholars have made studies about how people used humor to deal with the attacks.Brottman, Mikita (February 12, 2012). What's So Funny About 9/11? , The Chronicle of Higher EducationEllis, Bill (June 6, 2002). Making a Big Apple Crumble: The Role of Humor in Constructing a Global Response to Disaster , New Directions in Folklore Researcher Bill Ellis found that jokes about 9/11 were starting to be made the day after the attacks. Giselinde Kuipers found jokes being made on websites a day later. In 2005, Kuipers found 850 jokes on the Internet about 9/11, Osama Bin Laden, and the War in Afghanistan. Comedian Gilbert Gottfried tried to make humor about 9/11 in a comedy roast. His crowd did not like it, with one saying \"Too soon!\"Holt, Jim (August 27, 2011). The Encyclopedia of 9/11: Humor , New York (magazine) The Onion (a humorous newspaper) did not publish their issue for September 11, 2001. They did not publish another issue until September 26, which was about 9/11. People who worked on it thought that it would be The Onions last issue to be printed. However, most of the people who read the issue thought it was good and funny. In 2002, comedian Joan Rivers tried to joke about firefighters in 9/11. The International Association of Fire Fighters hated the joke and said \"I am sorry that Ms. Rivers has chosen to find humor in our tragic and devastating loss.\" == In literature == In 2016, Comedian Billy Domineau made a spec script for Seinfeld, which ended in 1998. The script was set days after 9/11 in New York. Domineau said he started the script to show \"an exercise in bad taste\" to a student in a class. The script shows how the characters of Seinfeld would do after the attacks: Jerry thinks that dust from the destroyed towers is hurting his food. Elaine must keep dating a 9/11 survivor. George makes people believe that he is a first responder and Kramer tries to get a box cutter back from one of the terrorists. The Guardian said that the script perfectly shows how Seinfelds characters would deal with 9/11. == In movies and television == Jean Dujardin took out a joke about 9/11 in his movie The Players. He hoped that this would make the movie more likely to win an Oscar Award. The joke shows a man seducing a women in an apartment in New York. An airplane can be seen hitting the World Trade Center behind them. In The Simpsons episode \"Moonshine River\", Bart Simpson says to his father Homer that he would like New York better after two buildings he does not like have been destroyed. He then quickly says the old Penn Station and Shea Stadium. === In Family Guy === The Family Guy episode \"Back to the Pilot\" was first broadcast on November 2011. In the episode, Brian and Stewie Griffin time travel to the past. Brian tells himself in the past about 9/11. This makes him in the past stop the attacks and becomes known as a hero. However, this causes George W. Bush not to be elected as the President of the United States again. Bush starts a civil war that causes nuclear war. Brian and Stewie must go back to the past to stop the civil war. When they stop it from happening, they high five. Stewie says that it would look bad \"out of context\" (taking away the context to change its meaning). Time thought that the episode was made \"too soon\" but said \"Family Guy viewers live for 'too soon' moments, no matter how sensitive the material.\" Entertainment Weekly also thought that Family Guy had \"finally gone too far\" (go over a limit) and Deadline said that it went \"past the Fox standards and practices\". In the episode \"Back to the Woods\", Peter Griffin commits identity theft on James Woods. He goes to the Late Show with David Letterman pretending to be James Woods and talks about a movie that parodies 9/11. == In advertising == In 2016, Miracle Mattress (a mattress store in San Antonio) made a commercial with a 9/11 theme to sell mattresses. The commercial shows the store owner's daughter and two other men. In the commercial, she says \"What better way to remember 9/11 than with a Twin Towers sale?\" Two tall mattresses are behind the men to look similar to the twin towers. She says \"Right now you can get any size mattress for a twin price!\" The two men fall on the mattresses and make both of them fall. She screams and says \"We'll never forget\". The commercial made many people write angry messages to the store on their Facebook page. Mike Bonanno (the owner of the store) said that he did not know about the commercial until it was first shown to people. He made an apology on Facebook and closed the store down. Miracle Mattress was given negative reviews on Google and Yelp. The store opened again a week later. == On the internet == Many people have used internet memes to tell jokes about 9/11. Many memes joke about 9/11 conspiracy theories with phrases such as \"Bush did 9/11\" and \"jet fuel can't melt steel beams\". ==References== September 11 attacks Category:September 11 attacks",
 "title": "Humor based on the September 11 attacks"
}