{
 "id": "843016",
 "text": "Happy New Year (sometimes abbreviated as HNY) is a 2014 Indian Hindi-language action comedy film directed by Farah Khan and produced by Gauri Khan under the banner of Red Chillies Entertainment. The film features an ensemble cast of Shah Rukh Khan, Deepika Padukone, Abhishek Bachchan, Sonu Sood, Boman Irani, Vivaan Shah and Jackie Shroff. It was distributed worldwide by Yash Raj Films. The film marked the third collaboration of Khan with the director; they previously worked on Main Hoon Na (2004) and Om Shanti Om (2007), the latter of which also featured Padukone as the female lead. Happy New Year was released on October 24, 2014, during Diwali with dubbed versions in Tamil and Telugu and it was the biggest film release in India up until then. The film received mixed reviews and became a blockbuster grossing in India on its first day, setting the record for the highest first-day collection made by an Indian film to that point, and over worldwide, and it became the second highest- grossing Bollywood film of 2014 and among the highest-grossing Bollywood films of all time. ==Sypnopsis== A gang of amateur dancers takes part in a dancing competition to avenge their personal vendetta. == Cast == * Shah Rukh Khan as Chandramohan Manohar Sharma / \"Charlie\": Mohini's lover; Charan Grover's nemesis * Deepika Padukone as Mohini Joshi: Charlie's love interest; Vicky Grover's love interest * Abhishek Bachchan as Nandu Bhide / Vicky Grover charan's son (Dual role) * Sonu Sood as ex capt- Jagmohan Prakash Singh / \"Jag\": Rohan's Uncle * Boman Irani as Temhton Irani / \"Tammy\" Manohar's friend * Vivaan Shah as Rohan Singh, Jag's nephew * Jackie Shroff as Charan Grover, Vicky's father, the main antagonist. * Mohan Kapur as Charan's assistant * Varun Pruthi as Charan's assistant Sartaj Gill * Kavi Shastri as Mr. Gupta * Anupam Kher as Manohar Sharma, Charlie's late father (Cameo Appearance) * Daisy Irani as Namita Irani (Cameo Appearance) * Sarah-Jane Dias as Laila: India's ambassador at WDC (Cameo Appearance) * Dino Morea as Host of World Dance Championship (Cameo Appearance) * Kiku Sharda as Saroj Khan (Cameo Appearance) * Prabhu Deva as Dance Instructor (Cameo Appearance) * Malaika Arora Khan as the Heroine of a Film (Cameo Appearance) * Anurag Kashyap as Himself/Judge of World Dance Championship Auditions (Cameo Appearance) * Vishal Dadlani as Himself/Judge of World Dance Championship Auditions (Cameo Appearance) * Sajid Khan as Himself/Director of a Film (Special Appearance) * Geeta Kapoor as Herself/Judge of World Dance Championship (Cameo Appearance) * Jay J Jakkrit as Team Korea Leader ==References== Category:2014 action movies Category:2014 comedy movies Category:2010s Indian movies",
 "title": "Happy New Year (2014 movie)"
}