{
 "id": "843142",
 "text": "An electorate or electoral district () is a geographical constituency used for electing members (MPs) to the New Zealand Parliament. The size of electorates depends on that all electorates have about the same population. The 72 electorates are made up from 65 general and seven Māori electorates. The number of electorates increases with national population growth; the number was increased from 71 to 72 starting at the 2020 general election. ==List of electorates== Below is a list of current general and Māori electorates. === General electorates=== Electorate Region Namesake MP Party Auckland Banks Peninsula Banks Peninsula Bay of Plenty Bay of Plenty Botany Botany Downs Christchurch Central Christchurch Christchurch East Christchurch Coromandel Coromandel Peninsula Dunedin Dunedin East Coast Gisborne and Bay of Plenty East Coast East Coast Bays East Coast Bays Epsom Epsom Hamilton East Hamilton Hamilton West Hamilton Hutt South Hutt Valley Ilam Ilam Invercargill Invercargill Kaikōura Marlborough and Canterbury Kaikōura Kaipara ki Mahurangi Kaipara Harbour and Mahurangi Harbour Kelston Kelston Mana Mana Island Māngere Māngere Manurewa Manurewa Maungakiekie Maungakiekie / One Tree Hill Mt Albert Ōwairaka / Mount Albert Mt Roskill Puketāpapa (Mount Roskill) Napier Napier Nelson Nelson and Tasman Nelson New Lynn New Lynn New Plymouth New Plymouth North Shore North Shore Northcote Northcote Northland Northland Region Ōhāriu Ohariu Ōtaki Wellington and Manawatū-Whanganui Ōtaki River Pakuranga Pakuranga Palmerston North Palmerston North Panmure-Ōtāhuhu Panmure and Ōtāhuhu Papakura Papakura Port Waikato Auckland and Waikato Port Waikato Rangitata Rangitata River Rangitīkei Rangitīkei River Remutaka Remutaka Range Rongotai and the Chatham Islands Rongotai Rotorua Rotorua Selwyn Selwyn River Southland Southland and Otago Southland Region Taieri Taieri River Takanini Takanini Tāmaki Tamaki River Taranaki-King Country Taranaki and Waikato Taranaki region and King Country Taupō Lake Taupō Tauranga Tauranga Te Atatū Te Atatū Peninsula Tukituki Tukituki River Upper Harbour Upper Waitematā Harbour Waikato Waikato River Waimakariri Waimakariri River Wairarapa Wellington, Manawatū-Whanganui and Hawke's Bay Lake Wairarapa Waitaki Otago and Canterbury Waitaki River Wellington West Coast-Tasman West Coast and Tasman West Coast region and Tasman district Whanganui Manawatū-Whanganui and Taranaki Whanganui River Whangaparāoa Whangaparāoa Peninsula Whangārei Whangārei Wigram Wigram ===Māori electorates=== Electorate Region Namesake/translation MP Party Te Tai Tokerau Northland and Auckland \"northern district\" Māori Tāmaki Makaurau Auckland Auckland (Māori name) Māori Hauraki-Waikato Auckland and Waikato Hauraki Gulf and Waikato River Māori Waiariki Bay of Plenty and Waikato \"chiefly waters\" Māori Ikaroa-Rāwhiti Hawke's Bay, Gisborne, Manawatū- Whanganui and Wellington long (roa) eastern (rāwhiti) electorate of the North Island/Te Ika-a-Māui Te Tai Hauāuru Taranaki, Waikato, Manawatū-Whanganui and Wellington \"western district\" Māori Te Tai Tonga The South Island, Wellington and the Chatham Islands \"southern district\" Māori ==References==",
 "title": "New Zealand electorates"
}