{
 "id": "843148",
 "text": "Child poverty is when children are living in poverty and are children from poor families or orphans being raised with limited state resources. In developing countries, these standards are low and, when combined with the increased number of orphans, the effects are more extreme. (1989) Office of the United Nations High Commissioner for Human Rights == In highly-developed states == UNICEF made a study: According to this study, child poverty increased in 17 of the 24 OECD countries, between 1995 and 2005.UNICEF-Report: Child Poverty in Rich Countries 2005. (PDF; 222 kB). Innocenti Report Card, No. 6 Download am 20. Januar 2008. In the other seven countries it decreased. Six of the seven countries where it decreased had a high level of child poverty. The only exception to this is Norway, where child poverty has been decresing for a long time. The biggest increase was in Poland (+4.3%), Luxembourg (+4.1%) and the Czech Republic (also +4.1%). The biggest decrease was in England (-3.1%), the United States (-2.8%) and Norway (-1.8%). In these states, a child is defined as poor if the family income is less than a cetain percentage of the median income of a family for that county. == Absolute and relative poverty == Absolute poverty is the most severe form of povery. People in that category don't have enough money to conver the basic human needs, such as safe drinking water, sanitation, health, and shelter. == Problems == Children affected by poverty face a number of problems: * They often can't get an education * Health is expensive, they also suffer from teenage pregnancies ==Statistics== An estimated 385 million children live in extreme poverty. According to the UNICEF: * 663 million children, that is one in three children, live in poverty * Children from the poorest households die at twice the rate of their better-off peers * Children are more than twice as likely to live in poverty than adults * 385 million children live in extreme poverty, forced to survive on less than $1.90 a day ==References== Category:Poverty Category:Childhood Category:Socioeconomics",
 "title": "Child poverty"
}