{
 "id": "843290",
 "text": "The 2018–2019 Gaza border protests, by the organiser called the Great March of Return (), were a series of demonstrations held each Friday in the Gaza Strip near the Gaza-Israel border from 30 March 2018 and onwards. The protests demanded that the Palestinian refugees must be allowed to return to lands they were displaced from and was confiscated by Israel.David M. Halbfinger, Iyad Abuheweila, Jugal K.Patel '300 Meters in Gaza: Snipers, Burning Tires and a Contested Fence,' The New York Times 15 May 2018.’ Most Gazans are Palestinian refugees or their descendants, and marching on the fence highlights their desire to reclaim the lands and homes from which they were displaced 70 years ago in the war surrounding Israel's creation.’David M. Halbfinger & Iyad Abuheweila, \"One Dead Amid Violence in 3rd Week of Protests at Gaza-Israel Fence\" The New York Times, 13 April 2018. \"They are objecting to Israel's 11-year-old blockade of Gaza and seeking to revive international interest in Palestinian claims of a right of return to the lands they were displaced from in 1948.\"Khaled Abu Toameh, \"Hamas vows Gaza protests last until Palestinians return to all of Palestine\", The Times of Israel, 9 April 2018. \"The protests are an uprising for \"Jerusalem, Palestine, and the right of return\", he said, referring to the demand that Palestinian refugees and their descendants be allowed to return to their former homes in Israel.\"Adam Rasgon, \"Masses of Gazans head to border area for 'right of return' says organizer\" The Jerusalem Post, 28 March 2018. \"Masses of Palestinians are expected to come to the Gaza border on Friday and move into tents there for a planned six-week-long protest 'to demand the right of return to the homes and villages that they were expelled from in 1948'\", Ahmad Abu Ratima, an organizer of the protest, told The Jerusalem Post\". They also protested against Israel's Gaza blockade and United States recognition of Jerusalem as capital of Israel. ==References== Category:2010s in Israel Category:History of Palestine Category:2010s protests",
 "title": "2018–2019 Gaza border protests"
}