{
 "id": "843235",
 "text": "Manipuri women have been known for their valor, skill and active involvement in social, economic, political and cultural activities, besides holding almost all the household responsibilities as a mother, wife, daughter, sister and daughter in law.Role of Women in Manipur 1 Thomas Callan Hodson, the then British Political Agent of 1908 Manipur, quoted in his monograph, The Meitheis, as follows: > \"The women hold a high and free position in Manipur, all the integral trade > and exchange of the produce of the country being managed by them. The habit > of the country is to have bazars (markets) at convenient spots by the road > side, where a handful of women congregate at the early hour...!\" ==List== ===Leima Linthoingambi=== Leima Linthoingambi was the queen of king Ningthoukhomba (1432-1567) of Manipur. During the invasion of the Ankla tribes, the king had to proceed at the war field. At the King's absence in the capital city, the Tangkhul tribes raided the city. But in disguise as the king, the queen resisted their revolution by offering strong wine at the king's absence. With her wits, the kingdom was saved. This account is recorded in the Ningthourol Lambuba.The Role Of Manipuri Women In Administration Part 1 ===Kuranganayani=== Kuranganayani, originally known as Shija Phongalokpi, is the biological daughter of King Gaurishyam and the adoptive daughter of King Bhagyachandra. She was offered hand in marriage to the Ahom king to strengthen the relationship between the two kingdoms as well as to get military aid from the Ahoms for the Meiteis to resist the Burmese conquest of Manipur. But she turned out to be a heroine even in the Ahom kingdom. It was she who saved the Ahom kingdom from the hands of the Moamoriya revolts. ===Yairipok Thambalnu=== Thambalnu was a lady (Meitei Nupi) from a poor family in Yairipok town of Manipur. But her beauty and charm causes conflicts among many able men in the kingdom in her times. During flood times from the Imphal river in the kingdom, the Royal Oracle proclaimed that the water god Wangbren will be pleased if a young girl is offered to Him. Since Thambalnu became a problem for numerous men, she was chosen to be offered to the deity. So, she was forcibly (or voluntarily) put in sacrifice to the strong river flow. After her death, the flood was also gone. ===Maharani Kumudini=== Queen Kumudini was widowed when her son was at a ripe age. She devised many diplomatic relations and plots to protect the throne from the other family members of the royalty. When her son, Chandrakirti became the king, she was known as a popular feminine icon in the kingdom. ==Other websites== * The Role Of Manipuri Women In Administration Part 2 * The Role Of Manipuri Women In Administration Part 3 * Role of Women in Manipur 2 * Manipur A womans world By Ashwini Sunil * Manipuri women and their tolerance By Nganthoi Lourembam * Meitei Women in Collectives Gender Roles and Potentials Part 1 By Ningthoujam Irina * Meitei Women in Collectives Gender Roles and Potentials Part 2 By Ningthoujam Irina * Meitei Women in Collectives Gender Roles and Potentials Part 3 By Ningthoujam Irina * Patriarchy in Disguise The Role and Status of Women of Meitei society in Manipur Part 1 * Patriarchy in Disguise The Role and Status of Women of Meitei society in Manipur Part 2 * Ningol Chakouba Festival Giving respect to Girls and Women By Moirangthem Jiban * True Spirit Of Ningol Chakouba by Seram Neken * Manipuri Women A Complete Person By Seram Neken * Women in Manipur ==References== Category:History of Manipur",
 "title": "Women in the history of Manipur kingdom"
}