{
 "id": "843321",
 "text": "HIV (Human Immunodeficiency Virus), the virus caused by AIDS (Acquired Immunodeficiency Syndrome) and is one of the most serious public health challenges in the world. However, the world is committed to preventing new HIV infections and ensuring that everyone living with HIV has access to HIV treatment. In 2019, an estimated 170 million people worldwide are infected with HIV, since 2010, the number of new HIV infections fell by 23%. For example, in one year, this is different from the number of people diagnosed with HIV in one year. Worldwide, about 81 percent of people living with HIV know their HIV status in 2019. The remaining 19% (about 710 million people) still need access to HIV testing services. Important way HIV testing is the gateway to HIV prevention, treatment, care and support services. == HIV/AIDS pandemic by continent == === Africa === HIV/AIDS is a major concern epidemic in Africa and cause of death in many parts of Africa. Although the continent contains about 15.2% of the world's population, Sub-Saharan Africa accounts for about 69% of HIV patients, and 70% of all AIDS deaths in 2011. In the North African countries have the lowest prevalence rates, as their populations usually share cultural patterns that reduce the spread of the disease, in contrast to what the desert countries did in Africa. Southern Africa is the most affected region on the continent. As of 2011, HIV has infected at least 10% of the population in Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia and Zimbabwe. === Europe === AIDS cases in most countries in Western Europe have fallen to levels not seen since the initial outbreak; many people attribute this trend to active education campaigns, blood transfusion screening and increased condom use. In addition, since new AIDS treatments have proven to be effective (even if expensive) methods to suppress HIV, Western Europe’s AIDS mortality rate has also fallen very much in the past few years. There are many ways to transmit HIV, including paid sex, sex between men, injecting drugs, mother-to-child behavior, and heterosexual behavior. However, many new infections in this area have occurred through contact with HIV-infected people in other areas. The prevalence of adults (15-49 years old) in the region is 0.3%, and there are currently 570,000 to 890,000 HIV-infected persons. Due to the availability of antiretroviral therapy, the number of deaths from AIDS has remained low since the trough in the late 1990s. However, in some countries, there is still a large number of undiagnosed HIV, and the evidence of resistance to antiretroviral drugs in some newly infected people in the region is worrying. In addition, the risky behaviors of men who come into contact with men have recently increased. === Asia === As of 2008, 4.7 million people in Asia were infected with HIV. The United Nations believes that the epidemic in Asia peaked in the mid-1990s, and that the annual rate of HIV infection subsequently decreased by more than half. Regionally, the epidemic has remained fairly stable since the 2000s. === North America === In 2016, it was estimated that 1.5 million adults and children were infected with HIV / AIDS in North America, excluding Central America and the Caribbean. 70,000 adults and children are newly infected each year, with an adult prevalence rate of 0.5%. 26,000 people die of AIDS in North America each year. === South America === At the beginning of 2018, there are almost about 1 million people living with HI /AIDS in South America. By the number of its population, Brazil is the country with the most HIV-positive people with 830,000 people. As of April 2018, Chile is the country with the most infections. While the Falkland Islands are the only territory where no cases were detected. The biggest problem that exists is discrimination against people with HIV/AIDS in less developed countries. This is due to ignorance of the disease, with outdated premises and the high religious population by influenced to other people. === Oceania === In this region, the national conditions regarding HIV and AIDS vary greatly. Part of the reason is the distance between the major islands in Oceania. The extensive development of the region also plays an important role. It is estimated that the prevalence of between 0.2 to 0.7 percent, there are currently 45,000 to 120,000 adults and children living with HIV. Papua New Guinea is one of the worst AIDS epidemic in the region. According to UNAIDS, since 1997, HIV cases in the country at a rate of 30% per year, by the end of 2006, HIV prevalence in the country is about 1.3% from the population. Category:Epidemiology Category:HIV/AIDS",
 "title": "Epidemiology of HIV/AIDS"
}