{
 "id": "843359",
 "text": "Gengan Tonaki (渡名喜元完; Tonaki Gengan, 30 October 1884 – 24 January 1997) was a Japanese (Okinawan) farmer and supercentenarian, and at the time of his death at age 112 years, 86 days the oldest Japanese man ever (although the claimed 120-year-old Shigechiyo Izumi was believed to have been older) before being beaten by Denzo Ishizaki. Tonaki was born in late October 1884 in Sashiki (today Nanjō), Okinawa, as the second child and only boy of seven siblings, of whom one sister, who was eight years younger, was still living at the time of his death. In mid-1st decade of the 20th century, Tonaki fled to Hawaii to avoid the Russo-Japanese War and worked at a sugar refinery for about ten years before returning to Okinawa, working as a farmer until age 89. He married a woman named Kame (who was eight years younger and died at age 61 during the Battle of Okinawa) and had six children (of whom one died young of liver disease and four, all except his second son, died during the Battle of Okinawa). Tonaki became the oldest living man in Japan on 20 September 1991, after 108-year-old Gihei Oka's death and also the oldest living Japanese man overall, later on 16 February 1992 after the 109 years, 13 days old Russo- Japanese War veteran Mamoru Eto's death, as Eto who was just 4 days younger than Oka emigrated to the United States, and later on 30 October 1994 only the second Japanese man who became a supercentenarian, after Eiju Tsuru who died on 11 January 1990, just 24 days before his 111th birthday, although Shigechiyo Izumi who died on 21 February 1986 was still believed to have been aged 120 years, 237 days and Denzo Ishizaki claimed to have been ten days older than Tonaki, as his birth register which showed a birth year of 1886 rather than 1884 was claimed to have been delayed by two years. After 111-year-old Frenchman Émile Fourcade's death on 29 December 1995, Tonaki became the last living man born in 1884 as well as the second-oldest living man behind Danish-born Americanman Christian Mortensen, although Americanman Johnson Parks has been verified to have been 15 days older than Tonaki but recently become disputed after a study proving that he may have been born around ten years later than he claimed. == References == Category:1884 births Category:1997 deaths Category:Japanese supercentenarians Category:People from Okinawa Prefecture",
 "title": "Gengan Tonaki"
}