{
 "id": "843577",
 "text": "Alia Martine Shawkat ( ; ; born April 18, 1989) is an American actress and artist. She is known for her roles as Hannah Rayburn in State of Grace, Maeby Fünke in the Fox/Netflix sitcom Arrested Development, Gertie Michaels in the 2015 comedy-horror movie The Final Girls, and Dory Sief in the TBS and HBO Max comedy series Search Party. She has also been on Comedy Central's Drunk History as Frances Cleveland, Virginia Hall, and Alexander Hamilton. ==Biography== Shawkat was born in Riverside, California, to Dina Shawkat (née Burke) and movie producer Tony Shawkat. She grew up in Palm Springs. She has two brothers. Her father is from Iraq, and her mother is of Norwegian, Irish, and Italian descent. Her maternal grandfather was actor Paul Burke. ==Career== Shawkat has appeared in over 47 movie roles, 32 television roles and 1 role in a podcast. ==Personal life== When not acting, Shawkat likes to paint; she has participated in gallery shows in Los Angeles, Mexico City and Paris. She also likes to make music and sing in jazz bars. She is bisexual. Her most notable features are her dark curly hair, brown eyes, dimples and her freckles. ==Filmography== ===Movies=== Year Title Role Notes 1999 Three Kings Amir's Daughter 2005 Rebound Amy Queen of Cactus Cove Billie Short movie 2006 Deck the Halls Madison Finch 2008 Bart Got a Room Camille Prom Wars Diana Riggs 2009 Amreeka Salma Halaby Whip It Pash Amini 2010 The Runaways Robin Robbins 2011 The Lie Seven Cedar Rapids Bree The Oranges Vanessa Walling Our Deal Night Creeper Short movie 2012 Damsels in Distress Mad Madge That's What She Said Clementine Ruby Sparks Mabel The Brass Teapot Louise The Golden Age Janice Short movie 2013 May in the Summer Dalia The End of Love Alia Shawkat Cameo Setup, Punch Dottie Kaufman Short movie The To Do List Fiona Forster Bunion Rachel Short movie Night Moves Surprise The Moment Jessie Jamil 2014 Life After Beth Roz Wild Canaries Jean 2015 The Final Girls Gertie Michaels The Driftless Area Carrie Nasty Baby Wendy Adam Green's Aladdin Emily Green Room Sam Me Him Her Laura 2016 The Intervention Lola Pee-wee's Big Holiday Bella Paint It Black Josie 20th Century Women Trish 2017 Izzy Gets the F*ck Across Town Agatha Benson 2018 Blaze Sybil Rosen Duck Butter Naima Also writer 2019 Animals Tyler First Cow Woman with Dog I Lost My Body Gabrielle (voice) English dub Alina Alina Short movie 2020 The Letter Room Rosita Short movie 2021 Love Spreads Kelly Post-production TBA Being the Ricardos Madelyn Pugh Filming ===Television=== Year Title Role Notes 1999 JAG Young Sarah MacKenzie Episode: \"Second Sight\" 2000 The Trial of Old Drum Dee TV movie 2002 State of Grace Young Hannah Rayburn Main cast; 40 episodes Presidio Med Tara Wegman Episode: \"Good Question\" 2003 Without a Trace Siobhan Arintero Episode: \"Maple Street\" Boomtown Denise Stein Episode: \"Home Invasion\" 2003–06; 2013; 2018–19 Arrested Development Mae \"Maeby\" Fünke Main cast; 79 episodes 2006 Veronica Mars Stacy Wells Episode: \"The Rapes of Graff\" Not Like Everyone Else Brandi Blackbear TV movie 2007 The Business Screenwriting Manicurist 2 episodes 2008 The Bad Mother's Handbook Charlotte TV movie The Starter Wife Robin 3 episodes 2010 The League April Episode: \"The Expert Witness\" 2013 NTSF:SD:SUV:: Gail Episode: \"Burn After Killing\" 2014 Drunk History Frances Cleveland Episode: \"First Ladies\" Robot Chicken Minerva McGonagall (voice) Episode: \"G.I. Jogurt\" Getting On Colleen Hoover 4 episodes 2015 Adventure Time Betsy Poundcake (voice) Episode: \"The Diary\" Broad City Adele Episode: \"Coat Check\" Drunk History Virginia Hall Episode: \"Spies\" 2016 Portlandia Mayor's Kid Episode: \"Shville\" Animals. Sharon (voice) Episode: \"Rats.\" 2016–17 Adventure Time Charlie (voice) 2 episodes 2016–present Search Party Dory Sief Main cast; 40 episodes 2016 Drunk History Alexander Hamilton Episode: \"Hamilton\" 2017–19 Transparent Lila 8 episodes 2017–20 Big Mouth Roland (voice) 3 episodes 2018–20 Summer Camp Island Blanche/Cinnamon Raisin Toast/Butter Goth (voice) 11 episodes 2019 Living with Yourself Maia 2 episodes 2020 The Shivering Truth (voice) Episode: \"Nesslessness\" Moonbase 8 Alix Episode: \"Visitors\" 2021 The Old Man Hey Angela Upcoming series, main cast 2021 Pride played Madeleine Tress in first episode on FX. ===Podcasts=== Year Title Role Notes 2018 Sandra Helen Perera (voice) Main role, 7 episodes == References == Category:1989 births Category:Living people Category:Actors from Riverside County, California Category:People from Riverside, California",
 "title": "Alia Shawkat"
}