{
 "id": "843521",
 "text": "Amy Elizabeth Fisher (born August 21, 1974) is an American woman. She became known in the media as the Long Island Lolita in 1992. That year, at age seventeen, she shot Mary Jo Buttafuoco, the wife of Joey Buttafuoco. She was originally charged with attempted murder. Fisher later pleaded guilty to first-degree aggravated assault. She was in prison for just under seven years. In 1999, she was paroled. Fisher later became a writer, webcam model and a pornographic actress. Fisher became very jealous of Joey Buttafuoco's wife. Fisher then got a .25 caliber handgun. When the wife answered the door, Fisher told her that Joey Buttafuoco was having an affair with Fisher's (imaginary) younger sister. The conversation lasted 15 minutes. Mary Jo got angry. She then told Fisher to leave and turned her back to return to the house. That was when Fisher took out the gun, struck Mary Jo with it and shot her in the head. Fisher dropped the gun and the shirt. She came back for them. The police interviewed Joey Buttafuoco. He told them Amy Fisher could be the shooter. When his wife, Mary Jo became conscious, she identified Fisher as the shooter. Amy Fisher was born in Merrick, New York. ==Books and films== ;Books by Amy Fisher * Fisher, Amy & Robbie Woliver (2004). If I Knew Then. iUniverse. . * Fisher, Amy with Sheila Weller (1994). Amy Fisher: My Story. (Reprint edition.) . (Originally published by Pocket Books in 1993; .) ;Books about Amy Fisher * Dominguez, Pier (2001). Amy Fisher: Anatomy of a Scandal: The Myth, the Media and the Truth Behind the Long Island Lolita Story. Writers Club Press. . * Eftimiades, Maria (1992). Lethal Lolita: A True Story of Sex, Scandal and Deadly Obsession. St. Martin's Press. . ;Movies about Amy Fisher * Amy Fisher: My Story, 1992 (TV) Noelle Parker starred as Fisher. * Casualties of Love: The \"Long Island Lolita\" Story, 1993 (TV) Alyssa Milano starred as Fisher. * The Amy Fisher Story, 1993 (TV) Drew Barrymore starred as Fisher. According to Alan Ball, Fisher's story was an inspiration to him in writing the script for the 1999 film American Beauty. ==References== Category:Writers from New York (state) Category:Criminals from New York (state) Category:American pornographic actors Category:American people convicted of assault Category:Actors from New York (state) Category:1974 births Category:Living people",
 "title": "Amy Fisher"
}