{
 "id": "843712",
 "text": "Portrait of Adele Bloch-Bauer I, The Woman in Gold, or The Lady in Gold is a painting by Gustav Klimt of Adele Bloch-Bauer, a woman who lived in Vienna. He painted the painting in 1907. ==Influences== Klimt was a Symbolist artist and this painting was part of his Golden Phase. The painting is covered in gilt and other shining decoration. Art Nouveau, the Arts and Crafts movement, Byzantine art and Egyptian art influenced Klimt at this time. Klimt prepared carefully before painting the painting. He started in 1902. He drew over 100 sketches to practice. Klimt went to the Basilica of San Vitale in Ravenna and looked at Byzantine mosaics. Klimt started with gold leaf and silver leaf and then put gesso on top to make patterns. ==History== According to Klimt's website, Bloch-Bauer was his mistress. She is also the only woman he ever painted twice. Adele's husband, Ferdinand Bloch-Bauer, hired Klimt to paint both paintings. Klimt painted Portrait of Adele Bloch-Bauer II in 1912. Some artists also think Adele Bloch-Bauer might be the woman in The Kiss and Judith and the Head of Holofernes. Before Adele Bloch-Bauer died, she said she wanted the painting to go to the Belvedere Gallery. But, at the time, the painting belonged to her husband and not to her. During World War II, the Nazis stole the painting from Bloch-Bauer's family. It did end up in the Belvedere Gallery. One of the reasons this painting is famous is that it was in a United States Supreme Court case, Republic of Austria v. Altmann, in 2004. Adele Bloch-Bauer's niece, Maria Altmann, tried to get the painting back from the Belvedere Gallery. The Supreme Court said the painting was Altmann's. Because Aultmann could not pay for insurance and storage, she sold the painting to Ronald Lauder to put in the Neue Gallery in New York City. ==In popular culture== The 2015 movie Woman in Gold is about Maria Altmann trying to get the painting back from the Belvedere Gallery. ==References== Category:1910s paintings Category:United States Supreme Court cases Category:1907 works",
 "title": "Portrait of Adele Bloch-Bauer I"
}