{
 "id": "843763",
 "text": "Ai Akamatsu (赤松愛, Akamatsu Ai, born February 14, 1951 in Ashiya, Hyōgo) is a Japanese musician and keyboardist for the Japanese rock band group, the Ox until 1969. His real name is Yoshinobu Akamatsu (赤松義信, Akamatsu Yoshinobu) and his nickname was Ai-chan (アイちゃん). == Life and music career == Born in Ashiya City, Hyogo Prefecture in 1951, His father is the president of the company and is the youngest of three siblings. Akamatsu learned the to play a piano from an early age, and when he was in the second year of junior high school, he said, \"I want to play jazz,\" and his mother opposed \"that kind of music is bad.\" However, in the end, he joined Hatari's and became a semi-professional at the dance hall \"Fuji\" in Osaka at that time. After that, he was invited to join Ox. == Life in the band == The looks of the red brown hair's bob head were lovely, and it became very popular as an idol. However, he disappeared on May 5, 1969 and leave the group. Yoko Ono and Toshimitsu Imai, an old painter, traveled to England on June 23 to \"become a disciple of John Lennon\" as guardian. While staying in London, he lived a life of hanging out at Apple's office, but during that time he returned to Japan temporarily and played the role of Aoyama with Shoji Ishibashi and others in the stage play \"Ashita no Joe\" sponsored by the new national drama from June 3 to 26, 1970. After that, Akamatsu retired from the entertainment world. His father returned to Japan on September 28, 1978 due to a sudden illness. Currently, he takes over the family business and runs an ironworks in Osaka. == Retirement == After retiring, Akamatsu injured his finger due to the circumstances at the time of withdrawal and an accident during press work in the family business (there was a story that he lost his finger, but as far as the video after that, his finger is normal). He will not appear at all on sporadic reunions on old- fashioned programs (Akamatsu's vocal song is Hideto Maki, organ is represented by an external support member) and GS events, but on May 4, 1989 In addition to interviewing his wife on Fuji TV's idol special feature on the day, he appeared on TBS's GS special feature on October 4, 2003, delighting fans with the same appearance as at that time. Category:Japanese musicians Category:1951 births Category:Living people Category:People from Hyōgo Prefecture",
 "title": "Ai Akamatsu"
}