{
 "id": "843762",
 "text": "Hideto Noguchi (野口ヒデト, Noguchi Hideto, born November 27, 1950; Fukuoka, Japan) or Hideto Maki (真木ひでと, Maki Hideto) is a Japanese singer. His real name is Masayuki Nouchi (野内 正行, Nouchi Masayuki) and his nickname was Hideto (ヒデト). After performing as the lead singer for GS's band Ox, he has been active as a singer with a focus on enka (a traditional style of Japanese music). Hideto grew up in Tagawa City, Fukuoka Prefecture. == Life and GS music career == In 1967, Hideto joined the manga and backbone trio (with Yukihiro Kimura And The Backbones) and began his professional career as a singer. Also, with Kimura's instruction to \"sing rock\", sing \"Long Tall Sally\" by The Beatles from June of that year and then sing \"Out of Time\" and \"Tell Me\" by The Rolling Stones. (The fact that the manager of Penguin-do recommended that the LP of the live version of the Stones had a great influence on Hideto Noguchi's theatrical performance later), and the name of Hideto Noguchi in Kansai was given to know gradually. The intense staging became popular and the mobilization power increased when the spine appeared. Toshio Fukui, the leader of the GS Ox band, who saw the performance of \"Tel Me\" at the Jazz Cafe \"Number Ichiban\", said: \"Only our band and The Spiders have the Binson resonance chamber in Japan! \" Noguchi joined the band in December 1967, but at the time he didn't know what Binson was. He made his debut as the vocalist of \"Ox\" in May 1968. His stage name is Hideto Noguchi, in honor of Meiji era bacteriologist Hideyo Noguchi. He made Top 10 and Top 20 hits like \"Girl Friend\", \"Dancing Seventeen\", \"Swan no Nami\" and \"I'm Burning\". The \"Girl Friend\", \"Swan no Nami\" and other two songs were composed by Kyōhei Tsutsumi. At the beginning of her debut, Ai Akamatsu's popularity preceded him, but when he released his second single, \"Dancing Seventeen,\" it overwhelmingly separated him from the popularity poll, and the center of popularity shifted to Hideto Noguchi. In the mid to late GS boom, many dialogues between Kenji Sawada, Kenichi Hagiwara and Hideto Noguchi were seen in magazines. Performances began at six venues across the country in September, causing a swoon on the stage at every venue, including the Tokyo Metropolitan Hibiya Public Hall on the first day, which the media hyped them as \"bands passing out.\" Ox was called the \"GS Gosanke\" along with The Tigers and The Tempters. On May 23, 1970, the Ox held the \"Subtitle\" Second Anniversary Concert and \"Blow Off Elvis Presley\". It was a concert that also served as a new song announcement for me, but Ox at the time was still quite popular along side with the Tigers. The group was disbanded on May 31, 1971. In that same year, Hideto made his first solo debut with \"Masked\". After that, he released singles such as \"What Else Is There\" and \"Yozora no Fuseki\", and released the album \"Hidetokara You ni\" which contains his own \"Clown Who Forgot To Laugh\" line. == Solo debut == In 1975, he prepared to leave from the Yomiuri Telecasting Corporation \"All Japan Kayo Championship\" and won 10 awards every weeks. Renamed to \"Hideto Maki\" after his teacher Yoko Yamaguchi, he made his debut as an enka singer again with \"Yumeyo Mouichido\". This debut song became the first big hit as a solo singer and it broke again to rank 9th on the Oricon national chart and won several excellent newcomer awards. Also, despite being released in September, it is in the Oricon Annual Best 100, and was selected as a candidate song for the 17th Japan Record Awards nomination at the end of the year. Many of the fans were middle and high school students who couldn't see the GS era in real time, and Maki himself was concerned that it would end with a transitory boom. As an aside, the kanji for \"ki\" with Hideto Maki was separated by Hiroshi Itsuki from the same office at the request of Yoko Yamaguchi. As a younger brother from the same office, he also participates in Itsuki's fan club event, and photos from that time are posted on Hideto Maki's website. In 1976, he won the Tokyo Shimbun Best Hit Award for \"Drowning in Love.\" In that same year, he won the popular award, silver award, and other awards at the Iizuka Music Festival for her third single \"Somewhere in Tokyo\". The guest at that time was veteran female actress singer Hibari Misora, and Hideto said that he became more and more of Hibari's fan when she said, \"I know you.\" At the time, master jazz pianist Yuzuru Sera said, \"Hideto is more suited to jazz than enka. I will teach you how to become a jazz singer.\" Every time he met him, Masato Fujita, a master enka composer, would tell him \"because one day, I'll write a music note with Hideto Maki.\" Fujita's perception changed completely with the \"flow\" sung by Hideto on his special show when he was Ox, and even after his re-debut, the paternal replacement for Fuji TV. He also appeared on love shows. It is a pity that the dream with both teachers did not come true. In 1978, with George Yanagi and Rainy Wood, he released his seventh single \"Cammon\" beyond the limits of record companies. It is not an enka song, but a rock style song. At the time, the song was played with a playful feeling, but as she was about to transform into a rock singer, Maki's fierce opposition returned to the enka line. Appeared at the New Years Rock Festival (International Theater) (moderated by Haruo Chikada). The festival is produced by Yuya Uchida. The turn came between the Downtown Boogie Woogie Band and Rainy Wood, and Maki also sang the Rod Stewart song). As an enka singer, only Maki appears at this rock festival, but Yuya Uchida spoke directly to Maki and took notice. \"Ame no Tokyo\" is karaoke and wired, and it won the best-selling award. After that, he released \"Happy Thin Woman\" and \"Hotarugawa\" and it became a huge hit. It seems that the number of adult fans has increased around here, and there are many male fans who like \"I am a happy slim woman\". == Popularity and participation == Also, Yuya asked him to appear in the \"Carnival of the West\" which was revived when the Nippon Theater was demolished, but Maki himself said it would be strange to appear again because Ox had refused to appear in the \"Carnival of the West\" in the past. . . It is said that he refused the offer. In 1988, Taro Morimoto asked him to join The Tigers Memorial Club Band, where he was able to balance solo and GS singers for eight years. (It is the largest GS unit released at the Osaka Castle Hall / Yokohama Arena concert). Upon entering Heisei, the song \"Genki no Hoshi\", which begins with the lyrics of \"Ace No. 4 from childhood\", became a hit song since \"Ame no Tokyo\" and is still played in the second match. of the Yomiuri Giants army. Sing the original song \"Thank You For Love\" on the Kuni Kawachi 2010 project work album \"Shido We ga Hibi\". It is also a charity song for the 2011 Tōhoku earthquake and tsunami. On March 28, 2012, Sony Music released 21 songs by Hideto Maki and G ☆ B \"Euphoric Flame Song\" to mark the 45th anniversary of the singer's debut, but they are still selling steadily. In 2015, he celebrated the 40th anniversary of the name change to Hideto Maki, and on May 24, a limited edition of 120 people, \"Don't Forget Your Original Intent, Yukihiro Kimura and Backbone Live\" was made for the first time. in about 50 years (Kimura). Returning Yukihiro Live). The Ox's (ongoing) reunion is \"impossible\". However, in reality, the members except Ai Akamatsu and Yusuke Taura (Yûsuke Natsu) have met sporadically on the old-fashioned tune show, sometimes singing Ox-era songs in solo live performances. It's been 50 years since he started as a professional singer in 2017. 2018 marked the 50th anniversary of the Ox first debut. On September 9, 2018, due to fan enthusiasm, Yukihiro Kimura and Backbone Live were held in Osaka Moerado for the first time in 3 years and were sold out. In 2019, he will appear on \"Eternal Showa Hit Kayo On Stage\" in May and July. At the May Concert, youth songs will be played, which is also their starting point, and at the July concert, GS-era songs will be played at downtown. On May 5, 2020, Sony Music released a 5-CD-BOX set of 111 songs, including a new song for the first time in approximately 30 years, as a tribute to Kouki. (The first CD reprint of Hideto Noguchi's song, including hit songs from the Ox era, hit songs after being renamed Hideto Maki, and even \"Genki no Hoshi\"). As of June 10, only Sony sound sources will be distributed for \"euphoria, intoxication, hiding and clause\". Serialized in Nihon Keizai Shimbun, interviews with four major newspapers, radio appearances and other activities with Reiwa's Hideto Maki began. Category:1950 births Category:Living people Category:Japanese singers",
 "title": "Hideto Maki"
}