{
 "id": "843860",
 "text": "Jack Stauber (born April 6, 1996) is an American musician, animator, and YouTuber from McKean, Pennsylvania who now lives in Pittsburgh. He is known for his strange lyrics and accompanying music videos on YouTube used as internet memes. Stauber has been a member of the bands Joose and Zaki. In 2020, he won the Shorty Award for Best in Weird. His first album, Finite Form (2013), was released when he was 16. Inspired by folk music, his second album, Viator (2015), was released two years later. Stauber's third studio album Pop Food (2017) experimented with pop, lo-fi, and a 80s and 90s aesthetic. The first two tracks, Buttercup and Oh Klahoma, went viral on TikTok, and have a combined 354 million Spotify streams as of May 2021. His latest album, HiLo (2018), has elements of funk, pop, and rock. Stauber first published on YouTube in 2013. His website was launched in late 2017. The website mostly has links to other content such as his social media and merch stores. Stauber also has a Patreon, where he releases unreleased songs and videos monthly. He also releases full versions of short songs found on his YouTube channel. These full versions are usually released later under \"Jack Stauber's Micropop\". == Early life == Stauber grew up in McKean, Pennsylvania. He has one sister, named Kharly. He majored in marketing and minored in studio arts at the University of Pittsburgh. In an interview, Stauber showed his favorite cartoon is Rugrats, and liked the art style, stating \"Take some time to watch a minute of the pilot of Rugrats if you haven’t seen that before. The art style is beyond incredible.\" == Work == === Buttercup and Oh Klahoma === Stauber's most famous work, Buttercup, is the first song released on his 2017 album Pop Food. The song, along with remixes and covers of it, became a popular internet meme, especially on TikTok, which helped with its success. The song currently has 279 million Spotify streams as of May 2021. Stauber did not release an official music video for it. The song has been described as \"bubbly, dramatic pop with Panda Bear-esque vocals.\" YouTuber lisuga made a popular fan made video using clips from the Japanese film, \"Kick-Heart\". It is the most viewed Jack Stauber-related video on YouTube, with 191 million views as of May 2021. Oh Klahoma, the second track from Pop Food, also became popular. The song currently has 74 million Spotify streams as of May 2021. The song is most famously used as background music to a TikTok trend called #ghostphotoshoot, where creators dress up as ghosts and take photos of themselves, sometimes wearing sunglasses and other fashion accessories. However, the trend has become controversial, with critics saying the bedsheet costumes used look like KKK robes. == Style == Stauber's visual style is known to be different, with some YouTube videos being dedicated to attempting to replicate the aesthetic that he utilizes in many of his videos. Stauber himself commented under one such video, expressing that he was impressed with the result. Meg Fair of Pittsburgh City Paper highlighted Stauber's knack of \"pulling unrelated sounds and influences into [his] music\" and liked his ability to switch styles quickly. Jenna Minnig of PennState CommMedia compared Stauber's music to Ariel Pink's; as both have hypnagogic-pop styles and have similar voices, but believed it was not needed to compare the two. Fans of his music include American rock musician Jon Bon Jovi, actor, rapper, and comedian Andy Milonakis, actor Verne Troyer, indie singer-songwriter Sidney Gish, and model Paris Jackson. === Animations === Along with music, Stauber is known for his animations. They are usually separated into three styles: \"surreal\", characters with odd and striking facial expressions and frequently part of his claymations, \"colorful\", which usually are featured in his VHS animations and music videos, and \"Stauber faces\", light-skinned characters with cartoon noses. Stauber is also well known for his frequent use of teeth in his videos and animations. He usually uses detailed resin teeth on his clay characters, although he has used real teeth. He has encouraged fans to send him teeth for him to use in his videos.Jack stauber also considers his style of art as \"weirdcore\". To make his animations, Stauber uses Microsoft Paint for the drawings. He then sequences the frames in Adobe Premiere Pro, and then runs the finished video through a VHS tape. ==Awards and nominations== Year Organization Award Recipient Result 2020 Shorty Awards Creative & Media: Best in Weird Jack Stauber == Discography == === Albums === Stauber has four albums on both his Bandcamp and Spotify. Stauber uses the Plopscotch Records label to put copyright on his music. Title Details Finite Form * Released: March 18, 2013 * Label: Plopscotch Records * Format: digital download, streaming Viator *Released: September 18, 2015 * Label: Plopscotch Records * Format: Digital download, streaming, CD Pop Food *Released: March 27, 2017 * Label: Plopscotch Records * Format: Digital download, streaming, CD, vinyl HiLo *Released: April 14, 2018 * Label: Plopscotch Records * Format: Digital download, streaming, CD, vinyl === Extended plays === Title Details Reviator * Released: September 18, 2017 * Label: Plopscotch Records * Format: digital download, streaming === Singles === Title Year Album \"Christ Potion\" 2015 Viator \"Oh Klahoma\" 2017 Pop Food \"Dead Weight\" 2018 HiLo \"Gettin' My Mom On\" === Jack Stauber's Micropop === Stauber also publishes under the name \"Jack Stauber's Micropop\", releasing longer versions of short songs found on his YouTube channel. These songs are less popular than his songs and albums released under his main name, Jack Stauber. These extended versions are often released early for Stauber's Patreon supporters. Under the Micropop name, Stauber has released six EPs and one compilation album, along with two soundtracks for his works with Adult Swim. ==== Albums ==== Title Details Micropop * Released: June 29, 2019 *Label: Plopscotch Records * Format: digital download, streaming Shop: A Pop Opera * Released: March 12, 2020 *Label: Plopscotch Records * Format: digital download, streaming Jack Stauber's OPAL (Original Soundtrack) * Released: November 6, 2020 *Label: Plopscotch Records * Format: digital download, streaming ==== EPs ==== Title Details Inchman / Two Time * Released: June 4, 2018 *Label: Plopscotch Records * Format: digital download, streaming Cheeseburger Family / Fighter * Released: August 6, 2018 *Label: Plopscotch Records * Format: digital download, streaming The Ballad of Hamantha / Today Today / Al Dente * Released: November 5, 2018 *Label: Plopscotch Records * Format: digital download, streaming Baby Hotline / Tea Errors * Released: March 21, 2019 *Label: Plopscotch Records * Format: digital download, streaming Deploy / Those Eggs Aren't Dippy / Out the Ox * Released: November 4, 2019 *Label: Plopscotch Records * Format: digital download, streaming Dinner Is Not Over / There's Something Happening / Keyman / Cupid * Released: February 7, 2020 *Label: Plopscotch Records * Format: digital download, streaming ==Notes== ==References== == Other websites == * * * Category:1996 births Category:Living people Category:American YouTubers Category:American animators Category:American folk singers Category:American pop singers Category:Internet memes Category:American singer-songwriters",
 "title": "Jack Stauber"
}