{
 "id": "843857",
 "text": "Vikram Bhatt (born 27 January 1969 in Bombay) is an Indian film director, producer, screenwriter and actor. Formerly, he was the creative head of ASA Productions and Enterprises until 2014, when he resigned from the company. His directed his first film Jaanam, which was produced by Mukesh Bhatt. His first four films did not fare well at the box office; his first successful directorial venture was Fareb. Following this, he had multiple successful films such as Ghulam, Kasoor, Raaz and Awara Paagal Deewana. After Awara Paagal Deewana, he gave flops like Aap Mujhe Achche Lagne Lage, Deewane Huye Paagal and Ankahee. Humko Tumse Pyaar Hai was another flop although Bobby Deol's and Ameesha Patel's performances were well-received. In 2008, Bhatt came back with the horror genre and he delivered three films that were successful at the box office; these include 1920, Shaapit, and Haunted – 3D. In 2010, Bhatt introduced stereoscopic 3D for the first time in India with his film Haunted – 3D; the film was released in May 2011 and it then set the record of the highest grossing Hindi horror film of all time, making Rs. 270 million at the box office. In 2012, Bhatt's Raaz 3D recorded domestic box office collection of 729 million after the 3rd weekend and the overseas collection was at 46 million. Riding high with the success, Bhatt is writing another horror-thriller for Bipasha in the central role, with a more shocking image than Raaz 3. Following the success of Raaz 3, Vikram Bhatt's written Hindi horror movie 1920: Evil Returns which has been directed by debutant Bhushan Patel topped the first weekend collection chart at the box office and the approximate collection was Rs 124.3 million nett. The movie further collected approx Rs 37.5 million net in the second Weekend, taking the total to Rs 228.6 million nett. The film has been declared a 'Hit'. Soon after, Bhatt signed a deal with Bhushan Kumar's T-Series to produce 5 films of sci- fi, thriller and horror genre. Two of the films will be directed by Bhatt himself. In early 2013, Bhatt announced his upcoming projects, Creature 3D, India's First 3D Monster Movie with Bipasha Basu in the lead role and 1920 London, third in the 1920 series. Vikram Bhatt will mark his foray into Marathi cinema with 'Ek Doosrey Ke Liye', which will be directed by Ashwini Kumar Patil. == References == Category:Indian movie directors Category:Indian screenwriters Category:1969 births Category:Living people",
 "title": "Vikram Bhatt"
}