{
 "id": "843907",
 "text": "James David Maslow (born July 16, 1990) is an American actor and singer. He played the role of James Diamond on Nickelodeon's Big Time Rush. Easy A He had roles in Getaway and The Frozen Ground. He is a member of the boyband Big Time Rush. ==Filmography== ===Films=== Year Title Role Notes 2010 Easy A Himself/James Maslow 2013 Getaway Max The Frozen Ground Daniel O'Brian 2017 48 Hours to Live Wyatt Love Exclusively Caleb Art Show Bingo Wil Also associate producer 2018 Bachelor Lions Mark Meyers Room for Murder Jake 2020 My Boyfriend's Meds Henry 2021 Stars Fell on Alabama Bryce Dixon Ron's Gone Wrong Bubble Employee (voice) 2022 We Need to Talk Scott Stewart Wolf Hound Captain David Holden 2023 Stars Fell Again Bryce Dixon Holiday Twist Sam Black Skies Bolton ===Television=== Year Title Role Notes 2008 iCarly Shane Episode: \"iSaw Him First\" 2009–2013 Big Time Rush James Diamond Main role 2011 Hand aufs Herz Himself Episode: \"August 11\" 2012 How to Rock Himself Episode: \"How to Rock: An Election\" Big Time Movie James Diamond Television film 2012; 2013 See Dad Run Ricky Adams Episodes: \"See Dad Wah-Wah'd\" and \"See Dad Campaign\" 2013 Marvin Marvin Himself Episode: \"Big Time Marvin\" 2014 Dancing with the Stars Contestant Season 18 Sequestered Kevin Mohr Main role 2015 The Penguins of Madagascar Beaver James (voice) Episode: \"Tunnel of Love\" Seeds of Yesterday Bart Foxworth Television film 2018 The Big Bang Theory Bartender Episode: \"The Reclusive Potential\" Celebrity Big Brother Contestant Season 1 2019 The Big Stage Host 2020 World's Funniest Animals Guest 1 episode 2023 iCarly Shane Episode: \"iReunited and It Felt Okay\" ===Web=== Year Title Role Notes 2015 Be Right Back Maury McQuarrie Main role 2016 Princess Rap Battle Kristoff Episode: \"Rapunzel & Flynn vs. Anna & Kristoff\" ==Discography== ===Studio albums=== Title Album details How I Like It *Released: March 3, 2017 *Formats: CD, digital download *Label: Membran ===Singles=== ====As lead artist==== Title Year Album \"Lies\" (featuring Unlike Pluto) 2015 rowspan=2 \"Circles\" 2015 \"Cry\" (featuring City Fidelia) 2017 How I Like It \"How I Like It\" 2017 How I Like It \"Who Knows\" 2017 How I Like It \"Christmas Beautiful\" 2017 rowspan=6 \"Falling\" 2018 \"All Day\" (featuring Dominique) 2018 \"Love U Sober\" 2019 \"Delirious\" 2019 \"Did You Forget\" 2019 \"History\" 2020 rowspan=4 2020 2020 2020 ====As featured artist==== Title Year Album \"Never Too Young\" (MattyB featuring James Maslow) 2013 rowspan=2 \"Now The Time Has Come\" (Ringo Starr featuring Billy Valentine, Casey McPherson, Christian Collins, Colin Hay, James Maslow, Kirsten Collins, Maddi Jane, Richard Page and Wesley Stromberg) 2017 \"Brayton Be Faking\" (Desmond Dennis featuring James Maslow) 2021 rowspan=1 \"In My Head\" (Lauren Mayhew featuring James Maslow And Eugene Ugorski) 2022 rowspan=1 ===Other appearances=== Title Year Other artist(s) Album \"Mirrors (featuring James Maslow)\" 2013 Cimorelli Best Of 2013 ==References== Category:Living people Category:1990 births Category:Actors from New York City Category:American pop singers Category:Singers from New York City Category:Models from New York City Category:American movie actors Category:American television actors Category:American voice actors Category:American rock singers Category:American dancers Category:Big Time Rush members",
 "title": "James Maslow"
}