{
 "id": "844087",
 "text": "Adele Bloch-Bauer I (1881-1925) was an Austrian Jew who lived in Vienna. She supported many artists. Adele knew the painter Gustav Klimt. She is the only woman he painted more than once. People called her \"the Austrian Mona Lisa.\" After her death, the Nazis stole the paintings from her family. Years later, her niece and some lawyers went to the United States Supreme Court to get them back. ==Early life== Adele Bloch-Bauer was born Adele Bauer in 1881. Her father worked as a director for banks and railways. ==Marriage== Adele married Ferdinand Bloch when she was 19. He was 17 years older than she was. He liked her so much that instead of her becoming Adele Bloch, they both became Adele and Ferdinand Bloch-Bauer. They both liked many artists, including Gustav Klimt. She tried to have children with him, but two of them died before they were born and one baby died after. Adele's sibling married Ferdinand's sibling, and all four of them used the same last name, Bloch-Bauer. Adele's sibling had two children. Maria Altmann said her aunt was \"rather cold, intellectual woman who was very politically aware and became a socialist. She was not happy. It was an arranged marriage but she was childless, after two miscarriages and the death of a baby. I remember her as extremely elegant, tall, dark and thin. She always wore a slinky white dress and used a long, gold cigarette holder.\" Bloch-Bauer had parties for artists every week. Gustav Mahler, Richard Strauss and Stefan Zweig came to the parties. Some of the educated people who came to the parties convinced Bloch-Bauer to support the poor and help women have the right to vote. ==Paintings== According to Klimt's website, Bloch-Bauer was his mistress. She is also the only woman he ever painted twice. Adele's husband, Ferdinand Bloch-Bauer, hired Klimt to paint both paintings. Klimt painted Portrait of Adele Bloch-Bauer I in 1907 and Portrait of Adele Bloch-Bauer II in 1912. Some artists also think Adele Bloch- Bauer might be the woman in The Kiss and Judith and the Head of Holofernes. The first portrait was a gift from Ferdinand Bloch-Bauer to Adele's parents. ==Death== Adele Bloch-Bauer died of meningitis in 1925 when she was 43 years old. ==Legal case== During World War II, the Nazis stole Portrait of Adele Bloch-Bauer I from Bloch-Bauer's family. It ended up in the Belvedere Gallery. In Republic of Austria v. Altmann in 2004, Adele Bloch-Bauer's niece, Maria Altmann, tried to get the painting back from the Belvedere Gallery. The Supreme Court said the painting was Altmann's. Because Aultmann could not pay for insurance and storage, she sold the painting to Ronald Lauder to put in the Neue Gallery in New York City. ==Legacy== Bloch-Bauer had a large influence on modern art. Also, in 2016, the street Bloch-Bauer Promenade in Vienna was named after her and her husband. ==In popular culture== The 2015 movie Woman in Gold is about Maria Altmann trying to get the painting back from the Belvedere Gallery. Adele Bloch-Bauer is shown in flashbacks. ==Pictures== File:Adele Bloch-Bauer - mars 1898.jpg|Adele Bloch-Bauer in 1898. File:Klimt Adele Bloch Bauer AV.png|A gold coin with Adele Bloch-Bauer's portrait on it. File:Kolo Moser - Exlibris für Adele Bloch -ca1905.jpeg|A stamp with Adele Bloch-Bauer's picture on it. ==References== Category:Austrian Jews Category:1881 births Category:1925 deaths Category:Socialites",
 "title": "Adele Bloch-Bauer"
}