{
 "id": "844194",
 "text": "Zuleika Angel Jones (June 5, 1921 - April 14, 1976), better known as Zuzu Angel, was a Brazilian-American fashion designer. She became famous because she opposed the Brazilian military dictatorship after the forced disappearance of her son, Stuart. She was also the mother of journalist Hildegard Angel.\"Zuzu Angel\" . UOL Educação. Retrieved July 15, 2013. This dictatorship was backed by the CIA and the US government, at least for some time. The National Truth Commission was created in 2014, to gather and review information about crimes committed during this dictatorship. A former agent of the dictatorship, called Cláudio Antônio Guerra confirmed that agents of the dictatorship were involved in the death of Angel. == Life and career == Zuzu Angel was born on June 5, 1921, in Curvelo, Brazil. As a child, she moved to Belo Horizonte, later she lived in Bahia. Bahian culture and colors significantly influenced the style of Angel's creations. In 1947, she went to live in Rio de Janeiro, which was Brazil's capital city at the time. In the 1950s, Angel began to work as a seamstress. She usually made clothing for close relatives. At the start of the 1970s, she opened a store in Ipanema. At that time, she also started to show her clothes on American catwalks. In her fashion expositions, she always used the joy and richness of the colours of Brazilian culture. This made her well known in the fashion world of her time. Angel married an American salesman, Norman Angel Jones, and on January 11, 1946, they had a son, Stuart.\"Stuart Edgar Angel Jones\" . Tortura Nunca Mais. Retrieved July 15, 2013. == Forced disappearance of Stuart Angel == Stuart Angel was an undergraduate student at Federal University of Rio de Janeiro's School of Economics when he joined the left-wing urban guerrilla group Revolutionary Movement 8th October (Movimento Revolucionário 8 de Outubro – MR-8). His fellow guerrillas gave him the codenames \"Paulo\" and \"Henrique\".\"Stuart Edgar Angel Jones\" . Eremias Delizoicov. Retrieved July 15, 2013. He married fellow militant Sônia Maria Morais Angel Jones. His wife died in the custody of the military dictatorship's political police. Officers of the Air Force Information Center (Centro de Informações da Aeronáutica – CISA arrested Stuart in the neighborhood of Grajaú, Rio de Janeiro on June 14, 1971. He was then taken under custody to CISA headquarters, where he was reportedly tortured. According to political prisoner Alex Polari, who claimed to have witnessed the incident, Stuart was then tied to the back of a jeep with his mouth glued to the vehicle's exhaust pipe and dragged through the courtyard of the Air Force base. This caused him to die from asphyxiation and carbon monoxide poisoning. His body was never found. === Aftermath === Alex Polari wrote a letter to Zuzu Angel explaining the circumstances of her son's death. Based on Polari's letter and other evidence, Angel reported the murder to Ted Kennedy, who revealed the case during a speech at the United States Senate. Angel also handed a letter to Henry Kissinger, who was Secretary of State of the United States at the time. This letter was a translation of Polari's letter. She also gave Kissinger a copy of the twentieth volume of the book History of the Brazilian Republic by Hélio Silva, in which Stuart's death is discussed. According to Silva, among the reactions of the regime to the protests of the American-Brazilian community were the removal and subsequent retirement of Brigadier João Paulo Burnier, who Polari accused of being responsible for Stuart's death. The Minister of the Air Force, Márcio de Sousa Melo was also dismissed. == Death == Zuzu Angel was killed in a car crash on April 14, 1976. The suddenness of her death raised suspicions of government involvement; the case was investigated by the Comissão de Mortos e Desaparecidos Políticos (Commission on Political Deaths and Disappearances), under process number 237/96. This commission found many reasons to doubt the official version of events. In 2014, the involvement of agents of the military repression regime in Brazil in her death was confirmed. A former agent named Cláudio Antônio Guerra, wrote the book Memories of a Dirty War. In this book he details several crimes in which he took part and he also revealed details about historical events of that time, among them the Riocentro May Day Attack, the death of Zuzu Angel and others. Cláudio Antônio Guerra was the director of the Department of Political and Social Order, known as DOPS at the time. This department was well-known, because it was often involved in torture, extrajudicial killings and forced disappearance. Guerra said that army Colonel Freddie Perdigão had been present at the scene when the accident happened. Perdigau was a known torturer. In a photo taken at the scene of the accident that killed the stylist, Freddie Perdigão is seen standing close to the car. The photo had been taken on April 14, 1976 and was published on the day of disaster but Perdigão had not been identified in the photo until Guerra identified him to the members of the commission. == Homages and cultural references == Stuart Angel is the patron of Juventude Revolucionária 8 de Outubro, MR-8's youth branch. MR-8 is now a faction of the Brazilian Democratic Movement. The lyrics of the song \"Cálice\", written by Chico Buarque and Gilberto Gil make reference tp Stuart's probable death by asphyxiation and carbon monoxide poisoning.\"'Bebida amarga' não era metáfora em 'Cálice'\" . Futepoca. January 29, 2010. In homage to Zuzu Angel, and other mothers who were unable to bury their children, Buarque wrote the song \"Angélica\" in 1977. In 2006, the events surrounding Stuart's death were dramatised in the movie Zuzu Angel, directed by Sérgio Rezende. The movie, in which Daniel de Oliveira plays Stuart, is about Zuzu's struggle to find out the truth of her son's death.Leite, Paulo Moreira.. O Estado de S. Paulo. August 17, 2006. Archived from the original on June 14, 2007. The Tunnel Dois Irmãos, which connects Gávea to São Conrado, the same place where Zuzu's car crashed, was renamed after her. In 2015, Angel was commemorated on her 94th birthday with a Google Doodle featuring a motif adapted from the prints she used in her designs. ==References== == Other websites == * Zuzu o Anjo at Bolsa Demulher * Zuzu Angel Institute Category:1976 deaths Category:1921 births Category:Fashion designers Category:People from Minas Gerais",
 "title": "Zuzu Angel"
}