{
 "id": "844271",
 "text": "The 2021–22 UEFA Champions League knockout phase began on 15 February with the round of 16 and will end on 28 May 2022 with the final at the Stade de France in Saint-Denis, France, to decide the champions of the 2021–22 UEFA Champions League. A total of 16 teams compete in the knockout phase. Times are CET/CEST, as listed by UEFA (local times, if different, are in parentheses). ==Qualified teams== The knockout phase involves the 16 teams which qualified as winners and runners-up of each of the eight groups in the group stage. Group Winners (seeded in round of 16 draw) Runners-up (unseeded in round of 16 draw) A Manchester City Paris Saint-Germain B Liverpool Atlético Madrid C Ajax Sporting CP D Real Madrid Inter Milan E Bayern Munich Benfica F Manchester United Villarreal G Lille Red Bull Salzburg H Juventus Chelsea ==Schedule== The schedule is as follows (all draws are held at the UEFA headquarters in Nyon, Switzerland). Round Draw date First leg Second leg Round of 16 13 December 2021, 15:00 15–16 & 22–23 February 2022 8–9 & 15–16 March 2022 Quarter-finals 18 March 2022, 12:00 5–6 April 2022 12–13 April 2022 Semi-finals 26–27 April 2022 3–4 May 2022 Final 28 May 2022 at Stade de France, Saint-Denis ==Bracket== ==Round of 16== The draw for the round of 16 was held on 13 December 2021, originally at 12:00 CET. The draw featured multiple irregularities: Manchester United were mistakenly included in the draw for Villarreal's opponent (both were in Group F), and subsequently were selected; another ball was then drawn, with Manchester City chosen instead. In the following tie, Liverpool were mistakenly included in the draw for Atlético Madrid's opponent (both were in Group B), while Manchester United were incorrectly excluded. Later that day, UEFA voided the original draw due to a \"technical problem\" with the draw computer, and it was entirely redone at 15:00 CET. The round of 16 ties were initially drawn (and later voided) as follows: *Benfica – Real Madrid *Villarreal – Manchester City *Atlético Madrid – Bayern Munich *Red Bull Salzburg – Liverpool *Inter Milan – Ajax *Sporting CP – Juventus *Chelsea – Lille *Paris Saint-Germain – Manchester United ===Summary=== The first legs were played on 15, 16, 22 and 23 February, and the second legs were played on 8, 9, 15 and 16 March 2022. |} ===Matches=== Bayern Munich won 8–2 on aggregate. \\---- Manchester City won 5–0 on aggregate. \\---- Benfica won 3–2 on aggregate. \\---- Chelsea won 4–1 on aggregate. \\---- Atlético Madrid won 2–1 on aggregate. \\---- Villarreal won 4–1 on aggregate. \\---- Liverpool won 2–1 on aggregate. \\---- Real Madrid won 3–2 on aggregate. ==Quarter-finals== The draw for the quarter-finals was held on 18 March 2022, 12:00 CET. ===Summary=== The first legs were played on 5 and 6 April, and the second legs were played on 12 and 13 April 2022. |} ===Matches=== Real Madrid won 5–4 on aggregate. \\---- Manchester City won 1–0 on aggregate. \\---- Villarreal won 2–1 on aggregate. \\---- Liverpool won 6–4 on aggregate. ==Semi-finals== The draw for the semi-finals was held on 18 March 2022, 12:00 CET, after the quarter-final draw. ===Summary=== The first legs were played on 26 and 27 April, and the second legs were played on 3 and 4 May 2022. |} ===Matches=== Real Madrid won 6–5 on aggregate. \\---- Liverpool won 5–2 on aggregate. ==Final== The final will be played on 28 May 2022 at the Stade de France in Saint-Denis. A draw was held on 18 March 2022, after the quarter-final and semi-final draws, to determine the \"home\" team for administrative purposes. ==Notes== ==References== ==Other websites== * knockout phase",
 "title": "2021–22 UEFA Champions League knockout phase"
}