{
 "id": "84421",
 "text": "Search engine optimization (SEO) is about making websites and other forms of online presence appear higher in search results when someone searches for a term. The search term is called a keyword. The results of the search are displayed in the search engine's results pages (SERPS) such as those given by Google, Bing, Yahoo! and others. Other terms used to describe search engine optimization are internet marketing and search engine marketing. == On-page SEO == On-page SEO, or on-site SEO, is optimizing web pages for users and search engines. It refers to specific elements and attributes of a website, such as content (written words), HTML, system, CSS, internal links, outbound links, and more. Websites are ranked by – among other things – the quality of their SEO, which Google analyzes in its indexing and ranking of websites. Google’s own “How Search Works” reports that, “The most basic signal that information is relevant is when a web page contains the same keyword as the search query. If those keywords appear on the page, or if they appear in the headings or body of the text, the information is more likely to be relevant”. == Technical SEO == Technical SEO refers to the non-on-page elements of a site. This includes elements that affect the optimization and proper operation of the website, such as site speed, mobile-friendliness, crawlability, and more. Correct and fast operation of a website has a fundamental impact on the site's ranking. == Off-page SEO == Everything SEO-related that doesn't take place on a website is considered off-page SEO. Among other things, backlinks, social media, and local citations are all aspects of off-page SEO. == Importance of SEO == SEO is a crucial part of marketing campaigns run by businesses to reach customers online. Companies hire SEO agencies to do the work for them because of the expertise required. == \"White Hat,\" \"Gray Hat,\" and \"Black Hat\" SEO Techniques == If an SEO method is approved by search engines to rank their website, it is called a \"white hat technique\". If the method is not approved, it is called a \"black hat technique\". Search engines penalize sites using black hat techniques by ranking them lower, or by not showing them on search results at all. However, some techniques fall in between these two categories, known as \"gray hat techniques.\" These methods are not explicitly approved by search engines but are not strictly prohibited either. While they may offer short-term ranking benefits, they carry the risk of penalties if search engine guidelines change. ==Other websites== * Google's SEO guide * Google Search Engine Optimisation Guidelines == References == Category:Search engines Category:Marketing Category:E-commerce",
 "title": "Search engine optimization"
}