{
 "id": "844204",
 "text": "\"Levitating\" is a song by English singer Dua Lipa, from her second studio album, Future Nostalgia (2020). The song was released as a remix with American rapper DaBaby on October 1, 2020. It was written by Dua Lipa, Sarah Hudson, Clarence Coffee Jr., and KOZ, who produced the song with Stuart Price. It is a funk and disco-boogie song that runs for three minutes and 24 seconds. The DaBaby remix of the song has peaked at number one on the Canadian Hot 100 and at number two on the Billboard Hot 100 in the US, tying her peak there with \"Don't Start Now\". After DaBaby allegedly made homophobic remarks at a concert, his credit was removed from the remix on the Hot 100. \"Levitating\" topped the US year-end Hot 100 for 2021, marking the first time in 20 years that a song that did not reach number one on the weekly chart topped the year- end chart, since Lifehouse's \"Hanging by a Moment\" in 2001. It also topped the year-end Canadian Hot 100 for 2021. It also became the longest-running song in the top ten by a lead female in Billboard history, breaking the record set by LeAnn Rimes' \"How Do I Live\". It also charted for 65 weeks, the longest- charting song by a female in Billboard history. On November 10, 2023, the Recording Industry Association of America (RIAA) announced that \"Levitating\" was certified Diamond in the US for shipments and streams equal to 10 million copies sold there. == Charts == ===Weekly charts=== Chart (2020–21) Peak position Belgium (Flanders) 32 Belgium (Wallonia) 27 Bulgaria 2 Canada (Canadian Hot 100) 1 Finland 11 Germany 16 Ireland (IRMA) 4 Netherlands 20 New Zealand (RMNZ) 5 Portugal 5 Spain 74 Sweden 20 UK Singles Chart (OCC) 5 US Billboard Hot 100 2 US Mainstream Top 40 (Billboard) 1 ===Year-end charts=== Chart (2021) Rank Canada (Canadian Hot 100) 1 US Billboard Hot 100 1 ===Certifications=== ==References== Category:2020 songs Category:Dua Lipa songs Category:DaBaby songs Category:Funk music Category:Disco songs",
 "title": "Levitating"
}