{
 "id": "844330",
 "text": "Plants have a history even longer than animals, because animal life is based on eating plants. Plants evolved before animals. The first plants were cyanobacteria which formed stromatolites. However, this article deals with plants as understood by most people. Their history starts in the Silurian period, about 430 million years ago (mya). Evidence of the earliest land plants is about 470 mya, in Ordovician rocks from Saudi Arabia, and Gondwana. In the Devonian of ~370 mya, some spore plants such as Archaeopteris had secondary vascular tissue which produced wood and had formed forests of tall trees. Also by this time Elkinsia, an early seed fern, had evolved seeds. The order in which tree-like land plants evolved is this: #Pteridophytes (tree ferns): reproduce by spreading spores. Ferns are in this group, but they were much bigger and more tree-like in the Carboniferous period. #Gymnosperms: seed-producing plants such as conifers, cycads, and Ginkgo. These were the food of herbivorous dinosaurs, very tough and difficult to digest. They are first found in the Carboniferous period, and grew in the huge warm forests of the Mesozoic era. Some of these plants left evidence that they had begun to encourage insects to help with pollination. #Flowering plant trees. These are the dominant trees in the warmer parts of Earth, though conifers still dominate the colder regions. Flowering plants eventually evolved the type of plant which almost all herbivores eat today: that is, grass. It would not have been true of the early Miocene, the first half, when the Earth was warmer and wetter and covered mainly with trees. == References == === Selected textbooks on plant evolution === *Taylor T.N. & E.L. 1993. The biology and evolution of fossil plants. Englwood Cliffs: Prentice-Hall,. *Willis K.J. & McElwain J.C. 2002. The evolution of plants. Oxford University Press. *Bell P.R. 1992. Green plants: their origin and diversity. Cambridge University Press. *Kenrick P. & Crane P.R. 1997. The origin and diversification of land plants. Washington D.C. Smithsonian Institute Press. Category:Evolution Category:Trees",
 "title": "Evolution of plants"
}