{
 "id": "84437",
 "text": "The Federal Ministry of Family, Senior Citizens, Women and Youth () (BMFSFJ) is a ministry of the Federal Republic of Germany. Although the headquarters are in Berlin, more people work in the Bonn office. Different ministries, for example Labour and Social Affairs, can affect families, the elderly, women and youth. The BMFSFJ watches what these ministries do and provides specialised help. == History == 1953 :Created as the Federal Ministry for Family Questions (). 1957 :renamed the Federal Ministry Family and Youth Questions () 1963 :renamed Federal Ministry of Family and Youth () 1969 :took over the Federal Ministry of Health () to become the Federal Ministry of Youth, Family and Health () 1986 :renamed the Federal Ministry of Youth, Family, Women and Health, (). 1991 :Divided up into the ::Federal Ministry of Health() ::Federal Ministry of Women and Youth () ::Federal Ministry of Family and Senior Citizens () 1994 :Rejoined to make the present Federal Ministry of Family, Senior Citizens, Women and Youth, . == Federal Ministers == Federal Minister for Family Questions (1953 to 1957), Family and Youth Questions (1957-1963) or Family and Youth (1963 to 1969) * 1953-1962: Franz-Josef Wuermeling (CDU) * 1962-1968: Bruno Heck (CDU) * 1968-1969: Aenne Brauksiepe (CDU) Federal Minister for Youth, Family and Health (1969 to 1986), Youth, Family, Women and Health (1986–1991) * 1969-1972: Käte Strobel (SPD) * 1972-1976: Katharina Focke (SPD) * 1976-1982: Antje Huber (SPD) * 1982-1982: Anke Fuchs (SPD) * 1982-1985: Heiner Geißler (CDU) * 1985-1988: Rita Süssmuth (CDU) * 1988-1991: Ursula Lehr (CDU) Federal Minister for Women and Youth 1991 to 1994 * 1991-1994: Angela Merkel (CDU) Federal Minister for Family and Senior Citizens 1991 to 1994 * 1991-1994: Hannelore Rönsch (CDU) Federal Minister for Family, Senior Citizens, Women and Youth since 1994 * 1994-1998: Claudia Nolte (CDU) * 1998-2002: Christine Bergmann (SPD) * 2002-2005: Renate Schmidt (SPD) * 2005-2009: Ursula von der Leyen (CDU) * 2009-2013: Kristina Köhler (CDU) * 2013-2017: Manuela Schwesig (SPD) * 2017-2018: Katarina Barley (SPD) * 2018-2021: Franziska Giffey (SPD) * 2021: Christine Lambrecht (SPD) * 2021-2022: Anne Spiegel (Grüne) * since 2022: Lisa Paus (Grüne) *",
 "title": "Federal Ministry of Family Affairs, Senior Citizens, Women and Youth"
}