{
 "id": "844405",
 "text": "Shin Okamoto (岡本信, Okamoto Shin, April 20, 1949; Kanagawa Prefecture - April 19, 2009 [age 59]; Atsugi) is a Japanese musician and lead vocalist for The Jaguars. He became famous through music and of course, the 1968 Japanese musical comedy adventure film, Make Way For The Jaguars (directed and written by Yôichi Maeda; produced by Shochiku) == Career == Born in the Kanagawa Prefecture in on April 20, 1949, Shin's birth name was Katsutaro Okamura (岡村勝太郎, Okamura Katsutarō). In 1964 at the age of 16, Shin joined The Play Five with Yukio Miya, which was created and became a lead vocalist. In 1967, when Yukio Miya and The Play Five changed their group name to \"The Jaguars\", they made their debut with \"Want You See Again (君に会いたい, Kiminiaitai)\" at Philips Records. After the band dissolved in 1971, Shin became a solo singer and retired in 1973. After that, he continued his musical carrer in a band with Paul Daigenji and others, and while he was active as an actor, Shin also ran a high-class membership club in Kabukicho, Tokyo. With the reunion of original band in 1981, he was energetically performing live stage and TV appearances. Shin even joined the Tigers Memorial Club Band in 1988. On April 19, 2009, one day before his 60th birthday, an acquaintance woman was found his dead body in a bathtub in his apartment in Atsugi. It was not incidental, and it was subsequently determined that he had heart failure while taking a bath. According to psychiatrist and former member of the The Folk Crusaders Osamu Kitayama, confirmed to the Asahi Shimbun news article that Shin did in fact died from a heart failure. He was 59 years old at the time of his death, one day before he was 60. According to Hisayuki Okitsu, a member guitarist of The Jaguars who has been friend with Shin for more than 40 years, Shin Okamoto has been battling with illness for the past few years, including repeated hospitalizations and discharges due to poor pancreas. He also suffered from pancreatitis two months before his death. His last TV appearance was \"BS Eternal Music Complete Works-Group Sounds Complete Works-\" (aired on NHK BS 2 Television), which was broadcast on February 27, 2009, 3 months before he died. Shin Okamoto appeared solo on this program and sang \"Want To See Again.\" The Ameba Blog was newly established on March 8, 2009, and the first entry was on April 21, 2009, and the obituary article of the person himself became the first article. On May 20, 2009, a funeral was held in Tokyo, and Shin Okamoto said in his final words to Dr. Kitayama at the hospital, \"I want to send a message with my music companions on August 13\" from a member of The Jaguars at this seat. It was announced that a music funeral will be held on August 13, 2009. Category:1949 births Category:2009 deaths Category:Japanese musicians",
 "title": "Shin Okamoto"
}