{
 "id": "844500",
 "text": "The Portugal national under-21 football team is the national under-21 football team of Portugal. It is controlled by the Portuguese Football Federation (FPF). They are nicknamed \"Esperanças,\" which means hope, as they are Portugal's hopes for the future. ==Competitive record== ===UEFA European Under-21 Championship=== Year Round Position Games Won Drawn Lost 1978 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1980 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1982 Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter Did not enter 1984 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1986 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1988 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1990 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1992 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 1994 Runners-up 2nd 4 3 0 1 7 2 1996 Quarter-finals 7th 2 1 0 1 1 2 1998 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2000 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2002 Group stage 5th 3 1 1 1 4 4 2004 Third place 3rd 5 2 1 2 9 11 2006 Group stage 6th 3 1 0 2 1 3 2007 Group stage 6th 4 1 2 1 5 2 2009 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2011 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2013 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2015 Runners-up 2nd 5 2 3 0 7 1 2017 Group stage 3 2 0 1 7 5 2019 Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify Did not qualify 2021 Qualified Qualified Qualified Qualified Qualified Qualified Qualified Qualified Total Runners-up 8/20 29 13 7 10 41 30 :*Denotes draws include knockout matches decided on penalty kicks. :**Gold background colour indicates that the tournament was won. :***Red border color indicates tournament was held in Portugal\" ==Player records== ===Top appearances=== Rank Player Club(s) Year(s) U-21 Caps 1 Manuel Fernandes Benfica, Portsmouth, Everton, Valencia 2004–2008 30 2 Silvestre Varela Sporting CP, Casa Pia, Vitória Setúbal 2004–2007 28 Ricardo Quaresma Sporting CP, Barcelona, Porto 2002–2006 28 João Pereira Benfica, Gil Vicente, Braga 2004–2008 28 Fernando Brassard Marítimo, Gil Vicente, Vitória Guimarães 1991–1994 28 6 Hugo Almeida Porto, União Leiria, Boavista, Werder Bremen 2002–2007 27 7 Ednilson Roma, Benfica 2000–2003 26 Raul Meireles Aves, Boavista, Porto 2003–2006 26 9 Edgar Alverca, Real Madrid, Málaga 1997–1999 25 Cândido Costa Porto, Vitória Setúbal, Derby County 2000–2004 25 Note: Club(s) represents the clubs during the player's time in the Under-21s. ===Top goalscorers=== Rank Player Club(s) Year(s) U-21 Goals 1 Hugo Almeida Porto, União Leiria, Boavista, Werder Bremen 2002–2007 16 2 Hélder Postiga Porto, Tottenham 2001–2003 12 Toni Porto, Braga 1992–1994 12 4 Paulo Costa Alverca, Inter Milan, Reggina, Porto 2000–2002 9 5 Simão Sabrosa Sporting CP, Barcelona 1998–2001 8 Rui Fonte Arsenal, Crystal Palace, Sporting CP, Vitória Setúbal, Espanyol 2008–2012 8 7 Orlando Sá Braga, Porto 2008–2010 7 Miguel Bruno Feirense, Paços Ferreira, Beira-Mar 1992–1994 7 Dani Sporting CP, West Ham United, Ajax 1995–1996 7 Ivan Cavaleiro Benfica, Deportivo La Coruña 2013–2015 7 Note: Club(s) represents the clubs during the player's time in the Under-21s. ==Head coaches== Manager Period Record Record Record Record Record Record Record Record Manager Period José Alberto Costa –1993 Nelo Vingada 1994–1996 Jesualdo Ferreira 1996–2000 Agostinho Oliveira 2000–2002 Rui Caçador 2002 José Romão 2002–2004 Rui Caçador 2004 Agostinho Oliveira 2004–2006 José Couceiro 2006–2007 Rui Caçador 2007–2009 Oceano Cruz 2009–2010 Rui Jorge 2010–present ==Honours== * UEFA Under-21 European Championship: 2015 (runner-up) ==References== ==Other websites== * Official site * UEFA Under-21 website Contains full results archive * The Rec.Sport.Soccer Statistics Foundation Contains full record of U-21/U-23 Championships. Category:National under-21 football teams Category:Football in Portugal Category:National youth sports teams of Portugal",
 "title": "Portugal national under-21 football team"
}