{
 "id": "844697",
 "text": "Cyclonic Storm Yaas ( ) was a tropical cyclone in the Bay of Bengal. It wad the third depression, second deep depression, and second cyclonic storm of the 2021 North Indian Ocean cyclone season, Yaas formed from a disturbance that the Indian Meteorological Department first monitored on May 23. Conditions in the basin favored development as the system became a deep depression by that day before intensifying to a cyclonic storm on the next day, being named Yaas. Yaas (or Yass) is the name given by Oman, which means a fragrant flowering plant used for traditional medicine in Oman and many countries in the West of Asia. The common name outside Arab Countries is Myrtle. In preparations for the storm, many electrical companies were prepared additional generators and transformers for possible electrical problems. Evacuations were also ordered, starting on May 24 on low-lying areas in East Midnapore and West Midnapore and Jhargram. In India, Union Power Ministry prepared for transformer and generators for restoration of electricity. The Health Ministry also prepared to ensure no disruption in vaccine supplement and COVID 19 treatment. The Ministry of Telecommunication has also kept all telecom towers and exchanges under watch. Prime Minister Narendra Modi also arranged an emergency meeting to prepare for the cyclone. The NDRF deployed 65 teams with another 20 teams on reserve. Rescue and relief teams of the Indian army, navy and the coast guard were also deployed over the coastal districts of Odisha and West Bengal. CESC stayed on guard for the cyclone to ensure uninterrupted service especially for major hospitals and critical establishments like drainage pumping stations. Additionally, Northern Railway cancelled many trains from New Delhi to and from Bhubaneswar and Puri. Meanwhile, Western Railways and Southern Railways had also cancelled trains going to and from to Odisha. In Bangladesh, 114 Medical teams was deployed for emergency response by the government. 349 shelters were setup, which accommodated half the capacity of people to maintain Covid-19 health restrictions. == References == Category:North Indian Ocean cyclones Category:Tropical cyclones in Asia Category:2021 in Asia Category:2021 in India Category:2021 in weather",
 "title": "Cyclone Yaas"
}