{
 "id": "844950",
 "text": "Akiko Nakamura (中村 晃子, Nakamura Akiko; born January 3, 1945) is a Japanese actress, singer and voice actress. She was born in Narashino City, Chiba Prefecture. Her nickname is Akko (アッコ). Her favorite hobbies are golf, tennis and table tennis. She works with Berg Corporation as talent manager. Graduated from the Showa Gakuin Junior & Senior High School. == Biography == In 1963, Akiko joined Shochiku and made her first film debut when she was selected as a semi-miss in the 2nd Miss Air France Contest while she was in high school. She appeared in many movies and was sold in combination with Masakazu Tamura from 1965 to 1966, but they did not sprout each other and were unimpressive. Akiko also appeared in The Drifters films. At that time, she was also interested liked foreign cars, mostly Opel. ===Song debut=== Akiko made her first song debut in 1965 with \"Blue Fallen Leaves\" (青い落葉, Aoi rakuyō). Her most famous song would be Rainbow Lake (虹色の湖, Nijiiro no mizūmi) in 1967. During the heyday of Group Sounds, she sold 800,000 copies as a female solo singer. This song became her biggest hit and climbed up to number three on the chart. At that time, she dressed her style from miniskirts to military uniforms. Her next 1968 single \"Sand Cross\" (砂の十字架, Suna no jūjika) was also became a success. At the end of 1968, Akiko participated in the 19th NHK Kouhaku Uta Gassen for her song \"Rainbow Lake\". She said she couldn't appear on NHK because she was singing with a navel look. Akiko became a voice actress in 1969 with for the American comedy drama classic series, \"I Dream of Jeannie\" (voiced over Barbara Eden). In 1971, she also sing the theme song for the \"Beautiful Challenger\" (which was aired on TBS). The first nude was announced in her 20s. In 1973, Akiko sung the cover song \"Parole, parole (あまい囁き, Amai sasayaki)\" by a duet with Toshiyuki Hosokawa became a hit. ===Movies=== In 1974, Akiko released \"The Whisper of the Rose\" (薔薇の囁き, Bara no sasayaki), but she recalls that the style when singing in a black dress with a half-naked visible in the album cover. It is said that this style was for Nakamura to adore French actress Mireille Darc and get closer to her atmosphere. In 1980, \"Love Rope\" (恋の綱わたり, Koi no tsuna watari) (in TBS drama \"Divorce Friends\" insert song) also recorded 4th place, and became a hit for a long time with over 300,000 copies being sold. In addition, she was ranked in the TBS song program \"The Best Ten\" with the same title song. In 1987, she starred in the film \"Machi nureta onna\" as Tsuya. Also, as a voice actress, Akiko voiced Farrah Fawcet in \"Charlie's Angels\". In her later years, she also voiced Whoopi Goldberg in \"Sister Act\". ===Dramas=== As an actress, she made regular appearances in the TV drama \"Shadow Warriors III\" and expanded her career to historical drama. In 1994, she released her nude for the first time in a long time since her 20s and gained popularity. In this hair nude photo book, she worked on storyboards herself and became a hot topic. She return to Narashino with her younger brothers and set up a mansion. In 2002, Akiko was introduced in the \"Mister-Chin's Mansion Visit\" section of the TBS-based lifestyle information program \"Just,\" and talked about the introduction of a private elevator. On November 3, 2011, she continued to be a singer, such as appearing in \"Thursday 8 o'clock concert-masterpiece! Nippon no Uta-\" (TV Tokyo). == Family == In the middle of one brother and one younger brother, Yukiko Murayama (Tokoko) is an opera singer under the stage name Tamaki Miura. She was a celebrity who also released records, but she stopped singing in the middle of her career due to the Vietnam War. Akiko's father is a police officer and opposes Akiko's entry into the entertainment world. Akiko's mother (who was a hairdresser) also opposed it at first, but when her daughter's acting debut was decided, she changed her mind and supported her entertainment activities and gave singing advice. She continued supporting Akiko until her death on March 10, 1995 at the age of 85. The piano used by her mother is preserved in Akiko's residence. On January 27, 1969, in the live broadcast song program \"Yoru no Hit Studio\" of the Fuji TV series, in the \"Computer Lover Fortune-Telling\" section, with moderator Takehiko Maeda of the same program was selected as \"the most compatible person\". Immediately after that, Nakamura was upset and ended up singing the new song \"Tears of the Forest\" (涙の森の物語, Namida no mori no monogatari) while crying, and Maeda wiped Nakamura's tears with a handkerchief on the way. == Albums == * See her albums on Discogs == Films == * All films and TV series on IMDb Category:1945 births Category:Living people Category:Japanese singers Category:Japanese voice actors Category:Actors from Chiba Prefecture",
 "title": "Akiko Nakamura"
}