{
 "id": "84496",
 "text": "The AH-64 Apache is an attack helicopter that first flew in 1975 and has been produced since 1984. It was designed by Hughes Helicopters, but that later became McDonnell Douglas, which later became Boeing. It is designed to attack targets on the ground to help soldiers. To do this, it can carry 16 AGM-114 Hellfire missiles, along with rocket pods, and a 30mm chain gun that can fire 625 rounds per minute. It can carry 1,200 bullets. It can also carry missiles like the AIM-9 Sidewinder to engage and shoot down targets in the air if it is attacked, such as by fighter aircraft or other helicopters. == AH-64 Details == The AH-64 Apache is 49.11 feet (14.97 meters) long, 17.16 feet (5.23 meters) wide, and 16.24 feet (4.95 meters) tall. Without anything, it weighs 11,799 pounds (5,352 kilograms). Full, it weighs up to 22,282 pounds (10,107 kilograms). It is powered by 2 General Electric T700-GE-701C engines. It can go 162 miles per hour (261 kilometers per hour), can fly 1,181 miles (1,900 kilometers) without refueling, can fly 9,478 feet (2,889 meters) high, and can climb 2,415 feet a minute (736 meters a minute). == AH-64 Users == The AH-64 Apache is mostly used by the United States, with over 800 aircraft. It is also used by the United Kingdom (around 50 aircraft), Israel, Egypt, South Korea, Saudi Arabia, the United Arab Emirates, the Netherlands, Kuwait, Greece, Australia, Japan and Singapore (among others). == Concept and Building History == The need of a new and highly secure helicopter was first felt in the beginning of the 1990s. The great military power, the British Army, identified this need and by February 1993 they finalised the need with an invitation to bid for the design, construction and trial of the new concept. Among the bidding companies were: Boeing and Sikorsky with the RAH-66 Comanche, Agusta with the A129 Mangusta, British Aerospace and Eurocopter with the Tiger, GEC Marconi and Bell Helicopter with the Cobra Venom, and Westland and McDonnell Douglas with the AH-64 Apache. The decision was taken later in July in 2005 and the winning aircraft builder was Westland and McDonnell Douglas with the Apache. One year later in 2006 the two Parties signed a contract to make 67 helicopters. This is how the WAH-64D Apache era started. The 67 WAH-64D Apache attack helicopters were built by the merged companies Boeing and McDonnell Douglas (1997) and Westland between 1999 and 2004. The first aircraft was built by Boeing and delivered to the Army in March 1999, followed by the Westland, who built their first aircraft in 2000 and delivered in July 2000. The last aircraft was built and delivered in July 2004. == Service history == === Gulf War === During the Gulf War, US army Apache helicopters attacked radar sites and the anti-aircraft guns they came with. This allowed the US Air Force’s F-15 Eagles and B-52 bombers to fly into Iraqi airspace without danger. The Apaches are very good at attacking tanks, and in the Battle of Medina Ridge the helicopters destroyed more than 30 Iraqi tanks that were attempting an ambush.The helicopters performed a ‘deep attack’; moving in and attacking targets deep behind enemy lines. === Iraq war and a new role for the apache. === In the Iraq war a group of AH-64 helicopters was ambushed at najaf when flying deep behind iraqi lines.in the ambush the group was attacked by anti aircraft guns and small arms.After this some helicopters had to be fixed and one helicopter was downed with the two pilots of the downed aircraft being captured.Because of this critics of the helicopter told the army that the helicopters should not be behind enemy lines since they are to easy to shoot down.Instead they said that the helicopters should just do CAS and reconnaissance.The critics thought the idea of attack helicopters flying deep behind enemy lines was a bad one made from cold war planning.Others argued that the ambush at najaf would not happen again and nothing needed to be changed.The US army did a attack on the city again with the apache helicopters,artillery and F-18 jets.This time the army bombarded the iraqis with artillery for 4 minutes.When the apaches attacked they did not slow down to fire their missiles.The F-18 jets guarded the helicopter group sides and destroyed vehicles and anti aircraft guns the apaches found.7 anti aircraft guns were destroyed along with 3 artillery,5 radars and 25 other vehicles.No helicopters were downed.Because of this battle and other battles like it the army said that the apache helicopters were very good for the war. “One key question is whether the loss of tactical surprise (At the ambush at najaf) was a freak incident or more typical of what can be expected of an alert enemy in the future.”- Anthony H. Cordesman of the Center for Strategic and International Studies After this controversy the army mostly used the helicopters for CAS,reconnaissance and protecting supply lines and the sides of a formation.Now if a apache spotted dangerous targets like anti aircraft sites if would call a fighter jet like a f16 or f-18 to kill the target.As of 2003 The army considers apaches to be very good and it prefers them over artillery == References == Category:Military aviation Category:Helicopters Category:Military of Japan Category:Israel Defense Forces Category:Netherlands Category:Greece Category:United Arab Emirates Category:Military of Saudi Arabia Category:British military aircraft Category:United States military aircraft",
 "title": "Boeing AH-64 Apache"
}