{
 "id": "845022",
 "text": "Gilbert Étienne (22 June 1928 – 17 May 2014) was a French economist, author and professor. Étienne is best known for his extensive publishing on economic subjects. == Early life == Étienne was born in Neuchâtel-Urtiére, France. His first studies were in law, and he received a degree from the University of Neuchâtel in 1951. Following this, he studied at the National Institute of Oriental Languages and Civilizations (Inalco) in Paris. As a student of Inalco he spent a year doing doctoral research (from 1952 to 1953) in India and Pakistan. In 1955 he defended his doctoral thesis India: economy and population, which was published the following year by Droz. == Academic career == After his graduation in 1955, he took a two-year trip to India, where he worked as a representative of the Swiss watch company Favre-Leuba. On his return to Switzerland in 1958 he became a lecturer at the Graduate Institute of International Studies (IUHEI) in Geneva. He became a professor at the same establishment in 1964, after the publication of his book The Chinese Way. He stayed at IUHEI until the end of his career in 1994. From 1979 to 2002 he was the president of the Swiss Association for development aid, Frères de nos frères. == Death and legacy == Étienne died on 17 May 2014 in Geneva. A prolific author, Étienne published over 40 books and 100 journal articles in his lifetime. His final book, Indian Villages Achievements and Alarm Bells, 1952–2012, was published as a posthumous tribute in 2014. == Selected publications == * 2007, China-India: the great competition * 2003, Development against the current * 2002, Unpredictable Afghanistan * 1998, Chine-Inde: le match du siècle * 1996, The Economy of India * 1989, Pakistan, a gift from the Indus: economy and politics * 1988, Food and Poverty:India's Half Won Battle * 1985, Rural development in Asia: Meetings with Peasants * 1982, Rural development in Asia: people, grain and tools * 1974, The Chinese way: the long march of the economy / La voie chinoise. La longue marche de l'économie, 1949-1974 * 1969, A Review of Rural Cooperation in Developing Areas * 1969, Les Chances de l'Inde * 1968, Studies in Indian Agriculture– The Art of the Possible * 1962, Tiers Monde, la voie chinoise * 1959, De Caboul à Pékin: rythmes et perspectives d'expansion économique * 1956, India: economy and population == References == == Notes == == Other websites == * Gilbert Etienne - Mainstream Category:French economists Category:1928 births Category:2014 deaths",
 "title": "Gilbert Etienne"
}