{
 "id": "845018",
 "text": "The 2019 CONCACAF Gold Cup was the 15th edition of the CONCACAF Gold Cup. The tournament was mostly played in the United States, although some matches were played in Jamaica and Costa Rica. CONCACAF announced that the tournament would expand to 16 teams from 12 in February 2018. Mexico won their 8th Gold Cup with a 1-0 victory over the U.S. in the final. == Qualified teams == For this edition, The qualification system was changed. Teams were no longer divided into Central American and Caribbean zones. Among the 16 teams, six qualified directly after participating in the 2018 FIFA World Cup qualification, while the other 10 teams qualified through the 2019–20 CONCACAF Nations League qualification. Bermuda and Guyana made their Gold Cup debuts. Team Qualification Date of qualification Gold Cup appearances Last appearance Previous best Gold Cup performance FIFA Ranking at start of event CONCACAF Ranking at start of event 15th 2017 (1993, 1996, 1998, 2003, 2009, 2011, 2015) 18 1 (co-hosts) 14th 2017 (2002) 39 3 9th 2017 (2005, 2013) 75 5 14th 2017 (1991) 61 4 (defending champions & co-hosts) 15th 2017 (1991, 2002, 2005, 2007, 2013, 2017) 30 2 10th 2015 (2000) 92 11 7th 2015 (2002, 2009) 101 10 14th 2017 (2000) 78 6 6th 2017 (2002) N/A 12 2nd 2017 (2017) 79 15 1st None 174 20 9th 2015 (2003, 2013, 2015) 175 13 1st None 177 22 11th 2017 (2015, 2017) 54 7 3rd 2017 (2009, 2017) 129 14 11th 2017 (2002, 2003, 2011, 2013, 2017) 69 9 == Stadiums == In May 2018, CONCACAF confirmed that matches would be held in Central America and the Caribbean in addition to the United States. This was the first time that the Gold Cup was held in the Caribbean. All the previous editions took place in the United States, Mexico, or Canada. === United States === In May 2018, CONCACAF announced the fifteen venues in the United States that would host matches. Soldier Field in Chicago was announced on 27 September 2018 as the venue of the final. Stadium Capacity Location Rose Bowl 90,888 Pasadena, California Broncos Stadium at Mile High 76,125 Denver, Colorado NRG Stadium 71,795 Houston, Texas BBVA Stadium 22,039 Houston, Texas Bank of America Stadium 75,525 Charlotte, North Carolina Lincoln Financial Field 69,176 Philadelphia Nissan Stadium 69,143 Nashville, Tennessee FirstEnergy Stadium 67,895 Cleveland, Ohio State Farm Stadium 63,400 Phoenix, Arizona Soldier Field 61,500 Chicago, Illinois Red Bull Arena 25,000 New York City Banc of California Stadium 22,000 Los Angeles Toyota Stadium 20,500 Frisco, Texas Allianz Field 19,400 Saint Paul, Minnesota Children's Mercy Park 18,467 Kansas City, Missouri === Costa Rica === On 26 November 2018, CONCACAF announced that Costa Rica would host a double-header in the first round of matches of Group B on 16 June 2019, taking place at the Estadio Nacional de Costa Rica in San José. Stadium Capacity Location Estadio Nacional de Costa Rica 35,175 San José === Jamaica === On 2 April 2019, CONCACAF announced that Jamaica would host a double-header in the first round of matches of Group C on 17 June 2019, taking place at the Independence Park in Kingston. Stadium Capacity Location Independence Park 35,000 Kingston == Group Stage == === Group A === === Group B === === Group C === === Group D === == Knockout Stage == === Winners === == References == Category:Association football templates Category:2019 in association football",
 "title": "2019 CONCACAF Gold Cup"
}