{
 "id": "845352",
 "text": "The Loiyumpa Silyel (Modern Meitei: \"Loiyumba Sinyen\"), also termed as the Loyumpa Silyel (Modern Meitei: \"Loyumba Sinyen\") or the Loiyumpa Shilyel (Modern Meitei: \"Loiyumba Shinyen\") or the Loyumpa Shilyel (Modern Meitei: \"Loyumba Shinyen\") or the Loyamba Sinyen (), is an 11th-12th century written constitution, regulated in the Manipur kingdom during the regime of King Loiyumba (1074-1122 CE). A promulgation of the proto-constitution in 429 CE by King Naophangba was reduced to a final format in 1110 CE. Historically, it is the first written constitution, and one of the well recorded antique manuscripts of the kingdom. Its Constitutionalism was replaced by the Manipur State Constitution Act, 1947, that was functional until Manipur was merged into India on October 15, 1949. It includes the accounts of the distribution of the duties to the subjects of the king. Its rules and regulations remains to be an authoritative work in the Meitei social system till the present day Manipur. == Religious duties == The following is the list of Meitei families who were given the duties of serving particular pantheons of gods and goddesses of the ancient Meitei religion. Selected Families Latin-Roman transliteration Deities to be served Latin-Roman transliteration ꯍꯩꯔꯣꯝ Heirom ꯃꯩꯔꯩꯃ Meireima ꯏꯔꯣꯝ Irom ꯈꯝꯂꯥꯡꯕ Khamlangba ꯁꯣꯔꯦꯜꯁꯪꯕꯝ Sorelsangbam ꯁꯣꯔꯥꯔꯦꯟ Soraren ꯁꯔꯥꯡ ꯂꯩꯁꯥꯡꯊꯦꯝ Sharang Leishangthem* ꯂꯟꯃꯥꯕꯤ Lanmabee ꯁꯔꯣꯠꯈꯥꯏꯕꯝ Sharotkhaibam ꯐꯧꯑꯣꯏꯕꯤ Phouoibi ꯄꯣꯠꯁꯪꯕꯝ Potshangbam ꯁꯪꯂꯥꯡꯃꯩ (ꯀꯪꯂꯥ) Shanglangmei (Kangla) ꯃꯣꯏꯔꯥꯡ ꯄꯨꯈ꯭ꯔꯝꯕꯝ Moirang Pukhrambam ꯀꯨꯠꯆꯨ (ꯋꯥꯌꯦꯟꯁꯪ) Kutchu (Wayenshang) ꯁꯧꯕꯝ Shoubam ꯃꯋꯥꯎ ꯂꯩꯃ Mawao Leima ꯍꯩꯁ꯭ꯅꯥꯝ Heishnam ꯄꯥꯟꯊꯣꯏꯕꯤ Panthoibi ꯈꯣꯏꯁꯅꯥꯝ Khoisanam ꯄꯦꯇꯪꯉꯥ Petangnga ꯇꯥꯏꯕꯪꯖꯝ Taibangjam ꯂꯥꯏꯈꯨꯔꯦꯝꯕꯤ Laikhurembi ꯀꯣꯟꯊꯧꯖꯝ Konthoujam ꯍꯨꯏꯃꯨꯔꯩꯃ Huimureima ꯑꯁꯥꯡꯕꯝ Ashangbam ꯂꯥꯏꯅꯥꯎꯇꯥꯕꯤ Lainaotabi ꯆꯤꯡꯈꯥꯝ Chingkham ꯅꯨꯡꯊꯦꯜꯂꯩꯃ Nugthelleima ꯑꯔꯥꯝꯕꯝ Arambam ꯁꯧꯕꯣꯟ ꯂꯩꯃ Shoubon Leima ꯌꯦꯟꯈꯣꯝ ꯐꯤꯁꯥꯕꯝ Yenkhom Phisabam ꯑꯋꯥꯡꯕ (ꯂꯥꯏ ꯑꯋꯥꯡꯕ) Awangba ꯂꯨꯋꯥꯡꯁꯪꯕꯝ Luwangshangbam ꯂꯨꯋꯥꯡ ꯆꯤꯡ Luwang Ching (idolized) ꯁꯤꯅꯥꯝ ꯂꯥꯏꯁꯪꯕꯝ Sinam Laishangbam* ꯂꯥꯏꯅꯤꯡꯊꯧ Lainingthou ꯃꯣꯏꯔꯥꯡꯊꯦꯝ ꯄꯨꯊꯦꯝ Moirangthem Puthem* ꯄꯨꯊꯤꯕ Puthiba (idolized) ꯃꯪꯁꯥꯇꯥꯕꯝ Mangsatabam ꯄꯨꯔꯩꯔꯣꯝꯕ Pureiromba ꯂꯪꯃꯥꯏꯊꯦꯝ Langmaithem ꯇꯦꯟꯂꯣꯡꯕ Tenlongba ꯉꯔꯥꯡꯌꯥꯟꯄꯝ Ngarangyanpam ꯊꯣꯡꯉꯥꯛ Thongak ꯅꯥꯀꯜꯕꯝ Nakalbam ꯆꯤꯡꯀꯣꯜ ꯅꯤꯡꯊꯧ Chingkol Ningthou ꯈꯨꯔꯥꯏꯖꯝ Khuraijam ꯆꯤꯡꯕꯥꯜ ꯂꯩꯃ Chingbal Leima ꯃꯩꯌꯦꯡꯕꯝ Meiyengbam ꯌꯥꯎꯔꯩꯕꯤ Yaoreibi ꯂꯩꯁꯥꯡꯊꯦꯝ Leishangthem* ꯀꯧꯕꯔꯦꯜ Koubarel ꯅꯤꯡꯊꯧꯖꯝ Ningthoujam* ꯅꯨꯃꯤꯠ ꯂꯩꯃ Numit Leima ꯄꯨꯛꯀꯂꯕꯝ Pukkalabam ꯀꯧꯕ꯭ꯔꯨ Koubru ꯆꯦꯡꯂꯩ ꯂꯥꯏꯁꯥꯡꯕꯝ Chenglei Laishangbam* ꯃꯥꯔꯖꯤꯡ Marjing ꯃꯣꯏꯔꯥꯡꯊꯦꯝ Moirangthem* ꯃꯣꯏꯔꯥꯡ ꯐꯛꯇꯣꯝ ꯑꯔꯤꯕ Moirang Phaktom Ariba ꯀꯥꯡꯄꯨꯆꯝ Kangpucham ꯍꯣꯡꯅꯦꯝꯌꯣꯏ ꯈꯨꯟꯖꯥꯎ Hongnemyoi Khunjao ꯆꯤꯡꯈꯥꯜꯕꯝ Chingkhalbam ꯆꯤꯡꯉꯥ Chinga ꯂꯣꯡꯖꯝ ꯐꯩꯔꯣꯏꯖꯝ Longjam Pheiroijam ꯂꯥꯡꯖꯤꯡ Langjing ꯇꯦꯛꯆꯝ Tekcham ꯂꯥꯡꯉꯣꯜ Langgol ꯅꯣꯡꯃꯥꯏꯊꯦꯝ Nongmaithem ꯅꯣꯡꯃꯥꯏꯆꯤꯡ (ꯂꯪꯃꯥꯏꯆꯤꯡ) Nongmaiching (Langmaiching) ꯅꯤꯡꯊꯧꯖꯝ Ningthoujam* ꯆꯤꯡꯉꯥ ꯂꯩꯃ Chinga Leima ꯍꯩꯊꯧ ꯈꯣꯡꯇꯦꯛꯆꯝ Heithou Khongtekcham ꯂꯥꯡꯆꯤꯡ ꯍꯤꯌꯥꯡꯊꯧ ꯂꯩꯃ Langching Hiyangthou Leima ꯊꯥꯎꯄꯤꯆꯝ Thaopicham ꯌꯨꯝꯖꯥꯎ ꯂꯩꯃ Yumjao Leima According to the Loiyumpa Silyel Constitution, 1\\. Heirom family worships Meireima.Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 7–11 2\\. Irom family worships Khanglangba. 3\\. Sorelsangbam family worships Shorarel (heaven). 4\\. Sharang Leishangthem family worships Lammabee. 5\\. Sharotkhaibam family worships Phouoibi (goddess for paddy). 6\\. Potshangbam family worships Shanglang-mei (Kangla). 7\\. Moirang Pukhrambam family worships Kutchu (Wayenshang). 8\\. Shoubam family worships Mawao Leima. 9\\. Heishnam family worships Panthoibi (most adored Meetei goddess). 10\\. Khoisanam family worships Pet-angnga. 11\\. Taibangjam family worships Laikhurembee. 12\\. Konthoujam family worships Huimureima. 13\\. Ashangbam family worships Lainaotabi. 14\\. Chingkhwam family worships Nungthelleima. 15\\. Arambam family worships Shoubonleima. 16\\. Yenkhom Phisabam family worships Awangba (deity Lai-wangba). 17\\. Luwangshangbam family worships Luwaang Ching. 18\\. Sinam Laishangbam family worships Lainingthou. 19\\. Moirangthem Puthem family worships Puthiba. 20\\. Mangsatabam family worships Pureiromba. 21\\. Langmaithem family worships Tenlongba. 22\\. Ngarangyanpam family worships Thongak. 23\\. Nakalbam family worships Chingkol-Ningthou. 24\\. Khuraijam family worships Chingbal Leima. 25\\. Meiyengbam family worships Yaoreibi. 26\\. Leishangthem family worships Koubarel. 27\\. Ningthoujam family worships Numitleima. 28\\. Pukkalabam family worships Koubru. 29\\. Chenglei- Laishangbam family worships Marjing. 30\\. Moirangthem family worships Moirang Phaktom Ariba. 31\\. Kangpucham family worships Hongnemyoi Khunjao. 32\\. Chingkhalbam family worships Chinga. 33\\. Longjam Pheiroijam family worships Langjing. 34\\. Tekcham family worships Langgol. 35\\. Nongmaithem family worships Langmaicheeng (Nongmaijing). 36\\. Ningthoujam family worships Chinga Leima. 37\\. Heithou and Khongtekcham families worship Langching Hiyangthou Leima. 38\\. Thaopicham family worships Yumjao Lairemma. == Family wise obligation of Maiba priesthood == According to the Loiyumpa Silyel Constitution,Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 7–11 1\\. Asheibam family is responsible for attending to the cleansing of the monarch. 2\\. Aram-bam family is responsible for taking care of the bathe. 3\\. Toibicham family is responsible for playing the Tharaochi (Meetei musical instrument). 4\\. Arupam (Arubam) family is responsible for maintaining cleanliness and purity. 5\\. Aheibam family is responsible for making the Pukhamnati (plate with decorated rim). 6\\. Loukham family is responsible for drawing the Meiba (Meetei device to produce fire). 7\\. Maibathiyam family is responsible for throwing the Shingkhai (Meetei prognostication-device) and entering the trance of dream. 8\\. Meihoubam family is responsible for igniting the fire. 9\\. Meiphuwam family is responsible for blowing in the fire. 10\\. Tokpam family is responsible for digging in the soil. 11\\. Tokpuram (Tokpram) and Thangsabam families are responsible for piling up the earth. 12\\. Naoroibam family is responsible for taking the baby in custody. 13\\. Ngathem family is responsible for calling the Ngami (beckoning the fishes). 14\\. Shingkhangpam family is responsible for fetching the dry wood fuels. 15\\. Haomukpam family is responsible for making the phak (mattress for sitting). 16\\. Khoirisungbam family is responsible for weaving the Khoiriphi (Meetei cloth). 17\\. Khoiriyanpam family is responsible for severing the umbilical cord. 18\\. Lairencham family is responsible for washing the black clothes. 19\\. Thoupicham family is responsible for managing the plantain leaves. 20\\. Leishaonbam family is responsible for making the boats. 21\\. Yelwam family is responsible for taking in the hen. 22\\. Nganukappam family is responsible for looking after the Nganu (duck). 23\\. Khugolthem family is responsible for carrying back the hameng (goats). 24\\. Okrambam family is responsible for taking back the Ok (pig). 25\\. Waleppam (Wareppam) family is responsible for adoring the bamboo. 26\\. Maibam family is responsible for invoking the Chupshaba (priest’s invocation for cessation of recurrent deaths). 27\\. Ngangom family is responsible for throwing the Konyai (gold and silver device used by the priest). 28\\. Yenkokpam family is responsible for descending the yerum (egg) to the earth (forecast device). 29\\. Khumukcham family is responsible for taming the tiger. 30\\. Khaidem family is responsible for supervising the body under cremation. 31\\. Amakcham family is responsible for taking hold of the bow and arrow. 32\\. Mangshatabam family is responsible for supervising the grave. 33\\. Wanglenbam family is responsible for beating the drum. 34\\. Kabrambam family is responsible for managing the Leishoupung (mount of aerated soil). 35\\. Kontenakathang priest family is responsible for preparing the Chup for the deity. 36\\. Shoukrakpam family is responsible for making the chaphuwalong (pot). 37\\. Ngaseppam family is responsible for slicing the fishes. 38\\. Thingnongchaorong priest family is responsible for worshipping the Lainingthouhanba. == Duties of the Tampak Maiba groups (people's priests) == 1\\. Khabalangthangchakaba Wamaiba group is responsible for idolizing the Naohal Ahalba (sylvan deity). 2\\. Jagoiwa priest group is responsible for deifying the Koubarel. 3\\. Langmei priest (Luwang Maiba) group is responsible for worshipping the Chakhaba. 4\\. Thongnangkaipiya priest group is responsible for deifying the Muwaningthou. 5\\. Khayoipariyang priest group is responsible for worshipping the Marjing. 6\\. Loiyamsanggai priest group is responsible for glorifying the Koubru. 7\\. Asheibam group is responsible for chanting sanalamok (hymn for deities). 8\\. Ashem Ngakhakhoi group is responsible for chanting the Yakei Eshei (Yakairol). 9\\. Paobam group is responsible for listening to the message of god at Paodahidel. 10\\. Laishram group is responsible for paying service to the Santhong. 11\\. Lantham group is responsible for singing the Lalpha song (song regarding victory in war). 12\\. Khraijam group is responsible for looking after the Khraithong (gate). 13\\. Akhongbam group is responsible for beating the Khong (musical instrument used in Chakpa sylvan festival). 14\\. Mutum group is responsible for idolizing the Lalhampung (Lalambung). 15\\. Thingnam group is responsible for deifying the Ukrong. 16\\. Shingkham group is responsible for singing the Langmairol. 17\\. Thongam group is responsible for singing the Ahonglon (song for the god Sanamahi). 18\\. Shoraisham group is responsible for singing the Khoichulamok lamkok (song in the sylvan festival). 19\\. Chandam group is responsible for singing the Khongchinglon (for the festival of Moirang Thangjing). 20\\. Thiyam group is responsible for adoring the boat. 21\\. Apucham group is responsible for paying homage to Pukshri (a paddy-eating worm in the field). 22\\. Nongpokpam group is responsible for invoking the rain god. 23\\. Waikhom group is responsible for gathering the husk. 24\\. Akoijam group is responsible for singing the hymn of Mikol (a song that harmonizes the soul and spirit). 25\\. Salam group is responsible for idolizing the Langmaiching (Nongmaijing mountain) and acting the role of Tangkhul Sharam Pakhangba (Nongpokningthou- king of the east). 26\\. Hidam group is responsible for making the Sanaliphak (royal mattress). 27\\. Khamnam group is responsible for offering the Khamnungcheiyom (offering at the royal grave). 28\\. Amaipi group is responsible for offering the Leiraiyu (offering to the local deity). 29\\. Nongton Amaibi group is responsible for dipping in the Laija Phuhing (offering of Khayomlapkpa by use of unburnt earthen pot). 30\\. Phura Amaibi group is responsible for entering the trance of Phura Laiyum and listening to the Mang (Meetei way of receiving oracle through the Maibis, white robed). == Gallery == File:1st page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:2nd page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:3rd page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:4th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:5th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:6th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:7th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:8th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:9th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:10th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:11th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:12th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:13th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:14th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:15th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:16th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:17th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:18th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg File:19th page - The Loiyumpa Silyel - finalised in 12th century CE - drafted in 429 CE - written Constitution - Classical Meitei language - Traditional Meetei Mayek script - Ningthouja dynasty - Kangleipak civilization.jpg == Related pages == * Cyrus the Great * Hammurabi * Magna Carta == References == == Other websites == * Loiyumpa Silyel at English Wiktionary Category:Meitei culture Category:History of Manipur Category:Constitutions",
 "title": "Loiyumpa Silyel"
}