{
 "id": "845422",
 "text": "Ring Tone Text Transfer Language (RTTTL), also known as Nokring, was made by Nokia to allow ringtones to be moved to their cellphones. ==Specifications== This is an RTTTL ringtone. This one is named Haunted House: `HauntHouse: d=4,o=5,b=108: 2a4, 2e, 2d#, 2b4, 2a4, 2c, 2d, 2a#4, 2e., e, 1f4, 1a4, 1d#, 2e., d, 2c., b4, 1a4, 1p, 2a4, 2e, 2d#, 2b4, 2a4, 2c, 2d, 2a#4, 2e., e, 1f4, 1a4, 1d#, 2e., d, 2c., b4, 1a4` RTTTL has three parts, which are all separated by one colon each. All of them must be there. * Part 1 - The name of the ringtone, then a comma. This ringtone's name is defined as \"HauntHouse\" because the name cannot normally be longer than 10 characters or have a colon \":\" character. Smart Messaging allows names up to 15 characters in length, and some applications processing RTTTL also do that. * Part 2 - The settings (here: d=4,o=5,b=108). \"d=\" says the default duration of a note is that much of a note. For example, \"1\" means a whole note, \"2\" means a half note and so on. \"o=\" says the default octave. \"b=\" says the tempo in beats per minute. * Part 3 - The notes. Each note is separated by a comma and shown in this order: the duration, a standard music note (a, b, c, d, e, f or g), and an octave. The default is used if no duration or octave is defined. RTTTL is defined in a similar way to Music Macro Language, which many early microcomputers have in their BASIC implementations. === Durations === These standard musical durations can be used: * 1 - whole note * 2 - half note * 4 - quarter note * 8 - eighth note * 16 - sixteenth note * 32 - thirty-second note Adding a period (\".\") character to the end of a note increases the length of the note by half, which can be used to make dotted rhythm patterns. === Pitch === These pitches can be used: * P - rest or pause * A - A * A# - A♯ / B♭ * B - B / C♭ * C - C * C# - C♯ / D♭ * D - D * D# - D♯ / E♭ * E - E / F♭ * F - F / E♯ * F# - F♯ / G♭ * G - G * G# - G♯ / A♭ === Octaves === RTTTL has 4 octaves, starting from the A below middle C and going up four octaves, because cellphones could not play some tones audibly at the time it was made. These octaves are numbered from lowest pitch to highest pitch from 4 to 7. The octave should be left out of the note to prevent rests or pauses in the pattern. ==References== *How do I distinguish a Nokring/RTTTL ringtone from other ringtones? (Eric Bematchez, about.com) *RTTTL specification document in Backus-Naur notation ==Other websites== *Library of RTTTL ringtones *Convert RTTTL to other formats *Specification Category:Computer file formats Category:Musical notation",
 "title": "Ring Tone Text Transfer Language"
}