{
 "id": "845863",
 "text": "Claudius James Erskine (20 May 1821–6 June 1893) was a British civil servant, judge, educator, and orientalist. Erskine was part of the Indian Civil Service, and worked for the Governor of Bombay, Sir George Arthur. Erskine was a scholar and translator, and he worked in the government's Persian department. He worked to improve education, and became the first \"director of public instruction\" in the west of India. He was also a judge and a legislator. He was the third vice-chancellor of the University of Calcutta. == Early life == Claudius James Erskine was born on 20 May 1821 at Bombay in the East India Company's Bombay Presidency. He was the son of William Erskine, a historian and civil servant from Edinburgh who worked in India. Claudius James was the second of William Erskine's sons. His mother was Maitland Mackintosh. She was the second daughter of James Mackintosh. Erskine went to both the University of St Andrews and the University of Edinburgh. Then he studied at the East India Company College at Haileybury in Hertfordshire. == Career == He returned to Bombay in 1840. In 1843, Erskine became the private secretary of Sir George Arthur, the governor of the Bombay Presidency. In 1847, Erskine became deputy secretary in the government's Persian department and a translator. Then he became secretary of the Bombay government's general department and its judicial department. In 1854, Erskine published his father's work on the early Mughal Empire. William Erskine had died in 1852, before he finished the book, so his son Claudius finished the work and published it as A History of India under the Two First Sovereigns of the House of Taimur, Báber and Humáyun. In 1855, Erskine became director of public instruction. He was the first person in this position in western India. During 1859 he was a judge in the Konkan region. In 1860 he became a member of the new Imperial Legislative Council. On 8 April 1862, Erskine became vice- chancellor of the University of Calcutta, after William Ritchie. In 1862, Erskine started to be a judge on the Bombay high court. On 26 March 1863, Erskine stopped being vice-chancellor of the University of Calcutta, and Henry Sumner Maine became vice-chancellor. In 1865, Erskine became a member of the Bombay Legislative Council. In April 1866, Erskine joined the Bombay Geographical Society and became its president. In 1867 Erskine retired. In March 1867 he resigned the presidency of the Bombay Geographical Society and planned to return to Europe. == Death == Erskine had retired for health reasons. He returned to Britain and died died near Hyde Park, London, on 6 June 1893. == Family == In 1847, Erskine married Emily Georgina Reid, daughter of Lestock Reid. Erksine's new father-in-law was acting as the governor of Bombay at that time. == Collection == Erskine had a collection of objects and manuscripts from Asia. Some of these are now in the British Museum and the British Library. One manuscript in the British Library (Additional manuscript 26319) has five different texts in four languages. The British Museum bought this manuscript from Erskine in February 1865. From 1811 are two Kurdish language glossaries that Muhammad Husain Khan made for John Malcolm at Bushehr, one a Persian–Laki glossary, the other a Persian–Ardalani glossary. Another is a Kurdish–English glossary. From the 19th century is a glossary of words in the Persian language and the Chagatai language, with words from the Baburnama of Babur. The final work in this manuscript is an anonymous work in Persian with the name in . This work is on the subject of metaphysics and consciousness. The copy of the Jām-i Jahānnamāī's date is 1141 anno Hegirae (1729 CE). Erskine himself probably bound these five manuscripts into the present manuscript codex. In 1886, when Erskine was living in London, he sold more of his collection. The British Museum bought from Erskine an brass astrolabe with a silver inlay. Erskine's astrolabe was from Iran, and made in the 16th or 17th centuries, during the Safavid Empire. Before Erskine owned the astrolabe, Claudius Rich was its owner. (Rich was a relative of Erskine's because Rich had married Erskine's mother's older sister, Mary Mackintosh.) Rich had got the astrolabe in Yazd. The British Museum paid Erskine £18 for it. The museum also bought other things from Erskine that year. Erskine had got from Rich a sword and sheath from the Ottoman Empire that were from the 16th or 17th centuries. The British Museum bought these in 1886. The next year, the British Museum bought more of Erskine's objects. == References == Category:1821 births Category:1893 deaths Category:Colonial officials of British India",
 "title": "Claudius James Erskine"
}