{
 "id": "845867",
 "text": "Educational research investigates how people learn. Literacy was the first starting-point. Before about 1470 all books were hand-written. Printing made the word visible.Ong, Walter J. Orality and Literacy: the technologizing of the word. 1982. London: Methuen. ISBN 0-415-02796-9 Before 1800 most ordinary people could not read or write. That was true for all countries. By 1900 most people in the most industrial countries could read. The Bible was one of the causes: people wanted to read the Bible in Christian countries. Just as important was industrialization. With industry grew a need for instruction, and there were printed rule books in key industries such as the railways. Church registers in England show increasing literacy as judged by the ability of men to sign their names. Previously, if a man signed with an X, a church clerk added his name.See standard sources such as McArthur, Tom 1992. The Oxford Companion to the English Language. Oxford University Press. ISBN 0-19-214163-X. Entries for literacy, reading, writing etc. Researching comes in many ways. Researches here focuses more on how people gather new things into their minds. These people could be learners or teachers. Both can interact in spaces of learning. These spaces are also known as classrooms. So researchers collect data inside classrooms, more or less. Educational researchers believe that the way they do research must be careful and well- ordered. First is on the basis of comparison. Second is on principles to set that everyone follows. Third is on how researchers do their research. Also, they borrow concepts from other studies, may it be about minds, society, human beings, and reasoning. The same goes for how they do their research. An enormous amount of research has been done in the United States, and very much less elsewhere == Textbooks == There are many books about educational research, including *Anderson, Garry; Arsenault, Nancy 1998 Fundamentals of Educational Research. Routledge. ISBN 978-0-203-97822-1 *Gage N.L. (ed) 1953. Handbook of Research on Teaching. American Educational Research Association. *Lodico, Marguerite G.; Spaulding, Dean T.; Voegtle, Katherine H. 2010. Methods in educational research: from theory to practice. Wiley. ISBN 978-0-470-58869-7 *Struening E.L. & Guttentag M. 1975. Handbook of evaluation research. 2 vols, Sage. *Schulman, Lee (ed) 2004. The wisdom of practice: essays on teaching, learning and learning to teach. === AERA journals and publications === The American Educational Research Association publishes many journals on teaching. * AERA Open *American Educational Research Journal *Educational Evaluation and Policy Analysis *Educational Researcher *Journal of Educational and Behavioral Statistics *Review of Educational Research *Review of Research in Education == Related pages == * Education * Research == Other websites == == References == Category:Education Category:Research methods",
 "title": "Educational research"
}