{
 "id": "846068",
 "text": "In Norse mythology, Ratatoskr is a squirrel that lives on the tree Yggdrasil. Ratatoskr carries messages between the eagle at the top of Yggdrasil, and the serpent Níðhöggr, at the bottom. Ratatoskr occurs both in the Poetic Edda and the Prose Edda. The Poetic Edda is a collection of earlier stories. It was written in the 13th century. The Prose Edda was also written in the 13th century. ==Attestations== In the Poetic Edda poem Grímnismál, the god Odin (disguised as Grímnir) says that Ratatoskr runs up and down Yggdrasil bringing messages between the eagle perched atop it and Níðhöggr below it: > :Benjamin Thorpe translation: :Ratatösk is the squirrel named, who has run > :in Yggdrasil's ash; :he from above the eagle's words must carry, :and > beneath the Nidhögg repeat.Thorpe (1907:23). :Henry Adams Bellows > translation: :Ratatosk is the squirrel who there shall run :On the ash-tree > Yggdrasil; :From above the words of the eagle he bears, :And tells them to > Nithhogg beneath.Bellows (1936:97). Ratatoskr is described in the Prose Eddas Gylfaginning chapter 16, in which High states that > An eagle sits at the top of the ash, and it has knowledge of many things. > Between its eyes sits the hawk called Vedrfolnir [...]. The squirrel called > Ratatosk [...] runs up and down the ash. He tells slanderous gossip, > provoking the eagle and Nidhogg.Byock (2005:26). == References == * Bellows, Henry Adams (Trans.) (1936). The Poetic Edda. Princeton University Press. New York: The American-Scandinavian Foundation. * Byock, Jesse (Trans.) (2005). The Prose Edda. Penguin Classics. * Davidson, Hilda Roderick Ellis (1993). The Lost Beliefs of Northern Europe. Routledge. * Guðbrandur Vigfússon (1874). An Icelandic-English Dictionary: Based on the Ms. Collections of the Late Richard Cleasby. Clarendon Press. * Lindow, John (2001). Norse Mythology: A Guide to the Gods, Heroes, Rituals, and Beliefs. Oxford University Press. * Orchard, Andy (1997). Dictionary of Norse Myth and Legend. Cassell. * Simek, Rudolf (2007) translated by Angela Hall. Dictionary of Northern Mythology. D.S. Brewer * Sturtevant, Albert Morey (1956). \"Three Old Norse Words: Gamban, Ratatoskr, and Gymir\" as collected in Sturtevant, Albert Morey (Editor) (1956). Scandinavian Studies', August 1956, volume 28, number 3. * Thorington Jr. Richard W. and Ferrell, Katie (2006). Squirrels: The Animal Answer Guide. Johns Hopkins University Press. * Thorpe, Benjamin (Trans.) (1907). The Elder Edda of Saemund Sigfusson. Norrœna Society. Category:Norse mythology",
 "title": "Ratatoskr"
}