{
 "id": "846137",
 "text": "The Kingdom of Greece was ruled by the House of Wittelsbach between 1832 and 1862 and by the House of Glücksburg from 1862 to 1924. The monarchy was abolished during the Second Hellenic Republic for a short time. The monarchy was soon brought back and ruled from 1935 to 1973, when it was abolished and replaced by the Third Hellenic Republic. ==List of kings== ===House of Wittelsbach=== Name Reign Duration as Monarch Portrait Arms Birth Parentage Marriage(s) Issue Death Succession right Title Otto 27 May 1832Protocol signed in 1832 but landed in Greece on 6 February 1833.Dates are in the New Style Gregorian calendar. The Old Style Julian calendar was used in Greece till Alexander's lifetime. – 23 October 1862 1 June 1815 Salzburg, Austria Son of Ludwig I of Bavaria and Therese of Saxe-Hildburghausen Amalia of Oldenburg 22 December 1836 no children 26 July 1867 Bamberg, Bavaria aged 52 Chosen by the Great Powers King of Greece ===House of Schleswig-Holstein-Sonderburg-Glücksburg=== Name Reign Duration as Monarch Portrait Arms Birth Parentage Marriage(s) Issue Death Succession right Title George I 30 March 1863 – 18 March 1913 24 December 1845 Copenhagen, Denmark Son of Christian IX of Denmark and Louise of Hesse Olga Constantinovna of Russia 27 October 1867 8 children 18 March 1913 Thessaloniki, Ottoman EmpireAt the time of the King's assassination, Thessaloniki was in occupied Ottoman territory. The city was recognized as part of the Kingdom of Greece by the Treaty of Bucharest (1913) five months afterwards. aged 67 Seventh cousin once removed through William the Younger, Duke of Brunswick-Lüneburg. Elected King of the Greeks. King of the Hellenes Constantine I 18 March 1913 – 11 June 1917 2 August 1868 Athens, Kingdom of Greece Son of George I of Greece and Olga Constantinovna of Russia Sophia of Prussia 27 October 1889 6 children 11 January 1923 Palermo, Kingdom of Italy aged 54 Son of George I King of the Hellenes Alexander 11 June 1917 – 25 October 1920 1 August 1893 Athens, Kingdom of Greece Son of Constantine I of Greece and Sophia of Prussia Aspasia Manos 17 November 1919 1 childFor more information, see this page. 25 October 1920 Athens, Kingdom of Greece aged 27 Son of Constantine I King of the Hellenes Constantine I 19 December 1920 – 27 September 1922 2 August 1868 Athens, Kingdom of Greece Son of George I of Greece and Olga Constantinovna of Russia Sophia of Prussia 27 October 1889 6 children 11 January 1923 Palermo, Kingdom of Italy aged 54 Son of George I King of the Hellenes George II 27 September 1922 – 5 March 1924 19 July 1890 Athens, Kingdom of Greece Son of Constantine I of Greece and Sophia of Prussia Elisabeth of Romania 27 February 1921 no children 1 April 1947 Athens, Kingdom of Greece aged 56 Son of Constantine I King of the Hellenes ===House of Glücksburg (restored)=== Name Reign Duration as Monarch Portrait Arms Birth Parentage Marriage(s) Issue Death Succession right Title George II 3 November 1935 – 1 April 1947 19 July 1890 Athens, Kingdom of Greece Son of Constantine I of Greece and Sophia of Prussia Divorced 6 July 1935 1 April 1947 Athens, Kingdom of Greece aged 56 Son of Constantine I King of the Hellenes Paul 1 April 1947 – 6 March 1964 14 December 1901 Athens, Kingdom of Greece Son of Constantine I of Greece and Sophia of Prussia Frederica of Hanover 9 January 1938 3 children 6 March 1964 Athens, Kingdom of Greece aged 62 Son of Constantine I King of the Hellenes Constantine II 6 March 1964 – 1 June 1973 2 June 1940 Athens, Kingdom of Greece Son of Paul of Greece and Frederica of Hanover Anne-Marie of Denmark 18 September 1964 5 children 10 January 2023 Athens, Greece aged 82 Son of Paul King of the Hellenes ==Notes==",
 "title": "List of kings of Greece"
}