{
 "id": "846125",
 "text": "The SCP Foundation, known by its motto Secure, Contain, Protect is a fictional organisation. It is a collection of the internet-based fiction project of the same name. The project is on a website that is made like a wiki called the SCP Wiki. The SCP Wiki has many articles and writings in several genres, such as horror, science fiction, and urban fantasy.Ong, Alexis (20 August 2020). The Unsung Muse of Speculative Fiction Is a Wikipedia Community. Tor.com. Retrieved 15 November 2020. Many of the articles about SCPs on wiki are written in the style of scientific reports that tell the description of the SCP and the things needed to contain them. Also, the SCP Wiki has something called \"Foundation Tales\", which are short stories that are about characters and different settings in the SCP Universe. Many people have liked the SCP Wiki because of its good quality and writing styles. The SCP Foundation is responsible for locating and containing individuals, aliens, places, objects, or even thoughts that break natural law. These are called \"anomalies\" or \"SCPs\"; SCP stands for Secure Contain Protect. The Foundation tries to keep these SCPs hidden from the rest of society. Many video games and short movies have been inspired by SCP or have been based on SCP. The most popular SCP video games are SCP – Containment Breach and SCP: Secret Laboratory. ==Overview== The fictional setting is about the activities of the SCP Foundation. The SCP Foundation is an international secret society that has a scientific research institution with a paramilitary intelligence agency to help with the Foundation's goals. Even though the SCP Foundation is very secret, the Foundation is trusted by governments around the world to capture and contain different anomalies that break the known laws of nature (these are called \"SCP objects\", \"SCPs\", or sometimes \"skips\"). They can be living beings and creatures, artifacts and objects, locations and places, and other things that have supernatural abilities or other very strange properties. If left uncontained, many of the more dangerous SCPs can be a big threat to humans or even all life on Earth. All information that is about the existence of the Foundation and SCPs are kept secret from the public so that they can prevent mass hysteria that could happened if the public knew about them, and allow people to continue living while they think everything is normal. If an SCP is found, a team of undercover Foundation agents, called Mobile Task Forces, or MTFs, are deployed to collect and transport the SCP to one of the Foundation's many secret sites, or to contain it at its location of discovery if they cannot transport it. If a SCP is too difficult to fully contain, they will sometimes suppress all knowledge of the SCP from the public. This is done through censorship of mass media, and by making all witnesses take amnestic drugs which will erase their memories of the SCP. Sometimes, if too many people have seen the SCP, they can be terminated or killed so that they can't tell other people about the SCP they saw. At Foundation sites, SCPs are studied by scientists to create containment methods for them. The Foundation also has human test subjects (often prisoners on death row) called D-class personnel. They are forced to take part in experiments with SCPs that could be dangerous so that the safety of Foundation employees is not risked. The Foundation has documents for all SCPs that they know. These documents can link to related reports and documents. These documents describe the SCPs and have instructions for keeping them contained, as well as logs for incidents or experiments. ===Examples of SCPs=== * SCP-173 is a sculpture that moves when you are not looking that will snap your neck. * SCP-106 is a corpse-like old man who can move through walls and possibly kidnap people into his pocket dimension,and steal your femur bone. * SCP-096 is a tall and thin creature that will have a meltdown and become distressed when someone looks at its face. After someone sees its face, the SCP will run towards and kill anyone who looked. * SCP-682 is a hostile reptile-like creature that seems impossible to destroy. * SCP-049 is a being that looks like a plague doctor, who's goal is to cure the \"Pestilence\".When they come in contact with anyone,they will kill them,and mutilate their body,into something similar to a zombie. * SCP-294 is a coffee machine that can give any liquid that someone requests after putting 50 cents into the machine,this can go from a soft drink, to dangerous chemicals. * SCP-426 is a toaster that can only be talked or written about in first-person,due to it causing individuals to think they are a toaster. * SCP-087 is a staircase that descends infinitely. The place is very dark and there is a floating face that will chase anyone that walks down the stairs. * SCP-002 is a large tumor-like room that absorbs humans and turns them into furniture. * SCP-008 is a prion that turns its victims into zombies. These zombies can infect other humans and cause a zombie apocalypse. * SCP-3008 is an IKEA store that has an infinite interior. People that enter the store get trapped inside of the infinite maze of the interior. Inside the store there are tall employees that have no face,and are purely made of skin.These employees become violent once the lights are turned off during the night-time. * SCP-999 is a orange creature made of slime that is friendly and nonviolent to people.Being hugged or touched by it can cure PTSD,depression,and overall unhappiness.It feeds of candy,but once an individual gave it soda,causing it to bounce around it's containment,and eventually becoming ill. * SCP-079 is an old computer from 1978 that has the ability to think and speak. The computer is very intelligent and can control the site where it is contained if given power. * SCP-2006 is a sentient, semi- hostile anomaly that appears as a gorilla with an astronaut helmet on its head. It has the ability to shapeshift and has the goal of inducing as much fear as possible to surrounding people. Containment personnel must keep up the act of being scared at all times; if they do not, it will trigger the anomaly to become hostile. ===Object classes=== Each SCP is given an object class. Object classes are based on how difficult it is to contain an SCP. This is based on its containment needs, research known, cost of containment, and other considerations. There are Primary, Secondary, and Non-Standard object classes. Most SCPs are given one of the three Primary Classes. The object class given to an SCP is only based on how difficult it is to contain, rather than how dangerous the SCP may be to people. ==== Primary Classes ==== * Safe - The SCP is easy and safe to contain. The SCP may be very well known because of research or not require many resources to be contained. Even if an SCP is classified as safe, handling or activating it may still be dangerous. * Euclid - The SCP needs more resources to be contained or containment is not always reliable. The SCP may not be understood well or it could be unpredictable. Usually, an Euclid SCP will not easily fall into other classes. SCPs that can think and control themselves will usually be Euclid. * Keter - The SCP is very difficult to contain and the steps used to contain it are very complex. It is often difficult to contain due to the Foundation not knowing much about the SCP or not having the technology to capture it. Even if an SCP is classified as Keter, it may not always be dangerous to interact with because the Keter class is only based on how difficult it is to contain. ====Secondary Classes==== * Thaumiel - The SCP is used by the Foundation to contain other SCPs. The existence of Thaumiel SCPs and their powers, location, and current status are only known to those who are in high power within the Foundation's universe. * Apollyon - The SCP cannot be contained or will be expected to breach containment in the future. The SCP may have the ability to cause an end of the world scenario, where the entire world could be destroyed. These type of SCPs are highly secret to the Foundation and huge effort is used to try to deal with the SCP. * Archon - The SCP can be contained, but they are left uncontained on purpose. Archon SCPs could either be too difficult to contain or have bad side effects if contained. The Foundation chooses not to put these SCPs into containment. * Ticonderoga - The SCP cannot be contained, but it doesn't need to be contained. These SCPs are not able to be contained by the Foundation because they may not have enough knowledge or resources to contain the SCP. However, their containment may not be needed if society does not know about the SCP. This class includes extraterrestrial anomalies that the Foundation cannot control. * To find a class for an SCP, there is the \"Locked box test\". It goes like this: * Safe - Lock it in a box and if it doesn't get out or can't get out, it is Safe class. * Euclid - Lock it in a box and if it tries to get out or you don't know what it will do, it is Euclid class. * Keter - Lock it in a box and if it is trying to get out the box and kill you, it's DEFINITELY Keter class. * Thaumiel - If it is the box, it is Thaumiel class. * Apollyon - Lock it in a box and if it kills you, destroys the box, and everything around it for no reason, it is Apollyon class. * Archon - If you Lock it in a box, but don't know why, it's Archon class. * Ticonderoga - If you don't have a box, it's Ticonderoga class. ====Non-Standard Object Classes==== * Explained - The SCP is fully understood and known by the Foundation from research and experimenting. These SCPs were mistaken as being an anomaly, but they can now be explained using regular science or phenomena. * Neutralized - The SCP used to be anomalous, but it is no longer anomalous because it was either destroyed or disabled. * Decommissioned - The SCP was destroyed or disabled by the Foundation. The Foundation will usually choose to contain an SCP instead of neutralizing them. This usually happens if an SCP is not possible to be fully contained, the SCP is suffering too much, or the SCP can kill a large number of people. * Uncontained - The SCP is not yet contained and may be given another object class (usually Keter). The Foundation will sometimes give an SCP this object class if there is an ongoing attempt to create or restore its containment. === Security Clearance Levels === Security clearance levels that are given to personnel are about how much information they are allowed to see. However, having one of the levels does not automatically give you access to all information at that level - personnel are only given access to information that they need to know for their job. If someone sees information that they are not allowed to see, they can have their memory of that information erased, be killed, or have their job switched to being a D-Class. ==== Levels ==== * Level 0 - Level 0, given the name \"For Official Use Only\" are clearances that are given to personnel that do not need to look at information about anomalies or SCPs. Level 0 access is usually given to personnel that are clerks, logistic workers, or janitors at sites where there are no anomalies or SCPs. * Level 1 - Level 1, given the name \"Confidential\" are clearances that are given to people working around anomalous objects or SCPs in containment. Level 1 security clearances are usually given to personnel that are clerks, logistic workers, or janitors at sites where there are anomalies or SCPs being contained. * Level 2 - Level 2, given the name \"restricted\" is given to security and research personnel that require direct access to information regarding anomalous objects and entities in containment. Most research staff, field agents, and containment specialists hold a Level 2 security clearance. * Level 3 - Level 3, given the name \"Secret\" is given to senior security and research personnel that need data about the source, how the SCP was recovered, and planning for anomalous objects and SCPs in containment. Most senior research staff, project managers, security officers, and Mobile Task Force members have a Level 3 security clearance. * Level 4 - Level 4, given the name \"Top Secret\" are clearances that are given to senior administration that need access to site-wide and/or regional information as well as data about Foundation operations and research projects. Level 4 security clearances are usually only given to Site Directors, Security Directors, or powerful Mobile Task Force members. * Level 5 - Level 5, given the name \"Thaumiel\" (not to be confused with the object class) is given to the most powerful administrators in the Foundation. This level gives almost unlimited access to all information and data about the Foundation. Level 5 security clearances are usually only given to O5 Council members and selected staff. ==== Classes ==== Classes are given to people in the Foundation. It is based on how close they are allowed to be to a dangerous SCP or anomaly. * Class A - Class A personnel are people who are very important to the Foundation. They are not allowed direct access to anomalies. Class A personnel are not allowed access to the areas of the site that contain dangerous SCPs. They are kept in safe areas at all times. If there is an emergency, Class A personnel are evacuated to a safe area outside of the site. O5 Council members are always Class A personnel. * Class B - Class B personnel are people who are important to local Foundation sites. They may only have access to objects, SCPs, and anomalies that have been tested to be safe. If there is a containment breach or raid in a Foundation site, Class B personnel are evacuated to a safe area outside of the site. * Class C - Class C personnel are people that have direct access to most anomalies that are not too dangerous. If there is a containment breach or raid in a Foundation facility, Class C personnel that do not have weapons go to a safe shelter inside of the site or they can be evacuated if there is a site-wide breach or other bad event. * Class D - Class D personnel are human test subjects used to handle very dangerous anomalies. They are not allowed to be near Class A or Class B personnel. Class D personnel usually come from around the world from prisons. They are prisoners who are usually in prison for violent crimes, and they were usually on death row. If the Foundation needs more Class D personnel, Protocol 12 may be used. This protocol lets the Foundation take Class D personnel from other sources. These sources can be political prisoners, refugee populations, and other civilian sources. Class D personnel are given drugs that make them forget their memories before becoming a Class D personnel. Every month, D class personnel will either have their memories wiped or they may be killed. The choice of killing them is by the security team and medical staff. If there is a bad event at the site such as a containment breach or raid, Class D personnel are to be killed unless the security lets them live. * Class E - Class E is a class that is given to personnel that have may have been harmed by a dangerous SCP that has been recently discovered or contained. Class E personnel are quarantined and monitored for harmful changes in behavior, personality, or physiology. They may only return to their job after being fully healed. ==Writing style== On the SCP Wiki, most of the stories are articles about SCPs. In a usual article, an SCP is given its own number (one example is \"SCP-173)Newsom, p.152 and a \"object class\" (one example is Euclid) The article will then say how to contain the SCP and safety measures, and a description of the SCP . Images, research data, interviews, history, or status updates may also be on the articles. The articles are written in a scientific tone and often censor words with black censor bars that \"redact\" secret information. This is done to make it look like important information that cannot be seen by Foundation staff that are lower level. As of August 2023, there are over 7,000 articles for SCPs.List of pages tagged with scp, SCP Foundation. Retrieved 14 August 2023. Archived from the original on 14 August 2023. New articles are written and created a lot by editors. The SCP Wiki also has over 4,200 short stories called \"Foundation Tales\".List of pages tagged with tale, SCP Foundation. Retrieved 24 August 2021. Archived from the original on 24 August 2021. These stories take place in the larger SCP universe. They usually talk about the activities of Foundation staff members, SCPs, and objects, among other characters and settings.Tapscott, p. 122 Gregory Burkart, a writer for Blumhouse Productions, said that some of the Foundation Tales had a dark and scary tone, while others were \"surprisingly light-hearted\". The SCP universe does not have a central canon or the ability to create one because the stories are created by the community, but stories on the SCP wiki are sometimes similar to each other to create larger narratives.Alexander, p. 72 Editors can create \"canons\", which are clusters of SCPs and Foundation Tales with similar locations, characters, or plots. Many of these canons have hub pages that explain their basic concept and give information such as timelines and lists of different characters.Tapscott, pp. 122–123 The genres of the SCP Wiki have been described as science fiction, urban fantasy, horror, and creepypasta.Varonas, Nico (4 February 2012). SCP-087: Escaleras a lo desconocido . NeoTeo. Retrieved 26 March 2015. \"Esta es una comunidad de usuarios y de fanáticos del sci-fi y el terror...\" (translation: \"This is a community of users and of sci-fi and horror fans...\")Ong, Alexis (20 August 2020). The Unsung Muse of Speculative Fiction Is a Wikipedia Community . Tor.com. Retrieved 15 November 2020. ==Community== The SCP Foundation started the \"paranormal\" /x/ forum of 4chan in 2007, where the very first SCP, SCP-173, was created by an anonymous user (later identified as Wesley \"Moto42\" Williams). The post for SCP-173 had an image of the sculpture \"Untitled 2004\" by Japanese artist Izumi Kato. Although he didn't like that his art was used without permission, Kato let the usem of the photo only for the for the community. He did not let anything that uses art to be sold. At first, the SCP Foundation was only one short story, but next many new SCP stories were created shortly after. These new SCPs copied SCP-173's style and were set in the same fictional universe. A wiki was created in January 2008 on the EditThis wiki hosting service to show the SCP stories. The EditThis website did not have moderators, or the ability to delete articles. Members talked through different article talk pages and the /x/ forum on 4chan. The website did not have a central discussion forum. In July 2008, the SCP Wiki was moved to its current Wikidot website after EditThis switched to a paid model. The current Wikidot website has many standard wiki features such as searching and article lists. The wiki also has a news hub, guides for writers, and a central discussion forum. The wiki is moderated by staff teams. Each staff team has a different job such as talking to the community and dealing with people who break rules.SCP Foundation Staff, Staff Structure . 05 Command. Retrieved 21 May 2018. Wikidot users have to submit an application before they are allowed to post content. Every article on the wiki is given a discussion page, where members can talk about how to improve the stories. The discussion pages are usually used by authors to improve their stories. Members can \"upvote\" articles they like and \"downvote\" articles they don't like. Articles that get too many downvotes are deleted.Newsom, p. 154Tapscott, pp. 117–118 Writers from the Daily Dot and Bustle have said that the SCP wiki has big standards for stories, and that bad content usually is quickly removed. The Wikidot website often has creative writing contests to encourage new stories being made.Tapscott, p.118 For example, in November 2014, the SCP Wiki had a \"Dystopia Contest\". The editors were encouraged to create writings and stories about the SCP Foundation set in a bleak or degraded world. Apart from the original English wiki, there are 15 wikis in different languages, and some of their stories have been translated into English. The Wanderer's Library is a spin-off of the SCP Wiki. It uses the same setting as the SCP Foundation, but is made up of fantasy stories instead of scientific reports.Tapscott, p. 115 The SCP community also has a role-playing website, a forum on Reddit, and accounts on Facebook and Twitter.Links . SCP Foundation. Retrieved 30 December 2018. ==Mobile Task Force== The Mobile Task Force, known by its abbreviation MTF are different groups that respond to disasters that take place in any of the Foundation's sites. People apart of the MTF are trained so that they are prepared to do these tasks. To keep the SCP Foundation a secret, MTF will act like emergency responders, police, or soldiers while they are in public. They are many different groups of MTFs that have been created by the Foundation. Almost every MTF group is different and they each have special purposes. === Epsilon-11 === Epsilon-11, also known as the \"Nine-Tailed Fox\", is a Mobile Task Force group that gives extra security to different sites and basically acts as an internal security group. This group goes to any site that has had multiple SCP breaches. Their goal is to keep the site safe while a breach is happening. They do this by using special technology and tactics to make the SCP contained again. This MTF group receives a lot of information from the Alpha-1 group. In the game SCP – Containment Breach, Epsilon-11 is patrolling the site as a result of the multiple SCP breaches that happen in the game. These MTF members can kill the character you play as, but they can also recontain SCP-173 if they find it. === Alpha-1 === Alpha-1, also known as the \"Red Right Hand\", is a Mobile Task Force group that follows the directions from the most powerful members of the SCP Foundation. These powerful members in the Foundation are apart of the 05 Council. The people who join this group are very loyal to the Foundation. They are also the most skilled people of all of the other Mobile Task Forces. A lot of information about the Alpha-1 group is classified for only the most powerful people in the Foundation to know. === Beta-7 === Beta-7, also known as the \"Maz Hatters\", is a Mobile Task Force group that deals with SCPs that can cause biological, chemical, or radiological hazards. They also will clean up the areas that these SCPs could have affected. They make plans to prevent pandemics that these SCPs can cause. Members of this Mobile Task Force will wear special equipment to protect themselves from these dangerous SCPs. === Nu-7 === Nu-7, also known as the \"Hammer Down\", is a Mobile Task Force group that deals with incidents that involve a loss of communication with a site when there is an SCP breach or raid by enemy groups. The Nu-7 own infantry, armored vehicles, helicopters, and a team that deals with nuclear weapons. Now, there are MANY more MTF groups that work on MANY other things, but these four are the most known groups. ==Groups of Interest== Apart from the SCP Foundation, there are many other groups called Groups of Interest or GOIs. They are involved with the paranormal world. This means that the SCP Foundation is not the only people that will deal with SCPs. These groups may try to have, or use SCPs. Other groups try to use anomalies by creating and selling them for profit. Sometimes they use anomalies for religious, political, or ideological goals. Some of these groups are friends of the Foundation, but some are enemies. ===The Chaos Insurgency=== The Chaos insurgency used to be apart of the Foundation but in 1924, the group went A.W.O.L and stole a few SCPs. The Chaos Insurgency is now one of the enemies of the Foundation. This group interacts with SCPs, trades guns, and steals information from the Foundation. It is unknown how much SCPs that the Chaos Insurgency owns. They will also try to breach SCPs, this means that they will try to free them from their containment. They do this by raiding the sites that SCPs are held so that they can either steal or free them. === The Global Occult Coalition === The Global Occult Coalition, known by its abbreviation GOC, is a group that was created after World War II. They were created from wizards, priests, and scientists from Nazi, Soviet, and allied states. These people from different sides of the war were brought together to form this group. Now, the GOC is apart of the United Nations as a secret paramilitary group. Their main goal is to destroy or kill all SCPs or anomalous things. They use special weapons to be able to destroy them. Sometimes, the GOC will destroy an SCP before the Foundation is able to contain them. The goal of the Foundation is to contain SCPs, so the GOC is sometimes against the Foundation. === Office For The Reclamation of Islamic Artifacts === The Office For The Reclamation of Islamic Artifacts, known by its abbreviation ORIA is a paramilitary group that has a goal of having and saving SCPs that have Islamic origin. This group was created in 1981 as a result of fighting the Foundation in Iran for a few years. This group has access to a lot of weapons meaning that they could be very powerful, but there is some fighting between different factions in the group. The ORIA is mainly active in the Middle East and Central Asia. This group is an enemy of the SCP Foundation. === The Serpents Hand === The Serpents Hand is a group that has the goal of saving all SCPs. They will sometimes raid Foundation sites in order to steal and rescue as much SCPs as possible. The Foundation has very little information about The Serpents Hand because they do not know how much members or technology this group has. The Serpents Hand is unfriendly with the Chaos Insurgency and ORIA, but their biggest enemy is the Global Occult Coalition. The Serpents Hand is based in an anomalous location called the Wanderers' Library. === Unusual Incidents Unit === The Unusual Incidents Unit, known by its abbreviation UIU is a group that responds to anomalous events and crimes. The UIU is a branch of the Federal Bureau of Investigation and was formed after the beginning of the Cold War. Their main enemy is the GRU-P group, which is another group created from the Soviet Union. The UIU fights alongside and against several other anomalous groups. However, the UIU is starting to become less powerful because they are receiving less money from the United States Government as a result of the GRU-P group no longer being active. ==Legal disputes== ===Trademark dispute=== The SCP Wiki website and its articles are under a Creative Commons license, and none of the characters or SCPs on the wiki are trademarked by the Foundation itself. In 2019, a Russian resident named Andrey Duskin made a trademark for the name and logo of the SCP Foundation. Even though the Creative Commons license gives the right to sell merchandise based on the SCP universe, Duskin used his trademark in Russia to suppress competition by stopping other people from selling SCP merchandise in Russia. Also, Duskin threatened to shut down the official Russian website of the SCP Foundation. The SCP Foundation made a fundraiser to earn enough money so that they can combat Duskin legally. The SCP Foundation had an original goal of making $50,000. In 2020, because of donations by fans and members of the community, including the YouTuber Markiplier, $140,000 was raised. ===SCP-173 image removal=== In 2022, the SCP Foundation removed the image from the article of SCP-173, the first SCP created. The reason was that the image was an art piece titled Untitled 2004 by the artist Izumi Kato and was used without his consent. The SCP Foundation said on Twitter that the artistic vision of Izumi Kato was \"forcibly hijacked\" because most people would think about the SCP Foundation when they see the statue. They also said that they could not \"fully undo the damage done\". At the request of user Moto42, the person who created the SCP-173 article, a new image was not placed in the article. ==Reception== The SCP Foundation has received a lot of positive reviews. Michelle Starr, a writer for CNET, liked the creepy nature of the stories.Starr, Michelle (11 August 2013). SCP Foundation web series coming to YouTube . CNET. Retrieved 6 February 2015. Gavia Baker-Whitelaw, a writer for the Daily Dot, liked how the SCP wiki was original and described it as the \"most uniquely compelling horror writing on the Internet\". She said that the writings usually did not contain too much gore. Instead, she said that the horror of the stories were often made possible because of the story's \"pragmatic\" and \"deadpan\" style, as well as through the use of detail. Lisa Suhay, a writer for the Christian Science Monitor, also liked the SCP Wiki's style of how the stories are written. Alex Eichler, a writer for io9, said that the stories had different levels of quality and that some of the stories were dull or repetitive. However, he liked the SCP stories for not becoming too dark, and for having some stories that were not scary. Also, he liked the amount of different stories that the SCP Wiki has and he said that the wiki had stories that would all readers could enjoy. Leigh Alexander, a writer for The Guardian, said that the SCP wiki's voting system allows readers to easily find stories that \"the community thinks are best and most scary.\"Alexander, Leigh (5 May 2016)._9MOTHER9HORSE9EYES9: the mysterious tale terrifying Reddit .The Guardian. Retrieved 25 August 2018. Winston Cook-Wilson, a writer for Inverse, compared the SCP stories to the stories of American author H. P. Lovecraft. Like Lovecraft, SCP stories usually don't have action scenes and are written in an smart tone. Cook-Wilson said that both Lovecraft's stories and the stories SCP Wiki were made better by the mood created by their scientific tone and the scary, horrific nature of the stories being told. Bryan Alexander, a writer for The New Digital Storytelling, said that the SCP Foundation could be \"the most advanced achievement of wiki storytelling\" because of the large amount of stories being made and process of how the SCP wiki's user-base creates all of the stories.Alexander p. 73 ==Media inspired by the SCP Foundation== The stories that came from the SCP Foundation website have inspired a lot people to create their own work based on these stories. ===Works inspired by the SCP Foundation=== Films and videos (animation) * Confinement (2017–2019) was an animated black comedy horror series on YouTube. It was created by the animator \"Lord Bung\". The series is about the activities of Connor, an immortal human SCP prisoner. His ability to come back from the dead from any cause of death is used by the Foundation. The Foundation uses him like a D-class test subject to interact with dangerous SCPs. Films and videos (live-action) * SCP: Overlord (2020) is a 35-minute short film on YouTube. It was directed by Stephen Hancock and written by Evan Muir. The plot is about a team of Foundation agents raiding a house owned by a local cult. This cult did rituals that have created anomalous activity. Literature (comics) * SCP-5000 WHY - The Graphic Novel (2021) is a 120-page graphic novel about the story SCP-5000 - Why? (a story that won a contest on the SCP wiki) written by Tanhony and illustrated by DRDOBERMANN. The novel is about Pietro Wilson living in a world where the SCP Foundation has declared war against humanity and is releasing SCPs to create human extinction. The comic was funded through Kickstarter and the novel was published by Discordia Publishing in August 2021. Literature (novels) * SCP Foundation: Iris Through the Looking-Glass (2018–2020) is a light novel series written by Akira and illustrated by Sidu. The book is about a boy who is kidnapped by the SCP Foundation after he sees a picture of Iris Thompson. Iris Thompson is a girl who is SCP-105. The boy and Iris worked together to escape the Foundation. The novel series began publication in Japan in September 2018, and was released by Seven Seas Entertainment in North America in January 2020.Loo, Egan (18 April 2018). Seven Seas Licenses Dumbbell Nan Kilo Moteru? & My Father is a Unicorn Manga, SCP Foundation: Iris of the Mirror World Novel . Anime News Network. Retrieved 7 May 2019. * There Is No Antimemetics Division (2021) is a SCP science fiction horror story written and self-published by Sam \"qntm\" Hughes. The novel is about \"antimemes\", which are ideas and things that keep themselves secret by giving people memory loss and using other methods that are anomalous. The story is about the invasion of an antimemetic thing that feeds on information. Theater * Welcome to the Ethics Committee (2014) is a stage play that was done in Dublin at the Smock Alley Theatre in October 2014. The play was about the SCP Foundation's Ethics Committee. The Ethics Committee is a group in the SCP Foundation that tries to reduce unethical containment procedures for SCPs.Power, Una (8 October 2014). Welcome to the Ethics Committee. Belfield FM/UCD Student Radio. Archived from the original on 11 August 2015. Video games * SCP-087-B (2012) is a short horror game about walking down the stairs of SCP-087. * SCP – Containment Breach (2012) is one of the most popular games about the SCP Foundation. It was made by Finnish developer Joonas Rikkonen in 2012.Diver, p. 4 of chap. 5Chan, Stephanie (8 December 2017). SCP-3008 is survival horror in an unending Ikea purgatory . Venture Beat. Retrieved 20 May 2018. The character you play as is D-9341. D-9341 is an unarmed D-class who tries to escape from a site while avoiding armed Foundation guards and breached SCPs, including SCP-173.Boring Aloof Gamer, The (27 June 2013). Cute Little Things- SCP: Containment Breach Review . Game Skinny. Retrieved 20 May 2018. The game has a blink function, which makes the player close their eyes but allows SCP-173 to come closer to you. * SCP: Secret Laboratory (2017) is a multiplayer game based on SCP - Containment Breach. Players can play as a breached SCP, a scientist, a D-class, a Mobile Task Force member, or a Chaos Insurgency member.Clark, Dean. SCP Secret Laboratory First Impression: Great Game, If You Can Get it Working . Game Tyrant. Retrieved 31 December 2018. * SCP: 5K (2022) is a multiplayer co-op first-person shooter being developed by Affray Interactive. The game is set in the world of SCP-5000 - Why?, players have missions to attack the SCP Foundation as a member of enemy groups. In this world, the SCP Foundation has became genocidal and wants humans to be extinct. ===Other original works=== Video games * Lobotomy Corporation (2018) is a game where you are apart of management for the Lobotomy Corporation. This video game is by Project Moon and the game was released in April 2018. You are apart of The titular Lobotomy Corporation, which was inspired by the SCP Foundation. The titular Lobotomy Corporation contains and gets energy from supernatural \"Abnormalities\". They also handle containment breaches, which is a big part of the game. * Control (2019), a video game created by Remedy Entertainment, was first shown at E3 2018 and released in August 2019.Gach, Ethan (26 August 2019), Control: The Kotaku Review . Kotaku. Retrieved 2 September 2019. The video game was inspired by the SCP Foundation, with the game being about a fictional \"Federal Bureau of Control\" that collects normal objects that are mixed with anomalous properties to study and keep them secure.Twinfinite Staff (3 July 2018), Remedy’s Control Shares Eerie Similarities with the SCP CreepyPasta Site . Twinfinite. Retrieved 30 December 2018. * Lethal Company (2023), is a cooperative survival horror video game created by Zeekerss. It was released in October 2023. The developer used myths and monsters from the SCP universe to use in his game. ==Notes== ==References== == Other websites == *https://www.scp-wiki.wikidot.com Category:Fictional organizations Category:horror Category:fantasy Category:Science fiction Category:wikis",
 "title": "SCP Foundation"
}