{
 "id": "846365",
 "text": "Similar to antisemitism, IHRA Working Definition of Antisemitism : * Calling for, aiding, or justifying the killing or harming of Jews in the name of a radical ideology or an extremist view of religion. * Making mendacious, dehumanizing, demonizing, or stereotypical allegations about Jews as such or the power of Jews as collective — such as, especially but not exclusively, the myth about a world Jewish conspiracy or of Jews controlling the media, economy, government or other societal institutions. * Accusing Jews as a people of being responsible for real or imagined wrongdoing committed by a single Jewish person or group, or even for acts committed by non-Jews. * Denying the fact, scope, mechanisms (e.g. gas chambers) or intentionality of the genocide of the Jewish people at the hands of National Socialist Germany and its supporters and accomplices during World War II (the Holocaust). * Accusing the Jews as a people, or Israel as a state, of inventing or exaggerating the Holocaust. * Accusing Jewish citizens of being more loyal to Israel, or to the alleged priorities of Jews worldwide, than to the interests of their own nations. * Denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor. * Applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation. * Using the symbols and images associated with classic antisemitism (e.g., claims of Jews killing Jesus or blood libel) to characterize Israel or Israelis. * Drawing comparisons of contemporary Israeli policy to that of the Nazis. * Holding Jews collectively responsible for actions of the state of Israel. antiziganism refers to the bias, prejudice or discrimination against the Roma. ==Overview== Antiziganism has been widespread in Europe since the Middle Ages. * * * * * The International Holocaust Remembrance Alliance (IHRA) adopted an official definition for antiziganism on October 8, 2020: Working definition of antigypsyism/anti-Roma discrimination * Distorting or denying persecution of Roma or the genocide of the Roma. * Glorifying the genocide of the Roma. * Inciting, justifying, and perpetrating violence against Roma communities, their property, and individual Roma. * Forced and coercive sterilizations as well as other physically and psychologically abusive treatment of Roma. * Perpetuating and affirming discriminatory stereotypes of and against Roma. * Blaming Roma, using hate speech, for real or perceived social, political, cultural, economic and public health problems. * Stereotyping Roma as persons who engage in criminal behavior. * Using the term “Gypsy” as a slur. * Approving or encouraging exclusionary mechanisms directed against Roma on the basis of racially discriminatory assumptions, such as the exclusion from regular schools and institutional procedures or policies that lead to the segregation of Roma communities. * Enacting policies without legal basis or establishing the conditions that allow for the arbitrary or discriminatory displacement of Roma communities and individuals. * Holding Roma collectively responsible for the real or perceived actions of individual members of Roma communities. * Spreading hate speech against Roma communities in whatever form, for example in media, including on the internet and on social networks. ==Persecution== For centuries, the Roma have been victims of persecution and systemic discrimination in many countries. * * * * * * * * * * They were subject to repeated mass murders as well. ===Modern period=== Between the 1500s and the 1700s, Romani men could be hanged without a trial in many countries. Muslim Roma reportedly face double discrimination – antiziganism and alleged Islamophobia. Smears against the Roma are common, especially in European countries. Unfortunately, the Roma are blamed just as the Jewish people * * * * * for social problems and wrongdoings of others. ==Genocide== ===Nazi Germany=== In WWII, while the Holocaust was happening, the Roma were also subject to genocide by Nazi Germany, his allied countries and local collaborators in occupied territories. * * * * * Historians estimated that between 250,000 and 500,000 Roma had been killed during WWII. * * * * * * * * * * Some historians give a higher death toll estimate, ranging from 800,000 to 1,500,000. ==Related pages== * Independent State of Croatia * Jasenovac concentration camp ==Footnotes== ==References== Category:Roma Category:Racism Category:History of Europe",
 "title": "Antiziganism"
}