{
 "id": "84641",
 "text": "The Federal Ministry of Health (BMG) is a Ministry of the Federal Republic of Germany. The ministry's headquarters are still in Bonn and the second office is in Berlin. == History == The Federal Ministry of Health Services () was formed in 1961. Between 1969 and 1991 it was part of the Federal Ministry of Youth, Family, and Health or Youth, Family, Women and Health It became independent again as the Federal Ministry of Health in 1991. In 2002 it took over control of Social Security, but the in Federal Ministry of Health and Social Security () only lasted for three years. In 2005 it was reduced to just health, and the Social security part of its work went to the Ministry of Labour and Social Affairs () == Ministers == Federal Ministry of Health Services Federal Ministry of Health Services 1961 1969 Minister Party Term start Term end Elisabeth Schwarzhaupt CDU 1961 1966 Käte Strobel SPD 1966-1969 Federal Ministry of Youth, Family and Health Federal Ministry of Youth, Family and Health 1969 1986 Käte Strobel SPD 1969 1972 Katharina Focke SPD 1972 1976 Antje Huber SPD 1976 1982 Anke Fuchs SPD 1982 1982Six months Heiner Geißler CDU 1982 1985 Rita Süssmuth CDU 1985 1986 Federal Ministry of Youth, Family, Women and Health Federal Ministry of Youth, Family, Women and Health 1986 1991 Rita Süssmuth CDU 1986 1988 Ursula von Lehr CDU 1988 1991 Federal Ministry of Health Federal Ministry of Health 1991 2002 Gerda Hasselfeldt CSU 1991 1992 Horst Seehofer CSU 1992 1998 Andrea Fischer Bündnis 90/Die Grünen 1998 2001 Ulla Schmidt SPD 2001 2002 Federal Ministry of Health and Social Security Federal Ministry of Health and Social Security 2002 2005 Ulla Schmidt SPD 2002 2005 Federal Ministry of Health Federal Ministry of Health 2005 to date Ulla Schmidt SPD 2005 2009 Philipp Rösler FDP 2009 2011 Daniel Bahr FDP 2011 2013 Hermann Gröhe CDU 2013 2018 Jens Spahn CDU 2018 2021 Karl Lauterbach SPD 2021 == Jobs of the BMG == Some of the jobs of the federal Ministry of Health are: * Keeping efficient the ** legal health insurance system ** nursing insurance system * Protecting and improving the quality of the health service * Protecting the interests of the patients * Keeping membership rates * Promote good health and prevention, including * :Infection protection law ==Other agencies== The BMG oversees: * Federal Institute for Drugs and Medical Products ()(BfArM) in Bonn * Federal Centre for Health Education ()(BZgA) in Cologne * German institute for medical documentation and information () (DIMDI) in Cologne * Paul-Ehrlich-Institut (Pei), (Federal Office of Serums and vaccines) ()in Langen (Hesse.) * Robert Koch-Institut (RKI) in Berlin == Other health ministries == * The European commission deals with health matters through either the health and consumer protection office or the office for occupation, social matters and equal opportunities * The state health ministries in Germany are often part of the state Department of Social Security. *In Austrian health is part of the Federal Ministry of Health and Women * In Switzerland the health department is part of the Ministry of the Interior in Bern. ==References== == Other websites == Official website *",
 "title": "Federal Ministry of Health (Germany)"
}