{
 "id": "846501",
 "text": "R.O.S.E. is the fourth studio album by English singer-songwriter Jessie J. It was released by Republic Records in four parts, starting on 22 May 2018, and finishing on 25 May 2018, with a part being released on each day. The four parts released are R (Realisations), O (Obsessions), S (Sex) and E (Empowerment). Jessie co-wrote the album and worked with producers such as DJ Camper and Kuk Harrell. ==Critical reception== Renowned for Sound gave R.O.S.E. 3.5 out of 5 stars, with Rachael Scarsbrook saying that \"splitting an album into four chunks is a brave move for a popstar, in a genre when fans are a little more casual and expect everything to be delivered to them in one all consuming format. That said, R.O.S.E. feels like Jessie J almost fully rejecting her more mainstream appeal in order to put out a collection of tracks that mean a great deal to her on a more personal level. It might not be the kind of thing I normally go for, but as a project it's actually quite skilled and enjoyable.\" ==Track listing== All tracks written by Jessica Cornish and Darhyl Camper, except where noted. All tracks produced by Camper, except where noted. ==Personnel== Credits adapted from Tidal. Performance * Jessica Cornish – vocals, background vocals, songwriting * Darhyl Camper – songwriting * Shuggie Otis – songwriting * Jerry Fuller – songwriting * David Foster – songwriting * Cheryl Lynn – songwriting * David Paich – songwriting Technical * Darhyl Camper – programming, production * Kuk Harrell – production * Hitmaka – production * Bongo ByTheWay – production * Simone Torres – engineering * Sauce Miyagi – engineering * Jaycen Joshua – mixing * David Nakaji – mixing assistance * Iván Jiménez – mixing assistance * Maddox Chimm – mixing assistance ==Release history== Release Date Label R (Realisations) 22 May 2018 Republic O (Obsessions) 23 May 2018 S (Sex) 24 May 2018 E (Empowerment) 25 May 2018 ==References== Category:2018 albums Category:Jessie J albums Category:R&B; albums",
 "title": "R.O.S.E. (Jessie J album)"
}