{
 "id": "846602",
 "text": "The Indian classical dances are the dance forms representing the exemplary standards within the traditional and long-established forms or styles of the Indian culture. According to the Encyclopedia Britannica, there are six classical dance forms of India. However, the number of classical dances vary in accordance to various sources. == Features == # It involves rigorous and systematic training # Positions are very precise and codified # Basic movements need to be taught by dance guru # first before a student has basic knowledge to grasp any choreography. # Dance movements in classical dance are complex and need repeated practice before one master them. # It takes several years of training to master classical dance # Classical dance involves lots of discipline and a specific posture is maintained. # In Indian Classical dance, the dance describes stories of Gods and Goddesses through sophisticated facial expressions and elaborate codified hand gestures # == Classical dances recognised by the Sangeet Natak Akademi == * Bharatanatyam, from Tamil Nadu * Kathak, from Uttar Pradesh * Kathakali, from Kerala * Kuchipudi, from Andhra Pradesh * Manipuri, from Manipur * Mohiniyattam, from Kerala * Odissi, from Odisha * Sattriya, from Assam == Classical dances recognised by the Ministry of Culture == * Chhau, from Eastern India (Odisha, Jharkhand, and West Bengal) * Gaudiya Nritya, from Manipur and West Bengal == Bharatnatyam == Bharatnatyam is a classical Indian dance form that originates from that originates in the temples of Tamil Nadu. The dance form is a reconstruction os Sadir, the art of temple dancers devadasis. Lord Shiva as Nataraja is considered the God of this dance form. Today, it is one of the most popular and widely performed dance form practiced by male and female dancers all over the world. The original name of Bharatnatyam was Sadir, Chinnamelan and Dasi Attam. A possible origin of the Bharatnatyam is that it comes after Bharata Muni, the author of Natya Shastra. Another popular etymology (explanation of the name) holds “Bhavan” means expression, “ragam” means melody and “Talam” means rhythm, finally, “Natyam” means dance, so the dance which has Bhavan, Ragam and Talam is called Bharatnatyam. === Aspects of Bhratnatyam === Bharatnatyam is a solo dance with two aspects Lasya, the graceful and feminine aspects associated with Goddess Parvati and Tandava , the masculine and rigorous aspects associated with Lord Shiva. === Training of Bharatnatyam === The Bharatnatyam training has been given its present shape by the Tanjore brothers. It begins with the practice of Adavus and then the students are taught the Margam from Pushpanjli, Kautvam, Alarippu, Jatiswaram, Sabdam, Varnam, Padams, Tilina. After many years of training, a student can perform an “arangetram”, the first solo performance by a student. Bharatnatyam compositions are based on Carnatic Music system of Ragams and talams. It features graceful and assertive movements that are performed imaginary lines and geometrical patterns == Kathak == Kathak is a dance form that originates from Uttar Pradesh, North India. It is said that: “Katha kahe so kathak,” which means that ‘He who tells a story is a Kathak’. The Kathak or professional story-teller had a thorough knowledge of the epics and mythology, village legends and local beliefs. It is said that the kathak was so adept at this art that he often kept a whole village absorbed while he sat entertaining them. === Dancing style of Kathak === Kathak is characterised bt graceful movements, subtle expressions and sophisticated use of rhythm. Technical virtuosity and flamboyance is complimented by subtlety in the depiction of moods and emotions. Pure dance is the predominant feature of Kathak. In Kathak, the dancer addresses directly to the audience. The knees are not flexed outwards or forwards as in the other classical dance form of India. The feet, with ghungroos around the ankles, beat out a whole range of rhythmic sounds. Skill in rendering intricate beats is fundamental to the style. === History of Kathak === Although, Kathak was an established tradition as a medium of worship during the Vaishnava age, it started being performed in courts with the coming of the Mughals. The dancer moved from thr temple courtyards to the palace durbar and this brought changes on the presentation as we know it today. Kathak saw a great period of glory in the 19th century during the reign of Wajid Ali Shah, the last nawab of Awadh. It was under his patronage that the Lucknow gharana was established. The two other important gharanas in Kathak are the Jaipur gharana and the Banaras gharana. == Footnotes == == References == Category:Dance in India",
 "title": "Indian classical dance"
}