{
 "id": "846776",
 "text": "The Platinum Jubilee of Elizabeth II was an event in the United Kingdom and the Commonwealth in 2022 for the 70th anniversary of Elizabeth II becoming the monarch of these places (ceremonial in the Commonwealth now) on 6 February 1952. Platinum Jubilee was her last jubilee as monarch because she died on 8 September 2022 at Balmoral Castle. She was the first British monarch to have a platinum jubilee. In the United Kingdom, another bank holiday was made and the normal May bank holiday weekend was moved to the start of June to make a special four-day weekend. The British government says there will be a \"once- in-a-generation show\" that have had the best art and technology in its displays and the best British ceremonial greatness. Carly Ledbetter, writing for the Huffington Post, says because the Platinum Jubilee was being planned, Elizabeth II did not plan to stop being the British monarch in favour of her son Charles III when she became 95 years old in 2021. == Celebrations == === United Kingdom === The Queen's traditional birthday parade, also known as Trooping the Colour, will happen on 2 June 2022 instead of the usual second Saturday of June. Ovens by lighting beacons will happen on 2 June in the United Kingdom, the crown dependencies and the oversea territories. Beacons will be lit in all capital cities of the Commonwealth countries for the first time. The traditional service of thanksgiving for the Queen's reign will happen at St Paul's Cathedral on 3 June. The Queen will come with other members of the royal family on 4 June to the Derby at Epsom Downs. A concert named 'Platinum Party at the Palace' will happen at Buckingham Palace that evening. Some of the biggest artists and entertainment stars will perform there. The BBC will make and show the concert. As with the Diamond Jubilee, they will work with the European Broadcasting Union. Members of the public will be invited to apply to come to the event. On the last day of the longer bank holiday, it is hoped people will have a 'Big Jubilee Lunch' and communities will celebrate their connections and know each other a little better there. Street arts, theatre, music, circus, carnival, buffets and costume celebrating the Queen's reign will happen in a pageant, where there will be more than 5,000 people from the United Kingdom and the Commonwealth, and Buckingham Palace in the background. ==Commemoration== A Platinum Jubilee medal will be made for the Jubilee. People who work in public service, including people who represent the Armed Forces, the emergency services and the prison services, will get them. It has been said the Severn Bridge should be named something else in honour of the Jubilee. The 2022 Corby Pole Fair will happen on Friday, 3 June 2022 because of The Queen's Platinum Jubilee celebrations. Historic Royal Palaces is planning for a Commonwealth-themed garden in the historic moat of the Tower of London. ===The Queen's Green Canopy=== A campaign, known as 'The Queen's Green Canopy', started in May 2021. It is hoped people in the United Kingdom will 'Plant a Tree for the Jubilee' to help the environment and make local areas greener, as a \"special gift\" for the Queen. The Prime Minister of the United Kingdom Boris Johnson said \"As we celebrate Her Majesty's incredible 70 years of service, I encourage everyone to get behind this scheme, and go 'Plant a Tree for the Jubilee'.\" ==References== Category:2022 in the United Kingdom Category:Elizabeth II Category:Events in the United Kingdom Category:February 2022 events",
 "title": "Platinum Jubilee of Elizabeth II"
}