{
 "id": "846770",
 "text": "Lisa Lisa and Cult Jam were an American pop, freestyle and urban contemporary band. The group was one of the first to come from New York City in the 1980s. The members of the group were vocalist Lisa Lisa (real name was Lisa Velez), bassist/guitarist Alex \"Spanador\" Moseley and keyboardist/drummer Mike Hughes. Their song \"I Wonder if I Take You Home\" was a freestyle chart topper on the United States' Billboard Hot Dance Club Play in June 1985 for one week. Onn the U.S. Hot R&B;/Hip Hop Songs, the song hit #6. The single went gold in the United States under the RIAA. The song was followed by another club hit, \"Can You Feel the Beat\", hit #6 on the United States' Billboard Dance chart in late 1985. The group's third single, \"All Cried Out\", also went gold. It hit #3 on the R&B; charts. It hit #8 on the Billboard Hot 100 chart during summer 1986. \"All Cried Out\" was covered by the by R&B; girl group Allure in the late 1990s. Lisa Lisa and Cult Jam's second studio album, Spanish Fly, was a strong success in 1987. It had two hit singles, \"Head to Toe\" and \"Lost in Emotion\". The earlier hit #1 on the U.S. Billboard Hot 100, Dance Club and Black singles charts. The latter hit #1 on the Billboard Hot 100 and Black singles charts. The group's last two albums, Straight to the Sky (1989) and Straight Outta Hell's Kitchen (August 1991), didn't do as good as their earlier albums. However, the 1991 song, \"Let the Beat Hit 'Em\", hit #1 on the R&B; and Dance Club charts. The group split up in 1991. ==References== Category:1980s establishments in New York (state) Category:1984 establishments in the United States Category:1990s disestablishments in New York (state) Category:1991 disestablishments in the United States Category:American R&B; bands Category:American pop music groups Category:Musical groups from New York City Category:Musical groups established in 1984 Category:Musical groups disestablished in 1991 Category:1980s American music groups Category:1990s American music groups",
 "title": "Lisa Lisa and Cult Jam"
}