{
 "id": "846803",
 "text": "\"99 Bottles of Beer\" is a backwards counting song in both the United States and Canada. == Lyrics == The words to the song are: Alternative lines: > If one of those bottles should happen to fall, (there'd be )98 bottles of > beer on the wall... Or: > If one of those bottles should accidentally fall, (there'd be )98 bottles of > beer on the wall... We repeat the line many times, with one less bottle each time. When there are no bottles left, a different line is used. Some lines that can be used for when there are no bottles are: > No more bottles of beer on the wall, no more bottles of beer. Go to the > store and buy some more 99 bottles of beer on the wall... Or: > No more bottles of beer on the wall, no more bottles of beer. We've taken > them down and passed them around; now we're drunk and passed out! Other alternate lines read: > If that one bottle should happen to fall, what a waste of alcohol! Or: > No more bottles of beer on the wall, no more bottles of beer( on the wall). > There's nothing else to fall, because there's no more bottles of beer on the > wall. Sometimes, the song does not stop when there are 1 or no bottles of beer left. In this case, the song keeps going with -1, -2, -3, and so on bottles of beer. == Andy Kaufman routine == American comedian Andy Kaufman had a comedy bit where he would sing all 100 verses. This was considered funny because the song is not usually completed due to its length. == Atticus == Atticus, a band from Knoxville, Tennessee, recorded a version of the song in front of people. It took 13 and a half minutes. It was recorded at a Glasgow, Scotland bar called The Cathouse. It was included in the 2001 album Figment. Rich Stewart, also known as Homebrew Stew, called it the number one drinking song out of 86 in an article for Modern Drunkard Magazine. == Math versions == Donald Byrd has dozens of versions of the song. These versions are inspired by math topics. The songs written by himself and others, and some of them have been published. Byrd says that the collection is fun and a good way to teach about infinity. Among his versions are: > Infinite bottles of beer on the wall, infinite bottles of beer; If one of > those bottles should happen to fall, infinite bottles of beer on the wall. > Infinite bottles of beer on the wall, infinite bottles of beer; If finite > bottles should happen to fall, infinite bottles of beer on the wall. These two verses can be repeated forever. == References == == Other websites == * 99 Bottles of OOP Book Category:Children's songs Category:1900s songs",
 "title": "99 Bottles of Beer"
}