{
 "id": "846847",
 "text": "Siege of Fort Bismarck (青島要塞爆撃命令, Chintao yôsai bakugeki meirei) is a 1963 Japanese war drama film directed by Kengo Furusawa, with special effects work by legendary SFX director Eiji Tsuburaya. The plot is about during World War I, Japanese planes assault a lone German enemy outpost. The movie was shot in aspect ratio and cinemascope (TohoScope). Another film that was released this year is Zoku shachô gaiyûki (part of Shacho series), directed by Shūe Matsubayashi. == Overview == The film was set in World War One (1914-1918), which is rare for a Japanese movie. Based on the real Siege of Tsingtao. the story is about a group of young pilots of the Imperial Japanese Navy led a task team to destroyed the Germans communication posts, ammunition depots, and air-aircraft defenses, making way the Allied forces to captured the port city. These men were part of Japan's first naval aviator corp. In overseas countries like Europe and the United States, it was released under the title \"Siege of Fort Bismarck.\" In addition to the usual Japanese subtitles lined up in the corners of the screen, the lines of the German soldiers in the scenes are other works such as handwritten subtitles such as \"The enemy is brave!\" and \"The bottom is brave!\" The production is not seen in Germany. For the filming, in addition to the elaborate miniature of the Farman MF.11 and Etrich Taube with a wingspan of 1 meter or more, a full-scale model for shooting the main story with a propeller rotating was produced. In both cases, the shooting was done in addition to the set, and on Mt. Fuji, it was filmed from a helicopter. The full-scale model of the Farman MF.11 seaplane was assembled by a craftsman specializing in gliders by borrowing the disassembled actual machine saved by the Japan Aeronautic Association and creating a restoration drawing. The seaplane carrier Wakamiya was also photographed using a cargo ship. The scene on the ship was shot on the battleship \"Mikasa\" was preserved at Mikasa Park. The Fortress Bismarck set was a huge open set in Gotemba and was taken aerial shots from a helicopter. However, at the time of production, the position of the gunpowder was not from the helicopter, and the timing of shooting was about 4 out of 10 shots. The train model that appears at the climatic moment was custom-made in a steel miniature and was shot with an unmanned camera that was also partially used in Godzilla back in 1954. This miniature was exhibited at the 2012 event \"Director Hideaki Anno Special Effects Museum Miniature Showa Heisei Techniques\". == Plot == In 1914, The Great War began which was originated in the Balkan Peninsula and extended to the Far East. This is because Germany has occupied the Kiautschou Bay concession of China and made Qingdao a base for the invasion of Asia. Japan (who was part of the Anglo- Japanese alliance of 1902) is requested by Allied Powers (United Kingdom, France and Russia) to joined in the war and seized the base in Qingdao. However, a huge artillery batteries is placed at Fort Bismarck, and even the combined fleet that the Imperial Japanese Navy is proud of planning a operation, making it extremely difficult to capture the base. At that time, Admiral Katō Sadakichi, suddenly set up a task team in the early days of the flying corps stationed at the \"Oppama Navy Aeronautical Research Institute\" (追浜海軍航空術研究所, Oppama kaigun kōkū-jutsu kenkyūjo). The unit also consists of two Farman seaplanes, with Major Osugi as commander and a total of five pilots, including Shoji, who has never boarded an airplane before. These men would became the first task team to do such dangerous operation. However, Osugi decides to sort for the survival of his unit. By late September, the seaplane carrier Wakamiya loaded up the biplanes on the deck, became the world's first aircraft carrier and headed for Qingdao. And finally, it's time for the first operation to destroyed the fortress. The Mo-type seaplane on which Osugi and Kunii were piloting was not in time for the bomb, and while bricks and five- inch nails, it started with the enthusiastic farewell of the crew. While fitting in the air pocket and connecting the broken wire of Kunii on the wings, they managed to drop bricks and five-inch nails onto the German trenches from above to scout the fortress. However, the enemy Etrich Taube plane flies there and battled them. In contrast to the Taube, who is armed with a Maxim machine gun, the Mo-style plane has only a pistols for self- defense, and Taube, who provokes in aerobatic flight, is forced to disperse. After that, the squadron set up a base on Mount Putuo near the bay to prevent the danger of entering the base. Osugi responds to the request of the islanders, such as Yang Hakurei, the girl dancer Maki saved her from the predicament at a dance festival. However, a bottled letter reveals that the islanders has a spy among them. And on the night of the festival, Hakurei's older brother, Zhao Hidetoshi, set fire to the junk boat and planned to sink the Wakamiya. While the fire armada junk approaches the seaplane carrier, Shoji jumps into the sea and is killed after being caught in a junk explosion while trying to change the bow of the boat, saving his team in the process. Hidetoshi was also shot dead by Ninomiya after calming he was a spy for the Germans. The headquarters demanded that Hakurei be punished by the island's troops, but Osugi and his fellow pilots refused to hand over her to the continent under Article 123 of the Fictitious Navy Criminal Code and they might get the information from her about the defense plan. Osugi devised a plan to drop a bomb hung on Unit 1 while Unit 2 on which the machine gunner was riding to distracted the Taube plane. He sort out the ideas and executes the operation, but the bomb fails without hitting a single hit. Moreover, Unit 2, piloting by Ninomiya and Maki, managed to kill the Taube's machine gunner, but crashed after being hit by the engine. Ninomiya and Maki manged to escape to a general store, but the two who had the prize money are pushed out by German soldiers by the shop owner and become prisoners of war. Hakurei, who appears in front of the two in the dungeon, sentenced them to death. However, on the way to the execution site, Hakurei escapes with them. On the other hand, one month has passed since the start of the capture of Qingdao had planned out, and as the German Far East Unit approached to the bay, there were many opinions that the fleet should also start a total attack without relying on aircraft. Admiral Kato realizes that the plane was premature and decides to demote the Wakamiya to a carrier and make a total attack. Meanwhile, only Maki returned to the Wakamiya. Osugi devise a strategy to take off the remaining one plane without a bomb, replenish fuel and explosives after landing on the shore, and then bomb the ammunition depot at Bismarck Fortress. Osugi commands the task team and lands, deceiving the eyes of the German soldiers and heading for the supply depot. However, at that time, the Wakamiya was sunk by a naval mine .The seaplane floating on the sea took off for the ammunition depot bombing with the encouragement of the drifting Wakamiya crew. == Staff == * Producer: Tomoyuki Tanaka * Screenwriter: Katsuya Susaki * Cinematographer: Fukuzô Koizumi * Production Designer: Takeo Kita * Sound Recordist: Toshiya Ban * Lighting Technician: Mitsuo Kaneko * Music Composer: Hachirô Matsui * Sound Effects Editor: Hisashi Shimonaga * Assistant Director: Kôji Kajita * Editor: Yoshitami Kuroiwa * Sound Effects: Tomohisa Chōgorō * Development: Tokyo Laboratory * Story Developer: Shigeru Nakamura * Director: Kengo Furusawa === Special Effects staffs === * Special Effects Cameraman: Sadamasa Arikawa * Special Effects Lighting: Kyuichirô Kishida * Special Effects Coordinator: Keiji Koike * Special Effects Assistant Camera: Yukio Manoda * Matte Work: Hiroshi Mukoyama * Chief Assistant Director of Special Effects: Teruyoshi Nakano * Special Effects Cameraman: Sokei Tomioka * Special Effects Director: Eiji Tsuburaya * Special Effects Art Director: Akira Watanabe * Special Effects Assistant Camera: Taka Yuki == Cast == * Yuzo Kayama as Lieutenant Kunii * Makoto Sato as Lieutenant Maki * Yosuke Natsuki as Lieutenant Ninomiya * Ryo Ikebe as Major Osugi * Mie Hama as Yang Hakurei * Susumu Fujita as Admiral Katō Sadakichi * Akihiko Hirata as Lieutenant Yoshikawa * Jun Tazaki as Commander Murata * Tôru Ibuki as Candidate Pilot Shoji * Masahiko Naruse as Zhao Hidetoshi * Kan Yanagiya as Lieutenant Toda * Yasuhisa Tsutsumi as Sergeant Ota * Gen Shimizu, Kozo Nomura, Shin Otomoas Combined Fleet officers * Shoichi Hirose as NCO of the Guard * Akira Wakamatsu, Akira Yamada as Supply members * Bokuzen Hidari as Cow car master * Toyohiko Sata as Elderly man * Yoshinobu Kaneko as Boy * Katsumi Tezuka, Akio Kusama as Combined Fleet staffs * Masanari Nihei, Yutaka Oka, Yukihiko Gondo as Sailors making fun of Yang Hakurei * Shizuji Yoshida, Yukiyuki Uemura as Japanese soldiers * Werna Wentz as Lieutenant Lange * Ralph Jesser as Lieutenant Berge * Osman Yusuf as Prison guard * Gunta Romenas as Train guard * Erie Landsman as Engineist * Jesse Jyunen as Watchman guard * Harold Conway as British General Nathaniel Walter Barnardiston * Sabel Jameel as Russian General Aleksei Brusilov * Émile Maurice as French General Louis Franchet d'Espèrey == Movie software == The film was released by Toho (with commentary by film critic Sadao Yamane) and was made into a DVD in 2007.",
 "title": "Siege of Fort Bismarck"
}