{
 "id": "846944",
 "text": "A Low-carbohydrate diet is a type of diet that focuses on lowering the amount of carbohydrates eaten. There are many variations of this diet which all focus on lowering carbohydrates and might have different advantages and disadvantages. == Overview == === Macronutrient ratios === The National Lipid Association and Lifestyle Task force define low-carbohydrate diets as those containing less than 25% of calories from carbohydrates. They define very low carbohydrate diets as those containing less than 10% carbohydrates. A 2016 review of low-carbohydrate diets referred to diets with 50 grams of carbohydrate per day (less than 10% of total calories) as \"very low\" and diets with 40% of calories from carbohydrates as \"mild\" low-carbohydrate diets. === Foods === There is evidence that the quality is also important too, and that high-fiber slow-digesting foods are healthful while ultra-processed and sugary foods are less so. People choosing diet for health conditions should have the diet focused on their own needs. Most vegetables are low- or moderate- carbohydrate foods. Some vegetables, such as potatoes, carrots, maize (corn) and rice are high in starch. Most low-carbohydrate diet plans encourage to eat vegetables such as broccoli, spinach, kale, lettuce, cucumbers, cauliflower, peppers and most green-leafy vegetables. == History == === First appearences === In 1797, John Rollo reported on the results of treating two diabetic Army officers with a low-carbohydrate diet and medications. A very low- carbohydrate, ketogenic diet was the standard treatment for diabetes throughout the nineteenth century. In 1863, William Banting, a formerly obese English undertaker and coffin maker, published \"Letter on Corpulence Addressed to the Public\". He described a diet for weight control giving up bread, butter, milk, sugar, beer, and potatoes. His booklet was widely read, so much so that some people used the term \"Banting\" for the activity now called \"dieting.\" In the early 1900s Frederick Madison Allen made a highly restrictive short term diet which was described by Walter R. Steiner at the 1916 annual convention of the Connecticut State Medical Society as The Starvation Treatment of Diabetes Mellitus.Another publication of similar diet was This diet was often administered in a hospital in order to better ensure following and safety. == References == Category:Diets",
 "title": "Low-carbohydrate diet"
}