{
 "id": "847044",
 "text": "\"SLAPP Suits\" is a part of the HBO show Last Week Tonight with John Oliver. It is focused on strategic lawsuits against public participation, known as SLAPP suits–lawsuits made to scare people out of saying anything bad about someone else. It was first played on November 10, 2019, as part of the twenty-ninth episode of the series's sixth season. During the twenty six-minute video, comedian John Oliver talked about the result of a lawsuit against him from mining businessman Robert E. \"Bob\" Murray. He talked about the harmful effects of lawsuits like that. Oliver then ended the clip with a song entitled \"Eat Shit, Bob!\" in honor of winning his lawsuit. == Background == === Coal === On June 18, 2017, John Oliver played a video on his show, called \"Coal\". Itt was about the coal mining industry. Oliver began the piece by showing Donald Trump's fondness for the coal industry. He played videos of him when he was running for president in 2016 in a coal miner's hat and talking to a crowd that had miners in it. In the speech, he told the miners to prepare to work their \"asses off\" when he became President. Oliver then introduced Bob Murray, who is the head of Murray Energy. Oliver explained that he and his team talked to Murray Energy about this segment before showing it. He said that he received a letter from Murray Energy telling him that he should cease and desist from–or stop–\"any efforts to [...] injure Mr. Murray\". Oliver also said that Murray has sued people before. Oliver ignored this letter. He called Murray a \"geriatric Dr. Evil\" who was \"on the same side as black lung\". Oliver also talked about other errors in the way Murray's miners were told to do their jobs. Oliver particularly talked about the Crandall Canyon Mine collapse that killed 9 people. Bob Murray argued that it was the fault of an earthquake. However, the federal government said that it was the fault of the dangerous way miners were told to do their jobs. The government told Murray Energy that they had to pay . This is the highest amount possible the federal government can make someone pay for doing a dangerous thing like this. Oliver then talked about Murray's program for coal miners to earn more money. The workers did not like the program. They said that it might encourage them to do dangerous things for more money. The company told the workers that they could return their money if they felt they were being encouraged to do risky things. Two miners gave back the money, writing the words \"KISS MY ASS BOB\" and \"Eat Shit Bob\" on their checks. Oliver also talked about Murray also sharing a story that he received the idea to start a coal mining business from a talking squirrel. Drawing on the two stories, Oliver ended the episode by introducing a squirrel mascot known as \"Mr. Nutterbutter\" (played by Noel MacNeal). Mr. Nutterbutter taunted Bob Murray by holding up an big check–a piece of paper making a promise to pay money–for \"three acorns and eighteen cents\". The money was addressed to \"Eat Shit, Bob!\" === Lawsuit === On June 22, 2017, some companies owned by Bob Murray said that they had filed a lawsuit. The lawsuit was against John Oliver, HBO, and others close to Oliver. Bob Murray said that Oliver had defamed them–said untrue and bad things about Murray and his company. The plaintiffs said that they didn't like the way Oliver talked about the Crandall Canyon Mine collapse. They repeated what they had said before about the mine collapse–that it was because of an earthquake and that Oliver was lying. They also said that because so many people watch Oliver's show, that he was unfairly hurting Murray. Murray wanted money from Oliver, as well as a gag order–a court telling someone not to say something–stopping people from watching the segment. Someone who talks for HBO said that HBO was happy with the show. They that they did not believe that \"anything in the show this week violated Mr. Murray’s or Murray Energy’s rights\". On February 24, 2018, the case was thrown out. This was because the judge agreed with HBO's argument that Murray hadn't shown that anything was wrong with what Oliver did. Bob Murray asked another court to reconsider the case. Before they could, all the justices on that court were fired. The case was dropped soon after. Oliver later said that this was a relief to him. This was because he had made a joke on his show a few years before. He said that the head Justice on the court, Allen Loughry, referred to his penis as \"The Gavel\". ==== Amicus curiae ==== The ACLU–an activist group of lawyers–wrote a letter to the court for Oliver. People liked the letter because it was funny and sarcastic. This is not common in that type of letter. The paper had lines such as \"You Can’t Sue People for Being Mean to You, Bob\" and \"A Brief History of Plaintiffs’ Attempts to Chill Speech by Abusing the Legal System.\" The letter said that Oliver's segment did not say anything that was bad for Murray. They said some of the statements were jokes, and the rest were true. The letter said that Murray was using the court as a way to force people not to say things. The argument was helped by a list of Murray's other lawsuits. The ACLU listed lawsuits thrown out by the courts against HuffPost, a newspaper in Chagrin Falls, Ohio, Bloomberg News, and other papers and activists. Murray didn't like the way people were talking about the letter. Murray Energy wrote their own letter to the court. It said that the court shouldn't read the ACLU letter. They said this was because ACLU didn't make it clear that they made money because of Oliver's show. Murray didn't like the way the ACLU worded their letter. They wrote that the biased tone by itself should make the court throw away the other letter. 5 days after the 2016 United States presidential election, Oliver's show made a video called \"President-Elect Trump\". Oliver told to donate to activists they saw as left-leaning. These clauses included Planned Parenthood, the NAACP Legal Defense and Educational Fund, The Trevor Project, the Center for Reproductive Rights, and the International Refugee Assistance Project. Murray Energy said that this encouragement caused an \"immediate surge of millions of dollars in donations to the ACLU\". Because of this, said Murray Energy, the court should throw away the ACLU's letter. Reuters argued that Murray Energy did not prove that what they said was true. They said this because Murray provided links to three articles to prove what they said. None of the articles backed up what Murray said. The articles did agree that the activists got more money. However, they said that it was because of the election, and not because of Oliver's show. == Episode == On November 10, 2019, John Oliver put out a video on his show, called \"SLAPP Suits\". Oliver began by recapping the legal fight so far. Oliver said that even though he won the lawsuit, his insurance company tripled his monthly fee and that his show paid to the show's lawyers. Oliver then argued that Bob Murray never intended to win the case. Instead, Oliver said that Murray wanted to scare HBO and him into silence. This led Oliver into the main point of the segment—SLAPP suits, which are lawsuits designed to scare people into not saying bad things about someone else, even if they are true. Oliver pointed out that Murray has filed at least nine lawsuits against news companies and journalists who have said bad things about him, including the Huffington Post and The New York Times. Oliver argued that Murray has sued those who aren't lucky enough to have the support of a large company like HBO and their own insurance. He then suggested that because those people might be scared of Murray, they won't say anything bad about him. Oliver argued that this led to almost nobody in the press writing about two sexual harassment cases against Murray. One of these cases involved Murray asking a woman employee to get on her hands and knees and find a kidney stone that Murray had passed and lost. Oliver said that the segment was checked over by HBO's lawyers (who he joked were \"getting very tired of this\"). However, he also said that the episode would likely lead to another lawsuit from Murray. Oliver said that he would stand behind his works if it were to happen. When Judge Jeffery D. Cramer threw out Oliver's case, he noted that people are allowed to use \"loose, figurative language\". Oliver brought this up as his reason to create a musical number to end the episode. === Musical number === Oliver took the name of \"Eat Shit, Bob\" from the money the miner returned. He then acted in a five-minute musical number, initially set in his studio. There, he began singing slowly that \"even though he'll threaten legal Armageddon, we have just one tiny thing to say...\" Then, P;over put up his middle finger and exclaimed \"Bob Murray can go fuck himself today!\" He then introduced the \"Suck My Balls, Bob\" dancers. The dancers to Times Square as they recounted fake stories of Murray doing crazy and terrible things. They joked that he caused the 1994 Cobo Arena attack on Nancy Kerrigan, shot puppies into outer space, supplied drugs to Bill Cosby, murdered Archduke Franz Ferdinand of Austria and started World War I, and was the Zodiac Killer. Oliver based parts of the song on his legal defense. He sang that \"we made up these anecdotes, they're silly and insane\". He also said in the beginning of the piece that \"If we discuss Bob Murray in a way no reasonable person could construe as factual, we can say whatever the fuck we like!\" Mr. Nutterbutter came back with a barbershop quartet in squirrel costumes. They joked that Bob Murray practiced bestiality with squirrels. Brian d'Arcy James also made an appearance as HBO's legal counsel. At first, he told everyone to stop singing and dancing. Then, James went into his own segment. There, he recounted Bob Murray forcing tourists at the New York City M&M;'s Store to watch as he \"crammed them (M&M;'s) up his anal hole.\" The number was nominated for a Primetime Emmy Award for Outstanding Original Music and Lyrics. == Reaction == An opinion from the Charleston Gazette-Mail said that there was \"a lesson in John Oliver roasting Bob Murray\". The lesson was that we should think about why states like West Virginia have relaxed anti-SLAPP laws. The musical number was well-liked. The A.V. Club said that the episode was a demonstration in \"why rich assholes really shouldn’t sue John Oliver\". They also said that the musical number was \"glorious\" and \"over-the-top\". Slate said that just because Oliver gave an \"impassioned speech standing up for all the small outlets and independent activists bullied into silence by SLAPP lawsuits,\" that does not mean John Oliver \"has matured even a little bit\". The Mary Sue commented that Bob Murray's SLAPP suits create a \"culture of fear in which Murray ends up able to succeed in his goal of stifling any criticism of him and his industrial operations\". However, they also say that Murray \"may have picked too big a fish\" in John Oliver, adding that \"Of course, this is John Oliver we’re talking about and 'culture of fear' is basically his Bat-Signal.\" == References == Category:2019 in television Category:United States law",
 "title": "SLAPP Suits"
}