{
 "id": "847188",
 "text": "Jesse Alan Marsch (born November 8, 1973) is an American football former player and football manager who was formerly the manager of Premier League club Leeds United. ==Career== Marsch started his career with College football with the Princeton University. 1996 he was drafted by D.C. United. 1998 he went on to Chicago Fire. 2005 he came to CD Chivas USA. 2010 he ended his career as player. ==International career== Marsch played two matches for the national team. ==Manager== Marsch started his career as assistence coach of the US national football team. From 2011 till 2013 he was head coach of Montreal Impacts. From 2013 till 2015 he was assistance coach of the Princton Tigers the football team of the Princeton University. From 2015 till 2018 he was headcoach of the New York Red Bulls. In the 2018/19 season he went to Europe and became assistance coach to Ralph Rangnick with RB Leipzig in the German Bundesliga. 2019 till 2021 he was headcoach of FC Red Bull Salzburg. In 2021 he became headcoach of RB Leipzig but was dismissed in December of the same year. After one year in Leeds he became coach of the Canada men's national soccer team. ==Coaching statistics== Coaching record by team and tenure Team From To Record Montreal Impact August 10, 2011 November 4, 2012 New York Red Bulls January 7, 2015 July 6, 2018 Red Bull Salzburg June 6, 2019 June 30, 2021 RB Leipzig July 1, 2021 December 5, 2021 Leeds United February 28, 2022 February 6, 2023 Total ==Honors== ===Player=== D.C. United *MLS Cup: 1996, 1997 *Supporters' Shield: 1997 *U.S. Open Cup: 1996 Chicago Fire *MLS Cup: 1998 *Supporters' Shield: 2003 *U.S. Open Cup: 1998, 2000, 2003 ===Manager=== New York Red Bulls *Supporters' Shield: 2015 Red Bull Salzburg *Austrian Bundesliga: 2019–20, 2020–21 *Austrian Cup: 2019–20, 2020–21 Individual *MLS Coach of the Year: 2015 ==References== Category:1973 births Category:Living people Category:Association football midfielders Category:Football managers Category:FC Red Bull Salzburg managers Category:RB Leipzig managers Category:New York Red Bulls managers",
 "title": "Jesse Marsch"
}