{
 "id": "847191",
 "text": "Stepmom is a 1998 American comedy and drama movie. It has themes of terminal illness and friendships between couples. ==Plot== Jackie and Luke Harrison are a divorced New York City couple. They try hard to co-parent their daughter Anna and son Ben. The couple helps the kids deal with the lifestyle change. Luke is a lawyer, He is living with his girlfriend for one year, Isabel Kelly. Isabel is a successful fashion photgrapher his junior by several years. Isabel has never wanted to be a mother. However, she tries hard to make Anna and Ben more around her. Anna rejects Isabel's overtures. Ben likes Isabel, though he makes things harder with his mischief. Isabel behaves with contempt. She is very cautious around Jackie. She believes Jackie compensates too much for the divorce when she spoils her children. Jackie is a former publisher. She has become a stay-at-home mom. Jackie treats Isabel coldly. She (Jackie) sees Isabel as an immature, selfish and overly ambitious career woman. Jackie also has plans to hurt Luke. This is seen during fights on Isabel's ability to parent. It becomes obvious Jackie was battling cancer for some time. The cancer is now set to kill her. Isabel and Anna's relationship begins improving. They bond over shared hobbies, like painting and music. On Christmas morning, the family get together to celebrate. Jackie is now bedridden. She shares emotional moments with her children. Jackie tells them she will remain with them as long as they remember her. ==Cast== * Julia Roberts as Isabel Kelly * Susan Sarandon as Jackie Harrison * Ed Harris as Luke Harrison * Jena Malone as Anna Harrison * Liam Aiken as Ben Harrison * Lynn Whitfield as Dr. Sweikert * Darrell Larson as Duncan Samuels * Mary Louise Wilson as School Counselor * Andre B. Blake as Cooper * Herbert Russell as Photo Assistant * Jack Eagle as Craft Service Man ==Reception== Stepmom got mixed reviews from critics. Rotten Tomatoes sets the approval rating of the movie at 46%. Despite the substandard critic reviews, the movie took in over $91 million in the United States. Across the world, it took in over $159 million. The movie was released on Christmas Day 1998. Susan Sarandon was nominated for a Golden Globe Award for the Best Actress – Motion Picture Drama. The San Diego Film Critics Society gave her an award for the Best Actress for her role in Stepmom. Ed Harris received an award for Best Supporting Actor from the National Board of Review for his role in that same movie. ==References== Category:1998 comedy-drama movies Category:1990s English-language movies Category:Movies about dysfunctional families Category:Cancer in movies Category:Movies directed by Chris Columbus",
 "title": "Stepmom (1998 movie)"
}