{
 "id": "847385",
 "text": "Association Trio (, asotsirebuli trio; ; ) is a tripartite format for enhanced cooperation, coordination and dialogue between the Ministries of Foreign Affairs of Georgia, Moldova and Ukraine, the three EU Associate Partners, and the European Union on issues of common interest related to the European integration of states, including cooperation in the framework of Eastern Partnership for the sake of joining the European Union.Україна, Грузія та Молдова створили новий формат співпраці для спільного руху в ЄС | Європейська правда (eurointegration.com.ua) The participants of the format express a clear position of the aspiration of the three European states of the \"Associated Trio\" for membership in the European Union and reaffirm their commitment to further progress in implementing the Association Agreements with the EU, which, however, is not the ultimate goal of their relations with the EU. In this context, they recall that under Article 49 TEU, European countries, Georgia, the Republic of Moldova and Ukraine have a European perspective and can apply for membership of the European Union, provided that all the necessary criteria for EU membership are met. Coordinating their actions, Georgia, Moldova and Ukraine seek to expand the possibilities of association agreements, promote sectoral convergence with the EU (integration into the Digital Single Market, energy and customs union, ENTSO-E, and, of course, with the Schengen Area; transport cooperation, green course, justice and home affairs, strategic communications, health, security and defense) and gradual integration into the European Single Market. == Related pages == * Lublin Triangle == Notes == == Other websites == * Memorandum of Understanding between the Ministry of Foreign Affairs of Georgia, the Ministry of Foreign Affairs and European Integration of the Republic of Moldova and the Ministry of Foreign Affairs of Ukraine Category:2020s treaties Category:2021 establishments in Europe",
 "title": "Association Trio"
}