{
 "id": "847324",
 "text": "Rocky V is a 1990 American sports drama movie directed by John G. Avildsen and starring Sylvester Stallone, Talia Shire, Burt Young, Sage Stallone, Tony Burton, Tommy Morrison, Burgess Meredith, Richard Gant. It is the sequel to the 1985 movie Rocky IV and is the fifth movie in the Rocky franchise. The movie was distributed by United Artists and was nominated for 7 Razzie Awards in 1991. ==Plot summary== Shortly after winning a boxing match against Ivan Drago, Rocky and his family return to the United States. When the family returns home, it is revealed that Paulie had signed a power of attorney over to Rocky's accountant, who sabotaged the family's entire fortune of real estate deals gone sour. In addition, the accountant did not pay Rocky's tax returns within the past known years, and the mortgage on the family's mansion is in debt worth $400,000. When Rocky sees a doctor, it is revealed that he has suffered some brain damage, which forces his to regret his decision to continue boxing and retire. After selling the mansion and auctioning off some of the belongings, the family has paid off the mortgage debt and moves back to their former site in southern Philadelphia. One day, Rocky meets someone named Tommy Gunn, and agrees to train him. Rocky becomes so fixated on training Tommy that he ends up neglecting his family, especially for his son Robert, who is being harassed in school. Around the holidays, promoter George Washington Duke visits the Balboa residence, which foreshadows Tommy turning his back on Rocky. Rocky reconnects with his family, while Tommy wins the boxing championship against Union Cane. The media condemns Tommy for leaving Rocky, a concept of which Tommy brushes away. Duke recommends Tommy to have a street fight with Rocky, which proves to be the only way of facing a true contender. Tommy engages Rocky in a street fight with nearby neighbors in support of Rocky. The duel ends in a stalemate, where the police arrest both Tommy and Duke for their actions. Later, Rocky and his son Robert discuss what might come of the future. == Other websites == * * * * * * * Category:1990s sports movies Category:1990 drama movies Category:1990s sequel movies Category:American sequel movies Category:Rocky movies Category:Movies directed by John G. Avildsen",
 "title": "Rocky V"
}