{
 "id": "847314",
 "text": "A Maiba or an Amaiba (literally, \"priest\") is a male religious leader authorised to perform the sacred rites and rituals of Sanamahism (Meitei religion), especially as a mediatory agent between human beings and one or more deities. They have the authority or power to administer religious rites as well as sacrifices to gods. Their office or institution is called Maiba Loishang (Maiba Loisang), later renamed as Pandit Loisang, during Aryanisation of Meitei culture. They also served as healers, doctors, magicians, medicine men, physicians and shamans. They play important roles in the ancestor worship (apokpa khurumjaba) ceremony. Chief priest or chief among the maibas is called Maichou, a term formed with the amalgamation of two words (\"maiba\"- priest, \"achouba\"- big, chief, great). Since their position is not hereditary, they acquire their positions through talent and skills. The female counterpart of a Maiba is a Maibi. == Family wise obligations of the Maiba priesthood == According to the Loiyumpa Silyel Constitution,Manipur: Treaties & Documents. India: Mittal Publications, 1993. p. 7–11 1\\. Asheibam family is responsible for attending to the cleansing of the monarch. 2\\. Aram-bam family is responsible for taking care of the bathe. 3\\. Toibicham family is responsible for playing the Tharaochi (Meetei musical instrument). 4\\. Arupam (Arubam) family is responsible for maintaining cleanliness and purity. 5\\. Aheibam family is responsible for making the Pukhamnati (plate with decorated rim). 6\\. Loukham family is responsible for drawing the Meiba (Meetei device to produce fire). 7\\. Maibathiyam family is responsible for throwing the Shingkhai (Meetei prognostication-device) and entering the trance of dream. 8\\. Meihoubam family is responsible for igniting the fire. 9\\. Meiphuwam family is responsible for blowing in the fire. 10\\. Tokpam family is responsible for digging in the soil. 11\\. Tokpuram (Tokpram) and Thangsabam families are responsible for piling up the earth. 12\\. Naoroibam family is responsible for taking the baby in custody. 13\\. Ngathem family is responsible for calling the Ngami (beckoning the fishes). 14\\. Shingkhangpam family is responsible for fetching the dry wood fuels. 15\\. Haomukpam family is responsible for making the phak (mattress for sitting). 16\\. Khoirisungbam family is responsible for weaving the Khoiriphi (Meetei cloth). 17\\. Khoiriyanpam family is responsible for severing the umbilical cord. 18\\. Lairencham family is responsible for washing the black clothes. 19\\. Thoupicham family is responsible for managing the plantain leaves. 20\\. Leishaonbam family is responsible for making the boats. 21\\. Yelwam family is responsible for taking in the hen. 22\\. Nganukappam family is responsible for looking after the Nganu (duck). 23\\. Khugolthem family is responsible for carrying back the hameng (goats). 24\\. Okrambam family is responsible for taking back the Ok (pig). 25\\. Waleppam (Wareppam) family is responsible for adoring the bamboo. 26\\. Maibam family is responsible for invoking the Chupshaba (priest’s invocation for cessation of recurrent deaths). 27\\. Ngangom family is responsible for throwing the Konyai (gold and silver device used by the priest). 28\\. Yenkokpam family is responsible for descending the yerum (egg) to the earth (forecast device). 29\\. Khumukcham family is responsible for taming the tiger. 30\\. Khaidem family is responsible for supervising the body under cremation. 31\\. Amakcham family is responsible for taking hold of the bow and arrow. 32\\. Mangshatabam family is responsible for supervising the grave. 33\\. Wanglenbam family is responsible for beating the drum. 34\\. Kabrambam family is responsible for managing the Leishoupung (mount of aerated soil). 35\\. Kontenakathang priest family is responsible for preparing the Chup for the deity. 36\\. Shoukrakpam family is responsible for making the chaphuwalong (pot). 37\\. Ngaseppam family is responsible for slicing the fishes. 38\\. Thingnongchaorong priest family is responsible for worshipping the Lainingthouhanba. == Duties of the Tampak Maiba groups (people's priests) == 1\\. Khabalangthangchakaba Wamaiba group is responsible for idolizing the Naohal Ahalba (sylvan deity). 2\\. Jagoiwa priest group is responsible for deifying the Koubarel. 3\\. Langmei priest (Luwang Maiba) group is responsible for worshipping the Chakhaba. 4\\. Thongnangkaipiya priest group is responsible for deifying the Muwaningthou. 5\\. Khayoipariyang priest group is responsible for worshipping the Marjing. 6\\. Loiyamsanggai priest group is responsible for glorifying the Koubru. 7\\. Asheibam group is responsible for chanting sanalamok (hymn for deities). 8\\. Ashem Ngakhakhoi group is responsible for chanting the Yakei Eshei (Yakairol). 9\\. Paobam group is responsible for listening to the message of god at Paodahidel. 10\\. Laishram group is responsible for paying service to the Santhong. 11\\. Lantham group is responsible for singing the Lalpha song (song regarding victory in war). 12\\. Khraijam group is responsible for looking after the Khraithong (gate). 13\\. Akhongbam group is responsible for beating the Khong (musical instrument used in Chakpa sylvan festival). 14\\. Mutum group is responsible for idolizing the Lalhampung (Lalambung). 15\\. Thingnam group is responsible for deifying the Ukrong. 16\\. Shingkham group is responsible for singing the Langmairol. 17\\. Thongam group is responsible for singing the Ahonglon (song for the god Sanamahi). 18\\. Shoraisham group is responsible for singing the Khoichulamok lamkok (song in the sylvan festival). 19\\. Chandam group is responsible for singing the Khongchinglon (for the festival of Moirang Thangjing). 20\\. Thiyam group is responsible for adoring the boat. 21\\. Apucham group is responsible for paying homage to Pukshri (a paddy-eating worm in the field). 22\\. Nongpokpam group is responsible for invoking the rain god. 23\\. Waikhom group is responsible for gathering the husk. 24\\. Akoijam group is responsible for singing the hymn of Mikol (a song that harmonizes the soul and spirit). 25\\. Salam group is responsible for idolizing the Langmaiching (Nongmaijing mountain) and acting the role of Tangkhul Sharam Pakhangba (Nongpokningthou- king of the east). 26\\. Hidam group is responsible for making the Sanaliphak (royal mattress). 27\\. Khamnam group is responsible for offering the Khamnungcheiyom (offering at the royal grave). 28\\. Amaipi group is responsible for offering the Leiraiyu (offering to the local deity). 29\\. Nongton Amaibi group is responsible for dipping in the Laija Phuhing (offering of Khayomlapkpa by use of unburnt earthen pot). 30\\. Phura Amaibi group is responsible for entering the trance of Phura Laiyum and listening to the Mang (Meetei way of receiving oracle through the Maibis, white robed). ==Gallery== File:Plate 12-1 Folk-Lore, vol. 24.jpg|Maibas dancing to please God Thangjing at the Lai Haraoba festival in the Ibudhou Thangjing Temple in Moirang File:Plate 11-2 Folk-Lore, vol. 24.jpg|Maibas playing Penas to please God Khamlangba File:The_tableau_of_Manipur_passes_through_the_Rajpath_during_the_full_dress_rehearsal_for_the_Republic_Day_Parade-2018,_in_New_Delhi_on_January_23,_2018.jpg|A tableau showing the motif of a Maiba, on the Republic Day of India in New Delhi ==Other websites== * * * * * * * ==References== Category:Meitei religion",
 "title": "Maiba"
}