{
 "id": "847470",
 "text": "Domenica \"Nikka\" Costa (born , Tokyo, Japan) is an Australian-American singer- songwriter, whose music has elements of pop, soul, funk, blues, progressive rock, new wave, synth-pop and electropop. She began her singing career as a child singer in the early 1980. She is also a movie actress and professional mermaid. == Biography == Costa's career as a recording artist with her own name began in 1981. That year, she recorded the song \"Out Here on My Own\". Her self-titled album was released outside the United States in the same year. Costa then toured the world. Her second album, Fairy Tales, was released in 1983 shortly before his father's death. Between 1983 and 1990, Costa sang covers of The Angels' 1963 song \"My Boyfriend's Back\" and Disney's 1989 song \"Part of Your World\" (the latter, taken from The Little Mermaid). Costa moved away from childhood pop to mature soul, progressive rock and electropop in the 1990s. She signed to the Mushroom record label in Australia. In 1996, she released the studio album Butterfly Rocket in Australia. The album led to Costa being nominated for an ARIA Music Awards Breakthrough Artist in 1996 and the Best Female Artist in 1997. In 2000, Costa's song \"Like a Feather\" was shown in a Tommy Hilfiger television advertising campaign. The exposure and the song's music video helped launch her United States music career. In 2001, her album Everybody Got Their Something was released. It hit #120 on the U.S. Billboard 200. Costa later signed to Stax. She released her studio album Pebble to a Pearl on . == Curiosities == === Sports carreer and other passions === In addition of music, her passions are swimming (including mermaiding), running, artistic gymnastics, classical ballet, acting, pizza, fruit ice creams, Disney cartoons, mermaid costumes (both the ones for the parties and the ones for to swim), and dolls. === Private life === She is married with Australian producer-songwriter Justin Stanley, with whom she has a daughter Sugar McQueen (2006), and a son, Suede (2013). == Discography == * Nikka Costa (1981) * Fairy Tales (1983) * Here I Am… Yes, It's Me (1989) * Butterfly Rocket (1992) * Everybody Got Their Something (2001) * Can'tneverdidnothin' (2005) * Pebble to Pearl (2008) * Pro*Whoa! (2011) * Nikka & Strings, Undermeath and in Beetween (2017) * And other singles not included in albums == References == == Others websites == * Nikka Costa's website Category:American singer-songwriters Category:Singers from Los Angeles Category:People from Beverly Hills, California Category:American child singers Category:American pop singers Category:American soul singers Category:American funk singers Category:American blues singers Category:Progressive rock singers Category:New wave singers Category:Synth-pop singers Category:Electropop singers Category:American guitarists Category:American movie actors Category:American child actors Category:American dancers Category:American gymnasts Category:American swimmers Category:1972 births Category:Living people",
 "title": "Nikka Costa"
}