{
 "id": "847475",
 "text": "International recognition of Armenia, since Armenia was freed from Soviet control, and joined the UN (United Nations.) Only 1 nation in the 193 members has not recognized Armenia, Pakistan firmly states that Armenia should be a part of the country of Azerbaijan. Other than Pakistan, 192 UN states have agreed that Armenia is its own Republic. Pakistan has played huge parts in the Nagorno-Karabakh conflict, which is a dispute between Azerbaijan, and Armenia over certain territories. Even though Pakistan does not recognize Armenia, Armenia is not in threat to being invaded by Azerbaijan as it has support from other nations in the UN. == Background == After Armenia was declared independent in 1991, it joined the UN a year later. Many countries agreed to accept Armenia as independent of any other country, which at first all countries agreed until 2015, when the Nagorno-Karabakh conflict was getting larger. Pakistan declared it would support Azerbaijan in the conflict and declared \"recognizing Armenia's independence is contingent on the latter leaving Karabakh.\" They soon withdrew recognition of Armenia completely stating Armenia rightfully belonged to Azerbaijan. This led to the de facto, Republic of Artsakh allying itself with Armenia, while Turkey and Pakistan aided the Azerbaijani's. == Recognition == === Asia === International recognition of Armenia in Asia # Country Relations Recognition Notes 1 Georgia Yes Yes Georgia sided with Armenia over Azerbaijan, even though appear to have ever they don't stood against Azerbaijan. 2 Azerbaijan No Yes None. 3 Turkey No Yes Turkey does appear to support Azerbaijan by closing the Turkish borders, though they never appear to not recognize Armenia. Turkey also does not recognize the Armenian genocide. 4 Syria Yes Yes None. 5 Iran Yes Yes Iran appears to have a close State-like relationship with Armenia. 6 Lebanon Yes Yes Lebanon is the first country in the Arab-league to recognize the Armenian genocide, and it also appears to be some-what of an Armenian ally. 7 Pakistan No No Pakistan is the only country in the UN to not recognize Armenia, Pakistan also cut ties with Armenia in support of Azerbaijan. 8 Israel No Yes Israel though not against Armenia, supplied to Azerbaijani army, causing Armenia to withdrew its ambassador. But Israel never stated it was against Armenia. 9 Jordan No Yes None. 10 Iraq Yes Yes Iraq appears to be one of the few nations in the Arab-League, that supports Armenia more than Azerbaijan. 11 Kazakhstan Yes Yes None. 12 United Arab Emirates Yes Yes The UAE allied with Armenia against Turkey, in Neo-Ottomanism in the middle east. 13 Turkmenistan Yes Yes None. 14 Uzbekistan Yes Yes None. 15 Tajikistan Yes Yes Tajikistan mostly stayed out of the Nagorno-Karabakh conflict conflict, and has remained neutral during the hostility. 16 Saudi Arabia Yes Yes The Armenian-Saudi relations is currently at threat from Turkish influence. 17 Kuwait No Yes None. 18 Qatar No Yes None. 19 Bahrain No Yes None. 20 Yemen Yes Yes None. 21 Oman No Yes None. 22 India Yes Yes India states that they support Armenia in the Nagorno-Karabakh conflict, just as Armenia supports India in the Indian- Pakistani conflict. 23 Sri Lanka No Yes None. 24 Afghanistan No Yes None. 25 Kyrgyzstan No Yes None. 26 Nepal No Yes None. 27 China Yes Yes China and Armenia have a military alliance that has been getting stronger, they also have many trading alliances. 28 Japan Yes Yes Japan has acknowledged the Armenian genocide. 29 North Korea No Yes None. 30 South Korea No Yes None. 31 Bhutan No Yes None. 32 Bangladesh No Yes None. 33 Myanmar No Yes None. 34 Thailand No Yes None. 35 Laos No Yes None. 36 Cambodia No Yes None. 37 Indonesia No Yes None. 38 East Timor No Yes None. 39 Singapore Yes Yes Armenia and Singapore are close allies, though they don't have much of a military alliance. 40 Malaysia No Yes None. 41 Philippines Yes Yes The Philippines has an embassy in Armenia's capital, Yerevan. === Europe === International recognition of Armenia in Europe # Country Relations Recognition Notes 1 Cyprus Yes Yes Cyprus has been a big supporter of Armenia sense the Armenian genocide, while Armenia has been advocating for Northern Cyprus to be returned to Cyprus. 2 Greece Yes Yes Armenia and Greece have a closer cultural relation then political and military standards. 3 Croatia Yes Yes Croatia has felt sympathy for the Armenian genocide, even though Croatia never officially recognized the genocide 4 Bulgaria Yes Yes In 2015, Bulgaria recognized the Armenian genocide. 5 Norway No Yes None. 6 Denmark Yes Yes Denmark is the only Nordic country to have relations with Armenia. 7 Germany Yes Yes Germany has made steps to recognize the Armenian genocide, though it has been called \"Turkey's responsibility\" to acknowledge the genocide. Germany never officially recognized the genocide. 9 Hungary Yes Yes Hungary has never recognized or denied the Armenian genocide. 10 Serbia Yes Yes Serbia has never recognized or denied the Armenian genocide. 11 Italy Yes Yes Italy was one of the first nations to recognize the Armenian genocide. 12 Belarus No Yes Even though Belarus has not officially recognized the Armenian genocide, there are demands from the Belarusian's to acknowledge the genocide. 13 Russia Yes Yes Russia has recognized the Armenian genocide. 14 Ukraine Yes Yes Armenia and Ukraine are connected through Ambassador's, so Armenia and Ukraine don't have much of a military alliance. 15 Poland Yes Yes Poland recognized the Armenian genocide at the height of the Cold war. 16 Netherlands Yes Yes The Netherlands has recognized the Armenian genocide. 17 Portugal Yes Yes Portugal has recognized the Armenian genocide. 18 Spain Yes Yes Spain officially has not recognized the Armenian genocide, however 5 Spanish provinces (Aragon, Navarre, Basque territory, Catalonia and the Balearic Islands) have. 19 Romania Yes Yes Armenia was the first country to officially recognize Armenia as a Republic. 20 United Kingdom Yes Yes Though the United Kingdom has not recognized the Armenian genocide officially, 2 republic's within the United Kingdom (Scotland and Wales) have officially recognized the genocide. 21 Switzerland Yes Yes Switzerland recognized the Armenian genocide in 2003. 22 Latvia No Yes Latvia has recognized the Armenian genocide. 23 Estonia No Yes Estonia Recognized the Armenian genocide. 24 Lithuania No Yes None. 25 Sweden No Yes None. 26 Malta No Yes None. 27 Czech Republic No Yes The Czech Republic recognized the Armenian genocide. 28 Austria No Yes Austria has recognized the Armenian genocide. 29 Slovakia No Yes None. 30 Luxembourg No Yes Luxembourg has recognized the Armenian genocide. 31 San Marino No Yes San Marino has recognized the Armenian genocide. 32 Belgium No Yes Belgium has recognized the Armenian genocide. 33 Bosnia and Herzegovina No Yes Bosnia has not recognized the Armenian genocide. 34 North Macedonia No Yes None. 35 Albania No Yes Albania has not recognized the Armenian genocide. 36 Moldova No Yes None. 37 Monaco No Yes Monaco has recognized the Armenian genocide. 39 Liechtenstein No Yes None. 40 Kosovo No Yes None. 41 Iceland No Yes None. === North America === International recognition of Armenia in North America # Country Relations Recognition Notes 1 United States Yes Yes The United States recognizes Armenia's independence, though the United States itself is allied with Pakistan. When US. President Joe Biden was elected, he recognized the Armenian genocide. 2 Canada Yes Yes Canada recognizes both Armenia's independence and genocide. 3 Mexico Yes Yes Mexico recognizes both Armenia's independence and genocide. 4 Guatemala No Yes None. 5 Belize No Yes None. 6 Honduras No Yes None. 7 El Salvador No Yes None. 8 Nicaragua No Yes None. 9 Costa Rica No Yes None. 10 Panama No Yes None. 11 Greenland No Yes None. === Caribbean === International recognition of Armenia in the Caribbean # Country Relations Recognition Notes 1 Cuba No Yes None. 2 The Bahamas Yes Yes The Bahamas established a diplomatic relationship, back in mid 2017 with Armenia, but the Bahamas does recognize Armenia. 3 Bermuda (United Kingdom) No Yes None. 4 Cayman Islands (United Kingdom) No Yes None. 5 Turks and caicos Islands (United Kingdom) No Yes None. 6 Jamaica No Yes None. 7 Haiti No Yes None. 8 Puerto Rico (United States) Yes Yes Puerto Rico recognizes Armenia in name of the United States. 9 Dominican Republic No Yes None. 10 British Virgin Islands (United Kingdom) No Yes None 11 US. Virgin Islands (United States) Yes Yes The US. Virgin Islands recognizes Armenia in name of the United States. 12 St. Kitts and Nevis (United Kingdom) No Yes None. 13 Antigua and Barbuda No Yes None. 14 Guadeloupe (France) No Yes None. 15 Montserrat (United Kingdom) No Yes None. 16 Dominica No Yes None. 17 Martinique (France) No Yes None. 18 Saint Lucia (United Kingdom) No Yes None. 19 Barbados (United Kingdom) No Yes None. 20 Saint Vincent and the Grenadines (United Kingdom) No Yes None. 21 Grenada (United Kingdom) No Yes None. 22 Curaçao (Netherlands) No Yes None. 23 Aruba (Netherlands) No Yes None. === South America === International recognition of Armenia in South America # Country Relations Recognition Notes 1 Colombia No Yes None. 2 Venezuela Yes Yes Venezuela recognizes Armenia, however only the Venezuelan council recognizes the Armenian genocide, and the President has not officially recognized the genocide. 3 Ecuador No Yes None. 4 Chile Yes Yes Chile recognizes Armenia. 5 Guyana No Yes None. 6 Suriname No Yes None. 7 French Guiana No Yes None. 8 Peru No Yes None. 9 Brazil Yes Yes Brazil recognizes Armenia. 10 Bolivia No Yes None. 11 Paraguay No Yes None. 12 Uruguay Yes Yes Uruguay established diplomatic relations with Armenia, ever sense the fall of Soviet Union. 13 Argentina Yes Yes Argentina holds the largest ethnic Armenia minority. 14 Falkland Islands (United KIngdom) No Yes None. === Africa === The only African country in the UN Armenia has relations to is Egypt, but every country in Africa recognizes Armenia, though not all recognize the Armenian genocide. === Oceania === The only country in Oceania that has relations with Armenia is Australia, but all countries in Oceania recognize Armenia, though not all officially recognize the Armenian genocide. === Disputed territories and Observer states === International recognition of Armenia by disputed territories and observer states # Country Relations Recognition Notes 1 Palestine No Yes Palestine recognizes Armenia, however it has not officially recognized the Armenian genocide. 2 Republic of Artsakh Yes Yes The Republic of Artsakh helps and aids the Armenian army against Azerbaijan, and backs Armenia in conflict with Pakistan. 3 Abkhazia Yes Yes Abkhazia recognized Armenia, this affected Georgian-Armenian reltaionships. 4 South Ossetia Yes Yes South Ossetia recognized Armenia. 5 Northern Cyprus No Yes Northern Cyprus recognizes Armenia in name of Turkey. 6 Taiwan No Yes None. 7 Transnistria Yes Yes None. 8 Somaliland No Yes None. 9 Holy See Yes Yes The Holy See has recognized Armenia. == References == Category:History of Armenia",
 "title": "International recognition of Armenia"
}