{
 "id": "847550",
 "text": "The Kurdistan Region (Kurdish: ) is an autonomous republic in northern Iraq. == Iraqi Kurdistan == Iraqi Kurdistan or Southern Kurdistan (Kurdish: بَاشُوُورَى كُورْدِسْتَانْ, romanized: Başûrê Kurdistanê) is the Kurdish- populated part in the north of Iraq. It is considered one of the four parts of \"Kurdistan\" in West Asia, which also includes parts of southeastern Turkey (Northern Kurdistan), northern Syria (Western Kurdistan), and northwestern Iran (Eastern Kurdistan). As with the rest of Kurdistan, and unlike most of the rest of Iraq, the region is inland and mountainous. == Government == The government of the Kurdistan Region is the Kurdistan Regional Government (KRG). Its de facto capital is Erbil, called Hewlêr in Kurdish. Although the Iraqi Kurdistan constitution claims Kirkuk as the capital. The government has ministries, such as Ministry of Peshmerga Affairs. == Geography == The Kurdistan region of Iraq is an autonomous region in northern Iraq. It borders Iran in the east, Turkey in the north, and Syria in the west. The region encompasses most of Iraqi Kurdistan, which is the southern part of the greater geographical region of Kurdistan. The region lies between latitudes 34° and 38°N, and longitudes 41° and 47°E. Most of the northern and northeastern parts of the region are mountainous, especially those bordering Turkey and Iran. The region has several high mountains and mountain ranges. Other areas of the region are hills and plains, which make up the central and most southern parts of the region. == Administrative divisions == The Kurdistan Region is divided into four governorates (Kurdish: بَارْئِزْكَا, Parêzga): the governorates of Erbil, Sulaymaniyah, Duhok, and Halabja. Each of these governorates is divided into districts, for a total of 26 districts. Each district is also divided into sub-districts. Each governorate has a capital city, while districts and sub-districts have 'district centers'. == Demographics == Due to the lack of a good census, the exact population and demographics of Kurdistan Region are unknown, but the government has started to publish more detailed data. The population of the region is extremely difficult to make sure, as the Iraqi government has historically sought to lower the importance of the Kurdish minority while Kurdish groups has had a habit to distort the numbers.Based on available data, Kurdistan has a young population with an estimated 36% of the population being under the age of 15. == References == == Notes == Category:Iraqi Kurdistan Category:Autonomous areas Category:1991 establishments in Asia Category:20th-century establishments in Iraq",
 "title": "Kurdistan Region"
}