{
 "id": "847656",
 "text": "The Bisho massacre occurred on 7 September 1992 in Bisho. Bisho was in the independent homeland of Ciskei. Ciskei is now part of the Eastern Cape in South Africa. During a protest march, members of the Ciskei Defence Force shot twenty-eight African National Congress supporters and one soldier when they attempted to enter Bisho (now renamed to Bhisho). The ANC supporter wanted that Ciskei was again made part of South Africa. The massacre happened during the final years of apartheid. == Background == Bhisho (previously spelled Bisho) was the capital of the Ciskei. Ciskei was a nominally independent homeland (bantustan) for the Xhosa people in South Africa. The government of Ciskei was formed in 1961 under the Bantu Authorities Act, 1951 after the South African government declared it a separate administrative territory. In 1972, the status was changed to self-governing territory. At the same time, there were stronger efforts to forcibly remove Xhosa-speakers to Ciskei. On 4 December 1982, Ciskei became an independent republic, recognised only by the South African government and other 'independent' homeland states in South Africa. The system of racially segregated homelands had been a core of apartheid, but between 1990 and 1994, negotiations were taking place between the government of South Africa and the African National Congress (ANC) to end the apartheid system. The negotiations would likely lead to multi-racial democratic elections. For this reason, the ANC wanted to organise and mobilise its supporters in the Ciskei, because it lay in the Eastern Cape area. The Eastern Cape area had been a stronghold for ANC supporters. Its military leader Brigadier Oupa Gqozo resisted this and prevented the ANC from organising. In 1991, Gqozo formed the African Democratic Movement to counter the ANC in Ciskei. In December of the same year, he was part of the Convention for a Democratic South Africa (Codesa) negotiations. Codesa was a forum made up of government (National Party) and non-government interest groups to negotiate a new constitution and the transition to democracy in South Africa. In March 1992, Gqozo accused the ANC of planning to overthrow him and in August he stopped ANC marchers from entering Ciskei from King William's Town, a town in South Africa, which is close enough to Ciskei. == Protest march and massacre == On 3 September, the ANC sent a memorandum to President F. W. de Klerk: it demanded that he replace Gqozo with a temporary administration which would permit free democratic activity in Ciskei. De Klerk refused, on the grounds that the Ciskei did not fall under South Africa's jurisdiction. At the time, negotiations had broken down, with the ANC withdrawing following the Boipatong massacre and accusing De Klerk's government of fostering the violence. As a result, the ANC began a campaign of \"mass action\", organising a protest march to occupy Bisho and force Gqozo's resignation. Gqozo sought a court ruling to prevent the march, and the magistrate ruled that it could take place at the homeland's independence stadium, outside Bisho, but could not enter the capital. The ANC refused to recognise the jurisdiction of the Ciskei court. On 7 September, about 80,000 protesters gathered outside Bisho, signalling the wide opposition to Gqozo's rule. The meeting was led by senior ANC leaders including South African Communist Party Secretary General Chris Hani, Cyril Ramaphosa, Steve Tshwete and Ronnie Kasrils. A razor wire was erected on the border between South Africa and Ciskei to prevent the marchers from entering Bisho. When Kasrils led a group trying to break through the Ciskei Defence Force lines to enter Bisho, Ciskei Defence Force soldiers opened fire on the marchers with automatic weapons, killing 28 marchers and one soldier, and injuring over 200. More than 425 rounds were fired, the first fusillade lasting one and a half minutes, and the second lasting a minute. Various inquiries agreed that the order to fire came from Colonel Vakele Archibald Mkosana, who incorrectly told his commanders by radio that his troops were under fire, and was given permission to return fire. Rifleman Mzamile Thomas Gonya was also found to have opened fire with a grenade launcher, killing one marcher. == Goldstone Commission == The Goldstone Commission had the task of investigating the massacre, and Justice Richard Goldstone condemned Gqozo for preventing political activity in Ciskei as well as for the lethal brutality of the Ciskei Defence Force troops. It dismissed his claim that the demonstrators had fired first. A Ciskei soldier who died during the shooting had been shot by a fellow soldier, in error. It recommended strong action against Gqozo and those responsible. It also condemned Ronnie Kasrils for leading marchers breaking through the razor wire and provoking the forces into opening fire. == Aftermath == On 8 September 1992, a day after the massacre, the ANC released a statement demanding that Oupa Gqozo be removed as the leader of Ciskei, Section 43 of the Ciskei National Security Act which prevented political activity in Ciskei be revoked and South African Military Intelligence officials be removed from Ciskei. In the end, the massacre led to new negotiations between the ANC and the government. Nelson Mandela met De Klerk on 26 September and signed a Record of Understanding. This Record created an independent body to oversee police operations. Gqozo remained in power in Ciskei but resigned shortly before the elections of 27 April 1994. A granite monument was erected on the site of the massacre, outside Independence Stadium, off Maitland Road between Bhisho and King William's Town. It was unveiled by Archbishop Desmond Tutu in 1997. The victims were buried in Ginsberg township outside King William's Town. Each year during the month of September, the Bisho Massacre Memorial Lecture is held to commemorate the massacre and different leaders from around South Africa take part in it. == Truth Commission hearing and prosecution == Only two applications for amnesty for the massacre were received by the Truth and Reconciliation Commission, from Colonel Mkosana, who gave the order to open fire, and Rifleman Gonya, who fired a grenade launcher. Gqozo agreed to testify before the TRC, but failed to appear after being admitted to a psychiatric hospital suffering from depression. In 2000, both Mkosana and Gonya were denied amnesty on the grounds that their actions were reckless and disproportionate and not associated with a political motive. Following their failure to receive amnesty, Mkosana and Gonya were charged with one count of murder and Mkosana with 28 counts of culpable homicide. They were found not guilty on all charges on the grounds of self-defence. Speaking at a Truth and Reconciliation Commission hearing on the massacre,Col Silence Pita, revealed that Gqozo had received a message which said that the Mkhonto Wesizwe was planning coup and would take us where we didn't want to be \" but the source of the information had not been made clear in the report. Pita said security arrangements for an African National Congress march on September 7, 1992 were left to the Ciskei Defence Force. Former Ciskei foreign affairs minister Mickey Webb testified that South Africa's intelligence services caused a confrontation between Ciskei government and the ANC. He claimed that South African Military Intelligence and Ciskei's own intelligence agency fed the Ciskei government with misinformation \"which could only have ended up in confrontation between the authorities and the ANC\". == References == Category:Apartheid-related violence Category:Pages with unreviewed translations Category:1990s in South Africa",
 "title": "Bisho massacre"
}