{
 "id": "847694",
 "text": "Medicine in the American Civil War was not good by today's standards. Doctors did not know about germs, so many soldiers caught infections. They did have anesthesia, so they were able to stop soldiers' pain. Most doctors in the United States had two years of schooling. Harvard Medical School did not have even one microscope. One problem was that, like in World War I, people had just invented new weapons, like the Minié ball. Guns with rifled barrels did not miss as often as the muskets from the Revolutionary War and other earlier wars did. That meant doctors did not already know how to treat the injuries that these weapons could cause in the human body. Another problem was that the camps and battlefields were very dirty. A soldier in the American Civil war was twice as likely to die of disease as of a battle injury. ==Diseases== 560,000 soldiers died of diseases during the American Civil War. Malaria was a problem in the American Civil War. Doctors gave patients quinine for malaria. Soldiers also died of dysentery, diarrhea, and typhoid. ==Germs== Most doctors did not know about germs in the mid-1800s. They did not always wash their hands or tools between patients. They also thought that pus, if thick and creamy, was \"laudable pus\" and meant the patient was getting better. Really, pus means the patient has an infection. ==Injuries== About 200,000 people had injuries in the American Civil War. ==Anesthesia== Anesthesia was invented in 1846. Doctors in the American Civil War did have chloroform, ether, and other anesthetics, and they used them. 90 percent of patients who had a limb cut off had anesthesia first, usually chloroform. The doctors dripped chloroform onto a cloth and then put it over the patient's face. ==Amputation== Doctors invented two ways to do amputations, the circular method and the fish-mouth method. There were so many amputations in the American Civil War that doctors became very good at amputating. The Minié ball and other new weapons could destroy large pieces of bone, so the doctors decided to amputation so the patient would not get gangrene. ==Field stations and hospitals== First, injured soldiers were brought to field stations near the battle. There, medical people gave the soldiers whiskey if they had it and put bandages on them. Then, the patients were taken to hospitals. The \"hospital\" could be only a barn or other building where the doctors had decided to work. They were not always organized well. There, the medical people did triage: they looked at the patient to plan what to do next. They divided patients into three groups: patients who were sure to die soon, patients who needed surgery and other patients. From there, some soldiers were sent to better hospitals in the bigger cities. Patients could be taken from place to place in different ways. General George B. McClellan started an ambulance corps in 1862, and the Confederacy soon made their own. There were also hospital trains, or steamboats called \"sanitary steamers.\" ==Response== In 1861, the United States government (Union side, the North) created the U.S. Sanitary Commission to learn how to stop soldiers from becoming sick during wartime. Frederick Law Olmstead led the commission. He told the army to have clean camps, good food, and hospitals with ventilation. Many doctors learned much about the human body, disease and injuries during the American Civil War. Many of them wrote down what they saw and did. Between 1870 and 1888, these doctors published a book, Medical and Surgical History of the War of the Rebellion. In 1861, Dorothea Dix became head of the United States Nursing Corps. Professional nursing became more important in the United States. == References == Category:History of medicine Category:American Civil War",
 "title": "Medicine in the American Civil War"
}