{
 "id": "847776",
 "text": "The 2021–22 UEFA Champions League qualifying phase and play-off round began on 22 June and ended on 25 August 2021. A total of 54 teams competed in the qualifying system of the 2021–22 UEFA Champions League, which includes the qualifying phase and the play-off round, with 43 teams in Champions Path and 11 teams in League Path. The six winners in the play-off round (four from Champions Path, two from League Path) advanced to the group stage, to join the 26 teams that enter in the group stage. Times are CEST (UTC+2), as listed by UEFA (local times, if different, are in parentheses). ==Teams== ===Champions Path=== The Champions Path includes all league champions which do not qualify directly for the group stage, and consists of the following rounds: *Preliminary round (4 teams playing one-legged semi-finals and final): 4 teams which enter in this round. *First qualifying round (32 teams): 31 teams which enter in this round, and 1 winner of the preliminary round. *Second qualifying round (20 teams): 4 teams which enter in this round, and 16 winners of the first qualifying round. *Third qualifying round (12 teams): 2 teams which enter in this round, and 10 winners of the second qualifying round. *Play-off round (8 teams): 2 teams which enter in this round, and 6 winners of the third qualifying round. All teams eliminated from the Champions Path enter either the Europa League or the Europa Conference League: *The 3 losers of the preliminary round and 15 losers of the first qualifying round enter the Europa Conference League Champions Path second qualifying round. *The 1 drawn loser of the first qualifying round enters the Europa Conference League Champions Path third qualifying round. *The 10 losers of the second qualifying round enter the Europa League Champions Path qualifying round *The 6 losers of the third qualifying round enter the Europa League play-off round. *The 4 losers of the play-off round enter the Europa League group stage. Below are the participating teams of the Champions Path (with their 2021 UEFA club coefficients), grouped by their starting rounds. Key to colours Winners of play-off round advance to group stage Losers of play-off round enter Europa League group stage Losers of third qualifying round enter Europa League play- off round Losers of second qualifying round enter Europa League qualifying round Drawn loser of the first qualifying round enters Europa Conference League third qualifying round Losers of the preliminary round and first qualifying round enter Europa Conference League second qualifying round {| class=\"wikitable\" Team Red Bull Salzburg 59.000 Brøndby 7.000 ===League Path=== The League Path includes all league non-champions which do not qualify directly for the group stage, and consists of the following rounds: *Second qualifying round (6 teams): 6 teams which enter in this round. *Third qualifying round (8 teams): 5 teams which enter in this round, and 3 winners of the second qualifying round. *Play-off round (4 teams): 4 winners of the third qualifying round. All teams eliminated from the League Path enter the Europa League: *The 3 losers of the second qualifying round enter the Main Path qualifying round. *The 4 losers of the third qualifying round and the 2 losers of the play-off round enter the group stage. Below are the participating teams of the League Path (with their 2021 UEFA club coefficients), grouped by their starting rounds. Key to colours Winners of play-off round advance to group stage Losers of play-off round and third qualifying round enter Europa League group stage Losers of second qualifying round enter Europa League qualifying round {| class=\"wikitable\" Team Shakhtar Donetsk 79.000 Benfica 58.000 Monaco 36.000 Genk 30.000 Spartak Moscow 18.500 ==Format== Each tie, apart from the preliminary round, is played over two legs, with each team playing one leg at home. The team that scores more goals on aggregate over the two legs advance to the next round. If the aggregate score is level at the end of normal time of the second leg, the away goals rule is no longer applied starting from this season. To decide the winner of the tie, extra time is played, and if the same amount of goals are scored by both teams during extra time, the tie is decided by a penalty shoot-out. In the preliminary round, where single-match semi-finals and final are hosted by one of the participating teams, if the score is level at the end of normal time, extra time is played, and if the same amount of goals are scored by both teams during extra time, the tie is decided by a penalty shoot-out. In the draws for each round, teams are seeded based on their UEFA club coefficients at the beginning of the season, with the teams divided into seeded and unseeded pots containing the same number of teams. A seeded team is drawn against an unseeded team, with the order of legs (or the administrative \"home\" team in the preliminary round matches) in each tie decided by draw. As the identity of the winners of the previous round is not known at the time of the draws, the seeding is carried out under the assumption that the team with the higher coefficient of an undecided tie advances to this round, which means if the team with the lower coefficient is to advance, it simply takes the seeding of its opponent. Prior to the draws, UEFA may form \"groups\" in accordance with the principles set by the Club Competitions Committee, but they are purely for convenience of the draw and do not resemble any real groupings in the sense of the competition. Teams from associations with political conflicts as decided by UEFA may not be drawn into the same tie. After the draws, the order of legs of a tie may be reversed by UEFA due to scheduling or venue conflicts. ==Schedule== The schedule of the competition is as follows (all draws are held at the UEFA headquarters in Nyon, Switzerland). Schedule for the qualifying phase of the 2021–22 UEFA Champions League Round Draw date First leg Second leg Preliminary round 8 June 2021 22 June 2021 (semi-finals) 25 June 2021 (final) First qualifying round 15 June 2021 6–7 July 2021 13–14 July 2021 Second qualifying round 16 June 2021 20–21 July 2021 27–28 July 2021 Third qualifying round 19 July 2021 3–4 August 2021 10 August 2021 Play-offs 2 August 2021 17–18 August 2021 24–25 August 2021 ==Preliminary round== The draw for the preliminary round was held on 8 June 2021, 12:00 CEST. ===Seeding=== A total of four teams played in the preliminary round. Seeding of teams was based on their 2021 UEFA club coefficients, with two seeded teams and two unseeded teams in the semi-finals. The first team drawn in each tie in the semi-finals, and also the final (between the two winners of the semi- finals, whose identity was not known at the time of draw), would be the \"home\" team for administrative purposes. Seeded Unseeded ===Bracket=== ===Summary=== The preliminary round matches, which consisted of two semi-finals on 22 June 2021 and the final on 25 June 2021, were originally to be played at Gundadalur, Tórshavn in the Faroe Islands, but were moved due to restrictions related to the COVID-19 pandemic in the Faroe Islands. The matches were instead played in Albania, with the semi-finals at Elbasan Arena, Elbasan and Niko Dovana Stadium, Durrës, and the final at Elbasan Arena. The winner of the preliminary round final advanced to the first qualifying round. The losers of the semi-finals and final were transferred to the Europa Conference League Champions Path second qualifying round. |+Semi-finals |} |+Final |} ===Semi- finals=== \\---- ===Final=== ==First qualifying round== The draw for the first qualifying round was held on 15 June 2021, 12:00 CEST. ===Seeding=== A total of 32 teams played in the first qualifying round: 31 teams which entered in this round, and 1 winner of the preliminary round. Seeding of teams was based on their 2021 UEFA club coefficients. For the winner of the preliminary round, whose identity was not known at the time of draw, the club coefficient of the highest-ranked remaining team was used. Prior to the draw, UEFA formed four groups of four seeded teams and four unseeded teams in accordance with the principles set by the Club Competitions Committee. The first team drawn in each tie would be the home team of the first leg. Group 1 Group 2 Seeded Unseeded Seeded Unseeded Group 3 Group 4 Seeded Unseeded Seeded Unseeded ;Notes ===Summary=== The first legs were played on 6 and 7 July, and the second legs were played on 13 and 14 July 2021. The winners of the ties advanced to the Champions Path second qualifying round. The losers were transferred to the Europa Conference League Champions Path second qualifying round. |} Notes ===Matches=== Lincoln Red Imps won 7–2 on aggregate. \\---- Slovan Bratislava won 3–2 on aggregate. \\---- Malmö FF won 2–1 on aggregate. \\---- Legia Warsaw won 5–2 on aggregate. \\---- Alashkert won 3–2 on aggregate. \\---- HJK won 7–1 on aggregate. \\---- CFR Cluj won 4–3 on aggregate. \\---- Mura won 6–0 on aggregate. \\---- Sheriff Tiraspol won 5–0 on aggregate. \\---- Neftçi Baku won 4–2 on aggregate. \\---- Kairat won 3–1 on aggregate. \\---- Ludogorets Razgrad won 2–0 on aggregate. \\---- Ferencváros won 6–1 on aggregate. \\---- Žalgiris won 5–2 on aggregate. \\---- Flora won 5–0 on aggregate. \\---- Dinamo Zagreb won 5–2 on aggregate. ==Second qualifying round== The draw for the second qualifying round was held on 16 June 2021, 12:00 CEST. ===Seeding=== A total of 26 teams played in the second qualifying round. They were divided into two paths: *Champions Path (20 teams): 4 teams which entered in this round, and 16 winners of the first qualifying round. *League Path (6 teams): 6 teams which entered in this round. Seeding of teams was based on their 2021 UEFA club coefficients. For the winners of the first qualifying round, whose identity was not known at the time of draw, the club coefficient of the highest-ranked remaining team in each tie was used. Prior to the draw, UEFA formed three groups in the Champions Path, two of three seeded teams and three unseeded teams, and one of four seeded teams and four unseeded teams, in accordance with the principles set by the Club Competitions Committee, while in the League Path there were three seeded teams and three unseeded teams. The first team drawn in each tie would be the home team of the first leg. Champions Path Group 1 Group 2 Group 3 Seeded Unseeded Seeded Unseeded Seeded Unseeded ;Notes League Path Seeded Unseeded ===Summary=== The first legs were played on 20 and 21 July, and the second legs were played on 27 and 28 July 2021. The winners of the ties advanced to the third qualifying round of their respective path. The Champions Path losers were transferred to the Europa League Champions Path third qualifying round, while the League Path losers were transferred to the Europa League Main Path third qualifying round. |+Champions Path |} |+League Path |} ===Champions Path=== Dinamo Zagreb won 3–0 on aggregate. \\---- Young Boys won 3–2 on aggregate. \\---- Legia Warsaw won 3–1 on aggregate. \\---- Sheriff Tiraspol won 4–1 on aggregate. \\---- Olympiacos won 2–0 on aggregate. \\---- Red Star Belgrade won 6–2 on aggregate. \\---- CFR Cluj won 4–1 on aggregate. \\---- Malmö FF won 4–3 on aggregate. \\---- Ferencváros won 5–1 on aggregate. \\---- Ludogorets Razgrad won 3–1 on aggregate. ===League Path=== Sparta Prague won 3–2 on aggregate. \\---- Midtjylland won 3–2 on aggregate. \\---- PSV Eindhoven won 7–2 on aggregate. ==Third qualifying round== The draw for the third qualifying round was held on 19 July 2021, 12:00 CEST. ===Seeding=== A total of 20 teams played in the third qualifying round. They were divided into two paths: *Champions Path (12 teams): 2 teams which entered in this round, and 10 winners of the second qualifying round (Champions Path). *League Path (8 teams): 5 teams which entered in this round, and 3 winners of the second qualifying round (League Path). Seeding of teams was based on their 2021 UEFA club coefficients. For the winners of the second qualifying round, whose identity was not known at the time of draw, the club coefficient of the highest-ranked remaining team in each tie was used. Prior to the draw, UEFA formed two groups in the Champions Path, of three seeded teams and three unseeded teams, in accordance with the principles set by the Club Competitions Committee, while in the League Path there were four seeded teams and four unseeded teams. Due to political reasons, teams from Ukraine and Russia in the League Path could not be drawn against each other, thus Shakhtar Donetsk and Spartak Moscow could not be drawn against each other. The first team drawn in each tie would be the home team of the first leg. Champions Path Group 1 Group 2 Seeded Unseeded Seeded Unseeded League Path Seeded Unseeded ;Notes ===Summary=== The first legs were played on 3 and 4 August, and the second legs were played on 10 August 2021. The winners of the ties advanced to the play-off round of their respective path. The Champions Path losers were transferred to the Europa League play-off round, while the League Path losers were transferred to the Europa League group stage. |+Champions Path |} |+League Path |} ===Champions Path=== Dinamo Zagreb won 2–1 on aggregate. \\---- Young Boys won 4–2 on aggregate. \\---- 3–3 on aggregate. Ludogorets Razgrad won 4–1 on penalties. \\---- Sheriff Tiraspol won 2–1 on aggregate. \\---- Malmö FF won 4–2 on aggregate. \\---- Ferencváros won 2–1 on aggregate. ===League Path=== PSV Eindhoven won 4–0 on aggregate. \\---- Benfica won 4–0 on aggregate. \\---- Shakhtar Donetsk won 4–2 on aggregate. \\---- Monaco won 5–1 on aggregate. ==Play-off round== The draw for the play-off round was held on 2 August 2021, 12:00 CEST. ===Seeding=== A total of 12 teams played in the play-off round. They were divided into two paths: *Champions Path (8 teams): 2 teams which entered in this round, and 6 winners of the third qualifying round (Champions Path). *League Path (4 teams): 4 winners of the third qualifying round (League Path). Seeding of teams was based on their 2021 UEFA club coefficients. For the winners of the third qualifying round, whose identity was not known at the time of draw, the club coefficient of the highest-ranked remaining team in each tie was used. In the Champions Path there were four seeded teams and four unseeded teams, and in the League Path there were two seeded teams and two unseeded teams. The first team drawn in each tie would be the home team of the first leg. Champions Path Seeded Unseeded League Path Seeded Unseeded ;Notes ===Summary=== The first legs were played on 17 and 18 August, and the second legs were played on 24 and 25 August 2021. The winners of the ties advanced to the group stage. The losers were transferred to the Europa League group stage. |+Champions Path |} |+League Path |} ===Champions Path=== Red Bull Salzburg won 4–2 on aggregate. \\---- Young Boys won 6–4 on aggregate. \\---- Malmö FF won 3–2 on aggregate. \\---- Sheriff Tiraspol won 3–0 on aggregate. ===League Path=== Shakhtar Donetsk won 3–2 on aggregate. \\---- Benfica won 2–1 on aggregate. ==Notes== ==References== ==Other websites== * qualifying phase and play-off round",
 "title": "2021–22 UEFA Champions League qualifying phase and play-off round"
}