{
 "id": "847930",
 "text": "The 1976 Tangshan earthquake () was a natural disaster resulting from a magnitude 7.6 earthquake that hit the region around Tangshan, Hebei, People's Republic of China on 28 July 1976. It lasted for 23 seconds and levelled 90 percent of Tangshan’s buildings. The earthquake came during the heat of midsummer, and many stunned survivors crawled out of their ruined houses naked, covered only in dust and blood. The earthquake started fires and ignited explosives and poisonous gases in Tangshan’s factories. Water and electricity were cut off, and rail and road access to the city was destroyed. It is the deadliest earthquake in China and one of the deadliest earthquakes in the world and is among the top ten deadliest natural disasters in China. At the 3:42 a.m., an earthquake measuring between 7.8 and 8.2 magnitude on the Richter scale flattens Tangshan, a Chinese industrial city with a population of about a million people. The Chinese State Seismological Bureau (SSB) Analysis and Prediction Department was very accurate with the prediction of the earthquake, with an estimate of a major earthquake in the Tangshan region between July 22 and August 5. Despite voicing concerns, the prediction was not taken seriously. A few counties that listened to the advised saved thousands of lives by evacuating to safer areas days before the earthquake occurred. == Death toll == According to the official statement from the seismological department, 242,000 people were killed and as many as 700,000 were injured. On the other hand, other resources claimed causalities as high as 650,000. More than 160,000 families were left homeless, and more than 4,000 children were orphaned Another reason why the death toll had increased to an extraordinary amount was because of the aftershocks that took place 16 hours after the first quake. The aftershocks were recorded to be as high as 7.1 on the Richter Scale, which not only hampered the rescue efforts but also added to the death toll. The Chinese government had not allowed foreign aid in the city, claiming that they were capable of handling the crisis on their own. In the crucial first week after the crisis, many died from lack of medical care. Troops and relief workers lacked the kind of heavy rescue training necessary to efficiently pull survivors from the rubble. == References == Category:1976 in Asia Category:20th century in China Category:Beijing Category:Earthquakes in China Category:1976 events Category:July events",
 "title": "1976 Tangshan earthquake"
}