{
 "id": "84801",
 "text": "Chinese New Year, known in China as the SpringFestival and in Singapore as the LunarNewYear, is a holiday on and around the new moon on the first day of the year in the traditional Chinese calendar. This calendar is based on the changes in the moon and is only sometimes changed to fit the seasons of the year based on how the Earth moves around the sun. Because of this, Chinese New Year is never on January1. It moves around between January21 and February20. The Chinese New Year is one of the most important holidays for Chinese people all over the world. Its 7th day used to be used instead of birthdays to count people's ages in China. The holiday is still used to tell people which \"animal\" of the Chinese zodiac they are part of. The holiday is a time for gifts to children and for family gatherings with large meals, just like Christmas in Europe and in other Christian areas. Unlike Christmas, the children usually get gifts of cash in red envelopes (hongbao) and not toys, clothes and electronics. Chinese New Year used to last 15 days until the Lantern Festival on the year's first full moon.. Now, it is a national holiday in the Republic and People's Republic of China, the Philippines, Singapore, Malaysia, Brunei, and Indonesia. It is also celebrated in some parts of Thailand. In some places, only the first day or three days are celebrated. In the PRC, nearby weekends are changed to create a 7-day-long \"Golden Week\". The traditional new years in Vietnam (Tet) and in Korea (Korean New Year) are almost always on the same day as Chinese New Year but are sometimes different. The Japanese New Year used to work the same way but has been very different since some changes in the 19th century. Losar and Tsagaan Sar, the traditional Tibetan and Mongolian new years, are very close to the Chinese New Year but different ways of thinking about the moon's changes and adding months can make them happen weeks apart from the Chinese festival. ==Name== The Mandarin Chinese name of the holiday is Chūn Jié, which means \"Spring Festival\". This is why it is often called the \"Spring Festival\" by Chinese speakers of English, even though the holiday always occurs in the winter months of January or February. Its name is written in traditional Chinese writing and in the easier writing now used by mainland China and Singapore. The Republic of China began to use this name in the 1910s, after it began to use the European calendar for most things. Before that, the holiday was usually just called the \"NewYear\". Because the traditional Chinese calendar is mostly based on the changes in the moon, the Chinese New Year is also known in English as the \"Lunar New Year\" or \"Chinese Lunar New Year\". This name comes from \"Luna\", an old Latin name for the moon. The Indonesian name for the holiday is Imlek, which comes from the Hokkien word for the old Chinese calendar and is therefore also like saying \"Lunar New Year\".. Another old name for the holiday was Lìchūn, meaning \"Early Spring\". In Chinese, this is also a special name for the sun's place from about February4 to 19 each year, when the sun is 45 to 30° ahead of its place on the 1stday of spring. The name is not often used to talk about the Chinese New Year any more. On Taiwan, the real Lichun has been called \"Farmer's Day\" since 1941. A year between two Chinese New Years without it is thought to be unlucky for marriages. ==Day of the New Year== Animal Chinese Chinese Dates Dates Dates Animal Trad. PRC Dates Dates Dates Rat 鼠 鼠 February 19, 1996 February 7, 2008 January 25, 2020 Ox Cow 牛 牛 February 7, 1997 January 26, 2009 February 12, 2021 Tiger 虎 虎 January 28, 1998 February 14, 2010 February 1, 2022 Rabbit 兔 兔 February 16, 1999 February 3, 2011 January 22, 2023 Dragon 龍 龙 February 5, 2000 January 23, 2012 February 10, 2024 Snake 蛇 蛇 January 24, 2001 February 10, 2013 January 29, 2025 Horse 馬 马 February 12, 2002 January 31, 2014 February 17, 2026 Goat 羊 羊 February 1, 2003 February 19, 2015 February 6, 2027 Monkey 猴 猴 January 22, 2004 February 8, 2016 January 26, 2028 Rooster Chicken 雞 鸡 February 9, 2005 January 28, 2017 February 13, 2029 Dog 狗 狗 January 29, 2006 February 16, 2018 February 3, 2030 Pig 豬 猪 February 18, 2007 February 5, 2019 January 23, 2031 Chinese New Year always starts on a new moon, when the Moon is between the Earth and Sun and it looks all dark in the night sky. Because new moons happen about every 29.53 days but the year set by Pope GregoryXIII is 365.2425 days long, the Chinese holiday moves to different days each year. The Chinese calendar adds a 13th month every so often to keep the seasons in the right place, so the first day of the new year always happens between January21 and February20 on the 2nd or 3rd new moon after the 1st day of winter. The chart on the right gives the day of each Chinese New Year from 1996 to 2031. ==Traditional counting== In the past, the Chinese emperors did not number their years from one place. Instead, they gave names to eras (groups of years) any time they wanted. Since they still changed its number at every new year festival, the first year of a new era might only be a few days long. One example of this is the \"1st year of Kaiyuan\" during the Tang, which lasted a week or so in 713 AD. In the same way, people in China and around East Asia did not count their ages from zero or add one year at every birthday. They counted birth as the start of their 1st year and added another year upon the 7th day of the New Year, which they called People's Day (Rénrì). This came from an old story about how a goddess named Nüwa made all the animals. The day she made people was used as the common birthday for everyone. In this way, people sometimes called a baby who born on the 6th day of the New Year a 2-year-old only a few hours after its birth. (Today, it is much more common in China to count age starting at zero and add years at birthdays, like in English-speaking countries.) ==Animals of the New Year== The Chinese used to keep time using 2 different lists of characters, known in English as the 10Heavenly Stems and the 12Earthly Branches. The stems were the 10 days of the week under the Shang dynasty, each with its own sun and a special gift to different dead family members of the king. The branches were parts of the almost 12-year path that Jupiter takes around the sun. Each is said to be yin (dark or female) or yang (bright or male), so that when they are put together they make a list of 60 pairs. (The current list began in 1984 and will end in 2043.) Later, each of the stems was also said to match one of the 5 Chinese elements—wood, fire, dirt, metal, or water—and each of the branches was said to be a different animal: Rat, Ox & Cow, Tiger, Rabbit, Dragon, Snake, Horse, Goat, Monkey, Rooster & Chicken, Dog, and Pig. The Han Chinese list begins with the Year of the \"Wood Rat\"; the Tibetan list is much the same but begins with the Year of the \"Fire Rabbit\". Today, Chinese people don't use these lists to count hours, days, or years but many still pay attention to the animal of the year when someone was born. Just like with the European zodiac, some people think the year's animal can change how someone thinks and acts. They even think it can change whether a marriage will be a happy one or not. Newspapers pay writers to give them ideas for how lucky different animals will be during the coming week. Many parents even time their children's birth within a year or two to give them the best animal sign: a Chinese primary school might have full classrooms of \"golden Dragon\" students but noticeably fewer \"dirt Rats\". For those who do believe such things, it is important to notice that the traditional Chinese calendar's year starts at a different time from the usual year. People may say that 2017 is the \"Year of the Rooster and Chicken\" but the people born in January or early February 2018 will still be \"Roosters\" and \"Chickens\" and those born in the first few weeks of 2017 were still \"Monkeys\". ==History== Chinese tradition said that the Chinese calendar began during the 60th year of the reign of the Yellow Emperor in 2637 BC, with New Year celebrations beginning in that year. As far as we now know, it's much less old than that. Parts of the old ways of counting time given above are at least as early as 1250 BC, during the Shang times. Most of it was known by the Zhou (11th–3rd centuries BC). The 5 elements and small points were set by the Han (2nd century BC–2nd century AD). From eastern China, the calendar and its new year spread to nearby places like Vietnam (111 BC), Korea (before 270 AD), Japan (604), and Tibet (around 641). It also followed the overseas Chinese to their new homes in Thailand, the Philippines, Indonesia, Malaysia, and other places. The Shang kings (16th–11th centuries BC) gave special gifts to their gods and dead family members during the winter of each year.. Under the Zhou, people were having harvest festivals like today's Mid-Autumn Festival by about 1000 BC. Over time, common people started to give gifts to their gods and their dead family members, just like the king. Parts of the harvest festival stopped being about giving thanks and celebrating the last year. They moved to before the planting of the seeds and became wishes and celebration of good luck in the next year... By the early Han, people were counting their birthdays from People's Day on the 7th day of the New Year. The order of animals' birthdays was said to be Roosters and Chickens on the New Year, Dogs on the next day, Pigs on the day after that, Goats on the 4th, Oxen and Cows on the 5th, Horses on the 6th, and then people.. About the same time, people started burning bamboo to make loud noises to welcome the New Year and scare away bad things. People started carefully cleaning their homes, having large family dinners, and staying up late on the day before Chinese New Year by the end of the Three Kingdoms (3rd century). By the end of the Jin in the 5th century, these things had become a common part of Chinese life. Some Taoist magicians may have made gunpowder as early as the Han or Jin,.. but they certainly had it by the 9th century at the end of the Tang. Over the next few centuries, fireworks and firecrackers replaced burning bamboo as a way to chase away anything bad and to welcome in the New Year. Dragon dances had appeared by the time of the Han. People thought that Chinese dragons like Yinglong and Shenlong were kinds of gods who had power over where the water in rivers and canals went and when the water in clouds would fall as rain. Because this was very important for farming, dragon dances could happen all through the year when rain was needed.. Different parts of today's dragon dances began at different times, with some at least as old as the Song (about 1150). and others very new, like using special paint that glows under black light. Lion dances were probably newer. China has not had its own lions since the spread of people out of Africa into the rest of the world. The earliest lions in Chinese books were gifts to the Han emperor from Parthia and other people who lived along the Silk Road connecting Chinese and Roman businesses... There was lion dancing under the Tang. and in Japan by the 8th century, but people still thought of it as a foreign dance used by Buddhists.. Today, people talk about \"Northern\" and \"Southern\" kinds of lion dances. The special northern kind began under the Southern Song (12th–13th century). The special southern kind began in Guangdong later, maybe under the Ming (14th–17th century). As part of other changes, the Meiji Emperor of Japan ordered in 1873 that the new year celebrations of his country would be held on January1. Today, even most of the traditional Japanese celebrations now occur on that day, not at the same time as Chinese New Year. In 1928, the Nationalist Party of China tried to change the Chinese celebrations to January1, too, but this completely failed as the Chinese people protested or ignored the new laws and continued as usual. In 1965, some people tried to change Indonesia's government, making its army less powerful. They failed and Suharto said they were working for Indonesia's Communists, who were working with Mao Zedong's Communist China. In 1967, Suharto helped make laws against using Chinese language or culture, including any celebration of Chinese New Year. These laws were not changed until after the fall of Suharto in 1998. Indonesia made Chinese New Year a national holiday for everyone a few years later in 2003. In 1967, as part of Mao Zedong's Cultural Revolution, the PRC's government did not celebrate or allow special time off work for the traditional new year. The State Council said that the people of China should \"change customs\" and have a \"revolutionized and fighting Spring Festival\". Public celebrations returned by the time of Deng Xiaoping's Opening Up Policy in the 1980s. In particular, the government helped with dragon and lion dancing, thinking that it was part of the special culture of Chinese people.. Since the year 2000, Chinese New Year has been one of the PRC's Golden Weeks: there are three days of paid time away from work during the first few days and two weekends around it are moved to make a 7-day-long holiday. These Golden Weeks copied a similar Japanese idea. In 2015, Sultan Hassanal Bolkiah set out tough new laws about the celebration of Chinese New Year in Brunei. This followed earlier laws like it about Christmas and is part of introducing traditional Islamic law to the country.., reprinted in the Malaysian Chinese News. ==Events== ===Mainland China=== People in China usually try to be together with their family for at least the first few days of the holiday. Because of the large number of Chinese people and the many people who work away from their hometowns, all this \"spring traveling\" (chunyun) is the biggest movement of people in the world every year. Houses are cleaned completely. In former times, sacrifices were made to the gods and dead family members in the days before the holiday. A \"reunion dinner\" happens in the evening of the last day of the traditional year (\"New Year's Eve\").. Older and married people give younger ones cash in red envelopes known as hongbao in Mandarin Chinese or laisee in Cantonese. China Central Television puts on a long show with many star actors, singers, and dancers. It is usually the most-watched TV show in the world each year. Lately, its ads have also become some of the world's most expensive, although they are still behind those during the US Super Bowl. Children don't need to go to bed early and stay up to midnight. Around 12 o'clock, the new year is welcomed with public fireworks and private firecrackers. Children are told that these remember a monster called \"Nian\" (\"Year\") who was scared away by a town's loud noises and bright lights on a Chinese New Year long in the past. During the first few days of the new year, many people visit the homes of their grandparents, parents, and other relatives, as well as their closest friends. More hongbao may be given. Temples also have special fairs with lots of street food. There are Peking opera and martial arts shows and lion and dragon dances in major cities. Lion dancers usually have two people inside each lion. People feed the lions green plants and hongbao, and the lions keep the money and spit out the plants. The dragon dancers usually hold the Dragon up on poles and chase a pearl held by another dancer. The dragons can be very long. So far, the longest was in Hong Kong in 2012. That one was a little over long. Hong Kong also has special horse races at its racetrack. A 100,000 people sometimes come to the big race on the 3rd day of the New Year, which has a lion dance and other shows. Guangzhou has several special flower festivals.. The day of the new year's first full moon is called the Lantern Festival. Many streets and homes are decorated with old paper lanterns. In the past, this was one of the few days of the year when the women of families with lots of money could go outside their homes. They walked the streets nearby with their maids and could say hello to people outside their family. This still causes the festival to make people think of young adults meeting their future husband or wife. File:ChineseVarietyart HumanLion.jpg | Northern lion dancing File:Fire Dragon dance.jpg | A fire dragon dance File:Red girls (121513100).jpg | Hong Kong girls in traditional red clothes for the New Year File:Dragonwalk (406426907).jpg | Dragon dancers in Hong Kong File:Chinesenewyearfireworkman.jpg | A Shanghainese man setting off firecrackers File:CNY Fair Canton 2010.jpg | One of Guangzhou's flower festivals ===Taiwan=== In Taiwan, most events and traditions are the same as those in China. The most important special event is the Yanshui Beehive Fireworks Festival, where fireworks are shot straight into the people watching the show. Being hit is supposed to bring good luck, but this used to be very unsafe. Today, people wear special hard hats (helmets) and thick clothes to protect them from the fire and fireworks.. Another special event is the \"Bombing of Master Handan\" in Taitung, where people throw firecrackers straight at the members of a parade who are wearing only red underwear and towels. Taiwan's Hakka people have a tradition like this, where firecrackers are thrown at dragon dancers as they parade through towns. The dragon is then burnt up at the end of the dance.. Taipei's City Lantern Festival also goes on for most of the holiday, not just during the 1-day Lantern Festival at the end. ===Philippines=== Chinese New Year is a national holiday in the Philippines. People do not get money without working, but anyone who does have to work on the \"special non-working day\" gets 130% of the usual pay. Binondo—sometimes considered the world's oldest Chinatown—sees a lot of traditional celebrations, such as lion and dragon dances.. Its people also try to pay back any money that they owe before the New Year... In 2001, Davao City stopped letting people use fireworks because its people were hurting themselves too much. Their leader Rodrigo Duterte became president of the country and said that he wanted to stop fireworks everywhere. As president, however, he has so far continued to let people use them.. ===Indonesia=== Chinese New Year () is a 1-day national holiday in Indonesia. Chinese people have lived there since at least the 15th century, when Zheng He's ships visited its islands for the Yongle Emperor of the Ming, and many more came when the Netherlands held the islands as a colony. Suharto stopped Chinese Indonesians from celebrating Chinese New Year in 1967.. Some people had tried to change the government in 1965 and Suharto said Indonesian Communists and their friends in the PRC had done it. Things changed after the fall of Suharto in 1998,. and Indonesia made Chinese New Year a national holiday for everyone in 2003. Dragon and lion dances are common at shopping centers, which sometimes have special sales to let Chinese people buy new (often red) clothes to wear for the holiday.. People cannot use fireworks in most of Indonesia, but some cities like Jakarta let people use firecrackers.. Some older Chinese traditions still survive in Indonesia. Like in the Philippines, people try to pay back any money they owe before the New Year. People also try not to lend any money during the holiday, because they think it will make them have to keep lending money for the whole year. Doors and windows are opened on the day before the New Year to \"let the old year out\", and people wake up early the next morning so they don't stay lazy the whole year. The red envelopes of money (Hokkien:âng-pau) are given on the morning of New Year's Day, not at dinner on the night before it. Many make special trips to one of Indonesia's Chinese temples at some time during the holiday. It is also still common to leave some food at the table for dead family members and to give them gifts as the New Year begins. Chicken is usually eaten with the head, tail, and feet still on, showing \"completeness\". White rice is eaten but fresh white tofu is not, because in Chinese culture its color makes some people think of death and bad luck. ===Malaysia=== Most of Malaysia gets two days off work for Chinese New Year: the New Year itself and the day after it. The largest celebrations happen around Petaling Street in Kuala Lumpur, at the Kek Lok Si Temple in George Town, in Ipoh, and on Jonker Street in Malacca.. Some people still follow the tradition that the second day is used for married women to visit their parents, after visiting her husband's family on Chinese New Year's Day. Most Chinese Malaysians take the entire week off of work, despite the shorter length of the national holiday. Traditional Chinese use the 3rd day of the New Year to visit the resting places of family members who died in the last 3 years; people without a death in their family stay home. An unusual tradition in Malaysia is the idea of \"open house\" dinners, especially on the 2nd and 3rd night of the holiday. Guests, friends, and even strangers from different races and religions can be let in to enjoy large dinners together.. The Malaysian government even has its own \"open houses\" at community halls.. In addition to fireworks at the beginning of the New Year, many people light them on the 9th day of the holiday to celebrate the birthday of the Jade Emperor, the boss of the Chinese gods. The day was used for a special Hokkien New Year, the story going that, one time in the past, the Hokkien people had to hide from robbers for 8 days in a sugarcane field. Because of this story, lots of sugarcane is used for Malaysian decorations for Chinese New Year. Teochew-style Yusheng, a fish-and-noodle dish, is extra common in Malaysia, where it is called \"yeesang\" or \"prosperity toss\". A restaurant in Seremban started getting people to eat it by throwing it high in the air for good luck in the 1940s, and people had so much fun that they have done it ever since. Properly, it should have 7 parts and be eaten on the 7th day of the holiday, but people now eat it in different ways, too.. Another common dish is \"steam boat\", a kind of seafood hot pot. As in other Chinese places, eating and giving away oranges and tangerines is common in Malaysia. A special tradition is for women with no boyfriend or husband to throw an orange into the sea to find a man. Some now write their telephone numbers on the oranges they throw, and men will use boats to go out and get the fruit. Many people in Malaysia who believe in Islam and Hinduism have also started giving red envelopes full of money—which Malaysians call \"ang pow\" from its Hokkien name âng-pau—during their own holidays, like Eid (\"Syawal\") and Divali (\"Deepavali\"). The Islamic ang pow usually have Arabic designs, and the Hindu ones are often purple. ===Singapore=== Singapore, like Malaysia, has a national holiday for Chinese New Year and the day after it. It also sees lot of \"steam boat\" hot pot dinners. In 1972, the government stopped people from using their own fireworks during the holiday. Worried that people would find the next celebration less fun, they began the Chingay Parade the next year in 1973. In 1977, Indians and Malays joined the parade, which happens on the 8th day of the New Year. The parade is now the biggest in Asia,.. with more than 10,000 people in it and floats that showing every animal of the circle of Chinese years and the money god Cai Shen. More than 100,000 come to see it in person, and millions of people see it on TV. There are still government firework shows, and the people of Singapore now make noise during the holiday by hitting bamboo sticks together. Holiday shopping and street shows are centered on Chinatown. Its Wishing Tree is filled with cards that tell people's hopes and dreams. The money from selling the cards is used for the area's activity center for the old. Downtown, the holiday is used as a showcase for Chinese arts and customs. The Chinese Festival of Arts starts on the 5th day and runs for the rest of the holiday until the Lantern Festival. The National Gallery, Stamp Museum, and Asian Civilizations Museum let people in for free on some of the days of the holiday.. For more than 10 years, Singapore has held a big lion dancing contest with teams coming from other countries across Southeast Asia.. During the Lantern Festival on the 15th day of the New Year, there is the River Hongbao show on the Marina Bay Floating Platform and along the waterfront. File:Chinese New Year market.jpg | The Chinese New Year market in Chinatown File:Singapore River Hong Bao 2006 6, Feb 06.JPG | The statue of Cai Shen at the River Hongbao File:Chingay Parade 08 Singapore (2269057331).jpg | A dancer at the Chingay Parade File:Singapore Dragondance-performance-02.jpg | Dragon dancers File:Chinese New Year decorations along New Bridge Road, Singapore - 20150215.jpg | Decorations on New Bridge Rd for the Year of the Goat File:Marina-Bay Singapore Firework-launching-CNY-2015-02.jpg | Fireworks at the River Hongbao File:2016 Singapur, Downtown Core, River Hongbao 2016 (42).jpg | Decorations at the River Hongbao ===Brunei=== Chinese New Year, the day before it, the day after it, and the Lantern Festival are national holidays in Brunei. The country has had a large number of Chinese people since the 1930s and 40s, and the sultan sometimes comes to their New Year celebrations. Since 2015, however, Brunei has set out tough Islamic laws that try to stop Muslims from joining or even seeing the Chinese celebrations. Lion dances are allowed only at the last Chinese temple in Brunei, at Chinese schools, and at the homes of the Chinese. Only Chinese people can join the dance. People cannot use fireworks or firecrackers, and dances must stop during the hours of Islamic prayers. Breaking these rules risks as much as B$20,000 and 5 years of jail.. ===Korea=== The Chinese New Year celebrations in North and South Korea are known as Korean New Year. The time in Beijing is 1 hour different from the time in the Korean capital cities of Pyongyang and Seoul. About one time every 24 years, this makes the Korean New Year start on the day after the Chinese New Year. The Korean holiday is very close to the Chinese one, with families gathering, children being very nice to their parents and grandparents, and older people giving gifts of money to the young. The Korean holiday has different traditional foods and games, though. ===Vietnam=== The Chinese New Year celebrations in Vietnam are known as Tet. Like the Korean New Year, it sometimes happens on a different day. In 1967, North Vietnam changed its time so that its capital Hanoi is now 1 hour different from Beijing. This means that the new moon happens a day earlier in Vietnam about one time every 24 years. Vietnamese people also add a 13th month to their calendar at a different time from the Chinese, who always try to put the 1st day of winter in their 11th month. In some years, this makes Tet happen in the month after the Chinese New Year. Like in Korea, the Vietnamese New Year is mostly the same as China's, with families gathering, children saying nice things to their parents and grandparents, and older people giving gifts of money to the young. There are some different foods and traditions, like their New Year tree or special games. Some of the differences come from changes in China: Tet sees more people do nice things for their dead family members. In China, most of the traditions like that were moved to Tomb Sweeping Day at the beginning of April. ===Other places=== The largest US and Canadian celebrations happen in Chinatowns. People eat Chinese food, give gifts, and have dragon parades that sometimes include marching bands. There is no national holiday with time off work, but different events go on for the full traditional 2 weeks up to the Lantern Festival.. In the United Kingdom, the celebration in London's Chinatown and Trafalgar Square drew 500,000 people in 2015.. The holiday is also so important to China that many world leaders will take time to send their good wishes to China and the Chinese people.. File:03958--1903-Clebrating Chinese New Year-Brück & Sohn Kunstverlag.jpg | A German postcard about Chinese New Year in Los Angeles, USA File:05046--1904-Ready_for_the_chinese_New_Year-Br%C3%BCck_%26_Sohn_Kunstverlag.jpg | A Chinese American mother and child dressed for the New Year in LA File:Lion Costume, 1953.jpg | Chinese Americans get the special clothes ready for a lion dance team in LA File:Chinatown london.jpg | London's Chinatown decorated for the Chinese New Year File:Chinese New Year Lion Dance.jpg | Southern lion dancing in New York City, USA File:El poder unificador del fuego y la luz (3240867768).jpg | Fireworks in Mexico City's Chinatown File:Chinese New Year 2015 (16438209297).jpg | The parade and a cloud of smoke from firecrackers in DC File:Year of the Rat.jpg|Chinese New Year in Manchester ==Customs== Most traditional customs have to do with getting more good luck for the new year and staying away from anything unhappy. People hang up decorations, especially pairs of Chinese poems (couplets) on either side of their doors.. Some put pictures of Taoist gods on the doors to scare away bad things. Live plants suggest growth, and flowers suggest coming fruits. Pussy willow is common in some places because its Chinese name sounds like \"money coming in\". It is very common for big decorations to look like the animal for the new year, so that 2017 had Rooster and Chicken pictures and statues and 2018 will have Dogs. People used to welcome the New Year with anything that made loud noises, including drums, cymbals, or even woks and pots. The exact traditions were different in different parts of China. Fireworks and firecrackers became more and more common everywhere, but lately many places have stopped letting most people use them because of the danger of people hurting themselves, of fire, and of dirt in the air that can make people sick. There are still big firework shows in most big cities with many Chinese people, but the city government will do everything and other people just watch. Visits to people's houses are done in new or well-kept clothes. People wear more red than usual, which makes them think of happy times like weddings, and wear less black and white, which makes some think of sad times like funerals.. Red underwear is very common and is most commonly worn during New Years which have the same animal as the wearer's birth year (so, at ages 12, 24, 36, and so on). In Malaysia, it has even become common to give people such red underwear as gifts and for non-Chinese to wear all-red clothes during the season of the Chinese New Year. There are some common things people say to wish good luck to each other, the most important being gōngxǐ fācái (\"congratulations that you are now rich\"). People try not to say bad words, tell ghost stories, or talk about death. Some even stay away from the number four, which sounds like \"death\" in Chinese. Crying babies are also thought to be bad luck, and family members will try to keep children happy during visits. There are some old customs that only a few people or even no one does any more. People still do their \"spring cleaning\" before the holiday but, in old China, they did not sweep or wash clothes on New Year's Day itself. They were afraid of cleaning away good luck together with the dirt. For the same reason, some people did not wash their hair and were very careful not to break any tools. The 5th or 6th day after New Year, when they cleaned and threw away or burned all the trash, was a day for \"sending off\" the God of Being Poor, one of the sons of Zhuanxu. Today, it's more common to clean things as they get dirty, like on other days. Few do anything special about the God of the Poor.. In the same way, people near Beijing thought that it was unlucky to cook or steam food for the first 5 days of the New Year. They would cook all of their next week of food 2 days before it, so it was ready for the reunion meal. They would add yeast to their dumpling skins the day before that, on the 28th day of the 12th month. The skins would have enough time to be ready but not enough time to go bad. Today, people cook or eat out all through the week. It is easy to buy ready-made skins at supermarkets, keep their homemade skins fresh in fridges, or just buy all their dumplings from nearby shops and there is nothing special about the 28th day. On People's Day, the 7th day of the holiday, people used to wear special headbands and thought good weather meant good luck for everyone in the coming year. Everyone used it to count their age, even when it was not their birthday. None of that is common any more. Some traditions have been ended by the Chinese government. People used to run to be the first to set off fireworks and firecrackers at the beginning of the New Year at midnight, wherever they were. The dirty air this caused in big Chinese cities made children and old people sick. Now, the police stop people from doing this in many cities. Taoist traditions that are less common now are giving gifts to the home's kitchen god on the 23rd or 24th day of the 12th month of the old calendar. People said the kitchen god watched the house for the Jade Emperor, the boss of the Chinese gods. The special decorations and gifts were given to him so that he would say nice things. The gods would then be nicer to the house for the next year. The kitchen god was thought to return to the house on the 4th day of the New Year. During the time he was \"away\", people used to feel they could get away from some hard rules about family life without anything bad happening. In the past, love matches would marry during those days with less rules and expense than a full wedding. Today, the days after the Chinese New Year are a common time for weddings but this is because everyone has time off work and not because of any ideas about luck or worry about the gods. In the same way, people used to give animals to Cai Shen, the god of money, on the 2nd or 5th day of the holiday. People used to take a break from visits on \"Red Dog Day\" (Chìgǒu Rì), the 3rd day of the holiday, when an angry god was said to bring bad luck to anyone walking around outside. Now, fewer and fewer people worry about those things. File:A chinese home decorated for New Years.jpg | Doors with store-bought couplets and protecting gods File:Chinese paper cuttings.jpg | Red paper cuttings, most with the Chinese words for \"Spring\" or \"Luck\" File:FuDao.jpg | \"Luck\" is often hung upside-down because \"upside-down\" and \"coming\" sound the same in Chinese File:Eight chinese knots.jpg | Small Chinese knots File:Lantern Festival.jpg | A lantern on the Lantern Festival File:Lucky bamboo plant.jpg | A small stand of bound bamboo, a common gift and decoration for the Chinese New Year File:Tangerine plant.jpg | A tangerine bush, another common gift and decoration ==Food== The reunion dinners on the day before Chinese New Year are often the largest and most expensive of the year. Some families use special and expensive foods to gain face; others use meaningful foods to bring luck. Jiaozi (a kind of dumpling) are common in northern China. People think they look like the old Chinese silver bars. and hold luck inside. Egg rolls and spring rolls like lumpia can also be made to look like golden bars, and oranges and tangerines are thought to look like gold coins. Noodles like yimian or Filipino pansit are eaten uncut to wish for long life. Some dishes are eaten because their Chinese names sound like lucky words, such as \"fish\" and \"well-off\". In Cantonese, \"vegetable\" sounds the same as \"having money\" (choy) and \"leek\" sounds the same as \"counting-and-planning\" (suan). Because of this Cantonese people in China and in other countries try to have some during the New Year holidays. Niangao, called \"tikoy\" in the Philippines,. is a kind of cake made from fried sticky rice and sugar. It is very common in southern China. In Chinese, its name sounds like nián gāo (\"the year gets better\") or niánnián gāoshēng (\"getting better year after year\"). Some people also think its stickiness is like a glue and use it as a wish for holding their family together. Indonesians call their niangao \"basket cakes\" because they mold theirs in bamboo baskets. They also have some special flavors in addition to vanilla and chocolate like pandan, a tree with good-smelling leaves. Some people fry tikoy with eggs; basket cakes are often steamed with pieces of coconut meat. Because most Chinese people in the Philippines speak Hokkien and not Mandarin Chinese, they also like to eat pineapples. In Hokkien, the word for \"pineapple\" sounds like the word for \"having a lot of money\". Some Chinese also put out \"Trays of Togetherness\", dishes with eight different parts and eight different kinds of snack foods. Some common things to put in these trays are kumquats, longans, pieces of coconut meat, peanuts, candies, and melon and lotus seeds. Eight is a lucky number to many Chinese people, like seven in Europe and other places. These dishes are very common among Malaysian and Indonesian Chinese. For the Lantern Festival, the special food is yuanxiao, small balls of sticky rice in a sweet soup. Lichun always happens near the Chinese New Year as well. It is celebrated by eating spring pancakes (chūnbǐng). File:Nian gao.jpg | Niangao, small cakes of sticky rice File:Blessings for chinese new year.jpg | Tangerines with a hongbao File:Chinese_Dumplings.jpg | Chinese dumplings File:Egg rolls.jpg | Egg rolls File:Offerings to the Gods.jpg | A traditional gift of food, drinks, and incense to the gods, especially the kitchen god ==Notes== ==References== Category:Holidays of the People's Republic of China",
 "title": "Chinese New Year"
}