{
 "id": "84825",
 "text": "The Federal Ministry of Defence (BMVg) is a Ministry of the Federal Republic of Germany. At present the headquarters of the ministry are still in Bonn with 3230 working in the Hardthöhe. The second office employs about 500 people in the Bendlerblock in Berlin. ==Organisation== The BMVg is at the highest Federal authority and the highest command authority of the defence forces. The BMVg has civilian and military departments: * the General staff (Führungsstab) of the defence forces, under the Inspector General of the Federal Armed Forces * the top staffs of the 3 forces (Army, Navy and Air Force) * the armaments department the department of defence administration, infrastructure and environmental protection * the personel, social and central department * the legal department * the Budget department * the department for modernisation. Operatively the General Staff of the Defence Forces (or \"FÜ S\", which is short for ) is the most important, it has seven sections divided into 42 smaller sections The press and information staff and the planning staff work directly under the minister ==Federal Minister of Defence== In peace time the Federal Minister of Defence is commander in chief of the Armed Forces, not the Federal President.Grundgesetz, article 65. If Germany is attacked, or about to be attacked, command passes to the Chancellor. == History == In 1950 Chancellor Konrad Adenauer gave Theodor Blank the job of preparing for the time when Germany could have an army. In December 20 people where working in the \"Blank Office\". On 7 June 1955 it had 1300 employees, and it became the Federal Ministry for Defence. It was renamed in Federal Ministry of defence on December 1961 and was seen as one of the \"classic departments\" . At German reunification the National People's Army (Nationale Volksarmee) of East Germany was made part of the Federal Armed Forces. Not long after this, Germany's army took part in the war in Kosovo. This was the first time that Germany's army had been sent to fight outside Germany since the end of World War II ==Federal Ministers of Defence since 1955== German Ministers of Defence German Ministers of Defence German Ministers of Defence German Ministers of Defence German Ministers of Defence German Ministers of Defence No Name Life data Term start Term end Party 1 Theodor Blank 1905-1972 7 June 1955 16 October 1956 CDU 2 Franz-Josef Strauß 1915-1988 16 October 1956 11 December 1962 CSU 3 Kai-Uwe von Hassel 1913-1997 11 December 1962 1 December 1966 CDU 4 Gerhard Schröder 1910-1989 1 December 1966 21 October 1969 CDU 5 Helmut Schmidt 1918-2015 21 October 1969 10 July 1972 SPD 6 Georg Leber 1920-2012 10 July 1972 1 February 1978 SPD 7 Hans Apel 1932-2011 17 February 1978 1 October 1982 SPD 8 Manfred Wörner 1934-1994 4 October 1982 18 May 1988 CDU 9 Rupert Scholz 1937- 18 May 1988 21 April 1989 CDU 10 Gerhard Stoltenberg 1928-2001 21 April 1989 31 March 1992 CDU 11 Volker Rühe 1942- 1 April 1992 26 October 1998 CDU 12 Rudolf Scharping 1947- 28 October 1998 19 July 2002 SPD 13 Peter Struck 1943-2012 19 July 2002 22 November 2005 SPD 14 Franz Josef Jung 1949- 22 November 2005 27 October 2009 CDU 15 Karl-Theodor zu Guttenberg 1971- 28 October 2009 3 March 2011 CSU 16 Thomas de Maizière 1954- 3 March 2011 17 December 2013 CDU 17 Ursula von der Leyen 1958- 17 December 2013 17 July 2019 CDU 18 Annegret Kramp-Karrenbauer 1962- 17 July 2019 8 December 2021 CDU 19 Christine Lambrecht 1965- 8 December 2021 19 January 2023 SPD 20 Boris Pistorius 1960- 19 January 2023 SPD ==References== Germ *",
 "title": "Federal Ministry of Defence (Germany)"
}