{
 "id": "848281",
 "text": "Mesites are small birds which only occur on Madagascar. They are flightless, or near-flightless. There are three species, in two genera. The IUCN has classified them as near-threatened. The IUCN estimates that there are only about 145.000 birds left. They look like doves. == Description == The mesites are forest and scrubland birds that feed on insects and seeds. The brown and white-breasted mesites forage on the ground, gleaning insects from the leaves and under them, as well as low vegetation. The subdesert mesite uses its long bill to probe in the soil. Other birds, such as drongos and flycatchers, will follow mesites to catch any insects they flush and miss. Mesites are vocal birds, with calls similar to passerine song, used for territorial defence. Two or three white eggs are laid in a stick-nest located in a bush or low branch. The Mesitornis species are monogamous while Monias benschi is polygamous and unlike the other two shows significant sexual dichromatism. == Systematics == There are two genera, Mesitornis (2 species) and Monias (subdesert mesite).IOC World Bird List v6.3 IOC World Bird List. Image Genus Species Monias Oustalet & Grandidier, 1903 * Subdesert mesite Monias benschi Oustalet & Grandidier, 1903 Mesitornis Bonaparte, 1855 [Mesites Geoffroy, 1838 non Schoenherr, 1838; Mesoenas Reichenbach, 1861] * White-breasted mesite, Mesitornis variegata (Saint-Hilaire, 1838) * Brown mesite, Mesitornis unicolor (Des Murs, 1845) Historically, mesites phylogenetics relations were not very clear and have been allied with the Gruiformes, Turniciformes and Columbiformes.Hackett, S.J. et al. (2008) A Phylogenomic Study of Birds Reveals Their Evolutionary History. Science, 320(5884):1763–1768. Recent phylogenomic studies support Pterocliformes (sandgrouse) as the sister group of mesites while some more recent studies place this clade with another clade constituted of Columbiformes and Cuculiformes (cuckoos).H Kuhl, C Frankl-Vilches, A Bakker, G Mayr, G Nikolaus, S T Boerno, S Klages, B Timmermann, M Gahr (2020) An unbiased molecular approach using 3’UTRs resolves the avian family-level tree of life. Molecular Biology and Evolution, https://doi.org/10.1093/molbev/msaa191 == References == Category:Birds of Africa Category:IUCN Red List vulnerable species Category:Animals of Madagascar",
 "title": "Mesites"
}