{
 "id": "848429",
 "text": "The 2017 FIFA U-20 World Cup Final was a final that was played on at the Suwon World Cup Stadium, Suwon, South Korea on 11 June 2017. The final was contested by Venezuela and England. England won the match 1–0, winning the title for the first time. This was the first ever final for both England and Venezuela in the history of the tournament. == Background == This was England's first appearance and victory in the final of a global football tournament since their senior World Cup victory in 1966. Their previous best at the U-20 World Cup was third place in 1993. For Venezuela it was only the second appearance at the U-20 World Cup, previously in 2009 they only managed to go as far as the second round. == Road to the final == Venezuela Round England Opponent Result Group stage Opponent Result 2–0 Match 1 3–0 7–0 Match 2 1–1 1–0 Match 3 1–0 Group B winners Final standings Group A winners Opponent Result Knockout stage Opponent Result 1–0 (aet) Round of 16 2–1 2–1 (aet) Quarter-finals 1–0 1–1 (aet) (4–3 pen.) Semi-finals 3–1 == Match == === Details === {| style=\"font-size:90%\" cellspacing=\"0\" cellpadding=\"0\" GK 1 Wuilker Faríñez RB 20 Ronald Hernández CB 5 Williams Velásquez CB 4 Nahuel Ferraresi LB 2 José Hernández RW 19 Sergio Córdova CM 16 Ronaldo Lucena CM 8 Yangel Herrera (c) LW 7 Adalberto Peñaranda CF 11 Ronaldo Chacón CF 9 Ronaldo Peña Substitutions: FW 10 Yeferson Soteldo MF 15 Samuel Sosa DF 13 Jan Hurtado Coach: Rafael Dudamel Assistant referees: Sander van Roekel (Netherlands) Erwin Zeinstra (Netherlands) Fourth official: Julio Bascuñán (Chile) Video assistant referees: Daniele Orsato (Italy) Simon Lount (New Zealand) Assistant video assistant referee: Danny Makkelie (Netherlands) Match rules: * 90 minutes. * 30 minutes of extra time if necessary. * Penalty shoot-out if scores still level. * Ten named eligible substitutes. * Maximum of three substitutions, with a fourth allowed in extra time. === Statistics === Overall Venezuela England Goals scored 0 1 Total shots 19 20 Shots on target 4 8 Shots blocked 4 4 Ball possession 48% 52% Corner kicks 3 9 Fouls committed 16 16 Offsides 0 1 Saves 7 4 Yellow cards 1 2 Red cards 0 0 == Related pages == * 2017 FIFA U-20 World Cup == References == == Other websites == * FIFA U-20 World Cup , FIFA.com Category:FIFA U-20 World Cup Category:2017 in association football Category:2017 in South Korea Category:Football in South Korea Category:June 2017 events",
 "title": "2017 FIFA U-20 World Cup Final"
}