{
 "id": "848409",
 "text": "Brawl Stars is a free multiplayer online battle arena game developed by Supercell. The game was launched worldwide on December 12, 2018, for iOS and Android. == Gameplay == === Game Modes === Gem Grab Showdown Brawl Ball Hot Zone Bounty/Wipeout Knockout Events Monthly Events Ranked Map rotates daily Solo/Duo/Trio Map rotates daily Map rotates Map rotates Map rotates daily Robo Rumble Mega pig/Monthly club challenge Restarts every month/season Game modes such as Trophy Thieves, Basket Brawl (sometimes), Hold the Trophy, Lone Star, and Takedown are not currently in rotation. Brawl Boxes (erased from Brawl Stars) There were different types of Brawl Boxes, including: * Brawl Box: The standard box. * Big Box: Equivalent to 3 Brawl Boxes. * Mega Box: Equivalent to 10 Brawl Boxes. * Omega Box: Equivalent to 15 Brawl Boxes. These boxes could be earned through gameplay, the Brawl Pass, or purchased in the shop. They contained various rewards like Coins, Power Points, Gadgets, Star Powers, and new Brawlers. They have been removed from the game and replaced with starr drops. However, mega boxes were added back on July 12, 2024 for an event which lasted till July 31, 2024. === Brawlers === Brawlers are characters that can be selected by players, each with different abilities. These brawlers fall into a trio (some can be in a duo or solo), characterized by similar themes. As of April 2025, there are currently 90 brawlers in Brawl Stars. This includes 8 rares, 10 super rares, 28 epic, 31 mythic, and 12 legendary. ==== Unlocking ==== Brawlers can be unlocked by collecting credits. The number of credits required to unlock a brawler depends on its rarity. Order of rarities from common to least common is as follows: Common, Rare, Super Rare, Epic, Mythic, Legendary. Chromatic brawlers have been removed from the game and changed into their specific rarities. Credits are obtained from the Brawl Pass, Starr drops and the Starr Road. The credits required for a rare brawler is 160, super rare being 430, epic being 925, mythic being 1900, and legendary being 3800. (Please note brawlers cannot only be obtained by the Starr road.) === Brawl Pass === On May 14, 2020, a game update added a new reward system called the “Brawl Pass”. The Brawl Pass is the game's version of a battle pass. When players compete in battles, they earn XP (formerly known as Tokens) to progress along the Brawl Pass and unlock tiers with various rewards. All players have the free Brawl Pass by default. Players could purchase the premium Brawl Pass with Gems, until January 4, 2023, where a change was made so the pass could only be bought with money. After January 4, Brawl Pass Plus was added, being a different version of the premium Brawl Pass with better rewards. == Starr drops == Starr Drops in Brawl Stars are special rewards that you can unlock and upgrade. Here’s what you need to know: # How to Obtain Starr Drops: #* You can receive up to three Starr Drops every day from winning battles. #* Participate in special events like the Mega pig. #* These drops are awarded for your 1st, 4th, and 8th victories of the day. #* No win streak is required; simply achieve the specified number of daily wins to get your Starr Drops. # Rarity and Upgrades: #* Starr Drops start with a Rare Rarity and have four upgrade chances. #* They can potentially upgrade to Super Rare, Epic, Mythic, or Legendary. #* The rarity determines the value of the in-game items you’ll receive. Rewards from starr drops * Rare starr drop- Coins, power points, credits, XP doublers * Super rare starr drop- Coins, power points, credits, XP doublers, bling * Epic starr drop- Coins, power points, credits, XP doublers, pins, bling, sprays * Mythic starr drop- Coins, power points, credits, XP doublers, pins, bling, sprays, common skins, uncommon skins, brawlers (except legendary rarity) * Legendary starr drops- Coins, power points, credits, XP doublers, pins, bling, sprays, any skins up to epic, brawlers (even legendary) == References == Category:2018 video games Category:Android (operating system) games Category:Esports games Category:IOS games Category:Multiplayer online games Category:Strategy video games Category:Supercell (video game company) games",
 "title": "Brawl Stars"
}