{
 "id": "848700",
 "text": "Drought developed in the Midwestern, Western and Northeastern United States during summer 2020. States especially hard hit by drought were Iowa, Nebraska, Colorado, North Dakota, South Dakota, Utah, Wyoming, New Mexico and Nevada. In 2021, drought conditions improved in the Northeast. However, they got worse in the Western United States. As of June 2021, \"nearly the entire region (97 percent) was facing abnormally dry conditions.\" Drought conditions also affected large areas of Mexico and Canada. The drought conditions of 2020 were associated with a very strong La Niña pattern that had developed in the Pacific Ocean. Across several sections of North America, the dry problems extended to 2022. ==United States== ===West=== By Fall 2020, drought in the Western U.S. was the worst since a similar drought seven years earlier. The 2020–21 drought was described by some as the worst drought in modern history in the Western U.S. By late spring 2021, dry conditions had expanded to almost the entire state of California and to nearby Nevada. ===Midwest=== Iowa got widespread rain during September 2020. It improved the dry conditions in the eastern part of the state. However, the western part of the state had severe- to-extreme drought. The conditions lasted past 2020 and well into 2021. By late spring 2021, northeastern, northern and central Iowa were back under dry conditions. The 2020–21 drought also affected Michigan, south-central Wisconsin, most of North Dakota and South Dakota. In northeastern Illinois near the Chicago metropolitan area, May 2021 was the driest since 2012. As of June 1, 2021, Chicago had only gotten barely half an inch of rain due to dry conditions in the area. ===Northeast=== By late August/early September 2020, dry conditions across several parts of the United States had worsened. The New England states and New York were under severe or extreme drought. The Northeastern United States were out of drought conditions by June 2021. ===Southeast=== By June 2021, moderate drought conditions had developed in Virginia, South Carolina, North Carolina and Florida. ==Mexico== As of April 2021, Mexico was under one of the most widespread droughts in its history. Almost 85% of the country had drought conditions. ==Canada== As of spring 2021, extreme drought threatened the Canadian Prairies in Manitoba and Saskatchewan. These areas had gone through an abnormally dry fall and spring. ==Related pages== *Droughts in the United States *1988–90 North American drought *2012–13 North American drought ==References== Category:Droughts Category:2020 disasters in the United States Category:2021 in the United States Category:2022 in North America",
 "title": "2020–22 North American drought"
}