{
 "id": "848839",
 "text": "\"Sight of You\" is a song recorded by English singer and songwriter Tulisa. Taken as the third single from the singer's debut studio album, The Female Boss (2012). The single was released on 2 December 2012, a day before the release of the album. The song was co-written by Tulisa and Terius \"The-Dream\" Nash and was produced by The-Dream. ==Background== On 11 September 2012 Tulisa revealed that her new single would be a \"Christmassy ballad\" that would \"stand the test of time\", without revealing the track's title. Ater the announcement, she visited the BBC Radio 1 Live Lounge, where she performed an album track which was also a ballad called \"Skeletons\". Due to this, it was assumed that \"Skeletons\" was the song that Tulisa was describing. However, on 8 October 2012, press images captured on the set of her new music video confirmed the title of the single to be \"Sight of You\" and not \"Skeletons\". This was confirmed by Tulisa herself when she invited the contestants from her category on The X Factor to join her at the video shoot, and behind the scenes footage of the video was featured on the show. Shortly after, on 21 October 2012, the full official music video premiered via Tulisa's official VEVO account on YouTube. The video features Tulisa standing on a bridge with a city view, performing the song whilst traffic flows beneath her. Other scenes include a heatbreaking relationship between Tulisa and her boyfriend, played by her short-term real life boyfriend Jody Latham. ==Track listing== * Digital download EPiTunes - Music - Sight of You (Remixes) - EP by Tulisa. UK # \"Sight of You\" (Album Version) \\- 4:37 # \"Live Your Life\" (Clean Version) \\- 3:58 # \"Sight of You\" (Sticky Edit) \\- 3:37 # \"Sight of You\" (TS7 Remix) \\- 5:31 # \"Sight of You\" (Rudedog Remix) \\- 6:05 # \"Sight of You\" (Music Video - Director's Cut) \\- 4:00 * Promotional CD single # \"Sight of You\" (Radio Edit) \\- 3:54 # \"Live Your Life\" (Clean Radio Edit) \\- 3:18 ==Charts== Chart (2012) Peak position ==Release history== Region Date Format Label IrelandiTunes - Music - Sight of You (Remixes) - EP by Tulisa. IRE 2 December 2012 Digital download, CD single All Around the World, Island United Kingdom ==References== Category:2012 songs Category:Tulisa songs Category:Hip hop soul songs Category:R&B; ballads",
 "title": "Sight of You"
}