{
 "id": "849016",
 "text": "Go Jetters is a 3D animated children's television series, airing on Nick Jr. Channel 5 and CBeebies. This geography based programme was commissioned by CBeebies controller Kay Benbow and is a co-production of CBeebies In-house Production and BBC Worldwide. The program aimed at the upper-end of preschool, Go Jetters follows the adventures of four heroes―Xuli, Kyan, Lars and Foz, as they travel the world with their teacher, mentor and friend, Ubercorn. The programme uses songs and music to expose facts about various countries and environments. The programme started out as a feature on the channel's website, but was so popular it got spun off into the more successful series. == Characters == === Go Jetters === Each Go Jetter has a star logo on their basic suit, and a particular speciality and a sentence they'll often repeat over the episodes. * Xuli (Pilar Orti), who is the pilot of the Vroomster and occasionally Jet Pad. Until the addition of Tala (Season 3), she was the only female of the group. Xuli wears a purple and yellow suit, with stylised wings around its logo, and dark purple gloves and boots. She has a white fringe. She is from Spain, her catchphrase is 'not cool' and she takes a 'selfie' of the team at the end of each episode. * Kyan (Akie Kotabe), who is the sporty one, very good at gymnastics. He wears a deep blue and orange suit along with dark blue gloves and boots with no particular sign of his speciality. He is Chinese-American, has a Californian accent and is known to say \"aced it!\" in every episode. He never stays still, unless asleep, reading, or meditating! * Lars (Syrus Lowe), who is the tallest of the Go Jetters, really good at fixing things. In red and white, his logo has a cog-shaped surrounding, wearing dark red gloves and boots. He is British and is known to say \"Geographic!\" in most episodes. Lars is also shown being an Eiffel Tower lover in the first episode of the series. * Foz (John Hasler), who is the clever one, and also the smallest. In light blue and yellow wearing light blue gloves and boots, his logo is shaped like a broken circle similar to an on/off symbol. He is also from Britain and is known to build his sentences like mathematical formulae (X plus Y equals Z) and say \"ergo\". * Tala (Tala Gouveia), who is a new cadet of the Go Jetters that appears in the third series, and is the niece of Grandmaster Glitch. * Ubercorn (Tommie Earl Jenkins), an anthropomorphic unicorn who is the leader and mentor of the Go Jetters Academy, he is a funky disco-grooving unicorn. Ubercorn is dressed in a white sparkly suit with light blue stars and purple goggles, and has red sparkly hooves and a purple mane and tail. He guides the Go Jetters during their missions by giving them advice and selecting click-ons for them – suit upgrades enabling them to tackle different situations. He also presents them with three 'funky facts' about each place they visit, introduced by a theme song. * Jet Pad (Naomi McDonald), the high-tech computerised jet that helps the Go Jetters to go around the world and serves as their HQ. Jet Pad is electrically powered and in one episode is seen recharging at Niagara Falls. === Villains === * Grandmaster Glitch (Marc Silk), a troublemaker who is a disgruntled former cadet of the Go Jetter Academy. Glitch likes mud and having fun, which usually involves destroying or using a landmark to achieve his plans. He has a large moustache, used as his trademark, and funnel-like pieces on his helmet. He calls the Go Jetters several names and accuses them of screwing up his fun, and his catchphrase is \"Grimbles!\" which he says in frustration. He travels around in the Grim HQ, a rusty rocket ship that leaves a trail of smoke, and has a teddy bear called Cuddles. * Grimbots (Marc Silk), who are little spherical robots, Grandmaster Glitch's minions. They take care of everything at Grim HQ, Glitch's main jet and help Glitch in his mischievous activities. ===Tourist=== * Tourist man a partner who wears a pink hawaian shirt. * Tourist woman a jamaica woman. she wears pink flip flops. * Tourist boy who wears a cap and taking selfies. * Tourist girl who is the tourist boy younger sister. ==References== Category:2010s British television series Category:2010s British television series debuts Category:2010s children's television series Category:2015 television series debuts Category:2020 television series endings Category:2020s British television series endings Category:British animated television series Category:British children's television series Category:English-language television programs Category:CBeebies",
 "title": "Go Jetters"
}