{
 "id": "849150",
 "text": "Mason Will John Greenwood (born 1 October 2001) is an English-Jamaican professional football player. Greenwood played for Manchester United and Jamaica national team. His usual position is as a forward. Greenwood played in Manchester United's youth teams. He climbed through various youth groups within the United team. Greenwood played his first game for the Manchester United first team in 2019. When he scored against Astana in September 2019, Greenwood became the club's youngest goalscorer in European competition. He first played for England in September 2020 against Iceland. He was arrested by the Greater Manchester Police in January 2022, on suspicion of assault and rape and shared it online. He has been removed from FIFA 22, EA Sports, FIFA. As of Feburary 2nd, he has been released on bail. On 21 August 2023, it was announced by United that Greenwood would leave the club. He was loaned to the La Liga club Getafe on 1 September 2023. ==Career statistics== ===Club=== Appearances and goals by club, season and competition Club Season League National cup EFL Cup Europe Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Manchester United 2018–19 Premier League 3 0 0 0 0 0 1 0 — 4 0 2019–20 Premier League 31 10 5 1 4 1 9 5 — 49 17 2020–21 Premier League 31 7 4 2 3 1 14 2 — 52 12 2021–22 Premier League 18 5 1 0 1 0 4 1 — 24 6 2022–23 Premier League 0 0 0 0 0 0 0 0 — 0 0 2023–24 Premier League 0 0 0 0 0 0 0 0 — 0 0 Total 83 22 10 3 8 2 28 8 — 129 35 Manchester United U21 2019–20 — — — — — 1 1 1 1 Getafe (loan) 2023–24 La Liga 9 1 1 2 — — — 10 3 Career total 92 23 11 5 8 2 28 8 1 1 140 39 ===International=== Appearances and goals by national team and year National team Year Apps Goals England 2020 1 0 Total Total 1 0 ==Honours== Manchester United *UEFA Europa League runner-up: 2020–21 Individual *Premier League 2 Player of the Month: April 2019 *Jimmy Murphy Young Player of the Year: 2018–19 *IFFHS Men's Youth (U20) World Team: 2021 ==References== Category:2001 births Category:Living people Category:English footballers Category:Manchester United F.C. players Category:Premier League players Category:Sportspeople from Bradford",
 "title": "Mason Greenwood"
}