{
 "id": "849106",
 "text": "The 1755 Lisbon earthquake was a major earthquake that hit Portugal and the rest of the Iberian Peninsula on 1 November 1755. The earthquake caused serious damage to Lisbon. It killed an estimated 60,000 people in Lisbon alone. Violent shaking destroyed about 12,000 homes. Because November 1, when the quake struck, was All Saints' Day, many people were attending mass at the time of the quake. Churches collapsed and many people died. The earthquake caused a tsunami that produced waves about 20 feet (6 metres) high in Lisbon. Shocks from the earthquake were felt throughout Europe. The disaster became an important event in European history.Histoire de ma vie, Book 2, Ch. XXVI; Casanova noted feeling the shocks when he was imprisoned in \"The Leads\" in Venice and states they were the same ones that destroyed Lisbon == Related pages == * 1755 Cape Ann earthquake == Notes == == References == * Benjamin, Walter. \"The Lisbon Earthquake.\" In Selected Writings vol. 2. Belknap, 1999. . The often abstruse critic Benjamin gave a series of radio broadcasts for children in the early 1930s; this one, from 1931, discusses the Lisbon earthquake and summarizes some of its impact on European thought. * Braun, Theodore E. D., and John B. Radner, eds. The Lisbon Earthquake of 1755: Representations and Reactions (SVEC 2005:02). Oxford: Voltaire Foundation, 2005. . Recent scholarly essays on the earthquake and its representations in art, with a focus on Voltaire. (In English and French.) * Brooks, Charles B. Disaster at Lisbon: The Great Earthquake of 1755. Long Beach: Shangton Longley Press, 1994. (No apparent ISBN.) A narrative history. * Chase, J. \"The Great Earthquake at Lisbon (1755)\". Colliers Magazine, 1920. * Dynes, Russell Rowe. \"The dialogue between Voltaire and Rousseau on the Lisbon earthquake: The emergence of a social science view.\" University of Delaware, Disaster Research Center, 1999. * Fonseca, J. D. 1755, O Terramoto de Lisboa, The Lisbon Earthquake. Argumentum, Lisbon, 2004. * Gunn, A.M. \"Encyclopedia of Disasters\". Westport, Connecticut: Greenwood Publishing Group, 2008. . * Hamacher, Werner. \"The Quaking of Presentation.\" In Premises: Essays on Philosophy and Literature from Kant to Celan, pp. 261–293. Stanford University Press, 1999. . * Kendrick, T.D. The Lisbon Earthquake. Philadelphia and New York: J. B. Lippincott, 1957. * Molesky, Mark. This Gulf of Fire: The Destruction of Lisbon, or Apocalypse in the Age of Science and Reason. New York: Knopf, 2015. * Neiman, Susan. Evil in Modern Thought: An Alternative History of Modern Philosophy. Princeton University Press, 2002. This book centers on philosophical reaction to the earthquake, arguing that the earthquake was responsible for modern conceptions of evil. * Paice, Edward. Wrath of God: The Great Lisbon Earthquake of 1755. London: Quercus, 2008. * Pereira, A.S. \"The Opportunity of a Disaster: The Economic Impact of the 1755 Lisbon Earthquake\". Discussion Paper 06/03, Centre for Historical Economics and Related Research at York, York University, 2006. * Quenet, Grégory. Les tremblements de terre en France aux XVIIe et XVIIIe siècles. La naissance d'un risque. Seyssel: Champ Vallon, 2005. * Ray, Gene. \"Reading the Lisbon Earthquake: Adorno, Lyotard, and the Contemporary Sublime.\" Yale Journal of Criticism 17.1 (2004): pp. 1–18. * Seco e Pinto, P.S. (Editor). Earthquake Geotechnical Engineering: Proceedings of the Second International Conference, Lisbon, Portugal, 21–25 June 1999. * Shrady, Nicholas. The Last Day: Wrath, Ruin & Reason in The Great Lisbon Earthquake of 1755, Penguin, 2008, * Weinrich, Harald. \"Literaturgeschichte eines Weltereignisses: Das Erdbeben von Lissabon.\" In Literatur für Leser, pp. 64–76. Stuttgart: Kohlhammer Verlag, 1971. . In German. Cited by Hamacher as a broad survey of philosophical and literary reactions to the Lisbon earthquake. Category:1755 Category:18th century in Europe Category:Earthquakes in Europe 1755 earthquake",
 "title": "1755 Lisbon earthquake"
}