{
 "id": "849313",
 "text": "Anastasia () was a Roman woman of the Constantinian dynasty (a line of rulers who governed the Roman Empire during Late Antiquity). Anastasia was the daughter of the Roman emperor ConstantiusI, the half-sister of the emperor Constantine the Great, and the wife of Bassianus. Anastasia's mother was Flavia Maximiana Theodora, the wife of Constantius I. (It is also possible that Anastasia was the daughter of Helena, mother of Constantine I, and not a daughter of Maximiana Theodora.) Anastasia was written about by the Roman historian Ammianus Marcellinus and the writer of the Anonymus Valesianus, a Latin history. The Notitia Urbis Constantinopolitanae says that Roman baths in Constantinople (the Romans' capital city) had Anastasia's name. Anastasia's name () may mean that her father had sympathy for Christian or Jewish culture. There is no evidence that any of Constantius's daughters married before their father died. Anastasia's sister Constantia may have been the first to marry, and may have been the oldest of the siblings. Constantia married in 313. Anastasia herself married Bassianus in 316 or in 314. At that time, Anastasia's half-brother Constantine was emperor. He planned to make Bassianus (a junior co-emperor). Anastasia's brother-in-law Licinius (Constantine's junior co-emperor) did not want this to happen, and Bassianus did not become . After this Constantine executed Bassianus. The Anonymus Valesianus says that Bassianus's execution was because Bassianus planned treason. What became of Anastasia is unknown. The encyclopaedia Brill's New Pauly says that Anastasia \"must have still been alive\" when Constantine built the city of Constantinople, because of the Roman baths there with her name (). In the 5th century, the Greek historians of Socrates Scholasticus and Sozomen both wrote that the got their name from another Anastasia, a daughter of the emperor Valens. This information is not correct. == Related pages == * Eutropia (daughter of Constantius I), Anastasia's sister == References == Category:Roman people Category:3rd-century births Category:4th-century deaths",
 "title": "Anastasia (daughter of Constantius I)"
}