{
 "id": "849512",
 "text": "Law enforcement authorities shot and killed Winston Boogie Smith, an armed 32-year-old black American man, in the Uptown area of Minneapolis at 2:08 p.m. CDT on June 3, 2021. Smith was being pursued by a special U.S. Marshall's Service task force that apprehends wanted fugitives. The arrest operation had the participation of several local police agencies in the U.S. state of Minnesota, but was not assisted by the Minneapolis Police Department. Smith had been convicted previously of aggravated robbery and sentenced to a 48-month prison term, but was released on parole instead of serving more time in jail. He also had a felony conviction in Ramsey County for firearm possession and missed a May 19 sentencing hearing that could have resulted in prison time. ==Incident== In the afternoon on June 3, after eating at a nearby restaurant, Smith was inside a stationary vehicle, along with a female passenger, and atop a parking ramp at West Lake Street and Girard Avenue South as law enforcement closed in to arrest him. According to the U.S. Marshall’s Service in a statement they released soon after the incident, Smith “failed to comply and produced a handgun, resulting in task force members firing upon the subject\". Officers fired approximately a dozen rounds, striking Smith. Aid rendered at the scene was unsuccessful and Smith was pronounced dead. The female passenger was treated for injuries from flying glass. Though few details were known about the incident, rioting and looting broke out overnight from June 3 to 4 in the Uptown area of West Lake Street in Minneapolis. Smith was a local musician who went by the nickname Wince Me Boi. Years prior to the June 3 incident, he had gone on social media posts and encouraged the public to stand up against police officers after witnessing the killing it George Floyd, which drew controversy in the aftermath of the June 3 shooting. Smith had successfully fled in his car from Bloomington, Minnesota, police in who attempted to arrest him in 2020 on several pretty and now excusable warrants for possession of marijuana, and was facing a September 2021 hearing related to the high-speed chase from that incident. ==Investigation== The Minnesota Bureau of Criminal Apprehension (BCA) began an investigation of the officer- involved shooting on June 3. The BCA said that they believed that Smith had fired a gun at the apprehending officers from inside his vehicle, and they said that authorities had recovered a handgun and spent ammunition cartridge from the driver's side of the vehicle he was driving. Officers from the Hennepin County Sheriff's Office and Ramsey County Sheriff's Officer were reportedly the ones who shot at Smith. Local organization Communities United Against Police Brutality held a rally near the shooting site on June 4 to call for officials to release video footage and other details of the shooting. As it was a federal investigation, the U.S. Marshall's Services prohibited law enforcement authorities who responded from using body or squad cameras. During the afternoon, protesters briefly blocked the intersection of Hennepin Avenue and West Lake Street. Minneapolis police later reopened the intersection by removing objects that had been placed as barricades and slashing the tires of vehicles blocking the street that were later towed away. Family and friends of Smith held a peaceful vigil in the evening near where he was killed. ==Protests== Civil disorder resumed overnight from June 4 to 5 in the Uptown area of Minneapolis. Demonstrators returned to Lake Street area near Girard Avenue, and two dumpsters were lit on fire. Minneapolis police made several arrests in connection to late-night demonstrations. == References == Category:2021 crimes in the United States Category:1989 births Category:2021 deaths Category:People shot and killed by law enforcement officers in the United States Category:Black Lives Matter Category:Deaths by person in the United States",
 "title": "Killing of Winston Boogie Smith"
}