{
 "id": "849508",
 "text": "Fabrice Ndala Muamba (born 6 April 1988) is an English former professional footballer and current coach. He played as a central midfielder. Born in Zaire, Muamba moved to England at the age of 11 and later played for England up to under-21 level. ==Career== Muamba joined Arsenal's youth academy in 2002. After three years, he turned professional in 2005. He joined Birmingham City on loan in 2006. The move was made permanent in 2007. He made a total of 79 appearances for Birmingham City. In 2008, he joined Premier League club Bolton Wanderers. He made 148 appearances for Bolton, including 130 Premier League matches. On 17 March 2012, Muamba had a cardiac arrest during an FA Cup match between Bolton and Tottenham Hotspur. Although his heart stopped for 78 minutes, he was successfully revived. He retired from professional football in August 2012 based on medical advice. As of September 2018, Muamba is a youth coach at Rochdale. ==Personal life== Muamba was born in Kinshasa, Zaire (now the Democratic Republic of the Congo). In 1994, his father arrived in the UK after leaving Zaire because of his political views. He was given indefinite leave to remain in 1999. The rest of his family soon joined him. Muamba married Shauna Magunda in October 2012. The couple have four children. ==Career statistics== Appearances and goals by club, season and competition Club Season League FA Cup League Cup Other Total Division Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Arsenal 2005–06 Premier League 0 0 0 0 2 0 0 0 2 0 Birmingham City (loan) 2006–07 Championship 34 0 3 0 4 0 — 41 0 Birmingham City 2007–08 Premier League 37 2 1 0 0 0 — 38 2 Total 71 2 4 0 4 0 — 79 2 Bolton Wanderers 2008–09 Premier League 38 0 1 0 1 0 — 40 0 2009–10 Premier League 36 1 4 0 3 0 — 43 1 2010–11 Premier League 36 1 5 0 0 0 — 41 1 2011–12 Premier League 20 1 2 0 2 1 — 24 2 Total 130 3 12 0 6 1 — 148 4 Career total 201 5 16 0 12 1 — 229 6 ==Honours== England U21 *UEFA European Under-21 Championship runners-up: 2009 ==References== ==Other websites== * Category:1988 births Category:Living people Category:Arsenal F.C. players Category:Association football midfielders Category:Black British sportspeople Category:English footballers Category:English football managers Category:Premier League players Category:Naturalised citizens of the United Kingdom",
 "title": "Fabrice Muamba"
}