{
 "id": "849796",
 "text": "The Parents Music Resource Center (PMRC) was an American organization. It was established in 1985. The founders of this organization were Pam Howar, Tipper Gore (the wife of Al Gore), Sally Nevius and Susan Baker. Their stated goal was increasing parental control over the access of children of music that had violent themes, sexual lyrics, themes of drugs or other substandard behaviors in the lyrics by labeling studio albums under Parental Advisory stickers. ==Actions== As a method for tackling the problem, the PMRC wanted a voluntary move by the RIAA or the music industry. PMRC wanted them to develop a similar rating system to the Motion Picture Association of America. Other recommendations by the PMRC which appeared in an article in the Washington Post were: printing warnings and song lyrics on album covers, forcing record stores to put albums having explicit covers under the counters. ==Filthy Fifteen== The PMRC made a list of fifteen songs in music. At that time, they found the songs the most objectionable. These songs are listed under the \"Filthy Fifteen\" list by the PMRC, with the reasons for which the songs are listed. # Artist Song title Lyrical content 1 Prince \"Darling Nikki\" Sex/Masturbation 2 \"Sugar Walls\" Sex 3 Judas Priest \"Eat Me Alive\" Sex/Violence 4 Vanity \"Strap On 'Robbie Baby'\" Sex 5 Mötley Crüe \"Bastard\" Violence/Language 6 AC/DC \"Let Me Put My Love Into You\" Sex 7 Twisted Sister \"We're Not Gonna Take It\" Violence 8 Madonna \"Dress You Up\" Sex 9 W.A.S.P. \"Animal (Fuck Like a Beast)\" Sex/Language/Violence 10 Def Leppard \"High 'n' Dry (Saturday Night)\" Drug and alcohol use 11 Mercyful Fate \"Into the Coven\" Occult 12 Black Sabbath \"Trashed\" Drug and alcohol use 13 Mary Jane Girls \"In My House\" Sex 14 Venom \"Possessed\" Occult 15 \"She Bop\" Sex/Masturbation ==The Parental Advisory sticker== On November 1, 1985, the RIAA agreed to put \"Parental Advisory\" stickers on certain releases at their own discretion. Many record stores wouldn't sell albums having the label (for example: Walmart). Others limited the sales of such albums to adults. ==Musician/singer reaction== * The Iceberg/Freedom of Speech... Just Watch What You Say!, the 1989 album from American rapper Ice-T, goes against Tipper Gore. One song on the album, \"Freedom of Speech\", is an extended attack on Gore. * The liner notes of Sonic Youth's 1990 album Goo have a cartoon with a caption saying: \"SMASH THE PMRC\". * The Aerosmith song \"F.I.N.E.\", from their 1989 studio album Pump, talks about Tipper Gore in the line \"Even Tipper thinks I'm alright.\" This song has references to sex. Other musicians or singers, including Eminem, Rage Against the Machine and Megadeth. ==References== Category:Controversies in the United States Category:1985 establishments in the United States",
 "title": "Parents Music Resource Center"
}