{
 "id": "849902",
 "text": "Purble Place is a set of three learning games created by Oberon Media, which no longer exists, for Microsoft. These games were designed for Windows Vista and Windows 7. They were not included in Windows 8. == History == Purble Place was first shown in Windows Vista build 5219, together with Chess Titans and Mahjong Titans. == Games == The collection features one main screen with three game packs: Purble Pairs, Comfy Cakes, and Purble Shop. === Purble Pairs === Purble Pairs is a memory game like Concentration, where the goal is to clear the board in the fewest turns. As the difficulty increases, a timer appears, the grid size grows, and more similar images are used. The Beginner level has one 5x5 grid, Intermediate has two 6x6 grids, and Advanced has four 8x8 grids per game (with different shapes). Special pairs and features are available in higher levels, such as a jester that finds a match, a card that shuffles the board, a clock that adds time, and a chef that matches cake cards. A Sneak Peek bonus lets the player see all cards for a short time, but each card seen counts as a turn. This game isn't in Purble Place v0.4, an early version from 2005. === Comfy Cakes === Comfy Cakes is a hand-eye coordination game. The goal is to make cakes that match a given specification by controlling a conveyor belt with different cake-making stations. Cake elements include pan shapes (square, circular or heart-shaped), batter flavors (strawberry, chocolate or vanilla), three cake layerings (red, green or white), optional icing (strawberry, chocolate or vanilla), and decorations (decorations such as sugar can be sprinkled on top of the cake. In some rare cases, flames are applied to iced cakes to create a smooth glaze.). There's also a rotate button in v0.4. If the cake doesn't match the specification, the player is penalized, and the cake is thrown away. The game ends if two or three wrong orders are sent. To win, the player must complete a certain number of correct orders. The final score depends on the number of cakes made, incorrect orders, and the player's efficiency. At higher levels, the specifications become more complex, and multiple cakes must be made on a single conveyor belt. The player makes around five to eight cakes in one difficulty level. If the player tries an incorrect move, the computer says it's not allowed. === Purble Shop === Purble Shop is a code-breaker game where the computer chooses up to five features (topper, eyes, nose, mouth, and clothes) and hides their colors from the player. The can choose from five colors (red, purple, yellow, blue, and green) and use each color once, several times, or not at all. The player then tries to guess the correct feature colors in a limited number of attempts. It's like a game called Mastermind where you have to use your brain to figure out the right colors. There are three difficulty levels: * Beginner level with three features and three possible colors (27 different solutions) * Intermediate with four features and four possible colors (256 solutions). * Advanced level with five features and five possible colors (3125 solutions). == Related pages == * List of games included with Windows ==References== Category:2007 video games Category:Cooking video games Category:Microsoft video games Category:Mobile games Category:Puzzle video games Category:Single-player video games Category:Video games developed in the United States Category:Windows games",
 "title": "Purble Place"
}