{
 "id": "85029",
 "text": "ImageSize = width:800 height:200 PlotArea = top:10 bottom:80 right:20 left:20 Legend = columns:3 left:30 top:58 columnwidth:270 AlignBars = early DateFormat = dd/mm/yyyy Period = from:01/06/2006 till:30/11/2006 TimeAxis = orientation:horizontal ScaleMinor = grid:black unit:month increment:1 start:01/06/2006 Colors = id:canvas value:gray(0.88) id:GP value:red id:TD value:rgb(0.38,0.73,1) legend:Tropical_Depression_=_<39_mph_(0-62_km/h) id:TS value:rgb(0,0.98,0.96) legend:Tropical_Storm_=_39-73_mph_(63-117 km/h) id:C1 value:rgb(1,1,0.80) legend:Category_1_=_74-95_mph_(119-153_km/h) id:C2 value:rgb(1,0.91,0.46) legend:Category_2_=_96-110_mph_(154-177_km/h) id:C3 value:rgb(1,0.76,0.25) legend:Category_3_=_111-130_mph_(178-209-km/h) id:C4 value:rgb(1,0.56,0.13) legend:Category_4_=_131-155_mph_(210-249_km/h) id:C5 value:rgb(1,0.38,0.38) legend:Category_5_=_>=156_mph_(>=250_km/h) Backgroundcolors = canvas:canvas BarData = barset:Hurricane bar:Month PlotData= barset:Hurricane width:10 align:left fontsize:S shift:(4,-4) anchor:till from:10/06/2006 till:14/06/2006 color:TS text:\"Alberto\" from:17/07/2006 till:18/07/2006 color:TS text:\"Unnamed\" from:18/07/2006 till:21/07/2006 color:TS text:\"Beryl\" from:31/07/2006 till:05/08/2006 color:TS text:\"Chris\" from:21/08/2006 till:26/08/2006 color:TS text:\"Debby\" from:24/08/2006 till:01/09/2006 color:C1 text:\"Ernesto\" from:03/09/2006 till:12/09/2006 color:C1 text:\"Florence\" from:10/09/2006 till:20/09/2006 color:C3 text:\"Gordon\" barset:break from:12/09/2006 till:24/09/2006 color:C3 text:\"Helene\" from:27/09/2006 till:02/10/2006 color:C1 text:\"Isaac\" barset:skip bar:Month width:5 align:center fontsize:S shift:(0,-20) anchor:middle color:canvas from:01/06/2006 till:01/07/2006 text:June from:01/07/2006 till:01/08/2006 text:July from:01/08/2006 till:01/09/2006 text:August from:01/09/2006 till:01/10/2006 text:September from:01/10/2006 till:01/11/2006 text:October from:01/11/2006 till:30/11/2006 text:November TextData = pos:(570,30) text:\"(From the\" pos:(618,30) text:\"Saffir-Simpson Hurricane Scale)\" Below is a timeline of the 2006 Atlantic hurricane season, listing all the storm formations, strengthening, weakening, landfalls, extratropical transitions, as well as dissipation. The 2006 Atlantic hurricane season was a season in which an El Niño event stopped much tropical cyclone activity, especially later in the season. The season officially began on June 1, 2006, and lasted until November 30. For convenience and clarity, in the timeline below, all landfalls are bolded. The timeline also includes information which was not operationally released, meaning that information from post-storm reviews by the National Hurricane Center, such as information on a storm that was not operationally warned on, have been included. The graphical bar above gives a brief overview of storm activity during the season, and for convenience, the storm's maximum intensity is included as a color bar. Tropical Storm Zeta from 2005 persisted into 2006, therefore a January section has been included in the text timeline. ==Timeline of storms== ===January=== ;January 1 :*0000 UTC - The year 2006 begins with Tropical Storm Zeta still active from the previous season, making Zeta only the second cross- season North Atlantic storm ever recorded. ;January 6 :*2 a.m. AST (0600 UTC) - Tropical Storm Zeta weakens into a tropical depression. :*5 p.m. AST (2100 UTC) - The National Hurricane Center issues its last advisory on dissipating Tropical Depression Zeta, finally ending the 2005 season. ===June=== ;June 1 :*The 2006 Atlantic hurricane season officially begins. ;June 10 :*1 a.m. CDT (0600 UTC) - Tropical Depression One forms 120 nautical miles (140 miles, 220 km) south of the western tip of Cuba. :*7 p.m. CDT (0000 UTC June 11) - Tropical Depression One strengthens into Tropical Storm Alberto. ;June 13 :*12:30 p.m. EDT (1630 UTC) - Tropical Storm Alberto makes landfall near Adams Beach, Florida, with 45 mph winds. ;June 14 :*2 a.m. EDT (0600 UTC) - Tropical Storm Alberto weakens into a tropical depression. :*8 a.m. EDT (1200 UTC) - The remnants of Alberto become extratropical. :*5 p.m. EDT (2100 UTC) - The HPC issues its first and only advisory on the remnants of Tropical Depression Alberto. ===July=== ;July 17 :*0600 UTC - A previously-extratropical low pressure area becomes a tropical depression about 210 nautical miles (245 miles, 390 km) southeast of Nantucket, Massachusetts. However, this depression is not assigned a number operationally, or warned on, by the National Hurricane Center. :*1200 UTC - The tropical depression near Nantucket strengthens into a tropical storm, but is not operationally named. ;July 18 :*8 a.m. EDT (1200 UTC) - Tropical Depression Two forms 250 nautical miles (290 miles, 645 km) east-southeast of Wilmington, North Carolina. :*1200 UTC - The unnamed tropical storm degenerates into a remnant low. :*2 p.m. EDT (1800 UTC) - Tropical Depression Two strengthens into Tropical Storm Beryl. ;July 21 :*2:45 a.m. EDT (0645 UTC) - Tropical Storm Beryl makes landfall on the island of Nantucket, Massachusetts, with 50 mph winds. :*2 p.m. EDT (1800 UTC) - Tropical Storm Beryl becomes extratropical. ;July 31 :*8 p.m. EDT (0000 UTC August 1) - Tropical Depression Three forms 205 nautical miles (235 miles, 380 km) east-southeast of Barbuda. ===August=== ;August 1 :*2 a.m. AST (0600 UTC) - Tropical Depression Three strengthens into Tropical Storm Chris. ;August 3 :*2 p.m. AST (1800 UTC) - Tropical Storm Chris weakens to a tropical depression. ;August 4 :*2 a.m. AST (0600 UTC) - Tropical Depression Chris weakens into a low. ;August 21 :*2 p.m. AST (1800 UTC) - Tropical Depression Four forms 225 nautical miles (260 miles, 415 km) south-southeast of Praia, Cape Verde. ;August 22 :*8 p.m. AST (0000 UTC August 23) - Tropical Depression Four strengthens into Tropical Storm Debby. ;August 24 :*2 p.m. AST (1800 UTC) - Tropical Depression Five forms in the Caribbean Sea about 40 nautical miles (45 miles, 75 km) north-northwest of Grenada. ;August 25 :*8 a.m. AST (1200 UTC) - Tropical Depression Five strengthens into Tropical Storm Ernesto. ;August 26 :*2 a.m. AST (0600 UTC) - Tropical Storm Debby weakens to a tropical depression. :*8 a.m. AST (1200 UTC) - Tropical Depression Debby weakens into a low. ;August 27 :*2 a.m EDT (0600 UTC) - Tropical Storm Ernesto strengthens into Hurricane Ernesto. :*8 a.m. EDT (1200 UTC) - Hurricane Ernesto weakens to a tropical storm. ;August 28 :*7:15 a.m. EDT (1115 UTC) - Tropical Storm Ernesto makes a first landfall in Cuba at Playa Cazonal with 40 mph winds. ;August 29 :*11 p.m. EDT (0300 UTC) - Tropical Storm Ernesto makes a second landfall at Plantation Key, Florida, with 45 mph winds. ;August 30 :*1 a.m. EDT (0500 UTC) - Tropical Storm Ernesto makes a third landfall in southwestern Miami-Dade County with 45 mph winds. ;August 31 :*11:40 p.m. EDT (0340 UTC September 1) - Tropical Storm Ernesto makes a fourth landfall at Oak Island, North Carolina, with 70 mph winds. ===September=== ;September 1 :*8 a.m. EDT (1200 UTC) - Tropical Storm Ernesto weakens to a tropical depression. :*2 p.m. EDT (1800 UTC) - Tropical Depression Ernesto becomes extratropical with gale-force winds. ;September 2 :*11 p.m. EDT (0300 UTC September 3) - The HPC releases its final advisory on the extratropical remnants of Ernesto. ;September 3 :*2 p.m. AST (1800 UTC) - Tropical Depression Six forms 855 nautical miles (990 miles, 1585 km) west of the Cape Verde Islands. ;September 5 :*2 a.m. AST (0600 UTC) - Tropical Depression Six strengthens into Tropical Storm Florence. ;September 10 :*2 a.m. AST (0600 UTC) - Tropical Storm Florence strengthens into Hurricane Florence. :*2 p.m. EDT (1800 UTC) - Tropical Depression Seven forms 470 nautical miles (545 miles, 870 km) east- northeast of the Leeward Islands. ;September 11 :*8 a.m. EDT (1200 UTC) - Tropical Depression Seven strengthens into Tropical Storm Gordon. ;September 12 :*8 a.m. EDT (1200 UTC) - Tropical Depression Eight forms 200 nautical miles (230 miles, 370 km) south-southeast of the Cape Verde Islands. :*8 p.m. AST (0000 UTC September 13) - Hurricane Florence becomes extratropical. :*8 p.m. EDT (0000 UTC September 13) - Tropical Storm Gordon strengthens into Hurricane Gordon. ;September 13 :*2 p.m. EDT (1800 UTC) - Hurricane Gordon reaches Category 2 intensity. :*8 p.m. AST (0000 UTC September 14) - Hurricane Gordon reaches Category 3 intensity, becoming the first major hurricane of the season. :*8 p.m. AST (0000 UTC September 14) - Tropical Depression Eight strengthens into Tropical Storm Helene. ;September 16 :*8 a.m. AST (1200 UTC) - Tropical Storm Helene strengthens into Hurricane Helene. ;September 17 :*2 p.m. AST (1800 UTC) - Hurricane Helene reaches Category 2 intensity. :*8 p.m. AST (0000 UTC September 18) - Hurricane Helene reaches to Category 3 intensity, becoming the second major hurricane of the season. ;September 19 :*11 p.m. AST (0300 UTC September 20) - Hurricane Gordon passes near the Central Azores with the eye staying offshore. ;September 20 :*8 p.m. AST (0000 UTC September 21) - Hurricane Gordon becomes extratropical. ;September 24 :*2 p.m. AST (1800 UTC) - Hurricane Helene becomes extratropical. ;September 27 :*2 p.m. EDT (1800 UTC) - Tropical Depression Nine forms 810 nautical miles (940 miles, 1500 km) east-southeast of Bermuda. ;September 28 :*2 a.m. EDT (0600 UTC) - Tropical Depression Nine strengthens into Tropical Storm Isaac. ;September 30 :*8 a.m. AST (1200 UTC) - Tropical Storm Isaac strengthens into Hurricane Isaac. ===October=== ;October 2 :*8 a.m. AST (1200 UTC) - Hurricane Isaac weakens to a tropical storm. :*8 p.m. AST (0000 UTC October 3) - Tropical Storm Isaac becomes extratropical. ===November=== :*There was no tropical cyclone activity in the Atlantic basin in November. ; November 30 :*November 30 marked the official end of the 2006 Atlantic hurricane season. ==Related pages== * 2006 Atlantic hurricane season * List of Atlantic hurricane seasons ==References== ==Other websites== * The NHC's Tropical Cyclone Reports for the 2006 season",
 "title": "Timeline of the 2006 Atlantic hurricane season"
}