{
 "id": "85028",
 "text": "The origin of life on Earth is a scientific problem which is not yet solved. There are many ideas, but few clear facts.Schopf, J. William (ed) 2002. Life's origin: the beginnings of biological evolution. University of California Press. . A recent survey of the field. Most experts agree that all life today evolved by common descent from a single primitive lifeform. It is not known how this early life form evolved, but scientists think it was a natural process which happened about 3,900 million years ago. This is in accord with the philosophy of naturalism: only natural causes are admitted. It is not known if metabolism came first or genetics. The main hypothesis which supports genetics first is the RNA world hypothesis, and the one which supports metabolism first is the protein world hypothesis. Another big problem is how cells developed.Robinson R. 2005. Jump-starting a cellular world: investigating the origin of life, from soup to networks PLoS 3 (11) Melvin Calvin, winner of the Nobel Prize in Chemistry, wrote a book on the subject,Calvin, Melvin. 1969. Chemical evolution: molecular evolution towards the origin of living systems on the earth and elsewhere. Oxford University Press. and so did Alexander Oparin.Oparin, Alexander Ivanovich 2003. The Origin of Life. Courier Dover. What links most of the early work on the origin of life is the idea that before life began there must have been a process of chemical change.Oro, John 2002. Historical understanding of life's beginnngs. In Schopf J. (ed) Life's origin: the beginnings of biological evolution. University of California Press. Another question which has been discussed by J.D. Bernal and others is the origin of the cell membrane. By concentrating the chemicals in one place, the cell membrane performs a vital function.Bernal J.D. 1967. The origin of life. Cleveland: World Publishing. What we call life has only been verified in things that include RNA, mechanisms for encoding and decoding RNA, and mechanisms for building proteins from amino acids. == Fossil record == === Earliest claimed life on Earth === The earliest claimed lifeforms are fossilized microorganisms (or microfossils). They were found in iron and silica-rich rocks which were once hydrothermal vents in the Nuvvuagittuq greenstone belt of Quebec, Canada. These rocks are as old as 4.28 billion years. The tubular forms they contain are shown in a report.Ghosh, Pallab 2017. Earliest evidence of life on Earth 'found'. BBC News Science & Environment. If this is the oldest record of life on Earth, it suggests \"an almost instantaneous emergence of life\" after oceans formed 4.4 billion years ago. According to Stephen Blair Hedges, \"If life arose relatively quickly on Earth… then it could be common in the universe\". === Previous earliest === A scientific study from 2002 showed that geological formations of stromatolites 3.45 billion years old contain fossilized cyanobacteria.Knoll, Andrew H. 2004. Life on a young planet: the first three billion years of evolution on Earth. Princeton, N.J. At the time it was widely agreed that stromatolites were the oldest known lifeforms on Earth which had left a record of its existence. Therefore, if life originated on Earth, this happened sometime between 4.4 billion years ago, when water vapor first liquefied, and 3.5 billion years ago. This is the background to the latest discovery discussed above. The earliest evidence of life comes from the Isua supercrustal belt in Western Greenland, and from similar formations in the nearby Akilia Islands. This is because a high level of the lighter isotope of carbon is found there. Living things take up lighter isotopes because this takes less energy. Carbon entering into rock formations has a concentration of elemental δ13C of about −5.5. of 12C, biomass has a δ13C of between −20 and −30. These isotopic fingerprints are preserved in the rocks. With this evidence, Mojzis suggested that life existed on the planet already by 3.85 billion years ago. Against that view is the evidence that our Solar System is very unusual in several respects. For example, it is clear that most star systems have their largest planet close to their star. A few scientists think life might have been carried from planet to planet by the transport of spores. This idea, now known as panspermia, was first put forward by Arrhenius.Arrhenius, Svante 1908. Worlds in the making: the evolution of the universe. New York: Harper. == History of studies into the origin of life == === Spontaneous generation === Until the early 19th century many people believed in the regular spontaneous generation of life from non-living matter. This was called spontaneous generation, and was disproved by Louis Pasteur. He showed that without spores no bacteria or viruses grew on sterile material. === Darwin === In a letter to Joseph Dalton Hooker on 11 February 1871,First life on Earth windmillministries.org, Retrieved on 2008-01-18 Charles Darwin proposed a natural process for the origin of life. He suggested that the original spark of life may have begun in a \"warm little pond, with all sorts of ammonia and phosphoric salts, lights, heat, electricity, etc. A protein compound was then chemically formed ready to undergo still more complex changes\". He went on to explain that \"at the present day such matter would be instantly devoured or absorbed, which would not have been the case before living creatures were formed\".\"It is often said that all the conditions for the first production of a living organism are now present, which could ever have been present. But if (and oh! what a big if!) we could conceive in some warm little pond, with all sorts of ammonia and phosphoric salts, light, heat, electricity, &c.;, present, that a protein compound was chemically formed ready to undergo still more complex changes, at the present day such matter would be instantly devoured or absorbed, which would not have been the case before living creatures were formed\". Written in 1871, published in Darwin, Francis ed. 1887. The life and letters of Charles Darwin, including an autobiographical chapter. London: John Murray. Volume 3. 18 === Haldane and Oparin === No real progress was made until 1924 when Alexander Oparin reasoned that atmospheric oxygen prevented the synthesis of the organic molecules. Organic molecules are the necessary building blocks for the evolution of life. In his The Origin of Life,Oparin A.I. 1924. Proiskhozhozhdenie zhizny, Moscow (translated by Ann Synge, in Bernal 1967. The Origin of Life, Weidenfeld and Nicolson, London, pages 199-234.Oparin A.I. 1952. The Origin of Life. New York: Dover. Oparin argued that a \"primordial soup\" of organic molecules could be created in an oxygen-less atmosphere through the action of sunlight. These would combine in ever-more complex fashions until they formed droplets. These droplets would \"grow\" by fusion with other droplets, and \"reproduce\" through fission into daughter droplets, and so have a primitive metabolism in which those factors which promote \"cell integrity\" survive, those that do not become extinct. Many modern theories of the origin of life still take Oparin's ideas as a starting point. Around the same time J.B.S. Haldane also suggested that the Earth's pre-biotic oceans, which were very different from what oceans are now, would have formed a \"hot dilute soup\". In this soup, organic compounds, the building blocks of life, could have formed. This idea was called biopoiesis, the process of living matter evolving from self-replicating but nonliving molecules.Bryson, Bill 2003. A short history of nearly everything pp300–302; == Early conditions on Earth == There is almost no geological record from before 3.8 billion years ago. The environment that existed in the Hadean era was hostile to life, but how much so is not known. There was a time, between 3.8 and 4.1 billion years ago, which is known as the Late Heavy Bombardment. It is so named because many lunar craters are thought to have formed then. The situation on other planets, such as Earth, Venus, Mercury and Mars must have been similar. These impacts would likely sterilize the Earth (kill all life), if it existed at that time. Several people have suggested that the chemicals in the cell give clues as to what the early seas must have been like. In 1926, Macallum noted that the inorganic composition of the cell cytosol dramatically differs from that of modern sea water: \"the cell… has endowments transmitted from a past almost as remote as the origin of life on earth\".Macallum A.B. 1926. The paleochemistry of the body fluids and tissues. Physiol Rev. 6: 316–357. For example: \"All cells contain much more potassium, phosphate, and transition metals than modern ... oceans, lakes, or rivers\".Mulkidjanian A.Y. 2012. Origin of first cells at terrestrial, anoxic geothermal fields. Proc Natl Acad Sci U S A. 109 (14) E821–E830. \"Under the anoxic, CO2-dominated primordial atmosphere, the chemistry of inland basins at geothermal fields would [be like the chemistry inside] modern cells\". === Temperature === If life evolved in the deep ocean, near a hydrothermal vent, it could have originated as early as 4 to 4.2 billion years ago. If, on the other hand, life originated at the surface of the planet, a common opinion is it could only have done so between 3.5 and 4 billion years ago. Lazcano and Miller (1994) suggest that the pace of molecular evolution was dictated by the rate of recirculating water through mid-ocean submarine vents. Complete recirculation takes 10 million years, so any organic compounds produced by then would be altered or destroyed by temperatures exceeding 300 °C. They estimate that the development of a 100 kilobase genome of a DNA/protein primitive heterotroph into a 7000 gene filamentous cyanobacterium would have required only 7 million years. === History of Earth's atmosphere === Originally, the atmosphere of Earth had almost no free oxygen. It gradually changed to what it is today, over a very long time (see Great Oxygenation Event). The process began with cyanobacteria. They were the first organisms to make free oxygen by photosynthesis. Most organisms today need oxygen for their metabolism; only a few can use other sources for respiration.Holland, Heinrich D. 2006. The oxygenation of the atmosphere and oceans. Phil. Trans. Roy. Soc. B 361, 903–915. content/361/1470/903.full.pdf So it is expected that the first proto-organisms were chemoautotrophs, and did not use aerobic respiration. They were anaerobic. == Current models == There is no \"standard model\" on how life started. Most accepted models are built on molecular biology and cell biology: # Because there are the right conditions, some basic small molecules are created. These are called monomers of life. Amino acids are one type of these molecules. This was proved by the Miller–Urey experiment by Stanley L. Miller and Harold C. Urey in 1953, and we now know these basic building blocks are common throughout space. Early Earth would have had them all. # Phospholipids, which can form lipid bilayers, a main component of the cell membrane. # Nucleotides which might join up into random RNA molecules. This might have resulted in self-replicating ribozymes (RNA world hypothesis). # Competition for substrates would select mini-proteins into enzymes. The ribosome is critical to protein synthesis in present-day cells, but we have no idea as to how it evolved. # Early on, ribonucleic acids would have been catalysts, but later, nucleic acids are specialised for genomic use. The origin of the basic biomolecules, while not settled, is less controversial than the significance and order of steps 2 and 3. The basic chemicals from which life is thought to have formed are: * Methane (CH4), * Ammonia (NH3), * Water (H2O), * Hydrogen sulfide (H2S), * Carbon dioxide (CO2) or carbon monoxide (CO), and * Phosphate (PO43-). * Hydrogen cyanide (HCN) Molecular oxygen (O2) and ozone (O3) were either rare or absent. === Three stages === * Stage 1: The origin of biological monomers * Stage 2: The origin of biological polymers * Stage 3: The evolution from molecules to cells Bernal suggested that evolution may have started early, some time between Stage 1 and 2. == Origin of organic molecules == There are three sources of organic molecules on the early Earth: # organic synthesis by energy sources (such as ultraviolet light or electrical discharges). # delivery by extraterrestrial objects such as carbonaceous meteorites (chondrites); # organic synthesis driven by impact shocks. Estimates of these sources suggest that the heavy bombardment before 3.5 billion years ago made available quantities of organics comparable to those produced by other energy sources. === Miller's experiment and the primordial soup === In 1953 a graduate student, Stanley Miller, and his professor, Harold Urey, performed an experiment that showed how organic molecules could have formed on early Earth from inorganic precursors. The now- famous Miller–Urey experiment used a highly reduced mixture of gases – methane, ammonia and hydrogen – to form basic organic monomers, such as amino acids. We do know now that for more than the first half of the Earth's history its atmosphere had almost no oxygen. ==== Fox's experiments ==== In the 1950s and 1960s, Sidney W. Fox studied the spontaneous formation of peptide structures under conditions that might have existed early in Earth's history. He demonstrated that amino acids could by itself form small peptides. These amino acids and small peptides could be encouraged to form closed spherical membranes, called microspheres.Experiments on origin of organic molecules Nitro.biosci.arizona.edu, Retrieved on 2008-13-01] == Special conditions == Some scientists have suggested special conditions which could make cell synthesis easier. === Clay world === A clay model for the origin of life was suggested by A. Graham Cairns-Smith. Clay theory suggests complex organic molecules arose gradually on a pre-existing non-organic platform, namely, silicate crystals in solution.Cairns-Smith, A. G. 1982. Genetic takeover and the mineral origins of life. Cambridge, UK: Cambridge University Press. === Deep-hot biosphere model === In the 1970s, Thomas Gold proposed the theory that life first developed not on the surface of the Earth, but several kilometers below the surface. The discovery in the late 1990s of nanobes (filamental structures that are smaller than bacteria, but that may contain DNA in deep rocks) Nanobes – Intro microscopy-uk.org, Retrieved on 2008-01-14 might support Gold's theory. It is now reasonably well established that microbial life is plentiful at shallow depths in the Earth (up to five kilometers below the surface) in the form of extremophile archaea, rather than the better-known eubacteria (which live in more accessible conditions). Gold asserted that a trickle of food from a deep, unreachable, source is needed for survival because life arising in a puddle of organic material is likely to consume all of its food and become extinct. Gold's theory was that the flow of food is due to out-gassing of primordial methane from the Earth's mantle. === Self-organization and replication === Self-organization and self-replication are the hallmark of living systems. Non-living molecules sometimes show those features under proper conditions. For example, Martin and Russel showed that cell membranes separating contents from the environment and self-organization of self-contained redox reactions are the most conserved attributes of living things. They argue that inorganic matter like that would be life's most likely last common ancestor. == Theories == === RNA world hypothesis === In this hypothesis, RNA is said to work both as an enzyme and as a container of genes. Later, DNA took over its genetic role. The RNA world hypothesis proposes that life based on ribonucleic acid (RNA) pre-dates the current world of life based on deoxyribonucleic acid (DNA), RNA and proteins. RNA is able both to store genetic information, like DNA, and to catalyze chemical reactions, like an enzyme. It may have supported pre-cellular life and been a major step towards cellular life. There are some pieces of evidence which support this idea: #There are some RNAs which work as enzymes. #Some viruses use RNA for heredity. #Many of the most fundamental parts of the cell (those that evolve the slowest) require RNA #As reviewed by Fine and PearlmanFine JL, Pearlman RE. On the origin of life: an RNA-focused synthesis and narrative. RNA. 2023 Aug;29(8):1085-1098. doi: 10.1261/rna.079598.123. Epub 2023 May 4. PMID: 37142437; PMCID: PMC10351881 the RNA world hypothesis is supported by the many artificially generated ribozymes that include RNA molecules capable of aminoacylation, phosphorylation, alkylation, coenzyme attachment and nucleotide synthesis. Most importantly, ribozyme mediated RNA synthesis and replication has been demonstrated in a model Hadean era microenvironment.Salditt A, Karr L, Salibi E, Le Vay K, Braun D, Mutschler H. Ribozyme-mediated RNA synthesis and replication in a model Hadean microenvironment. Nat Commun. 2023 Mar 17;14(1):1495. doi: 10.1038/s41467-023-37206-4. PMID: 36932102; PMCID: PMC10023712 It has also been proposed that recombination between RNA molecules, similar to that known to occur with certain RNA viruses as a mechanism for coping with genome damage, was present in the RNA world as the initial form of sexual interaction.Bernstein H, Byerly HC, Hopf FA, Michod RE. Origin of sex. J Theor Biol. 1984 Oct 5;110(3):323-51. doi: 10.1016/s0022-5193(84)80178-2. PMID: 6209512 === Metabolism and proteins === This idea suggests that proteins worked as enzymes first, producing metabolism. After that DNA and RNA began to work as containers of genes. This idea also has some evidences which supports this. #Protein as enzyme is essential for today's lives. #Some amino acids are formed from more basic chemicals in the Miller-Urey experiment. But proteins cannot copy themselves. === Lipids === In this scheme membranes made of lipid bilayers occur early on. Once organic chemicals are enclosed, more complex biochemistry is then possible.Segré D. et al 2001. The lipid world. Origins of Life and Evolution of Biospheres 31 (1–2): 119–145. == Panspermia == This is the idea suggested by Arrhenius,Arrhenius S. 1903. Die Verbreitung des Lebens im Weltenraum (The distribution of life in space). Die Umschau.Arrhenius S. 1908. Worlds in the making: the evolution of the universe. New York, Harper & Row, 1908 and developed by Fred Hoyle,Hoyle, Fred and Wickramasinghe N.C. 1981. Evolution from space. New York: Simon & Schuster. that life developed elsewhere in the universe and arrived on Earth in the form of spores. This is not a theory of how life began, but a theory of how it might have spread. It may have spread, for example, by meteorites.Kelly, Morgan & Stolte, Daniel 2012. Odds that life crashed to Earth from space Some propose that early Mars was a better place to start life than was the early Earth. The molecules which combined to form genetic material are more complex than the \"primordial soup\" of organic (carbon-based) chemicals that existed on Earth four billion years ago. If RNA was the first genetic material, then minerals containing boron and molybdenum could assist in its formation. These minerals were much more common on Mars than on Earth.Redfern, Simon 2013. Earth life 'may have come from Mars'. BBC News Science & Environment. None of these ideas has much support. The overwhelming view is that Earth is ideally suited for life, and life evolved here.Schopf W. (ed) 2002. Life's origin: the beginning of biological evolution. U of California Press.Schopf W. (ed) 1999. Cradle of life. U of California Press. ==Related pages== * Astrobiology * Earliest known life forms * Common descent == References == Category:Biology Category:Earth sciences Category:Evolutionary biology Category:Molecular biology Category:Prokaryotes",
 "title": "Origin of life"
}