{
 "id": "850380",
 "text": "Sentō are Japanese public bathhouses. People take baths together there. Many Japanese people think of sentō as an important part of Japanese culture, with its manners and ideas about communities. Sentō are not the same as onsen. Onsen are baths built on natural hot springs. Onsen water has dissolved rock in it. Sentō water is either tap water or well water. Some sentō may add good- smelling plants or bath salts to the water. Sentō cost less than onsen to visit. Today, sentō are not as popular as they once were. This is because people have bathtubs and showers in their homes. They do not need to go to a sentō to clean. Many people still go to sentō, but they go to enjoy the water and relax. The Tokyo Sentō Association makes sure going to a sentō does not become expensive because they want people to be able to go to sentō. Local organizations decide the price. For example, in Tokyo, the Tokyo Sentō Association decides the price. In 2020, the price to go to a sentō in Tokyo was ¥480, or a little over US$4.10. ==Architecture== On the outside, some sentō look like temples. The entrance has a Japanese curtain called a noren. Noren at sentō are usually blue. Most sentō have concrete or steel chimneys for the boilers that heat the water. Sometimes, a person can find a neighborhood's sentō by looking for a building with this kind of special chimney. The dressing area is usually made in the traditional Japanese style, with wood and dark colors. The bathing area are usually made with tiles and is full of light. Japanese people think of this style as Western. Sentō have separate places for men and women, but young children can go to either side. Babies often go with the women. Fathers take boys and very young girls to the men's side. Sometimes there is a door between the men's and women's sides. Children are allowed to go through the door. Many sentō have a large mural, or wall painting, near the tubs. Many are landscapes or pictures of Mount Fuji. The water in the air is bad for the paint, so the murals wear out. Repainting a mural in the one day a week that a sentō is closed is hard to do, so some sentō use tiled mosaics or a window that looks out on a garden for decoration instead. Some sentō owners and their families live in rooms at the back of the building. ==History== People built the first sentō during the Nara period, in the 700s. The first people to use sentō were monks. They used the sentō for ritual purification. Later, more sentō were built for ordinary people to go and get clean. By 1700, most of the neighborhoods in Tokyo, then called Edo, had their own bathhouse. Many of the sentō of that time were steam baths, not soaking baths. They did not have windows, so the bathers could not see very well. Sometimes the water was dark and dirty. In 1868, the Meiji Restoration took away some of the class system of Japan. After that, many former nobles or samurai took baths with the regular people in sentō. Tsurusawa Monzaemon had the idea for modern sentō in 1878. Instead of a steam bath, he built a big tub that the bather could sit down in. He put windows in his sentō so there would be light to see by. This made it easier to see whether the water was clean. People liked these new sentō and soon built many more of them. In 1885, the government said no one could build the old, dark sentō any more. All new sentō had to be light so they could be kept clean. They also passed a law against men and women bathing together, but no one cared about it until after many foreigners began to visit Japan later in the Meiji period (late 1800s). In the 20th century, sentō became less popular. To keep customers, sentō owners put in bubblers, exercise equipment, saunas, electric shocks and other things bathers could not get at home. In 1972, there were about 21,200 sentō in Japan. This went down to 13,250 in 1985. There were 499 sentō in Tokyo as of 2021. ==Super sentō == People began building super sentō in the second half of the 20th century. Super sentō have more things to do than regular sentō. Some have water slides, swimming pools, or restaurants. Super sentō are meant to be fun instead of relaxing. ==Manners== Before entering, visitors take off their shoes and put them in shoe lockers. At sentō in Japan today, it is not good manners to clean one's body in the bathtub. Bathers must shower before getting in the water. This keeps dirt, sweat and other things from making the water dirty. Many sentō provide soap and towels. Bathers sit on a stool in the shower. The bathers must not wear any clothes or swimsuits in the sentō. Bathers may use towels at the sentō or bring their own, but the towel must not go in the water. Bathers put the towels on their heads instead. People with long hair tie it up so it does not get in the water. ==Pictures== File:清浄心院 (22387644773).jpg|Showers and stools at a sentō. File:Public Bath (40470987631).jpg|This sentō has an arched entrance like a temple has. File:Noren at a sento by udono in Morishita, Tokyo.jpg|A blue noren at the entrance of a sentō. File:Sento by Takanori Ishikawa in Kyoto.jpg|A sentō with a blue noren outside. File:Super Sento Japonijoje.jpg|A super sentō. ==Related pages== *Onsen *Sauna *Banya *Hammam *Jjimjilbang ==References== Category:Japanese culture Category:Hygiene",
 "title": "Sentō"
}