{
 "id": "850402",
 "text": "Kenneth Michael Benbow \"Kenny\" Blank (born September 15, 1977) is an American actor, filmmaker and composer. Later he changed his name to Kenn Michael. Blank is best known for his role as Michael Peterson in the television series The Parent 'Hood from 1995 to 1997 for which he also composed some music, as well as his appearance in Eddie Murphy's 1992 movie Boomerang. He also appeared in Space Jam. ==Early life and education== Blank was born as Kenneth Michael Benbow in New York City, New York on September 15, 1977, the son of Lola, a dancer for James Brown who later became Blank's manager, and Warren Benbow, a jazz drummer who has worked with Miles Davis and Stevie Wonder. His parents later divorced and Blank was raised by his mother and stepfather, Bob Blank, who owned a music studio. By the time he was 6 years old, Blank played the piano and made short films. He graduated from Stamford High School in 1995. In the late 1990s, Blank was a student at the University of Southern California, where he studied filmmaking. ==Other career== Since 1998, Blank has cinematographed, edited and directed a number of short films. ==Filmography== ===Film=== Year Title Role Notes 1991 The Super Tito 1992 Boomerang Kenny 1998 Dead Man on Campus Luke 2000 Boltneck Jordy 2001 Delivering Milo Mr. Ralph Evolution Student Silent Story Short film 2005 The Legend of Frosty the Snowman Walter Wader (voice) Direct-to-video 2006 All You've Got Composer 2017 Mutafukaz Angelino (voice) ===Television=== Year Title Role Notes 1993 Hangin' with Mr. Cooper Henry 1 episode Homicide: Life on the Street James Hill Alex Haley's Queen Henry at 11 Tall Hopes Ernest Harris 6 episodes 1995–1997 The Parent 'Hood Michael Peterson Seasons 1–3 1997 Living Single Damon Barker 1 episode 1999 Pepper Ann Malik, Lamar Abudabe (voices) 2 episodes 2000–2006 As Told by Ginger Darren Patterson (voice) 32 episodes 2003 All Grown Up! J.T. (voice) Episode: \"Tweenage Tycoons\" 2019 Cannon Busters Philly the Kid (voice) 12 episodes; English dub ===Video games=== Year Title Role 2004 Grand Theft Auto: San Andreas Pedestrian 2006 Saints Row Stilwater's Resident / Radio Voice Company of Heroes Voice 2007 Company of Heroes: Opposing Fronts Aldrich Power Rangers: Super Legends Navy Thunder Ranger 2008 Saints Row 2 Male Voice 2 2011 Saints Row: The Third Male Voice 2 2013 Saints Row IV The President of the United States, Male 2 2015 Saints Row: Gat out of Hell The President of the United States ==References== *Tomatoes: Kenny Blank Category:1977 births Category:Living people Category:Actors from New York City Category:Musicians from New York City",
 "title": "Kenny Blank"
}