{
 "id": "850556",
 "text": "Tutankhamun's trumpets are a pair of trumpets which were found in the burial chamber of the Eighteenth Dynasty Pharaoh Tutankhamun. One of the trumpets is made of sterling silver and the other is made of bronze or copper. Both trumpets are seen as the oldest working trumpets in he world. They are also the only trumpets known from ancient Egypt. When he excavated Tutankhamun's tomb, Howard Carter found the trumpets. The bronze trumpet was found in a large chest, that contained various military objects and walking sticks. The chest was in the antechamber of the tomb. The silver trumpet was found in the burial chamber. Both trumpets are engraved, they show images of gods Ra- Horakhty, Ptah and Amun. The silver trumpet's bell is engraved with many sepals and calices representing a lotus flower, and the praenomen and nomen of the king. The bronze trumpet may in fact be made of copper. The metal has not yet been analysed. Similar looking trumpets feature in Egyptian wall-paintings that are usually, though not always, associated with military scenes. After they had been silent for more than 3.000 years, the trumpets where used before an audience of about 150 million listeners through an international BBC broadcast aired on 16 April 1939. James Tappern of Prince Albert's Own 11th Royal Hussars regiment played the trumpets. The recording was recently featured, and can be heard on the BBC Radio 4 program Ghost Music. Rex Keating, who presented the 1939 broadcast, later claimed that during a rehearsal, the silver trumpet shattered, and Alfred Lucas, a member of Carter's team who had restored the finds, was so distressed he needed to go to hospital. Due to their fragility, it is unlikely the trumpets will be played again in any official musical reconstructions. == Dimensions, manufacture and performance == The silver trumpet has a length of , the bronze/copper trumpet is about shorter. Their tubes are around in diameter at the mouth end, increasing to about before flaring out to at the extremity. The mouth-ends are strengthened by rings and are large by modern standards – which would have made the trumpets hard to play; Tappern needed to add a modern mouthpiece (with packing to make it fit) before his performance. Jeremy Montagu examined the broze trumpet in the 1970s. It consists of two sections. The slightly conical body is from a rolled sheet of copper alloy between 0.2 and 0.25 mm thick. It has been soldered lengthways with a \"very skilfully brazed meander joint ... smoothed to a perfect finish\", yet is \"slightly rough\" internally, indicating that (as might be expected in a ceremonial instrument) appearance was of greater value than acoustic performance. The bell is of a different, thinner material: an electrum-like alloy of gold, between 0.1 and 0.13 mm thick. It is without a visible seam, probably \"burnished until the gold simply flowed together\". The 3.25 mm thick ring that forms the mouthpiece was probably also made of electrum. The ring is apparently not fixed to the body, Montagu suspected that although it was possible to generate three notes on the instrument, the highest note would not have been sounded; besides being an effort to produce, the trumpet's construction could not have tolerated it. The lowest note does not carry far, leading Montagu to hypothesize that only the middle note was used in a rhythmic signaling code. == Claims of magical powers == The bronze trumpet was among items stolen from the Egyptian Museum in Cairo during the Egyptian looting and riots of 2011, mysteriously returned to the museum some weeks later. According to Al-Ahram, after its return Hala Hassan, curator of the Tutankhamun collection at the Egyptian Museum, claimed that it had \"magical powers\" and that \"whenever someone blows into it a war occurs. A week before the revolution, during a documenting and photographing process, one of the museum's staff had blown into it and a week after revolution broke out. The same thing had happened before the 1967 war and prior to the 1991 gulf war, when a student was doing a comprehensive research on Tutankhamun's collection.\" File:Trompette d'argent et sa sourdine en bois du tombeau de Toutânkhamon.jpg|Silver and gold-plated trumpet and its wooden mute File:Trompette d'argent et sa sourdine en bois du tombeau de Toutânkhamon 2.jpg|Same objects == References == == Further reading == * * * * * Category:2nd millennium BC in Egypt Category:Brass instruments Category:2nd millennium BC works",
 "title": "Tutankhamun's trumpets"
}