{
 "id": "85084",
 "text": "A rip current is a strong surface flow of water returning outward from near the shore (not to be confused with an undertow). It is often mistakenly called a \"rip tide\" or \"riptide\", which is a flow of water out of an inland lagoon or channel during an ebb tide. Colloquially a rip current is known simply as a rip. Although rip currents would exist even without the tides, tides can make an existing rip much more dangerous (especially low tide). Typical flow is at 0.5 meters per second (1-2 feet per second), and can be as fast as 2.5 meters per second (8 feet per second). Rip currents can move to different locations on a beach break, up to tens of metres (a few hundred feet) a day. They can happen at any beach with breaking waves, including the world's oceans, seas, and large lakes such as the Great Lakes in Canada and the United States. ==Causes and occurrence== A rip current forms because wind and breaking waves push surface water towards the land. This causes a slight rise in the water level along the shore. This excess water will flow back to the open water via the easiest route. When there is an area which is a bit deeper, such as a break in an offshore sand bar or reef, this can let water flow offshore more quickly, forming a rip current. Water that has been pushed up near the beach flows along the shore towards the outgoing rip as \"longshore currents\". The extra water flows out at a right angle to the beach, in a tight current called the \"neck\" of the rip. The \"neck\" is where the flow is fastest. When the water in the rip current reaches outside of the lines of breaking waves, the flow spreads sideways, loses power, and dissipates in what is known as the \"head\" of the rip. Rip currents can form by the coasts of oceans, seas, and large lakes, whenever there are waves of high enough energy. Rip currents often occur on a gradually sloping shore, where breaking waves approach the shore parallel to it. The location of rip currents can be difficult to predict. Some tend to form always in the same places, but others can appear and disappear quickly at various locations along the beach. The appearance and disappearance of rip currents is dependent upon the shape of the bottom of the water body and the exact direction from which the waves are coming. == References == == Other websites == * Rip Current Safety (US National Weather Service) * United States Lifesaving Association, Rip Currents * Rip Currents - Everything a swimmer needs (pictures too) on just one page * Rip Current Awareness (New Jersey Marine Sciences Consortium) * Rip currents: Going with the flow (a study reveals that Rip Currents are much more complicated than was previously thought, New Scientist, 27 June 2007) Category:Bodies of water Category:Oceanography",
 "title": "Rip current"
}