{
 "id": "851142",
 "text": "Anna Dianova is a Ukrainian conceptual painter and multimedia artist. She works mostly in figurative fine art and digital art. == Biography == Anna Dianova was born on February 24, in Kyiv, Ukraine. She started painting when she was a child and continued her professional education in 2008-2011 at the Taras Shevchenko State Artistic school. In 2011-2015, she was a student of the National Academy of Fine Arts and Architecture. In 2016, she studied at Kyiv Academy of Media Arts. Currently, Anna travels between New York, Los Angeles, and Miami. She is interested in Digital Art technology. === Career === Anna Dianova worked as a model in Faces Model Agency and participated in Miss Kyiv Beauty Competition in 2014. Since 2015, Anna has taken the position of Art Director in Ideal Secrets company. She worked with the production of Alina Dianova as an actress and art director. Anna started her activity at the Women's Rights Organization in 2017. In 2017, Anna's work “The White Knight” became a part of the collection of Andrea Bocelli Foundation. == Style == Anna works as a metamodernist. Representing the era of metamodernism, reinterpreting history, and creating characters in new futurological mythology. == Projects == In 2011, she took part in the project “Candice Breitz: YOU + I”. In 2015, Anna appeared in the Ukrainian TV show as an expert of fine arts. In 2015-2016, her works were presented in the “True exhibition”. In 2016, Anna had her personal project “Illusion” in Kyiv. This transformer exhibition was presented at the Gemluc Art Expo in Monaco. In 2017, some works were presented in the Prince Albert Foundation Charity Gala in Monaco. In 2017, Dianova with the Ukrainian Parliament had an exhibition “Harmony of Equals which was dedicated to women's rights. Anna's painting \"The White Queen\" was selected by the commission of the \"Feeling of Freedom\" exhibition and became an honorary part of the organization's collection. In 2018, Anna won a competition for Blockchain Art in the Economic Forum 2018. == Other websites == *Official website *Facebook page *Instagram page == References == Category:Conceptual artists Category:Ukrainian painters Category:Ukrainian models Category:Living people Category:Year of birth missing (living people) Category:21st-century artists",
 "title": "Anna Dianova"
}