{
 "id": "851264",
 "text": "In philosophy, mathematics, and computer science, a tuple is an ordered list of elements. The term tuple originates from the sequence of names for such ordered lists, beginning with single, double, triple, and so forth. The specific name of a tuple depends on the number of elements it contains, typically indicated by a prefix derived from Latin or Greek numbering. A 1-tuple is commonly called a single, while a 2-tuple is referred to as a double. Beyond these, the names continue as follows: a 3-tuple is a triple, a 4-tuple is a quadruple, a 5-tuple is a quintuple, a 6-tuple is a sextuple, a 7-tuple is a septuple, and so on. The general form for naming these tuples involves adding the suffix \"-tuple\" to the appropriate numerical prefix. While the names of tuples are straightforward up to a certain number, they become less commonly used and more complex for higher numbers. For instance, an 8-tuple is an octuple, a 9-tuple is a nonuple, and a 10-tuple is a decuple. Beyond these, terms are rarely used in practice, and the notation \"-tuple\" is preferred, where is the number of elements. In computer science, tuples are used to group a fixed number of items, often implemented as product types in functional programming languages. Tuples are also utilized in relational databases to describe rows or records. In this context, each row in a table can be considered a tuple, with its elements corresponding to the fields of the row. Tuples are usually denoted by listing the elements within parentheses \"\", separated by commas; for example, represents a 3-tuple. In some contexts, other delimiters such as square brackets or angle brackets may be used. The specific names of tuples not only facilitate communication in mathematics and computer science but also help in understanding the structure and properties of these ordered collections. Understanding these names and their origins can provide insight into the nature of sequences and their applications across various fields. For further reading, see: * Tuple * Ordered pair * Relational database * Functional programming Here are some words for tuple names. > == Names for tuples of specific lengths v2.56 updated == Tuple length, n Name Alternative names 0 empty tuple null tuple / empty sequence / unit nothing zero 1 single tuple/solo 2 double duo 3 triple trio 4 quadruple quad / tetrad / quartet 5 quintuple pentuple 6 sextuple hextuple / hexad / half dozen 7 septuple or heptuple 8 octuple octa / octet / octad / octo 9 nonuple nuleip 10 decuple deka / cent 11 undecuple hendecuple / hendecad 12 duodecuple Dozen / dodeca 13 tredecuple Baker's dozen 14 quattuordecuple double septuple 15 quindecuple triple quintuple 16 sexdecuple quadruple quadruple 17 septendecuple 18 octodecuple double nonuple 19 novemdecuple 20 vigintuple quadruple quintuple 21 unvigintuple 22 duovigintuple 23 trevigintuple 24 quattuorvigintuple 25 quinvigintuple 26 sexvigintuple 27 septenvigintuple 28 octovigintuple 29 novemvigintuple 30 trigintuple 31 untrigintuple 34 quattuortrigintuple 40 quadragintuple 50 quinquagintuple 60 sexagintuple 70 septuagintuple 80 octogintuple 90 nonagintuple 100 centuple 200 ducentuple 300 trecentuple 400 quadringentuple 500 quingentuple 600 sescentuple 700 septingentuple 800 octingentuple 900 nongentuple 1000 milluple chiliad # This chart does show every tuple. Category:Numbers",
 "title": "Tuple names"
}