{
 "id": "85177",
 "text": "{{Infobox Planet | bgcolour=#FFFFC0 | name=253 Mathilde | image= (253) mathilde.jpg | caption=NASA image of 253 Mathilde | discoverer=Johann Palisa | discovered=November 12, 1885 | alt_names=A915 TN; | mp_category=Main belt | epoch=January 30, 2005 (JD 2453400.5) | orbit_ref=Unless otherwise noted, parameters are per: | aphelion=501.334 Gm 3.35121 AU | perihelion=290.564 Gm 1.94230 AU | semimajor=395.949 Gm 2.64676 AU | eccentricity=0.266157 | period=1572.787 d (4.31 yr) | mean_anomaly=111.960° | inclination=6.738° | asc_node=179.633° | arg_peri=157.475° | avg_speed=17.98 km/sFor semi-major axis a, orbital period T and eccentricity e, the average orbital speed is given by: :\\begin{align} v_o & = \\frac{2\\pi a}{T}\\left[1-\\frac{e^2}{4}-\\frac{3e^4}{64} - \\dots \\right] \\\\\\ & = 18.31\\ \\mbox{km/s} \\left[ 1 - 0.0177 - 0.00008 - \\cdots \\right] \\\\\\ & \\approx 17.98\\ \\mbox {km/s} \\\\\\ \\end{align}\\\\!\\, For the circumference of an ellipse, see: | dimensions=52.8 km (66×48×46 km) | mass=1.033(±0.044)×1017 kg | density=1.3 g/cm³ | surface_grav=0.0025With asteroid mass m, radius r and G equal to the gravitational constant, Newton's law of universal gravitation gives an average surface gravity g of: :\\begin{align} g & = G \\frac{m}{r^2} \\\\\\ & = 6.67 \\times 10^{-11} \\mbox{m}^3/\\mbox{kg s}^2 \\cdot \\frac{1.03 \\times 10^{17}\\ \\mbox{kg}}{(5.28 \\times 10^4\\ \\mbox{m})^2} \\\\\\ & = 0.0025\\ \\mbox{m/s}^2 \\\\\\ \\end{align} m/s² | escape_velocity=16.2For surface gravity g and radius r, the escape velocity is: :\\begin{align} v_e & = \\sqrt{2gr} \\\\\\ & = \\sqrt{2 \\cdot 0.0025\\ \\mbox{m/s}^2 \\cdot 52800\\ \\mbox{m}} \\\\\\ & = 16.2\\ \\mbox{m/s} \\\\\\ \\end{align} m/s | rotation=17.406±0.010 d (17 d 9 h 45 min) | spectral_type=Cb | abs_magnitude=10.20 | albedo=0.0436 | single_temperature=~174For asteroid albedo α, semimajor axis a, solar luminosity L_0, Stefan-Boltzmann constant σ and the asteroid's infrared emissivity ε (~0.9), the approximate mean temperature T is given by: :\\begin{align} T & = \\left ( \\frac{(1 - \\alpha) L_0}{\\epsilon \\sigma 16 \\pi a^2} \\right )^{\\frac{1}{4}} \\\\\\ & = \\left ( \\frac{(1 - 0.0436) (3.827 \\times 10^{26}\\ \\mbox{W})} {0.9 (5.670 \\times 10^{-8}\\ \\mbox{W/m}^2\\mbox{K}^4) 16 \\cdot 3.142 (3.959 \\times 10^{11}\\ \\mbox{m})^2} \\right )^{\\frac{1}{4}} \\\\\\ & = 173.7\\ \\mbox{K} \\end{align} See: K }} 253 Mathilde is a main belt asteroid found by Johann Palisa in 1885. It has a fairly elliptical orbit that takes more than four years to circle the Sun. This asteroid has an unusually slow rate of rotation, taking 17.4 days to complete a 360° revolution about its axis. It is a primitive C-type asteroid, which means the surface has lots of carbon; giving it a dark surface that reflects only 4% of the light that falls on it. This asteroid was visited by the NEAR Shoemaker spacecraft during June 1997, on its way to asteroid 433 Eros. The spacecraft took pictures of one side of the asteroid, finding many big craters that have gouged out depressions in the surface. It is currently the biggest asteroid to be visited by a spacecraft, and the first C-type asteroid to be so explored. == Description == 253 Mathilde is very dark. The asteroid has a number of very big craters, with the individual craters being named for coal fields and basins around the world. The two biggest craters, Ishikari (29.3 km) and Karoo (33.4 km), are as wide as the asteroid's average radius. The impacts appear to have blown big volumes off the asteroid, as suggested by the angular edges of the craters. The density measured by NEAR Shoemaker, 1,300 kg/m³, is less than half that of a normal carbonaceous chondrite; this may indicate that the asteroid is very loosely packed rubble pile (an asteroid that has been broken apart by a collision and pulled back together by gravity). The same is true of several C-type asteroids studied by ground-based telescopes with adaptive optics systems (45 Eugenia, 90 Antiope, 87 Sylvia and 121 Hermione). Up to 50% of the volume inside of 253 Mathilde has open space. However, the existence of a 20-km-long scarp may indicate that the asteroid does have some structural strength, so it could contain some big internal components. The low interior density is an inefficient transmitter of impact shock through the asteroid, which also helps to preserve the surface features to a high degree. Mathilde's orbit is eccentric, taking it to the farther reaches of the Main belt. Nonetheless, the orbit lies between the orbits of Mars and Jupiter; it does not cross the planetary orbits. It also has one of the slowest rotation periods of the known asteroids — most asteroids have a rotation period in the range of 2 – 24 hours. Because of the slow rotation rate, NEAR Shoemaker was only able to take pictures of 60% of the asteroid's surface. The slow rate of rotation may been accounted for by a moon orbiting the asteroid, but a search of the NEAR images revealed none bigger than 10 km in diameter out to 20 times the radius of 253 Mathilde. == References == == Other websites == * * * Category:Asteroids",
 "title": "253 Mathilde"
}