{
 "id": "851704",
 "text": "The Shri Katas Raj Temples (Punjabi, شری) (Sanskrit: कटासराज) also known as Qila Katas (). The temples' pond is said in the Puranas to have been created from the teardrops of Shiva, after he wandered the Earth inconsolable after the death of his wife Sati. The pond occupies an area of two kanals and 15 marlas, with a maximum depth of 20 feet. The temples were visited by India's former deputy prime minister Lal Krishna Advani in 2005. In 2006, the Pakistani government began restoration works at the temples, with further improvements announced in 2017. == Place name == The name of the temple complex is believed to derive from the Sanskrit word kataksha, meaning \"tearful eyes.\" The pond was originally referred to as Viskund, or \"poison spring\", but was later referred to as Amarkund, Chamaskund, and finally Katakshkund, meaning \"Spring of tearful eyes.\" The pond in Urdu and Persian is referred to as Chashm-e-Alam, meaning \"Sorrowful/Tearful Eyes.\" while some of his tears collected in two ponds, one of which is the pond around which the Katas Raj Temples are set, while the other is at Pushkar, near the famous Sufi pilgrimage centre of Ajmer Sharif. The sacred pond in the complex is believed by Hindus to be filled with Shiva's tears after the death of his wife Sati. The water in the pond is of high clarity. == Historical significance == The temples play a role in the Hindu epic poem, the Mahābhārata, where the temples are traditionally believed to have been the site where the Pandava brothers spent a significant portion of their exile. It is also traditionally believed by Hindus to be the site where the brothers engaged in a riddle contest with the Yakshas, as described in the Yaksha Prashna. Another tradition states that the Hindu deity Krishna laid the foundation of the temple, and established a hand-made shivling in it. The temples are considered to be the second most sacred site in the historic pre-1966 East Punjab region, after the temple at Jwalamukhi in modern Himachal Pradesh (Northern India). Therefore they can be considered as the \"National Hindu Temple of Pakistan\", a potential for all Indian Yatris or Shaivite worshipers respectively. ==Architecture== The Katas site houses the Satgraha, a group of seven ancient temples, remains of a Buddhist stupa, five other medieval temples, havelis scattered around a pond considered holy by Hindus. The temples at Katas are mostly constructed on square platforms. The elevation of the sub shrines seems to form a series of cornices with small rows of pillars, crowned by a ribbed dome. The seven temples were built in an architectural style similar to Kashmiri temples, with dentils, fluted pillars, trefoil arches, and rooflines that are pointed. The Shiva temple is also built on a square platform. Its entrance is a recessed round arch with faint cusps and a rectangular opening to the north. === Recent history === In January 2017, Pakistan's government began installation of shikharas on the temples. In February 2017, 200 pilgrims from India traveled to the temple to participate in the Katas Raj Dham festival. In 2018, Pakistan issued visas to 139 Indian Hindu pilgrims to visit Katas Raj dham. Murtis (idols) of Hindu gods were placed in the seven temples, at a cost of Rs. 51.06 million. A three-member archaeological team visited India, Sri Lanka and Nepal to collect murtis of various Hindu gods. ==References== Category:World Heritage Sites in Pakistan Category:History of Pakistan",
 "title": "Katas Raj Temples"
}