{
 "id": "851840",
 "text": "Happy Madison Productions is a Los Angeles-based entertainment company. It deals with production of movies and television programs. It was founded by actor and comedian Adam Sandler on December 10, 1999. Sandler is also the CEO and co-owner of Happy Madison, with Jack Giarraputo. The company was named after Happy Gilmore and Billy Madison, two movies starring Sandler. The man on the logo of the company is Sandler's father, Stanley, who says the word \"Terrific\".ScreenRant: Happy Madison: 10 Things You Never Knew About Adam Sandler's Production Company. The company used to be headquartered in the Judy Garland Building on the Sony Pictures Studios lot in Culver City, California. Happy Madison's parent company is Happy Madison Inc. The parent company is headed by Scott, the brother of Adam Sandler, and is based in Manchester, New Hampshire.New Hampshire Secretary of State Corporate Information for Happy Madison, Inc.. == List of Happy Madison's productions == === Films === * 1999: Deuce Bigalow: Male Gigolo * 2000: Little Nicky * 2001: Joe Dirt * 2001: The Animal * 2002: Mr. Deeds * 2002: The Master of Disguise * 2002: Eight Crazy Nights * 2002: The Hot Chick * 2003: Anger Management * 2003: Dickie Roberts: Former Child Star * 2004: 50 First Dates * 2005: The Longest Yard * 2005: Deuce Bigalow: European Gigolo * 2006: Grandma's Boy * 2006: The Benchwarmers * 2006: Click * 2007: Reign Over Me (as Madison 23 Productions) * 2007: I Now Pronounce You Chuck and Larry * 2008: Strange Wilderness * 2008: You Don't Mess with the Zohan * 2008: The House Bunny * 2008: Bedtime Stories * 2009: Paul Blart: Mall Cop * 2009: Funny People (as Madison 23 Productions) * 2009: The Shortcut (as Scary Madison Productions) * 2010: Grown Ups * 2011: Just Go with It * 2011: Zookeeper * 2011: Bucky Larson: Born to Be a Star * 2011: Jack and Jill * 2012: That's My Boy * 2012: Here Comes the Boom * 2013: Grown Ups 2ComingSoon.net: Grown Ups Sequel Planned . * 2014: BlendedDeadline Hollywood: Adam Sandler Swaps Paramount Western For Blended Family Fare At Warner Bros.ComingSoon.net: Adam Sandler and Drew Barrymore Comedy Blended Set For May 23, 2014 . * 2015: Paul Blart: Mall Cop 2ComingSoon.net: Paul Blart: Mall Cop 2 Set for April 17, 2015 . * 2015: Joe Dirt 2: Beautiful LoserComingSoon.net: David Spade is Back for Joe Dirt 2!. * 2015: PixelsEntertainment Weekly: Look out, Adam Sandler! It's Donkey Kong's Space Invading Frogger! .ComingSoon.net: Michelle Monaghan Joins the Cast of Pixels . * 2015: The Ridiculous 6 * 2016: The Do-Over * 2017: Sandy Wexler * 2018: The Week Of * 2018: Father of the YearDeadline Hollywood: David Spade, Bridgit Mendler, Nat Faxon, & More Co-Star In 'Who Do You Think Would Win?' For Netflix. * 2018: 100% Fresh * 2019: Murder Mystery * 2020: The Wrong MissyThe Hollywood Reporter: New David Spade-Starring, Adam Sandler-Produced Netflix Movie Finds Director. * 2020: Hubie Halloween * 2022: HustleScreenRant: Adam Sandler's Next Netflix Movie Can Break Happy Madison's Losing Streak. === TV series === * 2007–2013: Rules of Engagement (co-production with Game Six Productions, CBS Television Studios and Sony Pictures Television) * 2008: The Gong Show with Dave Attell * 2010–2011: Nick Swardson's Pretend Time (co- production with Culver Entertainment) * 2011–2012: Breaking In (co-production with Adam F. Goldberg Productions and Sony Pictures Television) * 2013–present: The Goldbergs (co-production with Adam F. Goldberg Productions, Doug Robinson Productions (season 5–present) and Sony Pictures Television) * 2017: Imaginary Mary (co-production with Adam F. Goldberg Productions, ABC Studios and Sony Pictures Television)Deadline Hollywood: Drama 'Notorious', Comedy 'Imaginary Mary' Picked Up To Series At ABC. * 2019–2020: Schooled (co- production with Adam F. Goldberg Productions, Marc Firek Productions, Doug Robinson Productions, ABC Studios and Sony Pictures Television) == Critical reception == Most of the studio's movies received negative reactions from critics.Salon: The tragedy of Adam Sandler.Fox News: Comedy about middle school statutory rape? Does Adam Sandler's That's My Boy go too far?Live.drjays.com: Is Adam Sandler Serious With That's My Boy?. archived versionNCFM: Adam Sandler's new movie That's My Boy exploits child victims of sexual assault. Please boycott the movie Four of them are considered some of the worst movies of all time. Two of those were rated 0% on Rotten Tomatoes.Rotten Tomatoes: The Ridiculous 6 (2015).Rotten Tomatoes: Father of the Year (2018). == References == == Other websites == * Official website of Happy Madison on Adam Sandler's page * Happy Madison Productions at IMDb Category:American movie studios",
 "title": "Happy Madison Productions"
}