{
 "id": "851907",
 "text": "Seth Abramson (born October 31, 1976) is an American professor, political columnist and author, and. He is the editor of the Best American Experimental Writing series. He has written a bestselling trilogy of nonfiction works detailing the foreign policy agenda and political scandals of former president Donald Trump.After the 2016 U.S. presidential election, Abramson received widespread attention for his Twitter threads alleging collusion between the Trump campaign and foreign governments, especially Russia,Saudi Arabia, the UAE, and Israel. == Early career == Abramson graduated from Dartmouth College (1998), Harvard Law School (2001) and University of Wisconsin-Madison (2010; 2016).He was trial attorney for the New Hampshire Public Defender for 6 years from 2001 to 2007. Abramson has written for The Washington Post, Dallas Morning News, The Seattle Times, Newsweek, Indiewire, and The Guardian. and Publishers Weekly.During the Trump administration, Abramson was a CNN legal analyst and appeared regularly on the BBC. == Rise to Fame == After the 2016 US Presidential election, Abramson received attention for his Twitter threads alleging collusion between the Trump campaign and foreign governments, especially Russia. In November 2018, Abramson published the New York Times bestselling book \"Proof of Collusion \" (Simon & Schuster), which sought to establish \"proof of collusion in the Trump-Russia case. A sequel to Proof of Collusion, Proof of Conspiracy, was published in September 2019, and was also a New York Times bestseller. The final book in the Proof trilogy, Proof of Corruption, was published by St. Martin's Press in September 2020 and was named a USA Today bestseller. == Related pages == *List of poets from the United States == References == Category:1976 births Category:Living people Category:American political writers Category:American bloggers Category:American poets Category:Harvard University alumni Category:Lawyers from New Hampshire",
 "title": "Seth Abramson"
}