{
 "id": "851949",
 "text": "\"Treehouse of Horror V\" is the 6th episode of The Simpsons sixth season. It is the 5th episode of the Treehouse of Horror series. It was first broadcast on the Fox network on October 30, 1994. The episode has three parts: \"The Shinning\", \"Time and Punishment\", and \"Nightmare Cafeteria\". == Story == === The Shinning === Mr. Burns hires the Simpson family to look after one of his buildings. Burns takes away television and beer because he thinks they will work harder this way. Groundskeeper Willie learns that Bart can hear his thoughts. He tells Bart to let him know if Homer starts to act strange. Homer starts to act crazy because he does not have television and beer. Moe Szyslak (as a ghost) says to Homer that he will give him a beer if Homer kills his family. Marge gets a baseball bat to protect herself from Homer. Homer gets scared when he sees himself in a mirror and faints. Marge puts Homer in a pantry to make him calm down. Homer starts to think normally again, but then gets taken by Moe and other ghosts. Homer later makes the family run away by chasing them with an axe. Willie tries to stop him but gets killed with Homer's axe. Homer is about to kill his family, but Lisa tells him she found a television screen in the snow. Homer starts acting normal again and the family freezes after watching television in the snow. === Time and Punishment === Homer accidentally puts his hand in a toaster twice. He tries to fix the toaster, but he makes it become a time machine. The toaster takes Homer to an era with dinosaurs. He remembers when Grampa told him not to change anything in the past. Homer kills a mosquito and the present becomes a dystopia where Ned Flanders is the ruler of the world. Homer goes back to the past to try to stop himself. He accidentally kills a fish from the past and makes Bart and Lisa very big in the present. Back in the past, Homer sneezes and makes all of the dinosaurs die from the common cold. The Simpson family becomes wealthy in the present, but he leaves when he learns no one knows what donuts are. In another present, Groundskeeper Willie tries to help Homer go back to the real world. Willie then gets killed with an axe by Maggie. Homer goes from the past to the present many times. He then finds a present world where almost everything is normal again. He sees the family eating using long and stretching tongues, but thinks it is normal enough. === Nightmare Cafeteria === Principal Skinner thinks that his school's detention room has too many children in it. The school's lunchlady must give out poor quality meat for lunch. Skinner thinks that eating the children will help with both problems. Students Jimbo Jones and Üter Zörker are killed and made into food. Bart and Lisa learn what Skinner and the lunchlady are doing. They learn from seeing children in detetion put in a cage and killed. Bart, Lisa, and Milhouse later become the only children in the school to still be alive. Skinner and the lunchlady make Bart, Lisa, and Milhouse trapped above a blender. Groundskeeper Willie tries to help them but Skinner hits him with an axe. Bart, Lisa, and Milhouse fall and get killed by the blender. It is then shown that Bart was just dreaming the story. Marge tells him not to worry about it. Fog starts to get inside their house and makes the family's skin become muscles. They then start singing a parody of a song from A Chorus Line. While they sing, Santa's Little Helper starts to eat Bart. == Production == David Mirkin made the episode have more violence and blood than the Treehouse of Horror episode before it. He said he was not happy with the Congress wanting there to be less violence in the episodes. He later called the episode the most \"disturbing Halloween show ever\". The episode starts with Marge saying that the episode is too scary to be shown. This was put in the episode because of how scary people thought the episodes were. Mirkin thinks Halloween episodes can be \"scary as well as fun\". == References == == Other websites == *\"Treehouse of Horror V\" at The Simpsons.com * * Category:The Simpsons (season 6) episodes Category:Treehouse of Horror Category:1994 television episodes Category:Television episodes written by David X. Cohen",
 "title": "Treehouse of Horror V"
}