{
 "id": "852271",
 "text": "General William Howe, William Howe, 5th Viscount Howe (1729-1814) was a British fighter. He fought in the Seven Years' War, American Revolutionary War and British action in the French Revolution. ==Early life== Howe was born in Nottinghamshire in 1729. His parents were Emmanuel and Charlotte Howe. He had three brothers, George, Richard and Thomas Howe's mother Charlotte was related to the royal family. Her mother was Sophia von Kielmannsegg, King George I's half-sister. Emmaneul Howe died when William Howe was five years old. He died while he was governor of Barbados. His mother Charlotte was Lady of the Bedchamber to King George III's mother, Princess Augusta. Her own mother was King George I's half-sister, from his father and another woman. George Howe went into the army and became a general. Richard Howe went into the navy and became Fleet Admiral. Thomas Howe worked for the East India Company. William Howe went to Eton as a boy. When he was seventeen, he joined the army. ==Military career== William Howe bought a commission, meaning he paid to get a job, as an officer. He started in the army as a dragoon officer. He fought in the War of Austrian Succession, in Flanders. ===Seven Years' War=== Howe came to North America during the Seven Years' War (French and Indian War). He helped the British take French Canada. He fought battles at Montreal and Belle Ile and Havana. By the end of the war, he was a lieutenant colonel and adjunct general. ===Between the wars=== After the Seven Years' War, in 1758, Howe was a member of the British Pariliament. He voted for the British government to not treat the American colonies badly. He also wrote training books for the army. ===American Revolutionary War=== Howe went back into the army when King George III told him to. In 1775, Howe won the Battle of Bunker Hill for the British. He led the men himself. Then he was named Commander in Chief of the British Army in America. In 1776, he won the Battle of Long Island and made George Washington and the Continental Army run away from New York City. Then Howe decided to capture Philadelphia. At the time, Philadelphia was the capital. Howe won the Battle of Brandywine, the Battle of the Clouds, and the Battle of Paoli. The British army then controlled Philadelphia. Then Howe won the Battle of Germantown to stop the Continental Army from taking it back. However, because Howe was taking Philadelphia, he could not go north to help General Burgoyne take control of the Hudson Valley. The Continental Army, led by Benedict Arnold and Horatio Gates, beat Burgoyne at the Battle of Saratoga. In 1778, Howe resigned from the British Army in America. He sailed back to England. ===Later career=== Howe fought for the British again in Spain and in the French Revolution. He stopped fighting in 1803 and died in 1814. ==Family== Howe married Francis Connelly. They did not have children. == References == Category:British Army people Category:1729 births Category:1814 deaths",
 "title": "William Howe"
}