{
 "id": "8522",
 "text": "Arabic (اَلْعَرَبِيَّةُ, al-ʿarabiyyah) is a Semitic language that first appeared in the mid-ninth century BCE in Northern Arabia and Sahara southern Levant. It is related to other Semitic languages like Hebrew and Aramaic. Unlike the latter two, where the former derives from the other, however, Arabic is itself a root language, like Latin. Unlike Latin, it is still widely used and spoken today. Around 292 million people speak it as their first language. Many more people can also understand it as a second language in the Maghreb. The Arabic language is written from right to left in a consonant alphabet, which is also called an abjad. Since it is so widely spoken throughout the world, the language is one of the six official languages of the United Nations. The other official languages of the UN are: English, French, Spanish, Russian and Chinese. Many countries speak Arabic as an official language, but not all of them speak it the same way. The language has many dialects, or varieties, such as Modern Standard Arabic, Egyptian Arabic, Gulf Arabic, Maghrebi Arabic , Levantine Arabic and many others. Some of the dialects are spoken so differently from one another that some speakers have a hard time understanding the other. Many dialectic words however are nonetheless still rooted in the original, or classical language. Most of the countries that use Arabic as their official language are in the Middle East. They are part of the Arab world, the largest religion in the region is Islam. The Arabic language is considered to be the language of Islam as the Quran was revealed in the Arabic language and it was also the native language of and spoken by Muhammad, the religion's prophet. Arabic is very important in Islam because Muslims believe that Allah (God) used it to talk to Muhammad through the Archangel Gabriel (Jibril), giving him the Quran in the language. Many but not all Arabic-speakers are Muslims. The miracle of the Quran is believed to be in its language. Arabic is also becoming a popular language to learn in the Western world even though its grammar is sometimes very hard to learn for native speakers of Indo-European languages. Many other languages have borrowed words from Arabic because of its importance in history. Some English words that can be traced to Arabic are sugar, cotton, magazine, algebra, alcohol and emir. Arabic is an official language of these countries: * Algeria * Bahrain * Comoros * Chad * Djibouti * Egypt * Eritrea * Iraq * Israel * Jordan * Kuwait * Lebanon * Libya * Mauritania * Morocco * Oman * Pakistan * Palestine * Qatar * Saudi Arabia * Somaliland * Sudan * Syria * Tunisia * United Arab Emirates * Yemen It is also a national language of: * Mali * Somalia * Senegal == Abjad == The Arabic alphabet is a consonant alphabet with 28 letters, as listed below: * ا (ʾalif, sometimes pronounced like ‘aa’) * ب (bāʾ/bīth, pronounced like ‘b’ or ‘p’) * ت (tāʾ/tāw, pronounced like ‘t’) * ث (thāʾ/thāw, pronounced like ‘th’ in ‘bath’) * ج (gīm/gīmil, pronounced like ‘j’ or ‘ch’ in ‘cheap’) * ح (ḥāʾ/ḥīth, pronounced like a heavy ‘h’) * خ (khāʾ/khīth, pronounced like ‘ch’ in ‘loch’) * د (dāl/dālith, pronounced like ‘d’) * ذ (dhāl/dhālith, pronounced like the ‘th’ in ‘the’) * ر (rāʾ/rīsh’, pronounced like ‘r’ or ‘rr’ in Spanish) * ز (zayn/zāy/zāʾ, pronounced like ‘z’ or ‘zh’) * س (sīn/sāmikh, pronounced like ‘s’) * ش (shīn, pronounced like ‘sh’) * ص (ṣād/ṣādhī, pronounced like a heavy ‘s’) * ض (ḍād/ḍādhī, pronounced like a heavy ‘d’) * ط (ṭāʾ/ṭīth, pronounced like a heavy ‘t’) * ظ (ḍhāʾ/ḍhīth, pronounced like a heavy ‘th’) * ع (ʿayn, sometimes pronounced like ‘euu’) * غ (ghayn, pronounced like gargling water) * ف (fāʾ/fī, pronounced like ‘f’ or ‘v’) * ق (qāf/qūf, like the sound made in comical cartoons when the characters gulp down a drink) * ك (kāf, pronounced like ‘k’ or ‘g’) * ل (lāmidh/lām, pronounced like ‘l’ or ‘ly’) * م (mīm, pronounced like ‘m’) * ن (nūn, pronounced like ‘n’ or ‘ny’) * ه (hāʾ/hī, pronounced like ‘h’) * و (wāw, pronounced like ‘w’ or ‘oo’) * ي (yāʾ/yūdh, pronounced like ‘y’ or ‘ee’) ==Notes== == References ==",
 "title": "Arabic language"
}