{
 "id": "85265",
 "text": "Canterbury Cathedral is one of the oldest and most famous churches in England.Its full title is the Cathedral and Metropolitical Church of Christ at Canterbury. The cathedral is in Canterbury, Kent. It is a UNESCO World Heritage Site.UNESCO, \"Canterbury Cathedral, St Augustine's Abbey, and St Martin's Church\". Retrieved 2012-4-20. It is also one of the greatest examples of mediaeval Norman architecture in Britain. The cathedral is the 'seat' of the archbishop of Canterbury. The archbishop is the most important bishop in the Church of England.The monarch (the Queen) is the formal head of the church. == History == The church was founded by Augustine of Canterbury in 597 AD. The present version was built on the remains of the old Saxon church by Lanfranc, starting in 1066. Lanfranc, the first Norman Archbishop, was put in position by William the Conqueror. His cathedral was dedicated in 1077. The architecture of the present cathedral is basically Romanesque, with many later repairs and additions. The nave (where the congregation sits) was rebuilt in the 14th century with newly discovered building methods. The new style of English Gothic architecture ('perpendicular') gave the building greater height and larger windows. Some of the stained glass in the cathedral is from the 12th century. It was probably made between 1130 and 1160. There was a great fire in 1174 and the people built most of the cathedral again. The fire did not destroy some of the old windows from the 12th century. The cathedral area, called the precinct, has walls all around it. Canterbury also has defensive wall. Much of this wall is still standing. The cathedral precinct includes many other buildings: a school, a conference building, a number of houses and a palace. The Deanery is where the dean of Canterbury lives: he is the manager of the cathedral. The dean and chapter (a committee) take the decisions. The archbishop's job is to run the whole Anglican Church. The cathedral costs £12,000 a day to run and repair,Cathedral leaflet \"Welcome... pilgrims and visitors\". and there are no government grants. Because of this, fund-raising is one of the Dean's main jobs. The cathedral is a working church. On Sundays there are six services (of different kinds). On weekdays there are three services. These are free of any entry charge. Tourists visiting pay a fee to see the cathedral when there is no service. It was where Thomas Becket was murdered by knights of Henry II, after the king asked, supposedly,There are other versions \"Who will rid me of this turbulent priest?\" Beckett was the second archbishop of Canterbury to be murdered. The first was Alphege in 1012. The third was Thomas Cranmer, in 1533. in 1988, UNESCO and the World Heritage Committee named Canterbury Cathedral, the ruins of St Augustine's Abbey, and St Martin's Church together as a World Heritage Site. As a group, they are buildings which show the development of Christianity in Britain. === Events of note === *1498 The great bell tower, called 'Bell Harry Tower', completed the cathedral more or less as it is today. *1538 Becket's shrine destroyed by Henry VIII *1540 Monastery dissolved by Royal Command. *1660/1704 Repair after Puritan damage. *1790/1830s The original northwest tower was replaced during the 1830s. This was the last major structural alteration to the cathedral. == Literary references == *The Canterbury Tales was written by Geoffrey Chaucer in the 14th century. The book is about a group of travellers who are going from London to Canterbury. As they travel along, each person tells a tale (a story). == Related pages == * List of World Heritage Sites of the United Kingdom * Canterbury Cathedral, St Augustine's Abbey, and St Martin's Church == References == ==Other websites== * Cathedral website * Canterbury Cathedral at SacredDestinations.com Category:Anglican cathedrals in England Category:Canterbury Category:World Heritage Sites in the United Kingdom Category:Buildings and structures in Kent Category:11th-century buildings and structures",
 "title": "Canterbury Cathedral"
}