{
 "id": "852683",
 "text": "Margaret \"Peggy\" Shippen Arnold was an American woman from Philadelphia. She helped Benedict Arnold go to the British army during the American Revolutionary War. ==Early life and family== Peggy was born in 1760 to Edward Shippen IV and his wife, Margaret Francis. The Shippens were a powerful family in Philadelphia. ==American Revolutionary War== During the American Revolutionary War, Shippen's parents tried to stay neutral. Her older sister Elizabeth married a colonel in the Continental Army. When the British Army occupied Philadelphia, Peggy Shippen made friends with Major John André. They wrote letters back and forth to each other after André left Philadelphia. In 1779, when she was nineteen years old, Peggy Shippen married Benedict Arnold, a general in the Continental Army. Later, Arnold decided to defect, or change sides, and fight for the British instead. Historians do not know whether Peggy Shippen tried to get him to make this decision, but she helped him after he did. Shippen helped him meet with John André and then sent letters between the two men using codes. Shippen helped Arnold become the commander of West Point so he could trade it to the British Army. When Arnold was caught, Peggy helped him escape and destroyed evidence. When George Washington and Alexander Hamilton showed up at West Point, she pretended that she had not known about Arnold's plan. She pretended to be surprised and upset. She pretended so well that both Washington and Hamilton believed her. Peggy was not put in jail, but the city council of Philadelphia told Shippen she could not live there any more. She went to New York City, which the British Army held at the time. ==After the war== After the British Army surrendered at the Battle of Yorktown, Benedict Arnold and Peggy moved to London. The king and queen liked Peggy. King George III gave her £350 for helping the army and Queen Charlotte gave her a yearly payment of £100. Peggy Shippen went back to Philadelphia for a visit in 1791. People there did not like her, and some even protested. When Benedict Arnold died in 1803, Shippen found she owed money to many people. Peggy Shippen died in 1804. ==In popular culture== Shippen is a character in the television series Turn. In the series, she has a romance with John André. ==References== Category:1760 births Category:1804 deaths Category:Socialites Category:People from Philadelphia",
 "title": "Peggy Shippen"
}