{
 "id": "852711",
 "text": "International Exhibition of Nothing (Esposizione internazionale del Niente) was a modern art and conceptual movement which originated in Italy in the early 20th century. It was largely an Italian phenomenon, based on nothing, on emptiness, on the invisible, the pieces are an \"empty space\". The Publishing manifestos of International Exhibition of Nothing has been a feature of the invisible art movement led by Piero Manzoni. International Exhibition of Nothing is an exhibition invented in 1960 by a group of artists including Piero Manzoni,Fondazione Manzoni \"1960. Mostre in Italia e nel mondo\", Milano, 2015 Enrico Castellani, Carl Laszlo, Heinz Mack, in which an exhibition of invisible works was represented, the exhibition will then be exhibited again a year later in the Netherlands. In 2015,The Open Box, \"Esposizione Internazioanle del Niente\", Milano, 2015 the exhibition is once again held in Milan in collaboration with the Manzoni Foundation, also exhibited the original \"Manifesto\" of the time, which was published in Basel in 1960.Askanews, \"Milano, Esposizione internazionale del Niente: arte come nel 1960A The Open Box una \"prima\" del progetto di Manzoni e Castellani\", Milano, 2015 In 2020, Salvatore Garau reinterprets the concepts of invisibility with the idea of the \"Cycle of Absences\" in a completely innovative way. == Main Manifesti == * Alfred Jarry, Patafisica (1896) * Marcel Duchamp * Vanishing Point, Jean Baudrillard * Souvenirs de James Joyce, Philippe Soupault * Pensiero di Bergson, premio Nobel (1927) * Esposizione internazionale del Niente, Milano, 1960 * International Exhibition of Nothing, Amsterdam, 1961 * Invisible: Art about the Unseen 1957-2012, Londra, 2012L’arte invisibile in mostra a Londra. «Ma la creazione non è astensione dal giudizio», Tempi, 2012 * Esposizione internazionale del Niente, Milano, 2015 * Pensiero di Garau, Cycle of Absences (Garau), Piazza della Scala, Milano (2021) == Main works: \"When art is invisible\" == * Uberto Boccioni, the space in futurism * Alighiero Boetti, the space in futurism * Gino Severini, the space in futurism * Marcel Duchamp, Airs de Paris (1919) * Marcel Duchamp, Fontana (1917), Ready-made * Piero Manzoni, Corpo d'aria (\"Body of Air\", 1959-1960) * Piero Manzoni, Fiato d'artista * John Cage, music 4′33″, four minutes, thirty-three seconds of silent piece (1952) * Piero Manzoni, Achrome (1957-1963), invisible colors * Yves Klein, Vacuum (1958) * Lucio Fontana, I tagli (1958) * Gino De Dominicis, Cubo invisibile (1967), represented by a square drawn on the ground * Jeff Koons, Vacuum Cleaner (1981), Ready-made, MOMA * Salvatore Garau, I Am (2020), a simple sheet of paper signed by the artist certifies the existence. * Damien Hirst, Ping Pong Damien Hirst (b.1965) Relationships, London, ICA Editions, 1991, Christie's, contemporary art * Alighiero Boetti, MOMA Alighiero Boetti, Italian, 1940–1994, MOMA, New York * Salvatore Garau, In Front of you (2021), a signed A4 sheet of paper sold at auction has already made his signature a work of art. == Related pages == * Salvatore Garau * In front of you (Garau) * I Am (Garau) == References == == Bibliography == * Aldo Quinti, \"Duchamp invisibile\", Officina edizioni, 1975 * Giorgio Di Genova, \"Storia dell'arte italiana del '900: Generazione anni Trenta\", 2000, ISBN 9788885345812 * Francesco Tedeschi, \"Lo spazio ridefinito: Aricò, Castellani, Coletta, Dadamaino, Garutti, Nagasawa, Pinelli, Staccioli, Vago, Varisco,\" 1998, ISBN 9788820212766 * Il Vieri, 1971 * Agnetti 1970, V. Agnetti, Gli Achromes di Piero Manzoni, Milano 1970. ISBN 978-88-8301-013-1. * Beckett [1952] 2002S. Beckett, Aspettando Godot [En attendant Godot, Paris 1952], in Teatro, Torino 2002, pp. 3-97. ISBN 978-88-339-1247-7. * Beckett [1955] 1971S. Beckett, Testi per nulla [Nouvelles et textes pour rien, Paris 1955], in Primo amore, Torino 1971, pp. 105-162. ISBN 978-88-341-0078-9. * Costantini 2007A. Costantini, Da zero a niente. Piero Manzoni a confronto, in Piero Manzoni, a cura di G. Celant, Milano 2007, pp. 54-77. ISBN 978-88-7292-186-6. * Flaubert [1852] 1980G. Flaubert, Lettera a Louise Colet (16 gennaio 1852), in Correspondance, a cura di J. Bruneau, Paris 1980. ISBN 978-2-07-032942-5. * Manzoni [1960] 2020P. Manzoni, Manifesto contro niente per l’esposizione Internazionale di niente (1960), in Writings on Art, Zurich 2020. ISBN 978-3-85881-936-2. == Other websites == * New York, Aphrodite Crying, by Salvatore Garau, 2021 * Video \"The invisible on display in Milan\", 2015, Video * \"Da Zero a Niente. Piero Manzoni a confronto Category:Art movements",
 "title": "International Exhibition of Nothing"
}