{
 "id": "852834",
 "text": "A protective hairstyle is a way of putting human hair so that it will not break or become dirty. Most of the time, when people talk about protective hairstyles, they mean natural African hair. A protective hairstyle tucks the ends of the hair into a braid, twist, or other shape so that they do not show. This stops the hair from moving, which makes it less likely to break or wear out. According to hair artist and author Jennifer Lord, protective hairstyles keep hair from being too dry. They also make it so the person does not have to brush or move the hair as often. This helps the person \"retain length,\" meaning their hairs will not break. A person with a protective hairstyle also does not need to spend much time styling his or her hair every day. ==History== People have worn protective hairstyles for all of history. Archaeologists have found proof of protective hairstyles from 30,000 years ago. Some Egyptian bodies from 3000 years ago had protective hairstyles. ==Law== Hair and hairstyles are part of the history of race on Earth. In some places, for example the United States, employers have told employees, usually African American employees, to go home and change their hair or else be fired. People with African hair must take time and spend money to change their hair so it looks like a white person's hair. Some places have passed Creating a Respectful and Open World for Natural Hair (CROWN) laws. CROWN laws are anti- discriminiation laws. This means an employer cannot fire an employee for wearing a protective hairstyle and cannot force an employee to try to make their hair look like a white person's hair. For example, New York State added rules about protective hairstyles to its human rights law in 2019. The United States Congress passed a CROWN law for the whole country in 2022. The law says, \"In a society in which hair has historically been one of many determining factors of a person’s race, and whether they were a second class citizen, hair today remains a proxy for race. Therefore, hair discrimination targeting hairstyles associated with race is racial discrimination.\" ==Types of protective hairstyles== *Bantu knots *Box braids *Braids *Buns or other updos *Cornrows *Dreadlocks *Faux locs *Twists *Weaves *Wigs ==Pictures== File:Girl in Demeka, Ethiopia (15101920440).jpg|Ethiopian girl with her hair in braids. File:Cornrows by David Shankbone.jpg|A man with his hair in cornrows. File:Ida_B._Wells_Barnett.jpg|A bun or braided bun can be a protective hairstyle. File:Ken Nwadiogbu’s Profile picture.jpg|A man with his hair in dreadlocks. ==References== Category:Hairstyles",
 "title": "Protective hairstyle"
}