{
 "id": "852977",
 "text": "Varun Gandhi (born 13 March 1980) is an Indian politician, and a member of Parliament for Lok Sabha. He is elected from the Pilibhit constituency. He is a member of the Bharatiya Janata Party(BJP). He is from the Nehru–Gandhi family == Early life == Varun Gandhi was born in Delhi to Sanjay Gandhi and Maneka Gandhi. He is the grandson of former Prime Minister of India, Indira Gandhi and the great-grandson of India's first Prime Minister, Jawaharlal Nehru. When Varun was three months old,his father died in a plane crash. Varun attended Rishi Valley School and the British School, New Delhi. == Early career == Varun Gandhi's first appearance as politician was at Pilibhit constituency during the 1999 election campaigning. His mother was a part of the National Democratic Alliance. Varun joined BJP in 2004.In an interview on BBC's HARDTalk in October 2005, Gandhi said \"His father had helped revive the industrialization of India by starting Maruti Udyog and whose strategy helped the Congress party's comeback after the first ever non-Congress Janata Party government\". == As a Member of Parliament == In the 2009 general election, the BJP put Varun Gandhi as its candidate from the Pilibhit constituency instead of his mother Maneka Gandhi. He won the seat by receiving 419,539 votes. The victory was the strongest of any of the four Gandhi family candidates in the election: his mother Maneka Gandhi, aunt Sonia Gandhi and first cousin Rahul Gandhi. In March 2013, Varun Gandhi was appointed as the national general secretary of the BJP. He became the youngest ever general secretary of the party. In August 2013, Gandhi was the only MP in the country who had spent all of his MP Local Area Development Fund (MPLAD) before stipulated time. According to official sources, Varun Gandhi used his funds for the development in education, health and infrastructure activities. In May 2014, Gandhi won Lok Sabha 2014 elections.In March 2016, he introduced the Representation of the People (Amendment) Bill, 2016 in Lok Sabha.In 2019 general elections,he become an MP for the third time in a row. == As a Political Writer and Poet == Gandhi writes articles for many national dailies and magazines in India like The Indian Express, The Economic Times,The Times of India, Hindustan Times, The Asian Age,The Hindu, Outlook. Gandhi wrote his first volume of poems, titled The Otherness of Self, at the age of 20, in 2000. His second volume of poems, titled Stillness was published by HarperCollins in April 2015. The book became the bestselling non-fiction book. In 2018, he released his book on the Indian rural economy titled \"The Rural Manifesto: Realising India's Future Through Her Villages\". == References == Category:1980 births Category:Living people Category:Politicians from New Delhi Category:Members of the Lok Sabha Category:Bharatiya Janata Party politicians",
 "title": "Varun Gandhi"
}