{
 "id": "852991",
 "text": "Three Percenters also known as III%ers is an American and Canadian armed group (also called a \"militia\"). According to the Anti-Defamation League, some Three Percenters take weapons and form militias, but others do not. Some Three Percenters plan terrorist crimes but others only talk to each other online. The Three Percenters started in 2008, but they are part of a larger militia movement that started in 1993 or 1994. According to the Southern Poverty Law Center, the Three Percenters are more of a way of thinking and group of ideas than a group of people. Former Neo-Nazi Maxime Fiset called them the most dangerous terrorist group in Canada. ==Name== The name \"three percenters\" comes from the idea that only three percent of Americans fought in the American Revolutionary War for independence from Britain in the 1700s. This idea is not true. The percentage was really much higher. Sometimes smaller groups, or chapters, of the Three Percenters have different names, for example the 3%ers, 3% of Idaho, Washington State Three Percenters, and Georgia Security Force III%. ==Beliefs== Three Percenters are anti-government. They say their group is about \"preventing tyranny.\" Right-wing people and Libertarians sometimes praise them. They say that they are not a militia and not anti government. Three Percenters believe that a small number of people with weapons can fight and defeat a large government, the way the American Revolutionaries fought and won against the British. The Three Percenters do not like these things: *Gun control *Anti-COVID-19 lockdowns and laws *George Floyd protests and Black Lives Matter protests *Antifa *Muslims *Immigrants *The New World Order, an imaginary globalist and socialist organization that hates freedom ==History== The Three Percenters started on a blog written by an Alabama man called Mike Vanderboegh. He had already written an online newspaper called the John Doe Times. He had written about the Oklahoma City bombing in 1996. He wrote conspiracy theories about the bombing. Vanderboegh died in 2016. In 2008 and 2009, there was an economic collapse in the United States. Many people disliked the government and liked militias. At first, Three Percenters had to do a lot of military training, so people who couldn't travel to training places or whose bodies were not strong could not be Three Percenters. Later, the only rule to be a Three Percenter was to decide to be one. The Three Percenter Logo is a Roman numeral III surrounded by thirteen stars. It was easy to make things with this logo on it and sell them. In 2016, the Three Percenters endorsed a candidate for President of the United States for the first time. They chose Donald Trump. But once Trump was president, it was harder for them to hate the government. Three big groups of Three Percenters collapsed, though experts are not sure why. On February 21, 2022, the leaders of the American Three Percenters national group said they were dissolving, or ending, the Three Percenters. They said they were doing this because of the 2021 US Capitol attack: > \"...we must dissolve this organization effective immediately. It appears > that other 'Three Percenter' groups no longer hold the values and morals > that we have held in our organization for so long. The DC riots and Capitol > breach has hurt the patriot movement drastically and as a result brought an > end to our organization. It's quite unfortunate that we've come to this. The > media refuses to differentiate between the different 'Three Percenter' > organizations and groups, leaving all of the fingers constantly pointing > towards us.\" This only ended the nationwide American group. Other groups of Three Percenters, for example local chapters, continued to operate after this. ==Activities== The Three Percenters show up with weapons when they think that the federal government is abusing someone. For example, Three Percenters showed up to a ranch where a man had said he would not pay federal grazing fees for his animals. They said they wanted to protect him. Three Percenters also show up to liberal and left-leaning events. Sometimes they are there as counter-protesters. Sometimes they say they want to \"monitor\" the liberals. ==Ties to white supremacy== According to the Anti-Defamation League, the Three Percenters are not as close to people who think white people should rule other humans as other militia groups are. They showed up to the Unite the Right Rally in Charlottesville in 2017, but they later tried to distance themselves from the murders committed there. Some Three Percenters go to the U.S.-Mexico border and try to stop people from entering the United States illegally as vigilantees. == Crimes and terrorism== While Three Percent is often considered more of an ideology than an organized militia, many people who subscribe to the ideology have attempted violent anti-government actions. After the 2021 Capital raid the official website said they do not support this violence and deleted their website. In 2021, they were added to Canada's list of terrorist organizations. Despite many claims, they are not a neo Nazi organization as neo-Nazis believe in the supremacy of the white race, and the Three Percenters previously said \"we will not align ourselves with any type of racist group\". *In Oklahoma in 2015, Three Percenter Jeremy Doss fired a gun onto Interstate 40, killing two drivers. This was a spree killing. He pled guilty and was sentenced to life in prison. *In Kansas in 2016, members of a Three Percenter group called \"The Crusaders\" planned to use truck bombs to destroy a building where Muslims lived. They were given 25 or more years in prison each. *In Oklahoma in 2017, Three Percenter Jerry Drake Varnell tried to use a truck bomb to blow up a bank. He was sentenced to 25 years in prison. *In Illinois in 2017, Three Percenters bombed a mosque and tried to bomb an abortion clinic. Most of them pled guilty. *In Washington D.C. on January 6, 2021, Three Percenters tried to enter the Capitol building with other Trump supporters to stop the Senate from counting the votes from the 2020 presidential election. One Three Percenter, Guy Wesley Reffit was the first person from the 2021 United States Capitol attack to go on trial. ==References== Category:Politics of the United States Category:2008 establishments Category:Terrorism Category:Violence Category:Religious violence Category:Political violence Category:Religious terrorism",
 "title": "Three Percenters"
}