{
 "id": "852968",
 "text": "Mary Jackson (née Winston; April 9, 1921 – February 11, 2005) was an American mathematician and aerospace engineer. She worked for the National Aeronautics and Space Administration (NASA), at Langley Research Center in Hampton, Virginia. She also worked for the organization that was there before NASA was founded in 1958. In 1951, she started at National Advisory Committee for Aeronautics (NACA). At first, she was a computer, a person doing advanced scientific calculations. She took advanced engineering classes and, in 1958, became NASA's first black female engineer. Today, she is known as an important figure in what is known as the Space Race. ==Life== After 34 years at NASA, Jackson had earned the most senior engineering title available. She realized she could not earn further promotions without becoming a supervisor. She accepted a demotion to become a manager of both the Federal Women's Program, in the NASA Office of Equal Opportunity Programs and of the Affirmative Action Program. In this role, she worked to influence the hiring and promotion of women in NASA's science, engineering, and mathematics careers. In 2016, the book Hidden Figures: The American Dream and the Untold Story of the Black Women Who Helped Win the Space Race was written, about her life. The book was also made into a movie, released the same year. In 2019, Jackson was posthumously awarded the Congressional Gold Medal. In 2021, the Washington, D.C. headquarters of NASA was renamed the Mary W. Jackson NASA Headquarters. NASA held a virtual ceremony for the naming. == Legacy == The 2016 film Hidden Figures recounts the NASA careers of Jackson, Katherine Johnson, and Dorothy Vaughan, specifically their work on Project Mercury during the Space Race. The film is based on the book of the same name by Margot Lee Shetterly. Jackson is portrayed in the film by Janelle Monáe. In 2018, the Salt Lake City School Board voted that Jackson Elementary School in Salt Lake City, Utah, would from then on be officially named after Mary Jackson rather than (as it used to be) after President Andrew Jackson. NASA's headquarters building in Washington, D.C. was renamed the Mary W. Jackson NASA Headquarters on February 26, 2021. == Awards and honors == * Apollo Group Achievement Award, 1969 * Daniels Alumni Award for Outstanding Service to Disadvantaged Youth * National Council of Negro Women, Inc. Certificate of Recognition for Outstanding Service to the Community * Distinguished Service Award for her work with the Combined Federal Campaign representing Humanitarian Agencies, 1972 ** Langley Research Center Outstanding Volunteer Award, 1975` * Langley Research Center Volunteer of the Year, 1976 * Iota Lambda Sorority Award for the Peninsula Outstanding Woman Scientist, 1976 * King Street Community Center Outstanding Award * National Technical Association's Tribute Award, 1976 * Hampton Roads Chapter \"Book of Golden Deeds\" for service * Langley Research Center Certificate of Appreciation, 1976–1977 * Congressional Gold Medal, 2019 Category:1921 births Category:2005 deaths Category:Engineers from Virginia",
 "title": "Mary Jackson"
}