{
 "id": "853151",
 "text": "Quaid-I-Azam University Islamabad (; commonly known as QAU), founded as University of Islamabad, is a public research university in Islamabad, Pakistan. Initially this university was founded for the study of postgraduate education but slowly through the 1980s university became an interdisciplinary university offering undergraduate and postgraduate education. In 2015, University became largest varsity in Islamabad with 13,000 students. The university is on a 1700 acres (or 6.9km²) campus on the foothills of the Margalla. Divided into four faculties and nine affiliated research institutes, QAU is among Pakistan's largest and highest ranked public universities. In 2020, it is ranked between 510-520 overall whilst in Physics, Mathematics and agriculture departments ranked 225th, 225th and 125th respectively worldwide, in emerging economics it's ranked below 100 which is probably a prestige, and also ranked 111th in Asia by the QS World University Rankings while its regional publications ranked QAU among 120 in Asia in 2013. The Times Higher Education World University Rankings ranked QAU between 401-500 globally and top 75 in Asia in its 2020 lists. The university has intellectual interaction with international institutes, including the United Nations, University of Tokyo and the ICTP. It is one of the most popular universities in the country and counts several public figures and intellectuals among its current and former faculty, researchers, or alumni since its establishment. They include Arshad Sharif,Maleeha Lodhi, Nasim Zehra, Shamshad Akhtar, Suhail Zubairy, Abdul Rashid Ghazi, Farzana Aslam, Tasneem Zehra and Salma Zahid. The university is currently led by Professor Muhammad Ali. The University of Islamabad was established on 22 July 1967 by the Government of Pakistan. It was renamed as Quaid-i-Azam University in honor of Quaid-e-Azam Muhammad Ali Jinnah, founder of Pakistan in 1976 - which was the year of his birth centenary. However, the spelling of the University's name were kept different i.e. \"i\" was used instead of \"e\" for Ezāfe that links the two words in Jinnah's title Quaid-e-Azam. The University offered teaching and research programs for PhD and MPhil degrees in the beginning and later offered Master's programs. The University now offers undergraduate programs as well. Quaid-i- Azam University has four different faculties and 38 departments, institutes, schools and centers. == References == Category:Federal Capital Territory of Islamabad Category:Colleges and universities in Pakistan",
 "title": "Quaid-i-Azam University"
}