{
 "id": "853299",
 "text": "Emma Raducanu (born 13 November 2002) is a British tennis player. She is the current women's singles US Open champion. She won it without losing a set in the tournament. Raducanu has a career-high singles ranking of world #150, got on 23 August 2021. Before she played at Wimbledon in 2021, her highest WTA singles ranking was #333, on 9 March 2020. She has won three singles titles on the ITF Circuit. She was awarded a Member of the Order of the British Empire on 29 November 2022 by King Charles III for her service to tennis. ==Personal life== Raducanu was born in Toronto, Ontario, Canada to a Romanian father and a Chinese mother, who both work in finance. Her family moved to London when she was aged two because they thought it would be an exciting place for her to grow up. She started playing tennis at the age of five at the Bromley Tennis Academy. She was a pupil at Newstead Wood School, a state grammar school in the London Borough of Bromley. ==Career statistics== ===Grand Slam tournament performance timeline=== ====Singles==== Tournament 2021 Win % A 0 / 0 0–0 French Open A 0 / 0 0–0 Wimbledon 4R 0 / 0 0–0 US Open 0 / 0 0–0 Win–Loss 0–0 ==ITF Circuit finals== Legend $100,000 tournaments $80,000 tournaments $60,000 tournaments $25,000 tournaments $15,000 tournaments ===Singles: 5 (3 titles, 2 runners-up)=== Result W–L Date Tournament Tier Surface Opponent Score Win 1–0 May 2018 ITF Tiberias, Israel 15,000 Hard Hélène Scholsen 7–6(3), 6–4 Win 2–0 Oct 2018 ITF Antalya, Turkey 15,000 Hard Johana Marková 6–4, 6–2 Loss 2–1 Mar 2019 ITF Tel Aviv, Israel 15,000 Hard Corinna Dentoni 4–6, 3–6 Win 3–1 Dec 2019 ITF Pune, India 25,000 Hard Naiktha Bains 3–6, 6–1, 6–4 Loss 3–2 Mar 2020 ITF Sunderland, UK 25,000 Hard (i) Viktoriya Tomova 6–4, 4–6, 3–6 ==References== Category:2002 births Category:Living people Category:British tennis players Category:Female tennis players Category:People from the London Borough of Bromley Category:Sportspeople from London Category:US Open (tennis) champions Category:Canadian tennis players Category:Members of the Order of the British Empire Category:Naturalised citizens of the United Kingdom",
 "title": "Emma Raducanu"
}