{
 "id": "853267",
 "text": "Charles Grey, 1st Earl Grey, later Baron Grey De Howick (1730-1795) was a British fighter. He fought in the American Revolutionary War. ==Early life== Grey was born into an important family. He was born at their large house in Howick, Northumberland, England. Grey's father was a baronet. They had lived in and ruled Howick since the 1200s. Grey's two older brothers died before they could have their own children, but when Grey was a boy, he did not think he would inherit his father's land. So he went into the military in 1944. ==Military career== Grey fought in the War of Austrian Succession, Jacobite Rebellion, and Seven Years' War. He made friends with other British fighters, for example James Wolfe, William Petty, and the Earl of Shelburne. He was aide-de-camp to Prince Ferdinand of Brunswick-Wolfenbüttel. Grey learned to fight. ===American Revolutionary War=== Grey became lieutenant colonel in 1777. He commanded one of General William Howe's brigades. Grey fought in the Battle of Brandywine and surprised General Anthony Wayne at the Battle of Paoli. At Paoli, Grey told his men to charge with their bayonets. Military historians say it was one of the best moves of the entire war. He told his men to take the flints out of their guns so that they would not make sparks that the Continental soldiers could see or fire accidental gunshots that the Continental soldiers could hear. This got him the nickname \"'No Flint' Grey.\" But some people on both sides of the war said Grey had not acted honorably. They called the Battle of Paoli the \"Paoli Massacre\" instead. Grey fought at the Battle of Germantown and Battle of Monmouth. He surprised more Continental troops in Tappan, New York and killed them. Later, people would call this the Baylor Massacre. In 1778, King George III promoted Grey to Lieutenant General and made him a knight of the Order of the Bath. ==Later career== Grey retired from the army but only for a short while. He went to Howick and built a new house there, Howick Hall. He hired an architect called William Newton. Then Grey worked as an army administrator. He was aide-de-camp to King George III and fought against the French in Belgium and the Caribbean. King George made Grey governor of Guernsey in 1797. He made Grey a baron in 1801. In 1806, he made Grey 1st Earl Grey and Viscount Howick. ==Family== Grey married Elizabeth Grey of Southwick in 1762. They had eight children including Charles Grey, 2nd Earl Grey. == References == Category:British Army people Category:1729 births Category:1807 deaths Category:People from Northumberland Category:United Kingdom Earls Category:Order of the Bath",
 "title": "Charles Grey, 1st Earl Grey"
}