{
 "id": "853288",
 "text": "Curtis Lee Mayfield (June 3, 1942 – December 26, 1999) was an American guitarist, singer-songwriter and record producer. He was one of the most influential musicians behind soul and the politically conscious African- American music. He first achieved success and recognition with the R&B; and soul group The Impressions during the civil rights movement in the 1950s and 1960s. The Impressions were later put into the Rock and Roll Hall of Fame. Mayfield later decided to work on his own. Mayfield began his music career in a gospel choir. He got involved with The Impressions shortly after moving to the North Side of Chicago. In 1965, Mayfield wrote the song \"People Get Ready\" for The Impressions. The song was later ranked at #24 on the Rolling Stone list for 500 Greatest Songs of All Time. The song got several other awards. It was included into the Rock and Roll Hall of Fame's 500 Songs That Shaped Rock and Roll. \"People Get Ready\" was added into the Grammy Hall of Fame in 1998. Mayfield left The Impressions in 1970 in the pursuit of working on his own. He released several studio albums, including the soundtrack for the blaxploitation movie, Super Fly in 1972. The soundtrack dealt with crimes involving inner-city minorities, like substance abuse, poverty and crime. Mayfield was paralyzed from the neck down when lighting equipment fell on him while he was performing live at the Wingate Field in the Flatbush neighborhood of Brooklyn, New York. However, he continued his career as a recording artist. His last studio album was New World Order in 1996. Mayfield won the Grammy Legend Award in 1994 and the Grammy Lifetime Achievement Award one year later. Mayfield was born in the Cook County hospital in Chicago, Illinois. He died in Roswell, Georgia from type 2 diabetes complications at age 57 the day after Christmas 1999. ==References== Category:1942 births Category:1999 deaths Category:African-American musicians Category:American guitarists Category:Singer-songwriters from Chicago Category:American Grammy Award winners Category:Deaths from diabetes",
 "title": "Curtis Mayfield"
}