{
 "id": "853365",
 "text": "List of chemicals used in cases of doping in sport. There have been years, when sportspeople got sanctions (or punishment), if a test showed use of one or more chemicals. There are lists that show which chemicals, that sportspeople are not allowed to use. Some sportspeople got punishment for using too much of a chemical. (The chemicals on the list, are in alphabetical order.) * Acetazolamide (brand name \"Diamox\"). In 2016 a sportsperson lost an Olympic medal (from 2008). * \"Carphedon\" (brand name), see phenylpiracetam * Clenbuterol. In 2012 one sportsperson got punishment, and lost an Olympic medal (from 2004).Karolos Grochmann: Russian weightlifter stripped of Athens bronze medal , thestar.com.my, 13 February 2013 * Darbepoetin alfa. In 2002, 3 sportspeople lost Olympic medals (winter Olympics). * Dianabol (marketing name), or metandienone. In 1972 a sportsperson got punishment and lost an Olympic medal.Olympics ban settles doping row, New Straits Times, 2 September 1972 * Ephedrine. In 1972 a test showed that a sportsperson used Ephedrine as doping. The person got punishment, when the person lost an Olympic medal. * EPO, full name Erythropoietin. In 2018 a sportsperson got punishment.Nicholas Gough Receives Doping Sanction | USADA The chemical is on the Prohibited list S2Retrieved 5 July 2021 of World Anti-Doping Agency. * Ethamivan. In 2004 a sportsperson got punishment, when her Olympic medal was taken away. * Ethanol. In 1968 a sportsperson got punishment, when his Olympic medal was taken away. * Furosemide. In 1988, two sportspeople got punishment. Each lost an Olympic medal. * \"GHRP-2\", or Pralmorelin (brand name: GHRP Kaken 100). In 2017 a sportsperson lost an Olympic medal (from 2016). * Growth hormone (GH or HGH), also known as somatotropin or somatropin. In 2010 a sportsperson got punishment; he got a \"two-year sanction\". * GW1516. Sportspeople got punishment in 2013.Shane Stokes: GW501516 positives confirmed, three of four riders are from same BCR Pizza Hut team, velonation.com, 15 April 2013Shane Stokes: Four riders each handed two year bans for use of GW501516, velonation.com 30 July 2013List of sanctions , uci.ch * Meldonium. In 2018, one sportsperson used the chemical, and his team lost its Olympic medal. * Metandienone, see Dianabol (marketing name) * Methenolone. In 1984, two sportspeople got punishment. Both lost an Olympic medal and (at least) one got an 18-month ban. * Methyltestosterone (branded as Android, Metandren, and Testred). In 2008, a sportsperson lost an Olympic medal. * Methylhexanamine. In 2017 a sportsperson lost an Olympic medal (from 2008). * Nandrolone. In between 2000 and 2021, sportspeople got punishment. One lost an Olympic medal and one got a 4-year ban. * Nikethamide, earlier sold as \"Coramine\". In 1972 two sportspeople used doping; one national sportsteam lost their Olympic medal, Bangladesh Observer, Sports news, September 2004. The Times. sports-reference.com and one more sportsperson lost another Olympic medal. * Oxandrolone. In 2012 one sportsperson lost an Olympic medal (from 2004).IOC: INTERNATIONAL OLYMPIC COMMITTEE IOC DISCIPLINARY COMMISSION RECOMMENDATIONS REGARDING YURIY BILONOG BORN ON 9 MARCH 1974, ATHLETE, UKRAINE, ATHLETICS * Phenylpiracetam (INN: fonturacetam); brand names: Carphedon, Phenotropil. In 2006 one sportsperson lost an Olympic medal. * Propranolol. In 2008 a sportsperson lost Olympic medals. * Pseudoephedrine. In 2000 a sportsperson lost an Olympic medal. * Stanozolol. In between 1988 and 2014, sportspeople got punishment. 28 sportspeople lost Olympic medals. * Strychnine. In 2016 a sportsperson lost an Olympic medal. * Testosterone. In 2019 a sportsperson got punishment.Ty Kurth Accepts Doping Sanction | USADA * Tuaminoheptane. In 2016 a sportsperson lost an Olympic medal. * \"Turinabol\", or chlorodehydromethyltestosterone, brand name \"Oral Turinabol\". In 2016 a sportsperson lost an Olympic medal (from 2008). ==Related pages== * List of doping cases in athletics * List of doping cases in sport * Carnitine ==References== Category:Doping in sport Category:Chemicals",
 "title": "List of chemicals in doping cases in sport"
}