{
 "id": "853447",
 "text": "Windsbach () is a town in Ansbach, a district (Landkreis) in Middle Franconia. It is east of Ansbach, and southwest of Nuremberg. == Geography == === Location === Windsbach is in the Rangau area at the Franconian Rezat River. The city's position is eastward of the district capital Ansbach and southwestern of Nuremberg. Beside the Franconian Rezat River the Aurach, a side arm of the Rednitz River flows through the community area. The following communities surround Windsbach (beginning north going clockwise direction): Rohr, Kammerstein, Abenberg, Spalt, Mitteleschenbach, Wolframs-Eschenbach, Lichtenau, Neuendettelsau and Heilsbronn. === Suburbs === Windsbach consists out of 29 suburbs: * Bertholdsdorf * Brunn * Buckenmühle * Elpersdorf * Hergersbach * Hölzleinsmühle * Hopfenmühle * Ismannsdorf * Kettersbach * Kitschendorf * Kugelmühle * Lanzendorf * Leipersloh * Moosbach * Neuses * Retzendorf * Sauernheim * Schwalbenmühle * Speckheim * Suddersorf * Thonhof * Untereschenbach * Veitsaurach * Waldhaus * Wernsmühle * Windsbach * Winkelhaid * Winterhof * Wolfsau == Politics == * First mayor: Matthias Seitz (SPD) * Second mayor: Norbert Kleinöder (Hinterland of Windsbach) * Third mayor: Karl Schuler (SPD) === City Council === The City Council has (including the 1. Mayor) 21 members: Party Seats CSU / Engaged Citizens 6 SPD / Independent Voters 6 Voter-Alliance Hinterland of Windsbach 4 Green Party 2 Free Voters / Citizen Fraction of Windsbach (WBB) 2 (Status: Municipal Elections of 2 March 2008) == Memberships == Windsbach is member in the following institutions and organisations: * German-American Society of West Middle Franconia e.V. * Regional Community Alliance \"kommA\" == References == == Other websites == * Homepage of the Windsbach Boys Choir * Homepage of the Music School of Windsbach * Homepage of the Johann-Sebastian-Bach High School of Windsbach * Homepage of the Windsbach Fire Department Category:Ansbach (district)",
 "title": "Windsbach"
}