{
 "id": "853428",
 "text": "Hurricane Elsa was an Atlantic tropical cyclone that formed during early July 2021. The storm became a tropical depression on July 1. It strengthened to Tropical Storm Elsa just under six hours later. Elsa was the strongest July hurricane in the Caribbean Sea since Hurricane Emily sixteen years earlier. The storm was also the fastest-moving tropical cyclone in that part of the Atlantic. Tropical cyclone notices were posted from the Windward Islands to Cuba several days in advance of the storm. It was downgraded to a strong tropical storm just before moving north of Jamaica. The storm later began threatening western and central Florida. Several days before Elsa was expected to move over the state, the Champlain Towers South was demolished on Independence Day July 4 after having collapsed almost eleven days earlier in the Miami suburb of Surfisde. The related rescue and search operation was suspended for the remaining missing people when forecasts showed Elsa moving very close to the area. Shortly after the cyclone was named, Elsa began receiving widespread attention for sharing the same name as Elsa from Disney's Frozen franchise movies. ==Records== Elsa became a tropical storm farther east in the Main Development Region (MDR) than any other tropical cyclone so early in the calendar year on record, behind only the 1933 Trinidad hurricane. Elsa strengthened to a Category 1 hurricane as it was letting it go into warm waters that made the eastern-most hurricane recorded in the MDR, south of 23.5°N, this early in the calendar year since 1933. Around that time, Elsa was moving at a forward speed of 29 mph (47 km/h), making it the fastest-moving Atlantic tropical cyclone recorded undergoing rapid intensification in the deep tropics or the Gulf of Mexico, and also the first storm to undergo rapid intensification in that part of the Atlantic that early in the calendar year since another storm in 1908. Since 1950, Elsa is the fourth hurricane that affect the Leeward Islands during July. The others : Abby in 1960, Bertha in 1996 and Emily in 2005. ==References== Category:Category 1 Atlantic hurricanes Category:2021 Atlantic hurricane season Category:Hurricanes in Jamaica Category:Hurricanes in Haiti Category:Hurricanes in the Dominican Republic Category:Hurricanes in Florida Category:July 2021 events Category:2021 disasters in the United States",
 "title": "Hurricane Elsa"
}