{
 "id": "853532",
 "text": "Kiwix is a free and open-source offline web browser created by Emmanuel Engelhart and Renaud Gaudin in 2007. It was first launched to allow offline access to Wikipedia. But it has expanded to include other projects from the Wikimedia Foundation as well as public domain texts from Project Gutenberg. It is available in more than 100 languages. Kiwix has been included in several high-profile projects, from smuggling operations in North Korea and encyclopedic access in Cuba to Google Impact Challenge's recipient Bibliothèques Sans Frontières. == History == ===Background=== Founder Emmanuel Engelhart sees Wikipedia as a common good, saying \"The contents of Wikipedia should be available for everyone! Even without Internet access. This is why I have launched the Kiwix project.\"Sutherland, Joe. Emmanuel Engelhart, Inventor of Kiwix: the Offline Wikipedia Browser. In: Wikimedia Blog. 12 September 2014. Accessed on 26 November 2014. After becoming a Wikipedia editor in 2004, Engelhart became interested in developing offline versions of Wikipedia. A project to make a Wikipedia CD, initiated in 2003, was a trigger for the project. ===Awards=== In 2012 Kiwix won a grant from Wikimedia France to build kiwix-plug, which was deployed to universities in eleven countries known as the Afripedia Project.Citazine article on Afripedia (in French) In February 2013 Kiwix won SourceForge's Project of the Month award and an Open Source Award in 2015. == Description == The software is designed as an offline reader for a web content. It can be used on computers without an internet connection, computers with a slow or expensive connection, or to avoid censorship. It can also be used while travelling (e.g. on a passenger plane or a train). ===Download=== Users first download Kiwix. Then they download content for offline viewing with Kiwix. Compression saves disk space and bandwidth. All of English-language Wikipedia, with pictures, fits on a large USB stick or external media (82 GB as of march 2021, or 43 GB with no pictures). ===Files=== All content files are compressed in ZIM format. It makes them smaller, but leaves them easy to index, search, and selectively decompress. The ZIM files are then opened with Kiwix, which looks and behaves like a web browser. Kiwix offers full text search, tabbed navigation, and the option to export articles to PDF and HTML. == Related pages == * XOWA * Wikipedia:Database download * Internet-in-a-Box * Wikimedia offline projects ==References== Category:Free software Category:Web browsers",
 "title": "Kiwix"
}