{
 "id": "853638",
 "text": "Mercedes Justine Kaestner-Varnado (born January 26, 1992) is an American professional wrestler and actress. She currently wrestles for All Elite Wrestling (AEW) using the ring name Mercedes Moné. She is also known for her time in the WWE from 2012 to 2022. In the WWE, she performed under the ring name Sasha Banks. After leaving the WWE, she wrestled for New Japan Pro- Wrestling (NJPW) and World Wonder Ring Stardom from 2023 to 2024. Varnado started her wrestling career in 2010 on the independent circuit. She has won the Chaotic Wrestling Women's Championship. She signed with the WWE in 2012, wrestling under the ring name Sasha Banks in NXT. She is a former NXT Women's Champion. Her match against Bayley at NXT TakeOver: Respect in October 2015 was the first women's match to be the last match of an NXT TakeOver event. It was also the first iron woman match in WWE history and the longest women's match in WWE history at the time. The match lasted 30 minutes. Their match was voted by Pro Wrestling Illustrated (PWI) as Match of the Year. Varnado was voted as Woman of the Year. In 2015, Varnado stared wrestling on WWE's main roster where she won the WWE (Raw) Women's Championship five times. In 2016, she and Charlotte Flair became the first women to main event a WWE pay-per- view event and the first women to wrestle in a Hell in a Cell match. It was also the first time that the PWI award for Feud of the Year was won by women. In 2019, she won the first WWE Women's Tag Team Championship with her tag team partner, Bayley. In 2020, she won the SmackDown Women's Championship at Hell In a Cell. This made her the third-ever WWE Women's Grand Slam Champion and the fourth WWE Women's Triple Crown Champion. That year, she was named Wrestler of the Year by Sports Illustrated. At WrestleMania 37, Varnado and Bianca Belair became the first black women to main event WrestleMania. She was the third most tweeted about female athlete in 2021. In May 2022, Varnado left the WWE. She then made her debut for NJPW/Stardom at Wrestle Kingdom 17 in January 2023 under the ring name Mercedes Moné, attacking the IWGP Womens Champion Kairi. She went on and won the title against Kairi at Battle in the Valley. On April 23 she had a match against Mayu Iwatani at \"Stardom All Star Grand Queendom\", Mayu defeated Moné for the title. Moné went on and tried to capture the new NJPW Strong Women's Title. Even though she was set to win the match, she injured her ankle, making her unable to win. On March 10, 2024, Varnado made her debut for All Elite Wrestling (AEW) at Big Business. The special episode of Dynamite took place in her hometown of Boston. She won the AEW TBS Championship in her debut match at Double or Nothing on May 26. Outside of wrestling, Varnado began an acting career in 2020. Her first role was the character Koska Reeves in the Disney+ series The Mandalorian. == Filmography == === Television === Year Title Role Notes 2015 WWE 24 Herself Episode 4: Documentary about the experiences of various performers at NXT TakeOver: Brooklyn 2015 Unfiltered Herself Episode 18: Interview show with Renee Young 2016 WWE 24 Herself Episode 9: Documentary about the experiences of various performers at WrestleMania 32 2017 Smashing Glass Ceilings Herself Episode 1 2019 WWE Chronicle Herself Episode 12: Documentary about Sasha Banks and her return to WWE following a four-month hiatus 2020 WWE Untold Herself Episode 14: Sasha Banks and Bayley tell behind-the-scenes stories about their classic match from NXT TakeOver: Brooklyn 2020–present The Mandalorian Koska Reeves Credited as Mercedes Varnado 5 episodes 2021 Steve Austin's Broken Skull Sessions Herself Episode 13: Interview show with Stone Cold Steve Austin 2022 WWE Evil Herself Episode 3: Exploring the intricacies and impact of Sasha Banks' heel persona in WWE 2023 Barmageddon Herself Episode 5: Brie Bella vs. Sasha Banks === Film === Year Title Role Notes 2023 The Collective Nikita Film debut == Personal life == Through her father, Varnado is a first cousin of rapper Snoop Dogg, who helped make her in-ring persona. She is also a first cousin of music producer Daz Dillinger and singers Brandy Norwood and Ray J. She is a fan of K-pop music and the Japanese anime Sailor Moon. Varnado calls Eddie Guerrero her favorite wrestler and inspiration. She was in attendance at Guerrero's memorial episode of Raw on November 14, 2005, in Minneapolis, and she also said she did not know Guerrero had died before she arrived at the arena. On August 4, 2016, Varnado married retired professional wrestler Sarath Ton. The two met while they were both wrestling on the independent circuit. Ton, who is known by his ring name Mikaze, works as a costume designer for WWE. == Championships and accomplishments == * All Elite Wrestling ** AEW TBS Championship (1 time, current) * CBS Sports ** Tag Team of the Year (2020) – * Chaotic Wrestling ** Chaotic Wrestling Women's Championship (1 time) * ESPY Awards ** Best WWE Moment (2021) * Independent Wrestling Entertainment ** IWE Women's Championship (1 time) * New Japan Pro-Wrestling ** IWGP Women's Championship (1 time) ** Strong Women's Championship (1 time, current) * Pro Wrestling Illustrated ** Match of the Year (2015) ** Woman of the Year (2015) ** Feud of the Year (2016) ** Feud of the Year (2020) ** Tag Team of the Year (2020) – ** Ranked No. 2 of the top 50 female wrestlers in the PWI Female 50 in 2016 ** Ranked No. 3 of the top 50 tag teams in the PWI Tag Team 50 in 2020 – * Ring Wars Carolina ** RWC No Limitz Championship (1 time) * Rolling Stone ** Future Diva of the Year (2015) ** Ranked No. 4 of the 10 best WWE wrestlers of 2016 ** NXT Match of the Year (2015) ** Title Feud of the Year, NXT (2015) * Sirius XM Busted Open Radio ** Wrestler of the Year (2020) ** Tag Team of the Year (2020) – * Sports Illustrated ** Ranked No. 8 of the top 10 female wrestlers in 2019 – ** Wrestler of the Year (2020) * Wrestling Observer Newsletter ** Worst Feud of the Year (2015) Team PCB vs. Team B.A.D. vs. Team Bella ** Worst Feud of the Year (2018) vs. Bayley * WWE ** NXT Women's Championship (1 time) ** WWE (Raw) Women's Championship (5 times) ** WWE SmackDown Women's Championship (1 time) ** WWE Women's Tag Team Championship (3 times, first) – with Bayley (2), and Naomi (1) ** WWE Women's Triple Crown Champion ** WWE Women's Grand Slam Champion ** NXT Year-End Award (1 time) *** Match of the Year (2015) ** Slammy Award (2 times) *** Female Superstar of the Year (2020) *** Double-Cross of the Year (2020) – Bayley attacks Sasha Banks on SmackDown (September 4) ** Bumpy Award (2 times) *** Tag Team of the Half-Year (2020) – with Bayley *** Best Match of the Half-Year (2021) – == Awards and nominations == Year Award Category Nominated work Result 2017 Teen Choice Awards Choice Female Athlete 2022 Nickelodeon Kids' Choice Awards Favorite Female Sports Star ==Notes== ==Reference== == Other websites == * * Category:1992 births Category:Living people Category:Actors from Massachusetts Category:All Elite Wrestling people Category:American professional wrestlers Category:Female professional wrestlers Category:Former WWE wrestlers Category:Professional wrestling managers and valets Category:Sportspeople from Massachusetts",
 "title": "Mercedes Moné"
}