{
 "id": "853607",
 "text": "{{Infobox writer |name=Rommel N. Angara|image=|caption=|birth_date=|birth_place=Baler, Aurora, Philippines|death_date=|death_place=|occupation=|genre = |language=|nationality=Filipino|alma_mater=Mount Carmel College of Baler|spouses=|children=|signature=}} Rommel Nazareno Angara ( ; ; born August 20, 1980), better known as Rommel N. Angara, is a Filipino poetLiwayway. Muralla cor. Recolletos St., Intramuros, Manila: Manila Bulletin Publishing Corp. May 16, 2011. and essayist. His poems were published in Pambata, a magazine for Filipino children; Sipag Pinoy, a publication of the Department of Labor and Employment (DOLE); and Liwayway, the oldest Tagalog magazine in the Philippines. His essays were published in The Modern Teacher, a magazine for Filipino teachers. He is sometimes referred to as \"Aurora's inspirational poet.\" == Personal life == He was born in the town of Baler in the Philippine province of Aurora. He is the youngest of the sons of Rodolfo R. Angara, Sr. of Baler, Aurora and Milagros D. Nazareno of Goa, Camarines Sur. During his childhood through early adolescence, he witnessed his father’s occasional violence toward his mother, who eventually fled their house. During his childhood through early adulthood, he also witnessed the former’s occasional drunkenness and regular smoking. When he was a young adult, he worked as an office clerk, tutor, and houseboy. In late December 2015, he was diagnosed with Ménière's disease (MD). == Education == He graduated as high school valedictorian in 1997 and as a commended college student in 2013 with a Bachelor of Secondary Education (BSEd) degree from the Mount Carmel College of Baler (MCCB), the oldest Catholic mission school in the province of Aurora. == Writing career == A member of a broken family in his early adolescence, he turned to poetry writing for consolation. His first published poem was the children’s poem \"Why Do They Cut Me, Lord?\" which appeared in Pambata in 1998. He wrote some poems for Sipag Pinoy from 2000 to 2002 and for Liwayway between 2011 and 2012. Among the poems he wrote for Liwayway was the sonnet \"En Su Incansable Labor\" (\"On Her Tireless Work\") included in the National Library of the Philippines (NLP) catalog in 2012. As a poet, he has a firm belief that \"a hundred ideas and a hundred sentiments\" can be expressed \"even with a single poetic line.\" He wrote some essays for The Modern Teacher in 2005 and from 2016 to 2020. Among the essays he wrote for The Modern Teacher was \"Is It Time for You to Say 'I Do'?—An Open Letter to a Young Student in Love.\" ==Media portrayal== His life story was featured in the Maalaala Mo Kaya? (MMK) May 21, 2016 episode “Pasa” (\"Bruise\") aired on ABS-CBN, with child actor Raikko Mateo and actor, model, and video jockey Diego Loyzaga playing the lead role. A trending topic in the Philippines on Twitter (officially known as X since July 2023) at Rank 1 for over four hours before midnight of May 21, 2016, the MMK episode reached a 30.2% nationwide rating compared with the 15.0% and 1.5% ratings garnered by the Magpakailanman (MPK) episode (GMA 7) and the Wattpad Presents episode (TV5), respectively. ABS-CBN uploaded the full-length MMK episode “Pasa” on YouTube twice, first on January 19, 2023 and then again on June 9, 2024. As of the last week of October 2024, the first upload garnered over five million views, while the second upload exceeded 131,000 views. Netizens also shared clips from the episode across various social media platforms, including Facebook, X (formerly called Twitter), and TikTok. MMK was the longest-running television (TV) drama anthology in the Philippines and in Asia, airing from May 15, 1991 to December 10, 2022, featuring weekly inspirational stories of celebrities and common people, with Filipina media executive, movie and TV producer, and actress Charo Santos-Conchio as host- narrator. == References == Category:1980 births Category:Living people Category:Filipino poets Category:Essayists Category:People from Aurora (province)",
 "title": "Rommel N. Angara"
}