{
 "id": "853776",
 "text": "The Tulle massacre happened on June 9, 1944 in the French town of Tulle, part of World War II. Civilians were executed by German soldiers in the 2nd SS Panzer Division Das Reich. == Historic context == After the Allies landed in Normandy, on the 6th of June 1944, there were partisan uprisings in most of the Massif central, and also in the Limousin region. They did this to support the allied invasion, and to make it more difficult for the German troops to get to the front line. There are not many people in the massif central. Partisans were able to get most of it under their control. They also attacked some of the towns, such as Guéret and Tulle. The German military forces were aware of this, and they took action. On the 7th of June, SS Gruppenführer Heinz Lammerding was given responsibility for the 2nd SS Panzer division \"Das Reich\". The division was to be used to fight against the resistance. Later it should head north to support other German troops. Other than fighting the resistance (called Maquis), they committed several crimes against the civilian population, amongst others, in Tulle. On the 7th and the 8th of June 1944, communist troops of the Francs-Tireurs et Partisans had entered the city of Tulle. They attacked German troops. There were several hundred of them. While they defended themselves, German troops also killed 18 employees of the railway station, in Tulle. These employees were paid by the Germans, and they wore white scarves, identifying them as civilians (under the Geneva Conventions). Several hundred German troops had been captured and locked in a school building, which was later put in flames. The partisans killed several hundred troops trying to escape from the burning school. Towards the evening of July 8, the FTP partisans were able to conquer Tulle. According to German reports \"122 soldiers\" were killed, wounded or went missing. The exact number is not known, and cannot be established today. The first units of the 2nd SS Panzer division reached Tulle on July 8. The partisans, who hadn't known they were coming, fled from the city. == The massacre == On July 9, the German troops of the Panzer division took revenge on the civilian population, for \"supporting the resistance\". First, all men between 18 and 45 years old were arrested. They were put in the courtyard of the local arms manufacturer, Manufacture nationale d’armes de Tulle. There there were told, that they would be hanged in the city, in rows of 120 people. Walter Schmald, a SD person from Belgium decided who would be hanged. Before taking his decision, he talked to high-ranking government officials of the Vichy regime. As these people were collaborating with the resistance movement, they could convince Schmald to spare their friends, and to lower the number from 120 to 99. Next the soldiers of the Panzerdivision hanged these 99 hostages, who were more or less picked at random. They used streetlights and balconies for hanging them. Groups of residents were forced to watch the hangings. One of these groups was a group of about 600 teenagers, who were part of the Arbeitsdienst. Many high-ranking SS officials listened to music and amused themselves, while the soldiers were hanging the men. Both the people who were forced to watch, and those who were being executed probably heard the music. Peter Lieb, a military historian says, that even though the German troops overreacted, and that some of their actions were against the laws of war, the Tulle massacre can still be seen as a form of war reprisal. This does not apply to the Massacre of Oradour, committed a day later. Oradour is near Limoges, about to the northwest. Officially, 642 people were killed in Oradour, which makes it one of the worst massacres of the Second World War, by the number of victims. == Convicting those responsible == After 1945, German courts did not convict Lammerding, for \"Lack of Proof\". In 1951, a court in Bordeaux found him guilty for the crimes he committed in Tulle and Oradour, and sentenced him to death (while absent). The French asked the British, who were occupying the part of Germany where he now lived (and was a successful businessman). to extradite him. The relationship between the two countries was bad, and the British officer in command said, he had never heard of Lammerding. Nevertheless, Lammerding \"vanished\" in 1954. When he reappeared in 1958, the German consitution made it illegal to extradite German citizens. In addition, a law came into force in 1955, which forbade to rejudge a case which had already been handled by another court of an allied power. This was only changed in 1975, after Lammerding's death in 1971. Category:1944 in France Category:Massacres in Europe during World War II Category:June 1944 events Category:Tulle",
 "title": "Tulle massacre"
}