{
 "id": "853829",
 "text": "Tower Prada (Italian: La Fondazione Prada) is a complex of museum buildings located in Milan, consisting of a permanent contemporary art gallery with works by various artists, including Jeff Koons, Walter De Maria, Pino Pascali, Damien Hirst, Carsten Höller, which frequently hosts many temporary exhibitions. == Description == The Foundation is characterized by several pavilions, some recently built like the tower, others that occupy the spaces of the ancient distillery \"Società Italiana Spiriti\" dating back to 1910. It is located in Largo Isarco, at the corner with Via Orobia in Via Lorenzini, south of Milan. The tower was designed by the Dutch architect Rem Koolhaas, with the collaboration of the studio Office for Metropolitan Architecture, together with architects Chris van Dujn and Federico Pompignoli, and its inauguration took place on April 18, 2018.Repubblica, Fondazione Prada Milano Torre di Koolhaas skyline On 20 June 2018 he received the Compasso d'oro 2018 award.ADI design, XXV Compasso d'oro, Adi, i vincitoriRepubblica, XXV Compasso d'oro i Vincitori == Economy == === Tourism === Being an exclusive fashion and beauty center of global significance, the area of the Prada Foundation turns out to be a tourist attraction of a certain importance, which every year attracts thousands and thousands of visitors from all over the world. Inside it is possible to admire a multitude of houses in full Milanese style, which demonstrate the exclusivity of life and the place in which they are located, as well as the tenor of the same, certainly above the European average. The Fondazione Prada area is one of the fastest growing areas of Milan, it is part, together with the districts of the Milan quadrilateral and the Brera district, of the richest and most luxuriant area of Milan so-called Platinum Triangle (literally \"Platinum Trianglev\") of Milan. The events of the Milan- Cortina 2026 Olympics will be concentrated in this area. ==References== ==Other websites== Category:Buildings and structures in Milan Category:Museums in Italy",
 "title": "Tower Prada"
}