{
 "id": "853854",
 "text": "H-Net Humanities and Social Sciences Online is an international interdisciplinary organization of scholars and teachers dedicated to developing the educational potential of the Internet and the World Wide Web. It has become an “International, interdisciplinary network of scholars communicating and sharing resources through different interactive media. It is made up of nearly 200 discipline-specific networks. ==Management== H-Net is hosted by the Department of History at Michigan State University, but H-Net officers, editors, and subscribers come from all over the world. == Further readings == * Andrew McMichael, \"The Historian, the Internet, and the Web: A Reassessment,\" Perspectives: The Newsletter of the American Historical Association, 36: 2 (Feb. 1998). https://www.historians.org/publications-and- directories/perspectives-on-history/february-1998/the-historian-the-internet- and-the-web-a-reassessment *Brennan, Elaine. “History Net Lists”. Humanist Archives Vol. 7. 6 July 1993. https://dhhumanist.org/Archives/Virginia/v07/0073.html *Jeremy D. Popkin, From Herodotus to H-Net: The Story of Historiography (Oxford UP, 2015, ). *“What’s Happening at H-Net”. H-Net Commons. https://networks.h-net.org/node/513/pages/92040/whats-happening-h-net *“The Department of History and Humanities Technology”. The Department of History. Michigan State University. https://web.archive.org/web/20121018153500/http://history.msu.edu/humanities- technology/ *“H-Net Reviews: Online Scholarly Reviews”. H-Net Commons. https://networks.h-net.org/reviews *Kornbluh, Mark Lawrence. “H-Net Humanities and Social Sciences Online”. 1 February 1999. Perspectives on History: an AHA magazine. https://www.historians.org/publications-and- directories/perspectives-on-history/february-1999/affiliate-news-h-net- humanities-and-social-sciences-online?pv=y *Kitchens, Joel. “Clio on the Web: An Annotated Bibliography of Select E-Journals for History”. 1 February 2000. Perspectives on History: an AHA magazine. https://www.historians.org/publications-and-directories/perspectives-on- history/february-2000/clio-on-the-web-an-annotated-bibliography-of-select-e- journals-for-history *McClymer, John. “How Do I Find the Good Stuff?”. American Historical Association. 2005. https://www.historians.org/teaching- and-learning/teaching-resources-for-historians/approaches-to-teaching/the-aha- guide-to-teaching-and-learning-with-new-media/how-do-i-find-the-good-stuff *McMichael, Andrew. The Historian, the Internet, and the Web: A Reassessment. 1 February 1998. Perspectives on History: an AHA magazine. https://www.historians.org/publications-and-directories/perspectives-on- history/february-1998/the-historian-the-internet-and-the-web-a-reassessment *Popkin, Jeremy. “From Herodotus to H-Net: The Story of Historiography”. 2015. https://global.oup.com/academic/product/from-herodotus-to-h- net-9780199923007?cc=au⟨=en&# *Schmidt, Lisa. “Preserving the H-Net Email Lists: A Case Study in Trusted Digital Repository Assessment”. The American Archivist. 29 June 2011. https://americanarchivist.org/doi/pdf/10.17723/aarc.74.1.u2jw67r7257wqw66 ==Notes== ==References== * Matthew Gilmore, \"H-Net: Digital Discussion for Historians\" , Perspectives: The Newsletter of the American Historical Association, 45: 5 (May 2007). * Richard J. Jensen, \"Internet's Republic of Letters: H-Net for Scholars\", (1997). A discussion of H-Net and its origins from the perspective of the founder. * Mark Lawrence Kornbluh, \"H-Net: Humanities and Social Sciences OnLine,\" Perspectives: The Newsletter of the American Historical Association, 37: 2 (February 1999). * Joel D. Kitchens, \"Clio on the Web: An Annotated Bibliography of Select E-Journals for History,\" Perspectives: The Newsletter of the American Historical Association, 38: 2 (Feb. 2000). * John McClymer, The AHA Guide to Teaching and Learning with New Media , (Washington: The American Historical Association), 2005. * Andrew McMichael, \"The Historian, the Internet, and the Web: A Reassessment,\" Perspectives: The Newsletter of the American Historical Association, 36: 2 (Feb. 1998). * Jeremy D. Popkin, From Herodotus to H-Net: The Story of Historiography (Oxford UP, 2015, ). ==Other websites== * H-Net Commons * H-Net: Humanities and Social Sciences Online Category:1992 establishments Category:American educational websites",
 "title": "H-Net"
}