{
 "id": "853962",
 "text": "A steam bath, steam room, or sweat bath is a way human beings wash themselves. Many gyms and health spas have steam rooms. Some steam baths, for example the Native American sweat lodge and Russian banya, are also about cleaning the spirit. A steam room is heated. It is usually 110°F to 114°F (43 to 46°C). The humidity level is 100 percent so the water hangs in the air. ==Health== Many types of natural medicine and traditional medicine use steam baths. Scientists have also studied steam baths to see what they really do and do not do to help the human body. For example, one study looked at people with allergic rhinitis who took steam baths, some with medicinal plants in the steam and some with steam alone. The scientists saw that the steam bath helped all the patients whether they used plants or not. Scientists say that sitting in a steam bath is good for circulation, or the flow of blood through the body. This is because the heat and steam make the capillaries get wider. The capillaries are the body's smallest blood vessels. Steam baths can also lower blood pressure and help skin heal. Steam baths are good for the skin because they make the person sweat and they make the pores in the skin open. Sitting in a steam bath after exercising can reduce muscle pain and preserve strength. Sitting in a steam bath can make the body make more good body chemicals called endorphins and make less of stress body chemicals, for example cortisol. Sitting in a steam bath can open up the sinuses in the nose, and help people breathe. Some scientists studied people with allergic rhinitis and found a steam bath helped them. However, scientists have not found that sitting in a steam bath makes anyone lose weight. People who sit in steam rooms for too long can become dehydrated, meaning their bodies lose too much water from sweat. Bacteria and fungi like to grow in warm, wet places, so people with fungal infections should not sit in steam baths. ==Types of steam baths== Many groups of Native Americans, for example the Lakota, use steam baths, also called sweat lodges. Europeans have been writing about Native American sweat lodges since the 1600s. A sweat lodge is not only for getting the body clean; it is a spiritual thing to do. A sweat lodge is a hut or tent with a pile of hot rocks in the middle. A sweat leader keeps the rocks hot and sometimes pours water on top of them to make steam. Sometimes the leader has everyone pray or sing. People can stay in the sweat lodge for hours, sometimes going outside for a little while. Some Finnish saunas are steam baths and some use dry heat. Some super sentō bathhouses in Japan have steam baths in them, especially newer sentō. ==Related pages== *Sentō *Sweat lodge *Sauna *Banya *Chuj == References == Category:Hygiene",
 "title": "Steam bath"
}