{
 "id": "854070",
 "text": "Repsol is the largest oil and gas company in Spain and one of the largest in Latin America. In 2020, Forbes ranked Repsol as the 645th largest companies in the world. == History == Until the 1920s, Spain did not have its own oil industry; all oil products were supplied to the country by large multinational companies such as Royal Dutch Shell. In 1927, the Compañia Arrendataria del Monopolio de Pétroleos Sociedad Anónima (CAMPSA, literally \"Oil Monopoly Company\") was created by the Primo de Rivera directory, which received the exclusive right to buy and distribute petroleum products at prices set by the state. In 1941, the first attempt was made to start oil production in Spain, but it was unsuccessful; by this time, three oil refineries were already working in the country. In 1957, natural gas was also included in the scope of CAMPSA. In 1964, attempts to find oil in Spain were finally crowned with success, although the oil was scarce and of poor quality. The next year, offshore exploration began, and ten years later significant oil reserves were discovered off the Mediterranean coast. In 1965, the state-owned company Hispanica de Petróleos (Hispanoil) was founded to search for oil in Spain and other countries. In 1974, the three refineries were united into Empresa Nacional del Petróleo (ENPETROL), in which the state owned 72% of the shares. On December 18, 1981, most of the participants in the energy market were united into the National Institute of Hydrocarbons (Spanish Instituto Nacional de Hidrocarburos; INH). In 1987, on the basis of INH, the Repsol company was formed, in which the state owned 100% of the shares. In 1989, an initial public offering (26%) was carried out, that is, the privatization process began, which was completed in 1997 with the sale of the last 10% owned by the Spanish government. In December 2014 Repsol announced that it would buy Canadian oil company Talisman Energy for about $15.1 billion Cdn ($13 billion US). == Activity == The Repsol company makes all types of activities related to oil and gas. It produces oil and gas in 30 countries; it owns 6 refineries (including 5 in Spain). == References == Category:1980s establishments in Spain Category:1987 establishments in Europe Category:Companies of Spain Category:Petrol companies Category:State-owned enterprises",
 "title": "Repsol"
}