{
 "id": "854110",
 "text": "Mercedes Bentso, full name Linda-Maria Roine, is a Finnish rapper.[Rapper Mercedes Bentso clashed with an association working against school bullying] Rap-artisti Mercedes Bentso joutui napit vastakkain koulukiusaamista vastaan toimivan yhdistyksen kanssa. Yle.fi. Retrieved 9 July 2021 She has been active as a rapper since 2012, and her genre is Gangsta rap.[Documentary project: Never again – rapper Mercedes Bentson's story] Dokumenttiprojekti: Ei koskaan enää – rap-artisti Mercedes Bentson rehellinen tarina. Yle.fi. Retrieved 9 July 2021 Her songs tell about drug use in her past, and about her being a victim of violence. The documentary film Never Again (from 2018), about Roine, has Aino Sun as film director. Roine was born in 1993. == Discography == === Albums=== * [Never again] Ei koskaan enää (2017) * [Every Single Night] Joka ikinen yö (2019) === Singles=== * ”Verikosto” (2015) * [The Murderer] ”Murhaaja” (2016) * [Lullaby] ”Tuutulaulu” (2017) === Music videos=== * ”Personal raineri” (2012) * ”Munaton mies” (2015) * [Winds of Change] ”Muutoksen tuulet” (2015) * ”Verikosto” (2015) * [Girls can't rap, period!] ”Tytöt ei osaa räppää, piste!” (2015) * ”Murhaaja” [The Murderer] (2016) * ”Tuutulaulu” [Lullaby] (2017) * [Last Day of School] ”Viimeinen koulupäivä” (2018) * ”Claire Quilty” (2019)[The first of Veijo Baltzar's victims went public – rapper Mercedes Bentso: \"I thought he saw talent in me\"] Ensimmäinen Veijo Baltzarin uhreista astui julkisuuteen – räppäri Mercedes Bentso: \"Luulin, että hän näki minussa lahjakkuutta\". Yle.fi. Retrieved 9 July 2021 === As guest artist=== Artisti Kappale Albumilta Muut vierailijat Vuosi Elinkautinen ”Muutoksen tuulet” [Winds of Change] Taistelutahto 2015 Rauhatäti ”Tytöt ei osaa räppää, piste!” [Girls can't rap, period!] Tytöt ei osaa räppää, piste! MC Pyhä Lehmä 2015 ==References== Category:Living people Category:1993 births Category:Finnish musicians Category:Rappers",
 "title": "Mercedes Bentso"
}