{
 "id": "854216",
 "text": "A bathhouse is a building where people can bathe. In some bathhouses, people put their whole bodies in the water. In others, people clean themselves using steam or even sweat. Bathhouses are usually communal, which means people take baths together and not alone. Some bathhouses are only about getting clean and other bathhouses are also a place for people to talk to each other. ==History== In the early 1900s, archaeologists found ruins of a bathhouse in Mohenjo-daro. This is in Pakistan today. The bathhouse was built around 2500 b.c.e. It was made out of bricks and it might have been part of a temple. Archaeologists found a Jewish mikveh from the 500s c.e. in ruins underneath Syracuse. By 300 BC, bathhouses called thermae were common in Ancient Roman towns. The Roman writer Tiberius Claudius Secundus wrote, \"Baths, drink and sex corrupt our bodies, but baths, drink and sex make life worth living.\" People in Japan and Korea have been using hot springs for bathing for thousands of years. People started bathing at the Dogo Onsen on Shikoku 3000 years ago. The Roman Empire and Byzantine Empire affected bathing in the Middle East. The Middle Eastern hammam bath is like a Roman bath: A place to get clean and to talk to other people. In the 600s and 700s c.e., the Umayyad caliphs built baths with mosaic decorations on the floors. In the Medieval period, there were many baths, called hammam in the Middle East. Baghdad may have had 60,000 bathhouses. Unlike in Roman baths, men and women did not bathe together. There were different places for men and women. In Medieval Europe most people who lived in towns went to bathhouses to bathe. The medical book Secreta Secretorum has a chapter on bathing. It said winter and spring were good times to bathe but that people should not bathe in summer. By 1200 AD, there were 32 bathhouses in Paris. Bathhouses were often right next to the town bakery so the heat from the ovens could make the water hot. In Germany in the 1400s, some people ate meals in baths. Sometimes bathhouses were brothels in disguise. When the disease syphilis reached Europe, bathhouses became less popular there. In the Victorian period a diplomat called David Urquhart went to the Ottoman Empire, where he saw Ottoman baths. He came back to England and built bathhouses there. A person called Sinan built many baths. Some were for rich people and some were to clean the poor. This happened before indoor plumbing, which let almost every house have its own bathtub. People in other countries built bathhouses near hot springs too. The most famous bathhouses in the United States may be Bathhouse Row in Hot Springs National Park Arkansas, eight buildings made between 1892 and 1923. In the United States, people built bathhouses, especially during the Progressive Era, when people thought the government should help people live better lives. Indoor plumbing and pipes had made it much easier to be clean. People in the United States thought of being clean as part of being a good person, so rich and middle-class Americans built bathhouses for poorer people. New York City opened the People's Baths in 1891. It was popular, so many other public bathhouses were built. However, these bathhouses were about getting clean, not relaxing. Bathers were not allowed to stay long, and there was no place in the bathhouse to relax or talk with other people. According to writer Mikkel Aaland, people in Africa south of the Sahara Desert built sweat lodges to make sick people well. Bathhouses became an important part of gay culture in the United States. The government ordered most of them closed after people in the United States caught AIDS in the 1970s and 1980s. ==Shape== Some bathhouses are cellular baths, meaning they have many smaller tubs. Other bathhouses are steam baths, with all the bathers sitting around something hot, like hot rocks or fire. ==Health== In many cultures, people said the bathhouse was good for the health. They especially said this about hot bathhouses, such as saunas and onsen. In Mesoamerica, people said the hot temazcal bath would heal the sick by making evil spirits leave. Scientists have done experiments to see if baths really do help human health. In addition to keeping the body clean, some types of steam baths or other hot baths can improve circulation, blood pressure and diseases of the nose and breathing. ==Types of bathhouses== *Sentō and onsen in Japan *Saunas in Finland *Sweat lodges for many groups of Native Americans *Banya in Russia *Jimjilbang in Korea *Hammam in many Muslim cultures *Temazcal and Chuj in Mesoamerica *Mikveh in Judaism *Thermae in Ancient Rome == References == Category:Hygiene Category:Buildings and structures by function",
 "title": "Bathhouse"
}