{
 "id": "854365",
 "text": "After the 7 July 2005 London bombings, the United Kingdom and other countries have made memorials to remember people who died in the bombings. Some foreign leaders also ordered flags to be put at half-staff in memory of those dead, signed books at embassies to show that they also were sad that the attacks happened and made statements supporting British people. ==United Kingdom== *The government ordered the Union Flag to be put at half-staff after the attack. * On 9 July, the Bishop of London hosted prayers for the victims of the bombers during a service remembering the role of women during World War II. * A two-minute silence for the victims of the bombings was held on 14 July 2005 around Europe. * On 14 July, thousands attended a memorial service at 18:00 on Trafalgar Square. After an early silence there were multiple different speakers for the next two hours. Chief Rabbi Sir Jonathan Sacks speaking of London said: \"It has the courage not to give terror the victory of making us angry and in our anger lose the values that make us what we are. Let that courage unite us now.\" Other speakers agreed with him on this. * A memorial service was held at St Paul's Cathedral, on 1 November 2005. * A two- minute silence was held at 12:00 BST on 7 July 2006 across the country to remember the people who died, or who were hurt in some way by the events. * A permanent memorial was opened by Charles, Prince of Wales on 7 July 2009, four years after the bombings, in Hyde Park, London. ::The memorial is often used as a place to remember the bombings on anniversaries. ==International== ===Remembrance books=== *New Zealand – In Auckland, Prince William of Wales signed a book to remember the victims at the British consulate. *United States – In Washington, DC, the U.S. Army band played God Save the Queen outside the British Embassy in Washington D.C.. Many flowers and notes were left at the embassy with messages such as, \"Today, we are all British\". US President George W. Bush went to the Embassy on 8 July after his return from the G8 summit, and signed the book that remembered the victims. On 12 July, a Detroit Symphony Orchestra brass group played God Save the Queen during the before game celebrations of the Major League Baseball All-Star Game at Comerica Park in Detroit. ===Flag half-staffing=== *Canada – All top government buildings and departments in Canada, including the Peace Tower, and in the United Kingdom. *New Zealand – Prime Minister Helen Clark suggested and asked for the flags in New Zealand fly at half staff the day following the bombings. *France – President Jacques Chirac suggested and asked for that flags in France fly at half staff for 3 days. ===Moments of silence=== * European Union – The European Parliament had a minute of silence to remember the victims of the explosions. *Poland – The Polish Parliament, Sejm lower house had a moment of silence. *Ireland – The Irish Government had a two-minute silence on Thursday 14 July, at the same time as in the United Kingdom. *Russia – Flowers were put out at the British Embassy in Moscow as a minute of silence was followed by both staff and local people, who held hands and formed a human chain to show they had the same feelings as the British people on 8 July 2005. ===Services=== *Spain – God Save the Queen was played during the change of the royal guard at Plaza de Oriente in Madrid in memorial to the victims of the attack. The British Ambassador, and people in the Spanish Royal Family were there. After the Madrid train bombings, the UK hosted a similar ceremony at Buckingham Palace. *Australia – God Save the Queen was sung at a service at St. Andrew's Cathedral, Sydney. Prime Minister John Howard read part of the bible and Phillip Jensen gave a sermon on the problem of evil and what the Bible says about this. ==References== Category:July 2005 London bombings",
 "title": "7 July 2005 London bombings memorials and services"
}