{
 "id": "854557",
 "text": "American Bully is a breed of dog which is a cross between a Staffordshire Bull Terrier, American Bulldog, French Bulldog and a Red-Nose Pitbull. These dogs were initially made for protection but some people now use them as house pets due to their loving nature and friendly personalities. Some American bullies are either pocket, standard/classic, XL or extreme. The breed was recognised in 2013 in the UK if a person wants one they need to have ABKS paper or this would be against the law because these dogs are EBKC (European Bully Kennel Club) which means it comes from Europe. == Origin == The American Bully breed was established in the mid-1990s with the purpose of creating the ultimate family companion. The American Bully was created through years of selective breeding by combining the desired traits of the UKC American Pit Bull Terrier and the AKC American Staffordshire Terrier. Some lines have added other bully breeds into the mix and sometimes non bully breeds. The American Bully's origins can be seen both on the East and West Coast of the United States, primarily in Virginia and Los Angeles, California and is spreading to all parts of the U.S. Today the American Bully can also be seen in Europe and Asia. The American Bully, also called the Bully Pit, Bullypit and the Bully Pitbull, is often confused with the American Pitbull Terrier but is clearly a different breed. ==Health== The American Bulldog has a life expectancy of 10 to 16 years. Some have medical conditions such as cataracts, or hypothyroidism. If they suffer from obesity early in life, they may develop hip or elbow problems. American Bully’s have great personalities and are often laid back and very friendly. Although we have seen a rise in suspected XL Bully “type” attacks, the only thing really lethal about them is the gases which explode from their backends. ==Merle American Bullies == Merle Bullies can produce any colour and have a complicated gene. Two American Bullies should never be bred together because the puppies may be born disabled or with disabilities because of the colour and the genes. Merle bullies don't need ebkc registered papers because they are from every country and also could be found in American or the whole off USA. == References == Category:Dog breeds originating in the United States",
 "title": "American Bully"
}