{
 "id": "85466",
 "text": "Kourken Megerdich Yanigian (, December 24, 1895, Erzurum, Ottoman Armenia - March 27, 1984, USA) was an Armenian terrorist who killed two Turkish consular officials in California in 1973.Imprisoned Armenian Dies, New York Times, March 1, 1984 His stated purpose was \"to demand justice\" for the Armenian Genocide. Armenians hoped Yanigian's trial would provide a vehicle for proving the massacres in a court of law, while there were still surviving witnesses. Yanigian took the Armenian Genocide witness stand, accompanied by his friend and interpreter, Santa Barbaran Aram Saroyan, the uncle of famous author William Saroyan. Yanigian told of his 26 family members killed in the massacres, and how he watched in hiding as marauding Turks slit his brother's throat. Finally, he said that he killed the Turkish diplomats as representatives of the \"government that had massacred his people\". He was sentenced to life in prison in July 1973 and paroled in 1984, over the objection of the Turkish government.Murder Will Out? District Attorney Regrets Not Allowing Genocide Testimony at Murder Trial, By David D. Minner // The Independent, Apr 2, 1998 After Yanigian's death, District Attorney David D. Minner wrote: ==Books== ===in English=== * The Triumph of Judas Iscariot, Los Angeles: Research Publ. Co., 1950, 254 p. * The Resurrected Christ: A Novel, New York: Exposition, 1955, 141 p. * Harem Cross: A Novel of the Near-East, 1953 * The Voice of an American, 1960 * Mirror in the Darkness, 1966 ===in Armenian=== * Purpose and Justice (memoires from the prison), Yerevan, Tigran Mets Publ., 1999 ==Related pages== * Armenian Secret Army for the Liberation of Armenia ==References== ==Other websites== *People v Yanikian *Historische Romane – XY, Books by Gourgen Yanikian *GUIDE TO SANTA BARBARA AUTHORS AND PUBLISHERS: Yanikian, Gourgen (1895-1984) *Yanikian and his memoires Category:1895 births Category:1984 deaths Category:Armenian writers Category:Terrorists",
 "title": "Gourgen Yanikian"
}