{
 "id": "854713",
 "text": "The coronavirus disease 2019 (COVID-19 for short) affects females and males much differently both in terms of the infection outcome and the actual effect of the disease in society. Females do sometimes die from COVID-19. Males, though, have higher chances of dying from the condition. That is because men and boys are more likely to have severe cases of COVID-19 when infected. Slightly more males than females end up getting COVID-19. ==The gender differences in mortality== The highest risk of COVID-19 for males is during their 50s though the condition can affect anybody at any age. The gap between males and females closes near age 90. The death rate for China was about 2.8% for males and 1.7% for females. However, for several countries including Slovenia, Vietnam, Nepal and India, females are more likely to die than males. The reasons for this difference are not known. However, genetic, social and behavioral factors may play a part. The fact that women are smoking far less often than men and males often developing multiple health conditions at one time, like hypertension and diabetes at younger ages than females, may have contributed to the higher death rates for males. Since both professional and home care related affairs are more common for women, however, the may have a greater infection rate than men in some places. In Spain, for example, healthcare workers were affected more with COVID-19 than almost anybody else. The fact that females are more likely to live longer than males indicates a larger group of women and girls are under risk for getting the condition. Females from certain racial groups, who are older or have obesity to a certain level are more likely to have severe illness when the condition infects them. ==The impact on health== Across the world, females make up just over 70% of the workers in the health or social sector. Almost 90% of the healthcare workers in and around the Hubei province of China (from which the disease first got started) were female. In the United States, about 78% of the healthcare workers were female. Women play strong roles for responding to the disease. This includes women who are front line healthcare workers, caregivers at home, community leaders and mobilizers. Making matters worse, females are always paid much less than the males in almost all countries. Females also hold fewer leadership positions in health sectors. Masks and other protective equipment designed for males leave females under greater risk for exposure to COVID-19. Women and girls, having already faced health and safety problems in managing their sexual and reproductive health and their menstrual hygiene without access to proper and clean water or private toilets before the crisis started are especially in danger. When the medical and healthcare systems are given more work than they can handle and the resources are redistributed to respond to the pandemic, this interferes with health services that are important to the well-being for women and girls. This includes the pre- natal/post-natal healthcare, access to quality sexual and reproductive health services, life-saving care and support for those who survived gender-based violence. Women are also not visiting hospitals or healthcare facilities for fears of being exposed to COVID-19 and for movement restrictions. ==Gender- based violence== Due to increased tension in households during a pandemic, women and girls are under higher risk for being the victims of intimate partner and domestic violence. During periods of lockdown, women who experience domestic violence have very limited access to protective services. ==References== Category:Women Category:Domestic violence Category:COVID-19 pandemic",
 "title": "Gendered impact of the COVID-19 pandemic"
}