{
 "id": "854855",
 "text": "Robo Vampire (fully titled as Robo Vampire 1: The Return) is a 1988 Hong Kong sci-fi action movie directed by Godfrey Ho. This film is both the prequel to \"Devil's Dynamite\" and the second installment of the Robovamp trilogy. Footage lift from Against the World an 1984 Thai action movie. Featuring the characters Tom Wilde/Robo Warrior played by Harry Miles. ==Summary== Narcotics agent Tom Wilde is given a second chance at life after being shot and killed. In a futuristic experiment, agent Wilde is returned to life as an Android Robot. He is sent on a very dangerous mission into the depths of the golden Triangle to rescue Sophie, a beautiful undercover agent who has been captured by the evil drug warlord Mr. Young and his inhuman creation the Vampire Beast. ==Other films== ===First film=== Devil's Dynamite is the 1987 original film that is sometimes billed as Robo Vampire 2: Devil's Dynamite or Robo Ninja VS Vampires. Steve (Tsung Hua) is a gambler getting out of prison and looking to get revenge on Mary (Angela Mao), the crime boss who sent him to the clink. Also on Mary's trail is Alex (Ling Yun), a police officer who has the ability to turn into the silver lame-swaddled hero Shadow Warrior. So, as any sane person would do, Mary hires an evil Taoist priest to create a group of vampire assassins to protect her - An extremely strange film that mashes up vampires, ninjas and superheroes. ===Third film=== The Vampire Is Still Alive the 1989 loose threequel that is sometimes billed as Robo Vampire 3: Counter Destroy. The film's plot elements were taken from Wes Craven's A Nightmare on Elm Street (1984). The plot centers on a scriptwriter called Joyce who goes to an isolated rented villa to write her magnum opus about the last Emperor of China, but other film companies want to prevent this biopic from being made and will resort to murder to get their way. To make matters more bizarre, the plot also involves hopping vampires, a crosseyed Taoist priest, a possessed phone, ninjas with automatic weaponry, poisoned lipstick, a Freddy Krueger- like antagonist, a fortune-telling sacred bird, a muscular zombie-vampire that leaves sparkling footprints, an explosive bouquet of flowers, the ghost of a Ching Dynasty eunuch, and the titular silvery cyborg hero: Robo Vampire. ==References== ==Other websites== * *Robo Vampire on RetroFlix Category:1988 action movies Category:1988 comedy movies Category:1988 science fiction movies Category:1988 horror movies Category:Hong Kong action movies Category:Hong Kong comedy movies Category:Hong Kong science fiction movies Category:Hong Kong horror movies Category:Robot movies Category:Movies directed by Godfrey Ho",
 "title": "Robo Vampire"
}