{
 "id": "854827",
 "text": "Compo LLC is a company which makes equipment for the meat processing and dairy industries. The head office is located in Brest, Belarus. The name Compo comes from 2 words \"composite materials\", as the company began with production of plastic parts for the carpet and weaving industry. It made plastic and metal windows, and sandwich panels. Currently, the focus is on the production of equipment for the meat and dairy industries under the Kaizen system. The COMPO enterprise was founded in 1991 by Mikhail Bilousov. Over the years, the company's production has expanded: 1993, production of solenoid valves to cut off the supply of liquid fuel to the burners of ship boilers; 2003-2007, development of new technologies of equipment for the production of sausage products, work with minced meat, bakery products, as well as devices for marking, washing containers, etc. Over the years, COMPO has participated in international exhibitions of equipment for the food industry in Kiev (Ukraine), Moscow (Russia), Frankfurt (Germany). In 2010 Bilousov was awarded the diploma \"Person of the Year of Brest\" in the field of environmental protection, and in 2018 - \"Person of the Year of Brest\" in industry. In 2020 Ella Mikhailovna Dzhangozova, the daughter of the founder, took over the position of director. The company is a supplier of equipment to Russia, Belarus, most of post Soviet countries, as well as Canada, Poland, Turkey, Australia, Bulgaria, Serbia, Algeria, Slovakia, Mexico, Ecuador, Dominican Republic. Compo is engaged in the development of the educational and entertainment center \"Polyanka\", as well as helps the boarding school in Zhabinka and the lyceum in Brest. == Awards == The company was awarded the Prize of the Government of the Republic of Belarus and the Prize of the Brest Regional Executive Committee for achievements in the field of quality, introduction of highly effective methods of quality management and ensuring on this basis the production of competitive products. Compo has a diploma of a finalist of the 2nd International Quality Tournament of Central and Eastern Europe according to the EFQM model (European Foundation for Quality Management) and a Certificate of Excellence for 4 stars according to the EFQM model. By the Decree of the President of the Republic of Belarus No.279 dated April 28, 2006, the enterprise was entered on the Republican Board of Honor of the winners of the 2005 competition. == References == == Other websites == *Official site in Russian *Official site in English Category:1991 establishments in Europe Category:Companies of Belarus Category:Brest, Belarus",
 "title": "Compo LLC"
}