{
 "id": "855024",
 "text": "The University of Leipzig Medical Center is one of the oldest university hospitals in Germany. With 1,450 beds and over 6,000 workers (including the medical faculty) in 29 clinics and polyclinics, eight institutes and seven departments, it is the largest hospital in Leipzig, Saxony. == Locations == Most of the facilities at the University Hospital are located on their own premises southeast of the city center in the Zentrum-Südost district - the Medical Quarter or Clinic Quarter on Liebigstrasse. The boundaries are Johannisallee, Sternwartenstrasse, Nürnberger Strasse and Philipp-Rosenthal- Strasse. The clinics can be reached by local public transport operated by LVB and by S-Bahn from the Bayerischer Bahnhof, Ostplatz and Johannisallee stops. Other locations include Semmelweisstrasse and Härtelstrasse. == History == The medical faculty of the Leipzig University was founded in 1415, a few years after the university itself was founded in 1409. As at all European universities, medical knowledge was initially disseminated in a purely theoretical manner. The first step towards modern, scientifically based medicine was taken in 1704 with the establishment of the first anatomical theater by Johann Christian Schamberg. In 1799 the \"Institute for Clinical Education\" was founded in the Jakobshospital, where patient examinations, surgical demonstrations and dissection exercises took place for the first time. Johann Christian August Heinroth was appointed to the world's first chair for \"psychological therapy\" (psychiatry) in 1811. The current main location of the medical faculty in Liebigstrasse was founded in 1871 by Carl Reinhold August Wunderlich and Carl Thiersch as the “St. Jakob Municipal Hospital”. In 1889 the landmark of the medical district was opened with the “Red House”. In the period from about 1880 to the Second World War, medicine experienced its greatest heyday at the University of Leipzig. With researchers like Paul Flechsig, Carl Ludwig and Wilhelm His, Leipzig was one of the world's leading centres of scientific teaching and research. In 1891 Otto Heubner founded the University Children's Clinic. Large parts of the medical district were destroyed during World War II. The first post-war building was opened in 1956 with the Institute for Anatomy; all other institutes were gradually rebuilt. In 1953 the St. Jakob Hospital was transferred to the university. The department for inpatient psychotherapy and psychosomatic medicine, founded in 1953, was one of the first in Germany. Almost all clinics and institutes have been built or completely renovated since 1990. The hospital, which founded the first clinic for cardiovascular surgery in Europe in 1961, no longer has its own cardiac surgery department, as the private heart center in Leipzig in the Probstheida district has been a university clinic since 1994, according to a contract between the State of Saxony and Rhön-Klinikum AG. Up to the opening of the Center for Conservative Medicine in November 2008, around 350 million euros had been invested in the Liebigstrasse location. By around mid-2009, all departments moved from the old ward block to the new clinic buildings. The hospital building built in 1983 was demolished in 2013, and new buildings will later be built on the area.Mario Beck: Aus fürs Bettenhaus in Leipziger Volkszeitung, 21. Juli 2011 == Medical treatment == It is a maximum care hospital. It has 1,350 fully inpatient and 101 part inpatient beds. In 2018, 374,020 outpatients and 56,591 inpatients were treated. The turnover in 2018 was 457 million euros. The hospital has several certified treatment units: the largest stroke unit in Saxony (12 beds), a colon cancer center and one of the first skin cancer centers in Germany.Zeitung der Universitätsklinik Leipzig vom 1. April 2010 (PDF; 57 kB) The José Carreras Transplant Unit at the Department of Hematology and Internal Oncology is one of the best-known funding beneficiaries of the German José Carreras Leukemia Foundation. == Research == The main research areas of the University Hospital are neurosciences, endocrinology, immunology, molecular oncology and psychosocial medicine. There are collaborations with a number of local research institutes such as the Max Planck Institute for Cognitive and Neurosciences, the Max Planck Institute for Evolutionary Anthropology, the Fraunhofer Institute for Cell Therapy and Immunology, the Helmholtz Center for Environmental Research - UFZ and Bio City Leipzig. == Blood bank == In 1962 the district institute for blood donation and transfusion was founded, which in 1991 merged with the university blood donation service to form today's institute for transfusion medicine. The blood bank brand was introduced in 2002 to differentiate the institute from other blood donation services. With 92 employees, it has two branches in Grünau and Paunsdorf in addition to the institute's location in the clinic district and an acceptance point in the north (Gohlis Park). There are also around 160 external appointments in the region every year. As the largest university facility for transfusion medicine in Germany, the blood bank collects 55,000 whole blood donations, 12,000 plasma donations and 5,400 platelet donations every year. auf den Seiten der Universitätsmedizin Leipzig (abgerufen am 21. Januar 2011) == Organ donation scandal == At the beginning of January 2013 it became known that there had been irregularities in the allocation of donor organs in 2010 and 2011 at the hospital. The investigative commission of the German Medical Association and the internal auditing department of the hospital found that the health status of at least 37 of 54 patients had been deliberately shown worse in the context of liver transplants, so that they could be assigned a replacement organ more quickly. In the course of the investigation, the chief physician of transplant surgery and two senior physicians were given leave of absence. In July 2015, after the investigation was completed, the Leipzig public prosecutor brought charges against the two senior physicians, as they allegedly manipulated patient files in 2010 and 2011. The preliminary investigation against the clinic's chief physician was discontinued without any conditions; no involvement was proven. == References == == Other websites == * Category:Buildings and structures in Leipzig Category:University hospitals in Germany Category:1410s establishments",
 "title": "University of Leipzig Medical Center"
}