{
 "id": "855151",
 "text": "During the partition of India, Pakistan got those areas which were less industrially developed. Hindus were big industrialists and capitalists. Not many factories were in Muslim-majority areas. In those places raw materials were available. Yet these areas were kept away from industry. In East Bengal, the production of Puttsun was 50% of the total world production. However, not a single Puttsun factory was set up there. On the other hand, in West Bengal, more than a hundred Puttsun factories were operating on the Hugli River Cup. Cotton was grown in West Punjab. The textile mills were established in Mumbai and Ahmedabad. At the time of independence in Pakistan there were cotton, sugar and a total of seven cement, factories. Pakistan started its industrial development on a weak basis. The Pakistani government tried to establish a strong industrial system. An industrial policy was announced in 1948, which encouraged the private sector. In 1972, the government nationalized ten types of factories. This created uncertainty in the private sector. Capitalists were reluctant to invest in industry. The subsequent government made state- controlled factories private in the same way. In addition, the private sector paved the way for setting up new factories and investing in them. == Industries == Industries in Pakistan are divided into the following categories * (1) Domestic and small scale industries * (2) Large industries * (3) Defence industries == Small home industries == Small and cottage industries are very important because they provide employment at the local level. They cost less to set up and the administrative structure is small. When the focus is on small and cottage industries, human migration from the countryside to the city will be reduced. Small and cottage industries have a significant role to play in Pakistan. Thousands of people work in them which strengthens the country's economy. (1) blanket making. *Pakistan has raw materials for making blankets. There are many blanket factories in the cities of Punjab Lahore, Sheikhupura, Faisalabad, Multan and Jhang. In Sindhi the blanket is called carpet. The cities of Sindh include Jakmabad, Sukkur, Khairpur, Mirpur Khas, Umerkot, Tharparkar, Hyderabad and Based in Karachi. Blankets are widely made in Peshawar. There are blanket making industries in Quetta. Very beautiful and beautiful blankets are made in Pakistan which are very popular in Brown country. (2) Cotton imprint: *It is an important and major industry in small domestic industries. It also includes hand stitching. The net of which is spread in every part of Sindh and Punjab. The number of people hand sewing is in the tens of millions. This industry is a major source of local employment. Sutri sewing beautiful jackets and sutri sheets, bed sheets, sutri longi etc. are made. In Punjab it is located in Faisalabad, Multan, Lahore, Gujranwala, Sargodha and Sialkot, and in Sindh Hyderabad, Sukkur, Jakimabad, Kashmore and Ghotki. (3) Leather making factory: * Leather making is an important industry in Pakistan. Boots, suitcases, vases, handbags and other leather goods are made in different parts of the country including Karachi, Hyderabad, Lahore, Sialkot, Gujranwala, Sheikhupura, Multan, Peshawar and Swat. There are also tanneries in Balochistan. (4) Sports equipment: * The manufacture of sporting goods requires a soft type of wood and leather. Sporting goods are widely manufactured in Lahore and Sialkot. Pakistan earns foreign exchange by selling these goods. Pakistan-made hockey, cricket bats and ball, football and racquets are very popular in foreign countries. (5) Cutlery or cutting tools: * Cutlery includes cups, scissors, spoons and knife etc. Wazirabad, Sialkot, Gujranwala, Gujarat and Lahore make various cutlery items. (6) Sewing: * Sewing is a source of great value and status for Pakistan. This is a popular art of Pakistan. Flower berths made of silk thread are very popular which draws people to it. Sewing has been a common practice in Sindh since ancient times. European and Gulf countries used to come through Sindh to trade in sewn goods. This work is in Sindh, Balochistan, Punjab, Khyber Pakhtunkhwa, and cities of Gilgit-Baltistan and Kashmir. In Sindh and Balochistan, hats are made by weaving small pieces of moss on cloth with silk thread, and hats are widely used. This is called Sindhi and Balochi art. The main centers are Larkana, Dadu, Shikarpur, Nawabshah and Khuzdar. This is a special skill of the families of Balochistan and Sindh. \"Salmi Sattar\" works in major cities of Sindh and Punjab. Flower stitches, leather stitches are gold. The cities of Khyber Pakhtunkhwa include Peshawar, Dera Ismail Khan, Kohat and Nowshera. == Large industries == (1) The textile industry is the backbone of Pakistan's economy. These factories produce the best quality fabrics. Pakistan is self- sufficient in cotton cloth. Millions of rupees are earned every year by selling these clothes abroad. Special centers for the textile industry are Faisalabad, Lahore and Multan, Karachi and Hyderabad. It also occurs in Peshawar, Dera Ismail Khan, Nowshera, Bannu, Haripur, Swat, and Athal and Quetta. There are now more than 500 industrial factories in Pakistan. There were only 3 factories in 1947. There are also woollen factories in Pakistan. But cotton is no match for textile mills. The main reason is that low quality in Pakistan is obtained from it. It is used to make more wool or blankets. Major woollen factories are located in Karachi (Sindh), Lawrencepur (Rawalpindi), Lahore, Quaidabad (Punjab), Harnai and Bannu. There are currently 70 woollen factories in Pakistan. Lawrencepur and Karachi factories produce high quality woollen cloth. There are also silk industries in Pakistan. There are two types of silk used in the manufacture of silk fabrics. Natural silk is obtained from silkworms. Hathrado silk is synthetic. Natural silk is very expensive. That's why people love artificial silk fabrics. A synthetic silk factory operates in Karib Kala Shah Kaku, Lahore. Synthetic silk is called Rayon. Silk thread and raw silk are imported from brown countries. Karachi is a major hub for the silk industry. Silk factories have been set up in Faisalabad, Lahore, Multan, Gujranwala, Peshawar, Swat, Sukkur, Hyderabad and Ghotki. (2) The sugar industry is of great importance in Pakistan. In 1947, two sugar factories were set up, one at Karib Rahwali in Gujranwala and the other at Takht Bai. Sugarcane is produced on a large scale in Punjab, Sindh and Khyber Pakhtunkhwa. There are 78 sugar factories in the country. (40 in Punjab, 32 in Sindh, 6 in Khyber Pakhtunkhwa). The production capacity of all these factories is 5 million tons. Pakistan is not only self- sufficient in sugar but also sells it to foreign countries. (3) Cement factory: Gypsum is used in the manufacture of cement. Pakistan has large deposits of Chen stone and gypsum. That is why so many cement factories have been set up. They are operating under the regulations of the Pakistan State Cement Corporation. Cement factories are operating in the lower areas of Pakistan: *Federal Territory = Islamabad * Punjab = Dhandwat, Wah, Dawood Khel, Rawalpindi, Dera Ghazi Khan * Sindh = Karachi, Hyderabad, Thatta, Nooriabad and Rohri. * Khyber Pakhtunkhwa = Kohat, Haripur and Nowshero * Balochistan = Darwaza and Gadani Cement production in Pakistan is almost self- sufficient. In 1947, there was only one cement factory. There are currently 25 cement factories operating in the country. 21 factories are operating in the private sector and 4 factories are operating in the public sector. The capacity of these factories is 17.7 million tons. (4) Chemical fertilizer factory: These factories produce different types of fertilizer. Chemical fertilizer is more than required in Pakistan. The remaining fertilizer is sent to foreign countries. Chemical fertilizer factories are in Sindh Dharki and Mirpur Mathelo, and Punjab in Sheikhupura, Sadiqabad, Rahim Yar Khan , Multan, Faisalabad, Gujranwala and Haripur. Their production capacity is 5.6 million tons. == Defence industries == The defence industries include iron and steel mills, heavy mechanical complexes and shipbuilding plants. (1) Iron and steel factory: Cast iron is obtained from Kala Bagh, Makarwal (Punjab), Langarial, Khuzdar, Ziarat, Chal Ghazi and Nok Kundi (Balochistan). The iron ore found there is less than the country's needs. Large iron and steel mills are located in Karachi and Taxila. (A) Pakistan Steel Mill Karachi:The mills have been set up near Bin Qasim Port, 40 km from Karachi. Work on the mill began in 1973 with the help of Russia. It produces pig iron, iron sheets, coal wire, and more. Thousands of people work in this mill. (B) Heavy Mechanical Complex, Taxila: This was established in 1968 in collaboration with China. Machinery, trucks, and spare parts for the railway engine, sugar, cement, textile and fertilizer factories are manufactured here. Imports of steel and machinery have fallen sharply since the Taxila complex began. (2) Karachi Shipyard and Engineering Works: This was established in 1956. In addition to shipbuilding, fish fishing fleets, shipwrecks, and ships from other countries are repaired. The shipbuilding industry in Pakistan has developed very well. (3) Weapons and the military equipment industry: The weapons factory is located in Wah, near Islamabad. Air defence equipment is manufactured in Havelian, Khyber Pakhtunkhwa, and Kamra, Punjab. Defense Machinery is made in a machine tool factory located in Landhi Karachi. Missiles are also manufactured in Pakistan. Pakistan is self-sufficient in making formal or modern weapons and ammunition. == Reference == Category:Economy of Pakistan",
 "title": "Industrial development in Pakistan"
}