{
 "id": "855119",
 "text": "The Matilda effect is a type of bias. ==Overview== The Matilda effect is when a female scientist does something but people think a male scientist did it. Sometimes people do this on purpose, like when a professor steals a female student's research and puts his own name on the paper. Sometimes people do this without thinking about it. ==History== Suffragist and abolitionist Matilda Joslyn Gage (1826 – 98) was the first person to write about this effect in an essay called \"Woman as Inventor.\" It was first published as a tract in 1870 and in the North American Review in 1883. The term \"Matilda effect\" was started in 1993 by science historian Margaret W. Rossiter. Rossiter wrote about several times when the Matilda effect had happened in real life. Trotula, also known as Trota of Salerno, a 12th-century Italian female physician, wrote books which, after her death, were rewritten with male authors' names on them. Nineteenth- and twentieth-century cases of the Matilda effect include those of Nettie Stevens, Lise Meitner, Marietta Blau, Rosalind Franklin, and Jocelyn Bell Burnell. ==Comparison== The Matilda effect was compared to the Matthew effect. The Matthew effect is when a famous scientist gets more credit than a less famous scientist even if they both did the same work. ==Research== In 2012, two woman researchers from Radboud University Nijmegen looked at men and women who were being picked to be professors at universities. They found the people choosing who would become a professor were affected by whether the person they were looking at was a man or a woman. Two other studies (done in Italy and Spain) showed the same thing. Some other studies found no difference between the number of times men and woman researchers' papers had been named as sources in other papers. Swiss researchers found that when people in mass media (like newscasters), want to put a scientist on their show, they talk more to male scientists than to female scientists. According to one U.S. study, \"although overt gender discrimination generally continues to decline in American society ... women continue to be disadvantaged with respect to [who is given] scientific awards and prizes, particularly for research.\" ==Examples== The oldest examples of the Matilda effect date back to the Iron Age. ===Iron Age=== Theano of Crotone was an early philosopher in the 6th century BC. She did work in mathematics, but people thought her husband Pythagoras,Biographies of Women Mathematicians https://www.agnesscott.edu/lriddle/women/theano.htm her father, or her teacher had done all the work (sources disagree).History of Scientific Women https://scientificwomen.net/women/crotone-theano_of-90 ===Middle Ages=== Trotula (Trota of Salerno) was a 12th-century Italian physician. After her death, people claimed that her husband and son wrote her work. Later, monks confused her name with that of a man. Some people were so against women being teachers and healers that they said Trotula had never really lived. She is not in the \"Dictionary of Scientific Biography\". ===Modern age=== ==== 1700s ==== Jeanne Baret (1740 – 1807), a French botanist, was the first woman to travel all the way around Planet Earth. Partner and collaborator of the botanist Philibert Commerson, she joined the expedition of Louis-Antoine de Bougainville disguised as a man. They collected the first specimens of Bougainvillea plants. Commerson got sole credit for most of the team's botanical discoveries, and about a hundred species have been named after him. Much later, Baret was immortalized for the first time with the description of in 2012.Tepe E, Ridley G, Bohs L (2012) A new species of Solanum named for Jeanne Baret, an overlooked contributor to the history of botany. PhytoKeys 8: 37-47. https://doi.org/10.3897/phytokeys.8.2101 ==== 1800s ==== Nettie Stevens (1861 – 1912) discovered how chromosomes make living things male and female. Her studies of mealworms showed for the first time that a living thing's sex is caused by its chromosomes and not by its environment. Stevens greatly influenced the scientific community's transition to this new idea: chromosomal sex determination. However, Thomas Hunt Morgan, a distinguished geneticist at the time, is generally credited with this discovery. Even though she did a great deal of work in genetics, Stevens' contributions to Morgan's work are often disregarded. Mary Whiton Calkins (1863 – 1930) was a Harvard University scholar. She discovered that stimuli that were given to a test subject at the same time as other stimuli would be easier for that person or animal to remember. She also found that subjects remembered things better if they saw or otherwise experienced them for a longer time. Georg Elias Müller and Edward B. Titchener used Calkins' research findings for their own work without giving her any credit. ==== 1900s ==== Gerty Cori (1896 – 1957) was a Nobel-laureate biochemist. She worked for years as her husband's assistant, even though they were both equally qualified for the job. Rosalind Franklin (1920 – 58) is now recognized as an important part of the 1953 discovery of DNA structure. Francis Crick and James Watson both won the 1962 Nobel Prize, and they did not tell people how they had used Franklin's research findings to help their own work. In 1968, Watson talked about how important Franklin was in his book The Double Helix. Marthe Gautier (born 1925) helped discover that Down syndrome is caused by a problem with the 21st chromosome. People used to think Jérôme Lejeune discovered this alone. Marian Diamond (born 1926), discovered brain plasticity (the ability for the brain to change and adapt over time) while working at the University of California, Berkeley. Before that, scientists thought the brain could not change over time. When her 1964 paper was about to be published, she saw that the names of her two secondary teammates, David Krech and Mark Rosenzweig, had been placed before her name, and her name was only there in parentheses. She protested that she had done the essential work described in the paper, and her name was then put in first place without parentheses. This problem is addressed in a 2016 documentary film, My Love Affair with the Brain: The Life and Science of Dr. Marian Diamond. Harriet Zuckerman (born 1937) was also credited by husband Robert K. Merton as co- author of the concept of the Matthew effect. Several woman did large parts of computer programming for ENIAC (dedicated 1946). These included Adele Goldstine, Kay McNulty, Betty Jennings, Betty Snyder, Marlyn Wescoff, Fran Bilas, and Ruth Lichterman. However, most histories of ENIAC have not talked about their work. Instead, they focus on hardware accomplishments rather than software accomplishments. === Nobel Prizes === On numerous occasions, men scientists were awarded Nobel Prizes while their women colleagues were not. ==== 1900 - 1950 ==== In 1934, the Nobel Prize in Physiology or Medicine was awarded to George Whipple, George Richards Minot, and William P. Murphy. They said their female co-worker, Frieda Robscheit-Robbins, should have gotten the award with them but didn't because she was a woman. Whipple shared the prize money with her because she was co-author of almost all of Whipple's scientific papers. In 1944 the Nobel Prize in Chemistry was given to Otto Hahn as the sole recipient. Lise Meitner had worked with Hahn and had laid the theoretical foundations for nuclear fission (in fact, she created the term \"nuclear fission\"). Meitner was not recognized by the Nobel Prize Committee, partly due to her gender and partly due to her persecuted Jewish identity in Nazi Germany. At the time, the Nazis' Law for the Restoration of the Professional Civil Service prohibited Jews from holding government-related positions, including in research. Initially, her Austrian citizenship shielded her from persecution, but she fled Germany after Hitler's annexation of Austria in 1938. ==== 1950s ==== In 1950, Cecil Frank Powell received the Nobel Prize in Physics for his development of the photographic method of studying nuclear processes and for the resulting discovery of the pion (pi-meson). Marietta Blau did pioneering work in this field. Erwin Schrödinger had nominated her for the prize along with Hertha Wambacher, but both were excluded. In 1956 two American physicists, Tsung-Dao Lee and Chen Ning Yang, predicted the violation of the parity law in weak interactions and suggested a possible experiment to verify it. In 1957, Chien-Shiung Wu performed the necessary experiment in collaboration with National Institute of Standards and Technology and showed the parity violation in the case of beta decay. The Nobel Prize in Physics in 1957 was awarded to the male physicists and Wu was omitted. She received the Wolf Prize in 1987 in recognition for her work. In 1958, Joshua Lederberg shared a Nobel Prize in Physiology or Medicine with George Beadle and Edward Tatum. Microbiologists Joshua Lederberg and his wife Esther Lederberg, along with Beadle and Tatum, developed replica plating, a method of transferring bacterial colonies from one petri dish to another, which is vital to current understanding of antibiotic resistance. However, Esther Lederberg was not recognized for her vital work on this research project even though her contribution was crucial to the successful implementation of the theory. Furthermore, she did not receive recognition for her discovery of the lambda phage or for her studies on the F fertility factor that created a foundation for future genetic and bacterial research. ==== 1960s to today ==== In the late 1960s, Jocelyn Bell Burnell (born 1943) discovered the first radio pulsar. For this discovery, in 1974 a Nobel Prize in Physics was awarded to her supervisor Antony Hewish and to Martin Ryle, citing Hewish and Ryle for their pioneering work in radio-astrophysics. Jocelyn Burnell was left out. A Ph.D. student at the time of her discovery, she felt the intellectual effort had been mostly her supervisor's. However, several prominent astronomers criticized the decision to excluse her from the award. These astronomers included Sir Fred Hoyle and Iosif Shklovsky. (Shklovsky was the recipient of the 1972 Bruce Medal at the 1970 International Astronomical Union's General Assembly.) ===Other=== Ben Barres (1954–2017), a neurobiologist at Stanford University Medical School, is a trans man. He began to live as a man when he was 42 years old. He reported that people thought his research was better when they thought he was a man. Someone even said \"His work is much better than his sister's\" because they thought \"Barbara Barres\" was his sister and not his own old name. This is one time when the Matilda effect worked on the same person at different times in that person's life. ==Related pages== * Matthew effect * History of science * History of technology ==References== Category:Bias Category:Feminism Category:Sociology Category:Psychology Category:Social sciences",
 "title": "Matilda effect"
}