{
 "id": "855470",
 "text": "Ignace Joseph Pleyel (French: [plɛjɛl]; German: [ˈplaɪl̩]; 18 June 1757 – 14 November 1831) was an Austrian-French composer and piano builder. == Life == Pleyel was born in Ruppersthal in Austria in a family of a schoolmaster Martin Pleyl.Ignaz Joseph Pleyel. Biography. \"Internationale Ignaz Joseph Pleyel Gesellschaft\". In 1772 he became a student of Joseph Haydn. In 1783 Pleyel moved to Strasbourg to work with Franz Xaver Richter, the maître de chapelle at the Strasbourg Cathedral.Mathorez, Jules. Les Allemands, les Hollandais, les Scandinaves. Histoire de la formation de la population française : les étrangers en France sous l'ancien régime, 2. Paris: Champion, 1921. In 1788 Pleyel married Françoise-Gabrielle Lefebvre and had four children with her. In 1797 he started a business as a music publisher (\"Maison Pleyel\") in Paris.Benton, Rita (1979). \"Pleyel as Music Publisher\". Journal of the American Musicological Society. 32 (1): 125–140. The company published about 4,000 works during 39 years. Pleyel composed more than 40 symphonies, 70 string quartets, several operas, piano solo pieces and chamber music.Hill, Cecil (1980). \"Masonic music\", in The New Grove Dictionary of Music and Musicians, ed. Stanley Sadie, vol. 11, 753-756 He also was a founder of a piano firm Pleyel et Cie that was continued by Pleyel's son Camille. The firm provided pianos for Frédéric Chopin. The composer was very fond of Pleyel's instruments.Chopin's letters. By Chopin, Frédéric, 1810-1849; Voynich, E. L. (Ethel Lillian), 1864-1960; Opienski, Henryk, 1870-1942 In 2009 a replica of the 1830 model of Pleyel's piano was built. Now it is in the collection of Fryderyk Chopin Institute in Warsaw. It was also used in the 1st International Chopin Piano Competition on Period Instruments. == References == == Other websites == * Website of the Ignaz Pleyel Museum (in German) * Pleyel Pianos - The Piano in Polish Collections * Free scores by Ignaz Pleyel at the International Music Score Library Project (IMSLP) * Pleyel in the grand piano - Photo Archive * Paul McNulty copy of Pleyel piano from 1830 Category:1752 births Category:1826 deaths Category:Piano makers",
 "title": "Ignaz Pleyel"
}