{
 "id": "855648",
 "text": "The COVID-19 pandemic first started affecting New York City and its nearby areas in mid-February 2020. It wasn't until March, however, that the COVID-19 virus was confirmed in and around New York City. On March 3, 2020, the New York State Governor Andrew Cuomo announced that the first recorded case of person-to-person spread in New York State was confirmed from a New Rochelle man. That man was working with a law firm in One Grand Central Place in Midtown Manhattan. Six days following that announcement, New York City Mayor Bill de Blasio announced there were sixteen cases of the COVID-19 in New York City. The virus later grew very fast. By Wednesday, March 25, 2020, over 17,000 cases were confirmed in and near New York City. By that time, there were almost 200 COVID-19 related deaths. At the time, the city was infected with a rate just under five times higher than the rest of the United States. Its cases were one-third of the total U.S. cases. Two days later on Friday, March, 27, in that same area, the infection rate went over 23,000. By that day, there were 365 deaths from the COVID-19 in New York City. Queens was the worst-affected Borough in the number of deaths. It had well over a third of total deaths. Most of the deaths from COVID-19 involved those who had underlying health problems, including although not limited to diabetes (either type), being overweight/obese, having heart disease, HIV/AIDS, dementia, down syndrome and certain cancers. During a twenty-four hour period on March 28 and 29, 2020, the number of deaths due to COVID-19 tripled in New York City. About 222 more death from the virus took place during that period. The overall deaths from the virus in that city was at 672. The number of confirmed COVID-19 cases in the same city was at or near 30,765. On Tuesday, March 31, the first death of a child due to COVID-19 in New York City was recorded. At the exact same time, CNN news anchor Chris Cuomo, the brother of Andrew Coumo, tested positive for the virus. New York City also saw its first case of animals testing positive for COVID-19. Just after the Bronx Zoo in that city closed in mid-March 2020, two Malayan tigers were showing signs of the virus near the very end of the month. The cats, Nadia and her sister Azul, had a dry cough and wheezing. Nadia and Azul both tested positive for the virus. Seven other large cats at the Bronx Zoo also showed signs of the COVID-19 virus. The areas around that zoo were hit with the virus in high and large numbers. On Saturday, April 4, Governor Andrew Cuomo stated that the Chinese government arranged for the donation of just under 1,000 venilators being sent to the state of New York under foundations that were run by Joseph Tsai and Jack Ma. Another 140 ventilators were reported being sent by the state of Oregon. On April 6, 2020, there were about 72,181 confirmed cases and at least 2,475 deaths. New York City accounted for just under 25% of the COVID-19 deaths in the United States. The following day, Gothamist reported the actual New York City death count as having been counted less than the actual numbers. Bodies of people who had died at home, around 280 every day, were being picked up by United States Army, the United States National Guard and the Air National Guard. On May 10, Mayor de Blasio stated 38 children were found as having been affected by an inflammatory syndrome that might have been linked with an immune response from COVID-19. This condition was called multisystem inflammatory syndrome in children (MIS-C); it was life-threatening. This condition was strongly similar to Kawasaki disease and toxic shock syndrome (two other conditions known to affect children and teenagers). One child had died in New York City. Another two child deaths were reported in New York State. An association with COVID-19 was not yet proven as of May 2020. On Saturday, July 11, 2020, a seven-year-old German Shepherd named buddy died of COVID-19. The dog tested positive three months earlier when his guardians noticed he was having breathing problems. Buddy was the first dog in the United States to test positive for COVID-19. ==The government response to COVID-19== On March 14, 2020, just before statewide stay-at-home notices (also known as \"New York State on PAUSE\" executive orders) were put in effect, all New York Public Library buildings in Staten Island, Manhattan and the Bronx were temporarily closed. The Queens Public Library and Brooklyn Public Library closed later. Theaters, concert venues and nightclubs in and near New York City were shut down beginning from March 17. The area restaurants were restricted to deliveries and take-out only. The schools were closed until at least April 20. The gymnasiums were closed also. Governor Cuomo and his governor's office stated that shelter in place orders could only be put in effect by the governor's office. De Blasio's Mayor's office agreed. Three days following that statement, on March 20, 2020, with 5,683 confirmed cases for COVID-19 in New York City, Cuomo and his governor's office began issuing the PAUSE order that would go into effect on March 22 at 8pm. This order put into place ten restrictions, summarized under this executive order, listed below: # Effective at 8pm on Sunday, March 22, all non-essential businesses statewide will be closed # Non-essential gatherings of individuals of any size for any reason (e.g. parties, celebrations or other social events) are canceled or postponed at this time # Any concentration of individuals outside their home must be limited to workers providing essential services and social distancing should be practiced # When in public individuals must practice social distancing of at least six feet from others # Businesses and entities that provide other essential services must implement rules that help facilitate social distancing of at least six feet # Individuals should limit outdoor recreational activities to non-contact and avoid activities where they come in close contact with other people # Individuals should limit use of public transportation to when absolutely necessary and should limit potential exposure by spacing out at least six feet from other riders # Sick individuals should not leave their home unless to receive medical care and only after a telehealth visit to determine if leaving the home is in the best interest of their health # Young people should also practice social distancing and avoid contact with vulnerable populations # Use precautionary sanitizer practices such as using isopropyl alcohol wipes The governor said the provisions would be enforced. Any businesses violating this order faced fines and were subject to being closed. Businesses that qualified as \"essential business\" under the stay-at-home notice included though were not limited to: On Monday, April 6, 2020, the PAUSE order over New York State was extended until April 29. The rates of intensive care unit admissions were slowing. Fines for violating the social distancing protocols were increased from $500 to $1,000. On Thursday, April 16, the state's PAUSE order was extended until Friday, May 15. On May 17, 2021, Governor Cuomo said new guidelines coming from the Centers and Disease Control and Prevention related to face masks and social distancing for vaccinated people were being phased in by May 19. In early 2021, one year following the beginning of the COVID-19 pandemic in New York City, the SARS- CoV-2 Iota variant (which might have developed locally in and around the New York City area) accounted for just over 45% of the city's new cases. The variant began appearing in samples collected in New York City in November 2020. Two other variants started affecting the United States, including the New York metropolitan area just after 2021 got started: the SARS-CoV-2 Gamma variant and the UK variant. These three variants of the coronavirus have become more common in certain areas of the United States. The New York variant is spreading faster in New York City and its metropolitan areas. ==Demographics== It was reported on Sunday, April 5, 2020 that almost 51% of lab-confirmed COVID-19 cases in New York City affected people at least 50 years old. During weeks before, the usual likely cases were males between ages 18 and 49 years old. In April 2020, The New York Times stated that the virus was almost twice as deadly to Black/African Americans and Hispanic/Latino people as White people in New York City and its metropolitan areas. By early May 2020, over 5,200 Hispanics or Latinos in and around New York City had died of COVID-19. This made them an ethnic group with the highest number of deaths from the condition. == Related pages == * COVID-19 pandemic in Australia * COVID-19 pandemic in mainland China * Acute respiratory distress syndrome (ARDS) ==References== New York City Category:2020s in New York City Category:Disasters in New York (state)",
 "title": "COVID-19 pandemic in New York City"
}