{
 "id": "855731",
 "text": "Abigail Adams Smith or Nabby Adams was the eldest daughter of 2nd U.S. president John Adams and Former first lady Abigail Adams as well as the sister of John Quincy Adams the 6th U.S. president. ==Early life== Abigail was the only one of Abigail and John Adams' girl children to live very long. She was very close to her mother and stayed with her when John Adams was away. When Abigail Adams went to join her husband in Paris, Nabby went with her. She spent time in Paris and in London. ==Marriage and children== On June 12, 1786, Abigail married Colonel William Stephens Smith. They had four children: William Steuben Smith, John Adams Smith, Thomas Smith, and Caroline Amelia Smith. William Stephens Smith was always trying to get rich quickly and made many foolish decisions, so the Smiths did not have much money. But John Adams got William Stephens Smith a job as a surveyor for the Port of New York. In 1806, William Stephens Smith was arrested for trying to overthrow the government of Venezuela and lost his job. Things were so bad that Abigail Adams Smith talked about divorce to her mother. He eventually started a farm in East Chester, New York and became a member of Congress. ==Illness and death== When she was 46, she found a lump in her breast. She moved to her parents' farm in Massachusetts and talked to two doctors, Tufts and Rush. They told her the best thing to do was surgery. At the time, there was no good way to make people stay asleep during surgery, so Abigail Adams Smith was awake for most of it. It took 25 minutes and another hour to close the wound. She lived for another two years. But she became very thin and came back to Quincy to die. Abigail Adams wrote about the end of her daughter's life: \"She told her physician that she was perfectly sensible of her situation and reconciled to it...Although she was bolstered up in her bed and could neither walk or stand, she was always calm.\" According to McCollough, John Adams felt \"as if he were living in the Book of Job\" when Nabby was dying. ==References== Category:John Adams Category:People from Massachusetts",
 "title": "Abigail Adams Smith"
}