{
 "id": "855820",
 "text": "\"Vsemirnuyu Slavu\" (Russian: Всемирную Славу) is a Russian Christian Hymn, that was believed to have been an unofficial Anthem of the Grand Duchy of Moscow under the rule of Ivan the Terrible. It was an Orthodox Chant Used in the church and events of national significance. It is considered to be the first unofficial anthem of a Russian state. == Lyrics == Russian Lyrics: Russian Lyrics (Romanized) Lyrics in English (Translated) Прозябшую отъ человѣкъ, Произведенную по вышнему уставу, Родившую на свѣтъ рожденна прежде вѣкъ, Брата ко небесамъ и окончанье гнѣву, Согласно воспоемъ Марію Дѣву, Бесплотныхъ пѣнія ежеминутный видъ, И смертнымъ завсегда покровъ и крѣпкій щитъ. Се небо, се и храмъ Творца всей твари Бога, Вражды конецъ, покой и къ царствію дорога: Ея имуще мы, въ насъ вѣру утвердимъ, И сыномъ мы ея геенну заградимъ; Дерзайте убо вы, дерзайте Божьи люди; Мы съ симъ поборникомъ конечно побѣдимъ: Коль силенъ Боже ты, толь милостивъ намъ буди Prozyabshuyu ot\" chelovѣk\", Proizvedennuyu po vysshemu ustavu, Rodivshaya na svѣt\", rozhdennaya prezhde vѣk\", Brata ko nebesam\" i okonchan'ye gnѣvu, Soglasno vospoyem\" Maríyu Dѣvu, Besplotnykh pѣníya yezheminutnyy vid, I smertnym\" zavsegda prikrytiyem i krytym shchitom. Se nebo, se ves' i khram Tvortsa tvari Boga, Vrazhdy kontsa, pokoy i k\" tsarstvu dorogi: Yeya imshche my, v\" nas\" vѣru pred\"yavlyam\", I synom\", my yeye geyennu zagradim\"; Derzayte ubo vy, derzhite Boga lyudey; My s\" sim\" pobornikom\" konechno dob\"m\": Kol' silen\" Bozhe ty, l' milostiv\" nam\" budi A man who has come from her, Produced according to the higher charter, Born in the world, born before, Brother to heaven and the end of anger, According to Mary the Virgin, Ethereal singing every minute view, And the mortals always have a cover and a strong shield. This is heaven, and this is the temple of the Creator of all the creature of God, Enmity is the end, peace and the way to the kingdom: We will establish her faith in our property, And we will block her son's hell; Dare you, dare God's people; Of course, this champion and I will win: God, if you are strong, be merciful to us. == References == *https://www.culture.ru/poems/6836/vsemirnuyu-slavu Category:Eastern Orthodox Church Category:History of Russia Category:Songs in Russian",
 "title": "Vsemirnuyu Slavu"
}