{
 "id": "85613",
 "text": "The Nashville Sounds are a Minor League Baseball team from Nashville, Tennessee. They play baseball at the Triple-A (AAA) level, the most difficult level before Major League Baseball, against other baseball teams in the International League. The Sounds are partnered with the Milwaukee Brewers, a Major League Baseball team. When a player shows that he plays well at this level, he may be moved up to play for the Brewers. The team is named \"Sounds\" because the city of Nashville is a famous part of the music industry. The \"Nashville sound,\" a form of country music, started there in the 1950s. The Sounds played at a stadium called Herschel Greer Stadium from 1978 to 2014. In 2015, they began to play at a new stadium called First Horizon Park. They have played in Nashville longer than any other professional sports team from the city. The Sounds began playing baseball in 1978. They played at the Double-A (AA) level, the second-most difficult level before Major League Baseball, in the Southern League. More people came to watch the Sounds' games in Nashville that year than any other Minor League Baseball teams. They had the highest attendance in the Southern League for each of the seven years they played in that league. The Sounds won the championship of the Southern League twice: in 1979 as the Double-A partner of the Cincinnati Reds and in 1982 as the Double-A partner of the New York Yankees. Nashville changed to playing at the Triple-A level in 1985 as members of the American Association. The team did not play as well in this league and never won its championship They joined the Pacific Coast League in 1998. The Sounds won its championship in 2005 as the Triple-A partner of the Milwaukee Brewers. They started to play in the International League in 2021. == History == === Starting the team === Minor League Baseball teams started playing games in Nashville, Tennessee, in the late 19th century. Many different teams were located there between 1884 and 1963. In the mid-1970s, Larry Schmittou, a former Vanderbilt University baseball coach, and Conway Twitty, a country musician, formed a group of investors to pay for a new stadium and a team. This group included country artist Jerry Reed, local businessmen, and other citizens. They raised the money to build a US$1.5 million ballpark about south of downtown Nashville. It was named Herschel Greer Stadium in posthumous honor of Herschel Lynn Greer, an important Nashville businessman, whose family gave $25,000 for its construction. The team was called the Sounds because of the \"Nashville sound\", a type of country music that started in the area in the late 1950s. === Southern League === ==== Cincinnati Reds (1978–1979) ==== The Nashville Sounds started playing baseball games in 1978. The Cincinnati Reds agreed to be their Major League Baseball (MLB) partner, or affiliate. Nashville joined the Southern League, which was at the Double-A (AA) level, the second-most difficult level before MLB. They did not play well in their first season. However, many people came to watch their games in Nashville. The Sounds sold more tickets that year than any other Minor League Baseball team. They had the highest attendance in the Southern League for each of the seven years they played in the league. To help sell tickets, Schmittou gave away items, like tote bags, baseballs, t-shirts, and used cars, during games. There was also entertainment for fans between innings. The 1979 Sounds won the Southern League championship. Nashville ended their affiliation with Cincinnati after the season. The Reds had allowed the team to use a designated hitter (DH) in their lineup but then wanted them to stop. Schmittou felt this would give the Sounds a disadvantage against other teams that used the DH, so he looked for a new major league partner. ==== New York Yankees (1980–1984) ==== Nashville became the Double-A affiliate of the New York Yankees in 1980. This partnership was the most successful period in team history. They had five consecutive seasons with more games won than lost. The Sounds qualified for the Southern League championship playoffs each year. The 1980 club had a team- best 97–46 win–loss record. Nashville set the Southern League season attendance record that year when 575,676 people came to games at Greer Stadium. They played for the league title in 1981 but lost. In 1982, the Sounds won their second Southern League championship. === American Association === ==== Detroit Tigers (1985–1986) ==== Sounds president Larry Schmittou noticed that fewer people were coming to games in the early 1980s. He decided to move the team up to the Triple-A (AAA) level, the most difficult level before Major League Baseball, to get more people interested in going to games. He also hoped the change would help the city of Nashville get its own MLB team in the future. Schmittou bought the Triple-A Evansville Triplets of the American Association for a reported ammount of $780,000 in July 1984. This resulted in several changes happening in 1985. The Triple-A team moved from Evansville, Indiana, to Nashville. They continued to be called the Nashville Sounds. The Double-A team from Nashville moved to Huntsville, Alabama. They became known as the Huntsville Stars. At the Triple-A level, the Sounds partnered with the Detroit Tigers. Nashville almost made the playoffs in 1985, but they did not play well in 1986. With still fewer people coming to games, the team ended their affiliation with Detroit after two seasons. ==== Cincinnati Reds (1987–1992) ==== The Sounds became Triple-A partners with the Cincinnati Reds in 1987. They were chosen because the Reds were the most popular major league team in the area. Schmittou hoped this would get more people to come to Sounds games. In 1990, Nashville set its all-time attendance record when 605,122 people attended games at Greer Stadium. The Sounds' 1990 season was their best in the American Association. They had an 86–61 record and competed for the American Association championship, but they did not win. The Sounds did not qualify for the postseason in the other five years of affiliation with Cincinnati. Greer Stadium, once one of the best stadiums in Triple-A baseball for players and fans, began to be outshined by newer ballparks being built in the late 1980s. The Reds ended their partnership with the Sounds so their players could have a better stadium. ==== Chicago White Sox (1993–1997) ==== The Chicago White Sox agreed to become the new affiliate of the Sounds in 1993. The White Sox then gave a list of complaints about the poor condition of Greer Stadium. Schmittou asked the city to pay to build a new ballpark and thought about moving the team to a new city in the Nashville area. Instead, he made major improvements to Greer. One of those was the addition of its famous guitar-shaped scoreboard, which was installed before the 1993 season. Renovations continued over the next few years to try to make the stadium right for Triple-A teams. The Sounds played for the American Association championship in each of their first two years with the White Sox but lost each time. Greer Stadium was shared between the Sounds and the Southern League's Nashville Xpress during the 1993 and 1994 seasons. This happened after Charlotte, North Carolina, got a Triple-A team in 1993, leaving its Double-A Charlotte Knights without a home. Schmittou let them use Greer as a temporary ballpark. To make it work, the Xpress' home games were scheduled for when the Sounds were playing at their opponents' stadiums. The 1996 season was the last that Schmittou was the team's president and partial owner. A National Football League team, the Tennessee Titans, was going to start playing in Nashville in 1998. Schmittou felt that the Sounds would have fewer people at games and make less money. So, he and another investor sold their part of the Sounds to Chicago-based businessmen Al Gordon, Mike Murtaugh, and Mike Woleben. === Pacific Coast League === ==== Pittsburgh Pirates (1998–2004) ==== The American Association, of which Nashville had been members since 1985, disbanded after the 1997 season. The Sounds changed to playing in the Triple-A Pacific Coast League (PCL). Nashville also got a new partner, the Pittsburgh Pirates. The team regularly finished third or fourth (last) in their four-team division. In 2003, however, they made it to the final round of the playoffs but were unable to win the PCL championship. Pittsburgh ended their affiliation with the Sounds after the 2004 season so they could have their Triple-A team at a newer ballpark. ==== Milwaukee Brewers (2005–2014) ==== The Sounds became the Triple-A affiliate of the Milwaukee Brewers in 2005. Milwaukee chose to partner with Nashville because they were planning to build a new stadium to replace the aging Greer. Nashville won the Pacific Coast League championship in 2005. This was Nashville's first league title since moving to the Triple-A level in 1985. They did not reach the finals during the rest of the Brewers affiliation. Their best record in the PCL happened in 2007 when they were 89–55. The team stopped its partnership with Milwaukee after the 2014 season because of poor playing in recent years. The Sounds had planned to leave Greer Stadium in the mid-2000s for a new ballpark to be called First Tennessee Field. However, the project was abandoned when the team and the city of Nashville could not agree on how to pay for the stadium. Afterward, the team was sold to MFP Baseball, a New York City-based group of investors consisting of Masahiro Honzawa, Steve Posner, and Frank Ward, in 2008. They made many improvements to Greer while continuing to try to get a new stadium. Before the 2014 season, the team, Nashville, and the State of Tennessee made a plan to build a new downtown ballpark which would open in 2015. After 37 years, the Sounds played their final season at Herschel Greer Stadium in 2014. ==== Oakland Athletics (2015–2018) ==== Nashville affiliated with the Oakland Athletics in 2015 because their former Triple-A team won many games and championships. The Sounds started playing at the new $91 million First Horizon Park, then known as First Tennessee Park, in 2015. Nashville chose not to continue their partnership with Oakland after the 2018 season so they could have a new affiliate. ==== Texas Rangers (2019–2020) ==== The Sounds became the Triple-A partner of the Texas Rangers in 2019. They chose Texas because they were one of the most popular major league teams among local baseball fans—behind the Atlanta Braves and St. Louis Cardinals. The 2020 season was not played because of the COVID-19 pandemic. After the 2020 season, Major League Baseball took control of Minor League Baseball to increase player salaries, improve stadiums, and reduce travel costs. Affiliations were changed to locate Triple-A teams closer to their major league clubs. Texas chose to move their Triple-A affiliation back to Round Rock, Texas, where it had been before to partnering with Nashville. === International League === ==== Milwaukee Brewers (2021–present) ==== The Sounds became the Triple-A affiliate of the Milwaukee Brewers for a second time in 2021. The partnership will last at least through the 2030 season. Milwaukee wanted to repartner with Nashville because of the quality of their stadium and the ease of travel options to and from the city. Along with Major League Baseball's changes to the minor leagues, the Pacific Coast League disbanded, and the Sounds were placed in a new league called the Triple-A East. In 2022, the name of this league was changed to the International League (IL), the name used by the league before the 2021 changes. The 2022 Sounds finished with a 91–58 record, their best- ever in the IL. Nashville lost a single playoff game to determine the International League championship. ==References== Specific General * * * ==Other websites== * The team's website * The team's statistics from Baseball- Reference Category:1970s establishments in Tennessee Category:Baseball teams in the United States Category:Milwaukee Brewers Category:Sports in Nashville, Tennessee",
 "title": "Nashville Sounds"
}