{
 "id": "856275",
 "text": "Lillian Eugenia Smith (December 12, 1897 – September 28, 1966) was an American writer and social critic toward the Southern United States. Smith was known mainly for her best-selling and highly controversial 1944 book Strange Fruit. Smith was a Southern liberal who would easily go against segregation and work on taking apart Jim Crow laws. This was during a time when such actions would almost always guarantee being cut off from society. In 1944. Smith published her controversial and best-selling book Strange Fruit. The book dealt with a then-forbidden and very controversial theme: mixed race romances. The book was originally titled Jordan is So Chilly. Smith, however, changed the title for the novel to Strange Fruit. Not long after the novel was released, it was banned in Boston, Massachusetts and Detroit, Michigan under reasons of \"lewdness\" and profane language. The novel was also banned from being mailed in the United States Postal Service. The ban against the novel, though, was lifted by the then-President Franklin D. Roosevelt when his wife Eleanor made a request toward him. ==Civil Rights activism== One of several ways Smith openly discussed the problems of segregation was while she was counseling campers. It was this period of creative control on the camp which allowed her to use it for talking about modern social issues. Those were the dangers of inequality and how to improve society in relation to women. ==Death== Smith dealt with breast cancer beginning in the early 1950s. She died from the disease at age 68. Her book, The Journey, refers to her battle. ==Legacy of Lillian Smith== Smith's novel Strange Fruit remains her most famous work. The book was translated under fifteen different languages. In 1999, Smith was given an award by the Georgia Women of Achievement. Beginning in 1968, the Lillian Smith Book Awards were given out annually. But in 2003, there was not enough money being given to the Southern Regional Council. The awards are the Southern United States' best-known and oldest book award. They are presented in fiction and non-fiction categories. ==Selected works== *Strange Fruit (1944) , *Killers of the Dream, (1949) , *The Journey, New York: Norton,(1954) *Now Is the Time, New York: Viking Press (1955) . *One Hour, Chapel Hill: University of North Carolina Press (1959), – an attack on McCarthyism in the form of a novel *Memory of a Large Christmas, New York: Norton, (1962) . *Our Faces, Our Words, New York: W.W. Norton (1964), – an ode to the non-violent resistance of the civil rights movement ==Collections== *The Winner Names the Age: A Collection of Writings, New York: Norton (1978) , *How Am I to be Heard?: Letters of Lillian Smith, Chapel Hill: University of North Carolina Press (1993) , *A Lillian Smith Reader, Athens: The University of Georgia Press (2016) , ==References== Category:1897 births Category:1966 deaths Category:Writers from Atlanta Category:Deaths from breast cancer Category:American civil rights activists",
 "title": "Lillian Smith (author)"
}