{
 "id": "856288",
 "text": "Chirlane Irene McCray (born November 29, 1954 in Springfield, Massachusetts) is an American writer, editor and activist. She is married to New York City Mayor Bill de Blasio. McCray was described as the \"closest advisor\" for de Blasio. McCray is the chairwoman for the Mayor's Fund to Advance New York City and leads ThriveNYC. She has also published poetry. McCray worked in politics as a speechwriter. ==Involvement in the de Blasio administration== When de Blasio became mayor, he hired the publicist Rachel Noerdlinger as McCray's chief of staff. Noerdlinger, however, later resigned her post due to several controversies with her behavior and the behaviors of certain people around her. During his second month in office, de Blasio named McCray the chair of the Mayor's Fund to Advance New York City. Beginning from then, the group was focused on immigration, mental health and youth workforce projects. In November 2015, McCray led the launch of ThriveNYC, a plan for overhauling the city's mental health and substance abuse services. ThriveNYC promotes a change from the more traditionally more reactive model. That model can strain police, hospitals, prisons and schools, into an integrated public health approach on being aware and being identified early. ThriveNYC drew harsh criticism over accusations of not being properly managed and accusations that the group failed to produce any records with the proper results. As of March 2019, almost $850 million in funding in McCray's program was unaccounted for. Also, the program was on track to spend just over $1 billion over almost five years. A Bronx Councilman criticized ThriveNYC. He said there was no evidence that the program was working. == Related pages == *List of poets from North America ==References== Category:1954 births Category:Living people Category:American poets Category:African-American writers Category:Writers from New York City Category:Writers from Massachusetts Category:People from Springfield, Massachusetts",
 "title": "Chirlane McCray"
}