{
 "id": "856377",
 "text": "Pleyel et Cie (\"Pleyel and Company\") was a French piano manufacturing firm founded by Ignace Pleyel in 1807. In 1815, Pleyel's son Camille joined him as a business partner. The firm provided pianos to Frédéric Chopin,Macintyre, Ben (17 March 2007). \"Chopin's true sound can be heard at last after discovery of his piano\". The Times. London. Archived from the original who once mentions that Pleyel pianos are «non plus ultra».Chopin's letters. By Chopin, Frédéric, 1810-1849; Voynich, E. L. (Ethel Lillian), 1864-1960; Opienski, Henryk, 1870-1942 Among other composers that were using Pleyel pianos were Debussy, Saint-Saëns, Ravel, de Falla and Stravinsky.\"Letters, Volumes 41–42\". Washington, DC.: Time Inc. 1935. OCLC 9467134. In the 1980s, the Pleyel company bought out two other piano companies Erard and Gaveau. In 2008 they introduced new pianos designed by famous designers.Hundley, Tom (30 April 2008). \"Grand finale: European piano-makers hear their centuries-old industry's closing notes\". Chicago Tribune. At the end of 2013, the company announced it would end manufacturing pianos in France.Beardsley, Eleanor (28 December 2013). \"Chopin's Favorite Piano Factory Plays Its Final Chord\". Weekend Edition Saturday. National Public Radio. In September 2009 a piano maker Paul McNulty built a replica of the 1830 model of Pleyel's piano, which is now in a collection of the Fryderyk Chopin Institute in Warsaw. The replica was used in The 1st International Chopin Competition on Period Instruments in September 2018. == References == == Other websites == * A website on Pleyel pianos by Stephen Birkett of the University of Waterloo * History of Pleyel and their pianos with many pictures and details * Pleyel Pianos – The Piano in Polish Collections * Pleyel replica to make its concert debut * International Chopin Competition on Period Instruments website * Chopin's last piano Category:1800s establishments in France Category:1807 establishments Category:Musical instrument companies Category:Manufacturing companies of France",
 "title": "Pleyel et Cie"
}