{
 "id": "856305",
 "text": "Edythe Evelyn Gandy (September 4, 1920 – December 23, 2007) was an American politician and lawyer. Gandy was the second female elected under a statewide office in Mississippi. That was Mississippi State Treasurer. The first female was Nellah Massey Bailey. Bailey was elected the State Tax Collector in 1947. Gandy was later elected the insurance commissioner and 26th Lieutenant Governor of Mississippi. Gandy was a member under the United States' Democratic Party. In 1947, she was elected to Mississippi House of Representatives from Forrest County. In 1959, Gandy was the first woman elected the Mississippi Assistant Attorney General. Later that year, she became the state treasurer. Gandy ran twice for the Governor of Mississippi. Both times, she was defeated. ==Death== Gandy was born in Hattiesburg, Mississippi. She died after a long bout having progressive supranuclear palsy, a condition similar to Parkinson's disease. ==The legacy== In 2006, the Evelyn Gandy Parkway was opened just outside of Petal in her native Forrest County. ==Awards and honors== *State of Alabama Honorary Lieutenant Colonel Aide-de- camp, commissioned by Alabama Governor George Wallace; 1972 *State of Kentucky Kentucky Colonel, commissioned by Kentucky Governor Wendell H. Ford; 1972 *Mississippi College Service of Humanity Award; 1976 *Blue Mountain College Honorary Degree of Doctor of Law; 1977 *Paul Harris Fellow-Rotary Club 1978; *National Mental Health Association Humanitarian Award; 1979 *Mississippi State University Mississippi Woman of the Year Award; 1980 *State of Mississippi Mississippian of the Year in Government; 1981 *Exchange Club \"Golden Deeds\" Award; 1982 *Mississippi College School of Law Award for Excellence in Law; 1984 *Mississippi Women's Political Caucus Susan B. Anthony Award for Outstanding Service to the State of Mississippi; 1984 *University of Southern Mississippi Alumni Hall of Fame;1985 *Mississippi University for Women Medal of Excellence;1991 *The Mississippi Bar Lifetime Achievement Award; 1994 *Women's Political Network First Annual Award for Distinguished Service; 1994 *Mississippi Democratic Party James O. Eastland Award; 1995 *American Bar Association Margaret Brant Women Lawyers of Achievement Award; 1997 *Mississippi Association of Women Lawyers Lifetime Achievement Award; 1998 *Hattiesburg Women's Forum Leadership Award; 1998 *Lindy Boggs Women in Public Service Award; 1998 *The Mississippi Bar Chief Justice Award; 1998 *The Mississippi Bar Susie Blue Buchanan Award; 2003 ==References== Category:Democratic Party (United States) politicians Category:1920 births Category:2007 deaths Category:Lieutenant Governors of Mississippi",
 "title": "Evelyn Gandy"
}