{
 "id": "856495",
 "text": "Sexually objectification of a person means to view them like things for sexual desire. Both males and females can be sexually objectified, as can children and teenagers. Women and girls, however, are more likely victims of sexual objectification than men and boys. The concept of sexual objectification toward females is very important for some feminist theories. The sexual objectification toward women and girls contributes to bad treatment against them and to gender inequality. A number of psychologists link sexual objectification to some physical and mental health risks for women and girls. The concept of sexual objectification is controversial. Some people have argued that to some extewnt, at least a little objectification is a normal part of human sexuality. ==Sexual objectification of women== The sexual objectification of women/girls has them being viewed like an object under male sexual desires, not as a whole person. Opinions differ, however, on which situations are objectionable. Many see the sexual objectifying of women/girls taking place with sexual portrayals involving them under art, media, advertising, pornography, prostitution and beauty contests. There is also evidence showing that females are sometimes sexually objectified by other females. ===Sexual objectification of Hispanic/Latina women=== Hispanic or Latina females are more often sexually objectified under stereotypes (unfair generalisations) toward them. The American media often portray these women as more likely to perform casual sex with multiple partners. The same media portray these females as having curved shapes, large breasts, large buttocks, having a melodramatic (over-the-top) attitude or being feisty. ==Sexual objectification of men== Women also sometimes see men as sex objects. This often happens in movies and in advertising. It also happens in some television programs.Erotic shows (such as a striptease), or pornography may reduce men to sex objects. ==References== objectification Category:Controversies",
 "title": "Sexual objectification"
}