{
 "id": "856485",
 "text": "Adapting a movie is the transfer of a certain work or story, either in part or in whole, to a motion picture. Common forms of movie adaptation are using a novel as the basis of a motion picture. Other works that are adapted to motion pictures are comic books, plays, historical sources and other movies. Several plays from William Shakespeare have been adapted into movies. Those include Hamlet, Othello and Romeo and Juliet. Examples of Hamlet on screen are the 1969, 1990 and 1996 movies. Examples for Romeo and Juliet being adapted under film include the 1936, 1968 and Romeo + Juliet (1996) movies. Across Britain, where stage plays tend being more popular for entertainment than in the United States, many movies start off as stage productions. Examples of British and British-American motion pictures based on successful British plays include Gaslight (1940), Shirley Valentine (1989) and The Madness of King George (1994). In similar, hit Broadway plays are often adapted under movies. Examples of Broadway plays adapted under movies are A Streetcar Named Desire (1951), Children of a Lesser God (1986), Glengarry Glen Ross (1992) and Real Women Have Curves (2002). Movies are sometimes created from a television series. In some cases, the movie offers a longer storyline than the usual television program format. In the adaptation of The X-Files to the movie format, greater effects and a longer plotline were involved. Adaptations of television shows will give the viewers an opportunity of seeing that show's characters without broadcast restrictions. Such additions–explicit sexual content, profanity, nudity, drug use, adult themes or graphic violence–are only the shown adaptive addition. Movie versions of Miami Vice and South Park are examples of such motion pictures adapted off the related television programs. ==Awards== Certain major movies' award programs present awards for adapted screenplays, different from those for original screenplays. ==The adaptation of motion pictures== When movies' screenplays are original, they are also the sources for derivative works, like novels and plays. For example, certain movie studios will sell the rights of popular title to novel publishing companies. Novelization builds up the characters and events happening for commercial reasons. Examples of motion pictures adapted from novels are Fanny Hill (1748), Where the Truth Lies (2003), Delta of Venus (1977), Young Adam (1954), Blue Is the Warmest Colour (2013) and Emmanuelle (1974). ==References== Category:Movie industry",
 "title": "Movie adaptation"
}