{
 "id": "856453",
 "text": "Alice Bradley Sheldon (born Alice Hastings Bradley; August 24, 1915 – May 19, 1987) was an American science fiction author. She was better known by her pen name James Tiptree Jr.. She used the pen name for her books from 1967 until her death. Before 1977, most people didn't know that James Tiptree Jr. was really a woman. Sheldon was added into the Science Fiction Hall of Fame in 2012. In 1936, Sheldon participated in group shows at the Art Institute of Chicago. She had connections to the institute through her family. It showed some new American work. This was an important step forward for Sheldon's painting career. At this time Sheldon also took private art lessons from John Sloan. She disliked prudery in painting. While examining an anatomy book for an art class, Sheldon saw that the genitals were blurred. She then restored the genitals of the figures with a pencil. In 1939, a nude self-portrait from Sheldon named Portrait in the Country was accepted for the \"All-American\" biennial at the Corcoran Gallery in Washington, D.C.. The portrait was displayed there for just over six weeks. While these two shows were seen as big breaks, she downplayed the accomplishments. She said then that \"only second-rate painters sold.\" Sheldon preferred keeping her art works at home. ==The science fiction career== Not long after Sheldon started writing science fiction, in 1967 she adopted the name James Tiptree Jr. The name Tiptree was from branded jars of marmalade. The Jr. was the idea of her husband. In one interview, Sheldon said: \"A male name seemed like good camouflage. I had the feeling that men would slip by less observed. I've had too many experiences in my life of being the first woman in some damned occupation.\" The \"Tiptree\" pen name was maintained until late in 1977. That was in part because though the name was widely known as a pen name, it was well understood that its use was to protect the professional reputations of the intelligence community official. But then, in 1976, \"Tiptree\" said during a letter that \"his\" mother, also a writer, died in Chicago. Those details led the fans to see the obituary. Sheldon's actual identity was then exposed. ==The themes== Before Sheldon's real identity was exposed, Tiptree was often known as an unusually macho male. However, Sheldon's view of sexual politics was ambiguous. ==Death== On May 19, 1987, Sheldon shot her husband and then herself. They were discovered dead, near each other in their Virginia home in bed. ==The works== === Short story collections === * Ten Thousand Light-Years from Home (1973) * Warm Worlds and Otherwise (1975) * Star Songs of an Old Primate (1978) * Out of the Everywhere and Other Extraordinary Visions (1981) * Byte Beautiful: Eight Science Fiction Stories (1985) * The Starry Rift (1986) (linked stories) * Tales of the Quintana Roo (1986) (linked stories) * Crown of Stars (1988) (linked stories) * Her Smoke Rose Up Forever (omnibus collection) (1990) The abbreviation(s) after each title indicate its appearance in one or more of the following collections: Collection title Year of publication Abbreviation Ten Thousand Light-Years from Home 1973 LYFH Warm Worlds and Otherwise 1975 WWO Star Songs of an Old Primate 1978 SSOP Out of the Everywhere and Other Extraordinary Visions 1981 OE Byte Beautiful: Eight Science Fiction Stories 1985 BB Tales of the Quintana Roo (linked stories) 1986 QR The Starry Rift (linked stories) 1986 SR Crown of Stars 1988 CS Her Smoke Rose Up Forever (omnibus collection) 1990 SRU Meet Me at Infinity (fiction, essays & other non-fiction) 2000 MM * 1968 ** \"The Mother Ship\" (later retitled \"Mamma Come Home\") (novelette): LYFH ** \"Pupa Knows Best\" (later retitled \"Help\"; novelette): LYFH ** \"Birth of a Salesman\" (short story): LYFH ** \"Fault\" (short story): WWO ** \"Happiness Is a Warm Spaceship\" (short story): MM ** \"Please Don't Play With the Time Machine\" (very short story): MM ** \"A Day Like Any Other' (very short story): MM * 1969 ** \"Beam Us Home\" (short story): LYFH, BB ** \"The Last Flight of Doctor Ain\" (short story): WWO, SRU ** \"Your Haploid Heart\" (novelette): SSOP ** \"The Snows Are Melted, The Snows Are Gone\" (novelette): LYFH ** \"Parimutuel Planet\" (later retitled \"Faithful to Thee, Terra, in Our Fashion\") (novelette): LYFH * 1970 ** \"The Man Doors Said Hello To\" (short story): LYFH ** \"I'm Too Big But I Love to Play\" (novelette): LYFH ** \"The Nightblooming Saurian\" (short story): WWO ** \"Last Night and Every Night\" (short story): CS * 1971 ** \"The Peacefulness of Vivyan\" (short story): LYFH, BB ** \"I'll Be Waiting for You When the Swimming Pool Is Empty\" (short story): LYFH, BB ** \"And So On, and So On\" (short story): SSOP, SRU ** \"Mother in the Sky with Diamonds\" (novelette): LYFH * 1972 ** \"The Man Who Walked Home\" (short story): LYFH, BB, SRU ** \"And I Have Come Upon This Place by Lost Ways\" (novelette): WWO, SRU ** \"And I Awoke and Found Me Here on the Cold Hill's Side\" (short story): LYFH, SRU ** On the Last Afternoon (novella): WWO, SRU ** \"Painwise\" (novelette): LYFH ** \"Forever to a Hudson Bay Blanket\" (short story): LYFH ** \"Filomena & Greg & Rikki-Tikki & Barlow & the Alien\" (later retitled \"All the Kinds of Yes\") (novelette): WWO ** \"The Milk of Paradise\" (short story): WWO ** \"Amberjack\" (short story): WWO ** \"Through a Lass Darkly\" (short story): WWO ** \"The Trouble Is Not in Your Set\" (short story): MM (previously unpublished) ** \"Press Until the Bleeding Stops\" (short story): MM * 1973 ** \"Love Is the Plan the Plan Is Death\" (short story): WWO, BB, SRU ** \"The Women Men Don't See\" (novelette): WWO, SRU ** \"The Girl Who Was Plugged In\" (novelette): WWO, SRU * 1974 ** \"Her Smoke Rose Up Forever\" (novelette): SSOP, SRU ** \"Angel Fix\" (novelette, under the name \"Raccoona Sheldon\"): OE * 1975 ** A Momentary Taste of Being (novella): SSOP, SRU * 1976 ** \"Your Faces, O My Sisters! Your Faces Filled of Light!\" (short story, under the name Raccoona Sheldon): OE, BB, SRU ** \"Beaver Tears\" (short story, under the name Raccoona Sheldon): OE ** \"She Waits for All Men Born\" (short story): SSOP, SRU ** Houston, Houston, Do You Read? (novella): SSOP, SRU (Hugo award winner; Nebula award winner) ** \"The Psychologist Who Wouldn't Do Awful Things to Rats\" (novelette): SSOP * 1977 ** \"The Screwfly Solution\" (novelette, under the name Raccoona Sheldon): OE, SRU ** \"Time-Sharing Angel\" (short story): OE * 1978 ** \"We Who Stole the Dream\" (novelette): OE, SRU * 1980 ** Slow Music (novella): OE, SRU ** \"A Source of Innocent Merriment\" (short story): OE * 1981 ** \"Excursion Fare\" (novelette): BB ** \"Lirios: A Tale of the Quintana Roo\" (later retitled \"What Came Ashore at Lirios\") (novelette): QR ** \"Out of the Everywhere\" (novelette): OE ** With Delicate Mad Hands (novella): OE, BB, SRU * 1982 ** \"The Boy Who Waterskied to Forever\" (short story): QR * 1983 ** \"Beyond the Dead Reef\" (novelette): QR * 1985 ** \"Morality Meat\" (novelette, under the name Racoona Sheldon): CS ** The Only Neat Thing to Do (novella): SR ** \"All This and Heaven Too\" (novelette): CS ** \"Trey of Hearts\" (short story): MM (previously unpublished) * 1986 ** \"Our Resident Djinn\" (short story): CS ** \"In the Great Central Library of Deneb University\" (short story): SR ** Good Night, Sweethearts (novella): SR ** Collision (novella): SR ** The Color of Neanderthal Eyes (novella): MM * 1987 ** \"Second Going\" (novelette): CS ** \"Yanqui Doodle\" (novelette): CS ** \"In Midst of Life\" (novelette): CS * 1988 ** \"Come Live with Me\" (novelette): CS ** Backward, Turn Backward (novella): CS ** \"The Earth Doth Like a Snake Renew\" (novellette): CS [written in 1973] ==The novels== * Up the Walls of the World (1978) * Brightness Falls from the Air (1985) ===Other collections=== * Neat Sheets: The Poetry of James Tiptree Jr. (Tachyon Publications, 1996) * Meet Me at Infinity (a collection of previously uncollected and unpublished fiction, essays and other non-fiction, with much biographical information, edited by Tiptree's friend Jeffrey D. Smith) (2000) ==The adaptations== * \"The Man Who Walked Home\" (1977): comic book adaptation in Canadian underground comic Andromeda Vol. 2, No. 1; September; Silver Snail Comics, Ltd.; Toronto; pp. 6–28. Pencils by John Allison, inks by Tony Meers. * \"Houston, Houston, Do You Read?\" (1990): radio drama for the National Public Radio series Sci-Fi Radio. Originally aired as two half-hour shows, February 4 and 11. * \"Yanqui Doodle\" (1990): half-hour radio drama for the National Public Radio series Sci-Fi Radio. Aired March 18. * Weird Romance (1992): Off-Broadway musical by Alan Menken. Act 1 is based on \"The Girl Who Was Plugged In\". * \"The Girl Who Was Plugged In\" (1998): television film: episode 5 of the series Welcome to Paradox * The Screwfly Solution (2006): television film: season 2, episode 7 of the series Masters of Horror * Xenophilia (2011) – based on the lives and works of Tiptree and Connie Converse; arranged and choreographed by Maia Ramnath; produced by the aerial dance and theater troupe Constellation Moving Company, performed at the Theater for the New City, presented November 10–13, 2011. Reviewer Jen Gunnels writes, \"The performance juxtaposed some of Tiptree's short stories with Converse's songs, mixing in biographical elements of both women while kinesthetically exploring both through dance and aerial work on trapeze, lyra (an aerial ring), and silks (two lengths of fabric which the artist manipulates to perform aerial acrobatics). The result was elegant, eerie, and deeply moving.\" ==References== Category:Writers from Chicago Category:American short story writers Category:Murder-suicides in the United States Category:1915 births Category:1987 deaths",
 "title": "James Tiptree Jr."
}