{
 "id": "856441",
 "text": "Karen Joy Fowler (born February 7, 1950, Bloomington, Indiana) is an American novelist and author. She usually does science fiction, fantasy and literary fiction. Her work often focuses on the lives of women and the 19th-century. Fowler is best-known for being the novelist of the best-selling book The Jane Austen Book Club. It was later adapted into a movie of the same name. Fowler began publishing short stories in the mid-to-late 1980s. Two of her stories were Recalling Cinderella (1985) and Artificial Things (1986). Fowler's first novel, Sarah Canary (1991), received strong positive reviews from book critics and readers. The novel is of several people that are alienated in the 19th- century America while dealing with peculiar first contact. One character is a Chinese American. The second character carries mental illness. The third character is a feminist. The last is Sarah herself. Fowler later teamed up with the science fiction writer Pat Murphy to found the James Tiptree Jr. Award, the literary prize for science fiction and fiction which \"expands of explores our understanding of gender.\" The prize was named for the science fiction author Alice Sheldon. Sheldon used the pen name James Tiptree Jr. for writing her books. The award's main focus is to recognize authors/novelists, female or male, who challenge and reflect shifting gender roles. In 1987, Fowler received the Hugo Award related to her writing career. Fowler's second novel, The Sweetheart Season (1996), is a romantic comedy mixed with historical and fantasy elements. Fowler's 1998 collection, Black Glass, won a World Fantasy Award. Her 2010 collections What I Didn't See and Other Stories won the same award. In 2004, Fowler received a Nebula Award for her short book What I Didn't See. In 2008, Fowler won the Nebula Award a second time for the Best Short Story. The 2008 win was for her 2007 short story Always. Another short story, The Pelican Bar won a Shirley Jackson Award in 2009 and a World Fantasy Award one year later. Fowler's most recent novel, We are All Completely Beside Ourselves (2013) won a Pen/Faulkner Award for 2014. It was also nominated for a 2014 Nebula Award. It was later shortlisted with a 2014 Man Booker Prize. Fowler received the World Fantasy Life Achievement Award during the 2020 convention. ==The awards and honors== *1985 Published Winner for \"Recalling Cinderella,\" a new writer short story winner in L. Ron Hubbard Presents: Writer's of the Future Vol 1 edited by Algis Budrys *1998 World Fantasy Award for \"Black Glass\", a collection of short stories. *2004 Nebula Award for \"What I Didn't See\", a short story. *2008 Nebula Award for \"Always\", a short story. *2009 Shirley Jackson Award for \"The Pelican Bar\", a short story *2010 World Fantasy Award for \"What I Didn't See, and Other Stories\", a collection of short stories. *2014 PEN/Faulkner Award for Fiction for \"We Are All Completely Beside Ourselves\", a novel. *2014 Specsavers National Book Awards \"International Author of the Year\" winner for We Are All Completely Beside Ourselves *2017 World Fantasy Award for _The Best American Science Fiction and Fantasy 2016_ for Best Anthology (nominee) ==The novels== * Sarah Canary (1991) - Novel concerning a mysterious woman in 1873 Pacific Northwest. * The War of the Roses (1991) - Chapter book publication of the novelette. * The Sweetheart Season (1996) - Fantasy novel about the Sweetwheat Sweethearts, a female baseball team from 1947 Minnesota. * Sister Noon (2001) - Novel set in 1890s San Francisco. * The Jane Austen Book Club (2004) - Six members of an early 21st century book club discuss Jane Austen books. * Wit's End (Putnam, 2008) - A young woman visits her godmother, one of America's most successful mystery writers. * We Are All Completely Beside Ourselves (2014 PEN/Faulkner Award for Fiction Winner, A Marian Wood Book/Putnam, 2013, shortlisted for the 2014 Man Booker Prize) ==The collections== * Artificial Things (1986) - Collection of 13 short stories. * Peripheral Vision (1990) - Collection of 5 stories, 1 original. Author's Choice Monthly #6 * Letters from Home (1991) with Pat Cadigan and Pat Murphy. Collection of short fiction by Fowler, Cadigan, and Murphy. * Black Glass (1997) - Collection of 15 short stories, 2 original. Includes the contents from Peripheral Vision and Letters from Home. * What I Didn't See and Other Stories (2010) - Collection of 12 short stories, 1 original. ==As editor== * MOTA 3: Courage (2003) - Anthology of short fiction. * The James Tiptree Award Anthology 1 (2005) with Debbie Notkin, Pat Murphy and Jeffrey D. Smith. Anthology of winners of the James Tiptree, Jr. Award. Tachyon Publications. * The James Tiptree Award Anthology 2 (2006) with Debbie Notkin, Pat Murphy and Jeffrey D. Smith. Tachyon Publications. * The James Tiptree Award Anthology 3 (2007) with Debbie Notkin, Pat Murphy and Jeffrey D. Smith. Tachyon Publications. ==References== Category:Writers from Indiana Category:Short story writers Category:Science fiction writers Category:People from Bloomington, Indiana Category:Award winning writers Category:1950 births Category:Living people",
 "title": "Karen Joy Fowler"
}