{
 "id": "856590",
 "text": "Republic Day is a national holiday in India, when the country marks and celebrates the date on which the Constitution of India came into effect on 26, January 1950, replacing the Government of India Act (1935) as the governing document of India and thus, turning the nation into a newly formed republic. The day also marks the transition of India from an autonomous Commonwealth realm with British Monarch as nominal head of the Indian Dominion, to a fully sovereign nation with the President of India as the nominal head of the Indian Union. == Celebration == The main event for the holiday is a massive parade held in the capital of New Delhi, which includes cultural, historical, and military displays. The parade is preceded by the prime minister laying a wreath at the Amar Jawan Jyoti — an arched war memorial — and taking a moment of silence to commemorate fallen soldiers. The parade is held near Kartavya Path (also called Rajpath) formerly Kingsway in New Delhi, the capital of India, beginning from Raisina Hill near the Rashtrapati Bhavan (Presidential Palace), along Kartavya path, past India Gate and on to the historic Red Fort in the old quarter of the city. Different infantry, cavalry and mechanized regiments of the Indian Army, the Indian Navy and the Indian Air Force march in formation, decked in all their finery and official decorations. The President of India, who is also the Commander in Chief of the Indian Armed Forces, takes the salute. The Chief Guest of the parade is the Head of State or Head of Government of another nation. The parade also includes many traditional dance troupes, to symbolize the cultural heritage of India. It traditionally ends with a colourful flypast by Indian Air Force jets in a tiranga formation. Similar parades are held in the capitals of all the states of India, where the Governors of the respective states take the salute. The official conclusion of Republic Day festivities is much later on 30 January, four days after the Republic Day. == References == Category:January observances Category:Holidays of India",
 "title": "Republic Day (India)"
}