{
 "id": "856602",
 "text": "Pakistani passports () are passports issued by the Government of Pakistan to Pakistani citizens and nationals for the purpose of international travel. They are issued by the Directorate General of Immigration & Passports (DGIP) of the Ministry of Interior from regional passport offices and the Pakistani Embassies and Consulates. Since January 2014, Pakistani passports have validity for 5 and 10 years.Directorate General of Immigration & Passports Website Under national law, Pakistani passports are explicitly invalid for all travel to the State of Israel, and Pakistani nationals are likewise strictly barred from travelling to the Jewish state under all circumstances. Pakistan is the only country in the world that does not recognize Armenia as a state. In 2019 after an interview with WION, Prime Minister Nikol Pashinyan has stated that Armenia supports India in the Kashmir conflict between India and Pakistan. Therefore travelling to Hayastan is not permitted there either. == Physical appearance == Ordinary Pakistani passports have a deep green cover with golden-coloured content. The Emblem of Pakistan is emblazoned in the center of the front cover. The words 'Islamic Republic of Pakistan' (English) are inscribed above the emblem and '', '' and 'Passport' (English) are inscribed below the emblem. === Discontinued types === Pakistan formerly issued a special Hajj passport to Pakistani nationals making an Islamic pilgrimage known as Hajj to Mecca, Saudi Arabia. These are no longer issued, and ordinary Pakistani passports may now be used for this purpose. === Passport holder identity === * The opening cover end contains the following information: ** Photo of passport holder ** Type 'P'- stands for \"Personal\", 'D'- stands for \"Diplomat\", - S'- stands for \"Service\" ** Country Code ** Passport number ** Surname ** Given name ** Nationality ** Date of birth ** Citizenship number ** Gender (Third Gender Inclusive) - Pakistan issues first passport with Transgender category. ** Place of birth ** Father name ** Date of issue ** Date of expiry **Issuing authority ** Tracking number ** Booklet number * 1st page of regular booklet contains the note from President of Pakistan (mentioned later). * 2nd page mentions ANNOTATION on the top and contains the following ** Religion ** Previous passport number (if any) ** Signature of the passport holder * 3rd page declares that the passport is valid to travel to all countries of the world except Israel. == References == Pakistan Category:Law of Pakistan Category:Nationality",
 "title": "Pakistani passport"
}