{
 "id": "856680",
 "text": "Macross Digital Mission VF-X is a 3D shooting game developed by UNiT and published by Bandai Visual for the Sony Playstation, released on February 28, 1997. The game takes place a year after the events of the Macross 7 television series and follows the VF-X Ravens unit. The game was followed by a sequel, Macross VF-X2 in September 2, 1999. == Overview == This is a shooting game based on the Macross series, and is a wholly original setting not based on any previous works or series. It is set one year after Macross 7. The game was initially planned as a fully polygonal 3D shooter, and the Sony PlayStation perfectly suited the game's ambition in terms of graphics. Development began in 1995. The development involves the main creators of the Macross series, such as Shōji Kawamori (Valkyrie Design, Supervisor), Kazutaka Miyatake (Ship / Mecha Design), Haruhiko Mikimoto (Main Character Design). The game was noted for including the transformable modes of the VF-4 Lightning III, which had only been previously seen as a fighter on The Super Dimension Fortress Macross: Flash Back 2012. Until the game's development, Macross-related games were released on family computers, PC engines and arcades without the involvement of Shōji Kawamori. Kawamori was uninterested in video game development at that point because he could only do 2D, but he had become interested when he learned the game was being made in 3D for the Sony Playstation. == Plot == In A.D. 2047, the five member idol group \"Milky Dolls\", who had been scheduled to participate in the next \"ZENTRADI sound project\", are abducted by unknown hostile force during a U.N. Spacy commemorative ceremony. Escaping in a camouflaged spaceship, the abductors folded to the planet Elysion. The U.N. Spacy high command then orders the VF-X Ravens and the crew of the Valhalla III to rescue the Milky Dolls and uncover the identity of the mysterious armed force. They turn out to be a rogue Zentradi militia. === Missions === A series of missions takes place in the game under \"Operation Orpheus\". The enemies of the VF-X Ravens are primarily rogue Zentradi forces, consisting of Battle Pods * Battle battle with VF-4G. Only the VF-1X-Plus SP Valkyrie can be used. * Destroy enemy radar sites in urban areas. The VF-4G can be used in this stage. ** One of the Milky Dolls' members, Liatris is rescued. * Destroy enemy satellites. * Destroy enemy ground base. VF-11 Thunderbolt and VF-17 Nightmare are available from this stage. * Destroy enemy air units. * Elimination of enemies in the airspace around Valhalla III. Plunge into the atmosphere from the middle and pursue. * Follow the enemy transport boat and locate and destroy the enemy weapon factory. The VF-19 Excalibur and VF-22 Sturmvogel II are be available in this stage. * Eradication of enemy units in urban areas. ** Violeta speaks to the player. * Final battle with the enemy fortress. ** The Milky Dolls persuade the Captain of the Valhalla III to perform on a battle stage against the enemy. == Characters == === Valhalla III Crew === * Main Character (VF-X) * Valhalla III Captain * Miho Miho * Karen Allen * Powan Howan * Euri Yui === Milky Dolls === * Aoi Tsuwabuki * Liatris * Molly * Violeta * Freesia === Unidentified Enemy === * Enemy Commander (VF-X) * Enemy Rival (VF-X) == Mechanic == === Valhalla III === * VF-1X Valkyrie Plus (Atmosphere Missions Only) * VF-1X Super Valkyrie Plus (Space Missions Only) * VF-4 Lightning III * VF-11 Thunderbolt * VF-17 Nightmare * VF-19 Excalibur * VF-22 Sturmvogel II * VC-551 Valhalla III === Unidentified Enemy === * Regult Kai * Glaug Kai * Quell Quallie * Gnerl * Fz-150 Feios Valkyrie == Music == === Opening Theme === * Try Again ** Lyrics- K . INOJO, Fukuyama Atsuko, composition- Yoshiki Fukuyama, arrangement - Tanaka Atsushi **Song - Fire Bomber === Theme Song === * Only You ** Lyrics and composition- Mari Iijima, arrangement - Shimizu Nobuyuki, Milky Dolls ** Milky Dolls' theme song. ** Shimizu, who was provided by Iijima who played Lynn Minmay, was the arranger for Shimizu, who once served as the arranger for the song Do You Remember Love?, which Iijima sang. === Ending Theme === * Rainbow Palette ** Lyrics-Composition by Hiroshi Hiroshi, Yamakawa Kekkoka and Milky Dolls == Reception == The game received fairly negative reviews. Gamespot saying \"Macross VF-X looks elegant at times, but ultimately fails to capture the emotion, the excitement, and the sheer visual splendor of its source material.\", citing how the game featured lengthy, boring missions and poor control flight mechanics, controls and physics. Many others have criticized the game's horrible audio / sound effects and poor music, which utilized MIDI arrangement. These criticisms would later be rectified in its sequel, Macross VF-X2. == Notes & Trivia == * The Milky Dolls was one of the first appearances of a proper idol group for the franchise's history. The concept of idol groups had been seen with the Jamming Birds in Macross 7 and would later explored further with Walküre for Macross Δ. * Maximilian Jenius' VF-1X Plus is an unlockable playable aircraft. * The final Milky Doll song, \"Only You\", was written and composed by Mari Iijima herself. * The game notably starred infamous voice actress Kikuko Inoue playing the role of Liatris of the Milky Dolls. She had previously played roles such in Kekko Kamen and Ikki tousen. == Related Products == === Soundtrack === * MACROSS DIGITAL MISSION VF-X ORIGINAL SOUNDTRACK ** Victor Entertainment, released March 21, 1997, CD: VICL-789 ** Otani is the composer of game music. Includes 20 BGM songs and 3 songs. === Strategy Guide === * Macross Digital Mission VF-X Official Program ** Mediax, March 20, 1997, First edition. ISBN 978-4896137538 * Macross Digital Mission VF-X Strongest Capture Guide ** Shogakkan, April 10, 1997, First edition. ISBN 978-4091025777 == Related pages == === Series === * Super Dimension Fortress Macross === Movies === * The Super Dimension Fortress Macross: Flash Back 2012 * Super Dimensional Fortress Macross II: Lovers Again == Other websites == * Macross Mecha Manual * MAHQ * https://www.gamespot.com/reviews/macross-digital- mission-vf-x-import-review/1900-2548176/ * https://gamefaqs.gamespot.com/ps/197818-macross-digital-mission-vf-x/faqs/4549 Category:PlayStation-only games Category:PlayStation games Category:Shooter games Category:1997 video games Category:Japan-exclusive video games Category:Video games developed in Japan",
 "title": "Macross Digital Mission VF-X"
}