{
 "id": "85663",
 "text": "2014 (MMXIV) was a common year starting on Wednesday in the Gregorian calendar, the 2014th year of the Common Era (CE) and Anno Domini (AD) designations, . == Summary == * In 2014, the news was dominated by wars and conflicts in the Middle East, Ukraine, South Sudan, Nigeria and Afghanistan. **War erupted in Eastern Ukraine after the Pro-EU Euromaidan protests toppled President Viktor Yanukovych and separatists declared independence in the East, followed by a referendum in Crimea in support of joining Russia. **In the Middle East, the extremist group Islamic State of Iraq and the Levant got involved in civil wars in Syria and Iraq. Separately, war broke out between Israel and the Gaza Strip in July and August **In Nigeria, hundreds of girls were abducted in April by Boko Haram. * 2014 also saw the outbreak of Ebola in Guinea, Liberia and Sierra Leone, infecting and killing thousands of people, and leading to a massive humanitarian crisis in the region. * Malaysia Airlines was involved in two air disasters in 2014. Malaysia Airlines Flight 370 goes missing in March on a flight from Kuala Lumpur to Beijing and has, as of the end of 2014, not been found. Malaysia Airlines Flight 17 is shot down during the conflict in Eastern Ukraine in July, killing all people on board. Another Malaysian-based airline, \"AirAsia\" also suffered a disaster at the end of the year, as Indonesia AirAsia Flight 8501 disappeared off Borneo and was later found to have crashed, killing all 162 people on board. * In July and August, the \"Ice Bucket Challenge\" was a trend of pouring cold water over people's heads for charity. A continuing trend of the year was the selfie. * In science, the year's biggest achievement was landing a spacecraft on a comet, which was done in November by the Philae probe as part of the Rosetta mission. * In Sport, the year saw the Germany national football team win the 2014 FIFA World Cup in Brazil. The 2014 Commonwealth Games took place in Glasgow, Scotland and the 2014 Asian Games took place in Incheon, South Korea. The 2014 Winter Olympics took place in Sochi, Southern Russia, in February. == Events == === January === * January 1 - Latvia begins using the Euro. * January 1 - Greece assumes the six-month Presidency of the Council of the European Union. * January 1 - Bill de Blasio becomes Mayor of New York City. * January 6 - Severe cold weather hits the upper area of North America, which includes Canada and the United States. Record-breaking weather is recorded in Minneapolis, Minnesota and Chicago, Illinois. Several people are killed because of the cold weather. * January 10 - Former Prime Minister of Poland Zbigniew Messner died from a heart attack. He was 84 years old. * January 25 - A shooting breaks out at a mall in Maryland. Four people are killed including the gunman. Police officers disarmed explosive devices in gunman's bag. * January 27 - Juan Orlando Hernández is elected to be Honduras' new President. He succeeds Porfirio Lobo Sosa. * January 29 - Bohuslav Sobotka becomes the new Prime Minister of the Czech Republic. * January 29 - Scientists in Japan announce that shocking blood cells with acid could also trigger the transformation into stem cells, a process far easier than producing IP cells. The cells are termed STAP (Stimulus-Triggered Acquisition of Pluripotency) cells. === February === * February 1 - Janet Yellen becomes head of the United States Federal Reserve. * February 4 - The Klallam language becomes extinct after its last native speaker, Hazel Sampson, died at 103. * February 4 - Satya Nadella becomes head of Microsoft. * February 4 - The Scottish Parliament votes in favor of legalizing Same-sex marriage in Scotland. * February 7 - The inauguration of the 2014 Winter Olympics in Sochi is held. * February 13 - Belgium becomes the first country in the world to legalize euthanasia without any age limits. * February 14 - Prime Minister of Italy Enrico Letta loses a vote of confidence in parliament. * February 15 - Tammam Salam becomes Prime Minister of Lebanon and announces the formation of a new government. * February 22 - Ukrainian president Viktor Yanukovich flees to Kharkiv as parliament votes to impeach him as part of the Euromaidan protests. * February 22 - Mexico's most wanted drug-cartel Joaquín Guzmán Loera is captured and arrested near Mexico City. * February 22 - Oleksandr Turchynov becomes acting President of Ukraine after Viktor Yanukovich is forced-out of office because of Euromaidan. * February 22 - Matteo Renzi, Mayor of Florence, becomes Prime Minister of Italy. * February 23 - The 2014 Winter Olympics in Sochi end. The closing ceremony is held, and Russia wins the most gold medals. * February 24 - Actor and movie director Harold Ramis, who appeared in Ghostbusters, died in Chicago from a heart defect. He was 69 years old. * February 26 - Pro-Russian unrest leads to the annexation (taking over) of Crimea by Russia and insurgencies in the Donetsk and Luhansk regions in the east of the country. === March === * March 2 - 12 Years a Slave is the most successful movie at the 86th Academy Awards. * March 5 - Nicolás Maduro, the President of Venezuela, severs diplomatic and political ties with Panama, accusing Panama of being involved in a conspiracy against the Venezuelan government. * March 8 - Malaysia Airlines Flight 370, a Boeing 777 airliner en route from Kuala Lumpur to Beijing, disappears over the Gulf of Thailand with 239 people on board. * March 11 - Michelle Bachelet becomes the new President of Chile. * March 11 - The Republic of Crimea declares its independence from Ukraine and Russia. * March 16 - A referendum on the status of Crimea is held. * March 18 - Chechnyan Islamic terrorist Dokka Umarov is declared dead by the Russian government. * March 21 - Russia formally annexes Crimea after President Vladimir Putin signed a bill finalizing the annexation process. * March 22 - A large mudslide east of Oso, Washington, kills 41 people, 4 were seriously injured, and 2 are missing. * March 24 - The Malaysian government and airline officials announce that Malaysia Airlines Flight 370 crashed somewhere in the Indian Ocean off the coast of Australia. All 239 passengers are presumed dead. * March 24 - The Madrid–Barajas Airport, Madrid's largest airport, is renamed to the Adolfo Suárez, Madrid–Barajas Airport to honor the late Prime Minister of Spain Adolfo Suárez. * March 24 - Russia is suspended from G8. * March 27 - The United Nations General Assembly passes Resolution 68/262, recognizing Crimea within Ukraine's international borders and underscoring the invalidity of the 2014 Crimean referendum. * March 29 - Andrej Kiska was elected to become the new President of Slovakia. * March 31 - Manuel Valls becomes the new Prime Minister of France. He succeeds Jean-Marc Ayrault. * March 31 - Adolfo Suárez's state funeral was held in Madrid. * March 31 - North Korea and South Korea exchange fire across the disputed western sea border after North Korea held live fire drills in seven parts of the area. * March 31 - The United Nations International Court of Justice rules that Japan's Antarctic whaling program is not scientific but commercial and forbids grants of further permits. === April === * April 3 - Nobel Prize laureate, Gabriel García Márquez, is hospitalized in Mexico for a respiratory and urinary tract infection. * April 5 - Presidential elections are held in Afghanistan. * April 8 - Windows XP reaches its end-of-life and is no longer supported by Microsoft. * April 10 - In response to the 2014 Crimean crisis the Parliamentary Assembly of the Council of Europe (PACE) passes a resolution, with 145 votes in favor, to temporarily strip Russia of its voting rights, the rights to be represented in the Bureau of the Assembly, the PACE Presidential Committee, the PACE Standing Committee and the right to participate in election-observation missions. * April 14 - An estimated 276 girls and women are kidnapped from a school in Northern Nigeria by Boko Haram, and are held hostage. * April 16 - A South Korean ferry capsizes and sinks of the coast of Jindo County. 300 people are killed. * April 18 - A massive avalanche hits Mount Everest killing 16 people and injuring 9. * April 22 - David Moyes is sacked as manager of Manchester United, one of the world's biggest football clubs, less than a year after taking over from Alex Ferguson. * April 27 - The Catholic Church canonizes Popes John XXIII and John Paul II on Divine Mercy Sunday. * April 28 - US President Barack Obama's new sanctions against Russia go into effect. === May === * May 2 - A pair of massive mudslides occur in Argo District, Badakhshan Province, Afghanistan, burying estimated 2,500 people. * May 5 - The World Health Organization identifies the spread of poliomyelitis in at least 10 countries as a major worldwide health emergency. * May 5 - Boko Haram militants kill approximately 300 people in a night attack on Gamboru Ngala. * May 7 - Prime Minister of Thailand Yingluck Shinawatra is removed from office. * May 10 - Eurovision Song Contest is held in Copenhagen, Denmark. Conchita Wurst of Austria wins with the song \"Rise Like a Phoenix\". * May 11 - Massive flooding begins in regions of Southeastern Europe. * May 13 - Around 300 miners are killed in a mine explosion in Soma, Western Turkey. * May 20 - Terrorists in Nigeria detonate bombs at Jos, killing 118 people. * May 22 - The Royal Thai Army overthrows the caretaker government of Niwatthamrong Boonsongpaisan after a failure to resolve the political unrest in Thailand. * May 22 - 25 - Elections to the European Parliament are held, with far-right parties making gains. * May 25 - Petro Poroshenko is elected President of Ukraine. * May 26 - Narendra Modi is sworn in as Prime Minister of India. * May 28 - Abdel Fattah el-Sisi is elected President of Egypt. * May 30 - Jay Carney resigns as White House Press Secretary. * May 31 - Peter Mutharika is elected President of Malawi. === June === * Early June - Hundreds of people are killed in a flooding disaster in Afghanistan. * June 2 - Juan Carlos I of Spain announces that he is abdicating the throne as King of Spain in favor of his son Felipe, Prince of Asturias. * June 2 - Telangana becomes India's 29th state. * June 4 - 3 RCMP officers are shot and killed in Moncton, New Brunswick, Canada. * June 5 onwards - A Sunni extremist group, Islamic State of Iraq and the Levant attempts to take control of Baghdad in order to overthrow the Shiite government of Nouri al-Maliki. * June 5 - The tenth anniversary of the Death of Ronald Reagan is mourned in the United States. * June 6 - Commemorations are held to mark 70 years since the D-Day landings. * June 7 - Petro Poroshenko is sworn in as President of Ukraine. * June 8 - Abdel Fattah el-Sisi is sworn in as President of Egypt. * June 10 - Reuven Rivlin is chosen as the next President of Israel. * June 12 - The 2014 FIFA World Cup in Brazil begins. * June 15 - Andrej Kiska becomes President of Slovakia. * June 18 - Luxembourg decides to legalize Same-sex marriage. * June 18 - The Spain national football team, defending champion, is knocked out of the 2014 FIFA World Cup at the group stage by the Chile national football team. * June 19 - King Felipe VI of Spain is officially sworn in, succeeding his father, King Juan Carlos I of Spain. * June 23 - Three Al-Jazeera journalists are sentenced to prison in Egypt, accused of supporting the banned Muslim Brotherhood. * June 24 - Alexander Stubb becomes Prime Minister of Finland. * June 24 - Albania becomes an EU candidate country. * June 24 - FIFA World Cup: Uruguayan footballer Luis Suarez is involved in a biting controversy, after footage appeared to show him biting Italy's Giorgio Chiellini. * June 27 - Former Prime Minister of Luxembourg Jean-Claude Juncker is chosen as the next President of the European Commission. === July === * July 1 - Italy assumes the six-month Presidency of the European Union. * July 8 - Operation Protective Edge, an offensive launched on the Palestinian Gaza Strip by the Israel Defense Forces (IDF), begins, starting with numerous missile strikes, following growing tensions between Israel and Hamas following the kidnapping and murder of three Israeli teenagers in June. * July 8 - Brazil v Germany: Several FIFA World Cup records are broken as the Germany national football team defeats the Brazil national football team 7–1 in a Semi Final match. One the records is Miroslav Klose scoring his record-breaking 16th goal in FIFA World Cup competition. * July 13 - The final of the 2014 FIFA World Cup was held in Rio de Janeiro. Germany defeats Argentina. * July 17 - After a five-hour humanitarian ceasefire, Israel confirms the beginning of a ground offensive in Gaza. * July 17 - Malaysia Airlines Flight 17 (Boeing 777) crashes in Ukraine, after being shot down by a missile. 298 people die, including 15 crew members. * July 21 - The United Nations Security Council adopts Resolution 2166 in response to the shootdown of Malaysia Airlines Flight 17. * July 23 - The 2014 Commonwealth Games begin in Glasgow, Scotland. * July 24 - Air Algérie Flight 5017 crashes in Mali, killing all 116 people on board. * July 24 - Reuven Rivlin became President of Israel. === August === * August 3 - The 2014 Commonwealth Games end in Glasgow, Scotland. * August 5 - American general, Harold J. Greene, is killed by an Afghan soldier while traveling to a facility. He becomes the first high ranking general to be killed since the September 11 attacks. * August 7 - Khmer Rouge leaders Nuon Chea and Khieu Samphan are found guilty of crimes against humanity. * August 8 - The United States Military begins a series of air strikes in northern Iraq to stem the flow of ISIS militants. * August 9 - The Shooting of Michael Brown, an 18-year-old African American by a police officer in Ferguson, Missouri, leads to widespread protests across the US and a debate about race relations in the country. * August 10 - Recep Tayyip Erdogan is elected President of Turkey. * August 11 - Comedian and Academy Award-winning actor, Robin Williams, commits suicide at his home in Tiburon, California. He was 63 years old. * August 13 English film producer, Norman Spencer, becomes a centenarian. * August 19 - American photojournalist, James Foley, is beheaded by the Islamic State of Iraq and the Levant as revenge for the U.S. airstrikes in Iraq. * August 25 - The New Horizons probe arrives at Neptune after nearly 9 years of travelling in space. Coincidentally, this is also 25 years since Voyager 2 arrived at Neptune. This will be the last milestone before it reaches Pluto on July 14th 2015. * August 28 - Recep Tayyip Erdogan becomes President of Turkey. * August 30 - Prime Minister of Poland Donald Tusk is chosen as the next President of the European Council. === September === * September 2 - It is presumed that American journalist Steven Joel Sotloff is beheaded by the militant group Islamic State. * September 3 - Flooding begins to affect areas of Northern India and Pakistan. * September 6 - An opinion poll published ahead of the Scottish independence referendum shows the campaign in favor of independence narrowly ahead for the first time. * September 9 - Apple announces three new products: the iPhone 6, iPhone 6 Plus, and the Apple Watch. * September 14 - Sweden holds its parliamentary election. * September 18 - The Scottish independence referendum is held. The majority of people vote no (55.3%) and 44.7% vote yes. * September 19 - Alex Salmond announces his resignation as First Minister of Scotland, following the \"Yes\" campaign's defeat in the independence referendum. * September 19 to October 4 - The 2014 Asian Games are held in Incheon, South Korea. * September 20 - New Zealand Election: The New Zealand National Party under John Key wins a third term in office. * September 22 - Ewa Kopacz becomes Prime Minister of Poland, succeeding Donald Tusk. * September 22 - The United States and its Arab partners begin an airstrike campaign in Syria. * September 26 - September 28 - The Ryder Cup golf tournament is held at Gleneagles, Scotland. Europe comfortably defeats the United States. * September 26 - The 2014 Hong Kong protests begin, in support of greater democracy for Hong Kong, lasting until December. * September 26 - A conference of Nobel Prize winners in Cape Town, South Africa, is cancelled, after a row over Tenzin Gyatso, 14th Dalai Lama not being allowed to enter the country. * September 27 - Mount Ontake, in Japan, erupts, killing several climbers on the slopes of the volcano. === October === * October 1 - Jens Stoltenberg becomes Secretary-General of NATO, succeeding Anders Fogh Rasmussen. * October 3 - Stefan Lofven becomes Prime Minister of Sweden, returning the Social Democrats to power after eight years. * October 3 - Islamic State post a video showing the killing of British aid worker Alan Henning. * October 10 - Malala Yousafzai and Kailash Satyarthi win the 2014 Nobel Peace Prize. At age 17, Malala is the youngest winner of a Nobel Prize in any category. * October 11 - Charles Michel becomes Prime Minister of Belgium. * October 16 - Apple announces the iPad Air 2 and the iPad Mini 3. * October 19 - The Roman Catholic Church makes Pope Paul VI a saint. * October 20 - Joko Widodo becomes President of Indonesia. * October 22 - A gunman in Ottawa, Canada, shoots a Canadian soldier dead at the city's war memorial, before shooting inside the Canadian Parliament, where he is shot dead himself. * October 23 - Some parts of the world experience a partial solar eclipse. * October 26 - Dilma Rousseff is elected to a second term as President of Brazil. * October 31 - Blaise Campaore resigns as President of Burkina Faso after unrest in the capital city, Ouagadougou. === November === * November 1 - Jean-Claude Juncker becomes President of the European Commission. * November 2 - The Intergovernmental Panel on Climate Change (IPCC) releases the last part of the IPCC Fifth Assessment Report. * November 4 - The United States holds its Mid-Term Elections, where the Republican Party makes strong gains against the Democratic Party. * November 7 - Former Soviet Union leader Mikhail Gorbachev warns against a new \"Cold War\" between Russia and the West over Ukraine, while attending commemorations marking 25 years since the Fall of the Berlin Wall. * November 9 - Catalonia holds an unofficial vote on independence from Spain. * November 12 - The Rosetta spacecraft's Philae space probe lands on comet 67P/Churyumov-Gerasimenko. It is the first landing of a spacecraft on a comet. * November 15 to 16 - The G20 Summit is held in Brisbane, Australia. * November 16 - Klaus Iohannis is elected President of Romania. * November 19 - Nicola Sturgeon succeeds Alex Salmond as First Minister of Scotland. * November 23 - Lewis Hamilton wins the Formula One World Championship. * November 24 - Sony is hacked by an as-yet unknown group. As this includes the movie \"The Interview\", about a fictional plot to kill North Korean leader Kim Jong-un, this leads to a diplomatic row between the United States and North Korea. * November 25 - Pope Francis holds a speech at the European Parliament. === December === * December 1 - Donald Tusk becomes President of the European Council. * December 1 - The militant group Al-Shabaab carries out an attack in Northeastern Kenya, killing over 30 Non-Muslims. * December 2 - Stephen Hawking warns against artificial intelligence in a BBC interview, saying that it poses a threat to future human existence. * December 9 - The United States Senate releases a report on CIA torture during the War on Terror. * December 14 - Japan holds an early election. * December 15 - 2014 Sydney hostage crisis: Self-styled cleric Man Haron Monis takes several people hostage at gunpoint in a café in Sydney, Australia. The end of the siege early the following day kills three people, including the gunman. * December 16 - Members of the Pakistan Taliban carry out a massacre at a school in the city of Peshawar, killing over 140 people, mostly children. * December 17 - Sony stops the release the movie \"The Interview\" about North Korean leader Kim Jong-un, following threats from hackers. It is later released in private cinemas. * December 17 - US President Barack Obama declares a normalization in diplomatic relations with Cuba. * December 22 - Building work begins on a project to build a canal across Nicaragua. * December 25 - The movie The Interview is released in private cinemas in the United States, despite threats by hackers. * December 28 - \"Indonesia AirAsia Flight 8501\" goes missing on a flight from Surabaya, Java, Indonesia to Singapore. It is later revealed to have crashed, killing all 162 people on board. * December 28 - The ferry MS Norman Atlantic catches fire off the island of Corfu, while travelling from Patras, Greece to Ancona, Italy. At least 13 people die, while most of the passengers are rescued. * December 29 - Elections are called for January 2015 in Greece, after the parliament failed to elect a new President. * December 31 - The first same-sex marriages in Scotland take place. * December 31 - All US and UK combat missions in Afghanistan end. == Nobel Prizes == * Physiology or Medicine: John O'Keefe, May-Britt Moser, Edvard Moser * Physics: Isamu Akasaki, Hiroshi Amano, Shuji Nakamura * Chemistry: Eric Betzig, Stefan Hell, William E. Moerner * Literature: Patrick Modiano * Peace: Malala Yousafzai and Kailash Satyarthi * Economics: Jean Tirole == Major holidays and dates == * January 6 - Epiphany Christian celebration * January 7 - Orthodox Christmas * February 1 – Imbolc (Celebrated on February 2 in some places) * March 4 – Shrove Tuesday * March 5 – Ash Wednesday * March 17 – St. Patrick's Day * March 20 – Spring Equinox * April 13 - Palm Sunday * April 18 - Good Friday * April 20 – Easter Sunday * April 21 - Easter Monday * May 1 – May Day * June 21 – Summer solstice, also known as Midsummer * August 1 – Lammas * September 23 – Fall Equinox * October 4 – Eid al-Adha * October 23 - Diwali (Hinduism) * November 1 – All Saints Day and Samhain * November 30 - First Sunday of Advent * December 21 – Winter solstice * December 25 – Christmas == Births== == Deaths == == In fiction == === Movies === * Moon Child (2003) * The Flash movie EPIC 2014 concludes in this year. === Television === * In the Supernatural episode \"The End\", the angel Zachariah sends Dean Winchester to this year to convince him to be a host for Michael. In this future, the Croatoan virus has spread across the world, Sarah Palin is president, and Sam Winchester is the host for Lucifer. * In Desperate Housewives, Edie Britt dies and her ashes scattered across Wisteria Lane. === Computer and video games === * Soldiers of Anarchy (2002) * Shattered Union: The Second American Civil War begins in this year. * Ghost Recon Advanced Warfighter 2 (2007) * Metal Gear Solid 4: Guns of the Patriots (2008) === Anime and manga === * Neon Genesis Evangelion some events in this series take place. * Alien Nine (2001) * One of the time arcs in 20th Century Boys takes place in 2014. == References ==",
 "title": "2014"
}