{
 "id": "856670",
 "text": "The Hound of the Baskervilles is a 1959 British mystery horror movie directed by Terence Fisher and was based on the 1902 novel of the same name by Arthur Conan Doyle and was the first adaption to be made in colour. It stars Peter Cushing, Christopher Lee, André Morell, Marla Landi, David Oxley, Miles Malleson, Sam Kydd, Helen Goss, Ewen Solon and was distributed by United Artists. ==Plot== Dr. Richard Mortimer recounts to Sherlock Holmes and Doctor Watson the legend of the ghost hound that killed the devilish Sir Hugo Baskerville for his murder of the daughter of a servant. He asks Holmes to investigate the death of his friend Sir Charles Baskerville, in Dartmoor, from heart failure, lying in the moor surrounding his estate, Baskerville Hall, with a look of horror on his face. Mortimer fears for the life of Sir Henry, who's just come from South Africa to take possession of his inheritance and of Baskerville Hall. Although sceptical, Holmes and Watson accept to meet Sir Henry, who is young and bold, but in truth suffers from a congenital heart problem. A incident with a tarantula convinces Holmes that Sir Henry's life is indeed in danger, and, busy with a prior commitment, he chooses to despatch Watson to Dartmoor with Mortimer and Sir Henry. Holmes reminds Sir Henry not to go out onto the nearby moor after dark. On their way to Baskerville Hall, the trio is warned by the coach driver Perkins that a murderous convict named Selden has escaped from nearby Dartmoor Prison and is hiding on the moor. At Baskerville Hall, Sir Henry gets acquainted with his new house, helped by the butler, Mr. Barrymore, and his wife. On the walls stands a portrait Sir Hugo. A second portrait of Sir Hugo is missing, and the Barrymores are unable to offer any explanation. The next day, Sir Henry and Watson walk around to see the neighborhood. At the nearby village, they meet the comedic local pastor, Bishop Frankland, who is also a keen entomologist. While crossing the moor, Watson finds the Grimpen Mire and Watson gets trapped in a patch of quicksand. Two people come to help, a man named Stapleton and his daughter Cecille, a wild girl who immediately bewitches Sir Henry. One night, Watson sees a light in the moor. He and Sir Henry go out to investigate, but a strange man rushes by in the shadows, then a distant hound howls, upsetting Sir Henry so much that he suffers a heart condition. Watson spots a man silhouetted on a hill in the distance, while he helps Sir Henry back to Baskerville Hall. Watson finds the silhouetted figure to be Holmes, who has concealed his own arrival to investigate more freely. After his death, Holmes and Watson find the corpse of the convict Selden, mutilated in a ritual, while wearing clothes belonging to Sir Henry, and the legendary curved dagger used by Sir Hugo. This clue exposes the Barrymores, who confess to have helped the escapee, who was their relative, by supplying food and other provisions each time he signalled with a light from his hideout. However, Holmes has evidence that neither the Barrymores nor Selden are connected to the death of Sir Charles, so he keeps on searching for clues to confirm the existence of the mysterious hound and the identity of its masters. Facing personal danger in an abandoned copper mine, and thanks to the stolen portrait of Sir Hugo, Holmes is able to guess the Stapletons are illegitimate descendants of Sir Hugo and are next in line to inherit the Baskerville fortune and mansion if all of the Baskervilles perish. Holmes deduces this after questioning Barrymore about the missing portrait; it was stolen because it revealed the fingers on Sir Hugo's right hand were webbed just like Stapleton's. Cecile takes Sir Henry out onto the same place where, according to the legend, the ghost hound had killed Sir Hugo. Holmes and Watson arrive just in time to hear Cecile reveal her intentions to a horrified Sir Henry. The dog attacks Sir Henry. Stapleton attacks with the dagger, but Watson shoots and wounds him. Holmes shoots the dog; it then turns on Stapleton and mauls him to death. Cecille flees after Holmes kills the beast, revealing it to be a Great Dane wearing a hideous mask to make it look more terrifying. Cecile accidentally falls into the mire and sinks to her death. Holmes and Watson take a shocked Sir Henry back to Baskerville Hall. ===Writing=== There are several significant changes in plot details. Among them: * The legend of the hound and Hugo Baskerville is heavily changed. In the original novel, the father of the farm girl who is kidnapped by Sir Hugo Baskerville is away when Hugo kidnaps her. In the film, the father is a servant of Hugo's and is cruelly abused when he protests for his daughter's life. Baskerville tortures the father by holding him over a fire in the hearth. In the novel, after the girl escapes, Baskerville chased her across the moor and Baskerville's companions followed him only to find Hugo and the farm girl dead. She had died from fear and exhaustion, and Hugo had been killed by the hound. In the film, Baskerville, all by himself against the protests of his companions, pursues the girl through the moor, his hounds and horse become frightened as they approach the nearby abbey ruins due to the sound of the hound howling but he dismounts and pursues the girl on foot, finds her and assaults her in a rage before he kills her with a curved dagger. Hugo is killed by the dog. * Sir Henry arrives from Toronto in the novel, while he arrives from Johannesburg in the film. Sir Henry does not suffer a minor heart condition in the novel, as he does in the film. * There is nothing involving a ritual sacrifice, a tarantula or a mine shaft in the novel, nor is Holmes thought to have been accidentally trapped in a cave-in. There is no attempt on the life of Sir Henry at the hotel in the novel, as in this film. * Rather than being Stapleton's daughter, Miss Stapleton is Stapleton's wife in the novel and is playing the part of his sister. She does not hate Sir Henry, as she does in the film, and is a far more sympathetic character in both the novel and in nearly all the other film versions of the story. Cecil in the novel is named Beryl and is an unwilling participant. In the film, she is much more sinister. Miss Stapleton survives in the novel, whereas in the film she drowns in the Grimpen Mire. * Inspector Lestrade, who appears in the novel, is omitted from the film. * In the novel, the hound is made to look \"demonic\" through the use of phosphorus paint, but in the film the same effect is accomplished with a mask. The hound was played by a brindled Great Dane. * The painting next to the staircase does not go missing in the novel, as Stapleton's webbed hand is a creation of the filmmakers. * In the novel, Frankland is neither a bishop nor an entomologist. It is Stapleton, rather than Frankland, who is an acknowledged expert in entomology in the novel. * Stapleton does not get mauled to death after being shot by Watson in the novel; he simply disappears and is presumed to have drowned in the Grimpen Mire. * Dr. Mortimer is never put in charge of watching over Sir Henry in the novel; therefore he is not considered negligent by Watson when Sir Henry ventures out onto the moor alone. Mortimer in the novel is an \"amiable, unambitious, absent-minded\" doctor in his late twenties. The film's version is much older and is made deliberatley unlikable from the start as a red herring. The Conan Doyle Estate did not approve of the changes made to suit Hammer's more horror-centric success. Cushing, however, took no objection to the changes as he felt the character of Holmes remained intact.Earnshaw, p. 10 ===Casting=== Cushing was an aficionado of Sherlock Holmes and brought his knowledge to the project. He reread the stories, made detailed notes in his script and sought to portray Holmes closer to his literary counterpart. It was Cushing's suggestion that the mantlepiece feature Holmes' correspondence transfixed to it with a jackknife as per the original stories. However, when producer Anthony Hinds suggested excluding the famous deerstalker Cushing objected, saying Holmes' headgear and pipes would be expected by the audience.Earnshaw, p. 10 Cushing scrutinised the costumes and screenwriter Peter Bryan's script, often altering words or phrases.Earnshaw, p. 11—12 Lee later claimed to be awestruck by Cushing's ability to incorporate many different props and actions into his performance simultaneously, whether reading, smoking a pipe, drinking whiskey, filing through papers or other things while portraying Holmes.Lee, Christopher (actor). (2002). Actor's Notebook: Christopher Lee. [Documentary, from The Hound of the Baskervilles DVD]. Greg Carson: MGM Home Entertainment. Retrieved 19 September 2010. Morell was particularly keen that his portrayal of Watson should be closer to that originally depicted in Conan Doyle's stories, and away from the bumbling stereotype established by Nigel Bruce's interpretation of the role. David Oxley had an extraordinarily powerful voice that he used to great effect, being able to fill an auditorium without the aid of microphones, and seen to best effect as Hugo Baskerville. ==References== ==Other websites== * Category:1959 horror movies Category:1950s mystery movies Category:British horror movies Category:British mystery movies Category:Movies based on books Category:Movies directed by Terence Fisher",
 "title": "The Hound of the Baskervilles (1959 movie)"
}