{
 "id": "856678",
 "text": "Baywatch is a 2017 American action-comedy movie. It was adapted off the television series of the same name. Principal photography started on February 22, 2016 across Florida and Savannah, Georgia. Baywatch was released in May 2017. The movie got substandard reviews from the critics, mostly for its crude humor and character developments. However, it had a box office intake of just over $58 million in the United States. It made another $119.8 million in several other territories. The total box office intake was around $177.8 million. The movie's budget was $69 million. Baywatch was given five nominations in the 38th Golden Raspberry Awards. The categories were the Worst Prequel, Remake, Rip-off or Sequel, the Worst Screenplay, the Razzie Nominee So Rotten You Loved It and the Worst Picture. ==The reviews== Baywatch received an approval rating of only 17% under Rotten Tomatoes. Critics from the movie judging site said: \"Baywatch takes its source material's jiggle factor to R-rated levels, but lacks the original's campy charm – and leaves its charming stars flailing in the shallows.\" It received a rating of 37 out of 100 under Metacritic. That meant \"generally unfavorable reviews.\". Writing for the Rolling Stone magazine, Peter Travers was happy with the \"easy rapport\" from Dwayne Johnson and Zac Efron. Travers stated, though, \"what [the film] needs more is a functional script\". Travers rated the movie two out of four stars. He then said: \"Think of yourself sitting down for a big two-hour wallow in instant stupid with a vat of popcorn, slathered in fake butter and possibly a mound of melted M&Ms; on top. It feels great chugging it down, then your stomach hurts, your head aches and you puke the whole thing up so you can forget about it in the morning. That's Baywatch in a nutshell.\" Owen Gleiberman from the Variety magazine called it \"stupidly entertaining... for a while\". He was, however, not impressed with the movie's plot. ==The awards== Year Award Category Recipient(s) Result 2017 Teen Choice Awards Choice Movie: Comedy Actor Dwayne Johnson Zac Efron Choice Movie: Comedy Actress Alexandra Daddario Choice Movie: Villain Priyanka Chopra Choice Movie: Ship Dwayne Johnson and Zac Efron Golden Schmoes Awards Best T&A; of the Year Alexandra Daddario 2018 38th Golden Raspberry Awards Worst Picture Michael Berk, Gregory J. Bonann, Beau Flynn, Ivan Reitman, Douglas Schwartz Worst Screenplay Damian Shannon, Mark Swift, Jay Scherick, David Ronn, Thomas Lennon and Robert Ben Garant Worst Actor Zac Efron Worst Prequel, Remake, Rip-off or Sequel The Razzie Nominee So Rotten You Loved It ==References== Category:2017 comedy movies Category:2010s action comedy movies Category:American action comedy movies Category:Movies based on TV series",
 "title": "Baywatch (movie)"
}