{
 "id": "856889",
 "text": "Big business means large-scale and corporate-controlled business activities. The term big business refers to activities that run from \"huge transactions\" to the more general \"doing big things\". United States companies which are classified as big businesses include although are not limited to Walmart, Microsoft, Apple Inc., General Electric, Verizon Communications, Google, General Motors, Amazon, Tesla and Toyota. Apple Inc. had just over $2.1 trillion as of June 2021. Microsoft had almost $1.8 trillion by that same time. Tesla had about $641 billion by June 2021. The biggest United Kingdom business networks are HSBC, Barclays, Unilever and BP (called British Petroleum before 1998). ==The history of big business== According to the Oxford English Dictionary, the words big business were first mentioned in Frederic Clemson Howe's book The City: the Hope of Democracy' in 1905. The automotive industry started off small in the late 19th century. They grew very fast after large-scale gasoline was developed during the early 20th century. New technology from computers spread across the world in the years following World War II. Businesses built around computer technology include though are not limited to Microsoft, Apple Inc., Intel, IBM and Samsung. ==The criticism of big business== There are various efforts being made to investigate the effects of \"bigness\" toward workers, consumers and investors. The effects toward prices and competition are also being looked at. Large corporations have been subjected to strong controversy and criticism for abusing their employees, exploiting workers, political corruption, white-collar crime and corporate scandals. Contrary to popular belief, not all corporations in the United States associate with the Republican Party. Several companies, Delta Air Lines, Coca-Cola and Major League Baseball went against Georgia's new and restrictive voting laws. Amazon, Google and Starbucks signed a statement that was against legislation which would discriminate against people who have certain racial, ethnic or disability backgrounds and those with certain sexual preferences. Many Americans believe that corporations have too much power. Corporate concentration can lead to influence over government in areas such as tax policy, trade policy, environmental policy, foreign policy, and labor policy through lobbying. In 2005, the majority of Americans believed that big business has \"too much power in Washington.\" ==References== Category:Controversies Category:Business",
 "title": "Big business"
}