{
 "id": "856917",
 "text": "In United States law, conservatorship is when a protector or guardian is appointed by a court judge to manage the financial affairs for another person. This is usually because that person is old or has physical or mental health problems. People in a conservatorship are called conservatees. Conservatees are usually adults. A person in guardianship is called a \"ward\". The term ward is usually used in reference to minors (people under age 18). Conservatorship may also be used for corporations or organizations. ==Appointment of conservatorships== Conservatorship refers to the legal responsibility over a person who has a certain mental disorder or a physical health problem. This includes people affected with psychosis, suicidal ideation, certain levels of autism or in some other way are not able to make medical, financial or legal decisions for themselves. In relation to the government control of businesses and corporations, like Freddie Mac and Fannie Mae, conservatorship means more temporary control than does nationalization. ==Conservatorship controversy== A recent example of conservatorship controversy is that involving the American pop singer-songwriter Britney Spears. She was put into conservatorship by her father in 2008. The year before, Britney had a mental breakdown. Spears also shaved her head and hit paparazzi with an umbrella but that was because they were violently attacking her. In late 2008, the conservatorship was made permanent. This caused the Free Britney movements. In California there are two forms of conservatorship. The Lanterman-Petris-Short conservatorship starts off being temporary. This one is renewed every year if necessary. A probate (aka slavery) conservatorship does not have a temporary period. It does not automatically expire. Spears was in the latter (the probate form of conservatorship). Spears had wanted the conservatorship to be stopped because, she said, her father uses it to abuse and use her, and also it is clearly a dishonest strategy to steal her money and ruin her life. ==References== Category:Legal terms",
 "title": "Conservatorship"
}