{
 "id": "857383",
 "text": "A single parent is a parent who lives with their children but does not live with a spouse or partner. People may become single parents if they are breaking up with the other parent. This may happen because of domestic violence, sexual assault/rape, because the woman gives birth alone, because of abandonment, or by choice. Single-parent families are those having children that are in the control of one parent. ==Demographics== In homes in OECD countries in 2011, single-parent homes made up about 3-11%. The average was 7.5%. The percentage was highest in Australia (10%), Canada (10%), Mexico (10%), the United States (10%), Lithuania (10%), Costa Rica (11%), Latvia(11%) and New Zealand (11%). It was the lowest in Japan (3%), Greece (4%), Switzerland (4%), Bulgaria (5%), Croatia (5%), Germany (5%), Italy (5%) and Cyprus (5%). In homes having children in 2005–09, the percentage of single- parent homes was 10% in Japan, 16% in the Netherlands, 19% in Sweden, 20% in France, 22% in Denmark, 22% in Germany, 23% in Ireland, 25% in Canada, 25% in the United Kingdom and 30% in the United States. The U.S. majority increased from 20% in 1980 to 30% in 2008. In all OECD countries, most single-parent homes included a mother. Between 9% and 25% included a father. The lowest numbers were for Estonia (9%), Costa Rica (10%), Japan (10%), Ireland (10%) and the United Kingdom. The highest were in Norway (22%), Spain (23%), Sweden (24%), Romania (25%) and the United States (25%). ===Children=== In most single-parent families, the parent is the mother. In 2016, the number of 6–12 year olds living mostly with their fathers was between 5% and 36% in the many OECD countries. It was highest in Belgium (17%), Iceland (19%), Slovenia (20%), France (22%), Norway (23%) and Sweden (36%). It was the lowest in Lithuania (4%), Ireland (5%), Poland (5%), Estonia (7%), Austria (7%) and the United Kingdom (8%). In the United States it was 15%. ==Impact on parents== Over 9.5 million American families are each run by one woman. Single mothers are likely to have mental health problems, trouble with money, be at risk of poverty and receive low levels of social support. The mental health problems that affect single mothers include anxiety and depression. Often, low-income women cannot get good mental health care services. These women are less likely to receive mental health treatment. ==Impact on children== Children raised by a single parent are more likely than two-parent children to have these problems: failing grades at school, committing crimes, substance abuse, poverty and being dependent on welfare. One study showed that many American children from single-parent families are less good at mathematics and reading tests than other American children. In Sweden, research has shown that children living with one parent have far worse well-being, family relationships, mental health, peer friendships, physical health, bullying and cultural activities than families with both parents. ==Cultural norms and attitudes== Experts disagree about what the most important part of a family is, especially experts in the United States. Some people say that a single parent family is not really a family. ==References== Category:Personal life Category:Family Category:Controversies Category:Children",
 "title": "Single parent"
}