{
 "id": "857347",
 "text": "Dropping out means leaving school. Reasons students drop out include because they must work, for social reasons, because of harassment, because of illness or because they no longer trust the school system that they are leaving. Unlike failing or expulsion, dropping out is the student's decision and not the school's. ==Canada== In Canada, most students graduate from grade 12 by age 18. It was found by the Labour Force Survey (LFS) that by 2009, one in twelve 20-to-24 year old adults in Canada did not have a diploma from high school (Gilmore, 2010). The study also showed that males had higher dropout rates than females. Other people with stronger risks for dropping out were those outside urban/suburban areas or in the northern territories. Beginning from 1990 the Canadian dropout rates went down from 20% (1990) to around 9% (2010). From 2010 and after, however, the rate did not drop across Canada. When females drop out of high school, they get less money, the economic costs are greater and they have higher rates of unemployment than male dropouts. Female high school dropouts are more likely to rely on public support programs than male dropouts. ==United Kingdom== Dropping out of school is not allowed in the United Kingdom. Dropping out of college or universities, however, is allowed. Students under age 16 must attend a school with the General Certificate of Secondary Education (GCSE). ==United States== In the United States, dropping out means students entirely quit school before they graduate. About 1.2 million students drop out of high school every year in the United States. They do this for different reasons: bullying, family emergency, poor grades, depression, mental illness, bad environment or not enough freedom. Students who drop out of high school in the United States are more likely to be unemployed, homeless or receiving welfare. Members of certain racial or ethnic groups drop out at higher rates than white students. Students raised in single-parent families and low poor students are more likely to drop out. Many states say students must stay in school until they are 16, like in the United Kingdom. However, in 1972, the United States Supreme Court said that Amish students do not have to go to high school. ==References== Category:Society Category:Human behavior Category:Education",
 "title": "Dropping out"
}