{
 "id": "857464",
 "text": "Henry Menasco Wade (November 11, 1914 – March 1, 2001) was an American lawyer. He was the district attorney of Dallas County from 1951 to 1987. He was known for his prosecution of Jack Ruby for killing Lee Harvey Oswald, and the U.S. Supreme Court's decision legalizing abortion, Roe v. Wade. Wade died of problems caused by Parkinson's disease on March 1, 2001 in Dallas, Texas at the age of 86. In a January 1964 Dallas Times Herald, Wade's wife was quoted: \"I’d be afraid to drink a glass of light wine and then drive to the drugstore...If the police stopped me, I know what Henry would do.\" Several articles later noted that a 1963 internal memo in Wade's office advised against \"Jews, Negroes, Dagos, Mexicans or a member of any minority race\" from serving on a jury. In 1969, Jon Sparling, one of Wade's top assistants, wrote a training manual warning against picking, among others, \"free-thinkers\" and \"extremely overweight people,\" and said, \"You are not looking for a fair juror but rather a strong, biased and sometimes hypocritical individual who believes that defendants are different from them.\" Craig Watkins, the first black American DA for Dallas Country, described Wade's tenure as having \"a cowboy kind of mentality and the reality is that kind of approach is archaic, racist, elitist and arrogant.\" In Wade’s final year in office, the U.S. Supreme Court overturned the death sentence of a black man, Thomas Miller-El, ruling that blacks were excluded from the jury. Cited in Miller-El’s appeal was a manual for prosecutors that Wade wrote in 1969 and was used for more than a decade. It gave instructions on how to keep minorities off juries. Before Wade's death, DNA evidence was used for the first time to reverse a Dallas County conviction; David Shawn Pope, found guilty of rape in 1986, who had spent 15 years in prison. Watkins said in a 2010 interview in The Guardian that officers from his own jurisdiction \"were taken aback because we were calling in to question the work they had done for all these years. It was the same among some folks in this office. They were afraid of the consequences of this Pandora's box being opened.\" Lenell Geter, a black engineer, was convicted of armed robbery and sentenced to life in prison. After Geter had spent more than a year behind bars, Wade agreed to a new trial, then dropped the charges in 1983 amid reports of shoddy evidence and allegations Geter was singled out because of his race. According to a 2016, article, Wade was responsible for the conviction and execution of a black man called Tommy Lee Walker. Former Dallas assistant district attorney Edward Gray wrote the 2010 book Henry Wade's Tough Justice which discussed the miscarriages of justice during Wade's tenure, noting that Wade's office conviction rate of innocent defendants was ten times the national average. Gray stated that \"Henry Wade wouldn't intentionally try to convict someone he knew to be innocent...but even in cases where evidence was weak, he would go all out, go for broke, be super- competitive.\" ==References== Category:1914 births Category:2001 deaths Category:District attorneys Category:Lawyers from Dallas Category:Politicians from Dallas Category:Democratic Party (United States) politicians Category:Deaths from Parkinson's disease",
 "title": "Henry Wade"
}