{
 "id": "857560",
 "text": "Sayed Mohamed Idris Al Sanusi (; Al Sayed Prince Muhammad Idris bin Muhammad al-Mahdi al Sanusi; 12 March 1890 – 25 May 1983) was a Libyan political and religious leader. First, he was the chief of the Sanusi Muslim Order. Then, he became the Emir of Cyrenaica. Eventually, Idris became the King of the United Kingdom of Libya (renamed as the Kingdom of Libya in 1963) in 1951. In 1969, Mu'ammar al-Qadhafi took control of Libya by force which ended the reign of Idris. == Early life == Sayed Mohamed Idris Al Sanusi was born on 12 March 1890 in Jaghbub. Jaghbub is a remote oasis in Cyrenaica, an Ottoman district. Nowadays, Cyrenaica is located in the north east of Libya. In Jaghbub, he studied Islamic law and theology. Idris was the grandson of Shaikh al Sayed Mohamed Ali ibn Sanusi (1787-1859). Mohammed Ali grew up in Algeria. Later, he founded the Sanusi Order after his migration to Libya. The Sanusi Order began as a religious movement which preached the return to the beliefs and rituals of early Islam. As soon as the movement became bigger, it obtained political power. The name of Idris' father is Mohamed El Mahdi Al Sanusi. In the 1880's, he was the head of the Sanusi Order. Under him, the Sanusi Order had power over the nomadic tribes of the Libyan Desert. He also had a lot of followers across Tripolitania and Cyrenaica.Villard, Henry Serrano (1956). Libya: The New Arab Kingdom of North Africa. Ithaca, New York: Cornell University Press. p. 36. == Cyrenaica: Idris' rise to power == === Sanusi Order and the Italian invasion === The Kingdom of Italy invaded Tripolitania and Cyrenaica to acquire colonies, in what is known as the Italo-Turkish war (1911-1912). The Sanusi Order led by Idris’ uncle, Ahmed Shari as-Sanusi, was one of the key fighters against this invasion. Tripolitania was under Ottoman rule during this time and an invaluable asset to the Ottomans in their war against the Italians. In 1912 the Ottomans and the Italians signed the treaty of Ouchy and reached terms for a ceasefire. A key point of this treaty was the clause that stated all Ottoman forces were to leave Tripoli and Cyrenaica at once. This meant that the Sanusi order lost a powerful ally and that the Italian army could begin to take control of Tripoli and Cyrenaica as they had previously desired. In 1913 the Italian army, met with little resistance, invaded Tripolitania and established further control there.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.26. Cyrenaica was next on their list however, under the leadership of Ahmed Sharif, the Sanusi order along with other tribes in Cyrenaica fought back. The Italian army didn’t get much further than the Cyrenaica coast as the inhabitants put up a very fierce resistance despite having much less soldiers than the Italians. In 1915 Italy signed the pact of London to join the triple entente in world war one, this pact stipulated that Italy’s sovereignty over Libya would remain. Italy’s involvement in World War I exacted a heavy toll on them causing their power in the Cyrenaica coast and Tripolitania to weaken. After that, Ahmed Sharif’s relations with the Ottoman empire led him to attack the British forces occupying Egypt. This decision left the Sanusi order and the whole province of Cyrenaica in a weak position as they were now fighting Italians in the North and West, and the British from the east. On the 24th of March in 1916, Ahmed Sharif suffered a devastating defeat due to a British attack and fled.Evans-Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 128. . To best protect his country's interest, he placed his cousin Idris, in charge of the military and political dealings in Cyrenaica. === Head of the Sanusi Order === Idris his new leadership was not off to a great start considering that Cyrenaica was in a weakened state. The region was suffering from hunger and poverty. Idris’ first challenge in his new position of leadership was to reopen the borders to Egypt which the British had closed in order to cut off resources being sent to Ahmad Shariff’s resistance forces in the previous months. Idris presented himself as a man of peace to the British in Egypt and the Italians on the Tripolitanian coast. He desired a peaceful solution to end his people’s suffering due to the lack of resources. Meetings between the British, Italian and Sanusi representatives took place in 1916 but unfortunately its terms were denied in Rome.Evans- Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 135. . In 1917 these three parties met again and Idris was successful in achieving his goal of getting the borders back open, re-opening trade routes to Egypt and ceasing hostilities with the Italians and British.Evans-Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 143. . This agreement in 1917, known as the Akrama agreement, helped the people of Cyrenaica recover from poverty and hunger. The Akrama agreement also established that Italy had sovereignty on the coast and the Sanusi had sovereignty in the central lands. When world war one ended in 1918 Italy was in a weakened state and found it very hard to maintain military strength in Libya. In order to diminish their military and economic costs in the region, the Italians issued the Legge Fondamentale.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 28. The Legge Fondamentale was a an arrangement that allowed for Tripoli, Fezzan and Cyrenaica to establish parliaments and governing councils. These parliaments didn’t accomplish much as they met very rarely and were suspended in 1923.St. John, Ronald Bruce (2008). Libya: From Colony to Revolution. Oxford: Oneworld. p. 69. . === Amir of Cyrenaica === In 1920, Italian and Sanusi representatives decided that the Akrama pact should be renewed by a new agreement.Evans-Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 148. . In October of that year the Accord of al- Rajma was created and put into effect. The Accord of al-Rajma granted Idris the title of Amir to the emirate of Cyrenaica.St. John, Ronald Bruce (2008). Libya: From Colony to Revolution. Oxford: Oneworld. p. 69. . Along with the title of Amir, Idris now had completely independent administrative control of the oases surrounding him, this did not include the coast of Cyrenaica.Evans- Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 149. . The Italian government also agreed to pay for all his general expenses such as family allowance, military expenses and police expenses. This accord also benefited the Italians by solidifying their control over the coast of Cyrenaica and Tripolitania. The Italian government also gained increased control over the important members in Cyrenaican tribes as they were the ones paying them through Idris. A final notable clause in the al-Rajma Accord was that Idris had promised to disband Cyrenaican military units controlled by allied tribes.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.28. Idris never fulfilled this part of the accord which led to the worsening of relations between the Italian government and the Sanusi emirate in 1921. By this time Idris’ position as amir had already been solidified and the Italians could not go back on the terms of the Accord. Around 1922, tensions between the Italians on the coast and the Cyrenaican people started to resurface due to various disagreements.Evans-Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 153. . One such disagreement was the aforementioned promise Idris made that he did not fulfil regarding the disbanding of Cyrenaican military units. The rise of facism in 1922 also played a significant role in heightened tension. This was due to the fact that the leader of the fascist movement in Italy, Benito Mussolini, had publicly stated he wanted to suppress the Libyan population and take over by force.St. John, Ronald Bruce (2008). Libya: From Colony to Revolution. Oxford: Oneworld. p. 71-72. . == The first exile == A delegation of Tripolitanian leaders came to Idris in January 1922. At the conference of Gharyan, they had agreed with each other about certain terms regarding a unified Tripolitania and Cyrenaica.Evans-Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 153. . They now offered these terms to Idris, but Idris was hesitant to accept their offer. If he would accept their terms, he would upset the Italians, but if he would refuse their offer, he would upset the Tripolitanians. When a second delegation came to him in the same month, the Italian army occupied a coastal city named Misurata and warned Idris not to accept the proposal. Shortly thereafter, the fascists took control of Italy and cancelled all the treaties with Tripolitania.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.29. Not knowing whether to say yes to the Tripolitanians and upset the Italians or the other way around, Idris fled to Egypt on 21 December 1922.Ahmida, Ali Abdullatif (1994). The making of modern Libya: State Formation, Colonization, and Resistance, 1830-1932. Albany: State University of New York Press. p. 136. He stayed there in a self-declared exile. === Italian reinvasion === The Italian army went on with its military campaign after reconquering Misurata. They wanted to reconquer the whole of Libya. First, they occupied Tripolitania in 1923. That was an easy battle in comparison with the struggle to conquer Fezzan. From 1926 until 1930, there was a strong resistance from the native population of Fezzan. They used guerrilla warfare to delay the Italians. Finally, Cyrenaica was conquered in 1932.Ahmida, Ali Abdullatif (1994). The making of modern Libya: State Formation, Colonization, and Resistance, 1830-1932. Albany: State University of New York Press. p. 134. The biggest reason that Cyrenaica was not conquered until 1932, is the Sanusi Order. The Sanusi Order had through its mobilisation and education a beneficial effect on Cyrenaican tribes. The Sanusi Order made tribes cooperate with each other. This unity made their resistance much more effective. The leader of this Cyrenaican military resistance was Umar al Mukhtar. He had already been against the peace agreements with Italy, but the leader of the Sanusi Order, Idris, had gotten his way. However, Umar al Mukhtar turned out to be right in the eyes of the Libyans. That is because they saw Idris fleeing as the Italians began their brutal invasion. As a result, Umar al Mukhtar got more supporters. During the resistance in 1924, Umar al Mukhtar went personally to Alexandria to ask help from Idris. Unfortunately, Idris disappointed Umar and said that he could do nothing. As a response Umar wrote a famous letter complaining that Idris has abandoned the Libyans.Ahmida, Ali Abdullatif (1994). The making of modern Libya: State Formation, Colonization, and Resistance, 1830-1932. Albany: State University of New York Press. p. 137. === Seclusion and re-engagement === During the following years, Idris barely played a role in Libya. The first time he engaged with Libyan affairs again was in 1939. He met with other Libyan exiles in Alexandria. There, they discussed which actions could be taken to protect Libya. Those Libyan exiles represented the two provinces Tripolitania and Cyrenaica. When they met again in 1940, they chose to side with the Allies. They did this under the influence of Idris. By supporting Britain they hoped to get rid of the Italian domination after World War II.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 36. When World War II ended, Britain and France gained control over Libya. Britain controlled Cyrenaica and Tripolitania and France controlled Fezzan. Consequently, the first two provinces fell under the British military administration(BMA) and Fezzan fell under French Military Administration.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 37. === Return to Libya === In November 1947 Idris arrived in Cyrenaica, because Britain invited him to return from his exile. The British military administration worked with him and with other local administrators and politicians from 1947 until 1949.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 184. In 1949, the British military administration in Cyrenaica was replaced by a civilian administration and Idris became the new leader of Cyrenaica. The reason behind this was to make Cyrenaica a kind of British protectorate like Transjordan was after World War I.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 186. Because of this, Britain did not intervene when Idris declared Cyrenaica’s independence on June the first 1949.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 189. In July of the same year, he even went on a formal state visit to Britain.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 190. In December 1949, a UN Commissioner was appointed by the United Nations General Assembly to carry out an assignment. He was tasked with achieving independence for a united Libya before 1 January 1952.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 196. This idea seemed ridiculous before 1949, because Tripolitania did not want to unite with Cyrenaica.Evans- Pritchard, Edward Evan (1949). The Sanusi of Cyrenaica. Oxford: Clarendon Press. p. 130. . However, after two visits to Tripoli by Idris in that same year, the opposition against him dropped.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 198. The UN commissioner helped to establish the National Constituent Assembly of Libya (NCAL). This assembly was the first forum where representatives of all the three regions could negotiate with each other. They decided to make Libya a federal monarchy. After that, they proclaimed Idris to be their king in December 1950. A year later, on 24 December 1951, Idris declared Libya independent.Synge, Richard (2015). Operation Idris: Inside the British Administration of Cyrenaica and Libya, 1942-52. London: Society for Libyan Studies. p. 203. == King of Libya == On 24 December 1951, Idris became the king of the United Kingdom of Libya. Libya had a lot of problems at the moment of independence. One of the problems was that the country was very poor.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 45. Another problem was that Libya had a weak central government. Instead, the three provinces had a strong autonomy, because it was a federation.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 46. In 1959, oil was discovered.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 44. This made the country very rich at once.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 63. Because Idris wanted to centralise administrative and economic planning, he abolished the federal system. He did this on 26 April 1963. As a result, the name of the country changed to the Kingdom of Libya.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p. 65. == Overthrow and second exile == This sudden increase of wealth in Libya could have allowed king Idris to support political and economic structures in his country, but he did not.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.4. King Idris instead used this money to strengthen tribal relations which in return strengthened his rule. Many riots took place because of this as citizens feared that the king had become corrupt. After the Arab-Israeli war in 1967 there was an increasing amount of Arab nationalism amongst the people of Libya, which the king hardly engaged with.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.76. In 1969, on September 1, a coup d'état took place led by many young army officers while kind Idris was in Turkey undergoing medical treatment. This coup d'état was later revealed to be led by Mu'ammar al-Qadhafi who would go on to take over Idris' position as ruler of Libya.Vandewalle, Dirk j. (2012). A History of Modern Libya. Cambridge: Cambridge University Press. p.78. Idris died in 1983 in Cairo at the age of 93. He was buried in Al-Baqi' Cemetery, Medina, Saudi Arabia. ==References== Category:Heads of state of Libya Category:1890 births Category:1983 deaths",
 "title": "Idris of Libya"
}