{
 "id": "857898",
 "text": "Scott William Taylor (born June 27, 1979) is an American politician and former Navy SEAL. He served as the U.S. representative from Virginia's 2nd congressional district from 2017 to 2019. Taylor was also a state delegate for the 85th house district. On November 6, 2018, Taylor was defeated for reelection by Democrat and U.S. Navy veteran Elaine Luria. In December 2019, he stated he was going to run again for his old seat in the U.S. House of Representatives. In the November general election, he was defeated by Luria a second time. ==Early life== Scott William Taylor was born in Baltimore. After high school, he served in the United States Navy and became a Navy SEAL, first taking part in drug enforcement. ==Early career== In 2008, Taylor ran for Mayor of Virginia Beach, Virginia. He was a candidate in the 2010 primary election for Virginia's 2nd congressional district, but lost to Scott Rigell. Taylor became a state delegate for the 85th house district in November 2013. ==Elections== ;2016 In 2016, after the then current representative, Scott Rigell, announced he would not seek re-election, Taylor won the Republican Party nomination for Virginia's 2nd congressional district in the United States House of Representatives, defeating Randy Forbes in the primary, then defeated Democrat Shaun Brown, 61.3% to 38.5%, to win the general election on November 8, 2016. ;2018 In January 2018, former Navy commander Elaine Luria announced her plan to run for Taylor's seat. In the June 10 Democratic primary, Luria received 62% of the vote, defeating Karen Mallard, who received 38%. In the Republican primary, Taylor defeated Mary Jones, 76% to 24%. On November 6, 2018, Taylor lost to Luria, taking 48.9 percent of the vote to Luria's 51.1 percent. ;2020 On July 8, 2019, Taylor announced that he was running for the United States Senate against two-term incumbent Mark Warner in the 2020 election. Taylor decided to not run for the Senate race, instead choosing to run to take back his old House seat. On June 23, 2020, he won the Republican primary, setting up a rematch with Luria. Luria defeated him and was re-elected with a six-point margin taking 52 percent to Taylor's 46 percent. ==References== Category:Republicans (United States) Category:Politicians from Virginia Category:Living people Category:1979 births Category:United States Navy Category:Harvard University alumni",
 "title": "Scott Taylor (politician)"
}