{
 "id": "857848",
 "text": "The Democratic Party of Virginia is the affiliate (associated with) of the Democratic Party. The Virginia Democrats are based in Richmond, Virginia.\"Contact .\" Democratic Party of Virginia. Retrieved on May 13, 2010. As of 2022, the Democrats are the largest party in the Senate of Virginia. Federally, Virginia has voted for every Democratic presidential candidate since 2008. The Democrats also hold seven out of the 11 state's U.S. House seats and both of the state's U.S. Senate seats. ==Organization== ===Local Democratic Committees=== Local Democratic Committees assist the Democratic Party by locality, though they can contain several localities. ===Central Committee=== The Central Committee controls all matters of the Party. The committee can create an annual budget and the method to nominate candidates for statewide offices. ==Current elected officials== ===Members of Congress=== ====U.S. Senate==== Democrats have controlled both of Virginia's seats in the U.S. Senate since 2008: *Class I: Tim Kaine (Junior Senator) *Class II: Mark Warner (Senior Senator, Vice Chair of Senate Democratic Caucus, Vice Chair of Senate Intelligence Committee) ====U.S. House of Representatives==== Out of Virginia's 11 seats in the U.S. House of Representatives, seven are held by Democrats: *VA-02: Elaine Luria *VA-03: Bobby Scott *VA-04: Donald McEachin *VA-07: Abigail Spanberger *VA-08: Don Beyer *VA-10: Jennifer Wexton *VA-11: Gerry Connolly ===Statewide offices=== As of 2022, Democrats control none of the three elected statewide offices. ===Legislative leadership=== * President pro tempore of the Senate of Virginia: Louise Lucas * Senate Majority Leader: Dick Saslaw * Speaker of the Virginia House of Delegates: Eileen Filler-Corn * House Majority Leader: Charniele Herring ==2019 Virginia political crisis== In 2019, all three of Virginia's statewide executive office holders, all Democrats, were in various controversies. Governor Ralph Northam's medical school yearbook page had featured a person in blackface and a person in a Ku Klux Klan hood, Lieutenant Governor Justin Fairfax was accused of having sexually assaulted a professor in 2004, and Attorney General Mark Herring was revealed to have worn blackface at a college party. Parts of the Democratic Party of Virginia told Northam to resign from the governorship, but he did not. The national Democratic Party remained silent, as Northam's and Fairfax's resignation would have meant that Republican Speaker of the House Kirk Cox would have become governor. Ultimately, none of the three accused resigned. ==References== Category:Politics of Virginia Category:Organizations based in Virginia Virginia",
 "title": "Democratic Party of Virginia"
}