{
 "id": "857910",
 "text": "Christopher Plummer (1929–2021) was a Canadian actor. Plummer won an Academy Award for Best Supporting Actor for his performance in Mike Mills' movie Beginners (2010). ==Performances== ===Movies=== Year Title Role Notes Ref. 1958 Stage Struck Joe Sheridan Wind Across the Everglades Walt Murdock 1964 The Fall of the Roman Empire Commodus 1965 The Sound of Music Captain Georg von Trapp Inside Daisy Clover Raymond Swan 1966 Triple Cross Eddie Chapman 1967 The Night of the Generals Field Marshal Erwin Rommel Oedipus the King Oedipus 1968 Nobody Runs Forever Sir James Quentin 1969 Battle of Britain Squadron Leader Colin Harvey The Royal Hunt of the Sun Atahualpa Lock Up Your Daughters! Lord Foppington 1970 Waterloo Arthur Wellesley 1973 The Pyx Det. Sgt. Jim Henderson 1974 The Happy Prince The Happy Prince Short film 1975 The Spiral Staircase Dr. Joe Sherman The Return of the Pink Panther Sir Charles Litton Conduct Unbecoming Major Alastair Wimbourne The Man Who Would Be King Rudyard Kipling The Day That Shook the World Archduke Ferdinand of Austria 1976 Aces High Captain 'Uncle' Sinclair 1977 The Assignment Captain Behounek The Disappearance Deverell 1978 The Silent Partner Harry Reikle International Velvet John Seaton 1979 Starcrash The Emperor Murder by Decree Sherlock Holmes Hanover Street Paul Sellinger 1980 Somewhere in Time William Fawcett Robinson 1981 Eyewitness Joseph Professor Lakos 1984 Lily in Love Fitzroy Wynn Roberto Terranova Dreamscape Bob Blair Highpoint James Hatcher Ordeal by Innocence Leo Argyle 1986 The Boy in Blue Knox The Boss' Wife Mr. Roalvang An American Tail Henri Voice; Animated film https://www.behindthevoiceactors.com/Christopher-Plummer/ The Tin Soldier Narrator Voice; Animated film Vampire in Venice Prof. Paris Catalano 1987 Dragnet Rev. Jonathan Whirley I Love N.Y. John Robertson Yeats The Man Who Planted Trees Narrator Voice; Animated film The Gnomes' Great Adventure Narrator Voice; Animated film 1988 Light Years Metamorphis Shadow Dancing Edmund Beaumont The Making of a Legend: Gone with the Wind Narrator Voice; Documentary 1989 Souvenir Ernst Kestner Mindfield Doctor Satorius 1990 Where the Heart Is Jerry Red Blooded American Girl Dr. John Alcore Money Martin Yahl 1991 Firehead Colonel Garland Vaughn Rock-a-Doodle The Grand Duke of Owls Voice; Animated film Dragon and Slippers Pelican Voice; Animated film Star Trek VI: The Undiscovered Country General Chang 1992 Liar's Edge Harry Weldon Impolite Naples O'Rorke Malcolm X Chaplain Gill 1994 Wolf Raymond Alden Crackerjack Ivan Getz 1995 Dolores Claiborne Det. John Mackey 12 Monkeys Dr. Goines 1996 The Conspiracy of Fear Joseph Wakeman 1997 Babes in Toyland Barnaby Crookedman Voice; Animated film 1998 Hidden Agenda Ulrich Steiner The First Christmas Narrator Voice; Blackheart Holmes The Clown at Midnight Mr. Caruthers 1999 Madeline: Lost in Paris Narrator Voice; Animated film The Insider Mike Wallace 2000 Dracula 2000 Abraham Van Helsing 2001 Lucky Break Graham Mortimer A Beautiful Mind Dr. Rosen Full Disclosure Robert Lecker 2002 Ararat David Nicholas Nickleby Ralph Nickleby 2003 The Gospel of John Narrator Voice Blizzard Santa Claus Cold Creek Manor Mr. Massie 2004 National Treasure John Adams Gates Alexander Aristotle 2005 Must Love Dogs Bill Nolan Syriana Dean Whiting The New World Captain Christopher Newport 2006 Inside Man Arthur Case The Lake House Simon Wyler 2007 Man in the Chair Flash Madden Closing the Ring Jack Etty Emotional Arithmetic David Winters Already Dead Dr. Heller 2009 Caesar and Cleopatra Julius Caesar Also executive producer Up Charles Muntz Voice; Animated film My Dog Tulip J.R. Ackerley Voice; Animated film The Last Station Leo Tolstoy 9 1 Voice; Animated film The Imaginarium of Doctor Parnassus Doctor Parnassus 2010 Beginners Hal Fields 2011 Priest Monsignor Orelas Barrymore John Barrymore The Girl with the Dragon Tattoo Henrik Vanger 2013 The Legend of Sarila Croolik Voice; Animated film 2014 Elsa & Fred Fred Barcroft Hector and the Search for Happiness Professor Coreman The Forger Joseph Cutter 2015 Danny Collins Frank Grubman Pixies Pixie King Voice; Animated movie Remember Zev Guttman/Otto Wallisch 2016 The Exception Kaiser Wilhelm Howard Lovecraft and the Frozen Kingdom Dr. West Voice; Animated film 2017 Elegy Narrator Voice; Short film The Man Who Invented Christmas Ebenezer Scrooge The Star King Herod Voice; Animated film All the Money in the World J. Paul Getty Howard Lovecraft & the Undersea Kingdom Dr. West / The Pixie King Voice; Animated film 2018 Boundaries Jack Jaconi Howard Lovecraft and the Kingdom of Madness Dr. Jeffrey West Voice; Animated film 2019 Cliffs of Freedom Thanasi Knives Out Harlan Thrombey The Last Full Measure Frank Pitsenbarger 2021 Heroes of the Golden Masks Rizzo Voice; Animated film Posthumous release Post film role ===Television=== Year Title Role Notes Ref. 1953 Broadway Television Theatre Michael O'Leary Episode: \"Dark Victory\" 1955 Kraft Television Theatre Robert Carr Episode: \"The King's Bounty\" Producers' Showcase Christian de Neuvillette Episode: \"Cyrano de Bergerac\" 1956 General Electric Theater Walter Shelley Episode: \"A Letter from the Queen\" The Alcoa Hour Bruce Quealy Episode: \"Even the Weariest River\" 1957–58 Omnibus Thomas Mendip/Oedipus 2 episodes 1957–61 DuPont Show of the Month Various Roles 1958 Little Moon of Alban Kenneth Boyd Television movie 1959 Johnny Belinda Dr. Jack Pelletier A Doll's House Torvald Helmer The Philadelphia Story Mike Connor 1960 NBC Sunday Showcase Oliver Wendell Holmes, Jr. 2 episodes Captain Brassbound's Conversion Captain Brassbound Television movie 1961 Playdate Himself 13 episodes Time Remembered Prince Albert Television movie 1962 Cyrano de Bergerac Cyrano de Bergerac 1964 Hamlet at Elsinore Hamlet 1968 The Secret of Michelangelo Narrator (voice) TV documentary 1971 Don Juan in Hell Don Juan Television movie 1974 Witness to Yesterday Arthur Wellesley, Duke of Wellington Episode: \"The Duke of Wellington\" After the Fall Quentin Television movie 1976 The Moneychangers Roscoe Heyward TV miniseries, 4 episodes 1977 Silver Blaze Sherlock Holmes Television movie Jesus of Nazareth Herod Antipas TV miniseries, 2 episodes 1979 Riel Sir John A. Macdonald Television movie 1980 Desperate Voyage Burrifous The Shadow Box Brian 1981 When the Circus Came to Town Duke Royal 1981 Dial M for Murder Mark Halliday 1982 Little Gloria... Happy at Last Reginald Claypoole Vanderbilt TV miniseries, 2 episodes 1983 The Scarlet and the Black Colonel Herbert Kappler Television movie The Thorn Birds Archbishop Vittorio Contini-Verchese TV miniseries, 3 episodes Prototype Dr. Carl Forrester Television movie 1985 Rumpelstiltskin Narrator (voice) Voice; Television movie The Velveteen Rabbit Narrator (voice) Voice; Television movie 1986 Crossings Armand DeVilliers TV miniseries, 3 episodes Spearfield's Daughter Lord Jack Cruze Television movie 1987 A Hazard of Hearts Sir Giles Staverley The Cosby Show Jonathan Lawrence Episode: \"Shakespeare\" The World of David the Gnome Narrator Voice; English version 1988–91 Madeline Narrator Voice; 6 episodes 1989 Nabokov on Kafka Vladimir Nabokov Television short 1990 A Ghost in Monte Carlo The Grand Duke Ivan Television movie 1990–93 Counterstrike Alexander Addington 65 episodes 1991 Young Catherine Sir Charles Williams TV miniseries, 3 episodes A Marriage: Georgia O'Keeffe and Alfred Stieglitz Alfred Stieglitz Television movie Berlin Lady Wilhem Speer 6 episodes The First Circle Victor Abakumov Television movie 1992 Secrets Mel Wexler 1993 A Stranger in the Mirror Clifton Lawrence 1993–95 Madeline Narrator (voice) 33 episodes 1995 Harrison Bergeron John Klaxon TV movie 1996 We the Jury Wilfred Fransiscus Television movie Skeletons Reverend Carlyle 1997 The Arrow George Hees TV miniseries, 2 episodes 1998 Winchell Franklin D. Roosevelt Television movie 2000 Nuremberg Sir David Maxwell-Fyfe TV miniseries, 2 episodes The Dinosaur Hunter Hump Hinton Television movie Possessed Archbishop Hume American Tragedy F. Lee Bailey 2 episodes 2001 Leo's Journey Narrator (voice) Television movie On Golden Pond Norman Thayer 2002 Night Flight 'Flash' Harry Peters Agent of Influence John Watkins 2003 Odd Job Jack Magnus the Maker Episode: \"Holyland\" 2005 Our Fathers Cardinal Bernard Law Television movie Miracle Planet Narrator (voice) 6 episodes 2006 American Experience Narrator/James Tyrone Episode: \"Eugene O'Neill\" 2008 The Summit P.J. Aimes 2 episodes 2013 Muhammad Ali's Greatest Fight John Marshall Harlan II Television movie, HBO 2019 Departure Howard Larson 6 episodes 2020 Jeopardy! The Greatest of All Time Himself - Video Clue Presenter 1 episode ===Theatre=== Year Title Role Notes Ref. 1954 The Starcross Story George Phillips Royale Theatre, Broadway 1954 Home is the Hero Manchester Monagham Booth Theatre, Broadway 1955 The Dark is Light Enough Count Peter Zichy ANTA Theatre, Broadway 1955 The Lark Warwick Longacre Theatre, Broadway 1956 Night of the Auk Lewis Roheman Playhouse Theatre, Broadway 1958 J.B. Nickles ANTA Playhouse, Broadway 1963 The Resistible Rise of Arturo Ui Arturo Ui Lunt- Fontanne Theatre, Broadway 1965 The Royal Hunt of the Sun Francisco Pizarro ANTA Theatre, Broadway 1971 Amphitryon 38 Jean Giraudoux National Theatre, London Directed by Laurence Olivier 1973 The Good Doctor Performer Eugene O'Neill Theatre, Broadway 1974 Cyrano Cyrano de Bergerac Palace Theatre, Broadway 1978 Drinks Before Dinner Edgar The Public Theatre, Off-Broadway 1982 Othello Iago Winter Garden Theatre, Broadway 1988 Macbeth Macbeth Mark Hellinger Theatre, Broadway 1994 No Man's Land Spooner Roundabout Theater Company, Broadway 1997 Barrymore John Barrymore Music Box Theatre, Broadway 2004 King Lear King Lear Vivian Beaumont Theatre, Broadway 2007 Inherit the Wind Henry Drummond Lyceum Theatre, Broadway ===Video games=== Year Title Voice role Notes 2000 Star Trek: Klingon Academy General Chang 2009 Up Charles Muntz (voice) 2011 The Elder Scrolls V: Skyrim Arngeir (voice) 2012 Rush: A Disney-Pixar Adventure Charles Muntz (voice) ==References== Category:Filmographies",
 "title": "Christopher Plummer on screen and stage"
}