{
 "id": "858042",
 "text": "Stiff Records is a British independent record label. It was formed in London, England, by Dave Robinson and Jake Riviera (real name Andrew Jakeman). It was first active from 1976 to 1988 and then started again in 1995. ==The Stiffs Tours== Robinson and Riviera had arranged package tours ‒ such as the 1975 Naughty Rhythms tour ‒ for acts they managed before forming Stiff. The first tour, known as the Live Stiffs Tour or 5 Live Stiffs (3 October – 5 November 1977), comprised five bands: Elvis Costello and The Attractions, Ian Dury and the Blockheads, Wreckless Eric and The New Rockets, Nick Lowe's Last Chicken in the Shop, and Larry Wallis's Psychedelic Rowdies. Having signed all the named artists as individuals, bands had to be formed in order to tour: these were largely based on the session musicians used for the artists' solo records. There were 18 musicians on the tour, several doubling up, e.g. Dury playing drums for Wreckless Eric while the last two \"bands\" had the same line up (Nick Lowe, Larry Wallis, Dave Edmunds, Terry Williams, Pete Thomas and Penny Tobin). The original idea was that the running order would rotate each night, but Dury and Costello were clearly the strongest acts. Costello played mostly new material and cover versions, rather than numbers from his recently released album My Aim is True, so the gigs usually ended with most of the artists on stage performing Dury's \"Sex & Drugs & Rock & Roll\". A live album entitled Live Stiffs Live and a video of the tour were produced, but the tour only covered the UK. After the departure of Riviera, Robinson arranged a second tour, the Be Stiff or the Be Stiff Route 78 tour, from October 10 to November 19, 1978 (UK), again comprising five acts; Wreckless Eric, Lene Lovich, Jona Lewie, Chris Sievey and Rachel Sweet. The mainland section of the UK tour was undertaken by train and the Irish section by coach, and then continued on to the New York, USA in December 17 to 20. The artists contributed to an EP with cover versions of the Devo song, and early Stiff single, \"Be Stiff\". The final tour, the Son of Stiff Tour 1980, comprised Tenpole Tudor, Any Trouble, Dirty Looks, Joe \"King\" Carrasco and the Crowns, and The Equators. Undertaken by bus, this European tour was not successful. The tour led to a 12\" EP Son of Stiff Tour 1980 (SON 1) and a short movie directed by Jeff Baynes. The movie has not been released for sale, but was shown on BBC4 in September 2006. ==Label artists== * The Adverts * Alberto y Lost Trios Paranoias * Alvin Stardust * Any Trouble * The Belle Stars * The Bongos * Billy Bremner * Joe \"King\" Carrasco & the Crowns * The Catch * Elvis Costello * The Damned * Department S * Desmond Dekker * Devo * Dr. Feelgood * Ian Dury and the Blockheads * Electric Guitars * The Enemy * The Feelies * Fingerprintz * Furniture * Ian Gomm * Richard Hell and The Voidoids * Jakko * King Kurt * Jona Lewie * Lew Lewis * Lene Lovich * Nick Lowe * Kirsty MacColl * Madness * The Members * Motörhead * Humphrey Ocean and the Hardy Annuals * Oingo Boingo * Graham Parker and The Rumour * Pink Fairies * Plasmatics * Plummet Airlines * The Pogues * Pointed Sticks * The Dubliners * The Prisoners * Roogalator * Chris Sievey * The Sports * Dave Stewart * Rachel Sweet * Bobby Tench * Tenpole Tudor * Sam and the Womp * Sean Tyla and Tyla Gang * The Stiffs * Tracey Ullman * The Undead * The Untouchables * Max Wall * Larry Wallis * Wazmo Nariz * Wreckless Eric * Yachts * Yello == References == Category:1976 establishments in the United Kingdom Category:1988 disestablishments in the United Kingdom Category:1995 establishments in England Category:British record labels Category:1970s establishments in England Category:1980s disestablishments in England",
 "title": "Stiff Records"
}