{
 "id": "85819",
 "text": "Russell Edward Brand (born 4 June 1975) is an English comedian, actor, television presenter, radio host author and activist. He is best known for playing Dr. Nefario in the films Despicable Me (2010), Despicable Me 2 (2013) and Minions: The Rise of Gru (2022). == Career == In 2004, he presented Big Brother's Big Mouth, a side-show of Big Brother UK. In 2006, he started presenting a radio show, The Russell Brand Show, on BBC Radio 6 Music. In 2007 the show was moved to BBC Radio 2. He was involved in a controversy over a prank phone call with Jonathan Ross in 2008. After this Brand quit his job at the BBC. He presented Russell Brand's Ponderland in 2007 and 2008. He wrote a book in 2007 about his life, which is called My Booky Wook. In October 2014, he wrote another book called Revolution. ==Personal life== Many people notice his unusual fashion sense; his choice of clothing and hairstyle is unique. He has been diagnosed with attention-deficit hyperactivity disorder and bipolar disorder. He has had bulimia nervosa and been addicted to crack cocaine, heroin and alcohol. As of March 2013, Brand has not used drugs or alcohol for ten years. From 2006 to 2008, Brand won The Sun's Shagger of the Year award. He has been arrested 12 times. He married Katy Perry in October 2010. He filed for divorce from her in January 2012, which was finalised in July 2012. He dated Jemima Khan from 2013–2014. In 2017, Brand married Scottish lifestyle blogger Laura Gallacher. They have a daughter. Brand lives in Shoreditch, London. ==References== ==Other websites== * Category:1975 births Category:Living people Category:Actors from Essex Category:BBC radio presenters Category:British autobiographers Category:British columnists Category:British stand-up comedians Category:Comedians from Essex Category:English journalists Category:English movie actors Category:English radio personalities Category:English television actors Category:English television presenters Category:Katy Perry Category:People with bipolar disorder Category:Television personalities from Essex Category:Writers from Essex",
 "title": "Russell Brand"
}