{
 "id": "858184",
 "text": "Joyce Carol Vincent (19 October 1965 – December 2003) was an English woman whose death in her London bedsit flat went unnoticed for over two years. ==Life== Vincent was born in Hammersmith, London. Her parents were from Grenada. Her father was of African background and her mother was of Indian background. She left her job in 2001 for unknown reasons. Shortly after, she moved to a shelter for victims of domestic violence. Around the same time, she cut off nearly all contact with her close family and friends. An investigator of Vincent's case said that she had been in a relationship that had a \"history of domestic violence\". It has been said that she may have been ashamed of being a domestic violence victim or did not want to be found by her abuser. In February 2003, Vincent moved into a bedsit flat above a shopping centre in Wood Green, north London. It was owned by the Metropolitan Housing Trust and was used for abuse victims. ==Death== Vincent had asthma. For two days during November 2003, she was treated for a peptic ulcer at North Middlesex University Hospital. She died in her flat sometime in December 2003 at the age of 38. Her cause of death is unknown. It is thought she died from either an asthma attack or problems caused by her recent peptic ulcer. Vincent's death went unnoticed for over two years. Neighbours believed the flat to be empty. The strong smell of Vincent's decomposing body were thought to be caused by bins close by. On 25 January 2006, bailiffs forced entry into the flat and found her body. A pathologist said that Vincent was \"mostly skeletal\" when she was found. Her body was found with a shopping bag and wrapped Christmas presents around her. The television and heating were still running due to debt forgiveness. Her bills were being paid through automatic debit. ==In popular culture== A movie about her, Dreams of a Life (2011), was directed by Carol Morley. Actress Zawe Ashton played Vincent in the movie. Steven Wilson's fourth solo studio album, Hand. Cannot. Erase. (2015), is inspired by Vincent. Punk rock musician Alex Marshall was inspired to write a song about Vincent's life. His band later decided to change the song's title to \"No One Knew\" and used the song's original title, Miss Vincent, to name the band instead. The single was released in 2012. ==References== ==Other websites== * Category:1965 births Category:2003 deaths Category:Missing people Category:People from London Category:Unexplained deaths",
 "title": "Joyce Vincent"
}