{
 "id": "85833",
 "text": "The Sturmabteilung (; often shortened to SA or Storm Division) was the Nazi Party's paramilitary group (its militia). They were nicknamed \"Brownshirts\" for their uniforms. The SA was formed in 1920 and had several leaders, including Ernst Röhm.The SA helped Adolf Hitler rise to power in the 1930s. The Nazi Schutzstaffel (SS) replaced the SA in 1934 after the Night of the Long Knives (where Röhm was killed). == Purpose == The SA's biggest purposes were to: * Help the Nazis rise to power * Protect Nazi rallies and gatherings * Intimidate Jews, Roma people, and trade unionists * Disrupt the meetings of other political parties * Fight the paramilitary units of these other parties, especially the Communist Party of Germany and the Social Democratic Party of Germany The SA have been called \"the gangsters of the early days of Nazi terrorism\". == The SS replaces the SA == Main article: The Night of the Long Knives The SS began as a small part of the SA but later replaced it.The Army and other conservatives disliked the SA. In 1934 Adolf Hitler launched the Night of the Long Knives, a purge that lasted from June 30 to July 2. In the purge, the SS arrested and killed the SA's leaders. Then the SS replaced the SA as the Nazi Party's paramilitary wing. == Names == The word Sturmabteilung was used even before the Nazi Party was founded in 1919. Literally, it means “assault detachment” or “assault section”. The word \"assault\" here means \"military attack.\" Sturmabteilung originally described Germany's specialized assault troops in World War I, who used Hutier infiltration tactics. The name is often translated to English as \"Storm Troopers\" or \"Storm Division\". During their time, the SA were often called the Braunhemden (Brownshirts) because they wore brown uniforms. (Similarly, Mussolini's paramilitary wing were nicknamed the Camicia Nera - the \"Blackshirts\" - because of their black uniforms.) == Related pages == * Nazi Germany * Nazi Party * Night of the Long Knives * Ernst Röhm * Paramilitary == Sources == == Other websites == * The night of long knives Category:1919 establishments in Germany",
 "title": "Sturmabteilung"
}