{
 "id": "858559",
 "text": "Kathleen Elizabeth Hilton (née Avanzino; born March 13, 1959) is an American former actress, businesswoman, and television personality. She is known for appearing on the Bravo reality television series The Real Housewives of Beverly Hills. == Early life == Kathleen Elizabeth Avanzino was born in New York City on March 13, 1959, as the only child of painter and decorator Laurence Avanzino and casting director Kathleen Avanzino. Her father's family comes from Italian ancestry while her mother's family comes from Ireland. Her parents divorced in 1963, her mother married businessman and retired lieutenant colonel Ken Richards and had Hilton's two maternal half-sisters; Kim and Kyle Richards, both of whom are actresses. She also has five paternal younger half-siblings. Hilton's father died on February 18, 1997. He was 61.Massachusetts, U.S., Birth Index, 1860-1970: 26 DEC 1935 34 326 BOSTON – Lawrence Kenneth AvanzinoU.S., Social Security Death Index, 1935-2014: 18 FEB 1997 (aged 61) NEW YORK – Laurence K. Avanzino SS# 095-28-6059 Hilton graduated from Montclair College Preparatory School in Los Angeles, where she became best friends with Michael Jackson. The two remained close friends until his death in 2009. == Career == === Acting and television career === Hilton began working as a child actress in 1968. She made her debut as an actress in April 1970, with the role of Melodie during an episode of the ABC sitcom Nanny and the Professor. She retired from acting in 1979. Hilton hosted the NBC reality television series I Want to Be a Hilton. The series ran for eight episodes during the summer of 2005. The series was later cancelled. Hilton appeared as an official \"friend of the housewives\" during seasons 11 and 12 of the Bravo reality television series The Real Housewives of Beverly Hills. She previously appeared in a guest capacity during seasons 1, 3, 4, 5, 9, and 10. Hilton made a guest appearance during an episode of the Netflix reality cooking show Cooking with Paris in August 2021. Hilton appeared on the Peacock reality television series Paris In Love in November 2021. === Business ventures === Hilton operated her own gift and antiques store The Staircase on Sunset Plaza in Los Angeles during the 1980s and early 1990s. Hilton debuted with 2002 merchandise sales on cable TV's QVC home shopping network. She began selling her signature skincare line on HSN. She launched a perfume, \"My Secret\", in 2008. Hilton has designed the Kathy Hilton Collection of party dresses, sold in four hundred stores worldwide, including Neiman Marcus, Saks Fifth Avenue and Nordstrom. Hilton and her daughters modeled the new Valentino 2021 resort collection in a photo series for Vogue, in December 2020. == Personal life == Hilton resides in Bel Air, Los Angeles. === Marriage and children === Hilton met Richard Hilton, a member of the Hilton family, at the age of 15. The couple wed on November 24, 1979,California, U.S., Marriage Index, 1960-1985: 24 NOV 1979 LOS ANGELES – Kathleen E Avanzino = Richard H Hilton when he was 24 and she was 20 years old. They have four children together; Paris Hilton, Nicky Hilton, Barron Hilton II, and Conrad Hilton III. She has seven grandchildren; three through Nicky, two through Barron, and two through Paris. === Family === Barron Hilton was her father-in-law. James Rothschild, a member of the Rothschild family - the only son of Amschel Rothschild and a grandson of Victor Rothschild, 3rd Baron Rothschild - is her son-in-law through his marriage to Nicky. Tessa von Walderdorff - a member of the Walderdorff family - is her daughter-in-law through her marriage to Barron. Mauricio Umansky is her brother-in-law through his marriage to Kyle; her nieces are Farrah Brittany, Alexia Umansky, Sophia Umansky, and Portia Umansky. Her nieces and nephew through her sister Kim are Brooke Brinson, Whitney Davis, Chad Davis, and Kimberly Jackson. Hilton's parents divorced when she was four years old. Her mother married Jack Catain Jr., a businessman and convicted criminal, on July 4, 1980.California, U.S., Marriage Index, 1960-1985: 4 JUL 1980 LOS ANGELES – Kathleen M Dugan = Jack M Catain Catain Jr. was her stepfather, briefly. She gained two stepsiblings from her mother's third marriage; Michele Catain, a crew member and real estate agent, and Michael Catain, a businessman and convicted criminal. Her mother and stepfather were divorced on March 16, 1982.California, U.S., Divorce Index, 1966-1984: 16 MAR 1982 LOS ANGELES – Jack M = Kathleen Catain == Filmography == === As an actress === Year Title Role Notes 1970 Nanny and the Professor Melodie 1 episode; credited as Kathleen Richards 1971 Family Affairs Carol 1 episode; credited as Kathleen Richards 1971 Marcus Welby, M.D. Nicole 1 episode; credited as Kathleen Richards 1971 Bewitched Robin Silverton 1 episode; credited as Kathleen Richards 1972 Welcome Home, Johnny Bristol Virginia Uncredited 1974 Sigmund and the Sea Monsters Diane 1 episode; credited as Kathy Richards 1976 No Deposit, No Return Girl at the Airport Uncredited 1977 Happy Days Gertie 1 episode; credited as Kathy Richards 1978 The Rockford Files Judy 1 episode; credited as Kathie Richards 1979 The Dark Shelly Warner Credited as as Kathy Richards 1979 On the Air Live with Captain Midnight Corvette Girl Credited as Kathleen Richards 1992 Wishman Woman at Football Game Uncredited 2020 BSA Live A star === As herself === Year Show Notes 2003 It's Good to Be... 1 episode 2003–2007 The Simple Life 6 episodes 2005 California Entertainment Weekly 2005–2023 Today 3 episodes 2005 The Tonight Show with Jay Leno 1 episode 2005–2009 Larry King Live 2 episodes 2005 The View 1 episode 2005 The Miss Teen USA Pageant 2005 I Want to Be a Hilton 8 episodes 2007–2023 Entertainment Tonight 16 episodes 2008 The Young and the Restless 2 episodes 2008 Paris, Not France 2009 The 35th Annual People's Choice Awards 2009 Paris Hilton's British Best Friend 1 episode 2010 The Ellen DeGeneres Show 1 episode 2011–2022 The Real Housewives of Beverly Hills 47 episodes 2011 The Talk 1 episode 2011 The World According to Paris 4 episodes 2011 Piers Morgan Tonight 2 episodes 2012 Home & Family 1 episode 2013–2014 Life with La Toya 9 episodes 2013 Mornings 1 episode 2013 Hollywood Today 1 episode 2014 Hi Society 1 episode 2015 Million Dollar Listing San Francisco 1 episode 2018 The American Meme Uncredited 2018 Access Hollywood 2 episodes 2020 The Artists Report 1 episode 2020 This Is Paris 2021 Extra 1 episode 2021 Daily Blast Live 1 episode 2021–2023 Watch What Happens Live! with Andy Cohen 3 episodes 2021 Robin & Company 1 episode 2021 Cooking with Paris 1 episode 2021 The Kelly Clarkson Show 1 episode 2021–2022 The Real Guest co-host; 6 episodes 2021 Architectural Digest 1 episode 2021 Paris In Love 13 episodes 2022 The Tonight Show with Jimmy Fallon 1 episode 2022 Watch What Happens Live! with Andy Cohen Podcast series; 1 episode 2022 The Drew Barrymore Show 1 episode 2022 2022 MTV Movie & TV Awards: Unscripted 2022 The Q Agenda 1 episode 2022 Dish Nation 2 episodes 2022 The 48th Annual People's Choice Awards Source: == References == Category:1959 births Category:Living people",
 "title": "Kathy Hilton"
}