{
 "id": "858686",
 "text": "Harland Reesor Williams (born November 14, 1962) is a Canadian-American actor and stand-up comedian. ==Personal life== Harland Reesor Williams was born on November 14, 1962, in Toronto, Ontario, to Lorraine Mary (née O'Donnell), a social worker, and John Reesor Williams, a lawyer who served as a member of the Ontario legislature from 1975 to 1985. He is the middle child of five with two older, his brother Steve, and two younger sisters. Harland holds dual citizenship with Canada and the United States. He is the author and illustrator of his own series of children's books involving a little brontosaurus named Lickety Split. Williams' love of art drove him to create the series, in which the curious, young dinosaur embarks on a series of amazing adventures and learns important life lessons in the process. The artistically inclined Williams had refined his passion for drawing and painting at Canada's Sheridan College in Oakville, Ontario. Finding a creative outlet in poetry and painting while working as a forest ranger for five years after dropping out of Sheridan College, Williams set his goals to leave the forest as a stand-up comic and actor, soon moving to Los Angeles to pursue his newfound calling. Williams is cousin to Barenaked Ladies keyboardist Kevin Hearn, and together they have a hobby band called The Cousins. Williams also played the security guard in the music video for the band’s 2001 single \"Falling for the First Time\". ==Career== Williams is known for his movie roles, which include Dumb and Dumber, Freddy Got Fingered, There's Something About Mary, Half Baked, RocketMan, Sorority Boys, Down Periscope, Superstar and Employee of The Month. Williams starred as the security guard in the music video for the 2001 Barenaked Ladies song \"Falling for the First Time\". He has performed his stand-up comedy routines on Late Night with David Letterman, The Tonight Show with Jay Leno, Late Night with Conan O'Brien, HBO, Comedy Central and at comedy clubs throughout the country. ==References== Category:1962 births Category:Living people Category:Canadian movie actors Category:Canadian television actors Category:Canadian voice actors Category:Canadian stand-up comedians Category:Comedians from Toronto Category:Actors from Toronto",
 "title": "Harland Williams"
}