{
 "id": "858696",
 "text": "The Kashmir Markhor or the Flare-Horned Markhor (Capra falconeri cashmiriensis) is a goat that lives in Afghanistan, Pakistan, Uzbekistan, and Tajikistan and in the Kashmir Valley in India. Some scientists say it is a subspecies of Capra falconeri and others say it does not count as its own subspecies. The Kashmir Markhor is the sub species of Markhor which is also known as Pir Panjal Markhor. These Markhors are found in the Chitral Valleys of Khyber Pakhtunkhwa, a province of Pakistan and Neelum Valley. These markhors are hunted under a community-based hunting program. One survey conducted by CITES and WWF and the KPK wildlife department counted only 300 markhors. Then the government started the community-based hunting program. They issued 4 hunting permits for Kashmir markhor per year. They required that 80% of the money from trophy hunting go to the local community. Because of this, local people stopped killing the markhor for food. This hunting program succeeded. A more recent survey counted 4000 markhors. This animal is easier to hunt than the Astor Markhor or Suleman Markhor but the hunter must be strong. A 40” horn is considered representable. ==Appearance== This wild goat- antelope has horns on its head that curve in a spiral. It is synonymous with the Astor Markhor which has large, flat horns, branching widely and then going up nearly straight with only a half turn, from a heavy, flat horns, twisted like a corkscrew. ==Home== These animals live in dry places. In the winter, they do not live more than 2200 meters above sea level. ==Behavior== For most of the year, the Kashmir markhor eats grassy plants. In the winter, when snow covers the grass, the Kashmir markhor will eat parts of trees and shrubs if it cannot find grass. It can eat pine needles, but not when it can find other foods. When it is not mating season, male and female Astor markhors often live apart. The females usually go to cliffs with fewer plants on them, and the males go to places with more plants to eat. Ahmad, R., Sharma, N., Mishra, C., Singh, N. J., Rawat, G. S., & Bhatnagar, Y. V. (2018). Security, size, or sociality: what makes Markhor (Capra falconeri) sexually segregate?. Journal of Mammalogy, 99(1), 55-63. ==Threats== There are few Kashmir markhor left because human beings take livestock to eat grass in the places where the Kashmir markhor lives. Other people have killed the Kashmir markhor for its horns. ==In culture== The nominate subspecies Kashmir Markhor is the State animal of Azad Kashmir. == Notes == ==References== Category:Caprids Category:Mammals of Pakistan Category:Plants and animals of Kashmir Category:Azad Kashmir",
 "title": "Kashmir markhor"
}