{
 "id": "858631",
 "text": "Ligurian or Genoese ( or ) is a Romance language of the Gallo-Romance branch spoken in the Liguria region in northwestern Italy and in two communes in the Italian island of Sardinia as well as in parts of Alpes-Maritimes and Corsica in southeastern France, and in Monaco. Ligurian belongs to the Gallo-Italic languages group within the Gallo-Romance branch and therefore differs significantly from standard Italian, which is spoken south of the La Spezia- Rimini language border; the same applies to the other northern Italian languages. They include Piedmontese, Lombard, Emilian and Romagnol. Ligurian has many dialects, the most widespread of which is Genoese, spoken in Genoa. Another dialect of Ligurian, is Monegasque, which is spoken as a first language by the people of Monaco. == Status == The Ligurian language, like many minority languages, is an endangered language which is disappearing more and more in recent years and may be threatened with extinction. Only around 500,000 out of the 2,000,000 Ligurians, speak Ligurian, who are mostly older people. Because the Ligurian language is rarely passed on to the younger generations, fewer younger people speak it. That is why like the other minority languages, it is slowly being replaced by standard Italian or standard French. Ligurian does not enjoy an official status in Italy. Hence, it is not protected by law. Ligurian also does not enjoy an official status in France. In Monaco, where it is known as Monégasque, it is not an official language, but it enjoys an official status and is taught in schools, where it is compulsory. == Dialects == Dialects of the Ligurian language are: *Bonifacino (, in Bonifacio, Corsica, France) *Brigasc (, in La Brigue, Alpes- Maritimes, France and Briga Alta, Liguria, Italy) * (in Provence, France) *Genoese ( or , main Ligurian dialect, spoken in Genoa, Liguria, Italy), see below *Genoese of Gibraltar ( in Gibraltar) *Genoese of Tabarca (, in Tabarca, Valencia, Spain) *Genoese of Portoria (, in Genoa, Liguria, Italy) *Intemelio (in Sanremo -- and Ventimiglia --, Liguria, Italy) *Monégasque (, in Monaco) *Novi dialect, part of Oltregiogo Ligurian (, north of Genoa, mainly in Val Borbera and Novi Ligure, Piedmont, Italy) *Royasc (, in Upper Roya Valley, between Liguria, Italy and Alpes-Maritimes, France) *Savonese (, in Savona, Liguria, Italy) *Spezzino (, in La Spezia and its province, Liguria, Italy) *Tabarchino (, in Calasetta and Carloforte, Sardinia, Italy) *Tendasc (, in Tende, Alpes-Maritimes, France) The sign means that this dialect is extinct, meaning it has no speakers. === Genoese dialect === Genoese (locally called or ), is the Ligurian dialect spoken in Genoa, the capital of Liguria. It is the main Ligurian dialect. There are two ways to spell it: (from Genoa) and (from ). One famous Genoese folk song is \"\". It was written in 1925. == References == == Other websites == *Associazione O Castello (in Italian and Ligurian) *Académia Ligùstica do Brénno (in Ligurian) *\"Official Orthography and Alphabet\" proposed by the Académia Ligùstica do Brénno (in Ligurian) *GENOVÉS.com.ar (English version) – Ligurian language & culture, literature, photos and resources to learn Ligurian (in English) *Ligurian basic lexicon at the Global Lexicostatistical Database *The Firefox browser in Ligurian *The Opera browser in Ligurian Category:Endangered languages Category:Languages of Italy language Category:Romance languages",
 "title": "Ligurian language"
}