{
 "id": "85871",
 "text": "The Pigeon Detectives are an English band who originated from Rothwell in Leeds, they formed in 2002. They have received praise by such well known DJs as Steve Lamacq and Jo Whiley, and performed at the Reading and Leeds Festivals in 2006, where they were \"the band most likely to leap to the main stage in 2007” in an issue of the NME. They supported Dirty Pretty Things whilst they toured in spring 2006. In early November 2006 they supported The Kaiser Chiefs, who are known to be admirers of the band. On 8 July 2007, they played on the Radio 1 NME Stage in front of thousands of people at T in the Park. The performance was televised and shown later that day on BBC3 television channel. ==Current members== * Matt Bowman (vocals) * Oliver Main (lead guitar) * Ryan Wilson (rhythm guitar) * Dave Best (bass) * Jimmi Naylor (drums) ==Discography== ===Singles=== Title Release Date Label Cat Number UK Singles Chart Album Extra Information \"I'm Not Sorry\" 13 March 2006 Dance To The Radio DTTR008 Limited Edition (500) 7\" \"You Know I Love You\" 16 July 2006 Dance To The Radio DTTR015 N/A Limited Edition 1000 7\" and 500 empty CD covers for single promotion gig at The Cockpit \"I Found Out\" 6 November 2006 Dance To The Radio DTTR018 39 Wait For Me #1 UK Indie \"Romantic Type\" 26 February 2007 Dance To The Radio DTTR026 19 Wait For Me #1 UK Indie \"I'm Not Sorry\" 21 May 2007 Dance To The Radio DTTR029 12 Wait For Me #1 UK Indie \"Take Her Back\" 13 August 2007 Dance To The Radio DTTR034 20 Wait For Me #1 UK Indie \"I Found Out (2007 Version)\" 12 November 2007 Dance To The Radio DTTR040 42 Original Version Taken From The Pigeon Detectives' First Album, Wait For Me Re-Recorded with a DJ named Stephen Street ==References== ==Other websites== * Official site * Dance to the Radio record label * The Pigeon Detectives - Leeds Music Scene * The band at MySpace * The Pigeon Detectives live images on shootingmusic * The band at Drowned in Sound * Last.fm playbacks, samples and tunes Category:English rock bands Category:English punk bands Category:Indie rock bands",
 "title": "The Pigeon Detectives"
}