{
 "id": "859247",
 "text": "The Siberian ibex (Capra sibirica), also known as the Altai ibex or Gobi ibex, is a species of ibex that lives in central Asia. == Appearance == They are the longest and heaviest goats known, though they are surpassed in shoulder height. Males are between 88 and 110 cm (35 and 43 in) in shoulder height, and weigh between 60 and 130 kg (130 and 290 lb). Females are noticeably smaller, with heights between 67 and 92 cm (26 and 36 in), and weights between 34 and 56 kg (75 and 123 lb). Both genders have beards, though it is shorter and can be possibly absent in females. The colouration is also variable, from dark brown to light tan, with some reddish individuals. == Taxonomy == The wild goat species form a closely related group with complicated internal systematics. Externally, the various forms are distinguished mainly by the sometimes very large horns of the males, while the females are also relatively similar between species. On the basis of the horns of the males one believed for a long time to be able to distinguish different species or species groups. Alpine ibex, Siberian ibex and Nubian ibex, for example, look very similar and were considered to be particularly closely related. What remained puzzling was the fact that the ranges of these three forms are separated by those of other wild goat species. Genetic studies, however, strongly suggest that the Siberian Ibex and the Nubian Ibex each represent separate species, with the Siberian Ibex standing at the base of the genus _Capra_ === Subspecies === Though some recent authorities treat the species as monotypic, others have recognized four subspecies, based mainly on differences in total size and size of horns: * C. s. sibirica - Sayan Mountains * C. s. alaiana - Alay Mountains * C. s. hagenbecki - western Mongolia * C. s. sakeen - Pamir Mountains, western Himalayas, India, Afghanistan and Pakistan == Habitat and Distribution == Siberian ibexes live mostly above the tree line, in areas of steep slopes and rocky scree. Most Siberian ibexes are seen in central and northern Asia, Afghanistan, western and northern China (Primarily Xinjiang), north-western India, south-eastern Kazakhstan, Kyrgyzstan, Tajikistan, eastern Uzbekistan, Mongolia, northern Pakistan, and south-central Russia. == References == Category:Caprids Category:Mammals of Asia",
 "title": "Siberian ibex"
}