{
 "id": "859224",
 "text": "The Dialects in Tyrol belong to the Upper German dialect groups Bavarian and - only marginally - Alemannic. A large part of it is occupied by Southern Bavarian, which in Tyrol includes the western and central parts of North Tyrol as well as South and East Tyrol. The Ötztal dialect, which represents the transitional area between the Bavarian and Alemannic continuum and also has borrowings from the Rhaeto-Romanic language formerly spoken in the region and still spoken in parts of neighboring Graubünden, was designated an intangible cultural heritage in Austria by the Austrian UNESCO Commission as of October 2010 because of its specificity, and because it represents a living linguistic landscape. == General characteristics == Common features of Southern Bavarian, as distinguished from Central Bavarian, are: * Diphthongization of mhd. ê and ô to ea and oa, as in Schnea, German: 'Schnee' and roat, German: 'rot'. * Distinction between voiced and voiceless final sounds, as in Dåch next to Tåg; * Old k is sound-shifted to kch, as in kchlea (German: Klee); * Missing r and l vocalization, as in Håls and i will (so not Håis and i wui); * Preservation of the prefix ge-, as in getrunkchn; * Preservation of the vowel sound in articles; * st becomes scht (e.g., gestern → geschtern, lustig → luschtig). However, these features do not occur in all speakers, or some are on the wane. == Lexic == Tyrolean shows partial lexical similarities with Alemannic; for example, the Alm/Alp isogloss runs through Tyrol (in the Inn Valley: between Ötztal and Imst).Statistik Austria: Ortsverzeichnis: Tirol. 2001. Einträge Haiming S. 36 resp. Roppen, S. 44 – die Ortslagen Alm und Alpe werden hier getrennt geführt, vergl. Erläuterungen: 7. Almen, Alpen, Berggüter und Vorsäßen, S. 14 (pdf, statistik.at). Differences from the rest of Austria are also evident in vocabulary, as in: ållm, ålli, olli - always aniadr, aniedr / aniade - each / every auchi, aufi, auchn, aucha - upwards aweck - away, away (cf. English away) Fleischkas - meat loaf gegga - fie, bad (children's language) gleim (also in Carinthia) - close (together) Gluuf, Gluufe, Glufa - safety pin, pin (cf. Gufe in Swiss German and Glufa in Swabian) lei (also in Carinthian) - only losna, horchn - to hear (cf. Swiss German verb lose) lipfa, lupfn - to lift up marenda - snack (between meals) Halbmittag - mid-morning snack (specific to South Tyrol) marenda or untern - snack Mosbeer - blueberries oi, oui, euchi, öachn, ouchn, ocha - downhill d - this dear, dr - the dia - the semm, zem, detta, dert - there The following terms are widely used; their meaning may vary somewhat from place to place. Not all pronunciation variants are included in the list. bekirnan, pekiengin - to swallow decht - nevertheless, yet drlada, drloadn - to bore, to annoy dunta - down endern - beyond felli, fellig, föllig - almost, nearly floka lossa, flacken - to lie down formas, foarmos - breakfast gahl, lobelat - weakly salted ghilb, gehilbe - cloudy, foggy glangla losa, glenggang - to dangle, to hang (loosely) gliandi, gleanig, gluenig - glowing grantl, gront, grant, troug - trough graschglan, graschplen - to crackle, crunch, rustle Griffl - finger huppm, happm - to take (a child) in the arm Huudr, Hüdr, Hudo - rag, shred of cloth iatz - now inrua lossa, unkeit lossn - to leave unmolested, to leave alone kallar, schöpfa - ladle kraaln, gralln - to scratch Kondla, Kondl - jug Lulle, Lüllar, Luller - pacifier night - yesterday nikarli mocha, nåpsln, nuagerle - midday nap Neunerlen - morning snack Ora, Losar - ears Patatti - potato (Tyrolean Oberland) plindara, plintern - to move, to change apartment Pundl, Pundal - jug, container Purzigogla, Puchzigoglar, Purzigagel - somersault riibl, riiblar - a kind of schmarren roogl, rougl, rougla - loose, not solidified schiifara, schiifer - splinter of wood (in the skin) schittla, naggln - to wiggle, to shake schmargala/stinka, schmargelen - to smell badly schwenza - to flush springea - to run Strauch, Strauche - cold, sniffles suur, gilla - manure, slurry taasig - dizzy, weary, limp Taatl, Tootn - drawer, container Teggn - infirmity, damage Tiisl - flu, disease Troppl - trap Tschippl, Schiipl - a (small) amount Tschottn, Tschouttn, Schotta - curd, curdled milk wiach, wiache - (very) fat zfleiß, zefleiße - intentionally, in defiance of the law Zeggr - hand basket, shopping bag Zogglar - badly dressed person, tramp, good-for-nothing Notsch - pig Ő - newspaper The vocabulary of Tyrolean dialects is recorded and described in the Dictionary of Bavarian Dialects in Austria. == Influence of other languages == The Tyrolean dialect was influenced by other languages of previously settled peoples who became sedentary in the course of the migration of peoples. This is especially true for Rhaeto-Romanic, which was displaced in most areas over the centuries. This is especially noticeable in romanized terms such as Balla for Ballen (Tyrolean Oberland). In the Pustertal and in East Tyrol, as well as in Carinthia, a Slavic influence is added, which is reflected above all in a much softer pronunciation. In South Tyrol, due to the affiliation with Italy, some Italian loan words have developed. == Regional expressions == In Tyrol, dialect boundaries run west to the Alemannic of Vorarlberg, which forms a sharp border, and roughly east of Schwaz (excluding the Zillertal) to the Central Bavarian transitional area. === North Tyrol === ==== Oberland ==== While in the south and east as well as in the central area of North Tyrol it is ålm/åjm (German: Alpe, Bergweide) or wīsn (German: Wiese), in the west with ålwe and wīse a transitional area to Alemannic (about Vorarlberg) shows up, where further west the -e also fades (alp, wīs). Other features of Tyrolean Oberland there are gsejt instead of gsågt (German: gesagt) and it instead of nit (German: nicht). There is also a typical Alemannic idiom used. For example, in the rest of Tyrol it is I gea iatz schwimmen (German: Ich gehe jetzt schwimmen), but in parts of the Oberland it is I gea iatz ga schwimma. This is very similar to the Alemannic Etzt gang i ga schwimma. In the Upper Inn Valley, diminutive forms are -le, -ele and -eli, while in the rest of the Inn Valley an -l is added. The sound groups of the short el become al in the Oberland (German: Welt - Walt or Geld - Gald). == Bibliography == * Karl Kurt Klein, L. E. Schmitt (Hrsg.): Tirolischer Sprachatlas, bearb. von Egon Kühebacher, Tyrolia Verlag, Innsbruck. * Johann Baptist Schöpf, Anton J. Hofer: Tirolisches Idiotikon. Innsbruck: Wagner 1866. * Heidemaria Abfalterer: Der Südtiroler Sonderwortschatz aus plurizentrischer Sicht. Innsbruck University Press, Innsbruck 2007, ISBN 3-901064-35-4 (= Innsbrucker Beiträge zur Kulturwissenschaft, Germanistische Reihe, Band 72). * Josef Schatz: Wörterbuch der Tiroler Mundarten, Schlern-Schriften Nr. 119–120, 1955/56. * Josef G. Mitterer: Lienzer Grammatik. Eine dialektologische Einführung in die Mundarten des Lienzer Talbodens. CreateSpace 2018. ISBN 1-986792-40-4 * Hans Moser in Zusammenarb. mit Robert Sedlaczek: Das Wörterbuch der Südtiroler Mundarten. Innsbruck-Wien: Haymon 2015. ISBN 978-3-7099-7838-2 * Hans Moser: Das große Wörterbuch der Tiroler Dialekte. Innsbruck-Wien: Haymon 2020. ISBN 978-3-7099-3457-9 == Other websites == * Dictionary of the Bavarian Dialects in Austria , Austrian Academy of Sciences * South Tyrolean dialect dictionary, on oschpele.ritten.org * Some articles in the Tyrolean dialect in the Bavarian Wikipedia == References == Category:Austrian culture Category:Tyrol (state) Category:German dialects Category:Italian culture",
 "title": "Dialects in Tyrol"
}