{
 "id": "859573",
 "text": "The Jaffa orange is an orange variety with few seeds. and a tough skin. Because of these features, the variety can be exported easily. It is also known by its Arabic name, Shamouti orange. Today the variety is thriving. Palestinian farmers developed these oranges, in the mid 19th century. The oranges take their name from the city of Jaffa where they were first produced for export. Today, Jaffa is a a part of Tel Aviv. The orange was the main citrus export for the city. Together with the navel and bitter orange, it is one of three main varieties of the fruit grown in the Mediterranean, Southern Europe, and the Middle East. The Jaffa is also cultivated in Cyprus, Iraq, Lebanon, Syria, Jordan and Turkey. Jaffa oranges produce very little juice. These oranges are very cold-tolerant, allowing them to grow outside of the subtropical regions normally associated with growing oranges. 'Jaffa' oranges are affected by certain types of fungus, and are prone to biennial bearing - irregular crop. == History == Located between Africa, western Asia, and Europe, Palestine produced a number of commodities for export throughout the late Turkish period (1200–1900 CE). Among these were Nabulsi soap, sugar, barley, oranges, and cotton. Though cotton left its mark throughout the region, the only commodity that remains a symbol of production in Palestine is the 'Jaffa' orange. The 'Jaffa' orange was a new variety. Arab farmers developed it, after it emerged as a mutation on a tree of the 'Baladi' variety near the city of Jaffa, in the 19th century. While the sour orange (C. aurantium) was brought westward from China and India by local traders, who may have introduced it to Sicily and Spain, the 'Jaffa' orange was developed from the sweet orange (C. sinensis) which was brought from China to the Mediterranean region by Portuguese explorer Vasco da Gama in 1498. After the Crimean War (1853–56), the most important innovation in local agriculture was the rapid expansion of citrus cultivation. One of the varieties often cultivated was the Jaffa (Shamouti) orange. A mention of an export of these oranges to Europe first appears in British consular reports in the 1850s.Krämer, 2008, p. 91. One factor cited in the growth of the export market was the development of steamships in the first half of the 19th century. These made it possible to export oranges to the European markets in days rather than weeks. Another reason for the growth of the industry was that the Europeans had less control over the cultivation of oranges compared to cotton, which used to be grown in Palestine, but was often replaced by the Jaffa orange. Exports grew from 200,000 oranges in 1845 to 38 million oranges by 1870. Most of the citrus plantations of this time were owned by wealthy Palestinian merchants and notables. A citrus plantation required large amounts of capital, and at the start there is no yield for several years. This made it very difficult for small farmers to grow citrus fruits on a large scale. Fruits with the \"Jaffa orange\" label were first marketed in Sarona, a German Templer colony established in 1871. An 1872 account of Jaffa by a European traveller notes that, \"Surrounding Jaffa are the orange gardens for which it is justly extolled, and which are a considerable source of wealth to the owners. The annual value of fruits grown in Jaffa was said to be 10,000 pounds.\" In the 1880s, an American grower, H.S. Sanford, tried to cultivate the 'Jaffa' orange in Florida. The prosperity of the orange industry brought increased European interest and involvement in the development of 'Jaffa'. In 1902, a study of the growth of the orange industry by Zionist officials outlined the different Palestinian owners and their primary export markets as England, Turkey, Egypt and Austria-Hungary. While the traditional Arabic cultivation methods were considered \"primitive,\" an in-depth study of the financial expenditure involved reveals that they were ultimately more cost- efficient than the Zionist-European enterprises that followed them some two decades later. The Zionists who immigrated to Palestine introduced the advanced cultivation methods that spurred the 'Jaffa' orange industry. According to the Hope Simpson Enquiry of 1930, > \"The cultivation of the orange, introduced by the Arabs before the > [beginning] of Jewish settlement, has developed [a lot] [as a] consequence > of that settlement. There is no doubt that the pitch of perfection to which > the technique of plantation and cultivation of the orange and grapefruit > have been brought in Palestine is due to the scientific methods of the > Jewish agriculturist.\"The Hope Simpson Report at UNISPAL. CHAPTER VIII. > Agricultural Produce. (a) CITRUS CULTIVATION Partnerships in growing and exporting these oranges was an example of Arab- Jewish cooperation despite rising political tensions. At the end of 1928, Jews owned 30,000 dunams of the country's 60,000 dunams of orange orchards. Whereas before World War I, the price of a dunam of land in a fruitful orange grove was 50-75 pounds sterling, by 1929, the same groves were selling for 150-200 pounds sterling. By 1939, Jewish-owned and Arab-owned orange orchards in Palestine covered , employed over 100,000 workers, and their produce was a primary export. During World War II (1939–1945) citrus-growing declined, but recovered after the war with the vigorous assistance of the British Mandate authorities. == Legacy == Jaffa oranges are harvested in the Israeli territories and the Palestinian territories between November and March, with the marketing season beginning in September and extending through April. More than half the annual crop is exported, and Israel is a main provider of other citrus fruits to the European Union. In the 1950s and 1960s, Jaffa oranges became emblems of the Israeli state. A general decline in the importance of agriculture to the Israeli economy, extreme limits on available water resources, and the reliance on migrant workers have reduced productivity. Even though, manufacturing industries, such as diamonds and precision instruments, are more important today, Israel still exports a large number of citrus fruits to Europe. The 'Jaffa' orange is also known for lending the city of Tel Aviv- Yafo the nickname \"Big Orange\". == Related pages == * Jaffa Cakes == References == == Other websites == * * 120 Years of Citrus in Israel * An orange Israeli icon turns green Category:History of Palestine Category:Pages with unreviewed translations Category:Citrus",
 "title": "Jaffa orange"
}