{
 "id": "859690",
 "text": "The is the executive branch of the government of Japan. == Current Cabinet of Japan == The members of the current cabinet of Japan headed by the Liberal Democratic Party lawmaker Shigeru Ishiba since 2024 are as follows. Portfolio Portrait Minister Minister Minister Took office Left office Note Cabinet ministers Prime Minister Shigeru Ishiba R 1 October 2024 Incumbent Minister for Internal Affairs and Communications Seiichiro Murakami R 1 October 2024 Incumbent Minister of Justice Hideki Makihara R 1 October 2024 Incumbent Minister for Foreign Affairs Takeshi Iwaya R 1 October 2024 Incumbent Minister of Finance Minister of State for Financial Services Minister in charge of Overcoming Deflation Katsunobu Katō R 1 October 2024 Incumbent Minister of Education, Culture, Sports, Science and Technology Toshiko Abe R 1 October 2024 Incumbent First cabinet appointment Minister of Health, Labour and Welfare Takamaro Fukuoka C 1 October 2024 Incumbent Minister of Agriculture, Forestry and Fisheries Yasuhiro Ozato R 1 October 2024 Incumbent Minister of Economy, Trade and Industry Minister of State for the Nuclear Damage Compensation and Decommissioning Facilitation Corporation Yoji Muto R 1 October 2024 Incumbent Minister of Land, Infrastructure, Transport and Tourism Minister in charge of Water Cycle Policy Minister for the World Horticultural Exhibition Yokohama 2027 Tetsuo Saito R 4 October 2021 Incumbent Minister of the Environment Minister of State for Nuclear Emergency Preparedness Keiichiro Asao C 1 October 2024 Incumbent First cabinet appointment Minister of Defense Gen Nakatani R 1 October 2024 Incumbent First cabinet appointment Chief Cabinet Secretary Yoshimasa Hayashi R 14 December 2023 Incumbent Minister for Digital Transformation Minister in charge of Digital Administrative and Fiscal Reforms Minister in charge of Digital Garden City Nation Vision Minister in charge of Administrative Reform Minister in charge of Civil Service Reform Minister of State for Regulatory Reform Masaaki Taira R 1 October 2024 Incumbent Minister of Reconstruction Minister in charge of Comprehensive Policy Coordination for Revival from the Nuclear Accident at Fukushima Tadahiko Ito R 1 October 2024 Incumbent Chairman of the National Public Safety Commission Minister in charge of Building National Resilience Minister in charge of Territorial Issues Minister of State for Disaster Management and Ocean Policy Manabu Sakai R 1 October 2024 Incumbent Minister of State for Policies Related to Children Minister of State for Measures for Declining Birthrate Minister of State for Youth's Empowerment Minister of State for Gender Equality Minister in charge of Women's Empowerment Minister in charge of Cohesive Society Minister in charge of Measures for Loneliness and Isolation Junko Mihara C 1 October 2024 Incumbent Minister in charge of Economic Revitalization Minister in charge of New Capitalism Minister in charge of Startups Minister in charge of Infectious Disease Crisis Management Minister in charge of Social Security Reform Minister of State for Economic and Fiscal Policy Ryosei Akazawa R 1 October 2024 Incumbent Minister in charge of Economic Security Minister of State for \"Cool Japan\" Strategy Minister of State for Intellectual Property Strategy Minister of State for Science and Technology Policy Minister of State for Space Policy Minister of State for Economic Security Minoru Kiuchi R 1 October 2024 Incumbent Minister of State for Okinawa and Northern Territories Affairs Minister for Consumer Affairs and Food Safety Minister of State for Regional Revitalization Minister of State for Ainu-Related Policies Minister for the World Expo 2025 Yoshitaka Itō R 1 October 2024 Incumbent == References == * The Japan Times. \"Cabinet Profiles\" [since 2008]. The Japan Times Online. Accessed 13 October 2012 from: https://web.archive.org/web/20040623111921/http://www.japantimes.com/cabinets.htm * Cabinet Secretariat, Office of Cabinet Public Relations, Japan (2003). Prime Minister of Japan and His Cabinet. Retrieved 28 Oct. 2003 from: http://www.kantei.go.jp/foreign/index-e.html * Hunter, Janet (1984). Concise Dictionary of Modern Japanese History. Berkeley and Los Angeles: University of California Press, pp. 266–324, Appendix 5: Japanese Cabinets Since the Introduction of the Cabinet System in 1885 [to 1980]. Category:Government of Japan",
 "title": "Cabinet of Japan"
}