{
 "id": "859654",
 "text": "The currency for most of the history of Manipur consisted of gold, silver, bronze and copper coinage. From the earliest history of the coinage in the Ancient Manipur during the 1st century CE, well into the modern times, Manipur currency saw many changes in form, == Standards and denominations == There were two kinds of coins issued in Ancient Manipur right from the time of the onset of marketing, which are \"semkhai\" and \"sen\". These are generally crafted out of bronze. Two \"semkhai\"s equals to one \"sen\". == Ancient period == The earliest known coinage was issued by during the reign of Emperor Ura Konthouba in the 7th century CE in Ancient Manipur (Antique Kangleipak). Some historians strongly opined that the oldest known coins were circulated from the 1st century CE during the reign of Emperor Nongda Lairen Pakhangba in Ancient Manipur. It is evident that bronze coins dating back to 568 AD to 658 AD were found inscribed with letters of archaic Meitei script. == Medieval period == === Early medieval === It is evident from the coins discovered that there was a good deal of literary activity taken place during the reign of King Kyamba. The Cheitharol Kumbaba recorded that King Khagemba issued coins along with which there was all round progress in the kingdom. In the Sana Keithel (Royal Market), there was a custom in which the king threw bell metal coins amidst the public as familiar gestures of goodwill and responsibility for public welfare. In the beginning, kings had to abandon the plan to issue copper coins when the women traders refused to accept them. === Late medieval === The coins issued before the reign of King Pamheiba () depicted legends in the archaic Meetei script. For the first time in the history of Manipur's numismatics, Garibaniwaja introduced the Nagari script in depicting the legends. The tradition of depicting Bengali script and Nagari script in the coins was followed by the succeeding rulers of later times. Many of the coins, issued in between seventeenth and nineteenth century AD, bear Sanskrit legends in Devanagari script. On special occasions, coins were distributed among the crowds with a grand possession of the royalty. == Modern period == On special occasions, coins were distributed among the crowds with a grand possession of the royalty. In the Northeast India, only Manipur struck low denomination coins that were useful for market trading. When Manipur came under the Indian Union, the Indian currency came into use. == Minting == The Senjam and the Aheibam families were engaged for making coins under the supervision of the institution of the maibas. The populace often learned about of a new ruler when coins appeared with the new ruler's name. For example, Ura Konthouba (Wura Konthouba) issued coins bearing the Meetei letter \"ꯋ\" (\"wa\") denoting his name. == Coins in religious activities == The senior most/chief male family members (pibas) used coins in the names of God Sanamahi and Goddess Leimarel and regularly perform rites and rituals in the Sanamahi Kachin (Lainingthou Kachin). During the Laiching Jagoi, an ancient dance performance in the Lai Haraoba festival, the senior most maiba has to throw a \"konyai\" (gold or silver coin) and rice into the water to invoke a deity. The art of fortune telling consists of throwing the coins on the floor and reading its results by the maibas and the maibis. == Bibliography == * ON A UNIQUE BRASS COIN (MEDALLIAN ?) OF MANIPUR on JSTOR * * == Other websites == * Unexplored Antique Coins of Manipur * Cultural Heritage Complex 8 * * * * * * * * * * * == References == Category:History of Manipur",
 "title": "Meitei currency"
}