{
 "id": "859711",
 "text": "Großostheim (or Grossostheim) is a market town in the Aschaffenburg district in the Regierungsbezirk of Lower Franconia (Unterfranken) in Bavaria, Germany. The inhabitants call themselves Aistmer (ostheimers). ==Geography== ===Location=== Großostheim is on the northeast edge of the Odenwald in the Bavarian Lower Main (Bayerischer Untermain) region. ===Constituent communities=== Großostheim's Ortsteile are Großostheim, Pflaumheim, Wenigumstadt and Ringheim. ===Neighbouring communities=== Clockwise from the north, these are the community of Stockstadt, the district-free town of Aschaffenburg, the community of Niedernberg, the community of Mömlingen (both in Miltenberg district) and the community of Schaafheim (Darmstadt-Dieburg). Together with Stockstadt am Main and the neighbouring Hessian community of Schaafheim, the market community forms the historic Bachgau region. ==Population development== Within the municipal area lived 12,788 inhabitants in 1970, 13,514 in 1987, 15,913 in 2000 and 16,299 in 2004. ==Politics== The mayor is Herbert Jakob (CSU), elected in April 2014 and re-elected in 2020. The income from municipal taxes in 1999 amounted to €9,751,000 (converted) of which net intake from business taxes amounted to €3,180,000. ===Education=== There are the following institutions (as at 2007): *Kindergartens: 675 kindergarten places with 652 children *Elementary schools: 5 with 72 teachers and 1,234 pupils ==Famous people== ===Sons and daughters of the town=== * Otto Becker (1958– ), German show jumper * Heinrich Hock (1887–1971), German chemist * Prof. Dr. Rudolf Schüßler (1960– ), German (moral) philosopher ===Town partnerships=== * Carbon-Blanc, Gironde, France * Saulxures-sur- Moselotte, Vosges, France * Hamoir, Liège Province, Belgium ==References== ==Further reading== * Wolfgang Hartmann: 1200 Jahre Großostheim. Großostheim 1999 * Frank Schmelz: Lineare anthropogene Gehölz- und Saumstrukturen im Bachgau (Gmde. Großostheim, Lkrs. Aschaffenburg). Gießen 2001 ==Other websites== * Bavarian Lower Main history portal * Großostheim in National Socialist times, documentation Category:Aschaffenburg (district)",
 "title": "Großostheim"
}