{
 "id": "859712",
 "text": "Haibach is a community in the Aschaffenburg district in the Regierungsbezirk of Lower Franconia (Unterfranken) in Bavaria, Germany. It has a population of around 8,300. == Geography == ===Location=== The community is east-south-east of the town of Aschaffenburg on the western edge of the Spessart (range) between the town and the hills' well-known landmark Mespelbrunn Castle. The highest elevations in the municipal area are the Findberg and the Buchberg. They reach some 330 m above NHN. Haibach is in the Spessart Nature Park (Naturpark Spessart) ===Constituent communities=== Haibach's Ortsteile are Haibach, Grünmorsbach and Dörrmorsbach. ===Climate=== The climate is moderate and warm (Bayerisch Nizza, or \"Bavarian Nice\"). Haibach represents a meteorological divide between the Main Plain and the High Spessart. ==Demographics== ===Religion=== There are three Catholic churches in the community: * St. Nikolaus von der Flüe, Haibach * St. Johannes der Täufer, Grünmorsbach * St. Johannes der Täufer, Grünmorsbach (old church under monumental protection) * St. Laurentius, Dörrmorsbach There is also one Protestant church: * Paul-Gerhardt-Kirche ==Economy== In Haibach are found, among others, the head office of the Adler chain of clothing shops, the German headquarters of Macrovision Corporation and the European headquarters of Renzi AG. ==Government== ===Mayor=== Since 2006, Andreas Zenglein (CSU) has been Haibach's mayor. ===Community council=== The council is made up of 20 council members, counting the mayor. CSU SPD Freie Wählergemeinschaft Total 2008 10 6 4 21 seats (as at municipal election held on 2 March 2008) ===Town twinning=== * Marck, Pas-de-Calais, France ==Infrastructure== ===Transport=== * Bus routes to Aschaffenburg: 5 (to Dörrmorsbach), 16, 40, 41, 47 * Autobahn A 3 between Frankfurt (roughly 45 km away) and Würzburg (roughly 75 km away). ==Education== * Haibach primary school and Hauptschule with Mittlere-Reife-Zug * Haibach primary school – Grünmorsbach branch ==References== ==Other websites== * Ketzelburg Category:Aschaffenburg (district)",
 "title": "Haibach, Lower Franconia"
}