{
 "id": "859956",
 "text": "The Street Enters the House (La Strada Entra Nella Casa) is an oil on canvas painting by Italian artist Umberto Boccioni. Painted in the Futurist style, the work centres on a woman on a balcony in front of a busy street, with the sounds of the activity below portrayed as a riot of shapes and colours. The first public display of the painting was in Paris, in 1912, as part of the first Futurist exhibition. It is now housed in the Sprengel Museum in Hanover, Germany. ==Background== Boccioni was one of the founding members of the Futurist movement.Clough, Rosa Trillo; Futurism: The Story of a Modern Art Movement, Greenwood Press (1961). pp. 22-23. Until 1910, the group concentrated primarily on capturing \"emotion and multiple states of mind\" using techniques derived from Neoimpressionism style (for example, Severini's The Black Cat or The Obsessive Dancer).Clough, pp. 68-70. After hearing second-hand reports of the innovations of Picasso and Braque, Boccioni and his compatriots adapted their technique to match, incorporating angular lines and intersecting planes as a way of capturing multiple viewpoints in a two- dimensional image.Glueck, Grace; \"On a Trip Back to Futurism, Women and Settings Merge\", The New York Times, 3 July 1998. Retrieved 12 October 2010. While this was going on, there was a corresponding shift in what the group was attempting to capture as well. They began to focus more heavily on the physical and the external rather than the emotional and internal.Rye, Jane; Futurism, Studio Vista (1972). pp. 46-48. In 1910, Boccioni began a series of works based on modern urbanism. The first, The City Rises, described the construction of a new city and the sights and sounds of men and horses at work. He described it as a \"great synthesis of labour, light, and movement.\"Lista, Giovanni; Futurism, Terrail (2001). p. 50. His later works, such as The Forces of the Street, The Street Enters the House, Simultaneity of Vision, and Street-pavers and A Study of a Woman Among Buildings were elaborations on the same theme. ==Composition and interpretation== The central figure of The Street Enters the House is a woman dressed in blue and white, viewed from behind and above. She looks over her balcony at a busy street scene, a riot of colours, lines, and angles. On the road in front of her, workers lift poles to form the walls of a new building, surrounded by a pile of bricks. On every side of this construction, white and blue houses lean into the street. Two of the balconies are occupied by other figures peering down into the road. A line of horses flies past the foreground. The identity of the woman in The Street Enters the House is the subject of some debate. While several scholars postulate that she was an entirely imagined character, Boccioni had a history of employing the women of his family as models. This has led some to the conclusion that the figure is Boccioni's mother, and use the depiction in The Street Enters the House as evidence of Boccioni's changing view of women in general and mothers in particular.Poggi, Christine; Inventing futurism: the art and politics of artificial optimism, Princeton University Press (2009). pp. 165-169 Antliff, Mark; \"The Fourth Dimension and Futurism: A Politicized Space\", The Art Bulletin, Vol. 82, No. 4 (Dec., 2000), pp. 730-731. The painting in general showcases Boccioni's evolution from a Neoimpressionist style to one more aligned with the ideals of Cubism, and the catalog description for the piece demonstrates his increasing fascination with scientific terminology. It includes lines such as \"The principles of Roentgen rays is applied to the work, allowing the personages to be studied from all sides, objects both at the front and the back are in the painter's memory.\"Tisdall, Caroline; Bozzolla, Angelo; Futurism, Thames and Hudson (1977). pp. 42-43. Boccioni experiments with Cubist techniques as a way of keeping elements in both the foreground and background \"rushing into the window at the same time\" He also weaves in references to his earlier works. See for example, the visual pun of the horse's appearance on the woman's buttock when compared with a line from his earlier Manifesto: \"How often have we seen upon the cheek of the person with whom we are talking the horse which passes at the end of the street.\" ==Provenance== The Street Enters The House was completed after Boccioni's return from Paris in November 1911. Its first public display was at the Bernheim-Jeune gallery in Paris as part of the first Futurist exhibition. The exhibition featured works by Boccioni, Carrà, and Severini, among others. It remained at Bernheim-Jeune from 5 to 24 February 1912, before moving on to Herwarth Walden's Sturm Gallery in Berlin, and finally to the Sackville Gallery in London. The painting, along with several others, was purchased by Albert Borchardt in 1913, who later donated it to the Sprengel Museum in Hanover, Germany,(German) Hanno Ehrlicher: Die Kunst der Zerstörung: Gewaltphantasien und Manifestationspraktiken europäischer Avantgarden. Akademie Verlag (2001), pp. 118–119. where it remains. ==References== ==Other websites== *Umberto Boccioni, a full text exhibition catalog from The Metropolitan Museum of Art, which contains material on this work Category:Paintings at Porta Romana Category:Paintings by Umberto Boccioni Category:Paintings in Milan Category:1910s paintings",
 "title": "The Street Enters the House (Boccioni)"
}