{
 "id": "86009",
 "text": "The Federal Ministry for Digital and Transport is a ministry of the Federal Republic of Germany. Its headquarters are in Berlin, but the second office, in Bonn, has more staff. The Minister is also \"Beauftragter der Bundesregierung für die neuen Bundesländer\" That is, he is the government's special representative for the old states of East Germany. His job is to help those states to rebuilld industry, improve roads and jobs and become as rich as the other states of Germany. == History == The Federal Ministry of Transport, Building and Housings (BMVBW) was formed in 1998 when the Federal Ministry of Transport and the Federal Ministry of Environmental Planning, Building and Construction and Urban Development were joined. The ministry was renamed in 2005 to the Federal Ministry of Transport, Building and Urban Development. Both of these earlier ministries were founded in 1949. Federal Minister for Environmental Planning, Building and Construction and Urban Development Name Party Term start Term end Eberhard Wildermuth FDP/DVP 1949 1952 Fritz Neumayer FDP 1952 1953 Victor- Emanuel Preusker FDP after 1956 FVP 1953 1957 Paul Lücke CDU 1957 1965 Ewald Bucher FDP/DVP 1965 1966 Bruno Heck CDU 1966 1966 Lauritz Lauritzen SPD 1966 1972 Hans-Jochen Vogel SPD 1972 1974 Karl Ravens SPD 1974 1978 Dieter Haack SPD 1978 1982 Oscar Schneider CSU 1982 1989 Gerda Hasselfeldt CSU 1989 1991 Irmgard Schwaetzer FDP 1991 1994 Klaus Töpfer CDU 1994 1998 Eduard Oswald CSU 1998 1998 Federal Minister for Transport 1949 1998 Name Party Term start Term end Hans Christoph Seebohm DP, as of 1960 CDU 1949 1966 Georg Leberalso Federal Minister for the post and telecommunications 1969-72 SPD 1966 1972 Lauritz Lauritzentill December 1972 also Federal Minister for the post and telecommunications SPD 1972 1974 Kurt Gscheidlealso Federal Minister for the post and telecommunications SPD 1974 1980 Volker Hauff SPD 1980 1982 Werner Dollinger CSU 1982 1987 Jürgen Warnke CSU 1987 1989 Friedrich Zimmermann CSU 1989 1991 Günther Krause CDU 1991 1993 Matthias Wissmann CDU 1993 1998 Federal Minister for Transport, Building and Housing (1998-2005) No Name Llife data Term start Term end Party 1 Franz Müntefering 1940- 27 October 1998 29 September 1999 SPD 2 Reinhard Klimmt 1942- 29 September 1999 16 November 2000 SPD 3 Kurt Bodewig 1955- 16 November 2000 22 October 2002 SPD 4 Manfred Stolpe 1936- 22 October 2002 22 November 2005 SPD Federal Minister for Transport, Building and Urban Development (2005-2013) No Name Life data Term start Term end Party 1 Wolfgang Tiefensee 1955- 22 November 2005 27 October 2009 SPD 2 Peter Ramsauer 1954- 28 October 2009 17 December 2013 CSU Federal Minister for Transport and Digital Infrastructure (2013-2025) No Name Life data Term start Term end Party 1 Alexander Dobrindt 1970- 17 December 2013 14 March 2018 CSU 2 Andreas Scheuer 1974- 14 March 2018 8 December 2021 CSU 3 Volker Wissing 1970- 8 December 2021 6 May 2025 FDP Federal Minister for Transport (2025-present) No Name Life data Term start Term end Party 1 Patrick Schnieder 1968- 6 May 2025 Incumbent CDU == References == *",
 "title": "Federal Ministry for Digital and Transport"
}