{
 "id": "860024",
 "text": "Ugo Natoli (Messina, 9 February 1915 - Rome, 13 November 1992) was a member of Italy's Consiglio Superiore della Magistratura (CSM). He was also a university professor and lawyer. Brother of Aldo Natoli and Glauco Natoli, he was full professor of labor law. He was a former partisan hero and collaborator of Palmiro Togliatti in the Ministry of Justice. Natoli è stato componente del primo Consiglio superiore della magistratura, and promoter of the association of magistrates and jurists \"Democratic jurists\".D'Albergo, Salvatore, Con Marx e senza Marx : la vicenda teorica di Democrazia e diritto, Democrazia e diritto: XLVII, 1 2, 2010 (Milano : Franco Angeli, 2010). He learned from Salvatore Pugliatti, full professor,Pinelli, Cesare, Lavoro e progresso nella Costituzione, Giornale di diritto del lavoro e di relazioni industriali. Fascicolo 3, 2009 (Milano : Franco Angeli, 2009). he is credited with having observed that the programmatic rules contained in the Constitution represent \"the definitive criterion for evaluating the legitimacy of all the activity expressed by the activity of the State\".Gianni Loy, UNA REPUBBLICA FONDATA SUL LAVORO, Rivista AIC . After having taught for a long time at the faculty of law of the University of Messina, he was holder of the chair of civil law at the faculty of jurisprudence of the University of Pisa, and for a long time dean and director of the Institute of private law of the same faculty, which was named after his death. Founder of the Legal Journal of Labor and Social Security,Sul suo contributo al diritto del lavoro, v. Giornale di diritto del lavoro e di relazioni industriali. Fascicolo 2, 2009, Milano : Franco Angeli, 2009. he collaborated with his students Lina Bigliazzi Geri, Umberto Breccia and Francesco Donato Busnelli in the series of civil law of the UTET publishing house. == Publications == * Il diritto soggettivo (1943) * Il conflitto dei diritti e l’art. 1380 del codice civile (1950) * Limiti costituzionali dell’autonomia privata nel rapporto di lavoro (1955) * L’amministrazione dei beni ereditari. I. L’amministrazione durante il periodo antecedente all’accettazione dell’eredità (2a ed. 1968) * L’amministrazione dei beni ereditari. II. L’amministrazione nel periodo successivo all’accettazione dell’eredità (2a ed. 1969) * L’attuazione del rapporto obbligatorio. Il comportamento del creditore (1974); L’attuazione del rapporto obbligatorio. Il comportamento del debitore (1984) == References == == Other websites == * * Category:Italian judges Category:People from Messina Category:1915 births Category:1992 deaths",
 "title": "Ugo Natoli"
}