{
 "id": "86034",
 "text": "A touchpad (also called a trackpad) is a type of input device for computers that does the same things as a computer mouse. It is made up of a flat, touch- sensitive surface which the user slides one or more fingers on to move the cursor on the screen. Next to the touchpad are push-buttons that work just like mouse buttons, including left-clicking and right-clicking. In some newer touchpads, there are no actual buttons, and clicking is done by pushing near the button of the touchpad itself. Unlike computer mice, touchpads stay in one place when they are being used. This makes it easy to build them into hardware. They are mostly found on laptop computers because, when the user is traveling, sometimes they cannot use a mouse. However, most laptops do allow the user to connect a separate mouse. Besides laptops, touchpads are also more and more used on mobile devices with a GUI, including MP3 players (a well- known one being the iPod) and mobile phones (such as the BlackBerry). However, touchpads on today's mobile devices such as smartphones and tablet computers have been replaced with the touchscreen, which is used much like a touchpad, except the screen is built into the touch-sensitive surface itself so that no mouse cursor is needed. One can just touch anywhere on the surface to choose what is on the screen at that part. Most touchpads have the function of tapping, which imitates the left-click button on a mouse. New models of touchpads often do more things because they can respond to the pressure of more than one finger. This is called multi-touch and makes it possible to do things like scroll though, zoom in and out, and rotate a page or part of the screen. The user can choose and change which functions happen if the user does certain moves. For example, the normal function for tapping on the pad is the left-click on the mouse. The user can change it in the settings section to the right-click of the mouse, if the user likes it better. ==Related pages== * Computer mouse * Touchscreen * Input device Category:Computer hardware Category:Data input",
 "title": "Touchpad"
}