{
 "id": "860480",
 "text": "Krystsina Siarheyeuna Tsimanouskaya or Kristina Sergeyevna Timanovskaya (, Łacinka: Kryscina Siarhiejeŭna Cimanoŭskaja, ; , ; born on November 19, 1996) is a Belarusian and Polish sprinter. She won a silver medal in the 100 metres at the 2017 European U23 Championships, a gold medal in the 200 metres at the 2019 Summer Universiade and a silver medal in the team event at the 2019 European Games. ==2020 Olympics== Tsimanouskaya was about to be part of the 2020 Summer Olympics in the 100 m and 200 m events. Belarus and the country's Olympic committee forced her to run in the 4 × 400 m relay race, even though she did not want to. Belarusian sports representatives just did not make enough doping tests for other 4 × 400 m relay race sprinters. But Tsimanouskaya has never run in this event as a sprinter. On July 30, 2021, during the Games, she took it to her Instagram and said bad things about the Belarus Olympic Committee. On August 1, 2021, she was taken to Haneda Airport by the representatives of the Belarusian Olympic team against her will. She was forced into taking a flight in Belarus. She was afraid to come back home and did not want to go to Belarus. She contacted Japanese police in Haneda Airport. Japanese police offered her protection. Then she asked for asylum in Poland. Its embassy in Japan took her in on August 2, 2021. ==International events== Representing 2015 European Junior Championships Eskilstuna, Sweden 6th 100 m 11.85 2015 European Junior Championships Eskilstuna, Sweden 17th (h) 200 m 24.51 2017 European Indoor Championships Belgrade, Serbia 12th (sf) 60 m 7.39 2017 European U23 Championships Bydgoszcz, Poland 2nd 100 m 11.54 2017 European U23 Championships Bydgoszcz, Poland 4th 200 m 23.32 2018 World Indoor Championships Birmingham, United Kingdom 31st (h) 60 m 7.37 2018 European Championships Berlin, Germany 13th (sf) 100 m 11.34 2018 European Championships Berlin, Germany 10th (sf) 200 m 23.03 2019 European Indoor Championships Glasgow, United Kingdom 7th 60 m 7.26 2019 Universiade Naples, Italy 6th 100 m 11.44 2019 Universiade Naples, Italy 1st 200 m 23.00 2019 World Championships Doha, Qatar 26th (h) 200 m 23.22 2019 European Games Minsk, Belarus 2nd team TBC 2021 European Indoor Championships Toruń, Poland – 60 m DQ 2021 2020 Summer Olympics Tokyo, Japan 38th (h) 100 m 11.47 2021 2020 Summer Olympics Tokyo, Japan – 200 m Representing 2023 Polish Indoor Athletics Championships Toruń, Poland 2nd 60 m 7.25 2023 2023 === Personal bests=== Outdoor *100 metres – 11.04 (+0.7 m/s, Minsk 2018) *200 metres – 22.75 (+1,0 m/s Warsaw 2023) Indoor *60 metres – 7.21 (Mogilyov 2017, Minsk 2019, Luxembourg 2024) *200 metres – 23.45 (Toruń 2023) == Personal life == She was married to sprinter Arseniy Zdanevich. He was afraid of getting in trouble over his wife's words and went to Ukraine in August 2021. Krystsina Tsimanouskaya's parents told Krystsina Tsimanouskaya not to return to Belarus. There was information that Belarusian police locked in on them and Krystsina Tsimanouskaya's grandmother. ==References== == Other websites== * * Category:1996 births Category:Living people Category:Competitors at the 2020 Summer Olympics Category:Olympians for Belarus Category:Refugees Category:Sprinters",
 "title": "Krystsina Tsimanouskaya"
}