{
 "id": "860403",
 "text": "In most cases, photography is about taking pictures of objects or scenes that can directly be recognised. This is done as a way to document things, or to do a portrait, for example. Abstract photography focuses on details, or on the way light is used. As a result, the object that is photographed can no longer be recognised easily. An abstract photograph often only shows a part of a natural scene. The viewer no longer has information about the context. That way, it may create a view that looks unreal. Very often color, light, shadow, texture, shape or form are used to give a feeling, sensation or impression. The image may be produced using traditional photographic equipment like a camera, darkroom or computer, or it may be created without using a camera by directly manipulating film, paper or other photographic media, including digital presentations. == Defining abstract photography == There is no common definition of the term \"abstract photography\": different people use it for different concepts. On the one hand, there are people such as Aaron Siskind who photographed peeling paint, on the other, people such as Marco Breuer made prints and books without using a camera or film. The term includes many different kinds of representations; it is used to categorize a type of photography that often ambiguous. Alvin Langdon Coburn was the first to speak about \"abstract photography\": In 1916 proposed that an exhibition should be organized with the title \"Abstract Photography\". The entry form for the exhibition would clearly say that \"no work will be admitted in which the interest of the subject matter is greater than the appreciation of the extraordinary.\" This exhibition did not happen; Coburn later created some distinctly abstract photograph, though. Photographer and Professor of Psychology John Suler wrote an essay Photographic Psychology: Image and Psyche. In this essay, he said that an abstract photograph tookaway that which is realistic or literal, such as natural appearances and recognizable subjects in the actual world. He said there was a test: If you look at a photo and there’s a voice inside you that says 'What is it?'….Well, there you go. It’s an abstract photograph.\" According to Barbara Kasten, who is also a photographer an professor: \"Abstract photography challenges our popular view of photography as an objective image of reality by reasserting its constructed nature....Freed from its duty to represent, abstract photography continues to be a catchall genre for the [mixing] of mediums and disciplines. It is an arena to test photography.\" German photographer and photographic theorist Gottfried Jäger used the term \"concrete photography\" to describe a particular kind of abstract photography. He said:With this, he made a reference to Concrete art, an art movement of the 1930s that strongly focused on geometric forms. More recently conceptual artist Mel Bochner hand wrote a quote from the Encyclopædia Britannica that said \"Photography cannot record abstract ideas.\" on a note card. He then photographed the card and printed it using six different photographic processes. He turned the words, the concept and the visualization of the concept into art itself, and in doing so created a work that presented yet another type of abstract photography, again without ever defining the term itself. === Gallery === File:Anna_Atkins_- _Carix_(America)_-_Google_Art_Project.jpg|Anna Atkins – Carex (America) – Google Art Project File:Josef_H_Neumann-_Gustav_I_(1976).jpg|Josef H. Neumann: Chemogram Gustav I 1976 File:Freischwimmer_26.jpg|Wolfgang Tillmans – Freischwimmer 26, 2003 File:Scene_III,_2012.jpg|Barbara Kasten – Scene III, 2012 == Related pages == *Abstract art == References == == Sources == * * * Karsten, Barbara. Second Nature: Abstract Photography Then and Now. * == Other websites == Category:Photography Category:Art",
 "title": "Abstract photography"
}