{
 "id": "861010",
 "text": "Shazam! Fury of the Gods is a 2023 American superhero movie based on DC Comics. It is a sequel to Shazam! (2019) and the fourteenth movie in the DC Extended Universe (DCEU). It is directed by David F. Sandberg. It stars Zachary Levi, Asher Angel, Jack Dylan Grazer, Djimon Hounsou, Rachel Zegler, Helen Mirren, and Lucy Liu. Shazam! Fury of the Gods released in the United States on March 17, 2023. ==Plot== Two years after Thaddeus Sivana's defeat, Hespera and Kalypso, two of the daughters of the Titan Atlas, break into the Acropolis Museum in Athens, Greece to steal the Wizard's broken staff. The duo then take it to the imprisoned Wizard, forcing him to repair the staff and activate its powers. In Philadelphia, Billy Batson and his \"Shazamily\" of foster siblings save people on the collapsing Benjamin Franklin Bridge, but are called out for its destruction. The group is drifting apart at home due to their growing up and having personal interests. Billy is worried about being kicked out of the Vasquez family after he turns 18 and ages out of the foster system. In a dream, as Shazam, Billy is warned by the Wizard about Hespera and Kalypso — he and the Shazamily research the Daughters. Freddy Freeman, still bullied at school, falls for a new girl named Anne, to whom he shows off his superhero self. Unfortunately, Hespera and Kalypso arrive with the staff and steal Freddy's powers. Anne is revealed to be their youngest sister, Anthea. Billy and the other Shazamily try to save Freddy, but the daughters kidnap him and place a dome around the city, trapping everyone inside. Freddy is imprisoned along with the Wizard in the Gods' Realm. Hespera and Kalypso reveal they want revenge because the Wizard killed their father. Meanwhile, the Shazamily enter the Rock of Eternity, where they encounter a sentient pen named \"Steve,\" which they use to draft a letter to Hespera as a negotiation for Freddy's release. Billy meets Hespera, and, while the meeting is initially cordial, she and Kalypso soon fight the Shazamily. Pedro loses his powers during the fight, while Hespera is captured and returned to the Rock. Hespera easily breaks out and steals the Golden Apple, the seed of the Tree of Life. Meanwhile, Freddy and the Wizard try to escape the Gods' Realm with Anthea's help, just as Hespera returns with the apple. However, the Daughters argue as Hespera and Anthea want to use the Apple to revive their realm, while Kalypso wishes to plant it on Earth to conquer it. Freddy steals the apple but is found out, though Billy and the Shazamily show up, and Freddy reacquires his powers. Billy and the Shazamily emerge with the Wizard in the Vasquez home, where they reveal their secret identities to their foster parents. Kalypso appears with a dragon named Ladon to acquire the Apple. All but Billy lose their powers in the skirmish while Kalypso retrieves the Apple. She intends to plant the Tree on Earth, rather than in the Gods' Realm, planning to terraform the Earth. Kalypso mortally wounds Hespera and depowers Anthea when they object. She later plants the tree at Citizens Bank Park, which spawns monsters that attack the city. Billy, in despair, asks the Wizard to revoke his powers, though the Wizard assures him he is a true hero. Heeding the Wizard's words, Billy turns into Shazam and flies off to stop Kalypso, while the Shazamily enlist the help of unicorns to fend off the monsters in the city. Meanwhile, Shazam persuades a dying Hespera to help him stop Kalypso. Realizing the dome reacts violently to his lightning, Billy lures Kalypso to the Park while Hespera shrinks the dome to contain them. Billy fights Kalypso and Ladon before killing them both by overloading the staff with electricity, destroying the tree and Kalypso's army with them, at the cost of his own life. Anthea brings Billy's grieving family to her kingdom for his funeral as they mourn for him. However, the demigoddess Wonder Woman suddenly appears and repairs the staff, imbuing it with her power before using it to revive the Gods' Realm and resurrect Billy, who happily reunites with his family. Billy then uses the staff to restore all of his siblings' powers. The Shazamily fixes their home while Anthea and the Wizard take up residence on Earth. In a mid-credits scene, Emilia Harcourt and John Economos attempt to recruit Billy on behalf of Amanda Waller to join the Justice Society. In a post-credits scene, an incarcerated Sivana encounters Mister Mind once again and is frustrated that Mister Mind hasn't begun to enacting their plan yet.\\ ==Cast== * Zachary Levi and Asher Angel as Billy Batson / Shazam: The champion of an ancient wizard, who possesses \"the wisdom of Solomon, the strength of Hercules, the stamina of Atlas, the power of Zeus, the courage of Achilles, and the speed of Mercury\" * Jack Dylan Grazer and Adam Brody as Frederick \"Freddy\" Freeman: Billy's physically disabled foster brother, who is a fan of superheroes. Grazer portrays Freddy's regular form, while Brody portrays his adult superhero form. * Rachel Zegler as Anthea / Anne: The youngest daughter of Atlas. *Grace Caroline Currey as Mary Bromfield: Billy's mature and academically-driven older foster sister. Currey also portrays Mary's adult superhero form, replacing Michelle Borth from the first film. * Ross Butler and Ian Chen as Eugene Choi: Billy's younger foster brother who is an obsessive gamer. Butler portrays Eugene's adult superhero form, while Chen portrays his regular form.[ * D. J. Cotrona and Jovan Armand as Pedro Peña: Billy's older foster brother, who is openly gay, shy, and sensitive. Cotrona portrays Pedro's adult superhero form, while Armand portrays his regular form. * Meagan Good and Faithe Herman as Darla Dudley: Billy's good-natured younger foster sister. Good portrays Darla's adult superhero form, while Herman portrays her regular form. * Lucy Liu as Kalypso: The middle daughter of Atlas. * Djimon Hounsou as Shazam: The last surviving member of the Council of Wizards, who bestowed his powers on Billy Batson, after designating the boy as his champion. * Helen Mirren as Hespera: The oldest daughter of Atlas. Billy's foster family also includes Marta Milans and Cooper Andrews as Rosa and Victor Vásquez, the foster parents of Billy and his siblings. Reprising their DCEU roles in the film while uncredited, Gal Gadot appears as Diana Prince / Wonder Woman, alongside Jennifer Holland as Emilia Harcourt and Steve Agee as John Economos in the mid-credits scene, and Mark Strong as Dr. Thaddeus Sivana and director David F. Sandberg as the voice of Mister Mind in the post-credits scene. Sandberg also cameos as a civilian who is attacked by one of Kalypso's monsters. Rizwan Manji, who portrayed Jamil in the DCEU television series , appears as an unnamed docent. P. J. Byrne briefly appears as Dr. Dario Bava, a pediatrician whom Billy confused as a therapist, while Diedrich Bader briefly appears as Mr. Geckle, a school teacher. Sandberg's wife Lotta Losten, who previously portrayed Dr. Lynn Crosby in the first film, cameos as a nurse who is saved by Shazam. Michael Gray, who portrayed Billy Batson in the 1970s television series, makes a brief cameo as a man on the street. Natalia Safran, wife of producer Peter Safran, cameos as a driver with kittens. CNN news anchor Wolf Blitzer makes a cameo appearance as himself. ==References== ==Other websites== * Category:2023 movies Category:2020s movies Category:American superhero movies Category:Warner Bros. movies Category:American comedy movies Category:DC Extended Universe movies",
 "title": "Shazam! Fury of the Gods"
}