{
 "id": "861250",
 "text": "Alice and Ellen Kessler (born 20 August 1936 in Nerchau, Saxony, Germany) are twin entertainers known in Europe, especially Germany and Italy, from the 1950s and 1960s and until today for their singing, dancing, and acting. They are usually credited as the Kessler Twins (Die Kessler-Zwillinge in Germany and Le Gemelle Kessler in Italy), and remain popular today. In the US, they were not as popular but appeared in the 1963 movie Sodom and Gomorrah as dancers and appeared on the cover of Life Magazine in that year. They made their American television debut on 12 February 1963 on the Red Skelton Hour, acting in his comedy sketch and dancing and singing a duet.ctva.biz/US/MusicVariety/RedSkeltonShow_12_(1962-63).htm They also performed on The Ed Sullivan Show. Their parents, Paul and Elsa, sent them to ballet classes at the age of six, and they joined the Leipzig Opera's child ballet program at age 11. When they were 18, their parents used a visitor's visa to escape from East Germany to West Germany, where they performed at the Palladium in Düsseldorf. They performed at Le Lido in Paris between 1955 and 1960, and represented West Germany in the 1959 Eurovision Song Contest, finishing in 8th place with Heute Abend wollen wir tanzen geh'n (Tonight we want to go dancing). They moved to Italy in 1960 and gradually moved to more serious roles. At the age of 40, they agreed to pose on the cover of the Italian edition of Playboy. That issue became the fastest-selling Italian Playboy up until that point. They moved back to Germany in 1986 and currently live in the Munich suburb of Grünwald. They have received two awards from both the German and Italian governments for promoting German-Italian cooperation through their work in show business. == References == == Other websites == * * * Category:1936 births Category:Living people Category:Twin people Category:Sibling musical duos Category:German musical entertainers Category:German pop singers Category:Child singers Category:German movie actors Category:Child actors Category:German models Category:People from Saxony",
 "title": "Kessler Twins"
}