{
 "id": "86166",
 "text": "The Federal Ministry for Economic Affairs and Climate Action (formerly the Federal Ministry of Economics and Technology, ) is a Federal Ministry of the Federal Republic of Germany. It was founded 1949 as the Federal Ministry of the Economy. It was combined in May 1971 with the Federal Ministry of Finance to make the Federal Ministry of Economics and Finance. This joining only lasted until December 1972. In 1998 the technology area of the Ministry of Research and Development was given to the ministry so that it was called Federal Ministry of Economics and Technology. It was joined with the Federal Ministry of Labour and Social Affairs to make the Federal Ministry of Economics and Labour between 2002 and 2005. The new Federal Government of Angela Merkel split the two areas so that there is a Federal Ministry of Economics and Technology again. == History == The ministry has had many names * 1917-1919 - Reichswirtschaftsamt the Reich Economy Office * 1919-1945 - the Reich Ministry of Trade and Commerce * 1946-1949 - the Administration Office for the Economy * 1949-1998 - the Federal Ministry of Economics * 1998-2002 - the Federal Ministry of Economics and Technology * 2002-2005 - the Federal Ministry of Economics and Labour * 2005-2013 - Federal Ministry of Economics and Technology * 2013-2021 - Federal Ministry for Economic Affairs and Energy * since 2021 - Federal Ministry for Economic Affairs and Climate Action == Structure of the ministry == To do its job, the ministry is divided into nine departments, the central division deals with administration, the other divisions deal with a certain area of policy. There are also some independent agencies which report to the ministry === Ministry divisions === * Z - Central division * E - European Affairs * I - Economic policy * II - Middle class policy * III - Energy policy * IV - Industrial policy * V - International Economic policy * VI - Communication and post policy * VII - Technology policy === Authorities === * Federal cartel office - BKartA, Bonn * Federal Office of Economy and Export Control - BAFA, Eschborn, Bochum * Electricity, Gas, Telecommunications, Post and Railways Federal Network Agency - BNetzA, Bonn * Federal Agency for Foreign Trade - bfai, Cologne * Federal Institute of Materials Research and Examination - BAM, Berlin * Physical technological Federal Institute - PTB, Brunswick, Berlin * Federal Institute of Geowissenschaften and raw material - BGR, Hanover, Berlin == Federal Ministers == Economics 1949 to 1998 (1971/72: Federal Ministry of Economics and Finance) # 1949-1963: Ludwig Erhard, independent # 1963-1966: Kurt Schmücker, CDU # 1966-1972: Karl Schiller, SPD # 1972: Helmut Schmidt, SPD # 1972-1977: Hans Friedrichs, FDP # 1977-1982: Otto Graf Lambsdorff, FDP # 1982: Manfred Lahnstein, SPD # 1982-1984: Otto Graf Lambsdorff, FDP # 1984-1988: Martin Bangemann, FDP/DVP # 1988-1991: Helmut Hausmann, FDP/DVP # 1991-1993: Jürgen Möllemann, FDP # 1993-1998: Günter Rexrodt, FDP The ministry had many junior ministers, one who has gone on to a more important political job is Norbert Lammert, CDU, who was parliamentary permanent secretary between 1994 and 1997. Lammert became President of the Bundestag in 2005 Of the ministry's top civil servants, called the \"established permanent secretary\", Klaus von Dohnanyi is best known. He was established permanent secretary in 1968 and 1969. He is a famous economist and was First Mayor of Hamburg Federal Minister for Economy and Technology 1998 to 2002 # 1998-2002: Werner Müller, independent Federal Minister for Economics and Labour 2002 to 2005 # 2002-2005: Wolfgang Clement, SPDIn the second cabinet of the Chancellor Gerhard Schröder the Federal Ministry of Lork and Social Affairs was divided up between the ministries for Economics and Health. The Minister of Trade and Commerce was also Minister of Labour. Federal Minister for Economics and Technology since 2005 # 2005-2009: Michael Glos, CSU # 2009: Karl-Theodor zu Guttenberg, CSU # 2009-2011: Rainer Brüderle, FDP # 2011-2013: Philipp Rösler, FDP Federal Minister for Economic Affairs and Energy, since 2013 # 2013-2017: Sigmar Gabriel, SPD # 2017-2018: Brigitte Zypries, SPD # 2018-2021: Peter Altmaier, CDU # 2021-: Robert Habeck, Grüne ==Headquarters== The main headquarters of the ministry is in Invalidenstraße in Berlin-Mitte. It is number of buildings which used to be the Kaiser Wilhelm academy (armed forces medical school) and the old hospital. The second headquarters of the ministry is the old Gallwitz barracks in Bonn- Duisdorf. ==References== *",
 "title": "Federal Ministry for Economic Affairs and Climate Action"
}