{
 "id": "861873",
 "text": "Michael \"Mick\" Patrick Mulroy is the former US Deputy Assistant Secretary of Defense for the Middle East. He worked in this position from October 2017 until December 2019. He was responsible for representing the United States Department of Defense defense policy and policy in the interagency on the Middle East. He is also a retired CIA Paramilitary Operations Officer and a United States Marine. He co-founded the Lobo Institute, where he started working on a documentary about a child soldier called My Star in the Sky. He also began working in the nonprofit Grassroots Reconciliation Group, became a Special Advisor to the United Nations, a Senior Fellow at the Middle East Institute, and a ABC News National Security Analyst. ==DASD service== The DASD for the Middle East is responsible for the policy of the US Department of Defense and represents the Department of Defense in interagency organizations in many countries. Mulroy was chosen for this position by the former Defense Secretary James Mattis, who was looking for a \"nonpartisan and apolitical individual\" with lots of experience in conflict zones to fill senior policy roles. Mulroy was awarded the Secretary of Defense Medal for Outstanding Public Service for his efforts. In particular, for creating a plan on Yemen, developing a policy on Iran and for helping the White Helmets in Syria. ===National Defense Strategy=== In January 2018, a National Defense Strategy was published, focusing on China, Russia, North Korea, Iran and the fight against terrorism. Mulroy was responsible for the implementation of the NDS in that region, including the conflicts in Syria, Iraq, Egypt and Yemen. ===Irregular Warfare Annex=== In October 2019, Mulroy presented the Irregular Warfare Annex. He said that it was part of the 2018 NDS. According to him, irregular warfare includes counter-insurgency, counter-terrorism, unconventional warfare, foreign internal defense, sabotage and subversion, stabilization (warfare) and information operations, among other areas. ==CIA service== Mulroy is a retired PMOO from the Special Activities Center of the CIA. CIA awards include the Intelligence Star, the Intelligence Commendation Medal, the Career Intelligence Medal and the National Intelligence Exceptional Achievement Medal, among others. He is also a recipient of the State Department's Superior Honor Award. Mulroy is also a godfather to four Gold Star daughters. ==Military service== Mulroy is a retired U.S. Marine and served as a commissioned officer and an enlisted Marine on active duty and in the reserves. He served as an Armored Crewman (United States military occupation code (MOS) 1811) of a M1 Abrams tank, a Judge Advocate (MOS 4412) and an Infantry Officer (MOS 0302). His military awards include the Joint Service Commendation Medal, the Navy and Marine Corps Commendation Medal, the Afghanistan Campaign Medal, the Iraq Campaign Medal, the Global War on Terrorism Expeditionary Medal, among others. ==Other service== Mulroy is part of the Atlantic Council's Counterterrorism Study Group (CTSG), made up of experts in counterterrorism policy and operations. The group studies new counterterrorism trends and recommends ways to improve current strategies. ==Afghanistan== Mulroy opposed the decision to pull all U.S. military forces out of Afghanistan. He believed the U.S. should have kept a residual force that could have maintained what the coalition fought for over two decades. Mulroy was a member of the volunteer group called TF Dunkirk. A group established to help former Afghan soldiers that worked with the US to leave Afghanistan and resettle in the U.S. ==Ukraine== Mulroy believes that \"we need to support the opposing side to the invasion and occupation in every possible way\" and advocated the provision of military assistance to the Ukrainians. Mulroy advocated isolating Russia both economically and diplomatically. Mulroy also advocated bringing all those responsible for war crimes to an international tribunal or criminal court. ==Gaza== Mulroy was part of a group called Fogbow that helped create a sea route to bring humanitarian aid to Gaza in March 2024. ==Advocacy for child soldiers== === My Star in the Sky === Mulroy along with Eric Oehlerich made a documentary My Star in the Sky. It tells the story of survival, friendship and love between two child soldiers. This documentary has been screened at Yale University's Jackson Institute for Global Affairs, the Atlantic Council, the Enough Project, Georgetown University's Institute for the Study of Diplomacy and the Truman National Security Project. ===The Grassroots Reconciliation Group=== Mulroy is on the Board of Directors for the Grassroots Reconciliation Group (GRG). GRG was initiated as part of a USAID-funded program called the Northern Uganda Peace Initiative (NUPI) to reconcile and rehabilitate former child soldiers of Joseph Kony's LRA. After USAID's contract with NUPI ended, co-founders Sasha Lezhnev and Kasper Agger continued helping these communities as a self-funded effort. Since 2007, GRG has worked with 38 groups and reached 2,200 people directly, and impacted more than 5000 indirectly. ===Comments on the subject=== In an ABC News article, Mulroy said the US should do more to stop countries, even allies, from using child soldiers. He thinks the Biden administration should use the Global Magnitsky Act to punish corrupt officials and companies backing armed groups that recruit kids. Mulroy stresses the importance of targeting both officials and companies supporting militias, not just their leaders who may not have foreign assets. ==Philosophy== Mulroy is a proponent of Stoic philosophy. In an essay in Modern Stoicism entitled, “A Case for the Philosopher King,” he pushed for a return of virtue ethics in school and teaching examples of those to look up to Marcus Aurelius, Harriet Tubman, Christina Noble, James Stockdale, John Lewis, Malala Yousafzai among others. He did this after citing the precipitous decline in the confidence Americans have in one another. In an article for ABC News, “Where philosophy intersects with war training: stoic soldiers,” he and Donald Robertson advocated for using stoicism as a philosophy in the military due to its focus on wisdom, justice, temperance, and courage. He advocated for the U.S. military to incorporate stoicism into its basic training at a conference hosted by the U.S. Army National Guard in January 2021 and in a conference hosted by Modern Stoicism as one of the keynote speakers, along with retired National Security Advisor H.R. McMaster and Georgetown University Professor Nancy Sherman. Mulroy is also a member of the board of advisors for Plato's Academy in Athens, Greece. ==Other volunteer efforts== Mulroy serves on the board of advisors and/or directors of several non-profit organizations. These charities include Sound Off, Team America Relief, and FamilUSA. ==References== ==Other websites== * Lobo Institute * Publications Category:Living people Category:Year of birth missing (living people) Category:United States Department of Defense officials",
 "title": "Michael Patrick Mulroy"
}