{
 "id": "861964",
 "text": "Espera DeCorti or Oscar DeCorti or Iron Eyes Cody (April 3, 1907 – January 4, 1999) was a Sicilian - American actor. He played Native American characters even though he was white. In real life, he told people that he was Native American. He was in more than 100 movies, many television shows, and the famous \"Crying Indian\" advertisement. ==Early life== Cody was born April 3, 1907 in Kaplan, Louisiana. His parents, Antonio de Corti and Francesca Selpietra, were both from Sicily in Italy. Cody and his two of his brothers, Joseph William Corti and Frank Henry Corti, went with their father to Texas and then California. Joseph William and Frank worked as actors for a while and then stopped acting. Cody's mother remarried a man called Alton Abshire and had five more children. ==Career and claims== He changed his name to Cody early. Sometimes he told people he had been born in the Oklahoma territory. Other times he said he was born in other places. He said his father was Cherokee and called \"Francis Long Plume.\" He said his mother was Cree and called \"Frances Salpet.\" He said his name had been \"Little Eagle.\" He began acting in movies in the 1930s. He was in more than 100 movies, for example A Man Called Horse, Sitting Bull, and Paleface. He was on television on Bonanza, Gunsmoke, and Rawhide. He sometimes acted with Colleen Moore, John Wayne, Richard Harris, and Steve McQueen. So many people believed he really was Native American that they paid him to be a consultant when they made movies or television shows. In the 1950s, Cody and his wife had a television show where they talked about Native American history and other parts of the culture. In 1996, a news writer from the New Orleans Times Picayune went to Louisiana and found out he was really an Italian American. He talked to Cody's half sister, May Abshire. Abshire showed the papers showing Cody had been baptized, which is a Christian blessing ceremony. He printed the story, but not everyone believed it. Cody said he was Native American all his life. ==Crying Indian ad== In the Crying Indian ad, Cody, dressed as a Native American, paddles a canoe through a stream. At first, the stream is clean and pretty but it becomes dirtier and full of garbage. He gets out of the stream and walks to a highway, where people throw garbage out of their cars. Then he slowly cries one tear. A voice says, \"Some people have a deep, abiding respect for the natural beauty that was once this country. And some people don't. ... People start pollution. People can stop it.\" The ad was on television starting in 1971. The group Keep America Beautiful paid for and made the ad. It was about littering. The ad won many awards, for example two Clio Awards. Television stations played it so much that their copies of the film wore out and they had to get new ones. Keep America Beautiful was run by packaging and drink companies. They tried to stop the government from passing laws that would be good for the environment. For example, they wanted to stop laws that would make them sell drinks in reusable bottles. Throwaway bottles were cheaper. So a law would be good for the environment but bad for the company. Keep American Beautiful wanted people to look at the ad and think individual people made pollution and not that big companies made pollution. Trent University history professor Finis Dunaway says that the man in the Crying Indian ad \"appears completely powerless. In the commercial, all he can do is lament the land his people lost,\" when, at the same time, real-life American Indians were working to solve their problems. Another Crying Indian ad was on television in 1975. In 1998, the first one was on television again. ==Marriage and children== Cody married a Native American archaeologist called Bertha \"Birdie\" Parker. They adopted two Native American sons named Robert and Arthur. Cody lived his private life and raised his children as if they were all Native American. He wore moccasins and other Native American clothes in public. ==Beliefs== According to his friends and family, Cody did believe that protecting the environment was very important. He worked to show Native Americans well in television and movies. He worked for Native American causes. ==Legacy== Not all Native Americans agree about whether Cody was good or bad or how far. The Hollywood Native community honored Cody because he represented them in movies and on television and fought bad ideas about American Indians. They said at the time that he was not Native American himself. ==Death== Cody age 91 died January 4, 1999 in his house in Los Angeles. ==References== ==Other websites== *IMDB Category:1907 births Category:1999 deaths Category:Actors from Louisiana",
 "title": "Iron Eyes Cody"
}