{
 "id": "861993",
 "text": "Othello syndrome is a psychological condition, where a person thinks that their partner is unfaithful, but does not have any proof for this behaviour. It is also known as pathological jealousy, morbid jealousy or delusional jealousy. The person will also behave in ways that are socially unacceptable or abnormal, but which are related to these thoughts. The most common form is characterized by delusions and obsessions. It is considered a subtype of delusional disorder. As people are obsessed by the idea that their partner is unfaithful, they want to investigate and maintain their partner's fidelity, even if this causes big problems for themselves, and their partner. == Definition == This disorder occurs when a person accuses their partner of being unfaithful, even if there is little or no evidence for this. Very often people will use seemingly normal or everyday events or material to show this. Unlike with other forms of delusion, people suffering from Othello syndrome, often stalk their partners, or they become violent. The condition can be found together with schizophrenia and a delusional disorder, such as bipolar disorder. It is associated with alcoholism and sexual dysfunction and has been reported after neurological illness (i.e. Parkinson's). The name \"Othello Syndrome\" comes from the character in Shakespeare's play Othello, who murders his wife as a result of a false belief that she has been unfaithful. Recently, some psychologists and psychiatrists have asserted that Othello was deceived rather than deluded about Desdemona's alleged infidelity and thus did not have ‘the Othello Syndrome’. == Triggers == For men the strongest trigger is sexual infidelity and with women the strongest trigger is emotional infidelity. The last thing to do to stop infidelity inside of morbid jealousy is to kill their partner. Women are much less likely to do this, unless they act in self- defense. Morbid jealousy can occur together with other conditions such as chronic alcoholism, addiction to other drugs (i.e. cocaine, amphetamines, marijuana.), organic brain disorders (i.e. Parkinson's, Huntington's), schizophrenia, neurosis, affective disturbances or personality disorders.Morbid Jealousy: The Green Eyed Monster. http://www.ijpm.org/Mod5.pdf == Risks associated == === Harm to self === People with this condition often think about killing themselves. This is also because Othello syndrome is often associated with depression and drug addiction. == Related pages == * Envy * Isolation for the purpose of abuse * Martha Mitchell effect == References == == Sources == * Enoch, D. & Ball, H. (2001) The Othello Syndrome. In Enoch, D. & Ball, H. Uncommon psychiatric syndromes (fourth edition) pp50–73. London: Arnold. ISBN 0-340-76388-4 * * Category:Mental illnesses",
 "title": "Othello syndrome"
}