{
 "id": "861997",
 "text": "The Martha Mitchell effect is the name for a false diagnosis, where a medical professional falsely labels a patient's perception of real events as a delusion.Coleman, A. (2015). A Dictionary of Psychology. p441.Alexander, G. J. (1996). International Human Rights Protection Against Psychiatric Political Abuses. Santa Clara L. Rev., 37, 387. Martha Mitchell (1918-1976) was the wife of John Mitchell, United States Attorney General in the Nixon administration. When she said that White House officials were involved in illegal activities, her claims were attributed to mental illness. In the end, the facts of the Watergate scandal proved her statements to be true. Because of what she had told, Martha Mitchell became known as \"The Cassandra of Watergate\". == Background == When Martha married her second husband, John, in 1957, he was working as an attorney in New York City. Mitchell met Nixon in New York. Later, Richard Nixon was elected president. As Mitchell was an important person, and employee of Nixon, the Mitchells moved to Washington, D.C. During the election campaign 1972, the police arrested five burglars who had tried to install surveillance equipment in the Watergate office of the Democrats. One of the arrested people told the police that John Mitchell and John Dean had paid them to do this. At first, Nixon could still act like he was innocent, but John N. Mitchell found this more and more difficult. His wife often called newspaper reporters at odd hours. She often called from the bathroom, so her husband wouldn't hear. Very often, her speech seemed slurred, as if she had been intoxicated by alcohol. For this reason, people didn't believe her. Only when she called Helen Thomas, and told her, that since her husband had known about the burglars, Nixon must also know, did people believe her. Martha Mitchell said that Nixon should resign. There were other calls, where she again seemed to be drugged, and difficult to understand. She said she thought there was a conspiracy, which involved President Nixon. To hide this conspiracy, Nixon would use her husband as a scapegoat. Later it turned out that Nixon had ordered the burglary, and was also responsible for other actions. This provoked a scandal, which is known as the Watergate scandal today. It also confirmed the suspicion of Martha Mitchell, which many had not believed before, and showed that Mitchell was not insane. Many of her allegations remain unproven, such as her claim that she had been drugged and put under guard during a visit to California after her husband was summoned back to Washington, D.C.. This was done to prevent her from leaving the hotel or making phone calls to the news media.Reeves, Richard President Nixon: Alone in the White House, p. 511 Despite this, James McCord confirmed in 1975 that her story was true, as reported in The New York Times. More evidence supporting Mitchell's claims was published in a 2017 news article in Newsweek about the appointment of a U.S. ambassador. In 2022, Netflix released a documentary titled The Martha Mitchell Effect. == Description of the effect == In general, what the patient reports is seen as a delusion, because it is thought to be improbable. People with paranoia think they are being followed. People with a delusion have strange beliefs, that are difficult to explain. No one believed Martha Mitchell, so she was diagnosed both with paranoia, and said to be delusional. Both paranoia, and delusion are mentall illnesses. So, Martha Mitchell was seen as having the symptoms of a mental illness. Other examples of such situations include: * Being pursued by organized criminals * Surveillance by law enforcement officers * Infidelity by a spouse Quoting psychotherapist Joseph Berke, the authors report that, \"even paranoids have enemies\". Delusions are \"abnormal beliefs\" and may be bizarre (considered impossible to be true), or non-bizarre (possible, but considered by the clinician as highly improbable). Beliefs about being poisoned, followed, having an unfaithful partner or a conspiracy in the workplace are examples of non-bizarre beliefs that may be considered delusions. Any patient can be misdiagnosed by clinicians, especially patients with a history of paranoid delusions. == Related pages == * Argument from ignorance – Logical fallacy that, since proposition has not yet been proven false, it must be true * Cassandra – Metaphor originating from Greek mythology * False memory – Psychological phenomenon * Gaslighting – Form of psychological abuse * Psychosis – Condition of the mind that involves a loss of contact with reality * Rosenhan experiment – Experiment to determine the validity of psychiatric diagnosis * Rosemary's Baby == References == Category:Mental illnesses Category:Watergate scandal",
 "title": "Martha Mitchell effect"
}