{
 "id": "862060",
 "text": "Generation Alpha (Gen Alpha for short) are the demographic group coming after Generation Z. According to researchers and popular media sources, Gen Alpha starts as early as 2010 and ends in 2024 or 2025. Several sources specify 2013 as the start date and an ending year of 2028. This generation was named after the first letter in the Greek alphabet. Most members of Generation Alpha are children of Millennials. ==Conception== The name Generation Alpha was created after a 2008 survey done by the Australian consulting agency McCrindle Research. Agency founder Mark McCrindle is generally credited with the term. McCrindle describes how his team arrived at the name in a 2015 interview: > When I was researching my book The ABC of XYZ: Understanding the Global > Generations (published in 2009) it became apparent that a new generation was > about to commence and there was no name for them. So I conducted a survey > (we're researchers after all) to find out what people think the generation > after Z should be called and while many names emerged, and Generation A was > the most mentioned, Generation Alpha got some mentions too and so I settled > on that for the title of the chapter Beyond Z: Meet Generation Alpha. It > just made sense as it is in keeping with scientific nomenclature of using > the Greek alphabet in lieu of the Latin and it didn't make sense to go back > to A, after all they are the first generation wholly born in the 21st > Century and so they are the start of something new not a return to the old. > Quote is an outtake from the New York Times story. McCrindle Research was also inspired by the naming of hurricanes, especially the 2005 Atlantic hurricane season. In that year, six Atlantic storms were named after the first 6 Greek letters. As one of the biggest periods for Gen Alpha was the COVID-19 pandemic, many people have suggested the name Generation Covid (Gen C) for people born during or growing up while it was happening. Another name proposal, after a new revolution of Artificial intelligence, is \"Generation AI\". ==Demographics== ===Global trends=== Generation Alpha was expected to come to just over two billion people by 2025. Almost three-quarters of all people lived in Asia or Africa. Nations across Europe, North and South America don't have enough children to replace themselves. When 2018 officially ended, the population of age sixty-five and older exceeded that of between ages zero through four. As of then, there were almost 705 million people age 65 and older. At that same time, those between ages zero and four were at almost 680 million. Some reports also stated there were too many middle aged and elderly people without enough babies with whom the adults can be replaced. When people in several places do have children, however, they tend having fewer of them and at far older ages. These areas include Australia, South Korea and the United States. These said countries often have lower fertility rates. In 2019, it was reported that in almost three decades from then the number of people in Russia would go down from the 143 million to just below 132 million. That would equal just over 11 million less than that of 2018 and 2019. As of then (2019), quality of life for Japan was above average. In the country many people lived to or past age eighty- four. Its under age five population was just over 3.85% then. ==Use of media technology== Most members of Generation Alpha are growing up using smartphones and tablet computers for their childhood entertainment. Many are exposed to such devices as soothing distractions or educational aids. Screen time with babies, toddlers and preschoolers became far more popular in the mid 2010s. Being born in environments where the use of electronic devices is everywhere, however, has its own challenges. These problems include although are not limited to cyberbullying and inappropriate materials. ===Parental Internet usage=== Generation Alpha are also being surrounded with adult Internet use starting shortly after their lives begin. The parents of Generation Alpha, mostly Millennials, are very heavy social media users. ==References== Alpha",
 "title": "Generation Alpha"
}