{
 "id": "862179",
 "text": "One City, Nine Towns (German: one city, nine places) is an initiative of the city government of Shanghai in 2001. The aim of the project was to find ten attractive suburb settlements to counteract the housing shortage. == Planned cities == The nine cities are spread across the Shanghai metropolitan area and have individual western themes. None of the nine cities were designed by Chinese architects. topic local community district Remarks Zhujiajiao Qingpu Anting German Town Jiading Planned by Albert Speer & Partner, Frankfurt (Albert Speer junior) Ecology Lingang Pudong Songjiang New City Songjiang Thames Town is part of the Garden City Pujiang Minhang Gaoqiao Holland Village Pudong Planned by Atelier Dutch, Almere and Kuiper Compagnons, Rotterdam http://www.bauwelt.de/themen/bauten/Satellitenstaedte-2154968.html http://www.newtowninstitute.org/ pdf / Work_In_Progress_2008-2011.pdf Fengjing Jinshan abandoned Planned by Corban and Goode, Toronto Luodian North European New Town Baoshan The artificial Meilansee is a replica of the Mälaren. Planned by SWECO, Stockholm Fengcheng Fengxian == Development == The planning for the pilot project began in 2001 and was largely completed in 2007. From 2011, of the nine planned cities, in particular Anting as ghost town repeatedly hit the headlines, especially in Germany and English media. Anting German Town - China's German ghost town. Spiegel-Online from October 7, 2011. accessed on November 28, 2017. Dennis Deng: Shanghai-One-City-Nine-Towns travel report: Shanghai: \"One City, Nine Towns\" - China, Shanghai - GEO travel community In: geo.de , May 2011, accessed on 29. November 2017. Anting, around 34 kilometers west of the center of Shanghai, is, among other things, the location of the German-Chinese Joint Venture s Shanghai Volkswagen and one of the centers of the Chinese automotive industry. The district `` Anting German Town has a living space capacity for 25,000 people. By contrast, the number of inhabitants is said to have risen to just 7,000 by 2014. The main causes were the location, accessibility and high property prices. The German ghost town. FAZ of January 2, 2014. Retrieved on November 28, 2017. For a condominium in Anting German Town in 2010 about 13,000 Renminbi per square meter had to be paid, which corresponded to about 1,600 euros. However, the price per square meter in the inner ring of Shanghai was already up to 30,000 Renminbi at that time, and even higher in the direct center. Ulrich Jürgens, Martin Krzywdzinski: New Working Worlds. Campus Verlag, 2016, p. 97. As of 2012, the Shanghai city government provided the necessary funds to expand the infrastructure. The Shanghai subway line 11 has been in Anting since October 2014, followed by schools and kindergartens. At the same time, enormous increases in house prices have been driving people since 2015 ==References== Category:2001 in Asia",
 "title": "One City, Nine Towns"
}