{
 "id": "862261",
 "text": "The Crying Indian ad was a public service announcement that was on television starting in 1971. A group called Keep America Beautiful made the ad. It showed an actor in Native American attire crying when he saw people throw garbage out of their cars. ==Keep America Beautiful== In 1953, the American Can Company and Owens-Illinois Glass Company and other companies started Keep America Beautiful. Later, Owens-Illinois would own Dixie Cup Company. Television stations played it so much that their copies of the film wore out and they had to get new ones. The Advertising Council helped make ads for Keep America Beautiful. The Advertising Council had already made Smoky the Bear for the U.S. Forest Service. Smokey the Bear tells people \"Only You Can Prevent Forest Fires\". The Council decided their ad for Keep America Beautiful should be like the Smokey the Bear ads: It should tell people that their own choices solve problems. ==Earlier ideas== Before the Crying Indian ad, Keep America Beautiful used a character called \"Susan Spotless\". This was a young white girl in a white dress who shook her finger at adults who littered and told them to stop: \"Daddy, you forgot . . . every litter bit hurts!\" (In American English, some children say \"litter\" with an R sound when they mean \"little\".) The idea was that parents should be ashamed to teach their children to litter. In the late 1960s and early 1970s, the idea that the environment must be protected became strong in America. Many of the protesters just before the first Earth Day talked about throwaway containers. For example, students from the University of Michigan put a big pile of empty drink containers on the ground outside the offices of the National Soft Drink Association. The hippies of the 1960s liked the idea of Native Americans. In 1967, Life wrote that hippies saw \"the dispossessed Indian as America’s original dropout, and convinced that he has deeper spiritual values than the rest of society, hippies have taken to wearing his costume and horning in on his customs\", meaning that hippies wanted to copy American Indians. ==Goals== The companies behind Keep America Beautiful did not want the government to pass laws that would cost them money. For example, they wanted to stop laws that would make them sell drinks in reusable bottles. Throwaway bottles were cheaper. Keep American Beautiful wanted voters to look at the ad and think people made pollution one person at a time. Keep America Beautiful did not want people to think that big companies made pollution. The Ad Council started by talking about litter as something ugly and poor citizenship. They said that people who littered were thoughtless and careless and made the world ugly for other people. The Keep America Beautiful media fact sheet read that littering ruined: \"... pleasure and recreation from their beautiful outdoors. ... enjoyment of the natural and man- made attractions of our grand landscape is everywhere marred by the litter which careless people leave in their wake. ... The mountain of refuse keeps growing.\" They also said that litter cost money to clean up and could be bad for health. The Ad Council wanted to show three ideas: *Show litter and pollution as if they were the same thing *Show that littering was a choice made by individual people and not by big companies *Show that all people were equally guilty ==Crying Indian ad== In the Crying Indian ad, an actor called Iron Eyes Cody, dressed as a Native American, paddles a canoe through a stream. At first, the stream is clean and pretty, but it becomes dirtier and full of garbage. He gets out of the stream and walks to a highway, where people throw garbage out of their cars. Then he slowly cries one tear. The tear is made of a drop of glycerin on the actor's face. A voice says: \"Some people have a deep, abiding respect for the natural beauty that was once this country. And some people don't. ... People start pollution. People can stop it.\" The ad was on television starting in 1971. The group Keep America Beautiful paid for and made the ad. It was about littering. The ad won many awards, including two Clio Awards. Television stations played it so much that their copies of the film wore out and they had to get new ones. Keep America Beautiful was backed by major packaging and drink manufacturers. They fought against legislation that would pressure them into adopting more environmentally friendly business practices, such as proposed measures that would have forced them to sell their drinks in reusable containers. Manufacturing throwaway bottles was better for the bottom line of these companies, due to them being cheaper to produce. Keep America Beautiful wanted people who viewed the ad to think that individual people were responsible for pollution, not large corporations. Another Crying Indian ad was on television in 1975. In 1998, the first one was on television again. ==Image of Native Americans== Trent University history professor Finis Dunaway says that the man in the Crying Indian ad \"appears completely powerless. In the commercial, all he can do is lament the land his people lost,\" when, at the same time, real-life American Indians were working to solve their problems. At the same time the ad went on TV, groups of Native Americans had taken over Alcatraz. ==Actor== Iron Eyes Cody was an actor who played Native Americans on television and in movies. He had already been in many movies and TV shows before the Crying Indian ad. ==References== Category:Advertising Category:Environment Category:Waste management",
 "title": "Crying Indian public service announcement"
}