{
 "id": "862820",
 "text": "Raa Raa the Noisy Lion is a British stop motion animated children's television programme first broadcast on 2 May 2011, which is shown on CBeebies. It features a group of animal-based characters and their adventures and activities through the Jingly Jangly Jungle. The show is narrated by Lorraine Kelly and produced by Chapman Entertainment (series one and two) and DreamWorks Animation Television (series three and four). ==Characters== *Raa Raa (voiced by Bradley Shedden in series one and two, Tyler Coleman in series three): A fun-loving and noisy little lion. *Topsy (voiced by Eden Jarrett): A giraffe who loves to read and the tallest and oldest friend ever. She sometimes can be bossy, but it is only because she wants to help her friends as best as she can. *Zebby (voiced by Mia Hann): A kind and gentle zebra who sometimes gets hungry. *Hufty (voiced by Oliver Dillon): An elephant who loves music and giving his friends a ride on his train. *Ooo Ooo (voiced by Jamie Oram): A monkey who is fun and likes to swing on vines. *Crocky (voiced by Max Miller): A crocodile who likes to hang out by the river and ride in his log boat. *Pia (voiced by Hayden Hunter): A parrot who likes to fly high in the air. She debuted in series three. *Scuttle: A purple spider who has eight legs. She debuted in series three. *Stripy (voiced by Billy Jenkins): A striped orange tiger. He debuted in series four. *Slowly (voiced by Brian Cloppes): A green nicely turtle. who walks slow she debuted in series five. *Narrator (voiced by unknown) ==Episodes== ===Series overview=== ===Pilot (2009)=== # Episode Name Original Air Date 0 Rah Rah! ===Series 1 (2011)=== # Episode Name Original Air Date 1 A Time to be Quiet, A Time to be Loud 2 The Right Sound 3 Huffty Loses His Voice 4 Raa Raa Finds a Voice 5 Zebby’s Snack Time 6 Finding Noisy 7 Ooo Ooo’s Jungle Drums 8 Topsy’s Musical Stones 9 Raa Raa’s Noisy Present 10 Raa Raa’s Big Roar 11 Scritch Scratch 12 Hurry Up Raa Raa 13 Rumble in the Jungle 14 Raa Raa’s Favourite Noise 15 Ooo Ooo Slips Up 16 No Sleep Til Bedtime 17 Raa Raa’s Rainy Day 18 Two’s Company 19 Lots of Raa’s in the Jungle 20 Raa Raa’s Favourite Things 21 Jungle Jiggles 22 Raa Raa's Great Big Noise 23 Raa Raa's Naptime Story 24 Go Bananas 25 Clangy Bangy Crocky 26 Raa Raa's New Noise ===Series 2 (2012)=== # Episode Name Original Air Date 27 Crocky's Wobbly Tooth 28 Littlest Laugh 29 Hide and Toot 30 Boing Boing 31 Catch Me If You Can 32 Raa Raa's Whistle Worries 33 Raa Raa Gets Hiccups 34 Ooo Ooo's Wriggly Jiggly Game 35 Raa Raa's Perfect Present 36 Raa Raa the Copycat 37 The Monkey That Roared 38 Something New 39 Raa Raa's Big Book of Noises 40 Doctor Raa Raa 41 Raa Raa's Noisy Challenge 42 Catch That Page 43 Raa Raa Gets Squeaky 44 Wake Up Huffty 45 Gone Fishing 46 The Lion’s Share 47 Raa Raa's New Game 48 Raa Raa Can Do It 49 Crocky's Coconut 50 Kings and Queens of the Jungle 51 Raa Raa Goes Hunting 52 The Noisiest House in the Jungle ===Series 3 (2017)=== # Episode Name Original Air Date 53 Raa Raa and Boomy Thunder 54 Raa Raa and the Rainy Stick 55 Raa Raa and the Junglephone 56 Raa Raa and the Zippy Zip Wire 57 Raa Raa and the Noisy Story 58 Raa Raa and the Jingly Jangly Jungle Band 59 Raa Raa and the Banana Balloons 60 Raa Raa and Crocky's Lost Toy 61 Raa Raa and Hooting Huffty 62 Raa Raa and the Jungle Lookout 63 Raa Raa and the Noisy Mystery 64 Raa Raa and the Coolest Hello 65 Raa Raa and the Bell Flowers 66 Raa Raa and the Funniest Laugh 67 Raa Raa and the Ladybird Den 68 Raa Raa and the Speedy Racers 69 Raa Raa and the Jungle Fixers 70 Raa Raa and the Jingly Jungle Show 71 Raa Raa and the Jungle Gym 72 Raa Raa and the Drip Drop Waterfall 73 Raa Raa and the Noisy Nap 74 Raa Raa and the Jungle Journey 75 Raa Raa and Poorly Pia 76 Raa Raa Goes Clickety Clack 77 Raa Raa and the Night Noises 78 Raa Raa Plays Do What I Do ===Series 4 (2019)=== # Episode Name Original Air Date 79 Raa Raa and a Silly Game 80 Raa Raa Says Everything 81 Raa Raa's Awesome Terrific Games 82 Raa Raa and the Best Bin 83 Raa Raa and the Banana Eaters 84 Raa Raa and the Tink Tonk Noise 85 Raa Raa and the Animals Playtime 86 Raa Raa and the Lost Noise 87 Raa Raa and the New Musical Stones 88 Raa Raa and Opposites Game 89 Raa Raa and the Noise of Animals 90 Raa Raa and a Wonderful Present 91 Raa Raa Plays La La La 92 Raa Raa's Newer Noise 93 Raa Raa and the Tongue-sticking Challenge 94 Raa Raa and the Talking Spout 95 Raa Raa and the Special Noise 96 Raa Raa and Funny Sounds 97 Raa Raa and Fun Noises 98 Raa Raa and New Sounds 99 Raa Raa and the Funny Sound 100 Raa Raa and a Great Animal Sound 101 Welcome Back to Raa Raa 102 Raa Raa Is Loudly 103 A Little Lion Like Raa Raa 104 Raa Raa's Jigsaw 105 Raa Raa's Great Visit 106 Raa Raa Kicks Off 107 Adventure with Raa Raa 108 Raa Raa in the Weekend ===Series 5 (2022)=== A Series Five was Announced for same time for channel. ==References== ==Other websites== * * Official website (archived) * Category:2011 British television series debuts Category:2018 British television series endings Category:British animated television series Category:British children's television series Category:BBC Television programmes Category:CBeebies",
 "title": "Raa Raa the Noisy Lion"
}