{
 "id": "862801",
 "text": "Pha That Luang () (Romanization: Pa Tata Luanga) is a buddhist temple in Vientiane, Laos. It is the most popular Buddhist temple in Laos. == History == Buddhist missionaries from the Mauryan Empire are believed to have been sent by the Emperor Ashoka, including Bury Chan or Praya Chanthabury Pasithisak and five Arahata monks who brought a holy relic (believed to be the breastbone) of Lord Buddha to the stupa in the 3rd century BC. It was rebuilt in the 13th century as a Khmer temple which fell into ruin. In the mid-16th century, King Setthathirat relocated his capital from Luang Prabang to Vientiane and ordered the construction of Pha That Luang in 1566. It was rebuilt about 4 km from the centre of Vientiane at the end of Pha That Luang Road and named Pha That Luang. The bases had a length of 69 metres each and was 45 metres high, and was surrounded by 30 small Stupas. In 1641, a Dutch envoy of the Dutch East India Company, Gerrit van Wuysthoff, visited Vientiane and was received by King Sourigna Vongsa at the temple, where he was, reportedly, received in a magnificent ceremony. He wrote that he was particularly impressed by the \"enormous pyramid and the top was covered with gold leaf weighing about a thousand pounds\".[4] However, the stupa was repeatedly plundered by the Burmese, Siamese and Chinese. Pha That Luang was destroyed by the Thai invasion in 1828, which left it heavily damaged and abandoned. It was not until 1900 that the French restored to its original design based on the detailed drawings from 1867 by the French architect and explorer Louis Delaporte. However the first attempt to restore it was unsuccessful and it had to be redesigned and then reconstructed in the 1930s.[3] During the Franco- Thai War, Pha That Luang was heavily damaged during a Thai air raid. After the end of World War II, the Pha That Luang was reconstructed. == Architecture == The architecture of the building includes many references to Lao culture and identity, and so has become a symbol of Lao nationalism. The first level is 223 feet (67 metres) by 226 feet (68 metres); the second is 157 feet (47 metres) along each side; and the third level is 98 feet (29 metres) along each side. From ground to pinnacle, the Pha That Luang is 147.6 feet (44 metres) high. Only the pinnacle is covered in real gold, the remainder of the stupa is painted a gold color. The area around Pha That Luang is now gated, to keep traffic out. Previously visitors could drive around the whole complex. The encircling walls are roughly 279 feet (85 metres) long on each side and contain a large number of Lao and Khmer sculptures including one of Jayavarman VII. == Gallery == King Jayavarman VII of the Khmer empire The naga of Pha That Luang Pha That Luang The stupa of Pha That Luang The stupa of Pha That Luang (inside the temple) Category:Buddhist temples Category:Religious buildings and structures in Asia Category:Vientiane Category:16th-century buildings and structures",
 "title": "Pha That Luang"
}