{
 "id": "86318",
 "text": "Adele Laurie Blue Adkins (born 5 May 1988) is an English singer, songwriter, musician and multi-instrumentalist. In 2023, she appeared at number 22 on the Rolling Stone magazine's \"200 best singers of all time\" list. ==Early life== Adele Laurie Blue Adkins was born on 5 May 1988, at North Middlesex University Hospital in Tottenham, London. She is the daughter of a Welshman named Mark Evans and Penny Adkins. She has a half-brother called Cameron. She lived with her father and she started singing from the age of four. She graduated from The BRIT School in Croydon in May 2006. In July 2006, Adele published two songs in the fourth issue of online arts magazine PlatformsMagazine.com. After graduation, Adele began to play small shows at venues all over Britain. She has also toured with best friend Jack Peñate, as well as Jamie T, Raul Midon, Devendra Banhart, Amos Lee and Keren Ann since summer 2006. Adele went on her first UK headlining tour in October 2007. ==Career== Adele's first single released was \"Hometown Glory\". On it, she sings about Tottenham. The single was released on 22 October 2007 on Jamie T's label Pacemaker Recordings. It is a limited edition 7\" vinyl with B-side \"Best for Last\". She has since signed to independent music label XL Recordings. In January 2008, she released her second single \"Chasing Pavements\". Adele has become quite popular on MySpace. She is following the example of fellow Londoner Lily Allen by using the web as a mediafocus and a place to see what people think of her songs. Adele performed Daydreamer on BBC2's Later With Jools Holland, alongside Paul McCartney and Björk. She was next on BBC1's Friday Night with Jonathan Ross on 7 December 2007, singing Chasing Pavements. On 10 December 2007, Adele was awarded with the first BRIT Awards Critics’ Choice prize. She has been called the \"new Amy Winehouse\". In January 2008, she was voted winner in the annual BBC 6 Music poll of industry experts Sound of 2008, for acts to emerge in the coming year. On 28 January 2008, she released her first album, 19, named after her age at the time it was made. In 2011 Adele released her second album, 21, named after her age at the time it was made, just like 19. It was number one in more than 26 countries. It became the biggest selling album of the 21st century. In 2013 she won an Academy Award and Golden Globe Award for Best Original Song and the Brit Award for Best British Single for the title track for the James Bond movie Skyfall. The song also won the award for Best Song Written for Visual Media at the Grammy Awards. Her third studio album, 25, was released on 20 November 2015 and debuted at number one all around the world. The music video for the lead single \"Hello\", which also debuted at number one in many countries, broke the record for the shortest amount of time for a YouTube video to reach one billion views. The song was also certified 4× Platinum by the Recording Industry Association of America faster than any other song in history. To date, it has been certified 7× Platinum by the RIAA. Adele returned to music in October 2021 and announced her fourth album, 30 and the single \"Easy on Me\", which was released on 15 October 2021, and was her first single after five years. The album was released on 19 November 2021. ==Personal life== In 2011, Adele entered into a relationship with Simon Konecki, a charity entrepreneur. Their son, Angelo, was born on 19 October 2012. Adele and Konecki married secretly in 2018, but Adele left him later that year. She filed for divorce in September 2019, and it was finalized in March 2021. She clarified that she and Konecki were still on good terms. \"Neither of us did anything wrong,\" she explained, but added that she left him because \"I was just going through the motions and I wasn’t happy...I want my son to see me really love, and be loved. It’s really important to me.\" Her song \"Easy on Me\" was written to try and explain the divorce to Angelo, who was saddened by it. Following the divorce, Adele began a relationship with Rich Paul, who is LeBron James's agent. They had met at a mutual friend's birthday party. On August 8, 2024, Adele revealed that she and Paul were engaged while she was performing a concert in Munich, Germany during her Adele in Munich concert residency. She and Paul are seemingly married, as she has called Paul her husband on a number of occasions; however, neither of them have ever directly confirmed if they are married or not. On 19 December 2013, Adele was given an MBE by the Prince of Wales. ==Discography== ===Albums=== * 19 (2008) * 21 (2011) * 25 (2015) * 30 (2021) ===Singles=== * \"Hometown Glory\" (2007) * \"Chasing Pavements\" (2008) * \"Cold Shoulder\" (2008) * \"Make You Feel My Love\" (2008) * \"Rolling in the Deep\" (2010) * \"Someone like You\" (2011) * \"Set Fire to the Rain\" (2011) * \"Rumour Has It\" (2011) * \"Turning Tables\" (2011) * \"Skyfall\" (2012) * \"Hello\" (2015) * \"When We Were Young\" (2016) * \"Send My Love (To Your New Lover)\" (2016) * \"Water Under the Bridge\" (2016) * \"Easy on Me\" (2021) * \"Oh My God\" (2021) * \"I Drink Wine\" (2022) ==Music videos== * \"Chasing Pavements\" (2008) * \"Cold Shoulder\" (2008) * \"Make You Feel My Love\" (2008) * \"Hometown Glory\" (2009) * \"Rolling in the Deep\" (2010) * \"Someone like You\" (2011) * \"Hello\" (2015) * \"Send My Love (To Your New Lover)\" (2016) * \"Easy on Me\" (2021) * \"Oh My God\" (2022) * \"I Drink Wine\" (2022) ==Grammy Awards== The Grammy Awards are awarded each year by the National Academy of Recording Arts and Sciences of the United States for outstanding achievements in the music industry. Some think they are the highest music honor. As of February 13, 2017, Adele has received 15 Grammy Awards from 18 nominations. In 2012, Adele became the second female artist to win six awards in one night, after Beyoncé did in 2010. Adele is only the second artist (following Christopher Cross) to have won all four of the General Field (\"Big Four\") awards at the Grammys. Year Nominated work Award Result Ref. 2009 Adele Best New Artist \"Chasing Pavements\" Record of the Year Song of the Year Best Female Pop Vocal Performance 2010 \"Hometown Glory\" 2012 21 Album of the Year Best Pop Vocal Album \"Rolling in the Deep\" Record of the Year Song of the Year Best Short Form Music Video \"Someone Like You\" Best Pop Solo Performance 2013 \"Set Fire to the Rain\" (Live) 2014 \"Skyfall\" Best Song Written for Visual Media 2017 25 Album of the Year Best Pop Vocal Album \"Hello\" Record of the Year Song of the Year Best Pop Solo Performance 2023 30 Album of the Year Best Pop Vocal Album \"Easy on Me\" Record of the Year Song of the Year Best Pop Solo Performance Best Music Video Adele One Night Only Best Music Film ==References== ==Other websites== * * Adele at XL Recordings Category:21st-century English musicians Category:21st-century British singer- songwriters Category:1988 births Category:Best Original Song Academy Award- winning songwriters Category:Brit Award winners Category:English blue-eyed soul singers Category:English guitarists Category:British Grammy Award winners Category:Living people Category:Members of the Order of the British Empire Category:MTV Video Music Award winners Category:People from Tottenham Category:Singer-songwriters from London",
 "title": "Adele"
}