{
 "id": "863310",
 "text": "The Wright StreetLite is a single-decker bus. It has a low-floor. It has been built from 2010 to the present day by Wrightbus. ==Versions== === StreetLite WF (wheel-forward) === The StreetLite WF (wheel-forward) was launched in 2010. To save space, the axles are in front of the passenger door. ==== StreetVibe ==== The StreetVibe was launched in 2015.Wright adds StreetVibe Route One 18 February 2015 It is much shorter and narrower than a normal StreetLite. The first StreetVibe entered service with East Lothian Council in April 2016. Two StreetVibes were sent to Moray Council in June and July 2016. Twenty-two StreetVibes were sent to Guernsey's HCT Group in April and May 2017.Nu-Track /Nu-Vibe Bus Fleet Lists on the WebFirst Wright StreetVibes enter Guernsey service Route One 7 June 2017 ==== VDL Citea MLE ==== In October 2013, VDL Bus & Coach launched a rebadged version of the StreetLite WF, known as the Citea MLE, for the European market.Wrightbus eyes Europe with VDL Bus & Coach Professional 12 September 2013 Quick Parking of Haarlem in the Netherlands ordered the first Citea MLE in May 2014. Nobina Danmark ordered five Citea MLE in December 2014 and two Citea MLE in June 2015. A further two Citea MLEs entered service in Denmark with Keolis Danmark in December 2014.VDL – Citea MLE / Wright Streetlite Bus Fleet List on the Web ====Gallery==== File:Taunton Garage - First 55103 (MX12JRV).JPG|The Buses of Somerset Wheel Forward StreetLite in 2015 File:Exeter Bus Station - Dartline (MX12DZA) rear.JPG|Dartline wheel-forward StreetLite rear at Exeter bus station in 2017 File:Olympic.Bus.Walsall (crop).jpg|Stagecoach South Wales StreetLite on the 2012 Summer Olympics torch relay in Walsall in June 2012 File:London 2012 Olympic Torch Relay - Day 53 - Oxford (7545870772).jpg|Stagecoach South Wales StreetLite on the 2012 Summer Olympics torch relay in Walsall in June 2012 File:VDL CITEA MLE-88-180 - III (cropped).JPG|Arriva Netherlands VDL Citea MLE in Lelystad in August 2014 === StreetLite DF (door-forward) === The StreetLite DF (door-forward) was launched in 2011.Door forward for StreetLite Bus & Coach Professional 8 July 2011 The axle is behind the door. ==== StreetLite Max ==== The StreetLite Max was launched in 2012. It is longer than normal StreetLites, It has 45 seats.Wrightbus unveils bigger StreetLite Bus & Coach Professional 7 June 2012 The front axle is behind the passenger door like the \"door forward\" version. === StreetLite Micro Hybrid === The StreetLite Micro Hybrid was launched in 2013. the StreetLite Micro Hybrid uses energy lost from braking to power the buses electric systems and compressed air systems === StreetLite Hybrid === The StreetLite Hybrid was launched in May 2018. the StreetLite Hybrid is a hybrid-electric bus === StreetLite Electric === The StreetLite EV was launched in 2014. It is a battery electric bus with no diesel engine. In January 2014, Arriva Shires & Essex ordered eight StreetLite EVs, they went into service in Milton Keynes, they were on national news because of their trial of inductive charging.Wirelessly charged electric buses set for Milton Keynes BBC News 9 January 2014Putting electric buses to the test Bus & Coach Professional 17 January 2014 ====Gallery==== File:LONDON BUS MUSEUM BROOKLANDS 2015 (16576282244).jpg|Tower Transit Door Forward StreetLite File:2013 Wright StreetLite DF 4.5.jpg|First Hampshire & Dorset Door Forward StreetLite File:Arriva 6004 - SM15 HWA (26578521545).jpg|Arriva Merseyside Door Forward StreetLite Max in April 2016 File:Wright StreetLite Micro Hybrid.jpg|The first production Wright StreetLite Max to be fitted with Micro Hybrid technology, a 2014 model delivered new to First South Yorkshire File:Wright StreetLite Hybrid.jpg|The first two production fully hybrid-electric Wright StreetLite Maxes at First South Yorkshire's Olive Grove depot prior to entry into service in April 2018 – note the additional front grille File:ArrivaTheShires-WrightStreetLiteEV- WolvertonAgora-P1340896.JPG|Arriva The Shires StreetLite EV in Wolverton in 2015 File:ArrivaTheShires-WrightStreetLiteEV- WolvertonAgora-P1340901.JPG|Arriva The Shires StreetLite EV rear in Wolverton in 2015 ==References== == Other websites == * * Wright StreetLite (Wrightbus website) Category:Low-floor buses StreetLite Category:Battery electric buses",
 "title": "Wright StreetLite"
}