{
 "id": "863325",
 "text": "On 12 August 2021, six people were killed in a mass shooting in Plymouth, Devon, England. Six people, including the shooter, Jake Davison, were killed. == Shooting == In the evening on 12 August 2021, Jake Davison shot his mother dead. This was inside their home on Biddick Drive. At 18:11 BST, the Devon and Cornwall Police were called to Biddick Drive. At 18:12 BST on 12 August 2021, the South Western Ambulance Service were called to Biddick Drive. Biddick Drive is a street where people live in Keyham, Plymouth, Devon, South West England. Police officers were at Biddick Drive 6 minutes after the shooting. The ambulance service said they responded with a lot of resources and many people. They said this included hazardous area response teams, many ambulances, air ambulances and medics. Four air ambulances went to Biddick Drive because of the incident. People who saw the incident said that they had heard \"loud bangs\" and \"gunshots\". and Sky News said that a shooter had been shot and was thought to be dead. At 21:34, Devon and Cornwall Police reported that they believed the incident had been kept to that area. Police said the incident did not have anything to do with terrorism. Six people were killed in the attacks. Three males and two females died where the shooting took place, including the shooter, who committed suicide. Another woman died because of injuries from the shooting after. One of the dead was a child. == Attacker == The gunman was Jake Davison. He was a 22-year-old crane operator. He had a gun license. == Reactions == In a tweet, Home Secretary Priti Patel described the incident as \"shocking\". She also said that she had talked with the Chief Constable of Devon and Cornwall Police. Local MPs Luke Pollard and Johnny Mercer also tweeted, with Pollard suggesting people stay inside. The Defence Secretary, Ben Wallace, said the shooting was bad. Wallace also said that the shooting didn't have to do with terrorism. The Prime Minister, Boris Johnson, said that he was sad for those who were affected. He also thanked the emergency services who went to the shooting. The leader of the opposition, Keir Starmer, said that something sad had happened and that he wasn't happy about it. == References == Category:2021 in the United Kingdom Category:2021 mass shootings in Europe Category:2020s murders in the United Kingdom Category:August 2021 events Category:Mass murder in 2021 Category:Mass murder in England Category:Murder-suicides in Europe Category:Murders by firearm in England Shooting Category:Suicide in the 2020s Category:Suicides in the United Kingdom",
 "title": "Plymouth shooting"
}