{
 "id": "863523",
 "text": "Julie London (originally Julie Peck; September 26, 1926 – October 18, 2000) was an American pop and jazz singer, television, stage, radio and movie actress. Her career lasted for almost four decades. London was known for having sultry contralto vocal ranges. Contralto means a female singing voice whose vocal range has the lowest female voice type. She recorded just over thirty pop and jazz albums between 1955 and 1969. Her recording of the Arthur Hamilton melancholy pop ballad \"Cry Me a River\" was added into the Grammy Hall of Fame in 2001. London was also awarded a Golden Globe Award in 1974 for her role as Dixie McCall in the 1970s NBC television show Emergency! (1972 to 1977). London was the female lead in a lot of Western movies. Those included acting with Gary Cooper in Man of the West (1958), Robert Taylor in Saddle the Wind (another 1958 Western movie) and Robert Mitchum for The Wonderful Country (1959). Other movies were the crime movie Crimes Against Joe (1956) and the musical and comedy movie The Girl Can't Help It (also from 1956). London released several albums during the 1960s. Those included Whatever Julie Wants (1961), Love Letters (1962) and The End of the World (1963). The latter carried her cover of the Skeeter Davis song. London was born in Santa Rosa, California. She was affected with negative health after a stroke in 1995. Four years later, London was given a diagnosis of lung cancer. She died from cardiac arrest inside a Los Angeles hospital at age 74. ==References== Category:Singers from Los Angeles Category:Golden Globe Award winning actors Category:Deaths from cardiac arrest Category:Disease-related deaths in Los Angeles Category:American television actors Category:American stage actors Category:American radio actors Category:American pop singers Category:American musical theatre actors Category:American movie actors Category:American jazz singers Category:Actors from Los Angeles Category:1926 births Category:2000 deaths",
 "title": "Julie London"
}