{
 "id": "863576",
 "text": "Devizes is a constituency of the UK Parliament. It is in Wiltshire, England. The current MP for it is Danny Kruger, a Conservative. He was elected in the 2019 United Kingdom general election. The constituency has four towns and many villages inside it. The area's MP has been someone from the Conservative Party since 1924. ==History== Devizes originally elected two Members of Parliament (MPs). They did this until the 1868 general election. They stopped because the Reform Act 1867 lowered its their amount of MPs to one MP. MPs are elected by first-past-the-post. The seat has had a Conservative MP elected at every election since 1924. Its most well-known MP was Henry Addington. Addington was the MP for the seat when he was Prime Minister. He also was the MP for the seat when he was Speaker of the House of Commons. ==Members of Parliament== ===1295–1640=== Parliament First MP Second MP 1386 Richard Gobet William Salter 1388 (Feb) Richard Cardmaker William Salter 1388 (Sep) Richard Cardmaker William Spicer 1390 (Jan) Richard Gobet William Spicer 1390 (Nov) 1391 1393 William Coventre I William Spicer 1394 John Tapener Richard Brunker 1395 Richard Cardmaker William Spicer 1397 (Jan) William Salter Henry Webbe 1397 (Sep) William Salter John Peyntour 1399 Richard Cardmaker William Salter 1401 1402 Simon Skinner Richard Smith 1404 (Jan) 1404 (Oct) 1406 John Huwet John Kingston 1407 John Peyntour Simon Skinner 1410 1411 1413 (Feb) 1413 (May) John Coventre Simon Skinner 1414 (Apr) Thomas Coventre Robert Smith 1414 (Nov) William Coventre III Thomas Coventre 1415 William Coventre III Roger Barbour 1416 (Mar) Richard Litelcote John Peyntour 1416 (Oct) 1417 William Coventre III Robert Tyndale 1419 Robert Tyndale William Hendelove 1420 John Coventre I Robert Chandler 1421 (May) William Coventre III Robert Smith 1421 (Dec) John Baker John Fauconer 1425 Robert Chandler 1429 Robert Chandler 1442 Henry Long 1492 Richard Pudsey 1510–1523 No names known 1529 John Poyntz Richard Mytton 1536 ? 1539 ? 1542 ? 1545 Clement Throckmorton Geoffrey Danielle 1547 Sir George Howard Nicholas Throckmorton 1553 (Mar) ? 1553 (Oct) William Rede Thomas Hull 1554 (Apr) Thomas Highgate Henry Leke 1554 (Nov) Thomas Hull Edward Heynes 1555 Thomas Hull James Webbe 1558 Thomas Hull Henry Morris 1558 John Young Edward Heynes 1562/3 Hugh Powell Edward Heynes 1571 Edward Baynton William Clerke 1572 George Reynolds, died and replaced 1580 by John Snell Henry Grube 1584 Edward Baynton I Henry Brouncker 1586 Edward Baynton I Henry Brouncker 1588 Henry Brouncker John Delabere 1593 Henry Baynton I or Henry Baynton II Richard Mompesson 1597 John Kent Robert Drew 1601 Giles Fettiplace Robert Drew 1604 Sir Henry Baynton Robert Drew 1614 Sir Edward Baynton William Kent 1621 Sir Henry Ley John Kent 1624 Edward Bayntun John Kent 1625 Edward Bayntun Robert Drew 1626 Robert Long Sir Henry Ley 1628 Robert Long Thomas Kent 1629–1640 No Parliaments summoned ===1640–1832=== Election 1st member 1st party 2nd member 2nd party March 1640 Edward Bayntun Henry Danvers November 1640 Edward Bayntun Robert Nicholas 1653 Devizes not represented in Barebones Parliament September 1654 Edward Bayntun One seat only September 1656 Edward Scotton One seat only January 1659 Chaloner Chute jnr Edward Scotton March 1660 William Lewis Robert Aldworth April 1661 William Yorke John Kent December 1666 John Norden October 1669 Edward Lewis George Johnson April 1675 Sir Edward Bayntun February 1679 Sir Walter Ernle September 1679 Sir Giles Hungerford John Eyles February 1681 Sir Walter Ernle George Johnson March 1685 John Talbot of Lacock Walter Grubbe January 1689 Sir William Pynsent March 1690 Sir Thomas Fowle December 1690 John Methuen November 1695 Sir Edward Ernle July 1698 Sir Francis Child January 1701 Francis Merewether November 1701 John Methuen November 1702 John Child March 1703 Francis Merewether May 1705 Sir Francis Child December 1706 Josiah Diston May 1708 Paul Methuen October 1710 Sir Francis Child Thomas Richmond Webb August 1713 Robert Child John Nicholas January 1715 Josiah Diston Francis Eyles (expelled) February 1721 Benjamin Haskins-Stiles March 1722 Sir Joseph Eyles Whig August 1727 Francis Eyles Whig April 1734 Sir Joseph Eyles Whig February 1740 John Garth Whig July 1742 George Lee Whig July 1747 William Willy January 1765 Charles Garth June 1765 James Sutton September 1780 Sir James Tylney-Long November 1780 Henry Jones April 1784 Tory Henry Addington Tory December 1788 Joshua Smith Tory January 1805 Thomas Grimston Estcourt Tory June 1818 John Pearse Tory March 1826 George Watson-Taylor Tory ===1832–1868=== Election 1st member 1st party 2nd member 2nd party 1832 Wadham Locke Whig Montague Gore Whig February 1834 Admiral Sir Philip Charles Durham Tories December 1834 Conservative November 1835 T. H. S. Sotheron-Estcourt Conservative February 1836 James Whitley Deans Dundas Whig May 1838 George Heneage Walker Heneage Conservative February 1844 William Heald Ludlow Bruges Conservative February 1848 James Bucknall Bucknall-Estcourt Conservative 1852 John Neilson Gladstone Conservative 1857 Simon Watson Taylor Peelite Christopher Darby Griffith Conservative 1859 John Neilson Gladstone Conservative Feb 1863 William Addington Conservative Apr 1864 Sir Thomas Bateson, Bt. Conservative 1868 Second Reform Act: representation reduced to one member ===Since 1868=== Devizes has been a usual Conservative seat since 1945. The current Member of Parliament is Danny Kruger. He was first elected at the 2019 general election. The MP before him was Claire Perry. Perry decided not to run at the next election. Election Member Party 1868 Sir Thomas Bateson Conservative 1885 Walter Long Conservative 1892 Charles Hobhouse Liberal 1895 Edward Goulding Conservative 1906 Francis Rogers Liberal 1910 Basil Peto Unionist 1918 Cory Bell Unionist 1923 Eric Macfadyen Liberal 1924 Percy Hurd Conservative 1945 Christopher Hollis Conservative 1955 Percivall Pott Conservative 1964 Charles Morrison Conservative 1992 Michael Ancram Conservative 2010 Claire Perry Conservative 2019 Danny Kruger Conservative ==In popular culture== Devizes was the constituency of the fictional (fake) Conservative MP The Honourable Sir Piers Fletcher-Dervish, Baronet, later Junior Minister for Housing, in the TV sitcom The New Statesman. The actor Michael Troughton played the MP. The show was set in the 1980s. This was when Charles Andrew Morrison was MP for the actual seat. == References == Category:Westminster Parliamentary constituencies in England Category:Wiltshire",
 "title": "Devizes (UK Parliament constituency)"
}