{
 "id": "863581",
 "text": "Jason Matthew Ethier (born February 14, 1990), also known as ImJayStation or JayStation, is an internet personality and former YouTuber from Canada. He began his career as JayStation. His channel was well known for his prank and \"challenge\" style videos, in particular his \"3 AM\", \"I bought X on the Dark Web\" and \"24 hour overnight\" challenges. He often would use recent celebrity deaths for video topics by \"contacting them with a Ouija board\" in videos that he would post close to their deaths. In 2016, he was arrested by Ottawa police for trespassing during one of his \"24-hour overnight challenges\". As such, his channel got demonetized. After the arrest he went under the new name ImJayStation. == Noga Kiyapo Controversy == On December 8, 2017 Noga Kiyapo (JayStation's ex-girlfriend), then known as C. Air or Aiko, posted a video detailing controlling behavior and abusive tendencies that JayStation had shown towards her. She opens the video with a conversation in which JayStation claims that \"If I had been born back then, they would have put me in The Bible.\" She then goes on to show several text messages JayStation had sent her. The contents of these texts include threats to dox her if she gets the police involved, threats to sue her and blackmail her if she doesn't delete her videos as well as abusive language. She also highlights a video in which JayStation leaks her phone number. After this she shows several posts from JayStation promising to upload a video, only when her own video gets 1000 dislikes claiming \"She needs to quit.\" She then claims that JayStation had taken physical action against her, showcasing a phone that belonged to her that he had broken during the incident. Kiyapo states the reason he behaved this way was because he believed that she was cheating on him, despite the two not dating at the time. She describes that when they were dating, he would disallow her to see her family or return to Toronto under the assumption that she was cheating on him and that he continued this behavior even after they were no longer in a relationship. She then shows a comment from one of her live streams in which Jay threatens to kill her. Despite her statements, she still wishes him well in the future. == Alexia Controversy == In January of 2020 he announced the death of his girlfriend, Alexia Marano, due to a drunk driving incident. He created multiple videos on the topic to garner attention and views, such as one depicting him using an Ouija board to contact his girlfriend's spirit. Fellow YouTuber SomeOrdinaryGamers covered this controversy heavily and later reached out to Metropolitan Toronto Police to confirm whether or not such a drunk driving incident had happened, finding that no incidents involving a victim by the name of Alexia had occurred in the area and timeframe JayStation claimed the accident took place. His girlfriend Alexia later came out and confirmed that she was in fact still alive, putting to bed any speculation on the events that had taken place. This video was deleted, but later reuploaded to YouTube by multiple archive channels. JayStation's YouTube channel was demonetized in February of that year, likely for violating YouTube's community guidelines and or terms of service, then banned from YouTube altogether on March 21, 2021. ==References== Category:1990 births Category:Living people Category:Canadian YouTubers",
 "title": "ImJayStation"
}