{
 "id": "863859",
 "text": "Lingua Franca Nova (also Elefen) is an auxiliary language originally built by C. George Boeree of Shippensburg University, Pennsylvania, and developed by many of its users. Its vocabulary is based on the Romance languages: French, Italian, Portuguese, Spanish, and Catalan. == History == Boeree started to create Lingua Franca Nova in 1965,His goal was creating an international auxiliary language simple and easy to learn for international communication. He was inspired by two languages: * the Mediterranean Lingua Franca or \"Sabir\", a Romance pidgin used by European sailors and merchants as a lingua franca in the Mediterranean Sea from the 11–18th century, * different creoles such as Papiamento and Haitian Creole. He took the language vocabulary from French, Italian, Portuguese, Spanish, and Catalan. Lingua Franca Nova first appeared on the internet in 1998. A Yahoo! Group was formed in 2002 by Bjorn Madsen, and reached about 300 members who contributed to the evolution of the language. In 2005 Stefan Fisahn created a wiki for the language. The wiki moved to Wikia in 2009, then was hosted directly on the official website in 2019. In 2007, Igor Vasiljevic created a Facebook group, which now has over 600 members. In 2012 a novel fully translated into Lingua Franca Nova was first published in printed form: La aventuras de Alisia en la pais de mervelias. It is Simon Davies's translation of Lewis Carroll's Alice's Adventures in Wonderland. In 2014 a new official website was created on the \"elefen.org\" domain. It offers different materials in several languages to learn the language. It also has a wiki and the official dictionary. Some books in Lingua Franca Nova are also available on the official website for reading. On April 18, 2018, Wikipedia in Lingua Franca Nova, called \"Vicipedia\", was officially launched.Task on Phabricator On May 15, 2020 on the Web and on May 10, 2021 in printed formLitteratura in Occidental, in Cosmoglotta 329 (Januar- junio 2022), pag. 2-15 the first original novel written in Lingua Franca Nova was published: La xerca per Pahoa, by Vicente Costalago. He published the second original novel in the language, La marcia nonconoseda, in February 2022. On January 5, 2021, the language's creator, C. George Boeree, died of pancreatic cancer aged 68. == Grammar == LFN is a subject-verb-object language. Modifiers generally follow what they modify, as do prepositional phrases and subordinate clauses. Other than the plural in -s or -es, nouns don't change. A noun's role in a sentence is determined by word order and prepositions. There are 22 prepositions. Nouns are usually preceded by articles (la or un) or other determiners such as esta (this, these), acel (that, those), alga (some), cada (every, each), multe (many, much), and poca (few, little). Possessive determiners, cardinal numerals, and the adjectives bon and mal (good and bad) also precede the noun; ordinal numerals follow the noun. A variety of pronouns are identical to or derived from determiners. The personal pronouns don't change: person singular plural 1 me nos 2 tu vos 3 el / lo / on los El is used for people and higher animals; Lo is used for all else. On is used in the same way as in French or \"one\" in English (in the way that one would be using it if one said this sentence). Verbs don't change. The verb alone represents the present tense and the infinitive. Other tenses and moods are indicated by preceding particles: tense/mood particle example translation present - me vade I go past ia me ia vade I went future va me va vade I will go conditional ta me ta vade I would go Adverbs such as ja (already) and auxiliary verbs such as comensa (begin to) are used to add precision. The active participle ends in -nte and the passive participle in -da. They can be used with es (to be) to form a progressive aspect and a passive voice, respectively. Adjectives are don't change, and adverbs are not distinguished from adjectives. Adjectives follow nouns and adverbs follow verbs but precede adjectives. The comparative is formed with plu or min, the superlative with la plu or la min. Questions are formed by adding esce at the beginning of the sentence with or by using one of several \"question words\", such as cual (what, which), ci (who), do (where), cuando (when), and perce (why). These same words are also used to introduce subordinate clauses, as are words such as si (if), ce (that), car (because), and afin (so that). Prepositions include a (at, to), de (of, from), ante (before, in front of), pos (after, behind), etc. Conjunctions include e (and), o (or), and ma (but). == Literature == === Original === The first original novel published in Lingua Franca Nova was La xerca per Pahoa [\"the search for Pahoa\"], written by Vicente Costalago; Publishing started in 2020 (internet) and 2021 (book). The second original book published was La marcia nonconoseda, also by the same author. He wrote another book of the series, called La Club de la Marcia en peril.La Club de la Marcia en peril Another story, Rancur, was published by the same author in October 2023.Rancur Regarding original poetry, there are the poems Pensas rimadaPensas rimadas and Senas,Senas written by him; although the main poet in Lingua Franca Nova is Guido Crufio.Testos orijinal === Translated literature === The first translated text was Hills Like White Elephants, by Ernest Hemingway; translated by Daniel Alegrett in 1999. It is an example of ancient lingua franca nova. We have to wait until 2008 to see other literary texts written in this language. This time, it is Bocragonia (the poem Jabberwocky by Lewis Carroll) and The Fall of the House of Usher, translated by Simon Davies. This elephenist has translated other works such as Alisia en la pais de mervelias, translated in 2010 and published in 2012, making it the first paper publication in this language. This text was originally translated by someone else, but after discovering that it was not a translation of the original, but from the English, Simon Davies decided to retranslate it from scratch. Between 2013 and 2014, Simon Davies He also translated Tra la miror, e lo cual trova a ultra. In 2014, C. G. Boeree translated William Shakespeare's The Tragedy of King Lear, the first play to be translated into the lingua franca nova. In 2018, Simon Davies translated Un studia en scarlata and on 29 April 2019 he finished the translation of the first book of the Aeneid. On June 22, 2019, Vicente Costalago translated the Gospel of Saint Mark, based on the English and Spanish versions of the Vatican Bible. It is the third complete text of the Bible translated into this language, the Second Letter of St. John the Second, translated by the same author in 2008; and Ecclesiastes the First, translated by Dave MacLeod in 2006. Pieces of other parts of the Bible have been translated, such as parts of the Gospels of St. Luke and St. John. On November 10, 2019, Vicente Costalago translated the first chapter of Don Quixote and on February 22, 2020, he finished the translation of the Gospel of Saint Matthew. The main literary works translated into Lingua Franca Nova, are: * Colinas como elefantes blanca (\"Hills Like White Elephants\") by Ernest Hemingway * Demandas de un laboror lejente (Questions from a Worker Who Reads) by Bertolt Brecht * Frate peti (Little Brother) by Cory Doctorow * La alia de capeles roja (\"The Red-Headed League\") by Arthur Conan Doyle * La aventuras de Alisia en la pais de mervelias (Alice's Adventures in Wonderland) by Lewis Carroll * La cade de la Casa de Usor (\"The Fall of the House of Usher\") by Edgar Allan Poe * La jigante egoiste (\"The Selfish Giant\") by Oscar Wilde * La prinse peti (The Little Prince) by Antoine de Saint-Exupéry * Leteras de la tera (Letters from the Earth) by Mark Twain * Re Lear (King Lear) by William Shakespeare * Tra la miror, e lo cual Alisia trova a ultra (Through the Looking-Glass, and What Alice Found There) by Lewis Carroll * Un canta de natal (A Christmas Carol) by Charles Dickens * Wini-la-Pu (Winnie-the-Pooh) by Alan Alexander Milne == References == == Other websites == * Official website * Dictionary * Grammar * Literature * Vici de Elefen * Lingua Franca Nova on Langoland * Swadesh list for Lingua Franca Nova",
 "title": "Lingua Franca Nova"
}