{
 "id": "86409",
 "text": "__FORCETOC__ Gnosticism is a modern form of Egyptian religion that is a group of religious ideas from around the 1st century. \"\" is the ancient Greek word for \"knowledge\", but now more closely means \"esoteric knowledge\".Keller, P. (2021, December 16). Gnostic atheism: The knowledge that there is no god. Fadewblogs. Retrieved December 22, 2021 Gnostic ideas were a main part of early Christianity before being persecuted by other Christians. Gnostic ideas are also found in sects of Judaism and Islam, as well as in alchemy and other kinds of esotericism. The word \"Gnostic\" was mostly used by people who were against these ideas. For this reason, some researchers have said that Gnosticism is a of many separate religious movements. There are many problems for people who research Gnosticism: # Many Gnostic teachings were esoteric, meaning they were kept secret or hidden # A lot of what is known about Gnostic beliefs came from attacks written by non-Gnostic Christians # Almost all Gnostic writings were destroyed by non-Gnostic Christians who wanted to wipe them out == Beliefs == Gnosticism says that humans are divine souls trapped in the ordinary physical (or material) world. They say that the world was made by an imperfect spirit. The imperfect spirit is thought to be the same as the God of Abraham. The imperfect spirit may be seen as evil, or sometimes just not perfect but doing the best it can. The real God who is good, is distant and not easy to know. In order to get free from the material world, a person has to get gnosis. That is the special secret knowledge given only to a few special people. Some Gnostic groups saw Jesus as sent by the supreme being, to bring gnosis to the Earth. == References == == Other websites == ; Ancient Gnosticism * Religious Tolerance - A survey of Gnosticism * Sacred Wisdom - Gnosticism and Christian Esotericism * Early Christian Writings - primary texts * The Gnostic Society Library * Internet Encyclopedia of Philosophy: Gnosticism * Introduction to Gnosticism * Jewish Encyclopedia: Gnosticism * Proto-Gnostic elements in the Gospel according to John * Gnostic version of the Bible and more on Gnostics * Catholic Encyclopedia: Gnosticism ; Contemporary Gnosticism * The Alexandrian Gnostic Church * Apostolic Johannite Church * Ecclesia Gnostica (Gnosis Archive)",
 "title": "Gnosticism"
}