{
 "id": "864292",
 "text": "Keep America Beautiful is a group from the United States. It made advertisements and public service announcements. It is to stop people from throwing garbage on the ground outside. Its most famous public service announcement is the Crying Indian public service announcement. It is also famous for starting the word \"litterbug.\" Most of the groups that started Keep America Beautiful are for-profit companies. They make bottles, cans, and other packaging. They want people to think pollution comes from people who drop their own pieces of garbage outside. They do not want people to think that pollution come from companies making too much packaging. This is called greenwashing. ==Beginning== After World War II, many companies decided to sell things in packages that could not be used again. They did this because it was cheaper than using bottles and cans again. Many of these companies did not want the government to make laws telling them what to do. For example, in 1953, the state of Vermont passed a law against one-use bottles. It was because farmers said people were throwing the empty bottles into haystacks and that cows were eating them. This type of law is called a \"bottle bill.\" In 1951, the American Can Company and Owens-Illinois Glass Company and other companies started Keep America Beautiful. Other groups joined too: *The Coca- Cola Company *PepsiCo *Phillip Morris *Anheuser-Busch *Others Owens-Illinois would later own the Dixie Cup Company. ==Ideas== The companies behind Keep America Beautiful did not want the government to pass laws that would cost them money. For example, they wanted to stop laws that would make them sell drinks in reusable bottles. Throwaway bottles were cheaper. Keep American Beautiful wanted voters to look at the advertisement and think people made pollution one by one and not that big companies made pollution. The Ad Council started by thinking of litter as something ugly and poor citizenship. They said that people who littered were thoughtless and careless. They also said that these people made the world ugly for other people. The Keep America Beautiful media fact sheet read that littering ruined \"pleasure and recreation from their beautiful outdoors. [...] Yet their enjoyment of the natural and man-made attractions of our grand landscape is everywhere marred by the litter which careless people leave in their wake. [...] The mountain of refuse keeps growing.\" They also said that litter cost money to clean up and could be bad for health. Keep America Beautiful wanted to... *...show litter and pollution as if they were the same thing *...show that littering was a choice made by individual people and not by big companies *..show that all people were equally guilty ==Politics== Keep America Beautiful supported some laws but not all. Keep America Beautiful did support laws telling people what to do: *Laws against littering, for example laws saying the government could make someone pay a fine if they were caught throwing garbage outside *Laws telling people to recycle Keep America Beautiful did not support laws telling companies what to do: *Deposit laws *Laws telling companies to recycle *Laws telling companies to make less waste == Advertisement == The Advertising Council helped make advertisements for Keep America Beautiful. The Advertising Council had already made Smokey Bear for the U.S. Forest Service. Smokey Bear tells people \"Only You Can Prevent Forest Fires.\" The Council decided their advertisement for Keep America Beautiful should be like the Smokey Bear advertises: It should tell people that their own choices solve problems. ===Susan Spotless=== Before the Crying Indian ad, Keep America Beautiful used a character called \"Susan Spotless.\" This was a young white girl in a white dress. This girl shook her finger at adults who make the environment dirty. She told them to stop: \"Daddy, you forgot . . . every litter bit hurts!\" (\"Litter\" sounds like \"little\" in American English.) The idea was that parents should be ashamed to teach their children to litter. ===Crying Indian ad=== In the late 1960s and early 1970s, the idea that the environment must be protected became strong in America. Many of the protesters just before the first Earth Day talked about throwaway containers. For example, students from the University of Michigan put a big pile of empty drink containers on the ground. It was outside the offices of the National Soft Drink Association. The hippies of the 1960s liked the idea of Native Americans. In 1967, Life wrote that hippies saw \"the dispossessed Indian as America’s original dropout, and convinced that he has deeper spiritual values than the rest of society, hippies have taken to wearing his costume and horning in on his customs,\" meaning that hippies wanted to copy American Indians. In the Crying Indian ad, an actor dressed as a Native American paddles a canoe through a stream. At first, the stream is clean and pretty but it becomes dirtier and full of garbage. He gets out of the stream and walks to a highway, where people throw garbage out of their cars. Then he slowly cries one tear. A voice says, \"Some people have a deep, abiding respect for the natural beauty that was once this country. And some people don't. ... People start pollution. People can stop it.\" The ad was on television starting in 1971. It was about littering. The ad won many awards, for example two Clio Awards. Television stations played it so much that their copies of the film wore out and they had to get new ones. Trent University history professor Finis Dunaway says that the man in the Crying Indian ad \"appears completely powerless. In the commercial, all he can do is lament the land his people lost,\" when, at the same time, real-life American Indians were working to solve their problems. Another Crying Indian ad was on television in 1975. In 1998, the first one was on television again. ====Actor==== Iron Eyes Cody was an actor who played Native Americans on television and in movies. He had already been in many movies and TV shows before the Crying Indian ad. Iron Eyes Cody said he was a Native American, but he was really Italian American. ==Environmental groups== For a while, environmental groups, for example the National Audubon Society and the Sierra Club, worked with Keep America Beautiful. These two groups stopped agreeing in the 1970s when they wanted to pass more bottle bills and Keep America Beautiful did not. One of Keep America Beautiful's leaders called the environmental groups \"communists\" for wanting to pass these laws. ==Other work== Keep America Beautiful started the National Center for Resource Recovery in the 1970s. The NCRR is a lobbying group: It sends people to talk to lawmakers and convince them to pass or not pass laws. ==References== Category:1953 establishments in the United States Category:Recycling Category:Environmental organizations based in the United States Category:Organizations based in Connecticut Category:Non-profit organizations of the United States",
 "title": "Keep America Beautiful"
}