{
 "id": "86432",
 "text": "The Simputer is a small, cheap device, similar to a personal digital assistant (palmtop). The unique feature of this device is a smart-card interface which allows a single Simputer to be used by many users. User's private data can be kept on a cheap smart-card. This device was constructed by an Indian company- Simputer Trust. The name stands for \"Simple computer\". ==History== The Simputer project was invented during the organization of the Global Village, an International Seminar on Information Technology for Developing Countries in October 1998. The discussion was about the big need for a low-cost mass access device which will bring local-language IT to the masses. Inventing a name for the new device, the purpose was to find a complex acronym Thus Simputer is a Simple, Inexpensive, Multi-lingual comPUTER. Later it was expanded to Simple, Inexpensive Multi-lingual People's compUTER. Now it is also called \"computer for the masses\". ==Features== It is similar to the Linux Advanced Radio Terminal and the Intel StrongARM reference platform. It has processor Intel StrongARM 200+ MHz, 64MB of RAM, 32MB Flash ROM. It can use cheap smart-cards with capacity 8KB. It has also USB connectivity and software modem so can connect to the internet. The 320x240 LCD interface in Simputer is with a touch panel overlay on liquid-crystal display. The operating system runs on a version of the Linux Kernel. The software used in Simputer is text-to-speech. This tool may use speakers and microphone because it has special jacks. It has also a built-in Infrared Data Association port. The device is powered by 3 AAA sized NiMH batteries. ==Licensees== The Simputer Trust has licensed manufacturers to produce devices based on the Simputer. These companies are: PicoPeta Simputers and Encore Technologies. ==Future prospects== The tool developed is very generic and has similar devices in many other countries. It is ideally suited for developing and under developed countries like: India, Azerbaijan, Mauritius, Mongolia, Ghana, Uzbekistan, Sri Lanka, Bhutan, Thailand or Vietnam. ==Sources== * http://www.simputer.org/simputer/history/ * http://www.itu.int/osg/spu/digitalbridges/materials/marwaha_paper.pdf (International Cooperation in the ICT Field: Bridging the Digital Divide) * http://indic-computing.sourceforge.net/designaxes/analysis.html * http://www.simputer.org/simputer/about/ ==Other websites== * http://news.bbc.co.uk/1/hi/world/south_asia/1535992.stm * http://www.outlookindia.com/pti_news.asp?id=85140 * http://www.dmoz.org/Computers/Systems/Handhelds/Open_Source/Simputer/ * http://www.amidasimputer.com/ * http://www.picopeta.com/ * http://www.rediff.com/money/2001/apr/24spec.htm * http://www.ncoretech.com/products/ia/simputer/index.html Category:Personal digital assistants",
 "title": "Simputer"
}