{
 "id": "864338",
 "text": "The Patrick Star Show is an American animated comedy television series that is developed by Luke Brookshier, Marc Ceccarelli, Andrew Goodman, Kaz, Mr. Lawrence, and Vincent Waller that premiered on Nickelodeon on July 9, 2021. It is a spinoff of SpongeBob SquarePants that focuses on Patrick Star and his family hosting a talk show. ==Premise== Patrick Star hosts his very own talk show at his family home, with the support of his family. ==Characters== * Patrick Star (voiced by Bill Fagerbakke), the host of The Patrick Star Show * Cecil Star (voiced by Tom Wilson), the father of Patrick Star who works at the Undersea Space Agency * Bunny Star (voiced by Cree Summer), the mother of Patrick Star * Squidina Star (voiced by Jill Talley), a squid who is the adopted sister of Patrick Star that helps in the production of The Patrick Star Show *GrandPat Star (voiced by Dana Snyder), the grandfather of Patrick Star and father of Cecil who is the intelligent member of the Star family and uses a mobility scooter as his mode of transportation * Ouchie (vocal effects provided by Tom Kenny), the Star family's pet sea urchin. * Tinkle (vocal effects provided by Dee Bradley Baker), a sentient and animalistic toilet that is the Star family's other pet. * Grandma Tentacles (voiced by Cree Summer), the Star family's neighbor * FitzPatrick, Patrick's cousin. * Agnes Steelhead, Patrick's grandmother and Bunny's mother. ==Episodes== ===Season 1=== Prod. No. Title Written by Original airdate 1 \"Late for Breakfast\" Kaz July 9, 2021 \"Bummer Jobs\" Luke Brookshier 2 \"Stair Wars\" Mr. Lawrence July 23, 2021 \"Enemies à la Mode\" Andrew Goodman 3 \"Lost in Couch\" Andrew Goodman July 16, 2021 \"Pat-a-Thon\" Kaz 4 \"The Yard Sale\" Mr. Lawrence November 19, 2021 5 \"Squidina's Little Helper\" Andrew Goodman August 6, 2021 \"I Smell a Pat\" Luke Brookshier August 13, 2021 6 \"Gas Station Vacation\" Mr. Lawrence October 29, 2021 \"Bunny the Barbarian\" Kaz November 5, 2021 7 \"The Haunting of Star House\" Mr. Lawrence July 30, 2021 \"Who's a Big Boy?\" March 4, 2022 8 \"Terror at 20,000 Leagues\" Andrew Goodman October 22, 2021 9 \"To Dad and Back\" Kaz March 18, 2022 \"Survivoring\" Andrew Goodman March 25, 2022 10 \"Just in Time for Christmas\" Mr. Lawrence December 3, 2021 \"Klopnodian Heritage Festival\" Kaz March 11, 2022 11 \"X Marks the Pot\" Luke Brookshier April 1, 2022 \"Patrick's Alley\" April 8, 2022 12 \"Pearl Wants to Be a Star\" Andrew Goodman April 15, 2022 \"Super Sitters\" Kaz April 10, 2023 13 \"Nitwit Neighborhood News\" Luke Brookshier July 22, 2022 \"Mid-Season Finale\" Mr. Lawrence 14 \"Shrinking Stars\" Mr. Lawrence January 13, 2023 \"FitzPatrick\" Andrew Goodman April 11, 2023 15 \"Uncredible Journey\" Mr. Lawrence February 10, 2023 \"Host-a-Palooza\" Kaz February 17, 2023 16 \"Backpay Payback\" Mr. Lawrence February 24, 2023 \"House Hunting\" Luke Brookshier March 3, 2023 17 \"The Drooling Fool\" Danny Giovannini April 12, 2023 \"Patrick's Got a Zoo Loose\" Kaz April 13, 2023 18 \"The Patterfly Effect\" Dylan Bozic, Jacob Fleisher, Andy Gonsalves April 17, 2023 \"A Space Affair to Remember\" Kaz, Gabe Del Ville, Mike Pelensky April 18, 2023 19 \"Home ECCH!\" Jacob Fleisher, Zoë Moss, Nora Meek April 19, 2023 \"Fun & Done!\" Kaz, Charlie Jackson, Allen Zhang April 20, 2023 20 \"The Lil' Patscals\" Jacob Fleisher, Andy Gonsalves April 24, 2023 \"The Prehistoric Patrick Star Show\" Kaz, Gabe Del Ville, Mike Pelensky April 25, 2023 21 \"The Patrick Show Sells Out\" Jacob Fleisher, Zoë Moss, Nora Meek April 26, 2023 \"Neptune's Ball\" Kaz, Charlie Jackson, Allen Zhang April 27, 2023 22 \"Dad's Stache Stash\" Jacob Fleisher, Andy Gonsalves, Miggs Perez May 1, 2023 \"A Root Galoot\" Kaz, Gabe Del Ville, Mike Pelensky May 2, 2023 23 \"The Starry Awards\" Dave Tennant, Zoë Moss, Nora Meek May 3, 2023 \"Blorpsgiving\" Jacob Fleisher, Charlie Jackson, Stephen Herczeg May 4, 2023 24 \"Stuntin'\" Dave Tennant, Miggs Perez July 3, 2023 \"Olly Olly Organ Free\" Jacob Fleisher, Gabe Del Valle, Mike Pelensky July 4, 2023 25 \"Which Witch is Which?\" Dave Tennant, Zoë Moss, Nora Meek July 5, 2023 \"Get Off My Lawnie\" Jacob Fleisher, Charlie Jackson, Stephen Herczag July 6, 2023 26 \"Bubble Bass Reviews\" Dave Tennant, Andy Gonsalves, Miggs Perez July 24, 2023 \"Patrick's Prison Pals\" Jacob Fleisher, Gabe Del Ville, Mike Pelensky July 25, 2023 ===Season 2=== Prod. No. Title Written by Original airdate 27 \"The Patrick Show Cashes In\" Dave Tennant, Zoë Moss, Nora Meek July 26, 2023 \"The Star Games\" Jacob Fleisher, Charlie Jackson, Stephen Herczeg July 27, 2023 28 \"Super Stars\" Jacob Fleisher, Andy Gonsalves, Miggs Perez November 6, 2023 \"Now Museum, Now You Don't\" Dave Tennant, Gabe Del Valle, Mike Pelensky November 7, 2023 29 \"10 & 1 Toilets\" Jacob Fleisher, Zoë Moss, Nora Meek November 8, 2023 \"Family Plotz\" Dave Tennant, Charlie Jackson, Stephen Herczeg November 9, 2023 30 \"The Wrath of Shmandor\" Jacob Fleisher, Andy Gonsalves, Miggs Perez November 13, 2023 \"There Goes the Neighborhood\" Dave Tennant, Gabe Del Valle, Mike Pelensky November 14, 2023 ==References== Category:Nickelodeon television series Category:American children's television series Category:2020s American comedy television series Category:Animated television series Category:English-language television programs Category:Mockumentaries Category:SpongeBob SquarePants Category:2021 American television series debuts",
 "title": "The Patrick Star Show"
}