{
 "id": "864876",
 "text": "Töregene Khatun (also Turakina, , ) (d. 1246) was the Great Khatun and ruler of the Mongol Empire from the death of her husband Ögedei Khan in 1241 until her oldest son Güyük Khan became the Great Khan in 1246. ==Background== Töregene was from the Naiman tribe. Her first husband was a part of the Merkit clan. Some people say that his name was Qudu (d. 1217), son of Toqto'a Beki of the Merkits.C.P. Atwood Encyclopedia of Mongolia and the Mongol Empire, p. 544 However, Rashid-al-Din Hamadani said her first husband was Dayir Usun of the Merkits. When Genghis conquered the Merkits in 1204, he gave Töregene to Ögedei to be his second wife. Ögedei's first wife Boraqchin had no sons, but Töregene gave birth to five sons, Güyük, Kötän, Köchü, Qarachar, and Qashi (father of Kaidu). She became more important than all of Ögedei's wives and slowly became a powerful person in court. But Töregene still did not like Ögedei's officials and the rules of the government being managed more by the ruler and lowering tax. Töregene paid for the reprinting of books of Taoist philosophy in North China.Australian National University. Institute of Advanced Studies East Asian History, p. 75 Through the power of Töregene, Ögedei made Abd-ur-Rahman a tax farmer in China. == Great Khatun of the Mongol Empire == After Ögedei died in 1241, Möge Khatun took power. She was one of Ögedei's widows and she had been one of Genghis Khan's wives before that. With the help of Chagatai and her sons, Töregene took complete power as regent in spring 1242 as Great Khatun.The journey of William of Rubruck to the eastern parts of the world, 1253–55, p. 62 She removed her husband's ministers and made new people she liked ministers. The most important minister was Fatima, a Tajik or Persian woman who was a prisoner of war from the Middle Eastern campaign. She was a Shiite Muslim who was moved from the city of Meshed to Mongolia even though she did not want to. She tried to put some of Ögedei's main officials in jail. Her husband's chief secretary, Chinqai, and another important person in the government, Mahmud Yalavach, went to her son Koden in North China while an important Turkestani, Masud Begh, ran to Batu Khan in Russia. In Iran, Töregene put Korguz in jail and handed over him to the wife of Chagatai, whose husband was dead, and Korguz he had not agreed with Chagati. The Chagatayid Khan Qara Hülëgü killed him. Töregene made Arghun Aqa of the Oirat as governor in Persia. She made Abd-ur-Rahman ruler in North China, and Fatima became even more powerful at the Mongol court. This made the rich Mongols into ask for a lot of money for their work. == Role in Mongol conquests == Töregene was friends with Ögedei's commanders in China. The fighting between the Mongols and the Song soldiers was in Chengdu. Töregene sent people to make peace, but Song put them in prison.Jeremiah Curtin The Mongols A History, p. 343 The Mongols put Hangzhou in prison and attacked Sichuan in 1242. She then told Zhang Rou and Chagaan (Tsagaan) to attack the Song Dynasty. When they attacked the Song territory, the Song court sent somebody to ceasefire. Chagaan and Zhang Rou went north back to their homes after the Mongols accepted the term.J. Bor Mongol hiiged Eurasiin diplomat shastir, vol. II, p. 224 During the reign of Ögedei, the Seljuks of Rum wanted friendship and gave money Chormaqan every year.C.P. Atwood Encyclopedia of Mongolia and the Mongol Empire, p. 555 Under Kaykhusraw II, however, the Mongols began to pressure the Sultan to go to Mongolia himself, give people whom he put in jail, and accept a Mongol darughachi. Mongol raids began in 1240. The Seljuk Sultan Kaykhusraw made a large army to meet them. The king of Cilician Armenia was required to give 1400 lances and the Greek Emperor of Nicaea 400 lances. Both rulers met the Sultan in Kayseri to talk. The Grand Komnenos of Trebizond gave 200 lances, while the young Ayyubid prince of Aleppo gave 1000 horsemen.Simon de Saint-Quentin, Histoire des Tartares, xxxi. 143–44.In addition to these, Kaykhusraw told the Seljuq army and Turkmen cavalry, though both had been weakened by the Baba Ishak rebellion. However, Baiju and his Georgian helpers defeated them at the battle of Köse Dağ in 1243. After that battle, the Sultanate of Rum, the Empire of Trebizond and the Lesser Armenia quickly declared their allegiance one by one to the Mongol Empire ruled by Töregene Khatun. The Mongol troops under general Baiju probed the forces of Abbasid Iraq and Ayubid ruled Syria in 1244–46. == Güyük's coronation == She was a powerful person in a society that was usually led only by men. She was able to control the many powers within the empire, and even within the family of Genghis Khan, over a 5-year period in which she not only ruled the empire, but helped her son Güyük as Great Khan become ruler. During Töregene's reign, people arrived from the far away parts of the empire to her capital at Karakorum or to her moving imperial camp. The Seljuk sultan came from Turkey—as did people from the Caliph of Abbasid in Baghdad. So did two people wanting the throne of Georgia: David Ulu, the son of the old king that could not legally take the throne—and David Narin, the son of the same king who could. The highest-ranking European was Alexander Nevsky's father, Grand Prince Yaroslav Vsevolodovich of Vladimir and Suzdal, who died just after eating dinner with Töregene Khatun. The Mongols practiced polygamy, meaning they married many people each. Ögedei Khan's favorite son was Kochu, who was his son but not Töregene's, rather another wife of his. He had chosen Kochu's son Shiremun to become ruler after him because his father suddenly died in China in 1237. But some sources say that Kochu was a son of Töregene and she did not want Shiremun to succeed. Töregene did not agree the choice in favor of Güyük, but despite the huge influence she had on him, she was not able to make Ögedei to change his mind. She did what she wanted through clever planning and trickery. When the lesser Khans made her regent after her husband died, she gave her favorite people high positions in the imperial household and started what was a good plan to make her son Güyük become ruler. When Temüge Otchigen, the youngest brother of Genghis, made an army and tried to take the throne, though he did not, Güyük quickly came to meet him. Töregene managed to keep a Kurultai from happening until it was sure her son Güyük was liked by the most people. Töregene gave power onto her son Güyük in 1246. She retired west to Ögedei's appanage on the Emil. Despite her planning in making sure Güyük's election as Khagan, the relationship between Töregene and her son eventually became bad. Güyük's brother Koden said Fatima was using witchcraft to make him sick; when Koden died a few months later, Güyük continuously asked that his mother let Fatima be killed. Töregene threatened her son Güyük that she would commit suicide to spite him. Güyük's men took Fatima and killed her by sewing up her nose, mouth and ears and drowning her; People who helped or liked Töregene in the imperial household were also killed. After 18 months of Fatima's death, Töregene herself died because of unknown reasons. She was later called Empress Zhaoci () after her death by Kublai in 1265-1266. == In popular media == * She was portrayed by Cai Wenyan in The Legend of Kublai Khan (2013) == References == === Citations === === Sources === *Jack Weatherford – The Women Who Ruled the Mongol Empire (dead link) * Jack Weatherford. The Secret History of the Mongol Queens: How the Daughters of Genghis Khan Rescued His Empire (Crown; 2010). Category:Mongol emperors Category:1246 deaths",
 "title": "Töregene Khatun"
}