{
 "id": "86502",
 "text": "The Shri Yantra or Sri Chakra of Tripura Sundari is a yantra or mandala formed by nine interlocking triangles surrounding a dot in the center called a bindu. Four of these triangles are upright representing Shiva or the Masculine. Five of these triangles are inverted representing Shakti or the Feminine. Because it is composed of nine triangles, it is also known as the navayoni chakra. Together the nine triangles are interlaced in such a way as to form 43 smaller triangles in a web symbolic of the entire cosmos or a womb symbolic of creation. Together they express Advaita-ism or non-duality. This is surrounded by a lotus of eight petals, a lotus of sixteen petals, and an earthsquare resembling a temple with four doors. The Shri Chakra is also known as the nava chakra because it can also be seen as having nine levels. Each level corresponds to a mudra, a yogini, and a specific form of the deity Tripura Sundari along with her mantra. These levels starting from the outside or bottom layer are: #Trailokya Mohana, a square of three lines with four portals #Sarvasa Paripuraka, a sixteen-petal lotus #Sarva Sankshobahana, an eight- petal lotus #Sarva Saubhagyadayaka, composed of fourteen small triangles #Sarvarthasadhaka, composed of ten small triangles #Sarva Rakshakara, composed of ten small triangles #Sarva Rohahara, composed of eight small triangles #Sarva siddhi prada, composed of 1 small triangle #Sarvanandamaya, composed of a point or bindu ==TEMPLES== 1.Shri Yantra Temple, This temple is most popular and ancient . 2.Shri Narmadeshwar Shri Laxmi Yantra Mandir in this temple Siddha Shri is given by the priest to devotees take to home and prey .this temple is in Rajpipla city, JIOR pati, Kumbheshwar street, at the bank of River Narmada . Official Website:- Shri Narmadeshwar Shri Laxmi Yantra Mandir Official Website ==References== ==Other websites== *Lalita Tripurasundari, the Red Goddess *Shri Narmadeshwar Shri Laxmi Yantra Mandir *Sri Yantra *How to Draw a Sri Chakra *How to draw Sri Yantra Category:Hinduism Category:Meditation",
 "title": "Sri Yantra"
}