{
 "id": "86524",
 "text": "John Pierpont Morgan (April 17, 1837 – March 31, 1913) was an American banker and art collector. He became one of the richest men of his era. He founded the bank now called JPMorgan Chase, one of the oldest banks in the world today. ==Childhood== J.P. Morgan was thought of as intelligent, he focused his attention in mathematics in preparation for employment in commerce. In 1852, when Morgan was 15 years old, he had rheumatic fever. After recovery he was deformed. J.P. Morgan was aloof and refused to have his photograph taken; all of his professional portraits were retouched.findagrave.comKennedy, David M., and Lizabeth Cohen. The American Pageant. Houghton Mifflin Company: Boston, 2006. p541. ==Career== ===Beginnings=== When J.P. Morgan reached the age of 20, he became a banker in his father’s London office and later went to Duncan, Sherman & Company in New York City. He excelled in banking and partnered with a lot of other companies. J.P. Morgan bought businesses, and was a hands on leader. He followed the process of reorganizing them known then as “Morganization”. He renamed his company to J.P Morgan & Company in 1895. At the time it became one of the most powerful banks in the world.Zinn, Howard. A People's History of the United States. New York: Perennial, 2003. p.255 ===Later on=== J.P. Morgan took control of the railroad companies. He also financed and reorganized railroads all in the US. He later purchased the Ley Land Line of Atlantic Steamships and other boat lines, which included the White Star Line, builder of the RMS Titanic. He joined several steel companies together to make the United States Steel Corporation.Garraty, (1960) ====The Panic of 1893==== During the Panic of 1893, when a shortage of the gold caused a devaluation of the Dollar, the US president Grover Cleveland asked J.P. Morgan to loan $65 million in gold to the US Treasury. J.P. lent the gold, \"saving\" the Treasury and the Dollar. ==Enemies== Morgan’s enemies attacked him for his loan terms on gold that was lent to the US government during the 1895 crisis, for the way he solved the panic of 1907, for hurting the Hartfort RR company by causing money problems, and turning the US steel corporation into a monopoly (by trying to take control of the making of bridges, ships, RR cars, rails, wire, nails, and other markets.). ==Legacy (what he is known for)== JP Morgan was one of the richest men in the world (if he wanted to, he and all his partner companies could have bought all the land owned by all of the 22 US states west of the Mississippi River at that time (worth about $22.245 billion)). He did this through buying many companies and taking them over, usually becoming monopolies. The JP Morgan Company still runs today under the name of JPMorgan Chase owned by stockholders. Today, it is one of the oldest banks in the world and a leading bank in the world. ==References== * Atwood, Albert W. and Erickson, Erling A. \"Morgan, John Pierpont, (Apr. 17, 1837 - Mar. 31, 1913),\" in Dictionary of American Biography, Volume 7 (1934) *Auchincloss, Louis. J.P. Morgan : The Financier as Collector Harry N. Abrams, Inc. (1990) *Brandeis, Louis D. Other People's Money and How the Bankers Use It. Ed. Melvin I. Urofsky. New York: Bedford Books, 1995. *Bryman Jeremy, J. P. Morgan: Banker to a Growing Nation : Morgan Reynolds Publishing (2001) * Carosso, Vincent P. The Morgans: Private International Bankers, 1854-1913. Harvard U. Press, 1987. 888 pp. * Carosso, Vincent P. Investment Banking in America: A History Harvard University Press (1970) *Chernow, Ron. The House of Morgan: An American Banking Dynasty and the Rise of Modern Finance, (2001) * Fraser, Steve. Every Man a Speculator: A History of Wall Street in American Life HarperCollins (2005) * Garraty, John A. Right-Hand Man: The Life of George W. Perkins. (1960) * Geisst; Charles R. Wall Street: A History from Its Beginnings to the Fall of Enron. Oxford University Press. 2004. online edition * John Moody; The Masters of Capital: A Chronicle of Wall Street Yale University Press, (1921) online edition * Morris, Charles R. The Tycoons: How Andrew Carnegie, John D. Rockefeller, Jay Gould, and J. P. Morgan Invented the American Supereconomy (2005) * Strouse, Jean. Morgan: American Financier. Random House, 1999. 796 pp. Category:1837 births Category:1913 deaths Category:Businesspeople from Hartford, Connecticut",
 "title": "J. P. Morgan"
}