{
 "id": "865370",
 "text": "Human rights apply to everyone, they also apply to children. Children also have other rights, which are related to them being vulnerable while they grow up. These rights are usually called Children's rights. They are provided by different treaties, such as the Hague Protection of Minors Convention, of 1961. Most countries have ratified these treaties. This means that they are part of international customary law: They apply to all children, in all countries; even in those countries which haven't ratified the treaties. ==Types== ===UN classifications=== United Nations educational guides for children classify the rights outlined in the Convention on the Rights of the Child as the \"3 Ps\": Provision, Protection, and Participation. They are: * Provision: Children have the right to an adequate standard of living, health care, education and services, and to play and recreation. These include a balanced diet, a warm bed to sleep in, and access to schooling. * Protection: Children have the right to protection from abuse, neglect, exploitation and discrimination. This includes the right to safe places for children to play; constructive child rearing behavior. It is also about fact that children are still developing, and their abililties grow better when they grow older. * Participation: Children have the right to take part in communities and have programs and services for themselves. This includes children's involvement in libraries and community programs, youth voice activities, and involving children as decision-makers.(1997) \"Children's rights in the Canadian context\", Interchange. 8(1–2). Springer. ===CRIN categories=== In a similar fashion, the Child Rights International Network (CRIN) categorizes rights into two groups:\"A-Z of Children's Rights\", Children's Rights Information Network. Retrieved 2/23/08.Freeman, M. (2000) \"The Future of Children's Rights,\" Children & Society. 14(4) p 277-93. * Economic, social and cultural rights are about basic human needs: food, shelter, education, health care, and paid work are part of this group. The rights to education, adequate housing, food, water, the highest attainable standard of health, the right to work and rights at work, as well as the cultural rights of minorities and native peoples are also included. * Environmental, cultural and developmental rights are sometimes called \"third generation rights\": They include the right to live in safe and healthy environments and that groups of people have the right to cultural, political, and economic development. ===Others=== Amnesty International openly advocates four particular children's rights, including the end to children being imprisoned without parole, an end to the recruitment of children as soldiers, ending the death penalty for people under 21, and raising awareness of human rights in the classroom. Human Rights Watch, an international advocacy organization, includes child labour, juvenile justice, orphans and abandoned children, refugees, street children and corporal punishment. ==Individual rights== Scholars usually look at individual rights. The following rights \"allow children to grow up healthy and free\":Calkins, C.F. (1972) \"Reviewed Work: Children's Rights: Toward the Liberation of the Child by Paul Adams\", Peabody Journal of Education. 49(4). p. 327. * Freedom of speech * Freedom of thought * Freedom from fear * Freedom of choice and the right to make decisions * Ownership over one's body ==Related pages== *UNICEF *Universal Children's Day ==References== Rights Category:Human rights",
 "title": "Children's rights"
}