{
 "id": "865360",
 "text": "Hurricane Grace was a very strong Category 3 Atlantic hurricane in the western Bay of Campeche. Grace intensified into a major hurricane on the evening of August 21, 2021. The storm was predicted to move into eastern Mexico near Veracruz state late Friday night August 20 or early Saturday morning August 21. Before moving toward Mexico, Grace came ashore near Barahona in the southwest Dominican Republic as a strong tropical depression in the early afternoon of Monday, August 16. The storm brushed Haiti the following day. This interfered with the rescue operation after the then-recent earthquake that struck the country three days before. Just before 2am Atlantic Standard Time on August 17, Grace intensified back to a tropical storm Grace made its first Mexican strike in Quintana Roo near Tulum on the Mexican Yucat치n Peninsula on the morning of Thursday, August 19 with winds near eighty miles per hour around 4:45 am Central Daylight Time. This was after a hurricane- related flight finding winds in the storm just beyond tropical storm-force. Eleven hours after that classification, Grace began moving over Jamaica. It struck at Annotta Bay in Saint Mary Parish on the northeastern region of that island in the late morning of August 17. The winds were near 50 miles per hour when the storm struck the island. When the storm traveled into the Caribbean late on August 17, it began getting stronger. Grace rapidly organized while it passed south of the Cayman Islands. The following day, August 18, Grace was classified as a Category 1 hurricane right before 11am Eastern Daylight Time that Wednesday morning. ==Related pages== *2021 Haiti earthquake - A magnitude 7.2 earthquake that occurred on Saturday, August 14 - three days before Grace struck near the area as a weak tropical storm *Hurricane Isidore (2002) - A costly hurricane that struck near the tip of the Yucat치n Peninsula as the most intense Category 3 Atlantic hurricane on record (934 mb). *Hurricanes Emily and Wilma (2005) - Two Category 5 hurricanes that directly impacted the Yucat치n Peninsula. However, neither struck land at Category 5 status. *Hurricane Dean (2007) - An extremely powerful hurricane that made took a very similar track to Grace. The storm struck land near the same areas as a strong Category 5 hurricane. *Hurricane Karl (2010) - A major hurricane that had a similar track and affected similar areas. *Hurricanes Gamma, Delta and Zeta (2020) - A series of three hurricanes in October 2020 that struck land as Category 1 hurricanes in the northern Yucat치n Peninsula. ==References== Category:2021 Atlantic hurricane season Category:Hurricanes in the Dominican Republic Category:Hurricanes in Mexico Category:Hurricanes in Jamaica Category:Hurricanes in Haiti Category:Category 3 Atlantic hurricanes Category:August 2021 events Category:2021 disasters",
 "title": "Hurricane Grace"
}