{
 "id": "865451",
 "text": "Hurricane Henri (pronounced ohn-REE) was an Atlantic hurricane in August 2021. The hurricane threatened Long Island in southeastern New York State and southern New England. Henri threatened being the first hurricane to move across Long Island since Hurricane Gloria in September 1985 and into New England since Hurricane Bob just over thirty years earlier. Henri was first classified by the National Hurricane Center as Tropical Depression Eight around 11:00 pm Atlantic Standard Time on August 16. Later that day, the depression strengthened into Tropical Storm Henri. Tropical storm and hurricane notices were put into effect over Long Island, northeastern New Jersey and southern New England. The first such notices extended from Newark and New York City eastward to near Martha's Vineyard and Woods Hole on Cape Cod in southeast Massachusetts. The state governors of Massachusetts, Rhode Island, New York and Connecticut put states of emergency into effect in advance of the hurricane moving into these areas. The storm was reminiscent of Hurricane Sandy almost nine years earlier (Sandy struck land near Brigantine and Atlantic City in southeast New Jersey). The winds, however, extended almost a thousand miles from the storm's center. Hurricane-force winds from Sandy also affected the New York City and Long Island areas. Henri was forecast to strengthen before moving across Long Island and into New England on August 22. ==Related pages== *Hurricane Carol (1954) *Hurricane Donna (1960) *Hurricane Gloria (1985) *Hurricane Bob (1991) - Took similar track and struck New England thirty years before Henri *Tropical Storm Hermine (2004) - Took a similar track *Hurricane Irene (2011) *Hurricane Sandy (2012) ==References== Category:Category 1 Atlantic hurricanes Category:2021 Atlantic hurricane season Category:Natural disasters in the United States Category:Hurricanes in New York (state) Category:Hurricanes in New England Category:August 2021 events Category:2021 in the United States Category:2020s in New York (state)",
 "title": "Hurricane Henri (2021)"
}