{
 "id": "865410",
 "text": "Thomas Georg John Tugendhat (born 27 June 1973) is a British Conservative Party politician. He was the Chairman of the Foreign Affairs Committee from 2017 to 2022. He has been the Member of Parliament (MP) for Tonbridge and Malling since 2015.Tonbridge and Malling (UK Parliament constituency) profile, bbc.co.uk; accessed 16 August 2016. Tugendhat worked in the British Army until 2013. In September 2022, he became the Minister of State for Security in the Liz Truss government. ==Early life and education== He is the nephew of another Conservative politician, Christopher Tugendhat, Baron Tugendhat. After going to St Paul's School, London, Tugendhat was educated on Theology at the University of Bristol. He then did a Masters in Islamic studies at Gonville and Caius College, Cambridge. He learnt Arabic in Yemen. Tugendhat holds both British and French citizenship. His wife is a French judge, and his father-in- law is a French foreign affairs worker. Tugendhat is a Catholic. He has Jewish ancestry.https://blogs.timesofisrael.com/my-name-teaches-me-old-hate-is-still- alive/ https://www.kentonline.co.uk/malling/news/mp-reveals-he-suffered- antisemitism-during-election-campaign-218416/ ==Military career== On 6 July 2003, Tugendhat joined the Territorial Army branch of British Army. He joined as a second lieutenant. He moved to the Intelligence Corps on 29 July 2003. He was promoted to lieutenant on 16 July 2005. He was made captain on 1 April 2007 and to major on 1 January 2010. Tugendhat served in the Iraq War and the War in Afghanistan. He helped the Foreign Office in Afghanistan. Tugendhat helped set up the National Security Council of Afghanistan and the government in Helmand Province. ==Political career== Tugendhat was elected as the Member of Parliament for Tonbridge and Malling. Tonbridge and Malling is a safe Conservative seat in Kent. He was elected in the 2015 General Election. In October 2015, Tugendhat said Iran gave guns to Iraq and Afghanistan. He said they helped terrorists. Tugendhat supported remaining in the European Union in the 2016 referendum. He supported the exit agreement that Theresa May's government agreed on. Tugendhat is a supporter of Israel. He opposed the United Nations Security Council. In January 2017, he wrote that the Israeli–Palestinian conflict \"doesn't matter\". He said that it shouldn't be important than other disputed areas. On 21 May 2018, the Foreign Affairs Committee published a report on Russian corruption and the UK. This got attention from President Vladimir Putin and his allies. to launder assets through London, and called on the UK Government to \"show stronger political leadership in ending the flow of dirty money into the UK\". The report criticised the law firm Linklaters. They did this because Linklaters didn't want to give evidence to the committee. On 29 May 2018, Tugendhat showed his views on British foreign policy in a speech at the Royal United Services Institute. He supported giving the Foreign and Commonwealth Office more powers. Tugendhat went to the 30 May–2 June 2019 Bilderberg Meeting in Montreux, Switzerland. After the December 2019 general election, Tugendhat said the antisemitism he had experienced during the campaign was bad. After the Fall of Kabul in August 2021, Tugendhat said the event in The Times as Britain's \"biggest foreign policy disaster since Suez\". On 18 August, Tugendhat was applauded after giving a powerful speech in the House of Commons. He spoke about his past in the military. He said that he felt that this was defeat. ===China=== In April 2020, Tugendhat founded the China Research Group alongside fellow Conservative MP Neil O'Brien. Tugendhat was one of five MPs to be punished by China for spreading what it called \"lies and disinformation\" about the country. He was banned from going to China, Hong Kong and Macau. ===2022 Conservative leadership race=== In July 2022, Tugendhat announced his candidacy for Leader of the Conservative Party to replace Boris Johnson in the leadership election. However, he was eliminated in the third round of voting on 18 July 2022. ===2024 Conservative leadership race=== On 24 July 2024, Tugendhat announced he was running in the 2024 leadership election to be the new Conservative Party leader and Leader of the Opposition. He was eliminated from the race during the third ballot of voting on 8 October 2024. ==References== Category:1973 births Category:Living people Category:British Army officers Category:Conservative Party (UK) MPs Category:UK MPs 2019–2024 Category:UK MPs 2015–2017 Category:UK MPs 2017–2019 Category:Members of the Order of the British Empire Category:Alumni of the University of Bristol Category:Members of the Cabinet of the United Kingdom Category:UK MPs 2024–present",
 "title": "Tom Tugendhat"
}