{
 "id": "865551",
 "text": "Frances Ruth Shand Kydd (later Spencer; née Roche; 20 January 1936 – 3 June 2004) was the mother of Diana, Princess of Wales. Shand Kydd was the maternal grandmother for Prince William, Duke of Cambridge and Prince Harry, Duke of Sussex. The earlier became the second in the line of succession to the British throne. The latter was the sixth in line of succession. ==Marriage and issue== On 1 June 1954, Shand Kydd married John Spencer, Viscount Althorp (later the 8th Earl Spencer), at Westminster Abbey. Queen Elizabeth II and other members of the royal family attended the wedding ceremony. She was 18 years old and became the youngest woman wed in Westminster Abbey in the last five decades. They had five children: *Lady Sarah McCorquodale (born 19 March 1955). She married Neil Edmund McCorquodale. He was a second cousin once removed of Raine, Countess Spencer. *Jane Fellowes, Baroness Fellowes (born 11 February 1957). She married Robert Fellowes, Baron Fellowes. He was then the Private Secretary to the Sovereign. *The Honourable John Spencer. He died 10 hours after his birth on 12 January 1960. *Diana, Princess of Wales (1 July 1961 – 31 August 1997). She was the first wife of Charles, Prince of Wales. *Charles Spencer, 9th Earl Spencer (born 20 May 1964). He married his first wife Victoria Lockwood. His second wife was Caroline Freud (née Hutton and former wife of Matthew Freud). His third wife was Karen Villeneuve. ==Death== Shand Kydd was born in the Sandringham village of Norfolk County in eastern England. She died almost five months after her 68th birth following long illnesses. They included Parkinson's disease and brain cancer. Shand Kydd was inside her home in Seil, one of the Slate Islands in Scotland when she died. ==References== Category:Deaths from Parkinson's disease Category:Deaths from brain cancer Category:Cancer deaths in Scotland Category:1936 births Category:2004 deaths Category:Scottish nobility",
 "title": "Frances Shand Kydd"
}