{
 "id": "865680",
 "text": "Puppet History is a YouTube show by Ryan Bergara, Steven Lim, and Shane Madej in their company, Watcher. Bergara, Lim, and Madej used to work with BuzzFeed. Bergara and Madej did BuzzFeed Unsolved. The show started in January 2020. On Puppet History, a colorful puppet historian leads a game show, a contest. Each episode is about one strange person or event from history. The two people in the contest answer questions, and the Professor gives them points. ==Format== All the history on Puppet History is real. > \"Welcome one and all to Puppet History. Today we take an ever-widening look > into the heavy heavy book we call history while our guests ruthlessly > compete for the coveted title of History Master! I am obviously your beloved > host, the Professor!\" - the Professor at the beginning of most episodes The show begins with the Professor, a blue puppet, saying hello to the guests from a puppet theater stage. The Professor then tells a story about history. He stops every few minutes to ask the two guests a question, sometimes multiple choice. The guests write down their answers on small whiteboards. Then the professor says \"Let's see the answer through the magic of theater!\" and paper cutouts of people from history act out the answer to the question. Then the professor gives \"jelly beans\" to whoever had the true answer. Each jelly bean is worth one point. The Professor encourages the guests to speak and tell jokes. Sometimes, he will give a \"rotten jelly bean\" to whoever makes a bad joke. The rotten jelly bean is worth negative one point. The Professor gives the special guest extra points. This way, Ryan Bergara almost always loses. (\"Stealing The World’s Most Expensive Necklace\" ended in a tie.) Before the end of the show, the Professor leaves to \"tally the score\" and another puppet comes onto the stage and sings a song about the historical event. The show always ends with the \"coveted cup and title of History Master\" almost always going to the guest who is not Ryan Bergara. The cup is a small plastic trophy with real jelly bean candy or another small prize in it. ==Characters== *The Professor, a blue puppet voiced by Shane Madej *Ryan Bergara, as himself *Another contestant *At least one other puppet, also voiced by Shane Madej ==Episodes== In season one, Ryan Bergara and the other contestant sat in chairs in the same room as the puppet theater. In seasons two and three, the show was named as Puppet History: Online University and both contestants appeared through computers. This was because of the coronavirus pandemic. Each episode has about 1 million views. Season Episode Guest Release date 1 Life During the Black Death Pandemic Steven Lim January 10, 2020 1 Stealing the World's Most Expensive Necklace Kate Peterman February 27, 2020 1 Surviving the Titanic: History's Luckiest Woman Jenny Lorenzo April 10, 2020 1 The Dancing Plague Jermaine Fowler May 22, 2020 2 How America's First Female Detective Saved Abe Lincoln Kate Peterman August 14, 2020 2 The Terrifying Eruption of Mt. Vesuvius Matt Real August 21, 2020 2 Hatshepsut: The Forgotten Pharaoh Ryann Graham August 28, 2020 2 The Disastrous 1904 Olympic Marathon Kristin Chirico September 4, 2020 2 Isaac Newton's Nemesis Keith Habersberger September 11, 2020 2 The World's Greatest/Rudest Samurai Garrick Bernard September 18, 2020 2 Policarpa: The Revolutionary Teen Spy Curly Velasquez September 25, 2020 2 The Grisly Journey of the Donner Party Joyce Louis-Jean October 2, 2020 Special The Story of St. Nicholas Kate Peterman December 25, 2020 3 The Beast of Gevaudan Sarah Rubin March 12, 2021 3 The War of the Golden Stool Kate Peterman March 26, 2021 3 Ziryab: The World's First Rock Star Zach Kornfeld April 2, 2021 3 The Affair of the Poisons Garrick Bernard April 9, 2021 3 Ching Shih: The Pirate Queen Joyce Louis-Jean April 16, 2021 3 The Great Molasses Flood Garrett Watts April 23, 2021 4 The Great Emu War Kate Peterman August 28, 2021 4 Mansa Musa: The Richest Man in History Ify Nwadiwe September 4, 2021 4 America vs. Smallpox: How Vaccines Saved the Nation Jermaine Fowler September 11, 2021 4 José Rizal: The Philippines’ Reluctant Revolutionary Josh Weinstein September 17, 2021 4 The Bloody Revenge of Saint Olga of Kiev Selorm Kploanyi September 24, 2021 4 The Demonic Possessions of Loudun Sara Rubin October 3, 2021 Special The Puppet History Holiday Spectacular! December 24, 2021 5 How Hippo Meat Almost Saved America Sara Rubin November 11, 2022 5 The Defenestrations of Prague Brian David Gilbert November 18, 2022 5 The Vietnamese Sisters Who Fought An Empire Maya Murillo November 25, 2022 5 America's First Black Aviatrix Ryann Graham December 2, 2022 5 The Bloody Life of England's Fastest Surgeon Aria Inthavong December 9, 2022 5 The Dreadful Demise of the Dinosaurs Garrett Watts Joyce Louis-Jean December 16, 2022 6 The Unkillable Weirdo Who Invented The Saxophone Steven Lim July 7, 2023 6 The Concubine Who Killed Her Way To The Throne Joyce Louis-Jean July 14, 2023 6 The Fiery Sports Riot That Nearly Destroyed Constantinople Ricky Wang July 21, 2023 6 The Scandalous Life of France's Bisexual Opera Icon Kwesi James July 28, 2023 6 How a Pope's Nepobaby Became One of the Worst Tyrants in History Zach Kornfeld August 4, 2023 6 The Deadly Race To The South Pole Sara Rubin August 11, 2023 7 Pythagoras' Weird Math Cult Aria Inthavong February 7, 2025 ==Professor== The Professor is a small hand puppet with blue fur and a white nose. He usually wears a safari hat and jacket and carries a satchel. He wears glasses and a bow tie. Sometimes, he wears other costumes. For example, in the episode about Ching Shih, he wore a pirate hat. The Professor sometimes talks about his life through wrong answers to the multiple-choice questions. These answers say the Professor found a magic lamp that had a magical genie inside it. He told the genie to turn a \"seemingly ordinary household object\" into a secret time machine. The genie did so, but was also \"a total prick about it.\" In the flashbacks, the genie is played by Shane Madej. In other episodes, the Professor mentions visiting the past and meeting people from history. Sometimes he talks about the genie chasing him. For example, in \"The Great Molasses Flood,\" the Professor gets stuck in the molasses and the genie almost catches him. But he reaches into his satchel for the secret time machine and gets away. In the episode \"The Affair of the Poisons,\" Ryan asks the Professor \"Do you have a family? Or did you have any family?\" The Professor asks \"Did I?\" and the audience hears a young child saying \"Papá, I want a jellybean.\" In the last episode of Season 4, we see the Professor go back in time to the Cretaceous period. A dinosaur eats him. Words on the screen tell the audience that the Professor is really dead. Season 5 of Puppet History began in November 2022. During this season, the real Professor is reborn in the Cretaceous Period, where he meets some dinosaurs. The host of Puppet History was an impostor: an evil hologram pretended to be the Professor. The hologram let Ryan Bergara win every time. Bergara's prize was always skin lotion. In the second to last episode of Season 5, the hologram ties Bergara to a chair and tells him he wants to steal his skin. Then, he says, he can become like a human, rub the genie lamp, and wish for everyone on Earth to be turned into puppets. Bergara escapes, takes the lamp, and saves the real Professor and his friends. ==References== ==Other websites== *IMDB *Official YouTube channel Category:2020 television series debuts",
 "title": "Puppet History"
}