{
 "id": "865920",
 "text": "Diabetes mellitus in dogs happens when the beta cells in the pancreas stop producing insulin (leading to type 1 diabetes) or produce enough insulin though cells improperly use it (leading to type 2 diabetes). Diabetes in dogs can be treated. It doesn't need to make the life expectancies of dogs shorter than usual. If not treated, however, the condition could lead to cataracts, malnutrition, diabetic ketoacidosis, dehydration and possibly death. Diabetes mostly affects middle-aged and older dogs. There are, however, juvenile cases. The typical dog with diabetes is overweight or obese and middle-aged. Females are affected almost three times more often than male dogs. But there are arguments about whether or not neutering male dogs may increase the risks of developing diabetes. Some data mention that male dogs' risks of becoming obese double or triple after they are neutered. Diabetes is commonly split into two types: type 1 and type 2. Type 1 diabetes (previously called \"juvenile diabetes\") happens when the beta cells of the pancreas are either destroyed or severely damaged. The condition, in the past, was also called \"insulin- dependent diabetes\". That means insulin injections must replace the insulin the pancreas is no longer capable of producing for the body's needs. Type 1 is the most common form of diabetes and affects approximately 0.34% of dogs. Type 2 diabetes does develop in dogs. However, this form is not as common as type 1. Because of this, there is no possibility the permanently damaged pancreatic beta cells could re-activate to bring about a remission (meaning no evidence of the disease) as may be possible with some feline diabetes cases. In cats, the usual type of diabetes is type 2. Gestational diabetes does happen in dogs. The condition, though, does not happen in dogs as often as for human beings. ==Genetic susceptibility of certain breeds== This list of risk factors for canine diabetes is taken from the genetic breed study. This study was published in 2007. The \"neutral risk\" category should be taken for being not enough evidence that the dog breed genetically shows a high, moderate, or a low risk for the disease. All risk information is based only on discovered genetic factors. High risk *Cairn Terrier *Samoyed Moderate risk *Bichon Frise *Border Collie *Border Terrier *Collie *Dachshund *English Setter *Poodle *Schnauzer *Yorkshire Terrier Neutral risk *Cavalier King Charles Spaniel *Cocker Spaniel *Doberman *Jack Russell Terrier *Labrador Retriever *Mixed Breed *Rottweiler *West Highland Terrier Low risk *Boxer *English Springer Spaniel *German Shepherd *Golden Retriever *Staffordshire Bull Terrier *Weimaraner *Welsh Springer Spaniel ==References== Category:Pets Category:Diabetes mellitus Category:Controversies",
 "title": "Diabetes in dogs"
}