{
 "id": "865978",
 "text": "The states and federal territories of Malaysia are the principal administrative divisions of Malaysia. Malaysia is a federation of 13 states (Negeri) and 3 federal territories (Wilayah Persekutuan). ==States and federal territories== 11 states and 2 federal territories are located on the Malay Peninsula, collectively called Peninsular Malaysia (Semenanjung Malaysia) or West Malaysia. 2 states are on the island of Borneo, and the remaining federal territory consists of islands offshore of Borneo; they are collectively referred to as East Malaysia or Malaysian Borneo. Out of the 13 states in Malaysia, 9 are monarchies. ===States=== Flag Emblem State Capital Royal Capital Population Total Area (km2) Licence plate prefix Phone area code Abbreviation ISO FIPS HDI Region Head of state Head of government Johor Johor Bahru Muar 3,768,200 19,210 J 07, 06 (Muar & Tangkak) JHR MY-01 MY01 0.818 Peninsular Malaysia Sultan Menteri Besar Kedah Alor Setar Anak Bukit 2,185,900 9,500 K 04 KDH MY-02 MY02 0.802 Peninsular Malaysia Sultan Menteri Besar Kelantan Kota Bharu Kubang Kerian 1,892,200 15,099 D 09 KTN MY-03 MY03 0.772 Peninsular Malaysia Sultan Menteri Besar Malacca Malacca City — 932,700 1,664 M 06 MLK MY-04 MY04 0.828 Peninsular Malaysia Yang di-Pertua Negeri (Governor) Chief Minister Negeri Sembilan Seremban Seri Menanti 1,132,100 6,686 N 06 NSN MY-05 MY05 0.822 Peninsular Malaysia Yang di-Pertuan Besar (Grand Ruler) Menteri Besar Pahang Kuantan Pekan 1,677,100 36,137 C 09, 03 (Genting Highlands), 05 (Cameron) PHG MY-06 MY06 0.797 Peninsular Malaysia Sultan Menteri Besar Penang George Town — 1,777,600 1,048 P 04 PNG MY-07 MY09 0.838 Peninsular Malaysia Yang di-Pertua Negeri (Governor) Chief Minister Perak Ipoh Kuala Kangsar 2,514,300 21,035 A 05 PRK MY-08 MY07 0.809 Peninsular Malaysia Sultan Menteri Besar Perlis Kangar Arau 254,600 821 R 04 PLS MY-09 MY08 0.799 Peninsular Malaysia Raja Menteri Besar Sabah Kota Kinabalu — 3,904,700 73,631 S 087–089 SBH MY-12 MY16 0.704 East Malaysia Yang di-Pertua Negeri (Governor) Chief Minister Sarawak Kuching — 2,818,100 124,450 Q 081–086 SWK MY-13 MY11 0.739 East Malaysia Yang di-Pertua Negeri (Governor) Chief Minister Selangor Shah Alam Klang 6,541,900 8,104 B 03 SGR MY-10 MY12 0.855 Peninsular Malaysia Sultan Menteri Besar Terengganu Kuala Terengganu Kuala Terengganu 1,250,100 13,035 T 09 TRG MY-11 MY13 0.793 Peninsular Malaysia Sultan Menteri Besar ===Federal Territories=== Flag Emblem Federal Territory Capital Population Total Area (km2) Number plate prefix Phone area code Abbreviation ISO FIPS HDI Region Head of state Head of government Kuala Lumpur Kuala Lumpur 1,778,400 243 W / V 03 KUL MY-14 0.860 Peninsular Malaysia Yang di-Pertuan Agong Mayor Labuan Victoria 99,400 91 L 087 LBN MY-15 MY15 0.778 East Malaysia Yang di- Pertuan Agong President of Labuan Corporation Putrajaya Putrajaya 105,400 49 F 03 PJY MY-16 0.877 Peninsular Malaysia Yang di-Pertuan Agong President of Putrajaya Corporation ===Restoration of Sabah and Sarawak status=== In conjunction with the celebration of Malaysia Day in 2018 under the new Pakatan Harapan (PH) government, Prime Minister Mahathir Mohamad has promised to restore Sabah and Sarawak status in the Malaysian federation in accordance with the Malaysia Agreement, changing \"their status from merely a state to an equal partner of the Malayan states\". Although the status of both entities were clearly defined in Article I, Malaysia Agreement 1963 as 'states' which shall be federated with the existing states of the Federation of Malaya. However, through the process of the amendment, the bill failed to pass following the failure to reach two-thirds majority support (148 votes) in the Parliament with only 138 agreed with the move while 59 abstained from the voting. Nevertheless, the Malaysian federal government agreed to review the 1963 agreement to remedy breaches of the treaty with the \"Special Cabinet Committee To Review the Malaysia Agreement\" and directed a Special Task Force Team (Taskforce MA63) to prepare a final report on the 1963 agreement before 31 August 2019. ==Governance== The governance of the states is divided between the federal government and the state governments, while the federal territories are directly administered by the federal government. The specific responsibilities of the federal and the state governments are listed in the Ninth Schedule of the Constitution of Malaysia. Theoretically, any matter not set out in the Ninth Schedule can be legislated on by the individual states. However, legal scholars generally view this as a \"pauper's bequest\" because of the large scope of the matters listed in the Ninth Schedule. The courts themselves have generally favoured a broad interpretation of the language of the Ninth Schedule, thus limiting the number of possible subjects not covered. The Ninth Schedule specifically lists the following matters as those that can only be legislated on by the states: land tenure, the Islamic religion, and local government.Wu, Min Aun & Hickling, R. H. (2003). Hickling's Malaysian Public Law, pp. 64–66. Petaling Jaya: Pearson Malaysia. . Nine of the peninsular states, based on historical Malay kingdoms, are known as the Malay states. Each Malay state has a hereditary ruler as titular head of state and an executive Chief Minister or Menteri Besar as politically responsible head of government. The rulers of Johor, Kedah, Kelantan, Pahang, Perak, Selangor and Terengganu are styled Sultans. Negeri Sembilan's elective ruler holds the title of Yamtuan Besar, whereas the ruler of Perlis is titled Raja. The federal head of state, the Yang di-Pertuan Agong (commonly referred to as \"King\" in English) is elected (de facto rotated) among the nine rulers to serve a 5-year term. Former British settlements and crown colonies of Penang and Malacca (both peninsular), and Sabah and Sarawak (both on Borneo) each have a titular Governor (styled Yang di-Pertua Negeri) appointed by the Yang di-Pertuan Agong and an executive Chief Minister or Ketua Menteri. Sabah and Sarawak have additional powers over their immigration controls as part of the 20-point agreement and 18-point agreement drawn up by respective states when they, together with the Federation of Malaya and Singapore, formed Malaysia. They have separate immigration policies and controls and a unique residency status. Passports are required even for Peninsular Malaysians for travelling between either state and Peninsular Malaysia, or between the two states, however those who are on social/business visits up to three months are allowed to produce a MyKad or birth certificate and obtain a special printout form in lieu of a passport. Each state has a unicameral legislature called Dewan Undangan Negeri (DUN, State Assembly). Members of DUN are elected from single- member constituencies drawn based on population. The state leader of the majority party in DUN is usually appointed Chief Minister by the Ruler or Governor. The term of DUN members is five years unless the assembly is dissolved earlier by the Ruler or Governor on the advice of the Chief Minister. Usually, DUN of the states in Peninsular Malaysia are dissolved in conjunction with the dissolution of the federal parliament, to have state elections running concurrently with the parliamentary election. However, Rulers and Governors hold discretionary powers in withholding consent to dissolve the DUN. Each state sends two senators elected by the DUN to the Dewan Negara (Senate), the upper house of the federal parliament. The Parliament of Malaysia is permitted to legislate on issues of land, Islamic religion and local government to provide for a uniform law between different states, or on the request of the state assembly concerned. The law in question must also be passed by the state assembly as well, except in the case of certain land law-related subjects. Non-Islamic issues that fall under the purview of the state may also be legislated on at the federal level for the purpose of conforming with Malaysian treaty obligations. Each state is further divided into districts, which are then divided into mukim. In Sabah and Sarawak districts are grouped into \"Divisions\". The 3 federal territories were formed for different purposes: Kuala Lumpur is the national capital, Putrajaya is the administrative centre of the federal government, and Labuan serves as an offshore financial centre. Kuala Lumpur and Putrajaya were carved out of Selangor, while Labuan was ceded by Sabah. The territories fall under the purview of the Ministry of the Federal Territories, and the Parliament of Malaysia legislates on all matters concerning the territories. Each federal territory elects representatives from single-member constituencies drawn based on population to the Dewan Rakyat (House of Representatives) of the Parliament. The Yang di-Pertuan Agong appoints senators to represent the territories in the Dewan Negara; Kuala Lumpur has two senators, while Putrajaya and Labuan each has one. The local governments for the territories varies: Kuala Lumpur is administered by the Kuala Lumpur City Hall (Dewan Bandaraya Kuala Lumpur), headed by an appointed mayor (Datuk Bandar), while Putrajaya is administered by the Putrajaya Corporation (Perbadanan Putrajaya) and Labuan by the Labuan Corporation (Perbadanan Labuan); each corporation is headed by a chairman. ==Sabah and Sarawak== The states of Sabah and Sarawak merged with the existing states of the Federation of Malaya and Singapore pursuant to the Malaysia Agreement in 1963 to form the independent state of Malaysia. Representatives from Sabah and Sarawak demanded a higher degree of autonomy as part of the bargain which were included in the 20-point agreement and 18-point agreement respectively. It has also been argued that Sabah and Sarawak have equal status to that of Malaya as a whole, however the Constitution of Malaysia have listed both these entities as merely 2 of the 13 states of Malaysia, suggesting an equal status with the states of Malaya. Sabah and Sarawak still retains a relatively higher degree of autonomy compared to the peninsular states in areas such as immigration, some control over state revenue and legislative power over land and local government. ==Singapore and Brunei== Singapore was a Malaysian state from the formation of Malaysia on 16 September 1963 until it was expelled from the Federation on 9 August 1965. During its time as a state of Malaysia, Singapore had autonomy in the areas of education and labour and was the smallest state in Malaysia by land area. Extraordinary. (G.N. 55). (1962, August 17). Singapore: [s.n.], p. 1093. (Call No.: RCLOS 959.57 SGG). Retrieved August 27, 2016. Brunei was invited to join the Federation but decided not to at the end due to several issues, such as the status of the Sultan within Malaysia, division of Bruneian oil royalties, and pressure from opposition groups which amounted to the Brunei Revolt. ==Notes== # The code MY10 is not used in FIPS 10-4 but was used for FIPS 10-3USAid Geocode (for Sabah) # Territories named in official language for both FIPS 10-4 and ISO 3166-2:MY code lists # Wilayah Persekutuan defined as the territories of Kuala Lumpur and Putrajaya. Used by FIPS only ==References== ==Other websites== * Local government in Malaysia Category:States of Malaysia",
 "title": "States and federal territories of Malaysia"
}