{
 "id": "865973",
 "text": "This is a list of cities of Malaysia. In Malaysia, there are 18 areas with city status (bandar raya) by law. However, there are also highly urbanised and populated areas that do not have city status but are sometimes referred to as cities. City status is granted to a place within a local government area. Other populated areas which do not have city status are municipalities or towns. ==Cities of Malaysia== The following is a list of places in Malaysia in order by the date they were given city status. Name State/FT Local government(s) Chartered Population Ref. George Town Penang Island City Council 1957-01-011 January 1957 708,127 Jurisdiction expanded in 2015 to encompass the entirety of Penang Island Kuala Lumpur Federal Territories Kuala Lumpur City Hall 1972-02-011 February 1972 1,588,750 Ipoh Ipoh City Council 1988-05-2727 May 1988 657,892 Kuching Kuching North City Hall Kuching South City Council 1988-08-011 August 1988 325,132 Kuching is officially made up of two local government entities Johor Bahru Johor Bahru City Council 1994-01-011 January 1994 497,067 Kota Kinabalu Kota Kinabalu City Hall 2000-02-022 February 2000 452,058 Shah Alam Shah Alam City Council 2000-10-1010 October 2000 641,306 Malacca City Melaka City Council 2003-04-1515 April 2003 484,885 Alor Setar Alor Setar City Council 2003-12-2121 December 2003 405,523 Miri Miri City Council 2005-05-2020 May 2005 234,541 Petaling Jaya Petaling Jaya City Council 2006-06-2020 June 2006 613,977 Kuala Terengganu Kuala Terengganu City Council 2008-01-011 January 2008 337,553 Iskandar Puteri Iskandar Puteri City Council 2017-11-2222 November 2017 529,074 Seberang Perai Seberang Perai City Council 2019-09-1616 September 2019 818,197 Seremban Seremban City Council 2020-01-011 January 2020 620,100 Seremban and Nilai were merged to form Seremban city. Subang Jaya Subang Jaya City Council 2020-10-2020 October 2020 708,296 Pasir Gudang Pasir Gudang City Council 2020-11-2222 November 2020 46,571 Kuantan Kuantan City Council 2021-02-2121 February 2021 427,515 ;Former city within Malaysia Name State Local government Chartered Ref. Singapore Singapore Singapore City Council 22 September 1951 Expelled from the Malaysian Federation on 9 August 1965 ===Subsequent cities=== The royal charters for Kuala Lumpur, Kuching, Kota Kinabalu, Shah Alam, Malacca City, Alor Setar and Miri were from the Malaysian head of state, the Yang di-Pertuan Agong, while Ipoh, Johor Bahru, Iskandar Puteri and Subang Jaya were granted by their respective state sultans. Malacca City was declared a \"historical city\" prior to being granted city status in 2003. Kuala Lumpur, the largest city, is the national capital and a federal territory. But as of 2012, most government ministries have relocated to the new administrative capital of Putrajaya. ===Criteria=== Among the latest (2008) basic criteria for city status on a local government is that it has a minimum population of 500,000 and an annual income of not less than RM 100 million. == Locations of cities == == Population == Kuala Lumpur is by far the largest urban area. It is also the largest metropolitan area in Malaysia. George Town, the capital city of Penang, is the second-largest city in Malaysia and the heart of Malaysia's second-largest conurbation. To the south, the twin cities of Johor Bahru and Iskandar Puteri form the core of the third-largest metropolitan area in the country. Other metropolitan areas with a population of more than 500,000 include Ipoh, Kuching, and Kota Kinabalu. == Gallery == File:Moonrise over kuala lumpur.jpg|1. Kuala Lumpur File:Perai and Penang Bridge.jpg|2. Seberang Perai File:Subang Jaya at Dusk.jpg|3. Subang Jaya File:2018 New Year Fireworks in George Town, Penang.jpg|4. George Town File:Ipoh skyline.jpg|5. Ipoh File:ShahAlamPark.jpg|6. Shah Alam File:E11 highway and surrounding cityscape - Bandar Utama, Malaysia (8693660796).jpg|7. Petaling Jaya File:Kota Iskandar.JPG|8. Iskandar Puteri File:KM Plaza intersection at Jalan Tuanku Munawir (220709).jpg|9. Seremban File:Johorbahrub0606.jpg|10. Johor Bahru File:Malacca City.JPG|11. Melaka File:Panorama of Greater Kota Kinabalu.jpg|12. Kota Kinabalu File:Alor Setar Tower from Sky Garden - panoramio.jpg|13. Alor Setar File:K Terengganu (187).jpg|14. Kuala Terengganu File:Sarawak River.jpg|15. Kuching File:Miri- sarawak.JPG|16. Miri File:Pasir Gudang Highway.JPG|17. Pasir Gudang File:Sky Kuantan.jpg|18. Kuantan ==References== ==Other websites== * * Malaysia * Category:Malaysia-related lists",
 "title": "Cities of Malaysia"
}