{
 "id": "865936",
 "text": "Andrea Stewart-Cousins (born September 2, 1950) is an American politician and educator from Yonkers, New York She is a Democrat. Stewart-Cousins worked for District 35 with the New York State Senate starting in 2007. She became the Majority Leader and Temporary President with the New York Senate in 2019. She became the acting Lieutenant Governor of New York with Kathy Hochul, the first female governor of the state, twice in 2021 and in 2022. Stewart-Cousins was the first female in the history of New York State to lead a conference with the New York State Legislature. She was also the first female Senate Majority Leader in the history of the state. ==Early life== Andrea Alice Stewart was born on September 2, 1950, in New York City. The Stewart family lived in public housing in Manhattan and the Bronx. She had chronic asthma when she was young. Stewart-Cousins spent twenty years in the private sector, working with New York Telephone (later known as AT&T;). She earned her Bachelor of Science Degree from Pace University and her teaching credentials in Business Education from Lehman College. She received her Masters of Public Administration from Pace University in May 2008. ==New York State Senate== Stewart-Cousins first ran for New York State Senate in 2004. Incumbent Republican Sen. Nicholas Spano, however, defeated her by a margin of 18 votes. In 2006, she challenged Spano again and defeated him. As of 2019, Senate District 35 includes all of Greenburgh and Scarsdale and portions of Yonkers, White Plains and New Rochelle. Stewart-Cousins voted in favor of same-sex marriage legislation on December 2, 2009. The bill was later defeated. A same-sex marriage law was eventually passed in 2011. Stewart-Cousins supports abortion rights. She has pushed for legislation to expand abortion access across the State of New York. ==Senate Democratic Leader== On December 17, 2012, Stewart-Cousins was elected Senate Democratic Leader. ==Senate Majority Leader== The Democratic Party won a Senate majority in the 2018 elections. On January 9, 2019, Stewart-Cousins was elected Senate Majority Leader. She operates as the body's Majority Leader and Temporary President. In 2019, Stewart-Cousins sponsored the Housing Stability and Tenant Protection Act of 2019. This act overhauled the rules that had affected rent-controlled apartments in New York City. During Stewart- Cousins' first year as the Senate Majority Leader, New York passed a variety of progressive laws on issues. Those included climate change, voting rights, abortion rights, criminal justice reform, gender equality, gun control, marijuana decriminalization, LGBT rights and immigration. According to City & State New York, Stewart-Cousins employs a \"consensus-driven approach\" to leading the Senate Democratic Conference. This is what sets her \"apart from her predecessors\". ===Acting Lieutenant Governor=== After the resignation of Governor Andrew Cuomo because of multiple allegations of sexual harassment, Lieutenant Governor Kathy Hochul replaced him as governor in August 2021. Per state law, as state Senate Majority Leader, Stewart-Cousins became the state's Acting lieutenant governor until Hochul appointed a full-time replacement. She was the first Black woman to serve in this role. This was also the first time New York was governed by both a female governor and lieutenant governor. Hochul picked Brian Benjamin, who took office on September 9, 2021, as her replacement for lieutenant governor. However, Benjamin resigned less than a year later on April 12, 2022 after being arrested in a corruption scandal. This caused Stewart-Cousins to once again become acting Lieutenant Governor. ==Personal life== In 1979, Stewart married Thomas Cousins, and the couple moved to Yonkers, New York. Stewart-Cousins has three children and four grandchildren. Thomas Cousins died on November 26, 2007. ==References== ==Other websites== * New York State Senate: Andrea Stewart-Cousins * Category:Democratic Party (United States) politicians Category:State legislators of the United States Category:Politicians from New York City Category:Lieutenant Governors of New York (state) Category:African-American politicians Category:21st-century American politicians Category:1950 births Category:Living people Category:People from Yonkers, New York",
 "title": "Andrea Stewart-Cousins"
}