{
 "id": "866099",
 "text": "is a Businessperson and Japanese former racing driver. He is the Owner Chairman & CEO of Swift Engineering since 1991. He is the first and only Japanese driver to win the Toyota Atlantic Championship (Pacific) in 1989 and also the first Japanese driver to race at the Indianapolis 500 (Indy 500). ==Early life== Matsushita was born in Nishinomiya city, Japan, and graduated from Konan University. He is the grandson of Kōnosuke Matsushita, founder of Panasonic, and son of Masaharu Matsushita, who served as the second president of Panasonic for sixteen years beginning in 1961. His relationship has allowed him to receive financial backing from Panasonic throughout his racing career. ==Racing career== Matsushita started his career racing motorcycles in his home country between 1977 and 1979, before making the switch to four wheels. With Panasonic's backing, he then moved to the United States and entered his first Formula Ford race in 1986. He finished second at the 24 Hours of Daytona and third at the Sebring 12 Hours in 1988. Matsushita began to make his name known by winning the 1989 Champ Car Atlantic Championshipchampionship (Pacific division) with the largest point margin of all time. He graduated to Champ Car in 1990, scoring one point in his debut season. Inexplicably, he never showed the pace that took him to four Atlantic victories; instead, he quickly earned a reputation for being at the tail end of the grid, always outperformed by his teammates. Nonetheless, he became the first Japanese driver to race in the Indianapolis 500 in 1991 and followed that achievement with a top ten finish at Milwaukee Mile|Milwaukee. Matsushita missed the 1992 Indianapolis 500 after suffering a broken leg during a practice crash. He was sidelined for several weeks and missed the next six events as well. At the Phoenix International Raceway|Phoenix race in 1994, Matsushita endured a horrific crash in which his car was cut in half by Jacques Villeneuve's car traveling at nearly full speed. He emerged from his destroyed car with only minor injuries. The same year, he earned his best career finish of 6th position at the Marlboro 500 at Michigan International Speedway. This result was made possible by an extraordinarily high rate of attrition that saw only 8 cars finish the race. Matsushita was 11 laps behind the leader at the drop of the checkered flag. By the time he retired in 1998, Matsushita had started 117 Champ Car races for Dick Simon Racing, Walker Racing, Arciero/Wells Racing, and Dale Coyne Racing|Payton/Coyne. He holds the record for most starts in American Championship Car Racing history without scoring a Top 5. In 2001, Matsushita competed in the Baja 1000 off-road race, in a Mitsubishi Montero. ==Personal life== Away from the track, Matsushita owns Swift Engineering, an American engineering firm known for producing racing cars for a variety of open-wheel racing series, including Formula Ford, Formula Atlantic, the Champ Car World Series, and Formula Nippon. He bought Swift in 1991. Matsushita resides in San Clemente, California. ==References== ==Other websites== * MOTORSPORT STATS * NASCAR * RacingSportsCars Category:1961 births Category:Living people Category:24 Hours of Le Mans drivers Category:Japanese racecar drivers Category:Japanese businesspeople",
 "title": "Hiro Matsushita"
}