{
 "id": "86610",
 "text": "Robert Johnson, born Robert Leroy Johnson (May 8, 1911 – August 16, 1938) is one of the most famous Delta blues musicians. He is known worldwide as the \"King of the Delta Blues.\" He has also been called the \"Grandfather of rock and roll.\" == Life == He was born in Hazlehurst, Mississippi. He was the 11th child of his mother Julia Major Dodds, and 10th child of his father Charles Dodds. When he was born, his father had left his mother. He was brought up by a field worker named Noah Johnson. That is why he chose \"Johnson\" for his family name. == Career == Johnson began playing guitar when he was a child. In February 1929, he married Virginia Travis and became serious about playing the guitar. His wife died in childbirth at the age of 16 in April 1930. Johnson began traveling up and down the Delta. Around 1936, he was introduced to other blues players through a friend. He had a remarkable combination of talent for singing, playing the guitar and composing songs. His vocals, the originality of his songs and his style of playing guitar have influenced many musicians. These include: John Fogerty, Bob Dylan, Jimi Hendrix, The Yardbirds, The Black Keys, and The White Stripes. Eric Clapton said Johnson is \"the greatest blues musician ever to live.\" Johnson was ranked 71st on Rolling Stone magazine list of \"100 Greatest Guitarists of All Time.\" In 1986, he was inducted into the Rock and Roll Hall of Fame. ==Death== Johnson died on August 16, 1938. He died at the age of 27 from poisoning. Johnson's death was not reported publicly. Almost 30 years later, Gayle Dean Wardlow, a Mississippi-based musicologist researching Johnson's life, found Johnson's death certificate, which listed only the date and location, with no official cause of death. No formal autopsy had been done. Instead, a pro forma examination was done to file the death certificate, and no immediate cause of death was determined. It is likely he had congenital syphilis and it was suspected later by medical professionals that this may have been a contributing factor in his death. However, 30 years of local oral tradition had, like the rest of his life story, built a legend which has filled in gaps in the scant historical record. His early death and unknown early life have led to the spread of many legends, such as going down to the crossroads near Dockery Plantation and making a deal with the devil, which cursed the musician and leading to the creation of the 27 Club. == Songs == Eleven records were made by Robert Johnson with Vocalion during his lifetime, and a twelfth record was made once he had died.Komarma (2007) pp. 63-68 Track Recorded Catalogue Released Song Title Time 1\\. 11/23/36 Vocalion 3416 1937 Kind Hearted Woman Blues 2:29 2\\. 11/23/36 Vocalion 3416 1937 Terraplane Blues 3:01 3\\. 11/26/36 Vocalion 3445 1937 32-20 Blues 2:50 4\\. 11/27/36 Vocalion 3445 1937 Last Fair Deal Gone Down 2:39 5\\. 11/23/36 Vocalion 3475 1937 I Believe I'll Dust My Broom 2:57 6\\. 11/27/36 Vocalion 3475 1937 Dead Shrimp Blues 2:29 7\\. 11/23/36 Vocalion 3519 1937 Ramblin' On My Mind 2:57 8\\. 11/27/36 Vocalion 3519 1937 Cross Road Blues 2:29 9\\. 11/23/36 Vocalion 3563 1937 Come On In My Kitchen 2:52 10\\. 11/27/36 Vocalion 3563 1937 They're Red Hot 2:56 11\\. 11/27/36 Vocalion 3601 1937 Walkin' Blues 2:30 12\\. 11/23/36 Vocalion 3601 1937 Sweet Home Chicago 2:57 13\\. 6/19/37 Vocalion 3623 1937 From Four Until Late 2:22 14\\. 6/20/37 Vocalion 3623 1937 Hellhound On My Trail 2:37 15\\. 6/20/37 Vocalion 3665 1937 Malted Milk 2:20 16\\. 6/20/37 Vocalion 3665 1937 Milkcow's Calf Blues 2:17 17\\. 6/19/37 Vocalion 3723 1937 Stones In My Passway 2:28 18\\. 6/19/37 Vocalion 3723 1937 I'm A Steady Rollin' Man 2:35 19\\. 6/20/37 Vocalion 4002 1938 Stop Breakin' Down Blues 2:21 20\\. 6/20/37 Vocalion 4002 1938 Honeymoon Blues 2:16 21\\. 6/20/37 Vocalion 4108 1938 Little Queen Of Spades 2:16 22\\. 6/20/37 Vocalion 4108 1938 Me And The Devil Blues 2:34 23\\. 11/27/36 Vocalion 4630 1939 Preachin' Blues 2:52 24\\. 6/20/37 Vocalion 4630 1939 Love In Vain 2:20 All following songs were released after 1939: Recorded Matrix Released Song title Time 11/23/36 SA-2584-1 1961 When You Got A Good Friend take #1 2:37 11/23/36 SA-2584-2 When You Got A Good Friend take #2 2:50 11/23/36 SA-2585-1 1961 Come On In My Kitchen take #1 2:47 11/23/36 SA-2587-1 Phonograph Blues take #1 2:37 11/23/36 SA-2587-2 Phonograph Blues take #2 2:32 11/27/36 SA-2629-2 1961 Cross Road Blues take #2 2:29 11/27/36 SA-2633-1 1961 If I Had Possession Over Judgement Day 2:34 6/20/37 DAL-397-1 1961 Drunken Hearted Man take # 1 2:24 6/20/37 DAL-397-2 Drunken Hearted Man take # 2 2:19 6/20/37 DAL-400-1 1961 Travelin' Riverside Blues take # 1 2:47 6/20/37 DAL-400-2 Travelin' Riverside Blues take # 2 2:47 6/20/37 DAL-402-2 Love In Vain take # 1 2:28 ==References== Category:1911 births Category:1938 deaths Category:Blues guitarists Category:American guitarists Category:Singers from Mississippi Category:Musicians from Mississippi",
 "title": "Robert Johnson (musician)"
}