{
 "id": "866287",
 "text": "Herschel Walker (born March 3, 1962) is an American retired football player, bobsledder, sprinter, and mixed martial artist. He played college football for the University of Georgia. He has been called one of the best college football players of all time. He was the Republican candidate for the United States Senate in Georgia for the 2022 election and was defeated in the runoff election by Raphael Warnock. In December 2024, President-elect Donald Trump nominated Walker to serve as the U.S. Ambassador to the Bahamas. ==Personal life== Walker was born in Augusta, Georgia. He studied at University of Georgia. He was married to Cindy DeAngelis Grossman from 1983 until their divorce in 2002. They have one son, Christian. ==NFL career== Walker began his professional football career with the New Jersey Generals of the United States Football League (USFL) in 1983. He later joined the Dallas Cowboys of the National Football League (NFL). In the NFL, he also played for the Minnesota Vikings, Philadelphia Eagles, and New York Giants. He retired from the NFL in 1997. He was honored into the College Football Hall of Fame in 1999. ==Political career== He was named Co-Chair of the President's Council on Sports, Fitness, and Nutrition after being appointed by President Donald Trump in 2020. He supported Trump's presidential campaigns in 2016 and 2020. Walker ran for the Republican nomination for the United States Senate from Georgia in the 2022 election. Former President Trump supported his Senate campaign. On December 18, 2024 President-elect Trump announced that Walker would be nominated to serve as U.S. Ambassador to the Bahamas. ==References== ==Other websites== * * Category:1962 births Category:Living people Category:African- American track and field athletes Category:Dallas Cowboys players Category:Minnesota Vikings players Category:Philadelphia Eagles players Category:New York Giants players Category:African-American players of American football Category:American football running backs Category:American bobsledders Category:American sprinters Category:Sportspeople from Georgia (U.S. state) Category:People from Augusta, Georgia Category:Politicians from Georgia (U.S. state) Category:Republican Party (United States) politicians Category:American martial artists",
 "title": "Herschel Walker"
}