{
 "id": "866300",
 "text": "The lieutenant governor is the second-highest-ranking government official in 45 of the 50 U.S. States and four of the five territories. Not all states have a lieutenant governor. This article is a list of all lieutenant governors and/or political offices of equal ranking. ==List of Lieutenant Governors== ===States=== State Image Lieutenant governor Party Prior public experience Start of term End of term Chosen by Alabama (list) Republican Alabama House 2027 Separate election Alaska (list) Republican Commissioner of Alaska Department of Corrections Alaska House 2026 Same ticket Arkansas (list) Republican Attorney General 2027 Separate election California (list) 100px Democratic United States Ambassador to Hungary 2027 (term limits) Separate election Colorado (list) Democratic Colorado House 2027 Same ticket Connecticut (list) Democratic Secretary of the State of Connecticut Connecticut House Same ticket in the general elections; Separate elections in the primaries Delaware (list) Democratic Delaware Senate 2029 Separate election Florida (list) Vacant since February 16, 2025 Georgia (list) 100px Republican Georgia Senate 2027 Separate election Hawaii (list) Democratic Hawaii House 2026 Same ticket in the general elections; Separate elections in the primaries Idaho (list) Republican Idaho House Speaker 2027 Separate election Illinois (list) Democratic Illinois House Same ticket Indiana (list) Republican Noblesville public library trustee 2029 Same ticket Iowa (list) Republican Iowa Senate 2027 Same ticket Kansas (list) Democratic State Secretary of Commerce Same ticket Kentucky (list) Democratic No prior offices 2027 (term limits) Same ticket Louisiana (list) Republican Plaquemines Parish President 2028 Separate election Maryland (list) Democratic Maryland House of Delegates 2027 Same ticket Massachusetts (list) Democratic Mayor of Salem Same ticket in the general elections; Separate elections in the primaries Michigan (list) Democratic No prior offices 2027 (term limits) Same ticket Minnesota (list) 100px Democratic (DFL) Minnesota House 2027 Same ticket Mississippi (list) Republican Mississippi Secretary of State 2028 (term limits) Separate election Missouri (list) Republican No prior offices 2029 Separate election Montana (list) Republican No prior offices Same ticket Nebraska (list) Republican United States Attorney for the District of Nebraska 2027 Same ticket Nevada (list) Republican Las Vegas City Council Separate election New Jersey (list) Democratic Secretary of State Passaic County Freeholder 2026 Same ticket New Mexico (list) Democratic New Mexico Senate Grant County Clerk 2027 Same ticket in the general elections; Separate elections in the primaries New York (list) Democratic U.S. House 2026NY lieutenant gubernatorial terms begin at midnight New Year's Day. Same ticket in the general elections; Separate elections in the primaries North Carolina (list) Democratic North Carolina Senate North Carolina House 2029 Separate election North Dakota (list) Republican North Dakota House 2028 Same ticket Ohio (list) Republican No prior offices 2027 Same ticket Oklahoma (list) 100px Republican Chair of the Oklahoma Republican Party Separate election Pennsylvania (list) 100px Democratic Pennsylvania House Same ticket in the general elections; Separate elections in the primaries Rhode Island (list) Democratic Providence City Council Separate election South Carolina (list) Republican No prior offices Same ticket South Dakota (list) Republican South Dakota House Same ticket Tennessee (list) Republican Tennessee Senate Tennessee House State SenateThe Tennessee Senate elects their speaker who serves as lieutenant governor. The full title of the office is Lieutenant Governor and Speaker of the Senate. Texas (list) Republican Texas Senate Separate election Utah (list) Republican Utah Senate 2029 Same ticket Vermont (list) Republican Vermont Senate Vermont House of Representatives 2027 Separate election Virginia (list) Republican Virginia House of Delegates 2026 Separate election Washington (list) Democratic U.S. House Washington House 2029 Separate election West Virginia (list) Republican West Virginia House West Virginia Senate 2027 State SenateWest Virginia Code 6A-1-4(b), as enacted in 2000, entitles the president of the West Virginia Senate to use the title Lieutenant Governor Wisconsin (list) Democratic Wisconsin State Assembly Same ticket in the general elections; Separate elections in the primaries ===Territories=== Territory Image Lieutenant governor Party Prior public experience Start of term End of term Chosen by American Samoa (list) Republican No prior offices 2029 Same ticket Guam (list) Democratic No prior offices 2027 Same ticket Northern Mariana Islands (list) Independent Mayor of Saipan 2027 Same ticket U.S. Virgin Islands (list) Democratic Legislature of the Virgin Islands 2027 Same ticket ===States without Lieutenant Governors=== State Office Image Officeholder Party Prior public experience Start of term Arizona Secretary of State Democratic County Recorder of Maricopa County Maine President of the Senate Democratic Maine Senate Maine House of Representatives New Hampshire President of the Senate 100px Republican New Hampshire Senate New Hampshire House of Representatives Oregon Secretary of State Democratic Oregon House Wyoming Secretary of State 100px Republican Wyoming House of Representatives ===Federal districts and territories without Lieutenant Governors=== Jurisdiction Office Image Officeholder Party Prior public experience Start of term District of Columbia Chairman of the Council Mendelson was initially appointed Chairman of the Council of the District of Columbia after the position was vacated on June 6, 2012, due to the resignation of Kwame R. Brown. Brown had been charged in federal court with bank fraud and, after his resignation, was further charged in D.C. Superior Court with making an unlawful cash campaign expenditure. Mendelson was subsequently elected to complete Brown's term on November 6, 2013. Democratic DC Councilman Advisory Neighborhood Commissioner Puerto Rico Secretary of State New Progressive No prior offices ==References== *",
 "title": "List of current United States lieutenant governors"
}