{
 "id": "866525",
 "text": "The shoebill, Balaeniceps rex, is also called the whalehead, whale-headed stork, or shoe-billed stork. It is a bird in the order Pelecaniformes. It is the only living species in the genus Balaeniceps and the family Balaenicipitidae. The bird looks similar to a stork, but can be easily told apart by its famous shoe-shaped beak. The shoebill lives in East Africa, in parts of Sudan, Ethiopia, DR Congo, Zambia, and the Central African Republic. The IUCN says that the shoebill is vulnerable. There are thought to be around 5,0008,000 shoebills in the world, but the population might be as big as 10,000. The birds are at risk because of habitat destruction and hunting. == Taxonomy == The shoebill was first described by John Gould in 1850. He gave it the scientific name (a two-part name given to types of plants and animals) Balaeniceps rex. The shoebill is also sometimes called the shoebill stork, shoe-billed stork, or bogbird. Studies of the shoebill's DNA have shown that the shoebill is in its own family, Balaenicipitidae. These studies have also shown that it is closely related to the pelicans, and so it is now put in the order Pelecaniformes. == Description == The shoebill is a large, tall bird that is around tall and weighing for males and for females. Males and females look almost the same, but males are a little larger. The birds are easily told apart by their shoe-shaped beak. They are mostly grey in color, with their belly being whitish. The wings are darker than the rest of the body, and the upper body is slightly greenish in color. The beak is usually straw-colored with blackish marks, while the iris (the non-black part of the eye) can be yellow, grey, or whitish in color. The beak has a hook-like end that helps catch fish. Younger birds look similar to adults, but are more brownish and have smaller, more pinkish beaks. When it is flying, the shoebill looks like other storks and herons. It can be told apart by the shape of its beak and its bluish-grey color. === Sounds === The shoebill is mostly silent. Sometimes, they do bill-clattering displays near their nests. During these displays, they sometimes make moo sounds that are like a cow's. They make high-pitched beeeeeh sounds near their nests, and might also make loud sounds when flying. Young shoebills are known to make sounds that are like human hiccups when they want food. == Distribution == The shoebill lives in marshes from southern Sudan and southwestern Ethiopia to southern DR Congo and northern Zambia. It is also sometimes found in the Central African Republic. It also lives in Uganda, Tanzania, and Kenya. The areas that it lives in are mostly places that also have papyrus and lungfish. It does not migrate, but sometimes moves to different areas when the water level changes. It likes marshes that have papyrus, reeds, cattails, and grasses. It sometimes lives in marshy areas next to lakes and in places where the water have very little oxygen. In places with very deep water, it needs floating vegetation. Rock art from Oued Djerat in eastern Algeria shows that in the early Holocene, shoebills lived much more to the north, in wetlands where the Sahara Desert is now. == Behaviour == Shoebills are solitary by nature, and even their nests are spaced apart. Breeding pairs defend a territory from others of their species. === Diet === The shoebill mostly eats fish weighing up to . The main types of fish that it eats are lungfish, Senegal bichir, Clarias catfish, and tilapia. It also eats amphibians, young crocodiles, water snakes, rodents, and young waterfowl. The shoebill likes to hunt in areas where the water has less oxygen, because fish in these areas have to come up to breathe. The animals that the shoebill eats depends on where it lives. For example, it mainly eats lungfish and catfish in Uganda, but mainly eats catfish and water snakes in Zambia. == Status == The IUCN says that the shoebill is vulnerable. == References == Category:Birds of Africa Category:Pelecaniformes",
 "title": "Shoebill"
}