{
 "id": "866629",
 "text": "Battambang, () is a city in Northwest Cambodia. It is the capital and largest city of Battambang Province in Northwest Cambodia. It is the 3rd largest city in Cambodia after Phnom Penh and Siem Reap. == History == The city was settled at the 11th century. Battambang's population was centered along a single road parallel to the Sangkae River. In the 18th century, there are now 2,500 people living in Battambang in that time. In 1795, modern-day Thailand got the following provinces of Cambodia: Banteay Meanchey, Battambang, Oddar Meanchey, Pailin, and Siem Reap. The Thai ruled Battambang as a provincial capital of Battambang in Thailand, through the Thai speaking Abbhaiwongae family of Cambodia, which was until 1907, when the province and entire Cambodia became part of the French Indochina colony. == Geography == Battambang is the capital and largest city of Battambang Province. It lies at the northwest part of Cambodia. It's location was 13°06’N, 103°12’E. The city is 280 kilometers northwest of Phnom Penh, 163 kilometers west of Siem Reap, and 114 kilometers southwest from Poi Pet and the Cambodia-Thailand border. == Population == As of 2019, Battambang has 119,251 people living in the city of Battambang. == Dominant religion == Theravada Buddhism is the pre-dominant religion of Krong Battambang, Cambodia. The Buddhist temples of the city are Ek Phnom Pagoda, Wat Kandal, Wat Sampeu, and Wat Samrong Knong. == Administration == The district is subdivided into 10 communes (khum).Statistics of the Cambodian Government === Communes and villages === Khum (Commune) Phum (Villages) Tuol Ta Aek Ou Ta Kam Muoy, Ou Ta Kam Pir, Ou Ta Kam Bei, Tuol Ta Aek, Dangkao Teab Preaek Preah Sdach Preaek Preah Sdach, Preaek Ta Tan, Dabbei Meakkakra, Ou Khcheay, La Edth, Num Krieb, Baek Chan Thmei, Chamkar Ruessei Rotanak Rumchek Muoy, Rumchek Pir, Rumchek Bei, Rumchek Buon, Rumchek Pram, Souphi Muoy, Souphi Pir, Rotanak Chamkar Samraong Chamkar Samraong Muoy, Chamkar Samraong Pir, Voat Lieb, Voat Rumduol, Phka Sla Sla Kaet Sla Kaet, Dam Spey, Chrey Kaong Kdol Doun Teav Chong Preaek, Kdol, Ou Ta Nob, Ta Pruoch, Ta Koy, Kantuot, Thkov Ou Mal Ou Mal, Dak Sasar, Sala Balat, Prey Dach, Kouk Ponley, Voat Roka, Koun Sek, Andoung Pring, Boeng Reang, Prey Roka Voat Kor Voat Kor, Chrab Krasang, Ballang, Khsach Pouy, Damnak Luong, Kampong Seima Ou Char Ou Char, Prey Koun Sek, Kab Kou Thmei, Andoung Chenh, Anhchanh, Ang Svay Pao Preaek Moha Tep, Kampong Krabei, Mphey Osakphea, Kammeakkar == Gallery == File:Battambang..JPG|The city of Battambang ==References== Category:Cities in Asia Category:Settlements in Cambodia Category:Battambang province",
 "title": "Battambang"
}