{
 "id": "86730",
 "text": "Tor is a group of computer servers that keep users anonymous on the Internet. It works by moving data across a few random Tor servers, called \"nodes\". Information sent across Tor is hard to trace. Tor is also the name that some people give to the web browser used to access the Tor server, the Tor Browser Bundle. The browser is a special version of Mozilla Firefox designed to make all users blend together, making it even harder to track a single person. ==Operation== Information sent across Tor goes through three separate Tor servers before going to its destination. These servers are: # The entry guard. Entry guards know who is sending information, but not what the information is. Entry guards send the information to a middle relay. # The middle relay. Middle relays don't know what the information is or who originally sent it. Middle relays send the information to an exit relay. # The exit relay. Exit relays know what the information actually is, but they don't know who originally sent it. Exit relays send the information to its destination. If the destination is an ordinary website, the information is not protected by Tor after the exit relay sends it away. To fix this, special websites called hidden services can be created. Information sent between users and hidden services never leaves the Tor network. Hidden services can only be used on browsers that use the Tor network; browsers like Google Chrome won't work. Hidden services use Onion addresses as their URLs. Onion addresses look like a bunch of random letters and numbers, with a `.onion` at the end. For example, the Onion address for the DuckDuckGo search engine is `duckduckgogg42xjoc72x3sjasowoarfbgcmvfimaftt6twagswzczad.onion`. == Unlawful use == The Tor network can be used for illegal activities because of its anonymity. This can be criticizing leaders of state, P2P sharing of copyrighted files, moving child pornography,Cleaning up Tor on broadbandreports.com or buying and selling illegal drugs. ==References== ==Other websites== * The Tor Project Category:Cross-platform software Category:Dark web",
 "title": "Tor (software)"
}