{
 "id": "867452",
 "text": "Haosi Namoinu is a character of a Meitei folktale. She is the only daughter of Pokmabi Laoshigam Chanu and Senbi Loikenba. She was the apple of their eyes. Her father was a minister of the then Ancient Moirang kingdom, in charge of collecting tributes from the land of Kabo (present day Western Myanmar).Singh, Moirangthem Kirti (1 July 1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0. However, after her mother's untimely death, her father remarried with Nganurol Laoshigam Chanu (Loisingam Chanu), the sister of her mother. Spending a few days happily, Senbi Loikenba left for Kabo on the King's errand and during his absence, Haosi Namoinu was harshly treated by her stepmother. She was not allowed to go outside and play with her friends. She had to work as much hard as she could to satisfy her stepmother. Her bliss of household life was much worsened. Her stepmother ordered her work after work and she completed it with no rest. She was forced to husk the rice, tired as she was, again she had to cook food for them and serve but she uttered no lamentation. Her stepmother's ruthlessness came to the highest degree and she ordered Haosi Namoinu, that if she wanted to join the feast (spring festival), she had to go to the maternal grandparents' house and bring a load of paddy rice (un-husked rice). She did so, but her stepmother was still not satisfied, and struck her head with a cookery utensil. Having being deprived of all youthful delights, the girl transformed herself into a Hari Nongnang (cicada) (or cricket in some version), with her clothes as wings and feathers, and flew away with ravishing tears.Singh, Moirangthem Kirti (1 July 1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0. This legendary account is engraved in as one of the two stories in the Khongjomnubi Nongarol.Singh, Moirangthem Kirti (1 July 1993). Folk Culture of Manipur. Manas Publications. ISBN 978-81-7049-063-0. == Related pages == * List of Meitei folktales ** Khongjomnubi Nongarol ** Sandrembi Chaisra ** Uchek Langmeidong == References == == Other websites == * Haosie Namoinu Meiteirol Ariba * A Human turning Harinongnang Category:Legendary Meitei people",
 "title": "Haosi Namoinu"
}