{
 "id": "867445",
 "text": "After the Soviet-Afghan War, which ended on 14 February 1989, a civil war started in Afghanistan that lasted until the end of April 1992, when a new Afghan government was formed. On 24 April, the Peshawar Accord, an agreement for a new Afghan government, was announced. The civil war officially ended on 27 April 1992. The new Afghan government started the next day, on 28 April 1992.When the Soviet Union left Afghanistan in 1989, it left President Mohammed Najibullah in charge of the Republic of Afghanistan. But many people in Afghanistan did not support him because they thought that his government was a communist puppet regime that was controlled by the Soviets. That made several mujahideen groups start to fight against Najibullah's regime. In March 1989, together with the Pakistani Inter-Services Intelligence (ISI), the mujahideen attacked Jalalabad, but they were defeated. In March 1991, they successfully overtook Khost. Mujahideen power continued to grow until the Peshawar Accord was announced in April 1992, and a few days later, Najibullah resigned. However, instead of a new government with all mujahideen groups, another civil war broke out between different mujahideen groups, which lasted until 1996 (also known as the Battle for Kabul). This civil war was fought between the forces of Ahmad Shah Massoud on one hand and the forces of the Taliban on the other hand. == Background == === First Republic of Afghanistan === Since 1933, Mohammad Zahir Shah ruled as King of Afghanistan. On 17 July 1973, there was a coup d'état led by Prince (Sardar) Mohammed Daoud Khan (the former Prime Minister and Army General) against the King, who was his cousin and brother-in-law and was in Rome for medical treatment. On 24 August, the King announced his abdication and chose to stay in Rome. More than two centuries after the founding of the Durrani Empire in 1747, Daoud Khan finally abolished the monarchy and the royal rule. The coup resulted in the establishment of the first Republic of Afghanistan under a one-party system, which was led by the first President of Afghanistan Daoud Khan and his National Revolutionary Party. Two days after the 1973 coup, the Soviet Union and India recognized the First Republic of Afghanistan and the new government. === Saur Revolution === On 27 April 1978 (the 7th of the month of Saur or Sowr, the second month of the Solar Hijri calendar) and five years after the first coup, there was another coup, the Saur Revolution, when Nur Mohammad Taraki, the first General Secretary of the People's Democratic Party of Afghanistan (PDPA), together with Hafizullah Amin, gave the order for a military coup to overthrow the government of Mohammad Daoud. On 27 April, the first shots heard were near the Ministry of Interior in the downtown in Kabul as the first sign of a coup. From there, the fighting spread to other areas of the city. From 28 April 1978, between the coup and the establishment of the new civilian government, the PDPA Revolutionary Council led the country for three days. A new government was then formed, called the Democratic Republic of Afghanistan (DRA), which was led by Prime Minister Nur Muhammad Taraki .The regime described the Saur Revolution as a democratic revolution. == Parties in war == === Democratic Republic of Afghanistan (DRA) === The Democratic Republic of Afghanistan was the Afghan government that had come to power by the Saur Revolution. It led the country from the end of the Saur Revolution in 1978 to 1992, when it was overthrown by several mujahideen groups at the end of the 1989-1992 Civil War. The government party was the People's Democratic Party of Afghanistan (PDPA), which had been founded on 1 July 1965 and had a Marxist–Leninist ideology. The party was led by Nur Muhammad Taraki, who led the party ever since the split between the Khalq faction, led by him and Amin, and the Parcham faction, led by Babrak Karmal, in 1967. During their time in power, the DRA introduced several contentious reforms such as modernizing traditional Islamic civil and marriage laws and forcing land reforms. Taraki was the first leader of the DRA after the Saur Revolution in 1978. He was a founding member of the People's Democratic Party of Afghanistan PDPA, serving as its General Secretary from 1965 to 1979. Taraki's leadership was short- lived and marked by controversies. The second leader of the DRA was Hafizullah Amin. He was an Afghan communist revolutionary, who had organized the Saur Revolution of 1978. Amin ordered the death of Taraki by suffocation with pillows on 8 October 1979. The third leader of the DRA was Babrak Karmal. He became a founding member of the party and eventually became the leader of the Parcham faction. He was an Afghan revolutionary and politician who was the leader of Afghanistan ad served as General Secretary of the party for seven years. The last leader of the DRA was Mohammad Najibullah Ahmadzai, commonly known as Dr. Najib. He was the General Secretary of the PDPA and the leader of the DRA from 1986 to 1992. Dr. Najib changed the name of the Communist Party PDPA to the Hizb-i Watan (Homeland Party). He was the President of Afghanistan from 1987 to his resignation in April 1992, shortlly after the mujahideen had taken over Kabul. === Mujahideen === The Mujahideen resistance movement consisted of several smaller Islamist rebel groups. Despite their differences in region of origin, ethnicity, and religious connection, they fought against one common enemy: the communists (the Soviets and later Najibullah's DRA government). They shared the common goal of making Afghanistan an independent Islamic state that would be unaffected by large powers like the United States, the Soviet Union, and China. The groups were supported by the United States to fight against the Soviets and Najibullah. Seven of the groups came together in 1981 to form the Islamic Unity of Afghanistan's Mujahideen (IUAM), but they did not succeed in forming a united movement.They fought loosely and without strategic coordination. Sometimes, they would even attack one another. Out of the seven groups, there were four important ones: Hesb-e Islami, Jamiat-e Islami, Ittehad-e Islami, and the Haqqani network. ==== Hezb-e Islami ==== Hezb-e Islami was a group led by Gulbuddin Hekmatyar. The party was mainly supported by the Pakistani Inter-Services Intelligence (ISI). Because American assistance to the mujahideen flowed through Pakistan, the Hezb-e Islami received a lot of money. That let the party was grow stronger and eventually become one of the main mujahideen groups in the fight against Najibullah. However, it could not defeat Najibullah immediately after the Soviets had left Afghanistan because the United States thought that his regime would collapse under pressure by the mujahideen after the Soviets left. Although the US thus stopped giving financial and military assistance to the group, Najibullah's regime stayed in power because of Soviet support and allowed it to keep Hezb-e Islami under control. Hekmatyar and his troops became known for attacking other mujahideen groups, especially those of Ahmad Shah Massoud, part of the Jamiat-e Islami. He even raided humanitarian aid organizations. Some people even thought that he was secretly on the side of the Soviets and that \"he might be a secret KGB plant whose mission was to sow disruption within the anti-communist resistance.\" Other people thought that he was causing chaos among mujahideen groups so that Hezb-e Islami could rise to power after the Soviets had left, which caused all mujahideen groups to be divided and ineffective. ==== Jamiat-e Islami ==== The Jamiat-e Islami group was led by Burhanuddin Rabbani, but the main military commander was Massoud. The group was also a strong mujahideen group and played an important role in the ultimate mujahideen victory over Najibullah in 1992. It received little to no support from the United States, which meant they had less resources like money and military equipment than Hezb-e Islami. However, its success was due mainly to Massoud's advanced fighting skills. This group was the main opponent of Hezb-e Islami in the shared struggle against the Soviets and Najibullah. Both groups often fought against each other, even though they were both part of the same Islamist rebel movement against the communists. In one instance, Hekmatyar attacked Massoud's troops and killed 36 of his commanders. In return, Massoud chased down four of Hekmatyar's men who had been responsible for the attack and then hanged them. ==== Ittehad-e Islami ==== Ittehad-e Islami was a group led by Abdul Rasul Sayyaf, a Wahhabite military leader. It was mainly supported and assisted by Saudi Arabia. Just like the rivalry between Hezb-e Islami and Jamiat-e Islami, Ittehad-e Islami also had an opponent in the shared fight against the communists: a smaller mujahideen group of Abdul Ali Mazari, Hezb-e Wahdat, which was supported by Iran. The rivalry existed because Saudi Arabia and Iran compete for regional domination. ==== Haqqani network ==== The Haqqani network was led by Jalaluddin Haqqani, who founded the group as a split from the Yunis Khalis mujahideen group, a major mujahideen group in the early 1980s. Just like Hezb-e Islami, the Haqqani network received much financial and military assistance from the United States. The main difference from the other mujahideen groups is that when the Taliban came to power after the civil war, the Haqqani network chose to support the new Taliban regime. The Haqqani network also developed close relations with the al-Qaeda network. == Course of the war == === Battle of Jalalabad (1989) === On 6 March 1989, the mujahideen groups attacked the eastern city of Jalalabad. The attack was led by Gulbuddin Hekmatyar and his mujahideen group, Hezb-e Islami, and was supported by the Pakistani Inter- Services Intelligence (ISI). The goal was to overtake the city and use it to attack Kabul later to overthrow Najibullah's regime and form a mujahideen government. The mujahideen forces did not take over Jalalabad. Firstly, they tried to attack the city from the East, but the forces from the Democratic Republic of Afghanistan (DRA) were too strong for them. The mujahideen managed to overtake Samarkhel, a small village close to Jalalabad, and even the airport for a short time. However, the DRA forces then started to fight back and drove the mujahideen back out of the city. The mujahideen forces then tried to attack the city from the north and the south, but again the DRA forces were too strong. The mujahideen forces did not expect Jalalabad to be defended so well. There are three main reasons for the mujahideen not managing to overtake Jalalabad. Jalalabad was well fortified, which meant that it was difficult to attack from the outside. Also, the DRA forces had strong firepower in the form of heavy artillery equipment and air support, but the muhajideen forces had to rely on guerilla tactics. Finally, the DRA forces were well organized, and the mujahideen forces consisted of small, loose groups that also fought one another. By June 1989, the mujahideen forces had been completely driven out of Jalalabad and had to give up, when, about 3000-4000 mujahideen soldiers had died. === Battle of Khost (1991) === The Battle of Jalalabad caused much damage and division to the mujahideen troops. However, two years after their defeat at Jalalabad, they were ready to try to overtake another major city again. On 14 March 1991, they attacked Khost, a smaller city close to the eastern border with Pakistan. Because the mujahideen forces had long been active there, it was easier for them to attack Khost than Jalalabad. They took over the city in just two weeks. The mujahideen forces attacked Khost from three different sides with a surprise attack, which allowed them to advance very quickly. They startedby capturing some DRA outposts on the outskirts of the city, which diminished the amount of resistance that they would face. Then, they gained control over the airport, which slowed down DRA transportation and logistics and increased their flexibility. Finally, they moved into the city, which fell to the mujahideen troops on 31 March 1991, just over two weeks after the first attack. Again, there are three main reasons that the mujahideen were successful this time. The rugged terrain of Khost made it more suitable to apply various guerilla warfare tactics, which the mujahideen groups were used to. Also, Jalalabad was well connected and continuously supplied by the DRA, Khost was logistically more difficult to reach and support from Kabul, which meant that the DRA forces in Khost received little to no support from the DRA government apart from the troops that were already stationed there. Finally, the mujahideen forces on the ground were this time unified and well organized, with the whole attack having been planned out in detail. The victory at Khost finally allowed the mujahideen to regain popular support, gain momentum, and end Najibullah's regime. === Battle of Kabul (1992) === Seeing the success of the mujahideen, the United Nations and senior leaders of several Afghan mujahideen parties decided to meet in Peshawar to try to form a new neutral acting Afghan government to replace Najibullah's regime. The UN presented a plan to the mujahideen groups to form a pre-interim council and accept formal sovereignty from President Najibullah. In March 1992, Najibullah announced his cooperation to resign to make way for a new neutral acting government. With that announcement, he lost internal control. In April 1992, Kabul came completely under the control of the interim government, with the hope for a new era. But the situation quickly spiraled into escalation. Throughout the negotiation process, mujahideen forces were stationed outside Kabul. In the spring of 1992, at least five mujahideen groups fell out and started fighting one another to take control over Kabul. Parties involved in the conflict were Jamiat-e Islami, led by Massoud; Hezb-e Islami, led by Hekmatyar; Hezb-i Wahdat, led by Mazari; Ittehad-e Islami, led by Sayyaf; and Junbish-i Islami. led by Abdul Rashid Dostum. == Aftermath == By the end of 1992, Kabul had been badly damaged, thousands of civilians had been killed, and half-a-million residents had fled. In November 1994, a new group entered the scene, the Taliban. It gradually gained the upper hand in the conflict, conquered the city of Kabul in September 1996, and took control over Afghanistan altogether. The Taliban regime under Mullah Omar worked closely together with the al-Qaeda network led by Osama bin Laden. ==Sources== ==Other websites== * https://www.npr.org/2021/08/19/1028472005/afghanistan-conflict-timeline. NPR Category:War in Afghanistan (since 1978)",
 "title": "Afghan Civil War (1989–1992)"
}