{
 "id": "867455",
 "text": "The Great Molasses Flood or Boston Molasses Disaster happened in Boston, Massachusetts on January 15, 1919. A metal tank broke, and the 2.3 million gallons of molasses in it poured out onto Commercial Street. ==Background== Molasses is a sweet-tasting by-product of sugar production from sugar cane or sugar beets. It can be used to make rum, a sweet alcohol drink, and it is an ingredient in Boston baked beans. In the early 20th century, many people in the West used molasses to sweeten their food because white sugar cost too much money. ==Causes== Ships brought molasses to Boston from the sugar farms in the Caribbean Sea. In Boston, people made rum out of molasses in factories called distilleries. But the molasses had to be stored until rum makers were ready. This was right before alcohol would become illegal in the United States, so people wanted to make and sell rum while they still could. One company, U.S. Industrial Alcohol, put their molasses in a 50-foot (15-meter) steel tank at 529 Commercial Street in Boston's North End neighborhood. The people in the North End said it made strange noises. The tank was not very old, but it leaked. Families would send children to go and take molasses from the leak. U.S. Industrial Alcohol painted the tank brown so the children could not find the leaks to steal molasses, but they did not fix the leaks. On January 13, two days before the flood, even more hot molasses was poured into the tank. Engineer Ronald Mayville says the tank broke because the steel was not thick enough. ==Event== At about 12:30 p.m. on January 15, the molasses tank broke. 2.3 million gallons (8.7 million liters) of molasses spilled out onto Commercial Street. The wave of molasses was 30 feet (9 meters) high and moved at 35 miles per hour (55 kph). Pieces of the tank flew into houses and broke holes in walls. One piece flew into one of the pillars holding up an elevated train track and broke it. A train stopped just in time. Because the molasses was sticky, people in it could not get out. When the tank first broke, some of the molasses was still hot, so it moved fast at first. But it cooled down quickly in the cold winter air. So people and other animals fell into warm, soft molasses that got hard around them, and they could not get out. When it covered people's noses and mouths, they could not breathe. The molasses spread out to other streets. Soon, there was 2-3 feet (up to 1 meter) of molasses on the ground. A police officer was in a signal box talking to his police group when the tank broke. Because he was already sending a message to other police officers, he called for help right away. Rescue workers came to the North End, but they could not walk or drive carts through the molasses. Some rescuers tried to get a man out of the molasses by pulling on his arm. The molasses was so hard that they pulled his arm off by accident. ==Casualties== 21 people and many horses died. 150 people were hurt. Some of the dead people were not found until days later. Because of the molasses, it was hard for people to tell which people they were. ==Cleanup== People who went to the North End got molasses on their clothes and shoes. When they went to other parts of Boston, the molasses fell off. Soon every street in Boston had molasses on it. Many of the train car seats and public telephones were sticky. The people used hoses from fireboats to wash the molasses into Boston Harbor with seawater. The water in the harbor was brown for months. People say they can still smell molasses on hot days. ==Lawsuit== Soon after the flood, 199 people sued U.S. Industrial Alcohol. The lawsuit took six years and there were more than 3000 people who spoke in court. This was the first lawsuit in United States History that had many expert witnesses: Engineers, architects, and other building experts talked about the tank in court, for example metal scientist Albert Colby, Massachusetts Institute of Technology engineer George E. Russell, and Harvard University's George F. Swain. During the lawsuit, there were three ideas about why the flood happened: 1) Yeast or other very small living things in the tank ate the molasses and gave off carbon dioxide gas, which made the tank explode, 2) someone put a bomb in the tank, or 3) the tank was not built well. Eventually, the court decided that the tank was not built well, and that U.S. Industrial Alcohol caused the flood with this unsafe tank. U.S. Industrial Alcohol settled with some people out of court too. Families got about US$7000 per dead person. The company paid somewhere from $500,000 to $100,000. Historian Stephen Puleo says that this case set the precedent, a way of doing things for the future: Americans began to think that building inspectors should look at tanks and other buildings to see if they are safe, that engineers need to write plans for their buildings, and that architects need to show their blueprints. ==Memorials== The Bostonian Society put a small green marker on Commercial Street in the 1990s. ==In popular culture== *Puppet History talked about the Boston Molasses Disaster in the episode \"The Great Molasses Flood.\" ==References== Category:Disasters in the 1910s Category:History of Boston Category:Disasters in the United States",
 "title": "Great Molasses Flood"
}