{
 "id": "867606",
 "text": "The Afghan Civil War happened from 1992 to 1996. == War over Kabul (28 April 1992–27 September 1993) == Fighting over Kabul started on 25 April 1992. The six groups that fought were Hezb-e Islami Gulbuddin, Jamiat-e Islami, Harakat- i-Inqilab-i-Islami, Ittehad-e Islami, Hezb-i Wahdat and Junbish-i Milli. A mujahideen warlord, Gulbuddin Hekmatyar, the leader of Hezb-e Islami Gulbuddin, was offered the position of temporary prime minister in President Sibghatullah Mujaddidi's government. However, the agreement was broken on 29 May, when Mujaddidi accused Hekmatyar of having rockets fired at his airplane. By 30 May 1992, Jamiat-e Islami and Junbish-i Milli were mujahideen forces fighting against Hekmatyar's Hezb-e Islami Gulbuddin again in southern Kabul. In May or early June, Hekmatyar's forces started to fire cannons and grenade launchers toward targets all around Kabul. Much support came from the Pakistani Inter-Services Intelligence (ISI). Junbish-i Milli and Jamiat-e Islami in June shelled [or fired cannons and grenade launchers toward targets in areas south of Kabul. Ittehad-e Islami and Hezb-i Wahdat fought each other in western Kabul. In late of June 1992, Burhanuddin Rabbani took over as temporary president of Afghanistan. The government was weak even from its start in April 1992.\"The Peshawar Accord, April 25, 1992\". Website photius.com. Text from 1997, purportedly sourced on The Library of Congress Country Studies (USA) and CIA World Factbook. Retrieved 22 December 2017. In the rest of 1992, hundreds of rockets hit Kabul, and thousands, mostly civilians, were killed, Half-a-million people fled the city. In 1993, the rivalling militia factions continued their fights over Kabul, amd several ceasefires and peace accords failed. According to Human Rights Watch, from 1992 to 1995, five different mujahideen armies fought, which contributed to heavily damaging Kabul, but other analysts blame especially the Hezb-e Islami Gulbuddin group. == Taliban takeover == On 25 September, the strategic town of Sarobi, an eastern outpost of Kabul, fell to the Taliban which captured it from interim government troops. In the firghting, 50 people were killed, and the Taliban captured many arms from fleeing government soldiers. On 26 September, with the Taliban attacking Kabul, interim minister of defense Ahmad Shah Massoud, in his headquarters in northern Kabul, concluded that his and President Rabbani’s interim government's forces had been encircled, and decided on a quick evacuatation or withdrawl of those forces to the north to avoid destruction. Also, Hekmatyar, leader of Hezb-e Islami Gulbuddin, withdrew from Kabul. By nightfall or on the next day, 27 September, the Taliban had conquered Kabul. The leader Muhammad Umar appointed his deputy, Mullah Muhammad Rabbani, as head of a national ruling council, which was called Islamic Emirate of Afghanistan. By now, the Taliban controlled most of Afghanistan.Country profile: Afghanistan (published August 2008) (page 3). Library of Congress. Retrieved 13 February 2018. ==Related pages== *Afghan Civil War (1928–1929) *Afghan Civil War (1989–1992) ==References== Category:War in Afghanistan (since 1978)",
 "title": "Afghan Civil War (1992–1996)"
}