{
 "id": "867608",
 "text": "This is a list of best-selling video games. == List == Title Sales Series Platform(s) Initial release date Developer(s) Publisher(s) Minecraft 300,000,000 Minecraft Multi-platform November 18, 2011 Mojang Mojang Grand Theft Auto V 195,000,000 Grand Theft Auto Multi-platform Rockstar North Rockstar Games Tetris (EA) 100,000,000 Tetris Multi-platform EA Mobile Electronic Arts Wii Sports 82,900,000 Wii Wii Nintendo EAD Nintendo PUBG: Battlegrounds 75,000,000 PUBG Universe Multi-platform PUBG Studios Krafton Mario Kart 8 / Deluxe 65,470,000 Mario Kart Wii U / Switch Nintendo EAD / Nintendo EPD (Deluxe) Nintendo Red Dead Redemption 2 64,000,000 Red Dead Multi-platform Rockstar Games Rockstar Games The Elder Scrolls V: Skyrim 60,000,000 The Elder Scrolls Multi-platform Bethesda Softworks Bethesda Softworks name=url:https://in.ign.com/the-elder-scrolls-v- skyrim/186698/news/elder-scrolls-v-skyrim-has-sold-over-60-million-copies- globally Super Mario Bros. 58,000,000 Super Mario Multi-platform Nintendo R&D4; Nintendo Overwatch 50,000,000 Overwatch Multi-platform Blizzard Entertainment Blizzard Entertainment Human: Fall Flat Human: Fall Flat Multi- platform No Brakes Games Curve Digital The Witcher 3: Wild Hunt The Witcher Multi-platform CD Projekt Red CD Projekt Tetris (1989) 48,000,000 Tetris Game Boy / NES Nintendo R&D1; Nintendo Pokémon Red / Green / Blue / Yellow 47,520,000 Pokémon Multi-platform Game Freak Nintendo Terraria 44,500,000 None Multi-platform Re-Logic Re-Logic / 505 Games Wii Fit / Plus 43,800,000 Wii Wii Nintendo EAD Nintendo Animal Crossing: New Horizons 43,380,000 Animal Crossing Nintendo Switch Nintendo EPD Nintendo Pac-Man 42,071,635 Pac-Man Multi-platform Namco Namco Mario Kart Wii 37,380,000 Mario Kart Wii Nintendo EAD Nintendo Wii Sports Resort 33,140,000 Wii Wii Nintendo EAD Nintendo The Legend of Zelda: Breath of the Wild 32,850,000 The Legend of Zelda Wii U / Switch Nintendo EPD Nintendo Super Smash Bros. Ultimate 32,440,000 Super Smash Bros. Nintendo Switch Bandai Namco Studios / Sora Ltd. Nintendo New Super Mario Bros. 30,800,000 Super Mario Nintendo DS Nintendo EAD Nintendo New Super Mario Bros. Wii 30,320,000 Super Mario Wii Nintendo EAD Nintendo Call of Duty: Modern Warfare 30,000,000 Call of Duty Multi-platform Infinity Ward Activision Diablo III Diablo Multi-platform Blizzard Entertainment Blizzard Entertainment Stardew Valley Stardew Valley Multi-platform February 26, 2016 Eric Barone (ConcernedApe) Chucklefish Pokémon Gold / Silver / Crystal 29,490,000 Pokémon Game Boy Color Game Freak Nintendo Duck Hunt 28,300,000 None NES Nintendo R&D1; Nintendo Wii Play 28,020,000 Wii Wii Nintendo EAD Nintendo The Walking Dead 28,000,000 The Walking Dead Multi-platform Telltale Games Telltale Games Grand Theft Auto: San Andreas 27,500,000 Grand Theft Auto Multi-platform Rockstar North Rockstar Games Borderlands 2 27,000,000 Borderlands Multi-platform Gearbox Software 2K Games Super Mario Odyssey 26,950,000 Super Mario Nintendo Switch Nintendo EPD Nintendo Super Mario World 26,662,500 Super Mario Multi-platform Nintendo EAD Nintendo Call of Duty: Modern Warfare 3 26,500,000 Call of Duty Multi-platform Infinity Ward / Sledgehammer Activision FIFA 18 26,400,000 FIFA Multi-platform EA Vancouver EA Sports Call of Duty: Black Ops 26,200,000 Call of Duty Multi-platform Treyarch Activision Pokémon Sword / Shield 26,020,000 Pokémon Nintendo Switch Game Freak Nintendo / The Pokémon Company New Super Mario Bros. U / Luigi U / Deluxe 25,590,000 Super Mario Wii U / Switch Nintendo EAD Nintendo Pokémon Sun / Moon / Ultra Sun / Ultra Moon 25,510,000 Pokémon Nintendo 3DS Game Freak Nintendo / The Pokémon Company Grand Theft Auto IV 25,000 ,000 Grand Theft Auto Multi-platform Rockstar North Rockstar Games Palworld Palworld multi- platform Cyberpunk 2077 Cyberpunk Multi-platform CD Projekt Red CD Projekt Pokémon Diamond / Pearl / Platinum 24,730,000 Pokémon Nintendo DS Game Freak Nintendo / The Pokémon Company Super Mario Bros. 3 24,430,000 Super Mario Multi-platform Nintendo EAD Nintendo Horizon Zero Dawn 24,300,000 Horizon PlayStation 4 / Microsoft Windows Guerrilla Games Sony Interactive Entertainment Call of Duty: Black Ops II 24,200,000 Call of Duty Multi- platform Treyarch Activision Kinect Adventures! 24,000,000 None Xbox 360 Good Science Studio Xbox Game Studios Nintendogs 23,960,000 Nintendogs Nintendo DS Nintendo EAD Nintendo Mario Kart DS 23,600,000 Mario Kart Nintendo DS Nintendo EAD Nintendo Sonic the Hedgehog 23,482,960 Sonic the Hedgehog Multi- platform Sonic Team Sega Pokémon Ruby / Sapphire / Emerald 23,280,000 Pokémon Game Boy Advance Game Freak Nintendo / The Pokémon Company == References == == Notes == Category:Video game lists",
 "title": "List of best-selling video games"
}