{
 "id": "867700",
 "text": "Trousers (called pants in American English) first showed up in recorded history with the nomadic people across Western Europe. Archeological studies show men/boys and women/girls wore trousers and pants in relation to past societal cultures. For most of modern history, though, wearing pants/trousers was usually restricted to men and boys. In several regions across the world, such patterns were applied not just by social rules but also through laws. Different United States cities, in the 19th and 20th centuries, passed legislation that banned women and girls from wearing trousers/pants. One such law was passed by the San Francisco Supervisors' Board in 1863. This law made appearing in public wearing clothes of the opposite sex (males wearing female clothing or females wearing male clothes) illegal. Similar laws were already in effect for Chicago (passed in 1851) and Columbus, Ohio (passed in 1848). Further laws against cross-dressing were put into effect for Houston, Texas (passed in 1864) and Orlando, Florida (went into effect in 1907). Another almost two dozen United States cities also had these laws. Further laws against cross-dressing were put into effect far into the 20th century. They were made effective for Detroit, Michigan and Miami, Florida as recently as the 1950s. ==Early dress reform== In 1851, early women's rights advocate Elizabeth Smith Miller introduced Amelia Bloomer to a garment originally called the \"Turkish dress\" (knee length skirts over Turkish-style clothes). Bloomer was later working for and promoting the dress. Instructions for making the dress were included. The dresses were later called bloomers. Another woman who advocated publicly for dress changes was Mary Edwards Walker. She was an abolitionist in the 19th century and Civil War surgeon. Walker wore bloomers while working with a military hospital. In 1871, she wrote that women's dress should: \"protect the person, and allow freedom of motion and circulation, and not make the wearer a slave to it\". Walker publicly wore men's trousers. For doing so, she was arrested several times beginning in New York City in 1866. Other females were also arrested for similar behaviors in the 19th century. ==Changing cultures== ===United States and Europe=== ====1890s–1914==== Near the end of the 19th century, Parisian women and girls wore bloomers more often than English and American females. This might have been because the bloomers were presented for being fashionable items across France. In that country, fashion writers were against this. By 1895, though, many middle class American women and girls had adopted the bike and the bloomer. The women and girls began calling themselves 'New Women' despite the resistance from society. At that same time, these early women's and girls' trousers and pants became more diverse according to their uses for cycling, sexual stimulation and gymnastics. ====1914–1920==== During World War I (1914–1918), lots of females in several countries, like France, the United States and the United Kingdom were signed up for working in factories, especially military weapons factories. These women were also hired to aid the World War I effort and replacing men in the service sectors, like public transport. Women's trousers and pants became more socially acceptable in the World War I years. This was considered daring while women went against the normal dress rules. ====1930s==== The 20th century actresses Marlene Dietrich and Katharine Hepburn were often photographed while wearing trousers in the 1930s. The earlier was famous for having appeared in a tuxedo and matching fedora (a hat) at the 1932 first showings of The Sign of the Cross. Eleanor Roosevelt (1884–1962) was the beginning First Lady appearing in trousers at a formal function. She was in charge of the 1933 Easter Egg Roll while she wore riding trousers. ====1939–1945==== During World War II (1939–1945), history repeated itself in much larger scales. More women during World War II than in World War I cut their hairs and put on trousers. They did this for the task of working in factories while men were sent to battlefields. In 1942–1945, more American women entered the labor forces than ever before. Unlike decades before, clothing manufacturers didn't look to Parision couture designs (meaning fashionable made-to-wear clothes) for being inspired. They developed their own clothing styles within limits that were set by war-time needs. ====1946–1959==== Unlike during the Interwar period (between the World Wars), women's trousers made a lasting step forward after World War II. They were used as pieces of clothing for everyday use and a fashion statement. In the years after the war, trousers/pants were still common for socializing, leisure and gardening. But apart from those, actresses like Katharine Hepburn, Audrey Hepburn (not directly related to Katharine with the same family name), Coco Chanel and Marlene Dietrich wore trousers/pants in public for uses every day. As a whole, however, most women and girls resumed everyday uses of skirts and dresses as the standard outfit in workplaces, like offices by the mid-to-late 1950s. It was in the late 1950s, during which time Capri pants became very popular, that major changes began showing. ==References== Category:Trousers and shorts Category:Women's rights Category:Clothing controversies",
 "title": "Trousers as women's clothing"
}