{
 "id": "86798",
 "text": "The Pyramids of Egypt are among the largest structures ever built and are one of the most important examples of Ancient Egyptian civilisation. wow The Great Pyramid of Khufu. Retrieved April 12, 2005. \"The Great Pyramid of Khufu is the largest pyramid in Egypt and was the tallest man-made structure in the world until 1888.\" Most were built during the Old and Middle Kingdom periods.Michael Ritter (2003) Dating the Pyramids. Retrieved April 13, 2005 The pyramid were mostly made of limestone. The top layers were casing blocks of especially good white limestone laid on top of the main blocks. Each casing block was then trimmed so that the outer surface of the pyramid would be smooth and white. Some capstones were covered with metal leaf. The casing blocks from the Great Pyramid of Giza were all removed in the 14th and 15th centuries A.D. and used to build the city of Cairo. Some casing blocks still remain on the top of the pyramid next to Khufu's (belonging to Khafra). The ancient Egyptians built pyramids as tombs for the pharaohs and their queens. The pharaohs were buried in pyramids of different sizes from before the beginning of the Old Kingdom to the end of the Middle Kingdom. Three small pyramids were built on the eastern side of the great pyramid. These pyramids were built for Khufu's queens. A small satellite pyramid was built near the queens' pyramids. Some experts believe that this may have been built as a symbolic tomb for Khufu's ka (spirit). Surrounding the pyramid there are several hundred mastaba tombs of nobles. The nobles wanted to be buried close to their pharaoh so that they would stay close to him in the next life. == Construction dates == There are about eighty pyramids known today from ancient Egypt. The three largest and best-preserved of these were built at Giza in the Old Kingdom. The best-known of these pyramids was built for the pharaoh Khufu. It is known as the 'Great Pyramid'. The following table lays out the dates of construction of most of the major pyramids. Each pyramid is identified by the pharaoh who ordered it built, their approximate reign and its place. Pyramid / Pharaoh Reign Field Djozer c. 2630 - 2612 BC Saqqara aramida Sneferu (bent) c. 2612 - 2589 BC Dashur Sneferu (red) c. 2612 - 2589 BC Dashur Sneferu (ruined) c. 2612 - 2589 BC Meidum Khufu c. 2589 - 2566 BC Giza Djedefre c. 2566 - 2558 BC Abu Rawash Khafre c. 2558 - 2532 BC Giza Menkaure c. 2532 - 2504 BC Giza Sahure c. 2487 - 2477 BC Abusir Neferirkare Kakai c. 2477 - 2467 BC Abusir Nyuserre Ini c. 2416 - 2392 BC Abusir Amenemhat I c. 1991 - 1962 BC Lisht Senusret I c. 1971 - 1926 BC Lisht Senusret II c. 1897 - 1878 BC el-Lahun Amenemhat III c. 1860 - 1814 BC Hawara ==Related pages== * Pyramid * Giza Necropolis == References == == Other websites == * Old Kingdom Pyramids of Egypt - Aldokkan * Pyramids of Egypt – Comprehensive site by an Egyptian archaeology enthusiast that includes spectacular photographs of dozens of pyramids. * Ancient Authors – A site that quotes descriptions of the \"Labyrinth\" of Amenemhet III's pyramid at el-Lahun by various ancient authors. * Ancient Egyptian History - A comprehensive & consise educational website focusing on the basic and the advanced in all aspects of Ancient Egypt * ANCIENT EGYPT - History & Chronology – A site detailing the major pyramid sites of ancient Egypt and Nubia (Sudan). * www.great-pyramid.info – Photographs and information on Egyptian pyramids. * Pyramids of Giza colour satellite imagery (Wikimapia - Google maps) * Pyramids in relation with the Noble Quraan (Quran) * diagram of an ancient pyramid from bbc.co.uk * Great Pyramid of Giza -Citizendium * Pyramids of Egypt * Pyramids of Giza color satellite imagery Category:Pyramids Category:Buildings and structures in Ancient Egypt",
 "title": "Egyptian pyramids"
}