{
 "id": "867981",
 "text": "Aggabai Sasubai (translation: Oh Mine Mother-In-Law) is an Indian Marathi- language television show that aired on Zee Marathi from 22 July 2019 to 13 March 2021 in 432 episodes altogether. Directed by Ajay Mayekar, produced by Sunil Bhosle under the production banner of Someel Creations and distributed by Zee Entertainment Enterprises, the show stars an ensemble cast of Girish Oak, Nivedita Joshi Saraf, Ashutosh Patki, Tejashree Pradhan, Ravi Patwardhan and Sanjeevani Sathe in the lead roles. == Synopsis == Aggabai Sasubai is the story of Asavari Kulkarni (Nivedita Joshi Saraf), a reclusive, loving, caring and selfless widow, who tragically lost her husband at a young age and single- handedly raised her son, Soham (Ashutosh Patki), in addition with looking after the health of her elderly, authoritative father-in-law, Dattatray (Ravi Patwardhan / Mohan Joshi), also known as Aajoba. She is also often ridiculed and insulted by her jealous neighbour, Pradnya (Sanjeevani Sathe), who is the daughter-in-law of Aajoba's childhood friend, Vidyadhar (Arun Mohre), also known as Karkhanis Kaka, and his wife, Prabha (Rajshri Potdar), also known as Karkhanis Kaku. Asavari leads a simple middle-class life with Soham and Aajoba until Soham gets married to his long-time girlfriend, Shubhra (Tejashree Pradhan). Soham and Shubhra's marriage party is held at the restaurant run by Chef Abhijeet Raje (Girish Oak), an upper-class celebrity chef whose daily cookery show on the TV is Asavari's favourite. When he meets her at his restaurant, Abhijeet falls in love with Asavari and asks her to teach him prepare a certain recipe made from pumpkin. Impressed by the dish, Abhijeet sends his restaurant manager, Mandodari Parab (Bhakti Ratnaparkhi), also known as Maddy, to the Kulkarni residence with a cheque for Asavari as royalty payment for the pumpkin recipe. Due to a misunderstanding, Abhijeet's marriage is fixed with Maddy, but Asavari's daughter-in-law, Shubhra, who wishes for her mother-in-law's happiness, meets Abhijeet and brings out the truth that he loves Asavari. Eventually, Abhijeet proposes to Asavari and they decide to get married. However, both Soham and Aajoba disapprove of Asavari getting remarried, and attempt to spoil Abhijeet and Asavari's relationship, with the instigation of Pradnya. What happens next? Do Abhijeet and Asavari get married? Watch out the full show to know how the story unfolds as Soham and Aajoba learn an important lesson from Abhijeet, Asavari and Shubhra. == Cast == === Main === * Girish Oak as Chef Abhijeet Raje: Asavari's second husband, Soham's step-father; Shubhra's step-father-in-law; Aajoba's step-son-in-law; Maddy's employer * Nivedita Joshi Saraf as Asavari Prabhakar Kulkarni / Asavari Abhijeet Raje: Abhijeet's wife; Prabhakar's ex-widow; Soham's mother; Shubhra's mother-in-law; Aajoba's daughter-in-law * Ashutosh Patki as Soham Prabhakar Kulkarni: Shubhra's husband; Pradnya's boyfriend; Prabhakar and Asavari's son; Abhijeet's step-son; Aajoba's grandson; Anil and Asha's son-in- law * Tejashree Pradhan as Shubhra Anil Kamat / Shubhra Soham Kulkarni: Soham's wife; Anil and Asha's daughter; Prabhakar and Asavari's daughter-in- law; Abhijeet's step-daughter-in-law; Aajoba's granddaughter-in-law * Ravi Patwardhan / Mohan Joshi as Dattatray Bandopant Kulkarni (Aajoba): Prabhakar's father; Asavari's father-in-law; Abhijeet's step-father-in-law; Soham's grandfather; Shubhra's grandfather-in-law * Sanjeevani Sathe as Pradnya Sunil Karkhanis: Sunil's wife; Karkhanis Kaka and Kaku's daughter-in-law; Soham's girlfriend ===Supporting=== * Arun Mohre as Vidyadhar Karkhanis (Kaka): Karkhanis Kaku's husband; Sunil's father; Pradnya's father-in-law; Aajoba's friend * Rajashri Potdar as Prabha Vidyadhar Karkhanis (Kaku): Karkhanis Kaka's wife; Sunil's mother; Pradnya's mother-in-law * Bhakti Ratnaparkhi as Mandodari Parab (Maddy): Abhijeet's friend and manager * Pratibha Goregaonkar as Sulbha Samant (Kaku): Asavari's friend * Bhagyesh Patil as Vishwas: waiter at Abhi's Kitchen * Nikhil Jhope as Akshay Wagh / Nikhil: Soham and Shubhra's friend * Mahesh Kokate as Kamlakar Katekor: Asavari's ex-fiancée * Leena Athavale Datar as Asha Anil Kamat: Anil's wife; Shubhra's mother; Soham's mother-in-law * Sahil Parab as Boy Bala: Soham's domestic worker * Rajesh Bhosle as Mangesh: Abhijeet and Asavari's neighbour in chawl * Purniema Dey as Twinkle: a girl in a nightclub who sings for Soham == Production == === Casting === Nivedita Joshi Saraf, spouse of renowned actor Ashok Saraf, was selected for the role of the female protagonist, Asavari, along with Tejashree Pradhan for Shubhra after her success in the television show Honaar Sun Mi Hya Gharchi. Girish Oak played the male protagonist, Abhijeet, while Ravi Patwardhan portrayed the character of Aajoba (lit. \"Grandfather\"). Ashutosh Patki, son of renowned music composer Ashok Patki, and Bhakti Ratnaparkhi, spouse of actor Nikhil Ratnaparkhi, portrayed Soham and Maddy, respectively. However, Patwardhan's role was replaced by actor Mohan Joshi from January to March 2021 after the latter's demise on 5 December 2020. === Airing History === The show premiered on 22 July 2019 from Monday to Saturday at 8:30 p.m. by replacing Tula Pahate Re, which starred Subodh Bhave and Gayatri Datar in titular roles and was last-aired on 20 July 2019. However, it had to take a break from 27 March 2020 due to COVID-19 lockdown in India. The show was resumed from 13 July 2020, but had to be converted into a reality show for a week from 28 September - 4 October 2020 when Nivedita Joshi Saraf was diagnosed with COVID-19. The show was last-aired on 13 March 2021 after 432 episodes. == Episodes == All the episodes have been directed by Ajay Mayekar and Jayant Pawar and produced by Sunil Bhosle under the production banner of Someel Creations. The show had completed exactly half of the episodes before the COVID-19 lockdown. # Title Original Aired ===Special Episodes=== ====2:30 Hours==== * 19 January 2020 (Abhijeet-Asavari's Marriage) ====1 Hour==== * 17 January 2021 (Asavari-Aajoba's Reunion) * 21 February 2021 (Asavari-Soham's Reconciliation) No. Airing Date Days Time (IST) 1 22 July 2019 – 27 March 2020 Mon-Sat (sometimes Sun) 8:30 pm 2 13 July 2020 – 13 March 2021 == Sequel == Due to the success of Aggabai Sasubai, the makers decided to replace it with a sequel titled Aggabai Sunbai from 15 March 2021, which focuses on the life of Shubhra. Girish Oak, Nivedita Joshi Saraf, Mohan Joshi and Bhakti Ratnaparkhi reprised their roles of Abhijeet, Asavari, Aajoba and Maddy, respectively, while Ashutosh Patki and Tejashree Pradhan were replaced by Adwait Dadarkar and Uma Pendharkar for the roles of Soham and Shubhra, respectively. The sequel also starred Anvit Hardikar, Chinmay Udgirkar and Geetanjali Ganage as Soham and Shubhra's 8-year-old son, Shubham, Shubhra's live-in partner, Anurag Desai, and Soham's girlfriend, Susanne, respectively. However, the show ended up having a sudden cancellation after 136 episodes on 21 August 2021 due to low TRPs, and was replaced by Mazhi Tuzhi Reshimgaath premiering on 23 August 2021 and starring Shreyas Talpade and Prarthana Behere. == Adaptations == Language Title Original release Network(s) Last aired Notes Marathi Aggabai Sasubai अग्गंबाई सासूबाई 22 July 2019 Zee Marathi 13 March 2021 Original Malayalam Manam Pole Mangalyam മനംപോലെ മംഗല്യം 28 December 2020 Zee Keralam 2 January 2022 Remake Tamil Pudhu Pudhu Arthangal புதுப்புது அர்த்தங்கள் 22 March 2021 Zee Tamil Ongoing Punjabi Sasse Ni Sasse Tu Khushiyan Ch Vasse ਸੱਸੇ ਨੀ ਸੱਸੇ ਤੂ ਖੁਸ਼ੀਆਂ ਚ ਵਸੇ 25 April 2022 Zee Punjabi Kannada Shreerastu Shubhamastu ಶ್ರೀರಸ್ತು ಶುಭಮಸ್ತು Zee Kannada == Ratings == The show received highest TVR of 7.0 in week 28 of 2020. Week Year BARC Viewership Ref. TVT Rank Week 30 2019 4.2 5 Week 44 2019 5.4 1 Week 45 2019 5.8 1 Week 46 2019 5.2 1 Week 47 2019 5.7 1 Week 48 2019 3.5 5 Week 49 2019 3.9 3 Week 52 2019 4.7 2 Week 53 2019 4.1 2 Week 1 2020 3.6 3 Week 2 2020 3.2 5 Week 3 2020 4.3 2 Week 4 2020 2.9 5 Week 5 2020 3.3 3 Week 6 2020 3.3 3 Week 7 2020 3.5 3 Week 8 2020 3.0 4 Week 9 2020 2.8 3 Week 10 2020 5.6 1 Week 11 2020 4.3 2 Week 28 2020 4.2 1 Week 29 2020 4.3 1 Week 31 2020 3.3 4 Week 32 2020 3.6 4 Week 33 2020 3.3 4 Week 34 2020 3.5 3 Week 35 2020 3.7 5 Week 37 2020 3.4 4 Week 2 2021 3.9 4 Week 3 2021 3.9 4 Week 4 2021 3.9 5 == Awards == Zee Marathi Utsav Natyancha Awards Year Category Recipient Role 2019 Best Serial Sunil Bhosale Producer Best Family Kulkarni Family Best Onscreen Couple Nivedita Joshi-Saraf & Girish Oak Asawari & Abhijeet Best Title Song Ashok Patki Composer Best Mother Nivedita Joshi-Saraf Asawari Best Mother-in-law Best Daughter-in-law Best Father-in-law Ravi Patwardhan Aajoba Best Comedy Character Bhakti Ratnaparkhi Maddy 2020 Best Mother-in-law Nivedita Joshi-Saraf Asawari Best Daughter-in-law Tejashri Pradhan Shubhra == References == Category:Soap operas Category:Zee Marathi original programming Category:2010s Indian television series Category:2019 Indian television series debuts Category:2020s Indian television series Category:2021 Indian television series endings",
 "title": "Aggabai Sasubai"
}