{
 "id": "868219",
 "text": "The painted-belly leaf frog (Phyllomedusa sauvagii) is a frog that lives in rainforests in Bolivia, Paraguay, Argentina, and Brazil. Scientists think that the chemicals this frog makes in its skin have many uses. People have seen this frog between 0 and 1000 meters above sea level. ==Appearance and behavior== The adult male frog is 69.0 to 89.2 mm long from nose to rear end, and the adult female frog is 83.4 to 96.6 mm long. It has a short nose for a frog. It has circular teeth in its jaws. Its eyes are gray. Its pupils go up and down and open side to side like a cat's. It has disks on its toes for climbing, but they are small. It does not have webbed feet. Its skin is light brown to bright green in color and wrinkled. Sometimes this frog has white stripes on its belly and jaw. This frog does not hop. It walks. It has an opposable thumb for holding on to branches and twigs, so it moves through the trees the way a monkey or lemur does. Because this frog lives in trees instead of on the ground, it can dry out. The frog makes wax in its skin and spreads the wax all over its body with its feet. This makes it harder for water to leave the frog's body through the skin. This way, the frog can sit in the sun to warm up and it will not dry out Scientists are not sure what this frog eats. ==Breeding== The frogs build nests in trees over bodies of water. The frogs fold leaves into nests. The female lays 200 to more than 800 eggs at a time. The frogs put jelly over the eggs. This stops the eggs from drying out. When the tadpoles hatch, they fall out of the nest into the water. ==Threats== This frog is not endangered but there are fewer of them than there were. This is because human beings change the places where they live, especially to dig good rocks out of the earth, because of not enough rain, because chemicals used to kill pests kill the frogs too, and because human beings catch them to sell as pets. There are no international laws against having a painted-belly leaf frog as a pet. ==Science== This frog makes a chemicals in its skin. The chemicals are toxins, or poisons. When another animal tries to eat the frog, it gets the poison in its mouth. Scientists think humans could use some of these chemicals to kill dangerous microbes. Phylloseptin-1 is one of the chemicals that the frog makes. Scientists studied Phylloseptin-1 and saw it could kill Staphylococcus aureus bacteria, even after the bacteria had built a biofilm to protect themselves. Another chemical, Phylloseptin-S, can kill parasites, for example Leishmania infantum, Leishmania braziliensis, and Leishmania major. The chemical Sauvagine is already used in medicine because it works very much like urotensin I, which can help human hearts and help the chemicals in the human body work well. ==References== Category:Frogs of South America",
 "title": "Phyllomedusa sauvagii"
}