{
 "id": "868366",
 "text": "The 2021 Liberal Democratic Party leadership election was held on 29 September 2021 to elect the next President of the Liberal Democratic Party of Japan. The winner of the election is expected to lead the party in the upcoming 2021 Japanese general election. Current party President and Prime Minister Yoshihide Suga announced on September 3 that he would not run for re-election. Former Minister of Foreign Affairs Fumio Kishida was elected party leader and became Prime Minister on 4 October. ==Candidates== ===Declared=== Candidate(s) Notable positions Party faction(s) District(s) Announced Reference(s) Fumio Kishida Member of the House of Representatives Minister of Foreign Affairs Acting Defense Minister Kōchikai Hiroshima 1st district 26 August Sanae Takaichi Member of the House of Representatives Minister of Internal Affairs and Communications Nara 2nd district 26 August Taro Kono Member of the House of Representatives Chair of the National Public Safety Commission Minister for Foreign Affairs Minister of Defense Minister for Administrative Reform & Regulatory Reform Shikōkai Kanagawa's 15th district 3 September Seiko Noda Member of the House of Representatives Minister of Internal Affairs and Communications Gifu 1st district 5 September ===Withdrawn=== Candidate(s) Notable positions Party faction(s) District(s) Announced Withdrew Reference(s) Yoshihide Suga Prime Minister Member of the House of Representatives Kanagawa 2nd district 17 July 3 September ==Results== Results Candidate 1st Round 2nd Round Diet members Party members Total points Diet members Prefectural chapters Total points Votes cast % Popular votes % Allocated votes % Total votes % Votes cast % Votes cast % Total votes % Fumio Kishida 146 38.42 219,338 28.86 110 28.80 256 33.60 249 65.53 8 17.02 257 60.19 Taro Kono 86 22.63 335,046 44.08 169 44.24 255 33.46 131 34.47 39 82.98 170 39.81 Sanae Takaichi 114 30.00 147,764 19.44 74 19.37 188 24.67 colspan=\"6\" Seiko Noda 34 8.95 57,927 7.62 29 7.59 63 8.27 colspan=\"6\" Total 380 100 760,075 100 382 100 762 100 380 100 47 100 427 100 ==References== Category:September 2021 events Category:2021 in Japan Category:2021 elections in Asia Category:Politics of Japan Category:Liberal Democratic Party (Japan)",
 "title": "2021 Liberal Democratic Party (Japan) presidential election"
}