{
 "id": "868409",
 "text": "The Executive Office of the President (EOP) is made up of the offices and agencies that support the work of the president of the United States at the center of the executive branch of the U.S. federal government. The EOP consists of several offices and agencies, such as the White House Office (the staff working closest with the president, including West Wing staff), the National Security Council, Homeland Security Council, Office of Management and Budget, Council of Economic Advisers, and others. The Eisenhower Executive Office Building houses most staff. == List of executive office staff members == The information in the following table is current as of January 20, 2025. Only principal executives are listed; for subordinate officers, see individual office pages. Members of the Executive Office of the President of the United States Agency Principal executive Incumbent White House Office Assistant to the President and Chief of Staff Susie Wiles National Security Council Assistant to the President for National Security Affairs Michael Waltz Homeland Security Council Assistant to the President for Homeland Security and Counterterrorism Stephen Miller Council of Economic Advisers Chairman of the White House Council of Economic Advisers Vacant, TBD Council on Environmental Quality Chairman of the Council on Environmental Quality Vacant, TBD Executive Residence Staff and Operations White House Chief Usher Robert B. Downing National Space Council Executive Secretary of the National Space Council Chirag Parikh President's Intelligence Advisory Board Chairman of the President's Intelligence Advisory Board Devin Nunes Office of Administration Director of the Office of Administration Dave Noble Office of Management and Budget Director of the Office of Management and Budget Matthew Vaeth, Acting Office of National Drug Control Policy Director of National Drug Control Policy Vacant, TBD Office of the National Cyber Director National Cyber Director Harry Coker Office of Science and Technology Policy Director of the Office of Science and Technology Policy Vacant, TBD Office of the United States Trade Representative United States Trade Representative Juan Millan, Acting Office of the Vice President of the United States Assistant to the President and Chief of Staff to the Vice President Jacob Reses == White House offices == The White House Office (including its various offices listed below) is a sub-unit of the Executive Office of the President (office). The various agencies of the office are listed above. * Office of the Chief of Staff * Office of the National Security Advisor * Domestic Policy Council * National Economic Council * Office of Cabinet Affairs * Office of Digital Strategy * White House Office of Communications * Office of the First Lady * Office of Intergovernmental Affairs * Office of Legislative Affairs * Office of Management and Administration * Office of Political Affairs * Office of Public Engagement * Office of Presidential Personnel * Office of Scheduling and Advance * Office of the Staff Secretary * Office of White House Counsel * Oval Office Operations * White House Fellows * White House Military Office * White House Office of Gun Violence Prevention ==Notes== == References == Category:United States Executive Cabinet",
 "title": "Executive Office of the President of the United States"
}