{
 "id": "868455",
 "text": "The vice president of the Republic of Nicaragua () is the second highest political position in Nicaragua. The Vice President is elected on the same ticket, and at the same time, as the President. ==List== Name Inaugurated Left Office President Notes Roberto Sacasa Sarria April 1887 1 August 1889 Evaristo Carazo Presidential designate Gen. Anastasio J. Ortiz Argeñal 15 September 1893 9 January 1894 José Santos Zelaya Francisco Baca 1894 February 1896 José Santos Zelaya Adolfo Díaz August 1910 May 1911 Juan José Estrada Fernando Solórzano January 1913 December 1916 Adolfo Díaz Nemesio Martínez January 1917 December 1920 Emiliano Chamorro Vargas Bartolomé Martínez González January 1921 12 October 1923 Diego Manuel Chamorro Martínez succeeded to the presidency Juan Bautista Sacasa 1 January 1925 14 March 1926 Carlos José Solórzano Enoc Aguado Farfán 1 January 1929 1 January 1933 José María Moncada Rodolfo Espinosa Ramírez 1 January 1933 9 June 1936 Juan Bautista Sacasa Francisco Navarro Alvarado January 1937 March 1939 Anastasio Somoza García Mariano Argüello Vargas 22 November 1947 May 1950 Víctor Manuel Román y Reyes Silvio Argüello Cardenal, Gustavo Raskosky and Lorenzo Guerrero Gutiérrez 1 May 1963 4 August 1966 René Schick Guerrero succeeded to the presidency Silvio Argüello Cardenal and Gustavo Raskosky 4 August 1966 1 May 1967 Lorenzo Guerrero Gutiérrez Francisco Urcuyo Maliaños, Alfonso Callejas Deshón 1 May 1967 1 May 1972 Anastasio Somoza Debayle Vacant 1 May 1972 10 January 1985 Sergio Ramírez Mercado 10 January 1985 25 April 1990 Daniel Ortega Virgilio Godoy 25 April 1990 October 1995 Violeta Chamorro Resigned to pursue presidency Julia Mena October 1995 10 January 1997 Violeta Chamorro Enrique Bolaños 10 January 1997 October 2000 Arnoldo Alemán Resigned to pursue presidency Leopoldo Navarro Bermúdez October 2000 10 January 2002 Arnoldo Alemán José Rizo Castellón 10 January 2002 October 2005 Enrique Bolaños Resigned to pursue presidency Alfredo Gómez Urcuyo October 10, 2005 10 January 2007 Enrique Bolaños Jaime Morales Carazo 10 January 2007 10 January 2012 Daniel Ortega Omar Halleslevens 10 January 2012 10 January 2017 Daniel Ortega Rosario Murillo 10 January 2017 Incumbent Daniel Ortega ==References== ==Other websites== * Vicepresidency",
 "title": "Vice President of Nicaragua"
}