{
 "id": "868712",
 "text": "The 6 Lexington Avenue Local and <6> Pelham Bay Park Express are two rapid transit services in the A Division of the New York City Subway. Local service is shown by a (6) in a circular bullet, and express service is shown by a <6> in a diamond-shaped bullet. == Route == === Service pattern === The following table shows the lines used by 6 and <6>. The shaded boxes show the route at the specified times. Line From To Tracks Times weekday peak direction all other times IRT Pelham Line (full line) Pelham Bay Park Castle Hill Avenue local Parkchester Third Avenue–138th Street express local IRT Lexington Avenue Line 125th Street Brooklyn Bridge–City Hall === Stations === Stations Subway transfers Connections/other notes The Bronx Pelham Line Pelham Bay Park Bx12 Select Bus Service Buhre Avenue Middletown Road Westchester Square–East Tremont Avenue Zerega Avenue Castle Hill Avenue Parkchester Q44 Select Bus Service On weekdays, all local peak direction and alternating trains in the off peak direction during rush hour and midday begin and end at this station. | St. Lawrence Avenue | Morrison Avenue–Soundview | Elder Avenue | Whitlock Avenue Hunts Point Avenue Bx6 Select Bus Service | Longwood Avenue | East 149th Street | East 143rd Street–St. Mary's Street | Cypress Avenue | Brook Avenue Third Avenue–138th Street Some a.m. rush hour trips to Manhattan begin or end at this station Manhattan Lexington Avenue Line 125th Street 4 5 Metro-North Railroad at Harlem–125th Street M60 Select Bus Service to LaGuardia Airport One southbound p.m. rush hour trip begins at this station 116th Street 4 110th Street 4 103rd Street 4 96th Street 4 86th Street ↑ 4 5 M86 Select Bus Service Station is ADA-accessible in the northbound direction for the local platform only. 77th Street 4 M79 Select Bus Service 68th Street–Hunter College 4 59th Street ↑ 4 5 N R W (BMT Broadway Line at Lexington Avenue/59th Street) Out-of-system transfer with MetroCard/OMNY: F N Q R (63rd Street Lines at Lexington Avenue–63rd Street) Roosevelt Island Tramway Elevator access via Bloomingdale's in the northbound direction only during Bloomingdale's operating hours; no ADA access 51st Street 4 E M (IND Queens Boulevard Line at Lexington Avenue–53rd Street) Grand Central–42nd Street 4 5 7 <7> (IRT Flushing Line) S (42nd Street Shuttle) Metro-North Railroad at Grand Central Terminal 33rd Street 4 M15 Select Bus Service M34 / M34A Select Bus Service ⛴ NYC Ferry: Astoria and Soundview Routes (on FDR Drive and East 34th Street) 28th Street ↓ 4 Station is ADA-accessible in the southbound direction only. M15 Select Bus Service M23 Select Bus Service M34 / M34A Select Bus Service 23rd Street 4 M14A / M14D Select Bus Service M15 Select Bus Service M23 Select Bus Service M34 / M34A Select Bus Service ⛴ NYC Ferry: Soundview Route (on FDR Drive/Avenue C and East 20th Street) 14th Street–Union Square 4 5 L (BMT Canarsie Line) N Q R W (BMT Broadway Line) M14A / M14D Select Bus Service Astor Place ↓ 4 Elevator access via Kmart in the southbound direction only during Kmart's operating hours; no ADA access. Bleecker Street 4 B D F M (IND Sixth Avenue Line at Broadway–Lafayette Street) Spring Street 4 Canal Street 4 N Q R W (BMT Broadway Line) J Z (BMT Nassau Street Line) Brooklyn Bridge–City Hall 4 5 J Z (BMT Nassau Street Line at Chambers Street) == References == Category:New York City Subway",
 "title": "6 (New York City Subway service)"
}