{
 "id": "86874",
 "text": "A meme ( ) is an idea or belief which spreads because one person copies it from another. One idea is that culture builds in a way similar to living things. An example would be how viruses spread to different organisms. Memes change as they go, creating controversy, and sculpting society. Just as a virus would, memes evolve from their state, being photoshopped, and exaggerated. Memes can be about anything. Most memes are so called dank memes. Biologist and evolutionary theorist Richard Dawkins invented the word meme in 1976.Richard Dawkins, The Selfish Gene, 11. Memes:the new replicators, Oxford University, 1976, second edition, December 1989, ; April 1992, ; trade paperback, September 1990, He said that tunes, catch-phrases, beliefs, clothing fashions, ways of making pots, and the technology of building arches were all examples of memes. == Examples of memes == * Technology: cars, paper- clips, etc. The progress of technology is a bit like genetics, because it has spread by 'mutations' or changes to progress. For example, many paper-clip designs have been made. Some last longer than others, and some look better than others. In the end the ones that are copied are a memetic success. * Jokes spread and change the more they are told. * Proverbs * Gossip * Nursery rhymes: passed on from parent to child over many generations (thus keeping old words such as \"tuffet\" and \"chamber\" popular when they are not used today). * Epic poems: once important memes for preserving oral history; writing has largely superseded their oral transmission. * Conspiracy theories * Recipes * Fashions * Religions: complex memes, including folk religious beliefs, such as The Prayer of Jabez. * Popular concepts: these include Freedom, Justice, Ownership, Open Source, Egoism, or Altruism * Group-based biases: everything from anti-semitism and racism to cargo cults. * Longstanding political memes such As \"mob rule\", national identity, Yes Minister and \"republic, not a democracy\". * Programming paradigms: from structured programming and object- oriented programming to extreme programming. * Internet phenomena: Internet slang. \"Internet memes\" propagate quickly among users using email, websites, blogs, discussion boards and other Internet communications as a medium. * Moore's Law: this meme is particularly interesting. The original law was \"semiconductor complexity doubles every 18 months\". It described growth in terms of the number of transistors on a chip. * Metameme: The concept of memes itself is a meme. * Anecdotes: Short jokes or other stories. * Phrases; and common expressions. * Viral marketing: A type of marketing based on memes and using \"word of mouth\" to advertise (see the recent example of Snakes on a Plane). * Chain-letters ==Related pages== * Figure of speech * Internet meme * Propaganda * Rhetoric * Self-replication * Semiotics == References == == Literature == # Aunger, Robert: The Electric Meme: A New Theory of How We Think. Free Press, 2002, hardcover # Aunger, Robert: Darwinizing culture: the status of memetics as a science. Oxford University Press, 2000, New-York # Blackmore, Susan: The Meme Machine. Oxford University Press, 1999, hardcover , trade paperback , May 2000, # Fog, Agner: Cultural Selection. Dordrecht: Kluwer 1999. . # Henson, H. Keith: \"Sex, Drugs, and Cults. An evolutionary psychology perspective on why and how cult memes get a drug-like hold on people, and what might be done to mitigate the effects\", The Human Nature Review 2002 Volume 2: 343-355 # Henson, H. Keith: \"Evolutionary Psychology, Memes and the Origin of War.\" # Lanier, Jaron: \"The Ideology of Cybernetic Totalist Intellectuals\", an essay which criticises \"meme totalists\" who assert memes over bodies. # \"Evolutionary Models of Information Transmission\" Journal of Memetics # Principia Cybernetica holds a lexicon of memetics concepts, comprising a list of different types of memes. # A list of memetics publications on the web == Other websites == * MemesJoke.com 4chan.org and Reddit.com, where memes and are distributed, to users of the internet. * The Meme Machine, Interview of Susan Blackmore by Denis Failly * Journal of Memetics * The text of Dawkins' Selfish Gene, chapter 11, \"Memes: the new replicators\", in which Dawkins coined the word \"meme\" * The Mocking Memes: A Basis for Automated Intelligence , a 2006 book on a memetic theory of mind. * Cultural Software: A Theory of Ideology by Jack Balkin which uses memes to explain the growth and spread of ideology. * Why did the chicken cross the road? The story of a meme * A short piece by Mike Godwin on memes in Wired Magazine. * The Invasion of the Memes ─ memes as a useful metaphor, nothing more. * What is a Meme? by Brent Silby ─ an introductory article pitched at a general audience. * A discussion of memes by Deepak Chopra * \"Life cycles of successful genes\" , 2003, Robert Hoffmann * Memes.org ─ Just relaunched as a forum for discussion about memes and memetics. * Dawkins's speech on the 30th anniversary of the publication of The Selfish Gene, Dawkins 2006 * ,Whitty 2005 * The Evolution of Technology by Brent Silby ─ memetics used to explain human creativity. * \"Evolution and Memes: The human brain as a selective imitation device\": article by Susan Blackmore. * Dan Dennett discusses Memes: Video from Ted Talks - February 2002. Category:Anthropology Category:Philosophy",
 "title": "Meme"
}