{
 "id": "868803",
 "text": "Helen Elizabeth Archdale (21 August 1907 – 1 January 2000) was an English woman. She was an educationalist and she played the sport cricket. She played as a right-handed batter, and she played in 5 Test matches for England between 1934 and 1937. Archdale was the first captain of England's cricket team. She led them on their first tour of Australia and New Zealand in 1934/35. She played cricket in Britain for many regional teams and for Kent. ==Biography == Archdale was born in London. Her mother was Helen Archdale (née Russel), a well-known woman who worked to get women the right to vote in Britain. Helen Archdale was also an Irish professional soldier in the British Army. She died in World War I when she was eleven. Her godmother was Emmeline Pankhurst. Archdale went to Bedales School in Hampshire, where she learned to play cricket, and to St Leonards School in St Andrews, Fife.David Doughan (2004) \"Archdale, Helen Alexander (1876–1949)\", Oxford Dictionary of National Biography, Oxford University Press After school, Archdale went to McGill University in Montreal. She graduated in 1929 with a BA in Economics and Political Science. She studied law in London. She did some studying in the Soviet Union. In 1938, she was called to the Bar at Gray's Inn.Philip Jones (16 February 2000) Obituary: Betty Archdale, The Guardian, London During World War II, Archdale served in the Women's Royal Naval Service as a wireless operator in Singapore. She arrived in July 1941 at the head of a group of forty women trained in wireless telegraphy.'History of Far East Combined Bureau and H.M.S. Anderson', typescript in the National Archives, HW 4/25, chapter 2, p. 10. She was awarded an Order of the British Empire for helping nurses escape from the fighting. Archdale moved to Australia in 1946. She was appointed principal of Sydney University's \"Women's College\". She had that job for 10 years. Archdale was a member of the University Senate for 25 years, and she was a television and radio personality throughout the 1960s. Archdale was headmistress of the private girls school Abbotsleigh in Wahroonga, Sydney for 12 years atarting in 1958. Archdale changed things in the school: She started sex education and said the girls' uniforms did not have to have hats and gloves. She also added physics and said the school should teach more Australian history than British history. She lived on an estate in Galston, Sydney with her brother Alexander Archdale, an actor. ==Honours and legacy== In 1997, Archdale was listed as a National Living Treasure. In March 1999, Archdale was one of the first ten women to be given Honorary Life Membership of Marylebone Cricket Club in England. She died on 1 January 2000 at the age of 92, in Sydney. The Association of Heads of Independent Girls' Schools, 'Archdale Debating' competition (for Sydney's Private and Catholic Girls' schools) is named in her honour. ==References== == Other websites == * * ==Further reading== *Deirdre Macpherson, The Suffragette's Daughter: Betty Archdale, Her Life of Feminism, Cricket, War and Education, Rosenberg Publishing, Dural * Category:1907 births Category:2000 deaths Category:Australian educators Category:English and Welsh cricketers",
 "title": "Betty Archdale"
}