{
 "id": "86881",
 "text": "An analogy is a comparison between two things that are similar in some way. When you draw an analogy between two different things, you are comparing them because you want to make a concept easier to understand. :\"In general (but not always), such arguments belong in the category of inductive reasoning, since their conclusions do not follow with certainty but are only supported with varying degrees of strength\".Bartha, Paul 2013. Analogy and analogical reasoning. Stanford Encyclopedia of Philosophy. There is a difference between superficial analogies and profound analogies. Two things might look alike, but work quite differently, or they might look different, but work in ways like each other. Most effort is put into finding profound analogies which teach us something worth knowing. As another philosopher puts is: :\"The goal has been to find the formal criteria that distinguish good from bad analogical inference. These efforts have met with mixed success, at best\".Norton J.D. 2011. Formal and material approaches to analogical inference. Mario Bunge sees analogy as a main way of getting new hypotheses which can be tested. He points out that analogies may be based on similarities in behaviour, or in structure.Bunge, Mario 1967. Scientific research I: the search for system. Berlin: Springer-Verlag, p243/4. == Famous examples == *The parables of Jesus are analogies. For instance, in the parable of the sower the analogy of the seed falling on good ground is to \"such as hear the word, and receive it, and bring forth fruit\".Mark 4:320 *Charles Darwin chose the term \"natural selection\" as an analogy with the selection of domesticated animals and plants.Letter to Henslow, May 1860, in Darwin F. (ed) 1903. More letters of Charles Darwin. vol 1, London: Murray. The artificial selection of breeds of pigeons was one of his favourite studies. == References == ==Other websites and references== * Stanford Encyclopedia of Philosophy: Medieval Theories of Analogy. * Chalmers, D.J. et al. (1991). Chalmers, D.J., French, R.M., Hofstadter, D., High-Level Perception, Representation, and Analogy. * Gentner, D., Holyoak, K.J., Kokinov, B. (Eds.) (2001). The Analogical Mind: Perspectives from Cognitive Science. Cambridge, MA, MIT Press, * Itkonen, E. (2005). Analogy as Structure and Process. Amsterdam/Philadelphia: John Benjamins Publishing Company. * Juthe, A. (2005). \"Argument by Analogy\", in Argumentation (2005) 19: 1–27. * Holyoak, K.J., and Thagard, P. (1995). Mental Leaps: Analogy in Creative Thought. Cambridge, MA, MIT Press, . * Holyoak, K.J., and Thagard, P. (1997). The Analogical Mind. * Lamond, G. (2006). Precedent and Analogy in Legal Reasoning, in Stanford Encyclopedia of Philosophy. Category:Logic Category:Literary terms",
 "title": "Analogy"
}