{
 "id": "869000",
 "text": "Lai Khutsangbi () (/laai-khoot-shaang-bee/) is a demoness (hingchabi) in Meitei mythology and folklore. Her story is from Antique Kangleipak (Ancient Manipur). She has very long hands. The word \"Lai\" means \"deity or divinity,\" \"Khut\" means \"hand,\" and \"Sangbi\" or \"Shangbi\" means \"long\" in Manipuri (Meitei). The legend says that when she walks, her long hands touch the ground. Her fingers are as sharp as thorns. She has a large mouth with a long tongue. Her look is very frightening. == Story == There was a man and woman with a little child named Shasi (or \"Shachi\" or \"Leirik\" or \"Naocha\" in other versions) living in a house by itself in a village. Nearby was a forest where Lai Khutsangbi lived. She usually stole and ate livestock and human babies from the village. She took advantage of people's loneliness. The people in the village were afraid. Lai Khutsangbi wanted to eat the child Shasi. But Shasi's father, Shasipa was so brave that the Lai Khutsangbi was afraid of him. One day, Shasipa left home to work somewhere far away. He would be gone for days. Lai Khutsangbi came to the house at night, and asked Shasi's mother, Shasima if her husband was at home or not. Shasima was smart, so she lied and said her husband was at home. Lai Khutsangbi left. But she came back night after night and asked the same question again and again. Shasi's mother also gave the same reply, hiding the true fact that Shasipa was away. After some time, Shasi's father returned home and Shasi's mother told him what had happened. Shasi's father decided to defeat the demoness. That night, he waited for Lai Khutsangbi with a sharpened sword. At midnight, the demoness, as usual, came to ask Shasima if her husband was home. This time, Shasi's mother replied that he was away from home. Unaware of the trick, Lai Khutsangbi broke through the wall of the house with one of her powerful hands, trying to find Shasi, the child. Shasi's father, who was waiting for this opportunity, chopped off the hand with his sword. Then, the demoness screamed painfully, > Ayo Ema, I am dead! Ayo yo Ema ayo yo Leimadeng deng Ningjaobi You a big > liar Ayo yo Ema ayoyo Lai Khutsangbi ran away from the house, dragging her remaining long arm. The blood flew out of her cut arm and fell onto many plants growing on her way to the forest. It is said that the red patches seen on some plants is her blood. Shasi's father followed her into the woods. The demoness could not run fast because she was injured. Shasi's father caught her and stepped on her other remaining hand. Then, he chopped off that arm too. The villagers thanked Shasipa for his bravery. From that day onwards, Lai Khutsangbi, the long handed demoness, was never seen again. == Gallery == File:Lai Khutsangbi 2.jpg|Lai Khutsangbi File:The family of Shasi, the child who is desired by Lai Khutsangbi.jpg|The family of Shasi, the child who is desired by Lai Khutsangbi File:The family of Shasi, the child who is desired by Lai Khutsangbi 2.jpg|The family of Shasi, the child who is desired by Lai Khutsangbi File:Lai Khutsangbi aiming to the lonely house.jpg|Lai Khutsangbi aiming to the lonely house File:Lai Khutsangbi coming to human settlement.jpg|Lai Khutsangbi coming to human settlement File:Lai Khutsangbi coming to the village.jpg|Lai Khutsangbi coming to the village File:Lai Khutsangbi penetrating the wall of the house with her powerful hand.jpg|Lai Khutsangbi penetrating the wall of the house with her powerful hand File:Lai Khutsangbi's hand about to chopped off by Shasipa, Shasi's father.jpg|Lai Khutsangbi's hand about to chopped off by Shasipa, Shasi's father File:Lai Khutsangbi - The first hand being chopped off.jpg|The first hand being chopped off File:Lai Khutsangbi being followed by Shasi's father.jpg|Lai Khutsangbi being followed by Shasi's father File:Lai Khutsangbi - The second hand being chopped off.jpg|The second hand being chopped off == References == == Other websites == * The Secret of Lai Khutsangbi * Lai Khutsangbi, female power and punishment Category:Meitei mythical creatures",
 "title": "Lai Khutsangbi"
}