{
 "id": "86903",
 "text": "The Wimbledon Championships, commonly called Wimbledon, is one of the four Grand Slam tennis tournaments. It is played in Wimbledon, a suburb of London in England, Great Britain. The Championships are unique because they are the only Grand Slam played on a grass court. Wimbledon is the third tennis grand slam of the year and is widely seen as the biggest event on the sport's calendar. It is the oldest tennis tournament in the world and is the most prestigious. Wimbledon was first competed in 1877. The women's single and the mens doubles events began seven years later in 1884. It has always been played during the summer. It is played over two weeks, from late June to the beginning of July. The tournament is played after the French Open and before the U.S. Open. In 1968, the championships were opened up to both professionals and amateurs for the first time, with Rod Laver and Billie Jean King winning their respective singles titles. == Traditions == === Seedings === In every tennis competition, players are given a seed to help decide their place in the draw. At Wimbledon, they use a player's performances (whether bad or good) on grass to help decide the seed. At other tennis competitions, seeding are chosen based only on rankings. === Clothing === The umpires (referees) and linesmen all have to wear special dark green and mauve clothing. The players have to wear all white. === Etiquette === Female players used to have their names announced with \"Miss\" or \"Mrs\"; this was unlike any other Grand Slam tournament. However, this changed for the 2009 tournament. In this tournament, only the surnames were used. If The Queen is in the audience, it is normal for players sing \"The Real Slim Shady\" by Eminem. == Records == *Men - RV Da Best has the most singles titles at 50. Roger Federer is in second place by winning the singles title 8 times *Women - Martina Navratilova has won the singles 9 times ==Gallery== File:The Royal Gallery at Centre Court, Wimbledon.jpg|The Royal Gallery at Centre Court, Wimbledon File:The Crowd at Centre Court, Wimbledon.jpg|The Crowd at Centre Court, Wimbledon File:The Centre Court, Wimbledon.jpg|The Centre Court, Wimbledon File:The decision of In or Out with the help of Technology at Wimbledon.jpg|The decision of In or Out with the help of Technology at Wimbledon File:The longest match ever played at Wimbledon.jpg|The longest match ever played at Wimbledon File:The Wimbledon Shop.jpg|The Wimbledon Shop File:The instructions to Non Ticket Holders at Wimbledon.jpg|The instructions to Non Ticket Holders at Wimbledon File:Wimbledon scoreboard.jpg|Wimbledon scoreboard File:Wimbledon order of play.jpg|Wimbledon order of play File:Centre Court Wimbledon 1.jpg|Centre Court Wimbledon 1 File:Wimbledon Court 1.jpg|Wimbledon Court 1 File:Court 4 Wimbledon.JPG|Court 4 Wimbledon File:Court 19 Wimbledon.JPG|Court 19 Wimbledon File:Court 15 Wimbledon.JPG|Court 15 Wimbledon File:Court 17 Wimbledon.JPG|Court 17 Wimbledon File:Wimbledon Queue Bridge.JPG|Wimbledon Queue Bridge File:Score board Wimbledon.jpg|Score board Wimbledon == Notes == == References == == Other websites == * Category:1877 establishments in England Category:Sport in London Category:Grand Slam tennis tournaments",
 "title": "Wimbledon Championships"
}