{
 "id": "869049",
 "text": "Lee Jae-myung (; born 22 December 1964) is a South Korean politician and lawyer. He has been a member of the National Assembly since 2022. In August 2022, he was elected Leader of the Democratic Party. He resigned from the leadership role in April 2025 after announcing his presidential campaign in the 2025 snap presidential election. Lee was Mayor of Seongnam, the tenth largest city in South Korea, from 2010 to 2018. He is a member of the centre- liberal Democratic Party. In 2018, he became Governor of Gyeonggi Province. He became well known during his time as governor for his response to the COVID-19 pandemic. In July 2021, Lee announced his candidacy for President of South Korea in the 2022 election. He was seen as the front-runner for the presidency, leading in many polls until late 2021. He lost the election to conservative former prosecutor Yoon Suk-yeol by a small amount of votes in March 2022. In January 2024, Lee survived an assassination attempt. Later in November, he was convicted of violating the Public Official Election Act. However, the decision was overturned upon appeal, allowing him to run for public office again. During the 2024 South Korean martial law crisis, Lee became well known for climbing the National Assembly building fence and recording the event in a livestream. He later played a large role in leading the impeachment against Yoon. When Yoon was removed from office, Lee announced his third presidential campaign for the 2025 presidential elections. == Personal life == Lee was born on 22 December 1964 in Andong, the fifth of seven children. He was raised in poverty. As a child, he worked at a rubber factory illegally as he was not old enough to work. He hurt his finger during a work accident. In a second workplace injury, an industrial press crushed his wrist joint. The injury was untreated and caused a disability in his arm. He is registered as a disabled person. He studied at Chung-Ang University and Gachon University. He became a lawyer after graduating. In 1991, he married Kim Hye-kyung. They have two children. ==Mayor of Seongnam== As mayor of Seongnam, he was known for creating the city's social welfare program. From 2010 to 2014, Lee announced a moratorium on payments of debt. Some criticized Lee for this and accused him of creating a political stunt. Critics said the moratorium was not needed because the city had never been forced to repay the debt immediately. At the same time, he used the money saved to expand social welfare programs, such as offering a universal basic income for young people, free school uniforms and free postnatal care. Lee was also known for banning dog meat and to shut down dog slaughtering facilities in Moran Market. In 2016, Lee signed an agreement with shop owners that ended the display and slaughter of live dogs at the market. == Governor of Gyeonggi Province == After losing his first presidential campaign, Lee ran for Governor of Gyeonggi Province. Lee became known for his response to the COVID-19 pandemic as governor. Lee announced a special order for all foreigners working in Gyeonggi Province to be tested for COVID-19. Seoul announced similar policies but changed them to recommendation after facing criticism. == National Assembly == On 7 May 2022, Lee declared his candidacy in the June 2022 elections running for a district vacant seat in Incheon for the National Assembly. Lee won the seat in the elections on 1 June 2022. Afterwards, he was elected as the leader of the Democratic Party of Korea on 28 August and became the opposition leader. In 2023, Lee launched a 24-day hunger strike to protest President Yoon Suk Yeol's response to Japan’s release of radioactive wastewater from the Fukushima nuclear power, his handling of the country’s post-pandemic economy and his strict policies on North Korea. ==Presidential campaigns== ===2017=== While he was mayor of Seongnam, Lee ran for President of South Korea in 2017 after former president Park Geun-hye was impeached on corruption allegations. In the Democratic Party's primary election, Lee placed third behind Moon Jae- in, the former party chairman, and Ahn Hee-jung, the governor of South Chungcheong Province. Lee is part of the progressive wing in the Democratic Party. ===2022=== Lee declared his candidacy in the 2022 presidential election in July 2021. Lee became the nominee of the Democratic Party of Korea on 10 October 2021. Lee won a majority of the votes in the primary and made it directly to the presidential election without a runoff. In the general election, Lee lost to Yoon Suk Yeol of the People Power Party, 47.8% to 48.6%. ===2025=== On 9 April 2025, five days after the April 4 impeachment of President Yoon Suk Yeol, Lee resigned as leader of the Democratic Party. He announced his candidacy for the presidential election on 10 April. ==Corruption investigation== Since late 2022, Lee has been at the center of a corruption investigation. It is said that while he was mayor of Seongnam, he would receive donations from businesses and did them favors. On 10 January 2023, he went to the prosecutors office for questioning. This also marked the first time that an opposition leader was brought in for questioning regarding a criminal case, following the South Korean transition into democracy. In February 2023, a motion for the arrest of Lee Jae-myung, which was reapproved by the prosecution, was rejected by the National Assembly, however with a large number of rebel votes within the party. In September 2023, Seoul prosecutors pushed for another motion to arrest Lee on corruption charges for giving special favours to a land developer in Seongnam. On 21 September, the Democratic-majority National Assembly approved the motion, with a 149-136 vote, with dozens of his own party members voting to arrest him. On that day, he was given an arrest warrant, the first time an opposition leader was arrested since the country's democratic transition. As a result, Lee went on a hunger strike in protest against the charges and President Yoon Suk Yeol, accusing him of using the criminal justice system to scare political opponents. Lee was released after the Seoul Central District Court rejected the arrest warrant on 27 September 2023. ==Assassination attempt== On 2 January 2024, Lee was stabbed in the neck during a visit to Busan. Lee suffered a \"one-centimetre wound on his neck\" with minor bleeding. Lee was hospitalized at Pusan National University Hospital. He was then transferred to Seoul National University Hospital with \"non life-threatening\" injuries. Lee had emergency surgery later in the day and was in recovery under critical condition hours later. ==References== ==Other websites== * Lee Jae-myung on Twitter Category:1964 births Category:Living people Category:South Korean politicians Category:Mayors Category:Opposition leaders Category:Crime victims Category:South Korean lawyers Category:People with disabilities Category:South Korean activists Category:South Korean writers",
 "title": "Lee Jae-myung"
}