{
 "id": "869135",
 "text": "Hindu deities are the gods and goddesses in Hinduism. The terms for deity within the diverse traditions of Hinduism vary, and include Deva, Devi, Ishvara, Ishvari, Bhagavān and Bhagavati. Being gods and/or deities, they very much intertwine with Greek gods, goddesses, and mythology. Some Hindu deities include: Shiva, (Siva) is one of the most important gods and is considered a member of the holy trinity (trimurti) of Hinduism with Brahma and Vishnu. A complex character, he may represent goodness, benevolence and serve as the Protector. Vishnu, is the god of Preservation, the great maintainer who appears in various incarnations (avatara) to provide salvation for humanity. Some of his best-known avatars, who are tremendously popular and beloved throughout Hindu India, are the gods Krishna and Rama. Ganesha, also spelled Ganesh, also called Ganapati, elephant-headed Hindu god of beginnings, who is traditionally worshipped before any major enterprise and is the patron of intellectuals, bankers, scribes, and authors. Krishna is a major deity in Hinduism. He is worshipped as the eighth avatar of Vishnu and also as the supreme God in his own right. He is the god of protection, compassion, tenderness, and love and is one of the most popular and widely revered among Indian divinities. Durga, is a major deity in Hinduism. She is worshipped as a principal aspect of the mother goddess Devi and is one of the most popular and widely revered among Indian divinities. She is associated with protection, strength, motherhood, destruction and wars. Lakshmi, is the consort of the god Vishnu. She is one of the most popular goddesses of Hindu mythology and is known as the goddess of wealth and purity. Brahma, is the first god in the Hindu triumvirate, or trimurti. The triumvirate consists of three gods who are responsible for the creation, upkeep and destruction of the world. The other two gods are Vishnu and Shiva. Vishnu is the preserver of the universe, while Shiva's role is to destroy it in order to re-create. Hanuman, is a divine vanara companion of the god Rama. Hanuman is one of the central characters of the epic Ramayana. He is an ardent devotee of Rama and one of the chiranjivis. Rama is an incarnation of Vishnu, God of Protection. Vishnu is one of a trinity of the three most important Hindu gods – Brahma the creator, Vishnu the protector, and Shiva the destroyer. Vishnu has had nine incarnations on earth as different beings. One of these is as Rama. Kali goddess of time, doomsday, and death, or the black goddess (the feminine form of Sanskrit kala, “time-doomsday-death” or “black”) Saraswati is the goddess of knowledge, music, art, speech, wisdom, and learning. She is a part of the tridevi of Saraswati, Lakshmi, and Parvati. Indra, the king of the gods. He is one of the main gods of the Rigveda and is the Indo-European cousin of the German Wotan, Norse Odin, Greek Zeus, and Roman Jupiter. In early religious texts, Indra plays a variety of roles. Kartikeya, also known as Skanda, Kumara, Murugan, Mahasena, Shanmukha and Subrahmanya, is the Hindu god of war. He is a son of Parvati and Shiva, brother of Ganesha, and a god whose life story has many versions in Hinduism. Agni, fire-god of Hinduism, second only to Indra in the Vedic mythology of ancient India. He is equally the fire of the sun, of lightning, and of both the domestic and the sacrificial hearth. Parvati, (Uma or Gauri) is the Hindu goddess of fertility, love, beauty, harmony, marriage, children, and devotion; as well as of divine strength and power. Varuna, in the Vedic phase of Hindu mythology, the god-sovereign, the personification of divine authority. He is the ruler of the sky realm and the upholder of cosmic and moral law (rita), a duty shared with the group of gods known as the Adityas (see Aditi), of whom he was the chief. Vayu, is a primary Hindu deity, the lord of the winds as well as deity of breath and the spiritual father of Hanuman and Bhima. Radha, also called Radhika, is a Hindu goddess and a consort of the god Krishna. She is worshiped as the goddess of love, tenderness, compassion and devotion. She is considered an avatar of Lakshmi and is also described as the chief of gopis (milkmaids). Sita, is the heroine of the epic Ramayana and its other versions. She is described as the daughter of Bhūmi (the earth) and the adopted daughter of King Janaka of Videha and his wife, Queen Sunayana. Surya, Surya (also known as Aditya) is the Hindu god of the Sun. He is considered the creator of the universe and the source of all life. He is the supreme soul who brings light and warmth to the world. Rudra is a Rigvedic deity associated with wind or storm, Vayu and the hunt. One translation of the name is 'the roarer'. In the Rigveda, Rudra is praised as the 'mightiest of the mighty'. Rudra means \"who eradicates problems from their roots\". Shakti, In Hinduism, every god has a Shakti, or energy force. It's one of the reasons she is worshipped by millions of people throughout India. Shakti is also known as Parvati, Durga, and Kali, She's an archetype who you might call upon for strength, fertility, and power. Yama, the god of the dead. The Vedas describe him as the first man who died, blazing the path of mortality down which all humans have since followed. He is the guardian of the south (the region of death) and presides over the resting place of the dead, which is located under the earth. Prajapati, the great creator deity of the Vedic period of ancient India. In the post-Vedic age he came to be identified with the Hindu god Brahma. Category:Lists of gods and goddesses",
 "title": "Hindu deities"
}