{
 "id": "869337",
 "text": "Edgar Alexei Robert von Wahl or de Wahl (23 August 1867 – 9 March 1948) was a Baltic German teacher, mathematician and linguist. He is most famous for being the creator of Interlingue (known as Occidental throughout his life), a naturalistic constructed language based on the Indo-European languages, which was initially published in 1922. Edgar de Wahl was born in Kherson and spent his early childhood in Ukraine. Later, he moved with his family to Tallinn and then to Saint Petersburg, where he studied and served in the Imperial Russian Navy. After that, he worked as a teacher in Tallinn from 1894. When his home in Tallinn was bombed in 1943, he was imprisoned by Nazi troops. He refused to adhere to Heim ins Reich and was released in 1944 after his friends requested his transfer to a hospital due to his mental health issues. He died in a psychiatric hospital in 1948. De Wahl was first introduced to interlinguistics through Volapük, which his father's colleague Waldemar Rosenberger introduced him to. He composed a lexicon of marine terminology for the language before turning to Esperanto in 1888. He supported Esperanto and influenced the early work on its grammar and vocabulary along with the ophthalmologist L.L. Zamenhof. After the failure of Reformed Esperanto, which he supported, he started creating his ideal form of an international language. In 1922, de Wahl published a \"key\" to a new language, Occidental, and the first edition of the periodical Kosmoglott (later Cosmoglotta). He developed the language over several decades with input from its speakers but became estranged from the movement centered in Switzerland from 1939 after the start of World War II. Later, he joined the Committee of Linguistic Advisors, part of the International Auxiliary Language Association, which presented Interlingua in 1951. == Life == === Family history === Edgar de Wahl was a member of the Päinurme line of the Wahl noble family. Edgar de Wahl's great-grandfather was Carl Gustav von Wahl, who bought the Pajusi, Tapiku and Kavastu manors and was also the owner of Kaave Manor for a short time. Carl Gustav von Wahl had a total of 14 children from two marriages, from whom different Wahl lines started. Of them, Edgar von Wahl's grandfather Alexei von Wahl, a civil servant who bought Päinurme manor in 1837, laid the foundation for the Päinurme line. Also, he was a tenant at Taevere Manor, where Edgar's father Oskar von Wahl was born. === Childhood and youth === Edgar Alexei Robert (born von Wahl) was born on August 23, 1867 to Oskar von Wahl and Lydia Amalie Marie (married 1866 in Tallinn), in what is now Pervomaisk, Mykolaiv Oblast in Ukraine (then in the Kherson Governorate, Russian Empire). The Wahl family had moved to Ukraine after his, a railway engineer, started work on the Odesa- Balta-Kremenchuk-Kharkov railway in 1866. By 1869, the Wahl family had moved to Kremenchuk, where de Wahl's brother Arthur Johann Oskar was born in 1870. After that, the family moved to Tallinn, where Wahl's two sisters were born - Lydia Jenny Cornelia in 1871 and Harriet Marie Jenny in 1873. The family later moved to Saint Petersburg where the third sister Jenny Theophile was born in 1877. grew up in Saint Petersburg. He began studying at the Gymnasium in Saint Petersburg, graduating in 1886. He then studied at the Faculty of Physics and Mathematics at the University of Saint Petersburg and architecture and painting at the Saint Petersburg Academy of Arts. While at university, de Wahl joined the Baltic German operating in St. Petersburg, where he served as treasurer in the autumn term of 1891. De Wahl graduated in 1891 and in 1893 received a diploma as a teacher of drawing at the Elementary School of the Academy of Arts. De Wahl worked briefly as a substitute teacher in Saint Petersburg in the autumn of 1891, before entering the navy. During his boyhood, de Wahl learnt several languages; he became fluent in German, Russian, Estonian and French. In upper secondary school he studied Latin and ancient Greek, and Spanish at university. In addition to these, throughout his life he was able to make himself understood in nine other languages. de Wahl had an interest in creating languages from a young age: > Even in my youth, I had the idea of constructing a language. Full of stories > from Cooper, Gustave Aimard etc, I played American Indians with my friends, > and conceived the idea of a special quasi-Indian jargon for our games. It > was made of indian words taken from stories, and completed with other > necessary words taken from diverse other languages. It had a grammar > composed of mixed Ancient Greek and Estonian. This language was never used > because my friends refused to learn it. === Military service === In 1892 de Wahl volunteered to serve in the Russian Navy. During his service, he travelled a lot, visiting the Caribbean islands and the United States among other places. In early 1894, he received the rank of Michman (Russian: мичман) and retired shortly after that.[8] In the summer of 1904, de Wahl was again called to active service. He served in the Baltic Fleet until October 1905, although he did not participate in the battles of the Russo-Japanese War. According to the life stories of Estonian artist Olev Mikiver [et; sv], who knew de Wahl as a youth, de Wahl had been very proud of his Tsarist-era officer's uniform and sometimes even wore it later: It is, however, unlikely that de Wahl participated in the stopping the Sveaborg rebellion, having already been released from service by then. He may have been called to active service during the First World War. During his service in the Russian Navy, de Wahl was awarded the 2nd and 3rd rank of the Order of Saint Stanislav and the 3rd rank of the Order of Saint Anne. After getting the Estonian citizenship at the end of 1920 de Wahl was from 1921 also registered as a reserve officer of the Republic of Estonia. === Tallinn 1894-1917 === In 1894, de Wahl moved to Tallinn, where he spent most of the rest of his life. That autumn, he started working as a teacher of mathematics and physics at St. Peter's High School of Science (now the Tallinn Secondary School of Science). Later he taught drawing at run by Baronness Elisabeth von der Howen, the , and the Tallinn Cathedral School. His teaching was interrupted only by his military service. De Wahl's teaching style was described in the memoirs of the later Estonian Minister of Education Aleksander Veiderma, who himself studied at St Peter's High School of Science from 1906 to 1909: > English translation: Mathematics and physics were also taught by Edgar von > Wahl, a former naval officer who always had some interesting statements > about an event or person. He was very messy in conducting physics > experiments: utensils or glass often broke. His attitude towards students > was simple, which is also proven true by the nickname Sass. –Memoirs of > Aleksander Veiderma At the turn of the century, de Wahl's began to publish articles on linguistics in specialized publications, as well as writing in various Tallinn newspapers and magazines. Since 1898, de Wahl had been a member of the Estonian Literature Society (German: Ehstländische Literärische Gesellschaft), a German-language association that regularly organised presentations by and for its members. Under the pseudonym Julian Prorók, he published a booklet Ketzereien: Keimzellen einer Philosophie (Heresies: Gametes of a Philosophy) in 1906 about his vision of global developments. De Wahl also entered politics before the outbreak of World War I. In 1913 he was elected to the Tallinn city council, and became a member of the council committee for the protection of monuments of ancient buildings. Despite his teaching position, de Wahl did not address education issues on the City Council. He was an active attendee at council meetings, but spoke little. After the start of World War I, the Germans living in the Russian Empire were subjected to repression, from which did not completely escape; the , of which de Wahl had been a member, was closed. In autumn 1914, he found himself at the centre of a propaganda campaign to change German place names. As a city councillor, he participated in discussions on the renaming of the city of Tallinn, following Mayor Jaan Poska's proposal replace its name with the Old Russian-language Kolyvan (in the discussion of the matter, the incorrect name Kalyvan was used). discovered that the oldest names of the city were Ledenets or Lindanisa. He was interested in how much it would cost to change the name, which was said to have been met with \"general laughter\" at the council. The votes required to change the name were eventually reached by the council, but the change itself did not take place. De Wahl was elected to the city council held just before the February Revolution in 1917. On the new council, he became a member of the city's fire department, public education, and pawnshop affairs committees, and continued as a member of the committee for the protection of monuments of ancient buildings. However, in August 1917, a new council was elected, and 's political activities ceased. === Life in independent Estonia === In February 1918, at the time of the Estonian Declaration of Independence, expressed a desire to join the voluntary militia Omakaitse. As a student who wrote weapon permits for volunteers: \"Among those who wanted to make weapons, I only remember one: my physics teacher, von Wahl. I think I remember it because of the mood that might have arisen in the soul of a young student when his teacher asks him for a weapon.\"N. Rg. Koolipoisid. Isiklikke mälestusi meie iseseisvuse saabumispäevadelt [Personal Memoirs from the days of the beginning of our independence] (in Estonian). – Kaitse Kodu 1934, nr 4, p. 135. In 1919, the Secondary School of Science was divided by language: the Tallinn High School of Science taught in Estonian and the Tallinn German High School of Science taught in German. continued as a professor at the latter, where he taught classes in mathematics, physics, geography, cosmography, and drawing. He had a house on Eha Street, not far from the school, where students often went for follow-up work. He had designed this house in a marine style and it was therefore nicknamed the \"cabin\" by his students. Among his students, was a popular teacher who was particularly dedicated to teaching geography since he had travelled extensively. The students were impressed by the fact that was a member of the English Club, which operated at the school. De Wahl sometimes clashed with his colleagues, openly expressing his distaste for modern art, for instance comparing it to communism when invited to an art exhibition by the school's art teacher. retired in the mid-1920s, but continued to teach part-time until 1933. He then took up his hobbies, especially artificial languages, which had become a passion since the days of St. Petersburg. Additionally, he was editor of the magazine from 1929 to 1930. === During World War II === Unlike his relatives, did not leave to be in 1939, deciding to stay in Estonia. , who represented the idealistic pan-European idea, did not like the National Socialist government of Germany, calling it a \"termite state.\" Wahl may also have chosen to stay to avoid abandoning his large archive. The danger of ending up in a retirement home in Germany might also have played a role: this had happened to several of his acquaintances. De Wahl again avoided the to Germany that took place in the winter and early spring of 1941. He was certainly aware of the opportunity to leave, for when asked about his plans by one of his former students, he replied, leaving no doubt that his decision was stay in Estonia: In the first year of Soviet repression, managed to escape, although some of his relatives were arrested. After the beginning of the German occupation of Estonia, he was suspected of anti-state activities. was arrested on August 12, 1943, because of letters sent to Posen, to his wife's sister-in-law, that were caught by the censors in Königsberg in July of that year. In these letters, he had predicted the outbreak of an uprising in Poland and advised the family who lived there to go to Germany: In the same letter, noted that he had previously predicted the attack on Pearl Harbor and the later outbreak of war between the United States and Japan. During the interrogation did not deny what he had written, and repeated several of the accusations he had made, \"firmly believing\" in the veracity of his predictions. was held for some time in the Tallinn Labour and Education Camp, but the testimony given during his interrogation was considered strange by the Sicherheitsdienst, and so was sent to be examined at the . There he was diagnosed with dementia caused by ageing and he was left in the Seewald hospital, which also saved him from a possible death penalty. was defended by several close relatives and friends who claimed that he was not responsible for his actions. During the bombing raid in March 1944, 's house including his archive collection was destroyed, which came as a great shock to him. Three years later, in a letter to the Finnish Occidentalist A. Z. Ramstedt, he recalled that what had happened was a real disaster, during which many irreplaceable and unique materials were lost. === Last years and death === In August 1945 of the Germans still living in Estonia by the NKVD took place. The list of people to be deported included 's name. At the time of the deportation, however, was among a dozen people who were not deported or whose whereabouts could not be determined. Although the reasons for 's escape are not known, in some cases the head of the task force that carried out the deportation made the decision not to take the seriously ill or disabled, so the decision may have been influenced by the opinion of the hospital staff. Therefore, it was his presence in a mental hospital that saved de Wahl for a second time. During and after the war, his foreign colleagues had very little information about de Wahl's condition and location; only in the spring of 1946, the Finnish Occidentalist A. Z. Ramstedt was able to restore contact with de Wahl. It is unclear why the hospital staff at Seewald enabled such correspondence; perhaps that they may have recognized his dedication to linguistics when being supportive to his communication with the outside world. De Wahl died on March 9, 1948. He was buried on March 14 at the Alexander Nevsky Cemetery in Siselinna Cemetery, Tallinn. In 1996, his remains were moved to the , the family cemetery of the family. == Works == * * * * *, Edgar (1953). Spiritu de interlingue (in Interlingue). Cheseaux/Lausanne. == Related pages == *De Wahl's rule, a rule for word formation in Interlingue figured out by . == Notes == == References == === Sources === * * * * * * * * * * * * * * * * * Category:1867 births Category:1948 deaths Category:Interlingue Category:Linguists Category:Mathematicians",
 "title": "Edgar de Wahl"
}