{
 "id": "869508",
 "text": "Paolo Salvati (born 22 February 1939 in Rome – 24 June 2014 in Rome) was an Italian figurative artist, painter, and draftsman.Salvati, Paolo (1939-2014), Encyclopedia of Italian Art. His landscapes are the expression of poetic art, characterized by an intense chromatic tone as a metaphorical depiction of the inner world of man. ==Bibliography== * Catalog of Modern Art No. 45, Paul Levi, Daniela Brignone; Mario Guderzo; Lea Mattarella, \"The Italian Astist from the early twentieth century to today” (Gli Artisti Italiani dal Primo Novecento ad Oggi), Giorgio Mondadori, Milan, 2009, pp. 176–358. . * Catalog of Modern Art No. 46, Paul Levi, Daniela Brignone; Mario Guderzo; Lea Mattarella, \"The Italian Artist from the early twentieth century to today\" (Gli Artisti Italiani dal Primo Novecento ad Oggi), Giorgio Mondadori, Milan, 2010, pp. 192, 352–353. . * Catalog of Modern Art No. 47, in Paul Levi, Daniela Brignone; Mario Guderzo; Lea Mattarella, \"The Italian Astist from the early twentieth century to today\"( Gli Artisti Italiani dal Primo Novecento ad Oggi) Giorgio Mondadori, Milan, 2011, pp. 192–379. . * Enciclopedia d'arte italiana n°3, “Catalogo generale Artisti dal Novecento ad oggi”, Edizioni Enciclopedia d'Arte Italiana, Milano, 2014, pp.58-247. * Catalog of Modern Art No 48, in Paul Levi Young Faccenda; Daniela Brignone; Mario Guderzo; Lea Mattarella, \"The Italian Artist from the early twentieth century to today\"(Gli Artisti Italiani dal Primo Novecento ad Oggi), Giorgio Mondadori, Milan, 2012, pp. 27, 392, 401–404. . * Catalog, (Paolo Salvati 1939-2014 : geniale creazione visiva) Eredi Salvati, Roma, 2016. Bodleian Library, University of Oxford, Paolo Salvati 1939-2014 : geniale creazione visiva, Eredi Salvati, Roma, 2016 ==Related pages== * List of Italian painters == References == == Other websites == * * Official page on Facebook * Paolo Salvati, biography on Artprice.com * Paolo Salvati, biography on Mutualart.com * Paolo Salvati, biography on Askart.com Category:1939 births Category:2014 deaths Category:Italian painters Category:Rome",
 "title": "Paolo Salvati"
}