{
 "id": "869723",
 "text": "Zhiar Ali is a Kurdish person from Iraq who is a human rights activist, animal rights activist and journalist based in Sulaymaniyah. He is known for his work for LGBT rights in the Kurdistan Region of Iraq. Ali was the former media and communications officer at Rasan, he later founded Yeksani, a movement advocating for LGBT rights in the Iraqi Kurdistan. He had also co-founded the first pro-vegan animal rights organization Kurdistan Vegans. He has freelanced for news organizations, focusing on music journalism and political and social issues. Ali was attacked by the media in a campaign, the campaign was bigger and was against the LGBT community in 2020. After these attacks, he was threatened with murder and assault. The attacks started happening more after Ali did a Global Pride speech on June 27, 2020, organized by InterPride. He criticized Asayish and the Kurdistan Regional Government for an operation which detained LGBT people in Sulaymaniyah. The campaign took place after Asaiysh (local security forces) thought all gay people are sex workers, Ali tried talk about this mistake in a Middle East Eye interview. Denying that all members of the LGBT community in the Kurdistan region were sex workers, he blamed the government for forcing some into sex work and said that \"prostitution is the last choice to earn a living\". == Personal life == Ali is the youngest of five brothers and sisters. He said in a makanati.net interview that he came out to his mother and older sister in 2017 when he founded Lava Foundation, an unregistered organization working on raising awareness of LGBT issues. > Like the vast majority of society, my family approached [sexuality] close- > mindedly without having any information, they would insult [those who were > gay]. When I would spend time with them, sometimes, they would engage in > aggressive conversations and hurl insults towards LGBT people. [...] I would > leave the room silently because I felt like those insults were directed at > me. [...] I tried repeatedly to change and undergo a \"curative treatment\" to > no avail. I got to the conclusion that this is me, accepted myself, and > moved on. – Ali, on his experiences with his family and sexuality. In an interview with Queer Film Festival Utrecht, Ali talked about his relationship with his family, reporting that he was disowned and kicked out of the family house when he came out publicly, and receieved death threats from his brother. Ali has a plant-based lifestyle and co-founded Kurdistan Vegans in 2018, one of Iraq's first vegan organizations which focused on environmentalism as well as raising awareness about \"a healthy lifestyle\" at the same time as raising awareness about a vegan lifestyle. A vegan for five years, he had discussed the difficulties of the lifestyle in Iraq; vegan products are scarce, difficult to find, and often overpriced. During an interview, he claimed that before their work at Kurdistan Vegans, there were no dedicated vegan restaurants, but after their advocasy, one was announced in his region. == Career == === Activism === Ali began his activism in 2017 with Lava Foundation which did not last for a long time, and was hired by Rasan in late 2019; Lava Foundation activities were then carried out in Rasan. After more than a year with Rasan, Ali left the organization and founded Yeksani. Ali's activism focuses on raising awareness of regional LGBT community issues, letting the public know about the community's needs and wants and international actors to encourage action, and normalizing the community in Kurdish society. He emphasizes that LGBT+ living conditions in Kurdistan are poor due to a lack of public awareness. > Gay people should be protected by law and not discriminated against, > [homosexuality] is a natural human desire, not an illness. Every workplace > should be legally forced to be inclusive to LGBT people in job > oppertunities, and even the local security forces need to treat them better. > – Ali to Kurdish news outlet Peregraf in an interview. Ali mostly uses social media for his activism. He regularly raises awareness about the legal laws used to put LGBT people in jail, and said in a BBC Persian interview that Articles 393, 394, 400, and 401 of Iraqi law are used to illegally detain LGBT people. Ali was also an animal rights activist and a former project manager of Kurdistan Vegans, where he arranged and coordinated World Vegan Day events for two years in a row. He was a journalist with Spee Media, a local independent news outlet. He was focusing there on music journalism, and most of his work featured Wild Fire. He also wrote about conflict in the Middle East, LGBT+ rights in Iraq, and social and civic issues. On May 17, 2020, the European Union (EU), British, and Canadian embassies raised the pride flag in their Baghdad headquarters, which caused a massive backlash, forcing the EU embassy to take down the flag after a few hours. This caused a hate campaign against the LGBT community of Iraq which was supported by visible Iraqi politicians. Ali wrote an extensive report about the progression and worsening situation of LGBT people in Iraq which was hosted on Rasan's website, reporting murder of people precieved to be gay, as well as messages of hate broadcast on national TV. The report was later used for assessments and further studies regarding LGBT rights in the region. During an interview, Ali discussed the difficulties with being part of the LGBT+ community and finding housing, reporting that many LGBT youth are denied rent or properties are not sold to them, so they are forced to get married to the opposite gender only to have a place to live in. He also talked about how the Directorate of Non-Governmental Organizations have made it impossible to register LGBT organizations in the region. ==== Asayish operation ==== On April 1, 2021, news said that Asayish set checkpoints around Sulaymaniyah and detained some people they thought were gay. Although a lot of people expressed anger on social media at the operation, seventeen members of Sulaimaniyah's Provincial Council signed a petition supporting the arrests. Ali led Take Action, an online campaign through Yeksani which received broad global support, and helped bring the issue to the attention of Amnesty International, the US Consulate in Erbil, Human Rights Watch, ILGA Asia, and other international, national, and local groups. The decision to conduct the operation was influenced by conservative groups in the region, especially the Kurdistan Justice Group. According to Ali, 15 individuals (some underage) were apprehended by the operation and security checkpoints were set up in places thought to be popular with LGBT people. He said that Asaiysh did not differentiate between LGBT sex workers and other community members or later focused their operation on prostitution to avoid international backlash. Ali highlighted security forces' \"tests\" on suspects to determine if they had sexual contact before their arrests, calling the tests criminal and humiliating. He told Middle East Eye that \"even if people resorted to sex working, it's the government's fault since it's their last choice of livelihood.\" Ali repeatedly told the media that community lives were in danger, and he was afraid to be caught at one of the checkpoints since he is openly gay. After local and international pressure from civil-rights organizations and activists, Asayish stopped the operation, released the detainees, and published a statement that they were investigating reports of prostitution in the region and did not \"target any specific groups of society.\" Due to discrimination, followed by the operation, Ali reported that many LGBT people (including himself) felt excluded from Kurdish society. Many others also called the operation dehumanizing and criminal. Ali critisized other NGOs that claim to work on LGBT rights, and said \"while they are getting massive funds, they take no action in reality\", and recognized them as symbolic entities. ==== Rasan lawsuit ==== On February 22, 2021, it was announced that a lawsuit had been filed against Rasan by an Islamist Kurdistan Justice Group MP because the organization advocated for local LGBT+ rights and this was \"against the values of the Kurdish culture.\" In response to the accusation, Rasan said they would defend themselves against the lawsuit in court and they work for everyone equally. Ali spoke against the MP during a live Rudaw interview, defending the LGBT+ community and saying that the MP's comments were \"baseless and not based on any scientific evidence.\" == References == Category:Kurdish people Category:Iraqi people Category:Singer- songwriters Category:LGBT rights activists Category:Animal rights activists Category:Journalists",
 "title": "Zhiar Ali"
}