{
 "id": "8697",
 "text": "The National Hockey League or NHL, is the highest-level ice hockey league in the world. It has 32 teams - 7 from Canada and 25 from the United States. The championship trophy is the Stanley Cup. The NHL were founded in 1917. There were five original teams in 1917: * Montreal Canadiens * Montreal Wanderers * Ottawa Senators (later St. Louis Eagles; not related to the current Ottawa Senators) * Quebec Bulldogs (later Hamilton Tigers) * Toronto Arenas (later St. Patricks, then Maple Leafs) They played 22 games a year. The Wanderers had to stop playing in the first year because their arena burned down. Over the years some teams died out, and others were created: the Boston Bruins, New York Americans, Montreal Maroons, Pittsburgh Pirates (later Philadelphia Quakers), New York Rangers, Chicago Black Hawks and Detroit Cougars (later Falcons, then Red Wings). Some teams folded during the Great Depression, so by 1942 there were only six teams: * Boston Bruins * Chicago Blackhawks * Detroit Red Wings * Montreal Canadiens * New York Rangers * Toronto Maple Leafs There were only these six teams for 25 years, so they became known as the \"Original Six\". By the 1940s, they were playing 50 games a year, but this increased slowly to 80 games by the 1970s. In 1967, the league increased to 12 teams. By 1979 it had 21 teams, and today it has 32. Some of the teams that no longer exist are the Oakland Seals, Minnesota North Stars (now the Dallas Stars), Winnipeg Jets (now the dormant Arizona Coyotes), Kansas City Scouts (which became the Colorado Rockies and are now the New Jersey Devils), Hartford Whalers (now the Carolina Hurricanes), Quebec Nordiques (now the Colorado Avalanche) and Atlanta Thrashers (now the current Winnipeg Jets). Today they play 82 games a year, plus four rounds of playoffs. The players make a lot of money (many make over a million dollars a year). Because they could make so much money, many Europeans came over to North America to play in the NHL. Today almost all the world's best hockey players are in the NHL. ==List of teams== Division Team City Arena Capacity Founded Joined General manager Head coach Captain Eastern Conference Atlantic Boston Bruins Boston, Massachusetts TD Garden 17,850 1924 Don Sweeney Jim Montgomery Brad Marchand Buffalo Sabres Buffalo, New York KeyBank Center 19,070 1970 Kevyn Adams Lindy Ruff Rasmus Dahlin Detroit Red Wings Detroit, Michigan Little Caesars Arena 19,515 1926 Steve Yzerman Derek Lalonde Dylan Larkin Florida Panthers Sunrise, Florida Amerant Bank Arena 19,250 1993 Bill Zito Paul Maurice Aleksander Barkov Montreal Canadiens Montreal, Quebec Bell Centre 21,302 1909 1917 Kent Hughes Martin St. Louis Nick Suzuki Ottawa Senators Ottawa, Ontario Canadian Tire Centre 18,652 1992 Steve Staios Travis Green Brady Tkachuk Tampa Bay Lightning Tampa, Florida Amalie Arena 19,092 1992 Julien BriseBois Jon Cooper Victor Hedman Toronto Maple Leafs Toronto, Ontario Scotiabank Arena 18,819 1917 Brad Treliving Craig Berube Auston Matthews Metropolitan Carolina Hurricanes Raleigh, North Carolina Lenovo Center 18,680 1972 1979* Eric Tulsky Rod Brind'Amour Jordan Staal Columbus Blue Jackets Columbus, Ohio Nationwide Arena 18,144 2000 Don Waddell Dean Evason Boone Jenner New Jersey Devils Newark, New Jersey Prudential Center 16,514 1974* Tom Fitzgerald Sheldon Keefe Nico Hischier New York Islanders Elmont, New York UBS Arena 17,113 1972 Lou Lamoriello Patrick Roy Anders Lee New York Rangers New York City, New York Madison Square Garden 18,006 1926 Chris Drury Peter Laviolette Jacob Trouba Philadelphia Flyers Philadelphia, Pennsylvania Wells Fargo Center 19,500 1967 Daniel Briere John Tortorella Sean Couturier Pittsburgh Penguins Pittsburgh, Pennsylvania PPG Paints Arena 18,387 1967 Kyle Dubas Mike Sullivan Sidney Crosby Washington Capitals Washington, D.C. Capital One Arena 18,506 1974 Chris Patrick Spencer Carbery Alexander Ovechkin Western Conference Central Chicago Blackhawks Chicago, Illinois United Center 19,717 1926 Kyle Davidson Luke Richardson Nick Foligno Colorado Avalanche Denver, Colorado Ball Arena 18,007 1972 1979* Chris MacFarland Jared Bednar Gabriel Landeskog Dallas Stars Dallas, Texas American Airlines Center 18,532 1967* Jim Nill Peter DeBoer Jamie Benn Minnesota Wild Saint Paul, Minnesota Xcel Energy Center 17,954 2000 Bill Guerin John Hynes Jared Spurgeon Nashville Predators Nashville, Tennessee Bridgestone Arena 17,113 1998 Barry Trotz Andrew Brunette Roman Josi St. Louis Blues St. Louis, Missouri Enterprise Center 18,724 1967 Doug Armstrong Drew Bannister Brayden Schenn Utah Mammoth Salt Lake City, Utah Delta Center 12,000 2024 Bill Armstrong André Tourigny Clayton Keller Winnipeg Jets Winnipeg, Manitoba Canada Life Centre 15,321 1999* Kevin Cheveldayoff Scott Arniel Adam Lowry Pacific Anaheim Ducks Anaheim, California Honda Center 17,174 1993 Pat Verbeek Greg Cronin Radko Gudas Calgary Flames Calgary, Alberta Scotiabank Saddledome 19,289 1972* Craig Conroy Ryan Huska Mikael Backlund Edmonton Oilers Edmonton, Alberta Rogers Place 18,347 1972 1979 Stan Bowman Kris Knoblauch Connor McDavid Los Angeles Kings Los Angeles, California Crypto.com Arena 18,230 1967 Rob Blake Jim Hiller Anze Kopitar San Jose Sharks San Jose, California SAP Center 17,562 1991 Mike Grier Ryan Warsofsky Logan Couture Seattle Kraken Seattle, Washington Climate Pledge Arena 17,151 2021 Ron Francis Dan Bylsma Jordan Eberle Vancouver Canucks Vancouver, British Columbia Rogers Arena 18,910 1945 1970 Patrik Allvin Rick Tocchet Quinn Hughes Vegas Golden Knights Paradise, Nevada T-Mobile Arena 17,356 2017 Kelly McCrimmon Bruce Cassidy Mark Stone Inactive Western Conference Central Arizona Coyotes Phoenix, Arizona TBD – 1972 1979* – – – # An asterisk (*) denotes a franchise move. See the respective team articles for more information. # The Edmonton Oilers, Hartford Whalers (now Carolina Hurricanes), Quebec Nordiques (now Colorado Avalanche), and original Winnipeg Jets (now Arizona Coyotes) all joined the NHL in 1979 as part of the NHL–WHA merger. ==Related pages== * History of the National Hockey League ==Notes== ==References== == Other websites == * Official NHL website Category:National Hockey League Category:1917 establishments in North America",
 "title": "National Hockey League"
}